{
    "Weekly Progress Megathread!": {
        "title": "Weekly Progress Megathread!",
        "score": 4,
        "url": "https://www.reddit.com/r/1200isplenty/comments/1dms3o1/weekly_progress_megathread/",
        "content": "Congrats, [/r/1200isplenty](https://www.reddit.com/r/1200isplenty)! \n\nPlease share your progress pictures, calorie log screenshots, written  descriptions, or any other method you choose to display your victories   (no matter how big or small!).\n\nIf you choose to share a picture of your body, please include your **height** and **weight** in **each photo** you post and the **time span** between them.\n\n**Community members, please be generous with your upvotes and encouragement :)** .",
        "num_comments": 5,
        "comments": [
            "I am wearing a pair of size 1x shorts and they are perfectly comfortable! (I have not been lower than a 2x for years—nay, more than a decade.)",
            "Was wondering why I was having a plateau despite logging everything to the gram and exercising. Tried MacroFactor and it told me to reach my goal at my desired pace, I actually have to eat around 900 calories a day. Oh well, that explains it then. Add to that that my smartwatch probably overestimates my exercise calories and the riddle is solved.",
            "I really don’t like tracking calories because anything that requires tracking is pretty difficult for me. Has anyone here created a meal plan of 1200 calories and just stuck with it until they got bored and created a new one? If so, could you share your experience and lessons learned?",
            "My weight over the last couple years, Jan 1 started 1200 + exercise. \n\nhttps://preview.redd.it/yadc8cusnm8d1.png?width=1358&format=png&auto=webp&s=cf92cc52127313a1e4a3fe6371bf2ea1a2026404",
            "https://preview.redd.it/5f042v1ok49d1.jpeg?width=1027&format=pjpg&auto=webp&s=c4f220a0c312d1ec50238777871ba3e0757cdc05\n\n5’ 3.5” 129 lbs, starting to see some progress in my arms 💪"
        ]
    },
    "Thank you. Truly. ": {
        "title": "Thank you. Truly. ",
        "score": 27,
        "url": "https://www.reddit.com/r/1200isplenty/comments/1dr4l29/thank_you_truly/",
        "content": "Last night, my 13 year old daughter posted in here looking for validation for eating less. \n\nWe’ve been working through this together for a while, but the last few days, it’s like she’s in free fall. \n\nI looked through her phone to see if I could find out what was troubling her. \n\nAnd I came across her post here. \n\nAs a rule, she’s not allowed on Reddit, but in this case, it was a good thing, because each and every one of you who replied gave her good advice. \n\nThank you, truly. It’s one thing to hear it from your mom, it’s quite another to hear it from a group of internet strangers who are all giving you sound advice. \n\nPS We’ll be going to her therapist more frequently and working on fixing the hurt in her heart. If you’ve been through an ED and have any specific advice for me on how to help her, feel free to DM me, I’d appreciate any help we can get. (As long as it doesn’t trigger you, of course.) ",
        "num_comments": 1,
        "comments": [
            "we hope she gets the help she needs! i remember that post and was concerned for her. good luck to you both"
        ]
    },
    "full day of eats (1412 calories 91g protein)": {
        "title": "full day of eats (1412 calories 91g protein)",
        "score": 133,
        "url": "https://www.reddit.com/gallery/1dqu38a",
        "content": "I’m so close to my goal weight now\n\nbreakfast: oatmeal with quark and raspberries\n\nlunch: banana oatmeal with quark, strawberries and blueberries\n\ndinner: chicken breast and quinoa salad with chickpeas, sundried tomatoes, red onion and lemon juice + feta cheese cream (made of quark)\n\nevening snack: full fat turkish yogurt with mango\n\n\n\n",
        "num_comments": 30,
        "comments": [
            "Im dangerously close with developing a parasociam relationship with you and your Quark posts \n\nBy the way, I was wondering if you also eat the same cold quark during winter?",
            "Not enough quark tbh",
            "You've got me looking for quark all over town (Whole Foods is supposed to have it, will check tomorrow). I'd never heard of it until you started sharing your meals starring quark...high in (casein) protein and it's gotta be good with as much as you eat haha.",
            "How do you make your oatmeal (what’s the quantity of oats to liquid)? It looks so much better than mine!!",
            "Having a rough day and this sparked joy. How do you make the feta quark situation?",
            "i must find quark in the states.",
            "What’s quark?",
            "Does a diet like this make you sprinkle the porcelain on the way out?",
            "Quark has been such a lifesaver for me.",
            "You've inspired me to give quark a try!"
        ]
    },
    "dinner for my inner child - 413cal, 25g protein": {
        "title": "dinner for my inner child - 413cal, 25g protein",
        "score": 41,
        "url": "https://i.redd.it/w1m8346bbf9d1.jpeg",
        "content": "I keep frozen chicken tenders in my freezer for when I absolutely cannot be bothered...and it's been a long week! They're Perdue SimplySmart Breaded Chicken Breast Tenders (what a mouthful) and it's 210 calories and 13g protein for three. I air fry them so they’re nice and crispy too 🍗\n\nThe ranch is fat free green yogurt and ranch mix, the fruit and veggies are for \\~nutrients\\~. I feel like a kid, but it certainly scratched an itch. Cheers to the weekend :) ",
        "num_comments": 3,
        "comments": [
            "Amazing looks great",
            "Haha...greek yogurt, not \"green\" yogurt. Like I said, long week.",
            "I love those chicken strips!!"
        ]
    },
    "full day of eating 1360 calories 100g protein": {
        "title": "full day of eating 1360 calories 100g protein",
        "score": 12,
        "url": "https://www.reddit.com/gallery/1dr2s3l",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}