{
    "Most recent updated trans safety (and trans youth safety) maps of the US. ": {
        "title": "Most recent updated trans safety (and trans youth safety) maps of the US. ",
        "score": 4270,
        "url": "https://i.redd.it/b0t3qxwsymqc1.jpeg",
        "content": "",
        "num_comments": 428,
        "comments": [
            "The warning stripes on that little southern fellow are spooky",
            "What do the stripes on Florida indicate?\nDo trans people instantly die if they enter the state?",
            "What does this map mean, wheres the map legend op how am i supposed to read it",
            "Bigotry weather",
            "\"The two parties are the same bro\"",
            "You know Florida is really bad because it gets its OWN FUCKING COLOR",
            "Man I love living in the most dangerous state for genderqueer/general LGBT people :3",
            "I like how Hawaii just say hi there",
            "Ayo was there a key or legend for this map? Realistically I could go out on a limb and probably somewhat accurately assume what the colors mean, but I wanna know for sure!",
            "why does this world suck so fucking bad man i’m losing hope"
        ]
    },
    "A request to all EU citizens: Help ban conversion practices in the European Union!": {
        "title": "A request to all EU citizens: Help ban conversion practices in the European Union!",
        "score": 536,
        "url": "https://eci.ec.europa.eu/043/public",
        "content": "",
        "num_comments": 41,
        "comments": [
            "Hello everyone!\n\nThere's currently a European Citizens' Initiative (or ECI) that aims to ban conversion therapy. An ECI is somewhat between a petition and a law proposal. If the ECI succeeds the ban on conversion therapy will be directly proposed to the European Commission. This doesn't mean it's guaranteed to be enacted but it sure raises the chances!\n\nIf you're a citizen of the EU and above the age of 16 please consider signing!",
            "I’m such a fucking idiot I went to sign but I live in the UK 😭",
            "Why isn't this already a thing? Jesus.",
            "Commenting for boost as I’m not in the EU",
            "boosting this here is so based",
            "i did my part",
            "Signed, vittuun tämä eheytyshoito, paskiaiset voi paalaa tulessa enkä edes kusisi niiden päälle sammutaakseni",
            "I'm EU but I'm too young to vote there since my country requires me to be 18+ :(\ngonna try and convince my parents to sign it though",
            "Signed. Was not aware this was still legal wtf.",
            "🫡"
        ]
    },
    "Gigapaws Rule": {
        "title": "Gigapaws Rule",
        "score": 652,
        "url": "https://v.redd.it/35762o42h28d1",
        "content": "",
        "num_comments": 39,
        "comments": [
            "#[DOWNLOAD IT HERE YOU FUCK](https://rapidsave.com/info?url=https://www.reddit.com/r/196/comments/1dlp90f/gigapaws_rule/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/196) if you have any questions or concerns.*",
            "common robot combat w\n\n(also watch battlebots robot wars and NHRL)",
            "I can't stop thinking of gigapaws coming at me in a dark hallway, and me being paralyzed so i can't run away so it just rams into me and flaps it's paw and net on me as I lay there limp.",
            "Omgor gay robot :3 gay robot :3 :3 :3",
            "Imagine being crushed to death by a gigantic robot named gigapaws and the last thing you see is #transrights 🥰🏳️‍⚧️🌈😊",
            "pawsitively hysterical was already a goated bot, and now they come up with this, NHRL is the best fucking robot fighting league ever. You all should see the other amazing bots from there like mixtape, hot wings, project liftoff, depth charge, Power of Friendship, and that one children hospital robot. I love this league, way better than battlebots imo. \n\nMost of the builders in battlebots are in NHRL too, and tons of people test their designs in the lower weight classes before going to the heavy weight classes in the televised ones, you’ll see small original versions of robots like Huge and Sawblaze down here driven by the same team. Huge was a lower weight class bot first and it actually works way way better in the lower weight classes.",
            "For Whom The Bell Tolls goes crazy here",
            "What is Flo? Is it the referee?",
            "This will start a discourse about trans robot in the sport and their technological advantage",
            "[I like the smaller one better tbh](https://youtube.com/shorts/WGLntDvhd8g?si=qH3Ewyf8WkSqLh9U)"
        ]
    },
    "Rule": {
        "title": "Rule",
        "score": 653,
        "url": "https://v.redd.it/ttqp4th1d28d1",
        "content": "",
        "num_comments": 28,
        "comments": [
            "#[DOWNLOAD IT HERE YOU FUCK](https://rapidsave.com/info?url=https://www.reddit.com/r/196/comments/1dlowr0/rule/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/196) if you have any questions or concerns.*",
            "Dovahcunt, you must outmother Alduin or this world is doomed.",
            "Slayrim",
            "https://preview.redd.it/i8uvb95zc38d1.jpeg?width=640&format=pjpg&auto=webp&s=7d84ec1bcc19576eeb003da0b0dfd9cba1ad6ba0",
            "https://preview.redd.it/chaioqdcg28d1.jpeg?width=1300&format=pjpg&auto=webp&s=993b751006a088f5adc02c863f8071cc59eab7c2",
            "Shor's bones! A handsome man in Falkreath!\n\n(I know it's Riverwood, but whatever.)",
            "The women npc\n\nhttps://preview.redd.it/v3x22m1kh38d1.png?width=2792&format=png&auto=webp&s=e6198f5beb94f027abdb0ebd92550a2739fd80d6",
            "Gay skyrim :3 :3 :3",
            "bloodskal blade projectile",
            "Skyrim if it was good"
        ]
    },
    "i miss my tr(ule)ollface emote :(": {
        "title": "i miss my tr(ule)ollface emote :(",
        "score": 2782,
        "url": "https://i.redd.it/trmls43iuz7d1.png",
        "content": "",
        "num_comments": 147,
        "comments": [
            "U mad?\n\nhttps://preview.redd.it/nro96tuh908d1.png?width=1080&format=pjpg&auto=webp&s=1c1e8ab7c6e87ed400e6f83425d3696e70cf4e09",
            "[removed]",
            "Infamous 2b2t hacker PopBob",
            "Average tf2 interaction tbh",
            "You did the right thing",
            "Was it worth it?",
            "Do you have another emote?",
            "TF2 is fucking wild because you’ll have trans catgirls and uber racist neonazis in the same server",
            "Did you ask or did she offer?",
            "...would she be open to more emotes?"
        ]
    }
}