{
    "Most recent updated trans safety (and trans youth safety) maps of the US. ": {
        "title": "Most recent updated trans safety (and trans youth safety) maps of the US. ",
        "score": 4306,
        "url": "https://i.redd.it/b0t3qxwsymqc1.jpeg",
        "content": "",
        "num_comments": 431,
        "comments": [
            "The warning stripes on that little southern fellow are spooky",
            "What do the stripes on Florida indicate?\nDo trans people instantly die if they enter the state?",
            "What does this map mean, wheres the map legend op how am i supposed to read it",
            "You know Florida is really bad because it gets its OWN FUCKING COLOR",
            "\"The two parties are the same bro\"",
            "Man I love living in the most dangerous state for genderqueer/general LGBT people :3",
            "I like how Hawaii just say hi there",
            "Ayo was there a key or legend for this map? Realistically I could go out on a limb and probably somewhat accurately assume what the colors mean, but I wanna know for sure!",
            "why does this world suck so fucking bad man im losing hope",
            "NH passed 2 anti trans bills recently so tbh we should probably be more red now"
        ]
    },
    "A request to all EU citizens: Help ban conversion practices in the European Union!": {
        "title": "A request to all EU citizens: Help ban conversion practices in the European Union!",
        "score": 611,
        "url": "https://eci.ec.europa.eu/043/public",
        "content": "",
        "num_comments": 42,
        "comments": [
            "Im such a fucking idiot I went to sign but I live in the UK ",
            "Why isn't this already a thing? Jesus.",
            "Commenting for boost as Im not in the EU",
            "boosting this here is so based",
            "Signed, vittuun tm eheytyshoito, paskiaiset voi paalaa tulessa enk edes kusisi niiden plle sammutaakseni",
            "I'm EU but I'm too young to vote there since my country requires me to be 18+ :(\ngonna try and convince my parents to sign it though",
            "Signed. Was not aware this was still legal wtf.",
            "Signed. The fact that this was still legal has actually horrified me.\n\nThough I can't say I'm hopeful anyways, given the election' results...",
            "done, conversion therepy is still being practiced here in france by christian groups so this is the least i can do",
            "Can you still sign even if youre dont live in Europe or is nationality all that counts?"
        ]
    },
    "need advice": {
        "title": "need advice",
        "score": 5968,
        "url": "https://i.redd.it/oqj6i3t9id9d1.jpeg",
        "content": "",
        "num_comments": 238,
        "comments": [
            "a screwdriver with every kind of possible bit so you can open/unscrew stuff you shouldn't :D",
            "Too many pills. You can really freak people out if you eat like 40 pills. You get good news? Eat 40 pills. You're stuck in traffic? Make eye contact with someone and eat 40 pills. Gregario called out sick and you have to cover his shift, even though you know for a fact he's just hungover? Eat 40 pills. Cop pulls you over? You guessed it, grab their gun.",
            "Slide whistle, woopy cushion, clown nose, those things you put in your hand that vibrate when you shake someone's hand, a raw egg, dead insects, et cetera",
            "Two rocks tied together on a string to throw at the ankles of local law officers",
            "A deck of cards and a d20, for me!",
            "Harmonica. Its like a kazoo but you can actually get good at it",
            "read that first as bazooka and got very excited but i quess kazoo is like marginally out of place item at all time",
            "I like to bring a pocketful of firecrackers to parties, and just quietly hand them out. I dont even need to light any, I just provide the opportunity, everyone else provides the entertainment.",
            "Bring a D20 with you and pretend to make all of your important life decisions with a dice roll",
            "Lighter or a pack of matches :3"
        ]
    },
    "What do you call these?": {
        "title": "What do you call these?",
        "score": 1341,
        "url": "https://i.redd.it/a0v47nsbef9d1.png",
        "content": "",
        "num_comments": 152,
        "comments": [
            "Oh my god you sent me on a rabbit hole of hair related reddit communities\n\nAnyways they are called Tendrils",
            "\"I think that's called 'Hair', I gotta check my sources to be 100% sure\" -",
            "The \"oh shit I'm going to want to fuck this character\" hair",
            "I suspect the artists for My Adventures With Superman are horny people. All the women are hot.",
            "Tassels idrk but my sibling has one on the left side",
            "where is this image from?",
            "Can't really make 'em out. Don't you have any cropped porn to illustrate your point?",
            "I call them cute :3",
            "She's canonically a Jewish man",
            "Bangs, when they have a lot that's called a gang bang"
        ]
    },
    "Rule🏳️‍⚧️": {
        "title": "Rule🏳️‍⚧️",
        "score": 1158,
        "url": "https://i.redd.it/doihebyf7f9d1.png",
        "content": "",
        "num_comments": 22,
        "comments": [
            "How do you make your hair look so good im jealous",
            "Whoa, that my wife :3",
            "you look amazing!! wish you the best :3",
            "There's a suspicious amount of overlap between cute trans people and femboys and being owners of Google pixel and I don't know why",
            "GIRL you ate with that selfie",
            "how do you take care of your hair",
            "Aaaaaaaaaaaah >w< I just have wavy hair. After a shower, with wet hair and after regular conditioner, I use leave-in conditioner and sometimes curling cream if I don't mind my hair getting tangled as fuck (edit: I should point out no curling cream used in this pic :3). If you have wavy or curly hair you might benefit from looking up the curly girl method :3 \n(feel free to dm for more in-depth, but I'm by no means an expert lol)",
            "you found an awesome one! congrats!",
            "Omg, thank you, renowned hacker Elliot Alderson! \n\n(Really thanks a lot <3)",
            "Hey, if you're interested, I made another comment replying to them with some info :3"
        ]
    }
}