{
    "Have a question about the game or the subreddit? Ask away!": {
        "title": "Have a question about the game or the subreddit? Ask away!",
        "score": 5,
        "url": "https://www.reddit.com/r/2007scape/comments/1dqy1qc/have_a_question_about_the_game_or_the_subreddit/",
        "content": "# Welcome to the daily /r/2007scape question thread!\n\nYou can ask anything about Old School RuneScape here. They are designated for you to ask anything you like that is relevant to the game or this subreddit. Remain respectful to your fellow 'scapers when answering questions; there are stupid questions, but it does not mean you should not be respectful whilst answering them.\n\nKeep in mind that this is not a developer Q&A thread - questions for the game developers should be posted in the weekly developer Q&A posts.\n\nClick [here](https://reddit.com/r/2007scape/search?q=author%3AAutoModerator&restrict_sr=on&sort=new&feature=legacy_search) to view the archive of /r/2007scape \"ask anything\" threads.",
        "num_comments": 37,
        "comments": [
            "If I unlock a combat achievement tier, claim the hilt / rewards, and then new bosses are released down the line and I fall out of my tier do I keep the rewards? I know I’ll still have the hilt in my bank but would the clue scroll odds improvement and other things still be active?",
            "So as I've been AFKing ammonite crabs on my iron, I've been collecting unidentified fossils whenever I happen to look over at my 2nd monitor and see them on the ground without knowing what they actually do. I finally looked it up and found out that they can be turned into quite a bit of prayer xp, but I need calcyte and pyrophosphite for that process. Problem is, I haven't been collecting these at all. What's a good way for an iron to farm these items?",
            "Am i correct in reading that if i am able to catch an impling bare handed, there is no point in the magic net?",
            "If I want to retain my slayer streak, is the most efficient way of getting points doing the easiest master through tasks 1-9 then doing konar on the 10th, or spamming Duradel? Max combat, will use cannon, etc.",
            "I have a lot of portal rooms and portals already, so I don’t feel like adding very basic ones like Varrock etc. so I can use NPC contact for mahogany homes on my iron. I’m 71 now, have 85+ banked. Have done high construction a few times and 99 once but early to mid game mahogany homes confuses me. I reckon you just rough it with regular spellbook and teleport to Falador for Amy in person til 83-85ish to make an almost max POH then? Or could some Jewelry box soon benefit me? Seems lame to rough it but at the same time it’s also rather fast to grind out the 12-15 or so levels and just max out my POH. Any tips, tricks, or advice on the matter?",
            "No. When the required points for a tier change with a new set of CA's being released, you will lose all perks of  the tier that you fall out of. This includes clue increases, god wards kc, cannon capacity, and usage of hilts/helms.",
            "You’ll have to re-earn it, otherwise people could have a zuk helm without all the tasks done",
            "No, if you fall out of a CA tier, you lose those rewards. They stay in your bank, but you can't interact with the items outside of withdrawing, depositing, and dropping. If you attach your hilt to your avernic, you'll have to unattach it to use your avernic.",
            "For gp? No, it's not worth it in the slightest.\n\nFor experience? Absolutely. If you're having trouble making prep time in regular gauntlet, CG is going to be way too fast for you. Keep doing regular gauntlet until you can at least make the CG prep time. Then switch over to CG to actually make some money.",
            "CG will be immensely rough with those stats, so I wouldn't recommend it. Instead you'd probably be better served by other midgame content, like wildy bosses or perilous moons. Make sure you're doing your herb runs as well because they really do add up over time"
        ]
    },
    "Proposed Run Energy Changes & Open Beta (Live now!)": {
        "title": "Proposed Run Energy Changes & Open Beta (Live now!)",
        "score": 276,
        "url": "https://secure.runescape.com/m=news/a=13/run-energy-changes?oldschool=1",
        "content": "",
        "num_comments": 1564,
        "comments": [
            "Extremely disappointed by this proposal…I think we were all expecting drain rate to improve as agility is leveled. Which i guess it does, but at the cost of a huge nerf to any sort of pvm or activity that requires gear and/or resources of significant weight? \n\nCan this proposal be reworked in a way so that it’s not super punishing please?",
            "Making drain rate even more heavily dependent on weight is only going to make graceful more important to wear. Removing the 30% increased regen rate from Graceful isn’t a way to make Graceful less of a requirement, it’s a way to “balance” Graceful since the run energy changes are going to make it even more important.\n\nAll of these changes feel like nerfs disguised as buffs.",
            "DO NOT MAKE DRAIN RATES WITH HEAVY GEAR ANY WORSE THAN THEY ARE NOW!!!!",
            "How is it possible to miss the mark this bad? Really feels like they've throw random numbers at it without testing it once.\n\nIn max gear solo olm will require like 3-4 stams now which is bonkers",
            "So for people running around in raiding gear, the run energy problem is getting worse?",
            "Man imagine running rooftops for over 200 hours and your run will deplete even faster than it does today... This run energy update should be a net positive in every single aspect because currently, quite frankly, its dogshit.",
            "I thought 99 agility would finally be VERY rewarding and significant, but with this proposal 99 agility drain rate will be worse in some cases. What",
            "Just please don't make content feel worse to play. If you're gonna touch run energy at all it needs to feel better at all levels. Not worse. Otherwise I wouldn't want you guys changing anything else because you will be okay with changes making gameplay feel worse.",
            "When I read that higher agility will offset the drain rate I was imagining something along the lines that 99 agility will give you a permanent 32kg weight reduction. So at 99 agility and with 64kg or higher weight only 32kg actually gets used for the drain rate. This would make changing drain rate at all not really needed, could remove the weight reduction on graceful entirely, would still give ring of endurance and stams their place in the game and make high agility actually feel rewarding. Keep the regen rate buffs and boom everyones happy.",
            "So the rebalancing youre suggesting is making literally everything worse except for when you're running naked/no weight. This is horrible and not what we asked for. It's supposed to get better or stay the same, not get worse. How can you be so out of touch with your game and it's community? "
        ]
    },
    "What the hell? I sold red gloves for 1K and got 8M for it through GE": {
        "title": "What the hell? I sold red gloves for 1K and got 8M for it through GE",
        "score": 1525,
        "url": "https://i.redd.it/cq7201kv4d9d1.png",
        "content": "",
        "num_comments": 164,
        "comments": [
            "They thought it was dragon claws 😭",
            "Nice! I had this happen with monkey nuts once for 1M. ",
            "People use low volume, easily obtained items in GE to swap gold since it makes tracking harder. They lose some gp this way to random orders like yours, but it allows them to send gold between accounts without being tracked since the accounts never have to directly interact.",
            "Random lucky snipe. I put some random item in for 1m and it sold for 20m. I think someone was swapping gold or something thru the GE. Grats",
            "gold seller item. seller buys all availible copies. gold seller has offer in at absurd price. gold buyer sells item. you just got there first.",
            "Probably caught some rwt in action by chance",
            "one mans trash another mans treasure",
            "buyer had an existing 8m offer in, you sell for 1k, GE fulfills for 8m.",
            "Is that how GE works? I always get gold back if my buy price is too high",
            "you sniped a RWT gj"
        ]
    },
    "Agility Rebalance—Why are we over complicating this?": {
        "title": "Agility Rebalance—Why are we over complicating this?",
        "score": 1754,
        "url": "https://www.reddit.com/r/2007scape/comments/1dqoqwy/agility_rebalancewhy_are_we_over_complicating_this/",
        "content": "There’s no need to over complicate this. We want Agility to be more rewarding, and stamina drain to feel less tedious to manage. \n\n**Reduce the rate at which stamina drains the higher your Agility level is.**\n\n*That’s it.*\n\nI don’t know why we’re messing around with the current weight system. Why we’re making drain rate worse at higher levels with heavier load-outs. Or why we’re trying to make someone with level 1 agility at zero weight have the same drain rate as someone with level 99. \n\nMake the skill rewarding. Making it so you actually see a tangible benefit for leveling it. \n\nSo yes, that means buffing it. \n\n“But what about certain PvM encounters like Solo Olm or Saradomin? What about certain skilling activities like Herbiboar or Blast Furnace? What about wilderness activities?”\n\nBuff them. That’s right—we want Agility buffed. That’s what we’re asking for. In order to address the issues mentioned—making the skill more rewarding, and stamina less tedious to manage—it requires buffing it. And that can simply be accomplish by **reducing the rate at which your stamina drains the higher your Agility level is.**\n\nWe don’t need resting. Staminas and graceful doesn’t need to stay relevant (though I like the proposed graceful changes). Just make the damn drain rates scale with your level. That’s how everyone assumed the skill worked to begin with, and it’s a lot simpler than what’s being proposed, and other suggestions I’ve seen.",
        "num_comments": 201,
        "comments": [
            "Me a player on and off since 2005 learning agility doesn’t already do this….",
            "Agreed. The line in the newspost that stated \"the obvious first place to start is regen rate\" was crazy for me to read because to me, it's obvious that the place to start is the fact that run energy depletion is completely unaffected by agility levels lol",
            "Yeah it’s pretty simple and everyone is trying to overcomplicate it by wanting resting spots and this and that. Just make it so each however many levels lets you run for % longer and increase the current run time by 30 seconds from level 1/f2p. Replenish rate could be buffed as well as you level. That’s all we want. \n\nWe don’t need trade offs, just make the skill feel rewarding to train. It’s just a diary requirement/ max cape thing right now and pointless to otherwise train once you get to ~75 after beating all the quests ",
            "Jagex devs trying to turn agility into forestry 2.0 lol",
            "excuse me, i would like forestry part 3\n\ndeath by committee",
            "jmods are addicted to making things overly complicated and annoying. it’s the forestry effect. i don’t get it",
            "Literally just add 0.25-0.5% drain rate reduction per agility level.",
            "I can’t understand how the beta drain rates are worse than live game.. like are they even listening?",
            "But I want it to be like oblivion and run super fast with 99 agility.../s",
            "Jagex focuses way too hard on maintaining the status quo. Agility doesn't have to suck forever just because it always has sucked. We can improve things. It's fine to buff things."
        ]
    },
    "No need for the D pick now": {
        "title": "No need for the D pick now",
        "score": 413,
        "url": "https://imgur.com/a/21eYHzi",
        "content": "",
        "num_comments": 133,
        "comments": [
            "Make sure you got your account properly secured. Ballsy of you to show your name with 8b+ drop or whatever it is now.",
            "What is this actually worth?",
            "Chad title for the most valuable drop in the game at 2 KC, congrats bro",
            "Instantly in the top 100 richest Ironman accounts",
            "Hey hunny wake up, new d pick skip just dropped",
            "Somebody talked about you at seers yews forestry yesterday.. all in all gz and fy",
            "Ngl I'd give it to my main. The he'll with the flex, that would set up all my other accs. Max gear on main, gp for maxing. Gear and go for my alts, etc. Flex on an iron or amazing qol on all my others accs. Obv answer for me",
            "As everyone else is saying, make sure you set up some extra security, people are likely already trying to get your account since you left the name(don’t do that).",
            "What would you do if it was on a GIM?",
            "Lol what\n\nEdit: You guys afraid of showing your username? You should be?"
        ]
    }
}