{
    "EURO Championship 2024 -Official mega thread": {
        "title": "EURO Championship 2024 -Official mega thread",
        "score": 76,
        "url": "https://i.redd.it/dvnssv2drn6d1.jpeg",
        "content": "One bantering, shitposting thread to rule them all. Here we can discuss every match and how shitty our teams are doing. But above all, here we criticize the Fr🤮nch ‘team’. \n\n@mods please pin this post. ",
        "num_comments": 175,
        "comments": [
            "23 seconds??? Are you ok Luigi???",
            "Nearly shed a manly tear at the sight of Christian Eriksen and his bionic heart scoring that goal. Almost made me forget the Danes used to invade us every Tuesday.",
            "Damnnn, the Swiss are playing really well. \n\nNot sure what the Linesman was doing trying to rule that goal offside though.",
            "Been really fun to watch Spain say \"Ball is mine\" for 40 mins straight.",
            "We will eat your souls and shit out nazi gold!",
            "Can't wait for the match against our cosplayers",
            "At least Austria drew plenty of French blood so far",
            "Sorry croatbros, we are so back",
            "Barry, I'm expecting the finest shithousery from you tonight.\n\n![gif](giphy|JlpjgSWmzR45OUMyNQ|downsized)",
            "This post should have comments ordered as new per default"
        ]
    },
    "POV: you are a portugeezer in 1500s": {
        "title": "POV: you are a portugeezer in 1500s",
        "score": 1635,
        "url": "https://v.redd.it/7yytz79ong9d1",
        "content": "",
        "num_comments": 178,
        "comments": [
            "This guy like finds escorts and has them show him around the country he visits right?",
            "So bald is definitely a sexpat. What about this guy?",
            "Him treating them like a lost uncontacted tribe and then hearing them say cochilla is so funny",
            "There's a reason the video is not too long.\n\nSpoiler alert: later there were some kids with Portuguese surnames playing in the forest.",
            "That's a Portuguese from before Al Andalus here",
            "Those girls are prettier than AI dolls",
            "Well if you cross the atlantic and survive scurvy, you should have some indian babes and tropical fruit.\n\nAt the same time while you're at it...",
            "Since they already speak Brazilian Portuguese, there's no way that it is comparable to the portuguese beeing there in tha 1500s since they would still have their own native language!",
            "Can't hate Kurt bcs he's half German... But the fetal alcohol syndrome is still strong with his phenotype",
            "I can't stand that guy"
        ]
    },
    "World War III incoming.": {
        "title": "World War III incoming.",
        "score": 1238,
        "url": "https://i.redd.it/jfq10i9csg9d1.jpeg",
        "content": "",
        "num_comments": 164,
        "comments": [
            "Similar to how you can't get a proper curry in India, I sort of get Fritz's point here",
            "Maybe once they can make actually decent copies over there.\n\nUntil then, it remains the invention of a Turkish immigrant that upgraded the traditional form to something more useful.",
            "If you mess with the dner, we are coming for you",
            "Awaiting Germans applying for protection of Dner Kebap against cheap Turkish copies\n\nThey probably have a better argument for it as well",
            "Dner is german, how the heck do you think the  got in there?!",
            "Turkey cannot win this, it is known to all humanity that Charlemagne invented the Kebab. It's a traditional German food like the bratwurst and beer.",
            "German kebab stays the best I have eaten to this day and I dream of the day that I can have it again. I can get half decent ones in Portugal, at fairly cheap prices (3, meaning half my monthly wage) but they do not compare to what I have eaten in Berlin.",
            "Ahhh see theres a chain of stores called German Donner Kebbab below my balcony so I dunno what Suleiman is gonna do to argue against Hans in his lederhosen",
            ">World War III\n\nYeah, but not about kebab...",
            "The sick man from the Bosporus with another great idea"
        ]
    },
    ".": {
        "title": ".",
        "score": 1080,
        "url": "https://i.redd.it/kli3owom2g9d1.jpeg",
        "content": "",
        "num_comments": 105,
        "comments": [
            "Kebab is a millenium old native germanic dish coming from Odin himself according to this sub",
            "We don't want them coming here taking our Kebabs!",
            "Im more of a gyro man myself ",
            "Kebab is great, the only true cultural enrichment immigration produced",
            "The dner turks are.. acceptable",
            "Everything on a Kabab is made from local incredients so it's local food.",
            "The local turk speaks German works in Germany and lives in Germany, therefore he is German. \"Auslnder\" are something different",
            "the kebabs in sweden are made by Iranians.",
            "Hey good food is good food",
            "Yes. But have you heard of recipes? You dont need Turks to cook a turkish dish. You dont invite Luigi over every time you cook some spaghetti, do you?"
        ]
    },
    "Tolkien was British...": {
        "title": "Tolkien was British...",
        "score": 279,
        "url": "https://i.redd.it/2g6gzjhzxh9d1.jpeg",
        "content": "",
        "num_comments": 62,
        "comments": [
            "I can take Europeans mocking our food, but when it comes from Americans I get defensive. Their food is absolute shite and measuring things in 'cups' is for toddlers.",
            "As said, Europeans can dunk on our food as much as they want. But Am\\*r\\*cans can fuck off back to Narnia with their E number cancer inducing \"Food\".",
            "Try a good pub lunch in a country inn. Then apologise for such blasphemy",
            "On top of that he was aware of Dutch food, so his logic was tall = bad food.",
            "British food.... bad! HAHAHAHA, haven't heard that one before, what a classic.",
            "Posted by someone from a country who thinks mixed spices are \"flavour\".",
            "This actually suggests Tolkien was fully conscious of good food. As we know, the best cooks are PIGS (plus French) which as we also all know, are the homelands of diminutive men. It fully aligns.",
            "Wait food is supposed to taste good?",
            "Elves = northern europeans\nDwarves = southern europeans",
            "Pigs are the best cooks no doubt yo others they do come of as dwarfs"
        ]
    }
}