{
    "Quick Prompt Megathread": {
        "title": "Quick Prompt Megathread",
        "score": 2,
        "url": "https://www.reddit.com/r/3d6/comments/1dhjqs0/quick_prompt_megathread/",
        "content": "Post your quick prompts here! Anything goes! All parent comments should contain a simple prompt or image that could conceivably be made into a character. Please don't just comment Gnome Illusionist on everything, it makes the tribbles sad.",
        "num_comments": 8,
        "comments": [
            "martial lycantrophe character with victorian and/or eldritch themes",
            "Thinking of playing a Sea Druid when my group does Dungeon of the Mad Mage, and the DM said I could use the subclass with the 2014 rules and do Ye Olde Tempest Cleric multiclass for Wis-based max Lightning and Thunder damage. Taking Metamagic Adept for Transmuted Spell Metamagic is a must, but what other Metamagic should I take? Twinned Spell? Extended Spell for 40d6 healing from Aura of Vitality outside of combat?",
            "Beast barbarian Jekyll Hyde character who is a Changeling so they can be high strength for the rage bonus but look extra weak most of the time. Changeling also lets you have horrific elements of your beast form emerge when you fail to hold them in.",
            "Druids have a surprising lack of elemental damage spells, so transmuted spell is a good choice! I'd skip twinned b'c you'll only have enough sorcery points for lvl1-2 spells. I normally don't like extended spell, but druids have so many concentration spells it could work out well to extend heals or buffs. Even an aoe might worthwhile if you're powering through a dungeon and clear 2-3 rooms in succession with a two-minute moonbeam. Otherwise subtle spell is always a good option in RP situations or if you might get counterspelled.",
            "thank you for the suggestion. I never heard of Jekyll Hyde, now I am intrigued by that and I will read it!",
            "DM also said I could have Storm Sphere which could also be good for Extended Spell in a prolonged fight, though unlike Moonbeam I couldn't move it.\n\nMulticlas split would be Druid 18/Cleric 2, I don't want it to be super complicated. I know I'm gonna take Elemental Adept (Lightning) as well, since between that and transmuting to Thunder, I should be able to max damage against basically any creature in there (unless there's something immune to lightning and resistant/immune to Thunder). War Caster would also be good, although my group is generally inconsistent in how often we remember to call for/make our concentration saves. Aside from those 3 feats, idk what else I'd take",
            "Sorry, I just meant a character who loses control and turns into a beast, like in the classic story 'Strange Case of Dr Jekyll and Mr Hyde'.",
            "No no I got it. I just never heard of it and will read it because I liked the summary a lot. I might make a character just like you said too though"
        ]
    },
    "New Player Questions": {
        "title": "New Player Questions",
        "score": 2,
        "url": "https://www.reddit.com/r/3d6/comments/1dhjrkf/new_player_questions/",
        "content": " This is a dedicated thread for brand new players to ask simple questions in. \n\nExamples include, but are not limited to:\n\n* What should I make with these rolls?\n* What kind of character fits this party? \n* Which race/class best matches X?\n\nIf you think your question involves more than a couple of paragraphs to answer, feel free to make a new post, but bear in mind you may be redirected here.",
        "num_comments": 0,
        "comments": []
    },
    "Favorite Ranger Subclass?": {
        "title": "Favorite Ranger Subclass?",
        "score": 76,
        "url": "https://www.reddit.com/r/3d6/comments/1dlhm88/favorite_ranger_subclass/",
        "content": "What are your favorite ranger subclasses and builds?\n\nThe class has an undeserved bad reputation, especially with its optional class features. What sort of builds have y’all had fun with? Also what sort of roles have your rangers had in and out of combat?\n\nBonus points for a ranger that doesn’t use a bow/xbow.",
        "num_comments": 117,
        "comments": [
            "I'm a big fan of fey wanderer if you want to try something different. They have great social skills and otherworldly glamor works with all Cha checks. So maybe dump something other than Cha, take a species/background that gives you a social still or 2 and you can be a social power house. Plus they get a decent damage bonus from dreadful strikes, and misty step @ lvl 5.\n\nEdit: this gives you the opportunity to priorize Wis, take druidic warrior fighting style and take shilleghle and make melee attacks with your Wis mod.",
            "I keep swinging back to Swarmkeeper. It's just so flavorful, the swarm could be anything. Bees, bats, birds, sand, tangible darkness, flower petals, razor leaves, paper, toenail clippings, possibilities are endless",
            "Call me vanilla, but Hunter Ranger has a special place in my heart.\n\nI built a Strength-based Kenku Hunter, went with Colossus Slayer, as well as Multiattack Defense.\n\nMy character was a bit of a doorway dodger, using some stealth tactics with casts of Pass Without Trace. Weapon choice was a longsword and shield.",
            "Even though it’s overused, I do actually really like the Gloomstalker vibe.",
            "I love the Drakewarden. \n\nThe Drakewarden I’m playing now is STR primary and fights in melee with a maul. The table in question plays with the flanking rules, so I can use my drake to set up advantage for myself or other party members. \n\nThe drake (named Jake) is basically the party’s dog. \n\nIn combat, this ranger is one of the primary damage dealers and a backup healer. I also use the drake to deter attacks against my allies. \n\nOut of combat, I’m typically the outdoor survival and path finding expert, with the added ability to mask the movements of the entire group (pass without trace). \n\nMy character uses the Tasha’s features.",
            "I love a spellcasting Swarmkeeper. It is the only subclass whose ride effect doesn’t require a WEAPON attack. \n\nAdding the swarm and favored foe to Produce Flame is very fun, I have been theory crafting a Warlock/Ranger who adds ride effects to Eldritch Blast.",
            "Currently playing a Tasha rules Beast Master and I fucking love it 😍. I am a small race and use my beast as a mount, and between mounted combatant feat for mount Evasion and shield master for my own we eat fireballs for breakfast 🤣 high damage, high survivability. I either run summon Beast for more damage or healing Spirit for extra heals. Such a great build. I never feel useless and I play like a Frontline damage dealer who can also play a support role with healing spells.",
            "I've played 2 rangers. The first was a straightforward Horizon Walker Sharpshooter archer that didn't have anything insane up their sleeve but was super consistent. The second was much more fun though: an Aarakocra Beast Master with the Magic Initiate feat for Find Familiar and the Druidic Warrior fighting style for thorn whip. I'd combo my subclass companion with Find Familiar and Summon Beast to assist allies on the ground while I flew around trying to pull enemies in the air to drop them with Thorn Whip and grappling.",
            "Conceptually, Horizon Walker without question; unfortunately, they don't get the mechanical love that they deserve to really support the playstyle.\n\nIn practice, Fey Wanderer was a lot more satisfying and unique in that it's one of the few subclasses that really wants a great WIS score and has truly unique features that suit the theme. I imagine Swarmkeeper would feel similar in play, but has enough differences to be it's own thing",
            "I love the Tasha's Ranger with the PHB Beast Master.\n\nIt guarantees not only a mount through majority play, but a unique one. Now, of course, you must also choose a small race, but that's also part of it. And, in truth, I either like to go for a DEX build, dual wielding scimitars or else doing a STR build and building up to Dual Wield lances.\n\nAnd two of the best beasts to choose are Giant Crab (best AC) or else Giant Badger (burrow speed, and neither the enemy or their spells can target you through dirt), or else any beast with a 50+ movement speed (best for groups with DMs that use varied terrain with things to dart around/behind).\n\nFor giant crab builds, I like to go for halflings, since it's easiest to imagine them going into battle, standing upon their mount while using their oversized toes to grip onto the sides of the shell."
        ]
    },
    "How to salvage a Warlock build that didn't exactly work out as planned?": {
        "title": "How to salvage a Warlock build that didn't exactly work out as planned?",
        "score": 19,
        "url": "https://www.reddit.com/r/3d6/comments/1dljyht/how_to_salvage_a_warlock_build_that_didnt_exactly/",
        "content": "I wanted to play a bit of a shady conman in this campaign and my initial idea for this was a Changeling Bard. During session 0 another player was also already set on playing a Bard, so I decided to keep the concept but with a Warlock instead - Archfey patron (mostly for flavour), still going for the typical face skills, while supplementing it with debuffing/control and useful out-of-combat spells, plus all the rituals from Tomelock at level 3 later on. \n \nMy problem: I'm currently at level 2 and don't really get to use half of the stuff I built the character for. Two party faces is one too many, kinda should have seen that one coming. This is totally not the other player's fault, it's just that I'm less assertive and frankly not as good at RP. Plus, at the end of the day a Bard lends itself to this role better than a Warlock. Another player also decided to play a Wizard instead of their initial concept, so my non-combat spell utility is kind of redundant and unnecessary as well. \n\nOh yeah, I did not take EB, which is probably the single biggest mistake in this entire mistake of a build. 😬 So here I am in combat with a single semi-decent spell (Sleep) and not much else. The earliest point at which I could get to at least the EB + Agonizing Blast baseline is level 5 in a couple of months. \n\nSo, my question is: Are there any other ways ways to start \"fixing\" this that don't take 3 more levels? How much more would I screw myself if I decided to just drop the Warlock and multiclass into something else at level 3?\n\nEDIT: Originally forgot to mention this, but I did talk with my DM and he does not want characters to be remade in the middle of the campaign. He doesn't even allow swapping out invocations/fighting styles and the like, because he's a fan of organic growth.",
        "num_comments": 58,
        "comments": [
            "Pact of the Tome gives you 3 cantrps of any class. You can do the EB +Agonizing blast next level. (evocations are also swappable when leveling) \n\n\n Book of Ancient Secrets allows non wizard rituals like speak with animals. You are the face talking to bears and druids. Also recommend detect poison and disease ritual.\n\n\n At lvl9 Gift of the Protectors is good giving the entire party Deathward.",
            "Ask your DM to make the changes you'd like to see made. Explain it to them some what like this: \n\n\"I'm not enjoying the choices that I made when building my character. I had one plan in mind and it unfortunately completely overlapped with 'X' player (Bard). I thought I could make my idea work as a Warlock, but along the way I somehow overlooked 'Y' (the changes you'd like to see made to your character). Would it be ok if I made those changes?\" Make them understand that you got flustered when \"remaking\" your idea and forgot a couple of things. \n\nYou're level 2 and it doesn't sound like you're in a 'serious' enough campaign that would frown upon a little class restructuring. Shit, ask the whole group next time you guys game. Most people want to make sure that everybody is having as much fun as possible, so if you aren't having any, most people will try to change that.",
            "Assuming that this whole situation isn't a dealbreaker for you, there are options available!\n\n1. Your DM says they're a fan of organic growth, so I'd try and find moments to organically have your character's story fit another class - play their game, so to speak. Now, I don't know your campaign, but there's plenty of options to go from Archfey to something else. Find nature despoiled, or some great tragedy? Swear an oath of the ancients, vowing to preserve nature and goodness. Maybe you could get into a major disagreement with your patron and lose your power, relying more on your rogueish charisma to make do? Or, perhaps, you meet someone else who is interested in the natural world like you, or you start using your fey powers to better your shapeshifting, so you can become a druid. Or, maybe your character starts a religion, with your patron diefied, and you switch to cleric (Nature cleric can actually be pretty good if built smart, as an example, but something like Trickery could easily fit, or even peace if flavored as more of like, a hedonism domain). If you've spoken to your DM, and you take actions in character that would lead you down another path, hopefully they would let you reshuffle once it fits like, the story narrative.\n2. If you still have to play warlock for the foreseeable future, at level 3, pact of the tome would allow you to pick up magic stone. Magic stone is actually a spell I would want anyway in a party with a wizard. Basically, for levels 3 and 4, you would create the stones and throw them. The damage isn't amazing, but it's better than non-warlock cantrip damage because you add your charisma to the damage already. At level 5, you can get agonizing blast and eldritch blast, but magic stone isn't obsolete. If your wizard buddy is willing to do some teamwork, they can pick up the spell \"tiny servant,\" which animates an object for 8 hours, and it animates 3 objects when cast as a 4th level spell later. The tiny servants can actually be told to \"Pick up and throw the stones \\[your warlock pc\\] drops at the last enemy one of us damaged,\" and they'll do so. This gives a nice little boost for damage at the cost of casting a bonus action spell every turn, which an eldritch blasting warlock doesn't mind doing that much.\n3. Alternative warlock option - Sprites! At level 3, take pact of the chain, and gain a sprite familiar. They're already the fey option, so easy thematics there, and there's one part of pact of the chain that doesn't usually see play - the ability to let your familiar attack when you take an attack. This lets you spend your action to have your familiar take a shot with their bow, which deals 1 damage and forces the creature to make a DC 10 con save. On a failed save, the creature is poisoned for 1 minute, with no subsequent saving throws, and if they fail by 5 or more, the target falls unconscious. Now, normally, when a warlock goes for this strategy, they also immediately get investment of the chain master at level 3, and I'd ask if they would allow that, but if not, it's a solid level 5 option - it allows you to have your familiar attack as a bonus action, and it makes it so the poison's DC becomes your spell save DC. Now, is this strategy amazing? Eh? It's really good debuffing and it feels really unique, but the sprite is super fragile, so you need to play smart. Because your sprite uses their reaction to attack, they can spend their action turning invisible every turn, and with a 40ft fly speed, they should always be out of reach of melee attackers, and be near permanently invisible. At level 4, I'd look into getting inspiring leader so they have some temporary hit points, and also ask your bard to learn the Aid spell and buff your familiar instead of you when they cast it. That can give the familiar respectable toughness for, well, a familiar. I'd also take full advantage of the fact that you now have a flying ally with a ranged attack - any combat encounter against foes that don't have ranged attacks, and aren't immune to nonmagical weapons, you can just run away from and have your sprite attack from the air over and over to secure what optimizers call a 'default kill,' a situation where there's no chance the enemies can survive and you win by default. Honestly, I mention it more as an acknowledgement that that is possible, than a serious recommendation - it sounds like your table culture wouldn't smile upon that. At level 5, you will want to learn investment of the chain master, and I'd personally take summon fey - it's a powerful spell that also doesn't take any action to upkeep, and it lasts a full hour so it shouldn't be hard to justify having the fey around for every fight. So, by level 5, that leaves you with your concentration on a powerful damage dealing fairy and a debuffing sprite that's poisoning people left and right. At 7th level, your summon fey will double in power, and you'll finally be able to get eldritch blast and agonizing blast yourself if you'd like. \n4. Next time your PC gets a big cash reward, have them retire. Set up some foreshadowing beforehand, ofc, but something like \"This adventuring stuff, it's lucrative, but too much for me. With this haul, I'll have enough to spend several years drinking the finest wine, and who knows, maybe I can start a family,\" can be enough for a hedonistic character to maybe relax and settle down for a bit. Then, you can bring in someone new. Talk with the DM of course, set up that this would be the natural end-point for this character's story arc if you can.\n\nAlso, until you level up, I assume you have a decent dex, since warlocks only get light armor? I would buy a heavy crossbow and some bolts, and/or some nets. Nets are a niche but powerful option, restraining foes on demand, and a heavy crossbow will be less accurate than a cantrip, but like, better than nothing. If you're not in an environment where you can buy things, see if one of your allies has a spare ranged weapon, or ask your DM if you can spend time during short rests weaving nets. Another option would be throwing oil flasks (or, if you have the spell, having an unseen servant pour oil on enemies) if your wizard is using a fire damage cantrip. 5 bonus damage is about as much damage as a firebolt would do on average, so that's another option to contribute between sleep spells. Hopefully stuff like that can tide you over until level 3.\n\nHope any of this helps!",
            "The DM should be the first person to talk to about this.  Tell them that you’re not sure where you fit in best.     \n     \nAs far as party face goes, you could lean the other way from the bard’s temperment.- Good cop/bad cop.      \n      \nIf you don’t have a pet owner take Pact of the Chain.      \nIf you don’t have a gish in the party, you can fill that role by taking Blade.       \nIf you want a control type vibe ask your dm to let you pick up EB(or wait till you get another cantrip) & Repelling… Warlocks imo are best at this.      \n       \nSurely you don’t have every single niche filled by everyone else in your party except you.    Be stealthy, be strong, be wise, be book smart, be a friend of nature, the list is near endless…. Find your role. You’ve got this!     \n      \nEdit:   Also, Warlock is possibly the easiest low level multi-class. Switch to a role being unfulfilled with a different class. Fighter, sorcerer, paladin, heck even Barbarian for a hella lot of fun",
            "If your set on fixing it we will need to know a few things, notably the other characters in your party. And your ability scores, as well as what goals you would have for the character and your current spells, if possible for you to write our your whole character background and such it would help",
            "You can definitely fix this character with pact of the tome you can get eldritch blast + agonizing blast + hex which will give you baseline damage the entire campaign\n\nPick up other cantrips like guidance, shillelagh+ booming blade or green flame blade (melee option) because sometimes you just get stuck in melee. If you prefer just ranged options I like mind sliver or chill touch for regenerating enemies. \n\nAs a known caster you are allowed to swap 1 spell on level up rules as written. Same with invocations. Swap out sleep when it gets out-scaled. \n\nYou have access to faerie fire as a fey lock which is always a great support option.\n\nWith book of ancient secrets you can pick up find familiar - always useful but if your wizard has it you can copy it into your spell book for 50 gp. Speak with animals, purify food and drink/detect poison and disease to stand out. Otherwise detect magic and unseen servant if your party doesn’t have them for whatever reason. \n\nIf you have 14 dex moderately armored at 4th level can greatly improve your defenses. Otherwise I’d go for fey touched for flavor and pick up bless, command, or silvery barbs if it’s legal, maybe even charm person for flavor. \n\n2nd level spells options - mirror image for defense, shatter for aoe, misty step if you don’t want fey touched, \n\n3rd level spells you can stand out with summons as the bard can’t summon and the wizard likely will take fireball and counter spell.\nYou can pick up summon fey for flavor or undead or shadow spawn up to you - they always upcast well. Hypnotic pattern the bard will probably pick up but it’s still a fight winning spell you can have every short rest. Fly and counterspell are always great. \n\nJust with those selections I think you will have a pretty solid character levels 3+.",
            "If you GM is that strict, perhaps your warlock should have a little accident and then you could roll up a new character.",
            "Next level you could get Chain Pact for an Imp Familiar who is quite helpful to a party face. Neither you, the Bard, nor Wizard should have much Wis for Insight. It has a +3 and can telepathically tell you when they think someone is sus. Both of you can take a stab at the check for pseudo advantage. \n\nThen grab Mask of Many Faces, and Friends at Warlock 4 to be a much better Changeling than a Changeling. We can play bad cop. We can play bad guy. Make the Bard look like a hero with the shopkeep as we attempt to steal, get caught by the Bard, book it out and Disguise into a sweet old lady round the corner. We can turn NPCs against NPCs by casting Friends while impersonating them. Tons of options. Try to brainstorm with the Bard out of session to get them in the mindset of tag teaming social encounters. If talking about plans out of character in a social encounter is taboo at your table, Message is an excellent cantrip to speak to an ally without others hearing what you've said.\n\nIf you get tired of this playstyle or it doesn't work out between you two that much then we can switch Pacts again at Warlock 8. Talisman is nice to just hand them extra skill check bonuses. Two party faces isn't overkill though. They're going to get unlucky even on their best Cha skills at times and roll something awful. Always nice to have someone step in and take another crack at it if possible. \n\nUsing the Help Action in these situations could also contribute to their social check. There are some rules about being able to improve the situation in order to qualify, and proficiency is definitely a qualifier most the times. Note also that Bardic Inspiration can buff your skills, but not theirs. Maybe they won't use it out of combat too much until Bard 5 for Font of Inspiration, but it'll eventually become a plentiful resource.\n\nGood Cha and proficiencies alone should always be enough to chime in when you feel is right. If you convert your build purely into combat prowess you'll still be able to have a good time in all pillars with a Lock. Combat just might be your favorite time to shine once the ball gets rolling. Warlock 5 is when they really come online.",
            "after reading mos t of the posts and your edit I see 3 options  \n1. Talk to your Dm and see what they say about you being unhappy with your character and what can be done  \n2. Kill off your character and create a new one. Rush into combat with a dagger (note let your dm know you are fine with playing a new character and not being resurrected)\n\n3. leave the game",
            "Just ask your dm if you can rework your character because it's not that fun"
        ]
    },
    "The most broken support character at level 5 ": {
        "title": "The most broken support character at level 5 ",
        "score": 16,
        "url": "https://www.reddit.com/r/3d6/comments/1dlje5e/the_most_broken_support_character_at_level_5/",
        "content": "Playing in a large Westmarch campaign that has been ongoing for a year. We are closing in on the end of the game. My character is level 10, 5 levels paladin, 5 levels warlock and just hit level 11 but haven't decided what to take my next level in. The other members in my party are an artificer at level 143, a druid level 13, a wizard level 12, and a fighter level 6. \n\nThere is a decent chance someone will die and we can have backup characters but they have to be level 5. Since they will be so weak I figured best to focus on support. To make it work in the story it would be my beagle becoming awakened on my death if I die. I need to make the most broken support character in 5e that I can but I am a terrible minmaxer, as evident that I am a paladin warlock that gets taken down pretty often and has had a lot of close calls (and would also love feedback on how to play that multiclass optimally)\n\nThank you!",
        "num_comments": 26,
        "comments": [
            "I DMd for my DM and they messed me up with a Life Cleric/Stars Druid, they were a Hobgoblin with the Bonus Action Help feature. \n\nThey spammed help, guidance, bless, healing.",
            "How on earth is the artificer level 143?? 😂😂\n\nIf you’re looking for a good support character I’d say look into twilight or peace cleric!\n\nThe biggest thing when playing a paladin/warlock is knowing your role.  It’s most optimal as a melee striker, and can work 2 ways. Paladin 2/ Warlock X or Warlock 3 or 4/Paladin X\n\nHexblade is the best warlock patron for the multiclass, because it allows you to focus mostly on charisma due to Hex Warrior.\n\nI would probably take the next level in Paladin for sure, as their aura is an incredibly potent ability. \n\nThose are some pretty basic pointers for the build, but there is a vast array of guides online.\n\n[Check this one out!](https://www.thegamer.com/dungeons-dragons-hexblade-paladin-build-guide/)",
            "Order Cleric 1/Divine Soul Sorcerer x\n\nCast Bless then spam Silvery Barbs to save your friends from being hit. Target them with advantage feature of the spell and viola, you have not only avoided a hit on your team but given your friend an attack at advantage. \n\nYour party will LOVE you.",
            "Your Paladin is getting thrashed because you delayed Aura of Protection by 5 levels, my dude. Get that next, and prevent adventuring as a glorified NPC. That's already what real life feels like.",
            "Cleric of Twilight. Just activate aura. Get perception proficiency as you have the furthest dark vision. 5e dogs(mastiff) have advantage on perception ability. See if you can keep it as an awakened dog. \n\n\nPeace cleric+Bless is the other option.",
            "Twilight Cleric 5",
            "What is this stupid rule that your back up character has to be level 5 ? A level 5 character is basically useless in a party with a 14 level full spell caster.",
            "Not trying to be toxic, but it should be considered a felony to take paladin levels and stop at 5 lol",
            "Hobgobo Bard is good",
            "The best advice I can give to anyone looking to multiclass is to make sure your classes share your best ability scores. Bard/Sorc/Lock…Wiz/Artificer…Druid/Monk/Cleric/Fighter(Dex).\nWhere you go from there is up to you but there are many good synergies."
        ]
    }
}