{
    "Weekly Novel Discussion Series: Audio Dramas: Deathwolf": {
        "title": "Weekly Novel Discussion Series: Audio Dramas: Deathwolf",
        "score": 4,
        "url": "https://www.reddit.com/r/40kLore/comments/1di1gfb/weekly_novel_discussion_series_audio_dramas/",
        "content": "This series is intended to give all you listeners an opportunity to discuss each audio drama in detail. Please post and thoughts, opinions, and questions you have about this week's audio drama. This series will cover audio dramas, not audio books. \n\n**Every post will be filled with Spoilers from the novel so if you haven't read this week's book then proceed with caution.**\n\n#Audio Dramas: Deathwolf\n\nAuthor: Andy Smillie\n\nPerformers: Seán Barrett, Rupert Degas, Chris Fairbank, David Timson, Charlotte Page\n\nReleased: June 2012\n\nSynopsis:\n\nIn the heavens above Luetin Hive, Erik Morkai's Space Wolves clash with Dark Eldar raiders, jump-pack clad Blood Claws taking the battle to the aliens' own infernal airships. But the war will be decided by Morkai himself as he challenges the aliens' sinister leader to single combat.\n\nExtended Synopsis link: https://wh40k.lexicanum.com/wiki/Deathwolf_(Audio_Drama)",
        "num_comments": 2,
        "comments": [
            "u/own_sd this one is another fun bolterporn nugget. Space Wolves jumping off and landing on DEldar skiffs like Obi Wan at the beginning of Attack of the Clones",
            "Luetin Hive. Really?"
        ]
    },
    "Whose Bolter is it Anyway?": {
        "title": "Whose Bolter is it Anyway?",
        "score": 28,
        "url": "https://www.reddit.com/r/40kLore/comments/1dl5g9m/whose_bolter_is_it_anyway/",
        "content": "Welcome to Whose Line is it Anyway- 40k Edition!\n\nI am your host Drough Carius and welcome to Whose Bolter is it Anyway? where the questions are made up and the heresy doesn't matter.\n\nMost of you know what to do, post quips and little statements related to 40k lore, not in question form, and have people improvise a response to it. Since everyone seemed to enjoy the captions in last week's game we will now be including those as well. If you want to post a picture for us to caption, post a link to a piece of 40k art and we will reply to the link with funny captions for the picture. You can find the artwork from anywhere, such as /r/ImaginaryWarhammer, DeviantArt, or any regular Google image searches. Then post the link here. I have started us off with a few examples below.\n\nPlease don't leave it as a plain URL especially if you're posting an image from Google. Use Reddit formatting to give it a title. Here's how:\n\n[Link title](website's url)\n\nEasy as pie! If it doesn't work, post the link with a title underneath.\n\n**What we're NOT doing is posting memes.** No content from /r/Grimdank. If the art is already a joke, it doesn't give us anything to work with, does it? Just post a regular piece of art and we'll add the funny captions. I've started us off with a few examples below.\n\nSome prompt examples…\n\n1) Things Alpharius isn't responsible for\n\n2) Things you can say to a commissar, but not your gf.\n\n3) etc.,\n\nPlease be witty, none of us want an inbox full of unfunny stuff.",
        "num_comments": 90,
        "comments": [
            "[Codex: Adeptus Custodes](https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2Fwunsd5jn5wzc1.jpeg)",
            "The guardsmen describe the taste of their rations:",
            "What’s the most enviable position in your regiment and how do you earn it?",
            "Before he revealed himself to mankind, the Emperor took many identities. While many of these were men of influence, some of his... stranger identities include:",
            "The Committee of Chaos Sorcerers has released their annual list of banned spells. New entries this year include:",
            "Guilliman has decreed that Space Marines need a bit more training on formal interaction with humanity.\n\nUnfortunately, due to astropathic error, this was misconstrued as \"flirting\" interactions with humanity.\n\nThis has led to a slew of pickup lines, such as:",
            "Roboute Guilliman interviews admirals and generals for senior positions in the Indomitus Crusade:",
            "Craftworlder's Infinity Circuit s̶e̶a̶r̶c̶h̶ question histories",
            "A necron lord awakes in modern earth specifically Disney land. Which ride does he pick and why",
            "The meanest Salamender meets the nicest Marine Malevolent"
        ]
    },
    "What would be the scariest Imperial guard regiment to fight against?": {
        "title": "What would be the scariest Imperial guard regiment to fight against?",
        "score": 75,
        "url": "https://www.reddit.com/r/40kLore/comments/1dlol63/what_would_be_the_scariest_imperial_guard/",
        "content": "Which guard regiment (if any) has the best reputation for fear, or in other words the Night lords equivalent? ",
        "num_comments": 60,
        "comments": [
            "For the average line grunt, definitely Catachan.\n\nWhile the discipline of Krieg and Cadia are scary for enemy commanders, how would you as a boot on the ground feel about having to fight Prime Arnold Schwarzenegger, Sylvestor Stallone, and Carl Weathers all wielding Machetes and Flamethrowers?",
            "Catachans. You die brutally to a regiment of the toughest, strongest and most natural warriors of the Imperium. Regiments of Rambos pretty much. Tons and tons of Rambos and Dutch's (Arnold Schwarzenegger from Predator).\n\nYou won't win..",
            "I think this quote makes good case for elysians  \n\n\"The enemy commanders think themselves safe from the Emperor's Wrath behind kilometres of fortifications and legions of warriors. They did not account for us. Make your peace with the Emperor, men—we drop in two minutes.\"",
            "Chem Dogs probably aren't fun to fight. A bunch of criminals high off their asses on space PCP running toward you because behind them is another group with guns sighted on their backs so if they stop they get shot. And also all of this was just a diversion because they are still the Imperial Guard and those artillery shells are gonna be hitting soon.",
            "Lucifer Blacks come to mind.",
            "Penal legions. Nothing says \"hell no\" like 100s of guys with bombs strapped to em junked up on space PCP (frenzon) with nothing to lose!!!!",
            "So, you want to see the fear in the eyes of those Xenos/Heretics :\n\nTempestus Scions would change any tide of battle with their most advanced training and arsenal, definitely one of the scariest sights for any enemy to see Emperor’s finest land in hi-tech god tier gear. A very rare sight indeed, but it means someone with power wants to get this sh*t done fast and clean. *They are practically Space Marines without augmentations, peak-human conditions armed with the most insane arsenal Mechanicus can spawn. Grey Knights alternative for Astra Militarum.*\n\nCatachan are natural born warriors that goes through a real Monster Hunter game all their lives. If they have the environmental advantage rather than open-warfare, it will be a real nightmare and they-will-win. *One story involves a famous leading officer losing his arm to a freaking LAND SHARK and then ripping the sharks throat out by biting it. Another boring day in Catachan forests.*\n\nEven Imperium thinks Kriegsters are batsh\\*t insane, if they werent so useful Big E himself would vote to nuke them off. Those relentless bastards destroyed Space Marines, Tyranids, even pushed Necrons back and destroyed tombworld cores. You know something is really wrong when Commissar actually tries to be reasonable or Inquisition itself tries to avoid few problems related to Krieg. *A Krieg team once coordinated almost instantly to force an invulnerable/phasing Canoptek Wraith into melee-combat (so that it would engage its phase-out protocols to become vulnerable) and then the rest of the team shot the everliving sh\\*\\*t out of their charging-comrades and the machine to death, didnt even blink.*\n\nAs a fear bonus but not regiment, seeing the lonesome Eversor Assassin wandering amongst the ruins and friendly/enemy corpses means you are fu\\*\\*ed beyond measurement. It means various fun activities like being branded a heretic-fugitive by Inquisition for nothing-at-all and being involved in an active scorched earth protocol. *That is what they send to make the place disappear from history while Exterminatus batteries are charging.*",
            "I mean *all* Guard regiments are scary when you're some barely literate underhive scum caught up in a rebellion. Shits hit the fan when you see full time, professional soldiers arriving in their hundreds of thousands with tanks, artillery, heavy weapons, Naval and specialist support to put down your demands for fairer working hours and food.",
            "Tanith First and Only or the XXIV Catachan regiment\n\nBoth for the same reasons, they are experts on killing from the shadows. The Taniths are expert marksmen and good at moving covertly\n\nThe XXIV Catachan is the same, ambush and traps. Just a bunch of Rambos killing and dissapearing into the jungle \n\nYour forces would be picked apart one by one by an unseen force, If you run, surely you will trigger an explosive trap, If you don't, snipers will kill you",
            "I will throw the macabian jannisaries in\n\nThey are zealous fighters who charge will screaming for their patron saint and they are very well equipped. And imo when you mix zealous soldiers with good equipment shit gets real and scary"
        ]
    },
    "What happens to a Space Marines rank if they're made into a Dreadnought?": {
        "title": "What happens to a Space Marines rank if they're made into a Dreadnought?",
        "score": 23,
        "url": "https://www.reddit.com/r/40kLore/comments/1dltn45/what_happens_to_a_space_marines_rank_if_theyre/",
        "content": "If a captain were to be injured to the point of being encased in a Dreadnought would they retain their rank of captain or do Dreadnoughts have no rank/hold different ranks all together? They probably can't actually lead squads anymore, but would they still be sought out for their wisdom and be treated like they still hold that rank?",
        "num_comments": 23,
        "comments": [
            "I'd imagine they keep the rank and honours but not the duties normally associated with it but as with all things space marine it really depends on the chapters culture and traditions",
            "They don't lose their rank as such, but they become \"venerable\". Leadership is hard when 99% of their existence is spent in hibernation. And yes, in some chapters, dreadnoughts are used as walking and talking reminders of the past.\n\nA notable exception is Bjorn of the Space Wolves (gtfo with that \"Vlka Fenryka\" nonsense, they wolf down with the wolf lords every chance they get. so space woofs is perfectly fine), who at various times acted as chapter master after he got entombed in a chassis.",
            "Dreadnought is not part of thr active command chain often. However when deployed one is a hightly honoured advisor. \n\nAnd you'd do well.to listen to the old dreadnoughts suggestions",
            "Referencing “The Glorious Tomb” audio drama, much time and many deaths pass while a dreadnought is asleep, to the point where the Space Marine inside begins to lose his identity, except for a few veterans who remain in the chapter, and is identified by the dreadnought chassis itself.",
            "Since most dreads spend their time asleep between battles I doubt captains get to remain captains but I could see a dread retaining a sergeant rank",
            "Depends on the Dread, the chapter, and the circumstances\n\nDreadnoughts who held rank can still command when they’re aroused to war, there are plenty of examples.\n\nIt’s unlikely they’ll permanently keep a command they held, as they’ll be asleep most the time, but a senior captain/officer dreadnought would absolutely be able to resume their role should it be required. It’s happened on several occasions, such as with the Ultramarines 2nd company on Damnos or with the M32 Battle of the Fang on Fenris.\n\nI believe the Iron Hands also had one of their clan-companies permanently led by a Dreadnought at one point, who simply didn’t go to sleep like normal dreads and retained his captaincy",
            "I think it depends on the Space Marine. For example, Magneric from the Black Templars led a squad even after he became a Dreadnought. Or, for example, Ares from the Iron Hands. But some simply became warriors and did nothing but battle.",
            "Depends on the chapter and the marine, really. \n\nMost officers (captains/lieutenants/sergeants) probably become venerable dreadnoughts, but aren't awoken to lead their soldiers to battle - the position is probably already occupied by someone with a more contemporary experience by now, and most they can do is to aid their company.\n\nChaplains, however, often retain their lucidity and remain [spiritual leaders of the chapter in death](https://wh40k.lexicanum.com/wiki/Chaplain_Dreadnought#) both among loyalist and chaos space marines (e.g. Sor Talgron/Warmonger of WB).\n\nThere's also at least a single incident of a [Chapter Master](https://wh40k.lexicanum.com/wiki/Carab_Culln) retaining his rank (de jure) even after being interred - though I'd guess he doesn't lead Red Scorpions often.\n\nBlood Angels & their successors also inter their librarians, so they could also provide advice to the new adepts of Librarius.\n\nAlso, Iron Hands & their successors revere their dreadnought brethren the most, even giving them seats on Iron Councils due to their expertise.",
            "There is a heresy era word bearer chaplain in dreadnought in Word Bearer's Omnibus. He is an advisor most of the time and the spearhead/commander of the dreadnoughts in battle. Current chaplain sees him as a hero and sage. His approval of the current chaplain is what made him the current chaplain. So yes, rank matters. Other dreadnoughts are not cared as such.",
            "They are honored but think rank stops really mattering. They just become a respected elder who offers counsel and experience. Won't be leading detachments but will probably be part of the leaders immediate subordinates depending on how mentally  sound they are."
        ]
    },
    "Favourite morally grey moments in the lore?": {
        "title": "Favourite morally grey moments in the lore?",
        "score": 24,
        "url": "https://www.reddit.com/r/40kLore/comments/1dlssid/favourite_morally_grey_moments_in_the_lore/",
        "content": "Seeing many threads about the absolute incompetence and horrific treatment of their own citizens as well as other alien species and the general genocidal tendencies of the Imperium. I'd like to pose the question: What are your favourite moments in lore where some of the more extreme and terrible decisions *(from a normal and sensible standpoint)* that turned out to be possibly the only right thing to do?\n\nI'll start with a small one. *Spoilers ahead from an episode of the mini series Hammer and Bolter.* >!*In episode 13 \"A new Life\" you follow a small family of lowly hab-workers trying to escape an Imperial colony during a Tyranid invasion. Caught between the crossfire of paranoid Guardsmen trying to stem both the tide of Tyranids as well as panicking people that want to leave, brutally gunning down their own as well as the Nids. The little family, with their newborn finally make it off planet with the help of some underground \"rebels\" that has managed to get them a spot on one of the transport ships. All is well you think, till you realise the little family are all last generation genestealers cultists and their little infant is a newborn first generation genestealer, and they have effectively just infested a ship and are now heading to a new world.  I guess the paranoid Commissar at least had a reason to be. Truly Grimdark.* !<\n\n",
        "num_comments": 12,
        "comments": [
            "I've always been a fan of Inquisitor Kryptman. He's killed more people than any other mortal in the setting, invoked Exterminatus enough times that even the rest of the Inquisition think he's a lunatic. And yet, it's hard to argue with his strategy - he's not a madman, just someone who recognizes that, in the face of the Tyrannic threat, for once the Imperium's utter ruthlessness needs to be kicked up a notch.",
            "The mobilisation of Terra's civilian population during the Siege of Terra.\n\nPeople from all walks of life were simply conscripted from nearly every walk of life, and placed in the first wall as the hordes came.\n\nAs in real life, it was a morally grey area, but the necessity of it vs the consequences ultimately determined the course of action.",
            "The Blackstone Fortress novel has one character who is a pilot on the run from the Imperium. The Guard were fighting a chaos incursion on the planet below and were losing. Demons were coming through and command decided they couldn't save the planet or the soldiers they had fighting for it, the sent in Navy fliers to drop nukes, but didn't tell them their targets were \\*everyone\\* including their own people. \n\nOn the way back this character realises what they have done, and works out that all the returning pilots are being neutralised, so runs for it with their remaining fuel, managing to just get away, for the moment.\n\nIn the stories current moment, this woman wakes up screaming knowing she is responsible for nuking a bunch of loyal soldiers and also that the Imperium will literally never stop chasing her to keep her quiet.\n\nLiteral horror story for everyone involved.  We can't know if there was any other way to deal with the planet once the Guard started losing, but with massive cult activity on the surface plus a full reality incursion, pulling an 'Armageddon' might actually have been the only way they had available to deal with it.",
            "One of the most unnerving stories I read was … the night of the wolf (I think) . Some space wolves sent to pacify a rebelling imperial world get caught up in a dark eldar invasion of the same planet . The rebels and space wolves successfully fight off the xenos , and become close friends over the course of the fighting . The space wolves , during the victory feast , simply assume that the rebels would naturally want to be absorbed back into the imperium after all they’ve went through , but the opposite is the case. \n\nWhen both sides realise this, the wolves just gun down their former rebel comrades at the feasting hall, and later order their ships to blow up the main rebel cities",
            "I have 2\n\n1. The Devastation of Baal. To prepare for the Tyranid invasion, Dante of the Blood Angels orders every Baalite citizen ages 10 and older to be armed and to fight, no excuses.  Imagine being a 10 year old and ordered to go to war or be executed.\n\n2. In the Krieg novel Dead Men Walking, some of the local citizens of a planet being invaded by Necrons decide to rebel and start worshipping the Necrons. They manage to take the commissar of the Krieg regiment hostage. So there's this rebel leader holding a gun to a commissars head in the middle of the street telling the Kriegers to fuck off. So the Krieg soldiers back off right? Wrong. Without hesitation, they just blast the shit out of both the rebel and the commissar before marching on.",
            "Getting rid of all the baseline humans after the First War of Armageddon is in my mind still the only viable option and one of the few times the Imperium's cruelty has been justified.",
            "Grey Knights/Ordo Malleus nuking several worlds that come into contact with escaped Armageddon soldiers to avoid the spread of Chaos",
            "The Hive Mind doesn't care one iota for individual human lives. Kryptman knows that in order to adequately combat the Devourer, we ourselves must mobilze and think similar to a Hive like entity in order to counter a hive-minded entity and strategize on the macro-scale first and foremost.",
            "Yeah this is a good one, I do think that conscripted citizenry obviously had zero chance to survive in a god machine / astartes conflict",
            "It's a little different. It wasn't a rebelling world, but a newly discovered human world during the great crusade. These people never knew the imperium and after defeating the Drukhari they just wanted to return to the life they lived for generations."
        ]
    }
}