{
    "Anon is a gooner": {
        "title": "Anon is a gooner",
        "score": 1224,
        "url": "https://www.reddit.com/gallery/1dlgg19",
        "content": "",
        "num_comments": 78,
        "comments": [
            "Anon was a sweet, innocent baby once. Endless potential. He was another being of the most advanced species we've ever known. And now his life is just 24/7 edging.",
            "When society collapses guys like this either get shot in the street and hung on a lightpole or become warlords. Marquis De Sade was basically a french revolutionary goon pig.",
            "Anon saves the best part for last",
            "could lifting have saved him?",
            "Bro really took the \"if there is no God then everything is allowed\" a little too far",
            "May god smite this heretic soul",
            "Anon thought playing modded Skyrim IRL was allowed",
            "he stuck the goon bones up his ass. imagine dying just to have your femur massage some gooner's prostate.",
            "Fake, but still concerning\n\n&nbsp;\n&nbsp;\n&nbsp;\n\n(and also gay)",
            "It’s like that video of the dude bustin a nut in co workers coffee, chocolates and shit then giving it to them."
        ]
    },
    "Anon leaves many other anons jealous.      ": {
        "title": "Anon leaves many other anons jealous.      ",
        "score": 122,
        "url": "https://i.redd.it/8t235g90838d1.png",
        "content": "",
        "num_comments": 9,
        "comments": [
            "If that's her reaction to koe no Katachi she's a tasteless goonette",
            "I waited a decade to force my wife to watch NGE and it nearly cost me my marriage",
            "Definitely fake and homosexual",
            "Anon day dreams once again",
            "Truly an Edgieo and Gooniette story.",
            ">Showing normie wife a convoluted story that ends with the autistic teenager mc nutting all over comatose girl to cope with the world ending\n\nBased...?",
            "that's like 2/3 of the way through not the end. the end is the Fanta sea fantasy",
            "To be fair it's been about 7 years since I watched evangelion. Regardless shinji cummy on the asukussy and the world goes oopsy woopsy and normies make 10 hour youtube documentaries about it",
            "Don’t deny that at all, but everything in that show is an allegory to puberty so sexual confusion was definitely a theme"
        ]
    },
    "Anon is God": {
        "title": "Anon is God",
        "score": 603,
        "url": "https://i.redd.it/47r7xyxja08d1.jpeg",
        "content": "",
        "num_comments": 124,
        "comments": [
            "All that shit about Satan being the boss of hell, owning souls, and being the source of evil, is just highly metal fanfic that persists because it sounds badass. Overzealous people in some communities sincerely buy into it, but for most people that stuff is just for fun. The Bible really doesn't say too much about it.",
            "“Equal to God”\n\nAnon fell for the Satan propaganda",
            "Being an atheist on 4chan is like being a midget with a height complex.",
            "To have a more nuanced topic of conversation, while it's not lofty of an idea to suggest anon doesn't know too much about Christianity if that's their assessment of it I will say I do blame modern religious teaching here.\n\nConsidering my own experience it's not a shocker that we've gotten to this point where movies have done way more to shape our ideas on what the mythology (no ill connotation here) of your religion is than your friend's mom who doesn't have a teaching degree who volunteered for week night Christian teaching. No wonder people don't understand not only the real story, but also have no attachment to its depth or practicality. They did a horrible job selling abstinence to us teenagers so they have no chance even attempting the problem of evil. I would have loved to have learned religious history in my teenage years as it's a sort of hobby of mine to do that now. I'm only just learning what the specific beliefs the sect I grew up with has, how I may disagree, and what other sects or philosophies have better approaches to thing.\n\nAnd I will say this sort of thing pops up in a lot of places, so I'm not just shaking my fist at Sunday school. I genuinely think most people don't know what the hell they believe and attach themselves with these labels, speaking with authority at times, but they really don't know anything about it. Often times I even find people who supposedly fit into that category are the worst at explaining their identity and commonly do things outside of their belief system. Whether that's an anarchist (etymology: without ruler) campaigning for a president or a Roman Catholic who believes in the Nine Circles of Hell, people don't know who they are. It would help a lot if the people involved with indoctrinating others to lay all the cards out and see if it's a match, not just crumble and move on when things don't go to plan.",
            "Aren’t like 93% of poles Catholics?\n\nSeriously, how can someone living in one of the most Christian nations in Europe not even know the basic tenets of Christianity?",
            "Only the chosen people can escape this fate, by using the magic of legalism to trick G-d by transferring sin into a chicken",
            "Uhm yeah? What the fuck else would you do as an omnipotent god if not create silly things to amuse you? \n\nFucking dumb. What else would you have god do? Just fellate himself all day everyday?",
            "God did defeat Satan, twice actually",
            "Satan doesn't rule hell and he doesn't own anyone's soul.",
            "I don't think that's Christian theology. That is the popular conception of Christianity. \n\nIt's like all of us know the popular conception of hellenistic theology, but very few would know what it actually was in antiquity"
        ]
    },
    "Anon gets his spaz uncle laid": {
        "title": "Anon gets his spaz uncle laid",
        "score": 113,
        "url": "https://i.redd.it/t8a58i4zx28d1.jpeg",
        "content": "",
        "num_comments": 4,
        "comments": [
            "The picture makes this 10 times better, that fucking smug grin lmfao",
            "Anon was paid to be TOPPED by his cousin",
            ">That room smelled like a fish cannery afterward.\n\nNew favorite line.",
            "Anon told us the cousin starting hitting on girls all the time, but was he ever successful?",
            "PLOT-TWIST: Anon was the saggy-titted hooker."
        ]
    },
    "happy pride ig....!?🫶🎀🌈 ": {
        "title": "happy pride ig....!?🫶🎀🌈 ",
        "score": 1455,
        "url": "https://i.redd.it/2dec8r70ry7d1.jpeg",
        "content": "",
        "num_comments": 66,
        "comments": [
            "The girl who bullied my sister to the point of making her suicidal got beaten to a bloody pulp by her boyfriend. Not gonna lie, it was really satisfying to hear that.",
            "Faik and Str8",
            "I wonder how well gay rapists clean up at bars. If you see a guy dragging a drunk woman out of a bar, there's a decent chance people will stop and at least try to confirm they know each other these days, two dudes leaving a bar isn't gonna bat any eyes even if one of them is being carried out on the other's shoulders completely passed out like a sack of potatoes.",
            "NGL that's gotta be pretty satisfying way to see someone you hate take themselves out lmao",
            "Zamn being so insecure you neck yourself as soon as a penis enters you.\n\nIf it were a woman who R&R’d him he’d be grinning ear to ear.",
            "Together , with the help of the zesty community. We can end bully boys 3000 🌈",
            "Thank you gay fren <3",
            "Not all anti-heroes wear capes. Some were BDSM fetish gear",
            "If you, as a man, get raped your options are: move on, kill self, become a /gif/ user (if rapist was black), or become a dom top zaddy.",
            "doing what they do best"
        ]
    }
}