{
    "4K Blu-ray Popular Topics Mega Hub": {
        "title": "4K Blu-ray Popular Topics Mega Hub",
        "score": 59,
        "url": "https://www.reddit.com/r/4kbluray/comments/1ahs3q6/4k_bluray_popular_topics_mega_hub/",
        "content": "Greetings, fellow 4K Collectors!\n\nWelcome to our Mega-Hub, where you can find a list of the most popular topics and frequently asked questions that are posted in this sub. If it's listed here, we recommend commenting within the listed posts below to avoid cluttering the main Reddit feed with similar conversations.\n\nAs always, we appreciate each and every one of you in this incredible community. Thanks for always contributing and making this place what it is!\n\n&#x200B;\n\n1. [4K Blu-ray Players - Selecting Dedicated Players, Consoles, FAQs (i.e. What player should I get?)](https://www.reddit.com/r/4kbluray/comments/1ahs3rv/4k_bluray_players_selecting_dedicated_players/)\n2. [4K Televisions - Types, Models, Brands](https://www.reddit.com/r/4kbluray/comments/1ahs3sl/4k_televisions_types_models_brands_faqs/)\n3. [HDR/Dolby Vision - HDR Technology, FAQs (i.e. Why is my screen so dark?)](https://www.reddit.com/r/4kbluray/comments/1ahs3ti/hdrdolby_vision_hdr_technology_faqs_ie_why_is_my/)\n4. [4K Blu-ray Transfers vs. Blu-ray Transfers vs. Streaming](https://www.reddit.com/r/4kbluray/comments/1ahs3ue/4k_bluray_transfers_vs_bluray_transfers_vs/)\n5. [Most Desired Titles You Want On 4K!](https://www.reddit.com/r/4kbluray/comments/106x8ms/your_most_desired_titles_on_4k_bluray_keep_topic/)\n\n&#x200B;",
        "num_comments": 31,
        "comments": [
            "Thank you for posting to r/4kBluRay! Check out our rules and community guidelines [here](https://www.reddit.com/r/4kbluray/comments/qxrjd6/mod_post_attention_new_guidelines_please_read/)!\n\nWe have a rather growing Discord community, join us [here](https://discord.gg/wZpRwSb9aD)! \n\nOur 10% off Zavvi Code (4KUHD) is down at this time. We will update everyone as soon as we hear back from Zavvi. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4kbluray) if you have any questions or concerns.*",
            "My God we've needed this 👏",
            "Cool, so instead of new posts, this subreddit is now just relegated to seven posts?",
            "OP, I appreciate the work you've done here to consolidate information on players, HDR, and transfer quality. A repository for this information will be invaluable to newcomers and has been needed for some time.\n\nI will suggest however, that the requirement for \"most desired\" titles to be limited to a single thread be removed. As I'm sure you are well aware, that thread does not generate much meaningful discussion on the the possibility, plausibility, and merits of particular films yet to be upgraded. Such discussion should generate enthusiasm within the community, and excitement at the prospect of future releases, as well as provide insight and speculation as to the likelihood of such an upgrade. Consider also, the potential visibility such threads would provide. If I google \"the holdovers 4k blu-ray\" for instance, the first search result links to an r/Bluray thread on the matter rather than one in this subreddit simply because one is not allowed to exist here. I propose that we allow perhaps one thread per film in the form \"Will X come to 4K Blu-ray\". Who knows, perhaps this visibility could even persuade some studios to move forward with a release or two.",
            "O.K., I don't know nothin' about nothin', so stay with me here, but isn't this just going to be a topic that goes disregarded? 😅 If I have something to discuss, I'll feel like it'll be ignored if I post here.",
            "Abyss 4K / Aliens 4K / True Lies 4K...  WTF happened?  It's like the distributor produced 1/3 of what was needed to meet demand on release day.  I should have driven like 5 hours to Canada and bought it there because it seems like Canadians got it on release day.\n\nEDIT: Revisiting this a few months later.  I ended up getting a copy of these through Walmart and thankfully mine all played without issue.  I think the problem isn't so much the distributor.  I have seen this in the past with Amazon where they have these little disputes with Disney so then Disney screws them on stocking things.  It seems like Walmart got a few shipments and then were filling online orders only (in store was unavailable) but Amazon kept delaying mine into May 2024.  And I pre-ordered this back in January or whenever the pre-order went live.",
            "I think this needs more thought - if deals or new announcements get rolled into one big thread nobody is going to see them.",
            "This is a great step and I appreciate you reading the community’s feedback.\n\nThat said, I genuinely think deals should be broken out. (We won’t see them.) \n\nAnd any chance we could do a weekly “Post Your Haul Here” post so stuff can be a bit more organized but not relegated to one mega thread?",
            "Any word on a Twister 4k UHD? Given the new movie this summer, I would have thought this would be a no brainer to release. I would easily purchase this.",
            "Would like to see Sliver released on 4k.  I know it's a long shot, but I'm a sucker for Sharon Stone when she was in her prime."
        ]
    },
    "60K Members --- Digital Code Giveaway!": {
        "title": "60K Members --- Digital Code Giveaway!",
        "score": 18,
        "url": "https://www.reddit.com/r/4kbluray/comments/1dlmz99/60k_members_digital_code_giveaway/",
        "content": "Hello, 4K Collectors!\n\nThree months ago, we hit an incredible milestone of 50K members on the sub. It's a bit mind-boggling, but in three short months, we just hit 60K!\n\nWe didn't expect this next milestone to happen this quickly, but it's definitely a testament to the passion people still have for collecting physical media...and we're all for it!\n\nWe've had a blast seeing more collectors join the community, seeing new collectors take the dive by posting their first hauls, and seeing everyone watch each other's backs with posting sales and release information. If you asked me a few years back if there would be this much of a massive growth, I wouldn't have believed you. It's incredibly reassuring knowing that collectors are out there --- and that this hobby will continue to endure. \n\nSo, you guys know what time it is...It's time for another giveaway! Please thank fellow community member u/Halflife84 for his graciousness in giving these codes back to the community. We appreciate you!!!\n\n*DISCLAIMER: Titles are only redeemable in the U.S. -- Sorry to our international friends!* \n\nHere are the titles up for grabs!\n\n**GIVEAWAY TITLES** \n\n***The following titles are redeemable only in the U.S. via*** [***Paramountmovies.com***](http://Paramountmovies.com) \n\n* Rosemary's Baby\n* Sweeny Todd: The Demon Barber of Fleet Street\n* Smile\n* Crawl\n* Scream 2\n* Scream 3\n\n***The following titles are redeemable only in the U.S. via*** [***lionsgate.com/redeem***](http://lionsgate.com/redeem)\n\n* Young Guns\n* The Mist\n\n**RULES**\n\nYou will need to comment on this post for an entry. Your comment *must contain the following*, or else it will be considered invalid:\n\n1. Please start the post with the three (3) films listed above that you want to enter for! (Winners will only receive one code, but this will give you an opportunity to win other films if your first selection is won by someone else). \n2. After identifying which films you're entering for, please write about a film you're still (unfortunately) waiting on to get a 4K Blu-ray release! Tell us why you're waiting for this film specifically (perhaps get into depth as to what the film means to you, what you're hoping 4K/HDR can bring to the table, how long you've been waiting, etc.). Effort is important here -- we like meaningful entries, not just one line comments.\n\nAnd it's as easy as that! Winners will be selected by **July 5th, 2024**. We will post the winners here and tag them. We appreciate ALL of you for being a part of this community. Thank you so much for making it what it is today. Without the 60,000 of you, there wouldn't be a sub to begin with. \n\nGood luck and have fun!\n\n*The 4K Mod Team* ",
        "num_comments": 18,
        "comments": [
            "Thank you for posting to r/4kBluRay! Check out our rules and community guidelines [here](https://www.reddit.com/r/4kbluray/comments/qxrjd6/mod_post_attention_new_guidelines_please_read/)!\n\nWe have a rather growing Discord community, join us [here](https://discord.gg/wZpRwSb9aD)! \n\nOur 10% off Zavvi Code (4KUHD) is down at this time. We will update everyone as soon as we hear back from Zavvi. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4kbluray) if you have any questions or concerns.*",
            "Rosemary’s Baby\nSweeney Todd\nScream 2\n\nI’m waiting on There Will Be Blood because the Blu Ray is sourced from the original 1080p DCP that PTA reluctantly made for theaters, because he wanted people so badly to see it in 35mm. He shot on extremely low ASA film and a proper rescan from the negative would be atrociously beautiful.",
            "Rosemary’s Baby\nYoung Guns\nThe Mist\n\nWaiting for Dogma on 4K, I would love to see this come out in 4K, the prices on the OOP Bluray are crazy, and I love Kevin Smith films. Sadly, I don’t even own this on DVD and I haven’t seen it in years. Which is why I would love a 4K release. \n\nThanks for the giveaway!",
            "* Crawl\n* Sweeny Todd: The Demon Barber of Fleet Street\n* Rosemary's Baby\n\nFor “Crawl” I saw it in theaters with my friend and we really enjoy it despite it’s poor marketing and that’s something since my friend rarely like horror/gory films. Given the movie takes place in mostly dark settings I’m hoping the HDR with keep the quality of what we saw in the theater. None of that glowing edge around certain object/people like what you usually get with non-HDR content. Been hoping to get “Paramount Scares: Volume 1” but it’s still a little too high for my budget.\n\nIf you were meaning a film not on the list than that would be “John Carter (of Mars)”. Despite the BD being pretty great, it still doesn’t meet the quality of what I saw in theaters. The HDR should hopefully fix that and then some. It’s a real shame Disney ignored its 10th anniversary in 2022. The movie actually did well on its opening weekend despite losing the number spot by a small margin compared with “The Hunger Games” which took that spot. One would even think that Disney would’ve released as a way to somehow exploit “Star Wars” fans as it’s one of the many inspirations for Lucas’ saga.\n\nThanks for your generosity and good luck to everyone.",
            "Rosemary’s Baby, Smile and The Mist.\n\nI would greatly appreciate seeing both Dogma and The Mothman Prophecies in true 4k!\n\nI’m lucky. I have a Blu-ray of Dogma from when it came out.\nHowever, I’m drawn to the minutiae of details within this movie… and Blu-ray just can’t show that level of information!\n\nSadly, Mothman Prophecies is only available as a DVD. It is an atmospheric movie that would have so much more to offer in 4k!\n\nI hope to see both of these in 4k within my lifetime!",
            "1) Rosemary’s Baby, Sweeny Todd, and Young Guns\n\n2) The first film I desperately want a 4k release of is Stargate (1994). This film, while not only being one of the best sci-fi films of the 90s, also holds a special place for me in my personal history of physical media. This was the first movie my family watched after buying a new Sony Wega tv and dvd player. We rented it from our local video store, Carbonated Video, and it was mind blowing. The picture was so crisp and clean, the colors vibrant, and no VHS ever looked the same after it. Also this film is excellent and deserves a UHD release. This is the one!\n\nAnother film I am now rooting for 4k release is Wim Wender’s Directors Cut of Until the End of the World. As of now it is only available as Blu-ray, which apparently was made from a 4K master, according to blu-ray.com. So if there’s a 4k master, where’s the disc?! Anyways with Wenders’ Perfect Days releasing in 4k in July, I can only hope we might get another 4k Wenders’ film.",
            "Sweeney Todd, Crawl, Smile \n\nI am really looking forward to Fantastic Mr. Fox getting a 4K release. I have always been a fan of animated movies but never really got into stop motion films, so after hearing that this was a great one I decided to check it out and was left with an incredible experience! It was my first Wes Anderson movie as well and is still to date my favorite from him. I just adore all of the visuals, characters, and music in the movie. Being able to see all of the stop motion elements in 4K would certainly make the movie even better, so I really hope it happens one day!",
            "Young Guns _ Sweeny Todd _   The Mist\n\nI am really looking forward to Tombstone. I always loved that movie, and we used to watch it as a family every Christmas. I will definitely Preorder day 1 that is is available.",
            "Wow 60k of us. Good to know physical media is important to so many others. Congrats.",
            "Scream 2\n \nScream 3\n \nThe Mist"
        ]
    },
    "4 years ago, I had just three UHD movies. I blame you all for this:": {
        "title": "4 years ago, I had just three UHD movies. I blame you all for this:",
        "score": 324,
        "url": "https://i.redd.it/zzdddlfubd9d1.jpeg",
        "content": "Look what you have turned me into. I’m running out of space!",
        "num_comments": 67,
        "comments": [
            "Thank you for posting to r/4kBluRay! Check out our rules and community guidelines [here](https://www.reddit.com/r/4kbluray/comments/qxrjd6/mod_post_attention_new_guidelines_please_read/)!\n\nWe have a rather growing Discord community, join us [here](https://discord.gg/wZpRwSb9aD)! \n\nOur 10% off Zavvi Code (4KUHD) is down at this time. We will update everyone as soon as we hear back from Zavvi. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4kbluray) if you have any questions or concerns.*",
            "Sounds like an amazing problem to have. You're welcome!!\n\nHow's that backlog looking?",
            "Where did you get the MCU set from? I’ve never seen that box before.",
            "If the 4K discs didn’t look so damn good, we wouldn’t have these problems.  At least we aren’t blowing our money on meth!",
            "You’re welcome!",
            "I want that Evil Dead boxset so bad!",
            "![gif](giphy|xpcZyqmWd4DsX0Nb9z)",
            "Nice cabinet",
            "![gif](giphy|YmQLj2KxaNz58g7Ofg)\n\n🤣",
            "Is your bank account currently crying? Begging you to stop?"
        ]
    },
    "Jaws UHD vs Jaws Blu ray": {
        "title": "Jaws UHD vs Jaws Blu ray",
        "score": 82,
        "url": "https://www.reddit.com/gallery/1dqyd80",
        "content": "Is it just me or does the blu ray look slightly better than the UHD? I have been comparing my dvd’s, blu rays and UHDs when I get a new one. Was doing this with Jaws and noticed that the blu ray looks slightly better than the uhd, the color looks richer and the motion of the film seems more filmic and fluid. The uhd looks a bit more washed out and judderey, I noticed that hdr Dolby vision was on for the uhd. First pic is the blu ray, second is the UHD.\n",
        "num_comments": 49,
        "comments": [
            "Thank you for posting to r/4kBluRay! Check out our rules and community guidelines [here](https://www.reddit.com/r/4kbluray/comments/qxrjd6/mod_post_attention_new_guidelines_please_read/)!\n\nWe have a rather growing Discord community, join us [here](https://discord.gg/wZpRwSb9aD)! \n\nOur 10% off Zavvi Code (4KUHD) is down at this time. We will update everyone as soon as we hear back from Zavvi. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4kbluray) if you have any questions or concerns.*",
            "I would say the colour looks much more natural on the 4K. The Blu-ray looks far too saturated, unnatural.",
            "Based on other comparisons (that use screencaps), I think that the 4K is way better. Taking a picture with your phone loses so much color information and detail that you can't really judge it.",
            "OP for starters, do you even have the same TV settings in effect for Blu-ray vs 4K? A lot of TVs switch modes when in HDR picture mode so this is worth checking. You're going to want to dial in your TV settings as best you can, what's the TV model? You should look up and follow RTINGs calibration guide for your TV model, keeping in mind different TV inputs and devices may all have their own default configurations, on top of standard vs HDR modes. Most likely a lot of the differences seen here are due to your TV calibration rather than Blu vs 4K.",
            "I just rewatched my 4k and I think it's one of the best transfers that I own.",
            "HDR is seemingly normalizing the color temperature for you whereas your Blu-ray copy (displayed in SDR) is way, way too oversaturated. \n\nI would make sure your TV is properly calibrated across all modes/inputs. Jaws is one of the best transfers out there, and that picture of a very red Roy Schneider tells me your TV is improperly calibrated and artificially saturating and sharpening your SDR content. If your TV is set to “standard” and you claim the SDR Blu-ray’s motion seems more “fluid,” you’re going to want to make sure you don’t have motion smoothing and image processing gunk enabled giving you that artificial fluidity.",
            "The 4K handily surpasses the blu-ray in terms of fine detail, grain retention, and color depth. \n\nEither your SDR viewing settings are cranked too high or your 4K HDR settings aren’t calibrated properly.",
            "\"We're gonna need a bigger OLED.\"",
            "First pic has disgusting coloring for skin tone. Second looks More natural.",
            "Naw Jaws is beautiful in 4k!"
        ]
    },
    "Arrow video is releasing Friday The 13th (2009) in 4K.": {
        "title": "Arrow video is releasing Friday The 13th (2009) in 4K.",
        "score": 66,
        "url": "https://i.redd.it/etdq34otre9d1.png",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Thank you for posting to r/4kBluRay! Check out our rules and community guidelines [here](https://www.reddit.com/r/4kbluray/comments/qxrjd6/mod_post_attention_new_guidelines_please_read/)!\n\nWe have a rather growing Discord community, join us [here](https://discord.gg/wZpRwSb9aD)! \n\nOur 10% off Zavvi Code (4KUHD) is down at this time. We will update everyone as soon as we hear back from Zavvi. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/4kbluray) if you have any questions or concerns.*",
            "I hope we get news for the elm street 4k.",
            "I would like it more if it wasn’t tied to Friday the 13th and was it’s own thing. \nThere’s some smokin’ girls in it too so, that helps.",
            "Really random release for them but I love the artwork!",
            "I shouldn’t, but I’ll buy it. Not sure why they didn’t get interviews with some of the main actors. It’s not like any of them are so big time that they wouldn’t do it. Quite the opposite really.",
            "We’re getting the goddamn Nightmare on Elm Street remake on 4K before we’re getting the original, aren’t we? Arrow has been doing a lot of 4K upgrades of crappy remakes from WB that no one asked for, may as well do that one too. Fuck it. Didn’t they get any good movies from the WB deal?",
            "damn this will be amazing!",
            "I ordered it. The only thing wrong with the film was the master of it. Horrible!!! So I hope this 4K remaster gives it the proper treatment.",
            "This is gonna look awesome. I hope we get 2-4 on 4K soon.",
            "That movie blows."
        ]
    }
}