{
    "EXAMS MEGATHREAD 25/05 (AEA)": {
        "title": "EXAMS MEGATHREAD 25/05 (AEA)",
        "score": 22,
        "url": "https://www.reddit.com/r/6thForm/comments/1do0iv9/exams_megathread_2505_aea/",
        "content": "# Hey everyone! Best of luck with your exams on the 25th June!\n\n&#x200B;\n\nokay this post is mostly just me trolling, but if you are doing the AEA then good luck lmao\n\n&#x200B;\n\n*what? more exam megathreads? i thought exams were done?* not quite!\n\n&#x200B;\n\nFew things:\n\n* **Don't share** too many specific **details** about **questions** or **answers**, these papers will be used as future mocks.\n\n&#x200B;\n\n* Sometimes papers get leaked, this is not the subreddit to discuss that.\n\n&#x200B;\n\n* **Exam discussion posts outside of this will generally be removed to combat the inevitable tidal wave of spam otherwise.** (for context there's been over 300 spam posts already!)\n\n&#x200B;\n\n* We're taking a different approach this year due to negative feedback last year. We hope this approach will be better (also to note, we can only have 2 pinned posts).\n\n&#x200B;\n\n* Please note some content will take extra time to be reviewed.\n\n&#x200B;\n\n* You can still talk about your exam here even if it isn't explicitly mentioned in the title.\n\n&#x200B;\n\n**Best of luck, and let us know how you're feeling down below!**\n\n&#x200B;\n\n[cat \\(and a trolley\\)](https://preview.redd.it/c08m2weabo8d1.png?width=1214&format=png&auto=webp&s=1c8091a2c09d0dffa6351c7d3d7472b559d3c040)\n\n&#x200B;\n\n*-The* [r/6thForm](https://www.reddit.com/r/6thForm/) *Team*\n\n&#x200B;\n\n***Have any concerns or feedback?***\n\nFeel free to reach out to us on [Modmail](https://www.reddit.com/message/compose?to=/r/6thForm) and we'll aim to get back to you as soon as possible!",
        "num_comments": 23,
        "comments": [
            "I just checked a past paper on whatever this is and oh its nasty. 3 hour exam assessing all A-level maths content WITH NO CALCULATOR!?!?!?!?",
            "who tf does AEA bot aah jits",
            "Did anyone get that for one of the k values the sequences one it’s 4/3 and the trig one is 1/7",
            "It was so bad ☠️☠️☠️☠️☠️ I think I’m getting 15 max",
            "What did people get for the first q :((",
            "You don’t really need a calculator lol",
            "It’s an extra exam with A Level Math content that’s worth UCAS points. I’m doing it this afternoon",
            "That’s what I asked. I’m so confused??? What exams are these ???",
            "Got 1/7 for the trig :)",
            "the sequences one was k = 1/3, but yes the trig was 1/7"
        ]
    },
    "EXAMS MEGATHREAD 24/06 (A-level FM, RS) etc": {
        "title": "EXAMS MEGATHREAD 24/06 (A-level FM, RS) etc",
        "score": 19,
        "url": "https://www.reddit.com/r/6thForm/comments/1dnafh8/exams_megathread_2406_alevel_fm_rs_etc/",
        "content": "# Hey everyone! Best of luck with your exams on the 24th June!\n\n&#x200B;\n\nfuck this shit i'm out tralalalalalala\n\n&#x200B;\n\nFew things:\n\n* **Don't share** too many specific **details** about **questions** or **answers**, these papers will be used as future mocks.\n\n&#x200B;\n\n* Sometimes papers get leaked, this is not the subreddit to discuss that.\n\n&#x200B;\n\n* **Exam discussion posts outside of this will generally be removed to combat the inevitable tidal wave of spam otherwise.** (for context there's been over 300 spam posts already!)\n\n&#x200B;\n\n* We're taking a different approach this year due to negative feedback last year. We hope this approach will be better (also to note, we can only have 2 pinned posts).\n\n&#x200B;\n\n* Please note some content will take extra time to be reviewed.\n\n&#x200B;\n\n* You can still talk about your exam here even if it isn't explicitly mentioned in the title.\n\n&#x200B;\n\n**Best of luck, and let us know how you're feeling down below!**\n\n&#x200B;\n\n[cat](https://preview.redd.it/0a50zmi90i8d1.png?width=1068&format=png&auto=webp&s=900b759204e40280010354fef22abec2764d681e)\n\n&#x200B;\n\n*-The* [r/6thForm](https://www.reddit.com/r/6thForm/) *Team*\n\n&#x200B;\n\n***Have any concerns or feedback?***\n\nFeel free to reach out to us on [Modmail](https://www.reddit.com/message/compose?to=/r/6thForm) and we'll aim to get back to you as soon as possible!",
        "num_comments": 73,
        "comments": [
            "Have i woken up in an alternate dimension?!?!?! I stg exams finished or am i going crazy????",
            "anyone did STEP III? thoughts?",
            "If I hasn't done so well on CP1&2 and FP1, my A* would guaranteed have been taken from me by FP2, that exam had some mean integrals\n\nStill pretty confident though",
            "That FP2 paper was hard but doable. I'm very happy.",
            "did anyone do RE Buddhism edexcel today?",
            "People are still doing A levels?",
            "Damn I thought Friday was the last day. These poor souls.",
            "I think today was the final day",
            "I did 134567 but only actually finished q1, it was a pretty nice paper in general, definitely a lot better than step II imo",
            "I did 123567 and honestly it was the easiest step 3 paper I did, the content isn't difficult there's no trig or even calculus and also the trace question was really nice"
        ]
    },
    "What job opportunities are there that a maths degree can be used for ": {
        "title": "What job opportunities are there that a maths degree can be used for ",
        "score": 9,
        "url": "https://www.reddit.com/r/6thForm/comments/1dratg8/what_job_opportunities_are_there_that_a_maths/",
        "content": "",
        "num_comments": 12,
        "comments": [
            "All of finance, machine learning, data analysis for literally any company, and the list goes on. You can get pretty much any STEM adjacent job with a maths degree.",
            "Finance, teaching (duh), data science, government likes statisticians (also for data), cryptography/cyber security",
            "How did you get such good predicteds",
            "glazing ur teachers for the entirety of y12 does wonders",
            "Having no life. I'm on an Oxford maths and physics program and I spend most of my time either doing the maths questions from there or doing STEP questions, cos I find them fun. I also did at least one past paper a day over Easter holidays leading up to my mocsk.",
            "For physics sure (I barely scraped an A, really didn't deserve an A\\* lol) but for my other subjects I just did really well on the tests. I had the highest marks in the school on my mocks for Maths, FM and CS.",
            "I did a maths degree. My cohort have done a number of other jobs such as quants for finance, actuary, various data science roles and analyst roles in Airbus, supermarkets, government, NHS, energy companies, sports betting, etc. You could also apply to a number of quantitative masters programmes to specialise. Most things with data.\n\n\nI'm a statistician and have worked on clinical trials and in consulting however, you will likely need a statistics masters at a minimum to be a statistician. Many roles ask for a PhD. In bio, you can work for pharmaceutical companies, CRO's, academia, charities, etc.",
            "yh so basically everything",
            "Anything STEM realistically",
            "[removed]"
        ]
    },
    "Loreto Vs Xaverian ???? which is better": {
        "title": "Loreto Vs Xaverian ???? which is better",
        "score": 4,
        "url": "https://www.reddit.com/r/6thForm/comments/1drai5s/loreto_vs_xaverian_which_is_better/",
        "content": "i am still deciding whether i should go to loreto or xaverian because i was given admission into both of them.\n\n-i heard loreto is a very good school and its aesthically pleasing\n\n-whereas xaverian is much closer to my house ( not very close though but the closest one ).",
        "num_comments": 1,
        "comments": [
            "Both are decent Sixth Form colleges. My friend went to Xaverian as part of the Foundation Year for Biomed at Manchester uni, said they had great provisions, teachers were super friendly and chill. \n\nIt’s rlly your choice, based on your specific needs and priorities.. if it helps, check out the 2023 A Level results for both sixth forms to help you decide."
        ]
    },
    "Can you do side hustle/ earn from YouTube while holding a student visa (tier 4) in the UK?": {
        "title": "Can you do side hustle/ earn from YouTube while holding a student visa (tier 4) in the UK?",
        "score": 4,
        "url": "https://www.reddit.com/r/6thForm/comments/1dr9n5f/can_you_do_side_hustle_earn_from_youtube_while/",
        "content": "Well I might sound dumb. But I’ve seen so many students earn from side hustle, YouTube, Freelancing etc while on a student visa. How’s it possible? And how are they not facing any consequences? ",
        "num_comments": 3,
        "comments": [
            "You're allowed 20 hours of employment a week during term time. Self employment and business are not allowed",
            "If you are asking about (Bristol or any other uni) putting you \"on hold\", this is a very frequently asked question. Being put on hold does not indicate you are going to get rejected. It means your application hasn't been processed yet. Nothing more, nothing less.\n\nPlease also remember to search for your questions before asking them, it helps cut down on repetitive content and gets you your answers quicker.\n\nYours sincerely, Forsaken-Meaning-232's clipboard.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/6thForm) if you have any questions or concerns.*"
        ]
    }
}