{
    "✨ User Flair Requests ✨": {
        "title": "✨ User Flair Requests ✨",
        "score": 2,
        "url": "https://www.reddit.com/r/90dayfianceuncensored/comments/1diirre/user_flair_requests/",
        "content": "Leave your request for user flairs here 🙂\n\n**How to add user flairs:**\n\nOn mobile:\n\n* At the top of the subreddit, click the •••\n\n* Select “Change User Flair”\n\n* Make sure “Show my user flair on this community” is switched on\n\nOn desktop:\n\n* On the right side menu, under the “Create Post” button, there should be a place to edit your user flair.",
        "num_comments": 12,
        "comments": [
            "Paradise Administrator",
            "Running a Goddamn Whore Ring  (censor if need be)",
            "No creature on 🌎, except for my 🐶, is ever going to control me!",
            "Sexy time",
            "No, I am sexy baby",
            "You want to feel her like a clown 🤡🤚🏼",
            "Egg Toter; \nTe Amo; \nPaul’s Mom’s Lock of Hair",
            "🇧🇷 YOU ARE A SLUT 🇧🇷",
            "I don’t know what I remember",
            "Haunted Casserole\n\n\nin honor of what Darcey has done to her face."
        ]
    },
    "That “seksi” necklace makes me irrationally angry": {
        "title": "That “seksi” necklace makes me irrationally angry",
        "score": 139,
        "url": "https://i.redd.it/6i85syfr5f9d1.jpeg",
        "content": "",
        "num_comments": 41,
        "comments": [
            "GD Mykul really dodged this bullet. That face is terrifying. 😳",
            "My dyslexic brain thought it said skeksi and thought it was a pretty apt description of you’ve ever seen The Dark Crystal",
            "Take solace that in parts of the world, her necklace is saying that she eats shit (食屎)",
            "😂😂😂 And the Etsy seller still proudly associates it with her. I guess she still has enough devotees. Like her favorite president. 🤮",
            "So - if u ever grew up in the 80/90 in a small southern town, there were people who just shaved their kid’s head if they got lice. I wanna shave her head and start over from the damage.",
            "No, it's actually rational anger you're feeling.",
            "Honey, it is not irrational, I promise you!! I think if it didn’t piss us off, that would be MORE irrational 😂",
            "She looks like a piece of leather with pubes on top that was left in a microwave for 9 years.",
            "Me too.",
            "So not deserving of that title 🤢"
        ]
    },
    "Holy fucking shit": {
        "title": "Holy fucking shit",
        "score": 129,
        "url": "https://i.redd.it/6ug9fldu7f9d1.jpeg",
        "content": "",
        "num_comments": 97,
        "comments": [
            "Whoever keeps injecting her lips and face should be fired and lose their licence",
            "Remember those wax lips we had has kids?",
            "Next her whole face is just going to be a pair of lips",
            "This is so sad.",
            "I wonder what she thinks she looks like.",
            "![gif](giphy|5xtDaro8cAR8KG7qf7O)\n\nEvery time I see her now.",
            "And that’s filtered. Wonder how she looks unfiltered.",
            "holy fucking macroplastics in this woman….",
            "What is that?",
            "Jesse sucked but he sure dodged a bullet"
        ]
    },
    "If you’re gonna look like this, you can’t also have a shitty personality…": {
        "title": "If you’re gonna look like this, you can’t also have a shitty personality…",
        "score": 315,
        "url": "https://i.redd.it/n6t4f4tn3d9d1.jpeg",
        "content": "Like girl pick a struggle!! 💀",
        "num_comments": 132,
        "comments": [
            "\"Hold my beer\" - Big Ed",
            "To everyone who said they were done with Ed… Behold! Edwina. Ed 2.0. FemEd-FEd.",
            "It's really not cool to have a shitty personality no matter how you look though.",
            "The sad thing is she probably has the shitty personality because she looks like that. She’s probably insecure and always on the defense",
            "FACTSSS!! shes got a horrible personality! disagreeable, not willing to try new things, poor attitude AND ugly...doesnt work like that sis",
            "She’s brings nothing to the table except an escape to England for a shady immigrant.",
            "Who is this? Big Edna? I dont watch UK, should I?",
            "I wonder if she’ll watch herself back and realize how awful she is to be around. Maybe that’ll be her “ah-ha” moment to be a better person. I’m guilty of complaining a lot but godayum it’s like nothing makes her happy except for food.",
            "I had a friend who looks and acts like this…",
            "When I was in England last summer, our hilarious tour guide told us that people from Newcastle were like England’s Jersey Shore and that’s all I can think about when I see her because that’s where she’s from."
        ]
    },
    " Kyle's car spotted in the wild": {
        "title": " Kyle's car spotted in the wild",
        "score": 114,
        "url": "https://i.redd.it/4m3ah4fube9d1.jpeg",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Nothing say douchebag like truck nuts",
            "Truck nuts are a points violation, kyle. You lose 69 points and must atone via permanent exile.",
            " I hope he reads this and has a life change",
            "🤮🤮🤮",
            "Omg 😱",
            "Ugh why does it have to be Iowa. We have some weird ones",
            "Not surprising that someone with such crap in the windows would also have blue balls",
            "With how much half of our population loves trying to call everyone \"groomers\" - how is it that they're the same ones who openly put realistic life-size recreations of male genitalia on the exterior of their cars where kids are exposed to it? And 'F*** certain prez candidate' stickers and stuff like that?\n\nI'd love for more people to turn the 'groomer' label back on them!",
            "![gif](giphy|24G0CDx1ET7TGs7EuA|downsized)",
            "ANOTHER FAKE... OK... seriously... when is the internet gonna go back to normal again? I am struggling to find content that is real or hasn't been photoshopped of edited in any way... Why do people do this? Can't be for attention because no one knows who they are... Oh proof? Lettering, window glare, colouring behind letters, the side mirror, the reflections, the tyres, the bumper, the road... Everything here has been chopped and changed... Seriously, what's the deal? AND why does it piss me off so much?"
        ]
    }
}