{
    "✨ User Flair Requests ✨": {
        "title": "✨ User Flair Requests ✨",
        "score": 2,
        "url": "https://www.reddit.com/r/90dayfianceuncensored/comments/1diirre/user_flair_requests/",
        "content": "Leave your request for user flairs here 🙂\n\n**How to add user flairs:**\n\nOn mobile:\n\n* At the top of the subreddit, click the •••\n\n* Select “Change User Flair”\n\n* Make sure “Show my user flair on this community” is switched on\n\nOn desktop:\n\n* On the right side menu, under the “Create Post” button, there should be a place to edit your user flair.",
        "num_comments": 12,
        "comments": [
            "Running a Goddamn Whore Ring (censor if need be)",
            "No creature on , except for my , is ever going to control me!",
            "No, I am sexy baby",
            "You want to feel her like a clown ",
            "Egg Toter; \nTe Amo; \nPauls Moms Lock of Hair",
            " YOU ARE A SLUT ",
            "I dont know what I remember",
            "I am your Ken Doll from Alibaba (Sarper utters this in the new season).",
            "Ill take Repulsive Things for $500, Alex.",
            "Haunted Casserole\n\n\nin honor of what Darcey has done to her face."
        ]
    },
    "Avery is a beautiful woman, glad she walked away from TLC and created own life. 👏👏👏": {
        "title": "Avery is a beautiful woman, glad she walked away from TLC and created own life. 👏👏👏",
        "score": 317,
        "url": "https://i.redd.it/8797qh47ci9d1.jpeg",
        "content": "",
        "num_comments": 63,
        "comments": [
            "Would she be hawking products on social media without being on TV?",
            "She looks so much like her mom",
            "Sounds like Avery and Omar got out before the franchise could destroy their relationship.\n\nHappy for both of them!",
            "Despite so much criticism of her decisions and age to be making those decisions, she's done really well and ultimately, her critics were wrong. \n\nI'm glad they're happy.",
            "The couples that keep coming back are always the most toxic. So happy for her and her new life!",
            "Walked away from tlc? Her season ended lmao",
            "I love them! Yes she used her TV fame to build a perfume empire, but Omar still does work a real job and she also plans to work there with him too in the future.",
            "Is it me or does anyone else see her strange expression? She looks like shes disassociated, checked out, whatever you want to call it.",
            "They were my favorite couple.  No deama.  So glad he got here and his license to practice dentistry.  Wish them all the best!",
            "lol shes turned into another race. Went from Caucasian to brown"
        ]
    },
    "That “seksi” necklace makes me irrationally angry": {
        "title": "That “seksi” necklace makes me irrationally angry",
        "score": 268,
        "url": "https://i.redd.it/6i85syfr5f9d1.jpeg",
        "content": "",
        "num_comments": 70,
        "comments": [
            "Take solace that in parts of the world, her necklace is saying that she eats shit ()",
            "My dyslexic brain thought it said skeksi and thought it was a pretty apt description of youve ever seen The Dark Crystal",
            "GD Mykul really dodged this bullet. That face is terrifying. ",
            " And the Etsy seller still proudly associates it with her. I guess she still has enough devotees. Like her favorite president. ",
            "So - if u ever grew up in the 80/90 in a small southern town, there were people who just shaved their kids head if they got lice. I wanna shave her head and start over from the damage.",
            "No, it's actually rational anger you're feeling.",
            "Sekcsi boiled ballsac is still boiled ballsac",
            "Honey, it is not irrational, I promise you!! I think if it didnt piss us off, that would be MORE irrational ",
            "She looks like a piece of leather with pubes on top that was left in a microwave for 9 years.",
            "So not deserving of that title "
        ]
    },
    "Holy fucking shit": {
        "title": "Holy fucking shit",
        "score": 240,
        "url": "https://i.redd.it/6ug9fldu7f9d1.jpeg",
        "content": "",
        "num_comments": 148,
        "comments": [
            "Whoever keeps injecting her lips and face should be fired and lose their licence",
            "Next her whole face is just going to be a pair of lips",
            "Remember those wax lips we had has kids?",
            "I wonder what she thinks she looks like.",
            "![gif](giphy|5xtDaro8cAR8KG7qf7O)\n\nEvery time I see her now.",
            "And thats filtered. Wonder how she looks unfiltered.",
            "holy fucking macroplastics in this woman.",
            "Do you still need airbags in your car with that much lip filler to protect your face?",
            "I'm so mad for her that her doctors just keep doing the surgeries and dont diagnose her with severe body dysmorphia..she needs therapy not all this..",
            "If her eyes get any closer together theyll cross."
        ]
    },
    "If you’re gonna look like this, you can’t also have a shitty personality…": {
        "title": "If you’re gonna look like this, you can’t also have a shitty personality…",
        "score": 370,
        "url": "https://i.redd.it/n6t4f4tn3d9d1.jpeg",
        "content": "Like girl pick a struggle!! 💀",
        "num_comments": 153,
        "comments": [
            "It's really not cool to have a shitty personality no matter how you look though.",
            "\"Hold my beer\" - Big Ed",
            "The sad thing is she probably has the shitty personality because she looks like that. Shes probably insecure and always on the defense",
            "To everyone who said they were done with Ed Behold! Edwina. Ed 2.0. FemEd-FEd.",
            "I wonder if shell watch herself back and realize how awful she is to be around. Maybe thatll be her ah-ha moment to be a better person. Im guilty of complaining a lot but godayum its like nothing makes her happy except for food.",
            "FACTSSS!! shes got a horrible personality! disagreeable, not willing to try new things, poor attitude AND ugly...doesnt work like that sis",
            "When I was in England last summer, our hilarious tour guide told us that people from Newcastle were like Englands Jersey Shore and thats all I can think about when I see her because thats where shes from.",
            "I had a friend who looks and acts like this",
            "Shes brings nothing to the table except an escape to England for a shady immigrant.",
            "Who is this? Big Edna? I dont watch UK, should I?"
        ]
    }
}