{
    "Weekly No Stupid Questions Thread": {
        "title": "Weekly No Stupid Questions Thread",
        "score": 1,
        "url": "https://www.reddit.com/r/ableton/comments/1dn00lp/weekly_no_stupid_questions_thread/",
        "content": "You got them, so ask them.\n\n&#x200B;\n\nRemember to \\[read the manual\\]([https://www.ableton.com/en/manual/welcome-to-live/](https://www.ableton.com/en/manual/welcome-to-live/)), \\[check the Ableton's help pages\\]([https://www.ableton.com/en/help/](https://www.ableton.com/en/help/)) and read the sidebar for \\[resource thread\\]([https://redd.it/zkhqhe](https://redd.it/zkhqhe)). while you await an answer.\n\n&#x200B;\n\nAlso we have a discord server where you can get help ---> [https://discord.gg/WwNyH86](https://discord.gg/WwNyH86)\n\n&#x200B;\n\n\\[BLM\\]([https://redd.it/gxe35q](https://redd.it/gxe35q)). \\[SAH\\]([https://anti-asianviolenceresources.carrd.co/](https://anti-asianviolenceresources.carrd.co/)).  \\[Pinkbook\\]([https://www.pinkbook.us/](https://www.pinkbook.us/)).",
        "num_comments": 25,
        "comments": [
            "Hi, I just got ableton 11 and I've googled this for the past 20 minutes and i think im searching it wrong so I've come here. I dragged a clap from the library into my drum rack and i want my song to be at 80 bpm but the clap is a smidge too fast. HOW DO I SLOW IT DOWN. where is the knob for it. I've asked bard, i've googled i cannot find it. Someone please help",
            "Undo sometimes doesnt work properly? Often times undo will move what ever parameter i changed back but not to what it was originally at. I mainly notice this happen in 3rd party plugins. Also times the space bar doesnt allow me to play/stop when im in 3rd party plugins. I would have to click out of it to get it to work again.",
            "This is borderline, and I think I know the answer but here goes: I made a huge project and now I want to delete all the WAV files I used. Will they still play within the project if I delete them from the computer?",
            "Currently banging my head against the wall.\n\nI am trying to connect a used keyboard (M-Audio Keystation 88) to Ableton. I am doing so via a 5-pin midi to USB adaptor connecting it straight to my computer. The connection is recognized in \"input ports' and \"output ports\", but the Midi track in indicator and Midi track out indicator show no signal going through. Any advice? Please help.",
            "From the Ableton manual (Live Concepts, Arrangement vs Session): \"However, it is important to understand that **toggling or swapping the views simply changes the appearance of the Live Set and does not switch modes, alter what you hear or change what is stored.**\"\n\nWhat is the bolded supposed to mean? What \"modes\" is this referring to?",
            "What are good free altenatives to Ableton to start music producing?",
            "Polyverse Manipulator is pretty magical. Independent pitch and formant controls and it somehow works with unnoticeable latency.",
            "Check the recording input on the track. If its set to resample this can cause it to pick up.",
            "I think the issue is the BPM of the clap track. You need to make sure in the clip view of the track it is set to its original bpm.",
            "I'm honestly a bit confused by what you are asking. Do you mean that the sample fades out too fast? Or something else? Because if you set the global bpm to 80, then the clap will also be at 80 bpm. Could you maybe share a screenshot of the sample in the drum rack? And maybe an audio snippet? Then I might be able to help you."
        ]
    },
    "What did you make in Live this week? / Feedback thread": {
        "title": "What did you make in Live this week? / Feedback thread",
        "score": 2,
        "url": "https://www.reddit.com/r/ableton/comments/1dq60qn/what_did_you_make_in_live_this_week_feedback/",
        "content": "Share what you've made in Live this week.  Optionally, if you want comments/feedback on what you're sharing,\n\n&#x200B;\n\n1.  Leave a useful comment on another person's post in the thread.\n\n&#x200B;\n\n1. Ask for specific feedback when you post in the thread.\n\n&#x200B;\n\n1. ??????\n\n&#x200B;\n\n1.  \\*\\*PROFIT.\\*\\*\n\n&#x200B;\n\nIf you don't want to wait for the relevant weekly posts to share your creations, /r/madewithableton is linked in the sidebar.\n\n&#x200B;\n\nWe also have a discord where you can get feedback (after giving some of your own, of course) ---> [https://discord.gg/WwNyH86](https://discord.gg/WwNyH86)\n\n&#x200B;\n\n\\[BLM\\]([https://redd.it/gxe35q](https://redd.it/gxe35q)). \\[SAH\\]([https://anti-asianviolenceresources.carrd.co/](https://anti-asianviolenceresources.carrd.co/)). \\[Pinkbook\\]([https://www.pinkbook.us/](https://www.pinkbook.us/)).",
        "num_comments": 18,
        "comments": [
            "Im an ableton noob, so I find this really inspiring! I think it sounds amazing. I obviously cant give a critique, just know that I really like it and would be psyched if I could produce something half as good!",
            "I see the direction you are going with it and structure, style are in the right areas. Im listening with AirPods but the mix feels left side heavy. The distorted rhythm guitar is overpowering a lot of the mix, specifically on the left side and blowing out the midrange of the track. Id try and dial back the distortion and reset the stereoscape. Think about what you want coming from the left and right sides and how wide. That will free up the center for your vocals, kick etc. And dont pan everything far right and left! I made that mistake a lot early on and I just created mud at the edges instead of the middle. Happy to chat more if you want!",
            "I really like the direction of the overall sound you have! I will say that I found it a little hard on the ears, even for me as someone who loves heavily distorted guitar. I'm definitely not a pro and am still learning myself, I imagine some more EQ on the guitar could do the trick.. I know that's vague and not super helpful but overall I like the vibe you have going!",
            "Really appreciate the feedback. Agree on your points. Will definitely take you up on the collab option. DM sent! ",
            "Thank you!! Ah I forgot to mention the drums are programmed haha. Im very new to programming drums and its such a pain in the ass, ideally Id like to have someone track them for me but thats another beast. I appreciate the feedback! And Ill definitely look into those mastering tutorials!",
            "Thanks for giving it a listen, really appreciate the thorough and clear feedback. Going back to it I think you're right about it being left-heavy and the guitars muddying up the mix. Curious if you found the mix overly harsh when listening on the airpods? I'm trying to maintain a 'punchiness' to the drums and guitar without blowing out people's eardrums, haha.\n\nI think I'll start the mix from scratch and give it another go with those things in mind. Would love you get your opinion once that's done if you're down!",
            "Thanks for listening! That's super helpful to hear. Trying to strike a balance of \"punchiness\" without being overly harsh on the ears and might of gone too far on this mix. Appreciate the feedback :)",
            "I think in general the ideas and then are really really good. I dont find alot of stuff posted in the share pages very interesting but this is pretty good\n\nIt still feels really empty - especially the begging, and the mix down is really messy\n\ni think the structure is fine and works, maybe the intro could be a little bit shorter but it works - if it had a few more elements and effects it would be a little more interesting and wouldnt need to be shorter \n\nId be interested in collabing on this if youre keen, Im a producer and audio engineer (recording, mixing, mastering). Flick me a DM if youre interested",
            "Biggups!  Really think you nailed the vibe and genre \n\nI'm still quite new so take my feedback lightly, but I thought the live recordings were solid across the board.  \n\nIt did sound like the drums were programmed, which kind of pulls the listener out a bit.  If not programmed, then maybe mix the snare to sit a bit more in the mix? \n\nAlso it feels like it might be peaking towards the ending, so maybe a shelf or hi cut in the guitars\n\nGreat summer beach song! \n\nEdit: Re: mastering, LNA audio has a great A-Z mixing and mastering guide on YT only using stock Ableton plugins, but imho my favorite have been the fabfilter video series",
            "I like it !\n\nTo add more feedback, I'd say that the drums felt a little bit out of the song ? I don't really know how to phrase it but they felt apart from the other instruments\n\nAlso I think that there should be more of a difference between the verses and the chorus, but overall great work !"
        ]
    },
    "Tuning drums": {
        "title": "Tuning drums",
        "score": 2,
        "url": "https://www.reddit.com/r/ableton/comments/1dr9z6t/tuning_drums/",
        "content": "Greetings from Paris, France :)\n\nI’d like to tune my drum shots (kick, snare,…) but the ableton tuner doesnt seem to work with drums (signal does go in the plugin).\n\nHow do you tune your drums ?\n\nThanks a lot !",
        "num_comments": 2,
        "comments": [
            "I use EQ8 with the triangle clicked to expand it bigger then hover the mouse over the peaks to find the frequency and adjust the pitch accordingly",
            "This is your friendly reminder to read the submission rules, they're found in the sidebar. If you find your post breaking any of the rules, you should delete your post before the mods get to it.  If you're asking a question, make sure you've checked [the Live manual](https://www.ableton.com/en/manual/welcome-to-live/), [Ableton's help and support knowledge base](https://www.ableton.com/en/help/), and have searched the subreddit for a solution.  If you don't know where to start, [the subreddit has a resource thread](https://redd.it/zkhqhe). Ask [smart questions](http://www.catb.org/esr/faqs/smart-questions.html#before).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ableton) if you have any questions or concerns.*"
        ]
    },
    "Lock parameters while switching presets? (Dry/Wet)": {
        "title": "Lock parameters while switching presets? (Dry/Wet)",
        "score": 3,
        "url": "https://www.reddit.com/r/ableton/comments/1dr7vgf/lock_parameters_while_switching_presets_drywet/",
        "content": "I vaguely remember learning a keyboard shortcut which locked the dry wet knob while you were switching presets in ableton devices.\nFor example while changing reverb presets on a return track, keeping the dry wet at 100%. \nI now cannot find reference to this anywhere while searching the manual. Anyone know if this exists? :)",
        "num_comments": 1,
        "comments": [
            "This is your friendly reminder to read the submission rules, they're found in the sidebar. If you find your post breaking any of the rules, you should delete your post before the mods get to it.  If you're asking a question, make sure you've checked [the Live manual](https://www.ableton.com/en/manual/welcome-to-live/), [Ableton's help and support knowledge base](https://www.ableton.com/en/help/), and have searched the subreddit for a solution.  If you don't know where to start, [the subreddit has a resource thread](https://redd.it/zkhqhe). Ask [smart questions](http://www.catb.org/esr/faqs/smart-questions.html#before).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ableton) if you have any questions or concerns.*"
        ]
    },
    "Unipolar LFO?": {
        "title": "Unipolar LFO?",
        "score": 2,
        "url": "https://www.reddit.com/r/ableton/comments/1dr7ijm/unipolar_lfo/",
        "content": "I‘m looking for a unipolar LFO (M4L), stepped random option would be great. Any tips? \n\nBackground: I have a percussion loop and want to modulate the auto filter from 600Hz to 20kHz and the resonance from 18% to 86% (right before self oscillation). \nI want to to use these exact values because of mixing reasons.\nWith Ableton 11 Suite‘s LFO it‘s very time unefficient to dial in the exact Depth and Offset Amount and drawing a stepped random automation is horrible as well. ",
        "num_comments": 2,
        "comments": [
            "Expression control has a stepped random parameter, simple to map and scale.",
            "This is your friendly reminder to read the submission rules, they're found in the sidebar. If you find your post breaking any of the rules, you should delete your post before the mods get to it.  If you're asking a question, make sure you've checked [the Live manual](https://www.ableton.com/en/manual/welcome-to-live/), [Ableton's help and support knowledge base](https://www.ableton.com/en/help/), and have searched the subreddit for a solution.  If you don't know where to start, [the subreddit has a resource thread](https://redd.it/zkhqhe). Ask [smart questions](http://www.catb.org/esr/faqs/smart-questions.html#before).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ableton) if you have any questions or concerns.*"
        ]
    }
}