{
    "Does my submission fit r/AbruptChaos? – Please read before submitting": {
        "title": "Does my submission fit r/AbruptChaos? – Please read before submitting",
        "score": 22409,
        "url": "https://i.imgur.com/QliTjce.png",
        "content": "",
        "num_comments": 213,
        "comments": [
            "You forgot one \"if you announce the chaos in the title, it is no longer abrupt\"\n\n***Please make that a rule***\n\nWe need the rule /r/unexpected has about *don't spoil it in the title*",
            "[removed]",
            "This would be better as a gif that had a dude crashing through it on a flaming skidoo.",
            "Can't wait for everyone to ignore this.",
            "We've also added the AbruptChaosBot that helps us remove reposts more quickly and determine if posts fit the sub faster.\n\nIf there's a submission that doesn't fit, just downvote the stickied comment by the bot!",
            "I don't think that \"visible for long enough\" is a good rule. Some of the best posts in this sub only have chaos at the very end.",
            "Wow what a horrible flowchart",
            "Thank you for this!!!  I hate so much when there’s just one thing that happens in the last second. That’s not what this sub should be for. I think these clarifications help people see what might not be worth posting",
            "This is a confusing ass flowchart",
            "Si many Forget about the chaotic part, now there are many posts that can just fit in r/unexpected"
        ]
    },
    "Fight videos are no longer allowed": {
        "title": "Fight videos are no longer allowed",
        "score": 1678,
        "url": "https://www.reddit.com/r/AbruptChaos/comments/180omt1/fight_videos_are_no_longer_allowed/",
        "content": "We are bringing back our old request, this time in a form of an actual rule.\n\nFrom this moment forward, fight and violence videos are no longer allowed. The vast majority of them are not abruptly chaotic and therefore do \n\nLike the title says, the vast majority of fight videos are NOT AbruptChaos. We are not [r/FightPorn](https://www.reddit.com/r/FightPorn/) or [r/PublicFreakouts](https://www.reddit.com/r/PublicFreakouts/) / [r/ActualPublicFreakouts](https://www.reddit.com/r/ActualPublicFreakouts/) which is where those type of videos belong. Those posts dilute the quality of the sub and we inevitably remove them when they are reported.\n\nOn that topic, if you see a post that does NOT fit the sub, the best immediate action you can take is to downvote the sticky. It only takes a few of you and it will set off the alarm bells and we will come running.\n\nWe are taking active measures to improve the quality of the sub and we hope you can help us achieve our goal.",
        "num_comments": 193,
        "comments": [
            "well this post was truly abrupt",
            "Good. More time for kitchen disasters\n\nTis the season to deep fry a turkey",
            "Fucking thank you. I hate videos of teenagers beating the shit out of each other. Never fit the sub.",
            "More 👏🏻 animals 👏🏻 breaking 👏🏻 free 👏🏻 of 👏🏻 their 👏🏻 enclosures!",
            "The video of that guy beating the girl was a little much for sure. It's the 12 yr old edgelord who posts these things and have caused a few subs to get banned",
            "Good. I hate seeing that side of humanity.",
            "What do you mean by downvote “the sticky?”\n\nEdit lol why am I being downvoted for asking a question",
            "Finally. Literally almost unsubbed today because of those videos",
            "I'm all for that decision",
            "Awesome! Thanks for your work on this sub."
        ]
    },
    "It's not a game": {
        "title": "It's not a game",
        "score": 1839,
        "url": "https://v.redd.it/vee2p8zuh08d1",
        "content": "",
        "num_comments": 147,
        "comments": [
            "It's more of a comedy routine.",
            "Bruh pushed it to the limit",
            "If you're too dumb to check it first, you don't need to own a gun..or reproduce...",
            "Dude! He tried to disassemble the slide from the grip, saw there was a bullet in it and still pulled the trigger to release the slide. That’s a new level of dumb.",
            "It’s the song that does it for me.",
            "He was truly walking on a razor’s edge!",
            "Bro just Cheddar Bobd himself",
            "Darwinism",
            "\"Oh shit, Marvin just shot himself in the knee.\"",
            "bro gonna be out the hospital saying to the neighborhood his opps shot him and he survived"
        ]
    },
    "Here's your bear lady ": {
        "title": "Here's your bear lady ",
        "score": 1013,
        "url": "https://v.redd.it/rncmozmfs08d1",
        "content": "",
        "num_comments": 102,
        "comments": [
            "\"Hey btw there's a bear just come in, don't come round the back\" - no one ever.",
            "The door must have been propped open for her or at least they had to know she was out there. Maybe a heads up warning scream?",
            "these pranks are getting out of hand",
            "Black bears are so goofy ",
            "Gatlinburg TN",
            "He claps at her.  Lucky miss.",
            "She just *bearly* got out of that one",
            "She took that like a G",
            "I love how it got scared and was like BITCH WTF",
            "that was kinda a cute video until it wasn't!"
        ]
    },
    "Tailbone Tumble": {
        "title": "Tailbone Tumble",
        "score": 295,
        "url": "https://v.redd.it/dj011amk818d1",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Jesus I felt that",
            "Good ol tailbone bounce",
            "I broke my tail bone... it fucking sucks",
            "Butt wrack/nut wrack transfer 10/10.",
            "Bye bye tailbone !!",
            "We have just withnessed the moment he became the last generation of his family.",
            "Cool trick",
            "I love how the hype man sounds like Goofy",
            "That did not look consensual.",
            "He's gonna remember that the rest of his life"
        ]
    }
}