{
    "of a dog i met at work": {
        "title": "of a dog i met at work",
        "score": 62,
        "url": "https://i.redd.it/8arlgavuaf9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Irish wolfhounds are the best"
        ]
    },
    "of a cucumber": {
        "title": "of a cucumber",
        "score": 87,
        "url": "https://www.reddit.com/gallery/1dqz7v1",
        "content": "",
        "num_comments": 9,
        "comments": [
            "![gif](giphy|FrWjRBCFDmtu1UIOCB)",
            "Thats a squash",
            "You vs the guy she told you not to worry about",
            "![gif](giphy|YqHMVSYXIMEiA)",
            "No it's a cuc, just the polar opposite of ripe",
            "r/BananasForScale",
            "Ya she would",
            "Can be ripe cucumber. Or cucuzza.",
            "Hell yea she would, and regret it in the morning."
        ]
    },
    "of a forklift": {
        "title": "of a forklift",
        "score": 104,
        "url": "https://www.reddit.com/gallery/1dqy0j2",
        "content": "Found at a local marina. They use these to move boats around from the multi-level dry storage to the dock. ",
        "num_comments": 14,
        "comments": [
            "By this logic my pint glass is an absolute unit of a shot glass",
            "Uhh that's pretty normal",
            "Seems a normal sized forklift",
            "Thread fixed.\n\nhttps://www.reddit.com/r/MachinePorn/s/OtOGIm3RTu",
            "There is a \"marina\" in Miami that is just a parking lot with 10 long rows of 3-level shelves for boats and several slips operated by this kind of forklift. You book your time and they have your boat on a slip by the time you arrive.",
            "if its not in a warehouse or a grocery store forklifts are pretty big, i work aircraft maintenance we got bigger than that, and other industries also have big and specialized forklifts",
            "Yeah that's not big",
            "What I talk vs what I’ve got",
            "Boats are fiberglass. To equate, I'd pick-up your mother's pillow with my dick. To pick-up your mother, I'd need this lift.",
            "I misread it as wigguns as in Chief Wigguns"
        ]
    },
    "of a stick": {
        "title": "of a stick",
        "score": 706,
        "url": "https://i.redd.it/mryh15sg5b9d1.png",
        "content": "",
        "num_comments": 16,
        "comments": [
            "He's the branch manager",
            "Good boy!",
            "You said we could play fetch. I found a stick. It’s called teamwork, Todd.",
            "He can take down hordes by running full tilt with that stick.",
            "r/whatswrongwithmydog",
            "I got me one!",
            "You must take that home it's the rules",
            "A most proud doggo ☺️",
            "Confidence",
            "Awwwww! Cute dog. So proud of their stick!"
        ]
    },
    "of a tiger": {
        "title": "of a tiger",
        "score": 1182,
        "url": "https://v.redd.it/kebr03cos39d1",
        "content": "",
        "num_comments": 32,
        "comments": [
            "Bro was like ‘know what?  How bout if I just lay down and show you my belly, sir?  Would that prevent you from eating me?’",
            "There are four choices when dealing with an Alpha Tiger, all demonstrated here; Freeze( outer left), Run( inner left), Confront-then-backdown ( inner right) and Sniff Butt ( outer right)",
            "Last time I saw this, I thought I read this was a Siberian tiger amongst Bengals. Anyone know?",
            "Yeah! The real Boss is coming in. Move aside",
            "![gif](giphy|xTiTnw8JATDAKjNEoE)",
            "![gif](giphy|UIpzEC5QTvuOQ)",
            "Sadly this is probably a tiger farm…",
            "The real badass is the rightmost one who is unbothered by the big one.",
            "https://old.reddit.com/r/AbsoluteUnits/comments/19a19tw/of_a_tiger_just_rolled_through_and_immediately/",
            "Mofo just glides in like Steven Seagal, probs weighs about the same too!"
        ]
    }
}