{
    "Updated Accounting Recruiting Guide & /r/Accounting Posting Guidelines": {
        "title": "Updated Accounting Recruiting Guide & /r/Accounting Posting Guidelines",
        "score": 716,
        "url": "https://www.reddit.com/r/Accounting/comments/37g618/updated_accounting_recruiting_guide_raccounting/",
        "content": "Hey All, as the subreddit has nearly tripled its userbase and viewing activity since I first submitted the recruiting guide nearly two years ago, I felt it was time to expand on the guide as well as state some posting guidelines for our community as it continues to grow, currently averaging [over 100k unique users and nearly 800k page views per month.](http://i.imgur.com/cBERlc3.png)\n\nThis accounting recruiting guide has more than double the previous content provided which includes additional tips and a more in-depth analysis on how to prepare for interviews and the overall recruiting process.\n\n**[The New and Improved Public Accounting Recruiting Guide](https://docs.google.com/document/d/1IRh3QWcObQc_ddflJdngeI4GBlunSuePLnSPizfbKb4/edit?usp=sharing)**\n\n*Also, please take the time to read over the following guidelines which will help improve the quality of posts on the subreddit as well as increase the quality of responses received when asking for advice or help:*\n\n**/r/Accounting Posting Guidelines:**\n\n1. **Use the search function and look at the resources in the sidebar prior to submitting a question.** Chances are your question or a similar question has been asked before which can help you ask a more detailed question if you did not find what you're looking for through a search.\n2. **Read the [/r/accounting Wiki/FAQ](http://www.reddit.com/r/Accounting/wiki/index)** and please [message the Mods](http://www.reddit.com/message/compose?to=%2Fr%2FAccounting) if you're interested in contributing more content to expand its use as a resource for the subreddit.\n3. **Remember to add \"flair\" after submitting a post** to help the community easily identify the type of post submitted.\n4. **When requesting career advice, provide enough information for your background and situation** including but not limited to: your region, year in school, graduation date, plans to reach 150 hours, and what you're looking to achieve.\n5. **When asking for homework help, provide all your attempted work first and specifically ask what you're having trouble with.** We are not a sweatshop to give out free answers, but we will help you figure it out.\n6. **You are all encouraged to submit current event articles** in order to spark healthy discussion and debate among the community.\n7. **If providing advice from personal experience on the subreddit**, please remember to keep in mind and take into account that experiences can vary based on region, school, and firm and not all experiences are equal. With that in mind, for those receiving advice, remember to take recommendations here with a grain of salt as well.\n8. **Do not delete posts, especially submissions under a throwaway**. Once a post is deleted, it can no longer be used as a reference tool for the rest of the community. Part of the benefit of asking questions here is to share the knowledge of others. By deleting posts, you're preventing future subscribers from learning from your thread.\n\nIf you have any questions about the recruiting guide or posting guidelines, please feel free to comment below.",
        "num_comments": 159,
        "comments": [
            "Mods can you add a \"CPA exam\" flair? I think it would be really helpful and doesnt quite fall into the category of \"Homework\" or \"Advice.\" It would be nice for those preparing for the exam to filter by that too.",
            "And watch out for the robot auditors! I hear they will be our overlords soon.",
            "Thanks so much. Your recruiting guide was one of the first things I read when I got here. Really helped open my eyes to what an involved and helpful community this place can be. Appreciate all the work you've put into this update.",
            "id be interested to see where that \"75% of candidates invited to office interviews receive a job offer\" came from",
            "Are we allowed to swear? I fucking hate hedge accounting.",
            "Just want to thank everyone who contributed on these, they are a great read, and I love this sub.",
            "If I have an industry job opening and am not a recruiter, can I post about the job to see if anyone is interested?",
            "Should probably sticky this ",
            "Seriously though - when will accounting be 100% automated?",
            "That recruiting guide is awesome, thx"
        ]
    },
    "Guideline Reminder - Duplicate posting of same or similar content.": {
        "title": "Guideline Reminder - Duplicate posting of same or similar content.",
        "score": 248,
        "url": "https://www.reddit.com/r/Accounting/comments/9sus17/guideline_reminder_duplicate_posting_of_same_or/",
        "content": "Hi everyone, this reminder is in light of the excessive amount of separate **Edit: Update \"08/10/22\" \"Got fired -varying perspectives\" ~~\"02/27/22\" \"is this good for an accountant\" \"04/16/20\" \"waffle/pancake\" \"10/26/19\" \"kool aid swag\"  \"when the auditor\"~~** threads that have been submitted in the last 24 hours. I had to remove dozens of them today as they began taking over the front page of /r/accounting.\n\nLast year the mod team added the following posting guideline based on feedback we received from the community. We believe this guideline has been successful in maintaining a front page that has a variety of content, while still allowing the community to retain the authority to vote on what kind of content can be found on the front page (and where it is ranked).\n\n__\n\nWe recommend posting follow-up messages/jokes/derivatives in the comment section of the first thread posted. For example - a person posts an image, and you create a similar image with the same template or idea - you should post your derivative of that post in the comment section. If your version requires significantly more effort to create, is very different, or there is a long period of time between the two posts, then it might be reasonable to post it on its own, but as a general guideline please use the comments of the initial thread.\n\n__\n\nThe community coming together over a joke that hits home, or making our own inside jokes, is something that makes this place great. However, it can be frustrating when the variety of content found here disappears temporarily due to something that is easy to duplicate turning into rehashing the same joke on the entire front page of this subreddit.\n\nThe mods have added this guideline as we believe any type of content should be visible on the front page - low effort goofy jokes, or serious detailed discussion, but no type of content should dominate the front page just because it is easy to replicate.",
        "num_comments": 6,
        "comments": [
            "Hey off topic can I ask about section 179? Does anyone know it well enough to be able to talk about it ?",
            "THIS IS SO TRUE.",
            "If I ran a company I’d call it “section 179” it sounds like a CIA Division.\n\nSection 179 in a nutshell is accelerated depreciation where you can depreciate machinery/equipment all at once rather than using a standard MACRS or SL depreciation schedule. Typically used for large cost Items (cost$) as you can only use it once per year at a limit of $1,020,000 (might have an old number there). \n\nSay I buy a piece of equipment to bulldoze for my construction company. It costs $700,000. Typically you’d need to use a MACRS or estimated useful life depreciation etc. and take a tax deduction or say $35,000 per year for a 20 year useful life etc. instead I can elect Section 179 if it’s within the guidelines and take a deduction for the full amount, $700,000. This reduces my tax bill by say $210,000, or whatever my bracket ends up being, and you get access to this capital now to use towards your business/earn a return on capital on versus getting it slowly out of the hands of the government via a slow drip annual depreciation deduction.\n\nThis is in comparison to the “De Minimus Safe Harbor Rule” which has a similar idea but works for lower cost items at higher volume. You would use this rule for Accelerating Depreciation on say an Apartment Complex that you own with 250 units and each one needs a new oven because of a product defect. If each oven is within the $2500 threshold I believe it is, de minimus safe harbor is your best friend here.\n\nFeel free to add any new info but I think I hit the nail on the head here.",
            "I thought about calling my smsf Non Compliant SMSF but section 179 does sound cool"
        ]
    },
    "\"Here's what I learned about sales from Adolf Hitler...\"": {
        "title": "\"Here's what I learned about sales from Adolf Hitler...\"",
        "score": 38,
        "url": "https://i.redd.it/nhpbins6q38d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "I don’t see Joe Biden. ",
            "You gotta be more subtle, my dude.",
            "Joe Biden sees you.",
            "All I see is his how he failed his son and even his dog. Makes sense with the state of the U.S. and that people only want him to oust someone else.",
            "Truth needs no sublety., especially to those who need it.",
            "In Soviet Russia, Physics break you."
        ]
    },
    "\"I'm tired of this firm, these people. I'm tired of being caught in the tangle of their lives.\"": {
        "title": "\"I'm tired of this firm, these people. I'm tired of being caught in the tangle of their lives.\"",
        "score": 511,
        "url": "https://i.redd.it/dk0clmbzbz7d1.png",
        "content": "",
        "num_comments": 26,
        "comments": [
            "Oh boy. Here's a little trick for work papers. \n\nJust add, \"see prior year work papers\" as justification and let your senior defend their work papers.",
            "An unqualified opinion and an adverse opinion contain the same number of particles. Structurally, there's no discernible difference. Materiality is an unquantifiable abstract. Why should I be concerned?",
            "I'll never understand managers who leave more than like five comments, maybe ten absolute tops. If there's that many mistakes then something else is wrong and someone needs to spend more time with the staff.",
            "This almost made me throw my phone across the room.",
            "Ha thems rookie numbers.",
            "nothing like a “good” manager coming in carpet bombing the entire gd file that he signed off on last year, two days before issuance btw",
            "PCR-420",
            "How bad are you at your job lol",
            "I would have no problem admitting that the PY workpapers were shit and will have to be improved in CY",
            "Our controller gave me shit for doing that despite them doing it themselves. Left after 8 months of that"
        ]
    },
    "If you struggle with JE’s, all you need to remember is DEALOR": {
        "title": "If you struggle with JE’s, all you need to remember is DEALOR",
        "score": 298,
        "url": "https://www.reddit.com/r/Accounting/comments/1dldz55/if_you_struggle_with_jes_all_you_need_to_remember/",
        "content": "I have seen way too many posts about struggling with JE’s lately I had to do this. It amazes me this isn’t the first thing taught in every accounting 101 class. Absolute life saver and is the foundation of my JE knowledge. \n\nDEALOR:\n\nIncreases with Debit:  Dividends, Expenses, Assets\n\nIncreases with Credit:  Liabilities, Owner’s equity, Revenue\n\nBing bong shabow, you’re welcome.",
        "num_comments": 90,
        "comments": [
            "Contra accounts have entered the chat",
            "OP you need to remember:\n\nDividends, Equity, Expenses, Zero-coupon bonds, Net income,  Unrealized gains/losses, Transaction related costs, Sales",
            "I haven’t needed a dealer since they legalized.",
            "That’s too much work.  I already have a 50% chance at getting it right regardless, if it’s wrong oh well, make the reverse 2x amount entry. EZPZ.",
            "Okay, now bonds",
            "Or you can just remember A = L + E and net income goes into equity.",
            "I just flip a coin. If it's heads, debit, if it's tails, credit.",
            "I’m an accounting professor. This is overly complicated. \n\nDEAD. Debit expenses, assets, and dividends. DEAD is how most people feel when they study accounting. \n\nThe rest are credits. Contra accounts are the same logic, just flipped.\n\nThis is one way to do it, the other way is to just use your brain and understand the below:\n\nA=L+E\n\nWhat you have = the sum of your sources of financing.\n\nThe biggest issue I see is people trying to “understand” debits and credits. There is no universal explanation to debits and credits - it’s all account-type specific. They just mean positive and negative, but the +/- depends on the account type.\n\nEdit: that’s not even how you spell dealer.",
            "You would be better off understanding normal balances on a conceptual level. ",
            "[deleted]"
        ]
    }
}