{
    "Rule Update & Misc.": {
        "title": "Rule Update & Misc.",
        "score": 383,
        "url": "https://www.reddit.com/r/ActualPublicFreakouts/comments/v24zfk/rule_update_misc/",
        "content": "&#x200B;\n\n&#x200B;\n\nHello all, I'll get straight to the points:\n\n&#x200B;\n\n1 - We've updated our rules regarding videos posted. If it is just an extremely violent video for the sake of violence it will be removed. There will be no videos with footage of someone dying in it from here on out as well. Violators will be banned.\n\n2 - Locked & removed posts. We do get questions about why we lock or remove posts and the answer is pretty simple, if the comments are a shit show where people are being racist, homophobic, transphobic, misogynistic and overall toxic it will get shut down. We don't have time to babysit childish/ignorant people. The mods and automod remove a lot of comments so you may not always see what occurred.\n\n3 - You cannot threaten violence at anyone, you will be banned and it happens a lot. Holy shit how do people not know that?\n\n4 - Racist comments, we can see the gist of what your comment implies so just keep it to yourself or expect a ban when you post it. You are not as clever as you think you are & playing dumb/lying about it in your appeal will get you nowhere.\n\n5 - Please use the report button to aid us in removing rule violations, it helps us tremendously.\n\n&#x200B;\n\nThank you to all that enjoy freakouts and woohoo on hitting 600k members!",
        "num_comments": 71,
        "comments": [
            "Reddit policy:  \n\n“In terms of content, here’s a list of what is prohibited:  \n\n •     Involuntary pornography \n\n •     Threats, bullying, harassment  \n\n •     Encouraging others to bully and harass people  \n\n •     Suggestive and explicit content involving persons under the age of 18  \n\n •     Inciting and encouraging violence  \n\n •     Revealing someone’s confidential and personal information  \n\n •     Impersonating others in a deceptive or misleading manner  \n\n •     Using Reddit for monetary transactions and obtaining gifts and services  \n\n •     Spamming  \n\nPornography, nudity, and profanity are allowed on Reddit. However, they need to be marked as NSFW. If they’re not properly tagged, the user who posted such content might get punished.”",
            "So will there be an actualACTUALpublicfreakouts? I liked the fact that I came here for more shocking videos than I would see on publicfreakouts. What will be the point of this sub if it only allows the same things as that other much more popular version?",
            "2-5 fine.\n\n\\#1?\n\nboooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooboo",
            "This sub has been cucked. Sad. It was a cool place while it lasted.",
            "RIP r/ActualPublicFreakouts\n\nWas fun while it lasted. But soy reddit communists had to come and ruin it. Might as well just ban the subreddit.",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]"
        ]
    },
    "No Israel/Palestine Videos": {
        "title": "No Israel/Palestine Videos",
        "score": 402,
        "url": "https://www.reddit.com/r/ActualPublicFreakouts/comments/1cg9nuk/no_israelpalestine_videos/",
        "content": "As you may have noticed we keep removing posts that have anything to do with the Israel/Palestine conflict. There is propaganda coming from both sides and there is no need for it here.\n\nThis is not a sub about politics even though people try to make it that on almost every post. \n\nFeel free to go to the other subs allowing all the bullshit.",
        "num_comments": 1,
        "comments": []
    },
    "Gay couple harassed in Amsterdam, Holland": {
        "title": "Gay couple harassed in Amsterdam, Holland",
        "score": 805,
        "url": "https://v.redd.it/7sk82r88338d1",
        "content": "",
        "num_comments": 253,
        "comments": [
            "\nHello users, welcome to a sub dedicated to freakouts without the bullshit of happy or feel-good videos.\n\nThis subreddit is for enjoying freakouts and discussing them; that's it. You can take discussions of immigration policy and other topics elsewhere. If you don't believe in treating people as individuals you can go express that somewhere else. \n\n Our rules are very clear and you will be banned if you break them.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ActualPublicFreakouts) if you have any questions or concerns.*",
            "Habibi's not European\n\n![gif](giphy|UTMtrBx4972MQszaOd)",
            "When will Europe learn, Islam and lgbt do not go together… 🤦‍♂️",
            "Ironically The Netherlands and Amsterdam in particular has historically been one of the most accepting places in Europe towards homosexuality and has been at the forefront of civil rights specifically for gay and trans people since the late 60’s.",
            "The disease is spreading.",
            "Who does that lanky streak of piss think he’s intimidating?",
            "That’s immigration y’all. Such an amazing concept we have here in the Netherlands.\nFrom experience I’ll tell you, these guys don’t work. They contribute nothing. \nThey buy an expensive Mercedes or Audi when they’re older together with their brothers and cousin’s. They will sit in it with four of five of them. Deliver “packages” (if you know what I mean) and deal drugs. And still the government will support them financially because they can’t get a job anywhere.",
            "https://nltimes.nl/2020/05/20/third-suspect-arrested-harassing-gay-couple-amsterdam\n\nThe police caught the trash.",
            "Small framed dogs bark the loudest, also he looks non European, my wild guess would be NA",
            "Alcohol fetal syndrome is strong on him..."
        ]
    },
    "Man in a classic Shelby gets robbed in Los Angeles ": {
        "title": "Man in a classic Shelby gets robbed in Los Angeles ",
        "score": 453,
        "url": "https://v.redd.it/5nf43nffs18d1",
        "content": "",
        "num_comments": 79,
        "comments": [
            "\nHello users, welcome to a sub dedicated to freakouts without the bullshit of happy or feel-good videos.\n\nThis subreddit is for enjoying freakouts and discussing them; that's it. You can take discussions of immigration policy and other topics elsewhere. If you don't believe in treating people as individuals you can go express that somewhere else. \n\n Our rules are very clear and you will be banned if you break them.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ActualPublicFreakouts) if you have any questions or concerns.*",
            "Beautiful car. Do police exist in California or are they just optional?",
            "Trash.  All of them.",
            "looks like he was broken down and they stole his watch",
            "What's with the tow truck though?  These guys are robbing people and towing their cars at gunpoint now?",
            "Is this some fast and furious shit or why is there a tow truck in this scene?",
            "It’s nice living in a state where you can actually stop these thugs permanently without fear of prosecution.",
            "Cray Cray",
            "Turning into South America over there",
            "Gross"
        ]
    },
    "Alleged predator gets caught": {
        "title": "Alleged predator gets caught",
        "score": 610,
        "url": "https://v.redd.it/r8yyue71018d1",
        "content": "",
        "num_comments": 188,
        "comments": [
            "\nHello users, welcome to a sub dedicated to freakouts without the bullshit of happy or feel-good videos.\n\nThis subreddit is for enjoying freakouts and discussing them; that's it. You can take discussions of immigration policy and other topics elsewhere. If you don't believe in treating people as individuals you can go express that somewhere else. \n\n Our rules are very clear and you will be banned if you break them.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ActualPublicFreakouts) if you have any questions or concerns.*",
            "Why would you record evidence of you assaulting someone? Even though the store also already has plenty of evidence with their security cameras.\n\nIt is funny, this dude runs exactly how I would expect a child predator to run tho.\n\nEdit: The way he keeps saying “help…help….” As he runs too.😂 this may be the funniest assault.",
            "Why do these child predator catchers never go to the police first?",
            "He was chillin at the end. Lying there posing.",
            "\"Oh I missed\" LMAO",
            "That dude slid like he was on an invisible slip and slide. The arms and legs straight out stiff while sliding on his side.",
            "I was raped as a kid and I hate these videos. Couple it with the fact they do more harm than good and it always feel like they’re playing at the heartstrings of other ‘touched’ individuals for views and clicks, fame.\n\nIt’s like they’re virtue signaling and know they’ll get away with it bc people hate predators more than bullies\n\nPersonally I think both people in this instance are full blown idiots. And it’s certainly a higher chance to prove the filmer assaulted the predator more so than it is to prove the predator is a predator- unironically. \n\nSo this is all a horse and pony show for the filmer to feel good about himself, and almost like job security bc he made it about rapists. This guy likely doesn’t even care he just sees the opportunity to make money on the backs of sexually traumatized individuals. This shit SHOULD NOT be on YouTube.",
            "🤣 “CHILD PREDATOR GOING DOWNNN”",
            "Source?",
            "Why don't they upload the evidence THEN \"the beatdown\"?"
        ]
    }
}