{
    "r/ADCMains Discord Server": {
        "title": "r/ADCMains Discord Server",
        "score": 58,
        "url": "https://www.reddit.com/r/ADCMains/comments/x6jbus/radcmains_discord_server/",
        "content": "[Click this Link](https://discord.gg/nEj8Nf8gNF) to join and enjoy your stay!",
        "num_comments": 20,
        "comments": [
            "Is that still working? I can't join via this link",
            "Can i have link?",
            "me, a support main joining as a meme to find adc's to play with:",
            "Hello guys does someone have \"every champion botlane guide\" doc/ pdf link. I would be glad to study something new",
            "[deleted]",
            "The links in this pinned message are not functioning properly. An update is required.",
            "Can you send me the invite? The one in pinned isn't working",
            "it should work but heres another link for you https://discord.gg/sh3XQn5D",
            "[https://discord.gg/CJHYA26k](https://discord.gg/CJHYA26k) yup i'm not the owner but here u go",
            "Says this is invalid for me to. Could be time based? Can you send a new one?"
        ]
    },
    "I thought this was pretty cool. (Don't mind the music. Random YT playlist)": {
        "title": "I thought this was pretty cool. (Don't mind the music. Random YT playlist)",
        "score": 30,
        "url": "https://v.redd.it/a03izj0ubd9d1",
        "content": "",
        "num_comments": 4,
        "comments": [
            "I too enjoy when my enemies kill themselves.",
            "Sharp as a cue ball these guys",
            "this is the funniest shiv kill I've seen props man",
            "plastic 4"
        ]
    },
    "You may be on your horse with your micro and you may not like it but this is what peak mechanics is on aphelios.": {
        "title": "You may be on your horse with your micro and you may not like it but this is what peak mechanics is on aphelios.",
        "score": 44,
        "url": "https://v.redd.it/35m1fuhnsb9d1",
        "content": "",
        "num_comments": 9,
        "comments": [
            "Who needs severum q(shit was on cd) to stack cresendum any way, cresendumb point blank autos go brrr 😂",
            "Idk why but this made me laugh so hard 😂",
            "Jokes aside, check on Daynean Youtube channel, absolutely any video at all. That's what peak aphelios mechanics looks like",
            "Gumayusi?",
            "If she kited would she have won? Lol",
            "Aphelios looks like fun, but god fuck do I hate that UI.",
            "200 years",
            "If only he streamed more",
            "Depends on the cd on her spells I guess 😂"
        ]
    },
    "how to play hyper carries with no peal": {
        "title": "how to play hyper carries with no peal",
        "score": 4,
        "url": "https://www.reddit.com/r/ADCMains/comments/1dr13ft/how_to_play_hyper_carries_with_no_peal/",
        "content": "as the title says. how do I play like a jinx or a kogmaw when my support picks stuff like xerath,ashe,missfortune, ziggs etc etc and the enemy has divers? seems very hard to play the game and be skill expressive. thanks so much for any feedback",
        "num_comments": 11,
        "comments": [
            "you follow your tank like a bitch and youre always the last player to enter a fight",
            "You don't. Just pick hypercarries with a peel sup, it's better for your sanity.",
            "Tried to play more jinx this season and quit for this exact reason. She’s so hard to play without peel/into dive comps. A lot of hyper carries just can’t handle being dove/jumped on by champions with insane target access. Playing Jinx into Camille-Zac-Zed-ADC-Pyke is a nightmare",
            "Kog mas cant be played without peal support. Jinx can but its hard. Twitch is easiest to play hyper carry without peal support",
            "I'm not an ADC main but I do play alot of support, I started off as karma but I started playing supp during a season when literally everyone would pick lee sin and there would be alot of assassin mid laners, ended up maining poppy support with exhaust and the amount of peel she has is crazy.\n\nThe best way would be to ask if the person playing support has any engage or tank supports because alot of times I'll play an enchanter because there's only so much brand/zyra/duo mage bots I can take before I get tired of being a damage sponge for ADCs who are too timid to go in.",
            "if your support picks a mage support just pick jhin lmao you pretty much become their support during laning phase, cringe but wins games.",
            "Hypercarries like jinx straight up don‘t work then.\n\nIt‘s the main reason i‘ve stopped blind picking Jonx and when YoloQing and I want scaling I just pick zeri.\n\nShe works with kinda whatever support since I jist want to farm in lane and if my jgl comes it‘s a nice bonus. \n\nAlso with her kiting and terrain passing she can deal with little peel a bit better",
            "im 99% certain that the only way is to be an absolute crackhead",
            "With kog maw I wait for the enemies to engage and then I join the fight.\n\nI always think what can cc me and who can jump on me and once I see their ability used in the engage I feel more confident going in. Otherwise I'll dps how much I can from far away.",
            "I like to have two adc champ pool, one that is good at pushing the fight, and one that has self peel or good at counter attacking. For example jinx to start fights with w rocket, and xayah to self peel and kite with r e."
        ]
    },
    "I don't get the point of Yun tal either to weak hard to slot in or you need utility items ": {
        "title": "I don't get the point of Yun tal either to weak hard to slot in or you need utility items ",
        "score": 44,
        "url": "https://www.reddit.com/r/ADCMains/comments/1dqdi05/i_dont_get_the_point_of_yun_tal_either_to_weak/",
        "content": "often it is also outperformed by kraken  ie and even on crit champs it fells weird i seen it specifically on crit bel'veth working well and on akshan but there aren't many champs that can properly use it even double  crit champs like yone yasuo or perhapse trynda they get more value out of IE",
        "num_comments": 62,
        "comments": [
            "I like the idea of it, but it feels too weak.",
            "I can't think of a single game where i'd rather have yun tal over shieldbow for 100% crit tbh.",
            "The biggest failure of a crit item, it doesnt even work on champ that could abuse it the most a. k. a Samira R. Never seen anyone buy it above plat elo, I feel like the only purpose that it had was to make clickbait youtube videos, i’ll take 800 shield from shieldbow in 99% of games other that useless crit burn extra damage that noone needs anyway since 5 items ADC overkills anyone except tanks with randuin",
            "It can be good when you need more damage as 3rd or 4th item, but in realistic scenario you're usually buying more defensive items, like shieldbow or bt, because you need to survive. Yuntal has it's cases and it's fine in terms of power, just not a necessary item in most games.",
            "Its synergy with Runaans is pretty decent. Other than that, the item is extremely underwhelming, but i still buy it every once in a while as there are very few non attack speed crit items and there isnt really anything else to get",
            "Honestly I like its concept a lot, giving some extra DoT on autos gives Crit ADCs a slightly anti-tank skewed item that isn’t game-breaking or usable by other classes. The fact that it’s high base AD and crit just means you don’t “have” to buy it just to kill tanks—if you want crit and don’t want attack speed, it’s the perfect last crit item imo.\n\nTypically, anti-tank is on-hit/attack speed based or just your single pen item, but a lot of champions can’t build on-hit without sacrificing too much in the way of crit. To be fair, I do only think it’s a 4th/5th item at best, but if it kept its passive and was strong enough to be picked up 1st or 2nd, it’d be too strong. I think it’s good where it’s at, but would probably give it a 5 AD buff that way it isn’t 15 AD less than BT.",
            "If you didnt buy collector as first item its pointless to buy it later in the game, so you dont have much choices and you buy best item from bad item pool, what else to buy shieldbow xD>?",
            " i forgot that item existed so when i read the title i was just thinking \"who tf is yun tal\" for a minute lol",
            "It's only useful if you're up against like triple tank or something to that effect, where the bleed actually has time to work.",
            "It really is just the biggest pile of trash. IE 15 more AD for just 200 gold more. if it wants to be 'second IE' it has to actually do that job.\n\nAlso half the people in this thread are morons who don't even understand that the item is functionally just Worse IE because the DoT warps their brains into thinking it's some kind of weird on-hit item or that 'stacking' the bleed achieves some extra effect (it does not)"
        ]
    }
}