{
    "r/ADCMains Discord Server": {
        "title": "r/ADCMains Discord Server",
        "score": 53,
        "url": "https://www.reddit.com/r/ADCMains/comments/x6jbus/radcmains_discord_server/",
        "content": "[Click this Link](https://discord.gg/nEj8Nf8gNF) to join and enjoy your stay!",
        "num_comments": 20,
        "comments": [
            "Hello guys does someone have \"every champion botlane guide\" doc/ pdf link. I would be glad to study something new",
            "The links in this pinned message are not functioning properly. An update is required.",
            "Can you send me the invite? The one in pinned isn't working",
            "Says this is invalid for me to. Could be time based? Can you send a new one?",
            "For me the link is invalid",
            "Your link is still invalid you know",
            "hey, can i get a link please?",
            "Can i have link?",
            "[deleted]",
            "New link pls"
        ]
    },
    "Good support diff / Terminus Diff ( Qiyana cleans the last 2 after this )": {
        "title": "Good support diff / Terminus Diff ( Qiyana cleans the last 2 after this )",
        "score": 3,
        "url": "https://v.redd.it/3he38wbjqi9d1",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "I thought this was pretty cool. (Don't mind the music. Random YT playlist)": {
        "title": "I thought this was pretty cool. (Don't mind the music. Random YT playlist)",
        "score": 36,
        "url": "https://v.redd.it/a03izj0ubd9d1",
        "content": "",
        "num_comments": 4,
        "comments": [
            "I too enjoy when my enemies kill themselves.",
            "Sharp as a cue ball these guys",
            "this is the funniest shiv kill I've seen props man",
            "plastic 4"
        ]
    },
    "ADC Tierlist for Patch 14.13": {
        "title": "ADC Tierlist for Patch 14.13",
        "score": 0,
        "url": "https://youtu.be/DQOVXyQh3Ls",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "how to play hyper carries with no peal": {
        "title": "how to play hyper carries with no peal",
        "score": 10,
        "url": "https://www.reddit.com/r/ADCMains/comments/1dr13ft/how_to_play_hyper_carries_with_no_peal/",
        "content": "as the title says. how do I play like a jinx or a kogmaw when my support picks stuff like xerath,ashe,missfortune, ziggs etc etc and the enemy has divers? seems very hard to play the game and be skill expressive. thanks so much for any feedback",
        "num_comments": 27,
        "comments": [
            "you follow your tank like a bitch and youre always the last player to enter a fight",
            "Tried to play more jinx this season and quit for this exact reason. She’s so hard to play without peel/into dive comps. A lot of hyper carries just can’t handle being dove/jumped on by champions with insane target access. Playing Jinx into Camille-Zac-Zed-ADC-Pyke is a nightmare",
            "You don't. Just pick hypercarries with a peel sup, it's better for your sanity.",
            "High elo jinx otp here. When you have 0 peel in teamfights, flash is your most valuable tool. You have to use it for something important everytime (j4 ult for example)and not waste it for a kill(unless you get a reset). Also, after lvl 9 you almost always use rockets, unless someone is directly into your face. Positioning is everything, and use ue E between you and enemies for zoning(like a wall). Also at high lvls your W slows alot(more like a stun almost) and is on low cd, so spam it as much as you can.",
            "Play like a complete bitch, and only go in once every ability that can be used to catch you out of position of one shot you has been used. You have a lot of range as Jinx or Kogmaw so you should be behind absolutely everything just shooting rockets or purple spit.",
            "hide in the brush, enter the fight late, get flamed by your team. /muteall before or after whichever you prefer.",
            "im 99% certain that the only way is to be an absolute crackhead",
            "You dont. Or you hope to get 1 or 2 kills before the enemy team dives you. And hope youe team can clean up",
            "You could honestly space like a god and be the best in the world, but with zero peel nothing can stop a Vi flash R-Q stun locking you (there’s various ways out of this combo after it has ended with stuff like Lulu R, assuming you somehow haven’t been killed during it.) Some comps are easier to 1v9 against with pure spacing but the game has so much burst engage that it feels near impossible to do this consistently. Now factor in that we’re *not* the best players in the world and it becomes even harder lol.",
            "You arent really able to. I played as Jinx vs Alistar, J4, Panth and Syndra yesterday. Was a nightmare without peel. I had 20 kills because we hardstomped the lane but even as a hardcore fed Jinx, I had a hard time in teamfights because I either needed to flash or wait till they used absolutey everything"
        ]
    }
}