{
    "They arent a fun duo": {
        "title": "They arent a fun duo",
        "score": 2202,
        "url": "https://i.redd.it/g1enyml4ah9d1.jpeg",
        "content": "",
        "num_comments": 19,
        "comments": [
            "I think to myself that im gonna do something later knowing damn well i wont",
            "Third panel: ADHD: ok maybe I'm underthinking it... but it's not like I'm gonna do something about it anyway.",
            "I'm in this picture and I don't like it.😬",
            "Nothing like waking up with the chorus to 'Say My Name' looping aggressively in your head and when you try to ignore it, your anxiety says, \"No, wait...*there's something deeper here.\"*\n\nNo brain, I'm not going to solve my emotional problems by getting to the bottom of this.",
            "Why are we like this?",
            "Ahh my own personal hell... welcome to the circus lol",
            "Also my autism watching both",
            "Ah yes, this back and forth, back and forth.",
            "How do prescribed stimulants work for you guys? They mostly just trigger my anxiety.",
            "And in reality, you aren't even thinking about it at all."
        ]
    },
    "Wish it was a joke": {
        "title": "Wish it was a joke",
        "score": 952,
        "url": "https://i.redd.it/w9x3geps0i9d1.jpeg",
        "content": "Ever since my diagnose I learned I do this. So I’m working on it. Yesterday I was with my mom and realised how much of it I got from her…..",
        "num_comments": 22,
        "comments": [
            "Anecdote? Is this another British English vs American English conflict?",
            "“I swear the joke is funny but I’m bad at explaining things”",
            "Holy fuck… accurate as hell",
            "Lucky me, I spent so much time with friend sharing anecdotes and other sources of humour, that now we can use punchline instead telling whole joke.",
            "I love the way you spell anekdote :)",
            "Nah. Probably just my dyslexic-ass and a second language thing. Although I might just start blaming autocorrect switching between the two dialects.",
            "anekdote is a little bag that hangs off your anorak",
            "But than she starts to explain and now we all missed lunch, dinner and are back at breakfast.",
            "Interesting, when I looked up Anekdote, it looks like it's actually the German word for anecdote. Instead of asking you if you were German, I looked at your profile, but then got distracted with something else. When I went back to my browser I saw Fujifilm stuff and thought I was on the home page till I realized they were comments. So now I think we are probably on the same hyperfixation with Fuji cameras",
            "I am aware of what an anecdote is. That’s why the spelling confused me. I assumed it was just a linguistics problem, not a spelling error. Though in this sub both are entirely possible"
        ]
    },
    "This is too real": {
        "title": "This is too real",
        "score": 1542,
        "url": "https://i.redd.it/x7ryru2b4f9d1.jpeg",
        "content": "",
        "num_comments": 22,
        "comments": [
            "The “retracing steps to remind myself what the heck i just thought of” procedure.",
            "Go to Wikipedia to look up something. Find an interesting link on the page. Cannot continue to read the rest of the page with probably the info I was looking for immediately after seeing the link. Click it, repeat earlier step. End up at Byzantine Empire Page.",
            "Hahah, fuck you ADHD I have my search history to remind me.... Shit what's the one secret to cooking salmon perfectly? I gotta know. I got some frozen salmon in the fridge, I should defrost that. Oh damn I got left overs from the food I shouldn't have ordered....\n\nEventually you find your way back to start.",
            "I'm in this photo and I don't like it.",
            "So many times a day I lose count.",
            "I have gotten very frustrated and mad when this happens. I am a stubborn person, and resorted to trying to force myself to remember. I refuse to go back I to the apps to jog my memory. I just end up being frustrated and still don't recall what it was.\n\nThe thing I found that worked was giving up on it, and doing something else. It will either randomly pop back into my brain later, or it didn't matter that much.",
            "This is why I don't delete my search history, without it I straight up show dementia symptoms.",
            "I do the old school version of this by walking in and out of rooms in my house trying to figure out where the heck I was going and what I wanted to do there.",
            "And then 12 hours have passed and you look outside and it’s dark.",
            "I usually just drop it and move on because fuck I'm not gonna dwell on that"
        ]
    },
    "This happened last night so I made a meme about it": {
        "title": "This happened last night so I made a meme about it",
        "score": 264,
        "url": "https://i.redd.it/sympg3syuh9d1.jpeg",
        "content": "",
        "num_comments": 4,
        "comments": [
            "It's 4:40am, I haven't slept yet despite being in bed since 9pm. So, this is me tonight. Yay.",
            "The art of not thinking so you can catch some rest is a skill that must be learned",
            "It hurts how relatable this is",
            "I guess we're all in the same boat..."
        ]
    },
    "Close your eyes and throw a dart": {
        "title": "Close your eyes and throw a dart",
        "score": 5072,
        "url": "https://i.redd.it/ob8menhgqc9d1.jpeg",
        "content": "",
        "num_comments": 187,
        "comments": [
            "Choosing? I do all of them at once except I just let the tears roll down my cheeks.",
            "Well dangit i see a lot of things I do in this image, not all of them apply to me but a lot do",
            "I binge eat too. Fun.",
            "I guess I could try binge drinking, just since it's the only one I haven't been through yet lol (edit I was definitely kidding, please don't do that)",
            "Im a manly man, I don't cry into my pillow, I just stare at the wall sobbing internally 😎",
            "Can’t avoid food (eating disorder) or binge drink (to old for that shit), but hello everything else my old friend.",
            "I feel seen and attacked and yet I don't care as I'm laughing in that actually really depressed way at seeing this...",
            "hahaha man there really are only like 12 different people in the world huh?\n\nI had to do things yesterday so today I'm trying to avoid doing 4 but I had to 5 and now I've been stuck doing 6 all day. I only ate after I felt nauseous -- twice.",
            "I am 7/8 on this one!",
            "3-4 of these at any given time"
        ]
    }
}