{
    "Master Post: So you want to be a motherfucking successful ass adult": {
        "title": "Master Post: So you want to be a motherfucking successful ass adult",
        "score": 2258,
        "url": "https://www.reddit.com/r/Adulting/comments/bl27uv/master_post_so_you_want_to_be_a_motherfucking/",
        "content": "  \n\nSo, you want to be a fucking successful adult. CONGRATS, I have written some how-to’s for you so you can start to get your fucking shit together. \n\n[Part One](https://www.reddit.com/r/Adulting/comments/bgzqbc/how_to_be_a_motherfucking_successful_ass_adult/)\n\n[Part Two](https://www.reddit.com/r/Adulting/comments/bh0m1l/being_a_motherfucking_successful_ass_adult_part/)\n\n[Part Three](https://www.reddit.com/r/Adulting/comments/bh3evn/how_to_be_a_motherfucking_successful_ass_adult/)\n\n[Adulting with Depression](https://www.reddit.com/r/Adulting/comments/bh4lzh/how_to_adult_when_you_are_too_depressed_to/)\n\nHere are some fucking FAQ’s on the parts I wrote so that you don’t have to scroll through and upvote every single nice comment in the comment section on all of the parts. \n\nQ: Are there going to be more parts?\n\nA: Yeah probably. But I have a fucking life where I do things that aren’t writing how-to’s, so they will arrive whenever I am feeling generous enough to give advice and have the energy to write about said advice. \n\nQ: You should write a book.\n\nA: Thank you, I am. The book is in the works, basically it’s a fucking 100-page rant where I talk about how to wash your balls. \n\nQ: How old are you? Are you a boy or a girl?\n\nA: I am an adult. I will not tell you my age because once I do you will suddenly have all these pre-conceived judgements about the quality of the advice I give. But here is a hint, I am older than 18 and younger than 50. I am a person. Take a guess on my gender and if you get it right Ill give you a fucking star. \n\nQ: Why can’t you write normally?\n\nA: Because there are a bajillion fucking self-help books out there written normally, and there are like 5 that are written in a way that people fucking relate to and listen to. If cursing *turns you off* then good. I only want readers who can fucking read this shit with a boner 6 miles long. \n\nQ: I have a tip that you don’t mention, can you add it to the article?\n\nA: Sure, if its actually fucking good. Send me a message with your advice that you think is good enough to make it, and I’ll add it to the end of the article and credit you. \n\nQ: I run a podcast/YouTube channel/ blog, can I interview you or have you guest speak?\n\nA: Generally, yes. My time is precious, so if you want me to write something completely new for your shit its going to take a while and will probably cost you more than exposure. \n\nQ: What do you do when you aren’t cussing people out on the internet?\n\nA: I own a business and am a stay at home parent. When I am not writing, I am packing orders, creating or listing new product, taking care of my son, or playing with my two dogs. I rarely have any down time.\n\nIf you have more questions you want answered or have an idea for an article you want me to write, send me a PM. I will decide if its cool enough for me to respond to it.",
        "num_comments": 167,
        "comments": [
            "Adding \"fucking\" to every other sentence really helps with comprehension do appreciate",
            "This brings me more joy than words will describe. If you do finish your book, can 10/10 guarantee it will appeal to everyone >30 and probably most salty people <30. Can also confirm most people dont know how to do shit. I'm 21 and have a job and work my ass off but literally feel like I'm the most useless \"adult\". Power to you dude.",
            "Lotta hostility. Limited vocabulary. Extremely full of ur self. I wouldn’t trust a word you say. Just sayin. 👎🏿 put a cork in it.",
            "The amount of unnecessary swearing feels quite childish.",
            "You're not the first person to try the swearing shtick, it's super cringe",
            "The swearing every 3 words feels like I’m reading a 2012 tumblr post again, just as cringy",
            "Your posts make me feel good so far because i already do or have done most of these things!! \n\nI thought i wasn’t adulting well but clearly I’m on the right track",
            "Please let us know when the book is finished. This is motivated as hell",
            "Mark Manson, dat you?",
            "I enjoyed reading this and the last part about adulting with depression made me cry. It seems so simple yet its the truth and I wish more poeple could not as in were willing to but I mean able to accept that advice as the true path to feeling better. There it seems some people have this blockage in their train of thought that we all need to be self sufficient and so does our mental health but the sheer fact of being able to accept outside help and knowng that you need it is a big part of helping yourself too. \n\nI feel for all those who can't get past themselve and see no future and I too have been there and its deep and dark and sometimes you may think you are out of there but certain situations can trigger the same emotions to come rolling back in an instant. \n\nOf course you could be upset, buy or obtain new stuff, and feel more complete in itself. So everything ties together...Litteraly as you drive it to your place to unload or figuratively as you try to put together the pieced to make the puzzle of happiness."
        ]
    },
    "Discussion: New Rule re: Mental Health, Suicide, etc.": {
        "title": "Discussion: New Rule re: Mental Health, Suicide, etc.",
        "score": 40,
        "url": "https://www.reddit.com/r/Adulting/comments/1c0d35j/discussion_new_rule_re_mental_health_suicide_etc/",
        "content": "Hello Fellow Adults,\n\nThis subreddit serves as a gathering place for adults to share their triumphs and challenges. A number of these posts often involve topics related to suicidal ideation and self harm. There are many resources across Reddit (eg. /r/depression, /r/SuicideWatch, [wikis](https://www.reddit.com/r/SuicideWatch/wiki/hotlines), \"get them help and support\" button\") as well as off Reddit (eg. [Suicide and Crisis Lifeline](https://988lifeline.org/), [Suicide Prevention Resource Center](https://sprc.org/), [National Institute of Mental Health](https://www.nimh.nih.gov/health/topics/suicide-prevention)).\n\nUnfortunately, our community is not trained nor equipped to sufficiently support these types of posts. Because of this, the moderator team will be trialing a new rule that is listed below to encourage these users to seek support within the communities and resources best suited for them:\n> **4.** **Respect Mental Health.** - No posts or comments involving threats to oneself or others. /r/depression and /r/SuicideWatch/ have resources and trained members to provide support.\n\nWe invite you to discuss and share your opinions on this decision below. Thanks in advance for your feedback.",
        "num_comments": 10,
        "comments": [
            "I'm 100% in favor of this. It's been leaking into a lot of subreddits that I browse and it's honestly became both frustrating and exhausting. I  do get that the worlds a rough place and mental health is suffering from a lot of people, especially younger ones, but theres a time AND place for it. And it just permeates the subreddit in a nasty way if left unchecked",
            "thanks, its very stressful to see these kinds of posts, and I tend to leave if I see one.",
            "The world is dark and full of terrors, and it's so easy to go off the deep end, but agree with this policy. Everything in its place and to each according to their means and what not.",
            "I like this and as someone who is depressed, I sometimes don't want to focus on or talk about things that upset me. I'm trying to be more positive",
            "Good stuff",
            "Thank God.",
            "I can't go to monkeys paw or ouija now because half are trying to back-handedly get some kind of affirmation to hurt themselves. It's saddening, stressful and frustrating. ",
            "Expressing suicidal ideation in the wrong context is like walking in to a crowded room and farting loudly then expecting sympathy/empathy from everyone that has to smell your poo gas."
        ]
    },
    "Do you ever feel like the world is too cruel for you?": {
        "title": "Do you ever feel like the world is too cruel for you?",
        "score": 256,
        "url": "https://www.reddit.com/r/Adulting/comments/1dlmkr2/do_you_ever_feel_like_the_world_is_too_cruel_for/",
        "content": "Coming to realization about certain realities of things is overwhelming. What are your thoughts and experiences surrounding this topic? Have you ever felt this way before? ",
        "num_comments": 150,
        "comments": [
            "Yes 🥲 daily",
            "It makes me realize how good my childhood was. My parents basically managed to have me think the world was perfect until I was like 15. \n\nI personally wouldn't say the world is cruel though. I think it's just uncaring. The world isn't going to help that starving child, that's something we need to do.",
            "The world is fine the society we have cultivated as a whole seems to be a real big issue for everyone.",
            "This cruel world taught me to have a thicker skin. You either break or grow.",
            "In the late 90s, when I was 17, I joined the military hoping to get an education. When I was 19 I was actively involved in combat directing warfighters to bomb military targets. Yeah, the world is cruel and people and organizations wield and abuse power.",
            "I think thats mainly because of individualism. We dont trust anyone, we dont believe in anything, everyone is thinking just about money...\nWe need a community and strong connections with people. We need to slow down, be in nature, take care of others as well. This society is just based on selfishness...",
            "We can only make things better in our own microcosms, regardless of however evil others may choose to be.",
            "Every fkn day.. that's why I took up solo activities. I'm done with people. It seems like everyone's going crazy these days or no one has any dignity to stand by what they say. \n\nI decided to start working on myself more. \nI found a good morning workout routine, started to learn self defense, started going to the gun range weekly, I took up backpacking. It feels like I'm finally living for once compared to everyone else.",
            "Yes. \n\nI hate the concept of “toughening up” or who has “thick skin” vs who is “too weak,” etc. \n\nIt’s sad that we live in such a horrible world to the point that people *have* to numb themselves to it all. \n\nIt hurts that your fellow humans would rather be mean than empathetic to each other. It’s sad that we would rather tell people to get over themselves than just be kind. Why people give up so easily and choose to contribute to the negativity in the world is beyond me. It’s so easy to be kind. Now we’ve stooped to the level of those miserable people who make our days worse and we’ve become miserable ourselves. \n\nIt’s sad seeing once pure hearted kids turn out to be bullies. It’s sad seeing people so messed up by the world that it drives them to commit crimes or suicide or just physically and mentally abuse others.\n\nYes the world is terrible, we live in a messed up society and have barely any control over our lives, it’s all based on luck. But having a bad day doesn’t mean you should make everyone have a bad day. It just really upsets me how people can be so heartless these days and go about their day knowing that they caused someone else pain. \n\nAll of the terrible things happening in this world have to do with us. We started it all. Human beings. Because somewhere along the way we lost our humanity and our ability to have a heart for people, if we even had those things in the first place. \n\nLife is such a scary thing, but the part that makes it cruel to me is how soulless, lifeless and heartless humans have become.",
            "Sure! I find that any problem is eventually addressed, though. Sometimes just takes time… no need to truly be worried about anything specifically. If something needs taken care of immediately then you have to do what you have to do, but otherwise it’s not a huge deal and can be taken care of when convenient/it makes sense. A little preparation goes a long way. I am single, though, and often wonder how much easier/harder life would be with a significant other."
        ]
    },
    "What straightforward but heartfelt guidance would you offer to someone navigating their twenties?": {
        "title": "What straightforward but heartfelt guidance would you offer to someone navigating their twenties?",
        "score": 42,
        "url": "https://www.reddit.com/r/Adulting/comments/1dlt89m/what_straightforward_but_heartfelt_guidance_would/",
        "content": "",
        "num_comments": 38,
        "comments": [
            "\"Don't let anyone tell you twice they don't want you.\" \n\n- Mama",
            "Don’t take criticism from someone that you wouldn’t take advice from.",
            "43 here:\n\nStay off social media. As an “elder millennial” who straddled the transition between no internet/internet/social media internet, I can tell you with 100% certainty humanity will look back at this time with cringe and disgust. \n\nI’ve succumbed to the easy reward system myself and non longer have FB, Instagram, Twitter, etc. Reddit is my last account and it’s next on the chopping block. \n\nMy advice: \n\nGet outside \n\nText the people you love and meet up with them instead of just following them.\n\nMake real discoveries about yourself by getting into new situations, not just diagnosing, comparing, or turning yourself into a “brand”. \n\nLive your OWN life, make your OWN conclusions, be your OWN guide, and let the world chatter away without you. \n\nI promise you’ll be better off.",
            "Start contributing into a 401K right now if your job offers it. I cannot stress it enough to start immediately. Contribute however much you can afford but make sure to take full advantage of any company matching at the very least. Compound interest is going to set you up for life if you start now and keep at it. If your job doesn't have a retirement plan, open an IRA. You will thank yourself later.\n\nIf you are in your early 20s you might read this and think yeah yeah yeah I'll get to it eventually I've got plenty of time. I know this because that was me at the age of 22. I always remembered the advice but my dumb ass ignored it. I don't have many regrets at all, but that is one of them.\n\nAnd you do have plenty of time for sure, but if you start young and keep at it you WILL retire a millionaire. Hell you could hit a million or more before you turn 60 and retire early if you start now. You might earn 60K a year or 160K. It doesn't matter. You can retire a millionaire.\n\nEither way save what you can right now or you will regret it in the years ahead. This doesn't mean you have to live like a pauper either. Save what you can to continue living your life and you will be golden.\n\nEdit to add a very low end example. If you make 50K/yr and contribute just 10% total (including any company match) that would be $5,000 per year. With just a 5% rate of return starting at 25 years old you would retire at 67 with over 700K. It's recommended that you have 10-12x your annual salary at retirement. Even given these very low values, in this case you would likely be retiring with 14x your annual salary. You would be golden.\n\nAnd note in my example the person never receives a raise and never contributes more than 10% total per year. Also 5% returns is overall on the low end as well. All of it just goes to show it really doesn't take a lot to do this and die happy. Consistency and starting now is key.",
            "Stay away from fucking drugs.",
            "Everything will start hurting in your 30s so get in shape now while your body still works properly. Make healthy eating and exercise habits part of your lifestyle now.",
            "From a 46 year old: The ages 18-28 set the foundation for the rest of your life. What you do or don't do in this critical period will have significant effects on your lifes trajectory. This is a time for taking good risks and avoiding the bad ones.",
            "Avoid debt for material goods you don’t really need. Save and invest your money so older you can work less. You can rough it in your 20’s and it’s fine. Eventually your body will break down so get the hard times out of the way early and prevent future hard times by saving and investing.",
            "enjoy your 20’s…. it is a unique time in life to try things you won’t be able to, or have time to etc later on.\nThis is how social evolution works… your 20’s is the cauldron of change.",
            "As you grow, your circle of friends may naturally shrink, and that's alright. Stepping beyond your comfort zone to connect with new individuals can be challenging at first, but it's a rewarding endeavor."
        ]
    },
    "How is it like to have a husband who loves you?": {
        "title": "How is it like to have a husband who loves you?",
        "score": 371,
        "url": "https://www.reddit.com/r/Adulting/comments/1dlfrsx/how_is_it_like_to_have_a_husband_who_loves_you/",
        "content": "I'm pretty sure mine hates me. I'm so frustrated with myself, should never had gotten married to be treated like this",
        "num_comments": 309,
        "comments": [
            "It feels safe, comfortable, and empowering. My husband is the first man in my life who genuinely respects me as well, and values and seeks out my opinions. \n\nI’m so sorry to hear what you’re going through. You deserve and can still find a loving partner. ",
            "You've only lost two years. Please walk away! Nothing about being alone is as bad as tolerating a relationship where you feel like this. Having someone who truly loves you and puts your needs and concerns first is what you have every right to seek.",
            "He’s the first one I want to share good news with because he’ll be super stoked for me - he is my biggest cheerleader, supporting me so much with all of my goals. He is there to wipe my tears, listen and give advice (if wanted) when I’m sad or overwhelmed. We laugh together and have tons of fun and adventures together. I look at him with googly eyes because he’s so sexy and attractive in my eyes. The way he kisses and touches me makes me quiver. We are respectful of each other and are mature enough to discuss when things come up. He’s the best!",
            "If you have to ask what it’s like to have a husband who loves you, you  shouldn’t be in the marriage. I’m sorry you are going through this. I hope you find a way to end it and find someone who answers the question with how he treats you.",
            "Its so comforting. When I say \"You don't have to do that for me.\" \n\nHe says \"Yes I do. That's my job. I enjoy cooking for my loved ones and making sure they are alright.\"\n\nI'm sorry about your situation. Don't be afraid to demand better. A loving supportive husband is like a warm blanket. It feels like he is my home.",
            "The forever bestie sleepover!",
            "been there. But I got out. And you can too! \nMy current partner makes me feel loved constantly.\nThey are my best friend and favorite person.\nI would describe it as dreamy and magical.",
            "It is wonderful. I feel safe to be myself with my partner. 100%. He is never cruel or even mildly unkind, even when I make a mistake. I have never looked at him and found anything but love in his eyes. If we need to talk about something that is difficult, or that bothers him, it is done with kind words and hugs. He cares about me, about how I feel, and about my well-being. He likes to make me smile. He gets enjoyment from seeing me happy. He prefers to spend time with me over anyone else. He only ever touches me lovingly, never to punish or humiliate me. He loves me. But he also actually *likes me as a person.*\n\nI spent a decade in a marriage to a man who usually looked at me like you might imagine someone would look at a person who murdered his mother. He was seethingly angry at me all the time. There was never tenderness or understanding. I was never good enough and could never please him, no matter how hard I tried. I should never have married him. The marriage absolutely crushed my spirit. I'm really glad I corrected that mistake so I could be free to meet someone who actually knows how to love.",
            "Amazing 🥰 it's like the guy I dreamed of in childhood really does exist! It's been 5 years of marriage now and he's sweeter than ever.",
            "I have a wife not a husband but having a wife that loves me makes me feel desired, comforted, and supported. I look forward to seeing her every morning and vice versa. We are basically each other's best friends. Everything isn't roses and perfection all the time but when you truly love each other, you can communicate and be open much easier."
        ]
    }
}