{
    "Master Post: So you want to be a motherfucking successful ass adult": {
        "title": "Master Post: So you want to be a motherfucking successful ass adult",
        "score": 2263,
        "url": "https://www.reddit.com/r/Adulting/comments/bl27uv/master_post_so_you_want_to_be_a_motherfucking/",
        "content": "  \n\nSo, you want to be a fucking successful adult. CONGRATS, I have written some how-to’s for you so you can start to get your fucking shit together. \n\n[Part One](https://www.reddit.com/r/Adulting/comments/bgzqbc/how_to_be_a_motherfucking_successful_ass_adult/)\n\n[Part Two](https://www.reddit.com/r/Adulting/comments/bh0m1l/being_a_motherfucking_successful_ass_adult_part/)\n\n[Part Three](https://www.reddit.com/r/Adulting/comments/bh3evn/how_to_be_a_motherfucking_successful_ass_adult/)\n\n[Adulting with Depression](https://www.reddit.com/r/Adulting/comments/bh4lzh/how_to_adult_when_you_are_too_depressed_to/)\n\nHere are some fucking FAQ’s on the parts I wrote so that you don’t have to scroll through and upvote every single nice comment in the comment section on all of the parts. \n\nQ: Are there going to be more parts?\n\nA: Yeah probably. But I have a fucking life where I do things that aren’t writing how-to’s, so they will arrive whenever I am feeling generous enough to give advice and have the energy to write about said advice. \n\nQ: You should write a book.\n\nA: Thank you, I am. The book is in the works, basically it’s a fucking 100-page rant where I talk about how to wash your balls. \n\nQ: How old are you? Are you a boy or a girl?\n\nA: I am an adult. I will not tell you my age because once I do you will suddenly have all these pre-conceived judgements about the quality of the advice I give. But here is a hint, I am older than 18 and younger than 50. I am a person. Take a guess on my gender and if you get it right Ill give you a fucking star. \n\nQ: Why can’t you write normally?\n\nA: Because there are a bajillion fucking self-help books out there written normally, and there are like 5 that are written in a way that people fucking relate to and listen to. If cursing *turns you off* then good. I only want readers who can fucking read this shit with a boner 6 miles long. \n\nQ: I have a tip that you don’t mention, can you add it to the article?\n\nA: Sure, if its actually fucking good. Send me a message with your advice that you think is good enough to make it, and I’ll add it to the end of the article and credit you. \n\nQ: I run a podcast/YouTube channel/ blog, can I interview you or have you guest speak?\n\nA: Generally, yes. My time is precious, so if you want me to write something completely new for your shit its going to take a while and will probably cost you more than exposure. \n\nQ: What do you do when you aren’t cussing people out on the internet?\n\nA: I own a business and am a stay at home parent. When I am not writing, I am packing orders, creating or listing new product, taking care of my son, or playing with my two dogs. I rarely have any down time.\n\nIf you have more questions you want answered or have an idea for an article you want me to write, send me a PM. I will decide if its cool enough for me to respond to it.",
        "num_comments": 169,
        "comments": [
            "Adding \"fucking\" to every other sentence really helps with comprehension do appreciate",
            "This brings me more joy than words will describe. If you do finish your book, can 10/10 guarantee it will appeal to everyone >30 and probably most salty people <30. Can also confirm most people dont know how to do shit. I'm 21 and have a job and work my ass off but literally feel like I'm the most useless \"adult\". Power to you dude.",
            "Lotta hostility. Limited vocabulary. Extremely full of ur self. I wouldnt trust a word you say. Just sayin.  put a cork in it.",
            "The amount of unnecessary swearing feels quite childish.",
            "You're not the first person to try the swearing shtick, it's super cringe",
            "The swearing every 3 words feels like Im reading a 2012 tumblr post again, just as cringy",
            "Your posts make me feel good so far because i already do or have done most of these things!! \n\nI thought i wasnt adulting well but clearly Im on the right track",
            "Please let us know when the book is finished. This is motivated as hell",
            "Finally some good fucking food !",
            "I want to be a successful ass adult, but I don't have any plans to fuck people's mothers. Heavens, no."
        ]
    },
    "Discussion: New Rule re: Mental Health, Suicide, etc.": {
        "title": "Discussion: New Rule re: Mental Health, Suicide, etc.",
        "score": 48,
        "url": "https://www.reddit.com/r/Adulting/comments/1c0d35j/discussion_new_rule_re_mental_health_suicide_etc/",
        "content": "Hello Fellow Adults,\n\nThis subreddit serves as a gathering place for adults to share their triumphs and challenges. A number of these posts often involve topics related to suicidal ideation and self harm. There are many resources across Reddit (eg. /r/depression, /r/SuicideWatch, [wikis](https://www.reddit.com/r/SuicideWatch/wiki/hotlines), \"get them help and support\" button\") as well as off Reddit (eg. [Suicide and Crisis Lifeline](https://988lifeline.org/), [Suicide Prevention Resource Center](https://sprc.org/), [National Institute of Mental Health](https://www.nimh.nih.gov/health/topics/suicide-prevention)).\n\nUnfortunately, our community is not trained nor equipped to sufficiently support these types of posts. Because of this, the moderator team will be trialing a new rule that is listed below to encourage these users to seek support within the communities and resources best suited for them:\n> **4.** **Respect Mental Health.** - No posts or comments involving threats to oneself or others. /r/depression and /r/SuicideWatch/ have resources and trained members to provide support.\n\nWe invite you to discuss and share your opinions on this decision below. Thanks in advance for your feedback.",
        "num_comments": 10,
        "comments": [
            "I'm 100% in favor of this. It's been leaking into a lot of subreddits that I browse and it's honestly became both frustrating and exhausting. I  do get that the worlds a rough place and mental health is suffering from a lot of people, especially younger ones, but theres a time AND place for it. And it just permeates the subreddit in a nasty way if left unchecked",
            "thanks, its very stressful to see these kinds of posts, and I tend to leave if I see one.",
            "The world is dark and full of terrors, and it's so easy to go off the deep end, but agree with this policy. Everything in its place and to each according to their means and what not.",
            "I like this and as someone who is depressed, I sometimes don't want to focus on or talk about things that upset me. I'm trying to be more positive",
            "I can't go to monkeys paw or ouija now because half are trying to back-handedly get some kind of affirmation to hurt themselves. It's saddening, stressful and frustrating.",
            "Expressing suicidal ideation in the wrong context is like walking in to a crowded room and farting loudly then expecting sympathy/empathy from everyone that has to smell your poo gas.",
            "Good stuff",
            "Thank God."
        ]
    },
    "How do you start enjoying life again?": {
        "title": "How do you start enjoying life again?",
        "score": 210,
        "url": "https://www.reddit.com/r/Adulting/comments/1dqztc1/how_do_you_start_enjoying_life_again/",
        "content": "I was just thinking about this the other day and honestly I've not felt anything in a long time.  I don't get happy or sad or excited or laugh at anything anymore and I haven't in at least a year.  All I ever feel is tired and/or frustrated.  \n\n\nHow do you solve this? I'm only 25 and I feel like I'm incapable of joy anymore.   Has anyone gone through this before?",
        "num_comments": 164,
        "comments": [
            "Cut the screen time and return to this question later",
            "Ive been in some BAD ruts. Losing my baby was bad. Bad bad bad and I never thought Id be okay again. But eventually, I started just doing things, art, walking, seeing friends. It just became less bad. Now, I like my life. I have some things Id change but just doing things if I felt like doing them really did help. I have a lot of people in my life that tell me going to dinner or travelling on my own is insane, and at first it put me off. Not listening to them and letting go of fear is hard, but liberating. Its taken me a LOT of time, effort, and forcing myself to do things even if I dont want to. Sometimes that first step is so hard, but once youve started, thats the hard bit done.",
            "Stop taking it so serious especially if your doing everything your suppose too and can. You can never get your time back so dwelling on regrets and resentment is never healthy.",
            "I'm 27 and I felt the same way a few years ago. Having something to look forward to has helped me. Like a new album, tv show, concert, book, etc. It's the little things in life that keep me going.",
            "I feel this! Just here to validate! I do think it gets better but you just have to give it some time and start by doing one thing at a time that you enjoy and create a habit out of it!",
            "My 20s were terrible. It only got better afterwards. I'm 50 now and happiest I've ever been. Ten years of therapy, learning how to be kind to myself and others, and being genuine are all factors.",
            "Work pays bills so you can then start living. Never let a job dictate who you are.. unless you love it",
            "When you realize everything is bullshit, you might as well enjoy the things you can.",
            "I was feeling like that. And I finally talked to someone about my mental health. A combination of therapy and medication has really, really helped.",
            "Do nice things for others."
        ]
    },
    "Having to do sex work again just so I can afford bus pass for my new job. I feel so fucking filthy. ": {
        "title": "Having to do sex work again just so I can afford bus pass for my new job. I feel so fucking filthy. ",
        "score": 48,
        "url": "https://www.reddit.com/r/Adulting/comments/1dr67n6/having_to_do_sex_work_again_just_so_i_can_afford/",
        "content": "I told myself I’d never do it again. It made me sick to my stomach. Made me have suicidal thoughts. I had to eat dog food after I ran out of food for myself first, just so I didn’t have to do it but now I am being pushed into doing it again. \n\nI just fucking hate my life right now. Called the person last night that contacts client to schedule me for sunday night and guess what I cant sleep due to the fact that I will have to do it again tonight so I can have money to start my new job. \n\nI keep on telling myself that I’d do it just this last time for me and my dog. That once I get this job started I should be able to get back on my feet and never look back on the things that I did to survive but does it really get better? \n\nI’ve had a small money but my bank took it because Im overdrawn. My period is also coming soon and Im stressing and I cant even afford tampons. \n\nApplied for a free bus pass but it was denied. Im not supposed to start this job until mid of July but there were changes. It’s not like Im not trying. I am doing everything that Im supposed to do. Offering cleaning services, knocking door to door to see if there are chores I could do but theres no luck. \n\nI feel like a disappointment, I cant even afford to buy my dog some treats and I am so ready to give up if it weren’t for her. \n\nI am beyond exhausted.\n",
        "num_comments": 71,
        "comments": [
            "Dont you qualify for EBT card and cant you go to the food bank for free food? How about your local soup kitchen. I used all those and had 3 hot meals a day until i got back on my feet",
            "I don't get the dog food thing. A bag of beans and a bag of rice is cheaper than dog food.\n\nThat said, sorry you had to go through this.",
            "Your situation sucks, but I hope you don't give up looking for other opportunities even after being rejected many times. Eventually you will get a better job.",
            "Have you tried a food bank?",
            "are you same person who ate dog food a few days ago?",
            "Breaks my heart to hear about your situation :( I'm so sorry the world has been so cruel to you. Sending best wishes because there is nothing else I can send",
            "What if u create OF, u don't need to show your face",
            "You need to rehome your dog, you need to visit a food pantry, you need to call some help services, I'm sure a local church could point you in the right direction.\nHow is it you have no friends or family to ask help from? \nI feel like this is a troll post as I saw a very similar one a few days ago.",
            "I'm not even sure what to say but trying to focus more on the positive even when the negative seems like it's so high training yourself to constantly keep thinking about the positive training and training and training and training to keep yourself controlled. It's easy to drift when what we call problems arise. You're stronger than you think. Remember that!",
            "Do you have a bike?  Can you do gig work like Uber eats?"
        ]
    },
    "Falling in love when you were in school was so much more...real.": {
        "title": "Falling in love when you were in school was so much more...real.",
        "score": 164,
        "url": "https://www.reddit.com/r/Adulting/comments/1dqzrlz/falling_in_love_when_you_were_in_school_was_so/",
        "content": "(Just venting, open for opinions)\n\nCompared to dating as an adult (M19), everything feels so serious and superficial to me now. It always felt off for me to see adults approach a person solely because they liked how that person looks. Thankfully, later on, even I understood. But for some reason, I still can't get rid of that feeling sometimes.\n\nAs a hopeless romantic back then, I fumbled/rejected/completely missed almost every opportunity when I was in school, but there was still someone I had a romantic time with, even though it wasn't particularly long.\n\nShe had seen me in every light: the way I talk, write, think, argue, overreact, paint, run, watch a movie, complain, yell, listen, dance, smile, and get beaten up as a nerd. Obviously, the same goes for her. The more we learned about each other, the bigger the flame in our hearts grew.\n\nI miss finding someone who loves you for who you are and the way you see the world, and not what you could be and how the world sees you. Yes, it's definitely not impossible, just very hard. \n\nUnderstanding and seeing love hasn't been the same for me ever since. I'm not really fond of approaching someone without knowing anything about them but their appearance. ",
        "num_comments": 67,
        "comments": [
            ">Compared to dating as an adult (M19)\n\nIm sorry homie but I literally laughed out loud here",
            "Not being an ageist here in anyway. Youre 19. Not invalidating whatever youre feeling at the moment,  but there is sooo much youre yet to see and experience. See how youll feel years from now. \n\nIm 29 and I know that there is a lot that Ive yet to come across and experience. Right now, I would just say - process what youre going through or go through, live a little, take decisions, make mistakes,  but more importantly learn and make the best of the present.",
            "Teenage/childhood crushes definitely hit different. Wouldnt necessarily say better though.",
            "I beg to disagree. 40+ and absolutely head over heels in love. And it is so much better than teenage crushes. \n\nYou're 19. I promise there is a lot more to life than you're seeing right now. Good and beautiful things, too.",
            "Dont give up. I was told I was too nice, too romantic like you say. That I thought love was enough and that wasnt the real world. I found my Prince Charming and we love each other every day. I didnt date much as a teenager either because of that same reason. I took it very seriously. I wanted to be swept off my feet and not just date someone. I found what I was looking for, and I wasnt even looking. I was just sure I wouldve had it eventually. I didnt care when.",
            "If you keep looking in the rear view mirrors you will miss the gold in front of you.",
            "Brother, I know you feel all grown up, but even in a few years youll look back and realise that you were still basically a kid. You are still in your teens\n\nLove in your 20s is a wonderful thing when some more maturity has been gained",
            "I know everyone is making fun of your age but im in my 30s and the most genuine love i ever experienced was between the ages of 17-25. Things can become a bit jaded as you grow older.",
            "One day when you least expect it it will hit you again like a ton of bricks. It always does.",
            "Bro, stay a hopeless romantic but dont be a hopeless human. 29 year old me thinks 19 year old me is a fuckin smooth brain baby, notably so on the love side of things. Just, chill. Give it time, youll be pleasantly surprised"
        ]
    }
}