{
    "I suspect my guy best friend wants to have 3sum ": {
        "title": "I suspect my guy best friend wants to have 3sum ",
        "score": 50,
        "url": "https://www.reddit.com/r/Advice/comments/1dr5ddr/i_suspect_my_guy_best_friend_wants_to_have_3sum/",
        "content": "For context, I 22F, and my bff 22F, have a guy best friend 19M who I also happen to have history with but it’s all in the past and there’s no bad blood. It ended amicably. \n\nMy best friend and i have recently noticed a change in behavior from him. We’ve noticed that he has been extremely touchy in the past month. For example, we went camping, we shared a tent, and slept on a queen inflatable. We all had our own sleeping bag and on the second night, he slept hugging my best friends bare legs (she was wearing shorts). \n\nFast forward Today, we had a pool day! All was well until my sibling left the pool and went home. It was just the three of us. In that time, we noticed a shift in his personality. We noticed that he was grabbing us, hugging us, throwing us around, and pulling my best friends hair, touching my legs/and face, rubbing faces with me, whispering in my friends ear, and staring at our racks! \n\nNow, we understand this might be normal? Maybe it is or maybe it isn’t. I felt something poking my back at some point though. Is he trying to have a challengers moment? \n\nYes, me and him have history but i think it’s weird that he is trying to get at my friend too. He even left a couple bruises on my friend from playing around too much.\n\n Are we overthinking this? Is this all in our heads or is this actually happening? Any advice would be greatly appreciated. ",
        "num_comments": 35,
        "comments": [
            "Bring up girl talk around him. Talk about other guys, who you think is cute, etc if he was trying to make a move hell cut that shit out and b turned off. \n\nIf hes just behind his wacky o self, youll sense it",
            "Hey other bestie here, no I dont have history with him and Im not trying to get him someone asked this",
            "I mean yeah hes clearly asking for one of you, maybe not both. Sounds like hes trying his luck. A man with no partner 90% of the time will always have some attraction for his female friends",
            "As you said he is 19 i m sure he told his friends about both of you and they told him to do this etc etc...",
            "The dude is 19 with 2 older women as best friends",
            "Op i think you know what to do if this is something you  all are into",
            "I feel like you are right at your place and not overthinking it if you feel he's making you both uncomfortable you can just confront him and tell him to stop doing this !",
            "its normal for a 19y.o., speaking from experience, but if you or your friend are not interested, simply tell him to tone down the horniness...",
            "I'm not sure this is a shock. The male 19 year old has the same level of intellectual and emotional development as you did when you were ten, and he's at least fifty years away from catching up with you.",
            "Thanks we will for sure try this "
        ]
    },
    "My mum saw an NSFW pic of my boyfriend while scrolling through my phone": {
        "title": "My mum saw an NSFW pic of my boyfriend while scrolling through my phone",
        "score": 808,
        "url": "https://www.reddit.com/r/Advice/comments/1dqmavg/my_mum_saw_an_nsfw_pic_of_my_boyfriend_while/",
        "content": "My (F23) boyfriend (M20) and I recently got back from a short break in Italy so I decided to show my mum some holiday pics. There was a knock at the door that I had to answer so I made the mistake of quickly handing my mum the phone so she could swipe through them herself. \n\nAs I came back into the room, I heard my mum go “Oh wow…” When I asked what it was, she smirked and turned the phone around to show an NSFW picture of my boyfriend from a couple of weeks age. “Aren’t you the lucky one?” (My boyfriend is well endowed).\n\nObviously I was super embarrassed and swiped the phone out of her hand as fast as I could. My mum just laughed. She likes to tease and make jokes about things, which is what’s got me worried that she’ll say something the next time she sees him. So now I’m left wondering, do I warn my boyfriend that my mum has seen his goods (and is likely going to make a crack about it)? Or do I just pretend it never happened and hope for the best?\n\nWhat is the best way of dealing with this? ",
        "num_comments": 194,
        "comments": [
            "Warn him 100%. Just so hes prepared to ignore the comments or giving a joking rebuttal.",
            "Hmm wonder what the comments would be like if OP was a guy who accidentally showed a NSFW pic to his dad, with his Dad commenting are you a lucky one\n\nIm sure the comments would be making trivial jokes and telling OP to keep it as a inside joke and not that their partner had their privacy violated",
            "Your mom is a weirdo",
            "Sounds like a karma farming story to me.",
            "This is such a big fear of mine giving people my phone ",
            "Yes, you should let him know what happened. But first, create a hidden file for your naughty photos so something like this doesnt happen again. \n\nAt least your mom was pretty cool about it, rather than being scandalized.",
            "Mom really said \n\"Nice cock\"",
            "I get that your mom tries to make jokes, but personally I wouldn't be okay with my mom making a comment kike that about my bf... thats so weird and not an okay thing to say...",
            "Make the first joke and win that situation",
            "That comment of hers is hella weird, though. Frankly, I'd start watching her behavior and body language around your bf if I were you 'cause all kinds of weird sht can happen when people think with their genitalia"
        ]
    },
    "My boyfriend was unhappy with the birthday gift I got him ": {
        "title": "My boyfriend was unhappy with the birthday gift I got him ",
        "score": 302,
        "url": "https://www.reddit.com/r/Advice/comments/1dqtmqt/my_boyfriend_was_unhappy_with_the_birthday_gift_i/",
        "content": "My boyfriend is an avid record collector and mentioned numerous times he wanted to get something to showcase his record collection. \nFor his birthday, I got him a display case for his records and a shelf as two different options just in case he didn’t like one of them. \n\nWhen he opened his gifts, he was visibly disappointed and said one of them was too bulky and won’t fit where he wants it to go, and the other was too impractical for him to use. \n\nAt the end of opening all his other gifts, he said thank you and he appreciated it but also said he was disappointed, didn’t feel loved and all of his gifts felt like things he needed off of his to-do list. His reaction obviously hurt my feelings and I was explaining why. He apologized and said this is exactly why he hates gifts and would’ve appreciated being “surprised” by a gift. \n\n I put a great deal of effort into getting him things that I thought he would love and was excited to give him his gifts but his reaction left me confused, hurt and feeling rejected. \n\n\nAm I being dramatic or is he being ungrateful? \n\n\nEdit: thank you for all your comments. It seems my head already knows what to do in terms of this relationship but my heart still needs time to catch up. I do love him a lot but often wonder if I deserve better. ",
        "num_comments": 104,
        "comments": [
            "Take the items back to the shop, its not the way to show thanks if someone has made an effort.",
            "He can note that he didnt think they were a good fit, but saying hes not loved is a dick move.",
            "He's being a fucking asshole! Who the hell talks like that after relieving a gift?! Who raised this man?!",
            "He sounds like a whiny ungrateful baby. It was a thoughtful gift based on his interests. Id say get him a damn gift card next time & let him pout but truthfully that would probably be the beginning of the end for me",
            "That was ungrateful and rude.  It would have hurt my feelings, too.",
            "I dont surround myself with people that are impossible to make happy.",
            "Your boyfriend is an ungrateful little shit that acts like a spoiled 12 year old.",
            "there is no way in hell i would ever be disappointed after someone got me something from the goodness of their heart. even if it wasnt rlly what i wanted or if i didnt like it, bc at that points its not a them problem but a you (me) problem. so sorry he reacted this way :/",
            "If he hates them so much you should return them. Hope you kept the receipt, for the shelves and the boyfriend",
            "This is a thoughtful gift. But. Its one of those things people have a certain view on. \n\nI think you are an amazing GF and his reaction was that of a spoiled kid."
        ]
    },
    "What types of physical touch do boys like?": {
        "title": "What types of physical touch do boys like?",
        "score": 73,
        "url": "https://www.reddit.com/r/Advice/comments/1dr0phr/what_types_of_physical_touch_do_boys_like/",
        "content": "I’m a girl and I’m just wondering what to do so help a girl a girl out!",
        "num_comments": 133,
        "comments": [
            "Some of us appreciate a good head scratch.",
            "Definitely depends on the person. Personally my boyfriend loves cuddles, smooches, and I think headpats but yeah headpats usually depend on the person.",
            "Hugs and having someone run their fingers through my hair. It's oddly soothing.",
            "26m here and I am NOT a touchy feely person, but I can say 90% of men will melt if you run hands through their hair. Other than that, just small things here and there to show you care or are thinking about them, like randomly grabbing their hand, a quick peck on the cheek, or if youre sitting next to them making sure your leg touches theirs. Some may like more, others less, and others still will like different things, but I can all but guarantee most by a decent margin will appreciate these things.",
            "Touching shoulders/traps from behind, a hand running up/down the back, butt smacks(theyre just fun both ways lol), hugs with their head cozied up into the chest, guy laying with head in her lap while shes sitting and rubbing fingers through his hair.. those are some that come to mind outside of hand holding, kisses, etc",
            "I love my back being rubbed/scratched or the back of my neck. Just something that relaxes me.",
            "Rub my chest and tell me I'm worth it or some other nice praise",
            "All boys crave the touch of anothers fingers in their nose.",
            "This definitely sounds like a cop is writing this posing as a young girl ",
            "A back scratch is pretty cool."
        ]
    },
    "Am I (17F) wrong for not wanting my uncle to sleep in the same bed as me?": {
        "title": "Am I (17F) wrong for not wanting my uncle to sleep in the same bed as me?",
        "score": 478,
        "url": "https://www.reddit.com/r/Advice/comments/1dqncvs/am_i_17f_wrong_for_not_wanting_my_uncle_to_sleep/",
        "content": "So for context my uncle(46M) lost his job a few months ago and has been living with us for a while. My older brother moved away for college so he’s been staying in his spare room. These days it’s really hot and humid at night in my country. The only rooms with AC in my house belong to me and my parents. \n\nSo recently my uncle asked me if I’d mind if we share a room. I agreed only on the condition that he sleeps separately on a mattress and not on my bed (simply because I’m not comfortable sharing a bed with a grown man). He disagreed saying that I should let him sleep on the same bed because he’s family and not a stranger. Majority of my family members did take his side and told me I’m disrespecting my elders. I definitely get where they are coming from. But Ever since then he’s been acting a little weird. For example two days I woke up to this man staring at me or touching my forehead. One day he even bragged about how he came to my room at night , kissed me on my forehead and left.  I mean nothing about this is wildly inappropriate and I have no idea if the last sentence even happened or not because I was asleep. But the idea of him even staying in the same room  as me has increasingly become very creepy for me.",
        "num_comments": 295,
        "comments": [
            "Thats fucking creepy. Im so sorry your family doesnt see that ):",
            "It's highly inappropriate and creepy as hell. Get a lock for your door, he can get an AC for his room.",
            "The majority of sexual abuse is from family members. This is 100 percent preditory behavior. Absolutely stand up for yourself regardless of his age. You have a right to say you are uncomfortable with this. Honestly if your family is that blind. My advice is let him have the whole fucking room and go sleep somewhere else. I dont know what country your in but if you are legally considered an adult at 18 then I would try to leave that house as soon as possible for you. Clearly your family isn't protecting you. If he touches you CALL THE COPS. YELL, KICK, PUNCH, SCREAM! If he is willing to hurt you in the most devastating way someone can hurt another person, then you have the right to destroy the family and yell it from the roof. Dont stay silent. I feel like in these situations young people dont know how to speak up because they are afraid or they dont realize till way later that it was abuse. DONT BE SILENT",
            "What the hell is wrong with your family man??? Why would they want you to share with an old ass man? Especially since you stated that you don't want him there. It's your room, you should have the decision. Omg this is maddening.",
            "Yeah no. Absolutely not. Every fiber of my being is screaming no right now. They can go and get an AC unit for that other room your brother used to be in. An adult year old should never be sleeping with a 17 year old. Especially not some fucking creepy uncle which just adds to the situation. Definitely buy a lock for your door and put them in yourself if you have too.",
            "Sleep on the floor in your parents room and continue to loudly accuse him of being creepy to anyone who will listen. If he takes over your room fuck it but you cannot be alone with him any longer. Keep asking your parents if theyre going to take his side when he assaults you. Raise holy living hell anytime he is near you. The only way you get out of this as of now is raising a huge stink about it. Do not take any food or drink offered by him.",
            "I would suggest your mom stays with you and he sleeps with your dad.",
            "No that's weird as fuck",
            "There is a saying I was told once, \"in order for a girl in India to not be a victim of incest, she must have no father, brothers, uncles, or male cousins\".\n\nSo no you are not wrong for not wanting in your room while you are awake let alone unconscious.",
            "No no no not even on a separate mattress. He is a whole adult and can get a window AC like I have and like many people have. Tell your parents. If I was your parent I'd kick him out for even ASKING"
        ]
    }
}