{
    "Rule changes regarding sexual questions and account ages": {
        "title": "Rule changes regarding sexual questions and account ages",
        "score": 119,
        "url": "https://www.reddit.com/r/AdviceForTeens/comments/1bjtxs8/rule_changes_regarding_sexual_questions_and/",
        "content": "Hi everyone,\n\nWe've decided that we're going to be enforcing stricter guidelines against sexual posts. Over the past few weeks we've seen a huge increase in the number of posts describing in detail sexual stories and/or habits. These posts are largely coming from new accounts with no post history. Not so coincidentally, we've had an uptick in modmail from new accounts getting caught in the ban evasion filter. To prevent bait posts, we've increased our content filter so new accounts need their posts manually approved by moderators.\n\nWhile posts asking for advice about sexual topics aren't being banned entirely, posts that describe sexual acts in detail will be removed. This is a subreddit for teenagers, if you truly need to describe in detail what you've done sexually, you're better off seeking sexual health-focused resources than this subreddit. Many of these highly detailed sexual posts have clearly been bait from perverts and in the future they're going to be removed. **In the future, posts seeking advice on sexual topics will need to be as general as possible. Unfortunately we have to deal with banning predators on here often, so this isn't the place detailed sexual questions.**\n\nIf you have any questions, concerns, or feedback, we welcome you to either send us modmail or leave them in the comments of this post.",
        "num_comments": 16,
        "comments": [
            "Holy shit finally. This was getting out of control, I wanna hear about other teenagers interests and likes, not “I: f18 and my bf m19 had 28 rounds of secs in a row without protection, am I pregnant?” Good lord",
            "Hi. I am 30f. Would it be weird for me to be here? I figured I may have some advice as an adult, who  obviously was a teen. I also don't want to look like a predator or perv. I am a mom and I have a natural instinct to help. TIA",
            "Thank you. It is far too easy for me to worry about people who aren't even real.",
            "So glad! Too many posts about Am I preg since he pulled out? 🤦",
            "Generally adults are allowed to comment and give advice, we just have strict rules against anything predatory and against private messaging people here. As long as your advice isn't predatory and/or sexual towards minors, you should be fine to comment here!",
            "I don't think it's weird. We were teenagers at one point after all. Perfectly normal for an older seasoned person to offer advice",
            "I'm turning 45 in a month, I love this sub. I feel useful in giving the best advice I have for young people. I give the same advice I might if it were my own kid.",
            "Yeah I wouldn't worry to much I am a 25 m father of 2 most of these posts are not up my alley or in my area of expertise if you will. However I do feel as though I van contribute about teens who have questions about their fathers acting in a suspicious fashion. I honestly think I've only commented on one post other than this one and it was about a young woman who was suspicious that her father was \"overly affectionate\" it was a disgusting situation I felt as though what I Said was valuable l am an affectionate father and was still disgusted by the situation described by this young woman. I have often wondered that aswell like should I be here? I only discovered this thread by it popping up randomly actually that exact one I commented on. Personally as an adult I read the first few lines of most of these posts and think nope this is not a post for me to read or respond too and back out of itimmediatley, however I think we are valuable to this thread as on occasion it is valuable to have the advice of an adult/parent. There are certain situations that may seem completely normal to some teens on this thread that some adults with more experience would recognize as something more nefarious. Again I am a 25m of course I feel out of place reading alot of these quite frankly as I read alot of these I think oh boy my wife is more qualified for this question than I am. However I also recognize that I haven't seen alot of adult men in comments to these posts and see that sometimes it may be a benefit for a young woman to see \"hey I'm a 25 year old man and this behavior you are describing of ( significant other,father,brother,teacher or any other male figure) is completely unacceptable and would never be anything I would have considered doing in my life\". And I think your insight as a woman is even more applicable than my limited knowledge. Anyhow all that to say I think k that all the mothers I've seen on this sub have been doing an amazing service to all the young people on here that have general and not so general questions of life keep it up!",
            "Be civil. We don't tolerate insults, slurs, or any other forms of hate messages here.",
            "Fucking finally"
        ]
    },
    "Reminder that predators will NOT be tolerated here & how to report suspected predators": {
        "title": "Reminder that predators will NOT be tolerated here & how to report suspected predators",
        "score": 66,
        "url": "https://www.reddit.com/r/AdviceForTeens/comments/1aucall/reminder_that_predators_will_not_be_tolerated/",
        "content": "Over the past few weeks we've gotten numerous reports about predators on this subreddit. **This is a reminder that predators will not be tolerated here and we'll work with Reddit to ensure action is taken against any individual trying to groom minors.**\n\nAdults are allowed to give advice here since banning adults from giving advice altogether would be counterproductive, however predatory behavior or advice will result in your comment being removed, your account permanently banned from this subreddit, and your account will be reported to Reddit's admin team. We also urge any user to report these accounts as well, even if they're not targeting you.\n\n# How to Report Predators:\n\n1. Firstly, report them for breaking our subreddit rules and we'll review it as soon as we can. A new rule has been added called \"Child Predators will not be tolerated\" to help us prioritize these reports.\n2. Secondly, make another report using the report button directly to Reddit. This will allow Reddit admins to look at both the post and the account, and Reddit will take action if they deem it necessary.\n3. If you get direct messaged by a predator, **report it directly to Reddit and screenshot the messages.** Send the messages to us and they'll be permanently banned from here without hesitation.\n   1. Note that *all* messages are stored by Reddit indefinitely. Even deleted messages can be viewed by Reddit's admin team.\n4. **We STRONGLY recommend reporting predators to** [NCMEC's CyberTipline](https://report.cybertip.org/)**. Reports can be made anonymously or you can give your contact information if you want someone from either NCMEC or law enforcement to follow up with you about the report. These reports can be referred to law enforcement on a global scale, you don't have to be from America nor does the predator have to be American for you to report them.**\n   1. In certain situations Reddit will report accounts suspected of crimes against children to NCMEC, including their location info, email, username, messages, etc. in the report.\n   2. Crimes reported to this tipline don't necessarily have to be related to cybercrime. You can report real world situations too.\n\n# Note on Sexual Posts:\n\n* We understand that seeking sexual advice is a normal part of being a teenager, however we don't need a detailed description of everything you did or are thinking of doing. Please try to keep posts as general as possible and don't go into heavy detail about everything that went on. **We're debating heavily limiting sexual posts and more will likely be posted about that soon.**\n* **Sending minors sexual messages online is a crime. It doesn't matter if you're a minor too, it's still a crime and could land you in trouble. Do not, under any circumstances, message or comment sexually with people from this subreddit. We won't tolerate it, we don't care if you're also a minor, you'll be permanently banned and reported to Reddit.**",
        "num_comments": 12,
        "comments": [
            "I hope people realize digital footprint exists.",
            "Hi how do I report someone on Reddit? I’m sort of new",
            "tell him to ask first before he gets perma banned, same goes for everyone else on reddit.",
            "Thanks for posting this, both accounts you've mentioned have been permanently banned. If they send anything sexual, we strongly suggest reporting it directly to Reddit so they can take action.",
            "is there a way we can have a pinned post to maybe ban people who break the rules? I keep getting messages from people now",
            "We've considered it but usually posts like that don't stop people. We've pinned this mostly as a resource to help people report predators they find. We encourage anyone who gets DMs from people to screenshot it and send us a modmail, because they'll be permanently banned without hesitation.",
            "Gonna use this comment but a user by the name \"dragonfable211995\" and \"dragonfable21\" keeps breaking the rules by direct messaging me telling me advice instead of actually commenting on my post.\n\nhttps://preview.redd.it/zmd94348mikc1.png?width=404&format=png&auto=webp&s=01a77a93d3d7adc5ca2575973de7052ad71c1621",
            "https://preview.redd.it/dezdhqq32nkc1.jpeg?width=1242&format=pjpg&auto=webp&s=cf2dd4fe9f5bcce19907883cd238ef2b5e970cae\n\nyep, did that and he still messaged me on a new or separate account.",
            "\nHey! Welcome to r/AdviceForTeens! Please take time to review [the rules](https://www.reddit.com/r/adviceforteens/about/rules) before commenting. A reminder that inappropriate comments towards or about posters will result in a permanent ban. Do not insult anybody, please remain respectful!✮⋆˙ \n\n ATTENTION: Predators lurk on Reddit, and we ourselves unfortunately can not directly do anything to stop them, but you can! We encourage ALL posters to disable private messages, and do not respond to any DMs you receive after posting. Block and report offenders for harassment. Do not ask anyone to DM you in the comments as this is against the rules. If someone has something to tell you, they can say it in the comments.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AdviceForTeens) if you have any questions or concerns.*",
            "[removed]"
        ]
    },
    "how do i get her to stop flirting and touching me": {
        "title": "how do i get her to stop flirting and touching me",
        "score": 20,
        "url": "https://www.reddit.com/r/AdviceForTeens/comments/1dr8s0n/how_do_i_get_her_to_stop_flirting_and_touching_me/",
        "content": "so i have a friend at my summer theater camp, let’s call her charlie. she is very flirty and touchy with me, nothing inappropriate, but she likes to grab my arm every time she laughs and just little things like that. and it makes me extremely uncomfortable as a straight female. \n\nit’s not that i don’t like her because she’s queer, but because i don’t like it when people touch me. \n\nand i feel like she’s definitely flirting, but what if on the off chance she isn’t? i mean she added me to her close friends after like a day, keeps sitting next to me, and stuff like that but i don’t want to offend her. \n\noh and she’s one of those people who is self diagnosed with everything despite not having the symptoms for it, very political, etc. \n\nanyways i’m just uncomfortable because i like someone else and don’t want to be touched. and i’m not confrontational so any advice would be helpful. ",
        "num_comments": 29,
        "comments": [
            "They sound like quite the obsessive individual however some people don’t know they overstep without being told so maybe it’s worth just messaging em and telling em ur not a touchy person as some people do like it but others don’t and if all else fails just be honest texting is less awkward I’m sure they will understand",
            "Straight up, tell her to stop and that you're not cool with it. If you don't set boundaries now, it'll be difficult later.",
            "Communication goes a long way and is a huge factor in life. A simple “hey, can you please stop touching me? I don’t like being touched.” Is all it takes. Might have to remind her a few times but she will get the hint. I know a lot of people who are just naturally touchy, it doesn’t always mean they are flirting. Hell I have a client who naturally hugs and kisses everyone, I’m like a boxer trying to avoid lip contact. It just happens and friendly reminders about your boundaries are not a bad thing.",
            "You’re going to learn that not everything has to be an uncomfortable confrontation. If you think she likes you and you two are friendly, take advantage of that. Talk to her like a friend. Next time she touches you, just briefly add in “hey I know you mean well, but I really don’t like being touched by anyone. It just makes me uncomfortable when people touch me”\nAs for the flirting, she might just be a little more forthright with her expression. It can be tricky, but start with the touching and she how she reacts from there",
            "I wouldn't read too much into it. It's likely her family, or at least her mother, is like that too. Some people just have no concept of personal space, or they have a different idea of appropriate boundaries among friends. I have a friend who is the complete opposite and I'm like \"I'm not trying to assault you, I just don't want to shout across the room.\"\n\nAnyway, this is clearly more physically intimate than you are comfortable with and should simply tell her exactly that. If it hurts her feelings, it won't be the last time someone does, and she's going to learn eventually anyway.",
            "Yep that's flirting, just tell her straight up, some people just don't get it if you hint",
            "I think the difficult thing op is trying to avoid isn’t necessarily just telling her that she doesn’t want to be touch but the possibility that a scene will be made and op will be accused of being things they aren’t. Or at least that’s what I’ve gathered from the input of the “self diagnosed with everything”, and “very political part.” However another protecting another person’s feelings is not as important as protecting your own. You should definitely say what’s on your mind but do it carefully and be nice about it.",
            "Tell her to stop. If she doesn't listen, go file a complaint.\n\nYou're a girl, you'll be taken seriously.",
            "Tell her you do not want to be touched. Also tell her you are not interested in more than friendship.",
            "Tell her you ain't gay"
        ]
    },
    "How can I learn about sexual stuff without actually doing it?": {
        "title": "How can I learn about sexual stuff without actually doing it?",
        "score": 139,
        "url": "https://www.reddit.com/r/AdviceForTeens/comments/1dqu4ao/how_can_i_learn_about_sexual_stuff_without/",
        "content": "I'm 18 and female and I was homeschooled my whole life so I never learned about sexual stuff like at all. I only knew like a couple things that I figured out from hearing other people talk about it but like there's probably a lot that I still don't know and I've never had a boyfriend or whatever before. I'm going to college in the fall and it will be the first time I've ever been away from my family and I'm really nervous. I don't know how to make friends very well in general but I know in college a lot of people have sex and date each other and stuff and I feel like I'm going to fit in at all because I don't know anything. I don't think I'm ready to go to college but I'm never going to learn about that stuff at home. I came on here because my dad checks my phone and my search history and stuff but my sister said he doesn't know what this app is so he won't check and so far it worked. I talked to some people on here and some of them were helpful and told me about how to touch myself and stuff which I never did before. But I know there's a lot of stuff I don't know about dating and having a boyfriend and stuff. But I can't just search stuff on the internet or he will find out which I really don't want. I just want to be able to fit in when I go to college.",
        "num_comments": 312,
        "comments": [
            "Get a reproductive health book, learn the basics of what is what, how it works, etc. Do not feel embarrassed, give yourself time to learn on your own terms. (You have not had the time to learn yet) Do not feel pressured to engage in any sexual activity until you are ready, something you decided before being pressured.",
            "Don’t fall for the myth that in college everyone has sex, so if you’re not you’re missing out.",
            "I was homeschooled most of my life and had helicopter parents too. Always have your partner wear a condom don't fall for \"it's just the tip\". You're young you won't be good at sex that comes with time and practice with the right partner. It's not about the sex. Find a good partner that is gentle and kind and understanding. And if you go to any parties watch your drink like a hawk, even if its just water or soda. There are a lot of scumbags in the world. Feel free to message me for a more in depth conversation if that's something you want.",
            "Learn how to manage your search history and any other records to get more freedom. Unless your dad put something on your device to monitor you, even google chrome incognito mode should hide your history while searching.  I don't know your dad's experience level, but if he doesn't know what Reddit is, then it doesn't sound like much, so it shouldn't be too hard to work around.\n\nIs there any concern about safety if your parents do find anything?",
            "There’s a sex education website called Scarleteen which you’ll probably find useful. It’s aimed at young people but it’s pretty comprehensive.",
            "This is a perfect case study on why homeschooling just isn’t effective. Sure you can learn all the subjects but there’s so much about socialization that you miss out on, your teenage years are very formative years of your life and being robbed of the opportunity to learn how to socialize is just horrible. I’m not at all talking about sex here btw, just how to “fit in” and “make friends” and behave in a group of people. \n\nOP I don’t have any advice for you, but I deeply empathize with you, and I hope you are able to flourish in this new environment. Just be yourself, and be confident, and never do anything you do not want to do.",
            "Laci Green's sex+ videos on YouTube taught me a lot when I was younger.",
            "I’m just gonna say I do t recommend porn. Use anything else but porn. Porn is intentionally designed to get people watching to have an orgasm, not teach you how to have sex or even safe sex. It also is all acting so the majority of the time it’s not portraying a healthy relationshop",
            "You are not the only one at college that has never done sex stuff.  Be yourself, and be open to making new friends.  Talk to them, and ask them questions.  Don't get turned into someone's \"project\".  Dad is going to have to learn that there things that are just none of his business.",
            "Don't be nervous, college isn't like one huge orgy. You won't be the only clueless virgin on campus for sure. If you really want to learn about sex ask someone that's been married a few years. Maybe an aunt or coworker if/when you're employed. \n\nFrom an experienced male to an unexperienced woman I would only have one bit of advice: don't worry about doing it \"good\" or \"correctly\" while you're learning just don't make him/her do all of the work and they'll have a great time."
        ]
    },
    "how do I tell my suicidal friend that I'm uncomfortable with how close they want our \"friendship\" to be? ": {
        "title": "how do I tell my suicidal friend that I'm uncomfortable with how close they want our \"friendship\" to be? ",
        "score": 297,
        "url": "https://www.reddit.com/r/AdviceForTeens/comments/1dqmws4/how_do_i_tell_my_suicidal_friend_that_im/",
        "content": "my friend is suicidal and has attempted several times (according to their claims) but recently admitted that I am the reason he decided to live a little longer. but now, because of that, he's change slightly. he started calling me different pet names (i.e. gorgeous, sweetheart) and saying more romantic things that aren't usually said in guy- girl friendships. I'm scared to tell him this tho because again if I am the reason he's still breathing, could this send him over the edge and him commit? he's a very irritable person, the slightest things make him snap. so idk how to approach this subject without making him flip out and I can't send a message and block him cause we text on snap (he goes to my school, I've met him in person he just has an icloud account and can't text non iphone users) any ideas?\n\nTL:DR my suicidal friend has crossed one of my boundaries and idk how to tell him to back off without him committing \n\nUPDATE: I told him he had placed too much pressure on me when he'd told me his reason for living longer. he was a little upset saying I saw a manipulator in him (no shit sherlock) but he ended up leaving me alone.I do still plan to get in touch with our school counselors and a trusted coach so they can get to his parents. thank you to everyone who commented, I greatly appreciate all your advice and help!! God bless you all!!",
        "num_comments": 103,
        "comments": [
            "It’s manipulation. If you don’t do what he asks he will threaten suicide to get it out of you. My advice is to tell friends parents that he is suicidal and block him.",
            "Sounds like blackmail to me.  If they should threaten suicide, call EMS or who ever in your area.\n\nAnd if he snaps, and gets angry, not your problem.",
            "I've been through this exact same situation...I know how hard it is. In my situation, I was so scared to confront her about it, that i let things escalate for months and months. It started with just pet names, but i didn't say anything, which, in her mind, was me giving her permission to escalate things. I won't go too much into details, but it got much worse, and i was basically forced into a relationship i didn't want to be in. You don't want to fall into that trap. You have to say something before the situation gets worse, because then it becomes harder. In terms of how to go about it, the fact that you know him in person makes this part more troubling. He could very well be lying about you being his only reason for living, but there's no way to know for sure. Maybe try to convince him to get into therapy if he isn't already. When you talk to him, put things as gently as possible, while still making it very clear what you want, otherwise, it could make things worse if he misunderstands, or ignores your words. It'd be smart to inform a trusted adult before talking with him. Your parents, his parents, a counselor, or whatever. Don't try to deal with this on your own. At the end of the day, the people around you are gonna be more help than strangers on reddit. Hope this helps.",
            "Sounds a lot like manipulation buddy, sorry. In any case someone else's suicide is on them, not you. I'd try and get their parents involved or school or something. Good luck",
            "I'm very cynical but if he really wanted to kill himself he'd have done it already and not go around just telling people about it.\n\nThat said I wouldn't trivialize it but don't let him hold you hostage with that and establish your boundries and let him know your uncomfortable with his advances. A well adjusted adult needs to be able to understand that and if he throws a fit then maybe he isn't someone you should be hanging around.",
            "This is emotional manipulation. Seek help, not only for your friend, but for yourself as well. Be sage, young squire!",
            "If you are the only reason that he claims to be alive, then he;s not a good friend and it is NOT your esponsibility.  HE is putting this on you and that is unfair.\n\nTell him how you feel.  Tell him your concerns.  IF he does something, that is 0% your concern.",
            "Please reach out to an adult you trust about this. It’s not fair that he’s leaning on you like this. He needs professional help.",
            "You can't put this burden on yourself. Your friend needs help that you can't provide yourself but you can help him get it. Not sure how long you've known him, but it's also possible he may be trying to manipulate you into a relationship which is just creepy and also something you don't want to be a part of.",
            "I would just emphasize how you appreciate him being your FRIEND. “Its so rare to find somebody of the opposite sex who wont make it weird and will just be my FRIEND”"
        ]
    }
}