{
    "Rule changes regarding sexual questions and account ages": {
        "title": "Rule changes regarding sexual questions and account ages",
        "score": 123,
        "url": "https://www.reddit.com/r/AdviceForTeens/comments/1bjtxs8/rule_changes_regarding_sexual_questions_and/",
        "content": "Hi everyone,\n\nWe've decided that we're going to be enforcing stricter guidelines against sexual posts. Over the past few weeks we've seen a huge increase in the number of posts describing in detail sexual stories and/or habits. These posts are largely coming from new accounts with no post history. Not so coincidentally, we've had an uptick in modmail from new accounts getting caught in the ban evasion filter. To prevent bait posts, we've increased our content filter so new accounts need their posts manually approved by moderators.\n\nWhile posts asking for advice about sexual topics aren't being banned entirely, posts that describe sexual acts in detail will be removed. This is a subreddit for teenagers, if you truly need to describe in detail what you've done sexually, you're better off seeking sexual health-focused resources than this subreddit. Many of these highly detailed sexual posts have clearly been bait from perverts and in the future they're going to be removed. **In the future, posts seeking advice on sexual topics will need to be as general as possible. Unfortunately we have to deal with banning predators on here often, so this isn't the place detailed sexual questions.**\n\nIf you have any questions, concerns, or feedback, we welcome you to either send us modmail or leave them in the comments of this post.",
        "num_comments": 16,
        "comments": [
            "\nHey! Welcome to r/AdviceForTeens! Please take time to review [the rules](https://www.reddit.com/r/adviceforteens/about/rules) before commenting. A reminder that inappropriate comments towards or about posters will result in a permanent ban. Do not insult anybody, please remain respectful!✮⋆˙ \n\n ATTENTION: Predators lurk on Reddit, and we ourselves unfortunately can not directly do anything to stop them, but you can! We encourage ALL posters to disable private messages, and do not respond to any DMs you receive after posting. Block and report offenders for harassment. Do not ask anyone to DM you in the comments as this is against the rules. If someone has something to tell you, they can say it in the comments.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AdviceForTeens) if you have any questions or concerns.*",
            "Fucking finally",
            "Holy shit finally. This was getting out of control, I wanna hear about other teenagers interests and likes, not “I: f18 and my bf m19 had 28 rounds of secs in a row without protection, am I pregnant?” Good lord",
            "Hi. I am 30f. Would it be weird for me to be here? I figured I may have some advice as an adult, who  obviously was a teen. I also don't want to look like a predator or perv. I am a mom and I have a natural instinct to help. TIA",
            "Thank you!!",
            "Thank you.",
            "Thank you. It is far too easy for me to worry about people who aren't even real.",
            "So glad! Too many posts about Am I preg since he pulled out? 🤦",
            "Great.",
            "[removed]"
        ]
    },
    "Reminder that predators will NOT be tolerated here & how to report suspected predators": {
        "title": "Reminder that predators will NOT be tolerated here & how to report suspected predators",
        "score": 62,
        "url": "https://www.reddit.com/r/AdviceForTeens/comments/1aucall/reminder_that_predators_will_not_be_tolerated/",
        "content": "Over the past few weeks we've gotten numerous reports about predators on this subreddit. **This is a reminder that predators will not be tolerated here and we'll work with Reddit to ensure action is taken against any individual trying to groom minors.**\n\nAdults are allowed to give advice here since banning adults from giving advice altogether would be counterproductive, however predatory behavior or advice will result in your comment being removed, your account permanently banned from this subreddit, and your account will be reported to Reddit's admin team. We also urge any user to report these accounts as well, even if they're not targeting you.\n\n# How to Report Predators:\n\n1. Firstly, report them for breaking our subreddit rules and we'll review it as soon as we can. A new rule has been added called \"Child Predators will not be tolerated\" to help us prioritize these reports.\n2. Secondly, make another report using the report button directly to Reddit. This will allow Reddit admins to look at both the post and the account, and Reddit will take action if they deem it necessary.\n3. If you get direct messaged by a predator, **report it directly to Reddit and screenshot the messages.** Send the messages to us and they'll be permanently banned from here without hesitation.\n   1. Note that *all* messages are stored by Reddit indefinitely. Even deleted messages can be viewed by Reddit's admin team.\n4. **We STRONGLY recommend reporting predators to** [NCMEC's CyberTipline](https://report.cybertip.org/)**. Reports can be made anonymously or you can give your contact information if you want someone from either NCMEC or law enforcement to follow up with you about the report. These reports can be referred to law enforcement on a global scale, you don't have to be from America nor does the predator have to be American for you to report them.**\n   1. In certain situations Reddit will report accounts suspected of crimes against children to NCMEC, including their location info, email, username, messages, etc. in the report.\n   2. Crimes reported to this tipline don't necessarily have to be related to cybercrime. You can report real world situations too.\n\n# Note on Sexual Posts:\n\n* We understand that seeking sexual advice is a normal part of being a teenager, however we don't need a detailed description of everything you did or are thinking of doing. Please try to keep posts as general as possible and don't go into heavy detail about everything that went on. **We're debating heavily limiting sexual posts and more will likely be posted about that soon.**\n* **Sending minors sexual messages online is a crime. It doesn't matter if you're a minor too, it's still a crime and could land you in trouble. Do not, under any circumstances, message or comment sexually with people from this subreddit. We won't tolerate it, we don't care if you're also a minor, you'll be permanently banned and reported to Reddit.**",
        "num_comments": 12,
        "comments": [
            "\nHey! Welcome to r/AdviceForTeens! Please take time to review [the rules](https://www.reddit.com/r/adviceforteens/about/rules) before commenting. A reminder that inappropriate comments towards or about posters will result in a permanent ban. Do not insult anybody, please remain respectful!✮⋆˙ \n\n ATTENTION: Predators lurk on Reddit, and we ourselves unfortunately can not directly do anything to stop them, but you can! We encourage ALL posters to disable private messages, and do not respond to any DMs you receive after posting. Block and report offenders for harassment. Do not ask anyone to DM you in the comments as this is against the rules. If someone has something to tell you, they can say it in the comments.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AdviceForTeens) if you have any questions or concerns.*",
            "I hope people realize digital footprint exists.",
            "Hi how do I report someone on Reddit? I’m sort of new",
            "[removed]",
            "Gonna use this comment but a user by the name \"dragonfable211995\" and \"dragonfable21\" keeps breaking the rules by direct messaging me telling me advice instead of actually commenting on my post.\n\nhttps://preview.redd.it/zmd94348mikc1.png?width=404&format=png&auto=webp&s=01a77a93d3d7adc5ca2575973de7052ad71c1621",
            "This subreddit strictly follows Reddit's terms of service. Any posts in violation will be removed and reported to Reddit. Do not attempt to evade reddit bans. They flag accounts for this such as yours.",
            "tell him to ask first before he gets perma banned, same goes for everyone else on reddit.",
            "https://preview.redd.it/dezdhqq32nkc1.jpeg?width=1242&format=pjpg&auto=webp&s=cf2dd4fe9f5bcce19907883cd238ef2b5e970cae\n\nyep, did that and he still messaged me on a new or separate account.",
            "Thanks for posting this, both accounts you've mentioned have been permanently banned. If they send anything sexual, we strongly suggest reporting it directly to Reddit so they can take action.",
            "is there a way we can have a pinned post to maybe ban people who break the rules? I keep getting messages from people now"
        ]
    },
    "How can I learn about sexual stuff without actually doing it?": {
        "title": "How can I learn about sexual stuff without actually doing it?",
        "score": 114,
        "url": "https://www.reddit.com/r/AdviceForTeens/comments/1dqu4ao/how_can_i_learn_about_sexual_stuff_without/",
        "content": "I'm 18 and female and I was homeschooled my whole life so I never learned about sexual stuff like at all. I only knew like a couple things that I figured out from hearing other people talk about it but like there's probably a lot that I still don't know and I've never had a boyfriend or whatever before. I'm going to college in the fall and it will be the first time I've ever been away from my family and I'm really nervous. I don't know how to make friends very well in general but I know in college a lot of people have sex and date each other and stuff and I feel like I'm going to fit in at all because I don't know anything. I don't think I'm ready to go to college but I'm never going to learn about that stuff at home. I came on here because my dad checks my phone and my search history and stuff but my sister said he doesn't know what this app is so he won't check and so far it worked. I talked to some people on here and some of them were helpful and told me about how to touch myself and stuff which I never did before. But I know there's a lot of stuff I don't know about dating and having a boyfriend and stuff. But I can't just search stuff on the internet or he will find out which I really don't want. I just want to be able to fit in when I go to college.",
        "num_comments": 283,
        "comments": [
            "\nHey! Welcome to r/AdviceForTeens! Please take time to review [the rules](https://www.reddit.com/r/adviceforteens/about/rules) before commenting. A reminder that inappropriate comments towards or about posters will result in a permanent ban. Do not insult anybody, please remain respectful!✮⋆˙ \n\n ATTENTION: Predators lurk on Reddit, and we ourselves unfortunately can not directly do anything to stop them, but you can! We encourage ALL posters to disable private messages, and do not respond to any DMs you receive after posting. Block and report offenders for harassment. Do not ask anyone to DM you in the comments as this is against the rules. If someone has something to tell you, they can say it in the comments.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AdviceForTeens) if you have any questions or concerns.*",
            "Get a reproductive health book, learn the basics of what is what, how it works, etc. Do not feel embarrassed, give yourself time to learn on your own terms. (You have not had the time to learn yet) Do not feel pressured to engage in any sexual activity until you are ready, something you decided before being pressured.",
            "Don’t fall for the myth that in college everyone has sex, so if you’re not you’re missing out.",
            "I was homeschooled most of my life and had helicopter parents too. Always have your partner wear a condom don't fall for \"it's just the tip\". You're young you won't be good at sex that comes with time and practice with the right partner. It's not about the sex. Find a good partner that is gentle and kind and understanding. And if you go to any parties watch your drink like a hawk, even if its just water or soda. There are a lot of scumbags in the world. Feel free to message me for a more in depth conversation if that's something you want.",
            "If you can access a public library near you, there are a lot of great resources about sex, sexuality, and reproductive health, assuming you are not in an area where library resources have been restricted or censored. You can read the books at the library without checking them out, so your dad doesn’t have to know what you are reading—once you get to college there are a lot more resources you will be able to access without interference (assuming you’re not going to Liberty University or some place similar …). Some great books include The Girl’s Guide to Relationships, Sexuality, and Consent, by Leah Aguirre; Sex: A Book for Teens by Nikol Hasler, Being a Teen by Jane Fonda, and S.E.X. The All-you-need-to know sexuality guide to get you through your teens and twenties, by Heather Corinna.\n\nTake your time learning about your body and your preferences—not everyone is having sex and dating in college! Don’t let anyone pressure you into doing something you don’t want to do. Consent is a vital part of a healthy sex life, it is *always* ok to say no to anything you are not comfortable with, and you don’t need to justify your answer to anyone.\n\nGood luck—I wish lots of happy learning and exploring for you in the coming years!",
            "Please do not talk to strangers on here in DM's about your personal intimacy. While most of us are genuinely interested in helping you, there are just as many with less pure intentions. \n\nYou are more than capable of exploring your body and how you feel about it by yourself. \n\nOnce you get out of your childhood home and more resources become available to you, it will be much easier to research and explore relationships and intimacy.\n\nI assure you, it is not as scary or foreign as it may seem now, and you will be okay. Focus on your studies for now. The rest of adulthood comes on fast enough. Too fast, in my opinion.",
            "Learn how to manage your search history and any other records to get more freedom. Unless your dad put something on your device to monitor you, even google chrome incognito mode should hide your history while searching.  I don't know your dad's experience level, but if he doesn't know what Reddit is, then it doesn't sound like much, so it shouldn't be too hard to work around.\n\nIs there any concern about safety if your parents do find anything?",
            "There’s a sex education website called Scarleteen which you’ll probably find useful. It’s aimed at young people but it’s pretty comprehensive.",
            "This is a perfect case study on why homeschooling just isn’t effective. Sure you can learn all the subjects but there’s so much about socialization that you miss out on, your teenage years are very formative years of your life and being robbed of the opportunity to learn how to socialize is just horrible. I’m not at all talking about sex here btw, just how to “fit in” and “make friends” and behave in a group of people. \n\nOP I don’t have any advice for you, but I deeply empathize with you, and I hope you are able to flourish in this new environment. Just be yourself, and be confident, and never do anything you do not want to do.",
            "Laci Green's sex+ videos on YouTube taught me a lot when I was younger."
        ]
    },
    "Please help.": {
        "title": "Please help.",
        "score": 82,
        "url": "https://www.reddit.com/r/AdviceForTeens/comments/1dqqilu/please_help/",
        "content": "all I’ll say is that I’m terrified. I’m 16 (F) and when I was 11/12 me and two neighbour kids played something called dirty dares, something like that. They where younger than me by 2 years. I didn’t understand what was going on until now, I feel sick, basically we were in a forest type area. One boy, one girl, they where up for it, pretty sure the boy was the one that suggested it, so this was just kissing, showing privates, and dry humping. I feel so gross now and I know I’m in the wrong, I didint know back then what was going on but I was older I should have known, im scared this will ruin my life, I just need to know what do I do?? ",
        "num_comments": 137,
        "comments": [
            "\nHey! Welcome to r/AdviceForTeens! Please take time to review [the rules](https://www.reddit.com/r/adviceforteens/about/rules) before commenting. A reminder that inappropriate comments towards or about posters will result in a permanent ban. Do not insult anybody, please remain respectful!✮⋆˙ \n\n ATTENTION: Predators lurk on Reddit, and we ourselves unfortunately can not directly do anything to stop them, but you can! We encourage ALL posters to disable private messages, and do not respond to any DMs you receive after posting. Block and report offenders for harassment. Do not ask anyone to DM you in the comments as this is against the rules. If someone has something to tell you, they can say it in the comments.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AdviceForTeens) if you have any questions or concerns.*",
            "Please know that you did NOTHING wrong. Absolutely nothing. You were 11 or 12 and didn't understand what was going on. It won't ruin your life but I do recommend seeking therapy to deal with the feelings your having and any unresolved trauma you have about this.",
            "Can you explain why you are in the wrong? You were “older” but there was no real expectation that an 11/12 year old would have a strong grasp of sexuality at that time? 11/12 is still pretty young. \n\nI don’t know if I see anything here that is much of a concern since you guys were all children and it sounds consensual in the moment?",
            "You didn’t know any better and you were just kids you didn’t do anything wrong",
            "You may want to talk to a therapist about this so they can appropriately address this. \n\nBecause you were young and it’s not likely you were expected to understand sexual behavior and how to go about that. Sounds like you feel guilty but it’s not really your fault if this was all ambushed on you without understanding what they were actually doing. ",
            "Not to be weird at all but, this actually happens way more often than you think. I remember the same thing happening to almost a T when I was a young girl. It's just kids being curious and not knowing right and wrong usually.  You didn't do anything wrong. You are not gross. This can not ruin your life in anyway shape or form unless you allow it to. If it's bothering you that much, maybe speak to a parent about it and see if you need any further help with this. I think it's more of just a ICK feeling you know, cause it was way before you knew any better and you wouldn't do something like that now. It's okay.",
            "You did nothing wrong. Kids do this all the time, and have for years.\n\nWhat's destructive is the *guilt* you're dealing with. If it keeps hanging around, you should consider talking with a therapist.\n\nYou have nothing to be ashamed of. Just kids being kids. Go live your best life!",
            "This behavior at those ages is almost a given.  You have nothing to feel shame about, nothing to apologize to yourself or anyone else for.\n\nYou have a full life ahead with many wonderful things to experience. Focus on the future, be a blessing to those you encounter.",
            "I hope that this is the worst thing that happens in your life. It doesn’t seem to have done any physical harm.  Just stupid kid stuff.",
            "Don't sweat it.  Kids experiment/learn.  At that age and just kids (no adult involved) it's pretty innocent.\nAs you've probably read, most adults have some childhood story like that.\n\nI think you're just looking with older eyes on what is appropriate. When you're a kid much of that is yet to be learned."
        ]
    },
    "how do I tell my suicidal friend that I'm uncomfortable with how close they want our \"friendship\" to be? ": {
        "title": "how do I tell my suicidal friend that I'm uncomfortable with how close they want our \"friendship\" to be? ",
        "score": 102,
        "url": "https://www.reddit.com/r/AdviceForTeens/comments/1dqmws4/how_do_i_tell_my_suicidal_friend_that_im/",
        "content": "my friend is suicidal and has attempted several times (according to their claims) but recently admitted that I am the reason he decided to live a little longer. but now, because of that, he's change slightly. he started calling me different pet names (i.e. gorgeous, sweetheart) and saying more romantic things that aren't usually said in guy- girl friendships. I'm scared to tell him this tho because again if I am the reason he's still breathing, could this send him over the edge and him commit? he's a very irritable person, the slightest things make him snap. so idk how to approach this subject without making him flip out and I can't send a message and block him cause we text on snap (he goes to my school, I've met him in person he just has an icloud account and can't text non iphone users) any ideas?\n\nTL:DR my suicidal friend has crossed one of my boundaries and idk how to tell him to back off without him committing ",
        "num_comments": 77,
        "comments": [
            "\nHey! Welcome to r/AdviceForTeens! Please take time to review [the rules](https://www.reddit.com/r/adviceforteens/about/rules) before commenting. A reminder that inappropriate comments towards or about posters will result in a permanent ban. Do not insult anybody, please remain respectful!✮⋆˙ \n\n ATTENTION: Predators lurk on Reddit, and we ourselves unfortunately can not directly do anything to stop them, but you can! We encourage ALL posters to disable private messages, and do not respond to any DMs you receive after posting. Block and report offenders for harassment. Do not ask anyone to DM you in the comments as this is against the rules. If someone has something to tell you, they can say it in the comments.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AdviceForTeens) if you have any questions or concerns.*",
            "It’s manipulation. If you don’t do what he asks he will threaten suicide to get it out of you. My advice is to tell friends parents that he is suicidal and block him.",
            "I deal with suicidal ideation myself, I have attempted a bunch in the past. \n\nI will say if they go through with it- thats on them. Nobody else is responsible for keeping someone alive like that. You didn’t tie the rope and make them jump. They can manipulate all they want but at the end of the day it’s their decision. \n\nI would honestly cut them off all together. You have to put your own mental health first. You are not a professional and not responsible for the load suicidal thoughts have on a person. \n\nI would tell a trusted adult, EMS services and set a clear and strict boundary of no communication.",
            "Sounds like blackmail to me.  If they should threaten suicide, call EMS or who ever in your area.\n\nAnd if he snaps, and gets angry, not your problem.",
            "I've been through this exact same situation...I know how hard it is. In my situation, I was so scared to confront her about it, that i let things escalate for months and months. It started with just pet names, but i didn't say anything, which, in her mind, was me giving her permission to escalate things. I won't go too much into details, but it got much worse, and i was basically forced into a relationship i didn't want to be in. You don't want to fall into that trap. You have to say something before the situation gets worse, because then it becomes harder. In terms of how to go about it, the fact that you know him in person makes this part more troubling. He could very well be lying about you being his only reason for living, but there's no way to know for sure. Maybe try to convince him to get into therapy if he isn't already. When you talk to him, put things as gently as possible, while still making it very clear what you want, otherwise, it could make things worse if he misunderstands, or ignores your words. It'd be smart to inform a trusted adult before talking with him. Your parents, his parents, a counselor, or whatever. Don't try to deal with this on your own. At the end of the day, the people around you are gonna be more help than strangers on reddit. Hope this helps.",
            "Sounds a lot like manipulation buddy, sorry. In any case someone else's suicide is on them, not you. I'd try and get their parents involved or school or something. Good luck",
            "I'm very cynical but if he really wanted to kill himself he'd have done it already and not go around just telling people about it.\n\nThat said I wouldn't trivialize it but don't let him hold you hostage with that and establish your boundries and let him know your uncomfortable with his advances. A well adjusted adult needs to be able to understand that and if he throws a fit then maybe he isn't someone you should be hanging around.",
            "This is emotional manipulation. Seek help, not only for your friend, but for yourself as well. Be sage, young squire!",
            "If you are the only reason that he claims to be alive, then he;s not a good friend and it is NOT your esponsibility.  HE is putting this on you and that is unfair.\n\nTell him how you feel.  Tell him your concerns.  IF he does something, that is 0% your concern.",
            "You're being manipulated. Either they are a bad person and are using the combination of their possible suicide along with using you as their reason for living to try to get romantically close to you, or they are mentally ill and need therapy and help to get back into the right mindset. \n\nEither way, you have no responsibility to this person. If they are purposefully manipulating you, then you need to cut off contact. If they are truly suicidal and mentally ill, but are also crossing boundaries with you, than you shouldn't feel forced to interact with this person just because they said you are the reason they are living longer. \n\nNobody deserves to be entrapped into any situation, and you are being entrapped into a situation where this person is using their possible suicide to get romantically close to you. Don't ever let yourself be manipulated or used. Don't ever let anybody cross a boundry of yours for whatever reason without your consent. Tell them you care for them as only a friend and want to see them improve and get better, but you are just a friend and explain to them the boundries they are crossing. If they truly value you as a friend, they will respect that. If they don't, then move on. Don't be manipulated."
        ]
    }
}