{
    "How can I tell my parents that I failed my entrance exam in the University that they want me to attend?": {
        "title": "How can I tell my parents that I failed my entrance exam in the University that they want me to attend?",
        "score": 134,
        "url": "https://www.reddit.com/r/Advice/comments/1dlm459/how_can_i_tell_my_parents_that_i_failed_my/",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Honestly",
            "Mom and dad I failed the entrance exam of so and so university. \n\n\nMove on or ask them to help you get some tutoring and try again next enrollment cycle.\n\n\nOr, enroll in an alternative university (that their dream university accepts credits from) Start your program and get great grades. Then transfer to the other university. ",
            "Mom, Dad. I got my girlfriend pregnant...\nJust kidding, I actually failed my entrance exam. \n\nAbove is an example of what not to do. \nDon't sweat it too much. These things in life happen. Parents know this and will be understanding.",
            "Also important, where do you live, and what's the background of your parents?",
            "I remember when I was like 13. I went to an English class outside of school. On the final day, my parents dressed up nicely, and came to class just to know I missed like 16 or so/20 days. Well, I remember that day forever. Just try to be honest, and you be you. Everything will go fast. I provide no advice how to tell your parents",
            "The question at core is: Why did you fail?\n\n\nIs it because you don't want to go there?\nIs it because you don't mind going there but were to lazy to?\nIs it because you just failed even though you really, really want it?\n\n\nSecond line of questions:\n\n\nHow would you describe your parents? Are they success-driven? Would they want you to continue with this university or consider this a sign you aren't ready for it? Would they cut you off? Would they pay for tutoring?\n\n\nBefore you come up with the correct way of telling them, you need to have a plan for going forward.",
            "First know the reason why you failed, \nDid you even want to go to that university, if yes then did you work hard for it? If you did, then directly tell your parents, mom, dad i tried my best but i failed, i hope you understand its hard for me too.\nIf you didnt work hard, but you want to try again sincerely this time( get very honest with yourself in this one), tell them i failed because i slacked, but want to try again. I hope they’ll understand.\n\nAnd if you dont want to go to that uni, tell them i couldnt give my best, and will not be able to do any better even if i try again, because its just not what i want.\nJust dont think too much and tell them.",
            "Just tell them, they will find out eventually and you will feel better.  Next, apply to another college and pursue your goals, just because you don’t go to a top rated school does not mean you can’t achieve your dreams",
            "Its not the end of the world. I failed the Oxbridge entrance exams, still earning over £150k many years later.\n\nFind a University which will accept you and move on. If you don't find a University, go straight into work, preferable something that also trains and educates you",
            "Make a plan b and c then tell them."
        ]
    },
    "My mother in law wants to name my future baby daughter, how do I tell her I don't like her name choice?": {
        "title": "My mother in law wants to name my future baby daughter, how do I tell her I don't like her name choice?",
        "score": 222,
        "url": "https://www.reddit.com/r/Advice/comments/1dlfia2/my_mother_in_law_wants_to_name_my_future_baby/",
        "content": "So for starters, let me just say that I love my MIL. She's very kind and supportive, however ever since my husband and I got together, she's told me that she's always wanted a daughter named \\_\\_\\_\\_\\_, but she only had boys. She always speaks about my future baby, referring to it as \\_\\_\\_\\_, but I really don't like that name, and I don't know how I'd feel about MY own baby having a name I didn't choose myself...considering that I'm the one that has to be pregnant. I feel as if I were to tell her no, she'd feel as if I betrayed her. I just don't want to be on bad terms with her considering everything she's done for me. Should I find middle ground with her? like maybe using it as a second name? ",
        "num_comments": 140,
        "comments": [
            "Where is your husband in this? Seems like he should be the one to shut this down, not you.\n\nYour MIL is overstepping by a mile.",
            "It’s your child. Your MIL isn’t a third spouse in your marriage or a third parent. At least I hope not. Name your child what you want. If your MIL complains, tell her she had her time to raise and name children. This is your time, and you deserve it.",
            "Your husband needs to shut this down, not you. Anything you do or say will just create problems. \n\nIt has nothing to do with liking the name choice or not, naming your child is a personal decision between the parents of said child.",
            "Your daughter, your choice",
            "You don't tell her you don't like the name. You tell her she gets zero input. ",
            "Plainly put- it's your kid. Until she's old enough to change it, you and your partner share full executive authority on her naming. You wouldn't be betraying your mother in law- you don't owe her this no matter how much she talks about it. You *can* find a middle ground if you want, but you're not obligated to by any stretch of the imagination.       \n        \nAs far as how to tell her- directly, compassionately, and firmly. Honestly your partner should probably be doing most of this, or at least you should *both* do it, but either way she needs to understand that her *grand*daughter isn't the daughter she never had. Doesn't mean you don't want her to be a huge part of your daughter's life, she just needs to respect you and your partner's boundaries, same as any other relationship. Good luck!",
            "Something I’ve noticed about our parents generation is that they allowed their parents to live vicariously through them because that’s just “how it was” so they expect to be able to do the same thing with their children. They paid their dues to their parents, now they’re owed (whether they realize it that literally or not).\n\nOne example we encountered was my MIL wanting to be at the hospital while I gave birth because both her mother and MIL were there when she did. \n\nIt can be really uncomfortable to be the one who is trying to break that cycle. Like others have mentioned, it really is up to your husband to handle this confrontation. A mother will always forgive her own child, but you’re right in worrying that she may harbor resentment towards you over a conflict. If I’m honest? Cross that bridge when you come to it. Don’t even worry about having the conversation until you know you’re going to have a baby girl. Otherwise it might all be a moot point. I get that it’s frustrating to hear/deal with, but it will get easier to ignore over time. \n\nIf you’re open to it as a middle name, maybe consider that. The tradition in my family is to have the middle name have family ties, but the first name belong totally to the child and be “for them”. Just throwing it out there in case you like the sound of that idea. You’re in no way obligated to use the name at all. \n\nYour MIL will already play a big part in any future daughter’s life as their grandma - she doesn’t need any mama responsibilities. Naming a baby is a parent thing, not a grandparent thing.",
            "You feel she'd feel betrayed. You are letting your feelings control your life long decisions and in this instance these feelings are not good guides. You're trying to reason with fear - your fear that your mother in law will be angry, will reject you or will feel hurt. Whatever she'll feel about your kids name is not your concern. You are not responsible for making her happy, for supporting her, for realising her dreams or helping her to deal with disappointment. It's her task and her friends'.",
            ">she's told me that she's always wanted a daughter named _____, but she only had boys.\n\nShe didn't have the chance to name her daughter, so she will take your chance to name your own daughter. Really !!",
            "Well don’t you sound like some who doesn’t like confrontation…\n\nMuster up courage now to step up for your child and you and your parenting choices.\n\nYou don’t like the name. You don’t want to name your kid this name. Nor donuts want it as a pet name. \n\nThat you being pregnant doesn’t mean she suddenly gets a vote. The grandparent title is granted to her by the mean that you respect her son enough to make a kid with him there are privileges to that title like they can be proud and are there to spoil the kid rotten. But that’s about it. Unwanted advice or living vicariously through you or the kid is dead wrong at any given time. She shouldn’t put her trauma of overly fantasizing about a baby girl and her name on you. She might suggest the name as one she thinks is gorgeous but that was about the span of it. Not the even rest of it. It’s useless information anyway. It’s secondary to its meaning. \n\nFor you. \nDo you like your MIL enough to appraise your kid with a name bound to her grandmother in that way. It will definitely create a bond between them. Is that what you wish for your kid. And what will happen if the kid does not live up to grandmas expectations or gets crushed by the anxiety to not displease grandma. \n\nThis is not just about the name. It bigger than the mame"
        ]
    },
    "Addicted to a specific type of porn and it’s ruining my sex life. ": {
        "title": "Addicted to a specific type of porn and it’s ruining my sex life. ",
        "score": 219,
        "url": "https://www.reddit.com/r/Advice/comments/1dlet5y/addicted_to_a_specific_type_of_porn_and_its/",
        "content": "Okay yall this is wild of me but just hear me out. I’ve been watching the same type of porn for as long as I’ve been watching porn. It is fetish specific. Over time, it’s developed into a problem for me. I literally can’t “finish” without watching this specific genre of porn. Like, at all. I haven’t been able to finish with a partner in many years. Only on my own and with this specific fetish porn. It’s super niche and weird, too, so it’s not even like I can easily explain it to a partner without sounding strange. I need to fix this problem because it’s ruining my sex life. I have tried watching other porn recently in an attempt to wean myself off of this fetish, and I couldn’t finish at all so I just resorted back to my usual. Does anyone have literally ANY suggestions for me to help me get rid of this addiction-type problem? I will take any suggestions at all even if they’re small or if I’ve already tried them. I need to be able to orgasm during sex with my fiancé and I never have before because of this. ",
        "num_comments": 115,
        "comments": [
            "Quit masturbating. You’ll cum in the face of a stiff breeze in 3 weeks.",
            "okay so what's the fetish?",
            "Bro if you have to downgrade to a flip phone. Get rid of your computer find an accountability buddy with convent eyes. Is better than not even being able to have sex.",
            "You need to stop watching it entirely. At this point you’ve trained your body to ONLY be able to finish with this specific stimuli. You can’t keep going back to it or that will never change.",
            "Try quitting cold turkey.\n\nUnless of course that’s your fetish 🤔",
            "Only one option. Cut it out. Is fetish porn more important to you than your relationship with your fiancée and your mental health? It’s not easy to quit but this is not healthy. If you aren’t able to stop watching it you might want to speak with a mental health professional. Addictive behaviors can be hard to stop because they often seem benign but they can really mess up your quality of life. Block porn sites. Delete any videos you have of it. Do whatever you have to, to get away from it for a while and eventually it will get easier and easier. Also you might want to open up to your fiancé about the situation. You don’t have to tell them everything but let them know you have a behavior addiction you want to change and let them know how best to support you.",
            "Tell us the fetish you coward! Lmao",
            "Cold turkey is the only way. There's an app for this stuff too. Takes about 3 months to clear the images that flash in your mind. Also, every time you get the urge, just say things like \"gross, stupid, ridiculous, pft, wtf, gross\" repeat that stuff and you'll eventually believe it, because.. well, it is gross etc. couple months later you'll be fine. It's all about breaking patterns.",
            "Stop watching porn. F'n duh",
            "My advice is join a sex addict support group, but also fuck you for not saying the fetish"
        ]
    },
    "How to make my fiance happy in bed? I feel like nothing is working": {
        "title": "How to make my fiance happy in bed? I feel like nothing is working",
        "score": 175,
        "url": "https://www.reddit.com/r/Advice/comments/1dldtpa/how_to_make_my_fiance_happy_in_bed_i_feel_like/",
        "content": "My partner and I have been intimate for about two years now. He is often very insistent that he still loves me even if the sex isn’t great and he doesn’t want me to feel embarrassed, but I’m having a really hard time pleasing him in bed. Here are some things that he has been critical about: \n\n1. My facial expressions during sex are not flattering—I have since been very mindful of my face and making sure I try to look attractive \n2. Not being vocal enough—I have tried moaning more which didn’t help because of point #3… \n3. I don’t talk enough—which I fixed by telling him how good he feels, which positions feel good, what spot to say in, when I feel like I’m going to finish which didn’t help because of point #4… \n4. I don’t move enough. This one I really really struggle with. Like when I am in missionary I try kissing him (which he is not really into I have learned), try putting my legs around his shoulders, try pulling him in and moving him up and down against me where he usually pushes my hands off. When we are doggy style I literally just cannot force my body to move, some women may be able to relate but that position is just paralyzing to me but I am able to arch my back all the way! And when I am on top he doesn’t like when I grind back and forth which is really the only way I finish, and doesn’t like when I bounce up and down because he says it hurts. All in all he says I’m not very “graceful”. His ultimate criticism is that I am not “working with him enough” and moving with him but I just can’t figure out what that means because this brings me to point #5 \n5. I don’t have rhythm he says. So when I try to rotate my hips against him or also move when we are in missionary or side lying he says that I am not moving right and ruining the flow. \n\nI truly am starting to feel bad and like everything I do is wrong in bed. He says that he loves me so much and that I shouldn’t feel so ashamed but I really don’t hear anything positive at all except for that I am attractive. There’s been many criticisms from the beginning and I barely finish myself because I’m so focused on making him happy. The only thing I know that I am good at is head which he doesn’t let me do anymore because he wants sex to last longer. I’m sure I do genuinely suck and want my partner to enjoy intimacy with me but it makes me feel genuinely inadequate. \n\nI genuinely wish there was like a tutorial or something, we were both virgins and I truly don’t have experience. I feel like I’ll never live up to his expectations and really need advice. I know some comments may say to not stay with him if he makes me feel this way but that is not an option for me right now. Sex tips are so appreciated, thank you! ",
        "num_comments": 185,
        "comments": [
            "Try this one great trick to improve your sex life:\n\nPack up your stuff, walk out the door, cancel the engagement, start over.\n\nProblem solved.",
            "He's watched too much porn and is comparing you to the *actresses* on screen. There is absolutely no way he can have all these specific criticisms and preferences when you're his first sexual partner otherwise. And now his porn usage has given him unrealistic expectations for how sex actually is, and he's holding that against you.\n\nHe's got to let all of that go and both of you just focus on enjoying the moment, or you need to split and he can go try to find that experienced woman with rhythm he's expecting.",
            "These are all problems that he is having, not you. I think your bf is watching too much porn and has unrealistic expectations of what sex is like. Sex should fun not some anxiety filled event. You do you and if he doesn’t like it that’s his issue.",
            "Your fiancé is a porn addict and absolutely *cruel* to you.",
            "Tell him to stop watching porn.",
            "Before I comment further if it's not too personal roughly what percentage of the time do you orgasm? I assume he normally finishes to some degree?",
            "I’ve never in all my years heard someone hate the face their partner makes when they’re enjoying themselves. Everyone’s looks a bit strange and I can only imagine how self conscious all of that’s made you feel. So sorry OP.",
            "Heres a sex tip:\nI recommend you both read \"she comes first\". You'll get lots of tips for yourself, and he'll learn that life isn't like a porn movie and if he wants great sex, criticizing what kind of facial expression you have. Like good lord. How's he some kind of expert with his one sexual partner who he can't even satisfy?!\n\nSeriously. If my partner said those kind of things, I'd never have sex with them again. I was lucky enough to have my first partner set a high bar - he always made me feel beautiful and sexy and thus, the sex was amazing. Rest of the relationship was a hot mess. But the SEX! \n\nThe thing is: it's not about the sex per se. It's about how your partner treats you in a vulnerable moment that's supposed to bring you closer. He criticizes you constantly, and none of those criticisms have anything to do with making it better with you. So, in this vulnerable moment, he's orgasming every time, and you're not because you're worried (understandably) about what expression is on your face. Like if it's that much of a problem, he could close his eyes and make you come like crazy. I'm not going to say leave him. But use this as important info about who he is as a person.",
            "Your fiancé sounds like a piece of shit. My advice, try again.",
            "This guy is a shitty lover. You're not the problem here. You don't suck at sex. He does, and he has absolutely no concern for anything but turning you into a personal porn star. \n\nI'm sorry you've given two years to this waste of space and have been so beaten down that you actually think it's reasonable for him to treat you like this.\n\nETA: If you feel like being gracious to him and want to try to make this work, I think at this point you need to go nuclear. \n\nHe obviously thinks his behavior is perfectly fine, so you need to stop coddling and accommodating it. Tell him straight up that if he continues this behavior the relationship will ultimately end. You will no longer accept criticism during sex and if he opens his mouth and a criticism falls out, you will hop right back out of bed and go do something nice for yourself. *Follow through on this.* Even if it means sex stops seconds in. Even if it means sex stops seconds before he cums. Even if it means he gets upset. *Stop allowing him to treat you like this.* \n\nInsist on seeing a sex therapist as a couple. Make sure you are in therapy yourself because you need to develop a sense of self that isn't built on his approval. \n\nI cannot emphasize this enough: \n\nTHIS IS NOT HOW SEX GOES IN A HEALTHY, LOVING RELATIONSHIP. \n\nGOOD LOVERS DO NOT BEHAVE THE WAY HE BEHAVES. \n\n\nYOU ABSOLUTELY DO NOT DESERVE TO BE TREATED LIKE THIS."
        ]
    },
    "Caught my wife cheating on me": {
        "title": "Caught my wife cheating on me",
        "score": 25,
        "url": "https://www.reddit.com/r/Advice/comments/1dln00e/caught_my_wife_cheating_on_me/",
        "content": "I just caught my wh*re wife cheating on me again. We were at a bar and I looked over her shoulder to see who she was texting and *boom* instant dick pic. She doesn’t know I saw and has been asking why I’m acting strange. \n\nI’m probably going to divorce her, I saw their texts too. It looks like it’s been happening for quite some time. Also, it really sucks because the dudes dick has me beat (no pun intended) by at least an inch and a half. \n\nKinda want to denoggin myself (not really but hey)",
        "num_comments": 19,
        "comments": [
            "only option is to fuck the dude and cock block her.",
            "Wait, again?",
            ">I’m probably going to divorce her\n\nPROBABLY?! dude. Don't be a cuck. Leave her ass",
            "Cheating again? Probably going to divorce?\n\nJust do it. No time wasting, no delaying, just do it. I promise you’ll be happier afterwards.",
            "Find a woman with better tits",
            "I’m sorry she did that and for how much you’re hurting.\n\nAdvice: Get the evidence; send yourself screenshots without her knowing. Then maybe stay somewhere else for the night or a few days. Block her, make her worry. Talk to a friend. Cry. Hit a punching bag for awhile. Scream in the woods. \n\nThen get your ducks in a row and leave quietly and methodically. It’s a lot more satisfying if you don’t let her see you break, and it keeps you both out of trouble. Handle this coldly and she’ll be more hurt by your indifference than if you scream and curse and show how hurt you are. Use the evidence to make sure she gets nothing in the divorce.",
            "Gather yourself and be the better person. She clearly has problems and lacks respect for anyone including you and herself. You don’t deserve to be treated this way, that’s the bottom line. Leave the thought of her in the trash and move on. You owe it to yourself to be happy with someone else.",
            "Should’ve left the first time",
            "As a wife, you deserve way better than this. Dump her ass and move yourself forward without ever looking back on how she is doing.  Love your best life without her!",
            "ew. screw her (not literally though lol). you dont deserve that and thats gross of her to be doing that especially while married. tell her to grow up"
        ]
    }
}