{
    "Questions about joining the US Air Force, whether enlisting or commissioning as an officer, prior-service or not, should be posted in /r/AirForceRecruits.": {
        "title": "Questions about joining the US Air Force, whether enlisting or commissioning as an officer, prior-service or not, should be posted in /r/AirForceRecruits.",
        "score": 1128,
        "url": "https://www.reddit.com/r/AirForceRecruits/",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "2024 /r/AirForce Community Patches & Stickers now available for purchase! Link in comments.": {
        "title": "2024 /r/AirForce Community Patches & Stickers now available for purchase! Link in comments.",
        "score": 194,
        "url": "https://www.reddit.com/gallery/1bcz48n",
        "content": "",
        "num_comments": 49,
        "comments": [
            "now my coworkers can know I browse Reddit",
            "Just ordered! Much appreciated sir  \\^\\_\\^",
            "Bought my ocp and colored one!",
            "What an awesome deal. Great price. Thanks Big D",
            "Shows 3.33 for patches, then charges 4.",
            "Patch and shipping prices were awesome!",
            "this is the best thing Ive seen on here lol I just got each of the air force patches and stickers in both colors before it sells out Im gonna surprise my bf with it, ( hes in active duty ) ",
            "Ohhhh how have I JUST NOW SEEN THIS?? They turned out so goooood!!!!!",
            "Just ordered, u/SilentD is the MVP!",
            "I'd rather die than be seen wearing a Reddit patch"
        ]
    },
    "Why do the Thunderbirds wear oxygen masks but the Blue Angels don't? ": {
        "title": "Why do the Thunderbirds wear oxygen masks but the Blue Angels don't? ",
        "score": 443,
        "url": "https://i.redd.it/1vttjttxse9d1.png",
        "content": "",
        "num_comments": 115,
        "comments": [
            "Gets in the way of sucking dicks.  Navy cant have that.",
            "Birds need oxygen to achieve flight, but angels use divine intervention",
            "Its just the aesthetic theyve chosen. The mask isnt required for lower altitude flights, like those of demo team performances.",
            "Honestly?! \n\nHangovers. There. I said it. LOX is amazing for hangovers.",
            "Because being in the Navy already sucks the life out of them",
            "I tried watching that Blue Angels movie on Prime. Good lord was it cringy.",
            "Because Navy pilots can hold their breath longer than USAF pilots. Because they're on the water all the time.",
            "The air pressure from the mask increases with Gs in the F-16, along with an air bladder in the back of the helmet to help seal the mask with the additional air pressure.",
            "I had bad information, disregard",
            "I love how everybody is giving their best wrong answers"
        ]
    },
    "Space shuttle Atlantis landing at Edwards AFB": {
        "title": "Space shuttle Atlantis landing at Edwards AFB",
        "score": 79,
        "url": "https://v.redd.it/ouw3w94wmg9d1",
        "content": "",
        "num_comments": 14,
        "comments": [
            "Can you imagine being a brand new airman, stationed at Edwards, and getting to witness something like that? I've been in over 12 years in maintenance and I still like to watch fighter jets landing, I can't imagine how exciting this must've been.",
            "Tradition was going to Domingo's Mexican for the first meal back on earth.",
            "Only get one chance to land her, no going around. And the pilots said she flew like a brick.",
            "they should do the parachute in space so it can just float down",
            "69th updoot.\n\nAlso, I miss the space shuttle.",
            "We still have a space shuttle?",
            "It's just falling with style...\n\n![gif](giphy|pqxXb287TfNtu)",
            "Yeah that's what I do in Kerbal. Are they stupid or something?\n\n^/s",
            "No this is an older video.",
            "Do we still have an Atlantis? No both sunk along time ago"
        ]
    },
    "My face when..": {
        "title": "My face when..",
        "score": 266,
        "url": "https://i.redd.it/j106s96gne9d1.jpeg",
        "content": "",
        "num_comments": 23,
        "comments": [
            "\"I already checked my bag, that was the first placed I looked\" - 3 lvl Airman with the missing flashlight in his bag.",
            "Empty your fucking pockets. Right now.",
            "Me: Where did you last use it?\n\n3 lvl: On the plane that was launched an hour ago.(its going TDY)",
            "My favorite is when I tell my airmen to check tools when we get to and when we leave every jet so we know when we lose stuff but then they don't and then have to check every jet we worked that night to find it.",
            "Im not too sure I was that retarded.",
            "At least it was a 3 lvl and not a 7 lvl...",
            "I thought we didnt need that screw",
            "Oh man the memories. I was CTK but I was actually out that day so CTK fell on the shift lead (small shop I was the only CTK) I came in the next day to find out that one of our flashlights got an incentive ride in the eng firewall shutoff valve Panel (B1} apparently as they were looking for the flashlight they swore up and down and every way possible it wasn't in the plane. By that point it hadn't launched yet so they're dumb as shit for being too scared to run back and find it before it flew. ALWAYS check the plane first before it goes up! They learned the hard way.",
            "Same facial expression when you put your 1 level inside a \"fleshlight\" ",
            "Finds flashlight in bag after two hours of searching elsewhere."
        ]
    }
}