{
    "r/AITAH Lounge": {
        "title": "r/AITAH Lounge",
        "score": 949,
        "url": "https://www.reddit.com/r/AITAH/comments/m6n71o/raitah_lounge/",
        "content": "A place for members of r/AITAH to chat with each other",
        "num_comments": 2574,
        "comments": [
            "Is this sub exploding in popularity?\n\nIf so, thank God. r/amitheasshole is objectively inferior because of all the dumb posting rules.",
            "Is this the right sub to post a 4500 word post about being an asshole for cutting off my situationship that has become so toxic",
            "Was this group made because the mods of r/aita are jackasses?",
            "I'm unsubbing. this sub has become infested with fake or pity posts that are karma farming. shame really, this always was one of my favorite subs.",
            "How much do you believe the stories presented in this subreddit? I personally take them the same way I read 4chan stories, honestly.",
            "This seems to be a really bad place that just drives controversy via outrage clicks. We've gotta make an effort to ignore things like this",
            "Are any posts on this sub real? They all seem incredibly fake by zero karma accounts",
            "Damn, there seems to be A LOT of deadbeat fathers/husbands that really don't have a clue on Mother's Day.",
            "Idk why I read these posts.\nbut Usually, when someone asks \"Am I the Asshole Here\", 9/10, They're the Asshole.",
            "Is it mebut it seems like people dont genuinely come here to get advice but to get an echo chamber of people who agree with them. Its aggy AF"
        ]
    },
    "AITA for refusing to adopt another child and possibly divorcing my husband over it? ": {
        "title": "AITA for refusing to adopt another child and possibly divorcing my husband over it? ",
        "score": 6140,
        "url": "https://www.reddit.com/r/AITAH/comments/1dqv7k0/aita_for_refusing_to_adopt_another_child_and/",
        "content": "\nI, 33F, met my husband during university. A mutual friend of ours set us up, and we hit it off instantly. My husband made it immediately clear that he wanted to foster/adopt children in the future and that if I wasn’t okay with it, I would be gone. For context, my husband was adopted when he was 7 and wanted to do the same for others. I also made it clear that I wanted biological children as well, which he was okay with. We ended up married after two years of dating, and both completed our degrees. We currently have two daughters, Rosie5(bio) and Julia7(adopted). We started fostering when my bio daughter was a newborn and adopted Julia around  year ago. Since then, we stopped fostering and chose to focus on our family. However, I’ve noticed my husband clearly favors Julia over Rosie. He takes her out for bonding time but either leaves my daughter or drops her off somewhere else. He doesn’t tuck Rosie into bed anymore, he doesn’t make an effort to go to her events, and he practically ignores her when she’s at home, unless it’s to do something for him like chores. I’ve brought this up constantly to him and I’m at my breaking point. Rosie and Julia are both smart, beautiful, joyous girls. Rosie is both in ballet and gymnastics, highly advanced for her grade level, but has a hard time making friends. Julia has started cheerleading, makes lots of friends, but she does struggle a bit in school, which my husband uses as an excuse to not pay attention to Rosie. I’m currently three months pregnant with our third child, and my husbands reaction to finding out was “when can we start fostering again?” Two weeks ago, my daughter asked me “why doesn’t daddy love me anymore” and that was when I knew the problem wouldn’t be fixed unless I made a drastic move. I contacted a divorce lawyer and he said nearly everything would be in my favor. We have a prenuptial agreement that allows us to keep nearly everything separate. The house is in my name, we have two separate bank accounts and one joint account, which would be split, I would not be required to pay alimony, and keep one of our cars. Considering I make a substantial amount more than my husband, (250k a year while he makes around 55k) I would be able to continue our lifestyle while he wouldn’t. It also would like prevent him from adopting more children in the future. The situation is ideal for me, besides paying child support, assuming my husband would even be able to support our kids with 50/50 custody. I have no intention of keeping our daughters from him. After speaking with my lawyer I gave my husband an ultimatum, treat both our children equal or I would be filing for divorce. He was enraged after this, screaming about how I’m a b*tch for trying to ruin his life goals and saying how I don’t understand what it’s like for children who experienced the foster care system. That our daughter (Rosie) was selfish and she needed to understand why Julia needed more attention than she did. My girls ended up waking up from the noise and came downstairs crying. At this point I was both trying to calm my husband down and comfort my girls all at once. Finally, my husband stopped yelling and I could put the girls back to bed. But I have to admit, I’ve started to resent Julia. I know very well it’s not her fault and I don’t let that affect how I treat my girls, but I sometimes find myself laying awake at night wondering how it would be if we just didn’t have her. I always imagine myself with a toddler and our last one on the way, my husband loving all our kids, being so kind the way he used to. Again, I do not blame Julia whatsoever and I’m very ashamed of these thoughts. However I’m afraid if something happens again I’ll snap and I don’t want to shout at my daughters or husband. I have both girls in therapy already (Julia needs it because of her past, and we had Rosie go when started fostering.) Any advice is appreciated, as well as criticism. I’m also willing to answer any questions. So AITA? \n\nAlso- these are fake names for my daughter’s privacy as well as a throwaway account. ",
        "num_comments": 1672,
        "comments": [
            "So Julia needs more love and attention because she was abandoned by her parents, the same thing your husband is doing to Rosie. He needs to be in therapy. NTA",
            "NTA. He has so much empathy for Julia but absolutely none for Rosie. It's as though he thinks only adopted children deserve to be loved. \n\nUnless he can get it through his head that Rosie deserves love just as much as Julia does, you have to leave him to protect Rosie.",
            "NTA, your husband in his trauma, has determined that his daughter should suffer in a way her sister did to teach her a lesson. What he's really doing is showing he still has not healed from his past and is going to abuse his kids in some misguided attempt to save himself by proxy of your adopted daughter regardlessof how it effects his other daughteror his marriage. His response to your pregnancy was telling as it seems his plan is for every bio kid you all will adopt 1 as well when he can't even balance his responsibilities now. I don't always go for divorce for but his reaction to you should be a huge red flag, he took no responsibility for his actions and blamed a child for wanting their father to love them. Protect your children at all costs from him and his bullshit.",
            "Go ahead and file. Your husband is never going to love his bio kids and in the process. He will damage all 3 of them.",
            "NTA. So, he presumably wants to adopt because he believes all children deserve to be loved, and yet, he neglects his biological child? You need to leave him, this doesn't seem like something that is fixable, especially as he does not see the problem, and your children deserve better.",
            "NTA\n\nDump him; Just remind him that he can go adopt a bus-load of children as a single parent but you are not going to be around while he treats your children by birth with indifference.",
            "NTA. File for divorce. This is already impacting Rose. You need to leave your husband, this is damaging to her and its going to get worse with your baby on the way.\nPlus Julia doesnt deserve to be resented, this is all. your husbands fault",
            "He's clearly unfit to be a parent in anyway. He doesn't even love his own child. Take Rosie AND Julie and get full custody.",
            "Nta calling your wife a bitch when she points out favortism sounds like the marriage is dead. He just views you as what you can do for him and not as his wife and mother of his children. Your marriage isnt good right now. Divorce him for being a bad husband not just how he is treating the kids.",
            "NTA. You and your children deserve better."
        ]
    },
    "AITAH-I told my ex’s mum that her son physically abused me and it broke their family": {
        "title": "AITAH-I told my ex’s mum that her son physically abused me and it broke their family",
        "score": 500,
        "url": "https://www.reddit.com/r/AITAH/comments/1dr7t5b/aitahi_told_my_exs_mum_that_her_son_physically/",
        "content": "I (24 F) broke up with my ex (24 M) after a few years of hell. I was beaten by him from time to time whilst living with his family. I was blackmailed and threatened by him to stay silent for so long. The bruises I had on my ribcage were hidden with clothing so the family never saw. But eventually, I got the courage to escape and ended the toxic relationship.\nI kept in contact with his mum Sandra who is like a second mum to me and we meet for coffees now and again. She doesn’t know the real reason why I broke up with her son. While in therapy, Sandra texted to check how my sessions were going and asked to meet at a cafe afterwards. She knew I was going to therapy but had no clue what for. We sat in the car for a bit, chatted and I showed her briefly some work sheets I was given from my therapist. Basically a print out of a ppt they made about domestic violence. Sandra looked through the sheets, me forgetting that she didn’t even know about it all. She became manic and worried and asked why I have therapy on domestic violence. I would feel terrible just lying to her face so I told her to park in a more private area to chat. I then explained that her son physically abused me. She was mortified to say the least, we both ended up in tears and hugged each other. I received a text a week later from Sandra that she recommend anger management centres and therapy for him, which he refused. So she said unless he seeks help, she’s cutting him out of her life. She cancelled holiday, birthday and Christmas plans with him for the rest of the year. Did not expect that. I then get told by friends that my ex has said he is suicidal now because I told his mum about the abuse.\n\nI know it was her decision to kick him out and his actions to me are unforgivable, but I can't help feeling guilty for breaking up their family and causing her son to be suicidal. AITAH? ",
        "num_comments": 82,
        "comments": [
            "NTA. Oh poor him, his abuse has been found out by his mom! Hes not going to commit suicide, its his way of trying to turn the tables and become a victim. Classic narcissist move. You did the right thing by telling the truth.",
            "NTA. Don't believe that he is suicidal. He's just trying to manipulate the situation.",
            "NTA. Your ex is suffering the consequences of his actions.\n1. Nobody forced him to abuse you. That was his choice.\n2. He could have avoided being cut off by going to therapy and anger management.",
            "NTA. The idea that you should cover for an abuser is preposterous. NTA in any way. He made his bed.",
            "NTA, if you had kept his secret it would be easy for him to abuse his next GF. These are consequences of his actions not yours.",
            "You did the right thing, so did the mom.",
            "NTA. As a mother I hope if my boys ever acted like that in a relationship that I would find out about it. It is not on. He needs to own up to it and get intensive intervention to help. \n\nIf he didn't want anyone to know about it - he shouldn't have done it! You don't need to lie to protect an abuser.",
            "NTA. If his friends are worried about they should have him committed not harass the person he beat up.",
            "NTA who cares if he off himself the world is better of without him, its good u told his mum who knows one day the AH may become crazy and hurt her too? Lets not forget any future gf he have in the future he may hurt them too, should of report it to the cops",
            "NTA. Dont let him guilt trip you. This is on him."
        ]
    },
    "AITAH for not telling my wife I got a vasectomy?": {
        "title": "AITAH for not telling my wife I got a vasectomy?",
        "score": 2494,
        "url": "https://www.reddit.com/r/AITAH/comments/1dqyqto/aitah_for_not_telling_my_wife_i_got_a_vasectomy/",
        "content": "Me and my wife have been discussing for years that we wanted a large family. After we had our first child (a boy) we decided to wait 2 years to have another. It’s now been a little over 6 years and it has been a roller coaster. We have completely different parenting philosophies as she does not believe in spankings or discipline at all for that matter. She thinks our 7 year old for whatever reason is able to rationalize between right and wrong. Our biggest argument occurred last summer when our son threw a rock at woman while we were hiking. We were above them on the trail and it hit her right on the head to wear she was bleeding so heavily EMS had to be called. I was embarrassed and so livid that when we got back to the hotel I snapped pushed him on the ground, stood over him, and gave him a piece of my mind. My wife was not happy and in turn took our son, got a different hotel, and told my mother in law that she was contemplating on leaving me because she fears for the safety of our son.\n\nThat was the only time I ever snapped at our kid and there have been so many other times where I’ve wanted to. When he raised the window on our dog head and nearly decapitated her…I had to back off. When he urinated in our neighbors pool in front of his young daughters….I had to back off. We’ve done therapy and counseling. Needless to say that till this day nothing has changed. I decided to bring it up in one of our counseling sessions that I was considering getting a vasectomy and she flipped to the point where our entire ride home she was bawling because she felt as if I was giving up on our dream of having a big family. Her argument was that I was thinking about myself and weaponizing my body as a means to enforce my ideals instead of talking to her. However, thats thing. I’ve spent the last several years telling her that what we’re doing with our son is not working. The gentle parenting, therapy, medication is not working so the best thing I can do for myself at this point is not have any more children with the person who will not let me have any input when it comes to disciplining our child. \n\nSo this week I actually got the vasectomy and my wife was unaware from the time I scheduled to the day of the operation and I told her during breakfast. She has threatened to divorce me because she “does not want to spend the rest of my life with someone who will go to such lengths to get their way”. Every time we’ve discussed me getting a vasectomy she’s said that “I’m blowing things out of proportion “ and that having children were apart of our future. At this point, I don’t even care anymore.\n",
        "num_comments": 2056,
        "comments": [
            "Dude. Let her divorce you. Or you divorce her.",
            "Wow this is all such a sh*t showyou two should definitely not have any more children till you guys can go through some therapy, get on the same page, and get your current child in check. You child is 7, a 7 year old one hundred percent would and should know better that to throw rocks. And sure mistakes and bad judgment calls can be made, but the huge red flag here is that the kid didnt even feel bad afterwards and went right on his iPad??? You guys need to figure out how to parent your child before he becomes a full fledged psycho.",
            "ESH including the kid.  Hurting animals is not normal behavior, especially at his age, and he could have blinded or killed that woman with the rock.  There is no hope for Ted Bundy Jr. if his parents cant start presenting a united front on parenting with boundaries and consequences for the kids actions.  But they wont because they are both a mess and too focused on winning each argument.",
            "Wow. This is a dysfunctional mess. Everyone in OPs post sucks.",
            "I have a friend who has 2 sons. She never disciplined them with any consequences whatsoever. She got them out of every bit of trouble from childhood (there was a lot of really bad things) until at age 18 she could no longer get them out of anything. The oldest has spent most f his adult life in jail. Has about 5-6 kids with different women and is a total waste at about age 49 now. The younger one evidently learned from his brothers mistakes and is a pretty decent guy. Very sad to watch but the mom wouldnt take any advice from anyone. Including family.",
            "Your kid is seriously ill and tougher parenting wont help but immediate and prolonged therapy might.",
            "It's weird that there are so many 'gentle parenting is terrible' stories lately on this fiction sub. And every time it's not actually gentle parenting, it's just someone not parenting at all.",
            "You're aggressive and violent towards your child and think that will stop him being aggressive and violent. He has problems (likely caused by your \"parenting\") and needs to be in therapy. You and your wife need parenting classes, neither just being passive/permissive or being aggressive and violent are good ways to parent and hitting children is abuse not effective discipline. Educate yourself.",
            "ESH \n\nTwo AH parents raising an AH kid. The childs behavior is inexcusable, but so is both of yours as parents. Shes too soft on him, giving no consequences, and youre abusive (yes, pushing your child to the floor, standing over him and yelling is abuse!)",
            "You two sound like the perfect pair to raise a serial killer. Overly permissive mothers mixed with abusive fathers raise emotionally unregulated nightmares. I agree that you shouldnt have anymore kids, but definitely YTA. You and your wife should divorce. Your kid needs counseling to control his impulsive behaviors. What a mess"
        ]
    },
    "AITAH for refusing to let my sister in law name her baby after my late daughter?": {
        "title": "AITAH for refusing to let my sister in law name her baby after my late daughter?",
        "score": 1125,
        "url": "https://www.reddit.com/r/AITAH/comments/1dqzy80/aitah_for_refusing_to_let_my_sister_in_law_name/",
        "content": "\nHi Reddit, I tried to write this story in as much detail as possible but every time i try and write i can’t help but cry, I decided to condense the situation.\n\nI (32F) lost my daughter, Iris, three years ago. She was only five years old and passed away from a rare illness. My husband and I were devastated, and we’ve been trying to heal ever since. Iris was our only child, and we haven’t had any more children since her passing.\n\nMy brother (30M) and his wife (28F) are expecting their first child, a girl, and they recently announced that they plan to name her Iris. When they told me, I was shocked and felt a wave of emotions. I told them I wasn’t comfortable with it and that it felt like they were trying to replace my Iris. Iris was our rainbow baby since I suffer with fertility issues. We chose the name because Iris is the greek goddess of rainbows. That might be silly to other people but it means the world to me and my husband.\n\nMy SIL got really upset and said that they’ve always loved the name and that it’s a way to honor my daughter. My brother backed her up, saying that I should be touched by the gesture and that it’s their right to name their child whatever they want.\n\nI understand that they can name their baby anything, but it feels too soon and too painful for me. I asked them to choose another name, but now my family is divided. My parents think I’m being unreasonable and that I should be grateful for the tribute, whilst pretty much everyone else thinks it’s insensitive of my brother and SIL.\n\nI love my brother and his wife and they were our rocks during the loss but they are also aware of how much that name meant to us and how long it took us to figure out a name that summed our baby girl up perfectly, she wasn’t just a rainbow baby, she was our rainbow. She brought the colour back into our life. \n\nI would really like to know how other people would have reacted if they were in a similar situation and also advice on what to do next if you don’t mind. AITAH? ",
        "num_comments": 525,
        "comments": [
            "NTA that is so weird.",
            "NTA Fuck that tribute noise. Honors and tributes dont leave the recipient reeling and devastated. They havent always loved that name. They heard your daughters name and were like oh, that is a beautiful a name, too bad we cant use it. Theyre now jumping on the chance to use it themselves because your daughter has passed and if anyone objects its okay because tRiBuTE!!! \n\nTacky heartless monsters.",
            "Op, Im so sorry you went through the hardest trial of your life. Youre NTA at all. Its clear they do not respect you or your husband as any kind of pushback would have been enough for them to drop the subject. I dont even know how navigation of a situation like this would be. Im so so sorry op ",
            "NTA you'll be reminded of your own loss every time you see their daughter. It's very disrespectful of the trauma and loss you've experienced. I think they should accept that you don't want them to do that and choose another name.",
            "NTA at all. That's way over the line, I'd offer middle name as a compromise but to name their daughter what your daughter's name was is not honoring her (and obviously not honoring you either) but almost trying to say she didn't exist. Ultimately, it's their choice but if they go through with it you have every right to go low contact until you're ready.",
            "I'm very sorry for your unimaginable loss. And you are definitely NTA. Your brother may see naming the baby after your beautiful daughter as honoring but it's not. It's taking your grief and deep loss and making it into something tangible, something that forces you to face and experience your grief all over every time the baby's name is said. It's cruel that your brother and SIL would CHOOSE to force that on you and your husband. I'm so sorry you have to deal with that, too. Hugs and care to you, OP",
            "I would have reacted similarly. It feels like erasure. I would ask them, if you are ok with this solution, to consider using Iris as a middle name instead in order to honor your daughter. if they couldnt do that, I dont know how I would feel about associating with them - its very disrespectful to you to move forward at that point. They cant force you to feel honored about this. Its incredibly inappropriate.\n\nNTA obviously and I am so sorry for your loss.",
            "They should not be doing this as it will be a near constant reminder of painful memories.",
            "NTA what is wrong with your brother. This is incredibly insensitive and just cruel. If they move forward with this I would go NC. This is not the right way to honor your daughter. Im sorry you are dealing with this.",
            "NTA but I would make it clear. Its not an honor since you dont want it and its against your wishes. You dont have to be in their life and I would set that boundary. It will be too painful to be around them and their child if they name her the same name as your little girl. They can absolutely name her name and you can absolutely not be involved in anyway or be around them or their child. You have to do whats best for you."
        ]
    }
}