{
    "Alan Wake II - Expansion 1: Night Springs is OUT NOW + Physical/Collector's Edition Announcement": {
        "title": "Alan Wake II - Expansion 1: Night Springs is OUT NOW + Physical/Collector's Edition Announcement",
        "score": 97,
        "url": "https://www.reddit.com/r/AlanWake/comments/1db57f3/alan_wake_ii_expansion_1_night_springs_is_out_now/",
        "content": "https://preview.redd.it/v1c0ugue4d5d1.png?width=1000&format=png&auto=webp&s=8e3a7e3290715b8698777633afe76969f1c77eca\n\n**NIGHT SPRINGS EXPANSION**\n\nAs announced at Summer Game Fest on the 7th June, Sam Lake donned the stage to announce the first of the two expansions for Alan Wake 2, titled \"Night Springs\", would be releasing the following day, and the expansion... is OUT NOW!\n\nIn the expansion you will play as three characters across three episodes, each seemingly resembling those of Rose Marigold, Jesse Faden and Tim Breaker, as you explore \"Night Springs\", a television show set in a reality where anything is possible. \n\nIn order to play the expansion, you must own the \"Digital Deluxe\" version of the game, which can be purchased outright or upgraded at any time.\n\nYou can find the full details of the expansions over on the official Alan Wake website [HERE](https://www.alanwake.com/story/night-springs-unraveling-mysteries-in-alan-wake-2s-first-expansion/).\n\nhttps://preview.redd.it/gguo6iu16d5d1.png?width=1200&format=png&auto=webp&s=537f1af1fae0eb3a8ae55700670cb94b1d3c672f\n\n**PHYSICAL & COLLECTOR'S EDITION**\n\nAlongside the Night Springs announcement, Sam Lake also announced two new versions of Alan Wake 2 releasing in 2024: the long awaited Physical versions, as well as a Collector's Edition. The \"Physical Deluxe Edition\" releases on the 22 October 2024, and each copy of the game comes with the following:\n\n* **Expansion Pass:** Dive deeper into the darkness with two expansions, Night Springs and The Lake House.\n* **Alan Wake Remastered:** A digital edition of the critically acclaimed original game.\n* **Digital Deluxe In-Game Content:** Enjoy deluxe digital items such as unique character skins and a Lantern Charm for Saga.\n* **Reversible Cover Sleeve:** Featuring exclusive artwork, this collectible is a visual treat for any fan.\n\nAs for the collector's edition you can see in the image above, this is made by \"Limited Run\" and you can pre-order a PlayStation 5 copy [HERE](https://limitedrungames.com/collections/alan-wake-ii-collectors-edition/products/alan-wake-2-collectors-edition-ps5) or an Xbox Series X copy [HERE](https://limitedrungames.com/collections/alan-wake-ii-collectors-edition/products/alan-wake-2-collectors-edition-xbox-series-x). Pre-orders run for six weeks, meaning you have 6 weeks to put a guaranteed order in. The Collector's Edition is scheduled to be shipping from December 2024. As well as all the contents of the Physical Deluxe edition, these editions come with the following:\n\n* **Functional Alan Wake’s Angel Lamp Replica:** Light up your room with a piece of the game!\n* **Coffee World Pin Set & Ocean View Hotel Keychain:** Show off your fandom with these quirky collectibles.\n* **Alan Wake 2 Artbook:** Explore the stunning visuals and behind-the-scenes art of Alan Wake’s eerie universe.\n* **Custom-designed Collector’s Box:** All these goodies come packaged in a beautifully designed box that itself is a collector’s item. Maybe not even open it!\n\nYou can find more details on both editions on the official Alan Wake website [HERE](https://www.alanwake.com/story/lets-get-physical-with-alan-wake-2-this-fall/).",
        "num_comments": 47,
        "comments": [
            "Grabbing the angel lamp when the lights go out would be quite funny.",
            "The collectors edition is massively overpriced. I bought it, but I still know I payed way too much.",
            "From my understanding the CE is only available through Limited Run while the DE you can buy it at any retail store? I'm from EU and haven't found any store that's accepting pre-orders for Alan Wake 2 DE.",
            "Does anyone know how big is the expansion ? Like how many hours of content.",
            "Is that fucking Tim Breaker? Shit, finally, we can officially connect it with Quantum Break.",
            "I want the art book! Literally just the art book. Has anyone mentioned selling the art book separately?",
            "Fuck me for believing them when they said it was digital only I guess.\n\nI suppose in future I'll just never buy any \"digital only\" Remedy releases at launch when it would actually help their sales figures.",
            "I’m really disappointed that there’s no Collectors edition for PC.\nI really want to have a lamp, but I never had any console and wasting 200 bucks on a lamp seems like overkill.",
            "I remember getting down voted into oblivion on here for saying of course there will be a physical edition sooner or later, now it's 'amazing news' lol...",
            "Very disappointed that there's no CE for the PC. Is there a reason for that?"
        ]
    },
    "Alan Wake II - Expansion 1: Night Springs - DISCUSSION THREAD (SPOILERS!)": {
        "title": "Alan Wake II - Expansion 1: Night Springs - DISCUSSION THREAD (SPOILERS!)",
        "score": 303,
        "url": "https://www.reddit.com/r/AlanWake/comments/1db4udb/alan_wake_ii_expansion_1_night_springs_discussion/",
        "content": "Please use this thread to discuss everything regarding the Night Springs expansion. \n\n**FULL SPOILERS ARE IN EFFECT HERE**",
        "num_comments": 605,
        "comments": [
            "AND MY MOTORCYCLE IS ALSO A WEREWOLF",
            "The whole DLC really is a gigantic love letter to the fans. Poking fun at the crazy and yet also thanking us for being loyal. \n\nRemedy have always been a favourite of mine, but they really have spent the last several years going above and beyond as a company, and I'm absolutely honoured that we have communities like this where we can enjoy all the fun.",
            "Just finished! My thoughts:\n\n**Number One Fan**\n\nReally funny! Gameplay wasn't anything special (just fighting hordes of enemies) but the writing was good enough to keep it engaging. Loved Scratch's character. Probably the lightest episode of the three.\n\n**North Star**\n\nLoved this one! Great vibe, perfect mix of funny and creepy. Loved the parallels with Control.  Some fun (if easy) puzzles. \n\n**Time Breaker**\n\nDefinitely my favorite. Reality shifting in the Dark Place was my favorite part of the base game so I loved the use of that  here. Sam Lake's character was really funny and I loved the lore about Mr. Door. Appreciated how it was the most overtly story-focused of the three episodes. Only real complaint is that I wish the concept was expanded more. The handful of worlds we saw were super cool, but I would've loved to see more. \n\n\n---\n\nOverall, really liked it! Pretty short experience (took me about 3 hours) but I didn't think the length negatively impacted it too much (except maybe the last episode). Also really great soundtrack, noticed some bangers while playing.",
            "\"But maybe...\"\n\n\"You'll come back for me?\"\n\n[the absolute state of QB fans rn](https://media.tenor.com/14BnO0uEt1kAAAAM/sad-gatos.gif)",
            "Episode 1: Super fun. It felt like a fever dream. ''My motorcylce is also a werewolf'' might be the dumbest and best line in the game\n\nEpisode 2: I was hyped about it because of jesse but beside the ending twist with Alan, it was kind of boring\n\nEpisode 3: By the far, the best. I did not understand everything but it was just bonkers. Retro-Arcarde style and then a text adventure, Multiverse jumping, and so on. Then you play as the actor and not the character, kind of. And at least Sam Lake is honest and calls himself ''crazy'', in the beginning of episode 3 lol",
            "I just finished Time Breaker and I cannot believe what I just played. Absolutely insane stuff.",
            "I really enjoyed the dlc! I thought Number One Fan was probably the most fun out of the bunch, Northstar was kinda weak but still enjoyable and left me wanting to see more of whatever that ending was, Time Breaker was probably the best story wise. Gave some insight on Door’s backstory and hopping from one reality to the next was great! The only thing I really wish we had gotten was an unlock for Alan’s old outfit. Seeing him wear it in two out of the three episodes was awesome!",
            "The Time Breaker was probably my favorite because it feels like the one that has actual lore implications going forward for the RCU. \n\nFor one, it’s basically confirmed (as much as they legally can) that Tim and Jesse are variants of Jack and Beth.\n\nIt also implies another popular theory may be correct, that Thomas Zane is a variant of Alan. \n\nThe origin given for Mr. Door in the comic book matches exactly what Martin Hatch describes happening to him in Quantum Break \n\nThe ending monologue from Casey I’m fairly certain is the monologue Alan was reciting on the radio that Darling hears in the Final Draft",
            "So many great lines in these. \n\n*\"LIFE IS NOT UNLIKE A HIGHWAY\"*\n\n*\"MY BROTHER IS A WEREWOLF IN CASE THAT WASN'T CLEAR!\"*\n\n*\"MY MOTORCYCLE IS ALSO A WEREWOLF!\"*\n\n*\"A NEW BLEND IS UPON US!\"*\n\n*\"YOU ARE NOT COFFEE. PERCOLATE. BREW. YOU ARE COFFEE.\"*\n\nEpisode 3 was just rad. That Night Springs disco song is a stone jam. I wish this was longer. I want to live in Remedy Games.",
            "I think that final audio clip after the credits of James McCaffrey talking about the murder cult kinda confirms that they decided to not go ahead with the Casey episode (and presumably the Estevez one too) due to his passing. I wonder what ideas they would've had for that\n\nAs for what we actually got:\n\n1) Rose's episode may have been the dumbest thing Remedy has ever done, and it was a lot of fun. I was surprised about how good the music was throughout, and just how wild they got with it. \"My motorcycle is ALSO a werewolf\" is top tier writing, I won't accept any counterarguments\n\nAlso it was just fun blasting Taken (sorry, Haters) without worrying about the flashlight or ammo for once\n\n2) Jesse's episode was... fine? It felt a little undercooked to be honest.\n\nWhat's up with the locked chests throughout? Where do you have to find the codes for those?\n\nThis one is honestly carried by its implications. With the dialogue resembling the opening bits and various other scenes of Control so closely, it kinda implies to me that this is essentially Alan writing an earlier draft of the \"Jesse finds the FBC\" story. But the FBC isn't defined yet, it's just a generic government agency. The Hiss isn't defined yet, it's just \"uhm, coffee seeps in your brain!\". \n\nAnd I guess this version failed because Alan being Jesse's brother is too convenient, so a proper sibling character, Dylan was introduced for Control. And Dylan is implied to be another version of Jesse/Beth/Lisa/etc in the next episode???\n\n3) Shawn's(?) episode is probably my favorite of the bunch, and makes my head run wild with theorizing immediately 😅\n\nSo Door/Hatch's backstory is seemingly kept the same as in Quantum Break, which is nice to see, and Sankarin Tango *was* related to QB as well :P\n\nI wonder though, with Alan being one of two Masters of Many Worlds... is the implication that he's a Creator figure in the multiverse (and all the versions of Jack/Beth that exist out there are essentially different drafts that were created during his time in the Dark Place?), whereas Door is a different type of divine figure, one who cam travel across, and possibly govern the multiverse but is not its creator? Something like that?\n\nAlso, what's up with \"Tim\" being stuck in a spiral, and having to fight shadowy copies of himself? Did Alan end up reusing these concepts for the drafts we see in AW2?\n\nAlso also I guess Zane *is* some sort of multiversal form of Alan based on that comic segment?\n\nAaahhhhhh too much stuff, my brain hurts from all this"
        ]
    },
    "One of the weirder glitches I've encountered": {
        "title": "One of the weirder glitches I've encountered",
        "score": 75,
        "url": "https://v.redd.it/eu1w15vxid9d1",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Max Payne Bullet time",
            "This is fucking hilarious. I hope I see this on some *Alan Wake II* fail compilation in a few months time.",
            "IUAHWEDPAJIHCMEIPWMHDJIQWJausheuiahwieuhaesiuhsm hcuhaipuASJCNAOIIJAW CIO\n\nI had a stroke laughing of this.",
            "Alan: \"My eyes couldn't follow it!\"\n\nMakes sense...",
            "Same glitch happened to me in the same spot. Glad I wasn't alone, thought I had gone mad haha"
        ]
    },
    "My custom statue Alan Wake 1 (Fixed version).": {
        "title": "My custom statue Alan Wake 1 (Fixed version).",
        "score": 14,
        "url": "https://i.redd.it/aoaek8468g9d1.jpeg",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "PSA for Oh Deer Thermos": {
        "title": "PSA for Oh Deer Thermos",
        "score": 117,
        "url": "https://i.redd.it/xeknt954zb9d1.jpeg",
        "content": "Glass inside completely detached and shattered on my way to work this morning. Not sure if this is a fluke or an unfortunate testament to quality but I am devastated right now. Less than a week of use. ",
        "num_comments": 66,
        "comments": [
            "Sorry for your loss. Try contacting Airam about a replacement for the glass.",
            "Must have been weakened in shipping or something, those are quality thermoses. Been rocking four of their thermoses through forests for 20+ years without breaking the glass. A shame.",
            "Just contact them directly (politeöy and underlining how much it meant to you), who knows they might send you another one for free regardless of warranty on US.",
            "You know, I wish those thermoses were never made. I'm so sick of hearing about them.\n\nEdit: I'm getting too many upvotes, let me fix that:\n\nI might as well let you know that I think the collector's mentality, and fandom in general are ruining society. I'd argue that pop culture as a whole has been super distracting and infantilizing over the last 20 years or so causing the political fuck mess the entire world is in. \n\nI remember a time when people just enjoyed things, before they felt like they had to buy every little useless piece of plastic associated with a thing they enjoy.",
            "You’re pretty much screwed if you want a replacement in the US. eBay is your only bet, unfortunately",
            "Finally got one myself, but it went straight into a display case. Never thought about actually using it, I'd be too weird about the glass liner.",
            "Definitely wouldn't expect a collectors item game prop to have real world use quality. I would drink out of a contigo thermos before that.",
            "I'm shocked people would try to and actually use these.",
            "There’s no way these are high quality or worth the money… just a novelty. \n\nI’d rather just a solid Oh Deer coffee mug",
            "I didn’t think of that! I reached out to their US distributor (iam8bit) and waiting to hear back."
        ]
    }
}