{
    "All the relevant UAP updates from May 27-June 2": {
        "title": "All the relevant UAP updates from May 27-June 2",
        "score": 35,
        "url": "https://www.reddit.com/r/aliens/comments/1d7c90b/all_the_relevant_uap_updates_from_may_27june_2/",
        "content": "# This past week in Disclosure:\n\n**May 28 – Japanese lawmakers push for governmental probes into the UFO topic**\n\n[Japanese lawmakers convened](https://www.japantimes.co.jp/news/2024/05/28/japan/politics/japan-lawmakers-group-ufos/) to create a nonpartisan group that will ask the government to establish an organization for investigating unidentified aerial phenomena.\n\nThe group will hold its founding general meeting on June 6 after Tuesday's preparatory meeting, which was held in parliament.\n\nWhile he confirmed that, to date, no sightings of UFOs had been officially confirmed – Japan's Chief Cabinet Secretary Yoshimasa Hayashi, [emphasised the need](https://mainichi.jp/english/articles/20240530/p2a/00m/0na/023000c) to remain vigilant for UFOs going forward:\n\n>*\"As the security environment around Japan becomes increasingly severe, we recognize the need to take all possible measures to respond to safety-related events, including those involving unidentified objects. We will work closely with other countries to steadily collect and analyze information and take all possible measures to respond.\"*\n\n**May 28 – Retired Admiral Tim Gallaudet appears on Shawn Ryan's podcast to discuss the UAP topic**\n\nIn [this episode](https://www.youtube.com/watch?v=2NVDCtSxIac&ab_channel=ShawnRyanShow) – Gallaudet discusses his background as a Navy Admiral and Oceanographer, and elaborates his views on Unidentified Anomalous Phenomena, with specific emphasis on submerged/ocean-based phenomena.\n\n**May 31 – Rep. Garcia submits multiple UAP-related amendments for inclusion in the 2025 NDAA**\n\nCongressman Robert Garcia [took to X](https://x.com/reprobertgarcia/status/1796551188441358705?s=46&t=hTnGNyI2OE9hap_EAY7HTA) to explain the three UAP-related amendments he submitted to be considered for the 2025 NDAA drafting process:\n\n>*\"My* first amendment *creates a UAP reporting mechanism for civilian pilots. My* second amendment *includes UAP disclosure provisions from last year \\[Schumer-Rounds UAPDA\\] that were blocked, including a UAP Records Review Board. My* final amendment *ensures AARO has access to covert intel for investigations.*\n\n**June 2 – A variety of well-known UAP activists announce/launch the UAP Disclosure Fund**\n\nAccording to [their website](https://www.uapdisclosurefund.org/):\n\n>*\"The UAP Disclosure Fund is a nonpartisan political nonprofit 501(c)(4) that advocates for greater government transparency regarding unidentified anomalous phenomena (UAP). We work to support new UAP legislation, provide legal representation for whistleblowers, promote scientific research and raise public awareness in an effort to better address the UAP issue.\"*\n\n––––\n\n# Things to look out for in the near future:\n\n**June**\n\n* [According to Senator Gillibrand](https://www.askapol.com/p/exclusive-sen-gillibrand-i-want-to#details) – a public hearing in line with AARO's latest report can be expected soon, saying –\"*I'll probably have another hearing aligned with that public report*.\n\n**August**\n\n* Lue Elizondo [has indicated](https://x.com/LueElizondo/status/1792918091875156402) his much-awaited book will be published in August 2024. Elizondo was the former director of the now defunct Advanced Aerospace Threat Identification Program (AATIP) – a program associated with the release of the Pentagon UFO videos.\n\n**Beyond/currently unknown**\n\n* Following [the UAP hearing on the 26th of July](https://www.disclosurediaries.com/house-oversight-committee-uap-hearing/), Members of Congress have [called for a select committee with subpoena authority](https://twitter.com/RepTimBurchett/status/1684956861898919936), to “*go about the task of collecting information from the Pentagon and elsewhere*” on unidentified flying objects. There have been conflicting messages from various Members of Congress on whether this is likely to happen anytime soon. Note – a select subcommittee was formally requested on March 13th.\n* Reps. Moskowitz, Luna, and Burchett have repeatedly stated their intent to hold field hearings to overcome stonewalling from the Pentagon and military establishment\"*I think we \\[Congress\\] should try to get into one of these places \\[housing UAP evidence\\]...and if they won't let us in I think we should have a field hearing right outside the building...and the military will have to explain why that is.\" –* [Rep. Moskowitz (D)](https://www.youtube.com/watch?v=9u-Qz1syV_A&t=388s&ab_channel=TheHillEvents)It is currently unknown when exactly we might expect that to occur, however as of Jan 12 – Rep. Luna [confirmed](https://twitter.com/realannapaulina/status/1745931131248153027):\"*I feel confident that we have enough evidence to move forward with our first field hearing.*    *. We will be announcing details soon.*\"\n* Several journalists have indicated that first-hand witnesses of the alleged UAP legacy programs are in the process of providing testimony/evidence to the relevant authorities (e.g. the IC IG) and/or are on the verge of making public statements in the near future ([Example 1](https://www.liberationtimes.com/home/multiple-sources-confirm-the-pentagons-ufo-office-has-coordinated-collection-and-analysis-of-material-from-unknown-origin), [example 2](https://www.youtube.com/watch?v=VUs-kcoe82A&t=6981s&ab_channel=AnythingGoesWithJamesEnglish), [example 3](https://www.youtube.com/watch?v=kUlsI9ggKr0&ab_channel=TheGoodTroubleShowwithMattFord), [example 4](https://public.substack.com/p/dozens-of-government-ufo-whistleblowers))\n* David Grusch has received additional clearances through [DOPSR](https://www.esd.whs.mil/DOPSR/) to discuss some of his (alleged) [first-hand knowledge of Legacy programs](https://www.reddit.com/r/UFOs/comments/18g7snn/david_grusch_has_first_hand_knowledge_of_a_uap/). He has mentioned he may be covering more of this information in an upcoming Op-Ed\n* Some commentators [have speculated](https://www.youtube.com/watch?v=4rLLVfpw-q4&ab_channel=NewsNation) that the architects of the UAPDA (e.g. Sens. Schumer/Rounds et al) are working diligently behind the scenes to continue furthering serious legislative UAP transparency efforts\n\n**Skimmed through this post but need a quick refresher on how we got to this point? Check out this handy** [Disclosure Timeline](https://www.disclosurediaries.com/timeline/) to get up to speed.",
        "num_comments": 1,
        "comments": [
            "__Reminder__: Read the rules and understand the subreddit topic(s) listed in the sidebar before posting or commenting. Any content removal or further moderator action is established by these rules as well as Reddit \nToS.\n\nThis subreddit is primarily for the discussion of extraterrestrial life, but since this topic is intertwined with UFOs/UAPs as well as other topics, some 'fudging' is permissible to allow for a variety of \nviewpoints, discussions, and debates. Open-minded skepticism is always welcome in this sub, but antagonistic or belligerent denial is not. Always remember that you're interacting with a real person when you respond \nto posts/comments and focus on discussing or debating the ideas. Personal attacks are a violation of Rule 1 and will lead to removals and potentially bans depending on severity.\n\nFor further discussion and interaction in a more permissible environment, we welcome you to our Discord: https://discord.gg/x7xyTDZAsW\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/aliens) if you have any questions or concerns.*"
        ]
    },
    "All the relevant UAP updates from June 10-16": {
        "title": "All the relevant UAP updates from June 10-16",
        "score": 31,
        "url": "https://www.reddit.com/r/aliens/comments/1di5fnt/all_the_relevant_uap_updates_from_june_1016/",
        "content": "# This past week in Disclosure:\n\n**June 12 – Several UAP-related amendments to the 2025 NDAA have been scrapped from consideration by House Republican leadership**\n\nSeveral UAP-related amendments brought forth by [Rep. Garcia in late May](https://www.disclosurediaries.com/disclosure-diaries-weekly-update-42/) have been blocked by House Republican leadership, according to a [public post from Rep. Garcia](https://x.com/RepRobertGarcia/status/1800719624851660924):\n\n>*\"My 3 UAP amendments to the National Defense Authorization Act have been blocked from being considered by House Republican leadership. We must continue to fight for transparency and take seriously national security concerns and the public interest. We will continue pushing.\"*\n\n  \n**June 13 – Senate sources indicate that many key UAP whistleblowers are still completely unknown to the public**\n\nAccording to the [Hill contributor Marik von Renninkampf](https://x.com/MvonRen/status/1801238222842073442), a Senate source confided the following:\n\n>*“Most \\[whistleblowers who informed UAP legislation\\] are completely unknown to the public.”*\n\n>*“Individuals known publicly had been advocating for years and wouldn’t have been enough to move the needle.”*\n\n>*“Lots of questions about motivations once public.”*\n\n  \n**June 13 – Donald Trump speaks on the UAP topic during an interview with Logan Paul**\n\nAppearing on a [recent episode of Impaulsive](https://www.youtube.com/watch?t=2471&si=G7yTxD4LYBrDbbi-&v=xrFdHO7FH8w&feature=youtu.be), Trump had the following to say on UAP:\n\n>\"*I’ve met with pilots like beautiful Tom Cruise, but taller, okay, handsome, perfect people. “Sir, there was something there that was round in form and going like four times faster than my super jet fighter plane.” And I look at these guys and they really mean it. And am I a believer? No, I probably, I can't say I am. But I have met with people that are serious people that say there's some really strange things that they see flying around out there\"*\n\n  \n**June 16 – Next UAP hearing likely to come after August recess, according to Reps. Luna and Burchett**\n\nSpeaking [with Askapol](https://www.askapol.com/p/next-uap-hearing-after-august), Reps. Luna and Burchett indicated that the next UAP hearing is likely to come after the August recess. This tracks with comments from Sen. Gillibrand, who recently said the following:\n\n>\"*I’m hoping July, and if not then September. But I’m trying to do July*.”\n\n# Things to look out for in the near future:\n\n**July**\n\n* [According to Senator Gillibrand](https://www.askapol.com/p/gillibrand-wants-july-uap-hearing) – a public hearing in line with AARO's latest report can be expected soon, saying –\"*I’m hoping July, and if not then September. But I’m trying to do July*.”\n\n**August**\n\n* Lue Elizondo [has indicated](https://x.com/LueElizondo/status/1792918091875156402) his much-awaited book will be published in August 2024. Elizondo was the former director of the now defunct Advanced Aerospace Threat Identification Program (AATIP) – a program associated with the release of the Pentagon UFO videos.\n\n**Beyond/currently unknown**\n\n* Following [the UAP hearing on the 26th of July](https://www.disclosurediaries.com/house-oversight-committee-uap-hearing/), Members of Congress have [called for a select committee with subpoena authority](https://twitter.com/RepTimBurchett/status/1684956861898919936), to “go about the task of collecting information from the Pentagon and elsewhere” on unidentified flying objects. There have been conflicting messages from various Members of Congress on whether this is likely to happen anytime soon. Note – a select subcommittee was formally requested on March 13th.\n* Reps. Moskowitz, Luna, and Burchett have repeatedly stated their intent to hold field hearings to overcome stonewalling from the Pentagon and military establishment \"I think we \\[Congress\\] should try to get into one of these places \\[housing UAP evidence\\]...and if they won't let us in I think we should have a field hearing right outside the building...and the military will have to explain why that is.\" – [Rep. Moskowitz (D)](https://www.youtube.com/watch?v=9u-Qz1syV_A&t=388s&ab_channel=TheHillEvents) It is currently unknown when exactly we might expect that to occur, however as of Jan 12 – Rep. Luna [confirmed](https://twitter.com/realannapaulina/status/1745931131248153027): \"I feel confident that we have enough evidence to move forward with our first field hearing. We will be announcing details soon.\"\n* Several journalists have indicated that first-hand witnesses of the alleged UAP legacy programs are in the process of providing testimony/evidence to the relevant authorities (e.g. the IC IG) and/or are on the verge of making public statements in the near future ([Example 1](https://www.liberationtimes.com/home/multiple-sources-confirm-the-pentagons-ufo-office-has-coordinated-collection-and-analysis-of-material-from-unknown-origin), [example 2](https://www.youtube.com/watch?t=6981&v=VUs-kcoe82A&feature=youtu.be), [example 3](https://www.youtube.com/watch?v=kUlsI9ggKr0&ab_channel=TheGoodTroubleShowwithMattFord), [example 4](https://public.substack.com/p/dozens-of-government-ufo-whistleblowers))\n* David Grusch has received additional clearances through [DOPSR](https://www.esd.whs.mil/DOPSR/) to discuss some of his (alleged) [first-hand knowledge of Legacy programs](https://www.reddit.com/r/UFOs/comments/18g7snn/david_grusch_has_first_hand_knowledge_of_a_uap/). He has mentioned he may be covering more of this information in an upcoming Op-Ed\n* Some commentators [have speculated](https://www.youtube.com/watch?v=4rLLVfpw-q4&ab_channel=NewsNation) that the architects of the UAPDA (e.g. Sens. Schumer/Rounds et al) are working diligently behind the scenes to continue furthering serious legislative UAP transparency efforts\n\n**Skimmed through this post but need a quick refresher on how we got to this point? Check out this handy** [Disclosure Timeline](https://www.disclosurediaries.com/timeline/) **to get up to speed.**",
        "num_comments": 2,
        "comments": [
            "__Reminder__: Read the rules and understand the subreddit topic(s) listed in the sidebar before posting or commenting. Any content removal or further moderator action is established by these rules as well as Reddit \nToS.\n\nThis subreddit is primarily for the discussion of extraterrestrial life, but since this topic is intertwined with UFOs/UAPs as well as other topics, some 'fudging' is permissible to allow for a variety of \nviewpoints, discussions, and debates. Open-minded skepticism is always welcome in this sub, but antagonistic or belligerent denial is not. Always remember that you're interacting with a real person when you respond \nto posts/comments and focus on discussing or debating the ideas. Personal attacks are a violation of Rule 1 and will lead to removals and potentially bans depending on severity.\n\nFor further discussion and interaction in a more permissible environment, we welcome you to our Discord: https://discord.gg/x7xyTDZAsW\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/aliens) if you have any questions or concerns.*",
            "Back at it again with another Monday Disclosure news update! Slightly delayed cause I'm sick as a dog...but nothing can keep me from keeping y'all up to date!\n\nIn case you're new to these posts, it's based on a[(free, forever) newsletter](https://www.disclosurediaries.com/disclosure-diaries-weekly-update-44/)I send out. Feel free to subscribe if you want these updates direct to your inbox every week. I also have a pretty useful[Disclosure Timeline](https://www.disclosurediaries.com/timeline/)that elaborates on how we got to where we are today in the discourse.\n\nI started putting these resources together for my own friends/fam who may not be as well versed in the space (yet), but need a verifiable repository of information to start getting their feet wet. Especially as this topic becomes more mainstream, I think it's going to be super important to get a broader audience up to speed as quickly as possible (*without overwhelming them with BS/personal theories*). That's why my site focusses on the 100% verifiable and credible side of things.\n\nI hope you find this update useful, and I really do my best to keep it to the relevant facts/updates only. As always, let me know in the comments/DM if I missed or misrepresented anything."
        ]
    },
    "Something I had never considered until recently.": {
        "title": "Something I had never considered until recently.",
        "score": 430,
        "url": "https://www.reddit.com/r/aliens/comments/1dqtl6v/something_i_had_never_considered_until_recently/",
        "content": "Assuming that aliens actually exist, and that they have been here for a very long time, how much of a mind-f\\*\\*k would it be if they had visual capture of historical events? Oh, here is a vid of the younger dryas impact. Oh, here is video of the life of Jesus. Here is a video from 65 million years ago of the impact that killed the dinosaurs. I wonder if I would believe it or not.",
        "num_comments": 167,
        "comments": [
            "Parents have years of records about their children's lives. It may be similar to this.",
            "We probably wouldnt believe what they were showing us because it would probably go against everything that we have been told or thought  we probably wrong in our assumptions",
            "Ive thought about this a lot actually. They could show us all our history. Solve some of our biggest mysteries. But could we trust them and their recordings? How would we know its like AI generated?\n\nEither way if I ever get abducted Im gonna ask em if they have this stuff. They may not be aware that wed love to see it.",
            "I have said for a long time that my wish/hope for when the veil comes down is that I can binge watch actual world history as a distraction while the effects of ontological shock shake up society.",
            "Alien YouTube must be crazy! I wonder what kind of ads they play?",
            "You ask for vids and they tell you time is an illusion. \n\nSonofa",
            "DINO vids please and thank you (good)Aliens!",
            "Well what do you think our dreams are for? Processing earlier memories, but also to receive these downloads :)",
            "Just like you saideven if they seen all those events play out as they actually happened people still wouldnt believe it. Which is hilarious because most of what we know or what weve been told about the past is speculation and theories but yet people believe it. Most people will have a hard time believing theyve been lied to their entire life.",
            "There Is something called the Yellow Book or the Yellow Bible which has all the knowledge the Greys have managed to acquire about the universe and such. I believe they have what you are looking for in there."
        ]
    },
    "Canadian couple spots mysterious 'sun-like' glowing UFOs VİDEO ": {
        "title": "Canadian couple spots mysterious 'sun-like' glowing UFOs VİDEO ",
        "score": 47,
        "url": "https://tagnewsde.com/world-news/canadian-couple-spots-mysterious-sun-like-glowing-ufos-video/",
        "content": "",
        "num_comments": 37,
        "comments": [
            "Fantastic. Now implement Global Disclosure, please and thank you",
            "can inquire as to how I can post a thread on this reddit? I am new to this site and my thread was automatically deleted",
            "as to this where was this picture taken?",
            "IF this footage is genuine, its amongst the best I've ever seen in 40 odd years. I genuinely don't know what could cause this .... it is a pity the witness did not turn off the engine, maybe something could have been heard. If no sound, then add that to the likelihood of anomalous cause. \n\nI suppose this could be some kind of flare, but it seems way too bright and they're not drifting down. Hope the full footage comes out. The fact that its a short clip is a problem.",
            "Military chute flares, you can even hear shooting in the background for a couple times, but for the totally blind and ignorant, it must UFOs, what else? :D",
            "Oh look the same video posted again...... SHOCKED!!!!!! Fucking flares people......",
            "That site doesnt work anyone have a link the the YouTube video?",
            "I saw these lights un uk about 2 nights ago",
            "Saw the EXACT same thing with my friend in Joshua tree last year",
            "These are the exact same type of ufo that Greer can summon"
        ]
    },
    "Did anybody ever see the NOVA episode called Kidnapped by UFOs?": {
        "title": "Did anybody ever see the NOVA episode called Kidnapped by UFOs?",
        "score": 64,
        "url": "https://i.redd.it/0n24cmjsrf9d1.jpeg",
        "content": "I've seen three different types. The small gray ones. They're about three to three and a half feet tall. They have like an upside down pear shaped head, with a pointy chin; large black eyes that wrap around the sides of the head; and very thin bodies,arms like Gumbies, they look like rubbery things. It's not joints kind of like we have. And just very, very thin.\n\n\ndrawing of alien by John VelezThen there's another group that are smaller, maybe two feet high, that wear these burlapy, very rough fabric robes; and have bluish or purplish skin—very dark skin.\n\n\n\nThen there's a taller version—of the gray variety that I described, with the big eyes—that are usually the ones that are involved in the medical procedures. Or if there's any communicating that needs to be done, they're usually the ones that do it.\n\n\n\n\nNOVA: What is the single most striking thing about their appearance?\n\nVELEZ: The eyes. Oh, the—(laughing) why, what's so striking about it? The eyes. They talk with their eyes. It's their eyes, when you look into their eyes, it's like you can get lost in them. They're very deep and they talk. Their eyes talk. They communicate with you through their eyes. They get very close when they talk. They usually get within inches, so that their faces are right here. And the eyes are all you see, and feel the vision. So I would say the eyes are the most striking.",
        "num_comments": 12,
        "comments": [
            "\"Don't kid yourself Timmy, if that Zeta Reticulian ever got a chance he'd probe you and everyone you care about!\" \"...Wait really?!\" \"Well just that one, he's like, Space Epstein.\"",
            "Yeah, its excellent. Ive always been hooked on PBS.",
            "That little one is almost exactly how I see my imaginary friend, very short, yoda like, baggy drapes/robes.",
            "Dr Mack is such an interesting guy. I always thought a good movie would be about Harvard attempting to rescind his tenure simply because he was investigating the abduction phenomenon. It could be interplayed with the people hes helped and his work. Plus, Im a big Lawerence of Arabia fan, and he wrote the definitive book on him.",
            "I would never let a mfer who cant bench at least 50 lbs kidnap me!",
            "I remember watching all these types of shows. I was hooked from the first time I saw sightings.",
            "Thank you! This is very good",
            "i agree and love this idea",
            "Bro look into my eyes... _",
            "![gif](giphy|ZNowzeHURP2cOtGpXJ|downsized)"
        ]
    }
}