{
    "Thinking Critically and Open-Mindedly about the Nazca Mummies": {
        "title": "Thinking Critically and Open-Mindedly about the Nazca Mummies",
        "score": 245,
        "url": "https://www.youtube.com/watch?v=FlNjET011Q8",
        "content": "",
        "num_comments": 42,
        "comments": [
            "**New? Check out our [Wiki](https://alien.wiki) and come say hello in our [Discord](https://discord.gg/UjtRzg6V3g).**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AlienBodies) if you have any questions or concerns.*",
            "This was a great talk. If you have not been following along this would be a pretty good place to start. When he talks about the greater implications of this discovery and the impact this has had on him it really resonated with me. This is a story that needs told and I’m so happy he was brave enough to put this out there.",
            "I was just coming here to see if this was posted after watching it. It is excellent and worth. Awatch for anyone, beginner or veteran.",
            "this needs to be passed along it was really good!",
            "For anybody stumbling on this weeks after it was posted: this is outstanding and you should watch both of his videos on the subject. While I disagree with a few things he says, his thinking is clear and organized, and the case he builds is both compelling and fun AF to watch. He's just a great presenter.\n\nWhat a tremendous benefit to the community, to have a philosopher thinking and speaking openly about the process of investigation and discovery.",
            "67k /r/AlienBodies subscribers\n\n4.7k YouTube views\n\nThat's not even 10%\n\nI suspect Google/YouTube is meddling with the view count \n\nPeople tend to pay more attention to things with higher view counts",
            "I don't usually pay much attention to stickies.\n\nBut oh my god, this talk was amazing. Absolutely worth the watch.",
            "Excellent video, thanks for sharing. \n\nLooking forward to the April 4th reveal from Peru.",
            "Give that man a raise",
            "Actually a really fun and convincing watch"
        ]
    },
    "Skinny Bob": {
        "title": "Skinny Bob",
        "score": 294,
        "url": "https://www.reddit.com/gallery/1dks8yu",
        "content": "",
        "num_comments": 166,
        "comments": [
            "**New? Watch this [video](https://www.youtube.com/watch?v=FlNjET011Q8), read our [FAQ](https://alien.wiki/Frequently_Asked_Questions) and drop by the [Discord](https://discord.gg/UjtRzg6V3g).**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AlienBodies) if you have any questions or concerns.*",
            "Not gonna lie. Skinny Bob looks pretty hip. Seems like a chill cat",
            "https://skinnybob.info\n\nhttps://www.reddit.com/r/SkinnyBob/",
            "Skinny Bob sold me fent behind Wendy’s",
            "Richard Doty (who most write off as a liar due to the Bennowitz situation) recently said this video was real. He also said he saw the video from the Varghina incident and said the entities made strange animal like sounds and were very distressed as our environment was toxic for them. Whether people believe him or not there is absolutely no doubt he had the security clearance and family background to have access to all of this information and more.",
            "Thinking about the post from u/apusloggy earlier, Skinny Bob looks most like the “hybrid” species.",
            "Weird Bumble profile but ok",
            "Skinny Bob really stepped out of the 4th dimension, walked up to the nearest earth thrift store, and said, \"Give me your best turtle neck blouse.\"",
            "Skinny Bob got a big ass dome piece",
            "The original skinny Bob video is slowed down a little bit, I believe you have to speed it up a tiny bit to see their real movements. I also heard somewhere that this is a female specimen, not a male. I have also read that given the date this was originally released they would have had to use some very impressive animatronics to get the details. Like when they scanned from bottom to top you can see individual fingers moving around very smoothly, if you play with the brightness you can see it has an eye that is a lot smaller than the larger Shadow you see. \n\nOne of the few videos of another species that has yet to be disproven, this could very well be a genuine video of an alien species right in front of our face.\n\nTo get more Comfort we would require some official source to back this video up of course. Or to Simply have more video leak of the exact same specimen"
        ]
    },
    "John McDowell investigation updates ": {
        "title": "John McDowell investigation updates ",
        "score": 19,
        "url": "https://www.reddit.com/r/AlienBodies/comments/1dl5rwg/john_mcdowell_investigation_updates/",
        "content": "I was just wondering if there have been any updates on john mcdowell Nazca mummy analysis? And where is the best place to receive them? ",
        "num_comments": 4,
        "comments": [
            "**New? Watch this [video](https://www.youtube.com/watch?v=FlNjET011Q8), read our [FAQ](https://alien.wiki/Frequently_Asked_Questions) and drop by the [Discord](https://discord.gg/UjtRzg6V3g).**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AlienBodies) if you have any questions or concerns.*",
            "His son posted several updates on his law firm's website: https://mcdowellfirm.com/category/nazca-mummies/\n\nI haven't seen any official quotes from John McDowell in a while.",
            "Thanks...I know Ross Coulhart tweeted he would be doing a sit-down interview with him soon...but no details.",
            "Ah, I didn't know that. I know Ross came to the States recently for a UAP conference, so it's possible he sat down with him during the trip. Time will tell..."
        ]
    },
    "Deep dive into three NHI species": {
        "title": "Deep dive into three NHI species",
        "score": 728,
        "url": "https://www.reddit.com/gallery/1dkhm22",
        "content": "\nI’ve put together a series of images that draw comparisons between events which I find intriguing. \nI am using footage of potential NHI, Nazca specimens images/scans and artistic reconstructions.\n\nI’ve looked into four videos which I haven’t sufficiently seen disproven.\n\nI am using three categories taken from the official Nazca website, which are ‘reptilian’, ‘insectoid’ and ‘hybrid’. \n\nTall Reptilian:\nThe being looks to be approximately 7 foot. It can be seen blinking and gasping. Has severe head injury. Mostly covered wearing loose black clothing.\n\nVideo here: https://www.youtube.com/watch?v=kxy-k7CZYKc&list=PL3ztC_6JCilju0lWbpJxrgbA-DndGrEE0&index=1\n\nSmall Reptilian:\nFilmed in Russia, the being appears approximately 3 foot. Leg and arm missing, dead.\nVideo here: https://youtu.be/zwWWjqA8kIk?si=wbeE1GOA6w5Nh4iD\n\nInsectoid:\nCaught in fishing net. Dead. It appears to have a metallic implant on one of its arms.\n\nVideo here: https://www.youtube.com/watch?v=p8-GQ4AWaf8\n\nHybrid:\nShows an interview type setting. Being seems to be struggling to breathe. It is then attended to by military medics. \n\nVideo here, unfortunately I can’t find the original: \nhttps://www.youtube.com/watch?v=TvamS6X5l2I\n\n\nFeel free to share! ",
        "num_comments": 143,
        "comments": [
            "**New? Watch this [video](https://www.youtube.com/watch?v=FlNjET011Q8), read our [FAQ](https://alien.wiki/Frequently_Asked_Questions) and drop by the [Discord](https://discord.gg/UjtRzg6V3g).**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AlienBodies) if you have any questions or concerns.*",
            "Credit for the effort, very realistic.",
            "The one from the alien interview is spot on. Incredible work!",
            "Wow I think you absolutely cracked it with that comparison of the hybrid and NHI from the interview. It's uncanny.\n\nSo we at least have a very good idea of what the \"reptile\"-like and hybrid beings look like now!",
            "Excellent work man. I love that you used the reed and “victor” footage to overlay. Tbh I think Victor, the Canadian “alien”, and the Mexican “alien” caught in a photo are Grays from outer space, but who knows anymore. Theres an obvious cover up, so…way too many high quality photos and videos at this point, not to mention physical bodies of the same type of entities",
            "This is fantastic! Great job OP! I never saw the comparison of the sea net NHI which was an eye opener.",
            "Love tying the peru buddies to the rest of the lore.",
            "Amazing!",
            "Yes! They showed the insect guy!",
            "Mate thanks so much for the effort you’ve gone through truely remarkable, I feel like it’s all unravelling now, looking forward to your posts in the future."
        ]
    },
    "Göbekli Tepe. Pillar 74: a humanoid-looking being that resembles a tridactyl reptile-humanoid specimen found in Nazca": {
        "title": "Göbekli Tepe. Pillar 74: a humanoid-looking being that resembles a tridactyl reptile-humanoid specimen found in Nazca",
        "score": 201,
        "url": "https://www.researchgate.net/figure/Goebekli-Tepe-Pillar-74-C-DAI-1-3-4-photos-N-Becker-2-photo-S-Matzerath_fig5_372604281",
        "content": "",
        "num_comments": 44,
        "comments": [
            "**New? Watch this [video](https://www.youtube.com/watch?v=FlNjET011Q8), read our [FAQ](https://alien.wiki/Frequently_Asked_Questions) and drop by the [Discord](https://discord.gg/UjtRzg6V3g).**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AlienBodies) if you have any questions or concerns.*",
            "At first I thought, eh that’s just a depiction of a human but then I saw the shoulders and weird chest and now I get what you’re seeing",
            "Amazing find!",
            "It’s so fucking disgusting that they won’t excavate more. Literally only 5% has been excavated. The WEF bought the site and then paved over much of the buried sites.  It’s obviously a cover up and everyone should know about it. It’s hard to wrap your head around how evil it is to suppress history and reality. Any excuse short of “NHI will destroy us if we release the truth to the masses” is a crime against humanity, not exaggerating.",
            "I think they found an old book a lot older than they want us to know about, and a lot more complete of a version. That’s why they won’t dig.",
            "I wonder why they don't live together now.. something must have happened",
            "Wow",
            "well holy fuck",
            "The shoulders are interesting. They make the connection for me.",
            "Gobleki Tepe is believed to be 11.500 years old. The nazca lines are made between 500 bc and 500 ac"
        ]
    }
}