{
    "In 2013, in Lake City, Florida, Ashlee Hammac supported her son Tucker through the loss of his baby brother. After the devastating death of her infant son Ryan, Ashlee Hammac decided to install a sandbox at Ryan's gravesite. She hoped to create happy memories for Tucker of his brother": {
        "title": "In 2013, in Lake City, Florida, Ashlee Hammac supported her son Tucker through the loss of his baby brother. After the devastating death of her infant son Ryan, Ashlee Hammac decided to install a sandbox at Ryan's gravesite. She hoped to create happy memories for Tucker of his brother",
        "score": 2740,
        "url": "https://i.redd.it/qm4i2wn2rb9d1.jpeg",
        "content": "",
        "num_comments": 120,
        "comments": [
            "Im gonna do this with my grave but hide some of my bones and stuff in there for fun",
            "30 years from now he's sitting at the bar telling the bartender how his mom used to go make him play with his dead brother at the cemetery.",
            "Like I get it, I do, it's a beautiful idea and everything. But how are cats not shitting in her dead sons grave playground?",
            "Interesting. I feel for the parents, losing a child would be crushing.\n\nIm a little worried about this would affect the psyche of the older boy. Trust mom to keep a good eye out",
            "Surprised the cemetery allowed this. They can be pretty picky. Hope it has a cover too lol",
            "Go outside & play with your brother!",
            "Damn, I just cant imagine losing a child in the first place, my emotions are all over the place",
            "Oof. Those dates on that tombstone",
            "Wow, the amount of therapy thats going to be needed by this kid one day.",
            "I didn't expect to wake up crying. Thanks."
        ]
    },
    "Man gets falsely accused by his ex-wife of molesting their kid. Meth-head vigilantes then amputate his limbs with a chainsaw before killing him.": {
        "title": "Man gets falsely accused by his ex-wife of molesting their kid. Meth-head vigilantes then amputate his limbs with a chainsaw before killing him.",
        "score": 4868,
        "url": "https://slatereport.com/news/the-terrifying-inside-story-of-how-an-innocent-dad-was-tortured-and-killed-by-a-group-of-chainsaw-wielding-paedophile-hunters-after-his-wife-falsely-accused-him-of-molesting-her-daughters/",
        "content": "",
        "num_comments": 523,
        "comments": [
            "7 years for murder? Is this normal in Australia",
            "What the hell is wrong with these sentences? Even if the other two fillped on the guy to get a \"Not Guilty\" The other guy got 7 years? These kids are going to have to live with this... They were made to celebrate their fathers' torture and murder. They flayed their names off his skin... And he is getting 7 years? That is a corrupt court. I just can't see any other explination other than, this is a slap on the wrist for getting caught. It's sick.",
            "And they became aware the dad didnt molest them how?\n\nFucking horrible.",
            "Australia has really good PR in general but man it has a very very grotty side to it, once you step a little away from normal civilisation.",
            "Man that article is an absolute fucking mess. Is it just me or does it make it sound like the guy who shot him only got 7 years? If you look up the story from an actual news source he got life and eligible for parole in 32 years.",
            "Why are we not mad at the ex wife? Shes the entire reason this went down",
            "What really fucks me up is that in most of the articles I find, Jana Hooper is only mentioned once or twice. She is the one who started this whole thing, she is to blame as the catalyst. I hope she lives in abject poverty for the rest of her life, she is a monster, just like the people who murdered her husband. Vile.",
            "I'm OK with the death penalty in this one. A human that can do that to another human isn't of any value and should be put down immediately.",
            "Is the wife in prison??",
            "Torture and murder: 7.5 years.  But two 16 year olds can send content of themselves to each other, be arrested for CP, do up to 25 years in prison (depending on the state), and be on the Sex Offender Registry for the rest of their life.  Something is off."
        ]
    },
    "Footage of passengers enjoying the view on Air New Zealand Flight 901, shortly before the plane would crash into Mount Erebus in Antarctica, claiming the lives of all 257 people on board.": {
        "title": "Footage of passengers enjoying the view on Air New Zealand Flight 901, shortly before the plane would crash into Mount Erebus in Antarctica, claiming the lives of all 257 people on board.",
        "score": 1579,
        "url": "https://v.redd.it/c2rgy1m0a49d1",
        "content": "",
        "num_comments": 81,
        "comments": [
            "Thats haunting. \n\nAs death crashes go I imagine this one was at least quick not a long free fall. Seems like they just smacked a mountain and likely all died instantly.",
            "I had read about there being film taken from that flight, but I have never seen it until now.  Definitely eerie.  Allegedly, there was also film found in wreckage of BOAC 911, which crashed near the base of Mt. Fujiyama, but its never been publicly released.  From the description of that accident, those passengers did not die as quickly or perhaps as painlessly as the Air NZ passengers.",
            "Human error along with poor visibility kills them all. Sad story.",
            "flying was such a party back then",
            "Were they in a Boeing or Erebus?",
            "Thankfully they were able to upload this video to the cloud before the crash.",
            "Um does anyone else see the UAP ?",
            "They died doing something they loved I guess",
            "What a sad tragedy pilot error caused this",
            "Fake news. Since the earth is flat we know a day round trip from NZ to Antarctica wouldve been impossible. These are crisis actors hired to explain an Illuminati massacre in the Catskills. \n\n/s"
        ]
    },
    "New Jersey Man Flew to Florida to Attack Video Game Rival with Hammer In 'Weird' Case: Sheriff": {
        "title": "New Jersey Man Flew to Florida to Attack Video Game Rival with Hammer In 'Weird' Case: Sheriff",
        "score": 1112,
        "url": "https://i.redd.it/yn2u4uhw339d1.jpeg",
        "content": "",
        "num_comments": 194,
        "comments": [
            "I must say that's a fine looking hammer.",
            "I've played video games for decades. Can't say I've ever a rival.",
            "I'm not saying it's justified but if you played Archage, you'd understand why he did it.",
            "What the hell is that shirt?",
            "A lot of people in FL are actually from New Jersey which helps explain some things.",
            "I feel like if that was the only item you checked in on your flight, someone working at that airport might have had some questions.",
            "Hes not going to be winning anything in prison I can tell you that.",
            "Reminds me of the case of the diaper astronaut that went to Florida with a hammer to kill someone.",
            "The name of the game would help this story so much. How mad are you lol",
            "Asians don't win all those video game contests because they aren't serious about gaming."
        ]
    },
    "The state of Kansas set to pay $1 million to settle a lawsuit over the death of a boy, 7, who was locked in a shower stall, tortured & fed to pigs": {
        "title": "The state of Kansas set to pay $1 million to settle a lawsuit over the death of a boy, 7, who was locked in a shower stall, tortured & fed to pigs",
        "score": 1176,
        "url": "https://slatereport.com/news/sick-abuse/",
        "content": "",
        "num_comments": 87,
        "comments": [
            "If I remember correctly, this is the state getting sued for neglect? There were a ton of warning signs and CPS never did anything to help",
            "Wish I could unread this",
            "The mug shots of these people looks disgusting. I hope they rot in jail. Scum",
            "WTF did I just read.\n\ni swear, how can people, family be this fn cruel to a kid.",
            "if that was my child, the minute that one of them was released from prison, they would meet their maker. and it would be extremely painful.",
            "How is this interesting?!?!? I definitely feel this is the wrong sub for all of these same tragic and horrific stories.",
            "Holy fuck this is beyond the pale fucked, throw the whole CPS procedure out because it couldn't catch this? Fuuucking hell the system is useless.",
            "And let that be check mate to anyone out there arguing for abolishing the death penalty. I think there should be a special circumstance for particularly heinous crimes caught red handed. Where we spin a wheel or some shit and every choice is an incredible drawn out painful death.",
            "Who is getting paid?? I have a lot of questions to say the least.. I hope there is some sort of cosmic punishment beyond our imagination for these two fucktwat cunts.. I cant even think of what to call them that is an accurate label for shitty creatures like these",
            "How could anyone do this to a child? Truly awful"
        ]
    }
}