{
    "All the Mods 10 (Which pack should you play)": {
        "title": "All the Mods 10 (Which pack should you play)",
        "score": 115,
        "url": "https://www.reddit.com/r/allthemods/comments/1dkc07e/all_the_mods_10_which_pack_should_you_play/",
        "content": "All the Mods 10 has been approved on Curseforge! **To find it easy search ATM10**. Right now, it's only 100+ mods but growing quickly. There is a lot missing, and more mods will be added over time. The pack is only for people who want to test out early 1.21 mods on Neoforge. \n\n&nbsp;\n\nATM9/NF is still in active development and will be getting updates about once a month. \n\nATM9 TTS is also in active development.\n\nGravitas 2 is also an option if you want to try something new.\n\n&nbsp;\n\n**TLDR:** If you want to play a long term pack with friends and have a good time play ATM9/NF/TTS/G2. If you want to help beta test and watch the pack grow from the beginning play ATM10 once it comes out.",
        "num_comments": 42,
        "comments": [
            "Thanks for clarifying and thanks for the work you do! You've given me so many hours of entertainment!",
            "Glad to hear atm9 is still getting work. Any thoughts on adding ice and fire to the pack? Lots of good mid-game quests and dragon steel has potential for atm star material if need be",
            "I think u should give more hints and tricks about silentgear mod in your modpacks.",
            "Super excited to test the new pack and see it grow ",
            "what's ATM9NF? Did they make a neofroge version of ATM9 or?",
            "The only mod I really enjoy that seems to be missing is Tinkers Construct, was there a reason for that like mod conflicts or just decided it wasnt necessary?",
            "Im just hoping mana and artifice makes the cut this time.",
            "Maybe add a better terrain mod like tectonic. Normal terrain generation is too boring compared to the cool building and unique block mods.",
            "Any plan on add Minecolonies to ATM9 TTS?",
            "We need more animals and pets to tame in ATM9!"
        ]
    },
    "This is a gamechanger for me ": {
        "title": "This is a gamechanger for me ",
        "score": 6,
        "url": "https://www.reddit.com/r/allthemods/comments/1dr6gnp/this_is_a_gamechanger_for_me/",
        "content": "8 channel ae2 interfaces feeding 32 phytos using melodic and shellite links. Aaaand bulk disks for storing!\n\nthats what i call Op :)\n\nhttps://preview.redd.it/cfmzb4x80h9d1.png?width=1920&format=png&auto=webp&s=e62d975fcd5a46fa6a7f82257b33468f49db800b\n\n",
        "num_comments": 1,
        "comments": [
            "I imagine you're using the interfaces for water, power, maybe fertilizer, and return products. Very nice. Truly AE2 is the best mod."
        ]
    },
    "16gb isn't enough for ATM9? ": {
        "title": "16gb isn't enough for ATM9? ",
        "score": 4,
        "url": "https://www.reddit.com/r/allthemods/comments/1dr7rep/16gb_isnt_enough_for_atm9/",
        "content": "Hey I have Ryzen 5 5500 , rtx 3060ti , 16gb of ram. The FPS drop very hard to 3-4 fps upon death or on random locations. Is there any solution or my ram isn't enough? (I gave Minecraft 12gb)",
        "num_comments": 17,
        "comments": [
            "It should be more than enough. I have 32 GB and i provide 12 GB for ATM. Everything more only causes problems.  I also heard that to much RAM can make serious issues with playing.\nMaybe your PC cant handle that it only has 4gb left?",
            "I have 16gb and I have 8gb allocated and it is running perfectly",
            "I hava a gtx 1660, 32 gb RAM (16GB aloc) Ryzen 7 5700x and runs at 140 FPS",
            "If you have a total of 16gb and you gaved minecraft MC, then your whole system is struggling with ram, reduce it to 8 so your system has 8 gigs left for other stuff running. Or get some more ram",
            "I have similar specs with you and yeah, 16GB doesn't seem enough for late game with loads of automation. Try allocating 11GB to the modpack, its probably the best you could do to allow enough ram for your system",
            "I run it on 8GB with same Java arguments that was recommended by the Vault Hunters team when I played that pack.",
            "Sometimes my 64gb ram isn't enough (maybe it's not just cuz of the game lol)",
            "Yeah maybe the 4gb is the cause of lag",
            "Other modpacks run smoothly on 8gb but atm9 even crash on 10gb. I will try get more ram or change modpack xD",
            "Yeah through curseforge , but after some comments I realized the total ram for the system after gave Minecraft 12gb isn't enough"
        ]
    },
    "Need help, i cant find a way to get axolotl for possessed warden ritual in ATM9-to the sky ": {
        "title": "Need help, i cant find a way to get axolotl for possessed warden ritual in ATM9-to the sky ",
        "score": 2,
        "url": "https://www.reddit.com/r/allthemods/comments/1dr9exs/need_help_i_cant_find_a_way_to_get_axolotl_for/",
        "content": "JEI isnt really telling me a way, and i need to beat it for a disc ",
        "num_comments": 1,
        "comments": [
            "A Cocoon of Caprice submerged in water can (rarely) spawn an axolotl. It's rare, though, so you may need a few dozen attempts.\n\nOnce you have one, you'll probably want to use some method of duplicating it (mob duplicator, spawner, ...) - the record isn't a guaranteed drop, so you'll probably need a few tries with the warden, too."
        ]
    },
    "Atm9 to the sky - For those of you with lots of nuggets of experience. Using a exporter with a stack upgrade into a create deployer. Then just stand under it.": {
        "title": "Atm9 to the sky - For those of you with lots of nuggets of experience. Using a exporter with a stack upgrade into a create deployer. Then just stand under it.",
        "score": 2,
        "url": "https://www.reddit.com/r/allthemods/comments/1dr93tr/atm9_to_the_sky_for_those_of_you_with_lots_of/",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}