{
    "Mark NSFW posts accordingly": {
        "title": "Mark NSFW posts accordingly",
        "score": 1210,
        "url": "https://www.reddit.com/r/AMA/comments/n2a9mv/mark_nsfw_posts_accordingly/",
        "content": "Hey everyone, hope you're having a swell day.\n\nJust a reminder to mark any posts that are nsfw (anything related to sex, gore, etc.) accordingly.\n\nNow, you may be thinking, \"Mr.Scary mod man, how do I apply such a strange thing to my *stayawaykids* posts?\".\n\nWell, let me tell you....\n\n**FOR PC - Click \"+NSFW\".**\n\n**FOR MOBILE - Click the 3 dots in the bottom left corner, followed by the \"NSFW\" button.**\n\nIf you have any questions feel free to ask in the comment section of this posts.\n\nThanks!",
        "num_comments": 230,
        "comments": [
            "Will do mr. internet person",
            "I just got questions about this subreddit asking if it contains any nudity,discussion of firearms, recreational drugs,etc. Why did it ask me all of those questions",
            "What's your favourite type of hot sandwich?",
            "I came here after a minor anxiety attack reading the black on red words \"Super Scary Mod\" and feel duly disappointed!",
            "How many languages can you translate this rule into?",
            ">Mr.Scary mod man\n\nDamn reddit has nice ppl",
            "What does AMA stand for so sorry",
            "Why is your name Mr cheap cheap",
            "Message the mods button wasn't working for me so I'll ask here. This is my sex work account. If I post an AMA that in part relates to me sex work, am I breaking any rules or anything like that via some sort of indirect advertising? Figured I'd double check before posting lol",
            "Hey Mr. Scary mod man 👋"
        ]
    },
    "I gambled with Dana White last night at Caesars. AMA.": {
        "title": "I gambled with Dana White last night at Caesars. AMA.",
        "score": 2404,
        "url": "https://www.reddit.com/r/AMA/comments/1dqopua/i_gambled_with_dana_white_last_night_at_caesars/",
        "content": "Was playing blackjack at my own table min hand was 1k. In comes big Dana no cash in hand just gives a nod to the pit boss and boom 30k in chips. ",
        "num_comments": 907,
        "comments": [
            "the only downside of gambling online on stake is that I can't see celebrities LMFAO odds are better though",
            "Did he F-bomb it up, and regularly refer to you as: “ya goof”???",
            "Was there any mention of UFC or fighters that a huge MMA fan such as myself, might find interesting?",
            "Did Dana think you were totally jacked and could be a ufc fighter?",
            "What do you do for a living? To afford 1k min hand",
            "He’s a degenerate gambler, absolutely addicted",
            "Did you make any money?",
            "Ha 30k in chips I see him multiple times a month dropping that per hand.",
            "I've learned from this thread that Dana is a guy.\n\nAccording to Google, \"Baby girl Danas outnumber baby boys with the name nearly ten to one.\"",
            "Was he cool? Or was he kind of nuts"
        ]
    },
    "I (46M) spent over 6 years in isolation in Texas prison. While some around me didn’t make it, I feel like I found myself in that cell. AMA.  ": {
        "title": "I (46M) spent over 6 years in isolation in Texas prison. While some around me didn’t make it, I feel like I found myself in that cell. AMA.  ",
        "score": 3071,
        "url": "https://www.reddit.com/r/AMA/comments/1dqki4p/i_46m_spent_over_6_years_in_isolation_in_texas/",
        "content": "",
        "num_comments": 980,
        "comments": [
            "What were your favorite things to think about to pass the time?",
            "When you say “I found myself” can you elaborate? I know many people turn to God, journaling, etc….what type of coping strategies did you use?",
            "Would you consider yourself rehabilitated?",
            "Please share you experience, also what charge were made against you?",
            "By “didn’t make it” do you mean they were screwed mentally or that they died there?",
            "What was your favorite meal you had? And what was your least favorite?",
            "Why did you commit the armed robberies in the first place—for the money, reputation?\n\nHow were your relationships with family and friends before being arrested and after your release?",
            "Solitary confinement is considered torture by many international groups. Having experienced it yourself, do you believe it should be considered torture?",
            "How many hours a day were you in there?",
            "Being alone for that long, did you start having conversations with yourself and/or imaginary people? If you did,were you aware of it and did you ever question your sanity?"
        ]
    },
    "50F and been single all my life except for 6 months. AMA": {
        "title": "50F and been single all my life except for 6 months. AMA",
        "score": 25,
        "url": "https://www.reddit.com/r/AMA/comments/1dr7k94/50f_and_been_single_all_my_life_except_for_6/",
        "content": "In the UK. Never even been on a date. Ask away. ",
        "num_comments": 104,
        "comments": [
            "Tell from your experience, is it hard to spend life alone till 50 and what happened in that 6months where you were not single. How do you spend yourtime after job and are you still willing to be in a relationship?",
            "Have you ever had sex? If so how many times and how long has it been since",
            "You may have avoided a lot of drama in your life by being single.",
            "Do you feel like dating now?",
            "We have alot in common",
            "What do you do for a living?\n\nHow many doodies do you make per day?",
            "What’s your living situation? Alone? Roommates? Pets?",
            "Have you ever had sex?",
            "I’m 51 last relationship was 4 years ago. I’m fine on my own. Size 14. I rent. We’re a lot alike.",
            "Is your body count 1 then?"
        ]
    },
    "I (30M) made it out of poverty into the middle class. AMA": {
        "title": "I (30M) made it out of poverty into the middle class. AMA",
        "score": 15,
        "url": "https://www.reddit.com/r/AMA/comments/1dr7esy/i_30m_made_it_out_of_poverty_into_the_middle/",
        "content": "5 years ago I was sleeping in a 98 Honda accord in planet fitness parking lot while working full time. Today I live alone in a 2000 sq foot apartment with a home gym, office and indoor garden. Did it all on my own without a degree. AMA",
        "num_comments": 16,
        "comments": [
            "Can you give some tip what steps did you take and what will be your note to strugglers for settling a good life",
            "Impressive man. Really impressive. What do you do for a living?",
            "I also worked really hard to improve how I sold myself in person and on my resume. For a while I struggled to get hired, I switched up how I spoke on my resume and everything changed. I also lied on my resume when I could back it up on the job. And NEVER BE LOYAL TO A JOB!!!!!! People will stay in poverty because they like who they work with or don’t want to do the footwork of getting a higher paying job. If you are good at selling yourself and have a good SOUNDING (keyword is sounding) resume then you should always be looking for higher paying employers.",
            "100% this is why I made this. Most important thing: keep your head up. If you have a good work ethic then you should be proud of that and excited for the future. If not, that is the first thing you should work on. Focus on your motivation and the good qualities that could pull you out of this and not the struggle. NEVER focus on what others (ie: parents, other relatives, life long friends) could do for you and haven’t. When I would focus on the struggle or what others are failing to do for me I would let myself be bummed out, that’s when I would stop trying. The last time I was homeless I tried something different, I put my stuff into a storage unit, kept working out, kept myself clean, kept doing acts of self care and kept talking to women. I would look at the things I enjoyed about my lifestyle rather than what I hated. This mindset is what allowed me to be open to opportunity and growth. The other thing is that I always looked for opportunity and growth, could recognize opportunity and would always jump on it. This is vital. I never told myself “oh it’s too long of a commute” “it’s too hard of work” or anything that would lead me to believing I can’t. If it was a good opportunity or would teach me something that would land me a better opportunity I never said no. When someone would tell me I couldn’t I wouldn’t believe them, and when someone said I could I would believe them. I had to work for this perspective. I was in a rut for a long time and kept myself there before I realized I could get out. \n\nTLDR: “Whether you believe you can or you can’t, you are right”",
            "I said middle class bud",
            "Heavy Equipment Operator. At the time 5 years ago I was a general construction laborer.",
            "How much you get for it per hour?",
            "If you gave me a short cut to my position I would have jumped on it but that’s not how life works for 99% of people. And man if I never wanted to get out of my comfort zone I never would have made it here. I commuted an hour and 45 mins 1 way for almost 2 years for $17 an hour because I was able to get on the machines and build my skills as an operator. I told everyone I was paid $17 an hour to go to college 2 hours away, rather than looking at it like I made $17 an hour with a hour 45 min commute. If I said no to working on that job I probably never would have got the experience I needed to make it to where I’m at today.",
            "That's impressive man. You married?",
            "Im too picky. If a woman is irrational, not self aware or snappy at me I just let them go so I let a lot of women go, unfortunately. I work out, work on my mental health, have a career. I don’t feel like I need to settle with someone who is going to frustrate tf out of me"
        ]
    }
}