{
    "Amazon DSP Discord": {
        "title": "Amazon DSP Discord",
        "score": 29,
        "url": "https://www.reddit.com/r/AmazonDSPDrivers/comments/e8mgvn/amazon_dsp_discord/",
        "content": "This is a place made for people who want to talk about their day, vent, and maybe even meet up with people in your own area. Just a place to talk to other DSP drivers like yourself. It is a slowly growing server and has voice chats as well as many other chats.\n\nYou have the ability to chose your own role and this subreddit is connected to the discord so you will never miss out on new posts on your favorite subreddit!!\n\nhttps://discord.gg/BUu6Rqw",
        "num_comments": 20,
        "comments": [
            "Was going to join. Then i saw the furry.",
            "I've been really enjoying this discord. Very helpful info, good chats and nice folks.",
            "As somebody whose not up to date on all the social media’s, what’s discord and how is it different from reddit?",
            "Invite link is broken.",
            "[removed]",
            "Wow, banned for, uh, not sure why.",
            "[deleted]",
            "It is my own personal preference and it is not implemented into the discord at all. This discord is strictly for Amazon drivers to talk to eachother, not anything about their preference like being a furry.",
            "Also, congrats on quitting, just read that you quit your job with Amazon. Hope you found something you enjoy!",
            "What’s the furry"
        ]
    },
    "Just remember, all your hard work is paying off.": {
        "title": "Just remember, all your hard work is paying off.",
        "score": 301,
        "url": "https://i.redd.it/vx1oij38cc9d1.jpeg",
        "content": "",
        "num_comments": 97,
        "comments": [
            "Thank You for your submission to r/AmazonDSPDrivers!\n\nPlease keep the comment section clean and respectful.\n\n**If you need to report a concern about your DSP, head to the Ethics Hotline** https://secure.ethicspoint.com/domain/media/en/gui/65221/index.html\n\n**Looking to get some free shoes on behalf of Amazon?** https://www.reddit.com/r/AmazonDSPDrivers/comments/m79v7m/free_125_credit_for_shoes/\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmazonDSPDrivers) if you have any questions or concerns.*",
            "When you’re that rich you can have any woman. He picked one made of plastic.",
            "Don't finish early boys get those hours.",
            "when we eat the rich, i call jeff’s empty skull as a chalice",
            "Guy has awful taste.",
            "Feels great that my hard work allows Bezos to enjoy his extravagant trips. Guess I’ll keep pushing so he can keep relaxing. 💪💪💪",
            "Real question though, how far will the Amazon driver go to deliver packages for Jeff to his yacht? 🛥️",
            "She is hideous. And he is a pure pile of human scum",
            "Enjoy your rocks peasants",
            "Look I understand that people want to get after Jeff but the problem is not bezos. It's a giant middle management bureaucracy that only works to increase stock price. At the end of the day y'all are just data points in a spreadsheet. That's why nothing will change. Flex will never improve. The routes will never get better. They will find more ways to deny bonuses/guaranteed 40 hrs, etc.\n\nAmazon is happy to eat the enormous driver attrition rate and to pass along the cost to customers. That's because they know a large portion of their customers are habitual buyers. They're shopping addicts and they will all pay an extra dollar or so for the delivery. Amazon is evil, but not more evil than any other company it's size."
        ]
    },
    "How we doing today?": {
        "title": "How we doing today?",
        "score": 165,
        "url": "https://i.redd.it/92kcxt1pad9d1.jpeg",
        "content": "",
        "num_comments": 112,
        "comments": [
            "Thank You for your submission to r/AmazonDSPDrivers!\n\nPlease keep the comment section clean and respectful.\n\n**If you need to report a concern about your DSP, head to the Ethics Hotline** https://secure.ethicspoint.com/domain/media/en/gui/65221/index.html\n\n**Looking to get some free shoes on behalf of Amazon?** https://www.reddit.com/r/AmazonDSPDrivers/comments/m79v7m/free_125_credit_for_shoes/\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmazonDSPDrivers) if you have any questions or concerns.*",
            "Fuck that amount of cat litter…my back aches in sympathy",
            "I think the customer that's ordering all this stuff is actually ten cats in a trenchcoat.",
            "What I’ve would’ve done is to not stack the kittie litters like that. Put every single one on the ground so the customer have to bend down and scrape their fingers trying to lift it off the ground. I’m petty like that",
            "I would’ve stacked them up the door like I did\n\nhttps://preview.redd.it/7y9bn0twod9d1.jpeg?width=3024&format=pjpg&auto=webp&s=21a620befc7972c851fd014617fba5c724a279ff",
            "https://preview.redd.it/o8ctsabcke9d1.jpeg?width=3024&format=pjpg&auto=webp&s=9b2324bceff1d35e7d0ae695a0b1ffe3618a1172\n\nIt was supposed to go to the front door but the gate was closed so this looks like a good spot lol",
            "Why the fuck they need so much litter",
            "I bet you could smell the cats before you even pulled up if they needed that much litter",
            "[deleted]",
            "I thought those were trash bags at first and didn’t think it was too bad but damn thats a mini workout right there lol"
        ]
    },
    "Maybe a inside job?🕵️‍♂️": {
        "title": "Maybe a inside job?🕵️‍♂️",
        "score": 52,
        "url": "https://v.redd.it/2a2aitt5we9d1",
        "content": "FedEx and fake amazon employee working together? ",
        "num_comments": 37,
        "comments": [
            "Thank You for your submission to r/AmazonDSPDrivers!\n\nPlease keep the comment section clean and respectful.\n\n**If you need to report a concern about your DSP, head to the Ethics Hotline** https://secure.ethicspoint.com/domain/media/en/gui/65221/index.html\n\n**Looking to get some free shoes on behalf of Amazon?** https://www.reddit.com/r/AmazonDSPDrivers/comments/m79v7m/free_125_credit_for_shoes/\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmazonDSPDrivers) if you have any questions or concerns.*",
            "Is it not possible dude was following the FedEx truck around?",
            "They should’ve send the niece out there as soon  as they delivered 🤦‍♀️",
            "For sure they planned that, probably not a fake employee rather than someone who does/use to do flex and had a vest laying around.",
            "Definitely set up",
            "That's crazy",
            "It’s probably fake either way",
            "But fedex and ups do",
            "So there was somebody home and it took her that long to go outside?",
            "I think the entire video is a setup for internet clout.\n\nWhite car driver is probably friends of the original OP"
        ]
    },
    "Man y’all gotta chill 🤣": {
        "title": "Man y’all gotta chill 🤣",
        "score": 88,
        "url": "https://www.reddit.com/gallery/1dqu4ji",
        "content": "A chase involving an Amazon delivery truck ended in Gaston County on Thursday afternoon, officials confirmed.\n\nLATEST: https://www.wbtv.com/2024/06/27/officials-chase-involving-amazon-delivery-truck-ends-gaston-county/",
        "num_comments": 24,
        "comments": [
            "Thank You for your submission to r/AmazonDSPDrivers!\n\nPlease keep the comment section clean and respectful.\n\n**If you need to report a concern about your DSP, head to the Ethics Hotline** https://secure.ethicspoint.com/domain/media/en/gui/65221/index.html\n\n**Looking to get some free shoes on behalf of Amazon?** https://www.reddit.com/r/AmazonDSPDrivers/comments/m79v7m/free_125_credit_for_shoes/\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmazonDSPDrivers) if you have any questions or concerns.*",
            "Something makes me think the ETA was not right then.",
            "Finally, some action this subreddit was getting boring 😆",
            "watch this is the reason why we gotta start turning the vans off again",
            "Bro prob went over 40 in that thing and caught some major death wobble and swerved into the trees😂",
            "This is why they’re going to start monitoring doors being closed and locked. Way to go asshats",
            "Now Amazon is going to bring back EOC in this hot ass weather because of this. God forbid a driver gets killed and Amazon changes the rules that any death results in a tier 1 infraction which will result in an automatic termination.",
            "lol Amazon and swift must have the same type of drivers",
            "I wonder if the DSP will win the appeals to the netrodyne hits?",
            "Yoo how ?🤣"
        ]
    }
}