{
    "*** Delayed Shipping Megathread - Rants, Questions, Etc **": {
        "title": "*** Delayed Shipping Megathread - Rants, Questions, Etc **",
        "score": 416,
        "url": "https://www.reddit.com/r/amazonprime/comments/n1w9u2/delayed_shipping_megathread_rants_questions_etc/",
        "content": "",
        "num_comments": 1545,
        "comments": [
            "With two-day shipping taking two weeks, I’m seriously wondering why I’m still paying for Amazon Prime.",
            "What the actual fuck is going on?  I thought maybe it was just a fluke, but I'm noticing all kinds showing as 4-5 day shipping.  For example, right now, I was looking at something, and it won't arrive until Thursday.  Wasn't 2-day shipping part of the deal when we signed up for Prime?  Also, Amazon just raked in billions during this \"pandemic\", while other businesses failed, and this is the shit we get??",
            "Prime orders from the middle of last week that say on the order page:  Due to Arrive Today:  4\n\n&#x200B;\n\nOrders that have actually shipped: 0\n\n&#x200B;\n\nSupport representatives giving me the runaround, blaming me for not understanding what 'Prime' means, saying that the estimate isn't a guarantee (what did you base 'Today' on when you estimated if you hadn't shipped?)  and otherwise making excuses for being unreliable?  More than I can count.",
            "Can we talk about the round Robin of chat support reps coming in and out of your chat window?",
            "Something clearly has changed in the past month or so. 2 of the 6 items I've ordered in the past few weeks have literally arrived late even after shipping out and every order I place sits in limbo for 4-5 days before it even ships out.\n\nThis is how you lose your number one spot. Someone else will come along and claim the throne if this is how its gonna be from now on.",
            "Something has certainly changed the past 3-4 weeks. I have been using Amazon prime for oh geez, I dunno, like 10 years? It was usually pretty awesome, up until about a month ago. I started noticing that literally NO items were available with 2 day shipping. Most items took 3-7 days to arrive from the day I would order them.\n\nActually looking back even further, they pretty much silently removed 1 day shipping back when covid was getting bad. But this new issue has nothing to do with Covid, there's no way.\n\nI don't need some Amazon shill or CS rep telling me \"Oh, well, the shipping still only takes 2 days! It's just the fulfillment that might not be, which isn't technically part of Prime!\". I don't give a fuck. It was 2 day shipping AND fulfillment (unless it was a sunday) for YEARS up until a month ago.\n\nFucking Amazon. Cancelling my prime right now. They already banned my original Amazon prime account of 9 years because it got hacked and the CS rep wanted screenshots of all my bank info to get my account back. Yeah, no. I don't need to give a CS rep all my banking information because MY ACCOUNT WAS HACKED.",
            "I came here to see if I was the only one who has seen their delivery dates extended in the past few weeks suddenly. Looks like I’m not alone. \n\nI do want to mention that I saw a comment posted on a thread on the Pittsburg subreddit regarding Prime delivery delays about 9-10 days ago. The post is supposedly from an Amazon delivery driver. They mentioned Amazon implemented a nationwide change recently in how they deliver. I guess prior they had two rounds of deliveries daily (one during regular 7-5 hours and one later round). Apparently Amazon wanted just one round of deliveries daily, so they put everybody on something like an 11 am-9 pm work schedule and as a result, tons of drivers have quit. This individual seems to think this is why we are suddenly seeing these delays.",
            "I will be not renewing my prime. It’s taking way too long to get my orders to justify the price. Back when it was true 2 day shipping I loved having it . Plus last time I had an issue with an order I was not treated very well. I will use other sources to order stuff or Amazon free $35 shipping when I have to.",
            "I joined this sub just for this thread. I am nailed to the wall here because I dont have the option for brick and mortar shopping for everything anymore. I am taking care of elderly immunocompromised family members who have not gotten the shot. So all their shopping or things they want/need I need to go out and get. So I dont want to go out and hit many stores, for fear of bringing something to them. The only store I actively go to is a grocery store. Anything else, i order from Amazon, and paying for prime as well. \nWhile I do use the other prime benefits as well, the main reason for me buying prime was the two day shipping.  Prior to this duplicitous act, with Amazon's third party delivery people, the delivery update said to expect things to arrive between say 12-2, then 2-4, then 6-1015, then we are sorry things are running late, then would appear at night or around 2 thr next day. And now, I would be lucky to see my orders in 5 days if not a week. And I live less than 10 miles from both an international airport and an Amazon distribution hub. And even after complaints to amazon I still have no answers.",
            "This is an example of what is happening. Same item .. two different zip codes in same city.\nThis is all items in the site.  One  zip will be delivered tomorrow, the other would be delivered next Thursday. Same post office, ups and fedex distribution center for both zips. \n\n\n[estimates](https://imgur.com/a/HKcEN6i)"
        ]
    },
    "I had ordered an RF 24-105 f/4 brand new lens from Amazon and received a fake paperweight lens. I checked the seller, and it was by Amazon, not a 3rd party. Didn't expect sketchy stuff from Amazon. Anyone face a similar issue in the past?": {
        "title": "I had ordered an RF 24-105 f/4 brand new lens from Amazon and received a fake paperweight lens. I checked the seller, and it was by Amazon, not a 3rd party. Didn't expect sketchy stuff from Amazon. Anyone face a similar issue in the past?",
        "score": 7,
        "url": "https://www.reddit.com/gallery/1dlnbcq",
        "content": "",
        "num_comments": 15,
        "comments": [
            "That LPN sticker means it’s a return. Someone kept the actual lense and returned that and it got past the returns department",
            "I abandoned Amazon for any expensive item, now I pick up at Best Buy or order from B&H.",
            "Please keep us updated on how the return process goes. They seem to have a pattern lately of defrauding customers whenever you have to make  expensive returns like this. I hope it goes well for you. Make sure reps EMAIL everything they promise to you, they tend to say one thing to get you off the chat and never deliver.",
            "I bought a brand new 3D printer from Amazon. What showed up was a taped up box and a 3D printer missing parts with the print bed scratched to hell. Luckily, their customer service hadn’t gone to shit yet and I didn’t have problems getting a refund. I’m willing to bet you return this and they’ll try to blame you for returning something different. You’ll have to let us know how your refund goes. Good luck",
            "Ordered a switch special edition game recently. Looked brand new in package but there was no game! 🤷‍♂️ Someone must have outsmarted them and opened the package and returned it resealed. 🤷‍♂️",
            "If the LPN Label is present it means it is a return, what's more, that label is traceable, it cannot be appealed and no one from Customer Service can even question it, since if it says LPN it is SECOND HAND, and if you have bought that product NEW, and they have sent you that, it is a crime of fraud, which is what these Amazon criminals and scammers do constantly, now you will obviously want to return something that is a scam and here the real scam actually begins, They will tell you that something else arrived, that it arrived used, that it is different and they will have you waiting for your money, first of all for a month, then that it didn't arrive and that you have to wait 2 months, until the deadlines run out, which I don't know It's like hell, the Prosecutor's Office hasn't arrested these shits once and for all, because these people from Amazon are a bunch of criminals and they have to be locked up, bunch of miserable people.",
            "Ohhh! Thanks for the insight, I was wondering what those stickers were, why would they be shipping this lens when I bought a \"new\"? It's crazy.\n\nI hope the return goes smoothly for me.",
            "\"The returns department\" lol. You mean the guys that take all the returns and put them back into \"new\" inventory without so much as a glance? Amazon is breaking the Truth in Advertising Act on an unimaginable scale right now. Anything returned by an end consumer, even if it looks like it's brand new, must be clearly labeled as such, i.e. \"refurbished\" \"b-stock\" \"open box\" etc. Amazon commits fraud every time it restocks a returned item as new, but I guess they're too big to prosecute.",
            "I ordered from Amazon, because I couldn't get the item faster using BestBuy or B&H, and have a trip that I am leaving on.\n\nI probably won't make a similar mistake again.",
            "If you look closely both the LPN labels are different on the front, and then there is a 3rd LPN sticker on the top of the box. All 3 LPN labels have different code.\n\nI can't tell but it seems like the top sticker has maybe 2 more stickers under it.\n\n[https://imgur.com/a/qXWi23p](https://imgur.com/a/qXWi23p)"
        ]
    },
    "Temu products selling on amazon with huge markup": {
        "title": "Temu products selling on amazon with huge markup",
        "score": 3,
        "url": "https://www.reddit.com/r/amazonprime/comments/1dlm5uy/temu_products_selling_on_amazon_with_huge_markup/",
        "content": "I have been a prime member for over a decade now and with membership price going up every few years and on top seeing those multiple ads in prime videos, I decided to cancel my membership and started looking for other online shopping portals and found  temu. I could find almost all the common products that I shop on amazon on temu for way cheaper price.\n\nFew weeks back I got a product from amazon and wanted another of the same, so looked up on temu and ordered it for 1/3rd the price and to my surprise got the product in the same exact box matching the quality and every aspect of it. Looks like they are just selling these products with higher price on amazon.\n\nDo you guys feel the membership is still worth? And appreciate if you could share your experience with temu. \n",
        "num_comments": 3,
        "comments": [
            "Temu is just AliExpress with a marketing arm.  You can still buy on Amazon without Prime, so pick your poison.",
            "Some of the products on amazon are not up to the mark, which goes same for temu products. Since I noticed the same product seeling on amazon, paying 3 times more for that product doesn't make sense to me. So wanted to hear out other people experience with temu",
            "I wouldn't touch Temu, just like I wouldn't touch AliExpress. Not everything is chinese garbage on Amazon, but ***everything*** on Temu and Ali is chinese garbage. Besides, even without prime, Amazon still ships pretty fast, and returns are a snap. Not so with the Chinese sites.\n\nHow long *does* it take to get an order from Temu? I know to the states it's 10-21 days for AliExpress. If I want cheap chinese crap that may be OK, but otherwise a trip to Target is in my cards.  I know, plenty of chinese crap there too, but I can see it and feel it before I decide if something is worth buying.\n\nIf you're looking for some sort of vindication for switching to Temu over Amazon, there may be a subreddit for Temu where you'd have better luck.\n\nAs I said, pick your poison... the Chinese sites ain't mine."
        ]
    },
    "Amazon Prime Store Card and 12 Month Plan Financing on Large Purchases ": {
        "title": "Amazon Prime Store Card and 12 Month Plan Financing on Large Purchases ",
        "score": 2,
        "url": "https://www.reddit.com/r/amazonprime/comments/1dlo8b3/amazon_prime_store_card_and_12_month_plan/",
        "content": "I recently noticed that Amazon offers their 12 Months Financing with 0 interest on items that cost way above my credit limit on the Amazon Prime card. So the question is how do they consider me as \"eligible\" for that option, when according to my card limit I am not. And what will happen if I try to use that option and charge that on my Amazon card?",
        "num_comments": 0,
        "comments": []
    },
    "OFM Inexplicably Threatening Me": {
        "title": "OFM Inexplicably Threatening Me",
        "score": 0,
        "url": "https://i.redd.it/w0i1o8n1038d1.jpeg",
        "content": "I've been an Amazon customer since 2011 (and used a family member's account before that). I have had Prime for over a decade, have made thousands upon thousands of purchases, have a Prime Visa card, primarily get my groceries from Whole Foods, use Amazon wish lists for gifting, have had Alexa/Echo devices in my house since Gen 1, use Amazon when I want to rent a movie, and more. It would take a long time to calculate my return percentage, but it is certainly way below 5%—and has almost always been the result of an item arriving damaged/broken, usually as a result of improper packaging. Aside from that majority, I've had some nonfitting clothing returns, a couple items that never arrived, and very few cases where I made a mistake (trying to cancel too late; placing a duplicate order). My returns have always been pleasant and properly executed—and, again, quite infrequent.\n\nBy all measurements, my account is an excellent one for Amazon. So why am I suddenly being slandered and threatened? I don't understand how scared I should be, what I should do, how they could so recklessly and grossly get this so absurdly wrong, etc. \n\nThe best guess I have is that someone on their team irresponsibly attacked me on behalf of a recent third-party seller that sent me a broken item and has been trying to charge me illicitly for the return. I went to customer support for help with that (after many hours of waiting...) and got this wild threat of an email not to long afterward. \n\nAny help, guidance, etc. is appreciated! Screenshot attached. \n\nThanks. ",
        "num_comments": 8,
        "comments": [
            "This is not about returns, it is about the refunds you are receiving.\n\nThey are not threatening anything, they have the right to close your account. Read the terms that you agreed to.",
            "you received the email because of an algorithm, not from a real person.   Could be because of too many recent returns or higher dollar returns than normal over the past few months, not the whole time you have been a member.    It tells you what to do if you think it was in error.     Just don't return anything for a while and things will be back to normal.",
            "It's the same, no matter what the client says, they don't verify anything, they don't care, and they don't care if the client has been there for years, for them and the shit of Amazon, you can't have any impact, they are trash and criminals",
            "They do care and that is why it is one of the most successful companies in the world that keep going strong. If they didnt care they would have collapsed over time.\n\nThey dont care about scammers and abusers like you. Messaging, deleting and blocking like a coward🤣",
            "Amazon cares! OMG.",
            "Well if they dont care, then why use it and continue to complain? Only an idiot will do that."
        ]
    }
}