{
    "June Mega Thread: AA Points, Loyalty Points, Award Travel, Credit Card Bonuses or Benefits, Hotels, and Shopping Portal": {
        "title": "June Mega Thread: AA Points, Loyalty Points, Award Travel, Credit Card Bonuses or Benefits, Hotels, and Shopping Portal",
        "score": 5,
        "url": "https://www.reddit.com/r/americanairlines/comments/1d80bi7/june_mega_thread_aa_points_loyalty_points_award/",
        "content": "A megathread to consolidate quick questions about points, awards, credit cards, and the shopping portal. A couple of quick notes:\n\nAll shopping portal posts/comments should be contained here. Posts outside of this thread will most likely be removed unless they rise to the level of significant program news/updates. This will be a high bar to clear.\n\nPosts/comments about general award programs, benefits, etc. should go here, but there is a lower bar as to what qualifies for it's own post and will evolve as this thread evolves.\n\nSubreddit rules regarding etiquette and respect will still be enforced, but it pretty much boils down to don't dunk on people who know less than you, even if you think they deserve it.\n\nReferral codes are explicitly not allowed. This includes solicitations for direct message or similar comments.\n\nSince this is the first thread, we will see how this goes before we commit to a specific refresh cadence (weekly, monthly, quarterly, etc)\n\nAs always, the best way to provide feedback is via the modmail functionality.\n\nApril 2024: https://www.reddit.com/r/americanairlines/comments/1bz0uci/aa_points_awards_credit_cards_and_shopping_portal/\n\nMay 2024:\nhttps://www.reddit.com/r/americanairlines/comments/1cip922/may_mega_thread_aa_points_loyalty_points_award/",
        "num_comments": 72,
        "comments": [
            "Inflight CC offer is up to 70k miles for June",
            "I keep getting an error message every time i try to book a hotel with miles. does this happen to anyone else?",
            "Getting offered 100k miles as a sign up bonus for Aadvantage Executive World Elite Mastercard.  Guessing it is targeted.  Wish it was a better card overall. Even with the points I'm on the fence.",
            "is this the appropriate thread to discuss best current LP offers... Im curious which offers most people take advantage of.. Im pretty new at this.",
            "New to having the Executive World Elite Mastercard and  AAdvantage eShopping. Clicked on a link from their site that said 8 miles per dollar. Spent about $100 on one item. Expected roughly 800 miles.... but got 300. Is there something I'm missing in the fine print somewhere saying the 8/mile per dollar maxes out at a certain point? Does this happen often? \n\nNot a big deal, just also wish it would calculate it somewhere at the checkout so I knew exactly what I was getting before finalizing my purchase.",
            "A few months ago I heard you were no longer going to be able to earn loyalty points unless booking through the app directly (unless booked with a few select travel agencies). Any updates on if Amex Global Business Travel is one of these agencies and when this goes into effect?",
            "Regarding hotels from AAs portal, are they all timeshare pushers? I’ve had 4 hotel stays this year at different property owners, and only 1 hotel didn’t try and molest me at check in with fake “gifts” to convince me to go their presentation. \n\nThe extra LPs are nice, but 75% of the time is frustrating lol. Am I just unlucky with my selections or does anyone else experience this?",
            "Goofy question.  I am going to level up to platinum today or tomorrow when my exec card LPs post. I check in to a 2 night hotel booking I made through aa tomorrow late afternoon. Is there an additional aahotel LP point bonus for being platinum, or does that only happen after you hit 100k LP level and get up to 30% LP bonus?  The amount of LPs for the hotel stay is 7200 because of my gold status, so I was wondering if it would come in higher after hitting platinum before check in.",
            "I don’t know if this is the right place for this question, but … Status members whose upgrades “could not be confirmed” 24 hours before departure … have any of you actually been able to get upgraded through that upgrade list at the airport provided there are seats available?",
            "Looks like Barclay's Aviator Red sign up bonus is back up to 70k miles (from 50k)."
        ]
    },
    "What is the most amount of miles you’ve had in your account before you redeemed them and what did you redeem the miles on?": {
        "title": "What is the most amount of miles you’ve had in your account before you redeemed them and what did you redeem the miles on?",
        "score": 5,
        "url": "https://www.reddit.com/r/americanairlines/comments/1dj6ere/what_is_the_most_amount_of_miles_youve_had_in/",
        "content": "body text",
        "num_comments": 91,
        "comments": [
            "I wanted to see one million so I saved up 18ish months. Screen shotted it then spent a bunch.",
            "I had about 250k but I’m getting married next April and using them to surprise my fiancée with first class tickets on our honeymoon to Portugal. I’ve always been about saving it up but I think this is definitely a worthy spend",
            "I have 750k and my husband has over 1 million.",
            "Had just under 500k.  Redeemed to take the fam to the Japanese Grand Prix last year on JAL.",
            "1.5 million. Went to Paris to see Taylor flagship first. Still have 550k",
            "I have just over 1.6 million",
            "Had around 90k in my account and used 60k to visit my brother who was stationed in Munich at the time",
            "Had about 1.2 mil on one occasion, they went quick with our first/business class honeymoon and another trip to Australia/New Zealand the following year",
            "Rarely more than a couple hundred thousand each (wife and I). As soon as we have enough for long haul J either on AA or a partner (QR, CX, etc.) we head somewhere fun. When we take them, we make the kids sit in the back. 🤣",
            "I never let the balance get over 250k. I like to keep enough to buy a roundtrip partner J award."
        ]
    },
    "Exceeded my expectations": {
        "title": "Exceeded my expectations",
        "score": 38,
        "url": "https://www.reddit.com/r/americanairlines/comments/1dr23kb/exceeded_my_expectations/",
        "content": "Just flew ATL to LAX on AA2315.  Based on what I’ve been reading on this sub recently, I expected it to be canceled; it wasn’t. I expected someone would steal my seat; it was unoccupied. I expected the seat to be broken; it wasn’t. I expected it to be late; it departed right on time and arrived early. I expected the cabin crew to be surly;  they were professional, friendly and accommodating. I  expected the food in 1st to be unappetizing; it was ok, although the gelato had been thawed and refrozen a few too many times.  I expected my luggage to be lost or destroyed; it arrived intact. Overall, a good experience. Maybe I was just lucky. ",
        "num_comments": 22,
        "comments": [
            "I fly AA often. Rarely have issues.",
            "AA gets a lot of (somewhat justified) hate in many areas but honestly I’ve never had a bad inflight experience, including on their wholly owned regionals. Can’t say the same for other carriers.",
            "DFW is my home airport. In the past 4 years only thing I’ve ever come across is a delay.",
            "People just complain to complain. AA is fine, summer travel is rough for all airlines.",
            "There's nothing better than low expectations for increased satisfaction.",
            "AA PR rep has entered the chat. lol  \nI’ve mostly had good experiences with AA too, but then I fly maybe one or two times a year.",
            "The problem with places like Reddit is people typically say something when they have issues. You don’t leave a review when your service was fine… you go to those google reviews when a cockroach crawled on your food and the person taking your order call your baby ugly. \n\nPeople rarely post positive things here and when they do, most of the time people say they are bragging in one way or another so it turns into a sounding board for all the negative and none of the neutral/positive.",
            "I only fly AA, for many years now...8-10 trips a year.....some problems.... mostly a positive experience....",
            "I think people just have bad luck sometimes and it’s not the airlines fault if there’s horrible weather in Texas or the Northeast (or anywhere) that causes a snowball effect that screws up flights everywhere else.  It’s kind of the chance you take by flying and I’m pretty sure the employees of the airline don’t want to deal with dozens to thousands of angry people who all have the same problem.",
            "Direct flight between two big hubs I believe is a weighty factor in this one. Introducing layovers and/or smaller airports is where shit always hits the fan for me."
        ]
    },
    "Piedmont and Allegheny liveries parked up 2 gates apart at CLT": {
        "title": "Piedmont and Allegheny liveries parked up 2 gates apart at CLT",
        "score": 6,
        "url": "https://www.reddit.com/gallery/1dr9h8b",
        "content": "And I braved the walk through the Atrium to see them!",
        "num_comments": 2,
        "comments": [
            "My grandfather worked for Piedmont his entire career. I really want to fly on that one some day.",
            "Awesome. Love a bit of history.\n\nIt's a shame you can't plan this stuff out in advance, but AA struggles to get any plane where it's supposed to be thesedays, let alone a specific one!\n\nHope you get lucky one day!"
        ]
    },
    "Mco just shut down all inbound traffic": {
        "title": "Mco just shut down all inbound traffic",
        "score": 5,
        "url": "https://www.reddit.com/r/americanairlines/comments/1dr7kjc/mco_just_shut_down_all_inbound_traffic/",
        "content": "Anyone know why? No weather there currently according to the maps. I’m sitting on the tarmac in another city waiting to go and they just shut down the engines. ",
        "num_comments": 13,
        "comments": [
            "They just deplaned us and told us it’s the tracon system and they can’t get it to reboot.",
            "Lesley Nielson unplugged the airport.",
            "TO ENVIROMENTAL TRIGGER AT F11 TRACON.\n\nAir traffic control with a vague explanation",
            "Pilot at Philadelphia is saying it's a sewage emergency",
            "It is usually due to ATC staffing.\nIf they do not have the staff to safely handle the amount of flights in the airspace ATC will restrict or shut down the airspace.",
            "It only applies to inbound flights?  \n\nWe flew out of MCO yesterday. Airport is a shit show on a normal day. Had a 45 minute ground stop for weather. It was an absolute cluster when it reopened. Orlando needs to overhaul that place.",
            "TO Environmental = Tech Ops Environmental, likely ac or something along those lines inop.",
            "The new terminal is pretty nice",
            "It’s an extremely stressful job with an insane learning curve and you need the ability to relocate anywhere. Training is in Oklahoma for basics and then where ever you are placed.\n\nIt’s not a job for everyone and unless you start young or have no attachments. Also there is an age limit for hiring due to the mandatory retirement.",
            "Ah yes due to \"other.\""
        ]
    }
}