{
    "This sub will always protect free speech": {
        "title": "This sub will always protect free speech",
        "score": 2243,
        "url": "https://www.reddit.com/r/AmITheAngel/comments/drboyf/this_sub_will_always_protect_free_speech/",
        "content": "I started this sub 10 months ago in order to create a space to make fun of, criticize (yes that includes shitposts), and generate legitimate discussion regarding r/AmITheAsshole. We criticize their censorship on their sub, and mod decisions we disagree with. That however DOES NOT mean we will censor them or those that agree with their mod team in return (though we fully recognize that they would likely ban a user criticizing them on an AITA post). I stand for free speech in its entirety, and will protect it just as vehemently on this sub for those that disagree with the views of the majority here, as the views of the minority (regardless of their status on this sub or any others).\n\n\nThe reason I'm stating this is because a member of our mod team made a decision that mirrored censorship, and for reasons that I felt were misguided. Yes their action was directed at a moderator on r/AmITheAsshole commenting on here, but their views/comments are welcome here so long as they do not violate sitewide rules. I tend to tread *very* lightly on moderation here. I prefer to allow the system of downvotes and upvotes to allow users to decide which posts/comments the majority agrees should be on top. Yes, that allows shitposts to sometimes consume the feed but it's your choice to decide, not mine, nor anyone else's on the mod team. If a mod from AITA says something stupid on this sub, downvote them and call them out on their bull shit, I encourage it. But neither me nor any member of this moderation team should take any removal, muting, or banning action against them unless they violate the subreddit's rules or sitewide rules. \n\n\nOn top of this I would also like to state that I will *never* allow the moderation team of r/AmITheAsshole to have any real influence or power over this sub. We are completely independent of them, and I will not allow them to censor or silence us in any way. Though they have reached out many times and voiced their opinion on our sub and their disdain for it, asking us to make changes on occasion that would compromise what this sub is, I have never, and will never, give in. \n\n\nOn top of this, I would like to remind everyone that there should be no brigading/trolling on r/AmITheAsshole. So far from what I can tell we've done an AMAZING job so far and have not had ANY complaints from r/AmITheAsshole moderation team (which to me, sounds pretty good). But I also want to remind that it means:\n\n\n**Don't comment or post on an r/AmITheAsshole post that is crossposted here**\n\n\n**Don't post/comment criticisms of their sub/moderation team on their sub, keep it to this one** (if you're subscribed here that is, if you're a passerby that happens to find this you're not my problem lmao)\n\n\nAnd as always... **Follow reddiquette**\n\n\nAnd so long as we do this and keep it up we won't have to worry about anything or any sort of retaliation against this sub. Again though, y'all have done an AMAZING job of behaving and following the rules, and this isn't a warning to any of y'all in any way (this is more geared towards new subscribers). \n\n\n***ALSO I KNOW I'M REALLY REALLY LATE AND I DIDN'T MAKE A POST, BUT HAPPY 10, NOW 11K!!!!***",
        "num_comments": 222,
        "comments": [
            "INFO, are the mods religious?",
            "Info: are you gonna make r/AmITheDevil for the posts that are unanimously TA, such as LasagnaBoy?",
            "completely serious. it’s really awesome to have a mod team that is just trying to generate discussion and allow a place for that so good on you for handling it!!\nanyway: INFO Are you vegan bc then YTA eitherwise NAH.1",
            "I thought shitposts were the whole idea of this sub.",
            "I’m not sure what this specifically is talking about. Censorship how and against what or whom?",
            "Oh my god thank you for creating this from the bottom of my heart. AITA is the worst thing I’ve ever stumbled upon in my life.",
            "ESH: People shouldn’t have acted in a manner to make you post this, but you’re doing yourself and this sub a disservice by refusing to even consider a path of egregious censorship.",
            "YTA free speech is not allowed in our great state of China. Your social credit points have been voided. Please check in with your local police station to queue a request for your family back.",
            "Those assholes banned me for ten days because I told someone to stop calling OP a sociopath. Not kidding",
            "Okay lads I’m gonna say it, /u/Dameteor has the gay"
        ]
    },
    "AITA for updating the shitpost situation?": {
        "title": "AITA for updating the shitpost situation?",
        "score": 524,
        "url": "https://www.reddit.com/r/AmITheAngel/comments/15q1duz/aita_for_updating_the_shitpost_situation/",
        "content": "Since this subreddit has become larger over the past few years (like, 28A to 36DD larger), our \"loose moderation\" style has to be put aside for a moment to prevent this subreddit being run into the ground by the plague of low-effort, repetitive shitposts.\n\nShitposts of quality may only be posted Saturdays and Sundays. Our mods are North America based so we'll take time zones into account.\n\nBut what does \"of quality\" mean? It means that your shitposts must now reflect an AITA post, or a grouping of them, and the AITA post(s) must be linked **at the bottom of the shitpost.** If no AITA source is provided, **your post will be removed.** Shitposts must have substance to them too. They can not be general one-liners that cover the tropes of AITA for some karma grab.\n\nHere is a refresher of rules of the sub:\n\n[https://www.reddit.com/r/AmITheAngel/comments/yy0b7h/aita\\_for\\_explaining\\_some\\_rule\\_clarifications/](https://www.reddit.com/r/AmITheAngel/comments/yy0b7h/aita_for_explaining_some_rule_clarifications/)\n\nReport all shitposts you see outside of weekend hours so we can remove them.\n\nThanks,\n\nFluffinn (20F, 28G, *hot*)",
        "num_comments": 133,
        "comments": [
            "Excellent response to community concern - I am so sick of these zero effort meme posts that have zero relation to any actual post on AITA clogging up the entire sub, people can make those jokes in the comments of usual cross posts. And completely agree with needing to link the original post - I’m not in AITA because it’s infuriating, hence why I come here - don’t really feel like wading through that sub to find whatever story a shitpost is referencing. Kudos!!",
            "Phew, thank you for limiting the shitposts to the weekend. \n\nHowever, I'm not sure if ALL shitposts warrant an AITA source. For example, we had several history-themed ones that were incredibly well-written. Those posts weren't based off any AITA posts, so maybe you guys could allow some leeway in that part of the rule?",
            "Thank fuck. A couple of months ago, someone complained about them, and I was like \"I mean just scroll past them.\" Since then, the front page of this sub has been **dominated** by some of the most unfunny, overly contrived derivatives and exaggerations that only my toddler would find funny, and he's *exclusively* into fart jokes right now.",
            "This exactly the response a lot of us were hoping for. Props to the mods for actually listening to community feedback. I can see several parts of this post that were taken directly from popular suggestions. Now imagine if Reddit themselves did this...",
            "Thank you! I lost interest in this sub in the past couple of months due to the non-stop Shitposts. It's like going to the theater and seeing 95% of the films are parodies, and they're all hitting the same jokes!",
            "Wait, do they have to link the source material that the shitpost us satirizing?\n\nI usually scroll past shitposts because I'm really here for the discussion/crossposts from r/AmItheAsshole (r/AITA is knockoff r/AmItheAsshole, r/BORU is boring, and r/TrueOffMyChest is usually just vile, but crossposts from those are fine in a pinch), but if shitposts come with a link to the post they're satirizing, that might actually make me want to stop scrolling past them",
            "Thank you . I am so sick of unfunny shitposts\n\n![gif](giphy|KJ1f5iTl4Oo7u|downsized)",
            "Thank god I got so sick of scrolling past the 30th unfunny post on my feed each day",
            "YTA: Real Reddit mods just enforce policy changes through bans.",
            "Thank you, this sub quickly because 95% shitposts."
        ]
    },
    "A kid complains (rightfully so) that a creep in his 30s hits on her (She's 16) and she refers to him as middle age, I bet the comments won't ignore the grooming part and focus on arguing that someone in his 30s isn't middle age, surely not, reddit is better than that, I hope...": {
        "title": "A kid complains (rightfully so) that a creep in his 30s hits on her (She's 16) and she refers to him as middle age, I bet the comments won't ignore the grooming part and focus on arguing that someone in his 30s isn't middle age, surely not, reddit is better than that, I hope...",
        "score": 20,
        "url": "/r/self/comments/1dpt0xr/i_got_hit_on_by_a_middle_aged_man_and_i_feel/",
        "content": "",
        "num_comments": 27,
        "comments": [
            "The fact that a 16-year-old thinks that a 30 something-year-old man is middle aged man just proves that they’re children and grown ass adults hitting on them are creepy as hell.",
            "\"I dunno, I'm 40 and just starting to get to a point where I'm financially stable enough to look at procreation with my SO and I realized I'm not quite there yet.\" \n\nI found this gold amongst the comments, derided for being completely off topic. It's probably the most reddit paragraph I've ever read.",
            "I’ve seen this so many times online, it’s so gross. Once a 17 year old girl was complaining that a man she said was in his 60s was hitting on her, and everyone was calling her “ageist” because “older men are allowed to look for love too.” \n\nIt’s ridiculous. I’m in my 30s. Teenagers are supposed to think I am old, because *they’re teenagers*. Also teenagers suck at guessing adults age. The guy she says was “at least 30” could easily have in fact been 50 and middle aged. Or maybe he was 21. Either way, he was a grown man, too old to be talking to her, and making her uncomfortable. The feelings of 30somethings who are anxious about “feeling old” aren’t relevant!",
            "The UM ACKSHUALLY 🤓 crowd had to take a five min break from their 18th Disney trip this year to shame a child for thinking of them as old please think of them in trying times like these",
            "She's 16, he's at least twice her age. She's allowed to think that's old (especially in the context of him hitting on her), even if the term 'middle aged' might not be the best.",
            "Now I’m going to be the pedant: “middle aged” doesn’t mean the middle of your life, it means the middle stage of adulthood, between young adult and senior. It’s typically been thought of as 35 to 55/60.",
            "TBF she’s adjusted it to 40 & apologized. Here’s to hoping she doesn’t get harassed by the sex pest any more.",
            "Got bad news for some of you. 30's is middle age. \n\nDo the math.",
            "Was expecting the “30 isn’t middle age waaah” comments, wasn’t expecting so many “but how old do you look? Poor guy was just trying to pick up a hot girl” comments but probably should have expected those as well.",
            "If you die at 60, 30 is middle age."
        ]
    },
    "Aita for scarring my child and exiling him from the nation?": {
        "title": "Aita for scarring my child and exiling him from the nation?",
        "score": 21,
        "url": "https://www.reddit.com/r/AmITheAngel/comments/1drapa8/aita_for_scarring_my_child_and_exiling_him_from/",
        "content": "Throwaway because the Earth king is on reddit: \n\nI (40sM) have 2 children Z (16M) and A(14F) I also happen to be the leader of a very powerful fire controlling nation. 100 years ago my great grandfather wiped out some air loving nomads in a effort to wipe out the avatar. Basically a 12 year old who could control all elements and would ruin my nations hard earned invasion plans.\n\nSo anyway, back to the story. I was in a meeting with my royal advisors when Z interrupted saying I was wrong. This is obviously very very very awful so I challenged him to a Agni Kai. And I burnt his face and banished him. I gave him some soldiers, sent his tea loving idiot uncle with him and said. \"Don't return until you've found that 12 year old.\"\n\nMy advisor said I was wrong so I sent him off to the colonies and my other advisor said to come here. Aita?\n\n(Source: Atla. Zukos origins)",
        "num_comments": 11,
        "comments": [
            "It physically pained me to call Iroh a idiot lol.",
            "What about A? I'm sure you are giving her a well rounded childhood right?",
            "NTA your nation your rules",
            "It was legal. Its a way to show your honor in my country.",
            "She's a prodigy, she's very very very talented.",
            "NTA, it is clear that Z had it coming and that A is just beter. You should leave her the kingdom. If one child is THAT much beter, it is fair to concider them an only child.",
            "Why do people post so many obviously fake stories? And why do people treat them as real?\n\nLook, I live in Ba Sing Se, and I can assure you living in one of the biggest cities in the world with travelers from everywhere, we would have heard about all of this shit going on in the Fire Nation.\n\nNow if you excuse me, someone named Joo Dee has told me that I'm invited to visit a timeshare opportunity given the King at lake Laogai.",
            "INFO: did you burn him during an official throw-fire-at-each-other duel? If so, that legal and you cannot possibly be TA.",
            "Hmm....Send the drill/",
            "Exactly!"
        ]
    },
    "I accidentally got my sister pregnant and we aren’t telling anyone to make her rich husband believe it’s his.": {
        "title": "I accidentally got my sister pregnant and we aren’t telling anyone to make her rich husband believe it’s his.",
        "score": 90,
        "url": "/r/offmychest/comments/bgoymq/i_accidentally_got_my_sister_pregnant_and_we/",
        "content": "",
        "num_comments": 110,
        "comments": [
            "Of all of the stories that never happened, this is at the top of the list. I just remembered it and it reminds me of this magazine my mom had when I was a preteen/teen in the early 2000s called True Story, full of absolutely bonkers , supposed \"true stories\".",
            "I read the title, knew what this was going to be about, and still read this all the way through and I hate myself for it. ",
            "I like how the reason why they're not telling the husband about their incest affair is because he's really wealthy not because they committed incest and if it got out their lives would be socially ruined and they'd potentially be prosecuted.",
            "Someone was taking inspiration for Game of thrones/House of the Dragon. Cause people totally pass off their incest kids as legitimate because the woman's husband is rich and powerful ALL THE TIME.",
            "Let's keep this a secret....ok lemme write it up as a post on reddit.",
            "I mean, I try to be as mature and body positive as possible, but if I accidentally saw my brother's dick while he was drunkenly pissing with the door open, I would probably say \"lol ew\" instead of having sex with him.",
            "I hate you for making me read this.",
            "Look who came to the AITA party! It's VC Andrews!",
            "My fave part was when he was describing how wealthy the father in law was and that he bought the house with a *check*\n\nIs that what a 13 year old thinks denotes wealth?",
            "Of all the things that have never happened, this has never happened the most."
        ]
    }
}