{
    "AITA Monthly Open Forum June 2024: Assholes ASSemble!": {
        "title": "AITA Monthly Open Forum June 2024: Assholes ASSemble!",
        "score": 102,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1d5g8i7/aita_monthly_open_forum_june_2024_assholes/",
        "content": "#Keep things civil. Rules still apply.\n\nWe’ve been diving into various sub rules lately. So we thought we’d take a break this month, and revisit something we did in an earlier open forum. Hence, the call to ASSemble! (We had a few names that we were throwing around. ASS (Assholes Sharing Stories), Asshole Amnesty Month.\n\nTell us about a time when you were the asshole. We can relax *some* sub rules a bit (a revenge story is probably fine, since you’re recalling, and not asking for judgment). But, other sub rules still apply (no violent encounters, for example)! Let us know about a time when you knew you were the asshole. Maybe you didn’t mean to be, but after the encounter, you realized you were TA. Or, maybe you knew what you were doing, and went through with it anyway! \n\nPersonally, I've always felt the more low-stakes the issue, the better. Those are always my favorite AITA stories, but feel free to share whatever you may have. And most important - have fun with it! \n\n___\n\n#As always, do not directly link to posts/comments or post uncensored screenshots here. Any comments with links will be removed.\n\n---\n\nWe'd like to highlight the regional spinoffs we have linked on the sidebar! If you have any suggestions or additions to this, please let us know in the comments.",
        "num_comments": 188,
        "comments": [
            "Long time ago I was a bartender. Had a couple that came in semi regularly, nice guy, girl was awful. She liked to heavily flirt with other guys when he'd leave the bar. One time he went to the bathroom and she immediately got some guy to buy her a drink and then when BF came back, she cried about this guy coming on to her, won't take no, tried to grope her, etc. BF grabs the guy, but before he could do anything I yelled out she's lying to you. Everything stops, people around start agreeing with me, BF looks around, tells GF they're leaving.\n\nTwo years later I married him, married 30+ years now.",
            "Okay, here's something that still keeps me up at night. I was at a friend's house, hanging out with him and his partner. He and I were both huge fans of a particular TV show, and he dropped into conversation that he'd introduced his partner to it and they were watching through it together. That got us talking about the show again, bouncing off each other about things we enjoyed about it, aaaaand I got overexcited and dropped a massive spoiler for the final season. I realised immediately what I'd done and I was absolutely moritfied. I wasn't invited back :/",
            "I was an AH...but.  When we were first married, we rented a 2nd floor apt from a really nice widow.  I had to park in a small graveled area right by her house, but not on anyone's property.  Couple of the jagov kids tomatoed and egged my car because they couldn't play wiffle ball there.\n\nPut a couple of eggs in my trunk, for a couple of weeks (it was a hot summer).   Went out about 3 am and egged both of their parents cars.  You can imagine the mess.  Heard the parents talking about it, and I chimed in with, \"Yeah, I got hit twice this week..wow!\"",
            "Anyone else getting fed up with the influx of blatant engagement bait shitposts? The majority of posts lately read like ChatGPT prompts or high school creative writing exercises.   \nDoes no one find it suspicious that after years of \"should have\" & \"prolly\" there's suddenly an abundance of elaborate posts written by teens with impeccable grammar?",
            "I don’t associate with anyone involved in this scenario anymore so it’s probably safe to come clean. \n\nA log time ago I went back where my parents lived for Christmas. We had a double whammy of a day to get through because my parents had a lunch meal for the day, my spouse’s grandparents always did a very fancy evening dinner, and then everyone would convene at a local bar that we had all been going to since before we were legal to enter bars. \n\nThings got very rowdy, especially for those of us who had already sat through two Christmas meals with wine and who were now very deep into their cups. But finally the lights came out and it was time to leave. \n\nOne of the family members who owned the bar came up to me and took my wine out of my hand. Well to my drunken mind, this would not stand. I lectured him loudly and vehemently about how he had no right to just take my drink and that maybe I wanted to finish it and he wasn’t the boss of me, and I finished up with “Who died and made you Elvis?! You ain’t the king!” He stared at me. Silently poured the remainder of my wine into a roadie cup (this was an area where Togo cups were permissible, as long as the open container was not in a moving car), and handed it back to me. I said “oh.” And he walked away. \n\nI was mortified for days after.",
            "My spouse subscribed to & shares a ton of posts on Facebook.  The kind with thousands of \"likes\". She was still logged on, so I unsubscribed her to several of the more annoying ones.\n\n\nI don't think she even noticed, but it does make me an asshole.",
            "I know this would be nigh unenforceable, but oh how I wish there could be a rule requiring people to establish what an acronym stands for before using it. I see so many posts where people just casually throw around the most obscure combination of letters and assume everyone else will understand them. Nobody outside of your subreddit knows DSPOBBH stands for \"Dear-Sweet-Pookie-Poo-Baby-Boy-Husband\"!",
            "More of a bit of a rant. Just tried to leave a lengthy comment on a post that was less than 2 hours old. Found out  omments were locked when i clicked post. I'm on the app on my phone. Is there a way to know that before spending time replying? Who / how do comments get locked?",
            "I used to be really terrible about spoiling books for people. To the point where when I got HP book 5 my brother (who was my roommate at the time) had me read it out loud to him. We were fairly rural so it was delivered via UPS late in the evening. I read almost 900 pages to him that night so I couldn’t give away anything. \n\nNow I read books nobody else in my life cares about (free or cheap ones on Kindle Unlimited) or \\*after\\* someone recommends it.",
            "I once had a roommate with whom I split grocery bills. We were on bad terms when I was moving out (kind of an everybody was an asshole situation, although I will hold in my own mind that she was the bigger asshole, but I digress) and so she started going around the kitchen like \"well you ate more cheese than I did, so I get to keep more cheese. You used more flour than I did, so I get to keep more flour.\" That kind of nonsense.\n\nSo I was like oooooooooh I can play that game!!! I had paid for the command hooks, so I walked around the apartment and took down EVERYTHING that we had hung on the walls (a lot of things, mostly hers) and took all the command hooks (leaving her pictures and art and stuff leaned against the walls all over the place). I didn't want them for anything, and ended up donating them down the road, but if she was going to nickel and dime me about flour and cheese she sure as hell was not keeping those command hooks!\n\nHonestly, this was an asshole move and I'm usually not an asshole, but I will die proud of it."
        ]
    },
    "AITA for sending my twin daughters to separate schools? ": {
        "title": "AITA for sending my twin daughters to separate schools? ",
        "score": 4651,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dlk0x1/aita_for_sending_my_twin_daughters_to_separate/",
        "content": "I (38M) am the father of two girls, Elsa (5F) and Anna (5F). They're physically identical, to the point where even my parents get them mixed up when we visit, and my wife's parents just call them \"the twins.\" This is extremely frustrating for me, and I don't think it's healthy for them. There are so many people where we live who see two girls with similar features and decide that makes them the same person, which they are not, and I'm beyond sick of it. I'm sick of getting two of everything at christmas and birthdays, even though they have drastically different interests, personalities, and styles. I'm sick of hearing how they're \"creepy\" or look like dolls, or having my daughters referred to as a \"set.\" At their pre-K, the teachers always kept them together, and often called them the wrong names, which apparently led to some critical information being attributed to the wrong child. \n\nI'm done with this. They're going into Kindergarten in September, and I'm enrolling them in different schools. They're both private Catholic schools, similar price range, similar prestige, as much as a kindergarten can have prestige. Elsa has a longer commute in the morning than Anna, but that's the only major inequality here, and honestly, I think the extra fifteen minutes in the car is worth it in order to have my daughters each recognized as individuals at school. If they're not in the same class, teachers don't know them both, students don't know them both, then my girls will each get the same individual attention as any other kid, rather than half.\n\nMy wife thinks I'm setting them up for resentment if one school turns out better than the other, and that I'm being unfair to Elsa by having her commute be longer. I let my daughters choose which school each one wanted to go to, and Elsa chose hers because there's birds on the logo. I get that ideally, it would be great to send all our kids to the same school, but I also genuinely believe that giving them this experience apart from one another is crucial for their social and emotional development into emotionally stable adults. \n\nAITA? \n\nTL;DR: Sending my daughters to separate schools of similar caliber in order to keep people from seeing them as extensions of one another, is this unfair?  ",
        "num_comments": 1086,
        "comments": [
            "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I'm sending my daughters to separate schools for kindergarten. This might make me the asshole because I'm technically treating them differently, and if one school turns out better it could cause resentment.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "As someone with a twin sister myself, I totally get where you are coming from. My sister and I were regularly called the twins, called by the wrong name, seen as a set, always had both of us included. This led to major issues in the differentiation process, when we started wanting to be individuals. We also had a hard time learning how to create social bonds as teenagers/adults.\n\nThankfully my school was clever enough not to put us in the same classroom.\n\nThere were tensions because of unequal amount of homework, and friendships, etc. But compared to the times people would confuse us, and not see us as individuals, it was preferable.\n\nThere is no right or wrong answer, but it's definitely healthy to give them space, although it might not always be easy. Be prepared to navigate jealousy and comparison because people will compare them anyway. There's a whole branch of psychology specialising in issues twins face, if you're interested.\n\nEdit: adding judgement because I forgot, NTA",
            "I think what you're doing is a good idea IF-- and only IF-- you're willing to listen to your daughters and change their schools if they ask for it. If one school ends up being better than the other in later years, if your daughters find they want to be at the same school, whatever. Listen to what they voice about the situation after they've tried it. NAH.",
            "NAH. BUT. For future reference it may be worth finding a larger school and enrolling them in separate classrooms. Private schools especially can have wildly asynchronous school year calendars, and you are going to be sad if spring breaks don’t align, random inservice  days off school etc. Not to mention the risk of the kids having music concerts or school plays on the same night, etc. They won’t have any school friends in common so you can look forward to twice the amount of commuting to birthday parties, sleepovers etc. \n\nI applaud you for cherishing their individuality. Other fun stuff like different haircuts, hair color streaks etc can help them help other people see them as individuals.",
            "NTA. If you can arrange that when you drop Anna off in the morning then you also pick her up first as well. This way both girls have a chance to talk to you privately (Elsa in the morning after Anna is dropped off and Anna in the afternoon on the way to pick Elsa up) and it not just one kid having that opportunity everyday. \n\nThey might not have anything that they need to say privately or interesting when they are this young but the benefits will manifest when they are older.",
            "NAH, though shouldn’t this be a decision you and your wife make together? It would be an easier decision to support if the schools were more tailored to each individual child than a preference over a logo. I think traditionally this issue is handled by having the girls in separate classes at the same school, so I think you need a particularly strong reason to deviate from that. Especially since you haven’t even tried it yet — though I also get that’s a decision you don’t want to be making later, so it’s a now or never type of thing. So, I get it, that’s the reason for my NAH vote.",
            "Info: what do your daughters want? Do they want to go to different schools, or would they rather stay together?",
            "NTA, i'm an identical twin and I wish my parents had put us in separate schools. I'm in my 40's now and I look back at my life and there is a lot of anxiety, depression and lack of overall social skills that I can trace back to my being a twin. We were never treated as individuals, even though my parents did insist on us being in separate classes in grade school we defaulted to having the same friends because if you're friends with one sister why not the other? We became very co-dependent socially and were constantly compared to each other which resulted in extreme depression in my sister and a suicide attempt and by the time we were out of highschool  and we finally did manage to separate and start living separate lives, neither of us knew how to do anything without the other and it was extremely isolating. In my opinion I would have been much better off in the long run if my parents and other adults in my life had seen fit to keep us separated as much as reasonably possible so that we could learn to stand on our own and not rely on the other.",
            "YTA, mostly because this shouldn't be a unilateral decision. Your wife's opinion is valid, too.\n\nI think this is a monumentally bad idea. Could you not just send them to a school with more than one class for each grade and make sure they're not in the same class?",
            "YTA bc all you talk about is how you feel and what you think.  None of this was based on what your daughters feel and think.  Some twins love being twins.  Some hate it.  My twins have gone through phases.  I let them decide how much twiness they want because it is their lives.  "
        ]
    },
    "AITA for telling my mother that she doesn’t look so skinny herself after she called my daughter fat and ignoring her attempts to help?": {
        "title": "AITA for telling my mother that she doesn’t look so skinny herself after she called my daughter fat and ignoring her attempts to help?",
        "score": 1814,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dlmpmq/aita_for_telling_my_mother_that_she_doesnt_look/",
        "content": "I (42F) have a (15F) daughter named Mary. She’s been a bit curvier than other girls since she hit puberty at age 10. It’s been a huge source of stress for her and there’s been multiple incidents where she attempts some crazy diet (in 6th grade while at a sleepaway camp for music she didn’t eat for a week except for a few granola bars). She’s at a point now where she’s a bit more accepting of her body and isn’t going to do anything reckless, but we have to be extra careful to not mention weight stuff around her because it makes her upset. \n\nI really want to emphasize that she doesn’t eat anything more than what other girls her age eat, and if anything she eats less. She’s had doctors walk in the room and tell her that she’s “really big for her age” and girls at school saying similar. My daughter is at a loss of what to do, she exercises and eats healthy.\n\nAnyways, my mother pointed out at dinner 2 days ago that she was “tubby” and she suggested that I put her on a pill and sign her up for weight watchers or a similar program. Ever since then she’s been texting me with “resources” and I got so mad at her refusal to stop that I told her that she should check out some of those resources because she wasn’t looking so skinny herself. She told me to fuck off and then she blocked me, and left me wondering if I’m the AH in this situation?",
        "num_comments": 424,
        "comments": [
            "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I ignored all the resources she sent without even really looking at them and I called her fat, which is likely to worsen the issue even more. She has good intentions, and so my actions may have been out of line\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "NTA. Mom can’t handle a taste of her own medicine apparently.\n\nAs for your daughter, have thyroid and pituitary issues been ruled out? Excess weight can be caused by unbalanced hormones.\n\nAs long as she is healthy, it doesn’t matter how she looks.",
            "Normally I’d say something about not stooping to their level or whatever, but I actually think you may have made a necessary point here. It doesn’t feel very good when someone is pointing out your physical size and offering up “helpful suggestions” on how to change yourself to fit their standards. \n\nSounds like you told her to stop before it got to that point, so you escalated and did what you needed to do.\n\nIt may be better to have a direct conversation about what kinds of conversations and comments are allowed around your daughter when you’re both calmer though. She’s from a different time and we know better now how harmful things like she was doing can be.\n\nNTA.",
            "If your mother hasn't been close enough to know already what has happened, she is not close enough to offer advice.\n\nNTA",
            "NTA. My weight went up when I hit puberty. I played 3 sports and counted calories but couldn’t lose the weight. My mom did the same as your mom. I would only be pretty if I lost weight. In grad school, I was on the edge of an ED while I was writing my thesis and working 2 jobs. Mom thought I was “looking better”. Finally was diagnosed with hashimotos disease (autoimmune disease where my thyroid is attached. My thyroid literally looks like Swiss cheese). The gaining and losing were signs but no one saw it.  Get her checked before damage is done. Please.",
            "It’s was a NTA for me UNTIL the comments. \n\nOP refusing to take your child to the doctor if you suspect she has a condition that requires treatment because it doesn’t work for your “work schedule” is one of the most ridiculous things I’ve ever seen. \n\nYTA.",
            "NTA at all. As a girl with a severe eating disorder, I wish my mom had stood up for me like this when I was a kid. I was never overweight, but it didn't stop mean comments from older women in my life about how my diet would eventually catch up to me.\n\nA lot of it is internal jealousy and self-resentment, but it's actually  fucking crazy for a grown grandmother to recommend her minor granddaughter for diet pills and such?!?! Good on you OP. \n\nBut also, be aware that sometimes intentionally avoiding conversations around food or weight can become painfully obvious to your daughter. Really, the best course of action is to speak to a nutritionist, or a doctor and have blood work done: there's a myriad of reasons for this. And if there's nothing, and it turns out she's just genetically disposed to carry more weight, she can *still* be extremely healthy. \n\nOne of my girl friends in college is quite severely overweight and is extremely healthy, a power lifter, and unlikely to experience major health issues anytime in the near future. She just happens to be naturally fat, and that isn't bad or ugly at all. \n\nBody positivity, or glorifying obesity *isn't* the answer, but ignoring the conversation forever won't help either. Instead, work on body neutrality, focus on health overall, and make sure your daughter knows she's loved just as she is.",
            "NTA\n\nShe deserved to be blocked. She could have expressed a concern for her granddaughter's health once, but then should have dropped it.\n\nIf I were her mom, though, I'd be concerned, especially if even her doctor mentions it. If you're sure she's eating healthy, no excess carbs, excess sugar, and she's active (and I mean actually eating healthy food, not necessarily what her friends are eating -- like alot of processed food), then I'd be wondering if something was going on medically and ask the doctor for some tests. Various medical issues can cause weight gain.",
            "NTA for standing up for your daughter.\n\nSoft AH for not taking her to the doctor. Come on now, we are all busy but there’s one hundred ways you can get round it. You can arrange a phone consultation to chat before going in with your daughter, dr would order bloods off that alone so you would have all the results there to discuss when you go in so you’re not doing two appointments.\n\nYou and daughter can work on her self esteem and body image all you like but so much of medicine in weight/hormonal/women’s issues is process of elimination, if you don’t start this conversation by ruling out the underlying issues then that poor kid is fighting this with both hands tied behind her back.\n\nYou obviously love and care about her so time to get the ball rolling!",
            "NTA for calling out your mom… but YTA for not making sure she is getting bloodwork done and adequate care from doctors. Absolutely absurd. \n\nAlso, it’s okay to call out a doctor who makes a judgmental statement that hurts her feelings, without actually knowing her health yet, those providers are working from an incredibly out of date assumption that being a certain BMI automatically means unhealthy. A good doctor will check all the different necessary causes and go from there. \n\nWomen in particular have a hard time getting adequate care, especially those who are young adults. This is your chance to help your daughter before she is on her own without you to help her fight any battles. Stand up for her. \n\nI didn’t find a doctor who would take my concerns about my health seriously (instead of just saying I needed to lose weight and refusing to do tests unless I lost weight first), until I was in my 30s. And once I did, I got the care I needed for the CAUSE of the issue and dropped quite a bit of weight with zero diet and exercise changes."
        ]
    },
    "AITA for warning my sister's boyfriend she wanted our parents to confront him at dinner?": {
        "title": "AITA for warning my sister's boyfriend she wanted our parents to confront him at dinner?",
        "score": 7888,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dlbwqu/aita_for_warning_my_sisters_boyfriend_she_wanted/",
        "content": "My(23f) family went out for dinner a few days ago to celebrate my sister(26f) Jenn's birthday. When we got to the restaurant Jenn was already there alone. She said she told her boyfriend Blake the time got pushed back 30 minutes because she needed to talk to us alone. Jenn was mad at Blake for not getting her any birthday gifts and only took her out to dinner to a place they go to often. Our parents understood her being upset and she asked if they would try talking to him because she couldn't get Blake to understand how hurtful that was. I asked her if she had given him her usual 'present' for his birthday or last holiday and Jenn said that wasn't important.\n\nFor context, my sister's idea of a gift for her partner is lingerie and sex, and only ever that. I don't know about her past relationships but I do know in the 2 years they've been together, I've heard and seen Blake give her gift ideas for him and he winds up buying them for himself after the fact. He's come to Christmas at our house with gifts for Jenn and Jenn always shows up empty handed for him saying she'd give him his present later.\n\nI told Jenn it sounded like she got as good as she gives whereas our parents said I should be concerned someone would be dismissive and vindictive toward my sister. Our parents said they'd think about talking to him based on his behavior when he arrived. So I text Blake that Jenn was setting him up for a lecture. \n\nHe wound up not showing up. Last night Jenn called me angry. She saw my text to him and realized my text was the reason he canceled and accused me of not having her back and she's told our parents I butt into their relationship but I figure she was trying to get us involved in her relationship anyway. I probably could have just stayed quiet but at the time it didn't sit right with me what she was trying to do. AITA?",
        "num_comments": 493,
        "comments": [
            "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1: I warned my sister's boyfriend she was trying to get our parents to speak to him on her behalf over something as silly as not getting what she wanted for her birthday.\n2: That could make me an asshole because I could have just stayed quiet and let him handle it when the time came.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "NTA. Let's ignore that Jenn is in the wrong and concentrate on your involvement.\n\nJenn invited (nay, urged) her parents to meddle in her relationship. She has no moral high ground to object to her sister also meddling. In fact, if you had meddled in her favor, she'd have been really happy about it. \n\nYou did the right thing in warning Blake about the three-person ambush.",
            "She's 26, maybe is time to stop going to mommy and daddy to talk to his BF.",
            "NTA-She pulled you all in her relationship and then wanted sympathy when it wasn’t warranted. Your sister doesn’t sound like relationship material for Blake. Kinda self-absorbed. You did right to warn him ahead of time. The only thing I wonder is why he felt it important to share your text with her?",
            "She don’t get her bf a gift for any occasion but expects him to get her something 🙄 then to bring the family in on it and try to bash him for not getting her a gift is crazy NTA for giving him the heads up.",
            "Why doesn’t Blake just get himself a g-string and let Jenn know he will give her gift to her later?  If she complains that sex is not a real gift, he can ask “since when?”",
            "NTA\n\nNext time Blake should leave out the dinner altogether and just get her some sex, too.",
            "NTA. I would have wanted a heads up if I was walking into a trap too. \n\nJenn seems very selfish based on what you have said here. It's also kind of shitty that she is assuming Blake wants sex as a present? Intimacy is special, completely separate from a birthday or Christmas gift?",
            ">but I figure she was trying to get us involved in her relationship anyway\n\nNTA. Jenn already lied to Blake about the time of the dinner, and she doesn't consider what he might need or want for a birthday gift. They don't really sound long-term compatible. I think you did the decent thing in giving him the heads-up, although he should still have attended. Your parents sound like they indulge Jenn, and she has therefore never learned to take the consequences of her own actions.",
            "NTA - I hope that was a typo and you meant to say your sister is 16? Not 26?\n\nThe audacity of your sister and your parents to gang up on a dude over birthday gifts. Absolutely not ok. Super gross actually.\n\nI’m glad you warned him. \n\nEdit: typo "
        ]
    },
    "AITA for telling my girlfriend to be more grateful for her gift?": {
        "title": "AITA for telling my girlfriend to be more grateful for her gift?",
        "score": 674,
        "url": "https://www.reddit.com/r/AmItheAsshole/comments/1dlpgtt/aita_for_telling_my_girlfriend_to_be_more/",
        "content": "My gf takes gifts really seriously. She said it's the main way she shows she loves someone. In the love language test, she would be acts of service I believe.\n\nHer birthday was last week and I got her a gift she loved, thank god. So liked all of our gifts basically except her brother.\n\nHer crockpot cracked, so her brother bought her a new one. It was a nice one, too, but I could tell the second she opened it she hated it. She hasn't nearly as enthused with the other gifts.\n\nShe has been complaining to me since about how dogshit that gift was. She was basically like.. A crock pot? I could buy that myself. What kind of gift is that?\n\nSo yeah, she takes gifts seriously. I don't know what she got her brother, but she bought me concert tickets, which is a pretty big gift to give someone. \n\nBut I don't get her hatred. This is her brother. Yeah, they're close. A tight-knit family. But it seems like a fine gift to get from your brother? \n\nI said my sister gave me a coffee machine once, and she said that was a really bad gift and lacked thought/origniality. But I thought it was fine? I needed a coffee machine and she bought me one. Great stuff.\n\nBut yeah, she was complaining to me again tonight and it's been like... a week since her birthday.\n\nSo I told her I don't get her hatred for the crockpot. It's something she uses everyday, and she should be more grateful that her brother took time out of his day to get it for her. I mean, he's a student and doesn't have much money but bought her something she needed.\n\nShe did not like what I said. She said no way in hell she's going to be grateful and that it's a bad gift. She said if I want to accept low effort gifts, that's my business, but she's not going to be grateful.\n\nShe has been mad at me since this happened. AITA?\n",
        "num_comments": 421,
        "comments": [
            "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) said my gf should be more grateful (2) she said it was a bad gift and there’s no way she should be grateful for it and is mad at me for not supporting her\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*",
            "NTA, I don't respect people who treat gifts like your gf, they are not worth my time nor money and you will have to deal with this crap for the rest of your relationship, she is ungrateful and has no clue how to be happy, how to appreciate little things, so she will drag you down every time she chooses to trigger herself and she will do that a lot.",
            "INFO: How much longer do you think you can last in a relationship where:  \n\n\n a) you're filled with anxiety over which gifts to get her lest it disappoint her and send her into a similar spiral of ingratitude and meanness?; \n\n\nb) your rightfully raised 'criticisms' and voiced opinions are aggressively ignored?. \n\n\n Could you ever tell this person the truth about herself without her getting angry? ",
            "That's not her love language. That's her greed  showing. \n\nShe sounds incredibly shallow,  greedy, entitled, and ungrateful.  \n\nAnd frankly,  gross.\n\nNTA.  And run.",
            "I got a box of washing powder,  cans of coke and head and shoulders from mums bf. He noticed I would always say how good their laundry smelt but kept forgetting to get some, I always drank all their coke and whenever I would stay and use their shampoo I would comment on my hair. \n\nI loved it I was so happy and it was thoughtful.",
            "NTA.\n\n>her brother took time out of his day to get it for her. I mean, he's a student and doesn't have much money but bought her something she needed.\n\nYou can see this and so can I: it's a pity that she can't.\n\n>I got her a gift she loved, thank god.\n\nThat's what a lot of this is about: setting expectations that you and others need to meet.",
            "NTA he brother took the time to notice that her crockpot broke, knew that she used it regularly, and replaced it before she could. The gift is thoughtful and useful. Is she conflating the cost of a gift with the effort of the gift? Because getting you concert tickets is pretty low effort but probably expensive. If she thinks the only gifts worth giving or getting are expensive ones then I would say she has seriously missed the point of gifts. That said, this one is not a keeper, throw her back. And before you say this isn’t the sort of thing to break up over, pretend her brother is her son. Would the way she is treating her brother’s efforts and thoughtfulness be an acceptable way to treat your child? Because her behavior and attitude are seriously unlikely to change.",
            "NTA and you should RUN not walk away from her right now it’s the beginning of the true colors she sounds like a complete immature brat",
            "NTA, I get wanting gifts to be meaningful etc but I think her idea of a “bad gift” is a bit warped. With the idea of the crock pot in mind, if someone gave me a gift of something so that I didn’t have to buy it myself, not only do I appreciate the thought of the gift, I appreciate that someone has saved me some trouble, no matter how big or small. If she’s really about gifts being thoughtful, I think she defines a thoughtful gift differently.",
            "NTA for telling her to be grateful for a gift. \n\n\nUnless she changes your life together is going to be miserable as tension builds each birthday, Christmas, mother's day, wedding anniversary in fear of getting  the wrong thing.  \n\n\n\nAnd, if you stay together for years and years you'll find it more and more difficult to find that perfect gift. Your anxiety will be perpetual. Her sulking continuous.\n\n\nGood luck. "
        ]
    }
}