{
    "Welcome!": {
        "title": "Welcome!",
        "score": 294,
        "url": "https://www.reddit.com/r/AmITheDevil/comments/z588ky/welcome/",
        "content": "Welcome to r/AmITheDevil!\n\nThis subreddit is a place for crossposts where a poster is obviously an asshole and to discuss them here. Unlike the name of this subreddit the poster does not have to be a literal devil with horns to fit here. We let posts stay up here often depending on the top comments of the original post: if they agree that the poster is an asshole. If they don’t: please crosspost it to somewhere else, for example r/AmITheAngel. \n\nWe ask you to please read and follow the rules. Here’s an overview:\n\n* Don’t brigade: don’t comment on the original post. Don’t upvote/downvote the original post. Don’t go after the original poster in DMs or in previous posts of theirs. We have a no tolerance policy for this rule. \n\n* Stay on topic: this subreddit is for discussing the crosspost and the poster. Stick to that topic, please.\n\n* Don’t repost: please check the subreddit before crossposting to ensure you’re not reposting.\n\n* Civility: try to remain civil in the comments. We understand that discussions can get heated. You won’t be permanently banned for this unless you’re repeatedly being uncivil.\n\n* No shitposts: this is only a place for crossposts. Don’t make up fake posts. Don’t ask here if you’re an asshole/devil. Go to r/AmItheAsshole etc. for that. \n\nHope you have a good time here!",
        "num_comments": 1,
        "comments": [
            "\n[Hi!](https://images.app.goo.gl/jMiZEuW8Qrykw3sdA) Just a quick reminder to never brigade any sub, be that r/AmItheAsshole or another one. That goes against both this sub's rules as well as Reddit's terms of agreement. [Please](https://images.app.goo.gl/vwH65TJMyMk9NSNo8) keep discussions within the posts of this sub.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmITheDevil) if you have any questions or concerns.*"
        ]
    },
    "“Children cause divorce”": {
        "title": "“Children cause divorce”",
        "score": 192,
        "url": "/r/AmItheAsshole/comments/1dqvd6u/aita_for_a_joke_i_made_towards_my_adult_children/",
        "content": "",
        "num_comments": 79,
        "comments": [
            "Anyone who blames their divorce or near-divorce on their children is utter trash. Those poor kids.",
            ">What's wrong with not wanting kids who rely on drugs to live? If kids can't drink or smoke until they're 21 it should be the same for other medications.\n\nBecause kids are still humans, and don't always make the fucking things needed TO live. Why the hell do people treat mental health and mental health meds like some nasty taboo secret. They'll take meds for diabetes, pain or the heart, but the second it's for mental health you're weak and you don't need those. I'm so damn sick of that argument",
            "I hate when people say kids were hard to raise.  Well the kids didn't force you to have them,  clown  Clown behavior ",
            "The nephew 100% knew what would happen when she posted here lol",
            "Her comments are staggeringly evil.",
            "My dad sometimes made a similar joke about disliking us all equally. The difference is, we were all completely secure in the knowledge that he loved us\nIt's only a joke when you can be sure it's not true. This person layered insecurity on top of insecurity.",
            "The daughter brings up the favouritism and *this* is how she deals with it? Yuck.",
            "will never understand the they both fell silent and i got nervous so i decided to extend the joke attitude. like if they fell silent that means the joke has ended. it always seems to happen when people make asshole jokes too not like innocuous duds that just dont land",
            "My dad sat my brother and I down once and told us we were the cause of all of his fights with our mom. It was in the roughest stretch of their marriage (in my memory at least) and all of their fights were because my dad was grieving unhealthily and my parents were working together so they never got a break from each other. Ill never forget how shitty it felt.",
            "It says a lot about the relationship that their first reaction was to go quiet when she joked about regretting having them equally, because most families I know the kids would have realized that was a joke and they would have laughed along. Then she made it 10 times worse by trying to justify her comment instead of going oh my gosh, I'm so sorry that was just a joke."
        ]
    },
    "His wife is making our affair difficult.": {
        "title": "His wife is making our affair difficult.",
        "score": 174,
        "url": "/r/TrueOffMyChest/comments/1dqvu8q/affair_is_killing_me_slowly/",
        "content": "",
        "num_comments": 60,
        "comments": [
            "An adult having a decade long affair that can't say fuck is a red flag right off the bat.",
            ">I feel like past week we were 100% friends with benefits only.\n\nI owe an apology to Chompers McDumDum. I have accused you of being the dumbest creature on earth several times, and I now see the error of my ways. This idiot seems to legitimately think she means something to him, that this is an actual relationship, after **9 years** of being the side piece. Even as he outright, blatantly chooses to spend time with his wife and prioritize her emotions over OOPs, OOP still thinks they will have a happily ever after.",
            "So he's been cheating on his wife with OOP for 9 years... but if he proposed to her, she wouldn't hesitate to marry him. I wonder if she'd feel blindsided when he would inevitably cheat on her too? Or does she think she's special, somehow?\n\nHe's the love of her life, and she's his dirty little secret. I don't know how she can delude herself into thinking the last decade has been amazing.",
            "can't believe someone can waste their twenties being a side chick.",
            "Wives are so inconsiderate of the needs of their husbands mistress.",
            "You've had this affair for nine years, and he's still married. There's a DJ Khaled meme with your name on it, sis.",
            "Should certainly see the other woman subreddit then because its filled with these sorts of posts. As someone who was cheated on in a relationship, this kind of post brings up -100 sympathy from me.",
            "Being a side chick for almost a decade is so deeply embarrassing.",
            "Because Im petty, I hope it speeds up the job.",
            "9 years and she still doesnt get it. Its insanity at this point"
        ]
    },
    "Asked for a hand knitted blanket but…": {
        "title": "Asked for a hand knitted blanket but…",
        "score": 23,
        "url": "/r/AmItheAsshole/comments/1dr1ysq/aita_i_asked_my_sister_to_make_me_a_hand_knitted/",
        "content": "",
        "num_comments": 38,
        "comments": [
            "She can gtfo. I don't knit but I crochet a lot and embroider sometimes. Any sort of fiber craft takes a shitton of time and thought into it. If you ask something from me and I spend 40 hours working on it just for you to not like it and having an attitude, I'm gonna be real petty and take it back+never make you anything ever again (unless you're my brother or my lil cousin).",
            "Why I no longer make or gift hand made items. People simply dont appreciate. I a have friend telling me to reopen my Etsy store and sell again but like no. You dont make enough money and people are wild.",
            "Aw I like the blanket lmaooo",
            "I'll be honest: I don't like it, either. Definitely wouldn't choose it.  But I also wouldn't ask someone to hand-make something like that for me for free in the first place.",
            "Dude can knit his own damn blanket. I get its not to everyones taste but he asked for a rather time consuming gift and then took a shit on all that effort",
            "I'm a knitter, crocheter, and crafter of all kinds. I appreciate the time and effort of a handmade blanket. OOP was wrong to let the crafter think for even a second that the blanket was anything less than an instantly treasured heirloom. That said, I also think it's ugly as sin and OOP would have been perfectly reasonable to have been quietly disappointed in the color choice.",
            "Quick question because maybe Im just out of touch, but why are the colours homophobic?",
            " i mean imo the blankets is kinda cute. its not ugly but its not orettt",
            "And it's so obviously she doesn't knit OR crochet.  Hunter green FABRIC?  Does she have any clue how sparce even getting YARN is anymore to quibble over getting it from a national chain that actually have any?",
            "And the absolute stupidity of trying to sell a blanket in mid summer for the northern hemisphere."
        ]
    },
    "He doesn't like my \"perfect\" body? 😱": {
        "title": "He doesn't like my \"perfect\" body? 😱",
        "score": 416,
        "url": "/r/AmItheAsshole/comments/18shthq/aita_for_saying_i_told_you_so_to_my_obese_friend/",
        "content": "",
        "num_comments": 218,
        "comments": [
            "TLDR; Why does this guy like my friend instead of me",
            "Just wanted to say that Im a runner and I still trip all the time when running/walking, sometimes it just happens",
            "I remember this post. Fucking apparently working out makes you incapable of falling.",
            "How does being thin make you immune to gravity?",
            "Why do people treat being unhealthy like some big moral failing like. Health isnt a morality thing. Its also very difficult to control. OP doesnt know if Natalie has any health conditions or other shit making it incredibly hard to lose weight, but even if she isnt- like, who is she hurting? We all do a ton of stuff thats not optimal health wise, its a morally neutral act. Obviously, being healthy is better, but thats because its better FOR YOU bc being unhealthy sucks and very few people want to be unhealthy. Shaming people for having less than perfect health doesnt help them!",
            "Oh no. She was eating CARBS?!?! What a monster. An intervention should be arranged. /s",
            "Its weird how people always have such specific height and weight estimations for their Fatty Fat Fat friends. Maybe this is just me but Ive never been able to pinpoint how tall someone was or how much they weighed in numbers, its just sort of like Theyre tall, or short. Skinny or fat.",
            "Yeah that was 100% jealousy over her friend having a hot boyfriend",
            "Heres where I may be the asshole Nono, this sentence needs to go at the beginning.",
            "OOP has a point. NFL players literally NEVER slip on the field. Like ever. Not even 3 players who torn their achilles just this past season."
        ]
    }
}