{
    "Monthly PM Sticky Thread": {
        "title": "Monthly PM Sticky Thread",
        "score": 16,
        "url": "https://www.reddit.com/r/amiugly/comments/1d59yi9/monthly_pm_sticky_thread/",
        "content": "Private advice/rating for those who don't want to post their pictures. First such thread was [here](https://www.reddit.com/r/amiugly/comments/4qpaub/private_advicerating_for_those_who_dont_want_to/) and the others are [here.](https://www.reddit.com/r/amiugly/search?q=monthly+pm+sticky+thread&restrict_sr=on&sort=relevance&t=all)",
        "num_comments": 50,
        "comments": [
            "Sure, I already get pms",
            "19M, Rising College Sophomore. Looking for advice on things to improve and general rates. Haven’t had any romantic attention in my life.",
            "I already get PMs so might as well keep em coming.",
            "M37. If that's not too old, I'm happy to help with a private rate or review for women 18+.",
            "Okkkk need a super honest pm feedback. 21f and ive been single for a year. i just want to know where i stand",
            "18M , if anyone isnt feeling good about  everyone seeing urself or not confident enough to post here \n\n\nI can give you my opinion on your looks  \n\n\n I will try to tell you where you can improve .....",
            "[deleted]",
            "I (m26) Can give some honest advice if you want !",
            "F26 - will rate honestly",
            "21m I don’t think I’m ugly but I struggle to find a healthy relationship need some feedback on personality and looks pls🫶🏼"
        ]
    },
    "A verification photo is REQUIRED for this sub.  All posts without a verification photo will eventually be removed after it's flagged by our eagle eye Redditors.  You are more likely to get a response when people know the photo has been verified and not just some seemingly random catfish photo.   ": {
        "title": "A verification photo is REQUIRED for this sub.  All posts without a verification photo will eventually be removed after it's flagged by our eagle eye Redditors.  You are more likely to get a response when people know the photo has been verified and not just some seemingly random catfish photo.   ",
        "score": 18,
        "url": "https://www.reddit.com/r/amiugly/comments/1dog4rg/a_verification_photo_is_required_for_this_sub_all/",
        "content": "A sincere THANK YOU to all the Redditors who help out the sub by flagging and submitting various reports to us.  We are all volunteers here and can be busy at times but we will eventually get to them and deal with it as best as we can.\n\nContinuing to submit a post without a verification photo will lead to permanent ban from this sub.\n\nPlease read the sub rules before posting.\n\n[https://www.reddit.com/r/amiugly/about/rules/](https://www.reddit.com/r/amiugly/about/rules/)",
        "num_comments": 1,
        "comments": [
            "Hello /u/I_can_vouch_for_that. Please be familiar with our rules [HERE](https://www.reddit.com/r/amiugly/about/rules/)\n\nPlease be aware of rule 1 which is that all posts must include a verification photo otherwise your post will be removed. If this isn't included please delete this post within 2 hours and make a new one. If its more than 2 hours then this post will count towards your 1 post per month. Take a selfie showing you holding a **HANDWRITTEN** (no editing) note / paper with **ALL** 3 of the following:\n\n* **username**\n\n* **today's date**\n\n* **this sub name (amiugly or AIU)**\n\nYour face must be visible in all photos and your hand should be visible holding the sign. It is preferred to have your first photo as your verification photo but not required. Posting without following this rule could lead to a permanent ban.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/amiugly) if you have any questions or concerns.*"
        ]
    },
    "need to know.. 20f": {
        "title": "need to know.. 20f",
        "score": 456,
        "url": "https://www.reddit.com/gallery/1dqu51u",
        "content": "hi i dont get any attention from men so wondering what u guys think and if u think i can improve anything!! im 5’4 and very shy around guys but im super geeky and funny (i hope)",
        "num_comments": 333,
        "comments": [
            "Stop the duck face",
            "Cute but the duck face makes you look like a moron",
            "You're not ugly, but you give off immature vibes and low confidence.\n\nIf you're aiming for boys around 18 -23, that might appeal to them.\n\nAnyone older will probably be turned off by it.\n\nWork on yourself.",
            "Very attractive, but you’re not doing yourself any favors with the duck lips and piercing.",
            "Stop the damn duck lips, get the ring outta ya nose, and smile, those 3 things will make a big difference.",
            "Duck face isn’t it. \n\nAlso men just aren’t going to approach in person as much these days. \n\nThere’s too many mixed signals and it just isn’t worth it. \n\nAs a man you can be giving me clear as day googly eyes but I’m not going to make that move anymore. My interest has to be extremely peaked for me to be willing to take that risk now a days",
            "Not ugly, love yourself",
            "🤘🦆",
            "Stop with the faces, that's how children take photos. If you want attention from men, you may look at how you present yourself.",
            "Good looking but don't do the duck face ever"
        ]
    },
    "27F I'd like to know if I am": {
        "title": "27F I'd like to know if I am",
        "score": 54,
        "url": "https://www.reddit.com/gallery/1dr2mzp",
        "content": "Turning 28 in October. Please feel free to let me know if there's something I could improve.\n\nThanks!",
        "num_comments": 55,
        "comments": [
            "Hello /u/BubblesInDaHouse. Please be familiar with our rules [HERE](https://www.reddit.com/r/amiugly/about/rules/)\n\nPlease be aware of rule 1 which is that all posts must include a verification photo otherwise your post will be removed. If this isn't included please delete this post within 2 hours and make a new one. If its more than 2 hours then this post will count towards your 1 post per month. Take a selfie showing you holding a **HANDWRITTEN** (no editing) note / paper with **ALL** 3 of the following:\n\n* **username**\n\n* **today's date**\n\n* **this sub name (amiugly or AIU)**\n\nYour face must be visible in all photos and your hand should be visible holding the sign. It is preferred to have your first photo as your verification photo but not required. Posting without following this rule could lead to a permanent ban.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/amiugly) if you have any questions or concerns.*",
            "As if you don't know",
            "if you are what?",
            "This a joke?",
            "Bad manicure!",
            "Wtf is this on your knees pictures 😂😂",
            "Ffs you know you’re not",
            "[removed]",
            "[removed]",
            "You are beautiful honestly I don't understand why you would think otherwise"
        ]
    },
    "22 y/o female Be honest am I attractive? I am wondering what I could do to improve my appearance. Thank you *verification is at the end of the post* ": {
        "title": "22 y/o female Be honest am I attractive? I am wondering what I could do to improve my appearance. Thank you *verification is at the end of the post* ",
        "score": 243,
        "url": "https://www.reddit.com/gallery/1dqr6g2",
        "content": "The verification is at the end of the post I couldn’t figure out how to flip it I have gotten my post removed like 3 times because I haven’t done it correctly but ITS ME I PROMISE ",
        "num_comments": 190,
        "comments": [
            "Hello /u/No_Appearance_5243. Please be familiar with our rules [HERE](https://www.reddit.com/r/amiugly/about/rules/)\n\nPlease be aware of rule 1 which is that all posts must include a verification photo otherwise your post will be removed. If this isn't included please delete this post within 2 hours and make a new one. If its more than 2 hours then this post will count towards your 1 post per month. Take a selfie showing you holding a **HANDWRITTEN** (no editing) note / paper with **ALL** 3 of the following:\n\n* **username**\n\n* **today's date**\n\n* **this sub name (amiugly or AIU)**\n\nYour face must be visible in all photos and your hand should be visible holding the sign. It is preferred to have your first photo as your verification photo but not required. Posting without following this rule could lead to a permanent ban.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/amiugly) if you have any questions or concerns.*",
            "Yea, definitely attractive. Natural beauty. What can you do? Try to grow some confidence?",
            "I don't have to swipe through 20 pictures to see that, and people who think they're ugly don't even have 20 pictures of themselves. You're good",
            "My first thoughts upon looking at your photos. She's very attractive with a great smile and nice eyes. Very woman-like. I don't see what needs to be changed.",
            "You have pretty eyes, cute dimples and freckles, a nice body. Nothing really ugly about you. Pretty attractive actually.",
            "Wanna improve.  Stop these inane posts re looks. Your attractive but less so when showing vanity",
            "If you think that you are not attractive... You're in the wrong country lmao 😂.Come visit any asian country and they will treat you like a princess's crown ❤️ 😂 \n\nBTW you look great, a solid 9/10 ,(there's always a room for improvement iykyk...)",
            "Social media has everyone second guessing themselves, even more so with the younger generation.",
            "There’s nothing to improve looks wise. You have an adorable face and great figure. It’s all in your head. That’s the only thing you need to improve. Your self perception. Good luck w that. Just please don’t ruin your appearance w horrible plastic surgery",
            "I suppose show a bit more confidence in yourself, otherwise I se no reason to hange. :D ABSOLUTE STUNNER! GORGEOUS!"
        ]
    }
}