{
    "Am I wrong for really disagreeing with something my couples counselor said?": {
        "title": "Am I wrong for really disagreeing with something my couples counselor said?",
        "score": 86,
        "url": "https://www.reddit.com/r/amiwrong/comments/1dr6ljh/am_i_wrong_for_really_disagreeing_with_something/",
        "content": "My partner is a veteran with PTSD, anxiety, and a few other mental health issues. The VA recommended we do couples counseling, and today was our second session. The therapist said something today I really don't agree with, but I want to know if I am in the wrong for feeling this way. \n\nBecause of my partner's mental health issues, he can be very selfish and not consider my needs sometimes. I have been hoping that therapy would help him with that, and understand my point of view better. \n\nAn issue that has been causing the most arguments lately is that he doesn't help me clean. I have to nag him, and sometimes that doesn't even work. We both work full-time. His job is just very physical and busy in the summer, and he sometimes works 14-hour days. This is just in the summer; he doesn't work much in the winter. \n\nI work from home, but I am also a full time college student. I still make time with the little time I have to clean the house. \n\nWhen I ask him to help, I only ask for small things to help me out. I will clean the entire house and only ask that he wash the dishes in the sink and take the trash out. I don't demand these get done the second I ask about it or even the day I ask about it. Once five days have passed, and the trash is still sitting there, I get angry. \n\nI brought this up in therapy today and mentioned that it also bugs me because I go out of my way to do things for him, but he doesn't consider me. \n\nHe knows I have trauma from growing up in a hoarder house, and he doesn't care to think about me. \n\nThe therapist said that my \"need\" for the house to be clean is my problem because of my trauma and that I need to compromise with my partner. He said that my partner doesn't choose to work, but I chose to take these summer classes, so my stress is my own fault. \n\nThis rubbed me the wrong way because I don't feel I am asking for a lot. \n\nI get that taking summer classes was my choice, but I graduate in December, and I can help our family financially when I get this degree. The therapist said I need to compromise, but what about my partner? How is it unfair for me to ask for help? Why do I need to compromise when I have been sobbing to my partner, telling him I feel like I'm drowning?\n\nI really want to improve the relationship, and I know that I am not a perfect partner. There are things I do that are wrong, but I don't feel like I am wrong in this situation.  \n\nI liked the therapist up until this point, but now I feel a little nervous. I also wanted to know if I mistook what he said. ",
        "num_comments": 44,
        "comments": [
            "That is a load of shit",
            "Where's the compromise? You stop asking him repeatedly to clean the house and he will...?",
            "You both live in the house you both need to keep it clean",
            "Not wrong. That therapist is way out of line. And your partner does choose to work. And he chose his profession so its not your fault he works 14 hour days. Getting a degree to further your career so you make more money isnt less work than what your husband doesits just different. You arent asking for a lot and plenty of men are more busy and do way more at home. Im worried that now the therapist has encouraged your husbands behavior. Asking to take out the trash and do dishes while you clean the entire rest of the house and work and go to school is not unreasonable.",
            "Not wrong.. get a new therapist. Asking the adult you live with to do the dishes and take out the trash is not an unreasonable request. It's kinda of ridiculous, actually.. His issues/trauma has nothing to do with trash or dishes, unlike yours. He has no consideration for your feelings/mental health, yet you are supposed to cater to his? I think you're getting the short end of the stick here, my dear. You need to ask yourself if you really want this to be your life? Personally, I would throw out the whole damn man. I don't need any more children to take care of, nor do I care to be with someone who obviously really gives no fs about me..",
            "Everyone living in a house needs to help keep it clean.\nThat therapist isn't very good.\nYou're already compromising by doing the bulk of the house work.",
            "NTA, stop cleaning up after him and for us on yourself, see how long it takes before that becomes a problem for him and then he realises the therapist is wrong and its not your need for cleanliness its the reality that if it doesnt get done the house is a mess.",
            "You two should be splitting anything that you would have to do if the other wasn't there. If you weren't there, he'd have to do it ALL by himself.",
            "There is really no point with a therapist like this. It is already decided! You are just being instructed. It's more of a teacher or boss than a therapist. Marriage is about compromise. And by definition, that comes from both sides. Why only you? Ask that question of your therapist. Make sure it's in the form of a question. Make everything a question. Make them answer. You're paying them. You may want to switch therapists. Especially if you don't get good answers to your questions.",
            "Sounds like the same garbage that was foisted on me while I was still married to my ex.   He worked 6am to 3pm as a postal worker.  He got home and vanished into his man cave.  He never helped with kids or cleaning. But expected me to do it all. I, too, worked outside the home. And came home to cook dinner, clean up, and get the kids to bed. He never emerged from the mancave, unless it was to eat or go to bed.  After I finished cleaning up , I had to prep the meal for the next day..  when we got together with our friends, he complained about how  the house was.  So \"we\" all decided that if I were better at cleaning, he would spend less time in his mancave on his computer. So basically, I had to do even more, and he got approval to ignore us all., I was done.  He became more violent, I filed for divorce.   \n\nNo, op, you are absolutely not wrong . For disagreeing with a terrible counselor.  Time to be done.  Let him have his own place."
        ]
    },
    "AIW - Held my foot out and the door smacked into partners face when he bursts in bathroom to talk to me.": {
        "title": "AIW - Held my foot out and the door smacked into partners face when he bursts in bathroom to talk to me.",
        "score": 1616,
        "url": "https://www.reddit.com/r/amiwrong/comments/1dqnw11/aiw_held_my_foot_out_and_the_door_smacked_into/",
        "content": "I (f30) have asked my partner (m29) so many times to stop bursting in on me when I'm in the bathroom, wether I'm using the toilet or in the tub. I don't mind if he knocks and then comes in but it drives me insane when he just strolls in or bursts in. \n\nToday I was on the loo and he literally kicks the door open (he was joking around) to tell me something , I held my leg out and the door bounced off my foot and hit him in the face quite hard. He stormed off and called me a bitch. I explained my natural reaction was to hold my leg out because the door crashing open startled me. He won't speak to me now and insists I'm the asshole. \nAlso just to add, we live in a flat with my brother (m29) aswell, which is why I prefer he knocks and doesn't burst in or stroll in on a limb.\n\nSo Reddit, AIW?",
        "num_comments": 483,
        "comments": [
            "What the f. Girl just lock the door. Yall need to have a talk about boundaries.",
            "So you're a bitch for having a natural reaction to your bathroom privacy being intruded on, but he's not a bitch for constantly strolling in while you're trying to shit, piss, or bathe?\n\nThat would be my first and last straw dude, you don't ever mess with my bathroom time and you don't ever call me a rude name in anger.",
            "He Fucked Around and his face Found Out ",
            "Not wrong. He needs to respect your (very reasonable) boundaries.",
            "Come on you know you arent wrong and hes an asshole. Children learn to not barge into an occupied bathroom. And then the extra bullshit of him name calling! Looks like your options are barricade the door or break up",
            "Yeah, it seems like u've told him more than once not to just barge in. Your reaction was just instinctive when the door swung open like that. I mean, respect for privacy is pretty basic, especially when u're sharing a place with others. His reaction sounds a bit much for just asking him to knock first.",
            "Leave.  This will not get better.  I married one of those  \n\nNext thing you know, youll find a fricken camera in there or your bedroom, and nothing ado cause.together..",
            "Bro. If just one time this happened Im flying off the rails.",
            "Your partner is a child. Not only does he not respect your privacy or boundaries he has a temper tantrum when you enforce them. Find a grown up to date.",
            "Fuck that dude. Calling you a bitch because hes an idiot? If I were your brother Id have a couple words for him after calling you a bitch when he literally is disrespectful to your boundaries.  dafuq kinda child is he?"
        ]
    },
    "Am I wrong for refusing to let my girlfriend friend in our apartment?": {
        "title": "Am I wrong for refusing to let my girlfriend friend in our apartment?",
        "score": 60,
        "url": "https://www.reddit.com/r/amiwrong/comments/1dr7p7v/am_i_wrong_for_refusing_to_let_my_girlfriend/",
        "content": "My girlfriend has a few close friends. I've met all of them and get on with most of them. There was one friend that I had met a few times and got on well with. Me, my partner and this friend went out for drinks around 2 months ago. The friend was quite shy and socially awkward.\n\nShe thanked me for being nice to her and understanding she wasn't extroverted etc and takes a while to be comfortable around people. I told her not to worry and that I'm not going to judge her for being shy when I used to be really shy when I wsa younger. As the night went on things were going well until one point when my gf went to the toilet at one of the bars.\n\nThe friend got closer to me and tried to kiss me. I backed off before she managed to get close enough and told my gf straight away. Me and my gf left the bar and went home. For a couple of weeks they didn't speak but my gf decided to hear her out and went to meet up with her.\n\nThey talked things through and this friend apologised to my gf and told her to apologise to me aswell. My gf said they're working on mending their friendship and have been meeting up again.\n\n A couple of weeks ago my girlfriend said she was thinking of the three of us going for drinks again but I refused. I said I think it's odd she's still friends with her but I can't control her friend but what I can control is who I'm around and I don't want to be around her. \n\nMy girlfriend said I was overreacting and the friend is sorry. Last week my gf mentioned doing a movie night with this friend and asked if I would be home. I told her I was and that I don't want the friend in the apartment.\n\n My gf said I could always go out for the evening but I refused and just said if she wants a movie night she can go to her friends because I don't want her friend in our apartment. My gf said I was overreacting again and should be fine with her friends coming round but I refused to change my mind.\n\nAIW for refusing to let my girlfriend friend in the apartment?",
        "num_comments": 27,
        "comments": [
            "YNW. This friend shouldn't be anywhere near y'all's apartment. I'm shocked your girlfriend would still want to have her around",
            "Is this one of those girlfriend tests? Where she asks the friend to hit on you and see what you will do?",
            "Your girlfriend is dropping hints for a threesome. You need to sit down and talk about it, doesn't matter if you are for it or against it but it needs to be out in the open so everyone is clear about everything.",
            "You are not wrong.\n\nThis gross attempted assault is not cool and your gd shouldn't even be considering being her friend.",
            "That's not a friend. Your gf is testing you, she wants a threesome, or she's just naive/dumb as hell. Sorry. Possibly all 3.\n\nGet loyal friends. Not to sound boring. But try to find better things to do than drinking at bars.",
            "She was probably having her friend test you, and now wants to drop it cause shes happy with the answer you gave, so shed know her friend wasnt actually up to anything but now doesnt know how to get you to accept her friend without ratting on herself.",
            "Your girlfriend has a really low self-esteem. Yikes!",
            "I know it's just probably my suspicions nature but why is your GF adamant you hang out with someone who wants you to cheat is there some guilty going on I just find it off-putting",
            "Your girlfriends response to this is very strange. Why keep someone around that is obviously not a good element to your relationship.",
            "Time for a 3some baby!!! Stop being a kid."
        ]
    },
    "Am I wrong to be upset my husband still sees his AP? ": {
        "title": "Am I wrong to be upset my husband still sees his AP? ",
        "score": 229,
        "url": "https://www.reddit.com/r/amiwrong/comments/1dqzdha/am_i_wrong_to_be_upset_my_husband_still_sees_his/",
        "content": "My husband was recently caught having an affair with a woman he works with. He says he wants to work on our marriage and won’t contact her any longer. The catch is he still sees her at work as he is unable to leave his job at this time and we need the job to support our family. He says they make small talk in passing but it is platonic. Am I wrong to be upset and feel like this is unfair to me? Does anyone have experience with a similar situation and was still able to heal from the betrayal? ",
        "num_comments": 109,
        "comments": [
            "NOT WRONG. He can look for a new job, daily, until he finds one.",
            "You are not wrong to be upset but I absolutely could not work on our marriage after infidelity. But it seems you do depend on him financially, so I understand why you could be staying. He needs to start looking for a new job immediately if yall are actually serious about repairing. I dont believe its just platonic either, youre essentially letting him get away with it.",
            "I cant believe hes still your husband",
            "I left my partner for this. The fact that you took him back, and he still talks to her...red flags all over. If he really was trying to fix y'all's marriage then he should automatically not talk to her. Not even a  hi. For real. Walk away.",
            "There are so many jobs in the world. And you have one marriage. This would infuriate me. They speak platonically? F**K NO. You are not wrong.",
            "Not wrong.  He's going to cheat on you again because now he knows that you won't leave.",
            "Uh how about you respect yourself and leave your cheating dirtbag husband?",
            "hes going to cheat on you again because you proved yourself to be a doormat.",
            "I mean you can try counseling if youre trying to stay in the marriage. You guys will need to rebuild that trust because even if he did switch jobs youll always have that worry in the back of your mind that hell do it again. Youre not wrong though for being uncomfortable with it, like at all.",
            "You are not wrong. A couples therapist who specializes in infidelity work did an AMA recently. I asked her whether the cheater should leave their job when the affair partner was a coworker. \n\nShe said that the beginning of therapy is making sure the door to the third party is closed. The betrayed partner gets to decide if they need their partner to find a different job. They usually do. Ive had the unfaithful partners put up a fight about leaving their jobs and the choice I help them make is a simple one. Is the job worth the marriage?"
        ]
    },
    "Am I wrong for Disowning My Daughter After She Refused to Leave Her Boyfriend?": {
        "title": "Am I wrong for Disowning My Daughter After She Refused to Leave Her Boyfriend?",
        "score": 126,
        "url": "https://www.reddit.com/r/amiwrong/comments/1dr1bdx/am_i_wrong_for_disowning_my_daughter_after_she/",
        "content": "I (M45) My daughter (F21), has always been my pride and joy. I've worked hard to provide for her, but maybe I focused too much on my job and not enough on her.\n\nA few months ago, she started dating this guy from a modest background. At first, I tried to keep an open mind, but soon I noticed he was controlling and manipulative. He isolated her from her friends, belittled her, and it seemed like he was only interested in her for our money. I was worried sick.\n\nDespite my concerns, she stayed with him. Every time I tried to talk to her, she defended him, saying I didn’t understand. I felt desperate and frustrated. In a moment of anger and fear for her future, I gave her an ultimatum: leave him, or I’d cut her off financially.\n\nShe chose him. Heartbroken and frustrated, I stuck to my word and disowned her. I stopped all financial support and cut off contact, hoping she would see the truth about him and come back. But she moved in with him, and they struggled. I heard through mutual friends that he was treating her poorly, which tore me apart. I blamed myself, thinking if I had been more present, she wouldn’t have ended up with someone like him.\n\nher mother passed away when she was just seven years old. I’ve always tried to be the best father to her, but maybe I failed her in some ways.\n\nMonths passed without us speaking, and I started to feel guilty about cutting her off. I missed her terribly and regretted the harshness of my decision.\n\n",
        "num_comments": 112,
        "comments": [
            "this is how you end up with a severely abused, if not dead, child. they have only been together a few months and youre already ready to disown her?? how is she your pride and joy if you can let go of her that easily? when you have a child you need to be there for them through their mistakes. thats when they need you most.",
            "You're concerned that this guy is not a good person and may be abusive?  So you disowned her and have ruined your relationship with her so in the future if she is in danger from her relationship then she has no one to turn to.\nYou are so wrong and potentially putting your daughters life in danger.",
            "Reach out and ask her for a cup of coffee",
            "You feared he was trying to isolate her, so you cut contact with her  you did exactly what he wanted you to do.",
            "Damn abandoning your daughter and leaving her in the hands of an abuser really makes you dad of the year. Not only are you wrong. YTA",
            "The more you pressured her, the worse it got. That was your mistake. Reach out, apologize for being so harsh and see if you can fix it. This is on you.",
            "Seems like both of you are trying to control her.",
            "Yeah YW. you abandoned your daughter when she needs you most and you tried to manipulate her because she was getting manipulated. It seems like the reason why your daughter fell for an abuser is because thats all she knows.",
            "She likely chose him because his actions are similar to yours. You are trying to control her, as well.",
            "I don't understand the logic of this situation. He is isolating her from her friends is one of the things that you mentioned and you cut her off and stop talking to her how does that make any sense? Cutting everything else off makes sense but you want to keep in contact and let her know that the original statement is true I will gladly be here to help you but not when he's in the picture."
        ]
    }
}