{
    "Am I wrong for wanting to propose to my best friend, who I took in when she was pregnant, even though my parents don't agree?": {
        "title": "Am I wrong for wanting to propose to my best friend, who I took in when she was pregnant, even though my parents don't agree?",
        "score": 251,
        "url": "https://www.reddit.com/r/amiwrong/comments/1dlls3i/am_i_wrong_for_wanting_to_propose_to_my_best/",
        "content": "I (M26) and four years ago, everything changed for me. My childhood best friend,(F25), was in a really tough spot. She was pregnant, the father left her, and she had nowhere to go. We've been close since we were kids, and I couldn't just watch her struggle, so I took her in.\n\nAt first, it was supposed to be temporary, but over time, we got really close. I helped her through her pregnancy, was there when her daughter was born, and eventually, we fell in love. Now, they feel like my family, and I love them both very much. Her daughter even calls me \"daddy,\" which means the world to me.\n\nA few months ago, I started thinking about proposing to her. It might not be the usual way things happen, but I'm sure about my feelings and want to make our family official. When I told my parents, they weren't happy. They think I should focus on starting my own family from scratch and that my best friend and her daughter aren't part of that plan. They say I'm giving up my future for something that's not my responsibility.\n\nI've tried to explain that they are my family now and I love them deeply, but my parents are convinced I'm making a mistake. They say I'm too young to take on such a big commitment and should be with someone who doesn't have \"baggage.\"\n\nThis whole thing has caused a big fight between us. I do care about my parents' opinions, but I can't imagine my life without my best friend and her daughter. They've brought so much joy and purpose to my life, and I want to be there for them as a husband and father. I don’t feel bad about this decision at all.\n\n",
        "num_comments": 137,
        "comments": [
            "How many years have you been openly dating during the 4 years? Or is this a recent relationship?",
            "No you're not wrong. You're an adult. You can do what you want. \n\nYour parents might not ever come around and you just have to come to terms with that.",
            "Are you both officially dating? How long have you been together. I remember reading another post about a girl whose best friend proposed to her when in her mind they had never even dated before. Don't let that be you",
            "Your parents are 100% wrong.\n\nFour years ago, maybe it was true that your friend had some baggage - and you stepped up and help her carry it, and now it’s just a dusty suitcase shoved away in the attic.  This is someone that you cherish and support, and it’s been that way for more than a little while.  You might not have written the source code for the child in your life, but so what - you’re helping raise her, and she looks up to you.  (It’s not like you just met this person who happens to have a 4 year old.). You’ve had 4 years to think about it, it doesn’t sound like you’re rushing in to anything.\n\nGo for it.",
            "Er you aren't wrong but please clear something up for me. You guys are and have been dating for a while? I know that sounds like a obvious answer but you constantly refer to her as your best friend and not like a gf. So if you just throwing out a marriage without even doing the whole dating thing than you might be wrong.",
            "I wish I could connect you with my amazing stepdad. The man that I have always called dad, starting from 2.5 years old. \n\nHe made a similar decision as you are/have been almost 41 years ago. \n\nHe married a woman with a kid. Someone who came with baggage and why would he want to raise someone else's kids (never mind that she had married her 2nd husband when my dad was a kid still, so technically she had baggage too? She has never made sense) was all his mom could ask. \n\nHe told her that he chose to be my dad, no one was forcing him to be my dad, it was what he to be. He has always loved me and treated me as his daughter, just like he has with my younger sister. \n\nHe told her to stop with her bullshit (only nicer than that) and that if she had a problem with it, then it was just that, her problem. \n\nYou get to choose who you love and marry. You get to choose if you want to be that child's dad, not your parents. \n\nThey can choose to be assholes or they can choose to follow your lead and support you marrying the person you love, baggage and all.",
            "Marry her and adopt the little one if you can, Only you know how you feel and it sounds like your where your suppose to be.",
            "Question: Are you in a romantic relationship with your best friend? If not, maybe don't propose. Talk to her and find out what she wants out of your relationship, whether it's romantic, or platonic. From what you've said here, there's no sign of a  two-sided romantic relationship. If you propose to her without you both being on the same page, you could end up losing them in your life by blindsiding a proposal she isn't at all expecting.",
            "Before you propose, do feel her out.   Make sure the two of you are on the same page.  If you are,  then your parents opinion is irrelevant.",
            "Ask your best friend about her interest in dating to begin with. As to your parents, any digs, insulting tones or comments or even bad body language you walk away or hang up. Don’t engage. Don’t discuss, just excuse yourself and leave. They will catch on eventually and you get a less stressful environment either way. Win for you, loss for them until they smarten up."
        ]
    },
    "Am I wrong for Telling a Girl I Won't Date Her Because She's a Single Mother?": {
        "title": "Am I wrong for Telling a Girl I Won't Date Her Because She's a Single Mother?",
        "score": 1041,
        "url": "https://www.reddit.com/r/amiwrong/comments/1dlax0f/am_i_wrong_for_telling_a_girl_i_wont_date_her/",
        "content": "I (24M) recently met this incredible girl, Sarah (23F), through a mutual friend. From the jump, we clicked on so many levels she's hilarious, smart, and we share a lot of interests. After a few great dates, I thought we might really have something special.\n\nA couple of weeks ago, Sarah sat me down and shared something important—she has a 3-year-old son. She had him when she was young, and the father isn't involved at all. She told me she has a solid support system and manages everything well, but honestly, I was caught off guard. I hadn’t even considered the possibility that she might be a mom.\n\nI took a few days to think it over and realized that I’m just not ready for that kind of responsibility. It's not that I have anything against her or her son—it's just that I’m still figuring out my own life. I knew I had to be honest with her, so we met up for coffee.\n\nI told her, as gently as I could, that while I think she's amazing, I don’t think I’m ready to be involved with someone who has a child. I explained that it's more about where I am in my own life and less about her or her son. She seemed to understand, but I could tell she was hurt and disappointed.\n\nLater, our mutual friend told me that Sarah felt really judged and hurt by my decision. She said it was unfair to dismiss her just because she's a single mom and that I should have given it more of a chance.\n\nNow I’m feeling really conflicted. On one hand, I believe it’s better to be upfront about my feelings rather than leading her on. But on the other hand, I hate the idea that I might have made her feel bad about something she can’t control.\n\n",
        "num_comments": 763,
        "comments": [
            "You're not wrong. You didn't gut react but took time and considered it to realize that's not for you. You explained it well by telling her it's just not where you are in your life and thats both valid and very understandable.\n\nOf course she's going to feel disappointed but that's part of dating. You're both getting to know each other and decide if you fit into each other's lives. It could have been a number of reasons you didn't work. \n\nAs long as you're kind, honest, and compassionate you aren't doing anything wrong.",
            "You’re not wrong.  You handled it with kindness and maturity.",
            "Honesty doesn’t always feel good but always best in the end.",
            "NTA You don’t owe her dates when you already know it isn’t what you want",
            "NTA. Sarah and her son are a package deal.  Unless you just remained friends sharing interests (hiking, D&D, whatever) at some point she would be looking at you as a daddy figure should the romantic relationship continue. If you're not up for that best to say so now. Would Sarah rather you be one of those guys who strings her along and then ghosts her, or says hey I can only see a future for us if you dump the kid? I doubt it.",
            "Not wrong at all man.\n\n\nYou were polite and mature about it. Pretending you were interested in something you're not would have been the wrong thing to do.",
            "NTA\n\nThis should have been disclosed from the very beginning. Having a kid is a big deal and can make make big changes. You are well within your right to say you don't want to date someone with kids.",
            "I was a single mom & anyone I was interested in knew it from the start. I don’t understand why she hid it at first.",
            "When you date someone with kids, in a lot of ways the kid comes first. If it gets serious and you marry her, you are taking on the responsibility of a parent. It’s not judging her, you’re just not ready for that level of life changing responsibility and it’s very respectable that you acknowledge that instead of leading her on.",
            "Of course you aren’t wrong.  You are allowed to not date someone for any reason — it’s called personal preference."
        ]
    },
    "AIW for being miffed I was gifted a loaf of sourdough bread for my birthday? ": {
        "title": "AIW for being miffed I was gifted a loaf of sourdough bread for my birthday? ",
        "score": 414,
        "url": "https://www.reddit.com/r/amiwrong/comments/1dlff8t/aiw_for_being_miffed_i_was_gifted_a_loaf_of/",
        "content": "I (34F) had a birthday dinner last night that my partner (33M) and I covered the cost of the food for all guests, all they needed to pay for was any drinks they wanted. \n\n3 of the guests got me a joint gift of sourdough bread and a jar of honey from some artistrian bread cafe. \n\nI was polite and thanked them for the gift and we carried on with a nice evening but fuck I am pissed off about such a shit gift! Who the fuck gifts a loaf of fucken bread to someone for their birthday?! \n\nThe thing is I don't care for bread, have never mentioned bread before in conversation or made the stuff. I buy my fucken bread from the shop and put it in the freezer and use it when I feel like it (which isn't often). \n\nThey were even talking about it with other guests saying, when you don't know what to get someone get them consumables- like it was the best gift idea ever... It is fucken bread! \n\nAIW for being annoyed, miffed and just pissed off these people got me a loaf of fucken bread that cost no more than $20 as a gift between 3 of them when my partner and I shelled out $60 to feed all 3 of them last night to celebrate my birthday?\n\n\nEdit:\n\nI am Australian \n\nThe \"gift expectation\":\nPpl seem to think I was expecting gifts from everyone. That is not true, there was several who didn't get me a gift and I don't care. As I have said numerous times I would have preferred nothing. I am upset because this gift is so left field of me it has me questioning myself and their motives. \n\nIf anyone is curious out of the 6 people who came I got 2 gifts; the bread and a gift voucher from someone else. \n\nThe 3 people:\nThe three people are fine financially. Two are a retired couple and one is a single woman. And yes they were told on the invitation that food was covered just buy your own drinks.\n\nWhy I don't like the gift:\nI don't appreciate bread at all it is just a good item I will eat if it is there, but I don't care for it or its fancy versions. I also don't like honey that much that I would use it at home. I will have it when I go out and that is it. The honey was local raw honey. \n\nThe place we are at being \"cheap\":\nIt was an all you can eat Mongolian BBQ restaurant, it is \"cheap\" because all you have to choose from is frozen meat brisket, sliced vegetables and 6 sauces. It wasn't buffet food with oodles of options. It is just a meat/veg option to be bbq by the staff for you. We choose this food options because people can have as much or as little and what they wanted and leave feeling satisfied.\n\nThe tldr truma around my birthday:\nNarc parent shit birthdays my whole life, these ppl know birthdays are an interesting time for me.\n\nWhy we paid for people's meals:\nMy partner and I recently moved to the city and before we moved I lived in a country town that is 35 minutes from the city. And all but 1 of the guests we invited live in the country town, they were driving down to see me I wanted to make it worth their while. Not that it matters but the 1 person who lives in the city we picked them up and dropped them off home. \n\nEdit 2:\n\nI was given the bread because one of the 3 people have it all the time at a cafe with eggs on it. They have never brought it themselves. They did ask if I tired the honey and I said honestly honey isn't my thing and they just told me to put it in cakes or tea (I never drink tea). ",
        "num_comments": 344,
        "comments": [
            "Maybe they were all a little short on dough?",
            "What kind of gifts did you give them for their birthday? ",
            "I was always brought up with the attitude of ‘don’t expect a gift, even if you decide to spend any amount of money on someone, don’t expect anything in return. If they happen to get you something, fantastic it’s a bonus you didn’t expect to get’  perhaps maybe you need to focus a little less on what presents/gifts they give you and more on how they are as a friend in general? \n\nAlso $60 is pretty freaking cheap to spend on 3 people for dinner in aus, be thankful you don’t live in Sydney cause that would of cost you like x5 more 😆",
            "Since you invited them to dinner, maybe they were just trying to bring something that contributed to the meal? I stopped expecting presents a long time ago as an adult, people showing up to the party is the gift.",
            "I would love to have the recipe for fucken bread.",
            "My husband literally this weekend bought real sourdough bread (as opposed to what is often called sourdough but doesnt actually use the specific starter unique to sourdough - thanks a lot fodmop diet!!) and it was from a very nice bakery in a small bougie town. It cost $30 and, while I didnt buy it because I couldnt afford the extra, it was being offered with a local farm artisan flavored honey which was $25. So, if it was a $55 gift in my nearby small but fancy town, it could be even higher than that in a bigger city, I dont know where you're located.\n\nAll to say I would have been genuinely thrilled to save myself $60 and have tea with bread and honey but that's just me I guess.\n\nLucky for us Trader Joes has the real thing for much cheaper than that bakery but it worked in a pinch.",
            "37M. I would love a fresh sourdough loaf.",
            "You're wrong. A fancy artisanal loaf and honey is a perfectly acceptable gift for an adult. It's not like it's supermarket white loaf. If I have to gift my adult friends, most of them live in apartments and won't appreciate useless clutter. When they do need something, like a new pan or some other material thing, it's usually either too expensive to give an acquaintance or the kind of thing people prefer to buy themselves (eg clothing). \n\nFood won't take up space for long and bread is very neutral unless you're a celiac. It sounds like you just aren't as close as you imagined to these people.",
            "So… are you inviting people for their company or for their gift potential?",
            "I’m sorry, but if you still expect some extravagant gift for your birthday at the age of 34, I think you’re wrong. I’m in my 30’s and a nice evening and better company suffices for me."
        ]
    },
    "Aiw for telling my mom I would not be my sisters care taker when she becomes unable to do it herself ": {
        "title": "Aiw for telling my mom I would not be my sisters care taker when she becomes unable to do it herself ",
        "score": 1013,
        "url": "https://www.reddit.com/r/amiwrong/comments/1dl3vwz/aiw_for_telling_my_mom_i_would_not_be_my_sisters/",
        "content": "I(17m) have a 12yo sister who is severely mentally and somewhat physically disabled and I’ve had to help my mom take care of her. I have to help bathe her, feed her and a bunch of other things. My mom recently asked to talk to me and basically said that when she gets to the point where she can’t take care of my sister that I was going to be her primary care taker. I told her that I wasn’t going to do that and I’ve already sacrificed a good chunk of my life taking care of her. I want to be able to properly live my life without having to be tied down to be her caretaker.\n\nMy mom doesn’t want to spend money hiring a caretaker and doesn’t trust any extended family with her care so she says that I’m the only option and she’s pissed that I won’t do it. I love my sister but I don’t feel I should have to spend my life looking after her. My mom said I’m selfish that I won’t help her and I feel that she’s selfish for expecting this of me.",
        "num_comments": 255,
        "comments": [
            "NTA Your sister's primary carer (your mom) is responsible for ensuring care continues. She can't just make you do it. She needs to ensure proper, qualified care. She's already parentifying you. It must be really tough, but it's absolutely not your issue.",
            "You are not wrong. I’m sure your mom is concerned about what may happen to your sister eventually but she’s out of line by trying to bully you into taking care of her. \n\nYou have already gone above and beyond to help care for her but you have the right to live your life as you see fit. There are resources available to your mom. Perhaps you could help her find some in your community. \n\nRespite care would probably help her immensely since caretaking takes a huge toll, as you know. If you can get your mom to sit down and calmly discuss this, do so. \n\nNo matter what-it is NOT selfish for you to want to live your life and not be tied down with a child that isn’t yours.",
            "She is your mother's concern, not yours.\n\nThere are places where your sister can live and have the care she needs.\n\nThese can be private facilities where you have to pay and there are facilities that states run.\n\nYou need to start looking into those now. I am going to assume your mother hasn't done so.\n\nI would also tell your mom that she had you sister, she is HER mother and it is her responsibility to see that she is taken care of when your mom gets too old to help any further.\n\nShe has no right to want to thrust this on you.\n\nABSOLUTELY NONE!\n\nGet out as soon as you can, go off to school and go live your life.\n\nMaybe in a few years, after college or not, you will have a great paying job and you could help pay for a place for your sister to live and be taken care of.\n\nUltimately, you don't owe her your life in servitude.\n\nI get that you love her but she IS your mother's responsibility.",
            "Her other option is a group home.  It is not your responsibility to take care of your sister for life.  Your mom is selfish.  One of my biggest fears was having a disabled child, because I would spend every day until I died worried what would happen when I was gone.",
            "Get out and live your life.  Go to college.  Now.",
            "I have three kids, two older daughters and a younger son with Down syndrome. While he does okay, later in life he will need someone looking out for him. I have taken all steps to ensure that when I can no longer provide care, my daughters will NOT have to look after him. He was my choice, not theirs. I have asked that they make important decisions for him when I cannot, which amounts to some form of 'custody'. But he will NOT live with them (unless they want him to) and they are not to build their life around him. If they want to move to the other side of the world, they have that freedom.\n\nYou are not responsible for your sister and it's not fair for your mom to assume that. Also, when you get a little older, it's not unreasonable for you to ask if your mom is the best person to look after your sister. Sometimes, moving to a group home brings out a lot of independence that doesn't get a chance in the parental home. \n\nYou can be a good daughter, but that doesn't extend to being a lifelong 'parent' to someone who is not your child.",
            "Not wrong at all.  You are entitled to have your own life.  Your mother is being unfair, asking you to spend your future taking care for your sister",
            "NTA.  Your sister is tour mother's responsibility, not yours. As you said, you have already sacrificed so much for her. Start making plans not to get away when you are 18. College, far away and stay away. The military,  an apprenticeship, anything as long as it is many hours away. And don't tell your mother where.",
            "not wrong, that is her 12 y.o. to raise.",
            "You're not wrong. I'm in the same boat. Your mother has placed you in a position where you don't necessarily see your sister as a sibling, as you've had to be a caretaker for her since you were 5. It's not wrong to not spend your life looking after a child that you did not choose to bring into this world. Your sister is your mom's responsibility. You deserve your own life."
        ]
    },
    "Update: Am I wrong for being upset that my gf of 8 years now wants sex?": {
        "title": "Update: Am I wrong for being upset that my gf of 8 years now wants sex?",
        "score": 397,
        "url": "https://www.reddit.com/r/amiwrong/comments/1dl6wba/update_am_i_wrong_for_being_upset_that_my_gf_of_8/",
        "content": "First [post](https://www.reddit.com/r/amiwrong/s/3ofPjcZPAX)\n\nWe had a talk.\n\nI explained to her what I did to get rid of my libido (basically I hit myself and told myself no when I got horny). \n\nShe didn't know this, I never told her because I didn't want her to feel bad for not having sex with me. I didn't want to tell her, but she insisted on knowing why I don't have a libido anymore.\n\nShe started crying when I told her. She said she was sorry she made me go through that. I told her it's not her fault, and that it was my choice.\n\nWe just held each other for a while after that.\n\nWe decided that we'd go to couple's therapy, and when I'm ready, going to see a sex therapist.\n\nShe said she's sorry for how she's been acting, and that she's willing to be patient with me. I asked her what happens if I never get my libido back? She said she doesn't know, but she said she will be patient with me.\n\nSo yeah, I'll try to get my libido back. I don't feel comfortable discussing now, but something I'll want to mention during therapy is this pressure I'm getting from my gf. Like, maybe I'm overthinking, but I guess it feels like \"she's waiting for me to have sex\", idk but when I decided to be with her I was more of the mind \"I may never have sex again\" I wasn't WAITING for my gf to get better so we could have sex, I accept the fact that I could go sexless for the rest of my life.\n\nIdk, I guess this is a discussion for later ",
        "num_comments": 208,
        "comments": [
            "Damn. Good luck. I hope you cum really hard one day.",
            "you asked her what happens if you never get your libido back and she says SHE DOESNT KNOW? dude. DUDE. you were willing to go your whole life without sex for this woman, but she's not sure about you??",
            "Looking forward to the “got my libido back and now she’s changed her mind” post.",
            "Imagine they finally have sex like 9 years in and it turns out they have no sexual compatibility and break up anyway.",
            "I’m sorry to say this but your relationship sounds like absolute hell. I hope everything else is incredibly satisfying and worth while because this just sounds so terrible.",
            "This whole thing sounds super unhealthy.",
            "Wow. I am sorry. This is a difficult path. Your girlfriend needs to change her mind set. You gave up sex, retrained your brain, accepted her exactly how she is. That is very noble of you. She needs to love you and accept you as you are. She says she will be patient?? She owes minimum 8 years. Good luck on the therapy. I think that is an excellent idea.",
            "Gotta love how she didn't want sex at all, so OP *LITERALLY* beat the sex drive out of himself to make her happy... and now she's not happy that he fucking traumatized himself into celibacy because, a decade later, she finally wants to get down.",
            "Something is not right here.",
            "Ain’t no fucking way."
        ]
    }
}