{
    "Weekly 'Ask Anything About Analog Photography' - Week 26": {
        "title": "Weekly 'Ask Anything About Analog Photography' - Week 26",
        "score": 6,
        "url": "https://www.reddit.com/r/analog/comments/1dn1aaa/weekly_ask_anything_about_analog_photography_week/",
        "content": "Use this thread to ask any and all questions about analog cameras, film, darkroom, processing, printing, technique and anything else film photography related that you don't think deserve a post of their own. This is your chance to ask a question you were afraid to ask before. \n\nA new thread is created every Monday. To see the previous community threads, see [here](http://www.reddit.com/r/analog/search?q=flair%3A%22community%22&restrict_sr=on&sort=new&t=all).\nPlease remember to check the wiki first to see if it covers your question! http://www.reddit.com/r/analog/wiki/",
        "num_comments": 37,
        "comments": [
            "Please consider checking out our sister subreddit /r/AnalogCommunity for more discussion based posts.\n\nOur global list of film labs can be found [here](https://www.reddit.com/r/analog/wiki/labs) if you are looking for somewhere to develop your film.\n\nGuides on the basics of film photography can be found [here](https://www.reddit.com/r/analog/wiki/index#wiki_film_photography_basics), including [scanning](https://www.reddit.com/r/analog/wiki/index#wiki_scanners_and_scanning).",
            "given that this is kodak portra 400 film afaik, does anyone know what camera could have been used for this? \n\n  \n[https://imgur.com/a/lbCNTVv](https://imgur.com/a/lbCNTVv)",
            "Do I need a large amount of storage and other space to develop my own colour photos?",
            "I'm wanting to get into developing and scanning my film on my own.  What do I need to buy?  Are the kits on amazon reliable?  I will primarily be using 35 with the rare 120",
            "I'm interested in film photography but I have some questions before I buy anything. \n\n1-I noticed most of the cameras made are really old, what's the reliability of Nikon's FM/FE or FM2/FE2 series and F3 models? Can I expect these to work for a couple years without problem more often then not?\n\n2-Some of the chemicals, at least for color E-6 and C-41 kits from Cinestill have a limited shelf life of only a couple weeks after initial use. Does this mean I should only develop color film when I have 10+ undeveloped reels to ensure I don't waste the chemicals?",
            "I got this as an introductory film camera to see if I liked the hobby before investing in another film camera. So far it’s been good, however the film counter is stuck on “S”. I can still move the counter forward and take photos. Is it actually taking photos? Could I develop the film roll when it is finished?",
            "I got a Pentax MG at a flea market a while back without a lens. What is a way to get a cheap lens? I'm kind of sick of using disposable cameras everytime because of the cost. I live in the Netherlands for some context",
            "Is there any place in India where I can ship off my roll of film to get developed and scanned?",
            "Has anyone here used Express Photo & Camera in Livonia, Michigan to develop their film? If so, could you share what their timeline and communication is like? (I shipped them a roll but haven’t heard anything from them…)",
            "Hey, I recently picked up a Pentax MX from eBay and just got my first roll of film developed, but I think there's an issue with my shutter - could I fix this myself or do I need to get it CLA'd?\n\nI've attached some images so you can see what I'm talking about:\nhttps://imgur.com/a/mD8rWXK"
        ]
    },
    "[OTW] Photographer of the Week - Week 23\n": {
        "title": "[OTW] Photographer of the Week - Week 23\n",
        "score": 11,
        "url": "https://www.reddit.com/r/analog/comments/1dqipoc/otw_photographer_of_the_week_week_23/",
        "content": "It is our great pleasure to announce that u/twonapsaday is our Photographer of the Week. This accolade has been awarded based upon the number of votes during week 23, with this post having received the most when searching by top submission: [https://www.reddit.com/r/analog/comments/1d6ziio/nikon\\_f3\\_nikkor\\_55mm\\_f28\\_kodak\\_ektachrome\\_100/](https://www.reddit.com/r/analog/comments/1d6ziio/nikon_f3_nikkor_55mm_f28_kodak_ektachrome_100/)\n\n* **How long have you been taking photographs?**\n\n>I’ve been shooting film for seven years\n\n* **Why do you take photographs? What are you looking to get out of it?**\n\n>I take photos to help me stay connected to the world outside of my mind. if I can conjure up portals to & from my favorite memories, life feels a little bit more manageable. \n\n* **What inspired you to take this photo?**\n\n>I live in a place that rarely sees storms, much less rain… so when I saw lightning, I grabbed my camera & headed for the cliffs. it was dusk, and massive thunder clouds were forming offshore. I didn’t have my tripod and happened to be midway through a roll of ektachrome, so I held my breath, started shootin’ and hoped for the best. \n\n* **Do you self develop or get a lab to process your film?**\n\n>I use my local lab, Color Services, to develop my film. Glenn & the team there have been very supportive of my work over the years and I’m happy to give them my business! \n\n* **What first interested you in analog photography?**\n\n>my interest in film photography stems from my grandpa’s old slide collection. when I was growing up, he would break out his projector and the family would look through our collective memories. eventually I was old enough to actually use his cameras & start capturing memories of my own. I’m incredibly grateful to him for giving me my first cameras & film. \n\n* **What is your favourite piece of equipment (camera, film, or other) and why?**\n\n>I could never part ways with my Nikon f3… sometimes it feels like an extension of my hand. I’ve taken some of my favorite photos with it over the years. I’m grateful for its versatility & its sturdiness, as I’m rather clumsy! the f3 is a very solid camera, intuitively designed, and I’d recommend it to anyone looking for a daily shooter. \n\n* **Do you have a tip or technique that other film photographers should try?**\n\n>I’d say the best advice I could give my fellow creatives is this: don’t waste your time shooting things that don’t light you up inside. cater to your own interests, focus on making the images you want to see. \n\n* **Do you have a link to more of your work or an online portfolio you would like to share?**\n\n>[https://evertenderstudios.bigcartel.com/](https://evertenderstudios.bigcartel.com/)\n\n* **Do you have a favourite analog photographer or analog photography web site you would like to recommend?**\n\n>Chris Cuffaro is a legendary photographer, known for his work with the most influential artists of the 90s. I grew up listening to and loving Nirvana, so when I came across his work I was stoked. he was kind enough to send me a print of one of my favorite shots and I love looking at it every day. \n\n* **Is there anything else you would like to add about yourself or your photography?**\n\n>I would like to note that my work flow is vastly influenced by my health, and there are times when I am in too much pain to even get out of bed. as someone that loves shooting landscapes, it is crushing to be stuck at home, wishing I could be out there shooting all of the beautiful things. I am sad when a cloud goes by that I want to shoot but just can’t reach. my photos represent all the places I miss very dearly, and I truly appreciate it when others see the beauty in them too.",
        "num_comments": 0,
        "comments": []
    },
    "New Business - Sierra Nevada Drum Scanning 🎞️": {
        "title": "New Business - Sierra Nevada Drum Scanning 🎞️",
        "score": 836,
        "url": "https://i.redd.it/z6yquprxac9d1.jpeg",
        "content": "I started my own Drum Scanning Business for anybody that may be interested! I was providing Drum Scans for Bay Photo Lab from October 2022 - May 2024 and recently acquired a Tango Drum Scanner from them. My goal is to provide folks with high-quality film scans at a fair price. \n\nhttps://www.blakejohnstonfilms.com/drum-scanning\n\n4x5 Kodak Portra160 - Yosemite National Park, CA",
        "num_comments": 18,
        "comments": [
            "Awesome! I don't see a price for 6x9, given you can do 6x17 and large format, I assume it's something you're capable of, what would that run?",
            "unbelievably cool",
            "Nicely done!",
            "Can you give us a quote of scanning a roll of 72 half frame exposures? lol",
            "Beautiful!",
            "Wow!",
            "Fantastic shot. Thanks for sharing",
            "You live in the park? How does that work, a ranger? (Referring to the mailing address). \n\nWas there new years day last year, was spectacular.",
            "Beautiful picture and scan. Drum scanning really is the next level.",
            "Damn. I’d love to get my paws on a drum scanner, if anything to just take care of my huge stock of film. I love printing big"
        ]
    },
    "Shot a roll of Ektar in Iceland. Because I like to live dangerously, it was also my first self-developed and self scanned roll. It went...okay at best. (Minolta XD11, 80-200mm f/4, Ektar 100)": {
        "title": "Shot a roll of Ektar in Iceland. Because I like to live dangerously, it was also my first self-developed and self scanned roll. It went...okay at best. (Minolta XD11, 80-200mm f/4, Ektar 100)",
        "score": 228,
        "url": "https://i.redd.it/eeq4hulcqd9d1.jpeg",
        "content": "",
        "num_comments": 9,
        "comments": [
            "Bullshit, that's mars!",
            "I respect the DIY ethic! I’ve been getting into scanning, but I’m too afraid to ruin a roll self-developing. What’d you use to scan?",
            "More images! Let’s see them! Honestly looks super fun",
            "If you photoshopped the curiosity rover into it I'd fall for it. Rad.",
            "You inadvertently made your own discount aero chrome",
            "Believe it or not, basically yeah. Iron oxide is the same there as it is here! How fun!",
            "Canon 1Dx + Canon 100mm macro, mounted on an old Minolta copy stand, and the Cinestill CS Lite + Valoi negative holder. I'm getting some pretty serious light bleeds on the edges of the negative since the negative holder is slightly larger than the negatives, so I'm thinking I'll have to like, 3D print a little insert to cut out the light bleeding through the gaps between images. Other than that it's a decent setup.\n\nSelf developing is a pretty big pain in the ass though, I haven't yet fully decided if it's worth the effort. But then, logically speaking, nothing about this medium is. But we do it anyway.",
            "Interesting !",
            "When you say light bleeds are you talking about something like flaring, or more like reverse vignetting? I haven’t experienced that yet, though I am using a different holder."
        ]
    },
    "What’s with the light leak?Pentax Spotmatic F, Porta 200, f/1.8 50mm": {
        "title": "What’s with the light leak?Pentax Spotmatic F, Porta 200, f/1.8 50mm",
        "score": 105,
        "url": "https://www.reddit.com/gallery/1dqz1t0",
        "content": "Just got my film back and there’s this green hazing on the edges of the photos plus one solid black line. The film rewound kinda funky, did I stretch it maybe? What’s with the black line?\n\nThanks",
        "num_comments": 15,
        "comments": [
            "1 - stress marks from being re-wound the wrong way.  \n2 - lens flare.  \n3 - first shot of the roll, this is very common and not the fault of the camera.  \n4 - light leak. Check your cameras seals.  \n5 - same as 1. You did mention it was hard to re-wind.",
            "Check the light seals on the camera. It might be time to replace them.",
            "Shit like this used to get people super laid back in the 2010’s on instagram",
            "Roll your film back INTO the canister. It's nearly always a clockwise rotation. Light leak means light seals are bad, check them and if need be, replace them. Black line, show negative. The black line could shutter capping, could be something wrong with your camera, etc.",
            "There’s a lot going on here with leaks, but the black line on the right hand of the frame isn’t a leak - it’s a scanning artifact from dirt in the calibration area of the scanner glass.",
            "I should’ve specified the only ones I’m concerned with were 1,4 and 5. The rest is ofc normal. I didn’t even know you could rewind the wrong way.. thanks!",
            "Bingo",
            "Left the camera in some extreme cold, maybe that damaged them or that’s why they didn’t seal",
            "What do you mean?",
            "I left the camera in -20c and the shutter froze open right after the photo with the light leak. Is there a chance that affected the seals? I think I rewound it the wrong way for the stress marks and the first of the roll is always like that ofc. Black line is perplexing though.. never seen it before with this camera"
        ]
    }
}