{
    "[MEGATHREAD] New Horizons Dodo/Friend Code Sharing": {
        "title": "[MEGATHREAD] New Horizons Dodo/Friend Code Sharing",
        "score": 1945,
        "url": "https://www.reddit.com/r/AnimalCrossing/comments/y8b4ao/megathread_new_horizons_dodofriend_code_sharing/",
        "content": "Use this thread (and only this thread) to exchange New Horizons Dodo and Friend Codes with other r/AnimalCrossing users. Please do not post separate individual threads for code sharing!\n\nMake sure you sort by 'new' in order to see the most recent posts.",
        "num_comments": 76077,
        "comments": [
            "Welcome all fairies<3\n\nI will be doing a soft opening of my FREE fairy island shop CRESCENT! This will include: -star fragments -pearls -diys -furniture -fruits & veggies -nook mile tickets -mushrooms And sooo much more!! If interested in stopping by send me a message and I’ll give you the dojo code!\n\n!RULES! Please no picking flowers, star fragments, mushrooms or anything off my island that is not in the designated shopping area. If I see rules are broken I will close the island and it’ll just ruin the fun for everyone else.\n\nAlso be advise my island is blocked off in certain areas. I can’t have many people roam around freely you’d understand when you get there:) If you would like a tour we’ll have to do that another day\n\nSee ya soon! <3",
            "Just a heads up, I came across a user by the name of anvvsu on Nookazon. I canceled our transaction for a Royal Crown when I noticed just minutes before they received a review from another user claiming that they were scammed out of their crown. This person took the item and then left. I decided not to risk it so I declined. This person then proceeded to message me cursing in my DMs. I already reported them but just beware and keep yourselves safe. People like this really ruin it for everyone and I feel awful for the person who got scammed.",
            "5 star island.\n\nHave all veggies and fruits free for harvesting.\nIn the month of Jan if you would like to come fish or catch bugs. Have snow and starting to decorate for Christmas. Feel free to come visit and shop, explore etc.\n\nDodo is B0CLP\n\nEnjoy",
            "Are you wishing to make long lasting friendships through ACNH? Tired of sharing your friend code and then never visiting each other? Have you been scammed or had your island messed up by inconsiderate other players?\n\nI’m Looking for more respectful adults who want to be friends in ACNH. People who are fun but don’t trash other people’s islands, scam, or are rude for example! I play often and I’m also part of a really cool ACNH discord server where everyone is super nice, respectful, and fun to play with. It’s a safe space and is comprised of adults (18+). I use both discord and Reddit (but mostly discord)- but if you are interested in becoming friends, hanging out, or have been looking for a good discord server for the game feel free to send me a chat! Look forward to hearing from you 🙌🏼 always down to make more ACNH friends!",
            "[Closed! Thanks so much everyone! Will definitely do again!] \n\nFREE GIVEAWAY/SCAVENGER HUNT!\n\n\nHey friends! \n\nIn honor of completing my fossils I'm hosting a scavenger hunt giveaway (aka my storage is full please take all the things!)\n\nThere are SIX locations on my island with different kinds of items (Materials, Recipes/food, Gyroids, Clothing, Items, DIY). The scavenger part is you have to explore to find them! They're not super hard to find but I wanted a way where people can actually play and explore rather than filling pockets and leaving, ya know? Leif is also here and I Time traveled to morning so everyone can see. \n\nNo entry fee but if anyone has an extra Log Bed DIY lmk! Also donations/tips are accepted in the box as you enter. \n\nRules:\n1. Leave through the airport! (If you don't it's \"quiet leaving\" and bugs the whole game\n\n2. No picking Flowers, moss, or vines. \n*Shells, fruit, crops, weeds, branches, fishing, shopping, talking to villagers, visiting the museum, and bug catching is welcome!*\nBut please don't pick the flowers, moss or vines. \n\n3. Because of some of the content in my house/island, this island is 18+! It's very much in good humor but if you aren't comfortable with NSFW jokes it's not for you! \n\n4. This island was created in honor of my father who passed suddenly before Christmas. I have a memorial zone- please be super careful to not run over flowers there. \n\nThat's it!!\n\nDodo Code [closed!]\n\nI'll be open until 11pm EST and on intermittently. If you need something message me on reddit- my character will probably be sitting somewhere quietly while I clean my house 😅🤣💗",
            "I have finished my rainbow paradise after 1,8k hours, come visit! 🌈✨\n\nhttps://preview.redd.it/kupuqf1wmyeb1.png?width=2480&format=pjpg&auto=webp&s=b524aaacc860aea84817637dae5fa6d5644de6a0",
            "Now reopening!!!! New Code: LHL0V\n\nAgain!! Be patient! I am offering free bells so it gets busy! PLEASE USE AORPORT TO LEAVE!! If the connection crashes I will reopen and post new code!\n\n*Closed, sorry connection crashed! Quick restock and will post code again soon, stay tuned!*\n\n\nOkay here it goes. Opening MysticIsle to get rid of these bells! My mistake is absolutely your gain! I need to off load around 800,000,000 more bells. No joke!\n\nGolden tools on beach!\nTurnips for the taking! Most located between nooks cranny and Able Sisters buildings\nTrash can on right side of Nooks Cranny if you need to clear pockets, or you can drop on ground and I will repurpose or trash out for you. Come and go if you need\nIf you can reach it, you can pick it! Watering is appreciated!\nBe patient, since I am offering free bells galore, it can be a bit busy here.\nI will not be putting new bells down until all I have placed are gone. There is too much traffic for me to stress about replenishment. Once all is gone I will close island, replace bells, and reopen with a new code!\n\nKNGS7\n\nWelcome to MysticIsle, I am your host, Smashlee! Please enjoy your stay and leave only via airport! Thank you!",
            "Hi there. My kid is playing and she has wrapped presents. Please come to the island, poke around, and take a present. She's really excited and proud of herself. Please be nice, enjoy yourself, pick fruit, do whatever. DODO code: KT5G6",
            "[deleted]",
            "Hii i have my gates open with bells all spread out. They’re free and there’s an ABD nearby if your pockets end up full so you can deposite them into your account and pick up more if needed :-) the dodo is FP8T3\n\nhttps://preview.redd.it/xdjgbt0mccnb1.jpeg?width=1280&format=pjpg&auto=webp&s=474cd43e74d0547cad4c26e05265009702fee719"
        ]
    },
    "[MEGATHREAD] r/AnimalCrossing Town Hall - General Discussion, Questions & Answers, Hangout!": {
        "title": "[MEGATHREAD] r/AnimalCrossing Town Hall - General Discussion, Questions & Answers, Hangout!",
        "score": 482,
        "url": "https://www.reddit.com/r/AnimalCrossing/comments/y8b5rh/megathread_ranimalcrossing_town_hall_general/",
        "content": "#r/AnimalCrossing Town Hall!\n\nWelcome to the Town Hall! This thread is the place for general discussion & questions! Come say hi, discuss your current renovation project or get help if you're stuck.\n\n#[Code Sharing Thread](https://old.reddit.com/r/AnimalCrossing/comments/y8b4ao/megathread_new_horizons_dodofriend_code_sharing/)\n\n#Resources\n\n##[r/AnimalCrossing FAQ](https://www.reddit.com/r/AnimalCrossing/wiki/newhorizonsfaq)\n\n##Helpful Tools:\n\n* [ACNH Travel Guide](https://apps.apple.com/us/app/acnh-travel-guide/id1502818559) - Companion app for iOS with all information and tools you need, and a great design\n\n* [Nookipedia](https://nookipedia.com/wiki/Main_Page) - The independent Animal Crossing wiki, covering the series along with an API service\n\n* [Nookazon](https://nookazon.com/) - Our recommended place to buy and sell Animal Crossing: New Horizons items\n\n[Full directory of resources can be found here!](https://acnh.directory/)\n\n\n#Reminders\n\n* Trading is not allowed on this subreddit; simple stuff like swapping fruits or unwanted items is OK; please post those on the CODE SHARING THREAD, not on this thread or in comments on other posts. Because we do not have the capacity to protect you from scammers, we kindly ask you use a site like [Nookazon](https://acnh.directory/assets/images/links/link.png) to complete more complex trades.\n\n* Please be kind and respectful to all members of the subreddit! We want to keep r/AnimalCrossing a welcoming place.\n\n* Please use the REPORT button on anyone breaking the subreddit rules!",
        "num_comments": 7646,
        "comments": [
            "I didn't know the Able Sisters clothing store was a thing, I had made some designs. Today one of my neighbors was wearing one of them and it's honestly embarassing how excited I got. \n\nThere is a Zen quality to this game that may never be replicated.",
            "Anyone else wish you could rename your island?\n\nWhen the game came out I named mine communism ._.",
            "[removed]",
            "Sometimes I wish Blathers would roam around his museum. Sure, it might be hard to track him down if he did, but it would liven up the NPC characters a bit.\n\nIf not Blathers, have Celeste roam the museum when she's not night walking.",
            "Too lazy to submit my own thread so posting here.\n\nThis week I've finally tracked down and donated every kind of genuine artwork, so all the exhibits in my museum are finally and totally complete. And I did it basically without help from friends or family ... just throwing 4980 bells at Redd on Harv's island every damn day. Thank the maker for the 2.0 update, I guess. There was a not-insignificant bit of time travel involved, but only to make the best use of the unused days in my months-long hiatus from the game earlier this year.\n\nMy storage has dozens and dozens of both duplicate genuine and fake artworks, and I'm going enjoy throwing the pile of fakes in the trash soon.",
            "I just wanted to stop by and introduce myself! I recently had a baby and this game has been sanity saving during the late night feeds. I've only recently restarted the game after a couple of years inactivity and I forgot how relaxing it is.",
            "Why does Tom Nook take it so nookin' personally when you want to demolish an incline. It's an incline, Tom. An incline that I paid to build, and I'm going to pay to remove it. Pull yourself together man.",
            "Why Nintendo? Why did you limit me to one island per switch? I wanted to let my sister try this game but we can't without deleting my island",
            "Does anyone else struggle with letting villagers leave? I've been thinking it would be nice to have some new faces cycle through, I have everyone's photos, and at least half of my villagers have vacation homes now. And yet, every time someone asks to leave, even one of the ones I've said would be ok if they left, I can't do it.",
            "Idk if this sub has a “best of 2022” kinda thing but if it does, I want to nominate [this post](https://www.reddit.com/r/AnimalCrossing/comments/sc7jdc/my_hair_is_stuck_in_messy_how_to_fix_visiting/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) as the most unexpected/funniest moment"
        ]
    },
    "Finally finished my giant Animal Crossing drawing!": {
        "title": "Finally finished my giant Animal Crossing drawing!",
        "score": 1150,
        "url": "https://www.reddit.com/gallery/1dlaxac",
        "content": "This whole process took me 77 hours💀💀",
        "num_comments": 45,
        "comments": [
            "This is so amazing!! You have some awesome skills! I love shading/choral art!",
            "It Looks like a tally hall album",
            "Bro made a tapestry for animal crossing 🥹",
            "Omg this is absolutely stunning 🥹",
            "That is so COOL!!",
            "This feels weirdly unnerving. Like, if i put a black light up to it, i feel like it would reveal some kind of eldritch lovecraftian horror",
            "Is that Pashmina i see? Cg! Ur amazing would love to see more! Srry it took so long but worth it! 💗",
            "😍This is everything😍",
            "You are so talented, this is insanely awesome 😍",
            "I loveeeeee"
        ]
    },
    "Even though it’s 90 outside, I made a fall/pumpkin spice cafe lol🎃🥧": {
        "title": "Even though it’s 90 outside, I made a fall/pumpkin spice cafe lol🎃🥧",
        "score": 890,
        "url": "https://www.reddit.com/gallery/1dl9j78",
        "content": "",
        "num_comments": 36,
        "comments": [
            "That looks amazing!",
            "I love your character's design",
            "Sometimes it's the best way to stay cool, to be there in your mind. I love the colors😍",
            "so cute!🥹i miss fall so much😭",
            "Man, this is what I need to do with mine. I just restarted the Island, and I really wanna finish creating one that I'm proud of.",
            "This is so cute! I love your outfit, too.",
            "Manifest it into existence, I beg",
            "A little late, but what did you use for the custom designs behind the pies/food? The item itself, although if you have a design code to share that'd be awesome too!",
            "Do you have a dream address? 😍",
            "Wow, that looks so good!"
        ]
    },
    "Can you help me find this path code? <3": {
        "title": "Can you help me find this path code? <3",
        "score": 32,
        "url": "https://i.redd.it/dmqi8330l38d1.jpeg",
        "content": "",
        "num_comments": 4,
        "comments": [
            "There are a lot of cobblestone paths out there but idk which one this is, they’re all quite the same.\nThis creator has a path very similar: MA-5151-2167-6633",
            "I thought Wade was naked for a minute 😭",
            "Omg I want to know too 😍",
            "super thank you!!"
        ]
    }
}