{
    "A video explaining the history of the t-word and why it’s a slur will be linked below, along with more information on the subreddit’s policies. Do not share your opinion on the topic until you have watched the video.": {
        "title": "A video explaining the history of the t-word and why it’s a slur will be linked below, along with more information on the subreddit’s policies. Do not share your opinion on the topic until you have watched the video.",
        "score": 11946,
        "url": "https://i.redd.it/5ypi2gjix7g51.jpg",
        "content": "",
        "num_comments": 2962,
        "comments": [
            "I left the other sub due to the increased negativity over what seemed like a non-sensical issue. I've had time to separate myself and after reading comments here it is starting to make sense. I never saw the malintent behind the word until the storm hit and in all truth it was difficult to understand both sides on the matter. I side with the ban of the word.",
            "Thank you mod-team for actually fostering an inclusive community and providing information.  The other subs for this kind of content are absolute trash fires atm.",
            "All these cis people trying to say what is and isn't a slur",
            "I apologize if this comes off rude but if ferris' reason to be feminine is for crusch's sake and then they state that they are a man heart and soul? Does this still make them trans? I think the author said ferris is a guy as well so the example is perplexing .",
            "YOU BANNED A SLUR!? TIME TO WRITE A 500-PAGE ESSAY ON HOW IM MORE OPPRESSED THAN JEIWSH PEOPLE DURING THE HOLOCAUST 😡😡😡  \n  \n/s",
            "I just left animemes as it was becoming far too much to handle. I just couldn’t take seeing those posts every single day. I can’t understand how they say trans people don’t see it as a slur but then also attack the trans community for being happy that it’s banned. I was worried I wouldn’t find another place to feed my need of anime memes but the community here seems much better.",
            "Thank god this isn't turning into the dumpster fire r/animemes is",
            "I actually agree with the ban of the T-word it is a slur and can be extremely hurtful to a trans person. I just wished that every thing didn't get blown out of proportion. It just a word that the mods are saying you shouldn't  use simple as that. Just like  I don't like it when  non-black people say the n-word and non-white people  say the c-word (I'm black myself) I'm all for freedom of speech but using hurtful slurs shouldn't be tolerated.",
            "Contra points has a good video too",
            "I left animemes awhile ago because of the prevalent use of that. It always sucked especially in the context it was often posted in. I'm happy they seem resolute in banning it and making a safer space for everyone."
        ]
    },
    "Reminder: this is the queer anime sub - transphobes and homophobes fuck off": {
        "title": "Reminder: this is the queer anime sub - transphobes and homophobes fuck off",
        "score": 0,
        "url": "https://i.redd.it/gtoxr1448y7d1.png",
        "content": "",
        "num_comments": 11,
        "comments": [
            "wait, wtf? i thought this was the anti trans anime subreddit",
            "No, I think that's animemes",
            "so not trans anime memes nor anti trans anime memes, right?",
            "*Wait, wtf? i*\n\n*Thought this was the anti trans*\n\n*Anime subreddit*\n\n\\- onionKnight6969\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")"
        ]
    },
    "Besties": {
        "title": "Besties",
        "score": 379,
        "url": "https://i.redd.it/nw37yd0kag9d1.jpeg",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Is that mao mao I see.",
            "Jesse, we need to go to ancient China to get some important specialist!",
            "Now Maomao is truly happy",
            "Hmmm now I see lol",
            "She would",
            "Oh mao mao mao",
            "Hey DependentFeature3028! This is your **9th** submission this month placing you on rank **#5** for the highest number of submissions leaderboard. At the time of writing you had accumulated **~4791** submission karma placing you on rank **#4** of the submission karma leaderboard. [Read the announcement](https://redd.it/lvz756) for more details.\n\n**Wanna check your ranks?** Join us on the [Anime memes Discord](https://discord.com/invite/axisorder)."
        ]
    },
    "Time-loops are a bitch, huh.": {
        "title": "Time-loops are a bitch, huh.",
        "score": 329,
        "url": "https://i.redd.it/ow3bfo3bbf9d1.png",
        "content": "",
        "num_comments": 13,
        "comments": [
            "15,532 loops were the total amount of loops, calculating the results of the two weeks they spent that would be 15,532 loops x 14 days.\nThe results are 217,448 days that Nagato was in the loop.",
            "great show, however the \"endless 8\" made me question if i was stuck in a loop or was losing it, like \"wait where is the new ep, what day is it?\" etc, at the time it SUCKED, now many many years later its like this weird memory that feels unreal xD",
            "Holy shit that's almost 596 years",
            "I don’t know. I kind of sympathize with her for some reason. Not with the time loops though. Is that saying something about me?",
            "So thats where the \"She looks like 12 but is actually 500 years old\" comes from!",
            "Technically she was made 3 years ago in canon, but also designed to appear about 15, and has also experienced nearly 600 years due to the loop.",
            "Less of a season two and more of a second batch of episodes released 3 years later. Most official sites will list them together as one season.",
            "Poor girl!.\nI'm surprised she didn't go insane\n\nI would have\n\nI almost went insane just watching the endless 8",
            "What show?",
            "THERE'S A SEASON 2?????"
        ]
    },
    "💀 𝐈 𝐃𝐨𝐧'𝐭 𝐇𝐚𝐭𝐞 𝐋𝐢𝐟𝐞 !!!": {
        "title": "💀 𝐈 𝐃𝐨𝐧'𝐭 𝐇𝐚𝐭𝐞 𝐋𝐢𝐟𝐞 !!!",
        "score": 32,
        "url": "https://i.redd.it/n23b7z7kvh9d1.jpeg",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Before he got isekied he was a shut in gamer",
            "💀𝐀𝐢𝐧𝐳/𝐒𝐤𝐢𝐩𝐩𝐞𝐫🐧",
            "Someone please explain.",
            "Hey The-HalfBlood-Prince! This is your **second** submission this month placing you on rank **#55** for the highest number of submissions leaderboard. Your previous submissions did not gain karma (yet), [read the announcement](https://redd.it/lvz756) for more details.\n\n**Wanna check your ranks?** Join us on the [Anime memes Discord](https://discord.com/invite/axisorder)."
        ]
    }
}