{
    "This subreddit is closed for new posts and comments. For future updates, announcements, and news related to Reddit Inc. and the platform, please visit r/reddit.": {
        "title": "This subreddit is closed for new posts and comments. For future updates, announcements, and news related to Reddit Inc. and the platform, please visit r/reddit.",
        "score": 0,
        "url": "https://www.reddit.com/r/reddit/",
        "content": "",
        "num_comments": 1,
        "comments": [
            "For more information about r/reddit, check out [this post](https://www.reddit.com/r/reddit/comments/sphocx/test_post_please_ignore/)"
        ]
    },
    "COVID denialism and policy clarifications": {
        "title": "COVID denialism and policy clarifications",
        "score": 13948,
        "url": "/r/redditsecurity/comments/pfyqqn/covid_denialism_and_policy_clarifications/",
        "content": "",
        "num_comments": 1,
        "comments": [
            "We're taking questions on the original r/redditsecurity post"
        ]
    },
    "Debate, dissent, and protest on Reddit": {
        "title": "Debate, dissent, and protest on Reddit",
        "score": 0,
        "url": "https://www.reddit.com/r/announcements/comments/pbmy5y/debate_dissent_and_protest_on_reddit/",
        "content": "Hey everyone–\n\nThe pandemic has been extremely hard on many of us. We believe the best way forward for everyone is to [get vaccinated](https://www.cdc.gov/coronavirus/2019-ncov/index.html) and continue to follow [CDC guidance on masking](https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/about-face-coverings.html). Throughout the pandemic, we have also provided COVID-related resources to support our volunteer moderators, users, and communities, including a dedicated AMA series connecting users with [authoritative experts on coronavirus](https://redditblog.com/2020/03/02/expert-conversation-on-coronavirus/) and [vaccines](https://redditblog.com/2021/01/28/introducing-a-new-reddit-ama-series-everything-you-want-to-know-about-covid-19-vaccines/), as well as deploying homepage and search page banners directing users to the CDC and r/Coronavirus.\n\nWe appreciate that not everyone agrees with the current approach to getting us all through the pandemic, and some are still wary of vaccinations. Dissent is a part of Reddit and the foundation of democracy. Reddit is a place for open and authentic discussion and debate. This includes conversations that question or disagree with popular consensus. This includes conversations that criticize those that disagree with the majority opinion. This includes protests that criticize or object to our decisions on which communities to ban from the platform.\n\nWhile we appreciate the sentiment of those demanding that we ban more communities that challenge consensus views on the pandemic, we continue to believe in the good of our communities and hope that we collectively approach the challenges of the pandemic with empathy, compassion, and a willingness to understand what others are going through, even when their viewpoint on the pandemic is different from yours. \n\nWhen it comes to COVID-19 specifically, what we know and what are the current best practices from authoritative sources, like the CDC, evolve continuously with new learnings. Given the rapid state of change, we believe it is best to enable communities to engage in debate and dissent, and for us to link to the CDC wherever appropriate. While we believe the CDC is the best and most up to date source of information regarding COVID-19, disagreeing with them is not against our policies.\n\nHowever, manipulating or cheating Reddit to amplify any particular viewpoint is against our policies, and we will continue to action communities that do so or that violate any of our other rules, including those dedicated to fraud (e.g. fake vaccine cards) or encouraging harm (e.g. consuming bleach); and we will continue to use our quarantine tool to link to authoritative sources and warn people they may encounter unsound advice. We humbly ask and encourage everyone to report content that may violate our policies.\n\n\\*We are using our [political ads system](https://www.reddit.com/r/announcements/comments/ipitt0/today_were_testing_a_new_way_to_discuss_political/) to facilitate discussion of this post within the context of your own communities.",
        "num_comments": 1,
        "comments": []
    },
    "Sunsetting Secret Santa and Reddit Gifts": {
        "title": "Sunsetting Secret Santa and Reddit Gifts",
        "score": 0,
        "url": "https://www.reddit.com/r/announcements/comments/nw2hs6/sunsetting_secret_santa_and_reddit_gifts/",
        "content": "Today is a difficult one:. 2021 will be the last year of Reddit Gifts.  We will continue to run exchanges through the end of the year -- including the last ever Arbitrary Day (signups are [now open](https://www.redditgifts.com/exchanges/a-day-21/)) -- and will end with Secret Santa 2021. \n\n**We didn’t make this decision lightly.** \n\nWe made the difficult decision to shut down Reddit Gifts and put more focus on enhancing the [user experience](https://www.reddit.com/r/blog/comments/mqcpcg/you_want_a_better_reddit_search_ok_were_on_it/) on Reddit - this includes [investing](https://www.reddit.com/r/blog/comments/ldgmfc/diamond_hands_on_the_data/) in the [foundation](https://www.reddit.com/r/RedditEng/comments/nudfv1/the_rollout_of_reputation_service/) [of our](https://www.reddit.com/r/blog/comments/lb2p7a/a_new_video_player_updated_email_designs_mobile/) [platform](https://www.reddit.com/r/RedditEng/comments/neknjg/evolving_beyond_100_billion_recommendations_a_day/) and [moderator tools](https://www.reddit.com/r/blog/comments/nk7p7j/new_updates_to_help_moderators_your_monthly/), making it more [accessible](https://www.reddit.com/r/blog/comments/mzse3p/control_over_your_followers_spring_avatar_gear_a/) for people around the world and evolving how people [engage](https://www.reddit.com/r/redditsecurity/comments/nmhmj0/q1_safety_security_report_may_27_2021/) with one another. \n\nThe power of Reddit Gifts was never in the software, and has always belonged to the r/secretsanta community of gifters around the world, which has connected people and been an extension of our mission to bring community and belonging to everyone in the world. We’re hopeful that spirit will continue in the future. \n\n**What this means for future exchanges in 2021**\n\nIn preparation for retiring Reddit Gifts after the final exchange at the end of 2021, we will be taking the following actions: \n\n* In order to limit incomplete exchanges, we have disabled the creation of any new Reddit Gifts accounts. If you have an existing Reddit Gifts account, we would love it if you would participate with us in these final exchanges. \n* Any incomplete exchanges will result in a ban from the remaining Reddit Gifts exchanges.\n* This morning, we turned off the ability to buy [Elves](https://www.redditgifts.com/Elves/). If you purchased an Elves membership and have remaining months after the 2021 Secret Santa Exchange, we will email you about your refund options then. If you have specific concerns about your Elves membership, please reach out to Reddit Gifts [support](https://reddit.zendesk.com/hc/en-us/requests/new?ticket_form_id=360000825092). \n\nThese changes have been put in place to ensure that these last exchanges are enjoyable for the legacy Reddit Gifts users. We want to celebrate the end of Reddit Gifts with the community that we’ve built so far. \n\nCountless acts of love, heroism, compassion, support, growth and hilarity happened through Reddit Gifts, and those memories will live on in the hearts of our community. We’re working on ways to capture these moments and look forward to seeing how the spirit and connection of exchanging gifts with strangers will live on. I’m sure you will all have a ton of questions, and we will be here to answer them.",
        "num_comments": 3432,
        "comments": [
            "> I’m sure you will all have a ton of questions, and we will be here to answer them.\n\nHere's an obvious one.... Why?",
            "If this isn't a book end for what was old Reddit I don't know what is.",
            "Translation - we weren't making enough money off this to be worth out time & effort",
            "So you took over someone elses project years ago, made some money off of it and then killed it. Yikes.\n\n*Edit* The original creator of secret santa u/kickme444 is starting up a new secret santa. Please visit r/newsecretsanta for details.",
            "You said you didn’t make this decision lightly but didn’t say why the decision was made?❓",
            "I legit enjoyed Secret Santa. I do well financially, and it felt good to make someone's holiday a little better especially if they were struggling. There was fun to be have in searching for that perfect gift. I never really cared if someone never sent me anything since that was what happened the first time. Nevertheless, the second time I did Secret Santa someone did send me something and for me I actually appreciate the effort and thought, especially when she wrote a handwritten note to go along with the gifts. It made my day.",
            "What’s with you guys? I mean you have phoned in the April fools day thing multiple years in a row now. Now you kill off Reddit gifts. You’re not broke. It’s like an attitude of complacency and defeatism has permeated your company, Reddit’s not as fun as it once was.\n\nEdit: r/newsecretsanta exists, made by the original creator of the whole thing. Consider checking them out",
            "Why the fuck would you kill this\n\nEdit: u/kickme444 (creator of Reddit gifts and previous mod of r/secretsanta) says to check out r/newsecretsanta!",
            "BREAKING: Reddit restarts the war on Christmas; users saddened",
            "Does this mean some intrepid user can start their own gift exchange, like Reddit Secret Santa was initially?"
        ]
    },
    "Second": {
        "title": "Second",
        "score": 0,
        "url": "https://www.reddit.com/r/announcements/comments/mi01fg/second/",
        "content": "Picking a winner is easy.\n\nBut what if second was first instead,\n\nAnd we celebrated the second guessers?\n\n--\n\nTo play, visit r/Second on [iOS](https://www.reddit.com/mobile/download), [Android](https://www.reddit.com/mobile/download), or your [browser](http://new.reddit.com/r/second),",
        "num_comments": 1,
        "comments": [
            "Join the discussion in r/Second"
        ]
    }
}