{
    "[MOD POST] LIST OF TOP MESSAGES, NEWS + IMPORTANT INFO": {
        "title": "[MOD POST] LIST OF TOP MESSAGES, NEWS + IMPORTANT INFO",
        "score": 16,
        "url": "https://www.reddit.com/r/antivirus/comments/1ax19cr/mod_post_list_of_top_messages_news_important_info/",
        "content": "Hello,\n\nWelcome to r/antivirus's new top-level Announcements post.  Since Reddit has a limit of two (2) stickied announcements per subreddit, this will be a way to provide links to important information like announcements about new rules and moderators, activities in the subreddit, and so forth.  If you are new to r/antivirus, **please take a quick look at them**.  You can even take a look if you are not new here.\n\n**DISCUSSION** | **DATE POSTED** | **DATE LAST REVISED**\n----|----|----|\n[\\[MOD POST\\] We're back in business! and an update on automod rules](https://old.reddit.com/r/antivirus/comments/1bch1l2/mod_post_were_back_in_business_and_an_update_on/?) | 2024-MAR-11 | -\n[News & Updates from your r/Antivirus Mod Team, Q1 2024 Edition](https://old.reddit.com/r/antivirus/comments/1b6vb9c/news_updates_from_your_rantivirus_mod_team_q1/?) | 2024-MAR-04 | -\n[Updates & News from the r/Antivirus Mod Team, Autumn 2023 Edition](https://old.reddit.com/r/antivirus/comments/1708ex3/updates_news_from_the_rantivirus_mod_team_autumn/) | 2023-OCT-04 | -\n[Notes from your Moderators (Summer Edition)](https://old.reddit.com/r/antivirus/comments/vuegt5/notes_from_your_moderators_summer_edition/) | 2022-JUL-08 | - \n[Quick Note from the mod team about spam](https://old.reddit.com/r/antivirus/comments/nq66hn/quick_note_from_the_mod_team_about_spam/) | 2021-JUN-01 | -\n[To the people asking for opinions on a specific file](https://old.reddit.com/r/antivirus/comments/hls4q3/to_the_people_asking_for_opinions_on_a_specific/) | 2020-JUL-05 | 2020-JUL-05\n\nAdditionally, the r/antivirus subreddit operates a bit differently than other subreddits you might be familiar with and normally use.  Here are some tips and tools to help you use it.\n\n*  The subreddit has a [wiki](https://old.reddit.com/r/antivirus/wiki) that is regularly updated with answers to commonly-asked questions.  Check it out.  The answer to your question may already be in there.\n\n*  Asking a question about a report on a file or website from a service like Hybrid Analysis, MetaDefender, Triage, or VirusTotal?  You **must** include the actual link to it and not just a screenshot, or your post will be removed.\n\n*  Be kind to each other and be professional in your conduct here.  Personal attacks will not be tolerated and will be dealt with appropriately.\n\n*  Do not ask for copies of hacking tools, malware, or suspicious files.  If someone sends you a chat request or private message asking for a file or offering assistance based on what you posted here, report them to Reddit and notify the mods.\n\n*  Do not post direct links to malicious, suspect, or potentially unsafe files or web sites.\n\n*  Follow [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). This means correctly upvoting and downvoting posts, and reporting posts with dangerous or unsafe advice to the mods.\n\n*  If you work for a vendor of security products, services, or in a related field, you must identify yourself as such, either in the post or with flair.  Also, you may not steer conversations to your products or services, only respond to posts about them to clarify or defend.\n\n*  No low-effort, off-topic, spam, or meme posts.  This includes AI/ChatGPT/LLM-generated text, questions about password manager or VPNs, requests for assistance with non-security related software like autoclickers or MP3 downloaders, and so forth.\n\n*  No requests for assistance with pirated software or media.\n\n*  Posts may be removed and threads closed at any time based on the moderators' discretion\n\nThe complete list of rules for the subreddit can be found [here](https://old.reddit.com/r/antivirus/about/rules/).  Read them before posting.\n\nQuestions, comments, feedback on this post?  Just reply here. Thank you.\n\nRegards,\n\nAryeh Goretsky  \n*(on behalf of the r/antivirus mod team)*",
        "num_comments": 10,
        "comments": [
            "Thank you u/goretsky for these reminders and helpful links!",
            "i joined the subreddit yesterday but i haven’t been approved by a moderator i need advice please :( .",
            "Splendid! Hello y'all!",
            "[removed]",
            "k.",
            "Hi, I'm trying to post a question, but it's not letting me post it",
            "Hello,\n\nI did not see a join request, but you have been manually added.  Welcome aboard.\n\nRegards,\n\nAryeh Goretsky",
            "Hello,\n\nPost removed for violation of [Rule #1](https://old.reddit.com/r/antivirus/about/rules/).  No questions involving software piracy.\n\nRegards,\n\nAryeh Goretsky",
            "Hello,\n\nClick on the JOIN button to join the subreddit.  After your request to join has been approved by a moderator you will be able to post questions. \n\nRegards, \n\nAryeh Goretsky",
            "thank you, it is very appreciated 🙏🏽"
        ]
    },
    "[MOD POST] We're back in business! and an update on automod rules": {
        "title": "[MOD POST] We're back in business! and an update on automod rules",
        "score": 10,
        "url": "https://www.reddit.com/r/antivirus/comments/1bch1l2/mod_post_were_back_in_business_and_an_update_on/",
        "content": "Hello,\n\nIt's time for a quick update from your mod team!\n\nIn our [previous update](https://www.reddit.com/r/antivirus/comments/1b6vb9c/news_updates_from_your_rantivirus_mod_team_q1/), we talked about changes made to the subreddit to restrict accessibility and discoverability after an increase in spam.  We are comfortable with how the subreddit has been operating, and will be removing those restrictions.\n\nBecause that means an influx in new posters, we are making some additional changes to the subreddit.\n\nTo begin with, in order to ensure our community is helpful and easy to navigate, posts must have descriptive titles that summarize their main topic.  Posts with titles that don't clearly indicate the subject matter may be removed.\n\nAdditionally, we will be trying new types of rules in the AutoModerator to see if they have the desired effect, including:\n\n*  Rules that will attempt to answer common questions.  The topic will be left open in case the question is not answered or other members have more to contribute.\n\n*  Posts with a vague title or other problems will be removed, but the AutoModerator will specify that you are welcome to try again. A  title should indicate to someone with the same question whether your post is related.\n\n*  New spam filters, and the AutoModerator will not invite you to try again. \n\nAs with any changes to automoderation, there's the possibility we might have gotten something wrong, so we'll be monitoring these closely to ensure they are working as designed.  However, if you come across an AutoModerator rule that seems incorrectly applied or otherwise out of place, please use the 'Message the Mods' function to let us know so we can investigate.\n\nQuestions, comments or suggestions about how we use automoderation in the subreddit?  Ask them here!\n\nRegards,\n\nAryeh Goretsky  \n*(on behalf of the r/antivirus mod team)*",
        "num_comments": 2,
        "comments": [
            "We've changed the AutoModerator rule from requiring 10 comment karma to post a link, to simply require non-negative karma. This will make it easier for new reddit users to ask for help.",
            "As someone new wending their way through karma/nokarma groups, thank you."
        ]
    },
    "Is this something I should worry about?": {
        "title": "Is this something I should worry about?",
        "score": 16,
        "url": "https://i.redd.it/pr6oao562d9d1.jpeg",
        "content": "I’ve been super paranoid about this and I’m wonder if it has infected me and what it can do. Please help.\n",
        "num_comments": 7,
        "comments": [
            "Hello,\n\nAs this is not a computer virus or malicious software issue, this thread is now be closed.\n\nFor further assistance, try a subreddit like /r/AndroidQuestions, /r/surfshark, r/VPN, etc.\n\nRegards,\n\nAryeh Goretsky",
            "It seems like it's related to SurfShark VPN, if you have the app then you're good.",
            "[removed]",
            "Yeah I downloaded  right when I started getting the messages so thanks that helps a lot",
            "Just verified and a member of the Surfshark team did in fact confirm they use that domain. Nothing to worry about :).\n\nUnderstand why you'd think that and admire that you took the time to ask, though.",
            "Thanks for your help"
        ]
    },
    "What's the best way to handle passwords?": {
        "title": "What's the best way to handle passwords?",
        "score": 16,
        "url": "https://www.reddit.com/r/antivirus/comments/1dqob0j/whats_the_best_way_to_handle_passwords/",
        "content": "I decided I wanted to finally get on top of my passwords as many are insecure or reused. So I'm changing them all to secure, unique passwords. This also makes them pretty much impossible to remember.\n\nHow do I handle being able to access them if I'm out and about, and need to login? I was thinking about putting them all into a txt file and making that into a QR code that goes into my (non transparent) phone case.\n\nThis doesn't seem like the best idea though, in case I lose my phone. What should I do instead? Should I backtrack, and switch to passwords I'm able to remember easier? Just not sure the best practice to go with in terms of being able to remember/access the passwords safely\n\nThanks!",
        "num_comments": 44,
        "comments": [
            "Hello,\n\nNot a computer virus or malicious software related issue.  Maybe try asking in r/Passwords/ or r/cybersecurity_help.\n\nThread closed.\n\nRegards,\n\nAryeh Goretsky",
            "Just use a password manager, I use bitwarden and it’s one of the best",
            "1password or Bitwarden",
            "Bitwarden or any open source that is somewhat mainstream, keepass , 1password, etc \n\nDo NOT use password on browser. Phone password manager is ok this days but still 3rd party app is the correct answer",
            "I got tired of forgetting my passwords.  Especially the one to my password manager.  I just use an address book now.",
            "use keepassxc, your data is encrpyted and it is local program, it is free software",
            "password manager its the key, as person with ADHD i would not been able to remember unique passwords",
            "KeePassXC?\nafaik it is free and open source",
            "Physically write them down, tbh.",
            "This won’t help you when you’re not at home, but write them down on paper with pen and stow it somewhere. You’ll be glad you did when your devices fuck up and you nearly lose your passwords."
        ]
    },
    "What antivirus should i buy?": {
        "title": "What antivirus should i buy?",
        "score": 8,
        "url": "https://www.reddit.com/r/antivirus/comments/1dqpyt1/what_antivirus_should_i_buy/",
        "content": "Im really struggling, everybody hates norton, now they say kaspersky cant be trusted. What is a good antivirus?",
        "num_comments": 32,
        "comments": [
            "Hello,\n\nAny of the programs listed in the wiki at https://old.reddit.com/r/antivirus/wiki/index#wiki_anti-virus_.28aka_anti-malware.29_developers should be fine.  If you want a free program, look for ones that have a check mark (\"✔️\") in the **Free Version?** column.\n\nRegards,\n\nAryeh Goretsky",
            "If you are looking for a paid one, then Bitdefender or ESET. I, personally, prefer ESET.",
            "[removed]",
            "Microsoft Defender enhanced by DefenderUI + Malwarebytes Premium\n\n(Disable \"Register in Windows Center\" option in MB settings, in order to make them coexist peacefully)",
            "Just use Defender. It's one of the best.",
            "It depends on your experience with the computer. For some, antivirus is completely unnecessary. I used Microsoft Defender for three years, but lately I'm a bit paranoid, so I'm trying ESET. So far it looks good and is light on the system. Some antiviruses offer a trial so you can try it out.",
            "Mbam.",
            "Multiple people mentioned cracking software or utilizing cracked software.\n\nDiscussion of piracy is prohibited. This is quite clear in the very short list of our subreddit rules (rule #1, nonetheless):\n\n***Discussions about or relating to the unlawful or illicit use of software***\\*, hardware, networks or services in violation of the terms under which they are licensed for use.\\*\n\n*Includes asking for help with pirated software, information on how to pirate software, and so forth.*\n\nRepeated discussions that violate this rule and any other rule will result in a ban.",
            "Given trust, they are generally intrusive, and besides Kaspersky and Russia, check out \"eyes\" nations.\n\nGiven that, just go over various tests and see which one is ranked highest overall for performance, use, and protection.\n\nSome will tell you not to trust tests. In that case, if you want to find out by yourself, then backup your system, install the trial version of one AV, run benchmarking software several times to record results, restore the system, and then try the next AV.",
            "For Windows?\n\n  \nJust use Defender and you're set, it's very very good and even as someone who monitors various enterprise XDR platforms as part of my living, I just use Defender on personal devices."
        ]
    }
}