{
    "Atualização importante - A comunidade antitrampo depende de você!": {
        "title": "Atualização importante - A comunidade antitrampo depende de você!",
        "score": 73,
        "url": "https://www.reddit.com/r/antitrampo/comments/1d29h87/atualização_importante_a_comunidade_antitrampo/",
        "content": "Olá membros do antitrampo!\n\nComo tem passado?\n\nAo longo dos últimos 12 meses algumas mudanças começaram a ser testadas e posteriormente implementadas aqui. O objetivo foi alcançar melhoria de conteúdo presente em nossa comunidade, valorizando nossa cultura, nossas piadas, nosso jeito de fazer a coisas...  \n\nMas ainda há muito por fazer e precisamos de sua ajuda:\n\n*  **Viu algum post ou comentário que não se encaixa na comunidade? Clique no botão DENUNCIAR.**\n* **Encontrou aquele tipo de user que só vem aqui pra plantar discórdia e ficar infernizando? Denuncie...**\n* **Apareceu uma postagem que viola as leis do Brasil?  Denuncie para a moderação!**\n* **Tem gente pedindo PIX ou doações na comunidade? Solicite remoção do conteúdo via MODMAIL.**\n* **Algo gravíssimo que precisa ser removido imediatamente? Envie um MODMAIL.**\n\nInfelizmente devido a rotina de nossos trabalho não conseguimos ser tão ostensivos, então sua ação faz toda a diferença pra que essa seja uma comunidade segura para falar mal do patrão.\n\nMais mudanças estão por vir aqui ainda... Teremos regras mais simples de seguir e que ao mesmo tempo irão garantir um espaço de qualidade para os nossos.",
        "num_comments": 0,
        "comments": []
    },
    "26 anos e 16 por 10 de pressão arterial": {
        "title": "26 anos e 16 por 10 de pressão arterial",
        "score": 35,
        "url": "https://www.reddit.com/r/antitrampo/comments/1dras7q/26_anos_e_16_por_10_de_pressão_arterial/",
        "content": "Comecei a me sentir mal durante o trabalho esses dias. Como eu estava perto do setor da saúde, decidi ir lá pra eles medirem minha pressão arterial. Sou anêmica, então achei que minha pressão tinha caído, por isso eu estava me sentindo fraca.\n\nMediram minha pressão e, surpresa, tava 14.8. Fiquei chocada. Minha pressão sempre foi mais baixa normalmente. O pessoal da saúde me pediu pra ficar sentada alguns minutos pra ver se melhorava, mas as coisas foram só piorando. Em menos de 10 minutos eu comecei a dar enxaqueca, doía da base da minha nuca até a testa. Me fizeram deitar e mediram a pressão de novo. 16.10. Depois disso me levaram pro hospital. O médico me falou que foi uma reação aguda a estresse e tensão. Me deu 2 dias de atestado e algumas gotas de Rivotril e me liberou com as palavras: \"Trabalho nenhum compensa isso\"",
        "num_comments": 22,
        "comments": [
            "A minha é 14 por 10 normalmente, tipo esse é o estado que ela fica em repouso. A gente se mata por esses trabalhos",
            "Tente fazer exercícios. E realmente, trabalho nenhum vale isso, mas temos que sobreviver. Paciência ",
            "Com o que trabalha Op??",
            "25 anos e no mesmo, tomando 2 remedios pra pressão, provavelmente estresse de trabalho",
            "Eu conheço uma professora que trabalhava os 3 períodos porque tinha filha pequena cheia de problemas e o marido largou o emprego pra cuidar da criança. Ela infartou com 20 e poucos anos e sofre muitas consequências disso até hoje, uns 10 anos depois. Ela sempre fala que não vale NADA a pena. A revolta é inevitável",
            "Sim, pelo amor de Deus",
            "Olha que porra. São coisas que não deviam estar acontecendo com gente tão nova",
            "Controle de qualidade em fábrica",
            "Eu fiz muito academia tb, ansiedade e estresse é pior que veneno",
            "Vc sente a diferença um dia que faltar no treino, né?"
        ]
    },
    "Justo!": {
        "title": "Justo!",
        "score": 1021,
        "url": "https://v.redd.it/mm8uerw2oc9d1",
        "content": "",
        "num_comments": 53,
        "comments": [
            "Fui ler a história completa, e essa mulher não foi mandada embora por uma grande injustiça como as pessoas daqui devem ter pensado, na verdade o contrato dela era temporário e simplesmente acabou. Logo depois ela foi para a adega e desperdiçou 60 mil litros de vinho. As autoridades da Espanha ainda estão investigando a motivação do crime, mas ela já foi presa. \n\nQuanto ao pessoal desse sub, usem um pouquinho mais de bom senso antes de aplaudir qualquer coisa, ou darão a entender que jogar fora milhares de litros de alimento é algo da causa de vocês.",
            "Que engraçadinho ela correndo kkkkkkk",
            "Vai fazer o que? Me demitir dnv?",
            "Na moral que tem gente que acha que esse comportamento é aceitável?",
            "E essa heroína tem capa... de chuva",
            "Horrível. O lucro é do dono mas o produto abastece o povo. Estragar esse tanto de vinho por uma demissão é absolutamente insano e injustificável. Se ela tivesse cortado o pneu do carro do dono eu acharia errado mas acharia graça. Isso é só horrível mesmo.",
            "Justo? Você só poder ter um problema na sua mente, vários outros serão demitidos por não ter matéria prima para trabalhar, a empresa pode falir e deixar muita gente desempregada.",
            "tem nada de justo ai, causar prejuizo que pode até levar a mais gente perder emprego não é justo",
            "parabéns por pesquisar, a maioria aqui só quer ódio pelo ódio.",
            "Pessoal aqui odeia mais um patrão do q o AH"
        ]
    },
    "CLT be like": {
        "title": "CLT be like",
        "score": 6,
        "url": "https://i.redd.it/2wz9e92p8c9d1.png",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Based on a real conversation ": {
        "title": "Based on a real conversation ",
        "score": 60,
        "url": "https://i.redd.it/1dor2f5t589d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "\"You know what else is soft\"",
            "Mas chefe, eu sou o tank.",
            "Sorry Boss, my proficiency is sleght of hands and stealth",
            "\"Você precisa trabalhar seus soft skills\" é um sinal de aviso que além de nunca mais ser promovido, você tá na lista dos que podem ser demitidos a qualquer momento.",
            "Ninguém mandou ser bárbaro, eu te falei pra pegar Bardo"
        ]
    }
}