{
    "Do I have a right to complain about cleaning this myself?": {
        "title": "Do I have a right to complain about cleaning this myself?",
        "score": 42,
        "url": "https://www.reddit.com/gallery/1drbzey",
        "content": "Long story short, I noticed a leak from my bathroom ceiling yesterday and submitted a maintenance request to have it looked at. I came home from work and found my bathroom in this state. Thinking that the ceiling had collapse, I found the maintenance guys and told them about it, but turns out they LEFT my apartment like this and basically told me “sorry we left it like that, but we’re busy and we’ll be back on Monday to patch it”. I complained to management and they said they would have them clean it right away, but I waited for an hour and no one and had come to clean it so I was forced to do it myself. While I understand that maintenance is busy and that the hole won’t be patched until Monday, I find it unacceptable for it to be left in this condition and then expect me to clean it. Is this worth further complaining about or would I be wasting my breath on it? I emailed management photos of the bathroom just as documentation ",
        "num_comments": 26,
        "comments": [
            "UH yeah you do.  I'd ask for some kind of compensation as well for doing maintenance's job.",
            "Every right!! find out what a professional charges and then tell them thats what you want",
            "Yes, definitely complain. This is ridiculous and they should be cleaning up before they leave.",
            "YES. And then report this building for structural integrity issues. And ask for money or decreased rent.",
            "Yeah fuck that. If you are paying rent they are supposed to fix this and clean it up.",
            "That's ridiculous! Any time someone comes in here to do any work they clean up after themselves. If I have to do anything, it's just some small wiping down to grab some residue left over from those industrial wipe cloths.",
            "I always have to clean up after maintenance. Annoys me. I have two kids and a lazy hubby, I have enough to clean up!",
            "Wow have you been feeling ill due to the mold?",
            "Ive always cleaned up after maintenance myself, but Im friends with them and assumed they just knew I didnt mind!",
            "Does that bathroom have a fan/vent that runs to remove humid air?\n\nThe sliver of the ceiling light I can see does not look like one."
        ]
    },
    "Apartment trying to get me to move out early, but refusing to prorate my rent. Offering my own money as a motivation.": {
        "title": "Apartment trying to get me to move out early, but refusing to prorate my rent. Offering my own money as a motivation.",
        "score": 71,
        "url": "https://www.reddit.com/gallery/1dqyz8v",
        "content": "",
        "num_comments": 41,
        "comments": [
            "Yeah they cant do that lol\n\nIf they want you out make them prorate your rent and let them know they need to provide you an itemized list of repairs and deductions from the security deposit, otherwise just stay until your lease is up and still request that list",
            "Honestly OP, sounds like theyre planning on keeping your security deposit on some trumped up bullshit if you dont move out early. \n\nThats how I read it anyway.",
            "I smell small claims ",
            "Tell Joan her offer is goofy",
            "This is the same apartment with the MAGA graffiti in the hall btw",
            "I love that they are on record that they plan to keep some of your security deposit if you dont agree to this.  Unless they already know the state of your apartment, this is great evidence of bad faith.",
            "Tell her either you get a discount on your last month's rent AND your full deposit back or you'll be out at the end of your lease, no other terms are acceptable and if they try to strongarm you you'll see them in court for the rest of your money.",
            "If they want you out early why cant they do the deposit + what your asking along with cash for keys for the inconvenience? Say $100 or $200 for keys",
            "This is upsetting to read lol this cannot be legal. Unless it's specifically stated in the lease agreement that they can do this. Otherwise, they're hoping you're naive and just do what they say. I was thinking maybe a few days early but almost a whole month?? Hell no",
            "Their behavior & idea sounds illegal. "
        ]
    },
    "Upstairs ": {
        "title": "Upstairs ",
        "score": 17,
        "url": "https://www.reddit.com/r/Apartmentliving/comments/1dr5poc/upstairs/",
        "content": "Whenever the kids upstairs are out of school or it's the goddamn weekend they are running,  screaming, and pounding at all hours of the night. I'm exhausted and so angry. Why do parents let their kids do this.\n \nFor many years when I was a kid we lived in a top floor apartment and it was always made very clear to me that quiet hours were important. It was okay for me to stay up but was not okay for me to be jumping around and shit at 2:00 in the fucking morning.",
        "num_comments": 19,
        "comments": [
            "I think I would go insane. I can't even stand my own kids being crazy lol and we abide by quiet hours. I'm sorry you're going through this.",
            "I've told my husband that kids don't know how to walk. They just run everywhere. I have lived in a few different apartments. There are pros and cons to living on the bottom and top, but I think I felt more insane when I lived on the bottom floor. \n\nI am so thankful we found an apartment in a single row of single story apartments. We live on the end and only have one neighbor beside us, and she is so quiet! I NEVER hear her at all!! She takes meds that make her sleep, and she goes to bed around 7 pm. My husband and I like to play 80s music/concerts on the weekends and have some cocktails, and she NEVER even hears us!!",
            "If it's past quiet hours, contact the LL/leasing office.",
            "I feel you. Apartments seem to attract the most inconsiderate people.",
            "I never knew kids can be evil  till my upstairs neighbors moved in 2 years ago. The father encourages his kids to make as much noise as possible because we complained on them several times they make so much noise everyone that comes over tells us its bad. Good luck this summer especially cus these parents never want to take them outside",
            "this is why ill never raise kids in an apartment. i know an apartment may be the only choice some people have when buying or renting, but i rather have a house first, get settled then have kids so i know they have the space to grow and be a kid. i feel bad that they dont have a yard to play in. their coped up in a small space.",
            "There's only eight units to our building. Very large apartments, too. We aren't single row but our apartments only share one wall and one ceiling/floor.",
            "Ill pray for you , in the lords name I pray amen, also blasphemy is one of the worst sins..God is greater than man, he listens! Being a downstairs neighbor is tough Ive heard!",
            "Oh hell no. In all fairness the kids aren't evil that's just where they're at with their moral development. Selfish and self-centered thinking is essential to a child's survival if you think about it. That's just fucking horrific parenting. I'm pretty sure I would be catching a charge if I found out the father was encouraging this kind of behavior. I don't believe in harming children but I sure shit would want to Deck the father",
            "We were raised in apartments/rentals, but we were always on the bottom floor. Maybe we didnt have a lot of space inside, but we spent a lot of time outside to make up for it."
        ]
    },
    "In a financial crisis": {
        "title": "In a financial crisis",
        "score": 2,
        "url": "https://www.reddit.com/r/Apartmentliving/comments/1drcwd7/in_a_financial_crisis/",
        "content": "Hello I (22M) desperately need help paying rent which is due Monday. After months of unemployment I finally picked up a job but haven't received my first paycheck yet (I'll get it on the 5th). My rent is $600. My apartment complex has threatened to evict me if I don't pay it and I'm really scared. I've never been homeless before and I don't know what to do. Please help. Thank you so much!",
        "num_comments": 3,
        "comments": [
            "They wont evict you overnight. Pay them when you get paid.",
            "I'd just pay it when you get paid. nothing else you can do",
            "Pay them when your paycheck comes."
        ]
    },
    "Stop giving your children whistles!": {
        "title": "Stop giving your children whistles!",
        "score": 83,
        "url": "https://www.reddit.com/r/Apartmentliving/comments/1dqp4y9/stop_giving_your_children_whistles/",
        "content": "Fuck. Why?!?! Why give your child a whistle? Is it for emergencies? If it is for a emergency situation, beat it into their thick skulls; the whistle is only ever to blown for emergencies. This constant blowing of the damn whistle to a damn song is very fucken annoying!",
        "num_comments": 58,
        "comments": [
            "Lol...I used to work for a company that did shows for children's parties. If the parents were assholes, I'd give all the kids kazoos right before I walked out the door.",
            "I loved when my kids had recorders for school . Good times! Almost as good as a whistle!",
            "Heres what you do. Get yourself an air horn. Every time the kid blows the whistle, go right under where they are at and blow for a bit. Repeat every single time. They will catch on! ",
            "oh my gosh yes. We live in a pool facing unit (never again. We moved in the winter and had no idea how bad the noise would be) but the children screaming for 10 hours a day at the pool is already bad enough, the other day someone decided to throw their kid a birthday party at the pool and guess what was in the party favor bags? Fucking whistles. Imagine 20 children screaming at the top of their lungs while simultaneously blowing 20 whistles as loud as they can consecutively for HOURS. I literally cried because I was so fucking frustrated. The office was also conveniently  closed so nobody could make an actual complaint",
            "Get a whistle and go to town. Right outside the foots of where these kids live.",
            "Stop giving them whistles and instead give them drums",
            "Oh this sounds awful. Im so sorry. Reach out to your building manager",
            "And get off my lawn!!! Darn, kids!",
            "Kids being kids at 2pm and kids being kids at 2am are totally different things",
            "common sense.  they know they are irritating the living shit outta everyone ,otherwise ."
        ]
    }
}