{
    "Apex University Discord Features": {
        "title": "Apex University Discord Features",
        "score": 539,
        "url": "https://www.reddit.com/r/apexuniversity/comments/ldqmcz/apex_university_discord_features/",
        "content": "[Apex University Discord](https://discord.gg/DZU25Za6qx)\n\n&#x200B;\n\nWelcome everyone,\n\n&#x200B;\n\nFirst the mod team would like to thank everyone for being part of this community and providing content and tips to other players, we know that there is a lot more that could be wished from the staffs side and we are currently trying to improve things day by day. Now here we are at 160k members which is amazing, we never expected the sub to grow that big when we started it, so once again thank you all for that!\n\n&#x200B;\n\nSince the beginning of this community the subreddit has naturally been and will continue to be the focal point of our efforts while our discord server started out as a way for the mod team to efficiently communicate about the subreddit, however over time as it became more active and we started putting more attention into making it a stronger extension of the sub and would therefor like to once again invite everyone to partake and explain a bit about what you can expect of the space both now and going forward:\n\n&#x200B;\n\n\\- 1on1 coaching\n\n&#x200B;\n\n\\- Group finding channel\n\n&#x200B;\n\n\\- Subreddit & Discord suggestions (easier for the mod team to have a discussion about the direction of the sub compared to over at Reddit)\n\n&#x200B;\n\n\\- Self-promotion channel & stream your games\n\n&#x200B;\n\n\\- Meta & strat chats\n\n&#x200B;\n\n\\- Off-topic and space to flex your gains\n\n&#x200B;\n\nWe are furthermore in the process of preparing some challenges in the discord, possibly with some smaller prizes. More to come on that in the future.\n\n&#x200B;\n\nIf you are looking for any of that we ask you all to join our discord xbox/ps4/computer, we welcome everyone! We hope to see you in our ever-growing community on discord.",
        "num_comments": 76,
        "comments": [
            "Does anyone have the code. That link will not work for me",
            "Link isn’t working for me on mobile, can you please send the full link so I can copy and paste please",
            "Link doesn’t work and doesn’t bring me to anything",
            "Hi can someone send me the link please? I can’t seem to get it to work",
            "Lol somehow link is not working. Could I please get it ?",
            "doesn’t work for me either",
            "I need the full link, it’s not working for me",
            "I need a psn team a home",
            "Link is not working for me\nLooking for a team",
            "Whats wrong with game ? İts not calculating kills and \nDamages or knockdowns"
        ]
    },
    "What legend is easy to learn but hard to master, and who is hard to learn but easy to master?": {
        "title": "What legend is easy to learn but hard to master, and who is hard to learn but easy to master?",
        "score": 10,
        "url": "https://www.reddit.com/r/apexuniversity/comments/1dr4syv/what_legend_is_easy_to_learn_but_hard_to_master/",
        "content": "",
        "num_comments": 48,
        "comments": [
            "I don’t know but you should play mirage",
            "learning wattson well is not easy",
            "Crypto has a really high skill floor, bloodhound is probably the easiest to master",
            "Newcastle and Gibby are easy on the paper but these legends need heavy game understanding to fill their role and not to grief.",
            "I feel like Lifeline has to be up there for easy to use hard to master. Playing with a top tier Lifeline is the best. Her kit is straight forward and she’s used by a lot of new players, but man oh man there’s so many little nuances to doing it right. If you have a rock star Lifeline on your team you’re almost impossible to kill, and same goes for playing against one. She can single handedly ruin a whole lobby just by knowing exactly how to keep her gunners alive and healthy. Shout out to all the great combat medics out there.",
            "Fuse is easy to learn but hard to master since having gamesense and aiming your grenades well makes him exponentially stronger.",
            "Pathfinder is hard to learn but easy to master. If you learn how to use his grapple properly, you can use it to get good angles on teams you wouldn't get on most other legends. He is also good for engagement and disengagement and map rotation for the whole team via his ult. A good solo legend all around.",
            "Is there any legend that's actually hard to learn? Most of the skills are pretty straightforward.\n\nHardest to master has got to be pathfinder. There's so many things to know about how grapple works, and you need to actually know movement techniques to play pathfinder to its full potential. Zipline jumping for example - idk if anyone can reliably pull it off if they're on roller, and even many on mnk can't do it every single time.",
            "Idk  if this goes for everyone but For me it was easy to learn alter but seems to be a lot of untapped potential with her ult \n\nstill trying figure out how to \"master \" her r",
            "Immediate thought is loba tbh"
        ]
    },
    "Not able to sign up for CC on Battlefy ": {
        "title": "Not able to sign up for CC on Battlefy ",
        "score": 1,
        "url": "https://i.redd.it/rtf1l6quai9d1.png",
        "content": "I accepted the rules\nMy account is valid\nMy EA acc is clearly connected\nIf I hit next it says Connect EA account\nI don't know what to do with Device - Persona as it's not something that clickable or anything.\nI need this account sooner rather than later can someone please help if they know what's going on!",
        "num_comments": 0,
        "comments": []
    },
    "Love the sentinel ": {
        "title": "Love the sentinel ",
        "score": 0,
        "url": "https://v.redd.it/o7ted5eesh9d1",
        "content": "Having a good old time",
        "num_comments": 1,
        "comments": [
            "1-2x on a Sentinel? You must be a psychopath."
        ]
    },
    "AA feels stronger on lower sens ?": {
        "title": "AA feels stronger on lower sens ?",
        "score": 0,
        "url": "https://www.reddit.com/r/apexuniversity/comments/1dr74wb/aa_feels_stronger_on_lower_sens/",
        "content": "Hi\n\nI feel that AA feels stronger on lower sens, 3-2 instead of 4-3. I know its just a feeling because AA is the same. But why do I feel this, what is my error I should Work on ? I prefer 4-3 overall for the movement, but aim is stronger on 3-2 with 3 set for X2 and more optics. ",
        "num_comments": 8,
        "comments": [
            "Because youre not fucking it up as much on lower sens",
            "the aa strength is the same. Just on higher sens it's easier to yank your aim away from the assist and add human error to the equation.\n\nIf you want to beam on higher sens you'll need more precise control",
            "Aim assist is technically a little stronger on lower sensitivities, but it's not a huge difference. As others have said, it's most likely just that you're not yanking away from aim assist with the lower sense.",
            "This is such an absurd sentence lmao, adding human error to a game all about human skill.",
            "Is it actually stronger though? Or just relatively stronger?",
            "Playing on controller requires no skill tho",
            "It's actually stronger( by a little bit). Some Japanese players have been using 4-1 linear and then adjusting the sense up in the alcs to take advantage of it(there's a glitch where you can adjust the sense using alcs but still keep the numerical sensitivity). In addition numerical sense also has slightly better aim assist than alcs. \n\nThough these are very slight differences and probably not applicable to OP.\n\nHere's a link to a video that explains it [link](https://youtu.be/nANFfCC5cI0?si=nhwqChJO7YpAEzUy)",
            "[https://www.youtube.com/watch?v=UH20tK1pr9o](https://www.youtube.com/watch?v=UH20tK1pr9o)\n\n  \ndoesnt matter"
        ]
    }
}