{
    "Weekly Question and Request Thread": {
        "title": "Weekly Question and Request Thread",
        "score": 42,
        "url": "https://www.reddit.com/r/ApexUncovered/comments/12a8tot/weekly_question_and_request_thread/",
        "content": "Post any questions, requests for info and any low effort topics here.",
        "num_comments": 92,
        "comments": [
            "Any updates on Horizons hairluom?",
            "Anyone noticing a bunch of bots in their servers recently??",
            "Sorry, your [submission](https://www.reddit.com/r/ApexUncovered/comments/12a8tot/weekly_question_and_request_thread/) in /r/ApexUncovered was removed because the post was not long enough to encourage a meaningful discussion. Please note, this action was performed automatically, and adding characters in an attempt to circumvent this filter will result in an automatic ban from /r/ApexUncovered.\n    \n- Please **do not** send us ModMail asking to manually approve a post. We will not make any exceptions.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ApexUncovered) if you have any questions or concerns.*",
            "Any news on when the firefighter lifeline skin will release?",
            "Is it true the old battle pass cosmetics will be returning in season 17? I saw someone say season 1-10 items will return for recolor and 11- now will be available for purchase",
            "any idea what other weeks rewards for FF event will be? Curious if i should save my rewards",
            "Not quite relevant but why does thordan smash play on consoles for his footage in his videos?",
            "Is there a new glitch to change city on console ? I am un belgium and i like to buy the caustic évent but i cant because im from belgium . Thé glitch on EA website doesnt work anymore",
            "Can information around crafter, beacon, armor, weapon spawn rates be found by datamining or is it only possible to find this information through manual measurement?",
            "Anyone else getting stuck in a replicator?"
        ]
    },
    "Weekly Discussion Thread | June 26, 2024 - July 02, 2024": {
        "title": "Weekly Discussion Thread | June 26, 2024 - July 02, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/ApexUncovered/comments/1doqcb9/weekly_discussion_thread_june_26_2024_july_02_2024/",
        "content": "This thread is for discussion, and will be updated weekly. For more information, check our [rules page](https://www.reddit.com/r/ApexUncovered/wiki/rules).",
        "num_comments": 5,
        "comments": [
            "I really gave quads a try and it's just terrible. SQ the mode means 4/5 matches I don't have a full team lol. I either do all the kills/damage or nothing at all. I'm against penalties in casual playlist but when it's that big of a party you need it (maybe add the mixtape penalty). Overall won twice and it was meh?",
            "Hi, does anyone having trouble with the game the new split update? Ive tried repair my game, uninstall and install again, drivers are updated aswell and the game keeps freezing when I enter a game or firing range, even in the lobby after a couple min. (sorry for my english)",
            "Aside from District for next season, what are the other changes that could potentially be introduced?",
            "Is there any news on Duos returning for the next season?",
            "In my opinion it also depends on the characters chosen because so far I noticed that many had Assault or Skirmisher when it would be better to have more variety, however for me it is slightly better than the Solos."
        ]
    },
    "During the loading screen I was like this, does that mean players are initially on the map before being in the dropship?": {
        "title": "During the loading screen I was like this, does that mean players are initially on the map before being in the dropship?",
        "score": 129,
        "url": "https://i.redd.it/cblqa8eo569d1.jpeg",
        "content": "",
        "num_comments": 15,
        "comments": [
            "There was a bug back in season 7 I think it was, where you could still punch while you were in this screen since you were somewhere on the map, and you could actually punch and kill other players during the black screen while you were loading into the lobby. I did this just to see what would happen and I ended up knocking a guy before the game even started, saw where his downed body landed out of the drop ship, followed him and finished him.\n\nThinking back, I feel really bad and it was a horrible thing to do since he could literally do nothing about it. But it was in the name of science. I still have the clip of it saved somewhere. But to answer your question, yeah, players are initially on the map before loading in.\n\nEdit: Someone asked for the clip so I sifted through years worth of hundreds of clips and found it. I had to upload it to my YouTube to get it off my PS4, but here it is. It's from June 2019, so it was in season 2. I was definitely way off when I said season 7. \n\n[https://www.youtube.com/watch?v=doexa62u75Y](https://www.youtube.com/watch?v=doexa62u75Y)",
            "Yes, players are in the map before the dropship. The start / end screens are also part of the map in all modes.",
            " Yea, I had this exact bug few seasons ago\nafaik your character teleports to the drophip when you jump out of it",
            "i’ve had this bug several times this season, lol",
            "Yeah kinda, there's already player banners on the map displays and you can hear the audio and in tdm modes it used to goof up abit where ui can't catch up with whatever is going on",
            "I'd like that or the ALGS style drop ship on POI's.\nInstead of jump master and usual hit landing",
            "All good, just 1 time out of curiosity, remember this shit bug… suffered a lot",
            "Same thing happened to me. We all loaded on the ship that parked right next to the ring in Olympus, and I was one of the few people that could move.\n\nAnd then all hell broke loose when everyone was able to move! It was one of the craziest gaming moments I’ve ever seen.\n\nAnother crazy thing that happened to me in this game was finding at least 30 death boxes in the lab at Hydro Dam. Wish I could share the screenshot that I took back in 2019, But sadly I don’t have it anymore. My PS4 just died out of nowhere for no reason a few months later",
            "> Thinking back, I feel really bad and it was a horrible thing to do since he could literally do nothing about it. But it was in the name of science.\n\nGLaDOS moment. Or Caustic.",
            "Would love to see this! lol"
        ]
    },
    "\"OG\" Weapon Versions Added in S21.1 Patch": {
        "title": "\"OG\" Weapon Versions Added in S21.1 Patch",
        "score": 116,
        "url": "https://x.com/Osvaldatore/status/1806330392607367390",
        "content": "",
        "num_comments": 72,
        "comments": [
            "Prowler select fire??? 🙏🏼🙏🏼🙏🏼🙏🏼",
            "If OG Apex doesn’t have the punch supply bin and launch yourself bug then I ain’t interested.",
            "It seems like Respawn is actively trying to bring back players that left over the last few seasons with quads/OG weapons mode. I've got 3 friends that tapped out of Apex a season or two ago and they're back online playing quads since we can finally play as a 4 man. I imagine the OG weapons mode will have the same effect for some that want a hit of nostalgia.",
            "A brief recap of what \"OG weapons\" means:\n\n- Weapons added after the L-STAR do not exist\n- Wingman 12 mag size and 186 RPM\n- Mastiff in Care Package with 4 mag size and 144 max damage per shot\n- R-99 with 216 DPS and 30 mag size\n- HAVOC hitscan beam mode\n- Prowler full auto mode\n- L-STAR in Care Package with reload function, 210 DPS, but why bother\n- no Energy Mags (TT users in shambles)\n- Alternator being an \"attachment holder\" for R-301/R-99 (fucking useless)\n- Barrels for every weapon that was compatible with them\n- Laser-compatible weapons having twice as accurate hipfire due to hipfire nerf reversal and lack of Lasers\n- Hopups in rotation: Selectfire (HAVOC & Prowler), Choke (TT & PK), Skullpiercer (Wingman & DMR), Turbocharger (HAVOC & Devotion)\n- and more",
            "Big companies of battle Royale be like:\n\nIf all else fails, back to OG",
            ">Select Fire Havoc returns\n\nMY BELOVED IS BACK\n\nhttps://i.redd.it/gvranmwbe59d1.gif",
            "I'd suck pepe for selectfire prowler",
            "Day 1 wingman would go nuts",
            "I thought bout this but for legends for a while.",
            "A version of the game where they didn't nerf the shit out of hipfire? Sign me up"
        ]
    },
    "Didnt learn their lesson what a shit take": {
        "title": "Didnt learn their lesson what a shit take",
        "score": 184,
        "url": "https://i.redd.it/j8k6svsngy8d1.png",
        "content": "",
        "num_comments": 93,
        "comments": [
            "Love the fact that probability of opening a legendary item is only 22%, even though half of all items a legendaries. Sure ill take my purple trash, thanks!",
            "What lesson is there for them to learn? These probably go well for them and make them a ton of money.\n\nThey're awful for players but probably great for stock portfolios and earning calls.",
            "If the packs would all be the same price and not increasingly expensive I would buy this event but I assume it’ll be like the caustic skin one and go up every pack and ~200 isn’t worth these skins and no mythic",
            "Love Mirage. Refuse to support this shit lol",
            "The worst part is the skins are actually really good 🥲",
            "At some point in the very near future crafting metals are gonna be exclusively for crafting standard stuff and they’ll quietly discontinue them from being used in events. I’m surprised it took them this long tbh there’s no low they won’t go to",
            "Last time there were far fewer items too, so you had a pretty good chance of rolling the skin you wanted. What a bunch of scumbags.",
            "These seem to sell like crazy, so they *did* learn their le$$on",
            "Not playing this game anymore.   Too much too often",
            "The problem that people dont seem to realise is they are selling a reactive skin for 160 its not a mythic or anything that is remotely worth the price. They even said they would never do it again but here we are"
        ]
    }
}