{
    "Apex University Discord Features": {
        "title": "Apex University Discord Features",
        "score": 535,
        "url": "https://www.reddit.com/r/apexuniversity/comments/ldqmcz/apex_university_discord_features/",
        "content": "[Apex University Discord](https://discord.gg/DZU25Za6qx)\n\n&#x200B;\n\nWelcome everyone,\n\n&#x200B;\n\nFirst the mod team would like to thank everyone for being part of this community and providing content and tips to other players, we know that there is a lot more that could be wished from the staffs side and we are currently trying to improve things day by day. Now here we are at 160k members which is amazing, we never expected the sub to grow that big when we started it, so once again thank you all for that!\n\n&#x200B;\n\nSince the beginning of this community the subreddit has naturally been and will continue to be the focal point of our efforts while our discord server started out as a way for the mod team to efficiently communicate about the subreddit, however over time as it became more active and we started putting more attention into making it a stronger extension of the sub and would therefor like to once again invite everyone to partake and explain a bit about what you can expect of the space both now and going forward:\n\n&#x200B;\n\n\\- 1on1 coaching\n\n&#x200B;\n\n\\- Group finding channel\n\n&#x200B;\n\n\\- Subreddit & Discord suggestions (easier for the mod team to have a discussion about the direction of the sub compared to over at Reddit)\n\n&#x200B;\n\n\\- Self-promotion channel & stream your games\n\n&#x200B;\n\n\\- Meta & strat chats\n\n&#x200B;\n\n\\- Off-topic and space to flex your gains\n\n&#x200B;\n\nWe are furthermore in the process of preparing some challenges in the discord, possibly with some smaller prizes. More to come on that in the future.\n\n&#x200B;\n\nIf you are looking for any of that we ask you all to join our discord xbox/ps4/computer, we welcome everyone! We hope to see you in our ever-growing community on discord.",
        "num_comments": 76,
        "comments": [
            "Pog",
            "Pog",
            "Does anyone have the code. That link will not work for me",
            "Link isn’t working for me on mobile, can you please send the full link so I can copy and paste please",
            "Just a warning, people in this discord can be kinda toxic. Made a harmless comment in the #venting channel about being frustrated that I threw a potential 4k damage game and had some people start making fun of my name for no reason. Not a big deal but just unnecessary and rude. Could've been a fluke but if that's how people act on that discord then I'd stay away",
            "Link doesn’t work and doesn’t bring me to anything",
            "Hi can someone send me the link please? I can’t seem to get it to work",
            "Same. Link please",
            "Link isn’t working",
            "Lol somehow link is not working. Could I please get it ?"
        ]
    },
    "What legend is easy to learn but hard to master, and who is hard to learn but easy to master?": {
        "title": "What legend is easy to learn but hard to master, and who is hard to learn but easy to master?",
        "score": 5,
        "url": "https://www.reddit.com/r/apexuniversity/comments/1dr4syv/what_legend_is_easy_to_learn_but_hard_to_master/",
        "content": "",
        "num_comments": 17,
        "comments": [
            "I don’t know but you should play mirage",
            "Newcastle and Gibby are easy on the paper but these legends needs heavy game understanding to fill their role and not to grief.",
            "Crypto has a really high skill floor, bloodhound is probably the easiest to master",
            "Fuse is easy to learn but hard to master since having gamesense and aiming your grenades well makes him exponentially stronger.",
            "learning wattson well is not easy",
            "Is there any legend that's actually hard to learn? Most of the skills are pretty straightforward.\n\nHardest to master has got to be pathfinder. There's so many things to know about how grapple works, and you need to actually know movement techniques to play pathfinder to its full potential. Zipline jumping for example - idk if anyone can reliably pull it off if they're on roller, and even many on mnk can't do it every single time.",
            "Idk  if this goes for everyone but For me it was easy to learn alter but seems to be a lot of untapped potential with her ult \n\nstill trying figure out how to \"master \" her r",
            "Pathfinder, Pretty simple kit, Set up zipline and use your zip to take height. It gets a bit more complicated when you factor in precise swinging to get into buildings or small tricks like using the zip on the ground for momentum when you have nothing to swing off of and many many more moves that takes a ton of time to master. Not to mention he's built like a fridge so he loses fights up close so positioning is a skill in itself.\n\nId say the hardest to learn but easy to master would probably be Ballistic. It's not that he's a hard legend on paper its just on controller its very awkward to remember to not only swap over to your 3rd weapon during fights, It sometimes just doesn't work if you hold it too long because then it pulls up the emote wheel. Not to mention having to remember to actually equip weapons onto your sling. Even with over 5k+ hours of playtime i still sometimes struggle with him when i do get the itch to pick him up. \n\nBut kit wise, Hes pretty easy to master since all he got is extra gun and overheat nothing too fancy outside of that. He doesn't have any technical moves outside of looking up before shooting your whistler so it can go over cover.",
            "I feel like Lifeline has to be up there for easy to use hard to master. Playing with a top tier Lifeline is the best. Her kit is straight forward and she’s used by a lot of new players, but man oh man there’s so many little nuances to doing it right. If you have a rock star Lifeline on your team you’re almost impossible to kill, and same goes for playing against one. She can single handedly ruin a whole lobby just by knowing exactly how to keep her gunners alive and healthy. Shout out to all the great combat medics out there.",
            "Immediate thought is loba tbh"
        ]
    },
    "Adaptive fps above my monitor refresh on gsync": {
        "title": "Adaptive fps above my monitor refresh on gsync",
        "score": 1,
        "url": "https://www.reddit.com/r/apexuniversity/comments/1dr6vs9/adaptive_fps_above_my_monitor_refresh_on_gsync/",
        "content": "God I hate nerding out over optimizations but my current FPS with gsync and the adaptive fps combination is above my refresh rate of 165 (it's 173) so my dvs min and dvs Max are set at 6090, if I set them at 5950 it goes to 158 fps which people recommend to go below your monitors refresh rate for gsync. I just assumed with adaptive fps that it went to whatever your monitor was outputting ",
        "num_comments": 0,
        "comments": []
    },
    "Has the xp you get changed?": {
        "title": "Has the xp you get changed?",
        "score": 1,
        "url": "https://www.reddit.com/r/apexuniversity/comments/1dr6e5o/has_the_xp_you_get_changed/",
        "content": "I haven't been on for a while and I don't remember the xp being so low. Is it just me or has it changed?",
        "num_comments": 0,
        "comments": []
    },
    "Did Seer get a buff?": {
        "title": "Did Seer get a buff?",
        "score": 3,
        "url": "https://www.reddit.com/r/apexuniversity/comments/1dqyr3e/did_seer_get_a_buff/",
        "content": "Why is everyone in ALGS running Seer now instead of Bloodhound? I didn’t see anything in the notes but sometimes they change things that they don’t tell us. Like Wattson getting like double the passive shield regen now and it’s faster I believe.",
        "num_comments": 15,
        "comments": [
            "They removed bloodhounds ability to see through smoke so seer is the next best choice.",
            "Bloodhound got nerfed that's why",
            "scan legends are inherently OP + being able to map room scan helps on rotates",
            "bloodhound's ult no longer pierces through bang smoke, which was their entire niche in ALGS play.",
            "Consistent scans for a push on a spot a team was holding is wildly busted",
            "Seer can see(sort off) through bangalore smoke and caustic gas.",
            "It’s pretty much because bloodhound doesn’t scan through smoke or gas anymore with ultimate ",
            "Because they don’t have the skills for Crypto.  I don’t either, lol",
            "Blood hounds scan can. His ult cant see through smoke or gas anymore.",
            "He can scan, he just can’t ult see through"
        ]
    }
}