{
    "Weekly Question and Request Thread": {
        "title": "Weekly Question and Request Thread",
        "score": 45,
        "url": "https://www.reddit.com/r/ApexUncovered/comments/12a8tot/weekly_question_and_request_thread/",
        "content": "Post any questions, requests for info and any low effort topics here.",
        "num_comments": 92,
        "comments": [
            "Any updates on Horizons hairluom?",
            "Any news on when the firefighter lifeline skin will release?",
            "Is it true the old battle pass cosmetics will be returning in season 17? I saw someone say season 1-10 items will return for recolor and 11- now will be available for purchase",
            "any idea what other weeks rewards for FF event will be? Curious if i should save my rewards",
            "Not quite relevant but why does thordan smash play on consoles for his footage in his videos?",
            "Is there a new glitch to change city on console ? I am un belgium and i like to buy the caustic vent but i cant because im from belgium . Th glitch on EA website doesnt work anymore",
            "Can information around crafter, beacon, armor, weapon spawn rates be found by datamining or is it only possible to find this information through manual measurement?",
            "Anyone else getting stuck in a replicator?",
            "Is there any clue or indicator lifelines heirloom/prestige skin is ?",
            "So the event is just control? Lame"
        ]
    },
    "Weekly Discussion Thread | June 26, 2024 - July 02, 2024": {
        "title": "Weekly Discussion Thread | June 26, 2024 - July 02, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/ApexUncovered/comments/1doqcb9/weekly_discussion_thread_june_26_2024_july_02_2024/",
        "content": "This thread is for discussion, and will be updated weekly. For more information, check our [rules page](https://www.reddit.com/r/ApexUncovered/wiki/rules).",
        "num_comments": 5,
        "comments": [
            "I really gave quads a try and it's just terrible. SQ the mode means 4/5 matches I don't have a full team lol. I either do all the kills/damage or nothing at all. I'm against penalties in casual playlist but when it's that big of a party you need it (maybe add the mixtape penalty). Overall won twice and it was meh?",
            "Hi, does anyone having trouble with the game the new split update? Ive tried repair my game, uninstall and install again, drivers are updated aswell and the game keeps freezing when I enter a game or firing range, even in the lobby after a couple min. (sorry for my english)",
            "Aside from District for next season, what are the other changes that could potentially be introduced?",
            "Is there any news on Duos returning for the next season?",
            "In my opinion it also depends on the characters chosen because so far I noticed that many had Assault or Skirmisher when it would be better to have more variety, however for me it is slightly better than the Solos."
        ]
    },
    "During the loading screen I was like this, does that mean players are initially on the map before being in the dropship?": {
        "title": "During the loading screen I was like this, does that mean players are initially on the map before being in the dropship?",
        "score": 135,
        "url": "https://i.redd.it/cblqa8eo569d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "Yes, players are in the map before the dropship. The start / end screens are also part of the map in all modes.",
            " Yea, I had this exact bug few seasons ago\nafaik your character teleports to the drophip when you jump out of it",
            "ive had this bug several times this season, lol",
            "Yeah kinda, there's already player banners on the map displays and you can hear the audio and in tdm modes it used to goof up abit where ui can't catch up with whatever is going on",
            "I'd like that or the ALGS style drop ship on POI's.\nInstead of jump master and usual hit landing",
            "All good, just 1 time out of curiosity, remember this shit bug suffered a lot",
            "> Thinking back, I feel really bad and it was a horrible thing to do since he could literally do nothing about it. But it was in the name of science.\n\nGLaDOS moment. Or Caustic.",
            "Would love to see this! lol",
            "You got the season wrong twice lol, it was Season 3, you were on Worlds Edge which wasnt a map yet in season 2",
            "That does check out, there are times where I've been bugged in the loading screen, the Thunderdome for example, and I can see people move.     \n     \nAlso if you're a Recon/Controller Legend and the part of the map the loading screen is showing you can see the icons for Survey Beacons or Ring Consoles. Which also tells you the game registers what Legend you are before you even select one in the selection screen, so the selection screen is more of a confirmation screen?"
        ]
    },
    "\"OG\" Weapon Versions Added in S21.1 Patch": {
        "title": "\"OG\" Weapon Versions Added in S21.1 Patch",
        "score": 117,
        "url": "https://x.com/Osvaldatore/status/1806330392607367390",
        "content": "",
        "num_comments": 72,
        "comments": [
            "If OG Apex doesnt have the punch supply bin and launch yourself bug then I aint interested.",
            "It seems like Respawn is actively trying to bring back players that left over the last few seasons with quads/OG weapons mode. I've got 3 friends that tapped out of Apex a season or two ago and they're back online playing quads since we can finally play as a 4 man. I imagine the OG weapons mode will have the same effect for some that want a hit of nostalgia.",
            "Big companies of battle Royale be like:\n\nIf all else fails, back to OG",
            "I'd suck pepe for selectfire prowler",
            "Day 1 wingman would go nuts",
            "I thought bout this but for legends for a while.",
            "A version of the game where they didn't nerf the shit out of hipfire? Sign me up",
            "Will we get old lifeline and wraith too",
            "I was just thinking about how much the game has changed since launch. I wonder if its OG legends only with Kings Canyon as the single map, or if itll be modern Apex just with OG guns.",
            "Since it was leaked in the story cutscenes that Alter gave Horizon a piece of the ark to power the time gauntlet, odds are she'll use it and cause us to get this OG mode by time travel."
        ]
    },
    "Didnt learn their lesson what a shit take": {
        "title": "Didnt learn their lesson what a shit take",
        "score": 187,
        "url": "https://i.redd.it/j8k6svsngy8d1.png",
        "content": "",
        "num_comments": 93,
        "comments": [
            "Love the fact that probability of opening a legendary item is only 22%, even though half of all items a legendaries. Sure ill take my purple trash, thanks!",
            "What lesson is there for them to learn? These probably go well for them and make them a ton of money.\n\nThey're awful for players but probably great for stock portfolios and earning calls.",
            "If the packs would all be the same price and not increasingly expensive I would buy this event but I assume itll be like the caustic skin one and go up every pack and ~200 isnt worth these skins and no mythic",
            "The worst part is the skins are actually really good ",
            "At some point in the very near future crafting metals are gonna be exclusively for crafting standard stuff and theyll quietly discontinue them from being used in events. Im surprised it took them this long tbh theres no low they wont go to",
            "Last time there were far fewer items too, so you had a pretty good chance of rolling the skin you wanted. What a bunch of scumbags.",
            "These seem to sell like crazy, so they *did* learn their le$$on",
            "Not playing this game anymore.   Too much too often",
            "The problem that people dont seem to realise is they are selling a reactive skin for 160 its not a mythic or anything that is remotely worth the price. They even said they would never do it again but here we are",
            "Exactly what is a shit take?"
        ]
    }
}