{
    "Daily Advice Thread - June 22, 2024": {
        "title": "Daily Advice Thread - June 22, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/apple/comments/1dls9jo/daily_advice_thread_june_22_2024/",
        "content": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar.\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing for quickest answer time.",
        "num_comments": 3,
        "comments": [
            "Looking at buying a MacBook for my last year of my computer science degree. I may do grad school and plan to use it for my eventual job after my degree. I do web design, general programming, work with databases, and do 2D game design in my free time. I was leaning towards either getting the M3 air with 24GB of RAM or waiting for the next pro this winter and sticking it out with my current laptop. Can anyone with a similar workflow help me decide which may be best? I want this to be my daily driver for the next 3-4 years as I upgrade every other generation at earliest. It’s not about “oh should I wait for what’s around the corner” it’s more so I want to get what’s best for my needs.\n\nAlso I’ve never gotten a MacBook new before so I don’t know if they’re expected to refresh the pro this September or if it’s going to be closer to December/January",
            "Is there a problem in not using magsafe with the macbook pro m2? It comes with a 140W charger, the problem is that I'm going to use a dock, and the macbook will only draw 89W from it. Can this impact performance?",
            "Hello! \n\nI am considering treating myself to a new laptop after my trusty 8-years-old Macbook Air has been having lots of problems. \n\nI used Mac Book Pro at work, and loved it, so thinking to get that. \n\nI just heard about 'Apple Intelligence' coming out, and that it will be a software update into Macs in M series. I want to have access to this Apple Intelligence feature / capability. \n\nEven though the announcement says it will be available to M series, so if I buy an M series Mac now, I will get Apple Intelligence... I wanted to confirm with this community of more experienced Apple consumers, before I make the purchase. \n\nWould I be better off waiting until Apple Intelligence has already been pushed out as a software update, and perhaps get the next version of Macs after that, to make sure Apple Intelligence functions properly / optimally by getting the next gen hardware? \n\nOr do you think just getting M series Macbook Pro currently sold at Apple will do the trick?  I am looking at M3 Pro, 12-Core CPU\n18-Core GPU\n18GB Unified Memory\n512GB SSD Storage¹\n\nThere is also the 36 GB Unified Memory version which is $400 more. Is that better for the Apple Intelligence? \n\n\nSorry if these are naive questions, I am not an experienced Apple shopper..."
        ]
    },
    "WWDC 2024 - Post-Event Megathread": {
        "title": "WWDC 2024 - Post-Event Megathread",
        "score": 479,
        "url": "https://www.reddit.com/r/apple/comments/1dct23m/wwdc_2024_postevent_megathread/",
        "content": "**Wow, what a day!**\n\n**What we saw**\n\n* TV+ Showreel (Severance!!!!\n* VisionOS updates\n* iOS 18 getting some major updates and redesigns\n* WatchOS health updates\n* TV, widescreen and smaller changes\n* macOS Sequoia, direct phone interactions, Gaming showcases\n* \"Apple Intelligence\", damn, many interesting quality of life features being introduced. Highlighting all M-Series chips and A17 Pro.\n* Developers get to integrate with built in AI features with their apps for systemwide support\n* Xcode genAI and questions\n\n**Watch**\n\n[https://www.apple.com/apple-events/](https://www.apple.com/apple-events/)",
        "num_comments": 1102,
        "comments": [
            "never forgetting the yay sound effect after the calculator app reveal 😭😭😭",
            "Every email and text in the future will just be AI talking to one another",
            "Tim Cook is shouting from the roof, Craig and the exec team skydiving, Mike Rockwell in a Vision Pro, Apple video team budget at an all time high. Seat belts on folks, its a big one this year\n\nImpressions:\n\n**visionOS 2**\n\n- 2k native apps, 1.5m compatible apps\n- Photos: ML to turn 2D photos into 3D spatial photos, Shareplay\n- Quick access hand gesture menu\n- Mac Virtual Display supports different screen sizes including ultra wide which simulates two 4k monitors side by side\n- Travel mode adds train support\n- Cannon will sell a spatial lens for their cameras\n- Other - rearrange home screen, mouse support, new APIs, available in 8 more countries \n\n**iOS 18**\n\n- Home Screen\n\t- App icons and widgets can be placed anywhere\n\t- Adds ability to tint all apps by color, dark mode darkens app icons\n\t- Lock or hide apps\n- Control Center\n\t- Multiple pages including full screen home and music widgets\n\t- developers can build for control center too\n- Swap lock screen controls for other actions - finally!\n- Secure Bluetooth pairing for apps that looks like how AirPods pair\n- Messages: \n\t- Tapbacks support any emoji or sticker now\n\t- Scheduled messages\n\t- Text formatting\n\t- Text effects \n- iMessage and SMS via satellites - I feel like this would have been a huge feature any other year\n- Mail: \n\t- On device categorization\n\t- AI powered digest of emails\n- Photos App has been redesigned entirely with filters for screenshots, pinning, grouped people photos\n- Other\n\t- Maps - Topographic maps\n\t- Tap to Cash - pay each other by tapping phones\n\t- Better event tickets\n\t- Journal app adds features like stats and streaks\n\t- Game mode in iPhone\n\t- Reminders in calendar\n\t- RCS support launching\n\n**AirPods**\n\n- Nod yes or shake for no to respond to Siri\n- Voice isolation for Windy or loud environment \n\n**tvOS**\n\n- Insight in video to identify actors and music\n- Adjust voice in video to make them clear - now we can finally know what Michael Caine said in Interstellar\n- Supports 21:9 projectors for those of you with full theater set ups in this economy\n\n**watchOS 11**\n\n- Training Mode - measure intensity, duration, effort, training load\n- Fitness app - cards can be reorganized\n- Vitals App - check key metrics like heart rate and insights over time\n- Cycle Tracking app - supports pregnancy and gestational metrics - Now Apple can sell a million watches to anxious first time parents\n- Widget stack sorts itself based on context like weather changes and ongoing Uber rides\n- New watch faces created by an AI selecting your good photos and reframing them\n\n**iPad OS**\n\n- Redesigned apps with a more Vision Pro like animated tab bar \n- Shareplay - draw on or even remotely control other peoples screen - big day for \n- HOLD THE PRESSES - CALCULATOR APP IS HERE\n\t- Math Notes - handwrite expressions with variables with Apple Pencil and it will automatically solve them. supports graphs as well\n\t- Math in Notes app too\n\t- Now what will this subreddit complain about anymore?\n- Notes Smart Script \n\t- makes your unreadable handwriting look good. I know some people who need this badly\n\t- Spell check for handwriting\n\t- Automatically shifting words around as you write\n\n**macOS Sequoia**\n\n- Were not even halfway in and absolutely blowing through these platforms, hmmm I wonder what they are saving time for, what a mystery\n- Continuity\n\t- iPhone Mirroring - a lot of Android manufacturers have been doing this for a while now and its a very welcome addition here, sometimes you just want to quickly access a thin on your phone\n\t- iPhone notifications can go to mac now and automatically trigger iPhone Mirroring\n- Tiling and snapping to edges/corners - finally!\n- Presenter preview for screens sharing, background replacement\n- Passwords App - surfaces iCloud Keychain features - imo much needed as 1Password is one of my most used apps because it is surfaced\n- Safari\n\t- Highlights - identify and surface key info from a webpage\n\t- Reader - summarizes websites - still no mention of AI\n\t- Automatic picture in picture\n- Gaming\n\t- Metal 3\n\t- Game Porting Toolkit 2 with better support for Windows Games - we got a mention of MS Windows before AI\n\t- Coming to Mac: Frostpunk 2, Control, Assassins Creed Shadows, \n\n**Apple Intelligence**\n\n- \"AI for the rest of us\" - Craig\n- Writing tools available across the system\n\t- Proofreading\n\t- Write emails and notes\n\t- Summarization for emails as well as email snippets\n\t- Asks you questions to generate a response\n\t- Inbox summaries\n- Notification summaries, selective surface only important notifications to reduce interruptions\n- Can use your OS for you to do tasks like pulling up apps to play music and creating folders\n- Understands personal context from aggregated data across the system\n- GenMoji to create a custom emoji\n- Image Playground\n\t- Create images across the system including of people in iMessages\n\t- Makes it easier to create images based on traits and styles\n\t- Happens entirely on device\n\t- Image Wand can convert a rough sketch into a better image\n- Can create videos based on concepts and find photos from a long time period to tell a story\n- Record and transcribe audio in notes and phone\n- Privacy\n\t- On device processing on A17 and all M chips\n\t- Private Cloud Compute for large server based models\n\t- Data is never stored or shared with Apple\n\t- Verifiable software for independent researchers\n\n**Siri**\n\n- Better language understanding that understands corrections and context\n- Type to Siri\n- Siri can help with tech support for Apple products\n- On-screen awareness - can ask for things to be done based on info on the screen\n- Command Siri to take photos, take notes, or search for something across the system including actions in videos\n- Can do compound understanding like finding a drivers license number and typing it into a form for you or finding a persons flight number and finding its live status to determine if it works with existing lunch plans\n- Rest in peace standalone AI gadgets like Rabbit R1 and Humane Ai Pin, we hardly knew ye\n\n**ChatGPT 4o**\n- Siri can go ask ChatGPT for things like answer general knowledge questions and generate more complex images\n- Free and info not logged, chatGPT subscribers can access paid features\n- Other AI models will be added in the future - sure, throw Google a bone too I guess\n\nWhew! What a day, this was probably the most jam packed WWDC I have watched in a long time. They definitely went deeper on integration that I thought they would. Hats off to the developers working crazy hours to make the features announced a reality.",
            "I’m here to overreact. And also download a beta I have no business downloading.",
            "Gimme the betaaaaaaaaaaaaa",
            "GIVE IT TO ME RACHEL",
            "confirmed 15 pro only\n\n> Apple Intelligence will be available in beta on iPhone 15 Pro, iPhone 15 Pro Max, and iPad and Mac with M1 and later, with Siri and device language set to U.S. English, as part of iOS 18, iPadOS 18, and macOS Sequoia this fall.\n> Some features, additional languages, and platforms will be coming over the course of the next year.",
            "The AI stuff seems cool, but...\n\nCALCULATOR FOR IPAD IS HAPPENING",
            "So only the 15 and onward will be able to use the AI. I kinda figured, but this sucks because my 13 Pro still runs great\n\nProbably gonna have to wait a few years to use the AI because it makes no sense to upgrade",
            "I’m gonna be honest, quality of life updates made me way more excited than just some mind blowing “revolutionary” feature people in this sub want every year seemingly lol"
        ]
    },
    "Apple Won’t Roll Out AI Tech In EU Market Over Regulatory Concerns": {
        "title": "Apple Won’t Roll Out AI Tech In EU Market Over Regulatory Concerns",
        "score": 3306,
        "url": "https://www.bloomberg.com/news/articles/2024-06-21/apple-won-t-roll-out-ai-tech-in-eu-market-over-regulatory-concerns",
        "content": "",
        "num_comments": 1554,
        "comments": [
            "tl;dr: \n\n1. Apple Intelligence \n2. iPhone mirroring \n3. SharePlay screen sharing \n\nArchive link: [https://archive.is/UFDra](https://archive.is/UFDra)\n\n>\\[…\\]   \n>  \n>\\[Apple\\] announced Friday it would block the release of Apple Intelligence, iPhone Mirroring and SharePlay Screen Sharing from users in the EU this year, because the Digital Markets Act allegedly forces it to downgrade the security of its products and services.  \n>  \n>“We are concerned that the interoperability requirements of the DMA could force us to compromise the integrity of our products in ways that risk user privacy and data security,” Apple said in a statement.  \n>  \n>\\[…\\]",
            "Wow, that's pretty huge news.  Feels kind of unprecedented that a core OS feature isn't going to release in certain markets.",
            "Some of these comments seem to come from people who don't realize Apple isn't making these decisions as an emotional response.  The *billions* of dollars involved takes care of any hurt feelings.  Apple is doing this because the potential fines, litigation, requirements and confusion in terms of potentially having to withdraw features makes it worth not taking the risk despite knowing that it will result in less direct income.",
            "That's so interesting because I'm like 99% sure the iphone 16s whole marketing gimmick will also be ai, I didn't expect this at all and I wonder if this is going to cause a dip in their market share over there as samsung and soon google seemingly have no problem in the eu.",
            "Hopefully this doesn’t impact UK & Switzerland as they’re not in the EU.",
            "Can someone explain to me why extremely invasive things like Facebook, Instagram and TikTok keep existing in EU, but something like this is suddenly too much?",
            "0% reason to upgrade then for the time being. Didn’t expect this to be available right away due to using non-English language. But for sure ain’t paying full price for something that maybe will never come.\n\nWill make the balance up on what to do when I really need a new phone, if a lot of key features are region locked there’s no point in staying with Apple and paying the premium price.",
            "Well I just saved 1000€",
            "Well, guess I’m not upgrading from my 14 pro max this year.",
            "This hurts bad, I was really happy about my iPhone 15 Pro sudden new relevance."
        ]
    },
    "PSA: Siri Can Turn on Night Shift on Apple Watch": {
        "title": "PSA: Siri Can Turn on Night Shift on Apple Watch",
        "score": 455,
        "url": "https://www.macrumors.com/2024/06/21/siri-night-shift-apple-watch/",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Just tried on my Apple Watch Ultra 2 and it works… I think I preferred that screen this way so will leave it on",
            "I remember when low power mode wasn’t available on iPad (I think during a iPadOS 14 beta) but asking Siri to turn it on worked. It was removed in a later beta, then actually added in a later update (I think iPadOS 15)",
            "Had a feeling that thread was gonna turn into an article",
            "Only on S6 and newer, apparently.",
            "https://www.reddit.com/r/AppleWatch/s/76WjIE17ZR",
            "At least they gave credit",
            "Should be noted that it doesn’t turn on every night.  Just the one time you ask Siri to.  Nothing in settings to schedule it. ",
            "Doesn’t work on the Series 6 with WatchOS 10.5",
            "[deleted]",
            "Just make a shortcut, it's not that hard"
        ]
    },
    "The first iPhone game streaming service brings hundreds (over 1300) of licensed retro games": {
        "title": "The first iPhone game streaming service brings hundreds (over 1300) of licensed retro games",
        "score": 419,
        "url": "https://www.theverge.com/2024/6/21/24183027/antstream-emulator-apple-iphone-retro-games-ipad-streaming",
        "content": "",
        "num_comments": 117,
        "comments": [
            "So, the difference is, is that all of these games are officially licensed to Antstream. So, it’s actually legal to play these games there. \n\nThat’s all the market there is for the service. It’s fine, I guess? It’s not a bad idea.",
            "$40 a year might be a hard sale when you can download delta and the games and play for free without needing internet.",
            "It's pretty great to see native Cloud Gaming apps. \n\nWe arguably needed them more in 2020 when they were blocked on the App Store, but it's nice to see them now.\n\nTo be fair, the very first native Cloud Gaming app for iOS was from HoYoverse.\n\nSource: https://apps.apple.com/app/id6446889955",
            "I have antstream life time license so this is great news.",
            "I love how many people whine about cost on Apple when they are dropping big bucks for phones and iPads.  This is why we can’t have anything good anymore and just micro transactions BS as everybody is worried that an app costs $2 bucks to unlock.",
            "Streaming 10 mins of gameplay is probably more bandwidth than downloading their entire library. Streaming games can make sense but not for these games honestly",
            "i’m more surprised nintendo is allowing antstream to stream their games.",
            "Bravo EU. See Apple defenders, it’s not all bad as you claim",
            "lol it probably takes more data to stream these retro games for half a second than actually downloading the rom.",
            "$3.33 a month is a better deal than Apple Arcade"
        ]
    }
}