{
    "You can now feel his heart.": {
        "title": "You can now feel his heart.",
        "score": 186,
        "url": "https://i.redd.it/cqarkmo8hz8d1.jpeg",
        "content": "",
        "num_comments": 34,
        "comments": [
            "Oli literally cries while performing this at every show now. He’s definitely gotten more in touch with his emotional side lately, but the new record is actually pretty groovy and unique so I guess I’m still here for it.",
            "I heard it doesn’t feel that satisfying.",
            "*cries in iphone SE 2*",
            "Is this an ios exclusive feature?",
            "What is music haptics 😭",
            "Why does ios get all this cool shi add this to android i BEGG",
            "I used a shortcut to turn it on (I’m using a iPhone XS Max) but I have no idea how to disable it. I tried deleting the shortcut & turning off haptics but it’s still on. any fix?",
            "I think if this used the lows of a song to feel the beat of it would be a little more satisfying. Think of putting on earplugs and the. Placing your hand on top of a speaker. The lows are more prominent and the highs not as much.",
            "honestly the new album is probably his best yet",
            "It does on some songs. I made a playlist for the best obese that I found because some absolutely suck. Just trial and error"
        ]
    },
    "The story in 2 emails": {
        "title": "The story in 2 emails",
        "score": 693,
        "url": "https://i.redd.it/u9cm6ki4bc9d1.jpeg",
        "content": "Made the switch after I just opened the app and saw the ugly ass font that they are dangling over everyone’s heads like it’s some major update or Godsend. It is ugly af. Spotify progressively year after year has gotten worse as Apple Music year after has progressively gotten better. Spotify has, No lossless or Dolby atmos, no airplay 2 support, no HomePod support, Apple TV app is shit…. The list goes on.. \n\nTL,DR: FUCK SPOTIFY, HELLO APPLE MUSIC. ",
        "num_comments": 88,
        "comments": [
            "I don’t know if anyone else is in the same boat, but it just feels better to use Apple Music since it’s fully integrated with the IOS. \n\nApple product calls for Apple software if you get what I mean",
            "Spotify’s app on everything is pretty awful. I actually thought my PS5 was bugging out when I first used the Spotify app on it. Nope, it really just looks that bad. It’s crazy how long they’ve let their UI just sit as a nearly unusable mess",
            "Have had Apple Music since 2016 never looked back 🫱🏽‍🫲🏻",
            "Ads from Spotify before podcasts on a premium account? Audio books from Spotify on a premium account except there is a quota? Premium Spotify is not premium.",
            "I switched last year, went back to Spotify and now I'm back for good. Spotify's UI looks like the junk drawer of an ADHD person (I count myself among those). The Apple Music UI is so much more organized and I like how it reminds me of iTunes. Love the radio stations as well.",
            "Spotify feels like a Gen Z on molly designed it. The app is fast and I honestly can’t knock that but everything else is trash. It keeps you in the loop of brand new songs picked in playlists constantly with loud mid range sound which makes people perceive better quality (thank you MTV for making people feel loud == better quality). This then makes people feel that unless they’re genre hopping within a playlist like a coked up rat in a maze, their app isn’t up to their “diverse taste”.\n\nApple Music is dog shit slow and don’t even get me started on the Mac app. But, it honestly is more mature and once you see through the facade, you start appreciating how seriously Apple takes music. And some of its constraints are well thought out and not exactly a limitation.",
            "Hopefully you have a better experience with AM!",
            "Holy shit this ugly ass new font will be my last straw. I use both Spotify and Apple Music but I’m going to cancel Spotify after this month",
            "Needed to see this new Spotify font, while I get the change most of the time (it’s pretty much they don’t want to pay licensing anymore, has pros and cons in terms of branding/money). Whatever they changed it to reminds me of a mix of YouTube Sans and Deezer’s new font. They’re okay as display fonts, and for the most part, a little bit more readable, but something about them just isn’t right.\n\nRegardless, hope you enjoy Apple Music and if you’re coming from Spotify, you can transfer everything from there using Playlisty.",
            "just switched to Apple Music as well"
        ]
    },
    "I'm new from Spotify; I don't think i'm going back.": {
        "title": "I'm new from Spotify; I don't think i'm going back.",
        "score": 114,
        "url": "https://www.reddit.com/r/AppleMusic/comments/1dr0awq/im_new_from_spotify_i_dont_think_im_going_back/",
        "content": "The fidelity of each track is so crisp, I wish I would've switched sooner. It's like I'm hearing my tracks for the first time again😭",
        "num_comments": 36,
        "comments": [
            "I prefer Apple Music’s codec. It sounds great.",
            "Even just on Apple Music high quality mode it’s much better than Spotify",
            "I switched earlier this week from Spotify, and I can share your experience as well.",
            "That’s exactly what happened to me after switching from Spotify, it’s like a fresh experience with the songs I love",
            "Listen using quality wired IEMs for true lossless streaming.",
            "Welcome to the new life",
            "If you listen to wired equipment, if you listen critically you can hear a difference between aac and lossless.",
            "I've been going back and forth between Spotify and Apple Music but am going to stick with Apple Music. Atmos, easy app, good catalog, and the playlists/recommendations are now on par with Spotify IMO.",
            "I don’t mean sound disrespect or anything, but I genuinely feel Spotify is for kids/people who don’t take their music too seriously.",
            "Yeah idk I think Spotify is interesting in how they handle things but not a good interesting like why do singular songs have entire stations and you don’t clarify which is which in bold enough letters? Like idk if this is just the free version but it’s genuinely annoying lmao."
        ]
    },
    "How those are still not clickable after almost 10 years of Apple Music baffles me, very bad user experience": {
        "title": "How those are still not clickable after almost 10 years of Apple Music baffles me, very bad user experience",
        "score": 10,
        "url": "https://i.redd.it/oojrx5f7hi9d1.png",
        "content": "",
        "num_comments": 4,
        "comments": [
            "It’s such a terrible design choice, even on IOS the option to go to playlist/album/artist comes up",
            "use itunes",
            "iTunes is not available on Mac anymore , and Apple Music is built on top of iTunes so I think iTunes will have the same problems, and even if if it doesn't ,  I shouldn't have to use old unsupported software to fix a simple problem.",
            "**Need help using Apple Music? [Check out our new FAQ](https://www.reddit.com/r/applemusic/w/index/faq)!**\n\nAlso, consider joining our [discord server](https://discord.gg/fuwGZaFt46).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AppleMusic) if you have any questions or concerns.*"
        ]
    },
    "One aspect everyone seems to overlook with Apple Music.": {
        "title": "One aspect everyone seems to overlook with Apple Music.",
        "score": 16,
        "url": "https://v.redd.it/cw3pifv1eh9d1",
        "content": "One thing I never see in any of the posts of switching to Apple Music, is about the feature that by using iTunes to sync with Apple Music, you can import ANY MP3 FILE.\n\nSo just out of curiosity how many of you actually use this feature?\n\nBecause I never see anyone post about that feature being the reason they left Spotify, and now with it, I can’t think of a reason as to why I would ever leave AM.\n\nGranted most people probably don’t listen to a lot of vgm, and thus would probably have there favorite songs already on the service, but I can’t imagine you’ve ever not found at least one song unavailable on AM that you could import.",
        "num_comments": 14,
        "comments": [
            "this is THE killer feature for me, more than audio quality or anything else. i have so many live bootlegs and soundtracks uploaded",
            "It's the main reason I became an Apple Music user. If they ever lose the feature, I'd switch to YouTube Music in a heartbeat (the only other service that has it I believe). And I hate YouTube Musics library organization",
            "This is my use case as well. Lot of videogame ost too, and somente jpop/kpop artists that never got on streaming. I actually had deleted my uploaded Namie Amuro songs after they were releasead on streaming, only to upload them again a few years later when they were taken down\n\nNowadays I split my listening between Apple Music because there's my uploaded songs, and YouTube Music, which has better mixes and discoverability but has a shitty upload system (it also helps that I get it with YouTube Premium)",
            "i use it as well, i have some songs from Arctic Monkeys which aren't on Apple Music (Beneath the Boardwalk) but i downloaded them on  my macbook and when i played them it automatically added them to my list so now i can play them on my phone, sick feature!",
            "I have a lot of CDs ripped to MP3 that are regular releases from record stores that are still not available on Apple Music. Hal Willner’s tributes to Disney music and Thelonious Monk come to mind immediately.",
            "Demos, indies, home recordings, or just plain out-of-print recordings that I like. I never considered Spotify because I was already all-in on iTunes before Apple Music was a thing. Bonus: All that historical play data makes my recommendations absolutely spot on.",
            "This was literally why iTunes was created.",
            "VGM fan also, the cloud library is great but I would like to just upload my own music without the matching process. And a better search, if you try to find VGM, in the best case is just buried in the results.",
            "This is really the killer feature that everyone takes for granted. I have imported hundreds of J-pop songs that are not available on the US store.",
            "This IS why I stay with Apple Music I mean before Apple Music even existed, I had an iTunes library. I’ll never give that up plus the way it integrates with the system is pretty seamless for the most part"
        ]
    }
}