{
    "New week, new shows. r/Appletv what are ya watchin? June 28, 2024? edition": {
        "title": "New week, new shows. r/Appletv what are ya watchin? June 28, 2024? edition",
        "score": 1,
        "url": "https://www.reddit.com/r/appletv/comments/1dq78i5/new_week_new_shows_rappletv_what_are_ya_watchin/",
        "content": "I could hand this over to automod but I need recommendations too lol",
        "num_comments": 7,
        "comments": [
            "I'm going to say Trying - it's a really heartwarming British dramedy and just coming to the end of Season 4.",
            "Presumed Innocent (Im hooked!) and Dark Matter (solid finale). Planning to watch Fancy Dance over the weekend and maybe check out Land of Women.",
            "Dark Matter. What an awesome show. Really hope they do another season.",
            "Black bird- banger\n\nSilo- banger\n\nSeverance- top tier banger\n\nDark matter- banger\n\nDefending Jacob- banger \n\nThe big door prize- slightly above mids\n\nThe Shrinking- high level mids",
            "I admit that I am behind on a lot of things, but i am current on Acapulco and i love that show.\n\nWatched Silo, and loved it. Watched Monarch: Legacy of Monsters and loved it. (which Godzilla movies should I watch now?)\n\nPresumed Innocent looks awesome. Gonna get started on For All Mankind soon too.",
            "Presumed Innocent",
            "Just waiting for Murderbot."
        ]
    },
    "Do you think Apple will allow Xcloud on ATV given console games don't sell on iPhone?": {
        "title": "Do you think Apple will allow Xcloud on ATV given console games don't sell on iPhone?",
        "score": 7,
        "url": "https://www.reddit.com/r/appletv/comments/1drahze/do_you_think_apple_will_allow_xcloud_on_atv_given/",
        "content": "Hello everyone,\n\n  \ndo you think Apple will allow Microsoft to bring Xcloud to Apple TV  It will be coming to Amazon Fire TV Sticks in July. \n\n  \nPeople have been saying that Apple does not want a competitor to Apple Arcade on Apple TV, but on the other hand Netflix and Amazon Prime Video are competitors to ATV+ and they are available.\n\n  \nAnd given ports of console games (Resident evil 4 Remake for example) do not seem to sell well for iphone / iPad, Apple might finally give in and allow Xcloud on Apple TV. Besides, Microsoft might be bringing all Xbox games to the cloud this year so Apple TV would be even more useful. \n\n  \n",
        "num_comments": 4,
        "comments": [
            "Xcloud is already allowed, they changed app store rules some months ago for this.",
            "It's up to Microsoft at this point as u/AndreaCicca said it's already allowed.  Microsoft want's a full store in the app but does not want to pay a commission on the sales to Apple.",
            "Microsoft said there is no profit in bringing xcloud to Apple ecosystem. They are choosing not to do it now",
            "If Apple continues with their catalogue, AA anyways doesnt have any competition/s."
        ]
    },
    "Question about Dolby Atmos": {
        "title": "Question about Dolby Atmos",
        "score": 5,
        "url": "https://www.reddit.com/r/appletv/comments/1dr85zj/question_about_dolby_atmos/",
        "content": "Hi all bit of a weird scenario. \nI’m looking to upgrade my bedroom setup, main looking to access Dolby atmos content, through Apple Music and streaming services like Netflix and Disney +. I bought a Sonos beam gen 2 however returned it after numerous issues. I was looking around for other soundbars when it hit me, if I get an Apple TV 4K plus air pod max would I be able to use them together and access Dolby atmos? \n\nI’m aware this is more expensive solution to a dedicated soundbar however I live in a flat with kids above and below me and can’t blast loud content at night. \n\nSo in theory my setup would be\nPro max -> Apple TV -> TV over eARC \nA PS5 would be connected to the tv aswell for 4k blu rays \n\n\nHow are the pro max for film Dolby atmos content? I currently have air pods pro 2 and always impressed with how they sound on my iPhone through Apple Music \n\n\nEdit: my two main options are the setup above \nOr alternatively Harmon/kardon",
        "num_comments": 4,
        "comments": [
            "I use my AirPods Max in the evenings sometimes and they sound awesome with the AppleTV. Both for music and videos. The surround sound effect is very convincing. They will provide a more convincing surround effect than a sound bar. But not as much as a properly set up and calibrated atmos speaker system with ceiling speakers etc. \n\nThe downside is needing to charge them and wear them. Whereas a sound bar or speaker system is justalways there.",
            "AirPods Max headphones (they are called AirPods Max not pro max) sound incredible while watching movies and television with AppleTV. You will not be disappointed. \n\nIf you go cheap and want to buy a $300 used pair, dont do it. There are a lot of fakes out there at places like EBay and Facebook Marketplace. Buy them new directly from Apple, Amazon, CostoCo, Target or Best Buy.",
            "Or two of the big HomePods.",
            "Thank you for the insight. \nI do plan on investing in a proper atmos system in a few years when I have a larger space just for now I just want to enjoy atmos content at night without disturbing the neighbours. I think Ive convinced my self with this and go through with the pro max and Apple TV combo. \n\nI am torn between this and grabbing a Harmon/kardon MultiBeam 1100 for 290 pounds but it would barely fit with my setup"
        ]
    },
    "Coming from Tizen on my Samsung OLED and LCD tvs. Why do all of the apps run so effortlessly on the ATV?": {
        "title": "Coming from Tizen on my Samsung OLED and LCD tvs. Why do all of the apps run so effortlessly on the ATV?",
        "score": 31,
        "url": "https://www.reddit.com/r/appletv/comments/1dquv7q/coming_from_tizen_on_my_samsung_oled_and_lcd_tvs/",
        "content": "I’ve been using the Apple TV for the past 3 days. the animations and the overall look are extremely consistent. Lots of apps have this navigation bar on the top which I really like. The animations are the same from app to app, which isn’t the case for Tizen. On tizen some apps have good animations (Netflix, Youtube) and some have bad animations (Max, Amazon). The only app with bad animations on my apple TV was Plex. The slight glow and tilt when you select something and slightly rub your finger on the touch surface is a nice too. The remote is extremely uncomfortable and weirdly laid out tho.  I swear, the edges can cut vegetables. I’m thinking about getting a case for this thing. I wish the buttons were smaller.",
        "num_comments": 29,
        "comments": [
            "Smart TVs are notoriously underpowered. AppleTV is a premium stand-alone device with dedicated internal memory.",
            "Part of the reason is because the AppleTV has a seriously fast processor in it. Made possible because of Apples decades-long investment in their own chip fabrication and supply chain. They basically put last years iPhone processors in the AppleTV for a low cost. \n\nBut its also because Apple actually care about user experience. They figured out in the 1980s that years user experience is a competitive advantage.",
            "Im not sure exactly what type of processor the TV has, but I imagine it is nowhere near the power of an Apple TV. That is the primary reason for everything running smoother.\n\nAlso, as others said, the apps being optimized for the Apple TV go a long way.",
            "Forgive for the retelling of history but Apples emphasis on consistency dates back to the original Macintosh. Apple provided a toolbox of interface routines in ROM. It was much easier for a developer to use the toolbox to implement, say, a scroll bar in the way Apple recommended than to code their own. Add to that the fact that reviewers of Mac software brutally criticized apps that deviated from the Apple Interface Guidelines.  Windows followed suit attempting to be more consistent but to this day have not achieved the consistency found in Apple products. Thats not to say there are no inconsistencies in Apple products, there are too many.",
            "Remember your aunts old Hewlet Packard? They took it out the dump and put the cpu in your tv.",
            "Apple TVs have iPhone level chips inside them.",
            "You should never be using the built in software on a tv.",
            "Love the Apple TV 4K. Also a big advocate for getting a silicone cover for the remote. I just got a cheap one from Amazon and it makes it friendlier to hold.",
            "Apple has style guides that 3rd party apps should adhere to. 3rd party developers know how important that is to Apple customers. Android/Tizen customers tend to not care so the developers don't care either.",
            "A weight silicone slip cover does wonders on the Apple remotes.  Yeah Ive been using Apple TVs for years and hate having to use anything else. My theater needed a shield pro which is supposed to be the closest but it was trashed compared.   Love being in closed controlled eco systems on my pointless tech devices.   Let them function how they are supposed to."
        ]
    },
    "Scrolling to the bottom of a playlist": {
        "title": "Scrolling to the bottom of a playlist",
        "score": 1,
        "url": "https://www.reddit.com/r/appletv/comments/1drde0x/scrolling_to_the_bottom_of_a_playlist/",
        "content": "I‘m really struggling to figure out if I‘m an idiot or if Apple really just doesn‘t use their products.\n\nI have a playlist in AM and I want to scroll to the bottom with the remote. I do reach the bottom quickly because of fast scroll but it goes too far down below the songs to where the artists are listed. Of course I can just swipe and there it is, the bottom of my playlist. NO! UP TO THE TOP OF THE LIST I GO!! I tried multiple times. Even if I stop at the correct point at the very last song, go down to to the artists and then back up it just jumps back up to the start of the list.\n\nPlease tell me I‘m an idiot and don‘t know how to handle my ATV because I can‘t handle the idea that the UX is really that awful.",
        "num_comments": 0,
        "comments": []
    }
}