{
    "New week, new shows. r/Appletv what are ya watchin? June 28, 2024? edition": {
        "title": "New week, new shows. r/Appletv what are ya watchin? June 28, 2024? edition",
        "score": 1,
        "url": "https://www.reddit.com/r/appletv/comments/1dq78i5/new_week_new_shows_rappletv_what_are_ya_watchin/",
        "content": "I could hand this over to automod but I need recommendations too lol",
        "num_comments": 7,
        "comments": [
            "I'm going to say Trying - it's a really heartwarming British dramedy and just coming to the end of Season 4.",
            "Black bird- banger\n\nSilo- banger\n\nSeverance- top tier banger\n\nDark matter- banger\n\nDefending Jacob- banger \n\nThe big door prize- slightly above mids\n\nThe Shrinking- high level mids",
            "Presumed Innocent (I’m hooked!) and Dark Matter (solid finale). Planning to watch Fancy Dance over the weekend and maybe check out Land of Women.",
            "Dark Matter. What an awesome show. Really hope they do another season.",
            "Presumed Innocent",
            "Just waiting for Murderbot.",
            "I admit that I am behind on a lot of things, but i am current on Acapulco and i love that show.\n\nWatched Silo, and loved it. Watched Monarch: Legacy of Monsters and loved it. (which Godzilla movies should I watch now?)\n\nPresumed Innocent looks awesome. Gonna get started on For All Mankind soon too."
        ]
    },
    "Coming from Tizen on my Samsung OLED and LCD tvs. Why do all of the apps run so effortlessly on the ATV?": {
        "title": "Coming from Tizen on my Samsung OLED and LCD tvs. Why do all of the apps run so effortlessly on the ATV?",
        "score": 21,
        "url": "https://www.reddit.com/r/appletv/comments/1dquv7q/coming_from_tizen_on_my_samsung_oled_and_lcd_tvs/",
        "content": "I’ve been using the Apple TV for the past 3 days. the animations and the overall look are extremely consistent. Lots of apps have this navigation bar on the top which I really like. The animations are the same from app to app, which isn’t the case for Tizen. On tizen some apps have good animations (Netflix, Youtube) and some have bad animations (Max, Amazon). The only app with bad animations on my apple TV was Plex. The slight glow and tilt when you select something and slightly rub your finger on the touch surface is a nice too. The remote is extremely uncomfortable and weirdly laid out tho.  I swear, the edges can cut vegetables. I’m thinking about getting a case for this thing. I wish the buttons were smaller.",
        "num_comments": 21,
        "comments": [
            "Smart TVs are notoriously underpowered. AppleTV is a premium stand-alone device with dedicated internal memory.",
            "Apple’s magic I guess.",
            "I’m not sure exactly what type of processor the TV has, but I imagine it is nowhere near the power of an Apple TV. That is the primary reason for everything running smoother.\n\nAlso, as others said, the apps being optimized for the Apple TV go a long way.",
            "Part of the reason is because the AppleTV has a seriously fast processor in it. Made possible because of Apple’s decades-long investment in their own chip fabrication and supply chain. They basically put last year’s iPhone processors in the AppleTV for a low cost. \n\nBut it’s also because Apple actually care about user experience. They figured out in the 1980s that years user experience is a competitive advantage.",
            "Forgive for the retelling of history but Apple’s emphasis on consistency dates back to the original Macintosh. Apple provided a “toolbox” of interface routines in ROM. It was much easier for a developer to use the toolbox to implement, say, a scroll bar in the way Apple recommended than to code their own. Add to that the fact that reviewers of Mac software brutally criticized apps that deviated from the Apple Interface Guidelines.  Windows followed suit attempting to be more consistent but to this day have not achieved the consistency found in Apple products. That’s not to say there are no inconsistencies in Apple products, there are too many.",
            "Remember your aunts old Hewlet Packard? They took it out the dump and put the cpu in your tv.",
            "Apple has style guides that 3rd party apps should adhere to. 3rd party developers know how important that is to Apple customers. Android/Tizen customers tend to not care so the developers don't care either.",
            "A weight silicone slip cover does wonders on the Apple remotes.  Yeah I’ve been using Apple TVs for years and hate having to use anything else. My theater needed a shield pro which is supposed to be the closest but it was trashed compared.   Love being in closed controlled eco systems on my pointless tech devices.   Let them function how they are supposed to.",
            "My Bravia's Plex app does an infinitely better job processing mkv files than my Apple TV. It can handle 50GB files that choke the ATV. Same with my new TCL. And the apps on my Comcast box are more than adequate. I find myself using my ATV less and less.",
            "Assuming OP has Apple TV 4K Gen 3, that little box is crazy overpowered for media playback with A15 chips..even without Apple’s optimization the raw power alone will eat those smart TV chips alive like potato chips lol"
        ]
    },
    "What time do titles leave?": {
        "title": "What time do titles leave?",
        "score": 0,
        "url": "https://www.reddit.com/r/appletv/comments/1dr4by9/what_time_do_titles_leave/",
        "content": "For example all of the catalog movies that leave at the end of the month, what time zone midnight do the leave? I know Netflix and max do pacific, but prime does Eastern",
        "num_comments": 0,
        "comments": []
    },
    "Twister 4K ": {
        "title": "Twister 4K ",
        "score": 0,
        "url": "https://www.reddit.com/r/appletv/comments/1dr3c7d/twister_4k/",
        "content": "Was twister recently upgraded to 4K? my Apple TV menu still says HD, but I’m wondering if it’s been updated to 4K behind the scenes ",
        "num_comments": 4,
        "comments": [
            "Why are you wondering about this particular movie? \n\nWhen you play it on your Apple TV, is it in 4k?",
            "My copy says HD but it now says it has DA now.",
            "It’s due for a 4K upgrade since the UHDBR is due out this summer. Haven’t seen it upgraded as of yet."
        ]
    },
    "Prime video connected app": {
        "title": "Prime video connected app",
        "score": 2,
        "url": "https://www.reddit.com/r/appletv/comments/1dqz3zu/prime_video_connected_app/",
        "content": "It’s so strange that after all these years there still isn’t an option to connect prime video to the Apple TV connected apps in a lot of regions. Anyone know if this is on apples part or on Amazon’s?  It’s just strange cause I know the connection is available in the US and other territories as well. ",
        "num_comments": 5,
        "comments": [
            "It’s Amazon’s will.  This same situation is happening with other streaming services like for example in Italy I don’t have crunchyroll’s integration even if is available in near 40 markets at the moment.",
            "It is strange how that works, Amazon started doing that in 2017 or 2018, IIRC correctly. Seems like it'd be easy to implement everywhere.  \n\n  \nPersonally, I pay for the services that do NOT show up in up next, WAY less than the other services. I haven't had Netflix for 22 months now...",
            "Amazon. They don’t want people to leave their app in certain regions. Ironic isn’t it. \n\nHas nothing to do with Apple.",
            "Yea I deff have chrunchyroll. It’s very strange.  I legit forget what I’m watching on prime cause it’s not on my up next 😂😂",
            "Probably it’s just a rolling out feature that they are slowly implementing in different markets."
        ]
    }
}