{
    "[Auto-Post] Weekly Question Thread! Ask /r/Aquariums anything you want to know about the hobby!": {
        "title": "[Auto-Post] Weekly Question Thread! Ask /r/Aquariums anything you want to know about the hobby!",
        "score": 3,
        "url": "https://www.reddit.com/r/Aquariums/comments/1dn4jwg/autopost_weekly_question_thread_ask_raquariums/",
        "content": "*This is an auto-post for the weekly question thread.*\n\nHere you can ask questions for which you don't want to make a separate thread and it also aggregates the questions, so others can learn.\n\n**Please check/read the** [**wiki**](https://www.reddit.com/r/aquariums/wiki) **before posting.**\n\nIf you want to chat with people to ask questions, there is also the [IRC chat](https://kiwiirc.com/client/irc.freenode.net:+6697/#RedditAquariums) for you to ask questions and get answers in real time! If you need help with it, you can always [check the IRC wiki page.](https://www.reddit.com/r/Aquariums/wiki/irc)\n\nFor past threads, [**Click Here**](https://www.reddit.com/r/Aquariums/search?q=%5BAuto-Post%5D+Weekly+Question+Thread%21&sort=new&restrict_sr=on&t=all)",
        "num_comments": 60,
        "comments": [
            "What are some good YouTube channels for info and design inspiration? I already follow SerpaDesign because I love his narration style and his eye for natural scapes. Are there any others I should check out?",
            "Holiday Care.\n\nI will be travelling and want to ensure I have the best possible solution to protect my fish when I’m away for over a week, almost two. I want to ensure I have a camera to watch and see them. My biggest concern is the feeder getting stuck or malfunctioning. I will test for a week before.\n\nIs there anything else I need, specifically wifi camera ideas to get the best fish coverage? \n\n**Kit List** \n\n1. Fluval Flex Aquarium Kit 57 Litre (coldwater)\n2. 3 Full height plants\n3. Black Sand Substrate\n4. Petbank Automatic Fish Feeder CY-009\n\n**Fish List**\n\n1. 6 Male Guppies\n2. 2 Butterfly plecostomus\n3. 4- 8 Pest Snail \n\n**Food List**\n\n1. Tetra Min Flakes\n2. JBL Pro Novo Guppy\n3. **Prima Mini Granules**",
            "Looking for some help. Doing a fish-in cycle right now as I transferred tanks, and all of the filter media and some of the items in the tank. Wasn't expecting anything too grand of a change but my PH is changing and I'm not sure why.\n\nTanks as seachem black flourite substrate, some sand and then at the base some lava rock. Otherwise it's just driftwood, live plants and Ohko Dragon stone.\n\npH on day one was 6.8, pH on day 5 is 7.4. I am testing for pH, AMmonia, Nitrite, Nitrate, Phosphate, Calcium, GH, KH & copper. The only results that changed substanstially are the ph and GH. But I don't know what in my tank could  be raising the GH. Any thoughts/ideas?\n\nIt shouldn't affecting anything too much, but I was trying to test the water for a week or two and let everything settle so I can determine the bubbles per second I need to introduce CO2",
            "Not very experienced\nI have a 22 gallon tank that had three angelfish and three tetras, about 5 years old, and two of the angelfish passed pretty young not too long ago. There are a couple plants in there and some wood inside they can hide behind. What should i do?",
            "Hey all, I know the discussion around cycling a tank has been covered since the dawn of the internet but I wanted to get some opinions on if my tank is ready for my Oscar and Pleco.\n\n  \nWe recently upgraded from a 75g to a 125g tank to give these two monsters a bit more space. \n\nThe new tank is using a new substrate, so we were unable to bring over the bacteria that resides on the gravel of our last tank. We were able to use alot of filter media from the established tank in the new tank and filled it up with fresh water and used some Fresh Start in it.\n\nEverywhere I read explains that a Tank is cycled once Nitrite and Ammonia reach 0ppm and Nitrate is present in the tank.\n\nI have tested the water twice in the last two days and found Nitrate present both times (around 15 and 20 ppm. However when I tested yesterday my Ammonia was at 1ppm and is now at .5ppm.\n\nI know the cycle goes Ammonia > Nitrite > Nitrate. Seeing as I already have Nitrate present is it better to assume the tank is cycled and just do a water change to target the ammonia spike?\n\nAm I good to move the fish over after a water change?  \nShould I wait until ammonia an Nitrite both reach 0ppm before moving any fish over?\n\nI would appreciate any pointers",
            "Hi! I'm just getting started. I'd like to do a filter-less no-fish tank. I have a small tank right now--rounded maybe around 9x12--and I'd like to fill it with live plants, and maybe some microcritters to help with supporting the plants (tiny snails etc?). I don't want fish right now and I don't know if I ever would. I especially don't want to add fish to such a small tank and I've read that might be cruel to them :(\n\nI've seen a lot of videos on which plants to use for a filter-less tanks but they all involve eventually adding fish to balance out nutrients etc. Do I NEED fish to maintain the plants and maybe other tiny bugs etc or can I do just plants? And if I don't need to add fish, are there resources for making fish-less aquariums? I can't seem to find any that seem trustworthy :/\n\nAny and all advice and opinions welcome. I don't hate fish, I just would prefer to do plants and tiny snails for a long time before I felt comfortable tackling fish, if I ever get there.",
            "[deleted]",
            "Beginner here, I have a bunch of dragon rocks that I wanna stick together to form into a single rock formation. Is regular super glue fine to use?\n\nFrom research it says so, furthermore a YT vid I saw said to use tissue paper in between the rocks with super glue to better hold the porous rocks together.\n\nEdit: update I decided to buy a liquid aquascaping cyano glue bottle. Did bunch more research and apparently people do use tissue or wool with the liquid glue to hold rocks/wood together.",
            "Hi, I have a 15 gallon tank pretty well planted and currently have 6 neon tetra in there. I also have a smaller tank with 5 guppies, I was thinking of moving them into the 15g  one and also adding 2/3 otocinclus. Is this ok doable  or am i close to overstocking here? I work from home and keep up with maintenance pretty religiously so I'm not concerned it means slightly more maintenance, but would appreciate some advice cheers",
            "I just got some of those glass planaria traps. I don't have bloodworms on hand - could I just put regular fish food in there as well?"
        ]
    },
    "Having this behind my desk is a tad distracting": {
        "title": "Having this behind my desk is a tad distracting",
        "score": 748,
        "url": "https://v.redd.it/wm6tm6z6oc9d1",
        "content": "",
        "num_comments": 38,
        "comments": [
            "Shit that's a lot of angels. What are you gonna do with that much?",
            "Were the parents with them the whole time!? if so,how did they not eat them?",
            "Oh my God they're freaking adorable!!",
            "That's so many Doritos",
            "If only they stayed that size forever",
            "Holy Angelfish batman!",
            "Dude, that's so many at first glance I thought they were mollies",
            "What the fuuuuuuuuu",
            "I love this.",
            "They’re so tiny and cute!!!😆💕"
        ]
    },
    "Fish keepers can be cruel": {
        "title": "Fish keepers can be cruel",
        "score": 77,
        "url": "https://www.reddit.com/r/Aquariums/comments/1dr2xpp/fish_keepers_can_be_cruel/",
        "content": "I'm coming from another aquarium subreddit. Ive been here much longer, but I branched out and joined other for more content. I came across a typical post, asking a simple question. Should they still do a water change even if the water level is low? Fair enough question. The answer is yes, you should be doing weekly maintenance. But the comments on this post were ENTIRELY people shitting on the fact that this person had fake plants and rainbow gravel. They were assuming this person does 0 maintenence and was abusing their fish and telling them to return all their fish. This post didn't even have a description, just the question. I don't understand why people are so cruel to new people in this hobby. We all started somewhere. Petstores tend to encourage these types of decor. Im so glad this sub is for the most part a safe space for new fish keepers to learn from their mistakes, instead of being harassed for it with no constructive criticism. We need to do better.",
        "num_comments": 28,
        "comments": [
            "Was this the Betta subreddit by any chance? they are notorious for having a bad reputation. Welcome to the aquarium subreddit everyone here is mostly chill, we do disagree and agree.",
            "To be fair, the water level on that tank was very low. I saw more people criticizing the obvious lack of maintenance than the decor.",
            "It’s really disappointing to see people be jerks like that. I really feel bad for the person on the other side. Reddit seems to have a huge bandwagon effect, for good or bad (and when it’s bad, it’s terrible!) A couple of posters get all huffy, post-some self-righteous or gate-keeping crap and then tons of people join in for whatever reason.  There are lots of good things about Reddit but what you pointed out is one of the awful things. Anyway, thanks for being a nice person and not jumping on the bandwagon!",
            "It's just a thing with pets/animals and the Internet. \n\nDoesn't matter if it's reddit, Twitter, tik Tok etc\n\nSomeone posts something, anything about their pet and 50 ppl come out the woodwork saying whatever they r doing is 100% wrong and they are abusing their pet.",
            "On one hand I can understand the sentiment, usually if you’re keeping things like that in a tank you’re relatively new which means there’s a lot of things you’re not going to know or understand. Lord knows I’ve made my share of mistakes in this hobby, so trying to get people up to speed and avoid those mistakes is understandable. \n\nOn the other hand…yeah a lot of people are dicks, even in this sub. Intentions may be good but I swear too many people just jump at the chance to correct others and make them feel bad for “torturing” fish because of their ignorance. Once one person hops on that it’s a wrap because the herd follows. \n\nI can’t tell you the amount of times I’ve seen people just in this sub cry wolf over a tank that may not be perfectly ideal but is completely stable and reasonable. I can only  imagine how bad other, more niche and specialized subs could be.",
            "I find some redditors here a tad judgemental too but they are in the minority.",
            "I think the main thing are people are fed up with seeing subpar care for live animals when it takes less than 10 minutes to find good information on fish. Plastic decor is terrible for fish and you’ll never convince me otherwise, especially fish with delicate fins such as a betta",
            "ding..ding…ding! I think we found a live one 👇🏼",
            "betta people are dicks for some reason",
            "I was going to ask OP the same question! I have a betta, so I’m in that sub, but so many of the comments on beginner posts are beyond aggressive!"
        ]
    },
    "Not sure who’s more excited, me or the parents but I swear some are free swimming, start feeding?": {
        "title": "Not sure who’s more excited, me or the parents but I swear some are free swimming, start feeding?",
        "score": 359,
        "url": "https://v.redd.it/os03bnktxc9d1",
        "content": "I’m stalking them at this point and saw some swimming around, pipette down some food?",
        "num_comments": 19,
        "comments": [
            "That’s a cool fish. What is it?",
            "It's a bit hard to see them.  Any chance we could see a close up video from the side of the tank?",
            "I would wait till the egg sacs are completely gone. Then feed the Fry some baby misis shrimp",
            "I see one or two who look like they're starting, but en masse they still look like wrigglers to me; still feeding off yolk.   \n\nYou could do a very very light feeding perhaps to \"test the waters\".",
            "My Acaras also had babies, this is their second time, the first time was a complete unexpected shock. They are surprisingly good parents, and once I got a divider in the tank (to protect them from other fish), and eventually kicked out the dad (I think he did start eating babies at some point), I had only one left for a few months, and one day it disappeared 🫤 I'm hoping that this time getting up the divider up right away, and kicking Dad out sooner I might get at least one to adolescence 😅",
            "Hes trying to bring that attitude? Trying to breathe those water ripples at me? Im king of this fish tank! I make it rain fish flakes around here! Put some respect on that hand that feeds you fishy!",
            "Awww this has made my day! I love seeing little ones already darting around!",
            "Congrats! What plant is that? Just what I’m looking for to carpet my sand",
            "That is so cool!",
            "They look like they are wigglers still mostly. You'll see the SWARM when they are free swimming. At that point, they will still have their yolk sack for another day. You can try feeding lightly with BBS and see if the bellies go gold ✨️ 💛 😉"
        ]
    },
    "He's in the corner because he hasn't been fed in 17 minutes": {
        "title": "He's in the corner because he hasn't been fed in 17 minutes",
        "score": 37,
        "url": "https://v.redd.it/10celduj6g9d1",
        "content": "Before you say it, yes, the floaters are out of control! Tomorrow is maintenance day",
        "num_comments": 5,
        "comments": [
            "Can I politely suggest he might be trying to find relief from the water flow!\n? It seems like he's fighting against it pretty hard, however I'm not there to see it in person. \n\nBut that being said, I too get angry if I'm not fed every 15 minutes, so my sympathies for him 😂",
            "What dimension are the tank",
            "Drama Queen, haha. What's the floating plant?",
            "That's a fair observation but I can assure you that the flow is in a very specific downwards direction and he avoids it. The only time he goes in that corner instead of exploring is when he sees me, which is because he's been pavlov'd to find food there.\n\nHe just flutters a lot. In fact he was fluttering in his box at the pet shop and that's why we got him!",
            "45x45x45. 90L"
        ]
    }
}