{
    "Fachkräftemangel?! Ja und?...": {
        "title": "Fachkräftemangel?! Ja und?...",
        "score": 22,
        "url": "https://www.reddit.com/r/arbeitsleben/comments/1drb68n/fachkräftemangel_ja_und/",
        "content": "Erfahrung über den Einsatz bei einer sehr kleinen Firma die anscheinend nichts dazugelernt hat... Zumindest noch nicht.\n\nIch habe vor ca. einem Jahr in einem Unternehmen angefangen. Bei dem Einstellungsgespräch wurde mir zweimal deutlich versprochen dass die Arbeitszeit ab Wohnort gilt. Plötzlich zwei Monate nachdem ich dann schon angefangen hatte, kommt mein Vorgesetzter auf mich zu und behauptet dies wurde niemals so vereinbart. Ich darf mir die Zeit ab Ankunft bei der Firma aufschreiben.\n\n Ich war damals ehrlich gesagt etwas naiv, und habe auf die mündliche Zusage vertraut. Und später im Arbeitsvertrag nicht genauer nachgehakt. Da stand nichts definiert über Beginn der Arbeitszeit, es stand nur:  Arbeitsort ist \"Name der Stadt & Firmengebäude\". Ich muss dazu erwähnen das mein Aufgabengebiet zu 80% im Außendienst habe! Ich habe damals niemals damit gerechnet dass sich dies auf Beginn der Arbeitszeit bezieht. Ja heute bin ich schlauer. \n\nTrotz allem habe ich auf das mündliche versprechen hingewiesen und das mehrmals bei meinen Vorgesetzten, die übrigens innerhalb von 9 Monaten dreimal gewechselt haben, ausdrücklich erwähnt. Alle Versuche endeten ohne Einsicht. \nMan wollte mir dies auf gar keinen Fall erfüllen. Ich habe mehrmals erklärt dass dies für mich damals ausschlaggebend war um bei dieser Stelle anzufangen. \n\nIch habe auch offen kommuniziert das ich mir so langfristig keine weitere Zusammenarbeit vorstellen kann. \nDies hat man selbstverständlich nicht ernst genommen!\nMan hat immer wieder sehr abweisend reagiert und auch behauptet keine andere Firma würde heutzutage noch so eine Bedingung anbieten.... \nHabe mich dann kurze Zeit später bei mehreren Firmen beworben. \nDie meisten dieser Firmen hatten genau diese Bedingung in der Stellenbeschreibung drin: Arbeitszeit beginnt ab Wohnort.\n Interessant ist dabei auch, dass mein direkter Arbeitskollege, der das Gleiche tut wie ich, genau dies doch in seinem Vertrag drin stehen hat. Arbeitszeit ab Wohnort. \n\nJetzt hat es sich ja doch so entwickelt dass ich eine sehr gute Stelle gefunden habe wo mir dies genauso angeboten wird plus 15% mehr Gehalt. \nDie Firma bei der ich momentan noch bin, hat sehr lange nach einer Arbeitskraft wie mir damals gesucht und auch sehr viel Geld und Zeit investiert um mich in diesem Fachgebiet auszubilden.\nDaher ist es mir umso unverständlicher dass man dann mit mir so grob fahrlässig umgeht.\nJetzt haben Sie das Nachsehen, müssen wieder jemand neues suchen, einen Haufen Zeit und Geld in seine Einarbeitung stecken. \n\nUnd das einfach nur weil man eindeutige Versprechen nicht einhalten kann. Dieses Problem ist aber in dieser Fa. nicht neu. \nEs sind schon unzählige gute Mitarbeiter genau wegen solcher Probleme gegangen. \nUnd die Fa. hat einen enormen Mangel an Mitarbeiter und einen großen Bedarf, da es sich um eine spezielle Branche handelt. \n\nIch wollte dies nur mal so erwähnen zu dem angeblichen \"Facharbeitermangel\" der überall herrscht. Manche scheinen dazu noch komplett Begriffsresistent zu sein. Bei Kununu wird demnächst ein schöner Eintrag stehen. Ich wollte dies nur mal so als interessante Erfahrung mitteilen. ",
        "num_comments": 13,
        "comments": [
            "Kenne ich, ging mir mit meiner Firma mal genau so. Ich hab aber bei Kununu und Google keine Rezension hinterlassen, weil mir die Firma einfach die Zeit nicht wert ist, eine aussagekrftige Bewertung zu schreiben, die die Wahrheit mglichst detailgetreu wiedergibt. \n\nUnd nachdem Kununu die Bewertungen eh lscht sobald da auch nur ne Ameise nen Rlpser lsst, ist mir die Zeit einfach zu schade.",
            "Bist du denn eine Fachkraft?",
            "Danke fr deine Ausfhrliche Erklrung  Bei dem neuen Arbeitgeber steht alles sehr klar definiert im AV. Ohne wenn und aber immer vom Wohnort aus. Deine Erklrung hilft mir im Zweifelsfall weiter.",
            "Ich bin gelernte Fachkraft mit einer Berufsausbildung. Nur das die Branche wo ich arbeite sehr Fachspezifische Bedrfnisse hat wo die Mitarbeiter zuerst aus Sicherheitsgrnden eingelernt werden mssen.",
            "Ein nicht unerheblicher Teil der kununu-Bewertungen ist nutzlos. Da fehlt es oft an authentischen Angaben. Mit reierischen Aussagen wie \"Ich arbeite gerne bei euch :D\" locke ich keine potenziellen Arbeitnehmer an. Man kann kununu und Co. allenfalls als Anhaltspunkte nutzen, mehr aber meiner Meinung nach auch nicht.",
            "Was im Vertrag steht gilt, wahrscheinlich enthlt der Vertrag sogar eine Klausel, die mndliche Nebenabsprachen ausschlieen (eigentlich Standard in modernen Arbeitsvertrgen).\n\nEs gibt keinen Grund fr eine negative Kununu Bewertung.",
            "Also gibt es denn den Bedarf tatschlich oder besteht die Mglichkeit, dass dein AG den Teil des Unternehmens peu a peu zurckfhrt, sprich zu Kndigungen ermutigt, nur halbherzig sucht und einstellt, nicht mehr anbietet als unbedingt vertraglich erfllt werden muss um sich perspektivisch aus dem Bereich zurckziehen zu knnen? Manchmal finden Restrukturierungen und Neuausrichtungen nicht so schlagartig statt, sondern eher als organischer Prozess des Schrumpfens.",
            "Ich wei nicht, ob das dann Betrug im strafrechtlichen Sinne ist, aber jedenfalls im allgemeinsprachlichen Sinne wenn das ganze mit Vorsatz war und der Arbeitgeber braucht sich dann ber die Reaktion und Konzequenzen nicht zu wundern.",
            "Nee, aber der Eintrag wird vermutlich sofort gelscht. Der AG beruft sich auf den Arbeitsvertrag und fertig.",
            "Frs nchste Mal: Der Wohnort zhlt nicht zwangsweise als erste Ttigkeitssttte bei Aussendienst, brigens auch dann nicht wenn es im Vertrag steht.\n\nAber: Da du zum Groteil im Aussendienst ttig warst, htte die Firma objektiver an die Sache herangehen mssen. Rcksprache mit einem Anwalt htte hier vielleicht geholfen.\n\nAnyways, das Spiel knnen auch zwei spielen. Sollte dir das noch einmal passieren und der Kunde wohnt nher an deinem Wohnort als von der ersten Ttigkeitssttte, dann fhrst du einfach zuerst in die Firma und dann erst zum Kunden. Bei der Rckfahrt genauso.\nIst zwar schbig, aber fhrt den Entscheidern vor Augen, wie unsinnig eine starre Regelung sein kann.\n\nbrigens: Wenn es vom Wohnort zum Kunden weiter ist, zhlt Arbeitsort <> Kunde."
        ]
    },
    "Job hopping inkl. Gehaltssprünge - wie sieht die Realität wirklich aus?": {
        "title": "Job hopping inkl. Gehaltssprünge - wie sieht die Realität wirklich aus?",
        "score": 8,
        "url": "https://www.reddit.com/r/arbeitsleben/comments/1drbvzc/job_hopping_inkl_gehaltssprünge_wie_sieht_die/",
        "content": "Es wird ja gern hier davon geschwärmt wie toll es ist, oft den Arbeitgeber zu wechseln. Man verdient plötzlich das doppelte und statt Obstkorb gibt es Home Office mit Firmenwagen. Bei jedem der sich über seinen Arbeitsplatz beschwert wir gleich mit Kündigung um sich geworfen als wäre es der heilige Gral. \n\nWie realistisch ist sowas wirklich? Gerade für Leute, die am Land wohnen in Branchen, die nicht wirklich im Home Office funktionieren. Oder für Familien etc.? ",
        "num_comments": 37,
        "comments": [
            "Eine der Grundideen von Jobhopping ist es eigentlich, dass gerade am Anfang des Berufslebens zu machen, wenn man eben noch nicht rtlich gebunden ist.\n\nDas dir Jobhopping nichts bringt wenn es nur zwei Arbeitgeber in deiner Branche gibt die sich absprechen, sollte logisch sein. Das man wenn man am Ende des Tarifes angekommen ist, in eine andere Firma mit demselben Tarif wechselt ohne Fhrungsrolle, auch nicht viel Gehalt dazugewinnt sollte sich auch selbst erklren.",
            "Ich Wechsel jetzt das erste Mal nach ca 12Jahren (teils neben den Studium, seit 7 Jahren Vollzeit, 2x 7 Monate Elternzeit). Die NGO und meine Aufgaben sind in vielerlei Hinsicht Klasse, aber das Gehalt hat sich fast garnicht entwickelt. Ich Wechsel jetzt in den ffentlichen Dienst auf eine E-14 Stelle wo ich fr gute Qualifizierungen mitbringe, es ist trotzdem etwas ein Quereinstieg. Gehalt springt von 43k auf 73k dieses Jahr, 80k ab August kommendes Jahr nach zwo anstehenden Tariferhhungen. Dabei noch so Benefits wie 4 Tage die Woche Homeoffice, 4 Brotage im Monat frei legbar, Jobticket, 30Tage Urlaub, sehr moderne Bros und strikte berstundenregeln usw. Ich bin gerade sehr Happy darber - zudem ist der neue Job richtig spannend und ich habe echt Bock drauf.",
            "Vor allem die Jobwechsel zu Beginn des Berufsleben sind nicht selten mit einem Rollenwechsel verbunden. Fr die +20% gibt es dann auch eine ordentliche Schippe mehr Verantwortung. Muss man fr sich wissen, ob man den Stress haben mchte.\n\nAus persnlicher Erfahrung: Ja, fetter Gehaltssprung - aber meine Work/Life-Balance steht komplett auf dem Kopf. Die neue Arbeit verursacht deutlich mehr Stress und ich kann meine WE nicht mehr wie frher so gut genieen.",
            "In der IT ist es, das entsprechende Skillset vorausgesetzt, so mglich. Hab mein Gehalt in 9 Jahren vervierfacht. Entsprechende Entwicklung und Bereitschaft permanent zu Lernen vorausgesetzt. Wenn du auf dem Land lebst ohne Bereitschaft zum Umzug, brauchst du entsprechendes Wissen, was dir Unternehmen bezahlen wollen und auf Full Remote setzen.",
            "Bin einmal gehoppt von 70 auf 95, war gut. Allerdings hast du Recht, ging nur mit Standortwechsel.",
            "Man kann nicht einfach Job hopping machen und hoffen, dass es mehr Geld gibt. Auch beim Job Hopping sollte man strategisch vorgehen und immer wechseln, wenn man neue Fhigkeiten hat, die auf dem Markt mehr wert sind. Wenn du 2 Jahre Software entwickelt hast, kannst du bspw in der Regel mehr als deine Gehaltssteigerungen in den zwei Jahren. Wechsel lohnt sich. Wenn du 2 Jahre in irgendeiner UI rumgeklickt hast und excel Tabellen ausfllst, sind deine Fhigkeiten womglich nicht mehr wert auf dem Arbeitsmarkt.\n\ntl;dr: nur wechseln bringt nichts, wechseln nach erlernten Skills schon",
            "Ich hab wirklich viel daran gesetzt, direkt einen guten Arbeitgeber zu finden. Mal sehen, ob sich das in 5 Jahren auszahlt..\n\nIch finde das rein finden in ein Gebiet (vorallem in der Softwareentwicklung) wirklich einen teilweise schwierige Zeit. Da ists schon cool, wenn man \" wei was man hat \"",
            "Hab bis jetzt erst einmal gewechselt und es gibt jetzt 35h Woche statt 40 und dafr 20k mehr. Die Arbeitsbedingungen und work Life Balance sind auch besser, das einzige downgrade ist, dass ich jetzt in einer greren Firma ein deutlich kleineres Zahnrad bin, was nicht ganz so erfllend ist.",
            "Ich Wechsel jetzt grad von 58k auf 65k plus bonus von ca 2k pro jahr fr einen vermutlich chilligeren Job. Nach ca 1.5 Jahren Vollzeit und 4 Jahren Werkstudententtigkeit in der Entwicklung. Angeboten wurde mir beim aktuellen Arbeitgeber ca 3% pro Jahr Steigerung.",
            "Ich glaub das kommt immer auf die Branche an. Ich arbeite im Labor, da verndert sich durch wechseln relativ wenig. Von 35.000auf 39.000 mich ist das viel Geld. Hab aber auch Kollegen die woanders frher nur 31.000 hatten. (Natrlich alles brutto) \nIn vielen Berufen gibt es halt auch ein Limit, und irgendwann gehts nicht mehr hoch. Auer natrlich die jhrlichen 2%(?) die man mehr bekommt durch Inflation etc. Aber ich glaub so hohe Sprnge wie zbs in der IT sind halt nicht berall realisistisch :)"
        ]
    },
    "Jobsuche/ Bewerbungsdaten 2024 als BWL Master Absolvent": {
        "title": "Jobsuche/ Bewerbungsdaten 2024 als BWL Master Absolvent",
        "score": 21,
        "url": "https://www.reddit.com/r/arbeitsleben/comments/1dr3aim/jobsuche_bewerbungsdaten_2024_als_bwl_master/",
        "content": "https://preview.redd.it/fv7ocwuduf9d1.png?width=2200&format=png&auto=webp&s=04dc8dc1810c40b21b015e9777aaeb8af9c8166e\n\nHallo, da ich vor einiger Zeit hier ja schon mal bezüglich meiner Jobsuche bisschen was geschrieben hatte bzw. einige Fragen hatte wollte ich euch  einfach mal updaten. Ich habe diese Woche ein finales Interview gehabt, woraufhin ich ein Angebot bekommen habe, welches ich auch schon angenommen habe. \n\nZu meinem Profil kurz aus meinem alten Post: Master BWL Logistik (Schnitt ca 1,35), zwei Auslandssemester in Europa, 6- Monate Praktikum im Logistikmanagement bei einem großen Automobilhersteller, zwei kleinere weniger relevante Werksstudentenstellen.\n\nMeine Bewerbung habe ich zwischen dem 07.05 und dem 26.06 abgeschickt, wobei der Großteil zwischen Ende Mai und Anfang Juni war. Aufgrund der kurzen Zeit zwischen den Bewerbungen und jetzt sind einige noch offen, wobei ich mir auch vorstellen kann, dass gerade die, bei denen noch kein Gespräch stattgefunden hat sich auch nicht mehr positiv melden werden.  Bei allen Stellen bei denen ich nach der Bewerbung im Prozess weitergekommen bin, lag die Antwortdauer zwischen Bewerbung und Rückmeldung übrigens bei ca. 2 Werktagen.\n\nDie Stellen waren eigentlich fast alle Trainee Stellen im Supply Chain Management oder Junior Supply Chain Manager Stellen. Geworden ist es jetzt final ein  SCM Trainee bei einem großen FMCG Konzern. Gehalt sind dabei bei 40 Stunden ca. 62k. Der Bewerbungsprozess war dabei: Bewerbung -> Online AC -> Automatisiertes Online Interview -> Assesment Day (ca. 8 Stunden, Zwei Einzelintervies mit je ca. 75 Minuten, Fragerunde mit Extrainees ca. eine Stunde, Business Game/ Simulation ca. 3 Stunden -> Panel Intwerview mit 3 anderen Bewerbern, 4 Senior Managern + HR ca. zwei Stunden\n\nFalls es zu irgendwas Fragen gibt, immer gerne her damit und vielleicht helfen oder interessieren die Daten ja irgendwem :)",
        "num_comments": 33,
        "comments": [
            "Wenn ich sowas lese frage ich mich manchmal wem im Unternehmen so langweilig war sich solch ein Bewerbungsverfahren zu berlegen und warum sich dann noch genug Verantwortliche finden, die sowas regelmig von Fachabteilungsseite aus betreuen. Hier geht es ja nicht mal um einen entscheidenden Job sondern einen, aus Konzernsicht, eher mittelmig bezahlten Einstiegsjob, wo man whrend der Traineezeit noch mehr als genug ber den Mitarbeiter und sein Potential lernen wrde.",
            "Kannst du den Assessment day ausfhrlich erzhlen? Find das schon Recht interessant was ein groer Aufwand das fr eine Trainee Stelle ist. Aber 62k als Einstieg ist schon sehr stabil",
            "Fr Logistik ein gutes Angebot!",
            "Glckwunsch zum Job vor allem bei dem zeitliche Aufwand, der ist ja nicht gerade ohne  Mein Vorstellungsgesprch hat grade mal 45 Minuten gedauert und das war alles, ist aber auch ffentlicher Dienst da glaube ich sieht man das alles lockerer \n\nBin aber echt berrascht was mache Firmen fr nen Aufwand treiben beim Bewerbungsverfahren, das hat manchmal bisschen den Anschein als msste die HR ihre Daseinsberechtigung verteidigen ",
            "Glckwunsch zu deinem Job! Der Arbeitsmarkt ist extrem schlecht zur Zeit imo. Viele meiner Freunde suchen noch nach Jobs und haben auch studiert. Ich ebenso, aber bin nur als Leiharbeiter in eine Firma gekommen und kann endlich Geld verdienen mit BWL Bachelor wre ich froh berhaupt mal an die 62k zu kommen. \n\nHast auch wirklich was geleistet und das Geld verdient, aber sehe im Bereich BWL nicht wirklich den need fr die einen Master? Fr die Jobs reichen imo die Kenntnisse im Bachelor aus und der Rest wird einem ja im Beruf gezeigt. Liege mit der Ansicht aber auch vielleicht komplett daneben :D",
            "Das ist vllig irre. Hier geht es um 0815 Sachbearbeitung, die echt jeder machen knnte.  Ich hatte als Ingenieur nur 2x30min Gesprch fr eine junior stelle. Diese Prozesse frdern nur Massenbewerbungen, weil man fast nie in 4 runden gut dasteht. Irgendwann klappt es dann. Gleichzeitig drfen die HR Mitarbeiter schlechte Bewerbungen durchlesen und die Fachabteilungen sitzen alle 2 Wochen zu 5. in Meetings. \n\nAuch diese Trainee Anstellungen sind eigentlich eine Beleidigung. Als ob jemand mit 28 und Master / Diplom Abschluss nicht in der Lage wre halbwegs selbststndig zu arbeiten und sich zurechtzufinden. Ob jemand das ist findet man in einem oder zwei Gesprchen doch recht schnell raus.",
            "Traineezeit ist fr ein Unternhhemen eine teure Investition\n\nAlso das Gehalt des Trainees der auf gut Deutsch erst mal nichts bringt plus die Zeit von besser bezahlten, die er in Anspruch nimmt",
            "Das wrde ich so nicht unterschreiben. Habe auch ein Traineeprogramm absolviert und es wurde viel in die persnliche und fachliche Entwicklung der Trainees investiert. (Soft- und Hardskillschulungen), Netzwerkveranstaltungen, min. 9 Monate Hospitationen an allen Standorten der Bank innerhalb des 18 monatigen Programms. \n\nDa jeden Hansel zu nehmen mag funktionieren, gleichzeitig wrde das dem Ansehen des Programms innerhalb des Unternehmens schaden.",
            "Naja fr den Konzern ist es glaube ich tatschlich weniger Arbeit als es Aussieht. CV scannen wird warscheinlich teilautomatisiert gemacht, AC automatisch ausgewertet und das automatische Online Intwerview braucht man auch nur 5 kurze Videos anschauen. \n\nBis zum AC werden dann laut Unternehmensaussage sowieso 95% der Bewerder aussortiert, vor dem letzten Interview ber 99%. Die also wirklich aufwendigen Schritte durchlaufen also nur ein Bruchteil der Bewerber",
            "Ich hatte bei einer normalen Stelle 7 (!!) Bewerbungsschritte und 3 davon waren mit Leute aus dem Management mit nur 2-3 Jahren BE. Total absurd und Zeitverschwendung fr alle."
        ]
    },
    "Karriererückschritt?": {
        "title": "Karriererückschritt?",
        "score": 6,
        "url": "https://www.reddit.com/r/arbeitsleben/comments/1dr736x/karriererückschritt/",
        "content": "Ich bin derzeit in den Vertragsverhandlungen für einen neuen Job. Das Unternehmen ist toll. Die Stadt wäre schon seit längerem mein Wunsch-Standort und selbst beim Gehalt gibt es keine gravierenden Diskrepanzen.\nAllerdings habe ich mich auf eine normale Stelle beworben und habe jetzt mitgeteilt bekommen, dass man mich unbedingt in eine Junior-Stelle stecken möchte/muss.\nIch habe 6 Jahre Berufserfahrung und einer der Hauptgründe für den Wechsel ist, dass ich mich beruflich weiterentwickeln möchte. D.h. mehr (Führungs-) Verantwortung übernehmen, mehr Entscheidungskompetenzen, eigenverantwortliches arbeiten, näher ans Management rücken und nicht erst über 13,5 Hierarchieebenen kommunizieren. \nDas alles scheint mir die Junior-Stelle nicht mehr zu bieten. \nFinde nur ich das respektlos?\nIm Vergleich zu meinen bisherigen Aufgaben und Verantwortungen wäre das definitiv ein Rückschritt. Das würde bestimmt auch zumindest blöd im Lebenslauf aussehen und die eine oder andere Rückfrage generieren, sowie mich in meiner weiteren Karriere zurückwerfen.\n\nWas würdet ihr tun? \nAuf die normale Stelle bestehen und sich im Fall einer Absage freuen, dass man eine Red flag abgewehrt hat?\nDie Junior-Stelle annehmen und auf die mündlich zugesicherten vielfältigen Entwicklungsperspektiven hoffen? Anschließend ggf. die nächsten Jahre trotzdem in der Junior-Stelle verkümmern weil man sich verarschen lassen hat?\nWerde auf jeden Fall noch das Gespräch suchen, aber bin mir noch absolut unschlüssig welche Entscheidung ich daraus ziehen würde.",
        "num_comments": 11,
        "comments": [
            "Ganz grundstzlich gesprochen, da es aus deinem Post nicht hervorgeht: Unternehmen haben unterschiedliche Vorstellungen von Senioritt und die Berufserfahrung ist erstmal nachrangig. Ein Senior in einem groen Tech Unternehmen muss ganz andere Anforderungen erfllen als in der kleinen Frickelbude von neben an.\n\nAbgesehen davon: hast du dich denn auf die gleiche Stelle/Jobfamilie beworben wie bei deinem aktuellen Arbeitgeber? Wenn nein, ist es nochmal eine ganz andere Diskussion, da deine bisherige Erfahrung nur in Teilen fr die neue Stelle passt. :)",
            "Wenn Du Dich auf eine normale Stelle beworben hast und Dir im Gesprch nur eine Junior-Stelle angeboten wurde, konntest Du offenbar nicht wirklich fr die normale Stelle berzeugen. Insofern sind dann auch mndliche Versprechungen noch kritischer als sonst schon zu sehen. Zumindest ein schriftliche Zusage eines entsprechenden Entwicklungsplans wre angemessen. Generell wre fr mich das alles ein klares KO, wenn es mir so wie Dir offenbar um hierarchischen Aufstieg ginge....",
            "Also passt dir nur der Jobtitel nicht?\nWHO Cares\nAlternativ frag wie lange du Junior bist und lass dir dann den neuen Titel mit einem Zwischenzeugnis besttigen.",
            "Mchte man dich nicht als Senior bezahlen, aber von deiner Erfahrung profitieren? Es klingt unfair und entspricht nicht deinen beschriebenen Zielen.",
            "Wenns nicht ein Konzern wie Google oder sowas ist, wo selbst eine niedrigere Stufe bessere Chancen bietet als jetzt, wrde ichs nicht machen",
            "Junior, Senior. Das sind doch brgerliche Kategorien.",
            "So lange das nicht zu einem deutlich prestigetrchtigeren Unternehmen ist, wrde ich das sein lassen.",
            "Wenn die so toll sind, haben sie auch keine Schwierigkeit, das schlssig zu erklren. Und wenn das dann immernoch gut findest, get that job.\nAuerdem: wenn die so toll sind, dann berleg doch nicht schon wie das bei der nchsten Bewerbung aussieht ",
            "Schwierige Situation, keine Frage. Ich wrde abwgen was mir wichtiger wre, der Wunsch-Standort oder der Titel und damit eventuell verbundene Einschrnkungen.\nBei mehr Gehalt und perfektem Standort wre mir die Bezeichnung wohl egal. Aber wenn deine Prioritten auf einer Weiterentwicklung in Richtung Personalverantwortung sind, sieht das halt anders aus.",
            "Sprich doch mit denen darber. Prinzipiell bietet das Unternehmen doch Potenzial, wenn die Junior Stelle sonst die Rahmenbedingungen bietet, die du anderswo fr eine Senior Stelle hast"
        ]
    },
    "Welche Karrieremöglichkeiten habe ich als Projektingenieur (Bauingenieurwesen)? ": {
        "title": "Welche Karrieremöglichkeiten habe ich als Projektingenieur (Bauingenieurwesen)? ",
        "score": 5,
        "url": "https://www.reddit.com/r/arbeitsleben/comments/1dr6yag/welche_karrieremöglichkeiten_habe_ich_als/",
        "content": "Hallo zusammen,\n\nich mache mir in letzter Zeit Gedanken darüber, welche Karrieremöglichkeiten ich habe und es ob sinnvoll wäre, zu wechseln, um eine bessere Work-Life-Balance zu haben bzw. einfach mehr Geld zu verdienen\n\nKurz zu mir: 29. Bauingenieur Bachelor und Master (Vertiefung Verkehr), seither im Ingenieurbüro als Projektingenieur in der Planung. Verdiene derzeit 62.400€ ohne Boni, Raum NRW\n\nAus diversen Vorstellungsgesprächen und etwa Recherche habe ich jedoch das Gefühl, dass ich mich gehaltlich nicht wirklich weiterentwickeln kann (zumindest im Ingenieurbüro als Planer) Daher suche ich gerade nach Möglichkeit, wie ich mich weiterentwickeln kann.\n\nWoran ich bereits gedacht habe\n\n* Wechsel innerhalb der Baubranche in Richtung Bauüberwachung/Bauleitung. Soweit ich weiß, kann man dort besser verdienen, denke jedoch, dass die Work-Life-Balance schlechter ist\n* Wechsel in Richtung Projektmanagement und Consulting\n* Wechsel in Richtung IT, vielleicht etwas mit Software / BIM, spezifisch für die Baubranche? Würde mich eigentlich ziemlich für sowas interessieren, weiß aber nicht, wo ich da einsteigen kann. \n* Wechsel in Ausland (Schweiz, USA?) Muss nicht unbedingt in Deutschland bleiben. Hat hier jemand Erfahrung mit gemacht?\n* Kompletter Branchenwechsel und als \"Quereinsteiger\" wo anders anfangen. Ich denke jedoch nicht, dass sich sowas für mich lohnen würde. Lasse mich da gerne aber eines Besseren belehren\n\nVielleicht hat ja irgendwer von euch eine ähnliche Berufslaufbahn eingeschlagen und kann mir einen Rat geben. Ich bin echt für alles offen. Ich bin derzeit mit meinem Job weder unzufrieden noch richtig zufrieden. Daher suche ich nach Möglichkeiten, mich karrieremäßig weiterzuentwickeln.\n\nIch hoffe auf euere interessanten Beiträge. Danke schonmal\n\n",
        "num_comments": 17,
        "comments": [
            "Ich war damals in der gleichen Situation, wie du heute. Wenn du mehr verdienen mchtest, musst du da hin wo viel Geld verdient wird: Industrie.\n\nSuche mal eher nach Civil Engineering, das msste deine Postion im englischen bedeuten. Gerade Wind und PV mit seinen Fundamenten und Zuwegen sind klassische Felder die immer wieder bentigt werden und es es eben auch regelmig neue Projekte gibt.",
            "Oder gehst in den ffentlichen Bereich, die suchen eigentlich immer Bauingenieur. Das ist vllt interessant wenn es um Familienplanung geht.",
            "Eine weitere Karrieremglichkeit ist auch der Infrastruktur-Einkauf, insbesondere bei ffentlichen Auftraggebern.\nVom Projekteinkufer fr groe Bauprojekte oder strategischer Einkufer fr bautechnische Warengruppen  ist i.d.R. alles mglich. Gehaltspannen liegen etwa zwischen 60k-90k, je nach Erfahrung.\nVorteilhaft ist auch die Mglichkeit von Homeoffice.",
            "Ich kenne mich in dem Berufsfeld nicht aus, daher eine ernst gemeinte Frage: Ich dachte, Ingenieure gehren eher zu den Topverdienern und man hat erstmal ausgesorgt. Ist dem nicht so und warum?",
            "Danke. Energie Wind und PV ist interessant. Das schau ich mir mal an",
            "ffentlicher Bereich also Kommunen usw. bezahlen nochmal schlechter.",
            "Was ist mit meinem Background mglich bei TV-V? Wie funktioniert da die Einordnung in den Tarif?",
            "Danke fr die Antwort. Stimmt daran hatte ich auch bereits gedacht. In was fr ein Konzern hast du denn damals gewechselt? Welche Konzerne zahlen nach IGM oder IGBCE?",
            "Bauingenieure sind die allgemeinen am schlechtesten bezahlten Ings. Liegt am Preisdruck aufm Bau und das der Groteil der z. B. Planungsbros so zwischen 5 und 30 Personen gro sind mit dem Inhaber als Geschftsfhrer ohne Tarifvertrag natrlich. Dazu gibt die Honorarordnung vor wie viel ein Bro fr eine Planung verdient. Daher kann ein Bro auch nicht einfach an der Preisschraube drehen. Das perfide: der grte Auftraggeber (ffentliche Hand) legt ber 5 Ecken auch fest welche Betrge in der Honorarordnung stehen. \nEs gibt auch einen Tarifvertrag fr Planungsbros. Mein alter Chef orientierte sich daran. Mir sind aber auch Kollegen bekannt die wurden mit noch weniger abgespeit. Da bekommst aber Trnen in die Augen.",
            "Vielen Dank fr die Antwort. Das sollte ich mir vlt. mal genauer anschauen."
        ]
    }
}