{
    "SABADO DE PREGUNTAS BOLUDAS": {
        "title": "SABADO DE PREGUNTAS BOLUDAS",
        "score": 3,
        "url": "https://www.reddit.com/r/argentina/comments/1dlrfh7/sabado_de_preguntas_boludas/",
        "content": "Boludo el que boludea\n\nEntra a nuestro [Chat](https://chat.reddit.com/room/!hSSQyOrLT-ahufrqRuBANA%3Areddit.com) y charla con la comunidad!",
        "num_comments": 17,
        "comments": [
            "Qué ideas les harían decir esto?\n\nhttps://preview.redd.it/x39rqls9248d1.jpeg?width=1079&format=pjpg&auto=webp&s=4063418bda8345f4c6754e87f9c933fb131c5238",
            "Pregunta boluda, en el verano me rape y desde marzo creo que me estoy dejando crecer el pelo, puede ser que me este creciendo con menos \"fuerza\" o \"volumen\" de lo normal? o es normal cuando es pelo nuevo. Hace mucho que no tengo el pelo largo y ahora que lo pienso nunca me deje crecer de 0 a largo de una siempre iba como cortando las puntas/flequillo de a poco. Sera por esto que lo veo menos voluminoso?",
            "Ustedes que hacen primero: \n\n1. Desayunan y después se lavan los diente\n\n2. Se lavan los dientes y después desayunan",
            "Vivimos una crisis mundial de soledad?\n\nLos dejo que me contesten mientras me voy a pasear sólo a una playa alejada de todo tipo de humanidad.",
            "\"Queres adoptar otro animal?\"",
            "\"Compralo, está muy barato y capaz después sube\" ",
            "Ni idea, pero te recomiendo que tomes aceite de pescado en cápsulas.\n\nA mi me hace muy bien al pelo, mejor grosor y que se caiga menos de lo habitual (y estoy seguro que hace que me crezca más rápido).",
            "Desayuno, almuerzo, meriendo, ceno y me lavo los dientes",
            "Opción 1. Para que me voy a lavar los dientes si a los 2 minutos se ensucian con el café. Aparte el gusto no es el mismo",
            "La única respuesta correcta es la 1."
        ]
    },
    "Sábado de No Acepto Críticas": {
        "title": "Sábado de No Acepto Críticas",
        "score": 3,
        "url": "https://www.reddit.com/r/argentina/comments/1dlrfz6/sábado_de_no_acepto_críticas/",
        "content": "Tirá tu top 3 de verdades controversiales cortitas y al pie -sin faltar el respeto- que a más de uno le zafaría un tornillo, solo que acá no va a haber lugar a críticas!",
        "num_comments": 4,
        "comments": [
            "1- Reddit se volvió una seudo Taringa y es una mierda porque perdió toda seriedad. Hay puros posts troll o pajeros o para farmear karma, lo detesto.\n\n2- Es una mierda que los subs argentinos se hayan polarizado para un lado u otro, dejando a quienes no somos de ambos extremos como parias y sin lugar para expresarnos.\n\n3- Me hartan los posts con preguntas idiotas o los que se hacen los filósofos modernos.",
            "Cuando alguien te dice una de estás 3 frases, se delata de que hizo algo muy malo y no se quiere hacer cargo.  \n  \n1- Los que me conocen saben como soy.\n\n2- Antes que nada quiero aclarar que siempre fui una persona muy tranquila.\n\n3- Yo me considero una buena persona.\n\n\n\nBonustrack de p2: Me sorprendiste, sos muy maduro/a para tu edad.",
            "Decís no ser de ningún extremo y tus comentarios no dicen lo mismo. Si te jode andate del sub o de reddit.\n\nSaludos de un troll.",
            "En cierta medida, validás lo que dice con tu comentario. Y le faltó el /s"
        ]
    },
    "Buen momento para ver La sociedad de la nieve": {
        "title": "Buen momento para ver La sociedad de la nieve",
        "score": 323,
        "url": "https://v.redd.it/68g7a785s08d1",
        "content": "",
        "num_comments": 101,
        "comments": [
            "El uruguayo que tenés sentado al lado. 👨‍🍳",
            "Me pasó yendo a santa cruz, una mina se puso a gritar como loca \"dios ayúdanos señor, dios todo poderoso\" y en mi cabeza lo único que pensaba era: esto es lo último que voy a escuchar, una vieja pelotuda.",
            "Reza Malena! Reza!!",
            "faltó un payaso en el ala, ayudan a mantener el equilibrio circense...",
            "Aerolíneas Argentinas: esto es culpa de milei",
            "yo llego estar ahi y me infarto jajajaja",
            "No entiendo la gente que grita o se asusta con la turbulencia. No podes hacer nada, está fuera de tu control. Yo me quedo mirando una peli, si el avión se cae por lo menos me mori mirando una buena peli o serie.",
            "No soy de tenerle miedo a volar pero siempre que veo rebotar el ala me da cosa\n\nhttps://preview.redd.it/q0acol7ja18d1.jpeg?width=177&format=pjpg&auto=webp&s=673ddb4cced85c01fd9896b2d63f290148c6af85",
            "WOOP WOOP\n\nSTALL STALL\n\nSTALL STALL\n\nWOOP WOOP\n\nTERRAIN TERRAIN\n\nPULL UP PULL UP",
            "Vi el partido de chile-peru,me dieron ganas de estar ahi"
        ]
    },
    "Malamberos la rompieron en America's Got Talent": {
        "title": "Malamberos la rompieron en America's Got Talent",
        "score": 258,
        "url": "https://v.redd.it/jwhpg44r018d1",
        "content": "",
        "num_comments": 54,
        "comments": [
            "Santiagueño promedio cuando piso los 100 metros de asfalto en plena siesta de enero",
            "danza folklorica Argentina? \"aburrido\", mejor que bailen con las patas prendidas fuego, WOOOOW AHORA SI ES GENIAL!",
            "Todo bien con los malamberos pero el got talent me tiene re podrido boludo. No se como carajo hacen los yankis para bancarse todos los años el mismo programa con los mismos jurados, las mismas reacciones exageradas y las mismas historias emotivas pedorras. Aunque bueno, aca tenemos el bailando todavía, asi que mucho no me puedo burlar de ellos.",
            "https://preview.redd.it/j0zuw8vy318d1.png?width=492&format=png&auto=webp&s=6bf7e56d353aeb30c7a8cdae85752dec3e2f1347",
            "Hay q decirle a Larreta q si hacia esto ganaba las elecciones",
            "Los pibes viajando a USA a competir en televisión \n\nEl redditurro que no mueve las patas ni para buscar laburo: \"hm no sé, bastante mediocre, innecesario el fuego\"",
            "No sé si lloran de emoción o por qué se cagaron quemando?",
            "Jaajaj cuántos resentidos en este thread.  Qué les pasa? Ortivas",
            "![gif](giphy|ouYJHlGXjPbj2)\n\nAlgo así",
            "El capítulo de los Simpsons en el que Ogdenville gana el concurso de bandas porque usaron luces de colores, detalla el comportamiento mersa de los yankis que creen que le suma valor hacer 🌈malambo porteño🌈 con las patas prendidas fuego"
        ]
    },
    "Guerra narco en Mar del Plata": {
        "title": "Guerra narco en Mar del Plata",
        "score": 417,
        "url": "https://v.redd.it/xbom5d3z408d1",
        "content": "",
        "num_comments": 115,
        "comments": [
            "Siempre lo mismo con estos negros maracas, se tiran tiros a 2 cuadras de distancia, disparan mientras corren, etc.. por eso no se muere ninguno, imposible que le peguen a algo, salvo a un inocente.",
            "Siempre me causó mucha gracia la forma que tienen los cacos de correr hacia adelante y disparar sin apuntar. Yo fuí Soldado y estoy seguro que si hacía así con el FAL en alguna instrucción me metían una patada en el culo y 90 días de arresto.",
            "Si campeas desde adentro con sniper investigaran lo suficiente para mandarte al frente?",
            "Por qué el que graba no carroñea la kill? estaban regalados",
            "Nada de celulares ni tablets, solo jóvenes viviendo el momento.",
            "Muchos tiros y pocos fiambres .. típico de estos enfrentamientos de narcos de cabotaje...",
            "Tira cohete tira cohete",
            "Che pero guarda que van a vender armas por ML ahora ehh",
            "Les fallo el aimbot. He visto literalmente un simio con metraca qué dispara mejor.",
            "La puta madre. Se van de Rosario a Mardel? Dejenme en paz la c*ncha de la lora. Vayan a Santiago o por alla. "
        ]
    }
}