{
    "SABADO DE PREGUNTAS BOLUDAS": {
        "title": "SABADO DE PREGUNTAS BOLUDAS",
        "score": 6,
        "url": "https://www.reddit.com/r/argentina/comments/1dr7078/sabado_de_preguntas_boludas/",
        "content": "Boludo el que boludea\n\nEntra a nuestro [Chat](https://chat.reddit.com/room/!hSSQyOrLT-ahufrqRuBANA%3Areddit.com) y charla con la comunidad!",
        "num_comments": 7,
        "comments": [
            "Vi el video de la carneada ayer aqui. Hay alguien que tiene una idea donde se puede hacer vacaciones de ese tipo (no tiene que ser una carneada, puede ser algo como agriturismo) cerca de Cordoba Capital?",
            "pensé que estabas hablando en código del video de los carnavales de Salta, comparsa Amazonas, donde aparece una mina con atuendo inspirado en Sailor Moon.",
            "Buen día alpargatines!!!  \nLluvia de cremonas para todossss!!!\n\nQue tengan un excelente fin de semana!",
            "Los comercios donde compran habitualmente o esporádicamente\n\n1. ¿Tienen la tienda de WhatsApp? \n\n2. ¿Que comercio es?\n\n3. ¿Ustedes la usan, piden por ese medio?",
            "Es deshonesto usar alguna ayuda de memoria para pasar entrevistas de un laburo?\n\nPongo contexto: me mandaron una entrevista para developer donde tenia que responder en inglés varias preguntas típicas de contar los proyectos, problemas, como te definen tus teammates etc, así por hora y media. En la plataforma sólo podía ver las preguntas en ese momento, tenía 15 segundos para prepararme y empezaba la grabación (sin entrevistador).\n\nHice una pre-práctica googleando varias de las preguntas que suelen preguntar en otros lados pero como era mucho para retener me anoté un par de cosas en el notepad y algunos bullet point.\n\nEl tema es que parece que se dieron cuenta que tenía unos bullet points (cabe aclarar que no leía directamente el texto, sino que cada tanto miraba una palabra de mi experiencia pasada por ejemplo) y me rebotaron automáticamente diciendo que no era profesional leer, a lo que les dije que tienen razón pero necesitaba unos bullet points para dar mejores respuestas y no tener que memorizar.\n\nEstuve mal o no? para mí memorizar respuestas o improvisar no tiene sentido siempre, nadie se acuerda que hizo hace 10 años atrás. pero quizás estoy equivocado yo.",
            "Buen día \n\nNo me digas que hacer\n\nIgualmente!"
        ]
    },
    "Sábado de No Acepto Críticas": {
        "title": "Sábado de No Acepto Críticas",
        "score": 7,
        "url": "https://www.reddit.com/r/argentina/comments/1dr70mk/sábado_de_no_acepto_críticas/",
        "content": "Tirá tu top 3 de verdades controversiales cortitas y al pie -sin faltar el respeto- que a más de uno le zafaría un tornillo, solo que acá no va a haber lugar a críticas!",
        "num_comments": 20,
        "comments": [
            "Les aviso a los team invierno que hace un frío de cagarrrrseeee. 3 putos grados!! Y digo “les aviso”.. porque todavía deben estar durmiendo, y después se levantan a la 1 de la tarde para tomar la leche y después se vuelven a taparse con las frazadas.  Sino no se explica cómo les puede gustar este frío",
            "para lo segundo tenes una extensión llamada SponsorBlock que automáticamente te saltea las partes con promociones pagas en los videos, la comunidad es la cual selecciona que parte de los videos son de promoción y con eso la extensión los saltea solo, también tiene un \"punto de interés\" que es una marquita concreta en el video donde esta puntual a lo que el video se refería originalmente.\nbastante recomendable, si estas en android esta el YouTube ReVanced que ya lo tiene integrado, y si estas en iOS.... lo siento",
            "Feliz cumple, concuerdo.\n\nVideoreacciones y eso es para hacer guita y nada más, les chupamos un huevo.",
            "En los 3 estoy de acuerdo. Fallada.",
            "Soy un pastelito horneado de canela",
            "Gracias por recordarlo, como me gusta el frio",
            "Hermosa mañana. Salí al balcón unos minutos a disfrutar los 0.9 de térmica en CABA y me volví adentro con la estufa a tomar un tecito. Y agradecer que no es verano, no hacen 22 grados a la mañana y ya sé que a la tarde va a ser un horno a 40.\n\nLife is good.",
            "Uff gracias por hacerme acordar ❤️",
            "Ahhhhh ya se cual es tu problema",
            "Aguante team invierno carajo. Vayanse a sus piletas y aires acondicionados team verano"
        ]
    },
    "Milei pulverizó la inflación: En Junio rondaría el 3,35%": {
        "title": "Milei pulverizó la inflación: En Junio rondaría el 3,35%",
        "score": 345,
        "url": "https://i.redd.it/y09x3j2vje9d1.jpeg",
        "content": "",
        "num_comments": 259,
        "comments": [
            "Ojala, eso quiere decir que el aumento de empleado de comercio le ganaría una vez mas a la inflación y mi sueldo dejaria de ser tan miseria (?",
            "Anualizado da 48,5% que sigue siendo una locura pero que es una reduccion importante desde donde estabamos no lo niego",
            "Es increíble como los mayoristas claramente aumentaron por las dudas y después siguieron aumentando con la inflación",
            "pregunto honestamente, con este mismo criterio no se podría decir que pulverizó la industria también?",
            "Impresionante la ignorancia en los comentarios. Gente que pregunta \"si la inflacion baja xq suben los precios?\". Todo bien vieja pero lean, usen la cabeza un poco.",
            "Esto que quiere decir para el mercado de pases de boquita?",
            "54 de mayorista, que locura",
            "Me parece apresurado, igual es algo a celebrar, peeeeeeero falta la actualización de tarifas de servicios públicos en su totalidad, sin hablar los combustibles si van a aumentar el impuesto a los mismos, tarifas de transporte público se congelaron en su momento y una vez se libere habria que ver en como afecta, la liberación de topes de beneficio a las empresas de cable y internet tambien que salto pegan y sin hablar de obras sociales y otras personas más, hay todavia precios pisados asique no se sabe si se puede sostener el nivel de inflación a la baja.",
            "En contexto está pulverizando la economía y junto la inflación como efecto secundario.",
            "Mira banco al javo pero hay cosas que tiene que cambiar las tarifas no las puede seguir planchando solo para que el numerito de la inflacion no le suba un mes o dos."
        ]
    },
    "Alumnos de la escuela técnica N° 1 de Lules, provincia de Tucumán, desfilaron como cadetes militares en acto patrio.": {
        "title": "Alumnos de la escuela técnica N° 1 de Lules, provincia de Tucumán, desfilaron como cadetes militares en acto patrio.",
        "score": 671,
        "url": "https://v.redd.it/6ocoew91gd9d1",
        "content": "",
        "num_comments": 179,
        "comments": [
            "Virgin neuquino izando la bandera de los maputruchos vs Chad tucumano de escuela técnica.",
            "Para la próxima vez que algún español use el gentilicio tucumano de manera negativa. Hay que mostrarles este video.",
            "Que no lo vean los extranjeros o nos van a acusar de estar inculcandole a los pibes las ideas del nazismo fascista de extrema derecha otra vez",
            "Sabes que me gusta de esto? Que obvio me lo pueden discutir y decir que es inchequeable, pero apostaría que esto es la idea de un grupo de pibes, y les pareció a todos una idea copada, y se lo permitieron, y del otro lado tenes a dirigentes de escuela haciendo jurar a los pibes a la bandera mapuche sin lugar a una elección propia. Déjenme soñar.",
            "6 meses de milei y los pibes ya desfilan, con cfk estaban ahi tirando pasos turros",
            "ASI SE LLEVA LA BANDERA DE CEREMONIA CARAJO!  \nEn el primario que yo fui (del estado), cuando yo ya egresado y por secundaria creo o algo asi, en el curso de mi hermana, 4to grado o algo asi, a la bandera iban \"por eleccion democratica\" y no por merito academico ... (?",
            "Que asco, ninguna bandera palestina /s",
            "A r/RepublicaArgentina se le va a zafar un tornillo si ve esto....",
            "Ahora que fajen al profesor zurdo de literatura",
            "NOOOO MIREN LO QUE HACE EL GOBIERNO DICTADOR FASCISTA NEOLIBERAL APENAS APRUEBAN LA LEY OMNIBUS\n\n/s"
        ]
    },
    "El INCAA le dio 15 millones de pesos en subsidios a una película que sólo vendió 5 entradas": {
        "title": "El INCAA le dio 15 millones de pesos en subsidios a una película que sólo vendió 5 entradas",
        "score": 224,
        "url": "https://tendrannoticiasmias.substack.com/p/el-incaa-le-dio-15-millones-de-pesos",
        "content": "",
        "num_comments": 114,
        "comments": [
            "lavan guita con tu plata contribuyente",
            "\"No podes medir la importancia de la cultura según cuantas entradas se venden, la cultura no tiene precio\"\n\nAlgún zurdo probablemente.",
            "Ni la vieja le compro una entrada",
            "Yo era uno de esos 5, pensé que a esa hora daban endgame pero me estafaron!!!",
            "¿Esta mal sentir pena? Digo, por la abuela del especimen y su historia.",
            "Ve dio menos entradas que cualquier partido de Vélez...",
            "Mas motivos para cerrar esa mierda.",
            "El director filmo esta pelicula en 2021 y recibio tarasca por opera prima, pero en 2019 estrenó otra pelicula… hmmmmm HMMMMMM",
            "Es que hay que regalar la plata de los contribuyentes a los amigos para que la patria no se venda....bueno usen la imaginación por favor!!!",
            "El tipo hizo una película falopa sobre la historia de su abuela y se hizo 15 millones de pesos. tenes que cerrar el estadio /s"
        ]
    }
}