{
    "WFFA: As a Reminder, AER Tony looks to take of everyone on an Army Post, no matter how big or small.": {
        "title": "WFFA: As a Reminder, AER Tony looks to take of everyone on an Army Post, no matter how big or small.",
        "score": 220,
        "url": "https://i.redd.it/fv0eu8342u7d1.jpeg",
        "content": "",
        "num_comments": 31,
        "comments": [
            "AER had put out a [Reminder](https://x.com/aerhq/status/1795920070754914349) about the tornado at Fort Campbell.  No, not that one, the second one that happened *last month* as well.\n\nJust wanted to take a second and make sure - if you're impacted and still getting shit together, make sure you visit their office, they've given out a lot for those tornados recently.\n\nOtherwise, Rule 1 is in effect; enjoy the weekend!",
            "Oh sure, when SMA (R) Grinston messes with the local wildlife it’s a fun photo op. But when I do it it’s a FG Art-15 for “allegedly” locking 4 raccoons in my commanders office. The one with rabies didn’t even bite him.",
            "CSMs in shambles when SMA disobeys rule number 1 of don’t mess with the wildlife\n\nBut it’s good seeing someone who cares",
            "Hey Tony!\n\nI like the things you do!",
            "I don’t think the title of this post is English?",
            "That squirrel better have given $1",
            "Weekend Brief: don’t play with the wildlife.",
            "How big we talking? Cruz had mention my weight....\n\nEdit: also flair good? Leave is on the 24th.",
            "Why is it the weekend free for all? My office has work tomorrow? \n*starts screaming",
            "That’s MY SMA… HOOAH 😤"
        ]
    },
    "Anyone else who received a challenge coin from the previous SMA, what’s your story?": {
        "title": "Anyone else who received a challenge coin from the previous SMA, what’s your story?",
        "score": 139,
        "url": "https://i.redd.it/la6nh6nlrt7d1.jpeg",
        "content": "I was in 1/3 and took part of the change of responsibility ceremony for SMA Grinston. Those who were there for the change of responsibility received a challenge coin from him.",
        "num_comments": 60,
        "comments": [
            "I was Pentagon tours. I have his, Chief of Staff, Chief of Chaplains, and SEAC’s. Was really cool with General McConville’s office, as well as SEAC while I was there. Life changing job if you can get it.",
            "SMA Preston pulled me off a bulldozer in AIT and had me recite the soldier’s creed. Afterwards he hooked me up with a similar coin. Good memories.",
            "I have the coin from SMA Chandler. He was BRAND NEW to the position and I was a split op private in my senior year of high school. I won some JROTC award thing and went to an AUSA event at my local AFB and was selected as the regional whatever and got to meet him and get his coin. I only remember that he seemed excited that the \"winner\" was already a soldier and he talked to me for about 5 minutes.\n\nHe was so wildly unpopular that anytime I showed that coin it started a bitch fest.",
            "Yooooo I finally have a story for this sub!!\nI was getting ready to leave AD for the guard, I’m short timin. My friend says they’re makin tacos at his place on post at lunch. They didn’t mention the line of shots that came with the tacos. I take like 4-5 shots and eat tacos. I go back to work. It’s Friday and we expect to get off pretty soon. 1sg comes in freaking out in a Philippino accent “clean this PUCKIN company the SMA is visiting.” The god son of SMA Dailey was in my company. So, I guess that influenced his visit. The other team leader in my squad sees me nervously throwing dip bottles away and says “I can smell your lunch my dude you’re sweating it out.” \n\nSMA arrives. Gives a speech about soldiering and blah blah. At the end, he tells every squad leader in the company to pick the standout guy from their squad to be recognized out back. My squad leader screams my name out, and everybody forms up outside. \n\nI’m at parade rest but there is Patron dripping down my forehead. I’m terrified. I’m also the first in the line of dudes. SMA Dailey comes up to me. He’s surprisingly short by the way I had to look down at him and I’m like 5’11”.  He says, “Where ya from son?” And I answer, “Portland, Oregon Sergeant Major.” I can SMELL IT COMING OUT OF MY MOUTH DIRECTLY INTO HIS FACE. He smirks at me and stares for a sec. Then talks about how he loved his visit there and found the eastern part of the state to be a special beauty. Hands me a coin, thanks me for my service and that’s that. I got my SMA coin drunk and with congratulations.",
            "I’ve got SMA Grinstons coin: he asked who had been deployed more than X # of times in a crowd and then coined us haha easiest one I ever got, totally right place, right time. I personally coined SMA Dailey at a ball because I’m a smartass who doesn’t know my place🤷‍♂️ he didn’t return the favor🙇‍♂️",
            "They picked a handful of us at the WTU to tell our stories and he had lunch with us. There was an NCO who had like 90% of his body covered in 3rd degree burns, missing or couldn’t use his hands to eat. \n\nSMA asked why he wasn’t eating(the food did suck) the NCO looks at the SMA’s aide and says “I told that dumb motherfucker my mom was my attendant and still wouldn’t let her in.” \n\nSMA looked like they had the “talk” beforehand and this idiot still fucked it up and he was one inch from dying lol.",
            "E4 attached to BDE S3 shop, huge joint exercise at Hood. SFC fresh from Drill Sgt assignment was riding my ass (I was the only non NCO there) for shit that wasn't my fault. SMA Tilley was driving by and saw us covered in mud trying to put up camo netting over the generator. Driver stopped and Tilley was asking questions. Got coined for hustle, while he asked my NCO leaders why they were all in the shade and not helping. \n\nNot sure if Tilley was a good SMA overall, but that kept me going mentally until I got out of there to a new unit.",
            "All we got was from *him* is a dumpster fire of undisciplined troops asking me to do their COC’s job.",
            "SMA Dailey spoke at the infantry ball at West Point 2014ish. I gave him my platoon coin and he gave me his.",
            "I drove SMA Dailey when he visited Drum a while back. Cool dude"
        ]
    },
    "Throwback to the time someone folded my laundry after taking it out the dryer.": {
        "title": "Throwback to the time someone folded my laundry after taking it out the dryer.",
        "score": 1087,
        "url": "https://i.redd.it/zrwfi18hhz7d1.jpeg",
        "content": "This was over a year ago, and I never figured out who it was, but if you’re reading this, thank you for your service🫡",
        "num_comments": 120,
        "comments": [
            "Nobody fucks with DeJesus.",
            "WWDJD.",
            "He unfucked you real quick. You owe that man a handy.",
            "It was me, I had a crush on you and you never noticed me :(",
            "I did this every time as long as they were warm..The people that would leave their stuff for hours or days was annoying asf",
            "Respect the De Jesus",
            "A full bird ass colonel did this for me once..\n\nI’ve told this story before but, I was a cadet at air assault on Campbell staying in the hotel. The night before the 12 mile I was washing *all* of my clothes pretty late at night when a silver fox looking guy walked in with a 6 pack to do some laundry. \n\nIn the course of conversation he dropped a couple ‘hints’ of his service. Stuff like “it was around 2012 or so when I was the XO of (insert unit here).” \n\nI pulled my clothes out of the wash around midnight and the washer didn’t hit spin so they were sopping wet…and I had to be awake 3 hours later. He looked at me and said ‘don’t worry dude, I’ll throw em in the dryer when they’re done you go ahead and get some sleep before that 12 mile.’ I asked if he was sure and he said of course so I obliged and went upstairs. \n\n3 hours later I come down to an empty laundry room and *all* of my laundry neatly folded just like the picture on top of the laundry. After the 12 mile, I asked around to see if anyone knew who that guy was. One of my friends told me ‘oh yeah! That’s Colonel (insert name), he’s from the 82nd’ \n\nTo this day it is still my gold standard of what servant leadership *actually* means. Good guy.",
            "That’s called “lookin out for the last guy”\n\nPay it forward",
            "sorry my bad\n\n(it wasn't me)",
            "I would find that dude and buy him a 4-loko"
        ]
    },
    "Boarding Flight with Military ": {
        "title": "Boarding Flight with Military ",
        "score": 597,
        "url": "https://www.reddit.com/r/army/comments/1dlcm3v/boarding_flight_with_military/",
        "content": "> boarding flight, they call for active military\n\n> Get in line, boarding airplane\n\n> Hear guy 4 people behind me complain\n\n> \"They called active duty but no one's hair in front me is in regs\"\n\n> I have an ETP but also who gaf, guy must look like GI Joe though?\n\n> Turn around, he's fat as shit and not in a \"I can pick heavy things up\" way, literally a bag of milk\n\n> Overhear him say he's in the air force\n\n\nWhy are people in the military like this\n\n\nAnyways, I'll take just a large fry, no salt",
        "num_comments": 134,
        "comments": [
            "Did you tell him he looked like a bag of laundry with how out of regs he was?",
            "Tell him to shut the fuck up, no one cares about his opinion.",
            "With no real mission no real enemies we eat our own. Lord of the fly style. Just call him piggy and chase him with a spear and cook him.",
            "Usually in my experience it's a \"Group X *and* active duty military\" call, so I never assume anyone jumping on that train is a servicemember unless... Y'know... They've got the high and tight, the MOLLE backpack with their rank, name, unit, and morale patches on it, the Multicam baseball cap, sometimes they're wearing part of a uniform.\n\nAirports are wild, it's my favorite thing to go soldier spotting. \n\nAlso, people take leave. That's a thing.",
            "You should’ve looked him up and down and then just busted out laughing while looking directly at him.",
            "Should have just turned around and said \"hey airman, since you're so by the regs, height and weight right now\" shut his hoe ass up.",
            "Some salty e7 probably. I get it a lot too when flying. That’s why I like driving.",
            "Pro-tip, if they call military before first class, get in line with first class. You still get on the plane early and you look like an absolute boss while being incredibly cheap.",
            ">Overhear him say he's in the air force\n\n>Why are people in the military like this\n\nI'm confused.",
            "Just turn around and say \"Thank you for your service.\""
        ]
    },
    "Just threw my uniforms away. ": {
        "title": "Just threw my uniforms away. ",
        "score": 322,
        "url": "https://www.reddit.com/r/army/comments/1dlg928/just_threw_my_uniforms_away/",
        "content": "I'm moving and to cut down on space, threw all my army stuff away that I didn't want (obviously kept my woobie). I have a year and a half of IRR time still but the odds of me needing my uniform are slim to none. Not worth the extra space to maintain my boots and uniforms. Some of them needed replacing anyways. \n\nIt feels weird. Threw away some items from an ex that were in the back of a spare closet, too. \n\nSomeone needs to hear this' don't obsess about what used to be. Get rid of your junk. Keep momentos, sure, but don't keep clutter simply because you can't let it go. Let it be, and let it go. \n\n\"It's good-bye. But we lean forward to the next crazy venture beneath the skies\" - Jack Kerouac ",
        "num_comments": 94,
        "comments": [
            "For others doing the same...if you're anywhere near a medical training site, check and see if they'll take your old uniforms.  We like dressing our simulation mannequins in actual uniforms, and many training scenarios involve cutting the clothes off.  We run through a lot of uniforms and it gets pricey...",
            "*insert Poland/Korea deployment",
            "I saved mine for if I ever become homeless",
            "*War Were Declared*\n\nWouldn’t that be some shit?",
            "You should've went to your local paintball/airsoft field and made a decent amount of money selling it.",
            "Did you throw your war medals off a bridge?",
            "What’s OP gonna do wen Red Dawn?",
            "I’m gonna find a high speed larper and make some  smackaroos",
            "If you have packs, pouches, or field gear,  consider donating to your local Scout troop. There's always kids that need stuff but can't afford it.",
            "You haven’t seen the news?!"
        ]
    }
}