{
    "Weekly Question Thread (06/24/2024 to 06/30/2024)": {
        "title": "Weekly Question Thread (06/24/2024 to 06/30/2024)",
        "score": 7,
        "url": "https://www.reddit.com/r/army/comments/1dn916o/weekly_question_thread_06242024_to_06302024/",
        "content": "This is a safe place to ask any question related to joining the Army. It is focused on joining, Basic Combat Training (BCT) and Advanced Individual Training (AIT), and follow on schools, such as Airborne, Air Assault, Ranger Assessment and Selection Program (RASP), and any other Additional Skill Identifiers (ASI).\n\nWe ask that you do some research on your own, as joining the Army is a big commitment and shouldn't be taken lightly. Resources such as [GoArmy.com](https://www.goarmy.com/), the [Army Reenlistment site](http://www.armyreenlistment.com/), [Bootcamp4Me](http://bootcamp4me.com/), Google and the Reddit search function are at your disposal. There's also the [/r/army wiki](https://www.reddit.com/r/army/wiki/index). It has a lot of the frequent topics, and it's expanding all the time.\n\n/r/militaryfaq is open to broad joining questions or answers from different branches.\nMake sure you check out the /Army [Duty Station Thread Series](https://www.reddit.com/r/army/comments/8u44b7/duty_station_thread_miscellaneous_general/), and our ongoing [MOS Megathread Series](https://www.reddit.com/r/army/comments/9knq72/mos_megathread_series_cmf_35_military/).  You are also welcome to ask question in the /army [discord](https://discord.gg/tmuQwZNx3C).\n\nIf you want to Google in /r/army for previous threads on your topic, use this format:\n68P AIT site:reddit.com/r/army\n\nI promise you that it works really well.\n\nThis is also where questions about reclassing and other MOS questions go -- the questions that are asked repeatedly which do not need another thread. Don't spam or post garbage in here: that's an order.  **Top-level comments and top-level replies are reserved for serious comments only.**\n\n**Finally**: If you're not 100% sure of what you're talking about, leave it for someone else who is.",
        "num_comments": 138,
        "comments": [
            "I ship to basic this August, swearing in to the Army this morning. I would like a good explanation on what Ft. Sill will be like during that time. I hear it’s gonna be cold, but what love to hear from others",
            "So how does the volunteering for RASP works? Unfortunately, I wasn’t given an OP 40 contract due to my GT score not meeting the minimum. Would that mean the cadres may care about GT scores when volunteering thus turning me away? Thanks guys.",
            "Hello everyone, I'm currently in a weird situation but was hoping someone here would be able to help me out. To put it short, I was (until 3 weeks ago) a recipient of the HPSP until my school dismissed me (due to getting 1 point from passing in a class). Currently I am just existing in a state of limbo because I have been getting absolutely no communication from my civilian contact for these few weeks, but want to go active and don't know who to go to in order to figure out what I could actually go into. Currently a reserve 2LT with a bachelor's and 2 years commissioned, was interested in working with the army ships but found that might not work out. \n\nWouldn't have come to ask here but I've had absolutely no contact from anyone and feel a bit lost, plus asking online has yielded no luck. Thank you ahead of time, anything is appreciated!",
            "I can't do a push up!! I leave for basic August 5th and I still can not do a push up? How did you get there? I try every day and still I'm just not getting it. It's like my arms and chest don't get any stronger. Now I'm going to be the person getting smoked or worse getting other people smoked which sucks!",
            "Hi do u go thru reception for FAT camp ?",
            "Hey guys, i was wondering is it hard to get in the green to gold program and also is it hard to go aviatioj? Any and all advice is much appreciated",
            "Besides what is in the packing list for basic training my recruiter gave me is there anything outside the list anyone recommends I should pack?\n\n Also any recommendations for what should I ask from my family to be on my first care package?",
            "can anyone give me an opinion on how likely there is to be a contract for 68w with option 40 available? recruiters are saying borderline impossible to find but want some second opinions",
            "hello! so i heard if you enlist you are able to get papers for your family back home (im not sure if this is true) im a citizen and im thinking about enlisting. my family is back in Syria and its nearly impossible to get them out. Is it possible to negotiate a deal with a recruiter to get them out or at least just one person? If so im willing to sign the contract on the spot.",
            "Is there any place on Fort Hood/ Cavazos that I can get free financial advice from a professional/non military person. I heard of there being one but not sure where"
        ]
    },
    "It's your Weekend Free For All!": {
        "title": "It's your Weekend Free For All!",
        "score": 17,
        "url": "https://www.reddit.com/r/army/comments/1dqw1fg/its_your_weekend_free_for_all/",
        "content": "Rule 1 in effect.  Enjoy the weekend!\n\nIf you're interested in a discussion on social media and Soldiers, myself and /u/rbevans will be part of a hosted Twitter Spaces by [@EODHappyCaptain](https://x.com/EODHappyCaptain), also featuring [@TheIOGuy](https://x.com/TheIOGuy) from USAWTFM.  Feel free to tune in for the discussion if you'd like, we'll also be taking questions/comments from the crowd!\n\nIt'll be tonight, 6/28, at 8pm EST, [you can check it out here](https://x.com/EODHappyCaptain/status/1806791107000377420).",
        "num_comments": 32,
        "comments": [
            "Is there a number to dial in? I can go on a 10 min rant if you want?",
            "Stranded in an airport until 0900 tomorrow, so that’s fucking dope. USO closed at 2100 and there is no lounges, fucking winning my guy.",
            "@EODhappycaptain makes the school house just a little bit better, he always brings positivity whenever he’s walking thru the halls and says hello and such! Glad to see you guys doing a podcast with him.",
            "I'm headed to Nashville tomorrow for some fun times. I'm so excited",
            "I asked for a pass for the debate last night - I needed it. It was very depressing. Does anyone have any other candidates in mind?",
            "Hot take, retention and recruiting would not suffer as it does if the va spent more on care then eligibility determination. If it just treated veterans instead of always searching for reasons to exclude care, much of the horror stories that prevent enlisties from hearing the good the army can provide. New generations seeing failed aftercare of veterans over and over is cumulative and will diminish any surge the services expect in recruiting when they need it the most. ",
            "Really not thrilled with how last night went in our match against Panama. Gonna be watching at Hooters with a buddy on Monday, so at least I’ll have a few beers in me when it doesn’t go our way lol",
            "Official travel? Get a hotel room jtr says you are authorized",
            "Wtf what kind of shit airport are you at",
            "Go get some of that hawk tuah my dude"
        ]
    },
    "I realized this morning, the new Army tape test is kinda whack...": {
        "title": "I realized this morning, the new Army tape test is kinda whack...",
        "score": 219,
        "url": "https://www.reddit.com/r/army/comments/1dr17du/i_realized_this_morning_the_new_army_tape_test_is/",
        "content": "I have a Soldier who, following a near life ending accident, a year of surgeries and physical therapy, became grossly overweight.  We are talking over 200# and standing 5'4\".\n\nSix months ago, he was cleared to return to drill status (profile ended, etc) and since then he's lost 20#.  Still puts him over weight and out of tape.\n\nHe's lost all the \"easy weight\" at this point, and so now its getting harder and harder to scrub off those pounds.  He is doing everything right, he's lifting three times a week and doing HIIT sessions followed by LSS work twice a week.\n\nBut its reached the point where he's just not losing the inches around the middle.  From May to June he lost four pounds and nothing off the waist.  \n\nHis body fat percentage increased by 0.4%.\n\nThis means despite lifting more (benching his body weight for the first time in his life, squatting his old body weight, and straight bar deadlifting in the mid 300's), rucking more, and doing HIIT (ok so his HIIT is 20/10's of jumping rope x10+3 minute rest x3, which I don't know how good is really), and passing his ACFT in the 430 to 450 range...his body fat actually climbed.\n\nHe's got to lose around 4% body fat in the next six months (or around 30#) and I feel like the only advice I can give him is \"Get swol son, that gut is going to take a while to get rid of, so pack on all the muscle you can, without failing your ACFT\"  and that's not great advice.",
        "num_comments": 124,
        "comments": [
            "Can’t outrun a bad diet. \n\nThat being said, has he spoken with his provider about any of his surgeries or conditions causing weight gain or throwing off his tape test? It’s rare, but it’s in the regulation. Maybe he had some medication that wrecked his metabolism. He can avoid a flag if there is any factual medical issue that would make it unreasonably difficult to lose weight.",
            "You can refer him to the Army Wellness Center or dietitians (both are self referral) who can help him look at his diet and see where the disconnect is.",
            "He needs to lose weight like a fat person, not an athlete. Most of his weight loss will be in the kitchen, not the gym. ",
            "I’m trying to understand what the tape test has to do with his situation.",
            "What’s that saying again?\n\nOh yeah, you can’t outrun a bad diet.",
            "You can't just lift weight and expect to lose fat, and I can damn near guarantee that jumping rope isn't getting his heart rate high enough to be a meaningful HIIT workout.\n\nIf you want to lose 1lb of body fat per week you need to be at about a 3500 calorie per week deficit. That means first and foremost changing your diet, and doing *a lot* of long cardio sessions. When I'm cutting I'm doing no less than 45 minutes of cardio five days a week. Losing weight is not easy nor fast, takes an *informed and effective* plan, and commitment to that plan. As others have said, have him see a dietitian to get started.",
            "Yeah, wellness center stat. He can be doing all the PT he wants, but what has his diet been like? Sure, this may be body type dependent, but it sounds like a) his \"HIIT\" isn't really HIIT and b) if he isn't also trimming portion sizes and focusing on the right foods, he screwing himself.",
            "You mentioned drill status. So I presume you're NG or Reserves. You need to find the nearest regular army post with an Army Wellness Center (AWC) and have your soldier schedule an appointment with a BodPod and Dietician. additionally, track down a certified Master Fitness Trainer (MFT) hopefully local to your unit. Have your soldier take their guidance for their situation. \n\nAs good as your advise or research may be you should still have your soldier work with actual certified professionals to deal with their challenge.",
            "Tell him to stop eating so much",
            "You can’t just get muscle while being fat, you need to lose weight regardless, eat less."
        ]
    },
    "This’ll be a fun 15–6": {
        "title": "This’ll be a fun 15–6",
        "score": 131,
        "url": "https://v.redd.it/n01aha1qt79d1",
        "content": "",
        "num_comments": 23,
        "comments": [
            "Dude running in to get his cancer benefits",
            "I feel bad for the e4 and below that have to clean it",
            "The one at Wainwright was bigger, the whole hangar filled up in a few seconds to the rotor blades.",
            "So what you’re saying is some AGR air guard equivalent slots just opened?",
            "Break out the chemlights and some paracord… It’s fucking foam party time!",
            "How do you clean that?",
            "Be warned: it looks tasty but it isn't",
            "Didn't something similar happen at some hanger in Okinawa?",
            "At least it won’t catch fire",
            "I had something similar in mind but you got it 😂"
        ]
    },
    "Can Airborne units stop having people jump on fucking tarmacs for the sake of fake exercises?": {
        "title": "Can Airborne units stop having people jump on fucking tarmacs for the sake of fake exercises?",
        "score": 393,
        "url": "https://www.reddit.com/r/army/comments/1dquh5c/can_airborne_units_stop_having_people_jump_on/",
        "content": "What the fuck does it prove? Stop getting people hurt for no fucking reason. This shit makes my blood boil.\n\nWhy would you fucking force people to jump onto concrete and lose a lot of man power due to injuries? So you can then bitch that they are “turds” for being on a profile that the unit caused? \n\nJBER, AK is hosting an air show and having rear D guys jump onto the tarmac on the Elmo side of post. There’s literally a nice, decent drop zone that most know as the beautiful Malemute DZ. Why not fucking use that?? The fact it’s totally okay to throw guys onto pure concrete at 30ft/sec baffles me.",
        "num_comments": 80,
        "comments": [
            "Because jumpers hit it, even if it’s concrete. That’s why",
            "If we weren’t dumb, we wouldn’t be airborne",
            "This needs a USAWTFM post. With graphics or the CONOP  (sanitized)or something.",
            "24 hour Safety stand downs are way cheaper than a new DZ survey… may have had a BDE Commander that actually said that…",
            "The airshow jump on elmo was one of my favorite. We all hit the grass in the middle of the runway, a Chinook landed, we ran onto it and it flew us back to our cars and we went home.",
            "You play like you practice, huah! \n\n(I couldn’t keep a straight face typing that)",
            "Nasty legs don't have this problem...",
            "Wonder who signed off on that risk assessment.",
            "I was with the 501st. When we did a hard field landing, we were issued knee and elbow pads.",
            "Maybe we like icing our knees and eating IBPs like candy at 37….."
        ]
    }
}