{
    "Important: Request For Comments regarding subreddit rules and future direction. Please Read!": {
        "title": "Important: Request For Comments regarding subreddit rules and future direction. Please Read!",
        "score": 187,
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/10ctvur/important_request_for_comments_regarding/",
        "content": "Welcome to r/ArtificialIntelligence!\n\nOur goal is to provide an open and respectful forum for all things considered Artificial Intelligence - this includes\n\n* Facilitate philosophical and ethical discussions about AI\n* Serve as a starting point for understanding and learning about AI topics\n* Offer technical paper presentations and discussions\n* Present quality AI/ML applications\n* Provide training and learning resources\n* Direct users to more specific information and subreddits\n* List AI/ML applications, their uses, costs, and access information\n* Additional AI-related content.\n* ...and more\n\nThe moderation team for this sub is going through a reshuffle which will result in some changes to the sub. However, there is no need to worry as these changes will primarily focus on improving organization, resources, and pre-prepared content. To ensure that the community is fully informed and able to provide feedback, multiple opportunities will be given for feedback on the changes.\n\nThe first round of feedback gathering is through this thread as a \"Request-For-Comments\" (RFC), which is a standard method of gathering feedback. There will be multiple rounds of the RFC process as the changes are prepared and implemented.\n\n&#x200B;\n\n* Rules on posting new applications / self-promotion / AI generated content\n   * Posts that are applications consisting of a ChatGPT-api \"skin\" or similar will be prevented or confined to specific stickied threads.\n   * AI generated content specific to the arts (writing, visual arts, music) require flair, or will be confined to specific stickied threads.\n   * Blog links should consist of high-quality content. Posts that link to blogs that are purely promotional will be removed.\n   * Posts with just links will be prohibited unless there is a certain word count of detail included. Some effort must be put in.\n   * Should we prevent posts that are written by AI? There exist models that could be used in a Mod-bot, but this is a question we need feedback on.\n* Use of flair in order to organize posts. Note that new flair has been added already, we are open to more suggestions.\n* What should the sub policy on NSFW applications and techniques in regards to AI/ML application?\n* We would like to include the community with ideas for mod-bots. While some standard bots will be used for basic maintenance, but what interesting things can the community come up with for AI/ML bot functions?\n* Cultivating beginner, intermediate, and advanced resources to assist people in finding information, training, models, technical data, etc. that they are looking for\n* Starting substack/podcast to interview people throughout the AI/ML spectrum. This could include philosophers and thinkers, programmers, scientists, business people, even those with antithetical views on AI\n*  If you would like to create banners that represent the sub, please do so with the appropriate size. Any method of creation is acceptable.\n\nIt should go without saying that everyone should be treated with respect. I personally feel that we all know this and it doesn't need to be hammered into people’s heads. Be nice.\n\nThank you for your patience and assistance!",
        "num_comments": 106,
        "comments": [
            "Posts must be in English",
            "Suggestion: A sticky that explains why the sub is titled r/ArtificialInteligence instead of r/ArtificialIntelligence? I'm assuming there is a reason.",
            "Can I respectfully suggest that the Moderator bot communicates directly with offending posters, rather than posting a comment to the original message.  I cannot count the number of times that I have gone to a thread, to see the comment, only to find the same bot-generated text.  It just wastes time.",
            "Should we prevent posts that are written by AI? Definitely not. Should we prevent posts that do not deliver any value? Absolutely!",
            "I'd like a place where its less about specific apps like CHATGPT (there is already a sub for that) and tilts more towards the big picture technically and socially",
            "Thank you for starting this group!",
            "Hi, I'm new to this sub reddit. Any links on where I can get started to understand how to explore ongoing discussions on text generative AI specifically?",
            "is this the right place to learn more about AI or is there other communities that has more interactions?",
            "But, I'd also like to comment on the direction. I have seen others that do focus on a specific direction. But what if the big picture were the focus? I keep ranting about Roger Penrose's views on human consciousness and what it means for human value v. ai, which I won't go into here. The point, though, is that it is possible for a group to actually make the focus defining and thinking about the fundamental level of what this or that type of computer is and does versus a human. That does bring in science, though, very much, not just philosophy. That's why I keep thinking about how Penrose associates the collapse of the wave function with how consciousness emerges from the organ of the brain. That's something non-computational, and, so, even a quantum computer as currently conceived, if that's true, can generate something like human consciousness, though maybe some other definition of AGI is possible. I find those sorts of discussion guiding in that they sort of shed light on the borders of absolute human value, which may not be replicated, perhaps, at least not now. I can discuss those things, whereas when CPUs or training at Nvidia or all that, I'm lost. So, I'm looking for a place to look at things at the fundamental level and what the implications are on a big scale.",
            "Why can't I post a link?"
        ]
    },
    "New Anti-Spam / Bot Rules [Please Read]": {
        "title": "New Anti-Spam / Bot Rules [Please Read]",
        "score": 229,
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/115jk6q/new_antispam_bot_rules_please_read/",
        "content": "We have instituted a rule where accounts newer than a day or users with less than 100 karma cannot post. They can post comments but not submit actual posts. This is part of our plan to address bot spam. Apologies for any inconvenience.\n\nWe will be conducting a poll in the next few days to get the general will of the subreddit and how to improve forward, just a heads up.\n\nAs always, please give us feedback and if you are interested in helping out the sub, please contact me. \n\nThanks everyone!",
        "num_comments": 85,
        "comments": [
            "AI moderation regarding AI bots on a subject discussing AI? Intresting...",
            "One man's spam is another man's religion.",
            "Id like to say that I think the new (boy am I slow!) rule is likely to be too restrictive unfortunately I dont have a good alternative that would both block bots & not block actual users (like me) who mostly lurk, read others posts, & sometimes respond, & _very_ rarely do an actual post My guess is that whats needed is a better way to score an accounts actual history, some method that is relatively robust against gaming. My intuitive sense is that _time_ coupled with some metric of variety might offer the best gateway. Admittedly, this is not responsive to the newbie issue xeneks raises,  but nothings perfect, eh?",
            "Sad. 100 karmareally to high for new ones.  It is also critical to retain newcomers, and cannot be imposed restrictions. Being active depends on new content and posts, not raising the bar to stay and post",
            "so i guess i have to use bots to farm karma just be able to create a post here as a human?",
            "I would change it to ten days. Most bots are willing to wait a day. And you can get 100 karma in 15 minutes on certain free karma subs.",
            "Thanks for the info. I think there's also a karma min for the page, too, right? Or not? I have 754 overall karma, for example, but on this sub I think I have only a few. or can I post now? As well, I want to make sure not to approach the \"self-promotional\" zone. I'm thinking to summarize three blog posts worth of my thinking into a short text I can post here directly and no one would have to go offsite to respond. But, I'd put a link to my blog at the end in case anyone wanted to pursue it further or read my sources or something. Is that appropriate?",
            "Could there be a way to prove I'm not a Bot instead?",
            "Bonjour Quelqu'un aurait la gentillesse de m'expliquer lintrt de reddit et comment a fonctionne ? J'ai l'impression qu'il s'agit d'une usine  gaz :-) Merci d'avance",
            "Thank you for that :D"
        ]
    },
    "Just my opinion": {
        "title": "Just my opinion",
        "score": 35,
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1dr3yuc/just_my_opinion/",
        "content": "As an elder, I can see the draw to AI.  It’s hard to get anyone to explain tech stuff to an old lady, without eye rolling or audible sighs.\nI’ve been using chatgbt for a couple of months, strange as it sounds (as it’s a computer), it’s the only place I can go to get kind, patient answers.\nWhich at my age seems so strange and really sad.  However,  I’m really grateful for it.  I’d be lost…. Google is worthless for me, chatgbt seems to get right to the point without endless tries of different search’s.\nI just feel heard with AI…. Personally, it freaks me out a little.  Is this who I’ll be talking too when I’m 80?  Lol\nAnyway, just my thoughts for the evening… I’m grateful! 😊",
        "num_comments": 26,
        "comments": [
            "Yep its amazing huh? And if you like a nice conversational voice to talk to, with all the similar wisdom of chat gpt, try Pi personal ai assistant in app store. The voice synthesis is incredible.",
            "I agree!  It sure is nice being able to ask any question and expect nothing but a good faith attempt at an answer in response.  It's a refreshing change from generally expecting ridicule just because I'm not the first person in the history of the Internet to have a particular question.  I don't even care that chatbots aren't all-knowing and tend to ramble.  Trying their best to help and acknowledging their own limitations is more that I've come to expect from most humans.",
            "It is assumed that easing loneliness will be a major part of AI applications. Patience is probably one of the biggest advantages. I can ask unlimited follow up questions no matter how stupid they are and I will always get an answer, far beyond what any human would or could tolerate",
            "This is so heartwarming! AI shouldn't replace human connection, but it can definitely be a helpful tool. I love that you find ChatGPT patient and understanding. That's what AI should strive for.",
            "Consider using Google Gemini instead of ChatGPT; their answers are nicer, more polite, and softer.",
            "Ill do better at explaining things to the best of my ability to anyone of any age now. Im sorry you have to see the frustration in people when explaining something, and I do agree that ChatGPT has been very reliable in providing some insightful answers",
            "ok but let's get this straight... it's chatgPt, not gBt",
            "> ts the only place I can go to get kind, patient answers. \n\nyeah, well, just pray that these answers are also correct...",
            "Yes, but is it giving valid answers?   For example, if I asked who was the 16th president of the US and it responds with FDR, you are getting an invalid answer",
            "And more often wrong.\n\nNo one that uses all the models out there regularily would recommend Gemini over anything."
        ]
    },
    "What are some high school AI projects with a \"wow\" factor?": {
        "title": "What are some high school AI projects with a \"wow\" factor?",
        "score": 8,
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1dr9h9o/what_are_some_high_school_ai_projects_with_a_wow/",
        "content": "I am a high school computer science teacher with a Master's in CS. Despite my studies, I have never really explored AI other than some machine learning models that I did in one of my Data classes. \n\nMy principal has told me that I am teaching an AI course in the Fall semester. \n\nThe class has the potential to be really cool, but I honestly just don't have the knowledge. More importantly, *my students* probably don't have the knowledge either. We will be spending about a month reviewing Python (they took an entire intro class on this, so they are familiar generally). After that, I am stumped about what direction to take this class. \n\n**I want this class to be a good experience in which they BUILD cool things - not just learn from a textbook. What are some easy projects that look pretty cool, but don't require a ton of technical knowledge** (perhaps due to Python libraries, etc.)? ",
        "num_comments": 11,
        "comments": [
            "Check out the book, ***Make Your Own Neural Network*** by Tariq Rashid. It uses Python, starts with coding your own Perceptron, and culminates in building/training a neural network to recognize handwritten digits. A non-trivial but fun exercise that teaches a lot. I had to pay $40 for my copy, but I see now it is available on Amazon Kindle for $4.",
            "One crazy thing about AI is that AI itself can help you tackle the learning curve. It is perhaps the first technology that has the ability to educate people about itself.",
            "I've found that simple chatbots and image recognition projects with pre-trained models can be engaging and accessible for high school students.",
            "Thank you! I'll check this out.",
            "Thanks! Do you have any simple chatbots or image recognition projects in mind?",
            "## Welcome to the r/ArtificialIntelligence gateway\n### Technical Information Guidelines\n\n---\n\nPlease use the following guidelines in current and future posts:\n\n* Post must be greater than 100 characters - the more detail, the better.\n* Use a direct link to the technical or research information\n* Provide details regarding your connection with the information - did you do the research? Did you just find it useful?\n* Include a description and dialogue about the technical information\n* If code repositories, models, training data, etc are available, please include\n\n###### Thanks - please let mods know if you have any questions / comments / etc\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ArtificialInteligence) if you have any questions or concerns.*",
            "Thank you!",
            "I also recommend having them watch through [Machine Learning for Everybody](https://youtu.be/i_LwzRVP7bg?si=up_nEwDVAmiNK2bX) if you need to quickly get them up to speed.",
            "Here is a list of beginner AI projects which doesnt require very much proficiency with Python: https://github.com/PacktPublishing/Python-Artificial-Intelligence-Projects-for-Beginners\n\n\nAnd if you are looking for a gentle introduction to Python, then either one of [Python for Everybody](https://www.py4e.com) or the [FreeCodeCamp tutorials](https://www.freecodecamp.org/learn/scientific-computing-with-python/).",
            "My son (13 years old) built this with his friend and some help from myself.\n\n[https://toutou-elis.com/toutou.html](https://toutou-elis.com/toutou.html)\n\nIt's in french but I guess you could translate easily.\n\nIn there, you will also find the GitHub [https://github.com/PatBQc/ProjetElis](https://github.com/PatBQc/ProjetElis) for the source code as well as the parts list.\n\nIt was a really cool project to build and we scaled it from working in computer, then on a Raspberry Pi, then in the stuffed bear.\n\nIt was for the science fair and won a lot of price as well.\n\n\n...and side fact, the code for the Elis was almost 100% generated by ChatGPT, and the responsibe website by Claude 3"
        ]
    },
    "[Help] Looking for AI Tools for Concept/Pet Project": {
        "title": "[Help] Looking for AI Tools for Concept/Pet Project",
        "score": 3,
        "url": "https://www.reddit.com/r/ArtificialInteligence/comments/1drcl9v/help_looking_for_ai_tools_for_conceptpet_project/",
        "content": "**Quick introduction of myself and what I'm looking to do first:**\n\nI'm a software engineer by trade and over the past few months I've seen a ton of jobs being replaced by AI in this field and others. I've raised concerns amongst my network and friends about how AI, even in its infancy already has the capacity to replace less skilled jobs and lower quality content on social media.\n\nHowever, the constant \"comeback\" I hear is that AI is not there yet. So, I've decided to start playing around with it and see how far someone like myself would be able to take AI and try to create content in an industry they have 0 understanding of.\n\n**Where it led me to:**\n\nI've currently created a fictional character called \"Lil Nietzsche\". This is a fictional persona, that draws from the works of Friedrich Nietzsche (German Philosopher) and creates hip-hop songs.\n\nI've so far used very simple and free AI tools to spin up a Youtube channel that I'm going to use to play around to try and create a diverse range of hip-hop songs.\n\nSo far with *alrightish* results, which you can see here [https://www.youtube.com/watch?v=N63K85Ci6zY](https://www.youtube.com/watch?v=N63K85Ci6zY)\n\nI'm using:\n\n1. ChatGPT (Creates Persona and Lyrics)\n2. Suno (Creates the Audio)\n3. Veed (Brings it all together)\n\n**I have 3 goals with this concept project:**\n\n1. Firstly using only free tools and no technical background, I want to see how far I can stretch the AI capabilities to produce content\n2. When I'm happy with the quality of the content I can produce, I want to use the same tools and create a fully automated production pipeline using their APIs\n3. The last goal will be to create a full concept album using only AI. Including Artwork and Videoclips\n\nWith the end result being, that I'd be able to show that using AI only it's possible to produce/create \"good enough\" content at a far faster pace than any individual/business would be able to do so on their own.\n\n**Why I'm reaching out for your help:**\n\nThere's too much information and AI tools out there for me to be able to navigate, filter and test all of them in order to find which ones would be the best fit for what I'm trying to achieve.\n\nApart from the ones I'm already using, I plan on using Midjourney for the Artwork and I'm still yet to figure out what to use for Video generation.\n\nI'm just looking for some pointers from this community, for tools that could possibly fit my needs, so I can narrow down my search and start exploring a bit more in-depth.\n\n**Thank you in advance for tips or pointers you can provide, I'd greatly appreciate it**",
        "num_comments": 2,
        "comments": [
            "## Welcome to the r/ArtificialIntelligence gateway\n### Technical Information Guidelines\n\n---\n\nPlease use the following guidelines in current and future posts:\n\n* Post must be greater than 100 characters - the more detail, the better.\n* Use a direct link to the technical or research information\n* Provide details regarding your connection with the information - did you do the research? Did you just find it useful?\n* Include a description and dialogue about the technical information\n* If code repositories, models, training data, etc are available, please include\n\n###### Thanks - please let mods know if you have any questions / comments / etc\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ArtificialInteligence) if you have any questions or concerns.*"
        ]
    }
}