{
    "HAVE A QUESTION? ASK HERE! Alter-Daily Help and Questions: June 28, 2024": {
        "title": "HAVE A QUESTION? ASK HERE! Alter-Daily Help and Questions: June 28, 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/AsianBeauty/comments/1dqlwch/have_a_question_ask_here_alterdaily_help_and/",
        "content": "Hello and welcome to the Alter-Daily Help Thread! The purpose of the ADHT is to ask simple questions, troubleshoot routines, get quick recommendations, prevent the sub from being too cluttered, and to guide new users.\n\n# ADHT Rules: If questions or comments break the rules or are inappropriate, the report button is the fastest way for the mod team to see it and address the problems.\n\n**Build Me A Routine,** [/r/AsianBeauty](https://www.reddit.com/r/AsianBeauty)**!** Please refrain from just stating a skin concern then expecting people to build a routine from scratch. It is important to do due diligence in understanding your skin type and needs. Learn more here in [The New User Guide](https://www.reddit.com/r/AsianBeauty/wiki/new_user_guide). You can also [search the subreddit here](https://www.reddit.com/r/AsianBeauty/search?q=search+here&restrict_sr=on&include_over_18=on&sort=relevance&t=all).\n\n**Non-AB questions or comments.** Having non-AB products in your routine is totally fine! Getting specific advice/recommendations is not allowed, though welcomed in our Daily Anything Goes thread. See our rules on [non-AB here](https://www.reddit.com/r/AsianBeauty/wiki/rules#wiki_14._topics.2C_routines.2C_and_recommendations_must_be_related_to_asian_beauty)\n\n**Rude comments and snark.** Fairly self explanatory but for more detail, check out our [Posting Guidelines](https://www.reddit.com/r/AsianBeauty/wiki/postguidelines)\n\n**When directing someone to the sidebar** provide specific links. i.e. for someone asking about Allergies or Beginner Guides, link them to the specific subsections within AB University, rather than saying *it’s in the sidebar.*\n\n**Finally, a reminder that no one is obligated to answer your questions.** If you have repeatedly asked the same question without a response, it may be best to review and see if it can be reworded or if the information is already in the thread or readily available in the sidebar materials.\n\n**Remember that all skincare is individual and Your Mileage May Vary with recommendations. We are enthusiasts, not doctors, and we cannot provide you with medical advice. Speak to a medical professional if your skin concerns are affecting your well-being.**\n\n# When Posting\n\n**Where applicable, consider sharing with us the following so we can help you better (*****click Source below this post if you would like to copy the formatting*****)**\n\n* **Skin Type**\n* **Country/Climate I am in**\n* **Top Skin Concern**\n* **Current Routine/Products I am Using**\n\n**AM** \\* \\[product\\] \\* \\[product\\] \\* \\[product\\]\n\n**PM** \\* \\[product\\] \\* \\[product\\] \\* \\[product\\]\n\n**I specifically \\[want help with/am looking for a product to/am curious about trying\\]**.\n\n# Other Helpful Links\n\n* [\"Where to Buy\" Spreadsheet](https://docs.google.com/spreadsheets/d/1MOSSSJXjrEd0UTsukaMdlNH8QwgA2_w4SekzLjCMppQ/edit?usp=sharing) is a community-aggregated resource of sites and stores our members buy from from around the world.\n* [Routine Order](https://www.reddit.com/r/AsianBeauty/comments/2jcss2/asian_skincare_101_a_beginners_guide_faq/), [Routine Order FAQ](https://www.reddit.com/r/AsianBeauty/comments/2tokdr/product_and_routine_order_faq/), [Routine Order including Actives/Acids](http://www.snowwhiteandtheasianpear.com/2015/01/skincare-discovery-putting-your.html)\n* [Expiration Date of Japanese Skincare/Beauty Products](https://www.reddit.com/r/AsianBeauty/comments/nt4fhe/guide_the_expiration_date_of_japanese_products/) by [u/marcelavy](https://www.reddit.com/user/marcelavy/)\n* [Sunscreen FAQ](https://www.reddit.com/r/AsianBeauty/wiki/theabroutine/#wiki_5.5_sunscreen_faq)\n\n**2023-Specific**\n\n* [2023 Reformulated/Discontinued Japanese Sunscreens](https://www.reddit.com/r/AsianBeauty/comments/zmqz7s/guide_japanese_sunscreen_roundup_2023/) by [u/marcelavy](https://www.reddit.com/user/marcelavy/)\n* [2023 Korean Sunscreen Releases & Reformulations](https://www.reddit.com/r/AsianBeauty/comments/121xn58/a_lil_compilation_of_2023_ksunscreen_releases/) by [u/royalsincognito](https://www.reddit.com/user/royalsincognito/)\n* [2023 Webshops' Delivery Times](https://www.reddit.com/r/AsianBeauty/comments/11btmdo/where_was_your_last_ab_parcel_from_and_how_long/)",
        "num_comments": 80,
        "comments": [
            "cushions like rom&nd bare water? it feels very light on my face and i love the natural and glowy finish!",
            "missha vs purito bb cream?",
            "Whats the best way to remove stubborn waterproof mascara? (Canmake Quick Lash Curler)",
            "Hi! Any recommendations for moisturizers that are good for sensitive skin, hydrating enough, and is not sticky? Currently using Illiyoon Ato Gel and while it works well, it dries tacky and I find my face sticking to my silk pillowcase. I tried the Naturie Hatumogi Gel but I seem to have a reaction to it but it dries down nicely. Help pls!",
            "My ETUDE HOUSE Dear Darling Water Gel Tints have gone murky before the expiration date. Should I toss? ",
            "Does anyone have any recs for a face moisturizer thats easy to carry around like a sunscreen is? I might start showering at my gym and Id like to carry a moisturizer (and a sunscreen but I have that covered) with me so I can put that on when I get out of the shower. \n\nI recently finished accutane so my skin used to be acne prone, but now its closer to normal-dry if that helps. The purito unscented recover cream stings my skin for some reason but I can tolerate most products as long as they dont have a super strong fragrance :)",
            "I got a refill of a cleansing oil (kose speedy) instead of a bottle, do you think Ill need to wash out my empty bottle of hada labo cleansing oil first or do you think its fine if I just put the kose in there without cleaning it because theyre both cleansing oils?",
            "Which Hada Labo lotion should I choose? I have skin that currently is normal/dry and dehydrated that has redness and mild rosacea. My skin is prone to breaking out if it doesn't like a product, but my acne is otherwise contained by oral and topical acne meds. I am in my 30s and I have some scarring from years of poorly controlled cystic acne. I'm thinking the Gokujyun Premium Lotion, is that correct?",
            "does anyone know the difference between the pink saem concealer (COVER PERFECTION Fixealer Concealer) and the black one (COVER PERFECTION Tip Concealer?",
            "do i need to use two toners? or can i just use a essence glow toner"
        ]
    },
    "Anything Goes Friday: June 28, 2024Mod Post": {
        "title": "Anything Goes Friday: June 28, 2024Mod Post",
        "score": 4,
        "url": "https://www.reddit.com/r/AsianBeauty/comments/1dqlxzn/anything_goes_friday_june_28_2024mod_post/",
        "content": "Want to talk about non-AB products? Frustrated and need to rant? Can't wait until Friday to share your haul? Found an amazing deal? Post it here in our (almost) Anything Goes Thread! Remember to adhere to general conduct of the sub and keep it civil. Self promotion, research, and no business rules still apply.\n\n**All personal or basic questions related to your routine or AB products still belong in the Alter-Daily Help Thread.**",
        "num_comments": 26,
        "comments": [
            "I think the isntree yam cleanser leaves residue in my eyebrows - as I'm able to scrape product off my brows when I wash in the morning. It doesn't seem to irritate my skin but it's kinda weird ",
            "Im wearing the limited canmake mini eyebrow mascara in oshare purple and its so fun! Its a dark purple brown and I decided to just use the mascara without filling in with a pencil and it still looks good as is.",
            "I just bought the d'alba serum spray (6.08 fl oz) on costco (online) for $26.99. I think this is their new big size. Good deal imo. I almost bought it on Amazon because the 3.38 fl oz was on sale for $20. I am currently in the US, not sure if its same in other places. The mediheal pads still out of stock which makes me sad cause i missed out on it.",
            "I prefer lip masks in tubes now instead of tub because I have to find the applicator every time I want to re-apply products to my dry lips. Tub lip masks feel like they have more product though compared to the tube maybe thats why they are more expensive?",
            "On Monday, I started using the BOJ cleansing balm, and I'm definitely breaking out as a result (CCs, whiteheads, maybe some cystic acne lurking), which I HATE. The formula is so nice! And it wipes away my very waterproof peripera mascara like it's nothing. Sigh. So continues my summer quest to calm my skin.",
            "How do yall feel about semi-bleached brows? I kinda wanna go for a milk tea brow look but idk how I would do it since I doubt its safe to put regular hair dye on my brows, and I dont think they make milk tea brow dye right??",
            "Ive been using the mixsoon bean essence and it has made me break out in CCs and whiteheads. (I scratched the whitehead with my nail and it was left bloody). Its so disappointing because Ive heard nothing but glowing reviews for this product and the ingredients list also seems safe for sensitive skin but alas, its not working for me so Ill be stopping using this product. \n\nI also bought 2 other moisturisers and theyll be arriving soon but now Im scared to use them because what if I break out like the mixsoon bean essence did to my skin :((",
            "You guys ever have a good routine going and decide to branch out and experiment, only to end up with bad reactions, irritation, and breakouts? \nIdk why I keep doing this to myself!! I have come to accept I simply cannot tolerate niacinamide at high percentages (even at 2%) and I'm going back to my almost entirely Isntree routine again.",
            "Dude you have to get the cream too!! I got the cream yesterday and I am obsessed already.",
            "Hello there! This is an automated bot to remind you that our subreddit is made of up of all kinds of people. In order to include everyone in the discussion, consider using gender-neutral words when addressing the community. Thank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AsianBeauty) if you have any questions or concerns.*"
        ]
    },
    "sunscreen haul from stylevana!": {
        "title": "sunscreen haul from stylevana!",
        "score": 305,
        "url": "https://i.redd.it/0tv751mb8e9d1.jpeg",
        "content": "",
        "num_comments": 59,
        "comments": [
            "Used Missha today - loved it!",
            "Whats your take on the isntree sun gel?",
            "the haruharu wonder airyfit is my HG <3",
            "Im currently finishing up my biore watery essence, so Im stocked up with some sun screen all purchased from stylevana!\n\nPhoto: Kao Bior UV perfect milk SP50+PA++++, Logically Skin professional sun block SPF50+ PA++++, Nivea UV medicated gel SPF35 PA+++, MISSHA all around safe block soft finish sun milk SPF 50+ PA+++, Dr. G brightening up sun + SPF 50+PA+++, haruharu wonder black rice moisture airyfit daily sunscreen spf50+ pa++++, beauty of Joseon hyaluronic acid watery sun gel SPF50+ PA++++, skin1004 Madagascar centella hyalu-cica water-fit sun serum spf50 pa++++",
            "Which one is good for humid weather and oily skin?",
            "You had me at sunscreen ",
            "Does your skin of josen sunscreen have a sunscreen scent??? I just bought one and I cant tell if its counterfeit or not ",
            "OP please do a review when youve tried them all!",
            "How long did it take for your order to ship/arrive?",
            "Dr.G!! I used three of them"
        ]
    },
    "Review": {
        "title": "Review",
        "score": 42,
        "url": "https://i.redd.it/mn8mwovaeg9d1.png",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Mary & May Idebenone Blackberry serum and cream are HG for me!  agree with glass skin results. The glow from both of them is really noticeable! \n\nAlso, Anessa has no visible white cast on me. Its still my favorite sunscreen even for the 2024 version, although it is a bit drier for me (but nothing a good moisturizer underneath cant fix).",
            "dokdo toner! i rlly love it",
            "My friend had dragon boat training and used Allie, the white cast was so so bad. He hated it.",
            "Skin type: Combination, Climate: Mediterranean, Skin tone: Fitzpatrick type II\n\nAllie Gel UV EX SPF50+ PA++++ : I bought this to be used as an outdoor sunscreen for the face. It has a gel texture, easy to apply. There is also a weird scent that goes away. Gives me an obvious white-cast, sting my eyes and leaves a slightly greasy finish. Will finish it up on my body when going for a run. For these reasons, I will not repurchase.\n\nAnessa Perfect UV Skin Care Milk SPF50+ PA++++ (2022 version) : Milky texture, easy to apply. The scent is baby powder which I dont mind. The finish is natural dewy for me, does not sting my eyes. It leaves a slightly visible white-cast on me upon first application which I can accept, but the white-cast intensifies when I reapply a few hours laters. For this reason, I will keep looking for my HG outdoor face sunscreen. I also tried it out for running, it seems to stay put. So I would repurchase for this purpose alone. I am also curious about the 2024 version, for those who have tried both versions please feel free to chime in on the differences :)\n\nFor those wondering about the differences between the Anessa and Shiseido sunscreens, below is a review I copy pasted from my previous review post for easy comparison:\n\nShiseido The Perfect Protector SPF50+ PA++++ : Milky, water-resistant sunscreen with a scent that lingers (not able to describe the scent). Easy to apply, dries to a nice dewy finish on the skin, but leaves a white cast on me. It is not too bad but still visible to me. After 1-2 hours, it starts to burn my eyes when I apply around them. I use it on my face and neck for running and it appears to stay put after sweating, so I might re-purchase this just for this purpose.\n\nCOSRX Aloe 54.2 Aqua Tone-Up Sunscreen SPF50+ PA++++ : This sunscreen has a slight sunscreen smell, creamy texture. The finish is patchy and uneven (made visible from the pink tint) no matter how much I try to rub it in. Tried the spread and tap technique I saw from some Youtube videos, in which I need to spread a small amount on an area, then tap until it blends in. With this technique, it does blend better but it took me at least 15 minutes just to spread and tap the proper amount. IMO, it is more trouble than its worth. It is also sticky on my skin. Gives me eye-sting when applied around the eyes. Definitely would not repurchase. For reference, I did not know what a tone-up sunscreen is going in. A quick Google search told me that its for evening out and brightening skin tone. So Im not sure if Im using this the right way. \n\nMary & May Idebenone + Blackberry complex serum: Used this for 2 months. I apply 2 drops of this serum on the face after cleansing. It is a light watery serum, absorbs fast and non-sticky. It brightens my skin, the hydration is okay for me. I follow with a moisturizer and sunscreen, this gives me an instant glass skin look without looking oily. However I would not repurchase because this serum is not necessary for me, my daily sunscreen is already leaving a natural dewy finish on my skin which I like. For those who want more brightening effect, you might like this serum.\n\nRound Lab 1025 Dokdo toner : Bought this because of the hype. Used this for 2 months, twice daily. Its a watery toner, I use 2-3 layers of it and it does not feel sticky on my skin. The hydration is just okay for me. I would not repurchase because this does not do anything for me."
        ]
    },
    "Make the best out of expensive ticket visiting home": {
        "title": "Make the best out of expensive ticket visiting home",
        "score": 232,
        "url": "https://www.reddit.com/gallery/1dqpv85",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Considering its Japan, this is considered a pretty tame haul LOL",
            "Sheet mask: Papa recipe bombee honey, Melano CC, Hada Labo Koi-Gokujyun, Wonjin, Mediheal teatree, Pyunkang Yul Black Tea Revitalizing & Calming mask, Dr G Red Blemish, Foodaholic nature & Tranexamic acid mask, Nature republic green tea, Yuejin B5 EGF, Kose Clear Turn Better Keana Komachi, Keana rice mask, Kose Clear Turn Cosmepost Craftman Honey & Sake, Some By Mi AHA/BHA & Matcha & Honey, Pretty Skin Rice & Reg ginseng & Rice & Tea tree & Snail & Charcoal & Houttuynia cordata. \n\n2nd pic: Hada Labo Koi-Gokujyun Perfect Uv Gel, Kuramoto Bijin Sake Lotion, Cosrx propolis trial set, MISSHA Time Revolution first essence 5x & Artemisia Calming Essence, Cos de baha retinol 2.5, Fraijour Original Artemisia Steam Mask & Pro Moisture Milk Toning Clay Mask, Derma Factory retinal 1000ppm cream, Dr.G Clear cream & Clear soothing cream, Tiam c24 serum, Manyo bifida biome complex ampoule, Melano CC serum, Pair acne cream, Fraijour Original Herb Wormwood Calming Toner",
            "Hada Labo, ma:nyo, Dr. G, TIA'M it's beautiful. ",
            "Accidentally read the \"RS\" in the CDB serum as \"BS\" and was like \"a bullshit serum, really?\" lol \n\nI have not heard of Fraijour until this post, how are their products?",
            "Have you tried the Dr G red blemish clear cream?",
            "Lovely - is Dr G red blemish good ?",
            "These will last you a whole years  I wanna take a trip South Korea just to shop for skincare but",
            "How are those Kose Clear Turn sheet masks?",
            "Is the pair cream really as amazing as the TikTok videos claim",
            "I LOVE the papa recipe sheet masks  they're really soothing and the honey smell makes skincare session a treat"
        ]
    }
}