{
    "r/ask and r/questions are recruiting! Fill out our moderator application here. No experience necessary.": {
        "title": "r/ask and r/questions are recruiting! Fill out our moderator application here. No experience necessary.",
        "score": 40,
        "url": "https://www.reddit.com/r/ask/comments/1b1hdp3/rask_and_rquestions_are_recruiting_fill_out_our/",
        "content": "As Reddit continues to grow, so does our subreddit and our sister sub [r/questions](https://www.reddit.com/r/questions/). With more users and more content coming everyday, we find ourselves in need of some new moderators to help keep the subreddits running smoothly.\n\nIf you're interested in applying, you can fill out our application [here](https://forms.gle/Y5DUXrx4bT5JpcAq7). No experience is necessary. We have training materials available and are happy to answer any questions you have.\n\nIf you have any questions about applying or moderation don't hesitate to ask here in the comments or reach out in modmail.",
        "num_comments": 46,
        "comments": [
            "# Message to all users:\n\nThis is a reminder to please read and follow:\n\n* [Our rules](https://www.reddit.com/r/ask/about/rules)\n* [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439)\n* [Reddit Content Policy](https://www.redditinc.com/policies/content-policy)\n\nWhen posting and commenting.\n\n---\n\nEspecially remember Rule 1: `Be polite and civil`.\n\n* Be polite and courteous to each other. Do not be mean, insulting or disrespectful to any other user on this subreddit.\n* Do not harass or annoy others in any way.\n* Do not catfish. Catfishing is the luring of somebody into an online friendship through a fake online persona. This includes any lying or deceit.\n\n---\n\nYou *will* be banned if you are homophobic, transphobic, racist, sexist or bigoted in any way.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ask) if you have any questions or concerns.*",
            "Can this moderator experience be put on job resumes?",
            "I would like to join",
            "I was near area 51 in Nevada.  I saw two flying objects, one was wobbling, they were both sky blue in color and became more easily visible when they moved between me and a cloud.  I saw two items fall from the one that was wobbling.  The wobbling object crashed further away.  I drove my truck to where the pieces fell from the wobbling object.  The pieces were sky blue in color.  \n\nOn the ground near where the pieces fell was a large shape that was sky blue in color.  I took many photos from different angles and many videos. I also recorded GPS coordinates of where the shape was located.\n\nWhen I touched the shape, a panel opened.  I saw a screen with an image of earth, the moon and the sun, and odd symbols.  Next to the screen were illuminated buttons.  I lifted one end of the shape to put it in my truck.  As I lifted one end of the shape, it rose into the air about 4 feet off the ground and stayed there.  I did not have straps to secure the shape in the bed of my truck.  I did not want the shape to leave my truck bed if I hit a bump in the road. I dug a hole and buried the shape.  I would like to sell the shape to the highest bidder or, in the alternative, give it to a party to study with a contract that gives me 85% of any profits derived from study of the shape.  The party must satisfy me that it has the technological ability to properly examine the shape and develop technology from study of the shape.  No US companies allowed.",
            "Any specific requirements?",
            "I would love to be a mod / admin :)",
            "why is it red?",
            "if theres any mod on this post, can someone tell me why are so much posts getting locked? i get a post recommended to me to then be nearly always hit with the ''Locked post.'' message and it irritates me so much",
            "Lol.",
            "im all in"
        ]
    },
    "Anyone love just laying in bed and just doing nothing?": {
        "title": "Anyone love just laying in bed and just doing nothing?",
        "score": 1330,
        "url": "https://www.reddit.com/r/ask/comments/1dld9to/anyone_love_just_laying_in_bed_and_just_doing/",
        "content": "I found myself i can literally do this for days. Not sure if this is a sign of a burn out, depression, or anything else. I’m just not as excited about going out and life in general anymore",
        "num_comments": 413,
        "comments": [
            "# Message to all users:\n\nThis is a reminder to please read and follow:\n\n* [Our rules](https://www.reddit.com/r/ask/about/rules)\n* [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439)\n* [Reddit Content Policy](https://www.redditinc.com/policies/content-policy)\n\nWhen posting and commenting.\n\n---\n\nEspecially remember Rule 1: `Be polite and civil`.\n\n* Be polite and courteous to each other. Do not be mean, insulting or disrespectful to any other user on this subreddit.\n* Do not harass or annoy others in any way.\n* Do not catfish. Catfishing is the luring of somebody into an online friendship through a fake online persona. This includes any lying or deceit.\n\n---\n\nYou *will* be banned if you are homophobic, transphobic, racist, sexist or bigoted in any way.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ask) if you have any questions or concerns.*",
            "For me it’s depression.",
            "Me! And im not depressed. I just enjoy being home laying around with no where to go or anything to do. Life is so busy always, i quite frankly love days where i can stay in my pjs and do absolutely nothing! We are always so go go go that its hard to find the time to just kick back and unwind. Nothing id rather be doing honestly.",
            "I’ve been doing this for months at weekends. The only thing I do is take the dog for a walk twice a day.\nI’ve just had one shitty thing happen after another for years.\nI’ve got up after each shitty thing, pushed myself to keep going until I can’t anymore.\nI work but apart from that I have no motivation , no purpose and nothing that excites me.\nTomorrow I’m planning on not going back to bed after walking the dog and cleaning the house and starting on the garden which is completely overgrown.\nI’m going to keep at it all day.\nIt’s the anniversary of my Mums death on Sunday, so Im going to try and keep busy then too and try and sort out my finances.\nOn a positive note I’ll have been taking Tamoxifen for nearly 2 years now so only have another 3 to go.",
            "Yep. I have been like this all day today. But I kinda think that I am depressed. Normally I can’t stand staying home all that time. But I have been like this lately. Energy depleted",
            "That’s me right now. My question is, how would anyone not love doing this lol ",
            "I used to. I never wanted to do anything unless I was drinking. Got diagnosed at 43 with ADHD. Absolutely zero desire to lay around now that I’m medicated. I want to be productive all day now. Always want to be doing something.",
            "It's great, then it becomes more frequent but it still seems good. Then comes the unpleasant feeling that it might be a symptom of something bad. So naturally, you just stuff that worry down. As deep down as you can and ignore it. Until you die. (Source: British)",
            "I love laying in bed! It's my favourite thing and I can do it for days on end. Been wondering myself if this is depression, but I just love the snuggling feeling of relaxing and be comfortable. I'm really enjoying myself just laying there",
            "It's a sign that you are completely normal and enjoy the simple things, that's where robust joy is found."
        ]
    },
    "Why do people claim that looks aren't important?": {
        "title": "Why do people claim that looks aren't important?",
        "score": 125,
        "url": "https://www.reddit.com/r/ask/comments/1dlrecp/why_do_people_claim_that_looks_arent_important/",
        "content": "And some even go as far as claiming that they don't matter at all.\n\nBut if we take love and relationships as an example, which is a very important aspect of life for most people, it's obvious for everyone, that it isn't true. If your'e very unattractive the people you yourself are attracted to won't date you. Only people whom you don't find attractive and who don't find you attractive either might be willing to get into a relationship with you, which obviously isn't a good foundation for a relationship.\n\nSo why do people make the claim, even though they're aware of things like that?",
        "num_comments": 240,
        "comments": [
            "# Message to all users:\n\nThis is a reminder to please read and follow:\n\n* [Our rules](https://www.reddit.com/r/ask/about/rules)\n* [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439)\n* [Reddit Content Policy](https://www.redditinc.com/policies/content-policy)\n\nWhen posting and commenting.\n\n---\n\nEspecially remember Rule 1: `Be polite and civil`.\n\n* Be polite and courteous to each other. Do not be mean, insulting or disrespectful to any other user on this subreddit.\n* Do not harass or annoy others in any way.\n* Do not catfish. Catfishing is the luring of somebody into an online friendship through a fake online persona. This includes any lying or deceit.\n\n---\n\nYou *will* be banned if you are homophobic, transphobic, racist, sexist or bigoted in any way.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ask) if you have any questions or concerns.*",
            "I have developed feelings for women that I didn't find physically attractive because they had other traits that I did find attractive. Those traits eventually led to me becoming physically attracted to them. I've also dated women that I found very attractive and then lost that attraction once I got to know them better.\n\nThe fact that my attraction to someone's appearance can change depending on their character and other personality traits is why physical appearance isn't an important factor for me when pursuing a potential relationship.",
            "This whole thread is delusional and pure wishful thinking.",
            "Hypocrisy, same with people who have a lot of money and claim that money are not important, they have no idea how lucky they are until they don't  have them anymore ",
            "I think they mean that looks aren't the only thing that's important.",
            "Because looks don't hang around forever",
            "Of course looks are important. Anyone claiming the opposite is just kidding themselves.\n\nBUT: a) it's not everything, b) looks change so you better be damn sure there's more to a relationship than that, c) good looks don't guarantee attraction and d) what someone finds attractive is highly subjective, not always obvious and goes beyond just certain \"features\"",
            "No one is claiming that looks are not important. People are just saying that looks aren’t the be all end all of everything.\n\nI know it from experience. My looks did not change (at first) and I had zero chances with women because I never talked to them, never went anywhere and was constantly self-depricating. I am also not wealthy. But when my attitude and my sense of self worth changed and I started to feel at ease with myself, started to see my own value as a person, things took a 180 and girls started noticing me. I dated rich and hot dentist girls and they were full of insecurities. I went out with girls who did modeling and they were literally the most basic, boring fucking people I have ever met. I had girls I only briefly talked with once while they were in a relationship get into my DMs months later when they were single. Not because of money, no looksmaxing, not even a trendy fucking haircut or a beard, just by being a decent human being and doing basic things like looking after my hygene and not thinking like a loser incel.",
            "It's a cope",
            "Being honest with myself, I’d like to be attracted to what I’m about to be waking up next to"
        ]
    },
    "How to get 13 year old to quit doing drugs?": {
        "title": "How to get 13 year old to quit doing drugs?",
        "score": 376,
        "url": "https://www.reddit.com/r/ask/comments/1dlkue3/how_to_get_13_year_old_to_quit_doing_drugs/",
        "content": "My 13 year old sister is constantly doing stupid shit. Vapes, weed pens, talking unidentified pills. And most recently talking a bunch of Benadryl. She also has had a seizure( likely due to NyQuil and weed pen at the same time)\n\nshe’s depressed but she refuses to talk to anyone. We’ve tried therapy twice but she won’t participate. \n\nThe family is constantly stressed because of this. And we’re all at a loss of what to do",
        "num_comments": 362,
        "comments": [
            "# Message to all users:\n\nThis is a reminder to please read and follow:\n\n* [Our rules](https://www.reddit.com/r/ask/about/rules)\n* [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439)\n* [Reddit Content Policy](https://www.redditinc.com/policies/content-policy)\n\nWhen posting and commenting.\n\n---\n\nEspecially remember Rule 1: `Be polite and civil`.\n\n* Be polite and courteous to each other. Do not be mean, insulting or disrespectful to any other user on this subreddit.\n* Do not harass or annoy others in any way.\n* Do not catfish. Catfishing is the luring of somebody into an online friendship through a fake online persona. This includes any lying or deceit.\n\n---\n\nYou *will* be banned if you are homophobic, transphobic, racist, sexist or bigoted in any way.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ask) if you have any questions or concerns.*",
            "I know someone with a child exactly like this. No one could discern what was wrong with the girl, she acted just like how you describe your sister’s actions. One day the father received a call from the FBI saying that they had arrested a child molester and identified the girl as one of the victims through his phone. She was able to get some help after people knew what was going on with the poor girl. \n\nI’m not going to assume things are so drastic with your sister, but *something* is bothering her, and that something will require professional intervention. Good luck and I hope all is well.",
            "If she was my 13 yr old child I'd be looking at compulsory rehab and psychiatric care. High THC and random chemicals can be catastrophic to the developing brain of such a young person. You're describing a crisis that requires authoritarian intervention IMHO.",
            "Something is wrong and I bet she is ashamed to talk about it.",
            "Sounds like she's on a real path to self destruction.\n\nSounds like the best you can do is tell her that if she needs to talk about anything, no matter what, that you're there to listen and you'll always be there for her. Make sure she takes what you say seriously.\n\nIf she's had some problems she might open up to you.",
            "I wonder what led her to get to the point of trying those things and not wanting to talk to anyone.",
            "wow 13 is scary young for that. I mean if your parents already know and she's still doing it she sure asf has a lot more freedom than she should. She's getting out and getting those things somewhere. She needs to go to a rehab facility.",
            "Well reading your post history your sister is doing drugs, not leaving the house, has an incredibly dirty room to the point of mold and disgusting smells.\n\nDepression. Your sister is depressed and needs serious help.",
            "Maybe take her to someone who isn't a therapist first. There are social workers that specialise in such matters and are maybe they are able to break the ice without making her feel like she is being forced",
            "I’m a recovering addict. Something is bothering your sister really bad. Something happened or she is not understanding her feelings. Depression has many faces. She needs help with whatever is causing her to turn to the substances. It will only get worse from here unless the true problem is dealt with. If she is messing around with pills; that is not to mess with. You have no clue what’s in those pills nowadays. And if she is getting them from family and friends medicine cabinet, which I did, she needs help like yesterday. \n\nAre YOU close with your sister? Are you able to sit her down and tell her how much you love her and that you are there for her? Tearing someone down when they are depressed only fuels the fire. If you are not the answer maybe a teacher she admires? Or a friend, anyone who she is close with. \n\nI hate to say this, but ultimately this is your sisters choice to stop or not stop. From personal experience, someone “telling” me to just stop only made me do it more.  Because to me, they didn’t understand the hurt I was feeling. \n\nI’m not sure if I gave you any answers and I’m sorry about that. My heart goes out to you and your family. Your sister will be in my prayers. Healing her mind and heart is where the focus needs to be. Best of luck. ❤️‍🩹"
        ]
    },
    "What became of the most beautiful girl in class at high school? ": {
        "title": "What became of the most beautiful girl in class at high school? ",
        "score": 329,
        "url": "https://www.reddit.com/r/ask/comments/1dllc4e/what_became_of_the_most_beautiful_girl_in_class/",
        "content": "She’s actually still a close friend of mine - she got a very good job in finance, married a men with a PhD in the London school of economics and they have two beautiful babies ",
        "num_comments": 364,
        "comments": [
            "# Message to all users:\n\nThis is a reminder to please read and follow:\n\n* [Our rules](https://www.reddit.com/r/ask/about/rules)\n* [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439)\n* [Reddit Content Policy](https://www.redditinc.com/policies/content-policy)\n\nWhen posting and commenting.\n\n---\n\nEspecially remember Rule 1: `Be polite and civil`.\n\n* Be polite and courteous to each other. Do not be mean, insulting or disrespectful to any other user on this subreddit.\n* Do not harass or annoy others in any way.\n* Do not catfish. Catfishing is the luring of somebody into an online friendship through a fake online persona. This includes any lying or deceit.\n\n---\n\nYou *will* be banned if you are homophobic, transphobic, racist, sexist or bigoted in any way.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ask) if you have any questions or concerns.*",
            "Mine were actually twins. They had the same set of friends, they took the same college course, same classes, and now are BOTH teachers at the SAME highschool we grew up in. it still boggles my mind.",
            "I am still beautiful and successful. Thank you for asking.",
            "She met a guy on the ski team in college who was from Norway, and lives there now.",
            "English teacher Suzie, absolute milf shout out Mrs Chandler",
            "She’s a nurse practitioner. She was always nice though.\n\nMarried a cool dude ( who always was nice too), they have a few kids.\n\nIn general they were both just amazing people and looked good too, very much the opposite of the stereotype you hear of. Dated each other in high school too.",
            "She’s a school teacher now and is fine as hell. I see her post on social media of her traveling all the time during the summer",
            "Ok there were a few\n\n- one married a football star from a super wealthy family, it seemed like they separated for a bit but are back together and had a baby so good for her I guess. \n- another one also married a football player and lived in various countries and had a kardashian style wedding and still looks stunning and has tow gorgeous kids \n- one tried to make it as a singer and actress mostly does weddings and married a Swedish music producer. I think she works full time as a singer but not exactly as successful as she wanted \n- one worked as a model and then was on a tv show for a few years and now appears to not be working but is engaged and seems happy ",
            "My blood runs cold, my memory has just been sold…",
            "She's a doctor, specialising in chemical pathology."
        ]
    }
}