{
    "r/ask and r/questions are recruiting! Fill out our moderator application here. No experience necessary.": {
        "title": "r/ask and r/questions are recruiting! Fill out our moderator application here. No experience necessary.",
        "score": 44,
        "url": "https://www.reddit.com/r/ask/comments/1b1hdp3/rask_and_rquestions_are_recruiting_fill_out_our/",
        "content": "As Reddit continues to grow, so does our subreddit and our sister sub [r/questions](https://www.reddit.com/r/questions/). With more users and more content coming everyday, we find ourselves in need of some new moderators to help keep the subreddits running smoothly.\n\nIf you're interested in applying, you can fill out our application [here](https://forms.gle/Y5DUXrx4bT5JpcAq7). No experience is necessary. We have training materials available and are happy to answer any questions you have.\n\nIf you have any questions about applying or moderation don't hesitate to ask here in the comments or reach out in modmail.",
        "num_comments": 49,
        "comments": [
            "Can this moderator experience be put on job resumes?",
            "I would love to be a mod / admin :)",
            "if theres any mod on this post, can someone tell me why are so much posts getting locked? i get a post recommended to me to then be nearly always hit with the ''Locked post.'' message and it irritates me so much",
            "Is this a voluntary position?",
            "This place is like the ominous varient of ask reddit",
            "I got 3 garbage bot posts in my feed from this subreddit despite not having interacted with this subreddit before\n\nDo you need help with dealing with them?",
            "Well you obviously need some HUMAN moderators because I just posted a very simple post and I got rejected because your AI thought it was a question about suicide? (which is clearly was not). FFS, lol...",
            "Is this remote job payed?",
            "Me interesa, me dan mas información... Gracias",
            "Does this require a high amount of karma? Or is no or low karma fine?"
        ]
    },
    "My (F18) professor invited me for coffee. Is this normal???": {
        "title": "My (F18) professor invited me for coffee. Is this normal???",
        "score": 1820,
        "url": "https://www.reddit.com/r/ask/comments/1dqx7x3/my_f18_professor_invited_me_for_coffee_is_this/",
        "content": "\n\nI (F18) am currently doing a short course on something I'm interested in. My professor, who looks like he's in his mid 30's, messaged me and tried\nto start a conversation, i thought it was weird because we barely spoke in class. I answered how i normally would to a stranger and then he asked me for coffee out of nowhere. I felt weirded out and rejected him. \nMy friend who took the course last year told me that he also messaged other girls around my age.\nWas this normal? Did he do this with other intentions? What should I do? Am I overreacting?",
        "num_comments": 494,
        "comments": [
            "This is very normal for professors who are trying to have sex with their students.",
            "Yeah, I’ve had profs ask if I wanted to discuss something over coffee before. Like my English prof found out I wrote poetry and offered to help me workshop it before. And I’ve met over coffee to discuss potential career interests with profs who know a lot of ppl in the industry I’m pursuing. But for a prof to ask to grab coffee without any other activity or area of interest seems odd and I’d def not take him up on that offer",
            "Yeah odd! Wants a date or to get in your pants 😂",
            "no it's fucking weird. he's not taking teenage boys out for coffee",
            "Former Prof here. Talk to some of the other women in your class and 1. See if they are experiencing anything similar. 2. Gather anonymous screenshots from them if possible. 3. Print them out and give one set anonymously to the dean of students and one set to the campus newspaper with a note that you’ve delivered copies to both.  This kind of abuse gives dedicated educators a bad name. Take him out and protect those he would take advantage of in the future. Be well.",
            "Go, record him, you now leverage if he gives you a bad grade you have proof it was retribution for rejecting him. Easy A",
            "This also happened to me during my college years. I ended up going to two „innocent“ invitations to get coffee, both professors ended up having a thing for me, one ended up kissing me. Both were married. Unfortunately this happens quite often with men in positions of power and younger women. I think he definitely is looking for someone to hook up with or date and it is wildly inappropriate. I do not think you’re overreacting.",
            "Your professor is trying to have sex with you.",
            "That's predatory based off of one thing: he did it with girls last year.\n\nKeep those texts and go to his department head and show him the texts. he needs to be fired and lose his right to teach",
            "No.  It is not normal."
        ]
    },
    "Why are younger guys these days interested in middle aged women?? ": {
        "title": "Why are younger guys these days interested in middle aged women?? ",
        "score": 1387,
        "url": "https://www.reddit.com/r/ask/comments/1dqljk0/why_are_younger_guys_these_days_interested_in/",
        "content": "I (51F)recently got on a dating app and am bombarded with messages from guys in their 20s and 30s! I know it’s just for a hookup but when I was young guys were not into older women. I’ve been out with a couple of 30 something’s but I automatically delete the 20 something’s.  That’s just way too young for me!!  What’s changed?",
        "num_comments": 498,
        "comments": [
            "I think its because u skip the bs in most cases",
            "A lot of guys that are younger than me (significantly) swipe or approach me. The common answer I’ve gotten is “older women know what they want and there’s no games.” Fair enough.",
            "50 now is not what 50 was 30 years ago. These days, there are 50 year old women out there more active and better looking than some women in their 20's",
            "It’s always been a thing",
            "Older women are more likely to be open to a sexual relationship without the same expectations and requirements of younger women. A woman in her 50s most likely isn’t trying to start a family. They probably have adult children and exes and are happy with light dating and sex.\n\nThey’re also much more comfortable in their bodies than younger women and aren’t afraid to tell a younger man what they want. It’s sexy and not something younger women do very well. I absolutely loved hooking up with older women when I was in my 20s and 30s.",
            "When you were younger, men were interested in older women you just didn't find out about it.",
            "Nothing new, you're just noticing it now because you're now at that age.",
            "I'm  49 and same!  I blame Stifler's mom in American Pie. Honestly,  I am not complaining that a 39 year old thinks I am the ideal MILF. Going to ride those waves as long as I can.",
            "Have you ever heard a 20 year old woman talk?",
            "Because middle age women are beautiful?"
        ]
    },
    "Complete nudity for massage? ": {
        "title": "Complete nudity for massage? ",
        "score": 32,
        "url": "https://www.reddit.com/r/ask/comments/1dr4kf4/complete_nudity_for_massage/",
        "content": "Is it weird for a man to get completely naked for a female massage therapist? I do this all the time, and I keep it professional, but my S/O says it's weird. I feel like it makes it easier for them to massage. ",
        "num_comments": 89,
        "comments": [
            "That's how my therapist has me do it. There's a sheet that you get under. It's normal.",
            "It's okay for him to get completely disrobed if he's draped by a sheet or large towel, in fact New York State protocols require that you completely disrobe for a full body massage and that the only part of your body that is exposed at any given time is the part that's being worked on",
            "I always leave underwear on so no one reaches anywhere beyond that fabric and socks on so no one touches my feet",
            "I’ve only done couples massages with my girlfriend but I’ve been completely nude for both men and women and so has she. So long as you keep it professional and relaxing and don’t act like a creep, it’s fine. You’re covered and they have professional techniques to keep you covered when you turn over.\n\nTo me, it’s like going to the doctor. They’re professionals that have seen and touched hundreds of bodies for the purpose of healing, it’s not a kinky situation unless it’s a very shady place.",
            "In Thai massage places (at least in my area) this is common. They specifically ask you to take a shower, dry up, get on the bed and pull a towel over you that they control the position of.",
            "It is weird when you are not used to it. But that goes for most things.",
            "Not really when I get one in the middle of the mall from the Asian dude I get naked. Everybody just looks away in disguste so I just assume they are ok with it.",
            "Your S/O is the weird one in this situation.",
            "That's what I do. The rules allow it, the therapist is fine with it, under a sheet anyway.",
            "This depends on the place you go to id assume?"
        ]
    },
    "Ladies, why do you say “ please don’t waste my time” on dating apps?": {
        "title": "Ladies, why do you say “ please don’t waste my time” on dating apps?",
        "score": 309,
        "url": "https://www.reddit.com/r/ask/comments/1dqp6ir/ladies_why_do_you_say_please_dont_waste_my_time/",
        "content": "I truly don’t get what inspired this. Dating takes time to find the right person and people play games especially on apps. So what does this accomplish? Do men actually behave differently because of this? What do you consider wasting your time?\n\nEDIT:  is it a straight women thing? Do men say this frequently as well? Do gays/ lesbians say it? ",
        "num_comments": 426,
        "comments": [
            "I suppose they mean that they want someone who’s serious and doesent just want to hook up",
            "Yeah, I always figured that goes without saying. Obviously nobody wants to waste time lol.",
            "I’m a man. When I see don’t waste my time, I automatically assume she’s angry or unpleasant to be around. I could definitely be wrong. But why waste the 140 characters she has in a bio to just put that. It’s not a good first impression.",
            "In my experience the ones saying \"don't waste my time\" are the ones who make people waste their time.",
            "Ah the universal phrase for “I have a habit of picking guys who waste my time and carry the trauma that comes with it”",
            "Lady here. IDK, I never have and I think that’s stupid. \n\nThat’s like going shopping and being mad at all the shoes I tried on and didn’t like because “they wasted my time”",
            "And then...they proceed to waste your time anyway. If u say hello, they 'bite' back, lol.\n\nSeriously speaking, there's too many people wasting each other's time anyway, playing games and all. I don't get it either, those who are serious may see this and just swipe away, those who want a challenge or pickup, just swipe into it. Doesn't really change the outcome as intended, truthfully speaking.",
            "Its a stupid thing to say for either gender . It’s passive aggressive and victimy . Not attractive",
            "What that usually means is, be up front with your intentions. Don't say that you want a relationship when you just want sex. Don't waste a woman's time by doing that.",
            "Shhhhh. Let them continue self-filtering from the match pool."
        ]
    }
}