{
    "r/AskACanadian Rules Update": {
        "title": "r/AskACanadian Rules Update",
        "score": 15,
        "url": "https://www.reddit.com/r/AskACanadian/comments/15oiauz/raskacanadian_rules_update/",
        "content": "Hi all!\n\nWe've done a bit of a clean-up on the rules to reduce the number of them and consolidate a few redundant one. Please view the new list of rules below:\n\n* **1. All submissions must be in the form of a question.**  NOTE: This does not mean the title has to be in the form of a question.\n\n* **2. Use the textbox only to add clarification or context to your question.** If you want to provide an answer to your question yourself, please do so as a comment.\n\n* **3. All questions and comments must adhere to Reddit's [content policy](https://www.redditinc.com/policies/content-policy).** \n\n* **4. Be civil.** Do not use slurs or bigoted language of any kind in a submission. Treat all users with civility and respect. Do not attack or bash subreddits or geographic locations and the people from them. No personal attack of any kind.\n\n* **5. Check the FAQ/Wiki/Google prior to submitting your question.** Please check the [FAQ](https://www.reddit.com/r/AskACanadian/wiki/faq) for links to common questions answered by the community, as well as [other subreddits](https://www.reddit.com/r/askacanadian/wiki/relatedsubs) for specific questions. FAQs will be removed at moderator discretion. Do not post questions you can Google. Please search the sub for your question before posting, particularly if it is topical.\n\n* **6. Questions must be asked in good faith and contribute to the discussion.** Do not comment with the intent to push an agenda, soapbox, sealion, or argue in bad faith. If the purpose of your post is not actually to ask a question, do not post it here. Top level comments must be on topic.\n\n\n* **7. Questions that are not on-topic for the sub will be removed at moderators discretion.** This is not an advice or support sub. Questions seeking advice or support about immigration, legal matters, medical care or medical problems, decisions related to education/career, or relationships will be removed at the moderators' discretion and should be asked in more appropriate subreddits. Do not submit AMA questions or surveys without first discussing it with the mods. Further helpful subreddits are linked in the [Wiki](https://www.reddit.com/r/askacanadian/wiki/relatedsubs).\n\n* **8. Do not comment on a thread if you came here from a comment linked in another subreddit.**\n\n* **9. Do not repost removed posts.**\n\n* **10. 'Murica Mondays.** All questions pertaining to the US are to be asked on Mondays.",
        "num_comments": 21,
        "comments": [
            "I know sometimes it is necessary, but can threads on this sub stop being locked so gratuitously without explanation and also have a flair when they do get locked?  It's a bit annoying when I click on a post wanting to respond only to find out the thread has been locked.",
            "[deleted]",
            "[deleted]",
            "[removed]",
            "Do I appreciate Canadian healthcare? You betcha. Both my cousin and I had life saving surgical procedures performed in Ontario; my cousin had a transplant and I had a scary craniotomy performed. \n\nIf my family hadn't had really good insurance, we would have been bankrupted by Johns Hopkins University hospitals exorbitant bill; following my stay in Hopkins, I was driven to London, Ontario and had my life saved.",
            "Ummm how do I ask a question?",
            "Would you rather we remove them? That is a debate that we have: if threads did generate an interesting discussion but started to receive huge numbers of rule-breaking comments, then I tend to lock them but not remove them as I think the remaining commentary is valuable. But I know that it can be frustrating, which is why I've considered removing. I'm not sure what the best course of action is. \n\nBut we can definitely do a flair!",
            "“Rule number one!”",
            "Rule 6.",
            "Canadian Healthcare left me physically disabled without the ability to sue. YMMV."
        ]
    },
    "2024 Taxes Megathread": {
        "title": "2024 Taxes Megathread",
        "score": 13,
        "url": "https://www.reddit.com/r/AskACanadian/comments/1b42ssd/2024_taxes_megathread/",
        "content": "While r/CanTax and r/PersonalFinanceCanada are the best subs to ask tax questions, we're still getting quite a few of them here. \n\nPlease use this thread to post any tax questions you might have, from now until the end of tax season. \n\nAny new posts about taxes will be removed and directed here. \n\nThanks!",
        "num_comments": 10,
        "comments": [
            "Query WRT to fedral tax  \nLiving in toronto.  \nThis is the breakdown for my biweekly cheque  \nGross Earning: 1353  \nDeductions: 226  \nInside the deductions I noticed Federal Tax is 226. Is this normal?   \nAs far as i know it should be only around 15%",
            "Did they take away the component for out of pocket medical last year? I was $5400 in out of pocket and it may no difference on my return. I'm glad I put 15 grand into my RRSP or I would have owed.",
            "I'm wondering what year it was and which government was in power when they decided to make rent here in Ontario something that was no longer reportable on your Income Taxes.  It used to be claimable and now isn't.",
            "PAY YOUR TAXES ON TIME PEOPLE!\n\nWhy?",
            "I wouldn't be concerned because you'll get all of that back anyways: the basic amount federally is $15k this year, so if you made under that amount, any and all taxes you paid will be paid back to you when you file.\n\nBut generally speaking, some employers will deduct slightly more for taxes than what is expected; when you file, you will report to the CRA that you paid $226 in federal taxes, they will see that you were supposed to only pay $202.95, so they will refund you $23.05 as tax overpayment. It allows for some calculation flexibility without the risk of the employee getting an unexpected tax credit owed. \n\nGeneral rule of thumb I've heard from a former payroll admin: as an employer, you rarely hear from your employees if they ended up getting a tax refund, but you'll be flooded with angry voicemails and emails about a tax bill due to underpayed taxes.",
            "They have to be considered eligible medical expenses, and the CRA has a whole list of what they deem eligible or not.\n\nFor expenses that are eligible, first you plug in the total costs of ELIGIBLE expenses, then you subtract from that the lesser of the following:\n\n1. 3% of your net income\n2. $2,635\n\nThe remaining amount is what you can claim for medical expenses. More info can be found [here, as well as the list of eligible expenses](https://www.canada.ca/en/revenue-agency/services/tax/individuals/topics/about-your-tax-return/tax-return/completing-a-tax-return/deductions-credits-expenses/lines-33099-33199-eligible-medical-expenses-you-claim-on-your-tax-return.html).\n\nEdit: if your expense doesn't show up for the CRA, its worth checking for provincial credits too as they might recognize it. An example is that the CRA doesn't accept gym memberships as medical expenses, but Newfoundland gives a tax credit for gym memberships.",
            "There is a new renter's tax credit this year.",
            "because you get slightly poorer, slightly slower.",
            "Just in BC, the rest of Canada doesn't have that.\n\nIt's also $400 to any individual who earns $60k or less. [More information can be found here.](https://www2.gov.bc.ca/gov/content/taxes/income-taxes/personal/credits/renters-tax-credit)"
        ]
    },
    "What's something a person has to like (or tolerate) to live in your Canadian city?": {
        "title": "What's something a person has to like (or tolerate) to live in your Canadian city?",
        "score": 106,
        "url": "https://www.reddit.com/r/AskACanadian/comments/1dqmhem/whats_something_a_person_has_to_like_or_tolerate/",
        "content": "",
        "num_comments": 615,
        "comments": [
            "Regina - locals getting excited for the opening of chain restaurants. See 4am line up for TacoBell.",
            "Little town in NWT: \n\nRemoteness. Almost 3 hours to a Tim's and McDonald's. \n\nBitter winter cold in winter sometimes for to -50. And daylight for only twilight.\n\nBlistering hot summers sometimes to 40. And the unbelievable flies, ohmygod. \n\nAnd it's dry. So freaking dry.",
            "[removed]",
            "Vancouver - rain",
            "The air pollution and fentanyl addicts, Windsor Ontario.",
            "Ottawa - A public transit system that is broken and unreliable.",
            "St John's Newfoundland is the foggiest, windiest, and often the snowiest city in Canada. Tops the charts for rain and the least amount of sunny days as well. \n\nWe also get tropical storms and hurricanes coming up the eastern seaboard. \n\nSo to live here, you have to like shitty weather, a lot of wet/ heavy snow, and periodic severe storms (especially snow storms where we get 50+ cm and winds of 100-120)",
            "Winnipeg-snow and -40 windchill",
            "Orange construction cones - Montreal",
            "Beyond freezing winters, limited access to quality produce, and very immature politics. (Alberta)"
        ]
    },
    "How do you guys celebrate Canada Day? ": {
        "title": "How do you guys celebrate Canada Day? ",
        "score": 63,
        "url": "https://www.reddit.com/r/AskACanadian/comments/1dqny4i/how_do_you_guys_celebrate_canada_day/",
        "content": "Figured I'd ask since I know it's this coming Monday. I'm an American and our Independence Day is July 4th, three days later. \n\nFor our big day we have parades, festivals, pool parties, beach trips, cookouts, and, of course, fireworks. Fireworks are the big symbol of the holiday. It's your typical summertime fun with a coating of our patriotic colors of red white and blue.\n\n I'm curious as to how our national days are similar.",
        "num_comments": 322,
        "comments": [
            "I help friends move in to their new apartment.",
            "we do the same shit just more quietly lol.",
            "A backyard fire and some beer",
            "Not much. Enjoy my extra day off.",
            "We get drunk",
            "rest day, and BBQ if is nice",
            "Our village does it up in style - community parade, festival, duck race in the river, BBQ and fireworks at night. There are flags on every light post and a contest for the best decorated home. It's been going on for 40 years.",
            "A day off work, spent with family.  Picnics/barbeques, public concerts and performances (including indigenous artists). Red  and white cookies and cupcakes.  \n\n Many museums, national / provincial parks and other sites are free for the day.\n\nPublic fireworks displays, after dark.",
            "It's very similar, a national stat holiday where many folks have the day off and a large swath of the population pack up and head for a getaway. There's usually a fireworks display in all the larger cities but it's not a big blow out like the US. \n\nPersonally, I just treat it like a day off.",
            "I'm not moving this year so just enjoying a nice day off."
        ]
    },
    "Driving to Yellowknife from Vancouver or Edmonton ": {
        "title": "Driving to Yellowknife from Vancouver or Edmonton ",
        "score": 21,
        "url": "https://www.reddit.com/r/AskACanadian/comments/1dqq8ui/driving_to_yellowknife_from_vancouver_or_edmonton/",
        "content": "Is this a super dangerous drive to make? One day I want to go up to Yellowknife to see the aurora and I think it would be fun to drive there from Vancouver or Edmonton ",
        "num_comments": 38,
        "comments": [
            "Your biggest concern is distance between pit stops once you get into northern BC, make sure you have your route and stops planned",
            "No more than any Northern road. Make sure you have a good reliable vehicle, plenty of snacks, and plan your pit stops. That's my big lesson driving up there - never assume the next gas station will be open, and plan accordingly. Top up when you get a chance. \n\nIf you're driving in the summer, bring bug spray by the gallon. If you're driving in the winter, bring cold weather gear.\n\nHelps to make sure that you can change a tire and have a full size spare. It's a long slow drive if you lose a tire and drive on a donut.\n\nIt's a gorgeous drive. I always say that every Canadian should hit the territories at least once.",
            "I have done the drive from Calgary to Hay River, NT numerous times in the last 4 years. \n\nThe biggest thing you’ll have to plan for is knowing when and where to stop for gas and snowstorms. \n\nFrom Edmonton onwards, you have to stop in Slave Lake, Red Earth Creek, High Level, Indian Cabins and/or Enterprise (if they have the gas station open) and Fort Providence. There is no cell service on the road from Enterprise onwards; it’s spotty, at best. It’s doable in a day, but it’s a long ass day. Your best bet would to split it and drive to High Level one day and then onward to Yellowknife.  If you have a heavy foot, the chances of running into a cop/RCMP on these highways is very small. But they are generally around the city/town areas, in my experience. \n\nAs for snowstorms, that shit is just unpredictable. I got stuck driving in one in winter 2020/21 and it was awful. Don’t recommend. I ended up in the ditch just outside of High Level and ended up stopping for the night as a result. Otherwise, highways are generally clear on AB side. It may not be as clear once you get north of 60. Especially so if it’s just snowed and the trucks haven’t been out on the road. Having said this though, traffic is usually pretty minimal and you can drive in the middle if the sides of the roads are pulling you into the ditch. If you are doing this drive in late fall, look out for buffalo on the highway to Yellowknife.",
            "Not dangerous at all. The roads are just fine all the way through. I’ve made the drive many times.\n\nIf you do the drive in the winter, you just have to take your time and be alert as you would anywhere else.",
            "If you are going then you will be doing it in the winter and the roads may not be the best.",
            "Don't plan on a drive in the summer to see the aurora north of the 60th parallel.  Autumn, maybe, but be prepared for poor driving conditions in the mountains of BC and in the north.  Just go prepared.",
            "That’s a long fucking drive from Van. It’s a long ass drive from Edmonton. Be prepared",
            "map it on google maps. people drive to Yellowknife everyday.  Prepare yourself for the trip and make sure you have a reliable vehicle, spare tire, supplies in case you have a breakdown on the way, and a cell phone with a way to charge it other than your car.",
            "It's not dangerous. But it's a long drive. Just plan ahead. Be sure to top up for gas in High Level, AB, no matter what. And winter tires  is a must.\n\nI do not recommend the route towards the Liard Trail.",
            "Also we’ve had a lot of wildfires. Last year all of Yellowknife was evacuated due to threat of fire. Visibility on some stretches of highway was almost nil.\n\nCheck  https://firesmoke.ca/forecasts/current/ in the days before heading out."
        ]
    }
}