{
    "Moving to Australia? Ask your questions here in this weekly megathread": {
        "title": "Moving to Australia? Ask your questions here in this weekly megathread",
        "score": 7,
        "url": "https://www.reddit.com/r/AskAnAustralian/comments/1dq0l8i/moving_to_australia_ask_your_questions_here_in/",
        "content": "We regularly get posts about moving to Australia and rather than clutter up the sub with repeat questions we’re providing this weekly megathread.\n\n**Ask our community any questions you like here in the megathread.**\n\nAside from our sub the best place to start is the ‘Moving to Australia’ page of the Australian Border Force\n\nAlso worth checking out the r/AusVisa subreddit.\n\n# External sources of information\n\n## [Australian Border Force - Moving to Australia](https://www.abf.gov.au/entering-and-leaving-australia/moving-to-australia)\n\nThis covers:\n\n* Studying in Australia\n* Working in Australia\n* Bringing your family or partner\n\n# Subreddit sources of information\n\nWe also suggest search the subreddit for 'Moving' and similar terms.\n\nHere’s some posts that contain useful information and some detailed responses.\n\n* [American moving to Australia - Need to know the boring stuff](https://www.reddit.com/r/AskAnAustralian/comments/131k3dv/american_moving_to_australia_need_to_know_the/)\n* [Questions from an American moving to Australia!](https://www.reddit.com/r/AskAnAustralian/comments/16lb6xk/questions_from_an_american_moving_to_australia/)\n* [Thinking of moving to Australia, job question](https://www.reddit.com/r/AskAnAustralian/comments/15j51p4/thinking_of_moving_to_australia_job_question/)\n* [Moving at 19](https://www.reddit.com/r/AskAnAustralian/comments/zjs36p/moving_at_19/)\n* [Where, oh where, do we move to in Australia?](https://www.reddit.com/r/AskAnAustralian/comments/16gai7f/where_oh_where_do_we_move_to_in_australia/)",
        "num_comments": 10,
        "comments": [
            "No specific questions but I’m moving to Sydney in September (decent job lined up) and I’ve read a load of articles, watched videos but wondered if anyone had any other general advice? Specifically maybe about office culture etc compared to the UK.",
            "Where should I go in Australia right now to work July-October?\n\nI started my WHV in 2023, and I traveled the east coast then worked in North QLD in hospitality for a few months. I popped over to Asia, but now I’m coming back to find work. I mostly finished my regional work/88 days (farm work or hospitality in remote areas), but I want to do at least a month more to make sure and save up some money. I love living near the beach or any body of water but would be open to anywhere. Thanks for any suggestions!!",
            "Does every citizen have to full knowledge of immigration procedures? Or can we just leave it up to a few randoms on Reddit to answer the questions?",
            "Depends what industry you're in, finance are fuckwits the world over. But its likely like most places, plenty of sicophants everywhere you go.",
            "If you can, get a bank account and send in your Medicare enrolment form before you arrive. We found Medicare enrolment such a long process and it made some things like my son's preschool applications difficult because we needed things like BSB and bank Account number  (for fees) and Medicare number (for proof of his immunization). As well as registering with a GP etc. The main bank branches here are Com Bank and HSBC, both of which I think you can open a global account from your home country. You might even be able to walk in to a HSBC branch in the UK and ask for advice. The only things we needed was ID and a postal address which we gave my sister in laws because we spent the first 2 months in Air B&Bs.\nRegister for your Tax File Number as soon as you arrive (this process was actually incredibly quick and easy).\n\nI think they've recently updated the legislation that says overseas drivers need to convert to an Australian license within six months of arriving or face a fine. This again was very quick and easy and if you're coming from a country with similar driving rules (we came from the UK too) it's a straight transfer. It took less than half an hour at a Service NSW center.\n\nI've been working for just over a month now (we arrived in Jan and I took some time off to get settled/look for a new job) and there doesn't seem to be so much of an after-work pub culture, especially not in my workplace. People tend to occasionally go for lunch together but not drinks so much. People want to get home to their families.",
            "What exactly do you mean?",
            "Thankfully not finance, a small events firm (same area I’ve been working in for a while). \n\nIt’s more general stuff like do people bring lunch from home or eat out? Do people hangout after work or is there a big separation between work/home?",
            "This is super useful - thank you!\n\nWas already aware of bank situation; was going to use comm bank which should be fine. \n\nAppreciate other advice, wasn’t aware of driving licence rule so good to know. \n\nThanks so much; excited to arrive!",
            "All of those questions are, it depends. Yes and no, sometimes, but not always. Events people, hospo etc i think generally hang out.",
            "We had no idea about the driving licence rule either. My brother in law let us know as he works for Service NSW. Only place I’ve even seen a notice so far was in the Service NSW waiting room or online where you’d have to go looking."
        ]
    },
    "Where did all the 'good' workers go?": {
        "title": "Where did all the 'good' workers go?",
        "score": 54,
        "url": "https://www.reddit.com/r/AskAnAustralian/comments/1dr1895/where_did_all_the_good_workers_go/",
        "content": "I feel like everyone is short of workers, and I don't get it? Where have all the people gone when our population seems to be increasing? \nLike what industry are they in?",
        "num_comments": 300,
        "comments": [
            "The current system wants good workers that are happy with less pay, while we deal with the rising cost of living.\nThey don't want to invest in training, they want mindless smiling zombies who are happy to be paid in peanuts and take crap from the ever increasingly abusive public",
            "People want good workers without investing in training for those workers. So they churn and burn instead.",
            "They quit to do something with a hope of a living (not just surviving) wage.\n\nI was a good colourist.\n\nI was a good video engineer.\n\nI was a good driver.\n\nNow I'm a good coder.\n\nI'd gladly do anything good if I can keep my family fed and happy.",
            "Companies killed loyalty and work ethic - there is no reward for good work and companies refuse to train staff.\n\nThe corporate ladder is dead and to get a payrise or move up you have to move companies.\n\nManagers tell workers we are replaceable, companies lay us off every day and they expect 10-12 hour days with no thanks.\n\nI now 8 hours and log off/go home and I move every 1-2 years as most managers have no idea how to develop staff and think we should be grateful to have a job.\n\nIt's also not enough to do your job these days - now you have to go above/beyond-  my last manager told me to show more initiative whilst also not allowing me to - so I did and got a new job.\n\nI used to be a good worker - do overtime, go above/beyond, be a team player, say yes to everything, not ask for payrises - it got me overworked and being treated as a door mat.\n\nNo matter how hard I work - if we all get 3% (being generous) what's the point?\n\nI'll do enough to not get fired, learn what I can and then move on.\n\nI've also seen far too many good/hard workers get passed over for those who self  promote - they think competence = loudest person in the room/the person with most confidence",
            "The good ones went elsewhere after being given one too many Dominos pizza party “thank you for making us so much profit”, instead of a massive. payrise. \n\nThey had to listen to the boasting as everyone  else in the company who has bonuses measured against KPIs which, funnily enough, were only met because of the effort of the Pizza recipients.\n\nAnd, they got sick of watching  newbs obviously not suited to the job, get paid to do fuck all from day dot, which resulted in even more  re-work for the ‘Good workers”.",
            "For us NSW nurses, a lot of us are moving to different states. Some of my friends moved to Qld. Some moved to Western Australia. Better pay, cheaper lifestyle.",
            "Everyone wants 3 years of experience in the industry for a starting position or a 4 year degree for a job were they will still need to train you on the job.",
            "1. Every company requires you have experience in a job. Even when I was freshly entering the job market 10 years ago, there was a lot more “no experience needed” jobs. Nowadays they want you to have 27 years of experience, 7 uni degrees and your first born. Oh, and they’re still paying the same as the no experience needed positions. lol.\n\n2. Lots of people have had to bail on, or defer, from courses and university to work more. Cost of living is FARKED. \n\n3. Similar to above; they’re just not paying people enough. No one can afford anything. There’s people bailing on jobs they studied years and years for to go and do uber because they’re better off (which is not saying much of uber, trust me)",
            "I've worked hard, without any substantial supervision or support for a few years now, and always got the job done. \n \nThis week I got called into a meeting and was handed a document listing my careless mistakes. I can find one issue where I made a typo, the rest is a list of things I had no involvement with, or aren't real issues. My boss is evidently in end of year ass covering mode. \n \nI'm a good worker who will be informing my place of work am going elsewhere next week. They can join the mob asking \"where did all the good workers go?\"\n \nThe answer? Away from all the shit employers.",
            "the growth of service sectors like ndis, health, aged care, child care are taking up a large share of workers. Then there are also more people making money in alternative ways now - like self employed, gig economy, investments, property, side hustles, air bnb etc that takes up a lot of people that used to do regular jobs.  Then when you look at the job ads so many seem like jobs that are generated to make money from semi legitimate schemes etc.  "
        ]
    },
    "When getting sick, are you still testing yourself for Covid?": {
        "title": "When getting sick, are you still testing yourself for Covid?",
        "score": 53,
        "url": "https://www.reddit.com/r/AskAnAustralian/comments/1dqw6hk/when_getting_sick_are_you_still_testing_yourself/",
        "content": "",
        "num_comments": 215,
        "comments": [
            "When I have symptoms which might be covid, yes I do. It's good to be able to say \"I have covid\" vs \"I feel like shit\".\n\nI will also still quarantine if I get it because I don't want to spread it. Simple as that. If I do have to leave the house, I'll wear a mask.\n\nBut I would do the same for any illness. If I think I'm contagious, I will do what I can not to spread it.",
            "My mum is currently undergoing chemotherapy for recently diagnosed cancer, so yes.\n\nIf she didn't have cancer, we would've likely only tested if our symptoms felt particularly bad tbh....",
            "I work with people who are very old and very young, so I test every time I get symptoms.",
            "Yes, if it’s Covid I can just take a week off with only a photo of a test. If I’m just sick I’ll need a doctors note after a day or two\n\nTo answer the question people will have yes I absolutely have just sent in a photo of an old test or someone else’s and had a week off work before",
            "Yeah we used up all the kits that were recently expired. That said it doesn't matter if it's covid, rino, flu, or RSV. The end result is the same. Stay home if your sick and try not to spread it to your friends, love ones, or the community. ",
            "I need to know if it's covid or just a cold for work.",
            "I do if I've been sick for a few days and quarantine (regardless of results). The flu is just as nasty (was a much worse exp for me than COVID, though COVID was more drawn out)",
            "Yeah, I regularly hang out with folks who worked in aged care and medical settings who need to know if they're close contacts.",
            "Yes. I have an elderly relative with COPD. If I have the slightest of symptoms I test to make sure that I'm not the one who kills her.",
            "I do. I have a kid in daycare so he brings everything home but I also don't want to send covid in to a bunch of babies"
        ]
    },
    "What do you do during the weekend?": {
        "title": "What do you do during the weekend?",
        "score": 28,
        "url": "https://www.reddit.com/r/AskAnAustralian/comments/1dqyqi0/what_do_you_do_during_the_weekend/",
        "content": "For me, I'll stay up late on Friday watching Netflix. I used to go out to the movies but nowadays there are no good movies.\n\nI'll wake up around 9.30 or 10 on a Saturday. Watch a bit of YouTube, maybe go out for a 20-30 minute walk. Shopping in the afternoon. \n\nRest of the time will be spent playing video games, playing light sports (eg tennis), working out/exercise or doing housework.\n\nPretty boring, I know. Monday rolls a round and it's the usual 9-5.. (sort of). Work multiple jobs.",
        "num_comments": 63,
        "comments": [
            "I like making shit while I drink piss and smoke billies.",
            "My partner and I wake up at about 6 and take turns to either go to the gym or for a run. We used to do this together, but now we’ve got a small baby, so we alternate. \n\nThen we have a coffee and breakfast together. \n\nA typical day might be spent having lunch in the park if the day is nice, or walking through a gallery if not.\n\nThen we take a bit of alone time if needed. I’ll usually catch up with a friend over a few glasses of wine or I’ll sit and read alone at a cafe for a couple of hours.\n\nIf we’re home together at night, which we usually are these days, we put bub to bed and watch a movie, make love, fall asleep on the couch, or a combination of all. Sometimes I’ll also use this time to meal prep for the week.\n\nWash and rinse. \n\nAnd yeah, there’s chores in there somewhere unfortunately.\n\nThings used to be MUCH wilder.",
            "Chores, chores, chores",
            "Surf if there’s waves if there’s no waves fishing or diving/spear fishing ",
            "Generally, a minimum of 1200kms to see daughter",
            "Saturday: My son's sporting commitments, grocery shopping, roast or slow cooker dinner, tidy a bit, drink coffee, watch Netflix, scroll mindlessly on my phone.\n\nSunday: laundry, dishes, laundry, grocery shopping to get the stuff that was left off the list, laundry, cook up for lunches, fold laundry, more coffee, more Netflix. Sometimes we visit friends, or I mow the lawn.\n\nWe changed it up today and did Parkrun. My knees think I have a vendetta against them. I feel it is the other way around.",
            "On Friday night I have an existential crisis about how much I hate my job and the mental stress is ruining my life. I pace around and then order a takeaway because “I deserve it.”     \nSaturday I will sleep late as long as I can, wake up exhausted, and tell myself I’ll get a remedial massage for my pain *next* weekend because I’m just too tired. Even though I know it will result in more crippling pain for the next 7 days. Followed by guilt, watching movies or a show, trying to stay up as late as possible to maximise the time off work.    \nSunday, wake up in a panic, it’s the last day before back to hell. Sleep as late as possible. Attempt to do some chores/cleanup. Anything I don’t want to do can be deferred with the excuse that “it’s Sunday.” Followed by existential panic into the night knowing the morning is coming and back to hell. I’ve been watching movies and shows all weekends but I don’t even remember their names, it’s all a blur.    \nI think that sums it up.",
            "There are no good films on Netflix or Prime either, either old ones or those with extremely low ratings on IMDb. The selection is so disappointing that I have even resorted to watching traditional TV channels to find something worth watching.",
            "Organise my weekend around when my footy team is playing. Figure the rest out after that",
            "Pretty much the same 38f, I work on an office of 21 yr olds and while there weekend sounds \"fun\" it also sounds exhausting lol"
        ]
    },
    "What stops you from going to therapy?": {
        "title": "What stops you from going to therapy?",
        "score": 7,
        "url": "https://www.reddit.com/r/AskAnAustralian/comments/1dr5qfm/what_stops_you_from_going_to_therapy/",
        "content": "If you feel like you would benefit from therapy, but currently don't go, what stops you?\n\nI know cost is a significant factor for many people, so if this is your reason, I would like to hear what sort of price scale would be in your budget (and yes, I agree it should be fully rebated, but seeing as it isn't, what would make it available for you?)\n\nBut I'm also interested in other reasons. Perhaps emotional ones, logistical issues like hard time getting appointments etc.\n\nSo many people need therapy, many say they want to go but then don't. Why?",
        "num_comments": 40,
        "comments": [
            "Cost, time and the fear of having to pour my heart out to a complete stranger.\n\nTBH, at times, the idea of being \"better\" is sort of scary to me as well. I don't know who I'd be without my anxiety.",
            "Money. What would make it affordable? 0. Yes, zero dollars. I can’t afford a single cent. Finally on NDIS due to a few things and got funding for it that way",
            "Most haven’t been helpful I’ve found.",
            "Stigma around admitting one needs help and receiving help is a large barrier in access to mental health support. People fear what others may think of them or they might view themselves in a negative light if they reach out to therapy based on societal stigma that they perceive",
            "Cost, time, and fear of opening a can of worms.",
            "As you mentioned, cost is the big one! The other is time especially if it’s face-to-face appointment as that requires travel, parking et cetera\n\nGoing to therapy is very useful for people so it would be great if it was more accessible and rebated at a higher level without the need for a care plan",
            "Hate taking about stuff",
            "I've been in the past, but it's just way too expensive to keep going",
            "Cost was the main one (I finally started 2 years ago, when we finally had 2 full time incomes coming in) but also finding a person. Luckily my friend knew someone and we had a quick call together to see if we were a good fit. I don’t know what I would have done otherwise, probably sent a bunch of emails and hoped for the best.  Theb I went to the GP and did the mental health care plan. Which is its own pain in the arse, because you need to redo it quite often and it’s a long appointment at the GP (again, $$) plus any meds you’re on. My other thing is the logistics of fitting in the appointments around work and parenting, and also 10 appointments across a year isn’t a lot necessarily, especially if you’re in some kind of life crisis.",
            "Cost and availability of qualified therapists. \n\nCost needs to be means tested or at least free for unemployed and low income people.\n\nAvailability is a huge factor for those who live away from cities. Even large major towns aren’t serviced particularly well, let alone smaller, more rural areas. Heck, they can’t get medical staff for the hospitals."
        ]
    }
}