{
    "What do Germans think of Bundesrat's approval of cannabis law ? ": {
        "title": "What do Germans think of Bundesrat's approval of cannabis law ? ",
        "score": 113,
        "url": "https://www.reddit.com/r/AskAGerman/comments/1bljehk/what_do_germans_think_of_bundesrats_approval_of/",
        "content": "So weed's now legal right? ",
        "num_comments": 488,
        "comments": [
            "OP I will sticky this post to save us during the next days from daily posts asking the same question and also because in the top threads there are some good explanations on what the clubs are actually going to do and what not.",
            "Mostly, they don’t care, afaik. \nWeed is kinda legal now, but not for sale. You can own some, grow some, or join a weed club to gain a right to get weed from a club.",
            "Asking this question on Reddit is kind of cute.",
            "Couldn't care less as it has no consequences on my life.",
            "De-criminalization was long overdue. Although I enjoyed smoking weed time ago, it doesn't really fit my schedule nor lifestyle.\nLater on, when I can get my hands on some, I'll definitely enjoy not having to look over my shoulder not to alert anyone.",
            "I mostly enjoy the drama it causes among the conservatives but other than that I don't really care. Tried it a few times, wasn't for me so for myself there won't probably be much change. On the other hand it makes me happy for those who want to consume or grow because I really don't see a valid reason for banning it.\n\nSo overall I think it's a positive development, although we have much bigger issues to take care of.",
            "I can finally smoke without fearing for losing my career or driver's license. It's good to not be a criminal for choosing THC over alcohol.",
            "A) it was overdue, they should have legalized it long ago, finally they gained some sense \n\nB) it was done a typical german way which means the regulations are complicated and annoying and comical. Why can’t we never do anything the simple way?",
            "People seem to forget that weed is a very potent medicin. I dont give a dim if people are smokin a joint or two. You cant die from using it. But we have 50 k people drinkin their asses to death. In Germany alcohol is and was glorified without end. I remember being drivin by schoolbuses with Oldesloer Korn (booze) commercials on it. A lot of sick people depend on cannabis as a medicin. It starts with sleeping problems and back ache and goes as far as cancer care.",
            "I didn't expect a huge party bc those who smoke weed already do it. It's like the pineapple on a pizza: If you don't like it then don't eat it but don't ruin other people enjoyment.  \nThe Prohibition has failed miserably and just gave rise to a black market. By enabling people to supply themselves you are ruining sellers bc they are losing dedicated customers who are their main income source. It won't disappear completely but will take a massive hit.  \nI smoke some here and there but don't mind people doing it. Painting them as criminals is a very conservative take on society and it does not surprise me that the Bavarian government is so hardcore fighting this."
        ]
    },
    "Germans who have been to cities that were once German, but not anymore, what was your impression of them?": {
        "title": "Germans who have been to cities that were once German, but not anymore, what was your impression of them?",
        "score": 19,
        "url": "https://www.reddit.com/r/AskAGerman/comments/1dr4sik/germans_who_have_been_to_cities_that_were_once/",
        "content": "Examples include both certainly not limited to: Danzig, Breslau, Memel, Reichenberg, Brunn, and Konigsberg. These have been renamed and are known as Gdansk, Wroclaw (both Poland), Klaipeda (Lithuania), Liberec, Brno (both Czechia), and Kaliningrad (Russia).\n\nThese are just several examples off the top of my head and I know there's many more.\n\nIf you had been to any of these cities, how much German influence did you find to still be there, how much of the history had been preserved, did you feel any sort of connection to them despite no longer being German, and overall did you enjoy being in those cities as they exist today?",
        "num_comments": 45,
        "comments": [
            "Vienna seems to have turned out nice and they even try to speak German.",
            "Straßburg, Weißenburg etc, Look exactly like German cities but with French street signs.",
            "Honestly, if you asked someone from Marseilles, they'd probably say Strasbourg looks suspiciously German and someone from Hamburg would rate Saarbrücken as almost French. Dresden looks more like Prague than like Cologne and München is the annoying little sister that tries on Vienna's clothes but just can't quite pull them off as well. The architectural zeitgeist and culture in central Europe was always a bit fluent so I couldn't really tell you if Ljubljana or Bratislava look \"German\" just because they were part of one of the German Empires, or whether it just looks, well, central European with some recognisably Habsburgish buildings.",
            "I've been to Prague, wich was a german city surrounded by czech villages up until the 19th century. In the old town you can clearly see the austrian influences still. I even saw an old pharmacy that was restored with golden german lettering. And since the czechs are culturally close to us the supermarkets and restaurants really reminded me of traditional german restaurants and shops. Good beer and an emphasis on potatoes and meat in the meals. Needless to say I enjoyed it.",
            "It depends on what the conquerors have made of the city. Brünn for example is beautiful and appears to honor its heritage - apart from the murderous episodes at the end of WWII. The same is true for some cities in nowadays Poland - but Königsberg and Eastern Prussia are just gone and eradicated.",
            "Straßburg looks pretty German from an architectural perspective, but people mostly speak French there. Yes, there is still lots of German influence of course and especially in the smaller villages near the city you can still find native German speakers. It felt good being there since Straßburg is a beautiful city with a great food culture. It's a French city now and I am okay with it.",
            "What would a typical polish or Czech city look like to you? Is Dresden German or does it look French because of the baroque influence? Freiburg and Lübeck look nothing alike. You could argue that Strasbourg looks German. But you could make the same argument that Nordhorn looks Dutch. You can argue that Krakow looks German. But Krakow and Strasbourg don’t really look alike. What about Basel? Or Tours? Or Copenhagen? If you would want to, you could go all over the place and make the same argument. Does Frankfurt look German to you? It’s just a load of chauvinist bullshit, because in essence it just means that people are walking around and saying „This used to belong to us.“ Not cool.",
            "I'm from Berlin, and I studied and worked in Breslau/Wrocław for 3 years. \nIt's a tough question. \nNot many people I met in Wrocław think about the German past anymore. People are aware of the city's history, but it doesn't have much influence on their daily lives. Many Wrocławians have a family history of forced relocation from former Polish territory that is Ukraine today, so that is part of their history, too. \nIn the past, an effort has been made to make the city Polish. There are only a few places where one can still see signs of the fact that the city was once German. For example, there are still German letters and words in some old churches.\nI was never a victim of anti-German sentiments. Quite the opposite. Polish people were happy to see a German learn their language and study and work in their city. \nI never really thought about Wrocław as a German city, even though I was really interested in the history of the city. \nSome Germans stayed in Wrocław after the Second World War. They are a minority now. They still have their own services at Church. \nI asked some Wrocławians if it is ok for Germans to call the city Breslau. Nobody ever had a problem with it. Wrocław is really hard to pronounce for non-Poles :D",
            "Lithuanian here but living in Germany. Klaipeda has few buildings that look completely German. There is also some building with plates saying “hitler was here on…”. Other smaller cities on the side have some streets in German names or some of the houses (school for example) have Lithuanian and German name.",
            "Wrocław and Gdańsk were not renamed, they were known as such in Polish since medieval times.\n\nOn the topic of the thread- my wife who is German says that if we ever move to Poland she’d like to live in Wrocław, which runs me the wrong way since I’m from Cracow (which is obviously a lot better duh)."
        ]
    },
    "Is it common for signs to get stolen in Germany?": {
        "title": "Is it common for signs to get stolen in Germany?",
        "score": 76,
        "url": "https://www.reddit.com/r/AskAGerman/comments/1dqn6h2/is_it_common_for_signs_to_get_stolen_in_germany/",
        "content": "I’ve often seen street sign decorations in student WGs. At least I thought they were decorations until a friend claimed that it’s common for people to steal real signs from streets, construction sites and footpaths. Is this true?",
        "num_comments": 64,
        "comments": [
            "Told this before, but when I was 14-15 we stole one of this blinking construction lights and got caught by police.\n\nNaturally we run away, around the next corner and jumped into a huge bush for hiding.\n\nThe cop car stopped right in front of us and used their loudspeaker:\n\n**Are you fucking kidding us? Come out of the bush.**\n\nWe were perfectly hidden and there was no way they could see us, so we thought they were just bluffing.\n\nAfter a while we still got out, because they wouldn‘t budge. When I walked to the police car, I turned around and saw that the whole bush rhythmically blinked orange. :(",
            "When I got my license, my Mom (who was district-mayor at the time) gifted me the [Gefahrenzeichen 114 Schleudergefahr](https://www.fuehrerscheine.de/verkehrsrecht/verkehrszeichen/114-schleudergefahr-verkehrszeichen/). Up to this day I don't know where she got it from, or what she wanted to tell me",
            "Stealing signs when you're drunk is a cultural thing around here.",
            "[deleted]",
            "In many cases place signs got stolen due to a place's  name being funny.",
            "it's common in many countries.\n\npersonally back in my young days, I knew some teens who did this - they were influenced by american movies where it can be often seen that they have signs in their rooms.",
            "I might have stolen a bunch. Maybe some construction site lights as well. Maybe one time we carried a construction site fence through half of the city. Maybe.\n\n  \nEdit: We had the construction site light in our fridge for at least a month before the battery died.",
            "Growing up in rural Germany: Very common.",
            "Personal experience (rural NRW): The constructions site signs are seemingly meant to be stolen. Or the dutch construction companies doing a lot of there work there, wouldn't leave them behind after finishing up. No, I'm not exaggerating... I have seen constructions site signs remaining on the spot or just moved to the side literally years after everything was finished until someone finally picked them up as decoration.",
            "I mean. I got a Naturschutzgebiet Schild and a Baustellen Schild here. I found them in the Woods and a River.\n\nMy friends used to steal many signs when they got drunk"
        ]
    },
    "What is a song that all, or most, Germans appreciate?": {
        "title": "What is a song that all, or most, Germans appreciate?",
        "score": 26,
        "url": "https://www.reddit.com/r/AskAGerman/comments/1dqolb8/what_is_a_song_that_all_or_most_germans_appreciate/",
        "content": "Bonus points if it’s also well received by semi-established immigrants/expats/people not born in Germany but live here, whatever label you prefer.\n\nBackground: I have this dream, that I’ll bring a powerful portable speaker setup, and play this song for 1 minute when young people in the train listen to loud music with obscene language, or have TikTok on speaker for a full 1 hr train ride. My hope is all other passengers can recognize the reason for my normally unacceptable blasting of music, that the kids will stop, and that everyone after this whole ordeal can enjoy a quiet ride to/from work.\n\nEdit: of course I’m not actually gonna do this, for one I don’t have a powerful portable speaker setup and second I am too afraid of conflict. But I might use your contributions to make a playlist :)",
        "num_comments": 324,
        "comments": [
            "Just tell them: \"Macht eure Drecksmukke aus, habt ihr keine Eltern wo euch wat erzogen haben oder wat?\"",
            "Please don't do that. I know the saying goes fighting fire with fire, but you don't keep people from being a dick in public by being a bigger dick in public. Don't turn missbehaving individuals into a battle of volume. That would be the most obnoxious thing you could do and won't bring you much sympathy.",
            "This won't work.",
            "Peter Schilling - Major Tom",
            "Und diese Biene die ich meine die heißt Maja…",
            "In München steht ein Hofbräuhaus aber Freudenhäuser müssen raus...",
            "Sesamstraße Opening!  \nDer, die, das  \nwer, wie, was  \nwieso, weshalb, warum  \nwer nicht fragt bleibt dumm",
            "Schrei nach Liebe 💘",
            "An der Umgehungsstraße\nKurz vor den Mauern unserer Stadt\nSteht eine Nervenklinik\nWie sie noch keiner gesehen hat\n\nSie hat das Fassungsvermögen\nSämtlicher Einkaufszentren der Stadt\nGehn dir die Nerven durch\nWirst du noch verrückter gemacht\n\nHey, hey, hey ich war der Goldene Reiter\nHey, hey, hey ich bin ein Kind dieser Stadt\nHey, hey, hey ich war so hoch auf der Leiter\nDoch dann fiel ich ab, ja dann fiel ich ab",
            "Griechischer Wein"
        ]
    },
    "How to say 'ouch!' in German?": {
        "title": "How to say 'ouch!' in German?",
        "score": 3,
        "url": "https://www.reddit.com/r/AskAGerman/comments/1dr59pd/how_to_say_ouch_in_german/",
        "content": "How do you guys react (exclamation like ouch or words like damn, etc.) when something suddenly hurts you or cause pain like a bee sting or touching sth too hot?",
        "num_comments": 51,
        "comments": [
            "Autsch",
            "Aua!\n\nAu!",
            "If something hurts a little you can say Aua! / Au!\n\nIf something hurts repeatedly you can say Auauauauauauauauau!\n\nI find it neat that you can extend the word based on your pain :D",
            "In Bavaria, a good old “kreizkruzefix” does the job",
            "\"Mich dünkt mein inneres Wohlbefinden wurde soeben durch einen äusseren Faktor negativ beeinflusst.\"",
            "If you are a dad, you breathe in through your teeth \"ffffffff\", then you let out a tortured \"hah\"",
            "Fuck, Ficken, Scheiße, verdammte Kacke... \n\nWenn Kind dabei, Aua.",
            "I always say \"Ah, fuck, verdammte Scheiße!\"",
            "Ouch == Autsch (legit the same thing, only change the spelling)",
            "O weh!"
        ]
    }
}