{
    "Fellow Americans, if you could, what would you add to the Constitution?": {
        "title": "Fellow Americans, if you could, what would you add to the Constitution?",
        "score": 124,
        "url": "https://www.reddit.com/r/AskAnAmerican/comments/1dqtfox/fellow_americans_if_you_could_what_would_you_add/",
        "content": "I feel like the US Constitution is missing some things, but I can't really figure out what.\n\nSo if you could, what would you add or amend to the Constitution?",
        "num_comments": 674,
        "comments": [
            "Honestly I wish there was an amendment explicitly codifying the right to privacy. My state constitution has it, it’s pretty nice.",
            "Redditors and Twitter users aren't allowed to propose amendments",
            "Pictures. That way, more people will read it.",
            "No elected official may, during their tenure, exchange securities or make investments except by an executor of a blind trust. The total compensation of any elected official may not exceed the median income of their represented district for the duration of their tenure and for a length of time equal to their tenure after their service has ended.",
            "“Taco Tuesday shall not be infringed.”\n\nLet the lawyers fill in the gaps. ",
            "The Beastie Boy Amendment - Securing the right to party.",
            "That elections shall be publicly funded and free from the influence and interference of monied interests",
            "We really should consider a right to privacy in the constitution. A ton of the issues in modern politics are caused by a lack of privacy regulation, so just stamping it onto the constitution might be a good move.",
            "I’d add publicly funded elections and have a strict (and pretty low) cap on how much any individual or organization could donate to PACs or Super PACs in a single fiscal year. That would need to be flushed out to eliminate loopholes, but that’s the basic idea.",
            "Some additions to the fourth amendment expanding privacy protections into the electronic and technological space. Governance surveillance at our current scope needs specific attention."
        ]
    },
    "Where can I see an F-22 Raptor in the USA?": {
        "title": "Where can I see an F-22 Raptor in the USA?",
        "score": 36,
        "url": "https://www.reddit.com/r/AskAnAmerican/comments/1dr0co0/where_can_i_see_an_f22_raptor_in_the_usa/",
        "content": "Hi everyone,\n\nI will be visiting the USA for the first time in July and September, and I'm a huge aviation enthusiast. I love modern aircraft and I'm particularly interested in seeing an F-22 Raptor up close. Are there any air shows or public events during these months where I might have the chance to see one?\n\nAdditionally, I would appreciate any recommendations for museums that focus on aviation history and modern aircraft.\n\nI've heard about public military bases, but I'm not sure if this information is accurate. I would like to find out the truth about this. Also, is there any chance to see an aircraft carrier during my visit?",
        "num_comments": 99,
        "comments": [
            "You can see one in your country if you make the right enemies",
            "How long will you be staying, and what part of the country will you be in?",
            "I think you already have good answers here but I just want to say the F-22 is also my favorite plane",
            "I would go to the midway for the aircraft carrier. That old girl is beautiful and the veterans that help out on the boat are super cool too.",
            "I don’t know where you’re going, but if California, early October there’s the Pacific Air Show in Huntington Beach, California. It’s a lot of fun. Also looks likes there’s one in mid July in Sacramento. Check for Air Shows around the month you’re going and in the general area. You might even be able to see an F-35 do it’s thing.",
            "Any of the bigger shows, especially if they are at an Air Force Base",
            "National museum of the US Airforce has one on static display.  Dayton Ohio area.  If you are an aviation geek, this is a top three museum for you and it's totally free.\n\nInsaw an F22 at the Dayton airshow last year too.  No joke, it flew backwards and did a three point turn in the air.  It's not even fair.",
            "Air shows where the F22 demo team are the best bet. Otherwise look up what bases host F22s and go there to hopefully see one. Or go to Las Vegas during a Red Flag event.",
            "Take any flight into HNL and sit on the right side of the plane and you have a really good chance of seeing some as you land.",
            "Where will you be traveling to? The United States is an incredibly large country, so there may be air show or there might not. Also, there are some incredible museums in this country and depending on where you are, you could see things in a museum setting."
        ]
    },
    "Is it true you're not supposed to apologize after a car accident because it could be interpreted as an admission of guilt?": {
        "title": "Is it true you're not supposed to apologize after a car accident because it could be interpreted as an admission of guilt?",
        "score": 9,
        "url": "https://www.reddit.com/r/AskAnAmerican/comments/1dr746o/is_it_true_youre_not_supposed_to_apologize_after/",
        "content": "And then you might have to pay more for damages compared to if you didn't apologize.",
        "num_comments": 23,
        "comments": [
            "Asking if someone is ok is not the same as apologizing. Insurance companies use very detailed methods to determine fault, and I’m sure they rule out a simple apology as a factor. Use a dash cam, plain and simple.",
            "Depends on the state. Some states allow an apology to be brought up in court for things like medical malpractice or car accidents.\n\nOthers specifically ban apologies in the moment from being introduced as evidence.",
            "That’s my insurance documents say.",
            "That is literally what they taught in law school.   If there are personal injuries that might exceed the insurance, it might not be the best idea.\n\nThis is not the only area that the law forces behavior.   Disney is forced to defend its intellectual property aggressively as the law says they may lose it (like scotch tape) if they don't.   Which leads to them going after kids putting up things in school windows.",
            "Yes, in some states. An apology can be seen as an admission of fault. Check your state laws to be sure.",
            "I was taught that you should ask if they are ok and make sure they are not injured but never admit anything. Even if it *is* your fault don't admit it.",
            "Why would you apologize if it wasn’t your fault?\n\nSeems to me like an admission of guilt.",
            "Yes apologizing is seen as an admission of guilt",
            "Yes, I was taught this and I think it’s even in my insurance paperwork/policies.",
            "I was always under the impression that \"no-fault\" only meant that each driver's insurance was responsible for covering costs to each of the drivers respectively, regardless of who's at fault, and then the insurance companies would settle it between themselves later (once you've been treated, and had your car repaired or replaced). Theoretically, your insurance rates still shouldn't go up if you're not found to be responsible for an accident, right?\n\nOr am I totally misunderstanding how this works?"
        ]
    },
    "What nature sounds do you hear at night?": {
        "title": "What nature sounds do you hear at night?",
        "score": 13,
        "url": "https://www.reddit.com/r/AskAnAmerican/comments/1dr3o0l/what_nature_sounds_do_you_hear_at_night/",
        "content": "",
        "num_comments": 72,
        "comments": [
            "Coyotes, owls, bats, frogs, insects, skunks, raccoons and / or possums searching through garbage cans. Sometimes cows, primarily during calving season if one goes into labor at night. Occasionally a neighborhood dog barking at the aforementioned skunks, raccoons and possums.",
            "My wife farts pretty loud and it’s not uncommon for her to snore.",
            "The nice sounds of a 26 year old without a muffler going 80 in a 30",
            "Crickets,  toads, frogs, owls, raccoons, occasional coyotes",
            "Dudes who are 7 Heinekens deep yelling “chee hoo”",
            "Coyotes, and crickets mostly, sometimes an owl or bats.",
            "Toads and frogs, waterfall, birds, owls, bats, foxes, and insects.",
            "Owls, tree frogs, and crickets",
            "Cicadas I think sometimes frogs.\n\nI absolutely love the sound of the wind in the winter morning so quiet and like a white noise in the background",
            "The river mostly. Sometimes a skunk or a groundhog tries rooting around."
        ]
    },
    "What is your golf handicap?": {
        "title": "What is your golf handicap?",
        "score": 61,
        "url": "https://www.reddit.com/r/AskAnAmerican/comments/1dqppfj/what_is_your_golf_handicap/",
        "content": "For no particular reason at all….",
        "num_comments": 167,
        "comments": [
            "My lack of ability to golf well",
            "I have a 6 handicap. Wait actually I have an 8 handicap",
            "My total inability to hit the ball.",
            "I don't know what that means",
            "The golf course I play in is in one of those retirement communities, so if I don't break a window I consider it a win.",
            "6 er 7 er 8",
            "Ive never kept score, i just swing wildly and drink beer.  Last time we went golfing was in Montana and I got all 4 wheels off the ground. My husband wouldn’t let me drive the cart anymore. Lol",
            "How does a golf handicap work, what is it",
            "I’m currently a 3.2 in my late 20s and I play 2-3 days a week. Was a +1.5 in college\n\nBut apparently current and former presidents lie about their handicap and report it to the USGA so I’ll be a +8 this time next year!!",
            "My bank account is my biggest handicap in playing golf."
        ]
    }
}