{
    "Fellow Americans. Growing up did your family encourage you to always turn off the lights when you left a room?": {
        "title": "Fellow Americans. Growing up did your family encourage you to always turn off the lights when you left a room?",
        "score": 160,
        "url": "https://www.reddit.com/r/AskAnAmerican/comments/1dljrkm/fellow_americans_growing_up_did_your_family/",
        "content": "Growing up, my parents/grandparents/great grandparents always would say \"turn off the lights, I don't own the goddamm electric company!\".\n\nSo now even in adulthood I automatically turn off any light once I permanently leave a room. And I know i school we were taught to turn off lights for environmental reasons.\n\nYet I have roommates right now that seem to like to keep all the lights on in the house 24/7. They said that just how their parents did it.",
        "num_comments": 120,
        "comments": [
            "Definitely. I don’t use lights in any room that I’m not occupying.",
            "Old incandescent bulbs used a shitload of electricity. They did cost a lot to run. \n\nModern LED bulbs don’t use much power at all, in some cases only 10% of the power.",
            "Yes. And also not to let the faucet run mindlessly (waste of water, a precious resource).",
            "\"There's a light on in the hallway and I don't see anyone using it!\"",
            "Yes. We were punished if we didn’t turn off lights. Family of 9 kids, poor.  My husband grew up in an upper middle class family. Still does not turn off lights. Drives me nuts. Anyone else?",
            "Also, close the damn door when using the toilet.",
            "Yes, but now that I pay the electric bill, I make sure that bitch is off.",
            "My wife’s parents definitely did, yet I am constantly turning off lights in the room she has left",
            "Oh yeah. I was very well trained to always turn the lights off in a room that wasn't being used and it drives friends of mine crazy. They make fun of me for being a vampire because my house is always dark except the room I am actively in.  I'm also always turning off lights in vacant rooms at the gym or barn. It's a \"must conserve, save the planet\" compulsion.",
            "Grew up in the 90s and 2000s, and yes."
        ]
    },
    "We knock the Italians for being strict about their food, but with what particular dishes do Americans get like that?": {
        "title": "We knock the Italians for being strict about their food, but with what particular dishes do Americans get like that?",
        "score": 430,
        "url": "https://www.reddit.com/r/AskAnAmerican/comments/1dl6cmz/we_knock_the_italians_for_being_strict_about/",
        "content": "\"Their promo says they have the best Philadelphia cheesesteak in the southeast San Francisco Bay Area, and I'd say they live up to that claim!  Super good, totally reccomend.\"\n\n\"BULLSHIT!!!  Do not listen to that guy!  I am a PHILLY NATIVE, so lemme tell you EXACTLY how they fuck it up...\"",
        "num_comments": 914,
        "comments": [
            "Southerners get a little crazy with their BBQ. \n\nI've had incredible BBQ in the south, do they definitely know what they're talking about.",
            "I'm sure there are others, but Americans do not fuck around when it comes to their BBQ.",
            "A lot of foreign pizza toppings do that for me. Mayo? Hot dogs in the crust? Fries?? Corn, even.",
            "Americans are more picky about Mexican food than Mexicans are.",
            "Oh, there's so many. \n\n\nHere are some food-related tantrums I regularly see on /r/askanamerican: \n\n* Southerners with regional styles of BBQ. \n\n* Southerners when someone uses \"cookout\" and \"barbeque\" interchangeably. \n\n* Texans with beans/onions/tomatoes in chili.\n\n* New Englanders with tomato in chowder.\n\n* New Yorkers with bagels, pizza, and breakfast sandwiches. \n\n* Any American when someone else mentions corn or tuna on pizza.",
            "New Orleans here….. gumbo. The stuff we see the rest of the county try to pass as a “gumbo” makes us die inside",
            "New York Bagels \n\nI’ve never heard a New Yorker compliment another city’s bagels. They barely acknowledge they are in fact bagels",
            "BBQ, regardless of the region, should be low and slow, otherwise it’s just grilling.  BBQ is not grilling.",
            "Potato salad is highly gate kept and widely discussed in some circles",
            "Chicagoans with the Chicago style dog, most definite. \n\nPA/Maryland folk are strict about scrapple even though it is objectively terrible."
        ]
    },
    "What’s a local project in your area that scream “This was a waste of Money”?": {
        "title": "What’s a local project in your area that scream “This was a waste of Money”?",
        "score": 87,
        "url": "https://www.reddit.com/r/AskAnAmerican/comments/1dlbjp6/whats_a_local_project_in_your_area_that_scream/",
        "content": "\nIn Ireland there were these electronic trees set up to help the environment but scientists are now saying they’ll need to run for 20 years or so in order to actually fight climate change. I was looking up stuff like pork barrel spending and found a bridge in Alaska that was meant to connect to an island hosting 100 people that would cost over $300 million dollars. It just sounded like a waste to me. Are there any examples in your area?",
        "num_comments": 162,
        "comments": [
            "The county handing out tents to the homeless while the city clears homeless camps and throws away the same tents. \n\nYou can take whichever side to be the good or bad one, but either way there is a disconnect that's not helping anyone besides Big Tent™️",
            "My city spent $17 million on an intersection. \n\nIt looked beautiful, well done, awesome. \n\n3 weeks later it was torn up for a water line replacement and now looks like shit.",
            "[The Lerp](https://www.reddit.com/r/BadDesigns/s/LYjw5G2kwP)",
            "Ripping up and repaving the main roads in town that were only 5-10 years old when there's backroads that are safety hazards because they're 3x older and have never received any repairs or new asphalt.",
            "Back when the new Bay Bridge was completed in San Francisco, they planted  a bunch of full grown palm trees on it that cost 15k each. Maybe a year later, they started dying because.. a windy, foggy bay bridge is apparently not the best place for palm trees (?). I’m not sure the state of them now since I don’t live there anymore and don’t keep up on the local tree news, but seems like a waste to me.",
            "They keep shifting around school buildings in my area. Close some for a second, then open one again as like a kindergarten center or something. They built a new middle school then several years later condensed the old middle school into the new middle school.  I can never keep track of which school is open and which school is closed. Its annoying and is a good example of how trash the local school system has been.",
            "My city paid $5 million for 5 self cleaning toilets, then ended up selling them on ebay for $12k.\n\nI used one once and it was awful, the line was 20 people long because it would shut down and clean itself between each use, taking several minutes before letting the next person in.",
            "American dream in NJ. It is just a giant mall. With a half baked water park inside.",
            "Most \"sports complexes\" imo. Just a way for government to pay for business. ",
            "Omg, that bridge in Alaska was meant to connect the city of Ketchikan to THE AIRPORT not some random island with hardly anyone living on it. I’ve lived in AK for over 20 years. It got canceled as an example of egregious waste but imo I don’t think it qualified as waste."
        ]
    },
    "It’s very hot, what type of pools did you go to as a kid?": {
        "title": "It’s very hot, what type of pools did you go to as a kid?",
        "score": 18,
        "url": "https://www.reddit.com/r/AskAnAmerican/comments/1dllyrg/its_very_hot_what_type_of_pools_did_you_go_to_as/",
        "content": "Did you go to public pools growing up? Did you go to private pool clubs? Did you live in a condo, apartment or housing development with its own pool? Did your pools have lifeguards? Were they only seasonal?\n\nI'm very interested in the regional variation. \n\nFor me, I grew up on the west coast and swam mostly in pools for a specific housing development, with no lifeguards. I didn't realize what adult swim was (aside from cartoon network) until I was an adult, moved to the east coast and went to big pools with lifeguards. \n\nCome to find out it seems like the east coast and midwest also have private pool clubs, which I'd also never previously encountered.",
        "num_comments": 130,
        "comments": [
            "My parents thought you would get diseases from public pools, so we swam in a lake that was literally brown instead. One time I stepped on a dead fish. There were no lifeguards that I remember, and I think \"swim at your own risk\" signs.",
            "Massachusetts:  I was poor.  There was a town pool (it was sorta in the projects and a little sketchy but really fine) but I was just not zoned in.  I didn't even know it existed. I thumbed to a local pond from about 11 years old.  It was the only place I knew.",
            "I went straight in the ocean primarily. \n\nI learned when I was a very young kid in a couple different pools, I remember one was at the YMCA. \n\nThen I worked on the water all through high school and college, so I spent a lot of time in the ocean over the summers.",
            "Not to sound like a stereotypical Minnesotan bragging about +10,000 lakes, but I think the first real pool I can remember swimming in was in Navy basic training. We just went to the lake, if our parents couldn't find us at home, we were either swimming or fishing.",
            "The public pool, yeah.  We lived in a house about a mile away.  Private pools were rare where I grew up.\n\nIt was the best.  My family had a “pool pass” we’d buy from the town’s rec center and we’d go like… many days a week for hours at a time.  We’d bring lunch or buy ice cream, socialize, etc.",
            "It is spelled C R E E K.  It is pronounced /crik/.       \n\nOr, it was a clay bottom cow pond with a spring.   Once we discovered the snapping turtles, we no longer went skinny dipping in that pond.  And when we saw the turtle trying to snap at Jim-Bobs's toes, we walked all the way to the crick to cool off.",
            "Central California here.\n\nWhen I was a kid about every 4th house on my block had a pool.  Two of my friends included.  \n\nWhen I was about 12 my dad bought a house very nearby (my parents were divorced) with a pool.",
            "My neighborhood had a pool paid for by the HOA. No lifeguards except for big events. Middle class suburban neighborhood.",
            "I grew up near the gulf of Mexico, so mostly went swimming there. We also went swimming in springs and rivers a lot. Really, the only time we'd go in a pool was at a water park.",
            "Midwest here and I only swam in large public pools run by the city as a kid. Pools were only open during the summer because they were outdoor and lifeguards were typically high school kids. \n\nI grew up in the city and no one I knew had a pool. Everyone went to the public pool."
        ]
    },
    "Boiled peanuts? ": {
        "title": "Boiled peanuts? ",
        "score": 25,
        "url": "https://www.reddit.com/r/AskAnAmerican/comments/1dlg381/boiled_peanuts/",
        "content": "What can y’all tell me about boiled peanuts? I just learned about them and would like to know more? ",
        "num_comments": 124,
        "comments": [
            "They are peanuts that have been boiled.",
            "Drive around. You'll see a hefty older guy with a long beard selling them and watermelons by the roadside. He's the Santa of Southern Summers.",
            "Southern delicacy, usually put in a warm salt water mixture.  You’ll find them at roadside locations and at select gas stations across the South.  \n\nThey’re delicious, but note that it can make your hands a little sticky, and a little messy (at least in terms of the shells and getting the wetness on your hands) and you’ll smell that salt water mixture for a hot second.",
            "They are good, only if they are got from a dude at a roadside stand or a place that sells local fruits, veggies and honey",
            "Surprisingly good!   \nDon’t eat the shells or actual southerners will laugh at you.",
            "I’m allergic to peanuts, so probably shouldn’t be weighing in here. \n\nBut, just like many southern foods, I think I trust the rando on the roadside more than the kettle at the convenience store. ",
            "They are delicious! Salty and kind of soft, but with a firm bite. They're often sold at roadside stands here. You can also find them canned but I've never tried that.",
            "My ex-husband made the best ever. He was a chef. Wouldn't ever give me the recipe. There was beer involved. Never being able to have them again is truly one of the only things I regret about my divorce.",
            "Never had them",
            "They're really good when done right. They're somewhat salty. You don't want to eat the shell. It's a southern delicacy."
        ]
    }
}