{
    "AskALiberal Biweekly General Chat": {
        "title": "AskALiberal Biweekly General Chat",
        "score": 3,
        "url": "https://www.reddit.com/r/AskALiberal/comments/1dqj30l/askaliberal_biweekly_general_chat/",
        "content": "This Friday weekly thread is for general chat, whether you want to talk  politics or not, anything goes. Also feel free to ask the mods questions  below. As usual, please follow the rules.",
        "num_comments": 51,
        "comments": [
            "While the debate performances clearly overshadowed it, I think the real story was *just how many CNN logos CNN was able to get onto the screen at any given time*. \n\nEven Jake Tapper had TWO CNN coffee mugs in front of him.",
            "It feels weird to have SCOTUS season (barely) extend into July and presidential debate season start in June. It's like if game 1 of the World Series was during the NBA finals.",
            "Sad but not surprised scotus allowed fining homeless people who have no legal place to be",
            "What on earth did Biden mean by, “We finally beat Medicare”\n\nI assume there’s more context, but I’ve only found clips of it so far",
            "Anyone find it interesting that in the SCOTUS Jan 6 Obstruction ruling that Jackson voted with the other Conservative Justices and Barrett voted with the other Liberal Justices?",
            "I am nuerodivergent, I feel like there is still not enough accurate representation of people like me. Im sure I have a lot of overlapping similarities to other nuerodivergent people, but I also know nuerodivergent people are very unique and diverse. \n\nI am a male and nuerodivergent, there seems to be a consensus on reddit that I must lack empathy, I am misogynist, I am controlling, I am manipulative, I must be some right wing/ alt right incel creep. I am acrually a vrry kind and empathetic person, and very progressive.",
            "Anyone following either of the major soccer tournaments going on?",
            "At least last night should make it harder for libs to scapegoat the left if Biden winds up losing the election. Should, but likely won't.",
            "Im a neurodivergent and got the anxietys. I'm trying not to poop the bed over the debate. But moving on i am scared if trump gets elected. And seeing so many conservatives wanting things eliminated or forcing us to act like them. Wandering into right wing in yt or Twitter makes me so angry. Im just depressed and wish i could get away from anything political except for what i believe in.",
            ">TWO CNN coffee mugs\n\nFor his sake, I hope at least one of them had something stronger than coffee."
        ]
    },
    "The Official Everything Joe Biden/Campaign 2024 Megathread": {
        "title": "The Official Everything Joe Biden/Campaign 2024 Megathread",
        "score": 17,
        "url": "https://www.reddit.com/r/AskALiberal/comments/1dqxan9/the_official_everything_joe_bidencampaign_2024/",
        "content": "Hey folks - we're already starting to see a TON of repeat questions about President Biden and what he and the party should do going forward.\n\nSince it's the weekend and moderation is usually a bit lighter, we're going to have a megathread for simplicity's sake. \n\nPlease post all top-level questions/comments/thoughts about the the debate, the 2024 election, the DNC, suitable alternative candidates, Joe Biden's health/ability to run for a second term, 25th amendment, voting, press coverage, etc. in this thread. \n\nWe will be locking all other threads as quickly as we can.\n\nAs always, please keep it civil and respectful.",
        "num_comments": 113,
        "comments": [
            "After all the thinking I have done about the debate, all I am going to say is that I am glad we have to come to terms with this now rather than in October or on election night. Whether it's just coping ahead of time or strategizing where to go from here, at least we have four months to deal with it.\n\nI'll end this with what I have been repeating in damn near every response on the debate: Biden won't be the only name on your ballot, the president doesn't create legislation, and all the Democrats need to do is hold a single house of Congress to throw a wrench into a second Trump administration. Don't give up and get wins where you can.",
            "The anti-dnc crowd in full force on Twitter.  Lol ",
            "My parents are both in their 80s, and have been reliable Democratic voters for decades. It was amazing seeing both of them do some version of, \"I can't vote for Donald Trump, but...\" after seeing Biden like that. For the first time in my life my parents are not reliable Dems on election day.",
            "I've seen people saying he'll do better in September, but my question is this: will we even get a 2nd debate? Why would Trump do it? He already won this one, so another debate would only give Biden a chance to make a comeback. Sure, another bad performance would finish Biden for sure, but why take the risk when you've already succeeded in solidifying the impression Biden can't hack it.\n\nWhat if we don't get another chance at this? Can Biden get enough coverage of him being confident and energetic without another big media event like a debate?",
            "Setting aside whether you personally think he’s still got it: \n\nDo you think Biden has folks around him who would discourage him from continuing to seek the nomination *if* it became clear he wasn’t up to the task?",
            "Biden is a good president",
            "Despite hearing the news about everyone freaking out about Biden, I feel relatively calm and still feel he can win the election.",
            "I think the Raleigh rally is going to be salt in the wounds when he loses. He was never incapable at all. He just chose possibly the worst day ever to have an off night.",
            "People seem to forget that there’s a line of succession if a president dies; they act like we’d be fucked if Biden died but I really don’t think Kamala would be that terrible of a president. I get the criticisms of her being anti drug as a CA DA but I seriously doubt she’s looking to make the country anti-weed considering the Biden administration rescheduled marijuana from 1 to 3",
            "Those who aren’t hitting the panic button yet after last night’s debate, why?"
        ]
    },
    "Why do some folk really dislike Kamala Harris?": {
        "title": "Why do some folk really dislike Kamala Harris?",
        "score": 27,
        "url": "https://www.reddit.com/r/AskALiberal/comments/1dr5293/why_do_some_folk_really_dislike_kamala_harris/",
        "content": "After Biden's poor debate showing, there's talk of him stepping down, but it leaves the question of who should replace him. Normally, the obvious choice would be his VP, but this suggestion is typically shot down, usually with assertions about Harris's unpopularity.\n\nI'm a liberal myself, but don't understand: What makes her unpopular?",
        "num_comments": 163,
        "comments": [
            "Her track record as a district attorney and attorney general turns off a lot of leftists who are concerned with criminal justice reform.\n\nShe also just has like, negative charisma, not unlike Hillary Clinton.",
            "They know she’s phony after hearing her speak lol",
            "They think she's a diversity hire, and tbh I wish the Biden campaign was actually trying to combat that narrative, because hiding her away in the pocket just makes their case stronger.",
            "I've heard that people don't like her voice ... how she sounds and comes across.  Poor reason but that's what I've heard.  For me though, if by some chance she is the candidate against Trump, I will vote for her.",
            "Still bitter that Rice got passed over.",
            "Her predecessor in San Francisco was a really cool DA and she was pretty awful. You can go read all about her career past the DNC news clippings. She also seems like she’s barred out",
            "Because she was a prosecutor at one time and they didn’t like her enforcing the laws pertaining to drugs. But a DA is under the leadership of a Mayor.\n\nWhat was she to do? Quit her job and become a public defender?",
            "She's extremely uncharismatic, and her past as a DA really rubs people the wrong way. She used to prosecute people for minor marijuana offenses, but used to weed herself in college. Most people found that extremely hypocritical.\n\nShe also just doesn't excite anyone or is a pretty generic Democrat. She lacks the strong identity that Obama had.",
            "She comes across as kind of fake, like she’s forcing it. That’s the vibe I get anyway. Maybe she is just not charismatic. I don’t really care though.  I’m concerned about policies not personalities.",
            "I have a very hard time believing anyone who says they are concerned about her history as a prosecutor. \n\nThe problem is she’s a black/Indian woman in politics."
        ]
    },
    "What do you think causes voters to be undecided between Trump and Biden?": {
        "title": "What do you think causes voters to be undecided between Trump and Biden?",
        "score": 15,
        "url": "https://www.reddit.com/r/AskALiberal/comments/1dr17r7/what_do_you_think_causes_voters_to_be_undecided/",
        "content": "Right now, I'm seeing Latino focus groups say they support Biden, other focus groups saying they all support Trump even when many of them supported Biden and i don't understand it. How are people so uninformed that they don't see a fundamental policy, competence difference between the two? It goes. even beyond the debate. I've seen articles where young voters blame Biden on the climate even though he's done a lot of work there or don't seem to understand how the government works. ",
        "num_comments": 102,
        "comments": [
            "I literally see people blame Biden for sales taxes in my state. Sales taxes are a state thing.\n\nThe average voter is uninformed and votes with their emotions.",
            "Maybe religion is super important to them. Maybe uncontrolled illegal immigration is also concerning to them. But maybe they also want better healthcare and welfare.",
            "Because most people make decisions based on emotion instead of logic.",
            "I don't think people actually know what each President has accomplished and people tend to take things Trump says like \"Greatest Economy Ever\" at face value.",
            "Ignorance.  People who invest the barest minimum in actually evaluating their positions.",
            "Swing voters are always unhappy with what they have, can’t remember anything, and assume the grass is greener on the other side. They don’t care enough to investigate what’s actually going on.",
            "The one sided loads of divisive nonsense the media feeds us.  No matters what side you’re on, we’re all occasionally provided with a dose of reality from the other side on some topic that we had no clue about, which creates doubt and makes us rethink our position, and wonder what else we’ve been lied to about.\n\nThe differences in the narratives on either side of the aisle about the facts revolving around border, and immigration are completely infuriating. And most people only know their own sides version of the story, and have some twisted “worst possible” explanation of the other sides position.  It’s blatantly divisive and dishonest.",
            "Not knowing a goddamn thing about anything",
            "Immorality. \n\nThere’s no debate in this election if you have a conscience.",
            "For some reason Biden's accomplishments have been the smallest of news in our crazy world, meanwhile people are in the toughest financial spot the can probably remember (or at least emotionally remember) because of inflation and the corporate price gouging off the back of inflation--and they are voting REACTIVELY not actively."
        ]
    },
    "Why has the media done a total U-turn with Biden?": {
        "title": "Why has the media done a total U-turn with Biden?",
        "score": 63,
        "url": "https://www.reddit.com/r/AskALiberal/comments/1dqooiv/why_has_the_media_done_a_total_uturn_with_biden/",
        "content": "This feels so strange because in the world 2 days ago, suggesting someone other than Biden should be the nominee would get you accused of trying to ruin the Democrats' election chances and \"sabotage\" the party.\n\nYet now, we are getting articles like this:\n\n[https://web.archive.org/web/20240628061759/https://www.theatlantic.com/politics/archive/2024/06/biden-has-drop-out/678821/](https://web.archive.org/web/20240628061759/https://www.theatlantic.com/politics/archive/2024/06/biden-has-drop-out/678821/)\n\n\"Dropping out is Biden's most patriotic option\".",
        "num_comments": 153,
        "comments": [
            "Because the debate was a massive optics loss. He did not do well and people are now worried about his chances based on that.\n\nAlso, before this debate, every other possible nominee was polling much lower than Biden against Trump. So you could make the argument that someone is causing division by suggesting another candidate.",
            "It’s not real difficult to figure out. Biden has had a good 4 years in office and is still polling horribly because of his age and lack of giving any enthusiasm to voters. He has done a horrible job of building confidence in his accomplishments and the average citizen doesn’t really feel the impact of his good economy.\n\nThen he comes out and absolutely fumbles a debate and his performance plays directly into everything his doubters and republicans are playing up. He looked old, confused and lacked confidence.",
            "Because the debate was such a disaster",
            "It was a bad debate performance.  I’m 40 and have seen plenty of debates over the years, including a lot of horrific debate performances (Paul Ryan, Michael Bloomberg, Jeb Bush just to name a few).  This was the worse debate performance I’ve ever seen.  Trump was lying, dodging questions and meandering on with nonsense.  Any other democrat would have demolished Trump, but Biden couldn’t even finish a sentence at times.  It’s absolutely fair to question if he should continue on, although I think it’s too late at this point.\n\nThere’s still a ways to go, but I think we need to start bracing for another Trump presidency.",
            "Because elections are about perception and tens of millions of people have now seen with their own eyes that Biden looked very old and slow.  \n\nObviously, tens of millions of people seeing something with their own eyes on television should change people's opinions on an issue.",
            "Because Biden imploded last night. There's really no other way around it. There's no other way to view it. Biden appears very weak.",
            "Because he looked awful in the debate.\n\nUltimately the “media” is people, and people have eyes and ears",
            "Because he appeared shockingly feeble and disoriented last night.",
            "Because no one can unsee what we all witnessed last night. Either the Dems replace Biden or the election is over.",
            "Media runs on ad revenue. Figure it out."
        ]
    }
}