{
    "[Weekly] Office Hours - undergrads, please ask your questions here": {
        "title": "[Weekly] Office Hours - undergrads, please ask your questions here",
        "score": 2,
        "url": "https://www.reddit.com/r/AskAcademia/comments/1dn86oo/weekly_office_hours_undergrads_please_ask_your/",
        "content": "This thread is posted weekly to provide short answers to simple questions, mostly from undergraduates to professors. If the question you have to ask isn't worth a thread by itself, this is probably the place for it!",
        "num_comments": 8,
        "comments": [
            "Are book reviews counted as publications? To what extent?\n\nAdditional context: I have written two book reviews, with a lot of help from the editor in chief of the journal (who is my advisor for my masters), and they have been published. The journal is a local journal for psychology.",
            "Is being an academic worth it? And by worth it, I mean fulfilling? Also, how does maintaining work life balance work? And is the salary enough to provide for a family? Honestly, I'm still deciding what to pursue kind of because I currently have three majors: math, cs, physics. I figured I'd need math regardless for cs or physics. And cs and physics both interest me. Believe me I'm no math genius, far from it. I'm willing to put in the work to better myself in math as a whole so there's that. I am interested in the subjects like I stated prior. I've taken cs courses but have yet to take any physics course. I have roughly 2-3 semesters for my associates in CS. Feel like I'm all over the place since I don't have a clear path of what I'd like to do. Teaching has always been of interest of me, and also a profession/career I respect. What in your opinion makes the career fulfilling? And what are the pros and cons? Currently 27 have no family of my own yet and live alone, working my way through school just a grocery job, not ideal but it keeps the lights on. Currently have a 3.0 GPA so I have if to retake a few courses to improve my gpa to better my chances of getting into a grad school I will do so. Any insight will be greatly appreciated.",
            "They count as publications to the extent that they are published pieces of writing, but unless they were peer-reviewed (which is seldom the case), they do not count as peer-reviewed publications and are not worth that much (for example, for applying for academic positions or for tenure and promotion).",
            "You cite the work that you are actually using. If it is the English translation, then that is the one you cite. Depending on your discipline's conventions, it is possible to note parenthetically the original publication date after the date of the translation.",
            "Some people find academia fulfilling, but fewer and fewer do. Just take a gander at r/professors. I've been fortunate to secure tenure-track positions and tenure. However, even though it had been a dream of mine for much of my adult life to achieve these things, I have many regrets. Higher education is under attack like never before in the U.S., where I am based, and there are no signs it's going to let up. Quite the opposite, in fact. Being a professor is basically being a glorified babysitter and is typically compensated on a similar scale (no offense to babysitters). So I guess my answer is, \"No. It's not worth it.\"",
            "Okay thanks for the input. Yeah the education here in the US needs more respect & those in the field imo. Really wish you guys got paid more its unfair.",
            "As a part of my dissertation, I am trying to use a reference (Harvard)  to discuss an original model of cancer. \n\nThe issue is it was released in 1914 in German. The English translation came out in 2008. \nDo I put the original untranslated date or the translated publish date?",
            "Here's a sneak peek of /r/Professors using the [top posts](https://np.reddit.com/r/Professors/top/?sort=top&t=year) of the year!\n\n\\#1: [Those moments with a student that remind us why we do this. (a small win)](https://np.reddit.com/r/Professors/comments/17yh988/those_moments_with_a_student_that_remind_us_why/)  \n\\#2: [Better luck next time](https://i.imgur.com/MvwTAcq.jpg) | [39 comments](https://np.reddit.com/r/Professors/comments/13qnrq1/better_luck_next_time/)  \n\\#3: [They dont understand our pain](https://i.redd.it/gvy3txxfh75b1.jpg) | [48 comments](https://np.reddit.com/r/Professors/comments/1462kmp/they_dont_understand_our_pain/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)"
        ]
    },
    "For those of you who have faculty positions in STEM fields, who influenced you more - your PhD PI or postdoc PI? ": {
        "title": "For those of you who have faculty positions in STEM fields, who influenced you more - your PhD PI or postdoc PI? ",
        "score": 10,
        "url": "https://www.reddit.com/r/AskAcademia/comments/1dr3bpl/for_those_of_you_who_have_faculty_positions_in/",
        "content": "If you have a faculty position, in which stage of your training did you have the most influential mentoring? I’m asking specifically about the way that you think about science - not just in terms of where you ended up, how you run your lab, etc, but how you frame experiments, etc. \nmy PhD advisor & my postdoc advisor have extremely different philosophies of science. I am finding more and more that I agree with my PhD PI’s philosophy when it comes to science itself, but I wonder if that’s recency bias/a sort of the “grass is always greener” mindset. \n\nI’m curious also whether this has changed for you at different stages of your career. \n",
        "num_comments": 10,
        "comments": [
            "Hands down, my PhD advisor. I also feel that my undergrad advisor influenced my thinking about science a lot. I learned a lot of individual skills about how to do science and how to mentor more junior people from my postdoc advisor, though.",
            "My undergrad advisor. He introduced me into a more critical way of viewing the world and science. My grad advisor wanted me to get a job, so he refused to engage in any critical discourse and demanded I stick to the mainstream stuff.",
            "Im a first year Ph.D. Student, but I had a lunch with a visiting speaker who answered this exact question. They mentioned that their post doc advisor was more like a coworker whereas when they were applying to faculty positions they felt more comfortable speaking to their Ph.D. Major professor for advisement.",
            "Another grad student in my PhD lab, followed by my postdoc advisor and other postdocs. This is why it is so important to interview broadlyby which I mean consider your larger set of colleagues and work environment. I continue to collaborate the most with my postdoc advisor and other former postdocs.",
            "I would say both. I really cant choose one or the other. My PhD and postdoc approached similar questions but from completely different methodologies (to keep it vague, lets say one is 100% hands on experimental and the other is completely theoretical). I can see pros to both and I use both methods now - ideally having exposure to each strengthens my science under each methodology. Id love to truly combine the methods someday but Im not sure what that would look like.",
            "For a long time, I thought it was just a matter of adopting successful traits and work habits from mentors, but turns out its not that.\n\nWhat works for your PI will not necessarily work for you, and vice versa. What will make you successful is a philosophy tailored to your disposition, strengths, weaknesses, etc. Ultimately, I think you can learn lessons but you need to try out things for yourself and see what works for you.",
            "Postdoc, also because the environment (Ivy vs non-US hospital) was so much more aligned with where I ended up starting ny lab (US).",
            "For mentoring style and how to approach science in a general sense, my PhD advisor for sure. At least for me, I feel like that's a function of two main things; 1) by the time I got to my postdoc, I had already developed strong opinions about many aspects of those things from my time in grad school so my tendency to pick up \"new\" habits was naturally a bit lower and 2) the nature of the relationship and interactions with my PhD vs postdoc advisor, where the former and I had more in depth conversations about doing science / running a lab in an abstract sense and more time to do so as we spent months together in the field in foreign countries where we were essentially the only people we had to talk to who spoke our language fluently. I would say also that in many ways my PhD advisor was a bit of a negative example in the sense that many of the opinions I developed about how to run a lab at least were in the form of \"When I have grad students, I'm going to do the exact opposite of the way my PhD advisor does things.\" Subject wise though, I basically have no overlap with my PhD advisor and am essentially in the same subfield as my postdoc advisor now.",
            "Probably my PhD advisor, but only by a little and mostly because I was there longer. \n\nThey were both quite different, and both brought me different skills. \n\nI am an associate professor. I don't think this has changed since I left my postdoc.",
            "My phD supervisor was the most patient and supportive mentor Ive ever had. He was tough and rigorous but was approachable. He gave me timely feedback to work on my writing skills. Despite him spending most of his time on his desk, he was incredibly knowledgeable in designing experiments and gave me practical suggestions. Unfortunately, I didnt realize how great he was until I graduated. My current goal is to be as half as good as him. \n\nNow, my postdoc PIs on the other hand lets say they taught me how not to be a PI. After many counselling sessions, I am finally able to embrace the postdoc experience"
        ]
    },
    "Ghosted (?) by PhD students after a promising interview. What should I do?": {
        "title": "Ghosted (?) by PhD students after a promising interview. What should I do?",
        "score": 26,
        "url": "https://www.reddit.com/r/AskAcademia/comments/1dqw0xq/ghosted_by_phd_students_after_a_promising/",
        "content": "I'm an undergrad rising junior majoring in biochem, and I reached out to this professor asking if I could join his research lab about computational protein design. He referred me to two of his PhD students and they interviewed me almost two weeks ago.\n\nThe interview went great, they talked in detail about their projects and asked me about my skills, commitment, etc. Overall the vibe felt like they were on board for having me assist them with their projects because I already knew quite a bit about the topic, and we brought up how this experience would be enriching for the bioichem courses I'm taking. Plus, it's an independent outreach so it's not a competitive internship or anything.\n\nYet after the interview I've never heard back from them. After one week I sent them a follow-up email asking when I could start going to the lab, or if there's anything I can do in preparation for that. Still no response. I'm a bit confused now so I'm hoping to get some insight from the other side of the story. Is this normal or did I do anything wrong? Any advice is appreciated!\n\nOur school just started our summer term, if that helps.",
        "num_comments": 13,
        "comments": [
            "Its the summer. This may be a big part of it.\n\nIts also a LOT of work to train, onboard and supervise an undergrad RA.",
            "You should contact the PI not the students, he is the one who makes these sort of decisions",
            "I would just send another email and include both students and the faculty in it. Just say you really enjoyed meeting with them and reiterate your interest and excitement. Mention you are happy to get started at their convenience. Thats what I would do.",
            "Have you tried emailing the professor again?",
            "Summer's *half done*. I hire undergrad students for summer between Sept and Jan for the FOLLOWING summer.",
            "not true in many cases, certainly not in big labs or STEM labs.  Grad students and postdoc are the ones who actually work with undergrads and so frequently are the ones who are sent info about interested undergrads and who interview them/suggest to hire them and work with them",
            "Proper advice. Polite, don't assume, cc the boss.",
            "What do you think will happen-the PI forcing the grad student to hire the RA?! good lord.",
            "PIs generally make those decisions. At least they might push an answer.",
            "For the summer, with no structured program/credit, it is not typically going to happen at this point."
        ]
    },
    "Please advise. I am so confused right now. Want some good research experience.": {
        "title": "Please advise. I am so confused right now. Want some good research experience.",
        "score": 3,
        "url": "https://www.reddit.com/r/AskAcademia/comments/1dr6sjv/please_advise_i_am_so_confused_right_now_want/",
        "content": "I completed [b.tech](http://b.tech) in cse in one of the NITs(India) in 2020. Due to some health problems I took a year off as I didn't sit for placements. I appeared for Gate then and got into one of the top NITs for mtech, as I wanted to get a flavor of research in Indian academia. But that was a horror show. The research culture in the NITs is the worst . People only run after quantity of papers for the sake of degree and profession. There is no scientific temperament here. Here also I didn't sit for the placements. However these are my qualifications. Now I considering the following options.\n\n1. Pursue a masters in one of the IITs or IISc. 2.Pursue a masters abroad ( preferably in US or Germany)\n2. Pursue a PhD in top IITs.\n3. Pursue R&D in the industry. ( but for that ig I need to have a PhD or masters from a top institute) I am not so interested in placements. I just want to do some high quality research work. To be honest I am starting to lose confidence on some good institutes like IITs also and universities abroad. I just want some high quality raw research experience. Please help.\n\n  \n",
        "num_comments": 1,
        "comments": [
            "If you already have a masters from NIT, please don't get another one. If you don't, try gaining industry experience even if it isn't research oriented and apply to masters abroad using that experience on your SOP. It'll also streamline your research interests and give you time to think. Industrial problems will give you an idea of what to solve and that way your research will be on a real world problem and valuable to society.\n\n\nEdit: I'm simply sharing advice I got from my undergrad advisor, I have finished my Bachelor's this year and am going to start a research based masters in September. I'm NOT a senior."
        ]
    }
}