{
    "Dawn of the First Day: An Update on the State of the Sub": {
        "title": "Dawn of the First Day: An Update on the State of the Sub",
        "score": 11,
        "url": "https://www.reddit.com/r/AskALawyer/comments/1dojrbw/dawn_of_the_first_day_an_update_on_the_state_of/",
        "content": "Hello everyone,\n\nAs we settle into the backend of the sub, I thought it fair and proper to provide you with some insight as to what we have been doing:\n\n1. We have put up disclaimers, notes, and alerts just about everywhere we can stating that this sub is not a replacement for actual legal advice, and you should make important decisions based on information you get here. We are emphasizing that even though we are stuck with the name r/AskALawyer , it is not to be taken literally. r/AskLawyers may be a viable alternative if you literally want to talk to lawyers, but please be cool to them over there if you do check them out. **From here on out, consider this sub to be \"Ask a Legal Enthusiast\"** \n2. We created, modified, and eliminated some rules. There's nothing there this is new in the sense that it is something we wouldn't have moderated before, but it now just more visible for the sake of full disclosure. Still working the text/definitions/standards for them, but you should be able to get the gist.\n3. We created....a lot...of bots that will supply you with helpful messages, prohibit some problematic posting, and automatically send items for review based on keywords. The one everyone will see is going to be Location Bot, which will flag any message title that does not have brackets in it with a reminder to post a location. There's a bunch of other ones based on common issues/phrases. This will likely cut down on the *quantity* of new posts but ultimately increase the *quality* of posts that do get made.\n   1. **NOTE:** *If you encounter anything weird with these, please let us know via mod mail or here. For some reason mods do not get to see the automations when they are pushed to go live. We really do want feedback on how these help/hinder the experience*\n4. We turned on some Reddit harassment, ban evasion, and quality control tools. We'll see how these work and if they make sense to keep on, given that people tend to make throwaways for a lot of content here. Modmail is also filtered for harassment so whatever expletive you want to throw our way for daring to moderate you probably won't ever be seen by a human.\n5. We turned on automod that provides links to other legal subs people may be interested it - especially for our friends outside the US. Still working out what we want automod to say/do.\n6. For the time being, there are no user flairs to denote \"Verified Lawyer\" or \"Not A Lawyer\". We think we turned off all the flairs, but they seem to be showing up from time to time still on new posts so who knows if we actually did. Point is, those flairs are going away. Please don't ask us for them. Appropriate replacements will come eventaully, once we get things going.\n7. u/athena5000 is hard at work doing some design updates to the sub and I trust their very capable hands to do what they feel is best in that department. If you have any thoughts or comments, please let us know.\n\nSo there we have it folks. If you have any ideas, thoughts, feedback, please feel free to reach out in the comments below or via mod mail. Constructive criticism is welcome.",
        "num_comments": 2,
        "comments": [
            "Once again congratulations. You and athena seem to have the best interest of the sub in mind so i am looking forward to seeing all the improvements and learning new quirks of the law."
        ]
    },
    "User Flairs are now self-service": {
        "title": "User Flairs are now self-service",
        "score": 0,
        "url": "https://www.reddit.com/r/AskALawyer/comments/1dpe86l/user_flairs_are_now_selfservice/",
        "content": "Feel free to select your own user flair (if you want, it’s not required). If you have any ideas on flairs you’d like to see added to the list, feel free to suggest them.\n\n> Tap the menu in the upper right-hand corner of the community page. A menu will pop up and you'll see the option to Change user flair. Select your flair and tap APPLY.\n\nFlairs that are currently applied will be removed in due time. They should mostly be gone now but some are still floating around.",
        "num_comments": 1,
        "comments": []
    },
    "[utah] My pregnant wife has been seeing a radioactive patient, hospital didn't inform here he was radioactive": {
        "title": "[utah] My pregnant wife has been seeing a radioactive patient, hospital didn't inform here he was radioactive",
        "score": 343,
        "url": "https://www.reddit.com/r/AskALawyer/comments/1dqp62y/utah_my_pregnant_wife_has_been_seeing_a/",
        "content": "My wife works as a speech therapist and works closely with patients that have had strokes, brain injuries, and other cognitive issues. \n\nShe is about 10 weeks pregnant and just found out yesterday that one of the patients she's been working with closely for several weeks has been taking aggressive radiotherapy for a nasty cancerous brain tumor. The patient has had the brain tumor for the entirety of his stay and treatment on my wife's floor.\n\nShe was just informed of this yesterday. One of the occupational therapists mentioned this and said that \"only pregnant women need to worry about the levels of radiation he's emitting\". \n\nMy wife had not yet told anyone other than her boss that she's pregnant due to her only being 10 weeks along, but had to tell everyone now that she's been exposed to this patient (her telling people is basically a non-issue in relation to the radioactive patient she's been seeing). She also is refusing to see him now which everyone agrees is the best option.\n\n We have called our OBGYN office, and they seemed concerned. They will be referring to our Dr. soon. \n\nMy legal question, and maybe it's too soon to know, but if something happens to the baby, how likely would we be able to make a case against the hospital? What kind of lawyer would we reach out to? Obviously all of this is fairly new and is ongoing, but I'm just curious what our next steps would be if something happens.\n\nEdit: because people are mentioning it in the comments, my wife did disclose her pregnancy to her boss prior to this patient coming to her floor. I should have made that more clear. I'm not sure how else she could have \"let the hospital know\" if this doesn't count.\n\nEdit2: some information I feel is relevant after seeing some comments...\n\nThe floor my wife works on is in-patient. It's where they go after they've been deemed medically stable, but can't go home due to their injury and need some kind of physical, occupational, or cognitive therapy. \n\nThey adopt an \"it's everyone's job\" mentality, meaning if my wife is in the middle of a session and the patient needs to use the bathroom, she is the one who physically transfers them.\n\nHer sessions are at minimum an hour a day every day. She works four consecutive days a week.\n\nWhen she told her boss, she signed paperwork that stated she was pregnant and was disclosing that to the hospital at large, but due to it being so recent and new hadn't told her coworkers. I just learned the paperwork bit from my wife just now.\n\nThis is our first child and first time being pregnant.\n",
        "num_comments": 90,
        "comments": [
            "*Hi and thanks for visiting r/AskALawyer. Reddits home for support during legal procedures.*\n\n***\nRecommended Subs |\n:---------------: |\nr/LegalAdviceUK |\nr/AusLegal |\nr/LegalAdviceCanada |\nr/LegalAdviceIndia |\nr/EstatePlanning | \nr/ElderLaw |     \nr/FamilyLaw |     \nr/AskLawyers |\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALawyer) if you have any questions or concerns.*",
            "There are medical journals and articles that discuss chemotherapy patients. They even state physical contact is fine and safe. It also discusses whether or not patients are implanted with radiation or getting it intravenously and the variance in such. Your wife can request accommodation to not see or treat stated patient due to pregnancy if she is that concerned.\n\nhttps://health.clevelandclinic.org/can-your-cancer-treatment-be-hazardous-to-others",
            "brains are generally treated with stereotactic radiation. the beam is a massive radiation dose generated with electricity, it’s not like a radioactive isotope that is always giving off radiation. it ends when the patient gets off the table of the machine.",
            "NAL but a medical physicist\n\nBased on your description the likely situation is that the patient isn't radioactive at all.\n\nIf the patient was / is radioactive and emitting the levels of radiation that could in any way approach being any sort of concern the hospital will have been required to have them in isolation under the conditions of thier radioactive materials license.\n\nI don't have time to write an extensive response but the TLDR is that radioactivity and radioactive patients are highly regulated by the US Nuclear Regulatory Commission.\n\nMost likely there is confusion and this patient is undergoing external beam radiation therapy which does not make them radioactive and your wife is being given bad information.",
            "I just wanted to chime in that a lot of people are saying radiation therapy does not cause a patient to emit radiation, however there is a type of therapy called brachytherapy where radioactive \"seeds\" are implanted following neurosurgical resection of a brain tumor (brand name Gammatile). These DO emit radiation for around d 100 days following implantation, with a total exposure around 0.9 mSv for close contact caregivers who routinely interact with the patient, which is well below accepted safety standards. HOWEVER it is recommended that pregnant individuals do NOT engage in close contact with the patient during that 100 day window. \n\n[Gammatile](https://aapm.onlinelibrary.wiley.com/doi/full/10.1002/acm2.13776#:~:text=measured%20dose%20rates.-,Results,skull%20and%20soft%20tissue%20attenuation.)",
            "Something is missing here. I work in a similar setting, and any restrictions for who can work with a patient are known.  We had a similar situation with a patient on isolation and staff needed to not be pregnant. I’m older than my colleagues. Manager still checked in with me explaining the pregnancy restriction, not knowing my own medical history that I can’t get pregnant anymore (tubal ligation).  I shared I was the safest person to work with this patient just in case a younger colleague was pregnant and didn’t know it yet. \n\nSo either the radiation isn’t as strong as your wife was told and there’s no risk,  or your wife’s work has a huge safety issue that needs to be reported",
            "(Echoing other comments...) Please clarify (exactly) what sort of treatment this patient had? Radiation therapy? If so, what sort of therapy? \n\nRadioisotope therapy? (If so, what isotope?)\n\nThat will help...",
            "My mum was undergoing chemo when I was pregnant. Breast cancer if that makes a difference. I drove her to and from appointments, provided personal care - showering and toileting, feeding, changing dressings after her mastectomy. \n\nWe were told it was fine.\n\nChild is a huge PITA, but he is fine and 21.\n\nI can understand your concern, and I did check with each treatment if it was OK, and was told it was. \n\nWhen Dad had chemo for his prostate, I was told to stay away with our child for (?) 72 hours after each treatment, and for the kid (at that time 3) not to share the toilet - he thought that getting to pee on the lemon tree made him such a grown up.\n\nCancer and its treatments have come a long way - but I would still check.",
            "I'd think it'd be workers comp, if she/her fetus suffer health complications from something she encountered at her workplace while she was working. She could document what happened in an incident report, reporting that she's been working with the patient, there were no warnings/notices at the patient's room/medical chart, etc.",
            "I would think her chart would be prominently marked if the pt themself was a hazard. You could ask a radiation oncologist, but they’re not going to speak to you unless you’re referred to them. And they’re not going to accept the referral because you don’t have cancer. Your obstetrician will make the proper referrals, most likely to a maternal fetal medicine unit.  They will do a thorough assessment and then take the proper actions that are based on best practices."
        ]
    },
    "I got mugged": {
        "title": "I got mugged",
        "score": 40,
        "url": "https://www.reddit.com/r/AskALawyer/comments/1dqzs8n/i_got_mugged/",
        "content": "I got caught up in the middle of a failed mugging the other day and my spouse was with me. I should have just dropped everything of value and left, but instead I stood in front of the muggers pistol and ripped it out of his hands. (gotta protect the wife) The mugger ran off and I was left with a revolver. as far as I can tell the thing is real, and heavy. The magazine (cylinder?) was empty, no bullets at all. Is it legally mine now? I don't exactly need a gun but it's pretty cool. I haven't owned much less used a gun before. also now my wife is mad that I didn't call the police right after. \n\nsummary of questions:\n1. can I keep this gun?\n2. if no, how do I get rid of it? sell to a gun shop?\n3. (not legal) how do I get my wife to not be mad at me? ",
        "num_comments": 33,
        "comments": [
            "*Hi and thanks for visiting r/AskALawyer. Reddits home for support during legal procedures.*\n\n***\nRecommended Subs |\n:---------------: |\nr/LegalAdviceUK |\nr/AusLegal |\nr/LegalAdviceCanada |\nr/LegalAdviceIndia |\nr/EstatePlanning | \nr/ElderLaw |     \nr/FamilyLaw |     \nr/AskLawyers |\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALawyer) if you have any questions or concerns.*",
            "You shouldn’t keep the gun. Most likely, it was attained illegally. I suggest calling a police department and explain what happened. They will give you guidance on how to turn it in without them being spooked by a gun walking through the front door. The wife…. you’re on your own with that one😂",
            "Turn the gun in to the police. Call them ahead of time and ask how you can turn it in.",
            "is this a real question? Why on earth would you want to keep a gun of a criminal? Are you looking to go to prison because now your prints are on a that weapon could be attached to multiple crimes. turn it in to law enforcement and report what happened to you. And Apologize to your wife.",
            "Turn it in or call officers out to come and get it. Last thing you want is to be stopped or caught in possession of a stolen firearm or worse, a gun with a body on it. That is a legal nightmare I’m sure you don’t want.",
            "You should immediately call the police or drive to the local station. You could leave the firearm in your center console or trunk. Then tell the officer about the mugging and let them know the gun is in the car (that you didn’t want to bring it into the station). You should also say you believe it’s unloaded but you aren’t 100% sure.",
            "Bring it to the police. It might have been involved in a crime and if it's found on you at a later point you're pretty fucked.\n\nObviously it's not yours.",
            "It’s like the Elder wand in Harry Potter, you defeated the bearer, now you are master of the gun.",
            "The gun is just a tool of the trade. This is like taking a drill from a bad carpenter.  You are the carpenter now, you must go build.",
            "Take it to a gun buyback at a nearby PD.  Take the Mrs to dinner with the money/GC they give you."
        ]
    },
    "[Montana] DUI false arrests multiple people over around a 3 month period ": {
        "title": "[Montana] DUI false arrests multiple people over around a 3 month period ",
        "score": 19,
        "url": "https://www.reddit.com/r/AskALawyer/comments/1dqyxwl/montana_dui_false_arrests_multiple_people_over/",
        "content": "[Montana]\n\nI was detained for dui they claimed my eyes were red. Did FST consented to blood test and after a little after a month the case was dropped. By the time it was dropped another person on social media had the exact same situation same officer, case dropped. And come to find out at least five people had similar circumstances related to this officer. The others had charges ranging from dui to felony child endangerment. All charges dropped. Would there be grounds for a civil rights case? If I missed any pertinent information please ask. ",
        "num_comments": 12,
        "comments": [
            "*Hi and thanks for visiting r/AskALawyer. Reddits home for support during legal procedures.*\n\n***\nRecommended Subs |\n:---------------: |\nr/LegalAdviceUK |\nr/AusLegal |\nr/LegalAdviceCanada |\nr/LegalAdviceIndia |\nr/EstatePlanning | \nr/ElderLaw |     \nr/FamilyLaw |     \nr/AskLawyers |\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALawyer) if you have any questions or concerns.*",
            "You missed the part where you NEVER do the FST, you don't voluntarily ever give blood or blow into the device.  You never say you even had one beer yesterday.  And besides all of that, you don't answer any questions.  Where are you coming from, where are you going, bs, bs, bs.  \n\nA guy got $175,000 this week for flipping off a cop and the cop arrested him for disorderly conduct.  See if it was the same guy.\n\nOtherwise, stay the hell away from the police and court and enjoy your life.",
            "Tennessee has an implied consent law.  If you refuse breath/blood it's an automatic suspension of your driver's license",
            "In Montana refusing the breathalyzer results in a 6-month suspension of your license:\n\n[https://www.judnichlaw.com/montana-dui-to-blow-or-not-to-blow/](https://www.judnichlaw.com/montana-dui-to-blow-or-not-to-blow/)\n\nThis seems to be the actual statute:\n\n[https://leg.mt.gov/bills/mca/title\\_0610/chapter\\_0080/part\\_0100/section\\_0160/0610-0080-0100-0160.html](https://leg.mt.gov/bills/mca/title_0610/chapter_0080/part_0100/section_0160/0610-0080-0100-0160.html)\n\nIn fact, [according to this map](https://www.responsibility.org/alcohol-statistics/state-map/issue/test-refusal/), the only state in which a test refusal is not gonna get you in some sort of administrative trouble is Wyoming.\n\nIf you know you'll fail the tests refusing them might be a good idea, because if the administrative penalty might be less than the conviction. But this is going to depend a lot on which state you're in, how intoxicated you are,  the penalties for refusal in other areas of your life etc. Licensed pilots, for example, who refuse the test are ex-pilots. It's assumed you ducked the test because you were high on the worst things available, and they don't let that guy fly a plane with hundreds of passengers. Licensed pilots convicted of driving have been known to get their license back. A licensed pilot in this situation, where there was an arrest but no charges, is probably in the best of all worlds for having met the asshole cop.",
            "You can apply for an appeal and keep your license.",
            "Americans have multiple amendments to the constitution that protect us with our right to remain silent, search and seizure, and at least three more related to attorney representation.  A competent attorney can retain your license, and as long as the defendant doesn't do stupid stuff like volunteer information, or other breath and blood evidence, the case will be dropped or reduced to a non alcohol infraction.  If you tell the cop that you have had even one alcoholic beverage, or one bit of cold medicine, that gives them probable cause to go anywhere they want in the investigation.  So, silence is golden.  All you are required to do is give then identification, insurance, and sometimes vehicle registration.  that is all.  and most state say you only have to present that, which is far different than giving it to them.  People go to jail because cops are trained to trick you into failing the tests.  And most cops will fail to follow enough procedures to get the case kicked if the driver doesn't screw it up.",
            "Truth, but if you aren't intoxicated, why go through the hassle...just to say \"I showed the man!\"  I got better things to do",
            "You’re not required to do field sobriety tests and you never should. They are too subjective and even sober people fail them. There are no repercussions for refusing a roadside breath test either, but they aren’t admissible in court so you may as well if there is a chance you can pass. You’re only required to do a blood draw or breath test at the station after you’ve been arrested. If the police have probable cause to arrest you, they are going to do it regardless of how well you do on a fst or pbt, they are just trying to gather more evidence against you. If they don’t have probable cause, you shouldn’t risk giving it to them by doing tests you’re not required to do.",
            "Well, first off, it isn't up to you if the cop decides you have been drinking.  Cops make up stuff.  This isn't about showing up the man and I don't now why I am explaining this to an idiot.  so I am out.",
            "You definitely explained it better than me"
        ]
    }
}