{
    "Heads up industry peeps! Apply for flair to make top level replies in AskCarSales.": {
        "title": "Heads up industry peeps! Apply for flair to make top level replies in AskCarSales.",
        "score": 242,
        "url": "https://www.reddit.com/r/askcarsales/comments/13uzed7/heads_up_industry_peeps_apply_for_flair_to_make/",
        "content": "This subreddit has grown *a lot* in the last few years. Not only professionals providing advice, but also casual bystanders wanting validation for their opinions. The problem is that the noise to signal ratio has gotten to the point where people looking for advice come away more confused than when they asked the question - or worse yet, act on unqualified bad advice.  \n\nIf you are in the industry in some professional capacity, [message the mods](https://www.reddit.com/message/compose/?to=/r/askcarsales) for how to acquire flair.\n\nFor all who do **not** work in the industry but wish to provide advice, you will need to wait until a flaired individual responds before you can comment under their reply.\n\nFlaired members in good standing, if you see someone posting bad advice under your comment, report it.",
        "num_comments": 228,
        "comments": [
            "Good luck everyone. I'm still not interested in providing my personal info to anyone on reddit, but completely get the necessity of this.",
            "Makes a lot of sense! \nIt’s r/askcarsales not r/asksomedudethatlastboughtacarin2017",
            "Does this mean that now only flaired contributors can make top-level comments?",
            "It would probably be a good idea to update the \"READ THIS FIRST\" section to say something like: \"Top level comments can only be made by flaired users. Anyone with flair has submitted proof to the mod team and has the specific industry knowledge needed to answer questions. If you need flair, message the mods. If you don't qualify for flair and would still like to contribute please be respectful and reply to any top level, flaired comments with your relevant information.\"",
            "I understand this, but I’m really going to miss disputing all the bad advice. On the other hand it’ll be nice not to get downvoted for stating the truth.",
            "I often found that I have stopped replying because I and other flaired users get buried by 400 comments from \"guy in sandals and socks with a notebook who watched a YouTube video before he bought his last 'new' car in 2011\". Great changes.",
            "I always like providing feedback, but sometimes I see a thread so far gone that there’s no saving it. Hopefully this helps.",
            "This sub has needed this for a long time. I’m glad to see the change",
            "Finally, this a great change. Now I need one of the mods to message me back so I can get flaired.",
            "Looking forward to the change."
        ]
    },
    "Do you really want to become a car salesperson?": {
        "title": "Do you really want to become a car salesperson?",
        "score": 149,
        "url": "https://www.reddit.com/r/askcarsales/comments/1d4y11a/do_you_really_want_to_become_a_car_salesperson/",
        "content": "It seems like more and more people are asking about if car sales is the right career for them.  Below are my observations on the industry and hopefully it helps you make a better decision.  \n\n  \nCar sales can be an extremely rewarding profession with professional growth opportunities and a wide variety of positions.  While this can come with above average pay, it also tends to come with below average benefits, above average hours worked, and inconsistent pay.  Hours and pay will vary by location, store pay plan, and store performance.  \n\nSalesperson Schedule and Pay Progression\n\n* Year 0-3, the first few years at any job tend to be the toughest, car sales is no different.  Many dealer groups offer 0 vacation time to new employees before the 1 year mark.  For the first 2-3 years, Green Peas (new salespeople) will likely work 50-70 hours per week, with many of them skipping their day off to work.  While this is not a requirement, car sales is very much \"get out what you put in\" and you have to be at the store to help customers.  Pay during this time may be all commission or a small base plus commission.  Either way, earnings will likely be <65-80k.  \n*  Year 3-5 is the next step.  The car salesperson should now start seeing repeat and referral business.  This not only means more sales, but also a chance at less work.  Since salespeople at this stage have more business coming in, they may start to work less and see the occasional 45 hour week.  Most weeks will be in the 50 hour range with some hitting 60.  At this stage, earnings will likely be in the <$90k range for the above average performer and <$130k for the great ones.  At most stores this is the point where someone may begin to be considered for a promotion.  \n*  Year 5+ is relatively steady.  The salesperson now has an established book of business with a strong sales base from repeat and referral business.  This will get better and better over time, but now is when the real difference starts to show.  People that are still in the business at this point will forever be able to make a career out of it.  At this point, the hours are much better with the occasional <40hr week with most weeks in the 45-50hr range.  While income is relatively unchanged, a new tier starts to emerge at >$150k.  While not at every store, they exist with some breaking $200k+.\n\nSalesperson Income Breakdown\n\n* 50% of sales people in the industry make <$65k.  This will not be their career and they will be on the chopping block if cuts need to be made.\n* 30% make <$90k.  These people can make a career out of car sales and will always have a job.\n* 18% make <$130k.  These people are above average performers and often the top salesperson at their store.\n* 2% make >$150k.  While not at every store, these salespeople have mastered the job.  They have great repeat and referral business.  They also tend to be more autonomous, closing their own deals and working as needed.  \n\nCar Sales Career Progression Track\n\nCareer growth at most stores follows a similar path with the majority of promotions coming from within.  It is rare that a store hires someone from another store and promotes them, the main exception to this is the jump to GSM and GM.\n\n* 3-5 years as a consistent high performer and a promotion to F&I becomes a real option.  F&I handle all of the paperwork and financing, they no longer have to go on test drives, but they are still selling in one form or another.  They tend to work long hours since they are the final touchpoint for a customer.  Depending on the store set up, this could mean 50-60 hour weeks.  Pay can range from $100k-$200k+.  \n* 2-4 years as a strong performer in F&I and a promotion to Sales Manager becomes and option (some stores will break off here with the option of a Used Car Manager, or Commercial/Fleet Manager).  Much like F&I the managers need to be present and will often work over 50 hours.  Pay can range from $120k-$250k+  \n* 2-6 years as a strong Sales Manager and promotion to GSM becomes an option.  At this stage you are leading the entire sales department, at many stores they may also be a floor manager that desks deals.  They likely work <50 hours a week unless they are filling in for someone.  Pay can range from $200k to over $400k.  \n* 4-6 years as a strong GSM and promotion to GM becomes an option.  This is the top position at most stores (save the occasional dealer principal/owner that also works).  They are experts at selling cars and usually have over a decade of strong performance in every position.  They can fill in any gaps as needed.  At some stores they may have also done some stints in Parts & Service just to experience them.  They usually work <45 hours a week.  Pay can range from $300k to $800k+\n\nIs Car Sales Right For You?\n\n* Do you enjoy talking to people?, While you do not need to be the life of the party, talking to strangers should not scare you.  \n* Are you capable of memorizing things like car features and available colors?  While you do not need to be an expert and know the torque setting of the nuts on the rear differential, you will be expected to have a general knowledge of available features on your brand's vehicles as well as things like available colors, interiors and the like.  \n* Are you able to regularly work long hours?  While later in the career the hours become more manageable, early on you are working all the time, and dinner will often be after 6pm.  \n* Are you able to manage your money?  While making this a career can be financially rewarding, it is inconsistent.  Some months might be $2k and others might be $10k, so you need to be able to save from the good months to survive the bad ones.  ",
        "num_comments": 89,
        "comments": [
            "Shit. I'm at the 5+ year mark and I still wonder if I want to become a salesperson 🤣",
            "This is a hell of a breakdown. As a member of the 2%. I agree with all of these findings. This should honestly be pinned.",
            "I’m a little over 2 years in now and it’s just now at the point where I’m consistently hitting 10+ cars a month (10 or more is solid at my store, smallish town low volume Toyota pre owned). First year I made $52k, year 2 came out to about $58k, I’m tracking for $70k-$80k this year. I’m realizing how much I still have to learn, but I’m also a lot more confident and comfortable now than I used to be, I ask better questions and get my customers further through the process. I’m also better about not getting in my own head and psyching myself out of sales. Got salesman of the month in February and April, definitely feeling good about my future. I started at 19 and I’ll be 22 this fall, still not sold on making a lifelong career out of the car business but blessed to be where I am right now.",
            "It’s wild to me a GM at a successful store could work less than 45 hours a week. Our GM works the same, if not more hours than us Sales Managers. I suppose for a large corporate store it’s not surprising. I don’t know how they would effectively lead.  GM isn’t the top for us though. Top GMs go corporate so I suppose there’s more incentive there.",
            "As a member of the 2% who got out of the game, please to anyone reading this don’t do it. Getting out was the best thing I ever did for mine and my family’s lives.",
            "Interesting. I've been selling for 7 years now, and I've been pretty consistent making that $65k. I am not a top performer consistently, I'll admit. I'm average to above average, but I don't show up an hour early and leave an hour late.\n\nI also don't really want to go into management. I kinda like the groove I've figured out, how to get customers to come back for me, and I earn enough. I'm sure I'd do well as a finance or sales manager, I just don't really want to.",
            "Nice write-up. As a 15+ year car guy, I think this is accurate.",
            "GSM in the UK are usually on 70-80k a year..\n300-800k is crazy money when you don’t take the cost of living differences into account",
            "Well shit I sell furniture and made 140k last year on 35 hours a week. A luxury dealer wants me and I been debating for a few months now since a couple ppl I know supposedly makes well over 170k doing cars",
            "Great post. One of the last professions you can start at the bottom and work your way to the top. If you commit at the beginning (which most people don’t) it can really pay off, especially with little to no edu."
        ]
    },
    "Bought a car, but now being told we owe more": {
        "title": "Bought a car, but now being told we owe more",
        "score": 8,
        "url": "https://www.reddit.com/r/askcarsales/comments/1dr9xti/bought_a_car_but_now_being_told_we_owe_more/",
        "content": "Bought a car last week in MA, and traded in my wife's current car which had \\~$2400 balance left on it. Salesman told us that they'd pay off the balance + give is $12k towards the new car. All the paperwork says \"no balance on trade in\".\n\nYesterday they called us and told us that we made a mistake and owe the balance of the car and need to pay it before we can get the registration & Inspection. We already have the title, they found the issue when trying to get the one for the trade in.\n\nAre we obligated to go back and pay? We were either lied to by the salesman, or the finance people realize that the salesman fucked up. Anyone know? We have an appointment to talk to the finance guy, salesman, & gen mgr today to discuss.",
        "num_comments": 7,
        "comments": [
            "You owe the dealer the title to the car that you sold them, and you have a financial responsibility against that title.  So yes, you owe the dealer the money.  In all of the paperwork you signed, there will be verbiage somewhere saying that you agree to provide them the title to the trade.\n\nI'm not saying that it doesn't sound like rookie hour at that dealership.  Obviously there was a misunderstanding, but that won't erase your debt on your car that you traded in.",
            "Please review our most [Frequently Asked Questions](/r/askcarsales/wiki/index) to see if your question has already been answered.\n\nYou may find these sections particularly useful;\n\n* [How to pick a car?](/r/askcarsales/wiki/vehicle_selection) You might also have luck in the /r/whatcarshouldibuy subreddit. \n\nAlso remember to add flair to your post by clicking the \"Flair\" link beneath it. This lets us know where you're located so we can assist you better.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*",
            "***Thanks for posting, /u/drhbball14! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of anything.***\n\nBought a car last week in MA, and traded in my wife's current car which had \\~$2400 balance left on it. Salesman told us that they'd pay off the balance + give is $12k towards the new car. All the paperwork says \"no balance on trade in\".\n\nYesterday they called us and told us that we made a mistake and owe the balance of the car and need to pay it before we can get the registration & Inspection. We already have the title, they found the issue when trying to get the one for the trade in.\n\nAre we obligated to go back and pay? We were either lied to by the salesman, or the finance people realize that the salesman fucked up. Anyone know? We have an appointment to talk to the finance guy, salesman, & gen mgr today to discuss.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*"
        ]
    },
    "Exchange policy being offered is suspicious": {
        "title": "Exchange policy being offered is suspicious",
        "score": 2,
        "url": "https://www.reddit.com/r/askcarsales/comments/1drax3v/exchange_policy_being_offered_is_suspicious/",
        "content": "I’m in Canada. I’ve asked and have been told that the dealership has a 7 day exchange policy where I confirmed about 10 times that I will be putting close to 1,000KM and was told no problem bring it back within 7 days, we will exchange (for full value I paid on the car, such asif I buy it for 20+tax, I also get 20+tax back) you out for another car if you don’t like it. Now once back, I went to go switch up the Ford F150 (which i only wanted to use for work but now it’s done) for a Honda civic and have been told i might not get approved because its not that simple. How is it not that simple when I carry no negative equity? The civic is a year newer too. They also said they will try their best but we need to wait up to 2 weeks for the first payment to go out?",
        "num_comments": 3,
        "comments": [
            "So...let me get this straight......\n\nYou used a dealer's truck for a week for a job, and now want to abuse their return policy to actually purchase a car?  If I read this correctly, THIS is why we don't lend vehicles overnight or have any sort of exchange policy. Kind of a dick move, no??",
            "Please review our most [Frequently Asked Questions](/r/askcarsales/wiki/index) to see if your question has already been answered.\n\nYou may find these sections particularly useful;\n\n* [How to pick a car?](/r/askcarsales/wiki/vehicle_selection) You might also have luck in the /r/whatcarshouldibuy subreddit. \n\nAlso remember to add flair to your post by clicking the \"Flair\" link beneath it. This lets us know where you're located so we can assist you better.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*",
            "***Thanks for posting, /u/newplayer28! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of anything.***\n\nI’m in Canada. I’ve asked and have been told that the dealership has a 7 day exchange policy where I confirmed about 10 times that I will be putting close to 1,000KM and was told no problem bring it back within 7 days, we will exchange (for full value I paid on the car, such asif I buy it for 20+tax, I also get 20+tax back) you out for another car if you don’t like it. Now once back, I went to go switch up the Ford F150 (which i only wanted to use for work but now it’s done) for a Honda civic and have been told i might not get approved because its not that simple. How is it not that simple when I carry no negative equity? The civic is a year newer too. They also said they will try their best but we need to wait up to 2 weeks for the first payment to go out?\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*"
        ]
    },
    "Certified Pre-Owned $1200 service fee before buying?": {
        "title": "Certified Pre-Owned $1200 service fee before buying?",
        "score": 2,
        "url": "https://www.reddit.com/r/askcarsales/comments/1dranzf/certified_preowned_1200_service_fee_before_buying/",
        "content": "I inquired about a certified pre owned Mazda CX-50 SUV with the full trim package (turbo premium) from the dealership and on the quote there is a $1,200 “Pre-Delivery Service Fee” added. It’s a 2023 vehicle with 28k miles and looks brand new, and it’s KBB value on the vin maxes out at $3000 lower than the sticker price (sticker is $33k). Shouldn’t the car already be good to go, hence it’s Certification? $1,200 of service seems like a lot. Conveniently, this fee plus tax negates the value of my trade in, bringing me right back to sticker price. Seems like a rip-off?\n",
        "num_comments": 2,
        "comments": [
            "Please review our most [Frequently Asked Questions](/r/askcarsales/wiki/index) to see if your question has already been answered.\n\nYou may find these sections particularly useful;\n\n* [How to pick a car?](/r/askcarsales/wiki/vehicle_selection) You might also have luck in the /r/whatcarshouldibuy subreddit. \n\nAlso remember to add flair to your post by clicking the \"Flair\" link beneath it. This lets us know where you're located so we can assist you better.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*",
            "***Thanks for posting, /u/Bdiscotf! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of anything.***\n\nI inquired about a certified pre owned Mazda CX-50 SUV with the full trim package (turbo premium) from the dealership and on the quote there is a $1,200 “Pre-Delivery Service Fee” added. It’s a 2023 vehicle with 28k miles and looks brand new, and it’s KBB value on the vin maxes out at $3000 lower than the sticker price (sticker is $33k). Shouldn’t the car already be good to go, hence it’s Certification? $1,200 of service seems like a lot. Conveniently, this fee plus tax negates the value of my trade in, bringing me right back to sticker price. Seems like a rip-off?\n\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*"
        ]
    }
}