{
    "Heads up industry peeps! Apply for flair to make top level replies in AskCarSales.": {
        "title": "Heads up industry peeps! Apply for flair to make top level replies in AskCarSales.",
        "score": 243,
        "url": "https://www.reddit.com/r/askcarsales/comments/13uzed7/heads_up_industry_peeps_apply_for_flair_to_make/",
        "content": "This subreddit has grown *a lot* in the last few years. Not only professionals providing advice, but also casual bystanders wanting validation for their opinions. The problem is that the noise to signal ratio has gotten to the point where people looking for advice come away more confused than when they asked the question - or worse yet, act on unqualified bad advice.  \n\nIf you are in the industry in some professional capacity, [message the mods](https://www.reddit.com/message/compose/?to=/r/askcarsales) for how to acquire flair.\n\nFor all who do **not** work in the industry but wish to provide advice, you will need to wait until a flaired individual responds before you can comment under their reply.\n\nFlaired members in good standing, if you see someone posting bad advice under your comment, report it.",
        "num_comments": 228,
        "comments": [
            "Good luck everyone. I'm still not interested in providing my personal info to anyone on reddit, but completely get the necessity of this.",
            "If I understand the new rules properly, once a flaired user(I guess that is the small writing below ones name) posts than normal every day folks are allowed to post?\n\nI generally will only provide advice if I personally have experience with something or if someone I know went through what the OP is experiencing which for me is very very rare, where I enjoy posting are side questions to simply learn more about the industry because I genuinely enjoy \"inside baseball\".\n\nAre side questions still allowed or is that now no longer acceptable?\n\nEither way, I truly appreciate this sub and the helps that the users provide.",
            "Makes a lot of sense! \nIt’s r/askcarsales not r/asksomedudethatlastboughtacarin2017",
            "Does this mean that now only flaired contributors can make top-level comments?",
            "Finally.",
            "It would probably be a good idea to update the \"READ THIS FIRST\" section to say something like: \"Top level comments can only be made by flaired users. Anyone with flair has submitted proof to the mod team and has the specific industry knowledge needed to answer questions. If you need flair, message the mods. If you don't qualify for flair and would still like to contribute please be respectful and reply to any top level, flaired comments with your relevant information.\"",
            "This had to be done and I applaud the change.\n\nJust an example of a ridiculous thing that happens all the time… every time an OP has buyers remorse, every single thread… someone pops in and tells them they have a cool off period or x amount of time to return a car. I remember one time some lurker told an OP they had 60 days… all of us know this isn’t even close to true, but it happens in every.single.thread\n\nThe sub is askcarsales, not askaguymakingaguessbasedoffa10yearoldblog. You might not like the answer but when 20 people are telling you the same thing, even if we all get downvoted, it doesn’t mean it’s wrong.",
            "I understand this, but I’m really going to miss disputing all the bad advice. On the other hand it’ll be nice not to get downvoted for stating the truth.",
            "I often found that I have stopped replying because I and other flaired users get buried by 400 comments from \"guy in sandals and socks with a notebook who watched a YouTube video before he bought his last 'new' car in 2011\". Great changes.",
            "I always like providing feedback, but sometimes I see a thread so far gone that there’s no saving it. Hopefully this helps."
        ]
    },
    "Do you really want to become a car salesperson?": {
        "title": "Do you really want to become a car salesperson?",
        "score": 145,
        "url": "https://www.reddit.com/r/askcarsales/comments/1d4y11a/do_you_really_want_to_become_a_car_salesperson/",
        "content": "It seems like more and more people are asking about if car sales is the right career for them.  Below are my observations on the industry and hopefully it helps you make a better decision.  \n\n  \nCar sales can be an extremely rewarding profession with professional growth opportunities and a wide variety of positions.  While this can come with above average pay, it also tends to come with below average benefits, above average hours worked, and inconsistent pay.  Hours and pay will vary by location, store pay plan, and store performance.  \n\nSalesperson Schedule and Pay Progression\n\n* Year 0-3, the first few years at any job tend to be the toughest, car sales is no different.  Many dealer groups offer 0 vacation time to new employees before the 1 year mark.  For the first 2-3 years, Green Peas (new salespeople) will likely work 50-70 hours per week, with many of them skipping their day off to work.  While this is not a requirement, car sales is very much \"get out what you put in\" and you have to be at the store to help customers.  Pay during this time may be all commission or a small base plus commission.  Either way, earnings will likely be <65-80k.  \n*  Year 3-5 is the next step.  The car salesperson should now start seeing repeat and referral business.  This not only means more sales, but also a chance at less work.  Since salespeople at this stage have more business coming in, they may start to work less and see the occasional 45 hour week.  Most weeks will be in the 50 hour range with some hitting 60.  At this stage, earnings will likely be in the <$90k range for the above average performer and <$130k for the great ones.  At most stores this is the point where someone may begin to be considered for a promotion.  \n*  Year 5+ is relatively steady.  The salesperson now has an established book of business with a strong sales base from repeat and referral business.  This will get better and better over time, but now is when the real difference starts to show.  People that are still in the business at this point will forever be able to make a career out of it.  At this point, the hours are much better with the occasional <40hr week with most weeks in the 45-50hr range.  While income is relatively unchanged, a new tier starts to emerge at >$150k.  While not at every store, they exist with some breaking $200k+.\n\nSalesperson Income Breakdown\n\n* 50% of sales people in the industry make <$65k.  This will not be their career and they will be on the chopping block if cuts need to be made.\n* 30% make <$90k.  These people can make a career out of car sales and will always have a job.\n* 18% make <$130k.  These people are above average performers and often the top salesperson at their store.\n* 2% make >$150k.  While not at every store, these salespeople have mastered the job.  They have great repeat and referral business.  They also tend to be more autonomous, closing their own deals and working as needed.  \n\nCar Sales Career Progression Track\n\nCareer growth at most stores follows a similar path with the majority of promotions coming from within.  It is rare that a store hires someone from another store and promotes them, the main exception to this is the jump to GSM and GM.\n\n* 3-5 years as a consistent high performer and a promotion to F&I becomes a real option.  F&I handle all of the paperwork and financing, they no longer have to go on test drives, but they are still selling in one form or another.  They tend to work long hours since they are the final touchpoint for a customer.  Depending on the store set up, this could mean 50-60 hour weeks.  Pay can range from $100k-$200k+.  \n* 2-4 years as a strong performer in F&I and a promotion to Sales Manager becomes and option (some stores will break off here with the option of a Used Car Manager, or Commercial/Fleet Manager).  Much like F&I the managers need to be present and will often work over 50 hours.  Pay can range from $120k-$250k+  \n* 2-6 years as a strong Sales Manager and promotion to GSM becomes an option.  At this stage you are leading the entire sales department, at many stores they may also be a floor manager that desks deals.  They likely work <50 hours a week unless they are filling in for someone.  Pay can range from $200k to over $400k.  \n* 4-6 years as a strong GSM and promotion to GM becomes an option.  This is the top position at most stores (save the occasional dealer principal/owner that also works).  They are experts at selling cars and usually have over a decade of strong performance in every position.  They can fill in any gaps as needed.  At some stores they may have also done some stints in Parts & Service just to experience them.  They usually work <45 hours a week.  Pay can range from $300k to $800k+\n\nIs Car Sales Right For You?\n\n* Do you enjoy talking to people?, While you do not need to be the life of the party, talking to strangers should not scare you.  \n* Are you capable of memorizing things like car features and available colors?  While you do not need to be an expert and know the torque setting of the nuts on the rear differential, you will be expected to have a general knowledge of available features on your brand's vehicles as well as things like available colors, interiors and the like.  \n* Are you able to regularly work long hours?  While later in the career the hours become more manageable, early on you are working all the time, and dinner will often be after 6pm.  \n* Are you able to manage your money?  While making this a career can be financially rewarding, it is inconsistent.  Some months might be $2k and others might be $10k, so you need to be able to save from the good months to survive the bad ones.  ",
        "num_comments": 88,
        "comments": [
            "Shit. I'm at the 5+ year mark and I still wonder if I want to become a salesperson 🤣",
            "This is a hell of a breakdown. As a member of the 2%. I agree with all of these findings. This should honestly be pinned.",
            "I’m a little over 2 years in now and it’s just now at the point where I’m consistently hitting 10+ cars a month (10 or more is solid at my store, smallish town low volume Toyota pre owned). First year I made $52k, year 2 came out to about $58k, I’m tracking for $70k-$80k this year. I’m realizing how much I still have to learn, but I’m also a lot more confident and comfortable now than I used to be, I ask better questions and get my customers further through the process. I’m also better about not getting in my own head and psyching myself out of sales. Got salesman of the month in February and April, definitely feeling good about my future. I started at 19 and I’ll be 22 this fall, still not sold on making a lifelong career out of the car business but blessed to be where I am right now.",
            "It’s wild to me a GM at a successful store could work less than 45 hours a week. Our GM works the same, if not more hours than us Sales Managers. I suppose for a large corporate store it’s not surprising. I don’t know how they would effectively lead.  GM isn’t the top for us though. Top GMs go corporate so I suppose there’s more incentive there.",
            "As a member of the 2% who got out of the game, please to anyone reading this don’t do it. Getting out was the best thing I ever did for mine and my family’s lives.",
            "13 years here. Over 3500+ transactions. 90% of my business is repeat and referrals. (Now)\n\nHave worked with over 300+ sales people at the same place. 3 stores, etc. most people sold 10 cars a month. I’ve never worked with a single person who averaged over 25, who wasn’t heavily fed or extremely agressive and basically over promised and under delivered everything.\n\nOther than that, the OP covers lots of great points. I never would have told you in HS or college that I’ve be in sales/selling cars. Luckily I know lots of people and have a good reputation.\n\nIgnoring COVID, the average car salesperson in America makes around $22 (really less) an hour….working over 50 hours a week. ($46,000) You have to decide if a 2-4 year slog of $2000-$5000 a month is worth it to you.\n\nIf you want to make it a long term thing you need to figure your market and your competition.  I couldn’t work at a store with minimal traffic, low volume etc, would be too slow paced for me personally.  Without my repeat business, I’d probably sell 8-10 cars a month….after selling for 13 years.",
            "I got out of the industry 6 months ago, and was in for 6 years. Started at 21 in BDC (something I think everyone should have experience in), and made way to Sales. I was in the $140-150k a year group. \n\nAs advice, please be aware not every dealership is the same, your pay, how many you sell, how many hours you work, is all dependent on so many things involving that dealership.\n\nYou can make garbage money at a store you would think has all their shit together, and you can make outstanding money at a place you wouldn’t think you’d ever make a dime at. All of this depends on management, how they run things, how much on marketing they spend, how much experience they have in the industry, etc.. etc..\n\nIt may take you 3-5 dealerships till you find the one that works for what you’re looking for.\n\nI’d recommend everyone try it out at least, sales is such a diverse skill to have which can lead you to many different areas, and you can use it for the rest of your life basically.",
            "Excellent analysis. I’m a green pea in the biz (7 months so far) but have family and friends in the business and the progression is accurate.\n\nWhat I learned as a green pea is to make good money starting out you need to man the station as much as possible, for the chance a customer walks in/ calls to buy. You can be working 50-60 hours just for a customer to walk in. People who aren’t buying this month can waste your time and buy next month or next 2+ months. While complete randoms will walk in and just buy without  driving a car.\n\nAnother thing to note is that typically around 10% or less of your clients will actually buy when starting out. I work in EVs so it is a very niche market. New incentives and ads have increased traffic for us. But for about 70 or so clients I’ve had walk in and call up only 10 purchased this month, with around 4 slotted for next month. The amount of follow up resulting in being ghosted, blocked, no longer interested despite all the work can be infuriating. Get used to customer excuses of “let me think this over” to be the telltale sign of “I can’t afford this vehicle but I want to let you down gently instead/ lead you on instead of being straight forward with you”.\n\nNext thing people need to realize is that a majority of customers are COMPLETE FUCKING MORONS. I tried to give people the benefit of the doubt when I started out, but good god the amount of idiots I deal with daily is fucking astounding. I can go on and on about how people want to be at an ultra low payment with nothing down on a 60k vehicle, or how customers don’t want to pay taxes, or customers with bad credit leading me on, etc.\n\nYou need thick skin to work in car sales. Both your coworkers and customer can be assholes. There is a general mistrust of car salespeople, and those negative stereotypes are warranted. But the amount of asshole, greedy, slimy customers that walk in is just as equal. If you can’t take being backed into a corner during negotiations by a customer, or being yelled and belittled by your boss weekly, don’t work in car sales. \n\nThe paycheck is not consistent, I’ve begun to believe it is mostly just luck now who walks in to buy because I do not have a referral base. And I still don’t have a referral base after working here for 7 months. It’s all fresh ups, and once my clients get what they want they never call up again.\n\nLastly, the market ebs and flows. Right now the market is dookie. Especially for EVs since there are charging fears and the fact that our vehicles are so damn expensive in this current recession. Two years ago used car sales was astronomical and people were trading in like crazy. Now? My job may go bust based on who gets elected in November…\n\nIf you are thinking about doing car sales do your research before joining.",
            "Interesting. I've been selling for 7 years now, and I've been pretty consistent making that $65k. I am not a top performer consistently, I'll admit. I'm average to above average, but I don't show up an hour early and leave an hour late.\n\nI also don't really want to go into management. I kinda like the groove I've figured out, how to get customers to come back for me, and I earn enough. I'm sure I'd do well as a finance or sales manager, I just don't really want to.",
            "Nice write-up. As a 15+ year car guy, I think this is accurate."
        ]
    },
    "Get out of loan for “totaled” car that still has ~$10k left": {
        "title": "Get out of loan for “totaled” car that still has ~$10k left",
        "score": 47,
        "url": "https://www.reddit.com/r/askcarsales/comments/1dlanvg/get_out_of_loan_for_totaled_car_that_still_has/",
        "content": "I feel like this situation is more common than it seems and can be answered easily, I just don’t know the right place to start. \n\n2018 Ford Escape, 1.5L Ecoboost\nFinanced for $18k in Nov 2021 (rough used car market, needed something bigger for new baby and doggos) at 6% APR, with 80k miles. \n\nThis car was designed by a sadistic psychopath because every aspect of maintenance is a disaster, then the transmission blows in summer 2023. Directly after we got back from a vacation. Ya know… where we had loose, usable money set aside for a purpose that would have been repurposed for this. But nah, she betrayed us perfectly. \n\nMechanic friend saves our life by offering to drive to pick up the 200+lbs junked transmission and wastes a four-day weekend doing the majority of the work replacing it while I watched and was the Get Me Uh guy. That guy’s awesome. We have a vehicle again, and it cost around $3k total to fix. \n\nUh oh, during the replacement we saw that there was mechanic clay marker writing on the broken trans just like the junked trans… Fresh transmissions from manufacturer don’t have all that writing on them. So is this the 3rd trans to be in this vehicle? \n\nAll that’s besides the point because the shit blows up again Jan 2024. No fuckin oil and the engine seized up because of a brand new leak we didn’t know about. Thing is sitting on the curb where it was towed to this day, hence the “totaled” in the title. I know this doesn’t mean it’s literally totaled until an inspector or whatever checks it out. \n\nNow we have a new vehicle (much cheaper, irrelevant to this debacle) so we’re paying two loan payments and two insurance payments for one functional vehicle. Is there something I can do with the bank for the Ford to get out of having to pay full-coverage insurance on a vehicle that doesn’t move? We’re happy to continue and just pay off the loan, we’re not gonna get much better than 6% APR, I just don’t want to waste the money on insurance. \n\nAlso, not sure if this is an applicable subreddit but I saw similar posts. Thanks for any advice. ",
        "num_comments": 52,
        "comments": [
            "Have you checked with your insurance company? Mine has an option for non-operational coverage that would still hit the mark for what the bank requires. It's much cheaper but if you get in a collision while the car is in that status you're obviously toast.",
            "Yes, the bank will gladly let you out of the mandatory full coverage insurance just as soon they receive a wire for the entire remaining balance.",
            "How much do you owe on the Escape today? 2.5 years of payments means hopefully you brought down that balance to like $10,000 or less?\n\nTake the car to Carmax or a Ford dealership. See what they offer, you might try calling around some dealers so that you aren't towing this thing all over town. Get a personal loan for the difference. So if you owe $12,000 and someone offers you $4,000 then you need an $8,000 personal loan. APR is irrelevant because you're going to free up the car payment and insurance payment, plus no maintenance, repairs, or registration. You're going to lean into paying off the personal loan within a year. And you didn't notice the pool of oil on the ground, you never checked your oil, the oil warning light never went off?",
            "Please review our most [Frequently Asked Questions](/r/askcarsales/wiki/index) to see if your question has already been answered.\n\nYou may find these sections particularly useful;\n\n* [Will paying in cash or a large cash down payment offer me leverage in negotiations?](/r/askcarsales/wiki/cash_down)\n* [I earn $xxxx per month, will I qualify for an auto loan or lease, and is it a good idea?](/r/askcarsales/wiki/income_to_finance)\n* [I have my score from Credit Karma but the dealership told me they got a different score. Why?](/r/askcarsales/wiki/free_credit_score)\n* [Finance FAQ's](/r/askcarsales/wiki/financing_faqs)\n* [Buy versus Lease](/r/askcarsales/wiki/buy_vs_lease)\n* [How to pick a car?](/r/askcarsales/wiki/vehicle_selection) You might also have luck in the /r/whatcarshouldibuy subreddit. \n\nAlso remember to add flair to your post by clicking the \"Flair\" link beneath it. This lets us know where you're located so we can assist you better.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*",
            "***Thanks for posting, /u/AwarenessMinimum2932! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of anything.***\n\nI feel like this situation is more common than it seems and can be answered easily, I just don’t know the right place to start. \n\n2018 Ford Escape, 1.5L Ecoboost\nFinanced for $18k in Nov 2021 (rough used car market, needed something bigger for new baby and doggos) at 6% APR, with 80k miles. \n\nThis car was designed by a sadistic psychopath because every aspect of maintenance is a disaster, then the transmission blows in summer 2023. Directly after we got back from a vacation. Ya know… where we had loose, usable money set aside for a purpose that would have been repurposed for this. But nah, she betrayed us perfectly. \n\nMechanic friend saves our life by offering to drive to pick up the 200+lbs junked transmission and wastes a four-day weekend doing the majority of the work replacing it while I watched and was the Get Me Uh guy. That guy’s awesome. We have a vehicle again, and it cost around $3k total to fix. \n\nUh oh, during the replacement we saw that there was mechanic clay marker writing on the broken trans just like the junked trans… Fresh transmissions from manufacturer don’t have all that writing on them. So is this the 3rd trans to be in this vehicle? \n\nAll that’s besides the point because the shit blows up again Jan 2024. No fuckin oil and the engine seized up because of a brand new leak we didn’t know about. Thing is sitting on the curb where it was towed to this day, hence the “totaled” in the title. I know this doesn’t mean it’s literally totaled until an inspector or whatever checks it out. \n\nNow we have a new vehicle (much cheaper, irrelevant to this debacle) so we’re paying two loan payments and two insurance payments for one functional vehicle. Is there something I can do with the bank for the Ford to get out of having to pay full-coverage insurance on a vehicle that doesn’t move? We’re happy to continue and just pay off the loan, we’re not gonna get much better than 6% APR, I just don’t want to waste the money on insurance. \n\nAlso, not sure if this is an applicable subreddit but I saw similar posts. Thanks for any advice. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*",
            "Yes - \"storage insurance\". It is pretty cheap.",
            "I just showed this to a guy I’m closing a deal on to sell GAP!",
            "Most insurance companies have comp only \"storage\" coverage but most lenders will force place insurance if a vehicle with a loan doesn't have full coverage.",
            "Option if you are able: lease a vehicle with a good amount down and wrap the debt of your junk car in the lease.  At the end of the lease you will be out.  Not all leases will be able to hold 10k over, but some will or if you have 4-7k to put down you can hopefully get it approved.",
            "May actually be able to tell the insurance company the vehicle is in storage and it drops. That’s what we did in the military for deployments"
        ]
    },
    "Salesman won't disclose the capitalized cost of a lease": {
        "title": "Salesman won't disclose the capitalized cost of a lease",
        "score": 11,
        "url": "https://www.reddit.com/r/askcarsales/comments/1dlkmhj/salesman_wont_disclose_the_capitalized_cost_of_a/",
        "content": "Chevy dealership on Long Island. The salesman refuses to disclose what the capitalized cost is for the vehicle and will only negotiate based on monthly payments and down payment. He said until we do the deal at the desk level he won't disclose how they've valued the car. Is this normal? ",
        "num_comments": 23,
        "comments": [
            "That doesn’t make much sense considering negotiating the monthly payment is at the “desk level”. If a salesperson is refusing to tell you the cap cost and/or breakdown, I would probably just go elsewhere.",
            "Seems kinda odd, and would be concerning if you were buying the vehicle. \n\n\nBut since you're leasing if the monthly payment and down payment are the amounts you want does the cap cost *really* matter? ",
            "If he refuses, leave.  That’s all there is to it.",
            "Half my salespeople don't even know what a capitalized cost is.",
            "Smell ya later",
            "Please review our most [Frequently Asked Questions](/r/askcarsales/wiki/index) to see if your question has already been answered.\n\nYou may find these sections particularly useful;\n\n* [I earn $xxxx per month, will I qualify for an auto loan or lease, and is it a good idea?](/r/askcarsales/wiki/income_to_finance)\n* [I have my score from Credit Karma but the dealership told me they got a different score. Why?](/r/askcarsales/wiki/free_credit_score)\n* [I want to get out of my leased vehicle, what are my options?](/r/askcarsales/wiki/early_lease_termination)\n* [Leasing a vehicle with a down payment – is it a good idea?](/r/askcarsales/wiki/lease_down_payment)\n* [I want to buy out my lease, what are my options? What can I negotiate?](/r/askcarsales/wiki/lease_buyout)\n* [How to calculate a lease yourself](/r/askcarsales/wiki/calculate_a_lease)\n* [How to pick a car?](/r/askcarsales/wiki/vehicle_selection) You might also have luck in the /r/whatcarshouldibuy subreddit. \n\n   Also remember to add flair to your post by clicking the \"Flair\" link beneath it. This lets us know where you're located so we can assist you better.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*",
            "***Thanks for posting, /u/RTMAL11! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of anything.***\n\nChevy dealership on Long Island. The salesman refuses to disclose what the capitalized cost is for the vehicle and will only negotiate based on monthly payments and down payment. He said until we do the deal at the desk level he won't disclose how they've valued the car. Is this normal? \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*",
            "Well leasing is all about the monthly payment.",
            "I hear you but, but the salesmen was telling me I qualified for all of these incentives that took, say $5k off. But off WHAT? If I qualify for the incentives, negotiate the price of the car and then let the manufacturer deal with the incentives they are offering the dealerships. It's odd to say \"you got off $5k\" but then refuse to tell me what it's off OF.",
            "Lol dealers love using this line when showing a pencil with a *low $200 payment only $5000 DAS*"
        ]
    },
    "What do we think the long term implications will be if CDK is down for weeks to months? ": {
        "title": "What do we think the long term implications will be if CDK is down for weeks to months? ",
        "score": 1,
        "url": "https://www.reddit.com/r/askcarsales/comments/1dlw1mf/what_do_we_think_the_long_term_implications_will/",
        "content": "The dealerships I visited in MA this week all use CDK. I signed and put a deposit down on a new car but can’t finalize or drive it off the lot until systems are back up. I still have my trade in to drive so it’s not the end of the world. \n\nWhat I’m more curious about are the implications of CDK being down weeks to months longer. How will dealerships that are reliant on CDK pivot to finalize sales? I’m assuming sales, service, and finance are in a plan for the worst hope for the best situation right now. Are you having conversations internally about bringing on supplementary services in the interim? \n",
        "num_comments": 2,
        "comments": [
            "Please review our most [Frequently Asked Questions](/r/askcarsales/wiki/index) to see if your question has already been answered.\n\nYou may find these sections particularly useful;\n\n* [How to pick a car?](/r/askcarsales/wiki/vehicle_selection) You might also have luck in the /r/whatcarshouldibuy subreddit. \n\nAlso remember to add flair to your post by clicking the \"Flair\" link beneath it. This lets us know where you're located so we can assist you better.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*",
            "***Thanks for posting, /u/RattyHealy75! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of anything.***\n\nThe dealerships I visited in MA this week all use CDK. I signed and put a deposit down on a new car but can’t finalize or drive it off the lot until systems are back up. I still have my trade in to drive so it’s not the end of the world. \n\nWhat I’m more curious about are the implications of CDK being down weeks to months longer. How will dealerships that are reliant on CDK pivot to finalize sales? I’m assuming sales, service, and finance are in a plan for the worst hope for the best situation right now. Are you having conversations internally about bringing on supplementary services in the interim? \n\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*"
        ]
    }
}