{
    "Weekly Ask Anything Thread for June 17, 2024": {
        "title": "Weekly Ask Anything Thread for June 17, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/AskCulinary/comments/1dhq7k3/weekly_ask_anything_thread_for_june_17_2024/",
        "content": "This is our weekly thread to ask all the stuff that doesn't fit the ordinary [/r/askculinary](https://www.reddit.com/r/askculinary) rules.\n\nNote that our two fundamental rules still apply: politeness remains mandatory, *and* we can't tell you whether something is safe or not - when it comes to food safety, we can only do best practices.   Outside of that go wild with it - brand recommendations, recipe requests, brainstorming dinner ideas - it's all allowed.",
        "num_comments": 20,
        "comments": [
            "This is more like a cleanliness question. Besides a splatter screen, what other tools/techniques can i use to minimize oil splatters. I like to sear bacon, fish, meats etc.",
            "this is an odd question, I don’t think there’s any good answers. One of the things I enjoy most in life is food, cooking, baking. Lately because of some depression, and continuing loss of vision I seem to be losing my passion to cook. I still immerse myself in the science of it, reading, yada yada yada. But I just can’t seem to muster up the passion that I used to have. Everything is so much more difficult to do, so much more frustrating, and not having the visual feedback, well, you can imagine what that’s like. just like to know if anyone has any ideas and how I can get my passion back, it’s truly one of the only things I have leftu",
            "I dont want to make an entire post for a single question that I havent had a proper answer to on the web.\n\nI made some food for dinner, I used some gochujang in the sauce for pulled beef. When I tasted it all I got was a really salty taste I put towards the oyster sauce and soy sauce I used. I didnt taste any spice. \n\nQue my fiance who instantly starts sweating and huffing about the spiciness of it. Note: his tolerance is 0. The spiciest thing he can eat is doritos SCH.\n\nSo, how come my food tastes spicy to him (visibly red lips and sweat) whereas all I could taste was salt?",
            "ok so back when i was a kid 90s to 2000s there was supposed to be this super sour candy and all the commercials said it was a whole new thing becase it was made from super sour anti sugar \n\ni figured it was just a gimmick but trying to look up anti sugar candy just gets me sugar free candy and how you can lose weight when you stop eating sugar  \n  \nim guessing it was **Sour sanding** or **Citric acid**   \n  \nany ideas ... im fairly sure i didn't make it up",
            "What is the best way to cook Kasekrainer without all of the cheese leaking out? I grilled on a rack on medium high and most of it seemed to come out. Fortunately I laid foil underneath so I was able to scoop it up and plate it, but I'd like to keep as much in the sausage until eating if I can!\n\nEdit: The sausages I have are actually already cooked, so it's just a case of reheating them.",
            "I HAVE A QUESTION!! I’m trying to make short grain rice for the first time in the rice cooker specifically nishiki rice what setting should I put it on?? White rice or sushi rice?",
            "I'm going on a fishing trip in Canada soon, catching mostly walleye and lake trout. This is our second time doing it, and we're looking for ways to do more than fried fish every night. Any ideas? Already considering fish tacos, ceviche, and Thai fish cakes, and that might be good enough, but I'd love to get some other thoughts. Can't find much inspiration from google under all the fish fry recipes. Thanks!",
            "made beef stragnoff using [recipe ](https://www.taste.com.au/recipes/beef-stroganoff-4/3574df69-6fc1-4473-a0a6-582ff24c8779)and i thought to simmer it a little longer than the recipe using rump steak, however it tasted more chewy and less flavourful compared to the first 5 minutes of simmering. i simmer it for around 30 minutes as i thought it would develop better if i cooked it like stew. \n\ni do realise this could be partly due to the rump steak and made it tasted more gamey? \n\nis there a reason it tasted worse when simmering longer? \n\nwhy does simmering work for stews but not particularly for beef stragnoff? would it have worked if it was a different cut of beef?",
            "Hi i lost power the other night from around 9 pm to 3am and was wondering if the eggs I got from the supermarket should be thrown out. I live in USA",
            "Do you think this recipe would work with store bought croutons and a longer custard soak? \n\n[https://goodiegodmother.com/kentucky-hot-brown-casserole/](https://goodiegodmother.com/kentucky-hot-brown-casserole/)"
        ]
    },
    "New Automation Tools": {
        "title": "New Automation Tools",
        "score": 11,
        "url": "https://www.reddit.com/r/AskCulinary/comments/1dckbsl/new_automation_tools/",
        "content": "Hi [/r/AskCulinary](https://www.reddit.com/r/AskCulinary) Community, mod's here.  \nReddit has recently introduced some automated tools to help us help you, when you're posting. We are working on implementing these tools and would like your help (and patience) as we roll them out. For the first phase, we're going to use a tool to give you a gentle reminder that your post may be in violation of the rules before you even post it. This certainly won't catch everything and we expect a false positive every once in a while and that's where we need your help! If you find your posts keep getting a notice and you don't think it should, please [shoot us a message](https://www.reddit.com/message/compose/?to=/r/AskCulinary) containing as much info as you can about what went wrong so we know to adjust the rules. This is a learning process for everyone involved and we thank you for your patience.",
        "num_comments": 0,
        "comments": []
    },
    "tight budget for catering on film set": {
        "title": "tight budget for catering on film set",
        "score": 4,
        "url": "https://www.reddit.com/r/AskCulinary/comments/1dltq48/tight_budget_for_catering_on_film_set/",
        "content": "I've been asked to provide catering on a student film set. It'll be 5 days of shooting, and as far as I can tell from the schedule, I'll only have to provide one meal (just lunch, though I do think it would be nice to have snacks/finger food available for the entire day). It'll be around 30 people every day and from what I can tell, the budget for catering is about $480, meaning a bit less than $100 a day. I really want to do a good job and provide good, nutritious meals, but is $100/d not too little? It'll be my first time catering and I'm a little worried about the limit of options",
        "num_comments": 10,
        "comments": [
            "I would say no, unless you're able/willing to cook. You can do snacks for $3 per person per day, but full nutritious lunch will be hard. Maybe if you did Costco wraps or something like that. \n\nIf you are willing to cook, and you've never cooked for 30 people a day for 5 days, I would not recommend that route.",
            "Would you be doing this as some kind of favour, or is this part of a business you're running?\n\nYou're working on a budget of about $3 per person per day. I don't really see how to make any profit while providing anything better than PBJs, goldfish crackers and tap water. And even then it's questionable, once you account for the time spent shopping, preparing and setting up on location. \n\nI can understand that a student film production has limited budget. But they'd probably spend more money on a homemade sandwich than they are offering you for the catering.",
            "Eh, how about pasta? Pasta e fagioli goes a long way. Bulk tortillas instead of bread. Other days can be stuff that stretches...stews with rice, soup, etc. chicken thighs can be had for cheap, marinate in some yogurt aioli and grilled or baked. Not much room for profit in any case though.",
            "You are on a ramen budget",
            "It'll be my first time catering at all, I'm only experienced in cooking for 3 people, so this is a little scary. Thank you for being honest, I'll definitely bring it up and see what can be done about the budget!",
            "Not a business at all, I was originally supposed to just manage the location as an unpaid gig, but they are now considering having me provide for the crew. I love cooking, so I thought this would definitely be doable, but now that I've done some research on catering it's all quite daunting, given the low budget. Thank you for the insight, I'll have to bring it up in the next meeting then.",
            "Those sound like some solid suggestions, thank you so much! I'll have to try my best and work with what I get",
            "rip set morale i guess",
            "Okay, I see. \n\nCooking wise things like spaghetti and meatballs, stews, curries and so on can go a long way. \n\nIf you decide to do this, please make sure you're not in violation of any local laws about cooking and serving food to others, or require any cerifications or permits for your catering.\n\nBuying premade food may be the solution, but again, that's a tight budget even for supermarket wraps and snacks",
            "I hadn't thought about that at all, thanks for bringing it up. I see there's a lot more to consider than I had originally anticipated, haha"
        ]
    },
    "How much (if any) oil is absorbed into meat when cooking?": {
        "title": "How much (if any) oil is absorbed into meat when cooking?",
        "score": 3,
        "url": "https://www.reddit.com/r/AskCulinary/comments/1dluax4/how_much_if_any_oil_is_absorbed_into_meat_when/",
        "content": "Do steaks/chicken breasts/thighs etc absorb cooking oils?  Obviously, im not talking about breaded meat.",
        "num_comments": 1,
        "comments": [
            "This depends on the cooking method.\n\nDeep frying in hot oil actually causes very little oil to be absorbed, as the moisture in thr meat rapidly turns to steam and pushes out of thr meat, preventing most oil from entering.\n\nThe vast majority of oil in fried meat is absorbed as the meat cools down after removing from the frying oil.\n\nSimilarly, steaks being seared encounter a similar mechanism.\n\nCooking in oil on low heat can cause absorption."
        ]
    },
    "What is the pre-packaged non-perishable citrus flavor component found in instant noodles such as \"Lucky me\" calamansi pansit?": {
        "title": "What is the pre-packaged non-perishable citrus flavor component found in instant noodles such as \"Lucky me\" calamansi pansit?",
        "score": 12,
        "url": "https://www.reddit.com/r/AskCulinary/comments/1dln75q/what_is_the_prepackaged_nonperishable_citrus/",
        "content": "Im trying to find out what this long shelf life product is so i can have instant citrus flavor any time on a pinch thats more concentrated than lemon juice extract. \n\nI just hate shaving limes lol",
        "num_comments": 10,
        "comments": [
            "After googling and looking over the ingredients list of that product, I see the number E330 jumping out at me. E330 is food-grade citric acid, and the naturally-occurring chemical responsible for the sour element of most citrus fruits. It also lists \"natural citrus flavour\" as an ingredient, but I'm betting citric acid is doing most of the heavy lifting here.\n\nYou can buy bags of citric acid to cook with online or from certain specialty stores if you're lucky. Just don't use too much. It's very powerful stuff.",
            "I recently discovered that you can buy powdered lemon juice in some Indian stores. I first saw it in India as a crystalline powder that looked a bit like sanding sugar. I thought it probably was just citric acid. But I've since found it labeled as dried lemon juice or powdered lemon. It's great stuff to have around if you don't have any lemons.",
            "[This](https://www.amazon.com/dp/B005ECLIUA?ref=ppx_pop_mob_ap_share) might be helpful to you.",
            "I’ve seen lime powder on Amazon while searching for red curry paste.",
            "Calamansi (a least in Vietnam) is similar to a tangerine/satsuma, etc. in the US so something orange-ish with a hint of tang. Straight citric acid/lemon juice might be too tart.",
            "You can buy packets of True Lime, which is more or less Tajín without chili.",
            "What about that lemony or citrus smell? I believe citric acid doesn't have the smell.",
            "These citrus powders you can get are often used for their imaginary healing abilities in home made cosmetic products. \n\nI've experimented in food with orange and lemon varieties, and if you're after that \"was that lemon?\" flavour they are good, but they don't have really any of the sharp citrus tang op is likely after.\n\nI did find that mixing a small amount of food grade citric acid with it was a good call though.",
            "Literally says calamansi in the name. Since the ingredients say citrus flavor it’s definitely calamansi flavor from a flavor house. If OP is looking to make a packaged product this is definitely the way to go. If they are in a restaurant, fresh calamansi purée will probably be a lot better. You can def buy this from anyone that carries Boiron purées. \n\nTo me it’s like a lime and a tangerine mixed together but with the intensity of yuzu. Just tangerine and lime zests won’t get you there.",
            "It might be powdered lemon peel."
        ]
    }
}