{
    "Weekly Discussion/General Questions Thread - June 24, 2024": {
        "title": "Weekly Discussion/General Questions Thread - June 24, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/AskDocs/comments/1dn9tzp/weekly_discussiongeneral_questions_thread_june_24/",
        "content": "**This is a weekly general discussion and general questions thread for the AskDocs community to discuss medicine, health, careers in medicine, etc.** Here you have the opportunity to communicate with AskDocs' doctors, medical professionals and general community even if you do not have a specific medical question! You can also use this as a meta thread for the subreddit, giving feedback on changes to the subreddit, suggestions for new features, etc.\n\n**What can I post here?**\n\n* General health questions that do not require demographic information\n* Comments regarding recent medical news\n* Questions about careers in medicine\n* AMA-style questions for medical professionals to answer\n* Feedback and suggestions for the [r/AskDocs](https://www.reddit.com/r/AskDocs/) subreddit\n\nYou may **NOT** post your questions about your own health or situation from the subreddit in this thread.\n\n*Report any and all comments that are in violation of our* [*rules*](https://www.reddit.com/r/AskDocs/about/rules/) *so the mod team can evaluate and remove them.*",
        "num_comments": 87,
        "comments": [
            "I just needed to vent.  On facebook I'm part of a group where people talk (among other things) about health concerns, things going on with our bodies.  Someone posted a suggestion for how to lie or fudge the truth to get a certain kind of treatment from your physician.  This really upset me and it's been on my mind all day.  What has become of mutual trust with our medical care?  Has it really come to not only second guessing our physicians' expertise but also lying/exaggerating in order to get a certain answer?  Ugh, don't know how you all do it...I did respond to the post (suggesting that the poster might consider another opinion from someone different if she didn't trust her physician) but I don't expect it will lead anywhere productive.  I don't know, it alarms me somehow, this undervaluing of medical expertise and undermining of our mutual trust.  I know there are bad physicians and physicians who aren't as informed about certain topics.  But it's always been my position that you switch docs (or at least get another opinion) rather than lie or manipulate if the trust isn't there.  Vent over.",
            "If I take a daily extended release medication, would doing a major magnesium citrate colon cleanse only 12 hours after the medication be problematic because it will flush out the second half of the medication too quickly? Maybe better to wait until 18 hours after my medication?",
            "For someone with chronic hypotension, why wouldn't it be a good idea to eat a bunch of salty and sugary junk foods regularly to raise their blood pressure, given that those are supposed to raise it?",
            "What causes a mild shocking sensation in the back of the neck that radiates to arm and feet?",
            "My daughters dr told me to give her Motrin after her 2 month shots yesterday. No fever, just discomfort, so Ive given her 2 half doses in the last 13 hours. Now family is saying (not medical pros) that ibuprofen can cause serious GI and renal damage >6 months. If dr recommended it, and baby is 90+ percentile (13lbs), is any serious or permanent damage likely to happen?",
            "For how long should I refrain from strenuous exercise before a liver enzyme test for a reliable reading? \n\nI have recently been treated with a low dose accutane and was planning to do a checkup tomorrow morning. That would be approximately 36 hours after a heavy weight lifting session.",
            "If one was vaxxed as a baby against tuberculosis(bcg) do you have any protection as an adult? Also how easy is it to catch it, online it says it has to be prolonged contact, but what does that mean, would 1h in the same room be enough?",
            "Good morning doctors, I recently came upon an article written by a dermatologist that said that washing your underarms with benzoyl peroxide in the summertime can reduce body odor because it kills bacteria that causes it. If you stop using it, does the bacteria and body odor have a rebound effect and get worse? Or is that simply not the mechanism with which it works? thank you",
            "Asking for a sciency term\n\nWhat's it called when internal tissue becomes metabolically disconnected? IE: no blood/interstitial fluid can reach it any more (which will likely go necrotic, but IDK)",
            "Doc told me to take cefixime tablet yesterday before bed. I forgot to. Can I take it in the morning today? I just woke up."
        ]
    },
    "Can my doctor (ob/gyn, not psych or PCP) threaten me with an involuntary psychiatric hold because I left a bad review?": {
        "title": "Can my doctor (ob/gyn, not psych or PCP) threaten me with an involuntary psychiatric hold because I left a bad review?",
        "score": 279,
        "url": "https://www.reddit.com/r/AskDocs/comments/1dqyekf/can_my_doctor_obgyn_not_psych_or_pcp_threaten_me/",
        "content": "I’ve seen this doctor one time. Instead of addressing my concerns, this doctor largely focused on my weight, and suggested I not sit around and eat carbs all day. (I am a VERY active person). When I asked what my goal should be, the doctor said I should lose 5 lbs.\n\nThis did not sit well with me, so I left a review. The same day, I received a call from this doctor. I truly thought that if this doctor was calling me outside of an appointment, I must have misunderstood something, because the only other times a doctor has called me was to deliver results. Instead, they asked me to take my review down and claimed I hurt their feelings, and my critique was inconsiderate because of their experience as a teenager. After I agreed to take the review down, this doctor continued to raise their voice at me and threatened to sue me. I had no idea how to respond.\n\nI took the review down. Then I saw one other review on a different site that claimed this doctor threatened them the same way for leaving a bad review.\n\nI opted to re-write my review in an objective lens, no false claims, no emotionally charged statements. I posted this morning. \n\nThis doctor then called me today saying they were concerned about my mental health because of my bad review, using my medical history as leverage. I asked the doctor to no longer contact me. They asked if I wanted to call my psychiatrist before they did to let them know they’d be receiving a call from this doctor about their concerns. I did not say yes or no. \n\nThis doctor DID call my psychiatrist, and the psychiatrist called my emergency contact to check on me. (I am fine, but obviously upset by all of this)\n\nI feel so violated that a doctor would leverage my medical history against me like this, and that they have access to very personal medical records. \n\nCan this doctor do this?? What can I do? \n\n",
        "num_comments": 22,
        "comments": [
            "Please report this man to your state medical board. This is egregious behavior.",
            "To get held involuntarily you need to demonstrate severe psychiatric dysfunction that represents an immediate danger to yourself or others. \n\nTheres more details to it than that, but for this purpose, I think it should suffice that it would not be sufficient for them to recommend you be held involuntarily without you making statements of direct threats to yourself/others",
            "Very very scary. Thanks for giving actionable steps.",
            "This is why I am afraid of defending myself when doctors do something bad to me. However, I wont let them over power me.Those psychiatrists I dealt April 23rd - May 1st were completely ignorant. They didnt believe I was suicidal at all. However, I fought back. I left and filed a complaint with the hospital, left a review on the hospital and even that one psychiatrist who shamed me for coming there for help. She said to watch what I say or else I will be locked up in a facility for weeks. Humana is currently investigating this issue, but the patient advocate did not believe the insurance claim was denied because I was not suicidal. She said she would have to view the claim herself, um she could access it herself? Thats just lazy.",
            "It's his word against hers, they believe the doctor much more",
            "Well, if she has caller ID, she can prove he called her twice.",
            "We (for better or worse) certainly do privilege the report we get from other physicians, but if I saw this story in my ER it'd be ... really weird. If a doc is saying something that isn't congruent with what the patient's presentation is, we gotta get more info.",
            "Generally others providers word does count higher. But unless the patient is showing signs that of danger to themselves or others, none of my attending will uphold an involuntary commitment petition. We have had people come in by police, with county petition already filled out, and we have denied it before and released the patient. While its def a scary threat, and def can end badly, its not as simple as she said he said",
            "Right. Imagine if it was that easy to get people access to mental healthcare.",
            "Thats not how it works.\n\nThey cant just call some gestapo police and have you picked up and thrown in a psych ward\n\nWorst case, they could make up something egregious, police swing by and bring her to the ER. Then there is a full psych evaluation. Depending on the state, thats where the decision for inpatient admission takes place.\n\nI have never seen patients brought in by police for mandatory evaluation because some doctor called them. Its usually because they were out in public demonstrating severe illness (being violent, walking around naked in traffic, held a gun in their mouth, etc)"
        ]
    },
    "Baby born with a lot of complications, don’t know what to do. Need advice": {
        "title": "Baby born with a lot of complications, don’t know what to do. Need advice",
        "score": 184,
        "url": "https://www.reddit.com/r/AskDocs/comments/1dqx15d/baby_born_with_a_lot_of_complications_dont_know/",
        "content": "\nOn June 15 my brother was born. He was carried to full term and born weighing 4120g (9lbs) and 53.5cm. A big boy! Hes been in the NICU since (2 weeks). \nMom (40F) had gestational diabetes and high blood pressure during pregnancy. \n\nHe was born with Down syndrome, AVSD (no current surgery needed), born with jaundice (clearing up well), low sp02 (he’s on and off oxygen) and has shallow irregular breathing at times, has a feeding tube (try to push bottle but usually need NG), he has an infection in his blood (not sure what exactly, is this called sepsis?), IV in his belly button for more than 10 days now. \n\nThey tried to insert a PICC line 4-5 times now unsuccessfully. They tired both arms legs and forehead. he has been moved between 2 hospitals to get this done. Now they are trying to get an IV in through somewhere other than his belly button but have already been unsuccessful once. \n\nI’m just seeking help and advice as my family is suffering and don’t know what to think or do. My mom is an immigrant and knows little to nothing about Down syndrome or the other things he has, let alone any of the technical terms the nurses and doctors tell her. She hasn’t been eating or sleeping and just cries all day, so I’ve had to step in and play a major role, yet I’m not sure how to make sense of all this, what to tell her, what questions to ask the medical teams, etc.\n\nHow serious is the blood infection? Will we see long term problems due to this? Why has the PICC line and IV been so unsuccessful? \n\nThe staff at the hospital are clearly overworked and all the beds are filled with a constant movement of babies in and out to make room. I feel we haven’t had a proper sit down for all his health problems to be thoroughly explained as there’s just no time from them. ",
        "num_comments": 31,
        "comments": [
            "Piggybacking to say that OP needs to request a medical interpreter for their mom, especially for the family meeting with the medical team. The mother deserves to hear as much information as any native speaker in this situation. Having a family member interpreting for her or summarizing the doctors words and choosing what to tell her is not a solution.",
            "Thank you for your response, we have no knowledge of how we should interact with healthcare professionals and what is within our rights, or what is to be expected as weve never been in this position. This is truly very helpful and I will do all of the things youve listed. Theres been some missed information and items when he is handed off between hospitals and staff and they turn to us to fill in the blank so I will definitely keep notes of everything moving forward. Thank you.",
            "NAD but adding on to say that we did 89 days in the NICU and the hospital social worker was invaluable to us! If they have not offered to connect you please ask them to. They can help navigate a lot of this, help set up meetings, ensure interpreters if needed are available, etc. They can also get the ball rolling on disability benefits for your brother which will help offset ongoing and long term costs associated with his care.",
            "NAD but these are stressful times for you and it's more than you should do normally as a sibling. Please make sure you can vent to someone as well. Whether it's a friend, a family member or a therapist. Also make sure you get your sleep. It's very important you look after yourself.",
            "Piggybacking to suggest you contact the down syndrome society of your country, who will likely be able to provide masses of assistance.",
            "Yes PLEASE ask for a formal interpreter for the family meeting if your moms native language is anything other than English!",
            "All the staff have phones that are to be used for medical interpretation and there are also in house phones, family members are not to be used for interpretation because they often confuse words.",
            "I hope this helps! Not everyone will know all these answers, but they should be able to direct you to the right person and everyone will have SOME information. You should also write down what medications he is getting and how often. They will probably change!",
            "If your mom is crying every day all day she may have post partem depression which is very common. You could ask the drs to help her and maybe get some medication to get through this difficult time. I hope your brother is okay.",
            "Most hospitals have medical social workers who can be a great help just finding resources or explaining how certain processes and things work. A nurse should be able to tell you how to reach them."
        ]
    },
    "My partner has bad sunburn all over his body, and now 2 days of diarrea. Is this sun poisoning?": {
        "title": "My partner has bad sunburn all over his body, and now 2 days of diarrea. Is this sun poisoning?",
        "score": 7,
        "url": "https://www.reddit.com/r/AskDocs/comments/1dr879u/my_partner_has_bad_sunburn_all_over_his_body_and/",
        "content": "He is male, 25 and around 100kilos. \nWednesday my partner got sunburnt on his front, very badly on his feet, also on his arms and fronts of legs. He felt okay but just painful so we put after sun on, and drank lots of water. That night we went for dinner and afterwards his stomach was quite gurgly and he began to have diarrea. Thursday came around and he covered his front and feet but then his back burnt badly too as well, we did the same after sun and water and he still had diarrea, he felt quite bad after this and was in a lot of pain during the night with the burn. We went out on the Friday and he didn’t burn as he wore his t shirt etc, but he’d started to feel really bad in terms of dizziness, tiredness and aching legs. The diarrea continued and he lost his appetite and got stomach cramps too. I hate seeing him like this, not sure what to do? Does this sound like sun poisoning? \nHe’s been wearing factor 30 and factor 50 but it’s been 9 UV. ",
        "num_comments": 9,
        "comments": [
            "Thank you for your submission. **Please note that a response does not constitute a doctor-patient relationship.** This subreddit is for informal second opinions and casual information. The mod team does their best to remove bad information, but we do not catch all of it. Always visit a doctor in real life if you have any concerns about your health. Never use this subreddit as your first and final source of information regarding your question. By posting, you are agreeing to our [Terms of Use](https://www.reddit.com/r/AskDocs/wiki/terms_of_use) and understand that all information is taken at your own risk.\n**Reply here if you are an unverified user wishing to give advice. Top level comments by laypeople are automatically removed.** \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskDocs) if you have any questions or concerns.*"
        ]
    },
    "Dentist’s assistant shared my dental health with my husband": {
        "title": "Dentist’s assistant shared my dental health with my husband",
        "score": 21,
        "url": "https://www.reddit.com/r/AskDocs/comments/1dr2cv7/dentists_assistant_shared_my_dental_health_with/",
        "content": "Female - 58 - 5’4” 135 lbs. Zopiclone for sleep. Moderate drinker. Canada.\nMy husband and I see the same dentist. During his visit the other day he asked about my dental health. \nI lost my teeth when I was 8 (I’m not from Canada.) I’m very insecure about the circumstances and wearing dentures. My husband knows I wear dentures but I have a few back teeth that will need to be pulled soon and I didn’t want him to know about it just yet. \nMy dentist’s assistant told him my back teeth will need to be pulled and I feel really sad I wasn’t able to tell him myself. \nAre dental workers allowed to do this? I want to speak to my dentist about it but don’t want to look foolish if they say “yes. You’re married too bad so sad.” ",
        "num_comments": 6,
        "comments": [
            "Thank you for your submission. **Please note that a response does not constitute a doctor-patient relationship.** This subreddit is for informal second opinions and casual information. The mod team does their best to remove bad information, but we do not catch all of it. Always visit a doctor in real life if you have any concerns about your health. Never use this subreddit as your first and final source of information regarding your question. By posting, you are agreeing to our [Terms of Use](https://www.reddit.com/r/AskDocs/wiki/terms_of_use) and understand that all information is taken at your own risk.\n**Reply here if you are an unverified user wishing to give advice. Top level comments by laypeople are automatically removed.** \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskDocs) if you have any questions or concerns.*"
        ]
    }
}