{
    "What does this inductor do? I found it inside of a little radio and I have never seen one like it before. it looks like it might be connected to the antenna, but they put a bunch of glue on the board so I can't tell": {
        "title": "What does this inductor do? I found it inside of a little radio and I have never seen one like it before. it looks like it might be connected to the antenna, but they put a bunch of glue on the board so I can't tell",
        "score": 119,
        "url": "https://i.redd.it/34x12t6hfd9d1.jpeg",
        "content": "",
        "num_comments": 61,
        "comments": [
            "It's a ferrite rod antenna in an AM receiver.",
            "That thing actually IS the freekin' antenna",
            "Yet again Reddit makes me feel old.",
            "AM broadcast band radio is such a low frequency that ‘normal’ antennas would be too big. So they use this instead which electrically is the right ‘length’ to perform ‘well enough’ for AM radio reception. They are directional, so if you’re getting bad reception try reorienting the radio to see if you get better reception.",
            "When I see this kind of questions and I remember of this antenna with rotating mechanism in tube radio receivers....I'm really old.",
            "Ferrite antenna receiver.\n\nI had a little transistor radio that had one. It's pretty cool because the antenna is directional.",
            "This post makes me feel old AF.",
            "Back in the day we would have called it the tuning coil, the ferrite rod is the antenna. We used to wind our own when I was a lad.",
            "Noob question: is the impedance of the antenna (reception) measurable as load on the transmitter side, if it works like a  “long distance transformer”?",
            "It’s a ferrite rod found in all radios"
        ]
    },
    "If this circuit worked how it was supposed to, I should be reading something other than 0V if I place the probes here right?": {
        "title": "If this circuit worked how it was supposed to, I should be reading something other than 0V if I place the probes here right?",
        "score": 10,
        "url": "https://i.redd.it/893ryk7avf9d1.jpeg",
        "content": "And if the transformer works as intended, which is seems it does, where should I start looking now?",
        "num_comments": 17,
        "comments": [
            "Is the 5VSB a DC voltage? If so you should see zero where the probes are. The transformer is a short at DC.",
            "That's likely a flyback power supply. The point you're measuring have high frequency pulses commonly around 50kHz. Most multimeters are too slow to measure this pulses but reading should not be zero, in my experience the values are random on my cheapo multimeter. An oscilloscope is best tool for this, the cheap $20 STM32 oscilloscope works too.",
            "Let me guess, you drew a SMPSU the wrong way around? Or is this supposed to be a 50/60 Hz iron-core transformer?\n\nDepending on your meter you might measure everything from 0 to x V. If the PWM/SMPSU controller is **not** working you’ll likely see 0 V.",
            "As mentioned, assuming supply is working normally, there should be a high frequency AC where your probes are eg between about 25kHz & 200kHz or so depending on supply design. A regular multimeter can't read this even on the AC range. You'd need a scope.\n\nAlso take care as the right side (mains side) of the supply will have lethal voltages...",
            "Is the oscilloscope ground connected to the same GND node as shown in the schematic?",
            "Place your black probe on the other side of D950, and make sure the meter is set to DC range.",
            "Ya, it’s DC standby voltage. From what I can tell the primary (right hand side) of the transformer is using AC",
            "How do I make sure I’m getting 5V out then?",
            "This is the answer. Multimeters typically have LPFs on the front end so SMPS frequencies won't be read.",
            "What is the right side of the transformer connected to?"
        ]
    },
    "Is this a non-polarized capacitor?": {
        "title": "Is this a non-polarized capacitor?",
        "score": 2,
        "url": "https://i.redd.it/894jhv1pci9d1.png",
        "content": "I'm rewiring an old bass and I wanted to be sure.",
        "num_comments": 6,
        "comments": [
            "Yes, it's a 0.047uf mylar capacitor",
            "It's a polyester capacitor, I believe.  Not polarized.",
            "But the question is, why is it there? What's the purpose of it?.",
            "Tone control, rolls off high frequencies.",
            "Nice to know that. What would change if it was polarized?",
            "Thank you!"
        ]
    },
    "my rectifier isn't rectifying ": {
        "title": "my rectifier isn't rectifying ",
        "score": 7,
        "url": "https://www.reddit.com/gallery/1dr1w5u",
        "content": "honestly just wanted to do a little project and now I'm trying to learn what diodes to use in my 3 phase rectifier. I have 4v AC coming from each coil (idk my rpm yet so I don't know my frequency I get a tachometer on sunday). What does it look like I'm doing wrong though I only have a reading of .7v DC coming out of my rectifier. My coils are 360 wraps of 24 Gauge wire. 3/4 coils to poles 9 coils/12 poles. Just wondering what's going on here. Also know I have no electrical knowledge. ",
        "num_comments": 17,
        "comments": [
            "Put a 1000 uF 25V electrolytic capacitor across the output, you will get a higher voltage. You don't say whwt diodes you are using. Use Schottky diodes instead of regular diodes, you will get a higher voltage.",
            "As the others said: put a capacitor on the output of your rectifier. \n\nIf you measure >0 V while in DC measurement mode, then your rectifier is rectifying. Otherwise it should show 0 V in DC mode, as the AC waveform should cancel out.",
            "ah shit I thought I put that in there I'm using 1N4001. Awesome I do have some schottky diodes I'll have to try out.",
            "Okay I think I understand that but try explaining it like you're talking to a kindergartener. what do you mean >0v like a negative reading? or would my multimeter really throw up a less than symbol.",
            "Any suggestions on multimeter? I'm using a AstroAI AM33D. I measured my output at the ends of the wires lol 😆. I got all three phases isolated when I'm reading the voltage and it's just from the \"negative\" and \"positive\" leads coming from my alternator. there's seems to be plenty of voltage coming out of each coil pack, as I fried an LED I hooked up to one of the coils outputs. I'll have to try putting a cap on there when I work on it next. Thanks for the input.",
            ">0V means greater than zero volts",
            "oh shit that's right greater than; my dumb ass. yeah so I'm getting a .3v reading when I hook it up so somethings messed up with it?",
            "No, meters are slow so they always read some small amount of DC in the output. You can test this by *carefully* checking for DC in an AC wall outlet. You'll always \"see\" some DC there.",
            "Should both sets of wires coming from each series of coil be going to the rectifier? what I've been calling the positive and negative (the in going wire and the outgoing wire). I was told the negative/ground wire doesn't matter in an alternator.",
            "yes that's what I built it off of; but is that only one wire from each phase going into it, or is it both wires from each phase going into the rectifier?"
        ]
    },
    "im making a class a current buffer and i have issues with decoupling the signal": {
        "title": "im making a class a current buffer and i have issues with decoupling the signal",
        "score": 1,
        "url": "https://www.reddit.com/r/AskElectronics/comments/1drb6ab/im_making_a_class_a_current_buffer_and_i_have/",
        "content": "https://preview.redd.it/c2ygbqa6ii9d1.png?width=1920&format=png&auto=webp&s=f9ca07cb9bda49b9c34d1030517dab83516b5e8d\n\nwith decoupling capacitor\n\nhttps://preview.redd.it/3y0j7a6lii9d1.png?width=1920&format=png&auto=webp&s=80c7cde80dc3d4c6eb769cff98a5ca83a415fe71\n\nwithout decoupling capacitor",
        "num_comments": 1,
        "comments": [
            "Well sure, your current sink is way too weak for a 32Ω load.\n\nA full class B or AB output stage would work best if you want the average output voltage to be zero."
        ]
    }
}