{
    "Daily Slow Chat": {
        "title": "Daily Slow Chat",
        "score": 2,
        "url": "https://www.reddit.com/r/AskEurope/comments/1dr2ixh/daily_slow_chat/",
        "content": "Hi there!\n\nWelcome to our daily scheduled post, the **Daily Slow Chat.**\n\nIf you want to just chat about your day, if you have questions for the moderators *(please mark these \\[Mod\\] so we can find them)*, or if you just want talk about oatmeal then this is the thread for you!\n\nEnjoying the small talk? We have a Discord server too! We'd love to have more of you over there. Do both of us a favour [and use this link to join the fun](https://discord.gg/BTX7cK3R4k).\n\nThe mod-team wishes you a nice day!",
        "num_comments": 7,
        "comments": [
            "In addition to mango, it's also pineapple season here.. not a fruit I eat often at home, but these Bangladeshi pineapples are great!\n\nAre you a fan of the pineapple? Fresh, tinned?",
            "I think one of the most difficult things about creative writing is judging how much to show and how much to tell. Too much telling \"he was angry\" can make the writing less engaging, because it reduces the reader's participation in creating the story. But too much showing can grind the pacing \"his face grew red, his eyes narrowed and veins throbbed as his hands curled into a white-knuckled fist\". Then again, this is also a simplified way of looking at it.\n\nMy favorite writers are those that manage to pack a lot of content in a few words. You know, when you read something and think that the author has crystallized the writing to its most perfect form, where not a word more or less is necessary. I think rather than getting too hung up on how much to show and how much to tell, it is better to think of how to best tell this story as a whole so that when the reader finishes it, he thinks it was just... right (and possibly is left wanting just a little more).\n\nIt is the same when it comes to open/ambiguous endings. It is hard to balance just exactly what ends to tie and which ones to leave to the imagination. If the balance is off, the reader may either think that you just couldn't figure it out and it's unsatisfying, or again, if you just tie off everything, you leave nothing to imagination. \n\nIn any case, I should read more fiction again, but most of my to be read list at the moment is non-fiction... \n\nWhat about you guys? Do you enjoy a variety of writing styles? Or is there something you particularly like/dislike?",
            "When I woke up today, my first thoughts were: \"how fucked up politics are, just like in 2016\".\n\nThen it was Brexit and Trump for the first time and in a few months it might be Trump the second round and a \"fascist\" France.\n\n\"We live in interesting times\" is indeed a curse.",
            "I like 'em. Fresh not tinned. Even then only in smallish amounts, because of the acidity. The acidity messes with my taste-buds, if I eat too much pineapple.",
            "I will have to admit, tinned (without added sugar) pineapple is one of my guilty pleasures. I even put it in the fridge before eating because I like it nice and cold :D I like it fresh, too, if it's ripe.",
            "When I am in Turkey and watch TV with my mom (who is very political like me), she often tells me: \"look at the news. Things that wouldn't happen in a European country in three years happen in three days in Turkey\". And she's right 😅 I guess life here is much more \"boring\" in that sense. Politics is fucking and un-fucking itself periodically. \n\nWho knows, maybe we will also have our un-fucking soon.",
            "Pineapples also have a very strong protein-degrading enzyme, so too much fresh pineapple digests the upper layer of your mouth XD. It's great for tenderizing meat."
        ]
    },
    "What is the biggest culture shock you experienced while visiting a country in Europe ?": {
        "title": "What is the biggest culture shock you experienced while visiting a country in Europe ?",
        "score": 146,
        "url": "https://www.reddit.com/r/AskEurope/comments/1dqozlj/what_is_the_biggest_culture_shock_you_experienced/",
        "content": "Following the similar post about cultural shocks outside Europe (https://www.reddit.com/r/AskEurope/comments/1dozj61/what\\_is\\_the\\_biggest\\_culture\\_shock\\_you\\_experienced/), I'm curious about your biggest cultural shocks within Europe.\n\nTo me, cultural shocks within Europe can actually be more surprising as I expect things in Europe to be pretty similar all over, while when going outside of Europe you expect big differences.\n\nQuoting the previous post, I'm also curious about \"Both positive and negative ones. The ones that you wished the culture in your country worked similarly and the ones you are glad it is different in your country.\"",
        "num_comments": 621,
        "comments": [
            "You cant flush toilet paper in the toilet in Greece\n\nWomen's day is not really the same thing in different countries.",
            "No time to pack groceries in german supermarket also beer being cheaper than water.",
            "Lack of persianas (rolling shutters I think) like WHY?!",
            "Getting invited for pre-drinks at 19h in the UK. I haven't even had dinner yet 😭\n\nBut in all seriousness, I've never really experienced any truly big culture shock within Europe. I still feel we're very similar to each other. It's more the little things that makes us different, I feel.",
            "Toilets on French highway rest stops that were just a hole in the ground. I almost shat myself while searching for a normal toilet.",
            "Being *obligated* to carry firearms ~~in and~~ around Longyearbyen, Svalbard (Norway).\n\nAnd in hotels and bars in the area, there are signs telling you that \"unfortunately\" you can't bring your guns inside to places where they serve alcohol, and that you're reminded to leave your gun(s) in the designated locker by the entrance.  \nNowhere else have I ever experienced it to be *presumed* that people in general *could* be carrying guns in the first place.\n\nDefinitely gave the whole town a certain \"wild west\" vibe.",
            "Crosswalk on what I assumed was a motorway in Belarus",
            "I was 19 and on a short exchange in France. The mother asked if we wanted milk, in the morning. I expected a glass of cold milk, but got warm milk in a bowl. I was so confused.",
            "It wasn't a shock, per se, but something I found annoying - when I was staying in France with relatives, the light switches in their apartment were much lower (at the level of my waist) than what I'm used to  (at the level of my shoulders). Every time I entered a dark room, I spent a  couple of seconds patting the wall looking for a switch, before I remembered that it was lower. And when I finally got used to it, I went back home and had the same problem but in reverse 😅",
            "Probably all the stray dogs in Greece. So many stray dogs. There were times when our group was going to a place and several dogs followed us."
        ]
    },
    "Is it considered okay to smoke a cigarette during a business video call?": {
        "title": "Is it considered okay to smoke a cigarette during a business video call?",
        "score": 132,
        "url": "https://www.reddit.com/r/AskEurope/comments/1dqk7er/is_it_considered_okay_to_smoke_a_cigarette_during/",
        "content": "Just experienced this with one of my coworkers in the Netherlands. He lit up a cigarette mid-call in a very casual manner. \n\nIn my country smoking has gotten to be pretty taboo and smoking in a business context, especially a meeting, isn’t generally accepted and frowned upon.\n\nWhile there’s no rules against it, I feel like it’s been something that people tend to not socialize in those contexts. \n\nCurious if that’s typical in parts of Europe or he just an IDGAF kinda guy (which he is).  ",
        "num_comments": 175,
        "comments": [
            "I know people that do it when they work from home and no one cares. Would be different if talking to clients I guess but for internal meets it seems fine",
            "In Spain the most of smokers even smoke on the balcony or window and not in the house when they are at home so smoking when you are in a professional video conference would be seen so unprofessional…",
            "It still happens with French colleagues during meeting calls. Smoking is not very taboo there and I see no problem with it as long as they do it from their home. It's not like it prevents them from listening or talking. \n\nObviously, during an in-person meeting it would be a huge no these days.",
            "At my previous work place it was not allowed to smoke during work hours - and therefore also not during a work call. \nIf we had long meetings all of us smokers “accidentally” lost the camera signal a few times during the meeting.",
            "If he did it in person then yeah it would be weird. During a call I'd say it depends on how long the call is. If it's like an all afternoon thing and they're working from home then I'd be less surprised than if it's like 15 minutes or something and they have plenty of time to light one up outside of the call.",
            "Definitely not okay in Sweden but we are also the country with the least amount of smokers in Europe, I mean you probably wouldn’t get fired for it but everyone in the call would drop their jaw.",
            "Casual internal meeting, who cares. Formal call with a customer, could be an issue depending on the relationship.",
            "It would be considered highly unprofessional here.\n\nI vape when I work from home but I make sure that my camera is off!",
            "Lol we have a Dutch guy that likes to smoke on calls too. I wonder if it's a Dutch thing. Feels unprofessional to me although it's not like anyone else has to smell it so whatever\n..",
            "I work for a company that deals with tobacco producers and one customer in particular has people, who regularly light their cigars in Teams calls. We find it kinda hilarious and quite frankly those are some high quality cigars produced in the Dominican Republic.\n\nThat customer is from Belgium."
        ]
    },
    "Strawberry nationalism": {
        "title": "Strawberry nationalism",
        "score": 78,
        "url": "https://www.reddit.com/r/AskEurope/comments/1dqksoc/strawberry_nationalism/",
        "content": "In Sweden, people (in my opinion) overhype the \"Swedish strawberries\", only in season for a couple months every year. They're praised as superior in taste to any other strawberry. To me, it's obviously because they're freshly picked and ripened before picking, being sold shortly thereafter, not because they're specifically Swedish.\n\nCompared to the Dutch indoor berries or the Spanish berries shipped for days, of course they taste better. Because they are fresh and sun ripened. But this wouldn't differ for any other country, any freshly picked berries would surely be delicious?\n\nHowever, this strawberry nationalist mentality persists.\n\nSo my question is, does your country hype your local berries the same way as here?",
        "num_comments": 90,
        "comments": [
            "Regional strawberries get hyped up, because there are larger fields where I live. \n\nNo idea if they are better though, we only eat the ones we pick in our garden.",
            "Haha of course the Finnish strawberries are the best!",
            "There are very few fruits or vegetables in the UK that people actually buy seasonally, and therefore the vast majority of stuff you get in the UK is pretty bland because it's been cold stored for a long time, imported from great distance, or force grown in greenhouses.\n\nThe general exceptions to this are rhubarb, and strawberries. They're in peak season right now (strawberries that is, rhubarb season is April/May) and people go crazy for them. Anywhere rural will have PYO (pick your own) strawberry farms where you can go and pick them fresh filling your own punnett, buying them from farms, or just getting them from the supermarket. Strawberries and Cream is the traditional dish of Wimbledon which starts next week.\n\nI wouldn't say there's a nationalist vibe to it, I've never heard anyone say British strawberries are better than anywhere else, but I'd say it's one of the few foods where people still understand that being naturally in season and fresh gives you the best version.",
            "Norske jordbær (tm) are the best in the whole world. Strawberry Nationalism is very strong here",
            "It happens here too and we take it to another level because strawberries from one particular county (Wexford) are hyped far beyond strawberries grown elsewhere in the country. Wexford is in the “sunny south east” so supposedly produces the greatest strawberries in Ireland.",
            "It's the same with all local food here. Local weather, soil and varieties that are grown are important for taste, just like with any food. It's also true that imported fruit and vegetables usually have to be picked unripe and refrigerated for a longer time, which makes them taste bland in comparison to local produce. And I guess there's the nostalgia factor too. Many of us have beloved childhood memories of eating fresh produce from the family garden or local farm, and there's always a part of us that wants to experience this again.",
            "I am a French strawberry enjoyer who moved to Sweden and I'm *horny* for the Swedish strawberries. Way more consistently good than anything I had at home.\n\n\nReally enjoying this season.",
            "I think most Dutch people know that things grown here will come from a greenhouse. They're water bombs. However, there are some good growers out there and they are usually more expensive. It depends on local farmers. \n\n  \nWe do get crazy about our white asparagus. Season's just over.",
            "Imported fruit and vegetables aren't very prominent in Turkey (in fact I have only ever seen imported garlic in the supermarket a couple of times. That's it the only imported vegetable I know), we usually eat locally and people are very picky with their fruit and vegetables. But the strawberries from certain regions are definitely sought after and praised. Where I come from, there's a type of sweet, fragrant, pink strawberry that has a very short season and people are after them like swarms of locusts. \n\nIt's not just strawberries, though. Grapes from this region, melon from that place, tomatoes from this city can be famous and locals take pride in them.",
            "While I agree that freshly picked berries obviously taste better than imported ones and that is part of the reason people hype local produce, I also think there's some truth to Swedish strawberries tasting better than say Spanish ones. Not because they're Swedish, but because they're grown further north in a colder climate. Berries take longer to ripen here, which means they have more time to develop more taste. I think of it like cooking/baking something at a very high temperature at a high speed vs slow cooking something for hours and hours. The slow cooking food is going to have a richer taste."
        ]
    },
    "Do people from your country retire at cheaper locations outside your country?": {
        "title": "Do people from your country retire at cheaper locations outside your country?",
        "score": 44,
        "url": "https://www.reddit.com/r/AskEurope/comments/1dqkupb/do_people_from_your_country_retire_at_cheaper/",
        "content": "I live in the Netherlands and I have met many Dutch people on my travels in Southern and South-Eastern Europe who retired in these countries after ending their careers. Affording a better lifestyle (low rent, cheaper grocery etc. all on a fixed income), living in a warmer place, being close to nature (the Netherlands doesn't have a lot of nature, tbh), are some of the reasons I have heard. \n\nIs it a common practice in other European countries to immigrate to a cheaper (or different) location in retirement? What are the reasons for immigrating after retirement? What sort of life do these people lead? Do they stick to their own enclaves full of Dutch/German/Swedish boomer expats? Does such a move improve their lives in any way? ",
        "num_comments": 61,
        "comments": [
            "Sounds like a rich person privilege if I’m being honest. Polish retirement is a sad joke and old people often continue working even after the official retirement. Things like retirement savings do not exist in this age group as people there worked most of their lives still during communism and investing was not even a concept back then.",
            "Pensioners can move to any EU country and receive their pension there without any problems. Some make use of this and move abroad. \n\nThere are several places in Bulgaria that try to attract German pensioners with the cheaper CoL. \n\nThailand was also a place where pensioners retired to, but they changed their tax laws this year and it might have changed.",
            "Spain. All my teachers who were old, from when I was in school said they wanted to retire to Spain",
            "From Denmark, some move to Spain in small society's of Danes living in the same area (often referred to as Dane-colonies). But it's not a common practice, most stay in Denmark.",
            "In Spain, people typically remain at home when they retire. Those who moved from small towns to cities for work often return to their hometowns, primarily driven by nostalgia.",
            "People from Bosnia and Herzegovina retire in BiH, but they spend their life in Germany",
            "The only occurence I know of is a couple of former neighbors (we're the ones who moved) who bought a small house in Portugal and spend roughly half of the year there, but :\n\n* they kept their house in France and stay there the other half of the year,\n* they have portuguese roots so they didn't choose the country ONLY for its climate & economy.",
            "Lots of people do this from Ireland and retire in South of France, Portugal and Spain.\n\nBetter weather, cheaper COL they usually sell their property and buy one in the respective countries\n\nI say lots respectively speaking but more from my circle of family friends etc never looked at the statistics.",
            "There are a bunch of retired swiss and german folk who move to hungarian villages. I don't really know any hungarian who moved to eastern, southern countries for their old age.",
            "Used to be a thing on the Belgian coast. Honestly these days I've heard about people retiring abroad, but even family members who had a vacation apartment at the coast sold it upon retiring instead of their house. Because they realised pretty soon that they care more about being their friends and family more than the advantages of moving to such a place when retiring. \nA lot of them instead take frequent vacations, but are also in 4 to 5 organisations for activities in the place they already are with their friends.\nThis might also be because Belgians are notoriously bad at making new friends after school, we often have expats posting about it on Belgian subs."
        ]
    }
}