{
    "Career Monday (24 Jun 2024): Have a question about your job, office, or pay? Post it here!": {
        "title": "Career Monday (24 Jun 2024): Have a question about your job, office, or pay? Post it here!",
        "score": 7,
        "url": "https://www.reddit.com/r/AskEngineers/comments/1dncwpm/career_monday_24_jun_2024_have_a_question_about/",
        "content": "As a reminder, /r/AskEngineers normal restrictions for career related posts are severely relaxed for this thread, so feel free to ask about intra-office politics, salaries, or just about anything else related to your job!",
        "num_comments": 25,
        "comments": [
            "Design/mechanical engineering hiring managers-- what can applicants coming from manufacturing environments bring to the table for your positions?",
            "Hello, \n\nI have a question about office politics and lunch. So I work two jobs, one is my 9-5 at a engineering consulting firm. The second is after work, 5 - 10ish and I do studio musician work and song writing along with making my own music. I always skip lunch so I can leave after 4 instead of 5. This week onward I have physical therapy on Fridays so I have been working 9 hour shifts one Wed and Thru so I can leave 2 hours earlier on Friday instead of using sick time or vacation. \n\nThe problem is that today, Thursday, I was asked if you want to go to lunch with us because everyone is going? I have made it semi clear to some that I have 2x jobs but don't want to announce it for some reason. Maybe that would be helpful? I digress. I had to decline and there was this moment of silence as 6 of the people who were going just kinda was like \"huh\"? Thankfully the guy who knows I am grinding like crazy said \"Silent Egg\" is a busy dude, don't give him flack. I wanted to explain right then, but I figured I'd just let it be. I don't need to explain this to everyone:  \n  \n \"Hey I cant make it to lunch because today I have to work an extra hour, and I worked an extra hour yesterday, so I can get my two extra hours worked so I can go to physical therapy Friday at 2 without taking PTO and also have the time to get off work at 5 today so I can quickly (yet 30 mins late) get to the studio for my session today at 5 as I work two jobs/a side hustle after work....\"  \n  \nYea... I have my reasons, but I feel bad none the less and feel like I am somehow not being a team player and doing something wrong against engineering office politics?! Ugh.... Any input would be GREATLY appreciated! I am new to this and just a handful of months out of school and I am needing to figure these things out but I also need the time to work my other job as I desperately need more money as I have massive student debts to pay. Sucks....",
            "How does a department-wide hybrid schedule benefit employers? How does it work at your company? Asking because my coworkers and I are building a proposal to do just that. I'm trying to see the issue from my employers' perspective and have solutions ready to any of the issues they might point out.\n\nI work at a smaller company with about a dozen engineers working in my office (1 of 2 across the country). It's a project based custom fabrication company where each engineer tends to take ownership of a given project and see it through from start to finish. Projects are built in house so we're expected to be on site and available during normal hours to deal with any fabrication issues that might come up. Every engineer has the same title other than the two managers, who answer to the general manager of the office.\n\nWhat my coworkers and I want to propose as an alternative is to have about half the engineers on site at any given time to deal with fabrication issues while the other half work remote, with a weekly or bi-weekly rotating schedule so everyone gets even remote time. Remote engineers would still be expected to be on call during normal hours in case of any real emergencies that only they could deal with, but the goal would be to make sure all engineers are capable of handling most issues regardless of who the lead is on the project, or screenshare/facetime with the lead if they can't. I think for our workflow this would be easier to keep track of than trying to set everyone up on different days of the week, and would smooth out any problems with people being out sick or on vacation. I have a friend whose team seams to like working this way at his company. What do you think?\n\nI'm also considering rolling it into a larger proposal to split roles into junior and senior level engineers. Juniors would have more on-site time and be responsible for easier projects and grunt work such as making files for our CNC machines or laying out 2D drawings for a 3D design that a senior came up with. Seniors would be focused more on 3D design, structural calculations, electrical schematics, etc than drafting, as well as reviewing juniors' work and taking some of the brunt of similar management duties. Managers of course would manage time and personnel and focus a little less on design work.\n\nThe timing is ideal because the company is shopping around for a new building, and this schedule would mean they could pay for less office space. The new location also makes for a great excuse for the employees who may not want to commute to a newer location further from home.",
            "What's a good subreddit to post this question below in with over 10k members?\n\nWhat are the most common differences between the duties of a chief engineer vs a deputy chief engineer?\n\nHow is this different in government vs in industry?",
            "Hello lads. Can someone tell me how does the engineering admission process work ?",
            "Why are older ABB robots so laggy?",
            "Not sure if this is the right place, but I am looking for a bit of advice. I don't really know how to proceed with my career.\n\nI began as a On site Test Engineer for 3 years and then became a system Test Engineer for 2.5 years (current position). All within the same company (automotive), same product, same features. I am basically doing the same thing I did as an onsite engineer but via simulation. Now I am looking for a career change because I do not like the direction of the company and my current group. I feel stuck though. I have no experience outside of testing, and while I actually enjoy my current role, I am a bit burnt out because long hours that inevitably come with it (I believe due to the nature of testing, no matter which company, because Testing is 'last in line' to do their work, the long hours would be inevitable). However I feel like i am not qualified to do other aspects of Engineering such as design,. controls etc, or anything software related. I just feel like im stuck with testing unless I want to apply for entry level positions which I dont want to do. FWIW i have a BS in Electrical Engineering, in the US.\n\nHas anyone been in the same position as me? What did you do? Should i apply for positions I am not qualified for?  How easy is the transition from automotive to another sector, such as aerospace? I am open to learning more about other positions that would best suit me. TIA!",
            "What is a good subreddit to post this question in?\n\n  \nQuestions for people who have been a chief engineer (either for government or industry) or know alot about the role\n\n1) What are the biggest differences in the qualifications/experience looked for during the hiring process - for a chief engineer for government (say in the USA) versus in industry?\n\n\n\n2) What are the biggest differences in the actual duties of a for a chief engineer for government (say the USA) versus in industry?\n\n\n\n3) How does the sector (utilities, defense, other areas, etc) affect the above?",
            "[Not sure if this is the right place; please redirect me if not.]\nI am planning on pursuing a masters in Sustainable Engineering with a focus on Green IT/CS. Would like to hear your opinions & experiences in the field as I would like to undertake further research (mostly PhD) - no geographical restrictions.",
            "I got my first engineering job (huzzah!).\n\nI'm starting after I finish my temp position. Here's my question: my temp position is on the management side for a local political campaign. **SHOULD I PUT IT ON MY RESUME?** I was a manager at a restaurant during the early phase of my college career, but my position with this campaign is definitely multiple levels higher in terms of \"management experience\". I think that I have been developing skills that are relevant to my career. I am working 9-10 hr days 7 days/wk which could show my work ethic in a future interview (for the record, I am getting paid substantially more than an entry-level engineering position). \n\nTL;DR: I am wondering if I should put a management position for a political campaign on my resume. I am worried about outing my political involvement and beliefs, but I think it shows the range of skills I possess and shows that I can do management."
        ]
    },
    "Is there a way to make plastic more abrasion resistant?": {
        "title": "Is there a way to make plastic more abrasion resistant?",
        "score": 10,
        "url": "https://www.reddit.com/r/AskEngineers/comments/1dqtb50/is_there_a_way_to_make_plastic_more_abrasion/",
        "content": "So I'm trying to make a plastic hockey blade protector more resistant to abrasion. The abrasion mainly comes from the asphalt the protector is used on. The protector wears down in a months time. Is there any way to strenghten the plastic to make it last longer? Maybe even a household item like nail polish? Thanks :)",
        "num_comments": 22,
        "comments": [
            " *UHMWPE* could be your plastic.",
            "Glue a thin piece of steel to the wearing surfaces with an assembly adhesive",
            "A layer of aramid cloth (kevlar) wrapped around and epoxied to the blade would be extremely abrasion-resistant. Something like a fiberglass layer but instead of glass, aramid.",
            "Coat it.  For a different reason, I put silica on the inside surface of PET bottles.",
            "Yeah, put metal in it. \n\nOtherwise, rubber pads on the bottom could do the trick.\n\nEdit - wait a minute. Are these plastic protectors for skate blades that you walk on or is this a plastic protector for a stick used in street hockey? The Canadian in me saw \"hockey\" and assumed it was real hockey.",
            "Glass fibre fill",
            "There was a machinist in our shop who also raced motorcycles.  He made his pavement-dragging knee pads out of teflon, and they lasted better than his co-racers who used steel.  (I think they use Kevlar nowadays.)",
            "What's the blade protector made of?",
            "This question has me thinking of the Mohs Hardness scale: https://en.wikipedia.org/wiki/Mohs_scale (basically any material less hard than another will be scratched by the other material)\n\nwhich somewhat comes down to this: if you want a protector to wear less over time, it has to be harder. Others have stated: use steel or another material (such as kevlar).\n\nSure, you could add paint coatings, but that's still going to wear. Steel (or kevlar, as also mentioned) adhered to your item will last much longer than simple paint or polish.",
            "Ptfe"
        ]
    },
    "How do bends affect buckling and bending loads in tubes?": {
        "title": "How do bends affect buckling and bending loads in tubes?",
        "score": 1,
        "url": "https://www.reddit.com/r/AskEngineers/comments/1dr54mz/how_do_bends_affect_buckling_and_bending_loads_in/",
        "content": "I'm wanting to build a \"U-frame\" lift out of tubular steel (think a squared off A-frame). The load is about 600 lbs and it will attach to the center of the horizontal member. I'll be pulling from above the frame at that same point so the over all load would be compression in the vertical members and bending in the horizontal member. The frame isn't doing the lifting, it's guiding the load along a circular path from the ground to the inside of a trailer. I can find formulas to calculate when a tube will fail in compression and I've been able to find ways to calculate bending loads of a tube when supported on the ends and point loaded in the middle. My question is, how would bends in the corners affect those calculations?\n\nSay I have the supports 6' apart and the arm is 6' tall. I can square the structure off and figure out loads on the vertical and horizontal members. However, if I put a large radius bend (guessing here but let's call it a 5 diameter radius so a 10\" radius for a 2\" tube) in the corners, how does that affect those calculations? Does it affectively shorten the horizontal cross member to just 52\" wide? Would an approximation of 50% of the bend being vertical and horizontal work making the cross member 62\" long for the purposes of the bending load? Does the bend make the structure stronger or weaker? My gut tells me a large bend in the corners would make the structure stronger but I want some math to back up my gut.\n\nI've been digging around for a couple of weeks and I can't find an answer. I'm not finding anything in my old statics and dynamics text book and I'm coming up short on my google-fu. This seems like something an actual engineer would be able to figure out during a lunch break but I have no idea how to find a mech eng consultant willing to work such a small project.\n\nAm I over thinking this?",
        "num_comments": 0,
        "comments": []
    },
    "give me an overview about elctronics in general. ": {
        "title": "give me an overview about elctronics in general. ",
        "score": 0,
        "url": "https://www.reddit.com/r/AskEngineers/comments/1dr3laz/give_me_an_overview_about_elctronics_in_general/",
        "content": "I'm an Engineering undergrad . The current job market is performing really poor, lesser jobs and AI is eating up the market. I have just started the journey of software development learning just the basics for now, yes it is interesting. And being the student of ECE branch, I am interested to know, if AI can also penetrate into languages like VHDL and Verilog. And what does the future hold for electronics in general. What are the subfields which will be booming in upcoming years ? What kind of jobs are there in this field...? What are the resources to get there? Which country is leaping forward in ECE ? What role are there on this field...designing an EC is the only thing that I've heard of multiple times.",
        "num_comments": 3,
        "comments": [
            "the most important thing to remember is that AI won't be taking jobs as much as humans who use AI will be taking jobs. GPTs/LLMs are good at certain things, but they still are only a force multiplier for people who have design skills. they are kind of like a calculator; just because the calculator can do arithmetic, or even calculus, it does not make them a replacement for an engineer. AI tools are tools. if you are skilled in the underlying principals and knowledgeable about the tools, you will wield the tools in such a way that you are very productive. that will make you valuable",
            "It’ll be fine. Just keep at it",
            "Pain in the arse"
        ]
    },
    "Benefits of adding an electric motor-generator to a turbo-compressor? ": {
        "title": "Benefits of adding an electric motor-generator to a turbo-compressor? ",
        "score": 4,
        "url": "https://www.reddit.com/r/AskEngineers/comments/1dqj9hf/benefits_of_adding_an_electric_motorgenerator_to/",
        "content": "I just watched Engineering Explained's video on the new 911 engine. ( [https://youtu.be/o3Q\\_tm5BTrY?si=lX6xN4Kqiso7\\_W2J](https://youtu.be/o3Q_tm5BTrY?si=lX6xN4Kqiso7_W2J) ). From 9 minutes on he discusses how the electric motor generator lets the engine operate at the stoichiometrically optimal fuel-to-air ratio (Lambda=1) and how this makes the three-way catalytic converters work more optimally in gasoline-powered cars. This made me think of the Volkswagen scandal and if this would've helped them avoid ever needing a test defeat mode in the first place for their emissions systems. Then I started reading about diesel engine emissions treatment and got lost in the sauce.  Would a combined turbo-compressor and electric motor-generator also allow a diesel engine to operate at lambda equals one for all operating conditions? Would operating only at lambda equals have solved Volkswagan's emissions problems?",
        "num_comments": 11,
        "comments": [
            "Diesels dont operate near lambda = 1 (stoichiometric). They run lean all the time (except racing apps). Typical full power lambda is 1.6 to 1.9 for heavy duty engines. Maybe as low as 1.24 for light duty vehicle like pickup trucks. Typical idle lambda is 7.    \n\n\nSince diesels (and gas turbines) run lean, the 3 way catalyst is not effective to reduce NOx in the exhaust stream. In addition, the diesel fuel & combustion process creates more PM than volatile gasoline. Therefore the diesel emission control uses a Diesel Oxidation Catalyst (HC & CO), Diesel Particulate Filter (PM), and Selective Catalytic Reduction (NOx) [alternatively Lean NOx trap for light duty engines].   \n\n\nWould making the VW engine a diesel over eletric drivetrain make it easier to meet emissions? Yes, it would have. But the tech to meet emissions was already existing, they just didnt want spend the money and/or take the fuel economy penalty to pass. This wasnt a tech existance problem, it was an active choice not to follow rules.",
            "VW was an illegal, super cheap way to defeat/avoid testing\n\nWRT the tech, yes there are many ways to adjust the AF ratio, the most common/fastest reacting being an adjustable fuel injector\n\nLike all complex, optimized systems, an ICE is balancing many, many costs and benefits.  Aiming for a chemically ideal AF means losing other benefits.  High performance vs longevity being a very common one.",
            "I do not think that you should be equating gasoline engines and diesel engines like this.\n\nTurbocharged diesel locomotives are an interesting technology.",
            "Volkswagen gave the consumers what they wanted - cheaper vehicles that pass all the required inspections. Adding more complexity to the vehicle does not help with the most important factor: cost. ",
            "I worked briefly on and involved with some of the initial OEM talks involving e-turbos.  Without getting too far into the weeds, yes, they solved VWs emission issues and the one I worked on was specifically for a diesel passenger engine.  \n\nThe benefit of the e-turbo on diesels specifically was to drive very high intake manifold pressures (higher intake air temperatures, more air mass flow for emissions dilution) at low RPM or part load operating points where there was insufficient exhaust energy to drive the turbo normally to those operating compressor points.  It was….. very impressive for its time.   \n\nThe engine could be driven to very high EGR rates with a variable vane turbine inlet AND high intake air mass flow rates.  It was just the best of both worlds.  \n\nBut it was expensive.  And the 48V it required at the time was a non-starter.   No OEM wanted to switch to a 48V vehicle architecture.",
            "[deleted]",
            "My impression was with the available technology they had to choose between meeting NOx emissions standards or having higher fuel efficiency. They then illegally chose to have higher fuel efficiency and to only operate in a manner to meet NOx standards when the vehicle was being tested. Supposing the previously stated binary decision is true to reality (if it's not ignore the rest) could the technology in the 911 engine be modified to make it a trinary decision between N0x emissions vs. fuel efficiency vs. cost/weight/simplicity?",
            ">And the 48V it required at the time was a non-starter.   \n\nMaybe a non-starter, but instead a combined starter - alternator!\n\n(I'll see myself out.)",
            "To the best of my knowledge, it is fairly similar technology to the MGH-H but the use case is a little different.",
            "As a previous owner of one of these VWs, that's not really the issue.\n\nMeeting the emissions is the law, if you crank the efficency up then you crank the NOx up. If you crank the efficency down then you crank the PM2.5 up (soot). The PM2.5 rules are strict enough that you always need a DPF.\n\nI think early in development they basically figured they could use the EGR to control efficency, and ride it right near the limit. This would avoid the cost of an SCR system. Probably late in development they realized that's not going to work, if you crank efficency down enough to meet the laws the DPF is not going to last the warranty, and performance is going to be kinda crappy. So they lied and cheated. But they knew the legal solution was just add an SCR system.\n\nFor the most part, the recalls resulted in just that, add an SCR, and pay for a couple DPF replacements because they were basically guaranteed to fail now.\n\nAs for your idea to use an electric motor to improve it, that would probably work, but a CVT is probably cheaper and does basically the same thing, if you going to go the electric motor you really need to build a hybrid diesel and that had its own problems (they were so efficient they failed to heat the engine block and catalytic converter up). But at the end of the day, they were not struggling with how to make it meet the emissions, they knew, an SCR would solve all their problems. They were trying to cut costs and skip it, and they couldn't make it work without the SCR and just resorted to fraud and lies instead."
        ]
    }
}