{
    "Forum Libre Hebdo - Parlez ici de ce que vous voulez": {
        "title": "Forum Libre Hebdo - Parlez ici de ce que vous voulez",
        "score": 0,
        "url": "https://www.reddit.com/r/AskFrance/comments/1douwgn/forum_libre_hebdo_parlez_ici_de_ce_que_vous_voulez/",
        "content": " Cet espace est dédiée aux discussions diverses, sans thème particulier. C'est un terrain neutre où la communauté peut se retrouver et échanger.\n\nLes règles sont plus souples que celles qui concernent les posts : Actualité, tourisme, sondage, discussions Méta ou même raconter sa vie est autorisé ici.\n\nLe Forum Libre Hebdo sera renouvelé tous les mercredis à midi.",
        "num_comments": 1,
        "comments": [
            "Bonjour à tous,\n\nJe fais appel à cette communauté car j'ai contacté en vain plus de 40 nutritionnistes qui disent être débordés. Est-ce que quelqu'un ici connaîtrait un(e) nutritionniste en France qui serait disponible ?\n\nLe but serait de poser des questions pour améliorer [notre article sur les avis de la marque Holy](https://www.alucare.fr/avis-holy-energy/) et d'ajouter l'avis d'un(e) nutritionniste. Pour le moment, je n'ai que mon avis personnel qui ne prend pas en compte la nutrition, ainsi que les avis de personnes ayant testé le produit.\n\n**Prérequis :**\n\n* Il faut un(e) nutritionniste qui ne soit pas un(e) fan de la marque, bien sûr.\n* Qu'il/elle soit disponible pour le mois de juillet.\n\n**Bonus :**\n\n* Si le/la nutritionniste a un site internet pour que nous puissions le/la contacter.\n* Si une interview vidéo est possible, afin de réaliser également une vidéo.\n\nSi vous avez des contacts, pouvez-vous leur demander de me contacter à l'adresse suivante : [contact@alucare.fr](mailto:contact@alucare.fr).\n\nMerci à ceux qui upvotent afin que nous puissions enfin trouver un(e) nutritionniste et améliorer notre article pour le rendre le plus complet possible !\n\nBonne journée à tous !"
        ]
    },
    "Sommes-nous les seuls ? ": {
        "title": "Sommes-nous les seuls ? ",
        "score": 102,
        "url": "https://www.reddit.com/r/AskFrance/comments/1defrlx/sommesnous_les_seuls/",
        "content": "J'en ai marre des fils \"Suis-je le seul à\", ça me sort par les yeux ! C'est du même tonneau que ceux qui généralisent \"pourquoi tout le monde\"...\nJe pense ne pas être le seul à penser ça ! \"Du coup\" avez-vous d'autres expressions qui vous agacent ?",
        "num_comments": 82,
        "comments": [
            "https://preview.redd.it/eoahjeqed76d1.png?width=1102&format=png&auto=webp&s=91a424661f81cca8e031381b0674d415e51b5770",
            "Ça m'amuse que l'on fasse souvent des généralités alors que les personnes qui conversent sont toujours les exceptions à cette fameuse généralitée",
            "Pour rappel, les posts \"Does Anybody Else ...?\" sont l'un des plus anciens cancers de Reddit. A tel point qu'une des premières règles de AskReddit - avant même d'interdire les sob-stories ou les images je crois - ça a été de les interdire. Cf ce post d'il y a 14 ans:\n https://www.reddit.com/r/AskReddit/comments/f0ary/just_a_reminder_dae_questions_go_in_the/",
            "\"c'est pas pour dire mais...\" ok bah le dis pas\n\n\"je voudrais pas dire mais...\" ok bah ferme ta gueule  \nces deux expressions m'agacent assez vite",
            "L'anglais traduit mot pout mot...\n\n\"à la fin de la journée\"\n\n  \nCeci dit le \"suis-je le seul à\" c'est vraiment le champion toutes catégories tellement c'est atroce.",
            "Sur Reddit : \"Les gens qui <comportement méprisable>, pourquoi ?\"\n\nSinon j'aime bien voir des vidéos format court de Youtube de vulgarisation ou histoire, mais \"Est-ce que tu savais\" ou \"Je ne sais pas pour vous\" = je bloque toute la chaîne.",
            "Outre certaines expressions, il y a un truc qui m'agace un peu et qui est très courant sur Reddit c'est le fait d'utiliser des termes très forts et très exagérés (exemple: dire que le fromage industriel c'est \"infect\", \"infâme\" ou encore \"ignoble\" alors que... bah c'est juste pas bon quoi on peut se mettre d'accord là dessus mais calmos)",
            "Au jour d'aujourd'hui ça me fait systématiquement saigner les oreilles j'en peux plus de l'entendre",
            "J'epingle parce que je soutiens !",
            "Moi c'est \" Belle journée\" et \" au jour d'aujourd'hui\" a chaque fois ça me rend dingue !!!"
        ]
    },
    "Comment sauver un oisillon?": {
        "title": "Comment sauver un oisillon?",
        "score": 16,
        "url": "https://i.redd.it/txw55f5b5e9d1.jpeg",
        "content": "On a trouvé cet oisillon tombé du nid. Impossible d’accès pour tenter de l’y remettre.\n\nIl est mobile et ne semble pas blessé. \n\nOn l’a mis dans une boîte dans des serviettes en tissu et tenté de lui donner de l’eau et de la pâtée pour chat diluée, avec une paille. Il a du en avaler quelques gouttes.\n\nAvez-vous des conseils pour essayer de le faire survivre?",
        "num_comments": 12,
        "comments": [
            "Tu ne trouves pas la réponse à ta question ici ? Tu la trouveras peut-être sur { r/questionsante }\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskFrance) if you have any questions or concerns.*",
            "La LPO conseille, si l'oisillon n'est pas blessé ni en danger immédiat, de ne pas le toucher et de le laisser sur place. Les parents peuvent continuer de nourrir le jeune jusqu'à ce qu'il soit en pleine capacité de voler.",
            "C'est très difficile.   \nDéjà, il faut le nourrir régulièrement, à la pince en bois pour ne pas abîmer son bec. J'ai acheté des vers à Jardiland, avec de la patience il mange. Mais le soucis est qu'il doit manger régulièrement et souvent.   \nEnsuite, il faut le garder au chaud. Juste dans une boîte, ce n'est pas assez. Apparemment c'est un martinet, essayez de chercher quelle température lui convient.   \nLe bec est aussi l'endroit par où il respire. Attention de ne pas le forcer à boire.   \nEnfin, du CALME. Peu de bruit, ne le manipulez pas trop et de parlez pas fort. \n\nSes chances sont minces.   \nLe mieux serait un refuge pour oiseaux, ils ont plus l'habitude. Mais même là...",
            "Ce que je ferais c'est contacter l'antenne de la protection des oiseaux la plus proche pour voir avec eux, si ils ne peuvent pas le récupèrer au moins ils devraient te donner de bons conseils.",
            "https://preview.redd.it/kw395la7qg9d1.jpeg?width=2252&format=pjpg&auto=webp&s=ea354d739c9e364f1f2dd7ae174c231e1339b113",
            "Salut,j’avais un cas similaire il y’a pas longtemps j’en ai croisé un en rentrant chez moi il était au sol sur le dos affaibli.\n\nJe l’ai monté chez moi et mis dans un petit bol d’eau,je lui ai donné du son d’avoine et après une dizaine de minutes il s’est envolé au balcon",
            "Commentaire pour la visibilité ✨",
            "Tu ma copinne dit (une veto pour les grands animaux):\n\n\\- don't feel it too much.\n\n\\- in a bucket so he can see the day light.\n\n\\- He will never be your friend and will no survive.\n\n:/",
            "en mangeant un  chat",
            "Je prense que fait la meilleurs choses, a ma campagne cest un croquettes pour les chats/chiennes."
        ]
    },
    "Quel est cet insecte ?": {
        "title": "Quel est cet insecte ?",
        "score": 27,
        "url": "https://www.reddit.com/gallery/1dqohqf",
        "content": "",
        "num_comments": 51,
        "comments": [
            "Tu ne trouves pas la réponse à ta question ici ? Tu la trouveras peut-être sur { r/CestQuoiCeTruc }\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskFrance) if you have any questions or concerns.*",
            "Bon en vrai c’est une guêpe maçonne. \nC’est très rarement agressif.",
            "Une guêpe maçonne. Elles sont gentilles et font des trous dans le sol.",
            "C'est une pie enculé. \n\nPutain de citadin de ses morts.",
            "Guêpe solitaire, la meilleure amie des arachnophobe car cette guêpe chasse pratiquement exclusivement des araignées \n\nFait juste attention si elle a l'habitude de venir chez toi, elle va poser des cocons sur ton lit/habits propre en terre \n\nJette les cocons sans les ouvrir, dedans y'a des araignées qu'elle endors pour les larves qu'elle ponds dedans",
            "https://preview.redd.it/2hj1h50f3d9d1.png?width=1200&format=png&auto=webp&s=9ccd1f7195663daacc0dd41eef69529e9e38b4db\n\nC'est un Dardagnan enculé !  \nPutain de citadin de ses morts !",
            "J'en ai souvent en été qui rentre dans mon appart, (ayant des baies vitrées elles rentrent et sortent facilement) elles fabriquent souvent des nids en terres par derrière des meubles ou rideaux.",
            "Merci du post, j'ai croisé la même à la campagne hier dans ma chambre, j'ai cru à une reine guêpe j'étais flippé !",
            "Un truc noir qui vole. Heu non rien, ça peut être super mal interprété en ces temps incertains.",
            "Quel est cet insecte ? Est-ce qu'il pique ?  \nDésolé pour la qualité des photos, il se déplace bien trop vite !"
        ]
    },
    "Vous êtes à quel niveau sur l'échelle de Maslow ?": {
        "title": "Vous êtes à quel niveau sur l'échelle de Maslow ?",
        "score": 15,
        "url": "https://www.reddit.com/r/AskFrance/comments/1dqqi3o/vous_êtes_à_quel_niveau_sur_léchelle_de_maslow/",
        "content": "1 - Besoins physiologiques\n\n(respirer, boire, s'alimenter, sexualité, dormir, éliminer)\n\n2 - Besoins de sécurité\n\n(environnement stable et prévisible, sans anxiété ni crise)\n\n3 - Besoins d'appartenance et d'amour\n\n(affection des autres)\n\n4 - Besoins d'estime\n\n(confiance et respect de soi, reconnaissance et appréciation des autres)\n\n5 - Besoin d'accomplissement de soi",
        "num_comments": 96,
        "comments": [
            "6 - je suis Maslow.",
            "10 - Je suis Chuck Noris",
            "4,5",
            "C'est une échelle ou une pyramide finalement ?\n\n\nVu que j'en suis a ce genre de questionnement, j'imagine 5?",
            "\"Un climat stable et la démocratie c'est à quelle étage svp ? \"",
            "C'est bizarre, parce que je suis bien à 5, mais il me manque des bouts de 3 et 4.",
            "La sexualité au même niveau que manger et dormir ? Faut pas abuser. C'est une envie, pas un besoin",
            "1 si on inclut sexualité, et je suis pas du tout d'accord sur le fait de mettre ça au niveau de boire et manger. \n\nSinon, 2.",
            "Si tu commentes sur Reddit, c'est pour essayer d'atteindre le niveau 4",
            "Niveaux 1,2 et 3 : \n\n1) écraser ses ennemis\n\n2) les voir mourir devant soi\n\n3) entendre les lamentations de leurs femmes"
        ]
    }
}