{
    "faq, wiki, trolls and you.": {
        "title": "faq, wiki, trolls and you.",
        "score": 774,
        "url": "https://www.reddit.com/r/askgaybros/comments/654b8k/faq_wiki_trolls_and_you/",
        "content": "one of the most requested features i've seen is a frequently asked questions section, and we've always had one. it's within the [wiki tab](https://www.reddit.com/r/askgaybros/wiki/) located at the top menu if you're browsing on desktop. [here's the direct link to it](https://www.reddit.com/r/askgaybros/wiki/faq), but since it's a wiki feel free to check out the other sections and please contribute.\n\nwith that out of the way, a couple things i want to clear up in case anyone is wondering:\n\n- i do not mind repeated questions. the whole point of this subreddit is to talk to people. if it's not entertaining you anymore, maybe browse it less. no, i will not sticky every other psa post.\n- i do utilize automod extensively and it helps with a lot of troll post removal behind the scene. so if you see a troll post, continue to  downvote, report, and move on, and **do not engage**. the majority of you get this, and it's been working out quite well.\n- [the rules](https://www.reddit.com/r/askgaybros/about/rules/) haven't changed, but make sure you're aware of them.\n\nhave fun.",
        "num_comments": 158,
        "comments": [
            "I read Fag wiki >.<",
            "This sub is toxic as fuck and is poorly moderated. ",
            "TL;DR have fun ;) ",
            "This is how most subs should be moderated. I rather be overwhelmed by repeated posts and troll posts than having rules stuffed down my throat and tons of restrictions. \n\nDefault subs with like over a few hundred thousand ok I understand. ",
            "love how the first five relationship questions are about straight guys ",
            "This sub is toxic. I'm out.",
            "Maybe someone can answer this for me, I’m just a random person breezing through while bored, but what’s the painting on the banner and who’s in the sun icon?",
            "> the majority of you get this, and it's been working out quite well.\n\nNot anymore, this clearly needs boosted for newer people here.",
            "Hi - How many Karma points do I need to create a post? been a member over 2 weeks and now over 100 Karma points - and still they keep getting automatically rejected!",
            "I like you and I think you are a good mood."
        ]
    },
    "Husband would rather have chemsex with randoms than have sex with me": {
        "title": "Husband would rather have chemsex with randoms than have sex with me",
        "score": 124,
        "url": "https://www.reddit.com/r/askgaybros/comments/1dln6du/husband_would_rather_have_chemsex_with_randoms/",
        "content": "\nMe (35M) and my husband (34) have been married for 8 years and the sex has completely left the marriage- it seems like he has no interest in me and doesn’t find me attractive anymore- \n\nHis excuse is he’s not horny or has a low sex drive. \n\nHowever he will sleep with virtually anyone else….\n\nI’m getting really sick of it as my sexual needs are completely neglected- \n\nI feel completely taken for granted- and effects my self esteem. \n\nI’ve tried to break up before but he resisted. I feel like my purpose in this marriage is to just pay half the mortage and clean. Nothing else. He constantly pushes me away if I go in for a kiss or a hug. \n\nHe’s assured me he still finds me attractive but he clearly doesn’t- it’s almost the case he’s the only person that doesn’t which makes it worse \n\n ",
        "num_comments": 87,
        "comments": [
            "You don’t need his permission to leave him.",
            "If he is having sex on drugs with random guys, but won't even let you hug him, I don't understand why you are wasting time posting on reddit when you should be filling out divorce papers.",
            "Maybe he does not want to break up bcaz where he will get money for drugs. He does chem sex..? That's the red flag.. He knows you loves him and takes advantage of it. Drugs, in the long run do not go well.",
            "r/deadbedrooms\n\nThe real problem here is the meth.\n\nFortunately, you're still really young. You'll find someone else easily.",
            "Life’s to short ,go solo travel and fall in love again",
            "Time to send him packing. You can at least be grateful he's not giving you whatever diseases he's picking up from other people. You're 100% being taken advantage of and used. Sorry you're going through it",
            "You're going to have to define chemsex for me here because that's completely not addressed in this post. Like what all is he doing with random?\n\n\nChem sex as most people use it, is sex with meth. That shit really realigns your horniness because it gets paired with a dopamine booster. It's subtle and insidious. He may be attracted but just not able to get horny without the right state of mind (meth/coke).",
            "If he does chem sex you need to leave him. He's not worth it",
            "You don't need his consent to divorce him.  All that you need is a good lawyer.",
            "My comment is for those in the comments and not so much for OP\n\nPeople stuck in these dumb abusive toxic relationships and secretly posting on Reddit when they know goddamn well what they need to do\n\nI’m so glad that so many of you out there are compassionate and take the time to write constructive responses because I have no patience for this shit"
        ]
    },
    "Any guys here prefer sucking cock than receiving? ": {
        "title": "Any guys here prefer sucking cock than receiving? ",
        "score": 80,
        "url": "https://www.reddit.com/r/askgaybros/comments/1dlnyja/any_guys_here_prefer_sucking_cock_than_receiving/",
        "content": "",
        "num_comments": 81,
        "comments": [
            "I know sucking a cock is probably my favorite sex act",
            "Love to suck cock and swallow 😋",
            "Definitely prefer sucking vs. getting sucked. Lots of it is to do with being circumcised and having no frenulum, thanks mom and dad. But I love everything about it. Been on a really good streak of top choice uncut dong.",
            "Definitely. I love sucking, but getting sucked gets boring pretty quick.",
            "I have a boy on speed dial who loves nothing more than sucking cock and swallowing. He doesn’t like to bottom or even finish jerking off. I even tried going down on him to return the favor, but he said he doesn’t like receiving or anyone touching him. For him, sucking cock is the ultimate joy, especially when I feed him my fresh milk.",
            "I’ve never loved receiving oral. It’s not my thing. I love giving it however",
            "Definitely",
            "Yes. And I mostly top.",
            "Yes, I'm a pro at it but can't keep it up when I'm getting sucked unless rough play is involved... It's weird",
            "I definitely do"
        ]
    },
    "What's the most homophobic thing that's happened in your town, or to you?": {
        "title": "What's the most homophobic thing that's happened in your town, or to you?",
        "score": 170,
        "url": "https://www.reddit.com/r/askgaybros/comments/1dlfkkp/whats_the_most_homophobic_thing_thats_happened_in/",
        "content": "I moved to a small Florida beach town a few years ago, very conservative, and residents are mostly retired, to the point that at the beach all you see are elderly people. A few neighbors had mentioned to me about the 'nude beach'. You have to walk quite a ways down the beach from the parking lot, and it's pretty rocky, and I'm not into nude beaches so I never went. Another neighbor referred to it as the 'gay beach'. Still not interested. Well, it seems the local police who have little to do (the most common crime is stolen bicycles) decided it would be in the public's interest to have one of the young good-looking cops hang out undercover at this beach. He arrested  6 men who supposedly 'touched' him. All were between 65 and 80 years old. The local paper thought it a good idea to shame these men by putting their names and photos on the front page. The next day, one of the men committed suicide, leaving a family behind. They  sued the police dept. for entrapment. I'm not sure what came of that, of course the paper wouldn't report that. ",
        "num_comments": 94,
        "comments": [
            "Sounds about right for Florida.",
            "I got gay bashed in high school. Small town in Hawaii. It’s cool though. I graduated a year early because of it and the guy who did it wound up in juvie. Last I heard, he had four kids from different women and has been in and out of prison over the years.",
            "Someone threw a bucket of white paint over a new mural of a drag queen that was painted on the side of our biggest gay bar. Within 24 hours it was repainted, and everyone came out to have a drink and admire the wall. Yeah it was homophobic, but the resilience of us gay people is amazing",
            "My boyfriend was great for almost a year in our 2 year relationship, but after that until the end of our relationship, he became a total ass, and even became extremely homophobic because he was arranged/forced to marry a girl 15 years younger than him back home in Afghanistan. \n\nI moved on and ended up getting together with a guy I had a huge crush on 5 years ago when we were classmates during the summer my ex left to Afghanistan without telling me. He tried to get in touch with me when he came back, but I just left him on read 😝\n\nHad another guy back when I was in HS, spread rumours and other nasty things about me being gay and whatnot. I blocked him on FB, and 5 years later, I unblocked him and found out he has/had a boyfriend 😂",
            "I didn't personally know him, but several years ago a gay guy in my area was tied up and burnt alive. RIP.",
            "A guy in my hometown went to the supreme Court to have the right to not make gay wedding cakes. And he won.",
            "I grew up in a small town and we knew a gay couple who had an active farm. A crazy person burned down their barn (with animals inside) and spray painted  “die fags” on the side. 😖",
            "Most homophobic that happened here is that many gays were burned alive at the stake.\n\nMost recent homophobic is the typical gaybashing.\n\n  \nEdit: I add the extra info here too so it's more visible.\n\n\n\nPlace is Gent in Belgium.\n\nThe first known in Europe was here is 1292. Then it went on with a peak under calvinist protestantants.\n\nThe last known in Belgium is in 1658 as then the preferred way to deal with it became to cover-up as there was the that talking about it would incite others to do it.\n\nThe northern low countries (Netherlands) continued focussing on burning gays as they remained protestant.\n\nIt's only after the Napoleonic law reforms that is was removed from criminal law. Although other generic laws were still often used to prosecute but without capital punishment.\n\nThis article from Leuven University provides some. It's in Dutch so but Google translate can do a good job at it. [https://nieuws.kuleuven.be/nl/2017/van-brandstapel-tot-homohuwelijk--boek-schetst-geschiedenis-van-homoseksualiteit-in-belgie](https://nieuws.kuleuven.be/nl/2017/van-brandstapel-tot-homohuwelijk--boek-schetst-geschiedenis-van-homoseksualiteit-in-belgie)",
            "Mm I think of only two cases. \n\n1. When in grade 9 in high school in small town canada (Ontario) I for student council put myself up for auction just to raise money for the cause. I wasn’t popular so like one person bid. But then afterwards the guy (in grade 10 or 11) tells this grade 9 I’m going to make you my b—-  like who the heck says that to a 14 year old?! Obviously I backed out told the student council to pay him back cause no. \n\n2. Tbh this was minor but just in parking lot of a Walmart guy who was once a friend just drove by (nowhere near me like I wasn’t going to be hit) and shouted “gayyyyyy”. Like wow so clever. \n\nThe bullying I got was from being autistic so naturally group of kids I thought were all my friends started FB group called we hate <insert my name here> and it’s not because he’s gay (long story). But yeah fun times. I think I would’ve rather been bullied for being gay…",
            "There's a branch of \"Mom's for Liberty\" here that tries constantly to remove the 4-5 LGBTQ+ books in our public library. The encouraging thing is that most people's attitude, even people who aren't particularly gay-friendly, is \"if you don't like those books then don't read them.\""
        ]
    },
    "Was my bf raped?": {
        "title": "Was my bf raped?",
        "score": 74,
        "url": "https://www.reddit.com/r/askgaybros/comments/1dlk14v/was_my_bf_raped/",
        "content": "Just wanted to ask this group for a bit of help with my bf. \n\nFor context he has suffered anxiety for the past 3-4 years. He told me he never had it before the incident and that he feels like he’s going to die a lot of the time.\n\n It started when he met up with this guy he met on instagram at a night club. The guy brought him into the bathroom and made him suck him off. For a long time that’s all I thought it was and didn’t really understand why it was much of a big deal. I understand the doing stuff like that at the club probably isn’t the most ideal spot but I didn’t get why we would have got anxiety from that. \n\nFor a while he didn’t bring it up much, but would mention occasionally about it. It wasn’t until a few days ago when he brought it up again that I tried to start understanding what went on. I eventually learned that my bf had asked the guy to stop. And that the guy just hold his head down on his dick and made him swallow it. Which I know my bf wouldn’t like as he hasn’t been super keen on swallowing my own. After that had happened, the guy got mad at my bf and just left the club. I also learned out that my bf had then gotten an std from him and didn’t have sex for a long time as he was very afraid of catching something from someone. \n\nIs this rape? What should I do. I don’t really know if I should be sharing this but I really need to find a way to help him and unfortunately I don’t know exactly what to do apart from maybe to go and report what happened. ",
        "num_comments": 32,
        "comments": [
            "This is rape. Period. Any unwanted sexual encounter is. Especially when they’re told no and keep doing it.",
            "Yeah, that’s rape and it’s fucked up. My boyfriend was raped too, and in my experience the best thing to do is just be supportive and love on him. Therapy is probably a good idea; it really helped my guy with the things that cuddles just can’t touch on. It was kind of a recovered memory sort of thing that came up suddenly and he was a little out of it for a couple weeks but he’s a lot better now, and we definitely owe it to therapy. I’m really sorry that happened, people are shit and your boyfriend didn’t deserve it. Good luck",
            "Yes, definitely. But please do not report it on his behalf. Victims of sexual assault are often feeling victimized a second time when they report it to the police. There are some pros and also cons to reporting this. It needs to be his decision. I think he should talk to a professional about it. Self help groups for victims of sexual assaults exist. Try to find one in your area. Maybe he might want to check it out. Just give him lots of love and understanding.",
            "He said no, and the guy kept doing it. It's rape, period.",
            "He should have bit his dick",
            "It’s Rape,  anytime a person says no, it’s rape. One thing people in general need to understand is it’s less about the actual act, but the violence,fear, and loss of control the victims experience. While the Legal term for it may vary, the results are the same for the victims.",
            "Yeah that is definitely intentional/2nd degree. \n\nHe was already passive because of an underlying deep trauma, that triggered again, and they, genuinely, froze\n\nThis is my opinion, coming from personal experience as a victim\n\nBeing vulnerable is very hard, because you think you do not have a safety net, that's why religious people call it leap of faith, scientists call it one small step for man, and agnostic people only believe if there is proof. \n\nJust even talking about it, or seeing the signs is the giant baby steps that don't look big to one party, but it's insanely huge to the one hurting.",
            "Yes; he was raped.  I think that telling you, especially if you reacted sympathetically, is the first step towards his healing.  If he's been keeping this experience bottled inside of him all this time, it's hardly a wonder that he's become anxiety ridden.  The more he can talk about it, the sooner he'll come to grips with it. If this continues to live, rent-free in his head, he might need to speak to a therapist.  Good luck!",
            "It def is rape. I am so sorry he went through this. Sending him love and hugs ❤️🫂",
            "Yes, rape. First concern is the mental health of your bf. He needs counseling and possibly meds (I have high anxiety in general). At some point, if it's healthy for him to pursue, file charges. Problem is having proof so be careful before you go down that road. It can add a lot of pressure on your bf"
        ]
    }
}