{
    "Saturday Showcase | June 29, 2024": {
        "title": "Saturday Showcase | June 29, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/AskHistorians/comments/1drao9k/saturday_showcase_june_29_2024/",
        "content": "[Previous](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Saturday+Showcase%22&restrict_sr=on&sort=new&t=all)\n\nToday:\n\nAskHistorians is filled with questions seeking an answer. Saturday Spotlight is for answers seeking a question! It’s a place to post your original and in-depth investigation of a focused historical topic.\n\nPosts here will be held to the same high standard as regular answers, and should mention sources or recommended reading. If you’d like to share shorter findings or discuss work in progress, Thursday Reading & Research or Friday Free-for-All are great places to do that.\n\nSo if you’re tired of waiting for someone to ask about how imperialism led to “Surfin’ Safari;” if you’ve given up hope of getting to share your complete history of the Bichon Frise in art and drama; this is your chance to shine!",
        "num_comments": 0,
        "comments": []
    },
    "Short Answers to Simple Questions | June 26, 2024": {
        "title": "Short Answers to Simple Questions | June 26, 2024",
        "score": 11,
        "url": "https://www.reddit.com/r/AskHistorians/comments/1dp26f0/short_answers_to_simple_questions_june_26_2024/",
        "content": "[Previous weeks!](https://www.reddit.com/r/AskHistorians/search?sort=new&restrict_sr=on&q=flair%3ASASQ)\n\n**Please Be Aware**: We expect everyone to read the rules and guidelines of this thread. Mods *will* remove questions which we deem to be too involved for the theme in place here. We *will* remove answers which don't include a source. These removals will be without notice. Please follow the rules.\n\nSome questions people have just don't require depth. This thread is a recurring feature intended to provide a space for those simple, straight forward questions that are otherwise unsuited for the format of the subreddit.\n\nHere are the ground rules:\n\n* Top Level Posts should be questions in their own right.\n* Questions should be clear and specific in the information that they are asking for.\n* Questions which ask about broader concepts may be removed at the discretion of the Mod Team and redirected to post as a standalone question.\n* We realize that in some cases, users may pose questions that they don't realize are more complicated than they think. In these cases, we will suggest reposting as a stand-alone question.\n* Answers **MUST** be *properly* sourced to respectable literature. Unlike regular questions in the sub where sources are only required upon request, the lack of a source *will* result in removal of the answer.\n* Academic secondary sources are preferred. Tertiary sources are acceptable *if* they are of academic rigor (such as a book from the 'Oxford Companion' series, or a reference work from an academic press).\n* The *only* rule being relaxed here is with regard to depth, insofar as the anticipated questions are ones which do not require it. All other rules of the subreddit are in force.",
        "num_comments": 24,
        "comments": [
            "The pre-Christian Roman polytheistic religion today is often referred to as simply \"pagan\" or \"paganism\". But did the pre-Christian Romans have a name for their belief system? Or was it so part of the cultural fabric that it didn't even need a name?",
            "Do you guys keep numbers on the remindmebot for this subreddit? If so, what was the most remindmebotted question on here ie the most anticipated historical question so far?",
            "Ive read that King Edward VI of England was so solemn that he only laughed out loud once in his life. Is this true? And if so, what made him laugh?",
            "is there any videos of the Weimar republic from the time? And are they public domain?",
            "When was the first show that aired live in television? Or perhaps live broadcasting has existed since the existence of TV?",
            "Was there any opposition to the statehood of Nevada during the Civil War, with only 40,000 settlers?",
            "How did the Taiping Heavenly Kingdom actually gain so many early followers (before taking Nanjing)?  I know that their base was from the Hakka people, but how were they convinced to form that base?\n\nI didn't want to post this in a separate thread because the answer would be somewhat subjective.",
            "In the show Shogun, the various characters are referred to as Lord [Something], with the Something being their forename, e.g. Lord Toranaga for Yoshii Toranaga. I was under the impression that using one's forename is considered rude. Am I mistaken, or have I overlooked something completely? Would this have been the practice in the era in which it is set?",
            "I wasn't really looking for a short answer but a variety of longer answers that dive into the origins and examples that led to this type of conflict among nations, but this is where the Mods have deemed appropriate:\n\nThere are a lot of examples of geopolitical entities of having generally unfriendly or hostile relations for their existence, and examples of former enemies becoming friendly and allied. **But what geopolitical entities have went from quite friendly to hostile and war in a short period of time? And what led breakdown of relations?** I'm most curious where relations were truly friendly originally, rather than a friendly facade due to say a power imbalance, etc, if that makes sense.",
            "How likely is it that Sir John Clanvowe and Sir William Neville were lovers? I've seen some people claim that they were lovers, but how likely is this? What is the general consensus among historians if there is one?"
        ]
    },
    "I am visiting my 99 year old WWII Pearl Harbor vet grandpa this weekend. What questions should I be asking him?": {
        "title": "I am visiting my 99 year old WWII Pearl Harbor vet grandpa this weekend. What questions should I be asking him?",
        "score": 262,
        "url": "https://www.reddit.com/r/AskHistorians/comments/1dqvuv1/i_am_visiting_my_99_year_old_wwii_pearl_harbor/",
        "content": "I’m incredibly interested in history, but not just that the recording and saving of the history of different peoples experiences. I want to make sure that while my grandpa is still with us I ask good questions so that perhaps his story is useful for my children and maybe others. \n\nFor additional context, my grandfather was born in 1925 Michigan. As a child he remembers life in the Great Depression. His father was a sign maker for a while with dreams of being an artist but went out of business. Several of his relatives had farms he would stay on. \n\nWhen he turned 18 he was drafted into the Navy and was deployed to Pearl Harbor in 1944. There he did various jobs around the island. He did not see combat and claims that he was part of an outfit that was going to be shipped to Iwo Jima, but was moved off of that group two weeks beforehand for unknown reasons. I think after the war ended he toured other places in the pacific before returning home. \n\nAt home he worked as an accountant for Ford and met his wife on some singles trip to meet people. He lived in Michigan his whole life. Has yet to see the lions win a Super Bowl.\n\nI’ve asked a lot of other various questions about his opinion on events, historical figures, family history, but I don’t know if there are some details that I should be asking on that I am unaware of because I’m not a historian. Please let me know if there’s anything I should ask! ",
        "num_comments": 28,
        "comments": [
            "The veterans featured in Band Of Brothers said that the attack on Pearl Harbour galvanised them because suddenly it wasnt a foreign war, it was an attack on their homes. How much does this resonate with him and the youth around him at the time? How did it change the prevalent youth culture? Was there an anti war movement at the time that fell silent because of the attack?",
            ">You might also like Studs Terkel's work.\n\nSeconded, really intensely: u/firewall245 you should absolutely check Terkel out.\n\nIm a bit surprised Terkels name doesnt come up more often on this sub, actually.",
            "If you want to get actual value out of this, and do it proper, asking random questions from strangers on the Internet without any real game plan isn't the way to go about it. Not that some of their questions might not be good to ask, but you don't want to shackle yourself with such a random approach. More go in with a general plan, and be flexible based on the responses you get.\n\nIn any case though, as for having a plan, please look up the Veterans History Project at the Library of Congress. They are a fantastic resource on this matter! Check out their page here:https://www.loc.gov/vets:\n\n>The Veterans History Project at the Library of Congress collects, preserves and makes accessible the firsthand recollections of U.S. military veterans who served from World War I through more recent conflicts and peacekeeping missions, so that future generations may hear directly from veterans and better understand what they saw, did and felt during their service.\n\nTo get the most value, and potentially make his recollections accessible for researchers even, read up about how to conduct an interview using their guidelines. [This page will give you all the information about the field kit for doing so.](https://www.loc.gov/programs/veterans-history-project/how-to-participate/vhp-field-kit/) It has all the forms to use, guidance for participation in all roles, and even sample questions to consider (and lot of them are important general inquiries which being better understanding and contextualizing of the interviewee).\n\nSo yeah, if you are interviewing a veteran, please make this your first stop. Even if you don't plan on doing it precisely their way with the intention of eventually providing that record to the VHP, just for a more casual, personal discussion it will be invaluable in guiding you.\n\nYou can also find more information about the VHP and their mission from the AMAs that the organization has held with us in the past:\n\nhttps://www.reddit.com/r/AskHistorians/comments/3zevmy/ama_the_library_of_congress_veterans_history/\n\nhttps://www.reddit.com/r/AskHistorians/comments/5e4aj0/we_are_the_library_of_congress_veterans_history/",
            "If you haven't already you can look up oral history online. There are lost of recordings to get example of what people ask, and also lists of best practices.\n\nFor example:\nhttps://guides.lib.uw.edu/c.php?g=344236&p=2319724\nhttps://oralhistory.org/resources/\n\nYou might also like Studs Terkel's work.\n\nGood luck! I interviewed my great aunts years ago and still treasure those recordings. They've all since passed on.\n\nOh and back up everything, and not just online. Keep at least one physical backup that's in a different location in case of fire and so on at home, or as a failsafe in case the cloud service fails.",
            "https://storycorps.org/participate/",
            "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/1dqvuv1/i_am_visiting_my_99_year_old_wwii_pearl_harbor/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "[removed]",
            "[removed]"
        ]
    },
    "I read that during ancient warfare, most slaughters happened when one side lost and the other routed them while they were escaping. How would the winning side, with their armor and weapons, catch up to the losers?": {
        "title": "I read that during ancient warfare, most slaughters happened when one side lost and the other routed them while they were escaping. How would the winning side, with their armor and weapons, catch up to the losers?",
        "score": 629,
        "url": "https://www.reddit.com/r/AskHistorians/comments/1dqm7bs/i_read_that_during_ancient_warfare_most/",
        "content": "I presume the losers would have lost their armor and weapons and were literally running for their lives. Also, not all winning sides would have had large cavalries to outrun people.",
        "num_comments": 62,
        "comments": [
            "This subreddit is so great",
            "Citing yourself is so badass hahahaha",
            "How big would a horse in this period be? Based on the description I'm imagining a fairly large modern horse like what medieval European knights are usually depicted riding, but I believe I read somewhere that most horses before the modern period were fairly small and about the size of modern ponies.",
            "> It is also obviously true that heavily armoured infantry will have a hard time catching up with men who will usually have discarded their equipment - in the Greek case, especially the heavy and bulky round shield - in their scramble to get away.\n\nI would have to think that the enemy also didn't break entirely at once, but in clumps and waves.  The heavy infantry probably inflicted a heavy toll as their direct opposition had crumbling formations.",
            "> It was also a general principle that the only defence was to deploy cavalry of one's own.\n\nCan you say more about this? From the battles you cite it seems that the losing side's cavalry was rarely successful in defending their fleeing infantry from slaughter; but why is that? If they were held back as a reserve to exploit victory, it seems they should also be reasonably ready to mitigate defeat - perhaps even with a counterattack against the suddenly-loose ranks of the victors, as the Spartans apparently feared. Why does it not work out that way?",
            "What would happen to men who \"gave up\", either immediately in the melee or after running and being caught. Was there a culture of mercy, or would giving up and trying to surrender be effective suicide?",
            "Is there any evidence on how common it was for wounded men to survive a lost battle?  One would think that men hit during the melee and losing blood would tend to straggle in the flight and get caught by pursuers",
            "I have been reading your content on this subreddit for what feels like almost a decade. Ive learned so much - thanks for all of it.",
            "Thank you for your work. I really enjoyed reading this and appreciate your obvious dedication",
            "Always love reading your posts, thank you for the time it took to write all this out."
        ]
    },
    "Where did soldiers get their drugs in Vietnam? ": {
        "title": "Where did soldiers get their drugs in Vietnam? ",
        "score": 97,
        "url": "https://www.reddit.com/r/AskHistorians/comments/1dqymml/where_did_soldiers_get_their_drugs_in_vietnam/",
        "content": "Lots of Vietnam docs mention how drug use was a big problem among soldiers. And wide ranging drugs from LSD to heroin. Where did they get the drugs? Was it internal ( fellow soldiers)? External? Was LSD popular among civilians there?  Seems like there was easy access and it was largely allowed. At least that’s how the docs I’ve seen present it. \nThanks! ",
        "num_comments": 15,
        "comments": [
            "Thanks for the shoutout!",
            "Not to discourage further responses, but you might find these previous answers to similar questions by other r/AskHistorians users interesting:\n\n* [How did US soldiers stationed in Vietnam during the war acquire illicit drugs?](https://www.reddit.com/r/AskHistorians/comments/x89r18/how_did_us_soldiers_stationed_in_vietnam_during/), by u/lawdoggingit\n\n* [It is commonly know that a lot of Americans were using heroin during the Vietnam war, I was wondering how did they get it? Surely there wasnt a lot of heroin going around in Vietnam](https://www.reddit.com/r/AskHistorians/comments/awop4t/it_is_commonly_know_that_a_lot_of_americans_were/), by a user who has since deleted their account.\n\n* [How prevalent was drug use during the Vietnam War?](https://www.reddit.com/r/AskHistorians/comments/1bmrht/how_prevalent_was_drug_use_during_the_vietnam_war/), by u/BrianFlanagan",
            "Thank you for your response. Unfortunately, we have had to remove it, as [this subreddit is intended to be a space for in-depth and comprehensive answers from experts](https://www.reddit.com/r/AskHistorians/wiki/rules#wiki_write_an_in-depth_answer). Simply stating one or two facts related to the topic at hand does not meet that expectation. [An answer needs to provide broader context and demonstrate your ability to engage with the topic](https://www.reddit.com/r/AskHistorians/comments/f7ffl8/rules_roundtable_ii_the_four_questions_what_does/), rather than repeat some brief information. \r\n \r\nBefore contributing again, please take the time to familiarize yourself with the [subreddit rules](https://www.reddit.com/r/AskHistorians/wiki/rules) and [expectations](https://www.reddit.com/r/AskHistorians/wiki/faq/meta#wiki_rules_discussion) for an answer.",
            "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/1dqymml/where_did_soldiers_get_their_drugs_in_vietnam/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://www.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/), or getting the [Weekly Roundup](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=askhistorians+weekly&message=x). In the meantime our [Twitter](https://twitter.com/askhistorians), [Facebook](https://www.facebook.com/askhistorians/), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "[removed]"
        ]
    }
}