{
    "Why don't Indian men wear traditional clothing as much as Indian women do?": {
        "title": "Why don't Indian men wear traditional clothing as much as Indian women do?",
        "score": 118,
        "url": "https://www.reddit.com/r/AskIndia/comments/1dr4uvf/why_dont_indian_men_wear_traditional_clothing_as/",
        "content": "I have never been to India. However I have seen many videos of daily life there. One thing I noticed was that almost all men wore t-shirts and blue jeans while almost all women wore traditional clothing. Why is that?",
        "num_comments": 194,
        "comments": [
            "This is not because of patriarchy, it's because of classism. \n\nBack in the 50s, my grandfather used to wear dhothi and go to work as a teacher, but it was seen as a \"poor people\" outfit. Doctors and lawyers and engineers used to wear Western formals with tie and shoes, which was considered as a \"rich people\" outfit. \n\nThe next generation who went to work in 70s- 80s didn't want to be considered as poor, and irrespective of their income they wore pant shirt to office. \n\nHowever, saree for women was never considered as something worn by poor people, and irrespective of class you could wear it in public. As a result, even in weddings and Indian festivals, ladies continue to wear beautiful traditional wear and men are wearing pant shirt.",
            " The burden of culture and tradition is always on the women, while men can choose what is convenient for them. \n\nThe simple answer is women weren't allowed to wear western clothes for a long time. They are wearing now but not as much as the men yet",
            "And all these comments about traditional attire for men being expensive is stupid because the cost for women is way higher because the sarees themselves (if you want good materials) would be expensive plus the tailoring charges are outrageous for blouses. \n\nAlso guess what, traditional attire’s for women ain’t comfortable either. Sarees are revealing af and I hate wearing them. So, if all these are problems for women too, then it can’t be the reason for men not wearing them unless you guys have better choices due to patriarchy.",
            "This os jow the thinking go\n\nWomen wearing jeans or modern clothes= characterless. , Trousers are meant to be for men.\n\nMen wearing modern clothes = But that's normal, What else would they wear ,saree?",
            "Women are expected to be traditional, homely etc but men have the freedom to wear whatever they want. ",
            "I do. I have worn a Sherwani at weddings in San Francisco, a winery in France, in the UK, and at my own wedding in Pune - my French wife wore a red chanya-choli. I recycled the same sherwani across those events because it looks great  \nI have also worn a Nehru jacket/bandh gala at 3 offsites for a UK company I worked for, and I still insist on wearing Indian formal men's wear at many FAANG offsites in the US. Indian men's formal wear is the bomb - it's unique and colourful and we should take pride in wearing it. I will never wear a suit and tie again, unless at a funeral - I fucking hate penguin suits.",
            "The onus of culture n tradition falls on women due to patriarchy. Men can wear anything n no one bats an eye, but society is ready to judge if a women wears western clothes, some ppl even judge basic (non revealing) stuff like jeans n t-shirts. \n\nN to all those saying Dhoti is difficult/uncomfy - same goes for Sari. If u r gonna say that women can wear kurti, then I can say that men also haive option of Kurta.",
            "my guess would be it's restrictive to wear a dhoti or kurta everyday to work or anywhere for that matter. and the cooperate world already had the dress code as formals.\n\nwoman entered the workforce much later and were allowed to kept their dress choice as long as a dress code is not assigned like certain factories woman need to wear it's uniforms / safety equipment.",
            "*Women in this sub try not to play the victim for 2 mins*\n\nChallenge level : Impossible",
            "I will happily wear a loose kurta payjama or dhotar to office. Will be so much comfortable. But corporate india is stuck with “British dress code”"
        ]
    },
    "To the women that married without falling in love, what is it like?": {
        "title": "To the women that married without falling in love, what is it like?",
        "score": 104,
        "url": "https://www.reddit.com/r/AskIndia/comments/1dr1zr0/to_the_women_that_married_without_falling_in_love/",
        "content": "Hi, this is a casual question to create a conversation about experiences of women who married without knowing or loving their partner before marriage. Just want to know if it is good or gets better, or is miserable or what? How do you deal with your partner’s interests and how does the relationship work?",
        "num_comments": 79,
        "comments": [
            "It gets better with time. Courtship is an eye wash. \n\nEverybody is at their best behaviour. Real deal starts after you actually get married.",
            "I think we should ask our older generation this. Fights and disagreements all day, no sorting things out, no helping each other, etc. Seen in all my relatives and my own parents too. I too fear I would become like them after marriage.",
            "It is like betting.",
            "Wasnt bad at all. I had an arranged marriage with a long gap between the engagement and wedding. He really respected my choices and opinions from the day we met. \n\nIt took a little work to understand what traits tick each of us off. But we're both peace and quiet-loving people. So we barely ever fought over stuff, just discussed things when we were ready for a conversation.\n\nAnd then a couple of years into our marriage I realised I wouldn't have been this content and happy with another man. He made me feel comfortable taking my own decisions, never judged, and let me be when I wanted space. \n\nIt takes a few months of living together to get to know the real person. I think I lucked out because he's never been a red flag, not in the first 6 months of our marriage not now 6 years later. The only complaint I've maintained through these years is that he's extremelyyyyy lazy and so moody. But we make up for each other's drawbacks. Like I can't keep things in order and I've always been disorganised, so he arranges everything in the house and I get things done because now I know how lazy he can be. \n\nWe just got used to each other and somewhere down the line fell in love.",
            "Reading these comments on the verge of getting 23 makes me sad and jealous. I got no life.\n\n![gif](giphy|yL4Nraa3csZXgEsySN|downsized)",
            "You mean almost all the women of your previous generation?",
            "hell",
            "My parents say HARD no.",
            "Its been surreal\n\nInitial bad phase\n\nThen a mid\n\nThen we hit real low and was on d verge of a breakup / divorce\n\nStayed seperate for 3 months \n\nGot our act together as we were miserable without each other.\n\nSet some ground rules.\n\nIts been almost 15 yrs now. I dont think i would have had a better partner than him overall. He has his quirks n icks but so do i.\n\nAlso we made very cute babies together, as hes a looker. So win win hi ha abb tak.\n\nN i was in several relations before this one n he had 1 long term.\n\nIn the end i think i am.glad those didnt work out, it may not have been so liberating.\n\nIronically, at times when people saw us in the initial years they thought we were siblings as the bickering and teasing and also the way we looked was so similar.",
            "thats like 80% women"
        ]
    },
    "I finally decided to quit Instagram: The toxicity is unbearable.": {
        "title": "I finally decided to quit Instagram: The toxicity is unbearable.",
        "score": 70,
        "url": "https://www.reddit.com/r/AskIndia/comments/1dr2mrw/i_finally_decided_to_quit_instagram_the_toxicity/",
        "content": "What's happened to Instagram? The daily updates are making it worse. I miss the old, simple Instagram UI without the Reels tab. People waste hours watching Reels, which often have poor-quality videos. Many of these videos are just about showing off bodies, including men. For example, \"let's get ready with me\" videos often start with people in their underwear. It's not that I'm old-fashioned, but I don't like this trend.\n\nPlus, the toxic behavior on Instagram is terrible. People harass and make nasty comments. A friend of mine, who is disabled from birth, posted a photo. I wanted to comment something nice like \"pretty,\" but I saw someone had commented \"adrak lag rahi ho\" (you look like ginger). I was shocked by how cruel people can be.\n\nI don't have many friends on Instagram—just 8-9 online friends and a few from university, but they rarely talk to me. So, I've decided to stop using it. I'm a bit addicted, but I'm trying to quit completely by the end of the month. Do you have similar issues with Instagram? What do you think about it? I personally think people on Reddit don't use Instagram as much. How's your experience with Instagram? ",
        "num_comments": 33,
        "comments": [
            "Mindless scrolling , not knowing why you opened that app , looking for kick from that one meme\nIt's COCAINE",
            "The honest but bitter truth is that you’re still undecided because you’re seeking validation on social media. You shouldn’t wait until the end of the month. Uninstall the Instagram app and invest your time in books and reading. Trust me, it would do wonders.",
            "Instagram/tik-tok/shorts all these apps have fried our brains to the core . Sooooo many issues : attention span , instant dopamine kicks which lead to addiction, depression anxiety and so much more 🙂 \n\nAlso the fact that consumerism has shot up like crazy . Everybody flaunts how “rich” they are (AND MOST OF THEM ARE IN DEBTS BUT THEY RENT STUFF OUT TO FLAUNT) . It has become so shallow. And don’t even get me started on the beauty standards. All of it is just pure CHAOS . It was supposed to be wholesome . Where you share your thoughts and pretty pictures . Now it has festered into something else entirely 🙂 \n\nP.S.- I still do believe social media has a power which can be used in a good way given we balance it out . But lately the BALANCE IS OFF and it’s tilted towards the wrong end entirely .",
            "Yes, people with a lack of self-control & low discipline should avoid Instagram. \n\nIt would help if you improved your time management. Seem to be a person who lacks Conscientiousness ",
            "Great job.\n\nKeep it up.",
            "Instagram has become such crap since a very very long time. Like the comments are so nasty and the posts are either disrespectful or make you feel like shit. There’s so much hate on insta. Quit it mate. Glad you could.",
            "I have uninstalled the app but not with the intention of completely quiting it. I install it whenever i feel like usually once or max twice a day. This way i have significantly reduce my consumption but idk for how many days this is going to work",
            "Instagram comments are the worst, and the algorithm makes it even harder for me to use the platform. I deactivated my account a year ago, reactivated it last month, and then deleted it again last weekend. I'm so happy with my decision.\nThe less FOMO and happier life I have, and I'm really loving it. \nOn the other hand , YouTube comments can be very wholesome. While I never watch YouTube Shorts, the comments on long videos are often good. Sometimes, on good songs, people share their love stories or life experiences, which seem so wholesome.",
            "Keep your profile private if you don't like random people stalking & adding mindless comments. \nPublic only if you're a content creator who doesn't give a f to offenders.",
            "A blind person don't know he is blind but people will make realize him  he is blind ..so we have to learn or ignore this cruel comment on social media and in real world..truth is world is cruel 😢"
        ]
    },
    "I (24m) have got hit on by 3-4 guys by now. Is this normal? ": {
        "title": "I (24m) have got hit on by 3-4 guys by now. Is this normal? ",
        "score": 50,
        "url": "https://www.reddit.com/r/AskIndia/comments/1dr2qta/i_24m_have_got_hit_on_by_34_guys_by_now_is_this/",
        "content": "Recently I’ve got hit on by multiple guys, one of them being a spanish national and another an indian. While I haven’t ever shown any interest in them in a romantic or sexual manner, I’m not sure as to what is causing this to happen? \n\nIt hasn’t been direct, but from the way they converse with me, it becomes quite clear as to what they’re hinting at. I’ve always been friendly and respectful with people, be it male or female and the same way I’ve been with them so I’ve not given them any hint or done anything that’d hint otherwise. Infact, I’m a straight guy and they know it. \n\nI’m not sure if there’s something about me which makes them feel like I’m homosexual or bisexual. I respect them and their sexuality but I’m just very confused if I am infact giving out such vibes?\n\nWhen I was 14-15 years old, I had faced unwanted touching from a random stranger when I was travelling via train. I was too small to even realise what had happened until a random person saw what was happening and started advocating me about it. He said it’s because I am very fair and good looking for a guy, thus such things happen. \n\nAll this is concerning to me because I don’t want to lead on any one like that! \n\nAm I overthinking? Is this supposed to be taken as a compliment of some kind, that I’m attracting attention from men? Because, almost any time I talk to someone about this, they brush it away as if it’s nothing. They consider that as a “compliment”, to be able to even attract people of same gender. \n\nI am soon to start looking for girls in arrange setting and I don’t want to set out any wrong impression of something I’m not.\n\nIs there something I should change in myself or it’s normal to get hit on by guys and I should simply move on?",
        "num_comments": 45,
        "comments": [
            "My dumbass thought, OP literally got beaten up.",
            "Have faced this too. I just assumed I'm attractive & moved on with my life lol.",
            "It’s not normal and I don’t think it happens to every guy bro. I’d just say, simply ignore it and move on, as long as you don’t hurt anyone. You might be from the 10% good looking guys in India and hence facing such things.\n\nGood luck 🤞🏻",
            "Stop flexing OP",
            "https://preview.redd.it/9b6h51ox2g9d1.jpeg?width=933&format=pjpg&auto=webp&s=08de78ed92c3a6680f6f50146256971e1e5770a1",
            "Grow beard ",
            "Stop taking bath",
            "You can always tell when you look around and they're already staring directly at you , directly at your face and that happens a few times. ",
            "It is not uncommon. I have been groped and hugged by more masculine gym hostel mates in bus. It was more of a comedy in front of others rather than anything romantic. I did not want or dislike it. I knew i had a more feminine appearance and better aesthetics.\nBut over time, one of them became too bold and asked for much more and would join during the baths in the pretext of saving time. Eventualy leading to full blown activity during the days when the hostel would be 99% empty during vacations.\n\nThe lesson is, that, it leads to what we know!! So , avoid and change the friends, because if friends want it , they will tempt to change our mind. Changing friends circle is best to avoid any of these harmless side quests in the game.",
            "Yes this this growing everywhere day by day , now men and boys have to go through this too .\nStay safe ."
        ]
    },
    "Is India gonna collapse?": {
        "title": "Is India gonna collapse?",
        "score": 436,
        "url": "https://www.reddit.com/r/AskIndia/comments/1dqip4y/is_india_gonna_collapse/",
        "content": "With the rise of capitalism & climate change, I really think India gonna collapse in maybe 30-40 years or maybe become like Sri Lanka.\n\n\nWe don't have as many proper hospitals to admit meedical students, competition has increased very much in everything like neet,jee,upsc,ssc and everything.\n\nLess and less jobs with less pay for freshers & young (can say this is skill issue but still one has to know 5-10 times more than earlier to land job)\n\nA typical middle class often see good schools and day care charging so much and don't even start me on private hospitals. (Capatalism)\n\nWe saw frequent electricity cuts and water scarcity. There is so much traffic on roads, potholes on roads that it takes 1.5 hours to go anywhere with a private vehicle and then there is pollution too in winters in north.\n\nWith the impact of climate change and india geography we can see 30% decrease in crop production and most parts of India unhabitable & combine it with the ineffective & inefficient methods we use that lead to water scarcity.\n\nFood yeah I think we would be able to do something on that but water scarcity?? I don't think so..\n\nWhen the D-Day comes do you think the police will help? They don't even help today and they will be the first to run considering how the police is severely outnumbered and army is like army probably gonna have free to shoot orders.\n\nI did my basic netsurfing before posting and am here to see whether other have same opinions as me..\n\nAlso if somebody thinks that all countries gonna collapse even USA please educate yourself..\n\nBy collapse I mean an internal collapse of order like emergency being declared by the government. Only the people will suffer",
        "num_comments": 422,
        "comments": [
            "I'm from East and let me tell you, the heatwave and climate change is very real. And in the long term, poor people are gonna be fucked.\n\n I've seen crops getting destroyed due to heat and water scarcity. No water in towns for 300 to 500 ft under ground. Bore wells are becoming obsolete.\n\nThough i live in NCR now, but I keep visiting my village and condition is getting worse. Farmers and their kids are not doing farming anymore. Moving to cities to get labor jobs in factories. Because inflation and they gotta feed and educate their kids.\n\nLands are becoming barren. Change in climate is affecting the crop cycle and harvesting seasons.\n\nThis means in future there will be less farming, as a result price would skyrocket. Gonna be very difficult for middle class and poor people.\n\nIn villages, not everybody does farming, some have micro business like selling daily necessities, they will be affected.\n\nWe are also losing wildlife. We don't have as much birds and animals as we did before. In NCR, I rarely see any bird. In villages, there are some but numbers are rapidly declining than what I was used to when I was a kid. I used to see fox and big cats, mongoose, snakes during monsoon, etc during my childhood, I see them very less now.\n\nSo yes, besides all the problem and civil unrest we have, climate change is the greatest danger we have for foreseeable future. \n\nI read a report where in a few years, earth's temperature would increase by 1.5 degrees permanently and it would be irreversible. There is a scientist from India who is doing campaign for it but we all know how much attention we pay to climate change.",
            "India's Growth is hampered by people not caring much about the country but looking for freebies , Politicians looking to pocket money from anything they can. 0 Social Responsibility and Accountability. \n\nI don't think from a general population pov, India is going to have a major revolution. Same time it won't collapse like srilanka. Look at Manipur objectively, state collapsed did it effect anything anywhere else? Diversity of languages and cultures is a major reason for this. Like for example People in Tamil Nadu will not care what happens in Bihar and vice versa. But if you really want to look at how India's state of affairs and it's ability to solve internal problems is look at Neet scam itself and follow it. \n\nIndians specifically are of mindsets that If it doesn't effect me, I shouldn't care about it. We can see it in Asian countries as well but not to the scale that Indians have.\n\nUnless we're saying Indian currency falls massively and now India has to live in conditions of which pre WW2 Germans faced even then \"maybe\" we'll have people taking up streets. \n\nIndia won't collapse is my answer. major shifts in economy might happen but India won't be China or in worse case scenarios won't be Sri Lanka.",
            "On a monetary basis less likely! But as a society, yes! That generally happens to hyper materialistic aspect of Asian growth. I wouldn't see this as a place where a common man can live without worrying about wealth. Infact, the growth we are experiencing will likely stagnate soon as service sector is experiencing a recession and because we haven't made the best use of this harvest, education will become more of a corporate indoctrination process.\n\nI hope that we see this change.",
            "I don't think so, no. Got my fair share of grievances with this country , and that is a LOT, but realistically speaking, India is not on its last legs by any means. Ofc the brain drain will keep increasing year after year, as will increase competition among students, but let's be honest, a shitton of companies outsource their work from here for a fraction of the cost- so jobs aren't going obsolete . Roads infrastructure etc are upgrading at a snail's pace, but upgrading nonetheless. There are ways to mitigate water crisis, and I'd like to believe that when push comes to shove, the government will have to do something about it, as not even the blindest political zealot will vote thirsty. \n\nAs for climate change, yeah can't do shit about that. Tbh I'll be leaving this country for the exact reason, this unbearable heat, added with ridiculous humidity. Literally all positivity towards my country turns sour when I see that the current temperature is close to 50°c. Ac ke bina reh nahi sakte, or AC rehte yeh problem kabhi mitega nahi.",
            "Population itni zyada hai, kuch bhi hoga bhyankar he hoga. Stop cutting trees for bridges ffs",
            "Saw the title and thought you were talking about T20 WC 😭",
            "You know what I am scared of? Crony capitalism and lack of integrity in the government beurocracy. This I think is at the root of the rot that has set in India. Look at the recent Delhi terminal roof collapse. Or the Gujarat morbi bridge tragedy. These are all indicators of the setting rot in the system. Are you really sure of the quality of the flyover you are driving on? Are you sure about the metro track that you are walking under? How can we be sure we are not walking into our own death traps set by the rot in government functioning?",
            "Calm down. India is not going to collapse. But yeah, it's about to get bad. Really bad.",
            "No. Collapse means the fall of everything. That's never going to happen. But, statistically speaking the future generations will suffer a lot more than us as the wealth gap between the rich and poor keeps increasing. But India will not be the only country with such a fate. A lot of countries will follow the same course, but I believe there is something positive going to happen in the African continent.\n\nThe problem is right in front of us. The GDP of our country is increasing but it's not really a growth indicator. Also, the stock market growth does not mean the economy is growing. Our real growth is being masked by outliers due to the immense population of the country. Our per capita and Human development index is laughable. RBI keeps devaluing the currency and increasing inflation to induce a fake GDP growth and they are pumping a lot of money into the economy via methods like reducing the interest rates, bail outs using tax payers money and quantitative easing. This will increase our exports and imports will hurt. The price of goods and stocks of companies has already reached an all time high and the bubble is soon going to burst. Our is one of the most over valued markets and I see misleading ads to people to invest in stocks and mutual funds without much knowledge on the macroeconomic forces involved.",
            "Our weather and climate is what will ultimately consume us. There are places that constantly hit 50 plus degrees already imagine that 20/30 years later with maybe another 500 mil people extra that are born. We are truly screwed in the ass. There will be no water , No food. There will be a humanitarian crisis the likes of something the world has never been before. there will be wars, death, disease and all around just despair if nothing changes about climate.\n\nWE NEED TO TALK ABOUT CLIMATE CHANGE MORE OFTEN."
        ]
    }
}