{
    "What do you think about Crimean Tatars? Have you even heard of us?": {
        "title": "What do you think about Crimean Tatars? Have you even heard of us?",
        "score": 142,
        "url": "https://www.reddit.com/gallery/1dqvhht",
        "content": "We are a majority Muslim ethnic groups that [were ethnically cleansed by the Russian dominated Soviet Union from Crimea via mass forced deportation in 1944](https://en.m.wikipedia.org/wiki/Deportation_of_the_Crimean_Tatars)\n\nMost of us still live in Crimea despite that and the current Russian occupation of Crimea in 2014 and the Russian occupation of mainland Ukraine in 2014.\n\nWe are mostly Sunni Muslims of the Hanafi School we generally are very patriotic to Ukraine, proud to be Muslim, proud to be Tatars and have extreme ill will towards Russia.",
        "num_comments": 76,
        "comments": [
            "I just want Crimea to belong to its true owners again in the future. Zaten Qyrym qyrymtatarlarnyn topragydar. Men bashqort olan ve qyrymtatar qardashlarny sevem ☪️💙",
            "I love any descendant of the Mongol Empire and the Golden Horde.",
            "Do you guys ever refer to your kids at tatar tots?",
            "Yes, I have. My mother's side of my family grew up in Crimea. She even had some Crimean Tatars as friends!",
            "May Allah return Crimea to yall",
            "crazy how russia have done zionistic conquer on hundreds of different ethnic groups stretch from eastern europe to inner asia and no one in the subs like this ever gives a shit",
            "No idea but brothers in Islam mean more to me than anyone else.",
            "ngl I learned about you guys from Europa Universalis 4. but since then I learned about the genocide and how most of them got sent to Siberia or died on the way there, and that they are not the only muslim ethnicity to have almost all of it's ppl genocided by the Russians these past 200years.\n\nalso are they the same Tatars that are in Poland ?",
            "my dad grew up in the USSR and traveled to Ukraine frequently, he had alot of Tat friends/classmates in moscow and he speaks very highly about them. Said they were as hospitable as our own. Its on my wishlist to visit kazan one day\n\nAnyone anti russia is a friend in my book 👍",
            "Your music is so cool!"
        ]
    },
    "Average Zionist. Thoughts": {
        "title": "Average Zionist. Thoughts",
        "score": 3,
        "url": "https://v.redd.it/vkmdtyps5j9d1",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Not even Batman could beat that info out of me.",
            "Dude wtf... It isn't enough that we hear the story, he also tells it in detail.",
            "Goddamn white trash",
            "![gif](giphy|IFWoALAoZn59C|downsized)",
            "Wtf 😭😭😭",
            "To download the video you can use one of the following sites:\n\n* [RedditSave](https://redditsave.com/info?url=https://www.reddit.com/r/AskMiddleEast/comments/1drdwdh/average_zionist_thoughts/)\n* [SaveRedd.it](https://saveredd.it/?url=https://www.reddit.com/r/AskMiddleEast/comments/1drdwdh/average_zionist_thoughts/) (click on the Download button below Search Video)\n* [Viddit.red](https://viddit.red/?url=https://www.reddit.com/r/AskMiddleEast/comments/1drdwdh/average_zionist_thoughts/) (refresh the page and click on Download HD Video)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskMiddleEast) if you have any questions or concerns.*"
        ]
    },
    "US officials concerned Israeli offensive on Hezbollah could drag in Russia": {
        "title": "US officials concerned Israeli offensive on Hezbollah could drag in Russia",
        "score": 7,
        "url": "https://www.middleeasteye.net/news/us-officials-concerned-israeli-offensive-hezbollah-could-drag-russia",
        "content": "According to the report, RUSSIA have also asked **Saudi Arabia** if its ok for them, if russia provideds arms to Houstis",
        "num_comments": 5,
        "comments": [
            "If the us doesn’t intervene Then russia Will also Not do anything",
            "Time to start stocking up on food ladies and gentlemen.",
            "It was nice of them to ask lol",
            "Lol The US is already balls deep there, so it's fair game for anyone else to get involved.",
            "Yeah i know"
        ]
    },
    "Are muslims being oppressed in Russia ?": {
        "title": "Are muslims being oppressed in Russia ?",
        "score": 6,
        "url": "https://www.reddit.com/r/AskMiddleEast/comments/1dr6vxp/are_muslims_being_oppressed_in_russia/",
        "content": "",
        "num_comments": 30,
        "comments": [
            "I'd rather be a Muslim in Russia than in India or China.",
            "Yes, sure. I am an ethnic Bashkir, Muslim. Russia hates Muslims and fights us in every possible way, trying to eradicate Islam and destroy our culture. Society in Russia is extremely racist and xenophobic, especially towards migrants. So yes, Muslims are oppressed in Russia. Some Arabs, fans of Russia, who think that Russia is supposedly opposing the United States, and those watching RussiaToday will tell you that this is not so. Only these people live thousands of kilometers from Russia and know nothing about this country.",
            "from what I read the government is trying to promote a light version of Islam and also more patriotic. Chechens best example of this",
            "Not in a general way",
            "I mean they exterminated multiple north caucasian ethnicities, some of them went completely extinct.",
            "No, I was there just a week ago visiting relatives",
            "From what I've seen, you can find levels of discrimination against Muslims in the societal level. But not necessarily from a state-sponsored level, at least not any more than some European countries (Germany, France).",
            "Only Crimea but that's more about ethnicity than religion",
            "Just for the record there are plenty of Muslims living fine in China, I know quite a few. It’s just the Xinjiang region and it’s not only the Muslims.",
            "There are no such problems in Ukraine. Russia is supposedly fighting “Nazis” in Ukraine, but in Russia these Nazis are legal. Sabotage, beatings of migrants, etc. constantly occur against Muslims, and this is done by legal Nazi groups controlled by the FSB. In Ukraine, there is no such thing as Muslims being beaten because of their religion, skin color or eye shape. Racism is rampant in Russia. For example, Muslims may not be given apartments for rent, although they are citizens of this country. Many Muslims are forced into war in Ukraine to pity ethnic Russians. These are simple truths that everyone here knows, but for some reason they don’t know in other countries. To be honest, Western people understand us better than other Muslims."
        ]
    },
    "Question for those who live in Europe,especially in west part, it it really became that dangerous there?": {
        "title": "Question for those who live in Europe,especially in west part, it it really became that dangerous there?",
        "score": 38,
        "url": "https://www.reddit.com/r/AskMiddleEast/comments/1dqwi64/question_for_those_who_live_in_europeespecially/",
        "content": "Just a while ago read news about student beaten to death by 18 old Syrian in Germany and other 10 guys ,because he wore a cross.  Gang crimes in France and Sweden , killings ,🍇 and other crimes \n\nIs immigrants there really that aggressive and dangerous  there or is it just west propaganda to make Muslims look bad ?",
        "num_comments": 51,
        "comments": [
            "I believe it's a significant problem that needs to be addressed, but these events are not as frequent as the media portrays. For example, if I had never been to Europe and only saw the news, I would think that the vast majority of immigrants cause problems, which is definitely not true.",
            "In general it’s a pretty overblown thing, yes of course there is areas that are pretty bad (but that is unavoidable) and yes there is always gonna be Uber religious nutcases (same as before). But the media platforms that act like there is a civil war in Sweden or that there is grapes/murders and such solely because of immigration is of course ridiculous. Id there problems because of excessive immigration on some places? Yes of course, but blaming all of (X) country’s problems on immigration is just dumb. It’s still way safer in pretty much every Western European country (provided u ain’t a complete idiot) than every Middle Eastern country (pls don’t be a nit picky scumbag, I really cba).",
            "I’ve been living in Madrid for the past 5 years. Its a very safe city. i can go out and run at 4am if I want to ( ramadan days lol ). \n\nCrimes are almost nonexistent, but I will say, theyre only small crimes, and 50% of them are caused by morrocans.",
            "There was a one knife murder near us , and it made huge news in our part of the country , since its so uncommon \n\nPoland is pretty safe",
            "I can’t speak for the rest of the rest as I live in the U.K. but it’s safe over here quite lovely",
            "Not really living there, but I figure anyone in our area of the world is aware that the news offers a version of events that is very loosely related to reality, especially when talking about specific groups of people they like to single out.",
            "I live in the west and it definitely is a problem. My dad was arrested and sent to prison, when i went to visit him 95% of the people there were from other origins. Also the stats clearly show that there is a problem.",
            "I am tired of this conspiracy talk there is very clearly an immigrant problem in western Europe and no one can prove otherwise",
            "I came back to living in Germany after 10 years outside. It seems more safe than ever. I guess there are some teenagers causing some shit sometimes but that's always there and always will be.",
            "It's exaggerated greatly lmao. These events you read in the news are rare."
        ]
    }
}