{
    "Fil hebdo : questions concernant une relation": {
        "title": "Fil hebdo : questions concernant une relation",
        "score": 1,
        "url": "https://www.reddit.com/r/AskMeuf/comments/1dn5kqr/fil_hebdo_questions_concernant_une_relation/",
        "content": "Ce fil est destiné à discuter et demander des conseils aux femmes de la communauté concernant vos relations.\n\nToutes les règles du sub s'appliquent normalement sauf la règle 1.\n\nOn vous rappelle l'existence de [r/conseilsrelationnels](https://www.reddit.com/r/conseilsrelationnels/) pour celleux qui veulent l'avis de tous les utilisateurices quel que soit leur genre, et de [r/Elles](https://www.reddit.com/r/Elles/)  pour les femmes qui veulent discuter uniquement entre femmes (ces subs sont peu actifs, on compte sur vous pour les dynamiser !).",
        "num_comments": 3,
        "comments": [
            "J'ai une question pour les meufs : je vous explique je suis en couple depuis un peu plus de 2 semaines, j'ai rencontré ma meuf sur Reddit. Au début tout se passait très bien puisqu'on se parlait vraiment beaucoup. Après elle a commencé à travailler donc elle avait moins de temps à me consacrer jusque là je comprend pas de problème. Cependant il y a 1 semaine et quelques jours, elle ne m'a pas répondu pendant environ trois jours, j'ai essayé de l'appeler mais en vain. Elle m'a dit qu' elle avait récupéré son autre téléphone car l'autre ne chargeait plus, je me dis pourquoi pas. Mais à partir de ce moment-là elle a commencé à être grave distante avec moi, elle m'a dit que c'était à cause du travail et du fait qu'elle aille voir sa tante mais personnellement si j'étais à sa place j'aurais toujours du temps à lui consacrer chaque jour, peut être pas des heures mais un temps quand même. Ma question est donc la suivante : savez vous pourquoi elle est aussi distante avec moi ??",
            "Quand on tient à une personne, on a toujours une minute dans la journée pour envoyer un message, rien qu'à la pause toilettes, avant de se coucher, pendant qu'on mange. Peut-être qu'en effet elle est très occupée, c'est sûrement vrai, mais c'est probablement couplé à moins d'envie de te parler. Sur la question du pourquoi, on peut pas deviner. Je te conseillerais juste de ne pas l'accabler de \"pourquoi\", elle t'a donné ses raisons \"officielles\", pour le reste tu ne peux que profiter de ta journée avec tes activités et tes potes. Quand elle t'enverra un message, je te conseille de ne pas te jeter sur ton téléphone pour répondre, mais de prendre le temps d'apprécier ce que tu es en train de faire, ça peut aider à maintenir une tension saine où tu n'es pas toujours le seul qui est disponible.",
            "Nickel merci à toi, juste je trouve ça vraiment bizarre car à un moment quand elle ne pouvait pas me parler pendant plusieurs jours, elle m'a dit que je lui avais beaucoup manqué, cependant elle est très distante actuellement donc c'est illogique et incohérent."
        ]
    },
    "C'est quoi le plus important avant de faire l'amour ?": {
        "title": "C'est quoi le plus important avant de faire l'amour ?",
        "score": 6,
        "url": "https://www.reddit.com/r/AskMeuf/comments/1dr0t89/cest_quoi_le_plus_important_avant_de_faire_lamour/",
        "content": "J'ai pas fait beaucoup l'amour mais je voudrais savoir c'est quoi selon vous le must avant un rapport sexuel ? Est ce que il faut s'épiler le maillot et les bourses ? Est ce que il faut se raser la barbe pour le sexe oral ? Le parfum c'est important ?",
        "num_comments": 41,
        "comments": [
            "#Bonjour et bienvenue sur r/AskMeuf !\n\nMerci de lire les règles et de vous rappeler, en toute circonstance, que ce subreddit est dédié aux questions posées aux femmes sur leurs pensées, leurs vies et leurs expériences. Il offre un espace où toutes les femmes peuvent partager leurs réponses en toute franchise et confortablement, sans être jugées.\n\n#La participation des hommes est autorisée uniquement en commentaire de second niveau c'est-à-dire en réponse à un commentaire. \nSi vous souhaitez un subreddit où tout le monde peut donner son avis, sans distinction de genre, rendez-vous sur r/AskFrance ! \n\nPensez à choisir votre flair *(Sur PC : sur le côté droit en dessous du bouton \"Créer un post\" / Sur mobile : en haut à droite, sur les \"...\", le bouton \"Modifier le flair utilisateur\")*\n\nMerci de votre attention et bonne continuation !\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskMeuf) if you have any questions or concerns.*",
            "Le plus important c'est de le faire en adéquation avec les ressentis de chacun, dans la bienveillance, la communication, et comme le disent certains ici : le consentement !\n\nLe rasage, à moins que ce soit important pour toi, n'est absolument pas un prérequis pour faire l'amour avec quelqu'un, encore moins le parfum, qui à mon sens masque les odeurs corporelles et donc les hormones du/de la partenaire, qui pour le coup peuvent être excitantes.\n\nJ'ajouterai que faire l'amour ne se résume pas à un acte sexuel. Avec ton copain ou ta copine, faire l'amour c'est passer une journée ensemble, rire, partager de bons moments, de la tendresse, etc. L'acte sexuel est en quelque sorte un bonus et les apparats comme un rasage ou du parfum n'ont à mon sens pas vraiment de poids à côté de tout ce qui fait une belle relation !",
            "A priori le premier trucs c'est de pas puer et sentir bon  ( mais faut pas déverser tout ton flacon de parfum non plus) bref être propre",
            "Comprendre le consentement et l’exprimer verbalement à son/sa partenaire tout au long de l’acte. Être capable de gérer sa contraception sans tricher. Être propre et sentir bon mais sans excès.",
            "Prévoir des préservatifs.",
            "que les deux soit consentent et de respecter quand la personne veut plus du tout le faire. le consentement est méga giga important. si ton partenaire insiste ou même te fais la gueule ça dégage, c'est de la cœrcition et c'est horrible. ( et surtout ne pas faire quelque chose que tu veux pas quand ton partenaire demande quelque chose. )",
            "Attention aux sous-vêtements aussi. Propres et pas abîmés bonjour le tue l'amour sinon.",
            "Niveau physique je dirais juste être propre. Personnellement pas fan du rasage des parties intimes ni du parfum. Quant à la barbe si tu es barbu évidemment tu peux la garder, si c’est juste que tu es mal rasé oui ça risque d’être irritant.",
            "Avoir un zgeg bien propre. Être propre. Le consentement.",
            "Ne pas oublier le brossage de dents et bien brosser la langue pour avoir une bonne haleine! ✨ sinon une bonne hygiène globale en shampouinant bien et lavant bien les coins et recoins avec un gant de toilette imbibé de gel douche. Un pschitt de parfum dans le cou suffit avant d’être sûr que le ou la partenaire aime réellement la senteur. Ensuite niveau poils il y en a pour tous les goûts, rasé ou tondu, seulement raccourci sur les bords où nature, c’est à voir en fonction des goûts du couple"
        ]
    },
    "[UPDATE] Quel film choisir pour un premier date au cinéma ?": {
        "title": "[UPDATE] Quel film choisir pour un premier date au cinéma ?",
        "score": 25,
        "url": "https://www.reddit.com/r/AskMeuf/comments/1dqp7f5/update_quel_film_choisir_pour_un_premier_date_au/",
        "content": "\n\nBoooonjouur tout l’monde !\n\n\n… … \n\n\nPardon, je sais pas pourquoi j’ai pris cette intonation. J’espère que vous ne m’avez pas donné une voix agaçante dans vos têtes quand vous m’avez lue 😔\n\n\nJe vous fais un update après une terrible journée de travail, déjà pour vous remercier et puis bhin… Pour vous raconter la suite, quoi. Ce qui est le but même d’un update 😔\n\nPour rappel, il s’agit du garçon de ma promo qui m’a offert des places de cinéma avec son numéro de téléphone. Il était venu à mon travail avec sa mère et est revenu samedi dernier pour m’inviter en me donnant un coquelicot en même temps.\n\n\nComme l’autre fois, je vous fais un résumé mais si vous voulez toute l’histoire, allez direct à l’émoji 🍪☕ pour pas vous faire spoil les retournements de situation, ouioui\n\n\nRésumé : Il est venu me chercher à mon travail Jeudi après-midi, on est allé boire un verre pour parler des films disponibles en soirée mais on a parlé tellement longtemps qu’on n’est pas allé au cinéma 😔. Il m’a demandé si je voulais le revoir jeudi prochain et j’ai dit… 🥁 …🥁 … Oui. J’ai dit oui, je sais pas pourquoi je fais la mystérieuse. Donc on ira voir ‘Comme un lundi’ jeudi prochain. Merci pour vos conseils en matière de film et tout l'intérêt que vous avez porté à mon histoire, ça m’a fait très plaisir d’échanger avec vous. Des bisous à tous les cinéphiles\n\n\nL’histoire : 🍪☕\n\n\nMaintenant, pour les belles gosses qui ont décidé de lire toute l’histoire, et parce que j’adore raconter ma vie avec des détails, prenez votre café ou votre thé \n\n\nTout d’abord, j’ai suivi le conseil qui revenait le plus : faire une petite liste de trois films.\n\nC’était un bon conseil pour pouvoir discuter avant le film et mieux se connaître. Je lui ai donc envoyé un message mardi soir, sans bonjour ni merci, ce qui fait de moi une personne très malpolie😔\n\n\n📱Mon message :\n\n“Ça te dit de venir me chercher au travail Jeudi ? Faut que tu m’aides à choisir. Je finis à 14h”\n\n\n📱Sa réponse en moins de 30 min :\n\n“Oui bien sir” (Oui, j’ai même retranscrit la faute de frappe 😔)\n\n\nNous n’avons plus échangé jusqu’à Jeudi matin où il me demande confirmation pour 14H et me souhaite une bonne journée de taf (il est certainement timide mais j’aime bien qu’il soit actif comme ça 😌)\n\n\nJour J, Jeudi 27 Juin 13 H 30, il est devant la vitrine soit 30 min d’avance😂😭\n\nBon, j’ai une bonne entente avec mes collègues donc on me laisse le faire entrer pour qu’il profite de la clim dans le magasin, quelle bénédiction la clim. Je lui propose un Minute Maid pomme (on en a des litres dans les frigo pour les clients parce qu’ils préfèrent se pinter avec notre champagne que boire nos délicieux Minute Maid mdr)\n\nJe conseille une cliente mais je le vois du coin de l'œil, installé sur le même canapé que la semaine dernière et mes collègues qui me font des petits coucou extrêmement PAS discrets. Y’a des miroirs absolument partout, évidemment qu’il voit mes collègues me charrier. \n\nBref, ma cheffe a pitié de nous et me débauche à 13 H 45. On se sauve comme deux ados alors que les seuls mots qu’on s’est dits sont : \n\n\n-”T’aimes le jus de pomme ?”\n\n\n-”Oui”\n\n\n-”Bouge pas, j’arrive”\n\n\nOn marche sans se parler jusqu’à une petite terrasse pas très loin d’un cinéma UGC pour parler des films mais surtout apprendre à se connaître. On discute de la fac, de nos profs, de nos amis qu’on a en commun (en fait, on en a aucun en commun 😔) et enfin, des films.\n\n\nPendant qu’il me parle, je remarque un petit détail qui m’avait déjà titillé quand il est entré dans le magasin : son parfum. \n\nJ’avais travaillé dans une parfumerie l’été dernier et reconnais Bois d’Arménie. Pour ceux qui connaissent, c’est un parfum Guerlain qui coute pas mal cher, tout de même, et j'hésite à lui dire que j’ai reconnu l’odeur. Je me dis que ça fait bizarre de souligner un détails comme ça, peut être même un peu psychopathe 😭\n\n\nJe me lance et dis un truc du genre : Ha mais… Ca sent Bois d’Arménie, j’adore, tu connais ?”\n\n\nC’est marrant parce qu’il laisse un petit silence alors j’essaie de combler immédiatement en lui disant que j'adore les parfums et que j’ai travaillé en parfumerie pour me faire un peu d’argent entre les cours. Mais il est toujours gêné et me dit que c’est bien son parfum mais qu’en fait, il y connait pas grand chose et que c’est son père qui lui a prêté.\n\n\nLà, c’est moi qui laisse un silence et je finis par avouer que j’ai demandé à Reddit de me conseiller des films et que j’y connaissais rien en cinéma 😭\n\n\nA partir de là, on a commencé à beaucoup échanger sur le cinéma et les parfums et puis….. On est pas allé au cinéma 😔\n\n\nOn a finit par prendre des desserts après notre verre et reprendre un verre après le dessert 😔\n\n\nFinalement, on est allé marcher au parc à côté et à 18h, on s’est laissé au métro. Oui, 18h, je travaillais le lendemain, je voulais pas être fatiguée.\n\nIl m’a demandé s’il pouvait passer jeudi prochain, j’ai dit oui et qu’on ira voir Comme un lundi. Je lui ai aussi demandé de plutôt venir 10min APRES que j’ai fini le taf, cette fois ci 😂\n\n\nOn n’a pas du tout parlé de pourquoi on se voyait. Je veux dire, c’était clairement un date mais on a pas évoqué ce qu’on cherchait, si on avait déjà eu des relations avant, on ne s’est pas touché, pas même la bise etc… \n\n\nC’était vraiment euh… Comment dire… Très doux, très lent, j’avais l’impression qu’il était très curieux, que mes réponses l'intéressaient et il relançait toujours quand je lui disais quelque chose. \n\n\nDans la discussion, il m’a dit qu’il m'avait évidemment reconnu quand il était venu avec sa mère la semaine dernière. Il voulait déjà me parler à la fac mais il a jamais osé parce que j’étais toujours avec mes amies et ses copains l’avaient découragé. \n\nFranchement, j’ai vraiment apprécié qu’il aille au-delà de sa personnalité pour m’inviter. Il m’a fait une très bonne première impression et m’a donné envie de le revoir Jeudi 😌\n\n\nMême si ça mène à rien, qu’on ne se correspond pas, il m’a déjà créé un joli souvenir et j’ai bien gardé le coquelicot. Il m’en a donné un autre quand on s’est retrouvé, d’ailleurs. Les coquelicots, se sont vraiment les fleurs de l’instant présent, à peine on avait fini notre verre, qu'il avait déjà perdu ses pétales.\n\n\nJe ferai plus aucun update sur cette histoire parce que j’ai envie de prendre ça au sérieux, donc je garde la suite pour moi 😶‍🌫️ \n\n\nMerci pour toutes vos réponses, j’ai aimé échanger avec vous et que vous preniez la peine de lire mes longues histoires me touchent beaucoup. \n\nL'été me semble déjà très doux 😌☀️",
        "num_comments": 12,
        "comments": [
            "#Bonjour et bienvenue sur r/AskMeuf !\n\nMerci de lire les règles et de vous rappeler, en toute circonstance, que ce subreddit est dédié aux questions posées aux femmes sur leurs pensées, leurs vies et leurs expériences. Il offre un espace où toutes les femmes peuvent partager leurs réponses en toute franchise et confortablement, sans être jugées.\n\n#La participation des hommes est autorisée uniquement en commentaire de second niveau c'est-à-dire en réponse à un commentaire. \nSi vous souhaitez un subreddit où tout le monde peut donner son avis, sans distinction de genre, rendez-vous sur r/AskFrance ! \n\nPensez à choisir votre flair *(Sur PC : sur le côté droit en dessous du bouton \"Créer un post\" / Sur mobile : en haut à droite, sur les \"...\", le bouton \"Modifier le flair utilisateur\")*\n\nMerci de votre attention et bonne continuation !\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskMeuf) if you have any questions or concerns.*",
            "C'est mignon comme tout, j'avais l'impression d'être posé avec une amie qui me racontait sa petite vie ! Bonne chance pour la suite ~",
            "Ça c'est de l'update qui fait plaisir! Bel été à vous deux :)",
            "C'est super bien rédigé et mignon OP, contente d'avoir eu une update :D",
            "C'est sympa comme tout cette rencontre et cette histoire! :) \n\nAvec tes emoticons 😔* j'ai crû que ça allait prendre un mauvais tournant mais contente que ça se soit bien passé hey hey \n\nJ'avoue que je me réjouissais déjà de lire la suite de cette histoire haha je suis prise dans le récit!! Que tu contes si bien ;) mais je comprends, c'est tout à ton honneur! Je me ferais la fin dans ma tête.. 😔\n\nJe te souhaite une belle suite, quelqu'elle soit!",
            "Oh c'est trop chou comme histoire. 🥰🥰🥰 Ça fait tout chaud à l'intérieur du dedans de mon petit cœur. 🥰🥰\n\nVous avez l'air trop mimi, et c'est trop chouette de se perdre dans une conversation et d'oublier l'heure, le ciné etc. Et le petit rendez-vous qui se transforme en rendez-vous hebdomadaire du jeudi j'aime beaucoup aussi. 💓\n\nJ'ai un flirt trop mignon qui dure maintenant depuis... Genre un an. On se tourne autour avec grandes précautions et petits pas petits pas. \nJ'ai l'impression qu'on ne ressent aucune urgence ni l'un.e ni l'autre, après on est dans un contexte non exclusif, et puis je suis assexuelle, peut-être que ça joue. \n\nEn tout cas comme toi je me dis que même si ça ne se concrétise pas, c'est une jolie histoire que j'aime vivre et que j'ai aimé vivre. Et puis on se dirige a minima vers une belle amitié donc rien que ça c'est déjà chouette. 🤗🤗",
            "J'ai conscience que c'était long alors merci d'avoir prit la peine de me lire, j'essaie d'écrire comme je parle 🥺\n\nJ'espère aussi que ça continuera comme ça a commencé ~",
            "J'avais promis un update alors j'y au mit du cœur haha\n\nMerci à toi aussi ☀️",
            "Grave c'est trop chou! Et les coquelicots.. 🥹😭",
            "Merci beaucoup, j'ai donné tout ce que je pouvais dans cette rédaction, à croire c'était noté 😭\n\nMerci d'avoir tout lu, je me rend compte que c'était treees long 🥺"
        ]
    },
    "C'est quand qu'on va arrêter de se vieillir et de se sentir vieilles alors qu'on l'est pas ? ": {
        "title": "C'est quand qu'on va arrêter de se vieillir et de se sentir vieilles alors qu'on l'est pas ? ",
        "score": 23,
        "url": "https://www.reddit.com/r/AskMeuf/comments/1dqmwuz/cest_quand_quon_va_arrêter_de_se_vieillir_et_de/",
        "content": "Suite à mon précédent post, je constate que je ne suis pas du tout la seule à me sentir vieille pour un rien, ou à dramatiser le fait d'avoir 30 ans ou plus, ou de les avoir bientôt. Les femmes c'est les seules êtres humains du monde à se penser vieilles à 30 ans ! Les hommes ne pensent pas ça, ils sont heureux. Ils se sentent toujours au début de leur vies à 30 ans et ils ont 100% raison. J'aimerais bien être heureuse aussi. Même 40 ans c'est jeune, t'es encore plein d'énergie, tu travailles, tu évolues, t'es bien. 30 ans c'est encore bien bien jeune. \n\nFranchement faut arrêter. 😂 ",
        "num_comments": 42,
        "comments": [
            "#Bonjour et bienvenue sur r/AskMeuf !\n\nMerci de lire les règles et de vous rappeler, en toute circonstance, que ce subreddit est dédié aux questions posées aux femmes sur leurs pensées, leurs vies et leurs expériences. Il offre un espace où toutes les femmes peuvent partager leurs réponses en toute franchise et confortablement, sans être jugées.\n\n#La participation des hommes est autorisée uniquement en commentaire de second niveau c'est-à-dire en réponse à un commentaire. \nSi vous souhaitez un subreddit où tout le monde peut donner son avis, sans distinction de genre, rendez-vous sur r/AskFrance ! \n\nPensez à choisir votre flair *(Sur PC : sur le côté droit en dessous du bouton \"Créer un post\" / Sur mobile : en haut à droite, sur les \"...\", le bouton \"Modifier le flair utilisateur\")*\n\nMerci de votre attention et bonne continuation !\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskMeuf) if you have any questions or concerns.*",
            "bonne question. J'suis tellement d'accord\n\nJ'ai 36 ans et perso, j'suis encore super jeune",
            "J'ai 35, je me sens bien dans mon âge. Pour des gens de 20 ans je suis vieille, pour ceux de 50 je suis jeune, tout est relatif. \nAvant ça me soulait de prendre de l'âge mais un jour j'ai réalisé que certaines personnes mourraient jeunes et n'avaient pas cette chance, et depuis je vois mes anniversaires comme des cadeaux.",
            "Ça fait 6 ans que je pense encore avoir 25 mdr, je me suis souvenue que \"non\" car récemment il était marqué mon âge exacte sur un papier administratif \n\nJ'crois que le seul truc qui me fait dire \"ce n'est plus de mon âge\", c'est de veiller au delà de 2h du mat",
            "J'ai 39 j'ai pris un coup de vieux récemment suite a des pépins de santé. Je me console en me disant que dans 10 ou 20 ans je me trouverai totalement stupide de me trouver vieille. Je suis aujourd'hui la plus jeune que je ne serai jamais d'ici la fin de ma vie alors je profite :D",
            "Même se \"sentir vieux\" ça devrait être beaucoup plus normalisé. Vieillir c'est un privilège ! Énormément de gens n'ont pas eut cette chance de vieillir.",
            "C'est tellement vrai ! À 30 ans je me sentais jeune mais là j'ai 43 mais je feel 68 voyons donc.... c'est débile pareil!! Pourquoi je me vieillis autant dans ma tête ?",
            "J'ai 36 et je me sens encore super jeune. Je suis active et je vois encore souvent mes amis, je crois que ça aide.",
            "Moi je pense pas ça, mais j'ai pas les réseaux sociaux ni la télé donc il y a personne pour me faire croire que je suis moche et vieille toute la journée pour me faire acheter des crèmes anti rides et du thé qui fait maigrir !",
            "[deleted]"
        ]
    }
}