{
    "What do you think about Crimean Tatars? Have you even heard of us?": {
        "title": "What do you think about Crimean Tatars? Have you even heard of us?",
        "score": 95,
        "url": "https://www.reddit.com/gallery/1dqvhht",
        "content": "We are a majority Muslim ethnic groups that [were ethnically cleansed by the Russian dominated Soviet Union from Crimea via mass forced deportation in 1944](https://en.m.wikipedia.org/wiki/Deportation_of_the_Crimean_Tatars)\n\nMost of us still live in Crimea despite that and the current Russian occupation of Crimea in 2014 and the Russian occupation of mainland Ukraine in 2014.\n\nWe are mostly Sunni Muslims of the Hanafi School we generally are very patriotic to Ukraine, proud to be Muslim, proud to be Tatars and have extreme ill will towards Russia.",
        "num_comments": 53,
        "comments": [
            "I just want Crimea to belong to its true owners again in the future. Zaten Qyrym qyrymtatarlarnyn topragydar. Men bashqort olan ve qyrymtatar qardashlarny sevem ☪️💙",
            "Yes, I have. My mother's side of my family grew up in Crimea. She even had some Crimean Tatars as friends!",
            "Refer to [this post](https://www.reddit.com/r/AskMiddleEast/s/3G6g5iujUx), we have had this asked a few times already 😊 \n\nBut in case you want to know again, Qırım Tatarlar ko’p sevaman. Meni erim Türk, ama biraz Yalıboyu ve Nogai soyu’si bar chunku qishloq’iga kop Qırım Tatarlar yashaydi. “Bağcılarda Kestane” hammasini yodim’dan bulaman, umid qilaman Güzel Qirim qaytip azad buladi! 😊\n\n- 🟦🟦🟦🟦🟦\n- 🟦🟦🔱🟦🟦 🤝 🇺🇿 \n- 🟦🟦🟦🟦🟦",
            "I love any descendant of the Mongol Empire and the Golden Horde.",
            "Do you guys ever refer to your kids at tatar tots?",
            "crazy how russia have done zionistic conquer on hundreds of different ethnic groups stretch from eastern europe to inner asia and no one in the subs like this ever gives a shit",
            "May Allah return Crimea to yall",
            "my dad grew up in the USSR and traveled to Ukraine frequently, he had alot of Tat friends/classmates in moscow and he speaks very highly about them. Said they were as hospitable as our own. Its on my wishlist to visit kazan one day\n\nAnyone anti russia is a friend in my book 👍",
            "No idea but brothers in Islam mean more to me than anyone else.",
            "Your music is so cool!"
        ]
    },
    "Question for those who live in Europe,especially in west part, it it really became that dangerous there?": {
        "title": "Question for those who live in Europe,especially in west part, it it really became that dangerous there?",
        "score": 25,
        "url": "https://www.reddit.com/r/AskMiddleEast/comments/1dqwi64/question_for_those_who_live_in_europeespecially/",
        "content": "Just a while ago read news about student beaten to death by 18 old Syrian in Germany and other 10 guys ,because he wore a cross.  Gang crimes in France and Sweden , killings ,🍇 and other crimes \n\nIs immigrants there really that aggressive and dangerous  there or is it just west propaganda to make Muslims look bad ?",
        "num_comments": 29,
        "comments": [
            "I believe it's a significant problem that needs to be addressed, but these events are not as frequent as the media portrays. For example, if I had never been to Europe and only saw the news, I would think that the vast majority of immigrants cause problems, which is definitely not true.",
            "Both hosting nations and people can’t seem to assimilate \n\nHonestly I’m not shocked this would happen lol on how some of people are behaving, it’s giving us Muslims here a bad name.\n\nAmerica did a good job In assimilating wide range of people, in second generation they already speak English, third they are American.\n\nThen again it’s just news. They cherry pick topics, make Islam look bad for people hooked on social media",
            "In general it’s a pretty overblown thing, yes of course there is areas that are pretty bad (but that is unavoidable) and yes there is always gonna be Uber religious nutcases (same as before). But the media platforms that act like there is a civil war in Sweden or that there is grapes/murders and such solely because of immigration is of course ridiculous. Id there problems because of excessive immigration on some places? Yes of course, but blaming all of (X) country’s problems on immigration is just dumb. It’s still way safer in pretty much every Western European country (provided u ain’t a complete idiot) than every Middle Eastern country (pls don’t be a nit picky scumbag, I really cba).",
            "Not really living there, but I figure anyone in our area of the world is aware that the news offers a version of events that is very loosely related to reality, especially when talking about specific groups of people they like to single out.",
            "There was a one knife murder near us , and it made huge news in our part of the country , since its so uncommon \n\nPoland is pretty safe",
            "I can’t speak for the rest of the rest as I live in the U.K. but it’s safe over here quite lovely",
            "no",
            "I live in the west and it definitely is a problem. My dad was arrested and sent to prison, when i went to visit him 95% of the people there were from other origins. Also the stats clearly show that there is a problem.",
            "I came back to living in Germany after 10 years outside. It seems more safe than ever. I guess there are some teenagers causing some shit sometimes but that's always there and always will be.",
            "Propaganda. You need to understand the west HAS to make islam look bad to stop it from spreading. \n\nWhat do you think would happen to the ultra rich if a sizeable population converts to a religion that forbids gambling, alcohol, prostitution and participation in interest?"
        ]
    },
    "What do you think of this? Is the \"freedom\" of Iran really linked with supporting Israel?": {
        "title": "What do you think of this? Is the \"freedom\" of Iran really linked with supporting Israel?",
        "score": 100,
        "url": "https://v.redd.it/0xsola2knb9d1",
        "content": "",
        "num_comments": 87,
        "comments": [
            "To download the video you can use one of the following sites:\n\n* [RedditSave](https://redditsave.com/info?url=https://www.reddit.com/r/AskMiddleEast/comments/1dqksvv/what_do_you_think_of_this_is_the_freedom_of_iran/)\n* [SaveRedd.it](https://saveredd.it/?url=https://www.reddit.com/r/AskMiddleEast/comments/1dqksvv/what_do_you_think_of_this_is_the_freedom_of_iran/) (click on the Download button below Search Video)\n* [Viddit.red](https://viddit.red/?url=https://www.reddit.com/r/AskMiddleEast/comments/1dqksvv/what_do_you_think_of_this_is_the_freedom_of_iran/) (refresh the page and click on Download HD Video)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskMiddleEast) if you have any questions or concerns.*",
            "I kept waiting for her explanation as to why you could not support “this” while supporting “this” but she kept just pointing at stuff and acting like that was an explanation",
            "I lost track of how many times she said this...",
            "The freedom of Iran is something almost utterly disconnected from the Israel/Palestine conflict.\n\nIf Israel is destroyed tomorrow then Iran would still be the same. If Palestine is destroyed tomorrow the same goes. None of this strings together properly.",
            "\"Decolonize\" why do rabid right wingers always try to include Leftist language in their propaganda? Can they not just be out and not try to pitifully masquerade as the Left? Why are they so ashamed of their own ideology? It's such a whiplash to hear \"decolonize\" followed by \"civilized\".",
            "girl pipe down, you can't even pronounce them names correctly.",
            "MFer the country you say \"stands for basic human rights\" is slaughtering civilians right now. They don't even support the right to stay alive.\n\nCreators comments on Tiktok are kinda hilarious \"There are no Palestinian jews babes\"\n\nIt's also sad how to be against their current oppression, libs from Muslim (majority) countries completely lose critical thinking. You don't need to be against everything they support.",
            "\"we deal with the similar bullshit in the region\"\n\naka arap 😎",
            "Khaleejis: Palestinians support Saddam!!1!!!\n\nPoorsians: Palestinians support Khomenei!!!!\n\nYeah Im sure a Shahist state would be democratic lol\n\nGet her rotten breath out of my face please",
            "Take a shot (halal version) every time she says “this”"
        ]
    },
    "After 10 months of Palestinians being genocided by literal colonial terrorists, the most powerful Western leaders are now using the word “Palestinian” like Its an insult. This is the state we are in.": {
        "title": "After 10 months of Palestinians being genocided by literal colonial terrorists, the most powerful Western leaders are now using the word “Palestinian” like Its an insult. This is the state we are in.",
        "score": 205,
        "url": "https://v.redd.it/uljweknxaa9d1",
        "content": "",
        "num_comments": 20,
        "comments": [
            "To download the video you can use one of the following sites:\n\n* [RedditSave](https://redditsave.com/info?url=https://www.reddit.com/r/AskMiddleEast/comments/1dqfvce/after_10_months_of_palestinians_being_genocided/)\n* [SaveRedd.it](https://saveredd.it/?url=https://www.reddit.com/r/AskMiddleEast/comments/1dqfvce/after_10_months_of_palestinians_being_genocided/) (click on the Download button below Search Video)\n* [Viddit.red](https://viddit.red/?url=https://www.reddit.com/r/AskMiddleEast/comments/1dqfvce/after_10_months_of_palestinians_being_genocided/) (refresh the page and click on Download HD Video)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskMiddleEast) if you have any questions or concerns.*",
            "Trump using it as a slur and Biden being genuinly offended, damn!!",
            "Is this a debate or Israel dick riding competition",
            "Oh I thought Hamas was the one rejecting the ceasefire offers and Israel was the one looking for peace. This is shocking! 😲",
            "Is he a bad Palestinian because he is still alive (sorta)?",
            "Tbh when some snake oil salesmen in the pocket of filthy aipac use my name as an insult I'd call that a W.",
            "my god..this is the worlds superpower….",
            "~~Presidential debate~~ Dickridding competition.",
            "And nobody is calling them out as racist?!",
            "![gif](giphy|pPhyAv5t9V8djyRFJH|downsized)"
        ]
    },
    "Morocco allows Israeli warship to dock after Spain refused": {
        "title": "Morocco allows Israeli warship to dock after Spain refused",
        "score": 167,
        "url": "https://www.middleeastmonitor.com/20240626-morocco-allows-israeli-warship-to-dock-after-spain-refused/amp/",
        "content": "",
        "num_comments": 75,
        "comments": [
            "I dont know how can a Moroccan with a brain and a bit of empathy and courage approve of this",
            "[removed]",
            "What a shame",
            "We don't need enemies. We are our own enemies. Both of these counties jordan and Morocco claims to have Hashemite lineage but I doubt it. Because that is more like a Zionist lineage and can't be related to Muslims",
            "🤮🤮🤮",
            "The regime in Morocco has started to physically support Israel. A few months ago, it only gave symbolic recognition to Israel. What has changed to justify this reorientation?\n\nThe answer is that Israel is now seriously moving towards the Lebanese theater of war, and Morocco supports any and all efforts to remove what it sees as Iran in the form of Hezbollah from the Mediterranean. Why? Because their intellectuals, from the days of Mohammed Abed Jabri, have created the idea that Iran, its revolution, and religion have nothing to do with the Western Mediterranean or even Islam for that matter, but only the Eastern MENA, which is supposedly steeped in Gnosticism and latter-day Zoroastrianism and is too close to Hindu India, where some of their propaganda claims Khomeini has his roots. If Iran rises to be a Mediterranean power, it improves its reach in the conversation of civilizations and the battle of hearts and minds. The Moroccan psychological bedrock would be shattered. The Iranian model will undoubtedly reach the medieval kingdom and topple the throne. That is why they will jump on any bandwagon that will push Iran out of the Mediterranean and back across the Euphrates. Israel is leading that charge for its own reasons, and American global power and Khaleeji money are incentivizing Rabat.\n\nWill Morocco send cannon fodder to die miserably in the upcoming war? I am afraid so. I can almost guarantee it.",
            "Sad world we live in",
            "Hazulat",
            "Why is Morocco allowing this? Wtf",
            "I'm on the side of the inquisition 3jeeb"
        ]
    }
}