{
    "ANNOUNCING THE RE-OPENING OF r/AskMenOver40! Right now it's set up exactly like AMO30, but let me know if there should be some changes!": {
        "title": "ANNOUNCING THE RE-OPENING OF r/AskMenOver40! Right now it's set up exactly like AMO30, but let me know if there should be some changes!",
        "score": 74,
        "url": "https://www.reddit.com/r/AskMenOver40/",
        "content": "",
        "num_comments": 330,
        "comments": [
            "What we really need is ask men over 50!  All you youngsters are still trying to figure shit out.  🤣🤣🤣🤣",
            "What problem are you trying to solve?",
            "My back hurts",
            "Confine relationship posts to a sub like /r/relationshipsover40 and I'm in. Otherwise, I doubt there will be a difference between the subs, especially as we continue aging.\n\nIf that isn't possible, make a separate flair for friendship/family vs romantic relationships to keep the two distinct streams from crossing.",
            "Yes please to both AMO40 and AMO50.\n\nLearning is a lifelong journey. I constantly remind myself that getting older is mandatory, but growing wiser is optional. Some days I need that reminder more than other days.",
            "Do we 40+ guys need to move now? :-o",
            "See you in 7 years!",
            "Thanks for reminding me that I'm over 40... I never give my actual age much thought but these reminders are always fun.",
            "I hope you will allow the “Things I’d tell my younger self” type of posts.  As I’m now getting older, I would like to help out younger men by sharing my mistakes.",
            "I get an error message whenever I try to look at the old Reddit address of the sub. Weird."
        ]
    },
    "How many of you actually do shit on the weekend?": {
        "title": "How many of you actually do shit on the weekend?",
        "score": 52,
        "url": "https://www.reddit.com/r/AskMenOver30/comments/1dr22sf/how_many_of_you_actually_do_shit_on_the_weekend/",
        "content": "Honestly I feel like chilling on my weekend at home, playing games, going to the gym in the afternoon, catching up on tv and actually having time to cook dinner on the weekend is better than going out. \n\nGranted I don't have a massive social circle and two chronic autoimmune conditions, but the older I get the more I just want to decompress on my weekend by fundamentally 'doing nothing'. \n\nMakes dating a little rough lol",
        "num_comments": 64,
        "comments": [
            "Please do not delete your post after receiving your answer. Consider leaving it up for posterity so that other Redditors can benefit from the wisdom in this thread.\n\nOnce your thread has run its course, instead of deleting it, **you can simply type \"!lock\" (without the quotes) as a comment anywhere in your thread to have our Automod lock the thread**. That way you won't be bothered by anymore replies on it, but people can still read it.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskMenOver30) if you have any questions or concerns.*",
            "I personally shit every day after breakfast. ",
            "https://preview.redd.it/hmwcm9acxf9d1.jpeg?width=3693&format=pjpg&auto=webp&s=0ba9503badfe41351b5d94c1b57c3b4783bf5538\n\nEvery weekend. 👍🏼\n\nI usually ride with my local club for pastries and drinks. It’s a great way to explore, make friends, and stay fit.",
            "Same as every other day, absolutely nothing.",
            "\\*raises hand\\*\n\nTaking graduate classes, completing house projects, smoking meat, painting minis, going out for sushi and a show, and later hosting a game night are all a routine part of my weekends. My workdays are generally more relaxing than my weekends.\n\nIf by \"going out\" you mean getting drunk barhopping and eventually trying to get laid at a nightclub, stopped that shit in my twenties once I settled into a LTR. That actually detracts from the shit I'm trying to get done, makes me lose a day to hangover, and annoys my partner.",
            "I tend to mix it up. Some weekends are busy with family stuff or friends and other weekends busy with chores and projects around the house. Others still are getaway weekends with the whole family or sometimes just me and the wife. And finally, about once every 6 weeks or so, we do absolutely nothing but stay at home.",
            "In the winter I go skiing. In the summer I go hiking, camping and out of state to visit friends. All throughout the year if I'm not going somewhere else I'm taking circus classes and training, going out to shows and doing things with my friends. I hate doing nothing.",
            "I'm going through an extended rough patch (far from the roughest but still struggling) and my work week totally evades routine and can entail a lot of bustle and overstimulation, so for now the weekend priority is to just wander off into the woods or do and think about as little as possible \"of substance\" and just rest and operate on my own timeline, when I can. Sometimes it sets me back, at times it can feel empty or I really end up paying for it, but I still largely savor it. I really don't care what anyone thinks. Otherwise, life admin when it's necessary. It's just me and my dog, so I can get away with it.",
            "I make investments on pay day, then live like i am flat broke. It changes, but right now, my weekends consist of archery and hiking. Because, free and free.",
            "I’m actively involved in trail and ultra running and mountain running season just began, so I’m stoked right now! I just got back from running in the Central Sierra and will be doing a Tahoe trip in two weeks, followed by an Eastern Sierra trip, then the North Cascades, then Sawtooth Wilderness, then maybe Colorado, more Sierra, and finally The Adirondacks or Vermont for fall running. I usually car camp for all of my Sierra trips since I live 3-6 hours away depending on the area. And I’m going to Mendocino with my GF this weekend. \n\nI literally save up all my PTO for mountain season and then unload it lol."
        ]
    },
    "what's something you did as a kid you wish you could do today?": {
        "title": "what's something you did as a kid you wish you could do today?",
        "score": 22,
        "url": "https://www.reddit.com/r/AskMenOver30/comments/1dr091t/whats_something_you_did_as_a_kid_you_wish_you/",
        "content": "For me its ride my bike. I have a bike, and I can ride it, but when I was a kid I would ride all day long, everyday, all around my town and in the woods. My friends and I went everywhere. We were free. ",
        "num_comments": 28,
        "comments": [
            "Please do not delete your post after receiving your answer. Consider leaving it up for posterity so that other Redditors can benefit from the wisdom in this thread.\n\nOnce your thread has run its course, instead of deleting it, **you can simply type \"!lock\" (without the quotes) as a comment anywhere in your thread to have our Automod lock the thread**. That way you won't be bothered by anymore replies on it, but people can still read it.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskMenOver30) if you have any questions or concerns.*",
            "I'd like to spontaneously walk over to my various friend's houses in the neighborhood and find at least one of them that is available to hang out and have good times. Now, everyone is so busy adulting that everything has to be planned in advance, typically requires at least a 30 minute drive, and, usually, has to revolve around the various work and kids' schedules. It's practically amazing when a scheduled get together goes off as planned, with all parties participating, and no one having to bail or leave early due to something coming up last minute or during.",
            "Rediscover masturbation",
            "Just... not have the weight of life on my back.\n\nI was a responsible kid and worked hard and accomplished things, but now I feel like I could enjoy life then because other people were handling the details.\n\nNow it's all on me.  Work, finances, insurance, cooking, cleaning, fixing, maintaining, appointments, planning, remembering...  All on my shoulders.  I can't relax and there isn't room for enjoyment.",
            "I agree with OP about being outside on a bike all day, and I’ll add just the ability to be outside in the summer heat for hours without getting too exhausted and overheated. Now I can’t stand to do lawn and garden work in the heat. \n\nI have another thing… I was a competitive gymnast from age 7 to 19. I could still do a back flip until I was about 35. Now I wish I could do a damn cartwheel in the yard without getting dizzy and nauseous.",
            "Play baseball, street hockey, soccer, just about anything until we got tired or the street lights came on or it got too hot.",
            "Speak and do farm chores with my dad.",
            "Get midnight birthday txts from excited friends that cared about me.",
            "You can be free and ride all over today but it’s just not the same.\n\nLike you, I have a bike and I can ride anywhere I damn please but it’s not the same. There’s no disconnecting and just going freely. I hope I find that again in life. Maybe hiking a long trail or traveling. Those were the days.",
            "Cartwheels\n\nAnd I’m not even joking"
        ]
    },
    "Is it normal to become numb when you get older?": {
        "title": "Is it normal to become numb when you get older?",
        "score": 7,
        "url": "https://www.reddit.com/r/AskMenOver30/comments/1dr3qdt/is_it_normal_to_become_numb_when_you_get_older/",
        "content": "I'm 30 and i don't know what has happened to me, but i feel very numb these days i mean emotionally. I don't really feel much when i'm with a women or care much about people except for a few people. Is that normal for a man as you get older? I guess experiences make you a bit jaded in a way",
        "num_comments": 11,
        "comments": [
            "Please do not delete your post after receiving your answer. Consider leaving it up for posterity so that other Redditors can benefit from the wisdom in this thread.\n\nOnce your thread has run its course, instead of deleting it, **you can simply type \"!lock\" (without the quotes) as a comment anywhere in your thread to have our Automod lock the thread**. That way you won't be bothered by anymore replies on it, but people can still read it.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskMenOver30) if you have any questions or concerns.*",
            " I mean who could handle the high drama 24/7 that is being in your teens and early 20's for a lifetime? I certainly still feel the full gamut of emotion as a 50 yr old, these days Im more reserved in what, and who, Im feeling it about. Im very \"ok... whatever\" about a lot of things these days.",
            "Honestly could be depression, a lack of feelings where you don’t really feel anything is a regular symptom.",
            "For me its similar. Though i’ve also been fairly introverted for a long time so its not a big leap between the two. I still care about things, of course, but i typically try to manage how much energy i expend when its something of little importance.",
            "This is the clinical definition of depression",
            "Not if you discover psychedelics.",
            "I am the same. I find it hard to emotionally give a shit about anyone. After extensive research I'm fairly certain I have burn out from undiagnosed adhd.\n\nYou might say go to a doctor but if I can't finish school or adult entry uni or any online courses I doubt I will ever get to a doc.\n\nGet a dog. It's probably the only thing you'll love and give u conditional love back",
            "If you are lucky, you'll become more aware and truthful to yourself. You will reflect on how you have been making drama out of most of your life and will try to avoid it. You'll become more selective and intentional about what and who you share your energy with."
        ]
    },
    "Hey guys. I'm 41, single dad, working construction. I'd like to finally go to school and get a degree. I'm wondering how it's done though? ": {
        "title": "Hey guys. I'm 41, single dad, working construction. I'd like to finally go to school and get a degree. I'm wondering how it's done though? ",
        "score": 77,
        "url": "https://www.reddit.com/r/AskMenOver30/comments/1dqkgl3/hey_guys_im_41_single_dad_working_construction_id/",
        "content": "To clarify, I understand fafsa,grants, scholarships, and all that. I think I can get tuition and whatnot covered. My question is, without a spouse to help, how did you single dad's afford life besides college? How did you pay your mortgage, childcare or school fees, just the general costs children bring, food, bills, health insurance, etc? \n\nMy job is physically exhausting. I've tried doing some Kahn Academy courses after work just to see how I do and I can barely keep my eyes open, let alone focus. There's nobody in my industry that will let me work part time. So, what did you guys do? \n\nI'm half tempted to pick up a bartender position in my small town. Or, maybe do a r/sweatystartup and offer power washing and mowing services, but my area is absolutely saturated with those. Also, being 41, not only do I not have enough time to do school part-time (man, i don't want to be 49 and starting a new career), but I also don't think I have it in me to continue in this industry for another 8 years. \n\nSo, here i am, hat in hand, asking for help from you single dad's that did it. I can't keep doing construction and I can't just quit and go to school. How does this work???",
        "num_comments": 111,
        "comments": [
            "Please do not delete your post after receiving your answer. Consider leaving it up for posterity so that other Redditors can benefit from the wisdom in this thread.\n\nOnce your thread has run its course, instead of deleting it, **you can simply type \"!lock\" (without the quotes) as a comment anywhere in your thread to have our Automod lock the thread**. That way you won't be bothered by anymore replies on it, but people can still read it.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskMenOver30) if you have any questions or concerns.*",
            "You might just want to try pivoting within the construction industry to a non-physical role. \n\nYou could try recruiting, sales, project management, construction management, inspector, etc. \n\nDegrees aren’t worth what they used to be. Be careful.",
            "Check with a community college first. Many states have agreements where you can transfer the associates degree to a a bachelors degree. Besides I’d think that a community college would help you decide where you want to narrow down what you specialize in",
            "So i went back to school for my Master's in my early 30's.\n\nI mean, **it sucked**. I'd work all day, come home and have to do my family time like cooking/cleaning. Then at dark i'd drive up to campus for night classes. It sucked. I had to drop most my hobbies. I had to study on the weekends, and sometimes on my lunch break. It sucked. (yes i know i typed that out 3 times)\n\nBut once i was done, i immediately got a better job/promotion. So **it was worth it**. I just hated every minute.\n\nMy undergrad was in computer engineering. My Masters is MEng (not MS).",
            "I see a lot of people suggesting \"IT\" as it can be done in \"a year\" or less. This is only if you are taking a quick course that will get you an IT certificate (A+, MCP, etc.) at the end, not an actual bachelors degree.\n\nGoing back to college as an adult with kids and real world responsibilities makes it VERY hard. You will have to sacrifice time from other areas of your life to REALLY focus on the classes you are taking. Also, if you don't take a full class load then expect a 4 year bachelors degree to take more like 5-6 years, depending on how many summer courses you can fit in.\n\nIf you simply don't want to continue doing physical construction, then I would suggest evaluating other skills you have and trying to find other positions that fit those skills. Cross reference your pay with open positions in your area. You could also look into remote customer service/help desk type positions that can be learned fairly quickly on the job and have a generally ok starting wage.",
            "There are so many schools now that have online programs and many are either low residency or no residency (residency just means on campus). \n\nMy opinion: Avoid the “online” colleges if you can. Purdue, Penn State, Arizona State and many more have a “world campus” or “distance learning” programs. \n\nPut a fair amount of research in and you can find a program you want at a reasonable price. THEN … once you’re set on this school and this program, email the admissions folks (they’re not hard to find) and say I want to do this program at your school and I need to do most or all online because of these reasons, help me figure it out. They will. Their entire job is to get people enrolled so if you don’t sway from what YOU want, they’ll work it out somehow.\n\nSource: worked at a university for 4 years. \n\nGood luck dude. \n\nI leave you with a quote: Chinese proverb — It does not matter how slowly you go so long as you do not stop.",
            "call a local university and speak to an admissions counselor.",
            "I know this is going to sound insane and doesn't really answer you direct question, but have you considered driving buses in public transportation? In my area, new drivers are making ~100k in the first year and max out their annual salary at around 85k after 5 years. Yes, you work nights, weekends, and some holidays (at 1.5 to 2.0 pay), but it's a pretty good gig if you have a clean record.\n\nI can appreciate the position you find yourself in. Be bold. Make hard decisions and stay true to yourself. Your kids would benefit more from a happy father following his inner guidance than having a room of their own.\n\nGood luck, man. Hang in there.",
            "what career are you looking to get into?\n\nIT -- sysadmin, data analytics, could be done in a year with part time studying. say an hour a day and 8 hours on the weekend.\n\nI friend of mine went from EMT to pentester (ethical hacker) in a year, and 3 years later he's head of cybersec for a oil company.",
            "It’ll be really really hard. I’d suggest another route.\n\nMy niece switched to IT at 41. She took a traineeship of 3 months that led into an entry level job. When she could leave without having to pay the traineeship back she switched to a company with a good educational plan that helped her study next to work. \n\nBut even with income.. it’s long days"
        ]
    }
}