{
    "AskPH Lounge: Share Your Random Thoughts Here": {
        "title": "AskPH Lounge: Share Your Random Thoughts Here",
        "score": 19,
        "url": "https://www.reddit.com/r/AskPH/comments/1c45kw7/askph_lounge_share_your_random_thoughts_here/",
        "content": "Welcome to the AskPH Lounge! 🌟\n\n&#x200B;\n\nThis is your space to unwind, share your musings, and connect with fellow members of the AskPH community. Whether it's a fleeting idea, an amusing observation, or a profound reflection, feel free to express yourself here.\n\n&#x200B;\n\nRemember, diversity of thought is what makes our community vibrant! So let your imagination roam free, engage with others' thoughts, and enjoy the camaraderie.\n\n&#x200B;\n\nLet the random thoughts flow! ✨",
        "num_comments": 119,
        "comments": [
            "Idk after what happened to bini, parang nag-iba na pagtingin ko sa iba sa kanila, especially they advocate \"woman empowerment\".\npinipilit ko namang huwag, pero it's giving me the icks na. sorry, pero I'm trying naman. I'm still a fan, love their songs!",
            "si reddit lang kausap ko araw araw, nobody else.",
            "nakakatamad na ang lahat ng bagay",
            "New to this sub. Grabe, ito na ata ang bagong [ASK.fm](http://ASK.fm), hahaha. Calling out the millennials out there who spent their teens during the late-2000s and early-2010s.",
            "I'm seeking genuine reviews and recommendations for pure honey. Despite trying various local brands, my intuition suggests they may not be authentic, as many taste like caramelized sugar. I've also sampled commercial honeys available in grocery stores, and I find Langese, Capilano, and Sue Bee seems to be genuine, albeit pricier options. However, I prefer to support local brands and would appreciate recommendations within that category.",
            "may ganito pala dito hahahaha nakasort by new posts ng sub sa phone ko so di ko kita pero i see it now. random thought: anyone who grew up constantly in front of the cameras had a not desirable childhood.",
            "Hi! Are packages from love yourself discreetly packed? Kumuha ako ng free HIV test kit sa kanila and it will be shipped via LBC. Anyone na naka-try na if it's discreetly packed?",
            "Bakit pag Pinoy subs, pag nag popost ako auto downvote, kahit sa mga comments minsan na in general I'm just thanking and replying the person who gave me advice? Ang weird lang kasi parang may mali sa ginagawa ko pero sinesearch ko naman yung tanong ko sa subreddit and wala pa talagang nakatanong nung tanong ko na specific sa situation ko. Comparing this to foreign subs/non-pinoy subs, wala pang nag d-downvote sakin for simply asking a question? I don't really care about the karma itself, curious lang ako kasi napansin ko ganito sa mga pinoy subs that I've been on but hindi talaga sa non-pinoy ones?",
            "I forgot how learning can be fun.\n\nMost parts of my life, I often hated learning in school. I cram and delay things cause I just wanna do things that I enjoy like playing games and scrolling through soc meds.\n\nRight now, I blame myself for creating these unhealthy habits. I'm struggling to do things at work. Hays. Totoo talaga na kung ano yung ginawa mo nung nasa school ka, yun din ang dadalhin mo pag nasa workforce ka na. \n\nI'm tired of disappointing myself and my superiors.",
            "help im looking for a video\n\nits a showtime episode na yung girl ay dapat magpapakita ng talent niya (dancing) and yung ginagawa niya lang nung una is maglakad"
        ]
    },
    "Join the r/adviceph Community for Support and Guidance!": {
        "title": "Join the r/adviceph Community for Support and Guidance!",
        "score": 9,
        "url": "https://www.reddit.com/r/AskPH/comments/1cam5x4/join_the_radviceph_community_for_support_and/",
        "content": "Hey everyone! Looking for a supportive community where you can share your experiences, seek advice, or offer guidance to others? Join us at r/adviceph! Whether it’s relationships, career dilemmas, or just navigating life’s ups and downs, we’re here to lend an ear and help each other out. Come be a part of our growing community! See you there! 🌟",
        "num_comments": 1,
        "comments": []
    },
    "Anong sign na manyak ang isang lalaki?": {
        "title": "Anong sign na manyak ang isang lalaki?",
        "score": 98,
        "url": "https://www.reddit.com/r/AskPH/comments/1dr3mbg/anong_sign_na_manyak_ang_isang_lalaki/",
        "content": "Para maiwasan. ",
        "num_comments": 194,
        "comments": [
            "Hello everyone,\n\nBefore joining this discussion, please take a moment to review the rules of r/AskPH [here](https://www.reddit.com/r/AskPH/wiki/full-rules), as well as the [Reddit Content Policy](https://www.redditinc.com/policies/content-policy).\n\nComments that violate these rules will be addressed accordingly. You can learn more about our rule enforcement process [here](https://www.reddit.com/r/AskPH/wiki/rule-enforcement).\n\nIf you need to appeal a ban, please follow the process outlined [here](https://www.reddit.com/r/AskPH/wiki/ban-appeal-process) in r/AskPH.\n***\n\nThis post's original body text:  \n\nPara maiwasan. \n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskPH) if you have any questions or concerns.*",
            "kapag palaging sinisingit mga green jokes or anything na pag uusapan sisingitan ng mga sexual shit",
            "manyakis here, lahat ng sinabi dito totoo lol",
            "Kiss and tell. Nagyayabang sa mga kaibigan",
            "1. Touchy\n2. **Mahilig sa SEXUAL JOKES na wala na sa lugar at parang normal lang sa kanya**  (legit na legit 'to  🚩 🚩 🚩)\n3. member ng GC or private telegram ng mga manyak\n4. Mahilg tumingin sa legs or cleavage ng girls\n5. karamihan sa CHEATER mga manyak",
            "Post ng post sa r/phr4r",
            "I think this is asking the wrong question.\n\nMost girls like it when their partner is \"manyak\" in the bedroom, right place, right time.\n\nLots of guys are high-libido manyakis sa kama.\n\nI've sent a dick pic or two to a partner I was in a relationship with and in the context of the situation, we both enjoyed that interaction.\n\nThe question would be, do they keep it only in the right place and the right time, and understand **consent**.\n\ni.e. things like catcalling, indecent exposure to an unwilling party (whether in person or via unsolicited dick pics), not respecting consent etc.\n\nEto yung dapat iwasan. And I think these guys out themselves early on.\n\nAnd syempre pag dating stage palang kayo, he understands his limits, and consent really plays the biggest part here \n\nHirap din yung lalaking walang libido, dead bedroom kahit kayo na.",
            "Naglalabas ng tite sa bus",
            "you: \"ligo muna ako\"\nthem: \"sama ako\"\n\n... ick",
            "If they ask if you've done it na ba. Even yung mga \"nice guys\" pa. Some nice guys aren't really nice."
        ]
    },
    "What's your way of saying “I love you” without saying it?": {
        "title": "What's your way of saying “I love you” without saying it?",
        "score": 127,
        "url": "https://www.reddit.com/r/AskPH/comments/1dr1d9t/whats_your_way_of_saying_i_love_you_without/",
        "content": "I try to include them in everything I do, games, events, etc. ",
        "num_comments": 252,
        "comments": [
            "Hello everyone,\n\nBefore joining this discussion, please take a moment to review the rules of r/AskPH [here](https://www.reddit.com/r/AskPH/wiki/full-rules), as well as the [Reddit Content Policy](https://www.redditinc.com/policies/content-policy).\n\nComments that violate these rules will be addressed accordingly. You can learn more about our rule enforcement process [here](https://www.reddit.com/r/AskPH/wiki/rule-enforcement).\n\nIf you need to appeal a ban, please follow the process outlined [here](https://www.reddit.com/r/AskPH/wiki/ban-appeal-process) in r/AskPH.\n***\n\nThis post's original body text:  \n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskPH) if you have any questions or concerns.*",
            "Pipiliin kita sa anumang panahon at sa anumang sitwasyon",
            "Not ending my life because I still want to grow old with her.",
            "Quality time:\n1. Willing ako mag file ng leave in advance \n2. I can wake up early to meet the person I love\n3. Planning vacations and having spontaneous trips\n4. I don’t have social media anymore so old school May physical album ako\n5. Inuman is about kwentohan\n\nPhysical touch:\n1. Pag partner if sexually speaking may eye contact at passionate kiss at feeling secured, sex for me is something intimate\n2. Hugging in bed. Sa ex ko kinukumutan ko talaga\n3. The simple hugs and kisses you give and receive \n4. Magka tabi sa jeep, kama (kahit nag lalarono cellphone pareho), and so on\n5. Random hugs",
            "Helping someone despite struggling myself.",
            "ako na gagawa thesis mo\n\n\n\nchz",
            "Sinasama lagi sa prayers. :'))  \n\nlike pls lord kung may mga bagay siyang di mabanggit  sa akin sa relatives niya, friend et al, na nakakadulot ng balisa sa kaniya, sana wag siyang magkailang lumapit sayo at masolusyunan w/ u.",
            "Cooking for them 💗",
            "\"Ako na bahala\"\n\n-as an \"acts of service\" ang love language ☺️",
            "Acts of service. Ito highest form os saying i love you sa partner mo, you say \"I love you\" sa partner mo verbally, pero it can be faked/not genuine. Ang acts of service hindi mo mapepeke yan."
        ]
    },
    "What's a gift you'd love to receive but no one even considers giving you for some reason?": {
        "title": "What's a gift you'd love to receive but no one even considers giving you for some reason?",
        "score": 42,
        "url": "https://www.reddit.com/r/AskPH/comments/1dr2y28/whats_a_gift_youd_love_to_receive_but_no_one_even/",
        "content": "It could be they think you're too old for it, your gender don't match the gift, or they assume you're not interested in it.",
        "num_comments": 119,
        "comments": [
            "Hello everyone,\n\nBefore joining this discussion, please take a moment to review the rules of r/AskPH [here](https://www.reddit.com/r/AskPH/wiki/full-rules), as well as the [Reddit Content Policy](https://www.redditinc.com/policies/content-policy).\n\nComments that violate these rules will be addressed accordingly. You can learn more about our rule enforcement process [here](https://www.reddit.com/r/AskPH/wiki/rule-enforcement).\n\nIf you need to appeal a ban, please follow the process outlined [here](https://www.reddit.com/r/AskPH/wiki/ban-appeal-process) in r/AskPH.\n***\n\nThis post's original body text:  \n\nIt could be they think you're too old for it, your gender don't match the gift, or they assume you're not interested in it.\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskPH) if you have any questions or concerns.*",
            "Flowers. I know it's a waste of money but it'll be nice to receive them once in a while.",
            "Flowers! Some women don't like them, pero ako I would like to receive one. For others, malalanta naman daw 🤷",
            "Flowers..",
            "Ma-surprise sa birthday ko with cake. \n\nAs a giver, sobrang saya naman sa feeling ko nung mga panahong nangs-surprise ako/kami ng birthday ng frenny namin.. pero I wonder din if mas masaya ba yung feeling ng ma-surprise? 🥹",
            "A rolex",
            "Surprise planned birthdays or surprise gifts from friends.\n\nThis stemmed from high school where my group of friends would collect birthday notes and messages (to create a message board) from each other and outside the circle, sometimes including notes from teachers of the celebrant. Since my birthday is a no-school day, all of them lacked the effort to write the message board they didn't even bother asking my friends outside the circle. They made an effort to make each other a message board but mine was half-assed and rushed.\n\nI don't think I'll ever have a surprise planned birthday or gift which is alright. However, it would feel good to have one.",
            "surprise sa bday. haha lagi ako present sa mg ganyan sa friends ko pero pag sa akin, wala. so ewan",
            "Maraming pera po",
            "my fav book and flowers 🥹"
        ]
    }
}