{
    "What are some easy, non-sexual ways to please a man?": {
        "title": "What are some easy, non-sexual ways to please a man?",
        "score": 1401,
        "url": "https://www.reddit.com/r/AskReddit/comments/1dr7497/what_are_some_easy_nonsexual_ways_to_please_a_man/",
        "content": "",
        "num_comments": 1594,
        "comments": [
            "My wife will come up to me and give me a big hug and bury her face in my chest and just talk about how much she missed me and literally melt into me. I love it.\n\nEdit: Just got home from night shift and she crawled out of bed all sleepy and plonked herself into my chest. Thats the good stuff boys",
            "Feeding, praising, and back scratches. Were basically puppies.",
            "I fed mine one time and they really seemed to enjoy it.",
            "As an average man myself, i think if somebody just gave me a cool looking rock, i'll be pleased",
            "Listen to me blather on about my stupid hobbies that you have no interest in and ask some questions to help me blather on more.",
            "Feed him. Scratch his head and beard (if he has one) with your nails, especially if they're fake it feels so good!!!! Rub his shoulders. Compliment him. If you like his shirt, or how he's styled himself or his hair, or how he smells TELL HIM. Most men do NOT get compliments AT ALL!! As a man myself, on the rare occasion, I do get a compliment it makes my frigging day and my heart melt. If the man is important to you, TELL HIM. If he's your best friend, TELL HIM. If you appreciate him, care about him, etc. TELL HIM. If you consider him like a brother again, TELL HIM.",
            "let him finish ur food",
            "A simple hug and an affirmation is what most of us are starved for. A simple \"thank you for everything you do for us\" goes a long way.",
            "Im a guy and the best ways my Mrs makes me feel are with simple rubs and cuddles, I will walk by her and she will drag her hand across my back or arse......I love it!!!",
            "\"The key to a man's heart is through his stomach.\""
        ]
    },
    "What's the one thing you thought could never happen to you, but did?": {
        "title": "What's the one thing you thought could never happen to you, but did?",
        "score": 5190,
        "url": "https://www.reddit.com/r/AskReddit/comments/1dqs6o3/whats_the_one_thing_you_thought_could_never/",
        "content": "",
        "num_comments": 5800,
        "comments": [
            "I was 51. I had the day off and was feeling great. Decided to take an afternoon nap. As soon as my head hit the pillow I had a massive heart attack that destroyed 40% of my heart. I woke up 3 days later on a ventilator and had no idea what the heck happened.",
            "My husband dying. Walked into our bedroom and found him unconscious in bed, he'd been there all day. I just thought he was sleeping the day away since he'd been working so hard for days before. He was not sleeping. I just knew something was off as soon as I stepped into the room. I called his name multiple times, then I touched him, ice cold. I will never forget that moment.",
            "Last year, a car crashed straight through my kitchen.",
            "Getting laid off unexpectedly after years of loyalty to my company. It was a wake-up call about job security and the need to always be prepared.",
            "A snake fell from a tree and bit me on the head.\n\nETA: It's incredibly ironic because I've always been more terrified of snakes than anyone I know, so of all people, it happened to me.",
            "I was shot, also winning a 1000$ in the lottery 3 times from the same kind of ticket",
            "Got cancer. Wish me luck!",
            "My wife died in a car accident. She was on her way home from work. A truck ran a stop sign. She hit him and died. I talked to her less than 5 minutes prior to the crash. Tomorrow isn't promised, guys. Tell the people you care about how much they mean to you. Hold them close.",
            "So, I'm at the bus stop when this older lady asks for directions to the hospital. I decide to walk her there, and we chat. Turns out, she's a famous author in disguise, researching for her next book.\n\nFast forward, she thanks me, and a few months later, her book drops. I check it out, and theres my name in the acknowledgments! Never thought helping someone out would land me a shoutout in a bestselling novel. Life is wild, man.",
            "I was an innocent bystander who got shot in the chest during a drive-by."
        ]
    },
    "What are some street smarts everyone should know?": {
        "title": "What are some street smarts everyone should know?",
        "score": 1394,
        "url": "https://www.reddit.com/r/AskReddit/comments/1dqys7l/what_are_some_street_smarts_everyone_should_know/",
        "content": "",
        "num_comments": 1018,
        "comments": [
            "Avoid escalation in any circumstance. Your pride is not worth ending up dead for.",
            "Walk with purpose. Look ahead and stride confidently. If you're looking around and walking timidly, you'll be seen as lost, possibly a tourist, an easy mark.",
            "If youre uncomfortable somewhere, leave.\n\nYour brains pretty good at picking up on stuff and nudging you in ways you dont consciously get at times.",
            "A dead giveaway that you are in a dangerous area: many young men are standing around seemingly doing nothing.",
            "Keep your anger and rage in check.... You never know what's on the other end.",
            "Always pay attention to your surroundings. It doesn't have to be constant scanning, but be aware.",
            "If it seems wrong, it is wrong. You don't have to stop when someone random talks to you on the street. Don't gawk and look up; just keep moving to where you're going. Cross to the other side of the street if you don't like what you see ahead. Be wary of distraction: one person starts shouting at something, while their partner grabs your bag. There are two speeds on the street: move fast, or get out of the way.  Wallets don't go in your back right pocket. Three-card monte is not a game.\n\nOptional: Don't walk down the street with your cans in. This might be generational, but I'm a native New Yorker and don't think it wise to not hear what's going on around you.",
            "You never go to a secondary location.",
            "Always know where the exits are and have a plan if you have to get out in a hurry.",
            "If you ever see a gun at a party, leave. If anyone is playing with fire at a party, leave. If you see a needle, leave."
        ]
    },
    "What’s a fascinating fact about wildlife that most people are unaware of?": {
        "title": "What’s a fascinating fact about wildlife that most people are unaware of?",
        "score": 515,
        "url": "https://www.reddit.com/r/AskReddit/comments/1dqzj3t/whats_a_fascinating_fact_about_wildlife_that_most/",
        "content": "",
        "num_comments": 392,
        "comments": [
            "Crows can mimic human voices similar to parrots. I experienced that first hand while hunting on public land. Heard a little boy calling \"MOM\" \"MOM!!\" only to realize that the voice came from a crow flying overhead.",
            "Owls bob their heads up and down to help improve their depth of perception.\n\nYou can try it out yourself. Focus on an object and bob your head. It doesn't work for us, but you do look like an idiot.",
            "Opossums brains are about 1/5th the size of other mammals their size. And mostly smooth  so precious and so dumb",
            "Cheetahs are not big cats. They are very large small cats.",
            "Back in the day dragonflies ate flesh, were 3 ft long, and dominated the food chain.",
            "My favourite fact ever: penguins have knees. Will never not baffle me. Knees.",
            "There are coyotes in every major city in the USA. If youre in the US, youre likely less than 1mi away from one.",
            "Elephants have a specific warning call that means human.",
            "Flamingos are not naturally pink.   They are born grey.   But their feathers turn pink because of their diet of shrimp and algae.",
            "Ruby throated hummingbirds migrate from Central America and mexico to breed in the eastern US every Spring. A large numbers of them cross the great expance of the gulf of Mexico without stopping (Some over 600 miles!). They migrate to and from their range in waves, so they all dont get wiped out by a tropical storm.."
        ]
    },
    "What terrible sex advice would teenage you totally believe? ": {
        "title": "What terrible sex advice would teenage you totally believe? ",
        "score": 84,
        "url": "https://www.reddit.com/r/AskReddit/comments/1dr86f5/what_terrible_sex_advice_would_teenage_you/",
        "content": "",
        "num_comments": 141,
        "comments": [
            "That you can use vaseline as lube",
            "Using two condoms at once is safer than one",
            "That if she's on top you can't get her pregnant.",
            "I don't remember where I heard it, but as a teenager I believed squeezing a girl's boobs would increase her risk of breast cancer.",
            "That you're supposed to put the balls in too.",
            "Bigger is better. Turns out size can be very uncomfortable. And if you don't have big, it's perfect, for anal. So for me average or less average dick size, it's a win win ",
            "That marriage is a path to endless sex.\n\nIt's not.",
            "My ex girlfriend actually believed that boys were in absolute pain when they had an erection and didnt have sex so, that",
            "That sex is the most important thing ever",
            "\"You don't need to use protection if you pull out in time.\" This is highly unreliable and does not protect against sexually transmitted infections (STIs) either."
        ]
    }
}