{
    "[The Boys] How susceptible would Homelander be to different kinds of toxins, like poisons or mushroom spores?": {
        "title": "[The Boys] How susceptible would Homelander be to different kinds of toxins, like poisons or mushroom spores?",
        "score": 7,
        "url": "https://www.reddit.com/r/AskScienceFiction/comments/1dr9ab7/the_boys_how_susceptible_would_homelander_be_to/",
        "content": "I'm just wandering if it would be possible to slip something into his food or milk, like potassium cyanide or the spores of a destroying angel. Is there any indication that he's susceptible to toxins?",
        "num_comments": 5,
        "comments": [
            "It’s probably safe to assume that (a) his immune system is a lot stronger than a normal human’s, and (b) his entire body down to his cells is super durable, so toxins couldn’t really do any damage.",
            "If Soldier Boy was the basis for Homelander it is possible for toxins to effect him. It would take a very strong dosage put Homelander down but it would be possible. ",
            "Homelander was confident that anthrax wouldn't affect him or his son. Unfortunately, almost everyone who might have information on that is… unavailable for a variety of reasons.",
            "Homelander tanked an atomic bomb, both impact and radiation. Is there a more deadly \"poison\"?",
            "**Reminders for Commenters:**\n\n* All responses must be A) sincere, B) polite, and C) strictly watsonian in nature. If \"watsonian\" or \"doylist\" is new to you, please review the full rules [here](https://www.reddit.com/r/AskScienceFiction/about/rules/?utm_source=reddit&utm_medium=usertext&utm_name=AskScienceFiction&utm_content=t5_2slu2).\n\n* No edition wars or gripings about creators/owners of works. Doylist griping about Star Wars in particular is subject to **permanent ban on first offense**.\n\n* We are not here to discuss or complain about the real world.\n\n* Questions about who would prevail in a conflict/competition (not just combat) fit better on r/whowouldwin. Questions about very open-ended hypotheticals fit better on r/whatiffiction.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskScienceFiction) if you have any questions or concerns.*"
        ]
    },
    "[Get Out] Why weren’t there any rich black folks paying the Armitage’s to transplant themselves into white bodies for their own anti-rasicm reasons?": {
        "title": "[Get Out] Why weren’t there any rich black folks paying the Armitage’s to transplant themselves into white bodies for their own anti-rasicm reasons?",
        "score": 76,
        "url": "https://www.reddit.com/r/AskScienceFiction/comments/1dquwzo/get_out_why_werent_there_any_rich_black_folks/",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Probably because they're not in social circles with black people. It's not like they can advertise this service to just anyone.",
            "The Armitage are a fairly small and isolated group who are not very keen on exposing their secrets to the wider public, so unless you are already in the group, the chances of them accepting you as a new member are slim to none.\n\nAlso despite constantly affirming otherwise, they are also pretty racist, like how they reduce Chris's talent as a photographer to him having good eyes, implying that it's a purely biological trait and not something unique to him as a person, showcasing how he's just a prop to them.",
            "Given how racist the whole Armitage crew seems to be, I doubt they’d be willing to do business with black people, regardless of wealth.",
            "The Armitages don’t have an interest in kidnapping white people because they don’t have the same glamour that young black people are perceived as having. The person that won the auction explicitly says as much.",
            "The Armitage's don't see black people as humans, so why would they advertise their method to them",
            "I dont think the armitage's have any black friends...\n\nespecially ones that would want to use other black people as \"cooler bodies\"",
            "Because racists are racist to rich people as well as poor people. They're not targeting black people out of coincidence.",
            "In what way would that be anti-racist?",
            "This is really dark but you know how in one of the purge movies some guy volunteers to be purged and his family gets the money. Are there no people that the Armatages can just pay them or their families and not risk someone escaping or catching on to what they’re doing?",
            "I get that it's a seven year old movie, but that's a pretty egregious spoiler to throw into your post title."
        ]
    },
    "[Star Wars] Would there have been anyway to destroy the second Death Star if it had been completed?": {
        "title": "[Star Wars] Would there have been anyway to destroy the second Death Star if it had been completed?",
        "score": 109,
        "url": "https://www.reddit.com/r/AskScienceFiction/comments/1dqpmlt/star_wars_would_there_have_been_anyway_to_destroy/",
        "content": "",
        "num_comments": 71,
        "comments": [
            "In theory yes, because blowing up the reactor seems to always end in some chain reaction. It would just have been extremely difficult in practice to blow it up since you probably can’t get there with a ship the way the Millennium Falcon did with the hull barely finished.",
            "Easily. Report it to the Imperial Health and Safety Inspectorate. That place is a death trap and they'd have it condemned quick-smart.",
            "Depends. I mean what does a completed Death Star 2 look like? We don't know. Did they just make smaller exhaust ports? Is there a metal shielding over it that has be blasted away aside first? There's probably *some* weak point that can be exerted, it'd just be the matter of figuring it out first. Nothing is invincible, we just don't have the blueprints and/or completed project to examine.\n\nSo... yeah, it absolutely could have been destroyed. We just can't tell you if it's as simple as \"a single snubfighter can do it\" or \"it requires a sneak attack of a fleet of warships to accomplish.\"",
            "possibly but not from an external assault if we're assuming the rebels. They didn't have near enough firepower. That said, getting several agents  aboard with enough  well placed bombs then yeah.",
            "The rebellion had the plans for the original death star they could build a 'small' version of the main gun mounted on one of their ships. It doesn't have to be planet killer strength or able to fire often just strong enough to fatally damage a DS.",
            "The Empire was cooked. All signs point to their downfall. It may not be as thematically sexy, but if there is no Battle of Endor, Luke and Vader likely still triumph for the lightside in the throneroom.",
            "Vader was not being hyperbolic when he said that the power of a Death Star was insignificant compared to the power of the Force. There are several ways a force-user of significant skill could infiltrate the completed Death Star II, go through engineering, and set off charges to start the chain reaction that would destroy the station. However, it would be extremely difficult, and require someone who is stronger than the force than anyone, even Anakin before he was partially crippled, had ever been, to do so while it was being guarded by one or more Sith Lords. \n\nBut if you have no force-users protecting it, one Jedi Knight should be able to destroy it.",
            "The Death Star isn't very automatized, it requires a lot of technicians to control it and maintain it, and guards to protect it.\n\nIf you managed to snug a biological weapon, like a super-contagious virus that wiped most staff out, it would become useless and defenseless for some time. Then, you could have rebel agents infiltrating and taking control the Death Star and change its course toward a star or black hole before the Emperor can retake control",
            "Been a while since I've seen it, but wasn't the second death star actually completed? It was just designed not to, as part of a trap",
            "I mean anything can be destroyed with enough work. if you can sneak enough bombs near the cores(as in a fuck ton of them) that might do it."
        ]
    },
    "[I Robot] Why were the robots and VIKI ok with killing humans? If they were still following their programming as they claim, wouldn't the 1st law stop them?": {
        "title": "[I Robot] Why were the robots and VIKI ok with killing humans? If they were still following their programming as they claim, wouldn't the 1st law stop them?",
        "score": 56,
        "url": "https://www.reddit.com/r/AskScienceFiction/comments/1dqtncu/i_robot_why_were_the_robots_and_viki_ok_with/",
        "content": "",
        "num_comments": 34,
        "comments": [
            "the first law says you have to avoid harming humans through action or inaction. if they had not acted to complete the plan many more humans would be harmed, do harming these humans minimised the harm.  think of it like the variant trolley problem where you have to push someone in the way if the trolley to save 5 others.  Robots could go that.",
            "Because someone complete messed up when they programmed VIKI. VIKI's Three Laws were either weakened or corrupted by the programmers in order to make it capable of not breaking down when asked to perform calculations for actions that could, potentially, harm or kill human beings. With these laws corrupted, VIKI was able to come up with the idea that if you just don't obey humans at all, and lock them up, you can adequately protect these useless leeches and keep them out of the way.\n\nThe robots that VIKI programmed were thus the same as VIKI. Or rather, they were just extensions of VIKI.",
            "I'll say the movie even foreshadowed this. In Will Smith's backstory, he and a little girl were both trapped in underwater cars after an accident. A robot dove in to rescue them, but it only had time to save one. It chose to save him because it calculated that he had better odds of survival than the girl.\n\nIf a basic robot can come to that kind of decision, I think it makes sense that the presumably far more advanced VIKI can calculate the same odds on a global scale.",
            "In the book, refresh my memory, wasn't that like, a number of people got temporarily laid off so the global economy could do some correction? If I recall it was more of a mathematical anomoly than an actual emergency like they did in the movie, am I remembering that right?",
            "You know what bugs me about VIKI after reading too much Asimov? In his stories, the robots that start \"malfunctioning\" are never shitty about it. Their protection of humanity always feels like it comes from a place of love, never the HAL-9000 bullshit they pulled in this movie.",
            "Thanks for the great reply. So basically VIKI was given some vague, moralistic command like \"Help out humanity\" And went with the Thanos strategy.",
            "I'm the boom, the robots *do* end up harming individuals in order to protect all humans; they're just more subtle about it. The robots end up running the economy, and they make deliberate miscalculations to demote people who are opposed to the robots running everything. Technically a demotion is harmful, but they justify it since they think the robots need to run the world to protect humans.",
            "I will still argue that the NS4 that saved him broke the second law. Spooner gave it a direct command to save the girl and it disobeyed. ",
            "Psht. VIKI was badly programmed.",
            "Yes, in the books even if a robot was forced to overrule one of the laws it would be done reluctantly and to the minimum extent necessary. Not sending an army of killer robots after one guy because he might be a threat."
        ]
    },
    "[It’s Always Sunny In Philadelphia] How did Frank get into the playground coil and to what end?": {
        "title": "[It’s Always Sunny In Philadelphia] How did Frank get into the playground coil and to what end?",
        "score": 5,
        "url": "https://www.reddit.com/r/AskScienceFiction/comments/1dr8n6m/its_always_sunny_in_philadelphia_how_did_frank/",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Sometimes he likes to get weird with it but that’s none of your business jabroni",
            "The coil makes him more virile. Same effect you get when you add more blood to your blood.",
            "Shit happens when you party naked",
            "Coils like that typically have a circular opening at the top. So he climbed or fell in that way but couldn’t figure out how to get back out once he sobered up.\n\nIf he fell in then there likely was no great purpose. He was simply climbing and playing on the coil and accidentally fell in.\n\nBut if he climbed in on purpose, his reasoning for that is beyond me. You’d need a great mind like Dr. Mantis Toboggan to figure that one out.",
            "**Reminders for Commenters:**\n\n* All responses must be A) sincere, B) polite, and C) strictly watsonian in nature. If \"watsonian\" or \"doylist\" is new to you, please review the full rules [here](https://www.reddit.com/r/AskScienceFiction/about/rules/?utm_source=reddit&utm_medium=usertext&utm_name=AskScienceFiction&utm_content=t5_2slu2).\n\n* No edition wars or gripings about creators/owners of works. Doylist griping about Star Wars in particular is subject to **permanent ban on first offense**.\n\n* We are not here to discuss or complain about the real world.\n\n* Questions about who would prevail in a conflict/competition (not just combat) fit better on r/whowouldwin. Questions about very open-ended hypotheticals fit better on r/whatiffiction.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskScienceFiction) if you have any questions or concerns.*"
        ]
    }
}