{
    "Moving to San Francisco or the Bay Area? Read this first!": {
        "title": "Moving to San Francisco or the Bay Area? Read this first!",
        "score": 134,
        "url": "https://www.reddit.com/r/AskSF/comments/191u94d/moving_to_san_francisco_or_the_bay_area_read_this/",
        "content": "Hey /r/askSF!\n\nIn 2024, the sub has doubled in size, growing to 113K+ subscribers. With more subscribers, there's a ton more traffic and posts. One of the most popular topics is moving to SF and, in turn, these posts are the most commonly removed. There's been a noticeable increase in posts that boil down to \"I'm moving to the city, where should I live?\" that provide little to no information. To ensure OP's receive quality recommendations and to prevent endless comment loops, **we're requiring all Moving-to-SF posts to include the following information:**\n\n* Budget\n* Roommate status (solo, splitting rent w/ partner, seeking roommates, etc.)\n* Desired neighborhood(s) or preferred neighborhood amenities (dining, shopping, noise, etc.)\n\nWe *recommend* that OP's provide additional information such as:\n\n* Commute consideration\n* Housing preference (mom and pop landlords, condo, managed apt complexes, SFH rentals, etc.)\n* Additional personal preferences (pets, garage access, density, weather, etc.)\n\nWe're a small mod team so we are asking you, the community, to help up identify these posts! If you spot a moving submission that should have more information, please report the posts, select the breaking AskSF's rules, and select \"Vague, overly broad, or low information\" as the reason. We'll review the report and potentially ask OP to repost with more info. \n\nHere's to more questions answered in 2024 and beyond!",
        "num_comments": 0,
        "comments": []
    },
    "Healthy eating options SF": {
        "title": "Healthy eating options SF",
        "score": 7,
        "url": "https://www.reddit.com/r/AskSF/comments/1dr4qri/healthy_eating_options_sf/",
        "content": "Hi there! I’m travelling to SF for 8 days next month. I’m on a bit of a budget and pregnant and so I’ve made a few bookings for places to eat based on recommendations I’ve seen here but I’m looking for cheap and healthy options for some meals. Having to actively work on healthy eating to avoid more than the recommended pregnancy weight gain hence the question. \n\nI am staying in Nob Hill \n\nI’ve read lots of stores will do me a take away salad box and made a list of some options for this which is ideal \n\nDoes anyone have recommendations for healthy breakfast options? Eg granola and yoghurt, eggs on toast but not cooked with lots of butter, etc\n\nAre there any areas with decent food trucks that will give me cheaper meals? (Though I accept likely not healthier) \n\nUnfortunately I won’t have cooking facilities though will hopefully have a fridge ",
        "num_comments": 2,
        "comments": [
            "This sf, if you want basic shit like granola salad and eggs on a budget, you best make it yourself. use tgtg for groceries. $5 will get you 10 pounds of produce",
            "Chipotle burrito bowl, subway salad for lunch/dinner"
        ]
    },
    "Moving to SF": {
        "title": "Moving to SF",
        "score": 48,
        "url": "https://www.reddit.com/r/AskSF/comments/1dqnrbo/moving_to_sf/",
        "content": "Hello!! So I am a recent graduate (22F) from MI and have received a job offer in SF, looking for some general advice before anything is final, especially since I have never visited! I would be working out of FiDi, and it’s looking like the salary will be around 85,000/yr which I know is not the best but to get this on my resume would look killer in my industry! I’m pretty open location wise, with it being a hybrid position I can probably eat a 30-40 minute commute if needed. I did ideally want to have a private studio/1 bed but from my exploration so far it it seemingly like that is pretty unrealistic with my budget, definitely wanting to keep it around 1500-1600. For some context,  I grew up right of outside of detroit, pretty *decent* neighborhood but can be gritty and I would definitely not walk home alone at night lol. Any tips or suggestions? Thanks!!",
        "num_comments": 91,
        "comments": [
            "Since you have never even step foot in SF, I would recommend doing a temporary sublet so you can check out the different neighborhoods because SF is VERY neighborhood based with distinct personalities and weather for each one.  For someone young, I'd say North Beach, Marina, Hayes Valley, Mission, Soma, and Dogpatch could be good for you. Just depends are you more mainstream, waspy or hipster, alt?",
            "Roommates is probably a good call. On that salary you'll be pretty comfortable with roommates. Facebook and craigslist are both good places to find houses looking for roommates-- super common for young people in SF! Plus it can be a nice way to meet new people when you land here.",
            "What do you want in your neighborhood?",
            "Your budget will likely require roommates. My wife rents a room in a shared 4-2 house for $1650. They’re mostly nurses and work different shifts and many live in other states (very common in SF). It’s really not as bad as you’d think; when I visit, it never feels like 4 people live there. It’s not a bad idea to begin with roommates until you get feel for the city and have higher income.",
            "Also moved from MI and even though I’ve visited SF multiple times since I’m a CA native, I rented a long term airbnb first. There was a nice price break for long terms over 3 weeks. Then you don’t rush finding a place. :) \n\nStorage units are actually priced similar to MI so if you have stuff that you don’t want to lug around, it’s a cost effective way.",
            "Since you would work in FiDi when you have to go into the office, you might also want to look for places outside of San Francisco like San Bruno or Oakland, but close to a Bart station",
            "Take a market trip but do it with a purpose. Try to pick 2/3 areas from reviews or recommendations or ur own research and go see them. Maybe try to talk to property management companies in that area. Do the commute. But specifics and details matter and sometimes in ur position far away u can get caught up in the big picture excitement versus the execution part",
            "First, congrats on the job offer and making the move, that’s huge!!!\n\nSince you will be working out of fidi and have a smaller housing budget, I recommend you check out the sunset neighborhood, specifically close to the “N-judah” muni train which runs on Judah all the way to the beach. This train goes in a tunnel under the mountain and then along market street straight to Fidi, so your commute will be around 30 minutes and consist of walking to the train, ride the train, and walk to the office. \n\nYou’ll be able to find houses with different roommates in this neighborhood. I recommend you join some Facebook groups to put some feelers out!\n\nI work hybrid out of fidi myself and take the n right to work which takes me a little over 20 minutes (I’m in Cole valley so right after the sunset on the way to fidi), and this is the best and smoothest commute I’ve ever had.\n\nHope this helps!",
            "Are you working regular business hours, or something like regular business hours?\n\nIf so, you could live in Oakland, near the 12th St., 19th St., or Lake Merritt BART stations. That area skews younger, you could get a pretty good studio within your budget, and you'd have about a 30-40 minute commute to FiDi.",
            "Check Lower Nob Hill. You can find some studios nearish your budget."
        ]
    },
    "Least busy (but well equipped) gym?": {
        "title": "Least busy (but well equipped) gym?",
        "score": 6,
        "url": "https://www.reddit.com/r/AskSF/comments/1dr162e/least_busy_but_well_equipped_gym/",
        "content": "Hi all! Moving very soon and it’s super important to me to find a good gym. Looking for squat racks, cables, free weights and smith machines. Just looking for a well equipped gym. I’ll be living in inner sunset but I can drive! How busy is fitness sf (Castro or soma?) does anyone like live fit? Any gyms that are less busy around 8 am? I read that firness sf is super crowded! Thanks ",
        "num_comments": 14,
        "comments": [
            "Most gyms (including fitness sf and live fit) have free day passes that you can use. My advice would be to try multiple spots out (for free) and then pick the one that fits your needs the best",
            " Crunch isn’t that bad in the mornings! Marina and Polk locations",
            "To me SF Fitness is fine.  Previously I did Citysport at Stonestown and I felt that place was much more crowded (both for parking and getting on squat racks or bench racks)- though it was a bit cheaper.",
            "Given your location, I highly recommend [Koret](https://www.usfca.edu/koret/membership/membership-types) — USF’s gym — which should be fairly accessible to you depending on how northeast in Inner Sunset you are. \n\nKoret has 3 squat racks, 2 smith machines, 4 pairs of cables, two rooms of free weights with at least one of them going up to 120lbs (possibly both) as well as a bunch of other great amenities (pool, boxing ring/heavy bag, and probably 90% of the machines you’d ever hope to be able to use).\n\nAs a non-NoPa resident you are limited to entering between 8am-2pm which are their off-peak hours but it sounds like that would be your ideal time range anyway. It’s definitely not busy on the earlier end of that range, especially during the 1/3 of the year when school is out. Cables occasionally require a wait of a couple of minutes if you’re doubling up but I don’t think I’ve ever had to wait to bench, squat, or deadlift.\n\nThe time restriction means that you also get a pretty killer deal that works out to $7/visit (15 visits for $105).",
            "Is that far from sunset? Edit: also , thank you ! Do you know if any of these have free parking",
            "Crunch has free weights!",
            "I much prefer Crunch, but the JCC isn’t far from the Sunset, has the equipment you want, isn’t horrible in the morning though only two squat racks can be tricky, and has parking.",
            "Can I ask which location you go to and like morning or evening?",
            "My only concern with school gyms is that they tend to be closed on holidays and I try to avoid students lol. What do you mean 15 visits ?",
            "No parking that I know of. There are lots of crunch locations check their website!"
        ]
    },
    "Where can I get a large amount of mint leaves?": {
        "title": "Where can I get a large amount of mint leaves?",
        "score": 4,
        "url": "https://www.reddit.com/r/AskSF/comments/1dr3ct3/where_can_i_get_a_large_amount_of_mint_leaves/",
        "content": "I’m having a party this weekend and want to be able to make a bunch of drinks that use a mint garnish. What is a good place to get an obscene amount of mint for a decent price? Thank you!",
        "num_comments": 6,
        "comments": [
            "Asian markets on Clement. You may want to arrange ahead if you want an insane quantity",
            "US Foods on south van ness. Bulk grocery and produce at good prices since it's a restaurant supply store.",
            "If you're closer to downtown you might try Chaat Corner. It's an Indian restaurant with a small grocery inside. Mint is a common ingredient for a lot of Indian food and I have purchased it there many times.",
            "Hispanic groceries in Mission st, $1 for the bunch",
            "I'd try Berkeley Bowl but then again I love that store.",
            "Yup!"
        ]
    }
}