{
    "I compiled every single informed consent clinic in the country. No therapist letter needed.": {
        "title": "I compiled every single informed consent clinic in the country. No therapist letter needed.",
        "score": 9520,
        "url": "https://www.reddit.com/r/asktransgender/comments/d6p05q/i_compiled_every_single_informed_consent_clinic/",
        "content": "**EDIT: Hey everyone, I know that the commenting is off on this now since it's so old. PLEASE send me a PM if you have one to add. I'm always updating this map.**\n\nAre you thinking of starting HRT, but are worried about:\n\n- Finding a clinic\n- Having to do a year of therapy\n- Having to do \"real life experience\"\n- Getting gatekept\n- Spending money and not getting treatment\n\nWell... that is why **informed consent** exists. With informed consent, you require **no letters from therapists.** You simply attest your gender identity, say that you understand the risks and benefits of hormone therapy, and they begin prescribing and monitoring your hormone levels.\n\nSo... For too long, this information has been scattered around Reddit, Susans place, twitter, various out of date guides from different regional organizations, so...\n\nI laid my eyes on every single clinic website and doctor profile listed in this map. You should be able to call up any of them to confirm, and then start your HRT as soon as possible.\n\nPLEASE let me know if any of these are out of date or if I am missing some.\n\n\nhttps://www.google.com/maps/d/u/0/viewer?mid=1DxyOTw8dI8n96BHFF2JVUMK7bXsRKtzA&ll=42.47025816653199%2C-97.03854516744877&z=4",
        "num_comments": 1174,
        "comments": [
            "Hi Erin, long time fan first time commenter. It seems like this mostly collects abusive comments these days, so I think I’m gonna lock it. Let us know if you want it unlocked.",
            "Aw man, I excitedly clicked this in case you found something I didn't, but alas the only thing you found was our subpar PP. I live in Wilmington, NC, and the Planned Parenthood here only lists \"education, resources, and services referral\" under LGBTQ services. The closest PP with HRT services is either Fayetteville or Raleigh depending on traffic.\n\nEDIT: Also I \"visited\" Atlanta recently (we were escaping Dorian's path lol) and I checked ahead of time to see if I could get HRT there - I think only one of the PPs offered it.",
            "I just want to chime in and say that I wouldn't recommend the Emma Goldman clinic in Iowa City, Iowa to anyone looking to transition. The nurse practitioner there that actually has to prescribe hormones is a terf. I've had several good friends go there and none of them have had a good time. some of the things they have experienced are dead naming, late prescriptions, out of date information regarding hrt and care for trans women, and just in general a very hostile environment. planned Parenthood should be a better option, but I have no personal experience with them.",
            "This list is exclusively from USA?",
            "Reading this thread, it feels incredible how we, as a population, are so at the mercy of physicians and legislators to access the medication we need.\n\nI don't know of any other condition where it is considered normal that there are many countries where you must just thru hoops for \\*years\\* to access needed medication not because there is any shortage, but simply because the powers that be want it to be difficult to access.  It's messed up!",
            "Philly resident here, one of the Planned Parenthood locations in philly you have isn't for clinic services at all, so no HRT. It's the one on Comly road.",
            "This is some excellent praxis.",
            "Broadway Youth Center in Chicago isn't on here. It has multiple branches though. Basically most of Howard Brown Health Center.\n\nEdit: for BYC you have to be under 25 I believe. Also they do sliding scale payment.",
            "Is \"living as your gender for a year before hormones\" still a requirement in the US? I thought it was just the letter from a therapist. I can do the letter from a therapist. There's no way I'm fighting with people to gender me as male for a fucking year while I look like this though. :/",
            "I'm literally sobbing over this list. I've been begging for surgery since I turned 18 but knew I wanted surgery since I was 12. I'm in my 30s and still getting gatekept because I might \"change my mind\" or some shit."
        ]
    },
    "It’s been neat but I have to move on": {
        "title": "It’s been neat but I have to move on",
        "score": 819,
        "url": "https://www.reddit.com/r/asktransgender/comments/1cgy40y/its_been_neat_but_i_have_to_move_on/",
        "content": "After moderating here for +/- 10 years, I’ve decided to move on. Please encourage the remaining mods to get another active trans masc moderator. Please feel free to leave comments, but I will likely remove insults at least for another day or so. After I tie up any loose ends, I will remove myself as a mod.\n\nIt’s been a pleasure to serve the community in this volunteer role.\n\n   Xoxo, Java",
        "num_comments": 64,
        "comments": [
            "I don't normally thank mods for their work, but I can't imagine the amount of assholes you have to deal with because of what this sub in particular is about.  Thanks for the work you've done and good luck in future endeavors :)",
            "Good luck on future endeavors \n\nAnd thanks for your work moderating the sub",
            "You’ve been wonderful. Best of luck to your future and thank you for all you’ve done!\n\nI’m transmasc and work a graveyard job so I’m fairly available most hours. I’m willing to look into the position if approached.",
            "Its Best to leave when you think its time. You will be missed. I wish you the best.",
            "Thank you for all your hard work!",
            "Thank you for all your effort. Sincerely. \nI hope life treats you well.",
            "Thanks you for your work and have a good life",
            "Hey, thanks for all the work you've been doing. We haven't interacted that much, but I've always enjoyed it when we did. Hope to still see you posting, even if you won't be wielding the banhammer anymore. :)",
            "Thank you for all that you do and all that you did Java! I hope I didn't cause too much work for you <3",
            "I am really glad people like you make spaces like this possible. Thank you for your work."
        ]
    },
    "Cis but curious, can you just stop taking HRT pills once you look like the desired gender?": {
        "title": "Cis but curious, can you just stop taking HRT pills once you look like the desired gender?",
        "score": 64,
        "url": "https://www.reddit.com/r/asktransgender/comments/1dr3qzw/cis_but_curious_can_you_just_stop_taking_hrt/",
        "content": "Or do you need to have them every day for the rest of your life? Sorry if you get this question a lot.",
        "num_comments": 70,
        "comments": [
            "You have to continue HRT since your body doesn't produce the hormones on its own.",
            "Every day for the rest of our lives, no big deal honestly, just how it is.",
            "So I’m ftm. For me, testosterone is available in either is shot or gel format. I have had enough surgery (ie a full hysterectomy) that my body no longer produces estrogen. I could stop taking T and probably not a lot would change. However it’s not a great thing to have no hormones floating around in your body either.",
            "HRT isn't just for looks.  It changes a lot of other things, feelings emotions, desire to use a stiletto to silence a man...  Skin texture, actually for me the physical effects were less important than everything else it gave me.",
            "We have to keep taking them, or most of the effects will revert.",
            "depends on what you take. a lot of the effects of T are permanent. some choose to stop at some point. some stop and then go back on it.",
            "Kinda. As least for Testosterone (which would not be a pill), some effects are temporary and some are permanent. The temporary ones would be like fat redistribution, or active hair growth in male-typical areas. These only happen if you are taking T. Permanent effects would be the voice getting deeper, male pattern baldness that had already happened. Once the T leaves your system, these remain the same unless you do some external thing, like voice training to make it higher. It won’t just go back to how it was before. Some people, like myself, are only interested in certain permanent changes. So for me, I can stop once I’ve received the desired effects.",
            "We take them forever otherwise you would revert. As for cost, in my country its basically nothing. 10 dollars for a month supply of injections vials. 15 dollars a month for a blocker (bica), and 3 dollars for a month supply of estrogen pills. Thats without insurance\n\nAlso a lot of internal/brain changes happen when being on HRT, it’s not just about looks",
            "I’m a trans man so I can’t speak for trans women, but I personally stopped T after a bit less than 2yrs on it cause I just had the effects I wanted and nothing changed",
            "If you get like an orchiectomy you have to take estrogen for the rest of your life or it can severely hurt you"
        ]
    },
    "is implying you're cis okay?": {
        "title": "is implying you're cis okay?",
        "score": 175,
        "url": "https://www.reddit.com/r/asktransgender/comments/1dqw73r/is_implying_youre_cis_okay/",
        "content": "i don't like lying but i think i can honestly say all of this:     \n\n\"i've always been a boy\"    \n\"i'm a late bloomer\" (since i consider my hrt my actual puberty and my estrogen-induced hell a... i don't know?? pseudo-puberty?? not *my* puberty, at least??)    \n\"my body doesn't produce enough testosterone\" (because it doesn't produce the right amount for *me*)     \n\nis this okay to say even around someone who's very likely also trans?? overthinking sm",
        "num_comments": 64,
        "comments": [
            "Even outright lying is perfectly morally acceptable when it comes to trans status imo. Like, what harm is actually being done? It's just not any of their business.",
            "Lie whenever it is convenient. The world hates you. You don't owe strangers truths they can use to hurt you.",
            "the only people who need to know are your doctors and romantic partners.\nyou can straight up lie to everyone else if you want.",
            "I don't like lying either, but those all sound pretty innocent.",
            "Being trans is medical history, only important information for your doctor, and even then not on everything. I think of it as I have always been my chosen gender, just didn't consciously realize it until recently. You can say you've always been a boy and you're not lying at all. My plan if someone grills me is to say that I have a hormone imbalance. Or GTFO, probably depends on the exact situation.",
            "well technically 🤓 you've always been a boy. you just didn't know like others, you found out later because youre a late bloomer as you said. don't be ashamed in my eyes that's not lying",
            "A lot of us are stealth once we pass, even to other trans people irl. Nothing wrong with that. I wouldn't overexplain though. Cis men generally don't seem to feel the need to insist they're a real man, just a late bloomer with a testosterone deficiency. They're just men, regardless of how babyfaced they might look for their age.\n\nAgain, nothing wrong with that. But trans people are a little more likely to catch on if you use those excessive excuses.",
            "Lying for your safety is always okay.",
            "Lying for safety is a proud tradition among trans people.",
            "I’m confused.\n\nI see no lie"
        ]
    },
    "Panicking, is my name ugly??": {
        "title": "Panicking, is my name ugly??",
        "score": 248,
        "url": "https://www.reddit.com/r/asktransgender/comments/1dqq4p7/panicking_is_my_name_ugly/",
        "content": "I came out to my family a year ago and told them my name today and got a dry response,  “oh… not what I expected” and “k. It’s alright”. I’m panicking because is it really bad? I waited one year to tell them my name because I was so afraid of them hating it and now I’m afraid my fear was valid. I know no one with that name personally and that’s *one* of the reasons why I chose it. It’s Evan. I also speak both English and French, is it ugly in those languages? It’s in the top 20 boy names for my birth year in my country. Should I change it?? My friends call me by that name and I like it… \n\nWill delete post later\n",
        "num_comments": 119,
        "comments": [
            "Evan is a perfectly reasonable name in English. I can't speak for French",
            "I'm french and Evan is a perfectly fine name. Several of my old classmate had this name. It's kind of a rare name nowadays I think though.",
            "I think it sounds perfectly fine, im sorry you got a weird reaction from your parents.",
            "Seems like a perfectly normal name to me. You're the one who has to live with the name, if you like it that's all that should matter.",
            "I've always thought Evan was a wonderful name! There's something satisfying about it on an aesthetic level, like it starts sharp with the first two letters and finishes smooth with the last two. If you like it, I absolutely would vote for you to keep it!",
            "Evan is a very nice name! My guess is they're struggling with the change, not the name.",
            "I think it’s a great name in English, I don’t know French. Maybe your family just would have reacted badly to any name that wasn’t your birth name?",
            "Evan sounds great! Parent here. Maybe they just didn't expect it. Maybe they personally would not have chosen that name for ypu and reacted poorly. When my kid started testing out new names, there were some I didn't like. I tried to hide it, and hope I did. The name my kid ended up with was not one I would have chosen and it felt odd at first, but it suits them perfectly!\n\nPlease don't change your name just because of a poor reaction. Sometimes people just don't know what to say and do a poor job of reacting. I hope that your family fully embraces you and your name!",
            "Evan is a great name. I know men, women, and enbies named Evan. It's a great all-around name.\n\nCongrats on the name, Evan!",
            "Evan’s a great name, don’t let them bring you down. They sound like they are commenting the same way family does when you tell them what your unborn child’s name is. They all gotta have input"
        ]
    }
}