{
    "Who have you known who got off with a slap on the wrist, for something very serious?": {
        "title": "Who have you known who got off with a slap on the wrist, for something very serious?",
        "score": 343,
        "url": "https://www.reddit.com/r/AskUK/comments/1dlqq2t/who_have_you_known_who_got_off_with_a_slap_on_the/",
        "content": "My brother who is now a fairly well adjusted maths graduate and pulls down 45k+ a year and has no criminal record, threw someone down a flight of stairs when he was at high school and got given a time out (for an hour, during which time he was allowed to go on his phone and read a Top Gear magazine).\n\nThe headmaster said that my brother “is obviously very capable, but doesn’t know his own strength”. The student who he threw was in pain for several weeks.",
        "num_comments": 348,
        "comments": [
            "**Please help keep AskUK welcoming!**\n\n- Top-level comments to the OP must contain **genuine efforts to answer the question**. No jokes, judgements, etc.\n\n- **Don't be a dick** to each other. If getting heated, just block and move on.\n\n- This is a strictly **no-politics** subreddit!\n        \nPlease help us by reporting comments that break these rules.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskUK) if you have any questions or concerns.*",
            "By brother aged 18 was in a drunk pub fight, three 18 year olds fighting. The other two pulled knives and then the fight abruptly paused, at that moment police arrived and all three were arrested, whole thing on cctv and everyone watching.\n\n\nThree separate charges of drunk and disorderly and weapons or whatever, my brother gets told to plead guilty with such obvious evidence - on thr cctv he is involved, but doesn't have a knife, nobody got hurt. Two years of banned from all pubs and clubs, wearing an electronic anklet with a night time curfew and a criminal record.\n\n\n The other two pleaded innocent, CP didn't want a court case, their cases dropped and got off with nothing even though they brought out knives in a pub fight.",
            "I’m a police officer. A Sgt on my team had sex with a victim who’s crime he was investigating, and they had a child. Absolutely nothing done about it. Bonkers.",
            "I was in a relationship from 17-35, we had two kids together, she left me for a bloke I’d been working with who I thought was a mate. I went to confront him, things went badly, I chopped up his work van with an axe I had in the back of my truck (I was working in forestry at the time). Like completely obliterated it\n\nThe police were called and turned up just after I’d eaten the eighth of hash I had in my pocket. They arrested me and took me into the station, I got chatting with the young PC who’d arrested me on the way in. Once we got to the station, he interviewed me, wanting to know all the ins and outs of what had happened. I was absolutely straight with him, fully expecting to be punished to the full extent of the law and told him exactly what had happened. He took my statement then went off to talk to his sergeant\n\nHe came back a couple of hours later and told me he’d managed to get me off with a caution as the person whose van I’d destroyed wasn’t wanting to press charges ( I’d told the copper that I knew the van was being used with no MOT and there was red diesel in the tank, when the police asked him about this, he declined to press charges). He also said he was waiting for an answer from his sergeant about whether he could let me have the axe back\n\nUnfortunately, the sergeant decided that was a step too far and they confiscated the axe but I got off with a caution for criminal damage when I fully expected a court case and possible prison time. At one point the PC told me that he’d been divorced under similar circumstances a couple of years previously and he’d love to have been able to do what I did. This was twenty odd years ago now and I still can’t quite believe how lightly I got off",
            "My son had his nose broken and suffered a concussion by a child in the year above him in a completely unprovoked attack, over a dozen witnesses and CCTV footage all showing this was the case.\n\nThe child in question was given a 30 minute lunchtime detention as \"they are from a troubled home so we need to take that into account\".\n\nWhen my older son (in the same year as the offender) pushed the offender later in the week he was given a 3 day suspension.\n\nIt took us going to the police and raising complaints with the school's governing group for this utter insanity to be resolved.",
            "A group of 15 year olds (about a dozen) attacked me at school in a blatantly racist (and unprovoked) attack, proper kicks and punches to the head. Luckily I played a lot of rugby so I could handle it to some extent. \n\nAll caught on cctv, headmaster said it would be dealt with. Absolutely nothing happened to them.",
            "Lad called Jay Slater avoided prison for being involved in an assault that resulted in some kid having his head split open by a golf club/machete attack.\n\nNow on holiday in Tenerife, he ends up at an apartment of some stranger and attempts to walk 11 hours back to his own accomodation, through a hikers trail over a mountainous area.\n\nEDIT: Totally forgot to include the fact that he went missing on his walk back, and has been missing the 16th June.\n\nIf you watch the interview with his mum, Karen Matthews would get the Oscar over her. £30k raised on Go Fund Me going to god knows where. All very suspect.",
            "I knew a guy who glassed a guy, near killed him and the police did fuck all.\n\nThough he got his kneecaps blown off, so I guess he didn't get away with it completely",
            "This is an ongoing issue.\n\nThere's a guy that lives in the council flats next to the park where everyone walks their dogs. He was always hanging around, drunk no matter what time of the day it was when you saw him. Everyone just considered him harmless until he began getting aggressive toward some people, eventually exposing himself at Sainsbury's.\n\nUpon further research, my friends and I found out that he's got a rap sheet a mile long, with charges ranging from public drunkenness to kidnapping. After he was run in for the Sainsbury's incident, many of the people that he had abused and threatened were contacted by police to share their stories, because at this time, a lot of people, especially those with children, were scared.\n\nThe aggressive and exhibitionist pisshead was *encouraged* to go to rehab in lieu of a proper punishment. Every time I see him across the fields, I wonder who he has to kill or rape to have the courts take the threat he poses seriously.\n\nEDIT a word",
            "Someone I loosely knew got arrested for grooming a fourteen year old. He was released and allowed to keep his kids and everyone is acting like that's completely normal. His brother is a close friend of mine and I was in their kitchen one day having expressly said I never wanted to see him again and he just walked in. I have never gotten up and left a room so fast in my life.\n\nEdited to add: his brother, my friend, is the only one acting like this is gross BTW. I'm not friends with someone who endorses child grooming."
        ]
    },
    "What can be done about someone who keeps beeping horn outside houses at 5am? ": {
        "title": "What can be done about someone who keeps beeping horn outside houses at 5am? ",
        "score": 141,
        "url": "https://www.reddit.com/r/AskUK/comments/1dlrh3q/what_can_be_done_about_someone_who_keeps_beeping/",
        "content": "Asked them nicely to stop as it's causing a nuisance... It stopped for a week or so then they started again. When spoken to again they just flew off the handle. Not people to reason with at all. So what can be done? If I have it on film can I send it into someone ? Surely it's against the law to beep in a street full of houses every morning at 5am? ",
        "num_comments": 156,
        "comments": [
            "**Please help keep AskUK welcoming!**\n\n- Top-level comments to the OP must contain **genuine efforts to answer the question**. No jokes, judgements, etc.\n\n- **Don't be a dick** to each other. If getting heated, just block and move on.\n\n- This is a strictly **no-politics** subreddit!\n        \nPlease help us by reporting comments that break these rules.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskUK) if you have any questions or concerns.*",
            "One of my twat neighbours had twat parents who would pick him up and beep the horn like a twat when they arrived. And beeped the horn like a twat after saying goodbye.\n\n\nA new twat moved in next door (who is probably a drug dealer) and has a newborn baby. When twatty beepy horn people showed up one day while the baby was sleeping they got a good telling off, and never did it again.\n\n\nSo....see if you can get a drug dealer to move in next door.",
            "The person is an ignorant fuckwit who thinks that because they're up and about at 5am, then everyone should be.\n\nPresumably they are picking someone up and announcing their presence by sounding the horn.\n\nIf that's the case, then the only option available to you is wait for them to drop the person off again and follow them home.\n\nPresumably they get up at around 4am, so probably go to bed at around 9 or 10, so just go to where they live and sound your horn at around midnight when they will be in a deep sleep.",
            "Water balloon full of double cream from your bedroom window ... may or may not have done this in the past when I was a kid",
            "Make a lot of notes. Enough notes that: the council have an evidence log of the vehicle; when it turns up; when it honks; etc. Get some photos too. If you don't have this, they can only assume it's not as much of a nuisance. Only when presented with absolute, actionable, proof will they even think about opening their own investigation.",
            "At every opportunity, make a video and upload it to the relevant police force website for videos of traffic offences.\n\nIt's an offence under The Road Vehicles (Construction and Use) Regulations 1986 regulation 99.\n\nThe police will hopefully get bored processing the videos and talk to the idiot concerned and/or give him a £30 FPN.",
            "Post it on the local FB page",
            "Nitromors is your friend.",
            "I always love the reddit comments on stuff like this like \"just smash the car up!\" when you know 99% of people on here would dl naff all",
            "Presumably they’re beeping to collect someone? Find out who and tell your neighbour not to let their lift beep. Hopefully your neighbour is less of a twat than the beeper."
        ]
    },
    "Is it normal to be this affected by weather?": {
        "title": "Is it normal to be this affected by weather?",
        "score": 26,
        "url": "https://www.reddit.com/r/AskUK/comments/1dlt46l/is_it_normal_to_be_this_affected_by_weather/",
        "content": "I am originally from eastern Europe but have lived in a tropical climate in SE Asia (Hong Kong) for about 8years before coming to the UK. My 20s were spent with easy access to the beach, jungle for hiking and easy travel to many beautiful destinations in Asia. I have lived in london for about 4,5 years now and am getting to a point where the thought of living here for the rest of my life is so unbearable that I might have some sort of mental breakdown if I have to (or at least that’s how it feels). Predominantly what triggers such feelings is the cold and grey weather. I have always enjoyed sun and ocean and it makes me happy but I didn’t think the lack of sun would have such a large impact on me. Is it normal to get so sad? I always feel cold here (I’m one of those people that is perfectly happy in 30 degree heat) and the greyness and wetness is just depressing. Am I just being dramatic?",
        "num_comments": 36,
        "comments": [
            "**Please help keep AskUK welcoming!**\n\n- Top-level comments to the OP must contain **genuine efforts to answer the question**. No jokes, judgements, etc.\n\n- **Don't be a dick** to each other. If getting heated, just block and move on.\n\n- This is a strictly **no-politics** subreddit!\n        \nPlease help us by reporting comments that break these rules.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskUK) if you have any questions or concerns.*",
            "The fact that things here are generally mild due to prevailing winds makes people forget *how far north* the UK is. People think Canada is \"far north\" but 90% of the population there live south of London.\n\nAnd whilst the gulfstream winds keep it mild (and damp) here, they can't bring us more sunlight than our actual latitude provides.",
            "Lots of people find lack of sunlight gets them down. There's a thing called Seasonal Affective Disorder. A lot of people in the UK are deficient in vitamin d from the lack of sunlight.\n\nIf you're from a warm sunny place, the lack of sun and warmth is more likely to get you down I'd imagine. Same way if I lived somewhere that was regularly 30 degrees I'd definitely find it getting me down, because I really don't like hot weather and I'd feel trapped indoors. When we have long spells of heat in summer I definitely feel it affecting my mood.\n\nIf you have a certain type of weather you dislike and you live somewhere that gets a lot of that weather, it stands to reason it's going to get you down.",
            "I am tired of getting caught in downpours, but honestly, grey, overcast and about 16°C-18°C is my favourite type of weather.\n\nI don’t cope well in the heat and I burn very easily. I’m currently sat inside with my blackout blind closed.",
            "If you like sunlight and ocean, l recommend you consider moving to Australia, particularly Queensland, lots of sunlight and good access to beautiful  beaches, and the climate there is quite similar to HongKong",
            "Imagine coming to the UK for the weather hahaha",
            "It could be down to the amount of sunlight you get - medically it's called SAD \"seasonally affected disorder\". In most cases it is treatable by something as mundane as a bright lamp with the right kind of light output when you wake in the morning.\n\n[https://www.sada.org.uk/](https://www.sada.org.uk/)\n\nmay be a good starting point and they or MIND are both places to reach out to for guidance (as well as your doctor)",
            "A Bulgarian friend of mine felt exactly the same after living here for a couple of years, he's now in Malta and seems very happy. It's not for everyone",
            "No it’s not just you. I’m emigrating in October. I can’t take it anymore. I can always come back anyways.",
            "Nah. I’m with you. The weather here is depressing most of the year. Yeah, you can put on some waterproof clothes and go for a walk but hanging around outside all day isn’t pleasurable. For most of the year. \n\nI much prefer tropical weather myself."
        ]
    },
    "When have the actions of a stranger totally baffled you?": {
        "title": "When have the actions of a stranger totally baffled you?",
        "score": 25,
        "url": "https://www.reddit.com/r/AskUK/comments/1dlrlmd/when_have_the_actions_of_a_stranger_totally/",
        "content": "my story: i left my bag on the bus a few weeks ago, it wasn’t handed in to the driver so i thought it was gone forever. the next day, my bag shows up on a local facebook page - someone found it in an aisle of the local Asda, which is a few minutes walk from the closest bus stop.\n\nalready baffled, i head over and confirm my identity to get the bag back. i go through the contents. whoever took it has left my wallet with all the cash and cards, my driver’s license, passport, earbuds, and medication that were all in that bag, among various other things. they have, however, taken my waterproof jacket (a cheap primark one) that was at the very bottom of the bag. there’s no way of getting to that section without removing everything else in the bag and then replacing it. i still cancelled the cards/ID as a precaution, but i am baffled as to what exactly happened there.\n\nanyway, what’s your bizarre story?\n\n\n\nEdit: just remembered a few more incidents. one of my partner’s coworkers has, among many other things like taking singular bites of people’s sandwiches, taken to flushing rocks down the office toilet. \n\none of the neighbours of my workplace has started posting a bag of cigarette butts through our letterbox, as she believes our service users are the source of all the cigarette butts on the street. fair enough, they do drop them out there despite our best efforts, but that’s beyond the pale!",
        "num_comments": 54,
        "comments": [
            "**Please help keep AskUK welcoming!**\n\n- Top-level comments to the OP must contain **genuine efforts to answer the question**. No jokes, judgements, etc.\n\n- **Don't be a dick** to each other. If getting heated, just block and move on.\n\n- This is a strictly **no-politics** subreddit!\n        \nPlease help us by reporting comments that break these rules.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskUK) if you have any questions or concerns.*",
            "I had someone find my bank card outside the bank. I must have dropped it coming out of the bank. Instead of going into the bank they put it on about 15 different Facebook groups saying they found it. That was lovely of them, but they took a front and back picture which included car number/expiry date/cvc. I cancelled the card immediately and told them to chop it up. They hounded me for weeks about collecting it. 🤦‍♀️ no idea what their game was, would have been less effort  to hand into the bank where I dropped it.",
            "A time-travelling Terminator would have no use for your money, but would need your jacket.",
            "Walking home from school and a paperboy coasted past on his bike. They then just continued coasting getting slower and slower until they just stopped and fell over sideways, then got up and continued their round as if nothing had happened.",
            "I've noticed that people now tend to post things they have found on social media rather than hand it in to customer services/police/bus driver, etc.  Can only assume they want the clout.",
            "Yesterday on my work commute I was sat in the first carriage of a two carriage train, I was the only person on as it's the first stop on the line. A lady came into the carriage, walked up and down a few times got off walked along the platform to get in the second carriage.  She then came through the interconnecting  door and sat down directly behind me on the still empty train. All I could think of was why would you do that you weirdo",
            "You probably just misplaced it.  Going on the above you’re clearly a little forgetful!!",
            "Many years ago during an exam at school someone went through my bag and the bags of a few of my pals and took nothing of value (money etc) and took…all of our sandwiches.\n\nJoke’s on them mine were Marmite and cheese so good chance they hated mine!\n\nBeing serious must’ve been a kid or kids who didn’t get fed properly at home. Pretty grim to realise that really.",
            "Someone stopped me in the street, took a ticket out if his pocket and asked where the arena was so he could get to the show. I explained where it was, he nodded put his ticket back in his pocket and promptly walked off in the opposite direction. That was in 2006 and I still don’t fully understand.",
            "I went swimming with my class at school (SEN kids so we go in the pool with them). We left our bags in one of the large changing rooms. I go to get changed and my towel is missing. I 100% know I had it as I’d put it at the top of the bag before we went in the pool so it was there when I got out. We search everywhere in the changing rooms, and it’s not there. Luckily another staff member had a spare, so I used that to get dry. Reported it to the leisure centre, checked everywhere it could’ve been at school and home. Never found it. It wouldn’t ordinarily matter, but that towel was one I got as merch from a musical years ago, and it was a lovely large beach towel that fit round my plus size body perfectly. It would’ve meant nothing to whoever took it, but I get annoyed every time I go swimming now as I haven’t been able to find another one as good. All we can assume is someone forgot their towel and used mine, but why not leave it behind rather than taking it home?!"
        ]
    },
    "Why has Asda declined so badly?": {
        "title": "Why has Asda declined so badly?",
        "score": 636,
        "url": "https://www.reddit.com/r/AskUK/comments/1dl6lwj/why_has_asda_declined_so_badly/",
        "content": "Went the other day and bloody hell it's such a shithole, really grubby feeling to the place, didn't look like it had been updated in about 20 years and all the staff looked depressed as hell.\n\nUsed to be top drawer back in the day, can anyone who works there or who has given any insight?",
        "num_comments": 422,
        "comments": [
            "**Please help keep AskUK welcoming!**\n\n- Top-level comments to the OP must contain **genuine efforts to answer the question**. No jokes, judgements, etc.\n\n- **Don't be a dick** to each other. If getting heated, just block and move on.\n\n- This is a strictly **no-politics** subreddit!\n        \nPlease help us by reporting comments that break these rules.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskUK) if you have any questions or concerns.*",
            "It’s been bought over by notorious asset strippers. Hardly surprising ",
            "All went downhill when they took away those chickens and cows that you could press. I always loved those as a kid!",
            "Asda has never been ‘top drawer’ - it’s always been the shittest of the big four in my opinion. But the owners have loaded the company with debt and are clearly asset stripping it as though it’s a water utility company. The ugly face of capitalism. So I assume they have cut staff and budgets hence the poor environment now.",
            "Issa brothers are held up as some kind of miracle business owners when they just buy with debt business and siphon cash out and then buy more business with credit and do the same. They pay little tax on anything and seem to be parasitic at best.",
            "Interesting side fact - I worked in my local ASDA on the tills when I was doing my A levels. This would’ve been from July 1990 to July 1992. \n\nBack then stores didn’t open on Sundays every week but the Government allowed them to apply for special Sunday trading in the build up to Christmas (which effectively meant being open for 2 or 3 Sundays in December, for 6 hours).\n\nMy normal pay was initially £5.25 an hour with London weighting, so I’d get about £80 cash in hand (£40 for each Saturday shift, after National Insurance payments) every two weeks (yes, we got cash in a little brown envelope with a payslip that we had to collect from a special window instore).\n\nBut for Sundays, as they were both unusual and not popular with staff, we were offered double pay, so £10.50 an hour plus time off in lieu (pro rated for part timers like me).\n\nBy the time I left ASDA in 1992 to go to uni, I was getting £6.50 an hour on the tills for a normal day, and £13.00 an hour for a Sunday.\n\nNo chance of that happening nowadays when you adjust for 32 years of inflation.\n\nThe Bank of England inflation calculator says that £13 in 1992 is now £27.81 adjusted for inflation. \n\nWow.",
            "New owners were idiots",
            "I always thought Asda had the worst quality food but forgave it for the prices. Now, they increase the price of things and put their “Price Locked!” sign on it like they’ve done you a favour.",
            "The branch near me is well-stocked and generally pretty good, but the vegetables go off 30 minutes after purchase.",
            "The people who bought it from Walmart literally only wanted the petrol stations that ASDA have.  \n\nThey don’t seem to give a crap about the food side of the business. \n\nWe have three ASDA stores within a 20 minute drive of where I live and the best one of the three is in the poshest location."
        ]
    }
}