{
    "Clarification: Are men allowed to post here?": {
        "title": "Clarification: Are men allowed to post here?",
        "score": 112,
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1d9vo9x/clarification_are_men_allowed_to_post_here/",
        "content": "#Answer: Yes, men are allowed to post. \n\n**Explanation:** Men are allowed to post questions. Men are allowed to comment. Men are expected, per our rules, to exercise discretion and respect the space by yielding to the discussion to the women over 30. If men choose to proffer advice, they are technically allowed to do so, ***but the community is encouraged to decide whether the comment is meaningful and contributory to discussion by using the up and downvotes.*** Not everything needs to be nuked by the mods. I hope that clears up the issue 😊",
        "num_comments": 68,
        "comments": [
            "This confuses me because in the ask men sub, I made a comment responding to someone (just agreeing with them) and my comment got modded, and the message sent to me was that I had to add flair either identifying myself, or the comment would not be posted. The reasoning being because it’s a subreddit for a specific demographic. Are the women of this subreddit not afforded that same filter requirement? ",
            "It is literally called \"Ask Women Over 30\"... the only people answering questions should be women over 30 or what is the point of this separate subreddit?",
            "I think men should do us the courtesy of starting a top-level comment with: \"Man here, ...\", so that it can be disregarded if the person really wanted WOMEN'S answers to a question. ",
            "Also if you find a post or comment that does truly break the subreddit rules, *please* report it. It’s the best way for it to be addressed by mods.  Thank you!",
            "I get it, it just sucks to see the sub clogged with posts by 'I'm 19m and I'm just asking some questions here' or even 'I'm 19f and I'm just asking some questions here.' Maybe the teenagers can just post in r/advice? Or subs  that aren't age-specific. IDK why they come her.",
            "Thank you for the clarification. I have a question I would like to ask, but I do not want to disrupt what I hope is \"safe space\" for girls and women.",
            "You mean that because your comment identified you as a woman you were forced to create a flair identifying yourself as such?",
            "There is no practical way to ban men outright that wouldn't turn moderating (an already thankless job) into one that extends beyond full time or simply evaporates the sub into silence.",
            "I'm a member of an adult sub that has a very strict no posts or top level comments from men rule. They mod it perfectly fine, so why can't we here?\n\nThey have far fewer subs, and double the number of mods. Hmm..",
            "Personally, yes, it's up to the user to the decide if their input is valuable or not. I answer questions on askmen if I know there's soemthing I've done for my husband that is relevant to the question or if it's not really a male-focused question like around careers or finances. If they're being dufuses and speaking to the female experience, downvote them and move on, it's not that serious."
        ]
    },
    "Refuse to post personal stuff on social media for years- now people have forgotten I excist? Can you relate?": {
        "title": "Refuse to post personal stuff on social media for years- now people have forgotten I excist? Can you relate?",
        "score": 62,
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1dr8deh/refuse_to_post_personal_stuff_on_social_media_for/",
        "content": "I was a person who used to upload photos/videos on social media showing my life in a quirky way without bragging. You know, like most people do. Then I lost a parent and I just felt like… everything about social media is fucked up. why are people so obsessed with directing their narrative and self absorbed image on social media? Also I started to think about all uploaded images that now is on a server somewhere belonging to companies that might use ir for AI in the future etc. I stopped posting selfcentered things online like 5 years ago and now it feels like people either have forgotten I excist OR they have the impression of me as someone they need to feel sorry for. Like I am depressed,  unsuccessful or whatnot. If you don’t show people you have a GrEaT LiFe it seems like they stop all interest in you? It’s so transactional. I don’t know. It feels wierd. Shallow. \n\nI have always felt a strong integrity and also I hate to brag about things. I am not selfcentered and I don’t need validation or praise on my looks or identity (eventho I am proud of myself and happy about it) so I never upload a selfie just for likes like some people tend to do. I use social media for culture, arts, hobbies, politics etc. \n\nWhat are your thoughts on this? Do you relate? ",
        "num_comments": 37,
        "comments": [
            "I went through this. I was very active on social media myself and would post often this would range from like what I’m eating to where I’m travelling to selfies to the occasional beach/bikini pic. Once my husband passed this was around 2019 I stopped posting all that much and similarly to you it definitely feel like people moved on like even people I considered friends unfollowed me which was pretty sad because I primarily used social media to keep in touch with a lot of people. So yes I can relate.",
            "Yeah I deleted my social media years ago and I’ve lost contact with almost all my friends because of it. I still don’t regret it, but it’s tough. Especially because where I am so many things are centred around Facebook groups",
            "Man, you said something I always feel and never been able to articulate.",
            "I guess? But my friend would like pictures of my dog or a flower from my garden, I rarely post selfies. I might also not care how much I hear from my friends..",
            "You guys have SOCIAL social media? Mine are 80% ads, 20% memes. No one posts anything personal anymore and if they do, the stupid algorithm won't show me.",
            "It makes sense that when you step back, people forget and form other stronger relationships. For some reason, half the friends I had online just stopped posting anything of themselves. They are still around, but it’s through chatting.",
            "I think it's an out of sight, out of mind thing. I have never been a big social media poster but I'm on there and follow a lot of people that I would have lost touch with years (or decades) ago if we weren't friends on Instagram. There are a lot of people who never post anymore that I still see/talk to all the time because we're actually friends, there are a lot of people I forget existed until they post something, and there are a lot of people who probably never post anymore who I just assume are too cool/busy for social media. Occasionally I'll post a pic of my cat or something and the most random people will like it and I'm like oh snap that guy I dated for like 4 months from 20 years ago is still following me??\n\nWhy do you think people feel sorry for you? I always assume the opposite... if someone's not posting on social media I assume they are living such a full interesting life that there's no time/reason to post about it.",
            "YUP. Any time I have deleted social media for an extended period of time, my engagement levels go way down when I come back. People genuinely forget about you! It’s so fickle. I hear you!",
            "I actually wanted to be forgotten when I stopped posting almost a decade ago.  I still randomly get messages asking how I've been, which is touching, but I'm happy for the results.",
            "No. I don't post selfies and hardly post about my life. I don't feel like people have forgotten I exist. \n\nWhy do you feel like they have?"
        ]
    },
    "Am I wrong to think that labels are extremely important when dating?": {
        "title": "Am I wrong to think that labels are extremely important when dating?",
        "score": 110,
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1dr2c64/am_i_wrong_to_think_that_labels_are_extremely/",
        "content": "One reason I detest casual dating is that men expect gf treatment without the title. As a woman I have personally found that the title is everything in the eyes of society. Without a title of exclusive or gf the men can gaslight you into not making any demands and into \"being chill.\" I also personally am more interested in relationships in general. My issue is that it seems men are very against these labels but still expect sex. Has this been anyone else's experience? My therapist said I may be too focused on the label, but it's like if I know I wanna be a gf what else am I supposed to do?",
        "num_comments": 71,
        "comments": [
            "I am not going to go out of my way for someone who won't commit to me.",
            "I don't think it is labels so much as mismatched effort and dudes who lie. So maybe the lesson is instead of depending on a label (liars can always say w/e anyway), you should develop tools to intuit liars early on and also to value yourself enough that you refuse to put more effort in than the other person.\n\nHonestly, these are lessons I'm learning in therapy. I definitely don't think there's anything wrong with being clear about your expectations but you also have to have strong boundaries and not be chill. I think it is better to focus more on how to use your own intelligence and intuition to weed out foolish and trifling people.",
            "If they want to take the relationship slow, you want to take the physical intimacy slow too.",
            "I mean, different people have different expectations. I'm a woman and I'm not focused on labels for quite a while. I like the space to get to know them. Imho, the exclusivity a lot of women on this sub expect would be way too soon for me in general unless I had already known the person for a while.\n\nYou're acting like you have no agency in the situation. If you don't want to just be having sex with no label, stop doing that.",
            "Very much agree. Most men I’ve dealt with want things to stay ambiguous and not put any titles on anything or any commitments while still trying to practically enjoy and have a relationship.",
            "Some people like labels, some people don't. IME, it's not necessarily gendered.\n\nIn your case, raise your expectations and be pickier on who you date.",
            "Setting labels means setting expectations. People who fear labels in relationships what spouse benefits without putting a ring on it.\n\nI personally am more flexible at the beginning but if I catch feelings, i lay out what I want. If the person isn't up to it, I let them go. No harm, no foul.",
            "If they can't even call me their partner then they can fuck off. No time for that shit. When my now husband first called me his girlfriend, I specifically asked about what that means and we discussed exclusivity and everything. Not leaving anything ambiguous. Be an adult or I'm out.",
            "If you want to avoid being used, Remove sex from the table until their intentions are clear and actions match their saying.",
            "Personally I don't care about labels at all. What's important to me is the boundaries and expectations we agree on, and then following them. Not everybody thinks the same labels mean the same thing, so I've found it way better to not rely on any assumptions or anything."
        ]
    },
    "What can I say/ do to my mom who keeps saying I’m gaining weight every time I see her? ": {
        "title": "What can I say/ do to my mom who keeps saying I’m gaining weight every time I see her? ",
        "score": 160,
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1dqukun/what_can_i_say_do_to_my_mom_who_keeps_saying_im/",
        "content": "Hi everyone, I am quite hurt, stressed, and lacking confidence in myself these days from the hurtful words my mom has been saying to me. I am currently 31 years old, 5’6” and weigh about 134-137 lbs.\n\nI was on oral birth control and I gained a few pounds but nothing too drastic. I came off it about a week ago which I’m hoping it’ll help me lose weight. I was diagnosed with hypothyroidism last year after noticing that I’ve been gaining weight in a very short amount of time (about 10-15lbs in a few months) and now on Synthroid. Even with the medication, I’ve been gaining weight or am not able to lose weight. \n\nI told myself I can’t live with this so I started walking: go to the gym during the evening with my husband (I don’t do it everyday because I work night shifts) and been trying to eat less per meal and not late at night starting about a week ago. Now this is all new to me but whenever I go see my mom even before I started working on myself, she always says something about my weight whether it be “wow your arms are getting big,” “I need to stress you out so you can start doing something about your weight,” “do your clothes even fit anymore?”, “I wanna see my pretty daughter again :(,” “don’t blame your illness,” “I’m upset when I see you,” etc. They are extremely hurtful to me and she knows I hate it. \n\nThis is affecting me and I’m starting to think that my husband will stop loving me (we got married 2 months ago), I’m starting to lose confidence, and I don’t want to see people anymore. \n\nMy family and I have a family luncheon at my mom’s place this Sunday for my mom’s side of grandparents’ birthdays but I don’t want to go anymore. I know my mom and maybe other family members will mention my weight and it’s embarrassing. I know that I’d wanna leave right then and there when they say something. But my husband said I should attend because the luncheon is for the grandparents and it’s our first time meeting the whole family since we got married. \n\nI don’t know what to do and I’ve been really down. I’ve already told my mom to stop saying those things and showed that I don’t want to hear it. \n\n\nEDIT: Thank you ladies for the great advice!! I am reading all of them and will respond to questions. Some made me laugh, some made me smile, some made me feel like I am heard. To answer some questions, my husband has not said anything about my body or weight, he told my mom to stop being like that but in a light way- that’s a start. He has shown nothing but love to me. It’s just my head that tells me that he’ll stop loving me because of all the outside “influence” (my mom talking crap) he’s hearing from my mom. \n\nEDIT: My mom sent me another message to apologize if I was upset over what she said. She also said that she’s been worried cuz I haven’t been “dolling up” since I moved out and that I should try to understand her as a mother. I told her that I will leave the luncheon if she or someone in the family makes a comment on my appearance and that I honestly don’t even wanna go anymore. She told me that I should do whatever makes me comfortable. Somehow I feel like she apologized for the sake of it only to bring me down again. ",
        "num_comments": 122,
        "comments": [
            "“You’ve gained weight!” “Thanks, so have you!”\n\nBut for real. Life is too short to put up with that shit. Especially from a “loved one”. I weigh more than you and I’m 5’3”. Your mom sounds jealous.",
            "\"Weird, you keep getting ruder every time I see you. Seriously what the fuck, mom?\"",
            "Honestly my sister solved this by bursting into tears and hysterically sobbing about how it made her feel like shit and how much she hated herself. My Mum has never mentioned her weight again (and for context, she wasn't and still isn't unhealthy, she's just bigger than my Mum, as am I). \n\nI'm not recommending that route per say, but sometimes trying to avoid a scene is fighting a losing battle where the only victim is your own mental wellbeing. Obviously try the sit down serious talk first, and the boundary setting of leaving the room and even the whole home if she can't keep her thoughts to herself, but never be worried about making your genuine upset obvious. It isn't being dramatic, it's being honest.",
            "If you're a big reader or listen to audiobooks, I have a recommendation: The book of Boundaries by Melissa Urban. She describes what makes a good boundary and how to do it.  A decent part of the book is her going over boundaries to set in certain situations. She even breaks it down into I guess stages.  The first would be telling your mom to stop which you have done. She's obviously failed to listen so the next step would be clearly stating going forward. If you bring up my weight I will leave.  The important thing is you have to leave that way she knows you're serious. \n\nYou probably should make sure your husband is on board with his plan so he knows if you get up and head out the door he needs to follow if he wants a ride 🤣Joking aside it would probably be good to sit down and talk to your husband about how this is an ongoing issue and that it would mean a lot to you if you backs you up.   If you're recently married, he probably hasn't been around your family lot, so he doesn't know that this is a reoccurring issue.",
            "“Mom, you know it hurts me when you comment on my weight.  This is the last time I will ask you to stop.  The next time you comment on my weight, my body, or what I’m eating, I will leave.  And you won’t see me again for a while.  If you can’t respect this boundary, you and I will not have a relationship.”\n\nIf your husband won’t have your back, he’s a problem too.",
            "Bring a spray bottle. Use it and say *no* with a stern voice.",
            "Omg I’m 2 inches shorter and roughly the same weight. It’s not big at all.",
            "“My weight is the same, it must be your eyes…as you age your eyesight can be affected, mom. Maybe you shouldn’t drive until you see an eye doctor!”",
            "5’6” and 134?? Dude you are skinny!",
            "You’re 134-137 lbs at 5’6” which sounds like an impressively healthy weight. You are healthy. I would tell her exactly what others have said. “I’m at a healthy weight. Please don’t comment on my body any further or I will be leaving.”"
        ]
    },
    "Why do some women choose to stay even in new relationships if they are unhappy?": {
        "title": "Why do some women choose to stay even in new relationships if they are unhappy?",
        "score": 65,
        "url": "https://www.reddit.com/r/AskWomenOver30/comments/1dr0aob/why_do_some_women_choose_to_stay_even_in_new/",
        "content": "Myself included. \n\nI understand long term relationships where people are attached or codependent on their partner is some way and can’t leave for whatever reason. \n\nBut why even short term?\nI realised after a breakup that even though I myself was unhappy with him, I was still willing to stay and make it work even though I had just started seeing him. Had only been 2.5 months. Just wondering if there’s something from a psychology perspective that makes women do this and how to break out of this if other women have had the same struggles?",
        "num_comments": 43,
        "comments": [
            "Dating is hard, and a lot of people hate the feeling that they put in so much effort for nothing. It's the same reason why people stay in jobs they hate.",
            "I think a lot of people would rather be mildly unhappy in a relationship because they are really unhappy alone.",
            "Because we watched our mothers and grandmothers and aunts do it for generations and we never learned how to do it.",
            "Maybe the \"What ifs\" and the \"What could have been\" because you probably feel that you've not tried hard enough, or given your best in it.\n\nI guess it's all about knowing your worth so you'll know when you should walk away.",
            "In addition to the great suggestions people have made, I think the messaging of society around breakups is really wrong. Break ups, at an early stage, are good!!! It's a good thing to figure out it's not working. It's good to end things!!!! But social messaging is that it's a tragedy and super sad. It's not always. ",
            "You went through so much just to find a decent guy, and the thought of having to redo the whole process is just… ugh. Tiring.",
            "I think there is a societal pressure (often pushed on women by their mothers/ aunts/ grandmothers as well as the men in their life) that women have to be married to have value. So women think I \"have to\" be in a relationship and on the path to marriage and motherhood to be valued. Rather than \"I want to be in a great relationship\". It's usually mums who push this messaging onto women - I assume because it was pushed onto them, and that is the only life they personally know. \n\nAs a generalisation, mums who saw another life usually don't push marriage onto their daughters. They want them to travel, have adventure, be in relationships (plural), see things and do things before having kids.",
            "Because they have seen how bad it is out there and have decided they’d rather be with someone who sucks but they can at least feel some attraction/connection to than eventually realize this is as good as it gets and end up with someone they can’t connect with at all.",
            "It is limerence.  Learning about limerence made me feel like I can finally see the red flags and leave a relationship at the right time and not stay.   \n\nYou end up with a warped perspective.  Crappy Childhood Fairy has some material on it,  or is just readily available.",
            "I had some really bad and scary situations when I was single so I mostly just willing to be in a predictable bad relationship than face the unknown after what I had been through."
        ]
    }
}