{
    "he over cooked ": {
        "title": "he over cooked ",
        "score": 861,
        "url": "https://v.redd.it/im19ea5uz18d1",
        "content": "",
        "num_comments": 43,
        "comments": [
            "If you speak up against a comedian, expect to get cooked lol",
            "Jimmy is the last comedian to heckle, he always responds so much worse instantly",
            "When a redditor enters a comedy show and realizes she can't downvote people in real life",
            "If you're getting offended at a comedy show, you shouldn't be there in the first place.  \n\nYou can always tell a great comedian by how well they take care of their hecklers, though.  Off the wall crowd work is some of the funniest and most outrageous stuff.",
            "Jimmy Carr is one of the best comedians out there. He's incredibly intelligent and grounded also, I would highly suggest listening to some of his interviews.",
            "Wow. \"I'm going to go soft on you like every man that's seen you naked.\" That's on another level of savage.",
            "I wouldn't dare saying anything back to Jimmy Carr, the man has a response to everything it seens.",
            "Jimmy is the man!",
            "Been to a few of his shows and she got off lightly compared to how hard he roasted other hecklers",
            "Now I understand why people now use the cooking expression...\n\n.... cus DAT bish got BURNED!!!"
        ]
    },
    "No dlc for you": {
        "title": "No dlc for you",
        "score": 171,
        "url": "https://v.redd.it/6vr4voos738d1",
        "content": "",
        "num_comments": 66,
        "comments": [
            "Opposite of Let Me Solo Her.",
            "I have never invaded anyone or be invaded by anyone in this game despite playing online (because I love player's messages) so what's the requirement to be invaded? Because 300h in and I haven't met a single (player) invader",
            "Edge, \nLord",
            "Majority of his victims barely have hp above 1k. It's 2024 and people still don't level vigor...",
            "Maidenless behavior",
            "so as i see, he invades and kills weakened players?\n\nwell, it just like a rogues in old wow, who was sure they are good in pvp after ganking 10% hp character from invisibility.\n\nsome people just rotten inside.",
            "What a cock",
            "I truly pity people that spend all their free time making other miserable.",
            "Just unplug from the internet until youre in.\n\nBut still, some people are just a waste of space",
            "How much of a pos do you have to be to try and block people getting into the dlc"
        ]
    },
    "Something dumb but cool": {
        "title": "Something dumb but cool",
        "score": 74,
        "url": "https://v.redd.it/rozweswdc38d1",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Very cool indeed.",
            "Hearing the OG Voltron anime music on the first clip... that brings back memories.",
            "Flawless Victory"
        ]
    },
    "W player": {
        "title": "W player",
        "score": 127,
        "url": "https://v.redd.it/2p0q6mxsy18d1",
        "content": "",
        "num_comments": 44,
        "comments": [
            "The gun won't shoot straight",
            "what in the hell is this vertical video format?\n\nonly 3/7 of the screen is the actual content?",
            "They/them weapons aren't really meta",
            "Brother eeww....what's that?",
            "LGBT bad. Is that it?",
            "That what globalism do to a MF",
            "A sparkly weapon with lots of different colours on it.",
            "No, irl political messaging in video games bad",
            "excuse me, it’s LGBTACDEFKLIMNOPQRSUFVWXYZ1234567890",
            "No he just need to have a weapon that shoots straight"
        ]
    },
    "Truest meme I’ve seen today": {
        "title": "Truest meme I’ve seen today",
        "score": 1412,
        "url": "https://i.redd.it/md18qzm8mw7d1.jpeg",
        "content": "",
        "num_comments": 59,
        "comments": [
            "MAKE IT LAME AND GAY",
            "Only the Death Star is the good one here.",
            "1+ Trillion dollar worth franchise gone \n\n![gif](giphy|xT0GqgeTVaAdWZD1uw|downsized)",
            "Back when disney bought starwars, everyone called me crazy when i said they would ruin the franchise. Yet here we are 12 years later",
            "starkiller base is so lame because you have to play two different games and read a series of comics to realize that it's actually Illum, which has a bunch of really cool and neat lore implications.",
            "Disney is devoid of any creativity and artistic talent. They cannot make masterpieces like Star Wars Holiday Special back in the day.",
            "Uggh.. this meme was so good until you had to put a chick in it that's lame and gay.",
            "That one ship that the purple hair lady drove straight into the first order fleet was the fleet killer.\n\nEdit: sorry I turned my brain off and didn’t point out the 50 different reasons why it’s wrong.",
            "I think we found the true dark lord of the Sith",
            "Put a chick in it."
        ]
    }
}