{
    "A Guide to Assetto Corsa in 2024": {
        "title": "A Guide to Assetto Corsa in 2024",
        "score": 160,
        "url": "https://www.youtube.com/watch?v=eour5cDFF84",
        "content": "",
        "num_comments": 40,
        "comments": [
            "Great timing on this, I just came here looking for help setting this up!",
            "AI bots too fast on some tracks even on skill 80. is there a patch to slow them even more pls? thanks",
            "Playing this for two monts, and there is a lot tips that i didnt know, fantastic tutorial.",
            "Anyone have a good (easy) guide to follow for VR assetto corsa as well?",
            "I still have issues with the traffic planner, even given the video from the mod developer I still can’t get it to work. Because in GUI I don’t have any ability to enable it.",
            "Look forward to watching this; I’ve just bought the game on PC after playing in a friends simulator and I couldn’t get my Dualsense edge to work or anything.",
            "Does any know which version I should buy from steam ?",
            "This video is done by some of the most important people for the Assetto Corsa community today. Please, follow the guides carefully!",
            "I installed content manager, sol, CSP and a filter, but none of the content from CSP or sol etc seems to be appearing in game. All of the graphics look completely stock even after ive done extensive setup. Essentials with the gear and speed info has popped up, so I know content manager is partially working. I'm about to give up on AC in general and just play other games at this point. Anybody have any ideas?",
            "Does anyone know a way to change liveries for challenges?\n\nI use content manager but cannot find a way to change skin, it loads me in default skin every time"
        ]
    },
    "I know it isn't a big deal, but as a brand new sim racer I got my first lap done faster than the last bot and it made my day.": {
        "title": "I know it isn't a big deal, but as a brand new sim racer I got my first lap done faster than the last bot and it made my day.",
        "score": 16,
        "url": "https://www.reddit.com/r/assettocorsa/comments/1dr3khk/i_know_it_isnt_a_big_deal_but_as_a_brand_new_sim/",
        "content": "https://preview.redd.it/48zp1e5u0g9d1.png?width=1621&format=png&auto=webp&s=9109e5404158dce59866393d32dfcae607f9c7b5\n\n",
        "num_comments": 5,
        "comments": [
            "Stick at it, the rewards only get better 👍",
            "W man keep going",
            "One day we'll be seeing you at the top of that list ",
            "Great job! You are a lot better than me😅",
            "yeah man! you will lead the race in no time at all!"
        ]
    },
    "Been drifting for 3 days now help me get better": {
        "title": "Been drifting for 3 days now help me get better",
        "score": 27,
        "url": "https://v.redd.it/8vkf3mi92f9d1",
        "content": "",
        "num_comments": 29,
        "comments": [
            "It took me like a month to even remotely chain drifts.  This isn't bad for 3 days.  From an amateur eye I don't see anything glaringly wrong.",
            "As you get better your hands will get lazier. If you are on a wheel I used to loosen up my base a bit. Forcing myself to be nice and easy with inputs so the wheel didn't move around was nice.",
            "focus on controlling the car with the throttle not the wheel, use the wheel for minor adjustments and then mix in foot braking and hand braking after maybe 100-300 hours depending on ur progress",
            "I can’t, you are already better than me.",
            "I think you're in too low of a gear in some corners - you shouldn't be bashing the limiter the whole way",
            "Come join me",
            "try to be more gentle with throttle, the drift will look cleaner and more steady+ you won't have to fight wheel so much",
            "i have 930 hours in assetto and i cant drift like u :sob:",
            "i never have full control of the car a lot of the time as you can tell I'm fighting the wheel a lot to keep it in drift",
            "To be fair I've probably put in a good 30+ hours"
        ]
    },
    "Here are my ultra realistic graphics settings only $30 a week on my Patreon.": {
        "title": "Here are my ultra realistic graphics settings only $30 a week on my Patreon.",
        "score": 741,
        "url": "https://i.redd.it/1lkktdvb999d1.png",
        "content": "",
        "num_comments": 46,
        "comments": [
            "I'd pay more, if i could see less",
            "Fr tho. Imagine spending that much for something u can do urself for free, and better",
            "What submarine is this?",
            "This is not realistic. Everyone knows that overcast weather is the only realistic setting you can have.",
            "I'm afraid I won't subscribe as long as your filter has no catchy name, something like \"next gen ultra photorealism 2.0\"",
            "Topic aside, whats that hud thing, Looks kinda nice?",
            "NGL took me a while",
            "oh I see, you have the \"driving behind the Ferrari 499P\" experience...",
            "Wtf is that?😭💀",
            "![gif](giphy|sDcfxFDozb3bO)"
        ]
    },
    "Asetto Corsa EVO worthy?": {
        "title": "Asetto Corsa EVO worthy?",
        "score": 247,
        "url": "https://www.reddit.com/gallery/1dqi7di",
        "content": "",
        "num_comments": 16,
        "comments": [
            "The game isn't even out, is it?",
            "Honestly, i was disappointed with that there was no such reflections like local screen space reflections we have with modded assetto. What i mean is that you can see your own car parts reflecting on the car itself. i hope such reflections will be added in the future one way or another...",
            "I will literally empty my bank account as soon as this comes out.",
            "what car is that",
            "What map is that?",
            "Hope they make good animations",
            "they should hire the ier guys",
            "No, just screenshots released yesterday (and Steam page).\n\nOP wants to know if his Assetto Corsa screenshots are good enough to be compared to the AC Evo screenshots.",
            "Those reflections make assetto feel so alive, especially with complex body cars like OP's screenshots.",
            "It's all work in progress I would assume could be that they go over the lighting adding a ray tracing pass for self reflections after some optimization stuff is done since it's an in house engine. \n\nPart of why AC was so good was because I could run on potato PCs as well. I remember running it on my 2012 dell inspiron laptop back in 2014"
        ]
    }
}