{
    "A Guide to Assetto Corsa in 2024": {
        "title": "A Guide to Assetto Corsa in 2024",
        "score": 157,
        "url": "https://www.youtube.com/watch?v=eour5cDFF84",
        "content": "",
        "num_comments": 40,
        "comments": [
            "Great timing on this, I just came here looking for help setting this up!",
            "AI bots too fast on some tracks even on skill 80. is there a patch to slow them even more pls? thanks",
            "Playing this for two monts, and there is a lot tips that i didnt know, fantastic tutorial.",
            "Anyone have a good (easy) guide to follow for VR assetto corsa as well?",
            "I still have issues with the traffic planner, even given the video from the mod developer I still can’t get it to work. Because in GUI I don’t have any ability to enable it.",
            "Look forward to watching this; I’ve just bought the game on PC after playing in a friends simulator and I couldn’t get my Dualsense edge to work or anything.",
            "Does any know which version I should buy from steam ?",
            "This video is done by some of the most important people for the Assetto Corsa community today. Please, follow the guides carefully!",
            "I installed content manager, sol, CSP and a filter, but none of the content from CSP or sol etc seems to be appearing in game. All of the graphics look completely stock even after ive done extensive setup. Essentials with the gear and speed info has popped up, so I know content manager is partially working. I'm about to give up on AC in general and just play other games at this point. Anybody have any ideas?",
            "Does anyone know a way to change liveries for challenges?\n\nI use content manager but cannot find a way to change skin, it loads me in default skin every time"
        ]
    },
    "Cool lap in my own city ! ": {
        "title": "Cool lap in my own city ! ",
        "score": 14,
        "url": "https://v.redd.it/k0qphepjci9d1",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Le circuit de pau !",
            "That why I love assetto corsa",
            "C'est exact \n\nJe vais à toutes les éditions"
        ]
    },
    "Been drifting for 3 days now help me get better": {
        "title": "Been drifting for 3 days now help me get better",
        "score": 87,
        "url": "https://v.redd.it/8vkf3mi92f9d1",
        "content": "",
        "num_comments": 54,
        "comments": [
            "It took me like a month to even remotely chain drifts.  This isn't bad for 3 days.  From an amateur eye I don't see anything glaringly wrong.",
            "I can’t, you are already better than me.",
            "As you get better your hands will get lazier. If you are on a wheel I used to loosen up my base a bit. Forcing myself to be nice and easy with inputs so the wheel didn't move around was nice.",
            "focus on controlling the car with the throttle not the wheel, use the wheel for minor adjustments and then mix in foot braking and hand braking after maybe 100-300 hours depending on ur progress",
            "i have 930 hours in assetto and i cant drift like u :sob:",
            "I think you're in too low of a gear in some corners - you shouldn't be bashing the limiter the whole way",
            "try to be more gentle with throttle, the drift will look cleaner and more steady+ you won't have to fight wheel so much",
            "3 years is a long drift mate! keep it up!",
            "What track/mod is this?\n\nLooks like a really nice lay-out with lower hp cars!",
            "You are more powersliding than drifting, maybe the car is too hooked up, like you’re trying to go fast. Instead of driving into the corner try to chuck the car into the corner sideways at a big angle and drive out of it."
        ]
    },
    "I know it isn't a big deal, but as a brand new sim racer I got my first lap done faster than the last bot and it made my day.": {
        "title": "I know it isn't a big deal, but as a brand new sim racer I got my first lap done faster than the last bot and it made my day.",
        "score": 31,
        "url": "https://www.reddit.com/r/assettocorsa/comments/1dr3khk/i_know_it_isnt_a_big_deal_but_as_a_brand_new_sim/",
        "content": "https://preview.redd.it/48zp1e5u0g9d1.png?width=1621&format=png&auto=webp&s=9109e5404158dce59866393d32dfcae607f9c7b5\n\n",
        "num_comments": 7,
        "comments": [
            "Stick at it, the rewards only get better 👍",
            "And in a Porsche! Move that one, not an easy car to start with",
            "If improving and going faster made your day, it is a big deal. You're hooked. One of us! One of us!",
            "One day we'll be seeing you at the top of that list ",
            "Great job! You are a lot better than me😅",
            "yeah man! you will lead the race in no time at all!",
            "W man keep going"
        ]
    },
    "This Truck is Wild": {
        "title": "This Truck is Wild",
        "score": 11,
        "url": "https://v.redd.it/d00k9nteqg9d1",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Download link?",
            "did you do this in Roadrunner's server?"
        ]
    }
}