{
    "[Meta] An updated flow chart, to help cut down on the number of Rule 1 breaking posts in the sub. Be sure to read the list of common topics listed under Rule 4, as well!": {
        "title": "[Meta] An updated flow chart, to help cut down on the number of Rule 1 breaking posts in the sub. Be sure to read the list of common topics listed under Rule 4, as well!",
        "score": 25971,
        "url": "https://i.redd.it/n6b9o2303ki61.png",
        "content": "",
        "num_comments": 104,
        "comments": [
            "Nobody saw me typo the title like 4 times, right? >.>",
            "I think the main issue stems from people not reading the rules and that’s pretty unfixable. Nice chart though I like it",
            "It'd be nice to have some sort of restriction on \"how dare this company make me pay for something I find valuable\" posts. And on a similar note, posts complaining about companies keeping exactly the same business model when demand for their services spike, instead of suddenly turning into a charity.\n\nYes, businesses get you to give them money, that's how businesses work. If they offer a product or service you want and ask you to pay for it, that's not asshole design. Nor is it asshole design when they offer you a cheaper or free version of the product that isn't as good as the higher-priced version.",
            "This whole sub is r/assholedesign everyone comes here and posts r/crappydesign and all i want to see are asshole designs 🥴",
            "This subreddit sucks now, almost all of the posts are websites or something, I wanna see the physical asshole designs yknow",
            "there are other subreddits that the flowchart could point to: r/ATBGE and r/ofcoursethatsathing come to mind. they could branch off of the bad design hub in the \"no\" direction.",
            "This is possibly the best way to show people what is good here, thanks!",
            "I’m getting pretty fucking sick of this sub Reddit and idiots idiots on it. Despite the diagram it’s not gonna change a thing",
            "The problem here is that people don’t understand what **design** is. Just because something was done on purpose doesn’t mean it’s a design issue. Classic examples are built in ads on paid devices like TVs. Sure it’s incredibly annoying and the decision from Samsung to include ads is super shady. But it’s not design.",
            "İmagine not being able to comment\n\nThis post was made by the early gang"
        ]
    },
    "Fun fact: If you use your bank to threaten adobe, they will waive the cancellation fee.": {
        "title": "Fun fact: If you use your bank to threaten adobe, they will waive the cancellation fee.",
        "score": 4027,
        "url": "https://imgur.com/gallery/fun-fact-if-you-use-bank-to-threaten-adobe-they-will-waive-cancellation-fee-c58h3fe",
        "content": "",
        "num_comments": 161,
        "comments": [
            "Adobe is getting sued by the US government for hiding the cancellation fee",
            "I think your acknowledgement of Gaurav as a person who had nothing to do with Adobe's scummy practices did the trick, lol",
            "Normally I wouldn't resort to this, but fuck adobe and their new ToS. Look near the last pic for the resolution.",
            "Me, who has been pirating Adobe shit since 2018: not investing money into this stupid company is the best choice I've ever made",
            "I don't even need to use Adobe products, but I still pirate them just because it's my civic duty",
            "You have to play hardball with these idiots, I would have handled it the same way, good job!",
            "Another reason to pirate Adobe products\n\nMorally justified",
            "Welllllll in EU, there's a consumer law, that when the company providing a service changes the terms of that service during the run of the service, you have the right to unconditional cancel of that service within of 30 days of terms change (EVEN IF YOU STILL OWE MONEY, its waived). \n\nI wish people outside EU could enjoy similar laws, that would make such scummy moves a bit harder. Companies can either wait to the end of the initial agreement, to change the terms or face unconditional end of it.",
            "Why would I pay for an adobe product in the first place?",
            "They still have the cancellation fee in place, jeeeeez, i thought they got rid of it already after the public backlash from a couple of years ago."
        ]
    },
    "Roblox Ads Manager doesn't let you remove your credit card information, or delete your account, once you created it. You can only Replace the card with another card.": {
        "title": "Roblox Ads Manager doesn't let you remove your credit card information, or delete your account, once you created it. You can only Replace the card with another card.",
        "score": 570,
        "url": "https://i.redd.it/s7qlwm4nn99d1.jpeg",
        "content": "",
        "num_comments": 26,
        "comments": [
            "Replace it with one of those shitty one time use cards.",
            "Call the bank, tell them to no longer allow charges from their bank account. If they use a different account, tell the bank to reverse the fees and stop that other one too. Explain to the bank they aren't allowing you to cancel the payment order and only want you to change to a different account.",
            "Lawyers should have a field day with them",
            "Don't your cards change/update their numbers? I have to be careful around the  expiry date of my card. I once missed some recurring payment to switch to the new card. Made me enter those dates into my calendar to change my subscriptions early.",
            "Yep PayPal did  that to me once",
            "They probably try and take money if you try deleting your account ",
            "To clarify this is accessible only for ID verified game developers and there's no subscription tied to card, just ability to pay for ads anytime you decide",
            "A prepaid card with $1 on it",
            "Or just look up test credit card numbers and use one of those. I have to use them for work and this is the perfect use case.",
            "It IS Illegal in many countries"
        ]
    },
    "\"Dear passenger, have a seat\". The seat:-": {
        "title": "\"Dear passenger, have a seat\". The seat:-",
        "score": 1,
        "url": "https://i.redd.it/hh9jxzxdoi9d1.jpeg",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Patreon hides the join for free button behind the three dots. (3 different creators, same design. Not blaming the creators, just blaming patreon.)": {
        "title": "Patreon hides the join for free button behind the three dots. (3 different creators, same design. Not blaming the creators, just blaming patreon.)",
        "score": 17,
        "url": "https://www.reddit.com/gallery/1dq87an",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Patreon also charges some pretty steep percentage per transaction (if I remember correctly 8%,didn't look it up to verify) \n\nWhile for example Ko-Fi charges somewhere around 5 euros... \n\n\n\n\n\n\n\n\n\n\n\n...per month\n\n...flat"
        ]
    }
}