{
    "[Meta] An updated flow chart, to help cut down on the number of Rule 1 breaking posts in the sub. Be sure to read the list of common topics listed under Rule 4, as well!": {
        "title": "[Meta] An updated flow chart, to help cut down on the number of Rule 1 breaking posts in the sub. Be sure to read the list of common topics listed under Rule 4, as well!",
        "score": 25967,
        "url": "https://i.redd.it/n6b9o2303ki61.png",
        "content": "",
        "num_comments": 104,
        "comments": [
            "Nobody saw me typo the title like 4 times, right? >.>",
            "*Image Transcription: Flowchart*\n\n---\n\n[*Smaller rounded rectangle at the top. Bigger rectangles elsewhere.*]\n\nI don't like this thing\n\n[*Bottom.*]\n\nIs it a design issue or just obnoxious?\n>\n> [*Right.*] **Obnoxious**: \\/r\\/mildlyinfuriating etc.\n\n[*Bottom.*] **Design problem**\n\nIs it intentionally this way to benefit/profit the company at your expense?\n>\n> [*Right.*] **No, it's just poorly designed.**: \\/r\\/crappydesign\n\n[*Bottom.*] **The company benefits at my expense.**\n\n\\/r\\/assholedesign\n\n[*End.*]\n\n---\n\n^^I'm&#32;a&#32;human&#32;volunteer&#32;content&#32;transcriber&#32;for&#32;Reddit&#32;and&#32;you&#32;could&#32;be&#32;too!&#32;[If&#32;you'd&#32;like&#32;more&#32;information&#32;on&#32;what&#32;we&#32;do&#32;and&#32;why&#32;we&#32;do&#32;it,&#32;click&#32;here!](https://www.reddit.com/r/TranscribersOfReddit/wiki/index)",
            "That's not assholedesign it's more like brilliant design\n\nLmao\n\nThanks\n\nEdit\n\nI am going to keep a link to this.",
            "I think the main issue stems from people not reading the rules and that’s pretty unfixable. Nice chart though I like it",
            "Can you please ban the whole \"advertisements/subscribe to our mailing list\" posts? I swear it seems like half the people on this website haven't ever fucking heard of uBlock Origin; it would certainly be refreshing to not see problems that could be *easily* circumvented.\n\nMake sure to pin a tutorial on how to block ads and shit when you install uBlock. I'm just so fucking tired of people with tech-savviness rivaling that of a grandma.",
            "/r/crappydesign for not using standard conventions when picking shapes, making it slightly harder to read at a glance.\n\nLike the idea though!\n\nEDIT: Words disappeared from original comment",
            "It'd be nice to have some sort of restriction on \"how dare this company make me pay for something I find valuable\" posts. And on a similar note, posts complaining about companies keeping exactly the same business model when demand for their services spike, instead of suddenly turning into a charity.\n\nYes, businesses get you to give them money, that's how businesses work. If they offer a product or service you want and ask you to pay for it, that's not asshole design. Nor is it asshole design when they offer you a cheaper or free version of the product that isn't as good as the higher-priced version.",
            "This whole sub is r/assholedesign everyone comes here and posts r/crappydesign and all i want to see are asshole designs 🥴",
            "[removed]",
            "This subreddit sucks now, almost all of the posts are websites or something, I wanna see the physical asshole designs yknow"
        ]
    },
    "Fun fact: If you use your bank to threaten adobe, they will waive the cancellation fee.": {
        "title": "Fun fact: If you use your bank to threaten adobe, they will waive the cancellation fee.",
        "score": 3944,
        "url": "https://imgur.com/gallery/fun-fact-if-you-use-bank-to-threaten-adobe-they-will-waive-cancellation-fee-c58h3fe",
        "content": "",
        "num_comments": 152,
        "comments": [
            "Adobe is getting sued by the US government for hiding the cancellation fee",
            "You can also do it with [privacy.com](http://privacy.com) 's closing mechanism. I'm pretty sure a lot of banks are also having this feature that you can effectively lock the card from charges. Way before this and the lawsuit from the FTC and the DOJ, I've seen someone happened to be lucky - [https://www.reddit.com/r/assholedesign/comments/1alwwnc/i\\_cancel\\_my\\_adobe\\_subscription\\_2\\_days\\_ago\\_and/](https://www.reddit.com/r/assholedesign/comments/1alwwnc/i_cancel_my_adobe_subscription_2_days_ago_and/) the payment information given to adobe is a credit card that expired and they cannot take money from it. 🤣\n\nJust be careful that some software companies doing these shady anti-cancellation practices (especially when they require your payment information BEFORE you can try out the \"free\" trial) may have the payment enforced via \"obligation to pay\" terms in the EULA/ToS, akin to post-paid plan, like what phone carriers do. That means no payment could result in you being sent to collections. Adobe so far as I seen, try to sound scary sending emails that your payment didn't went through.",
            "I think your acknowledgement of Gaurav as a person who had nothing to do with Adobe's scummy practices did the trick, lol",
            "Normally I wouldn't resort to this, but fuck adobe and their new ToS. Look near the last pic for the resolution.",
            "Me, who has been pirating Adobe shit since 2018: not investing money into this stupid company is the best choice I've ever made",
            "Fun Fact: If you use your bank to threaten *anyone*, they'll capitulate immediately in almost every case.\n\nWhen you issue an automated chargeback, your bank launches a tiny investigation into the circumstances of that specific chargeback. If they determine that you're committing fraud, they can come after you but if they don't, then they'll do nothing else about it. The bank relies on the fact that the merchant has no chance in hell of beating them in court, which is true.\n\nHowever, if you actually call your bank or go to the local branch and explain *why* you feel a merchant is violating your rights, *the bank itself* will issue the fraud claim into the way that merchant interacts *with the bank*, and since the bank is issuing the claim, the bank will investigate it much more seriously. They investigate the merchant, not a specific transaction.\n\nThis has 2 possible outcomes. Either A; The bank determines that you are wrong, in which case they spent a bunch of  time and money for nothing, which as you might have guessed they're not going to do... Or B, the much more likely option, they determine that the merchant is committing fraud.\n\nIf they come to the very very likely determination that the merchant is committing fraud, they'll block that merchant from transacting **with the entire bank**. So, if you're a customer of JP Morgan Chase, for example, *every* customer from JP Morgan Chase (\\~30 million people) will instantly stop doing business with the merchant, forever. *Every* Adobe account with a payment method tied to the specific bank, just got cancelled.\n\nAs a merchant, this is instant death, so if you get the bank to levy the threat on your behalf, it's almost guaranteed that the merchant immediately caves.\n\n==\n\nNow, admittedly, because of how drastic the impact on both organisations is, your bank *probably* isn't going to do this against Adobe. But, if it's a local business that's fucking around, your bank **will** kill them on your behalf, I swear I've seen it done.\n\nEither way, even for a company as big as Adobe, your bank will still protect you out of any bullshit. Banks have the ability to move money without asking (to some extent), so they can absolutely cancel your sub, pay the cancellation fee for you, and then straight up charge Adobe for it. What's the next move? Adobe has to sue the bank, and again, good fucking luck.",
            "I don't even need to use Adobe products, but I still pirate them just because it's my civic duty",
            "You have to play hardball with these idiots, I would have handled it the same way, good job!",
            "Another reason to pirate Adobe products\n\nMorally justified",
            "Welllllll in EU, there's a consumer law, that when the company providing a service changes the terms of that service during the run of the service, you have the right to unconditional cancel of that service within of 30 days of terms change (EVEN IF YOU STILL OWE MONEY, its waived). \n\nI wish people outside EU could enjoy similar laws, that would make such scummy moves a bit harder. Companies can either wait to the end of the initial agreement, to change the terms or face unconditional end of it."
        ]
    },
    "Roblox Ads Manager doesn't let you remove your credit card information, or delete your account, once you created it. You can only Replace the card with another card.": {
        "title": "Roblox Ads Manager doesn't let you remove your credit card information, or delete your account, once you created it. You can only Replace the card with another card.",
        "score": 537,
        "url": "https://i.redd.it/s7qlwm4nn99d1.jpeg",
        "content": "",
        "num_comments": 25,
        "comments": [
            "Replace it with one of those shitty one time use cards.",
            "That sounds illegal",
            "Call the bank, tell them to no longer allow charges from their bank account. If they use a different account, tell the bank to reverse the fees and stop that other one too. Explain to the bank they aren't allowing you to cancel the payment order and only want you to change to a different account.",
            "Lawyers should have a field day with them",
            "Don't your cards change/update their numbers? I have to be careful around the  expiry date of my card. I once missed some recurring payment to switch to the new card. Made me enter those dates into my calendar to change my subscriptions early.",
            "Yep PayPal did  that to me once",
            "They probably try and take money if you try deleting your account ",
            "wow",
            "Gg",
            "A prepaid card with $1 on it"
        ]
    },
    "Being over the OneDrive limit means you can't receive e-mails. Even if your e-mail storage is below 15GB.": {
        "title": "Being over the OneDrive limit means you can't receive e-mails. Even if your e-mail storage is below 15GB.",
        "score": 5,
        "url": "https://www.reddit.com/gallery/1dr6151",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Google does the same thing.",
            "I think this is more of a bug rather than intentional, the storage isn't shared, like with Google but you get 5GB in OneDrive and 15GB in Outlook.",
            "Good to know.   \n\nThe “don’t be evil” days are long gone."
        ]
    },
    "3/4 of my posts are removed by this shit": {
        "title": "3/4 of my posts are removed by this shit",
        "score": 0,
        "url": "https://i.redd.it/1ezz7gomqg9d1.png",
        "content": "",
        "num_comments": 5,
        "comments": [
            "I gotta be honest there’s not much software gore in google getting the autocorrect wrong",
            "probably not enough karma to post there",
            "Softwaregore is kind of a garbage sub anyway. They have this 'done to death' stuff that is a gigantic list. Moderating gets done barely, judging by the amount of posts that break that 'done to death' list.\n\nModerating gets done by automod. That's it, basically. And it triggers on specific words. \n\nAnyway - you don't have enough karma - *internet points* - to post there. They probably didn't want loads of spam on there back when it was properly moderated.",
            "4 post karma, 1 comment karma, yeah a lot of subreddits will be removing your posts until you get at least 300 karma. It's a struggle I still remember. It may take some trial and error, but you'll eventually find some communities that are nice enough to let you post. A good rule of thumb is that smaller communities tend to be more forgiving in the karma department.\n\nDoesn't help you have a default-generated username either.\n\nEdit: forgot some words.",
            "Yeah, the D2D list is def too big. Its ok to see some repeating posts but it looks like the mods just want a post there only every 5 months or something"
        ]
    }
}