{
    "Update : now more than 1,000 people dead at hajj": {
        "title": "Update : now more than 1,000 people dead at hajj",
        "score": 3816,
        "url": "https://www.theguardian.com/world/article/2024/jun/20/more-than-1000-hajj-pilgrims-die-in-mecca-as-temperatures-hit-high-of-51c",
        "content": "",
        "num_comments": 552,
        "comments": [
            "[And Allah has provided you shade out of what He created, and has given you shelter in the mountains. He has also provided you with clothes protecting you from the heat ˹and cold˺, and armour shielding you in battle. This is how He perfects His favour upon you, so perhaps you will ˹fully˺ submit ˹to Him˺.](https://quran.com/en/an-nahl/81)**\n\n**Offer not guaranteed, protection not to be taken literally, all rights reserved, side effects may include death, heat stroke, dehydration, dizziness, dry mouth, not FDIC insured, may result in loss of principal, offer void in Utah, some restrictions may apply, consult your doctor before beginning any new religious pilgrimages.",
            "Religion is cancer.",
            "Always a great idea to bake in 50C sun to worship a non-existent god.",
            "Allah needed them more than we did.",
            "I'm convinced that everything wrong in the world can be attributed to zealots trying to one-up each other.  The greater the cognitive dissonance, the deeper the stupidity, the more points these fools get.  Muslims, MAGATs, you name it.  The stupider the move, the higher the respect.",
            "Religion is so amazingly stupid.",
            "People make bad decisions.",
            "Darwin is always gonna Darwin",
            "This is absolutely \"god awful\", and I mean that in all senses of the phrase...",
            "Natural Selection hard at work"
        ]
    },
    "What a pathetic excuse of a country": {
        "title": "What a pathetic excuse of a country",
        "score": 899,
        "url": "https://www.reddit.com/r/atheism/comments/1dlgpn6/what_a_pathetic_excuse_of_a_country/",
        "content": "Recently a mob cheerfully lynched a man then set his body on fire in Pakistan for \"blasphemy\". It's not the first time an incident like this has occurred over there and it certainly won't be the last. The man they murdered was no minority either - he was a sunni muslim.\n\nYet somehow the guy who wanted to set up a gay bar there is declared mentally ill and sent to an asylum. The entire thought process is dysfunctional.\n\nReminder that Pakistan is the only country in the world created solely on the basis of religion.\n\nEdit: Ok it seems they may not be the first to do it but they're definitely the largest in the world, with more than 230 million people.",
        "num_comments": 144,
        "comments": [
            "Isn't Pakistan the place where inbreeding is promoted, too?",
            "Religion is like poison, or cancer to a society.",
            "When you take your religion and put it over life, can you really call it a religion?",
            "Pakistan's Indus River, which is fed from Himalayan glaciers, will run dry in a few decades. (Same is true for 11 other rivers that come from Himalaya ice melt). (Pakistan is also hotter climate than Iran. ) Gonna be a lot of thirsty people there. Meantime, not a safe place to visit.",
            "One of the first countries to die *en masse* due to climate change, not that that's any solace. Allah won't save Pakistan from the wet bulb globe temperatures, or from decline of the glaciers that once fed the Indus. The brightest/best educated know.",
            "And pathetic excuse for a religion as well.",
            "And we'll find out (as we always do) that this was actually revenge for some personal affront or slight and had nothing to do with Quranic nonsense.",
            "I honestly feel bad many of it's citizens. There are plenty of perfectly reasonable people living in the country who have to live in constant fear if there government murdering them of their family on some bogus \"blasphemy\" charge. In a country of over 200 million people, not everyone is going to be so blind to their governments wrong doings. Let's wish for the best for all the Pakistani people.",
            "Unfortunately if the christian riech gets there way in the USA, we can probably call our selfs the christian Pakistan.",
            "The christians claim the USA was created the same way. VOTE AGAINST THE FUCKING REPUBLICANS, forget any antipathy you may have against voting. This year you must vote. It is not hyperbole to talk about the 2024 danger. The Apostle Mike Johnson will destroy us all"
        ]
    },
    "The longest a person has clinically died and come back to life is 17 hours (back in 2008). And we're supposed to believe 2000 years ago, without modern day medical skills and technology, that a man died for 3 days and came back to life. ": {
        "title": "The longest a person has clinically died and come back to life is 17 hours (back in 2008). And we're supposed to believe 2000 years ago, without modern day medical skills and technology, that a man died for 3 days and came back to life. ",
        "score": 336,
        "url": "https://www.reddit.com/r/atheism/comments/1dllaog/the_longest_a_person_has_clinically_died_and_come/",
        "content": "And no, we're not supposed to ask for evidence that such an unbelievable event happened. No, we're just supposed to have blind faith. Just have faith that this happened, that's good enough apparently. \n\nIf you just think about it a little bit, it's ridiculous to believe the bible actually happened. Old or new testament. But billions of people don't question or think about it. They just have faith. ",
        "num_comments": 160,
        "comments": [
            "Why are you comparing science with the magic in a myth?",
            ".... and don't forget that his daddy required that he (the back from the dead guy) die to keep him (the daddy) from committing genocide again and that he (the back from the dead guy) is the same entity as his daddy (the genocidal maniac daddy) .....\n\nYa, there's no making sense of their poorly conceived lie.",
            "To be fair, their ability to determine if someone was actually dead or not was equally crude.  There was a fad in victorian london to put bells connected by a wire into coffins because sometimes people werent quite dead yet when they were buried.  [would you like to know more](https://en.wikipedia.org/wiki/Safety_coffin)",
            "Who was clinically dead for 17 hours in 2008? That sounds interesting.\n\nI was under the impression that the longest anyone ever went without a heart beat and still survived was more like 1 hour.",
            "The Romans killed the wrong hippy and Jesus' home boys were like you gotta lay low for a few days and then pop back up. It will be hilarious.",
            "The \"dying and rising God\" is a common religious motif. Both Osiris and Inanna died, spent 3 days in the Underworld, then rose from the dead. \"Religion is Myth-Information.\" :D\n\n[https://en.wikipedia.org/wiki/Dying-and-rising\\_deity](https://en.wikipedia.org/wiki/Dying-and-rising_deity)",
            "Someone 2000 years ago:\n\n\"Oh man, grave robbers got to the grave of our cult leader and stole his body, what should we do?\"\n\n\"Just say he came back alive, that will save us face and give us more credibility.\"\n\n\"Genius.\"",
            "Billions of people just can't cope with the reality that once you die, that's it.",
            "When you literally believe in magic, anything is possible.",
            "Almost everything said about Jesus is made up . There are a grand total of 3 to 4 sentences in all written history that mentions Jesus. Some of these sentences may not even be referring to him."
        ]
    },
    "God wants you to die in the heat": {
        "title": "God wants you to die in the heat",
        "score": 482,
        "url": "https://www.npr.org/2024/06/21/nx-s1-5013582/hajj-heat-deaths-saudi-arabia",
        "content": "Hundreds die during this pilgrimage. Religion is too powerful on the gullible. Religion makes you put your own life at risk. But god needs you to pay homage even if it kills you. ",
        "num_comments": 64,
        "comments": [
            "Allah is well aware of global warning and is culling the weak to grow a race of heat-tolerant Muslims.",
            "I read where the Saudi government had rest & water aid stations set-up along the road, but you had to register your hajj to get access, and thousands and thousands of the people refuse to register, so they can't use the aid stations.  Most of the casualties are Egyptian, and it costs ~US$6000 to get an official hajj permit.  And, of course, there are also independent operators that cost less, promise more, and then abandon the people they con in the desert.\n\nHumans are a stupid, stupid species.",
            "As if he cares. Guy is a sadist.",
            "Darwinism gonna Darwin",
            "Families of the dear departed are delirious  with joy that their beloved family member has died fulfilling his religious  duty.\n\nNote I did not say his/her as women are denied the opportunity  to die for their faith",
            "To the family of the deceased they believe that it was someone’s will and the souls will be rewarded ",
            "God's doing Darwin's work.",
            "Dumb people dying for their imaginary friend. Will always make me laugh",
            "In general God just hates people.",
            "Either god wanted them to die in the heat…or he can’t help them…either way…god is either weak or an asshole.  Religious people will say that he is doing that as a test…to see who is really committed to coming to Mecca. In other words he is running the Squid Games."
        ]
    },
    "The Bible was written before glasses were invented": {
        "title": "The Bible was written before glasses were invented",
        "score": 44,
        "url": "https://www.reddit.com/r/atheism/comments/1dlu42v/the_bible_was_written_before_glasses_were_invented/",
        "content": "Now I’m not sure whether or not the Bible were written by actual people who believed what they were writing all those years ago, but Christians love to go on about how according to historical records Jesus actually existed, so I’ve been thinking of various reasons the people who wrote the Bible wrote what they did.\n\nThen I realized that was a time before glasses. Also before several mental illnesses such as schizophrenia were diagnosed, not to mention the prevalence of alcohol which even the Bible discusses. Combine those and a floating log can very quickly become a man walking on water.\n\nCould also have just been mass hallucination lol.",
        "num_comments": 19,
        "comments": [
            "The bible is a collection of writings that are largely oral traditions from various religious sects. It was almost never written, first hand, by the person the book is named after.",
            "1024: Floating log is a man walking on water \n\n\n2024: Floating log is the Loch Ness Monster",
            "And don't forget about the psychedelic mushrooms growing in the Middle East back then",
            "I’m just picturing some eagle-eyed atheist in a tribe around a fire like “THE VOLCANO DOESN’T HAVE HUMAN FEELINGS!”",
            "There is a new body of work that exactly addresses the issues of reading and writing the bible while having degraded vision.  It is quite interesting. \n\n[Candida Moss lays it our here](https://www.amazon.com/Gods-Ghostwriters-Enslaved-Christians-Making/dp/0316564672/). \n\nBasically, if some dude like Paul, for example, got old and was still cranking out epistles but could no longer see well enough, he would be using reading and writing help, possibly slaves or former slaves.  \n\nAnd if that were the case we might expect to see some bias creep in due to the facts that the slaves disintermediated the author from their own work.",
            "Don't write it off as a mental illness or lack of glasses. People back then were not dumber than today and knew pretty well that one can mistake something for something else due to poor vision. The knew people can be mad and see what nobody else sees.\n\n\n  Scientology was created when everybody could buy glasses for cheap. Did it help?",
            "Jesus walked on ice \n\nPeter fell through thin ice",
            "Don't understand the prevalence of lead in these people's diets",
            "Then everyone played the scribe equivalent of \"telephone\"...no wonder it's all fucked up.",
            "Even now people refuse to believe the earth is round and other various fundamental facts about existence.\n\nDon't try to rationalize irrationality. You will just give yourself an incorrect idea about how people will actually behave."
        ]
    }
}