{
    "Attack on Titan / Shingeki no Kyojin - Season 4 Part 4 (Finale) - Discussion": {
        "title": "Attack on Titan / Shingeki no Kyojin - Season 4 Part 4 (Finale) - Discussion",
        "score": 1093,
        "url": "https://www.reddit.com/r/attackontitan/comments/17nn3ml/attack_on_titan_shingeki_no_kyojin_season_4_part/",
        "content": "* [Crunchyroll](https://www.crunchyroll.com/attack-on-titan)\n\n* [Hulu](https://www.hulu.com/series/attack-on-titan-9c91ffa3-dc20-48bf-8bc5-692e37c76d88)\n\n* [Funimation](https://www.funimation.com/shows/attack-on-titan/)\n\n#THE THREAD IS UNLOCKED WHEN THE SUBTITLED (!) EPISODE IS OUT",
        "num_comments": 2738,
        "comments": [
            "I can't imagine the relief anime onlies have now knowing they can browse the Internet again. Must feel like freedom.",
            "no matter what u think about the ending i think we can all agree that the music was perfect.",
            "I don't get it, why did Mikasa \"fix\" Ymir and make everything alright?",
            "THAT FUCKING POST CREDITS SCENE?!",
            "What do I do now that this is over. I feel like Ill never find anything like this ever again.",
            "Its on Hulu but unlisted.  Go to the last episode listed, hit play, then skip to the next episode.",
            "Anybody notice that the boy with the dog had a red scarf?",
            "And you keep my old scarf, from that very first week",
            "Can we talk about how sick the designs of the previous Titanholders were (the ones fighting on Erens back). The dinosaurs and the snake. Really cool that we got to see those in action \n\nI like how the old Warhammer Titans were like medieval knights and shit",
            "Bro the music is amazing"
        ]
    },
    "It took me 1.5 weeks to ban these posts. Yes it's awesome but stop the spam.": {
        "title": "It took me 1.5 weeks to ban these posts. Yes it's awesome but stop the spam.",
        "score": 268,
        "url": "https://www.reddit.com/r/attackontitan/comments/1dh32xx/it_took_me_15_weeks_to_ban_these_posts_yes_its/",
        "content": "https://preview.redd.it/xnrmo50n8w6d1.png?width=2482&format=png&auto=webp&s=1ceeeb8847ae89ea29233d4f899be41bd4346131\n\nThere have been about 10 posts just about this video in the past 3 days, maybe more since it's release.\n\nThis video, [link](https://www.youtube.com/watch?v=NjahiPD445k), is a brilliantly made video by the YouTube user xieboli. It took him 1.5 years to make this. Also, the guy has faced some mental issues along the way, show him some love!\n\nAnyhow, as excellent as the video is, spam is never acceptable so I'm going to pin this post for a week or two so y'all can see the video and stop the posts.\n\n\n\n**List of posts banned so far -**\n\n**1. My Top 5 (or any number of) Characters**\n\n**2. Just plain screenshots of any scene without a lot of discussion value.**\n\n**3. The 'To you, x years ago' posts, yes we get it but these posts are uncreative and boring.**\n\n**4. Spamming this video, it's great but the spam isn't.**",
        "num_comments": 56,
        "comments": [
            "It took me 1.5 seconds to type this comment",
            "Thank you mods for rumbling the spam threads. Doing Gods work",
            "Thanks, mod. I appreciate you doing god's work and keeping this sub of filth even though we're likely not gonna get any new content for years to come ",
            "Thank you for starting to ban the \"what does my top 5 say?\" posts too. They were getting insufferable.\n\nDoing the lord's work out here.",
            "Jesus christ thank you for removing the \"to you:\" posts, holy shit",
            "Holy mother dick that video is so fucking insanneeee!",
            "hello to my fav mod",
            "More subs should handle those idiotic posts like this",
            "Thank you for banning this stupid \"To you, x years ago\" posts. They were interesting the first 5 times, and then it's just dumb repetition.",
            "Can we do bottom 5?"
        ]
    },
    "Are the wall titans made from humans?": {
        "title": "Are the wall titans made from humans?",
        "score": 169,
        "url": "https://i.redd.it/mkfvrfzf9i9d1.jpeg",
        "content": "",
        "num_comments": 61,
        "comments": [
            "No, they weren't humans before. No humans come out of them once the rumbling stops.",
            "It isn't made clear if Karl Fritz took half a million of the Eldians he took with him to Paradis and turned them into the walls or if these Wall Titans were specially made with no human as a base.\n\nAll that we know is that its not confirmed one way or the other if there was humans before they became the wall, and that after the Power of the Titans is gone from the world all of the Rumbling Titans do NOT turn into humans, (or at the very least it is implied that they don't simply because it isn't shown when it very much could/would have been).",
            "Surely, like all titans. Ymir shaped them into giants and later they created the walls",
            "It is never explicitly stated, but from what we see they aren't. Also because they're a but too many...",
            "Really don't know. I feel like Ymir just built them upon Karl Fritz's orders alongside he walls in which they were covered. We see her building the walls and the Titans within.\n\nThink both Karl and Zeke had figured out how things worked in the Path and used the knowledge in innovative ways. Same thing done by the Fritz King that rendered all Subjects of Ymir immune to pandemic.",
            "Isnt there a scene of Ymir molding them from sand in the Paths?",
            "What else would they be made from?",
            "We don't know for sure.\n\nAlthough they still have the same weakness like any other titan in their nape which would suggest so.",
            "They could be like the ancient shifters on erens back as in they could be linked in someway to their human form but not directly inside",
            "Probably not. Even when the other titans were being controlled by Zeke and Eren, they still moved in different ways, uncoordinated and just doing what they're told as quickly as possible. The wall titans were very robotic and coordinated moving perfectly in tandem with where Eren wanted them to go.\n\nBasically, same hardware, different software"
        ]
    },
    "I really wish we'd gotten conversations like this lol! (artwork by mangga_j)": {
        "title": "I really wish we'd gotten conversations like this lol! (artwork by mangga_j)",
        "score": 439,
        "url": "https://www.reddit.com/gallery/1dqxc3z",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Really puts into perspective how fucked up Reiner's state of mind was ",
            "The show in general desperate needed downtime episodes. Its kinda nonstop action. The more I think about it the more I realize how empty Paradis feels because theres no time spent showing what *life* is like outside of battle/titan stuff. Would have loved more in between episodes with stuff like this to flesh out the world/day to day life.",
            "With they talked about Bertholdt ",
            "Funnily enough, this SAVED Reiner and Bertholdt. Remember, Erwin, Hange and Armin had already exposed these two the previous night. If he didn't pull the curtains there, the scouts would've led them underground and ambushed them so they couldn't transform.",
            " To be fair noone mentions this but Reiner threatens Eren by saying he'll kill thousands more if Eren doesn't go with him, why would he expect Eren NOT to do it?",
            "Annie explaining to Reiner how she got caught makes sense, but isnt it implied she got the gist of what happened on their end from Armin?",
            "And just like that Reiner got a reprise of that kick after Marcel got killed",
            "last page slaps\n\nI had to rewind this bit multiple times on first viewing.  \"Uh huh, uh huh, allaWHOOPDITTYWAT?!\"",
            "Well, both Annie and Reiner made it alive in the end, so I guess at some point they did have this awkward conversation, although I think Annie had already found out about it through Armin in her sleep it's just that yeah....we didn't get the chance to see it![gif](emote|free_emotes_pack|joy)",
            "Fr! I genuinely felt sorry for Reiner even tho back then he was being perceived as an enemy."
        ]
    },
    "How did the Wall Titans appear outside of the Paths? ": {
        "title": "How did the Wall Titans appear outside of the Paths? ",
        "score": 30,
        "url": "https://i.redd.it/kwrvq2e8ii9d1.png",
        "content": "After Ymir finished creating all of them in the Paths, did they just disappear out of there? ",
        "num_comments": 2,
        "comments": [
            "My understanding is that once finished she sends them up through the Coordinate (tree of light) to whichever branch connects to the person who is transforming into the titan. In the case of the Wall Titans, if they don't have humans in them to begin with then its likely they get sent through to the branch that connected to Karl Fritz himself and were created out of his titan through hardening.\n\nThe lightning effect when a titan transforms is that titan traveling through The Paths along those branches of light to their destination.",
            "# Make sure to flair posts correctly so you don't spoil the story for others.\n\n### REMEMBER TO BE CIVIL.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/attackontitan) if you have any questions or concerns.*"
        ]
    }
}