{
    "r/audiophile Shopping, Setup, and Technical Help Desk Thread": {
        "title": "r/audiophile Shopping, Setup, and Technical Help Desk Thread",
        "score": 9,
        "url": "https://www.reddit.com/r/audiophile/comments/1doay2v/raudiophile_shopping_setup_and_technical_help/",
        "content": "**Welcome to the** [r/audiophile](https://www.reddit.com/r/audiophile/) **help desk. A place where you can ask community members for help shopping for and setting up stereo gear.**\n\n*This thread refreshes once every 7 days so you may need to repost your question again in the next help desk post if a redditor isn't around to answer.*\n\n## Finding the right guide\n\nBefore commenting, please check to see if your question actually belongs in one of these other places:\n\n* r/StereoAdvice for home stereo shopping advice\n* [r/HeadphoneAdvice](https://www.reddit.com/r/HeadphoneAdvice/) for all headphones and portable shopping advice\n* [r/headphones - Shopping, Setup, and Technical Help Desk Thread](https://www.reddit.com/r/headphones/about/sticky)\n* r/CarAV for automotive sound\n* r/Bluetooth_Speakers for portable speakers\n* r/Soundbars for home theater sound bars\n* r/LiveSound for public use\n* [r/audioengineering Getting Started Guide](https://www.reddit.com/r/audioengineering/wiki/gettingstarted)\n* [r/audioengineering Shopping, Setup, and Technical Help Desk Thread](https://www.reddit.com/r/audioengineering/about/sticky)\n\n## Shopping and purchase advice\n\nTo help others answer your question, [consider using this format](http://www.reddit.com/r/audiophile/wiki/purchaseadvice).\n\nTo help reduce the repetitive questions, here are a few of the cheapest systems we are willing to recommend for a computer desktop:\n\n**$100:** **Edifier R1280T** **Powered Bookshelf Speakers** [Amazon (US)](https://smile.amazon.com/Edifier-R1280T-Powered-Bookshelf-Speakers/dp/B016P9HJIA) / [Amazon (DE)](https://www.amazon.de/EDIFIER-Studio-R1280T-Lautsprechersystem-Watt/dp/B00GBN50SC)\n\n* Does not require a separate amplifier and does include cables.\n\n**$400**: **Kali LP-6 v2 Powered Studio Monitors** [Amazon (US)](https://smile.amazon.com/LP-6-V2-Project-Powered-Monitor/dp/B09MLT8C45) / [Thomann (EU)](https://www.thomann.de/gb/kali_audio_lp_6_2nd_wave_white.htm)\n\n* *Not sold in pairs, requires additional cables and hardware, available in white/black.*\n* Require a preamplifier for volume control - eg [Focusrite Scarlett Solo](https://smile.amazon.com/Focusrite-Scarlett-Audio-Interface-Tools/dp/B07QR6Z1JB)\n\n## Setup troubleshooting and general help\n\nBefore asking a question, please check the [commonly asked questions in our FAQ](https://www.reddit.com/r/audiophile/wiki/FAQ).\n\nExamples of questions that are considered general help support:\n\n* How can I fix issue X (e.g.: buzzing / hissing) on my equipment Y?\n* Have I damaged my equipment by doing X, or will I damage my equipment if I do X?\n* Is equipment X compatible with equipment Y?\n* What's the meaning of specification X (e.g.: Output Impedance / Vrms / Sensitivity)?\n* How should I connect, set up or operate my system (hardware / software)?",
        "num_comments": 116,
        "comments": [
            "Shopping for whole home audio in a new how I am building. Main use case will be ambient music listening. I'd love some in-cieling/wall speaker recommendations (9ft in most cases). Also I am deciding between using 4-5 Wiim AMP Pros (when available) or dedicated AMP and Streamer. Any preference? If the latter, any recommendations on AMP setup?",
            "Need some advice for a stereo setup. I'm the process of buying a pair of Klipsch RP-600M II speakers and  a Klipsch R-121 subwoofer or the tier right below these (still have to decide which would be a better fit in terms of overall dimensions). My main issue is that I have an old AV receiver, specifically the Onkyo TX-NR509. Could I use it to drive the speakers? It's kinda of useless question though (but humor me nonetheless) considering I wanna change to something that has a smaller footprint. Are there any DACs/amplifiers that would be enough to squeeze some decent sound out of these that don't cost an arm and a leg? The main factor I'm taking into consideration is space, so it needs to be compact and fit on my desk (which is not huge) because I will connect it to my desktop PC. Also, I live in Italy in case it's a required detail.",
            "Looking to get the most out of my Elac uni-fi UB5 speakers. What amplifiers have you run that pushed enough current to these needy ones? \n\nCurrently running WIIM Pro to smsl SU1 to Fosi v3. Budgeting $1k USD. Don't have anywhere local to try gear. Internet and YouTube research has made me think about the Rotel A10 mk ii or arcam A5. This is a streaming only setup in an unfinished basement. Max volume around 85 db at less than 10 ft from speakers.",
            "My Sony Ult FIeld 1 speaker makes a high pitched ringing sound whenever it is turned on, I have tried connecting it to different devices, switching between AAC and SBC, and moving the speaker to different places. What could I do to fix this issue?",
            "Is a BlueSound Node a good way to experience lossless hifi music? Hooked up to an integrated amp. I just got a nice amp and my only source so far is my turntable, which really limits my selection. Looking to for a good way to hear more. Would a phone with an external DAC be a good way to hear or would a streamer like a BlueSound Node be better?",
            "Hello, I am looking to put in a 4 ceiling speaker and 2 floor sub system into my office, what kind I know nothing about sound systems and do not really trust my local AV companies. What size amp do I need? I am also very open to receiving brand/model recommendations. Was going to do research and try and figure out best quality to price and also just the best system as well.\n\nThank you in advance to anyone who is able to help.",
            "Eversolo DMP-A6 and Musical Fidelity M5si - Digital out from streamer to amp via usb, or analog to amp via RCA? Is the DAC in the M5si better than the DAC in the Eversolo? Also the USB in on the M5si is 24bit 96khz, is that a limitation ruling it out right off the bat?",
            "Hi,\nI have the opportunity to buy the Sanyo JA 220 and Yamaha A-700 amplifier for a similar price.  I wanted to ask - which amplifier should be a better choice?  I will add that I rather listen to rock, jazz and hip-hop music, although it would be nice if the amplifier was relatively universal.  Thanks in advance for your help",
            "Needing advice on connecting turntable to my setup.\n\nI just bought pair of Genelec 8030cs, Topping d10 as dac and Palmer monicon for volume control for those active speakers. I will connect all three to each other with xlr cables. In theory could I connect my turntable with rca output to phono amp and from that use rca-xlr cable to that Palmer volume controller and from that to those speakers since they are active speakers? Sorry for my poor english.",
            "Coax SPDIF cable: does it need too be 75ohms? \n\nThanks"
        ]
    },
    "Weekly r/audiophile Discussion #106: What Is One Piece Of Equipment That You'll Never Replace?": {
        "title": "Weekly r/audiophile Discussion #106: What Is One Piece Of Equipment That You'll Never Replace?",
        "score": 25,
        "url": "https://www.reddit.com/r/audiophile/comments/1dghh9s/weekly_raudiophile_discussion_106_what_is_one/",
        "content": "By popular demand, your winner and topic for this week's discussion is...\n\n# What Is One Piece Of Equipment That You'll Never Replace?\n\nPlease share your experiences, knowledge, reviews, questions, or anything that you think might add to the conversation here.\n\n***Vote for the next topic in the [poll for the next discussion](https://redd.it/1dghg2e).***\n\nPrevious discussions can be found [here](https://www.reddit.com/r/audiophile/search?q=flair%3A\"Weekly+Discussion\"&restrict_sr=on&sort=new).",
        "num_comments": 125,
        "comments": [
            "My Sennheiser HD800s my favorite headphones of all time",
            "My whole Sanyo tower. My late uncle had one when I was a kid and it stuck deep in my memories of those long gone days. New Years parties they had and music blasting from that system. Both uncle and aunt died too early, so I decided to build my own Sanyo system in remembrance of them. Took me some time to do it, but now I have my Sanyo tower and it always reminds me of him and that carefree days that are long gone",
            "There's no piece I would never replace. As an audiophile I'm in constant search of the best sound possible within my mean. If one piece becomes obsolete or I get the chance to have a better one and it will improve my sound, I will replace it without hesitation. In the last 2 years my sound system was replaced completely 3 times.",
            "My Mark Levinson No. 5805 because that was way more money than I can afford, and I'm getting old so my hearing is going.",
            "My Genelec 8351B. I think if they broke, I'd immediately buy either the same or figure out if I can somehow make space for the one size bigger speaker.",
            "After a long life involving experimentation with a variety of components, I've settled down for the most part. I've now owned my Martin Logan Request electrostatic speakers for perhaps 25 years, and they still delight me to the point where it's hard to imagine ever feeling the urge to replace them. I also have 20 year old Macintosh MC602 power amp that similarly continues to perform flawlessly.  My ancient Velodyne ULD-15 II servo subwoofer recently required a foam surround replacement. While there are almost certainly newer products with a slight edge, I don't feel like I'm missing anything when I listen to my system, and certainly not an improvement that would justify the high cost of upgrading.\n\nI hope that everyone can eventually get to this point in their hi-fi adventure, where they can stop fussing, and just relax and enjoy the music.",
            "I plan to keep my Infinity IRS Beta system for as long as it's serviceable.",
            "I don't think I really have one. I suppose my HD 560s won't get replaced until they actually break. Until that moment any new headphone will simply hang besides it. \n\nSpeakers, audio interface, subwoofer & PC are all very much upgradeable and would get replaced if I had Infinite money.",
            "rme adi-2 dac fs! ",
            "Parks Audio Waxwing phono pre with DSP and tons of other functionality I wont ever remove from my turntable chain"
        ]
    },
    "Congrats r/audiophile, you've made to the end of another week. Happy Friday! ": {
        "title": "Congrats r/audiophile, you've made to the end of another week. Happy Friday! ",
        "score": 187,
        "url": "https://www.reddit.com/gallery/1dqva84",
        "content": "",
        "num_comments": 38,
        "comments": [
            "Ladies and gentleman, its been a busy week. I have kit all over the place, a hallway full of boxes and more to get done on Monday. Nevertheless, its been a productive few days so Ive kicked my son upstairs, broken out some records. Ive also treated myself to an actual bottle of Spaten pilsner which is not the easiest thing to get hold of in provincial UK and Im enjoying it out of a glass Iborrowed from a Munich hotel many years ago. Late Night Final is running and the weekend fizzles with possibilities. Whether youre a measurement absolutist, horrified at me using a turntable(s) or someone who pops a pair of Mpingo wood clogs on before listening for better psychoacoustics, happy listening and heres to you and this gently demented pastime of ours.",
            "I dont recognize most gear, yet it all seems strangely alluring and Im happy for you. Cheers",
            "Cheers!\nHow do you fancy the L-509Z?",
            "Evenin' Ed! \n\nNice to see the 505s out for some 'me' time away from the day job ",
            "You have some crazy shit :)",
            "I'm considering kudos, what's your opinion?. Also please list your components. Thanks.",
            "10/10 would kick back and relax in that room.",
            "Beautiful system I wish you the best of luck with it may bring you many hours of enjoyment , I only have one minor complaint Id like to maybe see a tube amp , like a nice EL 34 amp, just messing about thats a beautiful system. You could be very proud. I just got so used to tubes when I see such a beautiful picture. It feels like something is missing, I have never had many problems with any good quality tube amp , but its a real pain in the ass when you need tubes when I was a kid I could re- tube With the best tubes for maybe 30 $40 now its 300 and400 $ and you gotta & kiss somebodys ass just to get them getting too old for that bullshit. I think Im on my way to SS, slowly, but surely really beautiful system in that picture picture\n",
            "Well done sir. Amazing setup. I'll play The Three Sounds to salute you.",
            "That EMT turntable sure looks fine! What are the stand mounts?"
        ]
    },
    "Breaking in new speakers!": {
        "title": "Breaking in new speakers!",
        "score": 82,
        "url": "https://www.reddit.com/gallery/1dr0dpw",
        "content": "I’ve ended up with a Yamaha focused main setup and am very happy with it. Recently switched from Sonos Faber Venere bookshelves to the Yamaha NS-5000 which was a big upgrade. The rest of my components are a Rose 150, Yamaha AS3000, and a vintage Yamaha PF-800. I also have a Sony CDP-X77ES that’s not currently hooked up due to shelf limitations. ",
        "num_comments": 25,
        "comments": [
            "Yamaha makes great gear, looks nice",
            "Very unique system. I would love to hear these, the driver material tech is fascinating. Built like tanks, too. Congrats!",
            "On the dream speakers list...great set up.  Im terrible at describing how speakers sound...can you take a crack at telling us what these are like with some different genres ?",
            "Hey, another PF-800 owner! Great gear and set up",
            "Ive been super curious about these Yamahas. I havent seen them show up on Reddit much. Initial thoughts?",
            "Man. That is a beautiful setup! What market amp is that? I can't recall seeing it here in the US.",
            "This is a dream for me. Can I get your full parts list to pin on my wall as motivation every time I need to go for my side job?",
            "Real audiophile gear for a music lover for sure. Picture sounds pretty good too.",
            "I would say 1500 to 15000 USD speakers?",
            "Ive only had them a few days and am likely equally as bad at describing the sound. With that being said, I mostly listen to classic rock, jazz, and classical and Ive been happy with all. Bass is plentiful (even with my less than optimal room treatment). Wide sound stage with easily identifiable instrument location. More technical than warm if that makes sense."
        ]
    },
    "New living room setup - Magnepan Lrs+ ": {
        "title": "New living room setup - Magnepan Lrs+ ",
        "score": 17,
        "url": "https://i.redd.it/h8dz4yyv9g9d1.jpeg",
        "content": "Gave away the Jamo 5.1 setup I've had for this normally casual TV space. With a theater now in place downstairs, I'm redoing my living room to a open listing/talking area. Try to ignore how off center things are haha.\n\nI got a pair of Magnepan LRS+, an Emotiva BasX Ta 2, an SVS sb1000pro, and a Wiim pro to stream Amazon. \n\nThis setup sounds transcendent for the cost I think. I've been listening through the Distant Worlds albums and am just immediately regretting not getting the 1.7 instead. Susan Calloway is so good.\n\nSo far all these items are a recommend from first impressions. I just wanted to share! Sounds almost as good as the Kef 950s I have.",
        "num_comments": 7,
        "comments": [
            "Thats probably the primary reason I have not been able to order a set of LRS+ the desire to go bigger after setting them up would be too great.\nThanks for sharing.  Enjoy them!  Fantastic value no doubt.",
            "Nice setup! I also started with the lrs and then eventually upgraded to the 1.7\n\nTry not to have too much fomo, the lrs is pretty fantastic. I would say the main improvement with the 1.7 is that they still have full sound when you are standing up and they have a bit more of a warm sound which I like.",
            "Yeah, I didn't think they were gonna be quite this good. I bet the 1.7s just up the fullness of the sound stage. I'll probably upgrade eventually.",
            "I have the .7s, on 3rd party stands, along with a couple of subs ( I listen to a lot of organ music. ) The sound is amazing!",
            "Yes 1.7s will be enough, but oooh maybe I should just try those 3.7s",
            "I already have this problem with telescopes lol"
        ]
    }
}