{
    "Weekly Property Mega Thread - 09 May, 2024": {
        "title": "Weekly Property Mega Thread - 09 May, 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/AusFinance/comments/1co0qjx/weekly_property_mega_thread_09_may_2024/",
        "content": "# Weekly Property Mega Thread\n\n\\-=-=-=-=- \n\nWelcome to the [/r/AusFinance](https://www.reddit.com/r/AusFinance) weekly Property Mega Thread. \n\nThis post will be republished at 02:00AEST every Friday morning.\n\nClick here to see all previous weekly threads:    \n[https://www.reddit.com/r/AusFinance/search/?q=%22weekly%20property%20mega%20thread%22&restrict\\_sr=1&sort=new](https://www.reddit.com/r/AusFinance/search/?q=%22weekly%20property%20mega%20thread%22&restrict_sr=1&sort=new) \n\n# What happens here?\n\nPlease use this thread for general property-related discussions, such as:\n\n* First Homeowner concerns\n* Getting started\n* Will house pricing keep going up?\n* Thought about \\[this property\\]?\n* That half burned-down inner city unit that sold for $2.4m. Don't forget your shocked Pikachu face.\n\nThe goal is to have a safe space for some of the most common posts,  while supporting more original and interesting content in their own posts.Single posts about property may be removed and directed to this thread.\n\n\\-=-=-=-=-",
        "num_comments": 17,
        "comments": [
            "A property I had my eye on has been marked as “Sold” on realestate dot com. Unlike other listings that has the sold price, this one says “Contact agent”. \n\nIs this common practice (I haven’t seen it on other sold listings til now) and anyone know why this is? Thanks.",
            "I got pre-approval for properties up to 650k, but I think the variable interest of 6.57% p.a is a bit high, and monthly repayments of $3700 is a bit much for a minimum income of $4400 monthly\n\nMy broker seemed to overinflate my income/ or I miscalculated (maybe she took into account my tax return?)\n~~~\nAnyway, I'm signing up for the shared equity scheme, but I exchanged contract with a seller, business-day 2/5\n\nShould I withdraw my contract, and hope I get approved for the shared equity scheme? The repayments will be less since I'm borrowing less.\n\nThe only con is I forgo a decent villa at $645k, and lose the 0.25% deposit. I'm stressed on the fence\n\n~~~\nEdit: my deposit is 40k, with 20k from parents but I don't wanna rely on them, so let's say it's 40k",
            "Been dealing with an investment group that \"specialise\" in properties, We are looking at buying an IP and continuing to rent until we generate enough equity to buy a house in a capital city... But the more i look at the houses and price trends in the surround estate where they want us to buy and build the more i end up scratching my head. \nIe new build 4 bedroom 2 car 440m² block under strict covenant laws is high $680s .... Similar houses on bigger blocks, albeit a few years older are selling for 580~660... \nWe really want to rent it at a reasonable price through a decent real estate and provide somewhere nice for people to live affoardably while they help us pay of part of the loan essentially so its a bit of a win win. But am i just a newb or would you too be concerned over the fact that the surrounding houses are cheaper to buy than build.",
            "I have a house. I have about $350k equity. I want to sell my house to move to our preferred location. \n\nI don’t really want to sell first to live with in-laws while we look/buy. What options would you recommend?",
            "I see a lot. not sure why other than to get your details and try to sell you similar houses.",
            "Usually occurs when the sale price is not that great or when the agent just wants people to put in their database.",
            "Is this a joint or single application?\n\nYour income will definitely not be enough to cover that sort of repayments.\n\nNo risk management team is going to approve that loan",
            "You should ask to see more detail at what's happened here. It's not clear how big your loan sizes is (vs properties up-to value). How big is your deposit?\n\nIf you are saying your after-tax monthly income is 4400, I'm assuming you mean pre-tax income is ballpark 65k-69k, so a 650k house is 10x your income. If you have a regular 5-10% deposit to go, then this seems like a LOT of house.\n\nSomething in these numbers doesn't stack up. Broker looks sus here.",
            "You need a bridging loan.",
            "If you have 350k equity, it sounds like your current property may be in a good location. You could ask the sales agents if they have buyers interested in off market properties that would be willing to accept a longer settlement period while you look/buy."
        ]
    },
    "Weekly Property Mega Thread - 20 Jun, 2024": {
        "title": "Weekly Property Mega Thread - 20 Jun, 2024",
        "score": 0,
        "url": "https://www.reddit.com/r/AusFinance/comments/1dkf7hi/weekly_property_mega_thread_20_jun_2024/",
        "content": "# Weekly Property Mega Thread\n\n\\-=-=-=-=- \n\nWelcome to the [/r/AusFinance](https://www.reddit.com/r/AusFinance) weekly Property Mega Thread. \n\nThis post will be republished at 02:00AEST every Friday morning.\n\nClick here to see all previous weekly threads:    \n[https://www.reddit.com/r/AusFinance/search/?q=%22weekly%20property%20mega%20thread%22&restrict\\_sr=1&sort=new](https://www.reddit.com/r/AusFinance/search/?q=%22weekly%20property%20mega%20thread%22&restrict_sr=1&sort=new) \n\n# What happens here?\n\nPlease use this thread for general property-related discussions, such as:\n\n* First Homeowner concerns\n* Getting started\n* Will house pricing keep going up?\n* Thought about \\[this property\\]?\n* That half burned-down inner city unit that sold for $2.4m. Don't forget your shocked Pikachu face.\n\nThe goal is to have a safe space for some of the most common posts,  while supporting more original and interesting content in their own posts.Single posts about property may be removed and directed to this thread.\n\n\\-=-=-=-=-",
        "num_comments": 2,
        "comments": [
            "Is it good to buy property (any property) now? Given the high? interest rates and soaring housing prices, should young adults still buy property ASAP, even if it’s a 1 bedroom shitty apartment? Or is it best to make other investments and wait for interest rates to come down?",
            "You better start believing in housing downturns. You're in one!"
        ]
    },
    "People who lived through high cost of living periods in the past, what was your mentality at the time?": {
        "title": "People who lived through high cost of living periods in the past, what was your mentality at the time?",
        "score": 119,
        "url": "https://www.reddit.com/r/AusFinance/comments/1dlnyis/people_who_lived_through_high_cost_of_living/",
        "content": "Currently as a millennial it feels like cost of living and inflation and the high interest rates will make it impossible to enjoy the same quality of life as our parents. \n\nIt feels that the common wisdom of investing into super and making sacrifices to afford a better later life or early retirement is kind of outdated and that doing that will not help much at all. \n\nThis is almost backed up by the fact that millennial and gen z have lower rates of investment and are kind of prioritising lifestyle spending as a 'screw it' kind of mentality.\n\nBut I'm curious. Is this just our current world view and recency bias making it seem like the future is screwed? Will things get better again? Should I stay the course and make my sacrifices and continue investing or do I need to enjoy my lifestyle more?\n\nI'm curious to hear from older people who may have experienced rising interest rates and how that felt at the time. Was it pretty bleak at the time? Did it look like you overreacted in hindsight?",
        "num_comments": 188,
        "comments": [
            "The most important thing anyone can do during any kind of economic downturn is to keep their job. I know it sounds glib, but it really is the key to absolutely everything else.\n\n\nThere's no secret to anything else. Delayed gratification is a thing during good times and bad - in many ways it's more important during the tough times to maintain a buffer if things don't go as well as hoped. That said, you still need to live and stay sane.",
            "Detach from consumerism and embrace simple living. Life is not cheap but I've found by trying to keep things simple/homemade/free, I have less stress of all kinds.",
            "Drop the subscriptions, shop at independents, buy fresh not prepackaged, always shop your insurance around, don’t be loyal to your banks, phone, internet, energy and insurance providers. \n\nGet out in nature, go for walks, hike, cycle, anything to get you off the couch. Lastly have a fund set aside for entertainment so you don’t go crazy.",
            "Happy people rarely complain publicly about anything. \n\nWhat I mean by that is that you need to be careful how much weight you put in any form of social media posting, reading or doom scrolling. \n\nFocus on what you’re doing, how you’re learning. How you’re growing as a person. You’ll attract the same. \n\nStay the course. I’m 46 and am really starting to be super aware of my work/life mortality. I’ve been working since I was 11. Full time since I was 15. I’ll retire in 14 years not because I’ve made no errors financially, I’ve made plenty, truthfully it’s heaps, really. I’ll retire by 60 because I’ve taken an active interest in my financial life. I truely started doing it at about 40. I wasted half my work life modding cars, partying and doing what I wanted right then, in the moment, with no view to my future. The only future thing I did was salary sacrifice a small about to my Super. \n\nI’m yet to find anyone who I deal with through my life or my job who are upset that they’ll retire ‘on time’, on their terms because they took an interest in their financial life. \n\nLife comes at you fast. Soon enough I’ll be 50, then 55 and working out a transition to retirement. I met my wife 10 years ago, it feels like 2 years ago. We just built/bought our house in 2021 and moved in 2022. Stay the course.\n\nEdit:\n\nHave a read of The Fourth Turning and it’s new addition The Fourth Turning is Here. It has helped to make sense of not only my place in the world but to reinforce that this isn’t the first or last time any of this life stuff, has happened.",
            "Keep your job, drop your spending, focus on saving for urgent items. Don’t go into debt",
            "There's one simple framework to life that will guide you well through ALL periods.\n\n\"Life\" is a wave. You can't control the wave. You're the surfer on the wave. All you can do is ride the wave that rises up before you as competently as you can.\n\nA similar metaphor is with tides. Sometimes you'll swim with the tide, sometimes against it. The best you can do is swim as competently as you can.\n\nAnd adopting a cheerful and grateful disposition will serve you through all seasons.\n\nMore practically. As much as it may hurt in the immediate, the human animal is extremely good at adaptation. And periods of frugality will reset your expectations quickly. You'll find yourself just as happy with less very quickly. And that's surely a good thing! 😊",
            "This is a short period of shit. \n\nWhen i was young, we lived in a caravan park, and had no money. Chrissy present was a stick, bday pressy was a rock. we didn't know how we were going to survive.\n\nI left home in '93. Interest rates were 10% (coming down from 17%) on their way down. I was on shit wage and just started working. Rent was $150 pw for 2 bedder unit. It took 4 years to save up for a deposit by working a second job. interest rates fell to about 8% by 1997 and was time to buy as rent was the same as mortgage. Being young, i didn't realise there were things like Rates, Insurance, Body Corp, etc, so things were even tighter. wasn't sure how we were going to survive, so got a 3rd job. \n\nBy 99, rates were down to 6.5%, things were better, started getting a few pay rises (not anything great). Then 2000 hit, and rates started to rise to about 8%. No one knew if we were going back to the bad old days of 17% or not. Didn't know how we were going to survive. Was short lived though as rates came down, and things got better.\n\nWe also had 2008, but we had been through it before, so didn't worry as much, even when rates went to 10%. but that to was also short lived. What i'm saying is that every couple of years, things are shit, we are just going through one of those times. it will get better for you. don't believe all these \"the sky is falling\" idiots. these shit periods help you get through the next shit period, use it as a learning exercise.\n\nAnswer: yes, you are overreacting, but everyone does.",
            "A large amount of Gen X walked out of school and into a recession.   Many of us just went traveling, and applied for jobs whereever we want - lived cheaply and eventually got work.   As a result, we're still all pretty cynical about the corporate world.",
            "Run if you’re in Sydney. Run run!!",
            "Buy less things. \n\nIt’s always hard starting out. You don’t need everything. \n\nYour parents had it tough too. They just made sacrifices. Don’t compare their “now” situation to your now situation."
        ]
    },
    "Which jobs are experiencing a lot of growth/ demand?": {
        "title": "Which jobs are experiencing a lot of growth/ demand?",
        "score": 79,
        "url": "https://www.reddit.com/r/AusFinance/comments/1dlpius/which_jobs_are_experiencing_a_lot_of_growth_demand/",
        "content": "Or will in the next 5-10 years?",
        "num_comments": 314,
        "comments": [
            "Electricians, plumbers, carpenters, builders, concretors.",
            "NDIS scamming seems to be a popular racket",
            "Sadly … psychiatry. Massive need for psychogeriatirics .. and geriatricians.",
            "Truck drivers!!! Lots of old buggers retiring soon",
            "Health is always in demand. Doctor, nurse, care worker, technician... get amongst it",
            "Crime\nHealth\nBuilding Industry",
            "Demand. Air traffic controllers.",
            "Construction\n\nBecause it's a key industry used in recovery and to fight of Inflation.",
            "Energy construction.",
            "Healthcare, childcare, teaching"
        ]
    },
    "What’s the point of tax cuts and gov’t handouts when inflation is the problem? ": {
        "title": "What’s the point of tax cuts and gov’t handouts when inflation is the problem? ",
        "score": 126,
        "url": "https://www.reddit.com/r/AusFinance/comments/1dli3sn/whats_the_point_of_tax_cuts_and_govt_handouts/",
        "content": "As per the title, can anyone eli5 why the government is pushing so many tax cuts and handouts for people in pretty much all tax brackets? I understand we’re all feeling the pinch, but isn’t putting more money in the hands of the masses just going to worsen inflation and kick the can down the road? Shouldn’t we be reserving social assistance to those who REALLY need it and everyone else can just forgo a few minor luxuries? ",
        "num_comments": 189,
        "comments": [
            "The trick is that you think the government is giving out tax cuts. But they aren’t. Due to rising wages and tax brackets not being indexed the government has actually massively increased tax on income over many years. Then they give you a small ‘tax cut’ but it’s just bs.",
            "The answer is simple, politics.",
            "The changes were politically locked in before covid, i.e. 2018/19, through legislation with a long run-out.\n\nUnderlying that is that our tax system needs to be globally competitive. Otherwise we can't retain or attract people in high demand positions that we need, e.g. surgeons, trades, cybersecurity, and many others.\n\nNonetheless, we need to discourage politicians from legislating major tax changes across more than a couple of years. Economics shifts too fast for a (ridiculous, imo) six-year ramp on personal taxation.",
            "It's exactly like the $300 energy payout for consumers rather than utilising it to tackle the issue itself, small \"feel-good\" moments and a tiny band-aid to stop people asking \"what are you doing about it\".\n\nIt's politics.",
            "The money is either going to be spent by the govt or returned to the people and spent by the people. Either way, it's going to be spent. Why not serve the people, like the govt is supposed to?\n\nIt only drives inflation if the money is used to increase discretionary. If it's just bridging the gap between inflation and wage growth then it should probably just help people dig themselves out of a hole, I suppose.\n\nPersonally, all of my rebates and tax cuts gets dumped into the motgage, which isn't inflationary. It's not deflationary either though",
            "It is a risk but certain rebates don't add officially to inflation and the tax cuts were factored into the RBA's numbers awhile ago.\n\nRemember everyone complaining about the government doing nothing about the cost of living (especially loud around the time of the Referendum)?  This is that",
            "The tax “cuts” themselves aren’t the problem as they are merely returning some of the bracket creep from the past 10-15 years.\n\nThe issue is that they are being done all at once now at a time where that is counterproductive to getting inflation under control.\n\nIf tax brackets were indexed to inflation there’d be no need for these “cuts” and indeed the government could elect to defer bracket indexation until inflation was back in the target range.\n\nThe reason none of this happens is because bracket creep is the only politically costless way to raise taxes.",
            "It’s far easier to make it look you’re addressing a problem than to actually fix the problem.",
            "Tax cuts and handouts have more effect on people on the lower income, so I think we are on the right track.\n\nLet's take $1,000 electricity rebate for example. For someone who makes $1,000 per week after tax, $1,000 extra is a lot. For someone who makes $10,000 per week after tax, $1,000 is a drop in the bucket.\n\nSame with tax cut. $200 tax saved per paycheck is a lot if your paycheck is $1,000. $1,000 tax saved per paycheck is no big deal if your paycheck is $10,000.",
            "The tax brackets need to be revised every few years because of inflation, they shouldn't cause inflation.\n\nWhat makes no sense is the literal handouts from multiple levels of government for eating out, and paying your utilities, during a time when the messaging from the RBA was to stop spending money."
        ]
    }
}