{
    "Weekly Property Mega Thread - 09 May, 2024": {
        "title": "Weekly Property Mega Thread - 09 May, 2024",
        "score": 8,
        "url": "https://www.reddit.com/r/AusFinance/comments/1co0qjx/weekly_property_mega_thread_09_may_2024/",
        "content": "# Weekly Property Mega Thread\n\n\\-=-=-=-=- \n\nWelcome to the [/r/AusFinance](https://www.reddit.com/r/AusFinance) weekly Property Mega Thread. \n\nThis post will be republished at 02:00AEST every Friday morning.\n\nClick here to see all previous weekly threads:    \n[https://www.reddit.com/r/AusFinance/search/?q=%22weekly%20property%20mega%20thread%22&restrict\\_sr=1&sort=new](https://www.reddit.com/r/AusFinance/search/?q=%22weekly%20property%20mega%20thread%22&restrict_sr=1&sort=new) \n\n# What happens here?\n\nPlease use this thread for general property-related discussions, such as:\n\n* First Homeowner concerns\n* Getting started\n* Will house pricing keep going up?\n* Thought about \\[this property\\]?\n* That half burned-down inner city unit that sold for $2.4m. Don't forget your shocked Pikachu face.\n\nThe goal is to have a safe space for some of the most common posts,  while supporting more original and interesting content in their own posts.Single posts about property may be removed and directed to this thread.\n\n\\-=-=-=-=-",
        "num_comments": 25,
        "comments": [
            "A property I had my eye on has been marked as “Sold” on realestate dot com. Unlike other listings that has the sold price, this one says “Contact agent”. \n\nIs this common practice (I haven’t seen it on other sold listings til now) and anyone know why this is? Thanks.",
            "Been dealing with an investment group that \"specialise\" in properties, We are looking at buying an IP and continuing to rent until we generate enough equity to buy a house in a capital city... But the more i look at the houses and price trends in the surround estate where they want us to buy and build the more i end up scratching my head. \nIe new build 4 bedroom 2 car 440m² block under strict covenant laws is high $680s .... Similar houses on bigger blocks, albeit a few years older are selling for 580~660... \nWe really want to rent it at a reasonable price through a decent real estate and provide somewhere nice for people to live affoardably while they help us pay of part of the loan essentially so its a bit of a win win. But am i just a newb or would you too be concerned over the fact that the surrounding houses are cheaper to buy than build.",
            "Is a 60K (10%) deposit just not enough these days? Looking to buy an apartment in the near future and everything I read is about people buying with 200K deposits wondering if it’s enough. \n\nAm I completely out of touch?",
            "I have a house. I have about $350k equity. I want to sell my house to move to our preferred location. \n\nI don’t really want to sell first to live with in-laws while we look/buy. What options would you recommend?",
            "I see a lot. not sure why other than to get your details and try to sell you similar houses.",
            "Usually occurs when the sale price is not that great or when the agent just wants people to put in their database.",
            "Yes, sellers or purchasers can request the price to not be displayed",
            "How much older are the neighbouring houses? Bear in mind you are getting a modern build with new inclusions/fixtures. Designs and floor plans may also be more desirable. Sure build quality is highly variable and something to be weary about. But be aware houses just cost much more to build today with inflation and cost of materials/labour",
            "lots of apartments can be had for 600k, you'll likely have to pay LMI (\\~10k additional added on to loan) unless you can find a favourable lender or qualify due to profession. You'll likely be able to get low or free stamp duty especially if you're a first home buyer",
            "You need a bridging loan."
        ]
    },
    "Weekly Property Mega Thread - 27 Jun, 2024": {
        "title": "Weekly Property Mega Thread - 27 Jun, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/AusFinance/comments/1dpusqn/weekly_property_mega_thread_27_jun_2024/",
        "content": "# Weekly Property Mega Thread\n\n\\-=-=-=-=- \n\nWelcome to the [/r/AusFinance](https://www.reddit.com/r/AusFinance) weekly Property Mega Thread. \n\nThis post will be republished at 02:00AEST every Friday morning.\n\nClick here to see all previous weekly threads:    \n[https://www.reddit.com/r/AusFinance/search/?q=%22weekly%20property%20mega%20thread%22&restrict\\_sr=1&sort=new](https://www.reddit.com/r/AusFinance/search/?q=%22weekly%20property%20mega%20thread%22&restrict_sr=1&sort=new) \n\n# What happens here?\n\nPlease use this thread for general property-related discussions, such as:\n\n* First Homeowner concerns\n* Getting started\n* Will house pricing keep going up?\n* Thought about \\[this property\\]?\n* That half burned-down inner city unit that sold for $2.4m. Don't forget your shocked Pikachu face.\n\nThe goal is to have a safe space for some of the most common posts,  while supporting more original and interesting content in their own posts.Single posts about property may be removed and directed to this thread.\n\n\\-=-=-=-=-",
        "num_comments": 11,
        "comments": [
            "I contributed 5k dollars from my bank to my super account. My bank shows me that they deducted it 2 days ago, but it doesn’t appear in my super account yet. How much time do they need to process ?",
            "It is funny how right I am.",
            "I have a 89,000 salary with a 130k deposit. Am wanting to bid on properties from 475K-500K... am I stretching myself too much?",
            "If it was only sold in April I would bet more on something happening in their personal lives that made me them list it again. Redundancy, separation etc",
            "Hard to say without knowing your standard living expenses (excl. rent). Would be worth budgeting out how much you'd have left over each month after mortgage payments, and assuming (conservatively) that the interest rates won't be any lower for the next few years",
            "Should be ok, depending on lifestyle. Is this to live or invest?",
            "500k property is properly a unit. It’s not really worth it to borrow 400k from bank in today’s rate. Just hold the cash and enjoy your interest.",
            "This is to live in. I would reign in my lifestyle a bit. At the moment I’m spending about 3k a month excluding rent. I eat out a lot and enjoy life. I also pay 170 a week in rent so it would be an adjustment but I’m very keen to live in my own place but don’t want a shoebox. It’s a hard call!",
            "3-5 business days. \n\n\nToo late for 2024.\n\n\nThink",
            "That's probably right"
        ]
    },
    "You invite people out to a restaurant to celebrate your birthday. Who pays?": {
        "title": "You invite people out to a restaurant to celebrate your birthday. Who pays?",
        "score": 156,
        "url": "https://www.reddit.com/r/AusFinance/comments/1dr5h3w/you_invite_people_out_to_a_restaurant_to/",
        "content": "Say you’re turning 30. You invite about 5-10 of your closest friends out to a restaurant for dinner to celebrate your birthday. \n\nSince you’re hosting the event, should you be the one to pay for everyone? Or do you expect everyone to pay for themselves? Alternatively, should you just divide the total bill amount evenly with each person?",
        "num_comments": 388,
        "comments": [
            "Depends who I’m with. My asian friends I grew up with would pay for it all themselves for their birthday and not allow any other way. My wog friends will pay for each other and fight over who pays as long the birthday person doesn’t pay a cent, and my aussie friends will ask who’s getting the bill and offer to pay for their share 🤣",
            "Everyone pays for themselves. Youre 30 and everyone has their own bills.",
            "Everyone pays for themselves and .. well it’s nice if all the friends collectively pay for the birthday girl - but it’s not expected",
            "In family situations (middle eastern background) the person who invited others would customarily pay for others, that’s just a cultural construct. I’ve been out with more mixed group of friends and we just split the bill evenly minus the birthday person.",
            "Pay their own way. You get shouted your drinks. ",
            "My 30th everyone paid their own. By 40 we were in a better financial position and held a function that we paid for, and the guests only had to pay if they wanted spirits that weren’t part of the alcohol package.\n\nIt may depend on your friendship group  and any cultural expectations, if in doubt make sure it’s clear when inviting guests what the arrangements will be before they are required to RSVP.",
            "I did exactly this for my 30th and invited about 15 people. I paid for everyone. They gave me gifts.",
            "If you are doing pay your own way (which is common), just state it in the invite (and the fact no presents are expected as a result).",
            "I pay. But often friends will offer to split. Unless they put up a serious fuss, I'll still pay.",
            "Probably my Chinese heritage, but that bills never making it to the table. If I can't sneak away, I'll make sure my wife does and settles it on the sly.\n\nAlso, beats having to fight my other Asian friends over the bill"
        ]
    },
    "Have you ever discovered family or friends are in a completely different financial bracket to what you thought? ": {
        "title": "Have you ever discovered family or friends are in a completely different financial bracket to what you thought? ",
        "score": 247,
        "url": "https://www.reddit.com/r/AusFinance/comments/1dqzjzz/have_you_ever_discovered_family_or_friends_are_in/",
        "content": "Relatives of ours - who we knew were comfortable but live relatively frugal lives e.g. public school, no cleaners, mainly eat at home etc, have modest holidays - have all of a sudden just bought a $10 million house. I’m happy for them, but it’s made me feel a little foolish, as I’ve thought they were on more money than us - but not this kind of cash - and I’ve chatted to them about school fees, and interest rates etc and thought we were complaining together. Now I realise they were on a whole other level. Has anyone had something similar happen? ",
        "num_comments": 205,
        "comments": [
            "Hah! Jokes on you, friends! You THINK I am relatively wealthy when I reality I'm in a catastrophic debt spiral! ",
            "I had a friend who was living in a small 2 bedroom apartment until his late 30s with his young family. He was house hunting for a while, and invited us over for dinner, to his 5 bedroom, double garage home on 1000sqm in a posh Sydney suburb that he paid $4.5M at auction.",
            "There’s plenty out there that don’t talk about their true wealth. They spend years or decades living well below their means working towards their ultimate goal. But theres also the possibility in this case that they’ve had a windfall of some kind.",
            "Smart people do not flaunt their wealth. They know better than to risk people taking advantage of it.",
            "I've had more experiences with the opposite: seeing people who I assume have similar incomes to my household constantly going on holidays, buying new vehicles every 5 years, always remodeling, etc, and assuming they are really good with money, have other income sources, windfalls, etc. But then they reveal that they have lots of credit card debt, refinance the mortgage to buy a new car, use redraw to remodel, etc.",
            "I purposely tell people at work I’m poorer than I am because if I let them think I’m doing okish, I’ll be a target for the next “cost cutting” etc exercise. ",
            "How do you know they did not inherit some money or wins Tatts?",
            "People can have lots of money and be able to relate to the common struggles. School fees suck. Sucks less if you have millions of dollars but still- paying more for things is lame.",
            "My step-grandparents just passed away and I knew they were well off. Had a nice house in a country town, had an investment property and I knew they had some shares. My step mum and her two siblings just got $2.5m each and the grand kids (not step grand kids) got about 300k each. While obviously sad for their passing, that's life changing money for my step mum and has allowed my step sister to buy a house with her husband and two small kids. Had no idea they were that well off.",
            "Maybe they got an inheritance. I know a couple with 4 children, single income who have rented forever. Always skint, get ftb etc.  \nJust bought a $2 mil home. Told the kids they’ve been “saving” but really their grandad died and this is how they can afford it."
        ]
    },
    "Recent home buyers… how are you all doing??": {
        "title": "Recent home buyers… how are you all doing??",
        "score": 104,
        "url": "https://www.reddit.com/r/AusFinance/comments/1dqzqxh/recent_home_buyers_how_are_you_all_doing/",
        "content": "Just bought our first house at the start of the year, and between unexpected costs related to the house and other things, June will be the first month we’re able to add to our savings account. \n\nOf course I knew there would be things to fix in a new to us house, but I didn’t expect it affect me so much mentally!\n\nWith general living costs still increasing massively (ughh daycare) and talk of another 1 or 2 interest rate rises I can’t feel comfortable about our finances (even though on paper we earn good incomes/didn’t over extend on mortgage).\n\nKeen to hear how others in a similar boat are going! I’ve heard the start of a mortgage is the hardest ",
        "num_comments": 243,
        "comments": [
            "It gets better in a few months/years time, i.e. your mind learns to cope by not thinking about it. There are no good answers to your question.",
            "The early days are indeed the hardest generally. Once you get a reasonable amount of savings (pref in offset a/c) you will feel less tense knowing that you have a buffer giving you time to deal with any unexpected events financially.",
            "Terrible. Same boat. Newborn. Maternity pay will run out soon.",
            "I work in a non-clinical role in the health industry and bought my house six months ago. I’m probably going to lose my job.",
            "I’ve been in my house for like 3 weeks and I can’t yet find the motivation or energy to deal with all the things I need to do. Even little things like finding and putting up curtains (fortunately there are at least dodgy blinds here). It’s hard when there’s only one of you and you work full time (plus overtime). At least I’m paying off my own mortgage now and not someone else’s!",
            "First year was rough. We are now 13 months out from moving into our new build. First year just sucked because we put all of our savings into this house, then had to buy furniture etc. it’s taken a good 12 months to dig ourselves out of that hole because saving has become much harder with interest rates being what they  are. We’ve now got a little buffer and steadily putting money away each month. Nowhere near what we’d like to but it is what it is.",
            "We bought at the end of last year, and sound similar - didn’t overextend on mortgage, have relatively good incomes etc. I knew the mortgage repayments were going to be a shock (double our rent payments) but I wasn’t prepared for all the extra costs (it had been a rental for a number of years so wasn’t very well looked after - we repainted and did the floors before moving in, and then in the first 3 months had to replace the dishwasher, oven, heating ducting, and spend about $4k “possum proofing” 😅). We’ve now fixed all the essential things (for now at least - I am worried the heating and hot water will go soon), and so are in a phase of “nice to have” improvements. The way we are tackling these is by putting money each month into a “house fund” - once we build that up enough we can do the next thing we want. I find that’s helping us not spend like crazy, but still work towards improvements. We do also have about 6 months worth’ of expenses in an emergency fund in case any disastrous happens (we were lucky to have a guarantor arrangement so didn’t have to use all our savings on the deposit).  Each month we are putting between $500-$1500 in the house fund, a holiday fund, and our savings (all offset accounts) - but when we were renting we were saving around $4-5k a month so it’s very different and there is a significant mindset shift!  But even if we aren’t “saving” that much one month, we are still paying off a mortgage, building equity, and hopefully improving the value of our home too - at least you’re paying off an investment 🙂  1-2 more rate rises will suck, but if we can all get through the next 6-12 months, I’m hoping there will be some relief after that!",
            "why would you put excess cash in a savings account earning a pittance of money that you have to pay tax on ?  \nput your savings into the mortgage offset account.",
            "I won't deny it's a hard slog.  Really hard slog for the first few years.  What made it easier is to do fortnightly payments instead of monthly.  Turns out to be one extra repayment a year.\n\nAnd yes, the first few years of a mortgage is the hardest.  All I can suggest to keep plodding along.  If you and your partner get a small bonus, put that onto the mortgage, every little bit helps.  I've even gone as far as putting birthday  onto the mortgage.",
            "Spent all morning visiting well priced starter homes on the Sunshine Coast only to be greeted by the same Victorian plated Mercedes with a slob of a boomer driving it hunting investments. So yeah demoralising to say the least"
        ]
    }
}