{
    "Can I do a letter of demand ": {
        "title": "Can I do a letter of demand ",
        "score": 16,
        "url": "https://www.reddit.com/r/AusLegal/comments/1dr0zzl/can_i_do_a_letter_of_demand/",
        "content": "In March I put an offer on and paid a deposit on a property but once the strata came back there was material issue noted about the whole building needs new cladding costing about 400k\n\nI rescinded the contract and bought another property.\n\nBut I said to my conveyoncer don’t they have to disclose big issues like that upfront? And she said yes and then issued an email back saying due to this non-disclose to send  my deposit back.\n\nWe have emailed the other conveyancer 5 times and no response, not even a no. and my other property settled so I’m done with my conveyancer but this issue is still uresolved and I don’t know what to do.\n\nWhile it’s not a huge amount it’s the principle  I want my deposit back plus and also the fee I was charged from my conveyoncer to help with that contract I rescinded. \n\nDo I have any legal avenues ",
        "num_comments": 5,
        "comments": [
            "Go speak to a solicitor rather than a conveyancer",
            "Yup letter of demand, depending on the deposit amount it might not fall under small claims, if it doesn't then you will need a lawyer to file for you in a higher court.\n\nLooks like NCAT (small claims) can handle up to 100k \n\nAnything above that you will need a lawyer.",
            "\nWelcome to r/AusLegal. Please read our [rules](http://reddit.com/r/AusLegal/about/rules) before commenting. Please remember:\n\n1. Per rule 4, this subreddit is not a replacement for real legal advice. You should independently seek legal advice from a real, qualified practitioner. This sub cannot recommend specific lawyers.\n\n2. A non-exhaustive list of free legal services around Australia can be found [here](https://www.reddit.com/r/AusLegal/wiki/freelegalservices/).\n\n3. Links to the each state and territory's respective Law Society are on the sidebar: you can use these links to find a lawyer in your area.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AusLegal) if you have any questions or concerns.*",
            "Pretty sure they have to provide you with an offer pack which includes recent meetings and strata balance. It's then up to you to do your due diligence. if they don't then the REA hasn't disclosed correctly and the offer may have been null and void anyway.\n\nBit strange though to put down a deposit and offer before seeing the strata details,\n\nI'd assume unless you made your offer subject to \"seeing strata details\" then the recourse would be minimal."
        ]
    },
    "Court Sentencing": {
        "title": "Court Sentencing",
        "score": 20,
        "url": "https://www.reddit.com/r/AusLegal/comments/1dqychx/court_sentencing/",
        "content": "If you are sentenced to prison time in court, do you immediately get taken to prison or do you have a time period to get your affairs in order? If it depends certain factors, what are they?",
        "num_comments": 24,
        "comments": [
            "In just about EVERY circumstance, you’ll be taken into custody immediately, if not already and bail revoked at the same time.\n\nYour affairs need to be in order before you attend sentencing for this reason.",
            "[removed]",
            "When you get a custodial sentence you are going to prison immediately to serve it. \n\nYou can bring cash money in your pockets and that will go into your prisoner trust fund.",
            "From what I can tell, straight to prison. \n\nI work in utilities, it's fairly common for us to be contacted by family members of people who have gone inside to close their accounts/etc. This can be problematic as many do not have time to set up Power of Attorney etc, or give authority. \n\nEven more common is for us to disconnect a service due to non payment only for the person to struggle to afford to pay and reconnect for gas the hot water system used for months while they were in prison and they had no income. Or new tenants to move in after the previous person was evicted because they didn't pay their bill and the landlord had to go through a whole process because nobody allowed the inmate to communicate with them.\n\nThe way they set this up and the treatment of inmates once they are inside make it *extremely* difficult for them to manage their affairs. They will often come out deeper in debt than they were, and there is no legal obligation on creditors to help them out.",
            "Straight to custody. Any client i have facing immediate, advice is put money in your pockets and write your phone numbers down.",
            "It’s also worth noting that in the case of violent crimes, you are often already in police custody (read prison) leading up to the official sentencing.",
            "If it's a sentencing you will be in the dock. If your going for a lagging well be prepared to go that day. Talk to your lawyer. Word to the wise , get your financial matters in order beforehand. Zero your credit cards and close them, cancel reoccurring payments and give enduring powers to a trusted individual.",
            "I was a major witness in a criminal case, and the accused (perpetrator) was read his sentence of guilty and immediately taken to Melbourne Assessment Prison (obviously I’m based in VIC). \nFrom what I can understand / research, he had his affairs in order incase he was found guilty - which he was.",
            "Straight to the jail house, but I think prior to the event people are given a warning to get their affairs in order just in case",
            "\nWelcome to r/AusLegal. Please read our [rules](http://reddit.com/r/AusLegal/about/rules) before commenting. Please remember:\n\n1. Per rule 4, this subreddit is not a replacement for real legal advice. You should independently seek legal advice from a real, qualified practitioner. This sub cannot recommend specific lawyers.\n\n2. A non-exhaustive list of free legal services around Australia can be found [here](https://www.reddit.com/r/AusLegal/wiki/freelegalservices/).\n\n3. Links to the each state and territory's respective Law Society are on the sidebar: you can use these links to find a lawyer in your area.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AusLegal) if you have any questions or concerns.*"
        ]
    },
    "REA didn’t disclose heaters failed safety tests": {
        "title": "REA didn’t disclose heaters failed safety tests",
        "score": 10,
        "url": "https://www.reddit.com/r/AusLegal/comments/1dr1fyi/rea_didnt_disclose_heaters_failed_safety_tests/",
        "content": "VIC\nWe moved into our current rental 3 months ago. The house has a large living room and moderate sized dining room. Both have large gas heaters. We set up the kids play room, where we spend the bulk of our time in the smaller room, thinking it would be easier to heat ect. \n\nWith Winter getting colder (we live in western Victoria) we decided to start using the gas heater in the play room but it had a funny smell that made us uncomfortable. So we got the REA to send out a plumber to do a safety check despite the entry report saying a safety inspection was done last November. \n\nThe Plumber told us that while he couldn’t detect any Gas the last inspection showed it FAILED it’s pressure test and should have been disconnected due to safety reasons so he disconnected it on the spot. We asked about the other one but he said it was already disconnected for safety reasons. None of this was disclosed when we moved in.\n\nThe living room does have a small split system but it really struggles to heat the whole living room. It has no hope oh heating both living areas.  I’m going to request the REA install adequate heating in both rooms but I’m worried that since the main living room has the split system already they will just say no.\n\nDoes the fact we rented it thinking it had proper gas heating (when it doesn’t) make a difference? I’m interested in what people think we should do.",
        "num_comments": 3,
        "comments": [
            "It's an existing fixture which means the landlord has to repair/maintain it as part of their obligations\n\nAs its a heating fixture it would also come under an urgent repair so must be attended to asap",
            "\nWelcome to r/AusLegal. Please read our [rules](http://reddit.com/r/AusLegal/about/rules) before commenting. Please remember:\n\n1. Per rule 4, this subreddit is not a replacement for real legal advice. You should independently seek legal advice from a real, qualified practitioner. This sub cannot recommend specific lawyers.\n\n2. A non-exhaustive list of free legal services around Australia can be found [here](https://www.reddit.com/r/AusLegal/wiki/freelegalservices/).\n\n3. Links to the each state and territory's respective Law Society are on the sidebar: you can use these links to find a lawyer in your area.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AusLegal) if you have any questions or concerns.*",
            "If you have a split system that supplies heat, it's unlikely they will fix it or be forced to. They can be forced to disconnect both gas heaters for safety, but that's all."
        ]
    },
    "How easy is it to contest a will? Can it be avoided?": {
        "title": "How easy is it to contest a will? Can it be avoided?",
        "score": 4,
        "url": "https://www.reddit.com/r/AusLegal/comments/1dr5vg6/how_easy_is_it_to_contest_a_will_can_it_be_avoided/",
        "content": "My father is getting older and sorting out all his affairs. My sister is helping him with this. My father wants to leave his house and everything he has entirely to my sister. I am ok with this. My sister has recently gone through a divorce and has looked after my parents as they age, leaving her with little personal assets. I have married and am fairly comfortable in life. \n\n\nMy concern is I have a brother and sister in law who, though are fairly well off (sister in law comes from very affluent family and they live in a very wealthy part of town) have a very mercenary outlook on these things. They have caused alot of dramas and stresses in our families life. They are mostly takers and guilt my parents into looking after their kid 6 to 7 days a week (ethnic family values I guess) while they live their best lives. Though they have done nothing to assist my parents in their old age and in many ways have been a burden on them, I have a feeling they will come after the assets that are being left to my sister.\n\nWe are going to speak to lawyers and sort the will next week. But I just want to know if it will be at all avoidable, when the inevitable happens to stop the parasitic side of my family going after the side that helped my elderly parents.",
        "num_comments": 14,
        "comments": [
            "It’s best to leave some money for everyone. Give a larger amount to the sister that needs more. You can also gift her your share.",
            "\nWelcome to r/AusLegal. Please read our [rules](http://reddit.com/r/AusLegal/about/rules) before commenting. Please remember:\n\n1. Per rule 4, this subreddit is not a replacement for real legal advice. You should independently seek legal advice from a real, qualified practitioner. This sub cannot recommend specific lawyers.\n\n2. A non-exhaustive list of free legal services around Australia can be found [here](https://www.reddit.com/r/AusLegal/wiki/freelegalservices/).\n\n3. Links to the each state and territory's respective Law Society are on the sidebar: you can use these links to find a lawyer in your area.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AusLegal) if you have any questions or concerns.*",
            "In NSW your brother can contest the will. He could win even if he has been a bad son. It is a very real possibility. You want to get a good lawyer. The most he could get would probably be a third. you could give your third to your sister.\n\n  \nI don't know about VIC. here is info on VIC [https://www.armstronglegal.com.au/contested-wills/vic/contesting-a-will/](https://www.armstronglegal.com.au/contested-wills/vic/contesting-a-will/)",
            "He needs to see a lawyer, however it would be easier if he was to only leave the house exclusively for your sister and then split the remaining assets between the three of you evenly. It would be an easier argument to make that he wanted to keep the house in family hands and not sold. \n\nYou can always gift your share to your sister and your father whilst he is alive can always pay your sister for the care that she is providing.",
            "Not a lawyer but my sister in law contested the will and the settlement gave her a huge payout.    In Australia, wills aren’t worth the paper they are written on.   If you think they will contest, it’s best for your father to gift assets to your sister beforehand.   It is taxed but there are probably ways to minimise that.",
            "Something needs to left to them so that they can’t say they’ve been left out. Just a sum of money will do, I can assure you, if they are hungry they will contest.",
            "Where there's a will there's a court case. Advice on gifts before death can be helpful",
            "Why aren’t you asking the lawyers you’re seeing next week instead of the internet? The answer to this is “it depends”. They’d need a lot more info.",
            "This is in VIC, if that makes any difference",
            "I don't know about VIC. here is info on VIC [https://www.armstronglegal.com.au/contested-wills/vic/contesting-a-will/](https://www.armstronglegal.com.au/contested-wills/vic/contesting-a-will/)"
        ]
    },
    "Real estate said our stove is not working and fixed it, now asking for money. Can they do that?": {
        "title": "Real estate said our stove is not working and fixed it, now asking for money. Can they do that?",
        "score": 56,
        "url": "https://www.reddit.com/r/AusLegal/comments/1dqhvv1/real_estate_said_our_stove_is_not_working_and/",
        "content": "Recently moved out of a place.\n\nThe agent just sent us a outgoing condition report and said 2 of the cooktop igniters were not working and are asking to claim $50 from us.\n\nI'm sure that the stove was working however I didn't record any videos before we left. Can they just ask us for that without any evidence?\n\nCan I ask for evidence?\n\nWhen they say claim, does that mean they are gonna deduct it from the bond?\n\nThanks",
        "num_comments": 24,
        "comments": [
            "This should help: https://www.nsw.gov.au/housing-and-construction/renting-a-place-to-live/residential-rental-bonds/dealing-bond-disputes-for-tenants\n\nIn short: A faulty stove is always going to be the landlords responsibility, unless it was caused by damage beyond reasonable wear and tear. THEY need to prove that it was (good luck!).\n\nThey can try and claim it from the bond, DO NOT let them. It’s a classic example of any excuse to try and keep bond money. Happens all the time. REA’s are maggots trying to feast off the money of tenants.",
            "Tell them no and claim your bond yourself asap. You’re not responsible.",
            "That fsuly would be considered wear and tear rather than Tennant breakage",
            "they dont have the power to just take from the bond they have to get it approved from tribunal doubt they're going to bother over $50. So deny it. You'd be stupid to just take it. You know it was working, you bloody lived there. Ignore them. Let them take it to tribunal. (they wont) apply for your own bond so they have 2 weeks to release it and not play stupid games",
            "$50 to fix an igniter lol\nTo get a gas plumber out alone for a service call would be $150 minimum.\nAsk for the invoice and service report from the plumber which states that the igniter was damaged and required repair",
            "I'd be curious to know how they were able to ascertain it was damaged or used improperly by you. That it's not working isn't enough. Even if it was working fine the day before you moved out and isn't now, maintenance is a landlord issue.",
            "\nWelcome to r/AusLegal. Please read our [rules](http://reddit.com/r/AusLegal/about/rules) before commenting. Please remember:\n\n1. Per rule 4, this subreddit is not a replacement for real legal advice. You should independently seek legal advice from a real, qualified practitioner. This sub cannot recommend specific lawyers.\n\n2. A non-exhaustive list of free legal services around Australia can be found [here](https://www.reddit.com/r/AusLegal/wiki/freelegalservices/).\n\n3. Links to the each state and territory's respective Law Society are on the sidebar: you can use these links to find a lawyer in your area.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AusLegal) if you have any questions or concerns.*",
            "Sounds like potentially the exit clean may have clogged up the gas outlets on those two cooktops, the igniters themselves were fine but they’ve had to clear the blockages. Nowhere will even look at it without at least a $150 call out fee, so if tenant had been partially been responsible (cleaned themselves but didn’t test afterwards) they may be trying to recoup some of the loss. Unsure if that’s legal, but it seems like that might be what’s happening.\n\nSource: worked in appliance repair for 3 years",
            "No they can’t. Apply for your bond immediately.",
            "That’s on the landlord."
        ]
    }
}