{
    "New house insulation - Buyer's remorse": {
        "title": "New house insulation - Buyer's remorse",
        "score": 5,
        "url": "https://www.reddit.com/r/AusPropertyChat/comments/1dr5jzv/new_house_insulation_buyers_remorse/",
        "content": "Hello friends, \nI purchased a 1 year old house 2 months back in one of Melbourne west suburbs.\n\nI'm feeling buyer's remorse within the 2 months, because of the terrible Insulation in the house. House is not even giving 2 degree celsius Difference from outside, even all doors, windows and blinds are down.\n\nIs this common for all new houses ? Specific to my home ?\n\nCan I contact builder for this issue ? Or Do I need to hire any for looking into this insulation issues?\n\nAny info on this is really appreciated. Thank you very much in advance.",
        "num_comments": 24,
        "comments": [
            "Yep pretty common in Australia.  Minimum insulation requirements for new builds are a joke.\n\nGet some quotes to get batts installed in the roof cavity.  Will make a huge difference.",
            "Grab some earthwool ceiling batts from Bunnings. Easy to on install yourself and you’ll save a ton of money on someone doing the job for you.",
            "2 degrees with what heating?  insulation doesn’t make your house magically warm, it just slows the heat transfer.  \n\nJust like an eski doesn’t keep things cold without ice. \n\nIf the house is not mega insulated and no passive solar design (designed to be heated by the sun), then you still need to heat it some how.  \n\nTurn the heat pump on, see what it uses and then you can see if you actually have an issue.",
            "What sort of window coverings? Put up some heavier drapes",
            "Installing insulation in the roof isn't that difficult if you're even a little bit handy, will cost you a couple grand",
            "Roof insulation batts are not very expensive, and you can install them yourself. You will need a ladder to get into the roof cavity, possibly some planks to use to safely walk/kneel around the roof cavity, protective glasses and a mask, and you may want to turn off electricity to the whole house for safety. (As you don't know  the condition of the wiring, and if there are any loose/poorly done electrical connections in the roof) \n\nDo some research first and watch some videos about how to move around a roof cavity, and what is/isn't ok to step on. You'll want to get the highest R value you can afford. R6 is fairly standard, but R7 and even R8 is available, depending on your budget and what you can fit into your roof. R6 should still be a significant upgrade however.\n\nIf you've had a quick look in your roof cavity and think it will be too difficult/scary for you, then contact a professional to get it done. \n\nGood insulation can reduce heating/cooling costs by a significant amount, so this is well worth it either way, but it's definitely possible to DIY, just take safety precautions.\n\nAlso consider heavier blockout-style curtains. Since you don't want to spend a lot of money, something like Ikea curtains are a good, DIY-friendly option. Keeping these closed at night will help reduce heat loss.",
            "If the house is one year old, then it was supposed to be built to a 6 star energy rating. Builders can be pretty lapse on how strictly they build to this code, but I doubt very much there is no insulation in the roof. Check the roof space it may just need some re-arranging. Also insulation does not work miracles, it merely slows down the speed at which a room heats up or cools down to match the surrounding temp. If you get multiple days with no sun and you are not running heating eventually empty rooms will get cold.",
            "There are so many different factors that are apart of this and it's not something you usually think about with your first house.\n\nType of construction - double brick, brick veneer, siding.\n\nThis will have significant different insulation factors.\n\nEven things like ceiling heights matter.\n\nThen we have all the other stuff, roof insulation, wall insulation, windows and doors, seals on all the windows and doors, the list goes on an on. \n\nSome things can be changed and some can't and some depend on the type of construction.\n\nBut yeah generally if you didn't request anything then you get the bare minimum. It's unlikely there are faults from the builder (as in things not installed properly), you get what you pay for essentially.\n\nUnfortunately most stuff you won't be able to change and the majority of the stuff you can change will be very expensive.",
            "Our rental was built in about 2008. Recently ripped out and replaced the bathrooms because they were constantly leaking water into the floor and causing the ceiling in the room below to collapse. Turns out there was never any waterproofing installed. Went to have a look at the ripped out bathrooms - was (mildly) surprised to also find out there isn't any insulation present either. Construction industry hasn't given a shit for a while by the look of it.",
            "Is it a steel frame house?\n\nIf so, the insulation in the walls isn’t worth the money."
        ]
    },
    "Who is designing and building reputable homes in Australia?": {
        "title": "Who is designing and building reputable homes in Australia?",
        "score": 3,
        "url": "https://www.reddit.com/r/AusPropertyChat/comments/1dr6e3b/who_is_designing_and_building_reputable_homes_in/",
        "content": "I've seen a lot of posts regarding poor builds and even new build buyers morse.. all of it pretty sad and no doubt infuriating for owners.  Especially in a cost of living crisis, where we all want the most bang for buck.\n\nMy question is, who out there can be trusted? Is there a union or guild that build to specific livability and environmental standards, not merely the bare minimum? Does it simply just come down to cost over ethos?",
        "num_comments": 3,
        "comments": [
            "Keen to see what the masses think, because my builders opinion is there's not really any large companies doing a *good* job and I would tend to agree. Materials and Labor prices make it nearly impossible for them to do a job for the prices people would be willing to pay for a *good* job. Most builders hope you don't get independent stage inspections and you don't look to close at things.",
            "No one does anything well. We're a cynical society of money grubbing hucksters. Anyone who shows a glimmer of integrity gets marginalised instantly.",
            "I built with Boutique Homes a couple of years ago.  Had my own independent inspector check at each stage of completion, and they only ever found very minor issues.\n\nI haven't really found anything major to complain about, so I'm pretty happy overall."
        ]
    },
    "Leaking in apartment building garage": {
        "title": "Leaking in apartment building garage",
        "score": 6,
        "url": "https://www.reddit.com/gallery/1dr0z95",
        "content": "Buying an apartment in VIC and found these leaks in the garage at an open inspection today. It’s raining and water is actively flowing out of the pipe in the first image, and dripping from the wires in the second image. \n\nWould you avoid buying an apartment in this block? Strata has a solid administrative fund but no maintenance fund. New to all this so I’m looking for advice.",
        "num_comments": 13,
        "comments": [
            "Glad you have a “Sinking Fund” huh!",
            "What basement doesn’t have water ingress",
            "What are the current strata fees and any special levies for this apartment? It seems that the building is showing its age, particularly in photo 2, where there appears to be a leaking issue. This leak might be due to pipe wear and tear, which should be relatively easy to resolve.",
            "Indicate poor care and maintenance. Is it managed by a reputable Owners Corporation company? They should arrange to fix if part of the Common property.",
            "Ground water coming through conduits it looks like. Or the drain backing up",
            "Imagine when it actually starts raining. \n\nhttps://preview.redd.it/gd7gy6jfaf9d1.png?width=483&format=png&auto=webp&s=52bfc39ec4835f64e219030294b9c50ea9290610",
            "Looks like drainage",
            "No maintenance fund? How many units?\n\nThe issue you've highlighted doesn't bother me, but the no fund does .\nI've lived in blocks with low maintenance funds, for small blocks it's not a massive issue if the 10 year forecast doesn't have any horrors ahead.\n\nIf the 10 year forecast is old, it means it's been deferred. Which is normal  but means you don't have a good idea on what's to come. \n\nFor large blocks I wouldn't be too fast to jump onboard without good due diligence.",
            "Looks like skyhaus lol",
            "Basements aren't habitable areas so water ingress isn't a high priority."
        ]
    },
    "South East Water bill ": {
        "title": "South East Water bill ",
        "score": 2,
        "url": "https://www.reddit.com/r/AusPropertyChat/comments/1dr41ru/south_east_water_bill/",
        "content": "Hi All \n\nWas wondering if I could get your advice on something. \n\nMy apartment settlement was on 1 June 2024. I received an invoice from South East Water for a bill from 13 May to 1 June, addressed to my name. \n\nGiven that I didn't settle into the place until 1 June, I'm thinking that's not my bill and since I didn't use any water as the place wasn't mine until 1 June. \n\nShould I just suck it up and pay it or contact the agent who I bought the place to try to get the previous owners to pay for it? \n\nThanks for your advice. ",
        "num_comments": 6,
        "comments": [
            "It should have been accounted for at settlement - an estimate would have been done for the period between the last meter reading and settlement date based on previous bills, and that amount taken off the final sum you paid.  So you’ll need to pay it, but the previous owners have already effectively paid you for that as well.  Your settlement documents should have something about it.",
            "I’ve been wondering the same thing… before settlement I got an email from my solicitor with the rates etc that I had to pay and there was a line in there that said “the water usage has been accounted for”. I queried it after settlement as there wasn’t a specific amount for water use, and asked how exactly it had been calculated, but the solicitor couldn’t give me a helpful reply. I suspect I might also get a water bill with the previous owners use that I’ll have to pay, because how the hell am I supposed to track them down and make them pay? Oh well.",
            "Thanks for explaining this. Really appreciate it!",
            "Just call the water supplier and explain. You can show documentation of settlement. No biggie. 😊",
            "Sweet. I can also show bills from previous rentals that show my mean use if they want it.",
            "In my experience that is what they term the final read for the previous occupants, I would personally challenge it with SEW even if it overlaps in terms of dates. You will find this is rather common and the final read you can negotiate with SEW \n\nworth a shot to try good luck"
        ]
    },
    "Trader": {
        "title": "Trader",
        "score": 1,
        "url": "https://www.reddit.com/r/AusPropertyChat/comments/1dr6wzc/trader/",
        "content": "Us stocks, Australian ETFs, Cryptocurrency trading strategies.\nMonthly profit exceeds 30%.\nIf there is a loss on the trade, full payment.\n\nThis is our promise. No one would dare say such a thing.\n\nInterested in private conversation",
        "num_comments": 0,
        "comments": []
    }
}