{
    "New house insulation - Buyer's remorse": {
        "title": "New house insulation - Buyer's remorse",
        "score": 33,
        "url": "https://www.reddit.com/r/AusPropertyChat/comments/1dr5jzv/new_house_insulation_buyers_remorse/",
        "content": "Hello friends, \nI purchased a 1 year old house 2 months back in one of Melbourne west suburbs.\n\nI'm feeling buyer's remorse within the 2 months, because of the terrible Insulation in the house. House is not even giving 2 degree celsius Difference from outside, even all doors, windows and blinds are down.\n\nIs this common for all new houses ? Specific to my home ?\n\nCan I contact builder for this issue ? Or Do I need to hire any for looking into this insulation issues?\n\nAny info on this is really appreciated. Thank you very much in advance.\n\nEdit :\nFor the questions regarding the heating, here is a scenario that I have testing.\n\nOutside temp Is 10C. Heated the entire house to 22C using ducted heating and turned off. Exact an hour after, the home temperature came down to 15C, that is 7C down in an hour. \n\nI was hoping that the house(which is near to new build), will take at least 2-3 hours to come down to 15C, but it's a lot quicker than expected.",
        "num_comments": 94,
        "comments": [
            "Yep pretty common in Australia.  Minimum insulation requirements for new builds are a joke.\n\nGet some quotes to get batts installed in the roof cavity.  Will make a huge difference.",
            "Our rental was built in about 2008. Recently ripped out and replaced the bathrooms because they were constantly leaking water into the floor and causing the ceiling in the room below to collapse. Turns out there was never any waterproofing installed. Went to have a look at the ripped out bathrooms - was (mildly) surprised to also find out there isn't any insulation present either. Construction industry hasn't given a shit for a while by the look of it.",
            "Grab some earthwool ceiling batts from Bunnings. Easy to on install yourself and you’ll save a ton of money on someone doing the job for you.",
            "If the house is one year old, then it was supposed to be built to a 6 star energy rating. Builders can be pretty lapse on how strictly they build to this code, but I doubt very much there is no insulation in the roof. Check the roof space it may just need some re-arranging. Also insulation does not work miracles, it merely slows down the speed at which a room heats up or cools down to match the surrounding temp. If you get multiple days with no sun and you are not running heating eventually empty rooms will get cold.",
            "Welcome to home ownership and the endless ways to improve your living. Add it to the list and keep adding to the list, then in 12 months prioritise that list and get to work.",
            "What sort of window coverings? Put up some heavier drapes",
            "My brother’s house in Ireland stays at the same temperature all year round about 20°c, in the extreme cold of winter he puts a fire on but in reality it for aesthetics. The houses are built to an ‘energy rating’ the goes from ‘A’ to ‘G’, I think his must be an A or B. It’s got double glazing. All the walls and the roof are insulated. I’ve stayed with him in the autumn, outside temperatures about 7°c with no heat on and had to open the bedroom window. It was uncomfortably warm inside. Houses here in Australia are basically thrown up. If you’ve seen the guy on Facebook who does building inspections you’ll know.",
            "Your test is not sufficient to test the house insulation. If it was 10C when you started and it had been at that temperature for a while, then the air, plasterboards, floors, etc were all sitting at 10C. When you heated the house to 22C you just heated the air. If you touched any of the walls or any other part of the internal construction then they would still be sitting at 10C. To test properly, you would need to hold the temperature at 20C for at least 6 hours before switching the heat off. This would give you a much better sense of how well the house is insulated.\n\nNot saying you don't have poor insulation, just that your methodology is flawed.",
            "Interested to know, is your home brick veneer, double brick, other? Is it raise or on a pad.  I’m in Perth where most homes are double brick, but our supposedly insulated home is the same.",
            "I was magically hoping the house we’d brought would be warmer than the rental I was in for 6 years - it’s colder (built 2008). I feel your pain"
        ]
    },
    "Who is designing and building reputable homes in Australia?": {
        "title": "Who is designing and building reputable homes in Australia?",
        "score": 27,
        "url": "https://www.reddit.com/r/AusPropertyChat/comments/1dr6e3b/who_is_designing_and_building_reputable_homes_in/",
        "content": "I've seen a lot of posts regarding poor builds and even new build buyers morse.. all of it pretty sad and no doubt infuriating for owners.  Especially in a cost of living crisis, where we all want the most bang for buck.\n\nMy question is, who out there can be trusted? Is there a union or guild that build to specific livability and environmental standards, not merely the bare minimum? Does it simply just come down to cost over ethos?",
        "num_comments": 42,
        "comments": [
            "I built with Boutique Homes a couple of years ago.  Had my own independent inspector check at each stage of completion, and they only ever found very minor issues.\n\nI haven't really found anything major to complain about, so I'm pretty happy overall.",
            "No one does anything well. We're a cynical society of money grubbing hucksters. Anyone who shows a glimmer of integrity gets marginalised instantly.",
            "Keen to see what the masses think, because my builders opinion is there's not really any large companies doing a *good* job and I would tend to agree. Materials and Labor prices make it nearly impossible for them to do a job for the prices people would be willing to pay for a *good* job. Most builders hope you don't get independent stage inspections and you don't look to close at things.",
            "I engaged a builder, he doesn’t advertise. He and his team (and some sub contractors) did a terrific job. Top quality architect designed home. Ended up selling it and fetched a great result. \n\nBut the build wasn’t cheap !",
            "Dale Alcock in Perth has a good rep",
            "What state are you in?",
            "I developed townhouses in Aberfeldie, Victoria with Arlington homes 3 years ago. Small builder but always onsite",
            "I'd use an architect. I don't know where you are but someone like Light House Architecture & Science in Canberra could be ideal. Look them up, they often have useful links or might be able to suggest someone local to you.",
            "I mean if you want it done properly, engage a trust worthy architect…",
            "If you pay peanuts, you get monkeys.\n\nThe same applies to building homes. It costs money. if you want good quality, then be prepared to pay $$ for it. Good builders are tough to get, they are very very choosey.  I doubt very much people will genuinely reveal their choice builders and contractors on reddit, without good compensation."
        ]
    },
    "Solid brick wall lines?": {
        "title": "Solid brick wall lines?",
        "score": 7,
        "url": "https://i.redd.it/0fk6h5yt8h9d1.png",
        "content": "Hey guys,\nWhat do you think is causing these lines? It's a solid brick wall in the living room. The unit building is 10 years old.\n Lines are not random, they are in equal increments vertically. Builder mate said if this was gyprock it could be a joining issue but the wall is brick so what is it? ",
        "num_comments": 7,
        "comments": [
            "it's called gypsum and popular method for soundproofing and some would say it insulates the room better",
            "What’s the spacing?\n\nEvery 40, 45, or 60cm would indicate there’s framing between the plasterboard and brick and there’s some condensation issues, while every 90 or 120cm would indicate they dun goofed with the installation of the plasterboard.",
            "Or done the wall sheets horizontal like they usually do 🤷",
            "Is it a brick wall that’s been sheeted?\nLooks exactly like joins in gyprock sheets",
            "Plaster join lines?\nYes the wall is brick behind, but there's plaster infront of it?",
            "If it's a solid brick wall why wouldn't they use plaster, like all sane builders and avoid sheets and joins. Also plaster insulated better and doesn't come off after a few years. Scrap the gyprock and get a plasterer and plaster the wall properly i would say.",
            "This isnt a solely solid brick wall, otherwise you would be seeing bricks. It clearly has either gyprock or plaster on it. \n\nAs per the other commenter, its the joint line, you can tell by the distance they are spaced aligns with the size of gyprock panels. \n\nThis can be avoided if they gyprocker was better at their job, should have put thin framing between."
        ]
    },
    "Real estate agent breach of private": {
        "title": "Real estate agent breach of private",
        "score": 2,
        "url": "https://www.reddit.com/r/AusPropertyChat/comments/1drcm32/real_estate_agent_breach_of_private/",
        "content": "I was wondering if anyone could shed some light on this for me. I recently purchased a property with my husband. Unfortunately I have some estranged family members and ultimately I chose to withhold our property purchase news from them. Anyhow, I have found out that the real estate agent who sold us the property 'ran into' one of these family members and disclosed our purchase to them. I was wondering what the legalities of this breach of privacy are, if any at all?",
        "num_comments": 1,
        "comments": [
            "Unless the agent signed an NDA, and we know, they didn't, then none.\n\nPretty wild coincidence that the agent knew your family member and knew that they're your family member."
        ]
    },
    "Feedback on negotiating ": {
        "title": "Feedback on negotiating ",
        "score": 4,
        "url": "https://www.reddit.com/r/AusPropertyChat/comments/1dr7geh/feedback_on_negotiating/",
        "content": "We are FHB so we have training wheels on\n\nWe have said that we won’t be emotional about any of the houses we make an offer on… But that is way easier said than done . \n\nMy heart is absolutely set on a house and I can see us living in it.\n\nA week ago, we made an official offer - 1.42m \n\nRea said it was a really good offer and sent it to the vendor. They said the vendor had unrealistic expectations of 1.5 to 1.6m but would work on them\n\nA few days later, they came back and said they’ve got the vendor down to 1.45m\n\nYesterday we sent a final offer 1.43m\n\nREA texted this morning before their last open home and said our offer was sent to the vendor\n\nI’m scared someone’s going to come along and take it. I know there’s other properties out there, but it is slim pickings at the moment and this is a solid house. \n\nDo you think we are negotiating the right way? Assuming they haven’t come back to us today to accept it because they want to see what comes of the open home today? Plus, I’m guessing contracts don’t really get signed on the weekend.\n\nAny advice appreciated x \n",
        "num_comments": 16,
        "comments": [
            "Did you put a time limit on your offer? If not, they are likely to wait until Monday (at least) to see if anyone else offers.\n\nBtw I think your negotiation tactic is all good, just put a time limit on the offers and be ready to move on. That way the vendor has something to lose if they wait for potential offers from the open.",
            "Just came here to say that even though I’m not sure if this is common practice, we’ve definitely had a contract signed over the weekend! We sent our offer on a Saturday morning and got a signed contract by 6pm :)",
            "Umm you love the house...can u afford 1.45 million, youre afraid of losing it, theyve reduced their expectations and given u a figure to close. Offer 1.45 and be done with it. Its a long term investment anyway. Anything less and youll need to accept youre taking the risk of losing it over what 5 to 10k. Why arent u offering 1.45 is the Q id ask, unless its above u r budget?",
            "You’ve done well.  Good luck. \nThey will wait to see what shakes out after the open home before you hear back.",
            "You are going the right way about it.  I would probably not have given them until Monday because others can pop into the mix.  On a side note you have offered $1,430,000 an increase of $10,000 on your initial offer.  The vendors have come down between $55 - 100k in their expectations, so psychologically they probably feel like they’ve given away a lot more than your increased offer.  I believe that if the vendor got another bid then the REA would probably get back to you unless you said final offer no discussion.  I bought a house last year because the other people offered the same amount saying “no further offer” and i gave a shorter settlement period.  Also, if you really love this home and it is one you want to live in, then it is a lifestyle choice first and investment second.  If needed, I’d be ready to pay the extra $20k because it is a minuscule percentage in comparison to the total price and if you can by with your head and your heart you will love your new home.  Fingers crossed you get it.  I have a friend did the same thing today…the waiting is anxiety inducing! PS Lots of contracts are signed on weekends - busy time!",
            "We said COB Monday was the expiry \n\nI was hoping they’d accept the friggen offer today haha ugh",
            "Damn! Haha. Yeah i think theyre hoping for a bit more. Well, hopefully the REA let us know if they get a higher offer",
            "This is what im thinking tonight. Should we have closed it at 1.45. Maybe we should have. Will see what happens monday. Hoping noone closes a deal with them this weekend",
            "Literally holding our breath and trying not to think about it and act unbothered! Haha thank you :)",
            "Ah, yeah. They'll wait until Monday afternoon. I would do the same to be honest.\n\nAll the best!"
        ]
    }
}