{
    "[no-politics] What's happening this weekend? 29/Jun/2024": {
        "title": "[no-politics] What's happening this weekend? 29/Jun/2024",
        "score": 0,
        "url": "https://www.reddit.com/r/australia/comments/1dqlofk/nopolitics_whats_happening_this_weekend_29jun2024/",
        "content": "Now we're done with the Friday venting, what's good in life? Got a new job? Have a date? Going out to a socially distanced restaurant? Climbing, sailing, riding or just working up a hard-earned thirst?",
        "num_comments": 7,
        "comments": [
            "This post has been marked as non-political. Please respect this by keeping the discussion on topic, and devoid of any political material. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/australia) if you have any questions or concerns.*",
            "I'm sitting at home listening to Hootie and the Blowfish, Let Her Cry. And it takes me back to the time I spent in Melbourne as an 18 year old with my girlfriend, staying in a hostel, and we lay in each other's arms as some guy with a guitar played this song and sung it with all his heart into the common area. The sun was bright, we were young and in love, the air felt warm, life had never tasted so good.",
            "Im sitting around at home and can't sleep. Woo hoo! Chats?.. Adelaide guy, 40",
            "Hello, just looking in this thread for anyone keen for a chat? You're the only person that commented here!",
            "Sure mate, though I'm not the best conversation partner, and not right now because I'm going to bed! I think my DMs are open :)",
            "I'm meeting up with some friends for lunch and we're going to a free art exhibit that looks creepy and cool! It's called Not Natural at Science Gallery Melbourne and closes on Saturday so we're hoping to just squeak in. :) If that sounds interesting but you can't make it, you can view a lot of the art pieces online here: [https://melbourne.sciencegallery.com/not-natural](https://melbourne.sciencegallery.com/not-natural)"
        ]
    },
    "Traffic Controller Question QLD": {
        "title": "Traffic Controller Question QLD",
        "score": 1175,
        "url": "https://i.redd.it/jf5rltoa6f9d1.jpeg",
        "content": "",
        "num_comments": 140,
        "comments": [
            "To be fair to them, if you fuck this one up then you're definitely not suited for the job.\n\nLike an automatic DQ",
            "Strikes me as being for someone freshly off the plane on a temporary work visa from a very non-English speaking background. \n\nSurely. Maybe.",
            "This is a subtle English test.",
            "Finally, a test I can pass ",
            "Such a dumb question. I failed on this one and they made me pay another fee to resit the test. \n\nI do highway traffic control, I would never need to know what a forklift looks like anyway, theyre not allowed to drive on the highway.",
            "these things aren't to protect you, the worker. they're so that if/when you are injured on the job, your employer can tell workcover/insurers 'hey, they received the approved safety training, it's not on us!'",
            "if you can pass a capcha, you can hold a sign",
            "Person Woman Man Camera TV.",
            "If you ever told your trainee to go get his PPE and he came back wearing a forklift. This is why they ask.",
            "All three could be a Hard Hat with the right attitude, strength and technique"
        ]
    },
    "A billionaire tax would raise $380 billion a year and make our tax systems fairer, report says": {
        "title": "A billionaire tax would raise $380 billion a year and make our tax systems fairer, report says",
        "score": 1123,
        "url": "https://www.reddit.com/gallery/1dr0ox1",
        "content": "https://www.abc.net.au/news/2024-06-27/tax-billionaires-minimum-tax-2-per-cent-gabriel-zucman-g20/104023796",
        "num_comments": 299,
        "comments": [
            "Trickle down economics is the biggest fucking lie pushed by Thatcherites since Thatcher herself pushed it.\n\nIt amazes me that people still seriously believe it is relevant, or worse, that it works.",
            "Not to mention if oil and gas companies actually paid their taxes.\n\nIt seems the ATO cracks down more on single-mothers with 3 children rather than multi-national oil/gas corporations",
            "Just fucking tax resource extraction properly. Jesus fucking christ. It's not that hard.",
            "The French invented a great gravity-powered taxing machine for this",
            "But the people sent to make the laws are bought and paid for by the same billionaires who fight tooth and nail to keep the money and refuse to pay their fair share of taxes.",
            "This is the global figure.  $380&#8239;B sounds huge but it isn't that much spread over every country, or even over all the wealthy countries.",
            "It's amazing how covid made them so much wealth",
            "Won't the billionaires just use other countries for their tax evading? I keep hearing about various islands in the movies.",
            "There are 141 billionaires in Australia. How are they going to manage to cough up $380b a year..?",
            "You need rising wages to match the previous inflation and for inflation to level off. These are not things achieved through taxation. Taxation simply redistributes wealth and is anti productive capacity unless the government actually is investing in supply side infrastructure. However SOE are not in vogueand the AU government is spending like crazy on its NDIS scheme while permanently raising welfare payments"
        ]
    },
    "Three people left unconscious in Sydney's west after inhaling carbon monoxide from BBQ used as indoor heater": {
        "title": "Three people left unconscious in Sydney's west after inhaling carbon monoxide from BBQ used as indoor heater",
        "score": 608,
        "url": "https://www.abc.net.au/news/2024-06-29/sydney-family-use-bbq-as-indoor-heater-inhale-carbon-monoxide/104039702",
        "content": "",
        "num_comments": 182,
        "comments": [
            "Just leave the gas oven on like the rest of us",
            "Yeah, a fire indoors without a chimney isn't really a good idea.",
            "That is so bloody sad that people have beenforced to resort to this to keep warm because of cost of living. ",
            "Please don't do this, if you want cheap and abundant heating use a diesel heater which is designed to exaust hot air indoors and exhaust outdoors. It will also be far cheaper in fuel to run.",
            "Imagine a developed country having housing standards at least at good as some developing countries that endure winters with negative temperatures.",
            "I think using the word inhaling here gives the implication they were trying to sniff it or something. But no, they used charcoal to use as indoor heating.",
            "Shows how fucked we are, country produces abundance gas, but people resort to this to keep warm.",
            "There was one in Adelaide a few years back. Apparently the guy had a tandoor oven in the back seat of his car!",
            "This feels like desperation. \n\nAnd also a cry to invest more money into public education.",
            "Damn crazy liquor cheeseburger barbecue party."
        ]
    },
    "Authorities investigate claims Perth restaurant gave children citronella liquid, not cranberry juice": {
        "title": "Authorities investigate claims Perth restaurant gave children citronella liquid, not cranberry juice",
        "score": 132,
        "url": "https://www.abc.net.au/news/2024-06-29/family-claims-perth-restaurant-gave-kids-insect-repellent/104039950",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Why are they storing non-food (let alone poisons) in the fridge? This is exactly why you don't do that.",
            "They don't need to worry about getting bitten by mosquitoes",
            "Wonder what restaurant it was.",
            "back in my day we drank our lamp oil and we liked it! little brats",
            "Another slap on the wrist with a wet lettuce coming. This is WA after all.",
            "In other news: animal rights groups are investigating a Perth restaurant that served local mozzies cranberry juice.",
            "The only main symptom was was coughing up bucket loads of mozzies..",
            "Food safety programs, the FSANZ, the HACCP program AND food  handlers certification all have sections on the safe storage Of chemicals in relation to food. This is astounding",
            "Gotta keep the oil cold so it doesn't catch fire",
            "The West has named them online"
        ]
    }
}