{
    "Weekly Real Estate / Renting / Where to Live / Utilities / Schools (ISD) Post": {
        "title": "Weekly Real Estate / Renting / Where to Live / Utilities / Schools (ISD) Post",
        "score": 5,
        "url": "https://www.reddit.com/r/Austin/comments/1do49dv/weekly_real_estate_renting_where_to_live/",
        "content": "This will become a weekly Thursday post for question/answers regarding properties in Austin or surrounding areas. Feel free to use this post to:\n\n* Ask where to live\n* What neighborhood is right for you\n* Advice on apartments / asking about specific apartment reviews\n* General thoughts/views on the housing market\n* Questions about real estate prices/going up/general home buying advice\n* Advice on realtors\n* General property questions rants/complaints about pricing\n* \"Is this neighborhood safe\" questions / crime related questions\n* Tax / Mortgage related questions\n* Questions on developments / bidding processes\n* Have a place to rent / looking for a roommate\n* Commute times from specific locations\n* General housing repair questions / upgrade questions / solar / etc\n* Questions regarding contractors for housing repairs, upgrades\n* Memes regarding housing\n* How specific schools are in an area / general school questions\n* Questions regarding utilities\n* Questions regarding apartment services\n\nOver the last year, we have seen a major uptick in prices in the area, along with a steady flow of new people coming into Austin. Use this weekly post to ask your questions, try to get advice, etc on an upcoming move or questions about real estate in Austin.\n\nMany apartment questions have always been removed on here, and we always suggest people to contact an apartment locator. Those rules still stand. But, you are welcome to ask those questions on here if you still feel the need for it.\n\nAlong with that, any new open ended question on Austin properties and real estate will be removed and asked to move to here (based on mod discretion).  Many of the questions being asked have been asked many times before, which is why we would rather compile these posts into one place for people to ask and get their answers.\n\nIf you are having issues as a tenant in Austin, we highly recommend reaching out to the Austin Tenants Council here: [https://www.housing-rights.org/](https://www.housing-rights.org/). They may be able to help you resolve issues related to renting property in Austin.\n\nWe also recommend searching older \"Weekly Real Estate\" posts as well, to find answers on previous week's questions.\n\nAs always, there is a whole section on moving to Austin in our FAQ page:\n\n[https://www.reddit.com/r/Austin/wiki/movingtoaustin](https://www.reddit.com/r/Austin/wiki/movingtoaustin)",
        "num_comments": 61,
        "comments": [
            "Realtor recommendations? Please and thank you!",
            "Any suggestions on furnished housing for 2-3 months? Maybe corporate housing companies that place travel nurrses?",
            "Researching potentially renting a SFH in Cedar Park area in the future. Any big differences between the various neighborhoods? I see Anderson Mills, Buttercup Creek, Cypress Mill, Block House Creek, Avery Ranch, etc. \n\nTrying to avoid crime and flooding. No kids for school zones.",
            "Landlord-tenant lawyer that works on contingency recommendations are welcome :-)",
            "Thinking of moving to the Windsor park area. I looked up the neighborhood but most forums are from 8+ years ago with the general consensus that there is high crime and break ins. Is this still true today? What's the general vibe here? Lots of the houses don't have garages so I am worried about my car getting broken in. Would love any feed back!\n\nGF and I are considering moving to Austin. Looking to rent in neighborhoods that are walkable, easy access to downtown, and safe.",
            "I live up in Leander with my parents but I really love the vibe of soco, want to move closer to downtown and found Windsor soco apartments. I'm a 23 year old female. What's this area like safety-wise? What's usually the age demographic of people living in this area? any input is appreciated! thank you :)",
            "Hello, Ive narrowed down my search to 704 vs Pearl Lantana for 2bed 2bath apartments. What are your thoughts about these apartments and which ones would you recommend?",
            "Has anyone here built with Tri Pointe homes? Looking for reviews positive and negative. I'm interested, but I'm not sure if it's better to work with their in-house lender or not. How well is the quality of their homes?  What would change about your build if you could? Is the hoa worth it for the amenities?",
            "Visiting Austin for long weekend in early fall. Is South Congress the place to stay? We like eating and a drink but not necessarily night life. We will have a car. Walkable areas are a plus though\nWould prefer a hotel over airbnb. What do you suggest?",
            "Im an apartment locator, feel free to AMA on any apartment complexes or send me a DM if you are looking for something!"
        ]
    },
    "Stuff To Do In Austin - Week of 06/24": {
        "title": "Stuff To Do In Austin - Week of 06/24",
        "score": 6,
        "url": "https://www.reddit.com/r/Austin/comments/1dn5kjj/stuff_to_do_in_austin_week_of_0624/",
        "content": "What's going on in our great city?\n\nList cool events, concerts, parties, or secret beach orgies. \n\nInclude description, time, cost, location and website if applicable.\n\nIf you submit a band's show, please include their genre and one or two examples of their songs.\n\nEvent Sites:\n\n* Austin Visitor Center [Calendar](https://www.austintexas.org/events/)\n* Do512: [This week](http://do512.com/events/week)\n* Austin Chronicle [Live Music Calendar](https://www.austinchronicle.com/events/music/2024-05-18/) and also [Recommended Events](http://austinchronicle.com/calendar)\n* Check out r/austinmusic for show posts by local bands\n* Culture Map: [Next 7 days](http://austin.culturemap.com/events/) \n* Austin360: [Today and beyond](http://thingstodo.austin360.com/events?page=1) \n* Ballin' On A Budget ATX: [Food and booze](https://www.facebook.com/BallerATX)  \n* Free Fun in Austin: [Local adventures for families](https://austin.com/category/free-fun-in-austin/)\n* Local brewers' taprooms: [Booze](http://www.craftbeeraustin.com/texas-brewery-brewpub-tour-listings-map/)  \n* NowPlayingAustin: [Arts and Culture](http://www.nowplayingaustin.com/)\n* Everfest: [Various](https://www.everfest.com/texas/austin-festivals)\n* Fitness Events: [Austin Sports and Social](https://www.austinssc.com/?query&sort=league_start_datetime&dir=asc#upcoming-leagues) usually has something starting soon, or try [East side beer runners](https://www.instagram.com/esbrunnersatx/) or [Social Cycling Austin](https://www.socialcyclingaustin.bike/bike-rides/) or [Ride Bikes Austin](https://www.instagram.com/ridebikesaustin/) who all have weekly events.\n\n---\n\nPlease comment below with the event you'd like to highlight this week! Want something to be considered for the recurring list? [Message the moderators](http://www.reddit.com/message/compose/?to=/r/Austin&amp;subject=Weekly stuff to do thread)",
        "num_comments": 16,
        "comments": [
            "Secret beach orgies makes this seem predatory and creepy.",
            "I \\*might\\* be able to make this! Fingers crossed...",
            "Anything cool happen on Sunday?",
            "Check out my friend's dating events around Austin. The company is called Endgame and they are legit. Their events are for professionals, techies & creatives looking for their person. Find a husband or wife lol. But for real. They're having an event this Wednesday night in Downtown. I think it's called the Summer Singles Party. Here's the link:[https://www.eventbrite.com/e/not-your-average-dating-event-summer-singles-party-comedy-show-tickets-923403914967](https://www.eventbrite.com/e/not-your-average-dating-event-summer-singles-party-comedy-show-tickets-923403914967)",
            "[Thursday Night Social Ride](https://sweatpals.com/thursday-night-social-ride-c96/2024-06-27) by my favorite cycling group!!",
            "Weekly social club meetup up in Leander!\n\n[https://www.reddit.com/r/Leander/comments/1dptx9x/leander\\_social\\_meetup\\_5th\\_element\\_brewery\\_06282024/](https://www.reddit.com/r/Leander/comments/1dptx9x/leander_social_meetup_5th_element_brewery_06282024/)",
            "Womens Flat Track Roller Derby Regionals is happening this weekend 28-30 June https://www.texasrollergirls.org/regionals/",
            "here are [some events](https://whatsgoodatx.com/?date=2024-06-30&q=weird) for Sunday! I'll update the post with my pick as well.",
            "**SAILOR MOON PARTY** at the **Ruiz Branch Library** \n\n*Friday, 6/28/24, 7-9PM*\n\nCrafts, snacks, and boba while supplies last. Teens and adults welcome. [More info here](https://www.eventbrite.com/e/932619388697/) (tickets are not required!)",
            "Singles over 50 event. Free event\n\nFriday 28 June 6h30 pm\n\nI have seen questions about where to meet singles over 50. This meetup is thriving. The next event is at LImestone rooftop, 68 East West Street and starts at 6h30 pm.\n\nSip, Socialize and Sparkling conversation: LIMESTONE Edition [https://meetu.ps/e/Nd31f/zgZYD/i](https://meetu.ps/e/Nd31f/zgZYD/i)"
        ]
    },
    "My usual HEB is Riverside but I’m at Westlake today. How come rich people get plastic bags?": {
        "title": "My usual HEB is Riverside but I’m at Westlake today. How come rich people get plastic bags?",
        "score": 376,
        "url": "https://i.redd.it/xebqr3d3se9d1.jpeg",
        "content": "",
        "num_comments": 325,
        "comments": [
            "West Lake Hills isnt technically in Austin.\n\nEdit: to add context. The reason H-E-B in Austin doesnt have bags is because of the plastic bag ban that was passed in 2014 (?). It eventually was overturned by the TX Supreme Court, but after it was overturned HEB never brought back bags to the stores that theyd taken them out of.",
            " Because its not in Austin - this HEB is in the town of West Lake Hills",
            " Riverside not having the handcarts is the more offensive problem. But yeah, Id also expect them to be all stolen within like a day",
            "I don't get what you mean? We get them in Tech Ridge, too. It's super efficient. My curbside shoppers put one item per bag, then usually put 2 or 3 of those bags inside another bag. \n\nI make kites out of them and take them to Zilker on the weekends, they look really pretty in the trees.",
            "No plastic in Oak Hill but definitely in Bee Caves HEBs.",
            "Outside of Austin.\n\nIf you go to the HEB in Pfluggerville you also get all the plastic bags you'd like...",
            "Westlake Hills has its own city limits.  Austin had this ordinance and HEBs within Austin city limits kept the practice.  It has nothing to do with wealth.",
            "Because they arent in Austin. Westlake doesnt have a bag ban because its unconfirmed rich folks. Gov Abbott actually banned bag bans so technically there is no longer a bag ban in Austin which is why Walmart and Target use plastic bags. HEB being a good citizen decided to continue to voluntarily honor the bag ban in Austin",
            "That HEB is one of my least favorite ones.  Still smells like the old Albertsons it used to be.",
            "OP you should just be \"rich\" if you got such a huge problem with it "
        ]
    },
    "Not entirely sure what I just witnessed…": {
        "title": "Not entirely sure what I just witnessed…",
        "score": 927,
        "url": "https://www.reddit.com/r/Austin/comments/1dqqg9y/not_entirely_sure_what_i_just_witnessed/",
        "content": "There is an individual in a sexy grackle costume near The LINE Hotel.\n\nThey are wearing a matching lace bra and panty set over a Hollywood-grade costume.\n\nThe bird was eating french fries and smoking a cigarette while  6-8 people dressed up as nerdy birdwatchers snapped pictures.\n\nObv filming something…but what?!\n\nEdit: I didn’t have my phone but I did take two pictures with a disposable camera that I’ll upload once I develop them. \n\n\n\n",
        "num_comments": 131,
        "comments": [
            "how dare you make this post without a pic",
            "Moira Rose The Crows Have Eyes 3",
            "The only thing that could be more Austin at that corner would be if the grackle mascot had its' tits out with a political message written on them for drivers on Cesar Chavez to read.",
            "Someone should dress up like a sexy tennis ball and head down there.",
            "Another day in Austin.  Nothing to see here folks",
            "Wait!!! A grackle escaped the HeB parking lot? \nTheyve strayed too far.",
            "Was that grackle eating....MAYO on their fries?! OBV filming a mayo commercial.",
            "My question is why has u/Snap_Grackle_Pop been *conspicuously absent* from commenting on any postings this morning?",
            "Sexy grackle is redundantly redundant.",
            "Just another day.  I drove home to my burb last week and two people in gold unitards were waving gold flags on top of a construction dirt pile."
        ]
    },
    "Something Austin had 10 years ago that we want back.": {
        "title": "Something Austin had 10 years ago that we want back.",
        "score": 339,
        "url": "https://www.reddit.com/r/Austin/comments/1dqwmua/something_austin_had_10_years_ago_that_we_want/",
        "content": "It's changed a lot in the last 20 years around here. But think back just 10 years ago, what's something we lost that we need back. I want to say affordable housing but that was probably 15 years ago! So I'll go with SHADY GROVE. RIP.",
        "num_comments": 929,
        "comments": [
            "magnolia being open 24 hours",
            "Hut's, Frank & Angie's, Threadgill's",
            "Austin Music Hall qnd La Zona Rosa",
            "I might be old, but I miss Hut's Hamburgers.",
            "Milto's! To this day I miss their spinach pie and Greek salad dressing so hard!",
            "When the owl was the most prominent building in the downtown skyline as you drove past at night on 35.",
            "Vulcan Video and rental culture in general",
            "Alamo Ritz, especially music Monday, terror Tuesday, and weird Wednesday.",
            "$10 Whole chicken meal at El Pollo Regio",
            "Flipnotics! Loved that fish tank in the old tv set"
        ]
    }
}