{
    "Things You Might Not Know About How Reddit Works": {
        "title": "Things You Might Not Know About How Reddit Works",
        "score": 102,
        "url": "https://www.reddit.com/r/AutismInWomen/comments/1b0lbwl/things_you_might_not_know_about_how_reddit_works/",
        "content": "It has come to our attention that outside of the basics (voting, how to report, posting/commenting), many people are still in the dark as to how exactly Reddit works regarding moderation and Admins.\n\nFirstly, moderators, like us, only have power (a limited scope at that) and jurisdiction over the subreddits we mod and what happens on them. We cannot do anything about what happens outside of here. We don’t have a direct line of access to Reddit Admins, who control and oversee the site as a whole. In fact, we can only do the same things y’all can do in trying to get their attention on things: report it and wait. We, like you, often don’t get responses from admins regarding their decisions or even if they have viewed any reports we send in. We are the same in that capacity. Subreddit bans only prevent people from posting and commenting on the subreddit they were banned in for however long the ban is for. You can still vote in and view subreddits you are banned in. We can’t even see who reports what.\n\nAdmins are like gods of Reddit. They oversee all; they can see who votes what, who views what, who reports what, everything. They can suspend people from the website as a whole which prohibits someone from posting, commenting, and even voting on the entirety of Reddit for however long said suspension lasts. They can even suspend specific IP addresses from users who keep making accounts and breaking Reddit sitewide rules.\n\nHere’s an analogy: Reddit Admins are the Roman Gods and we moderators are like members of the Roman Senate or mayors of towns. Members of the Roman Senate don’t have a direct link or direct way to communicate to the Roman Gods; they have to make offerings and prayers just like everyone else to try to catch their attention. It’s the same here. All we mods can do is make reports just like you all and hope someone looks at it. We can do nothing about what happens to you outside of Rome (the subreddit). That’s up to the admins.\n\nWe are also bound by the Reddit Mod Code of Conduct as well to nip any activity that breaks, or could be interpreted as breaking, Reddit Content Policy in the bud. Due to this subreddit having been previously in trouble with admins because of the founder not doing these things and getting booted and admin putting us 3 in place as new mods over a year ago with the express statement of “we will be watching you closely”, we really don’t take any chances when it comes to people breaking Content Policy. We just can’t risk it because that means we could be actioned and the subreddit could be sanctioned or shut down. We prioritize the community as a whole over any personal feelings we or others might have; that’s just how it has to work for this community to thrive and survive.\n\nThe proper course of action for when something happens to you or you see something that breaks sitewide rules (also referred to as Content Policy) is to report it to the admins via [www.reddit.com/report](http://www.reddit.com/report) and wait. Trying to call others out publicly technically breaks Reddit Content Policy under the harassment rule no matter the reason, and like we said above, we can’t allow it due to the ramifications it can have on the subreddit as a whole even if we personally agree what happened was messed up and the other person should be held accountable in some way.\n\nMoreover, do not create or use an alt account to participate in a subreddit you have been banned in on another account. Reddit tracks this and views it as ban evasion which is prohibited as it is community interference (you were banned which means they don’t want you participating there for whatever reason is outlined in your ban message). You should contact the mods on the account you were banned on to see if you can get unbanned by demonstrating accountability and understanding of how you broke the rules and a willingness to follow the rules. \n\n\\---- Relevant Links ----\n\nContent Policy: [https://www.redditinc.com/policies/content-policy](https://www.redditinc.com/policies/content-policy)\n\nWhat even IS brigading?: [https://www.reddit.com/r/ModSupport/comments/cmp9uy/comment/ew4lpf0/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/ModSupport/comments/cmp9uy/comment/ew4lpf0/?utm_source=share&utm_medium=web2x&context=3)\n\nMod Code of Conduct, so you all are aware of the rules we as mods have to follow as well: [https://www.redditinc.com/policies/moderator-code-of-conduct](https://www.redditinc.com/policies/moderator-code-of-conduct)\n\nRedditor Help Center for any further questions: [https://support.reddithelp.com/hc/en-us/p/redditor\\_help\\_center](https://support.reddithelp.com/hc/en-us/p/redditor_help_center)\n\n\\--- Personal Note ---\n\nThis post is locked because I have classes and am pretty busy irl except on weekends, I know I won’t have the spoons to answer questions personally, and tbh sometimes notifications really overwhelm me when I’m already stressed out which is why I provided the links /gen. This post was made in response to the subreddit growing and us becoming more aware of the fact many people do not know these things and just assume moderators are also Admins of Reddit as a whole or have way more power than we actually do. We don’t. In the eyes of Admin, we are basically volunteer clean-up crew and are the same level of importance as a regular user on Reddit. We don’t get paid, we don’t get any extra benefits or anything either (as it should be imo, mod out of love for the community not because of anything else). Admins are employees of Reddit that get paid for working and only work on the clock then go do whatever they want off it. We moderate on and off all day; in between our actual jobs, chores, and life responsibilities. I hope this helps clear some things up for anyone confused as to what the differences are between mods and Admins and provides people with a way to research more about how Reddit works on their own as well. ♥\n\nEdit because I forgot: If you do have any questions or anything you're still confused about please modmail us via the \"message the mods\" button on the sidebar and someone will answer it when they can ♥",
        "num_comments": 0,
        "comments": []
    },
    "This Subreddit is for People With Autism that are Not Cis Men and is Trans Inclusive ": {
        "title": "This Subreddit is for People With Autism that are Not Cis Men and is Trans Inclusive ",
        "score": 1024,
        "url": "https://www.reddit.com/r/AutismInWomen/comments/1dp2pjw/this_subreddit_is_for_people_with_autism_that_are/",
        "content": "[LONG POST SORRY] \n\nI’m not sure when this started, but there seems to be some confusion about the views of this subreddit. Trans women are women. They are obviously not *just* allowed but **welcome** to be here and participate here. “AFAB” is a blanket term used because even if someone doesn’t currently identify as a woman, they are still not a cis man and likely have gone through things specific to being autistic but not an autistic cis man; as we all know autistic cis men tend to be treated differently than women with autism, genderqueer people with autism, trans people with autism, etc. This subreddit is for **people with autism that are not cis men** aka women (both trans and cis), anyone Assigned Female at Birth, intersex people (intersex means a person born with both male and female sexual characteristics), etc. This list is in no particular order and is not all encompassing. \n\nThings are not as black and white as “if you use AGAB terminology you’re excluding trans women and are saying that they are less valid and that everything boils down to biology”. That is not what we were ever saying or meant to say and I’m sorry if anyone thought that. The terminology used is only used to say “everyone that isn’t a cis man is welcome here” but perhaps we should change the subreddit description to say that. (Edit: I changed it) \n\nIMO, the divide between “male” autism and “female” autism is kind of bogus. Autism is autism and it presents in a variety of ways. The presentation may change based on how you were raised and socialized as a child, but idk if sex plays a role in it at all outside of hormones and societal norms. \n\nFor example, I myself have been described as having “more traditionally male autism”. My reaction to that was to ask “wtf is ‘male’ autism it’s just autism” and was told that because I’m not as good at masking and have more trouble socializing with others I have more “male” autism. I didn’t say anything after that and just let the person that diagnosed me ramble on while thinking about how bullshit that sounded. Apparently being less able to mask, having more difficulties socializing, and having higher support needs makes me have “male” autism in the eyes of medical professionals. \n\nBut I digress. Personal anecdote aside, **this subreddit is for everyone with autism that is not a cis man**. People are allowed to use AGAB terminology for themselves but are not allowed to use it to exclude others. I’m sorry if anyone felt excluded but literally none of us mods knew because no one brought it up to us in modmail and we do have lives and responsibilities outside of the internet as well as our own struggles going on that can keep us offline for longer periods of time. Please have some empathy and understanding for your fellow autists and do not expect perfection or people to know what you know just implicitly. Some of us have to be told things to know them and don’t understand without it being explained to us. Like me. You need to explain things to me before accusing me of something I don’t even understand. \n\nI’m sorry if this doesn’t make much sense. I’m trying to work on my communication better but as many people here will relate to, there seems to be a disconnect between what’s in my brain and what I can get out either verbally or through text. I only mean this post to be sincere in tone but I do admit I am tired of seeing false assumptions about this subreddit elsewhere on Reddit and this one is the one that kills me the most since I myself am not cisgender I identify as autigender (gender identity shaped through the lense of autism link: https://stimpunks.org/2022/09/25/autigender-and-neuroqueer-two-words-on-the-relationship-between-autism-and-gender-that-fit-me/) which is under the NB/trans umbrella. \n\nIf anyone is curious or confused or just has questions or comments or concerns I’ll answer as I can in the comments but I only ask that you ask me clarifying questions before making assumptions and please do not just assume I know something. I am very open to education and correction as long as it is done in a non-attacking manner. My main goal here is to better myself so I can better moderate this subreddit to be as welcoming and inclusive as possible to non-cis men with autism regardless of their gender identity or sexual orientation. \n\nSending positive energy to anyone that has read this and much love to the community we have here /gen ♥︎\n\nEdit: Locking this post now as I don’t really have the mental energy or full cognitive capacity to reply to comments anymore I hope you all can understand that and thank you for the valuable discussion and information. If you have any book recommendations or helpful things like that you can make a post about it as I think it would be valuable to all. For conversations that were abruptly cut short I’m sorry. But again, thank you all for the valuable feedback ♥︎ /gen",
        "num_comments": 110,
        "comments": [
            "An aside: I recently heard of describing the (granted, still oversimplified) 2 categories as chameleon and ~~~lizard~~~ iguana autism. I find it cute and agendered.",
            "In a book I was reading is pointed out that what we often view as female autism can also often be seen in cis men from marginalized groups. So for instance a black man might be able to relate to masked autistic characteristics and also have to code switch on top of that. That being said, its important for cis and trans women from all backgrounds, as well as gender nonconforming folks to have safe spaces, and those who follow intersectional feminism have a long history of providing those inclusive spaces.",
            "Afab Nonbinary autistic reporting in. Don't forget (not you op, you're good) that not everything is binary",
            "And to the handful of cis men I keep running into on this sub, you're creepy, please stop.",
            "This is just a grammar nitpick, nothing about the content, but the current phrasing \"centered around non-cis men with autism\" does grammatically read as \"centered around men (who are non-cis) with autism.\" I think the easiest change would be \"those other than cis men\" or something similar, but there's probably other better ways to phrase it that the mods will land on after discussing amongst themselves.",
            "I'm old (no, really) and confused with all the genders and (non) binary stuff. All I want to say is: if you think you belong here, you're more than welcome: \"One of us! One of us!\"",
            "Yeah, I've (afab nonbinary) been coming here for a little while now, and you've all been very welcoming. This has mostly felt like a safe space. Some posts I don't relate to, but there are things that I do, and that's when I feel free to engage, otherwise, I just mind my business. The \"girl gamers\" subreddit is another space I visit and sometimes relate to. It's because as afab and trans people, we share some lived experiences that amab cis men don't. Point is, we're all human and all share some lived experiences, but gendered socialisation and external perceptions of us do play a huge role in how we experience life as well.",
            "Thank you for making this post! I am a trans woman and I have felt very welcome here but I know posts like this help others who are new or maybe are just unsure if they belong also feel welcome. I have seen posts and comments here that seem to exclude trans women but very few, definitely in a small minority of the content that is here. Overwhelming this subreddit has proven to be trans inclusive and I'm so glad it is staying that way",
            "This should be pinned to avoid people making posts where they ask if theyre allowed here every week ^ ^",
            "Thanks for making it clear to anyone who doesn't want us here! <3"
        ]
    },
    "I'm so SICK of the pass society gives autistic men": {
        "title": "I'm so SICK of the pass society gives autistic men",
        "score": 490,
        "url": "https://www.reddit.com/r/AutismInWomen/comments/1dr3ggp/im_so_sick_of_the_pass_society_gives_autistic_men/",
        "content": "Tw: abuse\n\nI feel like every time I dare to post that my undiagnosed autistic father (literally everyone who has ever met him thinks he's autistic. His personality is Sheldon with a really bad temper) is abusive, I inevitably get comments saying \"well he can't help it\" and \"you should accept him how he is\". No the fuck I should not! While his mental illnesses may not entirely be his fault, it was and is his responsibility to do something about it. He has had access to help and has refused it 90% of the time. \n\nHe might not chose to have poor emotional regulation skills but he chooses to curse us out over the smallest things. Today he yelled at me because I asked him if he ate my cookies. The man is nearly 70 years old and he's screaming telling me to fuck off over cookies. He makes me feel like I'm speaking to an overgrown child. I know he's got some control over this because he has never, ever acted like this in the presence of a man. Only to women. If he truly wasn't in control of himself he would act like this around everyone. \n\nI can't wait to leave because I can't do this anymore. I'm so sick of society enabling this behavior. I work with autistic kids and I'm telling you, autistic girls do NOT get the same passes. \n\nPosting this both to vent and also to talk with a community of people who understand. I'm so exhausted and tired of walking on eggshells around him. ",
        "num_comments": 73,
        "comments": [
            "Im with u. Its not fair bc autistic women r under quadruple the pressure while the men get a pass abt so much stuff. Like not being emotionally invested. Im sorry But had to learn and teach myself what proper emotional investment/engagement was, I didnt just resign to the fact that I was bad at it and never fix t like many autistic men resort to.",
            "IMO the pass given to autistic men is just an extension of the passes given to men generally. People accommodate neurotypical men having difficulties with communication and emotional regulation all the time. \n\nYou're right to be sick of this behaviour and you should leave. As suicide is a bigger problem among autistic women than men, you should take care of yourself.",
            "Two of my ex-boyfriends were autistic and extremely abusive. Every time I tell *other* autistic people this they immediately demand I excuse their behaviours. Yet as an autistic woman I'm never allowed to fuck up even the slightest amount.",
            "I dated a guy who said this: Adhd is an explanation not an excuse (he had a lot of adhd). He also behaved poorly sometimes but at least he understood that he could not use it as an excuse for bad behavior.",
            "I also have an autistic father who I have had to tiptoe around for my entire life. It's exhausting, but one day you'll be able to leave his home and only visit on your terms. Living 3000 miles away has saved our relationship.",
            "I'm the only one diagnosed in the family, but even my sister could see almost all of us (maybe not mum) has some sort of neurodivergency. Dad was pretty explosive when we were younger and I've become very withdrawn from fear and trauma, and I've been scolded for it so many times. \n\nI'd get yelled at if I don't want to be in pictures or go into overwhelming places, yet my brother could speak and act harshly over small things like food and everyone would make excuses for him:(",
            "Men in general get away with a lot - men who have autistic traits get away with it too . Ive just started to match the disresepect to my whole family, especially my two brothers and my mother who wont put Them back in their place. Like no i wont tolerante it and i Demand properply behaviour. Cuz im damn put to my place when i mess up. So if she wont raise Them right, im gonna do it for her",
            "I hear you. My dad's 75 now but never got a diagnosis or got better. He can be laughing one second then shaking with rage and screaming the next. Every holiday he would ruin with his tantrums. Every outing, every occasion.  If he wasn't in rage he would be seething with his arms crossed. Then wonder why no one had a good time,  like he didn't just scream seconds ago. Every memory of my childhood is of trying not to upset him, of never being enough and of living in fear of him. I love that man to bits , even went into the same profession as him but nothing ever was enough, because he chose not to learn to control his emotional disregulation he is ultimately never happy with his life. \nHe is the reason I sought help and a diagnosis because I want to enjoy my life and regulate better.",
            "I have an undiagnosed autistic dad too. It's a nightmare. We don't talk for obvious reasons lol ugh I feel you.",
            "The things my brother got away with cause he might be autistic was just ridiculous, I got punished for them if I did the same or less"
        ]
    },
    "Did anyone else talk EXTREMELY openly about their period to everyone as a kid?": {
        "title": "Did anyone else talk EXTREMELY openly about their period to everyone as a kid?",
        "score": 67,
        "url": "https://www.reddit.com/r/AutismInWomen/comments/1drbjqq/did_anyone_else_talk_extremely_openly_about_their/",
        "content": "I got my period when I was like 11 and I would talk to my whole class about it. I didn’t care. Because I honestly didn’t see any shame in it. It happens to everybody (well, obviously, not everybody but you know what I mean). It’s a normal bodily function. \n\nI was like “yeah I’m not feeling well I’m on my period today!” (Quite loudly because I had no volume control at that age) and I never understood why all the girls around me would look at each other and their eyes would widen and they’d whisper and giggle. Then they’d whisper and be like “OMG you can’t SAY THAT!”\n\nI’d be like “why? What’s wrong with having a period?” And obviously I’d still be loud when I said this LMAO. \n\nI always felt humiliated by everyone’s reactions but I never understood why it was so wrong to talk about periods. So I just ended up feeling confused and humiliated for no reason because my peers somehow found so much shame in something so normal. \n\nThe same goes for other hush topics like sex and going to the bathroom. But I figured out pretty early WHY people don’t like to hear about that stuff. Because poop smells bad and they don’t want to imagine me having sex. So I’ve improved on that front. To be honest, I’ve improved on all fronts because I try to mask as well as I can. I’m wondering if anyone else shared this experience with me!",
        "num_comments": 16,
        "comments": [
            "As a kid I didn't talk about it in public because I didn't really talk in public. I also felt vague shame about it as I knew my male relatives are not supposed to know even though I didn't know why. Now as an adult, even though I know it's a hush hush topic in mixed groups (can't offend men's sensitivities), I think it's a stupid rule so when I have cramps I talk about it about the same as I would about a headache. I don't go into details, but I just don't see the point in pretending I'm not in pain when I am.",
            "lmfaoo me. im very open with talking about bodily processes",
            "Yep. I made it my mission to educate the boys (I was mostly friends with boys). Still don't have any problems talking about it, or just about any topic. I don't get taboo topics.",
            "I dont flaunt my period in public, but Ive been trying to unlearn the shame around it. I dont try to hide pads anymore when I need to change mine, I just grab it from my desk drawer and hold it in my hand. Its literally five or six paces from my desk to the bathroom door so I found it kind of pointless trying to hide it, and I dont think anyone at my work wouldve cared. I mean, if holding a clean pad is gross, wouldnt it be equally gross if I was seen going into the storage room for a fresh toilet roll to replace depleted stock in the bathroom? Yet the latter is never remarked upon while apparently some take offence to the former. People need to grow up, regarding periods.",
            "no my father made sure i knew it was gross and shameful almost immediately  /s",
            "I talk about freely because I dont see anything wrong with it. My mom tells me she doesnt want to know about it, but like why?? You go through the same thing like me, what are we ashamed for?!",
            "Yep. Same thing happened when i was asked if I masturbated by a classmate. I naievely started talking about how yes, its normal, natural etc etc.\n\nYes i was bullied about it continiously for month, even years later. Hope they're proud of themselves. B*ches.",
            "I took the phrase time of the month very literally and assumed all women with a period would bleed once a month at the exact same time hence time of the month so when I went to the bathroom and saw I was bleeding but I was the ONLY one in the bathroom, I assumed I was the only person in my school with a period. So I was embarrassed then but after it was explained to me and I realized all women go through it, I had no problem talking about it. Lol",
            "I hid mine for a long time.",
            "I'm so sorry but this sounds so much like my 14 year old cousin and let me tell you I think she is an absolute badass, one of the coolest people I've known in my entire life, and whenever I see her do / say stuff like that I feel so proud of her and happy she is able to express!\n\nI spent last year telling her everything I possibly could about autism because she finally is realizing she's probably also autistic like me and I feel so lucky to be able to remind her that even if you communicate differently - you deserve to be treated with love, respect, and kindness, and it doesn't make you any less cool or wonderful of a person!!"
        ]
    },
    "Overwhelmed and had a meltdown at LAX": {
        "title": "Overwhelmed and had a meltdown at LAX",
        "score": 193,
        "url": "https://www.reddit.com/r/AutismInWomen/comments/1dr1jf1/overwhelmed_and_had_a_meltdown_at_lax/",
        "content": "I just had a horrible meltdown at the airport and a sweet Alaskan air employee found me on the floor sobbing and helped me. I flew across the country to help a friend. We had a disagreement that ended with her taking taking me to the airport and leaving me 1 week before my scheduled flight home with no money. I told her to at I couldn’t handle the airport alone and needed help but she left me anyway. So I ended up lost and freaking out. \n\nThe lady that helped me got a manager to exchange my ticket for me and now I’m trying to stay calm and get through the next 15 hours home. \n\nI don’t know if I can keep going through these episodes. It’s just too much. ",
        "num_comments": 44,
        "comments": [
            "Almost everyone would be floored by a dreadful experience like this.   I hope you get home safely and manage to recuperate with your last week of your holiday.\n\nIt does concern me that you say *I dont know if I can keep going through these episodes.*    When you are able, can you explain what you mean by that?   Are you referring to meltdowns?   If you are, do you have a meltdown strategy that you can work on so you can cope better?",
            "Dont beat yourself up! Its only natural, I think even an allistic would have a breakdown/meltdown of sorts in that situation. Not only does LAX suck, but your ex friend dropped a bomb on you and literally left you in one of the most stressful places in the world. \nLike other users said, there are some strategies for next time. But I just want to emphasize that its ok you had a meltdown, were autistic and that situation was not easy. Im glad you made it through!",
            "LAX is horrible. Im sorry you had to go through that. I moved to LA two years ago and had to travel for work. Took an Amtrak and it was less stressful. They buses are really nice and 100x better than greyhound.",
            "Since you are level 2 perhaps you can look into getting funding for your carer to travel with you? It seems youre not capable of travelling alone, with all the uncertainties and changes it involves, so having either your current carer or a specific travel carer with you could help.",
            "Ive had multiple meltdowns in airports, on planes, on the way to the airport. Its a trigger for me and so overwhelming - noise, smells etc. youll be home and safe and hopefully you can rest. \nI know that some airports have calm rooms you can go in if needed too.",
            "Just had a meltdown at FRA too. It helped me to read your post and not feel alone. Hope this helps you too. Good luck ",
            "Dude, Im so freaking sorry. Just reading this I feel overwhelmed so I cant even imagine. Im horrible with directions and airports terrify me for this exact reason. Thats awesome someone helped you! Maybe try cbd? I used to smoke weed constantly to cope and it started hurting more than it was helping. But I would use cbd as isolate drops, pre rolls and vape carts by themselves and they were amazing if I felt like I was on the verge of a meltdown. I just personally had to stop using cbd because I was addicted to weed beforehand and it just made me wanna feel the high along with it, so id just end up smoking anyways. Now I take neurocalm by designs for health or zen by allergy research group if I really need to (recommended by my primary care dr who also specializes in autism). Yes theyre a little expensive to take on a consistent basis but I only use them if I feel like I really need to so it helps me treat them like a last resort option",
            "I had a meltdown at ATL. Traveling alone is the worst",
            "I really feel for you. The emotional trauma of what happened with your friend would be enough to trigger a meltdown for me, let alone the setting of LAX! When Im in these situations, I try to focus on when Ill be back secure in my home, with my favorite activity, foods, shows, etc, and keep thinking how safe Ill feel once Im there. Sending you all the good vibes because Ive been there and just really feel for you right now. ",
            "Hey I had a meltdown once at LAX. My Sister!"
        ]
    }
}