{
    "Let’s talk about ABA therapy. ABA posts outside this thread will be removed.": {
        "title": "Let’s talk about ABA therapy. ABA posts outside this thread will be removed.",
        "score": 1972,
        "url": "https://www.reddit.com/r/autism/comments/ub3skp/lets_talk_about_aba_therapy_aba_posts_outside/",
        "content": "ABA (Applied Behavior Analysis) therapy is one of our most commonly discussed topics here, and one of the most emotionally charged. In an effort to declutter the sub and reduce rule-breaking posts, this will serve as the master thread for ABA discussion.\n\nThis is the place for asking questions, sharing personal experiences, linking to blog posts or scientific articles, and posting opinions. If you’re a parent seeking alternatives to ABA, please give us a little information about your child. Their age and what goals you have for them are usually enough.\n\nPlease keep it civil. Abusive or harassing comments will be removed.\n\n**What is ABA?** From [Medical News Today](https://www.medicalnewstoday.com/articles/aba-therapy):\n\n>ABA therapy attempts to modify and encourage certain behaviors, particularly in autistic children. It is not a cure for ASD, but it can help individuals improve and develop an array of skills.\n\n>This form of therapy is rooted in behaviorist theories. This assumes that reinforcement can increase or decrease the chance of a behavior happening when a similar set of circumstances occurs again in the future.\n\nFrom our wiki: [**How can I tell whether a treatment is reputable? Are there warning signs of a bad or harmful therapy?**](https://www.reddit.com/r/autism/wiki/warningsigns)",
        "num_comments": 4749,
        "comments": [
            "I try to stay silent on most topics on here, because I personally do not have autism but I am  a mother of an autistic 3yr old. And the amount of \"You need to start ABA immediately! Every day without it your child suffers\" I recieved from his pediatrician and developmental pediatrician caused me so much anxiety. I started the search only to find out my insurance doesnt cover it and it would be $700 a week before I reached my deductible. \n\nIm so happy looking back it was so expensive and i had time to do research and find out more. This is still the mainline treatment and is pushed. My son was only diagnosed 7 months ago.",
            "ABA took me from being non verbal to being verbal as a kid, HOWEVER it was at a quite high price. The adults who surrounded me didn't know any better so when the kindergarten I went to suggested that I was put in ABA therapy, since I was the only autistic child who wouldn't participate in any activity, just sit facing the wall without speaking, they complied. Trouble sleeping, vivid nightmares and surreal dreams, low self esteem and general insecurity are some of the symptoms I started having during ABA and these last to this day. I am in my 30s, I am verbal, even though I still have a speech issue which non autistics call an \"accent\" and this explanation seems feasible since I've lived in several countries and it's mostly attributed to be being foreigner there, but having an \"accent\" in my own native language caused endless bullying in school. \n\nThese days I am more comfortable being always the \"different\" person in the room and every time I hear a \"oh, you have an accent! Where are you from?\" I immediately tell whoever asks that this is not a foreigner accent but a speech difference that I've been unable to correct even going to many, many speech therapy sessions throughout life and mostly caused by ,e being autistic and spending my first years as a nonverbal individual. It informs them about something very important about me and it educates them as well.\n\n&#x200B;\n\nI don't have any intention at all to have any kid of my own, but if I did and it were autistic, I would never put it in ABA therapy, since I do think the questionable benefits are not worth it.",
            "My mother is forcing me to go through ABA even though I'm almost 17 years old. I have talked with her about the autistic adult community's views about ABA and she basically said that our opinion is nonsense. \n\nIs there any way I can get out of therapy without her consent? I'm almost a young adult yet I am being given the \"little kid\" version of ABA.\n\nUpdate: I'm not doing ABA anymore :D It's autonomy time! I checked with my psychiatrist and even confronted my ABA \"therapist\" and I'm finally free! My mom is now respecting my decision to do normal therapy after talking with my psychiatrist and even turned down my psychiatrist's \"accidental\" autism treatment offers in other clinics (I'm don't know what to call it in english so I'm going to say \"autism treatment\")",
            "Hi all,\n\nReading more about it, I realized I was forced into ABA as a child.\n\nLike, holy shit. I'm not even sure if my biofamily knew I was autistic, but they (and my first two schools) forced me to not stim, to talk, to look people in the eyes, wear bad clothes, eat bad feeling food, etc... all of it. I wasn't a 'meltdown' child. I was a 'shutdown' type. I go catatonic, basically.\n\nI'm 'unlearning' all the harm done to me as a child, but it's hard to let myself stim or be non-verbal because I feel like I'll get in trouble if I don't force myself to be 'sociable'.  \n\n\nEdit, 4 months later: Turns out I def have ADHD and maybe autism on top of it lmao. Still very anxious about life but EMDR and talk therapy has been amazing and I can actually ride the bus by myself!!! Even a year ago I couldn't step outside by myself! *It gets better, y'all. Life gets better.* <3",
            "As a former ABA therapist, I don't agree with the principles of that therapy. I do believe OT and other therapies to be helpful.\n\nABA approaches things from a very NT perspective only. It inherently asks these children to change everything about their autism. They can't stim, they can't utilize echolalia, just a million things that are wrong wrong wrong. Even the companies that use silence in place of \"no\", it's still coming across as \"wrong\" to the child.\n\nI helped a 9 year old learn how to cross the street safely, brush his teeth, use the bathroom independently, and try new healthier foods without it turning into a stressful situation. That was good.\n\nBut I also had to teach these kids not to use their natural comforting instincts - why? Because it would make NTs comfortable. Fuck that. I refused to prioritize NTs over these innocent, struggling kids and quit. Im so glad I did.\n\nSome of the principles of ABA that are good are found in other therapies. ABA is old-fashioned and not as *long-term* beneficial as most other therapies. It's time we move on.",
            "My 15 yr old son was diagnosed about a month ago.  When I asked his neuropsychologist what was available to help him if needed.  I did mention that I was not interested in pursuing ABA.  She responded that she knew there was a conflict between ABA and the adult autistic community so she did not recommend it.  This seemed to be a step in a positive direction.",
            "Not only does ABA instill learned helplessness and trauma, but it also stunts communication skills. Most ABA simplifies language (for example \"Say \"cookie\" to get the cookie\" would become \"cookie?\") and, moreover, ABA focuses only on operant conditioning. This means that the child isn't allowed to do more complex cognition, like language learning that isn't on the level of dogs. It's dehumanizing if you think about it.",
            "My doctor describes ABA as \"teaching a patient how to hide their autism, so the people around them can feel less annoyed by it\" and then she goes on to say, those people aren't her patients, I am, so fuck em. \n\nI have a great doctor.",
            "I took an Intro to Applied Behavior Analysis course last semester because I wanted to find out what exactly ABA therapists were supposed to do. The most irritating thing I learned in that class is that ABA therapy teaches children that coping by removing yourself from an uncomfortable situation is considered a form of negative reinforcement. Here's a line from a study guide my instructor wrote:\n\n>_Escape & Negative Reinforcement (A child does not like sitting at his table in school so he requests to take his work to the office when it is time to sit down and do work...His teacher always allows him to do this. This is an example of Escape and the child is negatively reinforced)._\n\nHere's my favorite line from a lecture:\n\n>_The most accurate analogy I can give you for ABA therapy is training a dog to stop barking whenever it sees other dogs._\n\nAnd my favorite hypothetical from a textbook:\n\n>_Justin is training his 6-year-old sister Sally to jump any time he claps..._\n\nYes, they use the word \"training\" in reference to children many times. Yes, dogs are used as examples quite often in the textbook.",
            "Ok then. I'll just put my own personal, emotionally charged anecdote that forever haunted me about ABA.    \nNot even of me. I was helping a customer with high-needs (possibly autistic, but neurodivergent at least), he was buying a ticket to my aquarium.   \nIn the entry vestibule, there were only us three: Me, my customer, and his attendant. While his attendant was paying, I asked the customer (who looked very excited to be coming to the aquarium)   \n\"Are you excited to see the fishes?\"  \nAnd he beamed, held his fists, and repeated my phrase *\"excited to see fish, excited to see fish, excited to see fish\"* while moving very obviously excitedly. He wasn't even talking loudly, almost whispering to himself.      \nUntil his attendant gave him the \"calm\" hand signal, and the customer went back to a stoic stance.   \n   \nWhen he repeated what I had said, and how he was doing it, I really understood clearly and could see how happy he was. And I was (selfishly) proud that it was the words I used that triggered that happy stim. I just. Can't explain how happy he was in words, but it was clearer than I'd seen in anyone.   \nPerhaps from learning about how I and other autistics/neurodivergents express emotions, I could finally recognize it. I makes me cry when I think about it, he was just so damn happy. There was no one else around, so even if you were forced to care what people think (when you are going to a \"fun\" place - & we're a big city no one would bat an eye if they saw an adult acting like he did; and we get a lot of nt \"nerds\" too so it wouldn't be out of place), there was no one there to care.     \nAnd his attendant calmed him down.   \n    \n   \nHe would have \"calmed himself down\" in three seconds once he got that joy out of his system. Let us feel our emotions the way we feel them.   \n   \nk that exhausts any passionate comment I'll have to make thank you.  \n   \nE ABA not AAC, the latter is amazing"
        ]
    },
    "Media Monday! Let's talk": {
        "title": "Media Monday! Let's talk",
        "score": 14,
        "url": "https://www.reddit.com/r/autism/comments/1dhryog/media_monday_lets_talk/",
        "content": " \n\nThis post is for any user who wants to share any type of media. Be it games, music, movies and what not. Let's meet some friends.\n\nAre you grinding on Fortnight or Red Dead Redemption 2 ?   \n\nHave you been binge watching Good Girls on Netflix ? \n\nAre you rewatching the Remastered version of Akira ?\n\nUse this thread to chat up the community. If this seems to be popular we can keep it up. Enjoy folks!",
        "num_comments": 13,
        "comments": [
            "Hey /u/AutoModerator, thank you for your post at /r/autism. Our rules can be found **[here](https://www.reddit.com/r/autism/wiki/config/sidebar)**. All approved posts get this message. If you do not see your post you can message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fautism).\n\n\n\nThanks!        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/autism) if you have any questions or concerns.*",
            "Last night my Telly packed in while I was finally trying to watch Succession season 1.\n\nI think that's it for the telly and succession which I wasn't getting into at all. Although I might find staring at a blank, broken, screen more pleasant than watching 5 narcissists swear at each other for hours.",
            "Played several Wii games:\n\n* Mario Kart Wii\n* Tamagotchi!: Party On\n* Wii Fit\n* Wii Sports\n* Super Mario All-Stars (yes, there exists a Wii port)\n* SpongeBob SquarePants: Truth or Square\n* Super Smash Bros. Brawl\n* Mii Maker\n\nRecorded the footage to VHS and... so far Mario Kart Wii looks really good despite its use on outdated hardware (the VHS).",
            "I love listening to old folk music of any kind. Idk why I'm like this but my brain just can't get enough of it. It's fun and interesting to me, it feeds my imagination. I love shanties, festive songs, music from the 1700s, European medieval music, music from ancient times, folk music from around the world. It's all mesmerizing to me. But I also just like hearing national anthems, the older the better. I discovered this man who studies and goes in depth into music more focused in the Mediterranean and Middle East and it is so cool, I love it, I learn so much from this guy. He's brilliant. [Farya Faraji](https://www.youtube.com/watch?v=269riq2z8nc&list=PLhH8U_XqqD2R_48-SwEF3Zg-iTQrvS9nM&index=4&pp=gAQBiAQB8AUB). \n\nIn the movie The Prince of Egypt I was absolutely spellbound by the Hebrew singer of the soundtrack. Her rendition of [Deliver Us](https://www.youtube.com/watch?v=fQhcOJHTdb4&pp=ygUaZGVsaXZlciB1cyBwcmluY2Ugb2YgZWd5cHQ%3D) was incredible to me. Blew me away. \n\nOne of my favourite musicians is Gheorghe Zamfir, an amazing pan flutist. I have this image inm y mind of a faun sitting on a cliff playing this song. I first heard it in Picnic At Hanging Rock, one of the prettiest haunting movies I've ever seen. [A pan flute song by Gheorge Zamfir](https://www.youtube.com/watch?v=Xefe8KCP-VA&pp=ygUsZ2hlb3JnaGUgemFtZmlyIGRvaW5hIHN1cyBwZSBjdWxtZWEgZGVhbHVsdWk%3D). He has also had music featured in the Studio Ghibli movie [Only Yesterday](https://www.youtube.com/watch?v=vuGpUS_imQk&pp=ygUeZ2hlb3JnaGUgemFtZmlyIG9ubHkgeWVzdGVyZGF5). \n\nOther random folk songs I like:\n\n[The Girl I Left Behind Me](https://www.youtube.com/watch?v=oblF9EqE9RA)\n\n[Leave Her, Johnny, Leave Her](https://www.youtube.com/watch?v=sbRLx1-g2AM&pp=ygUhbGVhdmUgaGVyIGpvaG5ueSBzb25ncyBvZiB0aGUgc2Vh) \n\n[Fhir A Bata](https://www.youtube.com/watch?v=KmSoyoJRzWw&pp=ygURZmhpciBhIGJhdGEgc2FuZHk%3D)\n\nI also love folk-music-ified modern music, like bardcore or covers of modern songs on instruments typically heard in folk music, as well as medieval sounding music that may not necessarily be originally from that time period, like the medieval [revival music from the 1960s](https://www.youtube.com/watch?v=1_R7F77T2fo&pp=ygUac2VsbGVyIG9mIHN0YXJzIGJ5IGRvbm92YW4%3D), and this song by [Rajaton](https://www.youtube.com/watch?v=3NDWMQH-zvo&pp=ygUTc3VtbWVyIHNvbmcgcmFqYXRvbg%3D%3D). \n\nAnd yes....yes....I like Enya. 🥲 I know people made fun of it but she called to me like a sea siren. Lol\n\nOkay that's it. There is all the odd music I like. I will see myself out.",
            "I write and illustrate a sci fi video series on youtube that I've put a lot of work into. If y'all were interested, the link is here :)\n\n[https://www.youtube.com/channel/UCMmQtjs2PnI2HjU0Fc-rOOw](https://www.youtube.com/channel/UCMmQtjs2PnI2HjU0Fc-rOOw)\n\nProfectus is a sci fi worldbuilding project that centres around psychology and the immense benefits of mental health prioritisation and trauma healing. The first story is already complete, and the next is on the way :)\n\nAside from that, I've been playing a lot of terraria and factorio lately heheh",
            "i’m rewatching all my toy story dvds. life long special interest of mine :-)",
            "I just started watching Monk for the first time :)",
            "I rewatched SPVTW!!! I'm playing alot of OneShot!!",
            "I have special youtube channel in mind, it has fantasy based environmental ambience which sounds very close to real life and I listen about an hour daily.",
            "playing the wheel of time mod in skyrim"
        ]
    },
    "what stereotype are you the opposite of?": {
        "title": "what stereotype are you the opposite of?",
        "score": 282,
        "url": "https://www.reddit.com/r/autism/comments/1dqvglt/what_stereotype_are_you_the_opposite_of/",
        "content": "like, i know there are many stereotypes we don’t fall into, but is there something that makes you go “this couldn’t be more different from who i am”?\n\nfor example: i HATE plain foods. and it’s not only that i’m able to eat other types of food, i simply CANNOT STAND PLAIN. seriously, if i see pasta without sauce it makes me gag, i NEED flavour!!!\n\nso, is there anyone there that like, loves loud noises or something? lol i’m curious",
        "num_comments": 312,
        "comments": [
            "Hey /u/imotheroffrogs, thank you for your post at /r/autism. Our rules can be found **[here](https://www.reddit.com/r/autism/wiki/config/sidebar)**. All approved posts get this message. If you do not see your post you can message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fautism).\n\n\n\nThanks!        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/autism) if you have any questions or concerns.*",
            "Perhaps an odd one: happy armflapping. I do not stim by flapping my arms excitedly or when feeling good. If you see me flapping my arms I am trying to get the mental yuck out of my body and there's an 70% chance I am pissed off.",
            "Similarly to you, I am sensory seeking when it comes to food and LOVE novelty and unusual/unique flavors and textures. I still have same foods and safe/comfort foods, but I do not fall into the stereotype that all autistic folk are sensory-avoidant for food. \n\nAlso I'm highly emotional and empathetic, contrary to the common autistic stereotype.",
            "I'm the one that loves loud sounds, my music is always blasting, my ears hate me. not being able to hear things properly makes me anxious",
            "Doesn’t understand sarcasm.\n\nI’m very good at sarcasm and understand sarcastic jokes. Many people have said they don’t get my own sarcasm though!",
            "I don’t like trains. I don’t like train spotting, hearing them or train timetables. I avoid trains where possible.",
            "probably the \"loves kids stuff\" one. i don't enjoy stuff like cartoons (not even the ones made for a more mature audience) - a lot of people assume all autistic people *love* kids shows, games and movies.",
            "The “quiet introvert who hates socializing” stereotype. I love socializing and being the life of the party. I’m an extrovert and socializing can brighten my day although it also tends to make me get really excited causing me to stim lmao",
            "I am far from a genius and suck at math though to be fair, i am quite fluent in 3 languages but hate conversations. So that’s quite useless somce I don’t want to use my versatility in linguistics. \n\nI don’t have a repeated fashion collection. There’s times i feel dark and gloomy so i will rock an all black outfit with even painted fingernails in black (i am a man). And there’s time i dress in earth tones. Sometimes formal sometime casual.\n\nNo stimming \n\nI am not as structured as many believe i should be for being on the spectrum. some stuff is extremely well structured and ordered others are not.",
            "Aside from loving Thomas when I was younger I never had a special interest in trains."
        ]
    },
    "“I hope she doesn’t have autism like you” ": {
        "title": "“I hope she doesn’t have autism like you” ",
        "score": 334,
        "url": "https://www.reddit.com/r/autism/comments/1dqoege/i_hope_she_doesnt_have_autism_like_you/",
        "content": "\nSo I have autism and my cousin was just born and my own mother looked at me and said “I hope she doesn’t have autism like you” and many other people in my family have made the same comments. When I was diagnosed my doctor told my family it wasn’t a bad thing and many of my good qualities are from autism. \n\nAnd as many of you know, autism affects EVERYTHING about you and I truly believe that. Autism is me, I would not be me without autism. So hearing that they don’t want someone to be like me really hurt my feelings. \n\nIs this valid feelings? I don’t think my family means it in a bad way because I’ve had a lot of struggles with autism but my family has always shoved it in my face that I’m “high functioning” \nAnytime I bring up a struggle or being autistic I’m always hit with “well you’re high functioning” so like idk I also disagree and say I’m functioning not high functioning yk what I mean lol. \n\nIt’s confusing and I don’t know if it’s valid for this to be hurting my feelings ",
        "num_comments": 73,
        "comments": [
            "Hey /u/bakedbeanz32, thank you for your post at /r/autism. Our rules can be found **[here](https://www.reddit.com/r/autism/wiki/config/sidebar)**. All approved posts get this message. If you do not see your post you can message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fautism).\n\n\n\nThanks!        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/autism) if you have any questions or concerns.*",
            "I think your feelings are valid. It bothered me just to read that and I don’t think that’s a nice thing for someone in your family to say. But I understand that they probably didn’t mean it in a bad way.  \n  \nI think allistics don’t view autism the same way. Where I and I think you too see it as our life. I cannot be separated from autism it is ever present in my life to it is essentially me. Allistics can see it as another illness and assume you see autism as a problem too.  \n  \nLastly, I don’t think they understand how much autism affects you or anyone so downplaying your disability isn’t good and comparing ‘who got the easier disability’ doesn’t help anyone. I think maybe your family is just ignorant about the autistic experience and that they don’t intend to be mean although. I think you feelings are valid and you make sense.",
            ">“I hope she doesn’t have autism like you”\n\n\"Well if she does then I hope she won't be shamed for it.\" 👀👀👀\n\nI hope she gets to be herself growing up. I hope this baby is loved, accepted an supported unconditionally while everyone else leaens to keep their ableist thoghts to themselves. 😭",
            "I would also be very hurt by those comments.",
            "What a fucking vile thing for ANY human being to say to another.\n\n\n\"I hope this child doesn't turn out like you.\"\n\n\nThat is the sort of thing you say to someone who has commited horrible misdeeds, not a loved family member. Your mum should be ashamed of herself.",
            "Your feelings are valid. Honestly that's such a rude thing to say to someone, even if you had some crippling genetic condition it's still not an okay thing to say to that person's face! \n\n\nNow, being that autism is a spectrum and comes with a lot of difficulties, I don't entirely blame people for not wanting their kids to have autism. I personally would never procreate or donate eggs because of the genetic risk factors. Autism has given me a lot of gifts and made me who I am, but I'd be lying if I said it was always easy or pleasant. \n\n\nHowever, you don't *say that to the person with autism*. That's what we call \"an inside thought\". ",
            "Looking at the comments I have to say that I get it when people don't want their newly born child to be autistic. Being autistic is hard, and not only for those being autistic, but also for the parents having to raise an autistic child. I know, because I have autistic children and it's pretty tough.\n\nThat having said, I don't know how they said that to you, but I can imagine it stung (figuratively speaking), and perhaps they could have been more empathetic about it. I mean, again, you don't want a newly born child to have a neurological and development disorder, but if they were as blunt as I suspect they were, then that's not very nice.\n\nNow the other thing you've stated, where you say that they shove it in your face that you are \"high functioning\" when you struggle with your autism, now that's just ableism in my book. It completely undermines your struggle and they should be better than that.",
            "\"I hope she isn't a raging cunt like you\"",
            "Your feelings are 100% valid, I would feel the same way and I think a lot of people with autism would too. As you said, it's part of who we are.\n\nIf you feel up to it, maybe you could tell them about how those comments make you feel and why you think they're hurtful. I wouldn't assume people mean it in a negative way necessarily, they probably just don't know any better and letting them know that it is hurtful, can hopefully help them change the way they view autism.",
            "Well this is horrible. You have a terrible family if this is how they are. Or maybe they are also autistic and lack filter/emotional intelligence/tact/social graces."
        ]
    },
    "why do adults not say the word “autism”?": {
        "title": "why do adults not say the word “autism”?",
        "score": 131,
        "url": "https://www.reddit.com/r/autism/comments/1dqu5se/why_do_adults_not_say_the_word_autism/",
        "content": "I’m recently diagnosed and was undiagnosed for 19 years, the way we figured it out was a long confusing process, and one thing i’ve noticed is that my parents (both in their 50s) don’t say “autism” or “autistic” most of the time when they’re talking about it. they’ll mostly say “on the spectrum” referring to my autism and it’s like they’re dancing around the word, like it’s taboo or something. is it a generational thing? why do they seem uncomfortable just saying “autism”?",
        "num_comments": 49,
        "comments": [
            "Hey /u/taehyungslefttoenail, thank you for your post at /r/autism. Our rules can be found **[here](https://www.reddit.com/r/autism/wiki/config/sidebar)**. All approved posts get this message. If you do not see your post you can message the moderators [here](https://www.reddit.com/message/compose?to=%2Fr%2Fautism).\n\n\n\nThanks!        \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/autism) if you have any questions or concerns.*",
            "There’s probably stigma associated with the word autism for your parents , that’s the only thing I can think of",
            "My boss, who’s like 26 (so not old) tiptoes around it a lot. He’s gotten A LOT better though. “Because of your.. you know” and “because of your…. *autism*” is usually how he says it. But at least he’s saying it. It’s a work in progress",
            "I don’t really have an answer. But I was talking to my child (late teens autistic) and they told me that they had met a new person today. That person (20s) asked my child whether they were “on the spectrum”; it turns out that person was autistic too. So from this interaction it’s not necessarily a generational or even NT thing. \n\nAs autists we get to choose what preferred term we use to describe ourselves. Personally I don’t care what term is used by others so long as it’s said with kindness. It must be quite confusing for NTs when we can’t even decide on a single preferred term amongst ourselves!",
            "So, you should ask your parents specifically. \n\nThere is a main old reason, and a main new reason. \n\nIn the past, Autism was basically only diagnosed in males who also had an intellectual disability and would likely be permanently disabled. So, an autism diagnosis was a pretty negative thing. Especially with how society decided to deal with anyone disabled. (I'm simplifying a LOT, look up some history if you need more context).\n\nNewer main reason is socially appropriate verbiage is moving to people aren't autistic, they have Autism Spectrum Disorder. Then everything else is slang, and there's not a right or wrong way, but without looking it up, everyone knows there's a socially correct way, but not which ways are the socially acceptable ones. \n\nHope this kind of answers it a little bit. I cut out a lot of context.",
            "there are two different motivations that i can think of:\n\n1. magical thinking: they feel that if they avoid saying the word \"autism\" then they prevent it from being true. some people actually think like this. it's wild.\n\nor\n\n2. misguided notion of respect/deference towards parents of non-verbal or otherwise higher-needs autistic folk. they don't want to arouse their anger by suggesting that your difficulties might cohabit the same broad continuum that their kids' difficulties do.",
            "It's absolutely because of the stigma. I've observed people of all adult ages say it, and it always feels like a euphamism for autistic. I think it's based on the misconception that the spectrum is a line from \"very autistic\" to \"slightly autistic\", so by saying someone is \"on the spectrum\", it's a polite way of saying someone has autistic traits without labeling them as something that can be incredibly stigmatizing. (Basically in NT culture, it's rude to call someone autistic, and showing a lot of social vulnerability to call oneself autistic.)",
            "I don't think this is an *adults* thing, I think this is a *your parents* thing.  They know the answer, and you can ask them.",
            "My boomer parents do the same. They explicitly told me it’s because being on the spectrum isn’t as bad as being autistic. So…yeah.",
            "They're being more vague out of politeness to differentiate you from those with higher support needs is my best guess."
        ]
    }
}