{
    "Leatherique - how to know when to stop applying oil?": {
        "title": "Leatherique - how to know when to stop applying oil?",
        "score": 670,
        "url": "https://i.redd.it/lmc53fsg9c9d1.jpeg",
        "content": "I've been applying leatherique rejuvenating oil for the past 2.5 days. The driver seat of my car continues to have dry spots within an hour or two of each application. Do I just keep applying until it no longer soaks in? I've done 10-12 applications in 90+ degree weather using my hands to rub the oil in. ",
        "num_comments": 261,
        "comments": [
            "Keep going, you’re almost there.",
            "is this satire",
            "Man polished his seats",
            "![gif](giphy|3uNiWWyT5BqQU|downsized)\n\nOP changing his oil.  I think he's just trying to get a laugh..well done",
            "You stop when your car seats are glossier than your exterior paint.",
            "Holy shit",
            "A lot of people don’t know how leatherique works. Satire or not it’s definitely ready to be wiped down with the cleaner. The end result will be a beautiful hydrated matte leather.",
            "Trolls aside for those that have never used leatherique, you need to wipe it off when done. So at this point clean it off with the second step and it’ll will probably be fine. I used it on my 12 year old E90 and it transformed the leather condition. Those saying to coat the leather are talking about protective products vs restorative products. I have a thing of Leather Honey I am still waiting to try on my F80",
            "Please stop applying... you've applied way too much already",
            "Take it for a drive, when you brake and kiss the windshield you’ll know you applied enough"
        ]
    },
    "Hey all, here's the lube seat adventure, pre and post-op. If you haven't used Leatherique, you should": {
        "title": "Hey all, here's the lube seat adventure, pre and post-op. If you haven't used Leatherique, you should",
        "score": 79,
        "url": "https://www.reddit.com/gallery/1dqxdog",
        "content": "I was cracking up today at all the comments, the seats turned out great though. Here's a before and after shot. Love you lots",
        "num_comments": 16,
        "comments": [
            "The responses in that other thread were pretty funny. I’m glad you posted that picture. Nice results here too.",
            "If anyone wnats to try it on the cheap, I'll sell my bottles I have here. I dont use it since I dont have my King Ranch anymore.",
            "Just curious what year is the car?",
            "So “supple” as they say on the bottle 😎",
            "It’s a great product, but I started using Griot’s 3-1 for an immediate result that is very similar.",
            "I'm pretty impressed by how the seats turned out. They look, feel and smell almost new compared to how they were before",
            "What size bottles and for what price?",
            "2016",
            "This guy needs more",
            "Nice nice. Napa leather yeah? It’s coated. Not saying the leatherique doesn’t work it’s just not the best tool for the job with coated leather, next time go for a regular interior cleaner like griots interior cleaner, boars hair brush and a microfiber rag and youre good to go. Can add a little conditioner if you want. Just to save you some headache next time 👍 looks good tho!!!"
        ]
    },
    "Headlight Resto": {
        "title": "Headlight Resto",
        "score": 25,
        "url": "https://i.redd.it/1lhdlcqhrd9d1.jpeg",
        "content": "Finally got around to doing my own headlights. I'm usually too busy for my own car. Steps/Products Below.\n\nWet Sand with 1k/2k/3k sanding sponges on a power drill. I normally skip polishing and got straight to coating with Cerakote wipes. \n\nDecided to polish, but couldn't find any Meguiars Plastic-X in my bag so went with 3D One. Low speed rotary pass with a Urofiber pad. Finished with a high speed rotary pass with a Rupes yellow pad.\n\nPanel Wipe then sealed with Cerakote wipes.\n\nThinking about getting an acetone vapor kit and toying around with only sanding 800/1000, acetone vapor, then coating.",
        "num_comments": 13,
        "comments": [
            "Make sure you use a sealant or it'll come back.",
            "04 Altima?",
            "I stated in my post that after sanding and polishing I did a panel prep and sealed with Cerakote.",
            "What sealant would you recommend?",
            "I think it's an 04. My parents bought it brand new. After my mom got a new cadillac a few yrs ago she asked if I wanted it since I was daily driving project cars 🤣",
            "Nice good work. As long as you keep UV protect on it. It’s gonna be good for years.",
            "Ive a variety of different sealants over the years. I just used cerakote to seal (I do a different process than their sanding) and it was stupid easy. I was gonna get a can of 2k but I saw lots of people saying good things about their headlight sealant. I also have used cerakote on the black plastic trim and it looks great so figured to give the headlight version a go.",
            "I normally just use UV clear coat after sanding down with 1000 grit. Like 2-3 coats is good. If you already got it looking at good as you did in the pics then just get some spray on ceramic coat from Turtlewax and apply it every month during a wash.",
            "I recognized the headlights.  I meant to say 06, but the headlights are the same.  Bought it new and it was still running like a champ when I sold it with 165k.  Only problem was a stupid little sensor that’s in the most inconvenient location at the back of the engine.  The transmission doesn’t like it when you floor it, but other than that it was a great car.",
            "Yessir, it's been my go to process for years. I just stay too busy to get to my own stuff most of the time."
        ]
    },
    "How do I stop this from twisting on itself?": {
        "title": "How do I stop this from twisting on itself?",
        "score": 50,
        "url": "https://i.redd.it/ybpgdy5pkc9d1.jpeg",
        "content": "I’ve tried untwisted it, rolling it on a reel, etc it’ll eventually always twist back up. Really annoying when trying to work around car. Also not to aesthetically pleasing when it comes to making content.",
        "num_comments": 20,
        "comments": [
            "Get a swivel connection for the end of the hose.",
            "Secure one end of the hose and walk away with the other end of the hose until you almost reach the maximum length of the hose. Then untwist and let it sit out in the sun for a bit like this.",
            "Lie the hose in the sunshine for a bit. Google video to learn over under winding technique. All done.",
            "Learn to wrap the hose the correct way. This applies to nearly all cables; power extension, hose, rope, USB, HDMI, etc.\n\nHere's a good video to demonstrate the over/under method: [https://www.youtube.com/watch?v=uKlaXb-fLrg](https://www.youtube.com/watch?v=uKlaXb-fLrg)\n\nThe idea is to reverse the twist of the cable every loop, so it does not twist all in one direction.",
            "You want a gun with a swivel at the base of the handle like [this](https://clean-garage.com/mtm-sgs28-pressure-washer-short-gun-stainless-swivel-quick-connects/). \n\nThis also lets you put the nozzle directly on the gun or attach a wand and for attaching foam cannons, etc.",
            "Don’t just jerk on the cable. Use your arms like a wire spool and roll it out instead",
            "Take your pressure washer gun and twirl it. It’s not that big of a deal for me.",
            "Flexzilla hose. Swivel connectors.",
            "Spin to win!",
            "Yep, what he said.\n The SWIVEL is the FASHIZZEL"
        ]
    },
    "New microfiber haul": {
        "title": "New microfiber haul",
        "score": 8,
        "url": "https://i.redd.it/ypv2f3xjie9d1.jpeg",
        "content": "Just picked up some new microfibers, pads, and compound/polish based on the communities suggestions. Thanks everyone for the solid/thorough reviews. Can’t wait to try these out.",
        "num_comments": 3,
        "comments": [
            "Is the one on the right trc diamond weave for glass?",
            "What towels are those?",
            "Sure is."
        ]
    }
}