{
    "Leatherique - how to know when to stop applying oil?": {
        "title": "Leatherique - how to know when to stop applying oil?",
        "score": 809,
        "url": "https://i.redd.it/lmc53fsg9c9d1.jpeg",
        "content": "I've been applying leatherique rejuvenating oil for the past 2.5 days. The driver seat of my car continues to have dry spots within an hour or two of each application. Do I just keep applying until it no longer soaks in? I've done 10-12 applications in 90+ degree weather using my hands to rub the oil in. ",
        "num_comments": 303,
        "comments": [
            "Keep going, youre almost there.",
            "![gif](giphy|3uNiWWyT5BqQU|downsized)\n\nOP changing his oil.  I think he's just trying to get a laugh..well done",
            "You stop when your car seats are glossier than your exterior paint.",
            "A lot of people dont know how leatherique works. Satire or not its definitely ready to be wiped down with the cleaner. The end result will be a beautiful hydrated matte leather.",
            "Trolls aside for those that have never used leatherique, you need to wipe it off when done. So at this point clean it off with the second step and itll will probably be fine. I used it on my 12 year old E90 and it transformed the leather condition. Those saying to coat the leather are talking about protective products vs restorative products. I have a thing of Leather Honey I am still waiting to try on my F80",
            "Take it for a drive, when you brake and kiss the windshield youll know you applied enough",
            "Please stop applying... you've applied way too much already",
            "All jokes aside, and the fact that it is supposed to be like that, I cant get over the fact that steering wheel looks like piano black trim in this photo",
            "I see lots of comments that look like they are not familiar with the Leatherique system. In my opinion these look like they are ready to use the finishing solution (forget the name, Im not at home). \n\nFrom your description, seems like you are in the rejuvenation phase, applying that product.  You cant tell from the pics but you just need to clean it up now and give it a day to see if the leather is taking the oil.",
            "Bwahahaha its a car Slip n Slide!!! \n\nOk who put Vaseline on the car seats?"
        ]
    },
    "Hey all, here's the lube seat adventure, pre and post-op. If you haven't used Leatherique, you should": {
        "title": "Hey all, here's the lube seat adventure, pre and post-op. If you haven't used Leatherique, you should",
        "score": 124,
        "url": "https://www.reddit.com/gallery/1dqxdog",
        "content": "I was cracking up today at all the comments, the seats turned out great though. Here's a before and after shot. Love you lots",
        "num_comments": 30,
        "comments": [
            "The responses in that other thread were pretty funny. Im glad you posted that picture. Nice results here too.",
            "If anyone wnats to try it on the cheap, I'll sell my bottles I have here. I dont use it since I dont have my King Ranch anymore.",
            "Just curious what year is the car?",
            "So supple as they say on the bottle ",
            "Its a great product, but I started using Griots 3-1 for an immediate result that is very similar.",
            "Looks great. I just got mine delivered. Curious but did you let yours bake in the sun for 24hrs?  Ive seen videos that say you should apply step one to the leather and let it soak in under hot conditions for 24hrs before you move on to step 2.",
            "Is Leatherique better than leather honey? I can get these results with leather honey that last a few months with leather honey. Just want the best product to help stop cracking on my 2014 f150 leather seats.",
            "I'm pretty impressed by how the seats turned out. They look, feel and smell almost new compared to how they were before",
            "What size bottles and for what price?",
            "I need some please? 08 accord leather starting to look like that"
        ]
    },
    "Headlight Resto": {
        "title": "Headlight Resto",
        "score": 37,
        "url": "https://i.redd.it/1lhdlcqhrd9d1.jpeg",
        "content": "Finally got around to doing my own headlights. I'm usually too busy for my own car. Steps/Products Below.\n\nWet Sand with 1k/2k/3k sanding sponges on a power drill. I normally skip polishing and got straight to coating with Cerakote wipes. \n\nDecided to polish, but couldn't find any Meguiars Plastic-X in my bag so went with 3D One. Low speed rotary pass with a Urofiber pad. Finished with a high speed rotary pass with a Rupes yellow pad.\n\nPanel Wipe then sealed with Cerakote wipes.\n\nThinking about getting an acetone vapor kit and toying around with only sanding 800/1000, acetone vapor, then coating.",
        "num_comments": 13,
        "comments": [
            "Make sure you use a sealant or it'll come back.",
            "I think it's an 04. My parents bought it brand new. After my mom got a new cadillac a few yrs ago she asked if I wanted it since I was daily driving project cars ",
            "I stated in my post that after sanding and polishing I did a panel prep and sealed with Cerakote.",
            "What sealant would you recommend?",
            "I recognized the headlights.  I meant to say 06, but the headlights are the same.  Bought it new and it was still running like a champ when I sold it with 165k.  Only problem was a stupid little sensor thats in the most inconvenient location at the back of the engine.  The transmission doesnt like it when you floor it, but other than that it was a great car.",
            "Nice good work. As long as you keep UV protect on it. Its gonna be good for years.",
            "Ive a variety of different sealants over the years. I just used cerakote to seal (I do a different process than their sanding) and it was stupid easy. I was gonna get a can of 2k but I saw lots of people saying good things about their headlight sealant. I also have used cerakote on the black plastic trim and it looks great so figured to give the headlight version a go.",
            "I normally just use UV clear coat after sanding down with 1000 grit. Like 2-3 coats is good. If you already got it looking at good as you did in the pics then just get some spray on ceramic coat from Turtlewax and apply it every month during a wash.",
            "Mine is the last year before the started using CVT's. 170k mostly trouble-free miles. Replaced a few sensors. Shifts great at full throttle, shifts hard at light throttle going 1st to 2nd. I'll replace the shift solenoid soon.",
            "Yessir, it's been my go to process for years. I just stay too busy to get to my own stuff most of the time."
        ]
    },
    "Auto Detailing Software": {
        "title": "Auto Detailing Software",
        "score": 2,
        "url": "https://www.reddit.com/r/AutoDetailing/comments/1dr9zbi/auto_detailing_software/",
        "content": "I am in the process of drawing out some plans for some auto detailing management software for those of you who run businesses/side hustles. I noticed one of my buddies uses a bunch of different platforms to try and manage his business and there might be some real value I can bring to help manage it better. Thoughts on some things that the industry is still missing that I could pile into one software to make it easier for everyone?",
        "num_comments": 0,
        "comments": []
    },
    "How do I stop this from twisting on itself?": {
        "title": "How do I stop this from twisting on itself?",
        "score": 59,
        "url": "https://i.redd.it/ybpgdy5pkc9d1.jpeg",
        "content": "I’ve tried untwisted it, rolling it on a reel, etc it’ll eventually always twist back up. Really annoying when trying to work around car. Also not to aesthetically pleasing when it comes to making content.",
        "num_comments": 24,
        "comments": [
            "Get a swivel connection for the end of the hose.",
            "Secure one end of the hose and walk away with the other end of the hose until you almost reach the maximum length of the hose. Then untwist and let it sit out in the sun for a bit like this.",
            "Lie the hose in the sunshine for a bit. Google video to learn over under winding technique. All done.",
            "Dont just jerk on the cable. Use your arms like a wire spool and roll it out instead",
            "Take your pressure washer gun and twirl it. Its not that big of a deal for me.",
            "Yep, what he said.\n The SWIVEL is the FASHIZZEL",
            "Idk, but what are you detailing? Looks cool",
            "A moderate understanding of physics would be a good start, after that maybe try a swivel connection",
            "All of the above, but also just lay it out in a straight first",
            "Got a good recommendation for swivels?"
        ]
    }
}