{
    "F-35 enjoying some baseball ": {
        "title": "F-35 enjoying some baseball ",
        "score": 5295,
        "url": "https://v.redd.it/k0mtcxxtxx7d1",
        "content": "",
        "num_comments": 225,
        "comments": [
            "Remember when people would peak over the fence at baseball games back in the day? Yeah lol",
            "If his team dont win just bomb the stadium",
            "Now a real baller would call their HR shot and hit the F35…",
            "The fact it is able to hover that stable AND turn in a way that they can “see” the field of play is astonishing",
            "Show this to someone in 1939 and blow their fucking mind",
            "Two questions:  that plane is pretty high… can you feel the wash on the ground?  Always wondered how much power it takes to make it just sit there \n\nSecondly, is it just typical fuel use to do that?  Or do they have to burn at a higher rate?",
            "When you can’t afford a ticket so you have to hover in your F-35 to watch the game.",
            "Great now you made the plen leave why would you stare at him you know he’s shy",
            "Most expensive seat at that game",
            "Hey! You freeloader, buy a ticket like everyone else!"
        ]
    },
    "When planes hold hands…": {
        "title": "When planes hold hands…",
        "score": 348,
        "url": "https://i.redd.it/apibjppkb18d1.jpeg",
        "content": "taken at Heathrow a little while ago ",
        "num_comments": 35,
        "comments": [
            "dude she's a virgin. bad touch",
            "It was just the tip!",
            "Didn't this happen a few months ago, too?",
            "Like a virgin, touched for the very first time.",
            "Sooo much paperwork",
            "Considering how Virgin and BA used to be sworn enemies, it's nice to see them close and holding hands.",
            "Tis but a flesh wound.",
            "But isn't the Virgin toutching the BAs tail section? 🤔",
            "Don’t you fly away you beautiful virgin. I am never gonna let you go. Let’s switch on the PA system and say our vows right here. 💒",
            "Safe to say she ain't a Virgin no more"
        ]
    },
    "Pushback tug caugh fire in CDG": {
        "title": "Pushback tug caugh fire in CDG",
        "score": 1295,
        "url": "https://v.redd.it/8u2nrfu4uy7d1",
        "content": "",
        "num_comments": 87,
        "comments": [
            "Airport firefighters have the coolest shit!",
            "I’d be closing that cockpit window lol",
            "My first thought was to close the window when I saw that firetruck. I would not want to get sprayed in the face with that water pressure.",
            "When was that? Just flew out of CDG this morning",
            "I'm impressed with the tug driver trying to get it away from the plane... that was \"above and beyond\".",
            "Roasted Radome anyone?",
            "Henri! Get the burger patties! The grill, she is ready!",
            "Does the 777 have to be inspected now even tho it seems to be a bit distant from the fire? Like maybe open the radome up to see if there is heat damage?",
            "*flambé* 🧐",
            "Well that sucks...\n\nI guess everyone get deplaned and the plane inspected before use it again"
        ]
    },
    "Southwest flight flew just 525 feet above Oklahoma town, triggering altitude warning": {
        "title": "Southwest flight flew just 525 feet above Oklahoma town, triggering altitude warning",
        "score": 1371,
        "url": "https://www.cnn.com/2024/06/20/us/southwest-flight-low-altitude-warning-faa/index.html",
        "content": "\n",
        "num_comments": 232,
        "comments": [
            "Sounds like somebody didn't have the visual approach backed up by an instrument approach, maybe.",
            "What in the hell is going on over there?",
            "Reminds me of when they landed at the Branson airport and nearly went off the edge",
            "Down close over that Hawaiian aqua-marine I understand, but what are they trying to get a close-up look at in Oklahoma?",
            "What is happening at Southwest lately.",
            "500 ft at 9 miles out smh",
            "Someone is getting called into the chief pilots office.",
            "Apparently Tower called the pilot to ask \"what's going on over there\" \n\nFirst Officer said \"That MiG really screwed him up. I don't think he can make it back.\"",
            "Hey, SWA are you ok?",
            "TERRAIN TERRAIN"
        ]
    },
    "Did a double take seeing this taxi at DFW today! ": {
        "title": "Did a double take seeing this taxi at DFW today! ",
        "score": 333,
        "url": "https://www.reddit.com/gallery/1dlh8zm",
        "content": "",
        "num_comments": 40,
        "comments": [
            "AA heritage fleet.",
            "Didn’t you hear? They reanimated Howard Hughes’ corpse and he in turn did the same with TWA!",
            "I had forgotten that American Airlines bought TWA.  I liked it better when there were lots of cool airlines.",
            "A very stately 373-800. I remember that livery from childhood, at least I think I do.",
            "I saw it there parked next to the plane I was getting on. I did a cartoon-level double-take. \n\nIt put a big smile on my face though!",
            "Trans World Airlines.. been a long time.",
            "does it have teeny little ashtrays at every seat, that I can spend a while toggling their lids back and forth to ease the boredom?",
            "I love those heritage tales.",
            "When I was a kid, a friend of the family’s was a mechanic for Pan American Airlines. He said that the joke around Pan Am was that TWA stood for “Teeny Weeny Airlines.”",
            "This reminds me of how much I still despise Carl Icahn. That man murdered TWA."
        ]
    }
}