{
    "Just another day as a rampie..": {
        "title": "Just another day as a rampie..",
        "score": 833,
        "url": "https://i.redd.it/i1g8um5ore9d1.jpeg",
        "content": "Tailstrike anyone?",
        "num_comments": 80,
        "comments": [
            "tiss but a scratch!... \n\nbut yeah that Q400 needs a wee bit of work.",
            "Ouch! That’s more than a little scrape.",
            "Porter is having a tough day",
            "Those 5 flight attendants have he rest of the day off, they just don't know it yet",
            "You guys are the unsung heroes of aviation. Appreciate all that you do!",
            "Just curious, do tail strikes happen more than we think? How much tail strikes have you seen throughout your experience?",
            "That’s what you get for hiring DC-3 pilots.",
            "Looks like he scraped off the knob or skid that actually protects the aircraft, he really over rotated",
            "Somebody’s got some paperwork to do…",
            "ECAM: AFT DRAIN MAST HEAT FAULT"
        ]
    },
    "The Hughes H-1 Racer, a personal favorite! ": {
        "title": "The Hughes H-1 Racer, a personal favorite! ",
        "score": 1164,
        "url": "https://i.redd.it/chzwckyh9d9d1.jpeg",
        "content": "The Hughes H-1 Racer, designed and built by Howard Hughes, is often regarded as one of the most beautiful planes ever built. This aircraft, also known as the H-1, was a significant achievement in aviation history and played a pivotal role in setting world speed records.\n\nHoward Hughes, a renowned aviator and entrepreneur, was deeply involved in the development of the H-1 Racer. The aircraft was designed to be the fastest landplane in the world, and on September 13, 1935, Hughes achieved this design goal by flying the H-1 to a new world speed record of 352.322 mph. The H-1 Racer was characterized by its sleek and streamlined design, with wings that fair into the fuselage with a smooth and gracious curve, creating a visually striking and aerodynamically efficient aircraft.\n\nThe H-1 Racer was a testament to Hughes' passion for aviation and his pursuit of pushing the boundaries of speed and performance in aircraft design. The aircraft's significance is underscored by its association with Howard Hughes, a prominent figure in aviation history, and its contribution to advancing aeronautical engineering and speed capabilities during its era.\n\nThe legacy of the Hughes H-1 Racer continues to captivate aviation enthusiasts and historians, serving as a symbol of innovation, speed, and the pursuit of excellence in aircraft design.",
        "num_comments": 55,
        "comments": [
            "Not gonna look it up but memory tells me an exact replica was built and was so accurate it was designated serial number 2. Crashed while returning home from Oshkosh and Pilot died . Original also crashed. If I remember correctly BOTH crashed because of failure of the electric propeller control.",
            "I want them rivets flush you hear me boy!\n\nOh and it's the first time I've seen this plane and it's beautiful, I'm making an RC version.",
            "Why are we looking at AI generated images of planes here?",
            "Both of these images have been completely disfigured by an AI, probably for upscaling or sharpening or something g.",
            "Phallic on so many levels. <3",
            "How to land this thing?",
            "A year earlier sea planes where flying 100 m/h faster, any reason why a landplane would be slower?",
            "What's the aircraft in the bottom picture. Any info?",
            "Whats with the alien in the top plane.\n\nface look weird as hell",
            "Both images are made with AI…"
        ]
    },
    "Southwest flight departed Portland, Maine via closed runway and maintenance personnel had to move out of the way in time.": {
        "title": "Southwest flight departed Portland, Maine via closed runway and maintenance personnel had to move out of the way in time.",
        "score": 566,
        "url": "https://www.reddit.com/r/aviation/comments/1dqrusv/southwest_flight_departed_portland_maine_via/",
        "content": "https://x.com/thenewarea51/status/1806686571997061489\n\n> Southwest 737 departs Portland, Maine on a closed runway and maintenance personal scramble to get off the runway.\n\n> June 25th, 2024 Portland International Jetport - KPWM. SWA4805 was flying from Portland to Baltimore early Tuesday morning. The airport Air Traffic Control tower was closed at the time because they do not open until 5:45 AM. Portland has to runways that intersect 18/36 and runway 11/29. Runway 11/29 was NOTAM’d closed for maintenance until 5:45 AM. When the tower is closed, aircraft self announce on the tower frequency and this is so other aircraft know if someone else is at the airport. 2 other flights were also departing around the same time and were talking on the frequency and self announcing.\n\n> Southwest was apparently not talking on the tower frequency but were heard talking to Boston Center who gave them their clearance. The maintenance personnel advised the tower controller of the situation and even though the tower was closed at the time, the controller was getting ready for their shift and witnessed the event including broadcasting that runway 11/29 was closed. The Boston Center later asked the Southwest flight if they had departed runway 29 and they said yes. The controller asked them if they knew it was closed until 5:45 and the pilot responded with a yes. They said there were no markings and they departed after it was open and the controller advised them that they departed at 5:42 AM. \n\n> Thankfully the runway maintenance crew had situational awareness and got off the runway in time before a potential disaster occurred.\n\nI'm imagining the maintenance personnel moved while the flight was barreling down the runway, but I'm guessing in reality they moved as soon as they saw the flight lined up for takeoff.",
        "num_comments": 124,
        "comments": [
            "If it’s closed, then why could they taxi a 737 onto the runway without seeing a huge illuminated X or any signage?   Fix our notam system.",
            "So based on the ATC recording the pilots thought that it was already after 5:45AM, right?\n\nEdit: looks like the flight is regularly scheduled for between 5:40-5:55 AM; must have finished boarding and pushed back early that day.",
            "Man, Southwest is having a rough summer so far.",
            "Hot take, if they had to “scramble” to move from the runway 3 minutes before it was NOTAM’d open, they weren’t going to have it open in time.",
            "Thank god this Flight 4805 got off the ground in time.",
            "The chief pilot has to be miserable these days.",
            "Somehow someone will blame Boeing",
            "Alternate headline to appear on CNN tomorow:  Boeing Aircraft narrowly avoids hitting airport workers when it took off from a closed runway...",
            "I know there’s a serious air traffic controller shortage, but it seems like a terrible idea for an airport large enough to have a regular 737 route to be an uncontrolled airfield during periods of scheduled, routine commercial flights. Is this at all common? I assumed uncontrolled fields were only acceptable for small local airports that serve Cessnas or maybe the occasional leisure jet",
            "I suspect there was no actual risk of a collision here. The pilots probably saw the truck doing the final FOD check. Instead of waiting off the runway like they should, they decided to line up and wait for the workers to finish their check. This very reasonably frightened the workers and they did the right thing and got off the runway. Unfortunately the pilots interpreted this as the workers being done with their check rather than them fleeing and decided they might as well leave a few minutes early and that no one would notice. \n\nIf what I’m thinking is the case, this is super sloppy stuff that has no place in aviation and it definitely WAS dangerous, but more in a “you took off on an uncleared runway and disregarded basic procedures” way rather than a “you almost ran over a pickup truck” way."
        ]
    },
    "Is flying over the Black Sea an unnecessary risk at the moment?": {
        "title": "Is flying over the Black Sea an unnecessary risk at the moment?",
        "score": 42,
        "url": "https://www.reddit.com/r/aviation/comments/1dr6kk7/is_flying_over_the_black_sea_an_unnecessary_risk/",
        "content": "Hi, r/aviation! My kids have recently started to take a liking to Georgia, and have asked me numerous times if we could plan a vacation there. The problem is that we’re in Poland, and such a trip would require taking a flight that would cross the Black Sea. Knowing how trigger happy the Russians are with passenger airliners and the fact that there are active hostilities taking place on the surface of the sea, is my fear of flying over that specific body of water justified? Or am I over-reacting?",
        "num_comments": 14,
        "comments": [
            "All the airlines fly over the black sea in order to avoid the airspace of Belarus, Ukraine and Russia. I don’t think you should be concerned.\n\nStay updated on the current political situation in Georgia, though. That ought to be a much more significant security consideration, imo.",
            "Airlines flying from Poland will avoid the same trouble spots as other airlines do.",
            "Looking at FlightRadar24, it seems that planes are actively avoiding the northern parts of the Black Sea. Lots still seem to be going over the southern part and I've not heard of any planes being downed so you're probably fine?\n\nPersonally I'd more be asking myself if I want to take a holiday in a country that borders Russia right now.",
            "Pretty much all aircraft will go to great lengths to avoid Ukrainian airspace and EU Member states will not fly into russian airspace unleß it's an emergency.",
            "As an airline pilot I fly over black sea on daily basis. No serious threats except gps signals lost.",
            "I've flew into Georgia several times in the past two years.  Also Russia is extremely positive towards Georgia at the moment as they have a pro-Russian government, who just brought in a so-called Russian law.  There is an extremely small risk currently.  \n\nI recommend Gino Paradise, for the kids if you do go.  It's also for adults of course.  After paying in you are provided a wrist band which you use to pay for everything, drinks etc.  Loads of pools, slides, bars, sun bathing etc etc.  It's a great day out.  Be sure to bring sun cream!",
            "To answer the question in the title, yes I think so. Even if the risk is really small is it worth taking?\n\nMaybe make a stop in Istanbul or Athens so you stay far away from the north part?",
            "Thanks. That was the other concern.",
            "Yeah, but Poland is in NATO and has the means to defend itself. Georgia is not in the same position.",
            "Yeah I'd also say that bordering Kaliningrad is not the same thing as sharing a border with mainland Russia."
        ]
    },
    "This morning as I was flying out of RDU I got to see both SAM 28000 and SAM 29000 — aka Air Force One — it was really cool to see both together! While most here are likely aware, they are essentially identical and serve as backups to each other.": {
        "title": "This morning as I was flying out of RDU I got to see both SAM 28000 and SAM 29000 — aka Air Force One — it was really cool to see both together! While most here are likely aware, they are essentially identical and serve as backups to each other.",
        "score": 775,
        "url": "https://i.redd.it/qwsoo0bf6c9d1.jpeg",
        "content": "",
        "num_comments": 51,
        "comments": [
            "I’d be interested in the nuances between them. I have friends n the 89th but none that fly those girls. Like the flagship in my wing is known to be a hanger queen with tons of specific issues.",
            "*VC-25 pointing at VC-25 meme*",
            "\"This ramp ain't big enough fer the two of us...\"",
            "I wonder if they closed that runway while they were parked there.\n\nor if they made that runway arrivals only.",
            "Just curious, but wouldn't it be safer to have the backup parked somewhere else on the airport or even on another airport nearby?",
            "Is it really a different pain job or does the one on the left appear lighter because it’s facing the sun? The one one the right is on a bit of a shadow caused by the second level of the aircraft.",
            "What is the president doing there?",
            "what would be the choice for next iteration of air force 1 once 747 inevitably retires? 777? does 777 have similar internal space for all the goodies airforce one needs?",
            "Are they two hues of blue? Or is it just the picture?",
            "I've been involved in repainting one if these! Also not how the building below has the same difference in appearance while its painted the same color on the walls."
        ]
    }
}