{
    "Weekly Help Thread - June 24, 2024": {
        "title": "Weekly Help Thread - June 24, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/awardtravel/comments/1dn9umc/weekly_help_thread_june_24_2024/",
        "content": "Welcome to the daily help and question thread!\n\nThis thread is renewed weekly and is intended for all discussions or questions that do not warrant their own thread.\n\nFor AWARD BOOKING HELP please read the following information:\n\nVolunteers may choose to help you find your award trip. But please don’t expect us to plan out your trip for you.  No stranger on the Internet could know what is BEST for you.\n\n**The more specific information you provide, the easier it is for people to give specific advice.  Also, we prefer to teach people to fish, rather than just giving you a fish.  So before you ask someone to help, please read** [**Our Wiki**](https://www.reddit.com/r/awardtravel/wiki/index)**, if you want to know what the best Redemption for you, take a look at** [**Award Hacker**](http://www.awardhacker.com)**.  Questions that shows you have at least tried to find an award are more likely to get answered.**\n\n* **Here are the information you should provide when requesting award assistance**\n* Origin and destination cities (are they flexible?)\n* Number of Travelers (Your chances of success goes down as this number goes up)\n* One way or round-trip\n* Class of service desired\n* Desired date(s) of travel (are they flexible? Hard dates == Less Chances for success)\n* Your points balances: all airline, credit card and hotel points (If you are looking for J/F, think at least 6 digits)",
        "num_comments": 216,
        "comments": [
            "Can I transfer UR and MR to 1 single transfer partner? As long as the name matches the account it's going into? For example, if I were to transfer 1,000 UR to AF and 1,000 MR to AF.",
            "Have an ANA flex itinerary through AC that I wanted to change close-in (T-7). Call in per the recommendation, but agents tell me they can see the space but can't book it \"due to issues with ANA\". \n\nHave seen sporadic DPs on FT and elsewhere that suggest calling in will work far out, but not close-in. Is this agent-dependent and I should keep HUCAing or is close-in a definite no-go?",
            "Would you guys rather fly JFK-HND ANA F, then 7 hour layover, then 7 hour economy via Thai Airways (28 hours of travel total), or JFK-SIN SQ 19 hours, 2 hour layover, then 2 hours of flight to BKK, all on J class? I'm having a tough time deciding since ANA's first class is so good compared to business on SQ, but there's a convenience factor. My brain says fly SQ, heart says fly ANA.\n\nedit: booked the SQ J class, decided convenience>comfort for a 20+ hr flight lol. I will be releasing my 7/12 JFK-HND 1:50PM EST ANA F flight tomorrow probably, I'll coordinate with first one to message me with a time that they will be on for chat if they want to try and grab it from me.",
            "Has anyone been able to transfer/pool Hilton Honors points in the past week or so? I have been getting the \"Unfortunately, we cannot complete your transaction at this time\" error message for days now.",
            "Silly question, when checking in for a partner award flight, do you check in with the portal you booked with or the partner who's operating the flight? Booked JL on BA.",
            "Hey All,\n\nI just booked a flight on United through Air Canada for the first time. Is there a way that I can link my Mileage Plus account to my Air Canada reservation? I have the United reference code but the agent in chat with United said they were getting an error and I needed to \"contact the travel agency that I booked through\". Anyone had any success linking through reference numbers?",
            "I am playing around with flights from Miami to Roatan Honduras. After doing some research with award travel, the best option i found is 22,000 avois miles + 70 dollars in tax via BA.  my question is, i was told that it could take 48 hours for MR to transfer. i already went ahead and transferred the points. the points is already showing on my 'avios' balance via the BA shopping page but i cannot book via BA as it shows 0 balance on the book flights page...do i still have to wait the 48 hours until it posts?",
            "Anyone else having trouble using lifemiles search? Keeps erroring for me",
            "Flying out of Miami tomorrow on Iberia J. Should I do the AA flagship lounge, or centurion?",
            "Flying on ANA into HND from JFK on first class and then have a separate economy ticket to another country 7 hrs later. Any chance the ANA first class lounge will let me in?"
        ]
    },
    "Monthly Award Opportunities Thread for June 2024": {
        "title": "Monthly Award Opportunities Thread for June 2024",
        "score": 15,
        "url": "https://www.reddit.com/r/awardtravel/comments/1d5jnoj/monthly_award_opportunities_thread_for_june_2024/",
        "content": "This thread is for sharing valuable awards you may have found in your searches.\n\nIt can be rare J/F seats that you don't normally find and also award nights at popular destinations.You can also coordinate cancelling flight and hotel reservations.Asking for compensation of any type is not allowed.\n\nOff topic posts will be removed.",
        "num_comments": 145,
        "comments": [
            "Lots of Andaz Tokyo availability released going into the end of year - may need to search increments of 3 or 4 night stays. Just booked ours for November 15-19.",
            "AA has some decently priced web specials to SYD towards the end of calendar.\n\nPrice depends on departure airport, but for example you can fly 4 people NYC-SYD on 4/28 or 4/29 for 60k each.  PHL-SYD on 4/29 has space for 4 in F for 70k each.",
            "Lol Delta's TPAC routes out of SEA must be not be doing that well, but 9x 7/3 SEA to HND in D1 for 95k Flying Blue (probably bookable on VS, but they have some tech issues so call in for this).\n\nSeems like this is a once per month drop with a lot of seats. It's in advance enough \\~3ish weeks for planning purposes.",
            "Massive dump of standard (120k) award nights at Conrad Bora Bora for this summer (through early October).",
            "Is anyone in need of 2 J class seats (Japan Airlines) - HND to SFO - 3/11/25?",
            "MIA to CDG AF Biz via Virgin next april 47k 200$ taxes",
            "Not sure if this is the proper forum, but I just got an alert that the Grand Hyatt Singapore is available for points bookings once more for the two standard room types. Looks like a good alternative to the Andaz.",
            "Not the most premium since it's the 763, but there's a healthy amount of JFK to LGW in D1 for 69k Flying Blue miles on 7/13, 7/16, 7/29, 7/30, 8/5, 8/6",
            "SFO-NRT, 1x JAL F Class July 23 2024",
            "Seeing 1x J JX LAX - TPE for many dates March 2025"
        ]
    },
    "Initiated a transfer from Chase to Flying Blue yesterday and still no points?": {
        "title": "Initiated a transfer from Chase to Flying Blue yesterday and still no points?",
        "score": 0,
        "url": "https://www.reddit.com/r/awardtravel/comments/1drc5z1/initiated_a_transfer_from_chase_to_flying_blue/",
        "content": "I see the blogs and posts all saying the transfer is instant but we transferred yesterday around 1800 and we only received the “transfer in progress email”. Any idea how long it may actually be? We have the seats on hold but the hold expires Monday. ",
        "num_comments": 4,
        "comments": [
            "It is typically instant. It can take 2-3 business days.",
            "just be patient. sounds like your first time transferring",
            "I've had Flying Blue transfers complete instantly and some take days and in the process, lost out on the award space while waiting.\n\nIt's a bit of a crapshoot.",
            "If you are asking for help finding flights or hotel rooms, please ensure that [Rule 5](http://www.reddit.com/r/awardtravel/wiki/rules) is being followed. Low-quality posts may be deleted without warning.\n\nIf you have an ANA question, please read [An Overview of ANA Award Bookings] (https://old.reddit.com/r/awardtravel/comments/11puibl/an_overview_of_ana_award_bookings/).\n\nr/awardtravel is a place to discuss anything related to redeeming airline miles & hotel points.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/awardtravel) if you have any questions or concerns.*"
        ]
    },
    "Upgrading Lufthansa flight": {
        "title": "Upgrading Lufthansa flight",
        "score": 0,
        "url": "https://www.reddit.com/r/awardtravel/comments/1drb9y1/upgrading_lufthansa_flight/",
        "content": "I booked round trip Lufthansa flights for October via aeroplan. Is there an option to upgrade directly with Lufthansa to business class? There is an option to bid on premium economy. Will biz open up closer to October? Plenty of seats open to pay cash for now. Any experience? ",
        "num_comments": 5,
        "comments": [
            "lol. Plenty of Biz seats for sale any point over a month in advance means nothing. In the 2 months before departure, I saw a Charlotte => Frankfurt flight I was eyeing for a potential upgrade certificate go from 2 of 37 booked in Biz to 36/37 in Biz.\n\nDont think theres any way to achieve what you want to do. If Biz awards appear, you can cancel & rebook",
            "Exactly, the business people that fly business class dont book way in advance",
            "This always surprises people for some reason. Its not just booking last minute but changing plans completely the day before a flight.",
            "Yeah I book 3-4 weeks out max when traveling for work. And have also had to rebook a group of 6 last minute",
            "If you are asking for help finding flights or hotel rooms, please ensure that [Rule 5](http://www.reddit.com/r/awardtravel/wiki/rules) is being followed. Low-quality posts may be deleted without warning.\n\nIf you have an ANA question, please read [An Overview of ANA Award Bookings] (https://old.reddit.com/r/awardtravel/comments/11puibl/an_overview_of_ana_award_bookings/).\n\nr/awardtravel is a place to discuss anything related to redeeming airline miles & hotel points.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/awardtravel) if you have any questions or concerns.*"
        ]
    },
    "IHG Redemptions ": {
        "title": "IHG Redemptions ",
        "score": 0,
        "url": "https://www.reddit.com/r/awardtravel/comments/1drb19p/ihg_redemptions/",
        "content": "Hi. I am big into Chase Ultimate rewards and have a few hundred thousand points banked for a nice trip. I was looking to transfer to IHG as I see some very nice resorts, but each night is 145,000 points. Is that typical for IHG and is it even worth transferring to there? Why is it so much per night? \n\nWould it be better to: \n\n1) only use Hyatt or \n2) can you find good rewards on Marriott ",
        "num_comments": 12,
        "comments": [
            "No one transfers to IHG. You would quite literally be better off using the portal and a 1.25 or 1.5 x Sapphire bonus",
            "IHG points are very well tied to the cash price of their properties at about $.005 per point. Yes, half a cent. There is a reason why their Co-branded cards get 3 points per dollar on regular spend. Generally transferring to IHG from Ultimate Rewards is a poor value outside of some specific use cases.\n\nNot all points are created equal is the lesson here.",
            "In addition, can often also buy the points to top up, since theyre often on sale at 0.5cpp\n\nSince CSR/CSP transfers to cash or cash equivalent at 1.25-1.5cpp, that should be your floor",
            "What about Marriott? Or is Hyatt the only one thats worth it?",
            "The short answer is Hyatt is the only hotel partner worth the transfer.\n\nIf you want to stay at IHG properties regularly, the IHG Premier and IHG Business Premier are good cards as long as you can use the free night certificate every year. You'll get a good return when you use the card at IHG properties. I wouldn't use them for everyday spending because the points value is too low.",
            "This is still a bad choice you can buy an IHG or a Marriott point at less than a cent, so it is always better to purchase points and redeem for statement credit for a top up",
            "If you have more than enough points for your future plans then its not a bad idea at all to top up if its not too much and you dont want to pay cash",
            "You missed the point. You can buy points for less than a cent each, so transferring 1 UR/MR is worse than just redeeming for statement credit and buying points.",
            "IHG sure. Marriott, not always, youd need a good enough purchasing bonus and no transfer bonus",
            "The only time people typically transfer to Marriott or IHG is top up their balance to get what they need. Usually not to cover the whole balance.\n\nHyatt is the only one thats almost always worth it.\n\nIf you want Marriott or IHG points its much better to just get SUBs for their respective cards. Marriott regularly has 5x 50k FNC offers"
        ]
    }
}