{
    "Weekly Help Thread - June 24, 2024": {
        "title": "Weekly Help Thread - June 24, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/awardtravel/comments/1dn9umc/weekly_help_thread_june_24_2024/",
        "content": "Welcome to the daily help and question thread!\n\nThis thread is renewed weekly and is intended for all discussions or questions that do not warrant their own thread.\n\nFor AWARD BOOKING HELP please read the following information:\n\nVolunteers may choose to help you find your award trip. But please don’t expect us to plan out your trip for you.  No stranger on the Internet could know what is BEST for you.\n\n**The more specific information you provide, the easier it is for people to give specific advice.  Also, we prefer to teach people to fish, rather than just giving you a fish.  So before you ask someone to help, please read** [**Our Wiki**](https://www.reddit.com/r/awardtravel/wiki/index)**, if you want to know what the best Redemption for you, take a look at** [**Award Hacker**](http://www.awardhacker.com)**.  Questions that shows you have at least tried to find an award are more likely to get answered.**\n\n* **Here are the information you should provide when requesting award assistance**\n* Origin and destination cities (are they flexible?)\n* Number of Travelers (Your chances of success goes down as this number goes up)\n* One way or round-trip\n* Class of service desired\n* Desired date(s) of travel (are they flexible? Hard dates == Less Chances for success)\n* Your points balances: all airline, credit card and hotel points (If you are looking for J/F, think at least 6 digits)",
        "num_comments": 204,
        "comments": [
            "Hello award gang!\n\nLooking to snag a SFO-SGN on VN Business class for 102k via FlyingBlue.\n\nHow do I ensure I avoid the crappy A350s with the old Stelia Solstys seats? I've been seeing reviews from 2022 with the old seats. I would much prefer to fly on the A350s with the tried-and-true Cirrus reverse herringbones that are found in KLM/AF planes.\n\nThanks in advance!",
            "Can I transfer UR and MR to 1 single transfer partner? As long as the name matches the account it's going into? For example, if I were to transfer 1,000 UR to AF and 1,000 MR to AF.",
            "Have an ANA flex itinerary through AC that I wanted to change close-in (T-7). Call in per the recommendation, but agents tell me they can see the space but can't book it \"due to issues with ANA\". \n\nHave seen sporadic DPs on FT and elsewhere that suggest calling in will work far out, but not close-in. Is this agent-dependent and I should keep HUCAing or is close-in a definite no-go?",
            "Would you guys rather fly JFK-HND ANA F, then 7 hour layover, then 7 hour economy via Thai Airways (28 hours of travel total), or JFK-SIN SQ 19 hours, 2 hour layover, then 2 hours of flight to BKK, all on J class? I'm having a tough time deciding since ANA's first class is so good compared to business on SQ, but there's a convenience factor. My brain says fly SQ, heart says fly ANA.\n\nedit: booked the SQ J class, decided convenience>comfort for a 20+ hr flight lol. I will be releasing my 7/12 JFK-HND 1:50PM EST ANA F flight tomorrow probably, I'll coordinate with first one to message me with a time that they will be on for chat if they want to try and grab it from me.",
            "Has anyone been able to transfer/pool Hilton Honors points in the past week or so? I have been getting the \"Unfortunately, we cannot complete your transaction at this time\" error message for days now.",
            "How do I tell if “C” fares are or will be available?\n\nMy wife and I are planning a trip from DFW to MAD in Sep.  based on the short notice for the trip, I wasn’t really expecting to come across U fares. \n\nI’ll see if I can add a screenshot but I looked on ExpertFlyer for the preferred dates (+/- 3 days) and there were not U or C through AA but it looks like 7 C slots available if I booked through Iberia (same flight).  \n\nSorry if this is a dumb question, I’m still learning.  As I go through the wiki and other sites, it seems like phantom awards are a thing, not sure if I fully understand it.  \n\nIs purchasing a full fare economy and upgrading with miles a fool’s errand?\n\nThanks!",
            "Silly question, when checking in for a partner award flight, do you check in with the portal you booked with or the partner who's operating the flight? Booked JL on BA.",
            "Hey All,\n\nI just booked a flight on United through Air Canada for the first time. Is there a way that I can link my Mileage Plus account to my Air Canada reservation? I have the United reference code but the agent in chat with United said they were getting an error and I needed to \"contact the travel agency that I booked through\". Anyone had any success linking through reference numbers?",
            "We're thinking about going to the Japan F1 race next year and trying to figure out how we can best take advantage of our points. Would love some advice on flights/hotels in Tokyo! Here's the info we have right now:\n\n* Depart: LAX \n* Arrive: Tokyo\n* 2 adult travelers\n* Round-Trip\n* J or F would be great but I think we're a little low on points to make that work. Plus if we can save with a economy ticket and put some points towards hotels instead that'd be a bonus.\n* Flexible travel dates \n   * Aiming for a 10-14 day stay\n   * The race is April 4-6 so we want to be in-country by March 31st at the latest so we're not jet-lagged. \n   * We can shift the rest of the days either way, so come in earlier and leave soon after the race or start the trip with that weekend.\n* Points Balance\n   * 330K Chase UR Points\n   * 170K Hilton Points\n   * Hilton Diamond Status",
            "I am playing around with flights from Miami to Roatan Honduras. After doing some research with award travel, the best option i found is 22,000 “avois” miles + 70 dollars in tax via BA.  my question is, i was told that it could take 48 hours for MR to transfer. i already went ahead and transferred the points. the points is already showing on my 'avios' balance via the BA shopping page but i cannot book via BA as it shows 0 balance on the book flights page...do i still have to wait the 48 hours until it posts?"
        ]
    },
    "Monthly Award Opportunities Thread for June 2024": {
        "title": "Monthly Award Opportunities Thread for June 2024",
        "score": 16,
        "url": "https://www.reddit.com/r/awardtravel/comments/1d5jnoj/monthly_award_opportunities_thread_for_june_2024/",
        "content": "This thread is for sharing valuable awards you may have found in your searches.\n\nIt can be rare J/F seats that you don't normally find and also award nights at popular destinations.You can also coordinate cancelling flight and hotel reservations.Asking for compensation of any type is not allowed.\n\nOff topic posts will be removed.",
        "num_comments": 145,
        "comments": [
            "Lots of Andaz Tokyo availability released going into the end of year - may need to search increments of 3 or 4 night stays. Just booked ours for November 15-19.",
            "AA has some decently priced web specials to SYD towards the end of calendar.\n\nPrice depends on departure airport, but for example you can fly 4 people NYC-SYD on 4/28 or 4/29 for 60k each.  PHL-SYD on 4/29 has space for 4 in F for 70k each.",
            "Lol Delta's TPAC routes out of SEA must be not be doing that well, but 9x 7/3 SEA to HND in D1 for 95k Flying Blue (probably bookable on VS, but they have some tech issues so call in for this).\n\nSeems like this is a once per month drop with a lot of seats. It's in advance enough \\~3ish weeks for planning purposes.",
            "Massive dump of standard (120k) award nights at Conrad Bora Bora for this summer (through early October).",
            "Is anyone in need of 2 J class seats (Japan Airlines) - HND to SFO - 3/11/25?",
            "I know the focus of this thread (and subreddit) are J/F seats, but I just scored a pretty good redemption that I thought I'd share.\n\n40k virgin Atlantic points + $100 in taxes in fees for a multi city trip as follows: MSP-CDG, and then AMS-MSP. And since I used the 30% transfer bonus from Chase, it was actually 31k CUR points.\n\nThere was lots of availability in late August and September for this. Paris and Amsterdam weren't the only options - I also saw Nice, Marseille, Bordeaux, Lyon, Nantes, Rennes, and a few others at 40k + \\~$100 in fees roundtrip.\n\nAs long as you're starting and ending your trip at MSP, you should be able to find good availability.\n\n  \nEDIT: Just to clarify, this is in main cabin on AF and KLM.",
            "July 21-22nd business class for american for 60k USA to ICN South Korea. \n\nLGA -> DFW -> ICN\nLAX -> DFW -> ICN\nDFW -> ICN\n\nPretty nuts.",
            "MIA to CDG AF Biz via Virgin next april 47k 200$ taxes",
            "Not sure if this is the proper forum, but I just got an alert that the Grand Hyatt Singapore is available for points bookings once more for the two standard room types. Looks like a good alternative to the Andaz. ",
            "Not the most premium since it's the 763, but there's a healthy amount of JFK to LGW in D1 for 69k Flying Blue miles on 7/13, 7/16, 7/29, 7/30, 8/5, 8/6"
        ]
    },
    "International Hilton Hotels standard room for families?": {
        "title": "International Hilton Hotels standard room for families?",
        "score": 3,
        "url": "https://www.reddit.com/r/awardtravel/comments/1dr42bw/international_hilton_hotels_standard_room_for/",
        "content": "What are some hilton hotels that you have successfully booked for the family? We are 2 adults and 2 kids (5,12). Looking to book an international location with our free HH certificates but having a hard time finding standard availability for more than two. We are open to locations and available options.",
        "num_comments": 1,
        "comments": [
            "If you are asking for help finding flights or hotel rooms, please ensure that [Rule 5](http://www.reddit.com/r/awardtravel/wiki/rules) is being followed. Low-quality posts may be deleted without warning.\n\nIf you have an ANA question, please read [An Overview of ANA Award Bookings] (https://old.reddit.com/r/awardtravel/comments/11puibl/an_overview_of_ana_award_bookings/).\n\nr/awardtravel is a place to discuss anything related to redeeming airline miles & hotel points.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/awardtravel) if you have any questions or concerns.*"
        ]
    },
    "Booked ANA business seats through Virgin Atlantic for 60k, IAH-HND": {
        "title": "Booked ANA business seats through Virgin Atlantic for 60k, IAH-HND",
        "score": 9,
        "url": "https://www.reddit.com/r/awardtravel/comments/1dqqkyw/booked_ana_business_seats_through_virgin_atlantic/",
        "content": "looks like VS has caught up with ANA point inflation ([VS award chart for ANA](https://flywith.virginatlantic.com/gb/en/flying-club/airline-partners/all-nippon-airways/all-nippon-airways-spend-points.html)). I didn't know they'd increased their ANA award price until the agent told me it'd be 60k, instead of 47.5k. Now a round trip between the US and Japan will cost us 105k.\n\nI guess I had to pay 60k instead of 52.5k (half of 105k) because of my departure airport(?)\n\nHow much did it cost before the increase if we fly from the East Coast and IAH vs West Coast?",
        "num_comments": 40,
        "comments": [
            "yeah it happened back last month: [https://thriftytraveler.com/news/points/virgin-raises-ana-business-class-award-rates/](https://thriftytraveler.com/news/points/virgin-raises-ana-business-class-award-rates/)\n\nEast & Central US is the same rate (went from 47.5K each way to 60K)\n\nWestern US went from 45 to 52.5K\n\nANA also went through a devaluation in the spring for their own program so it was inevitable that was going to happen - [https://frequentmiler.com/the-ana-devaluation-its-not-all-doom-and-gloom/](https://frequentmiler.com/the-ana-devaluation-its-not-all-doom-and-gloom/)",
            "It's right there on the chart you linked-- Central & Eastern USA is 120k r/t.",
            "Meanwhile I just dropped 120k points for JAL F from DFW-HND\n\nFor the 60k point difference would have loved that ANA J lol",
            "You're referring to VA, but you linked to the VS site.",
            "If you are asking for help finding flights or hotel rooms, please ensure that [Rule 5](http://www.reddit.com/r/awardtravel/wiki/rules) is being followed. Low-quality posts may be deleted without warning.\n\nIf you have an ANA question, please read [An Overview of ANA Award Bookings] (https://old.reddit.com/r/awardtravel/comments/11puibl/an_overview_of_ana_award_bookings/).\n\nr/awardtravel is a place to discuss anything related to redeeming airline miles & hotel points.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/awardtravel) if you have any questions or concerns.*",
            "With the fuel surcharges you're definitely better off booking JAL through AA or AS miles now if you have them.",
            "this and F on ANA are still some of the best deals, especially since you can also do one-way vs r/T required via ANA direct",
            "How much was fees/taxes?",
            ":(",
            "How much did you pay in fees? Was it a single leg?\nI was scanning for business class seats from IAH -HND for 2025 and couldn’t find any"
        ]
    },
    "Alaska speculative transfer for Starlux J": {
        "title": "Alaska speculative transfer for Starlux J",
        "score": 0,
        "url": "https://www.reddit.com/r/awardtravel/comments/1dr4loq/alaska_speculative_transfer_for_starlux_j/",
        "content": "With the Bilt rent day promo coming up, I can transfer 50,000 points with the 50% bonus as a silver to get 75,000 Alaska miles. Ever since Starlux launched their routes to the USA, I have always wanted to try their J product (since I am a sucker for seats with doors). However, I don’t really care for actually visiting Taiwan, and I would most likely just be flying back to the US the next day or something.\n\nAs far as I understand, currently Alaska Mileage Plan is the only way to book these on points. I don’t fly Alaska often so I have never had the need to open up an Alaska credit card for points and I probably never will. \n\nI know from checking seats.aero that Starlux releases these seats to Alaska T-14 pretty routinely. And I am very flexible in being able to fly last minute and plan on taking this flight before 2024. My question is for those who have flown this product to or from TPE & US. Should I go ahead and speculatively transfer my points?",
        "num_comments": 9,
        "comments": [
            "Some peoples brains really fascinate me. Traveling like 30 hours roundtrip to sit on a cool plane seat and not wanting to visit another country is sure a choice.",
            "at least go somewhere else in asia...",
            "I flew LAX-TPE roundtrip in April for vacation and thought the product and service were great, but I can’t even begin to imagine wasting that many points and that much time to sit in a seat with a door. To each their own, though.",
            "If you are asking for help finding flights or hotel rooms, please ensure that [Rule 5](http://www.reddit.com/r/awardtravel/wiki/rules) is being followed. Low-quality posts may be deleted without warning.\n\nIf you have an ANA question, please read [An Overview of ANA Award Bookings] (https://old.reddit.com/r/awardtravel/comments/11puibl/an_overview_of_ana_award_bookings/).\n\nr/awardtravel is a place to discuss anything related to redeeming airline miles & hotel points.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/awardtravel) if you have any questions or concerns.*",
            "It’s not a routine last minute release. Only seen such last minute availability a few times and typically in only one of the two directions\n\nAbsolutely wouldn’t speculatively transfer, unless you have a few other ideas for what space you can find besides Starlux",
            "I just like trying out different products 😅. But I could theoretically stay in Taiwan and explore, I was just saying it’s not necessarily one of my top choices for travel",
            "Hm I have been tracking here and there and every time I have seen last minute seats released I thought it was pretty routine. Tbh it doesn’t matter which direction it gets released because I will be most likely taking united polaris the other way around",
            "You're quite literally there! It's not one of your top choices doesnt mean don't go check it out!!!",
            "You can probably trust your research in the short term (1-3 months) but longer than that can be quite unpredictable, esp w/ weekends or holidays if you’re aiming for those "
        ]
    }
}