{
    "Announcement: Changes Regarding Israel/Palestine Content in r/awfuleverything": {
        "title": "Announcement: Changes Regarding Israel/Palestine Content in r/awfuleverything",
        "score": 141,
        "url": "https://www.reddit.com/r/awfuleverything/comments/178udtl/announcement_changes_regarding_israelpalestine/",
        "content": " Hello r/awfuleverything community,\n\nWe want to inform you that we will not be permitting content depicting conflicts related to the Israel-Palestine war. \n\nSimply put, **our mod team is not equipped to handle these discussions effectively.**\n\nRecent articles, such as [this one](https://www.nytimes.com/2023/10/10/technology/hamas-violent-videos-online), highlight how groups like Hamas are using poor moderation to their advantage. Our team is comprised of volunteers, and we lack the resources and capabilities required for thorough fact-checking in an event as complex as this conflict. We want to avoid contributing to misinformation and ensuring the accuracy of content.\n\nFurthermore, this community is not well-suited to handle content like this. While the situation is undoubtedly awful, we initially disallowed political content for a specific reason. Time and time again, this subreddit has proven itself unable to discuss such topics in a civil and constructive manner.\n\nWe appreciate your understanding and cooperation in this matter as we strive to maintain the quality and integrity of our subreddit.",
        "num_comments": 0,
        "comments": []
    },
    "Wyoming teen killed protecting girlfriend was held down by one attacker while the second hacked him to death: prosecutors": {
        "title": "Wyoming teen killed protecting girlfriend was held down by one attacker while the second hacked him to death: prosecutors",
        "score": 221,
        "url": "https://nypost.com/2024/06/27/us-news/wyo-teen-killed-protecting-girlfriend-was-held-down-and-stabbed/",
        "content": "",
        "num_comments": 14,
        "comments": [
            "This is indeed awful. He was so young and so brave.",
            "This made me sad. Kid was so young and had his whole life in front of him.....",
            "*Locks cell, tosses key down well*\n\nWell, should be all set here",
            "It’s kind of strange that the headline says “hacked to death” but the text of the article says “stabbed twice.”",
            "This kid is my hero",
            "Why does the article show pictures of the victims, but not the perpetrators?",
            "Drag out the drownin' bucket.",
            "Man in Wyoming - that poor boys family is about to massacre the perpetrators families.",
            "Just toss the murderers down the well",
            "it does say their names and ages. shouldn’t be too hard to find photos."
        ]
    },
    "German woman given harsher sentence than rapist for calling him ‘pig’": {
        "title": "German woman given harsher sentence than rapist for calling him ‘pig’",
        "score": 1534,
        "url": "https://www.telegraph.co.uk/world-news/2024/06/28/german-woman-given-harsher-sentence-than-rapist-for-calling/",
        "content": "",
        "num_comments": 99,
        "comments": [
            "One of the gang raping pedophiles\n\n>Speaking about the rape in court, he asked: “What man doesn’t want that?",
            "Since when is the truth deflation? Germany, this is really messed up.",
            "Nein. Hans getting your pitchforkenheimer",
            "So they got light sentences because all of them were minors at the time, and she got a heavier sentence because Germany has very strict laws against hate speech. I do not agree with the court ruling by any means, but those seem to be the crucial details in this case.\n\nEdit: Jesus, people. I’m not defending their decision, just adding context because maybe 5% of people actually read the articles on Reddit posts past the headline.",
            "Maja R was sentenced to a weekend in jail after her comments because she had a previous conviction for theft and had not attending the court hearing for the case",
            "You can love or hate Jordan Peterson, I'm meh on him myself, but he does use an amazing term about people \"Being victims to their compassion,\" which has made me think more deeply than most quotes in the last few years. Being accepting and having equality is good, but this kind of thing goes so far that it is now being considered racist or bigoted to protect your own people, enforce your own laws. This has to change. The guests and refugees being taken in need to be aware they are guests and refugees, not the new masters, free to make their own laws to follow which the natives must embrace. Perhaps it is time to start considering an expulsion.",
            "man i wonder why the afd is getting so many votes",
            "Remember when Germany had the ‘Refugees Welcome’ banner haha",
            "Germany what the actual fuck. Words are more threatening than rapists? Rapists come in all ages. They deserve to be tried and convicted as adults.",
            "Seriously Germany what the actual fuck!"
        ]
    },
    "Women ages TEN?!": {
        "title": "Women ages TEN?!",
        "score": 860,
        "url": "https://i.redd.it/1rn24mj9oc9d1.jpeg",
        "content": "",
        "num_comments": 59,
        "comments": [
            "Women are sometimes capable of producing children at that age. It sucks a whole lot of ass that it happens but it's possible, so they have to include it in the data.",
            "I know it’s not the point, but I wonder why NY is so\nhigh.",
            "Awful as it is, it’s valuable and necessary data. Girls get periods at and even younger than 10. Pregnancies are possible at those ages so it is important to include this data.",
            "Calling a 10 year old a Woman though is weird. A 10 year old is a child.",
            "I feel like this is to include teen pregnancies since puberty for girls can start as early as 9. This isn’t about child brides",
            "Once a girl goes through puberty, she is capable of reproducing. Studies like this need to include females of all ages able to reproduce. Statistically correct. There's nothing wrong with it.",
            "Yikes Christian nationalists not gonna like this stat",
            "Well WV is the best at not killing moms.",
            "Now do the same for all the other “developed” countries in comparison. It’s shameful and horrific.",
            "Yes, ten. It sucks but that's the reality of the world we live in."
        ]
    },
    "Man fined for squirting mixture of urine and flour onto woman's dress to try to chat her up": {
        "title": "Man fined for squirting mixture of urine and flour onto woman's dress to try to chat her up",
        "score": 190,
        "url": "https://www.asiaone.com/singapore/man-fined-squirting-mixture-urine-and-flour-womans-dress-try-chat-her",
        "content": "",
        "num_comments": 26,
        "comments": [
            "Of all the bad ways to try to pick up a woman, I think this is actually the worst. ",
            "If that can’t get the ladies, nothing will",
            "“Hey babe, so uhhh you like piss and flour?”\n\nWTF 😂",
            "I have so many questions",
            "That's not how  pheromones work",
            "Ah the old piss flour rizz. Haven't seen it since the dark age.",
            "Hey guy. Stop stealing my moves.",
            "Is that some form of incel witchcraft or something?",
            "What in the actual F? He had the right idea with the flour butttt oh who am i kidding, i can't even pretend joke this ",
            "Couldn’t really work this one out even when it came out in the oval news"
        ]
    }
}