{
    "/r/aww is going OC-only": {
        "title": "/r/aww is going OC-only",
        "score": 1510,
        "url": "https://www.reddit.com/r/aww/comments/171dxph/raww_is_going_oconly/",
        "content": "Effective October 9, all /r/aww posts must be original content - content taken and/or owned by you.  All posts will be automatically tagged as OC; you will not need to do anything different.  Please continue to report content that is falsely claimed as OC.",
        "num_comments": 161,
        "comments": [
            "But who will farm the karma?",
            "FINALLY.\n\nOne more thread with annoying music and I would go insane.",
            "That’s a really good rule! 🙌",
            "I have to say I'm a big fan of the change in the content--it feels so much cozier and sweeter now, like a huge group chat where people share pictures of their own pets they just took.",
            "Good. Now do no kids.",
            "Imagine if this was the rule of the internet...",
            "This subreddit is now only cats",
            "Can we also go no dead pets please?",
            "Can this include news of the Grey and Harbor Seal pup seasons? I have my work calendar set to notify me when more of God's Perfect Fatsos will enter this crazy world and would like to spread The Good News.",
            "Very good! And an automatic repost detection would be great, too. \\*dreaming\\*"
        ]
    },
    "Will you marry me?": {
        "title": "Will you marry me?",
        "score": 2654,
        "url": "https://i.redd.it/99zebhtzeg9d1.jpeg",
        "content": "",
        "num_comments": 68,
        "comments": [
            "Yes and there will be no pre-nup & you can have my entire savings 🩵",
            "Makes me go meow meow...",
            "YES! A MILLION TIMES YES!",
            "Yes in all my nine lives!",
            "Sorry my Khajiit friend but I'm already married to a lusty Argonian maid.",
            "If I have a full bowl of whiskas every day then yes",
            "The cat is like: \"Dude, I'm just a cat. You need to figure out your life man\"",
            "Is this a munchkin cat ?",
            "YES I will!!! I thought you’d never ask 😻MEOW",
            "Look how round his little paw is. Haha"
        ]
    },
    "Saw this little guy while on line today": {
        "title": "Saw this little guy while on line today",
        "score": 2731,
        "url": "https://v.redd.it/bo43l6kcue9d1",
        "content": "",
        "num_comments": 131,
        "comments": [
            "Weird, I’m also seeing him while online",
            "Found a New Yorker lol.  I remember the first time I learned they say “on line” instead of “ in line” and it was weird. Like hearing people from southern Illinois who say “warsh”.",
            "“Can I pet that dawg….?”",
            "I think the dog put on his own harness",
            "Doesn’t matter if it’s a service dog or not (clearly not), my 5 year old cousin knew well enough to ask before petting a strangers dog.",
            "That dog is so dang cute. I'd lie down on my tummy so I can be eye level with it and play with it right in the middle of the store.",
            "Cute, but if he's not a service dog  he shouldn't be wherever he is. Ignorant owner, poor pup.",
            "People should stop normalizing bringing in animals to places they shouldn't be. \n\nThe floors and divider makes me think food place. Not dog place.",
            "What a gorgeous pup! 😍",
            "Awesome dog! 😀 That dog is all love! 😀"
        ]
    },
    "Almost took this lil guy home with me": {
        "title": "Almost took this lil guy home with me",
        "score": 1545,
        "url": "https://v.redd.it/5vi8c9s7ef9d1",
        "content": "",
        "num_comments": 37,
        "comments": [
            "This kitty’s seen some shit",
            "That's how we got our cat. My girlfriend was walking home from work and a banged up little fella got in front of her with the cutest of meow. We brought him to a shelter incase he was lost but put our names up for adoption if nobody came for their lost pal. Hes been our best friend for 4 years now.",
            "The meow was friendly and like it wanted to be loved. Hopefully it already has a home. If not, should find a home soon considering how friendly and loving it is 😀",
            "Go back to the neighborhood and ask around -- if he doesn't belong to anyone, take him home! He clearly likes you and needs you.",
            "Almost?!?! Do you kitty kitty bro?",
            "I think you were chosen",
            "Bring the cat home!! At least get him a flea bath.",
            "Sheeeeeet yeah I’d have to take him home immediately for a bath and a feast if that was me. You are stronger than i",
            "He wants to go home",
            "Almost? Commit to the save!"
        ]
    },
    "The face you make when your owners didn’t speak to one another and you get fed two dinners.": {
        "title": "The face you make when your owners didn’t speak to one another and you get fed two dinners.",
        "score": 6634,
        "url": "https://i.redd.it/lnybh9drsc9d1.jpeg",
        "content": "",
        "num_comments": 65,
        "comments": [
            "My dog can do a Jedi mind trick. I’ll drop a treat on the ground. Her snoot will wave over the treat and it’ll disappear with no visible chewing. Then she’ll look up at me like, “I thought you were going to give me a treat…” (sad puppy eyes) 🥺   \nAnd I’ll think, “Oh, I forgot to give you a treat!”  \nEventually I caught on to her Jedi mind games. Now if you’ll excuse me, I have to go. I’ve apparently forgotten to give my dog a treat…",
            "Your dog looks jacked.  Can you tell him some internet stranger is proud of his gains?",
            "My husband calls me after feeding the cat to tell me that the that the cat may pretend to be starving but it’s all a lie.",
            "My childhood cat once managed to get fed 4 times. She pestered my dad at 5 when he got up, so he fed her and then went off to the gym before work at 6. She then told my mum she hadn't been fed and got fed at 7 before she went to work. My sister was up at 9 to go to her job, and she told her she hadn't been fed and got fed again. Then I'd been working nights and she got fed when I got up at 11. \n\nWe all communicated better after that and made sure she was dewormed as we are pretty sure that is what caused the obsessive hunger.",
            "Our dogs were so deceptive growing up. We had a white board with a weekly chart where we literally would write down if we fed them so that we could all check there when they were begging. \n\nThe dogs also figured out the white board system and if someone forgot to write it down they’d still trick us sometimes 🤭",
            "We used to have to leave a note in our dog’s bowl. “Max already ate.” We learned this the hard way.",
            "when u work 9-5 but ur bf works 4-3am",
            "OMG, that's the dream dog life right there! Double dinners? I need to learn that face, like, yesterday! 🐶😂",
            "The long game finally pays out.",
            "Ah yes....that may be why my dog is a chonkers. We run him absolutely ragged when we let him out to the bathroom and he's still such a god damn chunk"
        ]
    }
}