{
    "r/Awww has a discord server!": {
        "title": "r/Awww has a discord server!",
        "score": 195,
        "url": "https://discord.gg/VruY5kvcmc",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Hippity Hoppity every image in there is now my property (imma steal the pet pics)",
            "How do I “get in there”? (Yeah Yeah)",
            "this sub is actually awwwye bleach",
            "Awww",
            "no way!",
            "This link still work?",
            "Soo cuteee",
            "aăaWaWWaWW",
            "awww",
            "beautiful"
        ]
    },
    "snug": {
        "title": "snug",
        "score": 2412,
        "url": "https://i.imgur.com/V18ifD3.gifv",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Nothing beats a cozy cuddle, too cute!",
            "I love this cute. I love this cute",
            "Oh Jesus he's getting speed cuddles you gotta fully commit or you're screwed!",
            "Trying to cast a spell on a him through eye contact.",
            "Safe cozy cuddles beat an unsafe cozy cuddle though! Hopefully they secured the kitten after filming this.\n\nDon't have any pet in a car like that. It's not cute when they become a deadly projectile during a car crash or when you have to make the harsh decision to either brake and crush the pet under the pedal or crash into something.",
            "It's such a boo boo head.",
            "Too cute. Too cute.",
            "Awwwww",
            "so cute",
            "adorable"
        ]
    },
    "How does bro know how to whisper": {
        "title": "How does bro know how to whisper",
        "score": 2144,
        "url": "https://v.redd.it/ut1dxnpu0g9d1",
        "content": "",
        "num_comments": 36,
        "comments": [
            "What did she give the dog in the end? Looks like beans",
            "He took \"inside voice\" to a whole new level",
            "haha amazing. how did he learn that.",
            "He's using his inside voice , good job whisper 👏",
            "Hahaha. He’s adorable! Mine knows if she barks one big bark at 4am, I’ll give her whatever she wants just to keep from waking anyone else. I wish she whispered it instead… 😅",
            "The cuteness. Pup haz it. Needs tummy scratches next.",
            "I taught my parrot to whisper but I doubt I could teach my dog 🤯",
            "I think this makes you the dog whisperer!",
            "My daughter has a border collie and he does thius as well. If he barks loud she tells him shosh quietly whisprer and he does it as well.",
            "We could use your training skills in our neighborhood"
        ]
    },
    "It's time to get a hug": {
        "title": "It's time to get a hug",
        "score": 742,
        "url": "https://v.redd.it/6aqujjalhh9d1",
        "content": "",
        "num_comments": 5,
        "comments": [
            "We don't deserve dogs 🥺",
            "I wish my dog would do that",
            "looks like he miss her so much,",
            "Lovely",
            "awww soo lovely"
        ]
    },
    "Will you marry me?": {
        "title": "Will you marry me?",
        "score": 1067,
        "url": "https://i.redd.it/iqw6ycx2fg9d1.jpeg",
        "content": "",
        "num_comments": 20,
        "comments": [
            "she had a look on her face that said, \"Why so small?",
            "You are now wed. Tadaa. No take backs.",
            "The paw is absolutely gorgeous!!!",
            "Omg how adorable is this kitty!\nWhat breed is the gorgeous cat?",
            "So cute and even has a diamond necklace on. I love ❤️ cats! 🐾❤️🐾🐈‍⬛🐾❤️🐾",
            "My heart can't take this level of adorableness. The answer of course would be yes.",
            "How can you not love that face?",
            "With a prenup you hugdigger",
            "The only marriage I can accept :)",
            "My little girl loves me and loves other people who are kind enough to visit.  She loves my two sisters who are here helping us this morning."
        ]
    }
}