{
    "Amazon's Study Hall - Daily Questions Megathread (06/29)": {
        "title": "Amazon's Study Hall - Daily Questions Megathread (06/29)",
        "score": 12,
        "url": "https://www.reddit.com/r/AzureLane/comments/1dr5c62/amazons_study_hall_daily_questions_megathread_0629/",
        "content": "Welcome to the [Daily Question Megathread](https://azurlane.netojuu.com/images/a/a8/Skin_BG_113.png)!\n\nHere you can ask questions/seek advice about Azur Lane, help each other and grow together!\n\n|Helpful Resources|\n|:-|\n|[Azur Lane Wiki](https://azurlane.koumakan.jp/wiki/Azur_Lane_Wiki)|\n|[Azur Lane Official English Twitter](https://twitter.com/AzurLane_EN)|\n|[Azur Lane Community Discord Server](https://discord.gg/FVgfdaN)|\n|[Azur Lane Official English Discord Server](https://discord.gg/WYjqf7P)|\n|[English Community Tier List](https://slaimuda.github.io/ectl/#/home)  (PVE Tier list, New player guide, PvP fleets)|\n|[Nerezza and Sam's Gameplay Help Picture Guides](https://docs.google.com/spreadsheets/d/1wWMIzaUKISAXMbOEnmsuuLkO9PesabpdTUWdosvHygM/edit#gid=1859764162)  (Gear Tier list, Shops and Crafting priority)|\n|[Samheart564's Guide Hub](https://samheart564.github.io/ECGC/)|\n|[Riceist's Newbie Guide](https://azurlane.koumakan.jp/wiki/User:Riceist/NewbieTips)|\n|[ALO/ALM PvP Guide](https://docs.google.com/spreadsheets/d/1BewmBsf4EWKAf_UwYax05c7ksL51y6sjs96pIwD73Jc/edit?usp=sharing)|\n|[Yostar Maintenance News Page](https://azurlane.yo-star.com/news/)|\n\n# IMPORTANT REMINDER TO BIND YOUR ACCOUNT!\n\n* JP players can bind via binding code, Yostar account, Apple or Play Games Services accounts. Twitter binding will no longer be supported by the end of 2023.\n* EN players can bind via Twitter account, Facebook account or Yostar account. Recommended to use Yostar Account due to uncertainty with Twitter and Facebook. These options are in [Settings](https://i.imgur.com/thwmHwZ.jpg).\n* Use at least one account bind option; use multiple if you want to be safe.\n* If your device is lost, damaged, or a game update breaks the app and forces you to reinstall you could permanently lose your account.\n* EN accounts are easiest to recover with an account bind; make sure to bind your account in the settings and only use the login screen binding buttons to reconnect your account.\n* Using the login screen buttons without a bound account will create a new account for you and effectively erase your progress with no way of recovering it outside of contacting customer support. JUST DO IT.\n* Make sure you are selecting the correct server and method of binding when using a new device.\n\n**NOTE:** It's also a good idea to remember your server and take a screenshot of your Profile Page so that customer support has an easier time recovering your account.\n\n# Detailed In-depth FAQ can be found [here](https://www.reddit.com/r/AzureLane/wiki/faq/).\n\n# Please read through it first before asking a question in here as the FAQ covers lots of common topics.\n\n&#x200B;\n\n|Other Megathreads|\n|:-|\n|[Weekly Lounge Megathread](https://www.reddit.com/r/AzureLane/search/?q=title%3ALittorio%27s%20Luxurious%20Lounge&restrict_sr=1&sort=new&t=week)|\n|[Guild Recruitment Megathread VIII](https://www.reddit.com/r/AzureLane/s/aLCh3jNAY7)|\n|[Wichita META Thread](https://www.reddit.com/r/AzureLane/comments/1dhoqbi/wichita_meta_thread/)|\n|[World 15 Megathread](https://www.reddit.com/r/AzureLane/comments/17dndm9/world_15_strategy_megathread/)|",
        "num_comments": 18,
        "comments": [
            "Can someone critic on Flandre and Felix Schultz? Asking because ECTL dont have description yet.",
            "Can someone please for the love of God explain the whole rate up thing.\n\nI've gotten 7 Z47s and not a single Alvitr despite the rate up am I just stupid or doing something wrong?",
            "Felix is Z23 on a gym day while Flandre is a predecessor to Alsace",
            "Oh so it's not added onto the base rate of getting a SSR?",
            "Fair enough. Cause I remember that Alsace is a modern iteration of Champy too.",
            "No those rate up ships have a flat boost",
            "Yep, I would say Flandre is the groundwork for Alsace since she also had a preload and 3 main gun mounts\n\nThe difference is that Flandre lacks the ability to hold 2 charges at once and Alsace have more skills though the marking debuff worked surprisingly similar",
            "Sorry if I'm being annoying and stupid but then how come I keep on getting Z47 over and over again?",
            "Yeah, not surprised considering she's an UR vs Flandre's SR. Interesting evolution nonetheless.\n\nFelix is the one I'm not really sure. I remember zenith said when LII was released that that LII was basically Felix but better. Basically power crept the heck out of her",
            "Because RNG said so and you keep hitting Z47's rate up?\n\nThere's no secret or hidden bias here, it's just RNG and the result tells that you'll get 7 Z47"
        ]
    },
    "Littorio's Luxurious Lounge - Weekly Gacha Posts, Dorm Screenshots and Discussions (06/24 - 06/30)": {
        "title": "Littorio's Luxurious Lounge - Weekly Gacha Posts, Dorm Screenshots and Discussions (06/24 - 06/30)",
        "score": 19,
        "url": "https://www.reddit.com/r/AzureLane/comments/1dn7d64/littorios_luxurious_lounge_weekly_gacha_posts/",
        "content": "Welcome to [Littorio's Luxurious Lounge](https://azurlane.netojuu.com/images/1/1c/Skin_BG_145.png), enjoy the freshly squeezed beverages supplied by Akashi while listening to South Dakota's performance. Share your gacha/map drop luck/salt, upload dorm screenshots and talk about things you feel don't warrant an entire thread but don't fit anywhere else. Also feel free to promote your guild here. Note that your questions should still go, and have better odds of being answered, in the Megathread linked below:\n\n[Amazon's Study Hall - Questions Megathread](https://www.reddit.com/r/AzureLane/search?q=Amazon%27s+Study+Hall+-+Daily+Questions+Megathread&sort=new&restrict_sr=on&t=day)\n\nNeed to Find or Advertise a Guild? Use:\n\n[Guild Recruitment Megathread VIII](https://www.reddit.com/r/AzureLane/s/aLCh3jNAY7)\n\nWant to discuss ongoing META Boss Fight? Use:\n\n[Wichita META Thread](https://www.reddit.com/r/AzureLane/comments/1dhoqbi/wichita_meta_thread/)\n\nMaybe you're stuck on World 15? Use:\n\n[World 15 Megathread](https://www.reddit.com/r/AzureLane/comments/17dndm9/world_15_strategy_megathread/)",
        "num_comments": 9,
        "comments": [
            "Damn, no Alvitr after using up all my cubes...She's the only one I actually wanted. Got 5 Z47's though lol. Hopefully I can get her through my daily pulls now I guess.",
            "Yep, plus tempesta and good BBV making it really easy\n\nDuring frostfall there's exactly 3 purple munition and purple BBV. Having ting an being your solo vanguard is suffering...",
            "*Horrible* luck this time. Started with 2170 cubes and it took 440 for just *single* Alvitr to grace me with her presence!\n\nOne Alvitr, four Z47 and three U-31 altogether.\n\n1730 cubes left, so I'll survive.\n\nI think.",
            "First 10x had Alvitr! (20 cubes)\n\nSecond 10x had nothing. (40 cubes)\n\nThird 10x had U-31! (60 cubes)\n\nFourth 10x had a Pola spook and no rate up. (80 cubes)\n\n5th 10x had Tallinn spook and no rate up. (100)\n\n6th 10x had a Zara spook and no rate up. Again. (120)",
            "Fun fact, you can complete all of the missions for clearing the art building without \"hull type\" at once\n\nhttps://preview.redd.it/kbsn8xt3799d1.jpeg?width=2340&format=pjpg&auto=webp&s=59f62183372d56bba344870dad3b8ba71aca3409",
            "Little Academy pull log:  \n  \nDay 1: 20x: Hipper-u, Dorsetshire, Houston, **U31** | Eugen, Terror, Hiei-chan |  \nDay 2: 20x: York, Wichita | **Z47**, Foch, Terror |    \nDay 3: 20x: Nelson, Suzuya | Howe, Deutschland, Balti-u, U31, **Altvir**  \n  \n---  \n  \n[Previous event](https://www.reddit.com/r/AzureLane/comments/1cw9d4g/littorios_luxurious_lounge_weekly_gacha_posts/l527g72/)",
            "Decided to try clearing EX with faction fleets, including the cats.  It worked better than expected.\n\nhttps://preview.redd.it/q3c06v8an69d1.png?width=1600&format=png&auto=webp&s=ac354caadbb35b59633b7889e067b52223db097a\n\nFleet 1 is basically just a variant of my Modney showdown team and the timing works out so that Nagato clears the last of the mobs then Shinano and Hakuryuu nuke the boss, so I think I'll leave it as is.  All my other teams could be improved upon, especially team 2; the RN is a bit lacking in heavy hitters.  \n\nI'm counting \"French\" as a single faction to make fleet 5 work.\n\nI'd do better if I had my wolfpack subs leveled because they'd actually have cats, unlike the fishpack I'm currently using, which doesn't.  It would also help if there were French cats or I relaxed my rules for factions without cats; right now fleet 5 also doesn't have any meowficers.",
            "I did the same thing except I separated Vichya and Iris, accidentally put in two RN fleets coz I wasn't paying attention and I was too lazy to put in cats.\n\nhttps://preview.redd.it/lt5nicaa699d1.png?width=1920&format=png&auto=webp&s=21f8adb0b4f52ef9859f1d8547c3da0503b3b6df\n\nAs you can see by Royal Fortune somehow getting MVP against the BB boss (wtf?) I was using a full Tempesta sub fleet."
        ]
    },
    "Succubus enjoying summer [Hindenburg]": {
        "title": "Succubus enjoying summer [Hindenburg]",
        "score": 658,
        "url": "https://i.redd.it/z2tjllva7h9d1.jpeg",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Damn i miss pika's seggsposting",
            "Pillow? What is that? My pillow is Hindy's voluptuous and curvy body! ![img](emote|t5_3p20d|7011)",
            "I will drag my tongue across every inch of her body",
            "Forget the pool, its dinner and i see a whole ass full course meal right in front of me",
            "Yes. Yes! Yeeeeeessssssss!!!!! - Plankton from Spongebob noises.",
            "The hotter Yinlin\n\n~~though tbf Yinlin is also very hot, and \"singing rain\"(?) is a pretty cool name~~",
            "By Demons we are Driven to the Iron Blood. \n\n... And also, by the sound effects she makes when jumping up and down.",
            "we all do",
            "[Twitter Sauce](https://x.com/2Cafenami6/status/1806975052728172648?t=YoZNUmbuD0AppkHJZSr6IQ&s=19)\n\n[Pixiv Sauce](https://www.pixiv.net/en/artworks/120081649)\n\nhttps://preview.redd.it/z9p3g5mg7h9d1.jpeg?width=752&format=pjpg&auto=webp&s=0b8c79cbb1a6a5df6cef8819c6f2d767f4329cc0",
            "https://preview.redd.it/3mb6r6e79h9d1.png?width=388&format=pjpg&auto=webp&s=2e8a7dc68ebf3bcfb4a0ba36a65ab09efd5abe6b"
        ]
    },
    "The anticipation of incoming future (Alvitr)": {
        "title": "The anticipation of incoming future (Alvitr)",
        "score": 612,
        "url": "https://i.redd.it/mnk8l1u6zg9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "SKK: \"Oh no, I did this _again_... Anyway.\"",
            "she is calculating our future together and our future daughter look as she is holding her tummy and heart eye;s she is ready for some love![img](emote|t5_3p20d|14001)![img](emote|t5_3p20d|7011)lots of love",
            "Don't need Nostradamus to predict what happens when we clapped Alvitr's cheeks with no protection. But would be fine with having a family with best fortune telling waifu.",
            "About 200 other girls reaction: \"Shi-Ki-Kan\"! ![img](emote|t5_3p20d|7018)",
            "210 cubes for and I STILL DON'T HAVE HER... WTF man, I got 3 U-37s, 4 Z-47s like bruh NOT A SINGLE ALVITR",
            "Don't keep her waiting. ![gif](emote|free_emotes_pack|heart_eyes)",
            "I feel your pain...",
            "![img](emote|t5_3p20d|6997)",
            "[Source of Valhalla's Wisdom](https://www.pixiv.net/en/artworks/120075236)\n\nOh no, the heart eyes ![gif](emote|free_emotes_pack|flushed)",
            "https://preview.redd.it/oe8mmz549h9d1.jpeg?width=1080&format=pjpg&auto=webp&s=77adbc42d39ebca63c20a70b4b2716d41fc0f8ef"
        ]
    },
    "A rare but beautiful butterfly [Shangri-La]": {
        "title": "A rare but beautiful butterfly [Shangri-La]",
        "score": 351,
        "url": "https://i.redd.it/qhwsvr7plh9d1.jpeg",
        "content": "",
        "num_comments": 9,
        "comments": [
            "man her skin is a treasure![img](emote|t5_3p20d|14001) so comfy and warm feeling looking at her in that sweater and hat\n\ni want another skin for her for her fangirl over insects again",
            "I'm biased, but I think the Yorktown and Essex classes are the best in the game. All wonderful girls",
            "So, youre saying that Essex does not need to be hit with a chair? ",
            "they are great girls i think there all unique and wonderful as well, i respect them and there fans there love them is infectious![img](emote|t5_3p20d|14001)",
            "Essex is a wonderful, energetic meme queen, but it's not _all_ she is\n\nJustice for Enty's earnest and competent kohai!",
            "Shangri-La is best Girl!\n\nThank you for posting!\n\n![img](emote|t5_3p20d|14001)![img](emote|t5_3p20d|9993)",
            "![img](emote|t5_3p20d|14001)",
            "She always is! ![gif](emote|free_emotes_pack|heart_eyes)",
            "It seems all too rare to see Shangri-La art where she's not part of an Essex punchline. Lovely to see her here\n\nhttps://www.pixiv.net/en/artworks/120076896"
        ]
    }
}