{
    "[Teach Tuesday] Share any resources that you've used to improve your knowledge in Azure in this thread!": {
        "title": "[Teach Tuesday] Share any resources that you've used to improve your knowledge in Azure in this thread!",
        "score": 44,
        "url": "https://www.reddit.com/r/AZURE/comments/148cola/teach_tuesday_share_any_resources_that_youve_used/",
        "content": "All content in this thread must be free and accessible to anyone. No links to paid content, services, or consulting groups. No affiliate links, no sponsored content, etc... you get the idea.\n\nFound something useful?  Share it below!",
        "num_comments": 67,
        "comments": [
            "After messing around with learning HTML and Python coding on FreeCodeCamp, I think I finally found my niche with cloud computing and have been learning Azure little by little on Microsoft Learn",
            "The most basic one and more effective for me is, get my hands dirty. Go to the portal, create some basic services, see the options you have and see how it works in real life.",
            "I'm new to azure, thinking of studying az-900. Can anyone suggest good hands on homelab trainings?",
            "Azure/OpenAI ChatBot  \nEven though it's still at 3.5 I get allot of help sorting script issues with the Azure Open AI",
            "Everything about Azure's API gateway product *API Management* : aka.ms/apimlove",
            "h y p e s t key on google for retail keys",
            "There are very good courses on udemy.com...specifically by Alan Rodrigues.",
            "What does everyone do for gaining Ilene’s and updates on azure? What tools do they use? Ie twitter, threads, something else?",
            "One not here is Ciralto on youtube. His automation videos are really good.",
            "Hello everyone, i have a question, how i can block regular users from creating Guest accounts? I will appreciate any advice,thanks a lot"
        ]
    },
    "Free Post Fridays is now live, please follow these rules!": {
        "title": "Free Post Fridays is now live, please follow these rules!",
        "score": 1,
        "url": "https://www.reddit.com/r/AZURE/comments/1dq61b3/free_post_fridays_is_now_live_please_follow_these/",
        "content": "1. Under no circumstances does this mean you can post hateful, harmful, or distasteful content - most of us are still at work, let's keep it safe enough so none of us get fired.\n2. Do not post exam dumps, ads, or paid services.\n3. All \"free posts\" must have some sort of relationship to Azure. Relationship to Azure can be loose; however, it must be clear.\n4. It is okay to be meta with the posts and memes are allowed. If you make a meme with a Good Guy Greg hat on it, that's totally fine.\n5. This will not be allowed any other day of the week.",
        "num_comments": 0,
        "comments": []
    },
    "Microsoft Entra Connect : Password writeback VS // Microsoft Cloud Sync : Password writeback": {
        "title": "Microsoft Entra Connect : Password writeback VS // Microsoft Cloud Sync : Password writeback",
        "score": 1,
        "url": "https://www.reddit.com/r/AZURE/comments/1drd1by/microsoft_entra_connect_password_writeback_vs/",
        "content": "I've found out, correct me if I'm wrong, that Microsoft made it Pay2Get Password writeback to on-prem synced accounts if you are using Cloud Sync (New). You are required to have a license to sync reset passwords back to on-premises.\n\nhttps://learn.microsoft.com/en-us/entra/identity/authentication/concept-sspr-licensing\n\nIf we use Azure Entra Connect (Old), you can enable password writeback without any costs/license. If the password changes in 365, it will writeback to on-premises. ",
        "num_comments": 0,
        "comments": []
    },
    "Peering Container App and VM": {
        "title": "Peering Container App and VM",
        "score": 3,
        "url": "https://www.reddit.com/r/AZURE/comments/1dr3xv5/peering_container_app_and_vm/",
        "content": "Hello everyone! I'm quite new to being a sysadmin/azure user so please don't mind my ignorance.\n\nI have an application I'd like to deploy to Azure. It's a Remix Node.JS application that uses MongoDB for the database.\n\nMy current approach is to create:\n\n1. a VM that runs MongoDB (with data stored on a small separate disk)\n2. a container app that runs the application itself built with docker from GitHub\n\nNow, I don't know if my current approach is the best (please tell me if not!!) but I'd like to know if there would be a way to peer those 2 services so that the container app can access the database more efficiently.\n\nThe services are in one region so I kind of assumed it would be possible, but I can't seem to find the option. I hope it wouldn't require me to dellocate/recreate the services. Thank you!!",
        "num_comments": 1,
        "comments": [
            "Running databases in a VM is not the cloud way. Change that with Cosmos DB for MongoDB if possible. Container apps is a solid choice. Now connecting these can happen in multiple ways:  DB is reachable either fully public, retricted or in private only. I would opt for last option, only allowing access to the db from the container apps and completely shut off the public endpoint."
        ]
    },
    "Deploying a Distributed Laravel Application to Azure Container Apps": {
        "title": "Deploying a Distributed Laravel Application to Azure Container Apps",
        "score": 1,
        "url": "https://devblog.jpcaparas.com/deploying-a-distributed-laravel-application-to-azure-container-apps-4a8384c9bb14",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Good article! What makes the Laravel app distributed? Will it communicate with other container apps? Have you thought about using Dapr to achieve that?"
        ]
    }
}