{
    "Weekly Reminder: Community Rules": {
        "title": "Weekly Reminder: Community Rules",
        "score": 1,
        "url": "https://www.reddit.com/r/BabyBumps/comments/1dny05y/weekly_reminder_community_rules/",
        "content": "This community has a bunch of rules to keep things orderly and respectful. Please review our rules in the side bar or the [wiki](https://www.reddit.com/r/BabyBumps/wiki/index/). Repeat offenders will be banned permanently.",
        "num_comments": 0,
        "comments": []
    },
    "Daily COVID Megathread": {
        "title": "Daily COVID Megathread",
        "score": 2,
        "url": "https://www.reddit.com/r/BabyBumps/comments/1d3iil5/daily_covid_megathread/",
        "content": "We've been getting flooded with repetitive standalone posts about the COVID vaccine, COVID precautions, and vents about how hard it is to be pregnant during the pandemic. Please limit conversations about it to this thread. \n\nRemember: no misinformation, no conspiracy theories, no medical advice. This is a place to share your experiences and ask questions.\n\nIf you're looking for a more robust conversation on the topic, check out r/CoronaBumpers.\n\nStay healthy and stay safe!",
        "num_comments": 5,
        "comments": [
            "If you had Covid while pregnant in 2023 or 2024, what was your experience (and in particular, what guidance/care did your doctor offer?)\n\nRecovering from a bout of Covid at 14 weeks with my rainbow pregnancy (I took Paxlovid which has helped a lot), and eager to hear experiences / what kind of care you received.",
            "Why does my post keep getting marked as Covid and Im not posting about it?",
            "I got covid at 10 weeks pregnant. Mine was thankfully pretty mild, I just monitored to make sure I didn't run a fever. My doctor wasn't worried about it at all, but had me start taking daily baby aspirin and then I now qualify for an extra ultrasound at 32 weeks. Currently 23 weeks and baby girl is looking healthy!",
            "I got Covid around 9 weeks pregnant with my first. It was fairly mild and I was instructed to take Tylenol when necessary (by the time I realized I had covid the a fever passed and I just had some aches.) My understanding is concern with fevers is the internal temp your body reaches can cause issues with baby; however Tylenol does the trick! I also received the Covid booster during my pregnancy and dont recall any issues \nThis is anecdotal and there is no data or evidence suggesting a connection that I am aware of - I did end up with postpartum preeclampsia. \nBaby was born at 38w3 days healthy and happy. Hes almost 2 now!",
            "i'm sorry to hear about your tough experience, it sounds really challenging.",
            "[deleted]"
        ]
    },
    "Did anyone else test positive really early?": {
        "title": "Did anyone else test positive really early?",
        "score": 75,
        "url": "https://i.redd.it/klk87aj6qg9d1.jpeg",
        "content": "I got a faint positive two days ago at 3weeks 2 days. I've continued testing and they're getting darker but it's soooo early! I can't even get a dating scan for another three weeks or so. \nDoes anyone feel like you test positive so early and then you're just waiting around like this picture haha ",
        "num_comments": 61,
        "comments": [
            "Found out I was pregnant in October. Im still pregnant ugh.",
            "I tested positive on the day I was supposed to get my period, so around 4 weeks. And in Sweden you don't get a scan until 12 weeks  I remember going from my first appointment, about a week after testing positive thinking, \"wow they're just gonna believe me?\" since there was no blood- or urine samples or anything ",
            "Pretty much  Id also encourage you to stop testing. A positive is a positive and those tests arent designed to get darker the more pregnant you are. You just risk stressing yourself out :)",
            "Yes I found out at like 3 weeks and 5 days now Im chilling with my 8 month old ",
            "I found out at 3w5d. I had my \"confirmation\" appointment at 5 weeks. I was surprised they only did a urine sample, not a blood test. So I paid $150 for them to tell me what I already knew and accomplished myself for $8.\n\nHad my first ultrasound at 7 weeks.",
            "I would stop testing now because you can get the hook effect where the tests start to get lighter because theyre not designed for high levels of HCG.",
            "I tested positive at *around* 3weeks 4 days and just did my dating ultrasound yesterday and was measuring at 6 weeks 3 days (but i should be around 7 weeks 4 days). Baby had a little flicker for a heartbeat and seemed alright (FTM so I have no idea and the tech obviously couldnt say much).",
            "I tested positive the day my period was due. I'd been struggling with morning sickness for the previous 6 days, but waited til it was due to test. I think if I'd tested earlier it would have been positive. It was a really strong positive that came up immediately.",
            "i tested for the first time at 3+4 and was met with some super strong positives! the best part about going to a fertility clinic is that they confirmed my pregnancy via blood work the next day and then did my first scan at 5+6 ",
            "YES hahahah. I feel insane but I got a vvvvvf positive at 7 DPO..... BFP at 8 DPO"
        ]
    },
    "PSA: If you want to help a new mom, fill up her gas tank and return her stuff at UPS": {
        "title": "PSA: If you want to help a new mom, fill up her gas tank and return her stuff at UPS",
        "score": 304,
        "url": "https://www.reddit.com/r/BabyBumps/comments/1dqsrkc/psa_if_you_want_to_help_a_new_mom_fill_up_her_gas/",
        "content": "Nobody wants to go through the gas station wondering if their newborn is going to wake up and start screaming, not to mention the (toxic?) fumes.\n\nAlso, we are buying a lot of crap, and sometimes it doesn't work out and needs to go back. Getting that stuff back to the UPS store or USPS or wherever is last on the list. \n\nIf you really want to help a new parent, this is what you can offer that will actually help.\n\nReminder: Coming over to hold the baby is not helpful. Coming over at all is a lot to even ask. \n\nCan I get an amen? What else should be on this list?",
        "num_comments": 48,
        "comments": [
            "I disagree that coming over to hold the baby is not helpful. I will happily go take a shower or do a couple of things I need to get done.\n\nBut also, it isn't all about me. Sure, I appreciate if people come over and help, but I understand that they also want to form a relationship with the child, which I am very much in favor of, especially in the case of family who I want to play a significant role in the baby's life. As an added bonus, those family members will baby-sit when I am ready to go out and I prefer that they are very comfortable with the baby, which starts with things like holding her.",
            "New parents have a lot on their plate; filling up their gas tank and handling returns is a real lifesaver",
            "My friends keep telling me they cant wait to see the baby when we are home. If I dont get a Starbucks Im calling the police. They all know my order. No excuses! And a cake pop!",
            "If you're coming over, be helpful - offer to do some dishes, bring a meal, put away some laundry, offer to feed and change baby while I take a nap or shower...basically don't expect to be entertained!",
            "Is pay at the pump now a thing in the US? Available at pretty much all forecourts in the UK!",
            "I lucked the heck out with my friend group. I had a friend bring us formula when we left the hospital as in we couldnt leave the hospital without formula at home, and they stepped up so we wouldnt have to make an extra trip out. Ive had offers of cooked meals, Ive had friends reach out just to ask how I am, and one mom friend said if Im ever overwhelmed and need not-baby time, text her and she can take baby for a walk in the pram.\n\nSo uh all that. All that goes on the list. I do wish I could have them come over and hold baby though, because I very much want to show everyone how amazing my baby is. But shes a preemie, and only a few weeks old, so probably not smart alas. In the same vein, literally nobody has gotten in her face or tried to touch her yet and I am so grateful to not have to recite my sorry she cant have contact with anyone but us yet script.",
            "My mom took my leftover Amazon returns for me the day before my induction - it was sooooo helpful!",
            "Volunteer to free the new baby socks from the 18 plastic pieces of crap that secure them to the packaging. Then find the now 36 pieces so you can assure her that new baby won't get poked by the plastic. Then do it again with all the other clothes she needs to unpackage and wash.",
            "Definitely food, a big one. Especially if you're coming over to stay. My mom stayed with me for 4ish months and then my sister is still here (she's younger, unmarried and she moved in when baby was 10 days old. Baby is now 15 months). They helped with laundry and everything. My husband and I will be DOING EVERYTHING for this little girl (she's actually 24 but still) when she has kids of her own ",
            "For me, family members holding the baby was SO helpful. I guess it just depends person to person!"
        ]
    },
    "TW: loss at 25wk 1 day..": {
        "title": "TW: loss at 25wk 1 day..",
        "score": 40,
        "url": "https://www.reddit.com/r/BabyBumps/comments/1dr58o8/tw_loss_at_25wk_1_day/",
        "content": "I am still trying to understand where I went wrong. What I did wrong. Two days ago I gave birth to a beautiful baby girl at 25 +1 who was born alive encaul and breech but were unable to save her since she was just so small.\nLast Friday I started feeling a sharp pain in my lower abdomen near my pelvis only on one corner. I googled it out and google said it was round ligament pain, common in second trimester. It was an uncomfortable sensation that didn't really go away and the whole Friday night I slept uncomfortably with Pain.\nSaturday morning the pain changed into dull cramps that would regularly come and go, I associated it to to prodromal labor but decided to visit my OB at around 2 pm. She said I might have a mild UTI and gave me anti biotic and a pain killer.\nThe pain didn't go away, on Sunday the pain became so intense I was sweating. I downloaded contractions app and it told me to go to hospital ASAP. I couldn't take it anymore and went to the hospital emergency at 11pm on Sunday. The doctor admitted me after checking my cervix and said I was 1cm. She said your cervix is opening and prepared me for the worst possible scenario that I might give birth anytime now since contractions have started. I was admitted in the hospital.\nShe started me on IV drips, strong painkillers, antibiotics, that night was the longest. I also had a bloody show where it felt like my waters broke and the whole bed was filled with pink watery fluid.\nFinally on Monday morning I was a bit stable, the pains went away but I was still having pink watery flow and soaking pads. The pain went away completely by afternoon and blood flow slowed down. However at night pain started again and they took me to the doctor on call again where she prepared me for loss as she said my amniotic fluid is a bit less and gave me some more antibiotics and painkillers.\nTuesday morning my own OB came to check me and said I was three fingers open and told me we can't do cerclage as my uterus is contracting. She started me on stronger antibiotics (icumen)and saline and pain killer. Finally the pain stopped. I was so happy and I finally slept the night of Tuesday. I was stable the entire Wednesday morning. My OB visited me in the morning and discussed discharge however my MIL and my Mom wanted me to stay another night under observation so she agreed and said let's wait till Friday.\nWednesday evening I had no pain but I felt like I need to poop and I did poop but I wasn't very satisfied and I felt constipated. I suddenly started feeling a sharp pain in my back and the I felt the urge to pee but it would not come. That's when i was hit with the worst pain ever and felt the need to push. I said to my Mom let's go to the OPD to get it checked. The doctor did ultrasound and said your baby is up and not in the canal yet and that I might have UTI and told me to drink cranberry powder mix. I went back to my room where I literally started having the hardest contractions with the urge to push. 15 minutes later I gave birth to my daughter who was breech but she was covered inside the amniotic sac. She was moving inside the sac but when they broke open the sac,  she couldn't breath and struggled.\nIt was the worst thing I ever saw in my life. My  beautiful baby on the table, she was so complete. She had such beautiful fingers and long arms and legs.  I touched her and hugged her and she was so soft. I gave her a kiss and I said to her I am sorry mommy failed you. My body failed you..\nShe was buried the same night at 2am, my husband bathed her, lead her funeral prayer and named her 'Farha' meaning happiness and peace. He buried her inside the grave himself and gave her back to where she came from. \nI was discharged the next morning and it felt so wrong going back home all alone but when I saw my son waiting for me I just couldn't let go of him. We both hugged each other and slept a long nap. \nI am fine during the day but once I am in bed  all I can think about is my baby girl..\nSorry for the whole rant, I just didn't know who else to share with..",
        "num_comments": 4,
        "comments": [
            "I am so incredibly sorry for your absolutely heartbreaking loss. I hope that you are able to get some counseling following that enormous trauma. Please take care of yourself, and please know that you did not do anything wrong. This is not your fault.",
            "BabyBumps users and moderators are not medical professionals. Responses do not replace contacting your medical provider. You should always call your provider with any concerns.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BabyBumps) if you have any questions or concerns.*",
            "This is so terrible, my heart goes out to you! I don't know what to say, except to send you love and prayers and the hope that you will heal from the loss of your beautiful girl.\nDon't blame yourself, as hard as that may be. It wasn't you who failed her.\nPlease allow yourself to grieve and know that anything you may feel is entirely normal and will stabilize with time.\n",
            "I'm so deeply sorry my words cannot express.\n\nYou did nothing wrong. You did absolutely nothing wrong. Sometimes it just happens and only God knows why. \nPlease do not blame yourself. You did everything you could. You got the help you needed and stayed where the help was. You did everything you could. You are a great mom."
        ]
    }
}