{
    "Friendly Reminder: Don't Send Internet Strangers Gifts or Money": {
        "title": "Friendly Reminder: Don't Send Internet Strangers Gifts or Money",
        "score": 50,
        "url": "https://www.reddit.com/r/BabyBumps/comments/1diq3vf/friendly_reminder_dont_send_internet_strangers/",
        "content": "To our wonderful community:\n\nPlease consider this your semi-regular reminder NOT to send money or gifts to people from this sub. There are many awful stories out there and many people in need, some of whom might try posting about their stories here. However, there is no way to verify that these people are who they say they are or have been through what they claim to have been through. Your intentions are good, but theirs might not be.",
        "num_comments": 0,
        "comments": []
    },
    "Daily COVID Megathread": {
        "title": "Daily COVID Megathread",
        "score": 1,
        "url": "https://www.reddit.com/r/BabyBumps/comments/1d3iil5/daily_covid_megathread/",
        "content": "We've been getting flooded with repetitive standalone posts about the COVID vaccine, COVID precautions, and vents about how hard it is to be pregnant during the pandemic. Please limit conversations about it to this thread. \n\nRemember: no misinformation, no conspiracy theories, no medical advice. This is a place to share your experiences and ask questions.\n\nIf you're looking for a more robust conversation on the topic, check out r/CoronaBumpers.\n\nStay healthy and stay safe!",
        "num_comments": 3,
        "comments": [
            "If you had Covid while pregnant in 2023 or 2024, what was your experience (and in particular, what guidance/care did your doctor offer?)\n\nRecovering from a bout of Covid at 14 weeks with my rainbow pregnancy (I took Paxlovid which has helped a lot), and eager to hear experiences / what kind of care you received.",
            "Why does my post keep getting marked as Covid and I’m not posting about it?",
            "I got covid at 10 weeks pregnant. Mine was thankfully pretty mild, I just monitored to make sure I didn't run a fever. My doctor wasn't worried about it at all, but had me start taking daily baby aspirin and then I now qualify for an extra ultrasound at 32 weeks. Currently 23 weeks and baby girl is looking healthy!"
        ]
    },
    "Postpartum hemorrhage ": {
        "title": "Postpartum hemorrhage ",
        "score": 227,
        "url": "https://www.reddit.com/r/BabyBumps/comments/1dlctao/postpartum_hemorrhage/",
        "content": "TW WARNING: mention of blood loss.\n\n\n\nOn Thursday, I was taking care of my one month old daughter and anticipating a wonderful night out with my 4.5 year old, when my period post-partum returned (I thought). I got a shower and noticed that my flow was faster than normal, and I had some cramping/clotting. \n\nI called my husband (Ryan) to tell him to pick up some extra pads, as I had soaked through two adult diapers in a matter of minutes. \n\nThinking it would slow down and not be a big deal, I tried to carry on. It only got worse in the following minutes - I called Ryan to come home, my family to come get the baby, and my favourite nurse for advice.\n\nAs mothers do, I took care of my daughter to ensure she was in safe place while waiting for help to come. Unfortunately, my house did look like a crime scene with an unmanageable amount of blood lost. \n\nI was taken by ambulance to the local hospital for what we now know was a post-partum hemorrhage, four weeks (33 days) after delivering my daughter. \n\nI had surgery in the wee hours of Friday morning and am home resting. \n\nI’m so grateful for the medical teams from paramedics to nurses to doctors who took something that could have been fatal, and in a 6-minute surgery (while I had a great snooze) sent me back home to my kids. \n\nI am sharing because it didn’t occur to me that I could hemorrhage 4 weeks after birth - I thought we were in the clear. I went from feeling perfectly fine to perfectly not-fine within minutes. \n\nI few things to look out for (I’m sorry for the graphic details):\n- a consistent loss of blood that fills up a pad or diaper in under an hour (for me, it was like a faucet had been turned on).\n- Clots (I had a few clots at home that would have been comparable to a tennis ball), but anything bigger than a golf ball is reason to be concerned \n- Your own gut instinct. Or in this case, a friend who tells you to go to the hospital. \n-  can happen up to 12 weeks pp\n\nAs women, we are very quick to downplay our bodies and what they are doing. Our bodies are INSANE and the amount of things that go right in them day-to-day is matched with how many things can go wrong. \n\nI’m so grateful and want to ensure other women know the signs as they possibly endure this as well. ",
        "num_comments": 24,
        "comments": [
            "This is good to be in the lookout for. This is why they say the first 42 days after birth has the highest mortality/morbidity for postpartum women. \n\n[Timing of maternal mortality and severe morbidity during the postpartum period](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9594153/)",
            "I’m so glad you’re okay!! And thankyou for sharing this information for us all ❣️",
            "This happened to me almost two weeks ago - a week after a c-section. I had my follow up yesterday and the doc kept saying that they see this in literature but not in real life (delayed hemorrhage) and yours was even later than mine!\n\nI ended up needing an emergency hysterectomy and almost didn’t make it, frankly. \n\n1000000% agree with trust your gut. I knew it wasn’t normal almost immediately. \n\nSorry you went through this - it’s awful!",
            "We are at risk for hemorrhaging up to 12 weeks postpartum.",
            "Wow, this is so scary. Glad you are okay and healing. What was the surgery?",
            "I had a very similar experience! It was not at all something I even knew about before it happened to me.",
            "I hemorrhaged after my C-section and I remember not feeling my legs but I could feel clumps coming out and I couldn’t stop talking about it which alerted the dr. Our bodies are incredible at telling us something is wrong, so glad you are okay.",
            "Yes - please keep sharing your story! PPH is not talked about enough. That was one thing I had limited info on, and thinking because I haemorrhaged during birth, thought I was in the clear. Nope. 2 weeks after birth I also had secondary PPH :( Glad you’re okay!",
            "Oh gosh, I’m glad you’re okay. I hemorrhaged almost half my blood at delivery and assumed that was it for the danger zone. This is really good to know.",
            "that’s terrifying! i’m glad you’re ok! also glad you had the ability to think clearly and not absolutely panic!"
        ]
    },
    "Maternity Clothes": {
        "title": "Maternity Clothes",
        "score": 7,
        "url": "https://www.reddit.com/r/BabyBumps/comments/1dluu4b/maternity_clothes/",
        "content": "Does anyone else find a lot of maternity clothing to be absolute bullshit? I ordered some hoity toity \"maternity Jean shorts\" and their largest size doesn't even fit, and like yeah I'm big but not that big. Dresses are usually fine but everything else is questionable. I'm just gonna restort back to like thrift store mens clothes haha",
        "num_comments": 11,
        "comments": [
            "i've had luck with pinkblush clothing and seraphine pants but i have HAD it with these stupid models with fake pregnant bellies, hire some actually pregnant people so i know what this will actually look like on me! \n\nit also perpetuates this ideal of an \"all belly pregnancy\" and i'm so frustrated we can't escape unrealistic beauty standards even when we are pregnant for fucks sake\n\n at least show me someone with stretch marks or something!! i hate shopping for maternity clothes online it just makes me so angry.",
            "the worst is all the maternity leggings being paper thin and see through and the belly band not even covering my belly.\n\nthe only maternity leggings i 10/10 recommend is from Senitaathletics.com",
            "Did you buy these shorts from an actual clothing store? Buying their \"largest size\" and not your actual size sounds like buying random Amazon and similar clothes. No shame in doing so! I've done that before, too. But I don't think you can write off all maternity clothes when you're guessing on size.",
            "I got mine from Amazon and I’m still wearing them three weeks postpartum. They fit when I had a 7.5 lb baby in me and they still fit even though I lost 30lbs of water weight. (I was very swollen)",
            "I couldn't due maternity jean shorts. I ordered three different pairs and sent them all back. I ordered a few pairs of black shorts that worked well. Shorts in general for maternity seem to ride up, and the jeans material makes it even more uncomfortable.",
            "I had the same issue with over the belly jeans. I bought some in my pre pregnancy size from Gap and Old Navy. \n\nThe Gap belly band was too small before the end of my second trimester. The Old Navy belly band was too big until well into my third trimester!",
            "I found some maternity shorts from Old Navy that I love. I’ve had my best luck with Pinkblush, Old Navy, and Gap. Target has been hit or miss—some absolutely great stuff and other absolutely terrible stuff.",
            "I genuinely had the best luck with shein out of anywhere else. I just got an order with 16 things about two weeks ago and not a single thing didn’t fit perfectly! \n\nAs long as you read the reviews I genuinely think you could get nice stuff",
            "Yesss that's exactly it. The insane marketing, and this AI looking tik tok mom. I feel beautiful a lot. But I don't feel cute lol",
            "It was a high end online boutique. The size tlhat was \"my measurements\" was too small. So I sent back in for A larger size. Still too small and unfortunately that's the top size they went to. And yes advertised as maternity shorts"
        ]
    },
    "What do you wish you did, before getting pregnant?": {
        "title": "What do you wish you did, before getting pregnant?",
        "score": 33,
        "url": "https://www.reddit.com/r/BabyBumps/comments/1dlmoos/what_do_you_wish_you_did_before_getting_pregnant/",
        "content": "My husband and I will be trying for a baby next year, and at the moment I am eating all the sushi and cured meats I can! \n\nI am also getting vaccinations I was missing. My hubby and I also have a weekly date night, because we know this will not always occur in the future. \n\nWhat do you wish you did before getting pregnant?\n\n",
        "num_comments": 193,
        "comments": [
            "I wish I lost weight before I got knocked up. But like it wasn’t planned.",
            "Got physically healthier and stronger, especially around my core. Being fitter before getting pregnant definately helps throughout the pregnancy. I wish I'd taken it more seriously to start with!",
            "Any possible dental work",
            "Traveled just us more. We got married at the end of 2019 and weren’t sure how soon we would get pregnant, so we weren’t trying but not preventing. The plan was that if we weren’t pregnant by August 2020, we would take a road trip through several states and sight see, explore, etc. Well, we got pregnant March 2020 and found out the same week that Covid lockdown was announced…so there went any traveling for the year 😂",
            "If your budget allows, I’d recommend one last big vacation before you start trying. My wife and I meticulously planned the birth of our little one, and luckily everything aligned and she got pregnant the first or second try. We prepped the whole year before she got pregnant and planned a big vacation to the Outer Banks with our three dogs. It was a fantastic time. We had such an amazing week, went on many adventures and ate so many great meals. We even got to experience our first almost hurricane (the TS was only 5mph before hurricane threshold!). \n\nAnd to top it all off, the morning of check out, we had an extra pregnancy test I had spilled ice cream on. I didn’t want to pack it so I told her to take it just in case (she had taken one two days prior and it was negative). But this pregnancy test came back positive! And our little one was born one month ago! \n\nI’d also recommend getting good cookware and getting used to using it. This will allow you both to make bulk meals in one go, which saves a ton of time. \n\nHonestly, other than the first trimester, the pregnancy wasn’t particularly restrictive and we did a lot of normal activities (well I guess except for during the placenta previa diagnosis but that cleared). Also having a baby is way less restrictive than we thought too. We are hiking and going to the zoo rather frequently.",
            "Get in the habit of a reasonable, consistent workout routine. One that you could maintain throughout pregnancy. I hadn’t worked out in a hot minute when I got pregnant, then the first trimester fatigue hit me like a ton of bricks! \n\n“I’ll work out more when the 2nd trimester energy comes!” I told myself. \n\nSpoiler alert: The motivation never came. \n\nI wish I had a set routine before getting pregnant. I still go on walks and whatnot, but an easy weights regiment would’ve been good!",
            "Contrary to a lot of these, you can still travel and have fun and date etc after you give birth! Our lives became so much better in every way.\n\nIn the US, but my honest answer would be to leave a state that is anti-abortion. Because if every fiber of your being is hoping your baby gets carried to term, your prenatal care is likely to be poor and you’ll be left to literally die in an emergency. Good OBs have left and also left shortages in places where they have to break state or federal law (and their own medical code of ethics), with the questionable ones staying (some good ones remain, but there’s that shortage).\n\nFor our second, we moved, and despite not planning to start trying for a while, we already have meetings set up with midwives. We’ll be doing “preconception counseling” and developing a relationship we can feel secure in WELL ahead of time, this time.\n\nThe other things is to line up a marriage therapist. Have a few sessions to get comfortable, so that when you have spats and trouble understanding each other in a sleep deprived haze where your well meaning partner succumbs to internalized sexist mores or bad role modeling from parents/society or even just innate biological challenges (ie partner can do his sport; you have 6 months of recovery; equal parenting while exclusively nursing; lack of leave; one parent has a mental health challenge and can’t be equal; one handles lack of sleep better…), you can work productively through them rather than winding up as one of the many posts of miserable women who hate motherhood because their husbands aren’t partners or fathers. Letting resentment build while killing yourself isn’t okay.\n\nWrist prehab is also great. Any nagging “might be injured” kind of things are going to be exacerbated, and it’s hard to do PT effectively while gaining weight, moving your center of balance, and changing hormonally.\n\nOh, and make sure your teeth are in good shape and your dentist won’t refuse to work on a pregnant woman!",
            "Started a good exercise routine that I didn't have to leave the house for. First trimester was hard, and everything went out the window. My husband and I used to go on long walks several times a week and it kept us in good shape, but when I got pregnant, leaving the house became very difficult. \n\nSecond trimester was better, but I still didn't want to leave the house. Finding new inside exercises was more difficult while pregnant than already having a routine. \n\nI wish I got the house ready for baby before I fell pregnant. Everyone told me not to do anything before pregnancy because \"you never know if you're actually going to fall pregnant\". Well, I fell pregnant the first month, and I had a really tough pregnancy so far. I've been too tired for most of the time and my poor husband has had to do it all - which a lot of it has been building a lot more storage furniture and moving heavy things around. I wish I could have done it before I fell pregnant so I could be helpful! \n\nOne thing I was happy that I did, was research ALLLLL the things that work for morning sickness. Most of it won't work for you, but some will, and it's great to know all the odd, random things to try when/if it hits! (You might be lucky and not get morning sickness though, unfortunately I had HG, so it was pretty bad till 27 weeks)",
            "Whole lot lol I’m only 23 I will miss the freedom of being able to be “selfish” honestly.",
            "Things I’m glad I did because I don’t really have any regrets \n\nTook a big couples vacation \n\nRaised a puppy\n\nBought a house\n\nSaved a big cushion of emergency fund\n\nPicked out a health insurance plan for the pregnancy \n\nA lot of fun drinking events (wine tastings, brew fests, etc.)\n\nQuit hair dye (it’s not necessary for pregnancy, I’m just glad I did it for convenience)\n\nGet tattoos and piercings that I’ve wanted \n\nSpend lots of lazy days together just the two of you"
        ]
    }
}