{
    "My roommates won’t move out": {
        "title": "My roommates won’t move out",
        "score": 398,
        "url": "https://www.reddit.com/gallery/1dqwt19",
        "content": "My roommates (a 40s married couple) were supposed to move out on 17th of this month but they keep giving reasons not to move out. They said they are gonna be out today but I checked the camera in the living room, they haven’t even gone out today and there are no signs that they are packing stuff.\n\nThey are not on the lease btw. I’m filing eviction paperwork to kick them out but it costs lots of money (250$ just for filing) and at least 5 weeks for the court order. \n\nI’m so tired of this shit. Even we could kick them out, no way we could get our money back that they have been free loading in our place as we were so naive that we didn’t ask for their photo Id or ssn. They have 12 fans in the room and blast our AC everyday. At this point, I don’t think we will find another roommate. ",
        "num_comments": 156,
        "comments": [
            "Who in the world needs 12 fans inside a bedroom? Even in an entire house is still a lot! Wth. Is it that hot? Where do you live, in hell? ",
            "This is an apartment and its 683 for electric ? Are you guys growing fancy  ganja or running a laundromat ?",
            "File the eviction paperwork asap. Is their stuff even in boxes? Put a lock on the ac.",
            "Theyre growing pot for sure. No other reason for 12 fans and $683 electric bills.",
            "Sorry youre dealing with this. But yes, start the eviction process. Its gunna take some time as you already know.",
            "Massive red flag: you asked a question and were told to wait while they made the call to find out the answer, if that phone call ever took place you wouldn't have had to follow up asking for updates, they would have immediately messaged you back....file the papers they arent leaving lol",
            "Turn the breaker / fuse off to their bedroom. Make living there the most horrible time on earth. They will leave.",
            "Wtf $683 utilities bill!!! Holy that's insane!",
            "And stories like this make me solidify not renting my spare room out",
            "Just put their shit in boxes while they're out and put it outside and change the locks. They're not on the lease they have no proof they live there. No one can do anything about it."
        ]
    },
    "My roommate always has money but never pays me on time": {
        "title": "My roommate always has money but never pays me on time",
        "score": 268,
        "url": "https://www.reddit.com/r/badroommates/comments/1dqw19x/my_roommate_always_has_money_but_never_pays_me_on/",
        "content": "I am so fed up with my roommate right now. This guy is always late on the internet and WiFi payments, and it’s driving me nuts. It's not like he can't afford it either. I know for a fact he makes bank gambling on Stake. Just last night, he won $4k! I literally saw him withdraw it all online, and he still refuses to pay his share of the internet bill. How is that even fair?  \n  \nIt’s not like we're talking about huge amounts here. We split the bills evenly, and the WiFi isn’t even that expensive. But every month, it's the same story: he’s “short on cash” or “waiting for a payout.” Meanwhile, he’s out here making thousands from gambling, buying new gadgets, and ordering takeout every night. But when it comes to paying the internet bill, suddenly he's broke.  \n  \nI’ve tried talking to him about it multiple times. I’ve even shown him the due dates and explained how it affects our connection when the bill isn’t paid on time. He always promises to pay me back “next time” or “when he gets his next big win,” but it never happens. I’m tired of covering for him and having to chase him down for his share.  \n  \nWhat makes it worse is the sheer disrespect. I work hard for my money and make sure all my bills are paid on time. Meanwhile, he's gambling away thousands and still can’t pitch in for basic utilities. It’s so frustrating and unfair.  \n  \nAnyone else deal with something like this? How do you handle a roommate who refuses to pay their share despite clearly having the money? I’m seriously considering finding a new place because I can’t keep living like this. Any advice or similar stories would be appreciated. Thanks for letting me vent.",
        "num_comments": 30,
        "comments": [
            "Change the wifi password, only giving it to him upon payment.",
            "Your roommate doesn't make as much money as he portrays.  He won 4k today but probably lost 8k in the past two months.  That's the life of most gamblers; give the image like they are doing well in the light but gnash their teeth in the dark.\n\nYour roommate is always late on the payments for two reasons.  1.  He loses more money than he wins.  2.  His gambling high is more important than paying you.",
            "How much your roommate makes is irrelevant he has to pay his bills. I'd call him out when he is ordering out and I'd change the wifi password.",
            "Either change the password or cut the wifi altogether. You can use your phone as a hot spot or buy one that only you use.",
            "Don't take it personally.  Gamblers are the biggest pieces of shit. They are just a more socially acceptable druggie. You could be his only family member left and he would take your only rent money to blow on some card game so he could feel like a \"baller\".",
            "Change the password to the WiFi? Easy.\nAlso this guy sounds like my brother. Puts his wants in front of his needs. Never has any money if there is a bill to pay or he owes someone money. But there is a new game or a gun or something he wants he suddenly has the exact amount for it right then and there.",
            "He needs the $4,000 because he's down $20,000 for the year and thinks he can gamble the $4,000 to come out ahead. Money going towards bills is money he can't use to make his losses back.",
            "Whole lot of very fresh accounts on Reddit this moment talking about how lucrative online betting is. I'm sure this one is totally organic and not about to turn into an advertisement.",
            "If your on the hook. Change wifi password till he's paid up. Just say, nothing personal you just gotta pay me on time. Setup automatic payments on his bank account",
            "Inconvenient but make him give you dated checks and tell him there will be a penalty if it bounces."
        ]
    },
    "God bless whoever becomes her roommate 😂😂😂": {
        "title": "God bless whoever becomes her roommate 😂😂😂",
        "score": 105,
        "url": "https://i.redd.it/wjp26cg6jf9d1.jpeg",
        "content": "",
        "num_comments": 57,
        "comments": [
            "Sheldon would be an ideal match",
            "Everyone in this comment section misunderstood the post  its so funny reading through all the comments. If you read to the end you will see she was describing herself and not the roommate she wants. Need a roommate who..?? Feel free to reach out. Thats how she put it, and that literally means if you are looking for someone who is all of these things, Im the one please contact me.",
            "She just seems like shes over the whole social media crowd who have to instagram everything and look good just for the gram photos.\n\nAs a guy who is too old to be interested in insta, I kinda agree with her. Hope she finds some solid roomies.",
            "She seems chill, just not interested in the extra nonsense that comes with college life",
            "She just named my entire persona lol ",
            "Honestly. Why do people focus on such stupid shit others do? Like how would her roommates social media or music taste affect her? Why cant she just say looking for an easygoing roommate who is academically focused and mindful of different schedules and study habits.",
            "I laughed but I would live with this person.",
            "I love it haha \nShes old school! Everyone so into themselves these days and shes over it!",
            "She doesnt sound chill she sounds judgemental as all hell. And this is someone who doesnt post on my social media very often.",
            "Doesnt fixate on the college experience *puts college logo on her profile*"
        ]
    },
    "Should I send a text? Or just leave it be ?": {
        "title": "Should I send a text? Or just leave it be ?",
        "score": 24,
        "url": "https://i.redd.it/nzmt5e15kg9d1.jpeg",
        "content": "So for context I'm living in CA, I'm parenting with a neighbor who is as well. We live in a multi family housing situation so I kinda hear everything and our trash bins are together.I've asked our property manager if they can ask her to stop putting her trash in my bins but I guess she didn't. \nI feel like I've tried being a good neighbor considering we are in similar situations. When we first met it was pretty alright and we hung out a few times. I noticed she was kinda strange but i looked past it because it was nice to have a friend.\nI just started seeing her kind of thought process, anxious, paranoid, introverted, often yelling in her home and lashing out at our manager,\nShe throws bags of trash down her steps and leaves them there. She refuses to take accountability and blames everything on others. I think she only knows how to deflect blame. It sucks and she decided to stop talking to me after I spoke up about this type of behavior. She keeps putting her trash in my trash bin, not asking, leaving hers empty for me to have mine filled or be the first one to put trash in it. I've been really nervous to send her a text because I would just want to avoid confrontation at all. \nIdk but I feel like if I don't send it I'm kind of just letting her step on me. \nIt's hard when I'm trying to be responsible for my bin and I take it out on time, bring it in on time for the most part. So like why do I have to pay for her forgetting to take hers out?\nI just feel so anxious and unsure about what to do. And it's not like she doesn't notice I take her trash out my bin anyways smh. \nShe once told me when we were hanging out that \"She's just a girl\" but gosh, she's older than me and a mother I just don't her how. I feel like I can't even be comfortable in my home a bit ngl cause I don't want anything to do with her anymore. \nIt's kinda sad\nAnyways lmk what you think or what advice you have for me\nI've been debating sending this text cause I'm feeling so nervous abt it \n",
        "num_comments": 13,
        "comments": [
            "Just put your trash in her bin if she's loading yours up while hers is empty. Record yourself looking in yours, seeing her trash, and seeing hers empty, for when she inevitably tries to use you doing that in an argument or some other petty way. Or, fivebrain, just swap the bins. \"That isnt my bin\" \"then why is your trash in it?\" You cant be civil with people who throw their garbage down stairs or sabotage you. Either get on her level or tell the manager.",
            "Is there a way you can put a lock on your bin?",
            "Remove fluff words like hi and hey and pls and be straight to the point itll assert your dominance",
            "I assume she has the same kind of bin that goes to the same place? Just put your trash in hers? It seems like maybe trash cans arent the real issue; the real issue is the rest of her behavior making you uncomfortable.",
            "This god damn page has made me terrified of having roommates I didnt honestly know people were like this lol",
            "Honestly they  might not even think about how putting their trash in your bin might bother you. It's definitely not something I would've thought about myself (never did this but my bf and his roommate have to separate bins too). You should just tell them up  front or leave a note on the bin saying not to use it unless it's you .\n\nIdk I was a very socially awkward roommate myself who didn't understand some social boundaries when I first started living with other people. Looking back on some of the things I did I totally get why my roommates were annoyed at me but at the time I didn't understand how what I did  bothered them unless they told me directly.",
            "You need to tell them in person. Make eye contact and speak up because thats the only way anyone will take you seriously. If that doesnt work I would mix condiments until it stinks and slather it onto the lid or spray the inside with fart spray. Sometimes you have to take justice into your own hands",
            "Add a lock to your trash bin. Or you can just take out whatever trash is not yours out and leave it there.",
            "Yes, please communicate with your roommates.",
            "I dont think you need to send a text. It kind of sounds like you two might need to just co exist. Put your trash in her bin, and work on filling her up. \n\nSorry but I think this person is trying to get your attention. Probably wants some kink."
        ]
    },
    "My roommate keeps coming into my room while I’m sleeping to hit my vape ": {
        "title": "My roommate keeps coming into my room while I’m sleeping to hit my vape ",
        "score": 23,
        "url": "https://www.reddit.com/r/badroommates/comments/1dr4eli/my_roommate_keeps_coming_into_my_room_while_im/",
        "content": "Hi all. I (20F) moved into a new place recently and have really hit it off with my new roommate. She’s super cool and exuberant, and has done some really nice things like brought me breakfast in bed before. I feel like I can be myself around her, but I have one main issue:\n \n\nShe (22F) keeps coming into my room while I’m sleeping (I work night shift so I’m usually trying to sleep from 8am until about 5pm) and grabbing my vape from my bed. The other day I woke up early and it wasn’t there; she had come into my room while I was sleeping and had taken it downstairs with her. I obviously don’t need it while I’m sleeping, but I feel like my privacy has been invaded. She comes into my room often when I’m home, which is NBD. There’s been multiple instances this week where she comes into my room expecting me to be sleeping, but I’m awake and then she sits on my bed waiting for the vape / immediately grabbing it. \n\nI still have a few months until I turn 21, so she’s been grabbing them for me since I moved in which I recognize is a big ask. My other roommate also hits my vape, and now I’m spending $20 every 6 days on 2 other people’s vices on top of having my privacy invaded. They will text me that they miss me and to come home from any social events, but my roommate’s boyfriend told me that they just do it so they can hit the vape . Am I in the wrong to feel this way? How do I even go about saying something since she’s doing me a favor? I realize this is such a small, trivial, and stupid thing to be upset about but it’s really making me feel weird. \n\nEDIT: I forgot to say she refuses to buy herself one because she’s “trying to quit”. ",
        "num_comments": 33,
        "comments": [
            "Lol shit I do this to my sister but thats cause shes familythis is unacceptable and broke coming from a roommate you should talk to her and find someone else to buy them for you so she doesnt hold it over your head",
            "Don't go home until you're ready to go home. Your roommates texting you they miss you and to come home while you're out is kinda weird. You're gonna need to say you're quitting too, and just hide your vape. Stop hitting it around them and stop leaving it out. You have to be more sneaky if you don't want to be confrontational and tell them to stop",
            "Lock your door at night, if you dont have one buy one. Time to be an adult and set boundaries.",
            "Why would anyone ever feel in the wrong for not liking their behavior? These posts confuse me. Its your shit - they have an addiction and are using you. They are mooching plain and simple. That shit would piss me off. \n\nStop being such a pushover wtf.",
            "Did you previously know your roommate before you moved in? Because if not, how is she okay being this disrespectful?? Also not to be crude but neither of you know where the others mouth has been/level of oral hygiene.",
            "Going against the grain here but I think its a (divine) sign for you to quit vaping!",
            "First of all, lock your door or get a doorstop for the inside. Secondly, quit. If you can't quit, tell these girls you have quit. Find someone else to buy your vapes and keep them hidden. See how much they want to hang out with you then. Don't let people get too familiar with you before you know them well.",
            "Hide it and buy a lock young one, that chick seems like shes gonna keep overstepping",
            "Shes doing a great job quittingquitting on buying her own stuff.\n\nLike others suggested, keep your door locked and think of a good place to hide the vape pen.  Maybe just carry it on your person while you are asleep.",
            "Buy her a vape, cement the friendship, but wake her up in the middle of the night to give it to her"
        ]
    }
}