{
    "My husband talked me into making a shoebox cake to go with my chocolate shoe": {
        "title": "My husband talked me into making a shoebox cake to go with my chocolate shoe",
        "score": 3897,
        "url": "https://www.reddit.com/gallery/1dlkqq9",
        "content": "The cake is a dragon fruit genoise sponge with layers of dragon fruit jelly and dragon fruit Italian meringue buttercream, all encased in chocolate ganache. ",
        "num_comments": 139,
        "comments": [
            "Good lord are you talented!",
            "YOU MADE THAT???",
            "Fucking brilliant!! Cake & hubbys idea! 🐉",
            "What the...?! I am speechless. You should post it on r/cakedecorating, they'll love it!",
            "forgive my slang, but you actually slayed. incredible work, there’s something so satisfying about that top layer on the shoebox cake. sooo well done!",
            "This is an actual piece of art, it looks absolutely incredible! Also the flavors sound delicious!",
            "This is the coolest cake I have ever seen!",
            "Wowza!! 🤩",
            "Holy cow!",
            "Love the name on the box. 😄"
        ]
    },
    "Lemon blueberry cake for my boyfriend's birthday": {
        "title": "Lemon blueberry cake for my boyfriend's birthday",
        "score": 504,
        "url": "https://www.reddit.com/gallery/1dlt1xw",
        "content": "First time making a cake by myself! 😁",
        "num_comments": 39,
        "comments": [
            "It's beautiful. You should definitely be proud of this.",
            "Beautiful! Do you mind sharing recipe?",
            "Lovely cake! Well done!",
            "I love the decoration.  Pretty and fresh. 10/10",
            "Looks absolutely delicious! Tasted great too \\*yum\\*",
            "Looks incredible, great job!",
            "How gorgeous 😍 Can we get the recipe?",
            "That looks really great and delicious!",
            "adorable cake!",
            "🥵"
        ]
    },
    "😥 Please send help": {
        "title": "😥 Please send help",
        "score": 2431,
        "url": "https://www.reddit.com/gallery/1dlgp19",
        "content": "I bake purely as a hobby, but a few months ago a family friend insisted on “hiring me” to make sugar cookies for her daughter’s bridal shower. She told me the theme was lemon and let me know what colors she wanted, but beyond that told me I could do whatever I liked. I recommended she hire a local bakery near us for the job, but she was very excited and wouldn’t take no for an answer, so I hesitantly agreed. The party is tomorrow and I made the cookies in the first picture two days ago so the icing would have plenty of time to set, but it’s been nearly 100 degrees and humid every day this week and we live in an old house with bad air circulation. I used the same icing recipe I always do (normal results in the second photo) but either I royally (😭) fucked up or the temperature is ruining the texture. Either way, please send help. She’s coming to pick up tomorrow and I spent several days making, baking, and decorating 5 dozen cookies for her that look like this and I’m so embarrassed 😭 I don’t think I have time to scrape and redo them all at my crappy amateur decorating level, but if I pulled an all nighter and gave it a hail mary would they set? Or if heat/humidity are the problem would that be even worse? For reference, my partner did a test for quality control and said they’re very yummy, but I am still freaked out. Any advice appreciated. \n",
        "num_comments": 95,
        "comments": [
            "Try placing them into a warm oven, not hot, it'll finish drying them out. When I first started doing cookies I was in an apt with no circulation and my icing was always like yours. It was either from over beating the icing or my apt being too humid. The oven trick was taught to me by the cookie elders.",
            "Here’s the thing, you let your family friend know you weren’t 100% confident AND the weather is effecting your bakes. My immediate thought when I saw them was “Humidity”.\n\nI wish I had more advice but sugar cookies aren’t my wheelhouse. I’m going to do some quick research and see if I find anything about troubleshooting. If there’s anything I think would be helpful, I’ll report back. \n\nDon’t be so hard on yourself! They look good despite their irregularities and most importantly taste good.",
            "Send help… to eat them?  You want help eating right?  Because they look bomb as heck to me!",
            "Don't be too hard on yourself - they look pretty and you set expectations accordingly with your friend. If they really aren't drying, your problem is probably that the icing itself is overmixed. If you push a finger onto it, does it feel spongy? That, plus the slightly pitted look, are usually signs of overmixing. If you scrape and re-do, I would try it with a fresh batch of icing. (As somebody who does a lot of decorated sugar cookies and has had my fair share of last minute oopsies, I'm sending hugs your way!!)",
            "Not a baker, but a cookie lover and all of these look delicious!",
            "I saw the first picture in the feed and came here expecting to find a second \"after\" picture in which they're ruined! \n\nThey look good! Sure , do what you can to help them set but If they aren't fully set that's still fine.",
            "I think those look delicious! Don't be hard on yourself OP, I think you did really well. ❤️\n\nI remember seeing another post where a baker had trouble with humidity messing with royal icing and someone had suggested using a dehydrator. The comment said that: \"Typically people buy these to make jerky or dried fruits at home, but I read this tip on a cookie blog and I love my dehydrator! Not only does it keep the cookies crisp and fresh, but it also helps your icing dry faster and more evenly.\"\n\nIt may not fix the icing but it sounds like it may help to keep the humidity from affecting the cookies. Hope this helps a bit!",
            "I think they look fine. You were very forward about your comfort level for this project and think you did everything in good faith to deliver. Don’t be so hard on yourself.",
            "My first reaction was; Oh how cute!!!!! I want those now!!!",
            "I would be over the moon to receive these. \n\nMy mom bakes sugar cookies around holidays, but mainly during the cooler part of the year because the humidity here DEFINITELY messes with them. If I were you, I wouldnt scrap the work youve done, especially if it will take you not sleeping to be able to redo them. \n\nThey are super cute and have a homemade charm about them. Be proud of your work!"
        ]
    },
    "for my moms 50th!": {
        "title": "for my moms 50th!",
        "score": 1261,
        "url": "https://www.reddit.com/gallery/1dljiuq",
        "content": "",
        "num_comments": 20,
        "comments": [
            "That cake is beautiful! The slice has me a little stressed ngl",
            "this looks so lovely! what flavour was the cake?",
            "Looks like a cake that a vintage Barbie would have!",
            "🥰",
            "well done! that's a nice crumb there...",
            "Beautiful!",
            "So whimsical and pretty!",
            "This is so nice, the cake looks great.",
            "How dare you cut the cake like that. Now I’m gonna have nightmares!",
            "Looks delicious! Do you mind sharing the recipe?"
        ]
    },
    "I baked my dog a cake for her birthday 💕": {
        "title": "I baked my dog a cake for her birthday 💕",
        "score": 455,
        "url": "https://i.redd.it/n2wnfy3p118d1.jpeg",
        "content": "",
        "num_comments": 19,
        "comments": [
            "Cutie pup. \n\nI need to know where you got this rug.",
            "Tell your doggo happy birthday, and that she's the prettiest girl and we all love her 🥹💖",
            "Yay!! Did she eat the whole thing??",
            "Your doggo looks like she's seen some things 👀",
            "Happy birthday pup🥹",
            "Happy Birthday to a beautiful doggie!  I hope she enjoyed her cake!",
            "This is so cute, the dog is so adorable.",
            "Happy birthday beautiful puppy 🩷✨",
            "I love the eyebrows so cuteeee",
            "She’s beautiful - please tell her we love her."
        ]
    }
}