{
    "A New Player’s Guide to Installing and Playing Mods": {
        "title": "A New Player’s Guide to Installing and Playing Mods",
        "score": 581,
        "url": "https://www.reddit.com/r/baldursgate/comments/plkft5/a_new_players_guide_to_installing_and_playing_mods/",
        "content": "This is a guide intended for players who are interested in modding  their game, but may be overwhelmed by the options or the installers, and  to hopefully troubleshoot common issues.\n\nYou may know me by the name CamDawg on other sites; I've done a little modding here and there.\n\n## A brief overview of modding the games\n\nModding games using the Infinity Engine—the engine that runs the  original and Enhanced Editions (EEs) of the Baldur's Gate, Planescape:  Torment, and Icewind Dale games—revolves around a tool named WeiDU (the **Wei**mer **D**ialogue **U**tility).  It's a very powerful tool for modders and allows for a high level of  interoperability between mods. For players, the important things to know  about WeiDU are:\n\n* For Windows and macOS players, WeiDU is included with mods. It’s not something you need to download yourself.\n* Linux users will need to do a one-time install of WeiDU (and a few other adjustments): suy has a [great writeup here](https://moebiusproject.gitlab.io/mods_on_linux).\n* WeiDU  installs mods through a command-line interface, e.g. on Windows it does  everything through the Command Prompt, a DOS-like interface\n* WeiDU allows mods to affect previously installed mods, making install order important, as we’ll discuss in a later section. WeiDU also has built-in mechanisms to preserve the order you select.\n* WeiDU  allows mods to be broken down into individual components so that  players can pick and choose what they want from a particular mod\n* WeiDU can uninstall or reinstall parts of mods\n\nModding a mobile or console version of IE games requires more hoops to jump through, and will not be covered here.\n\n## Important warnings before you install\n\n* *Changes from mods will end up in your save games.* The  practical upshot of this is that a save from a modded game will only  reliably work with the particular modded game that it's from—changing or  uninstalling mods mid-game may cause your save to not work.\n* *The Enhanced Editions are still being actively developed by Beamdog.*  When a new official patch is released, the update process removes any  outside files, with the effective result being that your mods get wiped  out by a new patch. Coupled with the above point, it may mean you cannot  use your old saves from modded games.\n* *Multiplayer games must all use the same mods in the same order*.  The host and clients in a multiplayer games must have matching  resources, otherwise the game may be unstable (if it allows you to  connect at all).\n\nThe takeaway is that you're better served **making a copy of your game to use with mods**,  and that you should not change your mods in the middle of a playthrough  (or, alternatively, abandon any existing saved games if you do). The  downside of playing off a copy of your game is that your Steam/GOG  Galaxy launcher will try to launch the original unmodded game and that  you may not get achievements.\n\nFor the EEs, making a new game install is easy: just copy the game folder and mod the copy. It's almost as easy for the [originals](https://www.gibberlings3.net/forums/topic/291-multiple-bg2-installations/).  On Windows, make your copy outside of the \"Program Files\" or \"Program  Files (x86)\", as Windows can sometimes interfere with the installers  trying to make changes inside these folders.\n\n## What about mod managers?\n\nWhile there is a proliferation of mods, there have been few notable attempts at a mod manager. There are four of note, and all but one are for Windows:\n\n* *The Big World Project/Big World Setup (BWP/BWS):* This  was a combination of an install tool and database of installation order  information for the original games. Unfortunately, the sheer magnitude  of the project—namely trying to keep track of the optimal order of  hundreds of mods as well as their conflicts—was simply unmanageable.  While the database of mods and install orders still gets sporadic  updates, the tool itself has not been meaningfully updated in years.\n* *Project Infinity (PI)*: [Project Infinity](https://forums.beamdog.com/discussion/74335/project-infinity-mod-manager-for-baldurs-gate-icewind-dale-planescape-torment-and-eet/p1)  is a new tool from AL|EN, one of the BWS contributors, and worth a look. Its goal  is to provide the same level of functionality as BWS without the  unmaintainable aspects of the project, e.g. it gives optional tools for  modders to provide install order information, or you can use  community-derived install orders. You can get started with the [PI documentation](https://forums.beamdog.com/discussion/74335/project-infinity-public-beta-for-all/p1) or this [tutorial video](https://www.youtube.com/watch?v=wt1mWX2zo_4) from morpheus562. PI is still in development.\n* *The Mac WeiDU Launcher (MWL)*: Worth a look as well, the WML is a [utility for macOS](https://www.gibberlings3.net/forums/topic/31343-mac-weidu-launcher-easy-mod-installation-on-macos/) that will allow you to install mods on macOS without having to muck around at the command-line.\n* *EE Mod Setup Tool:* A fork of the old BWS tool for the new EE  games. Unfortunately, the project uses unofficial, outdated, and  unsupported versions of mods added against the authors' wishes.\n\n## Gather your mods before venturing forth\n\nSorting out which mod should get installed in what order can be  difficult even for veteran players, so keep it simple for your first  time. Maybe you have your eye on a new NPC, or see some kits that look fun, or want some quality-of-life changes.\n\nMost mods are hosted by one of the big modding communities: [The Gibberlings Three (G3),](https://www.gibberlings3.net/) [Pocket Plane Group (PPG)](https://www.pocketplane.net/), [Spellhold Studios (SHS)](http://www.spellholdstudios.net/), or [Weasel Mods (WM)](https://weaselmods.net/). You can also find some on the [Beamdog forums](https://forums.beamdog.com/)  or other communities. For most mods, you can check out the readme as a  preview before deciding whether or not to download and play it. While  some mods are packaged with a “universal installer”, most will have  platform-specific packages (Windows, macOS, or Linux) so make sure you  download the correct version. (Note that some mods still refer to macOS  as OS X.) Always uses the latest official release of a mod; e.g. don't  download the latest 'master' from Github or something you find on a  random Dropbox. If you're unsure if whether you have the latest and  greatest, ask on the forums!\n\nUnfortunately, there’s not a lot of consistency on how mods are  packaged. On Windows, mods are generally rar/zip files or  self-extracting archives or even with a full installer. The former need  to be extracted, and the latter will extract themselves and (usually)  try to start their installation process. For macOS and Linux, the mods  are simply packaged as zips or tarballs.\n\nFor now, just download the mods into a separate folder.\n\n## A brief aside about conversion projects\n\nThere are a handful of larger conversion projects that essentially  bring the contents of one game into another, typically because the  latter’s engine provides some advantage or convenience. While these  conversions have become a lot easier and bulletproof and are generally  all-around high-quality mods, they’re still not something I’d recommend  for a new mod player. A brief overview of the more popular conversion  mods follows:\n\n* *Baldur’s Gate To Two (Tutu)* is a project for the original games. It brings the content of BG into the BG2 engine, allowing you to play through the story of Baldur’s Gate with the conveniences of BG2,  such as kits, dual-wielding, better resolutions, expanded spell  selection, etc. Once you complete Tutu, you have to export your  characters to a BG2 installation to continue.\n* *Baldur’s Gate Trilogy (BGT)*, like Tutu, is a mod for the original games that imports BG content into BG2. Unlike Tutu, though, it combines BG and BG2 into a single, playable experience from the start of BG in Candlekeep through the saga’s conclusion in BG2’s Throne of Bhaal.\n* *Enhanced Edition Trilogy (EET)* is like BGT, except it’s for the Enhanced Editions of the games. EET is a little more expansive than BGT  but is still in development and requires some extra care with install  orders. As such, it's not something I'd recommend for a player new to  modding. .\n* Mods known as *Total Conversions (TC)* aim to replace the  entire content of a game with alternative content. While such mods are  uncommon, I'd still recommend players to avoid these for their first  time, as they come with their own set of compatibility issues to be  resolved.\n\n## Sorting out the install order\n\nSince WeiDU  mods can not only change game resources, but content from other mods,  it becomes important to resolve an installation order before you begin. A  good general guideline is as follows:\n\n* **Special:**  If you're modding a game with Siege of Dragonspear from Steam or GOG, you must run a mod called [DLC Merger](https://forums.beamdog.com/discussion/71305/mod-dlc-merger-merge-steam-gog-sod-dlc-or-custom-dlcs-with-the-main-game) on your game before you can install any other WeiDU-based mod. Some mods may recommend a program named ModMerge instead, but DLC Merger is the preferred method these days.\n* **Fixes.** Many mods create new  resources from the existing ones, so getting in the fixes early prevents  errors in the original files from propagating to mod files. Examples  include the [BG2 Fixpack](https://www.gibberlings3.net/mods/fixes/bg2fixpack/) or the [IWD Fixpack](https://www.gibberlings3.net/mods/fixes/iwd_fixpack/).\n* **Atypical Content Mods.** This category is a little hard to describe. There are some mods that don't really interact much with other mods (e.g. Ace's [Alternate Soundtrack](https://www.gibberlings3.net/mods/other/altmusic/)) or which are designed to only alter original game files (e.g. [Improved BAMs](https://www.gibberlings3.net/mods/other/impbams/)) without worrying about modded content. Because of how WeiDU  handles and preserves installation order, the earlier you can place  mods like this the easier it will make any future mod updates to your  installation. This is also a pretty good place for item/store mods,  especially if they're stable and unlikely to be updated often.\n* **Quests/Other Content.** Once you've got a solid base, it's time to start adding actual content. Examples include [Ascension](https://www.gibberlings3.net/mods/quests/ascension/) or [BG Quests and Encounters](https://www.gibberlings3.net/mods/quests/bgqe/).\n* **NPCs.** NPCs should go after quests simply because some NPCs will detect modded quest content and provide interaction with it. You may find a mod NPC commenting on a mod quest, but only if the NPC follows the quest in the installation order. Examples include [Mur'Neth](https://www.gibberlings3.net/mods/npcs/murneth/) and [Amber](https://www.gibberlings3.net/mods/npcs/amber/).\n* **Tweak mods/tactical mods.** Most in  this category are written to be universal, i.e. they'll freely change  items/creatures/scripts/etc. from other mods, but they can only do so if  those resources are present when they're installed. This is why just  about every tweak mod suggests it goes last in the install order.  Examples include [Sword Coast Stratagems](https://www.gibberlings3.net/mods/tweaks/scs/) and [Tweaks Anthology](https://www.gibberlings3.net/mods/tweaks/tweaks/).\n\nWithin each category, another good rule of thumb is to go with older mods first.\n\nThere are, of course, all sorts of exceptions, or mods that really don't fall cleanly into a category. **The  readmes are there for a reason, and most modders try to help players  avoid issues with install recommendations and compatibility concerns.** If a mod has a forum, it’s also a great resource to learn about where it should go in the install order.\n\nOnce you have an order in mind, feel free to ask other players about it.\n\n## Can we please just install some mods, finally?\n\nOK, so let’s recap our preparations:\n\n* We’ve made a copy of our game to mod.\n* We’ve downloaded the mods we’d like to play into a folder.\n* We’ve read the readmes for these mods, double-checking that they’re compatible with one another.\n* We’ve decided on an installation order for these mods.\n\nSo let’s get started with a mod installation. A few points before you begin:\n\n* Do not install mods while the game is running.\n* Do not install mods while a game editor is running, e.g. EEKeeper, Near Infinity, etc.\n* Only install one mod at a time.\n* Never close the installer window by using the 'X' in the upper right corner. Always properly quit the installer.\n\nI’ll be using [Tweaks Anthology](https://www.gibberlings3.net/mods/tweaks/tweaks/) as an example.\n\n## Windows\n\nTweaks Anthology for Windows is distributed as a self-extracting  archive. You can double-click the archive and follow the instructions on  screen and it will launch the installer.\n\nhttps://preview.redd.it/fhurx26n9om71.jpg?width=1098&format=pjpg&auto=webp&s=e19c3313b6c65c42fbc143bb1b156153b12ce88a\n\nAlternatively, the files can be extracted into your game directory using [7zip](http://www.7-zip.org/download.html) or [WinRAR](http://www.rarlab.com/download.htm). When properly extracted, your game directory will contain **setup-cdtweaks.exe** and the folder **cdtweaks**. To install, double-click **setup-cdtweaks.exe**.\n\nAt a minimum, every mod will add a folder and a setup-ModName.exe file  to your game folder. Some mods include their readme file and a tp2 file  in the game directory, but most mods these days place these inside their  own folder.\n\nEither way you choose, once the installer is open, skip ahead to the \"The installer is running\" section.\n\n## macOS\n\nThe Tweaks Anthology for macOS is distributed as a compressed tarball.  First, extract the files from the tarball into your game directory. When  properly extracted, your game directory will contain **setup-cdtweaks**, **setup-cdtweaks.command**, and the folder **cdtweaks**.  At a minimum, every mod will add a folder, setup-ModName, and a  setup-ModName.command file to your game folder. Some mods include their  readme file and a tp2 file in the game directory, but most mods these  days place these inside their own folder.\n\nOnce the installer is open, skip ahead to the \"The installer is running\" section.\n\n## Linux\n\nProvided you've [already installed WeiDU](https://moebiusproject.gitlab.io/mods_on_linux)  (a one-time affair), install is simple. The Tweaks Anthology for Linux  is distributed as a compressed tarball; extract the contents of the mod  to the folder of the game you wish to modify. Use cd to change to your  game installation directory, and run WeInstall cdtweaks in your game  folder.\n\nOnce the installer is open, continue below.\n\n## The installer is now running\n\nOn Windows and macOS, the first thing the installer tries to do is  update itself to the latest version. It does this by checking for other WeiDU  installers; this process is automatic but it may create a few messages  at the top of the installer window (blue in screenshot, below)\n\n**\\[Optional\\]** Next, if a mod is available in multiple  languages, it will ask you which language you want to use (red, below).  If a mod does not have translations, you will go to the next step.\n\nhttps://preview.redd.it/44bgrdwr9om71.jpg?width=979&format=pjpg&auto=webp&s=b9f2db5e02e0d5f2e5fa13e680341f6fcad35bf5\n\n**\\[Optional, One-Time\\]** If you're modding an Enhanced  Edition game, the very first time you run a mod, you will be prompted to  select a language for the game itself (red, below). Note that this  order of languages will likely differ from a mod's language selections.  If you select the wrong language in this step, all of the new mod text  will show up as \"Invalid:xxx\". If you accidentally select the wrong  language, quit before installing anything, delete weidu.conf from your game folder, and start over.\n\nhttps://preview.redd.it/i9np0ews9om71.jpg?width=979&format=pjpg&auto=webp&s=7eb01ffe78aa0113e5850d1c7bef9c5da17f7d30\n\n**\\[Optional\\]** Some mods will include a prompt to display  the readme (red, below) before continuing. Selecting yes or no will not  change the rest of the installation.\n\nhttps://preview.redd.it/g2l77y1u9om71.jpg?width=979&format=pjpg&auto=webp&s=3d8c6d1d8906e63c89b78887f349699ab655b44d\n\n**\\[Optional\\]** Larger mods, such as Tweaks Anthology, will  break their individual components into categories--five in this case:  Cosmetic, Content, Rule Changes, Convenience Tweaks/Cheats, and NPCs (red, below). This will allow you to skip entire sections of the mod if you're not interested; select yes or no as appropriate.\n\nhttps://preview.redd.it/78st9bgw9om71.jpg?width=979&format=pjpg&auto=webp&s=9acef7f85d230e61f579432cadfdd68ed03bdc48\n\nFinally, we're at an actual component to install (red, below). You're prompted with the name of the component (Remove Helmet Animations) and prompted to answer\n\n* \\[**I**\\]nstall - install the contents of this component\n* \\[**N**\\]ot install - Do not install this component\n* \\[**Q**\\]uit - Quit the installer completely with no further changes.\n\nhttps://preview.redd.it/0bb4f76x9om71.jpg?width=979&format=pjpg&auto=webp&s=979f435c5a7ac9c3ec7688f9c3050a8a4b09ee9a\n\nIf you choose to Not Install, the installer will move on to the next component.\n\nIf you choose to install, the installer will start making changes and will provide feedback (red, below) in the window:\n\nhttps://preview.redd.it/mexbngny9om71.jpg?width=979&format=pjpg&auto=webp&s=ebaddc982f4e16f150339d4de88a48103d0a696a\n\nOnce it's done, it moves on to the next component. Note that, in this  case, the installer has skipped some components automatically (blue, above).  I'm running the installer on Icewind Dale, so it automatically skips  components related to Imoen, Nalia, and Viconia since they're not in  Icewind Dale.\n\nOnce you select quit, or reach the end of components, WeiDU will provide a brief summary (red, below) and prompt you to press Enter to exit.\n\nhttps://preview.redd.it/ztcnb5uz9om71.jpg?width=979&format=pjpg&auto=webp&s=713f3211dc4b15d6b84bd438e41a8be99976f926\n\nSimply repeat this process for each individual mod.\n\n## Troubleshooting Installation Issues\n\n**Problem:** When you try to launch a mod installer, you see the message\n\n    \"Please run this program in your Infinity Engine game directory. \n    \n    FATAL ERROR: Failure(\"Not a game directory\") \n    \n    Press ENTER to exit.\" \n\n**Solution:** You've launched the installer somewhere  other than your game directory. Simply move the files into your game  directory and try again.\n\n**Problem:** When you try to launch a mod installer, you see the message\n\n    \"ERROR: Unable to find DIALOG.TLK in: \n    \n            dialog.tlk \n    \n    Please run this program in your Infinity Engine game directory. \n    \n    FATAL ERROR: Failure(\"Unable to find DIALOG.TLK\") \n    \n    Press ENTER to exit.\" \n\n**Solution:** You've launched a mod with a very old version of WeiDU on an Enhanced Edition game. It's unlikely this mod will work on the Enhanced Editions even with a newer version of WeiDU; check the mod's home page for an updated version.\n\n**Problem:** A mod installs \"with warnings\"\n\nhttps://preview.redd.it/oz2ai7p1aom71.jpg?width=979&format=pjpg&auto=webp&s=5e441233fd1050d63d9e9c07bb07b246bd336ee1\n\n**Solution:** \"With warnings\" means that a mod installed,  but it may not have modified all the resources that it expected to  modify or files were unexpectedly different. Check with the mod author  or visit the mod's forum to find more information. It could be harmless,  e.g. the mod is being careful, or it could be something worse.\n\n**Problem:** A mod encounters an error and fails to install a component.\n\nhttps://preview.redd.it/l7ig0dl2aom71.jpg?width=979&format=pjpg&auto=webp&s=3ab7cec090c2b3e9cec3a52093885c1c7ef89e9e\n\n**Solution:** In this case, there's something wrong in the mod itself and you'll need to contact the author. In your game folder, WeiDU  creates a text file named \"SETUP-MODNAME.DEBUG\". Send this to the  author or post it to the mod forum with as much information as you can.  Some authors will also request a copy of weidu.log, a text file that contains a list of all installed mods, to help them investigate if the issue is with another mod.\n\n## You've modded your first game!\n\nHuzzah! Now go play it!\n\nThe keen-eyed will notice you have some new files in your game folder;  these files are needed and should not be deleted. Every mod generates a  DEBUG file, which is a log from the mod's installation. You will also  have one weidu.log file, which keeps track of which mods and components you have installed, and in what order. On EE games, you will also have a weidu.conf file which WeiDU uses to track which language of the game you're modding.\n\nEvery mod also keeps a backup folder so that it can be uninstalled.  Typically these are kept inside the mod folder (e.g. the one for Tweaks  Anthology is in cdtweaks/backup) but some use a folder named  weidu\\_external. Because these are needed for future changes (or  uninstalling), y*ou should never delete a mod folder if the mod is installed*.\n\nIf you should run into a bug, **please report it**.  Authors don't like having a buggy mod any more than you like playing it,  but they can only fix bugs they know about. Have your DEBUG file handy!  If you're not sure which mod is causing a bug, report it to any author  whose mod it might be or feel free to ask on some general discussion  forums or Discord.\n\nAgain, because I cannot emphasize this enough: **please report bugs to the authors**!\n\n## I've changed my mind, I want different mods\n\nYou can change your mod selection at any point. However, there are a few caveats:\n\n* As mentioned above, mod content can get included in your save game and  there is no guarantee that your old save games will work with your new  mod selections. As such, you should plan on starting a new game if you  change your mod loadout.\n* Because of WeiDU's  onion layer approach (see below), if you're making a lot of changes it  may be easier to start over with a fresh copy of the game.\n\nYou can uninstall or re-install a mod by re-opening its setup program.  Instead of Install/Not Install/Quit, prompts for components that are  installed are now Reinstall/Uninstall/Quit. If you uninstall or  reinstall a component, WeiDU will try to preserve your mod order. Let's say you've installed some mods on BG2, in this order:\n\n1. Arcane and Divine Spell Packs, from IWDification\n2. The G3 Anniversary Mod\n3. Wheels of Prophecy\n4. Multiple components from Tweaks Anthology\n\nAfter thinking it over, you've decided that the G3 Anniversary mod isn't for you. So you open up the G3 Anniversary setup program and select Uninstall. Wait, why is WeiDU uninstalling Tweaks Anthology? And now Wheels of Prophecy?\n\nWeiDU acknowledges that you're removing G3 Anniversary, so it's goal is to make your installed mod order this:\n\n1. Arcane and Divine Spell Packs, from IWDification\n2. Wheels of Prophecy\n3. Multiple components from Tweaks Anthology\n\nIt accomplishes this by treating the mods as layers of an onion: it  will uninstall all of the components from Tweaks Anthology, then  uninstall Wheels of Prophecy, then uninstall G3  Anniversary, then (to preserve your mod order) it will re-install  Wheels of Prophecy and then re-install your previous selection of  components from Tweaks Anthology. It will remember and re-apply whatever  you have selected from Wheels and Tweaks; you do not need to select  these again.\n\nSimilarly, if you have a modded install and decide to add more mods,  they will be added to the top of the stack--which may not be an ideal  place in the mod order.\n\n## Some final tips and closing comments\n\nOne more time for the kids in the back: **please report bugs to the authors**! Make a separate game folder to be modded. Don't install mods while the game is open and always let the installer finish.\n\nFor troubleshooting bugs encountered in game, it may be beneficial to  enable the console. You can learn how to enable the console and find  some useful commands here: [Enhanced Editions (all games)](https://gibberlings3.github.io/iesdp/appendices/clua/bgee.htm) or the original versions of [BG](https://gibberlings3.github.io/iesdp/appendices/clua/bg1.htm), [BG2](https://gibberlings3.github.io/iesdp/appendices/clua/bg2.htm), [ IWD](https://gibberlings3.github.io/iesdp/appendices/clua/iwd.htm), or [ IWD2](https://gibberlings3.github.io/iesdp/appendices/clua/iwd2.htm).\n\nThere are lots of folks who love these games, and love them even more  when they're modded. Feel free to come and talk with them on the [forums](https://www.gibberlings3.net/forums) or on [Discord](https://discord.gg/yTzjMTb)!\n\nI'd like to thank folks who were kind enough to provide feedback on earlier drafts: AL|EN, Angel, DavidW, jastey, Mike1072, suy, and theacefes.\n\nIf you have any suggestions or questions, feel free to reply and I'll do my best to answer.\n\n## Edit history\n\n9/12/21: Added info on the Mac WeiDU Launcher\n\n1/11/22: Linked some Project Infinity tutorials",
        "num_comments": 94,
        "comments": [
            "Damn this post is longer than BG trilogy.",
            ">I've done a little modding here and there.\n\nYou are far too modest. Thank you very much for the comprehensive write-up. :)",
            "Thank you so much for this!  Not just for new players.   I've been playing this game for 20+ years, and still get stuck modding (or remodding when I upgrade my PC)\n\nI've copied this to a Word Doc, and saved in 3 different places, so I can hopefully find it again when I need it.",
            "I highly recommend Project Infinity. Easiest way I found to set up blind installs, which saves so much time of you run into trouble.",
            "Having failed to mod in the past and give up, I salute you sir!",
            "Does anyone live in the Los Angeles area that could help me put all these mods (SCS etc) on my MacBook? I'd pay $40 bucks and drive to wherever you are. Embarrassing but I've become computer illiterate as time goes on.",
            "Great post and as a new player, really helpful! Thanks a lot!!!",
            "So, what is the best mod?",
            "very helpful even as a not new (I'm not old!) player",
            "Gonna' pile on, and say this is fantastic---and it is---but I really just wanted to thank you and the other G3 senior posters/mods, for all of the help you've given me playing your mods."
        ]
    },
    "How to do Combat on the PS4 Version?": {
        "title": "How to do Combat on the PS4 Version?",
        "score": 8,
        "url": "https://www.reddit.com/r/baldursgate/comments/1dradm5/how_to_do_combat_on_the_ps4_version/",
        "content": "I'm starting yet another playthrough on the PS4 version.  I can get the point and click aspect just fine, but when it comes to doing anything in combat such as thwacking enemies or using a skill, i'm finding it a bit too cumbersome.  Any advice?",
        "num_comments": 6,
        "comments": [
            "Kick 'em in the head 'til they 're dead!",
            "Configure your autopause to go off frequently. Keep your finger near the start button at all times so you can pause to react to changes. Remember which button brings up the cursor so you can micro more effectively.\n\nIf you can't get used to it then you could try on PC. I haven't had any trouble racking up 1000 hours on switch though.",
            "The game runs great on PlayStation. The controls took some getting used to, sure, but once you adapt it feels fluid. Even at its worst its definitely not junk.",
            "People think because \n\n1. The game exists\n2. They don't feel like sitting at a computer they want to slouch on the couch and tap on their phone\n3. Someone made a port to their device of choice\n4. Therefore it should work good because they want it to\n\nNope. No. It doesn't. Never can, never could. You purchased junk. Like stuff you buy at Sunsations beach shop on vacation. It's junk. Ya bought junk. Someone made it because people will buy it. Not because it's good or works.\n\nThere needs to be a sticky so people stop asking how they're supposed to do things on mobile or console. You're not. That's the answer. It's bad. You got taken to the cleaners. Fleeced. Bamboozled. Ya got played, son. The sooner you accept it the better you can be at life going forward. Make better choices.",
            "Play in PC?",
            "/thread"
        ]
    },
    "Can I finish quests from act 2 after spellhold?": {
        "title": "Can I finish quests from act 2 after spellhold?",
        "score": 5,
        "url": "https://www.reddit.com/r/baldursgate/comments/1dr6n4n/can_i_finish_quests_from_act_2_after_spellhold/",
        "content": "I still have a bunch of quests to go to locations outside of Athkatla but I already did spellhold and am currently trying to get off the island. Did I mess up by doing spellhold too early or will I be able to go back later?",
        "num_comments": 8,
        "comments": [
            "almost nothing from chapter 2 is missable.\n\ni think perhaps only the mae'var quest is missable if you sided with bodhi?",
            "Yes, though you may feel overleveled and/or have too much quality gear for them to feel like much of a challenge. Of course, this is all dependent on what you haven't done yet, what mods (if any) you are using, and the difficulty you're playing on. A lot of players leave the Act 2 quests with dragons for later in the game, for example, but most of the other ones are balanced for lower level parties.\n\nHowever, the fact that you're asking this at all probably means you're playing the game for the first time, so the answer to your question, is: no, you didn't mess anything up. It should be pretty obvious when you reach the point of no return in the game where if you proceed, you can't go back.",
            "You have a long road ahead, but you will return back to athkatla after that road.\n\nIt's why BG2 is so good.",
            "I always get Imoen first, then chapter 2 side quests. I will get powerful enough to get staff of the magi, and then go straight to spell hold.",
            "Hexxat quest too I think.",
            "Ok that's a weight off my mind. I don't really mind if I'm over leveled I just want experience the game and have fun role-playing my character.",
            "In BG2 SoA some encounters scale with your level. If you do that quest later, loot and quest XP wil be the same, but you will find some 'random' enemies harder.\n\nFor example, you may find a Beholder where you should find a Gauth, or more of them.\n\nEdit: The answer to the main question is: no, do not worry, you can do that quests later.",
            "Yes, you can do things later. Prolonging it while Imoen is in Spellhold makes her less useful later, is unnecessary and cruel. Not exactly wrong though - you aren't technically forced to make her join anymore, and this might be exactly what you roleplay your character to be, after all!"
        ]
    },
    "I’m Stuck in Shade Lich area Beneath Sewers": {
        "title": "I’m Stuck in Shade Lich area Beneath Sewers",
        "score": 1,
        "url": "https://www.reddit.com/r/baldursgate/comments/1dre9si/im_stuck_in_shade_lich_area_beneath_sewers/",
        "content": "\nHelp!! Please!! I’m stuck in this area and all key doors are locked. No key. I’ve already killed the shade lich, the unseeing eye beholder, created the rod and returned it, given it to the Avatar. I just want to go back and see Gaal one last time finish he quest and go up. But I no longer have the keys or the rod, and these doors are locked. I am stuck. I can go down to the Cult compound area, and all enemies seem to respawn. I come back up and I’m\nJust stuck here. Sassar  even thanked me and walked away. What do I do? Because of excessive saving, I don’t have a visible old enough game to get back out of the situation.",
        "num_comments": 0,
        "comments": []
    },
    "Poll: How many rounds do you spend casting buffs?": {
        "title": "Poll: How many rounds do you spend casting buffs?",
        "score": 0,
        "url": "https://www.reddit.com/r/baldursgate/comments/1drdr0g/poll_how_many_rounds_do_you_spend_casting_buffs/",
        "content": "I exclude long duration buffs like Stoneskin or Remove Fear because you cast them once after rest.\n\nShort buffs like Haste, Draw upon Holy Might and True Sight are strong but are annoying to recast. It's tedious if you pre-buff every time.\n\nHow many rounds do you spend?\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n[View Poll](https://www.reddit.com/poll/1drdr0g)",
        "num_comments": 2,
        "comments": [
            "Which fight are we talking about? Ascension SCS Amelyssan? I'll spend 5 minutes pre buffing myself. A random enemy encounter?  Why would i even pre buff outside the usual stoneskin.",
            "Haste/improved haste, mirror image, spell immunity, entropy shield (iwd spells). I rarely bother with other short duration pre-buffs."
        ]
    }
}