{
    "Bambu Lab Store just turned two and our biggest sale is now live! 🎉": {
        "title": "Bambu Lab Store just turned two and our biggest sale is now live! 🎉",
        "score": 214,
        "url": "https://www.reddit.com/r/BambuLab/comments/1d8owyx/bambu_lab_store_just_turned_two_and_our_biggest/",
        "content": "Bambu Lab Store just turned two and our biggest sale is now live! 🎉\n\nWe're stoked to celebrate this milestone with you awesome folks. It's been a wild ride packed with innovation, creativity, and of course, tons of 3D printing fun!✌️\n\n**Save Big** on your favorite 3D printers!🎁\n\nClick here now: [Bambu Lab Store 2nd Anniversary](https://bit.ly/3Ra8GEk)\n\nhttps://preview.redd.it/oe60yhk70r4d1.png?width=1280&format=png&auto=webp&s=0e2432be0ab48132e67295b8cc501442f37da5d7\n\nhttps://preview.redd.it/te7hfhk70r4d1.png?width=2250&format=png&auto=webp&s=b97a1708a76e08c899bc68d7e80421503d87b771\n\nhttps://preview.redd.it/sx0juhk70r4d1.png?width=2250&format=png&auto=webp&s=6a9883642608eadb426c1a5c7e9d7eaafa0c8a50\n\nhttps://preview.redd.it/ead966l70r4d1.png?width=2250&format=png&auto=webp&s=298c75af9919e25b8a1839bd5a2e0b1e27dd31a4\n\nhttps://preview.redd.it/w8i3glk70r4d1.png?width=2250&format=png&auto=webp&s=5666fdd4af2dc5a468b5a1410632abee4b1633fc\n\nhttps://preview.redd.it/h4g1pfl70r4d1.png?width=2250&format=png&auto=webp&s=1d507d8eadfc89e12bf8235160bc5153cfbad7c4\n\nhttps://preview.redd.it/4gpaf5l70r4d1.jpg?width=2250&format=pjpg&auto=webp&s=c49956c94e15eaf4136b37b386d1264fe4d5caf1\n\nhttps://preview.redd.it/epv835l70r4d1.jpg?width=2250&format=pjpg&auto=webp&s=33f9e910898822089db6309c45303042e7db2c42\n\n&#x200B;",
        "num_comments": 344,
        "comments": [
            "I don't need anything, I don't need anything, I don't need anything. Trying to convince myself.",
            "Been looking at purchasing a Bambu for a while. Finally decided to pull the trigger yesterday. Went into the website last night and saw the sale. Had my cart built and checked out as soon as the promo prices went live. I'm very excited.",
            "Just so everyone is aware. Previous prices were cheaper for up to 3 rolls.\n\nEdit: corrected a typo.\n\nhttps://preview.redd.it/nnj4q3c92r4d1.jpeg?width=1080&format=pjpg&auto=webp&s=4a0e5d2c65ceb36abd62c055c07f5266e061093f",
            "Micro Center has the same prices going AND if you have the Micro Center Insider Card you get an additional 10% off the purchase rather than the normal 5%.\n\nhttps://www.microcenter.com/brand/4294804936/bambu-lab",
            "In for an A1 mini, will be perfect for when my P1S is busy",
            "I got myself an A1 (without the AMS). This is my first printer so I am super excited.",
            "just ordered a x1c😍\nhope arrives quickly",
            "Remember Bambulabs has a big event later this month where they will likely roll out the next line of printers and the sale will be going for a full month. \n\nDon't jump on these \"deals\" just yet, wait until after the event/announcement as the sale will still be going and then decide.  No one wants to buy a last gen printer days before the next gen releases!",
            "Just wanted to point out if you're purchasing an A1. The \"[0.2mm/0.4mm/0.6mm Hotends Kit - A1 Series](https://us.store.bambulab.com/products/a1-series-hotends-kit?variant=41581106135176)\" is only 21% off when purchased with the printer. However, you can purchase the three accessories independently for 35% off instead, saving yourself money. This also lets you choose which hotends you want, instead of being stuck with the 0,2/0.4/0.6 in the kit.\n\n  \nI did not notice this in time for my order, but hopefully someone else can benefit.",
            "Bought the P1S combo! Good bye Ender 3 Neo. Anyone add recommendations for someone new to Bambu?"
        ]
    },
    "Giveaway Now: Ultimate Bambu Lab Printer Workspace Challenge!🎁": {
        "title": "Giveaway Now: Ultimate Bambu Lab Printer Workspace Challenge!🎁",
        "score": 23,
        "url": "https://www.reddit.com/r/BambuLab/comments/1d8osqk/giveaway_now_ultimate_bambu_lab_printer_workspace/",
        "content": "We've seen some truly epic #BambuLabWorkspace this time around! From strategically placed printers (bedside printing anyone?) to colorful organizational masterpieces, you've shown us your dedication to 3D printing  \n**Get ready for the drumroll... the winners are!**   \n**List of Winners:**\n\n1. Brilliant solutions for limited place——【pat1926】——Bambu X1C Combo [https://www.reddit.com/r/BambuLab/comments/1dg8zzj/a\\_small\\_apt\\_means\\_hiding\\_a\\_3d\\_printing\\_oasis\\_in](https://www.reddit.com/r/BambuLab/comments/1dg8zzj/a_small_apt_means_hiding_a_3d_printing_oasis_in)\n2. Addicted to color——【gnarlykitten】——Bambu A1 Combo [https://www.reddit.com/r/BambuLab/comments/1dg8i28/i\\_wanted\\_to\\_make\\_my\\_workspace\\_look\\_fun\\_and/#lightbox](https://www.reddit.com/r/BambuLab/comments/1dg8i28/i_wanted_to_make_my_workspace_look_fun_and/#lightbox)\n3. Oops, glad that it is not mine——【Lambaline】——Bambu P1S Combo [https://www.reddit.com/r/BambuLab/comments/1dh1885/closet\\_micro\\_manufacturing\\_lab/#lightbox](https://www.reddit.com/r/BambuLab/comments/1dh1885/closet_micro_manufacturing_lab/#lightbox)\n4. Four-leaf clover award——【sliver-pear】——Bambu A1mini Combo [https://www.reddit.com/r/BambuLab/comments/1d978uj/its\\_not\\_much\\_but\\_its\\_a\\_space\\_for\\_me/#lightbox](https://www.reddit.com/r/BambuLab/comments/1d978uj/its_not_much_but_its_a_space_for_me/#lightbox)\n\nDon't hesitate to get in touch with Bambu Lab for shipping information, and we will send you the prize as soon as possible.\n\nhttps://preview.redd.it/lp1a5g05zq4d1.png?width=1600&format=png&auto=webp&s=f2451c77ba4ef72caae934c541fad91c8ecfad36\n\n\n\nOn the second anniversary of Bambu Lab, show off your most organized, most creative, or just real setup.\n\nWhere does your creativity take root? Whether it's a cozy corner, a dedicated desk, or an innovative setup, don't hesitate to share your creative printing workspace!\n\nShare your Bambu Lab printing station for a chance to bring home a Bambu Lab printer for your creativity!🎉\n\nThis giveaway was sponsored by Bambu Lab Store 2nd Anniversary, make sure to check that out [**https://store.bambulab.com/pages/2nd-anniversary-sale**](https://store.bambulab.com/pages/2nd-anniversary-sale)\n\n\n\n**How to：**\n\n1. Capture your printing station with Bambu Lab printers in photos or videos, and pose them on the Bambu Lab Official Facebook group with **#BambuLabWorkspace** and Bambu Lab subreddit with the post flair **#BambuLabWorkspace**\n2. The campaign will take place on seven verified groups: Bambu Lab Official User Group, Bambu Lab 3D Printers Users Group, Bambu Lab 3D Printers Users Group, BambuLab X1 & P1 - Functional 3D printing, Bambu Lab 3D Unofficial Group, Bambu Lab P1P/P1S Owners, Bambu Lab 3D Printers Users Group, Bambu Lab 4 Beginners, Women and girls 3D printing Bambu Edition and r/BambuLab.\n3. Only content that includes the hashtag **#BambuLabWorkspace** will be considered as participating in the campaign.\n4. The prize selection is specific to every platform, and data cannot be combined across platforms. A user can only receive one award on one platform.\n5. Winners will be contacted via private message from Bambu Lab. Please provide your delivery information within 5 days of receiving our message; otherwise, you will be disqualified from receiving the prize.\n\n**Platforms:**\n\nFacebook Group-\n\n[**Bambu Lab Official User Group**](https://www.facebook.com/groups/bambulabofficialusers/)，\n\n[**Bambu Lab 3D Printers Users Group**](https://www.facebook.com/groups/bambulabs/)，\n\n[**Bambu Lab A1 Series Owners**](https://www.facebook.com/groups/347361777639832/)\n\n[**BambuLab X1 & P1 - Functional 3D printing**](https://www.facebook.com/groups/bambux1/)，\n\n[**Bambu Lab 3D Unofficial Group**](https://www.facebook.com/groups/545438466970652/)，\n\n[**Bambu Lab P1P/P1S Owners**](https://www.facebook.com/groups/2760528387411877/)，\n\n[**Bambu Lab 4 Beginners**](https://www.facebook.com/groups/284220954250555/)\n\n[**Women And Girls 3D Printing Bambu Edition**](https://www.facebook.com/groups/womenandgirls3dprintingbambuedition/)\n\nSubreddit-\n\n[**https://www.reddit.com/r/BambuLab**](https://www.reddit.com/r/BambuLab)\n\n\n\n**Activity Period：**\n\nStarts on: 5th June 2024,\n\nEnds on: 15th June 2024,\n\nWinner Announcement: 21st June 2024\n\n\n\n**The prize：**\n\n1. Brilliant solutions for limited place——Bambu X1C Combo\n2. Addicted to color——Bambu A1 Combo\n3. Oops, glad that it is not mine——Bambu P1S Combo\n4. Four-leaf clover award——Bambu A1mini Combo\n\n\n\n**Winner Selection Criteria:**\n\nThe total number of winners is 36 from 9 social media groups.\n\nWinners will be selected by the Bambu Lab Team and moderators, considering factors such as the overall performance of their entries, quality, creativity, originality, relevance to the theme, and emotional expression.\n\n**Entries can only win once across all contest groups**\n\n\n\n**Terms and Conditions:**\n\n* By participating in the campaign, participants grant Bambu Lab worldwide, non-exclusive, royalty-free rights to use the content for display, promotion, and advertising purposes on official websites, social media platforms, and promotional materials.\n* Bambu Lab respects participants' intellectual property rights. Participants should ensure that the submitted entries do not infringe on any rights of a third party, including intellectual property rights, portrait rights, reputation rights, privacy rights, etc.\n* If we have doubts about the authorship of the entries, we have the right to check the source of them from you. If the terms and conditions are violated or if fraud is attempted, the participants may be disqualified.\n* Bambu Lab reserves the right to modify the terms of the contest.\n* Participants are expected to adhere to the rules and guidelines of the social media platforms.\n* Participants shall be fully responsible for their actions and content and Bambu Lab is not responsible for the actions and content produced by participants during the contest.",
        "num_comments": 70,
        "comments": [
            "I love how for \"Brilliant Solutions with limited space\", they are giving their largest printer as a prize",
            "The basement is the only place in my house that is not disturbed by our swamp cooler. So here she sits in all her glory. #BambuLabWorkspace\n\nhttps://preview.redd.it/mt4ocnjk9t4d1.jpeg?width=4284&format=pjpg&auto=webp&s=8f7fb9742d077c071469e02be08d935174b304a7",
            "> and pose them on the Bambu Lab Official Facebook group with **#BambuLabWorkspace** and Bambu Lab subreddit with the post flair **#BambuLabWorkspace**\n\n  \nSo we have to have facebook?  Maybe that should be an \"OR\"?",
            "https://preview.redd.it/jkdbp9zp0z4d1.png?width=796&format=png&auto=webp&s=c5045f8d09ceb5877a031d88d8187754b841cad8\n\nI don't have a bambu lab printer :( yet  \nSo here is just my current one  \n\\[I know I probably can't compete that's why I haven't included the # + that it probably needs to be a post not a reply to here\\]",
            "[#BambuLabWorkspace](https://www.facebook.com/hashtag/bambulabworkspace?__eep__=6&__cft__[0]=AZVC-HmGsm76TMsN4cvMS1WmJ6xGn3Nr6y4o4vFKU3gc-aaPS69wd68GZXzIrmoioTliiAo0So2e9Rx9r1Os3Cw5KCv0n3msRZ7NfBbVRQamK9ctSxGCx6bW9Iwx7ozZFibo0znnBEmqIlEUO_gRLe0vQTlCAw_Gywso2wd-IHp3NQ&__tn__=R]-R) My X1C with 2 AMS workspace. Magnetic bars on the front of my shelving to hold tools and plenty of space for other nick knacks as you can tell.\n\nhttps://preview.redd.it/d5z9v57bgr4d1.jpeg?width=1217&format=pjpg&auto=webp&s=49d34aeff499f5b6dcfe39b99770d44bb6b8011e",
            "This is where I'd put my X1C.  IF I HAD IT! (Said in Timmy turner's dad's voice)  shipping delays means it won't be here until tomorrow bit I made the space for it already. Can't wait!\n\n#BambuLabWorkspace\n\n*",
            "https://preview.redd.it/iiresfss2x5d1.jpeg?width=3841&format=pjpg&auto=webp&s=2f87d25bb7388ba07220bc603210c69a39fe1bef\n\nI'm expanding my small lab little by little each day.\n\n# #BambuLabWorkspace",
            "https://preview.redd.it/o6xu37xkl05d1.jpeg?width=4032&format=pjpg&auto=webp&s=80cd48a0284b6c0d8977639f2bbb1bee8f69d734\n\n# bambulabworkspace",
            "https://preview.redd.it/hv45w2dnd75d1.jpeg?width=4032&format=pjpg&auto=webp&s=0cac6e655218341e32b0e400b30d7fa70219cddd\n\nMy working space. X1C with 3 AMS + Mini with AMS + X1S with AMS. All in two IKEA cabinets..\n\nThis means that everything stays free of dust and the noise is not as loud.\n\n**#BambuLabWorkspace**",
            "https://preview.redd.it/l3cfm91ka56d1.jpeg?width=4032&format=pjpg&auto=webp&s=75d00c521561efac7b9c9f420ef50bdacc05704d\n\n  \nThis is my simple set up :)\n\n#BambuLabWorkspace"
        ]
    },
    "Just got my P1S combo! This is my youngest (and Yoshi) watching!": {
        "title": "Just got my P1S combo! This is my youngest (and Yoshi) watching!",
        "score": 65,
        "url": "https://i.redd.it/50sk4ym2w08d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "It's the most fun I've had watching paint dry!!! Literally can't stop!",
            "They are incredibly satisfying to watch, aren't they :)",
            "Adorable, my youngest couldn't keep good eyes off it while it was upstairs being tested.",
            "That's some quality bonding time. Nice job dad",
            "back in the day you'd stare in an oven or the washing machine - now it is 3d printers ;)",
            "and yoshi lol that’s so wholesome love it",
            "I just got an A1 Combo. My son looks to be around the same age and loves to watch it print.",
            "My P1S combo is scheduled to arrive later today.  It has been an agonizing 3 days since ordering of downloading prints, reading the wiki, watching how-to videos.  I have been wanting to get started in 3D printing and the day has finally arrived, well, once UPS delivers that is.",
            "Hours upon hours 🤩",
            "Mine arrived yesterday!  The first thing I did was print the box for all the tiny spare parts that they send with the printer (it’s a built-in model, so no *send to printer* or networking needed).\n\nBambu should have included a micro-SD card, which is required to enable some of the features, like spaghetti detection, live view, and Timelapse recording.  The microSD I had lying around only has 4GB, and ran out of space after the first print.\n\nBambu included 3 random spools of filament, which I didn’t know was coming.  I ordered another 6 spools, including the very exciting TPU for printing flexible objects.\n\nThe *Bambu Studio* software estimates the cost to print an object, but I don’t know how it gets the price I paid for a spool of filament, nor where I’d specify that in the interface.  Maybe it’s using some industry average?"
        ]
    },
    "Thank you Makerworld for the gift cards for a new printer": {
        "title": "Thank you Makerworld for the gift cards for a new printer",
        "score": 8,
        "url": "https://i.redd.it/73711l1e148d1.jpeg",
        "content": "Managed to claim 5 gift cards and got an A1 as a second printer during the current sale.",
        "num_comments": 7,
        "comments": [
            "i like your accessory shelf! I have spare room on my print table and I want to move my ams off the top of my printer (and get more organized with the accessories) so i'll start looking for something like that.",
            "It’s a great scheme, used 3 for my P1S combo on top of the sale. Unbeatable value for the functions.",
            "Looking good",
            "Which small ams shelf is this and where can I get this ?",
            "https://preview.redd.it/wsz4ugiva48d1.jpeg?width=2268&format=pjpg&auto=webp&s=234360bf6e8b7f95ee2de1b1562ceb84d8b02b68",
            "It's actually heavy duty garage shelving. It's a bit of a mess, but I have filament stored at the bottom and bits n pieces stored above it. I wasn't 100% sure the A1 was going to fit, but I managed to just squeeze it in.",
            "Yes it is. I've had a handful of printers before the Bambu's but since getting the P1S combo last year it's just been an absolute workhorse. Last I checked a few weeks ago it had 1400hrs on it and I've probably added another 75-100 since then. So the A1 seemed like great bang for buck option to offload overflow work to."
        ]
    },
    "P1S Exhaust Setup": {
        "title": "P1S Exhaust Setup",
        "score": 26,
        "url": "https://i.redd.it/nh9z8oviu18d1.jpeg",
        "content": "Combined a few different files on Bambu Studio by @jesadac and @RandomKhaos as well as designed my own window prop that fits super snug to vent my P1S while printing ASA. Real happy with how it all turned out.",
        "num_comments": 7,
        "comments": [
            "Nice, one think to make sure is that the fan you've added isnt going to pull air faster than the internal fan can spin, it'll cause it to overspin, which will cause a current to generate. There was a post here a while ago about someone who'd done this and managed to fry one of the boards. \n\njust keep the fan undervolted so it doesn't go over the top as it really doesnt need _that_ much power to draw the air out.",
            "Can you include an ingredients list?",
            "Are those 4” ducts?",
            "For ASA?",
            "Looks top notch, which noctua fan you used? Won't it run chamber cooling fan (exhaust) or you have dismounted it?",
            "Hmm this looks awesome. I thought about doing this for my resin printer. Great work",
            "I think they are"
        ]
    }
}