{
    "June 2024 - Events/Rental/PGs/Jobs & Internships/Classifieds Thread": {
        "title": "June 2024 - Events/Rental/PGs/Jobs & Internships/Classifieds Thread",
        "score": 22,
        "url": "https://www.reddit.com/r/bangalore/comments/1d5akfs/june_2024_eventsrentalpgsjobs/",
        "content": "Please do not post any external links or share email ID/phone numbers. You can post your stuff for sale, jobs offered and wanted, any upcoming events \\[Relevant and happening in Bangalore\\]\n\nAny other events, threads, rental and PG accommodation requests posted outside this thread will be removed.\n\n**Please exercise due diligence. Do your own background checks before closing any deal whatsoever.**",
        "num_comments": 519,
        "comments": [
            "Hello Bengaluru, \n\nM 22 here, been unemployed for the last 6 months and have been trying to find a job ever since in Bengaluru, I've put on 1000+ applications and have given 40-45 interviews until now, but still it's getting difficult to get a job despite upskilling, honing all the skills I have and it's getting harder. \n\nI'm looking for jobs in Marketing/Corporate Training/Content writing (any tier company, any industry is okay). Total work experience is 3 Years 7 Months. \n\nI have prior experience as a Marketing Incharge and Marketing Strategist, and Also as a Corporate Trainer for two Major Automobile companies. \nAny help will be appreciated. Thank you.",
            "I am shifting my house and I have some stuff that I am willing to let go off. I would ideally want some price to filter out the unwanted spam but I am more than happy to give it out to someone free if you are truly deserving it. \n\nMostly willing to give this stuff free for students or someone who is slogging here to get a job because I was in a same position when I came to Bangalore 15 years back. \nJust helping out someone out there if you are needy and truly deserve this because I know things can not be same for everyone as I have struggled here when I came to this city.\n\nI am attaching a few photos but basically things I have to offer include like.\n\n1. Ergonomics chair with back slide head and arm rest\n2. Comfortable Sofas\n3. Table with Drawer storage unit and keyboard slide\n4. Charger leads\n5. Books (Programming oriented, Java/Linux/SQL)\n6. UPSC Study Material (books notes ncert books maps cds)\n5. Landline phone (receiver)\n4. Gas stove\n5. Carpet Rugs\n6. Kitchen stuff\n7. Shoes\n8. Miscellaneous items\n\n\nFeel free to PM me incase you are shy of posting and asking for free stuff.",
            "I desperately need to find a job. I have hit rock bottom in my life. Any leads would be appreciated. I prefer non coding jobs. I have 6 months of work ex.",
            "[deleted]",
            "Hi everyone,\n\nI am Ameen, a personal trainer with 4 years of experience in the fitness industry. I recently moved to Bangalore and am looking for freelance opportunities in fitness training.\n\nI am a national powerlifting champion and a certified nutritionist. I am passionate about helping people achieve their fitness goals .\n\nIf anyone knows of any freelance opportunities or needs a personal trainer, I would greatly appreciate your help.\n\nThank you!\n\nAmeen",
            "I'm looking for NGOs (preferably North Bangalore) who can help distribute some used tables (read steel office tables) to underprivileged children. \n\n\nWe have 4-5 tables (used steel ones) that will become available soon. Looking to donate. Any leads would be super helpful.\n\n\nPS: Edited for more clarity.",
            "Can anyone help claim some of my income tax and file tax ? Can pay a reasonable amount depending on how much is recovered.",
            "If anyone’s looking for a place to stay in Bangalore \nIn any area DM can help you out",
            "Hey, looking for a flatmate in Bangalore. 22M here, looking for someone who goes to the gym. If you are already living in blr I can be your roommate, else we can look for a place together. I'll be moving in on June 30th.\n\nMy office is near the HSR layout, a 10km radius will be fine, I'm flexible with budget and stuff. Non vegetarian, I don't drink or smoke. \n\nPS: I'm getting a PS4 with me\n\nThank you! Hope the city is kind to me!",
            "Hello Bangalore! I'm moving to Bangalore for my work and I am looking for a 1BHK  within a 2km radius around Sri Sathya Sai Metro station Whitefield. Will be moving in on 8th July. Any leads would be really helpful.\n\nThank You!"
        ]
    },
    "June 2024 - Monthly Questions and General Discussion thread": {
        "title": "June 2024 - Monthly Questions and General Discussion thread",
        "score": 11,
        "url": "https://www.reddit.com/r/bangalore/comments/1d5akg5/june_2024_monthly_questions_and_general/",
        "content": "Hello /r/bangalore,\n\nPlease post all your \\*Bangalore related\\* questions, queries and random musings in this thread. Separate threads for such questions/musings will be removed.\n\nExamples of questions you might want to post in here:\n\n\\* How is this restaurant in Bangalore?\n\n\\* Does anyone want to hang out in Bangalore?\n\n\\* I'm going to this event in Bangalore, does anyone want to accompany me?\n\n\\* Is this college in Bangalore any good for this course?\n\n\\* How is this company in Bangalore for working/internship?\n\n\\* Where can I find this food item in Bangalore?\n\n\\* Which restaurant makes the best \\*insert food item here\\* in Bangalore?\n\n\\* Where can I get my bike serviced in Bangalore?\n\nFor anything that warrants a classifieds post, ie if you're looking for an internship, a job, to sell your furniture etc., or if you're advertising something, please post in the monthly classifieds thread instead.\n\nAny non-Bangalore-related questions or musings will be removed. Please use other, relevant subreddits for such discussions.\n\nThanks",
        "num_comments": 228,
        "comments": [
            "I live in Manipal, Karnataka.. and I'm interested in submitting a short piece of article for publication in any English newspaper. My piece actually focuses on A Music Village, an organisation that I believe deserves wider recognition for their valuable contributions to society. It's dedicated to promoting cultural diversity and social harmony through music. I tried contacting Deccan herald been 2 weeks and there's no response. Please suggest me some English newspapers where it's easier to publish. Because I believe Newspapers like Deccan herald receive way too many submissions hence they did not pay heed to me",
            "Does anyone remember angry birds cards from 2012? I recently found my collection and it brought back memories. After going through them I've realised I'm missing 6 cards\n(Card nos. 20, 76, 105, 178, 179, 180).\n\nIf anyone still has them, I would like to trade or buy them from you. Please DM me.",
            "Does anyone want to hangout in Indiranagar?",
            "Hello, does anyone know of any good sneaker painters/ customisers based in Bangalore? Thanks",
            "# Best places for street photography in Bangalore?\n\n20M, solo travel to Bangalore for the first time\n\nI don't know which are the best places for street photography which is accessible by metro\n\nif anyone knows a few good places where I can visit by metro, please comment below\n\nthank you for reading",
            "Hey guys,\n\nSo I am about to complete my masters in international business from Germany. However, I have decided to come back to Bangalore since I realized that life in Europe is not what I really want.\n\nI am already working there as a student at the stock exchange, and they have offered to convert it into full time too. However, besides the pay in Germany, everything else is a con in my opinion. Therefore, I would like to move back to Bangalore where I did my bachelors (Christ) and find work here.\n\nHowever, I wanted to ask what's the best way to start looking for work here. As far as I know, most of these Big 4 and other firms hire directly from University and if you want to apply as an outsider, you need lots of experience. I have only worked for 1.5 years after my bachelors. But I am open to all organisations.\n\nAny tips would be appreciated. And if anybody has any questions about life or work in Germany, please feel free to ask too.",
            "Best route for driving from Bangalore to Chennai ?\n\nI am planning to drive from Bangalore (near phoenix Mall) to Chennai (Perungudi). \n\nI am a relatively new driver (<1000km so far) and will be driving Hyundai Venue. I wanted to ask which is the best route to be taken. I am planning to start by 5am on Saturday.\n\nAlso any road trip essentials to be carried or any tips would be greatly appreciated.\n\nP.S. I posted a new question because I could not find any recent search results.",
            "Hi Everyone\n\nI'm from jaipur and planning to pursue MTech in Machine Design form christ university and currently not working anywhere. Can you please tell me how is this university? is it worth doing MTech Machine design there? My Additional preferences are power system and Structural engineering and my interview is scheduled on 5th of July.\n\nand if anyone here who completed their graduation in Mechanical Engineering tell me, if this is worth it or not!! suggestions are accepted.",
            "Q: New to Bangalore, how to build a social circle here?\n\nHello People of Bangalore, I, 30M, have recently moved to Bangalore and I don't have any friends here. I am mostly working from home. Apart from a few acquaintances from work, I don't know many people. I do go to the gym but I feel it's hard to make friends in a gym,  I tried cult group classes, but there too I didn't see people interacting much. Not having anyone around is taking a toll on my mental health. I do hear about these board game cafes and trivia nights and things like that but I am not sure if it would be fun to go there alone. I want to create a social circle to hang out with and do activities but I am not sure how. \n\n\nAny suggestions and recommendations would be really appreciated.\n\n\nMy interests include Dancing, Cycling, Fitness, any outdoor activities, Board Games, Trivias, Music, Cooking, and Learning languages. \n\n\nP.S.: I do know Kannada.\n\n\nAlso, I am learning Spanish right now, Is anyone interested in being my learning partner? ",
            "New to the country and Bangalore,\nLooking for someone to hang out with. I can host. Strictly SFW. Dm's are open :) cheers!"
        ]
    },
    "Riding a two wheeler in Bangalore is like playing tetris": {
        "title": "Riding a two wheeler in Bangalore is like playing tetris",
        "score": 181,
        "url": "https://www.reddit.com/r/bangalore/comments/1dr3flr/riding_a_two_wheeler_in_bangalore_is_like_playing/",
        "content": "People do not understand the concept of lane discipline, leaving some space between two vehicles. If a two wheeler rider sees a gap that his vehicle can fit in (or not) he would go full tetris on that shit. God it is so irritating to drive in a traffic full of hairless baboons.",
        "num_comments": 54,
        "comments": [
            "Man as a two wheeler rider you are  also pressurised to do this because of the hairless baboon behind  you who won’t stop honking and would expect you to weasel you are way into the gap",
            "Man the title really made me giggle XD",
            "I'm gonna need a throwaway account if I'm going to share my opinion here 😂",
            "Those clowns making driving a car So fucking stressful",
            "Comments reek of privilege!",
            "In my personal opinion and observation, I think it's mostly the cars and bigger vehicles that cause a hindrance and force 2 wheelers to play 'tetris'. If cars stick to lane discipline and follow a single line instead of zig zags (while one car drives on the left side of the lane, the car behind drives on the right side of the same lane), then two wheelers don't have to try and squeeze through every gap they can find. \n\nThere are no 2-wheeler specific lanes so obviously we will have merged traffic. But in most cases, in a 2 lane Street, you will find 3 cars trying to squeeze into those 2 lanes. If cars and bigger vehicles start following lane disciplines and drive in the middle of their designated lanes, then on most main roads there will be enough space on the sides for two wheelers to comfortably ride without having to squeeze in or cut through. \n\nDrivers tend to change lanes without even signalling. Lot of car drivers don't even look at the side mirrors before changing lanes. Worst are the ones that create pockets of space by being in the middle of 2 lanes and blocking off traffic.",
            "Tertris is like life, the more you are given, the more you are expected to handle. Mistakes pile up and accomplishment disappears.",
            "Other cities handle this by keeping a gap at the left hand side for 2 wheelers to pass through. Never seen that here though.",
            "Same feelings. I just came to bangalore and was planning to rent a bike. But seeing the heavy traffic ( google map told 1hr for just 3km destination), i decided to walk.\n\n Totally 28000 steps in Friday🤷‍♂️. Today also I gonna explore on foot 🤕. All because of this terrific bglre traffic!!",
            "Being a two wheeler driver I apologise. I consider myself a good driver, who respects the traffic rules. But after coming to blr, I've been scolded by people to stop behind the white line on traffic signals, not squeezing myself through that gap on the left of a bmtc bus, of not letting people drive on footpath by blocking the way. At this point I just play Tetris on the road out of frustration. I'm fine even if it takes me more time, but I can't stand other people honking at me anymore"
        ]
    },
    "police asking money at my shop ": {
        "title": "police asking money at my shop ",
        "score": 350,
        "url": "https://www.reddit.com/r/bangalore/comments/1dqmmln/police_asking_money_at_my_shop/",
        "content": "i guys am 17 and my father has a small wholesale shop of biscuits and pan (pan ka patta )  items , every July 1  the police comes and asks for 500 rs and  and gives a sticker (a stamp of something named police stuff ) is it legal, we dont have a big business they they forcefully ask 500 from every shop , is it legal ?? or  can we refuse to pay or its mandatory is anyone knows please help ,  last time they took 500 when i was in shop , and just few days to july 1 , again they would come to  beg for the money",
        "num_comments": 88,
        "comments": [
            "This post has been flaired as \"Serious\". \"Serious\" flaired posts are off-limits to jokes or irrelevant replies. The rule extends to parent as well as the child comments. Treat OP with respect. Violations might attract a **ban**. Report any violations of rule for quicker action against the offender.\n\n[Contact the moderators through modmail](https://reddit.com/message/compose?to=/r/Bangalore) to report rule-violating comments or misuse of \"Serious\" post flair.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bangalore) if you have any questions or concerns.*",
            "It's a police fund donation drive, you're not obligated to pay it, but shopkeepers do pay hoping it would keep police from invoking some stupid laws to cause trouble for their businesses.",
            "Protection money",
            "really sad to see cops extorting from poor public. My blood boils reading such stories",
            "Better give it off as not giving costs will exceed",
            "You shopkeepers should have a union and take a decision together not to give them anymore.\n\nFor people ranting here about protection and security, If one is paying taxes and being a citizen of India, he has to be protected. Don't have to pay on top of that.\n\nNow, these cops are eating tax payer's (our) money only on a daily basis.",
            "It's nothing new, I have seen even hawkers pay 100 approx per day to the cops, no small or big shop is spared, it can go upto several thousands. \n\nI would assume it's an economy on its own, the money collected from each shop the collection cut is shared between the higher ups even up to ministers.",
            "See if you can use it as a donation for tax write off... assuming your business pays taxes and such.",
            "Try talking to your father and if u guys decide not to pay , let them know u will not be paying it anymore and if they do something to you guys or the shop direct or indirect. contact u/broseph",
            "Once a year? I mean I see this cop car in the locality daily at various shops. \n\nDoubt he's a shopaholic"
        ]
    },
    "Disappointed with Sony Service India": {
        "title": "Disappointed with Sony Service India",
        "score": 22,
        "url": "http://www.google.com",
        "content": "I'm having terrible service with Sony right now. It's been a huge disappointment, .\n\nMy Bravia TV has not worked after switching on for the past two weeks. The technician came and told me the panel was the issue and it had to be replaced. \n\nNow, the service center tells me it's the LED strip that's the issue, and the LED strip is in transit every time I call. \n\nIt's been two weeks with no ETA. \n\n\nTicket numbers are INCA2402614508, INCA2402630474 and INCA2402703700\n\nHow can I escalate? ",
        "num_comments": 7,
        "comments": [
            "which branch did you visit? i recently had issues with my dualsense controller i went to the branch in indiranagar, they were super help ful they replaced the controller with a new one in 3 days",
            "Twitter?",
            "I’ve had great service from Sony. Similar thing happened to my tv. It didn’t switch on. Motherboard issue. And had to be replaced. This was 13th month into a 12 month warranty. \n\nWe kinda nagged and irritated them quite a lot. Within 7 days motherboard was replaced and never paid a dime. Just service charge of 200 or something",
            "I didn't visit any branch since I couldn't take the TV with me. But I raised a ticket and it was assigned to the Jayanagar branch.",
            "Done",
            "Good for you man!",
            "Share so that people can retweet. It's a terrible state that unless brands are called out in open, many don't fulfill their promises."
        ]
    }
}