{
    "June 2024 - Events/Rental/PGs/Jobs & Internships/Classifieds Thread": {
        "title": "June 2024 - Events/Rental/PGs/Jobs & Internships/Classifieds Thread",
        "score": 21,
        "url": "https://www.reddit.com/r/bangalore/comments/1d5akfs/june_2024_eventsrentalpgsjobs/",
        "content": "Please do not post any external links or share email ID/phone numbers. You can post your stuff for sale, jobs offered and wanted, any upcoming events \\[Relevant and happening in Bangalore\\]\n\nAny other events, threads, rental and PG accommodation requests posted outside this thread will be removed.\n\n**Please exercise due diligence. Do your own background checks before closing any deal whatsoever.**",
        "num_comments": 523,
        "comments": [
            "I desperately need to find a job. I have hit rock bottom in my life. Any leads would be appreciated. I prefer non coding jobs. I have 6 months of work ex.",
            "Can anyone help claim some of my income tax and file tax ? Can pay a reasonable amount depending on how much is recovered.",
            "If anyones looking for a place to stay in Bangalore \nIn any area DM can help you out",
            "Hello Bangalore! I'm moving to Bangalore for my work and I am looking for a 1BHK  within a 2km radius around Sri Sathya Sai Metro station Whitefield. Will be moving in on 8th July. Any leads would be really helpful.\n\nThank You!",
            "Selling my Giant Escape 3 bicycle. Its about 3 years sold but sparsely used. Still rides like a dream. \n\nFrame size is medium and am planning to sell it for 22k. DM if interested.",
            "I'm a freelance photographer/videographer based out if Bangalore. Please dm if you're looking for a photographer/videographer/video/photo editor of any kind.",
            "I'm looking for a videographer who's interested in journalism. Beginners with wild ideas are preferred.",
            "Hi everyone,\nI'm a junior architect planning to move out of Kerala for job\nWhat is the average salary and living expenses in your city?",
            "Hi guys, I'm looking for some ppl who can provide me a space in their home in Indiranagar. Can pay upto 8-9k rent per month. If anyone is willing to, pls DM coz it's urgent. Thanks ",
            "Looking for a room in pre-occupied 2/3/4 bhk around MG road and Cubbon Park. The closer the better but willing to move till indiranagar, cox town and seshadripuram. I'll be moving in the first week of july.\n\nM21 here, non-vegetarian, smoker. don't have much problem with anybody's lifestyle."
        ]
    },
    "June 2024 - Monthly Questions and General Discussion thread": {
        "title": "June 2024 - Monthly Questions and General Discussion thread",
        "score": 13,
        "url": "https://www.reddit.com/r/bangalore/comments/1d5akg5/june_2024_monthly_questions_and_general/",
        "content": "Hello /r/bangalore,\n\nPlease post all your \\*Bangalore related\\* questions, queries and random musings in this thread. Separate threads for such questions/musings will be removed.\n\nExamples of questions you might want to post in here:\n\n\\* How is this restaurant in Bangalore?\n\n\\* Does anyone want to hang out in Bangalore?\n\n\\* I'm going to this event in Bangalore, does anyone want to accompany me?\n\n\\* Is this college in Bangalore any good for this course?\n\n\\* How is this company in Bangalore for working/internship?\n\n\\* Where can I find this food item in Bangalore?\n\n\\* Which restaurant makes the best \\*insert food item here\\* in Bangalore?\n\n\\* Where can I get my bike serviced in Bangalore?\n\nFor anything that warrants a classifieds post, ie if you're looking for an internship, a job, to sell your furniture etc., or if you're advertising something, please post in the monthly classifieds thread instead.\n\nAny non-Bangalore-related questions or musings will be removed. Please use other, relevant subreddits for such discussions.\n\nThanks",
        "num_comments": 231,
        "comments": [
            "I live in Manipal, Karnataka.. and I'm interested in submitting a short piece of article for publication in any English newspaper. My piece actually focuses on A Music Village, an organisation that I believe deserves wider recognition for their valuable contributions to society. It's dedicated to promoting cultural diversity and social harmony through music. I tried contacting Deccan herald been 2 weeks and there's no response. Please suggest me some English newspapers where it's easier to publish. Because I believe Newspapers like Deccan herald receive way too many submissions hence they did not pay heed to me",
            "Does anyone want to hangout in Indiranagar?",
            "Hello, does anyone know of any good sneaker painters/ customisers based in Bangalore? Thanks",
            "New to the country and Bangalore,\nLooking for someone to hang out with. I can host. Strictly SFW. Dm's are open :) cheers!",
            "Any poster printing shop in kormangala 7th block?",
            "Local tanker water vs bisleri 10litre can water. Which is better for drinking water purposes?\n\nFor dishwashing, even after using waterscience filter, the dishes are getting calcified? is it bad for health?",
            "Hi fellow Bangaloreans. I have a cult pro membership which will expire on April 2025. I have moved out of the city and am looking for someone to take it off my hands. I would have to upgrade it to Elite for the same so you would receive a Cult Elite membership till April 2025 (with all pause days intact).\n\nDrop me a DM if interested and we can discuss the transfer process (Cult has agreed for the same)",
            "Helllooo Im an intern at iisc staying in mathikere. Dont know anyone here so hmu",
            "Can someone help me with bmtc bus route from rajajinagar metro station stop to msr nagar, new bel road ? I'm very new here so please help out. I heard there is no direct route but please do suggest routes !!",
            "is it juts me or vi network is getting worse by the day ? what network is good in this city"
        ]
    },
    "CBSE, ICSE schools in Karnataka now required to teach Kannada as first or second language": {
        "title": "CBSE, ICSE schools in Karnataka now required to teach Kannada as first or second language",
        "score": 209,
        "url": "https://www.deccanherald.com/india/karnataka/cbse-icse-schools-in-karnataka-now-required-to-teach-kannada-as-first-or-second-language-3085314",
        "content": "",
        "num_comments": 89,
        "comments": [
            "I hope they emphasize on speaking skills and practical knowledge instead of just literature and grammar. In fact they should do that for all the languages taught.",
            "Now? Its been the rule for 3 years now.",
            "Excellent move. Hopefully this way, a certain section of parents will also pick up the language and stop saying Kannad instead of Kannada.",
            "incoming posts on how companies will move out of bangalore + 2-3 i got harassed posts along with posts on other regional subs titled, \"ABC'ians of ABC state/city, are you safe in bangalore?\"",
            "I hope they let people choose either Hindi or English as the other language. Hate that three language formula. To put all that extra effort for no utility.",
            "Bomb hoaxes , tammanah bhatiya , events cancelled due to water shortage and now this , sometimes I wonder if bangalore schools are for teaching kids or fighting political agendas .",
            "contact me for kannada lessons. i cannot read halegannada nor can i understand even slightly more than conversational/informal kannada. i can however read, write and speak fluently. i am of minimal help. but i do charge",
            "These guys are playing with kids lives. Someone moves into Karnataka from another state in 5th grade or beyond. You know how much of a torture it is to step up to that level all of a sudden. The kids start falling behind in math and science just to pass kannada\n\nI personally have been a victim of this. 4 states (state board) and had to bear the brunt of a language churn every time parents moved to a new state. It was nightmarish.  Made a lot of friends though and cannot even say I belong to a particular state but just India which is good in one way.",
            "Ah yes force students to learn kannada, lovely idea for cbse and icse. Idiotic rules. Glad i am out of school atleast. I hate this place with a passion",
            "Rahul dravid tonight is going to coach the Indian team in Kannada and make us all celebrate together. . Anyway , all the best to everyone here. . We need to stand together for this and give him a good send off. Amazing man. Amazing Indian and off course amazing kannadiga. "
        ]
    },
    "Riding a two wheeler in Bangalore is like playing tetris": {
        "title": "Riding a two wheeler in Bangalore is like playing tetris",
        "score": 336,
        "url": "https://www.reddit.com/r/bangalore/comments/1dr3flr/riding_a_two_wheeler_in_bangalore_is_like_playing/",
        "content": "People do not understand the concept of lane discipline, leaving some space between two vehicles. If a two wheeler rider sees a gap that his vehicle can fit in (or not) he would go full tetris on that shit. God it is so irritating to drive in a traffic full of hairless baboons.",
        "num_comments": 121,
        "comments": [
            "Man as a two wheeler rider you are  also pressurised to do this because of the hairless baboon behind  you who wont stop honking and would expect you to weasel you are way into the gap",
            "Man the title really made me giggle XD",
            "I'm gonna need a throwaway account if I'm going to share my opinion here ",
            "Tertris is like life, the more you are given, the more you are expected to handle. Mistakes pile up and accomplishment disappears.",
            "Those clowns making driving a car So fucking stressful",
            "Same feelings. I just came to bangalore and was planning to rent a bike. But seeing the heavy traffic ( google map told 1hr for just 3km destination), i decided to walk.\n\n Totally 28000 steps in Friday. Today also I gonna explore on foot . All because of this terrific bglre traffic!!",
            "Yesterday I turned the right indicator on, and even signalled with my hand, only to see a scooty and a yellow board car whizzing right past me on my right side 2 seconds later. If I had not checked mirrors, that would have been it for me and my gf. Stupid fuckin people.",
            "One of my friends came from Delhi, he mentioned that compared to Delhi, there are unusually high number of two wheelers here, probably because of  insufficient public transport and last mile connectivity. Getting a two wheeler is easy for parking and covering short distances quickly. \n\ndont want to bash two wheelers everyone here is trying to squeeze through whatever space is left, even big ass cars like innova especially cab drivers.",
            "Incoming classic, r/carsIndia vs r/indianBikes \nBut honestly I havent driven a car here just from the sheer fear of the traffic, but having ridden a bike almost 35kms a day almost everyday since the last month I can say I have no joy left inside me. I assume its equally bad for any sensible person out there be it a bike or a car.",
            "I get that car drives are frustrated. I dont think us two wheeler people would drive this way if it were not for the insane traffic. People with cars are not that great with lane discipline. If they want to take an exit on the left, they will be in the right most lane till the point they reach the exit. And then they will do a straight 90 degree left turn. This creates a big block every single day.\n\nI think everyone is equally responsible for the shitty traffic. Plus we need a metro asap"
        ]
    },
    "Pubs for my parents to visit 😭": {
        "title": "Pubs for my parents to visit 😭",
        "score": 77,
        "url": "https://www.reddit.com/r/bangalore/comments/1dr7h7k/pubs_for_my_parents_to_visit/",
        "content": "My parents, in their late 40s, have said they want to relive their younger days and want to go dancing at a pub. I don’t want them to go any place that is too shady, and they can probably afford some of the more expensive places too. Important for it to be a place where people go to dance (so not a place that just has a dance floor but nobody dances). Thanks a ton in advance 🫶",
        "num_comments": 31,
        "comments": [
            "You can try taking them to Suzy q. Nice place but a very small dance floor. But the vibes are nice.",
            "Secret Story, Bunny Bar, Nusa, Oia, Skyye, Boche Club, Bombay Adda, Marquis, Supernova, High Ultra lounge\n\nPick your poison. ",
            "Wait, is it some kind of a new trap by Indian parents.  ",
            "Take them to Skkye lounge",
            "Take em to Hoot in Sarjapur. Decent family oriented crowd on weekends",
            "Take them knowhere , they'll love it",
            "Op, wherever you recommend them.. I'd suggest you visit the place first before recommending.. just so they don't walk into something that's too much for them...",
            "You can take them to Badmaash in Lulu Mall . Its open roof and has a small dance floor . Good crowd",
            "Soda bottle opener wala, old retro music, good food and chai too if someone fancies along with good cocktails",
            "1522 bel road , daysie affordable options"
        ]
    }
}