{
    "Monthly Questions, Discussion, and Subreddit Feedback Thread": {
        "title": "Monthly Questions, Discussion, and Subreddit Feedback Thread",
        "score": 14,
        "url": "https://www.reddit.com/r/Bannerlord/comments/188gr1o/monthly_questions_discussion_and_subreddit/",
        "content": " \n\nUse this post to to check in with your other Bannerlord players or ask about anything related to Bannerlord! Connect by starting your own thread by posting a comment here.\n\nPlease also use this post to share your feedback on the subreddit and its moderation! We are always looking to improve.\n\n*all* [r/Bannerlord](https://www.reddit.com/r/bannerlord/) *and site-wide rules apply.*\n\n\\_\\_\\_\n\n *This megathread will be replaced on* *every* ***1st of the month***",
        "num_comments": 348,
        "comments": [
            "Is there a good way to spec your character to maximize the amount of skill points/levels you can gain? I dont like to just straight up cheat to make myself a demigod, but i find the current skill cap system a little annoying and i feel like im not progressing after a certain point.",
            "How is late game these days? I haven't played since near release; but I found that stocking my castles/fiefs with good troops costed a ton in weekly expenses that I would never be able to cover.\n\nFor awhile I could cover it since the loot from battles made so much money, but eventually if I kept stocking castles with troops/archers/etc. I could tell that the weekly expenses would get so huge I'd go bankrupt. Essentially; the castles/fiefs produced very very little income compared to what it took to defend them. (I played on the hardest/realistic difficulty IIRC; not hardcore though.)\n\nAlso there was an issue where settlements would often grow past their ability to feed themselves and so I'd have to buy food from other towns just to shove them into my settlements; is that still a problem?\n\nIn a more general sense; has the game changed much since release?",
            "Is there any point to marrying female clan members?\n\nLike, outside of the whole \"give them a chance to have a family\" thing, it seems like there's no upside. You get, what, 10 relations with another clan? You can just bust them out of prison once and get six times that - it doesn't seem worth losing a governor/general/bundleofstats",
            "Sometimes when I turn over command to AI it is super smart. It sends archers up initially, then retreats them behind infantry, and flanks with cav right when the enemy hits my infantry. That works famously. But sometimes they just all charge. Is there a way I can have more control over AI strategy without micromanaging groups? Kind of like how AI lords issue commands to skirmish, flank, etc? New player so maybe these features come with higher skills?",
            "If a garrison is over budget, is there any preference to the type of troops it keeps?  For example will it get rid of expensive troops before cheap ones or vice versa?",
            "Okay so I'm not a native english speaker and I just learned that \"X is with child\" to mean  pregnant is an actual english expression and not just a mistake by the devs",
            "Searched the forums and subs for solution to this problem, can't find it anywhere. My army refuses to use multiple pieces of siege equipment at once. I have a battering ram and two towers, but all the infantry is obsessed with mobbing up at the ram and dying immediately to catapult fire.\n\nIf I don't auto-delegate and rather do the suggested \"deploy a unit at siege equipment when marker turns into blue gears\" they just stand at the towers doing watching the ram die.\n\nUPDATE: Updating here in the off chance that it helps someone in the future. This bug randomly appears for various cities. Sometimes it happens, sometimes it doesn't. Not sure why. What happens is that it wants to use the siege equipment sequentially instead of simultaneously. So even if you only have a single tower, it will move the tower to the walls and then run elsewhere to erect ladders.",
            "First time having a companion die of old age. He was a governor for a long time due to cultural bonus, and I wanted more xp for governing perks, so I brought him out to fight hideouts and battles. We were traveling after a battle when we got the notification. RIP Grev, tracker of the 66.",
            "Anyone having issues with companions and party roles? Got captured and after recalling all my companions back I wasn’t able to reassign them to my parties rolls without talking to them.\n\nEven after going through the dialogue instead of assigning through the clan menu, the slots still show as blank with no one assigned but the individuals still seem to be gaining the appropriate levels so I believe they are still giving their bonuses.",
            "When making the Garrison for my settlement should I go woth high tier troops for better results or like militias you can get from raiding a village and converting their troops"
        ]
    },
    "Hot take:  The game isn’t being abandoned, the devs just cook absurdly slow. ": {
        "title": "Hot take:  The game isn’t being abandoned, the devs just cook absurdly slow. ",
        "score": 294,
        "url": "https://www.reddit.com/r/Bannerlord/comments/1dqmgqe/hot_take_the_game_isnt_being_abandoned_the_devs/",
        "content": "I’ve seen plenty of doomer comments the past few weeks saying the devs abandoned the game with certainty and that the game is fixing to wrap up. Which is nonsense, a new patch was just released for PC players, with consoles coming shortly. Granted, every patch is just a bunch of “uncommon” crash fixes. However, the fact that they continue to release anything is proof that they aren’t done yet. They even confirmed in may that they are actively working to update the game with new shit.\n\n “Before we dive into this month's #CommunityTales, let us briefly touch on the future of Bannerlord! During our release, we shared our intent to continue supporting the title with content updates - which has led to new features such as Fog of War, Retirement, Player-owned Alleys, World Map & Mission Weather, Formation Targeting, Warehouses, and Multiplayer Taunts among others. We want to reassure you that we're still on this path and working towards future updates. We share your enthusiasm for what lies ahead and although it will take a while longer to finalize the new additions, be confident that they are coming.” \n\n\nNow of course whatever they are working on could be mid. There is a lot of valid things to criticize, but “abandoned” comes off as overly dramatic. The game is definitely shallow and the doom posting probably stems from fear of wasting the game’s potential (i get it) but community managers are always actively responding to player feedback on  https://www.taleworlds.com/en/Home. \n\nThe devs aren’t abandoning the game yet, they just suck at communicating what their plans for it are. The last time they shared what was coming next, it was several months before the beta release on PC. Now You may return to doom posting, and dismissing this post as copium, au revoir\n\n",
        "num_comments": 134,
        "comments": [
            "This isn't a cooking process, it's fermentation.",
            "Oh cool multiplayer updates for the 20 people who play that mode",
            "For the $40 I spent, I have gotten 150 hours out of the game. They could stop updating it now and I'd still say I've gotten my money's worth. Strange to me that people have different development expectations for a game like Bannerlord as opposed to, say, a AAA story-driven game, but are willing to pay the same price for both.",
            "Look man, I get your point, but if it was two, three years ago - than sure, maybe there's still hope TaleWorlds is actually cooking something. But they have been releasing these pointless patches that break mods and don't bring anything new to the table for ages. There haven't been any attempts from them to address community for three years, I think. Since the game had hit that \"released from early access\" point we had a compete radio silence from TaleWorlds with some occasional meaningless patches releasing progressively slower and slower. I mean, you do you, but I'm pretty sure that most of us are way past the point of \"they might actually fix this game\" stage of denial.\n\nBannerlord doesn't really need all those menial fixes of bugs that happen once in a blue moon. We need better diplomacy, we need better internal and external politics, we need proper social interactions to finally make a comeback, we need content - not just patches for the sake of patches. Bannerlord has been nothing but a let down ever since its initial release and TaleWorlds did practically nothing to steer it on the right path aside from fixing some the terribly broken features (like sieges) to a barely acceptable state.\n\nI don't know what TaleWorlds is up to. I admit, maybe they're actually working on Bannerlord 2 in secrecy and don't want to announce it too soon - which is a good thing, we don't want another repetition of Bannerlord's 8 years worth of wait. But given their past record with atrocious state of Bannerlord and fairly subpar attempts to fix it - I think that criticism and skepticism are very much warranted.",
            "Pissed me the fuck off.\nWent to play, well into my new ROT campaing, didnt expect update and of course by the time I come back to pc update is installed and my save is bricked again.\nCheck the patchlog and its !!!0!!! New content that they fucked me over for.\nFuck them.\nEither put out new content or stop fucking with the game, you got dozens of people working full time and your shit cant compare to a handful of skilled people making mods in their spare time out of passion",
            "Maybe this is just me as an Old, but I don't understand the doom and gloom about it being \"abandoned\" either. LIke yeah there are things I wish were in the game, but when I got the game I got it based on what was there, and have enjoyed it. I already paid them the money, anything else they keep adding is just a nice bonus. Developers don't owe it to you to keep updating and adding content to a game. If you don't want to be disappointed, buy games based on what they are, not what they might be sometime later",
            "All I want is the ability to install mods on Console. Why are they so adamantly against helping a very sizable chunk of their player base?",
            "They haven't released any meaningful content since Early Access. \n\nThey absolutely may as well abandon the game. At least they can stop breaking every mod with fixes for issues nobody has ever heard of.",
            "Darktide has a faster content cycle than Bannerlord and Fatshark is abysmally slow.",
            "All I want now is a campaign multiplayer cooperative mode.\n\nBefore anyone says \"iNsTaLl tHe mOd\", I play on xbox."
        ]
    },
    "My family clan (plus companions) I have 40 family members.": {
        "title": "My family clan (plus companions) I have 40 family members.",
        "score": 20,
        "url": "https://i.redd.it/wsp455mf2g9d1.png",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Gengis Khan play through moment",
            "It’s time like this I wanna give up my kingdom and turn back in time to roam around as a family merc band that reign terror to who ever didn’t pay me the highest.",
            "Those are rockie numbers!!!!  \nWell... no. I have a lot of children, but they are still children, mind you  \nHot Butter mod makes miracles on that end"
        ]
    },
    "I’m sorry you lost all of your friend, soldier.": {
        "title": "I’m sorry you lost all of your friend, soldier.",
        "score": 18,
        "url": "https://i.redd.it/l8eg16823g9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "https://preview.redd.it/da6uy7o2dg9d1.jpeg?width=300&format=pjpg&auto=webp&s=72bf5dde3109b4991562d1b4dd7b27a186f9693e",
            "All his poor friend.",
            "Get back on the line you will have your chance to join them when we assault the keep."
        ]
    },
    "Why are the sturgians so ridiculously strong? ": {
        "title": "Why are the sturgians so ridiculously strong? ",
        "score": 113,
        "url": "https://www.reddit.com/r/Bannerlord/comments/1dqr0w4/why_are_the_sturgians_so_ridiculously_strong/",
        "content": "Had a Kuhzait army of 460 and came up against an army of 350 and got absolutely destroyed. Used all the right tactics with archers in the rear, horse archers flowing back and forth and infantry holding the enemy in place for the archers. We ended up losing and the Sturgians still had 100 men left. Why?",
        "num_comments": 65,
        "comments": [
            "L horse nerd, losing to sturgians as khuz is crazy",
            "Archers in the rear is not a good tactic vs sturgia. Split them in 2 and shoot from at least 90 degrees angle, so some arrows get through. Also don’t play khuzait…. 😀\n\nHorse archers have to get behind the front line so they turn the sturgian frontline around. Khuzait are actually hard counter to sturgia. That’s why we hate that stupid nation so much.",
            "Your problem is using foot soldiers with Khuzait.\n\nBesides numbers dont mean much. Quality over quantity",
            "You brought scissors to a rock fight",
            "The Sturgians field some of the deadliest infantry in the world. You generally can’t go toe to toe with them in melee unless you outnumber them significantly. And they are heavily shielded as well, so shooting at them without outflanking them with your foot and horse archers is useless.\n\nTo put it the other way round, if I were the Sturgians in this example I’d immediately order my infantry to crush yours, while tanking your shots, then I’d go into shield wall until your horse archers are empty and crush them too.",
            "Go around them! Go around!",
            "Send in the horse archers in two or more groups. Delay their 'Charge' deployment so that you'll always have one formation hitting their infantry from behind (circumventing those big shields).\n\nIf you also got foot archers, place them on the left side of your own formations. Characters wield their shields in their left hand, so putting your own archers. to oppose that helps a fair bit too.\n\nOnce a melee starts, don't hesitate to actually send in (horse) archers at a 'Hold Fire' charge. In a melee, the amount of bodies may matter far more than landing a few more shots.\n\nYou're not going to win an infantry/on-foot fight against the Sturgians with Khuzait troops one-for-one any time soon.",
            "If you’re consistently fighting Sturgia and specifically struggling against the heavy infantry you’ll need to focus on things that increase damage against shields. You can stack up a very nice bonus vs shields between perks and a strong flag",
            "It's 100% the shields, their shields are stupidly strong, and make it very hard to fight them on foot. You need a decent amount of heavy cav and basic strategies.",
            "Monchug is disappointed in you"
        ]
    }
}