{
    "Monthly Questions, Discussion, and Subreddit Feedback Thread": {
        "title": "Monthly Questions, Discussion, and Subreddit Feedback Thread",
        "score": 16,
        "url": "https://www.reddit.com/r/Bannerlord/comments/188gr1o/monthly_questions_discussion_and_subreddit/",
        "content": " \n\nUse this post to to check in with your other Bannerlord players or ask about anything related to Bannerlord! Connect by starting your own thread by posting a comment here.\n\nPlease also use this post to share your feedback on the subreddit and its moderation! We are always looking to improve.\n\n*all* [r/Bannerlord](https://www.reddit.com/r/bannerlord/) *and site-wide rules apply.*\n\n\\_\\_\\_\n\n *This megathread will be replaced on* *every* ***1st of the month***",
        "num_comments": 349,
        "comments": [
            "Is there a good way to spec your character to maximize the amount of skill points/levels you can gain? I dont like to just straight up cheat to make myself a demigod, but i find the current skill cap system a little annoying and i feel like im not progressing after a certain point.",
            "Is there any point to marrying female clan members?\n\nLike, outside of the whole \"give them a chance to have a family\" thing, it seems like there's no upside. You get, what, 10 relations with another clan? You can just bust them out of prison once and get six times that - it doesn't seem worth losing a governor/general/bundleofstats",
            "Sometimes when I turn over command to AI it is super smart. It sends archers up initially, then retreats them behind infantry, and flanks with cav right when the enemy hits my infantry. That works famously. But sometimes they just all charge. Is there a way I can have more control over AI strategy without micromanaging groups? Kind of like how AI lords issue commands to skirmish, flank, etc? New player so maybe these features come with higher skills?",
            "If a garrison is over budget, is there any preference to the type of troops it keeps?  For example will it get rid of expensive troops before cheap ones or vice versa?",
            "Okay so I'm not a native english speaker and I just learned that \"X is with child\" to mean  pregnant is an actual english expression and not just a mistake by the devs",
            "First time having a companion die of old age. He was a governor for a long time due to cultural bonus, and I wanted more xp for governing perks, so I brought him out to fight hideouts and battles. We were traveling after a battle when we got the notification. RIP Grev, tracker of the 66.",
            "Anyone having issues with companions and party roles? Got captured and after recalling all my companions back I wasnt able to reassign them to my parties rolls without talking to them.\n\nEven after going through the dialogue instead of assigning through the clan menu, the slots still show as blank with no one assigned but the individuals still seem to be gaining the appropriate levels so I believe they are still giving their bonuses.",
            "When making the Garrison for my settlement should I go woth high tier troops for better results or like militias you can get from raiding a village and converting their troops",
            "Has anyone figured out a way to alt-tab without pausing the game?",
            "Has anyone noticed that since the last update companions just kinda...walk everywhere? I take them into cities and bandit camps and they normally just walk and are ineffective because they fall back so far."
        ]
    },
    "One of the few remaining clan leaders i need to recruit, lets duel…. Oh fuck i killed him ": {
        "title": "One of the few remaining clan leaders i need to recruit, lets duel…. Oh fuck i killed him ",
        "score": 127,
        "url": "https://v.redd.it/wk5i1zs1ih9d1",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Also he was my father in law. Breaking this to my wife is gonna be awkward",
            "Oh, thats a bit  awkward, eh well, life happens, and death happens too",
            "What mods are you playing with ?",
            "\n\"....This was NOT the plan.\"",
            "Is there a way to make it easier to kill in battle? Ive only killed one lord but i think that was my troops not me. I wanna know cause executing them makes you lose relations (stupidly icl, why would the Aserais care if i executed a random sturgian clan C member)",
            "I lold.  Actual literal lol.  BLURP! Shit I killed him!",
            "Going for the ol non lethal greatsword take down",
            "Spout something about glorious battle between men and how you both went at it with smile on your face.  Just make sure her intrigue is lower than yours and not a sadist- wrong game.",
            "What are you looking for in that video?",
            "Other than not using the Doctors Oath medicine perk, there isnt anything you can do outside of mods. Noble war parties are really important to a kingdoms survival, so it makes sense that they only have a small chance of dying in battle. \n\nI personally just hunt them on the battlefield. Chasing an enemy army into their castle and laying siege to it puts all of the enemy nobles on the frontlines fighting on foot, those battles are a lot tougher though. But lots of fun."
        ]
    },
    "Insane": {
        "title": "Insane",
        "score": 81,
        "url": "https://i.redd.it/mekji8vmzg9d1.jpeg",
        "content": "",
        "num_comments": 14,
        "comments": [
            "Who ran. That guy needs to be executed",
            "You got 358 kills in one battle? Holy shit. My record is like 150 and I thought I was ballin",
            "it might just be someone holding a banner\n\nidk if they still are but they were shown there for some reason a while ago",
            "It was in a seige",
            "You can get hundreds of kills in a siege if you're manning a fire catapult.",
            "Two handed axe go brrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr",
            "I volunteer my axe ",
            "Or quick enough to get on the escape route to kill the routing militias",
            "Just mow down militia rabble with a two handed axe, the only limit is your finger giving out lol",
            "Get on the walls soldier"
        ]
    },
    "I’m sorry you lost all of your friend, soldier.": {
        "title": "I’m sorry you lost all of your friend, soldier.",
        "score": 76,
        "url": "https://i.redd.it/l8eg16823g9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "See to your friends. They were brave men.",
            "No worries, most of them are just wounded. They can walk it off with a couple days' march. Yes, the guy with a javelin through the eye is just napping.",
            "If you find yourself alone, riding in green fields with the sun on your face, do not be troubled, for you are in Elysium, and you are already dead.",
            "Bro we are the imperium not the imperium of man!",
            "I serve the master of mankind and he trades in souls",
            "Yours won't be one he will find again corpse worshipper",
            "Heresy!!! This will not stand!! To war brothers! For The Emperor!! For The Primarch!! FOR CALIBAN!!!",
            "All his poor friend.",
            "FOR CALIBAN!!!",
            "Get back on the line you will have your chance to join them when we assault the keep."
        ]
    },
    "My family clan (plus companions) I have 40 family members.": {
        "title": "My family clan (plus companions) I have 40 family members.",
        "score": 61,
        "url": "https://i.redd.it/wsp455mf2g9d1.png",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Gengis Khan play through moment",
            "Its time like this I wanna give up my kingdom and turn back in time to roam around as a family merc band that reign terror to who ever didnt pay me the highest.",
            "Those are rockie numbers!!!!  \nWell... no. I have a lot of children, but they are still children, mind you  \nHot Butter mod makes miracles on that end",
            "I dont understand this, I conquered the world before my first born came of age.",
            "I'm at 48.. I can't marry the women off fast enough.  Lol birthdays and Coming of age each day and week",
            "Sick. I am currently playing as my first characters great granddaughter. I think we have 30-40 members as well, but I also separate couples after they have 3 now because things were getting out of hand for nogand and varic back in the day(dudes are freaks).",
            "Why were you I such a hurry? Make a story in your gameplay. Make it epic",
            "Rain, even."
        ]
    }
}