{
    "/r/BuildAPCSalesCanada General Discussion - Daily Thread for Sat Jun 29": {
        "title": "/r/BuildAPCSalesCanada General Discussion - Daily Thread for Sat Jun 29",
        "score": 1,
        "url": "https://www.reddit.com/r/bapcsalescanada/comments/1dr66ff/rbuildapcsalescanada_general_discussion_daily/",
        "content": "Cheap part recommendations and general build help are welcome (though you might want to consider using /r/bapccanada or /r/buildapc first). Don't post limited time deals in here.\n\nBe sure to check out [the previous threads](/r/bapcsalescanada/search?q=title%3A%27General+Discussion%27&restrict_sr=on&sort=new&t=all) for previously answered/unanswered questions.\n\nBought something recently? Had a Good/Bad experience with a retailer? [Write a Review!](/r/bapcsalescanada/search?q=flair%3AReviews&restrict_sr=on&sort=new&t=all)",
        "num_comments": 0,
        "comments": []
    },
    "Canadian Retailer Reviews - May + June 2024": {
        "title": "Canadian Retailer Reviews - May + June 2024",
        "score": 16,
        "url": "https://www.reddit.com/r/bapcsalescanada/comments/1cilx1z/canadian_retailer_reviews_may_june_2024/",
        "content": "If you've recently bought an item and had a good/bad/meh experience, post it here.\n\n**Remember to take everything with a grain of salt as this is only the vocal minority.** The vast majority are lazy about saying \"Meh, ya I got my stuff\".\n\n|      | Jan-Feb | Mar-Apr | May-Jun | Jul-Aug | Sep-Oct | Nov-Dec |\n|------|---------|---------|---------|---------|---------|---------|\n| 2024 | [Jan-Feb](/r/bapcsalescanada/comments/18x0rwi/) (6) | [Mar-Apr](/r/bapcsalescanada/comments/1b54hhb/) (5) | May-Jun | Jul-Aug | Sep-Oct | Nov-Dec |\n| 2023 | [Jan-Feb](/r/bapcsalescanada/comments/10c6dca/) (15) | [Mar-Apr](/r/bapcsalescanada/comments/124ul3c/) (9) | [May-Jun](/r/bapcsalescanada/comments/1362ss3/) (4) | [Jul-Aug](/r/bapcsalescanada/comments/14tku3l/) (4) | [Sep-Oct](/r/bapcsalescanada/comments/16ijrng/) (9) | [Nov-Dec](/r/bapcsalescanada/comments/17npzdc/) (10) |\n| 2022 | [Jan-Feb](/r/bapcsalescanada/comments/rtoixq/) (14) | [Mar-Apr](/r/bapcsalescanada/comments/t88uer/) (22) | [May-Jun](/r/bapcsalescanada/comments/uhubi8/) (12) | [Jul-Aug](/r/bapcsalescanada/comments/vzb0vo/) (8) | [Sep-Oct](/r/bapcsalescanada/comments/x3f6b5/) (10) | [Nov-Dec](/r/bapcsalescanada/comments/yjv8p1/) (12) |\n\nAlso check out /u/BlackRiot's **Retailer Comparison** (RMA too in the 2nd tab):  \nhttps://docs.google.com/spreadsheets/d/1L8uijxuoJH4mjKCjwkJbCrKprCiU8CtM15mvOXxzV1s\n\n# Formatting\n\nIn order to keep things neat, try sticking to the template please. \n\n> `#` Retailer (`Date Ordered` - `Date Arrived`)\n> \n> `* ` ($30) Item Bought\n> \n> ` `  \n> Why your experience was amazing.\n \nUsing Markdown Mode: the `# ` and `* ` will format things nicely like below. Fancy Pants editor: create Headings with the `T` button, and bulleted lists with the button beside it (they may be hidden under `⋯`).\n\n-----\n\n# Retailer (May 6 - May 9)\n\n* ($30) Item Bought\n\nWhy your experience was amazingly terrible.",
        "num_comments": 10,
        "comments": [
            "\\# Aliexpress - Comet Crash Global Store (April 19 - April 30)\n\n* (389$) AMD Ryzen 7 7800x3d\n\nI know this isn't a Canadian retailer, but with the Aliexpress sales being so prevalent now and people having questions, I'd like to post this here. (Feel free to remove if needed)\n\nThe processor is working perfectly. Booted first go, no issues. Took my RAM's EXPO with no issues. Slowly working on a negative curve (-10 now, will do -20 if stable). This is a real processor. It works.\n\nThere are still some things you need to know about :\n\n\\- This is a tray CPU. These CPU are meant for OEMs to build systems with, and so you have no warranty to fall back to if the CPU is bad. This is a risk you take in exchange for the big discount you get, but CPUs aren't really prone to failing, so that was a risk I was willing to take. (And I had a defective 6700k back in the day !)\n\n\\- The sales last a week usually, so give people a few hours, they'll figure out the best code combos.\n\n\\- It might take awhile for it to ship. In my case, I ordered on April 15, and it shipped on the 19th. I suspect the store gets slammed during those sales and they only have so many people to ship stuff. The order will auto-cancel if they take more than I think 9 days to ship.\n\n\\- Always be critical, double check the store you're buying from, Aliexpress is a marketplace. Read reviews, read comments on the sale post. Many people have bought from Comet Crash and gotten exacfly what they've bought. I would still personally avoid buying storage from Aliexpress because fake SD cards are so prevalent even on Amazon and other retailers. (I buy all those in person if I can)\n\n\\- You may or may not be charged customs and duties. There's been reports of it going either way. I personally was not charged anything and I live in Quebec. YMMV.",
            "# AliExpress (April 16 - April 24)\n\n* AMD Ryzen 5700X3D ($224 CAD)\n\nSo I took a gamble with these AliExpress processors and I lost. The CPU was working beautifully for two weeks then my computer suddenly shutdown and would not power back on. Computer would not POST. Having done extensive troubleshooting I thought it was the Motherboard that died, but I bought a new one and put it on the PC and worked for a couple of hours before the same thing happened.  I put my old processor into my new Motherboard and it has been working since. For kicks I tested my old Motherboard with both processors and neither would boot. Not sure if the Motherboard ended up killing the CPU or the CPU killing the motherboard, but either way dealing with AliExpress has been a nightmare. I'd have to pay for return shipping to China with no guarantees or reassurances that I would get my money back. My credit card purchase assurance would not cover this as it is a \"manufacturers defect\" so my only recourse is to file a charge back and hope it goes through. \n\nShort answer is don't buy from AliExpress to save a few bucks. You are not protected in anyway.",
            "# Amazon Canada (Apr 29 - May 3)\n\n* ($17.99 + $22.99) TP-Link AC600 USB WiFi Adapter + Lepro Desk Lamp\n\nAfter seeing the JayzTwoCents video where he showed off a rather nice slimline LED lamp I checked it out but it was too expensive; I hunted around for alternatives and ran across the LePro lamp which fitted within my budget. As I had some gift card money left over and wanted to get free shipping I looked for a cheap wifi adapter that had the 5 GHz as well as 2.4 GHz (my older one only supports 802.11n) frequencies, and ran across the TP-Link in the assorted recommended sales section.\n\nDelivery was originally scheduled for May 2 but got bumped to May 3 due to \"instructions sent by buyer\" which I thought was weird because I sure as blazes never told Amazon to change the delivery parameters. Out of an abundance of caution I changed my Amazon password just in case.\n\nDelivery on May 3 was as expected, and the products work as advertised.",
            "# Newegg (April 29 - May 1) + (May 4 - May 7)\n\n* ($164.97) G.SKILL Trident Z5 Neo RGB Series AMD EXPO 32GB\n* ($194.99) Super Flower Leadex VII XG 1000W 80+ Gold\n\nSo... Newegg, ah, Newegg. Literally the option of last resort for many, myself included. But those two orders left me impressed that they've actually shipped and delivered even faster than Amazon does. I literally got the part the day after the shipping date. I thought the ram was a lucky fluke, but then it happened again with the psu...\n\nNow lets just hope I don't have to test if their return bullshit has improved or not, but I gotta say their shipping definitively has.",
            "# ShopRBC (May 31)\n\n* WD SN580\n\nThey were kind enough to ask me if I wanted to cancel my order because instead of charging me $11 for shipping an M.2 SSD, they wanted to charge me $40 since the item was coming from BC, and I was located just outside the GTA. No clue how they have their shipping prices so high.",
            "# Newegg (June 26 - June 27)\n\n* ($239.99) Phanteks NV7\n\nMy package arrived next day, less than 24 hours after the order was placed. The item was sealed, didn't look like it was ever opened. I had to pay $20 for shipping, otherwise I was impressed. I may consider buying from them again if this keeps up.",
            "Do you know which store you bought yours from? I have one coming in next week and I'm scared of it dying on me randomly as well",
            "> They were kind enough to ask me if I wanted to cancel my order because instead of charging me $11 for shipping an M.2 SSD, they wanted to charge me $40 since the item was coming from BC, and I was located just outside the GTA. No clue how they have their shipping prices so high.\n\nThey drop ship directly from distributor, as does pc-canada.\n\nIf there is no stock locally they might have to source it elsewhere.\n\nNot ideal compared to Amazon/CC.",
            "CPU-Top-Store. Honestly I wouldn’t risk it, I wasted days troubleshooting. I hope my credit card sides with me for the chargeback but haven’t heard anything so far.",
            "Thanks for the reply, I purchased mine from Computer Hardware Store. Hopefully it'll last"
        ]
    },
    "[CPU+MOBO] Ryzen 7 7800X3D+MSI B650 Gaming Plus Wifi, possible ATL? [$600][Memory Express]": {
        "title": "[CPU+MOBO] Ryzen 7 7800X3D+MSI B650 Gaming Plus Wifi, possible ATL? [$600][Memory Express]",
        "score": 55,
        "url": "https://www.memoryexpress.com/Products/BDL_MM00003964",
        "content": "",
        "num_comments": 39,
        "comments": [
            "Possible ATL if you consider the board at $245 retail price.\n\nLast I've seen it on a bundle was $360.\n\nThis is excluding tray versions of this CPU from Aliexpress that don't have any warranty and minimal recourse.\n\nThe board is excellent, and more than enough for future AM5 CPUs.\n\nRyzen 9000 is weeks away, but gaming performance is rumoured to not be much better.",
            "Pulled the trigger on this one. Heard a lot of good things about the 7800x3d. Excited for a new build.",
            "ive been wanting to upgrade from an old used i7-6700 i got off facebook... this is very tempting lol. i have an old corsair 400c case maybe i could fit in there. Does anyone happen to know if I can fit new mobos in old cases?",
            "I think the deals gone now. Url doesn't go to anything and the closest thing I found was another 7800x3d and b650 e wifi for $620",
            "Darn, I may have to finally put my 8700k to rest",
            "[DO IT DO IT DO IT DO IT DO IT](https://www.google.com/imgres?imgurl=https%3A%2F%2Ffiles.otakustudy.com%2Fwp-content%2Fuploads%2F2011%2F08%2F03220107%2F0184.jpg&tbnid=_0LOU3mvb_ImTM&vet=1&imgrefurl=https%3A%2F%2Fwww.otakustudy.com%2Fvideo-game%2F2010%2F04%2Fsam-recommends-hiimdaisy-persona-4-comic-dub%2F&docid=oX_NySKJdyg4FM&w=480&h=360&hl=en-US&source=sh%2Fx%2Fim%2Fm4%2F3&kgs=4d68d687ec21349d&shem=abme%2Ctrie)",
            "I would be replacing an i5-7600(non k) if this were two weeks in the future. Feels bad man. \n\nGreat deal.",
            "I wish they would've included 32GB of 6000Mhz DDR5. I'm waiting for one of those Bundles.\n\nsince I need upgrade my 5800X and my DDR4.\n\nI might just splurge....\n\n  \nThe board specs says it has 2x M.2 Slots... but I only see one.",
            "Not a bad deal.. but not worth upgrading for myself YET. HOOOOLD!",
            "I may buy this. I found a brand new rtx 4070 on fb marketplace for $650 cad that i may pair with it. Is that a good deal?"
        ]
    },
    "[Mini PC] Beelink SER6 MAX Mini PC W11 Pro, AMD Ryzen 7 7735HS(8C/16T up to 4.75GHz), 32GB DDR5 500GB NVME SSD Radeon 680M 12 core 2200 MHz W-F6/BT5.2 Quad Display Mini Gaming PC Computer ($839.00 - 45% - 20% at checkout = $367.20) [Amazon.ca]": {
        "title": "[Mini PC] Beelink SER6 MAX Mini PC W11 Pro, AMD Ryzen 7 7735HS(8C/16T up to 4.75GHz), 32GB DDR5 500GB NVME SSD Radeon 680M 12 core 2200 MHz W-F6/BT5.2 Quad Display Mini Gaming PC Computer ($839.00 - 45% - 20% at checkout = $367.20) [Amazon.ca]",
        "score": 32,
        "url": "https://www.amazon.ca/gp/product/B0BRRVFP2T/?th=1",
        "content": "",
        "num_comments": 25,
        "comments": [
            "Damn, slap it on a small portable monitor and carry along a Logitech wireless keyboard + mouse and you have a whole PC going on! I wonder if anyone's done something like that before /s\n\nJokes aside, I like this move to mini-PCs. I travel between semi-permanent desk set-ups every now and then and something like this is perfect. My Surface is only a few years old but it's starting to chug pretty bad when doing basic things like having multiple YT tabs open or playing a basic game like Genshin.",
            "Looks to be done.",
            "Damn, that died fast.  I would've jumped all over this for under $400 :(",
            "Shoot ! Been watching deals daily for months and this is only deals that I most like and yet can’t get it",
            "This is a tiny PC with a *laptop* processor. The AMD Ryzen 7 7735HS CPU is Zen 3+, 8c/16t. The 32GB RAM is good for having a lot of stuff open, but also good for shared memory with the integrated GPU. The iGPU is on the RDNA2 architecture which is the same as in the Steam Deck, Xbox, and PS5 (though, this iGPU is obviously much weaker). And finally, this does support upto 4k 144hz HDMI output.\n\n\n\nI think the stacking promotions might be a mistake. But as long as you see it still listed for Save 20% at Checkout here: [https://www.amazon.ca/promotion/psp/AJL225AGZ6S5E](https://www.amazon.ca/promotion/psp/AJL225AGZ6S5E) then the promo is still ongoing.",
            "Great find! Almost 415$ all in is a steal",
            "This is actually a surprisingly good deal on this.. The GPU they included plus DDR5 + NVME is almost as much as this entire setup.",
            "Really wish these came with 2x 2.5gbe ports.",
            "I have an older version of this beelink with a 5700u. It works great no complaints. The igpu can play older games and esports titles at 1080p medium or low around 60fps. \n\nMinisforum minpcs tends to have slightly better features (i.e. usb4) but a bit more expensive and was harder to get before but now they are also on Amazon Canada.",
            "479 now"
        ]
    },
    "/r/BuildAPCSalesCanada General Discussion - Daily Thread for Fri Jun 28": {
        "title": "/r/BuildAPCSalesCanada General Discussion - Daily Thread for Fri Jun 28",
        "score": 1,
        "url": "https://www.reddit.com/r/bapcsalescanada/comments/1dqed5q/rbuildapcsalescanada_general_discussion_daily/",
        "content": "Cheap part recommendations and general build help are welcome (though you might want to consider using /r/bapccanada or /r/buildapc first). Don't post limited time deals in here.\n\nBe sure to check out [the previous threads](/r/bapcsalescanada/search?q=title%3A%27General+Discussion%27&restrict_sr=on&sort=new&t=all) for previously answered/unanswered questions.\n\nBought something recently? Had a Good/Bad experience with a retailer? [Write a Review!](/r/bapcsalescanada/search?q=flair%3AReviews&restrict_sr=on&sort=new&t=all)",
        "num_comments": 9,
        "comments": [
            "Currently running an ASRock B650 Pro RS ATX mobo, AMD 7900x cpu, and RTX 4080 gpu.\n\nCurrent ram is a G.Skill Flare X5 32gb DDR5 6000 kit with 30-38-38-96 timings. \n\nLooking to upgrade ram to 64gb as with my regular workloads it sits at 90-95% memory usage quite regularly.  \n\nAnyone recommend any 64gb kits that meet or exceeds performance of my existing RAM? Preferably something on sale but if its not on sale and actually worth it ok too.",
            "does anyone knows of this is a good chair ? https://www.visions.ca/ergopixel-knight-premium-xl-leather-gaming-chair\n\nlooking for a solid chair around 350$ this looks too good to not have a catch.",
            "I'm still rocking my Corsair Graphite 230T from 2012 and I'm tempted by the H9 elite since the price has come down so much, however I worry about the glass top since my cat jumps on my tower to get to my desk.\n\nCan anyone comment on whether this is a valid concern or if i'm worried about nothing? Is the glass scratch-resistant enough that it wouldn't be an issue?",
            "Does anyone know of fans that are 140mm that work well pushing air into/outside cases? Currently own a D15 cooler, and need a replacement set of fans for it (something with a little more OOMF), and for my exhaust.\n\nI'd need.. 5-7 fans total, obviously looking for something that either has a decent warranty or decent lifetime. 140mm requirement.\n\nI'd be looking for 2 upwards exhaust, 1 for the reverse exhaust, 1-2 for the front intake, and 3 for my Cooler. (Was debating on either Be Quiet!, Arctic, Thermalright or other types. Non-LED preferred because I don't like a planetarium/rock show in my case)",
            "Not sure if any of these apply, but memory express has a bunch of ddr5 kits on sale for canada day, https://www.memoryexpress.com/Promos/CanadaDay.cm.aspx",
            "all gaming chairs are bad chairs.  they just aren't designed very well for ergonomics.",
            "I can't give you any concrete advice, but tempered glass should handle anything that isn't as sharp as a kitchen knife. Cat claws should not do enough damage to scratch it.. However; take this with a grain of salt since I haven't owned a Glass case. (I've dropped a tempered glass pane 2-5' and it didn't crack, scratch, or shatter. It \\*SHOULD\\* be more than tough enough to handle cats.)\n\nWorst case scenario, a DIY solution would be to put a small bit of double-sided velcro/scratch resistant padding where your cat normally jumps onto and it should prevent any issues at all.",
            "appreciate the response, unfortunately none of the on sale 64g kits are compatible with my motherboard and at least match its latency.\n\nthanks though!",
            "Yeah, you're much much better off with a proper office chair, it'll probably be cheaper and have more/better features and be 100x better designed.\n\nAnything that yt/streamers use as a 'gaming chair' is only for a 1-3 hour session at most, not something you'd use for productivity or longer sessions due to potential back issues down the line. The average gaming chair unfortunately isn't designed with long term comfort or back support in mind."
        ]
    }
}