{
    "Free Talk Saturday - June 29, 2024": {
        "title": "Free Talk Saturday - June 29, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/barstoolsports/comments/1dr71we/free_talk_saturday_june_29_2024/",
        "content": " Gambling, sports, etc. \n\n&#x200B;\n\nIt's Saturday, lets get weird!",
        "num_comments": 423,
        "comments": [
            "Feeling very nostalgic about John Anderson retiring from SportsCenter.  Probably because that show is an absolute shell of what it used to be.  Feels like I watched hundreds of Big Monday and Super Tuesday college basketball games that led into the 11 pm SportsCenter with Anderson and Van Pelt.  He was also in the greatest This is SportsCenter commercial with Steve Irwin wrestling the Florida Gator mascot",
            "Thinking about those MMM vids",
            "One of my buddies tweets whatever is making him angry which leads to him cursing at local politicians and players from his favorite sports teams on Twitter. In case you’re wondering, he has a real picture of himself as his avatar and doesn’t understand why that’s a bad idea. ",
            "The MBA sub is my guilty pleasure when it pops up on my homepage. So god damn dramatic",
            "Extremely corny but I love those videos of people asking chicks if they think Lizzo is beautiful and they say \"of course she is\" and they go \"oh good I think you look like her\" and then they get extremely angry",
            "People who buy hauwk tuah merch should be euthanized",
            "Why is peanut butter so good?",
            "Heading out today for a quick trip with the boys culminating in the USA-Uruguay game on Monday night. The 6 of us have been friends since freshman year of high school. Have a couple activities planned but honestly might be most looking forward to the FIFA tournament that almost certainly won’t even make it past the group stages because it’ll take too long and someone will get too drunk",
            "Russillo had a life advice question about an underfed infant and transitioned to a story about how he had a play date at a girl’s house with hippy parents when he was 7 and the parents made him wear a Native American skirt. We don’t deserve him ",
            "Got a theory that all the Nissan maxima drivers of the last decade have transitioned to dodge chargers "
        ]
    },
    "TV & Movies Forum - June 29, 2024": {
        "title": "TV & Movies Forum - June 29, 2024",
        "score": 0,
        "url": "https://www.reddit.com/r/barstoolsports/comments/1dr70jo/tv_movies_forum_june_29_2024/",
        "content": "What are you watching? What do you recommend? What do you want to see? This Forum meets once a month.",
        "num_comments": 23,
        "comments": [
            "Posted this elsewhere but finished season 3 of the bear yesterday and really didn’t enjoy it. Felt like a bunch of short films rather than a TV show with any real plot or pacing. ",
            "The new Efron/Kidman movie A Family Affair is a hallmark movie disguised as a romcom. Not good!",
            "I’m on season 2 of Star Trek TNG. Never thought I’d get into Star Trek but here we are.",
            "Suits but about to give up.  We're in season  3 mow",
            "Finished The Bear season 3. Easily the worst season. Not that is bad per se, just season 1 and 2 are excellent and this was not.\n\nSaw Horizon part 1 in theaters as well. Pretty good. Plays more like a TV show in theaters than it does a movie. Lot of storylines to follow. But the action is done extremely well. Looking forward to part 2",
            "Finished a rewatch of Black Sails and am still convinced it's the best show no one watched.",
            "For those who are interested: the Criterion Collection sale is going on at Barnes & Nobles.",
            "Fire up Presumed Innocent and enjoy. Really entertaining.",
            "Just finished season 2 of Australian Survivor. For my survivor nerds, I’d probably rank it my 5th favorite survivor season ever after 20,15,18 and 37. PM me if you ever want a link to watch.",
            "Is season 2 of the bear worth watching? Never got around to it"
        ]
    },
    "Savannah James reposting Cheahs tweet on her Instagram ": {
        "title": "Savannah James reposting Cheahs tweet on her Instagram ",
        "score": 156,
        "url": "https://x.com/vivalastool/status/1806533127600492731?s=46&t=082iSHxzoYtIYo4YAmL3rw",
        "content": "",
        "num_comments": 27,
        "comments": [
            "So there's a decent chance Lebron has seen this tweet. He texts Mike Trout. Made Brady laugh at a press conference. Is Cheah the real 🐐?",
            "This is actually insane. He can’t keep getting away with this!",
            "Lebron never getting his side pieces exposed and maintaining a happy marriage may be more impressive than his basketball accomplishments",
            "Crazy to think her son, husband, and father in law all played in the NBA",
            "Probably not true since he probably doesn’t even sleep with her anymore",
            "He’s like the Forrest Gump of interacting with athletes",
            "Gretzky's next, just need to catch biz on a good day",
            "god damn, these are good points. you might be right",
            "Also besties with Gunnar Henderson (future AL MVP)",
            "What was the Brady thing?"
        ]
    },
    "Friday Confessions - June 28, 2024": {
        "title": "Friday Confessions - June 28, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/barstoolsports/comments/1dqrdyd/friday_confessions_june_28_2024/",
        "content": "We all wanna head into the weekend with a clear conscience. So leave your deepest, darkest confessions. Admit to your most embarrassing secrets. Happens every week. This post is only up for 2 hours. Locks at 5:00pm ET.",
        "num_comments": 69,
        "comments": [
            "I wore a Livestrong band for way too long in high school",
            "My wife stopped drinking about a year ago, while I’m proud of her for committing to it, I’m also bummed because we have less of a social\nLife now",
            "Got called back to the doctors office this week to do a 2nd blood test because my T levels are low. Only 31, it’s a bit demoralizing being told that.",
            "I broke up with my long term gf of 7 years about a year ago (she cheated on me) and have been in a massive depression ever since. None of my friends know how bad it's affected me and recently I've been prescribed anti depressants. Being single and 30 sucks lol",
            "sometimes i tell my wife i go tot he gym but i just sit in the steam room or sauna and sometimes sit out by the pool and then shower and come home",
            "I just turned 28 and I’m worried that I don’t have the mental bandwidth to maintain a happy relationship and start a family. Thus eventually dying alone.",
            "I chickened out of my first colonoscopy at 34 this week",
            "I love asmr videos on YouTube. A bunch of hot girls just whispering and it’s relaxing af.",
            "As a kid, I once saw my brother throw a stained dress shirt behind the washer in our laundry room because he knew my mom would kill him if she found out he ruined it. We're fairly close in age. Ever since that day, if I ever had a wet fart I made sure to dispose of said underwear behind that washer. When we got a new washer years later, it all got pinned on him.",
            "My first ever boss is a big mentor of mine and helped promote me, get me new jobs in life and just was an overall great teacher who genuinely wanted what was good for me in life. I would t be where I am today without me. \n\nHe recently got let go of a job he was in for 27 years. He was struggling in the job market and I was able to pull some strings and get him a job making way more money than he was in his previous gig. He sent me a long thank you letter today which moved me to tears. It makes me very happy I was able to give back to someone who did so much for me."
        ]
    },
    "Cheah with Breaking NBA News ": {
        "title": "Cheah with Breaking NBA News ",
        "score": 126,
        "url": "https://x.com/stevencheah/status/1806452911712452682?s=46&t=rj15tjA9ipN1thJ9TBPYHA",
        "content": "",
        "num_comments": 24,
        "comments": [
            "That’s a very solid tweet.",
            "Ay Tone! I said he was sleeping with his teammate's mom!",
            "91k likes. Cheah did it",
            "god damn, he got a Savannah James instagram repost. That is actually nuts",
            "I feel like this is a recycled tweet from Shedeur committing to Colorado but props to him for being the first one to recycle it I guess",
            "You hear that!? He said he was sleeping with his teammates mom!",
            "Holy crap. It’s over 100k now… when I posted it had like 900",
            "Go see who the Lakers drafted in round two.",
            "And the same joke Doug Mcdermott’s dad made on PMT. People are pretty simple though.",
            "Morning update: 170K. Is this at the top of the Barstool leaderboard?"
        ]
    }
}