{
    "RULE REMINDER: You cannot Post Offers to Trade Or Sell Copyright Material. This includes Vertshock and Similar Programs": {
        "title": "RULE REMINDER: You cannot Post Offers to Trade Or Sell Copyright Material. This includes Vertshock and Similar Programs",
        "score": 232,
        "url": "https://www.reddit.com/r/Basketball/comments/gdo5ml/rule_reminder_you_cannot_post_offers_to_trade_or/",
        "content": "Admins have banned other subs for this.\n\nNo asking for or posting codes for programs like Vert Shock\n\nNo asking for or posting illegal streams for games.\n\nYou will be banned, as I will not allow the entire sub to be closed for a few bad apples. This is your warning.",
        "num_comments": 153,
        "comments": [
            "What are your recommendations on increasing your vert",
            "how about just giving someone a free jump program that was originally free?",
            "I think you just promoted Vertshock right?",
            "I just turned 17 years old, 6'9, 225 lbs center playing in Europe. I train 3 times a day, 4 times a week. The other two days are game days, unless we don't play then it's rest. Typical day I do weight training, individual training for my position, and team practice. I am incorporating stretching at home to reduce injury, but I want to increase my vertical, especially my standing dunk. I can windmill off one foot, but I only do open dunks, and almost never do standing dunks in game. I still have not dunked on anyone and I want to be unstoppable. I read that I shouldnt do plyometrics if I am already playing basketball multiple times a week. I was thinking about starting to do jump roping, tibialas, noridcs, split squats at home with no weight. Should I also do 1 plyometric exercise at home as well or like a vertical jump exercise? If so, which one? I want to be able to drive and dunk with no effort and drop step dunk over someone. In games I hesitate. I also read that maximum effort jumps will help as well and was thinking about doing those everytime after practice for 30 minutes? Also, how important is my diet involved in this?",
            "Spurs making the western conference finals any thoughts on this?",
            "i just turned 15, 6 feet tall, and trying to work out for basketball and overall health. would I be able to dunk? what exercises should i do to work out my legs and how many reps?",
            "I am only 4 foot 9 and can touch 8 and a half foot net. The best thing is plyometrics. I take a backpack and fill it with books then do squats, jump over things, do lunges, squat jumps, all kinds of things. Just find plyometrics and use them daily. Make sure you plan out what you want to do.",
            "How be a force like Zion Williamson? \n\nI am 5'10, 70 kg Indian 22 year old college student. \n\nShifted to basketball from soccer and I got really good. Now I want to be force like Zion and establish myself as one of the best PF in the state. \n\nPracticing layups a lot as it is my main scoring weapon. But I can't dunk or shoot accurately. I am planning to put some weight and continue practicing layups. \n\nWhat else should I incorporate in my training? \nWhat other things should I do to improve my game and reach my goal? \n\nThanks in advance.",
            "Yes, because its illegal, and reddit as a company can get sued if this is allowed, so the reddit admins close down communities that allow it. \n\nOther subs that were for illegally streaming games have been banned. \n\nI don't want this sub banned for this, so here is the rule.",
            "Boo"
        ]
    },
    "Dunking Questions Mega Thread": {
        "title": "Dunking Questions Mega Thread",
        "score": 14,
        "url": "https://www.reddit.com/r/Basketball/comments/1ari4q9/dunking_questions_mega_thread/",
        "content": "All Dunking questions, posts here.",
        "num_comments": 89,
        "comments": [
            "I want to be able to dunk eventually but right now I can't even touch the rim. I'm 5'9 and 160 lbs and I'm trying to increase my vertical so I'm able to dunk.\nI'm doing heavy squats atg and 4 different plyometrics exercises every leg day 2x a week along with rdls. How have you guys increased your vertical jump? I will also be biking soon probably 3x a week.",
            "Am I ready to learn the dunking technique? I can fully grab the rim while jumping from standing still, I am 6 feet and 17 years old",
            "How long do you think it will take me to dunk?\n\nIm currently 5,6, 5,7 with my shoes on and about 105 pounds. Im 15.5 which is on the shorter end for my age however I just got my first growth spurt recently and last year about this time I was about 5,1 or 5,2. Currently Im doing plyometrics some leg training and some core exercises. I have been doing these for about 3 weeks and have seen some improvements. I can touch the backboard and with a running vertical I can touch 9 feet. If I keep going can I dunk by my senior year (I'm in 10th currently). Im doing plyometrics Monday Wednesday and Friday currently.",
            "Hi all, could u guys give me some advice on how to be able to dunk properly (like accurately and consistently), I'm currently able to touch the rim with the 2nd-3rd segment of my fingers (counting from hand) if I stretch myself and jump as much as I can (I'm 5'10 without shoes and 132lbs), and I think I will be able to grow a bit as I'm still 15 and half. What type of training should I do to be able to dunk, preferably in 4-5 months?",
            "Should I be elite at my fundamentals first before learning how to dunk?",
            "I'm 6'2 teetering on 6'3 and I still can't dunk. I can grab rim easily with a standing jump and can smack about 5 or 6 inches above the rim on a backboard with a running jump. I just can't seem to get the ball over. Any tips?",
            "So on the hoop there are those little hooks that carry the net. When I dunked today I realised that it's possible for my finger to get in there. So I'm now wondering whether it's possible to injure yourself by having your finger stuck in those holders?",
            "I'm 5'9 and I'm trying to dunk. I have no equipment at home, what kind of workout can I do to increase my vertical? Also is it possible to dunk at 5'9?",
            "6'1 and couldn't touch net 6 months ago, after fixing my form and using the penultimate step I was able to touch rim in a month. After cutting weight and eating healthier and doing plyometrics 4X5, isometrics, bench presses, 50 weighted calf raises, Iso-lateral leg curls 4X5, and leg presses 3 times per week and just jumping a lot got me 7 inches over the rim 6 months later. Good luck y'all.",
            "Hello Everyone, I am a 6'0 freshman in high school and want to make the basketball team next year. I feel like if I was able to dunk my chances to make the team would be astronomically higher ( No one on the team can dunk), I was looking at programs and came upon vertshock and thought that with it I could for sure dunk. I can dunk on 9 feet pretty okay .. I think I need like another 12-13 inches. It would be awesome to get it during the summer but a must before tryouts in Novemeber. I have never done plyometrics before .. would Vert Shock be a good program? Some said it is really good while others said it is extremely bad. Could someone with experience or who did the program give me some thoughts on their experience with it?"
        ]
    },
    "Who’s a player from the past that would be better in the current era than they were in their own era?": {
        "title": "Who’s a player from the past that would be better in the current era than they were in their own era?",
        "score": 67,
        "url": "https://www.reddit.com/r/Basketball/comments/1dqygne/whos_a_player_from_the_past_that_would_be_better/",
        "content": "Rasheed Wallace was built for this era. He can shoot the three, push the break, finish around and above the rim and is a great rebounder and defender. I think if he plays in this era. He’d be an all star every year and be up for MVP.",
        "num_comments": 353,
        "comments": [
            "Andrei Kirilenko fits better today. Same with his teammate Mehmet Okur.",
            "I think Larry Bird would be massively upgraded with having the green light to launch more 3s. Also, there would be so much more space underneath for him to operate and pass.",
            "I think Reggie would cook as well. Shaq had monster numbers already, its scary to think what he could do against todays bigs. But hed have to stay in Orlando shape",
            "Rick Barry, like Bird who is mentioned here already, is one of the great shooting forwards of all time. His range would easily cover the 3 pt line, the new rules on D would benefit him too. The year he one the NBA Finals, the team was already a space and pace team... he was made the current era",
            "Mark price or steve nash would basically be the top PGs if they played today. Somewhere between curry and Trae young.",
            "Dan Majerle, and Pete Maravich come to mind.",
            "Mj really would be something to watch in this era of no handcheck and lots of freedom for guards like him",
            " Penny Hardaway I think would be pretty good.  Looser dribbling and offensive rules.  He was a pretty decent athlete.",
            "Marcus Camby had a solid j, would have stretched out to 3 and been a rich mans Brook Lopez in this era",
            "Mahmoud Abdul-Rauf and Drazen Petrovic"
        ]
    },
    "Is heating up/going cold a real thing?": {
        "title": "Is heating up/going cold a real thing?",
        "score": 15,
        "url": "https://www.reddit.com/r/Basketball/comments/1dr3sc3/is_heating_upgoing_cold_a_real_thing/",
        "content": "Just got into basketball and my first few weeks were depressing in term of fg%. However, after a 10 day vacation where i played no ball, I played a game of 21 where I shot lights out. \n\nI really felt like I couldn't miss getting to 17 (2s&1s) primarily from beyond the arc. Maybe missing 4 of my shot attempts.\n\nUnfortunately the group I was playing with kept letting in new players till we had about 9 bodies in the paint. I'm maybe six foot with my hoop shoes on and a bit overweight. So it became difficult for me to get a board.\n\nThen after about 8min of not really playing, the game ended and we did runs. At that point I wasn't hitting shit and the ball was passed to me less and less.\n\nIn the game of 21 was I heated up/ had a hot hand? Or was it just luck?\n\nIf not, did the 8 min \"break\" cool me off to where I missed out on some crazy runs?\n",
        "num_comments": 11,
        "comments": [
            "Have you ever heard of the flow state? Its when everything comes into places and the ball feels so easy to handle and you can see the whole court and your moves are just seamless. Its a beautiful thing to experience",
            "Hot streaks are def a thing.  There are times when it feels like everything is going in.",
            "Hell yes. I need to shoot around before a game 99% of the time to start heating up",
            "Hot streaks Absolutely exist. One more easily explained example Ive been playing 15+ years and have MANY nagging injuries. When Im warmed up and my heart rate is way up and my adrenaline is pumping I cant really feel those injuries as much so Im no longer compensating with my movements. Which explains why old guys get hot and hit (x) number of shots in a row, its literally just the body heating up and temporarily alleviating the pain to allow for normal functionality",
            "Man, I'm 49 and still dragging my butt up and down a court.  Shooting is about the only thing I've been able to keep at a decent level and I hit 8 threes in a grand final last week.  Went on a 7/8 streak at one stage, and basically felt like I was shooting ten footers.\nBetter than sex.",
            "Yeah man, I randomly shot like 20 for 21 one day. Even threw a circus shot with my back to the rim and it swished in. I never shot like that again.\n\nAlso when I take a vacation, my first game back is usually pretty good for some reason. But after that I play like I was just on vacation.",
            "If you believe it, it will become a real thing.\n\nIt sure feels like a real thing though.",
            "Damn bro, you got me feeling nostalgic. I need to hit the hardwood again.  Thanks for that!",
            "In anime terms aka the zone in kuroko no basket",
            "Yes."
        ]
    },
    "(ShamsCharania) Lakers center Jaxson Hayes is exercising his $2.4 million player option to return for the 2024-25 season, sources tell @TheAthletic @Stadium. Hayes reunites with new coach JJ Redick.": {
        "title": "(ShamsCharania) Lakers center Jaxson Hayes is exercising his $2.4 million player option to return for the 2024-25 season, sources tell @TheAthletic @Stadium. Hayes reunites with new coach JJ Redick.",
        "score": 10,
        "url": "https://x.com/shamscharania/status/1806930626534138355?s=46&t=zaB6BvRw4JQLuLt8PkflfA",
        "content": "",
        "num_comments": 3,
        "comments": [
            "He cant wait to play with Bronny",
            "This was expected.",
            "YAY - Lakers fan"
        ]
    }
}