{
    "Weekly Discussion Thread | Requests, Promos, and Open Commissions": {
        "title": "Weekly Discussion Thread | Requests, Promos, and Open Commissions",
        "score": 1,
        "url": "https://www.reddit.com/r/battlemaps/comments/1dlyx2x/weekly_discussion_thread_requests_promos_and_open/",
        "content": " **Welcome to the weekly** [r/Battlemaps](https://www.reddit.com/r/Battlemaps/) **Megathread!**\n\nPosts not allowed in the general Battlemaps subreddit but are directly relevant to battlemaps are allowed in here. Topics should generally be limited to the following:\n\n* Requests\n* Self-Promotion (commissions, sales, patreons, etc)\n* Quick advice, tips, & tricks\n* Reviews & recommendations\n* Other meta or battlemap-related discussions\n\nPosts not directly relating to tabletop battlemaps may be removed at the mods' discretion.",
        "num_comments": 7,
        "comments": [
            "[Coffee Dragon Studios](https://www.patreon.com/CoffeeDragonStudios)\n\n>Post-apocalypse, Sci-fi, and Steampunk artist\n\nEncounter, Cities, Worlds, Galaxies...\n\nI do a bit of everything from commissions to making new maps every month.\n\nUntil the end of July, I have a Community Map event where Patreon supporters, Free and Paid alike, can make suggestions on what to put in a Post-Apocalyptic Mall.\n\nPlease click the links below for more info!\n\n[Maps ](https://www.patreon.com/collection/528888?view=expanded)- Free and Paid!\n\n[Commissions](https://www.patreon.com/posts/91167984) - Open again!\n\n[Community Mall Map](https://www.patreon.com/posts/mall-madness-106699501) - Fun for the whole Nuclear family!\n\nStores - It's cheaper on my Patreon. \n\n[Patreon](https://www.patreon.com/coffeedragonstudios/shop)\n\n[Itchio Store](https://coffee-dragon-studios.itch.io/)\n\n[DTRPG](https://www.drivethrurpg.com/en/publisher/24899/lair-of-the-coffee-dragon)",
            "Hi, I have come across ad for mega map bundle. For advertised quality AND quantity it seems too good to be true. Also it's weird that I can't find any mention about that site.\n\n[ekingpacks.com](https://www.reddit.com/r/battlemaps/comments/1dlyx2x/comment/lagkp7s/?context=3)\n\nIs it legit? Thank you",
            "I am looking for suggestions for a map of a temple that once held a divine fountain, but is now overrun by sand. Ideally one I can out in a small dungeon, or which has enough rooms to be a small dungeon. I am happy to subscribe to a patreon of a creater to get necessary variants if the work looks good and fits the concept very well. Hopefully this is a good place to ask! Thanks!",
            "**Fantasy Map Commissions**  \nIf you're looking to get Fantasy World Maps, Town Maps, or Battle Maps of high quality and Resolution, made within a short span of time, then i'm the one you're looking for. You can commission me to make a map, and depending on how detailed you want it to be and the theme of the map, the price may vary. Each type of map has a Base Price, but the total price may increase depending on amount of detail, requests, etc. Either way, upon receiving payment the map will be finished within 1-3 days, less than 24 hours at my fastest.\n\nI do all of the following maps, however, Region, interior and Battle maps are my specialty, and as such are of higher quality, hence the higher base price. A specialty of mine are also replicas, essentially, a map you wish to be remade with more detail. A Replica map costs as much as the base price of that kind of map, plus an additional 5$ However, unless you choose to pick and Add-on, the price will not change from there on.\n\nAdditionally, if you decide to Commission 4 or more maps at a time, you will be given a minimum discount of 10% off the total price, though depending on your order this Discount might increase.\n\n*Base Prices* (Replica: +5$)  \nWorld Map: 15$  \nRegion Map: 20$  \nTown Map: 10$  \nBattle Map: 20$  \nInterior Map: 20$\n\n**Add-On Prices**  \n*Step-By-Step: 5$*  \nThis option will let you follow along the making of the map, allowing you to get notes on progression and the current look of the map.  \n*6k Resolution: 5$*  \n*8k Resolution: 10$*  \nNormal Maps will be rendered in 4k resolution, but adding either of these options will give you a map in a higher quality.  \n*No Watermark: 5$*  \nAll maps will be made with a watermark of my name, however, using this option will give you the map without the watermark.\n\nPayment is done through PayPal, half of the total cost is paid in advance and the rest is paid once the map has been complete and sent to you. If you're not happy with the map, then you can either pay to have it remade, or keep the other half of your payment, giving you the map for half the original price.\n\nIf you wish to put in a commission or want to see some of my work, then just DM me and we can talk further. I hope to get a message from you!\n\n[All previous maps commissioned from me!](https://drive.google.com/drive/folders/1djT0Z08g-NkfxeLsxMncKy1wxfro3sou?usp=sharing)",
            "Hey there! So, short and sweet, i got my hands on Dungeon Alchemist, however, i am not too good at using it yet, so i'm taking on cheap commissions to help me improve. The software allows me to work pretty fast, so the commissions will probably get done within one or two days.\n\nI can only do Battle, Dungeon and Building interior maps, not world or town maps! The price for a map is only 10$, cheap, like i said. The cost is paid in advance using Paypal.\n\nIf you're interested, then please DM me!\n\n[Sample mini dungeon](https://i.imgur.com/QQrudLT.jpg)",
            "Absolutely not legitimate, and I'll try to reach out to them for more information. Their social media links are dead, they don't show up in ANY images searches. A dive into their terms of service seems like they've made up a country of legal origin.\n\nDoing a whois website origin search, they are registered to an icelandic country, and using a generic phone number that is defaulted by a lot of scam engine searches.\n\nSo, this appears to be an illegal scam, and everyone should avoid using it. I'll consult with the other mods to see what we can do, and other content creators to see how it should be approached.\n\nThanks for bringing this up!\n\nEdit: Their payment portal is not protected. Under no circumstances should anyone make a payment there, unless you feel like compromising your bank account.",
            "Maybe automod that would add warning comment on specific links (like this one) or when there is chat about sale/price where it seems there is doubt ? :)\n\nAnyway nice info. Thank you"
        ]
    },
    "Desert River Battle Map 30x35": {
        "title": "Desert River Battle Map 30x35",
        "score": 18,
        "url": "https://i.redd.it/elfe4b1slg9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Hello, everyone!\n\nFinally, the adventuring party has reached the fabled river! Despite all the trials and tribulations in the hot desert the group has arrived to a new place that they can explore.\n\nThere are many caves where they can try to find lost treasures and good vantage points where they can see their enemies from a distance!\n\nThe creature tokens for this map are an Amber Spider, a Fungi Brute and a Twin-headed Snake. Emerald tier gets the Amber Spider while Diamond tier gets all three. In addition, Sapphire tier gets extra creature token variants. Click [here](https://i.imgur.com/qxblduY.jpg) to see the contents of the complete map pack!\n\nThank you very much for taking a look and be sure to check out my [Patreon](https://www.patreon.com/drmapzo) where you can pledge for gridless version, alternate map versions as well as the tokens pertaining to this map."
        ]
    },
    "Following the scattered remains, you reach the eerie cave entrance. The slippery, blood-soaked terrain adds to the tension. Will you brave the monster’s den head-on, or explore the area to devise a trap and lure it out? [56x38][OC]": {
        "title": "Following the scattered remains, you reach the eerie cave entrance. The slippery, blood-soaked terrain adds to the tension. Will you brave the monster’s den head-on, or explore the area to devise a trap and lure it out? [56x38][OC]",
        "score": 152,
        "url": "https://i.redd.it/sratpfwruc9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "As cool as this looks, the rocks look like teeth to me, and it's making me queasy just looking at it. Amazing job with the map, though! Leaving a like.",
            "Welcome back Fellow Darkish!\n\n[Monster Den Entrance](https://www.patreon.com/posts/monster-den-107058184?utm_medium=clipboard_copy&utm_source=copyLink&utm_campaign=postshare_creator&utm_content=join_link)\n\n* 56x38 Map\n* Gridded and gridless versions\n* Day, Night, Rain Day, Rain Night, Bloodmoon, Haunted, Massacre Day , Massacre Night, Fog, Toxic, Frost Day, Frost Night, Storm Day, Storm Night, Frost Massacre Day, Frost Massacre Night  versions!\n* Printable PDFs\n\nMAP DESCRIPTION:\nMonster Den Entrance are located in a wide clearing surrounded by rock, the harsh terrain prevents the growth of trees and large plants, making the area barren and inhospitable.\nThe intricate path is littered with the remains of many races, some ancient, others very fresh. Something dangerous has been lurking here for a long time.\n\nA large cave opens menacingly in the white rock, a perfect place where packs of small creatures or large, ferocious solitary animals might have made their lair.\nThe path continues to the left, and by climbing, you can easily reach above and to the sides of the cave entrance, creating opportunities to set traps and ambushes for the creatures likely hiding in the dark of the cave.\nThe lucky ones who manage to avoid being heard by the monsters might even reach the other side of the map unscathed and without fighting, but the numerous bloodstains converging in the den hint at how arduous the task might be.\n\nNOTES\n\n* Monster Den Entrance, with its numerous heights and perfect ambush spots, is designed to offer you thrilling battles and make every type of adventurer shine.\n* The numerous remains can provide valuable clues to those who can spot them.\n* Not only monsters can exploit this rugged and hidden area, but groups of malefactors might also find the cave an excellent secret base.\n* The barren but grassy biome fits most situations; you can use the map before or after a lush area like a forest or as a green area around a mountain.\n* The limestone rocks of the cave and those surrounding the map are friable and, with a well-placed explosion, can be used to create tactical collapses on particularly challenging monsters. Use the environment to your advantage.\n*  The broken wood pieces might hide useful items for defeating the monster, perhaps brought there by adventurers who prepared to fight it before you.\n* The cave can be a perfect entrance to a dungeon\n\nThat’s all for this map, Fellow Darkish; we’ll meet again soon for the second map of this month! \n\nWe wish you, as always, great adventures and NAT20,\nThe Darkest Maps Team\n\nTo access this and other maps by Darkest Maps you can join our [Patreon](https://patreon.com/DarkestMaps)",
            "Your maps are so good they make me want to cry. Always have to stop and stare at the details.",
            "Damn I ran a tension just today that this map would have been perfect for",
            "Definitely Killer *Rabbit* of Caerbannog, vibes",
            "This is a scary looking cave entrance. Loving this!",
            "Thank you!",
            "Thanks :)"
        ]
    },
    "[Amonkhet Battlemap]The Naktamun City [32x56]": {
        "title": "[Amonkhet Battlemap]The Naktamun City [32x56]",
        "score": 25,
        "url": "https://i.redd.it/kazjho846f9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Naktamun was located at the banks of the river Luxa and protected from the horrors of the surrounding deserts by the Hekma, a magical barrier maintained by the god Kefnet. During Nicol Bolas's initial attack on Amonkhet, Naktamun was the last city that stood against him and was to serve as the nucleus of the re-emerging civilization centered around him. Mummified dead did most of the manual labor of the city, building monuments and harvesting foodstock.\n\nAfter the Hour of Devastation had come, the city was destroyed by the Eternal army of Nicol Bolas and most of its gods were slain. The survivors, led by Hazoret, fled the city whose ruins were reclaimed by the local fauna.\n\nMore variations of this map:\n\n[https://www.patreon.com/posts/amonkhet-002-77456220](https://www.patreon.com/posts/amonkhet-002-77456220)\n\nMore free maps in the MTG multiverse:\n\n[https://www.patreon.com/posts/multiverse-77460821](https://www.patreon.com/posts/multiverse-77460821)"
        ]
    },
    "Honey I Shrunk the PCs in the Arcane Library": {
        "title": "Honey I Shrunk the PCs in the Arcane Library",
        "score": 21,
        "url": "https://i.redd.it/32o4uryf0f9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "I remember this level in Grounded."
        ]
    }
}