{
    "Freetalk Friday, 28 June 2024": {
        "title": "Freetalk Friday, 28 June 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/battlestations/comments/1dqj2kl/freetalk_friday_28_june_2024/",
        "content": "**Welcome to our weekly discussion threads which will renew each Friday.**  \nFreetalk Friday is meant to encourage additional conversation outside of what /r/battlestations typically allows.  \n\n* Do you have any news about upcoming events, tech releases, game events or other that you'd like to share and talk about?  \n* Are you looking for some advice on your build, or maybe what components to invest in within a specified budget?  \n* Use our weekly Freetalk Friday to chat about anything with minimal rules.  \n\n\nPlease keep in mind we still prohibit all self promotion and our civility rules will still be in effect.  \n\n**Check out our growing Discord at https://discord.gg/battlestations**",
        "num_comments": 2,
        "comments": [
            "Anyone have any examples of coherent and cool looking work + play battle stations? I work from home and have a standing desk for my work setup, I'm also looking to have a standing desk setup for my gaming desk setup. I'm leaning towards using a standing L-shaped desk and having my work setup on one side, gaming setup on the other, but open to using two separate standing desks as well. Any suggestions are appreciated!",
            "Meta: Why do so many people ask for “suggestions”? Or ask questions like “is this okay?”.  A setup is completely subjective to that person. If it works, it’s a good setup. Has always bugged me for some reason. You don’t need anyone’s approval lol"
        ]
    },
    "After 9 years using the same monitor, I finally upgraded to the G8 OLED": {
        "title": "After 9 years using the same monitor, I finally upgraded to the G8 OLED",
        "score": 578,
        "url": "https://i.redd.it/aul7onvb8f9d1.png",
        "content": "",
        "num_comments": 30,
        "comments": [
            "Nice! Are those plants real? What are they?",
            "Looks nice, but burn in on oleds is still an issue.  I wouldn't let that screen saver run perpetually.",
            "What kinda keyboard is that?",
            "I have this monitor and love it, but my god took me almost 2 hours to figure out why my screen was flickering every 3 minutes.\n\nFor anyone who wants to get this monitor, you have to turn off GSYNC in nvidia control panel. itll solve this issue.",
            "Can you give the details on the whole set, mate?",
            "I already have 1 screen replacement on the same monitor because of burn in.. in about just 7 months of coding.",
            "do you struggle with the touch sensitivity on the  BenQ light?",
            "Heard the monitor light has issues with OLED? Not sure if true",
            "This one won't last you 9 but congrats on the upgrade man.  Set your background to something dynamic that changes, hide icons and auto hide taskbar, change lock screen to just black.  Samsung oleds burn in pretty fast if you aren't careful.",
            "Thinking about changing to this monitor? Do you recommend it? 🤔"
        ]
    },
    "Upgraded from Alienware DWF to Samsung Odyssey G9 OLED": {
        "title": "Upgraded from Alienware DWF to Samsung Odyssey G9 OLED",
        "score": 590,
        "url": "https://i.redd.it/hdog8zxr7d9d1.jpeg",
        "content": "",
        "num_comments": 43,
        "comments": [
            "broo that axe is sick",
            "That Leviathan Axe is sick! How much did that cost you?",
            "This is more than a battlestation, it is where crusades happen",
            "What do you think? Happy with the switch?",
            "axe balances the poster\ncool mic arm",
            "Can we  get a link to that mic arm? Never seen one like that and it would be perfect for me.",
            "This is an axual nice setup!",
            "Gorgeous set up. Wow. I want to know more about your mouse, because I'm currently looking for a new one.",
            "It’s beautiful 🥹",
            "What’s the backlight on the ultrawide?"
        ]
    },
    "Thinking of doing stacked monitors? Thoughts…": {
        "title": "Thinking of doing stacked monitors? Thoughts…",
        "score": 742,
        "url": "https://i.redd.it/96yygx9ywb9d1.jpeg",
        "content": "",
        "num_comments": 100,
        "comments": [
            "Upvote for Tomie",
            "Super clean, really love the line going between the walls and yeah, stacked monitors would work great",
            "Not worth it in my opinion. You got yourself already a clean setup and to me it sounds like you would get rather diminishing return from acquiring another one.",
            "never go for stacked. People who go for it are just kidding themselves its not practical at all. Nor healthy for ur neck",
            "look very nice. which model is this light monitor back and wall other side?",
            "It’ll suck, I tried it… I ended up buying an LG DualUp instead, with a 30 in the middle.",
            "I tried stacked twice, hated it both times. I wanted to like it so bad but it felt terrible to use. You might have to try it to get your own answer.",
            "Prepare for neck pain",
            "Stacked monitors is just a trend; one that leads to neck pain. It's not practical, and I would recommend just doing one to the left or right, perhaps portrait orientation.",
            "Vertical second monitor > stacked. it wont mess with your neck and you'd have 2 tablet-size screens for Spotify / chats / videos."
        ]
    },
    "Finally 95% Complete With Dream Setup": {
        "title": "Finally 95% Complete With Dream Setup",
        "score": 107,
        "url": "https://i.redd.it/imjf4qgd0f9d1.jpeg",
        "content": "Finally got a space and some dinero that allowed me to complete my (current) dream setup (never fully done of course). Took me a whole good 2 weeks to complete this but so worth.\n\nGonna add some Pops on the above shelves and neon signs on the left and right cabinets.\n\nLet me know if any of you guys want links to anything!",
        "num_comments": 3,
        "comments": [
            "Ooh I like it, lots of lighting going on, and it all matches nicely. What kind of wall clock is that?",
            "Love the tie fighter monitor layout"
        ]
    }
}