{
    "New rule changes, flairs and updated styling": {
        "title": "New rule changes, flairs and updated styling",
        "score": 145,
        "url": "https://www.reddit.com/r/bayarea/comments/195xw2a/new_rule_changes_flairs_and_updated_styling/",
        "content": "The bay area is the focus of a lot of political controversy, both for legitimate issues in the area and in comparison to other, politically different areas around the country. The discussions about these issues often attract very strong opinions from users who only come to the subreddit to argue about them. This causes lots of extra work for us moderators, and also draws otherwise rule abiding users into heated arguments. We have decided to address this by restricting such discussions to only established members of the subreddit. We don't want to favor one political viewpoint over any others, so we run a moderation bot that applies the same, unbiased criteria to all posts about politics or crime.\n\nWhen commenting on these posts, the bot will automatically remove your comment without notice if you don't have an established history of commenting or posting in the subreddit. We intentionally aren't stating the exact requirements, or how close individual accounts are to meeting them, but they do require a low, but consistent amount of commenting or posting over a period of several months. If you do comment on one of the posts and your comment is removed, it doesn't count towards your accumulation of history, but there's also no penalty for doing so.\n\nPosting has the same requirements, but also requires that you not have posted a political/crime post in the last week. We also require that all such posts be only a link to a news article or official statement from a reporter or official. No self posts, image or video posts are allowed on these subjects.\n\nThese filters will be automatically applied if the flair of the post is \"Politics & Local Crime\". If you don't meet the requirements for posting and try to get around the filter by posting under a different flair, you can be automatically banned.\n\nThe restrictions do not apply to non-controversial posts under any other flair, so feel free to post and comment on everything else the bay has to offer.\n\n\n\nNew rule changes, flairs and updated styling\n\nHello everyone! We've given the sub a bit of a makeover, here's a summary of the changes.\n\n### New Rules:\n\nWe've rewritten the whole rules list. For the most part this won't result in any enforcement changes, but will hopefully make our rules more clear, give people more detailed report reasons to use and let us moderators give more clear feedback when removing comments and posts. Here are the new rules\n\n1. No poor or hostile behavior\n * No personal attacks or hostile language against your fellow redditors. Hostile language against public figures and organizations is allowed as long as it's not overly egregious.\n2. No racism or other hate speech\n * Do not directly or indirectly suggest someone has done something because of their race. Pointing out other people's racism is allowed as long as it doesn't cross the line of being a personal attack.\n3. No advocating violence\n * Don't suggest or glorify that people should be killed, maimed or shot, either by vigilantes or the legal system. Recommending people legally arm themselves is fine as long as it's not accompanied by any suggestion of wanting to use the weapon against someone.\n4. No duplicate posts\n * If a topic has been posted in the last few days, only posts with substantial new information are allowed.\n5. No advertising\n * Advertising anything that you or anyone associated with you makes money off of is not allowed. Giveaways, fundraisers and bayclub membership posts are not allowed. Pet adoption posts are allowed. Recommending free events or groups is fine. Send us a modmail if you are unsure whether this applies to your case or to ask for an exception.\n6. No unverified or mislabeled crime posts\n * All posts about crime need a news article from a reputable organization or a statement from a state official or police force. They also must be correctly flaired.\n7. No unverified contact information in missing person posts\n * Posts about missing people can only recommend contacting a police department. They can contain the publicly available phone number for the police department, but not any other numbers. Lost pet posts are fine and don't have this restriction.\n8. Posts must be about the bay area\n * Topics that are relevant to the bay but aren't directly in the bay are allowed, such as news about a wildfire blowing smoke through, or people getting trapped on the road to Tahoe. But there must be some relation to the bay area.\n\n### New Flairs:\n\nWe have updated the list of post flairs and also turned on the setting to require post flairs on submission. This will hopefully make the subreddit a bit easier to browser, while also cleaning up enforcement of our enhanced moderation on politics and crime posts. Here are the new flairs\n\n* Politics & Local Crime\n* Events, Activities & Sports\n* Work & Housing\n* Traffic, Trains & Transit\n* Food, Shopping & Services\n* Fluff & Memes\n* Scenes from the Bay\n* Earthquakes, Weather & Disasters\n\nWe're open to adding a couple more flairs if these prove insufficient.\n\n### New Style:\n\nWe've updated the banner image, subreddit icon and style colors as well as a lot of other minor detail settings.\n\nBig thanks to u/MistaKimsta who [took the picture used in the banner](https://www.reddit.com/r/bayarea/comments/ghf8i5/rolling_hills_of_east_bay/).\n\n### Updated enhanced moderation:\n\nWe set up the enhanced moderation bot a couple years ago and it's proved an invaluable tool for allowing discussion about controversial topics between people who actually use the subreddit, while excluding those who just come here to brigade the sub. There were two notable issues we're addressing with today's changes.\n\nFirst was people not adding the politics or crime flairs to the post, which meant enhanced moderation wasn't turned on till hours later when a mod came around and changed the flair. This should be resolved by requiring flair on all posts now, and automatically banning people who intentionally chose the wrong flair.\n\nSecond was a small subset of people making the majority of the political/crime posts. This will be resolved by restricting such posts to one per week per user.\n\n[You can read more about the details of the enhanced moderation changes here](https://www.reddit.com/r/bayarea/comments/195xvo5/restrictions_that_apply_to_political_and_crime/).\n\n### Open to feedback:\n\nIt's been a long time since there were any substantial rule or style changes to the sub, so we're very open to feedback about all these changes. And especially the sub icon, banner image and the list of post flairs.\n\nWe hope this makes the subreddit better for everyone!",
        "num_comments": 119,
        "comments": [
            "Do we still get 77 posts whenever there's an earthquake?",
            "[deleted]",
            "can someone explain why the new sub icon are hills? i get its supposed to be like the banner but do people think of green hills when they think of the bay? seems kind of out of place",
            "This is great, big fan of this decision.",
            "Hoping this will help to stem the wave of racism, fear mongering, and calls for violence that have unfortunately been plaguing our community subreddit for some time now 👍🏻🤞🏻",
            "Hope this stops those awful 'I'm gonna make a twitter post then repost it here so I can make whatever headline I want' threads.",
            "No poor or hostile behaviors \n\n-no personal attacks \n\n\nCan mod give a range as to what is acceptable and when is it acceptable to use certain pejorative.\n\nFor example\n\n>vaccine causes autism, it’s a fact\n\nThat statement is not a fact b/c there has no scientific evidence whatsoever that vaccines causes autism.  As such would it be alright to call said person out including pejorative such as stupid or idiot.\n\n>X groups of people deserve Y negative treatment b/c they are X\n\nA blanket and stereotype statement such as above is obviously wrong b/c there is no way an entire group of people in the hundreds of thousands or more all behaves and believes the same.  So would pejoratives such as bigots be acceptable \n\n>Bay Area shouldn’t change for X b/c it would change Y perception for me therefore it’s bad change\n\nPost like this typically are brought up by NIMBYS when talking about changes to housing to make Bay Area more accessible and affordable.  Would calling these people out being selfish and entitled count as personal or poor behavior\n\n>Stating that X dog breeds are very safe and well behaved animals while getting super defensive when confronted even though statistical founding on dog attack states differently\n\nIn that scenario would it be alright to call out personal attacks such as being ignorant and stupid for purposefully ignoring reality while spreading a misinformation.\n\n>spreading of misinformation and refuse to acknowledge counter point or verified information \n\nWould calling out personal attacks in this scenario be allowed and to what degree?\n\n\n\nNot trying to start a fight with anyone, but some people are wrong in their view or beliefs due to ignorance, lack of knowledge or personal gain.  So would calling these people personally out be poor behavior\n\n\n[Very crude but relevant quote why some people should be called out.](https://youtu.be/E7Sr-cpFwUc?si=vwjhVUOiZGbOYXz-)\n\n\n\nAs for icon change of the sub, it’s so generic I had no idea it was the Bay Area sub.\n\nWhy not just a picture of the Bay Area map as icon picture?\n\n[This one](https://149725886.v2.pressablecdn.com/wp-content/uploads/map_04-20-21_300dpi_27.22x18.13_inv2318c-scaled.jpg)\n\n[This topography looking one](https://i.pinimg.com/originals/22/c2/5f/22c25f1ca3d529d2dbe80fc8d2eb8c73.jpg)\n\nBridge Icon would make sense too since we have several bridges connecting each bay side",
            "I heartily endorse these changes.\n\nI liked the older image fine! If we're going with this, I propose that the green hills image only get used til the end of the wet season, to then be replaced by a ~~brown~~ \"golden\" hills image. 😎",
            "I like this.  Way too many people who have never even been to the area commenting.",
            "100% support these updates.\n\nI really hope it cuts down on outsiders (people that don't or have never lived in CA or the Bay) screwing with discussions - twisting, spinning, or redirecting topics.\n\nI also hope it curbs the volatility of honest discussions.\n\nI hope sub users ask more questions to learn instead of trying to stomp on each other for some sort of dopamine fix."
        ]
    },
    "You all are great drivers!": {
        "title": "You all are great drivers!",
        "score": 313,
        "url": "https://www.reddit.com/r/bayarea/comments/1d28xr5/you_all_are_great_drivers/",
        "content": "I came out for the first time in my life from Denver, CO. Our politics and crime are similar but Denver highways are mad max and lawless.\n\nI am throughly impressed you don’t camp the left lanes and follow the speed limit. \n\nAlso I have family in Southern California and have always heard NorCal and socal were so different but I’m pleasantly surprised a lot of the same elements exist in both. \n\nGreat time here. Far superior to my cold home. Can’t wait to visit again!",
        "num_comments": 236,
        "comments": [
            "I feel this is sincere and directed to me and me only. So I thank you",
            "This feels like a trap",
            "I'm not sure if this is sincere or very dry sarcasm. Either way, prepare for a lot of comments disagreeing with you.",
            "Your opinion will be changed when you drive through the east bay oakland, antioch or pittburgh lol",
            "ahemm *east bay 880 has entered the chat*",
            "Grew up in the East bay. Moved to Denver when I was 27. Moved back here recently at 33. \n\nYes, OP, yes. People in Denver can’t make up their fucking mind. I’m going 75 in the left lane and I see you bearing down on me, closing the gap. Cool, I’ll merge right and let you pass. Oh, you merged right too, ok, maybe your exit is coming up I guess. I’ll wait til it’s safe to get back in the left lane then. Other cars are passing left now. Aaand you’re now weaving around, passing on the right. Holy shit, watch out for that car merging onto the highway, damn that was close, car behind you almost rear ended you since you had to slam on the brakes. I’ll just signal to get back in the left lane once it’s…well I’m going to wait while that jeep swerves across 4 lanes to the off-ramp, why didn’t you start getting over like a mile ago? K cool, now I’m in the left lane, looks like there’s some traffic, huh no we’re just all going like 60 now because there’s a Prius with it’s lights off 3 cars ahead going that slow. It’s 9pm and raining, turn your lights on. And speed up or merge right! Everyone to our right is going faster than us! Shit I’ll merge to the right so I can pass GODDAMN WERE YOU IN MY BLINDSPOT THIS WHOLE TIME?? How did I not see your huge lifted truck with your “blue lives matter” flag? I’d honk but you’re probably buzzed and packing heat. \n\nMeanwhile, here in the Bay, people are driving fast, but there’s some order. The left lanes are faster, if you wanna drive the speed limit you generally are in the 2 right lanes. There will always be maniacs who weave on the highway, but here they tend to stay in the left 2 lanes, or maybe even signal when they’re about to pass you! ",
            "Neighbors, we have to bronze this post and permanently sticky it to the top.",
            "This is literally the first time I’ve  heard “people in X area are good drivers”\n\nIt’s usually the same “X has the worst drivers” with no one realizing every place says that and people just are bad drivers.",
            "I’ve driven all over the country and lived in a few different spots, I agree NorCal drivers are my favorites. I love that the flow of traffic on the highways is 75-80 when not in traffic, and the Bay Area is BY FAR the best about left lane camping. Sure it happens here, but far less than most of the rest of the country.\n\nDrivers are generally assertive here, but at least consistently so. I can anticipate that all the other drivers will be assertive/aggressive and drive accordingly. \n\nBaltimore is a shit show. CO between Denver and Colorado Springs is Mad Max mayhem. Washington state is passive, oblivious, and takes special pride in driving side by side across all lanes of the freeway going exactly the same speed. Most of the Midwest can’t merge for shit, camps in the left lane, and takes personal offense to being passed. NJ/NY are…well their own hellscape. Florida is a terrible combo of octogenarians unable to participate in the society around them and nut jobs unwilling to do so.",
            "Coming from Seattle I love that Bay Area drivers move with purpose and are very decisive. That said, they are definitely meaner and you gotta be extra awake to look out for that G37 doing 120 on 680 weaving through traffic"
        ]
    },
    "Is anyone else affected by the Bay Area being full of overachievers? ": {
        "title": "Is anyone else affected by the Bay Area being full of overachievers? ",
        "score": 1229,
        "url": "https://www.reddit.com/r/bayarea/comments/1dliuyz/is_anyone_else_affected_by_the_bay_area_being/",
        "content": "I live in a fairly affluent neighborhood in the bay and it seems everyone is obsessed with where you work around here. Everyone around me has worked on cancer research or founded two startups by the time they were 15. I moved here from the Midwest where stuff was much less competitive, you were surrounded by more normal seeming people however most people I meet here make 7 figures and do 10 sports in their free time. I usually don’t attach my self worth to my employment but living in the bay it has been a constant topic of conversation and I am sick of it especially since I was laid off.  This is more of a rant if other people also feel this way who aren’t in big tech, medicine or law or something. Rant aside I think it’s great people are doing good for themselves but I wonder where the more normal people are at? \n",
        "num_comments": 577,
        "comments": [
            "You live in an affluent neighborhood & you ask where the normal people are? The normal people are at the less affluent neighborhood.",
            "How do you afford the affluent neighborhood? and why on earth do you think “normal” people would be able to afford these million dollar homes?\n\nEDIT—Lol you’re a *software engineer* in the Bay Area…\n\nEDIT 2– Lol you’re a software engineer who bought their house because you got a fat payout from a startup 🦄… \n\nYou are not one of those “normal” people 🤦🏽‍♀️",
            "Wife is a child therapist. All i can say is… these poor kids.",
            "it's absolutely not just you, in some parts of the south bay and peninsula the pressure is immense and it shows in the mental health of the inhabitants. the north bay, much of the east bay, and even a lot of the city are much more laid back comparatively.",
            "Nah it's pretty much rat race central out here but sounds like you should hang with different people or in different environments. Do activities that have nothing to do with tech and chill with the people who don't ask where you work within the first 30 minutes. When I meet people I always make a conscious effort not to ask them about their work until I've gotten to know them a little bit.",
            "Tell me you live in Palo Alto without telling me you live in Palo Alto.",
            "Get off social media bud",
            "The Bay Area is pretty elite, and due to the cost of living, it means either you earned it or got lucky that you have roots here. Most folks I work with are new to the Bay Area and mention how they came from different countries or states to be here. I felt like that competitive attitude is transferred to everything, the constant asking where do you work, do you own your home, where are your kids going to college. \n\nPersonally, I try to steer the conservation away from the typical small talk and to hobbies or other interests; no one wants to hear the constant humblebrag how you just had to buy a Tesla X since it made financial sense if you think about it.",
            "It’s weird. I had friends in the Midwest for years and neither one of us knew what the other did for work. In the Bay Area that seems to be all anyone wants to talk about lol",
            "I just wanna say I live in the East Bay and I don’t feel like it’s the same as what you are experiencing. Of course there are over achievers and more people make more money in this area but there’s A LOT of normal people too. Lmk if you wanna be friends!! :)"
        ]
    },
    "CA consumer protection committee APPROVES Restaurant junk fee exemption SB 1524 ": {
        "title": "CA consumer protection committee APPROVES Restaurant junk fee exemption SB 1524 ",
        "score": 755,
        "url": "https://v.redd.it/r3ffhnu21z7d1",
        "content": "",
        "num_comments": 278,
        "comments": [
            "California Public Utilities Commission: Votes in favor of Utility companies and against all interest of utility consumers.\n\n  \nCA Consumer protection commutée: Votes in favor of business and directly against the interests of consumers.\n\nWho watches the watchmen?",
            "The vote was unanimous. If your representative is a member of this committee, send them a note asking why they voted in favor of this anti-consumer bs.\n\nCheck here: https://apcp.assembly.ca.gov/system/files/2024-06/6.18-rollcall-results.pdf\n\n Maybe also ask them to get off their phones and actually pay attention to the matters in front of them. Ridiculous.",
            "people need to boycott the restaurants that have junk fees and these politicians need to be voted out",
            "This is goddamned infuriating.",
            "Avoid the restaurants that charge them! They are thieves",
            "Wasn't this bill meant primarily for restaurants? Who else is charging hidden service fees?\n\n[https://sd03.senate.ca.gov/news/20240606-sen-dodd-introduces-restaurant-fees-bill](https://sd03.senate.ca.gov/news/20240606-sen-dodd-introduces-restaurant-fees-bill)",
            "Let’s get this on a prop, CA legislatures are useless.",
            "Literally what do we pay these people for?",
            "These fuckers need consequences. Openly corrupt leeches.",
            "This should be the end of tipping."
        ]
    },
    "Man Who Attacked Nancy Pelosi's Husband Also Found Guilty Of Kidnapping, Faces Life In Prison": {
        "title": "Man Who Attacked Nancy Pelosi's Husband Also Found Guilty Of Kidnapping, Faces Life In Prison",
        "score": 94,
        "url": "https://www.huffpost.com/entry/man-attacked-paul-pelosi-guilty-kidnapping-life-prison_n_667646abe4b0d9bcf74e9b80",
        "content": "",
        "num_comments": 14,
        "comments": [
            "The flair of this posts indicates it's a controversial topic. Enhanced moderation has been turned on for this thread. Comments from users without a history of commenting in r/bayarea will be automatically removed. You can read more about this policy [here](https://www.reddit.com/r/bayarea/comments/195xvo5/restrictions_that_apply_to_political_and_crime/).",
            "Justice is alive and well in SF as long as you’re a Pelosi. Unlike the beater of elderly in Chinatown, this guy gets a lifer.",
            "Groan… Justice only of the Oligarchs.",
            "oh so they get justice but not your common SF folks, gotcha",
            "I think Depape belongs in a secure psych ward. He doesn’t sound like he’s got it all together upstairs. ",
            "It's nice when feds prosecute crimes against you. Not so nice if it's your local \"justice reformist\" DA.",
            "He should be sent back to Canada and let them decide.",
            "Did they catch the beater?",
            "Don't you know, they're better than you.",
            "https://www.nbcnews.com/news/asian-america/san-francisco-man-charged-assault-asian-american-woman-hate-crime-char-rcna96287\n\nHate crime charge dropped \n\nhttps://progressive.today/stories/2022/01/justice-has-not-been-served-asian-elder-attacked-in-hate-crime-sues-san-francisco-da/\n\nPlea down to misdemeanor by Chesa\n\nhttps://sfdistrictattorney.org/press-release/woman-charged-in-connection-to-attack-on-elderly-monolingual-cantonese-speaking-woman/\n\nNo manslaughter charge when a victim has died"
        ]
    }
}