{
    "Sprouting Makeovers in BeamNG.drive v0.32": {
        "title": "Sprouting Makeovers in BeamNG.drive v0.32",
        "score": 214,
        "url": "https://www.beamng.com/game/news/blog/beamng-drive-v0-32/",
        "content": "",
        "num_comments": 64,
        "comments": [
            "> The length and diameter of the logs are adjustable, and will affect the logs’ weight, as will the type of wood the logs are made of - there are eight wood types available, each with its own density which will affect the weight of the log. All the logs can float on water.\n\nWood lovers eating good with this update.",
            "New update but home internet is down . Great timing. Can't wait to play ",
            "While the main updates may seem not a lot (for some people, not me), the full change log shows a different story. Holy shirt devs, you need to calm down! It's amazing the amount of stuff you did behind the scenes! \n\nAlso that joke in the changelog about hoping for more *literally unplayable™* typos was hilarious!",
            "I… I’m I’ve accomplished my life goal. I no longer serve a purpose…",
            "RIP 200bx... we love u",
            "Ah, always when I'm at school. Can't wait to get home and play this!",
            "Loving the update!  I’m sort of new to Beam, am I good to re-enable my repo mods?  If not, how long typically until they start working again?",
            "\"we’ve also fixed a literally unplayable typo in a skin name for the Autobello Stambecco\"\n\nI luv u beam devs",
            "The crash cam is really awesome",
            "Am I the only one that misses the Sunburst Drift Missile?"
        ]
    },
    "got drunk last night, this is what i found on my desktop in the morning": {
        "title": "got drunk last night, this is what i found on my desktop in the morning",
        "score": 94,
        "url": "https://www.reddit.com/r/BeamNG/comments/1dr896c/got_drunk_last_night_this_is_what_i_found_on_my/",
        "content": "https://preview.redd.it/2cy7zj49nh9d1.png?width=1022&format=png&auto=webp&s=748c2f24eae0cb1805bb7584d30158c6f4778805\n\n",
        "num_comments": 23,
        "comments": [
            "How the actual hell did you manage to make this when you're drunk???",
            "Would be better if it had the hood opened.",
            "I love DUI in Beam. Am I weird for doing that? Like does anybody else just get drunk or high, go on beam or a truck simulator and starts driving?",
            "What a waste of alcohol bro",
            "Bro been watching YT Shorts Brainrot lately",
            "I’ve just remembered James May saying that his friend got a notification from uber: “Jesus will arrive in a Honda Accord”",
            "You know what pessima means right?",
            "Atleast everyone still likes you 😢, I'm just a mesley etk 800, why does everyone hate meh. 😞",
            "i also do that tho i cant afford beam so i just do it irl",
            "I mostly do rally shit in beamng, and any time I'm fucked up and I play it I'll be like \"omfg this is going to be the best time I've ever gotten on this stage\" and then its like 30 seconds from #1 hahaha"
        ]
    },
    "The greatest virtual racetrack": {
        "title": "The greatest virtual racetrack",
        "score": 294,
        "url": "https://v.redd.it/iwmnl23iqe9d1",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Oh, this. This is beautiful.\n\nSeriously good job. I'm still half convinced this is official.",
            "This should be an official ad for the game. \n\nNo destruction show off, but what some people appreciate about the game more than the physics.",
            "You should see if video game studios would hire you to make trailers, this is genuinly really good",
            "U a cinematographer by any chance?",
            "Forza Motorsport 4 was one of the best racing games ever",
            "I really do think that BMW's slogan, \"Shear Driving Pleasure\" could apply to BeamNG really well.",
            "Is that AI Jeremy Clarkson?",
            "i should get back into doing stuff like this",
            "Downloading it to my collection\nSeeing Clarkson looking older with every appearance makes me really sad. Him, Hammond and May made a great part of my childhood.",
            "That is actually so fire omg"
        ]
    },
    "Baby Driver Opening Scene recreated in BeamNG": {
        "title": "Baby Driver Opening Scene recreated in BeamNG",
        "score": 1807,
        "url": "https://v.redd.it/i2j971hnnb9d1",
        "content": "",
        "num_comments": 100,
        "comments": [
            "How long did this take, it’s amazing",
            "This is actually amazing. Best thing I’ve seen on Reddit today",
            "This has to be one of the best posts ive seen on the BeamNG subreddit, this is awesome dude! Great work!\n\n(love that movie)",
            "Love how accurate the drifts are!",
            "Wow, what a masterpiece. How did you get the dummies animated?",
            "The amount of work put into this is insane",
            "I smell Top post of all time",
            "Incredible work - I love the quirky differences, like the pedals just moving on their own. And of course the end where the passengers just teleport is perfect.",
            "This is hands down the best thing I’ve seen made with Beam holy shit bravo 👏🏾",
            "This so hell accurate that Baby is Stig"
        ]
    },
    "Name your favorite vanilla car,": {
        "title": "Name your favorite vanilla car,",
        "score": 18,
        "url": "https://i.redd.it/raj7q8150j9d1.jpeg",
        "content": "Bottom text",
        "num_comments": 82,
        "comments": [
            "Spearleaf refinery T-series tanker 🗣️🔥🔥🔥",
            "ETK I series (default rally config)",
            "The h series b with a billion million horsepower and then slide all over the place with it",
            "I'm quite partial to the H45 Vanster because of how good it is for career cargo delivery.\n\nOtherwise, I generally like the Cherrier FCV platform.",
            "I really like the Hopper, personally.",
            "d series custom drift config",
            "Piccolina Street built (the red config)",
            "Bullnose D-series 4wd manual with the 4.1 swapped in place of the v8, lower gearing and locking differentials and solid front axle.",
            "I like the rally covets or just covets in general",
            "Sunburst (i have my own cruiser/top speed configs i use)"
        ]
    }
}