{
    "Sprouting Makeovers in BeamNG.drive v0.32": {
        "title": "Sprouting Makeovers in BeamNG.drive v0.32",
        "score": 211,
        "url": "https://www.beamng.com/game/news/blog/beamng-drive-v0-32/",
        "content": "",
        "num_comments": 64,
        "comments": [
            "to the beam devs,  \n\nTHANK YOU 1000000 times over for all you do!\n\n  \ni love your game beam ng drive!\n\n  \nive been playing since 2015,  and i really love your game!",
            "> The length and diameter of the logs are adjustable, and will affect the logs’ weight, as will the type of wood the logs are made of - there are eight wood types available, each with its own density which will affect the weight of the log. All the logs can float on water.\n\nWood lovers eating good with this update.",
            "My 73 200bx configs:",
            "New update but home internet is down . Great timing. Can't wait to play ",
            "While the main updates may seem not a lot (for some people, not me), the full change log shows a different story. Holy shirt devs, you need to calm down! It's amazing the amount of stuff you did behind the scenes! \n\nAlso that joke in the changelog about hoping for more *literally unplayable™* typos was hilarious!",
            "I… I’m I’ve accomplished my life goal. I no longer serve a purpose…",
            "![gif](giphy|3aGZA6WLI9Jde|downsized)",
            "RIP 200bx... we love u",
            "Ah, always when I'm at school. Can't wait to get home and play this!",
            "https://preview.redd.it/2nwguigonuuc1.png?width=1920&format=png&auto=webp&s=7a03d1a7dad832c586838e6e506c27132ab1f6ed\n\nI love this update but my T-Series has no texture does somebody know how to fix this?"
        ]
    },
    "Baby Driver Opening Scene recreated in BeamNG": {
        "title": "Baby Driver Opening Scene recreated in BeamNG",
        "score": 1542,
        "url": "https://v.redd.it/i2j971hnnb9d1",
        "content": "",
        "num_comments": 92,
        "comments": [
            "How long did this take, it’s amazing",
            "Here is the [comparison](https://www.reddit.com/user/lanceeeepants/comments/1dqkz9c/baby_driver_opening_scene_in_beamng_comparison/) with the original scene",
            "This is actually amazing. Best thing I’ve seen on Reddit today",
            "This has to be one of the best posts ive seen on the BeamNG subreddit, this is awesome dude! Great work!\n\n(love that movie)",
            "Love how accurate the drifts are!",
            "Wow, what a masterpiece. How did you get the dummies animated?",
            "The amount of work put into this is insane",
            "this goes unimaginably hard",
            "https://preview.redd.it/l4sttyvngc9d1.png?width=500&format=png&auto=webp&s=c016fb91fefb534248343208202c371a58087978",
            "I smell Top post of all time"
        ]
    },
    "The greatest virtual racetrack": {
        "title": "The greatest virtual racetrack",
        "score": 100,
        "url": "https://v.redd.it/iwmnl23iqe9d1",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Oh, this. This is beautiful.\n\nSeriously good job. I'm still half convinced this is official.",
            "This should be an official ad for the game. \n\nNo destruction show off, but what some people appreciate about the game more than the physics.",
            "Well done man!",
            "U a cinematographer by any chance?",
            "You should see if video game studios would hire you to make trailers, this is genuinly really good",
            "Incredible driving btw",
            "It sounds like Jezza recorded that audio himself...\n\n\nWell done op, I love it! Shows off the game perfectly well, without all the destruction.",
            "Forza Motorsport 4 was one of the best racing games ever",
            "That is actually so fire omg",
            "i should get back into doing stuff like this"
        ]
    },
    "170 MPH Donuts! Not stopping til the wheels fall off Haha!": {
        "title": "170 MPH Donuts! Not stopping til the wheels fall off Haha!",
        "score": 26,
        "url": "https://v.redd.it/iwpun7ij1g9d1",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Why is this so funny to me haha 🤣",
            "you spin me right round baby like a record",
            "![gif](giphy|Uod1ANyTO3uGQ)",
            "Try that with a tire temp/durability mod lol",
            "You gotta try the Vertex fidget spinner variant",
            "I love how it actually stretches the chassis from the G forces"
        ]
    },
    "Yes, you all are wrong.": {
        "title": "Yes, you all are wrong.",
        "score": 10,
        "url": "https://i.redd.it/kd5cmlnsgg9d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "It’s a very mediocre vehicle without any good use cases. It’s slow and does nothing right. Sure it \\*works\\* but it doesn’t work well.",
            "Last time I used it was to tow it using random ass vehicles",
            "It can't drive through tall grass, like an amphibious vehicle will encounter along the coastline.",
            "It's a very niche vehicle, and there aren't too many cases where it makes that much sense",
            "The car is from my country so that’s why it’s bad",
            "Nah, it doesn't have to be really fast, and I find it really good in more muddy terrains since it's an amphibious vehicle, unfortunately BeamNG doesn't have really much muddy terrains, so I feel like it came out to the game too early tho. Since I learned that before taking a turn you need to speed up a bit I didn't had any problems with the clutch at all, okay, custom version still has some little problems with the clutch, but it was probably tuned by some bad mechanic, and even the base version is enough for me so I don't use custom one."
        ]
    }
}