{
    "\"Glow Up\" posts are not allowed in this subreddit": {
        "title": "\"Glow Up\" posts are not allowed in this subreddit",
        "score": 410,
        "url": "https://www.reddit.com/r/beauty/comments/1agn6mr/glow_up_posts_are_not_allowed_in_this_subreddit/",
        "content": "Hey, all, we are getting a lot of complaints about this issue, which is persisting even though it's already in the rules that this topic is not allowed (Rule 10) and we have consistently been removing these posts when they are reported to us.  \n\n\nTo the folks who have been ignoring the rules: Please stop cluttering up the sub with \"glow up\"-related  requests! We *will* issue permanent bans for offenders, so consider this your official warning because \"why didn't you warn me?\" will not work as an excuse.   \n\n\nFor those of you who DO follow the rules (thank you for that ❤️ ), please continue to report these posts so we can remove them. ",
        "num_comments": 62,
        "comments": [
            "Thank god. These “I feel ugly, what do I do?” posts were getting so tiresome. 1) get therapy. 2) actually lurk this sub, read all the beauty advice posted and experiment with different techniques yourself instead of expecting strangers who don’t know what you look like to write you a personalized manual. There ya go.",
            "Thank you! It's been annoying me too, but I just scroll on by most of the time",
            "That's fair, I've been seeing a lot on this sub myself. Maybe to help those looking for tips, you could pin a glow-up mega thread to the sub's page or add a page that has a few links to the most popular glow up discussions on the sub. Maybe have automod automatically pin those to posts or add those to the disclaimers people see while making a post. Maybe that will help cut down on the clutter.",
            "Thank you, it’s such spam- I don’t mind helping or giving advice to people but- I see posts with no context or where to even begin with where they are looking for improvements. Nothing to make the post unique  to discuss.",
            "Can posts about how hard it is to be beautiful also be banned?",
            "I’m annoyed that the term “glow up” has replaced “makeover”, when that’s exactly what it is. I don’t know about anyone else, but my psyche has had the makeover mentality so deeply etched since—I don’t know, probably when I saw the Princess Diaries at the movies when I was six—that I’m constantly looking at parts of myself that if I could just fix right now, everything in my life would get better. God, it’s so fucking exhausting. \n\nThe insidious part of calling it a “glow up” though, is that while these improvements are totally based on appearance, the idea is if you make yourself look better, you’re also growing as a person or like, getting your shit together to be a prettier, more productive cog in the capitalist machine. \n\nIt’s never just, “wear these eyeshadow colors to make your eyes POP” anymore; it’s “get up at five am, take a freezing cold shower to increase your alertness, put on *sponsored workout gear* and workout while listening to *girlboss podcast*, then drink *sponsored laxative tea*, and spend the next two hours meditating on the toilet while listing everything you’re grateful for and your *goals* for the week, then take another shower with *sponsored skin and hair care products*, then put on your 12 step skincare routine, blow out your hair with the *DYSON AIRWRAP* for that 90’s supermodel look, then put on just enough makeup to look like a *clean girl* who gets the promotions at work and does not report sexual harassment, then spritz on the SCENTBIRD perfume of the week and hope no one in the office is allergic to it, and get dressed in sad beige business casual dress available for purchase in the TikTok shop, and DON’T forget your collagen-spiked latte and overnight oats and *sponsored vitamin and mineral supplements*!",
            "thinking mine got mistaken for one and removed? I was asking for advice on doing makeup with freckles/ maybe style ideas? \n\nnot sure if that counts as a glow up post or not but if so i understand!",
            "hOw Do I gLoW uP",
            "Thank you! ",
            "This disease has spread to other forums i read like r/biohackers and r/supplements and it’s so annoying!  The same questions over and over again with absolutely no effort to do some research on their own, or really any awareness of what issue(s) they’re looking to solve.  Unfortunately those subs haven’t banned these type of posts, so daily there’s at least 1-3 clueless posts.  At least the mods in this sub have banned them, good job!"
        ]
    },
    "New mods are here! And rule updates. ": {
        "title": "New mods are here! And rule updates. ",
        "score": 57,
        "url": "https://www.reddit.com/r/beauty/comments/1b07t8p/new_mods_are_here_and_rule_updates/",
        "content": "Just wanted to quickly announce that we have a few new mods that joined our team as /r/beauty reaches 800k! We'll be closing the applications for now but really appreciate all that have reached out. \n\nAs for the rules... They are more or less the same, just cleaned up a bit. The only major difference now is that we no longer allow surveys.\n\n",
        "num_comments": 2,
        "comments": []
    },
    "How to fix genetically sparse eyebrows and dark circles? ": {
        "title": "How to fix genetically sparse eyebrows and dark circles? ",
        "score": 104,
        "url": "https://i.redd.it/p7jgpuusa08d1.jpeg",
        "content": "",
        "num_comments": 85,
        "comments": [
            "Nothing to add here (as I also need the advice) except you’re beautiful and your skin is flawless.",
            "You are a stunning, natural beauty. 🙌",
            "Your dark circles are actually really flattering. Brightening them up would be a disservice to your beauty. Any ashy grey eyebrow pencil paired with a spoolie brush will work fine for your brows.",
            "Minoxidil 5%!! I have really sparse brows and it was the only thing that grew them out so thick",
            "My eye brows look like yours and I dye them using men’s beard dye. It tends to dye the skin ( but honestly looks really natural) so I start really thin and leave it on for 10 minutes, and go over it again if needed. It only last like a week and a half/two weeks at so if I fuck up it’s not the end of the world. Best of luck!",
            "Off topic but: you‘re so pretty!",
            "Idk about the brows but for the dark circles maybe try a brightening eye cream? Specifically one with vit c",
            "Don’t remove your dark circles, they add to your look.",
            "unpopular opinion, dark circles are hot",
            "for dark circles a test to see if your skin is discoloured of you have thin under eye skin is to lightly pinch the skin under your eye and if the darkness disappears you have thin under eyes but it if doesn't that means your skin is discoloured\n\n\ntips to fixing:\n\nthin under eyes:\ntry skin care products that contain collagen to help build up the thinkness\n\nunder eye discolouration:\ntry vitamin c products and ones that will help with brightening"
        ]
    },
    "Wife is feeling like she’s getting old": {
        "title": "Wife is feeling like she’s getting old",
        "score": 532,
        "url": "https://www.reddit.com/r/beauty/comments/1dl4h2g/wife_is_feeling_like_shes_getting_old/",
        "content": "Lately my (44m) wife (40f) has been struggling with the physical aspects of getting older, in particular feeling like she is “looking old” in pictures, in the mirror, etc. I try to build up her confidence and let her know that I think she’s still hot (she is!) but I sense it’s becoming more pervasive in her thinking. \n\nThe thing is, we are all getting older, and we don’t look the same as we did when we were 24. Although it’s natural, I feel like it’s doing a number in her confidence. I try to give her compliments often to try to build her up, in particular when she’s undressed, and during sex, to give her that kind of reassurance. But I feel like she thinks I’m doing it out of obligation. \n\nOne thing I’ve started doing is taking photos of her when I think she’s looking particularly sexy, and sending them to her, as “proof.” This has helped a little! But overall I want to help her feel better about all of this, since we will obviously be aging for the rest of our lives.\n\nAny advice would be helpful. \n",
        "num_comments": 160,
        "comments": [
            "Youre such a good hubby! She’s so lucky to have you. \n\nThe photo proof thing is great.",
            "It's nice you want to help her. I'm in my 40s and here are my thoughts.\n\nI don't mean to sound critical but when women are terrified of aging it's because of their own internalized ageism. She thinks only young women are beautiful. This means she doesn't notice the beauty in older women at all. She thinks they look worse than younger women so of course this extends to herself. She has to confront her own prejudice in order to eliminate the self hatred. I'm not sure how a husband can bring this up delicately, lol, it's like tightrope walk. But that's why your reassurance is only going so far and why she doesn't believe you when you reassure her. SHE doesn't think women in their 40s or 50s are beautiful. She has drunk the marketing nonsense and believes it.\n\nI surround myself with fashion inspiration of women older than me. Advanced Style is excellent. There are also several youtube channels that feature street fashion in major cities like Milan, Tokyo, etc. and they often include people of all ages. I do not look at any content featuring women in their 20s or 30s as it is wholly inapplicable to me. I have no use for it. When I look at an absurdly glamorous 60 year old woman, in beautiful clothes who is laughing with her head thrown back the last thing I think is, \"look at the quality of her skin compared to a 20 year old.\" If you objectify women you see them as parts and not a whole. She's missing the beauty which is found in the whole. She doesn't do this when she looks at you, which is why your aging doesn't bother her.\n\nDoes your wife have any friends who are older than her and who are happy? One of my best friends is 20 years older than me and she is a great example of living the good life. Happiness is positively enticing at any age. Beauty is seeing the whole person. Their laugh, their voice, how they make you feel. Marketing brainwashes women to look at women like parts. How smooth is their skin? How much cellulite? How tight is the jawline? She has to stop seeing other women that way to stop seeing herself that way.",
            "Honestlyyyy i think its something everyone goes through and its a internal battle. I would just keep complimenting her, taking nice photos of her. Complimenting her to other people (infront of her)",
            "there’s this book i read in high school where the character reconnects with the love interest of his youth, once they’re both middle aged.   he describes her as having a more developed beauty, and finds her more attractive than ever.  their romance made me feel a lot better about the idea of growing old and losing my youthful beauty.  i wonder if she would benefit from reading that book, it’s called “brideshead revisited”",
            "This is a tough one, I think you are doing all the right things. Ultimately this is on her to figure out and work on. Do you all spend enough time together? Maybe it’s time to find a new hobby to explore together? As I near 40 I find spending more time in nature appreciating the small things and trying new hobbies takes my mind off of the other stuff like aging 😊🤷🏻‍♀️. I also try to remind myself that the 20 something’s around me will all be aging eventually one day too as I was their age once lol. We all need to find & appreciate who we are at our given age. At 50 & 60 and so on we will also look different so try to enjoy the journey gracefully.",
            "This is really sweet of you, but I’m not sure there’s much you can do to help. You can certainly help her to prioritize things she wants to do to take care of herself, whether that’s fitness or skincare or spa treatments or whatever. If her thoughts are truly becoming distracting to the point where she’s depressed or unable to focus on normal tasks, however, then the best thing you can do is encourage her to get into therapy. She may also want to see her doctor to have her hormone levels checked. Perimenopause can do a number on your emotional state, and plenty of women start feeling its effects in their late 30s and early 40s. \n\nFor perspective, I’m also 40 (with a 46yo husband) and I don’t know anyone who’s extraordinarily preoccupied with “looking old.” Sure, there are some things I miss about looking young, but there are also many ways in which I much prefer being 40 to being 20 or 25. My friends and I have talked many times about how the wisdom, confidence, and feeling of comfort in your own skin that you experience in your 40s are well worth a few wrinkles and grey hairs. I certainly feel better at 40 than I did in my 30s with babies messing up my body and monopolizing every ounce of energy I had. \n\nIt’s perfectly fine if your wife hasn’t found the joy of 40 yet (although I hope she does!) but there’s definitely a line between a preoccupation and a fixation. If you’re concerned, I’d definitely suggest she start by seeing her doctor.",
            "You’re a wonderful husband! \n\nAt 69 years old, I remain grateful that I was never a raving beauty. I am cross-eyed by birth. Have facial scars due to both clumsiness from right-eye blindness and skin cancer scars. Yet, I remain relatively happy with my\nLooks because all that  makes me.\n\nKeep telling her that she’s always going to be beautiful but in a different and mature way. Explain to her aging is a privilege.",
            "When I started perimenopause, started to _feel_ old. Yes, the loss in estrogen caused some jaw sagging, but there was also an overwhelming feeling of being an empty old husk whose life was essentially over. It was hormonal.\n\nHRT has helped _a lot_. I feel much more like myself and that overwhelming feeling is gone",
            "I haven’t read many other comments, but IMO, if I was overwhelmingly feeling like I looked old and my hubby recommended working out or taking supplements, I’d probably be offended. I can’t explain it myself, but I’d feel that’s what it would trigger. Maybe because it would make me feel even older? \n\nHave you thought about couples therapy? Getting older is a huge transition, especially when she begins menopause and stuff. There also may be deeper issues that is rearing its head in the form of self consciousness about her looks with age. I think therapy would be wonderful for her to give a try, and you alongside her sometimes so that it can be a safe space for her to fully express and vent her emotions and thoughts. And for you to, as well. \n\nI hope everything works out! Unfortunately your efforts are seeming to fall on ears deafened with overwhelming insecurity. I applaud you for that, it’s just that it takes a heellllll of a lot of effort to find what is going to get through to someone struggling with themselves. I wish you both all the best, and you’re a good hubby",
            "I love this!! A few other options: \n\n\\* Give her flowers weekly \"just because\" \n\n\\* Call her beautiful and specifically say what you like about her in the moment. Love that you're doing that in front of other people too \n\n\\* (hear me out) Comment on how young people in media seem... young. Nothing wrong with them of course, but from experience, hearing how your husband views young people is huge. Especially combined with your existing comments on how beautiful she is \n\n\\* Notice anything she's been doing to change her appearance and comment on anything you specifically think compliments her \n\n\\* Take her to an art museum and point out how the classics look like her. One big confidence boost I do is look at classical pieces of art and realize that all the beautiful women there have bellies and soft bodies. It's such a change from social media these days and those artists really committed to showing soft bodies as the peak of beauty for all of history to remember"
        ]
    },
    "My experience with eyelash serum and orbital fat loss": {
        "title": "My experience with eyelash serum and orbital fat loss",
        "score": 102,
        "url": "https://www.reddit.com/r/beauty/comments/1dlgpnp/my_experience_with_eyelash_serum_and_orbital_fat/",
        "content": "For years I had been using Revitalash and had the most long, gorgeous eyelashes that I received regular compliments about. I thought I was using an expensive, “healthier” brand and that the thinner skin / purplish pink colour on my under eyes was more to do with aging (I am 29) and genetics (as I’ve also had deep hollows but never this bad). Over the last couple years I noticed my under eyes becoming a lot worse and I become very self conscious about my undereyes so I started really reading into the possible side effects of eyelash serums (as I knew there were possible negative side effects but again I thought I was using the best / healthier brand) and wondered if I was experiencing orbital fat lash from my eyelash serum. \n\nI stopped about one month ago and WOW my under eye skin has improved sooooo much and is slowly becoming plumper / less pink and purple coloured. I also used to have very hooded eyelids but noticed these disappeared (which I didn’t mind) and again I thought this was just due to aging and losing weight in my face but have also realised it was the eyelash serum as they are slowly starting to coming back. I have regained my confidence and feel like I now look a lot more youthful. \n\nI can’t believe I was basically melting the fat around my eyes and aging myself by using eyelash serum and I wish I realised sooner. I will miss my long lashes but for me personally, it is not worth it. I know not everyone experiences this, but if you suspect you are I would recommend taking a break and seeing if you notice a difference.  \n\nHere is a post from TikTok that is very similar to my story https://vt.tiktok.com/ZSY5Cmss2/",
        "num_comments": 38,
        "comments": [
            "Not me wondering if putting lash serum on other body parts will make fat disappear. 😂",
            "Thank you for sharing this important message!\n\nA safer option is products without prostaglandins, ex the Ordinary, but I’ve read the growth effects are not nearly as strong.",
            "I really don’t mean to undermine your discovery but I was under the impression that once the fat is lost, it’s gone forever?",
            "Could this get rid of fat pads u see the eye then?",
            "I use caster oil on my eyelashes every night and while it's nothing mega dramatic, it has helped them grow",
            "question, were you using the lash serum on your lower lashes as well? Ive been hearing a lot about this under eye fat loss and I wonder if you're safe if you only use it on your upper lashes.",
            "Does this happen with Latisse too?",
            "My eyes are going RED from eyelash serum I stopped yesterday now my lashes are a bit longer idgaf",
            "Wow, didn't know this was a possible side effect. Would you be comfortable sharing a before and after?",
            "Can anyone recommend a good, safe eyelash serum? "
        ]
    }
}