{
    "Voting for new Alien of the Month": {
        "title": "Voting for new Alien of the Month",
        "score": 13,
        "url": "https://www.reddit.com/r/Ben10/comments/1dnpdhl/voting_for_new_alien_of_the_month/",
        "content": "Here you can post your suggestions for the upcoming Alien of the Month. If you see someone has already posted your alien, upvote their comment, instead of creating another one. The one with most upvotes will win. Previous winners (preferably try to pick ones that have not won yet): [https://docs.google.com/spreadsheets/d/19StLALwPZpjILDenjfBNPV4Kpf351bD8HT36Mn0RBDg/edit?usp=sharing](https://docs.google.com/spreadsheets/d/19StLALwPZpjILDenjfBNPV4Kpf351bD8HT36Mn0RBDg/edit?usp=sharing)",
        "num_comments": 48,
        "comments": [
            "If we can include 5YL, then I nominate Buck Wild.\n\nIf not, then I nominate Gravattack.",
            "its spelled \"Xurge\" (dont quote me on that I havent watched it in like... since it came out)",
            "No no no no no no no no no no no no no no no no NO! DEEJAY EMCEE!!!!!",
            "Xerge is the species name",
            "What are you talking about",
            "He has\n\nMay 2023: Eatle",
            "How did I miss that when searching the list?",
            "Ester (or well the Kraaho in general)\n\n\nSummer is coming.",
            "\"Well Eatle already won it's not like he could win again.\"\n\n\\*Sees that Eatle has not won yet\\*\n\n\"What is going on?\"",
            "Surge"
        ]
    },
    "Someone give ditto a firearm IMMEDIATELY ": {
        "title": "Someone give ditto a firearm IMMEDIATELY ",
        "score": 331,
        "url": "https://i.redd.it/pyxi6uxwth9d1.jpeg",
        "content": "",
        "num_comments": 20,
        "comments": [
            "Ditto is to powerfull to have a Ultimate, he would make Alien X obsolete",
            "Look on the bright side. Said ultimate predator was forgettable and did nothing that its base form couldn't already do.",
            "the world is not ready for ditto with toon force",
            "What would an ultimate ditto do",
            "Ultimate Ditto is just Gear fifth",
            "As someone who is as ditto crazy as op(or more) I agree",
            "Ultimate Ditto would scare me, all my ideas for it are eldritch horrors",
            "Literally Ditto and his multiple personalities actually agree and somewhat disagree to a that it wouldn't even hinder them for every decision.\n\nBellicus and Serena are literally just two personalities yet they can't even find a middle ground",
            "C'mom Man, ultimate articguana is awesome",
            "Can someone elaborate"
        ]
    },
    "He’s just a lil’ guy (Arctiguana + Juryrigg)": {
        "title": "He’s just a lil’ guy (Arctiguana + Juryrigg)",
        "score": 105,
        "url": "https://i.redd.it/x177k4b42i9d1.jpeg",
        "content": "",
        "num_comments": 20,
        "comments": [
            "So I think this guy has advanced Cyrokinesis, He can not only shoot simple ice but make complex stuff too.. like ice stair, ice mechanisms",
            "I love the design! Never would I have thought that a Juryrigg and Arctiguana fusion could work lol, but you did it!",
            "COLDFIX!\n\nA play on hotfix.",
            "As much as i love the artstyle and details this fusion looks cursed as hell 💀💀 ngl tho its a good combination. free ice tools to use for jury riggs builds",
            "A surprise but a welcome one. Really fun look",
            "fucking brilliant dude, how do yall draw these lmao",
            "Yo I can explain this",
            "Very cool fusion let's call it frixe ( play on fix and freeze). P.s do you mind if i inspired  myself with it designs with my jurry rigg reatake because i really like head design here and also suit look really fiting",
            "Does anyone else think he'd sound like Borat?\n\nI just keep picturing him saying \"very nice\" in the voice.",
            "I guess you can say his builds are cold."
        ]
    },
    "What is a gag that was funny at first but became boring after a while": {
        "title": "What is a gag that was funny at first but became boring after a while",
        "score": 141,
        "url": "https://i.redd.it/1lpo5447ch9d1.png",
        "content": "For me it's Ben getting Grey Matter whenever he wished for a big and strong alien, or another alien that's not necessarily a brute force alien but just better for the current situation, like catching up to car burglars or saving a diver from sharks, instead of giving him XLR8 or Ripjaws the Omnitrix kept giving him Grey Matter when he would be the most disadvantagous form for the situation at hand. While this allows Ben to be more creative and find other ways to solve a problem and adapt more quickly, it becomes annoying after a while when they mostly do it with Grey Matter just because he's small. What about you guys? What is a running gag you laughed the first couple of times but started to be annoyed after a while?",
        "num_comments": 63,
        "comments": [
            "I think it is constant throwing ripjaes on dry land ",
            "And I use the term loosely",
            "Ben and Gwen's constant arguing",
            "Mistransformations seriously is it so hard for the writers to write Ben as using different Aliens willingly.",
            "Albedo not being able to turn into a galvan again",
            "Ben bitch complaining about not getting Humungousaur\n\nI kinda see it when he was limited but as Of UA and OV. He should have enough versatility to choose from",
            "OV Omnitrix Getting The Transformations Wrong 70% Of The Time\n\nIk It's Because Ben Smashes It But He Didn't Understand That Either",
            "Mistranformations I can let it slide in Classic and UA but in OV I want to believe it’s a case of Ben getting what he needs instead of what he wants but then we have the whole Nematrix thing so I don’t know",
            "Ben and Gwen’s arguing in OS. Seriously, I feel by the start of S3, they should stop that, especially when Ben sacrificed himself for her multiple times",
            "Kevin's car. They really pushed it into the ground in Omniverse."
        ]
    },
    "School bell": {
        "title": "School bell",
        "score": 53,
        "url": "https://i.redd.it/4icwh8ta6i9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "You know. Sometimes I forget this sub is mostly kids.",
            "That’s what a nerd and a bad boy would say",
            "For real"
        ]
    }
}