{
    "Visiting Berlin? Moving here incl. Apartment questions? Going clubbing? Have a quick question? Ask here, don't create a new thread.": {
        "title": "Visiting Berlin? Moving here incl. Apartment questions? Going clubbing? Have a quick question? Ask here, don't create a new thread.",
        "score": 28,
        "url": "https://www.reddit.com/r/berlin/comments/1cv9cnh/visiting_berlin_moving_here_incl_apartment/",
        "content": "Welcome to r/Berlin, please be respectful of the locals, and particularly their wish to have a subreddit that's more than a tourist information stand. Feel free to ask questions in English or German.\n\n**Travel/Moving to Berlin**\n\nIn order to benefit the huge numbers of people out there interested in Berlin, we've prepared some useful resources that answer common questions.\n\n**Visiting Berlin?**\n\n* [Upcoming event highlights DE/EN](https://www.berlin.de/en/events/)\n* [Visit Berlin](https://visitberlin.de/)\n* Wikivoyage Guide to Berlin - [English](http://en.wikivoyage.org/wiki/Berlin) \\- [Deutsch](http://de.wikivoyage.org/wiki/Berlin)\n* [Lonely Planet guide to Berlin](https://www.lonelyplanet.com/germany/berlin)\n* [How to plan a trip to Berlin](http://allaboutberlin.com/guides/planning-a-trip-to-berlin)\n* [I am now in Berlin for my first time, What should I see?](http://www.reddit.com/r/berlin/comments/gr00c/i_am_now_in_berlin_for_my_first_time_what_should/)\n* [What's your scenic route? Add your own maps!](http://www.reddit.com/r/berlin/comments/o2nwt/whats_your_scenic_route_through_berlin_lets_make/)\n* [Berlin in one day, an einem Tag](http://www.reddit.com/r/berlin/comments/111ku1/guide_berlin_in_one_day_berlin_an_einem_tag/)\n* [Recommended walking tours](http://www.reddit.com/r/berlin/comments/1e8jou/recommended_walking_tours/)\n* [Nerdy places in Berlin](https://www.reddit.com/r/berlin/comments/wsbsit/nerdy_places_in_berlin_v3/)\n* [How can I be the most annoying tourist possible?](https://www.reddit.com/r/berlin/comments/6p31xk/im_an_english_guy_travelling_to_berlin_in_5_days/)\n\n**Answers from the previous sticky threads:**\n\n* [May 2024](https://www.reddit.com/r/berlin/comments/17yw94a/visiting_berlin_moving_here_going_clubbing_have_a/)\n* [November 2023](https://www.reddit.com/r/berlin/comments/13p27vn/visiting_berlin_moving_here_going_clubbing_have_a/)\n* [May 2023](https://www.reddit.com/r/berlin/comments/z3fd24/visiting_berlin_moving_here_going_clubbing_have_a/)\n* [November 2022](https://www.reddit.com/r/berlin/comments/uzi6l7/visiting_berlin_moving_here_going_clubbing_have_a/)\n* [May 2022](https://www.reddit.com/r/berlin/comments/pyqabo/visiting_berlin_moving_here_going_clubbing/)\n* [September 2021](https://www.reddit.com/r/berlin/comments/mj5144/visiting_berlin_in_the_future_moving_here_going/)\n* [April 2021](https://www.reddit.com/r/berlin/comments/jn65of/visiting_berlin_in_the_future_moving_here_going/)\n* [November 2020](https://www.reddit.com/r/berlin/comments/gepwge/visiting_berlin_in_the_future_moving_here_going/)\n* [March 2020](https://www.reddit.com/r/berlin/comments/epylro/visiting_berlin_moving_here_going_clubbing_have_a/)\n* [January 2020](https://www.reddit.com/r/berlin/comments/cfx68h/visiting_berlin_moving_here_going_clubbing_have_a/)\n* [July 2019](https://www.reddit.com/r/berlin/comments/ai9yf9/visiting_berlin_moving_here_going_clubbing_have_a/)\n* [July 2018](https://www.reddit.com/r/berlin/comments/92tud7/tourists_visitors_new_arrivals_people_with_quick/)\n* [January 2018](https://www.reddit.com/r/berlin/comments/7tjzd3/tourists_visitors_new_arrivals_people_with_quick/)\n* [July 2017](https://www.reddit.com/r/berlin/comments/6qr5v3/tourists_visitors_new_arrivals_people_with_quick/)\n* [January 2017](https://www.reddit.com/r/berlin/comments/5r1po4/tourists_visitors_new_arrivals_people_with_quick/)\n* [August 2016](https://www.reddit.com/r/berlin/comments/4vsgao/tourists_visitors_new_arrivals_people_with_quick/)\n* [January 2016](https://www.reddit.com/r/berlin/comments/412m3n/tourists_visitors_new_arrivals_people_with_quick/)\n\n**Moving to Berlin?**\n\n* [Moving to Berlin: the definitive guide](https://allaboutberlin.com/guides/moving-to-berlin)\n* Read the [**massive /r/berlin FAQ**](https://www.reddit.com/r/berlin/wiki/index)\n* Read the even better [**/r/germany FAQ**](https://www.reddit.com/r/germany/wiki/faq)\n\n**Want to make friends?**\n\nVisit our friendlier half [/r/berlinsocialclub](https://www.reddit.com/r/berlinsocialclub/) to meet people\n\n**Clubbing, music, events in Berlin?**\n\n* [Resident Advisor](https://www.residentadvisor.net/) \\- Techno events, lineups, tickets\n* [030Gästeliste](https://www.gaesteliste030.de/) \\- Clubs by genre\n* [Duh Dum!](https://duhdum.com/music-live-berlin/) \\- playlist of upcoming live shows\n* [echtzeit](http://www.echtzeitmusik.de/index.php?page=calendar) \\- live music\n* [Sport Bars](https://www.berlin.de/bars/sky-sports-bar/) \\- to watch sports\n\nEnjoy your time, remember to stamp your ticket before you get on the train!\n\n\n**Do not use URL shorteners!** Comments with shortened URLs get marked as spam automatically, even for Google Maps links.",
        "num_comments": 361,
        "comments": [
            "We are a couple, and We moved to BLN last year, however it almost looks impossible to find a place to stay! Can you give us some names for some agency or Makler, where we we can get In touch please..\nAside from that we are offering a decent amount of reward in cash (1500€ Belohnung) if anyone can help us get our hands on a good  apartment contract.( details in private chat)",
            "any strawberry things in berlin? i’ll be there for 4 days & i absolutely love anything strawberry. strawberry treats, drinks, themed. i’d love some bakery/cafe recommendations even if there is just one item there",
            "[deleted]",
            "Any place to go texas two steppin? I know the germans do their weird country dances. Anyplace thats a real honkey tonk that this texan can put his boots on for?",
            "Hello, I'm an international master's student who just got an acceptance letter from Charité – Universitätsmedizin Berlin. I have to pay my tuition fee before June 30, and I was wondering about the possibilities of Masters students working opportunities, and life expenses for self-funding international students.\n\nPlease provide me with your opinions and your experiences.\n\nThank you",
            "Hey how! Visiting Berlin and thought the Factory party at Slaughterhouse in Moabit this Saturday looked right up my alley. I am alone tho and never was a big going out guy what with me growing up in small cities where anything you did on a nights out became talk of the town and could stain your rep forever. Anyone going I can join, preferably with a group? I speak English, German and Dutch fluently.",
            "Is there somewhere in Berlin that you have huge portions of food with decent quality?",
            "Hallo, I'm visiting Berlin for the next few days with my wife and we're looking for a club or something where we can dance to goth or 80s tunes. We'd love to revisit some old classics from our teens and twenties. Any suggestions? Preferably someplace that wouldn't turn away two Gen Xers in their 50s.",
            "Is there anywhere in the Pankow district I can pick up some big cardboard boxes? We're moving across the city and need some boxes to get us from A to B.",
            "Which ones of the two dozen flea markets are the best? We're visiting for a week, would be nice to put at least one day for flea markets, filtering out the boring ones."
        ]
    },
    "🇩🇪⚽ Megathread: European Championships 🇩🇪⚽": {
        "title": "🇩🇪⚽ Megathread: European Championships 🇩🇪⚽",
        "score": 15,
        "url": "https://www.reddit.com/r/berlin/comments/1dd9fa1/megathread_european_championships/",
        "content": "*English version below*\n\nHey r/Berlin! Die [Fußball-Europameisterschaft fast da und Berlin ist bereit](https://www.berlin.de/kultur-und-tickets/tipps/em-2024/), einige unvergessliche Spiele auszurichten. Diskutiert in diesem Post alles rund um die EURO 2024 in Berlin :\n\n* **Spiel-Diskussionen:** Teilt eure Gedanken zu den Spielen, Vorhersagen und Reaktionen, während sie passieren!\n* **Fan-Erfahrungen:** Trefft ihr euch mit anderen Fans? Besucht ihr Public Viewings? Erzählt uns von der Stimmung!\n* **Berliner Atmosphäre:** Wie feiert die Stadt das Turnier?\n* **Alles andere zur EURO 2024:** Habt ihr eine Frage? Eine coole Geschichte? Hier ist der richtige Ort.\n\n**Berliner Spielplan:**\n\n* Samstag, 15. Juni: Spanien gegen Kroatien\n* Freitag, 21. Juni: Polen gegen Österreich\n* Dienstag, 25. Juni: Niederlande gegen Österreich\n* Samstag, 29. Juni: Achtelfinale (Teams offen)\n* Samstag, 6. Juli: Viertelfinale (Teams offen)\n* Sonntag, 14. Juli: Finale!\n\n**Alle anderen Beiträge zum Thema werden ab sofort gelöscht.**\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nHey r/Berlin! The [European Championships are almost HERE](https://www.berlin.de/en/events/uefa-euro-2024/), and Berlin is ready to host some unforgettable matches. This is the place to discuss everything EURO 2024 in Berlin:\n\n* **Match Discussions:** Share your thoughts on the games, predictions, and reactions as they happen!\n* **Fan Experiences:** Meeting up with other fans? Attending public screenings? Tell us about the atmosphere!\n* **Berlin Atmosphere:** How is the city celebrating the tournament?\n* **Anything else EURO 2024:** Got a question? A cool story? This is the place.\n\n**Berlin Match Schedule:**\n\n* Saturday, June 15th: Spain vs Croatia\n* Friday, June 21st: Poland vs Austria\n* Tuesday, June 25th: Netherlands vs Austria\n* Saturday, June 29th: Round of 16 (Teams TBD)\n* Saturday, July 6th: Quarter-Final (Teams TBD)\n* Sunday, July 14th: Final!\n\n**Any other posts in regard to the event will be deleted from now onwards.**",
        "num_comments": 46,
        "comments": [
            "15. JUNI ist ein Samstag😀",
            "Schlaaaaaaand!",
            "Is there any big viewings, like with big screens in parks or something?",
            "Does anyone know if it's possible that more Berlin tickets will be released, or if there's anyway to acquire them at this point? ",
            "Looking for recommendations for football stores in Berlin, wanna grab a few euros jerseys and boots. What’s the best places to shop around ?",
            "Should the city be avoided on match days / any other days? Should we expect much hooliganism like the recent basketball match?",
            "Fussi Scheissi",
            "Hi. Does anyone have tickets for Spain vs Croatia on the 15th",
            "Where should we watch the game tonight? Preferably in pubs or on the street with big screens. Thanks in advance",
            "Any one been to the 16 Juni fan mile so far? \n\nWhats it like? Worth it? Too busy?"
        ]
    },
    "This car has been left at this spot since at least Monday afternoon; is this normal?": {
        "title": "This car has been left at this spot since at least Monday afternoon; is this normal?",
        "score": 38,
        "url": "https://i.redd.it/08g2kq2hfg9d1.jpeg",
        "content": "This car had what looks like a pretty bad accident at Neues Ufer. Should I contact someone to let them know it’s here? I assumed this would be dealt with quicker, so I’m unsure if it’s the normal process or it simply has not been reported to the right authority yet",
        "num_comments": 26,
        "comments": [
            "There is an explicit Webservice for reporting this, and yes it can't harm to report it even though someone else might have already: https://service.berlin.de/dienstleistung/326455/",
            "He’s just waiting for Termin",
            "r/wasletztepreis",
            "Perfectly normal.",
            "Have you tried telling them: You can't park there, Sir!",
            "I've seen it as well on my way to work. Report it using die Ordnungsamt App, they slow (overworked like hell in this city full of asis) but the more Meldungen they get, the better",
            "Just take it 🤗💀",
            "No, usually the wheels would have been stolen when it's there for this time",
            "Maybe the car is stolen and the thief was causing the accident. Call police,they will take care of it",
            "Seems like an unreported accident. Call police immediately. Gas and oil is leaking and  polluting the environment."
        ]
    },
    "Good store to buy caps": {
        "title": "Good store to buy caps",
        "score": 0,
        "url": "https://www.reddit.com/r/berlin/comments/1dr6hxg/good_store_to_buy_caps/",
        "content": "Hey folks!\nAs the title says I’m looking for good stores where one could buy caps (Baseball, 5 patch, etc)\nI’m aware there is this thing called internet and they sell that too, but I like to try em on first before buying ;)\n\n",
        "num_comments": 1,
        "comments": [
            "The Meta flair is for posts about reddit or the subreddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/berlin) if you have any questions or concerns.*"
        ]
    },
    "Richter in Berlin bestätigt Polizeigewalt": {
        "title": "Richter in Berlin bestätigt Polizeigewalt",
        "score": 62,
        "url": "https://www.nd-aktuell.de/artikel/1182947.johannes-bauer-vor-gericht-richter-in-berlin-bestaetigt-polizeigewalt.html",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Das kenne ich leider genau so vom Ablauf her. Mir haben damals zwei Anwälte empfohlen das nicht anzuzeigen, da das erfahrungsgemäß mehr Probleme nach sich ziehe als die eh schon Vorhandenen. Ich hatte damals sogar ein Gutachten der Gerichtsmedizin und eine internistisch (und durch Radiologen unterstützt) attestierte Gehirnerschütterung.\n\nDas ist ein riesiges Problem, aber man kann nichts gegen die freundlichen Helfer machen.",
            ">Ob die Strafverfolgung gegen die verantwortlichen Polizisten wieder aufgenommen wird, ist ungewiss.\n\nIch hab so eine Ahnung. Mal von der eigentlichen Gewalttat abgesehen macht mich das immer wieder rasend dass Polizisten in diesem Land ungestraft lügen dürfen dass sich die Balken biegen. \n\nLeute, wenn ihr irgendwo einen Polzeieinsatz seht: Handy raus, filmen! Man weiß nie wozu es gut ist.",
            "Ich fände es ja gut, wenn die Gesetzeshüter sich nicht zur Begehung von Straftaten verabreden würden. Aber das ist wahrscheinlich auch schon linksgrün heutzutage.",
            "Komm Leute wie so viel Stille?\n\nWo sind die Leute jetzt, die immer sagt ‘Polizei hat recht’ in heutzutage fortfahrene Demos?",
            "lol, die Dunkeldeutschland-Postille.",
            "bin am Wochenende mit 500 Hanf Stecklingen angehalten worden. Der Polizist: mich interessiert das nicht mehr, vor 3 Monaten hätte\nIch viel Arbeit gehabt. Ich bin FROH über die Berliner Polizei. Ganz neues feeling von nem Menschen aus Bayern, zu unserem Freund und Helfer. 💚🤝",
            "Staatsanwälte nehmen Aussagen von Bullen immer für voll, auch wenn die lügen wie sonstwas. Beamte schützen in erster Linie Beamte.",
            "Mal eine ehrliche Frage zu diesem Thema, weil ich immer von den verschiedenen Antworten verwirrt bin: ist es eine Datenschutzverletzung wenn man sowas filmt? Wo ist die Grenze, die man beachten muss?",
            "Ist das wirklich so? Ich verteufel zwar nicht die Polizei so krass aber natürlich traue ich keinem Polizisten über den Weg. Die Chance, nen schwarzes Schaf zu erwischen ist statistisch vermutlich gering aber ich glaube es ist in der Allgemeinheit bekannt: mit Bullen redet man nicht.",
            "Das dieses SED-Käseblatt noch ernsthaft von Leuten gelesen wird..."
        ]
    }
}