{
    "Looking for a Post? Ask Here! - June 2024 Edition": {
        "title": "Looking for a Post? Ask Here! - June 2024 Edition",
        "score": 271,
        "url": "https://www.reddit.com/r/BestofRedditorUpdates/comments/1d5z9lo/looking_for_a_post_ask_here_june_2024_edition/",
        "content": "**Need help looking for an update?** Comment below!\n\n* View last month's [Looking for a Post - May 2024](https://www.reddit.com/r/BestofRedditorUpdates/comments/1ci2fdw/looking_for_a_post_ask_here_may_2024_edition/) thread. If you posted in previous threads and didn't get an answer, you can repost your question here.\n* We launched a discord.  Please feel free to join.  [Discord link](https://discord.gg/Hx2hym2juy)\n* **Do NOT harass OOPs.  Do NOT comment on original posts.**  You will be banned if you do so.\n* Always read the rules of subs you are participating in.  **Do NOT harass OOPs.**\n* If an update found here has not be posted to BoRU yet and you feel it belongs as its own post, please feel free to submit it.\n* If you found an update that is not eligible for posting yet, leave it on the pinned comment in this thread.\n* If you found an update that is eligible but you don't want to post it yourself, leave it on the pinned comment on this thread.\n\n# DO NOT HARASS OOPs.  Do not comment on posts linked in this thread or on posts linked in BoRUs.  Doing so will result in a permanent ban from this sub and possibly the other sub.  Leave your comments here in BoRU and again, do not harass OOPs.  Please see the [brigading policy](https://www.reddit.com/r/BestofRedditorUpdates/comments/z6fk6u/meta_brigading_please_read_to_avoid_being_banned/)\n\n**Tools to search for a post**\n\nView our [How to search for a post wiki](https://www.reddit.com/r/BestofRedditorUpdates/wiki/search)\n\n**Popular Posts**\n\nA list of the [most frequently requested posts](https://www.reddit.com/r/BestofRedditorUpdates/wiki/faq_lfp) such as the PS5 saga, Peegate, and the Thanksgiving Turkey. **The one about the woman whose FIL and husband thought she would die in childbirth [finally has an update](https://www.reddit.com/r/BestofRedditorUpdates/s/OH56n2oFl2).**  If you're looking for the one where OOP's husband gets violently sick when OOP's sister announces her pregnancy, you can [read it here](https://www.rareddit.com/r/TrueOffMyChest/comments/ze6pf2/my_husband_started_acting_strangely_upon_my/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button).\n\n**Want to know the origin of a flair?**  See this [list of flair origins](https://www.reddit.com/r/BestofRedditorUpdates/wiki/recommended_reading/flair_origins)\n\n**Looking for something to read?**\n\n* r/BestofBoru - a companion sub of curated, concluded updates\n* r/bestofpositiveupdates\n* r/OhNoConsequences by BoRU mod u/mermaidpaint\n* r/BestofRedditorSagas for posts with a large number of parts\n* [Best Updates of 2021](https://www.reddit.com/r/BestofRedditorUpdates/comments/rzxz1z/announcing_borus_1st_annual_best_of_winners/)\n* [List of lists of posts compiled by Czech](https://www.reddit.com/r/BestofRedditorUpdates/comments/17leer6/comment/kanqq5b/?utm_source=share&utm_medium=web2x&context=3) and [Part 2](https://www.reddit.com/r/BestofRedditorUpdates/s/EBk3VYxjaR) **←** **Many of my post lists are here**\n* [Recommended Subs & Collections](https://www.reddit.com/r/BestofRedditorUpdates/wiki/recommended_reading)\\*\n\n\\*Collections only work on desktop new reddit\n\n**Don't harass OOPs.  Don't comment on original posts.  Thank you.**",
        "num_comments": 1895,
        "comments": [
            "**NEW UPDATES**\n\nFound a new update that doesn't yet qualify to be posted to BoRU?\n\nFound an update that you don't want to make a post for yourself?\n\nLink it here! Once it qualifies, feel free to submit as its own post.",
            "Thank you, Czech, for getting default sort working again!",
            "I know this is vague but there was one where the husband and wife got in an argument, the husband packed a suitcase for the wife, and set it outside. Turns out the suitcase contained a bunch of random stuff from her nightstand, he wasn't being serious, but she took it as serious. \n\nIt was from the wife's point of view and I think the house was in her name. He might have changed the locks?\n\nEta Found it finally searching https://www.reddit.com/r/BestofRedditorUpdates/s/N6HwWYXhBt",
            "I’d love an update on the woman who purposefully left her workout bag at home and came home during lunch to find her neighbor having lunch in their kitchen with her husband - they had leftover from the previous nights dinner. The woman just grabbed her bag and left. Her husband was blowing up her phone with how much he loved her and the neighbor was just a friend. OP had made it very clear that she didn’t like the neighbor but the husband ignored her. \nEventually OP texted her husband back and said “I’m done and am taking time…leave me alone”. She didn’t fight with him or anything, just peace for out like a boss.\n\nI think the title was “Am I wrong for not caring if my husband is cheating”",
            "I would absolutely love to read this gem, brought up by a fellow redditor on one of the recent posts:\n\n\n\"I read one where some family member kept stealing baby ideas from a woman so she and her husband started telling just her that they were going to name their child this really ugly name if it was a girl and buy these horrific decorations and then turned out that person's baby was a girl so she got the nursery decorated with the goofy ass name and items and they laughed at her and said, \"Wow, we were just joking about how ugly that name and those things were, don't you feel stupid now?\"",
            "i remember reading this story a while back but can’t find anything when i search for it. the OOP wrote in because she had a coworker who for some reason has become convinced she doesn’t wear shoes in the office and reports her to HR or her manager. OOP is confused and increasingly frustrated because this is not true and she doesn’t understand why her coworker thinks this. \n\ni think the conclusion was the employee was let go/moved to a different team, but there was no answer as to why they became so fixated on the shoe issue\n\ni also remember this exchange recounted in the post -\n\nOP: when was i not wearing shoes?\n\ncoworker: just now, when you went to the printer\n\nmanager/HR: we can’t have you not wearing shoes. you have to wear shoes jen\n\nOP (in the post): I WAS WEARING F***ING SHOES!!",
            "Looking for the post where a dude wants to find a legal way to force his ex-girlfriend to take physical custody of their child, despite her only continuing with the pregnancy under his promise that he would have full custody and paying above the court ordered child support.",
            "OP is a girl who was the one driving her sister, paying the bills, and buying groceries. She gets grounded for being a few minutes late and she sticks to it so her parents are the ones who have to do what she did. \n\nHer sister was a spoilt girl the parents realized because she wanted to be driven around everywhere. \n\nAt the end she gets her privileges back and extra moneys and the right to refuse driving her sister. \n\nAnother is op whose parents are swingers, his/her \nparents go to parties and vacations without her and she talked to them about spending more time together. Untile they found out that the parents were planning to have a vacation with another couple and disguised it as a company meeting. \n\nThey call their grandpa and picked them up and the parents threatened to call the police on grandpa for child kidnapping.",
            "There was a BORU post where a woman was upset that her rich fiance never spent his own money. Like she had to pay for everything for the both of them, all because he was previously financially abused by his ex and he wanted to make sure OOP wasn't just with him for his money. I vaguely remember one point she mentioned was that she had to purchase drapes for their house, which he refused to contribute to. In the end, she called him out for his financial abuse of her and left him. He was planning to sell the house that she hated anyway because he bought it for his gold digger ex. ",
            "Looking for the one where OOP's father believes his mother cheated and that OOP is not his kid. Mom says he can divorce her if he believes she cheated and refused to get OOP DNA tested. OOP has a horrible childhood thanks to dad and decides to get their own DNA test when they turned 18. It is confirmed that OOP's dad is the bio dad and now he wants a relationship, but OOP wants nothing to do with any of them after how they were treated. I don't believe there was an update.\n\nEdit: it was [this one](https://www.reddit.com/r/OhNoConsequences/s/qoR6O1u0Mj) for those who are curious. Had to change around my search terms quite a bit since it seems the original post was deleted.  Is there a way to see OOP's comments on the original?"
        ]
    },
    "Flair Request Thread": {
        "title": "Flair Request Thread",
        "score": 711,
        "url": "https://www.reddit.com/r/BestofRedditorUpdates/comments/1cbq9v4/flair_request_thread/",
        "content": "Hello everyone!\n\nIn order to make flair requests easier to find, this is the new place to ask for flairs.  A link to the origin of your flair would also be helpful for for updating the [origins list](https://www.reddit.com/r/BestofRedditorUpdates/wiki/recommended_reading/flair_origins/).**\\***\n\n* Flairs have a limit of 64 characters, so longer requests will be edited to fit.\n* Requests that violate the rules will be deleted\n* If your flair is similar to one already in the list, you may be given the pre-existing one so the list doesn't get more clogged up.\n* I reserve the right to give out random flairs when I want\n* This thread will be checked once a day or so for new requests.\n\nSo leave a comment here with your flair requests and Czech will get to them right away!**\\*\\***\n\n^(\\*Czech know it needs updating and I will get to it....eventually)  \n^(\\*\\*flairs will be given out when Czech isn't on mobile)  \n^(\\*\\*\\*I know the comments aren't sorted by new, suggested sort has vanished...AND NOW IT'S BACK)\n\n**How to give yourself a flair from the flair list - App Instructions**\n\nStep 1: go to the  main page\n\nStep 2: tap the three dots in the top right corner\n\nStep 3: tap \"Change user flair\"\n\nStep 4: peruse the list and select the option that speaks to you\n\n**How to give yourself a flair from the flair list - New Reddit Instructions**\n\nStep 1: on the right side of the page near the top of the side bar, there is a section that says user flair.  Hover your mouse next to your username and click the pencil that appears\n\nStep 2: peruse the list and select the option that speaks to you.  Click apply\n\n**How to give yourself a flair from the flair list - Old Reddit Instructions**\n\nStep 1: on the right side of the page, click the checkmark where it says \"Show my flair on this subreddit:. Or if you already have a flair, click on \"(edit)\" instead.\n\nStep 2: peruse the list and select the option that speaks to you.\n\nThanks u/Rhamona_Q for the instructions write up.",
        "num_comments": 622,
        "comments": [
            "#Do not comment on the original posts\n\nPlease read our [**sub rules**](https://www.reddit.com/r/BestofRedditorUpdates/wiki/subrules). Rule-breaking may result in a ban without notice.\n\nIf there is an issue with this post (flair, formatting, quality), reply to this comment or your comment may be removed in general discussion.\n\n**CHECK FLAIR** For concluded-only updates, use the [CONCLUDED](https://www.reddit.com/r/BestofRedditorUpdates/search?sort=new&restrict_sr=on&q=flair%3ACONCLUDED) flair.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BestofRedditorUpdates) if you have any questions or concerns.*",
            "May I please have “Sharp as a sack of wet mice”??? That has lived rent free in my head since I read it lol",
            " 🥩 🪟 \n\n\nEdit: Thaaaaaank you",
            "Just wanted to say you've pulled together some of the most hilarious flairs on all of Reddit. Well done!",
            "If I had a nickel for every BORU about clown sex, I think I'd only have two nickels and no more...\n\n\nAnyway, may I have \"My soul aches for clown pussy\", please. It's already on the list <3",
            "May I please have “I want to state for the record that this is insane.” from [https://www.reddit.com/r/BestofRedditorUpdates/comments/tti5dy/leap\\_day\\_employee\\_is\\_denied\\_birthday\\_off\\_except/](https://www.reddit.com/r/BestofRedditorUpdates/comments/tti5dy/leap_day_employee_is_denied_birthday_off_except/) ? Thank you",
            "Hi, Czech! Could I please have \"[TLDR: snake](https://www.reddit.com/r/BestofRedditorUpdates/s/3E8WJErZ0c)\" as a flair?\n\nETA: Sorry to ask again. It changed but not to the right one. Thanks!\n\nETA2: Thanks! Love you, mods!",
            "“Wanted one loaf of bread, now being held ransom” from the doubled bread post tickled my fancy for a flair haha",
            "Can I get a meta flair that says Creative Writing Enthusiast?\n\nLOL\n\n\nYAY!",
            "Could I get \"Kung pao chicken doesn't count\" please? Just reread that post this morning and... Holy shit Thanks for everything you do here too, mods & posters \n\n\n ETA: https://www.reddit.com/r/BestofRedditorUpdates/comments/r3th2x/ops_sil_makes_racist_comments_updates/\n\n\nEta2: thanks so much, Czech <3"
        ]
    },
    "My soon to be ex husband and my sister threw everything they “cared for” for one week": {
        "title": "My soon to be ex husband and my sister threw everything they “cared for” for one week",
        "score": 1866,
        "url": "https://www.reddit.com/r/BestofRedditorUpdates/comments/1dlogv6/my_soon_to_be_ex_husband_and_my_sister_threw/",
        "content": "**I am NOT the Original Poster. That is** u/DentistBig7041. They posted in r/TrueOffMyChest and their own page.\n\nThanks to u/crushed_dreams for the rec!\n\n# Do NOT comment on Original Posts. The latest post is 7 days old.\n\n**Trigger Warning:** >!emotional affair!<\n\n**Mood Spoiler:** >!sad but OOP will be ok!<\n\n**Original** [Post](https://www.reddit.com/r/TrueOffMyChest/comments/1cnfyua/i_got_a_text_from_my_sisters_bestie_about_her_and/)**: May 8, 2024**\n\n**Title:** I got a text from my sister’s bestie about her and my husband “loving me too much” to do anything to hurt me.\n\nMy sister’s bestie told me that she feels guilty for being a snitch but that she couldn’t do this to me anymore because she thinks that I am a kind person and don’t deserve this.\n\nMy sister and my husband have always got along very well. They’re both brilliant. Both lecturers at the University and they have so much in common. I am not stupid but I never loved school and I have high school education. They have become best friends throughout the years (14 years) but never once did I feel uncomfortable about it since my husband has shown me nothing but love and respect. The opposite. Until now I counted myself lucky that the two people that I love the most in this world get along so well.\n\nBut now, I feel nauseated. The bestie sent me screenshots upon screenshots of her conversation with my sister. My sister has feelings for my husband and she appears to know that my husband feels the same way about her too. In one of the texts, my sister wrote that she loved me too much to do anything to hurt me. In another she wrote that I am too dear to both her and my husband to do anything that would hurt me.\n\nShe seems to think that they’re soulmates which is odd because the talk about soulmates came up once between my husband and I when I told him that I didn’t want us to be soulmates. He was curious and ask me why, I told him because soulmates meant that we are “programmed” or “destined” to fit together. There’s no free will involved and I want my love to come from a free space not a predestined place. He laughed and said he loved that. But apparently they’re soulmates?\n\nI know that I need to talk to him but I am dreading that. I am in so much despair right now.💔\n\n***Relevant Comment:***\n\nCommenter: If what the friend sent you is true, you need to take a moment and gather your thoughts before this talk you need to have with your husband, if possible check his phone so you have first hand look at the comunnication not the friends one. If real the emotional affair is more than enough of a betrayal.\n\n>**OOP:** For me even an emotional affair is a deal breaker, unfortunately.\n\n**Edit (Same post, Same day)**\n\nHi! Thanks for your help. I asked how I would be sure before asking my husband so he doesn’t just blatantly lie and you suggested to look into his phone. Thanks for your suggestion.\n\nI did now. I told him about my sister’s conversations with her best friend and showed him the screenshots. He was shocked at first and said he had no romantic feelings for her and he had no idea about her feelings, so I asked to see his phone.\n\nI read their texts and emails. And I was shocked that their contact is way more intensive and intense than I thought. They talk on a daily basis. They have lunch multiple times a week. Nothing sexual in the texts but yeah, he is stupid if he “doesn’t know” that she loves him, and he must think that I am stupid if after reading, I wouldn’t get the feeling that he has some feelings too.\n\nIn one of her texts, she wrote that she wished they had met first and under different circumstances. His answer wasn’t totally dismissive. He wrote yeah, it would probably have been different. When I asked him about it, he said well yeah, if he didn’t know and love me he would probably have been interested in another, my sister included. But he loves me and she is a close friend of his.\n\nSo there’s no sexual relationship between them, but I am not sure that is enough for me. I think they are both wrong and should have nipped it in the bud way earlier. I don’t know what to do now. I think I need time for myself to process this. I don’t feel well at all about this and I don’t want to make decisions from a place of fear and hurt nor convenience.\n\nI am sorry I can’t answer all private messages. Because I don’t use my phone that often. But our ages are: my husband is 45. I am 42. My sister is 38. My husband and I have been together for 16 years and married for 14. My sister is single. I am not a stay at home mom. I have my own business. We don’t have children. My sister has 2 from a previous relationship.\n\n**Update (Same Post): May 9, 2024 (Next Day)**\n\nSo now I have had some long talks and discussions with my husband. He seems to think that this is getting bigger than it is supposed to because I told him that I needed time alone to think and digest this. He said that he doesn’t understand why I am this hurt since he loves me and nobody else. I didn’t relent however and he admitted that he knows that my sister is in love with him because she has told him so. But she knows that nothing can happen between them so she is fine with just friendship(martyr). He loves her but not romantically and he is happy to have a friend like her. Their friendship is important to him and he doesn’t want it to end because I don’t trust him and his love for me.\n\nHe made a comparison to my best friend and asked what I would think if he asked me to cut my best friend from my life. He admitted that “intellectually” he has more in common with her than with me but that the heart doesn’t always choose who we are more “compatible” and that he loves and is physically attracted to me. I think this whole situation is messed up. I am repulsed by them both. I texted my sister all her screenshots and she wrote that she was disappointed in her bestie and that “your husband is all yours because I would never let anything happen that would hurt you because you are the most important person to me”\n\nIn other words they are both contradicting each other since both seem to believe that they are the one who is not letting a “relationship” between them grow for my sake.\n\n***Relevant Comments:***\n\n*On them meeting for lunch:*\n\n>About the lunches, he says that it is because they both work at the university and they eat lunch when both are in office. But tgat isn’t true because they don’t work in the same building.\n\nCommenter: How did he act? Was he truly shocked? Why did he hide how intense their communication was?\n\n>**OOP:** He was probably more shocked that my sister is talking to her friend about this. Otherwise he knows everything and probably likes it or he would have stopped it.\n\nCommenter: Other women’s husbands are not your soulmates.\n\nAs an academic, i know academics are often very emotionally dysregulated individuals inclined to asbtract and even magical thinking. Are you sure she isn’t delusional? They both sound like idiots.\n\n>**OOP:** They are idiots yes. If I was her, and I had developed feelings to my sister’s husband I would have nibbed it immediately. She is not a heroine for “not wanting to hurt me and sacrificing her happiness instead.  \n>  \n>If I was him, I would have immediately gone no contact with someone who has feelings for me (if we are to believe that he doesn’t reciprocate her feelings like he is pretending) if I had any respect for my spouse.  \n>  \n>So they are both idiots yes\n\n**Update** [Post](https://www.reddit.com/user/DentistBig7041/comments/1dgo8t1/my_stbxhs_and_my_sisters_love_for_me_was_worth/)**: June 15, 2024 (1 month and 1 week later)**\n\nI have written here and a few comments about my soon to be ex husband and my sister. I left him about a week after and he texted me day and night about how much he loved me and wanted me back then he just stopped. That’s when I found out that my sister left her children at my parents’ house and moved in with my husband. This made everything come out to the rest of my family and my parents were shocked and my mother really looked like she was already showing ptsd symptoms. About how disgusting she felt this whole thing was. She kept calling it incest and asking is that even legal.\n\nI guess that is how much my sister “cared” not to hurt me(if you read my first post). Even though I have been well composed and calm that I surprised myself, I still tried my hardest to look back on my whole life, childhood and upbringing to understand when it all went so wrong. What my sister did felt like something that was the result of years of resentment or at least indifference towards me and our relationship as sisters, so how did I miss that? She never cared about me did she? If she didn’t how could I have been so blind?\n\nThen not even a week later, I heard that they have ended things. I found out in the oddest way possible. My sister texted me. The first time she texted me since everything started. She just wrote “You b , I hope you burn in life and in hell”. I was very confused because she spent that week sharing cheesy “deep” quotes about love and soul mates and romantic insta stories with my stbxh. But apparently that was over. Stbxh has blocked her everywhere and she moved out. Because she came to my parents to get her children and had a meltdown when they asked for explanation. Stbxh started calling and texting me again asking me to meet because he wanted to explain because he loved me and wanted me to understand. He wanted to meet at least once before we started to meet with the lawyers involved.\n\nSo that is that. This has left me even more confused than if they just ended up together. I understand falling out and in love. Breaking up and starting anew but I can’t explain this. My stbxh keeps calling me his only love and true friend and my sister, until I left kept promising that she would never do anything to hurt me. She left her children at my parents’ doorstep and didn’t answer their calls or texts for a week.\n\nAnd all of this for a week? What were they thinking? Has anyone here heard of something like this happening? People throwing everything for not even a week?\n\n**True Off My Chest** [Post](https://www.reddit.com/r/TrueOffMyChest/comments/1dgox24/my_soon_to_be_ex_husband_and_my_sister_threw/)**: June 15 (Same Day)**\n\nAfter one week of “being in love” and my sister leaving her children at my parents door to be living in my home with my soon to be ex husband and flaunting everything on social media and sharing cheesy quotes, she moved back to her apartment and got her children from my parents. They aren’t friends on fb and he unfollowed her on instagram. Now she is saying that I have ruined her happiness and he started texting me again begging me to talk in private because he needed to explain everything before we started getting our lawyers involved between us.\n\nI understand that people fall out of love and sometimes they can’t control who they fall for and they can hurt many people around them but I never heard of two people throwing everything they pretended to care about for one week.\n\n***Relevant Comments:***\n\nCommenter: “Speak to my attorney.”\n\nI’d have that as my outgoing voice message.\n\n>**OOP:** I haven’t answered any calls from him, his family or unknown numbers. I don’t answer any texts either.\n\nComment: Men come and go, but a sister doing this is a fucking abomination. \n\nI could not imagine betraying my sisters like this. \n\nShe ruined her owned dammed life. What is she blaming you for? Being married to her affair partner? \n\nI'd let her bitch ass have him. \n\n>**OOP:** She can most certainly have him.\n\nCommenter: She can most certainly have him.\n\n>**OOP:** I dont have great relationship with his family, especially his mother. We lost our child and they blamed me for us not wanting more children afterwards, when it was both’s decision\n\nCommenter: It’s even worse that they are harassing you on his behalf.\n\nAlso sorry for your loss (child and relationships)\n\n>**OOP:** I don’t know if they are harassing me on his behalf to be honest since I haven’t answered them. They could be as confused as I am and he could be ghosting them.  \n>  \n>Not taking any chances anyway  \n>  \n>Thank you❤️\n\nCommenter: So they actually admitted to being together? Did they admit to the affair?\n\n>**OOP:** I don’t know tbh. I don’t think he knew that I knew they were together until he found out she was sharing it on instagram\n\nCommenter: I remember your first post!\n\nWhat threw me was him giving a whole spiel on how he loves you & doesn’t love your sister in that way & the first thing he does is move your sister into y’alls home.\n\nHe’s living in regret right now! These two are probably still in contact, I wouldn’t be surprised if they end back together, smh! Onward & upward\n\n>**OOP:** I don’t think they are still in contact no\n\nCommenter: This is the thing with infatuation/crush. You build someone up in your mind, but the reality is so very different. It's funny that it only took 1 week for them to fall apart. Your sister dumping her kids speaks volumes about the type of person she is. I hope her life is hell, I hope karma fucks her to the maximum. Go see him, let him explain, get your closure, and for the love of all that is holy, cut your sister off.\n\n>**OOP:** As much I am confused and want answers, I don’t want to get them from him. I don’t know how the divorce will be done and if I am going to need to see him or not, hopefully not but if it happens, my lawyer cnndo the talking.  \n>  \n>That’s why I am here instead, maybe people here have experience of something similar and can explain wtf happened these past two months\n\n&#x200B;",
        "num_comments": 236,
        "comments": [
            "#Do not comment on the original posts\n\nPlease read our [**sub rules**](https://www.reddit.com/r/BestofRedditorUpdates/wiki/subrules). Rule-breaking may result in a ban without notice.\n\nIf there is an issue with this post (flair, formatting, quality), reply to this comment or your comment may be removed in general discussion.\n\n**CHECK FLAIR** For concluded-only updates, use the [CONCLUDED](https://www.reddit.com/r/BestofRedditorUpdates/search?sort=new&restrict_sr=on&q=flair%3ACONCLUDED) flair.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BestofRedditorUpdates) if you have any questions or concerns.*",
            "Darn, was hoping there was going to be a new update.\n\nReally can't wait to hear about how utterly miserable with sis and STBX hubby are, especially since everyone knows about what they did by now.",
            "That old joke about \"that's not how your sister does it\" during sex is what i imagined happened. ",
            "What happened in that week will eventually come out but the OP is correct to get the divorce and only communicate between lawyers. \n\nHe will beg to come back and he might even stay broken up as a pressure tactic, hoping the OP eventually falls for it.",
            "\"I'm moving in with my sisters ex after breaking them up by declaring my love for him, hey mother and father just taken my kids so I can do so...\"\n\nWhy the hell did the parents say yes here.",
            "My guess is husband wasn’t genuinely interested in the sister but loved the attention and ego boost he got from her. When OP left him he probably figured what the hell and a week was probably enough for him to realise he didn’t even like her that much let alone love her\n\nFor an “intellectual” he is remarkably dumb. He could have easily turned the whole situation around and kept his wife if he had listened to her and cut the sister off\n\nLooking forward to the next update",
            "This is just confusing, sad and so odd at the same time.",
            "I’ve never had a Reddit post pull so many facial expressions from me or drop my jaw like this one.",
            "As my mom used to say, be very careful what you ask for because you just might get it. They got their soul mates, and they couldn't even last a week. The sister was probably really annoying with her romantic fantasies and unrealistic plans for the future. That's when the STBX realized he had messed up. That the sister was all fluff and no substance. Too late.",
            "i am CLUTCHING my popcorn, i need to know what happened in that week?!"
        ]
    },
    "I heard my husband cry in the bathroom after we bumped into his ex": {
        "title": "I heard my husband cry in the bathroom after we bumped into his ex",
        "score": 1452,
        "url": "https://www.reddit.com/r/BestofRedditorUpdates/comments/1dlohd6/i_heard_my_husband_cry_in_the_bathroom_after_we/",
        "content": "**I am NOT the Original Poster. That was** u/Hairy-Collection-852. They have since deleted their account.\n\nThanks to u/BakingGiraffeBakes for the rec!\n\n**Mood Spoiler:** >!OOP will be ok!<\n\n**Original** [Post](https://www.reddit.com/r/AITAH/comments/1dgeh7s/i_heard_my_husband_cry_in_the_bathroom_after_we/?share_id=BfUUg1XCugyfXqjI0mU3X&utm_content=1&utm_medium=ios_app&utm_name=ioscss&utm_source=share&utm_term=1)**: June 15, 2024**\n\nMy husband and I met 2 years ago. He proposed six months later and told me he knew I was the one when he met me and that he didn’t want to waste time or lose me. I was (still is) head over heels and agreed. We have been married for 6 months and expecting our first baby.\n\nLast weekend we bumped into his ex. They were together for 9 years but she ended the relationship when he didn’t take the relationship to the next level. When we got engaged and married my husband texted her to tell her and to apologize and talked about fate and how some things aren’t meant to be. I remember asking him why, he said that he owed it to her that so she doesn’t hear it from other people and not be prepared. They broke up 3 years ago (edit not 4; it was October-December 2021; bad math).\n\nShe was pregnant and holding hands with a kid that could be 7 or 8 years old and she was with a man who was obviously her partner and they were very affectionate towards each other. My husband said hi even though we could walk by unnoticed by them but he insisted to talk.\n\nWhen we got home I heard him crying in the bathroom . Now he has been depressed and distant the whole week. I realized he must’ve written to her after we got home and he showed me his phone and yes he has. Again apologized for what he did and told her that some things are not meant to be.\n\nWould I be the ah if I confronted him about what’s going on? Why is he doing this\n\nEdit: throwaway. I dont want him finding me\n\n***Relevant Comments:***\n\nCommenter (downvoted): If you think his emotional reaction means you're coming in \"second\" or that he still has feelings for her, that seems like such a waste. You are pregnant with this man's child! His ex is pregnant and in a happy relationship! You are obviously the one he is with.  The fact that he HAD feelings for his ex does not indicate that he \"settled\" for you!  Please, do not succumb to this black and white thinking.   You have a husband who has every right to feelings and emotions. It sounds like he handled this situation with grace and dignity.   I think he does need to cut communication with her completely in order to focus on his life. He had this moment of closure, you are both pregnant. Don't sabotage this with some bs about needing to be first. Or else go find a virgin/ guy who has never been in a serious relationship and be that guy's first...  \n\n>**OOP:** Ughhhhhh your picture of “handling things with grace and dignity” are totally different to mine and that is ok. I respectfully disagree with everything you said here and I am sorry but I am following my gut feeling which is often strong and true\n\nCommenter: Don’t end the relationship yet. Level with him about how you feel. Talk to him. Tell him. Give him the chance to come to his senses and double-down on you. Once you tell him exactly how this makes you feel, he should move heaven and earth to try to repair the damage with you. If he does not, then you will know what to do.\n\n>**OOP:** That’s the plan. I will give him a chance to choose me. Maybe confronting was the wrong word I used in my post. More like tell him how I feel and let him explain and them decide if his explanation is good enough for me.  \n>  \n>Many are suggesting therapy. I don’t think it works for me, ar least not if he doesn’t choose me. I don’t believe therapy changes what in the heart but only gives you tools to hide it better  \n>  \n>Therapy only works if both parties has chosen each other and need tooks to communicate that\n\nCommenter: NTA. The fact he 1/ texted her, 2/ cried and 3/ worst of all, has been distant is a red flag, it shows that he is NOT over her and he cannot even control those feelings and act normal towards you.\n\nFrankly, it looks like he wishes he were still with her, and settled for you just because he couldn’t keep her.\n\n>**OOP:** But that’s the thing, he could have kept her if he wanted. The break up was because he didn’t want marriage and children\n\nCommenter: And now he realizes he fucked up and only got his second choice.\n\nSorry honey, but we all have exes, and yet we don’t get all mopey about them. If I met my ex today and he was with his family, I wouldn’t be sad - I be very happy for him!\n\nEven I acknowledge that my exes were good guys, they have zero emotional power over me… Because my husband is 100% of what I want. I’m sure your husband is fond of you. But he doesn’t love you with all of his heart because if he did, there would be no space for her years after their breakup.\n\n>**OOP:** Same here! I have loved before and I have had exes. I would never have felt anything if I met my ex with a new woman because I don’t care about them emotionally\n\nCommenter: She's the one who got away.\n\n>**OOP:** That is what I want to understand. How did she get away? He had her for 9 years and didn’t want to make the commitment  \n>  \n>(to a different commenter): She left him because he didn’t want to get married or have children. I never got the sense that the break up was devastating to him just that they wanted different things\n\nCommenter: Why have you’ve rushed every aspect of your relationship? Like, that’s absolutely insane, to be married *and* expecting in under 2 years. I say that as someone who got married on my 2 year anniversary. That’s nuts. It sounds like he was trying to prove a point and is obviously still in love with his ex and using you to avoid mourning his last relationship.\n\n>**OOP:** Because I am stupid and thought it was so romantic and “meant to be”  \n>  \n>People can fool you to believe that they love you so much and there’s no point in waiting.\n\nCommenter: Um, they broke up three years ago but she has a child who is 7 or 8? Are you sure that he didn't abandon his kid?\n\n>**OOP:** Yes I am sure  \n>  \n>(different comment): I suppose it is the child of her partner or some relative of theirs  \n>  \n>(third reply to a downvoted comment) Because the majority probably didn’t need explaining that the exfg is dating a father and or the boy is just a family member\n\nCommenter: Am I the only person who is wondering why this chick hasn’t blocked his number yet? If she hasn’t, she obviously has some sort of emotional attachment to him even at a minimal level. Seems a bit strange to me.\n\n>**OOP:** Maybe she has? She never answers hom\n\n**Update (same post): June 15, 2024 (6 hours later)**\n\n*OOP shows her husband this top comment:*\n\nu/UncleNedisDead: NTA, but it sounds like that cliche story.\n\nGuy is happy with status quo and keeping the gf around for 9 years and while he says he’s open to the idea of marriage (to string her along), he believes it’s unnecessary and doesn’t actually make plans to get an engagement ring or pop the question. He just assumes if he runs the clock, she will be stuck with him for life\n\nHis Ex decides that she’s had enough of his placating words and realizes if she wants to get married and start a family, it can’t/won’t be with him. After she takes charge of her life and dumps him, he begs her to take him back and that he will give her the ring and wedding that she wanted, but it’s too little, too late. Curtains close on this relationship.\n\nHe takes a year or so to heal, and then finds you, who checks off most of his boxes and instead of risking the same thing happening again, he proposes to you in six months of dating and everything happens at warp speed because he has learned from his last serious relationship. Don’t leave it up to chance. Don’t string someone along.\n\nHim bumping into his ex make him realize he still had feelings for the “one who got away”. That if he hadn’t been so stubborn and slow about getting a ring and making his ex happy, that could have been him.\n\n>Again apologized for what he did and told her that some things are not meant to be.\n\nHe keeps telling himself that because it’s easier to blame fate and absolve himself about being a shit boyfriend who was wasting her time and ruined the relationship singlehandedly.\n\nI’m glad his ex got her happy ending.\n\nI’m sorry your marriage is starting to show cracks because your husband may be incapable of love and had a hidden agenda when marrying you. He might have married you to “prove”to his ex he could commit (like when he texted her about the engagement), rather than because of his deep and lasting love for you.\n\n**OOP's Comment Update**\n\nHi again! I hope you read this!\n\nSo I showed my husband this comment and I told him that this was basically how I feel things were but that someone else wrote it better. First he got upset and defensive then he started arguing and telling me to leave him alone (I have, for a week been nothing but supportive and leaving him alone)\n\nThen he started crying and asked to read it again. He sat silent for like in like 15 minutes reading it but not once did her deny or try denying it or call me crazy or at least tried to explain.\n\nIf I know myself, this is over. I don’t play second fiddle. I don’t do consolation prize and I absolutely am not going to have another woman being the main character in my own story. So I told him this was over and that I need a break to sort out my feelings but that this will eventually end in divorce because I know myself very well.\n\nHe didn’t say anything, ANYTHING. Just sat silent. I know his type. The only way he will realize my worth is when he has lost me. Just like he did his ex. People like him are frugal with their feelings. He strung her along because he didn’t want to give her all of him then he turned around and gave me exactly what she wanted but deprived me from exactly what I wanted that he gave her. Men like him will never give all of themselves because he probably thinks he would lose control if he gave all of him to a woman.\n\nWhat a waste of a man.\n\n***Relevant Comments:***\n\nCommenter: I’m so sorry OP but good on you for knowing your worth. Be glad you aren’t like her and wait 9 years to figure it out. Good luck for the future and with the little one\n\n>**OOP:** I learned from her mistakes. I had a living proof of my own future\n\nCommenter: Her mistakes or \"His mistakes\"?\n\n>**OOP:** Her mistakes for staying with him for 9 years\n\n&#x200B;",
        "num_comments": 235,
        "comments": [
            "#Do not comment on the original posts\n\nPlease read our [**sub rules**](https://www.reddit.com/r/BestofRedditorUpdates/wiki/subrules). Rule-breaking may result in a ban without notice.\n\nIf there is an issue with this post (flair, formatting, quality), reply to this comment or your comment may be removed in general discussion.\n\n**CHECK FLAIR** For concluded-only updates, use the [CONCLUDED](https://www.reddit.com/r/BestofRedditorUpdates/search?sort=new&restrict_sr=on&q=flair%3ACONCLUDED) flair.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BestofRedditorUpdates) if you have any questions or concerns.*",
            "Pro tip:  dont date if you arent over your ex, it never ends well, for anyone",
            "And now she's pregnant (presumably pretty far along) and stuck dealing with his wishy-washy \"grass is greener\" attitude with shared custody for the next eighteen plus years. Brutal.",
            "Oof. He realised he fucked up when his ex dumped him for dragging his feet so he learned his lesson and rushed with OP to make sure it didn't happen again and it happened again.\n\nI wonder what lesson he'll take away this time?",
            ">He didn’t say anything, ANYTHING. Just sat silent. I know his type. The only way he will realize my worth is when he has lost me. Just like he did his ex. People like him are frugal with their feelings. He strung her along because he didn’t want to give her all of him then he turned around and gave me exactly what she wanted but deprived me from exactly what I wanted that he gave her. Men like him will never give all of themselves because he probably thinks he would lose control if he gave all of him to a woman.\n\nThe choice to go all-in and give all of myself to my wife was the best decision I ever made. Life is so crazy and fucked up, but being madly in love with your best friend and life partner, waking up next to them (and next to my daughter) every day, it's the best fucking thing I've ever found.\n\nSometimes it feels like I'm on a mild hallucinogen I just feel so deliriously happy when I watch my daughter sleeping in the morning.",
            "Hope dude goes to therapy before he rushes into a third relationship to wreck another life. ",
            "I said this on a different post and I’ll say it here. Stop fucking marrying people after 6 months",
            "OOP kept commenting that his previous relationship ended because he didn’t want marriage or kids. And that didn’t make her question anything? Like why he stayed with a woman for 9 years wasting her time when he didn’t want what she wanted. Or why he then rushed into a marriage and kids he supposedly didn’t want. He was a red flag from day one. OP never should have been cool with how he treated his ex or assumed that she was somehow “better” or different. Even at the end she’s portraying herself as smarter than the ex. But she’s married to and having a kid with the guy so will be tied to him for life whereas the ex got to move on so the joke is on OOP.",
            "spaceships are made of the same metal oop has for a spine",
            "This guys a joke, I’m proud of OOP for knowing her worth and putting him in his place. I can’t wrap my head around getting married to prove a point - that’s supposed to be your life partner! Good riddance"
        ]
    },
    "[New Update]: I had a baby as a result of an affair and now his wife is reaching out to me": {
        "title": "[New Update]: I had a baby as a result of an affair and now his wife is reaching out to me",
        "score": 1790,
        "url": "https://www.reddit.com/r/BestofRedditorUpdates/comments/1dlmwwp/new_update_i_had_a_baby_as_a_result_of_an_affair/",
        "content": "**I am NOT OOP, OOP is** u/Free_River_3388\n\n**Originally posted to** r/TrueOffMyChest\n\nPrevious [BoRU #1](https://redd.it/1azfn6c) + [BoRU #2](https://redd.it/1cm2uu9)\n\n**NEW UPDATE MARKED WITH** ----\n\n**[New Update]: I had a baby as a result of an affair and now his wife is reaching out to me**\n\nTrigger Warnings: >!infidelity, past abuse, mention of abortion, deadbeat father, coercion, manipulation, harassment!<\n\n-------------\n\n**RECAP**\n\n[Original Post](https://www.reddit.com/r/TrueOffMyChest/s/faLhrQrZZw): **January 28, 2024**\n\nI (F, 26) had an affair with a married man (M, 42) a few years ago. I had no clue he was married when we first met and hooked up. I obviously looked him up on social media and while he did have photos of his kids on there, there was absolutely no mention or photos of a wife at all. I found out that he was married about a month after we first got together, but he told me it was just a marriage on paper and that they basically lived separate lives and agreed to remain married for practical purposes until the kids were older. They owned a business, which she really ran and he was just financially involved in.\n\nI knew at the time that I probably shouldn’t believe him, but I convinced myself it was true. I was in my early 20s and so attracted to him and I guess almost infatuated with him. He made me feel so good. I know now that I should have ended it immediately, but I didn’t realize what I was getting myself into. I was addicted to all of the attention he gave me, the great sex, the places he’d take me. I felt special. I was so naive.\n\nI got pregnant about a year into seeing him. I had always been so careful with preventing pregnancy, but during my relationship with him I took stupid risks. I was so high in lust with this guy, it’s embarrassing. The things he’d asked me to do…I’d say yes to almost anything, even when I knew it was a bad idea.\n\nI was in love with him, or I thought I was. I hadn’t intentionally wanted to get pregnant. I would of course dream about being his wife and having a family but I knew that wouldn’t be a possibility while he had this arrangement with his actual wife. I didn’t get pregnant on purpose with any intention of him leaving her for me, even if I wished that we could be a real, normal couple. I was surprised by how excited I was to be pregnant with his baby. I wanted that baby once I found out I was pregnant. The thought of carrying this baby of the man I loved was so special to me, but I knew he probably wouldn’t feel the same.\n\nI told him I was pregnant and he told me I couldn’t keep the baby. I expected his reaction, but I was devastated and it hurt me to my core that he didn’t feel the same way I did. He offered to pay, to make a whole weekend of it somewhere exciting (wtf?) and to buy me something special if I’d just please get rid of the baby. He explained that he didn’t want any more kids and that he couldn’t openly be a father to another kid when he and his wife were still pretending to be happily married to the outside world.\n\nI agreed to do what he wanted and we made plans for him to pick me up and find somewhere out of town to go get it done. I was all packed the night he was going to pick me up, but I started to feel really scared and really unsafe about the whole thing. I took my bag and checked myself into a hotel to hide because I couldn’t go with him. I texted him to say I promised to never contact him again and to never name him as the father or go after child support if he’d promise to leave me alone.\n\nAt first he tried to sweet talk me into doing what he wanted. When I didn’t cave in, he said some very nasty things to me and that I essentially better never contact him again or show up at his door.\n\nI have a 2 year old now. At times, it’s been difficult, but overall we are thriving as best we can. I have kept my word about not naming his as the father or requesting child support.\n\nHis wife contacted me on social media. Well, she’s his ex-wife now. She wants to talk to me. She found out about me and told me that she divorced him 6 months ago. She wants her children to know their sibling and for my child to know his siblings. That’s weird to me.\n\nI haven’t responded back to her yet. I am unsure about how to approach this. How to I respond to this? I wonder if I’m being selfish by not exploring an option for my child to know his siblings, if she’s being genuine about that. If I was married and my husband fathered a child outside of our marriage I don’t think I’d feel the same that she does.\n\n**Relevant Comments**\n\n[Comment 1](https://www.reddit.com/r/TrueOffMyChest/s/fFl8HyAjC7)\n> I didn’t know he was married when we first got together. I acknowledged that I should have ended the relationship as soon as I found out he was married. I allowed myself to believe what he told me, which made it seem not so bad - like this was some sort of agreement he and his wife had. Emotionally, I was already hooked. I’m not making excuses.\n> \n> I wouldn’t say I was “happy” to bring a baby into this situation. There was a huge mix of emotions. I felt like I was in love with him, so there was a part of me that was excited at first. That feeling soon died, but I felt that I loved my baby still. I tried to do the best thing that I could, which was to remove myself from his life and his family’s life. I just wanted to be able to keep my baby and love my baby. I did not get pregnant on purpose. I wasn’t on birth control. I had been on birth control when I was slightly younger and had a life threatening health complications as a result. He knew I wasn’t on birth control. He loved unprotected sex. I was stupid and I agreed to do it. I would do almost anything he asked sexually. I tried to track my cycle and would tell him when it was probably not a safe time to do it.\n> \n> His wife isn’t really what I’m afraid of. Whatever she’d want to say to me is probably deserved anyway, and more.\n\n[Comment 2](https://www.reddit.com/r/TrueOffMyChest/s/3HyywLwJC6) \n> He found out about the pregnancy before I “ghosted” him. And upon finding out I was pregnant with his child, there was absolutely no real discussion about what we were going to do. We were going to do what he wanted to do and he had it all planned out. He threatened me, by text and by phone calls and voicemails, when I told him I was not going to go with him on this abortion vacation he had planned. I begged him to please not force me to do that and he turned mean. I offered to never contact him again if he’d just let me go. After threatening me again, about what he’d do if I didn’t keep my word, he agreed. He has kept his side of the bargain and has never contacted me.\n\n[Comment 3](https://www.reddit.com/r/TrueOffMyChest/s/GPNys9Lka9)\n> I’ve been assuming that she found out about me in her own, maybe saw something on his phone or computer and has probably known for a while before reaching out to me (if it’s actually her).\n> \n> I get what some people are saying about siblings and such, but that man is not my child’s dad. He is the dad of his older kids but he’s not the dad of my kid. I’m still young and I hope to have more children one day, and those children would be my son’s siblings. I hope to find a man who loves me and my son and with whom I can have a legitimate relationship. I haven’t been with another man since I ended things with this guy. I actually just went on 2 dates for the first time very recently. I’m not desperate to find a man right now, but I hope to find real love one day.\n> \n> Those people are not my son’s family. He’s 2 and they’re old enough to drive. So, I do t think they’re missing out on any sort of important relationship right now. I understand wanting to know your bio family, and I feel he can decide that later on when he’s old enough to have a day. Depending on where we are at in our lives at the time, he might not feel a need to know those people.\n> \n> I don’t plan to lie to my son about his conception, but I don’t think we need to involve ourselves with the man’s ex-wife and teenage children at this time.\n\n&nbsp;\n\n[Update #1](https://www.reddit.com/r/TrueOffMyChest/s/VyvMrfZThh): **February 18, 2024**\n\nI made a post 3 weeks ago and things have only gotten stranger. I had an affair with a married man a few years ago. I regret it and I will never do anything like that ever again. I knew it was wrong from the very beginning, but he captivated me. I was naive. I allowed myself to believe when he told me they were pretty much just married on paper for the sake of their kids. I got pregnant and while he tried to talk me into getting an abortion I ultimately decided to keep the baby. I have a 2 year old little boy now. I promised this man that I wouldn’t expose our affair and I wouldn’t formally identify him as the father or request child support. I did that because he was becoming very nasty about the whole thing and I felt like due to the mess that I had created and the way I felt by the end of it, a clean break with no involvement with him would be the best thing for everyone. I moved back to where my family is, hundreds of miles from where he and his family live.\n\nAbout a month ago his ex-wife reached out to me via social media, claiming they had been divorced for 6 months and that she wanted our children to be able to know each other. Now, their kids are teenagers, so I didn’t really think they’d want anything to do with the toddler and the woman their father was having an affair with. It seemed odd to me. After posting here, I sort of decided that I wouldn’t respond to her. I’d just ignore it. She just sent me the one message, so it wasn’t as if she was badgering me about talking to me or meeting me.\n\nOn Friday night I decided to message her. I don’t really know why. I think it was really just for my sake so I could have the chance to apologize to her. I told her that I would be more comfortable speaking with her face to face since I couldn’t trust that it was really her. She said she understood. I was too nervous to meet her in person, but we did a video chat. I didn’t know what to expect, if this was all a ploy just to unleash her fury on me or what. I mean, I’d deserve that. She wouldn’t be wrong to feel that way.\n\nIt was really her. She told me she discovered our affair when she found communications between the two of us, after our relationship had ended. She told me I’m one of many women he had affairs with over the years and she knew about somebody even before he met me, but she didn’t divorce him at the time. Finding out about my child was the final straw for her. I told her I was sorry for my relationship with her husband and admitted that I knew he was married. She graciously told me she forgives me and that while she harbored a lot of anger towards me initially, she ultimately blames her husband. I’m not blameless, but she chooses to not hate me, essentially. She said she couldn’t have said this 6 months ago or a year ago when she first found out about me, but she has moved past that. She still has anger toward him, in addition to many other emotions surrounding him. She started pouring out her heart to me about their 20+ year marriage and life together and it was very awkward because what do I even say?\n\nHer kids know about me and my son. She says they’re very mad at their father. Somehow I don’t think they’re mad about the fact that he’s not involved with my son’s life. And why would they be mad about that? I would hate me if I were them.\n\nI told her with my son being so little right now, I don’t really feel comfortable with him meeting her kids or being involved with their family. I feel unsure about it and it’s just not something I feel needs to happen right now.\n\nThen she told me her ex husband was in a bad accident 2 months ago. He’s fine now, still not allowed to return to all his normal activities just yet, but will be fine. He is probably the most physically active person I’ve ever met, barely ever seems to sit down, so he must be terribly annoying to be around if he’s not allowed to go go go all the time. She told me he wants to meet my son. Apparently she moved back in with him temporarily when he first came home from the hospital. She said the accident really shook him up and he has been expressing a lot of regret about my son, not being involved, not providing for him.\n\nSo now it’s like was everything she said just a lie and he somehow got her to reach out to me on his behalf? And she actually did it? It felt almost like a relief talking to her initially, but then it’s like was any of that true or you were just trying to be his messenger? I don’t even know if that part is true now. Why wouldn’t he just contact me himself?\n\nI’m just feeling so uneasy about the whole thing now.\n\n**Relevant Comments**\n\n[Comment 1](https://www.reddit.com/r/TrueOffMyChest/s/VaRxiwuOJZ)\n> I don’t believe I HAVE to involve his teenage children in my son’s life. Maybe when my son is old enough to decide if he wants that.\n> \n> He is not named on the birth certificate and I do not receive child support from him. I have asked nothing of him, except to let me move away and not try to force me to have an abortion. I basically had to promise him to not contact him, not make him as the father, not request child support.\n> \n> If he truly wants involvement with my son he can reach out to my directly and he can take the legal route to establish himself as our son’s father.\n\n[Comment 2](https://www.reddit.com/r/TrueOffMyChest/s/cW7PWl3vio)\n\n> He did not legally sever his rights. He never established rights in the first place. He has no rights until he goes to court and establishes himself as the father. He is welcome to do that.\n> \n> Honestly, I wish my son did have a father who was involved in his life and loved him. Yes, this guy has faults, but he has plenty of positive qualities. He is really involved with his older children. I met them many times because they’d be at work with him or he’d have to drop by the office in his way to take them somewhere. He was always doing things with them. They seemed like good kids who really loved their dad. I wish my son could have that experience too. I didn’t think it was an option based on how he behaved when I was pregnant. He wasn’t interested and wanted me and our baby to go away. That’s what I did. And I accepted it.\n\n[Comment 3](https://www.reddit.com/r/TrueOffMyChest/s/XMFbjDscJ4)\n\n> He is not legally my son’s father at this time. This means that currently he has no legal parental rights or responsibilities regarding my son. I cannot stop him from taking the legal steps to establish paternity if he wishes to do so.\n> \n> He will always be my son’s biological father. I can’t change that fact. Regardless of whether or not he ever legally establishes paternity, my son will likely be curious about his biological father and who knows, maybe they will establish a relationship one day regardless of legal paternity.\n> \n> There is no way to say if I will meet a man who may want to adopt my son one day, thus becoming his legal father. It’s something that I think would be nice, but nothing that I’m “intent” on doing. By choice, I’ve only been one 2 dates since my son was born and that was only within the year 2024. I realize that it will not be as simple as signing a piece of paper.\n\n&nbsp; \n\n[Update #2](https://redd.it/1cgl0wt): **April 30, 2024 (2 months later)**\n\nI posted about this few months ago.\n\nTo summarize very quickly, when I was fresh out of college I had an affair with a married man and father. I became pregnant. He wanted me to get an abortion. He had arranged to “take me away” in a “vacation” to get an abortion. I wasn’t really sure what I wanted to do but I agreed to go along with what we wanted. At the last minute, when he was on his way to come pick me up, I told him I couldn’t go through with the abortion. I just really didn’t feel comfortable about his plan and how he was orchestrating everything. It scared me. I realized at that time how deep I had gone with this mistake, how screwed up the whole relationship was.\n\nHe was really mad. He threatened me, said a lot of nasty things to me. I told him if he just left me alone and let me have my baby then I’d leave him alone and wouldn’t name him as the father or seek child support. I moved back home (I was living in a different state when I met him). I kept my word and I did t it name him as the father or seek to establish paternity. I have never sought child support. My child is 2 now.\n\nA few months ago his wife contacted me via social media. At first she made it seem like she wanted my child to have the opportunity to know his siblings. It was sort of weird since the siblings are teenagers. She said she had divorced him 6 months prior.\n\nI agreed to talk to her virtually, not in person. I felt that I owed it to her to apologize for what I had done. I do feel bad about it. But at the end of the conversation I told her that I didn’t feel it was the appropriate time to connect my son with her kids. He’s a toddler and their teens, plus I had promised her husband to stay out of his life. That’s when she told me that he was recently in a bad accident and she had been helping to take care of him. Supposedly he was going to be fine and was fairly recovered at that point, but she said he had expressed interest to meet our child. So she was basically his messenger.\n\nI have not been in contact with her since then. I deleted my social media. I don’t know why, but the whole thing just really made me uncomfortable.\n\nSince I last posted here….\n\nThen, I received a handwritten letter from him. In it, he expressed how he wanted to get to know our son, he wants to be a father to our son, he wants to provide financially for him, he’d like us to come visit him. He asked me to sign a paternity affidavit. I refused to do so. I know he is my son’s father but I’m not going to make this that easy for him. After the things he said to me and threatened me with, he at least has to work for this.\n\nAt that point, my parents felt that we needed to meet with a lawyer. All communication from me has gone through a lawyer. I have never responded to him personally/directly.\n\nNow, I have a court order for paternity. I have to present my son to have a specimen taken tomorrow. I already know what it’s going to say.\n\nIt’s not that I don’t want my son to have a dad in his life. It’s just…the whole situation is a mess. And he lives a few states away from me. I don’t know what to do. I can’t really do anything. He’s doing things legally. Next, I’m sure he’ll petition for some form of custody or visitation. He’s not married anymore, supposedly, but he’s a lot more established than I am. He has considerably more financial resources. I also know he has all sorts of connections where he lives. Luckily they don’t hold as much weight here in my state but it’s still so scary to me.\n\nI’m a bad mom. I brought my son into this world knowing it was a messy situation. I just got so comfortable with it just being the 2 of us and now I don’t want to give that up.\n\n**Relevant Comments**\n\n**OOP on if the father would be moving closer to her and her son now that he’s divorced from his ex-wife**\n\n> **OOP:** To touch on just a few things…\n> \n> I don’t think he’ll move away from where he lives. He has way too much established there.\n> \n> He’s in his early 40s. I don’t know how this supposed accident (if that even really happened) has affected him, but he was incredibly physically active when I knew him. He only slept like 4 hours a night, took a 20 minute power nap daily, and rarely ever sat down. He was also HIGHLY involved in his children’s lives. I’d even say overprotective, like a helicopter dad instead of the typical helicopter mom.\n\n**Careless_Welder_4048:** How did he have time to cheat?\n> **OOP:** He only slept a few hours a night and moved at about a million miles a minute. Everyone joked about it. Somehow he always had time to get up at 5 am, go surfing, do some work, take his kids to school, do some work, take his Power Nap, get coffee, pick his kids up after school and take them wakeboarding or some other sort of thing like that, do some more work, be at his kid’s basketball game, and so on and so forth. He literally never ever stopped.\n> \n> I was just another thing to help fill out his calendar to prevent him from getting bored.\n\n**OOP on the father’s relationship with his ex-wife and their children**\n\n> **OOP:** I also don’t think he and his wife had much of a relationship, although it wasn’t quite as he described it to me. They lived in the same house but I believe they lived pretty separate lives. He bought her a business to give her something to do and keep her busy. She was there most of the time. They didn’t even go to their kids activities together. He was always the one going. So I think that freed up time too. I don’t think they liked being around each other so she was happy to have him out of the house. She admitted to me that I wasn’t the first affair he had and she knew about most of the time we were together.\n\n&nbsp;\n\n---------------------------------\n\n# ----NEW UPDATE----\n\n[Another update on how stupid I am, or I had a baby as a result of an affair and now his wife is reaching out to me](https://redd.it/1dga5xi): **June 15, 2024 (2 months later)**\n\nI won’t rehash the whole thing here. My previous posts are on my profile. I got pregnant from an affair with a married guy. He wanted me to have an abortion. I decided I didn’t want one. He turned mean, I promised to not name him as the father, legally, or to pursue any sort of child support. I moved away from where he and his family were located. I’m about 12 hours away from him now, back where my family is from. I haven’t reached out to him in the now over 3 years since.\n\nHis ex-wife reached out to me out of the blue via social media, initially claiming she wanted to connect with me so that our kids could know each other. When I politely declined for the time being, as her kids are teenagers and my son is a toddler and we live states apart, she revealed she was really reaching out in behalf of her ex-husband who had supposedly had a change of heart about being involved in our child’s life after nearly dying in an accident. I did not engage with her any further after that. It all made me feel very uncomfortable.\n\nLater, I received a letter from him in the mail. He asked to be involved with our son, to provide for him, etc. It still felt weird. I mean he turned really mean and didn’t want anything to do with me or our baby and hadn’t made any attempt to contact me in years (and I was not hiding - his wife was obviously able to find me on social media and you can find my address online).\n\nI felt like if he was serious, he’d take the steps to establish paternity legally. And that’s what he did. Around 1.5 months ago we were ordered to submit DNA samples for a paternity test. It took around 5 weeks to find out what I already knew it’d say. But now things are stalled for another several weeks for the next step in the court process.\n\nI haven’t talked to him at all during this whole thing. I didn’t respond directly to his letter. I do have a lawyer and everything is basically going through him now.\n\nThen without any warning, he just showed up at my home last weekend. Just knocked on the door like it was nothing. Basically, this is his son and he doesn’t want to wait another 6 weeks for the court to inevitably order us into some sort of custody mediation anyway…his words. Why can’t I just talk to him? I told him he made me uncomfortable and him just showing up at my house really made me uncomfortable. Honestly, I don’t know what made me so uncomfortable. The fact that he showed up unannounced like that or the fact that I instantly felt the same attraction to him that I had when I was with him and I didn’t want to feel that at all. In some weird way part of me felt happy to see him and then another part of me was disgusted that I was happy.\n\nHe said he doesn’t understand why we can’t just talk about this. He’s not trying to take my son away from me; he just wants to be involved in his life and to help provide for him like he should have been all along. He’s sorry he wasn’t there when he was born. He’s sorry he reacted the way that he did when I didn’t go along with his plans to take me on an abortion vacation. Why can’t I believe that he just wants to be a dad to his kid?\n\nI guess I agree with him. Why can’t I just accept that he has had a change of heart? I can’t trust myself. I can’t trust my own judgment. I feel like if I easily let him into my son’s life I’m going to end up regretting it and be made a fool of somehow. I’ve already made so many mistakes when it comes to him.\n\nHe says it’s stupid of me to not try to work it out amongst ourselves first. I’m giving so much control to the court. I don’t know whether to believe that or to think it’s just his way of convincing me to do what he wants.\n\nI know he will get some sort of visitation and eventual custody. Maybe it would be better if we try to come to an agreement, but he had the ability to sway me so easily. I’m so stupid when it comes to him. Nobody else has ever made me feel so foolish in my life.\n\nI want my son to have a dad. I admit it’s probably selfish of me to want to keep him away. I just keep imagining having to spend weeks or months apart from my child while he’s living with his dad 12 hours away and I can’t stand the thought of it.\n\nI’m just feeling sad, stupid, and defeated.\n\n**Relevant Comments**\n\n**OOP on if the father is actually divorced from his wife**\n\n> **OOP:** I checked the county records and they did actually get divorced.\n\n**Mammoth_Might8171:** At this point, u need to trust your lawyer (hopefully he is a good one). Make sure that your lawyer has all the facts, including how poorly he treated u when he found out u were pregnant. Do not communicate anymore with your ex, especially since u know that u are incapable of making good decisions when he is involved. U may need to prepare yourself mentally that your ex is eventually going to play a role in your kid’s life (as much as that suck). Hopefully u can go after him for back-child support\n\n> **OOP:** My lawyer has any and all information that I possibly had to share.\n> \n> I am already preparing myself that he will likely have a role in my child’s life. I mean, the change will be difficult for me and I honestly don’t want anything to change. But I’m trying to focus on any shred of positive outcome this could have for my son. He deserves a dad. I wish it wasn’t in this situation. I wish I had given him two loving parents in a stable relationship, the ideal. I wish I had at least given him a father who didn’t live states away. I feel bad that my son has two lying cheaters for parents. I truly do feel so embarrassed about our behavior in a new way I did before, ever since my son was born. Other than that whole thing and the fact that he’s apparently had affairs with multiple women according to his ex-wife, he actually seems like a good dad to his teenage kids. He was always very involved with them. I guess I’m just trying to cling to whatever positive things I can think of. He can also provide a lot more financially than I currently can. Thats scary for me because I’m already turning it into some sort of competition between us in my head. Several points for him, none for me.\n> +\n> My son is also very shy. He doesn’t do well if me or one of my parents isn’t there with him. I’m just now getting him involved in more activities with other kids and safe, trusted adults, but he still just clings to me. My heart breaks when I think of him meeting a strange man he doesn’t know and me not being there. I want to be there.\n> + \n> I think that’s how things normally go for him and to be perfectly honest that’s how I used to be for him to. Just go along with what he wants. He was obviously expecting me to when he showed up in person. He genuinely seemed surprised I didn’t cave in to his requests right on the spot. The previous version of me probably would have.\n\n**OOP on how the father managed to find her address** \n\n> **OOP:** He sent me a letter in the mail previously. I Googled myself and my address comes up easily. Admittedly, I made no effort to hide myself after moving away. I didn’t think I needed to. He had no interest in being involved with our baby and I promised to never contact him again, so I thought that was the end of it.\n> \n> His ex-wife told me he was in a bad accident when I talked to her. It’s not too surprising based on his hobbies. He lives at like 200 miles per minute. According to her, she had to move back into their house to take care of him while he recovered. When he showed up here, he didn’t look like somebody who had been in a life threatening accident not too terribly long ago. He told me he’s fully recovered and although he’ll probably have back issues the rest of his life he’s perfectly fine.\n\n**OOP on having a visitation plan with the father for her son**\n\n> **OOP:** My lawyer says that other than creating a graduated visitation plan based on the fact that my son doesn’t know this man, the fact that he hasn’t been involved in his child’s life for the last 3 years won’t mean much to the court. Their ultimate goal is for a child to have 2 parents. I screwed myself over by not naming him as the father at birth or trying to establish paternity in any way. Had I done that and he fought it, neglected to pay court ordered child support, etc., then we could have a better case as far as abandonment goes. He is putting in the effort to establish paternity now, is willing to pay child support (so he says), and is presumably going to tell the court he wants to see his kid and this is going to reflect positively for him, despite not being involved for 3 years.\n\n&nbsp;\n\n# **DO NOT COMMENT IN LINKED POSTS OR MESSAGE OOPs – BoRU Rule #7**\n\n# **THIS IS A REPOST SUB - I AM NOT OOP**",
        "num_comments": 295,
        "comments": [
            "#Do not comment on the original posts\n\nPlease read our [**sub rules**](https://www.reddit.com/r/BestofRedditorUpdates/wiki/subrules). Rule-breaking may result in a ban without notice.\n\nIf there is an issue with this post (flair, formatting, quality), reply to this comment or your comment may be removed in general discussion.\n\n**CHECK FLAIR** For concluded-only updates, use the [CONCLUDED](https://www.reddit.com/r/BestofRedditorUpdates/search?sort=new&restrict_sr=on&q=flair%3ACONCLUDED) flair.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BestofRedditorUpdates) if you have any questions or concerns.*",
            "So he intimidated her into an abortion, then got nasty when she said no, threatened her if she ever contacts him again, then two years later expects her to just… roll over and be happy that he wants to be in that child’s life and welcome him with open arms after getting his ex wife to try to drag her back and showing up at her home unannounced without permission because the court is taking too long to force her? What the actual hell? Absolutely not, that’s some horror movie shit",
            ">He says it’s stupid of me to not try to work it out amongst ourselves first. I’m giving so much control to the court. I don’t know whether to believe that or to think it’s just his way of convincing me to do what he wants.\n\nOOP is too old to be this wilfully obtuse about the reality of the situation. \n\nSurely.",
            ">I screwed myself over by not naming him as the father at birth or trying to establish paternity in any way. Had I done that and he fought it, neglected to pay court ordered child support, etc., then we could have a better case as far as abandonment goes.\n\nThis is for everyone saying \"I don't need anything, I won't even name you in the BC\".\n\nRight, now she screwed herself by basically doing what he wanted and now he has the advantage.",
            "She needs to let her lawyers know he turned up and not engage with any direct communication. Even the chat when he turned up was way more than she should have given him.\n\nShe should hopefully get back pay for custody",
            "OOP said she was stupid. After reading all these, I unfortunately have to say it doesn't look like she has gotten much smarter with the experience and age...",
            "God, how can you trust that man and think anything that comes out of his mouth is not for his own benefit. \nYeah, maybe he wants to play daddy now. Maybe he sees the kid as a second chance baby or he had an epiphany but going there and saying let's work it out between our selfs and doubt about going to court is crazy!",
            "she's going to sleep with him again",
            "Dang OOP really liking getting this man in her head. First it was “i’ll leave my wife” and now it’s “let’s settle this outside of court.” The guy has already proven himself to be a scary dick.",
            "“I won’t rehash the whole thing”\n\n… proceeds to rehash the whole thing in every single update 🫠"
        ]
    }
}