{
    "From the moment I met Lae’Zel, I knew": {
        "title": "From the moment I met Lae’Zel, I knew",
        "score": 674,
        "url": "https://v.redd.it/xhhaoym9nz7d1",
        "content": "Bae’Zel for life",
        "num_comments": 27,
        "comments": [
            "What's this from?",
            "Remember the time Brock Samson played poker with Glados, Claptrap, Ash Williams, Sam & Max?",
            "This man’s voice should be Kronk",
            "Bae'zel 💜",
            "Karlach too.",
            "I literally spit out my beer. thanks for that. Hilarious....and nostalgic.",
            "Missed this episode of the venture bros.",
            "Dude hell yeah venture bros crossover",
            "She sounds like Minthara",
            "I hate how accurate this is"
        ]
    },
    "After 500 hours of this game I’m finally making my first Dragonborn playthrough XD": {
        "title": "After 500 hours of this game I’m finally making my first Dragonborn playthrough XD",
        "score": 388,
        "url": "https://i.redd.it/jqzo9hg7f08d1.jpeg",
        "content": "XD yay!!",
        "num_comments": 92,
        "comments": [
            "WHAT THE HELL IS THAT",
            "Where did the snout go?",
            "I think this is less a man born with dragon, and more a dragon born with man",
            "This looks like a paralysis demon.",
            "\"Whats the matter, smooth skin.\"",
            "Is that fucking Ivan Ooze?!",
            "Bro made a myconid",
            "Reminds me of Jaal from Andromeda",
            "69000 porn mods on Skyrim?  Meh.  This?  Modding has gone too far.  Man must be stopped.",
            "What the fuck...\n\nDont get me wrong, thats cool. But damn."
        ]
    },
    "Why do people think the Tav origin is bad? ": {
        "title": "Why do people think the Tav origin is bad? ",
        "score": 30,
        "url": "https://www.reddit.com/r/BG3/comments/1dlu9dw/why_do_people_think_the_tav_origin_is_bad/",
        "content": "I heard tons of people saying that the Tav origin is boring and that the dark urge origin is better. Well, i agree that playing DU is better, but playing as normal Tav was just as funny, liked the idea of discovering the world from a more foreigner point of view than DU. Some people say that tav was detatched from the plot while i think that it's so immersive that i forgot that my Tav wasnt a character from the game. Some people say that Tav is a blank canva while DU is an actual character, and while i agreed before, i looked at some sources and i found out that if you play as the dark urge, it means that the two had an ecounter and dark urge killed Tav before the events of baldurs gate. While if you play as Tav, it means that Tav survived that ecounter. So id like to think that Tav isnt just some random person that doesnt exist in the universe but has a meaning for the plot. Maybe not as connected to the story as the DU, but still.",
        "num_comments": 39,
        "comments": [
            "Because people can't role play for themselves. Tav has nothing so you can make them whatever you want.",
            "Some people really like the Dark Urge, some people really like Tav. Both are valid.",
            "Tav is meant to be more of a blank slates so you as the player can insert your own roleplay background and history. You get dialog options throughout the game that let you speak from a local Baldurian perspective or as an outsider. There is no specific character story for Tav like there I'd for Durge or any of the other origin characters so that you can create your own headcannon story.",
            "I'd never say Tav Origin was bad, I got to play my character exactly how I'd imagine them. Durge was interesting though, since I played the same character but with the twist of Durge and figuring out who the hell they were before. Tav is kind of a blank slate, which I guess could be boring to some. While Durge has some given depth to them presented in game which is appealing. Either way, I enjoy both; Durge is my go to though since I essentially play them as Durge turning into Tav, wanting to be a normal person and live their life.",
            "I don't think tav is bad, and infact I'd say it's the best origin for new players.  Honestly I don't get the appeal of playing anyone besides tav or durge.\n\n\nI think people say tav is bad because internet discourse is vocal black and white.  Everyone gets hyperbolic and whiney when people disagree with their opinions ",
            "My first playthrough was rogue tav. My second bard durge. I was shocked by the amount of content and \"nuance\" and attachment to BG's world I've lost by playing Tav. It was still nice and fun, but definitely very empty in comparison, although there are some moments when durge feels stupid. But I also blame the bard, cause it's just too good lol",
            "Tav requires the player to create some head canon for role playing; that's not natural for some...?🤷🏻‍♂️",
            "I’ve played once as Tav and twice as the Dark Urge. And honestly, Baldur’s Gate doesn’t feel like my Tav’s story anymore. Trust me, I did a lot to develop my Tav and I adore her. But if you go all in on the roleplay and develop a complex backstory, it’s going to be unsatisfying never exploring or talking about that past. \n\nI still adore my Tav. I even have a mini of her made and I hope one day I’ll get to fully play out her story in a dnd game. (Which isn’t looking too likely because the single dnd game I’ve been able to put together has me as the dm and whoops I’m getting off topic).",
            "Tav is a blank slate and feels empty compared to Dark Urge or Origin Shadowheart for have tons of content",
            "Both are great.  The origin characters are also great.\n\nI think the reason Durge gets so much attention is that playing that way feels more canon, and is such a radical departure from how a normal RPG protagonist works."
        ]
    },
    "Cat got your head?": {
        "title": "Cat got your head?",
        "score": 20,
        "url": "https://i.redd.it/roezakpxu38d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "An out of body experience",
            "She gave head and couldn’t put it back"
        ]
    },
    "I cosplayed my durge tav 🖤": {
        "title": "I cosplayed my durge tav 🖤",
        "score": 878,
        "url": "https://i.redd.it/uj8eze2ypx7d1.jpeg",
        "content": "",
        "num_comments": 26,
        "comments": [
            "you look more stylized than she does，lol",
            "this is phenomenal!!! you did a great job!!!!",
            "Ok, this may partly because I'm slightly sleep deprived, but you did such a good job I actually had to do a double take to figure out which one was you. Great job, looks amazing.",
            "You named your Durge tav?",
            "https://preview.redd.it/zzkxifdxsy7d1.jpeg?width=3840&format=pjpg&auto=webp&s=db772ece912f95ce7dd3af0055522733a2a8dc0e\n\nLove that neck tattoo",
            "Oooh, you pulled it off amazingly! Where’d you get the horns you used?",
            "You look better than the game character",
            "oh man this is EXCELLENT!",
            "Such a great job!✨",
            "Amazing!"
        ]
    }
}