{
    "Hall of Fame Post": {
        "title": "Hall of Fame Post",
        "score": 113,
        "url": "https://www.reddit.com/r/BG3Builds/comments/1c2ijd4/hall_of_fame_post/",
        "content": "This post is to highlight many of the more important posts that have been made on the subreddit since the game released, as well as important outside resources:\n\n&#x200B;\n\n# Basic Mechanics\n\n- [30 minute video by Mortismal Gaming on Combat Basics](https://www.youtube.com/watch?v=EjGMn3e3NVo)\n\n- [Dice Rolls page on Community Wiki](https://bg3.wiki/wiki/Dice_rolls)\n\n- [Commonly Confused and Misunderstood Mechanics](https://www.reddit.com/r/BG3Builds/comments/1b4cogh/commonly_confusedmisunderstood_mechanics_for_bg3/)\n\n&#x200B;\n\n# Quality, completed build compendiums\n\n- [Completed Builds Post](https://www.reddit.com/r/BG3Builds/comments/169s082/completed_builds_post/) (please add any detailed, completed builds you may have developed here)\n\n- [Presitious\\_Juice341's Party Building Templates](https://www.reddit.com/r/BG3Builds/comments/190r158/bg3_party_building_templates/)\n\n- [Gamestgy builds](https://gamestegy.com/post/bg3/990/best-builds-tierlist) by u/zanuffas\n\n&#x200B;\n\n# Meta Defining Posts\n\n- [Introduction to BG3 Character Building || Frequently Asked Questions](https://www.reddit.com/r/BG3Builds/comments/1b8z4d5/introduction_to_bg3_character_building_frequently/)\n\n- [Introduction to BG3 Strategy](https://www.reddit.com/r/BG3Builds/comments/1bnh5t8/introduction_to_bg3_strategy_eight_mechanics_more/)\n\n- [Top 10 BG3 Broken Items](https://www.reddit.com/r/BG3Builds/comments/1b2ak0c/top_10_bg3_broken_items_a_guide_to_optimization/)\n\n- [A set of short-form guides all grouped together, for the impatient](https://www.reddit.com/r/BG3Builds/comments/1bgmkww/a_set_of_shortform_guides_all_grouped_together/)\n\n- [D&D 5e Rule Changes](https://bg3.wiki/wiki/D%26D_5e_rule_changes)\n\n&#x200B;\n\n# Honor Mode Guides\n\n- [Reach level 4 with no combat](https://www.reddit.com/r/BaldursGate3/comments/18ebd26/beginners_guide_for_bg3_no_fighting_to_lv_4/)\n\n- [Reach level 5 in Solo Honour Mode video guide](https://youtube.com/watch?v=V8FAlhpfQ9s&feature=youtu.be)\n\n- [Thorough, Act-by-Act Honor Mode Guide](https://www.reddit.com/r/BaldursGate3/comments/18of2fz/bg3_honor_mode_indepth_guide_for_act_i/)\n\n&#x200B;\n\n# Helpful Tools (also found on sidebar)\n\n- [Build Planner by EIP Gaming](https://eip.gg/bg3/build-planner/)\n\n- [Unique/Missable Item Checklist](https://gamestegy.com/bg3/checklists)\n\n- [Compendium Spreadsheet](https://docs.google.com/spreadsheets/d/1719aXUG7qLN3oRBIMaMpLUujKazSMYczmBLem52wWdM/edit#gid=233885691) by u/Yuri_the_Avocado\n \n&#x200B;\n\nPlease let me know if there is anything you feel should be added. Specific, one of a kind builds will not be added.",
        "num_comments": 19,
        "comments": [
            "I'm not really good at searching and linking threads but there has been a few Honour Mode guides that helped me prep for my run. Great builds are nice but advice about handling money, taking it slow, and learning the importance of not trying new things really made a difference for me.\n\nCompilations of people's failed HM can also help avoid silly mistakes.",
            "I hadn't seen those Gamestgy builds before.  Much higher quality than I've seen on other similar sites.   But u/zanuffas, I have a question:  I didn't see any Druid builds or Druids mentioned for multiclass dips, and they similarly aren't on the class Tier list.    Any specific reason?  Or just a finite amount of time sort of thing?",
            "oh my god, Please forever keep this pinned!",
            "I have seen a good few Honour Mode Advice posts but didn't think to include them here. Thanks for the recommendation, I'll add the category and add 2 or 3 posts tomorrow (open to comments recommending posts people found useful).",
            "Hey, its just that i hadnt touched druid much in my playthroughs :D so i refrained from adding them in tierlists before testing them :)\n\nI do have plans for these builds of course, but dont have a timeline yet. Cheers!",
            "Thanks. I added that. I had even responded to a message by the post author and let them know I was going to add this. Then forgot.",
            "There's a long 4-part post somewhere with a pretty efficient HM walkthrough. I followed it until level 5 and it was good.",
            "Heh,  okay so not some deep-seeded hatred or fear of Druid's then.  It was very curious, since everything else was so thorough.   :)\n\nVery nice guides, that seem to cover most of the powerful core builds I've seen around, and at good level of detail.    Wish I'd known about them earlier it would have made sharing core build ideas easier.",
            "Thanks! I plan to jump back to BG3 at the end of the month as i have a long list of builds to cover :D\n\nCheers!",
            "Thanks! Saving your comment, for future references :D"
        ]
    },
    "Trials of Tav - a roguelike mode": {
        "title": "Trials of Tav - a roguelike mode",
        "score": 737,
        "url": "https://www.reddit.com/r/BG3Builds/comments/1dnkcb7/trials_of_tav_a_roguelike_mode/",
        "content": "https://preview.redd.it/rzgqtmra9k8d1.png?width=1920&format=png&auto=webp&s=a59a0b3cc4db4b12f05737bddcda80d372eacc07\n\nHi there! \n\n  \nIf you are here, it means that you have an interest in theory-crafting and building strong and interesting characters and parties for bg3. By now, you probably know all the different item combinations and ways to create overpowered builds. If you are looking for a new challenge, look no further— welcome to Trials of Tav, the roguelike mode mod for Baldur's Gate 3. \n\n\n\n- Like a classic roguelike game, you'll progress from encounter to encounter, starting with nothing but the clothes on your back. As you clear encounters, you'll receive randomized loot that will make your party increasingly stronger. \n\n\n\n- These encounters become progressively harder as you advance and increase your RogueScore, a whole new metric to track your progress.\n\n\n\n- Powerful unlocks like hag hair or tadpole powers will further empower your party and complete your builds. \n\n\n\nIf tons of hours of new gameplay, NG+, 200+ enemies, 38 maps and a formidable challenge is what you seek, you can download the mod here: \n\n[https://www.nexusmods.com/baldursgate3/mods/9907](https://www.nexusmods.com/baldursgate3/mods/9907)",
        "num_comments": 86,
        "comments": [
            "And here was me about ready to move onto another games after my third run. \n\nDammit guess im doing this now lol",
            "This mod is fantastic and Ive had hours and hours of fun playing it and it keeps getting better with every update. Makes me super excited for what people will be able to come up with in the future.",
            "Been playing this myself and with my friend, honestly can't recommend it enough\n\nSo much fun, and you just absolutely fly through the leveling",
            "I read the mod description but I still dont understand the best way to begin. Should I get to level 3 normally and then begin the rogue mode?",
            "Just waiting for this mod to come to console now...",
            "Started a run with a friend a few days ago. Playing off and on and loving it! Haven't gotten past like 150 rougescore so maybe I'm jumping the gun. But I was thinking bosses from the story would have some of their tactician/honor mode passives/legendary resistances. I came across one or two and found them to be pretty weak enemies and didn't have any of the their fun boss mechanics. Does that stuff come at higher difficulties? If not is there any plans to add harder boss fights?\n\nEdit: NVM found the actual boss fights",
            "I was just talking to someone about wanting modes / mods that use the engine like a sandbox and build new things. Are there others like this?  Can't wait to try.",
            "Please work on Xbox in a few months",
            "Are there any gameplay videos of what it actually looks like to play? I only have the game on ps5",
            "Oh man I was looking for something spicy to add when I started modding BG3 again after my current MP HM run is done (don't wanna someone mess up that save since it's helping 3 friends get their dice in act 3 and I've had mods mess with other saves in the past), thank you so much for sharing this here! Definitely going to check this out soon!"
        ]
    },
    "Best class for ‘OP Bard Swords Build’ ": {
        "title": "Best class for ‘OP Bard Swords Build’ ",
        "score": 9,
        "url": "https://www.reddit.com/r/BG3Builds/comments/1dr7qzr/best_class_for_op_bard_swords_build/",
        "content": "Hey, \n\nStarting a second playthrough today with a best mate and am very excited!\n\nI ran gloomstalker on my first playthrough and 100% want a Bard build next.\n\nI’ve read a lot of threads on here about ‘OP sword bard builds’ such as The Control Martial but none of them mention which *Race is best.\n\nI’m planning on duel wielding and slinging spells to make the most of the flourishes, but I really don’t wanna go ranged (crossbow) as I’ve already done that.\n\nAny help appreciated! ",
        "num_comments": 8,
        "comments": [
            "My personal favorite is human for the free shield proficiency and extra carrying capacity so you can go rapier/shield dueling fighting style (half elves work too)\n\nIf you're going 2h instead of 1h then half orc for sure.",
            "If youre going 10/1/1 control martial Wood elf will give you fleet of foot + fey ancestry, stealth/perception proficiency and importantly longbow proficiency to abuse the Titanstring + str elixer combo before your lvl 8 respec without giving up your glove slot to archery gloves\n\nEdit: the gloves of archery do provide a +2 ranged dmg bonus so theyre a decent choice anyway until you get the dex gloves even as a wood-elf. Youll get proficiency with all weapons when you dip fighter and hand crossbows will get you through until then. Ive done the build using hand crossbows until level 8 and it worked fine.",
            "Just realised I put class instead of race! Any ideas on that?",
            "Half Orc is good for smite swords bard with savage attacks and the insane number of critical hits youll end up landing.\n\nDuergar is always good too (invisibility at will / enlarge).",
            "Maybe wood elf for the extra movement? That never hurts on a melee build, especially if it's less tanky and more swashbuckling. Or duergar for the jumping and invisibility?",
            "I endorse this. Make your Bard a Half-Orc and name him Lurbuk.",
            "The races in this game were largely homogenized so there aren't huge differences between them other than their racial abilities.\n\nYou can more or less pick the one that you like aesthetically without having to worry about being underpowered; the only exception to this is picking 'short' races for a melee character, as you may have some difficulties getting into position with the reduced movement speed. Even that isn't really a game-breaker and can be compensated for with spells and items.\n\nAll that said, Wood Elves are my personal favorite for the extra movement speed, plus the elfy benefits like reisisting charm and sleep.",
            "[Control Martial is Sword Bard 10 / Fighter 1 / Wizard 1](https://www.reddit.com/r/BG3Builds/comments/17y9kyp/the_control_martial_allpurpose_1011_swords_bard/), best at building arcane acuity and to control opponents; it's a range version.\n\n[Slashing Sword Bard](https://www.reddit.com/r/BG3Builds/comments/18pxoy9/honor_mode_102_smite_swords_bard_ssb_complete/) is another interesting build, more melee and damage oriented."
        ]
    },
    "What builds go best with Helmet of Arcane Acuity and Band of Mystic Scoundrel? (That isn't Bardadin)": {
        "title": "What builds go best with Helmet of Arcane Acuity and Band of Mystic Scoundrel? (That isn't Bardadin)",
        "score": 11,
        "url": "https://www.reddit.com/r/BG3Builds/comments/1dr64cb/what_builds_go_best_with_helmet_of_arcane_acuity/",
        "content": "",
        "num_comments": 31,
        "comments": [
            "Sword bard 10 / fighter 1 / wizard 1.",
            "Pact of blade warlock is great in my opinion - I found you actually dont use many spells when you can attack twice per round so quick casting 1 or 2 per combat is awesome, especially because they are all upcast to the highest level you can get my warlock was really, really effective in combat. You do need to devote one of your feats to get medium armor proficiency or you will be a bit squishy though",
            "Not the most optimal at all, but I like hunter 11/war priest 1, with Command/approach as the main CC spell",
            "Helmet of Arcane Acuity and Band of Mystic Scoundrel go best with a sword bard, like the famous 10/1/1 sword bard but works fine also with a pure sb or with a 2 level fighter dip (archer + dual crossbow + sharpshooter)",
            "Acher EK with scrolls. Any caster that have a decent dex and use arrow of may taget.",
            "Pact of the Blade warlock with magical initiate bard as a feat to pick up vicious mockery as a cantrip.",
            "12 sorc or 11 sorc 1 warlock are the best builds (you get command with warlock, realistically 12 sorc does enough dps though)",
            "EK11/Fiendlock 1 can Command rather effectively, thanks to having +10 and forcing Disadvantage: you can also skip the Band and go EK12 with Cold-synergy items, to create DC+10 Ice fields with the Snowburst Ring.",
            "Sword bard imo. Flourishes stack arcane acuity fast. And bards have a lot of spell slots for ring.",
            "Why not fighter 2 for action surge?"
        ]
    },
    "Fun druid builds?": {
        "title": "Fun druid builds?",
        "score": 6,
        "url": "https://www.reddit.com/r/BG3Builds/comments/1dr6t3q/fun_druid_builds/",
        "content": "Hi guys, I wanted to play druid for the first time. I have more than 800 hours and this is the only class I never got to play because I never understood the appeal behind it. But now I want to play something knew.\n\nIs there anyone more experienced here with this class that can suggest me some fun build? Not necessarily an OP one, just fun, even in HM.",
        "num_comments": 25,
        "comments": [
            "My favorite is circle of the land druid. You don't have main character energy, but they are excellent at cc and battlefield control. I also really like playing with summons. Moonbeam became my BFF and then the dryad and her wood woad are great. Early game I'd use wildshape for extra hp until spellcasting really came online. Late game ice memphits and water elemental became my distance fighters while dryad blocked at least one path with spike growth. Wood woad helped with cleanup while my actual companions could focus on bosses and other enemies. Moonbeam has a small aoe so I could pick off one or two at a time that were caught in spike growth. I had dual scimitars for anyone who could actually make it to me. Late game wildshape was more for out of combat things like sneaking into small spaces or distracting the locals while Astarion lockpicked.",
            "6 lvls in Spore Druid, 6 lvls in Open Hand Monk.\n\nKnock out your foes and convert them into your army",
            "I wanted to try circle of spores, but I too was afraid it would make battles slow and tedious",
            "Thank you, your list is a godsend. Got me plenty of ideas.\n\nAlso, Bruh that electric spike growth combo is crazy o.O",
            "Woodland Being is huge. You get the being herself, and she can then cast spike growth for free, plus summon the wood woad. Great spell.",
            "So, land druid is focused on summons? It would be my first time playing around with those. Do they make battles slower like the army of undead of a necromancer?",
            "I just started spore Druid OH monk build and Im really digging it so far. Boosting my AC as much as possible so I never lose that sweet sweet temp hp. Not sure if Ill go 6/6 or do a different split, maybe Druid 3/monk 9",
            "If you want to do circle of spores, try 7 Spores Druid/5 Any Martial and youll have a blast",
            "It really is!\nAlso, I forgot to add, the most fun I had with Druid was with a mod that fixes a bug that doesn't allow Druid to recast Call Lighting and move Moonbeam while wildshaped. I run it with a Sorc that could twin haste - being able to attack twice (thrice at Druid 10) and Call Lightning with the hasted action WHILE being a fuck mothering owl bear was so freaking fun to me",
            "You have options on the land druid as at certain levels you can pick subclass features. Depending on which feature you chose you get different spells. I just pick the ones that offer summons. They are a combo of druid and wizard spells. You don't have to play with summons at all if you don't want to. I'd suggest looking at the wiki to see the lists you can pick from. There are way too many options to list them here. The elementals/mephits/myrmadons are controllable as compared to things like ghouls and zombies. So, you have more characters to get through in a round, but you can choose their travel paths and actions like you would a companion. They just have a very limited range of actions available."
        ]
    }
}