{
    "Happy Pride Month, everybody!": {
        "title": "Happy Pride Month, everybody!",
        "score": 833,
        "url": "https://i.redd.it/lo0wo01u6h3b1.png",
        "content": "",
        "num_comments": 31,
        "comments": [
            "This is what conservatives ink happens every pride mon, but, like, in a literal sense.",
            "\"I just want to be treated like everyone else\"",
            "Is bi_irl doing anything to protest the API changes? Haven't seen any posts related to it",
            "Why am I cackling over volgayno ",
            "Whoo hoo! Im home! ",
            "Happy Pride! Spread love and positivity, not hate.",
            "How do you even find the thorn symbol",
            "You Google thorn letter, copy it, and add it to your autocorrect.",
            "Omg I love stuff like this and the thorn symbol is my favorite thing to tell people. I was so shocked to see it tbh. That was random anyway yall are super cool",
            "No. Hate bicycle"
        ]
    },
    "bi_irl": {
        "title": "bi_irl",
        "score": 4958,
        "url": "https://i.redd.it/qvkrzoev999d1.jpeg",
        "content": "",
        "num_comments": 101,
        "comments": [
            "How does one become a veteran level bisexual?",
            "I day i realised i was bi, I was like oh ok then not much i can do about that, then a few weeks after properly excepting it I was like new options yay!!!",
            "Jokes on you. My imposter syndrome went away the same time my cisness did.",
            "I do love wondering if I'm straight while chatting with the blokes on grinder",
            "I have never felt like I deserve to be bisexual, as weird as it sounds. Its hard to believe that I am or that I can identify or be part of any sort of group like this",
            "Lol .5 bi here, y'all have imposter syndrome?",
            "Yo where do I enlist in the bisexual army?",
            "not true. many people get over it or never have it",
            "When do I get accepted by the wider lgbt community?",
            "I feel this way sometimes. I'm confident I'm bisexual but I've only ever been in hetero relationships so I always wonder if I'm faking it or something. But i find women hot too without a doubt. It's weird."
        ]
    },
    "bi🌊🐸irl": {
        "title": "bi🌊🐸irl",
        "score": 1182,
        "url": "https://i.redd.it/zgxqbrh5cd9d1.jpeg",
        "content": "",
        "num_comments": 28,
        "comments": [
            "I smoked the toad and all I got was really good at sucking dick ",
            "All I can see here is the frog holding the flag with its big ol' bubble butt cheeks XD XD XD",
            "I want the chemicals to do for me what hes done for the frogs ",
            "I've been sipping the frog water for years now. Because of this, I am gay.",
            "Our country's flag, lol! Such a majestic creature.",
            "First the frog get an alternate universe where everyone is amphibian and then they get sexuality as well, humans are on the chopping block",
            "Not to defend this piece of shit but what he was stupidly speaking about in this strange rent was chemicals dumped into water whose effect was not really known but give many male frogs female reproduction systems wich is concerning.\n\nThat say, he's still an asshole.",
            "TURN THE FRICKIN FROGS GAY!",
            "Yeah its so weird I cant help but spread the meme of it lol",
            "GAH GAH GAH! SICK OF THIS CRAP!"
        ]
    },
    "bi🦜irl": {
        "title": "bi🦜irl",
        "score": 358,
        "url": "https://i.redd.it/xpejn0ujte9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "This is my thought process most days lol",
            "What does this meannnnn",
            "Relatable."
        ]
    }
}