{
    "Daily Cyclist Thread": {
        "title": "Daily Cyclist Thread",
        "score": 1,
        "url": "https://www.reddit.com/r/bicycling/comments/1dr5c2b/daily_cyclist_thread/",
        "content": "The Daily Cyclist Thread is a place where everyone in the [/r/bicycling](https://old.reddit.com/r/bicycling) community can come and ask questions or share anything.\n\nYou might have questions that you don't think deserve an entire post. Perhaps you're just seeking the input of some other cyclists. Maybe you want to share a picture of your new bike.\n\nAnyone is free to comment, and (hopefully) get as much input as possible from other cyclists.",
        "num_comments": 0,
        "comments": []
    },
    "Wear a helmet yall": {
        "title": "Wear a helmet yall",
        "score": 1388,
        "url": "https://www.reddit.com/gallery/1dql1ho",
        "content": "Happy Friday everyone, just a reminder to wear your helmet and watch out for suicidal squirrels \n",
        "num_comments": 246,
        "comments": [
            "I never even remotely thought of this as a way to crash",
            "Just FYI, you're much less likely to crash if you ride without the squirrel attached to your wheel.",
            "I must admit, this has brought to light a novel apprehension that I had not previously considered.",
            "I always do and I dont really understand the controversy over helmets, but in this case...\n\nI don't think it would have helped the little guy.",
            "Poor squirrel couldn’t afford a helmet or flashing red light.",
            "Jesus… that is the worst kind of accident. I mean what are the odds…",
            "Never thought to worry about these guys. Always seemed agile enough to dodge me. New fear unlocked lol. Also is your fork on backwards? Or did the squirrel bend it like that?",
            "Did the wavecell inner lining show any signs of compressing as designed?",
            "Expectation: seeing a picture of a helmet with scratches.\nReality: dead squirrel that I did not want to see",
            "and I thought that squirrel that stared me down was an outlier last week...\n\nGlad you're okay!"
        ]
    },
    "My 2024/2025 Dream Bike Build: Cervelo S5 (2024) 🥰🥰 6.5kg/ 14lbs! 🎉🎊🎈": {
        "title": "My 2024/2025 Dream Bike Build: Cervelo S5 (2024) 🥰🥰 6.5kg/ 14lbs! 🎉🎊🎈",
        "score": 17,
        "url": "https://www.reddit.com/gallery/1drc540",
        "content": "Heyy everyone! I'm soo proud of myself. This is my first full “weight weenie” with parts that actually work with my preferences vs the ultimate lightweight/ delicate parts. ☺️ I've been wanting a proper aero bike that was lightweight but also one of the fastest you could buy and also UCI legal. I did it!  \n\nSome key specs: \nFrame size: 51cm / 120mm stem/ 380mm handlebars\nNew Sram Red AXS groupset ( minus chainring) \nCarbon RaceWorks 50/60 wheelset 1290 grams\n52T chainring\n10-28 rear cassette\nSram Red AXS pro team issue cranks\nHylix Seatpost for lighter riders\nS -works Power Mimic 155mm saddle\n\n\nBefore y’all ask lol. :  \n\nI’m in a very flat city where most climbs don’t exceed 6/7% hence the gear combination but can swap out for a 10-36 if needed. \n\nFor y’all spec nerds out there : \n\nI’m 5’6 “ (167cm) , 138lbs(62.5kg)  , 35 yr old, 49 VO2 Max , FTP 278w, W/kg 4.4.\n\n[List of parts and their weights](https://www.reddit.com/r/WeightWeenies/s/KCe91RGL8Q)",
        "num_comments": 4,
        "comments": [
            "Pretty bike, but that’s  a dang small cassette for a 1x setup. Hope you don’t have many climbs near by.",
            "That’s is absolutely beautiful. And it sounds like you made some very thoughtful decisions about what works best for your use case. Congrats!",
            "Yeah. I’m I a very flat city.",
            "Thank you! Yes, lots of thought into this build and lots of waiting for parts. 🤣"
        ]
    },
    "How bad is this wheel?": {
        "title": "How bad is this wheel?",
        "score": 11,
        "url": "https://www.reddit.com/gallery/1dr8rdm",
        "content": "",
        "num_comments": 33,
        "comments": [
            "Make for some cool garage wall art",
            "Useless for anything except art, gardening, or recycling",
            "It’s done. Sure, you could still ride it, but you’re risking catastrophic failure. Is your health and safety worth the couple hundred for a new wheel?",
            "Shows the value of periodic cleanings. I discovered a crack in a carbon frame once when wiping it down. Had it fixed and I’m still riding it.",
            "Dude either throw it away now, or let the paramedics throw it away when they scoop your broken 🍑 off concrete....",
            "Very, time for a new rim.",
            "I had a aluminum cxp 33. Thought it was bullet proof. It was less than a 1000 miles. Had an injury that kept me off the bike. When i got on it I had a creaking. I tried all sorts of adjustments and cleaning.\nFinally took it to the shop. I had a crack that went 3 spokes on my 36 spoke wheel under paint. Said I was lucky.",
            "\"Time for a new rim\" bad it is. Be sure to check the other one, too!",
            "hit up velomine.com for wheelsets, pretty cheap shipping like 20 bucks",
            "I am having this exact issue on my bike. My local bike shop told me to keep an eye on the spokes if it gets any worse and then it is time to replace the wheels. It’s only 3 spokes that are doing it. I was hoping to make it to the end of the riding season. Do I need to replace them immediately?"
        ]
    },
    "I might have forgotten something important..": {
        "title": "I might have forgotten something important..",
        "score": 33,
        "url": "https://i.redd.it/r9ct9pvsbf9d1.jpeg",
        "content": "Kudos to my roommate for informing me of my mistake",
        "num_comments": 3,
        "comments": [
            "How far did you ride without a seat before you checked your texts?",
            "Packed bike for a trip, seatpost and saddle stayed in the stand is my guess.",
            "How"
        ]
    }
}