{
    "Daily Cyclist Thread": {
        "title": "Daily Cyclist Thread",
        "score": 1,
        "url": "https://www.reddit.com/r/bicycling/comments/1dr5c2b/daily_cyclist_thread/",
        "content": "The Daily Cyclist Thread is a place where everyone in the [/r/bicycling](https://old.reddit.com/r/bicycling) community can come and ask questions or share anything.\n\nYou might have questions that you don't think deserve an entire post. Perhaps you're just seeking the input of some other cyclists. Maybe you want to share a picture of your new bike.\n\nAnyone is free to comment, and (hopefully) get as much input as possible from other cyclists.",
        "num_comments": 0,
        "comments": []
    },
    "Wear a helmet yall": {
        "title": "Wear a helmet yall",
        "score": 1247,
        "url": "https://www.reddit.com/gallery/1dql1ho",
        "content": "Happy Friday everyone, just a reminder to wear your helmet and watch out for suicidal squirrels \n",
        "num_comments": 239,
        "comments": [
            "I never even remotely thought of this as a way to crash",
            "Just FYI, you're much less likely to crash if you ride without the squirrel attached to your wheel.",
            "I must admit, this has brought to light a novel apprehension that I had not previously considered.",
            "I always do and I dont really understand the controversy over helmets, but in this case...\n\nI don't think it would have helped the little guy.",
            "Poor squirrel couldn’t afford a helmet or flashing red light.",
            "Customer complaint: squeaky brakes",
            "Jesus… that is the worst kind of accident. I mean what are the odds…",
            "New fear unlocked",
            "Never thought to worry about these guys. Always seemed agile enough to dodge me. New fear unlocked lol. Also is your fork on backwards? Or did the squirrel bend it like that?",
            "Did the wavecell inner lining show any signs of compressing as designed?"
        ]
    },
    "riding bikes every day until I can’t for some reason, day 1404": {
        "title": "riding bikes every day until I can’t for some reason, day 1404",
        "score": 164,
        "url": "https://i.redd.it/6dxbnhx4mc9d1.jpeg",
        "content": "",
        "num_comments": 14,
        "comments": [
            "Great picture. The building decoration in the far upper left. The seat post seems to aim at the 1st bend in the brick. It looks like it could be a graph of your daily/weekly miles over 1404 days. What is different about you and rides from day 100 to now? Speed, distance, weight, clothes size etc..",
            "You know, I blieve that you're riding your bike EVERY DAY.\n\nI also believe you're quite an accomplished photographer.  You have quite an eye! \n\nWhat I don't believe is that you manage to capture a stunning photo every single day, day after day.\n\nCare to explain?",
            "I feel like I keep riding the same routes here in the GTA/southern Ontario. I gotta find some new areas to explore.",
            "Good for you.  Keep us updated.",
            "Loving these daily posts",
            "Great bike, great photo.",
            "that is cool, man! my dad does a lot of pictures of his bike like this. i'll tag you if i can wrassle some of them together.",
            "Ever think about collecting all these photos in one place?",
            "This is amazing, how do you find these places to take a good picture? Sounds like more work than just riding your bike :)",
            "thanks for the kind words. i love your perspective about the bricks being like a graph. i also really appreciate your question for making me reflect a bit:\n\non day 100 i rode 30 km. these days i'm averaging 50 km/day (today i did 62)\n\non day 100 i might have been going through a phase where i was wearing bike shorts underneath sweatpants because i was too self conscious to be seen wearing bike shorts in public. those days are long gone lol\n\non day 100 i wasn't clipped in yet because the idea of being clipped into my bike made me nervous. those days are also long gone\n\nback then i was probably still doing XL for all clothing sizes. now i'm more comfortable in Ls\n\non day 100 i was in the middle of shedding 60 lbs, which came off in the first 6 months of this streak. i've been hovering around the place where that landed ever since\n\nthanks again for the nice question"
        ]
    },
    "I might have forgotten something important..": {
        "title": "I might have forgotten something important..",
        "score": 21,
        "url": "https://i.redd.it/r9ct9pvsbf9d1.jpeg",
        "content": "Kudos to my roommate for informing me of my mistake",
        "num_comments": 3,
        "comments": [
            "How",
            "How far did you ride without a seat before you checked your texts?",
            "Packed bike for a trip, seatpost and saddle stayed in the stand is my guess."
        ]
    },
    "Group Ride Fault Question": {
        "title": "Group Ride Fault Question",
        "score": 84,
        "url": "https://i.redd.it/tlsotdo3uc9d1.jpeg",
        "content": "I joined my second ever group ride yesterday, and had the unfortunate experience of cutting off the rider behind me. I received conflicting feedback from some of the riders in the group who witnessed, so am seeking feedback from this community. \n\nI’m the center rider in the diagram. We are approaching a hill and traveling around 15mph, nothing crazy. The group spreads out a bit - there is actually another rider way to my left on the other side of the road. I’m a bit confused by this format already, because the club rules explicitly state to remain in single file, and avoid riding side by side at all times, except when pulling off of the front and returning to the rear. The red hexagon is a massive pothole, which the rider in front of me, leading the group, is able to see and doesn’t signal. He chooses his line and is able to drift gracefully to the right, leaving me exposed the hazard. In a split second decision, I choose to follow the line and avoid the hazard, but swerving rapidly in the process. What I don’t realize is the proximity of the rider behind me, which is to my right and some of the other riders witnessed him overlapping me moments before. When I swerved, I didn’t hit the wheel of the rider behind me, but was told I came close. There was some shouting, I apologized and we amicably resolved the conflict. \nWhat I am stuck on is if I am truly at fault. Yes, I understand that sudden movements are not ideal and should be avoided, but I also think the rider behind me shouldn’t have been overlapping wheels per the club rules. I also am a former competitive skier from a family of ski instructors, and have always followed the philosophy of responsibility lying in the hands of the uphill skier, as the downhill skier cannot fully be aware of those behind them. I would think that somewhat applies to cycling as well.\nAfter the ride, the individual feedback varied - I was told by one person that I should have just eaten the pothole, and another agreed that the rider behind should have maintained a safer distance.\nWhat do you think? should I have eaten the pothole ? Am I fully at fault here?",
        "num_comments": 69,
        "comments": [
            "Never overlap wheels unless you're a paid cyclist and it's worth the risk. The leader was at fault for not calling out the hazard but sometimes you don't have the time to signal. Then you should use your voice. \n\nBut overlapping wheels is the fault of the cyclist behind you.",
            "It’s the leader’s fault in my view. He is supposed to look out for upcoming hazards and signal quite early if there is a hazard on the street and he is going to change the pacing line as a result.\n\nIt’s a split second decision on your part but either way you were being squeezed out of the pace line even if you did go over the pothole, so the guy behind overlapping wheel is still an “unfriendly” move.\n\nWe always assume risks by following someone’s wheel so closely, and sometimes, shit happens that are beyond anyone’s control and even by mistakes caused by others. But those who go in to group rides and start blaming others often don’t have the grasp of risks they are taking.\n\nAnd if the leader is not taking any responsibilities and not having your back, and just letting others to shift the blame on to you, you should definitely reconsider being in that group.",
            "Nah I don't eat potholes and potentially ruin my tire and / or wheel.\n\nThe person behind you followed you too closely, that's his fault.\n\nThe person Infront of you avoided the pot hole and decided to screw everyone behind him and say nothing.\n\nSounds like a bad group.",
            "thank you for all of your feedback! I am feeling vindicated and a lot more confident for the next ride. this specific club ride has a large attendance, and splits into small pods of 6, so I should be able to avoid these riders moving forward.",
            "100% NOT your fault. Rule number one in group riding is not to overlap wheels for cases like this when you need sudden change of direction. The only time this would be your fault is when the person behind you will be right next to you and you will take him down. I used to race and yes, in races overlap is normal but the danger of holes is pretty low. However, crashes do happen pretty often in races and overlapping is one of the reasons.",
            "Of all the people involved, it sounds like you were least at fault.",
            "\"but I also think the rider behind me shouldn’t have been overlapping wheels per the club rules\"  \nDing! Ding! Ding!",
            "Never, ever overlap wheels with the guy in front of you specifically because if they need to make a sudden movement you are going to be the one eating asphalt when their rear wheel pushes your front wheel.",
            "Everyone's fault but yours.\nFirst rider should signal the pothole, rider behind should not half wheel.",
            "Bunny hop?"
        ]
    }
}