{
    "BigDickProblems FAQ V.3": {
        "title": "BigDickProblems FAQ V.3",
        "score": 749,
        "url": "https://www.reddit.com/r/bigdickproblems/wiki/faq",
        "content": "",
        "num_comments": 0,
        "comments": [
            "[deleted]"
        ]
    },
    "My boyfriend has a big dick and I'm scared": {
        "title": "My boyfriend has a big dick and I'm scared",
        "score": 27,
        "url": "https://www.reddit.com/r/bigdickproblems/comments/1drb1md/my_boyfriend_has_a_big_dick_and_im_scared/",
        "content": "I'm m23, my boyfriend (m22) is very hung.   I'm scared by this.  I have told him that I am inexperienced, especially with that size.  He is very loving and caring with me, we have a beautiful romantic connection.  We have talked and want to have our first time together soon, I have flirted a bit of a big game.\n\nThe thing is, I see him as my life partner.  I know that's a big thing to say before the first time, but we were friends for a year and been dating for almost two months now.  (We have waited a long time to get physical because I am a CSA survivor.  He is the sweetest, caring guy about this).   I love him so much and I want to please him well.  I am worried that I won't be able to take him well orally or for penetration.\n\nIf I may ask to the hung guys here, straight or not, how much patience do you have with a partner about taking your size?  And is it easier overtime to take a bigger dick?\n\nThanks for the help, this is on my mind a lot lately.",
        "num_comments": 20,
        "comments": [
            "You should always have patience. Takes things slow. And it definitely gets easier over time",
            "Most of the relationships I've been in, I've had to take it slow i have only met maybe two partners in my life that could take the whole thing right away, slow and steady wins the race, It Definitely gets easier over time go slow and use lubrication when doing the deed that'll help it might take a couple tries or more communication is key.",
            "Woman here. Whose current bf is hung af. Take time, go slow, use loads of lube and loads of foreplay. Foreplay and aftercare are important af.\n\nMy bf been so loving and caring- and been going slow and steady. Patience is key!",
            "You take as much patience as your partner on the receiving end needs.  This is why lube and foreplay are both important factors, but communication is 100% key.",
            "Get the vas out n chalk the cue n pray",
            "Every woman the freaked out when i stick it in, always made me move slow, then asked me to go hard.",
            "There's nothing wrong with sticking to hands and mouth stuff until you get more comfortable with sexual interactions in general with him before you proceed to intercourse. The more comfortable and relaxed you are in the situation, the easier anal will be. As others have said, even when you do try anal, go slow. You don't have to take it all, *ever* in fact. I know you mentioned concern about wanting to please him, but please remember it should be enjoyable for you as well. Be kind to yourself and have grace, and rest in the knowledge that your partner is kind and will do the same to you as well. Good luck. :)",
            "I’m pretty sure this says m/m so some of the advice is ok, but you do have to start stretching your hole out. Communication, lube, and foreplay are all good things, but if you’re going for anal you have to do a lot of actual physical pret work.",
            "I've had this problem a couple times with some of the people I've seen. All I know is at least from my experience I was patient because I wanted to be right for both of us and I wanted to make sure they feel good and comfortable. I really cared about them and I wanted to make sure it was a positive experience for both of us. I know that sounds like a very generic answer but if they're the right person they'll be patient they'll understand it's okay to take your time with these things.",
            "Patience is key and he should already know this if he has any experience. Long slow fore play to get you wet and aroused. Oral on you until you have an orgasm seems to help. Use a lot of lube. Cowgirl position might the best position to start. You can control the depth this way. Do not be discouraged if you do not go the entire length the first time. It may take a few more times before you can take more length. Good luck."
        ]
    },
    "How come all pornstars can take huge dicks to the testicles?": {
        "title": "How come all pornstars can take huge dicks to the testicles?",
        "score": 46,
        "url": "https://www.reddit.com/r/bigdickproblems/comments/1dr82p4/how_come_all_pornstars_can_take_huge_dicks_to_the/",
        "content": "Are they using some sort of lube, or they get stretched and learn it? Every pornstar starts as a normal girl. How many of them had accidentally started their career, no idea. So they born sluts etc etc non sense to me as an amateur psychologist and people observer.  So how come now they can take big dicks and seems enjoying it? Any clues?",
        "num_comments": 38,
        "comments": [
            "Also, porn cocks are a lot smaller than you think. I dont know the actual messurements but like all the big names are barely 8. Its all smoke and mirrors mate. Camera angles and lights and positions to make the dicks look bigger and the girls look smaller. Also helps that a lot of the actresses are like 5ft nothing",
            "Now I'm not a big consumer of porn Nowadays. But I remember some people doing a tell all interview years ago. They said the average penis in porn is somewhere around six and a half inches. I thought that was crazy because when I grew up the myth was the average was 6 in. So my thought was most porn actors are only a half inch above average. I mean now we know six and a half inches is big but most of them aren't monsters. Then you find out later that most of these actresses are like 4 ft 11 and weigh 100 lb with tiny hands. Then as many have stated above camera angles we wonder why most of these guys dicks glisten during scenes because they are drenched in the best lube. Then I've also heard porn actresses say when they do take one or two big dicks they have to take time off because it does fuck them up sometimes.",
            "They are acting. Even when it hurts they act as if it was so pleasurable.",
            "I have no idea wtf this question is asking really",
            "Not all porn stars can take huge dicks to the testicles.",
            "The number of times I've stopped watching a video because he wasn't huge and she wasn't taking the bottom 2 inches, says algorithm may be an issue.",
            "I’m bigger than most porn stars and in my experience, after enough foreplay/orgasms, most women can take almost all of me. But a lot of guys don’t want to hear that🤷🏻‍♂️",
            "I'm now retired. I'm married (hung) gay. So I take his cock on a regular basis it's been almost 8 years together. I'll say I'm an expert bottom I'll take any size. 5'3 135.\n\nPorn shoots: Photos are edited, the vids are 30-1hr  we shoot for hours at a time. So that equals breaks for my hole. Most tops take Viagra, I have taken bigger cock in private then in porn.",
            "How do you get to Carnegie Hall?",
            "They just got that deep dish pussy. Babies come out those motherfuckers so if they take big dicks all day (4-5 shoots a day) that shit gets blown out. It does go back to normal eventually but the booty does not, porn stars who do too much anal end up in diapers early"
        ]
    },
    "Can’t enjoy porn with smaller dicks": {
        "title": "Can’t enjoy porn with smaller dicks",
        "score": 4,
        "url": "https://www.reddit.com/r/bigdickproblems/comments/1drbrod/cant_enjoy_porn_with_smaller_dicks/",
        "content": "Is this just a me thing?\n\nWhen I’m watching porn, I kind of put myself in the scene and imagine it’s me with the girl, but I can’t get into it unless the guy is at least close to my size.\n\nWhen I come across a video with an average/above average guy, it just takes me out of it because it doesn’t represent the kind of sex I’m used to having. In real life, I enjoy the size comments, the struggle to fit it in and the involuntary sounds that come out of my partner from being filled. You see that sometimes, but it’s usually theatrics(which is why I strictly seek out amateur videos).\n\nUnfortunately, finding amateur videos with guys my size are few and far between😅",
        "num_comments": 7,
        "comments": [
            "Same.   It’s has to be same size as me or bigger to fantasize myself in the situation",
            "Yeah, that was one of the things that led me out of the insecurity journey, since I was bigger than some of the 'big dick' porn I saw. Since I'm about 8, I just don't like average or even slightly above average anymore. I don't really watch porn anymore, so it isn't that big of an issue.",
            "I’m kind of the same.",
            "Very relatable, I only watch videos with guys that I think r my size r just obviously bigger then I am. I also like to envision myself as the guy in the video so it helps when I’m similar to their size",
            "Make sense. Folks like to envision themselves / live vicariously through the porn as if they're the person having sex; it'd make sense one would want the person to match them as much as possible",
            "Not a huge fan of dicks in my porn, TBH.",
            "Yep exactly. Same here."
        ]
    },
    "I hate that the thickness makes it look smaller  ": {
        "title": "I hate that the thickness makes it look smaller  ",
        "score": 24,
        "url": "https://www.reddit.com/r/bigdickproblems/comments/1dr2gzg/i_hate_that_the_thickness_makes_it_look_smaller/",
        "content": "I had a threesome MFM and the girl had told me that this guy had a longer dick than me, but when we actually compared it, actually i was just a little longer than him but WAY thicker. At the end that girl tod me it was a perspective thing. I’m 7x6 but the fact that my girth is close to my length makes it look like a 6in dick and f that perspective I hate it ",
        "num_comments": 36,
        "comments": [
            "I’d still rather be thick, than less thick",
            "I understand your frustration, but I’m much happier being thick than I would be just *appearing bigger*.",
            "I know how you feel. I have bad dysmorphia about mine. I have always thought I was kind of thick but a bit on the short side. Also dosent help that I am a large frame guy with large thighs and a bit of a belly. Almost every woman I've been with has made commitments about my size, which I always attributed to girth. But I am slowly starting to realize I have a very large dick.",
            "How it feels is way more important than how it looks.\n\nWomen could come back to you if it feels amazing, not its appearance since they might never look at it and only you really care.",
            "Real, I’m 7x6.5 so it’s really similar in dimensions so it doesn’t look as large as it is and especially in film doesn’t look that big although it is. It’s a dysmorpia thing but it is literally larger tho lol so I’m chilling haha",
            "I have the same Problem, tho I never really thought that it was small cause I'm pretty small myself. Just 5'2 ft guy but having a 6'3 length, 6'1 girth lol. It might be that you are a big guy yourself and kinda gives you that impression ?",
            "I feel you lol, I’m tall as well",
            "I’m thick but still always wanted to be thicker (well aware I have dysmorphia) there’s something about that meaty and heavy look. Thinner dicks just don’t have that effect. No offense to anyone this is simply my opinion/taste",
            "I hate my dick long and average girth. It makes mine look thin. Lol",
            "Same here bro my measurements are 6x6 it looks like a 4 inch dick"
        ]
    }
}