{
    "Law firm layoff tracker": {
        "title": "Law firm layoff tracker",
        "score": 612,
        "url": "https://www.reddit.com/r/biglaw/comments/12hu54b/law_firm_layoff_tracker/",
        "content": "**UPDATES**: The layoff tracker has been updated - you can see health and severance package details.  Please note - if you want to filter, sort or search, it needs to be viewed on desktop.  For those of you who were impacted, please reach out (there are two law firms who contacted us and say they're hiring.  We're just verifying some info with them to get a better sense of the opportunity) \n\n**LAUNCHED**: Please check out [lawlayoffs.com](https://lawlayoffs.com) (best viewed on desktop for now) - it is a work in progress, but you can see the submissions from today.  Please share widely and submit any intel you have on layoffs.  Even for the widely known cases, it helps to get information about health, severance and comp packages (hopefully this creates a gap between those who treat their associates well on the way out versus those who ruthlessly axe budding associates' careers).\n\n**UPDATE**:  Here is the link for anon submissions: [https://airtable.com/shrxA7A8A0wBa7RlY](https://airtable.com/shrxA7A8A0wBa7RlY).  We have White & Case, Mintz Levin, Moritt Hock & Hamroff so far.  Please keep them coming. Even for these firms, it's likely the case that people in one office don't know what's happening in another, so please submit if you're aware of anything.\n\n\\----------Original post:\n\nI'm building a comprehensive layoff tracker for law firms that relies on input from anons, but is filtered so offensive sh\\*t isn't posted for everyone to see.  I would love people's input.\n\nTo start, we'll be documenting:\n\n* Firm Name\n* Layoff Announce Date\n* Office(s)\n* Number of People Laid Off\n* Source\n\nPlease let me know in comments if you think we should capture/ask for any other types of info.\n\nThe plan right now is to put it on a website that doesn't require you to provide any personal emails to access while still maintaining basic security measures (difficult on google spreadsheets, so looking at one good alternative).",
        "num_comments": 99,
        "comments": [
            "The mods should pin this post",
            "Just an innocent few years ago we were tracking admissions waves in the law school admissions reddit. Now Big law reddit has a layoff tracker, wish I had known this back then.",
            "Firing people who didn't pass the February bar is not a layoff. Firms have always only given you two chances",
            "I think its interesting that theyve chosen to cut back on legal salaries vs other expenses that have ballooned since going back to the office such as meals and travel",
            "People are already beginning to submit information - thank you!   \nWe bought the domain (will reveal shortly, when ready) and are building the front end for this right now as I type this.",
            "The Paul Weiss scoop isnt truea number of foreign associates are currently waiting for the firms decision on relocation. There were no layoff decisions made yet.",
            "Honestly expected better from Paul Weiss",
            "30 days for Sheppard Mullin is *rough*. That's pretty out of the norm isn't it?",
            "This is really depressing.  I really hope things turn around soon.  Feels like (shudders) 2008",
            "I cant seem to access the spreadsheet with the available information. The link only works to submit anonymized info."
        ]
    },
    "2024 Recruiting Season Megathread: All OCI, which firm, interviewing, etc. questions go here": {
        "title": "2024 Recruiting Season Megathread: All OCI, which firm, interviewing, etc. questions go here",
        "score": 54,
        "url": "https://www.reddit.com/r/biglaw/comments/1djwto1/2024_recruiting_season_megathread_all_oci_which/",
        "content": "All new stand alone threads will be removed ",
        "num_comments": 193,
        "comments": [
            "Should I go to the highest ranked firm I get an offer from or the firm I like the best?",
            "How much does quality of work differ from firm to firm within the same market? And how does one go about discerning differences in quality of work beyond Chambers rankings?",
            "Davis Polk or Cravath? Interested in general corporate practice and would like to try out both M&A and capital market. Got offers from both firms. Which firm would provide the best training in terms of both M&A and Cap Market practices?",
            "Is it still early for people who haven't heard back from firms to start panicking? Pre-OCI is causing a lot of anxiety and people are already getting multiple offers, but I have not heard back from any single firm I applied to. (NYC and Chicago market; t14; around median for reference)",
            "Is there a third Morgan?",
            "im top 20 at a T25. life got shitty and have just started submitting applications. how cooked am i?",
            "What aspects of a job do you care about the most? The pay should be the same. So did you like the people? Which practice area and is the firm strong in that practice area? WFH policy? WLB? Whether theyre good to transition to in-house or other opportunities? Free meals? Location of office?",
            "I slowed down on applications because I got an offer from a V60ish, but am realizing after getting a callback from a V10 that I'm probably more competitive than I thought. Top 20 percent at a strong top 50 school. Approaching offer deadline for V60 firm. Should I just go long on myself, let my v60 offer expire, see what happens at callback, and more thoroughly apply to the V20 firms?  Even if I strike out will there still be spots at OCI? Are the summer classes already filling up?",
            "For NY Transactional: Sidley Austin or SRZ? I know SRZ has a good practice and probably better WLB, but is Sidley the better career move ?",
            "What is the general opinion of Fox Rothschild? I got a screener with their Dallas office and wanted to know what the opinion of the firm at large is. I dont know much about BigLaw."
        ]
    },
    "Socially iced... Should I cut my losses?": {
        "title": "Socially iced... Should I cut my losses?",
        "score": 35,
        "url": "https://www.reddit.com/r/biglaw/comments/1dr83f2/socially_iced_should_i_cut_my_losses/",
        "content": "4th year associate doing M&A in big law here. While I feel everything was fine in the beginning, the longer I stay in my practice group the more I realize how much I am being unabashedly ostracized socially. \n\nI get plenty of work, and generally receive very good feedback - but the partners seem to really adore one of the other associates who is my age, and while they do not seem to despise me and are friendly towards me, they clearly do not hold me in such high regard. \n\nI don't really have friends in the office, while this other associate is a social butterfly who is constantly receiving attention and hanging out with partners even out of the office - she literally does yoga with a partner and knows their children to the point of being give birthday cards by their children. There are regular work lunches to which I've never been invited - and many, many other examples I will not delve into here.\n\nI am not going to ever be able to compete with that. The pay is good and no one is particularly toxic, but this feeling of being out of the \"magic bubble\" is crushing - no one states that but I know I'll be thrown out of the bus in a second if the choice is between me and this other associate.\n\nShould I just cut my losses and lateral/ move teams? I feel like the longer I wait, the more I am actually losing precious time to go to a place where I'll actually be able to build rapport with partners who will appreciate me and have my back for real. ",
        "num_comments": 15,
        "comments": [
            "What are your goals? If theyre not to make partner, your situation seems totally fine until you decide to make a jump. Just be a professional. \n\nIf you want to make partner, is this other associates work actually good? Is the other associate intent on making partner? Some people are beloved and go in-house anyway because thats what they want.",
            "The partner is definitely recommending the other associate for partnership over you, but it doesn't mean she hates you.",
            "Yeah that is weirdly close relationship. Abnormally so. Dont try and compete with that but also dont use it as the benchmark you should be meeting.",
            "Every situation is different but odds are that you are over thinking it and everything is fine. there's probably also some things you could do to proactively improve the situation a bit. so i'd say take it in stride and see what you can do to make things better if work is otherwise going well.",
            "We had someone start at my firm and while she wasn't conventionally attractive, she instantly sparked romantic interest from three partners.  They staffed her on their trials, almost got into fights with each other over who would walk her home from evening events, etc.  She eventually married one of them.  I still can't explain it.\n\nAs long as you're not interested in THAT kind of attention, I would rather be in your position than the other associate's.",
            "It's work, not a social club. The other associate's very close relationship is not the norm. Sometimes people just click perfectly, it's a rare thing, and that it seems to have happened to this other associate and not you is not a cause for concern. If you like the work and people are professional towards you, no reason to leave.",
            "Idk if it actually matters or not career-wise, but just know that it doesn't reflect on your likeability at all to be ostracized by the most socially stunted people on earth (lawyers). I dread going to bar events now that I work in law-adjacent and am used to communicating with normal, healthy educated and well-rounded people.",
            "This.  At my old firm, we had several golden children in my practice group.  None of them stayed and made it.  You just don't know what the future has in store for everyone.",
            "I cant emphasize your first statement enough.  Im in-house and try and tell everyone this.  Dont look at your title and then get upset when someone you consider a peer is promoted past you.  You cant control anyone elses career but you can control (somewhat) yours.  Being in management, I can say its never just as easy as this person deserves it, sadly.   Id promote all my people every year if I canbut I cant.  Just not within the budget constraints we live in.\n\nBut I know its easy to say dont compare yourself to others, but really hard to control those feelings, especially when youre pretty young in your career.",
            "I'd like to make partner but I don't see myself groveling for years if the situation is too dire. I think I could wait it out until it's the right time to leave, but I don't know if I am making this choice because I feel I can't compete, you know?"
        ]
    },
    "🫡 🫗": {
        "title": "🫡 🫗",
        "score": 263,
        "url": "https://i.redd.it/ofb6d14vrd9d1.jpeg",
        "content": "",
        "num_comments": 9,
        "comments": [
            "Rest in peace my king",
            "may it rest in hell",
            "The flag ",
            "o7",
            "F",
            "W",
            "W",
            "",
            "F"
        ]
    },
    "It takes 2-3 hours to put my kids down to bed. How is this job doable for parents?": {
        "title": "It takes 2-3 hours to put my kids down to bed. How is this job doable for parents?",
        "score": 78,
        "url": "https://www.reddit.com/r/biglaw/comments/1dqyybh/it_takes_23_hours_to_put_my_kids_down_to_bed_how/",
        "content": "And that excludes dinner. Kids are at a hard age and having a hard time with some stuff. I can’t with this job and also be a parent. I don’t get how this is possible. \n\n",
        "num_comments": 58,
        "comments": [
            "Dunno but Ive been running on an average of 4-5 hours of sleep most nights for the last four months since returning from maternity leave. I am probably a candidate for keeling over at my desk. My toddler also takes about 2-3 hours to go down. My baby had been a good sleeper but recently decided I didnt have enough going on and is having major FOMO.",
            "Morning person, parent of two, its so hard. I find it excruciating to logon after bedtime. Im exhausted. Actually in the middle of bedtime as I type.\n\nDuring a particularly tough patch, we staggered bedtime and put my youngest to bed first, and that helped a bit because they had been keeping each other up. That advice may be completely irrelevant for your kids but fwiw.",
            "Hire a sleep consultant. 3 hours sounds unusually long.",
            "My kid takes one hour and Im at my breaking point. I cant even imaginehang in there and I hope it gets better soon",
            "Are they sleeping too much during the day, and not really ready for bed?  We had to work with our nanny to cut the afternoon nap so that we could maintain a normal bedtime.  She liked the break during the day, but we were spending way too long at night getting the kids settled.",
            "Non-parent here.  Why does it take that long?",
            "Just when I thought about having kidsthank you for your service ",
            "Time management skills.  Nannies and parents and significant others. Recognizing you can't do everything and also that you don't have to do everything. \n\nAlso, the more senior you get the more you control your own schedule.",
            "Not sure your situation, but I work like 7:00-5:30 and can bill about 40 hours per week without doing weekends or nights. Obviously not possible in some practice groups or if you need to be around in the morning, but if the early morning is possible it's a good option",
            "Because currency can be exchanged for services and goods."
        ]
    }
}