{
    "I 3D modeled and painted the Patty Wagon! 🍔": {
        "title": "I 3D modeled and painted the Patty Wagon! 🍔",
        "score": 458,
        "url": "https://www.reddit.com/gallery/1d55f13",
        "content": "",
        "num_comments": 21,
        "comments": [
            "\"You don't need a license to drive a sandwich\"",
            "Omg thats awesome! Do you have an STL for it? My dad 3d prints some of his models for WH40k and I would love to print this! I'm assuming you used PLA and not resin right? (Don't worry he has 2 of each lol)",
            "If Nickelodeon is smart enough, they should definitely make some models for adult collectors to celebrate the 20th anniversary of the movie later this year.",
            "Thats amazing I want one",
            "That looks amazing dude. All I need is a little spongebob and Patrick in there",
            "Now that's a ride to Krusty Krab in style, toot toot!",
            "Bro, where's the drive-thru window? Missed opportunities!",
            "Yes this is PLA! And I cant give the stl out because Im currently selling this one on my etsy store :)",
            "\"$101 for a Patty Wagon?\"\n\n\"With cheese, Mr. Squidward. With cheese.\"",
            "No sorry, Im selling my this one on my etsy store so I cant give the stl :("
        ]
    },
    "Uhh......yeah": {
        "title": "Uhh......yeah",
        "score": 1464,
        "url": "https://v.redd.it/sz5866egad9d1",
        "content": "",
        "num_comments": 36,
        "comments": [
            "Will never hear this song the same anymore",
            "911 id like to report a crime",
            "this was my first time scrolling on reddit lmfaooo",
            "I love these, please never stop making them",
            "Hey Sponge can I borrow a quarter?",
            "Am I the only one who thought Riptide was another song by The Guy Who Made the Spongebob pilot Song lol?",
            "Oh gee, I wonder how much more stupid people can get.",
            "I don't know what the original lyrics are supposed to be. All I have heard is what was shown above.",
            "I had to go back and listen to this song to check if it was edited for the meme. Nope. I can never unhear it now.",
            "I've been on the internet for to long to day. I read \"9/11 I'd like to report a crime\""
        ]
    },
    "Every single day": {
        "title": "Every single day",
        "score": 33,
        "url": "https://i.redd.it/epygsoloxi9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "I'm almost 27 now. Barely drink any liquir, coffee and don't do any kind of drugs.\n\nI get it now."
        ]
    },
    "That's gonna be the end of me ": {
        "title": "That's gonna be the end of me ",
        "score": 2906,
        "url": "https://i.redd.it/u56kxvhfjb9d1.jpeg",
        "content": "",
        "num_comments": 49,
        "comments": [
            "These moments always gave me anxiety. I loved when the teacher just told you who to work with, so you didn't have to awkwardly find someone you barely talked to when you*KNEW*they didn't want to work with you but they were just being nice if they said sure. God, I hated it",
            "I'm the weird kid here",
            "Im just asking to work alone",
            "At some point in your life, one has to admit we both were the weird kid.\n\nI was always thankful when a teacher allowed me to do the assignment on my own.",
            "It was always a special kind of sad to discover you're the third wheel of a buddy trio in this manner.",
            "This is me except theres no kid that wants to pair up with me and i end up doing it alone",
            "Who wants to tell them?",
            "I remember doing a one-day robotics thing at the public library when I was in high school. Not a full-on class, not a long-term project, just a thing where a bunch of kids went in for a single day and worked on something and then showed everyone else what they did. One of my friends just so happened to be there too, so when the instructor said we'd be working in pairs we fistbumped. Douchebag immediately caught it and said \"nope, I'm gonna split you guys up and assign groups.\" Like, if it was a long-term class I could understand it. You want students to focus on the project and not goof off with their friends (although based on me and my friend's personalities, we would've hyperfocused on the task anyway). And you don't want kids without friends to feel left out. But this was just a one-day fun little thing at the fucking library. We were literally the only two people there that knew each other. We weren't getting graded, we weren't going to take this project anywhere else, it was just supposed to be a fun learning experience. There was no good reason to split us up. And yes, I am still salty at that asshole instructor.",
            "Time to try your luck with that girl you like in class! If she turns you down, opt to work alone haha.",
            "Mr krabs eyes here make me super uncomfortable. The tops look more like socks or some shit he has placed over his eyes, rather than eyelids"
        ]
    },
    "Good job me boy!": {
        "title": "Good job me boy!",
        "score": 908,
        "url": "https://v.redd.it/pissjmhnuc9d1",
        "content": "",
        "num_comments": 16,
        "comments": [
            "America needs this after last nights shit show",
            "This is my favorite thing on Reddit.",
            "I come here for this weekly.",
            "Thanks  \nNice to have my birthday on a Friday this year.",
            "Appreciate this a lot! This post makes Friday  much better in the end",
            "I was made redundant so not sure how much of a win this is tbh lol",
            "Continuing my petition here to have it be a perfect loop so I can just hit here for a long time and enjoy it",
            "Wait you guys watched that shit?",
            "Yeah this guy better never stop",
            "I was torn between avoiding brain cell loss from watching it, and not wanting to miss a historical debate between an orange and a boiled potato."
        ]
    }
}