{
    "BUMBO DENIERS IN WHAT??????": {
        "title": "BUMBO DENIERS IN WHAT??????",
        "score": 534,
        "url": "https://i.redd.it/knlx6o3iff9d1.jpeg",
        "content": "",
        "num_comments": 34,
        "comments": [
            "instant update: picking this up with my reflection was not the best idea",
            "Woah that is a nice my reflection right there… ![img](emote|t5_2sxpk|2357)",
            "my reflection chilling in the bottom right:",
            "How to lose a run in 1 easy step:",
            "Bumbo denied your run with that :b amazing pick up, not so amazing synergy 😂 there’s always next run :)",
            "I FUCKING LOVE BUMBO ![img](emote|t5_2sxpk|17743)",
            "Bumbo deniers in psych wards after losing a perfectly winnable game ![img](emote|t5_2sxpk|2357)",
            "bumbo once dropped me an r key (i lost the run)",
            "I very much don't f with b",
            "In wealth and prosperity rn. Never been so happy to be a bimbo denier"
        ]
    },
    "Thank you edmund 🥵": {
        "title": "Thank you edmund 🥵",
        "score": 68,
        "url": "https://v.redd.it/co29jfa7yh9d1",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Rock bottom then mega mush?![img](emote|t5_2sxpk|2357)",
            "What is the paper item?",
            "Rock bottom then soy milk",
            "it's death certificate, you get it after doing ALL marks in HARD with EVERY character in the game \n\nit's a one time active that will make you go to a floor with every item in the game, you can choose one and you'll go back to where you were",
            "You can get one item among all the items in the game",
            "Mega mush is just better ![img](emote|t5_2sxpk|17745)",
            "Just like the audio all you need is the adult transformation",
            "Rock bottm soymilk😋",
            "Mattman moment![img](emote|t5_2sxpk|2357)",
            "HOWWWW"
        ]
    },
    "What would you have chosen in this situation? (Ignore Gabriel btw)": {
        "title": "What would you have chosen in this situation? (Ignore Gabriel btw)",
        "score": 393,
        "url": "https://i.redd.it/gmy2q56hxe9d1.jpeg",
        "content": "I chose Dead Dove, and believe it or not, I got Haemolacria in the treasure room which I think went well together. But with that info, what would you have picked?",
        "num_comments": 55,
        "comments": [
            "I'm taking holy light and not looking back",
            "I think Dead Dove was still the right choice. Holy Light is solid, but with you running maggy and Missing two hearts I am assuming (I could be wrong on this) that perfection was probably not on the table. Having flight and spectral is also pretty much always great too, so that's what I would do\n\n(If you sacrifice roomed into an angel deal on B1 then perhaps I would have taken holy light)",
            "Dead dove for sure.\nFlight immediately pays off for your defensive game and your ability to get otherwise unobtainable pickups.\nIf I can't get flight early on, my next option would be the ladder.",
            "Just P-ranked gabriel 2, I am in fact MORE than nothing(barely)",
            "I’d probably take Dead Dove if it’s B1 since guaranteed flight is incredible",
            "THERE CaN BE ONLY (HOLY) LIGHT!",
            "I should add, this was from a sacrifice room on B1. I also got The Relic from the next sacrifice so I put myself at 1 heart",
            "I personally value flight and spectral tears very highly. Flight just opens up the game so much and makes you much more safer with more mobility. And spectral tears allow you to take cover behind rocks and such when things get hairy.",
            "Bomb the angel statue for a Key Piece.",
            "dead dove early game - gives you an edge (flight)  \nholy light late game"
        ]
    },
    "Oh no he fell!": {
        "title": "Oh no he fell!",
        "score": 94,
        "url": "https://i.redd.it/rf51vskt2h9d1.jpeg",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Good, fuck Adversary and his shitty homing brimstone.",
            "It's pretty easy to dodge if you constantly walk around him",
            "Omori be like",
            "I Omor?",
            "Ayo the pizza here",
            "Literally omori",
            "double adversary"
        ]
    },
    "Diagonal Larry": {
        "title": "Diagonal Larry",
        "score": 496,
        "url": "https://i.redd.it/2bg7bmqtae9d1.png",
        "content": "",
        "num_comments": 18,
        "comments": [
            "ha That's good. I had to look up what his name is",
            "I only know him by the name “diagonal Larry Jr.”",
            "Larry but quirky and without the funny delirium glitch",
            "Oregan- wait wrong sub, original comic?",
            "I swear I can’t remember the diagonal Tuff Twins name and thanks to Mattman I call them Rapscallion",
            "I feel somewhat responsible for this, but I know many people before me have made the same mistake.",
            "the only boss i remember the name of is bloat, he sucks (and i only hate him because for some reason i always get the champion variant)",
            "I call him DVD Jr.",
            "Since when is IT a meme that Nobody knows Holloway Name? Always thought that everyone knows it",
            "I had to look it up but The Shell"
        ]
    }
}