{
    "New Rules - please read!": {
        "title": "New Rules - please read!",
        "score": 154,
        "url": "https://www.reddit.com/r/Biohackers/comments/or69qp/new_rules_please_read/",
        "content": "Hi Everyone,\n\nApologies for the delay, but here are some mostly finalized new rules for the sub - let us know if you’ve got questions! These are the rules that were publicly voted in by majority via the Phase 2 poll. \n\n**1.** Only clinical professionals (physicians, nurse practitioners) may give direct medical advice to others.  \n\n1A. Direct medical advice is anything that directly advises someone on a specific treatment for a specific indication. For example, “take X, it will treat your Y condition” - only clinicians can say this.  \n\n1B. Indirect medical advice is allowed by all users. For example, “I read/conducted/tested X treatment and found it is effective for Y condition, here is the information, you should consider it.”  \n\n**2.** Recommendations that aren't medical advice should supply safety information for procedures or compounds.  \n\n**3.** Always include a source if you're stating something has been proven in the scientific literature.  \n\n**4.** No Pseudoscience; unsubstantiated claims of curing something with \"X\" should be removed. See rule 2.  \n\nA. Pseudoscience: Things in direct  contradiction to scientific consensus without reputable evidence.  \n\nB. If such comments are deleted, mods should provide a clear reason why.  \n\n**5.** Implementation of a 3 strike system unless the subject is clear advertising/spam or breaking Reddit content policies, resulting in an immediate ban.  \n\n**6.** N=1 Studies should be ID'd as such with flair and not overstate the findings as factual.  \n\nWe hope this will help to ensure the scientific quality of information people find here. Again, let us know if you’ve got questions, and when in doubt, feel free to ask a mod first.  \n\nCheers!",
        "num_comments": 151,
        "comments": [
            "This is really against the whole point of biohacking.. If we ONLY went on the 'scientific consensus' we'd almost never have breakthroughs\n\nScience has been proven wrong literally countless times, throughout history.. More than ever the 'mainstream science' we've been choked by in 2020 is ALREADY proveably wrong.. \n\nWhy the weird new rules?",
            "Honestly fuck these rules",
            "These are great rules!",
            "How will you even make sure a said person does have a degree. Because this is reddit everyother person is a professor in said subject when asked you can't just trust people on the internet who say they are this or that.",
            "Thank you for banning all the Covidiots. Man, you're the only one keeping this sub good.",
            "\"\"Pseudoscience: Things in direct contradiction to scientific\n\nScientific studies usually exclude people who are outliers.  What if someone wants to make a comment specific to certain outliers that are never included in the scientific consensus?",
            "why are these rules here they will stifle conversation",
            "1. Monoamine deficiency hypothesis was scientific consensus for a long time, while it was flawed as fck from the beginning. Even worse, some ‘professionals’ still try to sell it.... The point is logical reasoning. Claiming somethings cures it is flawed, yes, but something that is contradictory to consensus does not equate to pseudoscience.\n\n2. Someone interested can also ask for a source or just Google it, which idiot just takes someone’s word without checking themselves.... It just lowers the possibly interesting input. Additionally, for example take Semax, most literature is only available in Russian. \n\n3. The purpose of biohacking is literally to go a step further than just going to the doctor, for example for the purpose of enhancement, which is barely to not at all researched. Mostly based on findings in animal studies combined with theoretical/logical reasoning. \n\nA Reddit is not about writing papers, just discussion and potentially new suggestions which you can then research yourself in papers. But nah, dumb and lazy people don’t do their own research and just take it from Reddit directly....",
            "Possible alternatives that i know of: /r/Bio_hacking /r/Biohacked /r/sleephackers",
            "It’s sad to see that the basic premise of this culture has been corrupted.  So long and thanks for all the fish."
        ]
    },
    "Seeking new moderators in other timezones": {
        "title": "Seeking new moderators in other timezones",
        "score": 18,
        "url": "https://www.reddit.com/r/Biohackers/comments/1bewqmt/seeking_new_moderators_in_other_timezones/",
        "content": "We are seeking qualified scientists who are interested in moderating the sub to protect users from pseudoscience, ideally from Europe or Asia that can cover other timezones to shore up moderation gaps.\n\nIf interested, please reply below or DM me with your resume and/or portfolio of work in biohacking.\nWhile degrees are good to have, we recognize citizen science can happen anywhere- something like a personal lab notebook can be enough for us to evaluate candidates.\n\nThis is an unpaid role where moderators volunteer their time. We definitely wish we could get paid haha but so far it’s just a feeling of purpose, sorry.\n\nWe have no expected contribution quotas- moderate at your own pace and when you feel like it, as we recognize how large of a task this is and how most qualified individuals are full time professionals in the field.",
        "num_comments": 8,
        "comments": [
            "Hi. How GMT -3 hours (Brazil) Works for you guys?",
            "Interested, Will DM you too",
            "From India \n\nMasters in Biotechnology background",
            "I could help but unsure you need another PST mod. I have a BS in electrical engineering. And currently post grad student in biology.",
            "As a scientist passionate about combating pseudoscience, I would love the opportunity to contribute as a moderator for this important cause. I believe that my background in biohacking and dedication to upholding scientific integrity make me a strong candidate for this role. Thank you for considering my application!",
            "Interested\nPhilippines, have BS in IT",
            "Ah this sucks. People should be allowed to talk about whatever they want.  \nThe scientific method, has largely been corrupted, for a very long time.\n\nDoesn't take a scientist to figure that out ...  \nFocus should be more on removing low quality posts rather than deciding what people can discuss.\n\n(Autodidact contrarian polymath who healed himself and others  by going completely the opposite direction of the western health consensus)",
            "It is still fine, dm me your CV"
        ]
    },
    "Do you ever feel like something is missing in your life?": {
        "title": "Do you ever feel like something is missing in your life?",
        "score": 116,
        "url": "https://www.reddit.com/r/Biohackers/comments/1dquzon/do_you_ever_feel_like_something_is_missing_in/",
        "content": "I get 8-9 hours of sleep, workout daily, 12,000 + steps, eat all Whole Foods, sunlight, all that stuff, but constantly feel like something is missing in my life ",
        "num_comments": 157,
        "comments": [
            "Our purpose in life is to help others along the way.",
            "Relationships?",
            "Seek to nourish the mind and spirit, not just the body",
            "Connection with humans, relationships, marriage, children. It all drives a purpose.",
            "The biggest thing the longevity/biohacking community miss the mark on is social connection and fulfillment. The emotional health aspect. You can have the most perfect routine ever but if you’re emotionally unstable— you still are at severe risk for disease (and not enjoying your life).",
            "Same bro lmk if u find a solution lol",
            "humans need volatility… highs and lows… trying to make everything perfect will never work cuz struggle is endemic to nature",
            "Try thinking about things this way—everything you listed is just taking care of your body so that it’s healthy, strong, and will last a long time. But “taking care of your body” isn’t an end goal or purpose; it’s just something you do so that you can do all the other things, the ones that matter.  Like if you listen to older people talk about why they want to stay active and agile, they’ll say something like “I want to be able to run around with my grandkids.”\n\nIf you want to be able to drive your car on road trips, then you change the oil, fill it with gas, and do other maintenance. But all of that is so that when it’s time to toad trip, the car is good to go.  Your body is the car. You’re putting all the effort into the maintenance. But what’s the road trip?  Now some people are really into the maintenance for its own sake, like a hobby. In biohackers, these are the ones that are just fascinated by the science, the studies, their own little experiments. Which is fine! But MOST people who are trying to push the boundaries of their health span and lifespan are doing it because the life they’re living is something they want to keep.  But it sounds like you’re doing all the maintenance and expecting that, in itself, to be fulfilling and it mostly isn’t. It’s just a means to an end and the end is EVERYTHING ELSE in your life. Your job, your family, your relationships, friendships, hobbies, interests, plans, goals, dreams. THOSE are the reasons you keep your meatsuit in peak condition.",
            "Having a healthy body is important, but the purpose of life, besides just existing, is to experience things, to learn and to explore, and to try different roles. Don’t underestimate intellectual and emotional fulfillment. Get to know yourself better to know what that means specifically for you. If you’re stuck, therapy might be helpful. It’s not just for trauma recovery, it’s also great for reconnecting with your true emotional needs, especially if you’ve been intellectualizing and repressing them for years.",
            "Human connection. Everything can be right but humans need community"
        ]
    },
    "A Fundamental Truth of Life That This Sub Overlooks is that Subtraction > Addition  ": {
        "title": "A Fundamental Truth of Life That This Sub Overlooks is that Subtraction > Addition  ",
        "score": 91,
        "url": "https://www.reddit.com/r/Biohackers/comments/1dqr750/a_fundamental_truth_of_life_that_this_sub/",
        "content": "So many of the things discussed on here are adding things to your life - new habits, protocols, supplements - but these things often have, at most, marginal benefits and, in some cases, can be damaging. \n\nThe real gains come from stripping back your life and just leaving the bare essentials. So many people now overtrain, for example, and have unbelievably elaborate exercise routines which can be draining in the long run and harmful to the nervous system. The same with excessive protein consumption and overeating when weight training.\n\nWhy do you think it is that so many biohackers don’t look great? You’ve got to trust your eyes sometimes and Bryan Johnson doesn’t look much better than Hunter Biden. Ben Greenfield and Asprey also don’t look amazing which is a surprise given the extreme biohacking they do. I think there’s a lot to be said for taking your foot off the gas with the self-optimisation and looking at stripping back your life as much as possible. That’s what I’ve done recently and I’m feeling great.\n\nMy life has improved most from subtractive things like fasting, cutting out alcohol, reducing the length of my gym sessions, less screen time, and especially reducing the amounts of habits and things I have to do from a health and fitness point of view each day. \n\nInterested to hear some other perspectives. Thanks.",
        "num_comments": 34,
        "comments": [
            "Bryan J called subtracting the most important thing.",
            "I don't know who Bryan Johnson is or what he does but I just looked him up and he looks 1000x better than Hunter Biden. What pictures are you comparing, good sir?",
            "Totally agree with the overall sentiment.  Life is as complicated as one chooses to make it.  Minimalism is a freeing philosophy when implemented right.  Less stuff, less supplements, less food, less anxiety - enjoy the simple things.",
            "The worst example of this is people taking supps to compensate for lack of exercise, poor diet, drugs, and alcohol.",
            "Agreed. I view people like Bryan as doing a social service though, 80% of what he does will probably not work but the 20% that produces crazy results if combined with the subtraction approach could yield great results.",
            "Personally I'd need to see some damn good results from fasting to be willing to keep it up. I tried it for a couple months and nothing happened. No increased energy, no mental clarity, I was just irritable, scatterbrained, and tired until I ate food.",
            "Well said, many are trying to compensate I think. Too much stress, drink or smoke or drugs or something of that nature.",
            "lol for Bryan Johnson he’s crushing every measurable health metric. I’d hope people aren’t just biohacking for looks only, he’s just a weird looking dude but don’t equate him being weird looking to not being insanely healthy (and also doing a service to all biohackers everywhere)",
            "Cutting out caffeine and sugar have been the two biggest changes easily, maybe Omega 3 daily has been also as large but Caffeine was legit like a new world. \n\nAnd fasting goes without saying.\n\n> So many people now overtrain, for example, and have unbelievably elaborate exercise routines which can be draining in the long run and harmful to the nervous system. The same with excessive protein consumption and overeating when weight training.\n\nAgreed, I like the middle path, do the right shit but don't overthink it or have strict rules. \n\nI also think a big failure in this scene is the massive stress people seem to put on biohacking or longevity or whatever it is they fixate on. \n\nReminds me of the guy from Prometheus, chasing immortality but sacrificing his actual life to do so. \n\nI have a Phd in ageing but feel like I spend a lot less time focused on ageing because of it. Bus-man's holiday kind of thing. \n\n90% of the advice and results you can get are from small habits and simple rules that shouldn't take over your life, and frankly then most people should just quit the 'scene' and focus on what actually gives a good, long life, which is climbing the Maslov's pyramid and then reading some Frankl and also spending as much time as possible with family and friends. \n\nWhen you get the message, hang up the phone.",
            "I agree with the subtracting part. It’s like learning to use an equalizer in music production. At first you might think adding all sorts of frequencies is best, and later on you’ll find yourself more and more just cutting out what you don’t want. It frees up more energy to turn everything that does work up.\n\nI don’t agree with bryan, ben and dave looking awful though. For their age i think they all look great. The most questionably looking i think is dave asprey, but im guessing there’s a big chance his past life choices have affected his looks. Still imo they all look great for their age."
        ]
    },
    "How many of you don't take supplements?": {
        "title": "How many of you don't take supplements?",
        "score": 65,
        "url": "https://www.reddit.com/r/Biohackers/comments/1dqorsq/how_many_of_you_dont_take_supplements/",
        "content": "How many of you don't take supplements but have a healthy diet, drink enough water and exercise? Biohacking is much more than supplements.",
        "num_comments": 128,
        "comments": [
            "That’s my goal. I’m down to just 3 supplements: vit d3+k2, magnesium, and iodine. Everything else I get 100% RDA from food. I eat grass fed meat, pasture raised eggs, whole fat dairy, organic fruit, and organic vegetables. Exercise 6-10 hours per week. 4000-5000g water daily. 30min of sunlight daily. It’s been a fun journey learning to truly biocheck and feel amazing everyday 🙂",
            "Why is everything so black and white for you goobers?\n\nEat a healthy diet & take supplements, bam problem solved. Every person is different, what works for you, will likely not work for me, or somebody else. Here, I'll give you an example. Everyone knows that biotin is a useless supplement, right? Well turns out I am actually biotin deficient, it was found out through my blood work. During periods of stress like say, having the flu, my biotin levels can drop dangerously low.\n\nDo you know what I do? I supplement with fucking biotin.\n\nIf you're someone easily influenced by this shit, go to a doctor and get your blood checked, THEN actually look at the levels, because although you may have an acceptable level according to medical standards, your lifestyle and metabolism may need more of a nutrient than even the doctor says. Prime examples are zinc and iron.",
            "I take zero supplements. Not even pre-work out.",
            "Y’all must be young whipper snappers lol! Get to your 60’s and you may decide to increase your supplementation. Normal metabolic pathways will benefit from a little boost.",
            "Less is more. Unfortunately, food doesn’t have as many nutrients as it used too.",
            "I'm banned from /r/supplements. Long list of censorship at this point though. \n\nSupplements I use periodically on cycles. Like every other input, they can displace endogenous balances, create desensitization, addiction, withdrawal, etc. \n\nMagnesium caused heart palpitations/arrhythmia. \n\nWhat was most probably due to B6 caused nerve pain. \n\nNAD+ is a good ally, but way better through IV. Oral and even IM doesn't compare at all. \n\nDigestive enzymes make a positive difference. \n\nDHEA heightens energy, mood, and libido, but raises too much DHT. \n\nPregnenolone also bestowed energy, but raised what felt like too much cortisol. \n\nMeditation in direct sunlight is a potent activator. \n\nI had a powerful stack going for awhile with a myriad of supplements that caused overactive immune responses, so I got a psoriasis breakout. \n\nBalance is key.",
            "Even if someone had “the perfect diet” I still believe they would be deficient in at least some areas. Nothing we eat is as rich/full of nutrients as it should be/used to be. Biohacking is totally much more than supplements but unfortunately I think supplements do a lot of help these days.. when it’s to supplement the right things you actually need.",
            "I wasted alot of money on supplements over the years creating expensive piss.",
            "Caffeine\n\nCreatine\n\nProtein\n\nMagnesium",
            "I used to take a bunch, now I'm basically down to creatine and fish oil. I think I was addicted to the concept of supplementation. More recently I began to doubt the wisdom in taking advice from people on the internet (sincerely no offense intended) and became concerned by reports linking excessive supplementation to health issues such as cancer.\n\nSupplementation is a major industry and there's very little regulation, so I figured I should start being more skeptical."
        ]
    }
}