{
    "New Rules - please read!": {
        "title": "New Rules - please read!",
        "score": 153,
        "url": "https://www.reddit.com/r/Biohackers/comments/or69qp/new_rules_please_read/",
        "content": "Hi Everyone,\n\nApologies for the delay, but here are some mostly finalized new rules for the sub - let us know if you’ve got questions! These are the rules that were publicly voted in by majority via the Phase 2 poll. \n\n**1.** Only clinical professionals (physicians, nurse practitioners) may give direct medical advice to others.  \n\n1A. Direct medical advice is anything that directly advises someone on a specific treatment for a specific indication. For example, “take X, it will treat your Y condition” - only clinicians can say this.  \n\n1B. Indirect medical advice is allowed by all users. For example, “I read/conducted/tested X treatment and found it is effective for Y condition, here is the information, you should consider it.”  \n\n**2.** Recommendations that aren't medical advice should supply safety information for procedures or compounds.  \n\n**3.** Always include a source if you're stating something has been proven in the scientific literature.  \n\n**4.** No Pseudoscience; unsubstantiated claims of curing something with \"X\" should be removed. See rule 2.  \n\nA. Pseudoscience: Things in direct  contradiction to scientific consensus without reputable evidence.  \n\nB. If such comments are deleted, mods should provide a clear reason why.  \n\n**5.** Implementation of a 3 strike system unless the subject is clear advertising/spam or breaking Reddit content policies, resulting in an immediate ban.  \n\n**6.** N=1 Studies should be ID'd as such with flair and not overstate the findings as factual.  \n\nWe hope this will help to ensure the scientific quality of information people find here. Again, let us know if you’ve got questions, and when in doubt, feel free to ask a mod first.  \n\nCheers!",
        "num_comments": 151,
        "comments": [
            "How will you even make sure a said person does have a degree. Because this is reddit everyother person is a professor in said subject when asked you can't just trust people on the internet who say they are this or that.",
            "Thank you for banning all the Covidiots. Man, you're the only one keeping this sub good.",
            "\"\"Pseudoscience: Things in direct contradiction to scientific\n\nScientific studies usually exclude people who are outliers.  What if someone wants to make a comment specific to certain outliers that are never included in the scientific consensus?",
            "why are these rules here they will stifle conversation",
            "Possible alternatives that i know of: /r/Bio_hacking /r/Biohacked /r/sleephackers",
            "Its sad to see that the basic premise of this culture has been corrupted.  So long and thanks for all the fish.",
            "Lol good job ruining the sub.",
            "This is a bad idea for the sub. I see what youre trying to do but all its going to do is restrict information sharing and prevent learning. I have loved this sub but wont be sticking around if these are kept in place",
            "I thought these rules were great... then I hear the OP say the COVID vaccines were safe and effective, lol.  \n\nI still like the rules above, but it's important to remember science is always learning. A little humility is helpful, and a little distrust of the gov. narrative is life-saving.",
            "Is anyone enforcing these rules anymore? Most of the active mods in this thread appear to have been suspended, and in the last couple of days I've seen people pushing homeopathy, at-home miracle cancer cures, red light therapy to help people regrow their bones, supplements to change your hair color and make you taller, research chemicals and pharmaceuticals from online \"pharmacies,\" and anti-semitic conspiracy theories."
        ]
    },
    "Seeking new moderators in other timezones": {
        "title": "Seeking new moderators in other timezones",
        "score": 18,
        "url": "https://www.reddit.com/r/Biohackers/comments/1bewqmt/seeking_new_moderators_in_other_timezones/",
        "content": "We are seeking qualified scientists who are interested in moderating the sub to protect users from pseudoscience, ideally from Europe or Asia that can cover other timezones to shore up moderation gaps.\n\nIf interested, please reply below or DM me with your resume and/or portfolio of work in biohacking.\nWhile degrees are good to have, we recognize citizen science can happen anywhere- something like a personal lab notebook can be enough for us to evaluate candidates.\n\nThis is an unpaid role where moderators volunteer their time. We definitely wish we could get paid haha but so far it’s just a feeling of purpose, sorry.\n\nWe have no expected contribution quotas- moderate at your own pace and when you feel like it, as we recognize how large of a task this is and how most qualified individuals are full time professionals in the field.",
        "num_comments": 8,
        "comments": [
            "Hi. How GMT -3 hours (Brazil) Works for you guys?",
            "Interested, Will DM you too",
            "From India \n\nMasters in Biotechnology background",
            "I could help but unsure you need another PST mod. I have a BS in electrical engineering. And currently post grad student in biology.",
            "As a scientist passionate about combating pseudoscience, I would love the opportunity to contribute as a moderator for this important cause. I believe that my background in biohacking and dedication to upholding scientific integrity make me a strong candidate for this role. Thank you for considering my application!",
            "Interested\nPhilippines, have BS in IT",
            "It is still fine, dm me your CV",
            "Ah this sucks. People should be allowed to talk about whatever they want.  \nThe scientific method, has largely been corrupted, for a very long time.\n\nDoesn't take a scientist to figure that out ...  \nFocus should be more on removing low quality posts rather than deciding what people can discuss.\n\n(Autodidact contrarian polymath who healed himself and others  by going completely the opposite direction of the western health consensus)"
        ]
    },
    "What do people take for severe insomnia?": {
        "title": "What do people take for severe insomnia?",
        "score": 13,
        "url": "https://www.reddit.com/r/Biohackers/comments/1drb1mh/what_do_people_take_for_severe_insomnia/",
        "content": "I developed severe, chronic insomnia in 2020 while caring for a sick newborn. (He couldn’t sleep lying down so I held him for three months plus got up every 3 hours for changes & feeds.) My sleep never recovered. I’ve been on OTC sleeping pills (e.g. Unisom) ever since. I’ve tried numerous times to get off but then I’ll only get 30 mins to 2 hrs of sleep per night without it. I’ve currently been able to wean down to 50 mg sleep aid and 48 mg (1 capsule) Life Extension Nuero-Mag. I’ve tried melatonin, Nuero-Mag by itself, tart cherry juice, sleepytime teas, etc. and nothing has allowed me to get off the sleeping pills. I do sometimes take modafinil from modafinia to keep me awake throughout the day but lessened it. Has anyone else found a supplement that has helped with severe insomnia? Thanks in advance!",
        "num_comments": 20,
        "comments": [
            "I would suggest looking into cbt-i rather than any pills. Really helps when youve lost all confidence in being able to sleep.",
            "It's not a supplement but have you tried hypnosis? Probably your subconscious has internalized the idea that it's dangerous to sleep soundly because a baby might die! That's a powerful idea and it might help to see a hypnotherapist who can deprogram this particular idea, or even just listen to a sleep hypnosis recording when you go to bed.",
            "supplements wont work, you can try the classic of L-theanine 200\\~ with magnesium glycinate/threonate + gaba or melatonin but check with the psychiatrist, you can't just get off sleeping pills, especially after long usage.\n\nFirst time I was prescribed zopiclone, the doc said to only take it 2 days, I took it 2 days and then didnt sleep for like 40 hours until I took another one. Had to adjust/raise dosage and he gave me extra supplements + other things to get to normal.",
            "Modafinil is absolutely terrible for sleep, even if taken in the morning. Try green tea or something.\n\nFor sleep try linden flower. It's the most drowsy thing I know that isn't benzodiazepines.",
            "The modafinil is never going to help with sleep , how much of it are you taking and at what time?",
            "Have you tried phosphatidylserene? Look into it - calming herbs and melotonin have never worked for me but PS knocks down cortisol and at least for me is a miracle",
            "A weighted  blanket did my sleep more good than any pill did. That helped me get back to sleep when I would wake up.",
            "Try the magnesium calm powder in water. We absorb it better. Helps me sleep the night. Also, tart cherry juice.",
            "MirtaApine was the best thing for sleep ever.\n\nIt made me gain weight like crazy though so I stopped",
            "Over the counter doxylamine succinate. It knocks you out if you take enough, you just have to have coffee ready right when you get out of bed to fight off the grogginess. I take it with magnesium glycinate. I've taken it for 10 years or so, and waned myself off at times, but when things get stressful at work, it becomes needed again. Probably not ideal, but *everything* falls apart when sleep isn't happening."
        ]
    },
    "Do you ever feel like something is missing in your life?": {
        "title": "Do you ever feel like something is missing in your life?",
        "score": 161,
        "url": "https://www.reddit.com/r/Biohackers/comments/1dquzon/do_you_ever_feel_like_something_is_missing_in/",
        "content": "I get 8-9 hours of sleep, workout daily, 12,000 + steps, eat all Whole Foods, sunlight, all that stuff, but constantly feel like something is missing in my life ",
        "num_comments": 219,
        "comments": [
            "Our purpose in life is to help others along the way.",
            "Seek to nourish the mind and spirit, not just the body",
            "The biggest thing the longevity/biohacking community miss the mark on is social connection and fulfillment. The emotional health aspect. You can have the most perfect routine ever but if youre emotionally unstable you still are at severe risk for disease (and not enjoying your life).",
            "Connection with humans, relationships, marriage, children. It all drives a purpose.",
            "Same bro lmk if u find a solution lol",
            "humans need volatility highs and lows trying to make everything perfect will never work cuz struggle is endemic to nature",
            "Purpose. The answer is purpose. God help you if you find your purpose in another human. You will be let down every time. And it is a most painful fall.",
            "Having a healthy body is important, but the purpose of life, besides just existing, is to experience things, to learn and to explore, and to try different roles. Dont underestimate intellectual and emotional fulfillment. Get to know yourself better to know what that means specifically for you. If youre stuck, therapy might be helpful. Its not just for trauma recovery, its also great for reconnecting with your true emotional needs, especially if youve been intellectualizing and repressing them for years.",
            "You need to go fishing thats whats missing",
            "Human connection. Everything can be right but humans need community"
        ]
    },
    "What is your morning and evening skincare routine?": {
        "title": "What is your morning and evening skincare routine?",
        "score": 13,
        "url": "https://www.reddit.com/r/Biohackers/comments/1dr62wf/what_is_your_morning_and_evening_skincare_routine/",
        "content": "I am a 30-year-old man who has never taken skincare seriously, as many of you can imagine 😂. I use a cleanser and moisturizer, but nothing more.\n\nCould I kindly ask what your morning and evening routines are?\n\nNotes: 1) My T-zone is oily, but the rest of my skin is normal. 2) Recently, I’ve had puffy eyes despite getting good sleep and maintaining a healthy diet.",
        "num_comments": 28,
        "comments": [
            "Dont smoke , dont drink, no makeup. Thats probably 90% right there.",
            "Wash face, moisturiser. Little face massage maybe. \n\nCeraVe are a decent brand, have good ingredients and relatively cheap.",
            "Id recommend looking at the Gurl Gone Green blog and/or shopping at Credo Beauty for your products so you avoid toxic chemicals and low quality ingredients.",
            "Double cleansing at night to remove oil residues",
            "Id add some hyaluronic acid in the morning",
            "Have you tried The Ordinary's 23% vitamin C suspension? It is the only Vitamin C product I have tried so far, and the texture makes it so that I wouldn't want to wear it in the daytime. It's gritty and kinda thick feeling. How does the Skinceuticals compare? I have no issue wearing it at night time though, or if I'm just working from home that day and not going to be seen by anyone",
            "I read sunscreen tops this sort of list also",
            "I quit smoking 3 years ago, so it is ok  \nI do drink but like a social drinker at the weekend.\nI dont do any makeup",
            "Can you please tell me more about massaging? You mean gua sha?",
            "Endocrine disrupters. I would suggest not going out mid day when UV index is above 3. if you need to wear long sleeves, a cap or hat and glasses. Only place I would put a sunblock is my hands and face/neck if It cannot be covered. I use zinc oxide only."
        ]
    }
}