{
    "Scientists Put Ants on Stilts and Knocked Down Their Sand Towers to See If They Got Lost!": {
        "title": "Scientists Put Ants on Stilts and Knocked Down Their Sand Towers to See If They Got Lost!",
        "score": 338,
        "url": "https://v.redd.it/njwikbu6ux7d1",
        "content": "",
        "num_comments": 34,
        "comments": [
            "Imagine a giant comes by, cuts your legs off and then observes you crawl home",
            "Me: Smashes and flicks ants unapologetically when they’re near my food.\n\nMe when I hear they put stilts on ants: *Gasp (poor ants)",
            "Wait so how does this work exactly?   \nIf they can find their home based on the sand mounds why would they miss is with different leg length?",
            "The ants with the different leg lengths look really funny",
            "Can I have the guys social media please \n..?",
            "Ants with stilts while standing next to the amputated ants.   * WE ARE THE CHOSE. ONES , THE GIANT HAS CHOSE. US *\nWalks past home.   Ah shit !!!",
            "Put them in a controlled area, have a moving slab or some object for them to walk on and move it forward/backwards to find out if they count steps? How ants came up with a numerical system is beyond me (just going for counting maybe it's meant different), I'd go for sunlight manipulation and try to find out if they use that for moving for a duration and in what direction. Maybe they use their antannae (too?), they are pretty much highly developed micro robots or biological tech we are still learning about.",
            "So all I have to do to keeps ants out of my kitchen is cut a tiny bit off each of their legs so they undershoot the entrance and get lost?\n\nGame changer.",
            "This seems like a study that didn’t need to happen because we should have gotten there through common sense.",
            "Sounds unethical"
        ]
    },
    "Why are all these snails aggregated on top of this pole?": {
        "title": "Why are all these snails aggregated on top of this pole?",
        "score": 4247,
        "url": "https://i.redd.it/b4ae7k8hmt7d1.jpeg",
        "content": "It's around 23 degrees Celsius. I have no idea what they are all doing these XD",
        "num_comments": 377,
        "comments": [
            "The parasitic flatworm Leucochloridium paradoxum, also known as the green-banded broodsac, can manipulate snails into climbing to exposed areas to attract birds. Once eaten, the parasite releases its eggs in the bird's droppings, where it can continue its life cycle. That’s my guess on what you’re seeing here… but it is a guess.\n\nSo, zombie snails.",
            "Oh no... They're summitting. Parasitic worm in theor eyeballs I'd say",
            "*They're not sick but they're not well* 🎶",
            "Bird buffet?",
            "These snails are traveling and couldn't see enough far ahead, so an obvious decision was made.",
            "[removed]",
            "They’re pole dancing.",
            "Being proficient in social media they all wanted to share the same post",
            "Exploring their Polish heritage",
            "You already got the sad reason so I'm going to assume that's wrong and say they're all taking turns sitting at the top and yelling, \"I'm the king of the world!\""
        ]
    },
    "Why are the nucleobases in DNA/RNA all pyrimidine or purine derivatives? ": {
        "title": "Why are the nucleobases in DNA/RNA all pyrimidine or purine derivatives? ",
        "score": 9,
        "url": "https://www.reddit.com/r/biology/comments/1dlrlxt/why_are_the_nucleobases_in_dnarna_all_pyrimidine/",
        "content": "Without considering base modifications, why are A, T, C, G, and U all composed of pyrimidine or purine rings? What process selected for and enriched these compounds before life began, and do they have biological advantages over other molecules? ",
        "num_comments": 3,
        "comments": [
            "Purine/Pyrimidine bases are chemically stable and possess planar, aromatic structures. This planarity allows them to stack efficiently within the double-helix structure of DNA, which contributes significantly to the molecule's overall stability. The specific arrangement of atoms in pyrimidines and purines promotes the precise hydrogen bonding between complementary bases, which is obviously useful when you are encoding information molecularly.\n\nFrom a prebiotic chemistry perspective, studies suggest that purines and pyrimidines could form readily under early Earth conditions. Experiments simulating these conditions have shown that these nucleobases can be synthesized from simple molecules like hydrogen cyanide and ammonia. The chemical pathways leading to their formation involve relatively straightforward reactions, making them more likely to accumulate in the prebiotic environment.\n\nBiologically, the specific hydrogen-bonding patterns allow for reliable molecular recognition for the accurate replication of genetic material. The hydrogen bonding between purines and pyrimidines also contributes to a stable double-helix structure, which can tolerate minor changes without catastrophic consequences. Also, these bases absorb some ultraviolet light, offering protection against the UV radiation on early Earth.\n\nOver time, the chemical properties of purines and pyrimidines likely led to their selection and enrichment in the primordial soup. Their stability, ability to form hydrogen bonds, and participation in critical biological processes would have made them favorable for early life forms. Also, these bases are multifunctional, not only as building blocks of DNA and RNA but also in cellular metabolism (e.g., ATP, GTP et cetera), which may have contributed to their evolutionary selection.",
            "Outstanding reply!",
            "I have heard that there are alternative molecules to purines and pyrimidines. But the explanation above is just about right. Hydrogen bonding, flat structure, easy to form under prebiotic conditions. Hydrogen bonding is essential for molecule reproduction. They have to have been chosen for ATP and RNA etc. before the DNA double helix appeared."
        ]
    },
    "Criteria for Parasitism?": {
        "title": "Criteria for Parasitism?",
        "score": 5,
        "url": "https://www.reddit.com/r/biology/comments/1dlruuu/criteria_for_parasitism/",
        "content": "A female mosquito depends on human host as it needs the blood for reproductive purposes, but it's not considered a parasite for humans. This seems to fall under the explanation that a mosquito doesn't directly depend on the human for nutritional needs. \n\nBut then on the other hand, a cuckoo lays its eggs on the nest of a crow, making them lay its eggs. This phenomenon is considered to be Parasitism - Brood Parasitism. But in this case, the cuckoo is not depending on the crow for nutritional needs.\n\nIf looked upon from a survival aspect, they're both on the same page because as a species their survival is dependent on the 'host' (human and crow). But neither the survival of an individual mosquito nor of a cuckoo is directly depending on this interaction.\n\nThen how come Brood Parasitism fall under Parasitism while the interaction between female mosquitoes and humans doesn't?",
        "num_comments": 19,
        "comments": [
            "Quoted:\n\n>\"The female mosquito is not considered as a parasite because it needs blood for reproduction and not for nutrition. Human blood is required for the nourishment of their offspring. A parasite is an organism that depends on other host organisms for its survival\"",
            "mosquito is considered a “micropredator”, a category which sometimes falls under parasitism. A parasitism itself is broad term with many definitions, apart from the obvious parasites like fleas or tapeworms there’s parasitic plants, facultative parasites, parasitoids or, as you have mentioned, brood parasitism. Cuckoos are considered parasites, because they “steal” resources from other organism (i. e. another bird). Mosquitos are considered micropredators, because they do not kill their host/prey. Both of these interactions can be described as parasitism, because they meet the definition of parasitism, i.e. taking advantage of another species and causing it harm in the process.",
            "I think a better question is why are you not counting mosquitoes as a parasite. Remember parasitism is the relationship between the two, specifically it is where one benefits and one is harmed. If the host wasn’t harmed it would be commensalism, and if both benefit that is mutualism.\n\n Cost can be a lot of things. It can also be behavioral like brood parasitism. But blood is a cost. Time and energy spent raising another species is cost. And the parasite gains from it",
            "That way an individual cuckoo is not depending on the crow for its survival rather the upbringing of its progeny and hatching of its eggs, how does that fall under Parasitism?",
            "I agree. However, the book I have to strictly adhere to (a textbook from NCERT) directly denies mosquitoes as a parasite while acknowledging Brood Parasitism in the same paragraph. I guess I'll have to just follow that.",
            "Exactly, I'd actually ask that question but the book I have to strictly adhere to directly denies mosquitoes as parasites while counting cuckoos as one in the same paragraph. That's why I framed the question that way. \n\nI agree with your point there and that's my initial thought process.",
            "It does, and when the chick hatches before the other chicks, he will try to get rid of their eggs or the poor chick to get as much food as possible.\n\nAnd because it is a large bird compared to those who feed it, it will consume more food than the parents can provide.\n\nA very obnoxious bird",
            "Wow lol I saw you said it is NCERT. I wonder who approved the book. Though living in the US and seeing how political government approved educational material are here makes me side eye it a bit",
            "But with respect to the cuckoo parent who left the egg there, that parent isn't depending on the crow for their survival. Similar to how the mother mosquito is not dependent on human blood for nutrition and survival.",
            "Oh well I can't do anything about it, such things are here and there everywhere but exams like NEET strictly follow this book, although that exam is questionable at this point as well. Gotta do the way it is ig."
        ]
    },
    "Why do hybrid fish often grow faster?": {
        "title": "Why do hybrid fish often grow faster?",
        "score": 4,
        "url": "https://www.reddit.com/r/biology/comments/1dlqdur/why_do_hybrid_fish_often_grow_faster/",
        "content": "Tiger Trout, Tiger Muskie, Hybrid Blue Catfish, Hybrid Sunfish, Hybrid Tilapia, Hybrid Dentex... These fish hybrids are unrelated and are produced in different parts of the world but they all grow faster than their non hybrid counterparts. Why?",
        "num_comments": 3,
        "comments": [
            "I don’t know the exact mechanisms underlying this. But what you’re describing is heterosis (hybrid vigor). Might be worth checking out the wikipedia page \n\nhttps://en.m.wikipedia.org/wiki/Heterosis",
            "Hybrid vigour is a thing in plants, maybe it works in fish too.",
            "Thanks"
        ]
    }
}