{
    "I JUST HAD GAY GIRL SEX FOR THE FIRST TIME EVER": {
        "title": "I JUST HAD GAY GIRL SEX FOR THE FIRST TIME EVER",
        "score": 552,
        "url": "https://www.reddit.com/r/bisexual/comments/1dr8hzl/i_just_had_gay_girl_sex_for_the_first_time_ever/",
        "content": "GUYS SHE MADE OUT WITH ME AND THEN IT WENT FURTHER AND I FINISHED AND THEN I MADE HER FINISH AND NOW SHES ASLEEP IN MY BED WE’RE WATCHING BIG MOUTH (her only red flag) SHES SO PRETYYDHAKALALA GAY SEX. SHES THE ASAMI TO MY KORRA. AND WERE GOING TO A PRIDE PARADE TOMORROW OMGGG ",
        "num_comments": 45,
        "comments": [
            "This post made me smile, you ooze happiness gal :D",
            "EDIT: she’s SO passed out and she sleeps so quietly she doesn’t even snore 😭 but she’s hogging my entire tiny ass bed i’m literally on the edge and don’t wanna wake her up :/ is this what dating a woman is like omfg ???",
            "And in our most sacred of months. This is the way.",
            "Burst out laughing at \"BIG MOUTH (her only red flag)\"\n\nHappy for you!",
            "Yay! 🩷💜💙\n\nWhat a way to wrap up Pride month!",
            "Yo that’s amazing!! I’m so scared to kiss my gay girl!! Wish me luck or give any advice!",
            "Look at you blushing girl 🫠♥️",
            "> (her only red flag)\n\nLOL",
            "Ownn so cute\nCongrats bi friend",
            "You go girl!!! You're absolutely radiating excitement which is awesome. Enjoy!!"
        ]
    },
    "The bisexual agenda at work": {
        "title": "The bisexual agenda at work",
        "score": 474,
        "url": "https://v.redd.it/zb8inq8rr09d1",
        "content": "",
        "num_comments": 14,
        "comments": [
            "At first, I didn't like where this was going, but the punchline was hilarious. 🤣",
            "The build up to she got me was the fucking best lol,",
            "I mean, it's funny, but he said he's bi now - but I'm pretty sure pegging is still straight, unless they got a guy to do this 🤔\n\nThough, maybe it was just what prompted him to explore a little bit more after 🤷‍♀️",
            "Yes you will have something up your OwO",
            "Just checking… am I allowed to think this funny, or are we mad at it?",
            "Yeah same, cue “they really had us in the first half” meme :P",
            "You couldnt tell it was a set up that that wasnt what the joke was actually about?",
            "I think it was just part of the joke “oh I like stuff up my butt I must be bi now”",
            "You're allowed to think for yourself bb",
            "u don’t need permission to have thoughts"
        ]
    },
    "Some bracelets I made in tribute to us multisexual folks ": {
        "title": "Some bracelets I made in tribute to us multisexual folks ",
        "score": 31,
        "url": "https://www.reddit.com/gallery/1dr8yg5",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "My preference towards men in a nutshell.": {
        "title": "My preference towards men in a nutshell.",
        "score": 1370,
        "url": "https://i.redd.it/wfax2m3bib9d1.jpeg",
        "content": "There’s nothing with muscular men, they’re just not my type. And for the love of god don’t treat feminine men like sexual objects. They’re human being who deserve dignity and respect. ",
        "num_comments": 77,
        "comments": [
            "Put the muscle man in the maid outfit and then we're talking",
            "Depends if I’m topping or bottoming which I like more ngl",
            "I have never agreed with something more than ^this",
            "for some reason i find ALL flavours of gender nonconformity hot.",
            "Why not both. ~~At the same time.~~",
            "Muscles just don't get me going lmao",
            "It’s the opposite for me",
            "I love all representations ❣️",
            "Yes to both. I’m a face person so that’s gonna be the deciding factor 😂",
            "I mostly like men like this and I am also like that myself 😅"
        ]
    },
    "Anyone else more of an oral person? ": {
        "title": "Anyone else more of an oral person? ",
        "score": 87,
        "url": "https://www.reddit.com/r/bisexual/comments/1dr3574/anyone_else_more_of_an_oral_person/",
        "content": "While I definitely feel pretty even between the gay and straight sides of myself I find that what makes me hesitant to enjoy gay porn is seeing penises so big and going so fast that it definitely looks like it hurts. I don't want my asshole to be hurt. I'd like it if a guy with medium to small penis gently and slowly pushed it in. I have some hesitation both receiving and giving anal and the reverse is true with oral. Vaginal is just in the middle. I also find those giant penises in porn going into vaginas with so much speed looks like it hurts or the same into mouths and it's just such a turn off. I wouldn't want to replicate that in real life. \n\nFor both women and men I fantasize a lot about oral. Always giving. I've not thought much of receiving a blowjob for some reason. Probably because I fear my penis being bitten off.\n\nI noticed I'm mostly a submissive giver and rather feminine twink. ",
        "num_comments": 50,
        "comments": [
            "Me too I love giving oral",
            "I prefer oral to actual sex. I wondered if that was strange",
            "I definitely prefer oral (especially giving) with a guy. With a woman I’m definitely into just about everything. Maybe that’s just because I’ve had far more time and experience with women than guys.",
            "I haven't done anything with anyone yet bit I've noticed I fantasize about oral stuff a lot more than regular sex. Giving a guy a blowjob just seems really fun",
            "Lol is this a bisexual thing? My sex dreams about giving oral",
            "Me and my boyfriend love oral a lot but he only likes it when he is the one doing it to me. I adore him either way, i can never get enough of how cute he looks when doing it :3",
            "I prefer penetrative sex because then we both get that feeling of sexual bliss. For me, oral is more of an appetizer to get ready for the main course.",
            "Absolutely I'm all about the oral.. male/ female don't care I just want it in my mouth 👄",
            "Just in general porn of that type is just not it.\nThat's why i stopped watching straight porn that includes penetration. It just looks like it hurts.\nWholeheartedly believe it would be better if done with someone you like. (more passion, more slow)",
            "I'm also more of an oral person. I've Topped guys quite a few times and enjoyed most of it, but even being a Top I hate it if the guy wants to be rammed to the point of my balls hurting. And with oral, I hate rough aggressive head. Both giving and receiving. I'm also more into sucking than being sucked but I can't deepthroat and hate having Dick jammed in my mouth. I don't mind sucking fast or being sucked fast but it's gotta be gentle and sloppy. I like when a mouth feels like pussy. It's more enjoyable to have the Dick slip in and out of my mouth smoothly and it's also easier to get that swirly tongue action going that way."
        ]
    }
}