{
    "The bisexual agenda at work": {
        "title": "The bisexual agenda at work",
        "score": 73,
        "url": "https://v.redd.it/zb8inq8rr09d1",
        "content": "",
        "num_comments": 7,
        "comments": [
            "At first, I didn't like where this was going, but the punchline was hilarious. 🤣",
            "Yes you will have something up your OwO",
            "Just checking… am I allowed to think this funny, or are we mad at it?",
            "Yeah same, cue “they really had us in the first half” meme :P",
            "You're allowed to think for yourself bb",
            "I thought it was funny, feel free to think whatever you want though :)",
            "u don’t need permission to have thoughts"
        ]
    },
    "My preference towards men in a nutshell.": {
        "title": "My preference towards men in a nutshell.",
        "score": 1207,
        "url": "https://i.redd.it/wfax2m3bib9d1.jpeg",
        "content": "There’s nothing with muscular men, they’re just not my type. And for the love of god don’t treat feminine men like sexual objects. They’re human being who deserve dignity and respect. ",
        "num_comments": 74,
        "comments": [
            "Depends if I’m topping or bottoming which I like more ngl",
            "Put the muscle man in the maid outfit and then we're talking",
            "I have never agreed with something more than ^this",
            "Why not both. ~~At the same time.~~",
            "for some reason i find ALL flavours of gender nonconformity hot.",
            "Muscles just don't get me going lmao",
            "It’s the opposite for me",
            "I love all representations ❣️",
            "Yes to both. I’m a face person so that’s gonna be the deciding factor 😂",
            "I mostly like men like this and I am also like that myself 😅"
        ]
    },
    "Alright, here's to my first ever Pride outing! ": {
        "title": "Alright, here's to my first ever Pride outing! ",
        "score": 39,
        "url": "https://i.redd.it/bac53pwleg9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "All that black… make sure you drink lots of water!",
            "Amazing. Well done. Hope you loved every minute."
        ]
    },
    "Anyone else more of an oral person? ": {
        "title": "Anyone else more of an oral person? ",
        "score": 47,
        "url": "https://www.reddit.com/r/bisexual/comments/1dr3574/anyone_else_more_of_an_oral_person/",
        "content": "While I definitely feel pretty even between the gay and straight sides of myself I find that what makes me hesitant to enjoy gay porn is seeing penises so big and going so fast that it definitely looks like it hurts. I don't want my asshole to be hurt. I'd like it if a guy with medium to small penis gently and slowly pushed it in. I have some hesitation both receiving and giving anal and the reverse is true with oral. Vaginal is just in the middle. I also find those giant penises in porn going into vaginas with so much speed looks like it hurts or the same into mouths and it's just such a turn off. I wouldn't want to replicate that in real life. \n\nFor both women and men I fantasize a lot about oral. Always giving. I've not thought much of receiving a blowjob for some reason. Probably because I fear my penis being bitten off.\n\nI noticed I'm mostly a submissive giver and rather feminine twink. ",
        "num_comments": 29,
        "comments": [
            "Me too I love giving oral",
            "I prefer oral to actual sex. I wondered if that was strange",
            "Oral is great! Love to give it. And penises are actually really tough and, like, elastic, too. If someone bit it, it would obviously suck really bad, but it would be incredibly difficult to actually sever it with their teeth. It would probably make a complete recovery!\n\nUh, I know that from weird internet cooking shows that, like, try to make bull penis or something into a viable meal. Not personal experience. I am definitely not a blowjob assassin with many high profile kills, and I don't rely on obfuscating my trail by having certain details omitted from reports due to the embarrassment. Certainly not that.",
            "Me and my boyfriend love oral a lot but he only likes it when he is the one doing it to me. I adore him either way, i can never get enough of how cute he looks when doing it :3",
            "I definitely prefer oral (especially giving) with a guy. With a woman I’m definitely into just about everything. Maybe that’s just because I’ve had far more time and experience with women than guys.",
            "I haven't done anything with anyone yet bit I've noticed I fantasize about oral stuff a lot more than regular sex. Giving a guy a blowjob just seems really fun",
            "Absolutely I'm all about the oral.. male/ female don't care I just want it in my mouth 👄",
            "Actual human sex is worlds apart from what you see in porn, so please don't base your expectations on that. Fucking either men or women, or in-between, should be about enjoying yourself and building a connection with someone. If it's a one time thing, or a serious relationship it doesn't matter, it's all for enjoyment. Communication is huge, say what you like, listen to what they like, observe their body language and how they react to you. Having said that, giving oral slaps, I love burying my face between a pair of thighs!",
            "With guys yes. I'm not very into the anal thing. Although I would top if I thought the guy was hot but don't think I will ever bottom.",
            "I prefer penetrative sex because then we both get that feeling of sexual bliss. For me, oral is more of an appetizer to get ready for the main course."
        ]
    },
    "I fuckin hate the Bi Cycle ": {
        "title": "I fuckin hate the Bi Cycle ",
        "score": 82,
        "url": "https://www.reddit.com/r/bisexual/comments/1dqzpev/i_fuckin_hate_the_bi_cycle/",
        "content": "I legit sucked a dudes dick last week and now Ive got myself questioning if I’m bi because I’ve been into girls while watching porn lately. 😫",
        "num_comments": 11,
        "comments": [
            "It's ok you just got to get a boyfriend and a girlfriend",
            "Learn to trust your memories. Don’t accept how you feel at the present moment to be some deep insight into your sexuality that supersedes everything you have experienced.",
            "I feel you. One minute you are into guys more, the next girls. It doesn't help that I am an over-thinker as well as someone who hates uncertainty",
            "Newly out, haven’t been with a guy yet, and I am not looking forward to this I have already wrestled with it a ton.. sorry OP :(",
            "Something that puts these things into perspective for me is hanging out with some veeeery heterosexual people. The cishets are not having experiences like these lol. Sometimes that helps out things in perspective when I feel insufficiently queer.",
            "I’m going to let you in on a little secret: *It doesn’t actually matter.* Labels can be good or bad, or lots of things in between, but really… just try to have some fun out there and maybe let the labels work themselves out over time. You don’t have to decide this week. 😊",
            "I’ve been kinda craving chicken lately. Ever have Dave’s Hot Chicken? Pretty good.\n\nAnyway, last week I was on a sushi kick. Getting a bit tired of fish, so think I might get some chicken sandwiches for dinner.\n\nDo I suddenly hate sushi? No. Go with the flow! Listen to your body, mind, and heart.",
            "No but fr thou bi- cycle is easy if you know that is what it is",
            "The only right answer",
            "Yeah just dont stop peddling without a foot on the ground if your learning without training wheel"
        ]
    }
}