{
    "2FA for multiple people on one account?": {
        "title": "2FA for multiple people on one account?",
        "score": 0,
        "url": "https://www.reddit.com/r/Bitwarden/comments/1drcvwc/2fa_for_multiple_people_on_one_account/",
        "content": "We have a $10/year Bitwarden account.  I'd like to set up 2FA but allow multiple people to have that kind of access (wife and oldest daughter, who will run the estate should both of us die).  Is there any way to do that?  I looked around but couldn't find anything,",
        "num_comments": 1,
        "comments": [
            "Premium account is for one person to access. Sharing is against terms of service.\n\nConsider the emergency access feature. https://bitwarden.com/help/emergency-access/\n\nIf you need to share information with another person you use an Organization."
        ]
    },
    "Password management for idiots (issue with files and syncing on app)": {
        "title": "Password management for idiots (issue with files and syncing on app)",
        "score": 2,
        "url": "https://www.reddit.com/r/Bitwarden/comments/1dr8ly9/password_management_for_idiots_issue_with_files/",
        "content": "Hi all\n\nI’m not tech savvy in the least bit but I have been using Bitwarden as a password manager. I’m coming across a couple of issues. I am sorry beforehand if these are the stupidest questions. \n\n1 - some passwords aren’t syncing from my laptop to my phone (the app). I think it may be an issue of where I’m storing them. Where can I store them that will for sure show up on the app on my phone?\n\nI have “My vault” and “Me”.  “Me “ looks like and organisation I set up a while ago. \n\nMy vault does not have all the passwords where “Me” does under Default Collection folder\n\nAm I able to move all the passwords from Me to My Vault and be able to see them on my phone as well? I want to make sure I’m not going to lose the passwords - is it smarter to export the info first just in case?\n\nalso - is there anything else I should do in general to keep my info secure? \n\nThanks in advance for any help. \n\n",
        "num_comments": 5,
        "comments": [
            "Yes.  You will have access to your vault plus any organizations you are a member of.",
            "It is *always* safer to make a backup before moving/messing with important data.  However, be aware of where you put that backup as it can increase the chances of your vault being compromised if you dont securely store it/encrypt it. \n\nOrganizations are meant to share data with other people.  Yes, you can move the passwords out of the organization and still see them.  \n\nMake sure that you have the automatic sync enabled on any of the Bitwarden clients that you are using. \n\nAs far as security, you should make sure that you have a strong, unique, randomly generated password/passphrase for your vault.  You should enable MFA with hardware keys, app-based TOTP, email, or text.  Ive listed them in the order of what people consider strongest to weakest method. \n\nFinally, make sure you have an emergency sheet with your important passwords (Bitwarden, email, etc) and the MFA recovery codes that Bitwarden and your email provider generate in the event you lose access to them.\n\nYou should also secure your email with the same methods.",
            "A little off topic but since organizations were mentioned, a question.\n\n\nI'm on the free plan. Was trying to separate passwords between my desktop and phone, so I used organization on my phone.\n\n\nThis almost worked. The problem is that when I log into my bitwarden account on my phone, I get the option to access any vault in my account, which I don't want. I just want it to force access to the phone account.\n\n\nDoes the paid plan work the same way?",
            "First of all, make a password protected backup of both your VAULT & of the ME organization.  Those are 2 backups.  Read up on how to export both in the Admin panel.  Dont just backup the VAULT and think youve also got ME or vice versa. \n\nBest to be logged into the web vault to do this.  \n\nWhile youre there, see if you can see all your entries:  the ones that are VAULT and the ones youve shared under ME organization. \n\nUnderstand that when you make a new entry under either one, you may not see it in the other.  It depends on: \n\n1). Whether youre logged in to VAULT or ME \n\n2). Permissions & Roles. In your Admin Panel, see if youre setup to ADMIN or EDIT or just VIEW the ME collection youve setup. \n\n3). Also, there may be a discrepancy of whether ME is an organization or a collection.  Make sure to sort that out or let us know here.  I wasnt 100% sure given the way you described it. \n\nIf you sort that out and sync your device / phone and youll see different things show up, depending on the above parameters, who youre logged in as, etc. \n\nSince you have yourself as a ME organization or collection, make sure you always SHARE every entry in ME.  \n\nOr conversely, you could ignore the ME and put everything into VAULT and login there. \n\nThe latter choice is what I would prefer.  It makes backups a bit easier and in my view a tad bit more reliable.  Any backup export even from the apps would export that main VAULT, but not anything youve shared into ME organization.",
            "> from Me to My Vault\n\nWhoa, slow down. You have a little bit of a problem here. Organization vaults are all about sharing and ownership. If you have moved an item from My Vault to Me, _you have given up ownership of the item_; the Organization owns it, not you.\n\nDid you intend to share the items in the Me vault with another user? If not, you have a bit of a mess to clean up. No, you cannot move shared items back into your private vault. You will need to figure out a way of copying it back, and it is currently not easy to do that.\n\nThe most straightforward way will be for you to create new entries, one at a time, by hand, in My Vault. Just copy and paste each field from Me (you could have it open in a browser) and then paste into your local desktop Bitwarden client.\n\nBefore you delete anything from Me, I urge you to create an export of that vault, in case something goes wrong.\n\nI wonder if you were trying to create a personal organization of the items in your vault, as opposed to trying to set things up for sharing? You might be happier with the folder feature. (IMO I really want general tags, but that wont happen for a while.)\n\nSorry, this is going to be a bit of work to straighten out. There is a much more involved way that would entail exporting Me to a CSV, massaging the column names, completely deleting My Vault, and then importing Me. Thats much more complicated, and I dont recommend it unless you are very comfortable with data processing.\n\n> I should do in general\n\nLOL thats pretty open ended. Here are just a few ideas to get you started\n\n* Emergency Sheet  You are much more likely to lock yourself out of your vault than for an attacker to gain access. There is no back door here! If you forget your master password or lose your 2FA, you are sunk. Please make a point of [creating an emergency sheet](https://passwordbits.com/password-manager-emergency-sheet/). Your memory is NOT RELIABLE.\n\n* Full backups  This goes beyond the emergency sheet above. You will need to search this sub for thoughts on creating a a good Bitwarden backup. I could go on for pages. And it certainly is not something you need to do right away. But make a note to yourself and come back to this soon.\n\n* Choice of passwords  Every single one of your passwords, including the master password to your vault, needs to be complex, unique, and randomly generated. Complex is a value judgment, but 15 random characters or four random words is often regarded as sufficient. Unique is simply that every password must be different, and a cutesy variation of another password doesnt count; attackers know that trick. Finally random means that you must NOT make it up yourself; you must let an app like Bitwarden create it for you. You are not as creative as you think!\n\n* Choice of usernames  Think about it: that email address Important_Rub_3479@gmail.com is an important clue for an attacker trying to break into your accounts! Whenever you can, its better to pick unique email addresses for each website login. Bitwarden has some email alias support (google it!) to help here. I am fond of plus style aliases, like gmail and others support. Did you know that email sent to Important_Rub_3479+mumble@gmail.com will go to the same mailbox? Note also you can change the email address for your vault. Just make sure to update your emergency sheet with the new address.\n\n* Two-Factor Authentication (2FA)  ALWAYS use 2FA for a website login if it supports it. If you have a choice of 2FA methods, pick the single strongest method available. SMS (text message) and email are considered the worst. A FIDO2 hardware security token is the best, if available. TOTP (the rotating six digit numerals in a special app) is almost as good. If the website gives you 2FA recovery codes, it is essential you save those. The selection of a good TOTP app is a big subject, search this subreddit. And ofc a backup of the TOTP apps datastore is a very wise precaution.\n\n* Operational Security  For each device you are using for any secure computing, you MUST keep your patches current. And if the device no longer receives patches (like my old Samsung S9), it is NOT SUITABLE for secure computing. Regardless of how great the phone is, an unpatched device has security flaws that malware detection will not protect you from.\n\nThere is a lot more to operational security. Do not download frivolous software, and only download from trusted locations. Do not allow others to have access to your device, even for a moment; thats all it takes for someone to inadvertently or intentionally put malware on your device.  Always use a screen lock.\n\nFor a device that you use in a public place (like your phone or a laptop), enable biometric authentication so that a shoulder surfer cannot learn your passwords. But ofc keep your device secure; either in on your person or locked in a secure area."
        ]
    },
    "hey y'all! how do i remove this?": {
        "title": "hey y'all! how do i remove this?",
        "score": 0,
        "url": "https://www.reddit.com/r/Bitwarden/comments/1drcdvb/hey_yall_how_do_i_remove_this/",
        "content": "[the logo right there](https://preview.redd.it/4ghnzzxati9d1.png?width=370&format=png&auto=webp&s=30944c002268d565991c648f7df139a72127c069)\n\n",
        "num_comments": 4,
        "comments": [
            "Couldn't find it on Firefox Bitwarden extension settings",
            "Bottom right Settings -> autofill -> show autofill menu on form fields -> off",
            "Thanks, worked like a charm. (Don't know how I missed that part tho)",
            "In-line autofill."
        ]
    },
    "Starting Passwordless": {
        "title": "Starting Passwordless",
        "score": 1,
        "url": "https://www.reddit.com/r/Bitwarden/comments/1dr8a69/starting_passwordless/",
        "content": "I have recently created new account to try out Passwordless offering but I did not received the activation email? Searching everywhere including spam folder, looking like something went wrong?",
        "num_comments": 2,
        "comments": [
            "Probably a typo. Try to log in with your information and insert the correct email address. Good luck!",
            "No typo, I use gmail and company work email and did not received it as well, and tried another gmail, I got it. Thanks, the UX is not clear, to make it worse, I found their tutorials on JavaScript has errors and confusing, can't believe since it's already on v4."
        ]
    },
    "Best Practices?  Pre-Config?": {
        "title": "Best Practices?  Pre-Config?",
        "score": 0,
        "url": "https://www.reddit.com/r/Bitwarden/comments/1dqy8ti/best_practices_preconfig/",
        "content": "Hello everyone!\n\nDoes anyone have, or know of, a respected \"Best Practices\" document or the like?  This would have settings, \"Check this on, Check that off, set the lock timeout to 'xyz'\" that sort of thing.\n\nAlso,  \nI'm able to deploy the browser extension via Intune Device Config but I still have to go in and configure the various individual settings for each user, after the fact.  Does anyone know of a way to deploy preset settings beyond what can be set in the admin console?  Registry, JSON, etc?  \nThanks!",
        "num_comments": 3,
        "comments": [
            "What type of an account did you sign up for, personal or business?\n\nIf you signed up for Business enterprise, in the organization admin console there are some policies there.",
            ">Does anyone know of a way to deploy preset settings beyond what can be set in the admin console? Registry, JSON, etc?\n\nThere is no officially supported way to do this, as far as I'm aware.  However, the settings configuration for each app & user is stored in a JSON structure that is bundled with the vault cache in the [local data folder](https://bitwarden.com/help/data-storage/#on-your-local-machine).  You will not be able to simply copy this information (as each user evidently has a unique identifier that is used in the JSON field names), but you may be able to write a script to automate the creation of new JSON based on a gold standard version.",
            "/u/cryoprof has an excellent work in progress user guide:\n\nhttps://www.reddit.com/r/Bitwarden/s/KrpUuXPUwd\n\nThere may be a few things to be added as time goes on.\n\n> for each user\n\nThis sounds like something that Bitwarden Customer Support might have experience with. Im afraid most of us are individual users; we dont deploy the password manager to dozens of friends or family "
        ]
    }
}