{
    "The Saturday healthcare mega thread": {
        "title": "The Saturday healthcare mega thread",
        "score": 1,
        "url": "https://www.reddit.com/r/bjj/comments/1dr66rs/the_saturday_healthcare_mega_thread/",
        "content": "Loads of people post medical-related questions here on r/bjj.  This is your chance to have them answered by a qualified professional! Feel free to ask about injuries, skin issues, and other medical matters related to BJJ.  \n\nIn this thread **ANYONE CAN POST A TOP-LEVEL QUESTION, BUT ONLY APPROVED PROVIDERS CAN REPLY.**  \n\n[List of Providers](https://docs.google.com/spreadsheets/d/1Fc6wwTSAqLNCjMGqINPA8_439lk74qQKqWJDJJwsFvk/edit?resourcekey#gid=672629939) |  [Become a Provider](https://docs.google.com/forms/d/e/1FAIpQLScOzVtSfZ94YH-XgtJgVeJCdDNZz_xH4xaP7zHP-q4956VIQg/viewform)\n\nRules of engagement:\n\n1. Top level comments are for questions!\n2. Only verified providers [from this list](https://docs.google.com/spreadsheets/d/1Fc6wwTSAqLNCjMGqINPA8_439lk74qQKqWJDJJwsFvk/edit?resourcekey#gid=672629939) can answer questions. All other answers will be removed. **Note that we have providers from various disciplines now!**\n3. Providers aren't required to answer fully to your satisfaction - they may just tell you to seek medical help or talk to them in a paid session. That's their right.\n4. Maybe don't post pics of body part. Or do. I don't know.\n\nGood luck to all of us!",
        "num_comments": 6,
        "comments": [
            "So this one time in 94. I was oil checked ...and if on the off chance he still thinks about it too....  does that mean I have staph?",
            "Hello all. I've done 2 classes. I'm in my 40s so an older newbie. Is finger pain normal for newbies?\nThe middle fingers on my right hand are sore and bruised, more at the tops.\nI assume this is something that will strengthen or get easier as time goes on."
        ]
    },
    "ADCC/CJI Megathread #7: All your news are belong to us. \"New player joined\" and drama get their own threads. General news, questions, and speculation go here.": {
        "title": "ADCC/CJI Megathread #7: All your news are belong to us. \"New player joined\" and drama get their own threads. General news, questions, and speculation go here.",
        "score": 4,
        "url": "https://www.reddit.com/r/bjj/comments/1dhy4d6/adcccji_megathread_7_all_your_news_are_belong_to/",
        "content": "",
        "num_comments": 142,
        "comments": [
            "Whats the point of the megathread? Would it really be such a bad thing for the subreddit to have more threads to look at about CJI?",
            "Mackenzie Dern vs Ffion Davies is official",
            "Still hoping to see /u/december6 commentating!",
            "Tickets to both ADCC and CJI secured. Living the American Dream.",
            "-80kg the most exciting line up ever for a grappling event?",
            "This is where Mica leaves his dead beat dad and defects. \n\nNicky Ryan 2.0",
            "all adcc needs now is for Nickys brother to have a tummy ache near event time",
            "I hate the mega threads literally the pinnacle of the sport over this drama and the mega threads are killing the buzz.",
            "Im with these guys. Stop killing the threads. Let it ride. Its good for biz.",
            "Guys get ready for a massive announcement"
        ]
    },
    "Do you want to see a publication about how heelhook can broke your knee?": {
        "title": "Do you want to see a publication about how heelhook can broke your knee?",
        "score": 60,
        "url": "https://www.reddit.com/r/bjj/comments/1dr9gma/do_you_want_to_see_a_publication_about_how/",
        "content": "I'm about to graduate in physical therapy. I did a bunch of human body dissection classes, and I noticed a lack of bibliography about heelhook injuries. Was thinking about a really expensive way to make my thesis. \"Rent\" an MD (uni proff of anatomy) and make an arthroscopic investigation (a video) of what happens when the heelhook is done. Yes, I will be grabbing and doing a heelhook to a poor human body, a corpse, for the sake of science. My idea is to have a whole knee diagnosis from the proff and a live arthroscopic view, so see what happens. (The arthroscopy is also needed to see if the ligaments are intact before the interaction with them) My idea is to do an outside one on a leg and an inside one on the other. The objective is to learn what kind of damage it will do to help surgeons what to expect after that kind of stress on the knee and for physiotherapist to understand the bio dynamics of the injury for a conservative approach to persons who suffered this type of sport injury. Am I crazy? Some adevice about it?",
        "num_comments": 58,
        "comments": [
            "Good luck getting this past an ethics committee.",
            "Don't forget to make a wish as you snap the ligament.",
            "There's a story on the Underground forum of a team of students  trying to dislocated a cadavers shoulder. They tried everything,even having like two people pulling the body's ligaments in opposite directions. Eventually a BJJ student piped up and said \"can I try something?\" And he applied a kimura. The shoulder popped out and everyone was a little stunned but it's a cool story!\n\nAlso I'd love to read a thesis on heel hook injuries.",
            "Is that really at all necessary? We know exactly what happens already. We know what forces are applied and we know what injuries result.",
            "Wild fetish youre working through bub\n\nYes I want to see",
            "I can't imagine a works where it would be necessary, where a retrospective study of people with heel hook injuries wouldn't be more effective (it can also attack the ankle and sort of the shin), or they a cadaver would be pliable enough to execute he move.",
            "1. Kinda fucked, but do it. For the science!\n\n2. Wouldn't breaking a leg of a corpse be way different than breaking the leg of a real person, because of necrosis of tendons, lack of muscle contraction etc.",
            "If you can really do that, then do that.",
            "I'd be fucking stoked if you used my dead body for this.",
            "Would never get past an ethics committee, also does not provide any novel information. \n\nWould be a cool YouTube vid though."
        ]
    },
    "2x Olympic Greco champion Sim Kwon Ho (KOR) demonstrates a fireman's carry": {
        "title": "2x Olympic Greco champion Sim Kwon Ho (KOR) demonstrates a fireman's carry",
        "score": 61,
        "url": "https://v.redd.it/hi0p6ycy4g9d1",
        "content": "",
        "num_comments": 4,
        "comments": [
            "a new way to put myself in a guillotine, sweet.",
            "This man has saved some people from fires",
            "It's the head drive and rotation, the hands are isometric. He's moving them initially to show that you create tension to remove arm slack in your partner.",
            "Ok, time to embarass myself.\n\nNo matter how many times I've watched it, his two hands always start and end on the same wrist grip.\n\nTherefore, assuming they're staying there the whole time, is this not just a 2 on 1 whip? It looks different because he's diving through, but if the thing that moves the guy is you pulling his arm with both hands around until he leaves his feet, it doesn't seem to fit the bill of fireman's carry."
        ]
    },
    "My gym just turned into a McDojo": {
        "title": "My gym just turned into a McDojo",
        "score": 557,
        "url": "https://www.reddit.com/r/bjj/comments/1dqrzot/my_gym_just_turned_into_a_mcdojo/",
        "content": "Will try to keep it brief but will expand if people have questions. Well established gym in Toronto breaking up. Head coach is leaving, starting a new gym nearby and literally everyone is going with him. Owner has hired McDojo Bullshido instructors who made their first appearances this week. Hilarity ensued. \n\nShould note that students had no notice at all about the new instructors coming in, and the outgoing staff only found out two hours before classes were set to start. First was the women's no gi class. The new woman's \"instructor\" is being promoted as a ADCC gold medalist but turns out that was a beginner division and the medal was won by walkover. New instructor didn't know how to do a forward shrimp, refused to try the technique being taught by the outgoing instructor (entry to truck) and then pulled a new student off to the side and made her do pushups. She then showed some very sloppy armbars from side control while the regular instructor (a brown belt) was trying to teach the regular class. The students were shocked at how rude she was and left asking WTF just happened? \n\nFor the advanced class the new no gi/MMA coach arrived with some of his existing students. \"Sensei Mike\" proclaimed the new direction of the no gi classes would be self defense, MMA and no gi grappling. He proudly noted he had two rules.   \n  \n1. Never apologize because it shows you're at fault   \n2. Never help anyone get up because it's \"Weak Samurai Energy\" \n\nHe then showed a double overhook butterfly sweep and an armbar from rubber guard. Even people who had been training for 3 months could tell there was no detail, little experience or expertise. Sensei Mike then refused to roll with anyone and even paired up his own students with those from the gym. Awkward all around. He walked around like mere mortals couldn't understand how great he was.\n\nWe can find no history or BJJ lineage for this new no gi coach even though the profile states 2x Canadian BJJ champion. Appears to be some sort of Krav Maga or a traditional Jiujitsu background His YouTube page shows ridiculous knife disarms,  \"grappling\" techniques in slow motion with no resistance/realism like this gem \n\n[https://youtube.com/shorts/qy9eNMoIDNA?si=AB9h5G-jp4moVXrI](https://youtube.com/shorts/qy9eNMoIDNA?si=AB9h5G-jp4moVXrI)\n\nStudents planning to stay for the two week crossover before the new gym is ready were mass cancelling after one night but the gym phone number now directly connects to Sensei Mike's cell phone and so people calling to cancel in horror get hung up on. \n\nIn the end the actual community will live on in a great new space, but it's hard to imagine a more ridiculous ending to a very well known gym. I expect it bleeds out very quickly.\n\n",
        "num_comments": 283,
        "comments": [
            "Ohhh I'm curious which gym. I'm just across the border and know a lot of people in the Toronto/Ontario scene.\n\nAlso, there is no chance I'm taking anyone who calls themselves sensei in a BJJ gym seriously.",
            "Wow, that video is absolute dogshit",
            "I've never seen anything this egregious but I've seen a couple of times where an owner doesn't get that people aren't loyal to a gym name and location. They're there for the instructor. If instructor is gone then generally students follow.",
            "I kept thinking this was a shitpost and read to the end. Fuckin lol",
            "Weak samurai energy. Wow. If I was doing an intro class I would walk out after that phrase alone.",
            "\"Bizarro arm bar.\" That's awesome. Complete with unnecessary hook removal.",
            "![gif](giphy|JIsfyNln6LMD6)\n\nSo I found this great documentary about Sensei Mike",
            "Time for a new gym",
            "Judging by the video linked. Your new coach is Krav Maga teacher who has seen and tried some jiujitsu. Total newbie coaching bjj.",
            "Im stealing weak samurai energy to use as shit talk."
        ]
    }
}