{
    "/r/BlackPeopleTwitter Weekly Discussion Thread": {
        "title": "/r/BlackPeopleTwitter Weekly Discussion Thread",
        "score": 26,
        "url": "https://www.reddit.com/r/BlackPeopleTwitter/comments/1dhys4v/rblackpeopletwitter_weekly_discussion_thread/",
        "content": "Hey r/BlackPeopleTwitter, welcome to our weekly discussion thread.\n\nFeel free to use this thread to discuss whatever you want. You can discuss the state of the sub/meta post, shitpost, post non-twitter memes, or discuss whats going on in your life. Just keep in mind that we ask you stay friendly, civil, and adhere to the [subreddit rules](https://www.reddit.com/r/BlackPeopleTwitter/about/rules/).",
        "num_comments": 78,
        "comments": [
            "Why are so many non-black people on this page cosplaying as black folks? You don’t gotta lie to kick it.",
            "Sometimes when random white people try to say I look like someone else, I want to get angry but then I remember these two exist.\n\nhttps://preview.redd.it/5wf9x38kh57d1.jpeg?width=1170&format=pjpg&auto=webp&s=3cc53a91e4c4adcbccb18a8100f0a65eea872ff5",
            "A [heat dome](https://www.cnn.com/2024/06/14/weather/heat-dome-summer-hurricane-climate/index.html) is forecast for later this week. Stay hydrated :)",
            "I hope a baby smiles at everyone sometime this week. \n\n\nI hope that everyone finds a twenty dollar bill, \nrandomly. \n\n\nI hope everyone creates a lifelong pleasant memory this week. \n\n\nSmall blessings on this Monday. Happy Juneteenth!",
            "So my man got gifted a puppy yesterday from his folks and he’s torn between names: Kirby(his favorite game) and Shuri(Black Panther). Any thoughts? The puppy in question is a 3 month old female black lab.\n\nETA: He’s going with Kirby and Shuri will be her middle name.",
            "Trying to find a decent job is worse than getting kicked in the nuts 😞. I swear it feels like my resume is not being looked at",
            "Any recommendations for Black subreddits? It would be cool to meet new people and have new conversations.",
            "I'm tired mate. I'm just so tired.",
            "I don’t get why black lesbians are so judge mental and down right mean bullies. This is just personal experience. Look I get it, my personality ain’t the most attractive because I’m more on the reserve side; but I wish we were more open to each other. It’s difficult trying to connect with other black queer women.",
            "I hope everyone had a great juneteenth weekend or has a great one planned for the upcoming weekend / holiday!!♥️🖤💚"
        ]
    },
    "\"Help! Help! Police! Help! 🚔🚓🚓\"": {
        "title": "\"Help! Help! Police! Help! 🚔🚓🚓\"",
        "score": 4611,
        "url": "https://i.redd.it/st4irqgwc18d1.jpeg",
        "content": "",
        "num_comments": 463,
        "comments": [
            "One of my pre-k students once told me \"my mom is 25... and my dad is 50.\"\n\nOkay buddy, that's kinda weird but I don't judge.\n\nThen I remembered he has an 10 year old sister.",
            "What a terrible day to know basic arithmetic. \n\nAlso sum1 plz call the FBI. They might be interested in this",
            "Trying to strike a chord…",
            "He should be in jail.",
            "In certain states she can marry him as young as 12 and then not be legally allowed to divorce him until 18.",
            "The gap in their ages is almost as big as the gap between their eyes",
            "Hey hey hey hey, run for your life",
            "She's still too young for the club. She should be somewhere letting her brain fully develop so she'll know that someone in their 20s sniffing around a 15 year old is fucking disgusting and wrong.",
            "![gif](giphy|JaNtIG4UnKzD2|downsized)",
            "https://preview.redd.it/wfdmt55uq18d1.jpeg?width=567&format=pjpg&auto=webp&s=809db9fc5c0d2d2bf122e14311b552b3921d2acd\n\nHmmmmm……"
        ]
    },
    "at least Mary was given the heads up ahead of time ": {
        "title": "at least Mary was given the heads up ahead of time ",
        "score": 5459,
        "url": "https://i.redd.it/vfl9hi8n118d1.jpeg",
        "content": "",
        "num_comments": 664,
        "comments": [
            "No, sometimes that’s completely normal for someone. My sister in law tried to get pregnant for 10 years, usually got her period every 3-6 months. When she went in for her yearly check up, found out she was 7 months pregnant.",
            "My mom said she didn’t know she was pregnant with me until she was 7 1/2 months, she wasn’t a plus sized woman and she said she got her period regularly. It was only when she went to get her tubes tied that they told her aht aht, should have been quicker than that.",
            "Many of these women often have bleeding that can be mistaken for a period or conditions that make skipping periods expected (if you want a million examples there’s a show called “I didn’t know I was pregnant”) \n\nEdit: I also know of a case with a trans man, and I think in his case he thought his periods stopped due to his hormones iirc ",
            "Actually know someone who had a cryptic pregnancy, never missed a period, didn't have noticable weight gain despite being pretty petite. \n\n\nBasically went to the hospital with abdominal pains, she and her husband had to come back home with a baby they were absolutely not expecting. Shit was WILD.",
            "Whew! We gotta do a better job as a country teaching people about the reproductive system. I have pcos and especially during periods of intense stress I can go long stretches without a period. That’s just one of many many reasons why women may not get periods, so not having them doesn’t inherently make her clueless.",
            "cryptic pregnancies has yall confused asf. Idk if I’ll be happy or not. 9 months with zero symptoms sounds amazing but being unprepared for said baby idk.",
            "One of my dearest friends went to the hospital thinking she was a month or two along (shed just started dating a new guy). Turns out she was 28 weeks. Normal-for-her periods the whole time. \n\nOur bodies are wild, man.",
            "Local man discovers not every woman has a period every month like clockwork",
            "Cryptic pregnancies often come with regular periods",
            "My mom still bled when she was pregnant with me"
        ]
    },
    "This man carried the show and the firm on his back": {
        "title": "This man carried the show and the firm on his back",
        "score": 352,
        "url": "https://i.redd.it/5vfpss5dv38d1.jpeg",
        "content": "",
        "num_comments": 34,
        "comments": [
            ">!as soon as Mike left,!<the show had a noticeable and severe decline in quality",
            "Hol'up. We're saying the show wasn't a Buddy Cop show with Lawyers?",
            "Suits is hilarious for torontonians because they make no effort to disguise that they filmed there. Like they’ll be talking about New York bagels, and then walk out of a second cup into a beck taxi with Roy Thompson hall in the background.",
            "Louis Litt has the best character development in the show and I don't care what anyone says. Shame Mike left cause he was indeed the robin to Harvey's batman.",
            "I’ve never seen the show but that’s the face I associate it with…marketing, ads, YT shorts, I would’ve assumed it was all about him",
            "Rest easy to the GOAT, his monologues were always top notch and he would give some high quality reads.\n\n![gif](giphy|erMj4wPNpuvjsAYAbt)",
            "Don’t forget Donna and Gretchen( if that’s how it’s spelled) coming through in some clutch moments. Good show, just finished the series.",
            "Barney Stinson is the best answer for this",
            "![gif](giphy|3fNmJ20ErpkjK)",
            "They abandon the whole true Mike storyline soo fast. I want to see my genius doing more genius things"
        ]
    },
    "There's nothing else to say when it's this hot": {
        "title": "There's nothing else to say when it's this hot",
        "score": 4394,
        "url": "https://i.redd.it/7zpl2h5ttz7d1.jpeg",
        "content": "",
        "num_comments": 131,
        "comments": [
            "“Did you call the Doctor’s Office back yet?”\n\n“It’s 99 degrees outside!”",
            "This is the type of weather that keeps me from going to Central California to visit family, I just looked it up and it’s going to be 107 degrees over there tomorrow, fuck that I’ll stay where I’m at with my cool 72 degrees.",
            "I was supposed to run errands today but the temperature determined it was best to stay my goofy ass inside.",
            "I tell everyone all day, “this is why shootings increase during the summer. It’s too hot to be talking loud!” It’s too damn hot! Every year around the 2-3 week of June a heatwave hit. Every damn time!",
            "Them: “........... So you-”\n\nMe: “Man, it’s 92 degrees Fahrenheit in Atlanta and it’s fucking 6 P.M.!!”\n\nThem:\n\nhttps://preview.redd.it/vsbom7ya008d1.jpeg?width=300&format=pjpg&auto=webp&s=c16bb5d0305ec1855161bb612eece464978da239",
            "90 and up. After about an hour in that shit I can't think straight anymore. My only thought becomes about how hot it is and how I can escape it. Used to be like 95 and up but my tolerance for heat is disappearing with age",
            "![gif](giphy|xT0Gqz4x4eLd5gDtaU)",
            "Heat is one thing, the humidity will melt you.",
            "\"Did you pay your taxes?\"\n\n\n\"The UV index is set at 'High'\"",
            "Don't even wave at me if it's 85 or higher"
        ]
    }
}