{
    "r/blackcats Discord server": {
        "title": "r/blackcats Discord server",
        "score": 274,
        "url": "https://www.reddit.com/r/blackcats/comments/sfxnh0/rblackcats_discord_server/",
        "content": "Hello, r/blackcats members! The moderation team has decided to create a Discord server for you amazing members to come talk with us and fellow members, share cat pictures, memes, etc., use bot commands, and just to have fun! The official link: [https://discord.gg/EPBH4C8knw](https://discord.gg/EPBH4C8knw). We hope to see you there!",
        "num_comments": 49,
        "comments": [
            "Guys I got a black cat(male 1yo) he is in the Emergency room because of Urinary Infection, does anyone can recommend me something to prevent this? 1 st time with this situation and I have been taken care of him since he was 3 months old from the shelter and never had this :( and it breaks my heart",
            "The coat on this black kitty is soooo shinny!  💯💯💯‼️🐾🐾🐾‼️",
            "the link didn't work for me",
            "No wiping post. Transvestite gon.aceubringto me lvlngtim.",
            "c v n ? b bbb.",
            "Came here to say I looove the new sub pic!!!",
            "Dummy question, by my void has been humping Russian blue. There both 2yr same litter and spayed in 2021. But I do notice my void (male) humps Russian blue (female) and he has two balls under his bum hole. Did he actually get spayed or was it an unsuccessful attempt? Please educate me.",
            "Get Hills to Home prescription soft food. That only only let him drink distilled water. My cat has had 3 UTIs from stress, it's expensive so just pay the little bit extra for prescription food and prevent it",
            "Mine had it once, since then I've only given him urinary dry food and normal or urinary wet food. There are many brands that are not very cheap but better to spend two more bucks than to make him feel bad. Unfortunately, in males it is quite common. Hope he feel better now and in the future. 😌",
            "My baby had to go on special prescription food for UTIs and bladder stones. She lived a long 13 years! It’s not too expensive either. And multiple water fountains around the place. Her brother was a water bully!"
        ]
    },
    "Reminder: Please Flair Mourning Posts": {
        "title": "Reminder: Please Flair Mourning Posts",
        "score": 182,
        "url": "https://www.reddit.com/r/blackcats/comments/18jsg5q/reminder_please_flair_mourning_posts/",
        "content": "Hey void-lovers!\n\nMost cat subs have a very delicate balance between \"happy posts about my cat\" and \"sad posts about my cat\", specifically when it comes to pet death. A lot of them don't allow it at all. It's really tough to strike the balance of letting people who are devastated mourn the loss of their furry friend while still making the subreddit usable for people who aren't interested in that kind of content.\n\nWe allow mourning posts here, but you have to flair your post with \"Mourning\" so people who don't want to see them have the ability to filter them out. It's an imperfect solution, but it's all we have available to us with subreddit tools. Please make sure to flair all posts about pet loss with that flair so we can make a great sub for everyone.\n\nIn case you're someone who's interested in filtering out that content, [this link should work for you](https://www.reddit.com/r/blackcats/search?q=-flair%3AMourning&sort=top&restrict_sr=on&t=day). I know, it's not the cleanest way to browse the subreddit, and I'm not sure how it works on mobile. If we had a better solution, I'd provide it, but we have to work within what reddit offers us :(\n\nThanks for your understanding. If you've read this far, I encourage everyone to post some void laser eyes in the comments.",
        "num_comments": 14,
        "comments": [
            "New to the reddit community and oops he's healthy. Please disregard, I mean no disrespect.\nI'm sorry if you're grieving.",
            "![img](emote|t5_2twpw|7975)",
            "https://preview.redd.it/j73b0w2x4t6c1.jpeg?width=3120&format=pjpg&auto=webp&s=dbc1ea70eefe494a00d644308cfd28b6b7613e8c\n\nThis is the electric stinker",
            "https://preview.redd.it/u0zr2n20cjtc1.png?width=1080&format=pjpg&auto=webp&s=a11d0c5a783aa8f00a58a5f8633b16cee6bdffe8\n\nBatman.. does this color bring out the color of my eyes? American Curl- ESA",
            "https://preview.redd.it/6kz2d4mt4p6c1.jpeg?width=822&format=pjpg&auto=webp&s=eabeb8e57e4279ef8f53ea66cfdced682efcf1a4",
            "https://preview.redd.it/rzzeeuy99q6c1.png?width=2073&format=png&auto=webp&s=cff6ed40a3e94c2d451f85c7cd66c180aa14c49e",
            "https://preview.redd.it/jauki89o9q6c1.jpeg?width=3024&format=pjpg&auto=webp&s=466c1a1a417fefb0e23f0b2d23e78054bdca3636",
            "https://preview.redd.it/a4zxxj2kjs6c1.jpeg?width=3072&format=pjpg&auto=webp&s=8373cd79cbcc29c7ee7e5729536256a4b4ed4604",
            "https://preview.redd.it/uzgt2oogmt6c1.jpeg?width=2284&format=pjpg&auto=webp&s=7bcb73c659fd02c7b5a43c49633096c6129e5b63",
            "https://preview.redd.it/jai3ccywz0cc1.png?width=1417&format=png&auto=webp&s=813e3ff76c5ea948588baebbddc9f207b1bc9d2c"
        ]
    },
    "My neighbours void comes to meet my cute void, they both are sitting ans seems like they are sisters. Also show me your void please": {
        "title": "My neighbours void comes to meet my cute void, they both are sitting ans seems like they are sisters. Also show me your void please",
        "score": 663,
        "url": "https://i.redd.it/zava8fzngi9d1.jpeg",
        "content": "",
        "num_comments": 40,
        "comments": [
            "A cute post featuring two black cats meeting each other.",
            "They're beautiful!\n\nMy bat's not here anymore, but he was a beautiful void too.",
            "You can have Void Play Dates!",
            "Another Facebook repost bot, the same caption structure, baiting members to interact, mods pleaaaseee do something about these accounts",
            "Is this a real account? Post history and weird wording on this post and previous posts makes it seem odd.",
            "This is also an AI picture by the way",
            "I feel judged all of a sudden.",
            "What have you done to them?",
            "The one on the right: so angry\n\nThe one on the left: not angry, just very dissapointed",
            "So many twins!!! 😍 Can you tell them apart easily?"
        ]
    },
    "Who’s your void named after?": {
        "title": "Who’s your void named after?",
        "score": 11691,
        "url": "https://www.reddit.com/gallery/1dqs36m",
        "content": "This is my Luanne, and she’s named after Luanne Leanne Platter from King of the Hill. ",
        "num_comments": 2627,
        "comments": [
            "I mean.... Who else?\n\n![gif](giphy|sgVb9gX9DpYEo)",
            "Salem Tituba the Witch, after the first witch of Salem. She said, \"yes, i am a witch\" and they didn't kill her. lol",
            "I just adopted a baby girl and named her wednesday",
            "Roswell. He was born on the day the nerds were gonna storm Area 51.",
            "Tommen Lanister from Game of thrones, he was the only sweet one in that entire family and he got to marry the best women in the show",
            "Our girl's named Ripley\n\n![gif](giphy|l41Yr7l5IEJQhFAVq)",
            "Guthrum, AKA Æthelstan, King of the Danelaw.",
            "Jebei, one of the best Mongolian Generals to Ghengis Khan.",
            "Welp, my void is named Void",
            "Zoidberg, the character from Futurama, due to how he ate his food as a kitten. We now call him the Zoid The Void. He’s a chonky boi."
        ]
    },
    "Folks, it has finally happened": {
        "title": "Folks, it has finally happened",
        "score": 2117,
        "url": "https://www.reddit.com/gallery/1dqy3uh",
        "content": "",
        "num_comments": 36,
        "comments": [
            "your kitties face is so darling. they’re like, “do. not. say. a. word.”",
            "Doggo ain't so bad afterall!",
            "Aw your cat has a pet dog, so cute",
            "The cat knows doggo is recovering.",
            "in all do time 💖",
            "r/catswithdogs would enjoy these cuties.",
            "Cats purrs are healing so maybe she’s trying to speed up the healing process so the corgi can stop hogging attention? 🤣🤣🤣 sweet anyway",
            "What order did you get them in?",
            "She thinks it’s a squishy soft pillow",
            "Exactly! I couldn’t even believe it"
        ]
    }
}