{
    "99% of people get this wrong!": {
        "title": "99% of people get this wrong!",
        "score": 17387,
        "url": "https://v.redd.it/gnkc0wd6nf9d1",
        "content": "",
        "num_comments": 250,
        "comments": [
            "Sleight of hand is my favourite magic because even knowing exactly what's going on, it's still magic.",
            "No words can describe how much I love \"YES! Orange.\"",
            "This guy has half of his stat points in charisma.",
            "I wish I could sustain this guys energy for like, 5 seconds. Boy, would I get shit done.",
            "That showman \"YES!\" Despite whatever the audience says is always priceless.",
            "You can see a glimpse of the orange in his pouch between .08 and .09. He puts the orange in right after revealing cup C. At around .23 - .24",
            "It's to late for me to be thinking about magic",
            "Classic sleight of hand. It's an oldie but goodie, and his showmanship is solid.",
            "Him tapping the cups with the stick and them smacking the table with it was satisfying.",
            "Fruit sellers hate him for this one trick..."
        ]
    },
    "Bro is completely sober but never felt more high in his life ": {
        "title": "Bro is completely sober but never felt more high in his life ",
        "score": 2437,
        "url": "https://v.redd.it/7vnnz98oxg9d1",
        "content": "",
        "num_comments": 44,
        "comments": [
            "Ohhhhh Collapsible hanger.....Understandable! Have a Nice day",
            "He was convinced until the hanger came out",
            "You missed the climax where he pulled out a fucken IRON",
            "Why not post the whole version?",
            "I couldn't be a magician.  I'd be laughing too much.  Great routine.",
            "I miss Michael Carbonaro and his show",
            "The combination of Candid Camera and magic tricks was an absolute masterstroke. I love this guy's show.",
            "Home boy face was like....damn that weed hitting hard af",
            "People will believe anything if the person in front of them would say totally unbelievable and nonsensical stuff just confidently enough.",
            "My mind playing tricks on me lol Nice1"
        ]
    },
    "Sign in my city inexplicably shaking for a while.": {
        "title": "Sign in my city inexplicably shaking for a while.",
        "score": 5495,
        "url": "https://v.redd.it/zj5elgts479d1",
        "content": "This was actually the 2nd video I took and the sign was shaking even more violently in the first one. Ground wasn’t shaking as I stood right on top of it. No clue what caused it. ",
        "num_comments": 403,
        "comments": [
            "The answer is under those steel plates",
            "The same guy who did a video on acoustic lasers and on how animals hear in comparison to humans, also did a video on infrasound.  I believe the main takeaway was about trains and gas lines (particularly the latter).",
            "big truck down the street idling - the idling engine resonates with the concrete and shakes everything just ever so slightly. since the pole is at just the right angle and just the right amount of floppiness its super effective.\n\nit used to happen to me all the time in my old neighborhood. trucks would park on the top of the street and my entire bedroom would shake. it was nauseating. i only figured it out after noticing the accompanying sound on a quiet day.",
            "There's someone trapped underground, hoping someone on the surface will see it, and rescue them.",
            "Not saying its CHUD but its CHUD",
            "Resonance frequencies. There's smaller vibrations that he can't see. But they vibe with that sign post.",
            "If theres anything ive learned from reddit the past few days, its that the shaking is caused by crocodiles that live in the concrete",
            "Ive seen this once before in my life, I was very young and I saw a stop sign doing the same wobble, vigorously. I asked my mom how can that happen she said no idea, maybe the wind? But there was no wind!",
            "For the life of me, I can't tell if the cameraman or the post are shaking worse.",
            "Graboids are active underneath the area."
        ]
    },
    "Glitchy Old TVs": {
        "title": "Glitchy Old TVs",
        "score": 2615,
        "url": "https://v.redd.it/03cyru3y769d1",
        "content": "",
        "num_comments": 66,
        "comments": [
            "Im fairly certain this is nothing to do with the tvs being glitchy\n\nThis looks exactly like they made it look",
            "You just need to degauss the monitor, itll be fine.",
            "You cannot fool us, bro",
            "Can someone help me with the song please?",
            "Visual effects are not glitches",
            "What is the song please ?",
            "Reminds me of Kane from Robocop 2",
            "New music video idea just dropped",
            "You can see the hand, the hand is covered with something",
            "I remember doing this to my parent's TV when I was a kid. I had to get my hands closer to the screen though, a couple of inches from it."
        ]
    },
    "But how!?!": {
        "title": "But how!?!",
        "score": 16515,
        "url": "https://v.redd.it/7wdhxgqivw8d1",
        "content": "",
        "num_comments": 327,
        "comments": [
            "Notice how he barely moves his left leg? There is a metal skeleton brace system inside his clothes. It has a gimbal on it so it can rotate like that. It is attached to a metal anchor in his arm, that he locks into that hose which also has a metal brace inside of it.",
            "But the real question is: How is he getting down?",
            "The moment I saw the first opening still frame I was like \"I have no idea what he's going to do, but I know the answer is that there's a very strong rigid metal frame hidden inside his bulky clothing\"",
            "Fake!! Real fire fighters are clean shaven",
            "I always wonder who was the first dude to do this in public and what gave him the idea to even try.",
            "All I could think was \"You paint yourself like a statue and move about all over the place. Stay the fuck still!\"",
            "I like how he uses the strap with his right hand as a distraction but unfortunately when he acts like he's going to attach it and then doesn't. Really draws attention to that movement. And you can see him attach the bar in his arm to the pipe instead. It's cool at first but really after he holds it tight your like. Well... why the fu*k have it then.",
            "Look how as he got up onto the bar, he barely moved his left arm. There's a brace inside the sleeve and inside the thick clothing. Likely to also have small locking mechanics by doing different movements to allow him to move around and stay put.",
            "If you saw that in real life would you walk over and throw him some money? I'd not.",
            "People just walking by casually like they see this shit every day"
        ]
    }
}