{
    "Daily Questions and Answers Post - FAQ, New/Returning Player Questions, and Useful Starting Resources!": {
        "title": "Daily Questions and Answers Post - FAQ, New/Returning Player Questions, and Useful Starting Resources!",
        "score": 1,
        "url": "https://www.reddit.com/r/blackdesertonline/comments/1dpipob/daily_questions_and_answers_post_faq_newreturning/",
        "content": "&#x200B;\n\nHello and welcome to [r/BlackDesertOnline](https://www.reddit.com/r/BlackDesertOnline/)! Please use this thread to ask any simple, frequently asked questions you have about the game. If your post was removed from the subreddit for being a commonly asked question, this is the right place for you to be! This thread is refreshed every three days to allow time for responses, but in a pinch you should use this post for links to helpful resources.\n\n&#x200B;\n\n**Don't play Black Desert on PC? Try these subreddits for more specific help:**\n\nBlack Desert for Console | r/PlayBlackDesert\n\nBlack Desert Mobile | r/BlackDesertMobile\n\n&#x200B;\n\n**For new or returning players, you may find a quick answer to your FAQ's with these helpful links**:\n\n&#x200B;\n\n* [Black Desert Online Forums](https://www.naeu.playblackdesert.com/en-US/Forum/Main) \\- Official forums for Black Desert Online provided by Pearl Aybss.\n* [\"Is It Worth Playing in 2024?\"](https://www.youtube.com/watch?v=CPjExX4eLnk) \\-Concerns & Reality of Black Desert Online by EvilDoUsHarm.\n* [Gearing Guide](https://www.youtube.com/watch?v=vTRCe7HHgi4) \\- Gearing Guide by Choice.\n* [GrumpyGreenCricket](https://grumpygreen.cricket/index.html) \\- Community Game Guides and New Player Resources.\n* [BDOCodex](https://bdocodex.com/) \\- General Wiki and Quest/Knowledge resources.\n* [Lifeskill info and calculator](https://bdolytics.com/) \\- General lifeskill & market info.\n* [Garmoth](https://garmoth.com/) \\- Helpful tools for planing your gear path, tracking grind sessions and other useful resourses.\n* [Discord Servers](https://www.reddit.com/r/blackdesertonline/wiki/discord_channels) \\- r/blackdesertonline \\- Wiki list of Official and Community driven discord servers.\n* [Official Black Desert Website](https://www.naeu.playblackdesert.com/en-US/Main/Index)\n\n**Black Desert on Social Media:**\n\n* [twitter.com/NewsBlackDesert](https://twitter.com/NewsBlackDesert)\n* [instagram.com/BlackDesertGame](https://www.instagram.com/BlackDesertGame)\n* [twitch.tv/blackdesertgame](https://www.twitch.tv/blackdesertgame)\n* [facebook.com/NewsBlackDesert](https://www.facebook.com/NewsBlackDesert)\n* [youtube.com/c/BlackDesertOnline](https://www.youtube.com/c/BlackDesertOnline)\n* [discord.gg/blackdesertonline](https://discord.gg/blackdesertonline)\n\n&#x200B;\n\nIssue with the subreddit or your post/comments? [Message the mods](https://www.reddit.com/message/compose?to=/r/blackdesertonline). **(not in-game/BDO support)**\n\nIssue with reddit or your reddit account? [Send a ticket to reddit help](https://reddit.zendesk.com/hc/en-us). **(not in-game/BDO support)**",
        "num_comments": 40,
        "comments": [
            "Currently 270AP/317DP Succ Lahn, been grinding Sherek for pot piece, but looking to switch up spots so I have more variety. Where should I be grinding at these stats?",
            "Hi, I have TET urugon from season that I cannot enhance.  Can I still make it pen with jetina quest and then put caphra on it ?",
            "i'm new to the game and probably will play the new class as my first, will i be missing a lot from the ongoing event that gives a pen tarnished sword? should i make a character now ?",
            "What's a good fs to try tapping PEN BS? 200?",
            "Anyone have a link what the 'Choose your 10 years outfit boxes' look like?",
            "Hi, i'm looking for Momento Mori outfit for Sorceress class. I've pre ordered it since day one on CM but still no drop. How can i find someone to trade it to me?",
            "hey where can i grind for caphars with 285 ap/342 dp",
            "The new class Dosa is coming out next week, yes? Does this mean we'll get an additional season ticket?",
            "is there some way to get combat exp transfer scroll for free now? (other than pit of undying)",
            "Do you have the other potion pieces yet?  There's 6 spots for them if you include the mana pot, and they're all doable at your gear score.  Other than those, you could try Valencia spots like Pila Ku and Hystria/Aakman."
        ]
    },
    "[Update] June 26th 2024 - Free PEN Blackstar, Jordine Saga, NW rule changes": {
        "title": "[Update] June 26th 2024 - Free PEN Blackstar, Jordine Saga, NW rule changes",
        "score": 12,
        "url": "https://www.reddit.com/r/blackdesertonline/comments/1dot5w4/update_june_26th_2024_free_pen_blackstar_jordine/",
        "content": "**Summary**\n\n* Free PEN Blackstar (Lv 61 + Main quest line)\n* Jordine Saga + Serendia starting quest\n* Class fixes\n* Hakoven min cc 300 + Fixed number of Tidal Black Stones from Khan\n* Deboreka from Dark Rift\n* No cheer Specter's Energy\n* Removed basic lifeskill tools\n* CotD + Tungrad Ruins minor improve\n* Pot piece weekly quest easier\n* Node war forts activation rule changes (50% applied members)\n\n**Event**\n\n* *Tarnished Sword* enhance with *Light Aura*\n* Golden Treasure Chest in Coastal Cliff Velia\n* Recruit new Guild members for 10B guild fund\n* Summer Package sale\n\n[Patchnotes](https://blackdesert.pearlabyss.com/ASIA/en-us/News/Notice/Detail?_boardNo=6241)",
        "num_comments": 9,
        "comments": [
            "So patch notes just confirmed that dosa isnt ascension class, noice",
            "Yeah, they will give out 34 pens or whatever the number of max chqracter slots is /s",
            "Once per family (of course). Same as the free TET.",
            "Like archer and scholar, too bad 2Heads downvote actual information saj",
            "whaaaatttttttt? I didnt get you. Does every character get a free PEN?",
            "No, he's making fun of the absurd question, lol. You don't get ~3-4 trillion worth of free loot, just one weapon upgrade (that's still really good) to help you get the new weapons",
            "Dude he even put the /s, come on man that's even meant for the Redditors who can't get sarcasm and it still missed you",
            "I knew it lol....think i was just hoping for my absurd wish to come true.....one PEN for each char.",
            "[deleted]",
            "Ascension class?"
        ]
    },
    "Where to grind man": {
        "title": "Where to grind man",
        "score": 84,
        "url": "https://i.redd.it/qnnanjglhh9d1.jpeg",
        "content": "",
        "num_comments": 21,
        "comments": [
            "IRL and then swipe /s",
            "Idk I'm making a bunch of silver at TR. If you can pull 22k to 25k avg tl, you'll be making solid silver.  Also, aren't dawns kinda going back up a little bit?",
            "Are people seriously bitching because they can't grind for 12 hours straight to get exclusive high silver items while I'm at work for 14 hours?",
            "Flame/embers spots still exist. Price of those wont go down any time soon",
            "Grind something you enjoy instead of chasing higher silver per hr?",
            "Would you be surprised that the IRL stock market works the same way. It's a game, chill. Grind for fun. BDO is a marathon.",
            "Why do you stress over it when everything drops in price anyway?",
            "Bdo doesnt have a stable market or player base. The Pool of \"need\" dries out fast when people grind the spot being the best silver.  Filling the market at an unhealthy rate. \n\nPure silver spots will always maintain their value, while drop spots will die. Its  been like this forever. The devs suck.",
            "i heard centaur is good spot",
            "No, it's cause 2b/hr in zones is going away and becoming 1.2-1.4b why do dehkia when gyfins makes the same money. It's the problem we once had before of zones being populated by 700+ gs in 500-600gs zones cause why do anything that can do dmg to me when I can one tap mobs for the SAME silver/hr. Dehkia Thornwood is utterly pointless for money now with omins at 80m. High gear people will over populate mid game again and either cause drama with grinding over others or you'll be forced to the marni realm. Right now only debos are going to provide that higher silver gain, for now. If they tank in price it may end up not worth cronning from base."
        ]
    },
    "I'm literally still shaking. Obliterating Fallen God, Agris 124/1000, 436 fs, 0.1115%": {
        "title": "I'm literally still shaking. Obliterating Fallen God, Agris 124/1000, 436 fs, 0.1115%",
        "score": 162,
        "url": "https://youtu.be/BC2bFPNTT1c?si=cbx-ZtcKJ5PThufI",
        "content": "",
        "num_comments": 56,
        "comments": [
            "This mad lad skipped animation all of them and then decided to not skip on the one that was actually going to land. Obliterating Fallen God, actually paid actor",
            "Grats, that's crazy. Is this NA? If so, I imagine is the first NA piece ever made? Haven't heard of any other.\n\nEdit: why the hell is your game screen the size of a football field.",
            "what in the name of J",
            "Carri-… just kidding grats that’s crazy!",
            "“We are very sorry adventurers. The enhancement rates seem to be bugged. We will be performing temporary maintenance and reversing all enhancements made in the last hour. Sorry for the inconvenience.”",
            "perfect. now you go for + 10 Sovereign or what?",
            "That’s insane, has to be one of the first… and will most likely be one of the last for a while",
            "After this I think you’re ready to tap naru gear",
            "hot damn how did you know to not skip animation? big gratz",
            "gg gz! \nalso is that for real 0.11%? Why would anyone try that."
        ]
    },
    "I know this is probably not  priority but it would be nice to equip Primavera shoes with  Academia set without having to wear two pair of socks. ": {
        "title": "I know this is probably not  priority but it would be nice to equip Primavera shoes with  Academia set without having to wear two pair of socks. ",
        "score": 13,
        "url": "https://i.redd.it/eqb9femkxh9d1.png",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}