{
    "Daily Questions and Answers Post - FAQ, New/Returning Player Questions, and Useful Starting Resources!": {
        "title": "Daily Questions and Answers Post - FAQ, New/Returning Player Questions, and Useful Starting Resources!",
        "score": 0,
        "url": "https://www.reddit.com/r/blackdesertonline/comments/1dkvgif/daily_questions_and_answers_post_faq_newreturning/",
        "content": "&#x200B;\n\nHello and welcome to [r/BlackDesertOnline](https://www.reddit.com/r/BlackDesertOnline/)! Please use this thread to ask any simple, frequently asked questions you have about the game. If your post was removed from the subreddit for being a commonly asked question, this is the right place for you to be! This thread is refreshed every three days to allow time for responses, but in a pinch you should use this post for links to helpful resources.\n\n&#x200B;\n\n**Don't play Black Desert on PC? Try these subreddits for more specific help:**\n\nBlack Desert for Console | r/PlayBlackDesert\n\nBlack Desert Mobile | r/BlackDesertMobile\n\n&#x200B;\n\n**For new or returning players, you may find a quick answer to your FAQ's with these helpful links**:\n\n&#x200B;\n\n* [Black Desert Online Forums](https://www.naeu.playblackdesert.com/en-US/Forum/Main) \\- Official forums for Black Desert Online provided by Pearl Aybss.\n* [\"Is It Worth Playing in 2024?\"](https://www.youtube.com/watch?v=CPjExX4eLnk) \\-Concerns & Reality of Black Desert Online by EvilDoUsHarm.\n* [Gearing Guide](https://www.youtube.com/watch?v=vTRCe7HHgi4) \\- Gearing Guide by Choice.\n* [GrumpyGreenCricket](https://grumpygreen.cricket/index.html) \\- Community Game Guides and New Player Resources.\n* [BDOCodex](https://bdocodex.com/) \\- General Wiki and Quest/Knowledge resources.\n* [Lifeskill info and calculator](https://bdolytics.com/) \\- General lifeskill & market info.\n* [Garmoth](https://garmoth.com/) \\- Helpful tools for planing your gear path, tracking grind sessions and other useful resourses.\n* [Discord Servers](https://www.reddit.com/r/blackdesertonline/wiki/discord_channels) \\- r/blackdesertonline \\- Wiki list of Official and Community driven discord servers.\n* [Official Black Desert Website](https://www.naeu.playblackdesert.com/en-US/Main/Index)\n\n**Black Desert on Social Media:**\n\n* [twitter.com/NewsBlackDesert](https://twitter.com/NewsBlackDesert)\n* [instagram.com/BlackDesertGame](https://www.instagram.com/BlackDesertGame)\n* [twitch.tv/blackdesertgame](https://www.twitch.tv/blackdesertgame)\n* [facebook.com/NewsBlackDesert](https://www.facebook.com/NewsBlackDesert)\n* [youtube.com/c/BlackDesertOnline](https://www.youtube.com/c/BlackDesertOnline)\n* [discord.gg/blackdesertonline](https://discord.gg/blackdesertonline)\n\n&#x200B;\n\nIssue with the subreddit or your post/comments? [Message the mods](https://www.reddit.com/message/compose?to=/r/blackdesertonline). **(not in-game/BDO support)**\n\nIssue with reddit or your reddit account? [Send a ticket to reddit help](https://reddit.zendesk.com/hc/en-us). **(not in-game/BDO support)**",
        "num_comments": 26,
        "comments": [
            "Why's there so many carriages? Isn't trading disabled?",
            "is there some sort of black desert lore subreddit?",
            "They changed valencia sea fishes?",
            "(New here) Is my game laggy or damage distribution in this game is very weird. I play archer and sometimes my left click barely do any damage,but sometimes it instantly kills monsters. Also is large part of your dmg from skills? does auto atk do no dmg?",
            "Wasn't they supposed to be a ps5 native version in 2024 any word on that or was that a lie",
            "I got a t3 fairy to lvl 30 and she has Miraculous Cheer 4 (other skills aren't so relevant, but they are Feathery Steps 1 and Tingling Breath 3)\n\nI'm wondering here if I should go for a t4 and see if I can get cheer 5 and possibly a better feathery steps and continuous care as well or if cheer 4 is enough",
            "I feel like the 1000% combat exp buff isn't active as I literally only get like around 0.50% exp per kill. Lvl 58 character.",
            "I posted this as a text post but it was removed by automod so I guess I have to ask here.\n\nI and a friend of mine have decided to give BDO a try, and as was suggested by several guides (and common sense), we made seasonal characters. Now, for a new player the game is quite confusing and overwhelming, at first anyway. And since we're not playing together every day, and it's not the only game we play anyway, I wanted to do what I've done in several MMOs in the past, and make a second character alongside to play alone and at my own pace, to help learn the game better, to try out a different class and to fill the time in between us playing together.\n\nHowever, the button to make a seasonal character is greyed out, and after a little bit of googling, I've learned that while you can make several seasonal characters, you apparently can't do so at the same time. So, it seems like my options right now are:\n\n* Delete the current character and make a new one, which I obviously don't want to do.\n* Continue playing the character I have and abandon my friend, which I also don't want to do.\n* Don't play the game alone at all, and wait to see if and when we continue together, which I didn't want to do but to my surprise seems to be what the game wants at this point.\n* Make a non-seasonal character, which every guide under the sun warns new players not to do.\n\nAm I understanding this correctly, that making multiple characters as a new player is heavily discouraged? Or is making a non-seasonal character not that big a deal? How big a difference does being on a seasonal character make? What does the game actually want me to do at this point, and what would be your suggestion?\n\nAnd as a side question, how do items and currencies work when graduating a character to non-seasonal? Do I lose access to everything in my storage, does it move with me, or are the storages shared to begin with? Is the central market shared or separate? And what about seasonal-only items, do those simply disappear?\n\nSorry for the slew of questions, but that's probably the usual new player experience. 😅",
            "https://preview.redd.it/15jrsyzyx38d1.jpeg?width=740&format=pjpg&auto=webp&s=da916ec1a42a2a10f06e03d64507c6d65b5f3fb8\n\ni came back to the game today and saw this. What should i choose? How the dim origin works?",
            "So my main, Archer, is a bit gimped right now because of the issues after the recent changes. Looking for a fun class to play/tag and maybe try low-tier PvP on. Ideally, not too finger-breaking, but also not a one button grinder. Any suggestions please?"
        ]
    },
    "[Update] June 19th 2024: CLASS CHANGES": {
        "title": "[Update] June 19th 2024: CLASS CHANGES",
        "score": 21,
        "url": "https://www.reddit.com/r/blackdesertonline/comments/1djdneu/update_june_19th_2024_class_changes/",
        "content": "**Summary**\n\n* Class hit counts change\n* Evasion, accuracy, damage reduction revamp\n* Class balance based on changes\n* **Dark Rift Event June 26th**\n* Dahn's Gloves, Ator's Shoes exchange quest\n* Monster zone AP change\n* Node war caps change + add medals to reward\n\n**Heidel Ball June 22nd**\n\n[https://blackdesert.pearlabyss.com/ASIA/en-us/News/Notice/Detail?\\_boardNo=6213](https://blackdesert.pearlabyss.com/ASIA/en-us/News/Notice/Detail?_boardNo=6213)",
        "num_comments": 86,
        "comments": [
            "I just pray they don't reset all skills, addons, presets with this update ...",
            "After doing some PvE post patch all I can say damn, that patch really did wonders for how game feels. It's so much smoother on a lot of classes. \n\nAlso correct me if I'm wrong and just seeing things but I think hit count change is actual buff for early game spots although very tiny. Mobs die earlier into animation meaning loot cycle starts faster.",
            "This change blows... some classes feel very clunky with the hit changes... and with the Insane amount of DR classes got, you just can't get out enough damage with the server latency + reduced hit counts...",
            "This patch has broken uncapped PvP. Caps feel like they probably should, but uncapped is ridiculous. I no longer deal damage in pvp with 324 ap. And no, it's not an 'accuracy' issue - misses are very clearly communicated. I literally deal no damage anymore.",
            "This is the worst patch they have ever came out with, second to only renown score",
            "I played RBF as 317 \\\\ 420 awk ninja\n\nClass is unusable here unless you have full pen deborika. You can't kill anyone who is decently geared and is not an archer. And I'm talking not about \"1\\\\3 health left\", I'm talking about \"full double combo leaves 9\\\\10 health\" of any drakania, striker, warrior, zerker or smth. \n\nI even had a situation where TWO ninjas (me and another one) couldn't even scratch Valkyrie, there were no \"Miss\" icons, then she got up and two-skilled us both. When I asked in chat her gear, the answer was 317\\\\423 or something like that.  \nI have 317 \\\\ 420 with + lightstone combo + crystals for pvp. The other ninja has something like that too.\n\n  \nI'm literally f\\*\\*\\* not going to rbf or Arsha again until . Same for AoS, NW etc. Because I'm not going to switch class and I'm tired of progressing, finally being able to PVP competetively and soon after again getting turned into a punchbag for meta boys.\n\nI guess I'll sell some of my gear to upgrade my manos set and to leave enough gear to sometimes grind Elvia or smth when I'm tired of lifeskilling.",
            "how is warrior pve now? was thinking about comign back. but sounds like not much reason to? they still insisting on these stupid class overhauls? reusing the same content by changing some numbers in a text file.",
            "J ruined his game",
            "PVP is deader than dead.",
            "Went to farm orcs on a succ lahn for a round... many of the combo skills now execute much faster, which drastically increased my dmg output and clearing speed - I've pulled \\~20 % more trash in the hour than what was my personal best here.\n\nWith SA/guard, I took about the usual amount of dmg, but the moment the orcs caught me without any guard up, they almost deleted me in a few seconds.\n\nSo, I feel like I've become a lot more glass cannon-ish."
        ]
    },
    "Etsu better apologize now!": {
        "title": "Etsu better apologize now!",
        "score": 119,
        "url": "https://i.redd.it/cahsvrhrx28d1.png",
        "content": "",
        "num_comments": 8,
        "comments": [
            "PA: No more PvP in-game.\n\nBlue: Okay, then let's PvP in real life.\n\n😅😅😅",
            "Blue is picking fights with ferrinas again…",
            "I want my NWs back....  So let's fuck him up together!",
            "2 bald guys.. Average BDO player",
            "As if blue has ever done open world pvp.",
            "But why are there two blues",
            "This will be his first time then. 😅😅",
            "Nah that’s tectone farming twitter for another video"
        ]
    },
    "Forum feedback: Allow players to store one Fairy": {
        "title": "Forum feedback: Allow players to store one Fairy",
        "score": 32,
        "url": "https://www.reddit.com/r/blackdesertonline/comments/1dltst8/forum_feedback_allow_players_to_store_one_fairy/",
        "content": "[https://www.naeu.playblackdesert.com/en-US/Forum/ForumTopic/Detail?\\_topicNo=57200&\\_page=1](https://www.naeu.playblackdesert.com/en-US/Forum/ForumTopic/Detail?_topicNo=57200&_page=1)\n\n  \nI just posted this topic in the feedback forum, please share and vote if you agree! \n\n\n\n# Problem:\n\nMany players consider a Perfect Fairy\\* a goal to achieve, but the current system makes this unnecessarily difficult.\n\nEspecially for players who are unable or unwilling to buy Theia's Orbs from the Pearl Shop.\n\n\n\nThe current system follows a simple method:\n\n1. (Optional) Obtain a T3 fairy and sprout her to T4\n\n2. Feed the fairy blue gear until the next level and hope for the right skill\n\n3. If you get the wrong skill, reset the fairy and try again\n\n\n\nThe difficulty with this method is that you may end up getting lucky at the start and get two key skills at level V but get unlucky with the third skill.\n\nNow you are left with a **hard** choice: Settle for two key skills **or** reset the fairy and risk not getting those key skills again (leading you to reset again and again until you succeed).\n\n\n\nWhile it is true that all you need is silver to try again, it requires that you either save up a large amount of silver to try enough times to succeed **or** you take a step back in the progression while you save up more silver to try again.\n\n\n\n\\* Miraculous Cheer V, Feathery Steps V, Continous Care V, Fairy's Tear IV and Morning Light (one of the last two may be swapped for Tingeling Breath V for a life skiller)\n\n\n\n# Proposed solution:\n\nThis problem is similar to how we enhance our gear (an attempt might fail and put you back). Unlike that system, we have **no** safe guards.\n\nFor gear enhancing we have options, such as using Cron Stones or upgrading a second copy from the gear we're using.\n\n\n\nI propose that a system be implemented where players can store ***a single*** fairy in the \"Unstable Crevice**\"** at the Kamasylve Temple node for a **large** silver fee.\n\n\n\nThis would mean that players could **store** their current T4 fairy and try again on a new fairy.\n\nIf that fairy doesn't obtain the right skills, they can release her and then take out their **stored** fairy to keep playing until they are able to try again.\n\n  \n",
        "num_comments": 6,
        "comments": [
            "I'm all in for this and this post needs to be boosted more",
            "IT would be huge, but doubt we will get it because theia orbs would get less usefull. Currently I have quite good T3 fairy (3 out of 4 skills I want). Do I risk upgrading it to T4 and getting worse skills? Ofc not. So Im stuck with T3 untill I swipe for theia orbs (they seem to not give them for free anymore) which I prolly wont ever do.\n\nYou cant even reset ur bad T4 fairy and retry for free. You also need Pearl Shop item for that which is just ridiculus.",
            "Imo the quickest way to fix this issue is to let it cost one orb to change a skill regardless of levels. Unlike now where it increases by one orb every time a new skill is learned. This would require minimum effort and time for PA to implement and make it a whole lot easier for players.",
            "How about we just make an system where it can be achieved in a decent manner without having to buy it. Let whales speed up the process with buying it, just make a time gated way to do it for free. (Ideally no P2W at all but that’s for my dreams)",
            "the problem still is that a t3 doesnt have the option to unlock the highest skill level or the skill continuous care. the last one is more endgame to manage elixir rota, III is even enough. but not having 2s potion use is unplayable for classes with bad/long cd heals.",
            "getting t4 fairy is ez af bro"
        ]
    },
    "Witch in Memento Mori Combination": {
        "title": "Witch in Memento Mori Combination",
        "score": 17,
        "url": "https://www.reddit.com/gallery/1dlox0s",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Wow looks great, is this the standard hood?\nCan you share colors maybe?"
        ]
    }
}