{
    "/r/BlackPeopleTwitter Weekly Discussion Thread": {
        "title": "/r/BlackPeopleTwitter Weekly Discussion Thread",
        "score": 13,
        "url": "https://www.reddit.com/r/BlackPeopleTwitter/comments/1dne6bd/rblackpeopletwitter_weekly_discussion_thread/",
        "content": "Hey r/BlackPeopleTwitter, welcome to our weekly discussion thread.\n\nFeel free to use this thread to discuss whatever you want. You can discuss the state of the sub/meta post, shitpost, post non-twitter memes, or discuss whats going on in your life. Just keep in mind that we ask you stay friendly, civil, and adhere to the [subreddit rules](https://www.reddit.com/r/BlackPeopleTwitter/about/rules/).",
        "num_comments": 58,
        "comments": [
            "My daughter got all A’s and AB’s for the school year so I told her I would get her something. She wants some jewelry. She’s become a little bit more responsible (she’s 12), so I said ok cool let’s go get you a necklace. We get to the jewelry place last weekend and she proceeds to pick out the loudest thing she could find. I told her that getting something smaller would t cause so much attention. She walks off and proceeds to get on her phone…I keep looking and she comes back with a picture of a African king with all gold and says “Well if it was good for him why can’t I do it?” Don’t have kids people.",
            "Not gonna lie gang, got my dream job, my best friend and I, always had feelings for each other and was both single at the same time and finally are together, took her to DR randomly for our birthday (we have the same birthday), and just been loving life. I know the 2nd half of this year about to be wild but damn am I content right now. Life is good. Wanna give this woman a Tiffany and goddamn, I might marry this girl.",
            "My body dysmorphia has been whooping my ass recently. I’ve been in therapy consistently for more than two years but it doesn’t seem to help. I’ve been feeling so exhausted lately from the breakdowns and flare ups. I don’t want to hate my body anymore but I don’t know how.\n\nIt is such a lonely feeling to experience something like this, especially as a black man, because people don’t know what to do with it when I tell them. I don’t know how to overcome this.",
            "I’m about to turn 24 and I’m still figuring out what to do as a career. Rn im trying to go back to school to become a medical lab tech, but im scared that im making the wrong choice. Idk man this shit weights on you a lot. I wish i knew what i wanted to do",
            "I’m in the process of relocating to another city. I am utterly pissed off about how much junk I have acquired in the last three years. Because why do I need two crockpots and  two George Foreman grills? What goes on in my head when I’m buying stuff",
            "I finally started Snowfall last month. Just finished season 6 on Thursday. Man, when I tell you that finale had me fucked up lol. Was close to tears at multiple points. Finally broke down at the last scene. Just amazing television. Now I gotta find something to fill the void...",
            "I’m about to drop my 4th song, it’ll be my 2nd with a semi big artist.  I’m not quite where I wanna be publicity wise but I’m happy to have the opportunities I have this early in my “career“",
            "A couple months ago, I commented on here that Greta was that girl and some dude called me autistic and threatened me. I was thinking about it today like was it ever that serious?",
            "I’ve been watching Castlevania lately and I hate Hector so much. I can’t recall the last time I seen a character go out that many times. and when you compare his character to somebody like Isaac, they are on two different planets when it comes to characterization. I love most of the characters, but for some reason, I look at Hector and I just shake my head in shame.",
            "Drop some good watches/shows right now that you’re watching im currently watching the boys! And stax records documentary and clipped (about what happened to the clippers during Donald sterling’s controversy) just finished bridgerton(show outside my usual stuff but if you a lover boy like me you will enjoy) I’m waiting on the bear which comes out end of month! I enjoy reality tv too!"
        ]
    },
    "Lebron James with his son Bronny James in the 2006 season, today Bronny was drafted on his dad's team. LeBron and Bronny James will become the first ever father-son duo to be in the NBA at the same time.": {
        "title": "Lebron James with his son Bronny James in the 2006 season, today Bronny was drafted on his dad's team. LeBron and Bronny James will become the first ever father-son duo to be in the NBA at the same time.",
        "score": 12409,
        "url": "https://i.redd.it/pmitelqs079d1.jpeg",
        "content": "",
        "num_comments": 335,
        "comments": [
            "I hope Bronny can continue playing for the next 20 years so they can retire together",
            "I love that for them. When I worked with my dad all he did was get on my nerves lmfao.",
            "i don't follow basketball, is lebron still one of the best players in the league? i know he's an all-timer but this post just made me consider his age for the first time",
            "Black nepotism, I love it.\n\n![gif](giphy|HloNK1z39EkEQcreIo)",
            "Bronnys dad got him into the NBA and my dad forgets to wish me a happy birthday every year… and it’s 3 days after his.",
            "![gif](giphy|pafpjPq5LdHuE)\n\nJust like the Griffeys. So cool",
            "Well shit it actually happened. This is gonna be wild to see.",
            "I hope they have a good family therapist on speed dial. The Thanksgiving fights they're in for are gonna be epic....",
            "NBA full of nepotism at the owner and front office level.  If this was Larry Joe and his kid this would be met with so much praise. \n\nThem James Sr and James Jr jerseys gone be hard",
            "People hating on this shit like it affect them and I don’t understand"
        ]
    },
    "Post-debate Waffle House": {
        "title": "Post-debate Waffle House",
        "score": 24938,
        "url": "https://v.redd.it/1a5413p6ve9d1",
        "content": "",
        "num_comments": 895,
        "comments": [
            "He got that muscle memory from Obama….",
            "Damn he was pretty smooth with it too",
            "Obama and Biden in a secret room in the white house. \n\nObama: Now what i'm going to teach you is the Dap. This will gain you the trust and respect of the black male community.",
            "This post will convince more people to vote for him than any debate lmao",
            "Jill wearing that suit boy",
            "Where was this energy last night!?",
            "Got the snap in at the end too",
            "Aight i see you big B",
            "MAGA saying he swapped bodies after the debate I can't with them bruh -_- \n\nBut anyways I got to ask since its on topic, is Waffle House really good? We don't have them up here in Detroit (we got Coney Islands tho if that counts lmao)",
            "That dap was way too clean, he didn't even pull back after the first connect, white people often do that. He kept a solid lock and slid right into frame with the next few motions, his hand didn't seem like the moves were unfamiliar. I gotta say, for daps from a President other than Obama and maybe Bill, this was impressive."
        ]
    },
    "Barack Obama chime in on the Trump vs Biden debate.": {
        "title": "Barack Obama chime in on the Trump vs Biden debate.",
        "score": 21677,
        "url": "https://i.redd.it/5030e0dd3d9d1.png",
        "content": "",
        "num_comments": 1075,
        "comments": [
            "So basically he said….. i know my mans sucks and dropped the ball….but do we really want this nigga trump back in the office",
            "For once I hope America's infamous shitty attention span kicks in and everyone comes back to reality come election time.",
            "Obama had to tweet about it. You know it was bad.",
            "Sorry but let’s cut the false pretense. If you’re planning on switching your vote to trump because of that debate you were never planning on voting for Biden.",
            "Every right-wing media outlet and acquaintance on Facebook said that Romney's first debate was.a \"game-changer\"",
            "You know it’s bad, when they pull their best card this early. I’m voting dem because anything else is a vote against me and my people but that debate was kill shot.",
            "It's not a question of who is better. It's a question of whether Trump is more likely to lose to Biden or someone else. It's a lso a question of the viability of our politics and institutions when these are the options they present us. Serious, fundamental change is needed and if we don't see that now then we are in serious trouble.",
            "This is a bad look. This is like when your friend does some dumb shit at the party and you gotta go back the next day and smooth shit over.",
            "Joe's more fired up and well spoken at his rally today. He just needs to get out there in town halls and at the next debate with the same energy. He got plenty of chances to make up being so meek last night. Plus he's lucky most viewers considered last night a draw between two old grumpy men. \n\nTake some cough drops, a bottle of DayQuil and a can of Venors next time Joe! Lol",
            "The entire Democratic party needs to shift their verbiage to be all about the administration and not about the person. They need to do that like yesterday."
        ]
    },
    "Did you do to your “black job” today? ": {
        "title": "Did you do to your “black job” today? ",
        "score": 6198,
        "url": "https://i.redd.it/s9ifsq29zd9d1.jpeg",
        "content": "",
        "num_comments": 133,
        "comments": [
            "![gif](giphy|13NNKrYUHJ9jva)\n\nMe at my Mexican job",
            "He doubled down and said it at the Rally today. He said he’s bringing  Black Jobs to VA. 😂😂 I can’t wait for what Black jobs he gonna bring to my home state hell my hometown that he spoke in today.",
            "Trump’s frequent reference of “the blacks” as that group of people we have to unfortunately live with is constant.",
            "WTF is a BLACK JOB?????",
            "I took PTO today, the reverse Uno.",
            "Puttin in that black work",
            "I have an extreme amount of respect for Justin Jones. He reminds me there are still politicians that care about the PEOPLE. Gives me hope for my kids .He is role model for courage, strength, dignity, and showing how to stand for what you believe in no matter the mountains ahead.",
            "I am on PTO From my “black job”…. So I’m doing black ass things 🤣🤣🤣",
            "Is this something Trump said during the debate?",
            "\"THE IMMIGRANTS ARE TAKING BLACK JOBS!!!\""
        ]
    }
}