{
    "ARCS EPISODES BENCHMARKS": {
        "title": "ARCS EPISODES BENCHMARKS",
        "score": 617,
        "url": "https://i.redd.it/3o8lhfyp37zc1.png",
        "content": "For those wondering when ARCS begins in the anime.\n",
        "num_comments": 45,
        "comments": [
            "As requested this bitch has been pinned. Good job OP nice visual. 5/7",
            "modddddddddddddddddds, lets make this sticky",
            "While technically part of a filler arc, episode 342 adapts the final moments of (manga spoilers for newbies) >!Ichigo losing his shinigami powers and his farewell to Rukia!<, it's a beautiful episode that shouldn't be skipped just because it's \"filler\", moreover the episode itself only has a small mention/flashback of said filler arc, nothing dealbreaker.",
            "HOT DAMN. this should be stickied somehow.",
            "Episode 342 is a must watch. The mistake of most lists is to call it filler, which causes newbies to skip it",
            "I love this ep benchmarks!",
            "[deleted]",
            "This should be pinned , every now and then same questions asked in this sub about fillers and cannon story.",
            "Thanks man I was genuinely thinking of going back to rewatch literally today. This must be a sign lol",
            "109 and 342 both have canon material in them and really shouldn't be excluded from this list"
        ]
    },
    "Regarding Aizenbot": {
        "title": "Regarding Aizenbot",
        "score": 1119,
        "url": "https://i.redd.it/evvcxjf1yi7d1.png",
        "content": "We weren't contacted or consulted about it before it was made. Compromises were made to allow Uraharabot to remain active after it was brought online in a similar fashion. \n\nAllowing additional character bots outside our direct control isn't something we're prepared to do right now, and allowing Aizen would immediately prompt more bots to be made for other characters. I've already removed 1 post about who should be the next bot character. We don't want another situation like we had with Uraharabot where it spontaneously became really toxic. I don't even remember what it did, but it woke up one day and decided to be gross. Having multiple bots decide to embrace the worst parts of the internet at once would be highly entertaining but also a nightmare to moderate. \n\nUraharabot is already divisive and I personally don't want to open the floodgates to make this place like prequelmemes or something similar without the majority of the community getting a chance to voice their opinions.  So what do you Chad enthusiasts think? \n\nThis post has been sponsored by the Urahara Shoten\n\n",
        "num_comments": 179,
        "comments": [
            "Welcome to the Bleach Subreddit! We're as excited as you at the release of the Thousand Year Blood War anime! We understand that some of you are unable to view the anime in your region, but please don't post links to or mention piracy websites. Doing so will result in a ban. \n\nAlso, please be courteous to those who haven't read the manga and mark all spoilers. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bleach) if you have any questions or concerns.*",
            "If we do get an aizen bot, I don't think it should respond to every instance of the word \"aizen\". That would be way too hectic and would impede real conversations. I've observed the urahara bot we have currently, it only responds occasionally to the word \"urahara\" but responds every time to \"uraharabot\" etc. \n\nAlso, I think the urahara bot can automatically ban users if their requests are too vulgar lmao.  If new bots are added they should similar guardrails",
            "This post is brought to you by Ichibei and sponsored by Urahara, these bad people want to prevent Aizen from overthrowing their status quo and asserting new authority over Bleach society smh.",
            "I think you removed my post abt the next bot but I kinda agree with you or Uraharabot has turned evil as I thought and has taken over your mind to get you to remove Aizenbot",
            "Wait, you mean to tell me that Uraharabot got drunk one night and decided to be toxic?\n\nKisuke, how could you?",
            "I always thought it was funny that the way they stop aizen is they wrap him up in a giant 3 pronged doobie",
            "Uraharabot was just off on the Ambien that day, give him a break",
            "AizenBot should only respond with short impending responses. Such as “We’ll see about that…” It should in no way be elaborate like UraharaBot who in character loves to explain everything that happens. Whereas Aizen is a mystery, he should remain a mystery.",
            "The bots are dumb. Ban 'em all and let the hell arc sort them out.",
            "I agree that we're opening the floodgate and should not allow any more to be made/active. It will make this sub not great very quickly.\n\nI just commented the below statement to another post asking \"What should be the next bot?\"\n\n\"While fun, I think the addition of more bots would start making this sub feel quite unnatural/annoying to participate in. If you want to interact with Chat GTP on your own time and post the interaction, that's one thing, but a bot appearing when a name is mentioned can/will get out of hand if we keep adding them. \n\nThis isn't to diss either bot (well our new one has yet to prove as funny imo) or the entertainment they can add, but in a forum setting where we want real opinions of people who also enjoy a series, it's a fad/meme/joke that will play out way too much and quickly.\n\n2 is enough, especially when those two are some of the most influential characters in the series as a whole.\""
        ]
    },
    "You can only pick 3 to....": {
        "title": "You can only pick 3 to....",
        "score": 657,
        "url": "https://www.reddit.com/gallery/1dlm0j4",
        "content": "You can only pick 3 from this group to protect you through the whole bleach series. Who would you pick and why?  (I'd pick Yoruchi, Nel, and Lisa)",
        "num_comments": 235,
        "comments": [
            "Welcome to the Bleach Subreddit! We're as excited as you at the release of the Thousand Year Blood War anime! We understand that some of you are unable to view the anime in your region, but please don't post links to or mention piracy websites. Doing so will result in a ban. \n\nAlso, please be courteous to those who haven't read the manga and mark all spoilers. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bleach) if you have any questions or concerns.*",
            "I thought this post had a different meaning.. 😭",
            "Rangiku Thrice, there I said it.\n\nEdit: didnt read the post and dont regret my answer.",
            "Yoruichi, Nemu and Harribel.",
            "Yoruichi, Nemu, Nanao",
            "Nemu, Rangiku, and Nel (adult ver. obviously)",
            "Why isn’t Unohana on here >:(",
            "Yoruichi, Nel and Halibel",
            "Yoruichi, soi fon, and harribel",
            "Yoruichi, Harribel and Rangiku"
        ]
    },
    "Official Art (Beach)": {
        "title": "Official Art (Beach)",
        "score": 835,
        "url": "https://i.redd.it/yxzejwqw018d1.png",
        "content": "",
        "num_comments": 58,
        "comments": [
            "Welcome to the Bleach Subreddit! We're as excited as you at the release of the Thousand Year Blood War anime! We understand that some of you are unable to view the anime in your region, but please don't post links to or mention piracy websites. Doing so will result in a ban. \n\nAlso, please be courteous to those who haven't read the manga and mark all spoilers. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bleach) if you have any questions or concerns.*",
            "These are BBS Swimsuit summon outfits. The Bambies are about to get theirs next week and I honestly can't wait!",
            "RIRUKA MENTIONED RAAAH",
            "Dumb question: where is Halibel Hollow spot? (And Nel too?)",
            "Orihime my beloved",
            "Kuukaku sarong supremacy",
            "Where’s Rangiku and Mila Rose 👀",
            "cour 3 boutta have a surprise beach ep",
            "I hope he does something equivalent to the male characters, lest we be bombarded with virtue signaling over everything from the outfits, to Orihime's age, to Rukia's peach getting cut out but this being allowed etc.",
            "Honestly? Nel, Kukaku, and Harribel's are my favorites 😍"
        ]
    },
    "Which side would win in a verbal fight?": {
        "title": "Which side would win in a verbal fight?",
        "score": 68,
        "url": "https://i.redd.it/croumknvb48d1.jpeg",
        "content": "No special hax or abilities just straight up smack talk, which side would make the other bend first? ",
        "num_comments": 15,
        "comments": [
            "Welcome to the Bleach Subreddit! We're as excited as you at the release of the Thousand Year Blood War anime! We understand that some of you are unable to view the anime in your region, but please don't post links to or mention piracy websites. Doing so will result in a ban. \n\nAlso, please be courteous to those who haven't read the manga and mark all spoilers. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bleach) if you have any questions or concerns.*",
            "Liltotto solos",
            "The audience, would be one entertaining scene that’s for sure, might need to make myself a extra large set of popcorn LOL",
            "Bambies can just put Liltotto in front and the rest can just chill at the back",
            "The arracnar would just sit and argue with each other the entire time lol",
            "Do Tres Bestias smell out Giselle?",
            "Halibel's team would win.",
            "Even if it were a straight up fight,  without meninas, Ayon would be a terror.  He’d give one good hit or two before getting one-shot by meninas. I heard that girl has the physical strength of Kenpachi Zaraki.",
            "Bruh it gonna be just Candice and bambietta (some words from liltotto and giselle) vs Emilou and Franceska the other just dont care as much if they win or lose",
            "she solo's both side"
        ]
    }
}