{
    "Weekly General Discussion Thread": {
        "title": "Weekly General Discussion Thread",
        "score": 5,
        "url": "https://www.reddit.com/r/bloodborne/comments/1d9ufgh/weekly_general_discussion_thread/",
        "content": " Welcome to the Weekly General Discussion Thread! This thread is for the community to discuss whatever is on their mind, even if it isn't directly related to Bloodborne.\n\nHave a question that you've been meaning to ask but haven't gotten around to making a post yet? Something on your mind you want to discuss? Playing a game that you think others would like? Comment away! ***All we ask is that you are respectful of each other, and have fun!***",
        "num_comments": 28,
        "comments": [
            "I don't know who's even going to read this but I just wanted to say that I'm thrilled I decided to pick this game up again after quitting years ago. I couldn't get past Blood Starved Beast. Even before that, I quit after 15 minutes on that first road. I'm not good at games like this and I'm still not great but I'm doing well enough to get by.\n\nI only have 6 bosses left between the dlc and main game, 2 of which are optional. Lady Maria is kicking my ass right now but it's a fun battle and I'll get her eventually.\n\nI can't believe I'm finally so close to finishing when I never thought I had it in me. Thank you to this awesome community for encouraging me to try again and stick with it.\n\nEdit: 5 bosses left. I finally took Maria down.",
            "[Games I didn't think I'd get a remaster of before Bloodborne](https://www.reddit.com/r/Games/comments/1dan24h/the_thing_remastered_announcement_trailer/)",
            "I just got the platinum by abusing the cloud save to get the 3 endings lol. Feel kinda weird cuz I always do multiple plays through for ER, dark soul and demon soul.",
            "SPOILERS AND A THEORY , I have a theory  about the lore , so everyone doesnt know how yharnam exactly work like why the night is longer than normal why when gherman kills you u wake up on a sunrise where the hunt is just finishes well i got a theory im not sure if anyone had it before but what if the moon presence need human mediator to visit other planes , like when the moon presence first came to yharnam wasnt it because gherman contacted him so the moon presence created the hunters dream world for gherman to train hunters and send them to the hunt then the moon presence have you the hunter as a mediator in the real world maybe thats why everytime you leave the dream its the hunt because everytime the moon presence have a presence in yharnam everyone turns into a monster so actually u are the problem not the savior plus thats why when gherman severs your connection to the dream he severs your connection to the moon presence so you are not longer his mediator to the waking world thats why when you wake up after gherman scythe your head its sunrise the moon presence have no presence in the waking world anymore , idk if any of this tbh makes since i just thought about it and my english sucks so im not sure if i explained it right",
            "You guys, i honestly can’t get over BB. I’ve never played any Souls games before. I first played this game back when it first came ps+ on PS4 and i couldn’t get past the Cleric beast and i gave up. Last December i bought it on PS5 and i just can’t believe what ive been missing on. Im trapped in its world ever since. I finished it couple of times and got the DLC and almost at the end. I watched every lore video, understood its story like no other game, i just roam the place and i don’t know what to say i just am in love. Part of me just hates how late i am to this masterpiece. And no i haven’t played elden ring or any souls because I know for a fact i won’t love it as much. I genuinely don’t know how to explain my feelings towards it but i truly love it and appreciate it in every way imaginable.",
            "Guys where can I get the funn picture of the subs banner",
            "Do people still pvp in this game? I wanna fight somebody!!!",
            "If anybody about that smoke find me at the stairs of the Grand cathedral, I wanna spill some blood!!",
            "I am looking to sell my future press bloodborne guide brand new sealed. Any ideas where I could sell it ?",
            "How tf do dreams work? I assumed a creature could have a physical body, and another form inside a dream. I got this from Roms and Micolashs corpse while they are alive in their respective dreams, but the chalices make this not work because Rom is there? That would mean there is TWO dream Roms? Is that allowed?"
        ]
    },
    "I cant be the only one seeing it? (Please ^^\") ": {
        "title": "I cant be the only one seeing it? (Please ^^\") ",
        "score": 709,
        "url": "https://i.redd.it/09n6l8ooic9d1.jpeg",
        "content": "",
        "num_comments": 89,
        "comments": [
            "Bro it’s a spiral",
            "this 100% means a Bloodborne remaster (i’m losing my mind)",
            "There’s also a Blade of Mercy in SotE, but it’s a talisman.",
            "The winter lantern fly item had me on the floor with flashbacks hearing the song in my head",
            "Bloodbrone fans when spiral",
            "let’s get you back to bed grandma",
            "For sure a similarity in the design of the two. The bloodborne nods and just vibes in general throughout the dlc was really cool",
            "Fromsoftware made both games. Surprised?",
            "Now that you say it",
            "Wait until u see a specific boss, a description of its items, and its arena"
        ]
    },
    "\"A deep love for the doll can be surmised by the fine craftsmanship of this article, and the care with which it was kept.\"": {
        "title": "\"A deep love for the doll can be surmised by the fine craftsmanship of this article, and the care with which it was kept.\"",
        "score": 140,
        "url": "https://i.redd.it/xxu952odye9d1.jpeg",
        "content": "Just wanted to draw a simple yet tender little page of Gehrman making the doll, something about that part of the description made me soft.\n\nI always thought of how delicate and dexterous Gehrman would've been to put her together, how much dedication and love was put into her creation, and just overall how the doll, even if made to mourn, was, somehow, the sincerest statement of the love he felt for Maria.",
        "num_comments": 9,
        "comments": [
            "And to add even if its inevitable atp, lets not do sex doll jokes on the comments everyone i put my poor little soul and heart on this little piece😭",
            "This is beautiful. Thank you for making it, OP. \n\nWe can speculate forever about the meaning of the line \"even the doll, should you please\" but, it's clear that of all the tools of the workshop Gehrman sees her as having a special and elevated status. And when she wakes, so do we.",
            "I saw a theory a while back, it basically said that it wasn't made because Gerhman was an obsessive seggsual creep. He made it to be a copy of the woman he most admitted and considered an adopted daughter. And he never is near the Doll in the dream, because no matter how \"perfect\" he made it, it would never be how he remembered her. It made me sad.",
            "Gehrman is thirsty for aristocratic babes, but the fact he made the doll is not as impressive as the fact he could make it look so real.\n\n  \nWhat's more impressive isn't how obsessively detailed the doll is to the person, but how his major dialogue defers to any other character EXCEPT Maria.\n\n  \nHe cried for Laurence, he cried for the church, the church's experiment to foster their own god baby cried in \"Geeeehrman\" language when you aborted it in a dream...\n\n  \nBut he only ever alludes to his mania in one very implicative statement, and that's probably because if he didn't shut up while he was ahead, he'd probably forget he was a slave to the moon.",
            "Gehrman is thirsty for aristocratic babes, but the fact he made the doll is not as impressive as the fact he could make it look so real.\n\n  \nWhat's more impressive isn't how obsessively detailed the doll is to the person, but how his major dialogue defers to any other character EXCEPT Maria.\n\n  \nHe cried for Laurence, he cried for the church, the church's experiment to foster their own god baby cried in \"Geeeehrman\" language when you aborted it in a dream...\n\n  \nBut he only ever alludes to his mania in one very implicative statement, and that's probably because if he didn't shut up while he was ahead, he'd probably forget he was a slave to the moon.",
            "Literally was about to make one lol.",
            "Thank you so much, your comment is beautiful :,)",
            "Yes, he had a stalker obsession with a colleague much younger than him, but was too shy to tell her. So he made a doll of her. \n\nWhether he used the doll for sex or not, it's still creepy af.\n\nBut still, if you're reading this OP, I love thr artwork!",
            "My theory was true"
        ]
    },
    "Found some merch in Tokyo!": {
        "title": "Found some merch in Tokyo!",
        "score": 71,
        "url": "https://www.reddit.com/gallery/1dr2vcd",
        "content": "I found some merch in Akihabara, Tokyo. Not good for my wallet 😅 \n",
        "num_comments": 9,
        "comments": [
            "Yeah, Torch Torch. Coulda saved on shipping.",
            "Is that a blunderbuss",
            "😍 I'm saving this post hoping the merch will still be there when I go to Japan in October 🤞😵‍💫🤞",
            "Homeless after this!",
            "fuckkk",
            "I think so?",
            "To me it looks more like the Hunter's Pistol",
            "Yes! I think the merch was in abundance so may be you will get lucky. But I think this will be gone by next year",
            "I should have been more clear in my question. Sorry. \n\nWhat I meant to ask was. Is the blunderbuss for sale?"
        ]
    },
    "Lady Maria of the Astral Clocktower in Lego form + Slight Tweaks to Gehrman": {
        "title": "Lady Maria of the Astral Clocktower in Lego form + Slight Tweaks to Gehrman",
        "score": 179,
        "url": "https://www.reddit.com/gallery/1dqwzn9",
        "content": "Well it has been a year so another Bloodborne figure, Lady Maria's Hairpiece took a while but eventually worked pretty well\n\nGehrman had some tweaks as well, now having the wooden leg and a coat, and the Blunderbuss is strapped to the back (i got a bit lazy on that one sorry lol)",
        "num_comments": 3,
        "comments": [
            "THATS SO FREAKING COOL 💯💯💯💯💯",
            "Get ready for Lego: Bloodborne ladies and gents",
            "This is actually so awesome"
        ]
    }
}