{
    "When I was a freshman, during homecoming, we had a black and blue day. I misunderstood the assignment. ": {
        "title": "When I was a freshman, during homecoming, we had a black and blue day. I misunderstood the assignment. ",
        "score": 9708,
        "url": "https://i.redd.it/xv3rx7aq0d9d1.jpeg",
        "content": "The opposing team had black and blue colors. I have this as a lone image in a Facebook album. ",
        "num_comments": 237,
        "comments": [
            "Don’t worry, we had a ‘red carpet day’ at school. Me and my friend dressed up as paparazzi 😂",
            "Man this reminds me of that time my middle school had a Halloween dance but no one dressed up in costume. Meanwhile there’s me, dressed in bright orange because I went as fucking Goku 😂",
            "Hahahahaa this is ironically so perfect for Black and Blue day!",
            "Man, that CPS visit must've been so confusing for your parents . . .",
            "This is screamingly funny 🤣🤣🤣🤣🤣🤣🤣",
            "This is fucking epic! It's also the winner of the award in the category \"domestic abuse\". Like \"I fell down the stairs, it wasn't my friend that beated the shit out of me\"",
            "We had a theme week when I was in elementary school. Hat day etc. Friday was dress up day. I, a girl, dressed up like a baseball player. The theme was actually fancy dress. I didn’t live that one down for a while.",
            "This is a straight up lie lmao. This is movie level hijinks",
            "I love the look on your face 🤣",
            "The bit I really like is you were determined to participate, chucking the notions of understanding out the window in favor of reaching the goal right off the bat."
        ]
    },
    "i posted this about “fighting my war” when i was 14 and very homeschooled": {
        "title": "i posted this about “fighting my war” when i was 14 and very homeschooled",
        "score": 1949,
        "url": "https://i.redd.it/hqyqv0x58e9d1.jpeg",
        "content": "",
        "num_comments": 103,
        "comments": [
            "Today you're my hero for posting this. Phenomenal blunder, OP.",
            "True deep cut blunder, this was brave to post",
            "On a scale of 1 to Tim Tebow how home schooled were you?",
            "I didn’t realize you censored your name at first and I thought you left it blank on purpose lol I was gonna say, very edgy to also have no name in your poem about fighting your war 😂",
            "Good god, an actual blunder. And what a doozy of a blunder it is! Thank you op, you aced this assignment",
            " Ah, the good old days of fighting wars against math homework and spelling tests in the homeschool battlefield.",
            "The guts you have to post this both then and now 😭\n\nYour adorable kid face alongside the poem is top tier.",
            "as a homeschooled graduate, i felt this 😭",
            "Please tell me you edited this on picnik",
            "I wonder which crowds you stood in front of (strong and unafraid)"
        ]
    },
    "if I could put a soap opera in a pic…this is embarrassing tbh": {
        "title": "if I could put a soap opera in a pic…this is embarrassing tbh",
        "score": 123,
        "url": "https://i.redd.it/kj5k9f949g9d1.jpeg",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Honestly such a beautiful pic, I would love pics like this of my two daughters 😂",
            "Would love to see it as vaporwave album art",
            "I don’t find this embarrassing I find it precious omg your hair is beautiful",
            "This week on As the Merry-Go-Round Turns...",
            "I'm such a nerd I'm sat here like \"wow I really like that fillet on that mat l, but the margins are a little narrow\"",
            "You mean like, *The Californians?* Lol!",
            "I would have loved this if it was of me as a kid!",
            "As the world turns, these are the days of our lives",
            "This picture is literally about 4’ x 3’…it’s WEIRD. It was displayed in the airport for most of my life growing up.",
            "This response cracked me up for some reason"
        ]
    },
    "8th grade 06-07": {
        "title": "8th grade 06-07",
        "score": 82,
        "url": "https://i.redd.it/lhgxj9mrqf9d1.png",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Ben Shapiro by way of Slim Shady.",
            " Ah, the good old days of 8th grade in '06-'07! That was the era of questionable fashion choices, awkward school dances, and trying to figure out pre-algebra. Good times, good times.",
            "Dear slim",
            "home schooled Eminem",
            "Fuck lol",
            "[removed]",
            "This comment has been removed. Please review [the posting rules](http://www.reddit.com/r/blunderyears/wiki/rules).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/blunderyears) if you have any questions or concerns.*"
        ]
    },
    "2003 I thought I was breakdancing at a 6th grade dance": {
        "title": "2003 I thought I was breakdancing at a 6th grade dance",
        "score": 4380,
        "url": "https://www.reddit.com/gallery/1dqakwk",
        "content": "6th grade was the last year in my elementary school so they made us all go to this dance and gave us visors with 2009, our future high school graduating year, printed on them.\n\nMy friends and I started a “breakdancing” circle where we tried to mimic what we saw Eddie Gordo do in Tekken.\n\nThe Cha Cha Slide was probably playing on the speakers.",
        "num_comments": 190,
        "comments": [
            "Okay *THIS* is a blunder",
            "You can just tell you felt so cool in these photos",
            "And all the girlies say he’s pretty fly for a white guy",
            "Oh man, this is peak. The cargo shorts, the visor, the tribal dragon shirt opened up to reveal another shirt with a dragon or eagle(?). I’m not even hating because I dressed just like this in 4th grade.",
            "I challenge you to a dance off for control of the community center!",
            "At my jr high- if you wanted to break dance at a dance, you had to wear a special helmet and wait your turn for the dancing helmet",
            "I need to know how the girls reacted 😂",
            "I was in a Breakdance class for a week and learned one trick like spinning on the floor. My mom thought it was so hilarious she made me show it to every friend of our family even in the grocery store when we met some. I always thought the grown ups would really like my dance move turned out they just thought it was silly (also around 2003)",
            "Dang bro you peaked in 6th grade?!",
            "Out there looking like J-Roc, nomsayin'?"
        ]
    }
}