{
    "2008. Fourteen. Seems crazy now. ": {
        "title": "2008. Fourteen. Seems crazy now. ",
        "score": 812,
        "url": "https://i.redd.it/2ajjp2q7y08d1.jpeg",
        "content": "",
        "num_comments": 31,
        "comments": [
            "Looks like an album cover for a 🔥 Midwest emo band",
            "I both want to forget and want to return.",
            "This is a cool picture. It brings back all sorts of feelings/nostalgia.",
            "Man I’m the same age as you and looking at this pictures makes me weirdly nostalgic",
            "High school cigarettes are the best cigarettes",
            "I look at old pictures and cant believe Im the same person. Its really crazy youre right😭",
            "In 2008 I was 16/17. Damn, what a good time the 2000s were.",
            "Here’s the [song](https://www.dropbox.com/scl/fi/pz55kmtjraoazlzku700f/Play-It-School-Shirt-Smells-Like-Smoke-Mix.mp3?rlkey=lket4i69vjstxocnc8ztxivvv&dl=0) I made for this album cover based on the suggestion and other comments.",
            "Not a cellphone in sight just living",
            "The hair is giving 80’s."
        ]
    },
    "I’m upset at whoever authorized this haircut (1996)": {
        "title": "I’m upset at whoever authorized this haircut (1996)",
        "score": 640,
        "url": "https://i.redd.it/lowzrvtuh08d1.jpeg",
        "content": "",
        "num_comments": 65,
        "comments": [
            "We all had bad hair in the 90s, babe",
            "That fly outfit more than makes up for it.",
            "What is that demonic box you’re playing with?",
            "you win the prize for most interesting toy though",
            "It's adorable",
            "My mom brought her photo albums to give to me a year ago. She pulled out one picture and asked...\n\"Did I give you this haircut?\"\nI said yes. \nShe apologized...",
            "It’s the “sitcom kid” hairdo!",
            "Are you playing with one of those things the Ghostbusters used to store their captured ghosts in?",
            "You shouldn't be! Cute 😍",
            "My 3 year old currently has the same hair cut 🤣 but it’s because she did not start growing hair until after age 1 and then refuses for me to put it in a ponytail so I had to cut bangs."
        ]
    },
    "An Cringeworthy Photo Shoot For A Hairdressers Back In 1971.": {
        "title": "An Cringeworthy Photo Shoot For A Hairdressers Back In 1971.",
        "score": 909,
        "url": "https://i.redd.it/2cp7lfrmay7d1.jpeg",
        "content": "",
        "num_comments": 82,
        "comments": [
            "Looks like handsome squidward...",
            "Kind of looks like that woman from Shrek that works at the Poison Apple",
            "I'm kinda getting Rocky Balboa as the Bride of Frankenstein vibes here.  I hope that's not hurtful.",
            "The photos were taken by a gay couple i used to be friends with back then. They owned a hairdressers near where i lived. The photos were in the shop window for about a year. I got a lot of flack from my friends as you can imagine and my family remind me of these pictures regularly.",
            "Looks like a bodybuilding nanny",
            "Marge Simpson's much less well known brother, Mortimer",
            "\"Maw, Imma get the tamatoes\"",
            "Wow. How did this even happen? It’s like a helmet.",
            "Ah, the Gentleman Beehive. Very distinguished.",
            "Eraserhead's cousin"
        ]
    },
    "2007 - 2024": {
        "title": "2007 - 2024",
        "score": 1040,
        "url": "https://www.reddit.com/gallery/1dkshxs",
        "content": "",
        "num_comments": 60,
        "comments": [
            "Edward Scissorhands",
            "Take away the hair and you’ve barely aged.",
            "I like your smile.",
            "Nine Inch Bangs",
            "2007: Mom, this isn't a phase. This is me!\n\n2024: Wow, my emo phase was cringe! I'm a happy, functioning, normal adult.",
            "Wow",
            "Beautiful eyeballs!",
            "The dead souless look in the eye really gives the portrait ambiance.",
            "This looks like a computer generated suspect from the 90s. \n\n“He had emo hair”\n\n*Picture morphs*\n\n“That’s him”",
            "Wow it took nearly 20 years to remove that wig, glad you made it king, keep it up"
        ]
    },
    "Cake day blunder": {
        "title": "Cake day blunder",
        "score": 499,
        "url": "https://www.reddit.com/gallery/1dkd6ex",
        "content": "It's my cake day today, just wanted to re-post the best picture of prime me since its been a few years. You're welcome. Also a picture of me today to know I've made smarter choices. ",
        "num_comments": 26,
        "comments": [
            "He bangs!",
            "tf…. first thought someone scribbled on the photo XD",
            "Ole sketti bangs",
            "Ok, I’m a little upset I can’t view the second pic.",
            "Here is the second picture. Not sure why it didn't load.\n\nhttps://i.imgur.com/XespYGS.jpeg",
            "Cant see the current pic, assuming you still have Maruchan instant lunch bangs",
            "Enough frosted tip to open a Cinnabon.",
            "Happy cake day 😉",
            "Was your stylist MS Paint?",
            "Love the hair! 🤣"
        ]
    }
}