{
    "Daily Game Recommendations Thread (June 29, 2024)": {
        "title": "Daily Game Recommendations Thread (June 29, 2024)",
        "score": 2,
        "url": "https://www.reddit.com/r/boardgames/comments/1dr3iin/daily_game_recommendations_thread_june_29_2024/",
        "content": "**Welcome to /r/boardgames's Daily Game Recommendations**\n\nThis is a place where you can ask any and all questions relating to the board gaming world including but not limited to[:](https://en.wiktionary.org/wiki/meeple#/media/File:Carcassonne_Miples.jpg)\n\n* general or specific game recommendations\n* help identifying a game or game piece\n* advice regarding situation limited to you (e.g, questions about a specific FLGS)\n* rule clarifications\n* and other quick questions that might not warrant their own post\n\n## Asking for Recommendations\n\nYou're much more likely to get good and personalized recommendations if you take the time to format a well-written ask. We **highly recommend** using [this template](/r/boardgames/wiki/personalized-game-recommendation-template-no-explainer) as a guide. [Here is a version](/r/boardgames/wiki/personalized-game-recommendation-template) with additional explanations in case the template isn't enough.\n\n## Bold Your Games\n\nHelp people identify your game suggestions easily by making the names **bold**.\n\n## Additional Resources\n\n* See our series of [Recommendation Roundups](/r/boardgames/?f=flair_name%3A\"Recommendation%20Roundup\") on a wide variety of topics people have already made game suggestions for.\n* If you are new here, be sure to check out our [Community Guidelines](/r/boardgames/wiki/community)\n* For recommendations that take accessibility concerns into account, check out [MeepleLikeUs](https://meeplelikeus.co.uk/recommender-beta/) and their recommender.",
        "num_comments": 2,
        "comments": [
            "Hey all!\n\nI'm looking for a party game for a large group (8+ people I think) for a family gathering that'll happen in a few months. \nMost people aren't board gamers, so nothing too complicated. \nThere's quite an age difference - let's say 20 to 60 or so. \n\nEither something super funny, or maybe something competitive that involves trivia? I don't know. Anything that matches the above criteria.\n\nThanks!",
            "I’m always a fan of Monikers. https://youtu.be/yvdpPc5ZVlE?si=PXpdH7A06lTJfJJW"
        ]
    },
    "Thursdays at War - (June 27, 2024)": {
        "title": "Thursdays at War - (June 27, 2024)",
        "score": 8,
        "url": "https://www.reddit.com/r/boardgames/comments/1dpj7td/thursdays_at_war_june_27_2024/",
        "content": "Spanning the gamut between Ameritrash and Euro, light and heavy, there are tons of war games out there. So if you are **Twilight Struggle**-ing through a **Time of Crisis** in your life and feel the need to say **Here I Stand**, a proud war-gamer, here is your weekly topic.\n\nWhat have you played this week? Any great plays or good stories? Any new acquisitions? What are you going to try and get to the table in the upcoming week?",
        "num_comments": 1,
        "comments": [
            "My copy of **Inis** just arrived and I already adore it. At least for the art, components, and theme.\n\nI know it's a much less war-y wargame than many listed here, but I'm hoping to get some advice on getting it to the table. My wife is somewhat interested, but I'm hoping to find some selling points to build hype. What's been the most successful pitch for **Inis** y'all have been able to make?\n\nAlso, any tips for teaching including rules and strategies to spend some time going over?\n\nBest player counts?"
        ]
    },
    "What is this game?": {
        "title": "What is this game?",
        "score": 121,
        "url": "https://i.redd.it/ro79rne8ce9d1.jpeg",
        "content": "Actually I am posting this for my mother who is not on reddit. She saw this in a TV show & wants to know what the game is called. Idk if it's a game made up specifically for the purpose of the show or it's a real game. Thanks in advance guys!",
        "num_comments": 47,
        "comments": [
            "11x11, hnefatafl. \n\nI actually finished my master's degree working on this game and its variants across northern Europe.",
            "Pretty sure that's the Viking game",
            "I know it's been answered, just thought I'd say I thought it was Thud at first, but the starting positions are different, so it isn't that.",
            "Can confirm it's Hnefatafl! Proud owner of the game here. Bought it a few weeks ago during travels through Norway. Is a classic Scandinavian game. For now I prefer it over chess because the rules are simpler, yet the game is still complex + I like assymetrical games (there is an attacker and a defender)",
            "There is a variation of this called THUD! Which is the realisation of an in-canon game in Terry Pratchetts Discworld novels",
            "I think it \"GO\" but I don't sure",
            "looks like mexican monopoly to me.",
            "Someone that doesn’t know how to set up a chess board",
            "As an obvious expert on the matter then, what are in your opinion the most enjoyable set of rules? I've read that the original rules weren't preserved well, and that there was a lot of variety throughout time and space",
            "Any chance you could give a brief summary of the variants?"
        ]
    },
    "My journey so far to find \"Risk but better,\" and can you help?": {
        "title": "My journey so far to find \"Risk but better,\" and can you help?",
        "score": 158,
        "url": "https://www.reddit.com/r/boardgames/comments/1dqpmzy/my_journey_so_far_to_find_risk_but_better_and_can/",
        "content": "Growing up, I loved playing Risk, but I still knew it had some major issues that made it hard to play. Ever since, I've been trying to find Risk but better. I wanted to describe my findings so far to see if anyone has insight into games I haven't tried yet, and why you think they fit the bill. Thank you! Sidenote, these are not critiques of these games, just how they are not filling the Risk-shaped hole in my heart.\n\nTwilight Imperium 4 - I don't have 5 people to play this with. I have 1 person that will regularly play complicated games with me, and sometimes 1 other person once or twice a year. So this really isn't in the cards for me atm since I've heard you need more people.\n\nAxis and Allies - Was so hopeful for this, but found the game to be long, other people's turns were long and boring, and the game had enough balancing issues to be frustrating.\n\nBlood Rage - Great game, but not enough like Risk. You don't necessarily try and hold + gain territories, which I loved about Risk. Not expansive territories either.\n\nInis - Not a huge map, not the Risk style gameplay I was looking for.\n\nScythe - Has the same exciting expansive territory feel that Risk has, but it's not a combat game.\n\nEclipse - Same as Scythe, there isn't as much combat with other players, and changing territories as I'm looking for.\n\n\n\nI can’t reply to all these comments but thank you all so much! I will definitely be getting Small World, War of the Ring, and the others you mentioned! I appreciate you all!",
        "num_comments": 352,
        "comments": [
            "If you like lord of the rings then maybe war of the ring? Probably my favorite 2 player game",
            "If you’re primarily playing with only one other person, the only viable options I can think of are \n**War of the Ring** or **878: Vikings**; both are fantastic, but there’s a big element of asymmetry between the sides (seemingly necessary to keep a big troopsonamap game interesting with just two people)",
            "Shogun from the Gamemaster Series is in my shelf instead of Risk. There is bidding, armies you can build and different unit types. Plus I really like the feudal japan setting:)",
            "If it’s just you and one other person, maybe try **Twilight Struggle.**",
            "Risk Legacy would probably fit the bill.",
            "878 Vikings is the answer.\n\nI would also recommend Risk: 2210. A lot of the same problems, but it adds enough variation that it feels like a different game.",
            "Risk: Europe is a great game and probably overlooked due to the word 'Risk' in the title. There is a very small similarity in one of the mechanics but it's basically a completely different game and far superior, worth a try I suggest.",
            "878-Vikings for 2 or 4 players",
            "Spheres of Influence is a combination all of the good parts of Risk and Axis & Allies with none of the bad.",
            "I liked Small World. It kind of had some Risk vibes for me when I played it and deciding when to put your current civilization into decline so you could switch to a different one and get a bit of a boost and some new rules to play with adding some interesting twists to the game."
        ]
    },
    "Arcs base game and Root: A Comparison ": {
        "title": "Arcs base game and Root: A Comparison ",
        "score": 63,
        "url": "https://www.reddit.com/r/boardgames/comments/1dqt4t0/arcs_base_game_and_root_a_comparison/",
        "content": "This isn’t meant to be a review or a conclusion of which is better. They are quite different games and different people will prefer one or the other depending on their preferences. This is more meant to be a helpful guide for those on the fence for the game who either fans of Root or didn’t like certain aspects of Root. \n\n**the teach**\n\nArcs is a much easier teach than Root. While it’s still not necessarily an easy teach, an experienced teacher could likely do the teach in 15-20 minutes. While Root would be hard to do under 25-30 minutes and cover everything. Additionally, I find Arcs’ ruleset much more intuitive. There are a lot less weird rules and edge cases that need to be remembered and rarely did any of the groups I try it with need to look on the rule book. Basically every core rule/concept is covered in the medium sized 4 sided player aid. \n\n**Complexity/Depth** \n\nAs mentioned above, Root has a much more complex rule set. Each faction having their own rules and actions makes Root much complex of a game to learn. However, I wouldn’t say that Arcs lacks in depth because of it. You could play the base game + Leaders and Lore or even just the base game exclusively for dozens of plays and still find new depth and strategy. With all the expansion factions Root probably still wins out in the shear amount of depth in different interactions and board states with 10 different faction combinations. \n\n**player counts**\n\nAs with Root, I’d say Arcs’ best player count is 4 players. Both are also good at 3. However Arcs is MUCH better at 2 players right out of the box than Root, I’d argue even it’s even better at 2P than Root is with hirelings and/or clockwork expansion. At this time Arcs maxes out at 4 players while Root can be played 5-6 players with any of the major expansion boxes.\n\n**Strategy and Tactics**\n\nRoot is much more strategic while Arcs is much more tactical. In Root, you often have to plan out your strategy and work towards setting that in motion, many factions almost have to be played in a slow burn fashion. Trying to set yourself up for a big burst of points in the end. While Arcs does reward players for thinking ahead, and sometimes it is in your best interest to ignore the current chapter’s ambitions to set yourself up for the next rounds, it’s much more about thinking on your feet from chapter to chapter, turn to turn. You could set yourself up for a big Warlord victory for the final chapter but then you might not get any aggression suit cards that turn or other players might declare other ambitions first. Arcs is very much about being flexible about what’s in your hand and the board state. \n\n**Asymmetry**\n\nThere’s really no comparison here. Root is incredibly asymmetric. Arcs base game isn’t asymmetric at all. Leaders and Lore cards that are included in the base game (and the additional pack that adds more) do add some asymmetry, but nothing close to the difference in factions in Root. While this does lower the rules complexity, I do sometimes miss the character and thematicness of Root.\n\n**Time to Play**\n\nIMO the games are fairly similar in game length. Arcs I think could be a bit faster than Root but with how much your objective changes and the board state changes it can cause some analysis paralysis.\n\n**Time between turns**\n\nThis is a big difference between the games. Root will see you making few, but longer and more impactful turns. I believe the average amount of turns in a game of Root is only something like 7-10 turns. Arcs’ on the other hand has a minimum of 18 turns each and could be as much as 30 turns. These turns are obviously much shorter and generally less impactful but will come around much quicker.\n\n**Kingmaking**\n\nKingmaking is a part of all of Cole Wherle’s games. I personally have found it is much more profound in Root than Arcs. In Arcs, depending on the ambition, it’s often best to just win the ambition however you can, which sometimes may be hurting the leader, sometimes may be something that doesn’t require conflict with other players at all. There also is the possibility for big points swings, especially in the later chapters, which means you have to keep an eye out for everyone, not just whoever is currently in first. \n\n**Player balancing**\n\nOne complaint some people have with Root is that the factions aren’t balanced and that it’s up to the table to check the more powerful factions. Others see this as a fun, interesting elements of Root. Either way, Arcs is far more balanced. The Leaders and Lore cards are asymmetric but are quite even and don’t provide huge swings in power.\n\n**Catch-up possibility**\n\nAs mentioned above, Arcs has the possibility for much larger swings of points. In Root, if one player has 27 points and another player has 5 points. That 5 point player has zero chance of winning the game. In Arcs it is possible in the later chapters for a player to win 24 points in a single round. It would be very difficult but it is possible. More realistically players could easily close a 15 point gap in a round. This means that almost always players have something to play for, there’s always at least a Hail Mary chance for a win. IMO it never feels unearned or cheap but some may prefer the unforgivingness of Root.\n\n**Battling and dice play**\n\nThis is a little more subjective than the other categories, but I like the dice play and battling much more in Arcs than in Root. In Root you have so little actions, on top of that you can attack 9 warriors vs 2 and roll two zeros and have your battle do nothing. Arcs’ battling can still be unpredictable and frustrating but I think it encourages battling more, favours having more ships more, and isn’t much complicated than Root (much much easier than Oath’s huge pool of dice) \n\n**endgame**\n\nFinally, the end game of Arcs feels a lot different than Root. In Root it can often feel like people are wacking the leader until someone is able to cross the finish line, subjectively, I find that the endgame in Root always feels a little flat. In Arcs it is often intense right to the end, because actions are so quick, it’s not like Root where someone 10 minutes after your last turn you took wins. You are involved right to the end and often the win is a difference of a few trophies or resources. \n\nTL;DR\n\n- Root: more strategic, much more asymmetric, much harder to teach. Has a bit more variety and possibly depth with all the expansions. Is more unforgiving and relies more on Kingmaking\n\n- Arcs: much easier to teach, more tactical, much more turns that are closer together, more depth that’s based on strategy skill vs just learning new faction combinations, and (strictly imo) better battling and endgame. ",
        "num_comments": 37,
        "comments": [
            "how is the replayability on arcs base game ?",
            "Ganging up on the frontrunner =/= kingmaking. I haven't played Arc, but there is no legitimate reason or incentive to engage in kingmaking in Root.",
            "Root is one of the hardest games I've ever tried to teach, including TI4. Teaching (base) Arcs was actually fairly smooth.",
            "I do agree that Root is much more thematic and immersive in its theme than Arcs. I do find the campaign does a much better job of that theming.\n\nThe one aspect that does mesh theme and gameplay well in base Arcs is the outrage mechanic. When you destroy a city it really does feel like that planet rebels against you, blocking you from using its resources, you taking enemy agents as trophies, etc",
            "Exactly my thoughts. I played the first game yesterday, and it was the first thing I noticed, the base game is less charming and evocative than Root was. Hopefully the campaign will make it more thematic.\n\nIt is a good game nonetheless, just not expecting it to feel so abstract.",
            "Oh definitely. Arcs theme is just in its artwork.",
            "The base game includes some leaders and lore cards, which help replayability tremendously. They add some asymmetry that makes for some really interesting combos. Definitely some really good replayability, especially if you spend the extra 15ish bucks on the extra leaders and lore cards available",
            "Very high in my opinion. There is a ton of strategic depth and every play through is unique in how people approach it. My closest comparison for the base game would honestly probably be Inis. \n\nTo answer one of your questions down below: the expansion adds a ton but the base game is complete on its own. I saw someone explain it like Arcs is like Pandemic and the blighted reach is like Pandemic Legacy (if it requires the pieces of base pandemic to play. The campaign is amazing, but it’s essentially a whole different game using the same core concepts",
            "That’s not true at all. Root is a VERY Kingmaking heavy game. Cole himself has stated that it is designed to be this way. As mentioned in the post, Root is very much about building your way to greater points. It is very much incentivized to attack/gang up on the leader. If someone is close to winning you need to stop them directly: forcing an eyrie turmoil, attacking Alliance sympathy and bases, forcing Vagabond to rest in the woodland to repair, etc. \n\nVery often in games of Root there are 2-3 people close to winning. It’s very common for anyone close to winning to all attack try and stop the person closest. Then when the next player passes them everyone tries to stop that person",
            ">there is no legitimate reason or incentive to engage in kingmaking in Root.\n\nIf you're in last place and cannot win because player A beat the snot out of you for the entire game and in your last turn you could make it so player B wins that's a totally legitimate decision to make with an incentive."
        ]
    }
}