{
    "Are you thinking of posting? Click here first": {
        "title": "Are you thinking of posting? Click here first",
        "score": 63,
        "url": "https://www.reddit.com/r/bodybuilding/comments/1blr61a/are_you_thinking_of_posting_click_here_first/",
        "content": "The r/bodybuilding subreddit gets around 1000 new subscribers every day, so here's a quick intro to this sub:\n\nThis is a community specifically for competitive bodybuilding. It is NOT for general health and fitness, fat loss advice, how to bulk up, how to get started at the gym, or how to get into shape in general. If that's what you're looking for, go to these subreddits and read their quick start guides:\n\n[r/fitness Wiki link](https://thefitness.wiki/)\n\n[r/loseit Quick Start Quide](https://www.reddit.com/r/loseit/wiki/quick_start_guide)\n\n[r/gainit FAQ](https://www.reddit.com/r/gainit/wiki/index)\n\n- This subreddit is also NOT for general progress pictures, memes, or questions about whether you should bulk or cut. Those belong in r/progresspics, r/Brogress, r/GymMemes, r/swoleacceptance, and r/BulkOrCut. \n\n- Please take a moment to consider if you are in the right subreddit, there are also many subreddits for general fitness, lifting, powerlifting, homegyms, and lifestyle such as r/fitness, r/gym, r/weightroom, r/gainit, r/loseit, r/homegym, r/powerlifting. \n\n- With all of the above in mind, this is also not a place for the \"natty police\". Asking someone if they're natural or enhanced is okay, if they don't want to discuss it that is their decision, if you ask and they answer, any further pushing or accusations will be met with comment removal and bans regardless of how much you/everyone else believes their word. Take it to r/nattyorjuice if you want to act like that.\n\n- If you'd like to participate in r/bodybuilding specifically, but don't believe your question/post warrants a standalone post, it likely belongs in the pinned Daily Discussion thread (you can ask basically whatever you want here) or the weekly newbie thread.\n\n\nAs always, general reddiquette and Reddit rules apply. If you see someone breaking r/bodybuilding rules or Reddit's sitewide rules please report them by hitting the report button.\n\nIf you would like to ask before you post you're welcome to reply here or message the modmail, there have recently been some changes to automod and the posting rules have become a bit more lenient and it's much more moderator discretion than automod removal currently.\n\n_______\n\n**Update-- You will be temporarily banned if you post something that blatantly violates the rules and/or what this post is telling you. This is your warning, the ban will not be lifted**.",
        "num_comments": 47,
        "comments": [
            "Surely they will read THIS one",
            "This should be like a prereq. Something they have go upvote or engage with before they have posting privileges. So if they post something dumb they get a permanent and nothing of value is lost",
            "Cant do much more than this! Solid post to put up front. \n\nTime to go post some dumb shit and say hi to automod",
            "Hopefully these \"are this bicep big\" members read this post",
            "I wanna post the before and after of my results of my modified sheiko program. And ask what I should do differently for bigger improvements. \nWould this be an approved post.",
            "I want to ask what to expect watching my first NPC show. Im pretty excited, as I go further into this community. I dont have any friends or people around me who hardcore bodybuild, so Im going in blind. Is that okay to post?",
            "Does anyone know which exercise is better? Like what's the difference? Which one focuses more on mobility and functionality?\nSingle leg wall press rdl vs.\nSingle leg rdl",
            "I dont know where to start in order to compete. Where can I get some help?",
            "Im trying to find the best Reddit to ask for advice on progress and body recomp. Any recommendations?",
            "Feels like there needs to be a karma limit for posting, since most of the utter garbage posts are from 0, negative, or very low karma (assuming new) accounts. \n\nEvery few hours..."
        ]
    },
    "Daily Discussion Thread: 06/29/2024": {
        "title": "Daily Discussion Thread: 06/29/2024",
        "score": 2,
        "url": "https://www.reddit.com/r/bodybuilding/comments/1dr9mwk/daily_discussion_thread_06292024/",
        "content": "Feel free to post things in the Daily Discussion Thread that don't warrant a subreddit-level discussion. Although most of our posting rules will be relaxed here, you should still consider your audience when posting. Most importantly, show respect to your fellow redditors. General redditiquette always applies.",
        "num_comments": 4,
        "comments": [
            "Does anyone ever take multiple days off in a row? Or deload?\n\nIm going on vacation next week where I wont be training for 4 whole days.  I havent taken these many days off in a row in over year.  Its hard for me to lol.  But at the same time my body does feel like it might benefit from it",
            "I think I remember GSD shouting at someone that deloads are for pussies and everyone should be taking rest weeks instead\n\nSo yeah absolutely you'll benefit. It's for the best since you'll have a vacation to distract you from something you should be doing anyway but are unlikely to follow through with",
            "Thanks for the video. Love this guy. I usually train myself into the ground every week where by day 6 Im irritable and drained of energy. Its hard for me to not go to failure  everyday but i definitely need to incorporate more rest",
            "Oh yeah. If one never has to take a few serious rest days in a row, then I kinda question how hard one trains.\n\n\nhttps://youtu.be/1cZbv9Eyd4c?si=fi_9KwL3VSxGEiyM\n\n\nSomewhere in this video Mike Israetel talks about the special benefits of dedicated rest days. Really changed my perspective on it"
        ]
    },
    "I’ve been experimenting with some new moves for my posing routines, any critiques?": {
        "title": "I’ve been experimenting with some new moves for my posing routines, any critiques?",
        "score": 90,
        "url": "https://v.redd.it/2sm9ppmahh9d1",
        "content": "",
        "num_comments": 25,
        "comments": [
            "Slow down and hold poses longer. It's like you're trying to fit a lot into a short time frame. I understand that for many shows, people get 1 minute to do their routines, but less is more.",
            "Looks more like dancing than posing.",
            "Magic Mike on roids and I don't mean it as a diss. Great job!",
            "might be a little too fast",
            "A little too fast. I like the routines from @kylianortegaperez",
            "There's some great stuff in there but it's almost like a dance routine. Slow it down dude. Hit the peak shots and hold it, even for a split second.",
            "Reminds me of the legendary Jason Genova, pissening transitions mlord. In all seriousness very nice posing man, great flow, maybe just it down a little ",
            "Breathing & abdominal control between poses really needs work",
            "Great posing !! Maybe a little more upper body development.. legs looking good. I would hold pose for just a second longer.. but awesome / smooth transitioning",
            "Pause a little more on the poses."
        ]
    },
    "4 Weeks Out Check In": {
        "title": "4 Weeks Out Check In",
        "score": 18,
        "url": "https://www.reddit.com/gallery/1draf00",
        "content": "Four more weeks to go. Sitting at 167.2 lbs this morning. Thinking I’m gonna just ride out my 2100 cals for the rest of prep until peak weak. Still trying to iron out some of the posing, but overall pretty happy with where everything stands for a first time, self-coached competitor. \n\n\n(Not sure why some of the pics got cropped weird)\n",
        "num_comments": 4,
        "comments": [
            "Chest is insane mate. Top physique... Good luck with the show!",
            "Hi op for the next 4 weeks try doing weighted pullups might help your back a little bit 4 weeks ain't much but back needs work otherwise solid build keep it up",
            "Thanks for the feedback, will definitely keep that in mind.",
            "Appreciate the kind words!"
        ]
    },
    "1 Day out 😎- 22yrs old, 5’9, woke up at 188lbs. ": {
        "title": "1 Day out 😎- 22yrs old, 5’9, woke up at 188lbs. ",
        "score": 777,
        "url": "https://www.reddit.com/gallery/1dqliaw",
        "content": "Well after 21 weeks of prep, it’s show day tomorrow ladies and gentlemen. Will keep pushing carbs today. Just gonna enjoy the day and soak everything in come tomorrow. Let’s Party. 🔥💪🏽✌🏽(Braided hair adds to the aesthetics 🤫) \n\n-Classic Physique Class B\n-Light Heavy Weight Bodybuilding",
        "num_comments": 93,
        "comments": [
            "The hair is wild, how long did that take?!",
            "Potential is thru the roof. Great genetics. Good luck for the future.",
            "absolutely phenomenal bro. \n\ncrazy potential for 22",
            "God damn them braids are 10/10 mate",
            "Your front shots are impressive. Be sure to post pictures with the overall",
            "Where is the dog? Oh nice prep",
            "That physique is fucking insane!! Good conditioning, and mid section, i love the upper body proportions but calves are lacking a bit lol! Insane physique tho! Its so good!",
            "Jared Feather's brother from another mother, with somehow even more ridiculous hair. Jacked as hell and V taper is out of this world. Conditioning could be better for 1 day out. Looks more like 2 weeks out.",
            "Are you somehow related to Jared Feather who is an IFBB pro. \n\nLooking great btw! Good luck",
            "The braids are very distracting, I am looking at your hair instead of physique. J/k.   Looking good, best of luck."
        ]
    }
}