{
    "Are you thinking of posting? Click here first": {
        "title": "Are you thinking of posting? Click here first",
        "score": 66,
        "url": "https://www.reddit.com/r/bodybuilding/comments/1blr61a/are_you_thinking_of_posting_click_here_first/",
        "content": "The r/bodybuilding subreddit gets around 1000 new subscribers every day, so here's a quick intro to this sub:\n\nThis is a community specifically for competitive bodybuilding. It is NOT for general health and fitness, fat loss advice, how to bulk up, how to get started at the gym, or how to get into shape in general. If that's what you're looking for, go to these subreddits and read their quick start guides:\n\n[r/fitness Wiki link](https://thefitness.wiki/)\n\n[r/loseit Quick Start Quide](https://www.reddit.com/r/loseit/wiki/quick_start_guide)\n\n[r/gainit FAQ](https://www.reddit.com/r/gainit/wiki/index)\n\n- This subreddit is also NOT for general progress pictures, memes, or questions about whether you should bulk or cut. Those belong in r/progresspics, r/Brogress, r/GymMemes, r/swoleacceptance, and r/BulkOrCut. \n\n- Please take a moment to consider if you are in the right subreddit, there are also many subreddits for general fitness, lifting, powerlifting, homegyms, and lifestyle such as r/fitness, r/gym, r/weightroom, r/gainit, r/loseit, r/homegym, r/powerlifting. \n\n- With all of the above in mind, this is also not a place for the \"natty police\". Asking someone if they're natural or enhanced is okay, if they don't want to discuss it that is their decision, if you ask and they answer, any further pushing or accusations will be met with comment removal and bans regardless of how much you/everyone else believes their word. Take it to r/nattyorjuice if you want to act like that.\n\n- If you'd like to participate in r/bodybuilding specifically, but don't believe your question/post warrants a standalone post, it likely belongs in the pinned Daily Discussion thread (you can ask basically whatever you want here) or the weekly newbie thread.\n\n\nAs always, general reddiquette and Reddit rules apply. If you see someone breaking r/bodybuilding rules or Reddit's sitewide rules please report them by hitting the report button.\n\nIf you would like to ask before you post you're welcome to reply here or message the modmail, there have recently been some changes to automod and the posting rules have become a bit more lenient and it's much more moderator discretion than automod removal currently.\n\n_______\n\n**Update-- You will be temporarily banned if you post something that blatantly violates the rules and/or what this post is telling you. This is your warning, the ban will not be lifted**.",
        "num_comments": 47,
        "comments": [
            "Wrong sub.",
            "Surely they will read THIS one",
            "This should be like a prereq. Something they have go upvote or engage with before they have posting privileges. So if they post something dumb they get a permanent and nothing of value is lost",
            "Can’t do much more than this! Solid post to put up front. \n\nTime to go post some dumb shit and say hi to automod",
            "Hopefully these \"are this bicep big\" members read this post",
            "I wanna post the before and after of my results of my modified sheiko program. And ask what I should do differently for bigger improvements. \nWould this be an approved post.",
            "I want to ask what to expect watching my first NPC show. I’m pretty excited, as I go further into this community. I don’t have any friends or people around me who hardcore bodybuild, so I’m going in blind. Is that okay to post?",
            "Does anyone know which exercise is better? Like what's the difference? Which one focuses more on mobility and functionality?\nSingle leg wall press rdl vs.\nSingle leg rdl",
            "I don’t know where to start in order to compete. Where can I get some help?",
            "[removed]"
        ]
    },
    "Daily Discussion Thread: 06/28/2024": {
        "title": "Daily Discussion Thread: 06/28/2024",
        "score": 5,
        "url": "https://www.reddit.com/r/bodybuilding/comments/1dqj2gw/daily_discussion_thread_06282024/",
        "content": "Feel free to post things in the Daily Discussion Thread that don't warrant a subreddit-level discussion. Although most of our posting rules will be relaxed here, you should still consider your audience when posting. Most importantly, show respect to your fellow redditors. General redditiquette always applies.",
        "num_comments": 62,
        "comments": [
            "So I haven't drank since Sunday, which is the longest time I've gone without drinking since the height of COVID. Partially because my new girlfriend is sober and partially because I just wanted a break from it.\n\nWasn't intending to stop permanently but after just 5 days my face has slimmed down, my sleep is 5x better and my plaque psoriasis is healing up. Goddamnit, I like my tequila and margs.",
            "Dropped about 10% of my weight on RDLs to do a form reset and it definitely felt much cleaner. Also did them beltless and I think I’m gonna roll beltless from now on, I find it easier to actually hinge whereas with the belt I felt more of the load in my lower back.",
            "I know this isn’t the place to talk about this, but I don’t really feel like speaking to any friends or family about it yet.\nI just broke up with my girlfriend of 3 years & idk how to feel.\nShe is a wonderful human being. Everything anybody could ever want in a partner. I just think I fell out of love. \n\nSometimes I feel like I’m dead inside. I don’t really love any of the things I used to love. I used to love playing guitar, fitness, gaming, music, film. Now it all just feels kind of grey. I say I’m tired a lot as an excuse but it’s more than that. Anyways, sorry to dump for anybody reading this. I just needed to type this out in words.",
            "what makes cutting easier or more enjoyable for you?",
            "[This guy](https://youtu.be/UyL3UiFo5N8?t=578) on Brandon Harding's new vlog looks familiar.",
            "I’m going prematurely grey on my temples. I really need to get JustForMen.",
            "barbell rows feeling so heavenly today",
            "I am 13 weeks out ,at what point do you think strength loss is acceptable during a contest prep? I did a 7months off-season and I've gotten the strongest by far, but my strength has plummeted during this last 1-2 weeks. I can no longer do my top set on some of my best lifts (used to be able to do 6 reps of 140 lb incline dumbbells pause at bottom of chest) now I can barely squeeze out 8 reps on 130's. This is just one of example of my strength dropping off.\n\nThis is my first time doing a contest prep (I've done at least 7 years of bulk cut cycles but not a contest prep) and the strength loss is starting to worry me.",
            ">!Beginner--please be gentle. !<>!Advice!<\n\nHi everyone, \n\nI'm a 35-year-old female who started powerlifting about two/three years ago. I fell in love with it and have been measured in my approach when it's come to increasing weight. My trainer, who is so wonderful, competed in bodybuilding shows in the past and this year I decided I wanted to go for it and train for a competition. I was doing so well--I was killing it on macros, steadily lifting more, starting to see a body composition change (and saying shit to my friends like, \"Let me tell you about body composition!!!\") until a month ago. I hurt my lower back. I thought it was a tweak until a week later and I was in serious pain and couldn't move. An MRI showed that I had a mild bulging disc in my lower back (which is hilarious because it's mild and there's no nerve damage but damn, it hurts). My doctor told me that I shouldn't be doing anymore heavy lifting like deadlifting, squats, etc. I am heartbroken and unsure of what to do in terms of achieving my goals. I truly love/loved lifting. Have any of you done bodybuilding shows WITHOUT doing things like deadlifts/squats/etc? \n\nIt's been six weeks and it still hurts to move. It hurts to walk. And yes, I've fallen off the wagon, food-wise and am trying desperately to pick myself up. Any advice would be so appreciated. Thank you.",
            "Would some people be willing to share some photos that are posed vs candid?"
        ]
    },
    "1 Day out 😎- 22yrs old, 5’9, woke up at 188lbs. ": {
        "title": "1 Day out 😎- 22yrs old, 5’9, woke up at 188lbs. ",
        "score": 716,
        "url": "https://www.reddit.com/gallery/1dqliaw",
        "content": "Well after 21 weeks of prep, it’s show day tomorrow ladies and gentlemen. Will keep pushing carbs today. Just gonna enjoy the day and soak everything in come tomorrow. Let’s Party. 🔥💪🏽✌🏽(Braided hair adds to the aesthetics 🤫) \n\n-Classic Physique Class B\n-Light Heavy Weight Bodybuilding",
        "num_comments": 92,
        "comments": [
            "The hair is wild, how long did that take?!",
            "Potential is thru the roof. Great genetics. Good luck for the future.",
            "absolutely phenomenal bro. \n\ncrazy potential for 22",
            "God damn them braids are 10/10 mate",
            "Quads are insane man",
            "Your front shots are impressive. Be sure to post pictures with the overall",
            "Where is the dog? Oh nice prep",
            "That physique is fucking insane!! Good conditioning, and mid section, i love the upper body proportions but calves are lacking a bit lol! Insane physique tho! It’s so good!",
            "Jared Feather's brother from another mother, with somehow even more ridiculous hair. Jacked as hell and V taper is out of this world. Conditioning could be better for 1 day out. Looks more like 2 weeks out.",
            "Indy?"
        ]
    },
    "3 weeks out from chicago pro (5’7/188lbs)": {
        "title": "3 weeks out from chicago pro (5’7/188lbs)",
        "score": 113,
        "url": "https://i.redd.it/n3se4swzpd9d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Great physique bro",
            "Your shoulder to waist ratio is insane.",
            "Look fantastic,  good luck",
            "Phenomenal shape",
            "My inspiration",
            "Fine, I'll be the one to say it. Why her hair go from there to up?🙈🤣"
        ]
    },
    "195lbs to 168lbs, 15 days out from my first show ": {
        "title": "195lbs to 168lbs, 15 days out from my first show ",
        "score": 163,
        "url": "https://i.redd.it/8n3jny9p2d9d1.jpeg",
        "content": "",
        "num_comments": 15,
        "comments": [
            "The left pic you were 25 lbs more?",
            "William DaBro",
            "Got that comic book Spider-Man look in the midsection. Dope shit bro, good luck out there!",
            "Oh shit. This dude goes to my gym.",
            "Bro’s got Kawhi Leonard hands",
            "Impressive that you were able to maintain your size while cutting almost 30lbs\n\nHow did you do it?",
            "Soul Eater nice ",
            "Dude. Awesome Enjoi tattoo. Super cool to still see that around! Also impressive physique",
            "Enjoi",
            "Insane bro are you an influencer"
        ]
    }
}