{
    "Chapter 426 - Pre-Release Thread": {
        "title": "Chapter 426 - Pre-Release Thread",
        "score": 443,
        "url": "https://www.reddit.com/r/BokuNoHeroAcademia/comments/1dphd0e/chapter_426_prerelease_thread/",
        "content": "Keep all info, links, and discussion related to the leaks and scans for this week’s upcoming chapter inside this thread. Mods will not be posting or pinning any leaks.\n\nComments with links to full chapter scans will be removed. No images shall be allowed in any form of link or other medium that carries significance in the online ecosystem.\n\nAll attempts at posting anything related to leaks/scans outside of this thread will be removed, and directed here.\n\nThis thread will be pinned until the official release of the chapter is released.",
        "num_comments": 744,
        "comments": [
            "natsu & toya taking turns beating on the poor old man. not that he doesnt deserve it from them but hes getting a reminder every waking second lol",
            "I wonder if any of those faces are still healing, or if those are all healed scars. Poor Rei has a far worse scar than Shoto or Endeavor's Hood scar. Mt Lady, Gang Orca, and Hawks got dope scars from the PLF war, but Rei? That's a real nasty one",
            "Forgetting to post the pages that said Dabi is dying is next level trolling.",
            "***Tonight on the series finale of Keeping Up with the Todorokis. . . .***",
            "What a title. Damn.\n\nAlso, confirmation on Endeavor's retirement. He wanted to retire after Jaku because of the despair of the Dabi reveal, and the only reason he kept going was to stop Toya. Now that Toya has been dealt with, and the next generation is strong, he has no reason to continue. Wonder if he would still be a hero even if he did have a leg. Also, we figured he lost a foot, but a leg? Endeavor's rocking the Edward Elric lifestyle",
            "Wow, Natsu completely cutting off Endeavor from his life. He said something similar in Endeavor's hospital room after the PLF war, but I never expected it to be so extreme. I fully get not wanting to have his future fianc deal with all the trauma tho",
            "Oh I guess Toya was able to cry after all.....",
            "It seems like Spinner and Deku will have their talk next chapter, and thatll definitely be interesting to see (assuming Spinner has his mind back of course).",
            "Kudos to horikoshi for making this an hard pill to swallow to the very end  he could have made it so dabi becomes  a reason for the family to solve their issues and be happy again, but it turns beating a zombie almost to death doesn't count as family therapy",
            "Keeping up with Todorokis was produced in front of a live studio audience. \n\nThis program was made possible from contributions to your author from Viewers like you. Thank you!"
        ]
    },
    "My Hero Academia Season 7 Episode 9 - Discussion Thread Hub": {
        "title": "My Hero Academia Season 7 Episode 9 - Discussion Thread Hub",
        "score": 5,
        "url": "https://www.reddit.com/r/BokuNoHeroAcademia/comments/1dr7h7o/my_hero_academia_season_7_episode_9_discussion/",
        "content": "My Hero Academia Season 7 Episode 9 - Discussion Thread Hub\n\nSeason 7 Episode 9 / Episode 147 Discussion Threads:\n\n>[ANIME WATCHER DISCUSSION THREAD](https://reddit.com/r/BokuNoHeroAcademia/comments/1dr7gc1/my_hero_academia_season_7_episode_9_anime_only/) \\- For strictly anime-only discussion. All comments that hint towards or mention details not shown in the anime will be removed, regardless of spoiler tags, and can result in a ban.  \n[MANGA READER DISCUSSION THREAD](https://reddit.com/r/BokuNoHeroAcademia/comments/1dr7fy9/my_hero_academia_season_7_episode_9_manga_reader/) \\- Free discussion of details from the manga. No spoiler tags needed. Anime-onlies enter at your own risk.\n\nLink(s):\n\n* [Crunchyroll](https://www.crunchyroll.com/my-hero-academia) will have the subbed episode about 30 minutes after the episode finishes airing in Japan.\n* [Hulu](https://www.hulu.com/series/my-hero-academia-36e318dc-3daf-47fb-8219-9e3cb5cd28f2?dl) & [VRV](https://vrv.co/series/G6NQ5DWZ6/My-Hero-Academia) will also have the episode sometime after it airs.\n* No asking/posting illegal streams please!\n\n[Previous episode discussion(s)](https://www.reddit.com/r/BokuNoHeroAcademia/wiki/animelinks)",
        "num_comments": 0,
        "comments": []
    },
    "New Horikoshi bonus illustrations for 'You're Next'": {
        "title": "New Horikoshi bonus illustrations for 'You're Next'",
        "score": 123,
        "url": "https://www.reddit.com/gallery/1dr7ceb",
        "content": "",
        "num_comments": 16,
        "comments": [
            "Have a feeling that eyepatch guy will be gunning for Rody's \"most popular new character from the movies\" slot lol.\n\nSublime art as usual.",
            "That looks really good. This is pretty much the confirmation that these guys are the main characters/focus of the movie.",
            "Even though Im not the biggest fan of the movie timelines, this looks pretty great!",
            "I think they will give the movie a further marketing push because it will end up releasing a few days before the manga's final chapter.",
            "Im so happy to see such a gorgeous Origin Trio cover  (+Giulio) in their endgame outfits.",
            "Cool. I hope we get Volume Next here in the West when the movie comes out like we did with Volume World Heroes.",
            "Let's face it he will. You got a cool looking eyepatch wearing Italian butler voiced by Mamoru Miyano with him playing a vital role in the movie.\n\nI will be surprised if he's unpopular after this movie.",
            "As soon as Miyano Mamoru was revealed to be voicing the guy I knew thered be some tough competition - Rodys gonna have to watch out lol.\n\nHes lucky theres no more wsj popularity polls coming now that the story is ending (unless?)",
            "I mean Rody is cool and charismatic, but sometimes in life you have to face that there's no way you can compete with a handsome, badass, cool looking butler with robotic prosthetics who ride the Akira motorcycle and preparares coffee for himself in the middle of the ruins.\n\n Let's be real Giulio the eyepatch character is just made to be awesome.",
            "Why are you not a fan of the timeline?"
        ]
    },
    "So if Dabi was a hero, How should he use his quirk?": {
        "title": "So if Dabi was a hero, How should he use his quirk?",
        "score": 200,
        "url": "https://i.redd.it/96jwj4pimf9d1.png",
        "content": "I mean the quirk can harm the user. What the safe and efficient way to use the power or he should just give up? ",
        "num_comments": 58,
        "comments": [
            "I've seen suggestions he could actually make for a decent artic or mountain rescue hero like the Pussycats. His body is built to be more resistant to cold like his mom's and if he's careful with his flame output he could free people who are trapped or help keep them warm.",
            "Just refine output and control for suppression. Propulsion for increased impact power on his strikes. Immolation or repulsion of debris in regards to rescue. It's dangerous but doable",
            "I think the best case scenario is he could work as a search and rescue hero in snowy places: having cold resistance is amazing just on its own here, and even if he can't use a lot of his fire abilities (because he'll cook himself) it would still be a benefit to keep himself + civilians warm until they get back to shelter",
            "Go to enemy's hideout -> maximum output -> explode -> die\n\nDabi the wholesome nuke",
            "Does the fire have to be ON him? Like in ATLA how firebenders can shoot fire that's a little bit away from them? Can he just do that",
            "He could've worked the phones at his Dad's agency or any civilian adjacent role. Endeavor expresses that route as  a good option when he gives him the bad news. Effectively with his quirk combination he is essentially quirk less since they bring out the worst in each. Dabi is a sad character because many kids who have impressive parents want to be impressive in their eyes. I know because I was there once. It's tough when you fall short of expectations in that way.",
            "Some kind of technology that reduces the self harm of his flames, kinda like Dekus costume",
            "He'd be a delightful clown for children's parties. Lighting the candles on birthdays cakes probably doesn't take much fire power, and he could make little ice sculptures and hand them out.",
            "Just give him a suit that would be fireproof and cool him, that's it",
            "With a gun so the fire doesn t touch him and wearing a suit that resist fire"
        ]
    },
    "What’s y’all honest opinions on Tomura Shigaraki?": {
        "title": "What’s y’all honest opinions on Tomura Shigaraki?",
        "score": 245,
        "url": "https://www.reddit.com/gallery/1dqz2px",
        "content": "I’ll be honest his first appearance was pretty creepy, especially with him wearing his love ones hands… \n\nBut after seeing the concept art… I’m happy Hori kept the final design for Shigaraki dude would look pretty weird without his eyes or teeth.\n\nI do like Shigaraki he will always be my favorite villain out of MHA\n\nI’ll be honest, looking back at the series even when this is going to end, I am not a fan on how his character was treated\n\nEspecially getting fucked over by AFO in the War arc then fully coming back but again getting fucked over again by AFO again… 💀\n\nWhen it comes to how he was treated, it was decent in the final war arc but I do like his death very goated from him.\n\nI can see many people not liking his character that much but I do I would’ve preferred if he was the final antagonist that Deku, Either save or kills to beat.\n\nBut it is what it is I thought Shigaraki was a great character! \n",
        "num_comments": 169,
        "comments": [
            "I liked him, but i wish he didnt become a copy of one for all. I wish he overcame his mind control and became the primary antagonist over OfA\n\nFeel like he lost agency after the first war.",
            "That shot of Tomura saying to do your best goes hard ngl. But it doesnt exactly feel earned imo.",
            "Wasted potential, he could've been so much more than a body AFO kept possessing",
            "Cool story, still murder. Deku is still a precious cinnamon roll for trying to save him, and that's why we love him, but he had to die.",
            "I wish he had been independent of AFO. The story just degraded when AFO possessed him.",
            "I love his character wish we saw more of him after he left afos control.",
            "I dont particularly care about him. Cool design and backstory but I just dont feel him being the main antagonist. I dont know how to describe it but I just dont feel all that invested in him for whatever reason",
            "They fumbled the bag with him , when he first found liberation in my villain academia was prime shiggy",
            "Good concept, mediocre to bad execution.",
            "You know. I haven't really read the manga for a long while since i found myself dissapointed by the latter parts of it. But looking through the comments here has deeply implanted in my head the idea of shigaraki dunking the basketball that was his growth into the main villain before immediately being pushed into a wood chipper by the author. No real valuable addition to the discourse here."
        ]
    }
}