{
    "Chapter 425 Official Release - Links and Discussion": {
        "title": "Chapter 425 Official Release - Links and Discussion",
        "score": 694,
        "url": "https://www.reddit.com/r/BokuNoHeroAcademia/comments/1dbvuke/chapter_425_official_release_links_and_discussion/",
        "content": "#####Chapter 425\n\n--- \n\n##Links: \n\n- [Viz](https://www.viz.com/shonenjump/my-hero-academia-chapter-425/chapter/43341) United Kingdom, Ireland, New Zealand, Australia, South Africa, the Philippines, Singapore, and India).\n\n\n\n- [MANGA Plus](https://mangaplus.shueisha.co.jp/viewer/1021236) (Available in every country outside of China, Japan and  South Korea). \n\n--- \n\n##All things Chapter 425 related must be kept inside this thread for the next 24 hours. \n\n--- \n\n- [Previous chapter discussion threads](https://www.reddit.com/r/BokuNoHeroAcademia/wiki/discussionlinks)\n\n\n- [Discord](https://discord.gg/W2EDwPW)\n\n\n- 426 will be officially released on June 30th at 8AM PST. \n\n---",
        "num_comments": 614,
        "comments": [
            "Anyone got any theories on who the guy shuffling around in the street was?\n\n\nLooks like he was tied up with some sort of straight jacket and mask and those scissors were used to cut him loose.",
            "\"Hey uraraka can we talk?\"\n\n\"Your new haircut sucks I'm sorry\"",
            "Finally Shoto says something!  \n  \nI liked his introspective thoughts on how AFO was born and came to power during chaotic times.  \n  \nIt seems that Deku both noticed how Uraraka and Shoto still have some emotional baggage from the war. Uraraka seems to be forcing herself to appear like her old cheerful self, while Shoto is probably ready to see his brother in that giant Bacta tank at the end.",
            "All those people who said Shinso will replace somebody in class 1A was correct....\n\n\n\n\nExcept instead of it being Mineta like they had wanted it was Aoyama lol",
            "Hori’s gonna fuck around and make this epilogue at least two volumes (I’m very much okay with that)",
            "Is the crying person in the second last page someone we know or is that someone new",
            "A new chapter begins?! Year 2 baybeeeeee we'll see who this scissor wielding character is and probably check in on all the villains who have survived.",
            "Why do I feel like Hori is more excited to write the epilogue than he was writing the final arc?",
            "Horikoshi mixing in some tension and mystery even into the epilogue, nice.\n\nInb4 that's not a life support system for Dabi but a generator built around him \"Hey it's free clean blue seeth energy.\"",
            "Can't see his face but Endeavor probably looks down as fuck seeing Toya like that.\n\nBut at least he's keeping an eye on him like he promised when he torched AFO."
        ]
    },
    "Wednesday General Discussion - June 19, 2024 Edition": {
        "title": "Wednesday General Discussion - June 19, 2024 Edition",
        "score": 9,
        "url": "https://www.reddit.com/r/BokuNoHeroAcademia/comments/1djpleg/wednesday_general_discussion_june_19_2024_edition/",
        "content": "A weekly thread to talk about... Anything! Get to know your fellow MHA  fans, share other interests, or whatever else comes to mind.",
        "num_comments": 6,
        "comments": [
            "**Reminder to everyone:** Anything that hasn't happened yet in the anime is a spoiler.\n\n**To the OP:** If you want to discuss things in the manga, please flair the post as **\"Manga Spoilers\".**\n\nHow to spoiler tag comments:\n\n> \\>\\!Put your text here!\\<\n\n**THIS COMMENT IS AUTOMATICALLY POSTED IN EVERY THREAD NOT MARKED FOR MANGA OR MANGA SPOILERS JUST AS A REMINDER**\n\n-----\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BokuNoHeroAcademia) if you have any questions or concerns.*",
            ">!Is the manga continuing or is it just a really long epilogue? Chapter 423 was definitely the end of the OFA/AFO fight but then 424 and 425 haven't really given an major closure aside from learning that Deku doesn't have OFA anymore. I'm just a bit confused whether this is ending or if Horikoshi is setting up to continue MHA.!<",
            "I’m not a manga reader, but wtf dude is Deku just weak all the time until he gets serious? I know Toga is strong, I get that, but he in what appeared to be full cowling just allowed HER to drag him through a portal against his will?! What a chucklehead.",
            "Long epilogue, but this is the way to write a story. You have to tie up all loose ends, not just end it a chapter or two after beating the villain.",
            "Okay good to know! I'm totally down for a long epilogue and tying up loose ends for all the characters, I do hope Deku gets good closure because Chapter 242 just didn't do it for me during as closure. Thank you!",
            "No problem. And I agree, I hope it turns out well!"
        ]
    },
    "My Hero Academia Season 7 Episode 8 - Manga Reader Discussion Thread": {
        "title": "My Hero Academia Season 7 Episode 8 - Manga Reader Discussion Thread",
        "score": 39,
        "url": "https://www.reddit.com/r/BokuNoHeroAcademia/comments/1dlruuq/my_hero_academia_season_7_episode_8_manga_reader/",
        "content": " Season 7 Episode 8 / Episode 146\n\nThe episode will begin airing in Japan at 5:30 pm JST.\n\n>IF YOU ARE AN ANIME-ONLY, READ THE COMMENTS AT YOUR OWN RISK. THEY WILL CONTAIN UNTAGGED MANGA SPOILERS. IF YOU DON’T WANT TO BE SPOILED, HEAD TO THE ANIME WATCHER THREAD.\n\nLink(s):\n\n* [Crunchyroll](https://www.crunchyroll.com/my-hero-academia) will have the subbed episode about 30 minutes after the episode finishes airing in Japan.\n* [Hulu](https://www.hulu.com/series/my-hero-academia-36e318dc-3daf-47fb-8219-9e3cb5cd28f2?dl) & [VRV](https://vrv.co/series/G6NQ5DWZ6/My-Hero-Academia) will also have the episode sometime after it airs.\n* No asking/posting illegal streams please!\n\n[Previous episode discussion(s)](https://www.reddit.com/r/BokuNoHeroAcademia/wiki/animelinks)\n\nKeep ALL Season 7 Episode 8 things in here for the next 24 hours!",
        "num_comments": 57,
        "comments": [
            "Yo bro\n\nI wasn't expecting them to animate the child scene like that....and got wrecked because of it \n\n(but i called it them playing Kimi no Chikara tho :D)\n\nBut who needs emotions anyways",
            "I'm in actual awe of Dabi's voice actor's ability to manipulate his voice so precisely. Incredible work.",
            "Shoto’s crying in the next week preview, I can’t take it. This fight must’ve hurt him on a very deep personal level. Dabi absolutely trashed Shoto with everything that he has, the voice actor did a perfect job portraying Dabi’s hatred and jealousy toward his “perfect replacement” really well.\n\nI like how the anime expands more on Toya’s mental breakdown. The kid got it rough even before he stir-fried himself into oblivion.\n\nAnd we still have Todoroki Family Epilogue next week, the timing is absolutely nuts.",
            "Dabi and Shoto's VAs totally killed it in this ep!!",
            "You know what? Its Good! I bet they are going to cook more when Dabi Awakens",
            "DIRECTION\n\nOST\n\nVOICE ACTING\n\nCONSISTENT ART\n\nGOOD MOVEMENT \n\nHoly shit.... I actually felt something in my bones similar to Season 1-3.... very powerfully made episode. I'm very happy with this new direction we have",
            "Dabi's backstory was done wonderfully, the whole atmosphere was done so well and it was even expanded. His emotions and devastation were palpable.\n\nThis was definitely the best animated episode so far. The fight itself had moments which I loved, especially Dabi's moves. But I gotta say I was a little underwhelmed with how Shoto's Glacial Aegir was animated, didnt look much like a ultimate move. It wasnt bad at all, but fell flat compared to the previous atacks. I think it needed a little more impact.\n\nStill definitely a very good episode especially on the emotional delivery. The voice actors were absolutely fantastic.\n\nVery curious how much they are adapting next episode, are they doing the whole endeavor fight or split it in two episodes. I think it would be best to do it all in one episode. And since a new poster for the episode was released to promote it I think that will be the case. A lot of the very strong animators werent used this episode either so I am also expecting them to appear either on the Endeavor or Bakugo episode. And both are great choices, although personally I would prefer Endeavor to have a little more love animation wise (I absolutely love his fight).",
            "The dabi vs todoroki fight ends in the anime and the closure for the todoroki family is happening in the epilogue chapters of the manga next week. Coincidence? \n\nI think NOT! lol but no I’m actually being serious here am I crazy or what?\n\nAlso this Agni Kai was the best one since zuko vs azula! XD",
            "THAT WAS INSANE",
            "Mman Bones just went Insane\n\nIt's they burned it fried it\n\nPeak animation\n\n10/10 episode"
        ]
    },
    "Why didn’t Erasure kill the Nomu doctor?": {
        "title": "Why didn’t Erasure kill the Nomu doctor?",
        "score": 54,
        "url": "https://www.reddit.com/r/BokuNoHeroAcademia/comments/1dlpi94/why_didnt_erasure_kill_the_nomu_doctor/",
        "content": "When Eraser Head targetted the Nomu doctor it disabled his anti-aging quirk causing his skin to wrinkle, but he didn't die. I know old people don't just like instantly die past a certain age but if he was AFO's age (I assume he was even older) he should just end up dying in a matter of seconds or at least when he was grabbed. Is this a limit of Erasure? Even if he doesn't just die from that, if he suffers from any serious damage does it go away after Erasure is deactivated?",
        "num_comments": 14,
        "comments": [
            "The thing about aging is that aging itself isnt what kills someone but rather that it makes one so frail and weak that anythings gets you and that accumulates over time\n\nWhat i think happens is that when the doctor gets hit with erasure his cells do age but he doesnt get all the diseases and problems acquired with aging, like he doesnt instantly gain dementia or lose controls of one bowels, as those are things that you accumulate through the aging process. And so he can last some time without any immediate issues until the ambient hits him with that common cold left right goodnight\n\nI could easily be wrong, im not a doctor lol.",
            "The doctor has probably done a crap ton of medical procedures on himself to help him live even beyond his quirk.",
            "Aging doesn't kill, so when he suddenly became 120 or whatever, he didn't die.",
            "If he gad held it long enough it probably would have. All of his cells and organs suddenly aged up 120 years, but it probably would take a bit of time for them to start failing as the age catches up to them.",
            "I just want to know why he was Dekus doctor at the beginning of the series",
            "Your questions makes me imagine the doc having an immortality quirk but that’s all it does. Or one that just lets him control his appearance. All the rest could be surgical. Transplanting newer organs, bone reinforcement, infusions of god knows what to keep the brain from deteriorating. I like the possibility of a lame immortality quirk that just won’t let him die, while his body and mind wither in prison.",
            "Yeah i imagine its something like that\n\nHe does age and shrivels up, gets weaker and less capable but since Erasure wont last for long it ultimately wont bother him\n\nLike i am unsure what happens when he hits 150 or 200 but we dont even fully understand aging IRL either\n\nI imagine eventually it would get to the point where maybe he legit just collapses and cant breathe maybe? But idk.",
            "You missed a lot of important context. Dr Garaki and AFO set up a network of pediatric hospitals so AFO could either steal potentially good quirks, or so he could create possible vessels for his take-over plan.",
            "They just look similar",
            "[deleted]"
        ]
    },
    "The series peaked at Lemillion, I will never forgive Horikoshi for writing him out of the story for so long": {
        "title": "The series peaked at Lemillion, I will never forgive Horikoshi for writing him out of the story for so long",
        "score": 1226,
        "url": "https://www.reddit.com/gallery/1dl3z9h",
        "content": "",
        "num_comments": 168,
        "comments": [
            "Reminds me of rock lee vs garra the same moment they both became my favorite characters too \nThe wait a minute this man is a demon with or without ninjutsu/quirk energy",
            "Damn i love Lemillion with White eyes, when he figured they're gonna shoot Eri.",
            "So this is my first time seeing this fight in the manga. And holy crap does it hit hard. It was one of my favorite fights in the anime, but after seeing this, I don't think they did it justice.",
            "No really though, reading it again makes me tear up. The writing is SO GOOD, it's honestly beautiful, and Horikoshi's biggest achievement was introducing Mirio then almost immediately making him the most compelling character in the entire manga.\n\nThis is why for all its flaws, and they are very real, for all of its serious pacing issues, for all of the issues with MHA, I can't just say \"Oh yeah the writing isn't that good\" or \"It's just a generic battle shonen\". When Horikoshi hit, he hit grand slams.",
            "“The reason heroes wear capes, is to wrap up and protect, little girls in pain!” is my favorite quote of all time. This entire set of chapters was amazing like Eri finally gaining hope with “I am going to be your hero.” and Mirio sacrificing it all just so she’ll never have to be in pain ever again, with him still fighting someone who can kill him with a touch because he’s still Lemillion.",
            "Arguably the absolute peak. (I don’t think the series will ever top United States of smash)\n\nBut undeniably a very high point. Probably my #2.",
            "I mean you can't just have him regain his powers right after, it takes away the weight of that scene and fight. I think he kept him quirkless for the right amount of time or could have kept it until the final war. I could get not being happybeithvth even in anime or something but being like \"I'll never forgive hirokoshi for this\" is crazy. Bonkers even",
            "The way bones bones gave us a PowerPoint slideshow for this fight is a travesty",
            "Favorite character in the series, love him so much",
            "I agree that stuff like Lemillion vs Overhaul and All Might vs AFO were easily some of the best moments in the series."
        ]
    }
}