{
    "Read Reddit's Site-wide rules here. Please follow them. Report content that doesn't.": {
        "title": "Read Reddit's Site-wide rules here. Please follow them. Report content that doesn't.",
        "score": 224,
        "url": "https://www.reddit.com/r/Bolehland/comments/u9ubro/read_reddits_sitewide_rules_here_please_follow/",
        "content": "Rule 1\n\nRemember the human. Reddit is a place for creating community and belonging, not for attacking marginalized or vulnerable groups of people. Everyone has a right to use Reddit free of harassment, bullying, and threats of violence. Communities and users that incite violence or that promote hate based on identity or vulnerability will be banned.\n\nRule 2\n\nAbide by community rules. Post authentic content into communities where you have a personal interest, and do not cheat or engage in content manipulation (including spamming, vote manipulation, ban evasion, or subscriber fraud) or otherwise interfere with or disrupt Reddit communities.\n\nRule 3\n\nRespect the privacy of others. Instigating harassment, for example by revealing someone’s personal or confidential information, is not allowed. Never post or threaten to post intimate or sexually-explicit media of someone without their consent.\n\nRule 4\n\nDo not post or encourage the posting of sexual or suggestive content involving minors.\n\nRule 5\n\nYou don’t have to use your real name to use Reddit, but don’t impersonate an individual or an entity in a misleading or deceptive manner.\n\nRule 6\n\nEnsure people have predictable experiences on Reddit by properly labeling content and communities, particularly content that is graphic, sexually-explicit, or offensive.\n\nRule 7\n\nKeep it legal, and avoid posting illegal content or soliciting or facilitating illegal or prohibited transactions.\n\nRule 8\n\nDon’t break the site or do anything that interferes with normal use of Reddit.",
        "num_comments": 66,
        "comments": [
            "Admin, makin byk babi2 dari r/malaysia buat kacau sini. Kasi purge sama diorang terus hanjir punya sohai.",
            "There's no rules in this sub, mods too lazy to write it down",
            "a",
            "I got Perma banned from Reddit cause I commented on r/Malaysia that Wan Asshima Kamaruddin should be deported to Syria. Two year old account just gone.",
            "[deleted]",
            "Too much rule im to lazy to read",
            "D",
            "E",
            "F",
            "H"
        ]
    },
    "r/bolehland Monthly Thread to complain about r/Malaysia for 04 June 2024": {
        "title": "r/bolehland Monthly Thread to complain about r/Malaysia for 04 June 2024",
        "score": 7,
        "url": "https://www.reddit.com/r/Bolehland/comments/1d76j7d/rbolehland_monthly_thread_to_complain_about/",
        "content": "kesian takde pantun",
        "num_comments": 3,
        "comments": [
            "is it just me or r/malaysia mod is overzealous?\n\ni open tered, x sampai 3 reply already kena shut down\n\n[https://www.reddit.com/r/malaysia/comments/1dikrwl/jeng\\_jeng\\_jengturns\\_out\\_anti\\_vax\\_disinformation/](https://www.reddit.com/r/malaysia/comments/1dikrwl/jeng_jeng_jengturns_out_anti_vax_disinformation/)",
            "Don't follow the rules get removed loh. Using the same title as the article is just literally copy and paste and takes 3 seconds",
            "If it's not Anti Islam, Pro Genocide or Pro Butt-effers, mods get pretty salty quick"
        ]
    },
    "Cikgu Amoi teach in BM": {
        "title": "Cikgu Amoi teach in BM",
        "score": 386,
        "url": "https://v.redd.it/yyzp4okgff9d1",
        "content": "",
        "num_comments": 82,
        "comments": [
            "How come when I was studying all the teachers are just old almost retired folks?",
            "https://preview.redd.it/n7xi5hg7mf9d1.png?width=1080&format=pjpg&auto=webp&s=a04b07c38a8acbda025610c27bbc591a89f42d12\n\nHaish...",
            "Why my time didn't have this kind of teacher sial, I wouldn't be sleeping in class if this kind of teacher appeared like a shiny pokemon",
            "I used to have a crush on my math teacher in my highschool. She's chinese, petitte and cute but very strict during class. She used to praise me a lot because I'm the head prefect. Math is my weakest subject before that, but I remember that I used to study hard just for her to the point that I scored perfect 100% for my math 2 times in a row for exams. Things I would do man to make her proud, sometimes I think back about that time  I felt a bit stupid. Later that year she get married and get pregnant not long after and take a break from teaching. I didn't get any perfect score after that....",
            "[me](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTZC2kEtZX9sMCXlILBpJf8oZ_fqpm1uH84LA&s)",
            "So horni this turns you guys on?\n\nDafaq.",
            "\"cacat\" 🤣, that's why I love kids, fucking savaged and 0 filter",
            "![gif](giphy|v3p3CtSrNYNLa)",
            "chopstick > penyepit??",
            "Orang Sabah ni. 😂 Patutlah lebih peramah. Maaf lah horni bois, ni bukan amoi KL ya"
        ]
    },
    "Bila Hawk Tuah sudah terkenal di seluruh dunia be like : ": {
        "title": "Bila Hawk Tuah sudah terkenal di seluruh dunia be like : ",
        "score": 178,
        "url": "https://i.redd.it/mii5ytz05f9d1.jpeg",
        "content": "Meme melayu",
        "num_comments": 28,
        "comments": [
            "Am I the only one who thinks it wasn't funny?",
            "https://preview.redd.it/b2ja2locef9d1.png?width=1440&format=pjpg&auto=webp&s=2d338a06a9e731f4f5147aa92f17f57e9782a14c",
            "hang2 tu panggilan blah2 utara dan bukan nama khas pun. bukan juga gelaran pangkat dlm kerajaan atau kasta dlm komuniti. \n\ntapi uniknya hang 7 bersahabat tak melibatkan org lain. \n\natau mungkin gelaran yg da pupus, hanya kegunaan melayu kuno cthnya hang nadim.",
            "ngl kalau aku jumpa hang tuah, aku bagi dia hawk tuah too ;)",
            "![gif](giphy|rRTjCD15whJGjuwB5Z|downsized)",
            "Takkan melayu hilang di dunia - Haktuihh spit on that thing",
            "Hawk tuah spat on that Thang",
            "Dude. Legit. 1st time I saw it I thought it was a hang tuah meme. I thought \"Shit, has Literature Klasik Melayu has broken into the mainstream memeverse?\"",
            "Had to ask AI\n\nThe Hawk Tuah Girl became a TikTok sensation after a street interview where she was asked about a move in bed that drives men wild. Her response, delivered in a Southern accent, was, “Oh, you gotta give him that hawk tuah and spit on that thang.” Since then, the phrase “hawk tuah” has caught on as an internet meme, and people have been trying to identify her12. \n\nIt’s essentially an onomatopoeia for the sound of spitting. Bunyi meludah pun nak claim? So desperate?",
            "Lol"
        ]
    },
    "Inilah masyarakat zaman sekarang 😔": {
        "title": "Inilah masyarakat zaman sekarang 😔",
        "score": 191,
        "url": "https://i.redd.it/pxx0a3qcfe9d1.jpeg",
        "content": "",
        "num_comments": 52,
        "comments": [
            "Korang, new copypasta dah keluar",
            "https://preview.redd.it/25ixq8y8we9d1.png?width=1080&format=pjpg&auto=webp&s=5fb1c5c1798e18dc870170811f7566bc638cb701",
            "aku ingat kut ni psa rupa rupanya pengalaman diri",
            "https://preview.redd.it/t2jk1skh3f9d1.jpeg?width=735&format=pjpg&auto=webp&s=86f8797c21a8e232cf63c93ac72b1e79ae00aa4a",
            "Fuckin wanker",
            "Tenaga dik kecil 🍆😞",
            "https://preview.redd.it/jvfru7v69f9d1.jpeg?width=1001&format=pjpg&auto=webp&s=53068765ba17394bc8f671fcd4dc90247c4891fd\n\nhow to unlearn malay",
            "Penance ambatukam 🤯",
            "Ah thats Penance from Arknights.",
            "When you put it that way, I feel bad for jackin now.. \n\nBerjuta anak mati atas tisu"
        ]
    }
}