{
    "Bollywood Bhasad - A Weekly Thread to Rant about Bollywood": {
        "title": "Bollywood Bhasad - A Weekly Thread to Rant about Bollywood",
        "score": 7,
        "url": "https://www.reddit.com/r/BollyBlindsNGossip/comments/1dj5fps/bollywood_bhasad_a_weekly_thread_to_rant_about/",
        "content": " \n\nWelcome to Bollywood Bhasad\n\nThis is a Weekly thread to post all your rants about Bollywood here. You can rant on\n\nWhy Bollywood is Flopping\n\nNepotism\n\nActors and their arrogance\n\nLow quality songs\n\nAnything that needs a rant goes in comments.\n\nIf Mods find something outstanding, they'll ask you to make a separate post for your comment. Members can tag Mods and req for a separate post\n\nThis thread will be posted every Week \n\n**You can also check our Discord Link and Twitter Handle**\n\n[Bollywood Discord Invite](https://discord.gg/uns6F8F6) \\- Send DM to EccentricBai for latest Discord Invite\n\n**Twitter** [Reddit Bollywood Twitter /X](https://twitter.com/redditbollywood)",
        "num_comments": 9,
        "comments": [
            "What is happening with Poonam Pandey, Sherlyn Chopra???? Where are they now????.No update about them",
            "Jamie pant shirt guy made a piece on AB Jr and I find it idiotic,.... The title is harsh to say the least. Jamie pant shirt is a leech",
            "I don't understand hate for Punjabi music on this sub. If u want to promote other music, u can do that. It will be good. India is big enough to accommodate everyone",
            "Imp questions",
            "Sherlyn Chopra for you today-\n\nhttps://www.instagram.com/reel/C8ZMbWToJe-/?igsh=dGc2eWUyeDE1NGtm",
            "isn’t there a separate sub for music though? this is the gossip sub",
            "It is part of  Bollywood.\n\n\nGossips about South actors who haven't even worked in Bollywood hets published here.",
            "buddy i’m not saying you can’t post gossip about punjabi people here. i’m just saying there’s a seperate sub to appreciate all kinds of music",
            "My point wasn't about discussing Punjabi music. I don't post anything about Punjabi artists after my birthday post for Sonam Bajwa was removed(somehow similar posts for South Indian actors are  allowed). Posts about Punjabi artists who are not named Diljit aren't allowed here.\n\nMy comment  is related to comments devaluing Diljit at Jimmy Fallon show. I don't think they would have said same if Arijit Singh was there.  Even political comments against him are allowed."
        ]
    },
    " Hi, I'm Varinder Chawla, a Bollywood paparazzo with 25 years of experience and 4.7M Instagram followers. Join me now in r/BollyBlindsNGossip and ask me anything about my journey, celebrity encounters, exclusive Bollywood moments and some fun and interesting stories about your favourite stars\n": {
        "title": " Hi, I'm Varinder Chawla, a Bollywood paparazzo with 25 years of experience and 4.7M Instagram followers. Join me now in r/BollyBlindsNGossip and ask me anything about my journey, celebrity encounters, exclusive Bollywood moments and some fun and interesting stories about your favourite stars\n",
        "score": 1268,
        "url": "https://www.reddit.com/r/BollyBlindsNGossip/comments/1djjw4m/hi_im_varinder_chawla_a_bollywood_paparazzo_with/",
        "content": "https://preview.redd.it/ew86v9n7bj7d1.jpg?width=1003&format=pjpg&auto=webp&s=a83e92213f81c7477a64fcaa69f4a5a0fd26342d\n\nAMA\n\n>thank you for your questions meet you later",
        "num_comments": 427,
        "comments": [
            "Which celeb is fake like they'll switch once the camera is off?\n\nEdit : The answer was Ajay Devgan",
            "Selmon Bhai se phatti hai na? Sach batao",
            "Do random citizens who have exclusive photos or videos contact paps to sell it? \n\nHow common is this?",
            "Which celeb is on top of rate card and hardest to spot?",
            "Do you get mad when celebs call paps and act like they don't know what's going on? \n\nAlso, what's the rudest celeb encounter you've had?",
            "What is your equation with Viral Bhayani ? Opponents or friends ?",
            "How often you have to delete or not post because celebs PR or manager asked you not to post.",
            "Which celeb calls paps the most?",
            "Which celeb makes you the most money or gets you the most views?",
            "If i pay you money, can you give me exclusive pics & information abt Junaid Khan?"
        ]
    },
    "Is it right ?? ": {
        "title": "Is it right ?? ",
        "score": 1476,
        "url": "https://v.redd.it/d9csugnm228d1",
        "content": "",
        "num_comments": 162,
        "comments": [
            "\n\n#You can Add More Details\n\nIf OG post has some missing details, /u/IcyCryptographer9501 or Members can add details ,as reply to this comment. Click to Expand. \n\n      \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BollyBlindsNGossip) if you have any questions or concerns.*",
            "Obviously. Female models get paid more than male models.",
            "Absolutely. For half a decade Madhuri was paid more than the three khans, because she was the bigger star and bringing in the footfalls",
            "Not sure why simple economics is being made so complicated ! Isn’t this a no brainer. \nPerfect example of people twisting the topic to push their agenda",
            "Rani & Kareena's face lol\nSay what you may about Aamir, but it's hard to counter his points logically",
            "Rani and kareena be like - don't give me logic. Just give me more money.",
            "Agree but then again it should be assesed properly also\nGuys like akki , tiger , sid and so many are not pulling audience on their name so why are they being paid so heavy\n\nAs KJO once said rightly the first day opening should be their fee",
            "I am in total agreement with him..have held same view point and mentioned here many times\n\nLike spot boy , cameraman they are there on all days of shoot why they also not paid equal\n\nI mean actors paid more than doctors \n\nLets pay equal to everyone why only to actress..\n\nWhy actress dont pay equal pay to their house help",
            "Exactly, just like rani Kareena Deepika will get paid more than Manoj Bajpai. Pretty sure Manoj is a superior actor than all combined last I checked.",
            "Am sure Kareena was paid much more than Vijay Verma and Jaideep Ahlawat for Jaanejaan\nAm sure Rani was also paid more than Jim Sarbh for Chatterjee vs Norway"
        ]
    },
    "Ronit Roy on how he lost a Hollywod movie, Zero Dark Thirty, because of Karan Johar's movie. The pain in his voice💔": {
        "title": "Ronit Roy on how he lost a Hollywod movie, Zero Dark Thirty, because of Karan Johar's movie. The pain in his voice💔",
        "score": 457,
        "url": "https://v.redd.it/8kan979qd28d1",
        "content": "",
        "num_comments": 35,
        "comments": [
            "\n\n#You can Add More Details\n\nIf OG post has some missing details, /u/DragonDeninSharkTank or Members can add details ,as reply to this comment. Click to Expand. \n\n      \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BollyBlindsNGossip) if you have any questions or concerns.*",
            "He should have dropped out and gone for zero dark thirty",
            "What the actual fuck! 😡🤬\n\nIn order to not piss off the Bollywood mafia and get blacklisted, he was forced to give up what would have been an amazing opportunity career wise for Ronit (who totally deserved it).\n\nFuck these Bollywood cabals!\n\nI'm sure the same curtesy would've been given to his precious aloo baby had she gotten such an offer (big IF).\n\nI so wish Ronit had walked out, but he also knew what lies on the other side once you piss off and hurt these bullies' egos. Can't risk it for a film role in another country sadly.\nI mean he honoured his commitments and they still took away/cancelled whatever his role.\n\nThose vindictive, insecure bastards!🤬",
            "This is so sad :(\n\nZero Dark Thirty was an incredible film!",
            "Nag Jo - Mein gira hua banda jama neech baliye",
            "maybe kjo got jealous ki bande ko movie mil jayegi hwoo me se",
            "Everyone tried to make it light by laughing but we all know what everyone were thinking. Mudafuka Kjo !",
            "I can’t believe he had to turn  down such an incredible opportunity to star in wattpad high school fluff",
            "Karan living to his reputation.",
            "Wow and kjo gave him Muttt !!! wee in the movie even if it was pretended !\n\nRonit Roy reminds me of Tobias Menzies !!! "
        ]
    },
    "Who is she talking about?!": {
        "title": "Who is she talking about?!",
        "score": 162,
        "url": "https://i.redd.it/btbzpdess38d1.png",
        "content": "I mean I get it, she is talking about someone who went under the knife but at this point, everyone in the industry has some or the other work done. ",
        "num_comments": 83,
        "comments": [
            "\n\n#You can Add More Details\n\nIf OG post has some missing details, /u/hoemean or Members can add details ,as reply to this comment. Click to Expand. \n\n      \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BollyBlindsNGossip) if you have any questions or concerns.*",
            "https://i.redd.it/4049s4ysy38d1.gif",
            "5 noses ago..😂",
            "This is clearly a jab at Audrey Rao 💀😂",
            "Lmfao this is definitely petty but I would bet a kidney that the Heeramandi cast had some DRAMA behind the scenes. She clearly despises Aditi for building what’s essentially a new career after shaving a decade off her age and getting tons of work done. I feel for actresses who have to do this to keep their careers. The industry is so misogynistic. But Aditi has also taken the whole “pretending to be a decade younger” thing too far and I can see Richa being like fuck this, I’m not a party to your fake persona.",
            "She has the third trimester \"I don't give a f**k savage..no filter brain\".. I remember having it and I am loving it in her..",
            "It’s Aditi Hyadri also why does it feel Richa is turning into kangu 😭😂",
            "Good thing Richa did.. that aditi person is an obnoxious hypocrite and such people deserve to be called out publicly.. gets a 100 surgeries and not only claims it's genetics but also shames other actresses for getting surgeries (definitely less in number than this madam that too) how can we forget how she openly shamed other actresses in a press meet with randeep hooda\n\nKhud tho 46 and calls younger women as didi.. the audacity of that b**h really... Such people deserve to be shown their place which is the BIN.",
            "![gif](giphy|cKqETBQIccfPtQIkZe)\n\nMasoom Dil Hai Mera Ise Troll Kiya Jaye...💔",
            "Kya hi response hai 🤣🤣🤣"
        ]
    }
}