{
    "We've got a DISCORD SERVER!": {
        "title": "We've got a DISCORD SERVER!",
        "score": 18,
        "url": "https://www.reddit.com/r/bonehurtingjuice/comments/1aqx16j/weve_got_a_discord_server/",
        "content": "So, as the BHJ community has been somewhat rehealing itself after the GREAT COMMUNIST TAKEOVER i've decided to ask Kirbizia about partnering the BHJ community with the OkBR discord server, this is due to the past BHJ servers not really performing well when it came to having a lot of members, they would die and nothing would ever happen! So now instead what will happen is BHJ, just like the shared minecraft server will gain its own share within the OkBR discord server, with a subreddit stream channel, subreddit discussion channel, etc.  \n\n\nCurrently there's a pretty fine and dandy VALENTINE'S DAY seasonal event, you can grind coins and gain lots of cool rewards, get a custom flair, custom vanity roles, and even BAN users!!! (WHAT??!?!)  \nThus, what are you waiting for...  \n[**https://discord.gg/4avADksSYU**](https://discord.gg/4avADksSYU) **(The server is already fairly active with around 2,000 users, come join us and talk talk TALK!!!!!!**  \n\n\n[https://steamcommunity.com/groups/okbrgroup](https://steamcommunity.com/groups/okbrgroup) Don't forget to also join the shared steam group too if you want! (And our friends' TF2 server.) \"Nailgun World\" which tries to make the game feel like its 2007 again!  \n\n\nAll BHJ users will be able to get a pat on their head and maybe a little cool role for being BHJ users? (Maybe haha)  \n\n\n&#x200B;",
        "num_comments": 19,
        "comments": [
            "Ow my bones hurt\nThis really is a... Juice of the bone hurt!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bonehurtingjuice) if you have any questions or concerns.*",
            "No",
            "We can ban other users??",
            "My bones have now been fully healed",
            "Y tho",
            "But why",
            "I guess I’m gonna get “off” the subreddit and “on”to the server? Eh? Ha! He he.",
            "Can we get a comment on all the non bhj posts?",
            "https://preview.redd.it/y1tvf4omyxic1.png?width=1080&format=pjpg&auto=webp&s=a78bdde8f6fce22c722883b90c2abff68db63e27",
            "https://preview.redd.it/7tt4pgemtmic1.jpeg?width=1125&format=pjpg&auto=webp&s=61a445d8412cbd91e8e864a05d99f0cb987ee6f2"
        ]
    },
    "New Rules and Rules Clarifications": {
        "title": "New Rules and Rules Clarifications",
        "score": 67,
        "url": "https://www.reddit.com/r/bonehurtingjuice/comments/1cg2y39/new_rules_and_rules_clarifications/",
        "content": "It seems I don't formally have permissions to edit the rules in the side bar (that I am aware of) so I'm going to describe clarifications on the rules implemented.\n\nBased on the recent survey conducted WokelyCorrect will be banned. There was consideration for leaving other edits of bigoted sources, but the posts this past week have not put this in a good light: discriminatory caricatures of minorities cannot be changed through text alone. Posts that include discriminatory imagery will be removed, effective after this post.\n\n- Rule 1: No antimemes. When the text is changed to describe solely what is in the image. Does not apply when the image was reinterpreted and the items described are not what was originally represented by the source image.\n\n- Rule 2: No Reposts. Self explanatory, do not repost others' BHJ from this sub. If obtained outside this sub use the \"Found\" flair, and source where you found it preferably via link.\n\n- Rule 3: Edit text, not the base image. Some of you are really pushing the limits of this rule with musical notes, Jojo menacing effect, adding rectangles/circles and calling them dashes and periods, etc. If the text is functioning as text it is text, if it is representing imagery (I's and L as loss, musical notes not on a staff, blushes on cheeks) it is not text. Small image edits are okay but if your joke/new context does not work without the edit it breaks the rule. Effective only to posts after this one due to lack of clarity in the rules.\n\n- Rule 4: No title based jokes. This also applies to screenshots where the title, comments, or caption (outside of image like Reddit captions) contain the joke.\n\n- Rule 5: Random. Refers to when the edited text has nothing to do with the base image. Putting a generic joke, generic song lyrics, game/literature/movie reference or anything otherwise completely unrelated to the image is against this rule. Again, effective only to new posts due to lack of clarity.\n\n- Rule 6: On-topic. Posts should consist of edited text of a base image (that is not primarily text like a Twitter/4Chan post etc) that changes the meaning and/or context of the source material. For discussions of the state of the sub use the \"Meta\" flair.\n\n- Rule 7: Do not advertise. Applies for both posts and comments.\n\nSome more rules are in effect but are not currently listed in the sidebar:\n\n- No joke other than a reference to BHJ: a screenshot or post that says only says something to the effect of \"Bone Hurting\", \"off\", \"Eh?\" \"HA!\" or \"Hehe\". Most edited panels would fall under Rule 5, this primarily applies to screenshots.\n\n- Self Watermarked: an edit to a panel does not give you rights to the art. Exception is juicing one's own comic/artwork and leaving the existing watermark intact.\n\n- Banned Source: Stonetoss and WokelyCorrect are banned sources.\n\nSome common reports are technically not rules but can be added depending on public opinion:\n\n- linking or adding source image: it is common courtesy to source the artist. If you do not feel comfortable sourcing the artist due to the artist's \"opinions\" it may be a better idea to juice a different image. When people are asking words that begin with O on your post they are asking for the source material.\n\n- Speed of Lobsters: if the meaning is changed solely through removing portions of the existing text it may be better suited for r/SpeedOfLobsters.\n\nEdit: new rules should now be up. Let me know if they're not displaying correctly\n\n\n",
        "num_comments": 42,
        "comments": [
            "Ow my bones hurt\nThis really is a... Juice of the bone hurt!\nDiscord Server : https://discord.gg/tcCs7GWrUz\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bonehurtingjuice) if you have any questions or concerns.*",
            "This isn't a bhj. Maybe post this on a different sub like r/rules",
            "NO MORE TRANS WARIO??!!?! UNSUBBING!!!",
            "guess it pissed you \"off\" Eh? HA! he he.",
            "The banned sources should be added to the listed rules. Learning the hard way is confusing.",
            "Btw, if you want to see bone hurting juice harvested from stonetoss, then you can take a look at r/Stonetossingjuice",
            "I'm confused, what are we supposed to post? I genuinely can't think of anything I've seen from this sub that doesn't break at least one of these rules in one way or another. This isn't even a jab or anything I'm just straight up lost here",
            "i guess that rule 8 didnt get \"off\" the ground, eh? HA! Hehe.",
            "Honestly.....this subreddit has just become posting stupid conservative comics with inserted gibberish text and the comments grabbing the low hanging fruit of attempting to deconstruct why the original comic was stupid in the first place.\n\nWhat made the OG comics was how absurd they were and was the satire of Internet culture. No insult to the moderation team I know how difficult it is.\n\nI'm out but I hope the subreddit find its footing.",
            "Wait, is this\n\nhttps://preview.redd.it/fspf6vin9a3d1.jpeg?width=503&format=pjpg&auto=webp&s=471d2bfce0b8146b620b88b150b3ad854dd2b63c\n\nAn anti meme, or can I post it here?"
        ]
    },
    "Rule 3": {
        "title": "Rule 3",
        "score": 5808,
        "url": "https://www.reddit.com/gallery/1dqrf56",
        "content": "",
        "num_comments": 186,
        "comments": [
            "I'm sure you're well aware that this is technically breaking rule 3 so I went ahead and reflaired as Meta. (It will stay up for awareness)\n\nUsing a modified source image is generally only allowed if the modified source is not yourself, even if you were the original comic artist. In such a case, it is generally good practice to cite both the obscure's edited and unedited versions. This is preferably done in the form of a link; in cases of less tasteful artists one could just not juice their art.\n\nIf the pre-edited version has gained popularity comparable to or greater than the unedited version (\"you're clearly dumber\", \"I wish I had her body\" with two thought bubbles, third place guy celebrating medal but now in tenth place, etc.) it is fine to use the edited version as your only source. General rule of thumb is if someone were to search for the source image via Google Image search the pre-edited version should come up in multiple of the results (excluding the post you just made).\n\nIf there is significant doubt that the image was not modified, or if the image is an uncommon edit of a popular template like in this post, it will be removed unless a proper source showing the pre-editing is provided (a link with just an image is not a proper source). I can usually quickly find the actual source though which would be added in the removal comment. In this case the source is https://www.reddit.com/r/comics/s/d04lOXNOBR. The faces are all replaced with \"Shrek\" face.",
            "Surely this wont lead to a modification of rules and/or anarchy",
            "https://preview.redd.it/y8tldlfo7d9d1.png?width=893&format=png&auto=webp&s=965de2e1b0563d4f0624978a000c50114f1bec81\n\nWell boys pack it up our bones are juiced",
            "unfathomable",
            "The mods have to kill you now, sowwy",
            "[Obedience/ Offense](https://preview.redd.it/fsh5hrdk1d9d1.jpg?width=640&crop=smart&auto=webp&s=d53fc31d945b2a827624f5813753d335ca55ea9e)\n\nhttps://preview.redd.it/z58t3k2w9e9d1.jpeg?width=1440&format=pjpg&auto=webp&s=639e70a23bb29fa84447ffd0f45ab0e6747a7f0d",
            "truly incredible",
            "This is like when Quarterbacks started using the forward pass. Game is completely going to change and I predict fucking anarchy.",
            "Rules hurting juice",
            "https://preview.redd.it/aziv1wssdd9d1.jpeg?width=626&format=pjpg&auto=webp&s=150447d410b96d83c2787c68ed0503abf7ad7763"
        ]
    },
    "Double standards.": {
        "title": "Double standards.",
        "score": 10107,
        "url": "https://i.redd.it/0b6jd58bnb9d1.jpeg",
        "content": "",
        "num_comments": 1658,
        "comments": [
            "Ow my bones hurt\nThis really is a... Juice of the bone hurt!\nDiscord Server : https://discord.gg/tcCs7GWrUz\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bonehurtingjuice) if you have any questions or concerns.*",
            "This new comic is already blocked.",
            "The real reason Pizzacake made the comic is just so BHJ would post something other than the Shrek comic",
            "https://preview.redd.it/5czzselxwb9d1.jpeg?width=195&format=pjpg&auto=webp&s=727d3349059bb83f30c2b2b85f6d7c613692d1c5",
            "HOLY SHIT IS THAT GRIAN!!!??!1",
            "Can I ask something? what's this subreddit opinion on pizzacake?",
            "This hits hard in all the wrong places. Ouch!",
            "Locked post. New comments cannot be posted.",
            "Feels bad eh, he haha 😔",
            "Today and yesterday could not illustrate better just how hopeless the discourse around men's mental health is. Like this is your self-appointment proponent, fellas. Someone who frames your own experiences as a quirky hypothetical that men should use to reflect on how they treat women and them shovels out this hollow tripe as damage control."
        ]
    },
    "Please stop beating this dead horse": {
        "title": "Please stop beating this dead horse",
        "score": 240,
        "url": "https://i.redd.it/be1rgqjwyf9d1.jpeg",
        "content": "",
        "num_comments": 25,
        "comments": [
            "Ow my bones hurt\nThis really is a... Juice of the bone hurt!\nDiscord Server : https://discord.gg/tcCs7GWrUz\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/bonehurtingjuice) if you have any questions or concerns.*",
            "Absolutely not, go fuck yourself.",
            "https://preview.redd.it/fs24lmv3mg9d1.png?width=976&format=png&auto=webp&s=7800419d43c5033f2af1d441191b1bbbb81b1d9f\n\nThat joke and eh? Ha! heh heh will always be some of the funniest content from this sub and the ways people can create a new joke out of it.\n\n**So absolutely not, go fuck yourself**",
            "Have they started to piss you “off,” eh? Ha! Heh heh",
            "https://preview.redd.it/b96r9dqomg9d1.jpeg?width=640&format=pjpg&auto=webp&s=59776f9ba7d90c57e87c271415773d5cce4f8311",
            "https://preview.redd.it/84m3fcpq3g9d1.png?width=411&format=pjpg&auto=webp&s=c054ec26da036c73c2c7f49aaaf5a6282fd26e01",
            "Look at his MFer. He thinks he can turn us “off”? Eh? Ha! Heh heh.",
            "Absolutely not, go fuck yourself.",
            "is that gojo",
            "https://preview.redd.it/3xdoddu4wg9d1.jpeg?width=388&format=pjpg&auto=webp&s=eb611c998fadcd96acb76ebf57e0dec89b7d8fb4"
        ]
    }
}