{
    "What Books did You Start or Finish Reading this Week?: June 10, 2024": {
        "title": "What Books did You Start or Finish Reading this Week?: June 10, 2024",
        "score": 89,
        "url": "https://www.reddit.com/r/books/comments/1dchux6/what_books_did_you_start_or_finish_reading_this/",
        "content": "Hi everyone!\n\nWhat are you reading? What have you recently finished reading? What do you think of it? We want to know!\n\nWe're displaying the books found in this thread in the book strip at the top of the page. If you want the books you're reading included, use the formatting below.\n\n**Formatting your book info**\n\nPost your book info in this format:\n\n**the title, by the author** \n\nFor example:\n\n**The Bogus Title, by Stephen King**\n\n* This formatting is voluntary but will help us include your selections in the book strip banner.\n\n* Entering your book data in this format will make it easy to collect the data, and the bold text will make the books titles stand out and might be a little easier to read.\n\n* Enter as many books per post as you like but only the parent comments will be included. Replies to parent comments will be ignored for data collection.\n\n* To help prevent errors in data collection, please double check your spelling of the title and author.\n\n**NEW**: Would you like to ask the author you are reading (or just finished reading) a question? Type **!invite** in your comment and we will reach out to them to request they join us for a community Ask Me Anything event!\n\n-Your Friendly /r/books Moderator Team",
        "num_comments": 653,
        "comments": [
            "I just finished **This is How You Lose the Time War** by Amal El-Mohtar and Max Gladstone, it was pleasant and very fun to read.",
            "Just finished Golden Son, by Pierce Brown. The second book in the Red Rising series. It was so freaking good! 5/5",
            "i finshed the Lord of the Rings again.  \n  i started Agatha Christie's Hallowe'en Party. Bought it a few months after Haunting in Venice came out.",
            "Finished: Project Hail Mary by Andy Weir. So good! One of my favorites of the year. \n\n\nStarted: Gideon the Ninth by Tamsyn Muir",
            "Started:\nDark Matter by Blake Crouch (read 50 pages in an hour so far so good!! very captivating)\n\nFinished:\nBig Swiss by Jen Beagin (i did not like this at all it was so boring it took me 2 months to finish which is LONG for me. The way the main character talked was just so unnatural…it kind of reminded me of fleabag but like…not good. I honestly felt like nothing happened even though there was clearly a plot…anyway i was disappointed bc everyone loves this book and it’s getting turned into a show)",
            "Annihilation, by Jeff Vandermeer",
            "I finished \"Emily Wilde's encyclopedia of faeries\" and \"Emily Wilde's map of the Otherlands\" now I have to wait for the next book to come out 😭 And nownim currently re-reading agggtm<3 (and annotating it this time round)\n\nEdit: I only made a Reddit acc today so I'm super sorry that I can't format it the way you want, im not sure how to do bold text",
            "Started: **I Am Not Your Perfect Mexican Daughter by Erika Sánchez**",
            "finished rereading - Kafka on the Shore by Haruki Murakami",
            "Finished reading Crime and Punishment, by Fyodor Dostoevsky and started reading Ulysses, by James Joyce. I'm 15 and have really been enjoying literature this past year, so I was glad to find this reddit community."
        ]
    },
    "Weekly Recommendation Thread: June 21, 2024": {
        "title": "Weekly Recommendation Thread: June 21, 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/books/comments/1dl0bsv/weekly_recommendation_thread_june_21_2024/",
        "content": "Welcome to our weekly recommendation thread!  A few years ago now the mod team decided to condense the many \"suggest some books\" threads into one big mega-thread, in order to consolidate the subreddit and diversify the front page a little.  Since then, we have removed suggestion threads and directed their posters to this thread instead.  This tradition continues, so let's jump right in!\n\n**The Rules**\n\n* Every comment in reply to this self-post must be a request for suggestions.\n\n* All suggestions made in this thread must be direct replies to other people's requests. Do not post suggestions in reply to this self-post.\n\n* All unrelated comments will be deleted in the interest of cleanliness.\n\n____\n\n**How to get the best recommendations**\n\nThe most successful recommendation requests include a description of the kind of book being sought.  This might be a particular kind of protagonist, setting, plot, atmosphere, theme, or subject matter.  You may be looking for something similar to another book (or film, TV show, game, etc), and examples are great!  Just be sure to explain *what* you liked about them too.  Other helpful things to think about are genre, length and reading level.\n\n____\n\nAll Weekly Recommendation Threads are linked below the header throughout the week to guarantee that this thread remains active day-to-day.  For those bursting with books that you are hungry to suggest, we've set the suggested sort to new; you may need to set this manually if your app or settings ignores suggested sort.\n\nIf this thread has not slaked your desire for tasty book suggestions, we propose that you head on over to the aptly named subreddit /r/suggestmeabook.\n               \n- The Management",
        "num_comments": 24,
        "comments": [
            "Suggest me a  horror book about a small town surrounded by cryptids! :)",
            "Hello!! I’m planning a trip around Europe and will be spending a lot of time commuting via trains so will need couple of books to keep me company. \nFew of my fav books to give you an idea: the running grave, dark matter, Piranesi, ready player one. Thank you!!!",
            "looking for a Battle Royale book with multiple POVs, single POV makes it obvious who will win. And also, looking for a batfle royale book without a rebellion story.\n\nI already read these battle royale books:\nRed Rising, Hunger Games. \n\nI have the book \"Battle Royale\" on my TBR",
            "Has anyone got any suggestions for fantasy books with more whimsical settings, but geared towards more mature audiences? Basically I want fantasy stories that aren't YA, but also aren't depressing allegories about the horrors of war or bigotry or class structures, or whatever else.\n\nBy whimsical fantasy, I mean the sort of worlds you see in;\n\n* Alice in Wonderland\n* Un Lun Dun\n* Neverwhere\n* Chitty Chitty Bang Bang\n* Spirited Away\n* The world of Super Mario\n* Labyrinth\n* Legend of Zelda\n* Final Fantasy 7/8/9/10",
            "Looking for the \"talking animals\" trope (like Watership Down, Animal Farm, etc). But also not with Earth animals, looking for a fully fantasy biosphere (Like in Avatar (the blue guy), on Roshar, etc)",
            "I’m looking for a ✨romantasy✨ book with no spice but like high tension, banter, and chemistry. One that has you kicking your feet over small interactions like a hand touch. Two example that I can think of is Powerless 🗡️by Lauren Roberts and Legendborn 🪄by Tracy Deon .",
            "I recently finished reading 'the man who mistook his wife for a hat' by Oliver Sacks. I really liked the style of doing a lot of relatively short essays/case studies on various interesting patients, though the language feels antiquated (which I can get over but isn't ideal). \n\nDisorders of the brain are interesting, but my fascination lies in neuropsychopharmacology and how drugs interact with the brain. \n\nI don't suppose anyone here happens to know of a similar styled book (preferably newer) but which focuses on disorders (temporary or permanent) arising from use (or misuse) of psychoactive substances?",
            "hey can someone suggest me smth to read my fav books are the summer i turned pretty series by jenny han and solitaire+radio silence by allice oseman",
            "Looking for something that plays with multiple narratives and unreliable narrators, like House of Leaves or especially Cloud Atlas.\n\nAlternatively, historical fiction about the mob in the vein of Fargo (movie and show) with a similar tone, for a change of pace.",
            "Maybe The Starless Sea by Erin Morgenstern? I haven’t read Piranesi, but it came up when I was looking for similar books."
        ]
    },
    "How did Ireland become kind of “literary hub” of the world? ": {
        "title": "How did Ireland become kind of “literary hub” of the world? ",
        "score": 271,
        "url": "https://www.reddit.com/r/books/comments/1dlfrwk/how_did_ireland_become_kind_of_literary_hub_of/",
        "content": "How did Ireland become a “literary hub” of the world? \n\nCountry gained independence in 1921, has a population of 5 million and is almost a pinnacle of literary excellence.\n\nSo many authors, poets and playwrights have Irish origins or roots. I can completely understand the influence that UK has over English Literature but Ireland is a relatively small country. \n\n",
        "num_comments": 220,
        "comments": [
            "Because we come from suffering and drink.",
            "Ireland was on the fringes of Europe during the \"dark ages\". This insulated them somewhat from a lot of the political and social turmoil of that period, as a bit of a backwater. As a result, there were a lot of literaturr and learning retained in Ireland, more so than elsewhere. Coming out of that period, they had a much higher literacy rate, and a whole network of interconnected centers of learning and document preservation (monasteries and such). There's an interesting book on this topic called ***How The Irish Saved Civilization*** (full title: *How the Irish Saved Civilization: The Untold Story of Ireland's Heroic Role from the Fall of Rome to the Rise of Medieval Europe).* During the early middle ages \"Irish\" was nearly synonymous with scholar in much of Europe. These were the guys who could read, and actually had read most of the great works of ancient literature (since in many cases the only surviving copies were in Ireland), they knew poetry and myths from all over, etc.\n\nCombined with a long cultural tradition of story telling and history reciting (bards were highly honored and had a role in the Brehon legal system of Gaelic Ireland... hell, one of the national symbols of Ireland is a bardic harp) you end up with a culture with a lot of literate people who grew up hearing amazing ancient tales that entertained and taught life lessons and dictated morals, etc etc. Add in a few dozen generations of oppression and alcoholism, and you've got the perfect recipe for a great literary tradition. Top it all with a horrific famine that killed over 1/8 of the population, and sent another 3/8 of the population all around the world in a famine-fleeing diaspora, and we **all** get to enjoy their literary talents. (Crazy note... the famine reduced the populaiton of Ireland by nearly HALF, and it has only almost *nearly* recovered to its pre-famine population TODAY, in the 21st century, nearly 200 years later)",
            "Storytelling and poetry have always been a huge part of Irish culture, so much so that in ancient Ireland the societal status of poets was almost on a par with royalty. \n\nIn more recent times, the country invests in its writers. We have organisations like the Arts Council, the Irish Writers Centre, Poetry Ireland etc that provide bursaries and other funding and training. There’s quite a few presses of varying sizes and specialties. Many literary festivals. Lots of journals and magazines. Irish people like reading and they like reading work by Irish writers.",
            "Celtic tradition of storytelling plus booze plus suffering.",
            "We're great at talking shite tbh",
            "Honestly, I don’t think it is. It’s just “not England/America” so whenever you hear about a popular or talented Irish writer it stands out more to you. There are like a dozen or two canonical Irish writers I can name off the top of my head, but there are also probably hundreds of English and American writers just as highly regarded.",
            "So leaving aside some of the more nebulous things like history of storytelling (other cultures also had this), gift of the gab (we can talk a lot) and the i flu fence of the Irish language.  They matter but it is is difficult to quantify why.  \n\nGood education with really literacy rates, there was even a culture of valuing education by large parts of the country, this has been going for decades. \n\nLarge amounts of Irish emigrating and retaining cultural connections played a part.  Writers need readers so having access to markets to sell their work to helped.  \n\nSpeaking English also helped in my opinion in recent times, it gave all writers a direct market in the US, UK and elsewhere, with most the direct need for translation.  Lots might disagree with that opinion.  \n\nThere was some moves by Irish governments to promote the value of artist work.  One government made income from artistic work tax free up to a certain amount (but it was so difficult to do, it needed to claimed back and a bureaucratic nightmare). Token gesture but it was still something.",
            "They write how they speak - lyrical yet grounded. Great prose from that rowdy island of theirs.",
            "It's not. It has a pretty normal amount of famous writing and authors, especially considering it has certain connections and privileges such as most of its work being in the English language and historical connections and interest from big publishers in Britain and the USA.\n\nIreland is hardly the only country to endure suffering and produce literature from it, please give over in some of these comments.",
            "Anglophone world at least."
        ]
    },
    "Do you have any comfort reads that you go to after having a tough day?": {
        "title": "Do you have any comfort reads that you go to after having a tough day?",
        "score": 36,
        "url": "https://www.reddit.com/r/books/comments/1dlpcy2/do_you_have_any_comfort_reads_that_you_go_to/",
        "content": "I'm not necessarily talking about books that will make *anybody* comfortable and feel all warm and happy inside. Could be any type of books. I'm not passing any judgment, and I have a friend who loves watching graphic horror movies at the end of a stressful day, so I know different strokes for different folks.\n\nFor me personally it's childhood books and I have a soft spot for them and they remind me of good times, perhaps times that things were less complicated and more predictable. \n\nI'd be interested to hear about your favorites.\n\n",
        "num_comments": 50,
        "comments": [
            "Pride & Prejudice / Jane Austen is my comfort read! (And watch.)",
            "I’ve read “where the sidewalk ends” probably 100 times because it reminds me of home",
            "Harry Potter is my ultimate comfort read, for the same reasons you mentioned of it having a sentimental value/reminding me of childhood and happy times.",
            "The lord of the rings",
            "jane eyre by charlotte bronte is beautiful and makes u feel a little less alone",
            "In terms of comfort reads, I have to say Calvin & Hobbes, as well as the Redwall Saga. Nostalgia is a strong pull. 🤣",
            "Braiding Sweetgrass (especially the audiobook read by the author Robin Wall Kimmerer). Never fails to fill me with peace and wonder.",
            "Watership Down. Takes me away to that place. Very comforting.",
            "Persuasion/Pride and Prejudice\n\nAnything by Terry Pratchett\n\nA little Princess",
            "Howl's Moving Castle and Good Omens."
        ]
    },
    "'All Quiet on the Western Front' has one of the most romantic (non-romantic) passages I've ever read": {
        "title": "'All Quiet on the Western Front' has one of the most romantic (non-romantic) passages I've ever read",
        "score": 568,
        "url": "https://www.reddit.com/r/books/comments/1dl6o6i/all_quiet_on_the_western_front_has_one_of_the/",
        "content": "I know it's not meant to be romantic, but Stanislaus Katczinsky (Kat) and Paul Bäumer's relationship felt so great and there's a particular scene that left me breathless. There's no actual spoilers, so I won't put a spoiler tag:\n\n>We sit opposite one another, Kat and I, two soldiers in shabby coats, cooking a goose in the middle of the night. We don't talk much, but I believe we have a more complete communion with one another than even lovers have.\n\n>We are two men, two minute sparks of life; outside is the night and the circle of death. We sit on the edge of it crouching in danger, the grease drips from our hands, in our hearts we are close to one another, and the hour is like the room: flecked over with the lights and shadows of our feelings cast by a quiet fire. What does he know of me or I of him? formerly we should not have had a single thought in common--now we sit with a goose between us and feel in unison, are so intimate that we do not even speak.\n\nAnd further, in the same scene:\n\n>In a half sleep I watch Kat dip and raise the ladle. I love him, his shoulders, his angular, stooping figure-and at the same time I see behind him woods and stars, and a clear voice utters words that bring me peace, to me, a soldier in big boots, belt, and knapsack, taking the road that lies before him under the high heaven, quickly forgetting and seldom sorrowful, for ever pressing on under the wide night sky.\n\nAnd my favorite paragraph:\n\n>Is my face wet, and where am I? Kat stands before me, his gigantic, stooping shadow falls upon me, like home. He speaks gently, he smiles and goes back to the fire.\n\n>Then he says: \"It's done.\"\n\nI'm sorry, but I know it's meant to say how intimate bond appears between brothers in arms, especially in a place as hopeless as the front, and Paul does say later that he feels more at home in the front than where his parents are. But if \"his gigantic, stooping shadow falls upon me, like home,\" isn't the most romantic thing I'd ever read, I don't know what is. The way the novel is structured makes Kat the most important figure next to Paul, and if you look at it from a queer context, it's even much more powerful.\n\nI'm probably reaching, and I wouldn't at all be surprised if the author didn't intend for there to be any subtext at all, but it's just another aspect from the novel that left me breathless, whether romantic or not.\n\nEdit: I didn't mean it meant 'less' if it was comradery and friendship, I meant it meant more powerful to me, specifically. Either way, it's still such a highly romantic and lyrical prose. An amazing read. ",
        "num_comments": 151,
        "comments": [
            "This book is one of my favorites. Read last year, and it was a wonderful read.",
            "I don't think you are reaching, to see it in a queer context.  But I do think you are looking at it with the eyes of a 21st century person.   \n\n(emotional) Intimacy amongst men is something that we should not brand as \"queer\", in my opinion.  That contributes to the homophobic elements of toxic masculinity.  That a man who *loves* another man is automatically suspect.   Instead we should praise male friendships as healthy and normal.  Because they are--or at least they should be.  \n\nNow if after cooking the goose they stripped down and had a shag by the fireside, then we'd have something to talk about.   \n\nBut it, like you said, to me just shows the bond of men who have gone through the most terrible and harrowing things imaginable together.  The trauma bond so common among soldiers.",
            "Why does it mean \"more\" in a queer context? Why can't intimacy between two men not be beautiful without them being sexually attracted to each other? I'm not even against queer readings of most books, but this is a beautiful example of heterosexual intimacy and I think making it queer actually makes it lose value.",
            "I really love this book. Read it for the first time when I was 13 or 14 and then again when I was 18. Read it now once every year and I’m turning 29 this year.\n\n“They are more to me than life, these voices, they are more than motherliness and more than fear; they are the strongest, most comforting thing there is anywhere: they are the voices of my comrades.”",
            "I've never seen any of the movies based on the book but I read it in highschool. I always thought the chapter or two about them being naked in the river to try and meet some women and have some bread and cold cuts was funny when you realize they are at most 20 years old.\n\nEdit: they are kids fighting in trenches.",
            "I feel bad for everyone who can't read the original. I can't really put it in words but this book has some of the most beautiful, innocent prose, even though German is usually a rather clunky language. The translation does not do it justice, unfortunately.  \n\n\nYou can really feel how vulnerable (and happy) he is in this moment. His love is unspoken. It is a silent confession of a man who has lost himself, who is nothing but a soldier. Just for one moment he is allowed to be a man with emotions.  \n\n\n\"A little soldier and a clear voice, and if anyone were to caress him he would hardly understand, this soldier with the big boots and the shut heart, who marches because he is wearing big boots, and has forgotten all else but marching.\"\n\n\nThis is not meant to be queer at all, obviously. This goes beyond attraction. He loves him for who he is, in this moment, for what he represents. This is love between soldiers, not gay lovers. People have been trying to twist this special relationship between men ever since the Epic of Gilgamesh.",
            "I get no sort of queer romance undertones from the passages, although I suppose I can see where you're coming from, I feel going that far is a stretch. I think Remarque is certainly showing the closer than brother bond that forms between people on the front lines and in dire situations like that though and it is indeed some of the most beautiful and impactful writing in literature. It's one of my very favorite books and you've certainly selected some really great passages.",
            "Do you think the book is worth the read if I’ve already seen the movie? I thought the movie was one of the greatest movies ever made.",
            "A similar thing happens in sports, especially when a team experiences success. My son just graduated high school and he and the one teammate that had played with him since they were 12 hugged and cried a little and then just sat next to each other in silence for quite some time after their last game. It's just shared struggles and experiences that create lifelong bonds. That's it.",
            "I’ve had an old copy of that book for a decade, and I still haven’t opened it to read it. That passage is so beautiful, I think it might be time to read it this year."
        ]
    }
}