{
    "Boruto: Two Blue Vortex Chapter 11 - Links and Discussion": {
        "title": "Boruto: Two Blue Vortex Chapter 11 - Links and Discussion",
        "score": 230,
        "url": "https://www.reddit.com/r/Boruto/comments/1dkjat0/boruto_two_blue_vortex_chapter_11_links_and/",
        "content": "Chapter 11\n\n|Official Site|Status|\n|:-|:-|\n|VIZ|[Online](https://www.viz.com/shonenjump/chapters/boruto-two-blue-vortex)|\n|Manga Plus|[Online](https://mangaplus.shueisha.co.jp/titles/100269)|\n\nPrevious discussion: [10](https://www.reddit.com/r/Boruto/comments/1cwhn7p/boruto_two_blue_vortex_chapter_10_links_and/) | Previous chapter score: [7.21](https://strawpoll.ai/poll/results/ZuRtZMHkK8Hx)\n\n---\n\nRate this chapter [**here**](https://strawpoll.ai/poll/vote/tv81EheCGcPz)!\n\n---\n\nPlease keep all discussion in this thread for at least 24 hours. Comments with requests/links to illegal sites will be removed. Use the official sites above!\n\n---\n\nWant to be notified when a new chapter or episode is released? [Join our Discord server](https://discordapp.com/invite/JQF4rdh)!",
        "num_comments": 312,
        "comments": [
            "i haven't forgotten. i love pancakes...",
            "Himawari did pretty good in her first real fight",
            "Himawari + Kurama is so lit. She really pulled out the Spiderman responsibility quote and then proceeded to punch the absolute shit out of Jura. Really hope her character continues to become a focus.\n\nBiggest concern right now is that Boruto is seemingly the only character in Konoha capable of not getting low diffed by the villains. Seems like there's gonna have to be some additional power-ups for the other characters, or else it's pretty much just gonna be Boruto vs. everybody from here on out.",
            "Jura saying he wont forget Shikadais name has an eerie resemblance to enemies saying that to Shikamaru when he was younger.",
            "Nishi continuing to be included in the action despite being the most useless Jonin imaginable always cracks me up. He took one look at Hidari and shit his pants.\n\nAlso Hidari nonchalantly sticking his hand in his pocket to chidori Sarada from behind was cold af. He may not know who Sasuke is but he's still got the same aura.",
            "Time to flying raijin straight to the ihop",
            "I know it's useless, but I think we can already say Hima is Kage level with one real fight in her entire ninja career lmao",
            "Bro I got so hyped at the \"spiderman\" moment. Himawari basically saying \"with great power comes great responsibility\" at that moment. Plus it's also her showing her will of fucking fire! Can't wait for next few chapter where I'm wondering if Hima will finally learn the truth from her real brother, and they form a 3-man team with Boruto, Sarada, and Hima, and Sumire being the insider in the village.",
            "The size of that beast bomb explosion was insane",
            "In this world there are kids younger than you yet stronger than me - Kakashi to Naruto\n\nHimawari is officially the strongest Kunoichi in the franchise!"
        ]
    },
    "Kishimoto should take a look at this…": {
        "title": "Kishimoto should take a look at this…",
        "score": 120,
        "url": "https://i.redd.it/g8pzzg5q6g9d1.jpeg",
        "content": "This fan art is impeccable.\n\nI don’t know who made the fan art, but the instagram account is @shibaikage",
        "num_comments": 30,
        "comments": [
            "He has a belt, so I'm sure Ikemoto would at least approve of the design . That fan-artist is really good!",
            "Are you sure about its fanmade?",
            "If Kishimoto ever blesses Boruto with this level of majestic hair I think Id be fulfilled, the manga would have reached its peak",
            "This is honestly how I imagined teen Borushiki in my head with a more developed horn.",
            "Boruto is so op, he even reached goku ssj 5 Level",
            "That's Ichigo who Bleached his hair White.",
            "Love it he looks like true demigod and reminds me of jiraya ",
            "Giving me Inuyasha/Sesshomaru vibes. I like it.",
            "That's awesome, such a good capture of Ikemoto's art style too.",
            "Reminds of me kurama he when he transformed in the dark tournament in YuYu Hakusho"
        ]
    },
    "Why is nobody talking about Urashiki's Time Revert Jutsu? It's really broken ": {
        "title": "Why is nobody talking about Urashiki's Time Revert Jutsu? It's really broken ",
        "score": 43,
        "url": "https://i.redd.it/ohqm6qj1lh9d1.jpeg",
        "content": "",
        "num_comments": 36,
        "comments": [
            "Bro got beaten by MS Sasuke, base Jiraiya and kid Naruto and Boruto\n\nWhile being a broken otsutsuki  now that is shit IQ",
            "Because his existence is a joke. He has arguably the best hax in the whole verse and he gets folded by Kid Naruto and Jiraya of all people. He was the original fraudster before Code and Kawaki",
            "Cuz people forgot about that bum.I didn't even remember him till I saw this pic",
            "Urashiki had some insane potential/abilities & deserved better writing. Its a shame he was thrown in the filler garbage bin.",
            "Not only did he have one of the most broken rinnegan abilities, but he had the coolest looking rinnegan too. It's such a shame that he sucks.",
            "Because he stole it from Madara",
            "His abilities are so busted where I honestly can't believe he lost. I genuinely pretend that he doesn't exist.",
            "Hes not even canon so dont care. This is the guy that ate himself for a power up",
            "Avoided this arc completely when I was still watching the Boruto anime cause I knew it was gonna be some bullshit.",
            "only thing i liked was him hooking other people aura outta nowhere."
        ]
    },
    "LOOK WHAT I GOT :D": {
        "title": "LOOK WHAT I GOT :D",
        "score": 12,
        "url": "https://i.redd.it/jhzdle47ai9d1.jpeg",
        "content": "I got it from Game, I know it's pretty low quality but I LOVE HIM\n(I also didn't know how to fair this lol)",
        "num_comments": 3,
        "comments": [
            "Nah i think its very good quality",
            "As a reminder, this flair is for **anime discussions**. Use spoiler tags when discussing events that have taken place beyond the anime. If you see any comments with untagged manga spoilers, please report them. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Boruto) if you have any questions or concerns.*",
            "Adorable"
        ]
    },
    "How would you feel if...": {
        "title": "How would you feel if...",
        "score": 46,
        "url": "https://i.redd.it/e3hmblaczf9d1.jpeg",
        "content": "Boruto takes Hima and Sarada with him to his hideout? \n\nI personally saw a lot of backlash for Boruto \"saving them and stealing their spotlight\" but I honestly believe that there is no safer place than next to Boruto right now.\n\nLet's not forget that he is one of a very few characters who can fly and teleport them to almost everywhere. \n\nI also feel like it is a great opportunity for Boruto and Hima to bond for the very first time in three years and MAYBE him and KK can help out the girls in terms of training. \n\nWhat do you think?",
        "num_comments": 32,
        "comments": [
            "What jura and hidar will do then drink coffee with konohamaru and talk about art?",
            "so u think that boruto, the only person who can do anything, is gonna leave those 10 tails mfs to terrorize the village to have some play time with sarada and himawari who thinks he killed her dad?",
            "I think it's plausible, but Boruto seems to be in a mindset of, 'I must do this alone,' kind of like where Sasuke was in Shippuden before killing>! Orochimaru.!< I feel like there's going to be a boundary for Boruto to overcome before he even considers taking Sarada and Hima with him. >!Just like how Sasuke formed Hebi/Taka after Orochimaru's death.!<\n\nOf course there's room for something else to happen though!",
            "Doubt it. Neither of them can mask their chakra (Himawari even more so with Kurama so she cant hide from Jura) so if anything theyd be a beacon for Borutos general location",
            "I assume he will transport them to Konoha where theres more ninja to protect or heal them.",
            "Would be cool. The story is in a \"anything can happen\" state rn.",
            "Not sure were borutos hideout is, jura could track hima like he did in konoha, could expose the hideout",
            "where can i read this",
            "It might be cool in theory, but it would probably cause more problems for Boruto. If he takes Sarada and Himawari with him, it puts all of the attention on him. Konoha would throw a fit at the hokage killer kidnapping the hokage's daughter. Kawaki would probably be relentless and use Eida to reveal his location which would expose his hideout. Jura can sense Kurama so he would also follow Boruto to his hideout. Boruto likes moving in the shadows and this move takes everything away from that. \n\nRealistically he's better off giving them markers so that he can appear whenever they're in trouble.",
            "I feel like he's been on the rise the last chapters and he hasn't taken a L yet...I feel like we've seen every opp cept momoshiki and we've seen him still tense up when karma pops out. I feel like momoshiki is the next angle but I also feel this ten tail business will have boruto n momo meetin in the middle like cyclops n ryu."
        ]
    }
}