{
    "We are WBUR and The Emancipator. AMA on our recent busing series": {
        "title": "We are WBUR and The Emancipator. AMA on our recent busing series",
        "score": 23,
        "url": "https://www.reddit.com/r/boston/comments/1dpq6aj/we_are_wbur_and_the_emancipator_ama_on_our_recent/",
        "content": "Hey r/boston, u/meghankellywbur here with an AMA from WBUR and [The Emancipator](https://theemancipator.org/). Last week, we ran a joint series on the history of busing in Boston schools, marking 50 years since a federal judge ordered BPS to desegregate. \n\nIf you're not familiar with what happened with busing, the brief history is that the judge's decision meant that BPS students were bused all over the city to different neighborhoods than the ones they lived in in an effort to more evenly distribute racial diversity across the district. White Bostonians responded with violent riots.\n\nYou can catch up on the series at [The Emancipator's website](https://theemancipator.org/busing/) and at [WBUR's website](https://www.wbur.org/tag/50-years-busing-boston). There is a ton to explore, from first-person essays to how things stand today in BPS. \n\nWhat questions do you have for us? What would you like to know about the history of busing in BPS? We eagerly await your questions and hope to have an interesting and fruitful discussion.\n\nThe AMA starts tomorrow, Friday, June 28, at 11 a.m. Feel free to submit questions now, or when we log on tomorrow at 11. Talk to you then! ",
        "num_comments": 31,
        "comments": [
            "Do you think school choice is still important in Boston, to ensure families don’t feel “trapped”?  School choice within BPS, plus charters and METCO…",
            "What’s it like being in the media with the name Meghan Kelly?",
            "are wbur and wgbh friends?",
            "Question, is it true that the first thing that happened when the white kids were bused to the black schools was that the broken windows got fixed and the textbooks appeared? I have heard that story many times.",
            "What did you find were the most important developments in METCO in the last 15 years? What was the top problem identified and addressed and the top problem identified but not addressed since 2009?",
            "Hi, we're here with Carrie Jung, senior education reporter from WBUR, Suevon Lee, assistant managing editor of education at WBUR and Jamil Smith, editor-in-chief of The Emancipator.\n\nWe'll start answering some of the questions that have already come in but please feel free to ask more!",
            "The BTU has been pushing “hub schools”. Are hub schools effectively neighborhood schools? Is it possible to desegregate and have hub schools? Or is it less about desegregation and more about making our schools comparable in terms of quality, programming, funding, etc.?",
            "Who were the major players in the anti-busing effort in Boston? Who organized what would eventually become said violent riots? Did they face any consequences?",
            "With the push for district-wide inclusion and hub schools, do you think the city is looking/hoping to save money on school transportation costs?",
            "Guys, this is a post about an AMA tomorrow"
        ]
    },
    "Boston Daily Discussion Thread, Saturday June 29": {
        "title": "Boston Daily Discussion Thread, Saturday June 29",
        "score": 1,
        "url": "https://www.reddit.com/r/boston/comments/1dr66f2/boston_daily_discussion_thread_saturday_june_29/",
        "content": "Hey r/Boston\n\nThis thread is for chatting about what is going on in Boston today. This includes the news about today's commute, what is going on around Boston, commonly asked questions, as well as a general free chat throughout the day.\n\nExample topics include:\n\n* Regularly asked questions\n* Best places to go for a hike/walk in or around Boston\n* Updates on the COVID-19 situation in Boston/other local towns\n* Best places to go out to eat or drink\n* Things going on in and around Boston\n* General questions that you feel do not require an entire thread\n* Music you have been listening to lately, or shows you have started watching\n* Skyline or sunset pictures\n\nHere are some useful links as well:\n\n1. [The weather](https://darksky.net/forecast/42.3555,-71.0486/us12/en)\n2. [MBTA alerts and delays](https://www.mbta.com/alerts/subway?alerts_timeframe=current)\n3. [Official COVID-19 Information](https://www.mass.gov/resource/information-on-the-outbreak-of-coronavirus-disease-2019-covid-19)\n\nPlease be civil and keep things SFW.\n\nSelf promotion of Boston related events, activities, and news is allowed so long as the event is happening within the next 5 days and not a regularly occurring event.\n\nIf there is something you'd like to see here please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FBoston) and let us know.",
        "num_comments": 2,
        "comments": [
            "### Boston Status Update ###\n\nLast Update: 2024-06-29 09:32:39 EST\n\n________________\n\n### Daily Weather Forecast for Today in Boston ###\n\nCurrent Temperature is **64.9°F** but it feels like **64.9°F**\n\nThe next hour will be **71.9°F** and **Partly Cloudy **\n\n**Daily Forecast**\n\n* Max Temperature: 79.8°F\n\n* Min Temperature: 56.9°F\n\n* Avg Temperature: 68.7°F\n\n* Condition: Partly Cloudy \n\n* Chance of Rain: 0%\n\n* Sunrise Time: 05:11 AM\n\n* Sunset Time: 08:25 PM\n\n\n\n________________\n\n# Current delays on the MBTA:\n\n**Orange Line shuttle** - Through Monday\n\nCause: Orange Line: Shuttle buses are replacing service between Wellington and North Station through Sunday, June 30, for bridge and track improvements.  \n\n**Red Line shuttle** - Through Monday\n\nCause: Red Line: Shuttle Buses are replacing service between Alewife and Harvard the weekend of June 29 - 30 for track work. Commuter Rail service will be free to ride between Porter and North Station. Bus Route 77 will be fare-free.\n\n**Red Line notice** - Starting Friday\n\nCause: The outbound platform at Kendall/MIT station will be closed the weekend of July 6 - 7, beginning at 9:00 PM on Friday, July 5.\n\n**Red Line shuttle** - July 13-29\n\nCause: Red Line: Shuttle buses replace service between Alewife and Kendall from July 13-28. On weeknights from 8:30 PM to end of service, and all day on weekends, shuttles will extend to Park Street. Riders can use Commuter Rail at Porter.\n\n**Green Line shuttle** - July 13-15\n\nCause: Green Line: Shuttle Buses replace Green Line service between North Station and Medford/Tufts, the weekend of July 13-14, due to track work. Union Square riders can use Bus routes 86, 87, or 91 to connect to shuttles or the Orange line.\n\n**Kendall/MIT (Alewife) closed** - Through Monday\n\nCause: The Alewife platform at Kendall/MIT station is being bypassed through the end of service Sunday, June 30, for construction.\n\n\n\n________________\n\n This comment was made by a bot. If the bot is broken please [message the mods](https://www.reddit.com/message/compose/?to=/r/boston) ."
        ]
    },
    "Boston sees murder rate plummet by incredible 78% to just four homicides this year": {
        "title": "Boston sees murder rate plummet by incredible 78% to just four homicides this year",
        "score": 763,
        "url": "https://www.dailymail.co.uk/news/article-13576183/major-city-murder-rate-crime-decrease-Massachussetts.html?ito=social-reddit",
        "content": "",
        "num_comments": 218,
        "comments": [
            "Violent criminals just can't afford to live in this city anymore /s",
            "Whenever someone writes on Reddit that they're concerned about moving to Boston and crime, redditors are quick to tell them how ridiculous that is.   Maybe we finally convinced the criminals as well?",
            "I feel 100x safer in Boston than I do in just about any other city I visit or have lived in.",
            "Detroit is very similar in size to Boston. They had 250+ murders last year and that was the lowest number of murders there had been in the city since the 60s.",
            "We gotta pump those numbers up.  I'm on it!",
            "Boston's murder rate is so low that any change seems massive lol \n\n\"yeah but double 10 people is still just 20 people\"",
            ">'Boston is a place where 40 percent of violent crime happens on 4 percent of city streets, and where a very small number of people drive a significant part of the violence,' Isaac Yablo, the mayor's advisor for community safety, told the Times. \n\nTell it like it is Yablo.",
            "I’m moving from Baltimore to Boston in August. Definitely something to look forward to",
            "One more homicide and we will technically have a boston massacre (5 deaths).",
            "You folks have a really nice city there."
        ]
    },
    "An “Oopsie” from The Fat Greek in Arlington 😅": {
        "title": "An “Oopsie” from The Fat Greek in Arlington 😅",
        "score": 16,
        "url": "https://i.redd.it/5n953l3zfi9d1.jpeg",
        "content": "They must have sent a free $10 voucher email to every single person who has ever registered and ordered online ",
        "num_comments": 0,
        "comments": []
    },
    "Haitian migrant accused of raping teen girl in Boston freed on $500 bail": {
        "title": "Haitian migrant accused of raping teen girl in Boston freed on $500 bail",
        "score": 230,
        "url": "https://nypost.com/2024/06/28/us-news/haitian-migrant-accused-of-raping-teen-girl-in-boston-freed-on-500-bail/",
        "content": "",
        "num_comments": 218,
        "comments": [
            " What the hell is wrong with this judge?! I have seen people held after a dangerousness hearing for less charges than rape! He wouldn’t even hold the hearing?!",
            "From the article.\n\n>Alvarez, 26, was released with an ankle monitor, but ICE officials can’t track him because Boston is a sanctuary city — meaning local authorities don’t have to cooperate with the feds.",
            "Ask yourself.  If ANY person accused of doing what this guy allegedly did, to one of your family members, maybe your kid, would you be OK with them getting out of jail on $500 bail?",
            "Send this pos back for where he came. My tax dollars should not be paying for this maggot. I know people who are actually American citizens do the same but we're just letting more bad people in",
            "The article states the victim is disabled. That makes it a lot worse",
            "Great job whoever voted in the DA",
            "So he probably paid 50 bucks to rape a girl and will eventually get probation at worst? Good to see being culturally sensitive is more important than protecting children.",
            "\"Alvarez, 26, was released with an ankle monitor, but ICE officials can’t track him because Boston is a sanctuary city — meaning local authorities don’t have to cooperate with the feds.\"\n\nThe bail amount is definitely insignificant considering the severity of the alleged crime committed, but if he is forced to wear an ankle monitor, isn't he being tracked regardless of sanctuary city regulations?",
            "Honestly surprised they charged bail",
            "Sounds like they are leaving something out. I also don’t see this on ice.gov at this time. NY Post is shady."
        ]
    }
}