{
    "Daily Discussion Thread - June 29, 2024": {
        "title": "Daily Discussion Thread - June 29, 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/bostonceltics/comments/1dr3hym/daily_discussion_thread_june_29_2024/",
        "content": "Welcome to the daily discussion thread! You can use this space to discuss little things that don't need their own post. This is also the perfect space for pictures, videos, and links that would otherwise go against the sub's rules. Just don't be jerks and don't break any Reddit-wide rules. Have at it.",
        "num_comments": 24,
        "comments": [
            "Just 17 more days until we face the Lakers in the Summer League. Can’t wait to watch Bronny get postered",
            "We should try get in on the Nets fire sale😈",
            "Anyone know the going rate for a Sam Hauser? Probably more then Pritchard but thats really getting close to the full MLE.",
            "Now the draft is done, I’m looking forward to Free Agency. \n\nI think we could just do with signing a Vet Min Big Man.",
            "Does sports illustrated still do commemorative championship issues? I see they have a digital e-magazine, but I’d prefer the paper editio",
            "What they gon say now?!?!!",
            "I remembered the Lenny Cooke story.",
            "I don’t think we have the MLE since we’re a second apron team, but isn’t the taxpayer MLE only like $5M? He’s definitely going to get more than that",
            "Duncan Robinson makes 19.4m next year. \n\nSam Hauser will be making 25-30m per season if he’s ever a free agent. Teams like Detroit, desperate for shooting and +50m under the cap, must spend money to reach the salary floor (more punitive than the 2nd apron!).",
            "If we can retain Luke at less than 4M he is better than all the veteran min big men out there"
        ]
    },
    "Post championship nut clarity is in effect but I keep on coming back to the championship videos and it feels great": {
        "title": "Post championship nut clarity is in effect but I keep on coming back to the championship videos and it feels great",
        "score": 123,
        "url": "https://i.redd.it/3bhh8lq3hi9d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "It does, championships are nice",
            "My YouTube algo knows exactly what I want right now",
            "I haven’t reach post-but because I never stopped",
            "We went through so much hate and doubt during the season that I keep looking back and just enjoying the season. That January game vs the Wolves was amazing for example. Then we lay an egg vs the Bucks and the world is falling. Fun to watch in the rearview",
            "Personally I'm just happy that Latvia beat Lithuania to NBA Championship"
        ]
    },
    "In my completely unbiased opinion, we have the coolest logo and name in sports history.": {
        "title": "In my completely unbiased opinion, we have the coolest logo and name in sports history.",
        "score": 752,
        "url": "https://i.redd.it/75hq888y7f9d1.jpeg",
        "content": "",
        "num_comments": 189,
        "comments": [
            "As long as we keep the logo that way. Don't copy teams like the Jazz and Raptors which replaced their logos with minimalist crap",
            "It's a classic, that's why. The longer it exists, the whiteout change the cooler it gets without a doubt.",
            "I love the Celtics because it’s pronounced incorrectly lol",
            "lol my ex’s dad from Cleveland used to try to argue that the Celtics logo was just as bad at the Cleveland Indians. What a crock of shit that was.",
            "What’s his pipe loaded with?",
            "It’s one of if not the most iconic logos in sports history.",
            "Yes because the patriots replaced Pat as the main logo.",
            "I am not gonna lie I really like the Kraken from a Logo Color scheme perspective, but the Celtics are a close second. I root for the bruins as a team by the way I just think the logo and color scheme for the kraken are top tier.",
            "Agreed. Iconic and it stands out. A lot of foreign fans say it was one of the reasons for them taking a liking to the team. ",
            "I love my Celtics but I have to go with my football team as the best logo. The Raiders nobody is fucking with that logo."
        ]
    },
    "[Tabatabaie] I’m happy to report Jaylen Brown and 7uice ring have been reunited!": {
        "title": "[Tabatabaie] I’m happy to report Jaylen Brown and 7uice ring have been reunited!",
        "score": 546,
        "url": "https://x.com/ctabatabaie/status/1806876894534545428?s=46&t=BPOCzlMnie9QX3i9mnMaQw",
        "content": "",
        "num_comments": 32,
        "comments": [
            "JB gonna dap that person up and give them a signed jersey for sure!",
            "I cannot believe it was found. That's crazy",
            "Gonna make a 'Frodo, don't wear the Ring' PSA anyway.\n\nFor Science.",
            "Aww, man. That just made me smile ear to ear.",
            "speaking of 7uice , did he stop making clothes ? been looking at his site for new drops, and all they been had for the longest is leather jackets.",
            "I never doubted the city of Boston.",
            "Man if I got the ring, I'd tell Brown that I don't want any money, just to spend a day with him",
            "Omg! I’ve been walking around Boston all day looking for it 😅",
            "Man can't be seperated with his ice.",
            "I'm not saying this \\*is\\* creative marketing for 7uice... but if it were it would be a good stunt to \"lose\" the ring at the parade.  Several headlines just said \"Brown loses ring at parade\" which generates a lot of clicks, again not saying it is the case at all just a thought I had. \n\nidc and JB is the man either way"
        ]
    },
    "No one is talking about this but with KP out, we can have a JT MVP season": {
        "title": "No one is talking about this but with KP out, we can have a JT MVP season",
        "score": 403,
        "url": "https://i.redd.it/rpvxo14ave9d1.jpeg",
        "content": "",
        "num_comments": 122,
        "comments": [
            "Would be cool but personal awards mean nothing to us! BANNER 19",
            "I hope he really focuses on his shooting in the offseason. He’s got everything down pat his playmaking took a massive step, his defense and rebounding. If he can up those shooting percentages a bit look out. He’d be a legit MVP candidate",
            "Rather have a Banner 19 year",
            "True, but I'd rather have him win FMVP",
            "I don't think we will have an MVP on this team because of the way Joe gets them to play. Each night, everyone does what the team needs to win. I think if we make it back to the Finals, JT will win FMVP.",
            "I'm really excited to see post-nut Celtics. I want to see the next evolution of the Jays.",
            "I prefer kp getting healthy asap",
            "lmao he wont jokic luka and embiid have bigger shoulders to fill with lack luster rosters compared to jt, jt can have another banner but he wont win mvp if he has this stacked roster",
            "I feel like Kyrie is the real Celtics MVP this year.",
            "Also, now that he’s got a chip, maybe refs will give him calls"
        ]
    }
}