{
    "Weekend Casual Discussion Thread": {
        "title": "Weekend Casual Discussion Thread",
        "score": 9,
        "url": "https://www.reddit.com/r/boxoffice/comments/1dlbqt5/weekend_casual_discussion_thread/",
        "content": "Discuss whatever you want about movies or any other topic. A new thread is created automatically every Friday at 3:00 PM EST.",
        "num_comments": 19,
        "comments": [
            "The results are in for the [long range forecast for *Twisters*.](https://www.reddit.com/r/boxoffice/comments/1djm05w/rboxoffice_long_range_forecast_twisters/)\n\n- $53.31 million OW / $176.77 million DOM / $432.06 million WW\n\nWith 44 predictions, this was our most predicted film so far.\n\nThanks for participating! We're predicting *Deadpool & Wolverine* next week.",
            "I kind of want to put into perspective how bad 2024 is doing compared to 2023. Disney for example had a pretty bad year last year. But their bombs, like Ant-Man 3, The Marvels, Haunted Mansion, and Indiana Jones and the Dial of Destiny would be in the top ten domestic before May. Indy 5 would be the fifth highest grossing film of 2024 domestically. Ant-Man 3 would be above Godzilla X Kong: The New Empire and Kung Fu Panda 4 domestically. The Little Mermaid would be the highest grossing film of the YEAR domestically, and the 3rd highest grossing film WW. So would Guardians of the Galaxy Vol. 3. Elemental would be the second highest grossing animated film of the year (before the release of Inside Out 2), only behind Kung Fu Panda 4. Dune Part 2, the highest grossing film of the year, would only be barely above Fast X WW (not Disney but that’s how bad this year is doing)\n\nI don’t think people realize that without Disney, early 2023 would be on par with 2024. Ant Man boosted the numbers in February along with the massive continued success of Avatar: The Way of Water. Guardians of the Galaxy Vol. 3 opened May strong and The Little Mermaid ended it strong. Both films provided over 450m to the month of May. Subtract that from the overall May gross and you get… 334m, which is actually worse than 2024. Hell, even if you remove Kingdom of the Planet of the Apes’s gross from the month, you get 411m, which is much better than no Disney 2023 May. So once Disney is gone from the first four months, you get 2024. I just think that’s interesting because I think that means the theatrical market place is heavily reliant on Disney and if they don’t deliver the box office suffers as a result.",
            "I've probably said this to some posters already, but I think Paramount actually had THE worst 2023 out of 5 major studios. Universal was obviously having a time of their lives with films like **The Super Mario Bros. Movie** and **Oppenheimer**, Warner Brothers may had a colossal embarrassment with **The Flash**, but **Barbie** and **Wonka** were still enough to compensate (for) that, and Sony had **Spider-Man: Across the Spider-Verse** becoming a success. Even Disney had 2 ceremonial wins with **Elemental**, which left its legacy thanks to its insane legs, and **Guardians of the Galaxy Vol. 3**, which became the only major success among films that had the budget of $200 million or higher that year.\n\nWith Paramount, on the other hand, I honestly can't think of a single blockbuster-level success. Every single blockbuster films that they've made either underperformed or flopped due to their poor release date managements and ones that DID become successes like **Scream 6** probably felt pale when compared to other studios' major successes.",
            "The teaser for Nosferatu apparently drops on Monday. Anyone got some early predictions? I was able to see it in the theater yesterday and while it is disturbing, I think it has more potential to break out and be a modest success over the holidays. \n\n$17m OW (maybe like $24m 5 day weekend)\n\n$55m DOM \n\n$110m WW",
            "i went and saw the directors cut of Midsommar yesterday in IMAX and it was amazing, what great use of that format",
            "Movies I have seen so far\n\n1. Night Swim\n2. Beekeeper \n3. Mean Girls\n4. Argylle \n5. Land of Bad\n6. Dune 2 \n7. Madam Web\n8. The Boy and The Heron \n9. Demon slayer \n10. Drive away Dolls\n11. Lisa Frankenstein\n12. Kung Fu Panda 4\n13. Rascal Does Not Dream (Double feature)\n14. Imaginary\n15. Godzilla x Kong \n16. Ghostbuster Frozen Empire \n17. Mai \n18. Exhuma \n19. Civil War\n20. The First Omen\n21. Spy x Family \n22. Abigail \n23. Boy kills World \n24. Challengers\n25. Miller's Girl\n26. Kingdom of the Planet of the Apes \n27. The ministry of ungentlemanly warfare \n28. IF\n29. Stranger Chapter 1\n30. The Garfield movie\n31. Haikyuu The dumpster battle 2x\n32. Fall Guy\n33. Inside Out 2 (Will be twice tonight)\n34. Bad Boy (will watch tonight)",
            "Any final predictions for IO2 second dom weekend total?? I’m going to go safe and say 85M. How high can you guys see this number realistically go?",
            "Cinemark is doing a promotion for the Movie Club members where if you go see Thelma opening weekend they will give you a movie credit to go see any film you want. I took it and saw the movie. \n\nI really enjoyed it, although I'm the age where I related much more to the grandson character than Thelma herself. And I'm not the most pop-culture savvy guy. I had no idea who played the grandson but he got 2nd billing above Richard Roundtree, so I guess he's somewhat famous. Plus he was an Executive Producer on the film. \n\nAnyways, my 2024 film rankings favorite to least favorite look like this:    \n\n1.) I Saw The TV Glow    \n\n2.) Argylle    \n\n3.) Kingdom Of The Planet Of The Apes\n\n4.) Inside Out 2    \n\n5.) Ghostbusters Frozen Empire    \n\n6.) Bad Boys Ride Or Die    \n\n7.) Thelma    \n\n8.) The Bikeriders    \n\n9.) The Fall Guy    \n\n10.) Abigail    \n\n11.) Mean Girls (2024)    \n\n12.) Godzilla X Kong The New Empire    \n\n1 is a 10/10. 2-4 are 9/10. 5-7 are 8/10. 8-11 are 7/10. And 12 is 4/10.",
            "There was Mutant Mayhem & Paw Patrol",
            "1. Night Swim - January 4\n2. American Fiction - January 5\n3. Soul - January 15\n4. The Beekeeper - January 18\n5. The Zone of Interest - January 25\n6. Spirited Away - January 27\n7. The Godfather Part II - 50th Anniversary - February 5\n8. Argylle (IMAX) - February 6\n9. Turning Red - February 10\n10. Dune (IMAX) - February 11\n11. Madame Web (IMAX) - February 20\n12. Tenet (IMAX 70MM) - February 24\n13. Dune: Part Two Fan First Premiere (IMAX) - February 25\n14. Dune: Part Two (IMAX 70MM) - March 2\n15. Perfect Days - March 4\n16. Imaginary - March 8\n17. Kung Fu Panda 4 - March 9\n18. Love Lies Bleeding - March 15\n19. Immaculate - March 21\n20. Luca - March 23\n21. Ghostbusters: Frozen Empire (4DX) - March 26\n22. Late Night With The Devil - March 28\n23. Godzilla X Kong: The New Empire (IMAX) - March 29\n24. Dr. Strangelove Or: How I Learned To Stop Worrying And Love The Bomb - March 31\n25. Monkey Man - April 6\n26. The First Omen - April 7\n27. Full Metal Jacket - April 11\n28. Civil War (IMAX) - April 12\n29. Spider-Man - April 15\n30. The Shining - April 19\n31. Barry Lyndon - April 21\n32. 2001: A Space Odyssey - April 21\n33. Spider-Man 2 - April 22\n34. Abigail - April 23\n35. Challengers - April 25\n36. Boy Kills World - April 27\n37. Alien - 45th Anniversary Re-Release - April 29\n38. Spider-Man 3 - April 29\n39. Star Wars: Episode I - The Phantom Menace - 25th Anniversary - May 4\n40. The Fall Guy (4DX) - May 5\n41. The Amazing Spider-Man - May 6\n42. Kingdom of the Planet of the Apes (IMAX) - May 12\n43. The Amazing Spider-Man 2 - May 13\n44. IF - May 16 \n45. The Garfield Movie - May 19\n46. The Strangers: Chapter 1 - May 20\n47. Spider-Man: Homecoming - May 20\n48. Hit Man - May 24\n49. Furiosa: A Mad Max Saga (IMAX) - May 26\n50. Spider-Man: Far From Home - May 27\n51. In A Violent Nature - June 1\n52. Spider-Man: No Way Home - June 3\n53. The Lord of the Rings: The Fellowship of the Ring (Extended Edition) - June 7\n54. Crouching Tiger, Hidden Dragon - June 8 \n55. Bad Boys: Ride Or Die - June 8\n56. Mad Max: Fury Road - June 8\n57. The Lord of the Rings: The Two Towers (Extended Edition) - June 9\n58. The Lord of the Rings: The Return of the King (Extended Edition) - June 11\n59. Kill Bill: Volume 1 - June 14 \n60. Kill Bill: Volume 2 - June 14\n61. The Watchers - June 15\n62. Pulp Fiction - 30th Anniversary - June 15\n63. Inside Out 2 - June 16"
        ]
    },
    "'The Bikeriders' Rotten Tomatoes Verified Audience Score Thread": {
        "title": "'The Bikeriders' Rotten Tomatoes Verified Audience Score Thread",
        "score": 21,
        "url": "https://www.reddit.com/r/boxoffice/comments/1dll7su/the_bikeriders_rotten_tomatoes_verified_audience/",
        "content": "I will continue to update this post as the score changes.\n\n||**Score**|**Number of Reviews**|**Average Rating**|\n|:-|:-|:-|:-|\n|**Verified Audience**|77%|100+|4.00/5|\n|**All Audience**|77%|250+|3.90/5|\n\n**Verified Audience Score History:**\n\n* 80% (4.10/5) at 50+\n* 77% (4.00/5) at 100+\n\n[**Rotten Tomatoes:**](https://www.rottentomatoes.com/m/the_bikeriders) Certified Fresh\n\n**Critics Consensus:** Fueled by a charismatic cast and the gritty authenticity of writer-director Jeff Nichols' approach, *The Bikeriders* offers a conventional yet impactful look at motorcycle culture.\n\n||**Score**|**Number of Reviews**|**Average Rating**|\n|:-|:-|:-|:-|\n|**All Critics**|82%|151|6.80/10|\n|**Top Critics**|80%|44|6.60/10|\n\n[**Metacritic:**](https://www.metacritic.com/movie/the-bikeriders/) 71 (46 Reviews)\n\n**SYNOPSIS:**\n\n*The Bikeriders* captures a rebellious time in America when the culture and people were changing. After a chance encounter at a local bar, strong-willed Kathy (Jodie Comer) is inextricably drawn to Benny (Austin Butler), the newest member of Midwestern motorcycle club, the Vandals led by the enigmatic Johnny (Tom Hardy). Much like the country around it, the club begins to evolve, transforming from a gathering place for local outsiders into a dangerous underworld of violence, forcing Benny to choose between Kathy and his loyalty to the club.\n\n**CAST:**\n\n* Jodie Comer as Kathy\n* Austin Butler as Benny\n* Tom Hardy as Johnny\n* Michael Shannon as Zipco\n* Mike Faist as Danny Lyon\n* Norman Reedus as Funny Sonny\n\n**DIRECTED BY:** Jeff Nichols\n\n**WRITTEN BY:** Jeff Nichols\n\n**BASED ON THE BOOK** ***THE BIKERIDERS*** **BY:** Danny Lyon\n\n**PRODUCED BY:** Sarah Green, Brian Kavanaugh-Jones, Arnon Milchan\n\n**EXECUTIVE PRODUCERS:** Variv Milchan, Michael Schaefer, Sam Hanson, David Kern, Fred Berger\n\n**DIRECTOR OF PHOTOGRAPHY:** Adam Stone\n\n**PRODUCTION DESIGNER:** Chad Keith\n\n**EDITED BY:** Julie Monroe\n\n**COSTUME DESIGNER:** Erin Benach\n\n**MUSIC BY:** David Wingo\n\n**MUSIC SUPERVISOR:** Lauren Mikus, Bruce Gilbert\n\n**CASTING BY:** Francine Maisler\n\n**RUNTIME:** 116 Minutes\n\n**RELEASE DATE:** June 21, 2024",
        "num_comments": 13,
        "comments": [
            "The audiences score isn’t looking good which is likely to land on the B range on CinemaScore.",
            "I thought this was a pretty good flick with solid characters showing the evolution of biker clubs. Thought the three main stars did a phenomenal job. ",
            "I liked it quite a bit. You can tell it was influenced by Scorsese but it doesn’t have his humor or his flair for editing. It’s not as violent as I expected and the true lead of the film isn’t who we are led to believe in the trailer… which might anger some of the people who might be in the audience demo. That said I think the cast is wonderful and the cinematography is beautiful. Sound and music scoring is top notch too. I think the ending was a bit anti climactic but the ride was great fun",
            "You literally just said everything that verified critics scores have already said but ok",
            "Anti-climatic, and, a bit unwieldy narratively, overall. The framing device the interviews with Kathy represented decelerated the propulsion of the film’s momentum for me.\n\nYet, it’s bones and components remained compelling individually: the Americana iconography, the 50s/60s production design, Adam Stones deft touch weaving composition and lighting (Re: the scenario where Johnny asks Benny to consider becoming the Vandals heir apparent). It’s motley of characters, though lithe in their stature as anchors of the story, nevertheless conveyed intrigue in their mythological nature. I just wanted the film to convey more than what amounted to moving snapshots of a world unknown, but I enjoyed participating in the journey and it’s conversation with classic cinema of yesteryear. Perhaps I just wish it had more to say.",
            "Agreed 100%. Far from perfect but very well made with a stellar cast. Nice balance of tension and humor as well.",
            "And? I’m glad we could agree I guess. ",
            "It’s not exactly an abstract film lol straight to the point and it’s quite good. No fucking clue what accent Hardy was trying to pull but that’s par for the course with him I feel",
            "Agreed. I think we don’t get a true look into Benny as a character. He is a romantic and distant character. The film is poorer for this omission. But Austin Butler is very charismatic and so is Tom Hardy and that’s enough to carry the film mostly. I would love to have had a look into the reporter and his thoughts or interaction with Benny or Johnny at all",
            "It’d be weird if you came away with a different take honestly. \n\nGreat movie."
        ]
    },
    "~$33M OS 2nd FRI for #InsideOut2. $260M Cume. Great holds all over, with some markets seeing an increase from the first weekend.   2nd weekend expected to be $155M+ for $350M+ by SUN. Enroute $800M+ finish.": {
        "title": "~$33M OS 2nd FRI for #InsideOut2. $260M Cume. Great holds all over, with some markets seeing an increase from the first weekend.   2nd weekend expected to be $155M+ for $350M+ by SUN. Enroute $800M+ finish.",
        "score": 82,
        "url": "https://x.com/mejat32/status/1804463381937811819?s=46",
        "content": "",
        "num_comments": 47,
        "comments": [
            "$800 million OS + $600 million DOM = $1.4 billion WW\n\nRiley is on her way to snatch animated queen 👑 from Queen Elsa.",
            "It actually could hit $700M WW through Sunday. Incredible performance all around.\n\nDune 2 is toast on Monday.",
            "$800 million plus overseas\n$600 million plus domestic \n\n$1.4-$1.55 billion finish",
            "Totally massive. Congrats.",
            "This is impressive to me. Also does someone know anything about Kelsey Mann? He has been involved with Pixar in the past but this is his directorial debut for a motion picture and what a debut that is! I know this is a film that is based on pre-existing characters and ideas and Disney wouldn't have greenlit this without being sure of this movie (not talking about stuff like whatever they released post pandemic) but still not bad to have this in your resumé",
            "I know this thread is international but it also has a chance overtake the first one's lifetime gross domestically on Sunday. Needs $102M this weekend for this. I mean there is a chance and Empire and Charlie who started small with $85M-$95M second weekend are now saying $95M+ is in the cards. Hope they don't have to slow down like last week where they said $160M+ is in play before it ended up with $154M",
            ">Enroute for $800M+ finish\n\nI've said it before and I will say it again: this movie is an absolute beast, and I am all here for it.",
            "1.4-1.45B WW finish",
            "Dang… looks like it’s following legs like The Super Mario Bros Movie last year which started with a $375.6M with its second weekend landed with almost $700M.",
            "Wait so pixar isnt that well known Internationally ? because their highest os IS toy story 4  and it grossed less than Oppenheimer in os markets "
        ]
    },
    "Looks like $30M 2nd FRI for #InsideOut2. Headed for an AMAZING $95M+ 2nd weekend. That makes it a favourite to top $600M in the final run.": {
        "title": "Looks like $30M 2nd FRI for #InsideOut2. Headed for an AMAZING $95M+ 2nd weekend. That makes it a favourite to top $600M in the final run.",
        "score": 450,
        "url": "https://x.com/mejat32/status/1804319823591280721?s=46",
        "content": "",
        "num_comments": 124,
        "comments": [
            "95M would be a 38% drop, better than Finding Dory's 46%, Incredibles 2's 56% drop, and Toy Story 4's 51% drop. And IO2 had Juneteenth in the middle of the week to act as a mini-weekend to some people!",
            "🥳🥳🥳 this number definitely puts 100M on the table. But to be a little cautious I’m gonna say 90-95M.",
            "https://www.reddit.com/r/boxoffice/s/Jic3dD8Pvl\n\n10m higher than Deadline’s opening weekend outlook",
            "That's Mario level what the Fuck 🙀",
            "CAN WE GO HIGHER???\n\n![gif](giphy|J3T9b6JFfxFT2)",
            "Could we maybe sneak into a 100 million second weekend? This is insane and could really crush some records",
            "This thing isn’t following Dory at all lol",
            "If this cracks 100m 2nd weekend…. I don’t even know what to say.",
            "I literally said 96M the other day when projections were 69M.",
            "I’m starting to notice a trend recently whenever a big blockbuster over-performs expectations.\n\nTop Gun: Maverick - $126.7M opening weekend -> $90.0M second weekend\n\nThe Super Mario Bros Movie - $146.7M opening weekend -> $92.3M second weekend \n\nBarbie - $162M opening weekend -> $93.0M second weekend\n\nNow: Inside Out 2: $154M opening weekend -> $95M projected second weekend."
        ]
    },
    "Friday will be as high as $31m for #InsideOut2 continuing an historic run at the box office.  Potential $100m weekend at the top end, but if it gets to $95m that is spectacular.  Headed to well over $600m domestic and $1.4b global potential total.": {
        "title": "Friday will be as high as $31m for #InsideOut2 continuing an historic run at the box office.  Potential $100m weekend at the top end, but if it gets to $95m that is spectacular.  Headed to well over $600m domestic and $1.4b global potential total.",
        "score": 205,
        "url": "https://x.com/empirecitybo/status/1804352185456599236?s=46",
        "content": "",
        "num_comments": 92,
        "comments": [
            "This is looking to hold better than the first movie did second weekend. This honestly is mind baffling",
            "We are getting a 3rd film. This will be Pixar's next Toy Story franchise.\n\nI just have this feeling that this isn't the end of Riley & her emotions.",
            "Disney (and mostly Pixar) really needed this W badly.",
            "Not entirely sold on 100M but I do think it would land somewhere around 95M. What do you all say?",
            "I think I’m tired of typing Holy Shit. Any new things I can type?",
            "Ok, anyone that says they saw these numbers coming is lying lol.  Insane performance.",
            "Having a higher second weekend than the first films opening weekend is absolutely insane. I thought it would be a success if it managed to open around the same. I don’t think anyone a few weeks ago would’ve predicted it to out do the first in its 2nd weekend",
            "![gif](giphy|SIwFUGVvRKcRy0OaTY|downsized)",
            "Holy fuck this is 700m domestic potential",
            "Totally coming for Top Gun: Maverick. 600-700+ million domestic run is coming."
        ]
    }
}