{
    "Not all men but the rest is watching and doing nothing.": {
        "title": "Not all men but the rest is watching and doing nothing.",
        "score": 45,
        "url": "https://v.redd.it/o5kfdolfrg9d1",
        "content": "",
        "num_comments": 12,
        "comments": [
            "\"NaTuRaL pRoTeCtOrs\", fuck those 2 guys smirking and laughing. What absolute trash.",
            "Kinda funny that you posted this twice and I got both on my timeline(?) in pretty quick succession.\n\nMore seriously, though. Fuck those guys.",
            "I hope laughing guys family/friends see his reaction wtf. Bro needs some lead therapy",
            "I would tell the waiters and let them take it from there. In my experience they really got a zero tolerance for bs like this",
            "I don’t want to say it but… for people who don’t understand why women would choose the bear, this is a great way of showing why. I know, “not all men” but it’s unfortunate that these men did NOTHING, and some even smiled and laughed :/",
            "#Step by step guide in becoming a Natutal Protector\n\nStep 1: *don't*",
            "All the same",
            "What a fucking jungle",
            "This is so sad",
            "Yes all men."
        ]
    },
    "False equivalency": {
        "title": "False equivalency",
        "score": 202,
        "url": "https://i.redd.it/clf7kywxmc9d1.jpeg",
        "content": "",
        "num_comments": 36,
        "comments": [
            "“If woman suffer what man do” did the OOP have a stroke writing that 💀",
            "Snafu is a satirical sub, they’re making fun of that style of content.",
            "I think OOPs stroke transfered to OP and now to me I don't understand what is going on here",
            "What does your flair mean",
            "Man? Like from the hit game Man: Aslume and Man: ham as well as Man: Aslume kite",
            "\"Proud misandrist\" is a weird-ass flair lmao",
            "all of the deleted comments and the ones still up are saying “as a man this happened to me so this is false” and “these are bad examples” and it’s “in poor taste” 🙄",
            "No that’s normal for coaxedintosnafu, they make comics simplifying things heavily for humor",
            "The comments would say otherwise",
            "Its like the whole shtick - i love it"
        ]
    },
    "Found one !! All men are the same and all women are the same , your just your gender not your personality 🙄": {
        "title": "Found one !! All men are the same and all women are the same , your just your gender not your personality 🙄",
        "score": 175,
        "url": "https://i.redd.it/i6gdkaifxb9d1.jpeg",
        "content": "",
        "num_comments": 25,
        "comments": [
            "Meanwhile for me and my former boyfriend we were completely the reverse. He would tell me about nice dreams he had where we were just sitting on a beach chatting, meanwhile my dreams have always been extremely vivid and wild. Like last night I was literally dreaming that I was trying to get a flute that I used to own back from Satan himself who was an old friend",
            "I highly doubt anyone dreamt that.",
            "Wow! What a hilarious wacky and zany dream, amiright boys?",
            "was this meme written by a 10 year old",
            "Is that a civilization reference? Evil Gandhi?",
            "I once had a dream that a beautiful talking unicorn came to my house and then relentlessly attempted to eat out of my cats’ litter box.",
            "My dreams are more like the bottom one who dreams about braiding hair unless your hair is falling out in the dream and then your teeth also",
            "People who make memes like this just seem like they've genuinely never had a conversation with a girl in their life.",
            "I had a dream I tried to buy a dildo that was like one of those extendo fidget tube toys. I had a dream I had sex with Komi from Komi can’t communicate. I had a dream I kissed entrants from the she ra remake. Women have weird dreams to",
            "Right? I dreamt I was a spy infiltrating an evil base in the north pole like an action flick"
        ]
    },
    "We're reaching quirkiness levels that shouldn't be possible ": {
        "title": "We're reaching quirkiness levels that shouldn't be possible ",
        "score": 23,
        "url": "http://rebirthofreason.com/Articles/Setzer/Rules_for_Women_and_Rules_for_Men.shtml",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Since they love camping so much, just kick them out of the house.",
            "The victim complex 🙄. And so dismissive. The only thing I support was “I am in shape. Round is a shape”. Everything else was 🤢"
        ]
    }
}