{
    "Not all men but the rest is watching and doing nothing.": {
        "title": "Not all men but the rest is watching and doing nothing.",
        "score": 14,
        "url": "https://v.redd.it/akw7ttncrg9d1",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Context : the guy did a social experiment where he would add something to the drink of the woman (also an actor) and they would see the reactions of people. Like you can see, men would just watch and not act or say anything.\n\nIts not shown in the video but three women would act and say that the guy spiked her drink. Men love to call themselves protectors yet they sit there and do nothing. Women are our best allies.\n\n[the full video](https://youtu.be/ontgb2aaOMI?si=C_-J4wULHwgLxhzQ) (it is in french but its pretty udnerstandable on its own)",
            "Absolutely does not surprise me in the least. Vast majority of them have very very low morality and are incredibly self-centered.",
            "\"I only care if its my wife, daughter or family member !\" \n\nOkay, do you want other men to think the same when something like that happens to a woman you love ? Society is falling and its not due to feminism like they love to claim."
        ]
    },
    "False equivalency": {
        "title": "False equivalency",
        "score": 172,
        "url": "https://i.redd.it/clf7kywxmc9d1.jpeg",
        "content": "",
        "num_comments": 29,
        "comments": [
            "“If woman suffer what man do” did the OOP have a stroke writing that 💀",
            "[Context](https://www.reddit.com/r/comics/comments/1dpptkk/talk/)",
            "Snafu is a satirical sub, they’re making fun of that style of content.",
            "I think OOPs stroke transfered to OP and now to me I don't understand what is going on here",
            "What does your flair mean",
            "So do!",
            "I’m gonna try… Suffhim??",
            "Man? Like from the hit game Man: Aslume and Man: ham as well as Man: Aslume kite",
            "\"Proud misandrist\" is a weird-ass flair lmao",
            "No that’s normal for coaxedintosnafu, they make comics simplifying things heavily for humor"
        ]
    },
    "Found one !! All men are the same and all women are the same , your just your gender not your personality 🙄": {
        "title": "Found one !! All men are the same and all women are the same , your just your gender not your personality 🙄",
        "score": 150,
        "url": "https://i.redd.it/i6gdkaifxb9d1.jpeg",
        "content": "",
        "num_comments": 24,
        "comments": [
            "Meanwhile for me and my former boyfriend we were completely the reverse. He would tell me about nice dreams he had where we were just sitting on a beach chatting, meanwhile my dreams have always been extremely vivid and wild. Like last night I was literally dreaming that I was trying to get a flute that I used to own back from Satan himself who was an old friend",
            "I highly doubt anyone dreamt that.",
            "Wow! What a hilarious wacky and zany dream, amiright boys?",
            "was this meme written by a 10 year old",
            "Is that a civilization reference? Evil Gandhi?",
            "I once had a dream that a beautiful talking unicorn came to my house and then relentlessly attempted to eat out of my cats’ litter box.",
            "After reading this post, scrolled through chat to find the last two dreams shared with a friend. \n\nOne was time travel dream where I stole a WW2 US Army jeep for a joyride. \n\nThe dream before that, I nailed a severed human hand up as a wall decoration, then had to take it down when two fingers fell off. The hand had come from a would-be burglar who met with an unfortunate accident. We didn't call law enforcement.\n\nI'm a woman.",
            "My dreams are more like the bottom one who dreams about braiding hair unless your hair is falling out in the dream and then your teeth also",
            "People who make memes like this just seem like they've genuinely never had a conversation with a girl in their life.",
            "I had a dream I tried to buy a dildo that was like one of those extendo fidget tube toys. I had a dream I had sex with Komi from Komi can’t communicate. I had a dream I kissed entrants from the she ra remake. Women have weird dreams to"
        ]
    },
    "We're reaching quirkiness levels that shouldn't be possible ": {
        "title": "We're reaching quirkiness levels that shouldn't be possible ",
        "score": 19,
        "url": "http://rebirthofreason.com/Articles/Setzer/Rules_for_Women_and_Rules_for_Men.shtml",
        "content": "",
        "num_comments": 2,
        "comments": [
            "The victim complex 🙄. And so dismissive. The only thing I support was “I am in shape. Round is a shape”. Everything else was 🤢",
            "Since they love camping so much, just kick them out of the house."
        ]
    },
    "I tried making a meme ": {
        "title": "I tried making a meme ",
        "score": 314,
        "url": "https://i.redd.it/dsg2kvehba9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Just hate how incels always refer to women as 'females' and not just women 💀",
            "Tbh, i think meeting a standart for normal human does not guarantee you success in finding romantic relationship, it won't hurt tho.",
            "You cooked 👍",
            "Why won’t everyone accept me for who I am while also conforming to my every world view?",
            "Good meme :3",
            "They also put not effort in their appearance at all. As if only men should get the privilege of a nice looking partner who makes an effort.\n\nGo beyond basic hygiene and go revamp your wardrobe. Go get a flattering haircut. The world doesn't just fall into anyone's laps, we all have to work at it.",
            "I love bringing this up whenever anyone says this, but I heard that gynecologists referred to the enslaved women they experimented on as females to deny them personhood and then served white ‘women’. They did this both to justify their experimentation but also to make white women more comfortable that they weren’t being equated to black enslaved women. Idk if that history has a direct relation to the modern usage of female by incels, but IMO it shows that using females instead of women has a history of dehumanizing / deriding women.",
            "Thank you! Men have the same natural ability to look attractive that women do, but more women dedicate time, research, and effort into looking attractive while most men think all that’s needed is a monthly haircut, shaving once your mustache gets in your mouth, and wearing clashing graphic t shirts with every single outfit"
        ]
    }
}