{
    "Mod applications & suggestions for the sub": {
        "title": "Mod applications & suggestions for the sub",
        "score": 10,
        "url": "https://www.reddit.com/r/BrandNewSentence/comments/1cfe4d2/mod_applications_suggestions_for_the_sub/",
        "content": "Yes, we are still looking for mods. Nothing has changed. In fact, some people have gotten even less time than they had back then, hence why I felt the need to repost this. We get about one person show interest per month at best and I just felt like maybe reposting would help us find more people.\n\nNone of us exactly like how some things are handled on this subreddit, so you can use the comment section for your complaints. I would gladly take criticism on what to improve if such criticism is provided. However, expect most of them to be ignored if you have no solution in mind, or harass others for no reason. Remember we are people with lives outside of internet so stuff like this report just upsets more than anything. We can't check thousands of posts that get posted weekly, especially when most of us don't have time to go on reddit daily.\n\nhttps://preview.redd.it/xm8c1xxfp9xc1.png?width=244&format=png&auto=webp&s=d3902aef7d25c1b845d1c660be649f353f92cb4b\n\nIf you are interested in applying, send me a DM with the following (I'm not doing a google doc this time since everyone forgets to check it)\n\n* Your discord name (required for communication, none of us use reddit chat. It's not the greatest way to communicate)\n* Why are you interested in modding this subreddit? Where did you find this post?\n* Are there any rules that you'd change? If so, why? If not, say \"No\"\n* Which problems you aim to fix by being a mod & any suggestions on how you or we could fix them\n* What is some content you would remove from the subreddit? Ex. check the \"hot\" or \"new\" tabs and link an example. Explain why it is bad for the subreddit\n* What is some content you would like to see more on the subreddit? Link an example, maybe a favorite post of yours and explain why it fits the subreddit (if you can)\n* Do you agree with rule 9? Elaborate.\n\nIf you don't know English or are a powermod, do not apply. I think both are self explanatory for a witty text based subreddit\n\nHope everyone has a great day :)\n\n&#x200B;\n\n&#x200B;",
        "num_comments": 7,
        "comments": [
            "No comments? Let me just"
        ]
    },
    "Translation please": {
        "title": "Translation please",
        "score": 566,
        "url": "https://i.redd.it/pir9yfj0qh9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Aille haives stuediedes frnche foure three yearce, ande thise ise toux accurates",
            "Aheuh shite, heereuh wee goe heugayneuh.\n\nEdit: spelling",
            "Definitely sounds like something out of a linguistic fever dream. \n\nAnyone else read this in a dramatic accent?",
            "I read it with an Italian accent by mistake and now I can't stop. Help.",
            "For some reason I read that in Arnold Schwarzenegger's voice",
            "Mama Mia, you foola ! Youssa beena bad boy !",
            "I read that last part in a jar jar binks voice",
            "I knew a French-speaking waitress in Sousse. She was pretty and nice, but I couldn't stand her because of her Ootrajieux accen!",
            "hdeet: spehlleeng*",
            "[And so did Steve Martin, also playing Inspector Closseau](https://www.youtube.com/watch?v=dphayJDCzog)"
        ]
    },
    "\"It's so poorpeoplecore\" ????": {
        "title": "\"It's so poorpeoplecore\" ????",
        "score": 410,
        "url": "https://i.redd.it/9bi3fzqnph9d1.jpeg",
        "content": "",
        "num_comments": 14,
        "comments": [
            "On todays episode of Jesus Christ I Hope This Is Satire: this!",
            "This is kind of the meme version of Common People by Pulp.",
            "this basically proves that the rich shouldnt exist anymore",
            "I love taking the bus, it takes me where I need to go with virtually no effort on my side",
            "Nobleman here. I once rode on that oversized motor carriage so that I might get a better glimpse into the lives of those less fortunate than I. My fellow noblemen called me a fool. \"You are a Big Guy!\" they said. \"You are not one of the little ones!\" Nevertheless, I went and took my parchment paper and my quill and inkwell so that I might take copious notes. I noticed that they were *exceptionally* rude. They yelled at me and said \"Stop staring you fucking creep!\" as I made notes on my parchment. Perhaps their temperament comes from being of such lowly status, or perhaps it is a product of the Almighty's will.",
            "I'm never sure if I'm going to look more stupid if I immediately assume that something like this is satire or if I treat it as if it's serious. Both seem equally plausible and equally unlikely at the same time.",
            "The peasants are adorable",
            "Im poorpeoplecore!",
            "Poe's Law prevails...",
            "While we're on the subject, the supreme in it's endless wisdom just ruled that sleeping on the street is now punishable by prison time\n\n\"The law, in its majestic equality, forbids rich and poor alike to sleep under bridges, to beg in the streets, and to steal their bread.\"\nAnatole France\n\nhttps://www.theguardian.com/us-news/ng-interactive/2024/jun/28/supreme-court-decision-unhoused-sleeping-outside"
        ]
    },
    "It was just a good Christian honk": {
        "title": "It was just a good Christian honk",
        "score": 313,
        "url": "https://i.redd.it/cruex1h5ph9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Now I'm imagining a goose in church. He's trying to pray but he doesn't know volume control.",
            "Once I was driving home from work and saw my gf of the time walking home from the store, so I excitedly honked. Without looking, she shouted FUCK OFF and the middle finger went up. I knew she didnt know it was me, so I turned around a few yards ahead to go back and pick her up...\n\nClosest Ive ever come to being maced!",
            "*just a good ol' christian honk*",
            "My name is Honk. Christian Honk.",
            "Imagine a church service of only geese. It would be cacophonous.",
            "you should get one of those custom honkers that plays a nice tune. makes people feel less threatened.",
            "Ah sorry, good sir. I thought you just squeezed my breast in a non-christian manner.",
            "Honk for Jesus!",
            "I wish there was a special honk you could do that was like nice and supportive. Like you see someone on their morning jog and you do the special honk and they know it means Yeah! You go girl!"
        ]
    },
    "Mainstream consonants ugh": {
        "title": "Mainstream consonants ugh",
        "score": 1230,
        "url": "https://i.redd.it/bnllt4laxe9d1.jpeg",
        "content": "",
        "num_comments": 26,
        "comments": [
            "This is a rip off of the tweet where a guy called the letters goth",
            "Ive seen so many variations on this same tweet I have no idea which one was the original",
            "What about J? Super common as the first letter of names but super rare overall and it's just hanging out with the headliners",
            "Holy shit, he's right. It comes before even R, S, and T. It feels so wrong.",
            "For someone who uses avant-garde in his sentence, him mispelling 'belongs' stands out to me.",
            "I mean there's actually good reason why the more esoteric letters come later in the alphabet. Q is earlier because it comes from Phoenician . While X Y and Z were added later and didn't exist in Phoenician.",
            "Fantasma did a great bit on this, Steve Buscemi played Q, he was before his time",
            "I mean hes right... but wft",
            "Pssh, Y is common as fuck. Not just in everyday words like \"by\", \"my\", and \"try\", but any adverb out there is gonna be rockin' a Y. What, Y is supposed to be edgy because it comes near the end of the alphabet and can swing with consonants and vowels? Whatever. Gimme a Y over an B any day.",
            "Trade Q with Y which is way more common and necessary. Also move J way the fuck down.\n\nN,R,S,&T are also crazy late for being really damn common and necessary."
        ]
    }
}