{
    "Mod applications & suggestions for the sub": {
        "title": "Mod applications & suggestions for the sub",
        "score": 11,
        "url": "https://www.reddit.com/r/BrandNewSentence/comments/1cfe4d2/mod_applications_suggestions_for_the_sub/",
        "content": "Yes, we are still looking for mods. Nothing has changed. In fact, some people have gotten even less time than they had back then, hence why I felt the need to repost this. We get about one person show interest per month at best and I just felt like maybe reposting would help us find more people.\n\nNone of us exactly like how some things are handled on this subreddit, so you can use the comment section for your complaints. I would gladly take criticism on what to improve if such criticism is provided. However, expect most of them to be ignored if you have no solution in mind, or harass others for no reason. Remember we are people with lives outside of internet so stuff like this report just upsets more than anything. We can't check thousands of posts that get posted weekly, especially when most of us don't have time to go on reddit daily.\n\nhttps://preview.redd.it/xm8c1xxfp9xc1.png?width=244&format=png&auto=webp&s=d3902aef7d25c1b845d1c660be649f353f92cb4b\n\nIf you are interested in applying, send me a DM with the following (I'm not doing a google doc this time since everyone forgets to check it)\n\n* Your discord name (required for communication, none of us use reddit chat. It's not the greatest way to communicate)\n* Why are you interested in modding this subreddit? Where did you find this post?\n* Are there any rules that you'd change? If so, why? If not, say \"No\"\n* Which problems you aim to fix by being a mod & any suggestions on how you or we could fix them\n* What is some content you would remove from the subreddit? Ex. check the \"hot\" or \"new\" tabs and link an example. Explain why it is bad for the subreddit\n* What is some content you would like to see more on the subreddit? Link an example, maybe a favorite post of yours and explain why it fits the subreddit (if you can)\n* Do you agree with rule 9? Elaborate.\n\nIf you don't know English or are a powermod, do not apply. I think both are self explanatory for a witty text based subreddit\n\nHope everyone has a great day :)\n\n&#x200B;\n\n&#x200B;",
        "num_comments": 7,
        "comments": [
            "No comments? Let me just…"
        ]
    },
    "Sphere Rescinds Ban on Boastful Bong Dude From Phish Show, Saying Lawyer’s Letter Was a Mistake": {
        "title": "Sphere Rescinds Ban on Boastful Bong Dude From Phish Show, Saying Lawyer’s Letter Was a Mistake",
        "score": 17,
        "url": "https://variety.com/2024/music/news/sphere-rescinds-ban-phish-bong-concert-user-1236029719",
        "content": "",
        "num_comments": 3,
        "comments": [
            "You got pinned!",
            "The best part: the dude goes by the name Acid Farts."
        ]
    },
    "No wonder he never vomits at home!": {
        "title": "No wonder he never vomits at home!",
        "score": 2957,
        "url": "https://i.redd.it/u7p66c1hyy7d1.jpeg",
        "content": "",
        "num_comments": 109,
        "comments": [
            "Paul had a better business card.",
            "How did Paul get reservations at Dorsia?",
            "is this about cow turtle? because the man has a literal eel pit and it's incredible. he has an eel named mentally eel. also one named meelany. also gar named garlic and garfield.",
            "“Comparison is the thief of joy” -Teddy Roosevelt",
            "I love it that the cartoonist has such little creativity they use the name of the fancy restaurant from American Psycho.\n\nEdit: the text has been changed from an original by Blanche Draw (or is an AI copy in the style of?) My criticism is for the asshole that changed the text and replaced the original artists credit line with the handle of an anti-LGBT Twitter account.",
            "Him: Lisa would swallow",
            "This type of woman exists, the issue is men who have one bad experience and then assume **all** women are this woman for the rest of time. They, unfortunately, also exist.",
            "Wasn’t expecting an airplane reference",
            "How about we see Paul’s dissatisfied girlfriend?",
            "I feel like it's AI."
        ]
    },
    "Are Vegans allowed to listen to classical music?": {
        "title": "Are Vegans allowed to listen to classical music?",
        "score": 1024,
        "url": "https://i.redd.it/x7353lf3pz7d1.jpeg",
        "content": "",
        "num_comments": 96,
        "comments": [
            "As someone who learned the violin when I was a kid, I can assure you they are most definitely not made from cat guts. \n\nThey were at one point made from a material called catgut, but that's a composite material made from natural fibers found in the intestinal wall of other animals (the \"cat\" might actually be short for cattle). \n\n  \nSo, technically not vegan. \n\n  \nHowever, at the same time, it is not longer commonly in use. These days, strings are usually made from nylon or specialized wound metal. \n\n  \nOne thing to maybe be concerned with would be the bow, which is generally made with horse tail hair.",
            "This person has too much time on their hands",
            "[Original Post](https://www.reddit.com/r/AskVegans/s/KeM8qKsBut)",
            "Being Vegans, it's not just the animal consumption that precludes them listening to classical music, but also the fact they have taken a vow against joy.\n\n*^(/s)*",
            "I don't suppose why not. Unless they're very hard-line vegans (who disassociate themselves from anything animal-related, no matter how tenuous)",
            "Come to think of it, now. All traditional quality musical instruments of any sort do include some animal product one way or another...",
            "I mean generally speaking, not a bad question, if person overthinks everything, why not to ask if you are worried.",
            "No of course not. They may listen to some chamber music but that's IT.",
            "The question should be are humans that delicate over the  goofiest ideas that they need need to ask this. If they are those vegans better stop kissing and swapping spit could be considered canalbalism.",
            "Least unhinged reddit vegan."
        ]
    },
    "Helicoptering my dick so the cops can't triangulate my cellphone signal": {
        "title": "Helicoptering my dick so the cops can't triangulate my cellphone signal",
        "score": 312,
        "url": "https://i.redd.it/ehqqkppvw08d1.jpeg",
        "content": "Source: https://www.instagram.com/p/C8Xtl6UtNqy/?igsh=MWYweDV4eWM5dXNhbw==",
        "num_comments": 5,
        "comments": [
            "Dont google \"meatspin\"",
            "Might work if you attach some foil strips.",
            "Laugh all you want,  it works",
            "What do you have against shawarma?",
            "Non-holy shock content!"
        ]
    }
}