{
    "ATENÇÃO! IMPORTANTE!": {
        "title": "ATENÇÃO! IMPORTANTE!",
        "score": 129,
        "url": "https://www.reddit.com/r/brasilivre/comments/1993ynz/atenção_importante/",
        "content": "O usuário que fizer posts falando sobre outros subreddit, seja pra reclamar da moderação stalinista, seja pra se gabar de ter sido banido, seja desafiando outros a postarem algo em determinada comunidade, receberá PERMABAN, não importa a idade e karma da conta.\n\nIsso é sério, não é uma pegadinha. \n\nMotivo? É a vontade dos admins e isso basta. \n\nSe você gosta do sub, não comente sobre outros subreddits neste espaço ou terá sua conta permabanida daqui. Não importa se em outros subreddits é normal falarem de outros subs, aqui não nos é permitido!\n\nObrigado.\n\nEDIT: Para quem ainda não sabe, \"admins\" são funcionários da própria plataforma Reddit. Não confundam admins com os mods do sub.",
        "num_comments": 182,
        "comments": [
            "https://preview.redd.it/8dw3b01292dc1.jpeg?width=640&format=pjpg&auto=webp&s=71640b8ea89db9afb10d0208f8fed14a3d5bc69c\n\nNão há outros subs em Ba Sing Se",
            "**Por que o Brasilivre precisa fazer isso?** É uma das regras do Reddit, infelizmente.\n\nhttps://preview.redd.it/92uj1qxh72dc1.png?width=684&format=png&auto=webp&s=6239508d4134f2732d56c8b169573b8d1e35a151\n\nQuanto às reclamações sobre outros subreddits:\n\n**O reddit permite moderadores agirem injustamente e arbitrariamente, banindo quem quiser e pela razão que quiserem?** Sim. Se o sub é teu, você pode fazer o que quiser, desde que não quebre as regras do TOS. Não existe nenhuma regra contra esse comportamento.\n\nPerguntei em alguns subs de suporte sobre isso e, em geral, a resposta foi essa:\n\n**\"As long as it doesn't break the ToS (and isn't part of the Reddit blackout), mods have the ability to run their subs as they choose, this includes banning whoever they want for whatever reason they want. \"**\n\nPerguntei a alguns ADMs também e não obtive resposta, mas provavelmente é isso. Vamos ter que aceitar essa situação que acaba prejudicando o próprio Reddit e seguir em frente, se quisermos que o **Brasilivre** continue ativo.",
            "Sugestões de novos nomes para o sub: \n\n- BrasilQuaseLivre\n- BrasilMeioLivre\n- BrasilMaisOuMenosLivre\n- BrasiLiberdadeQuestionável\n- BrasilNaoPodeFalarDeOutrosSubForaIssoÉLivre\n- BrasilFaleQualquerMerdaMasNãoFaleDeOutrosSubs\n- BrasilOutrosSubsAquiNão\n- BrasilPermaBanParaQuemOusarMencionarOutrosSubs",
            "E viva a liberdade!",
            "Deixo um apelo à razão aos mods: um permaban pode ser um pouco exagerado. Pode muito bem acontecer de alguém ser banido de outra comunidade e na hora da raiva vir aqui postar sem ver a regra, ou não entendendo o quão estrita ela é, e acabar sendo banido das duas.\n\nO tratamento não precisa ser entre a juiza do cafezinho e a juiza do diga-vossa-excelência. O caminho do meio pode ser o melhor.",
            "N da pra tankar o bostil nem quando é livre",
            "Pode falar que o mod é gordo e fede?",
            "Deixei outras redes para me exilar no Reddit, em pouco tempo já percebi como as coisas funcionam por aqui...\n\nA liberdade de expressão está sendo cerceada em todas as redes, levei ban por falar verdades em outro sub, nada fora da lei.\n\nPuro mimimi....\n\nO mimimi é um vírus, um parasita, um micróbio nojento que está dominando tudo.\n\nFico pensando: será que terei que ir pro X ou Parler minha nossa senhora?\n\nE nem católico sou... Aliás não vou na igreja, não sou de esquerda, nem direita, só procurava um lugarzinho pra poder falar minha opinião e não levar ban de gente mimizenta.\n\nAlguma dica meus amigos? Ops! Perdão, eu quis dizer amigues.\n\nTá foda viu, poota que pariu!",
            "Hora de vazar do reddit 😁",
            "Muda o nome do sub pra Brasil meio livre"
        ]
    },
    "nao pode mais chamar corrupto de corrupto?": {
        "title": "nao pode mais chamar corrupto de corrupto?",
        "score": 261,
        "url": "https://i.redd.it/xllozu2n6d9d1.png",
        "content": "",
        "num_comments": 33,
        "comments": [
            "Pinguço corrupto e ladrão",
            "O Lula me obriga a dar razão pra argentino pqp",
            "Até agora acho que o Milei é o melhor presidente que já vi.",
            "Viva la Liberdad!",
            "E o xandão sem poder fazer nada",
            "Based",
            "Xandão da 72 horas pro milei se explicar",
            "N vejo a hora de brasil e argentina entrarem em guerra pra eu poder migrar pra argentina e servir lá",
            "Esse aí que e um presidente de verdade. E ele tá certo pode chamar Lula de corrupto mais não? Esse aí é a nova censura do governo do amor?",
            "Bom, *comunista* de fato o Lyle não é. Ele é um corporativista. A mentalidade dele é parecida com a do Salazar, acho que é a figura política mais próxima no mundo do estilo de governo dele."
        ]
    },
    "Acorda cara, acorda gente já começou...": {
        "title": "Acorda cara, acorda gente já começou...",
        "score": 129,
        "url": "https://v.redd.it/88i0kyuc3d9d1",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Para fazer download do vídeo, utilize qualquer um dos seguintes links:  \n**[RedditSave](https://redditsave.com/info?url=https://www.reddit.com/r/brasilivre/comments/1dqrncs/acorda_cara_acorda_gente_já_começou/)** | **[ReddLoader](https://reddloader.com/download-post/?url=https://www.reddit.com/r/brasilivre/comments/1dqrncs/acorda_cara_acorda_gente_já_começou/&id=b2ea0726)** | **[RedditWatch](https://www.reddit.watch/r/brasilivre/comments/1dqrncs/?utm_source=automod&utm_medium=brasilivre)** | **[Viddit.red](https://viddit.red/?url=https://www.reddit.com/r/brasilivre/comments/1dqrncs/acorda_cara_acorda_gente_já_começou/)** | **[RedditVideoDL](https://redditvideodl.com/dl.php?url=https://www.reddit.com/r/brasilivre/comments/1dqrncs/acorda_cara_acorda_gente_já_começou/)** | **[SaveMP4](https://savemp4.red/?url=https://www.reddit.com/r/brasilivre/comments/1dqrncs/acorda_cara_acorda_gente_já_começou/)**  \n^(*Os sites listados acima são de terceiros. Tenha atenção ao utilizá-los para não clicar acidentalmente em anúncios.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/brasilivre) if you have any questions or concerns.*",
            "E se eu achar que a TV é terra sem lei? que eles podem mentir, omitir, esconder, e nada acontece? podemos bloquear tb?",
            "É, Pondé. Mas quando voce fez o L, voce alimentou ainda mais o monstro que critica.",
            "Pondé pulando do navio. Os ratos sempre vão na frente!",
            "Esse olhar da Thais me tira totalmente o foco pqp",
            "Lixo",
            "Esse cara aí é petista",
            "Quando um homem com um óculos desses fala, você ouve, porque o que vem com certeza é bom.",
            "Já ocorre isso. Lembra da polêmica entre sbt que disse q foram taxados caminhões de doações indo p rio grande do sol, e o governo disse q não. Depois viu se que era verdade.\n\nA censura não é da internet, é do q desagrada o censor.",
            "A censura vem de antes do Lula ser eleito. O Lula pode usar como arma por ser alinhado com o STF, mas ninguém votou no judiciário."
        ]
    },
    "Deveria haver limites de idade para se candidatar": {
        "title": "Deveria haver limites de idade para se candidatar",
        "score": 196,
        "url": "https://v.redd.it/d5hfjrfm9c9d1",
        "content": "",
        "num_comments": 55,
        "comments": [
            "Para fazer download do vídeo, utilize qualquer um dos seguintes links:  \n**[RedditSave](https://redditsave.com/info?url=https://www.reddit.com/r/brasilivre/comments/1dqnqf3/deveria_haver_limites_de_idade_para_se_candidatar/)** | **[ReddLoader](https://reddloader.com/download-post/?url=https://www.reddit.com/r/brasilivre/comments/1dqnqf3/deveria_haver_limites_de_idade_para_se_candidatar/&id=b2ea0726)** | **[RedditWatch](https://www.reddit.watch/r/brasilivre/comments/1dqnqf3/?utm_source=automod&utm_medium=brasilivre)** | **[Viddit.red](https://viddit.red/?url=https://www.reddit.com/r/brasilivre/comments/1dqnqf3/deveria_haver_limites_de_idade_para_se_candidatar/)** | **[RedditVideoDL](https://redditvideodl.com/dl.php?url=https://www.reddit.com/r/brasilivre/comments/1dqnqf3/deveria_haver_limites_de_idade_para_se_candidatar/)** | **[SaveMP4](https://savemp4.red/?url=https://www.reddit.com/r/brasilivre/comments/1dqnqf3/deveria_haver_limites_de_idade_para_se_candidatar/)**  \n^(*Os sites listados acima são de terceiros. Tenha atenção ao utilizá-los para não clicar acidentalmente em anúncios.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/brasilivre) if you have any questions or concerns.*",
            "Deveria ter limite por cognição, tem gente que com 90 anos lúcida e com 60 já tá caducando, cada caso é um caso.",
            "Isso ta muito igual aos canais de ia que botam eles pra jogar juntos",
            "Meu comentário é sempre o mesmo nessas questões.\n\nO problema nunca são os candidatos, o problema sempre são os eleitores.\n\nSe for pra impedir os eleitores de poderem ser burros, melhor não deixar votarem logo.\n\nQual a lógica em manter uma \"democracia\" se você precisa PROIBIR o eleitor de votar em criminosos, dementes, etc?",
            "O biden é 3 anos mais velho que o Trump. Depende de pessoa pra pessoa, mas o Biden claramante não tem mais condições.",
            "A cara do Trump quando o Biden tava com o Pentium travando kkkkkkkk",
            "Biden é apenas 3 anos mais velho que Trump. O problema é que ele está claramente senil.",
            "Obviamente, desde que o velho caduca virou presidente da pra perceber que alguem ou um grupo ta por trás dando ordens...\n\nBiden deve ser o cara mais feliz do mundo, acordando de manhã e descobrindo que é presidente.",
            "Que cagada dos democratas, a insistência no tio Paulo é o mesmo que entregar a eleicao para o orange.",
            "os americanos comentando isso na internet lkkkkkkk\n\nNa moral, tenho dó do povo com esses dois palhaços"
        ]
    },
    "A pessoa que votou no Lula automáticamente respondeu sim a essa pergunta.": {
        "title": "A pessoa que votou no Lula automáticamente respondeu sim a essa pergunta.",
        "score": 81,
        "url": "https://v.redd.it/27ethptnnd9d1",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Para fazer download do vídeo, utilize qualquer um dos seguintes links:  \n**[RedditSave](https://redditsave.com/info?url=https://www.reddit.com/r/brasilivre/comments/1dqu9hs/a_pessoa_que_votou_no_lula_automáticamente/)** | **[ReddLoader](https://reddloader.com/download-post/?url=https://www.reddit.com/r/brasilivre/comments/1dqu9hs/a_pessoa_que_votou_no_lula_automáticamente/&id=b2ea0726)** | **[RedditWatch](https://www.reddit.watch/r/brasilivre/comments/1dqu9hs/?utm_source=automod&utm_medium=brasilivre)** | **[Viddit.red](https://viddit.red/?url=https://www.reddit.com/r/brasilivre/comments/1dqu9hs/a_pessoa_que_votou_no_lula_automáticamente/)** | **[RedditVideoDL](https://redditvideodl.com/dl.php?url=https://www.reddit.com/r/brasilivre/comments/1dqu9hs/a_pessoa_que_votou_no_lula_automáticamente/)** | **[SaveMP4](https://savemp4.red/?url=https://www.reddit.com/r/brasilivre/comments/1dqu9hs/a_pessoa_que_votou_no_lula_automáticamente/)**  \n^(*Os sites listados acima são de terceiros. Tenha atenção ao utilizá-los para não clicar acidentalmente em anúncios.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/brasilivre) if you have any questions or concerns.*",
            "A mina do cabelo turquesa tava quase tendo um AVC",
            "Vou ser advogado \"do mal\" aqui.\n\nDois casos totalmente diferentes.\n\nUm foi devido á tecnicalidade. Tem provas e mais provas extremamente contundentes do que foi feito. Problema de jurisdição é uma merda mesmo e dá nisso.\n\nO outro caso foi pq o processo inteiro não estava seguindo os preceitos básicos da Justiça. O Juiz estava cooperando com a acusação e não tinham interesse em um processo \"justo\". Aí ele não foi \"inocentado\" mas o aquele processo foi anulado e o crime prescreveu antes que outro pudesse ser montado.\n\nUma merda mesmo, esse negócio de prescrever certos crimes não sei se concordo não, ainda mais pra corrupção.\n\nQuando deu a Vaza Jato tbm acabou ali qualquer tipo de autenticidade daquele processo. Qualquer Corte Internacional que se preze iria descartar o processo só por princípio.\n\nMas a vdd é que quase ninguém liga pra porra nenhuma de lei, de justiça. A maioria aqui no sub nem concorda com um monte de leis que o Brasil tem, então não vale a pena argumentar essa parte.\n\nO negócio é que, muito provavelmente, o Lula cometeu crimes sim, mas a turma que foi acusar simplesmente não conseguiu montar o processo pra deixar preso. (Só ver as coisas meio ridículas que falavam) E tbm foram pegos ilegalmente combinando processo.\n\nMuitas das provas dependem de delação. Prova técnica mesmo tem poucas e qualquer advogado acima da média bota em dúvida razoável(O Lula liso que é, tava dando voltas nos caras durante o julgamento). Então naquele caso em específico não dá pra afirmar *juridicamente* que crimes foram cometidos.\n\n\"Ah mas foi condenado em outras instâncias.\" Sim, mas pela lei brasileira, isso não é suficiente, pq tem que fazer o trânsito em julgado completo, ou seja todas as apelações e afins.\n\nA parte que vazou completamente que o Juiz e os promotores estavam conversando em segredo pra dar um resultado específico fodeu qualquer tipo de resultado que incluíse aquele julgamente.\n\nE vou falar outra coisa, tem um pessoal que odeia o Xandão, mas se ele tivesse usado das carteiradas pra manter o Lula preso, por mais inconstitucional e forçado que fosse. Iria ser herói nacional pra esse sub. E pra turma que tá indo pro Tio Sam reclamar não iriam estar indo lá. Mas a outra turma iria.\n\nNinguém quer Justiça mesmo, pessoal nem acredita na Lei Brasileira, pessoal quer certas pessoas presas e certas pessoas soltas, só depende do lado que você pergunta pra especificar quem.\n\nEsse Juripositivismo falso aí me cansa. Principalmente pq pro político de estimação pessoal se faz de tonto. Diminui crime que se fosse pra outro político deveria dar cadeia.\n\nPS: Pra mim o centro do problema é que o Brasileiro em média não tem muita fé nas Instituições, e aí quando dá um resultado que não concordam, tem zero confiança de que foi \"justo\". E sinceramente, não culpo não. Bostil é complicado tankar.",
            "Essa pergunta não importa fundamentalmente... o que improta pra diferenciar os casos é como foram obtidas as provas e se foi julgada suspeição do juiz. Realmente a tecnicalidade de local pouco importa",
            "Kkk que apresentador chato\n\nBom, sim, pessoas cometem crimes e são inocentadas por conta de tecnicalidades. É assim que funciona quando todos são iguais perante a lei. É revoltante, é demais, mas é assim que o devido processo legal é.\n\nSe a defesa provar que a prova chave de um estupro foi obtida ilegalmente, foi julgado errado ou o juiz foi imparcial então o estuprador é \"\"inocentado\"\".",
            "A sentença contra o Lula foi ratificada por tribunais colegiados, incluindo o STJ em Brasília, então não havia problema no processo, estava tudo correndo como deveria ser, o processo foi anulado porque correu na vara errada, e é bom lembrar que o tribunal colegiado TRF4 *avalia culpa*, ou seja, mesmo que o juiz de 1ª instância seja suspeito, o colegiado do TRF4 avaliou as provas e os argumentos e concordou com a culpa. \n\nPORÉM, o problema real é que os advogados do Lula estavam há vários anos pedindo anulação por correr na vara errada, eles pediram isso dezenas e mais dezenas de vezes, inclusive o STF julgou que a vara era competente uma vez, mas pouco tempo antes do crime prescrever, por algum motivo misterioso, o STF re-julgou a competência da vara e decidiu que não era mais competente, a suspeição do Moro veio depois. \n\nA morte de Teori Zavaschi foi o que enterrou a lava-jato e começou a onda de \"reescrever a história\" que nós vivemos agora, na qual o Brasil cria insegurança jurídica internacional ao inocentar todos os corruptos, muitos confessos e com milhares de páginas do processo dedicadas a provas materiais (1 dos processos do Lula tinha pouco mais de 700 páginas só em provas materiais), enquanto esses mesmos corruptos são processados no exterior pelos mesmos crimes.",
            ">O outro caso foi pq o processo inteiro não estava seguindo os preceitos básicos da Justiça. O Juiz estava cooperando com a acusação e não tinham interesse em um processo \"justo\". Aí ele não foi \"inocentado\" mas o aquele processo foi anulado e o crime prescreveu antes que outro pudesse ser montado.\n\nA anulação da condenação não se deu por isso. A anulação se deu pelo fato do STF ter descoberto, milagrosamente, faltando poucos meses para ocorrer a prescrição - apesar da defesa do Lula ter passado o processo inteiro alegando incompetência da Vara de Curitiba, que Lula deveria ter sido julgado em Brasília, e não na capital do Paraná. Sim, a condenação de Lula não foi anulada por conta de parcialidade de Moro, mas sim, pelo famoso \"erro de CEP\". O julgamento da parcialidade de Moro só ocorreu depois da anulação do processo.\n\nNo mais, sempre é preciso destacar que a sentença de Moro foi confirmada  por unanimidade no TRF4 (onde Lula teve a pena aumentada), e também foi confirmada  de forma unânime no STJ (Tribunal que analisou profundamente as questões processuais e formais). Além do mais,  Lula não ganhava nada no STF, nem mesmo os mais de 70 Habeas Corpus impetrados no Tribunal.\n\nPorém, algumas coisas ocorreram, que fizeram com que o STF perdesse a boa vontade com a lava-jato (e o combate à corrupção). Essas coisas foram a eleição de Bolsonaro e a operação chegando no amigo do amigo do meu pai.\n\nEu, pessoalmente, entendo que não faz sentido que uma pessoa comum se paute pelas questões processuais e formais da justiça. Ora, Lula foi \"descondenado\" pela Justiça analisando unicamente questões formais, isso faz com que sua ficha criminal fique limpa.  Porém, materialmente falando, nada que foi provado contra ele foi derrubado. E ISSO QUE DEVERIA IMPORTAR PARA O ELEITOR.\n\nExatamente por essa razão os dois exemplos citados no vídeo estão em pé de igualdade: Havia materialidade pesada no caso do Lula e no caso do estuprador (pesa contra o Lula o fato de ter sido condenado em todas as instÂncias), porém ambos foram absolvidos porque a justiça não observou procedimentos formais que deveriam ter observados.\n\nPor isso, em sã consciência, pela mesma razão que ninguém levaria sua mulher ou filha para ser anestesiada por esse médico estuprador; ninguém deveria votar em um condenado por corrupção passiva e lavagem de dinheiro pra ser Presidente da República.",
            "pqp.\n\ntldr: Faça o L.",
            "Não foi por causa disso…",
            "Corretíssimo. Especialmente no PS. Vivemos a política da criança de 4 anos que perdeu no uno e portanto o baralho é viciado."
        ]
    }
}