{
    "ATENÇÃO! IMPORTANTE!": {
        "title": "ATENÇÃO! IMPORTANTE!",
        "score": 125,
        "url": "https://www.reddit.com/r/brasilivre/comments/1993ynz/atenção_importante/",
        "content": "O usuário que fizer posts falando sobre outros subreddit, seja pra reclamar da moderação stalinista, seja pra se gabar de ter sido banido, seja desafiando outros a postarem algo em determinada comunidade, receberá PERMABAN, não importa a idade e karma da conta.\n\nIsso é sério, não é uma pegadinha. \n\nMotivo? É a vontade dos admins e isso basta. \n\nSe você gosta do sub, não comente sobre outros subreddits neste espaço ou terá sua conta permabanida daqui. Não importa se em outros subreddits é normal falarem de outros subs, aqui não nos é permitido!\n\nObrigado.\n\nEDIT: Para quem ainda não sabe, \"admins\" são funcionários da própria plataforma Reddit. Não confundam admins com os mods do sub.",
        "num_comments": 182,
        "comments": [
            "Deixo um apelo  razo aos mods: um permaban pode ser um pouco exagerado. Pode muito bem acontecer de algum ser banido de outra comunidade e na hora da raiva vir aqui postar sem ver a regra, ou no entendendo o quo estrita ela , e acabar sendo banido das duas.\n\nO tratamento no precisa ser entre a juiza do cafezinho e a juiza do diga-vossa-excelncia. O caminho do meio pode ser o melhor.",
            "N da pra tankar o bostil nem quando  livre",
            "Pode falar que o mod  gordo e fede?",
            "Hora de vazar do reddit ",
            "Muda o nome do sub pra Brasil meio livre",
            "\" *~~Motivo?  a vontade dos admins e isso basta.~~* \"\n\n\"A bola  minha e s pode fazer gol naquela trave ali. O motivo? Pq eu quero\".",
            "Motivo: Minha pika ta mole.",
            "Ainda posso chamar os mods desse proprio sub de corno?",
            "\\>  a vontade dos admins e isso basta.\n\nImagino o que deva ser viver sob o Hamas.",
            "Que pena, me sentia razoavelmente livre aqui.. infelizmente estamos perdendo a liberdade, cada vez mais.  assim que se criam foras hegemonicas de controle populacional. Fico triste que os moderadores tenham cedido a isso, na minha opinio eles cederam seus princpios."
        ]
    },
    "O tal apito de cachorro que só os cachorros vêem. ": {
        "title": "O tal apito de cachorro que só os cachorros vêem. ",
        "score": 66,
        "url": "https://i.redd.it/cd8efqnxsi9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Esse double standard  proposital para enlouquecer os sos. Um *litmus test* para ver se algum ainda pensa por conta prpria.  ilgico esperar lgica dessa gente.",
            "Essa vtima da sociedade a ainda tinha que ter uma tatuagem do Flamengo, a pegou pesado kkkkkkkkkkk",
            "Julgar uma pessoa pela cor  realmente errado e burrice, o sujeito do primeiro quadrinho est sendo julgado pela aparncia e adereos, no pela cor. Um branquelo com estes adereos seria julgado como bandido, um nego de terno surrado com uma Bblia debaixo do brao no seria.",
            "O primeiro  bandido e o segundo  um tonto que fica inventando simbolismo pra pistolar os esquerdinhas.\n\nPor qual razo algum tomaria leite a plena mostra e cerimoniosamente numa live, seno pra trollar esquerdista ou pra paudurecer tarado com fetiche esquisito?",
            "Eu sei que parece loucura o que eu vou falar mas e SE:\n\nOs dois forem ruins? Pensem fora da caixinha da falsa dicotomia.",
            "Beber leite = nazismo \n\nSubir um morro controlado pelo trfico sem nenhuma fora armada onde pessoas morrem somente pelo waze ter jogado elas nesse caminho = amor ",
            ">Por qual razo algum tomaria leite a plena mostra e cerimoniosamente numa live, seno pra trollar esquerdista ou pra paudurecer tarado com fetiche esquisito?\n\n isso. No tem sentido nenhum.",
            "Dois o que?"
        ]
    },
    "Vai um sorvete ai?": {
        "title": "Vai um sorvete ai?",
        "score": 62,
        "url": "https://i.redd.it/gxnsipl1mh9d1.png",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Engraado, descobriram s agora que o Biden t com p na cova, coisa que vem sendo apontado desde a ltima eleio. Agora no tem mais como esconder n ?",
            "Tiveram quatro anos para pensar em uma alternativa, \"no acharam\" e agora vo querer mudar em cima da hora.",
            "O veio t muito gag kkkkkkk",
            "Isso  muito ruim na real, se trocarem o bid por outro, a campanha do trump comea a ficar mais difcil",
            "At d esperana de que um dia a esquerda daqui vai largar o osso do Lula, sem termos de esperar ele morrer.",
            "Os democratas esto em pnico, mas no vo fazer merda nenhuma.\n\nEssa mesma revista cu de vaca fez uma capa lambendo o Lula antes da eleio.\n\nEssa revista de merda no vale absolutamente nada.\n\nVai l ver quem foi o \"homem do ano\" para a Time em 1938.",
            "Entao Mr. Bernioff um dos maiores doadores dos democratas ja nao quer o Biden.\n\nLembra muito Animal Farm quando os porcos levam o cavalo para o abatedouro pq estava velho e cansado.\n\nEsquerda so quer poder poder poder , passam por cima de qualquer um.",
            "A propaganda/conteno de danos t no mximo. \n\nOntem apareceu um artigo nuns subs aqui dizendo que os indecisos agora vo votar no bid. \n\nT bom",
            "Vai ser defenestrado depois da eleio em favor da Kamala Harris.\n\nAcho que esse  o clculo.\n\nMuito americano prefere votar num cadver que no Trump mesmo assim. Os democratas esto torcendo para que isto seja uma maioria, mas acho que esto errados.",
            "Bid no ser trocado."
        ]
    },
    "O que dá para comprar com 295.11zł (68.40€) na Polônia!": {
        "title": "O que dá para comprar com 295.11zł (68.40€) na Polônia!",
        "score": 30,
        "url": "https://i.redd.it/zc82jekvhi9d1.png",
        "content": "Salário médio de 4.000 zl por mês.",
        "num_comments": 16,
        "comments": [
            "Cara, eu devia ter tirado foto das compras de mercado no Japo. O negcio era insano.",
            "Ah eu moro aqui na Polnia. O salrio mnimo  4300 zl e quem trabalha nesse mercado (Lidl) ganha 5300 zl no caixa.",
            "E s de olhar para os alimentos, a gente v que so coisas de qualidade, com certeza aqui sairia duas ou trs vezes mais caro.",
            "Supermercado em geral  mais barato na Europa, comparando o poder de compra de um brasileiro e um europeu com salrio mdio.",
            "Aqui custa 68 s os dois pedaos de carne de mais qualidade que voc comprou kkkkk",
            " melhor colocar o valor na moeda local que  o zloty polons e atualmente  4300zl ou 5,975.93reais, mas  o cmbio muda um pouquinho, mas aqui a gente s ganha em zloty e fazemos a conta assim :)))\n\nporque no  exatamente como ganhar 5900 no Brasil. Principalmente se eu pago 1.30 zl no kg da farinha de trigo, 3zl no litro do leite, 28zl no kg de um queijo de qualidade boa etc.",
            "OP, o salrio mdio no  4000! Isso est abaixo do salrio mnimo da Polnia. Salrio mdio deve ser entre 7500 e 8500zl, no lembro agora.",
            "*Mais barato no leste europeu, Europa ocidental  muito caro",
            "Eu gasto por volta de 800zl em comida por ms, vou pra academia, fao natao, ando de bicicleta, ento como pra cacete.",
            " difcil imigrar legalmente para a Polnia?"
        ]
    },
    "Giro X - Eles juram que é uma democracia 🤡 / Constituição se cumpre, não se interpreta... Demôniocracia a todo vapor galera ihuuu / Julho terá bandeira tarifária amarela ": {
        "title": "Giro X - Eles juram que é uma democracia 🤡 / Constituição se cumpre, não se interpreta... Demôniocracia a todo vapor galera ihuuu / Julho terá bandeira tarifária amarela ",
        "score": 13,
        "url": "https://www.reddit.com/gallery/1drd18i",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Acusao ridcula a parte (Ronaldo devia processar), ningum percebe que isso  uma tentativa obvia de cancelar um concorrente direto dele e do irmo?",
            "Eu venho falando sobre o ensino da Bblia/Tor/Coro em escolas h anos em meu crculo pessoal.\n\n inadmissvel o cidado mdio no ter noo da histria desses livros. No precisa entrar em uma s linha da mensagem, mas a historiografia deveria ser conhecimento comum.",
            " um bom ponto"
        ]
    }
}