{
    "ATENÇÃO! IMPORTANTE!": {
        "title": "ATENÇÃO! IMPORTANTE!",
        "score": 125,
        "url": "https://www.reddit.com/r/brasilivre/comments/1993ynz/atenção_importante/",
        "content": "O usuário que fizer posts falando sobre outros subreddit, seja pra reclamar da moderação stalinista, seja pra se gabar de ter sido banido, seja desafiando outros a postarem algo em determinada comunidade, receberá PERMABAN, não importa a idade e karma da conta.\n\nIsso é sério, não é uma pegadinha. \n\nMotivo? É a vontade dos admins e isso basta. \n\nSe você gosta do sub, não comente sobre outros subreddits neste espaço ou terá sua conta permabanida daqui. Não importa se em outros subreddits é normal falarem de outros subs, aqui não nos é permitido!\n\nObrigado.\n\nEDIT: Para quem ainda não sabe, \"admins\" são funcionários da própria plataforma Reddit. Não confundam admins com os mods do sub.",
        "num_comments": 182,
        "comments": [
            "Deixo um apelo à razão aos mods: um permaban pode ser um pouco exagerado. Pode muito bem acontecer de alguém ser banido de outra comunidade e na hora da raiva vir aqui postar sem ver a regra, ou não entendendo o quão estrita ela é, e acabar sendo banido das duas.\n\nO tratamento não precisa ser entre a juiza do cafezinho e a juiza do diga-vossa-excelência. O caminho do meio pode ser o melhor.",
            "N da pra tankar o bostil nem quando é livre",
            "Pode falar que o mod é gordo e fede?",
            "Hora de vazar do reddit 😁",
            "Muda o nome do sub pra Brasil meio livre",
            "\" *~~Motivo? É a vontade dos admins e isso basta.~~* \"\n\n\"A bola é minha e só pode fazer gol naquela trave ali. O motivo? Pq eu quero\".",
            "Motivo: Minha pika ta mole.",
            "Ainda posso chamar os mods desse proprio sub de corno?",
            "\\> É a vontade dos admins e isso basta.\n\nImagino o que deva ser viver sob o Hamas.",
            "Que pena, me sentia razoavelmente livre aqui.. infelizmente estamos perdendo a liberdade, cada vez mais. É assim que se criam forças hegemonicas de controle populacional. Fico triste que os moderadores tenham cedido a isso, na minha opinião eles cederam seus princípios."
        ]
    },
    "O tal apito de cachorro que só os cachorros vêem. ": {
        "title": "O tal apito de cachorro que só os cachorros vêem. ",
        "score": 66,
        "url": "https://i.redd.it/cd8efqnxsi9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Esse double standard é proposital para enlouquecer os sãos. Um *litmus test* para ver se alguém ainda pensa por conta própria. É ilógico esperar lógica dessa gente.",
            "Essa “vítima da sociedade” aí ainda tinha que ter uma tatuagem do Flamengo, aí pegou pesado kkkkkkkkkkk",
            "Julgar uma pessoa pela cor é realmente errado e burrice, o sujeito do primeiro quadrinho está sendo julgado pela aparência e adereços, não pela cor. Um branquelo com estes adereços seria julgado como bandido, um negão de terno surrado com uma Bíblia debaixo do braço não seria.",
            "O primeiro é bandido e o segundo é um tonto que fica inventando simbolismo pra pistolar os esquerdinhas.\n\nPor qual razão alguém tomaria leite a plena mostra e cerimoniosamente numa live, senão pra trollar esquerdista ou pra paudurecer tarado com fetiche esquisito?",
            "Eu sei que parece loucura o que eu vou falar mas e SE:\n\nOs dois forem ruins? Pensem fora da caixinha da falsa dicotomia.",
            "Beber leite = nazismo \n\nSubir um morro controlado pelo tráfico sem nenhuma força armada onde pessoas morrem somente pelo waze ter jogado elas nesse caminho = amor 🥰",
            ">Por qual razão alguém tomaria leite a plena mostra e cerimoniosamente numa live, senão pra trollar esquerdista ou pra paudurecer tarado com fetiche esquisito?\n\nÉ isso. Não tem sentido nenhum.",
            "Dois o que?"
        ]
    },
    "Vai um sorvete ai?": {
        "title": "Vai um sorvete ai?",
        "score": 62,
        "url": "https://i.redd.it/gxnsipl1mh9d1.png",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Engraçado, descobriram só agora que o Biden tá com pé na cova, coisa que vem sendo apontado desde a última eleição. Agora não tem mais como esconder né ?",
            "Tiveram quatro anos para pensar em uma alternativa, \"não acharam\" e agora vão querer mudar em cima da hora.",
            "O veio tá muito gagá kkkkkkk",
            "Isso é muito ruim na real, se trocarem o bidê por outro, a campanha do trump começa a ficar mais difícil",
            "Até dá esperança de que um dia a esquerda daqui vai largar o osso do Lula, sem termos de esperar ele morrer.",
            "Os democratas estão em pânico, mas não vão fazer merda nenhuma.\n\nEssa mesma revista cu de vaca fez uma capa lambendo o Lula antes da eleição.\n\nEssa revista de merda não vale absolutamente nada.\n\nVai lá ver quem foi o \"homem do ano\" para a Time em 1938.",
            "Entao Mr. Bernioff um dos maiores doadores dos democratas ja nao quer o Biden.\n\nLembra muito Animal Farm quando os porcos levam o cavalo para o abatedouro pq estava velho e cansado.\n\nEsquerda so quer poder poder poder , passam por cima de qualquer um.",
            "A propaganda/contenção de danos tá no máximo. \n\nOntem apareceu um “artigo” nuns subs aqui dizendo que os indecisos agora vão votar no bidê. \n\nTá bom…",
            "Vai ser defenestrado depois da eleição em favor da Kamala Harris.\n\nAcho que esse é o cálculo.\n\nMuito americano prefere votar num cadáver que no Trump mesmo assim. Os democratas estão torcendo para que isto seja uma maioria, mas acho que estão errados.",
            "BidÊ não será trocado."
        ]
    },
    "O que dá para comprar com 295.11zł (68.40€) na Polônia!": {
        "title": "O que dá para comprar com 295.11zł (68.40€) na Polônia!",
        "score": 30,
        "url": "https://i.redd.it/zc82jekvhi9d1.png",
        "content": "Salário médio de 4.000 zl por mês.",
        "num_comments": 16,
        "comments": [
            "Cara, eu devia ter tirado foto das compras de mercado no Japão. O negócio era insano.",
            "Ah eu moro aqui na Polônia. O salário mínimo é 4300 zl e quem trabalha nesse mercado (Lidl) ganha 5300 zl no caixa.",
            "E só de olhar para os alimentos, a gente vê que são coisas de qualidade, com certeza aqui sairia duas ou três vezes mais caro.",
            "Supermercado em geral é mais barato na Europa, comparando o poder de compra de um brasileiro e um europeu com salário médio.",
            "Aqui custa 68 só os dois pedaços de carne de mais qualidade que você comprou kkkkk",
            "É melhor colocar o valor na moeda local que é o zloty polonês e atualmente é 4300zl ou 5,975.93 reais, mas  o câmbio muda um pouquinho, mas aqui a gente só ganha em zloty e fazemos a conta assim :)))\n\nporque não é exatamente como ganhar 5900 no Brasil. Principalmente se eu pago 1.30 zl no kg da farinha de trigo, 3zl no litro do leite, 28zl no kg de um queijo de qualidade boa etc.",
            "OP, o salário médio não é 4000! Isso está abaixo do salário mínimo da Polônia. Salário médio deve ser entre 7500 e 8500zl, não lembro agora.",
            "*Mais barato no leste europeu, Europa ocidental é muito caro",
            "Eu gasto por volta de 800zl em comida por mês, vou pra academia, faço natação, ando de bicicleta, então como pra cacete.",
            "É difícil imigrar legalmente para a Polônia?"
        ]
    },
    "Giro X - Eles juram que é uma democracia 🤡 / Constituição se cumpre, não se interpreta... Demôniocracia a todo vapor galera ihuuu / Julho terá bandeira tarifária amarela ": {
        "title": "Giro X - Eles juram que é uma democracia 🤡 / Constituição se cumpre, não se interpreta... Demôniocracia a todo vapor galera ihuuu / Julho terá bandeira tarifária amarela ",
        "score": 13,
        "url": "https://www.reddit.com/gallery/1drd18i",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Acusação ridícula a parte (Ronaldo devia processar), ninguém percebe que isso é uma tentativa obvia de cancelar um concorrente direto dele e do irmão?",
            "Eu venho falando sobre o ensino da Bíblia/Torá/Corão em escolas há anos em meu círculo pessoal.\n\nÉ inadmissível o cidadão médio não ter noção da história desses livros. Não precisa entrar em uma só linha da mensagem, mas a historiografia deveria ser conhecimento comum.",
            "É um bom ponto"
        ]
    }
}