{
    "Weekly Episode Threads - Sunday through Thursday": {
        "title": "Weekly Episode Threads - Sunday through Thursday",
        "score": 8,
        "url": "https://www.reddit.com/r/BravoRealHousewives/comments/1dmxhre/weekly_episode_threads_sunday_through_thursday/",
        "content": "Here are all of the shows for the week! Previous weeks can be found in my history.\n\nPlease don't ask us to pin certain threads. With only two pinned threads allowed at any given time, this thread should serve as a way to find all of the pertinent live, post, and weekly threads in one place.\n\nSunday Shows:\n\n[The Real Housewives Of New Jersey - Live Episode Discussion](https://www.reddit.com/r/BravoRealHousewives/s/SsrJALscby)\n\n[The Real Housewives Of New Jersey - Post Episode Discussion](https://www.reddit.com/r/BravoRealHousewives/s/EWv9EnLeC8)\n\n[The Real Housewives Of New Jersey - Weekly Episode Discussion](https://www.reddit.com/r/BravoRealHousewives/s/TwulRae8Dz)\n\n[Watch What Happens Live with Andy Cohen](https://www.reddit.com/r/BravoRealHousewives/s/I9Av7p1g5v)\n\nMonday Shows:\n\n[Below Deck Mediterranean - Live Episode Discussion](https://www.reddit.com/r/BravoRealHousewives/s/H9RFI5ruRF)\n\n[Below DeckMediterranean  - Weekly Episode Discussion](https://www.reddit.com/r/BravoRealHousewives/comments/1do39jb/below_deck_mediterranean_season_9_episode_4/)\n\n[Watch What Happens Live with Andy Cohen](https://www.reddit.com/r/BravoRealHousewives/s/SO8epXzzjb)\n\nTuesday Shows:\n\n[The Real Housewives of Dubai - Live Episode Discussion](https://www.reddit.com/r/BravoRealHousewives/comments/1dokt4q/the_real_housewives_of_dubai_season_2_episode_4/)\n\n[The Real Housewives of Dubai - Post Episode Discussion](https://www.reddit.com/r/BravoRealHousewives/s/J62v8oYTld)\n\n[The Real Housewives of Dubai - Weekly Episode Discussion](https://www.reddit.com/r/BravoRealHousewives/s/tFncwtgsl6)\n\n[Watch What Happens Live with Andy Cohen](https://www.reddit.com/r/BravoRealHousewives/s/bm02N1I4k9)\n\nWednesday Shows:\n\n[Watch What Happens Live with Andy Cohen](https://www.reddit.com/r/BravoRealHousewives/s/png71TNLoj)\n\nThursday Shows:\n\n[Watch What Happens Live with Andy Cohen](https://www.reddit.com/r/BravoRealHousewives/s/oDeaLiAhOu)",
        "num_comments": 6,
        "comments": [
            "Is there no jersey thread yet or am I just an idiot",
            "Is this old? Summer house is over",
            "I don’t see it either yet, hopefully u/amandatoryy can post soon!",
            "There’s a glitch where I can’t edit anything scheduled until it goes live. It’s a mess, I’ll remove SH. I’m having to post everything live and delete all the scheduled stuff.",
            "https://www.reddit.com/r/BravoRealHousewives/s/SsrJALscby",
            "https://www.reddit.com/r/BravoRealHousewives/s/SsrJALscby"
        ]
    },
    "Let’s be real, the downfall of Housewives was when these ladies left": {
        "title": "Let’s be real, the downfall of Housewives was when these ladies left",
        "score": 1028,
        "url": "https://www.reddit.com/gallery/1dqxiwv",
        "content": "\n",
        "num_comments": 165,
        "comments": [
            "The downfall of housewives was social media and GIFs! \n\nHousewives was great, TRULY great, when folks weren’t worried about going viral, becoming a meme, or interested in becoming GIFable.",
            "I still stand by the fact that housewives hasn’t been the same since Erica fucking Girardi introduced all the housewives to “glam”.",
            "No, it’s when these ladies got so big for their britches that they thought they *were* the show and became no fun to watch. \n\nVicki and Nene especially were torturous to watch in the final few seasons they were around.",
            "The downfall was social media and parasocials getting involved! The podcasters, Jeff Lewis  etc. \n\nlike why as a podcaster are you team Ariana or team Theresa and pushing storylines???",
            "I only agree about Nene. After all this time she's the one that lives rent free in my head. I always feel so sad that she doesn't get paid per meme, because that would be one hellofa Trump Check.",
            "I hate to admit it bc I'm not a Monique fan, but when Monique left Potomac too",
            "Who is the second one?",
            "Hard disagree agree about Vicki, she was the worst",
            "Nene, yes. Bethenny, maybe, the blondes were already getting played out. The other two leaving didn't change things for the worse imo. Vicki NEEDED to be checked with her firing and S15/16 would've still had problems with her there. LVP's leaving got us Garcelle/Sutton which in my opinion have been way better than latter seasons LVP.",
            "We didn’t mildly made up story lines. The problem was when they went overboard."
        ]
    },
    "Garcelle is going to be getting a granddaughter!": {
        "title": "Garcelle is going to be getting a granddaughter!",
        "score": 522,
        "url": "https://i.redd.it/v1xsm81nid9d1.jpeg",
        "content": "Looks like Oliver is having his second baby! ",
        "num_comments": 141,
        "comments": [
            "I don’t know how people handle multiple baby daddies/ baby mommas I can barely water my one plant",
            "Is this with his wife or someone else?",
            "I imagine Garcelle thanks God every night she didn’t lose Oliver to drugs. The situation isn’t ideal but that baby will be loved and spoiled (especially by Gma Garcelle).",
            "I’m not feeling him after I read about how he did his wife. He reminds me of that Jeremy Meeks dude “Hot Felon” who was married and his wife stuck by him while he was incarcerated, paying for everything and taking care of their kid; and, as soon as he got an opportunity to make some real money and fame, he dropped her like a bad habit. \n\nMoral of the story, don’t ever take care of a man financially; every single woman I know that has was NEVER met with the same energy in return. No loyalty whatsoever, these men are for the streets.",
            "Hot take: Oliver is not cute, and the face tattoo makes him look worse.",
            "Ugh ew. Wild that his first wife had 3 kids before him, then the one they had together. And this woman has 2 kids already and now a third with him. Seems so chaotic and messy. Maybe that’s just me!",
            "Is Lala the mom? I kid. I kid.",
            "he is messyyyyy but i’m happy for garcelle hahahaha",
            "Oliver may be messy AF, but I’m happy for Garcelle!",
            "His baby mama is a baddie omg"
        ]
    },
    "There's only one person for the job.": {
        "title": "There's only one person for the job.",
        "score": 808,
        "url": "https://i.redd.it/5zj58q7krc9d1.png",
        "content": "",
        "num_comments": 37,
        "comments": [
            "“These men couldn’t lead their way out of a paper bag”",
            "I’m absolutely gobsmacked. Give me your keys. I’m taking ovah. \n\nI’m on the final season of Tabatha now and I miss her so much.",
            "Presidents don't act alone.  When you vote for president, you are really voting for the political party, not solely the man.  The only two choices are Democrats and Republicans.  To figure out who to vote for, you have to look at the platforms, policies, congressional votes, bills proposed, bills passed, executive orders and initiatives.  Depending on who you are, it should be clear who to vote for and it's not even close.",
            "We need her now more than ever 🇺🇸",
            "Show her the break rooms.",
            "I would be down for this.",
            "Facts that debate was embarrassing. They were arguing like petulant children.",
            "Producer James! Honestly I wish haha",
            "Been watching all of her old shows on Peacock and they’re just as good the second time!",
            "Where are you watching it?"
        ]
    },
    "In case anyone was wondering about Amir’s relationship status…": {
        "title": "In case anyone was wondering about Amir’s relationship status…",
        "score": 183,
        "url": "https://www.reddit.com/gallery/1dqz0sf",
        "content": "",
        "num_comments": 99,
        "comments": [
            "TG were not gonna have to see this play out next spring.",
            "That’s a mess. Have fun in the sunken place",
            "She bought the ring and told him they engaged now",
            "She makes more in a month than he does in a year, so I hope he refuses to sign a prenup.",
            "Her desire to be famous with no personality is so cringe. She doesn't even look happy in this picture. She looks like she is trying to get the perfect picture for instagram.",
            "Ohhh I'm sure this will end well!\n\n![gif](giphy|xgKtjrHWCsQlwPymxc)",
            "Well too bad the show was canceled. Maybe she’s playing the long con.",
            "She’ll prob make him sign a prenup because she makes so much more than him lmao",
            "I took the viewers voice quiz about Martha’s Vineyard the other day and they kept asking if I wanted to see more of Natalie and I said NO! NOOOOOOOOOO! Absolutely NOT!!!",
            "I’d rather have Silas and the baby than this girl on my screen."
        ]
    }
}