{
    "Com dúvidas? Não sabe que faculdade fazer? Leia este post antes de postar no r/brdev": {
        "title": "Com dúvidas? Não sabe que faculdade fazer? Leia este post antes de postar no r/brdev",
        "score": 9,
        "url": "https://www.reddit.com/r/brdev/comments/1doy1oy/com_dúvidas_não_sabe_que_faculdade_fazer_leia/",
        "content": "Olá!\n\nEste post fixado tem como propósito:\n\n* Compartilhar conhecimentos existentes - a maior qualidade de alguém em TI é saber ler, interpretar, e pesquisar\n\n* Dar espaço para dúvidas para quem ainda não é da área, mas quer fazer um curso ou faculdade, ou até a transição de carreira\n\n* Dar espaço para quem tem dúvidas recorrentes\n\nA nossa wiki ([Link](https://www.reddit.com/r/brdev/wiki/novatos)) tem uma lista de perguntas e respostas frequentes. **Sugerimos fortemente que leia a wiki**, lendo os links relevantes às suas dúvidas.\n\nNão proibimos questões repetidas no subreddit, mas pedimos que dê o contexto ou o motivo de fazê-la. Por outro lado, **perguntas sobre faculdade e curso devem ser feitas aqui**, neste post fixado.\n\n[Link na wiki](https://www.reddit.com/r/brdev/wiki/novatos).",
        "num_comments": 2,
        "comments": [
            "Algum aqui j cursou defesa ciberntica na fiap e/ou tem opinio a respeito?",
            "Algum j fez ps graduao EAD em engenharia de software na PUC MG? Vale a pena?"
        ]
    },
    "Mercado dev virou uma zona ou sempre foi?": {
        "title": "Mercado dev virou uma zona ou sempre foi?",
        "score": 30,
        "url": "https://www.reddit.com/r/brdev/comments/1dr17lm/mercado_dev_virou_uma_zona_ou_sempre_foi/",
        "content": "Olá pessoal, estou precisando da opinião de vcs sobre uma situação que estou passando no meu atual trabalho.\n\nAtualmente estou como backend senior em uma grande empresa do setor financeiro. Meu salário é 9.5k bruto CLT com alguns benefícios (VA/VR, plano de saude etc). Não acho minha remuneração ruim, porém, estou trabalhando na seguinte situação:\n\n- estou trabalhando com outros dev's que não fazem a menor ideia do que estão fazendo, tem uma pessoa na equipe que não sabe oq é um cURL.\n\n- codereview nem existe.\n\n- meu tech lead não tem experiência nenhuma com backend, acaba que ele me faz mil perguntas por dia, como se eu fosse o líder e ele o liderado.\n\n- os projetos estão uma verdadeira bagunça, não tem o mínimo de código limpo, padrão de projeto, arquitetura, etc...\n\nAcaba que além de dar suporte para meu LT, eu tenho que consertar td que os outros dev's fizeram e garantir que eles não estraguem mais nd.\n\nNão é a primeira vez que trabalho num ambiente assim, queria a opinião de vcs\n\n- estou sendo mal remunerado?\n\n- o mercado de dev é isso mesmo? Existe empresa onde todos os desenvolvedores sabem o básico p/ criar um software com qualidade e o mínimo de organização?\n\n\nobs. tenho 9 anos de exp. No início da minha carreira tive o privilegio de trabalhar em uma equipe/projeto muito organizado, vi coisas como solid, tdd, ddd, funcionar na prática, porém parece q nunca mais vou encontrar algo próximo disso.",
        "num_comments": 50,
        "comments": [
            "1) Depende do tipo de banco e do esforo que voc precisa fazer, mas no acho que esteja mal remunerado. Minha remunerao  parecida.\n\n2) No comeo eu tambm me assustava com desenvolvedores no conhecerem ferramentas que todo mundo deveria conhecer. Eu j ensinei o bsico de Git para pessoas com muito mais senioridade em diversos contextos. Com o tempo eu aceitei que as pessoas geralmente s aprendem o que precisam pra fazer o trabalho e nada muito alm disso, exceto quando algum vem de fora e mostra. Sobre falta de padres e codigo ruim, isso  mais normal do que deveria.",
            "Sempre foi e voc ganha bem. Espero ter ajudado.",
            "acho bizarro no existir code review em uma grande empresa do setor financeiro. Geralmente essas empresas tem que seguir alguns padres de qualidade de cdigo por causa de algumas normas",
            "Se voc se acha to superior e especial, procure um novo emprego. Certamente vai ganhar mais e ter um novo problema. Ficar a s faz voc ficar passando raiva. \n\nSobre salrio tem que considerar o anual (plr e outros benefcios). Se voc ganha s esses 9.5k mensal  pouco, mas se ganha isso mais uma plr agressiva todo ano ento voc est bem.",
            "Tem empresas que sao zona mesmo mas nao acho q seja a regra. Sobre remunerao depende daonde voce vive, se for SP eu acho que esta mam remunerado sim",
            "Sobre sua remunerao, no  uma remunerao ruim, mas definitivamente no est adequada para um backend Sr com 9 anos de xp, principalmente pra o padro financeiro/banco/fintech.\n\nTambm sou do setor e, at onde eu sei, isso  mdia pra pleno.",
            "O problema geralmente  na seleo do pessoal. Pasme j passei em entrevista para cargo de 13 k CLT sem qualquer teste tcnico s na lbia mesmo. No meu caso eu tinha experincia boa passada mas imagino que o pessoal que trabalhou comigo no tinha e tinha uma galera muito ruim tambm. Muitas vezes grandes empresas contratam consultorias que s esto preocupadas em ganhar o deles e no esto nem a para a qualidade do servio ento contratam qualquer um.. e como o lucro deles  baseado no salrio acabam pedindo alto e contratando pessoas pouco capacitadas.",
            "Se o PLR no for alto voc est sendo muito mal remunerado.",
            "Na minha opinio seu salrio est baixo pois na verdade voc tem dois empregos na mesma empresa. Ter que servir de professor para os colegas extrapola o bom senso.",
            "Tem que procurar um trampo melhor. Muito pouco pra tanto problema."
        ]
    },
    "É meio frustrante como ler a documentação é o suficiente pra te botar acima da média": {
        "title": "É meio frustrante como ler a documentação é o suficiente pra te botar acima da média",
        "score": 302,
        "url": "https://www.reddit.com/r/brdev/comments/1dqkdgs/é_meio_frustrante_como_ler_a_documentação_é_o/",
        "content": "não vou reclamar muito porque se ganho o que ganho é porque as pessoas não fazem o mínimo, mas meu deus, porque ninguém le esse caralho",
        "num_comments": 112,
        "comments": [
            "Na verdade tem muitas docs que pra ler e entender voc tem que saber bem o bsico, quando digo bsico no  em tom de demrito  saber bem nomenclaturas e termos que so usados em docs, alm de saber ler doc, saber ler sada de erro  outra coisa que faz muita diferena tambm, e sim essas duas coisas colocam voc na frente de muita gente.",
            "No acho nada frustrante. Eu acho bom. Se todo mundo fosse bom meu salrio agora era menos da metade do que to ganhando. Deixa que seja assim e aproveite.",
            "Tem cada doc ambgua, porca que pqp",
            "Mas eu sempre falo isso pra aprender uma tecnologia nova ou linguagem nova  s ler a documentao e pronto",
            "olhar o cdigo da lib tambm costuma ajudar muito, o foda  q a maioria dos devs geralmente no faz isso, principalmente de TS, acho q pq clicar na funo s te leva pra uma tipagem que no serve pra porra nenhuma.",
            "Esse ttulo  verdadeiro mesmo fora da rea de TI",
            "No vou reclamar: segue reclamao.\n\nLgico!",
            "Tem documentao que  bem porca que voce pode vive sem com certeza(PHP), mas tem outras que voce aprende muito e  de fato referencia(Python). Assim ler a documentao  sempre uma aventura, pois ela geralmente no passa s a parte tecnica e sim a *vibe* da biblioteca, te da ideias de como ela funciona e como progredir no entendimento.\n\nAs IA ajudam sim, mas quando voce no entende nada como saber se a sua pergunta  boa para obter um boa resposta? As vezes uma pesquisa de tres palavras na pesquisa pode ser mais eficiente do que esperar a IA montar o lero lero dela.",
            "Na minha opinio saber pesquisar, navegar e entender documentao  uma das principais skills que separa um junior de um bom pleno",
            "isso eh otimo, fazendo o basico voce consegue ser melhor que a maioria!"
        ]
    },
    "Sobrevivi a uma Enchente e Perdi meu emprego.": {
        "title": "Sobrevivi a uma Enchente e Perdi meu emprego.",
        "score": 100,
        "url": "https://www.reddit.com/r/brdev/comments/1dqsdej/sobrevivi_a_uma_enchente_e_perdi_meu_emprego/",
        "content": "pois é amigos, esse é o título que tá aí mesmo, não tenho nem cabeça para pensar, muito menos o que dizer.  \nsó que tipo, além de esperar que esse evento canônico fosse acontecer novamente na minha vida.  \né foda, estar se normalizando depois de uma enchente, perder tudo em casa, e ainda atender call de patrão dizendo que não vai continuar comigo, porque não atendi a expectativa deles. (fiquei 1 mês sem conseguir trabalhar).\n\nsabe, depois de um tempo passando pela mesma frustração, você nem se abala com as mesmas falas, já até sabe o que vem depois dessas falas.\n\n\"então, sinto muito em te dizer.\"\n\n\"não é uma notícia tão boa.\"\n\nmas vida que segue, pelomenos ainda tenho um freelancer fixo que querendo ou não traz uma graninha, mas mesmo assim, é foda passar por isso de novo, trabalhar com tecnologia é uma frustração em cima da outra.\n\nenfim amigos, espero conseguir algo breve e rápido ou me meter em uma escala 6x1 mesmo e parar de sonhar \"tanto\" assim.\n\nquem tiver aí uma vaguinha ou querer me indicar em um trampo, to disponível. tbm tenho LinkedIn, portifólio, currículo.\n\n[Portifólio](https://portifolio-luis-thalys.web.app/home)\n\n[LinkedIn](https://www.linkedin.com/in/thalys-dev202/)\n\nsó preciso de um trabalho, que me ajude a pagar as contas, aluguel e me restabelecer tbm, pq sinceramente, não é fácil. perder 1 mês de trabalho com a preocupação de não ter mais uma casa",
        "num_comments": 16,
        "comments": [
            "Posta no LinkedIn que perdeu emprego por causa de dificuldades decorrentes da enchente que  capaz de viralizar e vc conseguir um",
            "Espero que voc consiga logo um emprego, OP!",
            "Tudo de bom irmao! Fe que tu consegue!",
            "vish amigo, viralizar acho que  uma coisa dificil kkkk, capaz de sair mal falado da histria ainda. mas no deixa de ser uma opo tambm.",
            "muito obrigado pela sugesto amigo, e realmente, meus projetos anteriores esto bem desatualizados com a minha experincia atual, meio que agora eu to mais especializado em Mobile, mas no que eu no trabalhe tambm com backend.   \nmas aproveitar esse momento para atualizar meu perfil e projetos, terminar de desenvolver todos.",
            "Obrigado Amigo , voc  um amigo ",
            "Acho dificil amigo, ainda levando pelo contexto eu estava no \"perodo de experincia deles\" , ento faz muito sentido descartar algum que eles no tinham visto muito valor.  \n foda pois 1 ms eu fiquei de molho sem produzir, mas pacincia, vida que segue.",
            "Eu achei uma ideia bem interessante do rapaz acima, a probabilidade  bem alta. No custa nada tentar! Tudo depende da forma como voc coloca isso em palavras, no parea ingrato ou destrutivo, simplesmente aja como uma vtima (que voc realmente foi)",
            "Faz sim, esses posts sempre viralizam. Manda o link aqui que ns damos um Ibope",
            "Cara no desisti.  chato mas a vida infelizmente  assim.\nOlhei teu portifolio e linkedin. Desculpa falar isso mas teus projetos so simples um recrutador ao bater o olho no fica muito empolgado. Tu se vende como fullstack mas tem apenas projetos de dev trabalhando com front.. trocaria a tua foto tambm. Colocaria uma foto mais profissional, no prprio linkedin tu encontra dicas para melhorar o teu perfil, se tu fala ingls, adiciona uma versao do teu perfil em ingls.\n\nOutro ponto no teu portifolio na aba de experincia tu tem que inverter  ordem. Coloca da empresa mais recente para a mais antiga. A empresa mais recente sempre tem que ser a primeira.\n\nVi que tu fez muitos cursinhos da alura sobre java, isso demostra interesse em java, mas no achei nenhum projeto no teu portifolio. Se quer seguir nesse caminho busca desenvolver um projeto pessoal e publica, faa uso dos artigos no linkedin.\n\n\nJ perdi muita vaga boa e j perdi em momentos onde estava desesperado. No para de sonhar cara.\nUma hora tu encaixa em uma vaga e vai sentir que valeu a pena.\n\nAbs e fica bem."
        ]
    },
    "Como fazer Networking sem precisar sem um Spammer de conteúdos nas redes sociais?": {
        "title": "Como fazer Networking sem precisar sem um Spammer de conteúdos nas redes sociais?",
        "score": 3,
        "url": "https://www.reddit.com/r/brdev/comments/1draqyl/como_fazer_networking_sem_precisar_sem_um_spammer/",
        "content": "O título é bem auto explicatório, eu tenho autismo nível 1 e sofro um pouco com ansiedade social mas adoraria poder fazer networking e conhecer pessoas legais da área mas não estou disposto á ser aqueles pseudo influencers de Linkedin pra conseguir isso. Eu tenho algumas pessoas que carrego comigo de empresas por onde passei mas ainda sinto que é um círculo bem fechado. Como vocês costumam criar o networking de vocês?",
        "num_comments": 10,
        "comments": [
            "Rola de vc participar de eventos da rea? Sou autista nvel 1 tbm e achei bem legal, pq conheci gente bacana e aprendi coisas... Se for demais pra vc, rola participar online e interagir com as pessoas?",
            "Participando de eventos, falando com pessoas mais experientes e o que voc est fazendo agora, participando de uma comunidade.",
            "farma xp e upa esse autismo ai",
            "Com certeza, eu moro em recife ento no sei quais eventos participar. Eventos onlines so legais tambm, participaria super.",
            "No sei como me sentir ao saber que um autista consegue participar de eventos e eu prefiro ter distncia deles. No sei como eu me aproximaria de algum num evento desses. Tipo, s chega e pergunta \"qual as novas do java?\" ou coisa assim.",
            " um debuff inato, infelizmente no tem grind no mundo que resolva isso hhehehehe",
            "Eu ACHO que tem TDC em recife... \nMas assim, comea a dar uma filtrada, dependendo da sua stack",
            "Sim, eu sei que  um espectro, falei mais no sentido de uma das principais caractersticas do autista ser a dificuldade de socializao. Suspeitei que eu fosse tbm, mas apesar de ter a sociabilidade de um panda manco eu no encaixo na questo de sensibilidade e outros critrios. Sou s um humano sem diagnstico com os mesmos problemas, o que as vezes parece at pior. Obrigado pela resposta e boa sorte.",
            "Ah, sim...  bem varivel mesmo. Ao menos pra mim, essa questo social me afetou 10000x mais na infncia e adolescncia. Hoje ainda afeta, claro, mas muito menos. Uma coisa que eu indico pra algumas pessoas  Teatro. Te ajuda a improvisar, ser mais cara de pau e se importar um pouco menos com o que os outros pensam. Mas bvio que no  fcil como receita de bolo. Boa sorte pra voc tambm, se for muito incmodo, converse com um especialista na rea mental ou neuro. ",
            "Ento, eu encontrei uma comunidade e atravs dela soube dos eventos... \nMas de forma geral, o TDC a ttulo de exemplo, rene as palestras por stacks, ento  legal ver a galera trocando ideia... Eu s vezes tenho dificuldade pra me introduzir nas conversas mas eu tento.\n\nO autismo  um espectro, ento tem coisas que pesam mais que outras pra cada um. Tem que entender bem os prprios desconfortos."
        ]
    }
}