{
    "Com dúvidas? Não sabe que faculdade fazer? Leia este post antes de postar no r/brdev": {
        "title": "Com dúvidas? Não sabe que faculdade fazer? Leia este post antes de postar no r/brdev",
        "score": 9,
        "url": "https://www.reddit.com/r/brdev/comments/1doy1oy/com_dúvidas_não_sabe_que_faculdade_fazer_leia/",
        "content": "Olá!\n\nEste post fixado tem como propósito:\n\n* Compartilhar conhecimentos existentes - a maior qualidade de alguém em TI é saber ler, interpretar, e pesquisar\n\n* Dar espaço para dúvidas para quem ainda não é da área, mas quer fazer um curso ou faculdade, ou até a transição de carreira\n\n* Dar espaço para quem tem dúvidas recorrentes\n\nA nossa wiki ([Link](https://www.reddit.com/r/brdev/wiki/novatos)) tem uma lista de perguntas e respostas frequentes. **Sugerimos fortemente que leia a wiki**, lendo os links relevantes às suas dúvidas.\n\nNão proibimos questões repetidas no subreddit, mas pedimos que dê o contexto ou o motivo de fazê-la. Por outro lado, **perguntas sobre faculdade e curso devem ser feitas aqui**, neste post fixado.\n\n[Link na wiki](https://www.reddit.com/r/brdev/wiki/novatos).",
        "num_comments": 1,
        "comments": [
            "Alguém aqui já cursou defesa cibernética na fiap e/ou tem opinião a respeito?"
        ]
    },
    "É meio frustrante como ler a documentação é o suficiente pra te botar acima da média": {
        "title": "É meio frustrante como ler a documentação é o suficiente pra te botar acima da média",
        "score": 280,
        "url": "https://www.reddit.com/r/brdev/comments/1dqkdgs/é_meio_frustrante_como_ler_a_documentação_é_o/",
        "content": "não vou reclamar muito porque se ganho o que ganho é porque as pessoas não fazem o mínimo, mas meu deus, porque ninguém le esse caralho",
        "num_comments": 106,
        "comments": [
            "https://preview.redd.it/qv5sah4slb9d1.png?width=500&format=png&auto=webp&s=2e364ec740fe01d1baed2429d38dbb2b0ce9a582",
            "Na verdade tem muitas docs que pra ler e entender você tem que saber bem o básico, quando digo básico não é em tom de demérito é saber bem nomenclaturas e termos que são usados em docs, além de saber ler doc, saber ler saída de erro é outra coisa que faz muita diferença também, e sim essas duas coisas colocam você na frente de muita gente.",
            "Não acho nada frustrante. Eu acho bom. Se todo mundo fosse bom meu salário agora era menos da metade do que to ganhando. Deixa que seja assim e aproveite.",
            "Tem cada doc ambígua, porca que pqp",
            "Mas eu sempre falo isso pra aprender uma tecnologia nova ou linguagem nova é só ler a documentação e pronto",
            "Na minha opinião saber pesquisar, navegar e entender documentação é uma das principais skills que separa um junior de um bom pleno",
            "olhar o código da lib também costuma ajudar muito, o foda é q a maioria dos devs geralmente não faz isso, principalmente de TS, acho q pq clicar na função só te leva pra uma tipagem que não serve pra porra nenhuma.",
            "O que é documentação?",
            "Não vou reclamar: segue reclamação.\n\nLógico!",
            "Esse título é verdadeiro mesmo fora da área de TI"
        ]
    },
    "Mercado dev virou uma zona ou sempre foi?": {
        "title": "Mercado dev virou uma zona ou sempre foi?",
        "score": 13,
        "url": "https://www.reddit.com/r/brdev/comments/1dr17lm/mercado_dev_virou_uma_zona_ou_sempre_foi/",
        "content": "Olá pessoal, estou precisando da opinião de vcs sobre uma situação que estou passando no meu atual trabalho.\n\nAtualmente estou como backend senior em uma grande empresa do setor financeiro. Meu salário é 9.5k bruto CLT com alguns benefícios (VA/VR, plano de saude etc). Não acho minha remuneração ruim, porém, estou trabalhando na seguinte situação:\n\n- estou trabalhando com outros dev's que não fazem a menor ideia do que estão fazendo, tem uma pessoa na equipe que não sabe oq é um cURL.\n\n- codereview nem existe.\n\n- meu tech lead não tem experiência nenhuma com backend, acaba que ele me faz mil perguntas por dia, como se eu fosse o líder e ele o liderado.\n\n- os projetos estão uma verdadeira bagunça, não tem o mínimo de código limpo, padrão de projeto, arquitetura, etc...\n\nAcaba que além de dar suporte para meu LT, eu tenho que consertar td que os outros dev's fizeram e garantir que eles não estraguem mais nd.\n\nNão é a primeira vez que trabalho num ambiente assim, queria a opinião de vcs\n\n- estou sendo mal remunerado?\n\n- o mercado de dev é isso mesmo? Existe empresa onde todos os desenvolvedores sabem o básico p/ criar um software com qualidade e o mínimo de organização?\n\n\nobs. tenho 9 anos de exp. No início da minha carreira tive o privilegio de trabalhar em uma equipe/projeto muito organizado, vi coisas como solid, tdd, ddd, funcionar na prática, porém parece q nunca mais vou encontrar algo próximo disso.",
        "num_comments": 26,
        "comments": [
            "ta uma zona msm.\nTrampo na b3 e tem “engenheiro de dados” que só consegue criar codigo pq a empresa disponibiliza o chatgpt4 internamente.\nEle nem faz questão de maquiar ou tirar os markdown que o gpt interno gera.\nEle copia e cola e ainda vem tirar duvida (nem pra ele ser autodidata o suficiente pra ir tirar as duvidas dele no gpt haha)",
            "Meu colega, eu já notei isso e acho que tenho a resposta certeira para o teu questionamento.\n\nMinha observação é a seguinte: as empresas que recrutam programadores por meio de profissionais de RH mal qualificados, que são os famosos \"tech recruiters\" do LinkedIn, normalmente formados em Psicologia em uma uniesquina e com meia dúzia de certificados de coach da Conquer, costumam selecionar programadores péssimos, no geral.\n\nJá as empresas em que o próprio time de TI participa mais ativamente da seleção costumam efetivar bons desenvolvedores e evitam essa dor de cabeça que você está passando.\n\nE digo isso tendo um exemplo bem real! Já trabalhei em uma consultoria nacional bem grande que fez justamente essa mudança. Afastaram os sêniors e encarregaram parte do RH de avaliar os candidatos. E, em alguns meses, a gestora do recrutamento foi demitida, porque a qualidade dos programadores que estavam sendo contratados diminui muito.   \n  \nNo final, era basicamente o mesmo perfil que passou a ser contratado: uma pessoa carismática, com conversinha de coach, mas que tinha dificuldade em fazer o básico.",
            "Eu diria que depende hahaha meu time é super organizado, mas tem um time aqui que o TL é um dev Python bem ruinzinho num time 100% Java. E isso num produto altamente lucrativo, operando em 3 continentes. Vez ou outra eu entro no canal do slack do time pra dar umas risadas, teve dev senior submetendo PR com mais de 50 problemas novos apontados pelo Sonar, dev pleno pedindo ajuda pra escrever um select com join, enfim, o time é um caos completo.",
            "Sempre foi e você ganha bem. Espero ter ajudado.",
            "acho bizarro não existir code review em uma grande empresa do setor financeiro. Geralmente essas empresas tem que seguir alguns padrões de qualidade de código por causa de algumas normas",
            "Sim amigo! Entenda uma coisa, existem entusiastas que são os que realmente gostam de tecnologia, e existem os oportunistas por conta do salário.😵‍💫\n\nO mercado está cheio de dev oportunista foram pegos pelo bombardeio de cursos: \"aprenda linguagem X ou Y e tenha 5k de salário inicial\"...o mercado está saturado de dev's básicos que conhecem razoavelmente a linguagem no máximo um select*from e quando ficam sem rede dependem do suporte técnico, nunca usaram ou acham ruim Linux🤦‍♂️ ...Por este motivo os processos seletivos estão arrancando o couro nas entrevistas como nunca visto antes!\n\nComo relatado por vc, e eu com meus 15 anos de experiência, posso te dizer que não está sendo raro dev's com capacidades bem limitadas como essa que vc relatou 🤙🏼",
            "Se você se acha tão superior e especial, procure um novo emprego. Certamente vai ganhar mais e ter um novo problema. Ficar aí só faz você ficar passando raiva. \n\nSobre salário tem que considerar o anual (plr e outros benefícios). Se você ganha só esses 9.5k mensal é pouco, mas se ganha isso mais uma plr agressiva todo ano então você está bem.",
            "Tem empresas que sao zona mesmo mas nao acho q seja a regra. Sobre remuneração depende daonde voce vive, se for SP eu acho que esta mam remunerado sim",
            "1) Depende do tipo de banco e do esforço que você precisa fazer, mas não acho que esteja mal remunerado. Minha remuneração é parecida.\n\n2) No começo eu também me assustava com desenvolvedores não conhecerem ferramentas que todo mundo deveria conhecer. Eu já ensinei o básico de Git para pessoas com muito mais senioridade em diversos contextos. Com o tempo eu aceitei que as pessoas geralmente só aprendem o que precisam pra fazer o trabalho e nada muito além disso, exceto quando alguém vem de fora e mostra. Sobre falta de padrões e codigo ruim, isso é mais normal do que deveria.",
            "geralmente as empresas mais organizadas em práticas de desenvolvimento sao aquelas que seu negócio é em software/hardware.\n\nsua remuneração mensal parece baixa pra senior/experiencia/trabalho, mas tem que ver o bônus, cidade, geralmente ganha um bom bônus no setor financeiro. \n\ntem que ver se você tem como se destacar pra subir, acho que ta trabalhando demais por aí."
        ]
    },
    "Sobrevivi a uma Enchente e Perdi meu emprego.": {
        "title": "Sobrevivi a uma Enchente e Perdi meu emprego.",
        "score": 39,
        "url": "https://www.reddit.com/r/brdev/comments/1dqsdej/sobrevivi_a_uma_enchente_e_perdi_meu_emprego/",
        "content": "pois é amigos, esse é o título que tá aí mesmo, não tenho nem cabeça para pensar, muito menos o que dizer.  \nsó que tipo, além de esperar que esse evento canônico fosse acontecer novamente na minha vida.  \né foda, estar se normalizando depois de uma enchente, perder tudo em casa, e ainda atender call de patrão dizendo que não vai continuar comigo, porque não atendi a expectativa deles. (fiquei 1 mês sem conseguir trabalhar).\n\nsabe, depois de um tempo passando pela mesma frustração, você nem se abala com as mesmas falas, já até sabe o que vem depois dessas falas.\n\n\"então, sinto muito em te dizer.\"\n\n\"não é uma notícia tão boa.\"\n\nmas vida que segue, pelomenos ainda tenho um freelancer fixo que querendo ou não traz uma graninha, mas mesmo assim, é foda passar por isso de novo, trabalhar com tecnologia é uma frustração em cima da outra.\n\nenfim amigos, espero conseguir algo breve e rápido ou me meter em uma escala 6x1 mesmo e parar de sonhar \"tanto\" assim.\n\nquem tiver aí uma vaguinha ou querer me indicar em um trampo, to disponível. tbm tenho LinkedIn, portifólio, currículo.\n\n[Portifólio](https://portifolio-luis-thalys.web.app/home)\n\n[LinkedIn](https://www.linkedin.com/in/thalys-dev202/)\n\nsó preciso de um trabalho, que me ajude a pagar as contas, aluguel e me restabelecer tbm, pq sinceramente, não é fácil. perder 1 mês de trabalho com a preocupação de não ter mais uma casa",
        "num_comments": 4,
        "comments": [
            "u/Several-Bet-9357 (OP), não se esqueça de ver o \"[Mega Fucking Ultra Compilado de dicas/posts de como fazer/formatar seu CURRÍCULO](https://reddit.com/r/brdev/comments/10ok5jz/mega_fucking_ultra_compilado_de_dicasposts_de/)\". Há várias dicas importantes lá, que nem os comentários vão repetir aqui.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/brdev) if you have any questions or concerns.*",
            "Posta no LinkedIn que perdeu emprego por causa de dificuldades decorrentes da enchente que é capaz de viralizar e vc conseguir um",
            "Espero que você consiga logo um emprego, OP!",
            "N cabe processo?"
        ]
    },
    "Dicas para entrevista(SERRATEC)": {
        "title": "Dicas para entrevista(SERRATEC)",
        "score": 2,
        "url": "https://www.reddit.com/r/brdev/comments/1dqyatm/dicas_para_entrevistaserratec/",
        "content": "Fala galera, estou participando de um processo seletivo para uma residência em TI (SERRATEC) é um curso FullStack preparatório para o mercado de trabalho na região Serrana do RJ, com duração de 4 meses, as aulas são online e ao vivo de segunda a sábado, os horários são bem puxados, das 13h até às 22h. Resumindo estou na última etapa do processo (a entrevista), já passei por 3 outros testes, são 130 vagas e tem mais de 200 pessoas nessa última etapa. Gostaria de dicas para entrevista, se alguém já participou dessa residência e puder dar uma força , ficarei muito grato! Acredito que seja mais um bate papo para eles selecionarem os que venderem melhor seu peixe. Estou animado pois há várias empresas parceiras nesse projeto, e ao finalizar o curso a chance de já sair com um estágio é bem grande.",
        "num_comments": 1,
        "comments": [
            "Já fiz algumas entrevistas, acho que uma boa dica é ficar bem calmo e falar devagar. Não mentir também pode ser uma boa. Mas muitas vezes o cara (se for da área técnica) pode lhe fazer perguntas sobre a área."
        ]
    }
}