{
    "It's the /r/brisbane random discussion thread. 30/06/2024": {
        "title": "It's the /r/brisbane random discussion thread. 30/06/2024",
        "score": 1,
        "url": "https://www.reddit.com/r/brisbane/comments/1drbu2n/its_the_rbrisbane_random_discussion_thread/",
        "content": "[Permalink to the latest discussion thread](http://www.reddit.com/r/brisbane/about/sticky)\n\nBe excellent to each other, r/Brisbane.",
        "num_comments": 0,
        "comments": []
    },
    "/r/Brisbane evening discussion thread 29 Jun, 2024": {
        "title": "/r/Brisbane evening discussion thread 29 Jun, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/brisbane/comments/1dr70gl/rbrisbane_evening_discussion_thread_29_jun_2024/",
        "content": "pull up a chair, grab a drink and lets have a chat about how your weekend has been or anything else that is on your mind :)",
        "num_comments": 9,
        "comments": [
            "Another Saturday rolls around and I've already getting nostalgic watching old music on YouTube. I need to find something newer than 1985 to watch.",
            "Feeling quite maudlin tonight. Completely devoid of fucks to give. \n\nIve also fallen into an 80s time warp. Borrowed an unauthorised behind-the-scenes book about the Golden Girls from the library, and introduced kiddo to ALF today.",
            "Going on a CityCat trip with my crush, she wants to stand at the front but I can't stand for long periods due to injury, so I'm sitting inside Redditing instead.",
            "Watching T20 Cricket WorldCup Tomorrow, and definitely need some good sun in morning so going to mount Cootha.",
            "Maybe, maybe not. Moving is stressful, you need to allow time to rest and recover.",
            "I know this feeling. I feel the older I get, the more nostalgic I get for old music.",
            "Sounds like a day well spent. Will have to find that book.",
            "Big plans for setting up new place, and instead I binge ate pizza and napped.\n\n\nMaybe tomorrow will be more productive.",
            "So very cute  Enjoy\n\n\nI miss that feeling."
        ]
    },
    "Newly homeless in the CBD!": {
        "title": "Newly homeless in the CBD!",
        "score": 162,
        "url": "https://www.reddit.com/r/brisbane/comments/1dr4oot/newly_homeless_in_the_cbd/",
        "content": "Long story short, I made a few mistakes and as of today I’m living out of backpack at Queen St Mall. Any recommendations on what the hell I should do first? Places to sleep/shower/eat/get help?\n\nAbout me: I’m 31 and male, ADHD/anxiety/SA/depression diagnosed and, I suspect, somewhere on the ASD. I love to help others but the last few years of doing that has seen me end up in some bad situations that have crushed my self-confidence.\n\nWould love to work! Experienced with IT, networking, marketing, privacy tech (OpenWRT, Wireguard, Tails, etc), cooking, stock management, forklift driving and learn most things fast - but I really struggle with group socialising and can become easily stressed and have abused alcohol in the past to cope.\n\nAny advice or help is greatly appreciated <3",
        "num_comments": 41,
        "comments": [
            "Theres a food van and Orange Sky that congregate under Turbot St bridge on Friday nights for meals and laundry. Otherwise, definitely check out Ask Izzy as another commenter mentioned. I hope you find something soon! Good luck",
            "Pop into HART4000 near the Fortitude Valley station. Can do long-term housing referrals, sort out bond loans to get into a boarding house and in some cases can put you up in a motel. Drop-in any weekday at 1pm",
            "I'm back in Australia from Mid-july. If your circumstances haven't improved I have a spare room? I know without my place I'd be in the same position as you. Thinking of you!",
            "Rocklea markets are always looking for forklift drivers.",
            "I know St Pauls Cathedral lets homeless people sleep on their grounds from 6pm to 6am, its a bit safer. They have strict rules, so no fighting, drinking, smoking etc, it's monitered so you might get a more peaceful sleep. They also provide toiletries\n\nEDIT: Im so sorry I meant to say St Johns! All these saints... Jesus Christ",
            "Post office square car park was incredibly warm when I was homeless although the stair cases also smell like piss",
            "Theres a shelter that does food and beds on Brunswick street in New Farm. Was there about 3 weeks ago and it looked decent",
            "You should be able to get a job fast since you can drive forklifts. You could even ask around restaurants if they need kitchen hand/dishwashers to get income fast. Have you applied for Centrelink? Once you have income you can get a room in a sharehouse. Or even stay in a backpacker hostel some nights a week so you can sleep and shower.\n\nI hope you get back on your feet soon. Its so easy to become homeless these days. ",
            "as well as others have said, 3rd space in fortitude valley are a great spot. day beds and cheap/free food. not open currently but open most days.",
            "With a fortlife licence, your best bet for full-time work is probably warehousing"
        ]
    },
    "Did some Uber Eats for a mattress?": {
        "title": "Did some Uber Eats for a mattress?",
        "score": 36,
        "url": "https://i.redd.it/tlbb0aoq0i9d1.jpeg",
        "content": "I’m not sure what has me more puzzled. Riding with a a mattress, or the fact they didn’t think to deflate the mattress first.\nVulture St",
        "num_comments": 12,
        "comments": [
            "Assume they took it to a servo to fill it ",
            "Is that an inflatable mattress? If so WTF?",
            "the only thing he can see is god",
            "Thats why my maccas is running late",
            "Some safety conscious riders there.   A pre inflated air bag for the passenger.",
            "That's the biggest ice cream sandwich I've ever seen!",
            "They were having fun I guess",
            "SSH dont tell them that",
            "Two people on the bike, but I was afraid for them.",
            "at least they will have cushioning when they crash"
        ]
    },
    "The Australian city with the worst traffic isn't Sydney or Melbourne": {
        "title": "The Australian city with the worst traffic isn't Sydney or Melbourne",
        "score": 90,
        "url": "https://www.carexpert.com.au/car-news/the-australian-city-with-the-worst-traffic-isnt-sydney-or-melbourne",
        "content": " https://www.carexpert.com.au/car-news/the-australian-city-with-the-worst-traffic-isnt-sydney-or-melbourne",
        "num_comments": 101,
        "comments": [
            "All I see is \"Brisbane No. 1\"",
            "Brisbane is a mess. An influx of population and combined with poor driving skills has really made it very congested. The tailgating and braking abruptly and then there are people that will slow down to 80k to pass a stationary speed camera in a 100km/h zone.",
            "Road planing here in Brisbane consisted of turning old goat tracks into major highways.",
            "Drove to and from today from Ballina - its a joke",
            "I would actually prefer to take public transport but since I live outside of the city it takes over 1h 15min with bus or 25 min in car to get to where I need to be",
            "Drove my car today just to do my part in this traffic. Wooo Brisbane #1",
            "Seems to be a city that still really has a pronounced peak hour. Outside these times I find getting about to be fairly easy. But chuck in a game at Lang Park, inclement weather or any other festive event and then my suburb is a colossal traffic cluster fuck for hours. \n\nHow people mentally deal with the 2 lane shit show thats Wynnum Rd during peak is testament that we still have some people that arent full postal just yet /s",
            "It is the city you live in",
            "Extra lane shell be right",
            "Merging lanes are 42 feet. Theres ya problem"
        ]
    }
}