{
    "Why are job salaries going down? ": {
        "title": "Why are job salaries going down? ",
        "score": 260,
        "url": "https://www.reddit.com/r/britishproblems/comments/1dr7r0k/why_are_job_salaries_going_down/",
        "content": "I have been searching for jobs for the last couple of months. I have noticed that every month, the average salary for jobs in my field (Marketing) keeps going down. \n\nIn April, most jobs I came across in London in my field were roughly £30k (for marketing executive jobs, 2 - 3 years of experience). But since then, the average has come down all the way to £28k. I now see jobs that pay £25k for 5 days a week in office in central London and requires 2 - 3 years of experience. Hell, even saw a senior marketing exec position that was from £28 - 35k (5 - 6 years of experience). \n\nI realise that the economy is in a pretty shit situation, but how do these companies expect people to live in London with that salary? Especially since house prices are out of this world. I suppose the only option is sharing a house with a few people, but even that... Well, who knows if it can work out, especially with how many conditions these real estate agents have. \n",
        "num_comments": 174,
        "comments": [
            "“Marketing Executive” at £30k 💀 in London is even more crazy.\n\nThe UKs salaries are a joke.",
            "I feel you. Worked in America as an entry level art director making 80k (dollars) and came back home only to find the same job paying £19-25k - insane. I’m heading back stateside as soon as possible.",
            "Because people are willing to do the job for that money. If nobody applies at £28k then they'll have no choice but to put it up. \n\nI would ask myself if they're not willing to pay a decent chunk, would they actually value my experience and expertise, or will they be happy will anyone and have a high turnover of staff.",
            "Salaries are so low in the UK that American firms have started outsourcing software development work to the UK instead of India. While UK workers get more than Indian ones, they come with the advantage of a closer timezone and a more similar culture.",
            "When I started 20 years ago in my industry, the entry-level positions paid what they ask for experienced roles now. It's not that the industry has been impacted by anything specific, just a drop in wages in general.",
            "Not all salaries are going down, your leadership salaries are up! Plus their bonuses",
            "As far as I know, the overall data say nominal average salaries are still going up, so it may be something specific to your field/level of experience. ",
            "It is most likely due to the time of year. Lots of unis are finishing now and many graduates do have 1-3 years experience from working part time or doing a mid uni internship year. Which means the job market is saturated with people looking for the same job. \n\nAlso marketing is a popular degree. The less niche the subject/job the worse pay in general.",
            "When recruiters call me, I make a habit of letting them know how insane these salaries are. I had more than one call me and give a low salary, expect in office 5x a week and a list of job duties that was a mile long. The recruiters generally agree with me but say their clients are adamant to find their unicorn. One company last year did this, hired someone and he’s already been and left the job. So they waste all this time and money and get nothing. The low salary becomes costly, yet they remain undeterred.",
            "Because nobody's hiring at the moment."
        ]
    },
    "Lorries trying to overtake other lorries on the motorway and blocking both lanes": {
        "title": "Lorries trying to overtake other lorries on the motorway and blocking both lanes",
        "score": 240,
        "url": "https://www.reddit.com/r/britishproblems/comments/1dquslk/lorries_trying_to_overtake_other_lorries_on_the/",
        "content": "You’re both going less than 60 mph, it’s been 15 minutes already since you started overtaking and I’m gonna be late for work. Just get back on the left and grow the fuck up.\n\nEdit for clarification: I’m on about lorries that pointlessly block the right lane just to end up in front but going at exactly the same speed as the one behind it. Dunno what roads everyone else is driving on but I wish I could use yours instead. Also I only drive on dual carriageways to get around",
        "num_comments": 143,
        "comments": [
            "I encountered a lorry trying to overtake another lorry on a single carriageway today, ie they had to use the other lane. This was not on a road long and straight enough to actually see to judge that; I wouldn’t overtake a bicycle on this road, let alone something I could only do 1 or 2mph more than. \n\nThankfully overtaking lorry abandoned that idea after the first tyres screeching, horns blaring encounter with oncoming traffic.",
            "I do a lot of miles and the main thing that winds me up is when lorries think that they can just indicate then move lanes and cut you up, an indicator doesn't give you an automatic right.",
            "Happens daily in the M6",
            "If you only drive on dual carriageways why put motorways in the title. Most motorways are a 3 lanes. If it wasn't for truck drivers you would have the phone in your hand or food in your plate. Stop being so impatient and entitled.",
            "I think it's understandable that they do it, as frustrating as it can be. What's really annoying is when they do it uphill, overtaking someone driving at 57mph at 58mph!",
            "Doesn’t bother me on motorways, with 3+ lanes. But on dual carriage ways, it can cause huge tailbacks of traffic to form",
            "Keeping momentum is key for lorries. If they braked to not get to close to the lorry in front, it would be difficult for them to get back up to their cruising speed. \n\nPlus they’re just doing their job, leave them alone.",
            "Would you be happy working 3 to 4 days more a year for free, because 1mph is about the equivalent of that when you're driving full time.\n\nTrucks are limited to at most 56mph, and the limiter is why it takes forever to get past.  If there was no limiter, or something like a temporary occasional speed boost, there would not be nearly so much of a problem.",
            "1) It won't take 15 minutes for a truck to overtake another, maybe a couple minutes max  \n2) If 2/3 minutes \"stuck\" behind a truck makes you late for work, maybe you are the problem not leaving enough time to do the journey.",
            "There are certain groups of road users that piss me off on a regular basis, but lorry drivers aren't one of them. They put the food on the shelves and all the other shit we take for granted. Literal heroes in my book, I couldn't do that job all day"
        ]
    },
    "The nerve of Virgin Media to tell me they're removing the TNT Sports channels from my package whilst charging me the same extortionate price every month just because I haven't watched them for a few weeks": {
        "title": "The nerve of Virgin Media to tell me they're removing the TNT Sports channels from my package whilst charging me the same extortionate price every month just because I haven't watched them for a few weeks",
        "score": 97,
        "url": "https://www.reddit.com/r/britishproblems/comments/1dqvoao/the_nerve_of_virgin_media_to_tell_me_theyre/",
        "content": "",
        "num_comments": 22,
        "comments": [
            "Surely that should be grounds for cancellation without the fee",
            "Best thing I ever did was leave Virgin Media. Atrocious company I will never return to",
            "I’m fairly sure that’s against OFCOM’s rules. They can’t cancel part of your package without your permission, unless you’ve not paid and ignored all contact",
            "Get a parrot and sail the 7 seas.",
            "Same here, I left when the contract came to an end and they still tried to charge me a cancellation fee. No bitch the contract just finished and I don't want to sign a new one.",
            "I mean it should be grounds to cancel the contract",
            "Yep left 4 weeks ago. Pay £18.50 for internet and bought a Firestick then added IPTV sub for a year, should have done it years ago.",
            "If you had no idea where to start with this what should you do?",
            "It actually is. T&Cs for all telecoms companies state that the price may change (usually in April) but if it does, you can leave without penalty. What VM have done in this case though is a major breach as they’ve withdrawn services with no apparent cause or notification",
            "Once they stop providing an agreed part of the service, the contract is voided and you're within your rights to stop paying."
        ]
    },
    "Lost my train ticket in between stations, had to buy a ticket to get out of my final station. ": {
        "title": "Lost my train ticket in between stations, had to buy a ticket to get out of my final station. ",
        "score": 105,
        "url": "https://www.reddit.com/r/britishproblems/comments/1dqq347/lost_my_train_ticket_in_between_stations_had_to/",
        "content": "Having a confirmation on my phone and the receipt ticket wasn’t good enough. ",
        "num_comments": 40,
        "comments": [
            "My local station staff are pretty helpful, I don’t have any issues getting through even without a ticket",
            "Not THAT long ago I did this at Marylebone and had to get home. I went to the station manager and explained, and he wrote me a little note that I had to show to give me free passage. I notice that his office is gone now, we need to still treat people decently.",
            "In this scenario just buy the absolute cheapest possible ticket to exit with",
            "I remember running for the train and the door closing and hitting my arm on the way in. I dropped my return ticket and was glad they let me through on the way back. Was told I had no chance of getting through.",
            "Lucky. Could have been fined or even taken to court.",
            "Something similar happened to me recently only my ticket was on my phone that had died\nI had my charger but hadn't been anywhere with a charging point and the train didn't have any either",
            "Email them from home with evidence is the next step.",
            "I miss the time before the mid 2000s when stations didn't have gates.",
            "If you withdrew a £10 note from the bank and then lost it, would you go back to the bank to show them your statement to prove you had indeed withdrawn that money, and then ask them to replace the £10 note?",
            "I would have absolutely jumped the rails. Idc, I’m not paying for more than one ticket. If they take me to court I’ll bring my receipts."
        ]
    },
    "£8 for a jacket potatoe wirh cheese! Brighton prices, i guess they we are all rich.": {
        "title": "£8 for a jacket potatoe wirh cheese! Brighton prices, i guess they we are all rich.",
        "score": 0,
        "url": "https://www.reddit.com/r/britishproblems/comments/1drd7g4/8_for_a_jacket_potatoe_wirh_cheese_brighton/",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Well you’re getting an ‘e’ with it, maybe it’s the clubbers version.",
            "\"I guess they we are all rich\"\n\n\"Potatoe\"\n\nIs this a meme that I don't get?",
            "### **Reminder:** [Press the Report button](https://reddit.zendesk.com/hc/en-us/articles/360058309512-How-do-I-report-a-post-or-comment-) if you see any [rule-breaking comments or posts.](https://www.reddit.com/r/britishproblems/about/rules/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/britishproblems) if you have any questions or concerns.*"
        ]
    }
}