{
    "Discount Megathread": {
        "title": "Discount Megathread",
        "score": 62,
        "url": "https://www.reddit.com/r/Broadway/comments/1cv2yqr/discount_megathread/",
        "content": "Please use this threat to post and request discount codes.",
        "num_comments": 97,
        "comments": [
            "Telecharge code for Uncle Vanya: UVLUCKY\n\nGiven to people who don’t win the lottery so it only applies to day of and next day’s performance but I just bought a ticket for almost 50% off using it.",
            "As someone who is looking to buy tickets for some shows through July, this thread is greatly appreciated.\n\nAlso big thanks to everyone ahead of time who is sharing discount codes.",
            "MaryJ3U3 for $35 tickets on the newly-extended dates (Mary Jane)",
            "Looking for any codes for Gatsby, Hell’s Kitchen, or Stereophonic 🙏",
            "Doubt there's anything for Oh Mary, but that's what I'm mainly looking for!",
            "Amex Telecharge offer $40 off $180. Check your Amex account to see if you have the offer.",
            "Any discount codes for The Great Gatsby?",
            "Anyone have any discount codes for Little Shop?",
            "I'm requesting anything for: Mother Play, Enemy of the People, and The Wiz. \n\nThese are all shows that I am trying to see before I leave town for the month of June because they are either leaving or changing. \n\n...and if anyone knows what else might be closing in June or closely thereafter (I've already seen appropriate, merrily, and I have tickets for mary jane tonight)",
            "Looking for Hell's Kitchen code to surprise my mom with tix for her bday. She loves Alicia Keys!\n\n\nPlease, Hell's Kitchen~"
        ]
    },
    "Well here it is, what do we think": {
        "title": "Well here it is, what do we think",
        "score": 181,
        "url": "https://i.redd.it/6rfflsfaud9d1.jpeg",
        "content": "There’s a couple absolute bangers on here ",
        "num_comments": 96,
        "comments": [
            "It looks like you've shared an image. If this image is of a Playbill or stage, we ask that you provide your thoughts on the show[s] you saw in order to make your thread stand out and help the community enjoy your experience as well. Without context your photo is just another picture of a Playbill or a stage, and on a sub of far over 100k subscribers, If you don't want to share your experience... consider sharing it on your own social media! This is an automated message, if it is not applicable please report this comment.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Broadway) if you have any questions or concerns.*",
            "Honestly? It ain't Gatsby or period accurate but it's a fun and catchy score. I like it better than a lot of the scores that got Tony noms. Of course, I'm sure Jeremy and Eva elevate it too\n\nI'm also a sucker for a schmalzy ballad so I adore My Green Light",
            "I need New Money injected into my veins. I also need to learn the choreo for the last like 30 seconds of the number.",
            "I can't explain why but this feels very Disney-fied to me?",
            "Immediately went to Beautiful Little Fool for Eva and it did NOT disappoint.",
            "Bruh I almost had a panic attack I thought this was Florence Welch’s GATSBY",
            "I just started listening, but I thought For Her was a really pretty song.",
            "Honestly, I enjoy it. It’s not groundbreaking or awe-inspiring like some others I love, but if you’re not expecting too much, then it’s really quite enjoyable. 😂 Only Tea is a favorite (and having seen it at Papermill makes me love it since it was very funny), I love For Better or Worse (and the new ending is interesting although very Disney-fied, lol, especially with the door lyrics), and the lyric change to For Her is also nice. I still can’t tell which I like better. But, I’d say altogether, I enjoy it for what it is and definitely enjoy Eva and Jeremy’s singing.",
            "I was so excited for roaring on based on the rehearsal footage and I was so disappointed 😅",
            "I cannot distract myself from how bland those lyrics are. This just does not sound like a good musical theater cast recoding."
        ]
    },
    "Final performance of Merrily - I’ve never seen first-party tickets this expensive, even when Hamilton first opened!": {
        "title": "Final performance of Merrily - I’ve never seen first-party tickets this expensive, even when Hamilton first opened!",
        "score": 201,
        "url": "https://i.redd.it/ig0hwrc09d9d1.jpeg",
        "content": "I knew that the prices would be nuts thanks to dynamic pricing and it being the last show, but this was another level. $1300? Even premium seats for Hamilton in its prime were like $849 (which is still wild) IIRC. ",
        "num_comments": 100,
        "comments": [
            "It looks like you've shared an image. If this image is of a Playbill or stage, we ask that you provide your thoughts on the show[s] you saw in order to make your thread stand out and help the community enjoy your experience as well. Without context your photo is just another picture of a Playbill or a stage, and on a sub of far over 100k subscribers, If you don't want to share your experience... consider sharing it on your own social media! This is an automated message, if it is not applicable please report this comment.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Broadway) if you have any questions or concerns.*",
            "Damn, i was going to buy a few, but the $3 processing few is just too much.",
            "If Hamilton had closed after less than a year then you would have seen these types of prices for it.",
            "What’s even wilder is there are people that will still pay these prices",
            "Enemy of the People was $1500 for its last performance. I bet the Merrily prices will go even higher soon.",
            "Yeah it's pretty nuts.\n\nThe only good thing I can see in this is that it reduces secondary ticket markets. Because there were Hamilton tickets that went for prices like this or even more. Just not on the official website.\n\nOh and general inflation is hitting on top of crazy prices.",
            "They are closing less than a month after their Tony wins and the theater fits about a thousand people. So the prices here honestly don't surprise me. Honestly surprised though there are any tickets left whatsoever but I doubt there will be by Monday.",
            "Lea Michelle’s first and final performances were pretty similar if I recall",
            "850 when the original cast of Hamilton was on is about 1150 with inflation.",
            "If I had the cash, I’d go again tbh."
        ]
    },
    "Belasco Theater Ushers Are Amazing!": {
        "title": "Belasco Theater Ushers Are Amazing!",
        "score": 32,
        "url": "https://www.reddit.com/r/Broadway/comments/1dr21n4/belasco_theater_ushers_are_amazing/",
        "content": "I saw Appropriate tonight through Audience Rewards, and the moment I sat down (side orchestra, middle of the row), the woman behind me started grumbling about how tall I was (I'm 6'1\" and admittedly tall, but what can I do?) I didn't lose my temper and let it go, but she was incredibly rude.  She stated how it was rude that I even chose that seat (which I didn't anyway) and had no consideration for the people sitting behind me.  She said I should at least have the decency to crouch.  \n\nUnfortunately, she started up with my mom at intermission (who was with me and sitting next to me). She told her I was ruining the show for her by blocking her view and requested I switch seats with her.  Just because she was so obnoxious though, I didn't switch (too spiteful?).  I would have happily done it otherwise if she asked me politely. But I never acknowledged her and politely told an usher what was happening and how it was disrespectful and out of my control.  The usher was a pro!  They approached her with a booster seat and said that everyone was there to see the show and that being disrespectful would not be tolerated.  She was fuming afterward and made more remarks upon my sitting back down in front of her, but I did my best to ignore it for the sake of enjoying the show.\n\n\nI deal with this all the time unfortunately (and I see other tall people here with similar posts).  And I'm not insensitive.  I know I'm tall.  But this was the rudest, most selfish patron I've dealt with in this matter.  It took a lot for me not to tell her off. I'm in the seat that was assigned to me.  And despite my tallness, I myself have been blocked many times and just lived with it.\n\nShout out to this amazing usher!",
        "num_comments": 11,
        "comments": [
            "What the actual hell is wrong with people? Do they truly not know how to behave in public? You can’t help where you were sat/your height, but I’m very glad you had an usher on your side! I’m sorry you had to deal with this obnoxious experience but I hope you didn’t let it taint the show for you.\n\n(I’m 5’1 and small, and I don’t think I’ve ever even thought to act like this if a taller patron sat in front of me. Doesn’t hurt to ask for a booster or just… tip my neck up a little, lol. Some people were raised in another dimension, I swear.)",
            "As a 5’ tall person I’m appalled that she behaved this way. I definitely always hope that I don’t have a tall person in front of me. But when I do get one I simply get a booster or if it’s winter use my coat as a booster. Part of theater is sharing space with others. I’m very happy the ushers handled it so well!",
            "As a 6’2 theater goer, I am always so nervous about this happening and I’m very grateful that it hasn’t (yet). I’m really sorry this happened to you but major shoutout to for handling this peacefully!",
            "Unbelievable. I would never talk to some like she did. What are you supposed to do? Shrink? If she really can't see, she could have asked if she could move (if seats were available) or lean to the side, like we all do. Life goes on. I'm sorry you had to deal with that.",
            "I’m 5ft and can never see a thing. You know whose problem that is? Mine. I was born short, others are born tall",
            "Saw Music Man last year, two people in front of me blocked 1/3 of the stage on my right no matter how I leaned. I just stood at the back of the theatre for the first half. Ushers found me an excellent seat further down for the second act. I figure between the really good seat and standing, cost of my ticket evened out.  There have been times when I notice the person behind me is a kid and can't see well (I'm not that tall but some of the theaters really aren't well designed on the floor), and I offer to switch seats.",
            "I'm 6'3. Once when seeing Freestyle Love Supreme on broadway I got a tap on the shoulder after I had been seated a while. I turned around and this young kid started playfully giving me shit and asked if we could switch seats.\n\nThat kid was Young Sheldon Iain Armitage. I happily switched.",
            "It really sucks when a fellow audience member’s behavior gets close to ruining your experience of a show. I’m glad to hear that the usher was so helpful\n\nI am not tall and I hate when my view is blocked, so I sit in the first row or on the center aisle of a side section. I plan in advance to make that happen bc it’s such a priority for me. I’d never hold it against someone if they’re blocking my view; it’s just the luck of the draw",
            "Thank you!  And I agree. People are the worst!  I thought about it a lot but I mostly blocked it out for the sake of enjoying the show.  ",
            "I’m a volunteer usher at a FL theater and we deal with these people allll the time sadly, though it does depend on the kinda show on any given night…"
        ]
    },
    "Oh, Mary! rush experience": {
        "title": "Oh, Mary! rush experience",
        "score": 19,
        "url": "https://i.redd.it/qu7ursmvjf9d1.jpeg",
        "content": "Sharing in case it’s helpful as Oh Mary settles in at the Lyceum! I rushed this Friday.\n\n**Rush experience**\n- As I posted in the rush line headcount thread, there were 6 at 6:55, 7 at 7:05, 9 at 7:15, 10 at 7:20, 11 at 7:45, 12 at 7:50, 13 at 8, 14 at 8:40, 15 at 8:45, and ultimately at least 20 more by 10 when the box office opened.\n- I was offered a partial view rush ticket, no seat choice given. It was far side orchestra G.\n\n**Seat**\n- I was worried that it would be too far to the side. It was actually a great seat for partial view/rush. Though I could only see the edge of the chaise longue on stage right, anything that happened there was unambiguous and only a minor bother. Visually, I lost less than 5% of the action, and none of it was important or hurt my experience of the show.\n- I’m short (5 feet) and I could see the actors clearly. This is rare for me at a Broadway theatre. I did grab a seat booster in case but I would have been pretty good either way. I could see the actors’ faces at all times (unless on the chaise longue) and often saw the stage and actors’ feet, the sightline was that good.\n- The rake in the orch seems pretty fair, and it’s a small theatre so even the back row isn’t far. Row G was both close to the actors but far enough away that the side obstruction was less severe than the rows in front.\n- Seeing the show from the far side, I’d say the side orch in general is a great value. No need to pay extra for center if it costs much more, in my eyes.\n- I spotted at least 10 seats in my far side orch area which were rush seats, since they were filled with people from the line and their guests.\n\n**The show**\n- I knew it would be unique and funny and ridiculous. I mostly kept myself in the dark and it both matched what I pictured but managed to surprise me at times. I’d be happy to see it again.\n- The best live experiences are when the audience is excited and totally onboard, and this crowd was. They were on the same wavelength as the show, in on its joke, and laughed hard, enjoying themselves every minute.\n\n**Overall**\n- 10/10 for the rush price, rush seat, and show/crowd. Completely worth it, and probably the best value for the show.",
        "num_comments": 7,
        "comments": [
            "It looks like you've shared an image. If this image is of a Playbill or stage, we ask that you provide your thoughts on the show[s] you saw in order to make your thread stand out and help the community enjoy your experience as well. Without context your photo is just another picture of a Playbill or a stage, and on a sub of far over 100k subscribers, If you don't want to share your experience... consider sharing it on your own social media! This is an automated message, if it is not applicable please report this comment.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Broadway) if you have any questions or concerns.*",
            "I won the lottery for tomorrow! My seats are first row right side. I hope it’s not too difficult to see everything.",
            "Nice, view looks pretty good.\n\nMind if I ask when did the show start? \n\nWas there a slight buffer, or did it start sharp on time?",
            "I’m going tomorrow and I cannot wait. I saw it off-broadway and was howling",
            "I think you’ll have a great time! Some action is set on that side which may be obstructed for you but the blocking keeps the actors moving around so they don’t linger on the far sides too much. Have fun!",
            "I’d say 5-10 minutes past time. Our start was 7:30 and we were done by 9.",
            "Thanks\n\nI was curious since I was able to see the show at the Lortel, and the show started 10ish minutes after listed time. Similar to you, 7:30 listed time, show started at 7:40. Which for an 80 minute play, makes sense. Was just curious if that was still something they were doing\n\nThanks once again."
        ]
    }
}