{
    "Brooklyn Summer 2024 Beat the Heat - Mega thread - please add": {
        "title": "Brooklyn Summer 2024 Beat the Heat - Mega thread - please add",
        "score": 8,
        "url": "https://www.reddit.com/r/Brooklyn/comments/1dl6i1d/brooklyn_summer_2024_beat_the_heat_mega_thread/",
        "content": "Hey r/Brooklyn,\n\nPlease post all your Brooklyn summer stay cool, have fun ideas, events, pools, beach, concerts, shady spots, AC, social services, festivals, free lunch, films, block party. What’s happening? \n \n\n\n\n**Cooling Centers Map**\n\nhttps://finder.nyc.gov/coolingcenters/locations?mView=map",
        "num_comments": 5,
        "comments": [
            "Take the ferry outta sunset park to the Rockaways!!!",
            "Good one",
            "Good one 👍",
            "Go to Nieves Cortes, a 3rd generation Mexian gelato aka nevero,   at 282 Knickerbocker 12237\n\n\nVideo about him In English:\n\n\nhttps://www.instagram.com/reel/C8R7DQDOm0H/?igsh=bHVlMzdoMXUxZmlo\n\n\n\nThis dude\nhttps://www.instagram.com/fideljr87?igsh=MTh4ZWVlMHBoZmdwNg==\n\n\n\n\n\nVideo \nhttps://www.instagram.com/reel/C8DYEjxuW06/?igsh=OGR2anY0ajEwc3Ix",
            "Brunch in Brooklyn: [https://www.eventbrite.nl/e/932536871887?aff=oddtdtcreator](https://www.eventbrite.nl/e/932536871887?aff=oddtdtcreator)"
        ]
    },
    "Lost dog near Prospect Park": {
        "title": "Lost dog near Prospect Park",
        "score": 215,
        "url": "https://i.redd.it/orqmkfyhze9d1.jpeg",
        "content": "Ramen ran away this morning at the corner of St John and 7 Ave. Last seen near the Central Library / Grand Army Plaza.\n\nHe is microchipped and vaccines up to date. He is friendly and does not bite.\n\nPlease don’t chase when you see him. He will likely run away faster.\n\nPlease contact if you have any leads. Thank you!",
        "num_comments": 22,
        "comments": [
            "Shibas are hunting dogs and they have high prey drive, I really hope you find this furry baby. Comment and upvote to boost visibility. \n\nPlease update us if you’ve found Ramen! Sending prayers. 🙏",
            "Engaging to boost post. I hope you find your dog.",
            "Will keep my eyes open! I hope you find your baby 🥹",
            "Good luck with your search 🫶🏼",
            "I shared it to my IG bc I know a bunch of folks who live near there. Really hope you find him.",
            "Boosting, best of luck with the search, will keep an eye out for the lil guy",
            "I’ll share this on my Instagram too. I hope Ramen is found soon!",
            "If hes microchipped than why wont you just access the chips data on the website and locate your lost dog instead of wasting time",
            "Thats not how microchips work.",
            "A microchip is like a dog collar, not an AirTag. If someone comes across it, it has info on the owner when scanned, but you can’t track it."
        ]
    },
    "Found a hurt pigeon, do you know of any rescues/ rehabilitators I could take her to?": {
        "title": "Found a hurt pigeon, do you know of any rescues/ rehabilitators I could take her to?",
        "score": 190,
        "url": "https://i.redd.it/586q4e6pzb9d1.jpeg",
        "content": "Looks pretty young, has a hurt foot. Found near Nah Minh in Ridgewood. ",
        "num_comments": 79,
        "comments": [
            "The Upper West Side Wild Bird Fund",
            "Wild Bird Fund is amazing! I've taken multiple pigeons there.",
            "Everyone already gave you the best answer. Wild Bird Fund. I took two injured pigeons there over the past two months. Unfortunately both had to be euthanized.",
            "You can also send a text message to the Wild Bird Fund at Tel. 6463062862 (I had an incident earlier in the week involving a baby bird that had been blown out of its nest and they were quick to respond and advise...)",
            "Def wild bird fund!!! I rescued a baby starling last month and brought it there. They are wonderful. They close at 7 if you can bring the bird there before then they can take it.",
            "There's a wild bird place on Columbus in the upper west side. I took a gosling up there from Chelsea Piers. Sadly it didn't make it, but look into that?",
            "The Wild Bird Fund at Columbus Circle -I’ve taken all kinds of injuries birds there over the years",
            "You can call the NYC Parks Service who can either help you or direct you to the closest resource",
            "seconding wild bird fund! my roommate adopted his pigeon rescue from there.",
            "I just recently cared for a pigon that I found that couldn't fly and looked sick. I just feed it some bread, store bought bird food, and water. It was flying two weeks later. Flew right out my windows, saw it in the neighborhood with its crew that same day."
        ]
    },
    "Writing Communities?": {
        "title": "Writing Communities?",
        "score": 0,
        "url": "https://www.reddit.com/r/Brooklyn/comments/1drb9f6/writing_communities/",
        "content": "Hi there,\n\nI am a new writer, I've been adding some of my short works on Medium and I'm also writing an ethnography documenting my college experiences (since they were historic). I just graduated from college, so I'm not making a ton of money right so I don't want to pay to be apart of it. I'm looking for a community of writers who are kinda crazy (the kind that love magical realism) and are open-minded/non-judgemental. A group that shares work, reads books and reflects together, etc. I live in Park Slope right now but am open to commuting too. Does anyone know of such communities?\n\nThank you!",
        "num_comments": 1,
        "comments": [
            "Check out some of the writing groups at center for fiction!"
        ]
    },
    "What's up with Union Hotel on Degraw between 3rd and 4th ave?": {
        "title": "What's up with Union Hotel on Degraw between 3rd and 4th ave?",
        "score": 18,
        "url": "https://www.reddit.com/r/Brooklyn/comments/1dqsv5z/whats_up_with_union_hotel_on_degraw_between_3rd/",
        "content": "I was just wondering if this is actually a hotel or if its something else (homeless shelter, love hotel, etc).  It seems like there are constantly a few people outside the hotel smoking cigarettes that seem like addicts and yesterday one of them became aggressive for no reason as I walked by with my girlfriend and accused me of touching my dick and looking at him (which would be gay and apparently worth beating the shit out of someone for, according to this man).\n\nWas just curious what this place actually is.",
        "num_comments": 17,
        "comments": [
            "It is what used to be referred to as a “welfare” hotel and it’s been that way for at least 30 years since noticed it was there . Many formerly fancy hotels ended up this way the St. George In Brooklyn heights was one until the late 90s , there used to be a few on Atlantic by Barclays",
            "It's pretty much always been contracted by the City as a shelter of one sort or another.",
            "I had to stay there last fall when I had to move out of my longtime apartment after my landlord died and I did not have a new apartment and was getting over Covid (I was in a more expensive hotel in downtown Brooklyn but then had to downgrade). I was a little concerned at first and yeah it had its quirks but it was okay. The rooms are nicer than the service, but, once you accept that, it’s basically okay. I didn’t interact with other guests. I didn’t see anyone smoking cigarettes or who seemed like addicts outside. They sort of skate by viewing themselves as a “budget hotel” like you shouldn’t expect too many towels. That was annoying. I was nervous at first but then I got used to it. It seems to me like a place people go when they need a budget hotel. I’m sure there’s far worse. And apparently some of the other hotels nearby cost like $350+ a night and are totally loud party hotels according to one of the staff there.",
            "I used to live right there and often wondered this. I don’t think it’s a shelter, I think it’s just a shitty hotel masquerading as a trendy one. It seems like it’s designed to be a tourist trap.\n\nIt’s also around the corner from the soup kitchen so you’re gonna get some homeless people hanging about. Most of them are harmless though. Sorry about your experience",
            "It’s most likely being used as a shelter. Almost all smaller hotels are now contracted by the city to house homeless or migrants. There was an article recently about someone in queens who was getting many lucrative contracts from the city to turn their hotels into shelters.",
            "And before you ask, of course I wasn't touching my dick.  I was licking my lips and rubbing my nips.",
            "It’s a migrant shelter now.",
            "Love hotels ? Do speak more 🤣🦅",
            "I stayed there last fall when I had to move out of my longtime apartment after my landlord died and then I was getting over Covid and it’s totally a “legitimate” hotel. It has some quirks for sure and it’s budget; I can’t speak to everyone who stays there but it was okay. I don’t know what a welfare hotel means.",
            "Do you mean an SRO?"
        ]
    }
}