{
    "Browser Recommendation Megathread - June 2024": {
        "title": "Browser Recommendation Megathread - June 2024",
        "score": 28,
        "url": "https://www.reddit.com/r/browsers/comments/1d5esli/browser_recommendation_megathread_june_2024/",
        "content": "There are constantly a zillion, repetitive \"Which browser should I use?\", \"What browser should I use for [insert here]\", \"Which browser should I switch to?\", \"Browser X or Browser Y?\", \"What's your favorite browser?\", \"What do you think about browser X? and \"What browser has feature X?\" posts that are making things a mess here and making it annoying for subscribers to sort through and read other types of posts.\n\n*If* you would like to keep the mess under control a little bit, instead of making a new post for questions like the above, ask in a comment in this thread instead. Then, one can choose to follow this thread if they want.\n\nPrevious Recommendation Megathread: <https://reddit.com/r/browsers/comments/1chcrsl/browser_recommendation_megathread_may_2024/>",
        "num_comments": 132,
        "comments": [
            "With the upcoming changes in Google Chrome and other Chromium-based browsers, is Firefox the only option to use extensions like uBlock Origin without any problems?",
            "Looking for a good Chromium-based browser with Chrome sync (other than Chrome). I use Chrome on mobile but want something else for my laptop.",
            "I would like to use a browser that is as efficient as, or nearly as efficient as, Safari in terms of power consumption. I alternated between Firefox and Brave, but still couldn't figure out which one is more efficient to use on an Apple Silicon chip. Can you guys recommend a browser to go forward with?",
            "can web browsers steal my data or sell my data? what do google know about me?",
            "Been using FF almost forever... last 8 years. \n\nI have a decent amount of addons I use all the time. Some for security and privacy, some for convienence. I usually have 3 tabs i use constantly plus 1-2 youtube tabs. Rarely go over 8-10 tab unless researching something.\n\nFirst off, is there an addon to clear ram after xx amount of time?\n\nNext are the other FF alternatives better on ram management and resources? Looking for a faster browser with built in better security so i can off load some addons and make it a bit faster feeling over all.",
            "Looking for a browser that can separate my personal account from my school account. What I like about chrome is that feature but chrome is taking up too much of my CPU which is annoying when you’re taking a timed exam (it only started doing this recently). Now I know opera can have separate workspaces but can you separate profiles like you can in Google (like separate windows for both gmail accounts)? Sorry if someone asked this already or it isn’t making sense.",
            "What's the best browser out there and why is it Baidu Spark Browser?",
            "I've been using Waterfox lately and have been enjoying the experience. I don't need many features and it feels quite minimalistic, and having installed uBlock Origin it is running great. Also, not being based on Chromium is a huge plus.",
            "I switched from Chrome to Opera/Opera GX earlier this year. I've found Opera better. But recently I've learnt about all their privacy scandals and ownership. Should any of the concern me specifically? Is my data/info under risk? I know almost all browsers sell data, but the general distaste of Opera is making me uncomfortable. Purely performance-wise and feature-wise, I do prefer Opera.",
            "Never understood why Chrome is so popular. Its absolutly horrible if you open tons of tabs at the same time and generally doesnt really offer any benefits above other browsers. Hell, other browsers actually use its technology end still somehow end up with less restrictions and handling things better then Chrome. Its not the age of internet explorer anymore, in comparision to which every other browser could shine, even Edge is actually pretty decent browser now so there is no NEED to install other browser unless you wish some extra features from there - and since its actually is based on Chromium as majority of other browsers, there arent many features that Chrome has and other dont. In last years its actually the around, similar to situation with stock android vs custom UIs that often have features years beyond what google offers."
        ]
    },
    "Windows and Mac browser RAM usage comparison for 2024": {
        "title": "Windows and Mac browser RAM usage comparison for 2024",
        "score": 9,
        "url": "https://www.reddit.com/r/browsers/comments/1dr173a/windows_and_mac_browser_ram_usage_comparison_for/",
        "content": "I done this test because I could not find a recent data set with every browser I use compared together.\n\nThese amounts were found out by visiting the top 10 most visited sites according to Brave Search data:\n\nGoogle.com, Youtube.com, Facebook.com, Amazon.com, Wikipedia.org, Instagram.com, eBay.com, Apple.com, Reddit.com and Yahoo.com\n\nAll websites had accounts signed in and all browsers used either Ublock Origin or the browsers native ad block (Safari used Adguard for Mac) Ad blockers were the only extensions enabled and private mode were turned on for all browsers to ensure the least amount of personal data was shared with the sites.\n\nThere are 2 sets of numbers, and they are categorized by High and Average. High is the max amount of ram found to be used during the testing and average is well the average amount found during testing. Testing time was 4 minutes per site.\n\nNow the numbers:\n\n|Browser|Windows High (MB)|Windows Avg (MB)|Mac High (MB)|Mac Avg (MB)|\n|:-|:-|:-|:-|:-|\n|Chrome|1603|1444|2219|1966|\n|Edge|1703|1437|2328|2048|\n|Brave|1471|1288|1874|1798|\n|Firefox|2308|2143|3239|3077|\n|Vivaldi|1698|1463|2213|1906|\n|Floorp|2439|2125|3681|3414|\n|DuckDuckGo|2497|2327|3827|3513|\n|Arc|1427|1273|1876|1670|\n|Opera|1723|1545|4075|3810|\n|Safari|-|-|2480|2213|\n\n*Note: Safari is exclusive to Mac. Sites were visited at the same time on each browser.*\n\n*Machine for Windows: Surface Laptop 3 with Intel Core i5-1035G7 CPU @ 1.20GHz, 8 GBs of RAM*\n\n*Machine for Mac: MacBook Air Late 2020 with Apple M1, 8 GBs of RAM*",
        "num_comments": 9,
        "comments": [
            "This shows that Brave is a browser that have a fair ram usage. It is also super fast for its speed, and have decent security and privacy. Built-in adblocker also included.",
            "Something I'll point out, using Vivaldi on both Windows and MacOS I've seen a major difference with a specific site that I'd assume uses a lot. Google Earth. \n\nMy windows PC has a Ryzen 7 5700X, a Radeon RX 6600XT, and 16 GB of 3200 MHz RAM, and Google Earth still feels like it stutters a lot on there. \n\nOn my Macbook, an M2 Air with the base 8 GB RAM config, no stutters at all. \n\nBoth have Vivaldi, latest update. \n\nAs a bonus round an old HP Elitebook I have, i5 6300U, 16 GB 2400 MHz RAM, running OpenSuse Tumbleweed also has no issues using Google Earth in Vivalid. \n\nNot the most scientific test, but scrolling, going into streetview, etc just feel snappier on anything that isn't Windows",
            "Apple: 8GB RAM iS liKe 16GB iN wInDowS",
            "But hardly anybody uses iApple iMac iOS iMacOS iSafari iBrowser.  Only a fringe group of religious zealots mostly contained to the US.  So what's the point.",
            "What would've been a more fair comparison is to test with no extensions at all, so just \"out of the box\" experience for each browser, with default settings.",
            "Arc for MacOS: 🥱",
            "I know the default setting for certain browsers is to have an ad blocker. The reason I added the ad blocker to the others is because I figured I would give more of a fair ground to the other browsers that don't have a ad blocker by default because without the ad blocker, the numbers would be significantly higher trying to load all the ads. I felt it would skew browsers with ad blockers to have an even bigger advantage if a advantage is found compared to others without it.",
            "Sure, But it shows a feature that some browsers don't have or enabled by default. Not everyone will install an adblocker either, so their experience won't be anything like this from this report.\n\nAdding extensions or change defaults will skew the results.",
            "I will try to test without a ad blocker and will update when possible to see the results"
        ]
    },
    "Firefox 128 will allow the main browser content background to be transparent": {
        "title": "Firefox 128 will allow the main browser content background to be transparent",
        "score": 4,
        "url": "https://old.reddit.com/r/FirefoxCSS/comments/1dqws4b/firefox_128_will_allow_the_main_browser_content/",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Is there an unmicrosofted edge?": {
        "title": "Is there an unmicrosofted edge?",
        "score": 52,
        "url": "https://www.reddit.com/r/browsers/comments/1dqgxak/is_there_an_unmicrosofted_edge/",
        "content": "Like the ungoogled chrome",
        "num_comments": 62,
        "comments": [
            "Edge isn't open source.",
            "No, because unlike chromium it's not open source",
            "Both edge and chrome are based on chromium. Unmicrosofted edge is just chromium, just like u googled chrome is chromium.",
            "I only wish there was still a version that could run on older versions of Windows, akin to Supermium.\n\nI also wish Edge still has square tab corners, or at least could revert to its pre-Chromium appearance.",
            "Your ungoogled Chrome is Chomium... Which is also the Unmicrosofted Edge.",
            "Edge started out pretty good, but they just keep adding more junk and clutter and even when I turned off some of the \"features\", I got nag screens wanting me to turn them back on. Maybe someone will create a O&O Shutup Microsoft Edge.",
            "Edge is closed source",
            "There isn't an unmicrosofted edge, since it is not opensource. Your best bet would be probably applying a microsoft edge theme on a firefox [(something like this)](https://github.com/bmFtZQ/Edge-FrFox) or you can try to find a theme for chromium, although i don't know if that's possible for chromium browsers",
            "edge is a microsofted ungoogled chromium, so to unmicrosoft edge, you can simply use ungoogled chromium",
            "I took an overview at Vivaldi, and I think Vivaldi might be it. though, idk is they have any form of an ai assistant at all"
        ]
    },
    "Download resuming": {
        "title": "Download resuming",
        "score": 2,
        "url": "https://www.reddit.com/r/browsers/comments/1dr2ayx/download_resuming/",
        "content": "When there's a network issue while downloading, especially huge files, brave supports resuming it once the connection is back. But Edge and Arc on windows don't do, so you have to restart all of it from start.\n\nAlso, fyi brave asks for location of where the file should be downloaded, so I guess it enables it to store the half-downloaded file in that location so we can resume. This doesn't happen on edge.",
        "num_comments": 1,
        "comments": [
            "\"prompt for download location\" or  \"Ask where to save each file before downloading\" is an option in most chrome based browsers including the evil {BECAUSE IT CHANGES MY SETTINGS TO SUIT ITSELF} edge."
        ]
    }
}