{
    "BTD6 Community event Conclusion!": {
        "title": "BTD6 Community event Conclusion!",
        "score": 481,
        "url": "https://www.reddit.com/r/btd6/comments/1djyb5z/btd6_community_event_conclusion/",
        "content": "[Happy 6 Years!](https://preview.redd.it/rqf3hk7ocm7d1.png?width=1024&format=png&auto=webp&s=369b1c335b3524ab8b6b7eb66196c83908f4463f)\n\nCongratulations! You all managed to get **1,642,838** pops!\n\nThis means you completed **6 out of 7 milestones**!  \n  \nHere is your list of rewards!\n\n**400 Monkey Money**  \n**19 Random Powers**  \n**90 Trophies**  \n**Two Race Passes**  \n**A Tier 1 insta pack**  \n**A Tier 2 insta pack**   \n**Five Tier 3 instas**\n\nThese will be sent out to all who participated soon!\n\nThanks for playing and keeping More Awesomer for another year!\n\n\n\n",
        "num_comments": 163,
        "comments": [
            "Tell us what the 7th milestone rewards were....",
            "i got one pop, can i also get an avatar that says \"participation trofy\" in comic sans ms font",
            "I feel like having this be a reddit-only thing was a significant misplay. Not only did a lot of active players certainly miss out (many will find out later and likely be annoyed). \n\nIts also poor design. If players in game got the announcement there'd be more hype. If there wasn't a nearly 3-day gap towards the finish line where we had no idea what our progress was we'd have pushed harder. Particularly if there was an in-game meter that showed progress...that would have been awesome and so much more fun.\n\nThe event was better than nothing but not by much.",
            "I think the game needs to do a slightly better job in game of advertising the events tbh. Without Reddit I would have had no idea just game it was happening.",
            "19 random powers... can you please add one more to make it 20? Please?",
            "I have no idea if I participated or not, because it was unclear. I did the birthday BAD event already so it said it was completed and it gave me a extra reward the other day but there wasn't any note that there was a special event going on with it?",
            "The fact that I only found out about this event after it had gotten to milestone 3 AND it wasn’t clear how to actually enter and submit scores makes this pretty annoying. I had even gone back to major announcements to see if anything had been made clear and found very little information.",
            "Respect to everyone who grinded the quest out, I got way too bored to do it after a bit",
            "Why was there not an in game notice for this? I didn’t even know it existed until seeing this post and only who participated get rewarded :( I don’t even know if I participated or how to participate",
            "Was there even a popup in game about this? I only found this event because of the discord pings. I had to dig back through the event quests to find it too, and it said \"already completed\", so if I didn't know better I wouldn't have even done it."
        ]
    },
    "Daily Challenge - June 22, 2024": {
        "title": "Daily Challenge - June 22, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/btd6/comments/1dlqlry/daily_challenge_june_22_2024/",
        "content": "Discussion about the today's daily challenge in Bloons TD 6.\n\nPlease keep all discussion, question and strategies about the daily challenge and advanced challenge to this post to keep subreddit clutter low.\n\nMake sure to distinguish whether you are posting about the daily challenge or the advanced challenge clearly in your comment.\n\n[Click here to see previous daily challenge posts](https://www.reddit.com/r/btd6/search?q=flair:\"Daily%20Challenge\"&restrict\\_sr=1&sort=new)\n\nHappy popping!",
        "num_comments": 21,
        "comments": [
            "AC: 502 Buccaneer\n\n[Video here.](https://www.youtube.com/watch?v=2KCSE1w8uqY)",
            "052 ace, use ability",
            "502 boat",
            "Ac: 502 bucaneer or a cheaper way: 103 ninja",
            "AC: 502 Buccaneer.\n\nDC: Rosalia, 420 Sub, 502 Wizard.\n\nOdyssey: https://www.reddit.com/r/btd6/s/fthDj5SrGi",
            "AC: 024 mortar",
            "502 buccaneer",
            "[AC: 050 Ace Monkey - use Ability](https://prnt.sc/k_s97NPagRkt)\n\n[DC: Rd 140+](https://prnt.sc/Zz5--6142kP9)",
            "[AC: 5-0-2 Buccaneer.](https://i.imgur.com/NpzsWOg.jpeg)\n\nIt's not that advanced lol.",
            "023 ninja also works."
        ]
    },
    "Why can't towers speak but Heroes can?": {
        "title": "Why can't towers speak but Heroes can?",
        "score": 849,
        "url": "https://i.redd.it/26k90bak508d1.png",
        "content": "",
        "num_comments": 94,
        "comments": [
            "Imagine every single monkey on the screen screaming in terror when they see a blimp, and then cheering once it's popped.",
            "Why is Brickell on non talking monkeys",
            "I think it's canonically cuz they're shy",
            "Because the towers know their place",
            "What do you expect from banana farm dude",
            "They *can* speak, but canonically, the monkeys don't see you as a god but rather their chief-in-command or something, so they do talk to each other but only the heroes have clearance to speak with you",
            "They can talk they just prefer to remain focused on the task at hand.",
            "We can? You just don't listen.",
            "They have stage fright",
            "The Heroes are their own Characters, the other Monkeys are more meant to be just that, the other monkeys, not Characters."
        ]
    },
    "maid monkey": {
        "title": "maid monkey",
        "score": 401,
        "url": "https://i.redd.it/w6vk3oa5318d1.jpeg",
        "content": "Collaborative painting with friend thinkin, each drawing a part",
        "num_comments": 38,
        "comments": [
            "smash, next question",
            "would",
            "Why’s Brickell so mad for? Who hurt her ship?",
            "Churchill?",
            "I assume Reddit did some automatic NSFW label? Cringe.\n\nAnyway good art",
            "Bunny Sauda? Nice.\n\n![gif](giphy|YR8neVRcCSqwmJkb1D)",
            "How is this nsfw",
            "\"I'm waiting for you Sauda 😌\"",
            "Great fanart, good job. \\^\\^",
            "Instant follow 🗣️🔥🔥"
        ]
    },
    "What upgrade do you think is really cheap for how good it is?": {
        "title": "What upgrade do you think is really cheap for how good it is?",
        "score": 184,
        "url": "https://i.redd.it/qg792ynua28d1.png",
        "content": "",
        "num_comments": 94,
        "comments": [
            "drat mkoney\n\nalso jungle drums",
            "Moab glue for sure.",
            "Dragon Breath, triple fireballs made very good job for R63",
            "neva missing targets (or something like that)",
            "Glaive ricochet is crazy. For like $600 or $700 you can get a massive pierce buff and the glaives now bounce from target to target. Basically the Ninja's shuriken but on steroids.",
            "Bit of an obvious one but robo monkey (especially with discount village). Also dragons breath and druid of the jungle",
            "airburst sub",
            "Honestly spike storm is ridiculously broken for clearing out moabs",
            "Glue Strike, +1 damage fir that price is really good",
            "Artery Battery"
        ]
    }
}