{
    "Update: Bloons TD 6 v43.1 - Update Notes!": {
        "title": "Update: Bloons TD 6 v43.1 - Update Notes!",
        "score": 381,
        "url": "https://www.reddit.com/r/btd6/comments/1d4ivhu/update_bloons_td_6_v431_update_notes/",
        "content": " \n\n**Update: Bloons TD 6 v43.1 - Update Notes!**\n\n# Changes\n\n* Fixed some idle animation loop issues with Rosalia so she no longer visually freezes\n* Rosalia should now play sound on target priority arrows (first, last, close, strong)\n* Extended the Resolution Selection UI as the last option was not visible on all resolutions\n* Resolved a crash that could occur using the \"Restrict\" button in Edit Odyssey menu\n* Players are no longer unable to view the team page for teams they have applied to\n* Standard game hints will no longer display during Boss Rush even when enabled\n* Team Message Board has been updated with better descriptions for ‘Improved Scores’\n* Relics on the Boss Rush Milestone Complete screen can now display their description\n* Paragons are now correctly localized in the Challenge Editor Tower Restrictions UI\n* Corrected an issue causing a large number of ‘things’ to not work as normally expected\n   * The main note here is for 'changed CHIMPS starts' on many expert maps. This occurred in 43.0 due to work in the background of the game rebuilding older more rigid parts to be more flexible and moddable, one improvement also caused a number of strange issues including collision detection to be checked slightly less frequently and wasn't noticeable in most cases aside from the very precise requirements of high end chimps maps.\n   * We are now looking into incorporating some of these 'precise CHIMPS starts' into automated testing to catch strange niche situations like this earlier in the future\n\n\\_\\_\\_\n\nFull list of changes for update 43.0 can be found here: [https://www.reddit.com/r/btd6/comments/1d3029q/update\\_bloons\\_td\\_6\\_v430\\_update\\_notes/](https://www.reddit.com/r/btd6/comments/1d3029q/update_bloons_td_6_v430_update_notes/)",
        "num_comments": 50,
        "comments": [
            "shoutout ninjakiwi team for being so fast to fixing a bug like the chimps starts \n\nthis is why you guys are the goat ! ! !",
            "auto-checking expert chimps starts for updates is a very cool idea",
            "Now this mini update is awesome. Good explanation with the whole issue with ruined precise CHIMPS starts and the issues behind the bug. Also, your efforts to automate CHIMPS starts as part of your game testing is a brilliant idea.",
            "There was a bug i think i ran into whilst playing Rosalia, and it's that the keybind that allows her to switch between weapons (i think its Monkey Special 1 or 2) doesn't work when trying to switch from the Laser pistol to the grenade launcher. Little tiny thing that would help me be able to manage her better. Thanks for fixing these issues so quickly as well!",
            "Other game devs: Oh, there's a bug you found? Wait until the next big update for us to fix it. Should take about a few months\n\nNinja Kiwi: Releases 2-3 mini-updates in 2 or so weeks just to patch all bugs possible",
            "I appreciate you guys pushing this update out so quickly so that Expert CHIMPS works again",
            "I love you NK but please make Rosalia attack when repositioning. The downtime is huge specially if you wanna micro her in advance and expert maps",
            "I've found this weird issue with Rosalia where she just stops aiming at the bloons. I think, after a few leave her range, she gets stuck aiming at one spot, and when new bloons enter her range she just shoots off into nothing. Hoping this can get fixed in a patch? It's kind of annoying",
            "Thanks for getting this out so quickly!",
            "I had an odd bug happen to me after update 43, not sure how to repeat it but after repositioning Rosalia she would attack towards the top of the screen for a few seconds before targeting bloons. This happened twice but I'm not sure why"
        ]
    },
    "Daily Challenge - June 29, 2024": {
        "title": "Daily Challenge - June 29, 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/btd6/comments/1dr66dq/daily_challenge_june_29_2024/",
        "content": "Discussion about the today's daily challenge in Bloons TD 6.\n\nPlease keep all discussion, question and strategies about the daily challenge and advanced challenge to this post to keep subreddit clutter low.\n\nMake sure to distinguish whether you are posting about the daily challenge or the advanced challenge clearly in your comment.\n\n[Click here to see previous daily challenge posts](https://www.reddit.com/r/btd6/search?q=flair:\"Daily%20Challenge\"&restrict\\_sr=1&sort=new)\n\nHappy popping!",
        "num_comments": 12,
        "comments": [
            "Ac: x4x super just spam ability (though 042 is faster and better) or 025 boomerang",
            "AC: 250 spike factory, spam ability.",
            "AC (unintended solution): 402 sniper until the zomg pops, then sell for 040 pirate and spam ability",
            "AC: 0-5-0 plane & spam ability",
            "Daily Challanges Review:\n\n\n\n\n\nAC: This is a repeat from the AC 2 days ago (an ZOMG with an absurd amount of money so it really isn't hard at all), although there's some modifier and stuff so there's atleast some substance this is just... wow, 0/10\n\n\n\nDC: It's just pat with some random towers with nothing in common with eachother, idk what to expect but it's not the worst thing out there, 4/10",
            "025 boomerang",
            "Or 205.",
            "AC: Place 250 Spike factory anywhere.\n\n[Video here.](https://www.youtube.com/watch?v=tmtASDaHNPg)",
            "[AC: 2-5-0 Ace, spam the ability.](https://i.imgur.com/5PCXFff.jpeg)",
            "[AC: 250 Spike Factory](https://prnt.sc/3IKmxIFrVVpu)\n\n[DC: Rd 200+](https://prnt.sc/Gm9nlpBuCmuY)"
        ]
    },
    "Tell me your Bloons hot takes and I’ll rate them based off of how hot they are": {
        "title": "Tell me your Bloons hot takes and I’ll rate them based off of how hot they are",
        "score": 667,
        "url": "https://i.redd.it/wqed3yoblg9d1.jpeg",
        "content": "",
        "num_comments": 144,
        "comments": [
            "quincy is a nice hero if utilized properly",
            "Corvus should level up faster at base and nourishment should be nerfed hard to compensate. Currently the Corvus strats are very boring and its just constantly spoonfeeding him XP which isnt engaging or fun",
            "Bloonchipper should be in Bloons Card Storm and Bloons TD Battles 2, but ***NOT*** Bloons TD6. Card Storm and Battles 2 have ways of making balancing the 3 paths functional (Such as Card Storm, um, not having paths lol) but BTD6 doesn't really have that luxury.",
            "Crossbow master is a good tower, some people just dont understand that the tower wasnt made for insanely high challenges and was made for the purpose of being cheap and good for its cost, not to be reliable late game",
            "rosalia needs a buff: instead of switching between weapons and duel wielding during ability, she should (maybe at level 15 or higher for 'balancing' sake) always duel wield her weapons if she's able to do so, theres no reasonable explanation why she shouldnt be able to duel wield while pursuing bloons but be unable to duel wield when standing or flying in place without moving it just feels weird",
            "challenges are getting repetative, most of them are not original but are still popular and that's what I don't like.",
            "Geraldo is easy to use, people just get overwhelmed by the options and assume he’s as hard to use as corvus",
            "Glue gunner is amazing for mid to early-late game. Especially top path, but I might be biased because I like using it. Recently learned bottom path is better because of slowdown instead of pierce, but then again idk, I don't use relentless enough like I should",
            "Hot take: beast handler is good",
            "Super Monkeys are cool but not worth the cost."
        ]
    },
    "And they say he is ass": {
        "title": "And they say he is ass",
        "score": 150,
        "url": "https://i.redd.it/ifa47axjmh9d1.jpeg",
        "content": "",
        "num_comments": 19,
        "comments": [
            "he receives $850 and a hero slot smh",
            "What do you mean Camo Detection is good ? How about giving the bloons \"You arent camo anymore!\" treatment.\n\n* This message was written by Decamo Squad.",
            "camo isnt exactly hard to come by in 2024. You'd much reather be running almost anything else in almost any situation",
            "850 gold, a hero placement, 100-25% of the exp depending on how many other heroes. If his main drones were just a tiny bit better, I'd agree that he's good. Or if Phayze couldn't dispel the camo detection he provides.",
            "many monkeys can see camo and the village exists, he's way weaker for start up and mid rounds he's okay but still he isnt powerful or weak he's good that's it",
            "Say what you will, he's an absolute beast in late game meta",
            "Free global camo detection is something I will rarely turn down.",
            "“Ninja _monke has entered the chat”",
            "this is exactly what i was gonna say",
            "Best decamo is hand bands"
        ]
    },
    "Aw hell nah yo ass tweaking ninja kiwi": {
        "title": "Aw hell nah yo ass tweaking ninja kiwi",
        "score": 90,
        "url": "https://i.redd.it/yy2py2mcxg9d1.jpeg",
        "content": "muddy puddles?",
        "num_comments": 19,
        "comments": [
            "btd6 players when slight adversity",
            "The boss is not a problem it's the rock bloons that will kill you...",
            "This is one of the bosses of all time",
            "speak for yourself man i love muddy puddles its my favourite map",
            "Why ninja kiwi why this map",
            "It's easy prices so you can snowball.",
            "I'm only worried about the Rock Bloons. Those things will end my run.",
            "Or a  tower that had a gun that had full map range with either great strength or great pierce or great speed or a mini gun like tower that shot bullets that did huge damage to moab class bloons or a tower that shot a missile at the strongest bloon on screen when you hit a button like really man we should be developers for ninja kiwi we have great ideas",
            "Boss Events do seem to be getting harder every month. At least this Dreadbloon isn't stacked with ridiculous rules.",
            "I just like clumping up my defenses"
        ]
    }
}