{
    "Welcome Fellow Travelers - This is what r/BudgetAudiophile is about": {
        "title": "Welcome Fellow Travelers - This is what r/BudgetAudiophile is about",
        "score": 190,
        "url": "https://www.reddit.com/r/BudgetAudiophile/comments/k1ird5/welcome_fellow_travelers_this_is_what/",
        "content": "Every sub-reddit has a focus - it's raison d'etre *(reason for existence).*  **Because** if you don't focus, people stop participating because it has just become one big mess of topics.\n\nOurs focus is ... education, discussion, and sharing of entry and mid level separate & multi component audio systems.   **Generally speaking, that is 2 channel stereo systems** assembled for music listening - things that are both \"budget\" and \"audiophile\". So being budget is not enough, nor is being \"audiophile\". Generally speaking, **UNDER** $1,000 spent per component is our threshold, although obviously that number will vary by the person.   Budget for me was $50 (all in) at one time.  Now I am fortunate that if I want to, I don't mind spending $500 a piece.  Others can go more - good for them.   \n Try [r/audiophile](https://www.reddit.com/r/audiophile/) if your spending more than $1,000 per componant.\n\nOf course, many of us use our music listening set ups for multiple purposes - so 2.1 (adding a subwoofer), 3.0 (L/R with a center channel), 5.1 (surround) and up are also fair game.  But the fundamental goal of this reddit is better 2 channel and 2.1 systems to play music - as good as we can afford.\n\nWhat we are not is ***soundbars, boomboxes, bluetooth speakers PC branded audio solutions.*** Those things have their place, but it's not our reason to exist. As for just the soundbar aspect that belongs at  [r/soundbars](https://www.reddit.com/r/soundbars/)\n\nIn addition, **we are not about IEM's or Headphones** (try [r/headphones](https://www.reddit.com/r/headphones/) or [r/HeadphoneAdvice](https://www.reddit.com/r/HeadphoneAdvice/)). That is their reason for existence. Yes, they can be budget audiophile, but again, it's not our focus.\n\nWhile part of \"budget audiophile\", for more detail, try [r/turntables](https://www.reddit.com/r/turntables), [r/vinyl](https://www.reddit.com/r/vinyl/), and [r/hometheater](https://www.reddit.com/r/hometheater/) for questions specific to them. There will be a better chance of a more educated response there to those issues. Those questions are welcome here, but probably better there once you get past \"budget\". Questions on Vintage equipment? [r/vintageaudio](https://www.reddit.com/r/vintageaudio/) is the place for you to get better advice (likely)\n\nDIY is also part of \"budget audiophile\", but [r/diyaudio/](https://www.reddit.com/r/diyaudio/) and [r/diysound](https://www.reddit.com/r/diysound/) focuses a lot more heavily on that issue.\n\nSo to reiterate, we don't hate headphones, logitech, or soundbars, etc. But those questions don't belong here and your post may well be deleted or closed. Because those are not the issues we have chosen in BudgetAudiophile to make part of this sub-reddit. You may not agree, but that is what it is.\n\nWho is this \"we\" I speak of? Creator [u/averagejoeaudiophile](https://www.reddit.com/u/averagejoeaudiophile/) and the rest of the mods.",
        "num_comments": 42,
        "comments": [
            "With the holiday shopping season under way perhaps it makes sense to pin this until the first week of January?",
            "Comments got turned off my post for my setup because it includes headphones, but it also includes a DAC and headphone tube amp. I was really looking forward to discussing this in r/BudgetAudiophile because I'm curious about people's comments on my entire setup, not just my headphones. I also specified the type of music that I'm interested in. I know I'm new here, but I wasn't asking really asking for headphone advice, just general input.",
            "What prompted this post at this particular time? As a fellow mod, I'd like to know.",
            "i just posted a thread about a new youtuber who focuses on affordable audio gear reviews and it was deleted.  is there a rule against posting stuff like this?  i would say it falls in line with budgetaudiophile.   the content he posts i think the majority of this sub would find helpful.",
            "if your focus is education and discussion then why did you disable a post that was clearly from someone who did not know a lot about audiophile gear, ANDD why did you block me from the sub for a week because i was defending him??",
            "I found this really helpful, thanks",
            "Should apply to home theater stuff too such as budget friendly or cost effective 5.1 etc",
            "Is there a place where I can read up about good, dry, evidence-based audio advice?  I am just looking for a safe haven of reliable advice in this sea of snake oil. I do not want to find out I wasted lots of money afterwards. For example:\n\n* Do I need a DAC if I have an expensive gaming motherboard and don't hear any issues (if so, which one)?\n* Do I need a seperate amp for low-impedance headphones? Is there an actual improvement over an on-board amplifier?\n* What are the common placebo effects regarding audiophile equipment? i.e. \"I can hear a clear improvement between my $500 and $6000 amp, it scales so well!\" while an amp should not distort sound at all and should be able to power your headphones/speakers so any cheaper one that ticks that box will do.",
            "I'm looking for a sub to discuss, say, the differences between the Bose Wave system, and the higher priced Como Audio Musica.  Is this it?",
            "Is there somewhere to list items for free if we need to clear out some equipment, but want to make sure it goes to a good home that will actually use it?"
        ]
    },
    "It kinda sucks but it’s mine. Featuring a homemade rack case and spaghetti": {
        "title": "It kinda sucks but it’s mine. Featuring a homemade rack case and spaghetti",
        "score": 44,
        "url": "https://i.redd.it/w2il6n7f8e9d1.jpeg",
        "content": "Just a simple little listening/sampling setup I’m gonna take with me to college this fall :)\n\nFrom top to bottom:\n\nTechnics SL-Q2 ($135 + $150 for vm95ml)\n\nFurman Rackrider Power Conditioner ($40)\n\nAmerican Audio UCD200 ($80)\n\nTascam 302 MKii (free from church)\n\nSamson 31 band eq (also free from church)\n\n(Second part of cd player)\n\nTascam US1641 (Found this in a dumpster at work)\n\nNAD 1600 ($180)\n\nAdcom GFA-535 ii ($140)\n\nRack case costed maybe 100 bucks to build?\n\n\n",
        "num_comments": 6,
        "comments": [
            "Fun :)\n\nLooks great from the front",
            "https://preview.redd.it/kxbzcdfi8e9d1.jpeg?width=3024&format=pjpg&auto=webp&s=c4a9964c4de93e547f7963642020f0a29ec3a760\n\nHere’s the spaghetti. My favorite part is the pre out using 2 jumper cables lol",
            "This doesn't \"kinda suck\" at all.  It's fantastic.  Nice build.",
            "The title is a brilliant rebuttal! Should print it on a t-shirt! Enjoy the music!",
            "Also forgot to mention I have:\nPolk xt15 speakers ($130)\nVelodyne CHT-8 sub ($64)",
            "Check out the cable management stuff on amazon.  Some of the stuff is really handy."
        ]
    },
    "New Setup": {
        "title": "New Setup",
        "score": 51,
        "url": "https://i.redd.it/fw70u62c9d9d1.jpeg",
        "content": "Dali Spektor 1 speakers \nTopping E30 II DAC\nFosi Audio ZA3 Amp\n \nAlso have an old PC set up as a Roon server with Tidal, hooked up to the DAC via USB. \n\nThe sound is amazing imo. Only tweak to is a 2dB boost on bass at 150 Hz via Roon EQ. Otherwise great for a wide range of music, including pumping electronic, classical, traditional bands. Highly recommended.",
        "num_comments": 22,
        "comments": [
            "Topping E30ii is the best budget DAC.. got the sequential AK4493 chip in my FiiO headphone amp for my work PC and just had to get the same sound for home.  Brilliant implementation, Topping is great chi-fi.",
            "How does Dali spektor 1 compare with Dali oberon 3, which is the better speaker.  Would it be a good configuration with Wiim amp some of them?  Excuse my ignorance.",
            "For fun you should try integrating a CD transport into your Topping E30.\nI’ll bet it would sound great .",
            "I have that topping dac I hate it. Fuck those stupid fucking capacitive “buttons” and fuck whoever invented them that guy fucking sucks donkey dick",
            "All in for this setup btw:\n\nDali Spektor 1: €252 (got second hand for €100)\n\nFosi Audio ZA3 amp - €195\n\nTopping E30 II DAC- €193\n\nQED Speaker Cables - €30\n\nBanana Plugs: €18\n\nUSB to USB B Cable 3m - €10\n\nRCA cable - €12\n\n----\n\nFULL VALUE : €710\n\nI PAID: €558",
            "DALI is a huge sleeper brand. They sound amazing.",
            "Very good bang for buck system.",
            "Sweet setup",
            "I’ve had almost the same setup. V3 in place of ZA3. Sounded great, just had to PEQ it a bit. Enjoy!",
            "Did my research and must say it is quality. Paired with the ZA3, it's sweet."
        ]
    },
    "Electrostatic speakers...are they good?": {
        "title": "Electrostatic speakers...are they good?",
        "score": 79,
        "url": "https://i.redd.it/r2015wm02c9d1.jpeg",
        "content": "Anyone know anything about these speakers or know if they are any good? The badge at the top says Magne Planar",
        "num_comments": 41,
        "comments": [
            "That's not an electrostat, it's a planar magnetic. Magnepans are really great but they require some high current / big amps as they produce a impedance load that can be 'unfriendly\" to some smaller amps.  Also, don't expect big cabinet speaker low bass or large scale dynamics.  If you have a subwoofer, this won't be a big problem.  Also, place them well away from the back walls and side walls the best you can and if set up properly, they can be freaking great!",
            "\"Maggies\" as the brand is nicknamed are high end audiophile stuff. \n\n[https://magnepan.com/](https://magnepan.com/)",
            "I have Magnepan speakers and will highly recommend them. Incredible clarity and soundstage. Buy them, you will not regret it. Mine I got used off eBay a long time ago and it was my best buy ever.   \nYes you could get a subwoofer and I myself may one day pair these with a subwoofer. I use a vintage Onkyo Integra A-9911 amp that can deliver 90 Watts to 8 Ohm speakers and 160 Watts to 4 Ohm speakers. The Magnepan are 4 Ohm so there is enough power. But still I only turn up the volume to 11 o'clock and that's really extremely loud already. So I never have to go past that. That's why I believe that even a 60 Watts 8 Ohm amp would do just as well as it will put out much more wattage into 4 Ohms, like around 120 Watts and that should be sufficient.",
            "Sitting in front of my LRSs now.\n\nShort answer is YES.  \n\nLonger answer, as others have already said, with a high-current, powerful amp and a sub (doesn't have to be expensive) and far from walls, FUCK YES.",
            "I recently bought a pair of Magnepan LRS+ and I love them. Paired them with a used Outlaw RR2160 MKI and it drives them effortlessly. Totally agree with what others said about you either like them or you don’t.\n\nThey have a holographic imaging quality like nothing I’ve ever heard (granted, I’m very new to this hobby) and overall their sound is very crisp and detailed - but they have a very narrow listening position, are finicky about placement with regards to distance from the wall, room shape, treatment, and ceiling height, and they need power to really sing.\n\nEverything that makes them special fades away as soon as you move out of the optimal listening position. For me, it’s not a problem. They still sound great outside of the listening position and sitting in the sweet spot is truly something else. If you have a chance to demo them, I highly recommend it.\n\nThey definitely need a subwoofer and an active crossover, so keep that in mind. Also my setup is not budget, but rather “somewhat affordable-ish entry-level to high-end audiophile”, I guess. The LRS+ cost $995 plus $115 shipping. I got the Outlaw amp for $600 used, but they are $1000 new or $900 for B-Stock. I’m currently using a Yamaha sub that I plan to replace with an RSL Speedwoofer 10E when they come back in stock. That’s roughly $2000 or $1700 without the potential subwoofer upgrade in the future.\n\nIf you gave the space, you can always opt for the used market with Maggies and save a few hundred. I went with LRS+ because of space restrictions and the appeal of a warranty.\n\nTL;DR - they’re great, but not for everyone. They’re also not budget, and require you to do mad homework on what amps can drive them. Most models lack bass and require a subwoofer with active crossover. Room size and placement matters, and their sweet spot is narrow even when you get all that right - but once you do, they sound incredible for the money.\n\nhttps://preview.redd.it/g4o2bfj5nc9d1.png?width=4032&format=png&auto=webp&s=ba849142e1a1a9be324a7d93b8ffe147d13bb6b9",
            "Looks like [Megnepan](https://magnepan.com/) they sound amazing but need a fair bit of grunt to power them. I read that when the mfg demonstrates these they use a Schiit Vidar so no need for exotic electronics. The older ones tend to delaminate but the mfg sells repair kits as I understand.",
            "I've made quite a few electrostatic speakers over the years, panels, HV power suppies, and even transformers I wound by hand myself. I love them with passion. Currently, I'm upgrading some Audiostatic DCI speakers. I'm sure you'll love them if set up right in the right room with a good amplifier.\n\nEdit:\nI do see now that these are magnetostatic speakers. Still excellent with the correct amplifier.",
            "You either like them or you don’t.   I am in the don’t camp",
            "They are very nice!",
            "Planar magnetics offer a level of transparency, speed that conventional cone drivers can only dream about. However, they are quite inefficient and need a high current amp to sound best.\n\nShould match these type of speakers to a high quality source."
        ]
    },
    "New to me ADS 780/2's": {
        "title": "New to me ADS 780/2's",
        "score": 20,
        "url": "https://i.redd.it/8m9achqisd9d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "The woofer on the right has had work done, I'm thinking the rubber surround was replaced or at least re-glued in a sloppy DIY fashion. Everything else looks fine.",
            "Sweet, mint condition too 👍",
            "Oh those are nice!  Would love to hear those!",
            "Looks like 2 lefts…..",
            "I love me some a/d/s.",
            "Yeah, ADS arranges their speakers differently than most makers."
        ]
    }
}