{
    "**Sticky Post For Travelers Coming To Buenos Aires** Please read first before posting travel questions": {
        "title": "**Sticky Post For Travelers Coming To Buenos Aires** Please read first before posting travel questions",
        "score": 317,
        "url": "https://www.reddit.com/r/BuenosAires/comments/11xhcx1/sticky_post_for_travelers_coming_to_buenos_aires/",
        "content": "A work in progress...\n\n**General rules of thumb:**\n\nBuenos Aires is a huge, bustling, diverse city with an infinite amount of things to do. Tons of restaurants, cafes, wine, tango, steak, futbol, theater, beautiful architecture, lots of things going on.\n\nWe are going through some tough economic times, but we are resilient. Many are multi-decade veterans of these unfortunate circumstances. Keep in mind that there are many families really struggling under the high inflation and slow salary/wage raises these days. What was once a healthy middle class that traveled the world can no longer comfortably reach the end of the year (some cases, month). Being respectful and aware of this will ensure a fun, safe trip. Which leads us to...\n\n**Blue Rate, Money Exchange, Credit Cards, Western Union, etc**: This site and their [article about the blue dollar](https://landingpadba.com/money-argentina-exchange-rates-atm-withdrawals-credit-card/) keeps things relatively up to date with what is happening and why it is happening.\n\n* Where to change money? You'll want to find a \"casa de cambio\" which can be found searching in Google maps. Shop around for the best rates.\n* Avoid using USD, Euros and foreign currency for day to day transactions or negotiating. Switch to pesos at the blue rate. We are in the midst of a rough economic crisis and well, this sucks for us. It could come across poorly to your Argentinian hosts when a traveler flashes their stable currency and push for a discount or can't be bothered to have the local currency.\n* Visa and Mastercard are giving the \"MEP\" rate which is about 15% less than the blue dolar rate. It is more convenient, but note that many locations do not accept credit cards as the merchant fees are high. There have been many reports of the charges appearing at the official rate and then correcting to the MEP rate a few days later. Keep an eye on your CC statement.\n* Western Union has locations all around the city. Consider setting up an account with them and wire yourself money. You'll receive it at the blue dollar rate minus their fee. (Hint: Do not send large amounts in one transaction as many locations run low on cash)\n\n**What's the weather like in the month of\\_\\_\\_\\_**\n\n* [Magic internet predictor](https://www.google.com/search?q=weather+in+buenos+aires&oq=weather+in+buenos+aires&aqs=chrome.0.0i512l10.2658j1j4&sourceid=chrome&ie=UTF-8)\n* Generally speaking, humid most of the year which exaggerates the feel of whatever temperatures we're experiencing\n\n**Getting around: Taxis, Uber, Buses, Subway**\n\n* Lots of taxis in the city, but as a traveler you'll likely want some accountability as there are some bad apples in the bunch. Hail cabs that are connected to large companies like Radio Taxi. Taxis take cash only 99% of the time. Get your pesos ready.\n* Almost everyone, drivers and riders, rounds up to the nearest round number. Ex: Taxi fare is $711, round it up to $720.\n* To add a measure of safety use [Cabify](https://cabify.com/en), a local taxi app\n* Uber, DiDi and others function here, but do not like the \"Pay with card\" option. Change it to cash to help prevent cancellations.\n* To use the public transportation you will need a [SUBE card](https://turismo.buenosaires.gob.ar/en/article/getting-around). Depending on when you read this they are currently in short supply so head to the largest subway terminals (end points of the subway lines). Check kiosks, lottery stores that say they have SUBE. \"*Discúlpame, tienen tarjetas de SUBE?*\"\n* When using the bus system tell the driver where you are heading to 1. Make sure you are on the right bus heading the right direction 2. For him to properly price your bus fare\n\n**Safety:** This is a tricky one and very relative to you, your hometown, your instincts and your past travels. Buenos Aires has it's grittier side, but generally speaking very little violent crime compared to cities of equal or greater size. It is the safest large metropolis in South America. General rules of thumb:\n\n* Leave your nice jewelry and watches at home. No need to draw extra attention to yourself.\n* Crime here is mainly opportunistic. Leaving your phone on a cafe table, setting your purse on the back of your chair, using your lap top at a sidewalk cafe are scenarios we avoid.\n* [General map of safer and potentially problematic areas](https://www.google.com/maps/d/u/0/edit?mid=1du2sGmyQmZUrKrs9fyo-CEYBeVc&msa=0&ll=-34.60627143983544%2C-58.40516275&z=13)\n* Keep in mind that thieves look for easy, disoriented or distracted targets.\n* Thousands upon thousands of travelers come here annually with varying levels of Spanish. Seeing or helping travelers out is nothing unusual for us.\n\nCommon scams:\n\n1. [Mustard trick](https://www.tripadvisor.com/ShowTopic-g312741-i979-k7229522-Beware_the_Mustard_spray_scam_in_Buenos_Aires-Buenos_Aires_Capital_Federal_District.html)\n2. Sock salesman approaches your table to sell you something, places goods on top of your phone or wallet on the table and after some distracting chat leaves with his merchandise and your valuables hidden underneath.\n3. Bill switch. When paying for something with, say a $1.000 bill, the receiver claims you only paid with a $20 bill. Typically done at night as the colors are somewhat similar.\n\n**Where to stay**:\n\n* Recoleta- Old money, French and Italian style architecture, well located for access to many of the city's sites\n* San Telmo- Grittier, cobblestone streets, old school street lamps, tango, antique stores\n* Palermo Soho- Lots of cafes, designer shops, trendy restaurants, boutique hotels\n* Palermo Hollywood- Lots of cafes, trendy restaurants, a bit quieter than Palermo Soho\n* Villa Crespo/Chacarita- Up and coming area, newer bars, cafes\n\n[More info on neighborhoods](https://www.lonelyplanet.com/articles/best-neighborhoods-in-buenos-aires)\n\n**Things you should not miss...**\n\n* Wine...*madre mia* our wines are good and ridiculously affordable. Argentina focuses on malbec, which is a robust wine, but plenty more to try.\n* Fernet and coke, local favorite cocktail\n* Steak. Go to a \"*parrilla\"* (steakhouse) and feast. Don Julio is internationally famous, but there are plenty of others that have the same caliber of quality. Check out La Brigada, La Cabrera, Lo de Jesus, Carnicería, Parrilla Peña and many more that are simply your local, neighborhood parrilla.\n* Fútbol. We are the champions after all! Just be aware that getting tickets is not always easy and many clubs are loaded with season ticket holders and club members reducing availability of tickets sold publicly. Search the sub for various suggestions and leads. [LandingpadBA](https://landingpadba.com/buenos-aires-soccer-tickets-2023-2024-games/) is a common starting point for Boca Juniors and River Plate.\n* [Mate](https://en.wikipedia.org/wiki/Mate_(drink)), a slightly bitter tea drunk from a hollowed out gourd and filtered straw\n* If you can, see an event at [Teatro Colón](https://teatrocolon.org.ar/en)\n* Winter, la pista de patinaje sobre hielo?\n* Night life...it is insane here compared to many other countries' restrictions with closing times and such. Bars, clubs, restaurants are all open late. The average dinner time is around 9:00 pm and many people do not leave to go out to the bars until 12 midnight. [Recent post about best clubs in Buenos Aires](https://www.reddit.com/r/BuenosAires/comments/141xxzz/mejor_boliche_de_capital/)\n* Recoleta cemetery, Plaza de Mayo, Casa Rosada, wandering around San Telmo, shopping in Palermo, take a stroll through the rose garden...if you want a more in depth learning experience hire on a local bilingual guide. They are required to get a degree in tourism and really know our stuff here. Or hop on one of those [double decker city tour buses](https://www.buenosairesbus.com/?lang=en) the city offer.\n\n**Avoid**\n\n* Visiting La Boca outside the touristy area or at night\n* \"Exploring\" impoverished neighborhoods\n* Renting a car- it is not necessary if you are staying in Buenos Aires. There are thousands of taxis, Ubers and the sort.\n* Cars here seem to think they have the right of way. Careful crossing streets with no traffic signal which make up most intersections in the neighborhoods.\n\n**Controversial**\n\nSome people are going to ask or seek anyway so we might as well point you in the right direction. We'd rather not see weekly posts asking where one can find the devil's lettuce or where to see boobies. By no means are we encouraging, but rather trying to reduce these types of questions and prevent the sub from becoming a market place for sketchiness.\n\nWhat's the deal with weed?: Technically illegal, but tolerated. Lots of people will light up in the street with little fear of repercussions. Search Telegram for sales. Be street smart.\n\nProstitution: Again, technically illegal, but tolerated. Street walkers are not common and actively prevented. Google will be your friend using Spanish vocab.\n\n**Where else should I go in Argentina?** Most common suggestions are:\n\n* Iguazu Falls (Ridiculous amount of water falls in beautiful national park)\n* Mendoza (wine, scenery and more wine)\n* Bariloche (hiking, beautiful scenery)\n* Jujuy, Salta (Northern culture, scenery, salt flats)\n\n**Good reading/research:**\n\n[Another general rundown of everything you need to know in Buenos Aires](https://www.reddit.com/r/BuenosAires/comments/wuga6c/are_you_coming_to_caba_heres_a_quick_guide/) (gracias /u/MrKiwi24)\n\n[Restaurants, bars and cafes from a local expert](https://pickupthefork.com/)\n\n[New York Times: 36 hours in Buenos Aires](https://www.nytimes.com/2020/01/16/travel/what-to-do-36-hours-buenos-aires.html)\n\n[Active Facebook group in English](https://www.facebook.com/groups/BuenosAiresExpatHub/)\n\n[Eater: 38 essential restaurants in Buenos Aires](https://www.eater.com/maps/best-buenos-aires-restaurants-argentina)",
        "num_comments": 90,
        "comments": [
            "No se como citar. Pero me encantó la sección de 'Magic weather prediction' jajaja. Buen post",
            "Great post.\n\nBut, having to click on that magic weather link is SO HARD! Can't you just tell me the weather?",
            "No podia faltar winter, la pista de patinaje sobre hielo",
            "Buenísimo post.\n\nExisten los mostaceros todavía? Creí que con 9 reinas habían desaparecido",
            "Good post! This should be stickied or pinned to the top and updated frequently.\n\nThe entire money situation is also worth it's own dedicated post. Things change so frequently.\n\nAlso, suggest to add to the \"things to do\": a day trip to Colonia, or to Tigre, a dia de campo for a bit of gaucho time. Puerto Madryn for whales & other sea life. \n\nI've found lots of great restaurants on Instagram from local foodie & BA tourism influencers, street life bloggers. A simple search will get you started.",
            "I just got back from Buenos Aires! Loved the city and the people. Here was my experience:\n\nCabify: I never could get it to work. I ended up using the taxi stand at the airport and then just hailing taxis in the city. We didn’t have any issues. Another person in our group used Uber and that worked fine also.\n\nMoney: I exchanged USD for pesos at the airport (Banco Nacion) and got what I think was the “official” blue rate: 197.5. The hotel we stayed at offered 240, and many other places offered as high as 340. Make sure any cash you bring to exchange is free of markings and tears. If you really want the best rate you can shop around, but if you’re only there a few days, ask if it’s worth shopping around for rates for the equivalent of a few USD. \n\nSafety: I never felt unsafe—just use common sense as you would traveling in any large city. Locals were super friendly and most spoke a little English. With my rusty Spanish, I made it work. Learn the basics and also if you like bottled water “sin gas” (still) or “con gas” (sparkling). The tap water is safe to drink.",
            "Te prometo que un gringo hará estas preguntas dentro de la próxima semana.",
            ">Visa and Mastercard are giving the \"MEP\" rate which is about 15% less than the blue dolar rate. It is more convenient, but note that many locations do not accept credit cards as the merchant fees are high. There have been many reports of the charges appearing at the official rate and then correcting to the MEP rate a few days later. Keep an eye on your CC statement.\n\n\nI just returned from Bs As using a foreign Mastercard and I can confirm that this is the case for Mastercard - you'll be charged at the official rate and 2-4 days later (can't remember exactly) you'll be reimbursed for the difference. In my case it was listed at two separate transactions, first \"Restaurant x -500\" and then a couple of days later as \"Resturant x +200\". \n\nI read that this is not the case for Visa cards, which are supposed to charge the MEP rate immediately, but I can't confirm that.",
            "Agregaria Belgrano tambien como buen lugar para quedarse...es grande, muy lindo y mas tranqui que Palermo/Recoleta y aunque no tan cerca al centro como otros, tenes 20 mil colectivos, subtes, etc",
            "I'll second adding trips to Colonia and Tigre as day trip activities.\n\nFor safety, I suggest adding that purses and bags should be zipped or fastened when not in use. Bags should be moved to your front when riding public transportation (it's also courteous). Passengers should be extra careful when using your phone whenever the doors open on public transport as that's a prime phone snatching opportunity from a distracted traveler. Consider moving phones and wallets from back pockets to front pockets in crowded areas to discourage pickpockets.\n\nI'd add visiting an ice cream parlor to the list of things to eat. Argentina has some unexpected flavors (kumquats and whiskey anyone?).\n\nFor navigating, try the city's BA Como LLego App ([Android](https://play.google.com/store/apps/details/BA_C%C3%B3mo_Llego?id=ar.gob.buenosaires.comollego) and [iPhone](https://apps.apple.com/us/app/ba-c%C3%B3mo-llego/id576489186)) in addition to Google Maps.I also use [OmniLineas urban bus route tool](https://www.omnilineas.com.ar/buenos-aires/colectivos/).Anybody planning on riding the train should check the [service bulletins](https://www.argentina.gob.ar/transporte/trenes-argentinos/alteraciones-en-el-servicio-que-podrian-afectar-tu-viaje) for route changes; that day trip to Tigre will be frustrating if somebody goes to Retiro to take the Mitre line at the moment. The government also launched a WhatsApp bot (11-3700-8736) with rail service information that, so far, doesn't suck.\n\nEdit: I also wanted to share my favorite piece of writing about Argentine food, [Argentina on Two Steaks a Day](https://idlewords.com/2006/04/argentina_on_two_steaks_a_day.htm)."
        ]
    },
    "Las minas de +30 años son lo mejor": {
        "title": "Las minas de +30 años son lo mejor",
        "score": 191,
        "url": "https://www.reddit.com/r/BuenosAires/comments/1dqqpc7/las_minas_de_30_años_son_lo_mejor/",
        "content": "Bueno yo siempre fui re raro re virgen, re feo, siempre fui de sdlg, del shitpost, de la coscu army, miraba blend s, jugaba al Fortnite y escuchaba mueva records, en el boliche parezco un espécimen con ictiosis arlequín al lado de los demás, no me hablaba ni la preceptora en el colegio y ya me entienden. Por las apps seguía siendo alto raro y virgen, puse para buscar con edades hasta más allá de los 30 y todo cambio, se siente un ambiente re distinto respecto al que yo estaba antes.\n\nPrimero debuté con una rubia de 35 que me hizo el mejor trato del mundo, es buenísima, sabe mucho de la vida, tiene el mejor cuerpo que yo ví y me dijo cosas importantes para mí. De ahí con otras 2 que me invitaron a su casa, almorcé, trataban de 10 y todo. También fui con una obstetra bien gordita pero que me dió el sex más duro de mi vida. Hubo algunas otras más a las que no pude ver por falta de tiempo y demás motivos míos.\n\nLo mejor de esas mujeres es que no te ven como un virgo, un raro, un feo, al contrario, si sos de esa onda te miran con ternura y buena actitud. Lo que más me gusta es que son muy directas y cuando dicen si es si, no es no. No andan con niñerias, jueguitos pelotudos, enigmas de texto, ni tampoco son de hacer problemas de cosas insulsas y muy banales como las menores de 25. Encima pagan mitad y mitad, las amo con todo lo que tengo. Lo único malo es que a la mayoría medio que a un chabón de 22 como yo los ven como unos inútiles y no les atrae salir con \"nenes\", pero a las que les gustas y les caes bien, siempre te van a invitar a comer algo bueno, te aconsejan para la vida o si son muy decididas van al telo más cercano, besis a todos los que leen",
        "num_comments": 203,
        "comments": [
            "Ayer estuve con tu vieja y puedo dar fe de lo que decis.",
            "A baitear miamor, vamos a baitear miamor",
            "La mama del op debe estar haciendo debutar a un devoxero",
            " Yo tengo 32 y no tengo ni la más puta idea de qué es sdlg, coscu army y lo que mencionaste asi que difícilmente pudiera asustarme con eso, seguro a ellas les pasó lo mismo jajajajjaa",
            "Te banco fuerte. Si no fuese porque no se me para el maleducado saldría con todas pibas +30",
            "Me parece genial, no es nada raro pero buena observación... Los que dicen come viejas?? Dijo + 30 no, +80 bajen un cambio y disfruten jajajaja",
            "Y donde se aplica el CV?",
            "Es verdad, yo también me cojo 3 señoras por día: tu hermana, tu vieja y tu tía",
            "Que tu mamá que?",
            "Estadisticamente hay un porcentaje mayor de minas 30+ hechas mierda que de minas 18-30 hechas mierda. Sin embargo, si comparás a una 30+ que se cuida y está buena supera ampliamente a cualquiera 18-29. El problema es que esas minas son mucho mas difíciles de conseguir. Tenes que ser fachero, tener guita y madurez. No se coman la fantasía del graduado, eso no existe.\n\nTe digo más: para un viejo es mucho mas facil engancharse una pendeja con daddy issues e inestabilidad mental que una verdadera 30+ de las que estan buenas de verdad."
        ]
    },
    "Viernes 28 y todavía no veo depositado el aguinaldo, hoy mato a alguien. Fin.": {
        "title": "Viernes 28 y todavía no veo depositado el aguinaldo, hoy mato a alguien. Fin.",
        "score": 146,
        "url": "https://v.redd.it/gs9s8mvppb9d1",
        "content": "",
        "num_comments": 28,
        "comments": [
            "A mí me lo pagan el lunes junto con el sueldo. No pierdas la fe",
            "A mediados de agosto del año pasado, la encargada general en mi trabajo me mandó un mensaje diciendo que necesitaba que la cubra dos semanas más, ya la había cubierto dos semanas antes, yo le contesté que no había problema, pero que antes debían de depositarme el sueldo, de julio, y el aguinaldo. Un tiempo después me llamó mi jefe para re contra cagarme a pedos, diciendo que no podía hablarle a así a la encargada general, que yo no le podía exigir nada a él y otras giladas.\n\n\n\nEncima el mensaje textual fue:\n\n\n\"Hola, sí, no tengo problema, pero primero necesitaría que me depositen el sueldo y el aguinaldo\"",
            "A mí posiblemente me lo paguen el último día de la última fecha hábil para pagarlo, el 4 de julio, junto con el sueldo",
            "nosotros cobramos el 6 peor el aguinaldo nos lo pagan despues, cerca del 20 .. o el 22 ah!!! no!! cae sábado. Bueno el 25",
            "¿Cómo? ¿Ustedes no cobran el 10 de cada mes?     \n\n\n**Sad empleado estatal noises*",
            "Aguinaldo?. Me suena ese termino (soy autonomo) :(",
            "En julio se lo depositan a tu señora.\n\nSalu2",
            "Que interesante, soy de Guatemala y el aguinaldo se paga entre el 1o y el 15 de diciembre, pero el Bono 14 entre el 1o y el 15 de julio, y si, siempre es el 15.",
            "Ídem.",
            "El perro despues de que yo sali a comer y no le traje nada"
        ]
    },
    "Me están utilizando para construir en el terreno de mi novia?": {
        "title": "Me están utilizando para construir en el terreno de mi novia?",
        "score": 32,
        "url": "https://www.reddit.com/r/BuenosAires/comments/1dquvbp/me_están_utilizando_para_construir_en_el_terreno/",
        "content": "\nHace unos meses comencé a convivir con mi novia. Ella tiene un terreno que compró a un mecánico, y últimamente me presiona para que construyamos una casa allí.\n\nConocí a mi novia hace aproximadamente un año, y convivimos desde hace unos meses. Desde el inicio de nuestra relación, ella me llevaba a ver su terreno y a veces íbamos a limpiarlo junto con su familia. Sin embargo, últimamente he sentido una insistencia por parte de ella para que comencemos a construir en ese terreno. Actualmente, vivimos en un departamento alquilado, del cual yo pago la mayor parte. He notado que utilizan el departamento para guardar herramientas y que su familia viene a visitarnos los fines de semana porque viven lejos.\n\nEn varias ocasiones, ella ha intentado que su padre me convenza de construir en el terreno, pero siempre me he negado. \n\nRecientemente, he observado una relación cercana entre mi novia y el antiguo dueño del terreno, quien es amigo de su padre. Aparentemente, este hombre, que está casado y tiene hijos, trabaja en una concesionaria de 4x4. En una ocasión, él y mi novia viajaron juntos al pueblo de ella para ver a su padre y arreglar asuntos de la venta del terreno. No entiendo por qué fue necesario que ambos viajaran para algo tan simple como una venta.\n\nLo que más me preocupa es la posibilidad de que él sea amante de mi novia y que tanto ella como su padre solo me estén usando para que construya en el terreno, para luego quedarse con todo.",
        "num_comments": 83,
        "comments": [
            "Si lo llamas a Suar te compra la historia y ahí te podes tener tu propio terreno.",
            "No amigo, no construyas nunca en algo que no es tuyo, tu novia no va a estar para siempre con vos lamentablemente, además se conocen hace 1 año y ya insiste en hacer esas cosas, es porque tiene muy en claro que ese terreno es de ella y solo para ella.\n\nLas cosas materiales por separado, son solo novios, primero arregla tu vida y después ves que haces con otra persona.",
            "Y no se ¿Preguntale? \"Che amor ¿Te estas culiando al amigo de tu viejo?\"",
            "'mi idea es viajar, no construir' 'la verdad que no tengo plata para hacer eso' 'si queres construir saca un prestamo en el banco y dale para adelante'",
            "E' un sukubo",
            "\"Soy un terreno y me siento utilizado\"",
            "No te esforzaste por baitear como la gente, igual lo peor son los gordos que se creen tu bait y te dicen que salgas de ahí",
            "No sé qué hacés de novio con ella si le tenés tanta desconfianza",
            "Salí de ahi maravilla. No se construye en lo de los suegros ni en algun lugar que no sea tuyo.\nLlegas a construir y se pudre todo y te quedas sin nada. Ademas, por lo que comentas que vos sos el que aporta la mayor parte para el alquiler, no me sorprenderia que fuera igual para la construcción, compra de materiales y electrodomésticos.",
            "redflag de acá a la china"
        ]
    },
    "Che estoy por cobrar una indemnización de casi 15 millones de pesos. Que puedo o debería hacer?": {
        "title": "Che estoy por cobrar una indemnización de casi 15 millones de pesos. Que puedo o debería hacer?",
        "score": 31,
        "url": "https://www.reddit.com/r/BuenosAires/comments/1dqtyvd/che_estoy_por_cobrar_una_indemnización_de_casi_15/",
        "content": "Bueno, el mayor problema en mi vida es no tener estudios superiores a mis casi 29 años. Tengo laburo obviamente.. ya mis viejos me tiraron la de irme a vivir con ellos construyendo algo en el fondo y hacer unos retoques (el terreno es grande, tiene garage y todo).. actualmente alquilo, estoy saliendo con una mina y también me tiro la de construir en su casa de los padres (tiene una especie de choza en el fondo que hay que reaccionar) no quiero saber nada, las veces que fui ahi los hermanitos son un desastre y no me llevo con nadie (probablemente la relación no dure mucho), pensé en cambiar el auto pero es al pedo, la moto lo mismo... Me puse a ver terrenos con mi viejo y aca en zona norte estan por las nubes. Hay si pero en la loma del orto. Ustedes que harian? Obviamente si no queda en nada, apenas cobre voy y compro todos dolares. No es mucha guita. Diria, no es nada. Si hubiera cobrado el año pasado capaz podría hacer algo, pero en fin. Caballo regalado no se le mira los dientes. Ahora en julio el abogado me tiro el okey para ir a cobrar, consejos? Me falto aclarar, no tengo hijos. No tengo deudas y soy el clásico gordo virgo que juega lol casi a los 30 stucked en diamante ",
        "num_comments": 157,
        "comments": [
            "Mirá, te voy a dar un consejo como abogado y no como inversor. Vos esa plata no la tenés y no es tuya hasta que entre en tu bolsillo. Si querés hacé planes, soñá todo lo que quieras, pero no te comprometas hasta tenerla. \n\nTengo sentencias ejecutándose hace 5 años en las que el que no hay bienes que embargarle al que perdió y son sumas mucho más chicas. Andá asesorándote y viendo opciones OP, pero no hagas compromisos porque no sabés cuándo llega esa plata (Perdón por la mirada realista, pero es lo que le digo a los clientes también).",
            "Lo de construir en casa de los suegros siempre es mala idea. Siempre.  En el caso de la casa de tus viejos,  fíjate como están los papeles del terreno en si y los papeles de la casa de tus viejos y si vale la zona para hacer ese gasto. La otra es que te compres un terreno directamente pelado y construyas desde 0.  Pero hagas lo que hagas, no midas la profundidad del pozo con las 2 piernas, diversifica esa guita",
            "yo invertiría x cantidad en algo, ahorras una parte (en dólares) y el resto lo usaría para estudiar un curso, o carrera que te deje bien parado en el futuro.\n\nno sé de qué laburas, pero por ahí estudiando algo llegas a acomodarte aún más.\n\nlo de construir en el terreno de alguien más no lo recomiendo. después te hacen quilombo por todo.",
            "Visitar r/merval",
            "Un hígado de encebollado, y luego, una casa de oro.",
            "Construi en lo de tus viejos... es lo mejor q podes hacer, te vas a ahorrar unos mangos pero para nada vayas a construir en lo los padres de tu novia, no seas pelotudo chabon, te llegas a separar chau a toda tu inversion",
            "Bajo ninguna circunstancia te vayas a c**** la plata en el casino No seas tan choto. \nHay mucha gente que piensa que la puede duplicar triplicar o cuadriplicar pero si eso es lo que vos querés andate con un agente financiero no al casino. \nHay un montón de locales que están surgiendo que vos podrías pegarles una mirada a sus propuestas de franquicia ahora métete a Google y pone franquicias Quiero comprar unas franquicia y comunícate con tu abogado. \nSi el abogado que te está llamando a este caso con el que vas a cobrar la indemnización tiene alguna idea de franquicias no consultas con él sino que te derive a un experto.",
            "15 mm no es tanto, no lo digo por vos sino por algunos comentarios que son re voladores jajaja si bien es guita realmente no es tanta como para decir \"la invierto\".   \nOP vos estas diciendo que alquilas, ahi ya tenes un gasto menos de 100 lucas (ponele) por el resto de tu puta vida si usas esos 15 palos en hacerte un ranchito en lo de tus viejos. Ojo que con esa plata te haces algo muy pequeño no bolacies mentalmente xq está todo carisimo",
            "TERRENO EN EL SUR. TERRENO EN EL SUR. DOS CABAÑITAS, UNA LA ALQUILAS. TERRENOOO EN EL SUUIIR",
            "Dejar de decirlo en las redes, nada, eso."
        ]
    }
}