{
    "Simple Questions - June 29, 2024": {
        "title": "Simple Questions - June 29, 2024",
        "score": 0,
        "url": "https://www.reddit.com/r/buildapc/comments/1dr2if3/simple_questions_june_29_2024/",
        "content": "This thread is for simple questions that don't warrant their own thread (although we strongly suggest checking the sidebar and the wiki before posting!). Please don't post involved questions that are better suited to a \\[[Build Help](https://reddit.com/r/buildapc/search?q=title%3A%22build+help%22+OR+flair%3A%22build+help%22&restrict_sr=on&sort=new)\\], \\[[Build Ready](https://reddit.com/r/buildapc/search?q=title%3A%22build+ready%22+OR+flair%3A%22build+ready%22&restrict_sr=on&sort=new)\\] or \\[[Build Complete](https://reddit.com/r/buildapc/search?q=title%3A%22build+complete%22+OR+flair%3A%22build+complete%22&restrict_sr=on&sort=new)\\] post. Examples of questions suitable for here:\n\n* Is this RAM compatible with my motherboard?\n* I'm thinking of getting a ≤$300 graphics card. Which one should I get?\n* I'm on a very tight budget and I'm looking for a case ≤$50\n\nRemember that Discord is great places to ask quick questions as well: [http://www.reddit.com/r/buildapc/wiki/livechat](http://www.reddit.com/r/buildapc/wiki/livechat)\n\n**Important: Downvotes are strongly discouraged in this thread. Sorting by new is strongly encouraged.**\n\nHave a question about the subreddit or otherwise for [r/buildapc](https://www.reddit.com/r/buildapc/) mods? [We welcome your mod mail!](http://www.reddit.com/message/compose?to=%2Fr%2Fbuildapc)\n\nLooking for all the Simple Questions threads? Want an easy way to locate today's thread? [This link](http://www.reddit.com/r/buildapc/search?q=title%3A%22simple+questions%22+author%3A%22AutoModerator%22&restrict_sr=on&sort=new&t=all) is now in the sidebar below the yellow Rules section.",
        "num_comments": 11,
        "comments": [
            "Is a 180Hz monitor overkill for a 5 5600X CPU and a 7600XT GPU?\n\nLooking at a AOC 24G4X 24 inch 180Hz for my first non 60hz monitor.",
            "Does an mATX motherboard like the Asus Prime B550m-a fit inside a Micro-ATX case like the Antec CX200M Elite or the Deepcool MACUBE 110? This is a work desktop so I'm not fussed about cooling, just trying to reduce size and figured I might as well take the opportunity to try building in a Micro-ATX case for the first time.",
            "Depends on which games. Esports games can easily hit 180 Hz, especially on low settings.",
            "It isn't significantly more expensive than lower high refresh rate monitors like 160hz so should be worth it.  \nAnd as long as it has VRR and LFC, you won't suffer anything from \"excess refresh rate\".",
            "Putting in the slower RAM would force your current RAM to run at 2400MHz as well, which will reduce performance, especially with Ryzen CPUs. Best to use that RAM somewhere else and buy a matching 3600MHz CL16 kit if you're currently running out of RAM.",
            "It seems likely to me that you don't have enough independent 6+2 pin connectors for what you're trying to run on the PSU. Also connecting the iCue system hub into your GPU isn't something that strikes me as a good idea. My rough understanding is that the nature of the 6+2 cables means they draw enough power to fuel everything connected to them, and it all goes equally to everything. Your system hub obviously requires less power than a 4080, so the thing shuts down to protect itself/not be a fire hazard. Due to not drawing any power, your GPU no no longer gets enough. Unplug the system hub and see what happens.\n\nYou probably just need to upgrade your PSU to something with more 6+2 pin connectors or straight up 8 pin connectors. Also personally I would go for 1,000 watts for a 4080 build depending on your CPU and RAM.",
            "mATX is micro-ATX, so yes, those cases would fit an mATX or ITX motherboard.",
            "Hey all, my friend recently passed me 2x4gb DDR4 2400Mhz CL 16-16-16-39 1.20V ver3.20 RAM (CMK4GX4M1A2400C16 Corsair Vengeance LPX RAM).\n\nThing is, I already have Trident Z Neo's 2x8gb DDR4 3600Mhz CL 16-19-19-39 1.35v (F4-3600C16D-16GTZNC).\n\nSo my question is, would the pc play well/ any improvement combining these 2 mismatched sets, or perhaps a site where I sort of compare the improvements/ performance hits? I could still use the 2x4gb in some other build, no issues",
            "Bad GPU or not enough power?\n\nI have a Maingear Ignition 850w PSU. I just upgraded to the PNY 4080 Super from the Asus 3070. \n\nThe PSU has x2 Y style 6+2 connectors, so basically 4 total 6+2 connectors via 2 headers into PSU. x3 of these 6+2 connectors go into the 3to1 Nvidia pcie 5 connector, and the 4th 6+2 (shares a cable with the gpu) connects to my Corsair iCue system hub for my h170i. \n\nExperiencing random system hangups, choppiness, screen goes black for a few seconds then back to Windows, usually have to force shut down. Issue occurs when I'm doing basic Windows desktop tasks. Reliability history shows errors livekernelevents that seem to be associated with graphics card. Tried various drivers, clean uninstalls even a Windows reformat as well as a new m.2 drive. Everything works fine with my 3070.\n\nI'm hoping I'm just an idiot for trying to power this card on my current PSU and hope to not have to return my 4080. Though I've also been told that 850w is more than enough, so not sure. What do you think?",
            "Alright thx. Though my understanding is even between two 2x8gb ram from the same manufacturer/ cl speed, no guarantees that they'd play well with each other right? Sot it might be better to simply get a set of dual channel ram of your speed/ capacity of your choice?"
        ]
    },
    "NVIDIA GeForce Full SFF-Ready System Contest!": {
        "title": "NVIDIA GeForce Full SFF-Ready System Contest!",
        "score": 208,
        "url": "https://www.reddit.com/r/buildapc/comments/1df29v2/nvidia_geforce_full_sffready_system_contest/",
        "content": "Happy almost weekend ! Entries are closed for our mega GPU giveaway and winners will be contacted shortly. Thank you everyone that participated - but we're not stopping yet. NVIDIA are back with another awesome giveaway - this time enter for your chance to win **a FULL CUSTOM PC of your choosing** (up to 2500 USD including videocard)!\n\nSee below for contest rules and a message from NVIDIA:\n\n&#x200B;\n\n>Hi everyone!    \n>  \n>Last week, we introduced [SFF-Ready Enthusiast GeForce Cards and Compatible Cases](https://www.nvidia.com/en-us/geforce/news/small-form-factor-sff-ready/).    \n>  \n>We were excited to see the enthusiasm from the community in our [r/buildapc SFF-Ready graphics card giveaway](https://www.reddit.com/r/buildapc/comments/1d755ij/big_summer_geforce_rtx_gpu_giveaway_introducing/).    \n>  \n>To continue this celebration, we're thrilled to announce another exciting build contest where you can win an entire SFF-Ready system featuring an NVIDIA GeForce RTX™ 4070 SUPER Founders Edition graphics card, built by the GeForce Garage team!   \n>  \n>We’re giving you the chance to share your dream SFF build with us, and if you win, we'll build it for you.  The winning system will also be featured in an upcoming GeForce Garage video.  \n\n**Here's how you can participate:** \n\n1. Use the [SFF-Ready Enthusiast GeForce Cards and Compatible Cases guideline](https://www.nvidia.com/en-us/geforce/news/small-form-factor-sff-ready/), and [PC Part Picker](https://pcpartpicker.com/) to craft your build.  \n2. For your build, the following requirements must be met:\n   1. **GPU**: NVIDIA GeForce RTX 4070 SUPER Founders Edition\n   2. **Case**: SFF-Ready compatible case (as listed on our guideline article)\n   3. **Budget**: up to 2500 USD (including the graphics card)\n   4. The SFF build should include the following parts: CPU, CPU Cooler, Motherboard, Memory, Storage (i.e., SSD), Case, Power Supply.  Optional additions include a Monitor, Operating System, Expansion cards, and Accessories (i.e., Fans, Fan Controller, Optical Drive).    \n   5. It may not include peripherals (i.e., Headphones, Keyboard, Mice, Speakers, Web Camera)\n3. Share your PC Part Picker list in the comments section of this post.\n4. **Contest duration: June 13 to June 21**\n\n>If you have questions about building a Small Form Factor (SFF) system, our GeForce Evangelist, *Jacob Freeman*, will be available in this thread to answer them.    \n>  \n>[Terms & Conditions](https://www.nvidia.com/en-us/geforce/contests/sff-ready-system-terms-conditions/) apply.   \n>  \n>**About SFF-Ready Enthusiast GeForce Cards and Cases:**  \n>  \n>Small Form Factor computers pack powerful components into stylish cases.  However, component compatibility can be a challenge, requiring deep dives into specification sheets and forums to determine if there’s available clearance for parts.   \n>  \n>To make component selection easier for SFF enthusiasts, we introduced [SFF-Ready Enthusiast GeForce Cards and Compatible Cases](https://www.nvidia.com/en-us/geforce/news/small-form-factor-sff-ready/).  \n\nContest is open globally where permitted - see the Terms & Conditions above for a full list of applicable locations. One entry per user, additional entries will be disqualified. One valid entry will be selected as a winner. The winner will be contacted by Reddit message by the  subreddit - any other sender should be ignored. If you do not respond within 24-hours of being contacted, a replacement winner will be selected.\n\nRemember to share either the PCPartPicker **permalink** to your build, or use the Reddit markup option (see: [https://www.reddit.com/r/buildapc/wiki/pcpp/](https://www.reddit.com/r/buildapc/wiki/pcpp/) for help with formatting).\n\nGood luck everyone!",
        "num_comments": 1078,
        "comments": [
            "Been wanting to update my 2070s Ryzen 2600x build for a while!\n\n[SFF Fractal Terra Build](HTTPS://pcpartpicker.com/list/gNH7L9)",
            "Hey Jacob. I'm trying to plant out a build like this using the guidelines., However, the case I like, that's on the sff copmpatible cases guideline, is the Fractal Design Era 2, which doesn't have specs listed anywhere I can find, and isn't listed on PCPP. Can I still use that case for this build list or should I go with something already available?",
            "you guys had to ruin it by making sff a requirement. why?",
            "Did anyone win , was the winner informed?",
            "You have to have the founders edition 4070 super in the pcpp list btw",
            "660 dollar motherboard, could invest that in more storage or cpu",
            "hey :) You're just slightly over budget.  You should chance it quick before the draw happens today",
            "Monitor is optional.  Post has been updated.  Good luck! :)",
            "That's only the announcement. Winner was contacted on or around 26th it says in terms and conditions.",
            "tbh, yea, could have chosen a more reasonnable mobo and a 7950x3d, but I'll probably have some fun ocing the ram"
        ]
    },
    "What CPU to get if I ONLY care about single-thread performance?": {
        "title": "What CPU to get if I ONLY care about single-thread performance?",
        "score": 22,
        "url": "https://www.reddit.com/r/buildapc/comments/1dr4t4q/what_cpu_to_get_if_i_only_care_about_singlethread/",
        "content": "I am in a somewhat unusual situation where I need to run some custom productivity software that's single-threaded, and even 1% increase in the single core performance is worth a lot to me. So even a 2-core CPU would be fine in theory. Based on these what's the best of the best option, if I had no budget limits? \n\nShould I be going for Intel i9 14900ks based on these constraints? Or is there a lower-core count CPU that would beat it out of the box for single-thread performance? IT likely won't let me get something lower binned and overclock. Upgrade path is also not relevant.",
        "num_comments": 36,
        "comments": [
            "You'd have to test it on 3d cache and 14900 to know for sure",
            "Yes, the KS is the best you can get. Feel free to disable the E cores and OC it.",
            "14900ks. It's possible, bit unlikely that extra cache could help in which case the 7800x3d would be better, but unless you have the money to experiment with both, the 14900ks would be a safer bet.",
            "It really depends on what your workload is. Is it purely computational, in which case you'll definitely want the program to fit in cache, but which cache will depend on the size of your program. If it will only fit in ram then maybe ram speed or latency is more important. Does it include floating point calculations? We need more info...",
            "just out of curiosity, what is your cooling solution?",
            "Is there not a benchmark for that programme?",
            "I don't think I can test without buying",
            "This.  Without knowing what your application likes theres nothing for it but to test it.  A higher cache hit percentage can easily make up the clock speed difference if the application is architected in a way that will get those cache hits.",
            "There is zero chance that a 3D cache CPU will be better in single threaded performance.",
            "Most likely a synthetic test would resemble the custom productivity software that most likely isn't caching a lot. It's probably just number crunching over a big data set were your don't have a lot of stuff to cache. I might be wrong though, I don't know how cpu architecture would affect that."
        ]
    },
    "$1000 pc or Ps5 which is better ": {
        "title": "$1000 pc or Ps5 which is better ",
        "score": 14,
        "url": "https://www.reddit.com/r/buildapc/comments/1dr5k8a/1000_pc_or_ps5_which_is_better/",
        "content": "I watched lots of videos and read things on some websites now i am confused which to go with should i build a pc with 1000-$1200 budget or buy ps5 ",
        "num_comments": 95,
        "comments": [
            "With 1000 you can get 7600 and 6750xt whuch will be about 20% more powerfull than the playstion but you will save ALOT of money over time with the insane sales we get on pc when  a game turns about  1 or 2 years old you will be abke to didn it on sale for like 5 dollard",
            "PC, will be more powerful, useful, because you can game and do everything else, but most important, upgrade by parts whenever is possible for you... Plus not paying an stupid monthly fee to use your games lol",
            "im pretty sure even a $700-800 usd pc build should be more than enough to beat a ps5",
            "Build a PC and save some dollars on games",
            "Well, if you're a keyboard+mouse player, I suggest 1k pc, or otherwise, yeah...",
            "consoles arent cheaper long run",
            "It depends on a lot of things for me to give you a better answer but have you thought about getting a laptop and a PS5? I use my Xbox and laptop more than my PC at this point",
            "Honestly it doesn't matter.\n\nMake the decision based on the games and the platform, not \"which will be \"better\"\".",
            "Answer always seems obvious to me\n\nAre your friends on ps5 or PC?",
            "Tough question. Don't know your use case, but I would say the PC. Games are barely being made for the PS now, and with Sony saying, \"the PS5 is in its latter stages now,\" even though we've barely gotten anything for games. You're probably better off with a PC, you also get a much wider list of games to play and consider you will probably be using computers for the rest of your life as an adult, I'd say it's worth it, depends on how much money you are willing to spend though, with nvidia saying a \"midrange\" graphics card is $600 (go amd if 90% of your usage is just gaming, ray tracing is cool for single player games, but multiplayer online experiences I don't think you would care that much about ray tracing to be honest)."
        ]
    },
    "Is there a difference between 2 1080p monitors and a 4k monitor in performance?": {
        "title": "Is there a difference between 2 1080p monitors and a 4k monitor in performance?",
        "score": 123,
        "url": "https://www.reddit.com/r/buildapc/comments/1dqs22d/is_there_a_difference_between_2_1080p_monitors/",
        "content": "I was lucky to land a new 100hz 1080p monitor for $11 and I have another 1080p monitor as my main. Will it destroy my gpu's performance in games if I use both of these monitors at the same time? btw my gpu is a intel arc a580",
        "num_comments": 52,
        "comments": [
            "People use dual monitors all the time to play games on one, while web browsing, watch videos, check guides, etc on the other.",
            "Assuming that you're only playing games on one monitor at a time, no.",
            "Multiple monitors does not have a significant impact on graphical performance, unless you run intensive applications on both the monitors. \n\nYour question is essentially \"whats the performance difference between a 4k and 1080p monitor\".",
            "I have 2 4K monitors and 1 1440p 240hz monitor and dont have any performance loss",
            "If it's something like youtube on the other screen then there will be very little difference in fps. Try it out. If your gaming screen maced out at 100 GPS then u may experience zero FPS loss.",
            "Yeah about half the resolution lol",
            "You'll be fine. And if, by chance, you also have iGPU - plug your secondary monitor into it (and enable it) - it'll void any possible problems with multi monitor setup and also pass arbitrary tasks to other gpu (liked playing YouTube or drawing desktop) thus freeing your main gpu for the game you play.",
            "It is acceptable as long as you are not gaming on both screens simultaneously. On one of my laptops, I have it connected to my 50-inch TV, and I can play games on the laptop screen while the TV screen displays a web page or other content.",
            "no you will be fine",
            "Honestly unless you've got a really good reason to multi monitor (stream setup, racing sim, productivity) I'd avoid it where possible.\n\nLotta random buggy behaviour, especially if there's a refresh or resolution mismatch involved."
        ]
    }
}