{
    "Posts regarding politics": {
        "title": "Posts regarding politics",
        "score": 700,
        "url": "https://www.reddit.com/r/business/comments/kurvl4/posts_regarding_politics/",
        "content": "Many of you know, we have a strict no-politics rule on this subreddit. It's explicitly stated in the rules.\n\nFor a while now we've been temp/perma banning people for breaking said rule.\n\nEffective immediately, any and *all* posts regarding politics, no matter how relevant, will result in an immediate 4 week ban. You may appeal this if it happens to you. But it's pretty straight forward. \n\nWe will no longer perma-ban first time offenders but multiple offenders will be perma banned, including those who post multiple politically fueled posts in one sitting before we catch it the first time. \n\nCovid-19's affect on business is not included in this.\n\nJust remember, r/business is a pro-business subreddit. We hold the right to remove anti-business propaganda, and bad company behavior belongs over at r/greed, not here. We will not ban people for these posts, however.",
        "num_comments": 0,
        "comments": []
    },
    "Starbucks accuses marijuana retailer of infringing trademarks": {
        "title": "Starbucks accuses marijuana retailer of infringing trademarks",
        "score": 6,
        "url": "https://news.bloomberglaw.com/ip-law/starbucks-accuses-marijuana-retailer-of-infringing-trademarks",
        "content": "",
        "num_comments": 2,
        "comments": [
            "This is a quick loss.",
            "Yeah that's warranted"
        ]
    },
    "Dexcom lays off 535 workers from California HQ, pulls manufacturing out of state": {
        "title": "Dexcom lays off 535 workers from California HQ, pulls manufacturing out of state",
        "score": 4,
        "url": "https://www.sfgate.com/tech/article/dexcom-layoffs-manufacturing-san-diego-19545250.php",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "My family has our product on the shelves of 60+ Whole Foods locations across North America- The problem is, they're our only customer.": {
        "title": "My family has our product on the shelves of 60+ Whole Foods locations across North America- The problem is, they're our only customer.",
        "score": 33,
        "url": "https://www.reddit.com/r/business/comments/1dr0xun/my_family_has_our_product_on_the_shelves_of_60/",
        "content": "Hey!\n\nMy family owns a small business in the premium aromatherapy niche, and we've been fortunate enough to secure distribution at 60+ Whole Foods stores across Canada and the US, along with a few independent boutiques. Whole Foods is our biggest customer by a mile, and I want to expand.\n\nMy mom built the brand, my dad handles the logistics, and I handle marketing. I want to retire my parents off of this business while they're still in their early 60s, and I think we've got a solid foundation.  \n\n**Challenges:**\n\n* High shipping costs in Canada make B2C Shopify sales far less profitable than wholesale.\n* I've reached out to stores like HomeGoods, Anthropologie, Indigo, West Elm, and Free People but haven't made any progress.\n\n**What We've Tried So Far:**\n\n* Exploring platforms like Faire for wholesale orders.\n* Contacting buyers at local co-op groceries and boutiques.\n* Built a dedicated wholesale section on our website.\n\n**Questions for you:**\n\n* Does anyone have experience with successful wholesale growth in the health and wellness sector? We're a home/lifestyle product, not a food or drink. \n* Are there specific distributors or brokers you recommend in the wellness niche? This is something new to me, and could be our key to success.\n\nWe charge $15USD retail per product, and selling 1000 units a month would be enough for my dad to quit his job and focus on this dream full-time.",
        "num_comments": 18,
        "comments": [
            "Whole Foods is owned by Amazon but are you on Amazon.com?",
            "Have you explored making white label product for Trader Joe’s or target ?",
            "Is there a specific reason why you only want to target wholesalers if you only have 1 client? Where’s the data that points to wholesale being your ideal target market?",
            "How’s your packaging design compared to similar products sold at those stores? The brands you mentioned are highly aesthetic and trendy.",
            "You'll have to do the math but on the b2c front consider a US warehouse and trucking it over.\n\nFor wholesale I'd spend time looking to offload the  intros and maybe negotiations to an experienced 3rd party",
            "do you have any online presence like a website etc? what is your profit margin?",
            "Put in legwork to get your product in other local retailers. Visit them in person and talk to the owners or managers. \n\nHire a broker or shared sales person that has contacts in the industry from their other brands.",
            "You've cross posted this in many places and received lots of replies. Have you tried any of those yet?",
            "I can't wait for them to replace you with the 365 version made out of soy and cardboard.",
            "What are your current sales?"
        ]
    },
    "I wanna buy and manage a strip club, give me some advice": {
        "title": "I wanna buy and manage a strip club, give me some advice",
        "score": 22,
        "url": "https://www.reddit.com/r/business/comments/1dr15vp/i_wanna_buy_and_manage_a_strip_club_give_me_some/",
        "content": "If not that then one of them adult booth peep shows\n\nGive me some shit i've gotta deal with, pros cons whatever.\n\nexperience would be cool too",
        "num_comments": 98,
        "comments": [
            "Ah fuck, go for it…what’s the worst that can happen!?",
            "You’re gonna need to hire some armed tough guys. Probably best if you’re already somewhat connected in that industry. If not, you’re gonna get taken advantage of.",
            "Learn to be friendly with gang members and drug dealers. Pro a lot the same as any club as far as making money off alcohol sales",
            "Im guessing it’s not actually profitable unless you also launder money/sell drugs, do other things illegally.",
            "Marty Byrde? Is that you?",
            "Hope you enjoy not owning that business anymore in 12-18 months",
            "As with any business, go get a job in the industry and learn how it works. Be useful and friendly, and ask questions where you can.  This way you'll get paid to learn how it works.\n\nThen, when you have a good idea as to how it all fits together, have a good think about what you might do differently and why customers would choose your business over other competitors. Then, time to decide if you want to proceed.",
            "**Heavily** controlled by the Mafia.  Just for info, the Buffalo Mafia allegedly just killed like 4 witnesses over the past year of something they were involved in.  Good luck, my friend.  You’ll need it.",
            "Unless you like being involved with crime families and potentially watch it get taken away by them in a year, invest heavily in armed security if you have the cash. If you don’t then don’t start this business.",
            "Honestly go find one that’s dying, then go find a rich dude that has nothing to do, partner up, and 17 years from now you’ll have a Netflix special"
        ]
    }
}