{
    "Posts regarding politics": {
        "title": "Posts regarding politics",
        "score": 696,
        "url": "https://www.reddit.com/r/business/comments/kurvl4/posts_regarding_politics/",
        "content": "Many of you know, we have a strict no-politics rule on this subreddit. It's explicitly stated in the rules.\n\nFor a while now we've been temp/perma banning people for breaking said rule.\n\nEffective immediately, any and *all* posts regarding politics, no matter how relevant, will result in an immediate 4 week ban. You may appeal this if it happens to you. But it's pretty straight forward. \n\nWe will no longer perma-ban first time offenders but multiple offenders will be perma banned, including those who post multiple politically fueled posts in one sitting before we catch it the first time. \n\nCovid-19's affect on business is not included in this.\n\nJust remember, r/business is a pro-business subreddit. We hold the right to remove anti-business propaganda, and bad company behavior belongs over at r/greed, not here. We will not ban people for these posts, however.",
        "num_comments": 0,
        "comments": []
    },
    "My family has our product on the shelves of 60+ Whole Foods locations across North America- The problem is, they're our only customer.": {
        "title": "My family has our product on the shelves of 60+ Whole Foods locations across North America- The problem is, they're our only customer.",
        "score": 21,
        "url": "https://www.reddit.com/r/business/comments/1dr0xun/my_family_has_our_product_on_the_shelves_of_60/",
        "content": "Hey!\n\nMy family owns a small business in the premium aromatherapy niche, and we've been fortunate enough to secure distribution at 60+ Whole Foods stores across Canada and the US, along with a few independent boutiques. Whole Foods is our biggest customer by a mile, and I want to expand.\n\nMy mom built the brand, my dad handles the logistics, and I handle marketing. I want to retire my parents off of this business while they're still in their early 60s, and I think we've got a solid foundation.  \n\n**Challenges:**\n\n* High shipping costs in Canada make B2C Shopify sales far less profitable than wholesale.\n* I've reached out to stores like HomeGoods, Anthropologie, Indigo, West Elm, and Free People but haven't made any progress.\n\n**What We've Tried So Far:**\n\n* Exploring platforms like Faire for wholesale orders.\n* Contacting buyers at local co-op groceries and boutiques.\n* Built a dedicated wholesale section on our website.\n\n**Questions for you:**\n\n* Does anyone have experience with successful wholesale growth in the health and wellness sector? We're a home/lifestyle product, not a food or drink. \n* Are there specific distributors or brokers you recommend in the wellness niche? This is something new to me, and could be our key to success.\n\nWe charge $15USD retail per product, and selling 1000 units a month would be enough for my dad to quit his job and focus on this dream full-time.",
        "num_comments": 13,
        "comments": [
            "Whole Foods is owned by Amazon but are you on Amazon.com?",
            "Have you explored making white label product for Trader Joe’s or target ?",
            "You'll have to do the math but on the b2c front consider a US warehouse and trucking it over.\n\nFor wholesale I'd spend time looking to offload the  intros and maybe negotiations to an experienced 3rd party",
            "Is there a specific reason why you only want to target wholesalers if you only have 1 client? Where’s the data that points to wholesale being your ideal target market?",
            "[removed]",
            "do you have any online presence like a website etc? what is your profit margin?",
            "Put in legwork to get your product in other local retailers. Visit them in person and talk to the owners or managers. \n\nHire a broker or shared sales person that has contacts in the industry from their other brands.",
            "How’s your packaging design compared to similar products sold at those stores? The brands you mentioned are highly aesthetic and trendy.",
            "What are your current sales?",
            "I can't wait for them to replace you with the 365 version made out of soy and cardboard."
        ]
    },
    "Trying to start a game dev business but stuck in a sanctioned country, what is a legal way to go about starting and moving out?": {
        "title": "Trying to start a game dev business but stuck in a sanctioned country, what is a legal way to go about starting and moving out?",
        "score": 4,
        "url": "https://www.reddit.com/r/business/comments/1dr3h0b/trying_to_start_a_game_dev_business_but_stuck_in/",
        "content": "I'm doing nothing illegal in a technical sense, I'm just a guy working on game development using official tools, and making a standard game.\n\nThe problem is that I'm from (and currently stuck in) Syria.  \nThe sanctions are \"only targeted at specific people\" is what the common knowledge is, but in practice, I face Error 403 every time I need to use a software that is not Open Source, and I have NO WAY of making a bank account for online use,   \n  \n- Doing local business means my market is people who are starving and have no room to consider gaming, here's the [Average Monthly Salary in Syria](https://www.reddit.com/r/Syria/comments/13ml2cw/how_much_is_the_average_salary_in_syria/) (around $5 - $50)  \n- Registering a local business means that [I cannot interact with any outside entity](https://www.state.gov/imposing-sanctions-on-syrian-financial-facilitators/) because no one takes risks in guessing if a Syrian company is related to the government or not, I'm not interested in local business either, it will seal my fate one way or the other.\n\nBasically, I cannot directly sell anything as long as I'm inside Syria, I cannot simply leave either because  \n- I don't have the financial grounds for it (it IS supposed to be game dev),   \n- nor a means to get a Visa (vistor visas get outright rejected, I can't apply for a job for many personal reasons, health included, one of the only feasible options for me is investment Visa in a country with a low barrier of entry)\n\nIt took me around 7 years to manage a computer that is (or was) a little below the minimum requirement for game dev.  \nI'm also recovering from sever health issues that lasted 10 years, was heavy to the point I couldn't move, focus, or talk much.\n\nAdd to that, I currently have 2 team members under my responsibility, they need to move out too if I wanted my plans to work.  \nsome of the health issues I mentioned are ADHD and Autism, which prevents me from doing anything too far from my own interests, I already tried fighting them for years, I end up burnt out with hardly anything accomplished, even if I push, I'll eventually break down when I'm supposed to keep the business alive, not feasible.\n\nIf you want the full picture about the situation in Syria, [this video ](https://www.youtube.com/watch?v=rT0x9ezM6WM&t=229s)should answer every question you might have.  \nbut what made me post this question is [this](https://www.youtube.com/watch?v=mHYK0IMbUDQ), there seems to be tighter sanctions right around the corner\n\nAnd having spent 3 years just to get the $100 fee for publishing on Steam Market, then losing all access to it because the system changed and the new one needs residence verification, when the sanctions were LIGHTER..  \nI.. don't think I want to gamble my luck any longer, I want to get out of here any way possible, or rather any way realistically possible for me.\n\n**My question to you:** can you help me find a legal way to leave here and start my business officially? I'm not interested in politics and I'm just a guy who wants to develop games in peace.",
        "num_comments": 7,
        "comments": [
            "I know a prince in Nigeria that can help you",
            "I wonder if you could find a partner located in another country, start the business there as a partnership and use that to get your visa and bypass legal stuff",
            "We live in a global unevenly regulated capitalist world. If you want to offer game services or game products, you compete with whoever is on the market, regardless of your troubles.\n\nThe business doesn’t care if you come from a war place, if your people have ASD or anything. If you manage to offer a good product/service you will be fine. Otherwise you’re out.\n\nSo we scratch the whole part of your post with complaining about your shitty situation (sorry about that, but you’ve asked how to make a game business, not for shoulder to sob on). What’s left? You’re in a poor and troubled country where people make very low wages and there are sanctions in place that prevent you from easily opening a licensed business that would offer services internationally.\n\n1. Learn to use VPN to get access to what you need. The fact you don’t use one already hints that you’re likely not that well technically speaking.\n2. You could leverage the low wages in your country as a good starting point for a business. If you’re any good, you could be the cheapest outsourcing provider out there. Meaning that instead of trying to open a legally setup game studio, you start looking for freelance game dev jobs. You should be attractive with the extremely low wage you need. Then you grow this with adding new people.\n2. You could try building a product (full game) and then release it via a publisher. I wouldn’t advise for this as it takes a lot of time and bears high risk of failure.\n\nAs for how do you exit the country and start a game dev business elsewhere - these are two very different questions you’ve mixed together. Split your goals into smaller steps, order them and work one by one. \n\nGood luck 🍀 ",
            "I guess all the details came off the wrong way.\n\nto clarify: I ALREADY have experience in game dev and starting a business there,  \nbut all the details are to ask about the legal side of things, since it's very hard to find any legal matters regarding Syria online.",
            "I have ones who might help with stuff that don't require financial backing  \nbut asking one person to fund my entire leave is a bit unrealistic, so I gotta do that myself\n\ncan i make use of that? while keeping it legal.",
            "I think it came off as a rant by mistake, I always had issues with communication.\n\nNo, my question isn't how to start a game business, I've been around that for 10 years, I'm more or less experienced enough to start it, I briefly mentioned getting the Steam fee and my computer which while relatively easy outside, are near impossible here, and are the minimum required entry for such a field.  \nI'm aware of the situation, I'm not using it as an excuse.\n\nI'm asking how to LEGALLY start a business exactly because it IS a global requirement, I can't just use VPN then get legally questioned and say \"oh but I was poor in a sanctioned country!\"  \nit's me an the law there, and the law won't make exceptions, especially for something it considers illegal.\n\nI can leverage what I have (and I'm already doing it), I can sneak, I can do what's required to make the game, but unless it's legal, it would be the exact same situation as ripping assets off copyrighted games, and selling a game claiming it my own. that's how the law outside sees it.\n\nSo, any ideas how to manage the legal side?  \nthe other information were to skip through common questions I often get asked, and are usually a no brainer outside but a problem here.\n\nBTW, thanks for commenting, an I'm glad you're not trying to pat my shoulder.",
            "I figure if you establish in another country you can have them get you access to tools/ release things there to help fund your leave. Maybe you could get a startup grant or loan in that country that covers your exit from your country. I think for sure you could make use of it, I'd just do a little research on it to make sure there's no laws where you're at that are specific to those situations."
        ]
    },
    "Advertisement ideas?": {
        "title": "Advertisement ideas?",
        "score": 3,
        "url": "https://www.reddit.com/r/business/comments/1dr384h/advertisement_ideas/",
        "content": "Hey, I’m a 16 year old entrepreneur and I’ve started a mobile car detailing business but I don’t know to get my name out there. Any advertising ideas? I’ve already tried Facebook community boards, putting business card in letter boxes, made a Instagram account and made a website (although I need to improve it) I only have $250 right now. Should I wait until I have more money to spend or any ideas I can do now? Cheers\n",
        "num_comments": 2,
        "comments": [
            "Carry business cards, print out flyers and put them on every bulletin board you can find, stores, the library, etc. Go into car based businesses like garages and dealerships and offer your services. Best thing you can do is secure continuous income. Talk to dealerships about being contracted to detail their cars. Uhaul and oenske would be good for this too they clean those cars everytime they return. Call car- based businesses directly and pitch pitch pitch and don't stop. Lock down work.",
            "Out flyers infront of car wash, showrooms, garages, every where a car owner goes and spend money on maintenance. That's where ur market is"
        ]
    },
    "Business Idea: App to Gamify Fitness ": {
        "title": "Business Idea: App to Gamify Fitness ",
        "score": 2,
        "url": "https://www.reddit.com/r/business/comments/1dr58j7/business_idea_app_to_gamify_fitness/",
        "content": "**The Problem**\n\nResearch shows that a staggering 43% of pepople give up on their fitness resolutions within the first month. It seems like everyone wants to get fit, but many are unable to commit to doing so. On the other hand, from personal observation, some of the most committed people have been gamers working on building up the stats or skill level of their video game characters.\n\n**The Solution**\n\nWhat if there was a way for those aspiring to get fit to tap into the same level of commitment that gamers feel when developing their in-game characters? One solution would be to develop a training app that assigns the user video game-esque stats.\n\nEveryone with the app would create an in-game character that resembles the app user. Each user would then choose their fitness goals on the app, which would inform what attributes the in-game character would focus on highlighting. The in-game character would start 0 skill points for attributes such as strength, agility, speed, stamina, etc. As the user logs their training, the skill points per attribute would increase according the types of workouts, number of sets and number of reps completed.\n\nIn essence, the user’s real-life fitness journey would be mirrored by the development of their very own video game character in the app. As the user progresses, their character develops as well (as shown through an increase in skill points). Skill points should also be prone to going down if the user does not stick to and log their workouts on the app over a set period of time, so as to create an incentive to commit to their fitness goals.\n\n**Social**\n\nThe app should do more than just track the user’s progress, it should turns fitness into a social game. Users should be able to connect with friends and form in-app friend groups to compete on stats and encourage each other along the way.\n\nWith built-in accountability and friendly competition, this should reinforce commitment to said fitness goals.\n\n**How it works**\n\n1. **Personalized Tracking:** Everyone’s fitness goals are different. The in-game character should primarily track the progress of attributes and skills you aim to develop. Whether you’re into weightlifting, running, doing yoga, or something else entirely, the app should adapt to your preferences.\n2. **Game-like Progress Tracking:** The in-app character should level up with each workout early on. However, as the user becomes more experienced, the rate at which they improve should often start to plateu in real life. The time it takes to level up should reflect this reality over time.\n3. **Social Interaction:** Users should be able to share their achievements and join communities of like-minded individuals. The app should foster a supportive environment where everyone is working towards their fitness goals together.\n4. **Freemium Model:** While the basic features would be free, the freemium version would offer additional perks such as advanced stat tracking and enhanced social features (or the social feature may be part of the paid experience entirely)",
        "num_comments": 0,
        "comments": []
    }
}