{
    "I am officially going scorched earth on any horny comments.": {
        "title": "I am officially going scorched earth on any horny comments.",
        "score": 764,
        "url": "https://www.reddit.com/r/CalamityMod/comments/1d1hprj/i_am_officially_going_scorched_earth_on_any_horny/",
        "content": "I proper check on this place again after thinking it's probably fine for a while and see this has come up again. It seems my warning a little after becoming subreddit owner wasn't enough, so I'll properly be taking action.\n\nAny comments past the time this was posted that are in the vein of \"I'd fuck it\" will result in a 7 day ban from the subreddit. If I see it again from the same user, it will be escalated to a ban the length of however long the mod team feels like it depending on how serve it was the the user's previous history with these comments.\n\nCalamity's main userbase is generally around the ages of 13-20. That means most people in the community are probably minors. Be normal and quit being like this in public.\n\nI've also heard of people wanting user flairs. I'd like to see that people don't abuse them in some potential way first. Stop with this stuff for long enough and y'all will get them.",
        "num_comments": 336,
        "comments": [
            "This is either going to go rather unexpectedly smoothly, or if my reddit experience has anything to say this is going to go rather horribly. Either way, I'm going to continue lurking and see what transpires as usual.",
            "Everytime I see something like this happen and they mention the community is full of minors\n\nyeah, no shit Sherlock. Who do you think is making the majority of the Id fuck/smash jokes?",
            "does this include images like \"10/10 wood rail\" that are obviously jokes?",
            "Yippee, User flairs! Coming soon to a subreddit near me!",
            "Is calamity's userbase mostly being composed of children why it's so toxic?",
            "Isnt fabsol horny for calamitas too? Its not like the subreddit is where the horniness originated.",
            "I'm about to say something illegal >!booba!<",
            "you heard her guys, no more horny",
            "does this apply to being like \"wow they're rlly attractive\" but like not phrased like uh... the thing you said (im not chancing saying it)",
            "please make death master king slime easier i beg"
        ]
    },
    "Why are there 5?": {
        "title": "Why are there 5?",
        "score": 158,
        "url": "https://i.redd.it/neo7qvu9kh9d1.jpeg",
        "content": "I’ve just started playing calamity and ive been looking up strategies specifically for eater of worlds because I just can’t beat it. Are there supposed to be 5 of them?? Im on Master + Revengeance mode, I haven’t seen anything about this online.",
        "num_comments": 35,
        "comments": [
            "Tone it down to expert revengeance for your first playthrough. \n\nBut unfortunately, I don't know what the issue could be.",
            "Definetly not supposed to fight 5 at once. Also use print screen or win+shift+s for screenshots",
            "Dig a straight line with scarab bomb in tbe underground corruption and run using a bow and jester arrows. It's that simple. You need to fire at them at the moment they spawn tho so make it possible.",
            "Something similar happened to me with the final boss of Thorium, turns out the problem was Fargo's loot bonus, if you're using the mod try disabling it for bosses, or making the loot bonus 1.",
            "yeahh... maybe stick to normal expert revengance...",
            "New to calamity myself but mine also had 5 on master revengeance. Got his ass though",
            "I hated EOW in Ravengence",
            "\"Guys help me, I've turned the difficulty as high as it can go and now the game is hard!\"",
            "yeah i know ive chosen a pretty high difficulty but ive looked online so much and i havent seen anyone have to fight against five of them? even on higher difficulties.",
            "Am i the only person who plays on the hardest difficulties on my first playthroughts?"
        ]
    },
    "Best world gen ever": {
        "title": "Best world gen ever",
        "score": 454,
        "url": "https://i.redd.it/hnontg7zed9d1.jpeg",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Average calamity player:\nmy world loads up normally, only for meteors and astral stars to mess up my world gen",
            "Blossom garden: let me introduce myself",
            "I have genuinely begun to think this thing targets the dungeon because the amount of times I have gone to the dungeon after defeating WoF and found it completely fucking obliterated",
            "I didn't have mine hit the dungeon, but it did hit my houses made for snow pylon teleporting",
            "What the hell is the blossom garden and why is everyone talking about it?",
            "I once got it on top of the dungeon, so the roots were inside the token, not a real big deal, if it didnt destroy my teleporter, and give me a massive headache.",
            "\"No matter the misfortune, no matter the disaster, our faith will not be shaken.\"",
            "I spent 4 hours building a \"laboratory\" in the snow biome then the fucking astral biome spawned in it and almost destroyed our smaller base we used as a home",
            "the altar is ALLWAYS above my dungeon, not letting the cultists spawn",
            "Same, but it (Astral Biome) targets my Snow Biome for no reason, other than to piss me off I guess."
        ]
    },
    "Primordial wyrm infernum pre-yharon, is this good or no?": {
        "title": "Primordial wyrm infernum pre-yharon, is this good or no?",
        "score": 35,
        "url": "https://www.reddit.com/gallery/1dr73ug",
        "content": "",
        "num_comments": 9,
        "comments": [
            "On Infernum, it's completely possible with enough mobility. The attacks aren't the hardest with enough practice. Needless to say, I have always thought it's possible, but I never thought someone would actually do it. Great job!",
            "Maybe it's time i go back and finally do this foght, now that i finally foxed my fps issue..",
            "I'm always killing it pre yharon cuz it's easier than the stupid chicken for me",
            "Bruh I was in Pre-HM with and summoned this bozo with Pandora's box and still managed to dodge quite a lot lol. Shouldn't be that hard pre yharon",
            "Infernum Wyrm is 100% more engaging and fun and better to do than base calamity ngl",
            "Thanks! Although you shouldn't be commending me for that, not gonna lie this fight is pretty easy, the only danger here in my opinion is the swirling bullet phase.",
            "How did you fix your issue? I think I'm having a similar one",
            "How did you fix your issue? I think I'm having a similar one",
            "My fix is a really weird one, but i just have to put my pc to sleep mode, wake it up (by pressing on the mouse button or keyboard), launch the game and 60 fps no problem.\n\nWithout this fps is usually stuck at about 37.\n\nIt might not work for you, idk why it works for me, i've looked online for other solutions for hours, tried every performance mod there is, none of those worked."
        ]
    },
    "wtf???": {
        "title": "wtf???",
        "score": 78,
        "url": "https://v.redd.it/4xstuwg1nf9d1",
        "content": "",
        "num_comments": 13,
        "comments": [
            "no matter how many times i click. nothing spawns",
            "are you playing infernum without the infernum difficulty enabled?",
            "Yeah that happened to me. Stay near the code breaker seems to work after restarting the world",
            "Yes i am, would that be the cause of the problem?",
            "Infernum difficulty it is ",
            "You are SO done for",
            "Nah i did dog inf in like only 276 tries im basically the best player ever",
            "More like his pc or laptop is so done for when he choose thanatos and ares.",
            "bein strong isnt about never falling, thats just being powerful\n\nbeing strong is about getting back up over and over again knowing youll succeed eventually",
            "its fixable, you can do these 2\n\n1. disable infernum mod\n\nor\n\n2. fight them in infernum"
        ]
    }
}