{
    "Opinion: Rural California isn’t what you think it is — rural Californians are substantially more likely than their urban counterparts to own their own home and be employed.": {
        "title": "Opinion: Rural California isn’t what you think it is — rural Californians are substantially more likely than their urban counterparts to own their own home and be employed.",
        "score": 744,
        "url": "https://www.latimes.com/opinion/story/2023-09-17/rural-california-divide-urban-metro-cities",
        "content": "",
        "num_comments": 457,
        "comments": [
            "From the posting rules in this sub’s sidebar:\n\n> No websites or articles with hard paywalls or that require registration or subscriptions, unless an archive link or https://12ft.io link is included as a comment.\n\n---- \n\nIf you want to learn how to circumvent a paywall, see https://www.reddit.com/r/California/wiki/paywall. > Or, if it's a website that you regularly read, you should think about subscribing to the website.\n\n----\n\nBypassing the paywall: \n\nhttps://12ft.io/proxy?q=https%3A%2F%2Fwww.latimes.com%2Fopinion%2Fstory%2F2023-09-17%2Frural-california-divide-urban-metro-cities\n\n----",
            "I actually did think they were more likely to be employed and own their own homes. I’ve seen house prices in Visalia.",
            "I never would have been able to buy a home if id stayed in the Bay Area and I make more money and I’m less stressed.",
            "Pretty sure there are pockets of California that live up to whatever rural stereotype you could dream up, just like there are pockets that would live up to any urban stereotype.",
            "Wow who would have thought that affordable homes make it more likely to own home, such a novel idea. I guess being a super commuter ain’t that bad",
            "Oh rural California. There is certainly a lot of you.",
            "I’m a rural millennial homeowner. I underestimated just how much more I’d be spending on vehicle expenses and fuel out here. I moved from Oakland to Tuolumne county and my mortgage is half what my old rent was but my fuel expenses eat up whatever savings there were. I’m a tradesman and feel like I more or less live in my truck. \n\nI would argue that rural living is not cheaper but the quality of life is much better.",
            "Did people think this wasn't possible?",
            "Isn’t owning your own home the norm for rural people.",
            "Rural towns force you to make life decisions that lead towards owning a home. There are not enough employers that pay minimum wage to support apartment complexes. Cities can have tens of thousands of minimum wage employees in the service industry such as retail, coffee shops, fast food, restaurants, etc.  In rural communities, there might be a gas station, grocery store, and a few other miscellaneous shops. These would be staffed by the town's teenagers and small business owners. The options for a young adult in a rural community are:\n\n1. Move to a city for college\n2. Join the military/CAL FIRE/PG&E/Caltrans/etc.\n3. Learn a trade (electrician, plumbing, heavy equipment, etc.)\n\nThese options lead to a situation where a young adult can purchase a home in the low $300,000's. If the young adult does not succeed, life dictates that they would have to move to the city and work in the service industry, which would lead to them not be counting as a \"rural homeowner\".\n\nI moved to a rural town in the Sierras. Everyone in my age group that I interact with has a degree. In the post-Covid world and the proliferation of remote work, many are not even having to commute back to the nearest city for the higher-paying professional careers now.\n\nThere are pros and cons to life in a rural area. We lose out on ease of access to amenities, health care, colleges, and services (Both public and private). \n\nHowever, rural communities tend to have a better \"Sense of Community\", more volunteerism, larger lots, more outdoor recreation opportunities, lower crime, less pollution, and lower cost of living."
        ]
    },
    "New laws regarding right to repair, hidden fees, and more go into effect July 1": {
        "title": "New laws regarding right to repair, hidden fees, and more go into effect July 1",
        "score": 40,
        "url": "https://ktla.com/news/california/new-laws-going-into-effect-in-california-on-july-1-2024/amp/",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Note as many have read there’s a bill is being pushed through that would exempt restaurants from SB478. Bill Dodd and Scott Weiner got lobbied pretty hard. ",
            "I urge you all to write your state reps to vote against this.\n\nDon’t know who represents you? [Look it up here](https://findyourrep.legislature.ca.gov/).\n\nDon’t know how to write a letter to your rep? [Here is an example.](https://cms9files1.revize.com/lcwa/LegislatorSupportLetter%20%281%29.pdf)\n\nAnother good tactic is calling them. Email is less effective from what I’m told.",
            "SB 1524.\n\nPlease contact your representatives and tell them to vote against it!"
        ]
    },
    "California to make financial literacy classes a requirement to graduate high school": {
        "title": "California to make financial literacy classes a requirement to graduate high school",
        "score": 2726,
        "url": "https://abc7news.com/post/california-makes-financial-literacy-classes-graduation-requirement/15006074/",
        "content": "",
        "num_comments": 221,
        "comments": [
            "This is great news. Financial institutions profit off of financially illiterate masses. Just a little bit goes a long way",
            "\"The agreement requires all California high school students to take a semester-long personal finance education course starting by the 2027-28 school year.\n\nThe course will also be a graduation requirement starting with the Class of 2030-31.\"\n\nThis has been a LONG time coming! I dont usually cheer my government this hard, but this was so badly needed. In the end, this will be very bad for predatory lenders especially, and I am really hoping this will help bring down the average new car payment from $750 as students learn what interest is and how it works. Just hopping over to the car buying, and credit reddits here, so so so many people haven't the slightest clue what the 19.99% apr means on their $70,000 Ford F250 Fx4 OffRoad auto loan.",
            "This is HUGE. Financial illiteracy holds back so many Americans. \n\nOne of the best additions to our education system in years.",
            "Just another example of California being one of the few states that actually operates like an entity which exists to ELEVATE its citizens and not just extract value out of them. Proud to live here.",
            "I used to be a HS math teacher in California. I always included a section on finances for my general math classes, which were for students who couldn't pass the harder classes (algebra, etc.) Unfortunately there was zero flexibility to include such a unit in the other math courses. In my class I told students that I would teach them how to become millionaires if they wanted to learn it, and of course they did. So first they had to get proficient at basic arithmetic and learn percentages and compound interest. I always made mastery required, we didn't move on until they knew how to add, subtract, multiply and divide while numbers, fractions and decimals. \n\nAt that point, once they all had those skills, I taught two units: financial literacy and nutrition literacy. They learned about \"the magic of compound interest\" and managing budgets, and how to read nutrition labels, calculate calories, etc. These were taught using simulations where they made choices, and practical examples such as outside speakers telling their own rags to riches stories, nutritionists who brought in a fast food meal and a whole food healthy meal and helped students see how they compared. \n\nOver the years I had many angry parents saying that I shouldn't stress out students by making them participate in these lessons, but also many students who came in years after high school to profusely thank me for teaching them these basics. \n\nI've also helped students after high school, as they call me and ask for financial advice, and I provide it. I've had several that became millionaires, one in his 30's who (as a gardener) bought several homes outright and makes really high incomes. \n\nI always advocated for a course on financial literacy, but there was never \"room\" in the curriculum for this. It's wonderful that it is happening now. \n\nBut now, how about nutrition also being required?",
            "First good move that our government has made toward our educational system",
            "That's great! They should also teach about predatory lending, scam trade schools, con artist dentists, and employment rights.",
            "About time! This initiative is crucial for preparing students for real-world financial challenges.",
            "Solid move.",
            "Excellent. Most of us got some kind of financial literacy education in school, but it was likely brief, spread across different grades and classes, and not a singular focused curriculum. \n\nHell mine was mainly some guy from BankOne that came into our 9th grade class for one day, talked about checking & savings accounts, and handed out toothpaste tube rollers with their bank logo and his business card. We then had to do the whole monthly living expenses vs budget project for a couple weeks, and that was it. \n\nNot exactly thorough. "
        ]
    },
    "Supreme Court says cities can ban homeless encampments. How it affects California": {
        "title": "Supreme Court says cities can ban homeless encampments. How it affects California",
        "score": 370,
        "url": "https://www.sacbee.com/news/local/homeless/article289218819.html",
        "content": "",
        "num_comments": 65,
        "comments": [
            "I feel like I watched this episode of Star Trek already.",
            "I really think a lot more need to be evaluated to find out if they have mental illness and needs to be in facilities. When I was homeless and staying in a shelter, the people I’d see are just regular people you’d see every day and wouldn’t notice they’re actually homeless. Many of these people had jobs and families to take care of. They did their best to get back on their feet. \n\nSome don’t want help and do actually prefer the life of living on the street.",
            "When we pushed for the Tuff shed project in Oakland, one of the chief problems was getting the homeless to move into them. Clearing camps was possible but came with thorny legal issues.\n\nI am not in favor of arrest or fines, and if they refuse to accept some housing that is created for them, there may not be an alternative. It feels like a lot of these projects fail because the homeless can camp where they want. I get why they do that. I was homeless and love nothing more than my autonomy.  But should we all live in filth?",
            "Awesome finally",
            "Funny, in california we spend millions to house the homeless, even having bought out entire hotels for the homeless in SF and sonoma county and Los Angeles. \n\nI seriously Wonder if those in charge of those places will turn to charging the homeless some means of rent, just because they have no other option at this point.\n\nI wish it were different , frequently people will leverage law to their favor",
            ">“Today’s ruling by the U.S. Supreme Court provides state and local officials the definitive authority to implement and enforce policies to clear unsafe encampments from our streets,” Newsom said in a statement on Friday. “This decision removes the legal ambiguities that have tied the hands of local officials for years and limited their ability to deliver on common-sense measures to protect the safety and well-being of our communities.“ \n\n>He added, “California remains committed to respecting the dignity and fundamental human needs of all people and the state will continue to work with compassion to provide individuals experiencing homelessness with the resources they need to better their lives.”\n\nThe fact Newsom isn't criticizing the decision is going to make so many confused.\n\nIf cities don't ban public camping, this will finally attract more homeless.",
            "Cities should still provide a place to go — but this will help them force people to go.",
            "I think there need to be institutions that aren't prisons. Get outside what we know. Create and bankroll a new type of facility for these situations. We're already spending a lot of money, and the situation isn't improving. Let's spend the money in a more directed and productive manner with better oversight. Rehabilitate those we can and develop long-term solutions for those we can't. Train counselors, give more able residents jobs in kitchen and laundry. We can do better. But first, we have to acknowledge that unwanted intervention is just necessary in some cases.",
            "Well it says cities CAN. But if they don’t want to they don’t have to. I don’t think it will affect any big city in California.",
            "It is now a crime to be poor."
        ]
    },
    "State Farm Seeks Enormous Rate Increases in California to Prevent Insolvency": {
        "title": "State Farm Seeks Enormous Rate Increases in California to Prevent Insolvency",
        "score": 131,
        "url": "https://www.kqed.org/news/11992399/state-farm-seeks-enormous-rate-increases-in-california-to-prevent-insolvency",
        "content": "",
        "num_comments": 43,
        "comments": [
            "Sounds like maybe they should cut back on that advertising and executive spending.",
            "Based on the headline, I was expecting way more than a 30% increase.",
            "No wonder my home insurance renewal was through the roof this year",
            "We need to nationalize all forms of insurance: health, property/casualty, life, car",
            "This is a very easy problem to solve — massively increase infill construction, and ban new sprawl development at the urban wild interface.\n\nOf course we won’t do that because NIMBYs are too powerful.",
            "The traditional California suburb is a tinderbox in a wind blown wildfire and dinking around with insurance rates does nothing to fix that. Wooden siding, wooden decks, wooden fences and shrubs hugging the walls are indefensible features. \n\nThe lessons will continue until we observe what burns and keep those things away from our buildings.",
            "State Farm CEO made $22 million in 2022, highest among peers. State Farm lost $6.7 billion the same year.  Spent $1 billion on advertising.  I despise State Farm, terrible customer service. Imagine losing billions and getting paid $22 million to do it.\n\nhttps://www.insurancejournal.com/news/national/2023/10/11/743595.htm#:~:text=Six%20CEOs%20received%20at%20least,Schnitzer.\n\nhttps://newsroom.statefarm.com/2023-financial-results/#:~:text=State%20Farm%20reported%20a%20net,on%20an%20individual%20affiliate%20level.\n\nhttps://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/geico-leads-pack-in-slashing-insurance-advertising-spend-81079056#:~:text=State%20Farm's%20ad%20spend%20falls%20below%20%241B&text=It%20spent%20nearly%20%24992%20million,from%20%241.01%20billion%20in%202022.",
            "I’d be grateful at 30%. My insurance went from $2200 to $16000 on FAIR. Same for my neighbors.",
            "Me, too but just this afternoon, I found out my SafeCo (Liberty Mutual) increase will be only about 10%.",
            "I am surrounded by parkland and grazing. Works pretty well"
        ]
    }
}