{
    "Opinion: Rural California isn’t what you think it is — rural Californians are substantially more likely than their urban counterparts to own their own home and be employed.": {
        "title": "Opinion: Rural California isn’t what you think it is — rural Californians are substantially more likely than their urban counterparts to own their own home and be employed.",
        "score": 741,
        "url": "https://www.latimes.com/opinion/story/2023-09-17/rural-california-divide-urban-metro-cities",
        "content": "",
        "num_comments": 457,
        "comments": [
            "I actually did think they were more likely to be employed and own their own homes. Ive seen house prices in Visalia.",
            "I never would have been able to buy a home if id stayed in the Bay Area and I make more money and Im less stressed.",
            "Pretty sure there are pockets of California that live up to whatever rural stereotype you could dream up, just like there are pockets that would live up to any urban stereotype.",
            "Wow who would have thought that affordable homes make it more likely to own home, such a novel idea. I guess being a super commuter aint that bad",
            "Oh rural California. There is certainly a lot of you.",
            "Im a rural millennial homeowner. I underestimated just how much more Id be spending on vehicle expenses and fuel out here. I moved from Oakland to Tuolumne county and my mortgage is half what my old rent was but my fuel expenses eat up whatever savings there were. Im a tradesman and feel like I more or less live in my truck. \n\nI would argue that rural living is not cheaper but the quality of life is much better.",
            "Did people think this wasn't possible?",
            "Isnt owning your own home the norm for rural people.",
            "I too have thought about moving to Victorville since I do have job opportunities out there, the only negative is I would live in Victorville.",
            "Does this writer not know the reason why people don't want to live rural?  And that includes sacrificing home ownership."
        ]
    },
    "New laws regarding right to repair, hidden fees, and more go into effect July 1": {
        "title": "New laws regarding right to repair, hidden fees, and more go into effect July 1",
        "score": 45,
        "url": "https://ktla.com/news/california/new-laws-going-into-effect-in-california-on-july-1-2024/amp/",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Note as many have read theres a bill is being pushed through that would exempt restaurants from SB478. Bill Dodd and Scott Weiner got lobbied pretty hard.",
            "SB 1524.\n\nPlease contact your representatives and tell them to vote against it!",
            "I urge you all to write your state reps to vote against this.\n\nDont know who represents you? [Look it up here](https://findyourrep.legislature.ca.gov/).\n\nDont know how to write a letter to your rep? [Here is an example.](https://cms9files1.revize.com/lcwa/LegislatorSupportLetter%20%281%29.pdf)\n\nAnother good tactic is calling them. Email is less effective from what Im told."
        ]
    },
    "California to make financial literacy classes a requirement to graduate high school": {
        "title": "California to make financial literacy classes a requirement to graduate high school",
        "score": 2922,
        "url": "https://abc7news.com/post/california-makes-financial-literacy-classes-graduation-requirement/15006074/",
        "content": "",
        "num_comments": 234,
        "comments": [
            "This is great news. Financial institutions profit off of financially illiterate masses. Just a little bit goes a long way",
            "This is HUGE. Financial illiteracy holds back so many Americans. \n\nOne of the best additions to our education system in years.",
            "Just another example of California being one of the few states that actually operates like an entity which exists to ELEVATE its citizens and not just extract value out of them. Proud to live here.",
            "First good move that our government has made toward our educational system",
            "That's great! They should also teach about predatory lending, scam trade schools, con artist dentists, and employment rights.",
            "About time! This initiative is crucial for preparing students for real-world financial challenges.",
            "People who never paid attention high school pretending like they would've paid attention to this class",
            "Financial literacy to graduate!?!?!?! Time to move my children to Louisiana where they teach the Bible and Jesus' words in public schools and don't waste time on \"financial literacy!\" California libs are ruining the world!\n\n- Some financially illiterate Trump voter, probably",
            "u know the students will still say but they aint teach us nothin!",
            "This is great for sure! It will definitely help people avoid financial problems caused by bad budgeting.  Hopefully it will also have a positive impact on the next generation of politicians, as they are horrible with public funds."
        ]
    },
    "Supreme Court says cities can ban homeless encampments. How it affects California": {
        "title": "Supreme Court says cities can ban homeless encampments. How it affects California",
        "score": 437,
        "url": "https://www.sacbee.com/news/local/homeless/article289218819.html",
        "content": "",
        "num_comments": 89,
        "comments": [
            "I feel like I watched this episode of Star Trek already.",
            "I really think a lot more need to be evaluated to find out if they have mental illness and needs to be in facilities. When I was homeless and staying in a shelter, the people Id see are just regular people youd see every day and wouldnt notice theyre actually homeless. Many of these people had jobs and families to take care of. They did their best to get back on their feet. \n\nSome dont want help and do actually prefer the life of living on the street.",
            "When we pushed for the Tuff shed project in Oakland, one of the chief problems was getting the homeless to move into them. Clearing camps was possible but came with thorny legal issues.\n\nI am not in favor of arrest or fines, and if they refuse to accept some housing that is created for them, there may not be an alternative. It feels like a lot of these projects fail because the homeless can camp where they want. I get why they do that. I was homeless and love nothing more than my autonomy.  But should we all live in filth?",
            "I think there need to be institutions that aren't prisons. Get outside what we know. Create and bankroll a new type of facility for these situations. We're already spending a lot of money, and the situation isn't improving. Let's spend the money in a more directed and productive manner with better oversight. Rehabilitate those we can and develop long-term solutions for those we can't. Train counselors, give more able residents jobs in kitchen and laundry. We can do better. But first, we have to acknowledge that unwanted intervention is just necessary in some cases.",
            "Cities should still provide a place to go  but this will help them force people to go.",
            "Well it says cities CAN. But if they dont want to they dont have to. I dont think it will affect any big city in California.",
            "As much as we need solutions, it's crucial to ensure they're humane and effective. Let's hope for policies that truly uplift those in need, not just move them around like pieces on a chessboard.",
            "Yes, affordable housing is needed, but for the other 80% of the homeless, we need mental healthcare.  Most of the homeless have serious untreated, unmanaged mental illness exacerbated by drug addiction and alcoholism.",
            "It is now a crime to be poor.",
            "I wonder how long until this is used against protestors"
        ]
    },
    "State Farm Seeks Enormous Rate Increases in California to Prevent Insolvency": {
        "title": "State Farm Seeks Enormous Rate Increases in California to Prevent Insolvency",
        "score": 156,
        "url": "https://www.kqed.org/news/11992399/state-farm-seeks-enormous-rate-increases-in-california-to-prevent-insolvency",
        "content": "",
        "num_comments": 58,
        "comments": [
            "Sounds like maybe they should cut back on that advertising and executive spending.",
            "No wonder my home insurance renewal was through the roof this year",
            "Based on the headline, I was expecting way more than a 30% increase.",
            "We need to nationalize all forms of insurance: health, property/casualty, life, car",
            "This is a very easy problem to solve  massively increase infill construction, and ban new sprawl development at the urban wild interface.\n\nOf course we wont do that because NIMBYs are too powerful.",
            "State Farm's billion-dollar ad spend and massive losses raise serious concerns about their financial management and customer impacts.",
            "Say it louder for the CEO snorting coke in the back!!!",
            "Id be grateful at 30%. My insurance went from $2200 to $16000 on FAIR. Same for my neighbors.",
            "Me, too but just this afternoon, I found out my SafeCo (Liberty Mutual) increase will be only about 10%.",
            "Im sorry, you arent a corporation. We dont nationalize your risk as an individual only if you are a too big to fail corporation"
        ]
    }
}