{
    "\"Who's My Godly Parent?\" Megathread": {
        "title": "\"Who's My Godly Parent?\" Megathread",
        "score": 38,
        "url": "https://www.reddit.com/r/camphalfblood/comments/1dp9ev3/whos_my_godly_parent_megathread/",
        "content": "This is a megathread to figure out what cabin you belong in!\n\nFeel free to list your features, likes, dislikes and personality traits to help other campers decide where you belong, **but if you are under 18 please do not give out your age on a public forum like this one.**\n\nFinally, if you would like to get your parent next to your name, you’ll want  to follow [this tutorial](https://www.reddit.com/r/reddittutorials/comments/god3ep/how_to_add_and_edit_your_user_flair_on_the_reddit/) if you're on mobile and [this tutorial](https://www.reddit.com/r/reddittutorials/comments/bkt7u2/how_to_add_and_edit_user_flair_in_the_redesign/) if you're on desktop.",
        "num_comments": 85,
        "comments": [
            "appearance: female, skinny, 5’4, wavy brown hair, blueish grey eyes, resting worried face, i waver between punk/alt, and like soft colors. \n\npersonality: nice, caring, social anxiety, really quiet, depressed\n\nlikes: painting, reading, sewing, listening to music (like rock or taylor swift), horror movies/podcasts, ancient world history\n\ni’m also bisexual.",
            "Very excited to see :)\n\nPhysical Features:\n- 5’4”\n- Dirty Blonde/Light Brown Hair (Different People say different things)\n- Wavy/Loose Curly Hair\n- Long Hair\n- Green/Blue Eyes (I have Central Heterochromia)\n- Fair Skin\n- Female\n\nLikes:\n- Horse Riding (As seen in my username)\n- Reading\n- Journalism\n- Creative Writing\n- Singing\n- Playing Flute, Piano, Oboe, and Ukulele\n- Marching Band\n- Theatre\n- Dance (Ballet, Contemporary, Jazz, and Lyrical)\n- Running\n- Pole Vaulting\n\nDislikes:\n- Art (I see only my mistakes)\n- Large Crowds/Tight Spaces\n- Bugs\n- The Sun Being Too Bright\n- ",
            "I’m a short girly (4’11” and I’m in my early 20s) with brown hair and hazel eyes. I love True Crime, Crime Procedural dramas (like Criminal Minds), reading (mostly YA fantasy), aesthetics and fashion, learning about the uses of plants in different cultures, and Kpop. My general aesthetic is something like dollette with a lot of pastel colors, bows, light pink, and lace. I’m autistic, ADHD, and OCD so that’s fun. I’d like to think I’m a daughter of Aphrodite.",
            "I'm a 5'5\" girl with short brown hair (by short I don't mean like a bob, I have a pixie cut that is slightly longer than a typical men's crew cut.) I have greyish blue eyes, and I'm pretty pale.\n\nI have ADHD and autism, as well as dysgraphia (basically dyslexia but with writing, please nobody turn this into a debate about how dysgraphia is just dyslexia, I'm diagnosed and don't wanna hear it, I'm just looking for my PJO cabin)\n\nI like music and theatre, as well as making cardboard sculptures and crocheting. I enjoy creative writing although it gets hard with my dysgraphia, and I love stage performance. I also really like the outdoors and going for walks. \n\nI'm pretty good at most academic subjects, but I tend to get bored with it and skip assignments that make my grades drop. I really like English class, I enjoy analyzing literature and learning about certain elements in writing. I tend to be a grammar and spelling nerd, and I learned to read fairly early on. I am okay at math, I am able to learn the concepts and such, but depending on the teacher and how much unnecessary busy work homework they give out, I may just get bored and choose not to do it or learn the concepts (screw the school system, I hate having to repeat different variations of the same problem so many times) Science is a so-so subject for me, but I enjoy the hands-on labs. History is eh, really depends on what is taught and how it's taught. I do choir and I love it, it's a great part of my day, and I enjoy singing a lot, although i dislike the kids who think they have some sort of superiority just because they're in a choir outside of school.\n\nI like socializing and having fun with friends, although I can sometimes become an outcast if I can't find the right people to tolerate me. I sometimes run out of social battery and have to spend a lot of alone time to feel better, but it takes a lot for that to happen. I tend to get very anxious about being liked and not annoying or uncomfortable. I have quite a few people I consider friends, but some I'm closer to than others. I tend to be reserved for a very small amount of time when I meet people, usually like 8 hours worth of being around new people, I don't really talk and I kind of just take in how the people are so I know how they interact with others.\n\nI get many short lived hyperfixations that I obsess on for a few months then forget about entirely until somebody mentions them again and i can just spew out every single detail of what I know about the subject.\n\nOverall, I'm usually described as outgoing, smart, and creative, but I lack many different social skills and life management skills. Usually the only thing I can do for super long and sacrifice anything for is theatre.",
            "Any hermes sibs out there? \n\nI literally have the hermes cabin kid ears, jack of all trades like Hermes himself(as described by luke), kinda good at not so moral hermes stuff like lock picking and stealing,,,,, \nI never get lost when I travel/hike/go bike trailing",
            "I'm a 5ft 10in 16 year old male, with like greenish gray or blueish gray eyes. I have dirty blonde, basically brunette hair.\n\nI'm an introvert for the most part, but I have times where I can be outgoing and very hyper (yes, I have ADHD). I am often excluded or forgotten about by my friends, but to make up for that, I enjoy reading, listening to music, watching anime, playing video games, cooking, playing DnD, swimming, and building Legos. \n\nAt my school, I am involved in our FFA, wrestling, and american football teams. In FFA, I do our poultry judging CDE team and as much volunteering as I physically have time for.\n\nMy music taste is very sporadic. I listen to a lot, and I won't say everything tho, some of the genres I listen to are metal, numetal, dad rock, pop, sad hip hop, white gurl music, some K pop and K rock is in there I also have classical and a lot more.\n\nWhen it comes to reading, I read a lot of fiction books and some romance books. I read manga, dystopian, sci-fi, historical fiction, dark romances, realistic fiction, and all Uncle Rick's books.\n\nMy favorite character in PJO is definitely Reyna because she is the character I connected to the fastest and who helped me realize that I'm aroace. I also think I'm at least bi-curious.\n\nThat is all I have. I'm sorry it's so much. I just want to try and find where I truly belong. Thank you for reading",
            "I wonder who I'll get\n\nAppearance:\n5'8, wavy dark brown hair, brown eyes, resting bitch face, big hands and feet, looks like a stoner\n\nPersonality:\nreserved, quiet in school, reckless, rude, tired, depression, severe anxiety, mildly paranoid \n\nLikes:\ndrawing, jazz band, marching band, One Piece, FNaF, Ghibli films, IT, Broadway musicals, plushies, true crime, Danganronpa, horror, History(specifically Abraham Lincoln's assassination and MLK's assassination), music, math, speculative biology, needles, worms, animals, money\n\nDislikes: \nart block, nosey people, practicing, current politics, insects, bugs, vegetables, school, minor inconveniences, being tired, hallucinating, mental hospitals staff, Instagram reels, cops, alcohol, back pain",
            "Appearance: 5'3\" at 115 lbs, short and skinny but gaining muscle, wavy brown hair, green eyes, short scruffy beard, younger-looking, dresses midwestern emo/butch lesbian with lots of black, flannel, boots, chains, and denim (am a dude). All I'm saying about my age is that I was in middle school when *The* *Lightning Thief* first came out.\n\nPersonality: I'd like to say kind, considerate, inquisitive, polite, and hardworking, but also kind of sarcastic, aloof, and cool on the outside but anxious on the inside. The confidence is mostly a front.\n\nLikes: art, history, literature, working out, big into metal, punk, and rock of various kinds, fantasy, strategy, warfare, and simulation games, going out to get turnt with close friends, working towards a bigger, better picture, my teaching job.\n\nDislikes: discourtesy, superficiality, my mental state, loneliness, stagnation, vulnerability, stubbornness, my teaching job.",
            "How exciting\n\nAppearence: Light brunette skin, 5’7, broad shoulders, medium black straight hair, brown eyes, athletic.\n\nPersonality: ADHD, and sometimes I have hard times reading, i tend to stim a lot and can’t stay put, with my friends I talk a lot, but with people I don’t lnow I’m pretty much just a mute guy.\n\nLikes/Dislikes: Martial Arts, Magic, Hyperfixation varies a lot but mostly is about magic things and stuff like that, I like any kind of music, I don’t really like loud or sudden noises, I enjoy being alone, I like singing, and animals, music I love, and reading too, sometimes I’m too sensory as I tend to feel uncomfortable when for example my wet hair touches my neck or stuff like that.",
            "Let's do this then...\n\nAppearence: something like 1 meter and 80 centimeters of height; average sedentary body; for the face i have green eyes, white Brazilian features. Dark brunet curly hair on neck lenght that covers the head like a sheep's wool when it's dry.\n\nLikes: Reading, Writing, videogames (even tho the monsers can come in) and staying at home, swords, going to a farmhouse, running and using the street as obstacles to dodge.\n\nDislikes: School, loud places, total darkness, math, chemistry, rules, dictatorships, when something bad happens to someone of importance.\n\nPersonality: Doesn't give up easily, kind of lazy but does fast and great work when it's on the deadline, anxious, kind of rebel, timid, can't accept a vague answer, questions a lot, kindhearted, quiet but slowly opens up."
        ]
    },
    "Character Headconons😂 [pjo]": {
        "title": "Character Headconons😂 [pjo]",
        "score": 350,
        "url": "https://www.reddit.com/gallery/1dqueou",
        "content": "",
        "num_comments": 51,
        "comments": [
            "Some of them are accurate *cough cough, Jason.*",
            "Why are these so accurate😆",
            "OP selected many of the best answers, but here's the full link if you want to try the generator yourself:\n\n[https://perchance.org/character-headcanon-generator-improved](https://perchance.org/character-headcanon-generator-improved)\n\nI quite liked \"Percy uses the word \"f@%k\" like a comma.\" too.",
            "WHY ARE THEY ALL SO GODDAMN ACCURATE, WTAF",
            "Hazel's is way too accurate",
            "\"WhY aRe ThEsE sO aCcUrAtE?!\" Because it's a generator that you can just... keep getting new prompts until you find one that you like.",
            "This is inaccurate,  Leo would never actually get away with it",
            "I’d give Reyna a hug",
            "Leo nooooooo",
            "Man, that shade of green has been kind of ruined by the internet."
        ]
    },
    "[hoo] I'm so disappointed by the ending of the heroes of olympus ": {
        "title": "[hoo] I'm so disappointed by the ending of the heroes of olympus ",
        "score": 130,
        "url": "https://www.reddit.com/r/camphalfblood/comments/1dqugtq/hoo_im_so_disappointed_by_the_ending_of_the/",
        "content": "\nI even went to check that it was indeed the last book in the series because it seemed unbelievable to me that it would end in such an uneventful way.\n\nI am a big fan of Rick Riordan's Percy Jackson universe, but I feel that he really missed the mark with The Heroes of Olympus. Where is the drama? The epic moments? The sacrifices?\n\nI think my biggest disappointment is the fact that he hyped us up over several books about Percy having to make a huge sacrifice, only for it to turn out to be... nothing. \n\nI think that the story had a lot of potential and could have been SO much more. I'm really frustrated \n",
        "num_comments": 28,
        "comments": [
            "It really felt like there should have been a 6th book with a big climatic ending and resolution instead. \n\nAnd the 5th book just ends when Gaea wakes up.\n\nThe way they just rushed it in the Blood of Olympus was so underwhelming.",
            "I do think that there were plot threads that were just... Dropped. How Percy would face an impossible decision. How Frank would play an important role because Percy might not be able to make the right choice. How Hazel's curse would be washed away by a descendant of Poseidon. Also, Hazel facing some sort of reckoning with the gods when they all learn that she's supposed to be dead (the thing Thanatos said at the end of SoN definitely felt like a band-aid but not the end of the story). \n\nThere are a lot more that I'm not thinking of, too, I'm sure.\n\nI think that it would have been very easy to make Octavian a slightly more rounded villain by getting rid of the blackmail subplot that never went anywhere, and instead have him focus on stuff like being mad that Percy makes the comment at the start of MoA about how Jason can have the praetorship back, since that's a really big deal for all of New Rome, and Percy was acting like it wasn't significant (and I can see both perspectives here, honestly, because to Percy, his ties to CHB were much stronger). Give him a position that's reasonable from a neutral perspective, and then it makes sense why all the Romans are willing to follow him. Have the Greeks respond aggressively and show an actual escalation between the two camps, to justify the hype about how Greeks and Romans knowing about each other always leads to bloodshed.\n\nAnd when Gaea wakes up... I honestly thought that should have been the end of the book, and the next book is them dealing with her. Give me BotL level drama of Kronos getting out of the sarcophagus in Luke's body with golden eyes, and then leave me on edge until the next book drops! Have the two camps reconcile with the Athena Parthenos just as Gaea wakes and the ground starts to turn against them, with the Seven stuck in Greece, and then leave us in suspense, just as bad as the MoA cliffhanger.\n\nOkay, here's my real thought: HoO should have been seven books, and Rick should have been okay with killing off characters. The pacing for HoO is all off because TLH and SoN are both intro books, but the whole arc of the Argo quest itself should have taken 5 books. Four, at least. The story suffered because we had these really interesting protagonists and a lot of hyped up plot threads about the devastation they were facing, and then that all got packed into three books where the villains were very flat and easily defeated.",
            "What I found kind of weird is that there were also no rewards for the 7 like Percy and the others got after the Titan war. At first I thought it might have been offscreen, but there was also no mention of such a thing in the later books.\n\nMy biggest problem with the last book of HoO however was, that there was not a single POV of Percy and Annabeth. Their POV would've been quite interesting, to see how they were handling their time in Tartarus. Yet there were POVs for both Nico and Reyna. I get that it was to show the sideplot of them returning the statue, but Rick could've just had one of their POVs and given a little screentime to Percy and Annabeth. Considering what they went through in the last book that could have been an interesting insight.\n\nAnother problem I had with the ending was how the fight against Gaea and the giants was handled. At first there are dozens of Giants at the Parthenon, yet they for some reason disappear when the 7 show up, except for the main 12 Giants and the one for the fates. Then Gaea, the primordial embodyment of the earth get's put back asleep by a demigods charmspeak. If it was that easy why didn't the gods just send over Aphrodite. Surely her charmspeak is stronger than that of a demigod daughter of her.",
            "Given all the new world building, you would think the world would have felt bigger but I thought the opposite was true. The world felt small and there didn't feel like there were any consequences to their battles. I think the main reason is the lack of mortals. Despite the different groups going to several locations that should have been teaming with mortals, there was never any mention of them. When would the Acropolis not be chock full of tourists? \n\nIn TLT Gabe rallies the mortals against Percy, making the mortals seem like a threat that needed to be avoided. Percy destroyed a bus that endangered mortals. On the St Louis Arch, they were in danger and he put himself to protect them. In LA, we saw a huge earthquake because Hades was angry they escaped the underworld. There were cops on the beach.\n\nIn SoM they were mostly on the sea but at the start, in Percy's school, we saw monsters threatening the students, putting them in danger. TTC saw them battle the Nemean Lion in the National Air and Space Museum with mortals around. And the Battle of Manhattan in TLO had major consequences for mortals. They were asleep on the streets for three days. Typhon was causing huge damage to the country. \n\nBut in HoO, when the Earth herself is waking up, there's nothing. There should be earthquakes, volcanos, shifting landmasses. This is a major event that feels like it means nothing. \n\nOur heroes travel across the country, then across the world, then to Tartarus and it still feels small. This is the WORLD GODDESS and she's taken out like a chump. \n\nI hate that they meet and easily defeat THREE primordial deities. Literal building blocks of the universe and they mean nothing. Percy and Annabeth should never have met Tartarus or Nix. Or if they did they shouldn't have been antagonists. They should have been less than ants to two primordials. If they showed up they should have been neutral, does Tartarus even care about Gaia? Nix certainly shouldn't care. Beings that are older than the gods should never be made into nothing more than stumbling blocks for our heroes. It just adds to the feeling of disappointment and shrinks the world even further. \n\nThey built up Gaia's waking up as the end of the world. But it never felt like that. There should have been consequences to fighting her and there definitely should have been consequences to beating her.",
            "The last book chucking out 4 of the seven, including the franchise’s flagship character was a mistake.\n\nIt was nice bringing Nico and Reyna to the crew but making them POV protagonists was unnecessary",
            "I agree it could’ve been done better. Thousands of pages of build up, and then it’s like Oh Gaia wakes, the gods helped out and now she’s gone in like two chapters",
            "I kinda felt that over 3 of his series. The Last Olympian, The Blood Of Olympus, and The Serpent's Shadow all are kinda anticlimatic to me as finales for their respective sagas.\n\nLO all comes down to Percy handing over Luke a knife and we don't even get to see all the three kids from the Gods, Percy, Thalia, and Nico, fighting together. The way Thalia gets taken out in particular by a rock falling on top of her felt particularly lame.\n\nSerpent's Shadow is just the two leads doing a Kamikazi attack and that's it. I don't even remember if they actually fought Apophis.\n\nA BoO you spend 5 books hyping up seven main characters only to just use three of them in the big finale.\n\nIt's weird cause Rick can do really good climaxes. Percy vs Ares was good, Sadie and Carter vs Seth was great, and Jason's trio vs the giant in their first book was really cool too with Zeus passing a lightning through him. So I'm not sure why it's only the big finales that end up like this.\n\nMaybe he does a better job with the Magnus Chase or the Apollo finales, idk. I've yet to read those",
            "I was unhappy too. They gave Kronos a whole book to shine in the PJO series, but all we got for Gaia was just two pages. Kronos had this whole epic journey before his downfall, >!but all it took to end Gaia was some teenage girl charming her to go to sleep and two demigods blowing themselves up. I mean, Gaia is like this super-powerful primordial deity who was all built up in the first five books!<, and I was expecting something gross, but Rick totally missed the mark. I'm extremely disappointed by Rick://",
            "Sleep little earth mother don't say a word...",
            "I actually loved most of the series, but the ending destroyed me. Not because I was so sad, but because I was so annoyed and bored. I almost didn’t finish the book 😂"
        ]
    },
    "Who would you like to be alternative parents for each character [all]?": {
        "title": "Who would you like to be alternative parents for each character [all]?",
        "score": 32,
        "url": "https://www.reddit.com/r/camphalfblood/comments/1dr326y/who_would_you_like_to_be_alternative_parents_for/",
        "content": "I.e. Percy not as a son of Poseidon, Annabeth not as a daughter of Athena, Magnus not as a son of Frey, etc.\n\nFor Egyptians, Carter does not follow the Path of Horus, etc.\n\nMy mega hot take is that I find Percy and Annabeth to be both good as children of Apollo, so no more Percabeth 😈",
        "num_comments": 9,
        "comments": [
            "Percy - Hades. PJO would have been very interesting with Percy as a son of Hades. Imagine a plot line where Percy has to struggle with the decision to even want to save CHB or Olympus because they both treat him and his dad like shit. But he would also feel conflicted because there would be people at camp that he genuinely cares about. Maybe his request at the end for the gods to care about the campers more would be more profound, because he’s asking for help for a camp that didn’t care about him. Plus, Percy’s anger, and darker side with his ability to animate the dead or send people straight to Hades would be a sick combination. \n\nAnnabeth - The easy answer would be Hephaestus or something, but I would love to explore Annabeth as a child of Aphrodite. People would still underestimate her intelligence because they think all Aphrodite girls are shallow mean girls, and it would be interesting watching Annabeth trying to come to terms with her lack of success with love and loyalty, despite her mom being a love goddess. In the AU where Percy is a son of Hades, maybe Annabeth demonstrates just how formidable of a force love can be by showing love to Percy, and giving him a reason to care about the camp and not join Kronos. Plus, you could also have this cute juxtaposition of Annabeth being this colorful fashion girly, and Percy being this all-black-wearing goth punk kid.",
            "Percy as son of Neptune and Annabeth as daughter of Minerva would be amazing !",
            "holy hades i would love to read a fanfic like this",
            "Someone tell me when there is a fic like this😭🙏",
            "Be careful what you wish for. Just look at how different Thalia and Jason are just because of this despite them both sharing the same mom and dad",
            "Minerva doesn't have kids tho",
            "I have too many fanfic ideas rn, so I’ll have to put a pin in this. 😭",
            "I was joking since they technically have the same parents but Roman so they can still be together unlike your mega hot take",
            "Annabeth would be disowned by the Roman’s because of that"
        ]
    },
    "Did the mist not exist until after Olympus left Greece or was it always there in ancient times? [general]": {
        "title": "Did the mist not exist until after Olympus left Greece or was it always there in ancient times? [general]",
        "score": 32,
        "url": "https://www.reddit.com/r/camphalfblood/comments/1dqz4t5/did_the_mist_not_exist_until_after_olympus_left/",
        "content": "Thoughts",
        "num_comments": 11,
        "comments": [
            "Well, it was there but it was not everywhere.   In mythology, gods did make use of the Mist, but it was shown to be an active use.  For example, Athena used the Mist on Odysseus to prevent the suitors from recognizing him.  Or how she removes the Mist from Diomedes so he could see Gods that were disguised as humans. \n\nAs for Percy Jackson, according to the wiki, Hecate's job is to make sure the Mist obscures mortal eyes and makes sure they see the supernatural as normal things.  \n\nNow, why did the gods, an egotistical and immature group of rulers, decide to do this after the fall of Rome?  I don't know.  Your guess is as good as mine.",
            "I think it was because Chiron mentioned it being alluded to in the Iliad.",
            "Personally I would say the easiest explanation is that mortals basically all had Sallys sight during the Bronze ages, then lost it in the fall of civilization, and only some kept it into the iron age to now such as Sally.\n\nCan't really compare it to Greek/Hellenic Mythology since there is no mist, and Olympus is more its own realm in the aether, and then the tallest mountains were named after it and seen as symbolic 'because they are the closest'  So it can't really move since it doesn't really exist in our mortal world.\n\nBut to be fair that would help the mist existing pre bronze age collapse as there is people who jump up to Olympus in mythology then, but in then iron age people believe Olympus to be more heavenly, at least anyone who lives near Mt Olympus, which you could say is the mist!",
            "Maybe it became when Christianity became that's just this is a really deep thought though",
            "The only thing i can think of could be the rising popularity of christianity. And their… aggressive advertising. The nordic cultures turned their religious texts into story and poem books to keep their faith alive when Christianity came a knocking. Perhaps the olympians did something similar to keep themselves alive.",
            "My guess is it was a way to keep peace between other pantheons. Greek and Roman's didn't get along, and we know Egyptian-Greek hybrid gods have caused problems.",
            "They didn’t have clearsight in mythology, they just applied the mist differently\n\nThe mist *is* in mythology. It causes the gods to be invisible until they want to be seen by mortals. That way Athena can block arrows from hitting her favorite guy in a war, and all of the war gods can show up to a war without being noticed.",
            "Do you need someone to call for help? That sentence reads like a stroke.",
            "r/ihadastroke",
            "aggressive advertising is a nice way of putting it"
        ]
    }
}