{
    "\"Who's My Godly Parent?\" Megathread": {
        "title": "\"Who's My Godly Parent?\" Megathread",
        "score": 39,
        "url": "https://www.reddit.com/r/camphalfblood/comments/1dp9ev3/whos_my_godly_parent_megathread/",
        "content": "This is a megathread to figure out what cabin you belong in!\n\nFeel free to list your features, likes, dislikes and personality traits to help other campers decide where you belong, **but if you are under 18 please do not give out your age on a public forum like this one.**\n\nFinally, if you would like to get your parent next to your name, you’ll want  to follow [this tutorial](https://www.reddit.com/r/reddittutorials/comments/god3ep/how_to_add_and_edit_your_user_flair_on_the_reddit/) if you're on mobile and [this tutorial](https://www.reddit.com/r/reddittutorials/comments/bkt7u2/how_to_add_and_edit_user_flair_in_the_redesign/) if you're on desktop.",
        "num_comments": 88,
        "comments": [
            "I’m a short girly (4’11” and I’m in my early 20s) with brown hair and hazel eyes. I love True Crime, Crime Procedural dramas (like Criminal Minds), reading (mostly YA fantasy), aesthetics and fashion, learning about the uses of plants in different cultures, and Kpop. My general aesthetic is something like dollette with a lot of pastel colors, bows, light pink, and lace. I’m autistic, ADHD, and OCD so that’s fun. I’d like to think I’m a daughter of Aphrodite.",
            "I love books and tea I’m good at video games I consider myself to be smart black hair brown eyes I’m lazy",
            "I have reddish brown wavy hair and brown eyes and am 5'1. I like theater, choir, history, reading and music. I don't like running and most sports. Also I most definitely have dyslexia and my favorite character is Thalia also I'm a lesbian.",
            "24yo questioning bisexual male who is just so sweet and kind to the point that I’m basically naïve (and I will fight to stay naïve because I can’t handle some of the realities of the world). Severe ADHD, on the spectrum, 6’ tall 240lbs and just generally a gentle giant who loves to infodump",
            "6”0 ft tall 160lb plays the saxophone, loves to sing. Love playing games. Is a history dork. Loves action movies and games. Am loud around friends but quiet anywhere else. Sports: wrestling and swim",
            "Alright, let's try this. I'm a 6' tall male that has a love for music. I love engineering. I'm fairly smart. I love watching movies, playing sports and video games. I don't like talking to people or being singled out to do stuff in public (so being introverted), but around friends I can get loud.\n\nFeel free to ask (reasonable) questions",
            "I was going to say Apollo because of all of the instruments but I feel Apollo Kid would love when the sun is bright and would stare at it. so I’ll say out of the main 12 your godly parent is Athena, I would say Artemis if she could have kids but she can’t. I hope you agree!!",
            "Welcome to the Apollo cabin homegirl.\n\nYou love music, theater, and creative writing, you're impulsive (because of the hyper fixations that come and go with very minimal coaxing). If you have a dramatic sense of humor, you're pretty much me, just replacing basketball with theater.",
            "Like the other person said you are pretty much the embodiment of an Apollo kid. If I had to pick different it would be Athena.",
            "I get lost too easily but if I didn’t I could possibly be a Hermes kid…"
        ]
    },
    "Character Headconons😂 [pjo]": {
        "title": "Character Headconons😂 [pjo]",
        "score": 540,
        "url": "https://www.reddit.com/gallery/1dqueou",
        "content": "",
        "num_comments": 71,
        "comments": [
            "Some of them are accurate *cough cough, Jason.*",
            "Why are these so accurate😆",
            "\"WhY aRe ThEsE sO aCcUrAtE?!\" Because it's a generator that you can just... keep getting new prompts until you find one that you like.",
            "Hazel's is way too accurate",
            "This is inaccurate,  Leo would never actually get away with it",
            "WHY ARE THEY ALL SO GODDAMN ACCURATE, WTAF",
            "I’d give Reyna a hug",
            "Man, that shade of green has been kind of ruined by the internet.",
            "All of these happened you can’t convince me otherwise",
            "I think these are all canon😂"
        ]
    },
    "What moment from the books did you read for the first time that got you super hyped and amped up? [pjo]": {
        "title": "What moment from the books did you read for the first time that got you super hyped and amped up? [pjo]",
        "score": 17,
        "url": "https://www.reddit.com/r/camphalfblood/comments/1draxho/what_moment_from_the_books_did_you_read_for_the/",
        "content": "I read TLT as a kid and read through all 5 of them for the first time in the past months. Reading through TTC for the first time, the reveal of Atlas, the final battle on the mountain, and Percy holding the sky were up there for some of the most cinematic moments in the whole series. I literally can’t wait to see it adapted to Disney+ for the first time.",
        "num_comments": 17,
        "comments": [
            "Frank Getting Promoted by Jason and commanding the Roman undead was is the hypest side character moment in hoo. It was genuinely the only time I got excited from any other character besides Percy and Jason",
            "I think the scene that really grabbed me was the St. Louis Arch. Because it's a scene where Percy looses. He's separated from his friends, the monster is too stronger and he's dying of poison. And then he sacrifices himself to save others. I was squeaking while I read that chapter.",
            "Poseidon pulling up w/ the rest of the gods to help jump Typhon & Hades & Nico pulling up w/ their undead army in TLO",
            "When Annabeth drops her knife and Percy arrives",
            "My favorite book is BotL. From that book, the scene when percy explodes the mountain made me giddy. But I also like the scene in TLO when Clarisse is fighting with the blessing of Ares. That scene made me very emotional.",
            "“When pigs fly” is probably my favorite chapter growing up. So hype. \n\nBoTL is my favorite book, but TLO has my favorite scene",
            "Reyna killing Orion and then sacrificing herself for the Pegasi",
            "the ending of tMoA and all of HoH",
            "The sirens scene from TSoM is one of my favorites of the whole series. It just highlights how close they are despite hiw conflicted their relationship was on PJO. At that point, there was nothing romantic going on yet, just two friends who trust each other and care about each other.",
            "In *the Mark of Athena*?"
        ]
    },
    "Where did the budget go? [General]": {
        "title": "Where did the budget go? [General]",
        "score": 23,
        "url": "https://www.reddit.com/r/camphalfblood/comments/1dr99kl/where_did_the_budget_go_general/",
        "content": "I heard a few times in reviews and stuff that the budget for the TV show (120 million) was one of the biggest budgets for an 8 episode series outside of massive long standing shows. \nBut it doesn't really have much in the way of episode scenes, there have been a lot of shows that did much better from an editing/effects stand point then the show did. \nDoes anyone know how thet split up the budget and why there wasn't more 'epic' stuff like there was in the books?",
        "num_comments": 22,
        "comments": [
            "They haven't said how much they spent on what, but the LED volume stage can cost $100k a day just to rent (not including the costs of generating artwork and set dressing), so that's 25% of the budget for each episode already. They built an enormous set and filled it with water for Episode 5's Thrill Ride O'Love, and actually built the big wheel and some of the rollercoaster for Waterland. That can't have come cheap.",
            "I don’t know how much this cost. But they decided to make Grover wear shorts. It looked neat, but I am guessing it also used some of the budget to make his legs.",
            "It's kind of surprising that it was more expensive than Arcane, despite having one episode less.",
            "I'm honestly starting to questioning if you're all talking about the same show I've watched, because it'd be only way your complains would make sense",
            "Yeah I definitely understand some of the other comments explaining where some of the budget would have gone (I.e more shooting days because you're working with kids and locations) but I still found the show to not look great. And I understand cutting some things to reduce budget (ie. hellhound at camp, Argus) but it seemed that many of the actions scenes were so short. And yes they are pretty short in the book, but that's what a visual medium is for, you can expand on things that may be tedious to read in a book. It just seemed like many scenes were cut short like the Fury at the museum and on the bus and one of the worst examples at Waterland when it cuts to black and Annabeth just says \"you just used your powers\", like that would've been nice to see.\n\n I know this show isn't supposed to be prestige TV but I just found that it looked flat and largely filmed in a boring way. But that's a problem with a fair amount of recent shows and movies, especially Disney, big budgets that don't really seem to show on screen.",
            "That is very interesting actually. I don't mean to be critical of the show it was mostly I heard a lot that 120 million for an 8 episode series is a rare thing yet it still seemed kinda average so was unsure",
            "they built an entire ferris wheel but couldnt find locations to film on?",
            "Its just Disney is actually dogshit at using the money wisely.\n\nLike why are they using the extremely expensive volume screen for the Ares fight??? Just go to a beach??? They do this with all their shows. Like they spent 230M+ on Secret Invasion???",
            "That makes a lot of sense, thank you. \nI didn't hate the first series but I felt it has a lot of room to improve and from some of the reviews I watched the budget kept getting  brought up so I was curious. Thank for for explaining :)",
            "Rick wouldn't be responsible for the budge, tough"
        ]
    },
    "Who would you like to be alternative parents for each character [all]?": {
        "title": "Who would you like to be alternative parents for each character [all]?",
        "score": 63,
        "url": "https://www.reddit.com/r/camphalfblood/comments/1dr326y/who_would_you_like_to_be_alternative_parents_for/",
        "content": "I.e. Percy not as a son of Poseidon, Annabeth not as a daughter of Athena, Magnus not as a son of Frey, etc.\n\nFor Egyptians, Carter does not follow the Path of Horus, etc.\n\nMy mega hot take is that I find Percy and Annabeth to be both good as children of Apollo, so no more Percabeth 😈",
        "num_comments": 25,
        "comments": [
            "Percy as son of Neptune and Annabeth as daughter of Minerva would be amazing !",
            "I'd have Luke as a son of Zeus. Have Zeus reap what he sow from his own son. Probably would need so much adjustment to the story to justify it, but it would be fun.",
            "I like Percy as a son of Apollo and Annabeth as a daughter of Aphrodite (she is like so soft in a v loving way inside)",
            "Frank gets what he wants and becomes a son of Apollo\nLeo- Dionysus he’s already a little unhinged at times so I feel like it fits. Also, Dionysus can also have that deep side to him like when he speaks to Percy in his dreams in TLO, so I feel like it’s still kind of hits his character as clown but dead inside.",
            "holy hades i would love to read a fanfic like this",
            "Someone tell me when there is a fic like this😭🙏",
            "Reminds me of a meme template I do not know the name of",
            "Be careful what you wish for. Just look at how different Thalia and Jason are just because of this despite them both sharing the same mom and dad",
            "Minerva doesn't have kids tho",
            "Minerva is a maiden goddess"
        ]
    }
}