{
    "The FAQ thread: Answers to frequently asked questions (FAQ) / Le fil des FAQ : Réponses aux questions fréquemment posées (FAQ) - Jun 24, 2024": {
        "title": "The FAQ thread: Answers to frequently asked questions (FAQ) / Le fil des FAQ : Réponses aux questions fréquemment posées (FAQ) - Jun 24, 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/CanadaPublicServants/comments/1dncww2/the_faq_thread_answers_to_frequently_asked/",
        "content": "Welcome to r/CanadaPublicServants, an unofficial subreddit for current and former employees to discuss **topics related to employment in the Federal Public Service of Canada**. Thanks for being part of our community!\n\nMany questions about employment in the public service are answered in the subreddit Frequently Asked Questions (FAQ) documents (linked below). The mod team recognizes that navigating these topics can be complicated and that the answers written in the FAQs may be incomplete, so **this thread exists as a place to ask those questions and seek alternate answers**. Separate posts seeking information covered by the FAQs will be continue to be removed under [Rule 5](https://www.reddit.com/r/CanadaPublicServants/wiki/rules/#wiki_rule_5_-_faqs). \n\nTo keep the discussion fresh, this post is automatically posted once a week on Mondays. Comments are sorted by \"contest mode\" which hides upvotes and randomizes the order to ensure all top-level questions get equal visibility.\n\n## Links to the FAQs: \n\n* [The **Common Posts FAQ**: /r/CanadaPublicServants Common Questions and Answers](https://www.reddit.com/r/CanadaPublicServants/wiki/commonposts)\n* [The **Frank FAQ**: 10 Things I Wish They'd Told Me Before I Applied For Government Work](https://www.reddit.com/r/CanadaPublicServants/wiki/faq/thefrankfaq)\n* [The **Unhelpful FAQ**: True Answers to Valid Questions](https://www.reddit.com/r/CanadaPublicServants/wiki/faq/trueanswersfaq)\n\n## Other sources of information:\n\n* If your question is **union-related** (interpretation of your collective agreement, grievances, workplace disputes etc), you should contact your union steward or the president of your union's local. To find out who that is, you can ask your coworkers or find a union notice board in your workplace. You can also find information on union stewards via union websites. Three of the larger ones are [PSAC (PM, AS, CR, IS, and EG classifications, among others)](https://psacunion.ca/need-help), [PIPSC (IT, RP, PC, BI, CO, PG, SG-SRE, among others)](https://pipsc.ca/labour-relations/stewards/stewards-list), and [CAPE (EC and TR classifications)](https://www.acep-cape.ca/en/your-local).\n\n* If your question relates to **taxes**, you should contact an accountant.\n\n* If your question relates to a **specific hiring process**, you should contact the person listed on the job ad (the hiring manager or HR contact).\n\n---\n\nBienvenue sur r/CanadaPublicServants! Un subreddit permettant aux fonctionnaires actuels et anciens de discuter de **sujets liés à l'emploi dans la fonction publique fédérale du Canada.**\n\nDe nombreuses questions relatives à l'emploi ont leur réponse dans les Foires aux questions (FAQs) du subreddit (liens ci-dessous). L'équipe de modérateurs reconnaît que la navigation sur ces sujets peut être compliquée et que les réponses écrites dans les FAQ peuvent être incomplètes. C'est pourquoi **ce fil de discussion existe comme un endroit où poser ces questions et obtenir d'autres réponses**. Les soumissions ailleurs cherchant des informations couvertes par la FAQ continueront à être supprimés en vertu de la [Règle 5.](https://www.reddit.com/r/CanadaPublicServants/wiki/regles#wiki_r.E8gle_5_-_faq)\n\nPour que la discussion reste fraîche, cette soumission est automatiquement renouvelée une fois par semaine, chaque lundi. Les commentaires sont triés par \"mode concours\", ce qui masque les votes positifs et rend aléatoire l'ordre des commentaires afin de garantir que toutes les nouvelles questions bénéficient de la même visibilité.\n\n## Liens vers les FAQs:\n\n* [La **FAQ des soumissions fréquentes**: Questions et réponses récurrentes de /r/CanadaPublicServants](https://www.reddit.com/r/CanadaPublicServants/wiki/commonpostsfr)\n\n* [La **FAQ franche** : 10 choses que j'aurais aimé qu'on me dise avant de postuler pour un emploi au gouvernement](https://www.reddit.com/r/CanadaPublicServants/wiki/faq/thefrankfaq) (en anglais seulement)\n\n* [La **Foire aux questions inutiles** : de vraies réponses à des questions valables](https://www.reddit.com/r/CanadaPublicServants/wiki/faq/trueanswersfaq) (en anglais seulement)\n\n## Autres sources d'information:\n\n* Si votre question est en lien avec les **syndicats** (interprétation de votre convention collective, griefs, conflits sur le lieu de travail, etc.), vous devez contacter votre délégué syndical ou le président de votre section locale. Pour savoir de qui il s'agit, vous pouvez demander à vos collègues ou trouver un panneau d'affichage syndical sur votre lieu de travail. Vous pouvez également trouver des informations sur les délégués syndicaux sur les sites Web des syndicats. Trois des plus importants sont [AFPC (classifications PM, AS, CR, IS et EG, entre autres)](https://syndicatafpc.ca/besoin-daide), [IPFPC (IT, RP, PC, BI, CO, PG, SG-SRE, entre autres)](https://pipsc.ca/fr/relations-de-travail/delegues-syndicaux/liste) et [ACEP (classifications EC et TR)](https://www.acep-cape.ca/fr/sections-locales).\n\n* Si votre question concerne les **impôts**, vous devez contacter un comptable.\n\n* Si votre question concerne un **processus de recrutement spécifique**, vous devez contacter la personne mentionnée dans l'offre d'emploi (le responsable du recrutement ou le contact RH).",
        "num_comments": 12,
        "comments": [
            "Are there any gyms available for public servants who work at Place du Portage or 70 Cremazie St in Gatineau? Not asking about the normal private business gyms, but something specifically for public servants?\n\nI know both areas have many public servants so was wondering if there was a \"on-site employee gym\" or exercise area or something similar I could use at no-cost.",
            "Why are people using the term RTO3 instead of RTO2? Shouldn't it be RTO2 instead given that the initial decision was to force us back into the office 2 days a week, and forcing us back into the office 3 days a week was the second decision?",
            "Question for the reliability status screening - I moved provinces a while back and still haven't dealt with my Driver's licence (haven't been driving) I did my health card and changed my address for federal taxes though..\n\nWhat date do I put my most recent address? When I physically moved here or when I changed it for my taxes or healthcard?",
            "My CA says that there was supposed to be an increase to the rate of pay on June 21st, but MyGCPay is still showing the same salary. Is it normal for it to just take a while to update?",
            "Question on pension transfer value \"cash out\". I've searched the threads and seen some reports that leaving the public service and electing to receive the transfer value locks the majority in private annuity but others seem to suggest being able to access the funds immediately. Most seem to suggest a portion is paid cash and the majority is locked in until retirement. For those who did receive the full value in cash, is it a question of penalties versus reinvesting in an annuity? I can't see how they would stop you canceling the annuity once it's outside the PS pension plan.",
            "FSWEP: What I am allowed to put as my area of study on a FSWEP application? If I am in the Biology program and have taken several Social Sciences courses (as electives, not as a minor), can I put Social Sciences as a second area of study?",
            "Your residence address today is where you are living today, regardless of what might be listed on any identification cards.",
            "Yes, it's normal. See here: https://www.reddit.com/r/CanadaPublicServants/comments/1dl7dqp/pm01_wage_adjustment_ca_inquiry/",
            "The applicable legislation requires any funds that are within tax limits to be transferred to a locked-in RRSP or annuity; depending on age and years of service this is normally the majority of the pension value. Any additional amounts that are above tax limits are paid in cash and fully taxable in the year received.\n\n>I can't see how they would stop you canceling the annuity once it's outside the PS pension plan.\n\nThe answer is pretty simple: any transfer of locked-in funds from the pension would go directly to the insurance company selling the annuity. You would not receive the proceeds if the annuity contract is cancelled - they would be returned to the pension administrator.",
            "As long as you're being truthful, you're allowed to put anything you wish in your application."
        ]
    },
    "PM01 wage adjustment & CA inquiry ": {
        "title": "PM01 wage adjustment & CA inquiry ",
        "score": 24,
        "url": "https://i.redd.it/wfs92k056y7d1.jpeg",
        "content": "Happy Friday everyone!\n\nJust have a simple question for yall !\n\nI’m a current PM01 sitting at step 4 since April and the current salary is circled in blue. I logged into my gcpay this morning to see if the wage adjustment Z took effect, but I still found the salary being the same. \n\nIs there something that I could be overlooking, is it too early in the day to check and I’m just getting ahead of myself, should it have been updated by now 💀\n\nAppreciate it!",
        "num_comments": 23,
        "comments": [
            "**Mod note:** Several other users have submitted posts asking the same question (either about the PA or EC agreements, which both had economic increases in the past week), so I am making this post sticky for visibility.",
            "Yes, you're getting ahead of yourself. \n\nYou will see the updated rate of pay on your pay stub starting on July 17th, as that is the first payday that includes June 21st and onward. On that pay stub you will receive the former salary rate for one day (June 20) and your new rate of pay for the remaining days of work in the pay period.\n\nThe information displayed in myGCPay will be updated at some point during the pay period, but that doesn't really matter. What matters is what shows up on your pay stub and in your bank account.",
            "We are paid in arrears, so your pay wouldn’t reflect the rate change until your July pay.",
            "Since we are paid in arrears and this is a new salary the update is inputted a few days later.\n\nOn June 29th PSPC will be adding the new salary line called Permanent Line aupdate (PLU) for approximately \n\n129 120 accounts PA collective agreement\n\n28 289 accounts EC collective agreement \n\n12 760 accounts TC collective agreement \n\n50 accounts PM-MCO subgroup\n\nJuly 2nd there will be rows for EB and FS for 1510 and 2200 accounts respectively.\n\nSide note. If this was an increment you would see it the day of, it has nothing to do with being paid in arrears specifically, it is simply easier to add the row after the date because if put early maybe a HR line reverts to the old salary or causes data integration issues.\n\nYes my response is a bit pedantic, but what you are seeing is normal.",
            "Mass salary revision row should be entered next week with effective date of June 21st,2024\n\nOn your July 17th pay, you will see the rate change. You will get paid 7.5 hours at your old rate and 67.5 at your new rate.\n\nThe July 3rd pay will be more as July is a PP+ month, so to get a full picture of take home pay, July 31st would be ideal.",
            "I'm glad you asked.. I knew it wouldn't show up on the paystub/pay until July due to our pay being in arrears..  but I also wasn't sure when it should be displayed in MyGCPay",
            "This looks like the TBS site. Which section of the MyGCPay?",
            "Why do they bother to add all the extra lines in the grid? Why have the B, C and D lines",
            "How long between each step raise?",
            "I’m pa group and my wage increase isn’t in my gc pay yet. I’m scared. lol"
        ]
    },
    "The only plausible explanation ": {
        "title": "The only plausible explanation ",
        "score": 78,
        "url": "https://i.redd.it/62vkasfr4e9d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "It's funny but you act like they're dumb when really they're just doing what the land baron donors tell them to do.",
            "Apparently executives and FT telework folks are complaining that people are more distracted and harder to reach on their in-office days.\n\nI'm proud to be part of that statistic, with my office-induced headaches and the fact I leave immediately after my hours are done and do not even check my messages afterwards. If this has negatively impacted you: good, that was the goal :)",
            "If you donate blood, you'll have fewer micro plastics in ya.",
            "Rant. \nI feel like I should leave public service and do something less toxic or with higher salary.\nThe salary is like only twice of minimum wage and very recently it used to be 3 times. \nI have a feeling it's just a momentum of old times saying government job is great, it's safe with good pension. It's increasingly becoming obvious that it's not worth it giving up other pursuits. \nIt's like people keep trying to move to UK, Canada etc even though you could have a decent life in countries like India. Ingrained misconceptions or keeping up with the Joneses kind of thinking it seems to me. \nRant over. ",
            "Good rant. I generally encourage people to try things, try government, try private, try contracting, see what’s the best for you."
        ]
    },
    "ESDC Pride Network workshop compromised, what happened?": {
        "title": "ESDC Pride Network workshop compromised, what happened?",
        "score": 162,
        "url": "https://www.reddit.com/r/CanadaPublicServants/comments/1dqqai8/esdc_pride_network_workshop_compromised_what/",
        "content": "Anyone was there? What happened exactly? \nWe just got a message from the DM office, sounds serious. \n\nDeputy Ministers’ Message – A Message for ESDC Employees\n\nDear colleagues,\n\nYesterday afternoon, the Labour Program, in collaboration with the ESDC Employee Pride Network, held a workshop for Pride Season that discussed the importance of allyship. Unfortunately, the event was compromised by deliberate, unauthorized, inappropriate, and derogatory material.\n\nThis occurrence goes against our commitment to fostering a safe and respectful workplace for all. The Beyond Allyship event was intended to be a safe space and we are deeply sorry for any undue stress or harm this may have caused. We were excited to host a workshop that celebrated the perseverance and resilience of the 2SLGBTQIA+ community and we deeply regret that it was marred by this homophobic, transphobic, and racist incident.\n\nIt’s very important that this department offer safe spaces for this community and that its members feel supported by allies they feel comfortable with. Despite the appalling occurrence, it did not deter us from regrouping and proceeding with the workshop.\n\nFor anyone affected or requiring support, we encourage you to seek help through the Employee Assistance Program. Counselling services are available 24 hours a day, 365 days a year.\n\nThank you for navigating through this incident with us and for reaffirming our shared commitment to creating an inclusive and supportive workplace for all. Once again, we sincerely apologize for what transpired.\n\nPlease know that we are taking this very seriously—your safety and privacy are our top priorities. We are actively investigating the breach and hope to have a resolution soon.\n\nAs your Deputy Ministers, we want to make it clear that we unequivocally condemn these harmful behaviours and are committed to ensuring it does not happen again so that we may ensure a safe and respectful workplace for all employees.",
        "num_comments": 161,
        "comments": [
            "I was there.\nWithin the first 5-10 minutes, after introductions were done, someone hacked into the Zoom meeting and pornography was displayed.",
            "Got the email and came here for the same reason lol",
            "Using Zoom is a security risk.  Departments should know that.  [https://jimmillward.medium.com/open-letter-to-us-and-other-universities-in-light-of-zooms-revelations-about-collaborating-with-f54379c9436a](https://jimmillward.medium.com/open-letter-to-us-and-other-universities-in-light-of-zooms-revelations-about-collaborating-with-f54379c9436a)",
            "Remember when zoom meetings were being hacked into by unauthorized parties when WFH first started? This sounds like something similar happened. ",
            "I saw the email but I didn’t even know about that event - don’t think I received an invitation. Must have been pretty bad for them to send an email like that, though…",
            "I was participating in a Superior Court of Justice judicial review (not work related) over zoom when chaos ensued - multiple people yelling and screaming obscenities and a lot of porn clips broadcast from several participants. I think it will take a long time for the justices involved to get over it.",
            "Loooove that they said to go to eap.",
            "I’m curious too!!",
            "Considering Zoom hacking has happened before and was the reason we switched to Teams, why in the HELL was this event held over Zoom????",
            "\"Let's use this completely vulnerable platform.\"\n\n\"Oh our shit got hacked, not our fault.\"\n\nDMs get your heads out of your asses. JFC what a joke."
        ]
    },
    "They should Fix Phoenix dammit": {
        "title": "They should Fix Phoenix dammit",
        "score": 88,
        "url": "https://www.reddit.com/r/CanadaPublicServants/comments/1dqqwsd/they_should_fix_phoenix_dammit/",
        "content": "PSPC and TBS are now pushing for all staffing actions to occur on Thursdays of pay week to accommodate Phoenix. This includes hiring, acting pay, promotions, deployments, transfers, changes in schedule etc..  The whole staffing process has to change because PSPC won't (or can't) fix Phoenix.  Phoenix can't handle retroactivity and because of this it adds work to the Pay Centre.  So change procedures for 365,000 Public Servants instead of Phoenix being fixed.  The madness continues.",
        "num_comments": 44,
        "comments": [
            "There's a new pay system in the works. They're not going to be put much effort into Phoenix, so it'll just be bandage solutions until the new system eventually comes along.",
            "> The madness continues.\n\nIt's [normalization of deviance](https://en.wikipedia.org/wiki/Normalization_of_deviance) all the way down.  Remember, the civil service moved to [payment in arrears](https://www.tpsgc-pwgsc.gc.ca/remuneration-compensation/dr-cd/2014/dr-cd-2014-004-eng.html) in 2014 specifically to avoid the routine need for retroactive pay transactions.\n\nIn so doing, the government gave itself the most time reasonably allowable.  §247 of the Canada Labour Code (in part 3, which doesn't apply to the public service) mandates that federally-regulated employers pay wages within thirty days of their accrual, and a two-week-arrears schedule causes pay to be paid with a fourteen to twenty eight day delay.\n\nWith a built-in delay of fourteen days, there's no reason that any current HR paperwork should be processed retroactively.  To the extent that transactions are not just occasionally retroactive but _normally_ so, the entire edifice is rotten.",
            "Rumour has it NextGen is going to roll out to GSS first to serve as guinea pigs.\nAlso, Thursdays are the 1st day of the pay cycle - things should be simpler that way.",
            "Oh wow! You’ve solved it! Get the Clerk on the phone.",
            "Your biggest mistake is saying \"they should...\"\n\nTake those two words out of your vocabulary working at the GoC. There's a million things they should do but won't ever. And all jokes aside it will be damaging to your mental health to even think about the things they should do. It'll only serve to frustrate you and tank your morale. They know everything you think and are frustrated about.",
            "Is this different from what has been put in place already?  The Phoenix training states to get this kind of stuff done on a pay cycle so it starts when the cycle starts!?",
            "why bother? no one's quitting over it",
            "I'm sure the new solution that PSPC bought will fix everything forever.",
            "Don’t worry Benay is back to fix it!",
            "They are. It's called NextGen HR to pay"
        ]
    }
}