{
    "Weekend Discussion Thread for the Weekend of June 28, 2024": {
        "title": "Weekend Discussion Thread for the Weekend of June 28, 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/1dqsrax/weekend_discussion_thread_for_the_weekend_of_june/",
        "content": "Your Weekend investment discussion thread.\n\nWant more? Join our new [Discord Chat](https://discord.gg/4Q6mzTWz3D)",
        "num_comments": 1,
        "comments": [
            "Posted this in last weekend's thread, and got downvoted into oblivion. Probably more of the same this week.\n\n*Pretty pumped for the coming months. My portfolio consists of two stocks ,99% in one name which is up 280.59% YTD (6 figure gains) and 1% in another name which is flat since I started to build a position. The Canadian Exchange selloffs (due to the new capital gains inclusion rates) should be coming to an end. Very exciting to see where all that money that is sitting on the sidelines gets redeployed by institutional investors*.\n\nBeauty week overall as I felt it would be. My biggest position is now up 319.05% YTD. My small position agreed just this week to a definitive deal to sell the majority of the business, and payout a special dividend (approximate 100% gain since I started accumulating in March). My only disappointment is not having more time to continue to DCA into the small position."
        ]
    },
    "Rate My Portfolio Megathread for June 2024": {
        "title": "Rate My Portfolio Megathread for June 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/1d5jmvm/rate_my_portfolio_megathread_for_june_2024/",
        "content": "Welcome to this month's Rate My Portfolio megathread. Here, others can chime in on your portfolio with their thoughts, keeping the rest of the subreddit clean, and giving you the ~~confirmation bias~~ sanity check you need!\n\nTop level comments should aim to be highly detailed (2-3 paragraphs). Consider including the following:\n\n* Financial goals and investment time horizon.\n\n* Commentary on the reasoning behind your current and desired allocation.\n\nThe more information you can provide, the better answers you'll get!\n\nTop level comments not including this information may be automatically removed. If your comment was erroneously removed, please [message modmail here](https://old.reddit.com/message/compose/?to=/r/CanadianInvestor).\n\n---\n\nPlease don't downvote posts you disagree with. If a comment adds to the discussion, it warrants an upvote.",
        "num_comments": 28,
        "comments": [
            "XEQT - 59.49%  \nVFV   - 35.32%  \nTEC   - 5.19%",
            "Still 100% BN\n\n\nI still DGAF about the concentration risk, I've been eating good these past 12 months 😎😎😎",
            "Young professional in early 30s, started investing for retirement about a year ago in TFSA. Investment horizon of 30+ years\n\n  \nCurrent desired allocation is 80/20 with the following equity breakdown:\n\n40% in Canadian stocks XIC  \n37.5% in US stocks XUU  \n15.25% in Int. developed markets XEF  \n7.25% in Int. emerging markets XEC\n\nI recognize that 40% in Canadian markets represents a high home country bias, but I wanted to keep the largest portion of my equity allocation in Canada for psychological reasons. I think it would feel bad if I had more invested in the US than in Canada, and if Canada were to outperform the US, since it would feel like I'd be paying more (in MER and taxes) for a lesser-performing ETF. I hope that makes sense.\n\nAs for the rest, I went with a rough market cap allocation for US (37.5% out of the 60% in ex-Canada equity) and divided between international developed and emerging markets in a 2:1 ratio.\n\nIn addition, I arrived at the same allocation a second way. I began with a roughly equal 35/35/30 split between Canada / US / international, then decided to give a little more to Canada and a little less to international because it's cheaper and there's no currency risk, so I tweaked it to 40/35/25. Finally, I gave a little more to US from the international portion, resulting in the final numbers of 40/37.5/22.5.\n\n  \nMy main question is that from what I've read about home country bias, the difference between 40% and 30% in Canada is not that significant. I would love to hear someone chip in on this. I have also played around with the idea of a 35% allocation to Canada, which would give me about 40% US and 25% international.",
            "79% XEQT \n\n9% VFV\n\n6% HBNK\n\n6% CP/CNR",
            "AAPL  51%\n\nGOOG  14%\n\nMSFT     7%\n\nTSLA      2%\n\nCMR.T0  26%",
            "Hi everyone, would love all thoughts and comments on my TFSA holdings: \n\n- CCL - 4.36%\n- CLS - 16.19%\n- DIS - 3.98%\n- PNG - 11.35%\n- VE - 18.73% \n- VFV - 45.55%",
            "* VTI - 35%\n* VIGAX - 10%\n* INDA - 10%\n* [VDY.TO](http://VDY.TO) - 10%\n* SCHD - 7.5%\n* AAPL - 7.5%\n* TSLA - 7.5%\n* [XRE.TO](http://XRE.TO) - 5%\n* V - 5%\n* META - 2.5%\n\n  \nVIGAX and INDA cannot be touched for now since they are in my retirement accounts in India and USA during my working time over there. Given a choice I would take that 20% and put into VTI/VDY/SCHD in a 10/5/5 ratio.",
            "RRSP -->\n\n30% VTI (Mainly Large Cap USA)\n\n20% SCHD (Large Cap Dividend USA)\n\n15% AVUV (Small Cap USA)\n\n20% EWC (Canada)\n\n15% VXUS (International)\n\n  \nNot entirely sure what I'm doing, 40yo, ditched my investment guy that was charging too much.. guessed with these %'s to try and have some diversity.. appreciate any input",
            "GBAL 65%\n\nHURA 5%\n\n[CASH.TO](http://CASH.TO) 30%",
            "Well $avcr started to break out today… it’s ok to mix in some penny stocks with your portfolio (ie 3-10%) especially if you’ve done your DD. Avcr is profitable now and PE 22 last Q and dropping."
        ]
    },
    "Wealthsimple is killing it as a company, but the performance of its robo-adviser portfolios does not impress": {
        "title": "Wealthsimple is killing it as a company, but the performance of its robo-adviser portfolios does not impress",
        "score": 67,
        "url": "https://archive.ph/jxC8v",
        "content": "",
        "num_comments": 34,
        "comments": [
            "As the article states there just isn’t enough long term performance data to go off of, but WS definitely trades some returns for lower volatility overall.\n\nI’m generally happy with how my WS growth portfolio performed over the past few years, but as the article states, VGRO returned higher over the same period.",
            "There was a recent episode on rationale reminder podcast about this. Good listen. Overall,WS  roboadvisor has continuously underperformed when compared to other funds when you take into account the available data.",
            "My RESP is up ~19% in the past 18 months with an 8 risk setting. I'll take it. My RRSP where I just have xeqt on auto is up ~23% by comparison. ",
            "Sadly you can't self direct in there RESP. Unless you can and I'm just missing it?",
            "What did you expect? You want to outperform the market you need the brain power.  Brain power costs money.  Think WS has the top PM’s in the field?",
            "Copying [a comment I posted in a different sub yesterday](https://www.reddit.com/r/PersonalFinanceCanada/comments/1dpcvlh/comment/lamozv2/):\n\n\nWS argues that their lagging performance through the current bull run will even out in a downturn, with their managed portfolios being insulated from some of the downside. Maybe.\n\n\n**I've been using the robo advisors from Wealthsimple, Modern Advisor, Questrade, and CI Direct (formerly Wealth Bar) for about 5-6 years and can say that they've all performed pretty similarly. Each has pulled ahead and lagged behind the pack at different times, though Questrade seems to lead more often than not.**\n\n\nWS Managed was negatively affected as interest rates increased (due to their bond choice), but they regained some ground by betting on gold ahead of the gold rush of the past ~18 months.\n\n\nIt's important to note that WS charges a management fee (up to 0.5%), as well as a 0.4% FX fee (on top of the \"corporate exchange rate\", which already includes a spread). On the flipside, they have negotiated MER rebates with some ETF providers, and they pass some of that rebate on to customers.\n\n\nI am somewhat disappointed with their use of so many USD funds, which means you are being hit by the FX fees in both directions (buy/sell). They have told me that they use the account's KYC/time horizon/goals to choose between CAD and USD denominated funds; for long time horizons, they use the USD funds because the MER is lower and RRSPs get a slight dividend tax advantage. The downside of that is if you change your risk level, time horizon, or withdraw funds, your money may not have been in the USD fund long enough to realize those benefits (vs the FX fees).\n\n\nFees: https://www.wealthsimple.com/en-ca/legal/fees/invest",
            "Their robo blows. They need a better product offering.",
            "Honestly me fucking around in an account got me 13% return ytd while wealthsimple growth portfolio with Max risk was at ~6%. I compared it to all the standard recommended etfs and VFV, XEQT, and similar were all at >10% ytd. \n\nSo I withdrew all my money from their managed accounts and I'll do it myself. I'd recommend others do that too.",
            "It's underperforming VGRO ?  eesh....  and people pay for this ?",
            "> As the article states there just isn’t enough long term performance data to go off of\n\nAgreed, but would also add that long term performance data isn't very relevant here, as all the funds mentioned have different asset allocations. The [longest term data](https://www.credit-suisse.com/about-us-news/en/articles/media-releases/credit-suisse-global-investment-returns-yearbook-2023-202302.html#:~:text=Since%201900%2C%20Australia%20has%20been%20the%20best%20performing%20stock%20market%20in%20real%20USD%20terms%20with%20an%20annualized%20real%20return%20of%206.43%25) we have (going all the way back to 1900) shows that *Australia* has been the best performing stock market. Does that mean we should disproportionately invest in Australian stocks (rhetorical question)? Investors shouldn't be making asset allocation decisions based on historical returns. The important thing is to know what you're buying and how it compares to your desired asset allocation, not \"long term\" data.\n\n> WS definitely trades some returns for lower volatility overall.\n\nidk tbh, to me WS seems like a mixed bag in that regard. Having a relatively more equal allocation between North American and International stocks, for example, does sound like it could reduce volatility. On the other hand, as the article states, \"it held large positions in an ETF that invested in long-term bonds\", and long-term bonds are notoriously more volatile than short-term bonds. WS also invests disproportionately in emerging market stocks, which are more volatile than their developed market counterparts.\n\n> I’m generally happy with how my WS growth portfolio performed over the past few years, but as the article states, VGRO returned higher over the same period.\n\nThat's really all that matters: \"the best investment strategy is the one you'll stick with\", as a wise person once said. And it's hardly surprising that VGRO returned higher over the past 5 years, since US stocks outperformed International stocks, and short-term bonds outperformed long-term bonds. It would be more surprising if VGRO *didn't* outperform over that period."
        ]
    },
    "Stupid question time": {
        "title": "Stupid question time",
        "score": 5,
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/1dqq39l/stupid_question_time/",
        "content": "So I finally have a little extra money kicking around and I'm going to try and be smarter about it. As of right now I'm planning on putting what used to be my car payment into a tfsa account each month, and using that to invest in different things. Probably a majority is something like vfv but I still have more research to do on that first. \n\nThis seems to be the generally accepted advice so I don't see how it's completely stupid but please let me know if that's wrong.\n\nMy main concerns are as such. Do I use my bank (cibc) or something like wealthsimple?\n\nTfsa contribution limits? IV read that unused contributions roll over to the next year, is this only from when you open the account? Or is it since you turned 18. How do you keep track anyway? I'm also assuming the per year contribution limit is based on a fiscal year not a calendar year correct? \n\nLastly apparently there's a 15% tax on us dividends. Does that apply to stocks as well? Is this \"withholding\" like what I'm used to on my paycheck where it comes out automatically? Basically, how is this going to work for me come tax time.\n\nAnything you all think I missed? Am I a moron? Please help.",
        "num_comments": 41,
        "comments": [
            "Great that you are getting started !\n\n>This seems to be the generally accepted advice so I don't see how it's completely stupid but please let me know if that's wrong.\n\nMany factors here  and you are going to get many opinions...  But VFV is a great place to get started !  esp. if you have a longer timeline.  \n\n\n>My main concerns are as such. Do I use my bank (cibc) or something like wealthsimple?\n\nI wouldn't suggest your Bank   \n\nMy Pref. would be \n\n1) NBDB (National Bank Direct Brokerage)\n\n2) QuestTrade\n\n3) WealthSimple\n\n>Tfsa contribution limits? IV read that unused contributions roll over to the next year, is this only from when you open the account? Or is it since you turned 18. How do you keep track anyway? I'm also assuming the per year contribution limit is based on a fiscal year not a calendar year correct?\n\nSince you turned 18.\n\n>Lastly apparently there's a 15% tax on us dividends. Does that apply to stocks as well? Is this \"withholding\" like what I'm used to on my paycheck where it comes out automatically? Basically, how is this going to work for me come tax time.\n\nYes It will come off automatically, and applies to stocks as well.   If this were in your RRSP, you could buy VOO instead of VFV and avoid the withholding tax.",
            "I used to use a bank for my investments but I’m a huge fan of Wealthsimple now. I don’t do any options trading so it fits exactly what I need for my TFSA and high interest savings accounts",
            "You're not a moron for asking questions, but I am a bit surprised when people like you don't just google things like \"tfsa rules\" and get the answers instantly. The very first search result returns Canada's guide for individuals about the TFSA: https://www.canada.ca/en/revenue-agency/services/forms-publications/publications/rc4466/tax-free-savings-account-tfsa-guide-individuals.html Your question about contribution room is answered on that link, in, appropriately enough, the heading titled \"TFSA contribution room\": https://www.canada.ca/en/revenue-agency/services/forms-publications/publications/rc4466/tax-free-savings-account-tfsa-guide-individuals.html#P44_1115\n\nThere's also a ton of answers regarding your questions about the 15% withholding tax, whether you search google or on this subreddit.\n\nAs for CIBC vs. Wealthsimple, the question is largely one of commissions and convenience. CIBC's Investors Edge platform is convenient in terms of transferring money to and from your CIBC chequing account, but costs more in commissions ($6.95 each transaction vs. $0 for WS).",
            "For cibc your first year is free then you pay like 100 a year and it's 6 bucks per trade unless you have a certain ammountbof money. I switched to Wealthsimple a few months ago and haven't paid a penny.",
            "Hey! Quick question! Does your employer offer any sort of pension match? If you put in a % of your income do they match? If so this should be your saving priority unless you need to save for the next few years. Focus on an emergency fund of 6 months expenses before really getting into the investing big time. But definitely start dollar coat averaging into vfv through your tfsa. ",
            "I haven’t seen anyone else mention this so I’ll add it : every time you file your taxes, your notice of assessment will include your TFSA contribution room for next year, as well as all acccumulated room from previous years.",
            "You’re not a moron. Just read up on it, there’s lots of good and easy to find resources out there (beyond Reddit) \n\nUsing CIBC or Wealthsimple or another broker/platform is a personal choice. Wealthsimple is popular bc there’s no commission fee, trades are free. Whereas most banks will charge you an extra $5-10 per trade in commission fees. \n\nTFSA contribution room starts accumulating the year you turned 18 (unless you were 18+ in 2009 then it starts from 2009). The allowable amount for each year varies. Once you open your first TFSA, you should track your contributions from your bank statements for the account. Also, the broker (CIBC or Wealthsimple) will report your contributions to CRA once a year and you can see that in your “my CRA account” (but that wont be up-to-date since they only report once a year). \n\nIn a TFSA if you hold foreign stocks you’ll be taxed 15-30% on dividends only. Not on the stock price gains and not when you sell a stock. Dividends from US companies have a 15% withholding tax (e.g. if the dividend is USD$1 per share then you will receive USD$0.85 per share). Dividends from companies other countries may have a different rate. Yes, withholding means they’ve already deducted the tax before the dividends are deposited into your account. \n\nYou could answer all of those questions with any one or two of these sites, if you have more questions I’d suggest starting there (or start with your own bank’s website): \n\nhttps://www.canada.ca/en/revenue-agency/services/tax/individuals/topics/tax-free-savings-account/contributions.html#toc1 \n\nhttps://www.wealthsimple.com/en-ca/learn/what-is-tfsa \n\nhttps://www.questrade.com/learning/investment-concepts/rrsps-101/tfsa-or-rrsp-what's-the-right-way-for-you-to-save\n\nhttps://help.wealthsimple.com/hc/en-ca/articles/360056584994-Non-resident-withholding-taxes-and-how-to-minimize-them\n\nhttps://ca.rbcwealthmanagement.com/documents/1647873/0/Tax+Implications+of+Investing+in+the+United+States.pdf\n\nEdit: typos",
            "Use wealthsimple, banks charge per trade/sell + quarterly account fees, wealthsimple does not. TFSA contribution room starts from the year you turn 18 and a new allotment is given each calendar year. Any gains are tax free and add to contribution room even if you sell and withdrawal. Any realized losses reduce your contribution room.",
            "> Since you turned 18.\n\nOr since the program launched, whichever is later.",
            "Why do you prefer NBDB and QuestTrade over WealthSimple?"
        ]
    },
    "Advice for a 19 y/o new into investing?": {
        "title": "Advice for a 19 y/o new into investing?",
        "score": 4,
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/1dqlzw4/advice_for_a_19_yo_new_into_investing/",
        "content": "Hey everyone, I made a post a while ago when I was 18. I just turned 19 and I’ve already opened a TFSA on Wealthsimple. Any tips?\n\nI have really surface-level knowledge so far, I know of XEQT, VEQT and VFV but that’s about it. Thanks!",
        "num_comments": 40,
        "comments": [
            "Hey! My advice is only invest what you are sure you wont need for a long period of time. The key is letting the growth compound for the long term and contribute regularly. I only buy VFV and XEQT now. I hold my emergency fund in CASH.TO. Dollar cost average your buying. Set something like $50 recurring biweekly and plan to never touch it. \n\nLearn to create a budget. Write down all recurring monthly expenses (rent, phone, spotify, netflix etc) and your spending (food, entertainment, travel etc) and know how much you spend a month. Then look at your after tax income. Try to keep a 10% buffer for investing. Work to increase income over the long term without making massive changes to your lifestyle. Good luck! ",
            "My only tip outside of r/justbuyxeqt is to create a detailed spreadsheet to track your TFSA contributions and withdrawals. Keep it updated as you invest.",
            "Buy low sell high",
            "https://www.freedomthirtyfiveblog.com/2015/07/best-investment-vehicles-different-investments.html",
            "Take 500$ and buy a risky stock.  \nNever sell it. watch it go up and down. For 1 Year. than do whatever you please with it.  \nWhy?  \nUse this stock to train yourself to detach yourself emotionally with your money. Do not invest with emotion. the market is a roller coaster of up and down. 500$ is a cheap lesson to train yourself with. Meanwhile continue to do your research on investing. Knowledge and Lack of Emotion is key.",
            "ETFs are definitely where you want to park the vast majority of your money but at 19yo you have a lot of wiggle room if you did want to try riskier plays (aka if you lose a ton of money on risky plays you have lots of recovery time before retirement).\n\nI'm 31 and have about 95% of my TFSA in ETFs and 5% in risky plays",
            "I would recommend opening a Questrade tfsa and just invest in VFV.TO. Or XEQT. Both are great. The reason for the Questrade tfsa. Is because there is no fees to PURCHASE etf’s. So you can set a reoccurring purchase and not have to worry about fees for small purchases. VFV follows the S&P500. And in the long term, looking at history. no one out trades the S&P500. In 10 years time. You will be ahead of anyone day trading, swing trading, options. Etc. just my 2 cents. And this is what I’ve discovered through my years of investing.",
            "NVDA leaps. Yw",
            "Good for you. I wish my 19yr old self did what you are doing.  Except there was no internet and no one talked about investing.\n\nSome great advice already. Here's my 2 cents\n\n- auto deposit to your TFSA monthly. Don't look at your statement. Invest & forget. Look at it in 10 years.\nBroad market low cost index funds is the way to go.\n\nDon't use TFSA as a savings account where you take money in and out.use EQ Bank or tangerine for that.\nUse TFSA as long term retirement account.\nIf you invest monthly starting at 19, you will retire at 50 easy but be disciplined!\n\nYou are on the right track, don't over analyze, just do it.\n\nGood luck",
            "If I could give you one simple piece of advice:\n\nIt's your time in the market. Not timing the market. Compounding is a young person's best tool.\n\nYou're young, contribute a portion, no matter how humble, on a regular basis until you retire! You can start with ETFs like others have mentioned, and allocate a smaller portion to individual stocks once you get more experience."
        ]
    }
}