{
    "Weekend Discussion Thread for the Weekend of June 28, 2024": {
        "title": "Weekend Discussion Thread for the Weekend of June 28, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/1dqsrax/weekend_discussion_thread_for_the_weekend_of_june/",
        "content": "Your Weekend investment discussion thread.\n\nWant more? Join our new [Discord Chat](https://discord.gg/4Q6mzTWz3D)",
        "num_comments": 4,
        "comments": [
            "You show up to brag about your gains in what’s probably a penny stock or junior miner that you’re not willing to name. What exactly are you expecting?  People to come and congratulate you on your investing prowess?  Ask you where you get your mad skillz from? Of course you’re getting downvoted",
            "Congratulations on your investing prowess. We’re all really really proud of you",
            "Posted this in last weekend's thread, and got downvoted into oblivion. Probably more of the same this week.\n\n*Pretty pumped for the coming months. My portfolio consists of two stocks ,99% in one name which is up 280.59% YTD (6 figure gains) and 1% in another name which is flat since I started to build a position. The Canadian Exchange selloffs (due to the new capital gains inclusion rates) should be coming to an end. Very exciting to see where all that money that is sitting on the sidelines gets redeployed by institutional investors*.\n\nBeauty week overall as I felt it would be. My biggest position is now up 319.05% YTD. My small position agreed just this week to a definitive deal to sell the majority of the business, and payout a special dividend (approximate 100% gain since I started accumulating in March). My only disappointment is not having more time to continue to DCA into the small position.",
            "Not sure how a factual post regarding my investment style (without shilling names) can be seen as a brag. In fact, I posted my disappointment in a deal having happened sooner than I would have liked. If I had \"mad skillz\" I would have seen the deal coming, and fully leveraged into the position, sadly I did not.\n\nI've read posts from here for quite some time now, and the vast majority are about ETF couch potato methods, with a smaller portion on large cap well known names where price discovery can be a bit more difficult. Very few are all that helpful (it's more of a buy xyz, trust me bro).\n\nWhat if I told you before I invest in a stock that I spend between 10 - 100 hours reading SEDAR documents, financial statements, and forums trying to better understand the company, and the merits of the potential investment?\n\nI'm not here to say one way is better than the other, to each their own, but do I deserve downvotes for simply wanting to participate in market discussion, while discussing my contrarian methods?"
        ]
    },
    "Rate My Portfolio Megathread for June 2024": {
        "title": "Rate My Portfolio Megathread for June 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/1d5jmvm/rate_my_portfolio_megathread_for_june_2024/",
        "content": "Welcome to this month's Rate My Portfolio megathread. Here, others can chime in on your portfolio with their thoughts, keeping the rest of the subreddit clean, and giving you the ~~confirmation bias~~ sanity check you need!\n\nTop level comments should aim to be highly detailed (2-3 paragraphs). Consider including the following:\n\n* Financial goals and investment time horizon.\n\n* Commentary on the reasoning behind your current and desired allocation.\n\nThe more information you can provide, the better answers you'll get!\n\nTop level comments not including this information may be automatically removed. If your comment was erroneously removed, please [message modmail here](https://old.reddit.com/message/compose/?to=/r/CanadianInvestor).\n\n---\n\nPlease don't downvote posts you disagree with. If a comment adds to the discussion, it warrants an upvote.",
        "num_comments": 28,
        "comments": [
            "XEQT - 59.49%  \nVFV   - 35.32%  \nTEC   - 5.19%",
            "Well $avcr started to break out today… it’s ok to mix in some penny stocks with your portfolio (ie 3-10%) especially if you’ve done your DD. Avcr is profitable now and PE 22 last Q and dropping.",
            "When will you diversify to lock in gains?",
            "How did you come up with these percentages? I'm super curious to know your thought process",
            "Don't buy EWC. You're needlessly paying a very high MER to own Canada. Use XIC or VCN.",
            "I've been going fully ZAG for my bond portion",
            "Roughly 45% USA, 30% CDN & 25% International.\nThis works out to less MER then 100% xeqt (small amount) but also is very Diversified. Basically the Canadian and Sp500 balance out to be similar to XEQT. My VFV is long term in RRSP and HBNK is Non registered (I use the Dividend as income)",
            "hmm ya looking at XEQT now, maybe better off just simplifying and going 100% XEQT?",
            "Still 100% BN\n\n\nI still DGAF about the concentration risk, I've been eating good these past 12 months 😎😎😎",
            "Young professional in early 30s, started investing for retirement about a year ago in TFSA. Investment horizon of 30+ years\n\n  \nCurrent desired allocation is 80/20 with the following equity breakdown:\n\n40% in Canadian stocks XIC  \n37.5% in US stocks XUU  \n15.25% in Int. developed markets XEF  \n7.25% in Int. emerging markets XEC\n\nI recognize that 40% in Canadian markets represents a high home country bias, but I wanted to keep the largest portion of my equity allocation in Canada for psychological reasons. I think it would feel bad if I had more invested in the US than in Canada, and if Canada were to outperform the US, since it would feel like I'd be paying more (in MER and taxes) for a lesser-performing ETF. I hope that makes sense.\n\nAs for the rest, I went with a rough market cap allocation for US (37.5% out of the 60% in ex-Canada equity) and divided between international developed and emerging markets in a 2:1 ratio.\n\nIn addition, I arrived at the same allocation a second way. I began with a roughly equal 35/35/30 split between Canada / US / international, then decided to give a little more to Canada and a little less to international because it's cheaper and there's no currency risk, so I tweaked it to 40/35/25. Finally, I gave a little more to US from the international portion, resulting in the final numbers of 40/37.5/22.5.\n\n  \nMy main question is that from what I've read about home country bias, the difference between 40% and 30% in Canada is not that significant. I would love to hear someone chip in on this. I have also played around with the idea of a 35% allocation to Canada, which would give me about 40% US and 25% international."
        ]
    },
    "Wealthsimple is killing it as a company, but the performance of its robo-adviser portfolios does not impress": {
        "title": "Wealthsimple is killing it as a company, but the performance of its robo-adviser portfolios does not impress",
        "score": 103,
        "url": "https://archive.ph/jxC8v",
        "content": "",
        "num_comments": 50,
        "comments": [
            "As the article states there just isn’t enough long term performance data to go off of, but WS definitely trades some returns for lower volatility overall.\n\nI’m generally happy with how my WS growth portfolio performed over the past few years, but as the article states, VGRO returned higher over the same period.",
            "There was a recent episode on rationale reminder podcast about this. Good listen. Overall,WS  roboadvisor has continuously underperformed when compared to other funds when you take into account the available data.",
            "Aren't ETFs like VGRO, that rebalance the underlying ETFs, functionally the same as robo-advisor.\n\nBasically robo advisors were needed before because products like VGRO didn't exist yet.",
            "Most of the nearly 1.5M users on the PFC sub and just about all of the 500k users on this sub probably won’t benefit from using robo advisors.\n\nThen there’s the rest of Canada, whose alternatives include Edward Jones and Investors Group, or just leaving it in their savings account, because they’re intimidated by or just not interested in DIY investing.",
            "My RESP is up ~19% in the past 18 months with an 8 risk setting. I'll take it. My RRSP where I just have xeqt on auto is up ~23% by comparison. ",
            "I got their Robo adviser and started investing in 2020. With risk level 9 I am currently 18.20% up.",
            "Sadly you can't self direct in there RESP. Unless you can and I'm just missing it?",
            "I would like a self managed RESP",
            "I am slowly switching over to fully self-managed accounts. Their managed accounts were a great way to get started when I didn’t know what I was doing. Really good for getting people in the door and helping them learn, but I’ve graduated haha",
            "Their robo blows. They need a better product offering."
        ]
    },
    "My WS Robo TSFA Investments are up 15%. Should I take it out and do it myself?": {
        "title": "My WS Robo TSFA Investments are up 15%. Should I take it out and do it myself?",
        "score": 0,
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/1drb705/my_ws_robo_tsfa_investments_are_up_15_should_i/",
        "content": "With risk level 6 I am currently **15.5%** up for all time and I have about **$20k** on it currently. My time horizon was easily 20+ years, and since I started this in 2019, its only been 5 years so far. \n\n*I'm wondering if its a good idea to take out the money and transfer it to a self directed TFSA, to just shove it all in VGRO and continue the auto deposits? Or should I just bump up my risk tolerance?* \n\nI'm not sure if its too late to change but I've learned more about the fees and how much of a difference the make in the long term, not to mention how the following tickers have performed in the last 5 years:\n\n* VGRO: (35.82%) past 5 years\n* XGRO: (37.65%) past 5 years\n* XEQT: (53.51%) past 5 years\n* VFV: (94.11%) past 5 years\n\nI was very, very new to investments back in 2019 and was not at all confident in doing my own investments. I didn't have a decent job to turn on auto deposits either but things have long changed and I'm having a hard time deciding on how to move forward. \n\nAbsolutely any advice would be appreciated. \n\nCheers!",
        "num_comments": 4,
        "comments": [
            "There was an article in the Globe this week about Wealthsimples roboadvisor consistently underperforming other all-in-one ETFs that are available for the same risk level. The added fees just don't seem to be worth it if your risk profile matches the asset mix available in VEQT/VBAL/etc.",
            "Yeah, it's hard to make the argument for robo-advisors since Vanguard introduced the asset allocation ETFs in early 2018. I think there's still a place for them amongst people that really don't want to open a self-directed brokerage account, people that have gambling tendencies, etc.",
            ">Yes, the asset allocation ETFs like VGRO are extremely well designed and they're lower cost than Wealthsimple's managed investing service. It's a great idea if you pick the correct asset allocation ETF, dump all of your money into it, and stay disciplined. You can even automate this at Wealthsimple using their recurring investments feature.\n\nThanks! Discipline isn't an issue for me, I can be patient when it comes to long term investing. I already do reoccurring investments on other things, so switching will be easy. Just have to figure out the process on WS before I make my move on Tuesday.\n\n> You shouldn't draw any conclusions about future performance by looking backwards just 5 years. You're also only quoting the price return of those funds which completely ignores distributions (XGRO is up 53.55% over the past 5 years).\n\nYou're right, didn't account for distributions.",
            "> I'm wondering if its a good idea to take out the money and transfer it to a self directed TFSA, to just shove it all in VGRO and continue the auto deposits? Or should I just bump up my risk tolerance?\n\nYes, the asset allocation ETFs like VGRO are extremely well designed  and they're lower cost than Wealthsimple's managed investing service. It's a great idea if you pick the correct asset allocation ETF, dump all of your money into it, and stay disciplined. You can even automate this at Wealthsimple using their [recurring investments feature](https://help.wealthsimple.com/hc/en-ca/articles/9544942923547-Set-up-a-recurring-investment).\n\n> I'm not sure if its too late to change but I've learned more about the fees and how much of a difference the make in the long term, not to mention how the following tickers have performed in the last 5 years:\n\nYou shouldn't draw any conclusions about future performance by looking backwards just 5 years. You're also only quoting the price return of those funds which completely ignores distributions (XGRO is up 53.55% over the past 5 years)."
        ]
    },
    "Help me calculate if it’s better to buy USD or CAD ETFs.": {
        "title": "Help me calculate if it’s better to buy USD or CAD ETFs.",
        "score": 0,
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/1drac4h/help_me_calculate_if_its_better_to_buy_usd_or_cad/",
        "content": "As an example, let’s take similar ETFs from Vanguard - VOO (USD) and VFV (CAD). Both track the S&P 500.\n\nVOO has an expense ratio of 0.03%, while VFV’s is 0.09%.\n\nNow I use wealthsimple so there will be a 1.5% conversion fee while buying and selling.\n\nHow many years will it take for the lower expense ratio to break even the currency conversion fee?\n\nAlso, any tax advantages if i hold one or the other in an RRSP or TFSA?\n\nAbout Norbert’s Gambit: I believe the brokers that allow this (like questrade) charge fees while buying and selling etfs so that don’t seem much better. I’ve also heard that they don’t allow using their platforms ONLY for Norbert’s Gambit.",
        "num_comments": 5,
        "comments": [
            "> Now I use wealthsimple so there will be a 1.5% conversion fee while buying and selling.\n\nThere is no scenario where *anyone* should convert currency at such a high rate when it's possible to convert at rates between 0.002% and 0.03% depending on the amount converted at Interactive Brokers.\n\n> Also, any tax advantages if i hold one or the other in an RRSP or TFSA?\n\nIn an RRSP (or other retirement accounts like LIRA, RRIF, etc.) VOO will avoid the US foreign withholding tax whereas VFV will not. The amount this saves you will be 15% of the dividend yield. With VOO's current yield of about 1.3%, this is roughly 20 basis points (0.2%) of guaranteed tax savings.",
            "The cost to convert currency outweighs the MER savings and the foreign witholding tax on dividends. Stick with VFV. \n\nRegarding the tax - 15% tax is withheld on dividends in any account other than an RRSP. This can only be avoided if you purchase the US listed ETF (VOO) in an RRSP. \n\nDon't let this drive your decision on whether to save in an RRSP or TFSA though. That decision should be based on your specific financial situation. How much money you make now vs expected income in retirement, etc.",
            "Don't use wealthsimple for US equities. Wealthsimple won't let you do Norbert's Gambit. Use a better brokerage if that's your use case, like IBKR.\n\n1.5% forex fees are insane and nobody should be paying that much. If you have to pay 10$ per transaction, you're still better off than paying that 1.5%.\n\n>I’ve also heard that they don’t allow using their platforms ONLY for Norbert’s Gambit.\n\nWhere are you getting this information from? Its beyond wrong :)"
        ]
    }
}