{
    "Maxime Bernier tells the PEI protest organizer, \"When your work permit is expired, you must be deported...We don't need you here in this country, young Canadians can work at Tim Hortons.\"": {
        "title": "Maxime Bernier tells the PEI protest organizer, \"When your work permit is expired, you must be deported...We don't need you here in this country, young Canadians can work at Tim Hortons.\"",
        "score": 598,
        "url": "https://v.redd.it/jalho8yqag9d1",
        "content": "",
        "num_comments": 116,
        "comments": [
            "Great job Maxime , at least he has the balls to go and talk to them face to face. \nTemporary workers demanding extension and PR ! \nThey applied for temporary status ! “Temporary”",
            "You cannot reason out to these people because they love not to follow rules. Wtf do they want? Special treatment?",
            "My god why is anyone appeasing this entitlement. Great on Maxine. We’ve been harassed and scammed over the phones for years, done without conscience. Now they’re here on our soil trying to pull scams.",
            "I'd vote for this guy.",
            "Hahaha, I love it. Nice to see a politician with a backbone.",
            "This dude trying to turn it on Bernier like he isn't trying to say if the government doesn't extend their permits they're gonna stay here illegally.",
            "The protestors will illegally try to stay or go to US if there is no extensions. The government must make sure theyre in the airport and on the plane to india",
            "[removed]",
            "His sense of entitlement , arrogant  ,demeanor! Yes ! Can you kindly pack your bags , go home , send a message to you're brothers in alberta , time to go home . I have a daughter,  18 as of now , can not get hired anywhere , its bad in wetaskiwin alberta , its impossible to get a job on our reservation.  Not all firstnation s people want to be on welfare,  but what do we do when , visitors get priority  ? Not a racist,  but damn , we want to work .so please , go home  . In return , we will never set foot in you're country of origin,  take your jobs , demand more from you're government,  stage protests of entitlement,  I'm damn sure we will survive when you're gone .",
            "SO FVCKING ZASED"
        ]
    },
    "Number of Indian students seeking Canadian visa drops due to restrictions": {
        "title": "Number of Indian students seeking Canadian visa drops due to restrictions",
        "score": 1226,
        "url": "https://www.indiatoday.in/india/story/number-of-indian-students-seeking-canadian-visa-drops-due-to-restrictions-2558127-2024-06-26",
        "content": "",
        "num_comments": 217,
        "comments": [
            "Now more caregivers are seeking",
            "Now go look which requests have seen a surge.",
            "Finally",
            "![gif](giphy|NEOHyi0WgES1h98eAR)",
            "Finally some good news in this world.",
            ">The work permit restrictions in Canada prompted Indian students to look elsewhere in Australia for higher studies.\n\nWe're all in fear of this in Australia, inevitable they'd pivot to us as the next target ripe for exploiting",
            "I would love it became 0. We have MORE THAN ENOUGH indian people already...",
            "They'll just find another loophole to scam...as bad as it may get here it's still better than where they're coming from in their mind. ",
            "I hate how they’re framing this shit like it’s about race which in turn makes Canadians seem racist. \n\nWe are not opposed to Indians. We are opposed to how our government has blown their load and opened the floodgates.",
            "My wife works at Georgian College. Summer enrolment is down 40%."
        ]
    },
    "Quebec Premier: We can't welcome 300,000 people in 2 years. Mass immigration needs to be controlled. The Premier also said several times that \"100% of housing problems\" are related to the increase in the number of temporary immigrants.": {
        "title": "Quebec Premier: We can't welcome 300,000 people in 2 years. Mass immigration needs to be controlled. The Premier also said several times that \"100% of housing problems\" are related to the increase in the number of temporary immigrants.",
        "score": 490,
        "url": "https://www.lapresse.ca/actualites/politique/2024-06-28/immigration-au-quebec/francois-legault-craint-des-risques-de-reactions-et-de-surreactions.php",
        "content": "",
        "num_comments": 49,
        "comments": [
            "A duplicate post was removed.",
            "Say what you want about Quebec but they look after their own citizens. ",
            "\"Temporary immigrant\" contradiction in terms",
            "Someone with a brain",
            "This is just for Quebec btw. All of Canada welcomed 2.5 million in the last 2 years, and the next 2 years will be well above 3 million.",
            "Seems the tides they are a turning. And I had a whole bunch of people call me racist for simply saying Canadians are done putting up with this shit. Wheres all that crying now? Lmfao",
            "He's not wrong!",
            "He is 100% right",
            "There is a lot of truth in this - if we drop the # of temporary residence to even half of what we’re letting in suddenly the rental market becomes less stressed, ergo the market would balance itself and as far as low skill/part time work goes, employers will have to hire either citizens or permanent residents. It’s one of those rare economic decisions that will yield positive results in less than a year",
            "PEI and Q are the only places making any sense as of late."
        ]
    },
    "Too many international students ": {
        "title": "Too many international students ",
        "score": 484,
        "url": "https://www.reddit.com/r/sheridan/s/3gYWxFSkVL",
        "content": "",
        "num_comments": 91,
        "comments": [
            "[removed]",
            "Attended Conestoga to finish a diploma in 2017, my classes were full of international students you could tell had no interest being there. That was 2017 I don’t want to see it now. \n\nIn one class an international student walked in late with no bag, and asked me for a piece of paper. I had a flyer in my bag blank on the back so I offered it. (Thought a student without a computer was odd but these things cost money)\n\nThe student then asked me for a pen. I verbally lol’d and went on with my business. \n\nMy diploma now means nothing because the college is handing them out like hot cakes and gets filtered away by HR macros when I apply to jobs. Well worth my time and money !\n\nBig thanks to the fantastic individuals vetting people applying to studying in Canada \n\nHappy Canada Day! Not really sure what we’re celebrating anymore.",
            "too many fake students that are working. Cut them off from working then it will be reduced.",
            "My nephew took Economics at U of T and all of the students (Asian ) spoke Chinese amongst each other even when in groups during class. He asked the prof if it was ok (as it excluded him) and the prof seemed to be ok with it.",
            " I went to Sheridan and it’s the biggest regret of my life. International Students would not speak English, only that if you don’t give your work it’s racist to them.\n\nOne time I was paired up with an International Student and no one did work and made excuses one said “Sorry I was in Niagara Falls” and the other one said, “Sorry never looked at your message”.",
            "I did Sheridan College in Brampton, starting in the January semester. 80% international students with 2 not being from Punjab, India.\n\nFirst year over half introduced themselves as \"This is _name_\" instead of I am or my name is. Another good chunk spoke through a friend since they didn't know English.\n\nThis being said, by the 3rd and 4th semester over 60% of the cohort had failed or switched programs, and the remaining international students were primarily hard working, spoke English well, and wanted to learn to get a good job in computer science.\n\nLooking back I doubt any of the ones that failed out went home, but I blame the system more than them as individuals",
            "This is so common now. We all know mass immigration is ruining our country but we are just taking it. We have traitors in parliament who worked with foreign countries and we take it, our former defense minister betrayed actual Canadians and we just take it. \nWhat does it take before we start standing up for Canada?",
            "They’re here for PR (the vast majority anyways). Where I live there are “colleges” popping up all over the place. Every little strip mall has one now. Like “Harpreets Career College” filled with ‘students’ from India.\n\nThey run ads on social media explaining that if you o to the college they will get you PR in Canada.\n\nThey aren’t even trying to hide what’s going on, and our government is encouraging it to continue.\n\nJust look at this chart :\n\nhttps://preview.redd.it/drbxt4a4if9d1.jpeg?width=1918&format=pjpg&auto=webp&s=9bd7d773eff5ded20fd2fcc74378806d7c6e02b7",
            "I'm seeing a lot of bad experiences from real students trying to learn alongside 'students'. I wonder if this is a good opportunity for someone to start colleges that don't allow international 'students'. You know, a school where you sign up to learn something and not for scamming your way into Canada?",
            "I'm doing online courses through Laurentian. I've got a group project due this semester, and haven't even heard a hello from one of the group members. The others don't respond to communication... emails and messages into the void.\n\nNot sure what recourse I have other than doing it all myself and if they don't hand anything in, just email the prof and remove their names. Not that the prof is doing much better communicating. Dude gets paid 182k a year to copy paste his chapter summaries 3 times a year, and have online quizzes that are run by bot.\n\nI think our education as a whole has hit the shitter."
        ]
    },
    "Canada's lowest tax jurisdiction has higher taxes than America's highest tax jurisdiction. And what do we have to offer people for all their taxes? A declining standard of living. A generation is being priced out with record unaffordability and robbed from opportunity. ": {
        "title": "Canada's lowest tax jurisdiction has higher taxes than America's highest tax jurisdiction. And what do we have to offer people for all their taxes? A declining standard of living. A generation is being priced out with record unaffordability and robbed from opportunity. ",
        "score": 722,
        "url": "https://www.reddit.com/r/CanadaHousing2/comments/1dqm5ns/canadas_lowest_tax_jurisdiction_has_higher_taxes/",
        "content": "[https:\\/\\/x.com\\/KirkLubimov\\/status\\/1805958376633045088](https://preview.redd.it/na7ps16yxb9d1.png?width=485&format=png&auto=webp&s=a11739c0b5661e1138c3f300963dff79971edbaf)\n\n",
        "num_comments": 311,
        "comments": [
            "What i want is just that temporary residents be NOT eligible to benefits that citizens and permanent residents pay for. Gst rebates, climate incentives, child subsidy payments etc should only be available to citizens and permanent residents. I know some temporary residents who receive more than what they pay for in taxes. Multiply that to hundreds of thousands if not millions and you have a big net cash outflow shouldered by us. Im sorry but even healthcare, they should get discounted rate but not entirely free. Some are abusing the healthcare at the expense of us.",
            "I lost over 30k a year in income tax alone.  I get I make more so will get taxed more.  But where is that money going?  I don’t see anything good happening.  Rent prices are attrocious.  That amount of tax we pay just to be able to fuel our vehicles is insane.  A monthly transit pass where I live is 194 dollars a month.  A small bag of groceries is like 40-50 dollars now.  This is country is in a lot of trouble it truly is.",
            "[removed]",
            "The highway from Abbotsford to Langley was built in the 1960s.  \n\n\nThey can't build expansions now due to environmental studies.  Meanwhile you have people sleeping in the rest stops, they ruined humans natural habitat to preserve some life in the middle of an existing highway.",
            "Are you coming to the protests July 1st OP?",
            "We've brought in millions of convivence store workers, who are receiving a level of benefit from the government that they aren't ever going to pay for, someone has to.",
            "Lol, what a comparison, \"For individuals making 300k\"\n\nHow many Canadians ACTUALLY make that much, individually?\n\nI know about ~800 people in my extended circle.of business contacts through my business.\n\nI know about 12 people who can say they make that much.",
            "Come on - why discount Canadians’ magnanimity in addressing the world’s problems with tax payers’ money? Which other country taxes their citizens to help the rest of the world?! Be proud.\n\n/s",
            "Canadians believe that the government is the engine in the economic train. Then complain about cost of living...",
            "Look at the bright side.  Non Canadian citizens get taxpayer funded (free) access to all Canadian parks. And us citizens that paid for them, don’t."
        ]
    }
}