{
    "Oilers erase 3-0 series deficit, beat Panthers to force Game 7 in Stanley Cup final": {
        "title": "Oilers erase 3-0 series deficit, beat Panthers to force Game 7 in Stanley Cup final",
        "score": 978,
        "url": "https://www.cbc.ca/sports/hockey/nhl/stanley-cup-final-game-6-oilers-panthers-june-21-1.7243219",
        "content": "",
        "num_comments": 193,
        "comments": [
            "Am I a diehard oilers fan? No.\n\nAm I getting much enjoyment out of Florida pissing away a 3 game lead? *You bet your ass I am.*",
            "Oilers team has 23 Canadian players. \n\nPanthers team has 13 Canadian players.",
            "Back to back empty netters... The assist from Skinner.. what a game",
            "Wild fan fully on board. Let's fucking go Edmonton bring it home.",
            "Jets fan signing in. BRING IT HOME. MCDADDY CANNOT BE STOPPED WHEWWWWW!!!",
            "IM ONE OF 5 SENS FANS IN THE WORLD, BRING THE CUP HOME OILERS 🗣️🗣️🗣️🔥🔥🔥",
            "I hate to say it, as a canucks fan, go oilers!",
            "The last team to do this in a major sports final were the Knicks in the 1951 NBA Final. To put into perspective how rare this is (they proceeded to lose game 7 however)",
            "As a Flames fan, I hate to say it but I'm cheering for the oilers now! \n\nLet's go!!!!!",
            "Monday Oilers will get the cup and McDavid will get the Conn Smythe trophy!"
        ]
    },
    "Second Canadian scientist alleges brain illness investigation was shut down": {
        "title": "Second Canadian scientist alleges brain illness investigation was shut down",
        "score": 1260,
        "url": "https://www.theguardian.com/world/article/2024/jun/21/second-canadian-scientist-alleges-brain-illness-investigation-was-shut-down",
        "content": "",
        "num_comments": 183,
        "comments": [
            "This post appears to relate to a province/territory of Canada. As a reminder of the rules of this subreddit, we do not permit negative commentary about all residents of any province, city, or other geography - this is an example of prejudice, and prejudice is not permitted here. https://www.reddit.com/r/canada/wiki/rules \n\nCette soumission semble concerner une province ou un territoire du Canada. Selon les règles de ce sous-répertoire, nous n'autorisons pas les commentaires négatifs sur tous les résidents d'une province, d'une ville ou d'une autre région géographique; il s'agit d'un exemple de intolérance qui n'est pas autorisé ici. https://www.reddit.com/r/canada/wiki/regles\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/canada) if you have any questions or concerns.*",
            "Hope it gets called \"Irving Syndrome\" in the end.",
            "This should honestly be a way bigger deal than it is. People should be furious about this",
            "HIggs is so far up Irvings ass he's brain damaged from lack of oxygen. You can be assured he's 100% getting kickbacks from his buddies at Irving.",
            "Has anyone checked for methylmercury poisoning as was seen in Minimata?",
            "No shit. The Irvings run NB as their private fiefdom and don't want any questions.",
            "Suspicious...",
            "“In the spring of 2021, I felt incredibly optimistic that an all of government effort to unravel the mystery was in the cards. However, in short order, the scientific effort was shut down at the request of the [federal and provincial] Governments,” Weiss wrote in the email sent in May.”\n\nProvincial and Federal",
            "anyone willing to post a TLDR?",
            "Data my ass!"
        ]
    },
    "Ontario Science Centre closes after roof in danger of collapsing under weight of Doug Ford’s bullshit": {
        "title": "Ontario Science Centre closes after roof in danger of collapsing under weight of Doug Ford’s bullshit",
        "score": 581,
        "url": "https://thebeaverton.com/2024/06/ontario-science-centre-closes-after-roof-in-danger-of-collapsing-under-weight-of-doug-fords-bullshit/",
        "content": "",
        "num_comments": 41,
        "comments": [
            "While satire posts are popular we understand that not everyone enjoys them. If you wish not to see them please use the filter on the sidebar or set your own filters to block satire content or websites.\n\nLa satire est populaire ici, mais nous comprenons que tout le monde ne l'apprécie pas. Si vous ne souhaitez pas les voir, veuillez utiliser le filtre sur la barre latérale ou définir vos propres filtres pour bloquer le contenu satirique ou les sites Web.\n\nFilter out Satire - Filtrer Satire: https://st.reddit.com/r/canada\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/canada) if you have any questions or concerns.*",
            "I keep hearing about his developer buddies. Who are they? Maybe everybody should know who are pulling the threads on him.",
            "Alright that’s a great title.",
            "Make no mistake. There was only $13 million of repairs that were needed to fix the roof. Ford spent $45 million on propaganda ads alone. The money was there to fix it. He's moving the science centre only because his donors paid him to do it. It's pure corruption with this fucker, every single time.",
            "Once again, the Beaverton proves truer than any other news source. The government has been refusing all urgent repair requests from the OSC for over five years now. They deliberately let it become unsafe so they could say they *had* to close it and move it to Ontario Place where his cronies will profit from building the new one and profit more from developing the land the current one occupies. This is so transparent it’s disgusting. At any time they could have repaired it in the current location for a fraction of the cost, they still could, but then he and his developer buddies aren’t making any money. Ford seems to have hundreds of millions to waste on very slightly accelerating our ability to buy beer in corner stores, but none for maintaining an Ontario institution that has educated and entertained kids for decades. Typical Doug Ford government.",
            ">TORONTO – After standing for 54 years as a testament to midcentury architecture and a source of memories for generations of young people, the Ontario Science Centre was announced to be closing today, the result of strain on its roof as it struggled to support the added tonnage of Premier Doug Ford’s bullshit.\n\n>“The bullshit began to gather on the northern side of Raymond Moriyma’s famous building just after Ford’s reelection, when he suggested that the facility was in need of modernization while simultaneously refusing to fund those efforts,” said structural engineer Dr. Samuel Konstanz. “By the time he announced a plan to move the whole thing to Ontario Place in order to benefit his real estate donors, the support beams were completely unstable.”",
            ">Ms. Surma did her very best to pretend that the roof was an immediate concern that warranted the facility closing, going so far as to claim in a press release that it could collapse if these upcoming summer months resulted in enough “snow accumulation.”\n\nThe best part right there!",
            "Dougie has an endless supply of bullshit unfortunately.",
            "Classic Conservative tactics: \"create a crisis and then do what you've been planning\". They've been working on that roof since last summer, how could they not know the roof was going to fall down? Sketchy Ford family; check out the 2013 Globe and Mail article: Rob Ford's crack video, the sister Kathy shot in the face by her ex and the other ex in jail for murder, Randy Ford charged with kidnapping and Doug, the high-school drug dealer who wasn't just selling pot.",
            "> Ms. Surma did her very best to pretend that the roof was an immediate concern that warranted the facility closing, going so far as to claim in a press release that it could collapse if these upcoming summer months resulted in enough “snow accumulation.”"
        ]
    },
    "Canada reportedly preparing to evacuate 45,000 citizens from Lebanon amid war fears": {
        "title": "Canada reportedly preparing to evacuate 45,000 citizens from Lebanon amid war fears",
        "score": 447,
        "url": "https://nationalpost.com/news/world/israel-middle-east/canada-reportedly-preparing-to-evacuate-citizens-from-lebanon",
        "content": "",
        "num_comments": 503,
        "comments": [
            "Why are 45,000 Canadians living in a foreign country in need of evacuation",
            "Again? Like we did in the early 2010s or late 2000s in Lebanon or Syria? When the government shelled out $500 million and all they did was whine at the government for not rescuing all 60,000 of them fast enough...? The same ones who within 6 months, 80% had returned back to the country?\n\nNo. Just fucking no.",
            "Why? The courts have already decided that there is no right to be brought back to Canada. They can buy their own flight tickets.\n\n>In its analysis of past legal decisions, the appeal court wrote that the Charter protects against exile and banishment but \"offers no encouragement for the idea that Subsection 6(1) includes a right to be returned to Canada.\"\n\n[https://www.ctvnews.ca/politics/federal-court-of-appeal-canada-not-constitutionally-obligated-to-bring-home-suspected-isis-fighters-1.6421360](https://www.ctvnews.ca/politics/federal-court-of-appeal-canada-not-constitutionally-obligated-to-bring-home-suspected-isis-fighters-1.6421360)",
            "Are you nuts?  Tell them to book a flight.  They just have a Canadian passport for convenience, don’t pay taxes …",
            "Why don't they go to the nearest safe country?",
            "How many times are we going to do something similar?   I’d say if they’ve not lived in Canada and paid taxes in Canada for 6 months in the past 2 years they can sort themselves out.",
            "They should be taking care of that themselves. They knew the situation when they went back there. It's not like Lebanon has been a beacon of stability in the last 40 years.",
            "What a fantastic example of why birthright citizenship needs to end.",
            "Not again.",
            "It cost 95 million to bring 15 000 of them in 2006. Most returned within a month.\n\nFunny that Lebanon is better place to live until you need Canadians to buy you a plan ticket."
        ]
    },
    "After weeks without water, Calgarians now smell like Edmontonians": {
        "title": "After weeks without water, Calgarians now smell like Edmontonians",
        "score": 555,
        "url": "https://www.thebeaverton.com/2024/06/after-weeks-without-water-calgarians-now-smell-like-edmontonians/",
        "content": "",
        "num_comments": 28,
        "comments": [
            "While satire posts are popular we understand that not everyone enjoys them. If you wish not to see them please use the filter on the sidebar or set your own filters to block satire content or websites.\n\nLa satire est populaire ici, mais nous comprenons que tout le monde ne l'apprécie pas. Si vous ne souhaitez pas les voir, veuillez utiliser le filtre sur la barre latérale ou définir vos propres filtres pour bloquer le contenu satirique ou les sites Web.\n\nFilter out Satire - Filtrer Satire: https://st.reddit.com/r/canada\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/canada) if you have any questions or concerns.*",
            "Oh man that made me laugh… in my long hot shower… after watering my garden…",
            ">CALGARY – After two weeks of restricted access to water for showers, laundry, and other acts of hygiene, sources have reported that Calgarians now smell like Edmontonians do all year long.\n\n>“Jesus, it reeks like Whyte Avenue in here,” said a Calgarian eating in a crowded restaurant. “If I wanted to smell filthy, sweat-drenched people abandoned by God himself I’d go to an Oilers game.”\n\n>One of Calgary’s water mains broke on June 5, forcing Calgarians to ration water and plunging the city into a scenario locals have described as “frustrating,” “alarming,” and “Edmonton-esque.”\n\n>“It’s been tough on my friends and family, but I lived in Edmonton during a low point in my life, so I’m used to being among the unwashed masses,” said one Calgarian. “I keep telling everyone that yes, the whole city really does just share a single bathtub that’s kept in the City Hall foyer and filled with used pasta water.”",
            "That is hilarious.",
            "Nah…That smell is playoff hockey.  \nMost Calgarians don’t recognize the odour.  \nOr Torontonians.",
            "At least Calgarians now know what hard work smells like",
            "Lol",
            "🤣🤣🤣🤣🤣",
            "I’d be outraged but yeah, I mean we probably smell like Edmontonians now",
            "Lol they should adopt a stinky name to celebrate this history of stank, like 'cabbagetown' or 'hogtown' or something like that."
        ]
    }
}