{
    "GDT: NHL Draft, Day 1": {
        "title": "GDT: NHL Draft, Day 1",
        "score": 24,
        "url": "https://www.reddit.com/r/canucks/comments/1dqreus/gdt_nhl_draft_day_1/",
        "content": "The first round of the draft is today at 4PM. Canucks do not have a pick in the first round (unless they make a trade today), but this is a place to talk about trades and picks around the league!\n\nhttps://www.nhl.com/draft/tracker",
        "num_comments": 89,
        "comments": [
            "Celine Dion today. Michael Bublé tomorrow.",
            "Apparently Allvin said Zadorov isn't re-signing....fuck, that sucks\n\nEdit: Also mods pls sort by new",
            "That single shark fan representing his entire team's fanbase lmao",
            "I appreciate this one guy's enthusiasm but maybe they should move the crowd mic away from him",
            "TIME TO LEARN UTAHNESE TIJ",
            "Let me just say on behalf of all Canuck fans, isn't it nice to not look forward to draft day this year?",
            "No Canucks draft pick on first round means I am just here for the memes and entertainment and potential live trainwreck/cringe like Carey Price deer-in-headlights moment last year. 👀\n\nOr maybe Lord Bettman will have a trade to announce…. 😯",
            "Flyers bringing out the boxing announcer was a sick touch, that's a voice for announcing a pick",
            "LMAO did I hear an \"Oilers suck\" chant when Edmonton went up to pick? Fucking awesome.",
            "The look on Sennecke's face when his name was called LOL."
        ]
    },
    "chill offseason thread, pt 3": {
        "title": "chill offseason thread, pt 3",
        "score": 6,
        "url": "https://www.reddit.com/r/canucks/comments/1dqs167/chill_offseason_thread_pt_3/",
        "content": "This is a thread to talk casually about life, canucks, hockey, and whatever else. try and keep serious trade/draft/FA discussion in the other thread though",
        "num_comments": 46,
        "comments": [
            "i almost got my first game worn jersey today 😭 had the Joshua Skate jersey in my cart and while i was paying for it, it sold. had to share my heartbreak somewhere.",
            "I really hope not being selected in the top 6 for the four nations tournament lights a fire under Petey. obviously he will be on the team but definitely was expecting him to be one of the first guys annouced. I remember when they annouced the tourney for the first time Petey was the one answering questions with McJesus and Matthews about the tournament.",
            "thankful every day the Oilers lost",
            "On LW we have Joshua and Hoglander. Pettersson needs a real high skill winger like Guentzal",
            "i'm just excited that the team is notable again and we're making moves that matter\n\nI remember when we would just be sitting out free agency and I wouldn't even care because I know we weren't going to do anything in the playoffs anyway",
            "Thinking/stressful over finishing internal interview and whether to get offer.",
            "I’m on vacation starting today!!!!! Free agent frenzy, camping, disc golf, gardening, not working. It’s going to be great.",
            "God I'm fuckin jacked up about all this. I'm so jacked up. Man I'm jacked up and gettin crazy. Damn.",
            "Can’t wait to wear my Canucks jerseys again after having them all sorted and hanged on the z-rack",
            "Im just ready to have cup holders at Rogers Arena"
        ]
    },
    "[Dreger @2:25] The Vancouver Canucks tried to keep Zadorov, but they came in (with an offer) late, and went as high as 5m AAV.": {
        "title": "[Dreger @2:25] The Vancouver Canucks tried to keep Zadorov, but they came in (with an offer) late, and went as high as 5m AAV.",
        "score": 188,
        "url": "https://www.tsn.ca/nhl/video/~2935597",
        "content": "",
        "num_comments": 141,
        "comments": [
            "Ya if he wasn't willing to take 5mil then it's best he looks elsewhere. I think fans would have been pretty suspect even at that number.",
            "We already know Zadorov wanted term. This was likely a 5x5 or a 5x6 that was offered, and Zadorov said no.\n\nI think we dodged a bullet.",
            "Yeah Zadorov wants all the money he can get. More power to him. Good luck big Z.",
            "Management was willing to go to 5M and Zad still didn't sign? I'm so good with walking away from this. 5M was already an overpay. Let him try to get more than that on the open market.",
            "Bullet dodged. That would've been our OEL rebound hookup.",
            "5 million for Z is fucking crazy thank god he declined",
            "That is a solid offer… even more than I expected from the Canucks. Huge bullet dodged if true. Good luck to whoever wants to commit 5-6M a year for him on a lengthy term.\n\nI’ll say this again, if Zadorov is around $1M-$1.5M less than a legit top RHD in Hronek, then that is ridiculous.",
            "Dodged a bullet, it was probably a 5 x 5-6 or something",
            "I love Z but not at this price tag. Good luck to him, on July 1.",
            "Holy shit.   5 by 6 ????????  Thank god he walked !!! We just dodged a huge bullet !!!!  This would have been an epic epic failure 😣"
        ]
    },
    "BC/Vancouver hockey prospects are tearing it up": {
        "title": "BC/Vancouver hockey prospects are tearing it up",
        "score": 201,
        "url": "https://www.reddit.com/r/canucks/comments/1dr1i82/bcvancouver_hockey_prospects_are_tearing_it_up/",
        "content": "It is truly remarkable how high BC born players are going in the draft.\n\nNot only do you have Bedard and Celebrini as back to back 1st overall picks. \n\nThe top 3 Canadians in this draft picked at 1, 4, and 6 are all BC born. \n\nIn last years draft 1, 13, and 15 3/5 lottery pick Canadians were BC Born. \n\nIn 21 Kent Johnson at 5.\n\nByram in 19 at 4th. \n\nThen you also have young guys who went later but are looking promising in Stankoven and Minten.\n\nBut all around nice to see a lot of young BC talent tearing it up, crazy they start doing it after we stop rebuilding. \n\n\n\nAlso kinda crazy that most of these players would be the ones that don't even remember the Canucks cup runs \n\n",
        "num_comments": 71,
        "comments": [
            "Unfortunately none of them play for us 😔\n\nYet 😏 (Bedard will sign with us for the minimum after his ELC to bring the cup home)",
            "Last time we picked a BC boy in the 1st round…. He got banished to Russia",
            "Bedard and Celebrini… enough said",
            "We have to get one stud player in FA one day",
            "Bedard and Celibrini are from the same youth program.\nBack to back 1st overall from the same city. Wonder if that’s ever happened before.",
            "North Shore Winter club doing some serious work in my hood. Big bucks to enroll your kid but seems to be worth it.",
            "Vancouver selected Aiden Celebrini in the 6th round of last year's draft. Time will tell.",
            "And none drafted by the canucks 😋",
            "too bad our scouting doesn't seem too invested in BC-born players.",
            "Bedard's cousin Gavin McKenna is coming up too"
        ]
    },
    "Coping with all the UFA updates today": {
        "title": "Coping with all the UFA updates today",
        "score": 423,
        "url": "https://i.redd.it/if0fsfadyd9d1.png",
        "content": "",
        "num_comments": 90,
        "comments": [
            "Reinhart is staying in Florida. Stamkos would be an interesting pick up. It could be this era’s Mats Sundin (in terms of experience and lockeroom presence not the cap hit), might be the player that elevates this group to the next level.",
            "No Reinhart, but the possibility for Guentzel is still there until he re-signs in Carolina",
            "Stamkos signing would make up for both Zadorov and Lindholm leaving lol",
            "Sometimes the best deals are the ones you don't make.",
            "The silence in the sub rn is deafening",
            "Praying for Stamkos. That would be some serious spice for our offence.",
            "We kept who we needed to keep, and aren't overpaying for Lindy/Zaddy, which could be disastrous long term. I'm perfectly fine with how things are going so far, Alvin will be smart, and won't overreact ",
            "None of them will sign here, there’s literally nobody else interesting on the market. Just a bunch of depth guys, looks like peteys gonna be in winger hell still.",
            "Dad needs to come home.",
            "no to tanev. durability is a big concern. he probbaly be healthy for 30 games and when the games matter the most he wont be in the lineup as much. find another rhd younger."
        ]
    }
}