{
    "State of the Subreddit - Announcement": {
        "title": "State of the Subreddit - Announcement",
        "score": 49,
        "url": "https://www.reddit.com/r/careeradvice/comments/14erg6q/state_of_the_subreddit_announcement/",
        "content": "employ drunk knee zephyr ten sharp cooperative cooing imminent oatmeal\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
        "num_comments": 0,
        "comments": []
    },
    "Would you stick with a job you love for $24K or take a $42K offer for a job you won’t enjoy?": {
        "title": "Would you stick with a job you love for $24K or take a $42K offer for a job you won’t enjoy?",
        "score": 27,
        "url": "https://www.reddit.com/r/careeradvice/comments/1dqykry/would_you_stick_with_a_job_you_love_for_24k_or/",
        "content": "I'm in my mid-20s and living in Egypt currently earn $24K/year working on a product I love with a team I really enjoy. Although the salary covers my living expenses, it doesn’t leave much for savings.\n\nI've just received a remote offer for $42K/year from another company. While the pay is much better, I know I won’t enjoy the job as much.\n\nShould I stay at the job I love or go for the higher salary? What factors would you weigh if you were in my situation?\n\nEdit:  \nJust to clarify, I live in Egypt, The average annual salary here is $5K/Year. People consider $24K/Year to be a shit ton of money over here.",
        "num_comments": 69,
        "comments": [
            "No question 42k offer. Even that is extremely low in terms of salary.",
            "Go for the higher pay. Love wears off in any job. Life is what matters and your quality of life will be improved with higher wages.",
            "$18K can buy a lot of enjoyment for the 120 hours you don’t have to work.",
            "$42k, but that’s still way low for a salaried job, that’s only the equivalent of a $21 an hour job",
            "If you earn 5 times a typical salary, why is there no room for savings?",
            "You have to give yourself a raise and a cost of living increase and take that damn job !\n\nKeep it for a year, and start looking for your next job/promotion now as you transfer into that new job\n\n. Sadly the only way to make more money is to move up from within or leave and take another job elsewhere.",
            "What I have realized is that you will have peace with the job you love and then burn out with the one you don’t love. When you love a job you will do it effortlessly and get frustrated with the one you don’t.\n\nWhat about you go for the one you love and then look for another job that wouldn’t stress you out. That way you work on jobs you love and would do rejoicing, and at the same time make more money.",
            "Spend your money on your values. That goes with the opportunity costs as well.\n\nStashing that $18k away per year would give you a lot of freedom in the future. But having puece of mind and enough free time to enjoy your 20s is also very valuable (and you'll appreciate the memories your entire life).\n\nOnly you can answer the question of value though. Is the joy from your work worth $18k/yr? Both options sound like winners to me.",
            "That edit was the most important info.\n\nWhat are your life goals?\n\nIs there anything you need to accomplish that you'll never be able to without doubling your pay?\n\nIf not, stay where you are.\n\nBut ask for a raise. Maybe mention that offer. **Tactfully.** I don't know how things work over there. Don't get yourself fired.",
            "one question...how soon will you get a raise at your current job to match your new job?  I have a sneaky suspicion a very long time to never.  \n\nYou're barely making ends meet.  Even when you get the $42k job, you'll need to still look to grow and probably change to a job where there is room to grow and make more money."
        ]
    },
    "Is it terrible to just want to ride out your career until you retire? ": {
        "title": "Is it terrible to just want to ride out your career until you retire? ",
        "score": 13,
        "url": "https://www.reddit.com/r/careeradvice/comments/1dqwh3k/is_it_terrible_to_just_want_to_ride_out_your/",
        "content": "I've been a pretty ambitious and driven person in my career. I changed roles or jobs regularly, sought out the jobs or projects I wanted, networked, did a lot of professional development, earned new credentials, etc. \n\nHowever, now I find myself at 60 and I feel mostly tired and not interested in climbing the corporate ladder any further. When I am in annual performance reviews or discussions about the future/next steps I am honest that I am content doing what I do at the moment and my goal is to retire from full time work within 3 years. \n\nMost of the time when I speak to senior management about this I get shock and surprise. They can't believe I don't want to push towards a job as a VP or something.  And I wonder sometimes if its because people who are driven towards \"the next step\" will do more, put in more hours, push to increase their profile, volunteer for extra tasks, etc. These are those things that many of us end up doing to be seen as that person who will go above and beyond. However, at this point in my career I just want to work my regular hours, meet all my job expectations, take my vacations, get paid and just... ride it out. \n\nAs I do so it will be interesting to see whether my employer will be ok with that. After all I'm not donating a bunch of extra work and time for no extra pay lol. ",
        "num_comments": 26,
        "comments": [
            "As a manager, I'm grateful for the people on my team who are interested in just coming in and doing good work every day.  Yeah, sure, high performers are nice for a little while, but then they move up and move on and I'm left with a hole in my team.  If I knew I had you on my team for 3 years to be focused on your work and not worried about your next role, I'd be happy that you've chosen me as the boss to ride out the end of your career with.",
            "NOT AT ALL. I think it’s super healthy. \n\nIve also been ambitious and driven my whole life, and recently challenged the idea that working your way up in a company is what success looks like. Success should be framed as being happy and healthy. \n\nThere’s so much more to life than working your way up in a company. You trade so much more of your time, health and peace for more money, more stress, more taxes and more expenses like outsourcing house or other work. Also the return on stepping up for extra work is often so incremental, so why bother.\n\nWhen I see people in senior leadership positions, I think you couldn’t pay me enough to do that shit.",
            "It's not terrible but you need to stop putting a bullet on your back for layoffs. Keep these feelings to yourself and learn how to play the game.",
            "I don’t think there’s anything wrong with that. If you are satisfied then that is all that matters.",
            "OP, we are the same. Good job, good pay, good boss, good company.  Want to do this until 65. No promotions, just Xs on the calendar",
            "Most businesses today wouldn’t dream of making someone a VP at sixty if they hadn’t already held that role somewhere else. The assumption is often that if you haven’t made it by 45 you probably just aren’t up to it. It’s bullshit of course, but that’s the tyranny of youth.\n\nIt’s sensible to drop down a gear when you get towards retirement age (if only for the sake of your health) and nobody should feel guilty about it. I’m heading towards retirement myself and see my main value to the business now as mentoring, coaching and training the next generation rather than trying to scrabble up an ever shortening ladder. Kick back, relax, enjoy your success, and start planning holidays.",
            "The way I have put this is this:\n\nI'm still engaged in my job. I enjoy the work and my coworkers. I'm committed to helping solve <this company's> problems.\n\nBut I'm past the point where I'm worried about career development. \"Where will I be 5 years from now\" isn't commuting to an office.\n\nBut right now, I'm here and I'm working. Let's talk about what we're going to do in the next couple of years.",
            "We decided in our 50s we didn't want the stress and hassle of management. I've managed to fall into it from day 1 of getting my nursing license test results decades ago. It was enough. \n\nMy husband is in IT was asked if he was interested as recently as 2 yrs ago. He's coasting at 62. He'll coast for as long as he can.. good pay, good benefits, Hybrid, low stress..... He'd go crazy if he just retired.",
            "Nope, perfect strategy when you’re 60. You don’t need your life derailed with a promotion.",
            "I checked out. I just don’t see the point lol."
        ]
    },
    "What to do now?": {
        "title": "What to do now?",
        "score": 2,
        "url": "https://www.reddit.com/r/careeradvice/comments/1dr48ku/what_to_do_now/",
        "content": "I have a bachelors in sociology and don't see myself finding a way to use it. I've applied to many HR, social work, etc., type jobs but it's been two years and I'm not even that passionate about those roles. I plan to eventually go back to school, but regardless I need to work. I'm in a lot of debt and have a kitty on cancer treatments. I'd like to either get into lab work or a trade but cannot do additional schooling now. What can I do?",
        "num_comments": 1,
        "comments": [
            "No skillset with sociology at the entry level, that’s the problem. Home Depot managers couldn’t care less about the demographics of Latin America. They just need the truck unloaded and stored on shelves for customers. In corporate, data analytics skills or procurement competence, like supplier management and demand planning are paid well. \n\nJust go get a job like an associate at a Home Depot or like company, learn the business and inventory management, then in a couple of years you have skills you can leverage. Most people don’t want to do the work that works. Try something, and turn it into something else that makes your life meaningful and makes bigger bucks.  One step at a time, grasshopper. Opportunities find you at each step you take."
        ]
    },
    "just got laid off and only have an Associate's - what's the wise thing to do?": {
        "title": "just got laid off and only have an Associate's - what's the wise thing to do?",
        "score": 5,
        "url": "https://www.reddit.com/r/careeradvice/comments/1dqy7aq/just_got_laid_off_and_only_have_an_associates/",
        "content": "I'm 33 years old and have been working remote in Education Technology for 4 years now.  My role has been affected by a recent acquisition.  I was making ~41k which is not a lot at all, but paid the bills.\n\nThe problem is I live in Chicago, which is expensive and don't/can't plan on moving. I only have an Associate's degree which doesn't get me too far.\n\nI feel lost and don't know if I should search for higher paying jobs based on my work experience and just work my way up, or go back to school for my Bachelor's.  I'm very introverted and have anxiety so even searching for a major that would work for me is tricky as I like working behind the scenes.\n\nIt's been a really rough year for me. In April, I was a victim of theft then got really sick with Covid. In May, I had to say goodbye to my cat of almost 22 years, and now this.\n\nI could really use some advice or guidance. I have no one to turn to. ",
        "num_comments": 3,
        "comments": [
            "Can you do uber or food delivery?",
            "Experience can fill the gap without needing a bachelor's. Just start applying for jobs",
            "old belief system alert. Degrees don't do anything, no one cares.\n\nIt's all about skills. develop skills people are paying for in the marketplace."
        ]
    }
}