{
    "What Car Should I Buy? - A Weekly Megathread": {
        "title": "What Car Should I Buy? - A Weekly Megathread",
        "score": 8,
        "url": "https://www.reddit.com/r/cars/comments/1dhxirr/what_car_should_i_buy_a_weekly_megathread/",
        "content": "Any posts pertaining to car buying suggestions or advice belong in this weekly megathread; **do not post car-choosing questions in the main queue**. A fresh thread will be posted every Monday and posts auto sorted by new. A few other subreddits worth checking out that will help your car buying experience are [/r/WhatCarShouldIBuy](https://www.reddit.com/r/WhatCarShouldIBuy), [/r/UsedCars](https://www.reddit.com/r/UsedCars) and [/r/AskCarSales](https://www.reddit.com/r/AskCarSales). [www.everydaydriver.com](http://www.everydaydriver.com/) may also be helpful.\n\nMake/Model-specific questions should be asked on Make/Model-specific subreddits. Check the [AutosNetwork](https://www.reddit.com/r/AutosNetwork/wiki/main) for a complete list of those subreddits. Also check out our [community-sourced Ultimate car buying wiki.](https://www.reddit.com/r/cars/wiki/whatcarshouldibuy)  \n\n\nFor those posting:  \n\n\nPlease use the following template in your post.\n\n**Location:** (Specify your country or region)\n\n**Price range:** (Minimum-Maximum in your local currency)\n\n**Lease or Buy:**\n\n**New or used:**\n\n**Type of vehicle:** (Truck, Car, Sports Car, Sedan, Crossover, SUV, Racecar, Luxury etc.)\n\n**Must haves:** (4x4, AWD, Fuel efficient, Navigation, Turbo, V8, V6, Trunk space, Smooth ride, Leather etc.)\n\n**Desired transmission** (auto/manual, etc):\n\n**Intended use:** (Daily Driver, Family Car, Weekend Car, Track Toy, Project Car, Work Truck, Off-roading etc.)\n\n**Vehicles you've already considered:**\n\n**Is this your 1st vehicle:**\n\n**Do you need a Warranty:**\n\n**Can you do Minor work on your own vehicle:** (fluids, alternator, battery, brake pads etc)\n\n**Can you do Major work on your own vehicle:** (engine and transmission, timing belt/chains, body work, suspension etc )\n\n**Additional Notes:**\n\n​\n\nFor those providing suggestions: Facts are ideal in this thread, especially when trying to help out a new car buyer. Please help out buyers with sources and reasoning for your suggestions.  \n\n\nFor those asking for help, be sure to thank those who take the time to offer you advice (especially those who lead you to a purchase.) A follow up thank you and the knowledge that their advice led to a purchase is a very warm fuzzy feeling.",
        "num_comments": 50,
        "comments": [
            "\n**Location:** Michigan\n\n**Price range:** $30-50K\n\n**Lease or Buy:** Either\n\n**New or used:** Either\n\n**Type of vehicle:** Sedan\n\n**Must haves:** Top safety features, reliability, luxury feel\n\n**Desired transmission** Automatic\n\n**Intended use:** Daily Driver\n\n**Vehicles you've already considered: Camry Hybrid, Lexus ES300H\n\n**Is this your 1st vehicle:** No\n\n**Do you need a Warranty:** No\n\n**Can you do Minor work on your own vehicle:** Yes\n\n**Can you do Major work on your own vehicle:** No\n\n**Additional Notes:**\n\nLooking for a good daily driver",
            "I’m in North Texas, doing a lot of driving. \n\nI don’t haul stuff but it would be my daily driver. I’d prefer automatic. I’m looking at used mustangs but really am pretty I knowledgeable when it comes to years and stuff. I want a V8 before they go the way of the dodo. \n\nUltimately what I want in a car is something enjoyable to drive on American highways, not too big for city driving, and is something that won’t be in the shop all the time due to issues. The mustang is interesting to me due to being able to get some higher trims used with under 30k miles for around 30k. Im just wondering what my options are if I want to stay under 35k but have a car that will be fun and last me 7 years or so.",
            "M240i G42 vs 6th gen Camaro SS\n\nLocation: USA\n\nPrice range: $50K\n\nLease or Buy: Buy\n\nNew or used: either\n\nMust haves: A lot of legroom (36\" inseam), good power and handling.\n\nDesired transmission (auto/manual, etc): probably auto\n\nIntended use: weekend car\n\nIs this your 1st vehicle: nay\n\nDo you need a Warranty: It would be nice \n\nCan you do Minor work on your own vehicle: yes\n\nCan you do Major work on your own vehicle: I've done some major work but would rather not\n\nAdditional Notes: Used pricing on both of these vehicles is high (close to MSRP). My guess is the V8 Camaro will hold it's value better long term. The M240i might make more sense to buy new, especially since used G42's are scarce. I've tested the Camaro. Haven't tested a 2 series.",
            "Location: Pennsylvania, greater Philly area\n\nPrice range: $25K max\n\nLease or buy: Buy, paying cash\n\nNew or used: Used\n\nType of vehicle: SUV, wagon, hatchback, sedan (in order of preference)\n\nMust haves: Safety and reliability\n\nIntended use(s): Daily driver\n\nIs this your first vehicle: No\n\nDo you need a warranty: No, but wouldn't turn down a CPO warranty\n\nCan you do Minor work on your own vehicle: Yes\n\nCan you do Major work on your own vehicle: No\n\nAdditional Notes: I'm looking to replace an aging vehicle that's racking up repair costs with something a little more safe and reliable. It'll be just me most of the time, but I'll occasionally be taking my daughter, hence the safe requirement. $25K is my absolute maximum; I would love to come in under that if possible.",
            "Location: SoCal, CA, USA.  \nPrice range: $20,000 - $35,000.  \nLease or Buy: Buy.   \nNew or used: Used.  \nType of vehicle: Car, Crossover, SUV.  \nMust haves: Spacious, Sporty, Apple Carplay (factory or retrofit), 4 doors.  \nDesired transmission: Open for auto or manual.  \nIntended use: Daily Driver, Family Car.  \nVehicles you've already considered: BMW 640i GT, 440i GC, X3, Golf R, Kia Stinger  \nIs this your 1st vehicle: No.   \nDo you need a Warranty: No.  \nCan you do Minor work on your own vehicle: Yes.  \nCan you do Major work on your own vehicle: No.  \nAdditional Notes: Looking for a car that has two personalities. One as a comfortable DD, family capable, spacious, but still has a spirited, enthusiast side. I test drove a 640i gran turismo with the famous B58 engine, thinking it was a good compromise, but it was almost TOO refined. It hauls ass and had no issue doing so, but its very floaty and luxurious and I would want something with a little more edge or rawness.",
            "**Location:** Southern Wisconsin, USA\n\n**Price range:** 20k - 35k\n\n**Lease or Buy:** Buy\n\n**New or used:** Either\n\n**Type of vehicle:** Sedan\n\n**Must haves:** Hybrid, good tech, good safety features (LKA, BSM, PCAS)\n\n**Desired transmission** (auto/manual, etc): Either (with hybrid probably auto though obviously)\n\n**Intended use:** Commute twice a week 25 mins mostly on highway, some city driving\n\n**Vehicles you've already considered:** Prius, Accord, Camry, Hyundai Elantra Hybrid (limited trim)\n\n**Is this your 1st vehicle:** no\n\n**Do you need a Warranty:** no\n\n**Can you do Minor work on your own vehicle:** no\n\n**Can you do Major work on your own vehicle:** no\n\n**Additional Notes:** I don't like driving and I get anxious about accidents so having a car that can \"assist\" is a big win for me. I am a software dev and love technology/a futuristic look, but I know next to nothing about cars and don't need car person features like good acceleration, handling (beyond what a layperson could tell), etc.",
            "\n**Location:** Massachusetts\n\n**Price range:** 20-35K\n\n**Lease or Buy:** Either\n\n**New or used:** Used\n\n**Type of vehicle:** Sports or Sedan\n\n**Must haves:** AWD, Fuel efficient \n\n**Desired transmission** Automatic\n\n**Intended use:** Daily Driver,\n\n**Vehicles you've already considered: Hyundai N, Alfa Romeo Giulia, Volvo S60\n\n**Is this your 1st vehicle:** No\n\n**Do you need a Warranty:** Yes\n\n**Can you do Minor work on your own vehicle:** Yes\n\n**Can you do Major work on your own vehicle:** No\n\n**Additional Notes:**\n\n​Looking for a good daily driver and one that looks nice would be ideal. I work in a business that deals with client meetings and I would like a car with a nice aesthetic when coming to the meetings. Also one that wont be insanely expensive to fix.\n\nFor those providing suggestions: Facts are ideal in",
            "Location: Nevada, USA\n\nPrice Range: 10-15k max\n\nBuy: Used due to budget\n\nVehicle Type: small sedan, sports car, compact crossover\n\nMust Haves: Good on gas, inline 4 (or V6), good amount of space in the trunk & easy to repair (I don't need another project right now haha)\n\nWants: Preferably RWD, Toyota/Lexus (Vehicles have been reliable enough for my parents), not too old (Before 2007) but not too new (2020 & above unless a car can be obtained within my budget)\n\n Gearbox: Auto but am willing to learn manual\n\nIntended use: Daily, family. I plan on hitting the track with it as a treat every 2-3 months or so.\n\nVehicles I've considered: Toyota RAV4 (Will update when I've done more research)\n\nFirst vehicle?: No\n\nWarranty: No\n\nAble to perform minor work?: Yes\n\nAble to perform major work?: No\n\nNotes: I drive a 91 Civic however it is in need of some repairs. Due to these reasons, it would be convenient for me to use a different vehicle while getting these repairs done. \n\nI plan on using this \"new\" vehicle until my Civic is road worthy again.",
            "**Location:** Amman , Jordan \n\n**Price range:** 21k USD / 15000 Jods\n\n**Lease or Buy:** Buy\n\n**New or used:** Used\n\n**Type of vehicle:** Sedan\n\n**Must haves:** Hybrid/EV , it has to be a cheaper option for maintenance/gas in hybrid case\n\n**Desired transmission** auto\n\n**Intended use:** I'm working as a civil engineer I need a car that can drive me around the sites inside the city with range of 100km-120km per day\n\n**Vehicles you've already considered:** Tesla model 3 2018 long range,  Tesla model 3 standard plus 2019 , hyundai ioniq 2019 \n\n**Is this your 1st vehicle:** yes\n\n**Do you need a Warranty:** no\n\n**Can you do Minor work on your own vehicle:** yes\n\n**Can you do Major work on your own vehicle:** no\n\n**Additional Notes:** So I'm a civil engineer planning to get my first ever car that I saved so much for . My range would be 21k USD I can't charge at my current apartment building and most chargers near me are 22kw with one 120kw but it's a bit far away so my options are 2018 tesla model 3 long range or 2019 Standard plus model 3 or hyundai ioniq 2020\n\nBoth tesla's are used with +100000 miles on it and ioniq 25000 miles",
            "Halp! Trying to decide between a 2015 Nissan versa note s+, 2015 Nissan versa note sv, or a 2014 Kia soul.  \n\nI don't know much about cars just how to fix them. Opinions please!\n\nAlso I'm trading in my 2003 Saturn ion for a down payment and these are the only vehicles in the tri-city area that have the features I want that are in my price range so please don't tell me so find something else. Unless you know of something mechanically inherently bad about these"
        ]
    },
    "General question Wednesday: Ask your general car-related question and maybe someone will have an answer.": {
        "title": "General question Wednesday: Ask your general car-related question and maybe someone will have an answer.",
        "score": 5,
        "url": "https://www.reddit.com/r/cars/comments/1djil5v/general_question_wednesday_ask_your_general/",
        "content": "**Please direct all choosing/purchase questions to the weekly car-buying sticky. All rules of** r/cars **apply here.**",
        "num_comments": 29,
        "comments": [
            "Do light bulbs from signal lamps and HID headlights go in the trash or are they recyclable?",
            "What is the cross-reference part number on NGK for the O2 sensors (both before and after cats) for the 2004 Lamborghini Gallardo?",
            "Was there ever any “active seat” feature commercially sold? \n\nI don’t really know how to name such a feature and was wondering why/why not it was never done. Basically I’m imagining the front seats having their own “suspension” so you would feel even less what was transmitted from the road. Road feel would obviously be 0 but for a high end luxury car it doesn’t really matter. \n\nI think there’s a similar system in trucks? Is it just a shitty idea? Not enough space to implement? Would make people car sick?",
            "[Car Accessories](https://u.pcloud.link/publink/show?code=VZbyQR0Z8WzwCCicyppyW45ejkzbx7HBq1qV)\n\nI have a Nissan Versa Sedan SV Special Edtion\n\nI want the car accessories in the images but they won't exactly enough fit my car. \n\nIs there something I can buy to make them fit or is there something alike I can buy?",
            "Long Term Idling Bad for Car?\n\nI have a 2013 Audi A5 with 50,000 miles on it. Sometimes, I like to work in my car with a nice view, essentially using it as a mobile office.\n\nWould it be especially bad for the car if I continued to do this frequently, for 1-2 hours a day with the AC on lightly?\n\nI'm uncertain if idling in particular causes wear or damage to parts, or if it's problematic compared to normal driving.\n\nReally appreciate any advice or input. Thanks in advance for any help.",
            "[removed]",
            "need some tire insight (maybe i'll ask again next Tuesday).\n\nI just bought a '07 GX470.  1 of the tire is older and more worn than the other 3 (2018 vs 2022).\n\nDo i just replace the 1 or should I opt to replace a pair?  The 1 old tire is getting close to aging out and it's showing signs of ozone/UV checking too.  Also, my spare is the original that came with the truck back in 2007 lol.",
            "All I hear about luxury cars is that they're a pain to maintain and are always breaking down. Do BMWs, Audis, and Mercedes really break down every year or so?",
            "what is the best body kit for my supra mk3 ?",
            "Need some advice on how to buy a car. Never done it before. I've owned 3 cars since I've been driving. One my dad gave me. One I bought for a grand from a co-worker. One I bought for a grand from some dude on Craigslist.\n\nLooking to actually get a new car now. I want to get either a 2025 Toyota camry or corolla. Depending on if I want to risk getting a hybrid or just get a gas engine. Anyways that's a different discussion.\n\nI want to know what I do to get a new car and not get taken advantage of or get ripped off.\n\nI have enough money to completely buy the car if that's the best way. Or I can put any amount of money down on it. I just want to know what I should do to not get ripped off or completely had by the dealer"
        ]
    },
    "Did you know a C5 Z06 is almost 100 lbs lighter than an FL5 Type R?": {
        "title": "Did you know a C5 Z06 is almost 100 lbs lighter than an FL5 Type R?",
        "score": 203,
        "url": "https://www.reddit.com/r/cars/comments/1dlj6x0/did_you_know_a_c5_z06_is_almost_100_lbs_lighter/",
        "content": "Kinda wild to think about a rear drive v8 weighing less than a front drive 4 cyl. Granted the new Civics are quite large and a C5Z is a 2 seater. Still it's impressive. ",
        "num_comments": 213,
        "comments": [
            "The FL5 Type R is also lighter than the 2024 Supra 3.0 (manual) by roughly 200 pounds. The MK5 is a dense car \n\n[https://www.caranddriver.com/honda/civic-type-r](https://www.caranddriver.com/honda/civic-type-r)\n\n[https://www.caranddriver.com/toyota/supra](https://www.caranddriver.com/toyota/supra)",
            "Since we're posting useless things:\n\nThe Evo is one of a very few USDM sedans that have a rear wiper. \n\n\nThe 2010 Lexus SC430 was the last car to offer a cassette deck.",
            "It's not even slightly wild, the cars are 20 years apart. The improvement in safety since then is what's wild",
            "The C5 Z06 is one of the greatest value drivers cars in the world.",
            "It's tiny, made of fiberglass, has an engine that is famous for its light weight, and was designed at a time when sports cars could basically be a tin can and still be street legal.  It would be weirder if it *wasn't* lighter than a modern tech-laden sedan.",
            "Not sure how a 20 year old Corvette weighing less than a new Type R is wild or surprising.",
            "The Tesla Model 3 and BMW M3 weigh about the same. Also the Hummer/Silverado battery weighs more than a whole Miata.\n\nThough, at this point in my life, I've driven lots of different cars and have stopped caring about weight numbers as much. I bet the FL5 Type R is pretty fun, and I know C5-7 Corvettes are all great too.",
            "I remember the first time googled car weights too.",
            "Now compare the C8 Z06 against the FL5 Type R lol. Cars are collectively getting heavier regardless of what it is. To really put things into perspective a C8Z weights roughly the same as an E90 M3.",
            "LS’s aren’t even that heavy…"
        ]
    },
    "‘They’re on track to having the worst quarter’: Expert says Honda’s new Accord is struggling. Here’s why it’s such a ‘flop’": {
        "title": "‘They’re on track to having the worst quarter’: Expert says Honda’s new Accord is struggling. Here’s why it’s such a ‘flop’",
        "score": 506,
        "url": "https://www.dailydot.com/news/honda-accord-sales-struggling/",
        "content": "It's almost like the only thing keeping the accord interesting were the fun engine options...",
        "num_comments": 430,
        "comments": [
            ">“New accord looks like a boring 9-5 office worker.”\n\nIt's designed like a modern Taurus.  More modern, just as infinitely boring.  Plus high interest rates, lack of engine options, and equally priced competitors.  As the article states the Civic isn't far off in size/features and looks way better.",
            "They gave it the USDM Passat treatment. Ugly, boring exterior, gutless 1.5T (outgoing 2.0T had 81 lb-ft more), Camry has a better Hybrid system and costs about the same, and the Civic looks better and is close in interior space",
            ">It's almost like the only thing keeping the accord interesting were the fun engine options...\n\nEhh, the 1.5T far outsold the 2.0T with the previous gen. Same story with the I4 vs. the V6 in the older generations. I think it's more to do with a few factors...\n\n1. The current Civic is finally big enough, and is a very good overall package for less money.\n\n2. The Civic looks much better than the new Accord.\n\n3. The new CR-V seems to be selling very well and is probably attracting potential Accord customers. Also has AWD. Not to mention, it also looks quite good.\n\n4. With the new Camry finally out, it has even stiffer competition.",
            "Of the modern accords the 9th generation was my favorite.   The 10th was awkward to me with what looked like a unibrow in the front and the lobster lights in the back.  This generation is just boring",
            "The current Accord is slower, uglier, and more expensive than the current Camry. It’s almost impressive how much Honda fucked up with it.",
            "I hate the new design, looks like crap compared to the previous model.  \n\nI’m starting to hunt for a 10th gen manual, over the last few years 9th and 10th gen manuals have become hard to find.",
            "1. Bland, boring, ugly design\n2. Boring, dark interior\n3. Road noise\n4. They're freaking HUGE now\n5. Lame 1.5 engine option\n6. Not the best hybrid system\n7. The new Civics are too good\n8. Interest rates are offensive",
            "I really don't like how they took a ruler to the interesting bits and made it look like a generic Unreal Engine 5 default asset.",
            "Had one for a few months. It’s alright at best. Pretty noisy on the road though.",
            "I love it, and was looking at picking one up.  Am I gonna end up with a depreciated loser down the line?"
        ]
    },
    "China has spent at least $230 billion to build its EV industry, new study finds\n": {
        "title": "China has spent at least $230 billion to build its EV industry, new study finds\n",
        "score": 140,
        "url": "https://www.cnbc.com/2024/06/21/china-spent-230-billion-to-build-its-electric-car-industry-csis-says.html",
        "content": "",
        "num_comments": 48,
        "comments": [
            "$230B over **14 years** according to the article, that's $16B/year to build a significant lead in a major high tech industry.\n\nThat's literally less than what the U.S. military spent on [keeping the AC running](https://www.theatlantic.com/international/archive/2011/06/us-military-spends-20-billion-air-conditioning-troops/352200/) in Iraq and Afghanistan each year.\n\nSounds like pretty good investment if you ask me.",
            ">The competition is so fierce that Bank of America analysts said this week that major [U.S. automakers should leave China](https://www.cnbc.com/2024/06/18/detroit-automakers-need-to-exit-china-bofa-analyst-says-.html) and focus their resources elsewhere.\n\nWhere can D3 go ? Only focus in Latin America ? Should they return India ? I don't think Detroit would easily give up China market because China is biggest car market, China market gives them much profit. It would be difficult if they only care Latin America and return India. \n\nBeside, if you want to talk sales would go more slump for Western automakers, Japanese automakers are really in trouble. Except Toyota and Nissan seem still able to stay, most of them could leave China soon. Like Mitsubishi Motor, they already lefts China.",
            "Sounds smart to invest in the future, no?",
            "GM saw China as it's giant cash cow before. But now, it's making millions of losses every year. The prediction is that it will only get even worse over time.\n\nI predict in 3 years GM will just outright pull out of China.",
            "TBF I’m curious how much Tesla was subsidized",
            "China heavily state subsidize.\n\nChina spends as much as 5% of its GDP on subsidies in 2022, more than any other countries.\n\n[Government subsidies don’t boost Chinese firms’ productivity | East Asia Forum](https://eastasiaforum.org/2023/09/14/government-subsidies-dont-boost-chinese-firms-productivity/#:~:text=A%202022%20report%20suggests%20that,policies%2C%20more%20than%20most%20countries.)",
            "Directed capitalism is the way.",
            "Number gonna be much much bigger than 230B.",
            "Good thing EVs aren't the future.",
            "This is why the US is now going against electric cars. The industry realized that China was years ahead of the US so now they are reverting back to ICE"
        ]
    }
}