{
    "$45k for a Ute": {
        "title": "$45k for a Ute",
        "score": 12,
        "url": "https://www.reddit.com/r/CarsAustralia/comments/1dr6i31/45k_for_a_ute/",
        "content": "I’m a dad who wants a Ute to throw mountain bikes and kids motor bikes in the back and I’ve just built a place so am going to have a ton of landscaping to do. Any advice on what to get for around $45k? I was thinking a triton but for no reason other than they don’t look so common as rangers\n",
        "num_comments": 87,
        "comments": [
            "Isuzu dmax presents good value for money and absolute reliability.",
            "How many kids do you have and what ages? Because you could copy Ross reviews and cop a falcon ute. If ya kids are younger and not tall look at and extended cab ute. Theyre way cheaper than duals and you get more tray space",
            "I'm in the process of buying a 2022 Mazda BT50 for $41k with fibreglass canopy and only 30k km. Pretty happy with this deal, i think something like this presents great value for OP. Otherwise, a similarly priced triton would present amazing value as you could probably find one with a lot more extras. I found that hilux's in this price range had a heap more km and even though they should be pretty rock solid, I liked the added surety of still being well within warranty and low km.",
            "Just use a beater? Can't really see the logical reason if its going to get bashed anyway",
            "Maybe a 2021-2022 Triton. They're reasonably reliable however can be a bit laggy (easily fixed with an iDrive or HikeIt). Only thing I would do immediately is change the intercooler hoses to silicone (costs $200) as they're prone to splitting, otherwise the 4N15 doesn't have too many complaints.",
            "Get yourself a 1997-2004 hilux for less than 20k and put the rest towards landscaping.These Utes will outlive you and your new home unlike any of the rubbish you buy today.",
            "Would you consider a Holden VE or VF ute?",
            "gwm cannon pretty sure you can get a top of the range under 40k with 7 year warranty.",
            "I fit 2 kids dirt bikes and my wr450 in the back of my 16 hilux no problem, I'd say any of them will do the job",
            "Ssangyong Musso Ultimate is a bargain."
        ]
    },
    "Thinking about one of these two... Any words of advice or encouragement? ": {
        "title": "Thinking about one of these two... Any words of advice or encouragement? ",
        "score": 19,
        "url": "https://www.reddit.com/gallery/1dr2cof",
        "content": "Tossing up between these two...or a 2021 Skoda Superb Wagon",
        "num_comments": 111,
        "comments": [
            "Volvo. XC90 is just about the most comfortable mass produced car ever.",
            "Definitely the Volvo. Those are re brilliant cars to drive",
            "Volvo all the way. Youd be hard pressed to find a better seat to sit in or audio system to listen to. The Volvo diesel is smooth (as far as diesels go, at least) and can get up and boogie when you need it to. \n\nThat colour stands out nicely above all the other white/silver/black SUVs as well.",
            "Make sure you get a pre-purchase inspection by a good mechanic. We were going to buy a 2018 XC90 and mechanic found it had a turbo leak so we ended up not buying it.",
            "The Volvo seems like a good option, although the Audi is by far the nicest of the 3, although has quite a few kilometres.",
            "Redriven had both of them on their worst cars of 2023 list so...\n\nNo opinion personally but worth watching their reviews as they're quite well researched and will give you something to think about.",
            "Got both of these cars. The Q7 is more comfortable with the air suspension, than the XC90. Although, the XC90 looks nicer in my opinion. Driving both of these cars, if I had to choose one only, I would take the Audi. Hope that helps.",
            "6 year old Audi right out of warranty with highish km. Why do you think the owners are selling it?? Offloading a nightmare. Endless money pit from the criminal car company VW.",
            "Honestly neither. Luxury cars north of 100k KMs is playing financial Russian roulette. Lexus is probably the exception since the engineering is fairly conservative/simple and you can get hands on parts fairly easily. \n\nIf you had to, then I'd take the Volvo. That Audi I would not touch with a very long stick.",
            "Had a Volvo T8 R Design.. an absolute sleeper on the road and does so in complete comfort. It was also fairly reliable for a euro."
        ]
    },
    "Would you get it?": {
        "title": "Would you get it?",
        "score": 34,
        "url": "https://www.reddit.com/gallery/1dqycqf",
        "content": "",
        "num_comments": 88,
        "comments": [
            "Looks great and probably goes hard but the amount of mods is something I wouldnt want to need to maintain. Anyone looking to buy it should probably make sure they can get a rwc before committing to buy, be a pretty expensive shed filler if you found out the hard way you cant get it registered.",
            "Personally I don't understand why you'd say it's registered until October but then because of the mods done you're selling it unregistered",
            "I wouldn't get a $58000 dollar vehicle without a test drive other then that it's probs a good thing",
            "Not for that price.\n\nIt's essentially unregisterable in it's current state.",
            "Well it'll certainly divide opinions",
            "No test drive, says it all to me. The car can have rego until whenever, it's probably broken somewhere (I understand he doesn't want tyre kickers, but no test drive tells me the story I need to know).",
            "Thrashed and with out a RWC? No thanks",
            "I would have to see it in person to see if the workmanship is done correctly, and I would ask if the head gasket was done or did they just pull bolts out and put studs in that will end in tears",
            "100% would buy this its an absolute weapon have seen it perform myself at powercruise and snaps heads. built by a very well known company with top dollar parts its beautiful and for everyone whinging and whining about no test drives if you had a 750hp car and some young cocky bloke came to have a look and take it for a test and it didnt come back cause either 1 its been stolen or 2 its been wrapped around a tree a few blocks up what would you do?",
            "I wouldnt but if hypothetically I was after exactly that, sure.\n\nGranted he has invoices for all parts and labour. Would expect a dyno chart too."
        ]
    },
    "What are some questions you should be asking when buying a second hand car for the first time?": {
        "title": "What are some questions you should be asking when buying a second hand car for the first time?",
        "score": 4,
        "url": "https://www.reddit.com/r/CarsAustralia/comments/1dr86bk/what_are_some_questions_you_should_be_asking_when/",
        "content": "Finally saved enough money to buy a decent second hand car but I know next to nothing about cars? What are some questions I should be asking the seller before buying?",
        "num_comments": 10,
        "comments": [
            "Service history and repairs with receipts if possible is my biggest one",
            "First question you should ask is if theyre alright with you getting a mechanical inspection done on the car, if they say no then look for a different car.",
            "I always ask up front if theres anything I should know about the car, give them a chance to be forthcoming with essential information they didnt put in the ad. And then pay for a mechanic to go and do a pre-purchase inspection. From memory last time I did one it mightve been around $300-400 (dont quote me on that), and they gave me a 10 page report on the car. \n\nAlso just use your eyes, ears, and intuition when you inspect the car, if something seems off and you ask a question and the answer doesnt satisfy you - walk away.",
            "My first question is always the same. Was it ever smoked in? They usually lie though when it has been because smokers think we cant smell it because they cant. \n\nThen theres date code on tyres, maintenance records etc. Other questions I ask depends on car and age such as does it have 2 keys/fobs.",
            "Research the model, find out what needs doing and when the  ask for proof that's it's been done, this should include any major recalls. \n obviously  check the history on the vehicle to make sure it's not been stolen, written off or has finance owning, check that through the various online options and don't take the sellers word.",
            "How long they owned it? Does it have service history? Does it use any water or oil? Does motor get hot? Any oil leaks? Has it ever been in a crash or been repaired?\nAlso ask for Vin Number so you can do a PPSR check at ppsr.gov.au to check if there is any security interest/money owing and also if ever been in a crash where insurance was notified.",
            "Ask them on the phone if they smoke. That'll save you a trip to go see it.\n\nEven if they don't smoke in the car, it'll smell and you can't get it out. If they have smoked in the car it's basically trash.\n\nAlso, tires. One of the first things I look at. If I see Conti/Michelin/pirelli/Bridgestone etc it's a good sign to me. If I see $100/corner Linglongs or Radars then I'm usually out of there. If you can't be arsed spending a little more money on the only thing touching the road what other corners have been cut.",
            "Why are they selling?\n\n\nYou can usually smell bullshit a mile off\n\n\nAlso, flick the hood. Check oil cap, fluid levels etc. as a minimum.",
            "I second this. I sell cars, I can happily admit it. \n\nBefore even coming in, call up, and ask them to send pictures of the service history of the selected car. Also ask about the Registration and how much is left on it. To see if they're bull shitting you. Go onto your states rego check and see if how much there's left on it. If the numbers don't add up don't trust the guy.\n\nDo that even if you're buying private.",
            "Has it been in any accidents?\n\n\nHave you checked out the ReDriven website or their YouTube channel? Plenty of excellent resources there and I'm sure whatever car you're thinking of buying, they'll have made a video on it."
        ]
    },
    "Tyre Size Doubt": {
        "title": "Tyre Size Doubt",
        "score": 4,
        "url": "https://www.reddit.com/r/CarsAustralia/comments/1dr79ms/tyre_size_doubt/",
        "content": "Guys, I bought a Corolla series ZRE152 and the mechanic who inspected the car advised me to change the back tyres as one of them is at its limit. I went to have a look and all 4 tyres are 205/65R15 94H, but as I looked the spare, a brand new tyre, I believed it came from the factory, it’s 195/65R15 91H. I just noticed that because as I went to buy online the tyres, I use Tyroola, it came up that the tyres I was trying to buy weren’t specific for my car! I’m lost now, because it also said ai should take in consideration the tyre that are fitted in the car. Would someone smarter share some thoughts about it? Thanks a lot",
        "num_comments": 10,
        "comments": [
            "They came from the factory with 195/65R15's.",
            "Aftermarket rims on it? 195 65 15 sounds about right for steelies with hub caps\n\nProbably been changed for fatter tyres somewhere along it's lifetime due to availability / price etc",
            "You can put the new 195s on the rear and keep the 205s on the front until they also need replacing... or buy 205s for the rear. It's only 10mm difference. The last owner probably bought 205s because they were either cheaper, in-stock, or wanted a wider tyre. Don't over think it.",
            "Depends on what trim OP got; my 2011 Conquest sedan came with 205/55/R16 as standard",
            "So should I change back to 195? Because I feel that the  Id have to change all 4? Or I can keep 205?",
            "Thanks a lot !ate! I wasnt sure if Id have to buy 4 new tyres so all would be the same! I was afraid also regarding wheel rim as I can see it fits 205, but will it fit a 195? My fear is as Im getting it online, the  mechanic refuse to fit for the wrong size! I had a looked in few past post over here and I came up with this situation in a older post!",
            "OP states he has 15's.",
            "Nah get the 205s, 2,for the back",
            "195 will fit the original wheels. \n\nI looked up a 2008 corolla on carsales and the wheels are 15x6 inches. It can take 175-205mm tyres (ideal size 185-195mm) according to tables found with Google.",
            "So much incorrect info. \nYou must go by the tyre plaque fitted to the car. This is the only legal option. \nIf you fit any different size to the car you must notify your insurance company as it is a modification. Failure to do so can render you not covered in the event of an accident. \nTyre shops will usually not fit incorrect sized tyres, because in the event of an accident they can be liable. \nYou cannot fit different tyre sizes front and rear unless the tyre plaque states this. \nIf you have aftermarket wheels fitted, there are vehicle standards that vary by state. All of these are modifications and must be disclosed to insurance agencies. \nFitting oversized tyres to rims different to the tyre plaque will change the overall diameter of the wheel/tyre combination. \nA 195 65 15 is A\nA 205 65 15 is  B\nDiameter\n635 A\n648 B\n+2%\n\nSidewall height\n127 A\n132 B\n+4%\n\nRevs/km\n502 A\n492 B\n-10\n\nYour speedo will show a lower speed. So you will be doing more than indicated. \nThis is because you haven't just changed the width. You have also changed the height. When you read tyre size, the 1st number is the width in mm.  The second is the height expressed as a percentage of the width. And the last is the internal diameter in inches. \nSo 195 65 15 means\nWidth is 195mm, height is 65% of 195 which is 127mm and internal diameter is 15\"\n205 65 15 is a width of 205, a height of 65% of 205 which is 132mm and an internal diameter of 15\".\nYou may find that in most states this makes the vehicle unroadworthy. \nSource - I am a mechanic"
        ]
    }
}