{
    "Monthly random discussion & queries thread on cars...": {
        "title": "Monthly random discussion & queries thread on cars...",
        "score": 3,
        "url": "https://www.reddit.com/r/CarsIndia/comments/1d5ajr1/monthly_random_discussion_queries_thread_on_cars/",
        "content": "This thread is for random discussion about cars in India and the rest of the world, and also for all the queries. No abuses, just the friendly banter.. \n\n[\\[Past RDT posts\\]](https://www.reddit.com/r/CarsIndia/search/?q=random+discussion+thread&restrict_sr=on&sort=new) \\- [\\[Discord server\\]](https://discord.com/invite/Q9nSrDn6tE)\n\nHelp out fellow redditors if they ask any queries here. Keep a watch on comment count of this post! \n\n[\\[Sub description post\\]](https://www.reddit.com/r/CarsIndia/comments/1awdqir/welcome_to_carsindia_description_in_comments_here/) \\- [\\[Indian Bikes sub\\]](https://www.reddit.com/r/indianbikes/)\n\nWhich new car to buy queries should mention ex-showroom or on-road budget, highway or city usage percentages, city of use etc for better response. Make sure to follow both reddit website rules and this subreddit rules while posting and commenting in this subreddit.",
        "num_comments": 60,
        "comments": [
            "Hey guys,\n\nI’m planning to buy a 2018 Brezza ZDi as my first car for ₹6.60 lakhs. This car has clocked about 95,000 km. I took a 5-year loan of ₹5.60 lakhs after making a downpayment of ₹1 lakh. I know I could’ve paid more as downpayment, but I kept ₹1 lakh in reserve just in case there are any repairs needed after the purchase.\n\nI took the car to a Maruti dealership for a check-up, and the mechanic there said I don’t have to worry and should go ahead with the purchase. I visited the dealership twice, drove it, and also took my family around in it. My parents really loved it and felt it was so much better than our family car, a Hyundai Eon. \n\nI’m really excited about this purchase, and so are my parents. Would love to hear your thoughts and any advice you might have!",
            " So I went ahead and booked i20 2024 facelift model Sportz (o) ivt for 11.35 lc on road. But the delivery is getting delayed so meanwhile the showroom people told me that they have a discount on another varient that is 2023 model. This is 2023 pre facelift modal Asta (o) dct which they are quoting 12.50 lc on road. Feature wise 2023 model, being asta is an upgrade in every regard, be it projector headlamps, full letheratte seats and driving wheel, alloy wheels, rear wiper, the bigger infotainment setup etc. now I am confused should I go for the 2023 dct for that price or just save that extra 1 lakh and take the sportz 2024? \n\nP.S. I’m looking only for automatics.",
            "** Baleno vs. i20\n\nHi guys.\nThinking of buying a hatchback in the 9-11 lakhs range.\nMore or less narrowed it down to Baleno or  i20. (Most likely MT, One below the top variant)\nWhat are your opinions?\nIn particular, I would like some info and/or personal experience on the engines.",
            "**Need Advice: Dealer Offering discount on Display Car for Hyundai Verna DCT SX(O)**\n\nHi everyone,\n\nI recently booked a Hyundai Verna DCT SX(O) and the dealer quoted ₹21.25 lakhs on road (including discounts). A couple of days after booking, the Sales Manager called me for an appointment and came to my home with an offer. They offered an additional ₹50K discount and a mini ceramic coating if I'm willing to take the display car.\n\nThe car in question was manufactured on April 25, 2024, and according to the dealer, it's never been driven. I've seen this car in the showroom during my previous visits.\n\nWhile I'm tempted by the additional discount, I'm also concerned about why they are so eager to reduce the price. Is there a hidden issue with the display car that I'm missing? I'm planning to bargain further, but I want to be sure I'm making the right decision.\n\nAny suggestions or insights would be greatly appreciated!",
            "Hi guys need an opinion what do i put in my virtus 1.0l tsi at 0w20 as the company suggests or 5w30 which would be more in line with the hot weather i stay in (Nagpur) also fully synthetic or semi?",
            "This is a recurring scheduled post of the subreddit, start a discussion or a query by commenting in this post. Thank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CarsIndia) if you have any questions or concerns.*",
            "I am looking for automatic cars under 12-12.5L exshowroom price for a family of 5. My preferences are \n1. Android Auto is a must. Preferably wireless\n2. Reverse Parking camera is a must\n3. Hopefully no arm rest in the back seats\n4. Head support and three point seat belt for middle seat passenger\n5. Occasional highway rides",
            "Can't believe the hate Tata gets in this sub. The sub is unbearable for a Tata car owner like me. \n\n\nMy experience with my car has been amazing so far, I don't want to ruin it because of this sub, so leaving it for better.",
            "# Which one should I go with Topline MT (ES) 2024 or Topline AT 2023 (July) ?\n\nI'm stuck between two options: the Topline MT (ES) 2024 and the Topline AT 2023 (July). Both are priced at around 17.5 lakhs.\n\nShould I just go for the 2023 model? The salesperson says the showroom got it in April 2024 and can show me the receipt.\n\nI could really use your advice on this. Is the 2023 model the way to go, given the similar price?\n\nAny thoughts or suggestions would be a huge help!",
            "Any idea on how to get rid of rats from my car?\n\n\n\nI have tried everything from rat sprays to devices to using tobacco, but nothing works. Almost having my car towed every 2 months once"
        ]
    },
    "Monthly Modifications/Tuning/Customisations/Accessories thread": {
        "title": "Monthly Modifications/Tuning/Customisations/Accessories thread",
        "score": 1,
        "url": "https://www.reddit.com/r/CarsIndia/comments/1dqihxg/monthly/",
        "content": "What changes did you do to your car in the last 30 days? Discuss any Modifications/Tuning/Customisations/Accessories you are planning or done to your car here!",
        "num_comments": 1,
        "comments": [
            "This is a recurring scheduled post of the subreddit, start a discussion or a query by commenting in this post. Thank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CarsIndia) if you have any questions or concerns.*"
        ]
    },
    "15k kms done .AMA": {
        "title": "15k kms done .AMA",
        "score": 159,
        "url": "https://www.reddit.com/gallery/1dr345s",
        "content": "Completed 15000kms in 9 months with the innova hycross. Its the VX(o) 7 seater variant. \n",
        "num_comments": 95,
        "comments": [
            "Does the small tyres affect the ride quality",
            "How often do you clean your car? Have the same color hycross and my god it’s a pain. Every short drive gets it dirty. This is our first non white car too.",
            "Average?",
            "Did you get seat covers? The synthetic fabric makes my back sweat. I don’t know if getting perforated seat covers will help.",
            "Did u change the stereo setup",
            "Kitne detha hain",
            "Wheels chote lagte hai bas bakki gaadi badi hai",
            "Hello Congratulations...  \n1. How is the body roll ?  \n2. The suspension over bad roads.   \n3. Seat comfort & Ventilated seats ?   \n4. AC performance.   \n5. Uphill drive \n\nThink that's too many questions in one go....:-)",
            "Isn’t fuel tank small for vehicle of this size ?",
            "How much should your income be per month to afford this without any budget problems ?"
        ]
    },
    "Bought Skoda Slavia!": {
        "title": "Bought Skoda Slavia!",
        "score": 142,
        "url": "https://i.redd.it/8wrohetvlf9d1.jpeg",
        "content": "Hi guys! I am so ecstatic to say that I bought Slavia 1.0 Style MT. - What are the things that I should know? (Picture is from another guy taking delivery, not mine. It will be delivered in August as I have chosen Lava Blue)",
        "num_comments": 41,
        "comments": [
            ">Picture is from another guy taking delivery, not mine.\n\n💀",
            "What will it be costing you on road? Do tell about the discounts since I am planning for it too!",
            "Awesome OP lava blue colour is on point, but according to some sources facelift is coming next year not sure about if you need it rn you should go for it ps: I’m buying virtus in August",
            "Isn't style discountinued",
            "[OC]",
            "Congrats 🎉🎉 bhai",
            "W",
            "Hey man, congrats for the new ride. I just wanted to ask that what made you choose it over the vw virtus?",
            "One day I would earn Enough to buy the top variant with sunroof 1.0 MT and would be able to tolerate it’s cost too😇",
            "Is there any specific reason to not buy 1.5?, just curious. Btw congrats"
        ]
    },
    "Your Thoughts On My Build , Is It Ricer ?": {
        "title": "Your Thoughts On My Build , Is It Ricer ?",
        "score": 58,
        "url": "https://www.reddit.com/gallery/1dr5nsp",
        "content": "Performance wise its a code 6 bmc air filter , choina valvetronic setup , and lowering springs for better stability , it is a 1.0 base variant so i didn’t actually throw a lot of stuff away 😄",
        "num_comments": 42,
        "comments": [
            "topa gela hogaya 💅🏻",
            "That decal on the rear doors legit triggered my Missing Tile Syndrome 😭",
            "Nah it looks classy but only thing is that smiley kind of black sticking on the back panel and door is kinda over the top but overall good build",
            "Am I the only one that thinks it looks better without a spoiler.",
            "Oc",
            "I’ve seen your car in a youtube video. Got some good mods😮‍💨😮‍💨",
            "Saw you on YouTube, Fuel Injected. \nEverything's good, I judt want to know about how you painted the dash and when upgrading everything why not the original headlights from the top variant ones?",
            "That car is looking good boi",
            "Hello Ye__boi! If this post is your original content then mark or comment as [OC]. Else please give the source link as a comment in the post. Thank you.\n\nAll users are requested to downvote the low quality posts. Memes, pics, accident videos, buy/sell, car recommendations, etc can be posted on the [discord chat server.](https://discord.com/invite/Q9nSrDn6tE) Any repair queries should go to /r/MechanicAdviceIndia. Motorbikes related posts should go to /r/IndianBikes subreddit. Also please report the content you see breaking the rules so that we can act on it. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CarsIndia) if you have any questions or concerns.*",
            "Place and cost pls"
        ]
    }
}