{
    "Weekly Rant & Goals Discussion Thursday June 27": {
        "title": "Weekly Rant & Goals Discussion Thursday June 27",
        "score": 1,
        "url": "https://www.reddit.com/r/CarSalesTraining/comments/1dps0e1/weekly_rant_goals_discussion_thursday_june_27/",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Just Got Officially hired at a Toyota dealer in California. Any tips and advise on what to expect and some do’s and don’ts in the first week(s)??? I want to make a great first impression.": {
        "title": "Just Got Officially hired at a Toyota dealer in California. Any tips and advise on what to expect and some do’s and don’ts in the first week(s)??? I want to make a great first impression.",
        "score": 16,
        "url": "https://www.reddit.com/r/CarSalesTraining/comments/1bw695t/just_got_officially_hired_at_a_toyota_dealer_in/",
        "content": "Excited to start my new journey. Don’t any prior car sales experience, but I do have several years of Retail management experience, and I’m fully aware that providing excellent customer service is a must if you want those valuable repeat buyers and referrals. Do you guys see green newbies in your dealers take a notebook to take notes or just try to have mental notes???? Or is that not a great idea? I’d love your input. This is an awesome community. Thanks in advance for your time in answering my questions,",
        "num_comments": 31,
        "comments": [
            "#1 listen to your customer listen to what they say try to understand what they’re looking to accomplish.\n# 2 if you’re just not sure what you can do for them just ask (tell me what I can do to make this work out for you)\n#3 you must ask for the sale at some point when you can see they’re happy with the car and they’re interested say to them would you like to buy it that’s too often forgotten.\n#4 it’s great to have your product knowledge but it’s even better to have people knowledge know what you have in front of you????? what I mean by that is understand your customers motivations and know what they want understand their desire for the car and what they’re trying to accomplish armed with that information you can work miracles.\npeople do business with people they trust do not lie to your customer tell them the truth you are entitled to a profit but you never tell them what that profit is.\n#5 do not sit around in coffee clutches and gab about the store and about your lousy customers and your lousy management stay busy make phone calls by the door do whatever you can to get in front of people it is a numbers game.",
            "I'm on my 3rd week so far and I've sold 5. The paperwork is my issue. Nobody showed me what exactly we need in the jacket so I printed everything and let them toss what they didn't need. \n\nDon't be pushy but assume they're gonna drive the car and assume they loved it. A little enthusiasm has built me some good customers for the future. \n\nI talked to a couple I sold a truck to today for 2 hours about everything from kids, vacation destinations, home maintenance to the upcoming eclipse. Sold them the truck about 45 mins into that conversation.",
            "Don’t be afraid to say you are new. Everyday cars are on sale. Make sure you can tie balloons",
            "I'm in the northwest. Lots of rain and lots of snow. People come in anyway. Heavy wind is about the only weather that makes us slow. So follow up. Big key in sales. Then it doesn't matter what the weather is like. You will have customers.",
            ">I’m fully aware that providing excellent customer service is a must if you want those valuable repeat buyers and referrals. \n\n\n(Most) Toyota and Honda buyers will go the next dealership who can give them Free all season mats or another $100 discount.\n\n\nYou can build relationships but it's becoming more of transactional than \"I know a guy/gal who will take care of friends.\"\n\n\nStay active and don't want listen to negative Veterans who will tell you \"this place sucks\" somehow they are still there 12 years later. \n\n\nYes, take notes and if you're shadowing, be a shadow and don't say anything to jeopardize sales person deal. \n\n\nFor the 1st 60 days it's better to have a half than 0 deal. So turn your customer to another sales person before they leave. ",
            "I agree with everything the other poster wrote.. \nI would say the short list of things I didn't know when I was Green, that I found out after leaving the business.. \nCustomers would probably rather have their teeth drilled by a dentist rather than step on a car lot.. they are all,.. every last one of them warm prospects that cost an arm and a leg to bring on the lot..  most of them are scared that they will get taken advantage of (and for good reason.)\nIf you give them too many choices, they get paralysis of analysis, but if they don't get enough information, they'll never feel ready to commit to one vehicle/dealer. Three is about ideal,  letting them bump themselves up from the lowest to the highest ..\nCustomers typically know whether they want to buy from you within 10 seconds after meeting you.. so be genuine and be likable( literally be the new guy forever).. stay off politics and find the common ground,.. really listen to their pain points!!..  they're not buying a car for kicks.. \nAside from that I would just say to do you're very best to be crisp like Jake from State Farm, and never underestimate the power of great hygiene, extra shoes to rotate (because you'll be in them 12 hours a day.. imagine sitting in a test drive in a sealed car in July with the air running recyclingthe atmosphere of your sweaty feet! )a Listerine strip and a very subtle and lightly-applied clean smelling cologne. \nAfter you pass that hurdle, there's a million things you can do to say to blow a done deal.. so don't overdo it..\nDid I say Short list?? 🤣 lmao",
            "All kinds of advice: [https://www.youtube.com/playlist?list=PLVLjreHO7381rUO0JEJNfi0Ve2kHKoKcj](https://www.youtube.com/playlist?list=PLVLjreHO7381rUO0JEJNfi0Ve2kHKoKcj)\n\nNorCal or SoCal?",
            "I'm on the same boat man. Wishing you the best and willing to share any ideas. I'm 24m and started at Toyota near me. Good luck and hope to connect if I have any question",
            "I’m just wondering which Toyota🌚",
            "Thank you. Appreciate the advice"
        ]
    },
    "Am i at the right dealership? Right job?": {
        "title": "Am i at the right dealership? Right job?",
        "score": 3,
        "url": "https://www.reddit.com/r/CarSalesTraining/comments/1dr2j0w/am_i_at_the_right_dealership_right_job/",
        "content": "So pretty much I took a car sales job at a dealer that does primarily new car sales selling around 125-140 cars a month. This was taken instead of a 9-5 desk job that would pay 52k annual that sounded boring af.\n\nCurret payplan: 16/hr , scheduled for 40 hrs but typically 45-50 hour weeks.\n\nTiered commission but for simplicity, first 7 cars no commission, 8-12 makes 300 each, 13-17 makes 325, 18-22 makes 350, 23+ makes 375. Not retro.\n\nCsi 95% across the board to get any manufacturer bonus per survey (250$)\nAnd tiered back end 1% for first 7 ,2% (8-12), 3%, 4% ,5% etc.\n\nWill i ever see back end or csi pay? Or is it a bad plan ",
        "num_comments": 2,
        "comments": [
            "If the hourly isn't a draw then I don't think it looks terrible, although I'm not a fan of flat rate pay structures...kinda removes the point of holding gross and making more for the company.\n\nAssuming you make 45 hrs/week × $16/hr ($37,440 /year) + (12 cars/month × 300) × 12) = $80,640/ year. I don't think that's too bad for 40 - 45 hours a week.\n\nThe only question at this point is; how many reps are there?",
            "8-12 make $300 each, but the first 7 don't get anything. That's how I read \"not retro\".\n\nTerrible plan."
        ]
    },
    "Patriot act": {
        "title": "Patriot act",
        "score": 3,
        "url": "https://www.reddit.com/r/CarSalesTraining/comments/1dr0gwm/patriot_act/",
        "content": "Friend of mine bought a Honda minivan in South County STL, the dealership made him sign a document stating that he wasn't a terrorist and it was part of the patriot act...question is...whats up with that? I've never heard of anything like that ",
        "num_comments": 3,
        "comments": [
            "OFAC list has been a thing for a long time. Mandatory since 2001. Not all dealers tell you about it. Not required to tell you're doing it. Required to do so.",
            "Murica",
            "It also doesn't require a signature. Some dealers will have customers sign a credit application using the OFAC excuse and then pull their credit."
        ]
    },
    "Got let go": {
        "title": "Got let go",
        "score": 1,
        "url": "https://www.reddit.com/r/CarSalesTraining/comments/1dr57n8/got_let_go/",
        "content": "Just got let go for not meeting the dealerships standard. \n\nI was a trainee.\n\nI was trained by my manager first month did 13.  \n\nSecond month manager quit\n\nMy sales were 5, they hired two other trainees while I was there.\n With experienced we had 5 total. \n\nWas barely trained tbh never had any role play, no proper training run through (in my opinion) \n\nCried a little, really liked the people there. \n\n\nI did sort of also shit where I ate, one of the trainees was a girl, kinda kf liked her and got jealous, \n\nThat threw me off a lot of days. \n\nKinda hate myself, dealing with overcoming jealousy as well. \n\nWhat would you do? ",
        "num_comments": 4,
        "comments": [
            "If your manager who help you get 13 quit, that's your red flag to raise eye brows. See if you can get in contact with him and follow his lead. And don't Ever fall for heels near wheels, more test drives than who actually buys. Apply for another dealer",
            "So you were there for a total of 2 months?",
            "What do you mean by \"more test drives than who actually buys\""
        ]
    }
}