{
    "Monthly random discussion & queries thread on cars...": {
        "title": "Monthly random discussion & queries thread on cars...",
        "score": 3,
        "url": "https://www.reddit.com/r/CarsIndia/comments/1d5ajr1/monthly_random_discussion_queries_thread_on_cars/",
        "content": "This thread is for random discussion about cars in India and the rest of the world, and also for all the queries. No abuses, just the friendly banter.. \n\n[\\[Past RDT posts\\]](https://www.reddit.com/r/CarsIndia/search/?q=random+discussion+thread&restrict_sr=on&sort=new) \\- [\\[Discord server\\]](https://discord.com/invite/Q9nSrDn6tE)\n\nHelp out fellow redditors if they ask any queries here. Keep a watch on comment count of this post! \n\n[\\[Sub description post\\]](https://www.reddit.com/r/CarsIndia/comments/1awdqir/welcome_to_carsindia_description_in_comments_here/) \\- [\\[Indian Bikes sub\\]](https://www.reddit.com/r/indianbikes/)\n\nWhich new car to buy queries should mention ex-showroom or on-road budget, highway or city usage percentages, city of use etc for better response. Make sure to follow both reddit website rules and this subreddit rules while posting and commenting in this subreddit.",
        "num_comments": 60,
        "comments": [
            " So I went ahead and booked i20 2024 facelift model Sportz (o) ivt for 11.35 lc on road. But the delivery is getting delayed so meanwhile the showroom people told me that they have a discount on another varient that is 2023 model. This is 2023 pre facelift modal Asta (o) dct which they are quoting 12.50 lc on road. Feature wise 2023 model, being asta is an upgrade in every regard, be it projector headlamps, full letheratte seats and driving wheel, alloy wheels, rear wiper, the bigger infotainment setup etc. now I am confused should I go for the 2023 dct for that price or just save that extra 1 lakh and take the sportz 2024? \n\nP.S. I’m looking only for automatics.",
            "Hi guys need an opinion what do i put in my virtus 1.0l tsi at 0w20 as the company suggests or 5w30 which would be more in line with the hot weather i stay in (Nagpur) also fully synthetic or semi?",
            "This is a recurring scheduled post of the subreddit, start a discussion or a query by commenting in this post. Thank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CarsIndia) if you have any questions or concerns.*",
            "Hey guys, any suggestions for accessories for my 2024 taigun gt ? Something that will really elevate my experience with the car?",
            "Hey all! Our current car (Zen Estilo) is going to retire as per road guidelines in NCR (15 years). We need to buy a new one before end of year. I currently am working in a city away from my family and for the next 1-2 years my father is going to drive, post which I might be driving it. Parking space is limited so he is suggesting we buy a wagon-R type car (paid parking is an option if the car is very suitable).\n\nHowever, a car being a fairly long term investment, I think we should go for a sedan or compact SUVs. Uses: city commute (Gurgaon), highway drives. Primary concern is safety, versatility + durability on Indian roads and comfort. Considering AGS fully manual works as well (again if the car is good).",
            "Can you suggest a car under 8 lakh on road ",
            "Need suggestions,\nPlanning to buy a used car at budget of 2-2.5lacs, mostly looking for a hatchback car like alto CNG but finding CNG car is difficult in this budget, I have other options like datson go, beat, alto petrol and kwid what should i do?\nI drive about 800kms monthly.",
            "Need suggestions for my father regarding car 12 lakhs on road petrol car. My father is thinking for  Mahindra 3XO and want to look for more options.",
            "Hey everyone, Just recently bought the MG Hector plus top model and overall am quite satisfied with the car. Only thing is that the seats sometimes feel a little uncomfortable. Is there any way in which seats can be modified/changed without having to completely replace them? Any help would be appreciated thanks.",
            "Hi y'all. This is specific to the VW Virtus GT - so there is this known issue where the DSG gear box gets confused between 1st and 2nd gears at low speeds, especially after you've slowly gone over a speed breaker. It will randomly go into 1st gear even though you have enough speed to be in 2nd. Is this issue common across all Virtus owners and if yes, is there a fix, something the service center can do? Also, my AC makes a weird sound, like a low hissing sound which keeps coming and going. My SA mentioned that it can be fixed during servicing but I am not so confident. Does anyone know what the issue may be / possible fix?"
        ]
    },
    "Monthly Modifications/Tuning/Customisations/Accessories thread": {
        "title": "Monthly Modifications/Tuning/Customisations/Accessories thread",
        "score": 1,
        "url": "https://www.reddit.com/r/CarsIndia/comments/1dqihxg/monthly/",
        "content": "What changes did you do to your car in the last 30 days? Discuss any Modifications/Tuning/Customisations/Accessories you are planning or done to your car here!",
        "num_comments": 1,
        "comments": [
            "This is a recurring scheduled post of the subreddit, start a discussion or a query by commenting in this post. Thank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CarsIndia) if you have any questions or concerns.*"
        ]
    },
    "average mahindra owner ": {
        "title": "average mahindra owner ",
        "score": 723,
        "url": "https://v.redd.it/10zxv4nzrg9d1",
        "content": "",
        "num_comments": 106,
        "comments": [
            "Trust me it's not his fault. If he doesn't go fast it's gonna stop his car.",
            "Sab log car wale ko hate kar rhe h par koi yeh baat nhi kar rha ki aisa huya hi kyu ? Reason h government jo 1 din ki baarish ke baad yha baad aa jati h",
            "\"WE LIVE YOUNG WE LIVE FREEE WE ARE THE LIVING\" 🎶",
            "Not his fault. He had to maintain that much speed to pass through it without the car turning off.",
            "What does it has to do with car model or company?\n\nAny brand's any four wheeled vehicle would've been doing the same in this situation!",
            "Is this a trend to crap on car brands you don't like? What are you expecting him to do? Go at 5kph and risk damage to his own car?",
            "Avg carsindia braindead karma farmer🫶🏾😁",
            "Is this M&M hate post ? \nWhy not blame the government or the municipality rather then hating on a greater chunck of SUV owners in your own country ?",
            "Why are people hating on this guy? If he stalls or something it's game over for him. Better to get out of there quickly",
            "What was the Mahindra supposed to do? Slow down so that water gets into the engine and then he can also drown his vehicle like the rest of the vehicles there and share their owners pain in the name of communism? 😒"
        ]
    },
    "Was driving cousins baleno for a short market run, and this happens.": {
        "title": "Was driving cousins baleno for a short market run, and this happens.",
        "score": 235,
        "url": "https://v.redd.it/r91oianw9h9d1",
        "content": "Guy got off his bike and tells me, \"Bhai mitti ud rahi thi, brake nahi laga paaya aur aap saamne aagaye\"💀. Then he said sorry and I went on to getting it fixed. \n\nGrocery Cost: 180 (Vegetables)\nRepair Cost: 900. \n\nHappy Saturday.",
        "num_comments": 63,
        "comments": [
            "biker accepting his mistake is a rare site to witness",
            "What’s happening in this video? Which way is the traffic supposed to flow? I see a divider in the middle, so it’s not supposed to be two way road. But, autos are parked near the divider. So, this is a two way road!? The cars on the other side are parked in the direction of flowing traffic. If this is a service road, it’s a big one! This is confusion overload.",
            "In an ideal world, where everyone follows the traffic rules, it would be the mistake of the car driver. I may get a lot of hate for this, but hear me out. When merging from a side road on to a main road, the driver on the main road has the right of way and priority over other traffic. While merging, it's the responsibility of the person who is merging to make sure that it is safe to merge. Ideally one should merge such that the traffic on the main road is not impeded, i.e. that person should not have to brake. But we don't live in an ideal world and this sub is the best example for it.",
            "Abbeh to teri galti thodi thi he was not wearing helmet… Bewakoof insaan tujhe bolna tha na dashcam laga huwa hai usne helmet nahi pehni hui hai… Usse paise maangne the and if uncooperative then you should have told him you will take him to Police Station",
            "It looks like he had the right of way. Don't be this stupid when merging into the main traffic.",
            "Count your stars that he didn't fall and die. Why are people so much retarded.",
            "Usko bola ki nai helmet elbow guard nai hota  😏",
            "Seems both are at fault.",
            "Dude i guess its your fault....",
            "I do feel bad for the biker but he wasn't wearing a helmet (agree it maybe hot and all but still, it would've solved his issue!"
        ]
    },
    "Your Thoughts On My Build , Is It Ricer ?": {
        "title": "Your Thoughts On My Build , Is It Ricer ?",
        "score": 331,
        "url": "https://www.reddit.com/gallery/1dr5nsp",
        "content": "Performance wise its a code 6 bmc air filter , choina valvetronic setup , and lowering springs for better stability , it is a 1.0 base variant so i didn’t actually throw a lot of stuff away 😄",
        "num_comments": 194,
        "comments": [
            "That decal on the rear doors legit triggered my Missing Tile Syndrome 😭",
            "Nah it looks classy but only thing is that smiley kind of black sticking on the back panel and door is kinda over the top but overall good build",
            "Saw you on YouTube, Fuel Injected. \nEverything's good, I just want to know about how you painted the dash and when upgrading everything why not the original headlights from the top variant ones?",
            "Am I the only one that thinks it looks better without a spoiler.",
            "I’ve seen your car in a youtube video. Got some good mods😮‍💨😮‍💨",
            "The only thing i hate s the VRS badge. Not a VRS.. shouldn’t be there. Rest s tasteful",
            "Smiley ruined it. Otherwise really tasteful",
            "What's the performance difference because of the changes ? \n\nDo you think getting a 1.5 would have been worth it instead of the modifying the 1.0 ?",
            "That car is looking good boi",
            "This is what i get in forza damn😋"
        ]
    }
}