{
    "Would you get it?": {
        "title": "Would you get it?",
        "score": 22,
        "url": "https://www.reddit.com/gallery/1dqycqf",
        "content": "",
        "num_comments": 58,
        "comments": [
            "Looks great and probably goes hard but the amount of mods is something I wouldn’t want to need to maintain. Anyone looking to buy it should probably make sure they can get a rwc before committing to buy, be a pretty expensive shed filler if you found out the hard way you can’t get it registered.",
            "Personally I don't understand why you'd say it's registered until October but then because of the mods done you're selling it unregistered",
            "I wouldn't get a $58000 dollar vehicle without a test drive other then that it's probs a good thing",
            "He got defected maybe,",
            "Well it'll certainly divide opinions",
            "Not for that price.\n\nIt's essentially unregisterable in it's current state.",
            "100% id' buy it, not for his dreamer price though.\n\nno rwc - yeah, that aint passing, and before you say \"dodgy\" i'm in vic, it won't pass\n\nno test drives - issues with running gear",
            "No test drive, says it all to me. The car can have rego until whenever, it's probably broken somewhere (I understand he doesn't want tyre kickers, but no test drive tells me the story I need to know).",
            "This car was on Ross Reviews https://youtu.be/EIu4LyO5g6A?si=bw_EqKqXWDQ_KvTr\n\nWatch the video",
            "I had an FG MK2 XR6T that was 500kw (700hp) on E85 with similar mods. \n\nAlthough mine was a sedan and a manual. It cost us about 80k including buying the car, building the motor, upgrading the brakes and suspension, tires, etc. \n\nMine was done fully properly. As in safe, reliable, engineered, registered, roadworthy, it appeared visually stock and when the exhaust valve was closed it wasn't off it chops loud. \n\nThat thing was a handful when you were getting on it, but my girlfriend was able to daily drive it to work everyday. So I wouldn't say it was a bad car. \n\nWould I buy another one ? Probably not. It was definitely a great experience. Reliability wasn't ever a problem. The problem was self control and how expensive it was to do 20-40,000km a year in. It was absolutely shocking on fuel, nobody wanted to insure it for its true replacement value or wouldn't insure it for reasonable money because it was such a powerful car."
        ]
    },
    "Thinking about one of these two... Any words of advice or encouragement? ": {
        "title": "Thinking about one of these two... Any words of advice or encouragement? ",
        "score": 4,
        "url": "https://www.reddit.com/gallery/1dr2cof",
        "content": "Tossing up between these two...or a 2021 Skoda Superb Wagon",
        "num_comments": 72,
        "comments": [
            "Volvo. XC90 is just about the most comfortable mass produced car ever.",
            "Definitely the Volvo. Those are re brilliant cars to drive",
            "Volvo all the way. You’d be hard pressed to find a better seat to sit in or audio system to listen to. The Volvo diesel is smooth (as far as diesels go, at least) and can get up and boogie when you need it to. \n\nThat colour stands out nicely above all the other white/silver/black SUVs as well.",
            "The Volvo seems like a good option, although the Audi is by far the nicest of the 3, although has quite a few kilometres.",
            "Make sure you get a pre-purchase inspection by a good mechanic. We were going to buy a 2018 XC90 and mechanic found it had a turbo leak so we ended up not buying it.",
            "Redriven had both of them on their worst cars of 2023 list so...\n\nNo opinion personally but worth watching their reviews as they're quite well researched and will give you something to think about.",
            "6 year old Audi right out of warranty with highish km. Why do you think the owners are selling it?? Offloading a nightmare. Endless money pit from the criminal car company VW.",
            "Volvo",
            "Honestly neither. Luxury cars north of 100k KMs is playing financial Russian roulette. Lexus is probably the exception since the engineering is fairly conservative/simple and you can get hands on parts fairly easily. \n\nIf you had to, then I'd take the Volvo. That Audi I would not touch with a very long stick.",
            "Get a new xc90."
        ]
    },
    "Missing hood liner": {
        "title": "Missing hood liner",
        "score": 2,
        "url": "https://www.reddit.com/r/CarsAustralia/comments/1dr60hi/missing_hood_liner/",
        "content": "Is there any reason why a mechanic would remove a hood liner during a normal service? Sent my car for a regular oil service a week ago  and thougt the car was a little louder than usual. Opened the bonnet, lo and behold the hood liner is missing. Anyone had this experience? The car is a skoda octavia vrs mk3. ",
        "num_comments": 2,
        "comments": [
            "The diesels came with bonnet insulation, the petrols didn't. \n\nSo if you've been robbed then give em call as new insulation costs around $400",
            "So they can sell it on eBay"
        ]
    },
    "2009 VW Golf GTi blown head gasket ": {
        "title": "2009 VW Golf GTi blown head gasket ",
        "score": 4,
        "url": "https://www.reddit.com/r/CarsAustralia/comments/1dr1sl5/2009_vw_golf_gti_blown_head_gasket/",
        "content": "Young bloke I know has this issue. “Low coolant” light came on and he did not drive it when he saw that.  Not being mechanically minded at all he called RACV and the guy came out and found little or no coolant where it should be and made this initial diagnosis.  Car has been towed to trustworthy  family mechanic for confirmation on Monday.\n\nSeeing as head gaskets themselves  appear to be only around $300, I am guessing the cost of this job is all labour?  Does engine have to be pulled out?\n\nAs car was not driven with blown gasket, and there was  no engine-temperature warning light, this should  mean cost should not be ginormous, am I right?  Couple of grand? \n\nThanks for any advice.  Young bloke is fearing for his bank account…. \n\n",
        "num_comments": 7,
        "comments": [
            "> RACV and the guy came out and found little or no coolant where it should be and made this initial diagnosis.\n\nIt seems like a pretty big jump straight from missing coolant to blown head gasket, especially on the side of the road. \n\nGet it properly diagnosed before stressing too much as there are lots of things that could lead to coolant leaks and they range from blown head gasket down to busted $3 hose clamp. \n\n>Couple of grand?\n\nImpossible to say at this point, but that would hopefully cover most simple eventualities.",
            "Yeah, get a proper diagnosis and don't get ahead of yourself.",
            "That's a *massive* jump to make from a low coolant level with no other diagnosis. Plus, these engines aren't really known for their head gaskets packing it in.\n\nWhile they're not like gen 3 ones, I know the water pumps on those earlier EA888s did have some issues. If that water pump sprung a leak, I'd recommend getting a carbon clean done on the intake valves as a 'while you're in there' job since the water pump replacement calls for removing the intake manifold. Those engines suffered heavily from direct injection carbon buildup.\n\nIf that ends up being the problem, I'd expect somewhere within the $1-2000 range to sort it out.",
            "Blown head gasket would be  up there with the worst of outcomes so not too bad. It could be a leaking radiator, I’m pretty sure that year model has the plastic sides on the rad and they are known to not be long lasting and leak, water pumps are also common on those, could also be simply a split hose. Pretty big assumption to call a blown head gasket on the side of the road from a racv guy. \n\nYes the gasket job is all labour, no the motor doesn’t need to come out. I reckon around a grand all up for the job maybe less if you know the mechanic. \n\nIf it still had some coolant and the temp wasn’t off the charts and still being driven it will be fine besides whatever is wrong with it currently.\n\nEdit, should add hopefully it’s not the water pump cos that’s going to cost more than the head gasket.",
            "Thanks so much for the informed assistance.  \n\nRACV guy apparently reckoned there was oil in the low amount of coolant.  \n\nWater pump info is gold.   We’re sure the mechanic will be all over that.  Cheers. .",
            "Its probably not the head gasket, though it could be. VW incorporate recycled plastics into thier coolant system components to tick TUV guidelines and after 15 years, those parts can and will become brittle. Coolant at opperating temps is under very high pressure, it will find any holes, cracks, etc and escape. Luckily your child was smart and stopped the car when the light went on. It still may be an fairly expensive fix, because VAG parts are often not cheap or simple to source and replace, but i would be hopeful that the car is fine.",
            "Also, water pump. Which is a very common issue on these. Unfortunately also rather expensive."
        ]
    },
    "Wondering how much of a headache this is gonna be ": {
        "title": "Wondering how much of a headache this is gonna be ",
        "score": 2,
        "url": "https://www.reddit.com/r/CarsAustralia/comments/1dr3ttp/wondering_how_much_of_a_headache_this_is_gonna_be/",
        "content": "Looking at buying an NC fairlane in qld, it’s in pretty decent nick but the current owner missed the deadline on transferring it into his own name but still has the paperwork for it, how much of a headache will it be to get into my name? Wait till rego runs out and re register? Or will the transport department accept the paper trail? (I know this is probably unlikely) ",
        "num_comments": 4,
        "comments": [
            "First and foremost- as a former DC LTD owner (and future owner of another one), I congratulate you on your choice of a fine automobile. \n\nNow just to clarify- are you interstate and buying it in Queensland, or are you in the same state?\n\nAnd the former owner never transferred the registration into his name from whoever they purchased it from?",
            "I'd wait until rego runs out and start again. To transfer the current rego you'd need the transfer from the previous owner directly to your name and cut out your seller. QLD Transport aren't known for their understanding or flexibility with these things\n\nEdit: Also look up the rego and make sure it is still actually registered because the previous owner would be within his rights to have cancelled it",
            "Thank you it’d be my first ford haha\n\nYeah buying it in qld, and the owner didn’t transfer from who they purchased from, said they forgot about it and the roadworthy ran out but they haven’t driven it much since",
            "I’m not in Queensland, so I can only speculate-\n\nGet a receipt for the car, stating the current owners’ details and the VIN of the car. Bring that and a RWC to the relevant department and that should be sufficient to have the car registered in your name."
        ]
    }
}