{
    "What kind of car?": {
        "title": "What kind of car?",
        "score": 267,
        "url": "https://www.reddit.com/gallery/1dqz8rq",
        "content": "Saw this driving to the airport in Atlanta, what is it?\n",
        "num_comments": 127,
        "comments": [
            "Maybe near future sci-fi movie car props?",
            "Say what you want about the styling, Hyundai is cooking. Love it or hate it, it adds a twist to the monotony of modern car design and I'm here for it.",
            "No clue. But those wheels are amazing.",
            "Looks like Maybach logo on wheels",
            "Most likely the Hyundai Ioniq 6 dressed up for a movie shoot. Looks like a plastic shell to make them look more futuristic. Georgia has a massive entertainment industry so I wouldn’t be surprised if these were headed to a shoot.",
            "Movie cars... front is the hero car (close-ups), second and third are stunt cars of some sort, possibly similar sheet metal to the hero car over a tube chassis.",
            "Props built on a Hyundai",
            "same one thats in front of it, just with some funky wheels and not road legal bumpers, seems like some concept or movie prop model",
            "got it 2 shots, nice",
            "Not sure if those are transport hubs or the actual wheels but damn I like them."
        ]
    },
    "Is this properly inflated?": {
        "title": "Is this properly inflated?",
        "score": 2,
        "url": "https://www.reddit.com/gallery/1drb209",
        "content": "Now i know for a fact that it is deflated, cz the barometer says 36psi and the door of the car says 42psi. But my dad thinks otherwise despite the barometer, the sticker and online search results. He said something along the lines of all cars he drove were/should/must be 25-6psi which i witnessed on the other two vw cars he had but both were 265/65 i guess. This one here is 205/50 R17. Is this the reason? Slimmer tires are more pressured? Like physically i think less volume means more pressure to preserve the same amount of air? but idk.. you guys know your stuff very well, any help is appreciated :)\n\nOh this car is a vw caddy 2020 all track\nThe others were both a 2010 vw passat b6 and vw tiguan. Ik lot of vw hehe..",
        "num_comments": 3,
        "comments": [
            "Man just follow the manufacturer's recommendations, they're there for a reason.",
            "Always follow what is on the door sticker if it’s the same tire size. Different models of cars can vary in what the proper tire pressure is, driving at 26psi when it’s supposed to be 42psi can cause improper tire wear.",
            "Follow the manufacturer advice."
        ]
    },
    "Stiffer anti roll bar options for Audi A5?": {
        "title": "Stiffer anti roll bar options for Audi A5?",
        "score": 2,
        "url": "https://www.reddit.com/r/Cartalk/comments/1dra9rg/stiffer_anti_roll_bar_options_for_audi_a5/",
        "content": "Have an older 2008 Audi A5 8T 3.0tdi and want to switch out the rear anti roll bar for something stiffer to reduce roll and understeer. Can't seem to find much online on it. Any ideas/recommendations?",
        "num_comments": 0,
        "comments": []
    },
    "Sonata 2.0 turbo vibration ": {
        "title": "Sonata 2.0 turbo vibration ",
        "score": 1,
        "url": "https://v.redd.it/ro5ictt3ei9d1",
        "content": "Hello, I noticed that this part that I believe is a belt tentioner has play, especially when the AC is running. \n\nCould it be the reason I have rough idle? Should I be worried? \n\nAny help would be much appreciated. ",
        "num_comments": 1,
        "comments": [
            "It's spring loaded. Some movement is necessary with that part. Rough idle could be many things. Vacuum leak, bad sensor of some sort, or just the way your car handles low rpm."
        ]
    },
    "Golf 4 belt tensioner squeaking": {
        "title": "Golf 4 belt tensioner squeaking",
        "score": 1,
        "url": "https://v.redd.it/frkh54h05i9d1",
        "content": "The tensioner is squeking when it is under 1000 motor plants. In the car is a new belt and also tensioner what to do?\n",
        "num_comments": 0,
        "comments": []
    }
}