{
    "I wanted to share this photo I found of Po without black eyes": {
        "title": "I wanted to share this photo I found of Po without black eyes",
        "score": 1084,
        "url": "https://i.redd.it/8lt39ws8ve9d1.jpeg",
        "content": "What do you all think",
        "num_comments": 149,
        "comments": [
            "I’m posting this on r/BatmanArkham",
            "The description didn't make sense so I thought it meant actual eye color and I couldn't tell why the image looked so weird. It took me too long to realise it's the black circles around the eyes not the eye colour.",
            "What should we name him?",
            "He looks like he belongs in those copycat’s movies.",
            "Great, now he’s gonna need sunglasses.",
            "Live action Kung Fu Panda movie be like",
            "you made his eyes green?",
            "Now put that thing back where it came from or so help me!",
            "He has seen too much",
            "I’ve got eye bleach. Come and get your eye bleach!"
        ]
    },
    "Why not watch The Powerpuff girls? We have:": {
        "title": "Why not watch The Powerpuff girls? We have:",
        "score": 403,
        "url": "https://v.redd.it/yyoqxer90f9d1",
        "content": "Hotdiggitydemon video btw",
        "num_comments": 19,
        "comments": [
            "Dang, that's a bunch of stuff.",
            "The question of how they know they're bulletproof worries me.",
            "they just put it on netflix too, a rare W",
            "Back when cn was cool",
            "Remembering this and courage the cowardly dog so much and...oh boy, all starts to make sense",
            "Did that last gross monster have tits?",
            "You got me at voluptuous women",
            "You just reminded me that i watched a lot of Powerpuff Girls while growing up, and looking at all these violent, messed up and traumatising scenes suddenly explains *so much* about my personality. It also explains why i used to watch Shrek, Spongebob and Lilo&Stitch with childlike innocence, the same way i watched South Park, Happy Tree Friends and Celebrity Deathmatch.",
            "The YouTuber is called brains dumps",
            "You had me at children hitting each other"
        ]
    },
    "Name a more insane character. Go on,do it": {
        "title": "Name a more insane character. Go on,do it",
        "score": 78,
        "url": "https://i.redd.it/pxkgqfj01h9d1.jpeg",
        "content": "",
        "num_comments": 77,
        "comments": [
            "I’d argue he’s more evil than insane.",
            "Larry in Tawog. He has 45 Jobs",
            " A bunch of the pokemon villains",
            "![gif](giphy|if9niVFg4IwAE)\n\nThe Abridged one. 280 death threats to the Pope directly via carrier pigeon.",
            "![gif](giphy|nudxEzpIkEIBptlbr3)\n\nwhen you get a made fan song entitled \"INSANE\" maybe we can deduce that you are slightly crazy",
            "Smiling Friends has a beautiful roster of insane characters that make this guy seem like nothing.",
            "![gif](giphy|cpte18kjtF43e)\n\nSpecifically the version of her from after Mai and Ty Lee betray her.",
            "I mean.. wouldn't the joker, green goblin or carnage win this?",
            "Sticks the badger  surge tenrec and the joker from the 2003 series",
            "Sure he is, what's your point?"
        ]
    },
    "😦": {
        "title": "😦",
        "score": 43,
        "url": "https://i.redd.it/39p3gb45kh9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "You wanna get turned into a pastry?\n\nThat's how you get turned into pastry",
            "kyle my beloved",
            "What cartoon is that?",
            "nah",
            "Fanboy and Chum Chum",
            "Thanks.",
            "https://preview.redd.it/v3bppxg27i9d1.jpeg?width=131&format=pjpg&auto=webp&s=7d3f796fc86490956ee5032cf6968d8b5a877bf6\n\nGreg = femboy?",
            "**Open Question**: Does this post follow our community's [rules](https://www.reddit.com/r/cartoons/about/rules)?\n\nUpvote this comment for yes.    \nDownvote for no.\n\n^(This post has not been removed. Please report rule breaking content.)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cartoons) if you have any questions or concerns.*"
        ]
    },
    "What joke from a cartoon never gets old? I’ll start.": {
        "title": "What joke from a cartoon never gets old? I’ll start.",
        "score": 702,
        "url": "https://i.redd.it/5v7qqe7zyc9d1.gif",
        "content": "You know who else never gets old?",
        "num_comments": 163,
        "comments": [
            "It’s been said before but it’s amazing he had exactly 1 joke over the entire 8 season run and it never got old once",
            "The guy in Lilo and stitch that always drops his ice cream.",
            "“What, did you think X was gonna fall out of the sky?”\n\n*X falls out of the sky*",
            "You know want funnier than 24?",
            "My ex wife still misses me...",
            "Fun fact : in the countries that i live in, the joke was changed from \"My Mom\" to \"Me\"",
            "I like the joke, I don't like the My Mom episode however",
            "Futurama has so many running gags attached to each character that are always executed so well, many of them aren’t even jokes but the slight variations make it so much funnier than it has any right to be",
            "\"OH MY GOD! THEY KILLED KENNY!\"\n\n\"YOU BASTARDS!!\"",
            "My ex wife still misses me, BUT HER AIM IS GETTING BETTER!"
        ]
    }
}