{
    "Nakakaintimidate maging mahirap": {
        "title": "Nakakaintimidate maging mahirap",
        "score": 301,
        "url": "https://www.reddit.com/r/CasualPH/comments/1dqzmq5/nakakaintimidate_maging_mahirap/",
        "content": "I (F25) met this guy (M28) from Tinder and naiintimidate ako dahil mahirap lang ako.\n\nOk sya kausap, masaya lagi mga chat namin pero nung nameet ko sya, bigla ako naintimidate. Halatang galing sya sa well-off na pamilya. Kung pano sya magsalita, kung pano sya kumilos, halatang di nakapag ulam ng asin.\n\nI stalked his socials and shet, bata palang sya nagtatravel na sila ng family nya sa iba’t-ibang bansa. Samantalang ako, Cubao palang napupuntahan ko hahaha. He’s an only child. Ako panganay, breadwinner pa. Graduate din sya sa Big 4, ako naman graduate sa school dyan sa tabi tabi hahaha.\n\nAndami nyang circle of friends and mukha din silang mayayaman lahat. Ako walang kaibigan, lagi lang nasa bahay at walang kahit isang hobby.\n\nNung nagkita kami, it was fun. Masaya lang kami nag uusap. I like his personality. Mabait, gentleman at magaan kasama. Nagkakachat pa rin kami ngayon and he’s asking me to meet him again.\n\nNgayon nga mga mare ko napapaisip ako, itutuloy ko pa ba tong panaginip kong to or dapat na kong gumising sa realidad?\nMahirap lang ako, galing akong probinsya, lumaki sa barong barong na bahay at walang matinong cr, nag-aarinola lang kami HAHAHAHAHA. Pero nung nagkawork ako, napagawa ko na yung bahay namin, may cr na kami hahaha.\n\nAyun nga, medyo kumikita na ko ngayon ng malaki kaya kahit papano mukha na akong tao. Medyo pretty na pero yun nga, hampaslupa pa din hahaha. Wala naman akong maiooffer kundi pagmamahal lang na busilak. \n\nTapusin ko na ba to habang maaga pa? Natatakot ako na umabot pa kami sa point na malalaman nya kung gaano ako kadukha at aayawan nya ko. O matanggap nya kaya ko? Hays tangina ang hirap maging mahirap. I need your advice!!!",
        "num_comments": 105,
        "comments": [
            "Antayin mo yung offer ng parents “1 million wag ka na magpapakita sa anak ko”. \n\nKidding aside, lahat ng tao na makikilala natin may role sa buhay natin. Enjoyin mo lang and wag mo ipressure sarili mo. As long as happy ka, go lang.",
            "He wants to see you again! Go for it. \n\nAnd regarding your economic status, be upfront. It’s part of your context - which also means batak ka sa buhay, marunong mag desisyon, street smart, lista. You have other things to offer. \n\nIf the activity/hangout is too expensive, be upfront and say so. “Do you mind if we do something else more low key? Budget is a little tight now but should ease up soon.” If he insists and judges you for it, then he’s an asshole. If he offers to cover expenses, bahala ka if you say yes or no hahaha, he agrees na Dutch treat and adjusts, then you know okay ang personality. \n\nDon’t give up on a shot for love just because you feel intimidated. Pera ng pamilya niya yan, Hindi niya perang sarili. Go lang girl.",
            "Actually, maraming parents sa school na pinag aaralan ng anak namin. Chinese ang lalaki, filipina ang babae or from mayaman na pamilya ang lalaki and filipina ang babae from the province na nagwork sa manila or galing sa province.\n\nYou know, kayo lang nag iisip ng ganyan. People needs true people and will love them whole heartedly and di lang pera habol sa kanila. Will accept them who they are. Di pera nila.\n\nDi lahat ng may kaya afford o gusto mag asawa ng may kaya. Why? They need a wife not a boss. Stressed na sila sa work, sa negosyo, sa mga employees nila at iba pa.\n\nGive it a chance. Be a good friend or kung mag work a good gf. If magkatuluyan kayo, a good wife.\n\nThey just need a faithful wife and wants to have a happy family.\n\nIf he can accept who you are, accept who they are. May mga in laws, ok naman sila or eventuallt naging ok naman.\n\nMay mga ganyan. Di lahat, meron ding mang gagamit lang. Be alert, some people wants to play pa and some wants to settle na. Kaya caveat parin.",
            "Yung sumakto ka sa kanta ng Tanya Markova haha.\n\n\"*Tinanong mo ako kung gusto ko ba ng mocha frappe*\"  \n\"*Sagot ko sayo ang kape ko yung sa Ministop*\"",
            "Curious ako ses kung oofferan ka ng milyones para layuan anak nila 😂 emeeee.\nPero seryoso, you seems to be a very wonderful person, caring and loving. Probably yun yung nakita niya sayo and asking you for second date. See where destiny will take you, go with the flow but guard your heart as well. Good luck OP may cupid be with you ♥️",
            "\"Isang milyon, layuan mo ang anak ko!\" Moments",
            "Kaya mo yan OP! I communicate mo lang sakaniya. It looks like he's very interested in you. If not love thne friendship. Tatanggapin ka naman niya kung talagang interesado siya. Pero kung hindi atleast naicommunicate mo yung side mo.",
            "Ang importante girl ay kung ano ang pangarap mo sa buhay. Kung maging kayo man, wag kang umasa sa kanya. Build your career and your own life. Iba ang life mo, iba din siya. In the end, whatever happens, either you will have both, or you will still have your life.",
            "you both seems nice naman tuloy nyo po :( unless mg offer ng 10m ang magulang nya",
            "Don’t overthink it, gurl. Enjoy the getting-to-know-you phase. \n\nMinsan kase ang utak natin inuunahan tayo. Kaya nasa-sabotage ang potential ng mga pangyayari sa buhay natin. Has happened to me soooo many times.\n\nNakakamiss din ang mga kilig moments na ganyan hehe. But maswerte na din ako na I’ve found my partner 😊 Naalala ko tuloy yung ligawan days namin hihi."
        ]
    },
    "We all deserve love that brings us peace": {
        "title": "We all deserve love that brings us peace",
        "score": 31,
        "url": "https://www.reddit.com/r/CasualPH/comments/1dr52xo/we_all_deserve_love_that_brings_us_peace/",
        "content": "You don't cry yourself to sleep. Your chest don't hurt. You don't overthink. Yung love na walang hinihinging kapalit, walang silent competition. Walang bilangan, no comparing yourself to other people or asking yourself why you're not enough. One that doesn't bring your confidence down. \n\nYou just feel happy, contented, loved and valued. That is enough more than enough to keep you going. \n\nI'm still waiting for mine. I wish everyone a gentle love, one that will make your 8 year old self proud of. ",
        "num_comments": 4,
        "comments": [
            " Yes 💯\nLetting go of someone you love can be essential because maintaining your own peace and sense of self is more valuable.",
            "Truly!!! I’m not waiting pero we all deserve peace and genuine happiness talaga whether in lovelife or generally 🥺🤍",
            "I love him but i prioritize my peace more. So bye ex",
            "Kahit yung peace na lang😪"
        ]
    },
    "Why is BINI so popular?": {
        "title": "Why is BINI so popular?",
        "score": 24,
        "url": "https://www.reddit.com/r/CasualPH/comments/1dr59l2/why_is_bini_so_popular/",
        "content": "I just want to preface this by saying that I am not a hater of the group. However, I don't particularly like their music as well, but I recognize that it's good. I also don't know anything about the members\n\nI'm just genuinely curious why and how BINI became so popular when other groups with the same style, vibe, and genre have been around for a while. What sets them and their music apart from the other groups?\n\nAgain, I'm just really fascinated because I've never heard of them before Feb or March this year, then suddenly, they're everywhere. Also, did they replace the K-Pop wave in the PH music discourse? Because I could've sworn that the last few years, it was all K-Pop, then Taylor Swift's Era's Tour happened, then suddenly, it was all BINI.",
        "num_comments": 39,
        "comments": [
            "The moment you get a hit song, the next thing to do is to keep the momentum and interest going. And that is what their management is doing.",
            "Marketing strategy was on point once they hit the trend chart. Their producers kept on adding rocket boost sa kanilang hits by making dance out of it, adding it as bgm sa mga reels/stories/myday and everything. They never left the sky once they had been to it. The cons is the immense pressure and pagod to the girls as all those investments will be milked back to the pockets of their producers.",
            "for me not bc of good marketing, please sobrang waley ng pagppromote nila, fans pa siguro. mas maganda edits and promotion ng fans.\n\nalso, talents aside na super winner naman, sobrang havey ng personality nila. as in. kanal humor na bet na bet ng mga tao ngayon. for me, sa humor talaga nila ko nahila bago ako nabaliw sa performances nila. as in just saw clips from hardworking fans na todo promote kahit mas marami bashers noon (kesho di naman daw sikat lol).",
            "A good marketing team and talent",
            "personality and a catchy song got the people hooked",
            "Been saying this even before, talentado ang mga pinoy, kulang lang sa boost ng suporta mula sa atin. Kita naman kahit sa ibang group like SB19 na kaya naman pala suportahan ang sariling atin. What sets apart ay yung recent album nila bop, feel-good and the mass can enjoy and relate to kaya nagsunod sunod na sa pagshashare sa Tiktok and social media. Also, yung humor at kalog ng girls, madaling makarelate ang mga pinoy. Masaya sila suportahan. Matagal na rin ang Bini and even before grabe yung training nila para maihalintulad sa ibang bansa na kaya naman pala natin, na girl group na hindi lang kpop and all na kayang suportahan. Yung popularity nila is well-deserved kasi ginapang nila thru hardwork and patience. Success naman is not overnight. \n\nMadali na ngayon magviral isang clip lang, pero yung longevity ng popularity, yun yung need imaintain kaya management has been striking while the iron is hot. Wag lang sana ioverwork at continuous alagaan yung girls as they already have solid fanbase. Sana magtuloy tuloy para mas lalong magkaroon ng hope and dreams ang mga pinoy.",
            "Sobrang catchy kasi songs nila and ang gaganda pa nila stan na nila ako since 2021 pero mas lalo sila gumaling year by year.",
            "Ok sakin na sikat sila para di na mapunta sa korea ang pop music revenue...",
            "Personalities siguro. Not a fan of them until mapanood ko inteview nila with karen davila. Makikita mo mga sobrang down to earth saka mga nagsumikap talaga nang husto. Sobrang funny rin ng clips nila, panalo sa humour hahah. May kanya kanya rin silang charm and forte/talent.",
            "Catchy songs, beautiful faces yung main factor pero as a girl group, i love their bond and individual quirks. Maalaga din sila sa fans nila, walang tapon yung talent nila."
        ]
    },
    "Hirap naman makahanap ng second husband 😮‍💨": {
        "title": "Hirap naman makahanap ng second husband 😮‍💨",
        "score": 22,
        "url": "https://i.redd.it/8q2ebmawfg9d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Ahahaha tokwa yan",
            "Sooooo funny response",
            "Wtf am i reading at?",
            "HHahahhahhaa sissie",
            "r/clevercomeback pwede dito yan",
            "Akala ko papayag sya para fair hayyy"
        ]
    },
    "to be known is to be loved.": {
        "title": "to be known is to be loved.",
        "score": 198,
        "url": "https://www.reddit.com/r/CasualPH/comments/1dqltnb/to_be_known_is_to_be_loved/",
        "content": "i know this is mostly connected to relationships and friendships, but it hits different when your parents really know you to the core. even the littlest and most mundane details about you.\n\ni have a sibling (who is much younger than me) and everytime we would do groceries, he would pick up chips which are sour cream flavored, while i would choose those that are cheese flavored ones.\n\na while ago, my parents did a little grocery in a recently opened convenience store near our place. i saw my brother eating his chips (which are obviously, sour cream ones). i asked for some, sabi ko, \"penge naman nyan\", and my mom saw that.\n\nafter a few minutes while i was getting ready for the gym, she knocked at my door and handed me mine. i said, \"ay meron din pala ako? thank youuu.\"\n\ni didn't expect anything kasi the hell, i'm a 25 y/o grown woman who can provide for myself. mag-eexpect pa ba ako ng pasalubong from my parents?\n\nneedless to say, they picked up our faves. i had my cheese flavored chips. tasted a lot better kasi you know they chose that because they remembered you.\n\njust sharing this so i would always remember that i always have these two people who love me without me even trying. happy friday everyone 🤍",
        "num_comments": 20,
        "comments": [
            "You're so blessed to have your parents. This made me smile! Thanks for sharing!",
            "Aww I’ll make sure to do this sa kids ko and always remember their preferences. It matters pala 🥰",
            "Aww. My heart, OP. ❤️🤧",
            "Aww sweet ni mommy, na-miss ko tuloy bigla mama ko 🥲",
            "The story is cute and touching and I'm happy for u pero my brain wants to know if piattos ba yung chips 🙃😅",
            "That is sweet. It's the little things. Mine naman is when either nanay or tatay buys senorita na saging maliban sa regular ones. We all like saging pero pag senorita, i know it's for me.",
            "My papa, whenever he goes out, lagi may pasalubong na mcdo, chicken spag, for me. I'm a 26 year old professional and it melts my heart knowing that for them, I'm still their baby boy.",
            "This is soo sweet. I have a similar one, my brother picked up my favorite drink from 7/11 kahit na almost a year akong wala sa bahay. Nakakatouch na alam nya gusto ni ate 🥹",
            "so wholesome! 💕same with how my fam is towards me. i couldn't complain being single bec. of how loved i am and this post reminds me to be grateful 🥺",
            "Ang ganda naman makabasa ng mga ganito, ang wholesome lang."
        ]
    }
}