{
    "My baby ate a true lily and will be okay, but I can’t cope": {
        "title": "My baby ate a true lily and will be okay, but I can’t cope",
        "score": 237,
        "url": "https://www.reddit.com/r/CatAdvice/comments/1dqupt6/my_baby_ate_a_true_lily_and_will_be_okay_but_i/",
        "content": "\nI noticed A) the bouquet my dad got for my mom B) the 10+ open true lilies in it and C) that my baby had her face fully inside the flowers simultaneously. Immediately FREAKED given I know how toxic they are. Checked the lilies, one clearly had her bite mark in it. Brought her to ER vet very quickly, sobbed the whole time thinking I would lose her, but they treated her promptly and now we’re just making sure her kidneys are working OK the next few days. But 0 symptoms besides being stressed from the ordeal. My dad also feels really bad and was shocked to learn true lilies are so toxic to cats (even though I have told him exactly that multiple times lmao). \n\nI just feel so upset still? Even though she’ll be fine? it was an awful scare. Like What if I hadn’t noticed, or she got into something none of us knew was toxic to her? How do you handle loving something so much while knowing some awful accident could take them away from you so quickly? I feel really guilty even though I didn’t buy the lilies. How do you emotionally cope with health scares like this :( ",
        "num_comments": 90,
        "comments": [
            "This post just saved my cats life . One of my students just gave me some Lillies and I had no idea . I was just going to bring them home but I happened to be scrolling on Reddit before I left and now I know . Im glad your baby is okay . Thank you for posting this ",
            "My boss is an advocate that lilies should be sold with a warning card. During Easter we had 5 cats come in for lily poisoning. Thankfully all got fluids and ended up ok, but we've had a few euthanasias due to lilies in our ptactice.",
            "Its not your fault! Ive told my family numerous times how dangerous they are for cats, and everyone still buys them for my mom, and she also wont discourage anyone from buying them for her. I just have my cat trained not to go anywhere near where the lilys are, I also spray lemon air freshener on them when they come in the house, and make sure to keep a closer eye on where she is when I know theres some around.",
            "it'll be okay and it isn't your fault at all! if it makes you feel any better the only health scare my two oldest (13 almost 14) cats have ever had is when they chewed some lilies as teenagers, they were hospitalised for fluids and monitoring and have been 100% healthy ever since, not even the slightest bit of long term kidney damage \n\nmy mum has a 15 year old lily plant that she absolutely refuses to get rid of in the garden so i'm hyper vigilant about not letting the cats near it and so far so good, it baffles me that she knows the cats were poisoned from a lily in the house but she'll still have one in a place they can access - some people just won't listen to reason and you can't take on that responsibility for them, you can only do your best",
            "I obsess about my cats health all the time. Shes my little baby and she is so sweet and innocent. It makes me physically ill when I think about her getting sick or something especially after reading this subreddit about everyones cat having cancer. Now Im a frickin helicopter parent to her and just making myself sick with worry for her health. Its like damn, is she breathing right? Like I seriously obsess like that. It sucks. Ive had cat my whole life but like Ive never felt this protective and worried over a kitty before. I dont have any advice because Im barely coping myself. Ive resigned myself to loving her so so so much and making sure shes happy and healthy for as long as I am blessed with her.",
            "My cat ate a lily leaf and I brought him to the ER. He was about 1.5 years old. He spent the weekend in the ICU hooked up to fluids and I had to do more fluids after we got home but he just turned 10 and he is perfect. They can survive if you get quick medical intervention!",
            "i would be totally freaking out in your situation too, thats so scary! im so glad your babys doing ok! this was absolutely not your fault. it sucks that your family didnt take you seriously but you did everything you could, and you got your cat medical attention right away. sending virtual hugs for you and your kitty!!",
            "You've handled it perfectly. During the emergency, you COULD NOT PANIC. You had to keep it together enough to crate your baby, drive to the vet, talk to doctor, etc. Now, in the aftermath, it's safe for you to break down. Be kind to yourself. Make some tea, put on your fuzzy socks, and give yourself the space to process the thoughts and emotions you shoved down earlier. Also, tell your cat she's ridiculous and I love her. ",
            "My cat is obsessed with plants! I put a table outside the window, and any flowers I receive get put out there so I can see them while keeping the cat safe. Last time he sat at the window with his paw against it, and meowed at them! I cant risk bringing anything into the house",
            "I had a kitty die from eating a Lily. I had no idea until then. I don't bring any flowers with lilies into my house anymore. I was sent a bouquet with lilies and I put it on my porch."
        ]
    },
    "My cat won’t sleep with me on my bed anymore": {
        "title": "My cat won’t sleep with me on my bed anymore",
        "score": 94,
        "url": "https://www.reddit.com/r/CatAdvice/comments/1dqvu9w/my_cat_wont_sleep_with_me_on_my_bed_anymore/",
        "content": "I went on a trip overseas to tend to some personal family matters and it was the hardest thing ever to leave my little boy behind for four weeks, although he was very well loved and taken care of by my parents while I was gone. I adopted him back in September and he’s always slept curled up next to me in my bed. He’s a snuggly clingy little boy so on the few occasions I’ve had to leave for 1-2 days before, he’s always all over me when I return. \n\nThis time, my trip was a month and I anticipated he’d be a little mad at me upon my return. For the past week since I’ve been back, he’s been spending much more time under the bed and in the closet, and he only finds me in bed in the early mornings where he’ll cuddle for a tiny bit before he’s off and playing. I know it’s probably some anxiety from the separation, but I miss him jumping up on bed, making his nightly biscuits on my blanket, and then snuggling up next to me. Will he ever come back? :(",
        "num_comments": 17,
        "comments": [
            "He will. It just takes time. When my cat was gravely ill with a mysterious disease, I took my healthy boy and had him spend time with my mom since I didnt know if he was contagious. I thought it was going to take a week max, but it ended up being 2.5 months. I initially visited him all the time but as the illness progressed, I didnt know if Id have much time with my sick boy so I stayed home. We ended up finding the issue and started treatment. The disease was not contagious but I kept the other cat away to give my sick boy peace and alone time to recover. Eventually I took him back home and he wasnt as cuddly or sweet, but he went back to the same cat I had after a few weeks.",
            "My cat changes his routine often. Hell sleep on my bed for two weeks straight, then spend the next two weeks on the couch, then switch to a laundry basket for a few days, then back to my bed for a couple weeks.\n\nDont worry, hell be back to your bed eventually.",
            "How old is he? He might have just out grown the constant need to sleep next to you. Both of mine have graduated to the morning snuggles/waking me up being cute so I feed them",
            "Consider the weather too - my cat doesn't cuddle so much in summer",
            "When I moved, my cat hid under the bed for most of the day for about a month. They are sensitive little things and take a bit to adjust to different situations.",
            "He got used to a new routine where he was sleeping alone, hell readjust soon!",
            "Cats, just like humans, also go through phases where they are more affectionate. My cat has days where she doesnt want to be touched and other days where I cant do anything without her laying on me.",
            "You can try feeding him those squeeze tube treats from your bed. I created a crying cuddle monster by doing this.",
            "Give him time. Make sure you are encouraging when does come near you or up on the bed",
            "Give him time. But you might want to keep your closet door closed so he doesnt have that option. Worked for me once."
        ]
    },
    "How do i get my cat to sleep on my bed? (New cat owner)": {
        "title": "How do i get my cat to sleep on my bed? (New cat owner)",
        "score": 7,
        "url": "https://www.reddit.com/r/CatAdvice/comments/1dr94i6/how_do_i_get_my_cat_to_sleep_on_my_bed_new_cat/",
        "content": "I say my cat but it is my sister's cat, we share custody but she loves my sister most. I have a corgi who lives to be by my side. We got the cat several months ago and she is great. The dog ignores the cat and the cat unsuccessfully tries to engage the dog in friendly play. At leas ti think its friendly play. The cat hides then slaps the dog as she walks by. Claws and teeth are never used and the dog doesn't seem to upset about it and continues walking by.\n\nThe cat and dog sometimes chill together on the couch but they are still wary of each other and it doesn't last long. Several times my sister spend the night away from home and her poor cat was distraut. She screamed and circled my bed and kept looking like sje was going to jump up but refused. Im not sure if its the dog on the bed or if it is a new situation but the cat has never been on my bed on her own. She has followed my sister a few times bit never went up without my sister even though it seemed like she wanted to a few times. How do i make the cat confident enough to get on the bed with us so she isn't so upset?",
        "num_comments": 10,
        "comments": [
            "Tell her she is not allowed to be on the bed under any circumstances up. Thats how my wife did it.",
            "Make the bed a happy place. \nPlay with some toys / cat nip/ and give treats on the bed.",
            "Maybe just pick her up and put her on your bed. shell go down if she wants",
            "Cats are extremely territorial creatures, and she seems to think when not guided into it that the bed is strictly your territory. When shes really antsy seeming to want up calling her up or just scooping her up if shell let you could help. Im sure once it clicks for her that that is an area she is allowed in herself not just as a guest of your sister shell be fine with it.",
            "Psss, psss, psss. Tap, tap, tap. \"Here kitty kitty.\" *shake, shake, shake* the bag of treats.",
            "It took a little while before my adopted cats wanted to sleep in bed with me because they were not allowed in the previous owner's bedroom. I would repeatedly call for them, tap on the bed with my hand, and sometimes scoop them up, plus keep lots of pillows and throws om the bed. Now they come running to bed every night! ",
            "I use a l shaped TV stand so it's over my bed and put a cat bed on it so he has a spot",
            "Wait for winter to roll around!",
            "Yes, great advice! Perhaps not toys though as it would send the signal that it's a play space. But definitely reinforcing treats and catnip!",
            ""
        ]
    },
    "Is 4 cats too many?": {
        "title": "Is 4 cats too many?",
        "score": 56,
        "url": "https://www.reddit.com/r/CatAdvice/comments/1dqypkg/is_4_cats_too_many/",
        "content": "Has anybody gone from owning 2 cats to 4? How was the transition? I own 2 males, 4 years old and one dog. My fiancé and I found 2 female kittens, maybe 7-8 weeks old. Our intention is to foster them until we can find them good homes. I’ve reached out to several rescues to see if they can be accepted into their adoption programs and they all don’t have the funds/space to take in more kittens. We’re planning to pay for their spay/vaccines if we continue to have no luck. The problem is that the kitties are really sweet and have been bonding a lot with both me and my fiancé as they’ve been coming out of their shells. Hopefully we can find the perfect loving home for them and it doesn’t come to this but…if we can’t find them a home that’s a good fit, how rough would it be if we went from 2 to 4 cats? My fiancé and I own a 2 bedroom home (looking to upgrade in 1-3 years depending on rates), and all of our pets are spoiled rotten and have their own health insurance (no human kids so these are our babies). I’ve never owned more than 2 cats at a time so I don’t know what I might be getting myself into LOL.",
        "num_comments": 99,
        "comments": [
            "I foster failed and went from 3 to 4 (sadly, my senior recently passed so Im back to 3). I have a 2 bedroom, too, and everybody got along great. They were also always all in the same room, usually on the cat tree or the sofa.",
            "If you can afford it why not?  I have 7 cats and they run about $90-$100 each per month.\n\nBiggest thing would be introducing the cats properly to minimize any potential fighting or unwanted behavior.",
            "If you have the space, resources, and so patience its not too many. Were currently at 4 cats, one is 13, one is 7, one is 2 and one is 10 months. It can be overwhelming at times but they are so sweet and fun and I wouldnt trade them for the world. They are like having little kids in the house and they have really brought a lot of joy into our lives.",
            "Not too many if they get along. We went from 2-4 when we foster-failed a couple kittens. Oddly enough, those two were the bridge between the older two, so we had a happier cat family that way.\n\nJust make sure you give them plenty of scratchers, beds, and litter boxes. Theres SO much poop with four cats. ",
            "I went from 1 to 3 (mama kitty got pregnant) while living in a small 2 bedroom apartment. It can be rough, most definitely, but I'm such an advocate for catifying. Life saver. Also, at that point, when there's 4+ cats, I think they just form their own little community. They are the village outside of the capital, and you're the city's maintainence crew (beloved crew, of course) (also that is not/may not be a fact, just personal experience throughout my life!). If acclimated properly, they should continue thriving, just now with an extra buddy or two :)",
            "It certainly takes more time to give everyone attention. For me, two is easier. I have had 4 at one point and it was do-able. But one cat hated the new two, so it was never great. But he was quite the Napoleon since he was a baby, so it may have just been him",
            "I have 7 and two fosters ",
            "Too many for me. Doesnt mean it will be too many for you.",
            "I went from from 2 to 3 last fall and then 3 to 4 this summer!\n\nThe first year is always more expensive with shots and spay/neuter, but other than that it's really just double the food budget and double the love ",
            "I'm not the person to ask, but I can say that 12 is probably too many!"
        ]
    },
    "How often do Cats puke? ": {
        "title": "How often do Cats puke? ",
        "score": 24,
        "url": "https://www.reddit.com/r/CatAdvice/comments/1dr0bfb/how_often_do_cats_puke/",
        "content": "Now I have a cat that pukes a lot. \n\nHe pukes almost every week like just a meal but keeps all the other meals down but 1-3 times a month pukes so much that he can't keep anything down for 1-2 days. \n\nNow before anyone asks me to take him to the vet. I have done it, way too many times. But they always dismiss my concerns saying it's probably just hairball and that he'll get better over time and they are right, he does get better in a couple of days. \n\nBut the whole cycle is way too often,\n He doesn't eat/pukes ----> I drag him to the vet ---- > Gets told that it's nothing major -----> he gets better \n\nAnd it's all over again. \n\nI agree I'm also very quick to drag my cats to the vet because if there's anything serious I'd like him to get checked as soon as possible. \n\nNow I'm not sure whether I have to push them to check for anything more. Vet visits are usually them checking if he's dehydrated, temperature check and a general feel on his stomach. No scans or anything.\n\nI go to the same vet every time and they've got detailed records of him and have never flagged anything so far.\n\nI've also got another cat who seemingly pukes much less. Once a month or so. Has a much lesser vet visits on his record.\n\nIt beeaks my heart to see him puke so many times when he's so hungry but can't keep anything down. \n\nI don't want this to turn into a 'wolf's cry' situation.  Help ? ",
        "num_comments": 27,
        "comments": [
            "Omg! My cat was having the SAME ISSUE and they kept saying he was fine! \nI figured out the dingus can't make hairballs correctly lmao, so he kept puking; now he is on a special food for hairball care. The puking stopped pretty quickly. He used to puke so often I was so concerned  Now it's maybe once every couple of months or if he eats plastic/plants (cause he's a dingus).",
            "Sounds like IBD! A hydrolyzed protein diet or one of the other prescription diets could help",
            "My cat was like this and it was an intolerance to his food, I had to switch him to a prescription diet, its been 2 years and hes never puked since",
            "First of all, find a new vet. Get a full blood panel done. I paid $400 I believe. Could be CKD",
            "I have a cat who used to puke very often and it was increasing over time. She has cancer now so she still pukes 1 every week or every other week at least (probably due to the medications) but when I switched her diet to a limited ingredient food she gained the weight she lost and improved quickly. She was diagnosed with ibd a few years ago after an abdomen X-ray. They tried to get her on a prescription diet and she absolutely refused. Eventually I was recommended natural balances limited ingredient diet. She was on Nulo before. We use the duck & green pea cans, she isnt a fan of chicken or turkey. Its kept her off of needing steroids, so Id say its pretty good. I also am pretty strict on not letting her eat chomps of human food or anything.",
            "Do you have other pets in the house?\n\nA separate question: Have you kept a log as to the days that is happening?  Are you in an apartment?  Are they spraying for bugs?",
            "My cat used to throw up her food quite often, got much better after I switched to foods that did better with her sensitive stomach. Shes still prone to it now if she gets into a treat binge (unlawfully). I gave her probiotics for a few months and it seemed to help toughen up her digestive system a bit.",
            "Idk if its the same but my cat was puking some yellow liquid, only did it thrice and now shes no more.\nTalked to her vet and she said she succumbed to catflu. My cat was not vaccinated either, so i think it would be best to seek vet help",
            "My cat did this and it ended up that she had a polyp in her rectum which caused a backup of poop so whenever she got backed up she would throw up and by the end she would throw up and not eat until she got an enema. They talked about surgery but ultimately it wouldve been worse for her because the scarring from removing the polyp/the polyp could come back could cause complications again, so id ask if they could do a rectal exam just to check!",
            "I have a cat who will puke after breakfast, no matter how little or how much he eats. After ruling out anything serious at the vet, we came to the conclusion that it's likely due to acid or bile build up overnight from an empty stomach. When it happens, I give him half a pill of Pepcid and it breaks the cycle (otherwise he'll vomit most mornings for a while). Note: this was under the direction of a vet. Just thought I'd mention it as another thing that could be happening."
        ]
    }
}