{
    "r/Catholicism Prayer Requests — Week of June 24, 2024": {
        "title": "r/Catholicism Prayer Requests — Week of June 24, 2024",
        "score": 13,
        "url": "https://www.reddit.com/r/Catholicism/comments/1dn4jvj/rcatholicism_prayer_requests_week_of_june_24_2024/",
        "content": "Please post your prayer requests in this weekly thread, giving enough detail to be helpful. If you have been remembering someone or something in your prayers, you may also note that here. We ask all users to pray for these intentions.",
        "num_comments": 92,
        "comments": [
            "We are waiting to hear the report of health for my unborn child - please pray that we get only good news",
            "Please pray for me and my job search.",
            "Please, pray for me. This week I have exams. Also, pray for my conversion. Thanks.",
            "If you could pray for my son Luke. He isn't in terrible condition, but he is 3 months old and was born 2 months early and he right now he isn't gaining weight the way he needs to be. He isn't on the growth chart for weight, and 99% of babies weigh more than he does. If you could help pray that he starts to take all of his bottles so he can gain weight, it would be greatly appreciated.",
            "Please pray for me to finally get answers about undiagnosed pain issues Ive been living with for ~5 years now (most likely its endometriosis). Im seeing an OBGYN soon, but I just want someone to confirm it for my peace of mind. Its all in Gods hands; Hes carried me this far, so I know He wont abandon me now \n\nEdit: Praise Jesus, the OBGYN referred me to a surgeon for a laparoscopy! It should relieve my pain and give me a definitive diagnosis. Now were just praying for a quick and easy recovery. Thank you for your spiritual help, God bless!!",
            "1. Please pray that I can find a new job. Thank you for the prayers last time I posted as I have started to apply. \n2. For our diocese: weve gone over two years without a Bishop. Please pray that we might find a new one.",
            "Please pray for my father's heart operation and also for me. I am in desperate need of a change of spiritual hearth. I want to be an apostle and not a bunch of vices as I am now.",
            "Please pray for my PMO addiction to be destroyed. I do not want to be a slave to this vice. I have been making great progress by increasing my spiritual life (confession, rosary, holy mass), but every time I fall, I become depressed. I believe in the power of prayer. Please pray for me.",
            "Note: I'm not trying to make this political. Could we please get prayers for the American president Joseph Biden? He seems really off and it bothers me knowing he's in open defiance of God and Church teaching. Please pray for his repentance, especially knowing he's getting older.",
            "Please pray for my friend, Darius, who recently took his own life."
        ]
    },
    "Policy on questions pertaining to sin": {
        "title": "Policy on questions pertaining to sin",
        "score": 24,
        "url": "https://www.reddit.com/r/Catholicism/comments/1dqzq7i/policy_on_questions_pertaining_to_sin/",
        "content": "*The current version of this policy can be found here:*  \nhttps://www.reddit.com/r/Catholicism/wiki/sinposts\n\n\\* * * For the gist of the new guidelines, see the **In short:** section below.\n\n----\n\n### Background on sin posts\n\nFrom the inception of this subreddit as a place for Catholics, we have welcomed users posting moral questions about their lives (\"is ___ a sin?\") — referred to as *sin posts* — because other users here, [1] being well-formed in the faith, have been able to [2] guide these discerners to understand the nature of the matter at hand, [3] to help them form their own consciences, and thus be able to [4] discern both whether some action — theoretical or not — is sinful or could rise to mortal sin.\n\nThe fruit: Countless people have been taught how to recognize sin and better discern the mortal/venial distinction, and now can help others in their families, communities, and online.\n\n### Adjustment since\n\nOver time, we have had to place barriers on certain kinds of sin posts because of the spiritual scourge of *scrupulosity*.¹\n\nNot all sin posts come from those who show signs of this condition, but those users who clearly do are not permitted to post here out of our love for their suffering soul. This rule was instituted several years ago, and all such posts are removed with a note from the moderators referencing a helpful text and encouraging the poster to rely on their pastor's advice alone.\n\n### New adjustment in our day\n\nWith the explosion of users, people interested in Catholic doctrine, and in living holier Christian lives, we recognize a corresponding increase in sin posts — *many which repeat past discussions.* The bar for sin posts must now be raised.\n\n* * *\n\n**In short:** An inquirer asking about a certain action as sin must [A] include reasoning they think the action under consideration is or isn't sinful, and [B] if their question pertains to the mortal/venial distinction, include reasoning they believe it does or doesn't satisfy the conditions for mortal sin.²\n\n* * *\n\nIf a moderator judges a post *not* to satisfy this requirement, the post will removed with a note pointing to this rule and encouraging the user to search for similar questions and conversations and/or to enhance the quality of their submission to meet our standards.\n\nWe hope by this small change our subreddit will continue to be a welcoming place for users desiring to align their lives more closely with God's will.\n\nIf you have any feedback on this policy, please [message the moderators](https://www.reddit.com/message/compose/?to=/r/Catholicism).\n\n#### Footnotes\n\n¹ The often referenced text, \"[Ten Commandments for the Scrupulous](https://fisheaters.com/scruples.html)\", defines *scrupulosity*:\n\n>In the end, scrupulosity is the condition of not trusting in the Mercy of Christ. It's a plaguing sense of being \"bad\" or \"guilty\" or \"unforgiven.\" It's a sort of obsessive–compulsive disorder that causes people to doubt the efficacy of the sacrament of confession or think they didn't receive the sacrament properly, perhaps that they forgot to tell the priest something and that this will damn them or some such. Suffering from a case of the scruples can be excruciating.\n\n² *Mortal sin* is defined in [CCC 1857](http://www.scborromeo.org/ccc/para/1857.htm): \"For a sin to be mortal, three conditions must together be met: 'Mortal sin is sin whose object is grave matter and which is also committed with full knowledge and deliberate consent.'\" — \"*Grave matter* is specified by the Ten Commandments.\" ([CCC 1858](http://www.scborromeo.org/ccc/para/1858.htm)).",
        "num_comments": 0,
        "comments": []
    },
    "How did you guys get through Chronicles.. my brain is scrambled.": {
        "title": "How did you guys get through Chronicles.. my brain is scrambled.",
        "score": 44,
        "url": "https://i.redd.it/yggzagtdsh9d1.jpeg",
        "content": "",
        "num_comments": 21,
        "comments": [
            "By listening to it on Bible in a Year",
            "I had Father Mike Schmitz read it to me",
            "Skim the genealogies unless you are seriously a scholar",
            "Yes, Father Mike. Bible in a Year. Makes it all much easier. Try it out. I'm still in the middle of it. Good luck and God bless.",
            "Father Mike leads the way",
            "Bar for bar line for line",
            "No joke here, I was the same and then I started to look for Jesus in Tanah, and I saw him, more and more and now I can not stop looking for him in Tanah. He is everywhere there. That will get you through it.\n\nEven now I sometimes read some random paragraphs and then - boom - here it is again. He's in death of Samson.",
            "I, uh, well... I >!skip the genealogies!<",
            "It is more of a reference than a novel. Not sure you are supposed to sit down and try to do your morning devotional reading for it, or at least the passage you pictured.",
            "With genealogies, dont worry about recognizing every name or remembering everything just read straight through. Then come back every now and again and see how many more of the names you recognize."
        ]
    },
    "Image of Jesus I made": {
        "title": "Image of Jesus I made",
        "score": 158,
        "url": "https://i.redd.it/brxc6msm7f9d1.jpeg",
        "content": "I know it’s not very good but I wanted to share",
        "num_comments": 13,
        "comments": [
            "It's interesting but maybe change your eyes a bit.\n\nNo hate but I actually like it but they seem too big eyes",
            "Its great! Dont be so hard on yourself",
            "Love it! Thank you for sharing.",
            "Loved it. You have talent.",
            "Beautiful work. You were definitely blessed with talent. ",
            "The lamb looks really smug. Who wouldnt XD",
            "Agreed - this looks sort of southpark - remember- not all art is equally beautiful - or pleasing even to our fallen nature - seek to portray beauty as such and precisely not in antithesis or cartoon. What in the world can my work do, I ask myself when I draw celtic crucifixes - hundreds of hours  - often times I realize Ive lost the thread - I begin again. Because, behold, He Makes All Things New",
            "Very true everybody has their own perspection on everything.\n\nBut a beautiful drawing of Jesus and the lamb ",
            "Perspection is - perhaps providentially- precisely the non-actual word which innand of itself refutes that whole indiscriminating subjectivism  (which Christ has trampled and tramples under foot ) which it reflects. In charity, the answer is: 1.) do better art; 2.) depict the good and true beautifully and not in a manner which explicitly concedes that which the Good and True and Beautiful came to vanquish.",
            "Thank you for clarifying I didn't know what another word for  it .\n\nFor sure thanks Have a great night today"
        ]
    },
    "A very happy Solemnity of the Holy Apostles Peter and Paul, the patron saints of Rome! \"O Roma felix, quæ duórum Príncipum Es consecráta glorióso sánguine!\" 🇻🇦📜🗝️🗡️⛪🩸": {
        "title": "A very happy Solemnity of the Holy Apostles Peter and Paul, the patron saints of Rome! \"O Roma felix, quæ duórum Príncipum Es consecráta glorióso sánguine!\" 🇻🇦📜🗝️🗡️⛪🩸",
        "score": 22,
        "url": "https://i.redd.it/qhp6barngh9d1.png",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Sts Peter and Paul, pray for us!",
            "_\"O happy Rome! who in thy martyr princes' blood,\nA twofold stream, art washed and doubly sanctified.\"_\n\nFriends, I love this feast so much. Today, we remember two men who were deeply **flawed, rash, weak,** and yet were the two pillars of the Roman church. Two men who didn't see eye to eye at times. Two men who were very different people. **Peter the fisherman. Paul the Pharisee.** **Peter who was given the keys to the kingdom of Heaven. Paul who was appointed the Apostle to the Gentiles. Peter who denied. Paul who murdered.** And yet, Jesus chose them to powerfully witness to his resurrection. May these two great Apostles inspire us to powerfully proclaim the gospel like they did!\n\nPlease remember to pray for Pope Francis today. \n\nFrom the 2nd reading for today's Mass:\n\n_\"I, Paul, am already being poured out like a libation, and the time of my departure is at hand. I have competed well; I have finished the race; I have kept the faith.\"_ (2 Tim 4:6-8)\n\nFrom the Gospel of today's Mass:\n\n_\"He (Jesus) said to them, But who do you say that I am? Simon Peter said in reply, You are the Christ, the Son of the living God. Jesus said to him in reply, Blessed are you, Simon son of Jonah. For flesh and blood has not revealed this to you, but my heavenly Father. And so I say to you, you are Peter, and upon this rock I will build my Church, and the gates of the netherworld shall not prevail against it. **I will give you the keys to the Kingdom of heaven.** Whatever you bind on earth shall be bound in heaven; and whatever you loose on earth shall be loosed in heaven._ (Matt 16:16-20)"
        ]
    }
}