{
    "Rule overhaul": {
        "title": "Rule overhaul",
        "score": 240,
        "url": "https://www.reddit.com/r/cats/comments/1c694b0/rule_overhaul/",
        "content": "[https://www.reddit.com/r/cats/about/rules](https://www.reddit.com/r/cats/about/rules)\n\n&#x200B;\n\nHello everyone,\n\n&#x200B;\n\nToday we are going live with our primary rule overhaul in order to keep the subreddit rules in tune with the modern needs of the community. \n\n&#x200B;\n\nOur rules were old and sometimes edited and added to, but over the years reddit has changed and our community has changed to the extent that it made sense to completely start from scratch. \n\n&#x200B;\n\nWe have kept a lot of the rules that we were actively moderating for, but have removed some rules that are no longer relevant. When the subreddit started the rule \"Content must be about cats\" made sense, but we do not need to expressly codify this anymore. We're not a small community these days and it has not happened in years that someone posted a bunny rabbit instead of a cat. We will of course still remove off-topic content but do not see the need to clutter up the rules page with something that our community understands to be self-evident. \n\n&#x200B;\n\nWe will likely make minor edits and additions to this new rule-set in the coming weeks until everything is just the way we like it, but the rules as posted now are the general framework from which we will do so.\n\n&#x200B;\n\nWe have kept our rules broadly worded so they can encompass many topics and so we do not need to codify for every single possibility. \n\n&#x200B;\n\nThe most important rules are at the top. Our number one rule is to respect each other. This for example includes following rediquette and sitewide rules, but also our subreddit-specific rule of not attacking other posters for not raising their pets to your satisfaction. \n\n&#x200B;\n\nOur rule about spam, memes and self-promotion includes  accounts that do not directly promote their content, but which nevertheless primarily exist to drive content to their NSFW stores like Onlyfans. Everyone is welcome to post here, but NSFW sellers can do so on a seperate, SFW account. We do not allow memes as they are most often posted as easy karma-grabs instead of genuine engagement. \n\n&#x200B;\n\nAnd so on. \n\n&#x200B;\n\nPlease read our new ruleset via the link at the top of this thread and give your feedback in a comment below. \n\n&#x200B;\n\nThank you all for helping us make this space the wonderful community that it is and we hope you enjoy your time here. \n\n&#x200B;\n\nThe r/cats mod team",
        "num_comments": 128,
        "comments": [
            "Okay, I don't know how to put this into words, but I'll try. Every post I've seen recently from this sub is a sad story about the death of a beloved cat. Perhaps this is a me problem, and I really don't want to say that people shouldn't mourn, but it's always extreme for me to see this kind of post. Especially if it's the only type of content that is making it to the front page.",
            "Can we add breed questions to the disallowed topics?",
            "Are you still going to be deleting political posts?  I find politics to be extremely divisive and actually filled with hate these days with everything that's been going on in the middle east, etc.",
            "This thread has soooo many memorial posts- it’s soo sad.",
            "Hi! Sorry to post this here. New member, I was going to create a new post asking for advice on transdermal ear meds, but for some reason the submit button is not available on my post. I've selected flair and looked through the rules, but not seeing anything that would prevent me from posting for the first time.",
            "What is with all the sad stuff? Life hurts enough.",
            "I'm not sure if we're still allowed to respond here. Sorry in advance to the mod team. This was brought up earlier in the thread, but I feel like the \"mourning/loss\" tag is hardly being used and enforced. I know pet loss is not easy, but every day I scroll through Reddit, I'm hiding multiple posts from this sub reddit that aren't tagged properly. Can I scroll by them? Yes. But as someone else also said, I don't want to see them consistently in my face. It's made me debate between staying or leaving the sub quite a few times.",
            "How do I delete my post from a few days ago if it ever got posted?",
            "***I am leaving the*** r/cats ***subreddit,and I am NEVER,EVER coming back. Goodbye!,...Forever.***",
            "Sorry but I just have a question of the rules!!!   The abbreviations NSFW and SFW were used and I simply have no idea what they stand for.  Would someone please enlighten me? "
        ]
    },
    "I’m Leili Farzaneh – AMA about harness training your cat!": {
        "title": "I’m Leili Farzaneh – AMA about harness training your cat!",
        "score": 9,
        "url": "https://www.reddit.com/r/cats/comments/1dqojvd/im_leili_farzaneh_ama_about_harness_training_your/",
        "content": "Hello 👋 I’m [Leili](https://imgur.com/a/HdKmk7s), an accredited animal behaviour technician and co-founder of cat accessories brand [Supakit](https://supakit.co). I help people harness train their cats in a way that is enjoyable and stress-free for both human and kitty. AMA!\n\nMaybe you’re wondering if harness training is right for your cat, need some pointers on how to get your cat started, or perhaps you’ve hit a little roadblock in your harness training and need some advice?\n\nOr, maybe you have an adventurous kitty and are looking for tips on advanced scenarios like backpack training, safely managing dog encounters, or even navigating #vanlife with your cat. Whatever your questions, I’m excited to answer them!\n\n**Feel free to post your questions here and I'll start responding from Saturday June 29th 2024 at 10AM PDT / 1PM EDT / 6PM BST / 7PM CEST.**\n\nHere’s a tip to get us started: Did you know that the position you hold your cat’s leash in can play a big part in preventing harness escapes? \n\nBy keeping the leash in the ‘safe zone’ when it is under tension (diagram here: https://imgur.com/a/pHi7y5i), you can avoid giving your cat the low angles it needs to pull their harness off over their heads (AKA backing out). This little trick can make a big difference in keeping your cat safe & secure outside!\n\nhttps://preview.redd.it/e94fqir5oc9d1.png?width=2000&format=png&auto=webp&s=ce74c0ca7999ae74da8f274a2361b00b6df8e645",
        "num_comments": 1,
        "comments": [
            "Hi! Me and my Kitty completed your 10 day bootcamp training and my Kitty now can walk freely harnessed inside. But I desperately need help with the rest of training (the going outside part). I have a cat stroller and I thought I could just slowly start bringing her outside in the stroller, but it stressed her out. Even though I did what everyone said, by slowly walking her only inside the apartment in the stroller. And eventually going outside (even just staying on the porch in the stroller). I have to be missing something. \n\nI desperately need the next training! But its so expensive, I can't afford it. I've been hoping it would eventually have a sale. I get emails all the time with the harnesses and collars on sale, but I never see the training course having a sale. Is there any chance the training course can have a sale? The 10 day bootcamp was so helpful and I really want to continue the process!"
        ]
    },
    "Me and my girlfriend had a fight, and this is how her cat was looking at me the whole time": {
        "title": "Me and my girlfriend had a fight, and this is how her cat was looking at me the whole time",
        "score": 13299,
        "url": "https://i.redd.it/269nzhd0fg9d1.jpeg",
        "content": "Am scared to sleep.",
        "num_comments": 246,
        "comments": [
            "I had a girl over at my place and I started tickling her. We we're just being cute and playing around. \n\nMy cat thought that I was attacking her for some reason, and totally backed me up. My cat gentle attacked her and I thought it was super funny.",
            "I'd sleep with one eye open if I were you. You might wanna get your gf flowers and treats for her bodyguard kitty asap!!",
            "Spare human did you raise your voice to my mommy?  MY MOMMYYY?!!!",
            "The cat says apologize now, hooman!",
            "Apologize and then you will have nothing to be afraid of :)",
            "\"just say the word and I slice his throat tonight, mother\" - cat over reacting, probably.",
            "Somebody's gonna pee on your pillow.",
            "Lmao please tell me you took your phone out in the middle of an argument to start taking photos of her cat",
            "The cat is so cute, I love the hair that is near her ears, looks like a good kitty",
            "Upset the hooman mistress you get the murder mittens buddy boy . Your an accessory she’s mommy , your expendable very expendable and I know how to operate the wood chipper"
        ]
    },
    "Update: my cat was in fact pregnant.": {
        "title": "Update: my cat was in fact pregnant.",
        "score": 8231,
        "url": "https://i.redd.it/3lnzlu707e9d1.jpeg",
        "content": "I shared this post a little while ago asking if my cat was pregnant. You guys all said that she def was and I thought I’d share that she gave birth to 6 kittens! \n\nHere is the original post. \n\nhttps://www.reddit.com/r/cats/s/knamkcuAMy\n",
        "num_comments": 193,
        "comments": [
            "Thats a trail mix of kitties",
            "And a variety pack too! Congrats on all the free mouse control apprentices, they look extremely capable already! 🤗",
            "Looking at the original post, dayum that momma was *big*",
            "And you were hoping for a small litter 😂",
            "Okay I’ll take the tuxedo and tortie babies lol",
            "It’s criminal that we only have one pic of the babies",
            "But are you 100,% certain. 😂",
            "Is that a flea collar? Please take that off the mama! It's not safe to be around the newborns..",
            "That dilute tortie is so cute!!",
            "omg it’s like all her colors were put through a prism and turned into kittens 🥲"
        ]
    },
    "Was not expecting that sound": {
        "title": "Was not expecting that sound",
        "score": 1132,
        "url": "https://v.redd.it/xg5rtgq78g9d1",
        "content": "",
        "num_comments": 57,
        "comments": [
            "Aww. Definitely not the sound I would expect.  Adorable",
            "Is this a lynx? I thought so because of the HUGE fluff on the sweet peets and the long swishy tail (rules out a bobcat, right?) \n\nSWEET BABY",
            "That's probably how I would die: if I heard a kitty like that, I would see it as an invitation and give him some nice belly rubs... 🤕🫣😅",
            "Those are magnificent murder mittens!",
            "That is definitely an excuse me horn, and not get outta my way",
            "In my experience the bigger the cat, the squeakier the voice😄",
            "I always loved the fact that their paws look like oversized slippers",
            "Cheetahs sure don't sound like they look either",
            "Usually their sounds are more growly and murdery",
            "No matter how big, a cat is a cat."
        ]
    }
}