{
    "In response to BYU declaring themselves as having the coldest chocolate milk in the country, Mississippi State declares it has the best cheese in college football": {
        "title": "In response to BYU declaring themselves as having the coldest chocolate milk in the country, Mississippi State declares it has the best cheese in college football",
        "score": 2012,
        "url": "https://x.com/hailstate/status/1804243829371080951?s=46&t=6Y38qwObrgLGB3ty47e55Q",
        "content": "FYI, you haven’t discovered Edam cheese, I’d try to order some. It’s unreal. ",
        "num_comments": 836,
        "comments": [
            "Oh you're fuckin dead Mississippi State",
            "God damnit, I'm certain BYU alum Coach Mike Leach would have been the perfect person to weigh in on this.\n\nRIP CML",
            "Look y'all all Ole Miss people will vouch for Edam cheese. There's a waitlist to buy it for a reason. Having some at your tailgate is a flex.\n\nThat said I would love to try WSUs and Wisconsins offerings some day!",
            "Wisconsin, Mississippi State and WSU flairs all in on this\n\nBegun, the Cheese Wars have.",
            "I feel like a fight between Wisconsin and Mississippi state is gonna break out with a bunch of cheez it’s gathered around them yelling, “cheese, cheese, cheese”",
            "hol up",
            "(Spits out my cougar gold) …excuse me?",
            "This is Cougar Gold erasure and I will not stand for it. I will fight for WSU and their cheese.",
            "HAHAHHAHAHAHAHA…\n\nPause, breath.\n\nHAHAHAHAHAHAHAHAHAHAHAHA.",
            "Wisconsin slander!"
        ]
    },
    "In response to the cheapest beer in CFB dispute between Tulane and the Ragin' Cajuns, BYU declares itself home of the coldest chocolate milk": {
        "title": "In response to the cheapest beer in CFB dispute between Tulane and the Ragin' Cajuns, BYU declares itself home of the coldest chocolate milk",
        "score": 614,
        "url": "https://www.reddit.com/r/CFB/comments/1dlafcn/in_response_to_the_cheapest_beer_in_cfb_dispute/",
        "content": "https://x.com/BYUfootball/status/1804210289564660210",
        "num_comments": 272,
        "comments": [
            "Wouldn't this perhaps have too much sugar for BYU students? Don't want them getting all rambunctious. How about some non-fat ice milk instead?",
            "I'd love to see an ice cream competition between schools. The Creamery chocolate milk and ice cream are craaaazy good. Would be fun to sample other schools' best!",
            "This is incredible banter and the most BYU response I can think of.",
            "Can't believe our social media team is just letting this stand, cmon dairy state!",
            "I'm waiting for BYU to get a NIL deal with one of the local soda shop chains.",
            "Congratulations!\n\nI don’t think anyone was challenging for your crown there but go off BYU!",
            "I was in Utah this Spring with downtown so I went to a BYU baseball game and had to go by the creamery. The chocolate milk was really good but it was chocolate milk, nothing special. \n\nHOWEVER the Cookies & Cream Milk was unreal! There’s some truth to the hype",
            "It’ll put you in a sugar coma, but the BYU creamery also sells cookies and cream milk and it is heavenly, easily my favorite drink money can buy.",
            "I’ve tried it, it’s so fucking good",
            "BYU chocolate milk and the ice cream in the stadium go so unbelievably hard. Believe the hype."
        ]
    },
    "What’s the funniest moment in recent CFB history to y’all?": {
        "title": "What’s the funniest moment in recent CFB history to y’all?",
        "score": 44,
        "url": "https://www.reddit.com/r/CFB/comments/1dlpxsm/whats_the_funniest_moment_in_recent_cfb_history/",
        "content": "Hearing Ryan Day scream about “Ohio vs the world!” while being fried out of my mind still cracks me up #WheresLouHoltz",
        "num_comments": 141,
        "comments": [
            "Pole Assassin is an all time favorite memory for me.",
            "[First thing that came to mind.](https://streamable.com/dbjm7a)",
            "Nothing is funnier than losing by refusing to do the victory formation",
            "How is it not the picture of Stalions on the CMU sideline with the video glasses?",
            "Ooooh there’s a few that come to mind. The weird dog peeing Ole Miss Egg Bowl celebration, the whole Connor Stallions saga, and the Florida shoe throwing incident are on the list for me. \n\nBut my favorite was the Miami vs GA Tech game from the past year. Hilarious collapse and ending to that game, it’s an all time great collapse.",
            "Uh... when a Utah player drops the ball before entering the end zone! I wish I knew how to upload the video!\n\nPlus since you mentioned Ryan Day... I loved when Whittingham said \"you're welcome Day!\"",
            "In no order:\n\n[shoe toss](https://youtu.be/Fif3Rkl5_nQ?si=-2twZeybLT4vlc6i)\n\n[the piss and the miss](https://youtu.be/hPek6FrrKYE?si=RnFPYib3GTzv7He-)\n\n[what is Britney doing with her life?](https://youtu.be/1ZaWvk6j0hk?si=yIH29iRjKz0IHC4A)\n\n[he was giving him the business](https://youtu.be/Gmn7luiDPsU?si=j7zq3i_PNaqIZpXM)",
            "Georgia State decisively beating Tennessee in Neyland. \n\nNew Mexico State beating the dog shit out of Auburn in Jordan Hare.\n\nMarco Wilson cleat yeet.\n\n[Louisville's Willie Tyler doing a cartwheel in an attempt to distract Boston College's defense (didn't work)](https://youtu.be/WcPiSfyzPZU)",
            "Seriously. Who throws a shoe?",
            "Jameis Winston just slipping and dropping the football against Oregon in the CFP will always be top of this list for me lol. \n\nI also get a kick out of the UGA football players who get arrested for a traffic offense every other week. I have a buddy who went to UGA who swears this is an issue with Athens PD and not UGA."
        ]
    },
    "The Penn State Whiteout Should Always Be At Night": {
        "title": "The Penn State Whiteout Should Always Be At Night",
        "score": 807,
        "url": "https://www.blackshoediaries.com/2024/6/21/24183082/penn-state-football-nittany-lions-whiteout-game-should-be-at-night-every-year-fox-big-noon-kickoff",
        "content": "",
        "num_comments": 213,
        "comments": [
            "From a marketing perspective, having the White Out at night vs a top tier opponent is good for the conference. Unfortunately FOX having multiple premium picks to throw it at noon lowers that chance.\n\nWish we made that one of our \"tolerances\" the big boys of the conference get, maybe trade it in exchange FOX gets one of our home games to put on Friday night.",
            "Going there in 2018 was probably my favorite away game ever..... great atmosphere, great game and the Penn State fans were really nice",
            "Fuck Fox for a variety of reasons but most especially Fuck Big Noon.",
            "I wonder if Penn State is working behind the scenes here to try to get a some assurances on start times because even if they do Illinois, if might not even be a night game. \n\nPretty ridiculous how the big ten doesn’t step in on the one tradition PSU has. ",
            "[This atmosphere](https://www.youtube.com/watch?v=VypxiD8GOxY) should be one that is NEVER messed with.  Listen to that shit.",
            "I also wish they were announced along with the B1G schedule.  I know there's a bidding process for games, but as someone who would LOVE to see a white out game, it's hard to plan in advance (and there's rarely any hotels available in State College for big games as it is).",
            ">So my plea to you, Fox executives: If deviating from the noon window is a bridge too far for you, do us all the favor and pick Oregon vs Michigan now. You’re sure to get enough eyeballs on that game to “win the window” just the same. And we, the people who still care enough about our traditions, get to keep what makes the Whiteout special.\n\n>Isn’t that why Oregon, Washington, USC, and UCLA are members of the Big Ten now? So you can showcase them? So Fox, do us all a solid, and showcase them, if you’re not going to play showcase the Whiteout at night.\n\nTotally agree that Oregon vs Michigan is the much better game and should get the noon slot. \n\nI mean... only a bunch of sickos would want to see Ohio State beat a team that they have won 11 of the last 12 against including 7 in a row.",
            "As a fan of a team that often plays against PSU in these white outs, I'd rather them put the games at 6AM.",
            "Blame Big Noon Kickoff for ruining one of the best atmospheres in sports.",
            "Of course it should. As an opposing fan I have a robust fear of white out night games in Happy Valley. Day white outs just don’t have the same effect."
        ]
    },
    "To what food or beverage should your team lay claim in the newly-launched \"Superlative in CFB\" war?": {
        "title": "To what food or beverage should your team lay claim in the newly-launched \"Superlative in CFB\" war?",
        "score": 203,
        "url": "https://www.reddit.com/r/CFB/comments/1dlg920/to_what_food_or_beverage_should_your_team_lay/",
        "content": "So far:\n\nTulane claimed cheapest beer; Louisiana Lafayette challenged that. \n\nBYU claimed coldest chocolate milk and sobriety. Some mild pushback, though not on the sobriety. \n\nMississippi State claimed cheese, angering Wazzu fans and Wisconsinites.",
        "num_comments": 588,
        "comments": [
            "Most toxic nuts.",
            "Best wood.",
            "Most efficiently slaughtered chicken\n\n\nfor those of you who don't appreciate a good dino nuggie \n- GT has a lot of students working on projects for various chicken companies around Georgia, and a lot of those projects revolve around the efficient slaughter of the aforementioned chickens. A friend of mine described the project he was working on as \"like a dry cleaner's carousel but for chickens\"\n\n- Other friend who works for Lockheed martin gets to shoot frozen chickens at active jet turbines to simulate bird strikes\n\n- Either way, nerds be fucking up some chickens",
            "Most helpful academic tutors!",
            "The Yellowest Hammers",
            "Tightest fitting jorts",
            "Best (worst) mixed drink: the boilermaker",
            "Soggiest Doritos",
            "Kansas: Best Trough Urinals",
            "Worlds worst mcdonalds"
        ]
    }
}