{
    "2025 3* DL Derry Norris commits to Georgia Tech": {
        "title": "2025 3* DL Derry Norris commits to Georgia Tech",
        "score": 17,
        "url": "https://www.reddit.com/r/CFB/comments/1dr9j88/2025_3_dl_derry_norris_commits_to_georgia_tech/",
        "content": "[Player 247 profile page](https://247sports.com/player/derry-norris-46138906/)\n\n[Source](https://www.si.com/college/georgiatech/football-recruiting/breaking-georgia-tech-lands-major-2025-dl-target-derry-norris-01j1gmtzw812)\n\nMade with the /r/CFB [Recruiting Post Generator](https://www.redditcfb.com/recruiting.php)",
        "num_comments": 3,
        "comments": [
            "He did a Miami fake out hat before putting on the Ga Tech cap lol",
            "We dropped him",
            "Cold as ice - https://x.com/RivalsJohnson/status/1806854102942375946?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet\n\nWelcome to the flats!"
        ]
    },
    "A Modern History of A&M and the University of Texas at Austin (The Doldrums of the Lone Star Showdown).": {
        "title": "A Modern History of A&M and the University of Texas at Austin (The Doldrums of the Lone Star Showdown).",
        "score": 339,
        "url": "https://www.reddit.com/r/CFB/comments/1dqs2v3/a_modern_history_of_am_and_the_university_of/",
        "content": "There are a lot of narratives in collegiate rivalries of \"big brother and little brother\". However, this is not the case in most rivalries outside of bedlam. Below is a timeline of the Lone Star Showdown post A&M leaving the Big 12. I am biased since I am a graduate of A&M. I hope this generates some discussion and hopefully pisses off a texas fan after they just bought a longhorn shirt from their local Walmart. But in all seriousness please let this thread serve as a living document to document this dark time of this rivalries history and report it so that we may not repeat this travesty.\n\n* 2012 - A&M makes its historic move to the SEC and hires its first black head coach, texas watches from the sidelines as Mac Brown struggles to find success after Colt McCoy left. A&M then becomes recognized as a household name with the recent win of a Heisman trophy, and further stakes claim of a change in times by [taking Oklahoma behind the woodshed like a rabid dog](https://www.youtube.com/watch?v=9WGzs9UaROc).\n\n* 2014 - the university of texas at Austin (which still had a statue of Jefferson Davis despite the Confederate president having no ties to the school) hires *their* first-ever black head coach, because they're getting slaughtered in recruiting due to the perceived optics from recruits between the two schools.\n\n* 2016 - The experiment of hiring Charlie Strong fails (like most people expected), and texas goes back to the drawing board in all of its mensa genius and hires (vodka) Tom Herman. Thinking that they could see the same success from a Houston head coach as A&M, texas makes this move that *surprise surprise* doesn't work out. \n\n* 2017- Kevin Sumlin just can't get over the hump of LSU and produces above-average season after above-average season. But he can't break the glass ceiling of being a great coach and winning the biggest of games. They then go on to hire a coach from a National championship-winning background, just grasping at straws to take their program from above average to great.\n\n* 2021 - 4 years have passed and up until this point Texas came shooting out the gates with Herman making a big splash in his second year beating Georgia in the Sugar Bowl. But unfortunately, that was the beginning of the end for good ole vodka tom who boasted a 25% win rate against Oklahoma and TCU, and a 50% win rate against Iowa State. Meanwhile, the Jimbo Fisher experiment is running just like it was intended, Jimbo has finally started to win against LSU, and A&M has shown it is lightning in a bottle with the talent to beat anyone in the country (including the SEC champ and 2021 National runner up in Alabama). A&M is out recruiting texas, being much more competitive in a much harder conference than texas is in the Big 12, and thus CDC and texas leadership decide to part ways with Herman to take a new direction. A new coach with national championship experience. Except since they cannot afford to hire a head coach with a national championship under their belt, they sort through the clearance bin at The Nick Saban Center for coaches that can't coach good and want to learn to do other stuff good too and land with Sark. (Oh by the way, they also follow the lead of A&M by joining the best football conference in the county... or at least they announce the move now).\n\n* 2023 - The Jimbo Fisher experiment has come to a drastic halt. The program has imploded for a number of reasons under Fisher's tutelage, and the university has decided to part ways with coach fisher despite poor moves such as gaudy contract extensions while never actually winning anything of merit. Regardless of the buyout looming over their heads, A&M leadership had to make the call to cut ties, they went back to the drawing board and settled on who they believe is their guy in Mike Elko. Meanwhile, Sark and the longhorns have had their first taste of success. Finally winning a conference title, in a Big 12 that is at its lowest in terms of quality of teams (making texas the shiniest piece of shit on top of a pile of shit). Also, the longhorns became the second team in the state of Texas to make it to the CFP and ultimately choked to sarks former employer before he became an alcoholic. \n\n* 2024 - Fast forward just a little bit to the current day and the nuclear fallout in the College Baseball world. UTa is still playing catch up with A&M, hiring Jim Schlossnagel (who probably has sex with Dr. Ward while CDC watches) after an appearance in the CWS final with A&M. They have also given Sark a *gaudy* contract extension to the tune of $10m/year. \n\nBeing fully caught up to the present day. Both programs are in a state of disarray, A&M is still working to find a new baseball coach, a first-year head football coach, and Buzz is running a very average basketball program. At the same time, texas is having trouble finding its identity slowly fading from relevance across the state and albeit the nation, as it is no longer recognized as *the* university in the state. Will texas learn from the mistakes of A&M? Only time will tell.  \n\nFinal note: UT is an acronym that is up for debate across the country among college sports fans... it could be texas or the University of Tennesee. But when you say A&M, everyone knows who you're talking about.",
        "num_comments": 713,
        "comments": [
            "Was not expecting Oklahoma State to catch a body within the first few sentences",
            "Who else thinks this guy drives a lifted suped up Ford F-350 that he’s never taken off road",
            "this concept of little brother is so overblown, and in many cases it really only applies to football in the context of universities as a whole. but man, some of you aggies love to remind us of its legitimacy.",
            "TLDR: Texas A&M is successful because they hired a black coach and have 2 top ten seasons since 2012. Texas is not successful despite hiring a black coach and have 2 top ten seasons since 2012.",
            ">2012 - A&M makes its historic move to the SEC\n\nI don't even know who you are",
            "> But when you say A&M, everyone knows who you're talking about.\n\nGood point! Love me some Florida A&M. Go Rattlers!",
            "Did anyone actually read all of that drivel?",
            "Amazing. They just do this to themselves time and time again.",
            "I’m not reading all that but 1) hook’em 2) scoreboard 3) thanks for ur baseball coach",
            "I remember when Aggies would start their “history monologues” with the Jackie Sherrill era. That way they could try and claim a winning record and also look past the national titles Texas won. Now they’re skipping the most recent titles and the national championship game loss to Bama and trying to downplay Texas’ playoff run. As far as playing “catch up” in baseball, Texas has 6 freaking national titles and stole the Aggies’ coach.\n\nThis is pretty damn hysterical"
        ]
    },
    "[Berkowitz] According to recent IRS filings, the NCAA has spent nearly $600 million on attorney fees and other legal expenses since the Alston vs. NCAA antitrust case began in 2014": {
        "title": "[Berkowitz] According to recent IRS filings, the NCAA has spent nearly $600 million on attorney fees and other legal expenses since the Alston vs. NCAA antitrust case began in 2014",
        "score": 581,
        "url": "https://x.com/ByBerkowitz/status/1806458349195591744?s=19",
        "content": "",
        "num_comments": 129,
        "comments": [
            "Note that a not insignicant portion of those billable hours also went to head injury lawsuits and molestation lawsuits and the insurance coverage litigation associated with those",
            "The hours? Oh, they are billable and they are undefeated.",
            "What a fucking waste of time & energy.",
            "You know this sub is cooked when there's more Billable Hours jokes than actual discussion about the article",
            "Imagine the number of scholarships that could have been funded by schools instead if they were just willing to admit that players for a multi billion dollar industry whose games are broadcast nationally and frequently draw 6 figure attendances are not amateurs.",
            "that's a lot of millions",
            "And what did it get them?",
            "Sigh, and I still have my LSAT study guide from 2008 gathering dust somewhere.",
            "How many Harvey Specters & Mike Ross's are out there suing the NCAA?",
            "I'm glad to see they're spending less money on attorney fees, inflation adjusted\n\n^^^^^^^^^^^^^/s"
        ]
    },
    "Texas QB Arch Manning on playing time in 2024:  “I feel like I’m getting better every day. Just trying to stay ready. Anything can happen. I’m excited and I’m gonna be ready.”  ": {
        "title": "Texas QB Arch Manning on playing time in 2024:  “I feel like I’m getting better every day. Just trying to stay ready. Anything can happen. I’m excited and I’m gonna be ready.”  ",
        "score": 320,
        "url": "https://www.on3.com/college/texas-longhorns/news/arch-manning-playing-time-2024-anything-can-happen-passing-academy/",
        "content": "",
        "num_comments": 133,
        "comments": [
            "The media is doing its best to manufacture a QB controversy.",
            "UT gets a Manning. Other UT gets a Manning. EVERY UT GETS A MANNING!",
            "Not to be Debbie downer but based upon the last two seasons with ewers injuries, there’s a good chance Arch has to start a game or 3.   The controversy appears if he completely goes off during those games.  ",
            "“Is Arch begging for his starting QB to be injured just so he can play?”\n\n-ESPN",
            "We needed you against Japan apparently. Could’ve been ready for that. \n\nA national embarrassment 😭😭😭😭😭",
            "This dude definitely took his media training in high school seriously",
            "Dude should definitely be more locked in without the distraction of him being in a video game around",
            "If Quinn gets injured again I’d bet Arch takes the job and never looks back",
            "how many lambos do you think we gave him in order to convince him to sit out for 2 full years when he could be the day 1 starter on any other team in the country",
            "Hate it or love it, when Texas is an actual threat college football is fun"
        ]
    },
    "2025 4* RB Akylin Dear decommits from Ole Miss": {
        "title": "2025 4* RB Akylin Dear decommits from Ole Miss",
        "score": 90,
        "url": "https://www.reddit.com/r/CFB/comments/1dqx42s/2025_4_rb_akylin_dear_decommits_from_ole_miss/",
        "content": "[Player 247 profile page](https://247sports.com/player/akylin-dear-46139023/)\n\n[Source](https://x.com/hayesfawcett3/status/1806828095602598226?s=46&t=fwgmryeTanENut7u28ScCA)\n\nMade with the /r/CFB [Recruiting Post Generator](https://www.redditcfb.com/recruiting.php)",
        "num_comments": 91,
        "comments": [
            "Aaaand there it is. \n\nI’ll see y’all when the season starts.",
            "That’s the sound of a Husky in Tuscaloosa roaring",
            "Courtney Morgan has entered the chat",
            "We offered this guy. It means we have a chance.",
            "RB’s in Lane’s offense put up absurd numbers, he was OC for Reggie Bush and Derrick Henry’s  heisman years, Mississippi produces future NFL backs year in and year out and we can’t land any of them. Our RB recruiting is absolutely cursed, and I don’t understand why.",
            "I was told Tuscaloosa tuberville couldn't recruit. What is this shit",
            "Tf is going on with Ole Miss?",
            "Wonder if he hunts. He should with that name",
            "Lane Kiffin reaffirming the portal merchant allegations",
            "I know this is hardcore coping but it feels like recruiting means so little these days I struggle to get excited or disappointed when kids commit or decommit."
        ]
    }
}