{
    "May his glory live forever!": {
        "title": "May his glory live forever!",
        "score": 14167,
        "url": "https://v.redd.it/ubdd83mslqy81",
        "content": "",
        "num_comments": 431,
        "comments": [
            "It’s mister chadtopia himself",
            "What language is this?",
            "This is actually kinda fire😳",
            "Why is it genuinely good though 💀",
            "Any kind soul here care to translate the lyrics into English?",
            "Considering how young this kid is his musics got some real character, goes soooooo damn hard",
            "Did we ever find out what happened to this kid? He has a lot of star quality!",
            "did he die?",
            "[deleted]",
            "Bro I didn’t understand a single word but listened to the whole thing because it went so hard."
        ]
    },
    "We're back open.": {
        "title": "We're back open.",
        "score": 1274,
        "url": "https://www.reddit.com/r/Chadtopia/comments/14mnnks/were_back_open/",
        "content": "So, I got a message from the Reddit Admin team, and they told me if the sub didn't open back up they would replace the current mod team and force it to reopen. We would rather the current team be able to remain moderating instead of letting someone random take over the sub. So, welcome back! We missed you guys. How have yall been?",
        "num_comments": 138,
        "comments": [
            "Reddit admins being anything but chads",
            "Even if you don't want to change anything else, you could set the sub to NSFW so that no ads can be run. Might not be as effective as closing everything down entirely, but at least it'll hurt ad revenue",
            "Nothing more chad than caving immediately once it’s clear you’ll be replaced.",
            "Mods acting like keeping this sub in its current form is like trying to keep a community center from being demolished",
            "I think there should be term limits to mods, too many out there power tripping",
            "Pretty sad and unchad-like that a bunch of terminally online redditors need their tiny bit of power more than doing the right thing",
            "Not Chad",
            "You guys are pussies lmao",
            "Is this cringetopia? Nothing Chad about this mod team",
            "wow you sure showed them"
        ]
    },
    "Touchy person": {
        "title": "Touchy person",
        "score": 1972,
        "url": "https://i.redd.it/238asqeixf9d1.png",
        "content": "",
        "num_comments": 53,
        "comments": [
            "There's always a bigger fish",
            "This reminds me of the story of the guy that was about to rape a woman and the second rapist raped the first rapist",
            "I saw a story about an “Angel Grinder”. He is a huge gay guy in a gay bar. He just dances around the floor never dancing with anyone. That is until he sees guys grinding on girls that don’t want it (gay bar so girls on girls usually). When he sees it, he swoops in and starts grinding on the guy. They don’t like a guy on them, and he tells them “that’s how the girls here feel about you.” They usually get the clue and leave.",
            "I definitely need an update from that guy.",
            "Twist his dick!",
            "Thought that post was gonna go in a very different direction",
            "Never thought molestation could be used for good. Anyhoo, I hope this plan succeeds.",
            "Someone find this guy, we need an update!",
            "OP is banking on him complaining about it, what if he's into it?",
            "The last thing I need to hear is that the aunt’s husband liked it, that would be some crazy sh*t. But fr, even if you were 4-5 inches shorter, you always stand up with courage to disgusting people like that guy."
        ]
    },
    "I saw this on Twitter.": {
        "title": "I saw this on Twitter.",
        "score": 396,
        "url": "https://i.redd.it/fic6kl2u3g9d1.png",
        "content": "",
        "num_comments": 15,
        "comments": [
            "I used to work as supermarket security and tbh I’d just let food theft, baby food theft, hygiene product theft and things like that go, often with a little wink so they know they’re cool. Only really worth stopping them when they’re trying to take the piss, and even then, you have to ask why they feel the need to steal 15 bottles of vodka and 20 steaks",
            "Remember kids, if you see someone shoplifting food, no you didn't.\n\nIf you see someone shoplifting baby food or formula, it's morally right to help them.\n\nEdit: A lot of you really are out here licking the boots of multinational corporations crying about shrinkage and spreading lies started by the National Retailers Federation. Before you decide poor people doing petty crimes are the worst thing ever, I encourage you to sincerely interrogate your beliefs.",
            "Faith in humanity restored <3",
            "a winning combination lol",
            "I love your username and I hate capitalism.",
            "Reminded me when I was a boy. My dad, grandma, and myself weren’t given an easy life and we make the best of it. We were homeless living in a car with barely enough wic and food stamps to get us by. When money was tight would grab a bag of beef jerky and we would eat it walking around. Sometimes you gotta steal just to make ends meet in this world and I fucking know firsthand not all of the people that steal want to.",
            "https://preview.redd.it/lwg1yeza2h9d1.jpeg?width=360&format=pjpg&auto=webp&s=6db6890741d91211342ee8c775488a84fae19c7b",
            "How much baby food though ?",
            "Robin Hood type beat, amen.",
            "Wow. You're so brave. 😶"
        ]
    },
    "LEGEND": {
        "title": "LEGEND",
        "score": 183,
        "url": "https://i.redd.it/2ljogncalg9d1.jpeg",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}