{
    "May his glory live forever!": {
        "title": "May his glory live forever!",
        "score": 14170,
        "url": "https://v.redd.it/ubdd83mslqy81",
        "content": "",
        "num_comments": 431,
        "comments": [
            "This is actually kinda fire",
            "Why is it genuinely good though ",
            "Any kind soul here care to translate the lyrics into English?",
            "Considering how young this kid is his musics got some real character, goes soooooo damn hard",
            "Did we ever find out what happened to this kid? He has a lot of star quality!",
            "Bro I didnt understand a single word but listened to the whole thing because it went so hard.",
            "Link? I need this in my playlist",
            "Yo I need an English subtitles version ASAP!",
            "God I wish I could chill with my titties out like that.",
            "So this is where the subreddit's pfp came from."
        ]
    },
    "We're back open.": {
        "title": "We're back open.",
        "score": 1271,
        "url": "https://www.reddit.com/r/Chadtopia/comments/14mnnks/were_back_open/",
        "content": "So, I got a message from the Reddit Admin team, and they told me if the sub didn't open back up they would replace the current mod team and force it to reopen. We would rather the current team be able to remain moderating instead of letting someone random take over the sub. So, welcome back! We missed you guys. How have yall been?",
        "num_comments": 138,
        "comments": [
            "Reddit admins being anything but chads",
            "Even if you don't want to change anything else, you could set the sub to NSFW so that no ads can be run. Might not be as effective as closing everything down entirely, but at least it'll hurt ad revenue",
            "Nothing more chad than caving immediately once its clear youll be replaced.",
            "Mods acting like keeping this sub in its current form is like trying to keep a community center from being demolished",
            "I think there should be term limits to mods, too many out there power tripping",
            "Pretty sad and unchad-like that a bunch of terminally online redditors need their tiny bit of power more than doing the right thing",
            "You guys are pussies lmao",
            "Is this cringetopia? Nothing Chad about this mod team",
            "wow you sure showed them",
            "$0/hr internet jannies scared of losing their power lmaooo so fucking pathetic"
        ]
    },
    "I saw this on Twitter.": {
        "title": "I saw this on Twitter.",
        "score": 3862,
        "url": "https://i.redd.it/fic6kl2u3g9d1.png",
        "content": "",
        "num_comments": 107,
        "comments": [
            "I used to work as supermarket security and tbh Id just let food theft, baby food theft, hygiene product theft and things like that go, often with a little wink so they know theyre cool. Only really worth stopping them when theyre trying to take the piss, and even then, you have to ask why they feel the need to steal 15 bottles of vodka and 20 steaks",
            "Faith in humanity restored <3",
            "Reminded me when I was a boy. My dad, grandma, and myself werent given an easy life and we make the best of it. We were homeless living in a car with barely enough wic and food stamps to get us by. When money was tight would grab a bag of beef jerky and we would eat it walking around. Sometimes you gotta steal just to make ends meet in this world and I fucking know firsthand not all of the people that steal want to.",
            "...and no crime was committed. Don't give a fuck what the store says.",
            "I love your username and I hate capitalism.",
            "No wonder why they lock up stuff nowadays.",
            "Hence making it 65. And hurting everyone involved and making it worse for every person almost everywhere. \n\nStupidity. Not heroism. The problem. Not the solution.",
            "With the needless increase on groceries lately, I didn't see anyone steal anything.",
            "Robin Hood type beat, amen.",
            "Whole lotta Javerts in the comment section, when there should be more Jean Valjeans in here"
        ]
    },
    "youch": {
        "title": "youch",
        "score": 862,
        "url": "https://i.redd.it/re3tsd9peh9d1.png",
        "content": "",
        "num_comments": 16,
        "comments": [
            "Thank you very much, but how did you know he had child pornography in a locked drawer in a desk in his office? ....Reasons.",
            "Reminds me of the kids that broke into an abandoned house to get high and found a tiger starving to death in a cage. The 911 operator thought they were hallucinating but they were on the level.",
            "Finally a honest thief, I like it",
            "You are bad guy but this does not mean you are bad guy",
            "That actually turned out to be a productive activity for the burglar lol",
            "This cant be real right? Id think any thing he found during the process of committing a crime wouldnt be valid in receiving a warrant",
            "If this isnt made up I would really appreciate an article or something haha.",
            "Why Does Each Word Begin With A Capitol Letter? Seriously, Is This A Thing Now?",
            "Even in prisons, rapists and child abusers are on the bottom of the totem pole.",
            "I was about to ask if he turned himself in or he lucked out with a diversion to leg it"
        ]
    },
    "good boyfriend": {
        "title": "good boyfriend",
        "score": 931,
        "url": "https://i.redd.it/q519zqk6kg9d1.png",
        "content": "",
        "num_comments": 20,
        "comments": [
            "Im more interested in the thought process of the chaotic evil person below",
            "That's last ones more like chaotic neutral. Chaotic evil would be telling everyone cause your an ass hole even tho its your girlfriend so it looks and on you or whatever",
            "Lol I just tried upvoting his comment",
            "Why do girls always piss themselves",
            "If peeing your pants is cool...consider me Miles Davis!",
            "The 2shivshaco guy has a good idea too if you don't have time to fill a bucket.",
            "Would skip shame and jump right to anger.",
            "Yeah im really baked right now and that sentence is screwing with my head a lot.",
            "That second chaotic \"evil\" is still a good, just a more disgusting one.",
            "I slap my sisters ass all the time, use the 'there was a mosquito there' excuse."
        ]
    }
}