{
    "The Subreddit Icon Poll still exists": {
        "title": "The Subreddit Icon Poll still exists",
        "score": 17,
        "url": "https://www.reddit.com/r/Chainsawfolk/comments/1dpc3o6/the_subreddit_icon_poll_still_exists/",
        "content": "[Not my best work](https://preview.redd.it/5k6lf8pzwz8d1.png?width=2048&format=png&auto=webp&s=68664b2d22baed2b9767faa1fd2c9c48906b4dc1)\n\nThe art contest poll isn't going to be open forever. [Maybe you should go vote on it or something.](https://forms.gle/gn6PfG7ZGGgxoaJE7) Winner becomes the little circle next to the subreddit name.",
        "num_comments": 8,
        "comments": [
            "I'm GLAD you put your thoughts to paper.\n\nKinky.",
            "Kinda made it in a panic to draw people in. Its alright though, just wish I had time to throw in more Aperture elements. I think Ill get around to doing this with other ais too.\n\n(Fun fact: the first idea proposed to me when I was first designing the automod was basically to make her Do-s from one punch man)",
            " i can\n\nSee your art improving",
            "That means a lot actually, most people are too busy with the actual chapter to appreciate the work I put into the announcements.\n\nThanks, your art submission was one of my favorites.",
            "Someone hurt her? :3",
            "Thanks, Id certainly hope Ive improved a bit after a year.\n\nhttps://preview.redd.it/0ma14c1mf69d1.jpeg?width=1440&format=pjpg&auto=webp&s=e61a70de8ec21cb6c16a36887e37707180a67e54",
            "pls vote for this\n\npls pls pls\n\nhttps://preview.redd.it/c1m23uhid69d1.png?width=1080&format=png&auto=webp&s=1482238a4ee43489febc87b2aaf2b69e2b8dbcaa\n\nit would be soooo soo funny if this Wins",
            "I can see that keep cooking \n\nhttps://preview.redd.it/dwctfc0xh69d1.png?width=1080&format=png&auto=webp&s=d9af3060d951fdb0911753d7dd41b4fab22abef4\n\ni genuinely enjoy the funny memes with the chapter announcement \n\nIf it means anything to you"
        ]
    },
    "“Look Back” movie is out in Japan": {
        "title": "“Look Back” movie is out in Japan",
        "score": 94,
        "url": "https://x.com/binobinobi/status/1806477619061456935?s=46",
        "content": "",
        "num_comments": 18,
        "comments": [
            "WHY TF CAN'T I WATCH IT IT WAS SUPPOSED TO RELEASE HERE TOO",
            "Gonna see if its pirated yet BRB",
            "Is there any news for an international theatrical release or do we just wait for streaming? I'm not a fan of seeing anime in theaters, but I can make an exception for this and Reze.",
            "I pray Netflix or crunchyroll buys up the rights before international theatrical release so we can get it sooner rather than later.",
            "Yay. Wish it comes out in International theatres soon.",
            "Is there a way to watch it?",
            "it usually takes 6 months-ish for the international release, we're gonna have to be patient :(",
            "Look Back set its North American premiere date for July 14, 2024",
            "apparently amazon japan is credited in the movie, so i'm thinking amazon prime, but who knows",
            "Its been like a few hours, bro. It usually takes like few days or weeks if we are lucky."
        ]
    },
    "Alright which one of you did this?": {
        "title": "Alright which one of you did this?",
        "score": 373,
        "url": "https://i.redd.it/oavhluk3ag9d1.png",
        "content": "",
        "num_comments": 35,
        "comments": [
            "Hilarious that they never mentioned the image context during the discussion.",
            "This needs to happen or humanity is doomed",
            "Part two in a nutshell",
            "me and the artist if the bottom image follow eachother on Twitter and tumblr but they got banned off Twitter ",
            "Please motor make this canon. Please make a hentai chapter ",
            "A fellow 2WE4U and CSF member? My man  (unless if you are Swedish)",
            "What can you say, theyre like-minded ",
            "DID GIGGUNITED KINGDOM ACTUALLY WATCHED FMA??!!??!?!? WTF",
            "That is just England and France",
            "That's me and my gf"
        ]
    },
    "I Made the elections better your welcome": {
        "title": "I Made the elections better your welcome",
        "score": 720,
        "url": "https://i.redd.it/xd0gurwxbe9d1.png",
        "content": "",
        "num_comments": 72,
        "comments": [
            "She got that bum Yoshida as her running mate idc who it is Im not voting for him",
            "Where is Powerful Power? :3",
            "Makima will solve war by tormenting one very specific Japanese child.\n\nYou can question her methods, but you can't question the results! War is weak and the kid is beyond broken.",
            "Only time Id ever vote Republican",
            "What is himmys abortion stance?",
            "Ass vs titties, the greatest battle of all time",
            "you just added another groomer",
            "Neither. I'm voting for Beam as head of the libertarian party.",
            "why the fuck is makima from new jersey",
            "Makima would fit better as a Republican tbh"
        ]
    },
    "Ladies and Gentlemen, pick a seat": {
        "title": "Ladies and Gentlemen, pick a seat",
        "score": 1625,
        "url": "https://i.redd.it/wbmocwaxxc9d1.png",
        "content": "",
        "num_comments": 439,
        "comments": [
            "1. Kishibe is dope, denji is fun, reze is wife. Literally no negatives.",
            "5, Yoshida and Asa wouldnt talk the whole flight. ![img](emote|t5_466dsm|51207)",
            "2 2 2 2 2 ALL DAYYYYYYYY",
            "4 bc I love food and Fami (I will eat both)",
            "Three, hopefully she caresses my thigh ",
            "Id pick seat 4 and perma eat with fami",
            "7 because its far from Powers stench and I get to talk to Beam",
            "I'll pick 1\n\nMe and Reze are going to have so much fun...",
            "5 bcs Makima will keep me protected (unless she needs me dead for some reason), and I'm also surrounded by (somewhat) reliable people.\n\nI considered to pick 1 or 6, but 1 is scary since Reze could unintentionally blow me to bits (aoe), and 6 id hard pass because of Beam (he's usually quite violent, but he's pretty calm around Denji and Makima).",
            "3 so Himeno can give me a handjob while the angel devil pokes my back with his femboy dick "
        ]
    }
}