{
    "[DISC] Chainsaw Man - Ch. 169 links": {
        "title": "[DISC] Chainsaw Man - Ch. 169 links",
        "score": 1178,
        "url": "https://www.reddit.com/r/ChainsawMan/comments/1do7xo3/disc_chainsaw_man_ch_169_links/",
        "content": "**Source**|**Status**\n:--|:--\nMangaplus|[Online](https://mangaplus.shueisha.co.jp/viewer/1021274)\nViz| [Online](https://www.viz.com/shonenjump/chainsaw-man-chapter-169/chapter/43432?action=read) \n\n#[Join us on Discord!](https://discord.gg/chainsawman) \n\n\\----\n\n[View Poll](https://www.reddit.com/poll/1do7xo3)",
        "num_comments": 1092,
        "comments": [
            "Bruh is this guy William Afton or something, he’s always coming back smh",
            "for how large this ragtag group has become, they share one collective brain cell",
            "Denji: Am I happy... or am I unhappy?\n\nBarem: Did I hear someone say happy?",
            "I’m glad Denji didn’t even *think*. He saw that cocksucker, and was ready to end him.\n\nAlso, I’m glad I finally know where eyepatch guy has been.",
            "bro was about to kill barem on the spot 💀",
            "Post nut clarity Dennis to Daddy Denji when Nayuta is concerned",
            "denji asking himself if everyone in the restaurant has gotten a handjob made me giggle out loud",
            "Does anyone else find it interesting that Denji chose to try to stab Barem in the back instead of just transforming?",
            "Apparently in Japanese Famine could be mumbling something sounding like \"police\" while eating so it seems she knows.",
            "Keep in mind, all Barem said was that he'll take him to Nayuta. That doesn't necessarily mean an \"alive\" Nayuta"
        ]
    },
    "Chapter 169: Sushi Scene": {
        "title": "Chapter 169: Sushi Scene",
        "score": 1253,
        "url": "https://i.redd.it/ceig80wfj89d1.png",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Bro fat barem can't hurt you.\n\nFat barem:",
            "**why the fuck is Fami eating a giant piece of sushi with ketchup**",
            "why does barem look like the average ugly bastard",
            "Barem Devito never crossed my mind but thank you for this",
            "It gave me Fear and Hunger vibes",
            "The Barem design is hilarious! I like this take on the scene!",
            "Jimmi Simpson would make a good Denji",
            "I want TAMAGO home and YAKI any time I see Barem.",
            "fami really has two wolves inside of her",
            "Is fami eating sushi with ketchup? Fucking heresy"
        ]
    },
    "Gun Devil": {
        "title": "Gun Devil",
        "score": 618,
        "url": "https://www.reddit.com/gallery/1dqdqkr",
        "content": "",
        "num_comments": 19,
        "comments": [
            "Sorry for the repost! Just fixed a small error I didn't notice before",
            "This is giving Shin Godzilla vibes. I like it :D",
            "This looks amazing, I can’t wait to see how demonic they make it look in the anime",
            "The wide view, scenery, coloring/rendering, and portrayalq of the gun devil is very amazing!",
            "This is awesome, can you share the high-res too?",
            "Ah how innocent I was when I thought the Gun Devil was gonna be the final villain of Chainsaw Man",
            "Don't apologise for greatness, my friend. This is amazing work. The colors are so haunting. Gives me vibes of those mysterious/ horror short films about a disaster",
            "Thank you! The Godzilla movies heavily inspired my gun devil projects ^^",
            "Aw thank you! And same honestly, I love red-black color palettes they go hard asf",
            "I completely agree on that my friend. Great tones you picked"
        ]
    },
    "Beam boyo vs Santa Claus": {
        "title": "Beam boyo vs Santa Claus",
        "score": 67,
        "url": "https://v.redd.it/c3s3scah6b9d1",
        "content": "",
        "num_comments": 3,
        "comments": [
            "The designs, colors, and movements for them look pretty great!",
            "this is pretty sick. It’s nice to see your drawings in action, especially some CSM. beam my man is still the goat",
            "Thanks, Belltwo"
        ]
    },
    "Makima + Pochita!": {
        "title": "Makima + Pochita!",
        "score": 1040,
        "url": "https://i.redd.it/azdlx2jmr69d1.png",
        "content": "",
        "num_comments": 24,
        "comments": [
            "Ahhh! Now I understand, why she was so cruel. She was jealous of Denji over cute puppy.",
            "If she got lots of hugs like nayuta",
            "If Makima found Pochita first.",
            "makes sense for the chainsaw dog to be treated this way by makimussy",
            "The style and poses are very nice with good coloring!",
            "When framed this way, it doesn't look so bad.",
            "If makima and denji switched places ,would be crazy tho",
            "Makima Wants A HUG Plus She Did Nothing Wrong",
            "I thought the + was an X for a second...",
            "I see this is how things would have gone in an alternate universe where  she killed Denji in the cemetary if his sneak attack failed."
        ]
    }
}