{
    "New Rule for Posts: Name of the Series/Media Must be in the Title of the Post": {
        "title": "New Rule for Posts: Name of the Series/Media Must be in the Title of the Post",
        "score": 798,
        "url": "https://www.reddit.com/r/CharacterRant/comments/18d0pcw/new_rule_for_posts_name_of_the_seriesmedia_must/",
        "content": "This rule has been a longtime \"unofficial\" rule but hasn't been strongly enforced due to that, so here it is now as an official rule.\n\nThere are some exceptions to this such as not needing to include the series name in the post title in it already includes the series' namesake character such as \"Why Naruto shouldn't have gotten that shitty haircuit\" or \"Why Samurai Jack should've kept that cool ass beard.\" Another exception would be more general threads which bring up multiple different series as examples in the body posts, such as a post called \"Characterization in Shonen\" which brings up examples from Naruto or Bleach in its body text. But then you should generally at least specify the title of the different series in the actual post.\n\nWe've also hit over 100k members, so moderation is going to be a little more proactive to compensate. Apologies if your modmail messages haven't been answered, we're going through them.\n\nAnd feel free to use this post for any suggestions you want to make to the subreddit.",
        "num_comments": 78,
        "comments": [
            "Literally [1984 by George Orwell]",
            "JJK fans in shambles. It's truly gojover.",
            "“Why Makoto is a Bad Character” do you KNOW HOW LITTLE THAT NARROWS IT DOWN-\n\nOkay I haven’t actually seen a post titled that but like I’ve seen a lot of posts like it, so this is a good rule.",
            "Can we ban people who smugly insist you should know what the series is based on a common character name too? I remember that from a while ago and the weirdly hostile defensiveness about it.",
            "On a side note, nice to see we've hit 100k members. Hopefully, we get a bit more variety in the posts cause of this.",
            "If you need any extra mods, I promise to occasionally handle rule-breaking content, while abusing my tiny quantity of power to lord over people who disagree with me about weeb nonsense.",
            "You might want to consider including \"Abbreviations of the name don't count as including the name.\" in the rule. I've had about as much trouble from people people solely using a JJK/MHA type abbreviation for a series I was unfamiliar with, as I have with people ranting without mentioning the series name at all.",
            "Agreed.\n\nSometimes, not everyone will get what you're addressing when you rant about a series but didn't put the name of said series on the title of the post. I get some series are so popular that just naming the characters will honestly be enough. But sometimes you're just going to run into someone who doesn't know the characters at all...Then arguably go through possible walls of text just to find what in the world is being ranted about. \n\nAnd frankly, it's just an easy request not worth getting angry about. Put the name of the series of the rant is about that specific and you'll avoid a lot of hassles.",
            "aw, i was hoping to do a low effort sunday post where i just rant about a completely nonexistant series and leave the comments to guess what i'm talking about as a sort of passive aggressive jab at this, but i guess no point in that anymore lol.",
            "Thank the fucking gods\n\nAlso ban spoilers in titles"
        ]
    },
    "What can and (definetly can't) be posted on the sub :)": {
        "title": "What can and (definetly can't) be posted on the sub :)",
        "score": 109,
        "url": "https://www.reddit.com/r/CharacterRant/comments/1clbns3/what_can_and_definetly_cant_be_posted_on_the_sub/",
        "content": "Users have been asking and complaining about the \"vagueness\" of the topics that are or aren't allowed in the subreddit, and some requesting for a clarification.\n\nSo the mod team will attempt to delineate some thread topics and what is and isn't allowed.\n\n# Backstory:\n\nCharacterRant has its origins in the Battleboarding community WhoWouldWin (r/whowouldwin), created to accommodate threads that went beyond a simple hypothetical X vs. Y battle. Per our (very old) sub description:\n\n>This is a sub inspired by r/whowouldwin. There have been countless meta posts complaining about characters or explanations as to why X beats, and so on. So the purpose of this sub is to allow those who want to rant about a character or explain why X beats Y and so on.\n\nHowever, as early as 2015, we were already getting threads ranting about the quality of specific series, complaining about characterization, and just general shittery not all that related to \"who would win: 10 million bees vs 1 lion\".\n\nSo, per Post Rules 1 in the sidebar:\n\n>Thread Topics: You may talk about why you like or dislike a specific character, why you think a specific character is overestimated or underestimated. You may talk about and clear up any misconceptions you've seen about a specific character. You may talk about a fictional event that has happened, or a concept such as ki, chakra, or speedforce.\n\nWell that's certainly kinda vague isn't it?\n\n# So what can and can't be posted in CharacterRant?\n\n✅ **Allowed:**\n\n* **Battleboarding** in general (with two exceptions down below)\n* **Explanations**, **rants**, and **complaints** on, and about: characters, characterization, character development, a character's feats, plot points, fictional concepts, fictional events, tropes, inaccuracies in fiction, and the power scaling of a series.\n* **Non-fiction** content is fine as long as it's somehow relevant to the elements above, such as: analysis and explanations on wars, history and/or geopolitics; complaints on the perception of historical events by the general media or the average person; explanation on what nation would win what war or conflict.\n\n❌ **Not allowed:**\n\n* he 2 Battleboarding exceptions: 1) hypothetical scenarios, as those belong in r/whowouldwin;2) pure calculations - you can post a \"fancalc\" on a feat or an event as long as you also bring forth a bare minimum amount of discussion accompanying it; no \"I calced this feat at 10 trillion gigajoules, thanks bye\" posts.\n* Explanations, rants and complaints on the technical aspect of production of content - e.g. complaints on how a movie literally looks too dark; the CGI on a TV show looks unfinished; a manga has too many lines; a book uses shitty quality paper; a comic book uses an incomprehensible font; a song has good guitars.\n* Politics that somehow don't relate to the elements listed in the \"Allowed\" section - e.g. this country's policies are bad, this government is good, this politician is dumb.\n* Entertainment topics that somehow don't relate to the elements listed in the \"Allowed\" section - e.g. this celebrity has bad opinions, this actor is a good/bad actor, this actor got cast for this movie, this writer has dumb takes on Twitter, social media is bad.\n\n# ADDENDUM -\n\n* *Politics in relation to a series and discussion of those politics is fine, however political discussion outside said series or how it relates to said series is a no, no baggins'*\n* *Overly broad takes on tropes and and genres? Henceforth not allowed. If you are to discuss the genre or trope you MUST have specifics for your rant to be focused on. (Specific Characters or specific stories)*\n* *Rants about Fandom or fans in general? Also being sent to the shadow realm, you are not discussing characters or anything relevant once more to the purpose of this sub*\n* *A friendly reminder that this sub is for rants about characters and series, things that have specificity to them and not broad and vague annoyances that you thought up in the shower.*\n\n**And our already established rules**:\n\n* No low effort threads.\n* No threads in response to topics from other threads, and avoid posting threads on currently over-posted topics - e.g. saw 2 rants about the same subject in the last 24 hours, avoid posting one more.\n* No threads solely to ask questions.\n* No unapproved meta posts. Ask mods first and we'll likely say yes.\n\n**PS**: We can't ban people or remove comments for being inoffensively dumb. Stop reporting opinions or people you disagree with as \"dumb\" or \"misinformation\".\n\n# Why was my thread removed? What counts as a Low Effort Thread?\n\n* If you posted something and it was removed, these are the two most likely options:\\*\\*\n* Your account is too new or inactive to bypass our filters\n* Your post was low effort\n\n**\"Low effort\"** is somewhat subjective, but you know it when you see it. Only a few sentences in the body, simply linking a picture/article/video, the post is just some stupid joke, etc. They aren't all that bad, and that's where it gets blurry. Maybe we felt your post was just a bit too short, or it didn't really \"say\" anything. If that's the case and you wish to argue your position, message us and we might change our minds and approve your post.\n\n# What counts as a Response thread or an over-posted topic? Why do we get megathreads?\n\n1. A **response thread** is pretty self explanatory. Does your thread only exist because someone else made a thread or a comment you want to respond to? Does your thread explicitly link to another thread, or say \"there was this recent rant that said X\"? These are response threads. Now obviously the Mod Team isn't saying that no one can ever talk about any other thread that's been posted here, just use common sense and give it a few days.\n2. Sometimes there are so many threads being posted here about the same subject that the Mod Team reserves the right to **temporarily restrict** said topic or a portion of it. This usually happens after a large series ends, or controversial material comes out (i.e The AOT ban after the penultimate chapter, or the Dragon Ball ban after years of bullshittery on every DB thread). Before any temporary ban happens, there will always be a **Megathread** on the subject explaining why it has been temporarily kiboshed and for roughly how long. Obviously there can be no threads posted outside the Megathread when a restriction is in place, and the Megathread stays open for discussions.\n\n# Reposts\n\n* A \"repost\" is when you make a thread with the same opinion, covering the exact same topic, of another rant that has been posted here by anyone, including yourself.\n* ✅ It's allowed when the original post has less than 100 upvotes or has been archived (it's 6 months or older)\n* ❌ It's not allowed when the original post has more than 100 upvotes and hasn't been archived yet (posted less than 6 months ago)\n\n# Music\n\nUsers have been asking about it so we made it official.\n\nTo avoid us becoming a subreddit to discuss new songs and albums, which there are plenty of, we limit ourselves regarding music:\n\n* ✅ **Allowed:** analyzing the storytelling aspect of the song/album, a character from the music, or the album's fictional themes and events.\n* ❌ **Not allowed:** analyzing the technical and sonical aspects of the song/album and/or the quality of the lyricism, of the singing or of the sound/production/instrumentals.\n\n**TL;DR**: you can post a lot of stuff but try posting good rants please\n\n*-Yours truly, the beautiful mod team*",
        "num_comments": 42,
        "comments": [
            "I was expecting this to be a jjk temporary ban",
            ">PS: We can't ban people or remove comments for being inoffensively dumb. Stop reporting opinions or people you disagree with as \"dumb\" or \"misinformation\".\n\nWhat a great rule OP",
            "There hasn’t been one of these posts in a long time.",
            "So, this is when it comes to posts, not comments right? It just feels wrong to have a discussion on art and to not discuss politics, if art is related or talks about politics in some way.",
            "I kinda want to do a post about how the beatles get back documentary was a breath of fresh air and had me thinking about musiciuan biopics and how they characterise their subjects inauthenticly. would that be allowed under non-fiction rules",
            "I have seen some posts of people giving their opinion about a fandom, or rather the criticism that said fandom has on a specific topic. \n\n It doesn't bother me, but as you mentioned here. Is allowed?",
            "And what about rants about gameplay in videogames?  \n\n\nI seem to remember that there was a specific rule that banned them",
            "There's been a lot of posts here about the length of media. (I've made one myself.) This seems to fall under the \"not allowed\" section due to it kind of being a technical aspect, but I'm not quite sure? I'd like some clarification on this.\n\nEdit: There's a post up right now about the length of One Piece.",
            "These are more than fair rules. I admit I was curious why my recent shipping topic was removed but I understand now that I was only talking about fandom in specific.",
            "Weird question, can I make posts with images if I make diagrams for my rant? I have one rant prepared that had me make whole diagram to explain time travel mechanics in one shoujo manga."
        ]
    },
    "I was forced to rewatch Attack on Titan. The experience reminded me of how old vegetables can ruin a whole pot of soup.": {
        "title": "I was forced to rewatch Attack on Titan. The experience reminded me of how old vegetables can ruin a whole pot of soup.",
        "score": 431,
        "url": "https://www.reddit.com/r/CharacterRant/comments/1dlg672/i_was_forced_to_rewatch_attack_on_titan_the/",
        "content": "Yeah, yeah. \n\nI'm thinking it, you're thinking it. We're all thinking it. \n\nThat's why I've gathered some nice memes for you guys to copy-paste into the comments and be quickly done with it, if you so wish:\n\n*^(\"OP, what a post this is. I promise I won’t let this rant go to waste.\")*\n\n*^(\"No I don't want that! AoT rant on this sub?! I want AoT to be rantless for the rest of my life! even after I die I still want AoT to be rantless for a while ! ten years at least !\")*\n\n*^(\"Only Ymir nose\")*\n\n*^(\"OP, was in love with AOT\")*\n\nNow, for the ones that still **w**ish to bump heads and repeat the same arguments from years ago about a show that has, for the most part, left the public consciousness - welcome! It'll be fun.\n\nI, like many here, have been a fan of AOT ever since the animation premiered back in 2013. I've watched all the available episodes, then waited for the weekly releases while burrowing myself deep within the fanbase - reading t**h**eories, discussing plot elements, engaging with fan creations.\n\nAfter the first season was over, I moved over to the manga. For years, I religiously waited for that monthly release to then, afterwards, spend hours in a variety of online forums discussing where the story was going.\n\nThen the basement reveal came. Then the focus of the story shifted. Then **a** new cast of characters were introduced. Then I moved out, got a job, started college. Then AOT fell into the background.\n\nI returned to the story in 2021. No particular reason for it, I just remembered it existed.\n\nI caught up with the manga just in time to wait for the last 3 chapters.\n\nI**t** was a peculiar feeling. Here was this *thing* - this piece of media that had been such a staple in my life, and it was quickly coming to an end. Not only that, but the (normally) focused discussion regarding the narrative had, at some point, splintered into so many theories, opinions and analysis. \n\nPeople wrote thousand-word thesis on the manga's conclusion using complementary media that was only tangentially connected with the story as reference. Factions of fans coalesced to defend, detract or make fun of an ending that hadn't even happened yet.\n\nIt was a lot to take in. Especially after the **a**ctual ending came.\n\nAnd, man... that ending. What hasn't been said about that ending?\n\nI mean, you guys would know. This sub was flooded with thread after thread of hate, love and everything in between by people desperate to talk about their opinions.\n\nI don't blame them for coming here. Have you tried posting anything on *any* of the dedicated AOT subs?\n\nr/ShingekiNoKyojin is just \"look at this thing I drew\" or \"look at my risqué cosplay, but don't comment on any of the risqué elements\".\n\nr/attackontitan is the anime version of facebook memes.\n\nr/AttackOnRetards is a repository of *\"people who dislike the ending have no life!\"* threads made by people who have no life.\n\nr/titanfolk ...yeah, let's **m**ove on.\n\nHere I can get a (slightly) neutral response, and that's why I'm adding another thread to the worthless \"AOT fell off\" pile. Bear with me, please.\n\n\n\nRecently, my girlfriend decided she wanted to watch AOT. I was resistant at first, but caved after realizing I would be able to watch the 2nd and 3rd seasons animated, since I hadn't gone back to the anime after moving to the manga.\n\nWe watched the last movie **a** couple of days ago, and all I could think about was that one time I botched a nice pot of minestrone.\n\nI got to relieve that amazing first season and all of its hype moments. I got to see the other two seasons adapted by WIT. I got to experience the whole story, now with the full context from all those years.\n\nAnd all I could think about was that one time I botched a nice pot of mi**n**estrone.\n\nI was setting up to start cooking, only to realize I just had a single, depressingly old onion shoved deep down my fridge. It looked dry, smelled sweet and was slightly gooey, but I still used it.\n\nI sat down to eat and quickl**y** realized that the small bit of onion I had added seeped every drop of its *oldness* into the soup. Everything had acquired that sweet, rotten taste *just enough* to debase the eating experience, but not to justify throwing it all away.\n\nMy bowl was there, filled with some nice carrots, peppers, tomatoes, pasta and cheese, but I wouldn't be able to enjoy them, because the rotten aftertaste of the onions would quickly follow. I gobbled it all up, though. \n\nThat's how I felt rewatching Attack on Titan.\n\nI can't enjoy that juicy, savory bell pepper called Erwin Smith, because I know he'll sh**o**w up as a ghost in the last battle to look reassuring about something he would never endorse.\n\nI can't feel that acidic tang of the tomatoes that is Levi, because I know he'll become a plot device, a battered p**u**ppet that somehow survives the last battle against hordes of shifters, and then gets to be carted around in a wheelchair by unbaked characters.\n\nI can't taste some of the broth of worldbuilding with a piece of bread, because the world I was finally getting to know was tossed to the side for a new one that didn't even start to get developed. \n\nI c**a**n't feel anything while watching a scene where a 10-year old kid swears he'll avenge his mother, not only because I know he's the reason his mother is dead, but because he commented on it like he was simply going through a grocery list. \n\n*\"Oh, yeah, almost forgot, I killed my mom. I'm a slave to destiny lol!\"*\n\n\n\nI loved this story for long. And now I can't take that awful **r**otten taste out of my mouth.\n\n\n\nIsayama and I are the same. I am a lousy cook, he is a lousy writer. \n\nI used a rotten, spoiled onion because I thought it wouldn't matter, because I thought I knew better.\n\nHe though he would be able to flesh out a compl**e**x political narrative in 48 chapters. He thought he knew better.\n\nThe only difference is that the people eating my slop didn't compliment me on it. \n\n\n\n\n\n  \n\n\nMan...\n\nAttack on Titan really doesn't hold up on rewatches.",
        "num_comments": 148,
        "comments": [
            "This rant was so good that I was disappointed it ended so quickly. Was hoping you ragged on parts of the story that you disliked\n\nStill a better rant than 80% of the recent ones this month",
            "Sir, I know next to nothing about Attack on Titan as I haven't read or watched anything related to it. But this rant was so well-written, it brings a tear to my eyes.",
            "As much as I love the rest of the manga, the last chapter was literally the first time I stopped reading to ask a friend if he could send me a link to the real chapter because I thought I was reading a fanfiction, after that it was almost only laughs till the last page (except for Gabi German suplexing Falco, that really warmed my heart, I really liked those two little people)\n\n\nI can't bring myself to reread/rewatch the whole story because now I know that all of this happened due to a little girl who had a twisted view of love (It's more than that but I just don't want to go in details), and that between all the amazing characters in the story, it was literally the least interesting one (Mikasa) who was the key to make her realize she could get over it for the common good...(Which by the way shouldn't work, I know it's a manga but you can't get over such a trauma that lasted +2000years just by watching someone else's actions) \nKnowing that all the events in the story take place due to her misconception of love/Stockholm syndrom just destroy everything for me because I know I'll think about it everytime...\n\n\nI always plan to buy all the books as a little sign of thanks to the author, because everything that happens before the table scene (where I started to lose all interest in the plot) is truly magical for me, I've rarely been so caught up in a manga and I think that Isayama is really a great author, but for me the ending is just a failure, there are too many elements that don't work, I would even say that there are more only in the last chapter than in the 138 others...\n\n\nI would have liked to enjoy the ending like the rest of the story, I get the ideas behind it, but the execution is in my opinion so flawed that I can't bring myself to like it. You can have the best intentions and ideas in the world, if the execution doesn't work, it all falls apart for me.",
            "WHAT A MAN YOU ARE!!! 😭😭😭",
            "waman? what's with the bold letters?",
            "what a man you are...",
            "Holy fck this rant is really good, I couldnt tear my eyes, the comparison between the food you made and the manga/anime was honestly spot on as that is what most people(me included) tend to feel about AoT or any franchise that had a great travel but bad end.\n\nPeak rant honestly. You may be a lousy cook, but brotha you CAN COOK.",
            "This is what a proper rant should be",
            "This is one of the best rants I’ve ever seen on this sub and I swear to god validates all my feelings about attack on titan. Theres something so deeply rotten about the later parts of the show, and it seeps into everything else.\n\nI used to be such a big fan, and I can’t even enjoy it anymore. It’s the object of ridicule for me, a poster child for poor writing, for jumping the shark.\n\nThis is a fantastic rant",
            "This was a fantasti**c** rant, I completely agree with everything yo**u** said! The stuff before the ti**m**eskip was so good, and then... I'd rather pretend like the stuff with Marley was just bad fanfic."
        ]
    },
    "One Piece's excessive world-building has caused it to lose plot focus and character development ": {
        "title": "One Piece's excessive world-building has caused it to lose plot focus and character development ",
        "score": 112,
        "url": "https://www.reddit.com/r/CharacterRant/comments/1dlk8lg/one_pieces_excessive_worldbuilding_has_caused_it/",
        "content": "\n\nThere was a time when I believed One Piece had the best world-building in manga. The menagerie of characters and locations kept me entertained throughout. \n\nHowever, as I got older, I began to see the downsides of excessive world-building. The constant introduction of new characters and plot developments has made me realize the dangers of Oda-sensei approach. Instead of deepening character development and focusing on the core plot, Oda-sensei has spent so much time expanding the world that it has somewhat diminished my overall experience.\n\nAs much as I hate to compare, Togashi's Hunter X Hunter world building seems as not as impressive. But in HxH the plot development and characters are the main focus. So, even though it's always in hiatus, it keeps someone engagaged\n\nIn the end, I wish Oda-sensei would strike a better balance between world-building and plot focus. Prioritizing the development and progression of the Straw Hat crew would enhance the narrative and ensuring that the narrative doesn't suffer in lieu of expanding the One Piece.",
        "num_comments": 64,
        "comments": [
            "For real, we really don’t need a side plot for all 6 of Vegapunk’s bodies when you could be developing Franky’s relationship with Vegapunk instead. \n\nIt’s crazy how the man has literally built his entire body on Vegapunk’s tech and barely has even spoken a word to him. Heck this is an island full of futuristic tech and Franky doesn’t even react to them much. \n\nThe lack of development for the Strawhats in favor of side characters has been a big problem since post timeskip. ",
            "This is why arcs like Ennies Lobby, Arlong Park and Alabasta that focus on strawhat dynamics and character development are so much better than arcs like Punk Hazard, Fishman Island and Wano. \n\nIn so much of post time skip the Strawhats are so flanderized and their character dynamics are completely thrown to the side in favor of a million different side characters that just take up space.\n\nI miss when Zoro didn't just exist to cut things and be edgy, or when Ussop wasn't completely useless for the sake of a bad gag or when the Strawhats actually bonded with each other.",
            "I gotta agree with this, it's been so long since i gave a shit about any of the main cast (the last moment i can remember was when Nami defended Luffy on Wanon, and Sanji in WCI before that); i find myself reading OP mostly for worldbuilding reasons\n\nIdk if that it's necessary a bad thing thought, in Wano it was kinda bad cause Oda added so many fucking characters and made the emotional beats revolve around them instead of the MC; but in Egghead the MC got sidelined cause of Worldbuilding reasons (Vegapunk's speech with it's implications was amazing and satisfying), and the emotional beats were more focused and short with Kuma and Vegapunk (this arc has great pacing in my opinion, compared to Wano at least)",
            "One piece excessive world buildings destroys its pacing.",
            "While world building is important it's also just as good to keep it constrained and not go overboard and with One Piece Oda constantly adding in new stuff that he tries to give full development not only has caused the series to feel very bloated in terms of characters, world and lore but also sidelined the titular concept of One Piece treasure by spending too much time side activities as opposed to finding the treasure.\n\nTo be fair it is still better than how Naruto did world building, one that suffered from extreme underdevelopment and how spending hardly any time developing anything that could have been interesting, but it still has issues due to too much excess.",
            "Exactly. One thing that few people call out is that Luffy's final rogue gallery has gotten so huge (Akainu, Blackbeard and Imu) that is most likely that we will never see a satisfactory battle between Luffy and those three. \n\n\n Luffy has a  beef with these three. Akainu killed his brother, Blackbeard contributed to his brother dead and is another contestant for the One Piece and Luffy has been set up as Imu's archinemesis. \n\n\nAnd I agree with you OP. One Piece has gotten so huge but it forgotten the strawhats. Majority of them havent had character arcs. Few of them are actively pursuing their dreams. Even in Egghead, the Giants got more battles with all those Viceadmirals and the Gorosei.\n\n\nPeople said that Wano was supposed to be Zoro's arc and it wasnt. Franky didnt have the spot expected in Egghead. Hell I'd say that Egghead must have been Chopper and Robin arc too since Chopper could have learnt stuff to be a better doctor and Robin should have asked more stuff or sources of info about Void Century. But nah. Literally Oda sent Robin to sleep LMAO. Look that Lilith and Atlas are aboard. They may steal usefulness to Chopper, Robin and even Franky.\n\n\nFor that reason is that I love the theory of Luffy being locked by WG and strawhats have the spotlight for the rest of the arcs. It may not make sense. But theres a chance: Marygoise food supplies were destroyed during Kuma vs Akainu. So Gorosei could keep Luffy locked in Marygoise until they have the fruit that matches the Sun God fruit in order to make the fruit respawning under their power. So the  Final War would revolve around avoiding sending food to Marygoise.",
            "It's called worldbuilding disease. Oda thinks he needs to explain it all.",
            "An opionion I've had for a long time now. The Strawhats at this point in the stories feel like parodies of themselves.  If somebody asked the first describing word of each, that's how they feel. \n\nLuffy is an idiot who rushes into battles. That's first thing that comes to mind about his character and that's what he's been like for a long time. \n\nZoro is stoic badass.  No longer as much of the right hand he felt like back in post Enies Lobby\n\nSanji is a simp\n\nUsopp cries about every battle and runs away. \n\nThe depth of the Strawhats character development took a massive hit and it's a big turn off",
            "I would only say this is a problem in arcs Relating to a specific straw hat Because now all the straw hats need developing at all times Especially if they're not on screen. What I mean by specific I mean it has a theme that is related to a straw hat Not that it is about That specific crew member",
            "That's a big problem OP started to have post timeskip tbh.. "
        ]
    },
    "Why Evil Timeline Doppelgängers Fail: They’re Just Villains, Not True Dark Reflections": {
        "title": "Why Evil Timeline Doppelgängers Fail: They’re Just Villains, Not True Dark Reflections",
        "score": 147,
        "url": "https://www.reddit.com/r/CharacterRant/comments/1dlgw10/why_evil_timeline_doppelgängers_fail_theyre_just/",
        "content": "The evil timeline doppleganger  concept has surprisingly not been done   all that well over the past  couple years or so. Which is surprising isn’t it? One would think that having an actual evil version of the main character would invite a lot of potential to have nuanced storytelling.  But Instead what usually ends up happening is that these alternate timeline villains are so far removed from the protagonist that they end up feeling like any old generic villain. \n\nA big example of this being injustice Superman. \nNow Although I know  it was confirmed that injustice is not a alternate timeline but rather just an alternate dimension, however for the sake of my argument I will included it anyway. Main reason being because bar for bar the injustice dimension is eerily similar to the main dc continuity. So what is the problem with injustice Superman? Well to answer that question we gotta also ask who is Superman? And that’s not hard to answer at all. Superman  is a man  who grew up in Kansas as Clark Kent under the loving watch of his parents Jonathan and Martha Kent. His parents instilled a great sense of morality in him allowing him to come to appreciate humanity as a whole. He grows up to become Superman a man who cares so much about his friends and other people’s wellbeing’s that he is even willing to extend his hand to villains who seem to be struggling with their own problems. Superman at the end of the day is a character whose love and understanding nature often makes him overprotective of the people around him. Not even other superheroes like Batman who often will try to sway Clark from helping him can escape his grasp because he will help him anyway by  putting his body on the line every time because that’s just who Clark is🤷🏽.  \n\nBut if you don’t trust my words just watch this clip from justice league unlimited https://youtu.be/0kffqSXcTOc?feature=shared. Superman of course in this situation doesn’t want to fight atom but atom is not a guy who will go against military orders as he is a us military soldier first before he is a superhero/ jl member. thus it gets to the point where Superman has a knocked down dragged out fight with atom and he eventually beats him. What’s stands out in this scene however is the moment after he knocks atom out because instead of allowing the medics to work on atom in his injured state, he picks him up, carries him and says “ he is one of us” and just walks off. This scene to me encapsulates everything on who Superman is. \n\nWith the way I described Superman does this sound like a guy who would murder a child for a simple disagreement? Does this sound like a guy who would murder his friends because they wish to oppose his regime? Does this SOUND  LIKE A guy who would use criminals to fight against his own friends? DOES THiS SOUND LIKE A GUY who would murder his own friends because they killed his parent accidentally? No of course not. my problem with injustice superman was always the fact that it felt like you could replace him with any evil generic dictator because he barely cares about the people around him and will kill his friends  just because of some moderate  resistance. Injustice Superman is just so  indifferent, and uncaring about the people that are even helping him,  that it’s uncomfortable for me  to even call this man a different version of Superman.\n\n So how would I go about fixing it? Ideally if Superman was to go into the deep end his most important traits should taken to its logical extremes. Instead of injustice Superman wanting to MURDER his friends he should be imprisoning them,  trying to convince them that what he is doing is right. Injustice Superman should be very protective of his friends that are working on his side, to the point that it becomes overbearing even because the death of Lois would hurt him that much. Superman best traits like his loving, understanding and overprotective nature should become so extreme that they become his worst traits. Honestly I could even see it getting so bad to the point where Superman would want to shoulder all the problems in the world and would deem other superheroes other than himself unnecessary.\n\nInjustice Superman at least in my opinion should not have an army he is the army. \n\nNow I gave  you an example of writers doing a time doppelgänger wrong and how to fix it but I want to touch  on  a story that did it correctly.\n\nSo re zero for those who don’t know is a isekai anime where an ordinary guy named natsuki Subaru gets transported to a very fictionalized medieval world. Sounds pretty generic right? The difference in this story is that unlike other protagonist in isekai stories who are summoned with very op abilities, the only ability that natsuki Subaru possesses is the fact he can rewind time upon death. This makes for very nuanced story telling in my opinion because it often touches on the hopelessness and self hatred he feels when people die around him and he can’t do anything to stop it.\n\nNow in the main story natsuki Subaru learns to channel his worst traits in more productive manors and learns to become better overall… but  in the if story’s that the author likes to write on Subaru birthday it’s a little different. \n\nSee because the female character named Emilia in this series was the first person to “save him” he falls in hopelessly in  love with her to the point where it becomes even a very  toxic in later episodes.  In alot of ways you can say the series first actual villain  named petelgeuse who is crazily obsessed with the “dead” witch who looks like Emilia is meant to mirror Subaru and where he could potentially end up like. For more of a reference on the parallels between natsuki and  petelgeuse I suggest watching this video https://youtu.be/LIzogLLIDbE?si=vGEmXWLOkFMIlb4-\n\nPoint is in the pride if alternative universe story instead of asking for a knight to help him  he chooses to fight an a assassin named Elsa over and over again with Emilia until he just becomes insane. his overbearing love  for Emilia just becomes obsessive to the point that he cares about nothing except helping  Emilia achieve her goal of winning the royal election. After escaping the first loop the normally quirky  and overdramatic natsuki Subaru  has now become  erratic and unstable. Throughout the  what if story natsuki goes on to kill other royal candidates and even other villains so he can become the ultimate villain that emilia strikes down so that everyone will choose her to become  queen. Funny thing about this plan  however see remember that knight I mentioned earlier? Yeah the guy natsuki didn’t want to ask for help in this story? \n\nWell his name his Reinhard the strongest existence in the re zero world. Reinhard is every bit as op as Subaru wished he was and he despises it. Natsuki tries hundred no thousands of ways trying to kill Reinhard  but in the end all he could settle for was just engulfing the kingdom in flames using a spirit to destroy his name as a hero because he can’t kill him. And even after his “victory”  in this story Subaru cries… when Subaru was summoned in this world he believed he would have op powers to save  People just like other isekai protagonist. However upon realizing that all he was good for was seeing the people he loved die in front of him and trying again just to see the same scenes made him despise an existence like Reinhard who he is everything he wished he was. Natsuki wished he had Reinhards  op powers so he wouldn’t have to resort to such dirty tactics. He could stand by Emilia’s side protecting and defeating  any and every threat that came her way with ease if that was the case.\n\nNatsuki Subaru hates himself to his core, and no matter what timeline or what if story he is in that won’t change. \n\nThe story ends with Emilia killing him as he planed becoming satisfied with his death. \n\nTo cut it short  because this has already been a long rant, What I love about this story is just how much you can see  the original timeline natsuki in pride if natuski. His love  For Emilia becomes obsessive, his hatred for his lack of power causes him to hate people like Reinhard and above all else the funny part is even becoming his worst self pride  Subaru will only do evil if he deems it necessary in achieving his goal for Emilia. He isn’t a guy who likes to torture people just for kicks, heck even when killing the most vile people who walked on re zero planet like an guy named regulus. Subaru still wishes to give out an  death that are quick and efficient. He dislikes his partners in crime especially Elsa who is a sadist who loves to torture people as they die. He even shows some sadness for the death of character like meli who is a child assassin working with him but his obsession with Emilia wouldn’t allow him to do anything differently. In the end I can totally see the core principles of natsuki in pride if natsuki. ",
        "num_comments": 52,
        "comments": [
            "I agree. I always hated how the “evil” version of good characters stray so far from the characteristics that are traditional to them the idea isn’t even fun.\n\nAs you said, it would be way more interesting for “evil” Superman not to be a genocidal freak but still have his relative kindness, be focused on controlling everything but under the guise of protection- i think the main issue is that it’s simply easier to write the evil “good guy” as being hitler as opposed to actually thinking long term about how an established character would genuinely act if they lost it",
            "Honestly, I think the Justice Lords episode of the Justice League cartoon does a better job with the idea of Evil Superman than Injustice does.",
            ">Natsuki Subaru hates himself deeply, and no matter what timeline or story he's in, that won't change.\n\n\n*Mimagal and lust if enter in the chat ",
            "\"Red Son\" comes to mind as a version of Superman that is \"evil\" without being a villain and still retains his recognizable characteristics. The focus is on control and how he must look after the well-being of humans. It's a comic that I enjoyed a lot, and its ending is quite satisfying. To me, it represents the concept very well.",
            "Completely agree.\n\nWhile not exactly what you're talking about, one of my main issues with the Supes from The Boys is that most of them don't have anything in common with the originals other than their powersets.\n\nTo give an example of a good deconstruction, I think Soldier Boy is a neat deconstruction of Captain America, mainly because his status of being a living relic from a previous time is shown as causing some genuine problems, namely, he comes off as deeply bigoted by todays standards, because the unfortunate fact is that’s kind of how most American men were back in the 40s.\n\nWhat I especially like is that he isn't just blindly bigoted, he's explicitly shown to lack the Anti-Arab and Muslim prejudice that many modern conservative men possess, and is even shown to be genuinely fond of Afghanistan, because he was around before the War on Terror started and during the Cold War, where Afghanistan was one of the U.S's allies against the Soviet Union.\n\nIt's a great reminder that people's values are shaped largely by the environment they grow up in, for better or for worse.",
            "Gods and Monsters had a good example of a Superman that was darker, but still had the core part of Superman, even if not necessarily evil.",
            "[I made my own version of this, albeit focusing on the concept of Evil Superman.](https://www.reddit.com/r/CharacterRant/s/zzVd5NET0C) It’s surprising how rare it is to see evil counterparts that actually reflect the character themselves instead of just being a meatsuit for a generic villain.",
            "Whenever I see an evil time doppelganger I think of Evil Troy and Evil Abed from Community and simply cannot take them seriously",
            "I was honestly about to mention the Pride IF when I saw this post. Subaru's such a complex and interesting character, and I love how every IF story the author makes takes his preexisting character flaws and exacerbates them under the right circumstances.\n\n* Pride IF: Exacerbates Subaru's obsessive determination and how he forces his feelings onto Emilia in a delusion of grandeur, how his desire to do something for Emilia was only really self-serving in the end\n* Wrath IF: Exacerbates Subaru's self-hatred, rashness, and inability to understand others into full-blown fear of people as Subaru loses the ability to trust anyone, even himself\n* Sloth IF: Exacerbates Subaru's desire to give up on himself and run from his problems. Or at least it would, if he didn't have Rem with him. I love this IF story, because you can see every time Subaru would succumb to his slothful mentality if Rem wasn't with him.\n* Greed IF: Exacerbates Subaru's self-sacrificial nature, suicidal ideation, desperate fear of losing his loved ones and belief that he has no value outside of his death. It results in a Subaru who abused Return By Death to ensure his loved ones never face any danger, and kills himself countless times for any reason because his life has no value",
            "oooh danny phantom did this!!! :) and they actually had a really good reason why danny's evil time traveler self was kind of just \"generic evil\"! it was cause he lost his whole family and friends in an explosion, then went to stay with his evil uncle and asked him to remove his ghost powers, but ended up splitting his human and ghost halfs, and his ghost half then merged with his UNCLE's evil ghost half, creating a messed up super fused evil ghost!\n\ndanny's ghost half also murdered his human half immediately lol...which makes danny phantom more fucked up than urizen from DMC5 lol... (why didn't urizen kill V btw?!)"
        ]
    }
}