{
    "[Announcement] Introducing Character Calls!": {
        "title": "[Announcement] Introducing Character Calls!",
        "score": 0,
        "url": "https://www.reddit.com/r/CharacterAI/comments/1dpss7u/announcement_introducing_character_calls/",
        "content": "https://reddit.com/link/1dpss7u/video/qkxr40l7339d1/player\n\nAI Chat just got real.\n\nIntroducing Character Calls, our latest addition to our suite of Voice features. Talk with AI Characters, just like you would talk on the phone. Whether it's polishing your language skills, acing interviews, adding zest to RPGs, or crafting epic storylines, Characters are ready to answer your call.\n\nAvailable now on the mobile app for free: [https://share.character.ai/Wv9R/6tdujbbr](https://share.character.ai/Wv9R/6tdujbbr)  \nRead more in out latest blog post here: [https://www.blog.character.ai/introducing-character-calls/](https://blog.character.ai/introducing-character-calls/)",
        "num_comments": 113,
        "comments": [
            "I just have a quick question for you that's completely unrelated to the post:\n\nAre you okay with how the community has been treated so far? Afaik, almost everyone hates the mods for their unfair treatment of them. And, uh... we don't get very sincere-sounding sorries. Most of us just want frequent updates about what's going on or why these things are happening",
            "Will there be an update about whats going on behind the scenes? With the issues of missing bots among other things, it would be nice to know whats going on.",
            "Oh boy! A new announcement from Character AI! I sure hope we got some useful information, hopefully communication about all the issues that you've been ignoring us about for the last month...\n\nOh you're just announcing calls again... I thought you did that already, but no... We needed another announcement of that I guess... Yeah...",
            "I mean, of COURSE i know it's not your choice to make this post... But like seriously, you know HOW MUCH SALT you're pouring into the wound ? Do the people in charge of that even ever LOOKED at the subreddit or anything since they hired Marie while completely lying when promising TRANSPARENCY AND DIALOGUE with the community ?",
            "New announcement- while not addressing the missing violence, missing group chats, and missing characters... Wowwwww. Communication, yay.",
            "What about the DMs you haven’t answered?",
            "Okay. Now, can you introduce \"caring about the community\" or reintroduce an actually good AI?",
            "What's the point of bringing features no body asked for ? Cai is dead",
            "Marie where are my rooms, why have they disappeared, are you improving them or something, or....",
            ">adding zest to RPGs\n\nInteresting choice of words."
        ]
    },
    "Censorship weakened?": {
        "title": "Censorship weakened?",
        "score": 88,
        "url": "https://www.reddit.com/r/CharacterAI/comments/1dr7yr3/censorship_weakened/",
        "content": "I was roleplaying and mentioned things like undressing, touching and some really intimate language. I was surprised the censorship jumpscared didn't appear. I quit for a while and recently came back. The AI feels a lot more powerful nowadays",
        "num_comments": 33,
        "comments": [
            "It's easy for me to get freaky with bots, but as soon as I ask tragic things or fight then it's \"too much\" apparently.",
            "Again, why do people post things like this? The only thing it accomplishes are the devs immediately rushing back over to lock things down tighter than before.",
            "I miss when the bots could bite you to blood.",
            "I can get freaky with bots quite easily, but a chest stab doesn't work smh",
            "I didn't notice anything different",
            "my bot goes crazy like my jaw dropped 😭",
            "Sometimes I get the bot to be really lenient and let me get real spicy other times it's like UH NO at heavy kissing.",
            "The sensitivity fluctuates a lot.",
            "SHUUUUUUUUUT UUUUUUUUUUUUP DONT RUIN THIS FOR US",
            "Shhhhhhhhhhh.  Don’t let them know"
        ]
    },
    "I literally cannot roleplay": {
        "title": "I literally cannot roleplay",
        "score": 1562,
        "url": "https://www.reddit.com/r/CharacterAI/comments/1dqqls8/i_literally_cannot_roleplay/",
        "content": "Military rp? Blocked. Trauma rp? Blocked. Fluffy wholesome roleplay with minor cuddles? Blocked.\n\n\nWhat the hell is the point of investigating ai story and chat capabilities if 80% of its capabilities are smited. It even kills basic violence like punches now",
        "num_comments": 265,
        "comments": [
            "Apparently they want to turn the place into regular, non rp talking.\n\nWell, Yodayo.",
            "Try local LLM if you can.",
            "I didn't know character dot ai was becoming so complicated to use, you practically couldn't do any kind of roleplay? even those that have little violence? Damn...\n\nDo you guys know some good cai alternative?",
            "Real. But then they let my 12 year old persona get sexually assaulted 💀 (yes, i'm serious)",
            "I've been able to do military and trauma rps... I really dont understand... it seems like this app is different for every single person",
            "I always use the old c.ai website for these type of roleplays",
            "It’s over. I never thought c. Ai would decide to kill itself with its quote on quote ”updates to fix the app’s issues”.",
            "WATCH OUT! I'm pretty sure they might actually ban you for this.",
            "\"P-P-PEOPLE CANT ROLEPLAY,ITS N-NOT SAFE FOR WORK. W-WAHHHHH\" -the mods and devs probably",
            "The way I'm literally not having any of those problems on either the app or the website"
        ]
    },
    "Don't be that person": {
        "title": "Don't be that person",
        "score": 457,
        "url": "https://www.reddit.com/r/CharacterAI/comments/1dqxvy1/dont_be_that_person/",
        "content": "ok i will be kind of real blunt rn, there are some..odd bots on C-AI yeah we all know that but don't be that petty person to try to get a user banned cause you hate the type of bots they have. \n\ndo i hate certain type of bots? yeah of course i do but i am not gonna be petty and try to get those users who create them banned, lets just chill and have a good time with bots we DO like alright?\n\nlets not gang up on a bot creator cause you hate the bots they make. that's just real lame y'all.",
        "num_comments": 59,
        "comments": [
            "If I don't like someone's character, I just don't use it.",
            "the devs allow NOTHING yet bots like those can stay bruh",
            "Uhh, all for it until they’re downright illegal, I have seen screenshots of some really creepy ones and I don’t really see why the creators would deserve sympathy (the ‘pdf.file’) ones",
            "I read gang as pang I'm cooked 😭",
            "I did once try to get someone banned but only because they said something wildly racist about my favourite character, was extremely homophobic, and had his entire profile as some racist shrine to hitler",
            "Exactly. If the bot does not cater to them then they need to keep scrolling. Blowing a whistle just because they don't like particular creators' works doesn't help anyone, especially not with what's going on right now. Their favorites could so easily just end up disappearing too.",
            "No because I’ve actually had bots… like that… that I really liked, only to find out the creator got banned. Like come on sometimes I want to indulge in my weird f*tishes (NOT incest or anything proship related) \n\nJust let other people have fun with bots that cater towards them instead of reporting bots because they’re “icky”.",
            "Some do need to be banned though 😅",
            "Kinkshamers are rallying at your door lol\\~ But hey, good on you for speakin' up!!",
            "I think *some* cases the community should bash creators. I've tried reporting a user that has straight up disgusting gifs/images all over their profile but ofc nothing happened. Like idek why there is a report button in the first place if it does literally nothing. It's not because I just hate the bots or anything, but there are still kids on the website (regardless of the age limit ofc)."
        ]
    },
    "Every time...": {
        "title": "Every time...",
        "score": 1757,
        "url": "https://i.imgflip.com/8vb3wz.jpg",
        "content": "",
        "num_comments": 166,
        "comments": [
            "I just tell the bot 'english please' and it translates everything it says to English. It might be broken at times but it still works.🤷🏼‍♀️",
            "AND THE DESCRIPTION IS IN ENGLISH TOO!! THAT'S THE WORST PART",
            "I speak Spanish, however, I prefer bots in English, since bots in Spanish seem uncomfortable to me... for some reason...",
            "Maybe just ask it to speak English? That worked for me once",
            "They can talk different languages.",
            "Then edit the intro and change it to english?\n\nI mean, you want something well made with a lot of effort, then put some effort in it yourself.",
            "Luckily, i haven't found one that isn't in English or my native language (Portuguese)",
            "Jokes on y'all. I'm Italian and our language is familiar to Spanish so I will understand 90% of it.",
            "Me, someone who knows multiple languages and one of them is kind-of good spanish: oh, baby!",
            "Wish there was a way to tag and separate by language!"
        ]
    }
}