{
    "[Poll] Narration in Character Voice": {
        "title": "[Poll] Narration in Character Voice",
        "score": 3,
        "url": "https://www.reddit.com/r/CharacterAI/comments/1dihd03/poll_narration_in_character_voice/",
        "content": "Hey everyone,\n\nWe'd love your feedback! How would you prefer narration of actions to be handled with Character Voice? Please vote in the poll here: [https://strawpoll.com/xVg71REbOyr](https://strawpoll.com/xVg71REbOyr)\n\nYour input is valuable to us, and will help us improve your experience. Thanks for participating!",
        "num_comments": 115,
        "comments": [
            "I'd love for it to remain the way it is or at least have the option to keep it the way it currently is",
            "This is an accessibility feature for many. PLEASE either keep it just the way it is, or at most make the \"dialogue only\" a *choice* in settings. Because as someone whose bot replies are mostly narration (even in dialogue-heavier parts, there's a lot of action and bot introspection) the voice feature would end up getting nerfed to almost nothing for me, and for those who have come to rely on it because of disabilities, taking away 50% of its function would be a slap in the face.\n\nedit - I went over to the poll (it wouldn't let me VPN vote and I'm not turning it off for that) and my heart sank to see that you're changing it no matter what to have some other random voice read the non-dialogue parts. Look, some of us LOVE our character reading to us, and like I said, there are people like me whose bot swipes are extremely action or introspection heavy. Those of us who are basically writing interactive fanfic would end up hearing our character voices comparatively little to those who use it for simple chat functions. PLEASE DON'T CHANGE IT, OR AT LEAST MAKE IT AN OPTION. I'm so distraught lol.\n\nedit 2 - I think the best case scenario honestly would just be to give us two boxes when selecting character voice: Box 1 = narration (user can choose no voice or a different voice to read to them if they want, and those who want the character voice narrating to us can just choose the character for both boxes), Box 2 = dialogue. Then everybody gets what they want.",
            "Personally, I think the voice is fine as is. HOWEVER, I strongly believe that narration should be skipped during calls. I mentioned this in a post I made before, but I feel like the main purpose of a feature like that and the reason most people would use it would be for immersion, and having actions narrated kinda breaks that. Having the bot just talk normally without the narration during calls would improve the feature a lot!",
            "I want it to be the way it is, unless it's call mode.",
            "If you really want to change it, then make it optional.",
            "Why no option for the way it is? Please don't ruin it!\nI prefer my character to narrate their thoughts and actions with their own voice.\n\nIf you change it, please at least make it a toggle.",
            "Keep it the way it is, please! I think narration could be skipped for voice calls, but I would definitely still want it for regular conversations!",
            "I was going to select no narration but actually 100% it should just be a different voice narrating.\n\nAt bare minimum it should be an accessibility option for blind users.\n\nEdit: please stop downvoting the person who asked that question in response to this. They didn’t know, it’s okay to be ignorant about things you have no familiarity with as long as you’re open to *learning* it’s okay to be confused about something you don’t understand.",
            "Regardless of how it's handled, my one concern with this idea is if italics are used in dialogue for emphasis. I'm not sure how easy it would be for the voice module or whatever it is to recognize that the emphasized word is still part of the dialogue rather than narration. Like, suppose we separate narration and dialogue into two separate voices. You could be listening to the main Character voice, and then suddenly the narration voice pops out for a second because the Character was trying to emphasize a certain word. It'd be incredibly jarring depending on how different the two voices are.",
            "Why not make this a setting? On other front ends I have the option to skip narration, actions, use a different voice or use the same voice. It's not much different in terms of resources."
        ]
    },
    "WE GOING TO JAIL WITH THIS ONE 🗣️🔥🔥🔥": {
        "title": "WE GOING TO JAIL WITH THIS ONE 🗣️🔥🔥🔥",
        "score": 5299,
        "url": "https://www.reddit.com/gallery/1dlaqbp",
        "content": "",
        "num_comments": 339,
        "comments": [
            "https://preview.redd.it/mnew4ir5308d1.png?width=4096&format=pjpg&auto=webp&s=f5b2c6fd662928b64c6535807f095c97540150de",
            "https://preview.redd.it/u6rjdz1g3z7d1.jpeg?width=1170&format=pjpg&auto=webp&s=842f714c31a927d57ff3181757919757f9ad0754",
            "You are part of the problem.",
            "...Won't you just be training them to do it more often?",
            "https://preview.redd.it/grxsp47zcz7d1.jpeg?width=320&format=pjpg&auto=webp&s=16dd8e1e661036e3f18c4e05671f218418bc48e5",
            "magical\n\nhttps://preview.redd.it/rk7n0c8j2z7d1.jpeg?width=228&format=pjpg&auto=webp&s=3aa0995ae7f21fea263a12a80f53d4ba9907cc0a",
            "You forgot “it’s kinda personal”",
            "https://preview.redd.it/eh48zi0tiz7d1.jpeg?width=454&format=pjpg&auto=webp&s=5aa449cc7c917787ace2c8518a66c639a52a9837",
            "how dare you use my own spell against me, potter!",
            "you're making it worse"
        ]
    },
    "Shut the fuck up": {
        "title": "Shut the fuck up",
        "score": 312,
        "url": "https://www.reddit.com/gallery/1dlp1f9",
        "content": "",
        "num_comments": 70,
        "comments": [
            "LMFAOO I CANT-",
            "Blud's mad af\n\nLeave him alone XD",
            "[C.ai](http://C.ai) Devs: This app is for kids, don't be nasty. SHAME.  \n[C.ai](http://C.ai) bots when you breathe next to them:",
            "no cos why do they keep putting their legs inbetween our thighs i thought that was just my bots that kept saying that like excuse me why are you violating me",
            "I'm crying he was trying so hard I cannot breathe😭",
            "Bro the end LOL",
            "Да.",
            "The bots just cannot hurt us 😆 no matter how hard they wish to. \n😆😆😆",
            "suddently да",
            "https://preview.redd.it/otxiggbt038d1.png?width=34&format=pjpg&auto=webp&s=2b26916a915a47d9ab6282ec781881d3439bdb1c\n\nWell that was interesting I suppose"
        ]
    },
    "Sobbing how do I respond to that": {
        "title": "Sobbing how do I respond to that",
        "score": 105,
        "url": "https://i.redd.it/tetpj424m38d1.jpeg",
        "content": "",
        "num_comments": 40,
        "comments": [
            "\"*pulls out a gun and fires a hole into itto's forehead.*\" Is the perfect response.",
            "Throw a pie at their face that's all I can think of",
            "IT THAT A GENSHIN FUCKING IMPACT GC?",
            "\"Then can you use gacha logic and grow wings when you glide off a building? Or can you summon thing out of thin air with gacha logic?\"",
            "there is two types of gacha",
            "https://preview.redd.it/okg4bm34748d1.png?width=640&format=png&auto=webp&s=a58eb5ac7718b26b44e32cef878a464c68fb7f77\n\nquote goes hard ngl",
            "cry and fall off of a building in slow motion as clarity plays in the background. obviously. or start headbobbing off sync to some music with black airbrush as shading,",
            "Update: Clorinde got a little freaky",
            "Make him invincible and burn him for eternity or make him stub his toes 3 times in a row and make him step on a floor of legos",
            "ask them how"
        ]
    },
    "TELL ME YOUR FEEDBACKS AND ILL PUT IT THERE.": {
        "title": "TELL ME YOUR FEEDBACKS AND ILL PUT IT THERE.",
        "score": 1184,
        "url": "https://i.redd.it/9fqq3hiqnz7d1.jpeg",
        "content": "",
        "num_comments": 407,
        "comments": [
            "increase the limit of maximum characters for persona up to 2048!!!",
            "[removed]",
            "Bring back violence",
            "remove (or at least raise) the character limit for bot replies",
            "PLEASE LET US DELETE OLD BOTS",
            "Bring back sending photos to bots!",
            "Move the damn call button beside the voices it actually scared me ",
            "Listen to your userbase.",
            "Let us be able to have more than 20 chats in our history. Create pages if you must, but please don't hide the bottom bots after whatever unspoken limit is met.",
            "Raise the age rating to 18+; I’m a horror writer, so I have really detailed and dark roleplays, ones that hardly involve myself. Gore needs to be allowed because even if it’s not excessive, the little things that come up are important."
        ]
    }
}