{
    "Daily Discussion Thread": {
        "title": "Daily Discussion Thread",
        "score": 10,
        "url": "https://www.reddit.com/r/chelseafc/comments/1dr3hya/daily_discussion_thread/",
        "content": "# Daily Discussion Thread\n\nPlease use this thread to discuss anything and everything! This covers ticket and general matchday questions (pubs, transport, etc), club tactics/formations, player social media, football around the globe, rivals and other competitions, and everything else that comes to mind.\n\nIf you are interested in continuing the discussion on Discord, please join the official server [here](https://discordapp.com/invite/chelseafc)!\n\nNote that we also have a Ticketing FAQ/Guide [here](https://www.reddit.com/r/chelseafc/wiki/tickets).",
        "num_comments": 273,
        "comments": [
            "Palmer played 19 mins and he's got Saka giving press releases.",
            "Newcastle were ready to sell Gordon to Liverpool but the deal is off. If Gordon is available, Isak is as well. Who knew PSR deadline day is going to be more fun than the actual one",
            "Nizaar reckons the Arsenal sell-on clause for Omari Hutchinson is 15%. So they get £3 mil and we get £17 mil. Seems fair to me.\n\nOur new sell-on clause is 25%.",
            "I woke up and I see two different news on KDH and Chelsea. One of the reasons I hate the transfer windows(I know it's technically not even open) with this new management. Nearly every single transfer rumor seems to get leaked.",
            "Newcastle have until Sunday to sort out their PSR issues, the great thing about the Isak news is we’ll get an answer soon.",
            "One omari in and one omari out, which fofana will be THE fofana for us",
            "As much as Clearlake deserve scrutiny, I’m so glad we didn’t end up with Brexit Jim as owner\n\nAll his C-suite decisions point to someone who’s wholly out of touch",
            "At the point where I'm excited for the next season, but also so damn tired of no damn stability ever\n\nI hope in the next 2-3 years we hit jackpot on more players like Palmer and build something worthy of being Chelsea",
            "Ugarte leaving PSG after one season. Thank you for giving us Caicedo. \n\nAlso De Ligt is available but astronomic wages.",
            "Olise to Bayern might be off apparently 🤣🤣"
        ]
    },
    "what could have been 💔": {
        "title": "what could have been 💔",
        "score": 722,
        "url": "https://v.redd.it/r8nbufpk3h9d1",
        "content": "",
        "num_comments": 94,
        "comments": [
            "Marcos Alonso and Bangers vs Spurs, name a better duo.",
            "If Alonso took a free kick, it was on target.  The football heritage in this man's blood was real.",
            "Easy to forget how good he was down that left side",
            "So the pov is watching alonso highlights?",
            "It’s Amazing the hate he got, but now he’s left he’s getting nothing but love. I always rated him",
            "Just proves the point that people are easy to start hating players who are here for years. Especially when they were really successful. Alonso got a looooot of hate in his last 2 years here. Same goes with Ivanović, seeing current players and looking back to old ones,now they look even better than I thought. Disrespect was crazy. \n\nAlso it’s weird people are fast to bash legends when they are out form, but they give a lot of pass to a big fee signings. Should be other way around.",
            "Wdym what could've been? He won the CL, PL and Europa League. What more could there have been lol",
            "On my FM save I was fucked for striking options and he was available for like 250k so I popped a cheeky bid in with the intention of brining him back to the Bridge and playing him up front. Bastard signed for some Qatari club instead lol",
            "How perfect he’d have been for that chilwell LW experiment Poch ran early last season :/",
            "He wasn't \"born to be a striker\".\n\nThere's a difference between box crashing as a fullback and playing up front where the CBs are taking care of you."
        ]
    },
    "Cole Palmer on working under Maresca.": {
        "title": "Cole Palmer on working under Maresca.",
        "score": 216,
        "url": "https://i.redd.it/ri1vos5kii9d1.png",
        "content": "I think this decides where Palmer will be playing...",
        "num_comments": 36,
        "comments": [
            "It will help Maresca starting out that he has Cole and Lavia to vouch for him to the squad",
            "I can get behind someone who also sees that Palmer is better on the wing than at AM",
            "He will grow more and more under his supervision.",
            "Does this mean Palmer on the wing rather than at the 10, because he is so so much more dangerous on the wing, it feels like such a waste when he's playing the 10",
            "Palmer on the wings all day long, unless he has caicedo and gallagher behind, he lacks that defensive contribution to balance a team.",
            "Even when Cole played centrally, he would always drift right and overload the right side with Noni.  Whether he plays centrally or right will make no difference cause he's equally as effective in both positions",
            "Oh look marsesca is a tatically adept coach, probably know more than most of us in this sub unlike poch.\n\nIt doesn’t matter where he plays on paper - he plays in the right half space. If he plays right, you need someone to overlap him, if he start 10/8 you still need a right sided player",
            "The sub assured me that Cole was better centrally and that’s where he would happily play once Olise got here.",
            "Might be a dumb question but has Maresca started the job or not yet? When do the players usually return back to training before preseason?",
            "And Sterling and Drewsbury-Hall if signed"
        ]
    },
    "🚨Arsenal had a 15% sell-on clause after selling Omari Hutchinson to Chelsea so will earn around £3million from the deal. ": {
        "title": "🚨Arsenal had a 15% sell-on clause after selling Omari Hutchinson to Chelsea so will earn around £3million from the deal. ",
        "score": 191,
        "url": "https://x.com/NizaarKinsella/status/1806994593491112111",
        "content": "",
        "num_comments": 20,
        "comments": [
            "From Nizaar Kinsella - Means we get £17 mil and they get £3 mil. Our new sell-on clause is 25%.",
            "NGL that's really favorable. £3m is fuck all and matching rights /sell on for such a massive talent is great. Given that we're set with Palmer, Paez and Estevao for a good few years this is a great little earner.",
            "So much for Arsenal’s gigantic sell on that so many people were shouting about. ‘50% sell on’, yeah right.",
            "Having matching rights and a 25% sell on clause on a player who is 1-2 seasons away from being a 60-70M player is fucking good business",
            "Hahaha they thought it was 50% 😂",
            "Those gooners really thought we were gonna agree to anything over a 15% sell-on. Huge sell-on clause indeed!",
            "These board do know business I will give them that",
            "Feeding the poor yet again...",
            "They really got us good. They might even win a trophy with that soon!",
            "We apparently have a matching rights as well"
        ]
    }
}