{
    "Research S.O.S.—Ask your research and technical questions": {
        "title": "Research S.O.S.—Ask your research and technical questions",
        "score": 2,
        "url": "https://www.reddit.com/r/chemistry/comments/1djgd01/research_sosask_your_research_and_technical/",
        "content": " Ask the [r/chemistry](https://www.reddit.com/r/chemistry/)  intelligentsia your research/technical questions. This is a great way  to reach out to a broad chemistry network about anything you are curious  about or need insight with.",
        "num_comments": 1,
        "comments": [
            "Any chemist here that can help me with a question?"
        ]
    },
    "Weekly Careers/Education Questions Thread": {
        "title": "Weekly Careers/Education Questions Thread",
        "score": 1,
        "url": "https://www.reddit.com/r/chemistry/comments/1dhvbw9/weekly_careerseducation_questions_thread/",
        "content": " This is a dedicated weekly thread for you to seek and provide advice concerning education and careers in chemistry.\n\nIf  you need to make an important decision regarding your future or want to  know what your options, then this is the place to leave a comment.\n\nIf you see similar topics in [r/chemistry](https://www.reddit.com/r/chemistry/), please politely inform them of this weekly feature.",
        "num_comments": 16,
        "comments": [
            "Question for former non-PhD core facility staff. Do you feel that working in an academic core facility made it harder to get an industry job?",
            "Hello! I’m looking for some advice from anyone who’s been through the all-too-common experience of a graduating uni with a bad GPA and still wanting to go to grad school. \n\nI graduated in 2019 from UMich with a B.S. in BCN, ~2 years of research experience with one publication as second-author, 3 years of work experience at a startup in drug discovery. I feel confident in getting 3 good LOR from my professor I researched under and my mentors in industry, however, I’m fighting an uphill battle with a 2.45 GPA. \n\nLong story short, I have a parent who relapsed in their opiate addiction during my time in school and my resulting mental health snowballed with a couple bad grades into a tenure I’m not proud of. I went into college wanting to go into higher education for chemistry and rediscovered that love while working on a project at my company, and am ready mentally to do my best in school.\n\nI’ve spoken with some admissions counselors and chair members at various schools in the Midwest and they’ve recommended a plethora of ideas: second B.S., Masters, Post-bacc. Overall another opportunity showing my ability to be successful in the classroom along with more research. \n\nWhat would y’all recommend? If it’s a masters or post-bacc, should I be raising my GPA with classes taken at a community college before applying? Any university or program you’ve had a positive experience with?",
            "If anyone has any experience with the ACS general chemistry exam, what can I do to prepare for it outside of getting the study guide",
            "As a self taugh artist I would know about the most creative job existing there. My hope is to find a job that mixing chemistry and creativity. Do you have any field suggestions that I can looking for ?",
            "Chem adjacent industries\n\nHello all! \n\nI’m a recent grad who’s been working as a lab tech for a little over a year now. While I find the principles that we implement interesting, and my coworkers are great. I honestly don’t see myself doing technical/lab work for the long haul. Are there any “adjacent” industries where I could leverage my chemistry knowledge while being able to work more closely with people or groups?",
            "I'd start by just trying to apply for PhD programs and seeing what happens.\n\nIf that doesn't work out, then I'd switch my sights to a low-cost thesis-based Master's. GPA shouldn't be as big a dealbreaker there.",
            "IMHO you can do this but you have other negatives besides only GPA.\n\nStart by asking your old professor or current employers if they can recommend you to anyone.  A direct referral can skip the application process.  If a PI wants you in their group, they will get your regardless of the application.\n\nWe consider a \"fresh grad\" as someone who has graduated within the last 3 years.  Check deeper into your prereqs for the PhD and some schools require you to have graduated in the last 5 years, or you have to take an exam / GRE.  They may require you to re-take one or two final year classes too, before the PhD coursework starts.  It's not significant, but it is more work they maybe don't want to do compared to other applicants.\n\nThe reason GPA is so valuable is it proves you have the ability to successfully complete 4 years of schooling.  It's a strong predictor that you can complete another 4+ years.  You can explain your reasoning for the previous dip but you have not explained or proven how you prevent bad mental health happening again.  There will be stressful events in the future (maybe not as extreme) and most people that start grad school won't complete (for good reasons too).  The method to prove it is obviously more schooling.  The post-bacc will be cheapest and fastest, plus expose you to new group leaders that may be willing to take you on.  Thesis-only masters is next and second BS is a terrible idea.\n\nGPA calcs can be manipulated in lots of ways and schools will do this to get candidates they like across the line.  You can use final year classes only, or core classes only, or last X years only.  That is why a post-bacc can be done as a quick boost, but it still requires some PI want you.  That's why I recommend finding a PI first before randomly applying as an unknown to the general candidate pool.\n\n[GRE is next-to-worthless](https://cen.acs.org/education/graduate-education/future-GRE/97/i5) for chemistry grad school these days, but it is a positive data point that doesn't cost too much or take that long.",
            "Study like you would for any exam. Read your textbook and notes, and do practice problems.",
            "Science illustration and science communication is what comes to mind first.",
            "Laboratory/Facilities management, technical sales for a scientific services or chemical or instrumentation company, environmental/health NGOs or government agencies, user/customer-facing roles at software companies targeting lab/biotech software users, etc.\n\nSort of depends on what you'd like to do!"
        ]
    },
    "PSA for chemists with eczema": {
        "title": "PSA for chemists with eczema",
        "score": 129,
        "url": "https://www.reddit.com/gallery/1dlhuop",
        "content": "Years into my PhD, relentless hand eczema turned nights into restless scratching sessions and days into a blur. Doctors prescribed antihistamines and steroid creams, offering little relief. My eczema worsened, forcing me to take breaks from work, utterly drained.\nA coworker, an eczema warrior herself, suggested wearing cotton gloves at night after moisturizing. It didn't work, but it sparked an idea. I discovered people with eczema wear cotton gloves under work gloves. Bingo! Wearing them at work and under my motorcycle gloves became a game-changer. It turned out I wasn't allergic to nitrile, but sensitive to prolonged contact with certain textures.\nCotton gloves were my saving grace. Now, I can finally enjoy life itch-free. \nPics are of the worst it ever got and of the cotton gloves you can get at the pharmacy.\n\nTLDR: Those who developed eczema as chemists, consider wearing cotton gloves under work gloves, it might save you years of struggle!",
        "num_comments": 42,
        "comments": [
            "I have very mild eczema and my kid is much worse. Have you tried soft guard from Fischer? It absolutely works for my hands - latex, nitrile etc. I used to get these pinhead sized blood blisters where if I clenched my fist I would just bleed. Soft guard fixed that.",
            "I work in a manufacturing facility with chemicals, many of the workers wear these cotton gloves under their nitrile gloves. It also helps don and doff gloves when your hands are sweaty because it’s a hot, humid environment. Glad you are getting relief!",
            "My coworker wears these and I always say how classy he is wearing them.",
            "My grad school sold glove liners in the lab store. Everyone in my lab used them, and I soon developed the habit. I cannot imagine doing my job without them. It’s literally been like 8 years of glove liners and I do not understand how your average scientist wears just gloves every single day.",
            "Cotton gloves are cheap from Amazon by the bundle. I don't have eczema, but it makes prolonged wearing of nitrile gloves more comfortable.",
            "Cause of eczema is varied. There might not be a solution to it for everyone. Everyone thinks they know the solution for eczema.",
            "I might want these cotton gloves for other reasons... you say they're available in a typical pharmacy? Do they come in distinct sizes so I can find one that's snug?",
            "I had to sew myself some liners for our glovebox.  The butyl rubber was the only thing I’ve ever reacted to",
            "Nice to know!",
            "Works for me too. Went years without any problems then one day just started getting rashes after wearing gloves all day. The only thing that helps is cotton glove liners."
        ]
    },
    "My Experience Job Hunting - May 2024 B.S. Chemistry Graduate (Details in comments)": {
        "title": "My Experience Job Hunting - May 2024 B.S. Chemistry Graduate (Details in comments)",
        "score": 77,
        "url": "https://i.redd.it/op4qewl8zz7d1.png",
        "content": "",
        "num_comments": 14,
        "comments": [
            "During my job search, I came across a few posts on this subreddit discussing careers, salary, and job prospects. I found these to be very helpful while I was applying, and thought I would put this out here now that my job search is complete.\n\nAs some background, I am from Missouri and attended a public university in Missouri. As a result, almost all of my applications were sent to companies in Missouri or in the neighboring Midwest. Before my graduation, I had probably sent out around 10-20 applications between March-May, without much luck. Once I graduated however, I created a LinkedIn, Indeed, Handshake and Glassdoor account and began to apply to most of the jobs in my surrounding area. I would say 100+ of my applications were sent in the past month (Late May - June) alone.\n\nWhile in uni, I did around 2.5 years of undergraduate research with a lab focused on organic chemistry. I also obtained a summer internship at a large chemical company as a QC intern one summer. I really enjoyed undergraduate research and therefore mainly focused on bench chemist/R&D based roles during my application process.\n\nI found that most of the companies that contacted me back generally had around 3 interviews, with the first being a generic interview with HR, the second being a virtual interview with chemists/lab managers, and the third being an in-person lab tour/interview. Of the 8 interview requests I got, I received 2 offers.\n\nThe first offer came right as I graduated, and was for a bench chemist position in a small town in Arkansas. I ended up rejecting the offer as I thought the town was too small and far from family. This job offered a base pay of 26.00$ an hour with a yearly bonus of an undisclosed amount.\n\nThe second offer was for an R&D chemist position in Missouri. This position offered a salary of 65k with benefits and I accepted this offer.",
            "I’m in the 30s in terms of number of applications sent out and I’ve just got my first call for an interview. It’s seems like a slim job market at the moment.",
            "Damn. I applied to like 5 places two years ago and found a job.",
            "Congrats and best of luck!",
            "It was a very different market two years ago. I (PhD) got the first job (small pharma discovery chem) I applied to. It was a great fit, but still. I even applied using the LinkedIn easy apply, lol.",
            "Yes, that is more typical.  \n\nShotgunning 124 applications and hoping for bites isn’t the best way to get a lab job.  The OP’s graphic shows the terrible returns on that strategy.",
            "So what is the best way?",
            "So you say it is better to just apply to 1-4 jobs and just get hired?",
            "If you’re like the OP and did an internship and undergraduate research, you should be using that network to help you apply for a handful of jobs that align well with your interests and skills.\n\nI will almost certainly hire you if you send me a well crafted résumé tailored for my lab and I also see that you worked with my colleagues and you have an undergraduate paper.\n\nI will discard your application unread if it appears to be a generic résumé sent blind, with no effort to tailor it for what we do here.",
            "Yes, you’re much better off targeting and re-writing your résumé for a handful of jobs that you are well-suited for, rather than sending off dozens and dozens of generic apps.\n\nEspecially, if like the OP, you did an internship and had years of undergraduate research.  You should be using that network to help you find a job.  That is really the whole point of doing both of those things."
        ]
    },
    "Pronunciation of Halogens": {
        "title": "Pronunciation of Halogens",
        "score": 85,
        "url": "https://www.reddit.com/r/chemistry/comments/1dlb4mt/pronunciation_of_halogens/",
        "content": "Note: these are the typical US pronunciations; pronouncing iodine as eye-oh-deen is perfectly reasonable\n\nFluorine: flo-reen\n\nChlorine: klo-reen\n\nBromine: bro-meen\n\n**Iodine: i-oh-dine**\n\nAstatine: as-ta-teen\n\nTennessine: ten-nes-seen\n\nwhat in the actual f is iodine doing... you don’t get your own special thing just for being a solid\n\nEdit: Flo-reen is pronounced the same as floor-een, just with the r at the start of the second syllable, which is how I pronounce it. I initially typed them as flor-een and klor-een, then moved the r and didnt think of how the pronunciation would be affected",
        "num_comments": 86,
        "comments": [
            "Actually here in the UK we tend to pronounce it I-oh-deen.",
            "Eye-oh-deen\n\nFloor-een\n\nKlor-een\n\nBro-meen",
            "Near as I can figure it has to do with how the various English dialects stress the word. But probably a question for r/linguistics",
            "It’s just English being English.",
            "Flo-reen? Clo-reen? I don’t think so.",
            "My old af professor said it like I-oh-deen (US)",
            "I have always pronounced it eye-oh-deen. I’m from USA also",
            "Aus\n\n- Fluorine: Flu-reen \n\n- Chlorine: Klor-reen \n\n- Bromine: Bro-meen \n\n- Iodine: I-oh-deen \n\n- Astatine: As-ta-teen\n\n- Tennessine: Teh-neh-seen\n\nApologies; I’ve never been  great at writing words in my accent.",
            "This is the problem with American pronunciation. There's absolutely no reason to change the pronunciation of iodine in regard to all the other halogens, but you do it anyway, and assume you're correct. 🙄 The arrogance.",
            "I mean several of your pronunciations are just wrong"
        ]
    }
}