{
    "Weekly Discussion & Tournament Thread Index - June 24, 2024 [Mod Applications Welcome]": {
        "title": "Weekly Discussion & Tournament Thread Index - June 24, 2024 [Mod Applications Welcome]",
        "score": 5,
        "url": "https://www.reddit.com/r/chess/comments/1dn4j5b/weekly_discussion_tournament_thread_index_june_24/",
        "content": "# r/chess Weekly Discussion Thread\n\nYou are welcome to ask here all kinds of chess-related questions that don't warrant their own post. You can also discuss or ask questions about upcoming tournaments that don't have their own thread yet.\n\n&#x200B;\n\n**Moderation**\n\n**OPEN CALL** for new moderators! Interested in: creating event posts, hosting AMAs, making sure only the finest queen sacrifice puzzles make the front page? [Apply Now!](https://www.reddit.com/message/compose/?to=/r/chess&subject=Want+to+volunteer+for+mod)\n\n**Event threads**\n\nInterested in making threads for tournaments, but don't know where to start? Our [Event Template](https://www.reddit.com/r/chess/wiki/eventtemplate/) page is a great way to get the basic layout.\n\nAn alternative would be to start a subthread directly in the weekly thread.\n\n&#x200B;\n\n**Announcements**\n\n[**REWORK OF r/chess RULES**](https://www.reddit.com/r/chess/comments/1btdq9f/important_rework_of_rchess_rules/)\n\n**UPDATED Oct 27th** \\- [r/chess Announcement Regarding Coverage of St. Louis Chess Club and USCF Events](https://www.reddit.com/r/chess/comments/16dyy3u/rchess_announcement_regarding_coverage_of_st/)\n\n&#x200B;\n\n**Recent AMAs**\n\n* [GM Alex Colovic](https://www.reddit.com/r/chess/comments/1b81pab/hi_im_gm_alex_colovic_an_award_winning_chessable/)\n* [Lichess Team](https://www.reddit.com/r/chess/comments/1bbd4ke/lichess_team_ama/)\n\n&#x200B;\n\n**Active Tournament Threads**\n\n|DATES|EVENT|\n|:-|:-|\n|\\-|\\-|\n\n&#x200B;\n\n**Other Active Tournaments Web Links**\n\n|DATES|EVENT|\n|:-|:-|\n|Jun 10-18|[Stepan Avagyan Memorial](https://chess-results.com/tnr953203.aspx?lan=1&art=2&turdet=YES&flag=30)|\n|Jun 17-18|[Chess.com Chess960 Community Championship](https://www.chess.com/events/2024-chesscom-chess960-championship-qualifier-1)|\n\n&#x200B;\n\n**Upcoming Tournament Schedule**\n\n|DATES|EVENT|NOTABLE PLAYERS|\n|:-|:-|:-|\n|Jun 25-Jul 6|[GCT Bucharest](https://grandchesstour.org/tours/2024/)|Many 2700+ players|\n|Jul 10-14|[GCT Zagreb Rapid and Blitz](https://grandchesstour.org/tours/2024/)|Many 2700+ players|\n|Jul 25-Aug 9|[Speed Chess Championship](https://www.chess.com/events/info/2024-speed-chess-championship)|Carlsen, Caruana, Ding,   Firouzja, Nakamura, So, Vachier-Lagrave|\n|Sep 10-25|[45th Chess Olympiad](https://fide.com/calendar/53628)|(Hungary) Many 2700+ players|\n|Nov 20-Dec 15 (Tentative)|[FIDE World Championship](https://www.chess.com/events/2024-fide-chess-world-championship)|Ding Liren vs Gukesh Dommaraju|\n\n&#x200B;\n\n**Recently Completed Tournaments**\n\n|DATES|EVENT|PODIUM|\n|:-|:-|:-|\n|Jun 6-14|[UzChess Cup](https://www.reddit.com/r/chess/comments/1dat1tw/event_uzchess_cup_2024/)|Yakubboev, Abdusattorov, Yu|\n|Jun 10-13|[Bullet Chess Championship](https://www.reddit.com/r/chess/comments/1dcu3wy/chesscom_bullet_chess_championship_2024_day_1/)|Firouzja, Nakamura, Sevian|\n|Jun 2-13|[FIDE World Junior Championship](https://chess-results.com/tnr945372.aspx)|Kazybek, Emin, Luka|\n|May 27-Jun 7|[Norway Chess](https://www.reddit.com/r/chess/comments/1d1iyr5/event_norway_chess_2024/)|Carlsen, Nakamura, Praggnanandhaa (Open); Ju, Muzychuk, Lei (Women)|\n|May 25-Jun 2|[Aktobe Open](https://chess-results.com/tnr933360.aspx?lan=1)|Maghsoodloo, Predke, Sarana|\n|May 24-Jun 2|[Americas Continental Championship](https://chess-results.com/tnr926264.aspx?lan=1)|Garcia, Xiong, Henriquez|\n|May 14-22|[Sharjah Masters](https://www.reddit.com/r/chess/comments/1crj5dc/event_sharjah_masters_2024/)|Daneshvar, Murzin, Shankland|\n\n&#x200B;\n\n**Other Notable Threads**\n\n[Coach a Player - Recent Threads](https://www.reddit.com/r/chess/search/?q=coach+a+player+flair%3Acoaching&include_over_18=on&restrict_sr=on&t=year&sort=new)\n\n&#x200B;\n\n**Community Content**\n\nHere we'd love to highlight community content to show our appreciation for the energy spent. Content like Game analysis, info-graphics, etc., and we'd love to hear from you what kind of content you'd like to see as well.\n\n[Want to post your game to r/chess?](https://www.reddit.com/r/chess/comments/171m7px/want_to_post_your_game_to_rchess/) \\- for people who want to solicit feedback on their games\n\n[Advice to people asking for advice](https://www.reddit.com/r/chess/comments/1ckzkcb/advice_to_people_asking_for_advice/) \\- for people who want to ask about how to improve\n\n[Managing tilt in chess](https://www.reddit.com/r/chess/comments/1cm8b2x/how_better_managing_tilt_has_helped_me_improve/) \\- for people who are surprised about their rating variance",
        "num_comments": 11,
        "comments": [
            "Is king rook and knight vs king rook and pawn a draw?",
            "What was that chess website from a few years ago that lets you guess the next moves of top players?",
            "RN vs R is generally a draw, yes.",
            ">So FIDE decided to ask the World Junior participants about their favourite player - the answers are frankly a lot unexpected\n\nTaking into account the host country of the championship, I'm not that surprised",
            "I am surprised by the Karpov answers. Karpov is ofted underrated.",
            "Ended in a rook trade then I had to sac knight for pawn, guess it was the best I could do",
            "based on the bottom comment on that page it was my use of the engine (rather than just an analysis board) which was the issue. I only used it to look back but i did use it and that's not allowed. I'll just have to be more patient and wait for the game to end in future. thanks",
            "I just got flagged for cheating on lichess and i want to know if what i did was wrong. I don't think i cheated.\n\nI play 1 day rated correspondance. Very mid level.\n\nAt the beginning of the end game I opened up an analysis board to look at the end of the opening and end of the mid game. I didn't look forward at all. Just wanted to analyse a couple of key positions and decisions i made earlier in the game. it was an interesting game. \n\nLichess ended the game pretty swiftly for cheating. I was sure i'd done that before without issue but maybe am mistaken. \n\nIs what i have discribed considered cheating or bad etiquete?",
            "Divya Deshmukh!",
            "So FIDE decided to ask the World Junior participants about their favourite player - the answers are frankly a lot unexpected than you'd think\n\nhttps://x.com/FIDE_chess/status/1805273885945868573\n\nIt is a short video.\n\nSpoiler: >!Gukesh is a massive fan favourite and the most popular name after the older, established trio of Magnus, Vishy and Hikaru!<"
        ]
    },
    "Event: 2024 Superbet Chess Classic Romania": {
        "title": "Event: 2024 Superbet Chess Classic Romania",
        "score": 41,
        "url": "https://www.reddit.com/r/chess/comments/1dnx08g/event_2024_superbet_chess_classic_romania/",
        "content": "####[**Official Website**](https://grandchesstour.org/tours/2024/tournaments/2024-superbet-romania-chess-classic/)\n\nFollow the games here: [Chess.com](https://www.chess.com/events/2024-gct-superbet-chess-classic) | [Lichess](https://lichess.org/broadcast/superbet-romania-chess-classic-2024/K1NfeoWE) | [Chess-Results](https://chess-results.com/tnr958687.aspx?lan=1&turdet=YES)\n\n***\n\nROMANIA - Ten of the world’s best chess players will be joined by local favourite Bogdan Deac in the second event of this year’s Grand Chess Tour, the Superbet Romania Chess Classic. This year’s classical chess competition will be held at the Grand Hotel Bucharest from June 25th until July 5th. Six-time world champion Garry Kasparov, founder of the tournament, will also be present in Romania. The prize money for the Bucharest leg of the Grand Chess Tour is $350,000. The current edition’s prize fund is provided by the main sponsors: the Superbet Foundation and the Saint Louis Chess Club. The Romanian Chess Federation will act as a co-organizer of the event.\n\n***\n\n####**Standings** (after Round 3)\n\n**\\#** | **Title** | **Name** | **FED** | **[URS](http://universalrating.com/)** | **Score**\n:--:|:--:|:--|:--|:--:|:--:\n1 | GM | Fabiano Caruana | 🇺🇸 USA | 2788 | 2\n2 | GM | Dommaraju Gukesh | 🇮🇳 IND | 2731 | 2\n3 | GM | Ian Nepomniachtchi | FIDE | 2778 | 1½\n4 | GM | Wesley So | 🇺🇸 USA | 2761 | 1½\n5 | GM | Alireza Firouzja | 🇫🇷 FRA | 2761 | 1½\n6 | GM | Maxime Vachier-Lagrave | 🇫🇷 FRA | 2759 | 1½\n7 | GM | R Praggnanandhaa | 🇮🇳 IND | 2757 | 1½\n8 | GM | Anish Giri | 🇳🇱 NED | 2736 | 1½\n9 | GM | Nodirbek Abdusattorov | 🇺🇿 UZB | 2767 | 1\n10 | GM | Bogdan-Daniel Deac | 🇷🇴 ROU | 2685 | 1\n\n***\n\n####[**Format/Time Controls**](https://images.chesscomfiles.com/uploads/v1/images_users/tiny_mce/PedroPinhata/phpsK6imr.png)\n\n* The Superbet Romania Chess Classic is a ten-player single round-robin. The time control is 120 minutes for the entire game, plus a 30-second increment per move.\n\n***\n\n####**Schedule**\n\n*All times are in local time, EEST (GMT+3)*\n\n**Date** | **Time** | **Round**\n:--:|:--:|:--\n29 June | 15:00 | Round 4\n30 June | 15:00 | Round 5\n1 July | -- | Rest day\n2 July | 15:00 | Round 6\n3 July | 15:00 | Round 7\n4 July | 15:00 | Round 8\n5 July | 15:00 | Round 9\n\n***\n\n####**Live Coverage**\n\n* Fans can catch all the action with GM Yasser Seirawan, GM Evgeny Miroshnichenko, GM Cristian Chirilă and IM Jovanka Houska on the St. Louis Chess Club’s [Twitch](https://www.twitch.tv/stlchessclub) & [YouTube](https://www.youtube.com/@STLChessClub) channels.\n\n* Move-by-move coverage of the event is available on ChessBase India's [YouTube](https://www.youtube.com/@ChessBaseIndiachannel) channel, with IM Sagar Shah and Amruta Mokal commentating.",
        "num_comments": 335,
        "comments": [
            "LMAO So just said that chess.com engine is weak and 'should go to Lichess' on stream",
            "Nepo would have taken a draw against everyone else in this field by now. But he is grinding it out against Gukesh in an equal endgame.",
            "Least crazy Gukesh middle game.",
            "So I take it Tate didn't make an appearance today",
            "lol wesley saying he would have resigned under the usual time control",
            "Lichess  brought to you by \"w\"esley \"s\"o",
            "Gukesh vs Pragg today. I expect nothing but fireworks.",
            "After losing yesterday, Alireza thinks he's now in the losers bracket",
            "Nodirbek drops to #7 after this loss",
            "Something goofy always happens with Gukesh and Pragg play lol"
        ]
    },
    "Hint: what's even better than one fried liver?": {
        "title": "Hint: what's even better than one fried liver?",
        "score": 56,
        "url": "https://i.redd.it/2tm88guh3i9d1.png",
        "content": "",
        "num_comments": 10,
        "comments": [
            "This is crazy, i would be on the Verge of crying. How does this happen xD",
            "Just for clarification. Fried liver is not Ng5. It is not Nxf7. It is the way that the king has to squirm around on the middle of the board after taking on f7 in order to survive the onslaught, and how it ressembles a liver on a hot frying pan. That, and it also sounds kind of similar to the proper name, the Fegatello attack.",
            "I would have gone in with my left horse.",
            "How is your opponents move only seen as a simple mistake",
            "Probably because white is already winning so much.",
            "knightmare fuel",
            "Okay, this is epic",
            "Resigned liver",
            "I analyzed the image and this is what I see. Open an appropriate link below and explore the position yourself or with the engine:\n\n> **White to play**: [chess.com](https://chess.com/analysis?fen=r1bk1b1r/ppppnppp/2n5/2qNp1N1/2B1P1Q1/2PP4/PP4PP/R1BK3R+w+-+-+0+1&flip=false&ref_id=23962172) | [lichess.org](https://lichess.org/analysis/r1bk1b1r/ppppnppp/2n5/2qNp1N1/2B1P1Q1/2PP4/PP4PP/R1BK3R_w_-_-_0_1?color=white)\n\n**My solution:**\n\n> Hints: piece: >!Knight!<, move: >!Nxf7+!<\n\n> Evaluation: >!White has mate in 2!<\n\n> Best continuation: >!1. Nxf7+ Ke8 2. Nxc7#!<\n\n---\n\n^(I'm a bot written by) [^(u/pkacprzak)](https://www.reddit.com/u/pkacprzak) ^(| get me as) [^(iOS App)](https://apps.apple.com/us/app/id1574933453) ^| [^(Android App)](https://play.google.com/store/apps/details?id=ai.chessvision.scanner) ^| [^(Chrome Extension)](https://chrome.google.com/webstore/detail/chessvisionai-for-chrome/johejpedmdkeiffkdaodgoipdjodhlld) ^| [^(Chess eBook Reader)](https://ebook.chessvision.ai?utm_source=reddit&utm_medium=bot) ^(to scan and analyze positions | Website:) [^(Chessvision.ai)](https://chessvision.ai)"
        ]
    },
    "The Grandmaster Dream - is it worth it?": {
        "title": "The Grandmaster Dream - is it worth it?",
        "score": 286,
        "url": "https://www.reddit.com/r/chess/comments/1dqzjsx/the_grandmaster_dream_is_it_worth_it/",
        "content": "Being Grandmaster has been my dream since I was a kid. I used to play chess whilst working full time, and I made the tough decision to take a break from chess in 2020 (never returned after covid) to focus on my career with a 2436 rating and 2/3 GM norms.\n\nRecently I've realised I miss playing chess so I'm considering coming back to the professional chess scene. Now seems like a good timing because I'm in a better financial position and if I wait longer I'll likely be at work for the next 10+ years and pass my cognitive peak (am 30 this year). I've also realised that money isn't everything and life is short, so I should do what I enjoy.\n\nA handful of top players are \"amateurs\" and I applaud them but I wouldn't try and multi-task work and chess again as it was extremely exhausting and frustrating, so I would quit my job to focus on chess.\n\nI would be all in, fully focussed on training and competing in international tournaments. Part of me is afraid of failure - I don't want to end up like Levy. But then again, so what if I fail? You miss every shot you don't take.\n\nIt can be quite lonely as a professional chess player, so I think I would also vlog/youtube my journey. I previously made some educational chess videos on my youtube channel a while ago, and one of them \"The only Pawn Structure Chess Guide you’ll ever need\" is consistently racking up some views, but creating the video itself wasn't that fun for me. On the flipside I think I'd absolutely love sharing my personal road to GM journey with a community, although I'm not sure people would be interested.\n\nWould love to hear your thoughts, good or bad!\n\nEdit: Wow did not expect all these comments and perspectives. Reading through has given me more mental clarity and I am going to go for it! I'll try to post some videos on [**yfchess**](https://youtube.com/@yfchess?feature=shared) - would be great to share this journey as I know it will be a long and difficult one.",
        "num_comments": 170,
        "comments": [
            "If you have 2/3 GM norms and \"only\" 66 elo points to reach 2500... And, overall, if it is your dream... Of course it is worth it!!! I think in some years (or when you get to reach that two objectives to be GM) you will be sooo happy being GM, not many people can really dream with it but you are so near, go on!!",
            "I'm of a similar age and playing strength to you, also trying to become a GM (I am attempting to multi-task it with work, and I understand why you'd rather not do that  but we all do what we can). I too know that spanning that final outstanding gap, even when it may appear small, is a difficult task. To me it seems that you have as good a chance as any, with 2 norms and a peak rating close to 2500. For myself, I can say that I'm not sure. Personally, I'm trying to see the task of competing for the highest title in the game in my thirties with a job as a fun adventure, however it ends up. This has allowed me to have fun traveling to new places, meeting new people, and competing for high stakes that I hope I won't regret even if I never become a GM. \n\nIf you come back to chess, my suggestion would be to have some sense of purpose that allows you to find the journey meaningful whether or not you earn the title. Not saying you shouldn't make sacrifices for it, but if you make them while thinking to yourself \"this will all be a horrible waste unless I make GM\", then I feel like the pressure you put on yourself won't be good for your overall well-being, let alone your chess. Your idea of documenting your journey for others to follow along is one good idea that could plausibly make this journey feel rewarding, whatever the outcome.",
            "I would say absolutely go for it - at age 25 I went all in on the GM title (at the time I wasn't even IM yet so it was an even greater risk). People advised against it as I could just stay at a normal job, but I didn't want to have any regrets about my chess career. So I sat down, worked my ass off for 2-3 years and went from 2300 to over 2500. I think in order to make it work, you do have to make enormous sacrifices though. Social life was pretty much nonexistent for me during that period. But I'm sure if you're asking this, then you already understand that.\n\nBest of luck if you decide on it, it isn't an easy journey. Documenting it sounds like a great idea!",
            "> Part of me is afraid of failure. I don't want to end up like Levy.\n\nDamn Levy catching strays. He is doing pretty fine though.",
            "I think you should go for it. We only have one life, if this is your dream dont let it pass you by. Its like they say in Dune, fear is the mind killer. You got this.\n\nThis also doesnt sound too much of a stretch of a dream either. This seems obtainable and within your reach. I think people would enjoy following the journey with you.",
            "I think about this frequently from a similar position  The main thing you have to appreciate isn't that you might (maybe probably will) fail, but that even if you succeed, almost nothing will actually change in your life. You'll feel like an absolute king for like a week, sure, but then it's more or less back to normal. You will still play the same tournaments for fun, still play online pretty much the same amount as before, still understand (or lack thereof) the game almost the same amount, and none of your non-chess friends will really understand or care (many of them probably think \"International Master\" is a better title than GM anyway). You'll also be sacrificing a fair amount of your life and career - more than you might think, because beyond the raw time off it's a fairly consuming endeavor, plus it's not unlikely to drag on longer than you'd think (if you're, say, consistently 2470 a year from now, would you stop?). Plus, since you've made norms already, you already know you're capable of the title, and it's largely \"just\" a question of time and dedication now - do you actually need to put in those hours to be satisfied, or is knowing that you could enough?\n\nIf you've (truly) internalized all that and still have even an inkling that it's something you want to pursue, then you have your answer  Happy to chat more in DM if it would help.",
            "It depends if you have better things to do. I you already have a family I don't think it is worth the effort. I would rather spend my time with my kids and pets, than focusing most of my energy on a single goal.\n\nBut if you do have time, you should at least try it. It will probably be harder than you think, especially since you are not very young anymore. People typically underestimate the effort required to accomplish something. You will probably need at least 3-4 years of very hard work. If you haven't played in 4 years you probably need more than a year to get to your previous level.",
            ">I don't want to end up like Levy\n\nThe most successful chess streamer, millionaire, highly respected and influential player and commentator? Why not?",
            "Mr. Yang-Fan you got this!!!!!",
            "You have to beat Levy to it, bare minimum. \n\nIn all seriousness, I'm deeply invested in your journey now."
        ]
    },
    "Is it against FIDE rules if you unbutton your pants due to a tummy ache?": {
        "title": "Is it against FIDE rules if you unbutton your pants due to a tummy ache?",
        "score": 176,
        "url": "https://www.reddit.com/r/chess/comments/1dqz6g8/is_it_against_fide_rules_if_you_unbutton_your/",
        "content": "I feel like it could possibly be distracting or not allowed for other reasons",
        "num_comments": 39,
        "comments": [
            "It makes me wonder how far you can take it before it actually gets the attention of anyone in the playing hall. Like, just undoing the button on your pants while seated - no one is going to notice. Undo the button and unzip the zipper... That makes a bit of noise and takes more effort, so likely your opponent will notice, but probably no one else. Unzip and start to slide the pants off.... Take them off entirely? At what point does an arbiter get involved?",
            "Yes its allowed, but only if you really have a stomach ache.\n\nI recommend farting loudly to prove your case.",
            "Ain't no rule says a dog can't play chess.",
            "You may be looking for the other subreddit",
            "Impossible to answer because it depends completely on the severity of the tummy ache and whether or not they can provide a little treat.",
            "Yeah I had a tummy ache in theatres watching *Challengers* and nobody believed me either",
            "With your best Matthew McConaughey impression: \"Let's take off our shirts..\"",
            "If you want to look at it this deeply, there would be two sets of rules you have to follow: the dresscode of the tournament organiser and the local laws about public indecency. \n\nAs long as you play a FIDE rated tournament in a location where unbuttoning your pant is not considered public indecency as per local laws, as well as in a tournament which has not explicitly prohibited such acts in their dresscode, you are free to do whatever you want",
            "It's actually the first step to achieving GM",
            "May I suggest not wearing such tight pants if you expect a tummy ache to become such a large problem that you need to unbutton your pants."
        ]
    }
}