{
    "CHIBears Weekly Chat Thread": {
        "title": "CHIBears Weekly Chat Thread",
        "score": 11,
        "url": "https://www.reddit.com/r/CHIBears/comments/1do2cqx/chibears_weekly_chat_thread/",
        "content": "",
        "num_comments": 15,
        "comments": [
            "After the war that took place at the beginning of the off-season it's refreshing to see no news for a bit.  Going from 500+ comments a day on the daily QB battle thread to barely 5 on a weekly chat thread.  I mean it when I say no news right now is good news.  The draft was great, the team is all locked in, and no drama (knocks on wood) is nice.",
            "Bears might not lose a game this year",
            "Gotta get my italian beef recipe down for this year",
            "I'm really hoping that the offense can solidify itself by the beginning of the first month of the season⁉️",
            "I like that Kenaan Allen's contract expires at the end of the year, but would that $23M have been better spent on a 13M edge and 10M OL?  To be so loaded at WR and lacking at edge and OL seems like it could come back to bite them.\n\nAdding plus a 4th round pick.",
            "Does anyone know if Kiran Amegadije play highschool bball with Matas buzelis the Bulls draft pick? I'm pretty sure their times at Hinsdale overlap a little bit, just wondering if their might be a connection. Matas transferred out during his sophomore season so it's kind of a small window.",
            "Caleb Williams is undefeated as a bear",
            "I think we’ll get a pretty damn good sense about our offensive potential after the first game. Raw Qb ability means so much in the NFL. Remember all those videos of Fields not seeing wide open guys? All it takes to meaningfully improve the offense is for Caleb to make two or three of those throws. I bet we get a sense very quickly of whether he has that innate vision. \n\nBut I think it will take more than a month for the offense to ‘solidify’ meaning everyone knows their assignments and roles, etc. new OC, new QB and a lot of new skill players. That’s gonna take some time.",
            "Prob will take a few weeks",
            "It’s debatable in retrospect but when they got Allen they didn’t know if they were going to get Rome. If they didn’t get Allen and the Falcons or someone took Rome we’d be left with only DJ at WR with a rookie qb"
        ]
    },
    "Weekly Self-Promo and Tickets/Merch Sale Thread": {
        "title": "Weekly Self-Promo and Tickets/Merch Sale Thread",
        "score": 8,
        "url": "https://www.reddit.com/r/CHIBears/comments/1dq4qmp/weekly_selfpromo_and_ticketsmerch_sale_thread/",
        "content": " \n\nPromote Yourself! Do you have a blog, Twitter, Youtube, write articles, etc... that you want to share with the sub? This is your monthly place to do it! Doesn't even need to be Bears related.\n\nAdditionally, this is the place to sell or search for tickets or merch, or ask general questions related to either.\n\n**As with any online transaction, please take precaution when sending or receiving money. If something seems fishy or you think you have been scammed please message the Moderators.**",
        "num_comments": 6,
        "comments": [
            "Again, I think I’m pretty cool.",
            "Any STH's here looking to sell tickets they are not planning to go to? Send me a DM if so. Transaction ONLY through Paypal (For all those scammers out there) and ticket electronic transfer through Ticketmaster to save both the buyer and seller the ticketmaster fees.",
            "Lol, and again I agree. Stay cool 😎",
            "Did we just become best friends?!",
            "We always were, friend! Want to do karate in the garage?",
            "I love you, man."
        ]
    },
    "Ryan Poles days away from Week 1": {
        "title": "Ryan Poles days away from Week 1",
        "score": 56,
        "url": "https://i.redd.it/7fwh7bsr9i9d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Poles will be the only one who was a PS guy only for the countdown. Felt like working him into this list somehow.",
            "I actually wouldn't mind more 'unknown' guys who weren't stars. Gives us a chance to learn a bit about someone new & their history in the league.",
            "Damn, so the XxXKingPoles69XxX who schooled me in Madden on the Xbox wasn't the real guy? I'm so disappointed!",
            "Will mix it up a bit. What I am trying to do is get some who were at least on the team longer than 2-3 years overall. Which for some numbers is harder than others.",
            "I really gotta hand it to him, I wasn't sure about Poles as a GM at first. The easy part was trading away players from the previous regime and most of them were fairly expensive too. 2022 was definitely an evaluation year for a lot of players to see who could be worth keeping around next year. 2023 was a step in the right direction, even though the team itself also blew a lot of games, that's also part of the evaluation and more moves were made because of that. \n\n\nYou can say he got lucky with getting consecutive #1 overall picks but you gotta make your own luck, and he just so happened to trade 2023's pick to the right team as we wound up taking an elite QB prospect for the first time in a very long time. I'm pretty excited for the foreseeable future, Poles has a clear vision and is executing it pretty well so far, all that's left is for us to start winning.",
            "Dudes gorgeous"
        ]
    },
    "A surprise, I'm sure, but a welcome one. ": {
        "title": "A surprise, I'm sure, but a welcome one. ",
        "score": 174,
        "url": "https://i.redd.it/j68dib7cke9d1.jpeg",
        "content": "",
        "num_comments": 29,
        "comments": [
            "NFC North is going to be a gauntlet to win, 🐻👇",
            "If Odunze shines in the beginning of the season and both Moore and Allen do their usual then I can see us being ranked #1. Odunze doesn’t count in this consideration until he’s proven himself",
            "This really shouldn’t be a surprise. And I don’t know why other fanbases are getting so butt hurt about this PFF ranking. Bears absolutely do have a top 5 receiving corps… on paper. \n\nDoes that mean they’ll actually be good in real life? No, not necessarily. We have a new QB and a new OC. Our O Line is decent but maybe a bit suspect in pass pro. We have no idea how this will all workout and gel together. But on paper that is a lot of *individual talent*.",
            "Great. Now protect QB & hope he can deliver accurately w/o happy feet… easy peezy… 😂",
            "Jaylen got paid for this.",
            "All it took was a GM getting his own QB",
            "I want to see the cope from Packer fans",
            "Fuck the Vikings of course, but when JJ got injured, Addison stepped up in a big way. In the handful of games I saw with them, the kid was impressive. If they had a QB, there would be some worry.",
            "I may get shit for this but honestly, I would’ve preferred to have Aaron Jones over Deandre Swift. Obviously the age difference matters but we saw years of Swift in Detroit and he rarely impressed me. He goes and has one decent season with the best Oline in the league and we give him a fat ass contract? Makes no damn sense.",
            "Concerns about the run game. Fields was alot if that."
        ]
    },
    "Have the Bears ever added a new starting QB, RB, WRx2 to start a season before?": {
        "title": "Have the Bears ever added a new starting QB, RB, WRx2 to start a season before?",
        "score": 356,
        "url": "https://i.redd.it/th2h99flhc9d1.jpeg",
        "content": "",
        "num_comments": 92,
        "comments": [
            "If Caleb is good, we're going to be good. If Caleb and Gervon are good, it's going to be a season to remember.",
            "Uh, literally left off the biggest “get” of all… Punt God? Smh",
            "Last big overhaul of the roster was leading into 2018, with Robinson, Gabriel, Burton, Roquan, and Mack.\n\nThat was the most excited I had been going into a season in a long while.",
            "I forgot the bears got Swift, should be an interesting season for yall. Too bad fields didn’t work out for yall but it should be a fun season! Hope Caleb doesn’t have too many growing pains this year!",
            "Stop, I can only get so hard!",
            "And a brand new offensive coordinator. \n\nIt's a lot of new faces, all learning new stuff together, there are bound to be some rough games going forward. I'm sure this sub will handle them with class, civility, and moderation though lol.",
            "Bricked up over here. Lfg",
            "WHERE IS THE CROCODILE PUNTER??! \n\nHe’s arguably the most important get of the offseason.",
            "In 1975 we replaced 8 of the 11 starters on offense.  We started 5 rookies that year, including HB Walter Payton, FB Roland Harper, and LG Noah Jackson.  The next year we replaced the QB, both WRs, and the TE, plus put Revie Sorey at RG.  So not at all once, but from 1974 to 1976 only LT Lionel Antoine remained.",
            "One would hope not, right?"
        ]
    }
}