{
    "Monthly Events & Things To Do in Chicago Thread": {
        "title": "Monthly Events & Things To Do in Chicago Thread",
        "score": 34,
        "url": "https://www.reddit.com/r/chicago/comments/1d5fdu2/monthly_events_things_to_do_in_chicago_thread/",
        "content": " Welcome to the monthly [/r/Chicago](https://old.reddit.com/r/Chicago)  events thread. This is the place to advertise any upcoming events or  group gatherings you're a part of or anticipating that other Chicagoans  might want to know about.\n\nThis thread is exempt from Rule 8 regarding promotion, so we invite  anyone and everyone to advertise anything going on in Chicago. But  please be mindful of rules 2 & 3 which still apply in this thread,  as well as the Reddit Content Policy when posting.",
        "num_comments": 76,
        "comments": [
            "If you are a parent who'd like to introduce biking to your kiddos - there's Lincoln Park Kidical Mass this weekend at 9 AM Sunday [https://www.chicagofamilybiking.org/eventscalendar/lincolnpark2405](https://www.chicagofamilybiking.org/eventscalendar/lincolnpark2405) starting at Oz Park.",
            "The Field Museum is free for Illinoisians every Wednesday for the rest of the year! Wednesday opening hours are from 9 AM to 5 PM.",
            "https://www.freshwaterlab.org/projects/backward-river-festival-damen-silo-city\n\nSaturday, June 8, 2024 | 2 to 6 p.m.\n\nCanalport Riverwalk Park\n\n2900 S. Ashland Ave., Chicago, IL 60608\n\nThe Freshwater Lab at the University of Illinois Chicago invites you to reclaim your water and foster a sense of joy and possibility through music, performance and community connection. Meet us where the legendary Damen Grain Silos tower over the South Branch of the storied Chicago River.\n\nFree and open to the public. No tickets are necessary to attend. \nCelebrate the efforts and achievements of environmental justice advocates and artists. \n\nLearn about the history of the silos and their current state.\nEnjoy knowledge-sharing and performances on the main stage.\nImagine alternatives for the silos while considering the impact of demolition on residents. \n\nEngage with the river and each other through curated activities and art installations.\n\nConnect in meaningful ways with representatives from community-based organizations.\n\nThe Backward River Festival: Damen Silo City is the final event of a program supported by the University of Illinois Presidential Initiative for Arts and Humanities in which The Freshwater Lab hosted cultural events along the South Branch of the Chicago River: a two-day festival in October 2021 at Park 571; an activation event in September 2022 at Canalport Riverwalk Park to launch Rio de Bienvenida/River of Welcome; and another festival in June 2023 at Park 571 to unveil Rio de Bienvenida/River of Welcome. \n\nThe Backward River Festival: Damen Silo City is also supported by a generous donation from the Chicago Frontlines Funding Initiative.",
            "Join [The Chicago Undersea Explorers Society](http://divecues.org) at our annual fundraising gala, [Scuba Prom!](http://scubaprom.eventbrite.com), on June 22nd at Third Space in Lakeview. \n\nTickets are on sale though June 21, and include food, drinks (open bar with beer, wine and party punch) a DJ and dancing, a silent auction, games and prizes, a Prom Court and more — all proceeds support our scholarship program which helps us provide free and low-cost SCUBA training to divers in Chicago and NW Indiana. \n\nJune 22  \n7-11pm @ Third Space Lakeview  \n[scubaprom.eventbrite.com](http://scubaprom.eventbrite.com)\n\nProm attire encouraged. Snorkel not required.",
            "Good list of things to do all month: https://www.thesavvyglobetrotter.com/things-to-do-chicago-june/",
            "Your friendly improv redditor here with another shoutout to Malarkey House Teams which plays Wednesday nights at 7pm at the iO Theater! Tickets are $5 and you get to see THREE teams perform improv! Great for date nights and middle of the week pick-me-up!\n\nTickets here: https://ci.ovationtix.com/36725/production/1174977",
            "Thai food festival is this weekend!\n\n* June 8, Saturday: 10am - 9pm\n* June 9, Sunday: 11am - 7pm\n\nAt 851 W. Irving Park Rd, Chicago, IL (just ~~west~~ east of the Sheridan red line)\n\nEvent FB page: https://www.facebook.com/thaifestivalchicago\n\nEdit: it's east of Sheridan, not west",
            "If you like puzzles, cryptography, magic, or escape rooms, I highly recommend The Enigmatist at Chicago Shakes https://www.chicagoshakes.com/productions/the-enigmatist/ it's here through the end of the month. Definitely show up early to do the pre-show puzzles!",
            "Check out local musicians! There are plenty of shows at venues across the Chicagoland area. My band, Everyday Fantastic, is playing at the Cubby Bear on June 20th!",
            "We are working on bringing Indoor paintball to Chicago!\n\nWe are just gathering support in the form of signatures. Looking for 1000+ Already have over 770 signatures!\n\nFor more information check out our [Change.org](http://Change.org) petition in the link below:\n\n[Windy City Wasteland](https://change.org/chicagopaintball)"
        ]
    },
    "Weekly \"Meet me at Broadway and Sheridan\" Casual Conversation & Questions Thread": {
        "title": "Weekly \"Meet me at Broadway and Sheridan\" Casual Conversation & Questions Thread",
        "score": 19,
        "url": "https://www.reddit.com/r/chicago/comments/1dhq8uv/weekly_meet_me_at_broadway_and_sheridan_casual/",
        "content": "Welcome to /r/Chicago's Weekly Casual Conversation & Questions Thread.\n\nThis is the place for casual discussions that may not warrant their own post, or questions/topics not allowed as their own posts under our content policy. Please be mindful of rules 2 & 3 which still apply in this thread, as well as the Reddit Content Policy when posting.\n\nAlso, check out the /r/Chicago wiki for other Chicago-related subreddits, where to eat/drink, how to get around/navigate the CTA, where to visit, what neighborhoods to move to or hotel in, tips on living here, and more. And be sure to use the search feature to find responses to other users asking similar questions.\n\nThis thread is sorted by \"new\" so that the most recent comments appear first. The new weekly thread is posted every Monday morning at 12:00 AM.",
        "num_comments": 164,
        "comments": [
            "Stay cool this week, y'all.",
            "[Cooling centers. Check on your neighbors this week.](https://www.chicago.gov/city/en/depts/fss/provdrs/serv/svcs/dfss_cooling_centers.html)",
            "How many of you have Wednesday off?",
            "Any recommendations for bars to watch Euro/Copa America at?",
            "Bruh, what is up with real estate agents fronting as the landlord getting all upset when getting asked for more information about the location of the apartment they listed?\n\nReached out to an Evelyn Soto from Realty Professional Group for a unit that they didn't disclose the address to. Asked if they could share the address of the unit so I could figure out commuting logistics, and they replied back with a range of the location (located between the L Line and expressway). Asked again but mentioned if they could provide the intersections instead since I dont have a car and want to figure out commuting, and they just cussed me out in their response. Like wtf? If you don't want to answer questions, just list the address.\n\nWhoever lands that unit, good luck.",
            "Instead of speed cameras I'd rather there was a camera that caught people blocking the intersection when the light turns red.\n\nThey don't even have to get a ticket, just send me the address and I'll come hit their big toe with a mallet.\n\nI'll never understand the mindset, you're literally in bumper to bumper traffic. You're actually better off stopping at the light and let the traffic spread out a bit.\n\nDicks.",
            "30 minutes for a bus at rush hour in this heat is absurd. Sorry I don't have anyone else to vent to.",
            "Took CTA back from the Sox game yesterday. Got to the red line platform and there was a 12-minute wait for the next train. After getting on, I had to move train cars 3 times until I finally got one with nobody actively smoking. Got off at Jackson to transfer to the blue line and there was a 23-minute wait until the next train.\n\nThe CTA is such a shameful embarrassment to the city.",
            "After swearing for an hour, I finally got my window a/c unit in. Think I might just sleep on the floor in front of it tonight...",
            "I tagged along with my husband who is attending a work conference in Las Vegas. It's 102F. Frying pan: meet fire."
        ]
    },
    "I feel seen": {
        "title": "I feel seen",
        "score": 779,
        "url": "https://v.redd.it/frzrmky9008d1",
        "content": "",
        "num_comments": 36,
        "comments": [
            "Charlotte says you only get two great loves in your life, and mine are SATC and Sears tower.",
            "I have the same reaction every time I drive up the Dan Ryan",
            "I did not know how much I needed this edit!",
            "When I was younger and my family would drive into the city, my folks would always point at the Sears Tower and ask “what’s that??” And me, who was like 4 and only knew a few famous tall buildings, would excitedly say: “The Eiffel Tower!! :D”\n\nTook me a while to realize that no, there is not One Singular Famous Tall Building, lol",
            "Lmao excellent",
            "I’ve seen Sears Tower thousands of times in my life…and I smile every time. Never gets old.",
            "I moved from Chicago a year ago and I miss it so damn much. I took her for granted. I feel like this every time I come back (every 2 months, thankfully)",
            "I have rewatched this non stop for almost an hour",
            "me every day",
            "Daaa Sears"
        ]
    },
    "Memories of the 1995 heat wave": {
        "title": "Memories of the 1995 heat wave",
        "score": 39,
        "url": "https://www.reddit.com/r/chicago/comments/1dlulvu/memories_of_the_1995_heat_wave/",
        "content": "At the time I was living with my boyfriend in a small 1 bdrm corner apt. on the top floor. We were lucky to have a/c units in the living rm. and bedroom, but we had to hang sheets to cut off the kitchen and hallway in order to keep it under 80 degrees. My boyfriend was a laborer with streets and sanitation, he had some interesting stories to tell. \n\nPeople pulled mattresses out onto porches and balconies, and walking to work at 5:30 in the morning I'd pass them while they slept. \n\nTaking a stroll along a crowded Montrose beach at 10:30 PM under an almost full moon. There were families camped out, kids playing on the water's edge. \n\nAnd ambulances, I remember ambulances.\n",
        "num_comments": 15,
        "comments": [
            "I did the sheets trick, too. Only had A/C in the living room. Lucky for me the 20's courtway apartment already had a place to hang them, as it was the style to have valances between rooms until the 50's. I had to teach the cat how to move the sheet. She wasn't too pleased with the heat. I explained to her many times that her mommy gave her the fur coat, not me.",
            "Neighbors camping out on the parkways overnight, hydrants perpetually open, lots of ambulances.  Also the summer I finally bought a window unit a/c - had happily lived without for years prior.",
            "I nailed up blankets in the dining room to block air access from the rest of the house and put the bed where the dining room table was. Us and the wall AC unit. The amount of sweat. Third floor.",
            "I was 8 when the heat wave hit. It was obviously the first time I had ever experienced something like that. My mom was in the hospital giving birth to my sister and my dad had my other sister and me at home. We had no a/c whatsoever. However, my mom had 3 high velocity fans, we did the blankets on the doorways and camped out in the living room. All 3 fans blowing on us each night. It's funny, I've never asked him about it, and maybe I should, I wonder how worried he was that he wouldn't let us out of his sight. Every night we all slept on the floor in the living room, I wonder if he slept at all that week.",
            "We had just moved here two weeks before it started. Our apartment had no air conditioning. We saw the forecast for the pending heat wave and ran to Sears (remember that place?) and bought a window unit for our bedroom, one of the last units remaining. We left our dog in the bedroom during the day when we went to work, then camped in there once we got home. That was some devastating heat!",
            "That year we had to sell pop for the cub scouts at the fest in our burb.  People were dropping like flies. One passed out right next to our tent.",
            "My best friend moved from India to Chicago that summer.  Although the term hadn’t been invented yet, he was expecting a “hot girl summer”.  Instead he got a “gurl, this summer is too damn hot!”  \n\nIt’s unfortunately somewhat normal for people in India to die in extreme heat.  He wasn’t prepared for 400 people to die from heat exposure in a temperate climate.",
            "I cannot recommend enough the book Heat Wave: A Social Autopsy of Disaster in Chicago, by Eric Klienberg.  A horrifyingly fantastic dissection of how everyone fucked up.",
            "It was early in my career, and I worked in the loop and had to wear a jacket and tie. Ugh, pure torture walking to the red line--my shirt collar was soaked by the time I got to the office.\n\nI lived on the third floor with barely working AC wall unit in the living room. My bedroom was like an oven.",
            "Lived around the corner from Bloomer Chocolate Factory in a loft with not many windows and no AC. It was over 100 degrees at night. The cockroachs in the loft gained flight. Never experienced that before or since. Fucking smelling Chocolate the entire time. That is a plane in Dantes's hell right there. I was a bit happy when I heard that the Factory was closing from that experience 30 years ago. I am repulsed by the smell of chocolate to this day."
        ]
    },
    "Some pictures I took while visiting the city": {
        "title": "Some pictures I took while visiting the city",
        "score": 316,
        "url": "https://www.reddit.com/gallery/1dlbyy5",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Since be a kid I'll never get tired of looking at the sears tower so I applaud your multiple photos of it.",
            "Where was the first picture taken?",
            "Ah the Sears Tower, so simple in its design yet puts forth a bold statement. We see you queen 💅✨",
            "Great city to visit",
            "The bottom river part of trump tower is so ugly. It looks like an afterthought.",
            "Beautiful",
            "Nice, I like number 4 a lot.",
            "Hope you didn’t spend too long looking at the fugliest building in town.",
            "You're missing the middle finger in the trump tower Pic.",
            "Except for Orange Cheeto Tower, nice pics"
        ]
    }
}