{
    "r/ChikaPh Tea Thread": {
        "title": "r/ChikaPh Tea Thread",
        "score": 13,
        "url": "https://www.reddit.com/r/ChikaPH/comments/1dmxifb/rchikaph_tea_thread/",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "[MEGATHREAD] All About Alice Guo (Nationality, POGO Connections, etc.)": {
        "title": "[MEGATHREAD] All About Alice Guo (Nationality, POGO Connections, etc.)",
        "score": 316,
        "url": "https://www.reddit.com/r/ChikaPH/comments/1cxan3b/megathread_all_about_alice_guo_nationality_pogo/",
        "content": "Use this megathread for all manners of discussion regarding the Mayor of Bamban, Alice Guo.\n\nAny further separate posts about related to this topic will be taken down.\n\nThanks.",
        "num_comments": 126,
        "comments": [
            "My blood boils whenever I see people fawning over her on TikTok. The Philippines is absolutely cooked because so many people are uto-uto",
            "dapat lahat nang lugar na meron pogo yung mga mayor investigate lahat.",
            "Kaedad ko lang si ante mo Alice pero tandang tanda ko nung pumutok yung Mt. Pinatubo. \n\nKasi di ako nakakulong sa farm.",
            "i think it’s a bit absurd to be taking down individual alice guo posts. since an individual post can reach more audience as compared to just a single thread.  i get that it may be spamming the sub, however i think with this rampant issue going on, it’s very important to continue to spread awareness about her. one day naman this issue will start to quiet down eh so as much as it is in the present, it must be talked about, facts should spread as to remain vigilant and educate fellow citizens! this sub is a great platform to get word to spread around and i think it is a bit selfish if people are hindered to do so. i get that this is just a chika sub however it would be really great if this sub could also be used to its potential and actually contribute.",
            "Watched the whole hearing this morning. Walang sense mga sagot niya kapag pinapakwento yung formative years niya. I reckon shes not a chinese spy pero shes part of a sindicate. Tumakbo ng pagka mayor para makalusot itong mga illegal chekwa na mag business sa pinas. \n\nI think dapat din linisin ang mga agency ng gobyerno panong nabigyan ng legit birth certificate yan? Nakakuha tuloy ng passport and shit para makatakbo for public office.",
            "ok na may malaking issue kay Alice Guo pero ang pinagtataka ko, diba dapat kasama yung comelec sa pagiimbistiga dito?",
            "Feeling ko, TNT from China sina Guo",
            "sa wakas nagmemegathread na rin dito",
            "Anong oras po new episode ng teleserye sa Senado later",
            "Buti naman. Nagmukhang Groundhog Day sa pa julit-julit na posts e."
        ]
    },
    "Carla Abellana revealed that she and Tom Rodriguez are officially divorced.": {
        "title": "Carla Abellana revealed that she and Tom Rodriguez are officially divorced.",
        "score": 383,
        "url": "https://i.redd.it/ihs093zljh9d1.jpeg",
        "content": "",
        "num_comments": 117,
        "comments": [
            "Finally!!! Her interview with Boy Abunda grabe yung awa ko like kahit kupal si Tom in thier 7 yrs relationship hindi pa rin siya nag-dalawang isip na pakasalan, only to find out na mas may ikukupal pa pala.",
            "Sana lahat ng may asawa sa Pinas na naka-experience ng abuse, infidelity, or any justifiable reason to separate ay mabigyan din ng chance to file for divorce. Hay, if only available din ang option na iyon dito.",
            "Finally, makakapagladlad and pakasal na sila ni Clint. Char. 😂😂😂😂😂",
            "And yes, sana for all din ang divorce.",
            "Congratulations Carla, wishing you all the best. May you continue to heal (wow close). But seriously, i hope she will.",
            "Hmmm. Congrats na divorce na sila.",
            "Sad. Wonder what went wrong",
            "Kaya pala medyo nag paparamdam na ulit si Tom hahahaha. Ang mga Pinoy madali makalimot kaya Ang Koreanong gipit, sa Pilipinas kumakapit eh.",
            "pano sila nag divorce sa pinas?",
            "Anong ba talaga nangyari? Inubos ang kita? Nababae? Nanlalaki?"
        ]
    },
    "Kathryn Bernardo for Lancome": {
        "title": "Kathryn Bernardo for Lancome",
        "score": 141,
        "url": "https://i.redd.it/inyjbfomth9d1.jpeg",
        "content": "Lancome finally posted KB on their official account! 👀\n\nLink: https://www.instagram.com/p/C8zBFOwAmVc/?igsh=MWp6MWJkdW5oaHowYQ==",
        "num_comments": 19,
        "comments": [
            "Ang daming nag line up na blessings and endorsements kay Kath the past year. Sobrang deserve niya. ♥️",
            "Ang sosyal ng dating nya nung naghiwalay sila ni Tumbong",
            "Infairness ah. Casual fan lang ako pero kita ko yung improvement sa branding nya. Nawala na Yung pacute image na kadikit ng love team. Pero I hope na more on matching her on different leads, wag na ma trap sa new love team para ma reach nya potential nya at her peak.",
            "Her face card never declines talaga 💅",
            "New ba ito? Parang I recall writing a comment some months ago about lancome and Kathryn. BTW she looks glowing talaga dito.",
            "Iba talaga ang bloom kapag nagkaron ng freedom",
            "Amoy expensive, ganda niya noong naging single siya ❤️",
            "Kala ko si gabbi garcia",
            "Hahahahah same 😭 lagi din ako nabibiktima ng swipe na to sa Tiktok lol",
            "Yun pa din, same pics. Pero now naka-collab post na sya sa official IG account(6.5m followers) ng lancome."
        ]
    },
    "Maris Racal and Anthony Jennings as newest endorsers of Mang Inasal": {
        "title": "Maris Racal and Anthony Jennings as newest endorsers of Mang Inasal",
        "score": 383,
        "url": "https://i.redd.it/zd0bkhj26g9d1.jpeg",
        "content": "Dumadami na endorsements nila. Now I am just waiting for their project as a team 💚",
        "num_comments": 53,
        "comments": [
            "Mapapalitan na ang commercial ni tanggol😅",
            "They look so cute together!! ❤️❤️",
            "Hoy ganda ni Maris dito, blooming ❤️",
            "bongga naman. dami endorsement. kakakita ko lang nung sa lay's nila. 🥰",
            "Ang charming ni Jennings shet",
            "Ang tagal na natapos ng Can't Buy Me Love pero tuloy-tuloy pa rin ang pasok ng endorsement. Snoop and Irene are just way too iconic. ",
            "FINALLY BAGO NA HUHU CONGRATS!",
            "Yay hindi na sya Mang Inatal",
            "Nakaka-miss ang kulitan tandem of Snoop and Irene 🫶🏻",
            "Eto yung tandem na parehas magaling umarte. Di kagaya nung iba jan! Yoko nalang mag talk! Dasurb nila lahat ng dumadating na projects!"
        ]
    }
}