{
    "r/ChikaPh Tea Thread": {
        "title": "r/ChikaPh Tea Thread",
        "score": 12,
        "url": "https://www.reddit.com/r/ChikaPH/comments/1dc5jgi/rchikaph_tea_thread/",
        "content": "",
        "num_comments": 1,
        "comments": [
            "gusto ko ng tsaa, matTsaa (matcha)"
        ]
    },
    "[MEGATHREAD] All About Alice Guo (Nationality, POGO Connections, etc.)": {
        "title": "[MEGATHREAD] All About Alice Guo (Nationality, POGO Connections, etc.)",
        "score": 298,
        "url": "https://www.reddit.com/r/ChikaPH/comments/1cxan3b/megathread_all_about_alice_guo_nationality_pogo/",
        "content": "Use this megathread for all manners of discussion regarding the Mayor of Bamban, Alice Guo.\n\nAny further separate posts about related to this topic will be taken down.\n\nThanks.",
        "num_comments": 122,
        "comments": [
            "We should help Sen Risa. \n\nCrowdsource ng iba pang info that can help\n\nMas fluent pa sa Hokien kesa kapampangan?\nAccent clearly shows na hindi sya lumaki sa Pinas\n\nChinese features makes you think that her mother is not Filipino \n\nBuhay pa ba ang parents nya? How about college? Jobs before becoming a millionaire?\n\n\n\nTanong sa PSA, wala bang controls and validation ang records nila? Kelan pumasok sa records ang birth cert nya?\n\nAnonymous naman tayo dito, lets share if we have info",
            "Sa mga inconsistencies na sagot, sa mga illogical na memories, sa mga questionable documents nya.\n\nIsa lang masasabi ko.\n\nGinagago tayo ni alice guo.",
            "My blood boils whenever I see people fawning over her on TikTok. The Philippines is absolutely cooked because so many people are uto-uto",
            "GUO MEANS \"WALL THAT SURROUNDS THE CITY\"\n\nAS IN GREAT WALL OF CHINA\n\nTAPOS GUO SOUNDS LIKE THE WORD \"GO\" IN POGO\n\n# BAKA ALICE GUO IS A GREAT WALL OF POGO?",
            "dapat lahat nang lugar na meron pogo yung mga mayor investigate lahat.",
            "Kaedad ko lang si ante mo Alice pero tandang tanda ko nung pumutok yung Mt. Pinatubo. \n\nKasi di ako nakakulong sa farm.",
            "i think it’s a bit absurd to be taking down individual alice guo posts. since an individual post can reach more audience as compared to just a single thread.  i get that it may be spamming the sub, however i think with this rampant issue going on, it’s very important to continue to spread awareness about her. one day naman this issue will start to quiet down eh so as much as it is in the present, it must be talked about, facts should spread as to remain vigilant and educate fellow citizens! this sub is a great platform to get word to spread around and i think it is a bit selfish if people are hindered to do so. i get that this is just a chika sub however it would be really great if this sub could also be used to its potential and actually contribute.",
            "Watched the whole hearing this morning. Walang sense mga sagot niya kapag pinapakwento yung formative years niya. I reckon shes not a chinese spy pero shes part of a sindicate. Tumakbo ng pagka mayor para makalusot itong mga illegal chekwa na mag business sa pinas. \n\nI think dapat din linisin ang mga agency ng gobyerno panong nabigyan ng legit birth certificate yan? Nakakuha tuloy ng passport and shit para makatakbo for public office.",
            "did y'all see this photo circulating on tiktok? apparently, the red scarf is a Chinese National Symbol. Young pioneers in China wears a red scarf as a symbol of honor and tradition. It also symbolizes their commitment to the revolutionary spirit of the nation.\n\nhttps://preview.redd.it/08nnn1oxgy3d1.png?width=805&format=png&auto=webp&s=c2ea6687ee24beec7195742a83b7fe08b0b964ea",
            "https://preview.redd.it/lhgfyhuhmw1d1.jpeg?width=870&format=pjpg&auto=webp&s=2d79612fdb38d18745d4d520f2c376bca349b46d\n\nanother receipts from sen risa ✨\n\nABS-CBN NEWS: LOOK: Senator Risa Hontiveros presented travel records from the Bureau of Immigration showing that Bamban, Tarlac Mayor Alice Guo traveled several times with her alleged sister Sheila L. Guo.\n\nMayor Guo mentioned in the first Senate hearing that she is uncertain about her family ties with Sheila L. Guo and Seimen L. Guo but later admitted, during the May 22 session, that her father confirmed that they are her siblings.\n\n(Courtesy: Senate of the Philippines/YouTube)"
        ]
    },
    "Denise Laurel": {
        "title": "Denise Laurel",
        "score": 1023,
        "url": "https://i.redd.it/frvhs0kfg18d1.jpeg",
        "content": "First time watching Denise Laurel's vlog and ang dami nagssend ng gifts sa kanya the sabi niya \"Stop sending gifts guys, keep your money\"\nBilib talaga ako sa babaeng to huhu napaka-purr na tapos pati dito halos nababasa na napaka-genuine nga niya. I stan this 👸!!!",
        "num_comments": 149,
        "comments": [
            "ito talaga since PHR super girl crush ko to",
            "Eto talaga yung natural na plump lips",
            "Ang laki na ng baby niya!!! Sobrang tangkad.",
            "Sobrang ganda nito in person at ang bait! Nakita ko to sa Ortigas di ko maalala kung sino sya so napatitig ako kasi sobrang ganda nya. Nung narealize kong si Denise yumuko ako, tapos pagtingin ko ulit nginitian nya ko. Huhu. Goddess.",
            "That girl definitley has class. Never heard any negative write up about her",
            "Her face and her talent. Laurel e.",
            "Ang issue sa kanya gamit na gamit siya sa adobo.",
            "I know someone who knows her and the Laurels, mabait daw talaga si Denise, like siya yung pinakaclose niya. And again, musical talent runs in the family. Talented marami sa kanila.",
            "Sa Pangako sayo palang nila Echo at Tin nagustuhan ko na sya. Sya yung ank dun ni Ina Raymundo na spoiled brat.",
            "Why are they sending gifts to a rich kid? What are they hoping to get from that?"
        ]
    },
    "So ayun na nga, Certified Flop,mga Mars! Meron bang na-shock? ": {
        "title": "So ayun na nga, Certified Flop,mga Mars! Meron bang na-shock? ",
        "score": 175,
        "url": "https://i.redd.it/pigv9mhes28d1.jpeg",
        "content": "",
        "num_comments": 115,
        "comments": [
            "Mahal na rin kasi ang sine ngayon so kung manunuod Ka, doon na lang sa quality.",
            "Water is wet.\nThe sky is blue.\nThe sun rises in the east.",
            "Aantay ako kung tatahol yan, mukang always blame gusto nya gawin eh.",
            "Meron pa syang isang movie na parang copy cat nung horror movie sa hollywood na The other side of the door.",
            "I feel sorry sa other actors na nadamay kay Xian Lim. On the other hand, mukhang pangit talaga yung pelikula...",
            "Monoblockbuster ka talaga, Xian!",
            "Nakita ko trailer niya dati, parang pang-tv na movie yung dating. 😬\n\nIt didn't help pa na may nakakabit na issue kay Xian. Regardless of what happened sa kanila ni Kim, parang safe to say na turned off sa kanya yung marami so....",
            "kung ako sa mga producer, kung maraming issue yung artista na gagamitin nyo at walang solidong fanbase, makipag partner na lang kayo sa mga streaming platform kase magfa-flop talaga yan sa sinehan.",
            "Karma ni Xian Lim yan buti nga...",
            "Dinamay pa si Coleen lol"
        ]
    },
    "Janella Salvador sa Pride March 🫶🏻": {
        "title": "Janella Salvador sa Pride March 🫶🏻",
        "score": 87,
        "url": "https://www.reddit.com/gallery/1dls6qo",
        "content": "The woman that you are, Janella 🫶🏻 Honestly, I wish there comes a time na actors/actresses can freely express themselves without the worry of losing projects dito sa Pinas. That’s the only thing na I like sa industry ng US, even an openly gay/lesbian actors/actresses don are treated equally, they are still portraying straight characters. \n\n\n\n\n",
        "num_comments": 14,
        "comments": [
            "its good pero ano ba ang nangyayari sa career ng mga nag-oout na artista sa Pilipinas?",
            "Curious lang. Ano yung 2nd pic? Teleserye? Movie? Ad?",
            "🏳️‍🌈🏳️‍🌈🏳️‍🌈",
            "I pray that she succeeds. She has so much potential.",
            "So proud of her and Jane tbh. sobrang laki ng risk na ginawa nila sa MV ni Janella. They were explicitly portraying sapphic love in a country that still views lgbtq+ romance as either a phase or a sin.\n\nI hope this will open doors for gl and bl shows. Magaling pa naman ang mga pinoy writers when it comes to the romance genre ( and I hope there will be no fetishisation that will happen)",
            "Context? Nag-out ba sya?",
            "May chismis din dati na bi/les siya pero di aprub si Madam Jenine hahahaha",
            "na stuck sila sa gay/lesbian roles. Even mga nagmomodel sa industry, pinapa shut up sila regarding sa sexual orientation para makakuha ng more projects",
            "Depende kung maganda or gwapo.\n\nSa totoo lang gusto lang ng tao ang mga gay/bi/lesbian/trans kapag maganda. Example:\n\n- Michelle Dy\n- Klea Pineda\n- Kevin Balot\n\nBinabash at nilalait ng tao kahit talented:\n\n- Jake Zyrus\n- Vice Ganda",
            "music video ni janella"
        ]
    }
}