{
    "CF Lounge: Weekly post": {
        "title": "CF Lounge: Weekly post",
        "score": 10,
        "url": "https://www.reddit.com/r/childfree/comments/1dn00rk/cf_lounge_weekly_post/",
        "content": "Welcome to CF Lounge, our weekly off-topic discussion thread.\n\nFeel free to talk about what's going on with you this week, what you did, your hobbies, pets, cars, travels, whatever you like. Discover new members, make friends and connections all over the sub. Share great news, get an ear and shoulder to cry on for not-so-great news.\n\nThis is also the place to post rants that aren't childfree related and/or aren't long enough for their own post.\n\nThis post will be up all week for your enjoyment. Have fun!",
        "num_comments": 17,
        "comments": [
            "I'm waiting to hear back from a few jobs. This is why I'm happy I dont have kids. No one really depends on me and as long as I have SOMETHING, my spouse and I can swing it. We are trying to work from home completely. Not so se can travel, but to just chill and drive less. We want a bigger place so we can have separate offices and rooms to do out activities in. It will take time, but we can get there without kids. \n\nI love working from home, I know some parents hate it, but my home is clean and quiet and I love it.",
            "Today is the 6-year anniversary of my bisalp!",
            "Is anyone else concerned about the bipartisan bill floating through congress autoenrolling men in the selective service and adding women as eligible for the draft? ",
            "Just need to vent: my sibling & in-law are having another kid when the first one is almost old enough for me to tolerate interacting with it directly. Also frustrating that they're so far apart in age, like why bother?? They waited since the first \"was a difficult baby.\" Uh ok, it was healthy and did everything you'd expect a baby to do and that makes it \"difficult\"?? Maybe I'll move even farther away...",
            "Happy Friday evening! Had a pretty anxiety filled day at work, but am enjoying my time on the couch and destressing with some delta 9. Watching my bird play until her bedtime, then I’m going to mess with my new pc. I plan on being social tomorrow",
            "I've been subbed here for a few years but I find that this place is overly negative so I will be unsubbing. Not this post that I have a problem with, obviously, but many here are kind of the same complaining over and over, and I find fewer people have empathy for others. Good luck to you all, sincerely",
            "Update us on the new job ",
            "I love the chill of wfh and how much cleaner everything is. It really does add hours and calmness to your day. Happy for you!",
            "As a non-American outsider looking in, a lot of what's going on in your country is concerning.",
            "I’m not, solely for the fact that many reputable sources say the draft will not be reinstated due to the vast majority of Americans unfit for service."
        ]
    },
    "CF4CF: Monthly post for May 2024": {
        "title": "CF4CF: Monthly post for May 2024",
        "score": 25,
        "url": "https://www.reddit.com/r/childfree/comments/1chcthr/cf4cf_monthly_post_for_may_2024/",
        "content": "Hello [r/childfree](https://www.reddit.com/r/childfree)!\n\nThis post is specifically for CF people looking to meet up with other CF people (for friendship, dating, pen pals, etc.) in their area or online.\n\nIn your top level comment please include the following information: age (18+ only please), gender, general location (city, province/region, country, etc.), what you are looking for, and a little bit about yourself.\n\nPlease follow the rules of Reddit. \\*\\*No personal information.\\*\\* You are welcome to share that over PM.\n\nAlso, please consider cross-posting to our friends over at [/r/cf4cf](https://www.reddit.com/r/cf4cf) and [r/ChildfreeFriendships](https://www.reddit.com/r/ChildfreeFriendships) and hang out with some fellow CFers on \\[Discord\\]([https://discord.gg/Tdr3hhy](https://discord.gg/Tdr3hhy)).",
        "num_comments": 19,
        "comments": [
            "34 male. Jefferson City MO. I moved here to help take care of my 94 year old grandma. My dad and aunt are here but both are too obese to do the dirty stuff. I’m an accountant who likes to sit on his ass and watch tv, but I want to get outside more; I just need someone to motivate me. Obviously, I don’t want kids. I like kids but I don’t want to come home to them. I’m looking for a woman who can take me outside but also chill depending on the night. I doubt there’s anyone on here in my area anyway.",
            "39/F live in ut too. Southern.",
            "Hi, nice to meet you. I’m in the SLC area.",
            "Cool, I’m in the SLC area",
            "Hello! Where are your favorite places to travel to and who are some of your favorite bands/artists that you like to see in concert?!",
            "I love to travel to Europe especially the UK and Ireland.\nFor concerts I love the State Room and the Commonwealth Room. I recently saw Joshua Radin, Matt Nathanson, and Foy Vance at those places; they are some of my favorites.\nWhat do you like to do for fun?",
            "Ooooh. I like to travel but I've always kept it in the states; but got my passport late last year so I can get more adventurous! I love concerts! I saw Madi Diaz at the State room in march and had such a good time, it was my first show at that venue! My favorite band is Manchester Orchestra who I've been traveling to see in different states these past few years. Aside from that band I lean way more into the singer/songwriters like Ruston Kelly, Kevin Devine, Brian Fallon and his band the Gaslight Anthem!",
            "26/M/Australia\n\nI'm looking to make more online friends. I love learning new things and cuddly animals. In my free time I like to go running, watching documentaries, browsing cat subs. I don't use social media much but I love to have longer conversations and connect to others on a deeper level.\n\nIf you reach out to me, tell me about your favorite show and what you like about it :)",
            "33/M/Ohio\n\nHi all! Looking for a CF woman between the ages of 28-40. Preferably in Ohio but I'm open to longer distance (I can work remotely and don't mind plane rides). Yes, I'm snipped. \n\nMy hobbies include: cooking, occasional photography, seeing live stand-up comedy, pool, amateur mixology, and lifting to offset my love of dumplings. I look forward to hearing from you!",
            "43/F/Utah\n\nI'm looking to make more online (and in person) friends.\n\nI like traveling; going to concerts, plays, dance performances, museums, art galleries (anything creative; painting, drawing, writing, and cooking,"
        ]
    },
    "Entitled Parent on plane": {
        "title": "Entitled Parent on plane",
        "score": 1012,
        "url": "https://www.reddit.com/r/childfree/comments/1dr1is5/entitled_parent_on_plane/",
        "content": "I was coming back home from vacation and was already travelling back for 12 hours. I always pay extra for the window seat on flights because I like looking out the window and resting my head on it. A couple sat beside me and everything went well until this went down.\n\nThe man asked the flight attendant “is it possible to switch my son out with this woman, he is a young boy”\n\nShe replied “well have you asked her?”\n\nHe said “No…DO I HAVE TO?”\n\nI was so confused if he was even referring to me because I was like there’s no way someone had this audacity. \n\nSo he asked me and I think he expected me to switch. Mind you I’ve been travelling for 12 hours on this point and I paid extra. Usually I’m a pushover but I was not in a good mood this morning (flight was for 6am) so I said no.\n\nHe seemed so taken aback and was saying “you should give a little more grace to parents” 🙄\n\nI asked him why he didn’t pay extra like I did to make sure his family sat together and he said how I was young I wouldn’t possibly understand 😐\n\nThank goodness for noise cancelling earphones cuz I just closed my eyes and slept for the flight. I had 0 energy to go back and forth",
        "num_comments": 63,
        "comments": [
            "“Do I have to?” I’m done 😂😂😂😂😂",
            "\"You're young and wouldn't understand.\" \n\nIs that parent speak for \"I didn't think about that when booking the flight and am too embarrassed to admit it\"?",
            "\"Well if it's that important to you, I'll give you a deal, you can have the seat for only $20,000 cash. Seems like a bargain to me.\"",
            "They always seem to zero in on women traveling alone, too.",
            "“Why would I want to switch places with your son? Would I call you Dad?”",
            "So they didn't want to pay extra for the window seat and figured they could get it anyway?\n\nJeez.",
            "I would have said \"I agree. I am giving grace to my parents by paying extra for this window seat to sleep, so that I can be well rested and not cranky when I meet them at home.\"",
            "i would’ve laughed in his face. (don’t listen to me, i’m mean lmfao)",
            "\"No\" is a complete sentence.\n\nMr. Breederson can just fuck off.  Good for you for sticking to your guns.",
            "The guilt thing doesn't always work. You paid extra. It's not like you have animosity towards some little kid who's being weaponized so no-one has to plan."
        ]
    },
    "Friend and I had always disliked kids. Her opinion changed dramatically after having one and thinks mine will too.": {
        "title": "Friend and I had always disliked kids. Her opinion changed dramatically after having one and thinks mine will too.",
        "score": 172,
        "url": "https://www.reddit.com/r/childfree/comments/1dr8abl/friend_and_i_had_always_disliked_kids_her_opinion/",
        "content": "My friend and I where always very firm in wanting to be child-free. From childhood to now in our late 20's. We always disliked kids and joked about how gross blowout diapers and sticky kids having tantrums at stores where, especially when we saw someone we knew from school posting stuff like that, and always said we'd never have a \"crotch goblin.\" We didn't find babies or children cute, we where always very strong in out distaste for them, and I still feel this way.\n\nWell, fast forward to a 2020, when my friend found out she was pregnant. Initially, she was opposed to having a child, but after a few days, decided she wanted to go through with it. Of course, I'm going to support whatever choice she made as long as it was something she's happy about, but as time went on, her attitude towards children and babies changed dramatically.\n\nThe first time I noticed was when she showed me an ultrasound picture and said something like \"look how adorable he is!\" Before, we used to talk about how we just didn't get why ultrasound pics where cute when you could barely see anything. Soon, she was showing me baby clothes/outfits and photos of herself and her husband as babies, as she was excited to see if the baby looked like that.\n\nNow, to be clear, I'm very happy for my friend and I'm glad she has a happy family. What irritates me is her thinking my opinions on kids changed as well. \n\nOnce the baby was born, she started going on about how she was excited about me having a baby someday and them being friends with her son and now jokes about the \"cute\" blowout diapers and potty training on her socials. When this was something we both found gross before.\n\nThe baby is now a toddler who is difficult to be around when we try to meet up (ie constantly demanding to be held or needing to be walked around because they can't sit still; she thinks it's cute and funny. I find it draining)\n\nHas anyone else experienced this big of a shift with someone they know? I still have no interest in having children, but because her views have changed, she thinks mine magically did too. Again, I'm happy her, and l'm not looking for any kind of advice. Its just crazy how much she's changed. Not sure if it maternal instinct or what.",
        "num_comments": 31,
        "comments": [
            "Yeah my sister dramatically changed her mind around 30. Never understood what happened but I was gone in the army for 7 years so I’m sure a lot happened during that gap. Only was home 15-20 days a year \n\nI’m positive she holds out hope that my wife and I will change our minds but I will never reverse this vasectomy",
            "No. My best friend was ready for me to cut ties as soon as she had her baby. she knew before she got pregnant how I felt about kids and she was ok with my decision to not be around kids. \nI ended up not cutting ties but I love that even in her hormonal state she still didn’t make me feel bad for how I felt about kids",
            "I had a friend in my 20s and we both used to talk about how gross and damaging  pregnancy and childbirth are, how we would never do it. \n\nShe got pregnant in 2018. Before the friendship was over I asked her, \"hey you used to say you were never having kids because of the physical ramifications, what happened?\" Her response was \"oh I said that because I didn't think I'd ever find someone worth having kids with.\" 🤦‍♀️ personally, I never liked her boyfriend, he was never nice to anyone but her. The friendship died when she asked to bring her kid to my child-free wedding.",
            "At this point I would just get a new pet and talk about nothing but said pet.",
            "This world is horrible. The only thing that could ever possibly change my mind about bringing a child into this nightmarish hellscape of a life would be severe brain damage.",
            "I would have already pissed her off because I am not hearing about this baby shit",
            "In a current similar situation my close is friend is like 4 weeks pregnant. She FaceTimed to show me the ultrasound expecting me to jump up and down. It looked like squiggles. she’s already sending me “aunty” and “me with my best friends kids” reels. No. I’ve already started to back off.",
            "I think it makes sense if it’s your own baby and maybe the feeling of cute is just love. I haven’t experienced this but I saw someone on Instagram comment that she thought she didn’t want kids until she had one and how she has no regrets and can’t imagine life without them😅 it’s a big gamble for others to take in hopes of it all working out, I think loving your own baby can be different from liking babies in general tho and she probably grew to attachment to something that’s HERS only or something. I mean there’s a moms who want babies and loved babies since forever that struggle immensely having it. Expecting everything to be perfect after having a baby is simple unrealistic and it isn’t the same for everyone. Have you reminded her that you still don’t like babies and kids?",
            "Is there a chance she only said those things before to be close to you?",
            "Having children rewires your brain.  So while the saying is mostly true, if you are of strong will and sound mind you won’t let people misled you into an 18year sentence"
        ]
    },
    "Do you think it’s selfish to bring babies on planes ? ": {
        "title": "Do you think it’s selfish to bring babies on planes ? ",
        "score": 355,
        "url": "https://www.reddit.com/r/childfree/comments/1dr3a7q/do_you_think_its_selfish_to_bring_babies_on_planes/",
        "content": "I saw a tiktok of a woman who brought her baby on a three hour flight and he cried the WHOLE TIME. I did feel bad because mom was also crying towards the end (but only holding baby w one hand so she could record the tiktok lol) most of the comments were supporting her saying how hard it must be- but in my opinion is this not kinda selfish ? I feel like you should leave the baby with a family member unless it’s an absolute emergency. Children that young cannot comprehend the ear popping, and it is also extremely painful for them. They can’t understand what’s going on and only know they’re in pain. This feels immoral to the baby and the people on the plane. I personally am autistic and would have been in tears if a baby was wailing my entire flight. But I’m just wondering- what are your thoughts ? ",
        "num_comments": 165,
        "comments": [
            "I do think it's selfish, especially if you are filming it and then uploading it to the internet to garner sympathy for a choice you made. Unless it's super extenuating circumstances, it's torture for the kid and for the other couple hundred or so passengers.",
            "I saw that TikTok earlier today. I would have been so upset if I was seated next to her. But the fact that she was trying to validate her choices of taking a baby on a plane irked me even more. If it was an emergency I doubt she would have been filming! But then again, I’m sure she can’t think logically after having a baby in general. Still it was weird.",
            "Yes. Parents have no choice but to listen to their children’s cries but it is incredibly selfish and stupid to force everyone else to suffer with you.",
            "You've caught me at a bad time, I've literally just walked in from a flight that was supposed to have me home 5 hours ago but thanks to delays have only just walked through the door. I'm not kidding when I say at 2am there were a couple of women with collectively 6 kids under 7 between them, all the kids running, screaming at the top of their lungs, playing tag and darting in and out of the seats. The mums did nothing, sweet fuck all, one went flying and head butt the concrete, a little girl just absolutely screamed ear piercingly loud, it was that bad other passengers started trying to tell the kids off and yelled at the parents to control their kids. Nothing changed, they let this happen for HOURS!! I was beside myself, there is no way on god's earth they thought they were good parents, like I can't fathom it. \n\nI don't care about well behaved kids 5 and up, I can even understand the crying because fuck I wanted to cry with the delay. But in my opinion if you are raising brats and you know it, don't make it everyone else's problem, and if you have kids under 4 surely it's selfish because there's no way they can even remember where you're taking them anyway, so you've burdened everyone else just to have to talk to the kid about the memory later as if they weren't there anyway \"when you were three we did ___\" like why!! If you've got small kids, make people visit you unless you absolutely can't. They can't comprehend what's going on and it's a long time to sit still for hours at that age, most adults struggle with it let alone someone who hasn't got the brain development to identify colours yet.",
            "She just wants to get attentions from TikTok with her baby. To me anyone who wants to use their kids to get views on TikTok is sick and selfish",
            "Yes, it’s absolutely selfish. There’s no reason to go on a vacation with a young baby. Only exception for me would be if there was family emergency. I just always get the vibe that the vacation parents are the type to think their life will just be the same after having a baby.",
            "probs will be an unpopular opinion but if its a stranger, i can't assume why they have a child on the plane\n\nyes im absolutely annoyed to be seated near babies/toddlers/infants but i try to assume the best, that the family has an actual need to travel that way",
            "I think it’s a horrible experience for the kid, more so when travelling through time zones. I also understand that there are emergencies, and sometimes you have to do it.\n\nBut what would terrify me if i was a parent, is all the unvaccinated people that could be around and potentially give my kid a horrible, deadly disease. Especially if the kid is too young to be immunized. Those planes and some passengers are NASTY, and i wouldn’t want a child with a developing immune system to be anywhere near that. One person with whooping cough is all that takes.",
            "Yup, the only reason for really young kids to be on planes is for family or health emergencies. Otherwise, keep them home or drive.",
            "I would suggest it's selfish to bring them onto planet earth. Seems we've run this little experiment to completion."
        ]
    }
}