{
    "Discusión random semanal": {
        "title": "Discusión random semanal",
        "score": 2,
        "url": "https://www.reddit.com/r/chile/comments/1dn90dv/discusión_random_semanal/",
        "content": "**Usen este hilo para discutir todo tipo de temas y hacer consultas, ya sea que no merezcan un post propio o que sean offtopic.**\n\n**¿Qué debería ir en este hilo?** Por ejemplo, pero no limitado a:\n\n* Temas que ocurren en otros países o a nivel global. **Puede o no ser contenido directamente relacionado con el sub y Chile.**\n* Pedir opinión sobre temas no relacionados al sub.\n* Hacer consultas simples, tecnológicas, y otras que no generen gran discusión.\n\n**Pe-pero, si hago el comentario aquí nadie lo va a ver :(** ¡Al contrario! Es más posible que lo que quieras decir sea más visible aquí que en un post nuevo.\n\n*Este hilo se renueva cada día lunes a las 5:00am, hora de Chile continental.*",
        "num_comments": 2784,
        "comments": [
            "Nunca jams en la vida pnganse la camiseta por la pega. Solo los idiotas hacen eso.",
            "ayer traje unas jaleas verdes sabor manzana. cual sera mi sorpresa hoy al descubrir que saben a manzana roja. mi desilusin es inconmensurable, y mi da est arruinado.",
            "Voy a Lima, as que me met al sub de Per para ver la onda. \n\nPgina principal: \"Alquiler de enanos para fiesta\"",
            "La gente de derecha diciendo que los comunistas se roban todo chile. Mientras tanto  aparece un poltico de izquierda corrupto y salen como 7 de derecha con delitos peores rofl",
            "Estn pajeando a Messi ",
            "Lamento informarles que las dinotardes seguirn suspendidas",
            "Mi abuelo que no ve ftbol desde 1962: cuidado con chile.",
            "Increible que Bravo siendo el mas viejo sea el unico 100% vigente de la generacion dorada csm\n\nGracias Capi nos salvaste de una goleada",
            "Isapres le deben a usuarios: pagamos en 10 aos y los mismos usuarios se pagaran la deuda con aumento en los planes. Mi deuda es tu deuda. Amor y paz\n\nUsuarios le deben a compaa electrica: qu paguen altiro estos wnes comunistas, lo quieren todo gratis. Papito as es el libre mercado, solo nos preocupa que no aumente tanto la inflacin",
            "Un argentino burlndose por lo geogrficamente delgado de Chile, pensando que nos ofende, es como si alguien pensara que ofendera a un argentino si trata a Charly Garca o a Maradona de drogadictos."
        ]
    },
    "Discriminación por sexo": {
        "title": "Discriminación por sexo",
        "score": 311,
        "url": "https://i.redd.it/mjkpcr7aue9d1.jpeg",
        "content": "Es legal poner en una oferta de trabajo poner como requisito ser mujer? \n \nMe encontré esto hoy en Codelco\n\nhttps://empleos.codelco.cl/job/El-Cajon-Ingeniera-Planificación-Mantenimiento-2da_-1390000/1177912800/",
        "num_comments": 135,
        "comments": [
            "Dira que si, el rubro de la minera tiene que cumplir con un mnimo de % de empleados mujeres.",
            "Reclutador ac,\n\nNo es legal, aunque sea para justamente meter ms mujeres y cumplir con estandares mnimos de contratacin de mujeres, NO se puede dejar en la publicacin tener un determinado gnero como requisito.",
            "Muchas mineras est metiendo mujeres en variedad de cargos para cumplir con el tema de la equidad y mostrarles al mundo lo bakanes y equitativos que son. En la prctica, reportado por mucha gente, se estn llenando de gente que no cacha nada, con poca experiencia y que se saben intocables. Pero anda a comentar esto, que lo nico que vas a recibir son funas.",
            "Es legal mientras sea \"ser mujer\"... Toda la vida ha existido en todo caso... Hace 15 aos recuerdo que estaba viendo unos anuncios de visitadores mdicos, y lo que ms se repeta era \"ser mujer\"... Lo ilegal es que pongan \"ser hombre\".",
            "Entiendo lo mismo. Amigos ingenieros lo han planteado.\n\nPasa hasta en las postulaciones a doctorados. Si eres mujer, quedas.",
            "Es insano lo que ahce la minera. Tambin energa se puso tonta, ahora en ACESOL entraron en directorio tres mujeres -y una de ellas es nefasta, trabaj conmigo en un centro de investigacin. Creo que perdimos el horizonte.\n\nSoy mujer y me dara vergenza decir que obtuve el puesto por el requisito excluyente de ser mujer.",
            "Bienvenido al mundo de las cuotas, obligatoriamente por ley, tienes que tener x porcentaje de trabajadores especiales.\n\nEsto va desde tener un porcentaje de trabajadores con discapacidades, un porcentaje mnimo de chilenos, hasta de mujeres.",
            "A cambiarse legalmente el sexo se dijo",
            "Me pas con una postulacin a Colbn, literalmente tenia el perfil y las competencia necesarias, pero mi postulacin se fue directo a la basura por ser hombre :(",
            "Es lo que dices, pero ellos le ponen nombres ms \"amigables\""
        ]
    },
    "Recomiendan comer más chorito: En Chile solo consumimos un 5% de lo que producimos": {
        "title": "Recomiendan comer más chorito: En Chile solo consumimos un 5% de lo que producimos",
        "score": 92,
        "url": "https://www.cooperativa.cl/noticias/pais/salud/alimentos/recomiendan-comer-mas-chorito-en-chile-solo-consumimos-un-5-de-lo-que/2024-06-28/135132.html",
        "content": "",
        "num_comments": 47,
        "comments": [
            "Si los weones los vendieran baratos...",
            "Yo me ofrezco pa comer todo el choro que pueda, y si hace falta tambin picoroco.",
            "los que no comen choros juegan padel",
            "Yo recomiendo que les bajen el precio entonces para que podamos :v",
            "Ni ahi con los huesoh yo quiero choroh gruesoh GAMBAZO ",
            "Bajen los precios hijos del picoroco",
            "En Chile venden las weas mas caras q la csm",
            "Hace rato que no como choro casi un ao ya, y si hablamos del que viene del mar jams lo he comido.",
            "Ah claro, verdad que es tan \"accesible\" y \"baratos\" los Productos marinos en chile",
            "Pero no cualquiera, su buen choro zapato, grande y peludo"
        ]
    },
    "Problemas en la pega": {
        "title": "Problemas en la pega",
        "score": 60,
        "url": "https://www.reddit.com/r/chile/comments/1dr1jo9/problemas_en_la_pega/",
        "content": "Gente ,acabo de tener un problema en la pega y realmente no sé cómo sentirme \nTrabajo como guardia Nochero en el cementerio metropolitano (el que está al lado del terminal pesquero) y tengo mis implementos entre los cuales está la radio.\nLas radios están como el pico a veces no se escucha o tienen mucha estatica\nLa radio la tengo a full volumen, en caso de que haya alguna emergencia\nResulta que mi jefe ,vino a webearme porque no respondo a un llamado ,y yo justamente le dije que no copié nada porque no se escuchó, hasta el mismo comprobo que la radio estaba encendida,pero el no quiso entender alegando que no sabía hacer mi pega y que era un incapaz...\n\nYo trabajo desde hace 13 años como guardia,desde que nació mi hijo , y siempre he asumido mis errores,pero está vez me dolió\nPorque siempre he hecho mi trabajo con la Maxima seriedad\n\nDe la pura rabia ,me comenzó a doler la cabeza \nY comenzé a sangrar de la nariz bastante\nY ahora siento punzadas en la cabeza\nQue van desde el ojo hasta la nuca\n\nDisculpen el mucho texto\nPero quería desahogarme",
        "num_comments": 14,
        "comments": [
            "Directo a urgencias, segundo, es re facil que alguien lea tu post y sepa quien eres facilmente, tercero, siempre graba las conversaciones con los jefes y lo demas a preguntar en inspeccion del trabajo",
            "Yo como un weon que ha estado en varias pegas, te recomiendo siempre pero siempre grabar tus conversaciones que tengas en las pegas, ya sean con superiores, con inferiores o gente del mismo rango, es mejor as siempre tener evidencia",
            "Amigo como recomendacin siempre debe reportar los problemas, si la radio no funcionaba o tena estatica siempre dejelo en su libro de rondas o por correo. Eso le va a dar una coartada para estos casos, dira que necesita ir a un mdico por lo que dice pero para otra reporte las cosas as le da un respaldo a la inspeccin ( escribe y le saca foto) y justifica este tipo de incidentes.   \nCuidese amigo mo y si tiene ganas y la oportunidad quizs ver otra pega mientras para salir de esos malos tratos",
            "Amigo vaya al Dr. para un holter de presin arterial. Probablemente le subi la presin y por eso la cefalea y la epistaxis.",
            "En mi pega por lo menos escuchan las palabras \"inspeccin del trabajo\" y se asustan caleta, an que no se s sirvan de algo",
            "Anda a la clinica pa cachar q chucha. En cuanto a la pega: siempre van a haber aweonaos, trata de aguantarlo y si se vuelve imposible busca una pega sin soltar esa por mientras.",
            "Renuncia sin decirle niuna wea, si te llama putealo y mandalo a la chucha y busca otra pega, de guardia hay en todos lados.",
            "Tiene un hijo po viejo no es wea de llegar y mandar todo a la chucha, que wea la gente",
            "Te falt decirle que lo mate",
            "Pregunte amigo o lleve su libro hgase una bitcora, pidale el wtsp a su jefe ql o al RRHH y deje constancia como sea.  \nPero que no se lo caguen siempre su bitcora y su fotito.... pico que sea para uso personal o para ud y nunca lo use pero en algn momento le va a servir como prueba, se lo dice un ctm est constantemente en el tema de que la gente no tenga opciones de cagarse a la empresa."
        ]
    },
    "La wea rancia": {
        "title": "La wea rancia",
        "score": 100,
        "url": "https://i.redd.it/tsrcrjtxsd9d1.png",
        "content": "La wea es tan rancia que obviamente se volvió un meme",
        "num_comments": 0,
        "comments": []
    }
}