{
    "June Banner: Juneteenth": {
        "title": "June Banner: Juneteenth",
        "score": 59,
        "url": "https://www.reddit.com/r/Christianity/comments/1d5pa8i/june_banner_juneteenth/",
        "content": "Disclaimer: My goal with this thread is not to belittle or take a side on today's issues. The goal is to showcase a specific celebration as well as Christianity's role in it. These kinds of things are difficult to stay completely neutral on while still making a point relevant to the topic at hand, but I have attempted to do so.\n\nYou are more than welcome to use this thread as a jumping off point for discussion. You are also welcome to use this thread as a simple means of learning some history.\n\nThis month's banner represents Juneteenth. Although the Emancipation Proclamation was issued in the US in 1863, the 13th Amendment was not ratified until December 6th, 1865. Even then, the last slaves were not told they were free until June 19th, 1865. Juneteenth has evolved to become more than just a day of remembering a scar that plagued the United States, but it has become a month to reflect on what it means to be \"free\".\n\nChristianity played a very unique role in the days of slavery as well as the push leading to end it. One of the first names given to June 19th was Jubilee Day. This was in reference to Leviticus 25:8-54. What is described was a festival dedicated to the Lord. The Israelites were to forgive debts, release others from bondage, and even restore some tribal lands. The freed slaves saw this as a perfect representation to their newfound freedoms.\n\nDuring the time of slavery, many slaves throughout the Caribbean islands of Jamaica, Barbados, and Antigua were given a \"Slave Bible\" as to not give them anything that might lead to rebellion. This version of the Bible left out most of the Old Testament. What was left were passages aimed at telling slaves to be subservient. This says something about the strength Christianity holds on those who read Scripture. Slaveholders did not want slaves to muster enough spiritual or mental strength to recognize the strength they had to escape their captivity.\n\nEven then, [The Haitian Revolution](https://en.wikipedia.org/wiki/Haitian_Revolution) happened.\n\nThis obfuscation of the Bible is one of the several aspects of slavery that Christianity has had to wrestle with since the Emancipation Proclamation was signed.\n\nWhile it is clear the main push to continue slavery was for economic gain, a main source used to justify this push was God's word, at least what was presented as His word. This greed was not found only within the political institutions that ran the governments attempting to call for the continuation of slavery. This greed made its way into the hearts of some churches as well.\n\nIn 1838, Theodore Clapp, Unitarian minister of the Independent Unitarian Society, New Orleans wrote:\n\n>I would say to every slave in the United States, 'You should realize that a wise, kind, and merciful Providence has appointed for you your condition in life; and, all things considered, you could not be more eligibly situated. The burden of your care, toils and responsibilities is much lighter than that, which God has imposed on your Master. The most enlightened philanthropists, with unlimited resources, could not place you in a situation more favorable to your present and everlasting welfare than that which you now occupy...\n\nAt the same time, Scripture was a driving force in the Abolitionist Movement.\n\nTheodore Weld was one of the leading figures in the push to end slavery. Unlike his counterparts who were using God's word to push for the continuation of slavery, he saw God's word as overwhelming in favor of a freed people:\n\n>No condition of birth, no shade of color, no mere misfortune of circumstances, can annul that birth-right charter, which God has bequeathed to every being upon whom he has stamped his own image, by making him a free moral agent,\" Weld stated. \"He who robs his fellow man of this tramples upon right, subverts justice, outrages humanity, unsettles the foundations of human safety, and sacrilegiously assumes the prerogative of God.\n\nSince the Emancipation Proclamation, Christianity has had to come to terms with the role it played in slavery. As we see in this subreddit, the \"clarity\" surrounding God's word and slavery is still debated.\n\nI hope this look at Christianity's role in all aspects of slavery brings to light the importance of Juneteenth, and why I chose it to be represented this month. Yes, on the surface, Juneteenth is a day to celebrate the freeing of the last slave in the United States, but it has become much more than that. It is a time to reflect on the values we hold as human beings and to question where we are moving. It is also a time to reflect on the word of God and to take a hard look at those who use it as a means to an end.\n\nJuneteenth is a stark reminder that even the holiest of things can be used as a tool for subjugation. It is also a reminder that, in the right hands, the Word can be used to bring good back to the world.",
        "num_comments": 257,
        "comments": [
            ">Christianity has had to come to terms with the role it played in slavery.\n\nNo it hasn't",
            "Help an ignorant non-American: What is that banner? In what way does it observe Juneteenth?",
            "I was wondering why a American Holiday I had never heard of was up there, this actual makes sense",
            "I see the silhouette of a cross in front of what looks colorful rock background. Is the banner supposed to have some other elements indicative of its theme?",
            "> Although slavery in the US ended in 1863 through the signing of the Emancipation Proclamation\n\nThis is not true. Chattel slavery was outlawed in the United States when the 13th amendment was ratified.",
            "Oh, also. Trivia to relate this back to Pride. You know how, for a while, the big talking point was civil unions and the difference between religious and governmental marriage? Yeah... If you look at when the government actually started issuing marriage licenses, as opposed to just using common law marriage, it's entirely plausible that they only did it to prevent miscegenation",
            "I need to say something here, playing a large role in something doesn't mean you were on the right side.  Any role that Christianity had in slavery and ending slavery was at best self serving at at worst only made things more difficult for Blacks to be accepted as equals in society.  Self serving evangelization i.e. presenting people with converting to your faith as a means to \"save them\" so you can feel good about yourself...this only furthered the idea that the Blacks were lesser because they largely followed African or Afro-Caribbean folk religions or traditional beliefs...this was the same treatment the native americans got and the answer from Christians was to \"save them\" by doing nothing about helping them save their land, but, taking every effort to convert them not only to Christianity but to a European way of life.  Juneteenth is not a Christian holiday by any means, but, is a day to remember that a group of  slaves in Texas were never freed despite the federal laws in place outlawing the practice and the owners...Christians.  Juneteenth should be to remember a horrible historic event and celebrate the freedom and equality we now have in our country and not an excuse for Evangelical Christians to pat themselves on the back.  Sorry if you this sounds harsh but I am only repeating historical fact",
            "I only wish the nation decided to call it something different. I can't get over the contracted June 'teenth thing. I don't have to get it. It might be absurd to get hung up over it. It might be nitpicky. It might be beside the point. But still, why can't we call it Emancipation Day? Or Texas Finally Caught Up With the Rest of Us Day? Freedom Day? Or goodness even just \"June Nineteenth\"? \n\nIs contracting numbers a norm in the southern dialect? Does this happen with other words? If someone's birthday is May 14th is that Mayteenth? It's a colloquialism I just can't seem to get over lol.",
            ">the 13th Amendment was not ratified until December 6th, 1865. Even then, the last slaves were not told they were free until June 19th, 1865.\n\nI think you messed up your dates there.",
            ">During the time of slavery, many slaves throughout the Caribbean islands of Jamaica, Barbados, and Antigua were given a \"Slave Bible\" as to not give them anything that might lead to rebellion. This version of the Bible left out most of the Old Testament. What was left were passages aimed at telling slaves to be subservient. \n\nI think that this is misinfo. It wasn't a Bible and wasn't presented as such. It was just some selected sections of the Bible. Lots of stuff wasn't selected."
        ]
    },
    "Off-Topic Friday - Post nontopical things in this thread!": {
        "title": "Off-Topic Friday - Post nontopical things in this thread!",
        "score": 1,
        "url": "https://www.reddit.com/r/Christianity/comments/1dqkap6/offtopic_friday_post_nontopical_things_in_this/",
        "content": "Okay, trying to find two interesting videos each week is kinda tiring, but giving one interesting video, at least:\n\nI found [a challenge run](https://www.youtube.com/watch?v=-L205x5k5us) in Fire Emblem Three Houses, where you try to beat the game without committing any war crimes. They were arguably *more* restrictive than they had to be, but it's both way easier and way harder than you would expect",
        "num_comments": 26,
        "comments": [
            "Two. Director-level. Referrals. I got not one, but *two* job referrals from director-level employees. And they aren't even exactly small companies. One's a bank that made the news last year, and the other's a major analytics company. I still have zero clue how this happened. In the former case, the director even reached out to me and essentially offered to refer me, while in the latter case, he's even hunting down the hiring manager to get me directly in touch. The statistic that's floating around is apparently that 91% of referrals from director-level employees or above turn into offers, so hopefully, this will mark the end of my job search.\n\nAlso, I'm up to Chain of Memories in my replay of Kingdom Hearts, and I forgot how existential the game can get. Anyway, I've been focusing on card points when leveling up, so while I don't have a very large deck, there are a lot of big numbers.",
            "Okay, about halfway through the year, what's y'all's album of the year so far?",
            "140 days since I have seen a football game and I still have to wait 71 more before I can see another does anyone know if there are any viable, affordable cryogenic services I could use? Im in San Jose, CA for reference",
            "Well I got my old job back, had a wonderful week this week. Great night, great morning, Im happy. On my things are looking up arc.",
            "There is also the fact that Reloaded and Revolution are to an extent a retcon of the original movie which was supposed to be standalone. At the end of Matrix its clearly shown that Neo as the One basically controls the code of the matrix and therefore can act in it as he pleases effectively being omnipotent (and the inspiration by the ending of gMatthew in apparent) yet in the beginning of Reloaded he is juststronger.",
            "Woo! Meanwhile, my \"Things are looking up\" arc is somehow getting ***TWO*** job referrals from ***DIRECTOR-LEVEL*** employees in the same week. And it isn't even small companies. For example, one of them came from the director of a bank that made the news last year",
            "Iget the same let down as when I read a Murakami book. He spends so much time building an elaborate plot that collapses under its own weight.\n\nThe Matrix has so much potential to tell a great epic. But like Murakami plots, it collapses under its own weight.",
            "Woah I had no idea they did concerts at the circus Maximus! That's crazy. \n\nI enjoyed that. I could see this kinda vibe doing well at Eurovision",
            "Nice! Im really happy for you. Thats why ive been praying for you because the job search arc is genuinely one of the most frustrating things. Until you get somewhere it feels like youre just screaming into the void.",
            "Ill have to add those to my to listen list"
        ]
    },
    "Do you ever feel in love with God?": {
        "title": "Do you ever feel in love with God?",
        "score": 419,
        "url": "https://i.redd.it/nx7qnlxvje9d1.jpeg",
        "content": "I’m on a relatively new journey in reading the Bible. Tonight, prior to my studies - I cried during my prayers because I felt so thankful and emotional about how opening my mind and heart to God has impacted my life. Then I began the chapter I was on (1 Samuel 12), and when I got to verses 20 - 22, I again became so overwhelmed with the love of that God gives his people (despite their repeated sin cycles). I felt compelled to write the verse and then I realized I was drawing little hearts around it and had selected pink and purple highlighters - not purposely but just those were the ones nearest. My notebook looks like it did when I was in high school writing little love notes to my boyfriends! My heart is full. \n\nOur God is merciful, our God IS LOVE! ❤️   ",
        "num_comments": 115,
        "comments": [
            "I probably wouldn't say \"in love\" since that's usually used to mean in a romantic sense, but I certainly often feel a great love for God in the way one might feel for a father, or a beloved king. Ultimately it is hard to compare the love for God with the love for anyone or anything else, because it is such a unique dynamic, the love between a creature and the Creator.\n\nLove the passion visible in your notebook!",
            "Not in any way comparable to romance.",
            "Yes, there is so much to love about Him. Everything I could ever ask for in a leader and more is a part of our God",
            "Iv never read the intire Bible, so last year around July when I rededicated myself to the Lord(basically started taking him and my Christianity faith serious) I started that journey to read from front cover to back cover. I'm currently in Jeremiah. Let me tell you, this book has just been truly opening my eyes to who the Lord really is more then the others. There was even a chapter I literally starting sobbing while reading it. It showed me just how much the Lord desires our attention. I continue to read and pray much more now. Through it hes helping me Conquer addictions. Iv never been more happy in my entire life that I know my Lord and Savior, my King, Jesus Christ. My favorite verse, Jeremiah 20:11, \"For the Lord is with me, like a mighty warrior;",
            "Sadly no, it is my biggest struggle as a Christian, to be insatiable of knowledge, and for that, i doubt God's goodness and existence every single day. I prayed, begged on my knees multiple nights before going to sleep, to advise me, to help me understand his plan, the reasons he does not talk to me, the reasons why certain people have to suffer so much, why two men or two women can't love each other. He never answered. I hardly feel his love. So many times i found myself not wanting to be in heaven, and instead i prefer to just die and disappear, not because i don't want to do right, but because i don't see the rightfulness in his plan. And i love the world way more than i love him. I love humans. I love humanity.",
            "I have had fleeting moments where it all clicked. Like I felt like pinnochio on Gepettos lap, looking at a piece of a plan. Like God loved me enough to show me\nSome of the Path I couldnt see before. Like God was telling me all the crap youve\nBeen through was to make you tougher and stronger, not just for you but to help your family and friends! You are gonna have to be strong to bring your family together like it should be. And your training and discipline is all to help bring you wisdom.",
            "To quote South Park... \"it doesn't sound like you love Jesus, it sounds like you're IN LOVE with Jesus\"",
            "This is awesome. You know, the mystics were historically in love with God to an almost embarrassing degree, if they had retained any sense of embarrassment. They speak of being consumed and enveloped by God in such a rapture that you would almost not distinguish it from a bride and groom.",
            "I quite literally someone feel, for lack of a better word, an aura encompassing me which in my mind I feel as love",
            "In fact. Our God is loving and merciful, but he is also justice and rewards each person according to their works"
        ]
    },
    "Drawing of Jesus I did": {
        "title": "Drawing of Jesus I did",
        "score": 177,
        "url": "https://www.reddit.com/gallery/1dqzff6",
        "content": "The Arabic translation - Jesus the son of Mary ",
        "num_comments": 29,
        "comments": [
            "Beautiful but you should consider writing  for Jesus instead of  which is used in the Quran.",
            "This looks like this shortest verse of the Bible Jesus wept  beautiful drawing John chapter 11 verse 35 KJV Bible.",
            "It's beautiful. Forgive my ignorance, but what does it read?",
            "That's awesome, thanks for sharing!",
            "Now draw him crossing up satan",
            "Im an iconoclast so I am obligated to dislike all figures and pictures of Jesus\n\nlol /jk Very cool!",
            "Good but why is He crying or head downward in contemplation?  Perhaps this is when He is in the desert for 40 days.",
            "I see the frustration that Christ must have felt dealing with the disciples and their lack of understanding. \nGreat drawing. Thanks for sharing. ",
            "May I ask whats the difference? I only know how to speak Arabic not write I used google translate ",
            "The person who drew it is a Muslim, though, at least based on post history. Hence \"Jesus, son of Mary\" rather than \"Jesus, Son of God\"."
        ]
    },
    "Picture I took in Croatia, Split. ": {
        "title": "Picture I took in Croatia, Split. ",
        "score": 33,
        "url": "https://i.redd.it/utzmqtqjah9d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Come visit Medjugorje! You will have unbelievable experience. God bless!",
            "Pozdrav!"
        ]
    }
}