{
    "Hey everyone - we're opening mod applications! Apply today!": {
        "title": "Hey everyone - we're opening mod applications! Apply today!",
        "score": 20,
        "url": "https://www.reddit.com/r/chrome/comments/1bprfu2/hey_everyone_were_opening_mod_applications_apply/",
        "content": "###[Apply here!](https://forms.gle/3wAoMxJ6ButM1DFMA)\n\nWe're looking for new mods to help with the rapidly expanding community. Our personal lives have become busier while the amount of work to do here has increased. \n\n---\n\nA lot of our general information is within the application form, but here's a short rundown of what the job entails. \n\n* Checking modqueue on a regular basis to take action on posts that are filtered automatically or reported by the community. \n\n* Regularly browsing through the subreddit and moderation of posts and comments to ensure that all community rules and guidelines are being enforced, including removing uncivil, hostile and inflammatory content. \n\n* Being able to discuss issues with members of the community through modmail in a professional and calm manner. \n\n* Contributing to discussions about moderation-related issues over Discord.\n\n---\n\nOverall, the job won't necessarily take more than an hour or two of your time per week, and if you're already generally active on Reddit and Discord then you probably won't notice a difference. \n\nIt can be quite rewarding to be able to shape a community (for the better). If this sounds like something that interests you, please apply! If you have any questions, feel free to comment below or message us through modmail.",
        "num_comments": 7,
        "comments": [
            "I can't get into the link, I would like to apply.",
            "The form requires a google sign in to access.",
            "Hmm, seems that it isn't working within the Reddit app, but it works through a browser. Have you tried that?",
            "I'm trying to open it in my phone browser, but it doesn't work either.",
            "I just fulfilled the form and applied.\n\n\nThanks.",
            "It's still opened? "
        ]
    },
    "\"New\" UI Megathread 3": {
        "title": "\"New\" UI Megathread 3",
        "score": 44,
        "url": "https://www.reddit.com/r/chrome/comments/1dkluz5/new_ui_megathread_3/",
        "content": "The old post was getting too crowded, and still included older, no longer working fixes. Due to feedback from the community, here's a new megathread.\n\n*Previous megathreads:*\n\n[*\"New\" UI Megathread 2*](https://www.reddit.com/r/chrome/comments/1czzyee/new_ui_megathread_2/) *(May 2024)*\n\n[*New UI megathread 1 (archived)*](https://www.reddit.com/r/chrome/comments/18is2yy/new_ui_megathread/) *(December 2023)*\n\n___\n\nKeep in mind that the Google Chrome UI team is not reading this community-run subreddit here, and that the mods here are not Google employees (nor fanboys), if you want to complain more effectively, go to the official channels.\n\nNo, downgrading is not a safe solution, any posts or comments suggesting to downgrade and thus opening people up to threats will be removed. There were numerous vulnerabilities patched in M126 which were in no way insignificant, of which Google awarded almost 30k USD total to the finders of the vulnerabilities.\n\nSuggesting other browsers is fair game. Google will not be going back on the UI changes, so if you wish to suggest other browsers, go ahead.\n\n\nDiscuss the changes here, but know that you are better off sending alt+shift+I feedback or finding the bugs feature page if you want to be more productive about it.\n\nFuture updates will have the option to switch sides of the tab search feature (not any of the other complaints), this was already confirmed in May. That’s a rarity for them to have an option like that in the first place. They are targeting stable 127 for this.",
        "num_comments": 191,
        "comments": [
            "They clearly didn't test their UI on smaller screens. Yeah, the padding looks fine if you're on a 30 inch monitor. But menus don't fit on a laptop.",
            "Why does Google love whitespace so much? The excessive padding around everything and rounded corners are dated looking and wastes valuable screen space which every UI designer knows is important except Google.  \n  \nProbably the same morons that design the Adwords/Adsense sites, what a fucking mess all of it is.",
            "I hate the stupid dividers between tabs. For the love of God, why? If they like clean design so much why add a totally useless element. The tabs are already in their separate bubbles, they don't need to be divided.",
            "Ok, the right click context menu being so freaking HUGE and having those rounded \"deadzone\" elements on top and bottom makes it really terrible...  \nFirst it fu\\*\\*s up the muscle memory and then it's so big you have to move the mouse cursor so much, and by being so big you get the menu starting from bottom most of the time compared to before...",
            "Is there a way to make the right click menu smaller like it was before? Now every time I try to right click to open in a new tab it wants to autoscroll down. IT use to just fit on the static pop-up.",
            "Switched to Mozilla Firefox. Goodbye Chrome.",
            "I've been using the #RevertChromeRefresh hashtag on twitter and reposting everyone's complaints about the new UI. It's worth a shot.",
            "Man, how much I hate it when all these big companies keep fixing something that isn't broken, like changing UI for no reason. The extra bad thing is, I can complain about tab search arrow, about tabs scrolling or the new inconvenient context menu, but I can't come out and say 'I simply don't want to get used to the new UI, bring back the old one'. It wouldn't even be accounted as an actual complaint by the company, they'd just shrug it off as some useless whim.\nIt just sucks how companies almost never consider anything not related directly to the software's functionality, like users' habits or making their programs not look ugly.",
            "Once again the new UI update is terrible. This isn't a mobile touch focused program so *would you kindly* fuck off with the needless whitespace/padding.",
            "Anyway to revert back to the old tab looks?"
        ]
    },
    "The look (design) of Download history in Chrome keeps changing by itself": {
        "title": "The look (design) of Download history in Chrome keeps changing by itself",
        "score": 1,
        "url": "https://www.reddit.com/r/chrome/comments/1drb4ly/the_look_design_of_download_history_in_chrome/",
        "content": "On my laptop I have manjaro xfce installed. It was installed at the beginning of June this year and, according to the Pacman log, I installed my current Google Chrome from AUR on June 6th this year. It hasn't been updated since then. The version of Google Chrome that I currently have is 125.0.6422.141.\n\n\n\nWhen I go to the main hamburger menu and select \"Downloads\" (or just press ctrl + J), I will get the downloads history page. Since I installed Chrome and up until yesterday, this downloads history page looked like on screenshot number 1. \n\n\n\n[download history 1 \\(before the change\\)](https://preview.redd.it/5clhs0m3hi9d1.jpg?width=1364&format=pjpg&auto=webp&s=20afce2da26a4bb8fd234f077d37e69cc35d2c53)\n\n\n\nEvery downloaded file was shown by its name, then below that there was the URL from which it was downloaded, and then there was the separate hamburger menu on the right side for each file. If I pressed this little hamburger menu on the right side for a specific downloaded file, two menu items would appear: \"show in folder\" and \"delete from history\". Please take a look at the second screenshot which shows this.\n\n\n\n[download history - hamburger menus clicked \\(before the change\\)](https://preview.redd.it/rxpubacdhi9d1.jpg?width=1366&format=pjpg&auto=webp&s=eade30464c7cc6be46ad76f357c59f5bc595483e)\n\n  \n\n\nThis kind of design for Downloads history was active until yesterday, and then suddenly something changed for unknown reason - even though I have not updated Chrome nor made any other changes to my system! I did not even restart the system for several days. The only thing that I changed on the system lately is that I installed Audacity using pamac, but I doubt that this could have any effect on Chrome.\n\n\n\nNow when I go to the downloads history, I see the list of downloaded files as is shown on screenshot number 3. It is a subtle change, but nevertheless quite distinct. Now, every file is shown by its name, then below that there is the URL from which it was downloaded, and below all that there is an underlined link \"show in folder\". And on the right side of the file there is a little x button with which you can remove that particular downloaded item from the list.\n\nhttps://preview.redd.it/dp0gaosuhi9d1.jpg?width=1356&format=pjpg&auto=webp&s=722740893b99b48ffe5c0599baeeb57b52aa9459\n\n\n\nPlease note that \"show in folder\" and \"remove from history\" used to be accessible through the separate hamburger menu for each file until yesterday. But now the hamburger menu is GONE for unknown reasons, and I have this somewhat  older type of design that I remember from a few years ago.\n\n\n\nI wonder how is this even possible, how is it possible to have this type of change in the look and design of Download history without me having changed anything on my system, and without having updated Chrome? I didn't even mess with the settings in Chrome at all. \n\n\n\nThis is not the first time that this has happened, it has actually happened several times before during this year and I always suspected that I had a virus. Is it possible that Google can change this design of download history from their end?",
        "num_comments": 1,
        "comments": [
            "Thank you for your submission to /r/Chrome! We hope you'll find the help you need. Once you've found a solution to your issue, please comment \"**!solved**\" under this comment to mark the post as solved. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/chrome) if you have any questions or concerns.*"
        ]
    },
    "Is there an extension, to automatically use the favicon of the current tab as additional icon on the Windows taskbar? Apparently icons of profiles are particially displayed.. Can they be replaced?": {
        "title": "Is there an extension, to automatically use the favicon of the current tab as additional icon on the Windows taskbar? Apparently icons of profiles are particially displayed.. Can they be replaced?",
        "score": 1,
        "url": "https://i.redd.it/ra6u5m8ukh9d1.png",
        "content": "",
        "num_comments": 1,
        "comments": [
            "I don't think Chrome extensions have permission to change this (for security reasons, if nothing else)."
        ]
    },
    "Is it a mistake that Chrome does not use the \"video\" feature of the GPU in Linux with an Intel card?": {
        "title": "Is it a mistake that Chrome does not use the \"video\" feature of the GPU in Linux with an Intel card?",
        "score": 2,
        "url": "https://www.reddit.com/r/chrome/comments/1dr4kps/is_it_a_mistake_that_chrome_does_not_use_the/",
        "content": "I have enabled GPU hardware acceleration, but it does not work. I have turned on and off various Chrome settings, then I have reinstalled but no, it does not use Intel \"video\" or \"videoenhance\".\n\nI have configured media.ffmpeg.vaapi.enabled =True in firefox, the performance is very better \n\nFor example, in a Meet using Chrome, it leaves the PC stuck while the meet is on, but in Firefox this does not happen.\n\nIn the videos I still notice slowness compared to Firefox.  \nChrome videos consume full CPU. The problem is that I prefer Chrome xd.\n\n\n\nMy System:\n\nhttps://preview.redd.it/4baijnavag9d1.png?width=581&format=png&auto=webp&s=c09cfe1a926b41a3eac922ac06a8ca9a740a59b5\n\nmy card (old xd):\n\nhttps://preview.redd.it/dxwrp7y5ag9d1.png?width=818&format=png&auto=webp&s=d7583c97065bbc301e7f515325c9360dd73f3e60\n\n  \nmy cpu:\n\nhttps://preview.redd.it/usj0o3r8ag9d1.png?width=1018&format=png&auto=webp&s=2fce9f81b93c8122d87fdd0ad4ba725a66462319\n\nchrome gpu:  \n\n\nhttps://preview.redd.it/itkp1bw29g9d1.png?width=1021&format=png&auto=webp&s=39a8bfec5ca3213b0e8676fa9caf940a225b7bb8\n\n\n\nintel\\_gpu\\_htop when use chrome:\n\nhttps://preview.redd.it/zj3km0ay8g9d1.png?width=1049&format=png&auto=webp&s=addfdf69b40fb04d0827a53a1abd70f5fbcd676f\n\n\n\nintel\\_gpu\\_htop when use firefox (use features gpu) with video/meet: \n\nhttps://preview.redd.it/5e7rw0ae9g9d1.png?width=1057&format=png&auto=webp&s=d938511c7331ed18c8112f3976aed76686ba4788\n\nIs there a configuration that you should make to improve the performance of the videos or the meet using Chrome?",
        "num_comments": 1,
        "comments": [
            "Thank you for your submission to /r/Chrome! We hope you'll find the help you need. Once you've found a solution to your issue, please comment \"**!solved**\" under this comment to mark the post as solved. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/chrome) if you have any questions or concerns.*"
        ]
    }
}