{
    "Hey everyone - we're opening mod applications! Apply today!": {
        "title": "Hey everyone - we're opening mod applications! Apply today!",
        "score": 18,
        "url": "https://www.reddit.com/r/chrome/comments/1bprfu2/hey_everyone_were_opening_mod_applications_apply/",
        "content": "###[Apply here!](https://forms.gle/3wAoMxJ6ButM1DFMA)\n\nWe're looking for new mods to help with the rapidly expanding community. Our personal lives have become busier while the amount of work to do here has increased. \n\n---\n\nA lot of our general information is within the application form, but here's a short rundown of what the job entails. \n\n* Checking modqueue on a regular basis to take action on posts that are filtered automatically or reported by the community. \n\n* Regularly browsing through the subreddit and moderation of posts and comments to ensure that all community rules and guidelines are being enforced, including removing uncivil, hostile and inflammatory content. \n\n* Being able to discuss issues with members of the community through modmail in a professional and calm manner. \n\n* Contributing to discussions about moderation-related issues over Discord.\n\n---\n\nOverall, the job won't necessarily take more than an hour or two of your time per week, and if you're already generally active on Reddit and Discord then you probably won't notice a difference. \n\nIt can be quite rewarding to be able to shape a community (for the better). If this sounds like something that interests you, please apply! If you have any questions, feel free to comment below or message us through modmail.",
        "num_comments": 7,
        "comments": [
            "I can't get into the link, I would like to apply.",
            "The form requires a google sign in to access.",
            "It's still opened? 😍",
            "Hmm, seems that it isn't working within the Reddit app, but it works through a browser. Have you tried that?",
            "I'm trying to open it in my phone browser, but it doesn't work either.",
            "I just fulfilled the form and applied.\n\n\nThanks."
        ]
    },
    "\"New\" UI Megathread 3": {
        "title": "\"New\" UI Megathread 3",
        "score": 26,
        "url": "https://www.reddit.com/r/chrome/comments/1dkluz5/new_ui_megathread_3/",
        "content": "The old post was getting too crowded, and still included older, no longer working fixes. Due to feedback from the community, here's a new megathread.\n\n*Previous megathreads:*\n\n[*\"New\" UI Megathread 2*](https://www.reddit.com/r/chrome/comments/1czzyee/new_ui_megathread_2/) *(May 2024)*\n\n[*New UI megathread 1 (archived)*](https://www.reddit.com/r/chrome/comments/18is2yy/new_ui_megathread/) *(December 2023)*\n\n___\n\nKeep in mind that the Google Chrome UI team is not reading this community-run subreddit here, and that the mods here are not Google employees (nor fanboys), if you want to complain more effectively, go to the official channels.\n\nNo, downgrading is not a safe solution, any posts or comments suggesting to downgrade and thus opening people up to threats will be removed. There were numerous vulnerabilities patched in M126 which were in no way insignificant, of which Google awarded almost 30k USD total to the finders of the vulnerabilities.\n\nSuggesting other browsers is fair game. Google will not be going back on the UI changes, so if you wish to suggest other browsers, go ahead.\n\n\nDiscuss the changes here, but know that you are better off sending alt+shift+I feedback or finding the bugs feature page if you want to be more productive about it.\n\nFuture updates will have the option to switch sides of the tab search feature (not any of the other complaints), this was already confirmed in May. That’s a rarity for them to have an option like that in the first place. They are targeting stable 127 for this.",
        "num_comments": 80,
        "comments": [
            "Honestly my biggest grip with the new crappy UI are those grey / low contrast text on both tabs and bookmarks... I've opened an issue about it, I would appreciate if anyone would put a \"+1\" on it, it's just a click on the far right bubble of the issue's title, thank you!  \n[https://issues.chromium.org/issues/348129256](https://issues.chromium.org/issues/348129256) \n\nhttps://preview.redd.it/qjgvup0baw7d1.png?width=481&format=png&auto=webp&s=8f00a5ff15e323e6df6cba3de2ccd865de5f7940",
            "I just switched and I recommend you all to do so.\n\nPeople like us are probably the minority and Google doesnt care. The vast majority are most likely casual who dont really care about details. We can all ditch Chrome at once and their usage share may barely change. Meaning you can wait forever and it will never happened. I waited more than a decade for Google to improve Chrome UI. Instead of improving they constantly make it worse.\n\nI have had enough and switch, and so should you. You dont have to uninstall Chrome right away. I keep it to make sure I transfer everything to new browser, and keep it as a secondary browser now.",
            "Why does Google love whitespace so much? The excessive padding around everything and rounded corners are dated looking and wastes valuable screen space which every UI designer knows is important except Google.  \n  \nProbably the same morons that design the Adwords/Adsense sites, what a fucking mess all of it is.",
            "I've been using the #RevertChromeRefresh hashtag on twitter and reposting everyone's complaints about the new UI. It's worth a shot.",
            "Ok, the right click context menu being so freaking HUGE and having those rounded \"deadzone\" elements on top and bottom makes it really terrible...  \nFirst it fu\\*\\*s up the muscle memory and then it's so big you have to move the mouse cursor so much, and by being so big you get the menu starting from bottom most of the time compared to before...",
            "I would say Google UI team ARE reading the threads, this way they find out about our UI hacks and block them ;(",
            "Is there a side by side comparison of the UI changes? I don't use Chrome much nowadays but I just launched it and it updated to 126.0.6478.115 and it doesn't look too terribly different from what I can tell.",
            "I think the worst part of it for me is how muddy it looks. especially in dark mode.\n\nMy eyes. they are important for seeing things. A gross muddy mess where everything is the same dusty dark color is not ideal whatsoever.\n\nDidnt they also screw up themes for chrome? would of been nice to have a roundabout fix for something nobody except Google Employees will praise.",
            "Is there a way to make the right click menu smaller like it was before? Now every time I try to right click to open in a new tab it wants to autoscroll down. IT use to just fit on the static pop-up.",
            "God, I can't stand this new update. Why are all the tabs floating and surrounded by the background color? It looks so ugly with my custom theme."
        ]
    },
    "Simple workaround for Chrome Google search engine triple text repeat bug": {
        "title": "Simple workaround for Chrome Google search engine triple text repeat bug",
        "score": 2,
        "url": "https://www.reddit.com/r/chrome/comments/1dluir8/simple_workaround_for_chrome_google_search_engine/",
        "content": "After recent Chrome for Windows install i've met an old pretty annoyng bug not seen for a long time. It is when your search engine is Google, and when you search the text is reapeated 3 times (example text example text example text).\n\nThats not cool at all. No solution or workaround i have found fixed it for me or was not possible for the latest version of Chrome (tried a 12 years old post reddit solution without any luck).\n\nWhat i have just found and worked for me was easy and simple: Open Chrome settings -> pick Search Engine from the left side -> click Manage search engines and site search -> then Edit search engine Google and in the Shortcut section for me it was [Google.com](http://Google.com) -> just remove the .com so it is now Google and click save. I then restarted the browser, if that matters anyway. Done!\n\nThat's what worked for me and not 100% sure, if it is a permanent fix. I hope it helps for anyone else too.",
        "num_comments": 1,
        "comments": [
            "Thank you for your submission to /r/Chrome! We hope you'll find the help you need. Once you've found a solution to your issue, please comment \"**!solved**\" under this comment to mark the post as solved. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/chrome) if you have any questions or concerns.*"
        ]
    },
    "I think I solved the chrome freezing issue": {
        "title": "I think I solved the chrome freezing issue",
        "score": 2,
        "url": "https://www.reddit.com/r/chrome/comments/1dluhza/i_think_i_solved_the_chrome_freezing_issue/",
        "content": "I have been battling a problem with chrome on my mac for over 1 month. When the computer goes to sleep and wakes up, my chrome is completely frozen and I have to exit and relaunch it for chrome to work.\n\nThe craziest thing is when I drag the window to another screen (I have two monitors) it will work on the other screen normally.\n\nWell I think I found the solution because it started working up normally after this. Go to chrome-settings-system- and turn off Use graphics acceleration when available (there should also be a button relaunch I clicked that too)\n\nAfter this the screen was unfrozen and started working on the first monitor like normal.\n\nI don't know if this is a fix I havent tried it long term. We will see how it goes!",
        "num_comments": 0,
        "comments": []
    },
    "How do I revert back to the old Bookmark Icon aesthetic? (this pic is what Google forces)": {
        "title": "How do I revert back to the old Bookmark Icon aesthetic? (this pic is what Google forces)",
        "score": 1,
        "url": "https://i.redd.it/d3s23itve48d1.png",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Thank you for your submission to /r/Chrome! We hope you'll find the help you need. Once you've found a solution to your issue, please comment \"**!solved**\" under this comment to mark the post as solved. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/chrome) if you have any questions or concerns.*"
        ]
    }
}