{
    "/r/Civ Weekly Questions Thread - June 24, 2024": {
        "title": "/r/Civ Weekly Questions Thread - June 24, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/civ/comments/1dn9u3c/rciv_weekly_questions_thread_june_24_2024/",
        "content": "Greetings r/Civ. \n\nWelcome to the Weekly Questions thread. Got any questions you've been keeping in your chest? Need some advice from more seasoned players? Conversely, do you have in-game knowledge that might help your peers out? Then come and post in this thread. Don't be afraid to ask. Post it here no matter how silly sounding it gets.\n\n##To help avoid confusion, please state for which game you are playing.\nIn addition to the above, we have a few other ground rules to keep in mind when posting in this thread:\n\n* Be polite as much as possible. Don't be rude or vulgar to anyone.\n* Keep your questions related to the Civilization series.\n* The thread should not be used to organize multiplayer games or groups.\n\n## Frequently Asked Questions\nClick on the link for a question you want answers of:\n\n* [Is Civilization VI worth buying?](https://www.reddit.com/r/civ/wiki/faq#wiki_is_civilization_vi_worth_buying.3F)\n\n* [I'm a Civ V player. What are the differences in Civ VI?](https://www.reddit.com/r/civ/wiki/faq#wiki_i.27m_a_civ_v_player._what_are_the_differences_in_civ_vi.3F)\n\n* [Should I play Tall or Wide?](https://www.reddit.com/r/civ/wiki/faq#wiki_should_i_play_tall_or_wide.3F)\n\n* [Where should I settle my cities?](https://www.reddit.com/r/civ/wiki/faq#wiki_where_should_i_settle_my_cities.3F)\n\n* [How have Domination victories changed?](https://www.reddit.com/r/civ/wiki/faq#wiki_how_have_domination_victories_changed.3F)\n\n* [What are good beginner civs for Civ VI?](https://www.reddit.com/r/civ/wiki/faq#wiki_what_are_good_beginner_civs_for_civ_vi.3F)\n\n* [In Civ VI, how do you show the score ribbon below the leader portraits on the top right of the screen?](https://www.reddit.com/r/civ/wiki/faq#wiki_in_civ_vi.2C_how_do_you_show_the_score_ribbon_below_the_leader_portraits_on_the_top_right_of_the_screen.3F)\n   * Note: Currently not available in the console versions of the game.\n\n* [I'm having an issue buying units with faith or gold in the console version of Civ VI. How do I buy them?](https://www.reddit.com/r/civ/wiki/faq#wiki_i.27m_having_an_issue_buying_units_with_faith_or_gold_in_the_console_version_of_civ_vi._how_do_i_buy_them.3F)\n\n* [Why isn't this city under siege?](https://www.reddit.com/r/civ/wiki/faq#wiki_why_isn.27t_this_city_under_siege.3F)\n\n* [I see some screenshots of Civ VI with graphics of Civ V. How do I change mine to look like that?](https://www.reddit.com/r/civ/wiki/faq#wiki_i_see_some_screenshots_of_civ_vi_with_graphics_of_civ_v._how_do_i_change_mine_to_look_like_that.3F)\n\n* [If I have to choose, which DLC or expansion should I purchase first?](https://www.reddit.com/r/civ/wiki/faq#wiki_if_i_have_to_choose.2C_which_dlc_or_expansion_should_i_purchase_first.3F)\n\n* [Why can't I build a district or wonder on this tile?](https://www.reddit.com/r/civ/wiki/faq/#wiki_why_can.27t_i_built_a_district_or_wonder_on_this_tile.3F)\n\n* [Why can't I build a national park here?](https://www.reddit.com/r/civ/wiki/faq/#wiki_why_can.27t_i_built_a_national_park_here.3F)\n\n----\n\nYou think you might have to ask questions later? Join us at [Discord](http://discord.gg/civ).",
        "num_comments": 15,
        "comments": [
            "Really enjoying playing slower game speeds so I can play around with units longer before they get teched up. Are there any mods that let me keep the lengthened research eras but keep production costs at standard speed? Was thinking it'd be nice to field larger armies while keeping the tech level slowed.",
            "I was wondering about a situation that occured yesterday: On my way to a religious victory, I had converted all but one cities of an AI to my religion, including all his cities with holy sites. Then, on turn change, 3 cities changed back to his religion and two more became neutral. One religion charge from me was enough to turn them back, though. I did not see that he had any religious units left at that point (already used up before that happend). Any idea what might have happened here?",
            "Does anyone know how it works when the player ahead of you skips a great person? \nMy situation is this: another player just received the option to recruit a great person. I am currently in third place in great person points for that category, but I will be overtaking the second place player in points before they could potentially recruit them. \nSo, what happens if the person who just received the option to recruit the great person refuses? Does the game then allow the other players to race for that great person, or does it automatically go to the player in second place even if they dont have enough points yet?",
            "I'm not getting achievements on steam since yesterday, maybe because of the update? Is anyone experiencing the same?",
            "Just downloaded civ 6 on mobile.Does leaders have no dialogues and animations or there is something wrong with my phone?",
            "Could have had suzerainity of the city state that makes your great people exert religious pressure. Vatican City I think",
            "Hard to say, but I'd assume a specs issue/game files issue. I play large/huge games on Marathon on old machines (8+ year old windows laptop, 4 year old iPad), and I get lag/delays during the AIs turn. Not when I'm doing anything.",
            "AFAIK if 2 or more people have the option to get the same Great Person in that same turn, the next to choose is *whoever's turn comes first, regardless of how many points each player has*. Also, bear in mind that the AI never skips a Great Person.\n\nDunno how it works in multiplayer, I guess it's whoever clicks faster?",
            "Ah excellent catch! Vatican City is indeed in the game; it's new to me since I upgraded to the anthology just recently. I found in the log that a great scientist was produced just that round, but I couldn't connect this to the religion spreading. Thanks!",
            "Thanks! We are in a multiplayer game which is why Im not sure how it works when its people instead of AI."
        ]
    },
    "Civilization VII Megathread": {
        "title": "Civilization VII Megathread",
        "score": 140,
        "url": "https://www.reddit.com/r/civ/comments/1ddoyil/civilization_vii_megathread/",
        "content": "A little late, but share your thoughts of the nrw upcoming game here. Reminder to keep things civil.",
        "num_comments": 268,
        "comments": [
            "I hope they add more ancient civilizations that no longer exist, like Sumeria, Babylon, Phoenicia, etc.",
            "I am once again begging for navigable rivers",
            "I just want employment/immigration/industries cycle. I want people to flock to my cities with jobs from rival civs!",
            "If theres no Napoleon Im rioting. \n\nIll still play it, of course. But also riot.",
            "I really hope they keep some version of the district system. I feel like it adds so much to the gameplay and look of the map.",
            "I would like more variety between different Civs. Venice from Civ5 was a great example. Having a Civ which could, for example, work five tiles from the capital instead of 3 would be amazing even if they had other penalties and would make the game totally different for different players",
            "Im very worried about the multi-platform launch. The fact that a switch can barely run Civ VI but will be a Civ VII launch platform reads to me like VII will not even come close to pushing the envelope of 10 years of compute advancements since the Civ VI engine.",
            "After seeing a few Korean historical dramas I'm ready for Khitans and Jurchens.",
            "My pc is not gonna be able to load it and I'm feeling super sad",
            "Though of the day, with advances in AI (and I know its not AI) I think the game can really make some fantastic autogenerated maps with territory borders which revolve around terrain difficulty/coasts/forests/rivers and improve upon the current hex system. Imagine a wood being divided into smaller regions emphasizing its difficulty to trek through but plains being larger territories making them easier to cross."
        ]
    },
    "Monopolies & Corporations": {
        "title": "Monopolies & Corporations",
        "score": 173,
        "url": "https://i.redd.it/rzqhuw5wfh9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Very cultured indeed.",
            "yes it is",
            "Surprised there isn't more Civ merch tbh.\n\nIf you like my work,  a follow over at Twitter is always appreciated! https://x.com/DocksEcky"
        ]
    },
    "Epic ally tanks relationship to -68 like a boss": {
        "title": "Epic ally tanks relationship to -68 like a boss",
        "score": 168,
        "url": "https://i.redd.it/djec4vre9h9d1.png",
        "content": "I changed government one turn ago.",
        "num_comments": 14,
        "comments": [
            "I dont think theyll break ally status. Just yesterday I had an ally with 400+ grievances against me",
            "This looks remarkably like real life.\n\nDemocracies and Autocracies don't tend to like each other after all.",
            "I'd say more like USA/Vietnam moment",
            "I'm guessing from experience that the \"AI\" will have a field day denouncing me when the alliance expires as if it never existed anyway, even if it serves severely against their interests. Looking forward to it.",
            "What do you mean by \"break\" You can't break ally status, it has to expire, with the exception of being a possible Betrayal Emergency (it is the only way to force a war to occur between allied/friended nations, though I think troops near borders is another but don't quote me on that).\n\nHowever, they could easily not renew the friendship/alliance.",
            "USA/Saudi Arabia has entered the chat.",
            "When were the US and Vietnam allies?",
            "Make sure to renew first turn it expires",
            "I fail to see the problem",
            "I think Ho Chin Ming did love USA and was inspired by George Washington but ultimately opted for communism over liberalism due to the political climate at the time. If USA had not entered the stage for their relation with France they could've probably avoided war, as Vietnam never actually liked China or the USSR, let alone Cambodia.\n\nOn the hand, the USSR was another superpower. Even they had shared ideology with USA they'd probably have been enemies."
        ]
    },
    "Firaxis did her dirty....": {
        "title": "Firaxis did her dirty....",
        "score": 629,
        "url": "https://i.redd.it/izgo2p4g0f9d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "The icon is always the same bald dude, but depending on which civ you choose he changes ethnicity. Emily Dickinson should probably look a bit more feminine on the map.",
            "so are we done joking about stealing Sistine Chapel ceiling?",
            "No that's Emily Dickin's Son",
            "It's a really cryptic in-joke\n\n[Emily Dickinson] is an anagram of [idiocy links men]",
            "Look at me I'm Angie Dickinson, outta my way!",
            "Emo Emily got a makeover",
            "They should have at least woman and a man icons for great people",
            "Her name is Dick In Son. Shes a priest in this game.",
            "Bro you didnt hear what just got stolen?",
            "Only when it's during the year 420 BCE on turn 69"
        ]
    }
}