{
    "Deck Help Discussion Thread": {
        "title": "Deck Help Discussion Thread",
        "score": 5,
        "url": "https://www.reddit.com/r/ClashRoyale/comments/1dpi6o9/deck_help_discussion_thread/",
        "content": "Need a new deck? Want some fine-tuning on something you’ve already made? Looking for tips on how to counter specific matchups? Post all your questions about decks here!\n\n[Image for thumbnail](https://static.wikia.nocookie.net/clashroyale/images/8/8e/CardMasteryIcon.png/revision/latest?cb=20220412213310)\n\nThis thread will refresh every 72 hours.\n\nTo receive the best help, we suggest adding the information below to your comment:\n\n* Player tag\n* An image of your deck and/or card collection (use an image hosting site like imgur)\n* Specific questions/concerns\n\nHelpful deck sites:\n\n* [**Stats Royale**](https://statsroyale.com/decks/popular)\n* [**Royale API**](https://royaleapi.com/decks)\n* [**Deckshop.pro**](https://www.deckshop.pro/)\n\n[Click here for a detailed deck building guide.](https://www.reddit.com/r/ClashRoyale/comments/gam6co/clash_royale_guide_to_deck_building/)\n\nRemember to keep an open mind and be respectful of other players’ decks, skill levels, and preferences! Any comments attacking anything mentioned before will be removed.",
        "num_comments": 22,
        "comments": [
            "What evo should I use in log bait?\n\nI use knight, tesla, skellies, princess, gob barrel, guards, log and rocket. I have evolved knight, telsa and skellies but only have one evo slot. Tia!",
            "Anything that can get you fast to 2000 trophies on goblin route? Im trying to do that but i suck hard and every 1 win means im gonna lose 4 times. And i dont have any time to actually get through that so slowly",
            "Can somebody give me a good deck for arena 17",
            "yeah just play xbow like a braindead",
            "I Sell a top 200 Clash Royale acc all cards 14 40 cards 15 and a top 500 gt Finish and all 20 win challenges dm me",
            "Deck is Mega Knight, Prince, Bandit, Tombstone, Arrows, Firecracker, Wall Breakers, Bats w/ Dagger Duchess. It's pretty alright for me esp. after the Prince buff, I consistently get to UC or the league before it.\n\nMy question is: between Firecracker, Wall Breakers, and Bats, what two evolutions should I use? I've been using Firecracker and Bats but don't have a specific preference. Also, any slight adjustments that could be made?",
            "Check out r/royaleapi if you want some deck help, I believe they usually do that over there",
            "At least when I played it everyone was using goblin giant so I used mortar Pekka drill deck. Then if you get the goblin poison use it with zap. \n\nI just threw goblin drill at their tower, then they often played goblin gang so goblin poison and zap and you easily get a tower.",
            "Agreed, dumb af to have a flair for a topic that is banned to post for and relegated to an inefficient pinned thread lol. I get why they want to filter out bad deck posts, but this is annoying.",
            "\"Use an image hosting site like Imgur\" ur blind"
        ]
    },
    "Auto Refunder Issue - We're Working on a Fix!": {
        "title": "Auto Refunder Issue - We're Working on a Fix!",
        "score": 31,
        "url": "https://www.reddit.com/r/ClashRoyale/comments/1do36om/auto_refunder_issue_were_working_on_a_fix/",
        "content": "Hey everyone, 👋  \nWe wanted to inform you about an ongoing issue with our auto refunder system following the fix we deployed on June 24th. While addressing the login issue that prevented some players from accessing the app, we inadvertently caused a problem with the auto refunder.  \n  \n**What's happening:**\n\n* The auto refunder system is not functioning as intended and is revoking a large amount of magic items unfairly.\n\n**What do you need to do:**\n\n* Nothing. After we fix the issue, your refunded magic items will represent the actual amounts.\n\nWe sincerely apologize for the inconvenience this has caused. Please know that we are actively working on a fix for this issue and greatly appreciate your patience and understanding during this time.",
        "num_comments": 25,
        "comments": [
            "I haven’t experienced this (pray to god that i don’t) but it’s nice to see that others won’t have to worry about it anymore!",
            "The login issue is NOT completely fixed, I’m unable to enter the game even after several reinstalls",
            "Is this why I can’t log in",
            "Myself and many other players are still unable to login and are stuck at 50% are there more fixes coming to help us as well? 😭❤️",
            "STILL CANT LOGIN AFTER A WEEK. SORT YO S**T OUT",
            "I need update on anyone if they can log in. The problems are killing me.",
            "That’s cool but some of us still can’t even access to the game",
            "hope this fixes my negative 2.6 million elite wild cards",
            "my game still does not work...",
            "When is this getting fixed?"
        ]
    },
    "Even OJ admit it 💀": {
        "title": "Even OJ admit it 💀",
        "score": 5328,
        "url": "https://i.redd.it/4jxzvorx7c9d1.jpeg",
        "content": "At least he having fun",
        "num_comments": 190,
        "comments": [
            "OJ hasn’t been serious for years fyi. Dude used to be the math/interactions guy on YouTube. He turned to whale/fun content years ago now. Nothing wrong with that, but I miss the old OJ",
            "anyone that uses this font needs to be studied in a lab",
            "He knows but doesn't give a fuck cuz he's half of supercells total revenue in all their games",
            "İ love how 50% of the comments about how bad the font is.",
            "Have to tried to go to the settings and search for \"font\" ?",
            "Can’t take that font serious",
            "I can’t take u seriously with that font",
            "Just feels bad for the pros💀 imagine they have to take this seriously.",
            "Perhaps clash Royale will introduce a new “competitive” game mode that reverts the game to its peak 2019 era",
            "I don't know why people are surprised about a content creator who actually also criticised Supercell for their decisions for the game (e.g. Diamond Pass, Clan Wars II, Level 14/15) is also not cool about the direction of the game.\n\nThe only reasons based on my glance are just down to him spending tons of money on shop offers in this game (Which on the other hand, you're gonna be shocked as to how much money your favorite content creator who is also critical of how Supercell is treating *Clash Royale* is spending on the game) and him not criticising the game as much as notable ones who do (but still considered criticising them), but other than that I hope this can be put to rest."
        ]
    },
    "Who else is leaving the game after this season is over?": {
        "title": "Who else is leaving the game after this season is over?",
        "score": 84,
        "url": "https://www.reddit.com/r/ClashRoyale/comments/1dr955y/who_else_is_leaving_the_game_after_this_season_is/",
        "content": "I’m f2p and I’ve decided the game is not viable for me anymore. All the broken cards and features with outrageous price tags have ruined the game for me as my main deck has become obsolete. I don’t have the willpower to max out another deck so I’m just going to uninstall it.",
        "num_comments": 66,
        "comments": [
            "why not now? save yourself the time",
            "If you mean it then leave now",
            "I didnt ever care about the p2p aspect as it never occured to me to spend money on the game and i still have almost 12 elite cards now and 7 evos i just liked to grind the game and it was rewarding to get stuff without spending money but now the game isnt even fun anymore, theres too much going on and i feel like theres no reason for me to play anymore, which is why im deleting it now",
            "They don’t give a shit about you. And why not leave now?",
            "nah seriously it's impossible to keep up with the meta. the only way to play this game as f2p are classic and grand challenges",
            "I left when this season started",
            "Just uninstalled yesterday. I honestly don't even care about how Evos are ruining the game, but this season pushed so many broken cards it's almost comedic. Ah yes, we will push 3 broken goblin cards, emergency nerf them after ppl buy the offers for them, and then push out 2 more broken Evos that are even more obviously broken than the goblin cards we pushed. Anyone with a IQ over two digits would quit, they aren't even bothering to be subtle with the stupid monetization.",
            "I've only been playing challenges for the past 5 months or so, since it's the only fair mode left in the game. When I started I had like 5k gems, now I have 3k and I've already decided that when I'll run out I'll never open this app again, no matter what they do with it.",
            "I’ve quit yesterday. There’s nothing to do in this game, all updates are either shit or behind a paywall, you can’t even grind in this game cus you get nothing",
            "you shouldnt wait, supercell wont really care"
        ]
    },
    "Balance Changes Ideas for Summer/July - Excluding evos/cards being balanced soon already!": {
        "title": "Balance Changes Ideas for Summer/July - Excluding evos/cards being balanced soon already!",
        "score": 102,
        "url": "https://i.redd.it/nzcvhxg0ih9d1.png",
        "content": "",
        "num_comments": 38,
        "comments": [
            "I hate that since evolution they forget to balance other card like every balance change half of the changes are for evolution",
            "Better balance changes than the actual devs",
            "GK's weakness comes with it having lower per-hit damage than Knight, so I think being able to one-shot goblins would be a more welcome buff, particularly as you've set this sort of precedent by making minions take two tesla hits",
            "bro wants to buff cannoneer",
            "Please yes buff my beloved hunter 🙏",
            "Cannoneer is already better than princess even with the health, DD needs another nerf to be inline with other towers Cannoneer should not receive any buffs\n\nGolden Knight needs his dash reworked or replaced because its straight up terrible and evo knight will always beat him out in stats",
            "Wtf is that heal spirit buff? U probably didn't play when its heal radius was big",
            "Yes holy shit please buff skeleton barrel its been so bad for so long ill take anything",
            "Idk why you people think heal spirit needs a buff, the card is doing fine it’s just niche.",
            "Ok I just woke up after a nap and read 2.0 as 0.2 and was like \"WTF? Do you mean retargettig time or first hit ir something BECAUSE THAT IS BROKEN!\""
        ]
    }
}