{
    "Upcoming Darkmoon Faire and Valor Points Changes - Cataclysm Classic Discussion": {
        "title": "Upcoming Darkmoon Faire and Valor Points Changes - Cataclysm Classic Discussion",
        "score": 280,
        "url": "https://us.forums.blizzard.com/en/wow/t/upcoming-darkmoon-faire-and-valor-points-changes/1874343",
        "content": "",
        "num_comments": 229,
        "comments": [
            "Volcanic decks went from 8k to 22k on the AH 😂",
            "W blizzard",
            "Massive win for alts with the valor change. Felt insane seeing people on this sub argue against it.",
            "As someone who had a week of family vacation this is a huge dub",
            "I don't really care about dmf but those valour changes are amazing. No longer will alts be perma behind for no reason. Now you can grind out the valour whenever you want instead of getting punished for going on holiday for a week.",
            "This is good.  Now I don’t have to get my cap in every week.  Some freedom",
            "I think this is a W.",
            "Classic Prog players get treated too well by our devs. Wrath was all W changes and Cata is already off to a good start with this stuff.",
            "I started from fresh at launch and had a week of holiday with family, but currently 77 and delighted I now have the opportunity to catch up! This all helps remove the natural feeling of FOMO too",
            "I am so fucking happy. I bought my deck a few days ago without realize the next one wasn't until july"
        ]
    },
    "Daily Questions Megathread (June 22, 2024)": {
        "title": "Daily Questions Megathread (June 22, 2024)",
        "score": 2,
        "url": "https://www.reddit.com/r/classicwow/comments/1dlnxjq/daily_questions_megathread_june_22_2024/",
        "content": "Our Daily Question Megathread is for those questions you don’t feel warrant making their own post, such as:\n\n* Can my PC run WoW: Classic?\n* When does my class unlock a certain ability?\n* Which dungeons are worth doing while levelling?\n* Feel free to ask anything related to WoW: Classic!\n\nAsk the unanswered questions you’ve never gotten around to asking.\n\nYou can also ask these questions over on our [Discord server!](https://www.discord.gg/classicwow)",
        "num_comments": 1,
        "comments": [
            "Nostalgia is hitting hard and I want to give cata a chance but i have analysis paralysis choosing a class to play. I've narrowed it down to:\n\n  \n\\* Blood/Unholy DK\n\n\\* Feral OT \n\n\\* Lock\n\n  \nCan someone give me some guidance? My goal is 10man and casual pvp"
        ]
    },
    "My 5 man dungeon went normal": {
        "title": "My 5 man dungeon went normal",
        "score": 90,
        "url": "https://www.reddit.com/r/classicwow/comments/1dls8me/my_5_man_dungeon_went_normal/",
        "content": "Had a nice 5 man hc dungeon. Just wanted to say. No one was kicked and nothing went wrong. ",
        "num_comments": 9,
        "comments": [
            "I just vote kicked a random so it’s all balanced out, fuck you.",
            "I'm sure someone was reported for spam and will get a softban any second now...",
            "This is why anecdotes are mostly useless.  😅",
            "The balance of nature",
            "bruh 🤣",
            "I just invited some rando then clicked queue just to off set this.\n\nSo what if he didn't join, still counts."
        ]
    },
    "POV: You play Horde in the Season of Discovery.": {
        "title": "POV: You play Horde in the Season of Discovery.",
        "score": 100,
        "url": "https://i.redd.it/ldsn4tvea28d1.jpeg",
        "content": "How do you spend your time while waiting for phase 4? ",
        "num_comments": 28,
        "comments": [
            "Play alliance on sod and horde on cata fml I never win bgs",
            "Imagine even pvping in sod.",
            "i too delete my losses on Nova Instance Tracker so my record looks cooller",
            "Surely none of the entries were deleted",
            "SoD’s hero class",
            "SOD pvp hahaha what a joke",
            "I don't get the perception that alliance is even losing BGs, unless this is a region/realm thing. I probably only play two or three a day at most but I can't even remember the last time I lost, with or without a premade.",
            "I love the cope of people who think this is solely because of shamans being strong.",
            "Pov you abuse blizzard's shit tier balancing",
            "player diff"
        ]
    },
    "EU Classic-Era Fresh project, [Zandalari Tribe] ": {
        "title": "EU Classic-Era Fresh project, [Zandalari Tribe] ",
        "score": 32,
        "url": "https://www.reddit.com/r/classicwow/comments/1dltfrc/eu_classicera_fresh_project_zandalari_tribe/",
        "content": "Yo everyone,\n\nI made a post here a few days ago asking about what the opinions were on a fresh server, got suggestion to try out Zandalari Tribe which is community driven project for \"fresh\" characters.\n\nMC hasnt been done yet, people are still in leveling phase and it might take some weeks more before we see first MC.\n\nThere is quite a decent population with often 150-250 ppl online in all levels split into 3 guilds connected with Greenwall to communicate (2 guilds for lvling, 1 for Raiders lvl 50+) new people joining in everyday.\n\nIt gets alot of hate with these classicprojects, but even Blizzard decided to help us out by locking Zandalari Tribe for transfers so we can drive the project further.\n\nQuite easy to form groups during daytime/evenings, people have a will to help and a strive to make this server great.\n\nDont hesitate to msg me ingame (Noxhow, Hordeside) or anyone else in the Fresh Enjoyer/s guild for questions or invite :)\n\nCheers! /Nox",
        "num_comments": 21,
        "comments": [
            "Im in the guild almost 1 month, best experience in a while. I recommend",
            "FRESH POG",
            "most fun I had in a long time playing wow. fresh undefeated.",
            "Great fun so far! Can recommend",
            "best place to be right now for sure!",
            "Super fun. Currently leveling, fresh vibes feel guuud",
            "GREAT FUN COME JOIN",
            "best experience this year!",
            "Come join us, its not too late to join era.",
            "WoW vanilla is just pure masterpiece and in my opinion there will still be people that want to play it no matter what. If you like the vanilla wow and you love good community and fresh start, this is exactly the thing you should try!"
        ]
    }
}