{
    "‘What’s This Piece?’ Weekly Thread #196": {
        "title": "‘What’s This Piece?’ Weekly Thread #196",
        "score": 9,
        "url": "https://www.reddit.com/r/classicalmusic/comments/1di5lqw/whats_this_piece_weekly_thread_196/",
        "content": "Welcome to the 196th [r/classicalmusic](https://www.reddit.com/r/classicalmusic/) weekly piece identification thread!\n\nThis thread was implemented after feedback from our users, and is here to help organise the subreddit a little.\n\n**All piece identification requests belong in this weekly thread.**\n\n\n\nHave a classical piece on the tip of your tongue? Feel free to submit it here as long as you have an audio file/video/musical score of the piece. Mediums that generally work best include Vocaroo or YouTube links. If you do submit a YouTube link, please include a linked timestamp if possible or state the timestamp in the comment. **Please refrain from typing things like: what is the Beethoven piece that goes \"Do do dooo Do do DUM\", etc.**\n\nOther resources that may help:\n\n\\- [Musipedia](https://www.musipedia.org/) \\- melody search engine. Search by rhythm, play it on piano or whistle into the computer.\n\n\\- [r/tipofmytongue](https://www.reddit.com/r/tipofmytongue/) \\- a subreddit for finding anything you can’t remember the name of!\n\n\\- [r/namethatsong](https://www.reddit.com/r/NameThatSong/) \\- may be useful if you are unsure whether it’s classical or not\n\n\\- [Shazam](https://www.shazam.com/amp/) \\- good if you heard it on the radio, in an advert etc. May not be as useful for singing.\n\n\\- you can also ask Google ‘What’s this song?’ and sing/hum/play a melody for identification\n\n\\- [Facebook 'Guess The Score' group](https://www.facebook.com/groups/1924685677798998/) \\- for identifying pieces from the score\n\nA big thank you to all the lovely people that visit this thread to help solve users’ earworms every week. You are all awesome!\n\nGood luck and we hope you find the composition you've been searching for!",
        "num_comments": 78,
        "comments": [
            "I was hoping you could help but if there is another subreddit to better suit this question please let me know. A few months ago I listened to an album on Spotify of a young composer and each song was inspired by another city. Does this sound familiar to anyone? Let me know because I would love to find the album again",
            "If this is in a church for a service of some kind there's a very high chance it's just the organist improvising something.",
            "Chopin Waltz in A Minor",
            "It's an arrangement of his waltz in B minor, Op. 69 Nr. 2, transposed to Bb minor, which I believe has been made for the movie. Could be wrong, but I can't seem to find this interpretation anywhere aside from this clip. Check the waltz out if you haven't though!",
            "If you want the name of the music in the first 29 seconds, that's Dance of the Comedians from the opera The Bartered Bride by Smetana.",
            "Liszt Mephisto Waltz No. 1",
            "Not a classical piece - \"Moon River\" arranged for violin and piano I think",
            "Sounds like a work of François Couperin, can't remember the title though",
            "I took one look at it and realized I have sung this :D\nPolovtsian dances from Prince Igor by Borodin",
            "I think these are pretty commonly used in a lot of pieces. First thing that came to mind was Britten's The Young Person's Guide to the Orchestra"
        ]
    },
    "PotW #99: Tan Dun - Water Concerto": {
        "title": "PotW #99: Tan Dun - Water Concerto",
        "score": 8,
        "url": "https://www.reddit.com/r/classicalmusic/comments/1div6ui/potw_99_tan_dun_water_concerto/",
        "content": "Good morning everyone, happy Tuesday, and welcome to another selection for our sub's (semi) weekly listening club. Sorry about the long delay between entries, I had been off the grid / going through personal issues. But glad to say I’m back and this week, each week, we'll listen to a piece recommended by the community, discuss it, learn about it, and hopefully introduce us to music we wouldn't hear otherwise :)\n\nLast time, we listened to [Rachmaninoff’s Rhapsody on a Theme of Paganini](https://www.reddit.com/r/classicalmusic/comments/1d2k6f7/potw_98_rachmaninoff_rhapsody_on_a_theme_of/). You can go back to listen, read up, and discuss the work if you want to. \n\nOur next Piece of the Week is **Tan Dun’s Water Concerto (1998)**\n\n…\n\nSome listening notes from [Jari Kallio](https://jarijuhanikallio.wordpress.com/2020/11/13/tremendous-evening-of-tan-dun-and-ravel-by-colin-currie-the-helsinki-philharmonic-and-esa-pekka-salonen/)\n\n\n> Tan Dun’s Concerto for Water Percussion and Orchestra (1998) is truly one-of-a-kind piece. Dedicated to the memory of Tōru Takemitsu (1930-1996), the concerto features a percussion soloist performing on an intriguing variety of water instruments, joined by two orchestral percussionists and a fairy standard symphonic ensemble. \n\n> While this highly unusual setup creates some fascinating visual drama, the concerto is not a showpiece per se. What really makes the piece striking, is the fact that even with all those water bowls, water drums, waterphones and water gongs aboard, the concerto is conceived in a completely organic manner, yielding to an astounding experience. \n\n> The concerto is based on a more-or-less traditional three-movement structure, with a largo molto rubato prelude added. The soloist enters the hall during the prelude, playing an improvised intrada on a waterphone. \n\n> The two orchestral percussionists, antiphonally stationed on the opposite corners of the front stage, answer the soloist’s call, as he walks down the aisle. With the misty hue of the three waterphones ringing in the air, the orchestra enters, with six irregularity accented sforzato grunts from the brass, in counterpoint to sustained string lines. \n\n> With the soloist onstage, the prelude ends with a deep tutti chord, bridging into the first movement proper. The percussionists dip their hands in large water bowls, creating rhythms figures and splashes, amazingly integrated with the orchestral part. \n\n> Using water cups drums and gongs partly submerged into the water bowls, the soloist and his two companions draw intriguing sonorities from their watery main instruments. \nTan Dun’s outstandingly crafted orchestral fabric combines standard and extended playing techniques into various dream-like sonorities, sometimes blending seamlessly with the solo part, and is other passages, providing thrilling contrasts. \n\n> An improvised cadenza closes the first movement, with the soloist echoing motivic fragments from the previous passages by dipping his fingers into the water bowl. A mesmerizing section, both aurally and visually, the cadenza casts a luminous spell over the listener. \n\n> The second movement opens with water gongs, joined by a gorgeous solo cello line. Following the slow introduction, the music gains rhythmic momentum, with the whole orchestra joining in section by section. The soloist proceeds with water agogo bells, beating out some extraordinary rhythmic motives before switching to more mellow-sounding water drums. \nFollowing a wondrously busy passage for the full orchestra, the second cadenza ensues. A semi-improvised passage for water drums and water tubes, the cadenza provides a meditative interlude before the full orchestra returns, brining the movement to its conclusion. \n\n> During the transition to the third movement, while playing a water shaker, the soloist moves behind the orchestra and picks up a prepared vibraphone. A wonderful dialogue with the soloist, the two percussionists and the orchestra ensues, setting the movement well into motion. \n\n> In the course of an orchestral interlude, the soloist returns to the stage front. Water drums, agogo bells and water gongs resume, leading the percussion textures back to the beginning, ending up with the hue of the waterphones. \n\n> A powerhouse coda for full orchestra follows, closing with a wash, as the soloist raises a water stainer. Once emptied, the orchestra provides one final tutti chord, thus bringing the Water Concerto to its magnificent close. \n\n\n\n**Ways to Listen**\n\n* Yi Chen, Percussionist: [YouTube](https://www.youtube.com/watch?v=dp3Q4EDaogs)\n\n* Didier Métrailler with Yuram Ruiz and the Orchestre du Conservatoire Cantonal du Valais: [YouTube](https://www.youtube.com/watch?v=GUDmL97m8_E)\n\n* Colin Currie with Esa-Pekka Salonen and the Helsinki Philharmonic Orchestra: [YouTube](https://www.youtube.com/watch?v=_Zvp3Q1HIIE)\n\n* Christopher Lamb with Kurt Masur and the New York Philharmonic: [Spotify](https://open.spotify.com/album/5rWNvPTVgxABhVVszkbczY?si=S48lg7efT16bgfQ_6KguDw)\n\n\n**Discussion Prompts**\n\n* What are your favorite parts or moments in this work? What do you like about it, or what stood out to you?\n\n* Do you have a favorite recording you would recommend for us? Please share a link in the comments!\n\n* Can you think of other concertos for unconventional instruments (or in this case, a “non-instrument”)? How does this one compare? How does Tan Dun use the sounds of water as a basis for this music?\n\n* Have you ever performed this before? If so, when and where? What instrument do you play? And what insights do you have from learning it?\n\n...\n\n*What should our club listen to next? Use the link below to find the submission form and let us know what piece of music we should feature in an upcoming week. Note: for variety's sake, please avoid choosing music by a composer who has already been featured, otherwise your choice will be given the lowest priority in the schedule*\n\n[*PotW Archive & Submission Link*](https://www.reddit.com/r/classicalmusic/comments/tk5ewh/potw_archive_submission_link/?)",
        "num_comments": 7,
        "comments": [
            "I heard this piece double billed with Nu Shu, the Secret Songs of Women. I found Tan Dun's work to be well orchestrated and rich in concept, but very flat on delivery. It seems to supplement with other media in a way that clings for dear life to the audience's interest. Nu Shu was a better work to me, the Water Concerto was full of so many stretches of \"oh that's cool, ahem... yes, quite.... there it is again..\" just slappy dappy woop doops that are cool as fodder for material but by themself and in repetition they are almost awkward.",
            "Tan Dun is regarded by many composers in China as very overrated, which is interesting",
            "Why are they supposed to worship him because he’s Chinese?\n\nInteresting…",
            "To me his music is always like ‘that sounds sort of interesting’ or ‘that seems like an intriguing idea’ but never goes beyond these realms or trigger any deeper layers of subconscious",
            "Yeah, well that doesn’t really address what you just said so goodbye",
            "He proposes a lot of ideas that aim to bridge the culture of western music with Chinese philosophy, so the comments from the domestic Chinese musicians, who have the very cultural background, probably mean something. That’s what I was saying",
            "It’s so… WET"
        ]
    },
    "Does anybody recognize this signature? ": {
        "title": "Does anybody recognize this signature? ",
        "score": 14,
        "url": "https://i.redd.it/o006rwglbi9d1.jpeg",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Well, I’m pretty sure it’s not Mahler.",
            "A very rare Bob Dylan",
            "Is it a concert program? Who was the conductor?",
            "First name really does look like Stephen.\n\nETA: there’s no reason this would necessarily be someone who’s well-known in the classical music world. It could very well be someone who was famous in Vienna at that time and happened to be sitting close by. A TV personality or author or something.",
            "Could it be Esa-Pekka Salonen?\n\nEdit: I don't think it is",
            "It definitely says it’s in Vienna? Vienna Phil archive has Bernstein conducting Mahler 6 in 1988 (right before the released recording) in Tel Aviv. It looks like the first name might be Ephriam.",
            "the first thing that came to my mind is editor san(twoset violin)",
            "Looks like a Toddler signature",
            "It is. Bernstein conducting Mahler 6th. Do no soloist, and that’s not Bernstein signature. Probably somebody who attended the concert, but the owner of the program thought they merited also having the autograph.",
            "Maybe Isaac Stern? It looks it could say Stern. I believe he had associations with the NY Phil."
        ]
    },
    "Orlando Philharmonic just lost $150k in funding because Gov. Desantis vetoed all Florida state arts grants for next year": {
        "title": "Orlando Philharmonic just lost $150k in funding because Gov. Desantis vetoed all Florida state arts grants for next year",
        "score": 5,
        "url": "https://www.seattletimes.com/entertainment/florida-arts-groups-left-in-the-lurch-by-desantis-veto-of-state-funding-for-theaters-and-museums/",
        "content": "",
        "num_comments": 1,
        "comments": [
            "well, what can I say?\n\nExcept isn't desantis elected?"
        ]
    },
    "Not getting Tchaikovsky's symphonies": {
        "title": "Not getting Tchaikovsky's symphonies",
        "score": 18,
        "url": "https://www.reddit.com/r/classicalmusic/comments/1dr5bc4/not_getting_tchaikovskys_symphonies/",
        "content": "It seems generally agreed that Tchaikovsky's 6th is one of the great symphonic works, and all the others are well worth the time listening to them.  In an effort to get with the program, as it were, some time ago I listened to them all.  But I remained unmoved.  Although they all had beautiful, soaring, passages, to me the movements didn't \"hang together\" in a unified form, but sounded (to me) more like moments of glorious beauty strung together with humdrum nothings.  I love Tchaikovsky's ballets and concertos - I think his violin concerto is a superb romantic work, and one of the greats - but his symphonies (again, to me) seem to lack that underlying structural strength which makes a symphony work.  I don't quite know how to put it, but although they are called \"symphonies\", they seem to lack form.\n\nWhen I said something like this before, I was kindly reminded that Tchaikovsky's symphonies aren't in the Germanic mould, but are more sensual, emotional, and have to be listened to in that spirit.  \n\nI tried, but I still couldn't get them.\n\nThere are many composers whose works I dislike, and who I wouldn't go to any trouble to develop an appreciation, but Tchaikovsky isn't one of them.  I'd be happy to love his symphonies more, if I could learn how to listen to them.\n\nMany thanks for reading!",
        "num_comments": 23,
        "comments": [
            "Do you think it would change anything for you if you just pretended they didn't have the word \"symphony\" at the top? Say, if you pretended you were listening to a ballet or something?\n\nYou also might just not really like them, which is OK--for example, I love Brahms's chamber music with piano but have never really been able to get into his string quartets. Sometimes it's just like that.",
            "- moments of glorious beauty strung together with humdrum nothings\n\nHis piano concerto😬😬😬",
            "Ive never been much of a Tchaikoqvsky fan. I get why people love his music, i just never really got into him.",
            "My problem with Tchaikovsky symphonies has been that he seems to give it all in the first movement and the rest is kinda meh.",
            "I totally get what you mean, OP, although I do enjoy Tchaikovsky’s symphonies for what they are. I can also think of other symphonies that I would critique in the same way, that I often cast doubt upon their validity as “symphonies” (as opposed to being blatant exhortations of the composer’s ego). \n\nHow do you feel about Sibelius’s First or Second Symphonies? The former is particularly often associated with Tchaikovsky. In any case, Sibelius (especially his later works) is my topmost paragon in terms of symphonic development and form.",
            "I am a fan of Tchaikovsky symphony movements. One example that I think is a structural complaint is with the 4th symphony--1st movement. The main theme feels like it takes forever to play on its own and developing an already gigantic theme draws everything way out, and then the contrasting slow theme just meanders along and conductors tend to take it soooo slowly, and then the section is played twice in the movement.\n\nFrom a different comment--I prefer Bruckner to Mahler as well. As brilliant and masterful as they are, Mahler's symphonies, to oversimplify, are just too nuts, and people go overboard with attributing heavy emotional and philosophical meaning to each little motif and texture.",
            "Im curious, what do you think of Liszt in this context? I've always felt that his attempts were more of a failure than Tchaikovskys but he gets called out far less and is seen as the bridge between Beethoven and Wagner.",
            "I’ve got to agree with you. He is very much at the top of my favorites list, and I find his symphonies underwhelming.",
            "Well, I'd be quite happy to enjoy Tchaikovsky's symphonies as simply a different approach to the symphony, if I could get over my Germanic obsession with form!",
            "How do you feel about the Brahms A minor string quartet when played with more zeal than precision? I think the beginning of the final movement is very intense.\n\nOf course, sometimes no amount of listening makes you love something even when it has a reputation for being oh so sublime. So far that has mostly been my experience with the late Schubert piano sonatas (D major is the only one I really like) and his double cello quintet. And something similar which also does little for me is Beethoven's Archduke trio, it reminds me very much of the Schubert."
        ]
    }
}