{
    "Finished Season 3 & Want to Start Reading? CHECK THIS UPDATED SUBREDDIT'S GUIDE!": {
        "title": "Finished Season 3 & Want to Start Reading? CHECK THIS UPDATED SUBREDDIT'S GUIDE!",
        "score": 99,
        "url": "https://www.reddit.com/r/ClassroomOfTheElite/comments/1bqmcnt/finished_season_3_want_to_start_reading_check/",
        "content": "# [**The Simplified Guide to \"Classroom of the Elite\" & r/ClassroomOfTheElite**](/r/ClassroomOfTheElite/wiki/guide/)\n\nPlease check this guide first if you're coming from the anime and want to dive into the light novel or manga. New posts asking general questions like \"Where do I start the LN?\" from now on will be removed.\n\nIf you want us to add anything to the guide, reply below with your suggestions.",
        "num_comments": 39,
        "comments": [
            "Thank you for posting im tired of them asking where to start (no offense I hope you having a great day)",
            "Is there anywhere to buy physical copies? Id rather have a physical book if possible but I saw on a thread a few years back that the translations are really slow",
            "The first volume of year 2 seems to be sold out in many places, in amazon EU its sold out and has shipping dates between 3 and 7 MONTHS, god damn",
            "hi i just finished watching the anime , i had a question and i didn't know if it was worth to make a post about it, some \"mind games\" in the anime are not well described, like i feel i'm missing somethings, and reading by the posts in this subreddit i got a lot of confirms with \"hidden plots\" is the LN different?",
            "I hope they will see that guide ",
            "Where is the page where ayanokoji proposed kei",
            "I started reading at Chapter 34 of the Light Novel after reading the 17 chapters of the 2nd Year Manga",
            "Is there a web novel I can read?? I might be stupid but I cant see in the guide.",
            "How many ln volumes of 2nd year are officially translated?",
            "Im reading the LN on google play books, but for some reason, there are many weirdly translated things, but I can deal with that, but a lot of sentences and lines keep ending with 3/4 what exactly are they supposed to be? I can only assume that they are pauses like  after those lines but idk."
        ]
    },
    "Classroom of the Elite Year 2 Volume 12 Cover Illustration!": {
        "title": "Classroom of the Elite Year 2 Volume 12 Cover Illustration!",
        "score": 950,
        "url": "https://i.redd.it/x6rm0cscvm8d1.jpeg",
        "content": "",
        "num_comments": 103,
        "comments": [
            "If I didn't know better,I would've thought that Chie is a student lol",
            "I want them to be my teachers ",
            "Every girl in cote is so fucking hot\n\nFor that reason I'm horny",
            "Gorgeous. \n\nI want to make out with both of them. ",
            "Am I the only one who thinks that hoshinomiya looks young and childish",
            "I can already imagine a Cat fight in the faculty room after final exam results kinu bought to cook w this one",
            "Lets go. Chabashira is one of my top 3 favorite characters in cote!",
            "Holy fuck moms are beutiful",
            "id let them groom me",
            "Such breedable ladies.\n\nI'm already hard."
        ]
    },
    "Who’s the hottest female in Cote": {
        "title": "Who’s the hottest female in Cote",
        "score": 256,
        "url": "https://i.redd.it/kqhj4k3vcf9d1.jpeg",
        "content": "",
        "num_comments": 96,
        "comments": [
            "Fuka is hot but Ichinose best girl",
            "Arisu because UUUOHHHHHHHH CUNNY  (and grip strength stronger than ayanokoji frfr)",
            "Kiryin is the hottest and sexiest",
            "1-Honami because she is cute and has them mommy tits  \n2-arisu because she is cute but has not them tits  \n3- suzune and kei tied for third because anime suzune is too cold most of the time for m to get horny and kei is cute but not as good of a body as honami.",
            "Honami I mean just look at her ",
            "Honami and Kei are my hottest female characters",
            "Kushida can and will step on you plus boobs and thighs so her",
            "This illustration is a cheat code fr\n\nFuka goddess here ngl",
            "For me it's Chabashira Sae",
            "You forgot mommy chabs and chie sensei \n\nMommy Chabashira, chie sensei and Mommy fuka >>>> other female characters"
        ]
    },
    "Question": {
        "title": "Question",
        "score": 284,
        "url": "https://i.redd.it/k2b0kacace9d1.jpeg",
        "content": "Can someone explain the Suzune hate because to me she’s perfect I don’t see how someone can’t hate Suzune ",
        "num_comments": 69,
        "comments": [
            "It is because she is one of the most breedable character's in cote.Plus She has wife material .",
            "Personally, I really like her as a character, but if I had to guess, I would guess that people might not like how curt she can be at times. (or that shes taking screentime away from their waifu grrr )",
            "She has the best development in COTE and is one of the best written characters. Not to mention she has perfect breasts, a plump butt, and meaty thighs. \n\nLove her.",
            "One of my favorite characters in the series",
            "I can't turn a blind eye to her flaws, but after i falling love with her, I can't hate her. She's truly stole my heart.",
            "idk its to each their own but Suzu is a great female lead",
            "Well she is the one and only waifu that I love in cote",
            "No clue man. Suzunes great",
            "Can be cringe at times.like challenging amasawa  to get her revenge",
            "because out of nowhere she began to feel empathy for the class traitor, who never hid her desire to expel her, it is worth remembering that she was indirectly responsible for airis expulsion"
        ]
    },
    "Lmao🤣": {
        "title": "Lmao🤣",
        "score": 83,
        "url": "https://i.redd.it/yiv79krz3g9d1.jpeg",
        "content": "Credits👉🏻 https://x.com/juanalv2610/status/1806918307288637604?s=46",
        "num_comments": 6,
        "comments": [
            "Kouji needs to wife her up",
            "Ayanokoji when yagami wants to kill him \nAyanokoji when horikita threatens him ",
            "If it was me Im using gum on kiyotaka ",
            "Lol, this is cheating to another level",
            "Damn wife material ",
            "**FOR WHERE/HOW TO READ/BUY THE LN/MANGA OR TRANSLATION STATUS, PLEASE CHECK THE [SUBREDDIT'S GUIDE.](/r/ClassroomOfTheElite/wiki/guide) MAKE SURE YOUR POST IS IN COMPLIANCE WITH THE [RULES](/r/ClassroomOfTheElite/wiki/rules) AS WELL TO AVOID HAVING IT REMOVED.**\n\nPLEASE DON'T FORGET TO APPROPRIATELY **FLAIR YOUR POST** AND **MARK AS SPOILER OR/AND OC (FOR ORIGINAL CONTENTS LIKE FANARTS/FANFICS) IF NECESSARY**. Check the [wiki](/r/ClassroomOfTheElite/wiki/linkflair) on how to add a link flair!\n\nIf you have already done so you can disregard this message!\n\nThank you for your submission to /r/ClassroomOfTheElite!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ClassroomOfTheElite) if you have any questions or concerns.*"
        ]
    }
}