{
    "Weekly Questions Megathread": {
        "title": "Weekly Questions Megathread",
        "score": 13,
        "url": "https://www.reddit.com/r/ClashOfClans/comments/1do9ihy/weekly_questions_megathread/",
        "content": "Hey Clashers!\n\nIn order to foster better discussion  on the subreddit, we're going to be redirecting all simple questions about the game and personal progression to this [Weekly Questions Megathread](https://i.imgur.com/VFqpkk5.png).   In this thread, you can ask any question you need answered about Clash of Clans, even if it isn't necessarily about learning the game itself.  Questions posts with simple answers (anything that one or two sentences can adequately address without discussion potential) will be removed and redirected here.\n\nIf you're a veteran player, then please consider scrolling through and answering any questions you see, even if they already have an answer. Hearing multiple opinions is vital, and the discussion will help new players learn about the game.\n\n\\_\\_\\_\\_\n\nFirst, please check out [**subreddit's F.A.Q. page**](https://www.reddit.com/r/ClashOfClans/wiki/index/) for answers and guides to the most common questions or one of the many fine wiki pages for stats and other quick references on all aspects of the game.  [Coc.Guide](https://Coc.Guide),  [Fandom Wikia](https://clashofclans.fandom.com/wiki/Clash_of_Clans_Wiki), and [Clash.Ninja](https://Clash.Ninja)\n\nSome other frequent topics that might help you:\n\n[Should I upgrade my town hall?](https://www.reddit.com/r/ClashOfClans/comments/dvgmoe/guide_im_th9_should_i_go_up_an_answer_to_this_faq/)\n\n[Help I deleted my account and now I can't play.](https://www.reddit.com/r/ClashOfClans/comments/w2w7gk/weekly_questions_megathread/ih3ff5b/)\n\n[Why is CWL unfair?](https://www.reddit.com/r/ClashOfClans/comments/lxg3nv/guide_clan_war_league_explained_ask_questions_and/)\n\nTrying to zap something? - [Zapquaker Calculator](https://zapquaker.netlify.app/),  [Lightning Spell Radius](https://imgur.com/FcVMsmL), [Tutorial Video](https://www.reddit.com/r/ClashOfClans/comments/n1iu32/lightning_spell_tutorial_solid_short_version_here/)\n\n[What is the latest game news?](https://clashofclans.com/blog/)\n\n[Looking for voucher links? Here is a handy list](https://www.reddit.com/r/ClashOfClans/wiki/clash_voucher_links)\n\nFor base design questions check out /r/COCBaseLayouts\n\nFor recruiting see /r/ClashOfClansRecruit\n\nReddit now supports uploading images directly in comments through new.reddit or the official mobile app.  Otherwise -use [IMGUR](https://imgur.com/) or another image hosting site to add photo links in comments.",
        "num_comments": 473,
        "comments": [
            "Does anybody know wether you can use the Hereos you started upgrading before the event, when the event starts? Im asking because of CWL. It would make sense to me, but you never know lol",
            "\nI'm at TH8 with 600 gems, 3 builders and nothing is maxed out. What to do after I max out everything as much as pssible at th8. What should I do to make it faster?",
            "Streak event still bugged?  I cant get past task 5 even with back-to-back 100% attacks.",
            "I just 3 starred 3th base for streak events last stage and I cant finish it is there some way to fix the bug??",
            "why does the supercell store never let me make a purchase via any of the methods?? reached out a few times over several months where they told me theyre aware of the issue and working on it but nothing has happened? is anybody else dealing w this?",
            "Do Force closing your app/on-off data for completely matches in builder base or surrender to farm loot in Builderbase can cause any danger or ban to my account?. Context(New community post in community section in game)",
            "Still not getting streak progress after completed attack above req destruction %. Any tips for this dumb bugged event?",
            "If I start upgrading heroes before the heroes event would they be up during the event?",
            "Does the Unlimited Heroes event apply to our Builderbase Heroes also? My bad if this has been asked already & answered. Reply with the link to it... if so. Thanks.",
            "Can I use a hammer of buildings on a new building? (i.e to instantly build my monolith)"
        ]
    },
    "We're Opening Moderator Applications! (June 2024)": {
        "title": "We're Opening Moderator Applications! (June 2024)",
        "score": 21,
        "url": "https://www.reddit.com/r/ClashOfClans/comments/1dmhg04/were_opening_moderator_applications_june_2024/",
        "content": "# Greetings fellow Clashers and Redditors!\n\nIt's an exciting time here at r/ClashOfClans, and as our community continues to grow and thrive, so does the need for more moderators to help guide, oversee, and contribute to the content and interactions that make this place great.\n\nWe're officially opening up applications for new moderators!\n\n# Who are we looking for?\n\n* **Passionate Clashers** – A love and understanding of Clash of Clans is essential.\n* **Team Players** – Moderating *isn’t* a solo job. You'll be working closely with the existing mod team of *over* 10 moderators.\n* **Dedicated Individuals** – We need people who can be regularly active, address issues promptly, and contribute to the betterment of the community.\n\n# Do I need relevant experience?\n\nIf you’ve moderated other subs or have other relevant experiences, that’s great! If not, that's okay too! Some of our best mods started out as a simple redditor, who just wanted to make the subreddit better.\n\n# What does a r/ClashOfClans Moderator do?\n\n* **Enforce the Subreddit Rules** – Ensure that all posts and comments follow our community rules.\n* **Work Closely with Other Mods** – This includes participating in mod discussions and decisions on a *weekly* basis.\n* **Help with Events, Projects, and Initiatives** – From time to time, we run events, AMAs, or other special projects or threads. You'll be a part of making that happen! If you have your own special idea of something that you want to lead, that's great too!\n\n# The Process:\n\n1. **Apply** – We've set up a Google Form to make the process simple. Please provide as much detail as possible and take your time on the application.\n2. **Review** – After applications close on the 29th of June, our mod team will review *all* submissions. We aim to get back to you as soon as we can, but please be patient as we expect a number of applications.\n3. **Interview** – If you make it to the second round, we will be conducting interviews over DMs. This will be an opportunity for us to get to know you better and assess your skills firsthand.\n\n# Important Dates:\n\n* **Application Period Starts**: Today! (Sunday, June 23rd)\n* **Application Period Ends**: Saturday, June 29th\n\n# [APPLY HERE!](https://docs.google.com/forms/d/e/1FAIpQLSfBCXLIHRkgBlWrQ-PkkeVkKQt7T26Yexz9zuTn5QeFRH-OKQ/viewform?usp=sf_link)\n\nWe're genuinely excited to welcome new members to our mod team. This community is a wonderful place because of all of you, and we can't wait to see how our new moderators will help shape its future.\n\n# Clash ON!",
        "num_comments": 36,
        "comments": [
            "Unpaid labourers needed. Unemployed gents, apply here.",
            "Hopefully the sole task for the new mod will be to ban every \"Gauntlet vs Arrow, what to get?\" post",
            "I can't wait to ~~pawn off~~ tackle every single task on my to-do list in collaboration with the new mods.",
            "apply guys, I don't bite ![img](emote|t5_2usfk|50980)",
            "There's good and bad to being a mod, but I've found it mostly rewarding and fun.  If anyone has questions we're all glad to answer them.",
            "Will we all get a response on whether we move on or not?",
            "I cant find anything about the payment.",
            "Nowhere does it say \"work for free\"????",
            "we do try and remove those, pretty much any what do I buy or what do i upgrade.  More mods will help us find them faster, reports help as well",
            "Also the streak bug posts."
        ]
    },
    "We are starting to get attention": {
        "title": "We are starting to get attention",
        "score": 977,
        "url": "https://i.redd.it/p23jkhkfqf9d1.png",
        "content": "",
        "num_comments": 182,
        "comments": [
            "The King of NOT touching grass",
            "supercell gotta start oiling up",
            "Oh God now Asmongold is on it  time to shift to r/youtubedrama",
            "Supercell took Eric's eyebrows, FeelsBadMan",
            "He raises a lot of great questions that many of you should be asking as well.\n\nThis is fantastic... A totally unbiased outsider's perspective on it all.",
            "1 minute from the time of posting the video and you already have a screenshot.",
            "Now that Asmonglod reacted to this it is only a matter of time till MoisCritical will make a viedo about this and then if Supersell doesn't do anything they will lose a few hundert millon dollars.",
            "Ok I have no idea what's going on. What is this drama?",
            "Tbh I prefer no attention that attention from asmongold ",
            "Pls no the guy makes everything he touches a million times worse"
        ]
    },
    "🤐": {
        "title": "🤐",
        "score": 241,
        "url": "https://v.redd.it/7zc5prmlph9d1",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Yall think supercell lets iTzu twirl it every night ",
            "Fr fr fr lol ",
            "itzu droppin that ass for supercell ",
            "Hes basically supercells little pet",
            "Being out of the loop is so weird now. I know some drama happened but don't have all the facts...\n\nHay Day community is much more wholesome than CoC community",
            "People can't digest something that doesn't fit their narrative and will blame anyone who says against them if they use logic \n\nWow such kids are in this subs",
            "Meh, I watched most of each video and I agreed with some of their points in both.",
            "Absolutely true. The guy lost all respect and legacy",
            "nobody called Eric a liar. The issue is that Eric cannot prove anything. He aint got no proof. There is a good chance Eric is infact telling the truth, but with his only source being \"trust me\" doesnt really work.",
            "ngl i love eric and itzu and i do not like how itzu is being hated on but this meme is soo true"
        ]
    },
    "I just summarized the Itzu Situation for anyone who is not familiar with it:": {
        "title": "I just summarized the Itzu Situation for anyone who is not familiar with it:",
        "score": 1482,
        "url": "https://i.redd.it/2nz5jjjqqd9d1.jpeg",
        "content": "Its not much but honest work.",
        "num_comments": 117,
        "comments": [
            "Itzu mainly adressing all the drama that is secondary to the much bigger problem of banning and censoring people, which he only briefly adressed, says enough, lol. He is scared of supercell.",
            "Aight the creator code collar seals it for me ",
            "$upercell: \"whos a good boy?\"",
            "new hero pet already leaked? Special ability licking???",
            "laughed way too hard at this",
            "Yup, it's accurate. SC should be one making statment. Itzu acting like their spokeperson.",
            "The german urge to defend the wrong side",
            "Its a job. How many people tell their boss no and expect not to get fired? When creator focused on one game loses that game that's the end of their income. Not that he is right or wrong but its just reality that its a job at the end of the day, bills need to be paid. I think itzu plays it more middle of the road then others who dont even talk about it. I always take it as a fact that creators are going to play it safe when criticizing a game if they criticize at all.",
            "Unsubscribing from Itzu. Sucks cause I used to love his content. Based as fuck.\n\nTotally fine for 99% of the content creators to break ToS while the rest of us can't use two devices without losing accounts, but Itzu can do whatever he wants as long as he lets SC shove their puppet hand up his denmark",
            "naahh all of them are the same. they only talk when they are the ones that are affected. Look at eric, he knew all this time what supercell's been doing but only talk now because of what happened to him."
        ]
    }
}