{
    "Everyone, it has been an honour.": {
        "title": "Everyone, it has been an honour.",
        "score": 974,
        "url": "https://www.reddit.com/r/clevercomebacks/comments/14g2m1d/everyone_it_has_been_an_honour/",
        "content": "After over five years moderating this pirate ship we call a subreddit, I'm stepping down. \n\nIt's been great being able to build a subreddit where you can say whatever the fuck you want without worrying about some power-hungry mod banning you because you said or posted something they didn't like, where you can actually have an argument without the mods stepping in and sending you to timeout. But I'm old, and I'm tired. I'm handing the \"stupid sticky comment at the top of the thread\" keys over to my fellow mods and the actual owner of the subreddit (no, this isn't my subreddit, I'm just the dumbass you all saw the most).\n\nThanks to everyone who ever called me based, a good mod, or even a goddamn idiot. Y'all are great, and I'll miss this fuckin place.\n\n(also in b4 \"this ain't an airport, you don't have to announce your departure\")",
        "num_comments": 93,
        "comments": [
            ">where you can say whatever the fuck you want without worrying about some power-hungry mod banning you\n\nDamn.. I didn't know this sub exist. \n\nGood luck in your next venture and as we say in Australia,  you been a good cunt.",
            "New phone, who dis ? (Have a great life)",
            "Hasta la sagna, don’t get any on ya",
            ">also in b4 \"this ain't an airport, you don't have to announce your departure\"\n\nJust because you don't have to, doesn't mean you can't. But departure announcements are much like airport ones - there will always be only so many people who care. Thanks for your work and all the best!",
            "I mean, will miss you man. Take care of yourself. Hope you live a good life. You are still a member though right? Come, We'll call each other idiots in the comment section... As equals :D",
            "I don't know you, but that doesn't matter. Farewell, stranger, and enjoy your life.",
            "You're a goddamn idiot and I hope you have a based retirement from being the good mod that you've been.",
            "This ain't the airport, you don....shit beat me to it",
            "I'm old too, can I get my meds now and watch songs of praise with a cup of tea?",
            "Like Steve off the Internet, or whatever the fuck that worthless slug’s name is. He banned me for rickrolling of all things, just because he didn’t like it. No warning. Banned. I appreciate your work."
        ]
    },
    "r/clevercomebacks is recruiting mods": {
        "title": "r/clevercomebacks is recruiting mods",
        "score": 88,
        "url": "https://www.reddit.com/r/clevercomebacks/comments/14icdrm/rclevercomebacks_is_recruiting_mods/",
        "content": "Hey everyone\n\nYou don't really see much from me, which is a testament to how great of a job u/TheGreatZarquon did of keeping everything under control all these years. But with his stepping down it's become a bit apparent just how much he did. \n\nNo point in writing some long essay or whatever, but if you'd like to be a mod then fill out [this google form](https://docs.google.com/forms/d/e/1FAIpQLSfQ39Cdh0GRys5oH8bdbRaa0K6xK9Zoc6O21Q0e8I1IPawtsw/viewform?usp=sf_link). It's not too intense and most of the questions are aimed at just figuring out your mod style to make sure you fit in with the direction we want for the sub, which is pretty much the status quo of what those of you who spend some time here would be familiar with.\n\n(Anybody applying who's flaired as a karma farmer spotter or bot hunter, make sure to include that)",
        "num_comments": 24,
        "comments": [
            "Is this why so many people get away with breaking the rules and nothing happens?",
            "Hello. No life haver here.",
            "I'm more than willing to help though only on week days 8:00am to 1:00am sorry if its inconvenient",
            "66****",
            "90% of mods just want a power trip and ban for no fucking reason... This whole site is nothing but a toxic cesspool..",
            "ok- I can delete all the unclever strawman and whataboutism comebacks,  but then this place will be empty",
            "This clevercomebacks hs become too much of a political platform more often than not instead of it’s original intent IMO",
            "I joined the sub a few minutes ago how do i sign up",
            "When",
            "How much can i charge for my duties?"
        ]
    },
    "The original comeback": {
        "title": "The original comeback",
        "score": 33992,
        "url": "https://i.redd.it/tlc4cr5io18d1.jpeg",
        "content": "",
        "num_comments": 460,
        "comments": [
            "Wait until she finds out about Noah and his big ass boat...",
            "God canceled everyone on earth once with a huge flood so????",
            "I mean, that’s his MO",
            "I think she means instead of cancelling people, they should be tortured and set on fire. It's what Jesus would do.",
            "What about the time God cancelled every first born child in Egypt except those whose families cancelled a goat and smeared its cancelled blood on their doors?",
            "It wasn't over an apple. It was over being annoyed at his lie being found out.  The very first lie in the Bible is told by god: \"don't eat this, it'll kill you\". The snake comes along and goes \"well, that's bullshit\". They believe the snake, because everyone knows sneks are nice animals that help and eat pests, and god gets pissy when he's found out. The \"knowledge of good an evil\" they got from eating the apple was obviously \"god is evil\".",
            "Remember when god turns someone into a rock for looking over their shoulder or when he smites two entire town because they were full of sinners",
            "Let's not forget God cancelling Onan for ... *checks notes*\n\n... Pulling out when raw dogging his sister in law, instead of nutting in her as God intended.",
            "God also supposedly killed the whole human race several times over.  Also the first born of everyone except the Jews. That’s a lot of cancel culture.  Basically every time he realized he fucked up he wiped the slate clean.",
            "Bruh, the bible is full of God cancelling shit. At one point he cancelled every living thing on the planet except for dude and his boat full of animals."
        ]
    },
    "Sooo… nonbinary people are also more like God? Because God is also technically nonbinary, having made man AND woman in God’s image… 🧐": {
        "title": "Sooo… nonbinary people are also more like God? Because God is also technically nonbinary, having made man AND woman in God’s image… 🧐",
        "score": 3610,
        "url": "https://i.redd.it/2jurnp0kp08d1.jpeg",
        "content": "",
        "num_comments": 266,
        "comments": [
            "The reason demons in the bible use those pronouns is because they are 'many speaking as one'.  They will refer to themselves as 'Legion', a collective name.  Remember those pronouns were assigned by the translators from the original Greek, which has uses plural pronouns there.\n\nIt is so hilarious when these fundies try to make a point based on the Bible's EXACT wording when it is all a translation of a translation .  I actually had someone tell me Jesus had to be American because he spoke English in the Bible!",
            "Do these dumb motherfuckers not know what \"plural\" is?",
            "Or you know… the original Old Testament was written in Ancient Hebrew and none of these pronoun debates make any fucking sense because y’all are talking about one of many different english translations…",
            "You'd think religious people would stop trying to use the bible against things by now.  Some of us know it better than they do.",
            "Almost like the English text here is a translation.\n\nAnd the pronouns used here are pluralis majestatis.\n\nI have no dog in this fight but could we stick to FACTS?",
            "Um, the only demon that does that is legion. Not because they were non-binary, but because they were literally a bunch of ‘em at once",
            "I’m not versed in the bible, but didn’t God created Adam in his image and he just created Eve from Adam? Never specifying he actually created Eve in his own image?",
            "r/religiousfruitcake would like this",
            "To me quoting the Bible is like quoting “Green Eggs And Ham”.",
            "God is also the devil. Everything God makes and plans is right and intentional, so he planned for the devil making evil arbitrary."
        ]
    },
    "Someone just got himself pantsed": {
        "title": "Someone just got himself pantsed",
        "score": 24127,
        "url": "https://i.redd.it/uy32fih05y7d1.jpeg",
        "content": "",
        "num_comments": 459,
        "comments": [
            "Bro hasn’t seen sundresses yet if he’s worrying about clothes sexualizing curves",
            "Pants were invented to ride horses. You dont ride? Then wear a skirt like historical men have done",
            "And high heels were invented for men. What’s his point?",
            "Woman wears pants: \"I can't control myself!\"\n\nWoman wears sundress: \"I can't control myself!\"\n\nHey, buddy boy, how about you control yourself and let the rest of the world get its shit done.",
            "PANTS SEXUALIZE MEN! PANTS SEXUALIZE WOMEN! PANTS SEXUALIZE EVERYONE! NOBODY SHOULD WEAR PANTS! LET'S EVERYONE WEAR SHIRTS N TWIRL AROUND ON GRASSS!!!💃🏻✨✨✨",
            "I’m not surprised to read this bs from someone who suggested to legalize rape on private property.",
            "Women wear different types of pants, but that's the only one he looks at.",
            "If you know Roosh, you know it's actually a lot of words for \n\n*Women in pants are much harder to rape*",
            "Women have other kinds of pants that’s just the only kind he looks at",
            "Do men not have legs and a rear end? A slight curve and even a something between their legs that's going to be highlighted?\n\nWhat's his point?"
        ]
    }
}