{
    "Everyone, it has been an honour.": {
        "title": "Everyone, it has been an honour.",
        "score": 991,
        "url": "https://www.reddit.com/r/clevercomebacks/comments/14g2m1d/everyone_it_has_been_an_honour/",
        "content": "After over five years moderating this pirate ship we call a subreddit, I'm stepping down. \n\nIt's been great being able to build a subreddit where you can say whatever the fuck you want without worrying about some power-hungry mod banning you because you said or posted something they didn't like, where you can actually have an argument without the mods stepping in and sending you to timeout. But I'm old, and I'm tired. I'm handing the \"stupid sticky comment at the top of the thread\" keys over to my fellow mods and the actual owner of the subreddit (no, this isn't my subreddit, I'm just the dumbass you all saw the most).\n\nThanks to everyone who ever called me based, a good mod, or even a goddamn idiot. Y'all are great, and I'll miss this fuckin place.\n\n(also in b4 \"this ain't an airport, you don't have to announce your departure\")",
        "num_comments": 93,
        "comments": [
            "New phone, who dis ? (Have a great life)",
            "Hasta la sagna, don’t get any on ya",
            ">also in b4 \"this ain't an airport, you don't have to announce your departure\"\n\nJust because you don't have to, doesn't mean you can't. But departure announcements are much like airport ones - there will always be only so many people who care. Thanks for your work and all the best!",
            "I mean, will miss you man. Take care of yourself. Hope you live a good life. You are still a member though right? Come, We'll call each other idiots in the comment section... As equals :D",
            "I don't know you, but that doesn't matter. Farewell, stranger, and enjoy your life.",
            "This ain't the airport, you don....shit beat me to it",
            "You're a goddamn idiot and I hope you have a based retirement from being the good mod that you've been.",
            "I'm old too, can I get my meds now and watch songs of praise with a cup of tea?",
            "Like Steve off the Internet, or whatever the fuck that worthless slug’s name is. He banned me for rickrolling of all things, just because he didn’t like it. No warning. Banned. I appreciate your work.",
            ">(also in b4 \"this ain't an airport, you don't have to announce your departure\")\n\nAnd on your way out the door, you invented the cumforward. Why not skeet into existence a new subreddit, with new mods, and blackjack and hookers?"
        ]
    },
    "r/clevercomebacks is recruiting mods": {
        "title": "r/clevercomebacks is recruiting mods",
        "score": 95,
        "url": "https://www.reddit.com/r/clevercomebacks/comments/14icdrm/rclevercomebacks_is_recruiting_mods/",
        "content": "Hey everyone\n\nYou don't really see much from me, which is a testament to how great of a job u/TheGreatZarquon did of keeping everything under control all these years. But with his stepping down it's become a bit apparent just how much he did. \n\nNo point in writing some long essay or whatever, but if you'd like to be a mod then fill out [this google form](https://docs.google.com/forms/d/e/1FAIpQLSfQ39Cdh0GRys5oH8bdbRaa0K6xK9Zoc6O21Q0e8I1IPawtsw/viewform?usp=sf_link). It's not too intense and most of the questions are aimed at just figuring out your mod style to make sure you fit in with the direction we want for the sub, which is pretty much the status quo of what those of you who spend some time here would be familiar with.\n\n(Anybody applying who's flaired as a karma farmer spotter or bot hunter, make sure to include that)",
        "num_comments": 25,
        "comments": [
            "Is this why so many people get away with breaking the rules and nothing happens?",
            "Hello. No life haver here.",
            "I'm more than willing to help though only on week days 8:00am to 1:00am sorry if its inconvenient",
            "This clevercomebacks hs become too much of a political platform more often than not instead of it’s original intent IMO",
            "90% of mods just want a power trip and ban for no fucking reason... This whole site is nothing but a toxic cesspool..",
            "ok- I can delete all the unclever strawman and whataboutism comebacks,  but then this place will be empty",
            "How much can i charge for my duties?",
            "will act arbitrarily for food",
            "No I'm 2 we 4w nox no 2",
            "You can charge as much as you want"
        ]
    },
    "My thumb is the size of a nuke explosion": {
        "title": "My thumb is the size of a nuke explosion",
        "score": 48529,
        "url": "https://i.redd.it/gl81ll40we9d1.png",
        "content": "",
        "num_comments": 665,
        "comments": [
            "So we are all just gonna ignore the fact that both the car and burger are bigger than the freaking sun and moon! 🤯",
            "Ducking Enoch? Using the Hebrew Bible brother? What other heretical script are you planning to use?",
            "This is obviously dumb. But the fact that the sun and the moon are the same size from our point of view despite their vast difference in size and distance is a total coincidence.",
            "\"these cows are small, but the ones out there are far away\"",
            "The Bible line seems more metaphorical then literal",
            "Im pretty sure it isn’t sevenfold but that’s small part of the issue",
            "This cow is small that cow is far away .",
            "Omg! How are you holding that? Your hands are huuuge!",
            "“You’re never going to believe the size of my cock”",
            "I am so sick of slowing down for people who believe folklore and fairytales not only happened but that their interpretation of it supersedes societal laws and wisdom."
        ]
    },
    " The benefits of poverty !!! ": {
        "title": " The benefits of poverty !!! ",
        "score": 661,
        "url": "https://i.redd.it/c5oe4epmlh9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Don't forget the internet and video games. Between games like Minecraft, no man's sky, arc, etc, where you call explore for hours and never see the same thing is quite easy.",
            "Traveling is great, but years ago people didn't travel at all and were just as happy. There are poor people who, although they wish for more wealth, are happy",
            "I mean if it wasn't for poverty it would be people. There's always other people going to places I want to go to.",
            "This comeback is both clever and painfully relatable.",
            "Clever and witty response, definitely unexpected!",
            "Not everyone can afford to globe-trot. Virtual adventures and local joys are underrated.",
            "poverty. or maybe not their thing. hehe",
            "The internet itself is also an incredible tool for exploration - you can dive deep into niche topics, discover new cultures, or even explore real-world locations through virtual tours and street view maps.",
            "True, virtual worlds offer endless adventures without leaving the comfort of home.",
            "It's correct. But i believe the most difficult is poverty."
        ]
    },
    "Crazy how that works!": {
        "title": "Crazy how that works!",
        "score": 25908,
        "url": "https://i.redd.it/ga75tajf0d9d1.jpeg",
        "content": "",
        "num_comments": 805,
        "comments": [
            "Well yeah, you were a kid so you didn’t know it was political. I mean when Princess and the Frog came out there was some outrage about being too woke and having a black princess was somehow placating to minorities.",
            "The sheer audacity of using the Princess and the Frog as an example. So much ink and outrage was spent bitching about a black Disney princess.",
            "Everything has a audience, Disney is just trying to get as many of those audiences hooked, simple",
            "None of Disney's movies today would be considered political if the Republican party hadn't gone off the deep end and weren't looking everywhere to inflame the culture war",
            "The difference between now and then is that there wasn’t an army of internet grifters making money off of griping about it",
            "If these shows/movies were released today they would 100% be called woke and would receive backlash by the people who don't like anyone that's not white. TF is this post?",
            "But do you all notice that these were original stories with obvious care put into their crafting opposed to the current trend of remaking movies and slapping minorities on them? \n\nThe issue is that current Disney is creatively bankrupt, so when they do this, it comes off as nothing but box ticking because all their products are nothing but corporate box ticking these days.",
            "Did they really claim that Princess and the Frog was “not trying hard to be inclusive”? When it came out the only thing you ever heard about it was “first black Disney Princess”. It’s a joke to claim that there wasn’t an inclusivity effort involved",
            "I realized in my 20s that the 'good old days' and 'back when times were simpler' were really just people's childhoods that had decent parents.",
            "I remember the rumor that Disney shelved Hunchback of Notre Dame in order to make Lion King because they wanted to make a movie about Africa. \n\nPeople been talking about this since at least 1994"
        ]
    }
}