{
    "Weekly Question Thread: Ask your questions in this thread please": {
        "title": "Weekly Question Thread: Ask your questions in this thread please",
        "score": 3,
        "url": "https://www.reddit.com/r/climbing/comments/1dqkb8i/weekly_question_thread_ask_your_questions_in_this/",
        "content": "Please sort comments by 'new' to find questions that would otherwise be buried.  \n\nIn this thread you can ask any climbing related question that you may have. This thread will be posted again every Friday so there should always be an opportunity to ask your question and have it answered. If you're an experienced climber and want to contribute to the community, these threads are a great opportunity for that. We were all new to climbing at some point, so be respectful of everyone looking to improve their knowledge. Check out our subreddit wiki that has tons of useful info for new climbers. You can see it [HERE](https://www.reddit.com/r/climbing/wiki/beginnersguide)  \n\nSome examples of potential questions could be; \"How do I get stronger?\", \"How to select my first harness?\", or \"How does aid climbing work?\"  \n\nIf you see a new climber related question posted in another subReddit or in this subreddit, then please politely link them to this thread.  \n\n[Check out this curated list of climbing tutorials!](https://www.reddit.com/r/climbing/comments/6iuccx/rclimbing_lets_curate_a_list_of_climbing_tutorials/)  \n\n[Prior Weekly New Climber Thread posts](https://www.reddit.com/r/climbing/search?q=Weekly+New+Climber+Thread&restrict_sr=on&sort=new&t=all)  \n\n[Prior Friday New Climber Thread posts (earlier name for the same type of thread](https://www.reddit.com/r/climbing/search?q=Friday+New+Climber+Thread&restrict_sr=on&sort=new&t=all)  \n\n[A handy guide for purchasing your first rope](https://www.reddit.com/r/climbing/comments/bc7qke/lets_talk_about_buying_your_first_rope_a_buying)  \n\n[A handy guide to everything you ever wanted to know about climbing shoes!](https://www.reddit.com/r/climbing/wiki/shoes)  \n\nAsk away!",
        "num_comments": 58,
        "comments": [
            "Not a question. But recently someone posted to r/memphis  about an abusive employee at Memphis Rox. If you have any experiences please seek out the post. Or tell someone.",
            "I was setting a boulder on my gym’s spraywall at 10 degrees overhang because my body was feeling weak. On one attempt, I was already pulling on a starting crimp on my left hand when I heard and felt a crunch (not a pop!) from pip to fdp in my left middle finger. I was scared for a minute, but I had no pain or tenderness. Tried palpating the finger, pulling on crimps with my feet on the floor, even doing some hangs on the beastmaker 2000 small edge, but I felt no pain or soreness or tenderness in the finger. Got to the last part of the boulder (don’t know what to do for the finish yet) and still no pain. However I’m still curious as to what it was.",
            "Who makes the best climbing brushes these days?\n\nI used to love Sublime, but they went out of business during the pandemic. I haven't found anything that matches them.",
            "Why ate footholds are more slippery when its hot in the climbing gym?",
            "I'm looking for areas/trips that would blend my three current hobbies: Climbing (both sport and bouldering), MTB'ing (trail/enduro), and offroading/camping.\n\nI'm in the SF Bay area.  I know this whole state is ripe with opportunities for all thee hobbies.  But finding good areas that could blend all three is harder to find.\n\nI'd be happy with just offroading and bouldering.\n\nAny suggestions?\n\nI'm imagining a ideal trip where I do light offroading (forest roads+) out to the back country, get some solid bouldering in, camp by a mountain lake, rinse repeat.",
            "https://preview.redd.it/4532kodi4d9d1.jpeg?width=4080&format=pjpg&auto=webp&s=21f8140a7cf36aa6d32edc20dcb7bfb1b1532f4f\n\nIs this repairable?",
            "Vedauwoo route suggestions:  Looking for info on quality Vedauwoo cracks, 5.7 to 5.9, that don't have any off width.  Looking for fingers or hands mostly.  Short sections of fist crack or chimney is OK.  Any responses much appreciated.",
            "Permanent jewelry + climbing safety? \n\nMy friends are going to get permanent jewelry tonight. (Basically dainty chains fixed around your wrist or ankle, with no clasps.)\n\nI want to get an anklet, tightly fitted. Has anyone else climbed with anklets? Are there any problems or safety issues I need to consider? I always take my rings off when I climb, and only wear short necklaces and stud earrings. If it comes down to it I will prioritize climbing over pretty dainty jewelry lol. But am I overthinking it?",
            "Im a good climber but I’m terrified of lead falls and get sloppy on lead because I’m so desperate for a clip. I’ve taken tons of whippers in gyms but outside I haven’t fallen once because I don’t climb the grade I know I can (10c). What are some quick tips? Breathing exercises?",
            "At what grade do I start attracting women with my climbing? Breaking into the 12s outdoors and only men are paying attention to me...what do?"
        ]
    },
    "Daily Discussion Thread: spray/memes/chat/whatever allowed": {
        "title": "Daily Discussion Thread: spray/memes/chat/whatever allowed",
        "score": 0,
        "url": "https://www.reddit.com/r/climbing/comments/1dqgxpu/daily_discussion_thread_spraymemeschatwhatever/",
        "content": "Welcome to /r/climbing's Daily Discussion Thread, a thread for questions and comments everyone wants to make but don't warrant their own thread.\n\nPlease note: if you see a post that is of low quality hit report under the post for automoderator action.\n\nHave a question about what color carabiner speaks to your soul? Want to talk some smack about pebble wrestlers? Wondering how chalk buckets work? Really proud of that thing you did? Just discover a meme older than most of our users? Awesome! Post that noise here.\n\n**New** if you are unaware, there are many other climbing subreddits. Here are links to them, please check them out! They need your posts and comments.\n\n* /r/Alpinism\n* /r/Bouldering\n* /r/Buildering\n* /r/Caving\n* /r/ClimbHarder\n* /r/Climbergirls\n* /r/ClimbingCircleJerk\n* /r/Climbingpartners\n* /r/CompetitionClimbing\n* /r/ClimbingPorn\n* /r/ClimbingVids\n* /r/IceClimbing\n* /r/Mountaineering\n* /r/RockClimbing \n* /r/Routesetters\n* /r/TradClimbing\n* /r/urbanclimbing\n\n**NEW-ish** \n\n* Are you American? You can help [save Oak Flat from development by contacting your elected representative](https://p2a.co/v1gfRgb?fbclid=PAAabAisnGD3qw5g0XtovRzdjv4rsxfDexotSDI1L2592Z79wYfBE5Z4VZVHo) through this link. It's quick and easy and you would be helping a great cause.\n\n* Please consider supporting [Camp 4 camping reservation reform](https://www.change.org/p/save-yosemite-s-camp-4-again)\n\n* [Save LCC Thread](https://old.reddit.com/r/climbing/comments/12l2436/action_alert_save_little_cottonwood_canyon/)\n\n**If you have a more serious question about climbing gear, technique, systems, etc. check out our [Weekly New Climber Thread.](https://www.reddit.com/r/climbing/search?q=%22Ask+your+questions+in+this+thread+please%22&restrict_sr=on&sort=new&t=all)**",
        "num_comments": 9,
        "comments": [
            "I released my short doc \"Desert Leather\" today. It's a follow up to the 2020 doc I made about the first ascent of \"Big Game Hunter.\"\n\nThis time we visit Wadi Rum in hopes of developing another big route. \n\n[Watch \"Desert Leather\" Here](https://youtu.be/xlSVFy-IDsY?si=EHgLnRmyk-hC_uDb)",
            "A few weeks ago I published a route on mountain project and it shows up on the website but it hasn't shown up in the app yet. I've made sure to keep up with the updates. Does anybody know how long that usually takes?",
            "https://preview.redd.it/kws3gr5dnf9d1.jpeg?width=3024&format=pjpg&auto=webp&s=463bd61a61aa769be135fbf0ceca5ff224e472ce\n\nIs this rope cooked? I’ve cut the ends off in the past, burnt the edges, and covered with tape. Now after a year or so, the tape has come off the threads are coming out. Would it be safe to just cut this down and use it as a gym rope?",
            "Have you updated the state download in-app? This gets me, too. Annoying.",
            "Give it a week or so. It takes awhile for it to be uploaded to the Mtn Proj app. I frequently comment and post pictures to keep things up to date in my area and I notice a pretty big delay from when I post on the website to when I finally can view it on the app\n\nEdit: Woke up from my nap and realized you said you posted a couple of weeks ago. I believe it may also have something to do with admins as well",
            "You might be able to milk the core strands back under the sheath and then cauterize it.",
            "Cut the bad bit off and burn the end like you usually would. Really burn it until it's black to seal it properly",
            "Yes, that's what I meant by updates"
        ]
    },
    "I designed a rotating hangboard. Thoughts?": {
        "title": "I designed a rotating hangboard. Thoughts?",
        "score": 1450,
        "url": "https://v.redd.it/ynucaxzp3b9d1",
        "content": "",
        "num_comments": 135,
        "comments": [
            "I think you should have filed a patent or at tech disclosure before you posted the video!",
            "Really great idea! Hope it takes off! Good luck",
            "Bro, patent that idea! This is great",
            "Additive manufacturing is fuckin cool, dope concept my guy! Since I’m shit with tech and will probably never create it myself, I’ll just throw my idea at you, ever thought of a variable pitch feature for a hangboard? I’ve thought of a few different ways of doing it, just seems like something fun to add to the old training standby.",
            "This is cool! My favorite aspect is that your system is on a rail, so I can train 20mm 4 finger half crimp and 30mm 3 finger drag with the same distance between my hands. My least favorite aspect of the Beastmaker is that I cannot do that. Nice innovation!",
            "Patent that.  I don't climb but I would buy these.",
            "Dude that's fucking awesome! Great idea ;)",
            "Really awesome! One thing, if you're looking for ideas, is that you could add the difference in angle in degrees around the rim, so that you could match up the hold precisely.",
            "Take my money!!",
            "Great idea"
        ]
    },
    "Cruxing on the Evictor, 5.12+, Eldorado canyon.": {
        "title": "Cruxing on the Evictor, 5.12+, Eldorado canyon.",
        "score": 191,
        "url": "https://i.redd.it/yvq9on6wmb9d1.jpeg",
        "content": "Josh Finkelstein goes big on the Rincon classic trad line.",
        "num_comments": 16,
        "comments": [
            "Great photo, though the editing is tripping me out a bit.",
            "That’s a good try hard face",
            "That's a dope line. Loved the footage from Scary Faces. That finger locks looks absolutely impossible.",
            "**The Evictor** [Fixed Hardware\n                                                (2)]\n\nType: Trad\n\nGrade: 5.12+^^YDS | 7c^^French | 28^^Ewbank | IX^^UIAA\n\nRating: 3.9/4\n\nLocated in [Eldorado Canyon State Park](https://www.mountainproject.com/area/105744246), [Colorado](https://www.mountainproject.com/area/105708956)\n\nhttps://www.mountainproject.com/route/105752338\n\n-----\n\n[Feedback](https://docs.google.com/forms/d/e/1FAIpQLSchgbXwXMylhtbA8kXFycZenSKpCMZjmYWMZcqREl_OlCm4Ew/viewform?usp=pp_url&entry.266808192=https://reddit.com/r/climbing/comments/1dqkpta/cruxing_on_the_evictor_512_eldorado_canyon/) | [FAQ](https://github.com/derekantrican/MountainProject/wiki/Bot-FAQ) | [Syntax](https://github.com/derekantrican/MountainProject/wiki/Bot-Syntax) | [GitHub](https://github.com/derekantrican/MountainProject) | [Donate](https://www.paypal.me/derekantrican)",
            "Rob Kepley photo",
            "Making it look easy.",
            "I love that shot!",
            "I love this photo.",
            "I used to look at this photo when I was working the line and needed inspiration. I fell off that move on red point at least a half dozen times before I finally stuck it and pulled through.\n\nKiller photo Rob, as always.",
            "That finger lock looks super secure and bomber!"
        ]
    },
    "Request was made to crosspost this thread from /r/Memphis concerning inappropriate behaviour in one of the climbing gyms in that city": {
        "title": "Request was made to crosspost this thread from /r/Memphis concerning inappropriate behaviour in one of the climbing gyms in that city",
        "score": 105,
        "url": "https://www.reddit.com/r/memphis/comments/1dpyspc/can_we_talk_about_memphis_rox/",
        "content": "",
        "num_comments": 26,
        "comments": [
            "holy shit there are so many commenters with awful awful stories",
            "One of the comments mentioned that this is a free climbing gym, implying it attracts more creepy lurker types than a standard use-fee gym. Interesting. I don’t want to derail the poor behavior topic, but how does this business model work? Temporary grants?",
            "Kindly remember to behave appropriately on other subreddits that get linked to /r/climbing. It is important that we respect their community and while it is normally acceptable to comment, hot takes and critiques are often not welcome. Poor behaviour on either subreddit will likely lead to a ban of those involved. Thank you for staying classy /r/climbing.",
            "Why doesn't anybody name him outright?",
            "Yea, seems that 10+ people all allude to the same guy but don’t outright name him. Need to get his name out there. One of the benefits of the anonymity of Reddit.",
            "Yeah that gym sounds like a hellhole",
            "Memphis Rox is a climbing gym and community center located in a low income neighborhood. It is free but also donation based. Their income primarily comes from donations and sponsorships. Those that can afford to pay get charged about $20 for a day pass and memberships are available too. However, residents who cannot afford to pay are welcomed to all the facilities.",
            "It's the only non profit gym in the country. Donations",
            "I pay a standard membership which is $40/mo. It’s not really free unless you ask for it to be free. Even then, I’m pretty sure they just started implementing $1 for shoe rental, which they weren’t enforcing before.",
            "I’ve been really curious myself. \n\nSeen one guy with a name that starts with K and another reffered to as Q. \nAlso someone is sponsored by ESPN and got to climb with Honnold in Nevada."
        ]
    }
}