{
    "Original Cocktail Competition - June 2024 - Cucumber & Basil": {
        "title": "Original Cocktail Competition - June 2024 - Cucumber & Basil",
        "score": 13,
        "url": "https://www.reddit.com/r/cocktails/comments/1d5ehii/original_cocktail_competition_june_2024_cucumber/",
        "content": "**This month's ingredients: Cucumber & Basil**\n\n---\n\n**Next month's ingredients: Cinnamon & Tequila**\n\n---\n\nHello mixologists and liquor enthusiasts. Welcome to the monthly original cocktail competition.\n\nFor those looking to participate, here are the rules and guidelines. Any violations of these rules will result in disqualification from this month's competition.\n\n1. You must use both of the listed ingredients, but you can use them in absolutely any way or form (e.g. a liqueur, infusion, syrup, ice, smoke, etc.) you want and in whatever quantities you want. You do not have to make ingredients from scratch. You may also use any other ingredients you want.\n\n2. Your entry must be an original cocktail. Alterations of established cocktails are permitted within reason.\n\n3. You are limited to one entry per account.\n\n4. Your entry must include a **name** for your cocktail, a **photograph** of the cocktail, a **description** of the scent, flavors, and mouthfeel of the cocktail, and most importantly a list of **ingredients** with **measurements** and **directions** as needed for someone else to faithfully recreate your cocktail. You may optionally include other information such as ABV, sugar content, calories, a backstory, etc.\n\n5. All recipes must have been invented after the announcement of the required ingredients.\n\nAs the only reward for winning is subreddit flair, there is no reason to cheat. Please participate with honor to keep it fun for everyone.\n\n---\n\n**Please only make top-level comments if you are making an entry.** Doing otherwise would possibly result in flooding the comments section. To accommodate the need for a comments section unrelated to any specific entry, [**I have made a single top-level comment that you can reply to for general discussion.**](https://old.reddit.com/r/cocktails/comments/1d5ehii/original_cocktail_competition_june_2024_cucumber/l6ku6ut/) You may, of course, reply to any existing comment.\n\n---\n\nHow you upvote is entirely up to you. You are absolutely encouraged to recreate the shared drinks, but this may not always be possible or viable and so should not be considered as a requirement. You can vote based on the list of ingredients and how the drink is described, the photograph, or anything else you like.\n\n#Do not downvote entries\n\nWinners will be final at the end of the month and will be recorded with links to their entries in this post. You may continue voting after that, but the results will not change. There are 1st place, 2nd place, and 3rd place positions. 2nd place and 3rd place may receive ties, but in the event of a 1st place tie, I will act as a tie-breaker. I will otherwise withhold from voting. Should there be a tie for 2nd place, there will be no 3rd place. Winners are awarded flair that appears next to their username on this subreddit.\n\n---\n\n[Here is a link to last month's competition.](https://old.reddit.com/r/cocktails/comments/1chcrma/original_cocktail_competition_may_2024_gin_tonic/) The winners are listed in the post with direct links to their entries.",
        "num_comments": 5,
        "comments": [
            "If you want to make a top-level comment that is not an entry, please do so in reply to this comment for organizational reasons.",
            "Basil and cucumber are favorite summery cocktail ingredients. Since I just obtained a new carbonation device (Omnifizz), I was eager to use it for this challenge. \n\nApple juice seemed like a suitable liquid to accompany the assigned ingredients, and I toyed with gin but landed on a rum mix for the alcohol. I also just obtained malic acid to jump on the superjuice train, so I worked that in as an acidic adjustment for the juice. \n\n[SEERSUCKERPUNCH](https://kindredcocktails.com/sites/kindredcocktails.com/files/styles/large/public/pictures/cocktail/seersuckerpunch%201.png)\n\nIn a shaker tin, muddle \n\n* 6 slices cucumber \n\nwith \n\n* a pinch of salt \n\nand a \n\n* scant 1/4 teaspoon malic acid\n\nAdd\n\n* 1 oz. Wray and Nephew (or other overproof Jamaican) rum \n* 3/4 oz. Flor de Cana 4 (or other white column-still) rum\n* 1/2 oz. apple juice\n* 3/4 oz. basil syrup\\*\n\nand ice and shake. \n\nFine strain and carbonate. \n\nServe in a coupe or Nick and Nora. Smack the leaves of a basil sprig, stab it into a cucumber slice, and float it as a garnish. \n\n\\*Basil syrup: Heat 1/2 c. sugar and 1/2 c. water with 10-12 basil leaves until simmering, stirring to dissolve the sugar. Cut heat and let steep 30 minutes. Strain. \n\nThe drink is a clearish light lime green color, Gatorade-esque. Nose is subtle (spanking the basil is important). \n\nGarden freshness and tart apple in the sip. There’s a bit of bitterness, perhaps somewhat from the muddled cucumber skin, but probably mostly the carbonic acid, that gives this a bite quite reminiscent of tonic water. The empty class with beached garnish smells terrific. \n\nThe name is a portmanteau of seersucker (the summery fabric) and suckerpunch (since it's deceptively strong with the overproof rum). \n\nThe drink would probably work equally well served in a tumbler full of ice. It would be a good drink to batch and bring to a summer party.",
            "[**Cirrus**](https://imgur.com/a/bHIYQu9)\n\n* 45ml dry gin, pref. Plymouth\n* 22.5ml Luxardo Bitter Bianco\n* 15ml dry vermouth, pref. Cocchi\n* 7.5ml verjus blanc\n* 3 slices cucumber\n* 3 basil leaves\n* basil leaf, for garnish\n\n*Muddle, stir, strain, coupe, garnish.*\n\nThis month's ingredients were screaming for me to do some kind of highball, but as I'd done that last month and wanted to be a bit more creative I instead started from a Martini. This swiftly grew to involve the Bitter Bianco when I felt that a bit of sugar would benefit the drink alongside the cucumber and basil as well as bring some complimentary botanicals and thus a bit more depth. I added the verjus at the last minute hoping it would bring some brightness, which it did. The result is a slightly cloudy but very much still Martini-coded stirred drink, just off-dry. The name came from the hazy clouds you often see on hot, dry days - when I would want to drink this in an evening.",
            "# [Flor de Humo](https://imgur.com/a/ySaSlP9)\n\n* 1 1/2 oz Mezcal joven\n* 1/2 oz St\\~Germain\n* 3/4 oz Lime juice\n* 1/2 oz Simple syrup\n* 4 slices of Cucumber\n* 4 leaves of Basil\n* Cucumber slice, for garnish\n\nMuddle, shake, and strain into chilled cocktail glass. Garnish with cucumber slice.\n\nNose: Cucumber and light smoke\n\nMouthfeel: Medium-light body with cooling effect from cucumber\n\nTaste: Opens wit roasted agave and tart lime. Quickly moves to cucumber and finishes with basil and elderflower.\n\nApproximately 14% ABV and 4.91 oz. 15g of sugar.\n\nFirstly, I was not intending to enter the competition this month. I try to grow all my own herbs and my basil plant didn't do very well this year. However, I cooked a pasta that called for basil and I had a bunch leftover, so I figured I would give it a try if for no other reason than to be creative. I'm entering very late, so I don't expect to win, but my recipe came out so well that I figured I would share regardless!\n\nI am not sure exactly why, but these ingredients screamed tequila/mezcal to me - the cucumber more than the basil. I chose mezcal since I don't often make drink recipes with it. Mine is a pretty light tobala with light smoke, so I thought it would be perfect. I find that mezcal works surprisingly well with floral notes (hence the name), so I added some elderflower liqueur. Finally, some citrus and sugar to bring it into sour territory.\n\nOverall, I'm super pleased with this recipe. The mezcal is present, but doesn't dominate and the other aromatic ingredients really play nicely together. Everything can be tasted individually if you focus hard enough, but they all blend together into a really nice floral, herbal, cooling mix. I think this is a perfectly refreshing drink to try as summer begins in earnest!",
            "# [Midsummer cooler](https://www.reddit.com/r/cocktails/comments/1dl6gih/midsummer_cooler_cocktail_competion/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nThe ingredients of this months cocktail competition, cucumber and basil really inspired me, since the are the basis of some of my favourite cocktails, such as the Gin Basil Smash or the Eastside. They are both fresh and aromatic and gin based, but since I wanted to make something new, I swapped the gin for akvavit. My choice of akvavit fell on Norrbottens Destilleri FUSION.004.Schnaps, which is flavoured with dill, caraway, batak pepper and fennel. A subtle and balanced akvavit which I would normally drink as is. Today is swedish midsummer's eve, so I found it fitting to make an akvavit cocktail for this event. In preparation for the cocktail I made acid adjusted cucumber juice and a basil syrup. The acid adjusted cucumber juice was made with about 4 grams of citric acid and 2 grams of malic acid, maybe a bit less. For the basil syrup I blended basil leaves in simple syrup and let steep for an hour or two. It was later finestrained.\n\n**Ingredients:**\n\n* 4cl akvavit\n* 3cl white wine (I used a flavourful bourgogne)\n* 3cl acid adjusted cucumber juice\n* 2cl basil simple syrup\n* Basil leaves (for garnish)\n\n**Method:**\n\nThe ingredients were poured into a glass oven dish and put in the freezer for two to three hours, until frozen to a slushy like consistency. It was then scooped into a chilled glass and garnished with basil.\n\n**Scent:**\n\nBasil and cucumber are really dominant on the nose. Fresh!\n\n**Mouthfeel:** Crisp and fresh. The slushy like consistency is a crowdpleaser, but maybe makes it a bit hard to drink. A drinking straw might be a good addition.\n\n**Taste:**\n\nThis cocktail is all about the herbs and the cucumber. When I made the juice I used the whole cucumber, skin and all, which I believe is important to get maximum flavour. The akvavit provides some spice and complexity, but is a background player. So is also the wine, but make sure to choose a flavourful wine since it might disappear into the background too much if not. I deliberately made the cocktail tart and sweet since I want it to be an easy drinking sipper for sunny days. It was fun to play around with these ingredients. Give it a shot!"
        ]
    },
    "Elusive Dreams": {
        "title": "Elusive Dreams",
        "score": 66,
        "url": "https://i.redd.it/4c0pqdipce9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "A cocktail by Demi Natoli found in the book Easy Tiki. The original is a bit too sweet for me, I only put 1/2oz of cinnamon syrup instead of 3/4oz.\n\n* 1oz Pineapple Rum\n* 1oz Havana 3 Rum\n* 1oz Pineapple juice\n* 3/4oz Lime juice\n* 1/2oz Cinnamon syrup\n* 1/2oz Banana liqueur\n\nCombine all the ingredients in a shaker with ice and shake until chilled. Strain in a coupe and garnish with pineapple fronds.",
            "One of my wife’s favorites!",
            "Love all of these ingredients. Will definitely try!",
            "This sounds amazing",
            "When will the trade embargo end?",
            "Don't worry about your empty bottle of Stiggins Fancy, the SAQ just received a new batch!\n\nNice drink and picture. \n\nHow do you get your fronds to hold like this?",
            "Thank you!\n\nNo worries, I have another one in the bar and I will order Smith+Cross this week.\n\nFor the fronds, I cut the soft part of the base. Then place them at an angle together, and make an incision just long enough to hold in place (1.5cm)",
            "Wow, nice trick, I'll try it. I'll try the drink too. I have fresh pineapple juice that I just made, sadly I only have Bols crème de bananes :(\n\nEdit: I got my Smith & Cross from a friend from Ontario 2 weeks ago."
        ]
    },
    "First Paper Plane": {
        "title": "First Paper Plane",
        "score": 25,
        "url": "https://i.redd.it/1fau42s4ae9d1.jpeg",
        "content": "First Paper Plane, great summer cocktail. Last fall I acquired a Bardstown Bourbon finished in Amaro Nonino barrels and it was so delicious I had to make these.\n\n3/4 oz Wild Turkey Rare Breed\n3/4 oz Amaro Nonino\n3/4 oz Aperol\n3/4 oz fresh squeezed lemon juice\n\nShaken over ice for 15 seconds and garnished with my daughter’s mini paper planes.\n\nI like the higher proof bourbon for my cocktails, what do you typically use?",
        "num_comments": 10,
        "comments": [
            "Pour both of those in one glass\n\nAlso never tried that high proof in a PP. very interesting",
            "Bro that wash line is killing me\n\nAlso I’d double strain",
            "I use rare breed too. I find it helps balance things. Cheers!",
            "Jim Beam Black or Devil’s Cut.",
            "I like Old Grand Dad for this one. I might be mistaken, but I think that was the bourbon first used for this cocktail.",
            "I like Old Forrester 100, or if I’m feeling saucy I just use Rittenhouse Rye.",
            "I like Evan Williams and WT 101. And smaller glasses.",
            "Try it with Booker's. Top notch",
            "Only have 8 oz glasses, but I hear ya.",
            "Looks like you gotta drink two cocktails in one then. I don’t make the rules."
        ]
    },
    "Tasteing what you made before serving?": {
        "title": "Tasteing what you made before serving?",
        "score": 102,
        "url": "https://www.reddit.com/r/cocktails/comments/1dqksdo/tasteing_what_you_made_before_serving/",
        "content": "Was on a cruise where there was a craft bar and the bartenders were really good. I noticed that the head bartender would taste the cocktails he made off menu by using a bar spoon to put a bit on his hand and taste testing before serving. Some people there were not ok with this, but I was served some of the best cocktails I ever had.  However I have never seen this before anywhere.\n\nHow common is this tasting before serving?\n\nAnd how clean is it?",
        "num_comments": 108,
        "comments": [
            "Pretty common especially when I order something they've never tried, however I've only ever seen them use a straw to \"scoop\" out a small amount of the drink to sample.",
            "Very common in proper cocktail bars. Just like chefs taste all the food you make sure it’s right, bartenders check their drinks.   They are checking for balance of flavors (every lemon is different for example) and proper dilution.  I would say the tasting is the exact reason they were some of your best cocktails!  And it’s perfectly clean and hygienic as they don’t contaminate your drink in any way.",
            "Tasting before serving is fairly common. Licking it off one's hand seems to be more European than N. American. We tend to use stirring straws.",
            ">the head bartender would taste the cocktails he made off menu by using a bar spoon ...  Some people there were not ok with this\n\nRemind those people that the head chef (or their second) is likely tasting their food before it comes out of the kitchen at a higher end restaurant. They just can't see it happening. It is called Quality Control and its a good thing - it means the bartender cares what goes out and wants things to adhere to a certain standard.",
            "Maybe it's just the way he was taught? I went through a bartending course for fun a few weeks ago and the instructor (who worked at some pretty high end hotels, yachts, and other high class bars) tasted his cocktails this exact same way (using a bar spoon to drop a few drops onto the bank of his hand and then tasting it off his hand)\n\nIn other bars I've been to though,  I've seen the bartender use a straw to take out a sample (by dipping the straw into the drink, covering the top with a finger, and then pulling the straw out to taste the drink from the bottom of the straw), so maybe both are ok and are just dependent on what they were taught as they progressed through their careers.",
            "0_o  This is 100% standard at any decent cocktail bar. The people objecting have never had a cocktail outside of TGI Fridays.",
            "I went to a few very nice speakeasies in Osaka, Japan. I picked up this trick there!\n\n100% approve. Its clean too, he’s not licking the spoon he’s putting it on his hand",
            "Super standard. Who are these people who were not ok with this wtf?",
            "I was taught taste every cocktail you put out. \n\nMetal bar straw. Thumb over the end. Dip, sip, discard the straw (to wash) \n\nNot tasting it is scumbag behaviour ",
            "I use 5” straws made of hay for this purpose. Works great! https://www.amazon.com/dp/B07F9LHX3C"
        ]
    },
    "Happy Medjed": {
        "title": "Happy Medjed",
        "score": 17,
        "url": "https://i.redd.it/z7a0xqd3vd9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "**Happy Medjed**     \n1 1/2 oz Sahara Date Brandy     \n1 oz Whole Milk      \n1 tsp White Creme de Menthe     \n1/2 oz tsp Rich Honey Syrup    \n1/4 tsp Kummel     \n\n1. Draw eyes and eyebrows upside-down on the outside of a Nick & Nora glass with a black food-safe marker, and put the glass in the freezer.  \n2. Shake all ingredients with ice and strain into the decorated glass."
        ]
    }
}