{
    "[MOD] The Daily Question Thread": {
        "title": "[MOD] The Daily Question Thread",
        "score": 2,
        "url": "https://www.reddit.com/r/Coffee/comments/1dr7t8h/mod_the_daily_question_thread/",
        "content": " \n\nWelcome to the daily [/r/Coffee](https://www.reddit.com/r/Coffee) question thread!\n\nThere are no stupid questions here, ask a question and get an answer! We all have to start somewhere and sometimes it is hard to figure out just what you are doing right or doing wrong. Luckily, the [/r/Coffee](https://www.reddit.com/r/Coffee) community loves to help out.\n\nDo you have a question about how to use a specific piece of gear or what gear you should be buying? Want to know how much coffee you should use or how you should grind it? Not sure about how much water you should use or how hot it should be? Wondering about your coffee's shelf life?\n\nDon't forget to use the resources in our [wiki](http://www.reddit.com/r/Coffee/wiki)! We have some great starter guides on our [wiki \"Guides\" page](https://www.reddit.com/r/Coffee/wiki/guides) and [here is the wiki \"Gear By Price\" page](http://www.reddit.com/r/Coffee/wiki/gear#wiki_coffee_gear_suggestions) if you'd like to see coffee gear that [/r/Coffee](https://www.reddit.com/r/Coffee) members recommend.\n\nAs always, be nice!",
        "num_comments": 8,
        "comments": [
            "I’ve just ordered a breville express impress. Any additional accessories that anyone would recommend to get?",
            "Why does my moka pot coffee tastes so sour? I put boiling water in it, I turn down the heat once the coffee starts coming in. And I fill the filter part but don't tamper it down. I use good coffee, except I don't grind it freshly, the barista in my local coffeeshop ground it specifically for moka pot when I bought it (2 weeks ago). Is it that the coffee is too old now? Or is it my technique? Please 🙏 help",
            "What might be causing a liquorice type flavour? Over extraction? It happens now and again regardless of bean type, grind size, method.\n\nAlso while I'm here, my V60 runs way too fast even if I've ground so fine that the grinder struggles. Any ideas?",
            "I Moka Pot my coffee fairly regularly. I also French Press and auto-drip my coffee regularly. My wife does not like MP or FP coffee. She thinks they are too much a knock in the jaw. Have you compared MP to FP or auto-drip? It could be not to your liking.",
            "Several years ago I gave my wife a DeLonghi coffee machine for Christmas and she loves it because she's never used it, I aways make the coffee...\nThis year for my Birthday she \"allowed\" me to pick a new machine... a duotemp pro, I chose it because it seems to be bomb-proof with few gadgets to go wrong down the line and it was on offer @ £299.\n\nPaired with the sage grinder I got for Christmas (with bean subscription) it makes for a nice coffee corner...\n\nCan anyone give me a good recommendation for the starting point to grind and extract for this machine using the stock baskets, fresh roasted beans, aiming for a decent flat white and latte base?\n\nThanks in advance for any advice...",
            "If you can get a grinder and grind fresh it will greatly improve. I can't believe how long I waited to get a burr grinder which is 100x better than the cheap \"chopper blade\" kind. Unfortunately these start at $200, and 2x-3x for something quiet, low retention, and long life.\n\nRecently roasted is always best, between 7 and 30 days. ALWAYS buy coffee with a \"roasted on\" date, ignore those without and having \"best by\".\n\nSour usually indicates under-extraction, so the grind could go finer, assuming the beans are fresh and grind just prior.",
            "Try it with cool water instead.\n\nThe coffee isn’t too old; moka pots are pretty good at extraction and will get everything useful out of it.  \n\nYou could actually be getting *over*extraction, though, with the hot water.  There’s a thing called “bitter-sour confusion”, and it *might* just be so bitter that it’s fooling you into thinking it’s sour.",
            "Just found this sub. How does a sub with 1.8 million subscribers have this little activity?\n\nThe top post from this month has 260 upvotes."
        ]
    },
    "[MOD] What have you been brewing this week?/ Coffee bean recommendations": {
        "title": "[MOD] What have you been brewing this week?/ Coffee bean recommendations",
        "score": 9,
        "url": "https://www.reddit.com/r/Coffee/comments/1dqm3mz/mod_what_have_you_been_brewing_this_week_coffee/",
        "content": "Hey everyone!\n\nWelcome back to the weekly /r/Coffee thread where you can share what you are brewing or ask for bean recommendations. This is a place to share and talk about your favorite coffee roasters or beans.\n\nHow was that new coffee you just picked up? Are you looking for a particular coffee or just want a recommendation for something new to try?\n\nFeel free to provide links for buying online. Also please add a little taste description and what gear you are brewing with. Please note that this thread is for peer-to-peer bean recommendations only. Please do not use this thread to promote a business you have a vested interest in.\n\nAnd remember, even if you're isolating yourself, many roasters and multi-roaster cafes are still doing delivery. Support your local! They need it right now.\n\nSo what have you been brewing this week?",
        "num_comments": 15,
        "comments": [
            "Yoo, tried Coava's  Daurfusu Natural in a v60 and holy shit. First time trying coffee from East timor. It seriously tastes like pineapples and caramel.",
            "I've finally been getting into my Colombian variety set from Sweet Maria's after letting it all rest a couple weeks. Drinking some of the washed Chiroso right now, it's just fantastic. City+ roast, ground to about 300 microns and brewed at 1:18 in my V60 with Cafec abaca filters, with just two relatively turbulent pours and heavy stirring after the bloom and main pour, Very fruity in the cup with a thick, syrupy body. I'm in love. (:",
            "Finished the last of my Koru Espresso from Chocolate Fish, and the rest of the week has been Kahawa 1893 from Trader Joe's (pretty good budget brand!)",
            "This week I've been brewing a delicious Ethiopian Yirgacheffe from Blue Bottle Coffee. It's got such a lovely floral and citrusy taste, perfect for these summer mornings. I'm using my trusty Chemex to brew it. Anyone have any other bean recommendations? I'm always on the lookout for something new and exciting to try!",
            "I'm brewing a natural Rwanda from Corvus Coffee.  Tastes like berries, stone fruit, chocolate, and has a really nice finish to it.  I use my Chemex as always and have been drinking it black because it's so good as is, but I feel like it would also hold up nicely in a milk beverage!",
            "Paper Plane Coffee Co.'s dogma",
            "The Ethiopia Misty Valley from Chocolate Fish is great if you can grab a bag!",
            "I’ve picked up almost all of their bags in Montclair, the guji shakiso is the most stellar.",
            "That's what I had before the Koru and I agree, will definitely be getting more in the future. I want to try their Guatemalan options next though.",
            "I've been alternating between Blue Bottle's Moka Java Blend and Paradise Coffee's Hawai'i Island Blend. \n\nThe Blue Bottle is, as far as I can tell, a Sumatra blend. No Arabian coffee in the mix. It's still really nice and chocolatey. Reminds me of what originally drew me to their Bella Donovan way back when BB was still an indie company. \n\nParadise's Hawai'i Island Blend is intended as an espresso. I'm finding it's really nice coming from my Aeropress. \n\nWith both, I'm using an upside down Aeropress, water in the high 190s and about 1:20 immersion time before plunging."
        ]
    },
    "Traditional Cold Brew vs Sous Vide Cold Brew": {
        "title": "Traditional Cold Brew vs Sous Vide Cold Brew",
        "score": 10,
        "url": "https://www.reddit.com/r/Coffee/comments/1dr4cat/traditional_cold_brew_vs_sous_vide_cold_brew/",
        "content": "So I'm a hard cold brew person. During Covid around September 2020, I was helping a company trying to explore sous vide coffee as a potential product and measured the brix, caffeine level, etc. \n\nThe project ended up halting because the market for it was small but I recently saw an ad on youtube for sous vide cold brew. Is this becoming a thing within the coffee community now? It's also found in the sous vide community. Do any of ya'll actually do this or use it at shops? \n\nMy personal opinion is it makes a slight difference but I don't think sous vide coffee is worth doing the clean up after. I'd rather just do traditional cold brew method and stick with that. Thoughts? ",
        "num_comments": 14,
        "comments": [
            "We might have hit the point where even I feel like we've gone too far.",
            "Oughta be called warm brew.",
            "One piece of science kitchen gear I haven’t purchased yet is a VacMaster. I’d be really curious what the experience extracting at room temp under vacuum would produce.  I think those machines can even hold enough of a vacuum to boil at room temperature. ",
            "I tried it. I did the recommended Ball mason jars. My sous vide water kept ending up being coffee. No mater how tight the jars were they leaked.\n\nI gave up.",
            "I agree we tried it at our shop, It was good but it wasn’t anything so good that it was worth the hassle of setting it up, especially since regular cold brew is quite easy for us to do",
            "I've done it, I thought it was alright. Kinda not really drip and not really cold brew. \n\nI drank the whole jar I made, but didn't feel inclined to do it again 🤷🏻‍♂️",
            "Never seen the need for it myself, but I could see how fine tuning the temperature to the degree could yield some interesting results. Can they chill as well as heat?",
            "until you’ve experienced the subtleties of flavor brought out by individually vacuum sealing each bean for an eight hour sous vide in Antarctic glacial water, how can you possibly know?",
            "You’re just now hitting that point? I feel like we’ve been there for a while in the Coffee world",
            "Commercially available sous vide circulators can only heat. There's no need to cool when cooking meats, fish and veg as they all need heat to cook. And if course a hot liquid will simply cool down by itself when heating stops."
        ]
    },
    "Hello, I would like to learn about coffee tasting.": {
        "title": "Hello, I would like to learn about coffee tasting.",
        "score": 1,
        "url": "https://i.redd.it/e949z8n46i9d1.jpeg",
        "content": "\nI want to taste coffee and be able to distinguish the process, countries of origin, roast levels, and other characteristics that can be identified through coffee tasting. How should I train for this, and are there any books or resources for in-depth study that you could recommend?\n\nCurrently, I can identify general flavors in coffee by comparing them to my experiences with other foods, such as oranges, jackfruit, various floral aromas, etc.",
        "num_comments": 0,
        "comments": []
    },
    "Birmingham coffee festival cancelled a week before due the company going into liquidation": {
        "title": "Birmingham coffee festival cancelled a week before due the company going into liquidation",
        "score": 263,
        "url": "https://www.facebook.com/100041766532807/posts/pfbid0C32QkxepyAt4Q7AFnNCn1CJyxaHicmQCG1VaYkDUVMkhREtewtxeTAFU66T3QWxKl/?app=fbl",
        "content": "",
        "num_comments": 34,
        "comments": [
            "I spent a good amount of money to travel from another city for this. I'm so pissed at all of this lol. And we're not even getting a refund",
            "They were still taking payments today as well. Absolute scumbag move. \n\nHope all involved step on Lego.",
            "I have a lot of sympathy for anyone with a ticket but also spare a thought for the small roasters and other exhibitors who probably forked out thousands for the stands and other equipment and have also been boned.",
            "Birmingham in the UK, FYI",
            "They’ve become their desired state of matter.",
            "How much was a ticket price?",
            "i had signed up to volunteer and everything was still being organised yesterday, cancellation was literally out of nowhere",
            "All exhibitors/sponsers are getting fully reinbursed",
            "Thanks, live near the other one and had a /r/USdefaultism moment.",
            "I live in Birmingham AL and was so confused how this somehow flew under my radar"
        ]
    }
}