{
    "FAFSA/financial aid questions? Get help here!": {
        "title": "FAFSA/financial aid questions? Get help here!",
        "score": 1105,
        "url": "https://www.reddit.com/r/college/comments/pbs6uh/fafsafinancial_aid_questions_get_help_here/",
        "content": "**All questions about federal student aid, the FAFSA, and financial aid verification must be posted on this thread.**\n\nIf you want money for college, you should submit a [FAFSA](https://studentaid.gov/h/apply-for-aid/fafsa) if you are eligible to do so. [Click here](https://studentaid.gov/understand-aid/eligibility/requirements) to review eligibility requirements.\n\n2021-2022 school year: Use the 2021-2022 FAFSA, which opened October 1, 2020. Requires 2019 tax information.\n\n2022-2023 school year: 2022-2023 FAFSA will became available October 1, 2021. Requires 2020 tax information.\n\n**First time? Here's a step-by-step guide.**\n\n* Create an [FSA account](https://studentaid.gov/fsa-id/create-account/launch) (also known as the FSA ID). This is your legal electronic signature to sign the FAFSA. It's linked to your Social Security number. If you are a dependent student, one of your parents will need to make one as well, assuming they have an SSN. If your parent already has their own FSA account, they must use that. If your parent does not have an SSN, they must print and sign the signature page manually, then mail it in.\n\n* Gather all necessary documents, including bank statements, tax information (W-2s, tax returns), any records of untaxed income, etc.\n\n* Start the FAFSA! If you or your parent are given the option to use the IRS Data Retrieval Tool, use it! It will drag tax information from the IRS straight to the FAFSA and save you a lot of time.\n\nDo not guess on the FAFSA. If you have a question, post here or [contact the Federal Student Aid Info Center](https://studentaid.gov/help-center/contact).",
        "num_comments": 2651,
        "comments": [
            "My parents refuse to submit information for their portion of Fasfa so I put extenuating circumstance/can’t provide information. When I submitted, it said I needed to contact my school. My school isn’t being helpful whatsoever, they’re actually being very rude. They said they will not consider helping me because my parents refusing to provide information isn’t their problem. What do I do?",
            "I did the FAFSA this year and my EFC is like $176,503. Without my rich step-dad, my EFC would be around $9,873. The problem is that my step-dad won't help pay for my education (which after scholarships it's like $2,700) a semester because he straight up said to me \"Because I'm not your father\". Meanwhile me and my mother had to scrape almost all of our savings (and our money mind you) to pay my tuition bill, and if I drop out for a semester my tuition jacks up to $5,700 a semester. How on earth am I gonna get the financial aid I need? \n\nI'm in the state of Ohio and I attend Cleveland State University if that helps.",
            "I've been very sad and depressed for several months. My grandma died, I feel tired all the time, I find it difficult to speak with my friends, my body feels disgusting. All I have been doing is waking up, going to work, and immediately going to sleep or staying in bed. I signed up for the current semester a month ago. I've been going to classes for 2 weeks. I've been doing homework but have stupidly been neglecting my emails. I logged in to do homework today and found out that my schedule was deleted. I noticed I got an email from the business office Wednesday telling me that my schedule was in danger of being deleted because of my account balance. But the problem is that I can no longer find out what I needed to pay (I've never been knowledgeable about understanding financial aid stuff). I would probably be able to afford it though. I have a ton of homework to do but I can't even access it. What do I need to do to figure this out?",
            "Hello! I'm simply asking this on the behalf of my sister. \n\nShe is planning on moving in with her girlfriend after high school, who also lives with her own parents. When filling out FASA is it weird if her new address doesn't match the address of her mother/stepfather when it comes to the income aspect of things? I know this may be poorly worded, but I thought I'd give it a shot.",
            "Can you qualify for Pell grants if your are going less than part time?",
            "I accidentally started the 2021-2022 fafsa instead of the 2022-2023. Will that affect anything?",
            "My parents said if I move out they won't help me pay for college and they make too much so now I can't get any money for fafsa, and I've been filing taxes as an independent since I was 18 i am 22 now. What do I do?",
            "My pell grant has been reduced from around 10k to 872$ for this semester and next semester. I got unemployment last year due to the pandemic, is this why I am getting such a small amount from FAFSA? What can I do to obtain more financial aid?",
            "Does SAP (satisfactory academic progress) transfer to University after community college? I started college a while ago before I knew what I wanted and as a result I now have too many units so I don't meet the SAP requirements. I am transferring to a CSU next fall, will my SAP be restored since I meet all the other requirements and my unit requirements will change?",
            "My parents are unable or are completely unwilling to help give me their information so I can file fafsa. I have been asking them for years, they never budge. What can I do to get FAFSA? I am currently a dependent and have no way in hell of leaving any time soon due to my current income and bills. Are there any options for me outside of FAFSA if theres no way? I currently have a 3.85 GPA in Computer Science. I have tried applying for scholarships but I never get any response."
        ]
    },
    "Do not post questions about college admissions, college decisions, or specific universities here.": {
        "title": "Do not post questions about college admissions, college decisions, or specific universities here.",
        "score": 49,
        "url": "https://www.reddit.com/r/college/comments/1br4wgb/do_not_post_questions_about_college_admissions/",
        "content": "Go to the university subreddit or /r/applyingtocollege",
        "num_comments": 0,
        "comments": []
    },
    "College major stereotypes": {
        "title": "College major stereotypes",
        "score": 89,
        "url": "https://www.reddit.com/r/college/comments/1dlj479/college_major_stereotypes/",
        "content": "Has anyone noticed any trends in the personality, behavior, style, or anything else of different college majors at your college? Would you say the stereotypes of what you assumed different majors would be like are true or not?",
        "num_comments": 81,
        "comments": [
            "Business majors do no work ",
            "There are more engineering majors at my school than there are history majors in the us... :( I don't think history majors even have a stereotype tbh",
            "Business and communications are lowkey fake majors, Theatre kids are self absorbed, and all education majors (especially art and music) are extremely kind and patient.",
            "the vast majority of people i met don’t fit the stereotypes of their major",
            "CS majors don’t shower.",
            "I'm an anthro major, and I would say there's lots of people super into social justice, lots of queer people, and a ton of stoners. The biggest thing that broke the stereotype for me was that there are a lot of socially anxious people, lol.\n\nThen my minor is political science. The stereotype that polisci majors are stuck up has been half true for me. Some people are just rude and convinced they have the best and hardest major ever. A lot of them also voice very strong political opinions which is not really the point of political science. However, I've also met people who are the complete opposite of this stereotype. I find the people who are actually passionate about polisci are actually super down to earth and it's the people who only care about getting into high-paying government positions or law school that are condescending.",
            "I am a business major at ASU and I can confirm that a majority of them ARE pretty lazy.",
            "Accountants are boring and not creative. Many artists are CPAs, the money and stability allows them to pursue their art on the side.",
            "I mean stereotypes are true to an extent or else people wouldn't be calling them stereotypes. Doesn't mean it applies to everyone in the major thought.",
            "The majority of nursing majors I've met are very ditzy. Not stupid by any means but ditzy."
        ]
    },
    "People who got into a high ranking universities; what are some cons that often get overshadowed by fame?": {
        "title": "People who got into a high ranking universities; what are some cons that often get overshadowed by fame?",
        "score": 113,
        "url": "https://www.reddit.com/r/college/comments/1dldtm3/people_who_got_into_a_high_ranking_universities/",
        "content": "just curious. Went to MIT today for a tour and holy guacamole you guys have a LOT OF GIRs ",
        "num_comments": 58,
        "comments": [
            "Oh you were exceptional in high school? Here you’re just another student.",
            "They will keep shitty professors as long as their research output is good even if they're horrible at teaching their classes",
            "I go to a nowhere university so this isn’t from personal experience, but one downside I hear about a lot is how competitive extracurriculars can be at prestigious schools. At my school I basically had a research opportunity fall into my lap and became a club president because nobody else wanted the position. Sure, it’s not as impressive on a resume coming from my school as it would be coming from Harvard, but at least I get to do it.",
            "What's a gir?",
            "It's harder to stand out in class as a small fish in a big pond. You are surrounded by a lot of smart people you can learn from, but as a result, there is a lot of competition when it comes to doing research with professors, who are also at the top of their field and less willing to work with average students as they see it as an inefficient use of their time.",
            "I went to an Ivy. First, the competitive nature was legitimately too much, most everyone I know was on drugs (prescription and otherwise) to deal with the stress/anxiety as well as uppers to stay up and study for longer. The expectations were just completely unreachable and unrealistic. It’s just that the highly competitive nature of the whole school made it seem that unless you had a perfect gpa and the perfect internship you weren’t good enough to be there.\n\nSecond, the entitlement from a lot of people going there was horrific. I came from a severely underprivileged high school where the school didn’t even have the resources to buy textbooks, so going from that to an Ivy was jarring. Most people at Columbia were relatively wealthy, and if you weren’t, the school admin did not know how to help you. For example, my fiancée, who was also a Columbia student, was working at a lab over the last summer and was paid in the form of a stipend. (This is a specific example of an issue that unfortunately reared its head over the course of my time at Columbia) The university gave her the run around every time she was supposed to get paid and did everything in their power to not pay her. It was ridiculous. It got to the point that we had to lawyer up for the university to actually pay her, and even then, the stipend was always at least a month late. When she called the university’s financial department for the billionth time and insisted she needed the money for rent or she’d be evicted, they just said “Oh.” I ended up having to cover her rent with money I didn’t have so she wouldn’t be super late on rent (she later paid me back ofc) but the fact that something like that had to happen was ridiculous. We just figured that most people getting paid on a stipend might not necessarily need it, so when the university was met with a student that actually needed the money to live, they were genuinely surprised and didn’t have anything in the way of help.\n\nI’m sure you can tell from my rant I have a lot of grievances, but the ones I listed above are definitely the ones that bothered me most. I’m glad to be graduated and away from that hell.",
            "I actually found the workload at MIT to be quite intense, but the opportunities for research and networking are unparalleled.",
            "tenure makes some departments full of completely out of touch old white guys who, despite teaching at colleges with now very diverse student body, haven’t mentally aged past the 80’s",
            "Competitiveness provoked by *some* elderly faculty members.\n\nIts getting old and students are interested in building communities.\n\nI've noticed that students are there for camaraderie. What you actually get to experience is how mature students are when they opt to network with other fellow students.",
            "My friend goes to Stanford and I lived with him for a week so I feel I can say a little something. 99% of the conversations I’d hear in passing were about classes or internships or some other way of  furthering their future careers. Which isn’t bad but as an outsider it just seems like all of them are superficial on the surface and only think about that kinda stuff."
        ]
    },
    "What are some of the biggest misconceptions a high schooler going into college might have?": {
        "title": "What are some of the biggest misconceptions a high schooler going into college might have?",
        "score": 276,
        "url": "https://www.reddit.com/r/college/comments/1dl4l51/what_are_some_of_the_biggest_misconceptions_a/",
        "content": "What are some things that have turned out to be not important/as serious as you thought it once was as a high schooler heading into college? ",
        "num_comments": 179,
        "comments": [
            "Being smart isn't enough. How well you do in college, both socially and academically, depends a lot on how well you function independently and how resilient you are. College is way less structured than high school. \n\nHigh school seniors with helicopter parents should spend a lot of time practicing independence their senior year. Try to figure out answers to stuff on your own. Arrange your own transportation and appointments. Don't rely on your family to wake you up in the morning, arrange your schedule, make all of your meals, etc. This will make the transition to college (and adulthood) a lot easier.",
            "You're not going to get the social \"college experience\" unless you put yourself out there and make the first move sometimes.",
            "The biggest misconception has to do with a sense of hubris; that, just because you did well in high school, you're going to do well in college.\n\nEspecially if you did well in high school without having to study much. For the vast majority of people, they ***will*** have to study - a lot.\n\nStudying is a skill and, like most skills, must be \"exercised\" to get good at it.",
            "College could be the best years of your life, but can QUICKLY also become the worst. Really just depends on personal circumstances.",
            "1. That all professors teach-You are pretty much an independent entity when you step on campus. Lecturers primarily deliver lectures, which often involve speaking to students rather than engaging in interactive learning like in grade school. Unlike professors, lecturers don't necessarily have to teach in the traditional sense but focus on conveying information through lectures.\n2. Just because you show up to class it doesn't mean you'll pass.  &\n3. Just because you **don't** show up to class it doesn't mean you'll fail. (Do read the course policy.)\n4. You may **not** find your future significant other here, and that's ok.\n5. Your parents' choice for your major is a waste of time and $ if you aren't interested in that career path.\n6. \\[Once you're enrolled\\] Our aloofness as professors isn't personal, we can sense that you're used to being told what to do andwant you to practice independence **OR** we are bogged by our own research.\n7. You can major in anything and still apply to Medical school afterwards, you just have to know your stuff.",
            "Your professors are probably not going to teach you very much new content.  \nYOU are going to do most of the real teaching/learning work yourself.  \n\nDon't expect a university classroom to work the way K12 did:  \n\nLecture on new content.  \nHomework to reinforce new content.  \nLecture(s) to expand or refine previous content.  \nHomework to reinforce.  \nQuiz to evaluate where everyone is at in digesting all of the content.  \nLecture(s) to expand or refine previous content.  \nHomework to reinforce.  \nTest for final evaluation.  \n\nNo. Don't expect that to happen.  \n\nInstead, be prepared for:  \n\nSyllabus assigns book readings BEFORE THE FIRST CLASS SESSION.  \nFirst class session is a discussion of class expectation, and a lecture to refine what you learned in the readings.  \nIf you failed to read what you were supposed to have read, you will be lost and the Professor will (often) not care.  \nSyllabus assigns more reading to expand on previous topics.  \nSyllabus assigns some chapter evaluation questions.  \nClass session discusses specific details of the readings but DOES NOT perform an overall summary or \"catch up\".  \nSyllabus assigns more reading to expand on previous topics.  \nSyllabus assigns some chapter evaluation questions.  \n\nEventually there will be quizzes and tests or exams.  \n\nThe key observation is that YOU will TEACH YOURSELF and the professor will provide refinement and help connect concepts.  \n\nEvery class will have a formal syllabus and it is YOUR RESPONSIBILITY to find it and read it for each class.  \nIf the syllabus says everyone must wear a purple shirt on the fifth class session to receive a class participation grade then thats your responsibility to know that you need to do that.  \n\n\nThis is a painful lesson in being an adult for many Freshmen.",
            "It seems like a free for all, and some students quickly slip by missing classes and going out too much. But it is SOO important to stay on top of your stuff and to find such a good balance !",
            "You won't be going to parties every night, not even every week. Especially if you commute. In fact, party/drinking culture really isn't that strong of a thing in my college in general, but this may be place dependent.\n\nIt's not true that teachers don't care about you at all and won't even remember your name. Some of the professors do care very deeply about their students, and you can be on good terms with them. And on bad terms. Very bad terms, lol.\n\nI don't think it's objectively harder than high school. You make your own schedule, you can skip classes. (some with consequences, but others... well, nothing, really.)",
            "College is not like how media portrays it to be most of the time.",
            "People think it will be much harder than it is. You don't need to be smart, you just need to do the work."
        ]
    }
}