{
    "Announcing the official /r/CollegeRant Discord": {
        "title": "Announcing the official /r/CollegeRant Discord",
        "score": 88,
        "url": "https://www.reddit.com/r/CollegeRant/comments/l6bp3t/announcing_the_official_rcollegerant_discord/",
        "content": "The official discord for /r/CollegeRant is up and ready to go!! \n\nhttps://discord.gg/mDKDJANzkh\n\nJoin if you want a chill place to chat and study.Please be civil in your participation. \n\n**Rules**\n\n1.No spam\n Any spam found by the moderators will be removed. \n Any users that keep on posting spam more than once \n will immediately be banned from the Discord.\n 2.Be Nice\n No one likes a rude loud mouth. Please be \n respectful to other members and be nice. Any \n malicious insults directed to other members will \n not be tolerated.\n 3.No Racism\n Any usage of any kind of racial and homophobic \n is bannable without warning.\n 4.No NSFW content\n NSFW content is not tolerated in this discord and will be removed.",
        "num_comments": 13,
        "comments": [
            "Hello",
            "[removed]",
            "[deleted]",
            "Says address is invalid",
            "Hi",
            "so how does a discord work. Isn't the subreddit already a discord-type thing. So is this like a discord inside a discord. Or is this just saying that the subreddit is the discord?",
            "PSA: Your work will not be \"plagiarism free\" if you use services like these. Hiring someone else to do your homework and passing it off as your own IS the definition of plagiarism, and what got you a slap on the hand in high school will get you dismissed from a decent college.",
            "Yes"
        ]
    },
    "New Post Guidelines (Read Before Posting)": {
        "title": "New Post Guidelines (Read Before Posting)",
        "score": 24,
        "url": "https://www.reddit.com/r/CollegeRant/comments/1cel5kb/new_post_guidelines_read_before_posting/",
        "content": "Hello,\n\nMoving forward you will be required to add one of two flairs to your post. You can chose either the “no advice needed” flair or the “advice wanted flair”.  If you don’t add a flair, your post will be deleted.\n\nAnyone replying to the posts with “no advice needed” flairs with advice will have their comment deleted. If they continue to do it and start fights, they will be banned. Any rude comments regardless of which post it’s on will also be deleted (If they keep doing it on other posts then they will be banned).",
        "num_comments": 21,
        "comments": [
            "i love this!",
            "Just curious, cause this system seems a bit \"gameable\"  \n\n\nIf someone makes a post just absolutely trashing a professor or student who absolutely clearly from their post doesn't deserve it, and you go against their post marked as \"no advice needed\" are said comments commenting on OP's unfair trashing still removed if they \"give advice\" on working with said person instead of hating them? Or any other similar-esk post.  \n\n\nI understand the rampant people feeling they need to argue and respond to every post, however I feel its also fair to say that their are few and far between some posts that go beyond ranting, and just become hate pieces about someone they don't like who in the grand scheme of things did absolutely nothing wrong",
            "What kind of comments are appropriate in a No Advice Needed post?",
            "At this point, is it not possible to have an option that just locks comments? And what is going to be defined as advice? Is it just actionable suggestions, or is saying to someone \"hey, it's possible you misread/misunderstood something\" considered advice? Because I feel like this change doesn't reflect that a lot of issues come from the later of the two, but it's also not really advice.",
            "What if you don’t know?",
            "why complicate ...",
            "Can I just say I find it funny that the new rule is that flairs are required, but they didn’t add one (I know why they didn’t, but it made me chuckle). It’s also a missed opportunity for the ‘no advice needed’ flair.",
            "this is a rant subreddit. students should be allowed to rant. your opinion if the professor or student does or does not deserve it is irrelevant and unwanted. again, this is a rant subreddit.  not a discussions of how \"fair\" students rants are and how valid you think their rant is or not. \n\nthe fact you think this is \"gameable\" shows a fundamental misunderstanding of this subreddit. you think this is a discussion of how valid students rants are, which it isnt",
            "They all get deleted. The flair operates under the assumption that they are just venting and equipped to handle it themselves in real life.",
            "Any comment that doesn’t give advice."
        ]
    },
    "I feel like I fucked up by choosing my university ": {
        "title": "I feel like I fucked up by choosing my university ",
        "score": 30,
        "url": "https://www.reddit.com/r/CollegeRant/comments/1dqt4nj/i_feel_like_i_fucked_up_by_choosing_my_university/",
        "content": "Okay so. I’m going to be an incoming freshman this fall at the University of Texas at San Antonio. I really, really truly want to be a nurse more specifically an L&D Nurse. UTSA does not offer specific nursing courses like other universities. I can only curate my own classes and hope to get into UT Health (San Antonio). I hate that I have to do that, I want to follow an actual curriculum that will prepare me for Nursing school. \n\nNote: I choose UTSA out of highschool because of the affordability (they gave me an abundance in financial aid)\n\nI’ve been looking into programs and Texas A&M has the best nursing program meaning they only take a handful of students. Same for UT Austin. From what i’ve seen/heard everyone loves it. \n\nThis thought would have never occurred if I hadn’t had so much trouble with UTSA. I can’t even list how much they’ve put me through as AN INCOMING freshman. I know no college is perfect. The only thing really keeping me from actually liking UTSA is the fact that my advisors gave me the impression that they would provide nursing classes. I ranted about this on another sub but i just got attacked for “not doing proper research”. I mean it’s kinda hard to do proper research if the people who are meant to help you straight up lie. \n\nSo here’s my question. Is it worth transferring? \n\nI can either stay at UTSA/CC to finish some more prerequisites then go to nursing school. Or I could transfer to Texas A&M or UT Austin my sophomore year, get used to life there/take advantage of the nursing classes and then apply to nursing school.\n\n The thing is in order to fulfill a bachelors degree of any kind I would need to transfer to UT Austin or Texas A&M and do some classes a part of the core curriculum. \n\nOverall I just feel like I fucked up and I should’ve just gone to Texas A&M straight out of high school. The advisors were just so convincing for UTSA.",
        "num_comments": 11,
        "comments": [
            "Thank you u/grimfie for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*",
            "Could you go to CC finish your prerequisites for Gen Ed. And chose CC that some type of agreement with Texans A&M nursing program than take the first nursing prerequisites for nursing program at the CC.",
            "OP, look and see if there are transfer scholarships where you want to go to school. In Arkansas, most of the 4 year universities have scholarships for students that transfer in credits. Sometimes they require an associate’s degree with a certain gpa. Sometimes they ask for 24 credit hours with a certain gpa (that case was a few years ago and may not still happen). It’s definitely worth checking on.\nGood luck to you reaching your nursing goal.",
            "If you’re in Texas, you might be able to take ACC courses for a year or two then transfer to UT.",
            "\"I can only curate my own classes and hope to get into UT Health.\"  This isn't entirely uncommon though. For specialized fields, they may not have a specific major for that profession you hoping to go into. If a university doesn't have Nursing/Pre-Nursing as a major, then all one would need to do is pick any major (or choose something like \"Non-Degree Seeking Student\"), and take those pre-reqs and Texas core courses. Then you apply to the nursing school you want. \n\n\nI just looked it up and A&Ms website states that all you need to be eligible is to have completed the pre-reqs \"from Texas A&M or another institution.\" You can complete your core and pre-req courses **anywhere**; it doesn't have to be a 4-year university, it can also be through a community college. So take the courses you need at UTSA, then apply to TAMU. Also, there are many paths to getting a BSN. You could do a Traditional program and graduate with your BSN in 2 years. You could do an LVN or RN track, then apply to an RN-to-BSN nursing program and graduate in 2 years. Some Texas community colleges now offer nursing BSN programs, which is much more cost effective compared to paying a 4-year university's tuition.  \n\n\nIf staying in San Antonio is a priority for you, then going to UTSA won't prevent you from being a nurse. Reach out to the nursing program you're interested in applying to and talk to **their** advisors. They will give you a detailed list of which Texas Core and Pre-req courses they require. Then THAT'S the guide you use when picking your courses each semester. You don't curate it on your own and hope for the best, because what you think might transfer over, might not be on the list of approved courses that school will take. And each nursing school has different required pre-reqs, so UTSA isn't going to know what every nursing school in Texas requires for admission and would not be able to advise you. You will have to take initiative to find out what you need. \n\n\nEdited to add: You didn't fuck up, so don't let this stress you out. If you really feel as though you absolutely must do all your education theough one school, and that school can only be A&M, then withdraw from UTSA and apply to A&M. In the grand scheme of your life, one semester isn't that long. ",
            "It is 100% worth transferring. I recommend taking core transfer courses, and look for a program that you do like and want so that you're not wasting time while you wait to transfer over. My advice is to talk to an advisor at the place you want to transfer to and ensure credits you are taking will transfer over there. There are basic core transfer credits in the state of Texas like college algebra, biology for majors, General chemistry one and two and English. Those types of courses should have no trouble transferring and you won't waste money or time. Good luck! Don't let anyone dissuade you from your goals. Just make sure everything you're doing can move you towards the goal and not in the opposite direction.",
            "First, the most important thing is the thing you’re now doing: taking ownership of your schedule and program map. \n\nSecond, you haven’t taken your first Chem class, your first bio, your first stats class, all pre-reqs for any nursing program. After taking some of those, you may decide you don’t want to stick with that major or career… you may decide you will. Regardless, you can take those courses anywhere… taking them where they’re cheaper and the classes are smaller is a good idea. \n\nThird, find out what nursing programs you want to apply for after your first two years, get their requirements, and start chipping away at them. Nursing programs are competitive and you have to applicant regardless of where you start. They usually depend on two things: GPA and shadowing hours. You need to knock both outta the park. \n\nFourth, if you’re prepared academically, make sure you’re taking gen Chem your first semester. Many folks start out pre-health programs with bio, but you need a year of gen Chem, a year of o Chem, a year of bio, a year of A&P, micro bio and possibly cell bio in order to apply to many nursing programs. The Chem will unlock a lot of the upper level courses and keep you on track. Remember that you will most likely have to take multiple lab courses at the same time. \n\nGood luck!",
            "I'm actually the head Moderator at r/UTSA.  \n\nthere is an actual path via utsa to get a nursing degree.  it's actually a partnership with ut health.  you'll spend half your years at utsa and half at UT health.  \n\nthis partnership is relatively new but already receiving some accolades.  \n\nfor a lot of your core classes, I do recommend taking a number via the alamo colleges CCs, as they are guaranteed transfer credits, and MUCH cheaper than taking directly at utsa directly.",
            "Not all universities count the same classes as core. Some count A&P 1 as a Natural Science, while others do not and will require you to have another course fill that credit. ",
            "Anatomy and physiology is not typically a core course. In Texas it is is a non- science majors and usually part of a Health Sciences degree.\nEdit... sorry, I misread your message but yes students should always check with the advisor at the institution they want to transfer to to ensure the credits will indeed transfer"
        ]
    },
    "Anyone else have homework and test dreams?": {
        "title": "Anyone else have homework and test dreams?",
        "score": 14,
        "url": "https://www.reddit.com/r/CollegeRant/comments/1dqor9d/anyone_else_have_homework_and_test_dreams/",
        "content": "It's not really debilitating or anything worrying.\n\n But for the last year and a half of my degree program in drafting, I get these classwork dreams.\n\nLike during some of the really tough CAD drafting classes semesters past, I would have dreams of unsolvable geometries as I tried to edit them in my head. And when I realized the geometry was not possible, it broke the dream and I woke up. Particularly in Advanced CAD, Principles of 3D, and Disciplines I.\n\nThis summer, it's math dreams as I knock out Applied Algebra.\n\nOne of my dogs fell asleep between me and my wife and I was convinced that the dog was a cubed root I had to graph the function for.  Wake up and , no, the dog is not a math construct but a derpy grey dog loving every minute of being between humans.\n\nAnyone else having this stuff?\n\nAm I going crazier or is this normal? Or is it all this insane math and geometry is rewiring my head even as I sleep? Or is it just stress?",
        "num_comments": 11,
        "comments": [
            "Thank you u/grenz1 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*",
            "Feel you. I had nightmares about taking exams, turning them late, going to lectures and such.",
            "I am 60 yo. Full professor with tenure. And I still sometimes have dreams (nightmares?) in which I miss an exam, or missed a large number of classes and fell way behind. I actually love these dreams.",
            "I’m a retired college math instructor and dean of arts and sciences. I’ve had countless dreams of it being test day and I forgot to make out the exam, or it’s the first day of class and I can’t find the room.",
            "I have nightmares when i worked as a server. Mainly of missing tables. I would wake up in a cold sweat at night with tears in my eyes and finally I was like f this job im quitting so I got myself fired.",
            "Graduated college in 2021 and i still get test/class/failing not nightmares but just bad dreams/stress eh maybe once every 3/4 months.  Pretty normal imo.",
            "Never ends",
            "I have solved chemistry equations I was struggling with in my sleep before. I also had the usual test/college anxiety dreams, even after I graduated. According to my parents, these don’t seem to ever stop lol",
            "I had a dream a year or two ago where I was hanging out with some friends, then suddenly remembered that I had a English paper to turn in that day. I suddenly woke up in a panic, and then realized that the semester had been over for a few weeks.",
            "Idk if it's normal, but it's definitely not unique (there may be dozens of us!) - I get these when I'm exposed to something new and interesting, sometimes it's coursework and sometimes it's video games. Upside is, in the rare cases I have real problems to work out, sometimes I can solve them or get ideas in my dreams. But usually it's kind of frustratingly unrealistic stuff like you said.\n\nThe dreams about suddenly having an exam I didn't know I was in a class for, or not having time to work on a big assignment and being in the class where we turn it in, those dreams have mostly gone away now that I've graduated. I had those for years since I dropped out the first time around and went back years later."
        ]
    },
    "I’m unsure if I should go to state or community college.": {
        "title": "I’m unsure if I should go to state or community college.",
        "score": 1,
        "url": "https://www.reddit.com/r/CollegeRant/comments/1dr4xmr/im_unsure_if_i_should_go_to_state_or_community/",
        "content": "State college is being paid by fiancial aid (Grants you don’t have to pay back) and I got accepted into their program for first generation students. (It’s just I’m undecided and their pre-majors are competitive).\n\nCommunity is just 2 years free. I’m unsure of what resources they can give for me(it’s a smaller school/it’s summer but I still didn’t see tutors/could talk to advisor/consulars in person). \n\nBoth are close to home but the only thing is I’m undecided. \n\nI feel really upset being undecided and I’m going to try nursing. This could break me since if I don’t like nursing and then try to pursue engineering or some other type of field, I feel fucked. \n\nI’ve cried alot. I’ve cried at both colleges. It just feels helpless. I could take a gap year but that means I lose the opportunity at the state and 2yrs for the community college. \n\nSome say I should go to the state even if I’m undecided cause it’s a lot of opportunities especially with that program. Others say as undecided I should go to community. \n\nI’m unsure of what I should do. I fear regret in both….\n",
        "num_comments": 2,
        "comments": [
            "Thank you u/Icy_Dog_3587 for posting on r/collegerant. \n\nRemember to read the rules and report rule breaking posts.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CollegeRant) if you have any questions or concerns.*",
            "Why should you go to a community college because your undecided? You don't have to rush becoming decided right away, give yourself the time at the state college, especially if its free and use the opportunities."
        ]
    }
}