{
    "Hold this man accountable ": {
        "title": "Hold this man accountable ",
        "score": 2560,
        "url": "https://i.redd.it/8x19l1n4oc9d1.jpeg",
        "content": "",
        "num_comments": 164,
        "comments": [
            "u/Jordanlf3208 Choo-Choo. Hope you are hungry and have PICA.",
            "Eat! The! Train!        Eat! The! Train!",
            "It has been 13 damn minutes since this post was made and still no response from Jordan. Why is hiding from us?",
            "A Hoosier always pays his debts. Or at least this guy should.",
            "![gif](giphy|3o84sw9CmwYpAnRRni)",
            "Ban this man if he doesnt do it!",
            "![gif](giphy|WsdIIMbGGthBRaGkcA|downsized)",
            "![gif](giphy|y4oGhZ6ZP8C09Tr6Rm|downsized)\n\nUh oh",
            "Ban the man if he doesn’t stick to his word",
            "You are my hero!  I remembered this but didn't have the energy to go back and find it."
        ]
    },
    "ESPN analyst Vitale announces cancer diagnosis": {
        "title": "ESPN analyst Vitale announces cancer diagnosis",
        "score": 231,
        "url": "https://www.espn.com/mens-college-basketball/story/_/id/40453753/espn-analyst-dick-vitale-announces-cancer-diagnosis",
        "content": "",
        "num_comments": 44,
        "comments": [
            "I’m glad he keeps beating cancer, but I think it is starting to catch up to him. The fact it keeps reappearing is not promising. I hope he’s able to maintain a good quality of life for as long as possible and do what makes him happy until the end",
            "Dang. I thought he was just cleared of cancer. Pray he keeps beating it.",
            "Hoping for the best for Dick",
            "This is Awful with a capital A. Hopefully, he's able to beat it again",
            "All my homies and I agree on this.....FUCK CANCER",
            "How many times does this old man have to teach cancer this lesson?!?!?",
            "He’s a strong man",
            "fight on!",
            "Awesome. I hope Dick lives forever. Just seems like a guy who really enjoys life. Always positive even when things are shitty.",
            "I know that Dick Vitale would really appreciate all of your supportive comments on behalf of his courageous fight against cancer on his Facebook website that I follow on a daily basis. You may already have seen references to his recent book, titled: “Until My Last Breath - Fighting Cancer With My Young Heroes.” As noted on his website, 100% of all proceeds from this $35 book go to the V Foundation, Dick Vitale Pediatric Cancer Research Fund. Dick Vitale has inspired so many cancer patients, including myself, with his courageous fight against cancer along with his passion for raising funding for cancer research. (If the millions of dollars that now are wastefully spent for political campaigns could be spent instead on cancer research, doctors might have a permanent cure for cancer by now.) I am one of the lucky ones so far to be thriving 3 years after my diagnosis of 2nd stage amyloidosis in the heart area, at 70 years old, having recently completed 2 years of chemotherapy and other related treatment.\nI am in full remission and in full recovery mode having just returned from a bucket list golf trip to Pebble Beach generously hosted by my son - that was preceded by playing for a championship senior basketball team in a tournament including former ABA and leading collegiate players in the Chicago area - along with playing numerous competitive senior doubles tennis matches. I formerly played baseball and basketball for a small college in southern Illinois. Lucky to be alive after collapsing in a pick up basketball game a few years ago - similar to the Bronny James cardiac arrest incident - with 2 of my teammates CPRing back to life after my heart stopped. Thankful and grateful to my oncologist and cardiologist for enabling me to prove that full recovery at 70 is possible after a cancer diagnosis - the topic of this thread."
        ]
    },
    "Insights on the Big East Media deal (and why non-Big East fans should care)": {
        "title": "Insights on the Big East Media deal (and why non-Big East fans should care)",
        "score": 38,
        "url": "https://www.reddit.com/r/CollegeBasketball/comments/1dr0dzz/insights_on_the_big_east_media_deal_and_why/",
        "content": "[https://painttouches.com/2024/06/28/the-big-easts-new-480-million-tv-deal-is-a-huge-win-for-all-basketball-fans/](https://painttouches.com/2024/06/28/the-big-easts-new-480-million-tv-deal-is-a-huge-win-for-all-basketball-fans/)\n\n\n\nThis is a Marquette blog, but it's an absolutely fascinating read if you're interested in media rights and the details around it.\n\nSummarizing the summary:\n\n* **Money:** The Big East is going to get \\~80 million a year for media rights.  Basketball CAN exist in the same world with the football schools, but we'll always be paddling behind.  So megadonors, university investment, etc - especially with most of the BE schools being small urban private schools, will drive how competitive teams in the league can be.  Looking at you, DePaul.\n* **Money compared:**\n   * Football:  AAC's ESPN football media rights are $83 million a year through 2032.  So the Big East will be making more per-team in basketball than the AAC's football.\n   * Basketball:\n      * The A-10 got $6 million in 2022 for media rights, so each Big East team will be making more annually than the entirety of the A-10 as a league.  Let's hope those guys get another raise soon.\n      * It's not all rosy the Big East shares Fox with the Big Ten. If you assume the Big Ten's basketball is worth 15% of their total media rights, their basketball is worth $200 million a year. Regardless of how strong or poor the teams in the B10 are, their massive alumni bases are bound to draw more ratings.\n* **Just tell me everything will be on cable:** Mostly, and broadly distributed which will get the league some nice exposure.  FOX, FS1, FS2, and TNT will be broadcasting.  Very excited about TNT's capabilities considering how well produced and fun the NBA analysis is with Shaq, Barkley, etc.\n* **Basketball is still worth something to linear cable broadcasters:**\n   * TNT, FOX, NBC, and CBS (before dropping out) were/are all partners of the Big East.  That's a lot of networks wanting inventory.  There's still a market for college basketball, despite some of the doom and gloom around no one caring about the regular season.\n   * That said, the Big East has won 4 Nattys since they signed with FOX in 2012 after the C7 split off.  They've had an unbelievable run.  Hopefully it can stay competitive, as ratings correlate heavily with poll rankings.\n* **But I hate Peacock:** Streaming, specifically on Peacock, is not going away.  The author estimates \\~25% of Big East games (including Noncon, Conference, and BE Tourney) will be on Peacock.\n* **We could still be screwed:** The Big Ten/SEC might still ruin everything in 2032 when the NCAA tourney media deals are up for bidding and form some sort of frankenmegaconference.  It's no surprise that the Big East's negotiated Madison Square Garden contract ends right around that time as well.\n\nTLDR - basketball fans can breathe a sigh of relief, at least for \\~6-8 more years when this is all going to start getting a little weird again in the 2030s.\n\nAlso, Val Ackerman, the conference's commissioner, deserves a fat raise for snagging UConn. back.  My understanding is that that decision was not a unanimous one and was hard-fought to convince some university presidents to let them back in.  What a phenomenal decision to invite them back one, and hike the exit fee to $30 million.",
        "num_comments": 20,
        "comments": [
            "Interesting to see the breakdown. Makes me wonder what a Big 12 deal will look like when Yormark takes basketball to the market.",
            "6 *fucking* million 💀",
            "My biggest takeaway is that if the Big East can get $7 million a school for just basketball, what can the Big 12 do if it continues to dominate in basketball.",
            "No ACC schools joining the big east then. Uconn gotta join a better conference.",
            "I wouldn't be surprised if they got $160m-$200m for their basketball deal assuming it is all basketball offerings (including conference tournament).\n\nFor three reasons:\n\n1. As the original blog points out the reality is the Big East is small private schools basically, they average 14k-15k in enrollment, and UConn brought this average up by about 2k. The Big 12 on the other hand averages 36k-37k in enrollment. Their alumni base is substantially larger, which does impact viewership and potentially interested fans.\n\n2. There are more schools. If the Big 12 got equal value to the Big East per school, then the deal would be about $115m-$120m.\n\n3. Big 12 schools are not equal to the Big East. The reality is the Big 12 has close to twice as many schools in the top 50 as the Big East does any given year. There are simply more higher quality matchups both in conference play and out of conference play available for the Big 12 to offer for a media deal.",
            "Uhh, who’s been dominating??? And, no, you’re not getting me to Kansas City over MSG. We will accept non-conference basketball games in exchange for football-only affiliation, though! Not that you’d want that…",
            "Who is going to come calling with their football in the state it’s in?\n\nThe only way they get in is if the Big 12 splits off their basketball and football contracts and UConn gets a bball only invite. \n\nAlso, the ACC is going to decay, it’s just a matter of when and how badly. There’s a tipping point where it will be more desirable for some schools like Wake Forest or Boston College to be associated with Georgetown and Xavier over leftover AAC schools like USF that are called up.",
            "Undoubtedly, alumni base size and presence in the top 25 rankings matter most to how well conferences fare in media ratings.   \n\nIt is still fascinating to me to watch teams like Providence or Seton Hall with sub-$500 million endowments, and 5-10k students managed to get where they are, whereas Fordham, St Louis, etc with 1 billion + endowments and comparable enrollments continue to wallow in mediocrity.",
            "To be fair, MSG organizers love scheduling Big XII teams in recent years, so catching games in both Kansas City and MSG hasn’t been a mutually exclusive selection for a while.",
            "What does getting you to Kansas City have anything to do with BigXII basketball media rights? \n\nThis Big East deal is a fantastic jumping off point for a bigger conference with bigger schools to negotiate more money. \n\nThe BigXII will split basketball and football rights and use this to sign an even bigger deal and the B1G and SEC will follow suit. Each conference will sign a bigger deal than the last, and the Big East and BigXii will still end up chasing the SEC and B1G."
        ]
    },
    "Report: OKC Thunder sign Oakland’s Jack Gohlke to summer league roster ": {
        "title": "Report: OKC Thunder sign Oakland’s Jack Gohlke to summer league roster ",
        "score": 200,
        "url": "https://okcthunderwire.usatoday.com/2024/06/27/report-okc-thunder-sign-oaklands-jack-gohlke-to-summer-league-roster/",
        "content": "",
        "num_comments": 28,
        "comments": [
            "It might not pan out, but that kids demeanor alone deserves an NBA shot.  Hope he makes it.",
            "someone get me a jersey rn",
            "I'm not saying there's more than a 1% chance this works out, but it sure did for Duncan Robinson ",
            "He brings back horrible memories, but I'm happy for him regardless.",
            "I still worry the bad man can hurt me. But Forreal I hope he gets a contract. Kid was absolutely unreal.",
            "Calipari puts another one in the league.",
            "Love this for him!",
            "MY BOY JACK GOLKHE!!",
            "Imagine him in a Heat Jersey, He's going to terrorize the Celtics",
            "No way! Really happy for the guy. He deserves it. Has a fighting spirit."
        ]
    },
    "Duke Freshman F Cooper Flagg named to team of current and former NBA players that will train with Team USA before Paris Olympics": {
        "title": "Duke Freshman F Cooper Flagg named to team of current and former NBA players that will train with Team USA before Paris Olympics",
        "score": 112,
        "url": "https://www.instagram.com/p/C8xApH2RgGg/",
        "content": "",
        "num_comments": 34,
        "comments": [
            "USA Basketball is grooming Flagg for the future.",
            "Nigel Hayes sighting!  Most of the guys on the team are really young, but smart move to bring in Hayes and Langston Galloway who have Euro ball experience.  ",
            "He got any ex-babysitters we need to know about?",
            "Super Cooper",
            "I mean with a name like Flagg he has to be there",
            "I’m a white dude, but I’m gonna say if this fucking dude wasn’t white nobody would be paying attention. The fact he’s going to Duke makes it all the more worse. The media around him and sucking him off basically is just crazy. He might be good, but let’s fucking see. He hasn’t played a single college game yet",
            "Future Jazz Cooper Flagg",
            "Bet they’ve been grooming this kid since he was in the Olympic Development Program in middle school. Team USA probably expects a ~~ring~~ medal out of him and total commitment! Even if that means estranging himself from his family!",
            "This time with older *men!*",
            "lmfao you guys are getting way out in front of the grooming jokes XD"
        ]
    }
}