{
    "Where to live, eat, and drink in Columbus (June 2024)": {
        "title": "Where to live, eat, and drink in Columbus (June 2024)",
        "score": 15,
        "url": "https://www.reddit.com/r/Columbus/comments/1d5jmkq/where_to_live_eat_and_drink_in_columbus_june_2024/",
        "content": "Welcome to the monthly thread answering your questions about where to live, eat and drink in Columbus.\n\nAre you [new in town](https://www.youtube.com/watch?v=EipRjf3X1x0)? If you're looking for apartment or housing suggestions or just have general questions about the city here's your place to ask.\n\nThe [Columbus Area Relocation Guide](https://issuu.com/cbusregion/docs/relocation_guide_2023) is a comprehensive guide to living in Columbus Metro Area.\n\nIf you're just coming for a quick visit here's a handy list of [things to do in town](https://assets.simpleviewinc.com/simpleview/image/upload/v1/clients/columbus/230324_Things_To_Do_Digital_3e46b015-188a-4ecd-af95-f9a833e93a6a.pdf) whether you have 1 hour, 3 hours of an entire day to spend with us.\n\nCan't make up your mind where to eat? Need a special occasion suggestion? Here is a [growing list of the best original restaurants](https://www.google.com/maps/d/u/0/viewer?mid=1ZVq-MiT2lYNN7s8xK1dXXnFn1VBehd0&ll=39.953557909818535%2C-82.97373049189214&z=11) Columbus has to offer.\n\nLooking for a noisy bar with cheap drinks? Looking to watch the fight? Or do you just need a quiet dark space to drink in peace? Whatever you have in mind, please remember to be mindful of COVID-19 and take [proper precautions](https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/prevention.html) to protect yourself and others while we all figure out this new normal.\n\nBe certain to check the [Reddit Guide to Columbus](http://www.reddit.com/r/Columbus/wiki/) and contribute to the Wiki if you have good advice.\n\n[Previous threads](https://www.reddit.com/r/Columbus/search/?q=author%3A%28Automoderator+OR+Kicker774%29+where+to+live+eat+drink+columbus&sort=new&restrict_sr=on&t=all)",
        "num_comments": 23,
        "comments": [
            "I just graduated college and am looking to move out of my parents in a few months. I'm working at a hospital downtown. Was wondering if anyone had recommendations for apartments. Looking to keep rent below $1,100. I don't need anything fancy, just a studio or 1 bed in a decent area. I would appreciate any recommendations. Thanks!",
            "Looking for a 1 bedroom apartment in Dublin/Hilliard preferably with rent under $1000. I work in Marysville so I would prefer something closer to 270/33. I’d look in Marysville but apartments there are out of my budget. Thanks! :)",
            "Was walking in Clintonville on Friday to Wild Cat and saw a vegan restaurant called Seitan's Realm. Looks interesting. How is it?",
            "Doing this migration piecewise, with 2 weekslong sojourns this year to figure out the area. Thanks for putting this together!",
            "Looking for the best place to buy/rent for a young family new to the area. Husband will be working in New Albany. Ideally close to downtown but more of a quaint/quiet/safe area.",
            "Hey all! I’m currently on the hunt for an apartment/townhome/whole house rental in the Grandview/Upper Arlington area. I’ve been looking online at Zillow rentals, rent.com, hot pads etc. etc. and have had some luck but not a ton. I’m looking for 1-2 bedroom and trying to keep rent under ~$1300. I’ve been told that a lot of people are private renters in Grandview who don’t necessarily post their listing so I’ve done some driving around to no avail\n\nAny help or thoughts is appreciated!!",
            "I hate to tell you but all of the places with walkable restaurants, bars, coffee shops, shopping, etc are the most expensive places to live in Columbus.",
            "I might have a good solution for you. I DM'ed you about it",
            "I like it a lot.   I'm not a vegan, but I enjoy going there nonetheless.  The dishes are savory and full of flavor.  The \"burger\" and \"italian sub\" are favorites of mine.  The fries are good, too.  They make their own ketchup, which is better than most \"bespoke\" ketchups.\n\nThe interior decor is very simple, but with posters from Horror films and a portrait of Robert Smith and his wife looking down from a place of honor, it's cute.",
            "seitan's realm is super yummy! not vegan, but still like it too!"
        ]
    },
    "AMBER ALERT ": {
        "title": "AMBER ALERT ",
        "score": 134,
        "url": "https://i.redd.it/d9n32pkyue9d1.jpeg",
        "content": "If you see anything call 911",
        "num_comments": 32,
        "comments": [
            "The police just briefly jumped on 10tv. 3 and 9 year olds were found so the Amber alert is cancelled. The 8 is deceased. Mom not in custody is what he said. Then said they had to iron out more details before a full press conference and walked away.",
            "Being at a restaurant while everyone's phone is going off with the alert, except yours, because you turned it off....awkward.",
            "Did anyone else get three of these? With the exact same information? Super irritating. I want to call if I see something, but don't send it out that many times.\n\nEdit: I am now up to 4 with an update that the mom may be wearing a red head covering. I want to help the children but this is rediculous.",
            "Shit, that's the context I was looking for and I hate it. Hope all three boys are found safe.",
            "> Mom is a wanted homicide suspect.\n\n\"At the late Friday night press conference, however, police said Wilder was a person of interest not a homicide suspect, but acknowledged anyone close to someone in a suspicious death could be considered a suspect.\"",
            "😭 rest in peace Martonio💔",
            "I turn mine off too because they terrify me and it will consume my brain 😭 I’m a bad person",
            "Nothing wrong with that, it's not like I'm gonna jump into action.",
            "I just got a second with the addition of the adult's clothing. Maybe you're closer to the event?",
            "It was just re-released with additional information, including clothing "
        ]
    },
    "Why doesn't Comfest have water refill stations?": {
        "title": "Why doesn't Comfest have water refill stations?",
        "score": 75,
        "url": "https://www.reddit.com/r/Columbus/comments/1drbawh/why_doesnt_comfest_have_water_refill_stations/",
        "content": "They preach staying hydrated, but charge $3 bottled water?! \n\nI went to the information both to ask, the guy said there aren't refill stations, but volunteers have water behind, so he hooked me up with a freebie. \n\nI'm just baffled how this is acceptable at a ZERO WASTE event.",
        "num_comments": 27,
        "comments": [
            "u/sixner, you're wrong about this. **There are free water refill stations all over the festival grounds**, with locations clearly marked on the map in the centerfold of the Program Guide.",
            "I saw a water station next to the comfest booth on the far side of the bozo stage.aybe it was for volunteers only, I don't remember seeing a sign though",
            "There was free water by the beer stations. We filled up for free multiplen times last night. There was also a water station by one of the first aid booths",
            "There's a station near the Bozo stage by First Aid. It says volunteers only but no one is watching it.",
            "Especially when Irish Fest, a hugely commercial operation, does have water trucks.",
            "They used to have water coolers at the beer stations",
            "I like how at every Dayton festival I went to they had free city water for everyone",
            "Not having free water at any event that serves alcohol should be illegal, point blank.\n\nThe answer Comfest is a money-driven sellout just like everything else, despite their attempts at messaging otherwise.",
            "The $3 water is a fundraiser for a school.",
            "Stay hydrated. It's so humid today. I didn't go because there has been like a 60% chance for rain. I would almost prefer to wagon around a cooler even though they don't like it. They only want backpacks."
        ]
    },
    "No wonder they gerrymander the most in this state ": {
        "title": "No wonder they gerrymander the most in this state ",
        "score": 33,
        "url": "https://www.reddit.com/r/Columbus/comments/1drb8ar/no_wonder_they_gerrymander_the_most_in_this_state/",
        "content": "I just read this article and it makes so much sense why rural areas always seem to dictate how we do things in Ohio. Man we have the most corrupted powermongers in this state smh. \n\nhttps://ohiocapitaljournal.com/2024/06/28/legislator-laments-lack-of-lawyers-in-rural-counties-despite-overwhelming-wins-by-rural-lawmakers/",
        "num_comments": 11,
        "comments": [
            "The complaint about most lawyers living and working in cities is goofy. *Most people live in cities.* Lawyers work for people. Cornfields don't hire lawyers.",
            "Fellow 614 resident, make sure you are encouraging everyone you know to vote for the citizen led initiative against gerrymandering. Even if they are thinking about not voting bc of POTUS candidates, tell them they have to show up for down ticket races and especially this initiative!",
            "How do we bring about equality in prison? Less men in prison, more women in prison, some of each?",
            "Your question caught me off guard. In all honesty, I think you first have to decide if everything needs to be equal. If so, I'd assert you have to address the root cause of males committing--for the pedantic: arrested for--more crime. I think the jury is out (no pun intended) regarding the cause being in the nature or nurture categories.\n\nIMHO.",
            "Yes. In fact, I just posted to that end. And with every stat, we should consider the causation in addition to the raw number. The causation was really my point.",
            "Ah. I've seen people argue that women being 8% of the prison population despite being 50.5% of the general population was proof that the justice system was heavily biased against men and that women could get away with anything.",
            "A few highlights from the article. It's definitely worth a read. \n\nBut wait, you say. In 2020, Donald Trump beat Joe Biden 53%-45%, or by 8 points.\nCorrect. But 70% of the seats in the Ohio Legislature are Republican. That’s a 40-point gap in favor of Republicans.\nFranklin and Cuyahoga – Ohio’s two largest counties with 2.6 million people – together have elected representatives chairing only two committees, while Tuscarawas County, with population 92,500, by itself has two committee chairs. That’s 2.6 million urban residents with two committee chairs vs. 92,500 rural folks with two committee chairs.",
            "From linked piece: “Women account for 51% of the adult population but only 36% of the lawyers“\n\nNot only that, but as of 2020, women made up only 8.1% of the Ohio prison population. \n\nSource: Ohio Legislative Service Commission",
            "Turnout can still defeat gerrymandering. District 6 saw a 20 point swing towards the Dems in an under-publicized special election where the Republican had a 28:1 fundraising advantage and was a sitting state senator. This year we have an anti gerrymandering constitutional amendment on the ballot in Ohio. If you or anyone else needs to register to vote:\n\n[olvr.ohiosos.gov](http://olvr.ohiosos.gov)\n\nIf you need to check your voter registration status: \n\n[voterlookup.ohiosos.gov/voterlookup.aspx](http://voterlookup.ohiosos.gov/voterlookup.aspx)",
            "To be fair, women also commit fewer crimes than men, especially violent crimes. \n\n\nhttps://revisesociology.com/2021/06/13/gender-and-crime-statistics/"
        ]
    },
    "Calling now, Condado in Clintonville’s days are numbered": {
        "title": "Calling now, Condado in Clintonville’s days are numbered",
        "score": 140,
        "url": "https://www.reddit.com/r/Columbus/comments/1dqykas/calling_now_condado_in_clintonvilles_days_are/",
        "content": "I’ve seen numerous job posting’s for management over the last few months.  Walked in tonight for a quick drink/taco, and there were 5 guests all waiting to be served.  Went across the street to Local Cantina and they are thriving. ",
        "num_comments": 93,
        "comments": [
            "Hard to run a business when the only requirement for the staff is that they don’t give a shit about being there",
            "Former employee here, I hope that its days are numbered. There was recently a huge turnover there where all the long term employees quit due to multiple people from corporate coming in and basically ruining the entire work environment. Employees were regularly having breakdowns due to tense environment, overworking them, and bad management. It’s basically like fast food the way it’s ran. Everything comes in pre packaged bags and every cent is tracked so harshly that if you as a cook don’t guess correctly how much food you should pre prepare for a night and have too much left over you can get written up and reprimanded. Management gets high bonuses for cutting on labor and food cost so they run skeleton crews over there since business is so low. I genuinely do not wish that location the best, literally every single person who I worked with has left because of how bad it got over there.",
            "Never really had a good experience at Condado, any location.",
            "Psh. Next you’re gonna say the Dunkin’s days are numbered ",
            "The one in the Polaris isn't much better, sadly. They've gone downhill a lot and the prices have only gone up.",
            "You really have to wonder what is going on in the minds of folks who sit on the patio at that location and are just about able to see Los Agaves like a block north.",
            "Condado has been absolute garbage since like 2017. With their rapid expansion, they’re on pace to file bankruptcy within the next couple years. It’s just not sustainable.\n\nWhen they switched from build your own to their set menu it got way worse not only in quality but service as well. It’s so bad.",
            "That location has always had a tough go. Wish the cheap Mexican restaurant would come back",
            "We switched to local cantina a while ago.  Haven’t really looked back.",
            "If only either place had consistent quality food…"
        ]
    }
}