{
    "Spotlight: Hollering Elk": {
        "title": "Spotlight: Hollering Elk",
        "score": 1811,
        "url": "https://www.reddit.com/r/comics/comments/1dnm0ut/spotlight_hollering_elk/",
        "content": "Hello everyone,\n\n&#x200B;\n\nThis weeks Spotlight feature is u/HolleringElk, who creates the comic Hollering Elk. In keeping with the intricate and detailed art style of her comic, her answers are equally in-depth and well-thought out. A real treat for fans!\n\n&#x200B;\n\nhttps://preview.redd.it/ugppl5tmlk8d1.jpg?width=2285&format=pjpg&auto=webp&s=4cb031e99182ccb64e5929eaefb1758a1db4b597\n\n**1: When you started posting to** [**r/comics**](https://old.reddit.com/r/comics)  **you posted \"slice of life\" comics and later moved towards posting body  horror. How did you make the decision this was more your thing to  create?**\n\nI have always had a keen interest in the macabre. Prior to the  pandemic, I was a full time traditional painter and illustrator drawing  silly comics on the side, both traditionally and digitally drawn. Comics  had always been something I’d dabbled in since I was a child, but I was  instructed over the years that it could never be something I could  realistically pursue professionally. If I was wise, I’d stick with fine  art. So, after college, I primarily used these doodles and comics to  advertise commissions, events, or showings I was a part of. They were  crude, sometimes narratively and visually outrageous, horrific, and  unsettling as seen in my current work, but I had nowhere near the same  level of competency or expertise in digital art as I did in traditional  painting, so they weren’t all that awe-inspiring on the technical side.  Though, I understood the best way to drive traffic to my “serious” work  was to occasionally employ a bit of relatable or crass meme humor online  on my personal social media accounts. The internet is a fickle place  for a growing artist and I came to understand you have to play the  algorithm game to generate interest in your craft, especially if you’re  burned out on the in-person grind. My paintings were also unconventional  and disturbing, so it took special effort to get them out of the house  and into an oddball collector’s home.\n\nIn 2018, I was accepted into and spent a year or so vending at a  popular art market on Frenchmen Street here in New Orleans. This stint  in the market scene helped me to learn a great deal about how to  effectively appeal to a large audience through interactions with  thousands of tourists from all over the world coming through every night  seeking souvenirs and artwork to purchase, and from my fellow local  artists who had years of experience selling and promoting their work in  the city. Eventually I was granted the opportunity to display a  significant set of my large-scale paintings in the center of the market  for a weekend, an enormous highlight of my career as a painter. I had  plans to move on from the market and seek gallery space of my own in the  French Quarter in the hopes of refining and selling my work in a more  professional setting. This pursuit came crashing down with the arrival  of Covid-19. New Orleans was one of the first major metros in the US to  completely shut down in March of 2020, promptly killing the bustling art  scene, including the market and any public venues I may have tried to  access to grow my status in the community.\n\nWhile I was still accepting and producing painting commissions during  the lockdown, I chose to take a massive risk and pivot into solely  prioritizing my comics. Based on my knowledge of social media marketing  and having developed a strong sales persona during my time churning out  paintings, I knew diving headfirst into webcomics as a nobody with the  off-the-wall, frequently shocking themes customary to my older comics  was not at all going to fly as an introduction on a platform like  reddit, the one place I knew I could potentially quickly grow a modest  audience assuming the quality was exceptional. I’d lurked on [r/comics](https://old.reddit.com/r/comics)  for years before considering posting my own work, and continued to do  so for all of 2020, on a mission to rapidly improve my skills in digital  art and sequential storytelling, and studying other artists, their  styles, and how they maneuvered online. My first effort to arrive to [r/comics](https://old.reddit.com/r/comics)  was “Upkeep” in the summer of 2021, a slice of life gag about unwanted  female facial hair that performed very well. I continued to produce and  share comics of this style as well as heavily interacting with regular  posters in the community that I admired to establish myself, and it  wasn’t until “Quality Time” came out the following year that users on  reddit began to suspect I had a distinctly dark side. How they were able  to identify this, I still do not know. I decided then it was time to  spread my wings and unveil my true passion with the arrival of “The  Airbnb.” In the same way I would spend many months planning a collection  of paintings, I had planned for my shift into horror comedy long before  my friendly quarrel with the great u/armpit_penguin . The response to “The Airbnb” was wildly positive to my relief, and the rest is history.\n\n&#x200B;\n\nhttps://preview.redd.it/2ehs9ajolk8d1.jpg?width=2871&format=pjpg&auto=webp&s=420a4406fa1150a6ca2e8cfa4a34bea6a6fa2f32\n\n**2: Your art style signifies itself by being somewhat more realistic  and elaborate than that of most webcomic artists. Is this a deliberate  choice, do you feel what you have to say comes to right better using  this style closer to realism?**\n\nAs outlined in my answer to your first question, my style is rooted  in an academic background and an interest in high detail, dense graphic  novels, concept art, and traditional illustration. Prior to attending  art school, (where I was persistently advised against including  narratives in representational art), I produced highly detailed and  complex graphite drawings on 18x24 sheets and crosshatch heavy ink  drawings on bristol. My current style in digital comics is a stripped  down version of the sort of art I’d spend weeks upon per piece, and it’s  taken me a lot of time to “unlearn” a lot of the tedious habits I  developed in order to accelerate my output of comics, and that hasn't  been easy. I’ve gotten comments about some of the jarring stylistic  decisions I’ve made in earlier comics, and that’s a result of my attempt  to modify my former process and technique into something more  aesthetically digestible. Aside from ventures like “ELK HUNT,” I choose  to maintain mild realism in my designs as I gradually transition into  producing more longform work in the future. In short, like most, I draw  in the style I am most comfortable utilizing to portray my ideas.\n\n&#x200B;\n\nhttps://preview.redd.it/w9c41coplk8d1.jpg?width=3844&format=pjpg&auto=webp&s=91d97b9b9ce6158fad77e89c9a7084ace4b57af6\n\n**3: The lore surrounding  your comics is getting to be as intricate and involved as your art  style. Have you considered creating a wiki or database explaining to  newer readers the backstory of your characters?**\n\nI have a history of gently declining requests for “lore dumps” in  comments, other platforms outside of reddit, and even Patreon. It isn’t a  method I intend for my readers to use to extract clues from the larger  comics and understand the world for themselves. I have operated the same  way for previous projects of varying mediums, revealing a little at a  time and allowing for long pauses between additions of new material. For  reddit in particular, I’ve compiled the existing comics into an  organized list I continually add to, of which there really aren’t many,  and have highlighted the most notable entries as being crucial to the  development of the ongoing story. Other platforms, (mainly Patreon)  receive expositional written content that have accompanied pivotal  comics like “The Airbnb,” “The Chosen One,” and “Thrill Seeker,” and  ancillary content that doesn't quite fit on reddit.\n\nAt the moment, I do not have interest in preparing a Wiki or a  database, at least not until the first set of chapters of “The Velluto  Duo” have been completed and shared. I’ll then be free to be less  cryptic and vague about key events and character attributes. TVD has  been in the works for over 2 years, features 7+ chapters that each focus  on a specific character, and answers a majority of the questions I’ve  seen pop up numerous times as my one-offs have grown in popularity. I’ve  had to dedicate a great deal of time improving my art before committing  to the full story, with the current collection functioning as a means  to generate and maintain interest in what I hope to be a mind-bending  long-form black comedy. I understand some are frustrated that I refuse  to divulge anything of real substance within my standalone work, but I  can’t risk spoiling the most shocking scenes to come; carnage I’ve been  sitting on since before we knew Ellie was a bloodthirsty man-eater.\n\n&#x200B;\n\nhttps://preview.redd.it/k75lqgoqlk8d1.jpg?width=3093&format=pjpg&auto=webp&s=fdcbcda5e0367365691c01e474ae358d78e94702\n\n**4: I think the most exposition of the world you have created for your characters was seen in your recent** [**r/comics**](https://old.reddit.com/r/comics) **event \"Elk Hunt\". Was the Elk Hunt intended to explain your worldbuilding to the readers?**\n\n“ELK HUNT,'' a nauseating collection of pages one could call an  offbeat satire of my own work, came about for a variety of reasons, one  of which indeed was to act as a sort of recap of everything we've  learned about Vivian and the Castellos in the mainline comics. At the  same time, EH was not a canon series despite featuring the same cast of  characters, aside from the Hollering Elk herself. As has occurred in  previous years, the arc represented a new phase of the Elk persona,  commencing with her mysterious disappearance and death, and the  subsequent peculiar activity on all of the Hollering Elk accounts. I  wrote the comic in December and January, and planned for the arc to play  out on both Facebook and reddit, each receiving different types of  multimedia content. I did not include Instagram. I considered the app  too limiting and stubborn for what I wanted to achieve.\n\nElk has perished once before from a bizarre illness that stretched  for seven months in real time, slowly decaying with every appearance  without her ever directly acknowledging her alarming decline, and  eventually succumbing to her ailment and regenerating in early spring of  2023. “ELK HUNT” debuted on the one year anniversary of her initial  demise, and this time we witnessed the hallucinatory manifestations of  her crumbling mind, that being the outlandish antics and interactions of  the characters she created, inserting her mindless, monstrous rampage  as the central conflict, and expanding on or confirming dynamics and  theories folks have pitched about the main comics and the Hollering Elk  persona in the past. For an added layer of fun and shenanigans, the  comic itself is speculated to have been illustrated by Ellie herself in  an attempt to conceal the monumental blunder of recklessly dispatching  and mistakenly turning the beloved cryptid artist.\n\nI had no way of knowing if all of the elements of EH's introductory  phase and focal comic would reach and entertain readers as intended, but  it all went off without a hitch with the help of the [r/comics](https://old.reddit.com/r/comics)  community, including Ellen of Pizza Cake Comics who played along the  week of Elk's disappearance. It was an absolute joy to produce, and  worked wonders in helping to introduce tons of newcomers to the main  comics. I loved watching redditors try to piece it all together during  the initial chaos of the arc, engaging with the story and creating works  of their own in tandem with the main “ELK HUNT” comic. I happened upon  some true gems in between EH pages, and have noticed several artists  enjoyed an explosion in followers as a result of their contribution to  the arc. After some griping about the meta wave from some of my  followers, I made a statement sometime during the turmoil approving the  use of “rogue elk” by lesser known artists to bolster their views. I had  conflicted feelings about how much EH dominated the subreddit, but also  was thrilled to see so many new artists enjoying the spotlight that  previously struggled with obscurity. It was also important to me that I  gave my audience something truly goofy and exciting before shifting into  an era that is conversely dark and shocking in tone as we near the  release of “The Velluto Duo.”\n\nOverall, “ELK HUNT” was an absolute blast, and it will be a significant challenge to top come the next “phase” of Hollering Elk.\n\n&#x200B;\n\nhttps://preview.redd.it/mda3h7prlk8d1.jpg?width=3093&format=pjpg&auto=webp&s=fa61f8eb91ab1198fb105c3d585bdb6a2f5fa68d\n\n&#x200B;\n\n**5: You have been co-creating with other posters to** [**r/comics**](https://old.reddit.com/r/comics) **such as** [**/u/colmscomics**](https://old.reddit.com/u/colmscomics) **And** [**/u/pizzacakecomic**](https://old.reddit.com/u/pizzacakecomic)**. How did this collaboration start and what will your next shared project be?**\n\nI've developed a lot of friendships online over the years through  various art based websites and social media, but the comradery I share  with Ellen and Colm is something truly wonderful. We aren’t just content  creators who periodically collaborate, we are a genuine trio of friends  who give each other crap on the daily, like good friends do.\n\nIf I recall correctly, Ellen began posting around the time I returned  from an extended hiatus following Hurricane Ida. At the time, I was  floundering through a “throwing spaghetti at the wall” era as I  attempted to jumpstart the fervor I had before the storm. Meanwhile,  Pizza Cake Comics was experiencing meteoric success seemingly out of  nowhere. Before participating in the two million subscribers event with a  comic revealing the Hollering Elk persona for the first time, I  remember thinking how hilarious it would be for the wretched, rotting,  horror artist to strike up an alliance with the sub’s resident  wholesome, slice-of-life mom artist.\n\nShortly following “The Airbnb,” the first true horror comic I’d bring to [r/comics](https://old.reddit.com/r/comics),  I followed through on this cheeky idea, and depicted Ellen in “I Want  to Belong,” a comic in which Elk sheepishly proposes the two become  companions in spite of their dramatic dissimilarities as creators. This  would spark further back and forth on each other’s comics, and a handful  of small collaborations between Ellen and I and others, until Colm  would reach out to Ellen about an idea he had for an ambitious  collaborative comic that would require direct coordination between all 3  of us to achieve. I agreed to take part, and thus “The Elders” came to  be in January of 2023, which remains my all time favorite collaborative  comic.\n\nSince then, we kept in touch, chatting everyday until we evolved from  distant peers who occasionally collaborated into good friends with a  mutual love of the craft of comic creation. To this day, we share our  sketches, scripts, finals, and rejected ideas amongst each other, banter  and bully one another with wild abandon, and recently successfully  launched our Youtube channel, “Pen Pals,” something Colm pitched to us  in early 2023. I dragged my feet on getting my parts together for the  channel, but I’m glad I committed to it. Recording with them is  something I look forward to every week in between making comics, and it  seems to me each of our fan bases are enjoying the series as well, which  warms my heart.\n\nI’m not sure what the future holds as far as shared projects outside  of the channel. I’m simply thankful to have two great, like-minded  buddies belonging to the same sphere of internet tomfoolery that I can  chat with when I hit a rut with my work or life. Just delightful folks,  and I am blessed to have them in my life. The channel has also led to  the expansion of our cohort of comic artists, so I’m certain we can  expect all kinds of neat collaborative efforts in the future.\n\n&#x200B;\n\nhttps://preview.redd.it/zzhf5fmslk8d1.jpg?width=3093&format=pjpg&auto=webp&s=611209c400089f6b1ecb1a60819f70e3040fa6b3\n\n**6: How long does it take you to create a comic starting from the idea stage?**\n\nIn response to this question, I will describe step by step the process. It is very interesting, I assure you.\n\nI rise bright and early every morning and take care of basic chores  in a specific order: brush my teeth, make my bed, start a pot of coffee,  cook for cat, wash what is always a singular dish and fork left in the  sink from the previous night’s meal, then sit on my balcony with my  coffee for several hours and write new scripts as ideas pop into my  mind, or revisit and revise old scripts until I settle on something  compelling, relevant, hilarious (to me), or consisting of the perfect  balance of terrifying and stupid. I don’t always begin the comic the day  of choosing a script, typically taking time to run it by my mother, my  gen z friends, my patrons, and a handful of other artists belonging to  various age groups, all of this to get a feel for whether or not it is  worth committing to a full-fledged comic. If it gets enough laughs or a  specific intended reaction, I spend a day working out formatting,  panels, number of pages needed, wording of the dialogue, and all  remaining technical details before embarking on the sketch. If the  response is lackluster from my network, I will shelve the script and  revisit it another time. This stage of fiddling around with an idea can  carry on for a few days to a few weeks. “Thrill Seeker,”  for example, I  toyed with for several months before I was satisfied with the narrative  and finally sat down to sketch the pages.\n\nComics that are 7-11 pages will take about 3 to 4 days to sketch,  shorter comics about a day. Line art for comics like “The Drain” and  “Thrill Seeker” will have a timeframe of a full week, and colors another  week, sometimes more depending on the complexity of the backgrounds.  Throughout this time I am consistently sharing the progress with people I  trust to point out issues.  All together, my largest comics will take  about 3 weeks to a month to produce, while simpler entries ranging  between 1-3 pages at 4 to 5 days.\n\nSketching and drawing the final product is fairly straightforward,  and I find it to be the easiest part of the process. It is the writing  and development stage I sit with the longest, and even then it doesn’t  always land by the end! Upon completing a comic, I will send the file to  my friends to search for errors in the art or grammar if there is  dialogue. It is then “dropped” on a weekday on all platforms.\n\nThen I order chinese and sleep for 3 days straight.\n\n&#x200B;\n\nhttps://preview.redd.it/xeeg4iftlk8d1.jpg?width=3093&format=pjpg&auto=webp&s=5bdf2f9346132c8b825e840dae8a7a13fcd08276\n\n**7: You are one of our most  popular regular posters and have been getting a lot of praise, though  sometimes there is critique as well. What would you like to say to  people who \"don't get it\" or think it is \"gore\"?**\n\nI accept that I've reached a point that I should expect an avalanche  of negative feedback for the particularly “provocative” submissions,  however it was certainly bewildering during those first several  instances of reaching the frontpage or [r/all](https://old.reddit.com/r/all).  It's an odd experience being in the spotlight online at that scale for  the first time, which I'm sure many of the other regular artists here  could tell you. Early on, I learned to be unbothered by some of the more  incensed responses directed at me as a person for having the audacity  to illustrate scenes deliberately designed to upset my readers, and  nowadays I am genuinely amused by the more creative vitriol. It's the  downright vicious comments tearing me apart without any idea of what I'm  truly about that make me chuckle. I sometimes wish I could request an  exception from the moderators to allow the threads below my comics to go  untamed for my own entertainment, but I understand that isn't  productive. Unless?\n\nOn the subject of the less aggressive, general critique, it was the  impassioned discourse and long-winded insights unique to reddit that  drew me to this community in the first place. I've read spectacular  diatribes from folks who were clearly enthusiasts of the medium pleading  for me to concentrate on resolving weak areas in my writing, artistic  skill, and choice in subject matter, and I take those comments to heart.  In some ways I have improved dramatically thanks to these anonymous  individuals, and in other ways I still have a long way to go if I wish  to succeed professionally, and those flustered anons are going to keep  on me until I do. For that I am grateful.\n\nAs for the “I don't get its,” it’s difficult to judge what will and  won’t land with some readers. I’ve decided it depends on the sort of  artistic media a person is accustomed to consuming versus the subtle,  unique visual techniques and narrative devices I choose to apply in my  art, as well as the influences informing my work. In other words,  different strokes for different folks? The strange scenarios and jokes I  think up obviously make sense in my mind and to the circle of people I  share my drafts with, all with extensive backgrounds in art and  literature, but it’s impossible to expect every person who stumbles upon  my comics for the first time to grasp every odd little detail, obscure  joke, twist, or emotional theme. A lot of folks didn't ‘get’ “Thrill  Seeker” or “The Chosen One.” On the other end of the spectrum, there are  hundreds who regard these comics as some of the best I've ever  produced. There really is no in between. I respect it's often difficult  to discern what on God's green earth is going on in these got dang  confounding cartoons if you aren't familiar with the trusty catalog, but  I always encourage people to explore my pages if they find themselves  even slightly curious.\n\nWith all that said, to those who leave the dismissive comments you've  quoted, I completely get it. My comics are remarkably weird,  disjointed, worrying, manic, abstract, gross, dumb, stupid, horrifying,  and downright offensive to the eyes at times. I am a certain type of  person who draws a certain type of content meant for a certain type of  audience, and it is absolutely not an issue if you don’t vibe with it.  That is perfectly fine and I don't sweat it if you choose to voice this  to me in the comments or dms. You are entitled to your opinion, and it  would be supremely ignorant of me to demand universal praise for my  nonsense. Just remember I am also just a regular person who isn't going  to nail it every time if you are someone who has taken a liking to my  debauchery. I'm doing my best!\n\n&#x200B;\n\nhttps://preview.redd.it/i74kk6bulk8d1.jpg?width=4013&format=pjpg&auto=webp&s=c607b1a3262f60a24e721b58dcfa151906da2e62\n\n**8: Will there be a printed version of your Elk World series of comics?**\n\nI am currently planning two physical books to be printed, the first  will be the entire “ELK HUNT” comic, featuring new art, content I didn’t  have the opportunity to work into the original “meta” arc, and other  neat, strange little goodies. The second will hopefully be the full  collection of comics that preceded “The Velluto Duo,” and can be  referred to as a kind of “Hollering Elk Handbook.” The latter will take  some time to put together, considering a majority of my energy will be  directed towards producing “The Velluto Duo.” “ELK HUNT” should not be  too far off, and I will of course make a bunch of noise like the  woodland creature that I am upon its arrival.\n\n&#x200B;\n\nhttps://preview.redd.it/g1ipp7jvlk8d1.jpg?width=3390&format=pjpg&auto=webp&s=97b0bafb3fb59f4b0dd195949ead88605769a5f4\n\n**9: Is there anything you'd like to add or want to say to the readers of** [**r/Comics**](https://old.reddit.com/r/Comics)**?**\n\nI love you guys. I really do think y’all are positively delightful,  and it is a joy to create for y’all. Thank you for everything, and I  hope you enjoy what I have to offer in the near future.\n\nP.S. Stop asking me whether or not there is insect life in Ellie’s rear end. I have no way of knowing the answer. Thank you.\n\n&#x200B;\n\nhttps://preview.redd.it/f18bbj8wlk8d1.jpg?width=3826&format=pjpg&auto=webp&s=3bb53997942f4766e1219f16d47928e78adae83b\n\n[You can support Elk on Patreon](https://www.patreon.com/holleringelk)\n\n&#x200B;\n\n[Her art is also posted to Instagram](https://www.instagram.com/holleringelk/)\n\n&#x200B;\n\n[Hollering Elk collection on reddit, now including the Elk Hunt event.](https://www.reddit.com/user/holleringelk/comments/1adp8po/the_full_hollering_elk_catalogue/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
        "num_comments": 76,
        "comments": [
            "Do we really want to spotlight her? Like I feel like talking about her gives her more power. Can't we just play it safe and fear her in silence?",
            "i ain't reading all that",
            "Living in New Orleans does strange things to a person.",
            "Wait... You're from New Orleans?!",
            "Awwww you ol softie ",
            "We love you too ",
            "Question: You've said before that you were always interested in comics.  What were some that you followed or inspired you to decide \"Yeah, THAT'S how you tell a story!\"?\n\n(And \"just don't do what Rob Liefeld does\" doesn't count)",
            "You inspire me to put more effort and detail into my work. That was a great read thanks so much!",
            "We love you too Elk - don't ever change! \n\n(As another cat owner my only question is do you really cook for them?!?)",
            "I am absolutely baffeled that anyone doesn't love Thrill Seeker and TCO. Maybe they just spoke to me different. They definitely tickeled very specific aspects of my own personality. \n\nYou know you're going to get a flood of questions about the insect ecosystem in Ellie's lower GI tract now, right? Or was that a \"they read to the end test?\"... sneaky."
        ]
    },
    "Yes, father [OC]": {
        "title": "Yes, father [OC]",
        "score": 3429,
        "url": "https://i.redd.it/197pkzqmoh9d1.jpeg",
        "content": "",
        "num_comments": 150,
        "comments": [
            "Lmao yes! Same with Ms. or Mrs., and when somebody changes their surname after marriage it's never an issue. \n\nWe address people individually based on how they request to be addressed all the time, names, nicknames, marriage status, title, job position... It's not an excuse!",
            "To quote my local pastor on this subject:\n\n\"What is going on in your body and mind is between you, your therapist, your doctor, and God. Though mostly the first three.\"",
            "I hear youre a homophobe now father.",
            "Did a solid nose exhale on this one. Great comic!",
            "Petition to call any priest or pastor who complains about pronouns \"Daddy\" instead of \"Father?\"\n\n\"Daddy, I have been naughty, forgive me?\"",
            "Honorifics and pronouns are a bit different in function and history. Pronouns are descriptive of the person, whereas honorifics are more recognition of a position or relative position.",
            "I see what your saying but Father is a title like an officer and a doctor.",
            "1: no Catholic priest that lives in accordance with his beliefs would be angry that someone calls him sir instead of father, especially if the student isn't Catholic. This is just a huge strawman argument.\n\n2: A pronoun is not the same as a title. A title is a reference to what your work/social-position is. A pronoun denotes (or has historically denoted) gender, which to his eyes is unchanging. As such, while you could argue he's wrong in thinking gender is unchanging, it makes no sense to argue he's being inconsistent in his views.",
            "Ah yes, this argument again.",
            "Some folks will literally call a grown man Kid Rock, but still refuse to say Elliot Page."
        ]
    },
    "Glasses": {
        "title": "Glasses",
        "score": 1161,
        "url": "https://www.reddit.com/gallery/1dr8zh0",
        "content": "",
        "num_comments": 33,
        "comments": [
            "Why my boy Bruce working at the Daily Planet? How come he broke?",
            "There was only 1 premise swap in this comic.\n\nIs everything ok?",
            "What did Superman kill??\nI NEED TO KNOW WHATS ON THESE NEWS ARTICLES IN THE BACKGROUND",
            "glasses make the best disguise",
            "Batman realizing he can't take off his glasses to get hotter like\n\n![gif](giphy|otP85UTRethni|downsized)",
            "Do you think Superman has his own Pocket Souperman?",
            "In an old comic, Superman has a nightmare in which he finds out that the glasses aren't fooling anybody--his friends all know that Clark is Superman, they're just playing along. \"We don't have time for this! Change into the cape and save us!\"",
            "Is it me or is anyone else curious about the Superman articles displayed on the back wall? Id like to know more about the lore of The Other Ends Superman.",
            "\"SUPERMAN KISSES ENTIRE FORGET WAR\".\n\nPerhaps: SUPERMAN KISSES ENTIRE WORLD, FORGETTING WAR ON WORLDS",
            "I think Bruce is actually Catwoman. I mean if pecs can look like boobs then I bet boobs can look like pecs."
        ]
    },
    "YOU OK? (OC) ": {
        "title": "YOU OK? (OC) ",
        "score": 8059,
        "url": "https://www.reddit.com/gallery/1dqx6rs",
        "content": "Sorry for the repost. Hope you guys are good. https://www.instagram.com/davecontra",
        "num_comments": 89,
        "comments": [
            "At least he didn't touch anything else with superglue hands,  he'd have to share a bathroom with Vader",
            "The new comics meta is wild. ",
            "The other dude is really concerned in the last panel because he just realized there is also superglue on his shoulder and his hand is stuck as well",
            "Well, tbf, that _is_ pretty tough. This comic is really just a slice of real life.",
            "Ok, you got me.\n\n![gif](giphy|LycfkVG4L6x0Y|downsized)",
            "I superglued my thumb to my forefinger once",
            "Reminds me of these activists that glue themselves to things or to the street. There was that guy from germany that used some additional chemicals and even the firefighters could not get him free afterwards, they had to cut the entire block of concrete out of the ground and get him to the hospital with that big thing on his hand.\n\nLike always, a great comic! Love your work!",
            "I guess he cant get his hands off his face, eh? Heh. Ha ha.",
            "Well at least he didn't glue his balls to his butthole... Again",
            "I expected a twist! But noo not this"
        ]
    },
    "One of those days [OC]": {
        "title": "One of those days [OC]",
        "score": 1459,
        "url": "https://i.redd.it/qhz68pskkg9d1.jpeg",
        "content": "",
        "num_comments": 47,
        "comments": [
            "White on light blue might not be the best choice for readibility.",
            "waking up to do the list",
            "News: Comic artist sentenced for life for using white text on light blue",
            "God! That and spam calls! I work nights! If you want to get cussed out by a pissed off CO then call me at 10am. I cussed the solar panels guy, my mom, and the bank, and I'll cuss you too!",
            "What happened on the debate?",
            "As a non-American, I'm just getting the popcorn ready. At least laughing about your bullshit distracts me from our local bullshit.",
            "The funny is gone :(",
            "Oh look. More both sides bad propaganda. Biden didn't do well at the debate. But, he's still lied a hell of a lot less than the other guy. Isn't trying to be a dictator. And isn't a convicted felon.",
            "Why do you think hes squinting in the last panel?",
            "Norton/midnight commander: what?!\n\nActually, white on blue is very contrast and comfortable."
        ]
    }
}