{
    "Welcome to r/comicbookmovies!": {
        "title": "Welcome to r/comicbookmovies!",
        "score": 7,
        "url": "https://www.reddit.com/r/comicbookmovies/comments/1am5olj/welcome_to_rcomicbookmovies/",
        "content": "Hello! If this is your first time coming here: Welcome! We are glad you are here! If you are a current member, welcome back! This post will be your source for clarification on rules, how to reach mods with any issues and any other potential issues in the future. \n\nWe want to start by saying first and foremost that this is a safe, fun space for all. We ask that you are kind and respectful to others when you comment, reply or post. We want everyone to enjoy their time here and to feel included. So please, be respectful of others feelings, likes, choices, etc. While we try not to ban people for minor offenses, being repeatedly disrespectful of others, homophobic, sexist, racist, hateful, etc. will likely result in an immediate permanent ban. If you believe you are a target of any of this, please do not engage and instead report the incident, as engaging could also result in your ban, as well.\n\nThis sub is a informative sub first. Any news related to movies, shows, games, comic, animations, etc. is our focus here. Other content such as, but not limited to: Rankings, Questions, Casting Choices, VS, etc. If you would like to post this kind of content, another sub related to that topic would be a better choice for you. We do allow these kinds of topics to be posted on Sundays 12AM ETS, but they must also follow the rest of the rules for this sub to be allowed.\n\nReddit, along with other social media, has been overflowing with scam and bot accounts in recent years. To try and combat this, we have created an automod to ban any accounts it believes to be an issues. If your account has been banned, there is a good chance the automod has blocked your account for a variety of reasons. We do our best to prevent bots, scams, trolls, etc. from coming to this sub. For this reason, if the automod believes your account to be one of these possible types of accounts, it will automatically ban your account. Some reasons the automod may ban your account are, but not limited to:\n\n\\- Your account is new and/or low karma\n\n\\- It detects your IPS Address coming from a known spam/bot Address\n\n\\- You had a previous account already banned\n\nIf you believe your account was ban inappropriately, please message the sub itself about this issue. When messaging, please be respectful and understanding of the situation. If you are disrespectful and inappropriate, we will likely keep the ban in place. Personally messaging Mods will also result in the ban staying in place. Reply to the ban message respectfully, and a mod will get to you as soon as possible.\n\nHopefully this is helpful to yourself and will help you while being apart of this sub. We hope that if you are new you will follow the sub and add to the community. Again, we welcome you here and hope you have a great day!",
        "num_comments": 0,
        "comments": []
    },
    "New Stills from ‘Deadpool & Wolverine’ - In Theaters July 26": {
        "title": "New Stills from ‘Deadpool & Wolverine’ - In Theaters July 26",
        "score": 147,
        "url": "https://www.reddit.com/gallery/1dqzkwl",
        "content": "",
        "num_comments": 19,
        "comments": [
            "I wonder is Deadpool is going to make a Princess Diana because the Cassandra actress",
            "Trying not to be too excited for Cassandra Nova because there's no way they're letting her be as horrible as in the Morrison run.",
            "Female version of James McAvoy",
            "Oh shit, Mrs clean is in this.",
            "Thought that was Dennis Leary lol",
            "I'd love it if Legion shows up to deal with Cassandra",
            "Yikes. What's going on with the lighting here? Looks like a soap series.",
            "Buthe was in the trailer?",
            "He was in two of the trailers already.. where have you been?",
            "Maybe they're just excited, damm"
        ]
    },
    "Official Still from ‘Agatha All Along’": {
        "title": "Official Still from ‘Agatha All Along’",
        "score": 652,
        "url": "https://i.redd.it/gwpdiliorb9d1.jpeg",
        "content": "",
        "num_comments": 134,
        "comments": [
            "It looks exactly how I expected it to look",
            "Love Kathryn Hahn, but it feels as though this is coming out about 2 years too late to really capitalize off of the momentum from Wandavision.",
            "I wouldn't care at all about this show if is wasn't for Kathryn Hahn, c'mon, you gotta love her",
            "I can't bring myself to care that much about this project.",
            "Someone let me know when this show is over whether it's worth watching or not.",
            "who cares at this point",
            "The title was Agatha all along. ALL ALONG?!",
            "Are they gonna sing about the power of the hex?",
            "This looks like the set and production quality of Disneys *Descendants*, Jesus Christ Im so sick of the shit Disney production quality with marvel and star wars",
            "Yeah, this ain't it chief"
        ]
    },
    "‘Deadpool & Wolverine’ Official Teaser Trailer - Wolverine Fights Sabertooth": {
        "title": "‘Deadpool & Wolverine’ Official Teaser Trailer - Wolverine Fights Sabertooth",
        "score": 195,
        "url": "https://www.youtube.com/watch?v=6cBbfsUSNqg",
        "content": "",
        "num_comments": 40,
        "comments": [
            "I need to stop watching these trailers. My hope is renewed but damn I wish I saw this in the theater instead. Regardless oh, my God!!",
            "If true, cause I dont want to watch, did they need that spoiler in the title?",
            "With the Madonna in the background is *making* this movie",
            "Ngl, I'm disappointed it's not Liev Schreiber's Sabertooth.",
            "I think it was assumed or leaked awhile back that Sabertooth would be in it but like, did we need a trailer that fully shows it?",
            "I like how each depiction of him in movies gets him hairier and hairier the farther along in the timeline it goes.",
            "Forced, like almost Everything Ryan does",
            "Hopefully that line was really meant for a Hulk fight",
            "Am not liking seeing this wolvie after Logan, may be age is catching up. But still to those who are interested, enjoy.",
            "The significants is the 20 years weve waited to see this on the big screen!"
        ]
    },
    "Madame Web | Spider-Women Training and Behind The Scenes": {
        "title": "Madame Web | Spider-Women Training and Behind The Scenes",
        "score": 484,
        "url": "https://v.redd.it/ybg5e8j5u69d1",
        "content": "",
        "num_comments": 72,
        "comments": [
            "All that shit they show in the clip was like maybe 90 seconds of the whole movie. Why even go through all this training? Such a shit-show",
            "Imagine putting this much effort into a movie only for it to end up like that.. I honestly feel bad for the actors and the rest of the crew.",
            "Adam Scott walking in like, \"How did I end up in this piece of shit?",
            "I'm really curious to see what this movie would've looked like without the studio interference.",
            "I bet modern film making is weird as fuck for actors. You do all this stuff that feels like acting work, put in effort on wires and whatnot, try your best on green screens because who knows they could replace all this or just use my performance for cg reference anyways, so you really have no idea if this is the best thing you've ever made or the worst.",
            "This video has more footage of the girls in their suits than the actual film.",
            "What a waste of time",
            "Everyone is like look at all the effort in something that last only 90 seconds. That's what moviemaking is. I was around the area where they shot Suicide Squad's car chase with Joker and Harley and in the prologue. They keep doing laps over and over and over again and that scene was barely featured in the finish film (maybe in the extended cut).",
            "All that training for just a terrible flick...",
            "At least Isabel can take some of this training with her to Hawkgirl. "
        ]
    }
}