{
    "NA Pro Scrims - June 28, 2024": {
        "title": "NA Pro Scrims - June 28, 2024",
        "score": 11,
        "url": "https://www.reddit.com/r/CompetitiveApex/comments/1dqu5hg/na_pro_scrims_june_28_2024/",
        "content": "**NA Pro Scrims (2x Bo6)**\n\nSet 1: 3 PM PT / 6 PM ET\n\nFormat: Bo6 (3 WE + 3 SP)\n\nSet 2: 5.30 PM PM  / 8.30 PM ET\n\nFormat: Bo6 (3 WE + 3 SP)\n\n**Info:**\n\nCalendar: [Minustempo Calendar](https://docs.google.com/spreadsheets/d/1Ca_ixagdxMgSn9zeT8ZBwJmgtTt9i3wR59BfV1htkPY/edit#gid=1286679697)\n\nTeamstream: [teamstream.gg/](https://teamstream.gg/events) (See live events for scrim POVs)\n\nRosters/Drops: \n\nhttps://preview.redd.it/gkf8myccz05d1.png?width=677&format=png&auto=webp&s=c0ab109e674e6fecb02a3433a6c51eaada1a79bc\n\nhttps://preview.redd.it/mf0q4vvanz8d1.png?width=1107&format=png&auto=webp&s=3b91bc428f66107c90377a9507eb947a621e8e1d\n\n**Scrim Priority: Performance scrims till groups released.** \n\nTeams: TBD - See comments.\n\nNotes:\n\n1. Teams are set \\~60 mins prior to scrims starting.\n2. Not all teams will stream. If they are streaming, they will have a green circle in Teamstream.\n3. Scores **may be** released through the Oversight bot (mostly NA players). They will be tweeted after. Feel free to post scores in the thread. [twitter.com/\\_minustempo](https://twitter.com/_minustempo)\n4. Possible Watch Parties:\n   1. [twitch.tv/nicewigg](https://www.twitch.tv/nicewigg)\n   2. [twitch.tv/greek](https://www.twitch.tv/greek)\n   3. [twitch.tv/AyeJHawk](https://www.twitch.tv/ayejhawk)\n   4. [twitch.tv/claraatwork](https://www.twitch.tv/claraatwork)",
        "num_comments": 21,
        "comments": [
            "June 28th Results\n\nhttps://preview.redd.it/055n10inff9d1.png?width=1920&format=png&auto=webp&s=92ede1a1579951e8035aed063704a041d8afc85d\n\n[AvC Stats](https://apexlegendsstatus.com/tournament/results/5260/Overview)",
            "Supposedly only 13 teams signed up. Dear god.",
            "Block 1 is canceled! Block 2 at normal time! \n\nhttps://preview.redd.it/12d9eaml2e9d1.png?width=494&format=png&auto=webp&s=1857d13c99814b4473289289cc97a1429341886e",
            "Teams are taking a little break, if they were paid more I’d say it’s insane, but most of them aren’t making enough to treat it like a full time career",
            "I'm not sure, but it seems like Timmy's gameplay with Moist is mostly camping. When he was with DSG, they were doing unexpected things which made it entertaining to watch them play.",
            "Tf happened with Tsm today? I know verhulst went away for a game or two but thats it",
            "Ssg vs falcons should be fun to watch",
            "is tsm not streaming?",
            "What were the draft results for BvC?",
            "New patch and only 13 teams? These pros aint serious"
        ]
    },
    "Global Top 25 Power Rankings Week 4 (Y4-S2)": {
        "title": "Global Top 25 Power Rankings Week 4 (Y4-S2)",
        "score": 44,
        "url": "https://www.reddit.com/r/CompetitiveApex/comments/1dqkl8h/global_top_25_power_rankings_week_4_y4s2/",
        "content": "**Apex Legends World Rankings - Year 4 Split 2 Week 4**\n\nCHECK OUT OUR WEBSITE TO SEE INDIVIDUAL BALLOTS: [KPPoll.com](https://www.kppoll.com/)\n\n**Introduction**\n\nThis is the KP Poll! These Power Rankings are a collaborative effort between the Subreddit, Discord, and the greater community. Rankings are determined by a selective panel consisting of members of both communities, as well as notable talent and creators from the scene.\n\n**How it Works**\n\nThis ranking is based on the AP Top 25 rankings common for collegiate sports in the US. Every panelist is given a ballot to submit their personal ranking of the top 25 teams. Similar to Apex, the higher a team is placed on a ballot the more points they earn. A #1 spot on the ballot gets that team 25 points, with each subsequent place receiving one less point all the way down. The points totals are then tallied up across all ballots to get our consensus Top 25. Teams that received votes, but not enough to break into the threshold will be included as honorable mentions.\n\nIt is by design that there are not strict guidelines panelists on how to rank teams. However, emphasis is put on the global nature of this ranking. Every panelist is asked to consider what these teams would look like in a LAN environment right now, and what are their chances of getting there. This is because at LAN there are only so many spots for the larger regions. Not every strong team can qualify, meaning some teams in larger regions may be absent from this list in favor of teams from the smaller regions that are on pace to qualify for LAN.\n\n**World Top 25 Ranking**\n\n[Y4S2W4 Power Rankings](https://preview.redd.it/zaflkeaujb9d1.jpg?width=900&format=pjpg&auto=webp&s=786445de3102c6d64ef1c4eb789c866feab91524)\n\n**Others receiving votes:** GHS Professional (76), Weibo Gaming (66), Pioneers (63), SaWeiQi esport (55), Not Moist (52), XNY (48), GoNext Esports (47), Cloud9 (42), NORTHEPTION (31), F/A Kids (31), Aurora Gaming (29), Riddle (22), Blacklist International (21), Danish (17), Flat (12), Las Vegas Inferno (12), Oblivion (6), Disguised (5), cybercats (4), Weave (4), CCE UCX (3), Atlas (3), FLUFFY AIMERS (3), EXO Clan (3), VortexWolf (3), Enter Force.36 (2), HAO (2), Dragons Esports (2), Kinotrope Gaming (2), EVOS PREDATOR (1), and Reignite (1).\n\n**Thank you to our Liquipedia editors, Reddit Moderators, and community panelists this week:**\n\nThis week's voters: Arioly, AyAyRon, Bereft, BerryManly, BurkeTheNerd, Cutty, Davidisinthere, Epoch, Exohexoh, gandalf45435, GhettoDanny, Hokuboku, JevvyMedia, jurornumbereight, KalaColor, Karbasher, Krusade, MachuMichu, PalkiaOW, Raileyx, Sh00k, Tobric, TONYPIKACHU, Vivarus, warriorc4jc, Zorkmead\n\n**Special thanks to:**\n\nHugo from ApexLegendsStatus, Tom from Esportsgg",
        "num_comments": 24,
        "comments": [
            "Who is possibly still putting DSG in their top 25",
            "Liquid should probably be above SSG. 8 points behind them in PL with one less set under their belt. Not to mention they've been hotter in recent weeks.",
            "Falcons are washed",
            "Let’s go Team Liquid!!!",
            "NiP plays one set, places 15th, and stays put at 16th. beautiful stuff everyone\n\n(i know they dropped a large number of points but still)",
            "What's going with SSG? They have the most firepower and Phony is allegedly top 5 IGL, shouldn't they be above and beyond the rest of the pack?\n\n\nLiquid doing better but I wouldn't be surprised if they do bad at lan again (hoping I'm wrong about that). Something's off with the team.",
            "I have no idea who is that delusional. I'm not gonna search through the boards, but I'd love to hear someone explain why they are top 25 in the world still.",
            "Puro Pinche Liquid!",
            "my biggest worry with TLAW is yanya has been struggling this split, when your best player isn’t playing their best it’s hard to stay consistent, they were close for me but Phony > yanya in a MP lobby",
            "Absolutely washed "
        ]
    },
    "NA ALGS needs more pro matches": {
        "title": "NA ALGS needs more pro matches",
        "score": 33,
        "url": "https://www.reddit.com/r/CompetitiveApex/comments/1dqxxwd/na_algs_needs_more_pro_matches/",
        "content": "I sound like a no life here but I think we need more ALGS matches. I want to watch my favorite team play more and even though one match can last 25 minutes and there are only 6 matches one weekend, the team I'm rooting for might die early 3 out of 6 matches. If you root for a team in group C and let's just say they average 10-15 minutes play time, you have watched your favorite team for 40-55 minutes and now you have to wait a whole week or two before you can watch them again.   \n  \nLAN there are no pov's if I'm not mistaken, so maybe I get to watch my team for like total of 5-10 minutes and only during fights? I'm no expert but to me that seems very little, I get that there are multiple regions and teams, maybe a few tournaments nobody takes seriously outside of it but yeah I just wish I could watch my team compete more than they currently do.\n\nFrom June 1st to July 5th  \nMatches group A: 5   \nMatches group C: 4  \nMatches group B: 5  \n\n\nI just would like a discussion, am I silly for wanting more?\n\n",
        "num_comments": 16,
        "comments": [
            "Nothing wrong with the amount of matches in a split but there's so much downtime between LANs and the next splits",
            "There needs to be more LAN's if anything, its hard because you require so many teams to run a LAN, but maybe there could be regional lans as well? 20 teams? not sure how you would format.",
            "ALGS? nah.\n\n  \nneeds another tourney series/circuit though. something to fill up the schedule in between splits. a problem though is some of these pro teams don't take non-ALGS tourneys seriously, even with cash on the line.",
            "1. There are POVs on lan, on [faceit.com](http://faceit.com). \n\n2. Gotta think of the players, some have jobs or commitments outside of ALGS\n\n3. At Worlds the bracket stage has 8 games in each round, which is right on the border of being too many\n\nKeep in mind that there is also long breaks between games so adding on one game adds like 30 mins minimum to the broadcast",
            "Honestly the scene just needs more tournaments to fill the ALGS gaps. I agree that you really only get to watch a team in a handful of match days per year, if you don't include scrims.\n\nI personally want to also see Pro League teams going up against more non-PL teams as well. The EWC qualifier was great at setting that up, and we saw some PL teams underperform when not in a comfortable, pre-planned lobby.",
            "The pro league prize money is nearly not worth it to play extra games. If you win the league it's 20k and there's an org cut as well. They scrim all week, vod review, train. I don't think that's enough compensation. But yeah if the esport is bigger in terms of money I'm sure there'd be more games. The break between championship and the next split is so long typically which is annoying.",
            "> I want to watch my favorite team play more and even though one match can last 25 minutes and there are only 6 matches one weekend, the team I'm rooting for might die early 3 out of 6 matches.\n\nhow does this change with more matches? If anything it exacerbates the problem of \"deadtime\" watching because they're just going to go out early in half of the extra games too. \n\nIf you're an underdog enjoyer and your team is comfortably sitting bottom half most weeks, that's just life.",
            "Each split has 10 sets (9 days + regionals), 6 games each set including regional finals which has a minimum of 6 games, that's at least 60 games over the span of two months, there are more than enough games, the only teams who would benefit from even more games are the mediocre teams on the edge who could make LAN if they theoretically had more games to play and did well, I'm not one for awarding mediocrity in competitive play",
            "Nah, 6 matches is boring. I'm always down for more.",
            "Good idea, but logistics makes it hard. They could do what Japan does with their Apex Festival. Also, they could hold a LAN in each region, except for SA. But again, total costs would probably not be worth it for EA/respawn."
        ]
    },
    "Privacy Quiz Show [Coaches Edition]": {
        "title": "Privacy Quiz Show [Coaches Edition]",
        "score": 54,
        "url": "https://www.reddit.com/r/CompetitiveApex/comments/1dqpa0x/privacy_quiz_show_coaches_edition/",
        "content": "**Privacy Quiz Show \\[Coaches Edition\\]**\n\nStarting: June 28th 21 CET / 15 EDT / 12 PDT\n\nMain stream: [twitch.tv/priv4cy](https://www.twitch.tv/priv4cy)\n\n**25 Questions split into 5 themes:**\n\n* ALGS Stats\n* General Knowledge\n* Weapons\n* Legends\n* Zone calling\n\n**Contestants:**\n\n1. [Talmadge](https://liquipedia.net/apexlegends/Talmadge) - [twitch.tv/talmadgeapex](https://www.twitch.tv/talmadgeapex)\n2. [Don](https://liquipedia.net/apexlegends/Don_(Australian_player))\n3. [Draugr](https://liquipedia.net/apexlegends/Draugr) - [twitch.tv/DraugrAU](https://www.twitch.tv/DraugrAU)\n4. [Zz](https://liquipedia.net/apexlegends/Zz)\n5. [Raven](https://liquipedia.net/apexlegends/Raven) - [twitch.tv/raven\\_apex](https://www.twitch.tv/raven_apex)\n\n(streams will be added if they are streaming)\n\nhttps://preview.redd.it/o9eojaodac9d1.png?width=1080&format=png&auto=webp&s=e2c6fb10ae872b7efbc1d232010e3acd67bcc8c7",
        "num_comments": 23,
        "comments": [
            "Final Scores:\n\nhttps://preview.redd.it/vbzrxvabhd9d1.png?width=672&format=png&auto=webp&s=90696b0de78cf05e8afc4901e0ca41bb86879550",
            "Draugr missing the first 2 questions and Raven calling him out saying \"he must have been streaming sniping then\" is funny af",
            "Raven's mic peaking when he freaks out is so funny",
            "Lol “let’s take a field trip to the firing range”",
            "This is very refreshing",
            "This is some great content",
            "you deserve this! Is a good watch for everyone new to Privacy quiz stream.  100% recommend!",
            "I watched the last one, it was fun! Definitely going to watch this",
            "Eu timezone added, hugeee 😄",
            "Talmadge looking at chat kinda defeats the purpose of this quiz right?"
        ]
    },
    "MST coach stream sniping in scrims": {
        "title": "MST coach stream sniping in scrims",
        "score": 444,
        "url": "https://clips.twitch.tv/PatientLachrymoseCourgetteBleedPurple-nZvpieFaYVdoNwwf",
        "content": "",
        "num_comments": 121,
        "comments": [
            "[Reddit comments aren't working, this isn't isolated to our subreddit](https://x.com/redditstatus/status/1806512296560324788)",
            "For context: BLEED and MST were fighting over the pills in tunnel for game 4 and 5 (BLEED 2-0'd them), BLEED cooked a plan to take the jump tower to Sky East off of dropship and loot their building while MST were landing tunnel to contest in game 6.",
            "Hey let's not jump to conclusions.  Maybe their new coach is Professor X.",
            "isn't that just straight up cheating?",
            " Stream sniping only to get 2v3'd is wild",
            "Bleed fucking memed and hit the bait and switch on Moist who had no idea till Draugr told them and they still got 2v3d. Having 3 0 point games over a Survey tunnel and sniping in scrims might be the most insane shit we have seen from NA in a while. Come on man, just drop the ego and play your game out with the intent to make LAN, not this bs.",
            "Can’t lie raven and them cooked with the plan to land on grandma’s jump tower and take the sky east building. Insane bait.",
            "This should legit result in some kind of suspension from oversight scrims. Blatant streamsnipe with no punishment is not a good look ",
            "just here for the popcorn",
            "Worse than anything dezignful ever did lol"
        ]
    }
}