{
    "Why do boys like to lay in between your thighs?": {
        "title": "Why do boys like to lay in between your thighs?",
        "score": 218,
        "url": "https://www.reddit.com/r/confessions/comments/1dr0nc1/why_do_boys_like_to_lay_in_between_your_thighs/",
        "content": "I’m just a girl wondering why they do this???? Anyone have any thoughts?",
        "num_comments": 77,
        "comments": [
            "I was laying on my wife earlier. Couple thoughts- it’s affectionate, it’s intimate, there’s a degree of sexy to it… it’s just nice man.",
            "Same question for why every girl I ever was with decided my chest was the perfect pillow for her. ",
            "World cold, world hard\nThighs soft, thighs warm",
            "Because it is fucking awesome.",
            "We just like being so close to such immense power",
            "It’s comfy, relaxing and therapeutic and when she gets to softly scratching my scalp and neck I’m about to pass out into another realm of peace",
            "As an older guy its not about sexuality. It’s about intimacy.  Being tangled up with someone is where love lives.  Just the closeness is what’s it all about to me",
            "It’s comfy there. Plus we know your kitty is only inches away",
            "It’s warm.",
            "Intimacy. It's a compliment and sign of trust.\n\nAnd what someone else said about crazy vagina Voodoo."
        ]
    },
    "I wanna see a guy jerking off to me. ": {
        "title": "I wanna see a guy jerking off to me. ",
        "score": 221,
        "url": "https://www.reddit.com/r/confessions/comments/1dqlkmg/i_wanna_see_a_guy_jerking_off_to_me/",
        "content": "I have many kinks but lately I fantasize about some random guy touching himself thinking about me. I find it incredibly hot. To think I'm someone's dream. And i wanna make their wish come true. I wanna get praised and fcked by a guy who's in love with me. ",
        "num_comments": 136,
        "comments": [
            "rip your inbox",
            "It's a great concept when it's in your head, as soon as it's out in the real world and the reality of a load of random guys messaging you offering to have a wank over you on Reddit sets in it kind of ruins the once amazing thought.",
            "I wouldnt be surprised if gay dude typed this",
            "Thats a lil fetish of mine. I love receiving videos of it, and watching in person!!!!",
            "Double it and give it to the next person",
            "Swap genders and I’m right there with you",
            "I think SIMPs have already started massaging you after your post. Haha ",
            "Dude.  Get back to work.",
            "r/tributeme ?",
            "You a dude?"
        ]
    },
    "this entire sub is just sexual clickbait what": {
        "title": "this entire sub is just sexual clickbait what",
        "score": 208,
        "url": "https://www.reddit.com/r/confessions/comments/1dqjsrb/this_entire_sub_is_just_sexual_clickbait_what/",
        "content": "atleast make it believable 💀",
        "num_comments": 21,
        "comments": [
            "Bu... bu.. but but please sub to my OF pleaseee",
            "I mean yeah but there are genuine confessions here and people still troll because it's not modded I don't think",
            "I would say 25 percent is creative writing exercises, some much better than others.",
            "Youmustbenewhere.jpg",
            "We need to petition the mods to set up a bot that automatically prefaces every post with, \"Dear Penthouse Forum, I can't believe this actually happened to me but...\"",
            "I just came to that",
            "Idk, I tried to get things off my chest and was told to \"stop bitching\" on this post and I was just so confused.",
            "It is",
            "Literally 😭",
            "I didn't want to believe this post because of the few times I get notified of a certain popular post from the sub. But once I took a little scroll through, your words couldn't have rang truer lol"
        ]
    },
    "Husband upset if I tan outback since we have a nosy neighbor": {
        "title": "Husband upset if I tan outback since we have a nosy neighbor",
        "score": 192,
        "url": "https://www.reddit.com/r/confessions/comments/1dqi13h/husband_upset_if_i_tan_outback_since_we_have_a/",
        "content": "Me and my husband bought a house a few months ago. I’ve always dreamed of being able to tan naked without causing any issues. So now we have a backyard I can comfortably do this in. \n\nI started tanning every other day and love it, only one problem. The neighbor who lives behind us saw me tanning while he was doing yard work. I noticed him looking over the fence a few times. No big deal. \n\nSo I think he catches on to my schedule and now every time I’m tanning he’s doing some yard work. I was thinking maybe a coincidence? I can’t get upset if he’s doing yard work right? Ignored the situation and brushed it off again. \n\nThe next day I went to tan again. Of course, he comes outside to do MORE yard work! At this point I’m pissed so I confront him. He told me he wasn’t trying to look as he needed to trim hedges. I told my husband about the situation and he went to talk to him about it. It ended up with a fight and now an ongoing conflict between them. I can no longer tan without my husband getting upset. I should’ve kept my mouth shut and ignored it. ",
        "num_comments": 188,
        "comments": [
            "Have your husband go tan naked",
            "Home depot sells portable privacy fences for pretty cheap. Just buy one and pop it up every time before tanning. Should have did this as soon as you noticed dude being a creep.",
            "“Trim hedges”\n\nLol",
            "Should’ve stopped tanning to see if his schedule changed as well. But nah more than likely he caught on and wants to peak. Probably even thinks you’re seducing him",
            "His wife was probably super happy he was doing all of that yard work too.",
            "This is why I’ll only purchase a home that has a ton of land and a huge distance between my neighbors. It’s only gonna get worse from here, my dads had an ongoing fight with our neighbors for the last 15+ years",
            "Tanning is shit for your skin anyway",
            "You’re a grown up, right? Come on. Let’s all just be real. It’s not that hard. Want to be naked in front of the neighbors? Do that? Want your husband to feel insecure, jealous and weird? Do that. But stop acting like you’re too dumb to know what’s going on.",
            "There are TANNING bikinis that let the sun in so you end up with no tan lines. Up close you can tell they are transparent, but you could easily wear one of them and no one could tell its a tanning bikini from about 50 ft away. Buy one of those, cheaper than a fence or landscaping. I cant remember where I got one, but we live on a lake and neighbors are about 500 ft away so could never tell that my suit is basically transparent.",
            "My girlfriend loves having the window shades open, and we’re on the first floor of an apartment complex. The living room window is right next to the couch where she will lay naked and the window looks out to a walkway about 12 apartments are connected to. She gets upset when I’ve mentioned it seems she wants people to see but she says no one can see in. So I walk out naked even further from the window and she goes OMG put some clothes on!! …I thought they couldn’t see in?"
        ]
    },
    "I'm smoking weed and looking at porn": {
        "title": "I'm smoking weed and looking at porn",
        "score": 11,
        "url": "https://www.reddit.com/r/confessions/comments/1dqzoba/im_smoking_weed_and_looking_at_porn/",
        "content": "",
        "num_comments": 20,
        "comments": [
            "Username checks out",
            "What site and what vid?",
            "I do this every day",
            "Taking a dab naked ;)",
            "I'm also gonna do this later.",
            "Absolutely radical, dude.",
            "Welcome to being an adult.",
            "Sounds like a great Friday night!",
            "What do you want? A high five??\nGood on ya champ, join the club.",
            "welp,if you like hentai consider taking a look at my twitter page dude,lmao"
        ]
    }
}