{
    "r/Confession is not r/AMA - Do not post an Ask Me Anything here": {
        "title": "r/Confession is not r/AMA - Do not post an Ask Me Anything here",
        "score": 551,
        "url": "https://www.reddit.com/r/confession/comments/126xkib/rconfession_is_not_rama_do_not_post_an_ask_me/",
        "content": "For some weird reason, we have seen an influx the past few weeks of people hosting geographic AMAs here on r/confession. \n\n“Ask me anything about living in…..” \n\nWe’re not sure why these continue to get posted here, but they do not belong here and never have. r/AMA is the dedicated subreddit if you are interested in holding an AMA. This is r/confession. As the title implies, it is a place to post confessions. \n\nPlease continue to report these posts if you see them, so we can remove them. \n\nMoving forward, anyone who posts an AMA here will be banned.",
        "num_comments": 0,
        "comments": []
    },
    "I faked an accent at work and now I’m lying to people about my nationality.": {
        "title": "I faked an accent at work and now I’m lying to people about my nationality.",
        "score": 329,
        "url": "https://www.reddit.com/r/confession/comments/1dqzfk2/i_faked_an_accent_at_work_and_now_im_lying_to/",
        "content": "I was born in the USA and English is my first language. I’m as white as copypaper and don’t have a trace of Latin heritage in me. A few years ago, I started a new job and when meeting my coworkers I was speaking with a faux Spanish accent. I don’t have any idea why I did it, maybe nervousness. Anyway, I’ve been doing it ever since I got hired, and now it’s almost effortless to speak with an accent. That isn’t the part I regret though… lately, as I’m meeting new people and feel more comfortable talking to people, I get asked almost daily where I’m from. I’ve noticed people seem really confused if I tell them I’m from the area and usually say “oh, but you sound like you are from South America or somewhere.” So, as of recently I just tell people I’m from Argentina, since that’s easy enough for them to buy and not pester me about it. I feel like such a scumbag for lying but I feel I’m in too deep to stop now. ",
        "num_comments": 136,
        "comments": [
            "how do people even get in situations like this lmao",
            "Ross from Friends lol.",
            "Start slowly pretending like they are rubbing off on you and start sounding more and more American until it’s normal \n\nThey’ll just think your accent accustomed",
            "How has no body tried to speak with you in Spanish...?",
            "Hilaria? Eres tu?",
            "Sounds exhausting.",
            "Alec Baldwin's wife, Hilaria. Exactly.",
            "I will never understand how people lie so much that they get to this poiint",
            "… Hilaria?",
            "Tell them you're taking elocution lessons to get rid of your accent. Say it's always bothered you and you want to speak English with an American accent. Phase it out over 4-6 weeks. Now you've dropped the accent and everyone will be patting you on the back for doing such a great job."
        ]
    },
    "Decided to be petty and give my old job a 2 day notice": {
        "title": "Decided to be petty and give my old job a 2 day notice",
        "score": 17,
        "url": "https://www.reddit.com/r/confession/comments/1dr40mx/decided_to_be_petty_and_give_my_old_job_a_2_day/",
        "content": "My manager at my old job was terrible. I was a good worker and she overworked the hell out of me because I had lazy coworkers and she didn’t wanna deal with them. She would also give me attitudes when I would take PTO which was like 2 days every other month and she even told me one time that if I didn’t wanna work then McDonald’s was hiring down the street. Was weird because I was literally outperforming the rest of the team and they would take more PTO than I would. \n\nGot sick of her mess and decided to be petty and didn’t even give her the courtesy of 2 week notice. She didn’t deserve that. Instead, I smiled at her and handed her a 2 day notice at the end of the day on a Tuesday which stated, “Thank you for the opportunity to work here. My last day will be Thursday” to which she said, “Alright, I see how it is”. Fridays were our most busiest days of the week so I purposefully decided to quit a day before then so I could teach her a lesson so she could feel the pressure of my absence and learn from her mistakes. Had a job lined up after that so I didn’t really care. \n\nAt the end of the day on Thursday, she didn’t even say goodbye. She was like “Go clock out now” and I said “Oh okay” with a slight grin on my face and those were the last words we ever spoke to each other lmao. Was laughing up a mf storm on the walk back to my car because I knew she would get slammed with a crap ton of work the next day and I wouldn’t be there to pick up the slack. Had a smile on my face for almost the whole drive home. ",
        "num_comments": 9,
        "comments": [
            "People like that don't really learn their lesson.",
            "I would've loved to have been a fly on the wall to see their reaction 😄",
            "Good",
            "You Won 🫡",
            "Sweet sweet karma.",
            "Maybe not but she learned for that day at least. Left with a grin on my face and made sure she saw it too 🙂‍↕️🔥",
            "She was mad lol. I just walked up to her and handed her the letter. She immediately opened it up to read it while I stood there in front of her with a smile on my face. She looked up at me and saw the smile on my face as I stared back at her and she was pissed but she had to remain professional because we had an HR department so there was nothing she could do 🤣 I felt so happy in that moment 😈",
            "Thank you! I was thinking to myself, “That’s what the fuck she gets” as I walked to my car laughing and smiling about how I made sure she saw the grin on my face as I handed her my final timesheet 😈"
        ]
    },
    "Progressive is the WORST, they make you pay but refuse to pay. ": {
        "title": "Progressive is the WORST, they make you pay but refuse to pay. ",
        "score": 9,
        "url": "https://www.reddit.com/r/confession/comments/1dr4g3k/progressive_is_the_worst_they_make_you_pay_but/",
        "content": "I recently was driving my boyfriends truck, we got into an accident and they determined it was my fault. \n\nThey said they would use my policy to cover the other drivers damage. That’s great, just want the other driver covered. \n\nInsurance agent calls me and says, I would hate to see your truck totaled out, I want to see if I can get it covered. He asks for a recorded statement and asks if I have made payments, done repairs, or have keys. My boyfriend and I have been together for 7 years. We own a home together and our lives our intertwined. So yes, I have keys, I have helped with payments and maintenance but I do not drive the vehicle.\n\nNow they won’t cover the other driver because of my access to the vehicle, and I should have had it insured under my policy? \n\nWe don’t share bank accounts, we split our bills, and I do not ever drive his vehicle aside from this day. This feels like a cheap way to avoid paying out a claim. A claim that is $5,000. I’ve had progressive for 8 years. Never missed or even been late on a payment, have NEVER filed a claim with them and I have paid them over $8,000\n\nBasically all I have to say is FUCK PROGRESSIVE ",
        "num_comments": 12,
        "comments": [
            "Progressive seems to be pulling a fast one. Talk to a lawyer ASAP – they might be able to help you get your claim covered.",
            "I agree, they are the worst.",
            "This kind of behavior is common for Progressive.  I would never use them.",
            "Funny how people never take responsibility for their own faults.",
            "This isn't a fast one.  It is a common clause.  I live with my parents and my insurance company wanted to know if they drive my car and if I drive their as we may need to be on each other's policies.  Since I don't drive their car and they don't drive mine it wasn't an issue.",
            "Yup if you share the same address this is normal …she should NOT have talked to the agent but they probably would have found out anyway.",
            "I know this is how we have been taught that this works, but think about it….\n\nWe pay insurance in case something like this happens. When *this* happens these type of companies use the letters of the contracts to get out of doing the one thing you are paying them money to do. \n\nI know it has been normalized and almost all insurance companies do this but the question becomes why are we giving them money if they are not going to do protect us from these types of situations on technicalities."
        ]
    },
    "Delusional people what are some things you were positive you can do.": {
        "title": "Delusional people what are some things you were positive you can do.",
        "score": 7,
        "url": "https://www.reddit.com/r/confession/comments/1dr4bgt/delusional_people_what_are_some_things_you_were/",
        "content": "My friend say he looks like drake,bruno mars, and jordan poole. He has curly hair and a mustache.",
        "num_comments": 14,
        "comments": [
            "I can see the future through dreams, but I can't tell if I saw the future until it happens. The situations are the same, but I can change the outcome. \n\nThe dreams occur during strong, emotionally charged moments. I think I'm not delusional. Most people I tell explain it as deja vu. Others give me a weird look, and change the subject. A select few believe me",
            "i smoked salvia a few times and each time i thought i figured out the secret of how to get rich and knew everything so i went to the store and got some scratch off tickets and was scratching them after i took a hit of salvia and was highly disappointed when i figured out i was just delusional and i couldnt change things in real time just by thinking about it 😥",
            "I have moved across the country and left my job that pays well and my family and asked my relation ship of a year and a half to do long distance to live an expense free year so I can save all my money while working and living at my moms house. since I have no bills I think I can save enough to afford a down payment on a house for us….. I made this decision within one hour without anyone’s opinion or advice",
            "Be content.",
            "I'm so delusional nothing can stop me. ",
            "Quit doing drugs",
            "Your friend might strongly believe he looks like a bunch of celebrities, but that doesn't necessarily mean anything bad. There are people who have very strong beliefs that aren't quite true, but it doesn't mean they're not your friend. The best thing you can do is focus on hanging out and having fun, and if his beliefs ever seem to cause him problems, you can gently suggest getting help from an adult or a professional. There are people who can help if things get tough.",
            "My sister will swear until she’s blue in the face that she “flew” around her father’s house as a child and he witnessed it. I can normally get her to crack if something is obviously bs but this she has never cracked on.",
            "Wow, your friend hit the genetic lottery. Maybe he can moonlight as a look-alike artist. What’s next, claiming he's Beyoncé's cousin?",
            "Same, the only thing differentiate us i think is that I don't usually dream when i sleep, but when I do. I will definitely try my best to remember because i know soon or later something will happen."
        ]
    }
}