{
    "Verify as professional": {
        "title": "Verify as professional",
        "score": 40,
        "url": "https://www.reddit.com/r/Construction/comments/18xlfes/verify_as_professional/",
        "content": "Recently, a post here was removed for being a homeowner post when the person was in fact a tradesman. To prevent this from happening, I encourage people to verify as a professional.\n\nTo do this, take a photo of one of your jobsites  or construction related certifications with your reddit username visible somewhere in the photo. I am open to other suggestions as well; the only requirement is your reddit username in the photo and it has to be something construction-related that a homeowner typically wouldn't have. If its a certification card, please block out any personal identifying information. \n\nPlease upload to an image sharing site and send the link to us through \"Message the Mods.\" Let us know what trade you are so I know what to put in the flair. \n\nLet us know if you have any questions.",
        "num_comments": 79,
        "comments": [
            "This is super funny.   If there was a sub that seemed like it was for pros only it wouldn't be this one. R/ Homebuilding 99% for diyers giving bad advice to other stupider diy ers.  R/ Construction.  65% diyers giving bad advice to 35% construction alcoholics unwinding and getting feisty at the end of the day.  Maybe you should have to take a pic of your beer to get the diy mods to know your a pro.\n\nCan we talk about monopoly framing now.",
            "Big “NFL refs blaming the players for announcing the wrong number” energy right here",
            "Can you get rid of that guy who keeps classifying people as either contractors or homeowners, he’s nuts",
            "You're telling me you can't tell a customer question from a pro question?",
            "Is this a joke? Like for real.. is it? If it’s not, this is so dumb. Let the homeowners and DIYers ask their questions. We will sort them out as we see fit.",
            "Copy of my LLC’s liability insurance work?",
            "I'm posting here to see if the mods will listen. I followed this page when my wife and I bought our first house. The posts used to be real-life advice and responses to real issues. Recently, this page has digressed to construction-fails with zero context or blowing up real folks just asking for help. Did I miss a recent change in what this page is really for? It's now more like twitter/x type posts only looking for clicks or clout. Please enlighten me.",
            "Would my osha card and picture of work truck be enough?",
            "Then tell people where to post their homeowner questions please?! ",
            "So here's an issue - all my jobs have NDAs where I can't share photos (critical infrastructure, etc.). How does this work? I also don't really want to get doxxed as well if I share a P.Eng number."
        ]
    },
    "Moderators Wanted": {
        "title": "Moderators Wanted",
        "score": 4,
        "url": "https://www.reddit.com/r/Construction/comments/1dkvy13/moderators_wanted/",
        "content": "/r/Construction is looking for new Moderators.\n\nIf you're a working professional in the construction industry and would like to help our existing moderator team please consider joining us.\n\nPlease use the link below and add a short message about yourself, your previous moderation experience and anything you think we should know when considering your application.\n\n[Apply for Moderator.](https://www.reddit.com/message/compose/?to=/r/Construction&subject=Mod%20Application)",
        "num_comments": 0,
        "comments": []
    },
    "damn 😂": {
        "title": "damn 😂",
        "score": 608,
        "url": "https://v.redd.it/dmb5zcnw9f9d1",
        "content": "",
        "num_comments": 91,
        "comments": [
            "When you’re helper is standing there with his hands in his pockets, It’s the perfect time to send him home.",
            "I'm surprised that he wasn't on his phone.",
            "Hands in his pockets and everything",
            "Dudes fault too.  He needs to make sure helper helps and understands task.  Explain it to him like he's 5 especially green at any task.",
            "Hope he does a better job at calling 911",
            "More like when you don't know how to set a ladder up properly and rely on a brain dead, drug addict as a helper.",
            "Gotta wonder what the helper seen off camera. Feels like the ladder was set up correctly to prevent that. Can't help but think something sketchy AF going on the other end, especially since he was carrying a second ladder up.",
            "Absolutely no one ever holds my ladders for this very reason and I routinely use 28’ up to 40’. I will set up my own ladder properly and no one needs to go near it.",
            "I'll keep it a buck. Him having his feet at the bottom of that ladder and holding it wasn't going to stop you from falling. Plus you were in the wrong carrying a ladder up another ladder. However, the new kid is still useless.",
            "This is what makes me afraid to climb ladders"
        ]
    },
    "You mixed up the boxes before you tiled right?": {
        "title": "You mixed up the boxes before you tiled right?",
        "score": 931,
        "url": "https://i.redd.it/eglm4zs3gd9d1.jpeg",
        "content": "",
        "num_comments": 124,
        "comments": [
            "Looks like a “squint and see 3D” pictures.",
            "I don’t think mixing up the tiles would have made that look any better, to be fair. \n\nWhat a horrible choice.",
            "The one time i advocate for painting the tile lol",
            "This was fk’d from the word go. I count about 7 different variations which makes it virtually impossible to get a reasonable mix here. This is what happens when you shop at Floor & Decor lol",
            "If you paint the whole thing then who’s gonna know?",
            "Looks like they sorted them by design. They’re all right next to their copy. Had they simply taken the time to line up the designs even a smidge, this would have looked better.",
            "Looks like cheap video game texture",
            "I laughed… Ferreal. \n\nThey deserve it though… for picking those horrible fixtures.",
            "My lord that is horrible. That bathroom is way to busy m, even with the shit job.",
            "Soldier pattern was a bad choice. Staggered brick could have saved this ugly tile"
        ]
    },
    "For those who asked about Froglinks": {
        "title": "For those who asked about Froglinks",
        "score": 20,
        "url": "https://v.redd.it/nkdjchwrsh9d1",
        "content": "This is why I said they do not inspire confidence. Also, note that the top part is bent over—they start out flat, but start bending out of shape as soon as you use them. In theory, if you fall the whole thing will uncoil, sort of a built-in shock pack.\n\nI also hate having to make penetrations in standing seam metal. If you ask me, the whole *point* of standing seam is the lack of penetrations. Putting a bunch of rivets in it just feels wrong.",
        "num_comments": 3,
        "comments": [
            "You should get a rib anchor, clamps on to the ribs of the standing seam",
            "That's what I normally use. These seams were triangular though, and when I tried to attach a standing seam anchor I noticed the set screws wanted to ride up the triangle. I figured it would only take a tiny bit of riding up before they were loose and the whole anchor popped off with me attached, so that was a hard no.\n\nOn a more normal standing seam roof with vertical seams, that's absolutely what I would use.",
            "This"
        ]
    }
}