{
    "Weekly Food Safety Questions Thread - June 24, 2024": {
        "title": "Weekly Food Safety Questions Thread - June 24, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/Cooking/comments/1dn9uvw/weekly_food_safety_questions_thread_june_24_2024/",
        "content": "If you have any questions about food safety, put them in the comments below. \n\nIf you are here to answer questions about food safety, please adhere to the following: \n\n* Try to be as factual as possible.\n* Avoid anecdotal answers as best as you can.\n* Be respectful. Remember, we all have to learn somewhere. \n\n\\------------------------------------------------------------------------------------------------\n\nHere are some helpful resources that may answer your questions: \n\n[https://www.fsis.usda.gov/food-safety/safe-food-handling-and-preparation](https://www.fsis.usda.gov/food-safety/safe-food-handling-and-preparation)\n\n[https://www.stilltasty.com/](https://www.stilltasty.com/)\n\nr/foodsafety",
        "num_comments": 26,
        "comments": [
            "All these food youtubers/Instagramers are doing the spray and wipe on the chopping board after cutting meat. No washing under hot tap, no washing up liquid, no scrubbing...just a spray and a wipe with a cloth. As far as I can see from the edits anyway.\n\nIs that actually a good way to clean a board? And what is in that spray?",
            "Made some chicken spring rolls and froze them for later. Later is now, and I’d like to air fry them instead of deep frying like I normally would. Can I get some guidance on what my settings should be? They’re not pre-cooked before freezing, so I am looking at raw chicken. Thank you :)",
            "I left my gruyere out the fridge overnight - will it still be safe to eat, or should I just bin it?",
            "Just wonder if there is a specified kind of Handwash we should get if we handle raw meat?",
            "They’re fine right in the packaging on the counter. Just ensure that the packaging is closed correctly to prevent them going stale.",
            "I don't know what they're using, but use whatever you are comfortable with. Plus whatever cleaner they're using is probably ending up in the food.",
            "The most conservative measures state that cooked food should not be left out of fridge for more than 4 hours. Under this guideline you're safe.",
            "Mature dry cheeses are good to be left out as long as it's not in a bag, the worst thing that can happen is a change in texture. Never store cheese in an unvented container unless vacuum sealed and frozen.",
            "I ended up eating it and didn't die. Made sure to boil the heck out of it too on the reheat. Next time I'll put it on my other counter so I don't forget it lol. Thanks for the help!",
            "Thanks for the response. I should have said in this case I specifically mean chicken breasts. I don’t have the same problem with thighs. That’s good to know, though."
        ]
    },
    "What does taste better when it's over- or undercooked? ": {
        "title": "What does taste better when it's over- or undercooked? ",
        "score": 586,
        "url": "https://www.reddit.com/r/Cooking/comments/1dqlcbi/what_does_taste_better_when_its_over_or/",
        "content": "For me it's sausages and hotdogs and such . When you roast them until they're charred black like coals, that's when the flavor gets new colors. Extra points if it's covered in soot and ashes \n\nAl dente pasta is a bit more complicated since it works well with certain dishes, but is bad with others. ",
        "num_comments": 680,
        "comments": [
            "I like my French fries a bit \"well done\"",
            "The Mexicans know that you get a deeper flavor when you char your vegetables to within an inch of their lives.",
            "Chicken thighs and drumsticks have *way* better texture when \"overcooked\" (as compared to chicken breast), and I'd argue that this shouldn't even be called overcooked in this case.",
            "The endless debate on how eggs should be cooked.  We've gravitated to a very soft, dewy scramble and a very gently over easy.  Some people like dry scramble, browned omelet, etc. It just depends on what you're used to.",
            "Mushrooms.   Mushrooms need to be cooked to death, and the more you cook them the better the flavor and texture gets.   Im convinced that most people that dont like mushrooms have only been served them in that slimey \"hot, but not cooked\" state.",
            "crispy rice - i have never successfully made it but it tastes amazing.",
            "I almost never fully hard boil my eggs. Usually nine minutes max. So they’re not quite soft boiled but not fully hard boiled either. I just never think there is a situation for hard boiled eggs I guess.",
            "undercooked cookies are the best",
            "Sort of related but spaghetti all'assassina, which involves pan frying spaghetti until it's a deep deep golden brown. I'll occasionally take inspiration from it and toast my pasta in a pan with some oil before adding it to other dishes, which I'm sure is a capital offense in Italy. ",
            "I’m surprised I haven’t seen it mentioned yet, but… corn! \n\nMuch like how I feel about broccoli, I love it whether it’s charred or raw. Charred corn salad? Charred corn in Korean corn cheese? And it’s so good as raw corn, whether it’s in a corn salad or straight out a local fresh cob."
        ]
    },
    "What's your favorite seasoned rice recipe?": {
        "title": "What's your favorite seasoned rice recipe?",
        "score": 38,
        "url": "https://www.reddit.com/r/Cooking/comments/1dr2az2/whats_your_favorite_seasoned_rice_recipe/",
        "content": "I love fried rice, but recently I found it tiring to wait until I have a day old rice to have them, so I move into seasoned rice (rice that you give seasonings when it's cooked). Recently, I tried kabuli rice, but I think I should try more variations.\n\nCan you guys give me your favorite one? (if you don't have a recipe, that's fine).\n\nThank you^^\n\n",
        "num_comments": 72,
        "comments": [
            "You absolutely don't need to wait a day to use rice for fried rice. It just needs to be dry.",
            "My mother used to throw a chicken bouillon cube in the rice when cooking, and it was one of my favorite things growing up. Chicken flavored rice.",
            "Hainanese Chicken Rice is the absolute GOAT. Amazing dish from Singapore. Google it, tons of recipes out there",
            "We do cheesy chicken rice and a more creole flavored rice with andouille sausages.",
            "I make a one pot rice. Dice onion, bell pepper, and garlic. Sauté in a pot with a bit of butter until soft. Chop and add smoked sausage. Cook through. Toss in washed rice, paprika, and a couple bay leaves. Cover with chicken or beef stock. Simmer for 20 minutes",
            "I have a fried rice shortcut. Add miso paste, roasted garlic, and a little onion to your rice liquid. theres probably more you could add to tweak it, but I like it. of course add some sesame oil in there if you want or after its cooked. I make mine in my Instant Pot, havent tried other methods though",
            "Cooked Rice with soy sauce and toasted Sesame oil.",
            "mujadara is probably one of the tastiest things I’ve ever eaten - plus the added protein from the lentils is great. Goes with almost any protein for me and jazzes up a basic meal",
            "I don't make a lot of rice, but found a combination that tasted quite complex without being difficult at all. Unfortunately no exact measurements but cook rice in water + Jamaican curry powder + taco seasoning + smaller amounts of granulated garlic & cayenne, when finished stir in a spoon of salsa...tastes great with black beans.",
            "Recently tried lemon coriander rice and it's just amaze."
        ]
    },
    "Cold breakfast to feed a group of garbage truck drivers": {
        "title": "Cold breakfast to feed a group of garbage truck drivers",
        "score": 113,
        "url": "https://www.reddit.com/r/Cooking/comments/1dqsicd/cold_breakfast_to_feed_a_group_of_garbage_truck/",
        "content": "I just got a new job as sales for a waste disposable company. I've been going through training and Monday I'll be shadowing a driver. In my past jobs, I've always gone to bakeries to get various items. But I need to meet the driver at 3:00 a.m. and nothing is open. \n\nI need ideas for breakfast items to bring to feed up to 10 people. They don't have time to sit down. It can't be hot. It shouldn't be messy. Something you can pick up and put down or eat fast. And something easy enough a caveman can cook it.  Help!! and thank you",
        "num_comments": 101,
        "comments": [
            "Whatever food you bring, I think a cooler with bottles of orange juice, or Gatorade, water and canned coffee would be very welcome!",
            "Breakfast burritos, I know you said not hot but you could wrap em in foil and keep them warm in a bag, wrap them in a towel.",
            "Whatever you choose, wrap each serving so they don’t have to wash hands first.",
            "Breakfast bagel sandwiches wrapped in foil to stay warm, jumbo muffins, yogurt fruit parfaits, and baked oatmeal squares",
            "How about a selection of breakfast sandwiches with easy-to-handle fillings like egg and cheese, or ham and cheese? They're portable, satisfying, and easy to eat on the go.",
            "I think some others already made some good suggestions but I would add if you are able to work the logistics, I bet bringing a big batch of hot coffee would be extremely appreciated",
            "How about a couple of different flavors of bagels and cream cheese? That's  quick, easy, and filling.",
            "You can buy boiled eggs that are already peeled.  Cake donuts purchased the day before would still be good.  Ripe bananas to peel and eat.  \n\nIf you want to make something, you could fix ham and cheese wraps using flour tortillas.  Or bake big blueberry breakfast muffins - you can get a box mix for these. Peanut Butter and Jelly sandwiches using a sturdy bread.",
            "Breakfast burritos. Easy to make the night before.",
            "Put your warm burritos in a small insulated carrier-/like what holds a six pack."
        ]
    },
    "Coming to the brain trust with a tough one: Cold lunches for a puréed diet": {
        "title": "Coming to the brain trust with a tough one: Cold lunches for a puréed diet",
        "score": 12,
        "url": "https://www.reddit.com/r/Cooking/comments/1dr5l8l/coming_to_the_brain_trust_with_a_tough_one_cold/",
        "content": "I work nocs at a group home for adults with developmental disabilities. One of my duties is to pack lunches for our clients to take to day program. I have a client that has chewing and swallowing issues and has been put on a puréed diet. While her housemates have been getting the usual sandwich, veggie sticks and such, we’ve been giving her puréed leftovers from dinner the night before. This has worked for several weeks.\n\nUnfortunately, the day program has decided they won’t heat up her lunches anymore. Per our dietitian, lunches must contain an entree, a fruit, a vegetable and a snack. Fruit and snack isn’t a problem (we send applesauce or puréed fruit and a jello or pudding cup). It’s the entree and veg that’s at issue. Almost anything can be puréed, but a lot of it is unpalatable cold.\n\nWe have tuna, chicken, and egg salads for entrees, but some more variety would be nice. The bigger challenge is the vegetable. Cold puréed vegetables suck and I’m having trouble coming up with other ideas. \n\nThis client is overweight, so cream and excessive fat are out. It’s a kitchen on a budget, so we’re working with dry herbs, jar garlic, and margarine (though we do keep a little butter around for baking projects). We use a lot of canned goods (various beans, green beans, black olives, gravy, sauces, cream soups, etc). Frozen broccoli and peas. We keep some fresh veg on hand (carrots, celery, cucumbers, mushrooms, tomatoes, bell peppers, green/red/yellow onions, potatoes, zucchini). My client isn’t picky, but I’m not inclined to give her anything more exotic than, say, Italian, Mexican, or Asian as I don’t think she’s been exposed to much else. I’m happy to prep lunches ahead of time, but I can’t keep any prepared food in the fridge for more than three days.\n\nI’ve already thought of gazpacho, serving it with cottage cheese on the side for protein. Other than that I’m stumped. I feel so bad for this client. She’s never coming off this diet. I just want to feed her something she can look forward to every day. If you’ve made it this far, I’d love some ideas, especially from those with experience cooking in this setting/situation.",
        "num_comments": 17,
        "comments": [
            "Could her lunch be sent in a thermos or something similar that would keep it warm?",
            "Hummus. Bonus in that the basic chickpea paste can carry a lot of different flavors. ",
            "I know of a student that had a puréed diet due to swallowing  issues. His parents roasted sweet potatoes and spiced it up with some ginger and black beans. Another favorite of his was baked falafels puréed then added a little plain yogurt at the end. The plain yogurt was always added  in the purée at the end. If falafels are expensive try chickpeas. You could add ground beef with anything as well. Wish you the best of luck- you are a rock star feeding and caring so much for your clients.",
            "I know you said they might not be comfortable outside of Mexican, Asian, and Italian flavors but a lot of curries or Indian style foods have high protein options like tofu or garbanzo beans that do very well pureed and add a creamy texture to the dish. A hybrid pureed panang tofu curry over Risotto probably wouldn't be that bad cold.",
            "Would a thermos for hot soup be possible? \nI eat congee cold too but I haven't seen anyone else it it cold.",
            "  Pureed peanut butter jelly sandwiches with apple juice instead of milk or water is fairly tasty.  Cheese sandwich.    Most canned fruits are good but some will require a thickener added back.  Cottage cheese pureed with a lil fruit to thin it out.   Canned vegetables pureed with a little dressing but again may require some thickener.  Green beans wax beans with coleslaw dressing is \"puree coleslaw\". Canned 3 bean salad.  Pureed pickled beets but will need thickener.  Does she eat the pureed food well or is she adverse? If she's not picky and will eat whatever she may be fine with cold chicken or Mac and cheese etc.   Pureed canned baked beans are ok.  Frozen peas are good. I appreciate you trying to get her some variety, consider calling a nursing home near you for ideas as well.   There should be someone within your organization supervising a diet like this as most home cooks will not process correctly for swallowing issues and hopefully they've provided you training beyond throw it in a blender.    ",
            "Well, I know that the lunches go right in the refrigerator when they get to program. I’m not sure they would be allowed to keep it out at room temperature per licensing. We don’t have a thermos for her rn, but we could get one if it’s a solution. But I’m guessing they probably can’t keep it out because of food safety issues. I’ll ask though.",
            "OP did, in their post :)",
            "What a great list! I'm going to add hummus, and any protein salad without the bun so ham salad, chicken salad, tuna salad (can puree). Also pureed veggies make great smoothies or can be mixed a little cream cheese, milk and powdered ranch. 7 layer dip would be a good smoothie. Baba ganoush. Risotto. Cottage cheese. Salsa, apple sauce, guac and pureed beans like refried beans.",
            "Does everything you use need to be NSF listed? If not, there are a number of inexpensive consumer heated lunchbox options out there.  I haven't used them, but the general idea seems to be that you plug them in and they hot hold your food.\n\nYou might be able to place her food in a little 1/9th hotel pan + lid or something inside a heated lunchbox.  The lunchbox wouldn't be NSF, but the hotel pan would be."
        ]
    }
}