{
    "A cool guide for how many of each bill is in current circulation": {
        "title": "A cool guide for how many of each bill is in current circulation",
        "score": 528,
        "url": "https://i.redd.it/4o4pdw27y18d1.jpeg",
        "content": "",
        "num_comments": 65,
        "comments": [
            "I try and use 2 dollar bills and people think they’re fake.",
            "More $100 bills than 1s or 20s? That seems off.",
            "Currency in Circulation: Volume\n\n(in billions of notes, as of December 31 of each year)\n\n\nYear: 2022\n\n$1: 14.3B\n\n$2: 1.5B\n\n$5: 3.5B\n\n$10: 2.5B\n\n$20: 11.5B\n\n$50: 2.5B\n\n$100: 18.5B\n\n$500-$10,000: 0.0004B\n\nTotal: 54.1B\n\nIncludes Federal Reserve notes, U.S. notes, and currency no longer issued.\nLast Update: May 05, 2023\n\nSource: [Federal Reserve](https://www.federalreserve.gov/paymentsystems/coin_currcircvolume.htm)",
            "I saw a $2 bill once in my life. \n\nSomebody hides 2B of them obviously.",
            "I appreciate that they tried to make sections of the square appropriate but good God it annoys me that that $50 note is separated from the other small percentage groups.",
            "Current as of what year... 2024 really....?",
            "Cool, let's do a bank run.",
            "It really is all about the Benjamins. Baby.",
            "All those goddamn 100's and I don't have ONE of them!",
            "All those hundreds and none of em in my pockets. What a cruel world we live in."
        ]
    },
    "A cool guide to training in zone 2": {
        "title": "A cool guide to training in zone 2",
        "score": 104,
        "url": "https://i.redd.it/li7gwv51z38d1.jpeg",
        "content": "",
        "num_comments": 15,
        "comments": [
            "(220 - age) x 60 is hilariously wrong.",
            "This says  how to get into zone 2 but what's  the benifits of staying on zone 2?",
            "Except the Heartrate max is different for\nEverybody.",
            "You're telling me that i should work out hard enough for my heart rate to be in the thousands of bpm?",
            "20mins is the bare minimum to stay in shape. My watch has me doing an hour of this",
            "What benefits",
            "Cool, and what are the benefits?",
            "Oh good, I thought I'd forgotten how to do math for a second there.",
            "I’m 50 so I just gotta get my heart rate up to 10,200 beats per min?  Whew 🥵",
            "Oh I noticed only now, yes it’s wrong, should be x 0.6"
        ]
    },
    "A cool guide to sushi etiquette ": {
        "title": "A cool guide to sushi etiquette ",
        "score": 76,
        "url": "https://i.redd.it/hjpvfn7x448d1.png",
        "content": "",
        "num_comments": 33,
        "comments": [
            "Also:\n-Do not look at the sushi with lust\n\n-do not taunt the sushi\n\n-if the sushi starts to glow, or speak, do not engage with the sushi\n\n-do not give the sushi 5000 yen and expect to be paid back when his cousin finally pays him back",
            "Do not tell me what to do with my sushi. 🍣",
            "I’ll do whatever tf I want with my sushi.",
            "I paid for it, I’ll dissect every grain of rice if I want.",
            "Try Kimbob.\n\nKoreans doesn’t give a fuck what ya doin with it.",
            "-Clap three times before every bite of sushi \n\n- Make sure the chef sees you chewing. Swallowing is for pigs and whores\n\n-If you have no wasabi you MUST substitute earwax\n\n-Sushi should never go below your nipple line",
            "It would be interesting to learn the “why” behind these.  For every rule, there’s a reason.",
            "I’m a wasabi in the soy sauce and mix it up kind of guy though.",
            "\"please eat your sushi within 30 seconds\" (lest it regains consciousness and causes a scene)",
            "My Japanese friends who were born and grew up in Japan taught me to mix wasabi to soy sauce."
        ]
    },
    "A cool guide on Healthy Food Vitamin Chart": {
        "title": "A cool guide on Healthy Food Vitamin Chart",
        "score": 71,
        "url": "https://i.redd.it/u8dp35if148d1.png",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Vitamin B is a class of vitamins. Not a vitamin in and of itself",
            "Eat eggs and meat got it",
            "It’s even more fun when your body just doesn’t absorb any of it and you have to supplement anyway.\n\nI eat lots of meat and dairy and I cook in cast iron.  Iron and b12 are still low.  Fml",
            "8 of 10 covered by meat, eggs, dairy. no wonder vegans need pills and highly processed foods.",
            "Vegan here. Don't need pills or highly processed foods.",
            "highly processed foods do not supply additional nutrients????",
            "the key term in the title is healthy food."
        ]
    },
    "A cool guide on how to use chopsticks": {
        "title": "A cool guide on how to use chopsticks",
        "score": 330,
        "url": "https://i.redd.it/tr9s9lnui18d1.png",
        "content": "",
        "num_comments": 18,
        "comments": [
            "As someone who grew up using chopsticks, this guide is horrendous",
            "Sometimes, I like to put the chopsticks in my pee hole.",
            "That's so much more complicated than the way I do it that works perfectly fine. Kind of looks like the second picture from the top right, but I use my thumb and middle finger to hold one sturdy, while the other one is wedged between it and the crook between my index and thumb, And I just use my middle finger to manipulate that one. \n\nI hardly ever drop anything, and it's much more intuitive than this way. Instead of six steps, it's two... And you don't have to throw gang signs at your Nigiri.",
            "A very wise zen master once told me how to correctly use chopsticks, he said \"use them however you fucking like\"",
            "or use a fork and a knife",
            "Or use a fork. Jus because it is old and tradition doesn't mean it is better technology: it isn't.",
            "I can eat properly with chopsticks, but every time I see an Asian do it I get jealous. They have the chopsticks almost parallel to each other and do not have the gap at the thumb. If I do this, I loose all grip.",
            "I wanted to know how to use chopsticks, thanks!",
            "As someone who was taught 4 different grips in highschool from Chinese friends, agreed",
            "I feel that people overcomplicate chopsticks. They aren't difficult to use but people make them seem like this mythic thing."
        ]
    }
}