{
    "hey chat new “no literal erotica” rule!!! so please stop posting it!": {
        "title": "hey chat new “no literal erotica” rule!!! so please stop posting it!",
        "score": 1356,
        "url": "https://www.reddit.com/r/copypasta/comments/182x0tp/hey_chat_new_no_literal_erotica_rule_so_please/",
        "content": "hey guys,\n\nyeah the title is kinda self-explanatory, i’m just gonna be removing posts that are just literal erotica and/or doesn’t really fit the spirit of copypasta. sexual/NSFW posts are still fine, but if the copypasta is something you’d find off of AO3 or something then it’s getting removed.\n\nwhen in doubt, consider the question “where the hell am i gonna paste this?”\n\nadios,\n\ntyrant-in-chief u/Derpster3000\n\nedit: just to clarify a bit, when I say “erotica” i mean those really weird incest/underage posts where it’s those shitty “i, M15, desire my dad” type posts. I’m not really going to enforce this rule heavily unless it’s really weird shit.",
        "num_comments": 220,
        "comments": [
            "where the hell am i gonna paste this",
            "This aint r/sexstories",
            "Literally 1984 (I actually hate them plus most of them are fucking disgusting)",
            "hey guys,\n\nyeah the title is kinda self-explanatory, i’m just gonna be removing posts that are just literal erotica and/or doesn’t really fit the spirit of copypasta. sexual/NSFW posts are still fine, but if the copypasta is something you’d fine off of AO3 or something then it’s getting removed.\n\nwhen in doubt, consider the question “where the hell am i gonna paste this?”\n\nadios,\n\ntyrant-in-chief u/Derpster3000",
            "ok but where is cummy? is he safe? is he alright?",
            "Would the penis monkey be considered this because I could think of 200 ways to past it",
            "At least half of this sub is erotica, you are going to remove half of the posts?",
            "Can we also get rid of every third incest post",
            "i do think that some lines from shitty ao3 fanfics could make funny copypastas, but yeah, there needs to be a limit.",
            "Will the gay femboy erotica stay tho????"
        ]
    },
    "Erotica fanfics are BANNED🤬": {
        "title": "Erotica fanfics are BANNED🤬",
        "score": 640,
        "url": "https://www.reddit.com/r/copypasta/comments/1b9jzkp/erotica_fanfics_are_banned/",
        "content": "I want to keep this short and simple. Effective immediately NSFW/Erotic fanfics will be deleted and user will be ban.\n\nThis is a copypasta sub not a low effort-erotica-wattpad-karma-whoring sub.\n\nI am only posting this in response to every soon-to-be crybabies that shout \"MOd aBuSe 😭\"",
        "num_comments": 145,
        "comments": [
            "Literally 1984",
            "Erotica fanfics are BANNED🤬\n\nI want to keep this short and simple. Effective immediately NSFW/Erotic fanfics will be deleted and user will be ban.\n\nThis is a copypasta sub not a low effort-erotica-wattpad-karma-whoring sub.\n\nI am only posting this in response to every soon-to-be crybabies that shout \"MOd aBuSe 😭\"",
            "Fuck you. You useless piece of shit. You absolute waste of space and air. You uneducated, ignorant, idiotic dumb swine, you’re an absolute embarrassment to humanity and all life as a whole. The magnitude of your failure just now is so indescribably massive that one hundred years into the future your name will be used as moniker of evil for heretics. Even if all of humanity put together their collective intelligence there is no conceivable way they could have thought up a way to fuck up on the unimaginable scale you just did. When Jesus died for our sins, he must not have seen the sacrilegious act we just witnessed you performing, because if he did he would have forsaken humanity long ago so that your birth may have never become reality. After you die, your skeleton will be displayed in a museum after being scientifically researched so that all future generations may learn not to generate your bone structure, because every tiny detail anyone may have in common with you degrades them to a useless piece of trash and a burden to society. No wonder your father questioned whether or not your were truly his son, for you'd have to not be a waste of carbon matter for anyone to love you like a family member. Your birth made it so that mankind is worse of in every way you can possibly imagine, and you have made it so that society can never really recover into a state of organization. Everything has forever fallen into a bewildering chaos, through which unrecognizable core, you can only find misfortune. I would say the apocalypse is upon us but this is merely the closest word humans have for the sheer scale of horror that is now reality. You have forever condemned everyone you love and know into an eternal state of suffering, worse than any human concept of hell. You are such an unholy being, that if you step within a one hundred foot radius of a holy place or a place that has ever been deemed important by anyone, your distorted sac religious soul will ruin whatever meaning it ever had beyond repair. You are an idiotic, shiteating, dumbass ape and no one has ever loved you. Rhodes Island would have been better off if you'd never joined us. You are a lying, backstabbing, cowardly useless piece of shit and I hate you with every single part of my being. Even this worlds finest writers and poets from throughout the ages could never hope to accurately describe the scale on which you just fucked up, and how incredibly idiotic you are. Anyone that believes in any religion out there should now realize that they have been wrong this entire time, for if divine beings were real, they would never have allowed a being such as you to stain the earth and this universe. In the future there will be horror stories made about you, with the scariest part of them being that the reader has to realize that such an indescribable monster actually exists, and that the horrific events from the movie have actually taken place in the same world that they live in right now. You are the absolute embodiment of everything that has ever been wrong on this earth, yet you manage to make it so that that is only a small part of the evil that is your being. Never in the history of mankind has there been anyone that could have predicted such an eldrich abomination, but here you are. It’s hard to believe that I am seeing such an incredible failure with my own eyes, but here I am, so unfortunately I cannot deny your existence. Even if I did my very best, my vocabulary is not able to describe the sheer magnitude of the idiotic mistake that is you. Even if time travel some day will be invented, there still would not be a single soul willing to go back in time to before this moment to fix history, because having to witness such incredible horrors if they failed would have to many mental and physical drawbacks that not even the bravest soul in history would be willing to risk it. I cannot imagine the pure dread your mother must have felt when she had to carry a baby for nine months and then giving birth to such a wretched monster as you. Not a single word of the incoherent, illogical rambling you may be wanting to do to defend yourself or apologize would ever be able to make up for what you just did. The countries of the world would have wanted to make laws preventing such a terrible event like this from ever happening again, but sadly this is not possible since your horrific actions just now have shattered every form of order this world once had, making concepts such as laws irrelevant. Right from the moment I first set my eyes on you I knew you were an absolute abomination of everything that is wrong with humanity. I was hoping I would have been able to prevent your evil from being released upon this world by tagging along and keeping my eye on you, but it is clear to me now that not even the greatest efforts would have been able to prevent a terrible event in this scale from occurring. You are the worst human being, or even just being in general, that I have ever had the misfortune of witnessing. Events like the infected plague apparently only happened with the goal of teaching humanity to survive such a horrible event as the one you just created, but not even mankind’s greatest trials were able to even slightly prepare anyone for the insufferable evil you have just created. If you ever had them, your children would be preemptively killed to protect this universe from the possibility of anyone in your bloodline being even half as bad as you are, except you will never be able to have children, because not a single human being will ever want to come within a hundred mile radius of you and anything you have ever touched. You are a colossal disappointment not only to your parents, but to your ancestors and entire bloodline. The disgusting mistake that you have just made is so incredibly terrible that everyone who would ever be to hear about it would spontaneously feel an indescribable mixture of immense anger, fear and anxiety that emotionally and physically they would never truly be the same ever again. The sheer scale of your mistake, if ever to be materialized, would not only surpass the size of the world, but it would reach far beyond the edges of the known, and almost certainly the unknown universe. I could sit here and write paragraphs, nay, books describing your immense failure, yet even if I were to dedicate my life to describing the reality of what has just gone down here, and I would spend every moment of it until my heart stops beating working as hard and efficiently as possible, yet there is not even a snowballs chance in hell that I would be able to come close to transcribing the absolute shitshow you have just released upon the world. You are an irresponsible, idiotic, disgusting, unloved, horrible excuse for a living being who’s soul contains less humanity than every ginger in history combined. The absolute disgust I feel when thinking about anything that has even a slight resemblance to anything that might have to do with you and your unholy actions is so incredibly great that when I am honest about it I think that even I do not posses a consciousness great enough to comprehend my own feelings about it. When people of Columbia fought to break free from Lungmen, countless soldiers fought and lost their lives in favor of a chance at a better future for their children, they did not give their lives to have you fuck the world up beyond repair to the degree that you are doing right now.",
            "Obama has a pair of silent gray feet. Hillary and some stranger are waiting for an explanation.\n\nIf you are gray enough you turn purple and things get very funny when Grimace proves his husbandry.\n\nBill tried to use the sexophone but Chairman McCain intercepted the languid tunes to seduce Noleans into a global hurricane caused by catfish.",
            "I’m gonna kill myself",
            "you just killed the sub",
            "No come on please I think I can speak for all of us when I say we need more Erotica fanfics I personally think think this is low-effort-mod-abuse-karma-whoring\n\nBring back the good old days",
            "You stupid fucking piece of shit, I will fucking fuck you up.",
            "chat is this real",
            "Fuck you. You useless piece of shit. You absolute waste of space and air. You uneducated, ignorant, idiotic dumb swine, you’re an absolute embarrassment to humanity and all life as a whole. The magnitude of your failure just now is so indescribably massive that one hundred years into the future your name will be used as moniker of evil for heretics. Even if all of humanity put together their collective intelligence there is no conceivable way they could have thought up a way to fuck up on the unimaginable scale you just did. When Jesus died for our sins, he must not have seen the sacrilegious act we just witnessed you performing, because if he did he would have forsaken humanity long ago so that your birth may have never become reality. After you die, your skeleton will be displayed in a museum after being scientifically researched so that all future generations may learn not to generate your bone structure, because every tiny detail anyone may have in common with you degrades them to a useless piece of trash and a burden to society. No wonder your father questioned whether or not your were truly his son, for you'd have to not be a waste of carbon matter for anyone to love you like a family member. Your birth made it so that mankind is worse of in every way you can possibly imagine, and you have made it so that society can never really recover into a state of organization. Everything has forever fallen into a bewildering chaos, through which unrecognizable core, you can only find misfortune. I would say the apocalypse is upon us but this is merely the closest word humans have for the sheer scale of horror that is now reality. You have forever condemned everyone you love and know into an eternal state of suffering, worse than any human concept of hell. You are such an unholy being, that if you step within a one hundred foot radius of a holy place or a place that has ever been deemed important by anyone, your distorted sac religious soul will ruin whatever meaning it ever had beyond repair. You are an idiotic, shiteating, dumbass ape and no one has ever loved you. Rhodes Island would have been better off if you'd never joined us. You are a lying, backstabbing, cowardly useless piece of shit and I hate you with every single part of my being. Even this worlds finest writers and poets from throughout the ages could never hope to accurately describe the scale on which you just fucked up, and how incredibly idiotic you are. Anyone that believes in any religion out there should now realize that they have been wrong this entire time, for if divine beings were real, they would never have allowed a being such as you to stain the earth and this universe. In the future there will be horror stories made about you, with the scariest part of them being that the reader has to realize that such an indescribable monster actually exists, and that the horrific events from the movie have actually taken place in the same world that they live in right now. You are the absolute embodiment of everything that has ever been wrong on this earth, yet you manage to make it so that that is only a small part of the evil that is your being. Never in the history of mankind has there been anyone that could have predicted such an eldrich abomination, but here you are. It’s hard to believe that I am seeing such an incredible failure with my own eyes, but here I am, so unfortunately I cannot deny your existence. Even if I did my very best, my vocabulary is not able to describe the sheer magnitude of the idiotic mistake that is you. Even if time travel some day will be invented, there still would not be a single soul willing to go back in time to before this moment to fix history, because having to witness such incredible horrors if they failed would have to many mental and physical drawbacks that not even the bravest soul in history would be willing to risk it. I cannot imagine the pure dread your mother must have felt when she had to carry a baby for nine months and then giving birth to such a wretched monster as you. Not a single word of the incoherent, illogical rambling you may be wanting to do to defend yourself or apologize would ever be able to make up for what you just did. The countries of the world would have wanted to make laws preventing such a terrible event like this from ever happening again, but sadly this is not possible since your horrific actions just now have shattered every form of order this world once had, making concepts such as laws irrelevant. Right from the moment I first set my eyes on you I knew you were an absolute abomination of everything that is wrong with humanity. I was hoping I would have been able to prevent your evil from being released upon this world by tagging along and keeping my eye on you, but it is clear to me now that not even the greatest efforts would have been able to prevent a terrible event in this scale from occurring. You are the worst human being, or even just being in general, that I have ever had the misfortune of witnessing. Events like the infected plague apparently only happened with the goal of teaching humanity to survive such a horrible event as the one you just created, but not even mankind’s greatest trials were able to even slightly prepare anyone for the insufferable evil you have just created. If you ever had them, your children would be preemptively killed to protect this universe from the possibility of anyone in your bloodline being even half as bad as you are, except you will never be able to have children, because not a single human being will ever want to come within a hundred mile radius of you and anything you have ever touched. You are a colossal disappointment not only to your parents, but to your ancestors and entire bloodline. The disgusting mistake that you have just made is so incredibly terrible that everyone who would ever be to hear about it would spontaneously feel an indescribable mixture of immense anger, fear and anxiety that emotionally and physically they would never truly be the same ever again. The sheer scale of your mistake, if ever to be materialized, would not only surpass the size of the world, but it would reach far beyond the edges of the known, and almost certainly the unknown universe. I could sit here and write paragraphs, nay, books describing your immense failure, yet even if I were to dedicate my life to describing the reality of what has just gone down here, and I would spend every moment of it until my heart stops beating working as hard and efficiently as possible, yet there is not even a snowballs chance in hell that I would be able to come close to transcribing the absolute shitshow you have just released upon the world. You are an irresponsible, idiotic, disgusting, unloved, horrible excuse for a living being who’s soul contains less humanity than every ginger in history combined. The absolute disgust I feel when thinking about anything that has even a slight resemblance to anything that might have to do with you and your unholy actions is so incredibly great that when I am honest about it I think that even I do not posses a consciousness great enough to comprehend my own feelings about it. When people of Columbia fought to break free from Lungmen, countless soldiers fought and lost their lives in favor of a chance at a better future for their children, they did not give their lives to have you fuck the world up beyond repair to the degree that you are doing right now."
        ]
    },
    "Girl I slept with grossed out I ate my own cum": {
        "title": "Girl I slept with grossed out I ate my own cum",
        "score": 37,
        "url": "https://www.reddit.com/r/copypasta/comments/1dlreqh/girl_i_slept_with_grossed_out_i_ate_my_own_cum/",
        "content": "Girl I slept with grossed out I ate my own cum\n\nHey everyone. Gonna get right into it. I’m 26 M and I eat my own cum, I can’t explain why tbh lol it’s easy for me to clean up and ig there is something erotic about it, i’m still horny after i nut too. \n\nI’ve done this since I started jerking off basically. I dated my ex for about 5 years and i would always lick it off her when i was done. once she started birth control i was able to cum inside her and from there i ate it out of her after sex. \n\nFast forward, i’ve been single and dating for about two years and have been on a couple dates and when those led to something I would wear a condom and cum in it but resisted the urge to eat it.\n\nI’ve been talking to this girl for a few weeks and we went on a few dates but yesterday my roommates out of town so I invited her over and we had sex. she was on BC so she let me cum inside her. after that i went down on her and started eating her and my cum out of her pussy. I was so turned on since I haven’t been able to do that for almost two years. \n\nShe enjoyed the eating out session but was grossed out that I did it after i came in her and saw me actively licking it. Today texted me today and asked if i was gay and told me it was disgusting. \n\nGoing forward, is this something I should warn girls about? It’s almost instinct for me to clean it up and taste it. \n\nEdit: I want to clarify about the condom part. The way I wrote sounds that I REALLY craved my condom jizz but when I was writing it I was trying to convey that cumming in the condom turned me off of from eating it that way. There really was no urge to eat cum if it’s not on or in the girl i’m with. if my cum ever shot on the bed i wasn’t going out of my way to lick the sheets lol ",
        "num_comments": 6,
        "comments": [
            "Nta",
            "NTA your semen your rules",
            "That stupid cum is trying to escape your body but you don’t let it, great job!",
            "Your CUM your rules NTA",
            "is this gaeh stuff???"
        ]
    },
    "Please plap 🥺": {
        "title": "Please plap 🥺",
        "score": 39,
        "url": "https://www.reddit.com/r/copypasta/comments/1dloy7c/please_plap/",
        "content": "\nAre you fucking your sloppy handpussy nice and tight for Mommy? Stroking your leaking goonmeat, making embarrassingly loud PLAP PLAP PLAP noises as you pump pump pump your swollen cock 🥰❤️ \n\nMommy thinks it’s so cute when you goon your brain away for porn, just keep squeezing and touching and pumping and rubbing and edging!! \n\nMommy hopes you’re making the stupidest noises!! 🥺❤️ Mommy really wants to hear you go “nghhh ffffuckkkk ghhuh Mommy nhghhh” like the stupid porn addicted gooner you are! Just go all out for Mommy! Growl, grunt, swear, word vomit all the porn you’ve been shoving in your brain!! \n\nSo many pretty, jiggling, bouncy, oiled tits and asses!! Hard, greasy fat cocks and puffy, swollen glistening pussies :3 all those pretty bodies sloppily smashing against each other, it’s just too good to stop!! \n\nSo don’t! Please don’t stop plapping your sloppy penis for Mommy 🥺 Mommy wants you stupid and weird and perverted and addicted!",
        "num_comments": 25,
        "comments": [
            "Hey pal!👋👋, listen friendo, when I saw your comment, I started immediately touching myself, hope I can touch you next. Over and out👍",
            "I'm kinda into it",
            "Now t h i s is the first post I see at 2 am? Not a good sign for the rest of the day 😭😭",
            "Keep going I’m almost finished",
            "Reading this stuff is like looking at a car crash, it’s the most horrible thing you’ve ever witnessed but you keep looking anyways",
            "[removed]",
            "smash",
            "source/sauce?",
            "Jeb Bush wouldve won if he said that",
            "Words cannot describe just how disgustingly erect I am"
        ]
    },
    "Should I let my roommate know I can hear him jerk off ?": {
        "title": "Should I let my roommate know I can hear him jerk off ?",
        "score": 47,
        "url": "https://www.reddit.com/r/copypasta/comments/1dlnuuq/should_i_let_my_roommate_know_i_can_hear_him_jerk/",
        "content": "\n\nBasically my 19 year old roomate (who is also my best friend) recently broke up with his girlfriend, since then I've noticed he has been jerking off way more in the toilet (which is fine, a guys gotta do what a guys gotta do), but thing is our walls are paper thin, and I can hear the fapping sounds and even occasional porn moans from his headphones. I don't really jerk off much because I have a girlfriend, but would probably do the same if I were in his position. Should I mention it to him since he obviously isn't getting any action? To be completely honest what would I even say? Another seperate thing is he recently bought a fleshlight and leaves it around in the shower, at first I didn't have a problem with it but recently I had a friend come over who saw it and mentioned it was weird, this sorta made me change my mind on it. Would I be an asshole if I asked him to pack it away somewhere else, but idk how those things work if they need to be washed and its easier to keep in the shower for that or whatever?\nHas anyone been in a similar circumstance ?",
        "num_comments": 9,
        "comments": [
            "Did you make this up? 😂 cause it sounds real",
            "His dick his rules",
            "Simply take his gf's place.",
            "This is such a real post omg",
            "Can you hear when another person masterbates if they are in another room?",
            "Yes, do that. It's too funny",
            "Break up with your girlfriend and help him out 😉",
            "Like all good copy pastas, it came from a different sub, but this one is weird and doesn’t allow cross posting",
            "Ahhh okay lol. I’m new"
        ]
    }
}