{
    "hey chat new “no literal erotica” rule!!! so please stop posting it!": {
        "title": "hey chat new “no literal erotica” rule!!! so please stop posting it!",
        "score": 1376,
        "url": "https://www.reddit.com/r/copypasta/comments/182x0tp/hey_chat_new_no_literal_erotica_rule_so_please/",
        "content": "hey guys,\n\nyeah the title is kinda self-explanatory, i’m just gonna be removing posts that are just literal erotica and/or doesn’t really fit the spirit of copypasta. sexual/NSFW posts are still fine, but if the copypasta is something you’d find off of AO3 or something then it’s getting removed.\n\nwhen in doubt, consider the question “where the hell am i gonna paste this?”\n\nadios,\n\ntyrant-in-chief u/Derpster3000\n\nedit: just to clarify a bit, when I say “erotica” i mean those really weird incest/underage posts where it’s those shitty “i, M15, desire my dad” type posts. I’m not really going to enforce this rule heavily unless it’s really weird shit.",
        "num_comments": 222,
        "comments": [
            "where the hell am i gonna paste this",
            "Literally 1984 (I actually hate them plus most of them are fucking disgusting)",
            "ok but where is cummy? is he safe? is he alright?",
            "Would the penis monkey be considered this because I could think of 200 ways to past it",
            "At least half of this sub is erotica, you are going to remove half of the posts?",
            "Can we also get rid of every third incest post",
            "i do think that some lines from shitty ao3 fanfics could make funny copypastas, but yeah, there needs to be a limit.",
            "Will the gay femboy erotica stay tho????",
            "Please do remove such posts and save this subreddit",
            "my brain turned off and i genuinly thought this was a copypasta"
        ]
    },
    "Erotica fanfics are BANNED🤬": {
        "title": "Erotica fanfics are BANNED🤬",
        "score": 663,
        "url": "https://www.reddit.com/r/copypasta/comments/1b9jzkp/erotica_fanfics_are_banned/",
        "content": "I want to keep this short and simple. Effective immediately NSFW/Erotic fanfics will be deleted and user will be ban.\n\nThis is a copypasta sub not a low effort-erotica-wattpad-karma-whoring sub.\n\nI am only posting this in response to every soon-to-be crybabies that shout \"MOd aBuSe 😭\"",
        "num_comments": 150,
        "comments": [
            "you just killed the sub",
            "No come on please I think I can speak for all of us when I say we need more Erotica fanfics I personally think think this is low-effort-mod-abuse-karma-whoring\n\nBring back the good old days",
            "You stupid fucking piece of shit, I will fucking fuck you up.",
            "Semen infinito. Te sientas en el baño para masturbarte pero empiezas a correrte incontrolablemente. Después de diez rachas empiezas a preocuparte. Tu mano está pegajosa y apesta a semen. Empujas desesperadamente tu polla en un fajo de papel higiénico, pero solo te duelen las bolas. El semen se acelera. Han pasado tres minutos. No puedes dejar de correrte. El piso de tu baño está cubierto con una fina capa de líquido de bebés. Intentas correrte en el desagüe de la ducha, pero se acumula demasiado rápido. Pruebas el baño. El semen es demasiado espeso para tirarlo. Cierras la puerta del baño para evitar que el semen se escape. El aire se vuelve caliente y húmedo por el semen. El semen se acelera. Te resbalas y caes en tu propio esperma. El semen ahora tiene seis pulgadas de profundidad, casi tan largo como tu manguera de semen aún erecta. Tumbado sobre tu espalda, comienzas a correrte por todo el techo. Globos del fluido blanco pegajoso comienzan a caer como gotas de lluvia, dándote un facial con tu propio semen. El semen se acelera. Luchas por pararte mientras la fuerza del semen comienza a impulsarte hacia atrás como si estuvieras en un deslizamiento y deslizamiento temático de bukkake. Aún de rodillas, el semen ahora está a la altura de la barbilla. Para evitar ahogarse, abres la puerta del baño. El diluvio de jugo de hombre te recuerda a la Gran Inundación de Melaza de 1919 (es algo real, búscalo), solo con semen en lugar de melaza. El semen se acelera. Han pasado dos horas. Tus hijos y su esposa gritan de terror mientras sus cuerpos son engullidos por el lodo blanco como la nieve. Tu hijo más pequeño se hunde, con burbujas viscosas y gritos ahogados que salen de la sustancia pegajosa. Le ruegas a Dios que ponga fin a tu sufrimiento. El semen se acelera. Aprietas tu polla para detener el semen, pero en su lugar comienza a gotear por el culo. Déjalo ir. La fuerza del semen abre tu uretra, dejando solo un gran agujero en la entrepierna que arroja semen.Los helicópteros militares te rodean. Cientos de balas perforan tu cuerpo, pero permaneces consciente. Tus testículos ahora se han convertido en un cerebro sustituto. El semen se acelera. Han pasado dos días. Con tu cuerpo ahora destruido, el semen comienza a rociarse en todas direcciones. Rompes la barrera del sonido. El gobierno despliega aviones de combate para perseguirte, pero el impacto de tu semen hace que un avión se estrelle contra el suelo. El gobierno decide dejarte salir de la tierra. Sientes que tus gónadas comienzan a quemarse a medida que alcanzas los bordes de la atmósfera. Se pierde por poco la ISS, dándole un nuevo trabajo de pintura blanca mientras pasa volando. Los físicos luchan por calcular tu trayectoria errática. El semen se acelera. El semen comienza a gravitar hacia sí mismo, formando un rastro cometa de semen. Los astrónomos comienzan a llamarte \"Cummet\". Estás atrapado en el espacio para siempre, despojado de tu cuerpo y sentidos, obligado a soportar una eternidad de corridas. Finalmente, dejas de pensar ... a medida que tu conciencia se desvanece en la oscuridad, el abismo infinito, tu semen se fusiona con el continuo espacio-tiempo. Ahora no hay nada. Nada... excepto cum.",
            "but i constantly paste gay erotica to my friends?!?",
            "Ahh well, there’s always another subreddit for that",
            "This subreddit is ruined now",
            "Can you actually enforce this all the posts are just \"lmao sex funny\"",
            "this sub has turned to porn bro its not even funny",
            "IF YOU OR A LOVED ONE HAS BEEN DIAGNOSED WITH MESOTHELIOMA YOU MAY TO BE ENTITLED TO FINANCIAL COMPENSATION. MESOTHELIOMA IS A RARE FOFM OF CANCER, LINKED TO EXPOSURE TO ASBESTOS. EXPOSURE TO ASBESTOS IN THE NAVY, SHIPYARDS, MILLS, HEATING, CONSTRUCTION OR THE AUTOMOTIVE INDUSTRIES MAY HAVE PUT YOU AT RISK. PLEASE DON'T WAIT, CALL TODAY FOR A FREE LEGAL CONSULTATION AND FINANCIAL INFORMATION PACKET. MESOTHELIOMA PATIENTS CALL NOW!"
        ]
    },
    "I cummed in my doctors mouth": {
        "title": "I cummed in my doctors mouth",
        "score": 1183,
        "url": "https://www.reddit.com/r/copypasta/comments/1dqp6dd/i_cummed_in_my_doctors_mouth/",
        "content": "I went to get my physical and when the doctor told me to take my pants off I got super nervous because I had a crush on her. “I’m hard” I blurted. My beautiful doctor just smiled and said “we can take care of that.” She took my pants off and started sucking on my hard wee wee. It felt so good and awesome. I felt her tongue on my tip playing with an giving extra care to it. I ended up cumming in her mouth and she swallowed every last bit. I felt really guilty about the fact I had just cummed in my doctors mouth but she assured me it was alright. I am really looking forward to my next appointment.",
        "num_comments": 45,
        "comments": [
            "My therapist killed herself after i told her about this post i read. Anyway, relatable.",
            "YTA, your dick my rules",
            "Update: The doctor got me hooked to fentanyl",
            "Least horny redditor's True Story™",
            "Were you playing as Johnny sins?",
            "I hope you have good insurance because this is gonna cost extra.",
            "Why is there blood in my poop",
            "NTA your doctor your rules",
            "nice. i asked my boyfriend to re-enact this with me so he agreed. he's just signed up for med school so in about 4 years, i will be sure to write up Part 2 on this subreddit thx",
            "I don’t think this happened homie"
        ]
    },
    "Does sitting on a guy's boner hurt him?": {
        "title": "Does sitting on a guy's boner hurt him?",
        "score": 164,
        "url": "https://www.reddit.com/r/copypasta/comments/1dqy7wp/does_sitting_on_a_guys_boner_hurt_him/",
        "content": "So recently I was hanging out with friends and we were watching a movie on the couch. I was sitting on a male friend's lap, which he didn't mind since I'm a pretty small girl. At one point in the movie, there was a scene where a girl was running around topless, and I felt something grow under my butt. Took me a bit but I realized he had an erection. I didn't care much about that but I was a bit concerned that maybe me sitting on it was painful. I didn't end up asking him though, since we had friends around and I was pretty comfy. But I'm still wondering if I should avoid sitting on laps from now on.",
        "num_comments": 19,
        "comments": [
            "This is some dudes fetish, give me the link so I can laugh at it",
            "You didn’t even post the funny part of her post history. She posted yesterday a post with the title “why did no one tell me dicks look so nice bruh” with that casual phrasing, then wrote “this is not an invite to dm me creepy shit” in the description. It was pretty funi I think.",
            "Depends on the angle but most likely no and he was just to embarrassed to even attempt to bring it up",
            "I tuck it in my own ass crack and sit on it. No pain",
            "damn... I missed it :(",
            "damn, that sucks\n\nbut also kinda funny",
            "My stupid ass thought this was ask reddit- myb",
            "Just checked ops history, they are making it up. L.ao",
            "It okay yours was still funi also c:",
            "NTA- Reddit funny, good on you for trying to answer a question lmao"
        ]
    },
    "I found this downbad post on the sex subreddit. ": {
        "title": "I found this downbad post on the sex subreddit. ",
        "score": 57,
        "url": "https://www.reddit.com/r/copypasta/comments/1dr1jq7/i_found_this_downbad_post_on_the_sex_subreddit/",
        "content": "# Sucking dick is completely underrated. \n\nI am the only one in my entire friendship group that actually enjoys blow jobs. It’s absolutely crazy to me how not only none of my friends like it, they hate it! I think it’s one of the sexiest things ever and probably my favourite part of sex in general.\n\nThere’s nothing hotter than kneeling in front of a guy and unzipping his pants to find he’s hard and then taking him into your mouth. Sometimes I even get excited to see he’s soft too, I really like the feeling of him getting hard in my mouth. I love everything about it. I love the idea of sucking it. love being so close and personal to his cock. I love tasting his pre cum. I love hearing him moan in pleasure. I love seeing his toes curl. I love feeling him explode in my mouth. I just love everything about it.\n\nI think I’m very good at oral sex, part of that is technique but I think a huge part of that is my attitude towards it. I don’t need to be on my period to suck cock, I don’t need to be bribed or asked to suck cock. I genuinely love it. I actually feel like I should thank him for letting me suck him... is that crazy? It feels like a gift haha. I think the way you approach oral sex and your attitude towards it is probably equally as importantly technique. But, here are some things I like to do that I think make it even better for the guy...\n\n* Eye contact. It makes me feel so dirty and submissive to look up at him while I suck his cock. I think the eye contact makes it so sexy.\n* I like to tease at first by kissing his thighs, slowly working my way to his balls.\n* Never ever forget about the balls! This is so important. Lick them slowly, lick them fast, lick them with the tip of your tongue (make it pointed), lick them with your tongue flat and definitely suck them but be very very gentle!\n* Lick all the way from the base of his dick to the tip.\n* Slapping his dick across your face usually goes down well.\n* Always always always continue to lick his head while you suck. Swirl your tongue around, up and down, side to side, anything. Just keep it moving constantly. Sucking shouldn’t be just up and down, your tongue works wonders!\n* Dirty talk! Silence is fine, moans are better but dirty talk is much sexier. Make sure he’s into it though, not every guy might be but I find telling him how wet you are, how much this is turning you on, how much you love his dick or how much you want him inside you, how your his slut, will always go down well.\n* Moan moan moan! He’s going to love hearing you moan while you suck him. He will also feel the vibrations of you moaning on his dick too.\n* Try and deep throat, if you can, brilliant. If you can’t, take as much as you can for as long as you can then gag and tell him how big he is and how you can’t take it all but how much it turns you on trying. No guy is going to unhappy hearing his dick is too big for your mouth.\n* Fake deep throating. Make sure your hand is wet, stroke him and suck the tip in your mouth. This will stop the gagging, mean you can focus all your attention on his head and also give him the feeling of deep throating.\n* masturbate if you can, I’ve found that if your able to play with yourself while doing it then that just sends guys over the edge. Not only does it show how into it you are, it also feels so dirty and if your wet enough they will be able to hear that while you suck his dick.\n* Ask him where he wants to cum/tell him where you want him to cum. If you have no preference where he finishes then ask him what he likes, just make it sexy! If he says he wants to cum in your mouth, something like ‘mmmm, you want to fill up my mouth with that cum?’ Or ‘empty your balls into my mouth’ would work. If you don’t like it in your mouth then say something like ‘I want you to cum in my face, I want to feel like your dirty slut’ is much better than ‘no I don’t like the taste of cum’\n* If he’s taking too long and your mouth is sore then tell him your so horny you can’t wait anymore, you need him inside of you right now. This is much better than ‘are you almost done? My jaw hurts’\n* Compliment his dick but make sure you mean it. If he’s not the biggest hen he’s going to know that, don’t tell him he’s huge because he will know your lying, tell him how hard his cock is and how good it feels in your mouth. If he is big then definitely make sure to tell him! Make sure you tell him how big and full his balls are, how good his cum tastes, how sexy he looks while you suck his cock, how attractive his cock is, how sexy he sounds moaning for you etc. Guys need compliments too! But they must be genuine.\n* Surprise him with blow jobs. A wake up blow Job or shower job will always go down well. Wait until he’s on the phone of playing Xbox and unzip his pants, make it feel naughty.\n* I can’t remember the actual word for it, but the thin line on his balls (should be straight down the middle separating both his testicles) is very sensitive. You must be super gentle but licking this very carefully should feel amazing for him.\n* Don’t wait to be asked to suck his dick. Start sucking before he even has a chance to ask for a blow job, show him how much you love it by doing it by choice, not because he asked.\n* Don’t ask for oral back every single time you suck his dick. It makes it look like a chore and that your only doing it to get something in return. It’s fine to do this sometimes, but if it’s every single time it gives the impression you only do it to get oral back. If he offers himself that’s different of course.\n* If your happy to swallow his cum then great. If your not then try and make it sexy. Let him cum in your mouth and then let it drip down on to your breasts (or let him cum on them if you don’t even want it in your mouth) and then rub his load into your boobs like lotion. Make sure to smile and make eye contact while you do it.\n\nEDIT: Wow! That’s for all the responses, I didn’t expect this to blow up (pun intended). I just wanted to add that of course you need to get permission to suck his dick before you actually do it, especially if it’s a surprise. I just figured that went without saying so I didn’t feel the need to mention that. Another thing, I didn’t mean you shouldn’t want oral in return, I just meant don’t ask for it as it looks like your doing it to be pleasured back, I didn’t mean you shouldn’t want your pussy licked. Yes my post is very ‘porn star’ but I mean.... how many guys are going to complain that you suck dick like a porn star? I literally can’t think of any! If the guy your with doesn’t like something I’m sure he will tell you and you can change that. Communication is obviously key! Also, I’m definitely female 😂😂\n\n---\n\nI found this other guide for the other kind of oral sex from another downbad commentator. In the name of gender equality I must also post this!\n\n---\n\noh dear god. there's that first initial gasp when suddenly someone's tongue makes contact with you. it's a little cold at first, in a wet and exciting way. kind of like putting something minty on your skin. tongues, used well, are much more refined instruments than fingers. they can either cover more surface area or become pointed and extremely localized. this is how i prefer to start -- go extremely slow, hover between my legs so i can feel you breathing and maybe you kiss my thighs. very occasionally you flick your tongue over my vulva and i will yelp. i myself would like it if at first you left my clit alone -- she's too sensitive for immediate onslaught. play around for a while. this part feels crazy amazing; if i'm aroused i'm already feeling a throbbing inside me but every time you suddenly lick me it's like all that interior feeling leaps to the surface and is crystalized in a bolt of warm juicy lightning.\n\nthe best part of this early stage is that i don't know what's going to happen next. you should try and surprise me. take a long pause, give me one lick, pause again, then three short licks in succession. i am all tensed up at this point, completely focused on the next moment your tongue will make contact, and feeling the desire to spread my thighs far apart to make room for all the need you are building up in me.\n\nthen you should really get down to business, as while i love the teasing stage i can't take it for too long. (you'll know because i'll make some frustrated vocal noises and i'll be arching my pelvis towards you.) here is where you should start exploring \"in the groove,\" as i call it. try long slow licking motions that start at my vaginal opening and go all the way up to, but don't QUITE make contact with, my clit. then vary the length of the lick, the speed, and the shape of your tongue -- try pointy, then big and wide. in this stage my body relaxes; it's sort of like getting the most hyperbolically good massage of your life, and you can't believe how awesome it feels so you just sort of melt into it.\n\nthen you start working my clit and this is where i go bonkers. try licking up to it -- stroke your tongue repeatedly from about half an inch below it right up onto it. my vaginal walls are tensing like crazy at this point, and i am rotating my pelvis towards you because i can barely stand it but i need more. i don't even have the words for this part -- it feels absurdly wet and sparkly, though the sensation is still happening on the surface at this point.\n\nif you're doing your job well, at some point during this stage i will start to feel a strong, bodily premonition: i am going to come. i visualize this shift as a change in WHERE the sensation is coming from: while before it was all in the little external sphere of the clit itself, at this point the clitoris's roots well inside me have suddenly gone warm and tense. (look this up ---- the clit is misunderstood, it isn't just a little button but a really large interior structure.) they are grabbing all the muscles in my pelvis and squeezing. i begin to feel intentionality at this point: before i was just enjoying how absurdly good this feels, but now i am on a mission. i am going to orgasm my brains out. for me, coming strongly involves my pelvic muscles, so you'll notice where i'm at because you'll feel me contracting under you. i am probably also shifting my legs around at this point.\n\nnow, you can keep me on the verge for a long long time -- but whatever you do, don't return to the teasing stage at this point. focus on the groove as a path to my clit. when you do something in particular that increases that \"i am going to come\" sensation in me, that's when i'm most likely to exclaim \"YES\" or \"FUCK\" or \"JESUS\" or just \"WHARBARBALFGBLE.\" keep doing that thing.\n\nthere will come a point where everything in my body knows that we are going to come IMMEDIATELY if the right sensations keep happening. for me, this is the only time when you should focus entirely on my clit. you will know because i am clenching everything in my body. everything you do on the surface is sending warm, contracting depth charges of pleasure into my pelvis. i lose my ability to feel really subtle sensations at this point: i want you to pick a repetitive motion and DIG IN. you might have to try a few different ones but it will work.\n\nthe part just before i actually come is the best fucking part. oh jesus. i am on a giant cliff-edge of more pleasure than i thought was possible and suddenly, all those clenched muscles relax for just a few seconds. everything is silence and slow motion and i feel a big, round, room-filling sensation of OH. MY. GOD. then i begin the orgasm and everything clenches back up, i am falling down the cliff and my vaginal walls are contracting fast, and the sensation is one of pulsing bursts of intensity that i almost can't stand. it is probably hard to keep your tongue on me at this point, i am probably thrashing around, but don't stop. i need to get every possible pulse out of me. when i have, i will probably shiver and moan, and that's when i'll be able to relax again and feel a huge gentle wave of pleasure out to my fingers and toes. high five! good job! we did it!\n\n...i'll be in my bunk.",
        "num_comments": 17,
        "comments": [
            "This is genuinely great info. Should be taught in sex ed.",
            "Penis envy is real. Just to have a femboy kneeling infront of me ✨",
            "Hey uhhh.... you mind uhhhh.... linking the oop....?",
            "I love when I stumble across Grandma on social media 😊",
            "So no sigma skibidi scat anymore?",
            "I was expecting a few lines not a fucking dump truck",
            "Relatable (I'm a straight guy)",
            "How to sexually please someone should be something standardly taught. But no, abstinence only in many schools.",
            "You're kind of turning me on. No idea what you are tho",
            "What do you mean \"what am I\"? I presume a human that pretends to be breadcat online."
        ]
    }
}