{
    "YouTube TV Needs More Than the NFL to Combat Cord-Cutting Blitz": {
        "title": "YouTube TV Needs More Than the NFL to Combat Cord-Cutting Blitz",
        "score": 32,
        "url": "https://archive.ph/UXNwF",
        "content": "",
        "num_comments": 23,
        "comments": [
            "They need fewer channels and skinny bundles to survive.  Venu could be dangerous for them because of that.  A big issue with YTTV is that many subscribers get all their scripted shows from other streamers like Hulu and Peacock which are much less expensive.  Thus YTTV is only valuable for live stuff and even then some of that is on other streamers.\n\nA $73 service can be replaced easily by several services in the $10-$20 range.",
            "They could try NOT raising the price by $10 every year.",
            "Add MLB and NHL Network to the sports tier and I'm sure they would make more money and people would not cancel said sports tier every January.",
            "Better start creating content or getting some licensed content.",
            "Becauseeeee NFL is the only fucking reason to have youtubetv.  if it wasn't for sports I wouldn't have it.",
            "And they need more than the AMC Fast channels as well to combat anything. They need MeTV, A&E and other channels to make themselves even remotely better.",
            " I think the only move YoutubeTV has is to double down and get more sports, the lack of content on linear TV is eventually going to catch up with them.",
            "I would settle for $20 cheaper.",
            "Add MLB Network back and I’ll come back.",
            "I cut Xfinity which was close to $100/month.   All I need is a couple of Broadcast stations my HDTV - Antenna doesn't get, FX,  USA, CNBC and that's about it.  I'm not paying $73/month for that."
        ]
    },
    "NFL Ordered to Pay $4.7B After Losing ‘Sunday Ticket’ Trial": {
        "title": "NFL Ordered to Pay $4.7B After Losing ‘Sunday Ticket’ Trial",
        "score": 348,
        "url": "https://www.hollywoodreporter.com/business/business-news/nfl-pay-4-7-billion-after-losing-sunday-ticket-trial-1235934357/",
        "content": "",
        "num_comments": 70,
        "comments": [
            "I just hope this ends up with me getting a coupon for 5% off next year's Sunday Ticket, so it will be just as useful as every other class action suit ever.",
            "Fan friendly my ass. Sunday Ticket is an absolute ripoff, and NFL+ is glitched so hard I gave up and got Red Zone on Hulu.",
            "Why can't I buy the games for just one team? I'm not interested in every game for every team. I have a life.",
            "They'll just raise rates.",
            "I can't wait to get my check for $10!",
            "4.7 billion seems massive but I looked up NFL made 19 billion in profits for 2023 lol",
            ">The decision, which was reached after less than a full day of deliberations\n\nOh wow that seems really fast to reach a decision. \n\n>The 8-year-old legal battle....\n\nOh never mind.",
            "So who gets the $4.7 Billion?  I'll bet none of it goes to the customers who spent it.  Everyone in this country is on the take including 'The Big Guy'.",
            "> NFL fans brought the class action in 2015. They highlighted a major difference in how the NFL approaches broadcasts compared to the other four professional sports leagues: Viewers who want to watch games that aren’t broadcast locally must purchase the Sunday Ticket premium offering. This means that Kansas City Chiefs fans living in Los Angeles must pay hundreds of dollars per year at allegedly inflated prices to watch their favorite team play. There’s no offering that allows them to just watch Chiefs games.\n\n\nThere's no offering for MLB, NHL, or NBA that allow you to buy in and watch all of a single teams games.  You still have to contend with blackout restrictions on broadcast and the myriad of channels needed to see everything for a single team.  The court really should have looked more closely at this claim... though maybe this will be good news it the result trickles down to the other major sports.\n\n\nThat said, I get this is an old case and things have changed a lot in the last 9 years.  There's the Amazon deal for Thursday night football, the exclusive games on Peacock, other than last season... MNF on ABC was moved to ESPN.  Sunday Ticket is just for those out of market Sunday games but doesn't even touch on the entire league.   But the other sports aren't exactly doing anything friendlier since most have very little available on over the air networks for free.  Most have their content so split up, there's no point in following it anymore.",
            "Let’s gets the FACTS straight. The number is $14B after triple damages in NY."
        ]
    },
    "Can I watch the 2024 Olympic Opening Ceremony without paying for a cable subscription?": {
        "title": "Can I watch the 2024 Olympic Opening Ceremony without paying for a cable subscription?",
        "score": 1,
        "url": "https://www.reddit.com/r/cordcutters/comments/1dqut87/can_i_watch_the_2024_olympic_opening_ceremony/",
        "content": "I live in the US.\n\nCan I watch the Opening Ceremony on broadcast TV?\n\nCan I watch the Opening Ceremony on [nbc.com](http://nbc.com) without entering cable subscription info?",
        "num_comments": 4,
        "comments": [
            "Opening Ceremony you won’t be able to watch on nbc.com without cable. You can watch it over the air if you have an antenna or on Peacock.",
            "Likely available OTA with an antenna. Maybe/probably on tape delay replay/not live to US prime-time?",
            "I'm guessing no.\n\nI've resigned myself to paying for Peacock for a month, and if they do decent coverage (as well as the NBC Sports app did last summer olympics, it'll absolutely be worth it!).",
            "Then I gather you live in quite a hell of a gorgeous mountain valley where the awesome scenery is just to die for day after day, but the OTA reception SUCKS big time every day.  As for me coming from the flat lands, I fortunately aren't forced to relate to that."
        ]
    },
    "Coax Length": {
        "title": "Coax Length",
        "score": 4,
        "url": "https://www.reddit.com/r/cordcutters/comments/1dqhyzg/coax_length/",
        "content": "The coax on my OTA antenna has about 30 feet of extra length that is coiled up under the house. While my OTA channels mostly come in OK, does the extra length of the coax cause some of the occasional pixilation and should I shorten it? If I cut the cable, what are the best end connectors should be used? Thanks. Chuck",
        "num_comments": 2,
        "comments": [
            "The greater the length, the more signal loss you do get, but below 100 feet it doesn't usually hurt much with a solid amount of signal. Of course, if your signal is weak, or at least weak at times, less cable should help at least a little bit.\n\nRather than cut and rejoin the cable in the middle, which will actually harm signal strength about as much as your excess length, you should pull through the excess cable at your indoor end, cut off the excess, and redo the termination there. I'd still keep 3-6 feet of excess for leeway. If you have a wall plate that is affixed directly to the cable, you might be able to just reattach it after cutting and preparing the end of the cable to be inserted again. If it is a coupler style, with the regular cable end on the back side of the plate, you'll just put another end on the cable after the cut. If you just have a cable hanging out of the wall, you'll just put a fresh end on the cable after the cut. Compression fittings are the best type to use, if you're willing to spend ~$12-15 for a tool and pack of ends (they usually come as a kit like that).",
            "Yes, definitely shorten it.  I get my Oklahoma City channels, all 54 of them, by using an RCA 65+ flat antenna with 10 ft. of RG6 cable."
        ]
    },
    "Best Hulu LiveTV deals?": {
        "title": "Best Hulu LiveTV deals?",
        "score": 1,
        "url": "https://www.reddit.com/r/cordcutters/comments/1dqofpe/best_hulu_livetv_deals/",
        "content": "Is there anyplace offering a bargain on this? My OTA antenna is shitty in my new home so I’m gonna have to pull the trigger on a LiveTV service  ",
        "num_comments": 8,
        "comments": [
            "Are you using an indoor or outdoor antenna?",
            "Yep I’m gonna save you some heartache and if you plan on using the DVR at all, DO NOT give Hulu any of your money. Stick with YTTV.",
            "Why lulu live i used it off and on and I always stick with you tube TV",
            "How far are you away from the TV stations? I'm 46 miles away from my TV channels and have no trouble getting all 54 of them by using an RCA 65+ flat antenna.  It gets the VHF stations, too.",
            "Indoor.  I’m not dealing with the hassle of getting on my roof and drilling a hole through siding to run a coax into my living room",
            "Indoor antennas are notorious for being bad.",
            "I know.  It worked great in my last home which was on a hill. Now I have too much tree blockage and it doesn’t work",
            "Do you perhaps still have coax from a previous cable service? If so you can pole mount an antenna into the ground and hook it up to existing coax otherwise my best advice for an indoor antenna is to get a tablo DVR and put the indoor antenna in an attic if you have one"
        ]
    }
}