{
    "CORSAIR @ Computex 2024 Megathread - Corsair Custom Lab, New Cases, Sim Racing, and more! ": {
        "title": "CORSAIR @ Computex 2024 Megathread - Corsair Custom Lab, New Cases, Sim Racing, and more! ",
        "score": 19,
        "url": "https://www.reddit.com/r/Corsair/comments/1d7l2rn/corsair_computex_2024_megathread_corsair_custom/",
        "content": "# From Cases to Customization, [we've revealed a host of new products at Computex!](https://cor.sr/Computex-PR)\n\nHere's the megathread of [CORSAIR's Computex 2024](https://cor.sr/Computex-2024) announcements - this thread will be updated through the week if any new information comes out, so make sure to check back regularly!\n\nWhile this is an extensive list of everything we've announced at Computex, please note that purchase availability for some products will be announced at a later date.\n\nhttps://reddit.com/link/1d7l2rn/video/0bnyqzjg5e4d1/player\n\n# [CORSAIR CUSTOM LAB (US Only)](https://cor.sr/CCL)\n\n>An all-in-one shop for specially designed products, [CORSAIR Custom Lab](https://cor.sr/CCL-PR) lets you pour your passion and personality into a fully equipped setup that’s brimming with self-expression.\n\nhttps://preview.redd.it/etom67l5pf4d1.jpg?width=3000&format=pjpg&auto=webp&s=4116227c3e5e7f80578d7dd542c806f46ce75538\n\n# [CORSAIR 3500X Case](https://cor.sr/3500X)\n\n>Removable tempered glass front and side panels offer a perfect view of components. Supports mini-ITX, ATX, and EATX motherboards. Compatible with reverse connection motherboards.\n\n# CORSAIR 9000D Case\n\n>Successor to the 1000D, the 9000D is a Full-Tower PC Case that offers ample space for cooling systems, extensive drive bays, and easy upgrades.\n\n# CORSAIR New Fan Series Collections\n\n>[iCUE LINK LX RGB Fan Series](https://cor.sr/iCUE-Link-LX-Fans) - LX is the modern version of the very popular LL series fans. 18 LEDs per fan spread across an inner and outer loop with customizable lighting that can be synchronized with all your iCUE RGB devices.\n\n\n\nhttps://reddit.com/link/1d7l2rn/video/ei4jnjneak4d1/player\n\n# [CORSAIR Accelerates Into Sim Racing](https://cor.sr/Corsair-Racing-PR)\n\n>Drawing on 30 years of gaming and engineering experience to design a versatile cockpit that promises a new level of quality and features suited for sim racing aficionados and new enthusiasts alike, CORSAIR will leverage its global production and distribution channels to make the hobby more accessible to racers worldwide\n\nhttps://preview.redd.it/0ugvd6gnuf4d1.jpg?width=3800&format=pjpg&auto=webp&s=98af60a2a6838f09755508dd6feae962fa2ec313\n\n# CORSAIR XENEON 34WQHD240-C\n\n>A 34-inch curved QD-OLED gaming monitor featuring a 0.03-millisecond GtG response time, 240-hertz refresh rate, infinite contrast ratio, and VESA certified DisplayHDR TrueBlack 400 technology for remarkably vivid visuals.\n\n# CORSAIR ONE i500\n\n>Meet the CORSAIR ONE i500 PC – a marvel of engineering with up to an NVIDIA GeForce RTX 4090 GPU and Intel Core i9-14900K CPU, both liquid cooled!   \n  \nJoining Wood Dark and Wood Light - please welcome out [Metal Dark design](https://cor.sr/ONE-i500-Metal-Dark-NA), available now!\n\n# CORSAIR SF PLATINUM ATX 3.1 PSU\n\n>These power supplies pack a punch, delivering 80 PLUS Platinum-rated power in wattages up to 1000W. Their Type 5 Micro-Fit connectors take up less space for better cable management and case compatibility.\n\nhttps://preview.redd.it/q72qiho0uf4d1.jpg?width=3500&format=pjpg&auto=webp&s=def428777380c7d6600149683f984fbcb402c934\n\n# iCUE LINK TITAN RX RGB AIO Liquid CPU Coolers\n\n>These AIO CPU coolers leverage the cutting-edge FlowDrive cooling engine designed by CORSAIR, powered by a three-phase motor combined with a precision engineered cold plate surface profile to maximize contact with the CPU.\n\n# [iCUE Link Groove](https://cor.sr/iCUE-Link-Groove-Cap) and [VRM Fan](https://cor.sr/iCUE-Link-VRM-Fan-Cap) AIO Cap Modules\n\n>Compatible with all iCUE LINK coolers including the TITAN Series, easily upgrade the look or functionality of your cooler. The Groove module changes up your vibe with a unique contoured design, while the VRM Fan module cools the motherboard components around the CPU socket – perfect for power users looking to overclock.\n\n*They're fun lil guys.*\n\n# iCUE LINK LS Aurora Strips & iCUE ARGB PSU Cable Strips\n\n>Add more color to your PC with the iCUE ARGB PSU Cable strips and iCUE LS350/430 Aurora Strips! The new iCUE LINK LS Aurora adapter will allow for compatibility between legacy 3-pin iCUE devices and modern iCUE LINK standards.\n\n# Check out our current [Explorer Articles](https://cor.sr/Explorer-Computex-2024) on everything that's been announced above!\n\nMake sure to tune back into this thread through the week for potentially new information!\n\n# What products are you excited about? What do you want to learn more about?",
        "num_comments": 25,
        "comments": [
            "#  iCUE ARGB PSU Cable Strips\n\nFinally!",
            "https://www.youtube.com/watch?v=M3prckY9RkE\n\nWhats in the box!",
            "I need that 9000D case!",
            "I just bought the Rx and now the lx comes out 😭😭",
            "[deleted]",
            "9000D confirmed let's goooooooo",
            "Are you mad Corsair? You got rid of that ugly cable going from the pump in iCue Link and now you bring it back??",
            "That gaming monitor is on which generation of QD-OLED panel?\n\nAh, forget it, it's DP 1.4. Will wait for 2.0 revision, not getting 1,4 with planned 5090 release this year.",
            "Wouldve loved reverse blade options for RX and QX fans",
            "Can they please buy fanatec already."
        ]
    },
    "iCUE 5.16.75 Patch Notes - Gigabyte": {
        "title": "iCUE 5.16.75 Patch Notes - Gigabyte",
        "score": 11,
        "url": "https://www.reddit.com/r/Corsair/comments/1dp3h2d/icue_51675_patch_notes_gigabyte/",
        "content": "# The [latest iCUE update](https://cor.sr/iCUE-Download) has arrived!\n\nhttps://preview.redd.it/28ftk3tn4y8d1.png?width=1043&format=png&auto=webp&s=77067d0e46db8de7bb344c26c4d20771859c75c8\n\n# Software Enhancements\n\n* **iCUE now officially supports** the detection of **Gigabyte motherboards for RGB** lighting control.\n   * This plugin will support the latest chipsets from AMD and Intel as well as their respective last-generation chipsets. To enable this feature, go to Settings > Plugins, then click the install button to the right of 'Gigabyte Plugin’\n   * Please [see our latest Help Article](https://cor.sr/iCUExGigabyteIntegration) for more information and installation instructions on this integration - Gigabyte Control Center is required.\n\nhttps://preview.redd.it/mzk9yjqo4y8d1.jpg?width=3000&format=pjpg&auto=webp&s=268bde036390aa0a894a4b13afd5a237f7fbd52b\n\n* The following devices have been **added** for **Govee Support**:\n   * *H61C2, H61C3, HC165*\n* Updated the background image for the “Monitor Screen” effect in *iCUE Murals* to improve usability\n* Updated the driver for *SCUF ENVISION* and *ENVISION PRO* that prevented the controller from working properly in certain *XBOX* games\n* Added additional “Don’t show it again” checkboxes for notifications related to third-party applications\n* Resolved various user interface issues when *iCUE* is in different languages\n* Resolved an issue that prevented the clicking of ‘Pairing Reset’ when too long of a name was used for the device\n* Resolved a rare issue that causes the ‘Restart Now’ and ‘Retry’ buttons to be inoperable\n\n# HID Product Enhancements\n\n* Resolved an issue with certain keyboard models that prevented the assignment of keybindings after a forced firmware update\n* Resolved some **Device Memory Mode** issues with *GLAIVE* and *GLAIVE PRO*\n\n# DIY Product Enhancements\n\n* Resolved an issue that showed a blank screen option for default LCD screens\n* Resolved an issue that prevented the ‘Shutdown PC’ alert for systems with *NVIDIA 3000 series* GPUs\n* Improved the performance of *iCUE* when there are 24 devices connected to the *iCUE LINK HUB*\n\n&#x200B;\n\n*^(Sorry)* u/agentdave7 *^(for the mostly)* [*^(duplicate post)*](https://new.reddit.com/r/Corsair/comments/1doe8w9/icue_51675_released_adding_gigabyte_support/) *^(hehehehehe)*",
        "num_comments": 21,
        "comments": [
            "Does this works with Gigabyte GPUs?",
            "Sure I remember you mentioning this too Dave 😉",
            "When can iCue detect my AIO LCD screen without me having to restart iCue after it launched on startup every time I reboot my system?",
            "This was mentioned in the press release from earlier this month:\n\n> Support for GIGABYTE hardware comes via an SDK implementation and requires GCC to be installed.",
            "Is there any info on what Govee products will be added in future? For example, H6067?",
            "Any chance support for MSI motherboards is coming?",
            "Would love a g skill trident rgb plug in!",
            "Really? That's amazing if true. Gigabyte's OWN software can't even control its rgb lmao",
            "This better stop my Capellix from being undetected and flashing red like there’s no tomorrow since the firmware update link has disappeared from the face of the earth",
            "Imagine if this fixed the overcurrent issue that so many of us have 💀"
        ]
    },
    "Cant get it to work": {
        "title": "Cant get it to work",
        "score": 54,
        "url": "https://i.redd.it/ouh0cksg3d9d1.jpeg",
        "content": "I have tried everything but no matter what I do it keeps turning on with the intro and then popping up the red alert. Any suggestions before I have to return it? \n",
        "num_comments": 36,
        "comments": [
            "please change the orientation of your aio right now.",
            "This must be rage bait. GG",
            "dude, you've probably killed your pump.\n\nradiator should always be top point of the AIO system",
            "Shutdown the PC and flip the PSU off. Hold down the case power button to drain any remaining power. Pop the LCD top off the cpu block, then remount it. Check to make sure the USB cable is secure on the LCD top. Disconnect and reconnect the wide power/data cable on the side of the Commander Core that leads to the pump. Flip the PSU back in and start normally.  \n\nThe hard power cycle should force all the components to do a full check on start up. The (!) is a general fault, usually communication based. It can be an imperfect connection in the mount. It can be an unsolvable issue. ",
            "https://preview.redd.it/jobuutk75e9d1.jpeg?width=1179&format=pjpg&auto=webp&s=21fa3b7afdeb375cad04d2267f887e7fbe5a1a99",
            "I'm just here for the obvious trolling goin on",
            "Could just be bad usb connection to the motherboard. Check the connection of pump and lcd to commander core (I assume that's what you got), replug both of those and try a different socket for us to motherboard.",
            "You cpu cooler isn't going to last long your going to get air in your  system",
            "I almost spit out my coffee. Bruh.",
            "Jesus christ. Move the aio to the top. I'm shocked how many people do this"
        ]
    },
    "Can I use the 600W 4 12vhpwr for the RTX4080 super?": {
        "title": "Can I use the 600W 4 12vhpwr for the RTX4080 super?",
        "score": 6,
        "url": "https://i.redd.it/p9p7ws4plf9d1.jpeg",
        "content": "I'm building my first pc and just found out the Corsair rm850x (2021) doesn't come with all the needed cables to power the RTX 4080 super.\nIt's asking for three seperate PCIe cables and the manual states not to pigtail. Since I don't have three PCIe slots on the PSU available (2 already in use for the CPU so only 2 left) ordering an extra PCIe won't do. \n\nAfter browsing reddit for a while I found that some people advice to buy the 600w 4 12VHPWR cable from Corsair to plug in the GPU directly, connecting it to two PCIe slots in the PSU.\nI've ordered this cable but wanted to quadruple check before I destroy my GPU;\n\nIs this solution recommend, or should I buy another PSU? (And if yes, which? I'm using a Lian Li Lancool 216)",
        "num_comments": 11,
        "comments": [
            "Found this kind of sad really.\n\n\"The 4080 Super requires three PCI-e power connectors be hooked into that adapter to run, even though the maximum power draw is rated for 320 watts (the RTX 3080 only needed two). The pins and thin wires that comprise the adapter are more fragile than last generation because they need to deliver more power over a smaller area, so bending the adapter’s cable at a sharp angle isn’t recommended. Here’s hoping that Nvidia changes the power standard yet again next generation to something more consumer-friendly, or at least moves the connector to the rear of the GPU.\"",
            "As long as it’s the correct cable for the PSU you have then you’re fine.  Can’t just be any Corsair cable, needs be to specific for your psu model.",
            "Yes, as long as you order the type 4  12VHPWR  cable  for the RMx , it will be fine.",
            "The RM850x has 5 connectors for CPU/PCIe. Even if you were to use individual cables you should have enough ports, even if using 2 4+4 EPS.\n\nCPU and PCIe cable ARE NOT THE SAME connectors on a motherboard/graphics card, only on PSU side they both use a 8-pin Type-4.\n\nRegardless, the [https://www.corsair.com/us/en/p/pc-components-accessories/cp-8920284/600w-pcie-5-0-12vhpwr-type-4-psu-power-cable-cp-8920284](https://www.corsair.com/us/en/p/pc-components-accessories/cp-8920284/600w-pcie-5-0-12vhpwr-type-4-psu-power-cable-cp-8920284) is available and it uses two 8-pin Type-4 ports.",
            "Just use adapter  as it says here but better look for some 90 degrees one like this: https://store.cablemod.com/product/cablemod-basics-c-series-12vhpwr-90-degree-pci-e-cable-for-corsair/",
            "You have a type 4 Corsair PSU rated at 850 watts so this cable should be fine for the RTX 4080 super so long as it is the Corsair cable from the Corsair website.",
            "So you could run a 3080 super with a 350 watt max power draw on your current PSU, but can't run  4080 super with a 320 watt max current draw because of the Nvidia's cable form factor.\n\nWhy are we going backwards?",
            "It's a type 4 cable. My PSU is also type 4. Is that what you mean? (Sorry it's my first time building)",
            "lol. Cablemod has a class action going from all the 4090s their plugs melted into voiding the warranty.",
            "Yes, so what you did will work"
        ]
    },
    "Waking up computer from sleep causes ICue to not detect vengence rgb ram": {
        "title": "Waking up computer from sleep causes ICue to not detect vengence rgb ram",
        "score": 2,
        "url": "https://www.reddit.com/r/Corsair/comments/1dr67uf/waking_up_computer_from_sleep_causes_icue_to_not/",
        "content": "Whenever I wake my computer up from sleep. The ram is uncontrollable and the lighting is laggy. Sometimes I get the red triangle next to the ram. \n\nI tried turning off xmp but its still the same. My kit is also a XMP enabled kit for intel\n\nAnother instance of this is that i close iCue, put computer to sleep, then wake computer. When I restart icue after waking up the ram is not even displayed at all. Im using a z790 gigabyte board and I dont have gigabyte control center installed.",
        "num_comments": 0,
        "comments": []
    }
}