{
    "CozyGamers \"What are you playing and what do you think about it?\" Wednesday Weekly Thread": {
        "title": "CozyGamers \"What are you playing and what do you think about it?\" Wednesday Weekly Thread",
        "score": 5,
        "url": "https://www.reddit.com/r/CozyGamers/comments/1dopile/cozygamers_what_are_you_playing_and_what_do_you/",
        "content": "Please use this thread to discuss whatever \\*\\*cozy\\*\\* games you've been playing lately and give us some positive or negative feedback!\n\nTo bold a game name so it's easy to find: remove the slashes: \\\\\\*\\\\\\*bold\\\\\\*\\\\\\*. \n\nPlease make sure to use spoiler tags if you're posting game story details (no matter how old or new the game is). \n\nTry out the different sorting options (new, hot, etc.) to make sure you're catching all the posts!  \n\nLink to Previous Wednesday Weekly Threads: \\[Previous CozyGamers Wednesday Weekly Threads\\](https://www.reddit.com/r/CozyGamers/search/?q=author%3Aautomoderator+Wednesday&include\\_over\\_18=on&restrict\\_sr=on&t=all&sort=new)",
        "num_comments": 23,
        "comments": [
            "I'm playing **Tchia**! I went in without many expectations and it completely blew me away. There's so much to do! It can be overwhelming when it keeps throwing new activities at you, but I'm just trying to let it all wash over me, and it's been amazing. There's so much love and care in it -- custom animations for EVERY cutscene is bonkers, for example -- and it's actually really lovely to get to experience the life and culture of people I don't know much about (it's set in New Caledonia, off the coast of Australia). I'm so happy!\n\nNext is **Everafter Falls** 👀",
            "Just started playing **Mineko's Night Market**. Loving the art style and writing, but it's glitchy and the gameplay so far is a little dull. I think it would have been better as a more traditional adventure game. But I'm interested enough in the story right now to keep me going.",
            "I’m playing **Moonstone Island**. I love it! My dueling skills were extremely weak in the beginning but I realized the problem. My hands were moving faster than my brain and slamming down a card before I could think about it lol. So progress is finally happening. \n\nMy farm is pretty much being ignored for now. Which is a shame since this is the first farming game I’ve played with sprinkler systems. Very convenient. \n\nI’m still playing **Lego Star Wars: The Skywalker Saga** too. Finally decided to actually play the story instead of running around collecting the goodie’s. All this time and I’m still on episode 2. Luke isn’t even a twinkle in his parent’s eyes yet..",
            "Moonstone Island - It’s everything I wished Stardew Valley could be. In game tutorial and quest objectives that guide you through gameplay? Check. Slay the spire like combat? Check. Good story? Check. 10/10.",
            "I got **Times & Galaxy** last weekend. I’m loving it! So fun to play curled up with a cup of coffee. I love the graphics and the concept. The ability to create the articles is fun!\n\nI’m also working on playing games that I got and then gave up on. So, I’m trying **Harvestella** again. I really hope I love it this time. I’ve put\na coupe hours into it and I’m starting to get more into it.",
            "I am still playing and loving Yonder! I play for 45 minutes in the morning as I ride an exercise bike. I've been playing every day since early May and I have a lot left to explore. The time flies!!",
            "I've been playing **Cloudpunk**. Maneuvering vehicles in games has never been my forte and this one is no exception. 😅\n\nI love the environment but am not sure how I feel about the gameplay and story. I like it enough to finish at least. I think the developer's upcoming **Nivalis** game might be more my thing.",
            "Moonstone Island and I’m disappointed.",
            "Still playing Harvest Moon Island of Happiness. And finally, my daughter is able to crawl and my wife Lanna even has new flavor text. Also, Elliot and Julia returned with their new child. It took five in game years but it was worth it. I feel really enthusiastic  after the game was kind of getting repetitive. Just need to get Sabrina with Vaughn and Natalie with Pierre next summer.",
            "Still enjoying **Palia** on the other side of my recuperation, Switch-port jankiness and all. I think it will make a decent ongoing \"dip into for a while alongside other games\" title for me.\n\nUnfortunately, I kind of bounced off **Strange Horticulture**, which surprised me; I like puzzles, plants, and gothic vibes, so you'd think I'd be the prime target. But I can't seem to follow the plot for some reason, and the music keeps bumming me out. 😅 Definitely a Me Problem."
        ]
    },
    "Steam Sale Megathread! ": {
        "title": "Steam Sale Megathread! ",
        "score": 116,
        "url": "https://www.reddit.com/r/CozyGamers/comments/1dpp8ze/steam_sale_megathread/",
        "content": "Any Steam sale discussions should be posted here. Feel free to ask questions, post deals, etc. \n\nBefore you buy: Steam is not always the cheapest, even during a sale. Check www.isthereanydeal.com for other legit code websites. The only issue is you can't refund a code if you don't buy it from Steam so do your research. Steam does have a generous return policy if you are on the fence. \n\nMost games going on sale have been mentioned here plenty of times so search the sub for posts ad most of your questions will most likely have been answered. \n\nMost importantly: it's okay if you can't buy everything you want now! I know there can be a lot of stress with wanting to buy a lot, even if it's outside of our means (I know I've done it). But the games aren't going anywhere and there are sales all the time. Take care of yourself! 💜🌸\n\nI turned off my reply notifications so my phone isn't blowing up like Gandalf's fireworks but if you need me, send me a message or tag me. ",
        "num_comments": 223,
        "comments": [
            "Oh I might finally get Sun Haven. 50% off",
            "Like every Steam sale, there are things I'm very mildly interested in for 90% off and all the stuff I'm really interested in is 30% off. Which is a good deal if I'm going to buy it soon anyway, but not so much if I don't expect I'll get around to it for another year. \n\nSo the only thing I'm buying for sure so far is American Truck Simulator I guess! There are also a bunch of visual novels under $10 that I'll probably snatch up. Heavily debating whether or not to buy Persona 3 because I haven't played a real action game in like 3 years but I kind of have the Persona itch. But I tried playing the PS2 and PSP versions years ago but the school parts didn't feel nearly as cozy as 4 & 5 did. :( I also never did play Royal so that's an option too I guess.",
            "Starting my cozy gamer journey! I started playing Stardew on my old iPhone years ago and loved it but lost all my progress when I switched to a Google Pixel. Now that I have a decent laptop, I will be starting up again <3\n\nhttps://preview.redd.it/xkyxoozkd79d1.png?width=830&format=png&auto=webp&s=86634206192b279dcce369b319f7c08c17980517",
            "You can also use [SteamDB](https://steamdb.info/sales/) for a better searchable list of the Steam sales :)",
            "still a newbie to cozy games & i might double-dip! here's my cart so far:\n\n* cozy grove\n* dystopika\n* graveyard keeper\n* touhou mystia’s izakaya\n* valheim (most likely not considered cozy, just buying this so my bf & i have a new co-op game to play together)\n\neta: requested a refund for dystopika b/c it was...not what i was expecting :(",
            "My cart is sitting at $168 oh gosh \nI feel like I have too many farming games in here. What do you guys think should get the chopping block? \n\nIn my cart: \n\n- coral island\n- growing up\n- moonstone island\n- little known galaxy \n- we love katamari reroll + royal reverie \n- I was a teenage exocolonist \n- two point hospital \n- Shin chan: Me and the Professor on Summer Vacation The Endless Seven-Day Journey\n- Venba \n- sun haven \n- The Cosmic Wheel Sisterhood\n- dordogne \n- roots of pacha",
            "I might have to cave and just get Roots of Patcha......",
            "Very excited, even though I have a huge backlog 🙈🙈 have gotten very into steam gaming this year after usually just playing The Sims 2 or Stardew for years!",
            "Is anyone else's wishlist down? Nothing loads when I go to it.",
            "Yonder is $2.49 right now! It wasn’t even something I was considering until I saw that price! Snatched it up immediately."
        ]
    },
    "Got my Steam Deck (OLED) delivered today! I’m so excited.": {
        "title": "Got my Steam Deck (OLED) delivered today! I’m so excited.",
        "score": 245,
        "url": "https://i.redd.it/4kr51w1r9d9d1.jpeg",
        "content": "So far I got:\n1. Dinkum\n2. Go-Go Town\n3. Stray\n4. Inspector Waffles\nI’m debating Cozy Caravan but not too sure how good it is.\nI’m also looking for some cozy relaxing games - preferably life/farming Sims or pet simulators (also love adventure games). Preferably games that aren’t available on the Nintendo Switch as I have a pretty big collection over there.",
        "num_comments": 38,
        "comments": [
            "Please tell me everything about your precious little gremlin.",
            "Please give your cat a kiss for me 🥺",
            "I too looked at cozy caravan, but I saw something about it wasn't fully translated yet? I don't know, but that'd be a bummer if true. \n\nSide note: Lenny is amazing while also looking like he's going to destroy us all.",
            "Hiiiii Lenny!!!! Cutie pie!!\n\n  \nCongrats on the Steam Deck!",
            "Pretty sure your cat sits on the arm of a villain's chair?",
            "Huh, you don't look very excited. You look pretty pissed off 😰",
            "OMG What is your cat's name? He looks like a gentleman. He needs a little monocle, suit, and cane! \n\n  \nAlso, Sun Haven is great! It's a farm sim with magic!",
            "My first thought was “OP is a cat.” 😂\n\nIf you like Inspector Waffles, maybe try Duck Detective.",
            "\"It would be a real shame if that Steam Deck accidentally fell off a shelf somewhere.\"",
            "Nice pick ups! Hope you enjoy and thats a very cute cat, anytime i start to game my cat jumps on me so be prepared  XD"
        ]
    },
    "Steamdeck is amazing": {
        "title": "Steamdeck is amazing",
        "score": 151,
        "url": "https://i.redd.it/ebqgjfozsd9d1.jpeg",
        "content": "Steamdeck is most definitely for the cozy gamers!\n\nI have never enjoyed gaming more than I have the past month.\n\n",
        "num_comments": 44,
        "comments": [
            "https://preview.redd.it/53c4uvwjud9d1.jpeg?width=3024&format=pjpg&auto=webp&s=1e62df2d42218ad37d91c5af63408144feb8ee28\n\nOh yea!!! Steamdeck is where it is at!!!",
            "My husband bought me one for Christmas last year and prior I played on my switch. I haven’t touched my switch since I got mine. I absolutely love it!",
            "On my wishlist🕯️... by the way, with that case it looks even better",
            "Do your PC games you purchased work like … where you were?",
            "I have a geniune question Im still debating whether steamdeck or the Rog Ally I was thinking Rog Ally because it's not only steam centered and you can also access Epic store and Xbox but I'm hearing lots of positive reviews for the steam on the steamdeck do you only have access to Steam only or is it like Rog that have access to Xbox and Epic and other platforms?",
            "Aggred! It’s one purchase I absolutely do NOT regret! I love being able to play most all my PC games on the go or at work",
            "Definitely something to go on my wish list! Tired of playing on my laptop or being too tired to play",
            "I have one and I rarely touch mine 😅",
            "What type of skin did you put on your steam deck?",
            "How’d you get the skin on so smoothly?? Mine has these annoying creases on the corners but I worked on it for like an hour before I gave up on perfection."
        ]
    },
    "Steam Games Giveaway": {
        "title": "Steam Games Giveaway",
        "score": 127,
        "url": "https://www.reddit.com/r/CozyGamers/comments/1dquesd/steam_games_giveaway/",
        "content": "Hello! I've been inspired by Infamous_Mango_1907 and would like to gift some cozy Steam games to this great community!\n\n\nUPDATE: This giveaway has ended, I reached out to all the winners! Thanks to everyone for posting awesome recommendations. The top three recommendations were Stardew Valley, Dave The Diver and Wylde Flowers. I will be doing another giveaway soon! Thanks for being a great community \n\n\nTo enter:\n1. Select number from 1-200\n2. Provide steam user \n3. Recommend a cozy game you enjoy\n\nI will be selecting three winners in the next six hours using RNG. Winners can select any cozy Steam game $20 or under. Good luck!!\n\nEdit: I will now be selecting three winners, happy summer sale! ",
        "num_comments": 162,
        "comments": [
            "Not entering the giveaway. Just wanted to pop in and say that you're doing a really kind thing and you're really going to make someone's day. Keep being awesome 💙",
            "1.127\n2.tetrodotoxin6\n3.Wylde Flowers! I got recently into it after ignoring the praise for ages and grew to like it quite a bit",
            "97\n\nLiPat\n\nI recommend Shady Part Of Me, I think this game is underrated\n\nThanks!<3",
            "Thank you very much!\n\nNumber 28\nStickybubbles28 \nI was a Teenage Exocolonist - I couldn't stop thinking about it the minute I finished it and immediately did another playthrough! Excellent narrative game!",
            "17\nKimplovely2\nSunhaven",
            "1. 59\n\n2. AriaPriva\n\n3. I’ve been really enjoying the demo for Galaxy Burger!",
            "152\nCynicBlaze\nTiny Echo",
            "1. 147\n2. elir19\n3. I really recommend Spiritfarer, I just finished it. It's a beautiful and heartbreaking experience💔",
            "This is so sweet of you! Ahhhh\n\n42  \nChaosLove  \nI really love Littlewood <3",
            "157 bookwbng5 I will forever recommend Wylde Flowers, I slept on it waaaaay too long"
        ]
    }
}