{
    "Weekly Newcomer Questions, Support, Vents & Victories": {
        "title": "Weekly Newcomer Questions, Support, Vents & Victories",
        "score": 1,
        "url": "https://www.reddit.com/r/CPTSD/comments/1dqf6fg/weekly_newcomer_questions_support_vents_victories/",
        "content": "As the community continues to grow and attract people who are just figuring this all out, we've decided to change the weekly thread focus to be more open and encourage newcomer questions and support. Please use this thread if you are seeking support or have newcomer questions. Want to see if your post topic has been discussed here? Type \"subreddit:cptsd\" after a search term in the search bar (ex. \"friendships subreddit:cptsd\"). Here are some common newcomer questions:\n\n* [DAE struggle with expressing anger?](https://www.reddit.com/r/CPTSD/search/?q=anger&restrict_sr=1)\n* DAE struggle with [anxiety](https://www.reddit.com/r/CPTSD/search/?q=anxiety&restrict_sr=1)/ [depression](https://www.reddit.com/r/CPTSD/search/?q=depression&restrict_sr=1)?\n* [What are emotional flashbacks? How do I deal with them?](https://www.reddit.com/r/CPTSD/search/?q=flashbacks&restrict_sr=1)\n* [How do I set boundaries?](https://www.reddit.com/r/CPTSD/search/?q=boundaries&restrict_sr=1)\n* Was this (situation) abuse? [Was it bad enough to be considered trauma?](https://www.reddit.com/r/CPTSD/search/?q=bad%20enough&restrict_sr=1)\n* [What books do you recommend?](https://www.reddit.com/r/CPTSD/search/?q=book%20recommendation&restrict_sr=1)\n* [What type of therapy worked best for you?](https://www.reddit.com/r/CPTSD/search/?q=what%20type%20of%20therapy&restrict_sr=1)\n* [How to deal with relationship struggles](https://www.reddit.com/r/CPTSD/search/?q=relationships&restrict_sr=1)/ anxiety/ fear of intimacy?\n\nIf you are new to [r/CPTSD](https://www.reddit.com/r/CPTSD/): Please check out the rules below, and for our mobile users who can't access the sidebar, more resources are located below the rules. These can also be accessed from the auto mod message that greets any post.\n\n**Keep the rules in mind when you post & comment:**\n\n1. [This is a peer support community. Be a supportive peer.](https://www.reddit.com/r/CPTSD/wiki/peer2peersupportguide)\n2. **Don’t ask for diagnosis, don’t diagnose others:** *Respect that you may not have all of OPs details and even a trained, trauma informed care provider cannot diagnose over the internet. So don't. Assume the context of OP as a CPTSD survivor or supportive partner of a CPTSD survivor.*\n3. No [hate speech](https://en.wikipedia.org/wiki/Hate_speech)\n4. Please be mindful about triggering content. Avoid graphic thread titles, and use \\[Trigger Warning\\], NSFW and/or the spoiler tag whenever appropriate.\n5. No [RaisedByNarcissists lingo](https://www.reddit.com/r/raisedbynarcissists/wiki/acronyms): A lot of folks come from the RBN support community. A lot of us do not. To keep the sub inclusive to CPTSD newcomers and survivors of different backgrounds, use common language synonyms for RBN acronyms. [There are some exceptions.](https://www.reddit.com/r/CPTSD/wiki/subrules#wiki_rbn_lingo)\n6. All content must be CPTSD related: Our lives, our struggles, and our victories with CPTSD.\n7. No Self-Promotion: Don't sell stuff or recruit for studies and projects without explicit mod approval. This thread is an exception; in the Vents & Victories thread, you may self-promote blogs, videos, and other media you created.\n\n**BIPOC**\n\nWe recognize that healing communities such as [r/CPTSD](https://old.reddit.com/r/CPTSD) are not exempt from the insidious impacts of racism, whether overt or covert (for example, invalidating, minimizing, or microaggressive comments made by those with good intentions). In these cases, we encourage users to report the comments as Rule #3 violations. Because of the subreddit's high profile and open nature, this problem will continue to be with us, and we therefore can only promise a \"safe-ish\" environment for BIPOC. Racial trauma will always be on topic here at /r/CPTSD, but BIPOC users that want a more closed space can make use of /r/cptsd_bipoc. *Thank you to the mod team at* /r/cptsd_bipoc *for helping us write this verbiage.*\n\n**Additional Newcomer Resources**\n\n* [Crisis Resources](https://www.reddit.com/r/CPTSD/wiki/index#wiki_crisis_support_resources)\n* [Emotional Flashback 1st Aid Kit](https://www.reddit.com/r/CPTSD/wiki/firstaidkit)\n* [Grounding & Containment Tools](https://www.reddit.com/r/CPTSD/wiki/groundingandcontainment)\n* [An FAQ Guide to CPTSD](https://www.reddit.com/r/CPTSD/wiki/faq)\n* [Our Library of Books, Media, and Healing Resources for CPTSD](https://www.reddit.com/r/CPTSD/wiki/thelibrary)\n* [Common Myths About CPTSD](https://www.reddit.com/r/CPTSD/wiki/cptsdmythbuster)\n* [The 5-Steps to Find a Therapist Plan](https://www.reddit.com/r/CPTSD/wiki/quickandeasytherapisthunt)\n* The [CPTSD Wiki Project Index](https://www.reddit.com/r/CPTSD/wiki/quickandeasytherapisthunt), while currently under construction, has all of the above information and regular updates on many additional topics you may find helpful in your healing journey",
        "num_comments": 1,
        "comments": [
            "Hello and Welcome to /r/CPTSD! If you are in immediate danger or crisis, please contact your local [emergency services](https://en.wikipedia.org/wiki/List_of_emergency_telephone_numbers), or use our list of [crisis resources](https://old.reddit.com/r/CPTSD/wiki/index#wiki_crisis_support_resources). For CPTSD Specific Resources & Support, check out the [wiki](https://www.reddit.com/r/CPTSD/wiki/index). For those posting or replying, please view the [etiquette guidelines](https://www.reddit.com/r/CPTSD/wiki/peer2peersupportguide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CPTSD) if you have any questions or concerns.*"
        ]
    },
    "P*rn is gross and a trigger. ": {
        "title": "P*rn is gross and a trigger. ",
        "score": 273,
        "url": "https://www.reddit.com/r/CPTSD/comments/1dr2mk8/prn_is_gross_and_a_trigger/",
        "content": "That's all. Just, whenever I see it. I get cringed. Feel gross. Ugly. Putrid. Never wanna see that stuff again. And then I look at some for a minute out of curiosity. And. Triggered. Like right now. ",
        "num_comments": 58,
        "comments": [
            "I was forced to watch it as a child. It causes a lot of stress and a bad trauma response from me. Total internal panic.",
            "I can’t stand sex scenes, implied or explicit- I feel sick and flooded with emotions and memories. I can’t and my tolerance seems to have gotten lower with age and therapy.",
            "Me too. Got shit on for setting it as a deal breaker for next relationship. Apparently no one is responsible for my triggers and I'm crazy",
            "I am severely anti-porn because it has high ties to trafficking and is extremely hard to verify consent even on sites that claim to verify users. I know because I was trafficked and separately coerced to do porn, being convinced I wanted to do it.\n\nAs for sex scenes, since someone here mentioned it, I argue showing them in things that you wouldn't obviously expect them in is just unconsensual in nature and that too many rich people likely enjoy that factor.",
            "Same. I was raped and violated as a child and it was recorded then uploaded. It does make me angry, but I hate people who go to sites like pornhub, because I know for a fact that they have videos of people's actual rapes and abuse on there and if someone values their spank bank more than they value the safety of the people they're watching, I hate them.",
            "I turned to it as an addiction when I was in my early teens, I wasn't ready for it, I abused myself daily and no one told me to stop so naturally I thought no one knew but a sense of paranoia come with this kind of secret and a sense of social distancing as well of course. Because it was still an addiction and addiction occurs in place of both healthy relationships and healthy coping habits. So I fed the bad or poor habit and it basically means I cant go a day without actively being triggered because what I see in the real world or even through entertainment ... I would basically try my best to replicate it with adult content. It's very unfortunate and my cptsd has not made it any easier to cope with better habits... I'm well aware I get no benefits but I'm so alone and full of shame to begin with and I can't seem to undo the shame of my entire being or history or place in society enough to shake off this habit. I've no idea what to do.",
            "It is for me, too. Can't stand the stuff. I also cant stand \"breastaurants\". I could talk forever about it. I hate there's a \"demand\" and the \"supply\" rarely truly have autonomy and true power in the situation. Idk. Then another side of me realizes other sell their bodies in other ways even if its a 40 hours 9 to 5. But is it truly consent if it's the lesser of many \"evil\" decisions some need to make to survive. Big sigh.",
            "There's nothing wrong with the sex acts in of themselves due to being human sexuality and thus natural when it comes to consenting adults. The thing that I absolutely cannot tolerate about porn is the capitalistic attitudes about it. Capitalism turns everyone and everything into a commodity and what it has done to human sexuality is just sickening and disgusting. You won't meet genuine people in that filthy business.",
            "Porn has hurt me within relationships more times than I can count. Can’t even look at it anymore without being triggered. Dating porn addicts really ruins you lol",
            "Yeah same. I was coerced into taking nude pictures when I was 12 and were uploaded online. It pains me to know my pics are still out there on some pedophile(s) hard drive. I know it's a trauma response but I'll never be okay with people giving masturbation material to predators."
        ]
    },
    "Hypervigilance vs. “I’m safe now.”": {
        "title": "Hypervigilance vs. “I’m safe now.”",
        "score": 33,
        "url": "https://www.reddit.com/r/CPTSD/comments/1draoh4/hypervigilance_vs_im_safe_now/",
        "content": "When I read Pete Walker’s steps for dealing with a trigger, I have a hard time telling myself and believing “I’m safe now, in the present.” It’s like, yeah, but getting triggered feels pretty unsafe, and it’s super disruptive, so how do I relax when I could get triggered at any moment? (And of course: being hypervigilant like that makes me more prone to being triggered.) DAE struggle with this? Anyone have success at believing they’re safe?",
        "num_comments": 19,
        "comments": [
            "Thinking of the walls around me and how fortified they are. Even if just as a metaphor for your own mental walls. Thinking of the chances of danger occurring again.",
            "I'm feeling pretty safe these days, but it's not a black and white thing. The point of saying “I’m safe now, in the present.” is to remind myself that the feelings don't fit the situation that I'm being triggered by. The feelings fit with a much more dangerous seeming situation than the one I'm dealing with in the present. That's almost always the case for my flashbacks. I think that sometimes they are trying to warn me of some danger that I may not be seeing.\n\nIf you are in some real danger and telling yourself that you're not, then you may need to take some action to make yourself safer.",
            "EMDR was the only thing that helped me break this cycle. I highly recommend it.",
            "I feel like it's always 50/50 for me. Sometimes it works like a charm, sometimes it doesn't work at all. Sometimes it only works for a moment. I think it might depend on the trigger itself, as some of them are more impactful than others.\n\nIf you're in a position to do so, what I recommend is having someone tell that you're safe in the present /to/ you rather than telling this to yourself. A partner or a friend. I find that in certain dire situations I can only believe it and benefit from it when I hear these words said at me by a person who is calm and rational, I believe them because they're not undergoing emotions distorting their reality like I am, so they must be right.",
            "What’s helped me is grounding. I carry a relaxing essential oil with me all the time, and focus on what can I see, smell, touch, and hear. My fibromyalgia flares when I’m triggered, and I have to repeat with slow breaths that I’m safe now. The breaths are inhale for 6, hold for 7, exhale for 8. Exhales always need to he the longest. Sometimes it takes a lot longer to feel okay, but I allow for the feelings to come versus letting them build up. Hope that helps you!",
            "Touching walls or the ground seem to help me regulate when I’m in that state. Does it work all the time,No. Does it make a difference when it does work YES.",
            "I regularly train this when I actually feel safe. Makes it much easier to use when I dont feel safe.",
            "This is helpful. Reminding myself that I’m safe now, but not demanding that I believe it instantly. I think I can get kind of all-or-nothing with those instructions, believing that I should be able to just feel 100% better upon telling myself everything’s okay. Thanks.",
            "I’m in the resourcing/stabilization phase of EMDR now. Really glad to hear this.",
            "You’re right; it does help when someone else tells me it’s my trauma talking. I have a few people who can do that for me."
        ]
    },
    "What medication has worked for you with the least side effects": {
        "title": "What medication has worked for you with the least side effects",
        "score": 35,
        "url": "https://www.reddit.com/r/CPTSD/comments/1dr90f2/what_medication_has_worked_for_you_with_the_least/",
        "content": "I have reached the end of the road. I have tried everything and nothing has worked. At this point in life, I just want to numb my emotions and quiet my anxiety. Deep down, I know I should probably be medicated, however, every medication I have tried has given me intolerable side effects. I also have a physical health condition and I am worried about anti-anxiety or antidepressant medication impacting upon that (I have a jpouch, if anyone knows what that is... I am also on immunotherapy).\n\nI have significant anxiety/hypervigilence and underlying feelings of despair.. Basically, just very intense emotions. I want something to mellow me out.\n\nI have tried Zoloft, Lexapro, Prozac, Effexor, Cymbalta, Endep, Mirtazapine, Seroquel, Pristiq, and some others that I cannot recall their names... I am prone to insomnia so I find that a lot of these medications simply prevent me from sleeping. Conversely, i found Mirtazapine made me feel extremely fatigued, and I already feel fatigued enough from my medical condition/immunotherapy. ",
        "num_comments": 92,
        "comments": [
            "I’ve had great success with Buspar for anxiety and Wellbutrin for depression. Just a heads up Wellbutrin can make anxiety and insomnia worse the first couple of weeks, that did pass for me. You mentioned having a j pouch. As someone with a permanent ostomy I recommend short acting medication only and nothing that is time released since that operates through the colon. It’s not very effective for people with plumbing like us. Best of luck!",
            "Lamotrigine (aka Lamictal) has been very helpful for me for emotion dysregulation and basically making things feel less heightened. It has taken the edge off things for me.",
            "Have you tried a beta blocker?",
            "Bupropion works well now. Used to be on trintellix + bupropion combo and it worked well too. My doc is just minimalist, so he got me off of trin.\n\nIn the past, Trazodone worked wonders for my depression. But man, was I sleepy as fuck...",
            "Oh boy. I feel you, hun. I get really long, crazy high manic episodes. The sleep deprivation is no joke. I also have a serious problem with severe reactions to medications. You wouldn’t believe some of the insane stuff I’ve tried to get sleep. I even had a friend make me GHB out of paint thinner. If you’re looking to avoid benzos, I’d suggest Hydroxyzine. It helped until I developed formication. Indica strains of marijuana, diphenhydramine, magnesium, melatonin and kratom have also helped me chill out.",
            "After 20 years of trying all of the drug cocktails mentioned here, I had a psychiatrist diagnose me with ADHD instead of anxiety or depression, and my life has dramatically improved. I now take Vyvanse in the morning and Trazodone at night to help me get to sleep. The diagnosis is helping therapy as well because I’m in a much better position to understand my past and why my family did the things they did. It’s worth looking into.",
            "meds never really helped me, emotional regulation, vagus nerve stimulation and DBT helped loads more. instant calmed me.  no side effects, free and easy to use.",
            "Quetiapine and lithium are the two I am currently on which I find stabilise me adequately with minimal negative side effects. The Quetiapine also helps me fall asleep (I take it at night) and both aid with stabilising my moods and reducing the severity of my episodes. Note, I am diagnosed with multiple mental health conditions including both (c)PTSD and bi polar 1.",
            "I feel this. I always get the worst side effect. Mirtazipine made me gain weight and feel like I couldn’t fully wake up. All other SSRIs cause insomnia. Currently on Amitriptyline which I’ve been on for a few weeks. So far, so good and a lower dose helps me sleep. I also take Propanolol for anxiety attacks.",
            "Weed. I'm also on the minimum dose of gabapentin and refuse to let them elevate it.\n\nEdit: OH I also recently severely reduced my caffeine and that helped a lot, stomach issues and anxiety and autism sensory issues"
        ]
    },
    "Why are normal people so ignorant to childhood trauma survivors? ": {
        "title": "Why are normal people so ignorant to childhood trauma survivors? ",
        "score": 137,
        "url": "https://www.reddit.com/r/CPTSD/comments/1dr0ry5/why_are_normal_people_so_ignorant_to_childhood/",
        "content": "Ya know it gets so annoying when you constantly hear from normal people , \"You're so brave for being on your own\" \"How do you handle being without family\" etc. Well I was sex trafficked and abused by my entire family 🤪 so I kinda had to run away. People are just so annoying and this is why I stay away from people and seclude myself. I don't want to hear any rainbow comments. I'm so sick of people. ",
        "num_comments": 23,
        "comments": [
            "Because they haven't been traumatized and are on the outside looking in. And misunderstanding most of it.",
            "I think a big portion of it is that people A) typically don't know how to respond to trauma in someone else's life and B) have been conditioned that you need to say something to 'fix' other people's pain (or at least soothe their experience of your pain). As a result, you get responses like you listed, or people minimize the trauma (\"sometimes parents don't do the best thing, but they still love you\" or some crap like that) to try to fix the issue they see in the situation (that you cut off your family).\n\nIt sucks that, on top of dealing with the aftereffects of your trauma, most normal people aren't particularly safe.",
            "Rainbow comments—that’s the perfect description. People are dumbasses who just say whatever makes them feel okay. Not you. Them.",
            "When people will say \"I don't know how you survived, I could never...\" or similar, and don't drop it when I try and brush it off, my fave response is \"So are you saying I should have killed myself?\"\n\nIt's extreme but I always give people a chance to knock that stuff off. I don't trauma dump on people but it comes up in anecdotes sometimes, nothing heavy, just stories of my life where incidentally I was a teenager living on my own or just not having any contact with family. When they start making the 🥺 face or \"you poor thing\" I will say \"nah, I'm good, therapy and all that\" to nip it in the bud. But if they don't stop, especially if it goes into the whole \"you are so strong and brave\" thing, a well placed \"well I guess the alternative is blowing my brains out\" really shuts it down.",
            "It takes a lot of work. I don't have any sex abuse in my trauma history. I meet a lot of people here and elsewhere that do. It's difficult to learn to be understanding for people that suffered different traumas then me. But then I know once I give people my story they are also pretty shocked. It's difficult to learn to be co-compassionate and co-understanding. Such a wide range of trauma and abuse in this world.",
            "the material is a total bummer so unless you have a similar issue, who wants to approach that?  normies are uncomfortable & our culture dismisses people's hurts.",
            "Why should they understand it?",
            "Ignorance, that's pretty much it. Like how we may not be able to relate to what it feels like to be a child in Gaza (for example) no matter how hard we try to visualize and \\*feel\\* it, we can't. Thats the same with childhood trauma and abuse. 18 years of neglect, emotional, and physical abuse is a story that only WE can tell and we will know. We are the only ones who know what it feels like, the racing thoughts, etc...",
            "What's normal.  People who don't have any experience with abuse are ignorant.  Do you want to carry the burden of educating them while you heal?  That leaves you with damaged people.  \n\nMy focus is formality and establishing boundaries.  You have to deal with people.  There is a social system out there you would benefit from functioning in.  It's really painful. Giving people, damaged or not, an appropriate way to behave is like being alone and it keeps you safe.",
            "Those statements sound like they were empathizing. They cannot read your mind.\n\nWhat would you like to hear instead?"
        ]
    }
}