{
    "We are banning all software related piracy support. Starting from today, r/CrackSupport is only helping video game related support": {
        "title": "We are banning all software related piracy support. Starting from today, r/CrackSupport is only helping video game related support",
        "score": 791,
        "url": "https://www.reddit.com/r/CrackSupport/comments/gtfj53/we_are_banning_all_software_related_piracy/",
        "content": "Hello redditors,\n\nWe have received numerous copyright strikes for the past few weeks. All of them are related to cracked software support (Adobe, FL studio, and other such programs). Few of the examples: \n\n[Example 1](https://i.imgur.com/ONDqFia.png)\n[Example 2](https://i.imgur.com/WpcJeBS.png)\n[Example 3](https://i.imgur.com/v1I0lB7.png)\n\nTo ensure this subreddit continues to operate and not get banned by Reddit admins, we are shutting down all the support about software-related content. You can only ask for content related to video games. All of the future questions about software piracy will be deleted.\n\nI am sorry that this happened, but such measures have to be taken to ensure this subreddit continues to operate. You can create another subreddit related to software piracy, though I would not advise, as Reddit is more likely to take down content related to software piracy than video game piracy. \n\nAll of the previous questions relating to software piracy will be deleted to avoid more copyright strikes.",
        "num_comments": 188,
        "comments": [
            "that sucks. is there a seperate sub for software cracks? should we make one?",
            "I thought this was a sub to support my crack addiction.",
            "[removed]",
            "Since the helpful posts are deleted now. This message is for the future.\n\nI maybe or maybe not aware of where you can get Adobe softwares\nDo NOT message me for it.",
            "I've been looking for alternatives for well over a year now since Reddit has become more and more strict and I've got my eyes of a few potential places, Saidit included (https://saidit.net/s/CrackWatch/ as an example). Another alternative I've been thinking about is our own forum similar to cs.rin(without competing with them of course) where we can talk more freely but that one would require money to run so we'll think about if it's worth it.",
            "Weird how they don't consider video games piracy i guess the companies don't care that much.",
            "CRACK IS CRACK",
            "Fucking Fruity Loops.\n\nThought they would know better than to waste there time like this.",
            "isint this the whole point of cracksupport i mean change the name at least",
            "Where can we find an alternative solution for software related piracy support?"
        ]
    },
    "Worldbox crack support is no longer allowed in this subreddit": {
        "title": "Worldbox crack support is no longer allowed in this subreddit",
        "score": 63,
        "url": "https://www.reddit.com/r/CrackSupport/comments/10b6ey8/worldbox_crack_support_is_no_longer_allowed_in/",
        "content": "Hello,\n\nover the past few months we have gained multiple DMCA violations from Worldbox posts and comments. One such example was recently made\n\nhttps://i.imgur.com/1CzQX7z.png\n\nTo keep the subreddit open, in addition to software, any support about the game Worldbox is no longer allowed. In the future, we may create a list containing forbidden games that are most likely to trigger DMCA takedowns.\n\nThank you for understanding",
        "num_comments": 60,
        "comments": [
            "You know, you should be allowed to at least TALK about cracking. Yes, free speech doesn't apply to privately owned services but still.\nPosting links is one thing, talking about it tho is a bit over doing it.\nI don't know ANYTHING about this game at all and from the little bit of knowledge I have gathered, this game hasn't even been fully cracked yet? I don't see any posts on CSRIN so I may be COMPLETELY wrong on this.",
            "There are a few crack discords, i wont put the link here since it would get you banned, but the only one i know of for sure is igg games supply, so its like a last resort tank the adware for game   \nI find it really pissy how the dev takes down pirated versions but refuses to give us a demo.",
            "u/NotIsaacClarke no way they're alive 7d old but still alive",
            "yeah world box devs are pretty serious i think they even where gonna take down sites like steamunlocked",
            "why",
            "can someone share it ? cant find it.",
            "use the custom search \n\n[Programmable Search Engine](https://cse.google.com/cse?cx=20c2a3e5f702049aa)",
            "[deleted]",
            "Sound alike obvious censorship peoppe can talk about whatever they want. Why wouldn’t the sub push back?",
            "Doughnuts thinking it's smart to constantly discuss piracy stuff on reddit ,ffs\n\nIt's why stuff gets noticed and dmca'd.\n\nMight as well wave a giant flag while screaming through a megaphone."
        ]
    },
    "[Question] need help, not sure whats wrong or if im doing it correctly!": {
        "title": "[Question] need help, not sure whats wrong or if im doing it correctly!",
        "score": 7,
        "url": "https://www.reddit.com/gallery/1dlsx0w",
        "content": "download the rune version of the new elden ring shadow of the erdtree. everything works and obviously if i wanna play online i always gotta download the onlinefix for the game (which i did) but when i launch game, i get this first pop up saying somethinb about inappropriate activity detected and puts me offline for the game, then get a second pop up saying something about the seamless mod? any ideas if onlinefix just doesnt work for the bootleg version of the game or am i just not doing something correctly? ",
        "num_comments": 1,
        "comments": [
            "Just play offline, its not like elden ring uses it much in a meaningful way"
        ]
    },
    "Glitch in elden ring dlc.": {
        "title": "Glitch in elden ring dlc.",
        "score": 2,
        "url": "https://www.reddit.com/r/CrackSupport/comments/1dlusu0/glitch_in_elden_ring_dlc/",
        "content": "Guys help needed.\n﻿I downloaded the game from torrent and got my old save file and was able to progress from there but I am not able to open map or discount from torrent. I don't know if it's a glitch or some problem with downloaded files.",
        "num_comments": 0,
        "comments": []
    },
    "Red Dead Redemption 2 Update from Fitgirl": {
        "title": "Red Dead Redemption 2 Update from Fitgirl",
        "score": 2,
        "url": "https://www.reddit.com/r/CrackSupport/comments/1dlty8y/red_dead_redemption_2_update_from_fitgirl/",
        "content": "I am on the 1311. build and I wanted to update to the 1491.50 build because it got some bug fixes and especially for the DLSS support, so is there a way to update without uninstalling the whole game, and thank you.",
        "num_comments": 0,
        "comments": []
    }
}