{
    "\"I don't like the way this looks\" and other bad reasons to make a post": {
        "title": "\"I don't like the way this looks\" and other bad reasons to make a post",
        "score": 3275,
        "url": "https://www.reddit.com/r/CrappyDesign/comments/xorqhz/i_dont_like_the_way_this_looks_and_other_bad/",
        "content": "#Once again we have to remind you of this this: \n\n**Something you think is ugly is not necessarily crappy design. Something you don't understand does not make the design of that item crappy design. Not every ramp you see is meant for wheelchair access. Not every item that puzzles you is bad design. Items which are installed badly or broken are not crappy design.**\n\nSo please refrain from  posting ugly fabrics, devices you haven't been able to figure out, random things that puzzle you and the like. *This is not a complete list and all submissions are subject to mod review.*\n\n\n**This past weekend we saw a rule breaking post with not only identifying information but phone numbers  and a comment section full of comments harassing the people pictured. This is unacceptable. Posts like this are not only against our rules but against reddit's site wide rules as well. All personal identifying information must be redacted. Comments sexualizing subjects of posts here will result in a  permanent ban.**",
        "num_comments": 97,
        "comments": [
            "Thank you for this! I really like this sub when it’s good and either genuinely funny or genuinely insightful. I’m glad work is being done to prevent it from becoming r/ “I’m a snob and I don’t like people expressing themselves in a non-harmful way”",
            ">**This past weekend we saw a rule breaking post with not only identifying information but phone numbers  and a comment section full of comments harassing the people pictured.**\n\nI cannot help but feel this message deserves a post on its own.",
            "I feel like you need to add, \"obvious crap installation isn't crappy design\".  I'm sick of the \"this bathroom stall door can't lock\" posts when it is obvious someone didn't know how to line up the latches correctly when they installed it.",
            "Also typos/misprints aren't crappy design, just mistakes",
            "You know what would be handy, is maybe a best-of list.  Like, a list of posts that you, the mod(s), feel best encapsulate the soul of this subreddit.  I personally think it might help given what a broad concept it’s covering.",
            "Good mods. Wishing you well.",
            "This sub can be so funny and interesting when the posts fit. But there is so much drivel. Like a post today that was just a label poorly translated into English.",
            "Please remove egregious violations... These are boring",
            "Waiting for a follow up post detailing the number of people that report this post for breaking crappy design rules!",
            "Form and function. Bad design may not be aesthetically pleasing but its function is in question"
        ]
    },
    "Duplicate lift buttons (one set is for emergency use)": {
        "title": "Duplicate lift buttons (one set is for emergency use)",
        "score": 554,
        "url": "https://i.redd.it/9ma4gxul0c9d1.jpeg",
        "content": "",
        "num_comments": 60,
        "comments": [
            "The building has a duplicate sets of floors, they are on fire.",
            "And to make it even crappier, the B and G buttons are mirrored in the duplicate button set.",
            "During a fire, the left side buttons are disabled while the right side ones continue working. You don’t need a key to use them, but you have to look into the camera and promise that you’re doing it for fire fighting purposes.\n/s",
            "Wonder why this elevator has a seperate set of buttons for firefighter operation. On most elevators, once you turn the key to fire mode, you just use the same buttons as the you would for normal operation.",
            "I pity the vision impaired",
            "Oh yeah this isn’t confusing at all. Crowded elevator, people reach out and pinch numbers hoping they get the correct floor, what happens if you hit the wrong side? Does it still work? Does it trigger the fire alarm?",
            "If I had to guess I’d say that the elevator has 2 openings and has duplicate buttons for a separate facing door.",
            "W-why would they do this?",
            "I wonder if it’s a convenience thing for firefighters; no key required but the buttons on the right side have to be held and override any other stop requests on other floors. \n\nStill confusing but the fact that the button goes out makes sure there’s no critical failure if an error is made.",
            "Gosh, the temptation to mash all of those buttons is bothering me."
        ]
    },
    "A restaurant in the city I live in. That's not what Thai scripture looks like.": {
        "title": "A restaurant in the city I live in. That's not what Thai scripture looks like.",
        "score": 1722,
        "url": "https://i.redd.it/i5087txud69d1.jpeg",
        "content": "",
        "num_comments": 145,
        "comments": [
            "\"so what should the logo be?\" - \"take some asian letter or something\"",
            "What I find ironic is the Chinese text (in the logo itself) says 'gathering of food'. That sounds way more thought out and poetic, befitting of a brand.\nInstead the English name is a bland (and misleading?) 'Thai House'. In an awful font, no less.\nI'm curious who the owners are. Perchance did they come up with the Chinese name first, then somehow settle on some vaguely appealing English name?",
            "At first glance, I thought it was a really abstract Bigfoot",
            "It kinda looks like bigfoot",
            "To be fair, the word isn’t “scripture” so there’s a lot to unpack here",
            "Google Translate suggests that the text is Chinese for \"Gathering of food\", though I suspect that the meaning is probably \"restaurant\".\n\nCould just be that there's a nice Chinese family that happens to run a Thai restaurant. People post signage in the languages and alphabets that they know and use (or expect their customers to know and use.) It's not like \"Thai House\" is written in Thai, either.",
            "It looks kind of like Bigfoot if you squint your eyes",
            "That's not how \"script\" is spelled",
            "I never thought I would see the city I was born in on /r/Crappydesign and/or Reddit for that matter. I basically lived at this restaurant in my youth. So good.\n\nSkövde in my heart.",
            "Thai House,  in the middle of our street..."
        ]
    },
    "The wordless instructions for an immersion blender have some confusing steps and pictograms": {
        "title": "The wordless instructions for an immersion blender have some confusing steps and pictograms",
        "score": 107,
        "url": "https://i.redd.it/0fx9946om59d1.jpeg",
        "content": "",
        "num_comments": 26,
        "comments": [
            "All these years of collecting transformers playing with lego and building ikea has granted me powers to understand what is going on",
            "You sure that’s not a weedwacker?",
            "I don't get T vs infinity, except that maybe infinity runs for 25 minutes until you turn it off, and you hold different buttons.",
            "Looks like the pictogram equivalent to \"word vomit\".\n\npicto vomit",
            "It's pretty logical. It would all be very simple if you had the device in your hands.",
            "Whatever happened to: plug in, stick in pot, turn on?",
            "I don’t understand the light-bulb semiotics. Do the lightbulbs with numbers indicate different run states for the blender?",
            "OK, I've got a pot, a steering wheel and I ran through my neighborhood in a figure of 8 pattern twice… when's dinner?",
            "I thought this was a manual to charge a Tesla or sum",
            "This is hilarious what the heck"
        ]
    },
    "they built a light pole in the middle of the road": {
        "title": "they built a light pole in the middle of the road",
        "score": 805,
        "url": "https://i.redd.it/u3qjge1u5q8d1.jpeg",
        "content": "",
        "num_comments": 41,
        "comments": [
            "You have a light pole lane and a bike lane. Neat.",
            "That's why they put traffic cones around it, duh!",
            "It's unlikely this was designed like this.  Far more likely this is /r/NotMyJob and someone fucked up and buried the lines in the wrong place or something.",
            "They widened the road around a light pole....",
            "If i had a nickel for every post i saw of a streetlight built in the middle of a highway, i'd have 2 nickels. Which isn't a lot, but it's weird it happened twice.",
            "This is a car crash waiting to happen.",
            "Checkpoint Charlie in Berlin came to mind",
            "How long do you think they took to realize",
            "At least you can see it at night",
            "And they charged the people a dollar and a half just to see it"
        ]
    }
}