{
    "Please Stop Reposting": {
        "title": "Please Stop Reposting",
        "score": 7090,
        "url": "https://www.reddit.com/r/CrazyFuckingVideos/comments/y3l1b1/please_stop_reposting/",
        "content": "I'm going to start temporarily banning people for reposting highly reposted content on the subreddit. It's super annoying and no one likes when a subreddit gets spammed with the same posts back to back for weeks.\n\nAlso hope y'all are having a good day :p",
        "num_comments": 577,
        "comments": [
            "**DISCLAIMER**: We allow posts to resurface every few months to revive good posts we forgot about and to give new community members a chance to see these golden posts. \n\nWhen I mean reposts I mean posts that get spammed every week or day back to back so don’t go _too_  crazy with the reports. Thanks!\n\n_Luke in mod chat_: “r/crazyfuckingvideos more like r/crazyfuckingreposts! 🥲”",
            "#Finally",
            "Within 15 mins this very post will be cross posted back to r/CrazyFuckingVideos",
            "Yes, it’s the main reason I unsubbed similar subreddits like WTF, unexpected, oddly terrifying, WCGW. People repost the same thing over and over again across all similar subreddits… whats the point? Reddit karma can’t turn into cash you know?",
            "[removed]",
            "[removed]",
            "Hear hear!!",
            "Thank you, I agree that shit is mad annoying",
            "Crossposting from r/CrazyFuckingVideos to r/CrazyFuckingVideos should be a permaban. There's no plausible deniability there that someone didn't know it was a repost, they're just undoubtedly morons.",
            "Would you be mad if I reposted this"
        ]
    },
    "All posts and comments related to Israel, Palestine and Gaza are now prohibited!": {
        "title": "All posts and comments related to Israel, Palestine and Gaza are now prohibited!",
        "score": 473,
        "url": "https://www.reddit.com/r/CrazyFuckingVideos/comments/1cg90zg/all_posts_and_comments_related_to_israel/",
        "content": "We understand that lots of people are interested in the ongoing conflict in the Middle East and want to discuss it on Reddit. Unfortunately, due to the very high number of users who are unable to talk about it in a civil manner, we are forced to **temporarily ban all posts and comments about Israel, Palestine and Gaza**.\n\nThis ban also includes **videos from protests** in support of either side, **older videos related to this topic** (from before October 2023), and **randomly bringing up this topic in the comments of unrelated videos**. You might be banned if you decide to post or comment about it. This post is the only and last warning.\n\nWhy the ban? Well, all these posts and comments lead to is harassment and insults towards other users over different opinions, hatred (both Islamophobia and Antisemitism), glorification of violence (against both Jews and Arabs/Muslims), misinformation about the situation, and in some cases even the terrorism support. We are not interested in this content when so many users can't discuss it like decent people.\n\nIf you are interested in a civil discussion about the topic, please use other subreddits instead.\n\nThank you for understanding.",
        "num_comments": 1,
        "comments": []
    },
    "Hmmm… who knew?": {
        "title": "Hmmm… who knew?",
        "score": 401,
        "url": "https://v.redd.it/kgk43lvkf03d1",
        "content": "",
        "num_comments": 81,
        "comments": [
            "Show-off",
            "The longest [walrus baculum](https://www.youtube.com/watch?v=Ony5vb01qYc) is near a meter long. Some Inuit's still use them to club seals.",
            "I heard he had a pair of his ribs removed so he could do that.",
            "\"Watching a walrus wank\" wasn't on my list of things to do today, but here it is.",
            "Alright...that's enough internet for today.",
            "The John Holmes of pinnipeds",
            "He hawk tuah on that thang?",
            "Let's be honest you would of you could....",
            "If this happened in Florida, a local politician will demand for the manatee to be executed for public indecency",
            "That’s some Gumo-Gumo-No action."
        ]
    },
    "Boxer suffers seizure mid-fight ": {
        "title": "Boxer suffers seizure mid-fight ",
        "score": 419,
        "url": "https://v.redd.it/rrynko17z28d1",
        "content": "",
        "num_comments": 48,
        "comments": [
            "Good on the other boxer recognizing something was wrong and not continuing.",
            "other boxer saw it before the ref and pulled back his stance. great sportsmanship!",
            "Poor guy, hope he is ok",
            "Good to hear he's good. Sucks to train for something then learn you cant continue.",
            "Article regarding this: [https://www.dailymail.co.uk/sport/boxing/article-13556231/Tramaine-Williams-discharged-hospital-tells-fans-good-boxer-suffered-seizure-midway-TCL-fight-v-Ryan-Allen.html](https://www.dailymail.co.uk/sport/boxing/article-13556231/Tramaine-Williams-discharged-hospital-tells-fans-good-boxer-suffered-seizure-midway-TCL-fight-v-Ryan-Allen.html)",
            "Happened in the opening minutes of the first round and no punches were landed at that point.",
            "Great restraint on the other boxer",
            "Epilipsy :(",
            "Credit to the other guy for not taking a swing. We all know there are Boxers out there who would",
            "Shoutout to Allen for not taking his head off there"
        ]
    },
    "It's not a game": {
        "title": "It's not a game",
        "score": 1823,
        "url": "https://v.redd.it/woj1ckcvk08d1",
        "content": "",
        "num_comments": 219,
        "comments": [
            "Stupidity and guns don't mix",
            "Also leg shots are a lot deadlier than people realize",
            "“Push It To The Limit”",
            "Cheddar Bob’s pen pal.",
            "The only upside is he only shot himself and not someone else. Hopefully he recovers and learns from this.",
            "Lol the accent evaporated instantly.",
            "I just watched this like ten times. Fucking hilarious 😂 😃 😄",
            "Before taking apart a firearm, you always clear it ladies and gentlemen. 😁",
            "Anybody else notice he was doing decent trigger control and reasonable handling until he tried to do the take down? Yet he still left a hot in the chamber and dropped one into his own leg. Over and over again, I tell people, \"Proceed like the gun is actively trying to kill you/someone. Act like that little shit will get paid for it.\"",
            "At least didn´t blow his homie´s head"
        ]
    }
}