{
    "I am working on a site where i want to gather all of the addons!": {
        "title": "I am working on a site where i want to gather all of the addons!",
        "score": 776,
        "url": "https://v.redd.it/juioywb8u8wc1",
        "content": "",
        "num_comments": 168,
        "comments": [
            "Please have a way to search by available game versions, that would be another helpful feature.",
            "is this available yet?",
            "!remindme 30 days",
            "Sounds super cool and useful",
            "now all we need is a schematic uploading site with this level of quality",
            "Ayo, thank you!!!",
            "Woah this is just what i need you could make a modpack with ALL of the addons!",
            "When will it be avaible ??? Also great work , it will be very helpfull ty",
            "https://addons.hexxy.media/ check out this, it's a similar thing but for hexcasting addons, could take some inspiration",
            "This would be dope, thanks for working on this!"
        ]
    },
    "i am making drillevator from Deep Rock Galactic and by some reason it do not dig all blocks and stuck in ground because of it. do anyone know why?": {
        "title": "i am making drillevator from Deep Rock Galactic and by some reason it do not dig all blocks and stuck in ground because of it. do anyone know why?",
        "score": 153,
        "url": "https://www.reddit.com/gallery/1dqyc0f",
        "content": "",
        "num_comments": 23,
        "comments": [
            "Check how you glued it, glued space should not be under it",
            "ROCK AND STONE!",
            "a falling minecart contraption isn’t the best at getting all the blocks without two layers of drills",
            "If this is a dropped minecart contraption like it seems to be, then the reason is that you don't have two layers of drills, gravity powered drills are pretty buggy unless you do that. The alternative is using a rope pulley to move it up and down, and that would let you keep its current aesthetic more intact",
            "If blocks are too close to its starting pos it may not destroy them speed of decent also is important going too fast will result in blocks getting skipped.",
            "I did not ever consider minecart contraptions as dropped machines! I swear every time I use this subreddit I learn something new",
            "I recommend changing it, instead of actually drilling, make it mechanically move one block down, then place the contraption, that will break all blocks instantly and look a lot neater and easier to do",
            "ROCK AND STONE!!!!",
            "Before I even read the title I said to my self \"is that the fucking drillevator in create\" all I can say is, ROCK AND STONE BROTHER!",
            "Likely because all of your drills are not on the same Y value. Flatten the bottom and try again."
        ]
    },
    "Accidental Hindenburg with Clockwork": {
        "title": "Accidental Hindenburg with Clockwork",
        "score": 273,
        "url": "https://v.redd.it/7mg6ccnhjb9d1",
        "content": "",
        "num_comments": 16,
        "comments": [
            "I applied physics to a ship that was too big, and as such my game crashed whenever I tried to disassemble it with the Creative Gravitron. I figured that the best way to get rid of it was fire and TNT, but didn't realize what it looked like till I got back on the ground. Thought Y'all might enjoy\n\nEdit: The airship is from a map called the Dawntreader ([https://www.planetminecraft.com/project/the-dawntreader---steampunk-airship/](https://www.planetminecraft.com/project/the-dawntreader---steampunk-airship/)) on Planet Minecraft",
            "This was a great reminder to run a backup on my server!",
            "Wdym accidental?",
            "Do you have Nvidium installed? That might be the cause of this weird ice visual artifacts",
            "Oh, the humanity!",
            "clockwork, Valkyrian skies, valk skies 2, whats the difference?",
            "\"Accidental Hindenburg\" Love it",
            "This mod run better now?  I tried it a while back and had a ton of compatibility and lag issues",
            "I assume the ship is an entity? You could try to `/kill` it",
            "> was too big\n\nWe often dream bigger than what we can."
        ]
    },
    "Finished wiring the turrets.": {
        "title": "Finished wiring the turrets.",
        "score": 9,
        "url": "https://v.redd.it/1itedlm1cg9d1",
        "content": "",
        "num_comments": 1,
        "comments": [
            "That's so cool"
        ]
    },
    "Our new modern and luxurious monorail made with create in ATM9": {
        "title": "Our new modern and luxurious monorail made with create in ATM9",
        "score": 54,
        "url": "https://www.reddit.com/gallery/1dqr4jn",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Wow that looks absolutely stunning!!!",
            "Awesome dude/mam this looks really good! I hate the FOV like I would prolly vomit IRL playing in that FOV but the depot is cool",
            "Normal isn’t 100? Normal is like 70 I usually play at 85 but for some reason when it gets to the elongated edges it makes my head weird and litterly give me motion sickness.. but back on topic because my second visit I actually realized you had more than one pic and still agree with my initial sentiment looks great :)",
            "Looking good",
            "Luxurious in*deed*!",
            "diagonals in minecraft feels so cursed",
            "Wow man, the Person on the pictures looks like you :o",
            "Its normal 100 FOV ;( hahahah",
            "Thanks haha. I Played on Quake Pro for like 5 Years. You would have died if you saw it hahahah",
            "Thanks mate :D"
        ]
    }
}