{
    "Effective immediately, images and gifs are available in the comments": {
        "title": "Effective immediately, images and gifs are available in the comments",
        "score": 288,
        "url": "https://www.reddit.com/r/cremposting/comments/1dijp8x/effective_immediately_images_and_gifs_are/",
        "content": "Greetings cremlings!\n\nTitle. Go bananas. \n\nBut not *too* bananas...\n\nMost of the rules of allowed content for comments.\n\nHave fun!!",
        "num_comments": 59,
        "comments": [
            "How exciting! Can't wait to use too storming many gifs\n\n![gif](giphy|2Mz07RuZARBVSjQnMB)",
            "Adonalsium shudders at the horrors that be unleashed upon Cosmere today.\n\nIt's ~turtles~ bananas all the way down..",
            "Now I can finally display the lore accurate Dalinar\n\n![gif](giphy|CAYVZA5NRb529kKQUc|downsized)",
            "![gif](giphy|9wLKh6ms5t9qE)\n\nThe crem will be more glorious than ever.",
            "![gif](giphy|nrfBNk8jZRx8tZzfVg|downsized)\n\nyou don't tell me what do!",
            "On mobile, at least, I can only see about half of these as embedded images instead of \"< image >\"",
            "I'm so excited to see all these new reaction images",
            "I wish I had a live Stilgar reaction",
            "Nah not Asian or Grumpy enough. The butt is accurate. He’s got a tight butt",
            "Syladin can't hapen if Kal dies and Sil bonds Moash. You know it will happen. This is the chasm we readers are going to balance on, and we will jump."
        ]
    },
    "Kaladin be like ": {
        "title": "Kaladin be like ",
        "score": 230,
        "url": "https://i.redd.it/9ehh3kulph9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Have you ever had some really good soup after a rough day?  Absolute steal of a deal for the bridgemen",
            "Airsick lowlander, this is not some silly soup. It is horneater stew.",
            "As the old saying goes the quickest way to a person's heart is through their stomach ",
            "This crem deserves some chouta! You now have 4 choutas for your efforts!",
            "Especially with some bread. Mmm good soup.",
            "Its winter here in australia and Im and earthmover labourer. So I dig in the mud and cold all day these days. A good soup at the end of the day is all I need",
            "This is why Eowyn never had a chance.",
            "It's not much but it's hot"
        ]
    },
    "Finally started Bands of Mourning, what bullshittery is about to go down?": {
        "title": "Finally started Bands of Mourning, what bullshittery is about to go down?",
        "score": 488,
        "url": "https://i.redd.it/4afg1ydf7f9d1.jpeg",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Era 2 really spread the rest of the cosmere to Mistborn fans like it's crack",
            "BoM is sick... Lost Metal is what Brandon referred to as \"taking the gloves off\" from a full Cosmere perspective.",
            "what's about to go down is the real implications of unkeyed metal minds and hemalurgey eventually allowing mortals to achieve apotheosis as demi shards.",
            "I just got caught up on Mistborn a few months back, and yeah, you'll see some shit. Keep an eye out for world hoppers.",
            "Bands of mourning is really good, then lost metal came out and its def my fav cosmere book now",
            "Yeah. I was like that in the first chapter of HoA mentioning a shard",
            "Spread it like a crack",
            "Lost metal is book 4, right? It's one continuous  Slanderlanch. Wax be >!waxing!<, Wayne be >!the bomb!<, Steris putting >!the entire Alethi court to shame.!<",
            "Couldn't believe they had a chouta stand. Brando Sando, you mad lad.",
            "Ah yes, more socioeconomic class imbalance for my  favorite stuffing characters"
        ]
    },
    "Funniest thing is he's written a chapter that's like a paragraph long": {
        "title": "Funniest thing is he's written a chapter that's like a paragraph long",
        "score": 439,
        "url": "https://i.redd.it/5y4md1vqke9d1.jpeg",
        "content": "",
        "num_comments": 25,
        "comments": [
            "The first time I read A Memory of Light was listening in audiobook format. I had to do a double take when one chapter was NINE hours long.",
            "I will never forget when I reched the chapter on my kindle an it said the time remaining to finish the chapter",
            "Interludes in Stormlight be like:",
            "The Last Battle is one of the few ‘Final Battles’ that actually lives up to the hype that the series has been building for it. There’s so many amazing moments and a great ebb and flow between the forces of the light and the Dark One.",
            "Goddamn that book was good.",
            "That one chapter is longer than the first Harry Potter book.",
            "… I didn’t even notice that was just one long chapter",
            "Brandon was just trying to copy Pratchett, but chickened out. First splitting Memory of Light to Three books then adding chapters. Shameful",
            "Umm i can't remember what chapter are we talking about",
            "I first interpreted this as a joke about the titular books in Stormlight and it works either way!"
        ]
    },
    "Way of Kings prologue was steamier than I remembered…": {
        "title": "Way of Kings prologue was steamier than I remembered…",
        "score": 25,
        "url": "https://i.redd.it/8yrsn1pkzi9d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "This is good crem, gancho! You now have 1 choutas for your efforts!",
            "https://preview.redd.it/tvxzatp11j9d1.jpeg?width=300&format=pjpg&auto=webp&s=19914d7e4df0750fc0f0878918e04ba68fa6f8f3"
        ]
    }
}