{
    "Daily General Discussion and Match Links Thread - June 29, 2024": {
        "title": "Daily General Discussion and Match Links Thread - June 29, 2024",
        "score": 20,
        "url": "https://www.reddit.com/r/Cricket/comments/1dr0wne/daily_general_discussion_and_match_links_thread/",
        "content": "[Live and upcoming match threads](https://www.reddit.com/r/Cricket/wiki/bot_schedule) | [Reddit-stream](https://reddit-stream.com/comments/auto)\n\nThis is a daily thread for general cricketing discussion/conversation about all topics that don't need to be posted in their own thread.\n\nThis provides a space for things like general team changes/opinions/conversation and other frequently-asked questions or commonly-posted subjects.",
        "num_comments": 167,
        "comments": [
            "Mahatma Gandhi vs Nelson Mandela in the finals of a tournament hosted by Martin Luther King?\n\nWho writes these scripts",
            "Sometimes i feel all hype and pressure for india is dragging their performance, hopefully this time not as i feel its less hype compared to wc 2023 final\n\nThere was post saying is Rohit the greatest captain of all time , bruh i don’t know what op was even thinking \n\nThere are lot of things other than having trophies , like captain should set a legacy and impact",
            "Fun fact:       \n       \nIndia had only lost 7 wickets to spin in this tournament so far, and all the bowlers who took the wickets are right-arm leg spinners.       \n        \nRashid khan (AFG) - 3    \nRishad Hossain (BD) - 2    \nBenjamin white (IRE) - 1   \nAdil Rashid (ENG) - 1",
            "Look, as much as I despise the BCCI, the venue for the semis being fixed for us wasn’t really their fault, it’s down to the ICC wanting to maximise Indian viewership via prime time slotting. So if you really wanna blame someone in this case it should be them. I would have jumped on the BCCI bad train with y’all if they had pulled some shit like “requesting” the ICC to have all their super 8 games there",
            "Where’s the captains standing next to the trophy before finals photoshoot",
            "If India lose, the most disappointing thing is you'll have some hot take former Indian player and some randos in the media who don't know shit about cricket, try to rag on the team, thinking they are top shit",
            "Good morning, fellow finalists!\n\nGonna do some Mega Rayquaza raids in Pokemon Go before the final 🐉",
            "Final is okay.\nWhat are we looking forward for after this world cup is over?\nIt's going to be a long wait till next tournaments lol.\n\nEdit- Thank you all, the kind bros who have replied here. \nNow I can look forward to all these events as well.",
            "You know the WC final has arrived when members start posting pictures of pitches in the sub and everyone’s a curator looking at the comments.",
            "The Netherlands A vs Germany\n\n🇳🇱 169/7 (20)\n\n🇩🇪 170/6 (18.5\n\nGermany win by 4 wickets\n\n⭐️ Key Players\n\nS Ahmad - 82* (43) & 3/13 (4)\n\nR Klein - 48 (40)\n\nGerman side is looking pretty decent. How long before we have Germany competing in the WC."
        ]
    },
    "Saturday Sledge Thread": {
        "title": "Saturday Sledge Thread",
        "score": 9,
        "url": "https://www.reddit.com/r/Cricket/comments/1dr0yt4/saturday_sledge_thread/",
        "content": "The weekly thread for banter and sledging related to recent cricket results and news. Normal sub-reddit rules apply, so keep it civil. Users can still submit separate sledge threads for big matches and series. AND DON'T FORGET TO SPEAK UP OR NO-ONE WILL BE ABLE TO HEAR YOU.",
        "num_comments": 32,
        "comments": [
            "IF SOUTH AFRICA NEED SOME ADDITIONAL PLAYERS, WE CAN LOAN THEM FOR A MATCH \n\n^((After all, we've poached 19 SA players in total))",
            "PRIOR TO THIS WC, AUS, ENGLAND AND SA WERE THE ONLY TEAMS TO HAVE DEFEATED INDIA UNDER BROHIT IN ICC EVENTS (WTC TESTS INCLUDED)\n\nWE ARE IN THE ENDGAME NOW!!",
            "IT'S TIME FOR AFRICA",
            "IT'S A WIN-WIN SITUATION;\n\nWINNER BECOMES THE T20I CHAMPION\n\nLOSER BECOMES THE UNDISPUTED CHOKE CHAMPION",
            "WOULDN’T MIND SA WINNING, BUT DO IT FOR DRAVID!!",
            "IF IT RAINS OUT CAN WE JUST CALL THE WINNER OF THE IND/SA WOMEN'S GAME THE WINNER OF THE WORLD CUP TOO?",
            "IT IS WRITTEN INDIA ON THE CUP, SA DONT BOTHER TO SHOW UP",
            "[Dear South Africa](https://youtu.be/AJntmten-Fw?si=26BntDoQtSiG88_X&t=99)",
            "[NUCLEAR BAPU INCUMMMINNNG ](https://np.reddit.com/r/ZaidZIZ/s/fqLAU1UJZ0)",
            "Worst part of losing to South Africa 🇿🇦 is India 🇮🇳 will gain Chokers tag 🏷️ \n\nI’d rather share trophy than gain chokers tag 🫡"
        ]
    },
    "No team has defended their T20 World Cup title": {
        "title": "No team has defended their T20 World Cup title",
        "score": 308,
        "url": "https://i.redd.it/3u7gtscx1g9d1.png",
        "content": "",
        "num_comments": 43,
        "comments": [
            "- No defending champion has ever won\n- No host team has ever won\n\nWhy the T20WC can be chaotically fun: you can immediately rule out those teams from any list of contenders.",
            "T20 is the most fickle or unpredictable format. It would be tough for any team to repeat. Pak made the final, then won and then lost a close semi (07, 09, 10). WI won 2/3 (12, 14, 16).",
            "West Indies defense in 2021 was painful\n\nGayle, Simmons, Pollard, Bravo, Pooran, Hetmyer, Russell all the league merchants were back but flopped so bad that they not only lost four out of five but also fell in rankings to not qualify for Super 12 of 2022 World Cup",
            "For a while, there was a weird streak where the host of the tournament would win the next one. Worked for England (hosted 2009, won 2010), WI (hosted 2010, won 2012), SL (hosted 2012, won 2014).\n\nOf course Bangladesh ain't winning anything so the streak was broken in 2016.",
            "What was the reason for such a little gap b/w 2009 and 10 world cup?",
            "The main thing this picture tells me is how frequently we've had the t20 WC.",
            "Leave apart t20 wc.Champions Trophy 2009 was the last time a team defended their trophy successfully.Since then no team has been able to defend their icc trophy.",
            "IND don't need to worry about this defence bogey when they play the next edition at home.",
            "Never forget that Stuart Broad once lead England in a T20WC lol",
            "It's the nature of T20"
        ]
    },
    "India expected to add T20 Cricket if they host the 2036 Olympics": {
        "title": "India expected to add T20 Cricket if they host the 2036 Olympics",
        "score": 168,
        "url": "https://i.redd.it/4bsy6tgv7g9d1.jpeg",
        "content": "",
        "num_comments": 91,
        "comments": [
            "Please Add Kabaddi, Bangladesh might get a bronze if we are lucky",
            "Kabbadi would also guarantee a medal for India",
            "I really wish and hope India doesn't take up hosting Olympics. Not a worthy investment. It might look good at marketing and politicians making a lot of money, but India is better off using that money to build other infrastructure or other policies reducing costs of products that affect day to day life.",
            "one of those games is not like the others",
            "Amongst all of these, Chess has one of the highest medal potentials for India.\n\nGukesh at 18 is already the World Champion Challenger, in 2036 he along with Pragg and Arjun would be at their peak. If they add all 3 formats, we have a very good chance.",
            "I hope politicians don't do what they did in CWG 2010",
            "Well squash really deserves to be in Olympics I mean literally every nation has players playing this sports and it’s kinda shocking it isn’t in Olympics while break dancing literally is , same for chess \n\nI played kho kho at school not as a sport but just for fun , is it really a sport that is played by many countries ? Cause I think it’s only there in india Pakistan etc",
            "Yoga?",
            "But isn't cricket already going to be included 2028 onwards?",
            "I think it would be a nice addition, but I think one major problem that have to improve the democratic process of the ICC, you can not say: Hey we have 12 members that de facto rule the process and make it very difficult for upcoming countries to improve. At the other hand T20 cricket is commercially very interesting something the Olympic Committee favor."
        ]
    },
    "Highest Innings total ever in Women's Test cricket.": {
        "title": "Highest Innings total ever in Women's Test cricket.",
        "score": 123,
        "url": "https://i.redd.it/bjcyj0mg9g9d1.png",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Really the women's team has showed such a brilliant performance. I really like the Batting of our openers and Shefali was really awesome. This knock and this innings will be remembered",
            "Wpl has helped their individual game a lot",
            "A few more years of WPL and quality of our Domestic players will rise too by alot"
        ]
    }
}