{
    "Holy Extreme Cringe": {
        "title": "Holy Extreme Cringe",
        "score": 440,
        "url": "https://www.reddit.com/gallery/1dr2vs2",
        "content": "",
        "num_comments": 98,
        "comments": [
            "\"Can't you see, you're not making Christianity better, you're just making rock n roll worse\"\n\n-Hank Rutherford Hill",
            "Yeah. It was a 90's thing. There is a reason it's 60 bucks on Amazon. That's vintage Jesus. \n\nAt least there wasn't a \"z\" involved. You had to be there.",
            "If Griffin McElroy is to be believed, that is a +1 holy symbol.\n\nPraise Pan!",
            "I thought this was a TAZ joke and was like woah that's so cool somebody actually made one lmao",
            "I had this when I was a kid. There's a page called SEX in huge font. One of the parents complained and got it banned...being a great practical joker, God then thought it would be quite funny for that same parent's 16 year old daughter to get pregnant. They had a secret abortion so naturally the entire congregation knew about it, and she had to go to school in the next town over.",
            "Holy fuck I had this and didn’t remember until now",
            "My crew is big and it keeps getting bigger, that is because jesus christ is my....",
            "The design of this is comforting nostalgia",
            "I used to have a very similar bible growing up in the late 2000s. I remember being really into it lol. But now I’m not religious so it worked super well obviously.",
            "I love the design though"
        ]
    },
    "Well that's adorab- oh.": {
        "title": "Well that's adorab- oh.",
        "score": 1568,
        "url": "https://i.redd.it/pur2ct8zub9d1.jpeg",
        "content": "",
        "num_comments": 76,
        "comments": [
            "SMH, He could've said \"I want to put my hotdog in your bun\" and it would at least have been on theme",
            "She told him to stop loafing around, he went straight ahead, cock first",
            "I read it initially without clicking on the photo and was like, oh puns. Then I clicked on the photo. Oof.",
            "tbh that would work on me",
            "I want to dip my breadstick in your sauce.",
            "Well they definitely stopped loafing around",
            "It wasn't the best response, but he could've been cruller.",
            "I think he is just thirsty for some Dixon Cider",
            "What is the baguette joke? I know it’s supposed to be a pun, but I can’t figure it out. It’s driving me crazy. lol.\n\nEdit: it it supposed to be “forget” or “get?”",
            "Turn it into minse meat."
        ]
    },
    "The signs that GMA made the audience hold up while watching the band Creed": {
        "title": "The signs that GMA made the audience hold up while watching the band Creed",
        "score": 1425,
        "url": "https://i.redd.it/9jl2cb7v949d1.jpeg",
        "content": "",
        "num_comments": 117,
        "comments": [
            "The guy in the middle is the only person there for Creed",
            "Ah, good morning America. Not shorthand for Grandma.",
            "These morning shows are always cringe.",
            "THEY’RE SHOWING CREE DONG, MA",
            "I just love how obviously from the same place the signs are, like, I know it's fake, but take 5 minutes and make some shitty ones by hand, would have cost pennies and been far more believable.",
            "That is pretty cool that they got every Creed fan in the world in this shot. Kudos",
            "You can see the pain in their faces",
            "GMA is such a romper room.",
            "Pretty sure teenage Peter Griffin there wasn't even alive when Creed was popular 🤣",
            "Look how happy those people are to be there. They are clearly huge Creed fans, who made those signs themselves before coming there.\n\n/s, in case it wasn’t obvious enough."
        ]
    },
    "Calls me the N Word then Proceeds to Text Me like Nothing Happened and Spam Call Me Months Later": {
        "title": "Calls me the N Word then Proceeds to Text Me like Nothing Happened and Spam Call Me Months Later",
        "score": 1126,
        "url": "https://www.reddit.com/gallery/1dpgrpp",
        "content": "Old friend from high school who I broke contact with years ago (for obvious reasons) randomly messaged me last November. I pretended to act oblivious because honestly I was shocked and had no idea what to say. They never responded and then randomly texted me today and now is spam calling me because I am not answering… ",
        "num_comments": 66,
        "comments": [
            "He wants to get you on his MLM",
            "\"Hey, I'm Sean. Remember? The guy who called you the n-word? That's me. (Sean). So... Waaaaaazzzzzzzuuuuuup?\"",
            "I beg of you to send him this screenshot and update us",
            "That's the kind of loser that has a hard time getting a date but then blames it on women being jerks because it's literally unthinkable that his actions and behavior might have repercussions.",
            "I’d wager he deleted the text when he said that and forgot all about it. Now wants to get you into his crypto scam or some shit lol. People suck.",
            "914 area code.  Westchester County NY - rich white kid. Checks out.",
            "What the fudge?\n\nI almost want to know more.",
            "Send them the screenshot and tell them you don’t want to be friends. Then block the number.",
            "I think he’s an addict who has just run out of money and pissed off his only friend. But he’s got a habit to feed and he knows you have an income. Since you mentioned once, how you always keep a spare hundred dollars for an emergency? Well, he has an emergency and he knows you have that money. And he thinks you mentioning it to him, could be a hint that he could use it if he needs it.",
            "He most likely wants money or something from you. Spam calling is wild.."
        ]
    },
    "\"Hawk Tuah On These Savings\"": {
        "title": "\"Hawk Tuah On These Savings\"",
        "score": 0,
        "url": "https://www.reddit.com/gallery/1dqq60u",
        "content": "this shit was literally an official email from windscribe, this service i used to use but never unsubscribed from, and they're trying to stay hip with the times but having no idea what it even means. It's so nsfw for their business lol, i dont think management really thought that through lol          \n            \nand they had the gif of the girls doing the hawk tuah thing and said below it \"come choke on these savings\" it's just an overall unbelievable email that i could not believe was real lol",
        "num_comments": 2,
        "comments": [
            "I used to pay $2 a month for unlimited data on windscribe, it was awesome. Wish they didn’t change the pricing.",
            "r/theyknew"
        ]
    }
}