{
    "Monthly marketplace for sales and trades (June 2024)": {
        "title": "Monthly marketplace for sales and trades (June 2024)",
        "score": 9,
        "url": "https://www.reddit.com/r/criterion/comments/1d5ec3w/monthly_marketplace_for_sales_and_trades_june_2024/",
        "content": "Sell, trade, or offer to buy in this thread by commenting below. \\*\\*Please include your country/state, and where you are willing to ship out to.\\*\\*",
        "num_comments": 99,
        "comments": [
            "Keep an eye out for PineappleNo6792.  I found this person in this thread last month advertising the Tati box set for $45.  I paid this person, they waffled about for an entire month, and never sent me anything.  Thanks to PayPal, I  got my money back from this clod",
            "For sale or trade, CONUS only:\n\nRepo Man Blu Ray",
            "Looking to trade my Rosemarys Baby (OOP) for boutique,criterion or otherwise, 4Ks",
            "ISO a BR copy of Kuroneko or Throne of Blood if anyone is looking to unload theirs.\n\nThanks!",
            "For sale or trade, CONUS only: 1 still sealed, brand new blu-ray of Kino Lorber's Last Year at Marienbad",
            "Dont know if its cool to post In search ofs, Im hoping to buy The Fisher King 4K preferred, but Blu Ray is cool too. Also looking for Blu Ray Inside Llewyn Davis. Thanks in advance for your time yall!",
            "La Dolce Vita OOP Bluray - $40",
            "oh god i just realized the formatting so sorry fk mobile",
            "Interested in three colors and Mishima",
            "Any interest in trades? Interested in Dekalog"
        ]
    },
    "What films have you recently watched? Weekly Discussion": {
        "title": "What films have you recently watched? Weekly Discussion",
        "score": 8,
        "url": "https://www.reddit.com/r/criterion/comments/1dn4jwx/what_films_have_you_recently_watched_weekly/",
        "content": "Share and discuss what films you have recently watched, including, but not limited to films of the Criterion Collection and the Criterion Channel.\n\n Come join our Discord and chat with the Criterion community! [https://discord.gg/ZSbP4ZC](https://discord.gg/ZSbP4ZC)",
        "num_comments": 32,
        "comments": [
            "Cruising (1980) - decided to rewatch this film since criterion added it aaand it's pride month - still enjoyed it as i did a year ago! it's a bold movie even by today's standards featuring an interesting insight into queer film esp in the pre-aids era of the states\n\nBound (1996) - another pride month watch, was genuinely surprised as to how ahead of the times this film was - wish we got more movies like it! and man is Joe Pantoliano a marvel to watch in that movie",
            "Shampoo 1975 , really funny comedy by Hal Ashby",
            "The Man Who Fell to Earth with David Bowie. I think I liked it.",
            "The Joke (1969): Saw this last night on 24/7. I read a lot of Russian literature and history and was really impressed by this reading of post-WWII Russia; even the (Gulag) camp scenes were spot on (though brief and not that graphic). The huge strength of this film is how it dissects (and rearranges) filmic form(s). For instance, the viewer is shown flashback after flashback with the protagonist stuck in the foreground of the frame as an older man; he is *discussing* (with the other characters) certain aspects of his past; that template is also repeated in present day time when he returns to these locations from his youth, but now the other characters *can* see (and interact with) him. There's another interesting filmic conceit where the director takes a scene that appears later in the movie that has a full cast and set, removes everything but a few characters, and inserts the resultant scene near the beginning of the movie as a metaphoric foreshadowing device. Example: (1) the big crowd scene at the end features dozens of people on horseback with fancy equipage, costumes, and saddles; (2) there is a scene very early on showing just one boy (practicing for the later scene) on a horse, but the backdrop is a flat, modern, building external, so the kid looks like an angel of light (almost as a nod to Tarkovsky).\n\nThe Hit (1984): This came on (on 24/7) right after The Joke, which was SO cool. An early Stephen Frears sparse kidnapping film with a VERY young Tim Roth (he looks almost prepubescent). Fine acting all around, not too much violence, and stunning visuals (remote parts of Spain, I think).",
            "Finally got around to 'Perfect Days,' and I enjoyed it tremendously. Koji Yakusho is teriffic, and the story does a great job of slowly revealing more about himself and the people in his life. The ending is another wonderful note; it's a great point for reflecting on the events of the movie and how this character lives his life.\n\nGosh, 2023 was an amazing year for movies.",
            "I watched Carlos by Olivier Assayas, the 185-min theatrical version. It was well made, with a good performance by dgar Ramrez, but a little too predictable. The international terrorist film genre is very similar to the gangster film genre and at this point it's difficult to make the plot and characters new and interesting.  The most memorable thing about Carlos the Jackal is that he clearly saw himself as another Che, but fizzled out and had a pathetic ending rather than die heroically and be revered by the international left as a martyr. Some people thought the film glorified Carlos but it is more complex than that. Still, not one of the director's best. I like his more character-driven films better.",
            "Just watched David Finchers Zodiac which was excellent. Probably gonna watch Dont Look Now next in honor of Donald Sutherland.",
            "Finally got around to watching Gerry (2002). Really loved it and am always impressed by the cinematography of Harris Savides.",
            "Inland Empire. Can anyone explain that movie to me like im 5? Or can nobody and thats the joy of it? I didnt like it in the slightest and im a fan of all his movies. Was really looking forward to it, until i realized its just a jumbled mess of scenes that look like shit. Apart from maybe two scenes i felt nothing but boredom from it\n\nOh and watched stop making sense again for the 5th time this year. Love that",
            "And a happy Pride to you too! "
        ]
    },
    "Pretty sure this happened last night when I was making my first haul.": {
        "title": "Pretty sure this happened last night when I was making my first haul.",
        "score": 35,
        "url": "https://i.redd.it/ryh5y4lchh9d1.jpeg",
        "content": "It’s an old meme, but it’s funny.",
        "num_comments": 0,
        "comments": []
    },
    "First haul is a Texas haul": {
        "title": "First haul is a Texas haul",
        "score": 142,
        "url": "https://i.redd.it/3lkdggj54f9d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "Thats a great haul, but it needs Dazed and Confused too!",
            "Jealous that you were able to find *The Tree of Life* in person, I had to order it online.",
            "Does Red River count? I say it does",
            "My heart warms anytime someone buys a new copy of Local Hero.",
            "Paris, Texas is a whole universe",
            "Excellent collection! Im always happy to see True Stories represented. Its one of my very favorite films. It has made a huge impact on me since it was first in theaters. Hope you enjoy it!",
            "Dazed, Les Blank boxset, Midnight Cowboy, Lone Star, Thin Blue Line would complete every Texas movie in the collection. Keeping my eyes peeled.",
            "I looked, but no dice. Next time",
            "That and Days of Heaven might count after I get the rest",
            "\" I wonder what the poor people are doing tonight\" cracks me up every single time"
        ]
    },
    "50% off sale pickups !": {
        "title": "50% off sale pickups !",
        "score": 19,
        "url": "https://i.redd.it/i5qhfm1o9i9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Heading to my local store today lol. Got my orders online now I want store pick up"
        ]
    }
}