{
    "[Spoilers C3E98] Is It Thursday Yet? Post-Episode Discussion & Future Theories!": {
        "title": "[Spoilers C3E98] Is It Thursday Yet? Post-Episode Discussion & Future Theories!",
        "score": 66,
        "url": "https://www.reddit.com/r/criticalrole/comments/1dkxdm2/spoilers_c3e98_is_it_thursday_yet_postepisode/",
        "content": "##Episode Countdown Timer - http://www.wheniscriticalrole.com/\n\n***\n\nCatch up on everybody's discussion and predictions for this episode [**HERE!**](https://www.reddit.com/r/criticalrole/wiki/campaign3)\n\nSubmit questions for next month's **4-Sided Dive** here: http://critrole.com/tower\n\n***\n\n**ANNOUNCEMENTS:**\n\n* [Submit questions for the cast's upcoming convention appearances!](https://docs.google.com/forms/d/e/1FAIpQLSdyahTpEOIHUeiKeQk49kDK7A-CmEZuxDjxMuopzyS7BSZPcA/viewform)\n* [Join the Daggerheart playtest.](https://www.daggerheart.com/)\n* Legend of Vox Machina Season 3 coming this fall.\n* Introducing [**Beacon**](https://critrole.com/beacon/), Critical Role's new membership service with exclusive content, early live event presales, merch discounts, and more!\n* Check out the first episode of [The Re-Slayer's Take](https://critrole.com/the-re-slayers-take/) on your favorite podcast app now, with new episodes every Monday (or two weeks early and ad-free on Beacon).\n* [Spring 2024 Programming Survey](https://www.surveymonkey.com/r/CRcontent2024)\n\n\n***\n\n**[[Subreddit Rules](https://www.reddit.com/r/criticalrole/wiki/rules)] [[Reddiquette](https://www.reddit.com/wiki/reddiquette)] [[Spoiler Policy](https://www.reddit.com/r/criticalrole/wiki/spoilers)]\n[[Wiki](https://www.reddit.com/r/criticalrole/wiki/index)]\n[[FAQ](https://www.reddit.com/r/criticalrole/wiki/faq)]**",
        "num_comments": 535,
        "comments": [
            "Episode List:  \nJuly 11th Episode 99: Downfall Part 1\n\nJuly 18th Episode 100: Downfall Part 2\n\nJuly 25th Episode 101: Downfall Part 3\n\nPlayer List:  \nBrennan Lee Mulligan, Laura Bailey, Tailesin Jaffee, Ashley Johnson, Noshir Dalal, Nick Marini, Abubakar Salim",
            "What I'm liking about Downfall is something that Brennan brought up during the Cool Down.\n\nThe Bells Hells are going to be experiencing all of the stories of Downfall, alongside all of us, and will be acting as an audience alongside Ludinus.\n\nThis means that as soon as we come back from Downfall in a few IRL weeks time, ALL of that story and lore is going to be hitting them like space station coming out of hyper space, and that's AFTER all the shit that went down in this episode.\n\nSo of course Ludinus is going to want to spend time talking to them after all of that, which means that that return episode is going to be just as massive as this one and as the Downfall series was.\n\nHe's using the Bells Hells as a dry run for a global broadcast of this information.\n\nThere are going to be some...discussions here....based on what we see happens during Downfall and how the Bells Hells react afterwards and how Ludinus in turn reacts to them.",
            "Braius is confirmed to be a Tragedy bard on Cooldown, at least level 3 to get the Sorrowful Fate feature. And he also used Blinding Smite, Moonbeam and Misty Step, which suggests at least level 9 Oath of the Ancients paladin (but Misty Step could have come from a feat, so he could still be Oath of the Watchers). I just can't believe Sam played a Tragedy bard before Liam!\n\nEdit: Braius is also 1 level higher than BH. I wonder if his build necessitates it. But I think BH will level up as soon as we come back to them after Downfall",
            "#LIGHT",
            "I thought the episode was good. I'm curious how the \"aeor security footage\" trilogy will effect BH. It might not sway them for or against the gods or Ludinus. I appreciate that they didn't just go \"well, July is vacation month NO CONTENT ALL MONTH BYE...\" \n\nMocktails for everyone! Break out the Beau Tiki Mugs and the Strongjaw Ale for Spooky In July!",
            "Announcement video! I though they were going to wait until Monday. https://x.com/CriticalRole/status/1804197937481703460\n\n  \nThe PCs are \"divine figures\"!  I wonder if the gods tried to stop Aeor from using the Factorum Malleus with a small infiltration team to avoid nuking it.\n\n  \nI'm also very interested in the \"betrayal\" aspect of it.",
            "that was one of my favorite fights\n\n\nit was hilarious how it boiled down to essentially a poor DM using three level 20 NPCs to kill a grand demon, while his players do everything in their power to sabotage the plot progression 😂",
            "So instead of Matt describing a vision, we're going to see it play out in real time. \n\nThat is fucking cool.",
            "> \"Light. In a space beyond the real, there was, made of light, a palace -- which is to say, a garden, or fountain, or a mirror, or a heart, or, more than any of these, an idea. A swirling nebula of glimmering potential, cresting eternally upon the threshold of being. But if it aids you, Exandrian, to imagine what the mortal eye can never see, envision then, what I have said: a palace, its floors the dancing stars in unmapped orbit, its ramparts light and ice and fire, its hallways memory and time. Our story begins at the ending of the infinite, at the doom that pierced eternity. Fractured images of a lost world, and of the ones who lost it. Remember, now, a place which was not less, but rather more than real. Remember tragedy, betrayal, calamity, downfall. In the recording of this memory, may the answers to many questions lie; but one question yet, and shall forever more, remain: Is it Thursday yet? \n\nis there anyone that can monologue as well as brennan lee mulligan? i have chills just reading this again lol\n\ni'm so looking forward to this mini series and be emotionally devastated again by brennan and the cast. july can't come fast enough!",
            "I'm honestly really excited to see Downfall, and see Brennan DM again. The Cooldown on Beacon has some fun information about what to possibly expect with it."
        ]
    },
    "[Spoilers C3E98] Taliesins and Ashtons performance during the Live show.": {
        "title": "[Spoilers C3E98] Taliesins and Ashtons performance during the Live show.",
        "score": 143,
        "url": "https://www.reddit.com/r/criticalrole/comments/1dqxl8o/spoilers_c3e98_taliesins_and_ashtons_performance/",
        "content": "After watching the most recent episode I want to highlight Taliesins acting that night and how phenomenal it was. The maniacal giggling of Ashton during combat was something I missed in the character especially in recent times. Personally I saw Ashton as the center of attention during the whole fight because his attitude gave the impression as if it was a game for him and he always knew what was going on so he could just relax and have fun fighting. (Also just the excitement of Taliesin for fighting demons was amazing)",
        "num_comments": 38,
        "comments": [
            "Got to give it to Robbie too, he was definitely on Tal’s wavelength with some of their back n fourth",
            "Finally a tal appreciation post and not a hate post of him just existing and having fun",
            "It's weird to think but Tal probably has the most live action acting credits after Ashley of the whole cast even though he stopped at like 10.",
            "“I’m not scared of fighting, I’m scared of losing!”",
            "Yeah, I really liked his reaction to the bad vision thing with FCG too.",
            "A barbarian who runs away and tries to be ranged and safe is… a choice, I guess",
            "You could honestly skip a big chunk of the campaign and be ok as far as the main story goes.  I guess you'd want to pick up as they head toward the Applebee's soulspice event location.   That's when things really get interesting.",
            "Which of his characters did he play? They're all exactly the same so it's impossible to know for sure.",
            "“DC OF 16, DANCE BIIIITCH!!!” will live rent free in my head forever.",
            "Cause they're [Losers, baby](https://www.youtube.com/watch?v=XNYVAj7ObgM)"
        ]
    },
    "[No spoilers] Happy birthday Matthew Mercer! It’s your birthday twin": {
        "title": "[No spoilers] Happy birthday Matthew Mercer! It’s your birthday twin",
        "score": 23,
        "url": "https://www.reddit.com/r/criticalrole/comments/1dr42mo/no_spoilers_happy_birthday_matthew_mercer_its/",
        "content": "Born June 29th, 1982. Happy birthday Mr. Mercer. ",
        "num_comments": 4,
        "comments": [
            "Not Mercer but happy birthday fellow birthday twin!",
            "Brightest blessings on your b-day! Hoping you get to celebrate with loved ones and friends, good food, lots of laughs, and random weirdness because that's always good for conversation later. :)",
            "Happy birthday to you too my friend! ",
            "Thank you very much, \n\nI’m very certain about the random weirdness, family is family no matter what. ❤️"
        ]
    },
    "[CR MEDIA] Free Autograph": {
        "title": "[CR MEDIA] Free Autograph",
        "score": 32,
        "url": "https://www.reddit.com/gallery/1dqzw4q",
        "content": "Hey Ya’ll \n\nA quick story I went to New York Comic Con in 2022 and while I was at the convention they had an autograph mystery package and I’m gonna be so real with ya’ll I have no idea what critical role is but I’m willing to give this away to anyone that hits me up first all you have to do is pay shipping or if you’re in the NY area hit me up and I’ll drop it off or we can meet up for it I don’t mean to be disrespectful I just want it out of my house LMAO anyways I hope to give this autograph a home its kinda beat but its literally free so tl:dr free autograph thank you🙏🏼 ",
        "num_comments": 10,
        "comments": [
            "I'm flat broke but you're very cool for doing this. Hope it finds a good home",
            "Hey guys update I decided to give it to the first person that commented for it and asked ill be shipping it out tomorrow to them thank you so much for the replies (i was worried i was going to have to throw it away lol) and if I ever get decide to gamble again and get another autograph for critical role Ill come straight here again thank you guys so much 🙏🏼🙏🏼🙏🏼",
            "LOL I might be willing to take it off your hands.  How are you planning to ship it?",
            "If you don't get any takers, I would love to take it and pay for shipping.",
            "It's so nice.\nAnd  I arrived late.\nCongratulations to the winner.",
            "I'd be interested if it's still available!",
            "I'm 100% to late but no harm in throwing in my 2 cents asking for it lol. Been a fan for years! Awesome grab and congrats to whoever gets this!",
            "Did someone already get it? If not I'll take you up on the offer!",
            "Would sell my first born for this gem",
            "Oh wow. If you’re pulling user names out of a hat, throw mine in, please. Happy to pay for shipping."
        ]
    },
    "[No Spoilers] First time watching, should i skip directly to episode 28? ": {
        "title": "[No Spoilers] First time watching, should i skip directly to episode 28? ",
        "score": 42,
        "url": "https://www.reddit.com/r/criticalrole/comments/1dqwe9n/no_spoilers_first_time_watching_should_i_skip/",
        "content": "I'm very new to d&d and critical role and finished the first episode of the first campaign for the first time very recently. I really enjoyed it and had a lot of fun. But i learnt that tiberius' player became very inappropiate later episodes,started to ruin the dynamic of the group and started sexually assaulting the female players? Should i just watch a recap of the first 27 episodes and skip directly to episode 28 or should i just watch the episodes since its my first time watching. Would i miss anything important?\n\nEdit;thank you to everyone who replied and gave their insight. I think im going to watch the episodes (except for the 27th one maybe im not sure about that one yet lol) but yall were very helpful tysm!",
        "num_comments": 71,
        "comments": [
            "I LOVED the beginning episodes honestly. Tiberius gets annoying but its only bad in a few episodes and you can just skip ahead during those parts. People hate on him but i felt he had some good moments. And they honor his character well after he leaves the campaign.",
            "Orion / Tiberius can be very... off-putting... and is certainly a stain on the first episodes, but I'd still at least try to watch them unless you have some personal issues related to misogyny, crude sexual innuendo of the non-humerous variety, or anything like that. You wouldn't be completely lost or out of the loop by skipping them all, but there are some genuinely good moments and context that I'd at least try to watch.",
            "Watch all of them. The issues with Orion do not negate or outweigh the other 99% of amazing content. There are SO many great moments you'd hate to miss. Even more importantly, there are characters and threads that you won't understand as well, if you skip. Also note that the cast thought enough of Tiberius and their friend, to give him a very nice story ending, later.\n\nTruth be told, I watched all episodes from the beginning, before I knew of the issues. I actually just thought that Tiberius was kinda flirty and being goofy-inappropriate sometimes... *literally just like Scanlan was*. I am a grown woman, and I was no more offended by Tiberius, than I was by Scanlan (which is to say that I wasn't).",
            "I will say having watched Critical Role because of seeing the trailer for 'TLoVM' I watched the campaign from episode 1 without any knowledge of what happened and while I definitely noticed the problem player eventually, it didn't affect me much, plus seeing early Critical Role is something that I think shouldn't be missed. That's me tho.",
            "I'd highly recommend trying to power through, there are a lot of ideas and people you miss out on. If you find the audio issues/cast issues get to be too much, at least try to start around ep 16. It introduces an extremely important location in Exandrian lore and within a couple of episodes introduce some characters that come up several times in the campaign, as well as some that cross campaigns.",
            "I would recommend watching them. imo Orion doesn’t get bad until episode 11, then he gets better, and then he gets worse again. He also doesn’t sexually assault any of the cast members, he made a gross comment toward Laura during his last episode and wrapped his arms around Marisha the episode before when she told him not to. There are a lot of great moments and NPCs in those episode that you probably don’t want to miss.\n\nWhen I watched them I just skipped the parts that made me uncomfortable and it was fine. To me, the worst part of early campaign 1 is the audio issues, twitch chat being shown on screen (I would find a way to cover it if I were you), and the YouTube comments being absurdly critical of the cast but especially Marisha",
            "The Kraghammer arc rules! IMHO it’s the best showcase of “traditional” DnD while also having absolutely wonderful RP given who the cast is. Plus you meet an important NPC and an absolute fan favorite NPC. You’ll also have to tolerate some dodgy audio at points.\n\nOn the “stain” of the early eps, I truthfully think Orion’s shittiness comes in waves. He has great episodes and he has ones where you can visibly see the tension. Ultimately his last 2-3 are borderline unwatchable but you can always zip through the parts that make you feel uncomfortable.",
            "I still watch them. Yes Orion can be rough at points but there are some important threads in those early episodes. \n\nAnd if something happens that makes you uncomfortable you can skip forward a few minutes and be passed it.\n\nETA the more prevalent issue in early C1, is the audio issues",
            "I really loved those episodes, Tiberius aside. \n\nYou get the first on stream betrayal, a good final boss fight, lava damage for everyone, etc.",
            " I say watch the first 28. I’m currently finishing episode 13 and it really gives you an opportunity to learn to love every character from the beginning. I read plenty about Orion but I still feel like this was the best decision. There’s a lot of reaaaaal cool moments!\n\nEdited to add “I” LOL"
        ]
    }
}