{
    "Buy/Sell/Promote/Trade Thread": {
        "title": "Buy/Sell/Promote/Trade Thread",
        "score": 9,
        "url": "https://www.reddit.com/r/crochet/comments/1d5c8m4/buysellpromotetrade_thread/",
        "content": "###In this thread, feel free to promote your crochet or yarn-related goodies.\n\n***\n\nPlease read our [rules](https://www.reddit.com/r/crochet/wiki/rules). \n\n***\n\n1. Please state if you are promoting yourself or someone else's stuff.\n2. Please describe exactly what it is that you are promoting.\n3. If you are selling or trading something, please let us know when that item is gone.\n4. Please remember that we are all equal here, so no downvoting others in an attempt to make your comment more visible.\n\nPlease save/subscribe to this thread to make it easy to find in future.\n\n\n###Our sticky threads\nare linked below, or [Sort the sub by Hot](https://imgur.com/a/qQS48He) to find them. \n\n* #**[Buy/Sell/Promote/Trade](https://www.reddit.com/r/crochet/search?q=flair_name%3A%22Buy%2FSell%2FPromote%2FTrade%22&restrict_sr=1&sort=new)** & \n\n***\n\n* #**[Question Hub thread](https://www.reddit.com/r/crochet/search?q=flair_name%3A%22The%20Question%20Hub%22&restrict_sr=1)**.",
        "num_comments": 50,
        "comments": [
            "I'm genuinely surprised by how good this is. Do you aim to always keep it free? if so mods should add it to the wiki somewhere to refer to though asking how to pattern write mosaic",
            "To combat spam, we require a minimum account age of 1 days and positive karma to post. Please try again in 24 hours!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/crochet) if you have any questions or concerns.*",
            "To combat spam, we require a minimum account age of 1 days and positive karma to post. Please try again in 24 hours!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/crochet) if you have any questions or concerns.*",
            "To combat spam, we require a minimum account age of 1 days and positive karma to post. Please try again in 24 hours!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/crochet) if you have any questions or concerns.*",
            "To combat spam, we require a minimum account age of 1 days and positive karma to post. Please try again in 24 hours!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/crochet) if you have any questions or concerns.*",
            "Bonus point if you guess how i made the teeths of this Cait Sith",
            "To be honest, we are thinking about options for monetization of the project, as it is difficult to develop the project without it. But everything that is in the current version of the site will be available openly, free of charge and very welcome for use",
            "This is amazing!  <3",
            "That's so cool!!",
            "Thank you!💕"
        ]
    },
    "July Crochet Along Poll": {
        "title": "July Crochet Along Poll",
        "score": 8,
        "url": "https://www.reddit.com/r/crochet/comments/1do6nw6/july_crochet_along_poll/",
        "content": "Hello Crocheters,\n\nI apologize for getting a late start on July’s Cal Poll.  Sometimes life gets in the way; what, with taking care of our deck, trying to climb the corporate ladder and making attempts at keeping myself and my wife sane and grounded, sometimes things slip. But, I am back at it and we have some more selections to look through.\n\nThis month we have a ton more outdoors and food related days, seems to be a common theme in the summer when we, in the northern hemisphere at least, have warmer weather to enjoy the outdoors. We obviously have the 4th of July in the states, and as such I expect to see a few red, white and blue choices; and while it is a major holiday, it is a US holiday. So, instead, I’ll focus on the other “national days of” choices we have. We had repetitive patterns in June, we can see that same similar repetitive feature in July. So, I think we are going to go with food and clothing patterns; essentially, something you need to for eating outdoors aka Picnicking.\n\nWith the preamble out of the way, onward towards the selections:\n\n1) [Summer brimmed hat](https://www.handylittleme.com/crochet-summer-hat/) by [Louise](https://www.handylittleme.com/)\n\n2) [Summer Bucket Hat](https://www.hookedonhomemadehappiness.com/beach-day-bucket-hat-crochet-pattern-cal-for-a-cause/) by [Breann](https://www.hookedonhomemadehappiness.com/)\n\n3) [String Shopping Bag](https://www.mamainastitch.com/how-to-crochet-a-string-shopping-bag/) by [Jessica](https://www.mamainastitch.com/)\n\n4) [Farmers Market Bag](https://jewelsandjones.com/crochet-farmers-market-bag-free-pattern/) by [Nicky](https://jewelsandjones.com/)\n\n5) [Al Fresco Picnic Set](https://undergroundcrafter.com/2024/06/07/weekend-mystery-cal-12/) by [Marie](https://undergroundcrafter.com/)\n\n[View Poll](https://www.reddit.com/poll/1do6nw6)",
        "num_comments": 3,
        "comments": [
            "To combat spam, we require a minimum account age of 1 days and positive karma to post. Please try again in 24 hours!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/crochet) if you have any questions or concerns.*",
            "Current CAL Megathread can be found [here](https://www.reddit.com/r/crochet/s/hfplmwv5vz) or in the sidebar",
            "[removed]"
        ]
    },
    "Plankton has an extra antenna for you": {
        "title": "Plankton has an extra antenna for you",
        "score": 945,
        "url": "https://i.redd.it/cplm9ag6kg9d1.jpeg",
        "content": "",
        "num_comments": 74,
        "comments": [
            "I did not ask for this but I also cannot complain because of what an amazing job you did. Thank you for sharing this nightmare fuel.",
            "Just because you can doesn’t mean you should",
            "Well I don't know what I expected...",
            "Because the white shows through his legs, I totally thought the extra antenna was dripping. I was like, \"Wow, that's some attention to detail.\"",
            "r/brochet might appreciate more than this sub lol",
            "Well that's enough Internet for today. And it's only 4 AM...",
            "All I could say is that I’ve never had my jaw drop so fast for anything in my life. I don’t know what kept me up this late but I now know that someone or something was keeping me up to feast my eyes upon this! 😂 \n\nBtw, looks awesome!!!!",
            "I don't know if i love you or if i hate you\n\nBut you made me laugh",
            "That is certainly a choice",
            "i have so many mixed reactions to this i don’t even know where to begin"
        ]
    },
    "An actual Tapestry I have in my house. Framed and everything ": {
        "title": "An actual Tapestry I have in my house. Framed and everything ",
        "score": 286,
        "url": "https://i.redd.it/6he86rm6nh9d1.png",
        "content": "8 hours to do. And worth absolutely every second of work.",
        "num_comments": 17,
        "comments": [
            "I can't believe I got *rickrolled* by a tapestry 😭😭\n\nyou cruel, cruel genius",
            "My phone doesnt let me scan the code.  Where does it lead? :)",
            "Perfect!  I agree, that was totally worth the effort.",
            "I was so hoping this was the case! I love that you got a second device involved for the rest of us",
            "It **had** to be that.",
            "I'm happy to take a hit for the team lmao",
            "On iOS you can save this image, long-press on the QR code from your camera roll, and it'll pull up the link. I can't speak for Android but I would assume it can do the same or similar.",
            "On Android you can take a screenshot, open Google Lens and select the picture. It'll give you a link.",
            "💀💀💀💀",
            "Amazing. Congratulations! ❤️"
        ]
    },
    "Give me honest feedback of this Mushu 🥲": {
        "title": "Give me honest feedback of this Mushu 🥲",
        "score": 2208,
        "url": "https://i.redd.it/0sura2vekd9d1.jpeg",
        "content": "",
        "num_comments": 161,
        "comments": [
            "Honestly? I would die for him! His little moustaches! His big eyes! His goofy teeth! He's so freaking cute.",
            "I’m sure you’re aware that he looks a bit goofy but I am here for it and would totally adopt him if it were feasible. He’s so adorable!!",
            "he's so cute, I love him! Did you freehand him? He's just adorable",
            "He’s quirky and adorable and I would hurt anybody who said otherwise! Yeah, he’s not 100% accurate, but he’s 1842590953290942% cute!!!",
            "Looks good and recognizable to those who know him.",
            "I love it! \n\nMy honest critique is the stitches look a tiny bit loose in the chest? Maybe I'm dumb but to me they look like that. Though it's negligible. I'm like reaching to find anything. It honestly looks great!",
            "I knew immediately who it was!",
            "Nooo I love it it’s so cute omg😭😭😭😭😭",
            "so cute!! great job keeping your stitches looking clean!",
            "Omg he's ADORABLE!!!!!! I love him!!!"
        ]
    }
}