{
    "Self-Promotion Saturday - 29 Jun 2024": {
        "title": "Self-Promotion Saturday - 29 Jun 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/crossfit/comments/1dr30eb/selfpromotion_saturday_29_jun_2024/",
        "content": " Go ahead and use this post to show us your vlogs, blogs, or shirts or whatever you've made!",
        "num_comments": 0,
        "comments": []
    },
    "Daily Whiteboard/Quick Questions Thread - 29 Jun 2024": {
        "title": "Daily Whiteboard/Quick Questions Thread - 29 Jun 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/crossfit/comments/1dr2j1z/daily_whiteboardquick_questions_thread_29_jun_2024/",
        "content": " Come on in and ask any quick questions that you're burning for an answer to or just talk about your workout today!\n\nPlease remember to \\[check the Wiki\\]([https://www.reddit.com/r/crossfit/wiki/index#wiki\\_frequently\\_asked\\_questions](https://www.reddit.com/r/crossfit/wiki/index#wiki_frequently_asked_questions)) for answers to some common questions, and to use the search!",
        "num_comments": 0,
        "comments": []
    },
    "Coaching, unruly kiddos": {
        "title": "Coaching, unruly kiddos",
        "score": 38,
        "url": "https://i.redd.it/crt1x0ujec9d1.png",
        "content": "I have coached for 6+ years and have dealt with kids who don't stay in the designated area. Recently this has gotten significantly worse due to a change in the designated kids area and the fact that recently new owners do not feel it is that important (or dangerous). This happened today and the parent was literally right there and would not reprimand their child to stop. \n\nCoaches/owners-do you think this behavior should be addressed or do you feel it is acceptable? How would you suggest a coach approach the owner to convey their concerns?",
        "num_comments": 32,
        "comments": [
            "You are a coach. Show this picture to your owner via email, document your concerns clearly and concisely in terms of liability, BCC yourself and save the receipts. Once you have taken 10 to 15 minutes to do all that, repeat after me: This shit's above my paygrade.",
            "Legit wondering how they even got themselves in this position. 🤔🤨",
            "I mean it’s a fucking ridiculous thing for owners to allow. But as owners, it’s ultimately their call. If they want to allow stuff like this, it’s their right to do so as the business owner (at least until some kid gets hurts, sues the gym, and puts them out of business)\n\nAs either an employee or a member, there really isn’t much you can do. Other than deciding this is the type of organization you don’t want to be affiliated with, and find a new gym.",
            "I’d bring it up directly with the owner and if they weren’t willing to hear feedback, I’d leave. That’s a disaster waiting to happen. (And as a member, I HATE this. I’ve left over unruly kids)",
            "If I were a coach and the owner didn’t think it was important, I’d present my resignation and look for another box.\n\nI won’t risk someone getting seriously injured on my watch. The owner will likely say it’s my fault for not having said anything to the child or parent.\n\nIf were a member and saw this, I’d also look for another box. The last thing I need is a class being interrupted because someone didn’t control their kid.",
            "I treat kids like kids, and adults like adults. If a kid wants to act like an adult, I’ll treat them that way. If an adult wants to act like a kid, I’ll respond accordingly. That’s a kid that wants to be an adult. Coach them. Explain to them why it’s dangerous and that’s not what the rings are for. So it so the parent hears and sees this. Respond to the parent based on my first sentence.",
            "I'd for sure be quitting. I don't want to have to work about that while I'm trying to coach.",
            "This is quite literally the only thing I don’t like about my gym. The owner and coaches allow people to bring their kids and there is no designated kid area. The kids are running around while people are literally dropping barbells. I go about my workout as best I can but I will straight up tell a kid to move when I come back to my rower and a 5 year old is on it. I’m probably going to talk to the owner soon. I’m not there to babysit and if a kid walks in front of me when I’m dropping a 30 pound ball… not my problem.",
            "I’m an owner. We don’t allow kids to be in the gym. Only the kids area.",
            "I'm a Youth Pastor, I work with students regularly, here's what I would do.\n\nSet clear expectations for families on what's acceptable and not acceptable.\n\nGive clear consequences for what happens when expectations are not met.\n\nHere's the hardest part - follow through on those consequences *no matter what*. I don't care if the whole family is paying for memberships and PT, if the consequence is a revoked membership, yank the membership. The liability for what is happening in this picture is jacked up. Would not fly under my supervision. If the owners have an issue with it, I would be surprised if they don't have a major incident in the next 5 years that threatens for close their facility."
        ]
    },
    "What are the qualities you appreciate most in your favorite CrossFit coach(es)?": {
        "title": "What are the qualities you appreciate most in your favorite CrossFit coach(es)?",
        "score": 21,
        "url": "https://www.reddit.com/r/crossfit/comments/1dqoe07/what_are_the_qualities_you_appreciate_most_in/",
        "content": "I've got some amazing people that I take instruction from, and hope one day to spend some time helping others as well. Just curious, what makes a great CrossFit coach? ",
        "num_comments": 42,
        "comments": [
            "Demo every movement, demo scale downs, and actually give feedback during said movements. Trying to help everyone, even people who have been going a long time.",
            "I recently visited another box on vacation and the coaches were nearly silent during the WOD. There wasn't any helping folks who were doing the movements incorrectly, no help on scaling, just telling us the workout and starting the clock.  It made me appreciate the coaches at my box who are very positive and vocal, helpful, and go above and beyond to show you scales and help you adjust during a WOD.",
            "I like when a coach talks about what I should be getting out of a workout instead of just talking about how to do a movement.",
            "My favorite coach gives me tips on so many things I did not even notice I was doing wrong. He also asks how my body feels so that the workout can be scaled appropriately if needs be. Further mentions it when my form is perfect and celebrates when I PB. Also knows how to bring me out of a pain cave by hinting how I can break up a workout. Lastly, just random chats and laughs in between.",
            "My fave coach just exudes confidence and kindness. She makes sure to watch everyone do the motions and coaches on forms and movements and is sure to nicely call you out if your form needs improvement (by offering scales or modifications). \n\nShe’s easy going but serious. We always joke about how disappointing her is the last thing we want to do. We only want to make her proud haha",
            "Gives me corrections without me having to ask. \nEncourages me even when I am having the toughest day.\nComes up with cool progressions for when I was injured.\nCelebrates my wins and doesn't let me downplay them.",
            "Confident, kind, knows every individuals skill level at the gym, helps with nutrition, helps with motivation and mental health. The dude has literally changed my life. I am a completely different person and achieve goals even outside of the gym now.",
            "A good coaching to encouragement ratio, something like 90-10\n\nMost coaches are just time managing cheerleaders. CrossFit gets a bad rep for poor form but it’s 100% true. Posting videos of people rowing should be banned; it’s absolutely abysmal.\n\nI want to hear less “let’s go” and more “here’s how you should be doing this” instead.",
            "They get to know me as an athlete so they can push me and help me in a way that’s aware of my abilities and limitations",
            "I think the best coaches have given me a bit of gentle tough love. \n\nI can be a bit of an ego lifter, so I appreciate being told not to go heavier etc. I also appreciate when they tell me not to go lighter than x weight… they’ve observed my strengths and limitations, and know when to push."
        ]
    },
    "Newbie question. How to feel leg days if I can lift very little on cleans?": {
        "title": "Newbie question. How to feel leg days if I can lift very little on cleans?",
        "score": 6,
        "url": "https://www.reddit.com/r/crossfit/comments/1dqul7h/newbie_question_how_to_feel_leg_days_if_i_can/",
        "content": "Hello! I am aware this is a noob question, but in here I don’t feel so ashamed to ask.\n\nI am a woman, weight 125lb (56kg) and 1.54m (5’1”) tall. I’ve been going to the box 3-4 times a week for a year. I am able to decently do a 55lbs clean (25kg) in total (plates and bar combined). \n\nIn my box, leg days are mostly about cleans/clean squat. But since I am able to lift only the above weight, I don’t feel it so much like a “leg day”. My legs used to hurt much more when I trained with machines. Sadly, the routines in my box almost never include deadlifts. \n\nWe do have some DB lounges near the end, but usually including jumps or long running that make me so tired (cardio) that I don’t feel like I have energy left to lift heavy DBs. (EDIT: To be fair, there are also front squats. But I have to lift the bar from the ground as there are not enough racks, so same issue…)\n\nCan a newbie that does not lift much weight with her arms actually have effective leg days by doing CrossFit?\n\nI am aware my question might sound dumb. But I honestly don’t know :( I would love to read some of your experience or tips on this when you were just starting out. Thanks!",
        "num_comments": 15,
        "comments": [
            "This doesn't sound good. We have power / skill days as often for deadlifts / front squats / back squats as we do for cleans and snatches. \n\nIt's a totally different thing to deadlift 60kg than clean 25kg.",
            "A gym without enough squat racks isn't really a great gym. \n\nAre there any others in your area?",
            "I would steer clear of any box that has a specified day of the week as “leg day” and also considers cleans and maybe some db lunges the only exercises necessary to build legs. Your workouts should not be the same exercises on the same day for eternity. I could see maybe a 6 week rotation where you work on a particular skill or movement one of the days of the week but to forever have leg days with cleans makes no sense to me.",
            "you're basically not doing strength training if you're only squatting what you can clean and never deadlift. \n\ncleans are more about power than strength, so it's more like throwing a ball fast than picking up a heavy couch. \n\nPlus some of your energy goes to other stuff, like you said, you can't lift heavy after running. \n\n>Can a newbie that does not lift much weight with her arms actually have effective leg days by doing CrossFit?\n\nyes, but your coaches may not be programming for it. You'd get more of that burn if you did, like, deadlifts and sprints, and that could be a crossfit workout, but it sounds like that's not what your coaches are doing. \n\nNo idea why, though. If you never get to do heavy leg days then it's not well-rounded. Maybe they're focusing on something else right now but if you've been going for a year maybe they just don't like heavy leg days.",
            "Not a dumb question-I’d look at working with one of your coaches on the technique of your clean/Front squat (fs). I’d bet you can pull from the rig and fs more than 55#’s (with a proper warm up)-and with some timing and practice, you’ll be cleaning and power cleaning more weight. You can use dbells as well-or a sandbag/med ball for the same movement.",
            "How long have you been going there? It’s possible your programming is on a cycle and you will be on to different lifts soon. I’d ask your coach about it.",
            "You should be doing back squats, front squats, overhead squats, weighted lunges, DL, etc. regularly. If cleans are “leg day,” then your gym has poor programming.",
            "That sounds like an, let's call it interesting, box (the \"leg day\" and not enough racks). Why can't people share a rack? (We have 8 racks and class size is 10 max, so there are sometimes two pairs who share one barbell each). Or can you get there earlier to get a spot with rack? \n\nOr maybe try a drop-in in a different box, I have a feeling this one might not be a good fit for you. You sound like you want to progress but don't get the opportunity. \n\n(Also a clean should be a lot about explosive leg drive and less about arm strength so I'm also not 100% sure your coaches are coaching you well. As I said, I have a feeling you *want* to get better but I'm not sure the box is good for you...)",
            "Yes, I feel this is the case, seems like they don’t like heavy leg day. The more experienced guys (mostly men) seem like they “feel” the leg day… but they can clean 175lbs or more.\n\nI am thinking to skip the box on “leg day” Tuesdays and train on my own those days. I did not want to do that because I’ve heard it is better to stick to the program, but I feel like I am not progressing. And, the upper body is used so often that I feel that my upper body doesn’t recover fast enough, and I end up skipping Fridays.",
            "This is not going to fly well in a crossfit subreddit, but - one size fits all doesn't fit anyone very well. The classes aren't built for you. \n\nYou should shamelessly modify the programming, if nothing else as a way of learning to program for yourself. Nothing wrong with going to classes but you should tweak the program where you want to tweak it."
        ]
    }
}