{
    "Tutorial Tuesday : June 18 2024": {
        "title": "Tutorial Tuesday : June 18 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/CrusaderKings/comments/1diq33i/tutorial_tuesday_june_18_2024/",
        "content": "Tuesday has rolled round again so welcome to another Tutorial Tuesday.\n\nAs always all questions are welcome, from new players to old. Please sort by **new** so everybody's question gets a shot at being answered.\n\n\\---\n\n[Feudal Fridays](http://www.reddit.com/r/CrusaderKings/search?q=title%3A%22feudal+friday%22&restrict_sr=on&sort=new&t=all)\n\n[Tutorial Tuesdays](http://www.reddit.com/r/CrusaderKings/search?q=title%3A%22tutorial+tuesday%22&restrict_sr=on&sort=new&t=all)\n\n[Our Discord Has a Question Channel](https://discord.gg/CnT9p5c)\n\n[Tips for New Players a Compendium - CKII](http://www.reddit.com/r/CrusaderKings/comments/1s70y7/tips_for_new_players_a_compendium/)\n\n[The 'Oh My God I'm New, Help!'Guide for CKII Beginners](https://www.reddit.com/r/CrusaderKings/comments/25w95c/the_oh_my_god_im_new_help_guide_for_beginners/)",
        "num_comments": 15,
        "comments": [
            "What DLC that could help gaining legitimacy? I played vanilla, and never get problems to scale, but this legitimacy hindered me a lot, especially when playing the third character in my run. Even hunting and feasting dont help much.",
            "Does the legendary hunter lodge increase my global chance of legendary hunts, or do I need to hunt in the provnice it's in?",
            "What decides if my war for someone's duchy/kingdom claim will only take that duchy/kingdom or everything the duchy/kingdom owner possesses? I did a war for the Kingdom of Bohemia against the HRE and got everything the vassal king owned, but I want to do the same with the duchy of Angria and I don't get anything apart from the lands of Angria itself. Both wars are for someone else's claim.",
            "I just started playing CK3 this week. I think I'm too stupid for this game. I've watched tutorial videos, and I've played through the in game tutorial. I don't understand how to play this game but I want to. I've tried restarting two campains and I didn't get very far in either where it felt like there was nothing for me to do. All my counsel seats filled. No one to declare war with. Already scheming to win favor of the bishop who apparently hates me. But then I run out of money and it feels like there's nothing for me to do. \n\nI think I need to watch some playthrough videos and see what all the options do and when I'm supposed to choose them. This game got a 10/10 and I really want to experience what it has to offer.",
            "What's a good way to participate in a Great Holy War. I have only recently gotten into the 1066 start, but I've stayed focused on the northern vikings and Spain. What's a good start or ally to get pulled into a Great Holy War for the \"For The Faith!\" achievement?",
            "Any advice for playing in the area of Poland? More specifically I'm wanting to play as Prussia/Vidilist and make Lithuania because it's one of the first places I played in CK3 and just really struggled with because of the constant Norse raiders.",
            "If I hybridize two cultures with unique men at arms do I get to use both of them?",
            "Is there a way to get a family member as head of a mercenary company? Also is there a limit to how many holdings a holy order can have? Both Ck3 and Ck2 answers appreciated as I plan to play both.",
            "Legitimacy is such stupid shit. Let's force a mechanic on everyone but only allow the people that hand us extra money the ability to deal with it. If I don't have legends of the dead what am I genuinely supposed to do?",
            "When you press a claim for a title, you (or your claiment) gets the main title, if they are unlanded they will be given one county within the claim, and they inherit the vassals of the previous owner that are within the de jure borders of the title. I'm guessing what happened with Bohemia is the old king had vassals that owned land both within the kingdom of Bohemia, but also within the HRE in general. When you won the war, by inheriting those vassals, you also got some land outside of Bohemia. For the duchy of Angria, the previous owner either had no vassals, or their vassals had no land outside of the duchy. The larger a title gets, the worse the AI gets at managing which vassals belong to which ruler, and it gets harder to manage yourself, as your vassals with nice borders go off conquering internally and externally on their own."
        ]
    },
    "Dev Diary #149 - Administrative Government (Part II)": {
        "title": "Dev Diary #149 - Administrative Government (Part II)",
        "score": 545,
        "url": "https://pdxint.at/3XlV10Z",
        "content": "",
        "num_comments": 199,
        "comments": [
            "Can't wait to field 75 different regiments of palatini against the mongol horde",
            "Really tough to evaluate all this without playing it - I can grasp the overall shape but will have to wait and see how it feels when the DLC releases. Am really curious about the scheme overhaul...\n\nIs there any confirmation if Administrative Government is part of the free update or locked behind the DLC?",
            "Oooh baby, the imperial men-at-arms system is looking spicy, not to mention the administrative part!",
            "WOW this dev diary is loaded. Forget landless gameplay, pump this vassal gameplay right into my veins. One thing I appreciate a lot about crusader kings is how well it simulates an entire world, and it's been always a shame that vassals basically almost do nothing expect fabricate claims and join factions. These new features remind me a lot of the noble clans in Feudal Japan who spread their influence everywhere and control the empire from behind the scenes. I feel like now that'll be much more possible in crusader kings so I'm really looking forward to it. Conceptually, I think they really did a great job on this and improved on the merchant family gameplay from ck2. I've been pretty pessimistic about ck3 as a whole recently but if this new update radically transforms the vassal gameplay, it would really make that whole bundle worth buying for.",
            "Not gonna lie, I don't know enough about the organisation of the Byzantine Empire to know if this is an accurate depiction of its machinations or not. But all of the things that I read about administrative government are basically the stuff that I wanted playable republics to be.\n\nSo despite my initial reservations regarding the DLC (sorry but I'm still not interested in playing as the BE) I'm pretty hyped now. Finally I'll be able to turn Germany into the bureaucratic monstrosity it's supposed to be!",
            "Reading this while relaxing in a Spa. Life is good 😎",
            "The theme system looks like a lot of fun. I think it will be more fun to play as a vassal than an emperor with this set-up. \n\nI wonder if you can set up a feudal realm within an administrative realm. Historically, this sort of (re)patrimonialization was a huge problem for empires that manage to rise past feudalism. Can a governor conquer new territory outside his theme and make it a hereditary fief? Probably not, but it would be cool.\n\nI have to say that I'm surprised by the people who object to the extra game rules. It literally costs you nothing and they start off by default. What are these people complaining about?",
            "I can't believe it... they're cooking.",
            "I’m really excited so far for this dlc",
            "The military system seems great, I think the only thing I'd like adding is if the AI governors could straight up refuse to let you use their troops if they hate you but aren't rebelling and if the troops would not necessarily always join them unless personally loyal if they do rebel (as they don't belong to them)"
        ]
    },
    "My average CK3 game": {
        "title": "My average CK3 game",
        "score": 101,
        "url": "https://www.reddit.com/r/CrusaderKings/comments/1dlpxyu/my_average_ck3_game/",
        "content": "Starting a new game: “Alright, we’re not gonna map paint this time. We’re gonna take a single kingdom, play tall, and really RP. No save scumming, whatever happens, we live with it.”\n\nBy my third Ruler: “Well, we’ve got some good traits going and we’ve acquired our kingdom. BUT we also picked up some extra lands along the way and confederate partition means this is all gonna get blown up. I think I need to make sure my heir gets a smooth transition. Better conquer some more lands so I can hand them out.”\n\n“Well now I’m able to vassalize several duchies. It’d be silly not to, right?”\n\n“Okay, well, I gotta keep this in the family, so I guess I should form an empire.”\n\n“Fuck I own half of Europe, I guess we’re map painting.”",
        "num_comments": 17,
        "comments": [
            "Me when i accidentaly create an empire encompassing Jerusalem, Arabia, Georgia, half of Anatolia and Egypt.",
            "it's just too hard to resist not restoring the Roman Empire",
            "I tried getting back to the game a few months ago but map painting is not my thing and unfortunately there is not much to do in this game apart form that. I had fun until i united the British isle but then what? Go on hunting and tournaments",
            "My most recent save started with me deciding to be the humble Petty King of East Anglia. \n\nThen I figured I might as well unite all Angles under the Kingdom of the Angles. \n\nNext thing I know, I'm king of Aquitaine \n\nThen I'm king of Navarre.\n\nNow it's the Empire of Aquitaine. \n\nSo much for that idea.",
            "Ig the 7 deadly sins woud be games then ck woud be greed",
            "Get a mod for primo so you don't feel the need to keep conquering or just get inherichance",
            "Same happened to me in my last game. \"Let's be a nice vassal as the Abbasid -whoops I own all of Persia without attacking anyone\"",
            "idk for me inherichance really helps",
            "I was really enjoying a tall Kingdom of Frisia game, really high development, fighting off vikings, intriguing my way into neighboring thrones....and then I noticed the Bavarian Empire (ruled by a dynasty member) had turned into the HRE and my heart sank because I knew that i would somehow end up holy roman emperor, and sure enough after the Emperor was murdered by his lover's husband, I was chosen to inherit the realm...",
            "Literally me today - was playing as a happy little Swedish duchess, and suddenly I came in #1 in a successful crusade, so it'd be silly not to play as my daughter in that, right? And now I'm doing a Rome run."
        ]
    },
    "Weakest Gengis Khan I've ever seen lmao": {
        "title": "Weakest Gengis Khan I've ever seen lmao",
        "score": 56,
        "url": "https://i.redd.it/iseznmeoi38d1.png",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Genghis Khan't.",
            "Probably fell off his horse.",
            "This would probably cause me to reload. I love seeing the Mongols get big and eventually take them down.",
            "Got spawn skilled",
            "When does gengis spawn?",
            "Smells lile stress"
        ]
    },
    "I just realized that Magnus Haroldsen, son of the 1066 King of England, has a pretty interesting backstory behind him.": {
        "title": "I just realized that Magnus Haroldsen, son of the 1066 King of England, has a pretty interesting backstory behind him.",
        "score": 393,
        "url": "https://i.redd.it/xpr6o9il508d1.png",
        "content": "",
        "num_comments": 14,
        "comments": [
            "R5: Magnus Haroldson is the son of the 1066 start date's King of England, Harold II.\n\nAfter the defeat at Hastings, in which Harold II was killed, Magnus and his brothers found refuge in Ireland. However, they were unable to regain the throne of England lost by their father. In 1069 Magnus travelled to Denmark to enlist the help of the king there against the Norman conquerors of England. In his travels he also visited the southern coast of the Baltic Sea. The Polish Duke Boleslaw the Bold did not take part in the expedition, but allowed the Polish nobles of Pomerania to do so. The Danish king agreed to help the brothers. A Danish fleet and its allies set sail for England. According to the chronicler Orderic Vitalis (generally reliable), the Danes and English allies included Poles, Frisians, Saxons and Polabians/Veletians.\n\nAfter an unsuccessful expedition, Magnus again found himself in Poland. In 1074, his sister Gytha of Wessex married the Ruthenian prince Vladimir Monomakh. The only source mentioning him at that time is the 'Polish Chronicle' by Gall Anonymus. The Venetian monk mentions Magnus under the year 1093. He mentions him as Count of Wrocław, who by virtue of his function was subordinate only to the palatine and the prince.\n\nAnd indeed, in 1093 there was a revolt in Silesia. Magnus, now being the Count of Wrocław, subordinated himself to Zbigniew, Duke of Masovia. Around this time, he became associated with the powerful family of the Awdans (themselves of Scandinavian descent, but that's for another thread), who in 1093 supported Zbigniew against Sieciech, his heir presumptive vying for the throne. In 1097, the Awdans switched sides, and allied themselves with his younger brother Bolesław Krzywousty. There are basically zero sources on the role played by Magnus during this civil war. It is presumed he was trying to stay off-the-radar and not gain the ill will of any side in the conflict.\n\nAfter the conflict, Bolesław Krzywousty granted Magnus the title of *żupan* of Mazovia (essentially a person who co-ruled the Duchy with him). From then on, he resided in the Czersk castle. His tasks included protecting Mazovia from invasions by the pagan Pomeranians. Magnus also supported Bishop Simon of Plock. He co-financed the construction of a Romanesque temple at Czersk Castle. Magnus died sometime after 1109. (the exact date is not known).\n\nIn 1966, archaeologists discovered a medieval grave near the Romanesque temple at Czersk. They found an iron-covered coffin inside which was the skeleton of a man with a sword and spear. At his feet were two bronze bowls and a wooden bucket, which was a theme also found in Scandinavian customs at the time. The positioning of the body was indicative of a knight (he died wearing a golden ring on his left hand, and complete dentition was preserved in the skull) The age of the buried person was determined to be 55-60 years, height 1.80 m. There is a very high probability that this is the grave of Magnus Haroldson.\n\nThere is in fact also a village named Magnuszew near Czersk, where he died. It is said he is the namesake (and founder) of this village, as it was first mentioned during his reign, and the fact that Y-DNA haplogroup I1 subclades I1-ASP and I1-T2 (both of which are originally found in England and Denmark) have a much higher frequency in families who live in/near the village compared to the rest of Poland.\n\nTwentieth century historians also believed that he was father of one Włost, who himself was the father of Piotr Włostowic, voivode of Duke Bolesław III Wrymouth (nephew of Bolesław II) and progenitor of the Łabędź clan.",
            "This is completely untrue as I personally imprisoned and executed everyone in House Godwin in my William the Bastard playthrough",
            "I love learning these backstories about these characters. I had an idea for a custom dynasty after looking up the House name for a ruler I had in EU4 but come to find out it was a real house and that it's also in CK3. House of Courtenay had Branches in France, England, and even in the Holy Land ruling over Crusader States such as the Latin Empire, Principality of Galilee and the County of Edessa. It almost makes me want to play as that Dynasty sometime and try to take over all of France...",
            "Doesn't really sound like a craven to me",
            "Man, I can't wait for Roads of Power to roleplay this man. They should make an achievement that is basically being the king of Poland and England as Magnus Haroldson or his descendant.",
            "His sister has a pretty interesting history as well. Somehow, she ended up married to the Grand Prince of the Kievan Rus. Her descendents eventually married their way back to England, so the current house of Windsor are the descendents of both William the Conquerer and Harold Godwinson.",
            "The last of 'Wessex' is also pretty interesting, Eadgar, he starts as an Earl of Warwickshire but I'm wondering if he'll start as a wanderer when unlanded comes, would be very cool to restore House Wessex from nothing.",
            "Now I wanna play as him when landless play is allowed",
            "Very interesting, thanks OP!",
            "Some additional fun facts:\n\n1. He is likely the reason why there is a wyvern on the [coat of arms of Mazovia](https://en.wikipedia.org/wiki/Magnus,_son_of_Harold_Godwinson#/media/File:Chor%C4%85giew_Mazowsza.svg), despite the motif not being present in Slavic or Polish mythology whatsoever.\n2. The Łabędź clan's coat of arms features a swan, and the word itself means swan in Polish. Magnus' mother's (and ergo, Piotr's paternal great-grandmother's) name, *Ealdgȳð Swann hnesce*, meant \"Edyth the Gentle Swan\". Coincidence? Probably."
        ]
    }
}