{
    "Moon Week 50": {
        "title": "Moon Week 50",
        "score": 40,
        "url": "https://www.reddit.com/r/CryptoCurrency/comments/1dngdfu/moon_week_50/",
        "content": "Hello everyone and welcome to Moon Week for round 50 of Moons! For more information about Moons, please [see our wiki page here](https://www.reddit.com/r/CryptoCurrency/wiki/moons_wiki). **Make sure to read the full post as Moon Week 50 is special.** \n\nWe are using Snapshot for voting directly with the Moon balance in your wallet, in a transparent and open manner. For now all Moons held in self-hosted wallets at the time of poll creation will be eligible to vote, so if you are holding Moons on an exchange, the telegram TipBot or in a wallet that you are not comfortable connecting to snapshot then please be sure to transfer your Moons to a self-hosted wallet that you are comfortable connecting to snapshot before each Moon Week. You can [see our schedule here](https://calendar.google.com/calendar/embed?src=i0e5as6q033nruqck5c9nfk24k%40group.calendar.google.com).\n\nTo give exposure to our governance polls for the month, this Moon Week post will remain pinned to the top of the subreddit until next Monday. **Please review the following important information first:**\n\n* Successful polls are implemented whenever the responsible party has a chance to do it. Usually this is within days or weeks of the poll passing, but depends on workload, priorities, and complexity of implementation. You can look at implementation status on [the CCIP list.](https://docs.google.com/spreadsheets/d/1LhhqB4UAezNMdAwjV3evFXPD2x1JFCFHdnm8rmyRqAE/edit?usp=sharing)\n* In the event of incompatible polls passing, the poll with more Moons voting in favor will be considered the winner and the other will not be implemented.\n\n# Governance Polls\n\nHere's your poll(s) for this round of Moons. You can view [the full CCIP list here](https://docs.google.com/spreadsheets/d/1LhhqB4UAezNMdAwjV3evFXPD2x1JFCFHdnm8rmyRqAE/edit?usp=sharing).\n\n* [CCIP-089 - Make high quality Image Posts a Benefit of Special Memberships](https://www.reddit.com/r/CryptoCurrencyMeta/comments/1dcp9vp/proposal_make_image_posts_a_benefit_of_special/) [(Snapshot direct link)](https://snapshot.org/#/cryptomods.eth/proposal/0x6fcc358f650cc7056395c8f16697d535b6b7fbf834e8541954f5e0dc60b8fa59)\n* [CCIP-090 - Grant of 20k Moons to rickribera93 for contributions to Moons and Community Points ecosystem](https://www.reddit.com/r/CryptoCurrencyMeta/comments/1dhl029/proposal_grant_of_20k_moons_to_urickribera93_for/) [(Snapshot direct link)](https://snapshot.org/#/cryptomods.eth/proposal/0x05abea5c49d55871788b48a774f01392409f0b98d3d5e026a0d4dc467c2f68c5)\n* [CCIP-091 - Adopt CCMOON DAO Constitution ](https://www.reddit.com/r/CryptoCurrencyMeta/comments/1dnfwl2/proposal_adopt_ccmoon_dao_constitution/)[(Snapshot direct link)](https://snapshot.org/#/cryptomods.eth/proposal/0x9092a232311d2dd110a22b0e2824cdadbf1f1dfbde53ffa444aa6455a1119362)\n\n* [CCIP-092 - Resume MOON Distributions to rCryptoCurrency](https://www.reddit.com/r/CryptoCurrencyMeta/comments/1dng1uz/proposal_resume_moon_distributions_to/)[ (Snapshot direct link) ](https://snapshot.org/#/cryptomods.eth/proposal/0x66fb3c9993a6b102f1ebab96753ae8523b41d0d07e9b7cf2dd0c55ec7e9f36fe)\n\n# Previous Polls and results\n\n* \\[Failed\\] [CCIP-087 - Abandon all CCIPs related to karma calculation for distributions](https://www.reddit.com/r/CryptoCurrency/comments/1d293z7/ccip087_abandon_all_ccips_related_to_karma/) ([Snapshot direct link](https://snapshot.org/#/cryptomods.eth/proposal/0x19f32e28862cdce2c7caeecb18856f914b39a7d3cceea7b91104f9982021e15a))\n* \\[Passed\\] [CCIP-088 - Remove only the complicated and obsolete karma calculations, keep only the urgent and essential CCIPs we need from day 1](https://www.reddit.com/r/CryptoCurrency/comments/1d294m6/ccip088_remove_only_the_complicated_and_obsolete/) ([Snapshot direct link](https://snapshot.org/#/cryptomods.eth/proposal/0x945906c52c4150297b395f1f009d8f64ac06e949deadbd0f2cc9da84f75fae26))\n\n----------\n\n**Moon Week 50 marks the start of users once again being able to earn Moons for Karma (assuming all goes well in our implementation and Snapshot votes\\*) with the first distribution expected around July 29th for Karma earned between the Moon Week post on June 24th and the Moon Week post on July 22nd.** \n\n*\\*Mods will do their absolute best to implement distributions in the above timeline. However distributions are not officially back until distributions actually occur.* \n\n**Get your fingers warmed up and lets review three of most commonly missed rules users make when posting:**\n\n* **2.4: Text posts with less than 500 characters will be removed and redirected to the daily discussion thread.**\n* **2.6: No reposting of duplicate or similar content whether it's news articles or text-posts. Duplicate content cannot be re-posted for a minimum of one month.**\n* **5.9: Questions and discussions which only belong in the daily discussion thread include: \"rate my portfolio\", \"what coin should I buy?\", “shill me a coin\", \"low-market cap coins\", self-stories, etc.**\n\n**Prices of rCC Special Memberships will be updated soon.** ",
        "num_comments": 165,
        "comments": [
            "Ah shit! Here we go again...",
            "Incredible how far we've come since Reddit ditched us. We will be more resilient than ever with the community controlling the future of Moons. \n\nThank you Mods for all your hard work. It's certainly paying off. Let us know if there's anything in specific the community can help with.",
            "Do we still get the shower cap for voting?  I voted for the first time in a bit and am still mostly dedicated to lurking, but I like the shower cap.",
            "Is it still a thing? I thought reddit discontinued it.",
            "Time for the shit posters to crawl back out of the woodwork.\n\n\"Hi guys welcome to the new daily!  We made it!!! What's ur favorite crypto 👀?!?\"",
            "Dumb question but same moons as before or new moons?",
            "Moons to the moon baby!",
            "Thanks for the snapshot direct links. This makes voting so much easier for those of us with limited time who need a TL;DR on the whole processes.",
            "what a time to be alive",
            "To the Moon (again)?  😃"
        ]
    },
    "Daily Crypto Discussion - June 29, 2024 (GMT+0)": {
        "title": "Daily Crypto Discussion - June 29, 2024 (GMT+0)",
        "score": 12,
        "url": "https://www.reddit.com/r/CryptoCurrency/comments/1dqy1ut/daily_crypto_discussion_june_29_2024_gmt0/",
        "content": "**Welcome to the Daily Crypto Discussion thread. Please read the disclaimer and rules before participating.**\n \n***\n&nbsp;\n    \n###Disclaimer:\n\nConsider all information posted here with several liberal heaps of salt, and always cross check any information you may read on this thread with known sources. Any trade information posted in this open thread may be highly misleading, and could be an attempt to manipulate new readers by known \"pump and dump (PnD) groups\" for their own profit. BEWARE of such practices and exercise utmost caution before acting on any trade tip mentioned here. \n\n\n**Please be careful about what information you share and the actions you take.** Do not share the amounts of your portfolios (why not just share percentage?). Do not share your private keys or wallet seed. Use strong, non-SMS 2FA if possible. Beware of scammers and be smart. Do not invest more than you can afford to lose, and do not fall for pyramid schemes, promises of unrealistic returns (get-rich-quick schemes), and other common scams.\n    \n***\n&nbsp;\n    \n###Rules:\n\n  - All [sub rules](https://www.reddit.com/r/CryptoCurrency/about/rules/) apply in this thread. The prior exemption for karma and age requirements is no longer in effect. \n  - Discussion topics must be related to cryptocurrency.\n  - Behave with civility and politeness. Do not use offensive, racist or homophobic language.\n  - Comments will be sorted by newest first.\n  \n***\n&nbsp;\n\n###Useful Links:\n\n  - [**Beginner Resources**](https://www.reddit.com/r/CryptoCurrency/wiki/beginner_resources)\n\n  - [**Intro to r/Cryptocurrency MOONs 🌔**](https://www.reddit.com/r/CryptoCurrency/comments/gj96lb/introducing_rcryptocurrency_moons/)\n\n  - [**MOONs Wiki Page**](https://www.reddit.com/r/CryptoCurrency/wiki/moons_wiki/)\n\n  - [**r/CryptoCurrency Discord**](https://www.reddit.com/r/CryptoCurrency/comments/kth255/join_the_crypto_currency_discord/)\n\n  - [**r/CryptoCurrencyMemes**](https://www.reddit.com/r/cryptocurrencymemes)\n\n  - [**Prior Daily Discussions**](https://www.reddit.com/r/CryptoCurrency/search?q=title%3A%22Daily+Crypto+Discussion+-+%22+&restrict_sr=on&sort=new&t=all) - (Link fixed.)\n\n  - [**r/CryptoCurrencyMeta**](https://www.reddit.com/r/CryptoCurrencyMeta/) - Join in on all meta discussions regarding r/CryptoCurrency whether it be moon distributions or governance.\n\n***\n&nbsp;\n\n### Finding Other Discussion Threads\n\nFollow a mod account below to be notified in your home feed when the latest r/CC discussion thread of your interest is posted.\n\n* u/CryptoDaily- — Posts the Daily Crypto Discussion threads. \n\n* u/CryptoSkeptics — Posts the Monthly Skeptics Discussion threads.\n \n* u/CryptoOptimists- — Posts the Monthly Optimists Discussion threads.\n\n* u/CryptoNewsUpdates — Posts the Monthly News Summary threads.",
        "num_comments": 167,
        "comments": [
            "I just can't bring myself to buy memecoins, even tho some of them have amazing gains.",
            "Fear and greed index at 30 again. Let's do sub 30 soon!",
            "congrats to everyone for surviving a red Q2",
            "Bitcoin holding on for dear life. We’ve gotten nothing but good news for the markets the last few months. CPI, core PCE trending in the right direction. “Loose” monetary policy. We need Bitcoin buybacks, so we can go up everyday like the NASDAQ.",
            "Is Crypto dead on Reddit? It feels like it will never be like 2021 here, it seems people have moved on to other platforms for their needs",
            "Bought some HAWKTUAH on Solana.\n\nwhile the meme is still hot.",
            "Which is the best DEX to buy moons?",
            "So the SEC dropped their case against Ethereum/Consensys only to sue them again? Did I get that right?",
            "So I've read an article that in july bitcoin goes up double digits based on historical data. Is that true? Can we end this bloodbath?",
            "Coinbase Derivatives Files with CFTC to List Regulated Futures for $DOT, $SHIB, $LINK, $AVAX and $XLM\n\nThese are also the coins that will be next for an ETF imo"
        ]
    },
    "We analyzed 54,177 collection pages on OpenSea and found that 76% of the top pages are spam": {
        "title": "We analyzed 54,177 collection pages on OpenSea and found that 76% of the top pages are spam",
        "score": 44,
        "url": "https://guerrillabuzz.com/opensea-spam-crisis-seo-analysis/",
        "content": "",
        "num_comments": 16,
        "comments": [
            "Only time I've ever used OpenSea was when I went in on Gen3 Reddit avatars. Never again. I'm just not an NFT guy.",
            "tldr; A study by GuerrillaBuzz analyzed 54,177 collection pages on OpenSea, revealing that 76% of the top collection pages are spam, exploiting OpenSea's domain authority for SEO gains. Out of 522 high-traffic collection URLs analyzed, 401 were identified as spam. This issue indicates a lack of effective moderation and poses risks to OpenSea's reputation and the security of its visitors. The study suggests implementing a spam filter, making the report option more visible, encouraging community reporting, and allowing only verified users to add bio links as potential solutions.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.",
            "Am i the only one that never used open sea?",
            "The majority of spam is coming from the U.S., with the second most from India.",
            "The worst part is that the remaining 24% are NFTs...",
            "Fake report, it should be 99%",
            "OpenSea sucks, it's a dirtbin and because you can mint costfree it keeps filling the blockchain with dirt.",
            "what's the other 24%, malware?\n\nor 76% spam 24% scam",
            "As someone who made a lot of money on trading nfts, that number should be way higher",
            "I think I sold my $10 avatar for $16 or something. Follow me for financial advice."
        ]
    },
    "Crpyto gaming needs a lot of change to become mainstream ": {
        "title": "Crpyto gaming needs a lot of change to become mainstream ",
        "score": 20,
        "url": "https://www.reddit.com/r/CryptoCurrency/comments/1dr6igh/crpyto_gaming_needs_a_lot_of_change_to_become/",
        "content": "The few usable crypto games seem that are nothing but a grindfest. We you do that same thing over and over trying to make money.\n\nWe should be able to enjoy the game while forgetting that we are using crypto-related mechanics.\n\n**We love the ideia of selling comestics as NFT's is good, but that can't be the main core of the game!**\n\nTo fix this problem the dev team could introduce crypto gaming mechanics gradually, rather than forcing them on players from the start. Having content a story instead of only grinding. A game could introduce crypto related features as players progress.\n\nCreating a good game cost a lot of money and time. And crypto games will only be a part of industry if crypto either helps to reduce costs or making the game more interesting.",
        "num_comments": 67,
        "comments": [
            "Players don't want the ownership of the in-game assets, the just want to have the fun experience.",
            "The game always has to come first and crypto second. Probably even third or last.",
            "For example actually playable games that are fun to play, and that aren't focused on \"earning\" money.",
            "Crypto may be a thing for decentralized gaming - but not for the highly gaming mainstream industry.",
            "They should focus on bringing crypto into existing games that people play daily so that it can get more attention and adoption",
            "The only reason I play crypto games is for the sake of airdrops, otherwise no no. My guess is that we will only see a successful crypto game when two things happen: 1. Onboarding of big AAA players; 2. Dettachment from the NFT and crypto terminology, that is, pretty much like the \"avatar\" thing of reddit. Too much bias around the terms we have nowadays",
            "Most games are for profit and trying to get people to pay to not grind.  Most are bad games. The power of crypto gaming is not a capitalistic game. It is about creating community focused games that allows MMO players to vote on buffs and skins and stuff through snapshot. It is about democratizing the game more so than profiteering the game. It gives power to the players and allows them to vote and be engaged in the game. No game that allows you to pay to win is a good game and any game that focuses on that is going to be bad.",
            "God's unchained and guild of guardians do it pretty well.",
            "There’s no real Crypto Currency Game out there. At the end you pay more than you earn.",
            "Crypto gaming just never going to be a big thing. Gamers hate micro transactions, crypto would just take this to the next level of intolerability. Gamers and general public despise NFTs and if a mainstream game released with them, it instantly be shit on, laughed at, and doa. Also companies don’t want to give you ownership of your items outside their ecosystem and marketplace. They want to sell you the items or make you be in game to earn them. They don’t want you to be able to buy from someone else. You have been able to buy in game items with real money on secondary markets forever and they are all against TOS for the games. It just about not getting caught."
        ]
    },
    "Kraken founder Jesse Powell donates $1 million to Donald Trump": {
        "title": "Kraken founder Jesse Powell donates $1 million to Donald Trump",
        "score": 1084,
        "url": "https://www.theblock.co/post/302455/kraken-founder-jesse-powell-donates-1-million-to-donald-trump?utm_source=rss&utm_medium=rss",
        "content": "",
        "num_comments": 546,
        "comments": [
            "Once a Redditor told me: \"US is made for business, not for people\" after that I understood each one of the decisions happening there.",
            "hey guys bribery is legal now, so its all cool",
            "I thought people in crypto were supposed to be good at detecting scams?",
            "Donating to a billionaire? Yeah right",
            "Whelp. There goes any respect I had for Jesse Powell.",
            "Really, well, time to close my account there..",
            "Wonder what regulations he hopes are rolled back for that",
            "Trump's love for crypto grows everytime he gets these donors",
            "That's a waste of 1 Mil.",
            "Noted.  That's one way to alienate 1/2 your users."
        ]
    }
}