{
    "Resume Advice Thread - June 29, 2024": {
        "title": "Resume Advice Thread - June 29, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1dr5btx/resume_advice_thread_june_29_2024/",
        "content": "Please use this thread to ask for resume advice and critiques. You should read our [Resume FAQ](https://www.reddit.com/r/cscareerquestions/wiki/faq_resumes) and implement any changes from that before you ask for more advice.\n        \nAbide by the rules, don't be a jerk.\n        \n**Note on anonomyizing your resume:** If you'd like your resume to remain anonymous, make sure you blank out or change all personally identifying information. Also be careful of using your own Google Docs account or DropBox account which can lead back to your personally identifying information. To make absolutely sure you're anonymous, we suggest posting on sites/accounts with no ties to you after thoroughly checking the contents of your resume.\n        \nThis thread is posted each **Tuesday and Saturday at midnight PST**. Previous Resume Advice Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Resume+Advice+Thread&restrict_sr=on&sort=new&t=all).",
        "num_comments": 1,
        "comments": [
            "Hi everyone, I recently launched a new job board here: [benture.io](http://benture.io) which you can also create your custom CV for free. Here's a example CV: [benture.io/cv/einstein](http://benture.io/cv/einstein)\n\nAny feedbacks are welcome. ❤"
        ]
    },
    "Daily Chat Thread - June 29, 2024": {
        "title": "Daily Chat Thread - June 29, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1dr5d33/daily_chat_thread_june_29_2024/",
        "content": "Please use this thread to chat, have casual discussions, and ask casual questions. Moderation will be light, but don't be a jerk.\n\nThis thread is posted **every day at midnight PST**. Previous Daily Chat Threads can be found [here](https://www.reddit.com/r/cscareerquestions/search?q=Daily+Chat+Thread&restrict_sr=on&sort=new&t=all).",
        "num_comments": 0,
        "comments": []
    },
    "Don't give up!! How I landed a job in 1 month.": {
        "title": "Don't give up!! How I landed a job in 1 month.",
        "score": 675,
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1dqoaa9/dont_give_up_how_i_landed_a_job_in_1_month/",
        "content": "I am writing this for the people who are feeling discouraged about the job market as I know I felt. I am a new grad with a B.S. in Software Engineering who was lucky enough to be able to find a job after only a month of searching.\n\nHow did I do this?\n\n1. I searched for jobs **locally**. I feel like people get stuck looking for exclusively remote jobs. I applied to remote jobs too, but with very little success. The ones that responded the most were the ones that I found locally. I live an hour from a major city in the northeast, so I made sure to look for companies near and around the city as well as near me.\n2. I searched for jobs **directly on company websites**. Oftentimes, I found that companies near me - especially smaller ones - did not post their jobs on major websites like LinkedIn or Glassdoor. I highly recommend searching company websites in your area. I googled “tech companies near me”, “largest employers near me”, “healthcare companies near me”, etc., went down lists of companies and and went to their company website.\n3. I submitted a **cover letter for every application**. I used the same cover letter template for nearly all the jobs I applied to and changed a few sentences based on the company's mission statement/position. \n4. I searched for **new job postings daily**. On LinkedIn, Glassdoor, Otta, Google jobs, and the company websites of companies that I was most interested in around my area I searched for the keywords \"new grad, associate, junior, intern, internship, entry-level\". Be careful of scams! \n5. I included **keywords** from job postings in my **resume**. I made sure to only include keywords of areas that I could show that I had experience in and bolded them. I also made sure to add them to my LinkedIn skills.\n6. I searched for jobs in tech **outside of my area of expertise**. Instead of applying to just \"software engineer, developer, full-stack, front-end, back-end\" positions I also searched for positions adjacent to software but still in tech. \"Data analyst, Business analyst, IT, Programmer Analyst, Computer Engineer, etc.\" Beggars can’t be choosers!\n7. I **cold-called** companies and recruiters in my area. If there was a company I was particularly interested in I would ask to connect on LinkedIn with a note saying \"Hi there \\[name\\], I am extremely interested in working at \\[company\\]. It would be great to connect for a 10-minute chat to see if I might be a good fit. I am looking for a role in \\[tech area\\]. Please let me know if there is someone else on your team I should reach out to instead!\"\n8. I **connected with recruiters** from companies that I **already applied to**. I went on LinkedIn, searched the company, went to the company page, went to “people” and searched the keywords “recruiter, recruiting, talent, acquisition, early career, career, people”. Then I changed the location to my area. If I found someone, I sent a connection request with a note stating that I applied to a role and was looking to learn more about the company/role. If no recruiters were in my area, I would message a recruiter from a relatively close area and ask if they could connect me to someone in my area.\n\nOverall, I applied to 93 jobs over 1 month and had 17 rejections. I tried to apply to 5-10 a day, some days with less success than others but I made sure to keep track in an Excel document. This past week I had 3 successful interviews with two offers and landed a remote Data Analyst job at 70k. I realize I am very lucky, but I hope this might help someone else or encourage them to keep going! Don't give up.\n\nEdit: Since people have asked, \nhere is an anonymized version of my cover letter: https://online.publuu.com/567008/1273562\n\nEdit: And here is an anonymized version of my resume: \n                https://online.publuu.com/567008/1273679\n\nEdit: Added to #8 and #2\n\nEdit: Thank you all for the positive comments and awards! I’m glad I could help some people on their journey. \n\nEdit: To the people that are saying to #6 “*THiS iS BAd AdVICe FOr pEoPLe wHO WAnT a SWE JoB*”, I’m sorry, but you are *totally* misguided. **Any experience** is better than no experience. You can always leverage skills from similar jobs, personal projects, and certifications towards the job you want in the future. Getting your foot in the door when you’re fresh out of college is *far more important* than waiting months and months for the “right” job, leaving you with large gaps in your resume - **especially** in this job market. There are *many many* jobs without the title SWE that require programming. Experience comes with time. Don’t listen to people who tell you otherwise and don’t listen to people who put down non-SWE jobs/careers. This is attested by my professional mentors. 😊 Rant over, thanks!",
        "num_comments": 180,
        "comments": [
            "Thank you and congrats! For #8 how often did you actually get responses, especially positive ones? I would feel so obnoxious doing that but if it works maybe I'll try it out.",
            "Heyooooo, i got a data analyst position too.\n\nHowever it did take me 8 months.",
            "Cold-calling is so underrated. My wife and I both got our current jobs in our respective areas of expertise by cold applying to companies not actively hiring.\n\nSomething to consider is that a need can exist in an organization for quite a while before any active recruitment occurs. Any time you find yourself saying \"this place seems awesome, it's a shame they aren't hiring\" try reaching out! Gumption is back, baby!",
            "Congrats! Like others have mentioned, you’re not lucky - you worked harder and put in more effort than others. You deserve it!",
            "I think applying on company websites might actually super useful advice. I heard back from ibm and Accenture both within a week of applying to positions directly from their website. I think maybe some of those listings don’t make it to the job boards or they don’t go viral on the job boards atleast. Like when you just go on LinkedIn everyone sees the same stack of jobs so the first hundred jobs you see, everyone has also seen them and applied to them.",
            "Can you post your resume too?",
            "Hey, I really resonate with your post. I am a new grad with a B.A.S. in Computer Engineering degree from a T10 Canadian university. I was hoping we could connect as I am going through something very similar and would really appreciate your advice.",
            "Wait, you're saying if you put effort in and don't just apply for LinkedIn quick apply full remote jobs you have more success? That can't be right..",
            "This may be a dumb question, but how did you search for jobs locally?",
            "Thank you for this OP 🙏🏽"
        ]
    },
    "Paid internship now unpaid for 'poor performance' (mostly BS claim)": {
        "title": "Paid internship now unpaid for 'poor performance' (mostly BS claim)",
        "score": 29,
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1dr3s0g/paid_internship_now_unpaid_for_poor_performance/",
        "content": "I interned at a medium-size tech company that seemed great at first. My coworker was nice, and my supervisor was helpful. The first month was great. People in the team praised me for my performance. I did better than expectation, which was already high due to what I said in the interview. Anyone looking from the outside would say I'll definitely get an offer.\n\n\nThe second month was rough because I had a personal problem and was burned out. My performance was OK at first (still better than average intern), until I got a big job. It was an experiment that they planned to use in their projects if it worked. I was **solely** in charge of this experiment. I know I'm great at what I do, but that's little bit too much for a new grad student. I'm still doing it because I thought internships were mainly for learning and that my team knows how rough it is. My supervisor even said \"take your time.\"\n\n\nI've been doing this experiment for a month. By the time it's finished, it's almost time for HR to evaluate me before the internship end. When the evaluation came, I got fucking slammed by EVERYONE.\n\n\nSupervisor: He didn't communicate with the team (I'm solely responsible for this? And besides senior, everyone seems to have no clue on how to do it) and I didn't expect him to take this long (You said \"take your time\" to me?). It took my team only half a day to find out it won't work (I found that limitation in one hour. It works because there's a workaround, your team is just lazy to make it work).\n\n\nCo-worker 1: You lack ambition that you were having. I also saw you browsing other things during work hours (while he was browsing Reddit during work hours, hello are you also reading this?)\n\n\nCo-worker 2: You were better than me when I were an intern. You finished work that I took 1 month within a week. Then, you \"disappeared\". I don't get it. (Of course, the experiment was harder than anything that I've heard that you got)\n\n\nHR: Seems like you have a lot of communication issue and lack of ambition that you were having. I expected more from you. This is below standard for one month.\n\n\nAlright, I'm definitely not getting a return offer. That's heartbreaking but fine. Until...\n\n\nHR: Everyone except you and the supervisor leaves the room.\n\n\nEveryone leave the room.\n\n\nHR: You won't be paid this month. I hope you understand that based on your performance, you didn't do enough work to justify payment. Do you have any objections?\n\n\nIt's clear that I won't get paid no matter what I will say, so I'm not making any objection. Then, he dismisses everyone.\n\n\nI hide my feelings, but I'm angry. No one ever defended me or even said anything good about me while I was doing such a great job until this job. The supervisor let me do whatever I wanted for the rest of the internship, which is fucking useless.\n\n\nI'm partially at fault. I might have taken it too long. I might have browsed other things during work hours. I don't communicate much. But I'm just an intern. I don't even know what's considered too long. I browsed other things for like 5-10 minutes before get back to work when I was tired. And I don't communicate because there's no reason to for this project. I've communicated with the team for every project except this one.\n\n\nIn the end of the day, I'm just another intern who will make mistakes. This is my first job in this field. Yes, they didn't pay me for that month. They also didn't pay me for the accommodations they promised either. They owe about $1,000, which is about a month's salary for a junior developer in my country.\n\n\nI don't care much about money, but I want to know if I really did something wrong. Most of what my supervisor and co-workers say was BS and only some was partially true. The HR decided not to pay me for that month is also worse punishment than getting fired. What I did was that bad?\n\n\nAnd I'm new in this field but is it normal to scold an intern like me like that? No one warned me about taking on too much work or communicating. The moment I realized they weren't okay with it was when they spoke to HR in evaluation. It was too late to fix anything. They could have just told me, and I would have fixed it. In the room, everyone said I was good, but they said anything but good about me in front of HR. I felt betrayed.\n\n\nTL;DR: Performed well initially, then struggled with a difficult solo project. At final evaluation, I received harsh criticism that I had never heard of until they said it during the evaluation (mostly BS), and was told that I wouldn't be paid for last month due to \"poor performance\".",
        "num_comments": 44,
        "comments": [
            "Assuming US (since this is a US centric sub), BS claim or not, that would almost certainly be highly illegal.",
            "Regardless you need to get off your high horse. It’s pretty clear you think you’re gods gift to programming. You’re not and you will be humbled at some point. Maybe this is that point.",
            "Did you sign a contract with the payment offered in writing? Pretty sure what they’re doing is illegal.\n\nHere’s the thing. It’s your manager’s job to determine if a task is too much for you and to pivot if so. Did nobody check in with you??",
            "I’m happy for you that you didn’t get an offer.",
            "This must be india or something right? No way this shit would fly in america, this has lawsuit written all over it",
            "If they won’t pay you, stay at the company unpaid and find a way to pay yourself.\nI assume you have some cs knowledge and access to their systems, figure it out",
            "Not US unfortunately. Employee protection laws here are also weak as fuck.",
            "That's the way it works here too. I suspect that the company is not doing well financially based on rumors, so they can't pay me.\n\nAs for my communication, yes, it was my mistake. I wish someone would have told me before instead of telling HR though.",
            "Agree with this, OP you're being petty about lots of things especially when you quoted your co-workers. Either the entire company sucks ass and everyone is a dumbass or it's you. \n\nAlso it's hard to give any opinions when your post is skewed to your favor ( you being treated unfairly etc ), just feels pointless imo I'll just say \"oh yeah you're right company is ass\" and it wouldn't help.",
            "The internship was already over for a while and it was just a few weeks before the end of the internship that they said I would not get paid. I would also quit if it was way before the end of the internship.\n\nThank you and I learned my mistake. It sucks that it came out this way, but at least I saw their true colors first. I wouldn't want to work with a company that breaks trust like that."
        ]
    },
    "Number of applicants on a posting != number of qualified applicants ": {
        "title": "Number of applicants on a posting != number of qualified applicants ",
        "score": 34,
        "url": "https://www.reddit.com/r/cscareerquestions/comments/1dr0m9p/number_of_applicants_on_a_posting_number_of/",
        "content": "Send your application if you match the qualifications and stop reading strangers opinions on the internment. ",
        "num_comments": 14,
        "comments": [
            "Only 13% of applicants are very much qualified but the problem is 13% of 1000 is 130",
            "This is very true, but there are still a massive amount of qualified applicants and that number is continuing to grow. I’d still personally estimate that more than half of applicants are extremely unqualified to the point of just wasting their own time.",
            "Stats from the recruiters at my company puts us at around 8-10% of the total summitted resumes actually make it past the ATS and to the recruiter for entry/mid level roles.",
            "What counts as a qualified candidate anyways? In my 5 years of experience as a software engineer (which isn’t a lot), I’ve worked for 3 different companies, with no prior experience to the tech stack, language/s, or industry to any of the projects that i’ve been hired for. By the standards of many, I was not qualified for any of the roles that I was hired for, yet I was able to deliver immediate output, and perform well",
            "I will say that the number is also inflated as it's based on how many times a person clicked on \"apply\". \n\nAnd going to the company website and applying through their portal will also jump you ahead of a lot of other people.",
            "Right now even shitty jobs in the middle of nowhere Midwest are getting 400+ applications so that's 52 people assuming a 13% rate. Even if you change the number to be 5% that is still 20 other people you are competing with who chances are have more experience than you.",
            "And the number of spots for the positions is usually just 1. So you just need 1 really qualified applicant to beat you to it.",
            "Just assume 50% are qualified and within that there’s  another 50% have a resume worth anything",
            "I don't think lying to ourselves is helpful.",
            "Ultimately, don't base your career search around what others are doing.\n\nFocus on you. You're qualified? Apply. Easy as that. Maybe you get spotted in a pool of 50,000 for whatever reason. Maybe you don't. That's not in your control. What's in your control is applying.\n\nIf you don't apply at all because you're intimidated, you have a 0% chance of getting that job.\n\nIf you apply anyways, you have a non-zero chance of getting that job.\n\nThe better path forward is pretty obvious."
        ]
    }
}