{
    "Cs1.6 on the bus is goated ": {
        "title": "Cs1.6 on the bus is goated ",
        "score": 40,
        "url": "https://i.redd.it/vn2wijmzyg9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "1) sprays are free and custom made  \n2) no skins or other monetized bullshit  \n3) no cheaters because the pub admin insta bans them  \n4) performance is superb, even on old systems  \n5) Has riot shield for the memes\n\nWhat is there not to like",
            "Based kid",
            "Old inferno <3"
        ]
    },
    "I want this skin in counter strike ": {
        "title": "I want this skin in counter strike ",
        "score": 80,
        "url": "https://i.redd.it/5u0bz4n13f9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Im pretty sure this just got added to valorant",
            "You should check out the finals.",
            "You won't be able to afford it anyway.",
            "Peppa saw you eat bacon. She didnt like it",
            "The Finals is so underrated",
            "But not as big as it could be, its significantly higher quality than Apex or Fortnite for example",
            "That’s the way it is for those type of games look at splitgate",
            "\n\n\nI have no problem taking a loan from the bank to buy this skin  I want this skin fr",
            "Notorious P.I.G",
            "BOWIE KNIFE || PEPPA"
        ]
    },
    "inactive for almost a year due to adulthood but i’m so back": {
        "title": "inactive for almost a year due to adulthood but i’m so back",
        "score": 287,
        "url": "https://v.redd.it/l0wfrfkwvc9d1",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Clean, i cant hit usp shots for the life of me in cs2",
            "Nice clip, people are mean for no reason. Keep killin it!",
            "Nice congrats on adulthood. The kids talking shit aren’t there yet.",
            "No skins?? Huge L. The whole point of the game is to show how rich you are. /s",
            "Welcome back! DANG NICE 4K Pistoling!\n\nAnd that AK Flick was DANG NICE!",
            " post this to 10 more subs",
            "nice you won basically one gunfight",
            "Congrats but damn what a throw by their part",
            "Weird, I find pistol easier but spray control harder",
            "wtf i find spray easier but pistoling more difficult. this game is hilarious with everyone's views on it. \n\nbut i've moved to the p2000 and it's been slapping pretty good"
        ]
    },
    "after that I got kicked xd ": {
        "title": "after that I got kicked xd ",
        "score": 85,
        "url": "https://v.redd.it/quovx3qhtc9d1",
        "content": "",
        "num_comments": 6,
        "comments": [
            "No wonder why the Germans lost WW2.",
            "Ich hatte dich auch gekickt",
            "I couldn't hit the opponent",
            "Tough but fair",
            "Fair enough",
            "What happened there?"
        ]
    },
    "Catch some pew pills": {
        "title": "Catch some pew pills",
        "score": 45,
        "url": "https://i.redd.it/ku2ki36npd9d1.png",
        "content": "",
        "num_comments": 9,
        "comments": [
            "The pills that cure Dr. Disrespect.",
            "a pill for schizo-tomorrow-operation-update disease",
            "i wouldn't see much use for the sticker itself...\n\nunless the design was used for a skin! maybe a pistol, the grip (or suppressor) is a vending machine with these lil pill bottles and on the barrel there's written 'Pew Pill Vendor 24/7 (bullets in mag)'",
            "That's an interesting point of view. Could you tell me how you usually choose stickers?",
            "Oh, thanks for the clarification! I didn’t think about the operators at all while drawing, I'll keep that in mind for the future works!  \nActually, I thought this sticker would be more suitable for handgun caliber weapons, like pistols and some SMGs. After all, I used my favorite .45 as a reference for the bullets",
            "yeah i noticed, but maybe add a skin to go with it like its a set",
            "i mostly choose skins based off of the operators i use\n\ni then look at the stickers and, if there are any that i think would look good on both weapon and op i take it, there are few and far between\n\nif it has an interesting scratched look even better\n\ni imagine this sticker could go well with the M249 orange skin (i forgot its name)",
            "Pedocillin.",
            "At first, I liked how it sounded, and then the sticker design came to mind. How do you like it?  \nHere's the link: [https://steamcommunity.com/sharedfiles/filedetails/?id=3273662650](https://steamcommunity.com/sharedfiles/filedetails/?id=3273662650)"
        ]
    }
}