{
    "For anything related to Amazon [3]": {
        "title": "For anything related to Amazon [3]",
        "score": 295,
        "url": "https://www.reddit.com/r/csMajors/comments/xx7h7r/for_anything_related_to_amazon_3/",
        "content": "This is a continuation of the \"For anything related to Amazon\" series. Links to the first two parts can be found below (*depreciated*):\n\n* [https://www.reddit.com/r/csMajors/comments/w6e4hy/for\\_anything\\_related\\_to\\_amazon/](https://www.reddit.com/r/csMajors/comments/w6e4hy/for_anything_related_to_amazon/)\n* [https://www.reddit.com/r/csMajors/comments/wndu5g/for\\_anything\\_related\\_to\\_amazon\\_2/](https://www.reddit.com/r/csMajors/comments/wndu5g/for_anything_related_to_amazon_2/)\n\nThis is Part 3. However, there are separate threads for interns and new grads. They can be found below:\n\n* [Interns](https://www.reddit.com/r/csMajors/comments/xx7fhp/for_anything_related_to_amazon_3_interns/) (also includes those looking for co-op/placement year and spring week opportunities)\n* [New grads](https://www.reddit.com/r/csMajors/comments/xx7fiv/for_anything_related_to_amazon_3_new_grads/) (also includes those looking for roles that require experience)\n\nThe rules otherwise remain the same:\n\n* Please mention the **location** and the **role** (i.e, intern/new grad/something else) you're applying for, where relevant.\n* Please search the threads to see if your question has already been answered - this is easy in new Reddit which supports searching comments in a thread.\n* Expect other threads related to this to be removed (many of which should be automatic).\n* Note that out-of-scope or illogical comments (such as \"shitposts\") must not be posted here. This is not the place to ask questions unrelated to Amazon recruiting either.\n* Feedback to this is welcome (live chat was removed as a result). This idea was given by a couple of users based on feedback that Amazon threads were getting too repetitive.\n* You risk a ban from the subreddit if you try to evade this rule. Contact the mods beforehand if you think your post deserves its own thread.\n\nThis thread will be locked as its only purpose is to redirect users to the intern/new grad threads.",
        "num_comments": 0,
        "comments": []
    },
    "[AMA] I’m Eric, founder of Jobright.ai, building an AI job search copilot. Here to answer questions about landing a tech job faster in 2024.": {
        "title": "[AMA] I’m Eric, founder of Jobright.ai, building an AI job search copilot. Here to answer questions about landing a tech job faster in 2024.",
        "score": 62,
        "url": "https://www.reddit.com/r/csMajors/comments/1dp7zrn/ama_im_eric_founder_of_jobrightai_building_an_ai/",
        "content": "Before [Jobright.ai](http://Jobright.ai), I…\n\n* Studied Computer Science at CMU\n* Worked as an Early Engineer at [Box.com](http://Box.com)\n* Exited a successful SaaS startup\n\nAfter the exit, i took a gap year filled with travel, during which I helped over 10 people transition into their next roles. This experience revealed the struggles faced by skilled professionals lacking access to the same opportunities and insights as those in larger cities.\n\nI saw the potential for AI to level the playing field, leading to the creation of [Jobright.ai](http://jobright.ai/). We aim to provide everyone with an experienced AI job coach, transforming the solo and frustrating job search process into a guided and effortless journey. At Jobright, our AI helps you get matched with jobs, tailor your resume, and connect with valuable LinkedIn referrals in under a minute.\n\n**Why this AMA?**\n\nMany of our users and community members have benefited from this subreddit and recommended this community to us. With over 100k users, we've gathered valuable insights into **job market trends, successful job search strategies, and common pitfalls**, and we would like to share back this knowledge with the [](https://www.reddit.com/r/csmajors) community. At the meantime, i’ve invited two senior career coaches here to help answer your questions! Their usernames are u/Sea-Alfalfa-557, u/whyso618. Finally, happy to chat about [Jobright.ai](http://jobright.ai/) and how it can better assist you.\n\n**We would like to help further after this AMA**\n\n* We will select 10 users who ask questions today to receive a free career coaching session.\n* Jobright will regularly host free live Q&A sessions on specific job search topics in our [Discord community](https://discord.gg/tJeyxxsef9). This week, we have a session tomorrow (June 27th) at 6 PM PST on **Effective Networking Strategies to Land Interviews.** Feel free to reserve a seat here! [https://lu.ma/b9kl2erc](https://lu.ma/b9kl2erc)\n\n**Let’s Get Started!**\n\nAsk me anything about job search advice, internships, resume hacks, career tips, Jobright product or even my favorite travel spots! I’m here to help you crush the tech job market.",
        "num_comments": 144,
        "comments": [
            "Applying massively rn… couldn’t get any SWE intern.. i feel like applicant skills are similar tho.. is that because of referrals?? I’ve heard it being crucial at FAANG. Can anyone confirm this? ",
            "What do you feel makes a good resume stand out in the application process? Are there any resources you'd recommend for improving your resume?",
            "is there any way you guys can add multiple locations instead of just one?(Preference category)",
            "1. What do you see people liking the most or engaging with the most with jobright.ai? 2. what are some future products that you plan role out?",
            "I'm a recent graduate with a master's in CS and 2 years of experience in the industry as a junior data analyst and later as a junior data engineer. And I also had a graduate assistantship during my masters that kind of gave me work experience related to being a data engineer yet i'm not able to land a single job in data engineering role or analyst i want a template that could get me through the ats system, as analyst isn't working because of the immediate rejections",
            "How is Jobright.ai different from traditional job boards like LinkedIn? Why should I use Jobright.ai if I need to use LinkedIn for networking?",
            "I was trying to search for specific job listings that I knew existed on other job boards so that I could tailor my resume to that job description but couldn't find a search feature. Is that something that can be added in the future?",
            "Hello, Eric. I’m not in the tech industry but was last in a start-up manufacturing company in the kratom space, in addition to having 23 years in private and public ECE-12 education. I have teaching, and admin experience within this realm as well as non-profit experience. I am currently seeking a new job as I’ve been laid off for over a year as an executive director of a non-profit. However, I am not receiving any replies. I recently found your jobright.ai and think it will be really useful. I have experience in the private and public sector. What can I do to get noticed.",
            "If I go 2 years without a tech job post graduation, am I really going become obsolete to the new batch of graduates and forced to spend more time and money on a masters? There's no saying if the time it takes to complete the masters will land me fresh into a new recession and in some over-qualified under-experienced trap.",
            "Would you recommend trying to build a startup if your job search isn't going well? Building a startup would require learning a lot of new things which would likely make you more attractive to recruiters and if the startup is successful you won't even need the job so it's kind of a win-win.  Thanks for your time."
        ]
    },
    "It’s not just CS": {
        "title": "It’s not just CS",
        "score": 327,
        "url": "https://i.redd.it/bllle1u1eb9d1.jpeg",
        "content": "",
        "num_comments": 44,
        "comments": [
            "Why aren’t LinkedIn influencers making a fuss about the collapse of the financial industry and how bankers will be replaced by AI?! Smh",
            "its a lot closer to pre pandemic levels than CS is",
            "Wooo! It’s not just us!\n\nlol one of the comments “problem now is everyone and their mother is in finance”",
            "Im finding this deeply comforting",
            "If you overlay the stock price of BofA (deez nuts in jour mouf!), you’ll see a similar trend over that period. Finance is quick to hire when they think the next big thing is coming, but right now there’s really no next big thing and it’s underperforming compared to the overall market, so they’re not about to start hiring. Their stock is going up as a function of being dragged up by the overall market.\n\nSo, if you looked at being a Finance major two years ago and thought, \"Wow! It will always be like this!\" without looking at the surrounding factors, it's no different from looking at CS during Covid and assuming there would always be a pandemic that drives people to software.",
            "its literally every White collar job, ik people who are senior financial analysts who cant land jobs, its just the whole white-collar job market. its in the shitter",
            "It is still us. Those jobs mainly swe/it jobs",
            "Holy shit can we stop posting this exact fucking timeframe over and over again? This graph and the other ones on this site are so misleading",
            "That chart does not show much, specially in the years of Covid when there was a major monetary expansion.  We are still higher than pre-COVID, does that mean ia replaced people during pre COVID?\nI don’t know why you guys are so afraid of ia, it’s useful but it’s dumb as hell for many things, and given the current architecture it will be this way for long.",
            "Yeah. A lot of investment bankers have been laid off recently."
        ]
    },
    "I finally did it, a word of advice. ": {
        "title": "I finally did it, a word of advice. ",
        "score": 361,
        "url": "https://www.reddit.com/r/csMajors/comments/1dqkh2h/i_finally_did_it_a_word_of_advice/",
        "content": "I finally did it\n\n5-600 applications (at least), and I finally got the swe job. Junior web dev, mostly remote, 90k salary. \n\n1) if your college does them, take advantage of career fairs!!! I got my internship through a career fair, and this job only came about because I met the recruiter for the company at a career fair 1.5 years ago. They said they liked me at the time and to reach out, so I did. They told me nothing was available, and every few months over the course of 1.5 years I’d ask, until now. \n\n2) Don’t stop learning just cus you’re a new grad and applying, taking a month to slow down apps and learn something new, making a project and putting it on your resume will be way more helpful. \n\n3) (With a grain of salt) Don’t settle. Had an offer from a company where my career would have no progression and I’d make less money, turned it down and no joke days later this recruiter hit me back to interview. If your situation allows it, just be persistent ",
        "num_comments": 42,
        "comments": [
            "Good job! Light at the end of the tunnel ahhh post",
            "Congratulations and salary isn't too shabby!",
            "Happy to hear that, wishing you all the happiness and blessings",
            "How big is your school? Just wondering how packed your career fair was",
            "Congrats! Did you graduate or are you currently a rising-senior?",
            "Congratulations! I love the advice. I’m always scared to keep in touch with people I meet from career fairs and such but I’ll have to work on that",
            "Congrats! I appreciate post like these because it spreads positivity lol!\n\nCan i ask waht was ur time frame from Graduating?",
            "This really changed my perspective on career fairs. \n\nThank you",
            "The lesson is this: network \n\nIf you can't do that, you better have substantial real world experience. Degrees are a dime a dozen",
            "So happy for you! 90k and mostly remote is a dream for me."
        ]
    },
    "Joined the HireVue hatred club": {
        "title": "Joined the HireVue hatred club",
        "score": 5,
        "url": "https://www.reddit.com/r/csMajors/comments/1dr9wtw/joined_the_hirevue_hatred_club/",
        "content": "I just finished a HireVue interview for an intern position at Morgan Stanley and God it was so terrible.\n\nI'm usually confident and do fine in behavioral interviews but staring at myself and yapping made me freakin nervous and I absolutely bombed it. It felt so unnatural and demotivating just at the beginning of my internship search.\n\nThe Questions asked were:-\n\n1:- Why Morgan Stanley and what perspective do you bring to the team?\n\n2:- Talk about when you felt something wasn't right and how you dealt with it?\n\n3:- What tech trends do you predict in the next 12 months.\n\n\nI completely blanked out in middle of the interview and mumbled whatever I could. Guess I know I'm not getting this position. Do you guys have any tips on how to improve and get comfortable with such one sided interviews?",
        "num_comments": 0,
        "comments": []
    }
}