{
    "sad state of schooling": {
        "title": "sad state of schooling",
        "score": 3822,
        "url": "https://www.reddit.com/gallery/1dr2gc8",
        "content": "",
        "num_comments": 247,
        "comments": [
            "Imagine being a full grown adult trying to 1-up a child with how hard your life is",
            "When someone's complaining about how much they hate school, maybe telling them that it's only gonna get worse doesn't fucking help??",
            "As someone who still has nightmares about falling behind on college work 10 years after failing out of college, I can agree that homework is indeed quite stressful",
            "First, I have experienced highschool, college, and working full time. Of the three, working was infinitely less stressful, more enjoyable, and much less work than school ever was. Second, the issue with school is not the workload, its the fact that almost none of it means jack shit. Im not saying there are not valuable things that need teaching. Math is useful, language is vital, history is important, most class topics are very important. What Im saying is that the highest percentage of useful information to useless busywork in any highschool class Ive ever taken was like 50/50. Additionally, the focus on tiered learning, learning a topic, being tested on it, moving on never to think or talk about it again, is literally ruining education as a whole. Ok, cool kid, you just learned this one integration method and spit it out on the test. We will now move on to new topics, never to talk about this method again. This type of teaching is good for tests, so looks good on paper, but it makes it impossible to remember vital methods of doing things long term without an insane amount of independent, unstructured, self motivated study which is too much to ask of a teenager. Additionally, it makes it hard to solve problems even if you have previously learned the methods needed to do it, because you never see each method interact. For example, if you know three methods to solve a math problem in three steps, but arent sure how the methods interact because you were only ever taught the final formula rather than how it was derived, you are gonna have a hard time.",
            "I always did great at school. University was a breeze, never failed a single exam despite never going to any classes (at my uni attendance wasn't mandatory, most lectures were recorded, though at some point I stopped watching them and just went by slides, and lecturers are prevented from influencing your exam grades so they can't do shit even if they hate you). Yet 5 years after graduating I still have nightmares about being late for an exam or just forgetting that a class exists and failing the exam. I have *no* idea what fuels them. None of that ever happened.",
            "My mom told me that my principal admitted that they gave us a lot of homework so we wouldn't have time after school to get into trouble. \n\nAnyway I dropped out bc I physically couldn't sit upright for 8 hours and bc of limited resources the accomodations I needed were given to another student",
            "Um sometimes kids absolutely do just want a day off to skive off. As a teenager, I had absolutely shit time management and would regularly ignore homework, then fake sick and take the next day off to catch up. Except often Id spend that day I planned to use on homework to fuck around, and wind up panic-doing 5 days worth of work in like 3-4 hours.",
            "Standard school hours for me were 8.30-16.00. That's 7.5 hours a day or 37.5 hours a week. Add to that an average of 2 hours working at home, 6-10 hours of parttime work and studying for tests and you're well above the average job. I remember when I started working full-time I was basically dancing home from work because I knew that my work for the day was done,  instead of having to force myself to concentrate for another 3 hours.",
            "School accomplishes its most basic goal very well actually. It's just that that goal isn't actually education or a benefit to the students",
            "middle school was literally the worst fucking period of my life, i don't get the 'life gets harder the older you are' thing"
        ]
    },
    "Emphasis is everything in a text": {
        "title": "Emphasis is everything in a text",
        "score": 6396,
        "url": "https://i.redd.it/wfslt1hbge9d1.jpeg",
        "content": "",
        "num_comments": 88,
        "comments": [
            "And the funny thing is, I still interpret 3 as \"no, I just implied it for legal reasons\"",
            "*Hmmm, maybe i should just start talking in italics all the time. just to be sure.*",
            "I prefer the older version of this post where the sentence in question is I never said I licked his asshole or something like that. Same vibes but a lot more fun",
            "The italicized said suggests to me the sentiment The words we should kill him never left my mouth.",
            "Then what does bolded words mean depending on the placement?",
            "3 definitely means I never explicitly stated we should kill him but I *think* we should.",
            "Comics use **bold** + *italics* for emphasis a lot, yet I feel like the writers don't understand this a lot of the time. Italics are just thrown around every sentence randomly. (That actually might not be the writers' fault, it might be the letterer)",
            "Pathologic 2 has a funny bit where somebody says \"I thought you brought in a baby,\" for which neither the player nor the player character yet has context so it sounds quite bizarre, and the responses you can choose are just \"You thought I brought in a baby?\" with three different versions of emphasis",
            "\"He'd Kill Us If He Had The Chance\"\n\n\"He'd Kill *Us* If He Had The Chance\"",
            "All italics just mean an italian is speaking"
        ]
    },
    "I was gonna post a better title but then I reread \"Link, 5'6\" with two inch heels and a backless dress suspiciously stained with blood\" and got a nosebleed.": {
        "title": "I was gonna post a better title but then I reread \"Link, 5'6\" with two inch heels and a backless dress suspiciously stained with blood\" and got a nosebleed.",
        "score": 1120,
        "url": "https://i.redd.it/r9r9mmo4yg9d1.png",
        "content": "",
        "num_comments": 58,
        "comments": [
            "For anyone curious, though in canon every Link has always been he/him (~~except one she/her version from the non-canon game Hyrule Warriors called Linkle~~), he was in fact designed to be at least a little bit androgynous so that any player could see themselves in him even though he was still his own character.\n\nThat being said, headcanons about Link being queer and/or GNC to the max are A+ and I want to hear all of them. And who knows, considering that the spirit of the hero has had and will continue to have many different incarnations, perhaps one day we will get to see a Link who he/she/theys it up in canon like everyone deserves.",
            "Maybe everyone in Hyrule has face blindness?",
            "I know its nowhere close to being canon, but I like to play Link as a selectively mute autistic with very specific special interests: cooking, swordfighting, and horses. Anything else just isnt as interesting to him, including being labeled as a hero or whatever. He of course wants to save his bestie Zelda, but hes also gonna stop to cook every recipe under the sun and befriend all the horses and mow down entire fields of grass with the master sword",
            "What game was the dress in?",
            "why do your sinuses hate 5'6 link with two inch heels and a backless dress suspiciously stained with blood",
            "Dude cross dresses once too sneak into a town were men are illegal and the internet decides to give him every pronoun",
            "Not that I disagree but this post isn't about BotW it's about TotK where people would have absolutely known about the heroes return by that point. Like even if time has passed that's a big enough event to still be in hyrulian public consciousness",
            "I've not played these specific two games in the series, but I *think* this mostly just stems from the fact that Breath of the Wild has an area inhabited by the Gerudo, a (mostly) female tribe that outlawed men from entering. To get inside, Link has to disguise himself as a woman.\n\nLink's design is intentionally a bit androgynous, but the series has never really presented him as anything but a cis male.",
            "Yes. IIRC, Link is very much a guy, but he dresses/acts more androgynous.",
            "There's also the fact that we don't know how long Link was working on BoTW in canon. Yes I know there are speed runners who can complete the game within 1 or 2 days game time. Gor your average Joe it would be months or years of game time. Link might have met some NPC in BoTW once and then it took him another 2 years to bring peace and then another 5 years to undo peace"
        ]
    },
    "On Elves": {
        "title": "On Elves",
        "score": 3304,
        "url": "https://www.reddit.com/gallery/1dqyikl",
        "content": "",
        "num_comments": 86,
        "comments": [
            "I'm just imagining an elf walking through the woods like that famous Bigfoot footage. Same gait, same turn toward the camera, same shaky zoom-in, the whole shebang.",
            "Elven twinks, with low stamina, getting gradually worn down over prolonged \"hunts\"\n\nHmmmmm",
            "I actually love posts like this. Id guess Id call them Fantasy Biology. Anyone know where I could find more?",
            "I know where all the Elves are. I fuck them",
            "Little known fact: elves and orcs are actually all the same species, and the only differences between them are cultural. Elves shave down their tusks and orcs eat mushrooms that turn them green.",
            "Elves are like cheetahs. If they run too long they get heatstroke.",
            "I can't wait for the Google AI to scrape this and start giving automatic results to D&D players about how Elves are not extinct.",
            "Honestly I'd love more media that fantasy races as convergent evolutions. Like elves look and talk like us, but they always seem very uncanny, and researchers discover that's because they didn't evolve from primates, they evolved from slothes",
            "Im sorry but the best fake Latin name you could come up with for elves was homo effeminatus? Feminine human is the best you got? This would also imply elves are humans but just a different species of human",
            "This is how some people flirt"
        ]
    },
    "apologies": {
        "title": "apologies",
        "score": 13371,
        "url": "https://i.redd.it/kkfkqry28c9d1.jpeg",
        "content": "",
        "num_comments": 404,
        "comments": [
            "The worst is as some one who wants to explain themselves when apologizing is hearing the other person say something like \"I don't want excuses.\"",
            "The purpose of the explanation should be to explore your understanding of why you did it and why it led to harm. If the explanation is used for defense and deflection, then it's not helpful. But yes, sometimes a messy situation demands context on both sides and maybe one party isn't thoroughly evil and wrong and the explanation can get both people to reconsider and move forward more healthily.",
            "Id rather have no apology than a bullshitted aplology",
            "Ooooh, at some point tiktok decided \"saying why you did what you did is gaslighting/manipulation and those who say why they did it are narcissists\" and somehow a lot of people accepted that",
            "I made another comment here but I have a wildly different thought now:\n\nFuturama literally reprogrammed my brain from doing stuff like what OOP described. Sometimes I preface stuff with This isnt an excuse its just what happened and that usually defuses people who think youre making excuses when youre just like Im irritated because Im exhausted and its not your fault",
            "I think that there is very much a reason that we decided explaining yourself shouldnt be part of an apology: people cant seem to differentiate well between reasons and excuses, regardless of whether theyre the one giving or receiving. As such, literally any explanation ever will be seen as trying to defend oneself or absolve oneself of accountability, and therefore the most accountable thing to do is to simply put your head down and say the bare minimum because you dont *deserve* to explain yourself.  \nIs this stupid? Yeah, very. Like super duper. Do I still see how this came about? Also yeah.",
            "Depends right?  Are you hoping for an explanation, possibly looking for confirmation that they understand what they did and why, and why it is worthy of an apology?  Or does an explanation just sound like excuses or justification for the behavior when all you want is them to take accountability?",
            "Saying the first kind of apology is a great way to be accused of making a shitty apology",
            "The final statement is part of why I've started to find overuse of progressive language as a red flag. I'm a lefty but far too many people use therapy speak or political theory language not to elucidate but to obfuscate, to signal that they are a Good Person without actually saying anything.",
            "I wish we could go back to actually providing reasoning. I tried to apologize to a friend back in 2020 after a disagreement and no matter how I phrased it she accused me of centering myself and ended the friendship. Hurt me badly at the time but its been a few years now and even if we picked it back up we have nothing in common anymore."
        ]
    }
}