{
    "Dr. Larry ": {
        "title": "Dr. Larry ",
        "score": 98,
        "url": "https://v.redd.it/dlkuqxan6e9d1",
        "content": "",
        "num_comments": 2,
        "comments": [
            "He saved her life.",
            "Her Interview in conan needs afriend was pretty good"
        ]
    },
    "Pretty pretty pretty pretty good ": {
        "title": "Pretty pretty pretty pretty good ",
        "score": 29,
        "url": "https://i.redd.it/59lhue4o5f9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Is that the proof of concept for the Cybertruck?",
            "Where's the penis detector ?",
            "I was coming here to say if the cyber truck was a urinal.  Lol"
        ]
    },
    "Intentional irony in Palestinian Chicken?": {
        "title": "Intentional irony in Palestinian Chicken?",
        "score": 42,
        "url": "https://www.reddit.com/r/curb/comments/1dqtv2q/intentional_irony_in_palestinian_chicken/",
        "content": "I wonder if Funkhouser rolling up to the restaurant in the modern day descendant of Hitlers favorite car, a top of the line Mercedes, is intentionally ironic or if it is just me reading too much into things.  ",
        "num_comments": 27,
        "comments": [
            "Marty greeting Larry and Jeff with “Shalom!” negates his car choice. All time classic line.",
            "Larry drives a BMW in most seasons",
            "#JUDAISM, WHERE ARE YOU?",
            "Probably just you reading too much into things. Larry and all his friends are rich LA people — having a top of the line Mercedes isn’t unusual at all",
            "Maybe if he was playing Wagner while driving it.",
            "https://i.redd.it/niktnoh18g9d1.gif",
            "A concentration camp survior spoke to my 6th grade class and I specifically asked him about holding grudges against Germans, Germany, or German companies, and he said “well, I drive a Mercedes…”\n\nI think Jews and other oppressed people have bigger things to worry about than who their carmaker served in a war almost 100 years ago. If Hamas or Iran made a car, they probably wouldn’t buy it today, but buying German cars after the conflict ended didn’t seem to be an issue for the guy who spoke to my class.",
            "I’m not familiar with Hitler’s, but if the model, color, other details are a match, I’d say intentional for irony.",
            "Eh. He drives an electric vehicle in all seasons.\n\n*Ultimately I feel BMW outbid Toyota for the placement,  considering the diarrhea episode took place nearly entirely inside a dealership.*\n\nEdit: EV or Hybrid. You put your foot on the gas and it goes.",
            "You wanna check my penis?"
        ]
    },
    "I've never seen this in anyones top Curb list.": {
        "title": "I've never seen this in anyones top Curb list.",
        "score": 651,
        "url": "https://i.redd.it/gx08ocw2079d1.jpeg",
        "content": "But of course he had to be in Jeffs collection.",
        "num_comments": 94,
        "comments": [
            "The house that cum built",
            "Insane that house that cum built was like ep 3 of the whole show lol",
            "I love when Larry's asking what level of anger Cheryl's at, and she's like \"It was up higher, but then you broke that lamp and that crazy woman screamed at you.\" while laughing. A very charming moment",
            "He wasn’t the biggest but he could go the longest",
            "Lol I watch the YouTube clip of that all the time and the views are so relatively low.",
            "Do you know about the Tabasco trick?",
            "I’m a huge Bob Odenkirk fan so this is one of my top episodes.  I’m watching Better Call Saul right this second",
            "Let’s be honest, Bob Odenkirk gives off “former pornstar vibes”. That’s a perfect casting right there.",
            "When that old bag rips up the directions!! 🤣",
            "this is the episode i showed my parents to get them to watch the show. the lady on the side of the road saying “don’t be like that…” kills me and i love the way Cheryl looks at larry after all the dinner guests get up from the table."
        ]
    },
    "Larry's light blue shirt in S11E7": {
        "title": "Larry's light blue shirt in S11E7",
        "score": 5,
        "url": "https://www.reddit.com/r/curb/comments/1dqytlz/larrys_light_blue_shirt_in_s11e7/",
        "content": "Where do you get a shirt like that? Like that. Looks like a good material. Good thickness. Length. You got the sleeves with the good fit around the forearm which negates the elastic wrist. You're not even worrying about losing the clinging to the wrist.",
        "num_comments": 2,
        "comments": [
            "My husband passed away 3 months ago and you ask me a question like that?",
            "Hello. \n\n\nI see you.\n\n\nI acknowledge you. \n\n\nI connect with you."
        ]
    }
}