{
    "Start here! Beginner info & weekly 'no question is dumb' thread! - May 30, 2024": {
        "title": "Start here! Beginner info & weekly 'no question is dumb' thread! - May 30, 2024",
        "score": 10,
        "url": "https://www.reddit.com/r/curlyhair/comments/1d42b8z/start_here_beginner_info_weekly_no_question_is/",
        "content": "Welcome! We are a subreddit devoted to caring for curly, kinky, coily, and wavy hair.\n\n## Where do I start?\n\n**The \"I just want to get started\" package:**\n\n* [Super simple beginner routine](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/edit#heading=h.t37f7kwlj2xe)\n   * Only drugstore products, total cost: \\~$15\n   * Teaches curl-enhancing techniques\n   * Build a foundation first and then tweak it later!\n   * [Infographic version here](https://i.imgur.com/jxuR1ry.png)\n\n**The \"I want to read everything before I start\" package:**\n\n* Check out our [CG guidebook](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/edit#), starting with these pages:\n   * [Intro to the Curly Girl/Guy method](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/edit#heading=h.59rpcbd5bmmf)\n   * [Super simple beginner routine](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/edit#heading=h.t37f7kwlj2xe) & the [infographic](https://i.imgur.com/jxuR1ry.png) that goes along with it\n* Sidebar links (*on reddit mobile: this is the \"About\" tab*)\n* [Holy grail product list](https://docs.google.com/spreadsheets/d/1gn6VnPsRU1H3ziElbWqNVFY5mev6GB1pwKKt_MNpoAY/edit?usp=sharing)\n* [International (non-USA) product list](https://docs.google.com/spreadsheets/u/3/d/e/2PACX-1vTbVtl5RKQyRwtOlctXVt4f8HovDNVjRUkXBMt3l_DpnkSS0Q-wQ3d77_nf20EJ2yPEFpsuvb6Aa52c/pubhtml#)\n\n**¡Ahora en Español!**\n\n* La [Guía Definitiva del Método Curly Girl/Guy](https://docs.google.com/document/d/1D6o7H5hDj01cZEb5JyBqncN8wlkpn7s6GGwciQtAwao/edit), traducción por [u/medusa-rulos](https://reddit.com/user/medusa-rulos)\n\n## I'm confused! How can I get help?\n\n* **Ask a question in this thread!**\n* **Check the** [**FAQ**](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/edit#heading=h.di5dez2gnjq5)**!**\n* **Make a new post** Tips to get useful responses (help us help you!):\n   * Let us know whether you read the wiki & beginner routine (and share what you tried!)\n   * Ask specific questions.\n   * Give us lots of info about what you currently do to your hair. Your goals, specific current products, and how you wash/style it are all useful to us.\n\n## What is the Curly Girl/Guy method (aka CG method)?\n\nThe CG method is a haircare method that is specifically geared towards curls and waves.\n\nCurly hair tends to be super dry, thanks to sulfates, the harsh detergents in shampoo. So we remove sulfates from the routine.\n\nThe problem is that only sulfates can wash away certain ingredients, like silicones, so we remove those too, leaving only ingredients that can be washed away with JUST water.\n\nThe CG method mostly focuses around **removing both sulfates and silicones** and replacing them with gentler products, along with some techniques to help our curls form and stick together!\n\nSaying a product is CG then says that it follows these guidelines. Check out the wiki & sidebar for more info!\n\n## How can I tell if a product is CG-approved?\n\n* **Copy/paste ingredient checkers:** These will tell you if your product's ingredient list is CG-approved and why.\n   * [IsItCG](http://isitcg.com/)\n   * [Curlsbot](https://www.curlsbot.com/)\n* **Pick a product from our lists:** All the products in the [beginner products list](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/edit#heading=h.jogrfujs2zru) are CG. Products in the [holy grail list](https://docs.google.com/spreadsheets/d/1gn6VnPsRU1H3ziElbWqNVFY5mev6GB1pwKKt_MNpoAY/edit?usp=sharing) are marked as CG or not.\n\n**Wishing you many wonderful hair days! :)**",
        "num_comments": 25,
        "comments": [
            " Conditioner/Treatment and any oil treatment makes my hair looks worse? feel like shampoo + towel does it’s job to make my hair look best when curly",
            "I tried scrunching my hair when getting out of the shower but it just tangles it?",
            "So... I messed up a bit lol. I'm new to the CG method (today was my third wash following it) and I've been struggling to plop - today I used a scrunchie to keep the tshirt in there but I guess it was too tight because the back of my hair is a floofy MESS  now. Front curls look great. I usually only wash my hair every 5 days so I was wondering if there's any way I can fix the back while leaving the rest alone? Would tying up the front and wetting just the back and scrunching gel in help?",
            "Just read a lot of the guide, but I am still confused on co-washing and conditoning. Let's say I reset wash with shampoo and I do not shampoo for the next month. And lets say I do my hair rountine twice a week. Does that mean every time I do my hair routine I co wash and condition to detangle? Or do I co wash less than that like shampo?",
            "I was looking at the beginner routine and I was planning on using the squish method to condition my hair but I didn’t understand how I am supposed to apply gel after, so I scrunch out my hair first or let it dry?",
            "How does scrunching work with really short hair like 2 inches or less",
            "How does everyone deal with the wind? I hate always having the windows up in the car but having them down really does not mix well with my hair. Any good products to use to help?",
            "But I love my silicone hair repair from pantene!!!!",
            "may I know which haircut I can do for a 3b 3a hair that would make me achieve less volume ?( I don't like volume) and preferably one that I can do at home ( hair salon in my area sucks)",
            "Is your hair fine and/or low porosity? Curlies that fall into this camp, especially looser textures, do not need anywhere near as much conditioning to maintain their hair. The infographic is only a place to start. As long as you are happy with your curls, keep going."
        ]
    },
    "Start here! Beginner info & weekly 'no question is dumb' thread! - Jun 27, 2024": {
        "title": "Start here! Beginner info & weekly 'no question is dumb' thread! - Jun 27, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/curlyhair/comments/1dppk0q/start_here_beginner_info_weekly_no_question_is/",
        "content": "Welcome! We are a subreddit devoted to caring for curly, kinky, coily, and wavy hair.\n\n## Where do I start?\n\n**The \"I just want to get started\" package:**\n\n* [Super simple beginner routine](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/edit#heading=h.t37f7kwlj2xe)\n   * Only drugstore products, total cost: \\~$15\n   * Teaches curl-enhancing techniques\n   * Build a foundation first and then tweak it later!\n   * [Infographic version here](https://i.imgur.com/jxuR1ry.png)\n\n**The \"I want to read everything before I start\" package:**\n\n* Check out our [CG guidebook](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/edit#), starting with these pages:\n   * [Intro to the Curly Girl/Guy method](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/edit#heading=h.59rpcbd5bmmf)\n   * [Super simple beginner routine](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/edit#heading=h.t37f7kwlj2xe) & the [infographic](https://i.imgur.com/jxuR1ry.png) that goes along with it\n* Sidebar links (*on reddit mobile: this is the \"About\" tab*)\n* [Holy grail product list](https://docs.google.com/spreadsheets/d/1gn6VnPsRU1H3ziElbWqNVFY5mev6GB1pwKKt_MNpoAY/edit?usp=sharing)\n* [International (non-USA) product list](https://docs.google.com/spreadsheets/u/3/d/e/2PACX-1vTbVtl5RKQyRwtOlctXVt4f8HovDNVjRUkXBMt3l_DpnkSS0Q-wQ3d77_nf20EJ2yPEFpsuvb6Aa52c/pubhtml#)\n\n**¡Ahora en Español!**\n\n* La [Guía Definitiva del Método Curly Girl/Guy](https://docs.google.com/document/d/1D6o7H5hDj01cZEb5JyBqncN8wlkpn7s6GGwciQtAwao/edit), traducción por [u/medusa-rulos](https://reddit.com/user/medusa-rulos)\n\n## I'm confused! How can I get help?\n\n* **Ask a question in this thread!**\n* **Check the** [**FAQ**](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/edit#heading=h.di5dez2gnjq5)**!**\n* **Make a new post** Tips to get useful responses (help us help you!):\n   * Let us know whether you read the wiki & beginner routine (and share what you tried!)\n   * Ask specific questions.\n   * Give us lots of info about what you currently do to your hair. Your goals, specific current products, and how you wash/style it are all useful to us.\n\n## What is the Curly Girl/Guy method (aka CG method)?\n\nThe CG method is a haircare method that is specifically geared towards curls and waves.\n\nCurly hair tends to be super dry, thanks to sulfates, the harsh detergents in shampoo. So we remove sulfates from the routine.\n\nThe problem is that only sulfates can wash away certain ingredients, like silicones, so we remove those too, leaving only ingredients that can be washed away with JUST water.\n\nThe CG method mostly focuses around **removing both sulfates and silicones** and replacing them with gentler products, along with some techniques to help our curls form and stick together!\n\nSaying a product is CG then says that it follows these guidelines. Check out the wiki & sidebar for more info!\n\n## How can I tell if a product is CG-approved?\n\n* **Copy/paste ingredient checkers:** These will tell you if your product's ingredient list is CG-approved and why.\n   * [IsItCG](http://isitcg.com/)\n   * [Curlsbot](https://www.curlsbot.com/)\n* **Pick a product from our lists:** All the products in the [beginner products list](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/edit#heading=h.jogrfujs2zru) are CG. Products in the [holy grail list](https://docs.google.com/spreadsheets/d/1gn6VnPsRU1H3ziElbWqNVFY5mev6GB1pwKKt_MNpoAY/edit?usp=sharing) are marked as CG or not.\n\n**Wishing you many wonderful hair days! :)**",
        "num_comments": 2,
        "comments": [
            "Does anyone know if your hair growth pattern changes with puberty? I am aware that curl patterns can change, as mine did from 1a to 3a-3b, but I want my hair to grow upwards instead of downwards. Can this take place during puberty?",
            "Hello! Here on behalf of my extremely low maintenance BF, he seems to have 4A, incredibly fine hair. It was also thinning at one time, but the thinning has stopped because of some medication. \n\nHe doesn't wanna go bald and actually hates that it's curly, but thankfully understands that he needs to actually care for his hair now, so he doesn't literally lose it.\n\nI just have no clue how to deal with thin curly hair cuz mine is thick and pin straight. I've tried doing research on my own, but it's been problematic to say the least. It anyone can give me any advice on how to help him. I'd appreciate it."
        ]
    },
    "Do you re-wet your hair everyday? Or just refresh without completely re-wetting? ": {
        "title": "Do you re-wet your hair everyday? Or just refresh without completely re-wetting? ",
        "score": 393,
        "url": "https://i.redd.it/utqb84flvf9d1.jpeg",
        "content": "I have found that every day I have to completely re wet my hair either by rinsing it in the shower, or spraying until it is fully soaked with water, before trying to re-style it. I can never find a way to sleep on it where I can wake up and style it in any way the next morning and it takes up a decent amount of time - I’ve tried sleeping in braids and bonnets and many refresher sprays and it just doesn’t seem to work! I’m curious what others do",
        "num_comments": 120,
        "comments": [
            "My hair looks ok for 2 to 3 days and then becomes a more frizzy ratty mess.  I'm in my 40s and still haven't learned how to actually refresh my hair outside of a wash day.   My question is, when you re-wet your hair without washing it, are you putting more product in it?",
            "I steam mine with a handheld clothes steamer. Lets me fix the wonky curls without having a wet head",
            "I have to wet it every day. It turns into a rat’s nest if I don’t on day 1",
            "No, I just rewash it every two to three days with no wetting in between. I’m too active to wash it less.",
            "I have a spray bottle that's like, conditioner and a lot of water. I just use it to hydrate my hair every morning.",
            "I use a refresh spray with no water for 2-3 days. Then 4-7+ I’ll use a little bit of water and finger coil product or conditioner in. I never fully rewet unless it’s an individual curl or my bangs that simply aren’t cooperating",
            "If I dont completely drench my hair again, it becomes frizzy and all that. So I get 1 good hair day, 1 day of whatever it wants, and then wash day lol",
            "I'm black. My coils are very tight and with the right leave in and gel combo my hair can last up to 9 days without resetting. This information is probably not useful to you 😂",
            "I don’t re wet.  I use this steamer I bought for cleaning, but saw it was nice for refreshing slept on hair.",
            "I don't re-wet or refresh and have totally given up on this idea. Every time I have tried it, my hair became super frizzy. If I add more product after re-wetting / refreshing to deal with frizz and add definition, they become super greasy and smell weird within few hours.\n\nMy hair just gets straighter on top and still have curls towards ends and don't get messy or frizzy so I've learned to live with it."
        ]
    },
    "Curly updo with bangs: Maid of Honor hair for my sister's wedding": {
        "title": "Curly updo with bangs: Maid of Honor hair for my sister's wedding",
        "score": 516,
        "url": "https://www.reddit.com/gallery/1dqwcqj",
        "content": "I went at 7:30 that morning to have my hair done by my normal stylist as I was in my sisters wedding. I wanted to try a fun updo with my naturally curly 3A hair. I personally loved it. \n\nMy routine: wash and condition with Aveda ‘be curly’ line, followed by SOL de janeiro leave in. Next I define with the bounce curl brush and add a foam I use 2- 3 pumps  or The doux ‘crazy sexy curl’ honey setting foam. Diffuse for length with Dyson 80% and scrunch out any crunch adding Rizos Curls ‘nourish oil.’ ",
        "num_comments": 35,
        "comments": [
            "Off topic but you have such a beautiful face. With this hairstyle you look like how I imagined the Greek goddesses when I was a kid",
            "Oh I post this here? \n\nMy routine: wash and condition with Aveda ‘be curly’ line, followed by SOL de janeiro leave in. Next I define with the bounce curl brush and add a foam I use 2- 3 pumps of The doux ‘crazy sexy curl’ honey setting foam. Diffuse for length with Dyson 80% and scrunch out any crunch adding Rizos Curls ‘nourish oil.’",
            "Absolutely stunning, I love it",
            "Damn, girl, you are gorgeous!!",
            "Grew out my bangs years ago, but you make me want to get them again! Love it! Naturally curly updos are the best",
            "You look like a rogue detective in a 90s thriller. (You look fantastic)",
            "Absolutely stunning! Lovely curls 😍 also had to zoom in and study your shoulder to understand what was going on with the chair lol took me too long to realize it was your tattoo and the chair pattern blending",
            "You look like Kiera Knightly!",
            "Question for you OP! I’m using the same foam - have you tried more than 2-3 for all your hair? If so, what were the results? I’ve been trying to dial in how much my hair needs and it’s been difficult. I can’t tell if less is more with it!",
            "Gorgeous hair and makeup. You look beautiful!"
        ]
    },
    "My parents keep booking appointments for haircuts but I really wanna look like a metal head what do I do to keep it long but adhere to my parents?": {
        "title": "My parents keep booking appointments for haircuts but I really wanna look like a metal head what do I do to keep it long but adhere to my parents?",
        "score": 18,
        "url": "https://www.reddit.com/gallery/1dr96t3",
        "content": "Everyone tells me my hair looks stupid but I don’t think it does.. sometimes I agree but I just want it to be like mega long yk? Idk what to do because I can’t convince my parents that I’m trying to grow it out they have already booked an appointment today so it’s gonna be ruined now 😔",
        "num_comments": 13,
        "comments": [
            "Metal is a mentality not a hairstyle. But I’d say keep it. You’re young and should be enjoying exploring your interests. Ask them if they’d rather you try out this hairstyle now or have a “mid life crisis” and do it in your 40s. Hahahahaha good luck kiddo 🤘🏻",
            "I like your hair! Like someone else said, they probably just want to you look generally put-together. When you get your haircut today, ask the stylist for a drugstore product recommendation to get your hair a bit less fluffy. Probably a styling cream or something. You could also ask for something like a shag mullet, which would get your hair out of your face. Try to communicate with your parents in a way that shows you’re willing to respect their wishes to be put together while also asserting your right to have your own style.",
            "Tie it back when around them. They just want you to look neat",
            "“I want to be metal but my parents won’t let me”",
            "Maybe talk to your parents and just get trims when you go in?  To me hair is one of the safest ways for kids to express themselves as cuts and colors grow out and are not more permanent like piercings or tattoos. I know some schools have dress codes on hair lengths and colors but if yours does not, talk politely with your parents that you'd like to express yourself with your own hairstyle choices and that will likely continue changing with time and styles, as your style changes. If your parents are fussy about their own hair then might be that way with yours also, especially if you have very image conscious parents. Good Luck! 🍀",
            "KEEEP IT!!! Its about what YOU want. My partners hair used to be like this and there is an \"awkward\" grow out phase in your future, but his hair is now beautifully long and its gives metal head for sure!! I think even the length you have now looks stunning. Long hair ftw 🙌🏻",
            "when it's chill, talk to them. They're real people. expressing how happy it makes you while containing yourself is the way to go.",
            "Great advice! Piggybacking to add: if there are hairstyles you like or want to emulate, show your stylist pictures! Sometimes it’s easier to show them then to try to describe what you want. Even if your hair is shorter, you can show them what your “end goal” is and they can shape you up to try to get you there eventually.",
            "When you get there you don't have to get it cut short. You can just ask the person working on your hair to just trim off any split ends, which will help you keep length. As long as your hair is healthy and growing at a reasonable pace you won't lose too much length, and regularly trimming off the damage will help it grow anyways.\n\nThe more difficult part may be the conversation with your parents afterward, if they explicitly booked this appointment because they want you to get a buzz cut or something. At the end of the day it's your hair, and you should be allowed to let it grow as you please, but unfortunately every parent is going to listen to that. One point you may be able to make since you want to grow it out long is that if it turns out that too long is driving you crazy and you don't like the extra upkeep long hair takes, you can always cut it back down to short. You can always take off more later, but you can't add hair back on if it's cut shorter than you like.\n\nHopefully regular appointments for trims- just trims- may be a compromise they can accept if it's them just worrying about the health of your hair.",
            "Your hair looks identical to my husband’s hair at your age. Coincidentally he was into metal and bands too. \n\nIt’s not a bad cut but you’d really benefit from incorporating more product into your hair. What do you use now? Have you tried mousse? I’m also guessing you might be brushing your hair after it’s starting to dry or is dry. If so, I wouldn’t. \n\nReally make those curls / waves pop and tone down the puffiness a bit and I bet everyone will like it more, including yourself. A bit of a trim wouldn’t hurt either but I’d work on getting your hair more definition first and go from there."
        ]
    }
}