{
    "Congratulations r/CURRENCY For Achieving 58,500 Members!!": {
        "title": "Congratulations r/CURRENCY For Achieving 58,500 Members!!",
        "score": 3,
        "url": "https://imgur.com/a/4GZUo6h",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Extra paper on Dollar Bill, worth anything?": {
        "title": "Extra paper on Dollar Bill, worth anything?",
        "score": 734,
        "url": "https://i.redd.it/7pjea2imm27d1.png",
        "content": "Found a while ago at work, wondering how rare this kind of error is",
        "num_comments": 77,
        "comments": [
            "Pretty sure it's a good error from what I've seen on the thread. If it was folded they say to leave it how it was. And put in a sleeve",
            "You can kind of see the design of another 1 dollar bill on the bottom, that's such a weird error cut. Never seen anything like it.",
            "thats pretty neat! \ncool find. \nid be doing a happy dollar dance ",
            "Super awesome and definitely worth a premium. Errors on modern notes are supposed to be really rare since they are visually checked by computers these days. I would get expert advice to determine value.",
            "YES!!!!! Its acceptable to fold that in the sleeve.",
            "Una Mariposa! Dont let her fly away!",
            "This is a fantastic miscut.  Ive never seen one like this irl, or heard of one like this in modern currency",
            "Yes that is a valuable fold over error. It should be authenticated and graded.",
            "Ive been preparing for a market I never even knew about. Now, how much longer do I sit on my misprints is what makes it a gamble",
            "lol, a a good printer and a touch of glue and ya got it made"
        ]
    },
    "My first noteworthy serial!": {
        "title": "My first noteworthy serial!",
        "score": 9,
        "url": "https://i.redd.it/ltigwmfcvh9d1.jpeg",
        "content": "It’s not the fanciest of serial numbers, but it’s the first one I’ve gotten since joining the subreddit some months ago and I’m quite happy with it! Though I would’ve preferred the serial being 444 222 00 Haha!",
        "num_comments": 2,
        "comments": [
            "Nice"
        ]
    },
    "Why is the color off?": {
        "title": "Why is the color off?",
        "score": 3,
        "url": "https://www.reddit.com/gallery/1dradsa",
        "content": "The color on the bottom bill is grey where it’s usually green. Why? ",
        "num_comments": 1,
        "comments": [
            "Looks like Someone tried to make a fake 5 dollar bill but maybe I'm wrong."
        ]
    },
    "A fake my wife got at work today": {
        "title": "A fake my wife got at work today",
        "score": 55,
        "url": "https://www.reddit.com/gallery/1dqt7bu",
        "content": "The amount of crackheads and counterfeits is wild ",
        "num_comments": 16,
        "comments": [
            "someone actually marked this with a pen!  fantabulous.",
            "The pens are crap. They bleach ones and print the 50 and the 100. Best way I found to check for fakes is to drag your finger nail on the clothes of the president at the bottom. Real bills are embossed. Fakes are flat.",
            "Somwe counterfeit are better printed than real ones.",
            "I have a $50 version of this",
            "Wow so could counterfeits people (whatever theyre called) buy these and then print over them? Like turn $1s into lets say $20s?",
            "Apparently these type of bills are being used in anchorage in a small homeless camp as legit currency so the mark is from one of their dealers checking to see if the fake is a fake",
            "The pens were designed to react with a real bill, how are they crap?",
            "It looks like you posted a &#x1F92C; word and it has been deleted. Your comment is also under human review, depending on the severity, this may result in a permanent ban.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CURRENCY) if you have any questions or concerns.*",
            "They're already printed in denominations like 20, 50, no need to print over anything. It just takes a salesclerk who isn't looking at the bills and noticing the bright pink and white.",
            "These and other prop money were going around Seattle area pretty heavily about 5-6 years ago. I actually found a 50$ with those characters on it, a washed 1$ that had one side as a 100$ and the other side a faded 1$, and 100$ bill on cheap paper but very good looking other than for motion picture use only written on the face, all on the ground around Tacoma in About a years time. Upon researching I found the motion picture money for sale on Amazon, the 1$/100 was a super bill made by counterfeiters, and the Chinese characters 50$ was found only on random police department statements/evidence on their websites/pages and they were trying to gather information on them still at that time."
        ]
    }
}