{
    "Mentorship Monday - Post All Career, Education and Job questions here!": {
        "title": "Mentorship Monday - Post All Career, Education and Job questions here!",
        "score": 25,
        "url": "https://www.reddit.com/r/cybersecurity/comments/1dmzzvx/mentorship_monday_post_all_career_education_and/",
        "content": "This is the weekly thread for career and education questions and advice. There are no stupid questions; so, what do *you* want to know about certs/degrees, job requirements, and any other general cybersecurity career questions? Ask away!\n\nInterested in what other people are asking, or think your question has been asked before? Have a look through prior weeks of content - though we're working on making this more easily searchable for the future.",
        "num_comments": 304,
        "comments": [
            "Hey guys I managed to get two referrals for entry level roles but not sure what to do now. How would you guys approach this? Do i follow up somehow or? Suggestions would be greatly appreciated!",
            "Hello I’m getting my bachelors in computer science but I hope to work in cybersecurity, what qualifications and certifications do I need?",
            "Hey all, I'm 31 and I've just recently finished a cybersecurity program at a local University. Looking to start my cyber career but having some trouble due to my lack of any IT experience. Did several labs and a cyber sim during my program but the lack of practical experience is holding me back.\n\nJust curious what projects/activities I should be looking at participating in to boost my resume given my lack of cyber/IT experience. Still looking for positions but this can be something I can work in the meantime. Thanks!",
            "I’ve got 11 years xp in helpdesk and network engineer at an ISP. I just graduated with a cybersecurity degree with a bunch of certs. I haven’t even come close to getting an interview anywhere. Unfortunately I live in a rural area (willing to relocate) and no direct xp for cybersecurity on my resume. Would pursuing a masters in cybersecurity help? I feel like without xp in the field it won’t help at all. \nSide note, would there be any suggestions for someone in my position for getting an interview?",
            "I'm coming up on a due date to use a voucher for the GCP Architect exam.  Even with the Google training, Cloud Skills Boost, I'm not feeling confident.  My wife thinks it is because I failed a cert for the OWSP a few years ago and have lost my confidence.  \n\nAny suggestions on items to use to study, books, Udemy courses (work has a subscription). Then I trust my wife, anyone have any tips on dealing with loss of confidence?",
            "I have an issue and I’m turning to the hive. I have a BA in CJ and my Master in Public Administration.  I’m currently employed in the security world (non tech) for a large organization. I  have a budding interest in information technology and cybersecurity. I’ve been self studying at a very basic level, A+, AWS Cloud foundation, learning Python.\n\nI have been researching second IT degrees and/or IT master degrees to get a foundation in IT and then move into the cyber career field at my organization.  I don’t plan on leaving my employer, I still get a pension, so I’m stuck with their rules. My employer requires some type of IT degree to even get an interview. I found a couple of programs that I was interested in and I approached my employer about paying for them. They agreed but with the exception that it must be cybersecurity related. Literally, they will pay by the course but the course title has to have security in it. So…I need a cybersecurity degree but one that lays out a good IT foundation.  Any suggestions?",
            "Recently laid off from tech. I was a test engineering technician, working in automotive. Been doing cyber for 4 years just self learnings \n\nI’m looking for internships in the Denver metro. Does anyone have any clues on where to look?",
            "Hi. I just recently graduated with a masters in criminal justice with a concentration in cybersecurity. My bachelors is also in criminal justice but with minors in computer science and geographic information systems. I’m wondering what jobs I can/ should go for? \n\nI work in the cj field now and have been at my job for about 3+ years and I’m constantly being told I’m over educated and under paid. I made more money at my previous job(s) but figured my current role was a stronger resume builder. I’m 24 y/o now and I understand that is young but I just cannot help but feel discouraged when looking for jobs. I appreciate your time and advice! Thank you 🫠",
            "Hi everyone, I recently graduated with a biology degree, but it is something I no longer wanna pursue. I've been looking into cybersecurity and want to know what I should do to get my foot in the door as quickly as possible. I was thinking of getting comptia securtiy+ and network+ certs and maybe some lab work to try and land an entry level job. Anyone know a good general pathway for someone self-learning?",
            "Student here trying to decide which certification to got for. I know CEH has a reputation of being kind of a dud, and is generally considered to be not difficult enough to verify anyone's skills, but what about CEH Practical?"
        ]
    },
    "ISP accused of installing malware on 600,000 customer PCs to interfere with torrent traffic": {
        "title": "ISP accused of installing malware on 600,000 customer PCs to interfere with torrent traffic",
        "score": 161,
        "url": "https://www.techspot.com/news/103548-korean-isp-accused-installing-malware-600000-customers-pcs.html",
        "content": "",
        "num_comments": 12,
        "comments": [
            "The company seems to have spent a considerable amount of time and resources into this.",
            "So… who was the first to get a lawyer and sue them?",
            "Tails linux on usb and use external hard drive for downloads. Wipe the USB if you see throttling and reinstall the OS if the malware is really installed in the OS. Just an idea…",
            "Not enough companies ask \"Are we the baddies?\"",
            "The only way this makes sense is if it’s a half truth. Like the ISP provided free “security “ software that blocked “suspicious traffic”.  You could argue that’s malware.  I guess I should read the article. \n\nEdit:  it sounds like they literally wrote malware, which is wild. This was in SK and I don’t know enough about the legal/cultural landscape to comment but I’d imagine they are going to be in some shit. ",
            "Theoretically the backbone of the network would come to a crawl if everyone was maximizing their allotted bandwidth. But yea still bullshit.",
            "My thoughts exactly, how are the computers infected?",
            "No no, its ok, we're just following orders.",
            "Can you explain me why would an ISP even care if I’m pirating anything?\n\nEdit: okay I read the article and apparently the costs for bandwidth are too high… and a court in 2020 even allowed them to throttle the traffic…\n\nIf I’m paying for a certain speed and unlimited bandwidth why the heck would you do this!? Just change your plan to something like 1TB/month",
            "thx mr robot"
        ]
    },
    "Microsoft Tells Texas Agencies They Were Exposed in Russian Hack": {
        "title": "Microsoft Tells Texas Agencies They Were Exposed in Russian Hack",
        "score": 7,
        "url": "https://www.bloomberg.com/news/articles/2024-06-28/microsoft-tells-texas-agencies-they-were-exposed-in-russian-hack",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Hello, everyone. Please keep all discussions focused on *cybersecurity*. We are implementing a *zero tolerance policy* on any political discussions or anything that even looks like baiting. This subreddit also does not support hacktivism of any kind. Any political discussions, any baiting, any conversations getting out of hand will be met by a swift ban. This is a trying time for many people all over the world, so please try to be civil. Remember, attack the argument, not the person.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cybersecurity) if you have any questions or concerns.*"
        ]
    },
    "Memory Forensic was named WIN of the MONTH in Hack The Box": {
        "title": "Memory Forensic was named WIN of the MONTH in Hack The Box",
        "score": 5,
        "url": "https://www.reddit.com/r/cybersecurity/comments/1dr8nu8/memory_forensic_was_named_win_of_the_month_in/",
        "content": "We are thrilled to share that [Memory Forensic ](http://linkedin.com/company/memory-forensic)has been honored as the WIN of the MONTH solely in Hack The Box's \"ThreatReady\" newsletter!\n\nMemory Forensic is a collaborative blue-team platform designed to support cybersecurity professionals‍, especially those in DFIR and memory forensics.\n\nYou can read the complete newsletter article [here](https://linkedin.com/pulse/626-million-true-cost-cybersecurity-burnout-issue-6-hackthebox-xnwbf/)!",
        "num_comments": 0,
        "comments": []
    },
    "South Korean telecom company attacks customers with malware — over 600,000 torrent users report missing files, strange folders, and disabled PCs": {
        "title": "South Korean telecom company attacks customers with malware — over 600,000 torrent users report missing files, strange folders, and disabled PCs",
        "score": 192,
        "url": "https://www.tomshardware.com/tech-industry/cyber-security/south-korean-telecom-company-attacks-torrent-users-with-malware-over-600000-people-report-missing-files-strange-folders-and-disabled-pcs?utm_source=tldrinfosec",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Damn those youtube videos weren’t kidding, SK is really cyberpunk irl",
            "The First Corporate Cyberwar is upon us. Netrunners to your stations!",
            "One thing I don’t understand is how did KTs malware actually make it on to the victims machine ? \n\nKT software must have been on the victims machine first? Unless there was some weird MITM going on.",
            "Find it odd that individuals were charged and not the company.",
            "I guess the cease and desist orders didn't work.  They had to nuke it from orbit to be sure.",
            "I've been trying to find this out too. None of the articles go into details about how the infection was carried out. Just that it was \"inserted into the Grid Program\", which is apparently some kind of peer to peer sharing that Webhard runs for its customers. But how did this translate into RCE?\n\nHopefully someone who understands Korean goes into a deep dive on this for the rest of us because I'm very interested to find out what the hell happened here. An ISP attacking their own customers with malware is a *huge* deal.",
            "Nah, it's odd that America charges companies and not individuals. It was the individual who did it, and obviously a corporation can't go to jail. Hooray for no repercussions! ",
            "CEO: already opening that phishing email",
            "All systems nomin-- wait what are we doing",
            "im sure most customers have their app. maybe it uses the app to get into the system by reporting intranet settings or just delivers the software through the app. Just like pretty much everyone has a comcast app"
        ]
    }
}