{
    "Dad tips": {
        "title": "Dad tips",
        "score": 3977,
        "url": "https://www.reddit.com/r/daddit/comments/8uvq8o/dad_tips/",
        "content": "I found out a couple weeks ago that some friends are pregnant with their first. I wrote this to help them prepare for it. FWIW, I have an almost 3 year old and a 4.5 month old. I hope this helps some dads to be, here!\n\nFeel free to add anything you think I missed (there are things I thought of after I emailed this to my buddy and told him later but did not put into this).  After we've got some responses, I'll see how much of this we can add to the wiki here.\n\n**Before**\n\n* Go to all baby appointments!  This is probably a no brainer for you but some people don't realize it.  Ultrasounds are cool!  And it's really great to ask the ObGyn or midwife any and all questions you have!  (ie, I asked before #1 was born when I'd be able to hear his hearbeat.  The ObGyn said, \"in just a minute, I have the doppler right here.\"  \"no, I mean with my ear against her belly.\" \"oh, never, it's too loud in there and baby's heartbeat gets drowned out.\")\n* Go to some birth classes.  But maybe not all of them.  Depends how many you're encouraged to go to; KP advised ALL of them and they're tiring and tedious and mostly boring. I skipped the breastfeeding one, from the sounds of it, that was a good choice because it was a bunch of women trying to learn to breast feed dolls with at least one boob hanging out.  L&D class was like 8 hours on a Saturday with like 30 couples.  We went through the whole process.  It was exhausting.  I'm not sure it helped much because when you get to it, you listen to what the medical team is advising.\n* Start planing to buy shit now (or starting at week 13)  If you're going to do one, make a registry, do the showers, and see what people get you.  Get your big ticket items (car seats, strollers, cribs, etc) onto something like camelcamelcamel or other pricewatch and buy the sales.  I bought our stroller as an OpenBox deal on Amazon.  Still paid $300 for it but that's better than the $500 retail.  More on gear later.\n* If you're going to get a doula, start meeting them now and find someone you like.  My yoga studio has a \"meet the doulas\" event one night every month or so where they all give a spiel and then you can hang out and talk to them.  We went but I had to chase our toddler around so I didn't get to sit in on the thing.  We found a doula to be really helpful, mostly because it made it feel like there was a person on our team that wasn't a hospital employee and it gave me more comfort in being able to leave the room to run home for things as needed.  In retrospect, a doula would have been probably even better with the first delivery than the second but live and learn.\n* Pregnancy sucks.  Did no one tell you that?  Plenty of women say they loved being pregnant (Wife said she enjoyed being pregnant with our first, not so much the second as she had miserable heartburn every day.  She carried a bag of tums with her at all times and called them her \"after dinner mints\".) and I have no doubt some do.  I support that and their feelings.  But you're beginning what will likely be one of or the most life changing choice you'll ever make and prior to that little bundle of giggles popping out, your partner gets to go through a roller coaster of hormones (I lucked out with wife, she's even keeled and that part wasn't bad) as well as body changes that are sure to wreak havoc on psyche.  \"I'm the heaviest I've ever been!\"  Well, yea, you've got a baby inside you, you've never had a baby inside you before.  Really messed with wife when I put my boot on the scale at a visit and tipped the scales to something like 190.  She was like \"OMG, I've really packed it on in these weeks!\"  The med assistant gave me wry smile and wife turned to see me close and scrunched her nose and shook a fist.  Fun stuff.\n* Did I say pregnancy sucks?  Libido will be all over the place.  So will body comfort both physically and mentally.  You just roll with it as you can.  Near the end (and especially once the baby has come) your partner's breasts will probably be the largest, shapeliest, and most enticing they have ever been.  And it may be entirely likely you're are not allowed to play with them, touch them, look at them, breath on them, or even think about them because they're sore and maybe leaking, and goddamnit I'm a cow now, MOOO.  (Wife has said moo a couple times in the last couple weeks when I walk in and she's pumping; I think all the pumping is taking a toll on us both.  It's a lot more work that breastfeeding but it allows me a wonderful amount of involvement with the baby which allows for more bonding and I feel way more connected to #2 than I did our first at this age).\n* Of course, the above are not absolutes, all women are different and pregnancies are different.  We had plenty of sexy time while pregnant with #1 and comparatively none with #2.  Part of that was how hard the second pregnancy was and part of that was that we already had a kid and were doing parent things so were tired.  So it goes.\n* Plan some vacation now; especially if leave from work is not a concern.  First trimester can be rough but things generally smooth out in the second.  We went to Nicaragua and hiked an active volcano when wife was 4 months preg with #1.  Do that shit now, it will be a while until you'll want (or have the energy) to travel and we're a lot less adventurous now that we're caring for kid and infant.  No surprise there\n* Start familiarizing yourself with the alphabet soup.  FMLA, CFRA, PFL, SDL.  Family Medical Leave Act; California Family Rights Act; Paid Family Leave; Short Term Disability Leave.  These will require paperwork from medical offices to employers and to the state.  Get these submitted as required and make use of those benefits.  You can always do more work.  One day your baby is crying for you and wants to be held and snuggled, the next he's telling you to get out of the chicken run, you don't go in there, and he'll put you in timeout.  It's fucking hard but not so that you'd want to miss it.\n* Know your employment contract/policies/etc as well as your boss's position on family life and work culture.  Don't be guilted into anything that is less than the full amount you are entitled to.  \n* In the same vein as the above point, you won't believe (maybe you will) the amount of assholes who will tell you, \"you won't be able to wait to get back to work!\" or \"why are you taking so much time?\" or \"You'll get sick of being home and come back early.\"  No two ways about this: fuck those people.\n* Know multiple routes to your hospital and how long it take to get there in the worst traffic.  First babies are generally slow to come but it's a goddamn roller coaster of excitement when something like water breaking happens and you have to get up and go.\n\n**Labor and Delivery**\n\n* By now you should have a car seat base installed into the car and a proper car seat in it, waiting for the moment.  Leave this in the car, the hospital will likely not let you leave without it.  Find a place to inspect the installation; some hospitals do it, so do fire departments.  Google/call around or ask at your next ObGyn visit.\n* You need a Go Bag.  Or one each.  This should include:  \n\n   * personal care products\n   * phone chargers\n   * other distraction things (labor can be literally hours of just sitting waiting)\n   * list of mom's meds (or mental knowledge)\n   * known allergies!\n   * birth plan if you have one\n   * a change of clothes (as a dirty man, I think I brought a shirt, lol)\n   * clothes for baby to go home in (don't just bring NB size!  A 0-3 onesie is a good idea too; never know how big that baby is going to be)\n   * lacrosse ball or whatever; hospital room accommodation for mom is alright, Dad is probably going to be on a pull out chair or couch.  \n   * Comfortable, easy on/off, loose clothes for mom. \n* You'll mostly be told what/where/how to do things once you're in the hospital.  However, you have some choice too.  Mom doesn't have to labor laying down on her back with her feet in stirrups.  You can walk around, (depending on facility) use a bath tub, roll onto sides, hands and knees, etc.  \n* Pain management is important.  Something I think helped with #2 is that instead of going straight for an epidural, wife elected for Nitrous Oxide.  So as she felt a contraction coming, she'd hold the cup over her face and breath the N2O until about the peak of the contraction.  Obviously not enough to knock her out but enough to take some of the edge off the contraction.  (Apparently, this used to be really common, then much less so since the 80s? 90s? then has come back into favor after new research more recently.  \n* Epidural is an option.  Talk to your ObGyn about this.  TL;NotAHealthCareProvider is it numbs things drastically and therefore often requires IV synthetic oxytocin to be administered to advance the labor.  More interferey, more possibility for complicationy.\n* You'll likely be offered to cut the cord.  I noped the fuck out of cutting #1's.  When they asked me way before #2 came out, I said \"no way\".  But when the time came I spoke up and told them I wanted to.  I don't really remember it honestly.  I mean, I do, but it isn't that significant in my mind.  I'd recommend doing it, though.\n* AFAIK, episiotomies are no longer recommended but that isn't to say tearing won't happen.  It probably will.  It will have to be stitched up.  It comes in four grades. Vaginal wall, vaginal muscle, rectal muscle, rectal wall.  I don't remember the grading numbers, 1-4 I think.  First kid caused a 3, second a 2.  Recovery from the 2 was much faster than the 3.  \n* Feeding the baby as soon and as much as possible is important.  Gotta get that nasty poop (don't remember what it's called) out as it is related to jaundice problems.  Jaundice is also apparently caused by a blood type (RH) mismatch, between mother and baby and we had this problem with #2.  We spent like 24+ hours keeping him under blue lights and trying like hell to stuff his body full.  Once he regained birthweight, all concerns related to the RH mismatch were gone and we were out of the dark.  \n* Breastfeeding can be hard for mother and baby at first.  Use lactation consultants and get help.  Mom's who breast feed have a lower risk of post partum depression\n* Dads can get post partum depression too.  Maybe google around and be aware of the risk factors and signs for both of you.\n\n**Gear**\n\n* Car seats all have to meet the same safety standards.  Get one that is light enough to be comfortable, is easy to get in and out, and fits in your car well.  That last bit is more important for older kid carseats than infant because infant seats all seem to have the same base size.\n* Crib: they're fucking expensive.  We got ours from Pottery Barn, somewhere we would never shop, only because one of wife's friend's moms gave us $200 in gift cards for there for our wedding.  I think we still paid like $400 for the crib after the cards applied.  But #2 is using it now too so maybe that's not insane.\n* Stroller, as mentioned above, it's expensive.  We had a Graco or something that we bought because it would hold the infant seat and it was cheap.  It fucking sucked and I hated walking/running with it and it didn't maneuver well. Then we went on a hike and borrowed a BOB.  It's a great stroller.  We bought our own.  #1 still rides in it on evening walks while we carry his brother on our chest.  And this weekend we snapped the adapter into it and put #2's car seat on it and went to the Farmer's Market.  Again, if you're comfy with the idea, Amazon Warehouse/Open Box deals.  I wanted a stroller with a swiveling front wheel that had the option to lock as well as an adjustable handle.  I found the handle on our old stroller was too low and was uncomfortable for long periods of pushing.  The adjustable height on the BOB handle is nice.  I think the biggest thing here is to get a stroller that fits your lifestyle.  \n* A [baby swing](https://www.buybuybaby.com/store/category/gear-travel/infant-activity/swings/32026/) is handy.  It's nice to have something that rocks them and plays music/white noise.  We've got one that has a mobile as well.  Given the time frame, I think you guys are welcome to ours.  It's a little squeaky but wholly functional.\n* A bouncing chair gets even more use, for us, with both kids.  We have one [like this](https://m.bedbathandbeyond.com/m/product/fisher-price-reg-sweet-snugapuppy-dreams-bouncer/1060769749?skuId=60769749&mcid=PS_googlepla_nonbrand_baby_online&product_id=60769749&adtype=pla&product_channel=online&adpos=1o53&creative=224186171444&device=m&matchtype=&network=g&mrkgadid=3176331679&mrkgcl=609&rkg_id=h-0d17d1bd656a886269a47241e10a5375_t-1530800094&gclid=CjwKCAjwg_fZBRAoEiwAppvp-fNHgwAfAmULKYGimNi-JF0XnrWq7rOiZsbO0bsCGJe9prDy0R1CXhoCcj4QAvD_BwE).  It worked really well for both kids and we use it ALL the time.  Several times/day.\n* Water proof mattress covers.  covers, with an 's'.  Because you want two of them.  Make the crib twice: cover, sheet, cover, sheet.  That way when the inevitable 2am blowout happens, you strip down the first two layers quick and go back to sleep.  We changed and replaced too many sheets with #1 before we learned this one.\n* A baby carrier.  Ayayay.  We've had like 4 of these things.  Bjorn (meh); Baby Onya (used a lot but was never very comfortable for either of us); one other I can't remember, and now a Lille Baby which we both like and find very comfortable.  Wife also got a Ribozo from our doula.  It's a 15' long wrap.  It works well for wife and #2 looks so cozy in it.  Generally she uses that and I use the Lille but she sometimes uses the Lille.  I haven't tried the Ribozo yet but don't think I will.\n* Bottles.  Holy crap there are so many.  With #1 we ended up liking Tommee Tippee the best but #2 had trouble with them.  We went to Dr. Brown's for him.  They're expensive but seem to really help cutting down the sucked air.  (getting him off formula really helped get rid of his fussiness too).   If breastfeeding, this isn't really a concern\n* A bottle warmer.  In both our condo and here in our house, we leave a bottle warmer near the bed.  At night we put a cooler with bottles next to the bed and warm them as needed throughout the night.  It's basically a small hot plate that you add water to and it boils/steams the bottles.  Works alright.  \n* Big swaddles.  Not these stupid like 18-24\"x 30\" buggers that are everywhere.  We got some this time around that are like 36x36\" and they work way better.\n\n**Baby Care**  \nYou're going to want some things on hand so that you don't have to go get them at the 24hour CVS at 2am.  I've done this.  On multiple occasions (once from a hotel room in an hour or so south of Sacramento because we didn't bring things with us; it sucked)\n\n* Tylenol.  Children's tylenol has the same concentration as baby tylenol but is generally (no exaggeration) less total cost for twice the volume.  Often the difference is the cap--baby tylenol has a cap that receives a syringe, children's often doesn't.  So decant into the lid or a dosage cup and draw it with the syringe.  \"But children's tylenol doesn't come with a syringe?!\"  Go to the pharmacy window and ask for a liquid medicine dosing syringe.  They have them for free.  The thing to make sure is that the tylenol is 160mg/5ml.  \n* Ibuprofen.  Kids can't have this until 6 months.  At which point, get some and keep it on hand so you can cycle Tylenol/IB as needed.\n* Baby gas drops.  The drug is Simethicone.  Get a couple bottles and keep on hand.  \n* Gripe water.  It is natural gas remedy and supposed to help sooth the tummy.  It's like fennel or some other herbacious shit.  \n* thermometer.  We've got rectal, oral, and one that goes into ear.  The first two have gotten lots of use.  The aural, not much; wiggly kids are tough. Don't confuse which one goes in what hole.\n* We recently bought an otoscope so we can see if it's worthwhile to head to the Ped/urgent care for ear problems.  I think it was like $40 on Amazon; comparing that to copays, it seemed reasonable.\n* Lanolin.  For diaper rash (also chapped nipples).  There are other options for diaper rash too.  Lanolin seemed to do the best job with the least disgustingness.  Coconut oil is nice for general use as well but not great for severe rash.\n* Baking soda.  This isn't a carry with everywhere thing, it's more for dealing with diaper rash at home.  But a good amount into a bath really seems to soothe skin.  I just dump a bunch in.  If you get it from somewhere other than the grocery store it's super cheap.\n* Q-tips for boogers and ear wax\n* Put your pediatrician's number into both your phones under something like \"PEDIATRICIAN\" so it's easy to find.\n* to couple with above, most places (especially down there) or insurance providers have an \"advice nurse\" who is a great, free resource to call with questions.  It's kind of like triage in that they can help you decide if the kid needs to be seen by medical providers.  Put this number into your phone too.\n\n**Baby at home**\n\n* Sleep when the baby sleeps\n* Read about sleep training and decide what you're going to do.  It doesn't have to be concrete, but it helps to have a plan and start early.\n* Co sleeping is done around the world but largely frowned on in America.  New research is suggesting maybe America rethink that (saw that headline yesterday, I think).  Do what's right for you.  Generally, our babies slept better with us when young but we slept like shit with them in bed.  We normally only brought them to bed when they needed comfort.  \n* Happiest Baby on the Block is a book or video or something that gets rave reviews.  We watched the dude who created it in a KP class on infant care.  Swaddling and \"shhh-ing\" really calm an angry baby.  \n* Youtube some swaddling techniques.  There's kind of a standard version and a \"frog\" version.  I only did the frog version with #1 a little bit near the end of his swaddling but it worked well.  I use the standard (draw a straight edge of cloth--I use stretchy blanket, often--across the baby, right shoulder to left hip; draw the excess from below them up tight to the left shoulder; draw the remainder tight from left shoulder to right shoulder.  Bam.  Swaddled and happy\n* White noise machines are recommended frequently to help kids sleep.  We play little musics when he's in his chair or swing and have [one of these for the crib](https://www.amazon.com/New-Baby-Einstein-Dreams-Soother/dp/B01JVSYFTS/ref=sr_1_11_a_it?ie=UTF8&qid=1527822347&sr=8-11&keywords=baby+einstein+under+the+sea) but #2 doesn't seem to be into it whereas #1 would zone out on it and pass out.\n* Reflux is a common issue with baby because they're lower esophogeal valve doesn't work like ours.  It's also the reason they vomit when burping, I think.  A folded tower underneath the own end of the crib mattress can really help to ease some fussiness if this is an issue.\n* Gas pain is really common especially with bottle fed and formula babies and with all babies until the gut develops more (4+ months, I think).  laying them on their back and \"bicycling\" their legs can be helpful, so can pushing but legs up to a squatty position when they are on the back.  Once they're a bit older and can hold head up, laying them across the lap with hips hanging off one side and head off the other can be beneficial as well.\n* People will want to touch your baby the same way they want to touch your dog--without asking.  Think about how you want to handle this.\n* the American Academy of Pediatrics recommends basically 0 screen time until 2 years.  \n* If the kid won't stop screaming and you've done everything and are losing your shit, put it down in it's crib and take a breather.  It is safe in it's crib and you'll feel both a million times better and like an asshole for having been frustrated.  \n* Learn Infant, Child, and pregnant woman heimlich and CPR if you don't know it already\n* Lock the poisons away now.\n* Schedule time to give your partner a break and do the same for yourself.  This is \"me\" time.  A walk around the neighborhood, watching the ocean, circus time, a cup of coffee, walking through the shops downtown.  Whatever.  Just make plans to send one another away alone.  You don't realize how much you worry about the kids until you're not with them.  You'll hear a baby while out and go into high alarm then realize, \"oh, that's not mine.\"\n* Find a good baby sitter and plan dates.  Between date expenses and the sitter it's fucking expensive.  It's worth it. \n* Read to your kid every night.  We haven't started with #2 consistently yet but will soon.  #1 gets his books every night.  It's a wonderful time to expand their vocabulary, teach them, and also cuddle, bond, and relax.   \n\nI think more than anything, trust yourselves and your instincts.  All manner of things are said to make your life and baby easier, happier, healthier, smarter, etc.  Most are just to make money for other people.  ",
        "num_comments": 477,
        "comments": [
            "I hate to post something negative on such a well thought out, super informational and positive post but I have to. Please do not co sleep with your new born. In the last 10 years two babies at my wife's family church have died because of this. They are so tiny and weak they can't wake you up if they slip between you. A family lost their infant 7 months ago because the dad fell asleep with the infant on the couch. When he woke up 2 hours later the baby wass between him and the cushion and not breathing. At least wait until they are able to roll over and have the strength to wake you up if being suffocated. \n\nEdit 5 years later: BY CO SLEEP I MEANT SHARE A BED, or TAKE A NAP ON THE COUCH HOLDING YOUR INFANT. IM NOT SAYING IF YOUR BABY SLEEPS IN A BASSINET IN THE SAME ROOM AS YOU IS WRONG. I GAVE SPECIFIC EXAMPLES IN MY POST AND ALMOST WEEKLY FOR FIVE YEARS SOMEONE COMMENTS TO ARGUE",
            "At the bottom of this list:  \nYou won't do half of these things, or you won't do them right, and you'll feel like a failure. You're not. Just keep going. You'll be fine.",
            "Buy a Nose Frida. When the little one gets a cold, this is a game changer. ",
            "This is what I came to the sub looking for. Take the critiques in stride - you posted in good faith, and everyone should know their mileage will vary. My wife and I are expecting number one this winter, and this gives me a nice springboard for research. I appreciate your writing it.",
            "Just a heads up fellas. Read BabyWise - its a game changer. I feel like were cheating at raising a kid - he has a certain sleep & feed schedule and weve got him sleeping from 7pm to 7am every night without wake at 6 months. \n\nCouldnt recommend enough!",
            "I'm not a dad (13 year old girl, farthest thing from lol) but this is really helpful! I might be getting a little sibling soon, and I want to be there for my family and be more knowledgeable about this kind of thing. It's cool seeing a collective community of dads haha, I'm just glad I haven't seen any dad jokes so far :')",
            "My biggest piece of advice 11 months into being a dad comes from the first week of being a dad. When you get home from the hospital, you'll have visitors upon visitors. Without being rude, put them to work. They won't want to stay as long. Don't be rude about it. Be subtle. And be prepared to tell the same stories over and over again. It will take until about the second week when you get to just bond as your little family. I wished I could have put everyone off for a week. But, my daughter turned out great. Love her so much and it makes me love her mom even more. ",
            "Labor/Hospital tip: When my wife and I went in to deliver, we made sure we had a big bowl of snacks for the nurses who came in. Protein bars, trail mix, shots of espresso, etc. Each time a nurse left the room, we made sure they took something. Word got around at the nurses station, and we became the couple with the snacks. Now, Im not saying we got preferential treatment..but we were absolutely well-attended to.",
            "I'd have to recommend packing two eye masks in the bug-out bag. One for you and one for your wife.  It will help you get that 1-2 hours of sleep in between feedings/care. At our hospital, we were not allowed to turn off the lights..that plus the nurses popping in every hour made sleeping impossible. \n\nAlso - Be nice to your nurses!  ",
            "This is great! A few points, I'd like to add: 1. don't put q-tips into the baby's (or your own) ears or nose, you could cause damage very easily. Use a snot or wax sucker or just a tissue or facecloth. 2. cribs don't have to be expensive. We got one from ikea for $130 and the matress for $90. It fits regular crib sheets and will certainly meet the safety standards in your country. It's simple, but nice looking and will turn to a toddler bed down the road (like most others). I believe walmart has similar priced options also. 3. Such a good call on the stroller comments! My mum is tall so she warned us about handles that are too low. If you are concerned about this (or even if you aren't), find a store with a selection of strollers on display and both parents should try them out to find one that you like. It's a bit like buying a car. Don't feel like you have to buy that stroller from that store, go find a deal somewhere else or price match, if you can. Luckily, there are no car salespeople at the stroller store. ;) 4. If you have a dishwasher, aim to get dishes/bottles/breast pumps/etc that are dishwasher safe, when possible. Doing dishes sucks, let the machine do it, while you cuddle your baby, or your baby mama. 5. Baby stuff goes on sale ALL THE TIME. If you can wait, there will be another sale soon. My country still has toys r us, and they have a babyfest sale at least 3 times per year. 6. If you want to save money, find a consignment store, or buy on kijiji, garage sale, or whatever you prefer. We got all that ridiculous gear, that doesn't last long, second hand for almost nothing. Example, exersaucers cost like $150+, I bought one from facebook for $15 and gave it a good cleaning. When you're done with it, pass it on to a friend or sell it back to someone else and we all win! Did the same with lots of baby clothes and cloth diapers too. SO much money saved!"
        ]
    },
    "I gave my baby daughter herpes (HSV-1) by kissing the top of her head": {
        "title": "I gave my baby daughter herpes (HSV-1) by kissing the top of her head",
        "score": 376,
        "url": "https://www.reddit.com/r/daddit/comments/1dr1zan/i_gave_my_baby_daughter_herpes_hsv1_by_kissing/",
        "content": "I posted the following about nine months ago (https://www.reddit.com/r/daddit/comments/16nicus/) and a user recently suggested that I \"share it over and over\", so I thought I would repost the story:\n\n--------------------------------------------------------------------------------------------------------------------------\n\nA little over two weeks ago I kissed the top of our then 6.5 weeks old baby's head (top and centre of the skull). It was a single, light kiss on her thick head of hair with no obvious scratches or other skin imperfections underneath. But I had cold sores on my lips at the time.\n\nWe have been really careful to avoid giving our children cold sores or otherwise pass along the herpes virus (HSV-1). We have a maintained a strict \"no kissing on the lips or face\" rule between everyone and our children, and I do not kiss my wife on the lips or other sensitive regions while I have cold sores. But our baby was diagnosed with HSV-1.\n\nShe developed sores starting from where I kissed the top of her head within 24-48 hours of the kiss. We weren't certain what the sores were initially (although I informed my wife that I thought it could be herpes due to my prior kiss) so we brought her to a walk-in medical clinic for assessment. They took a swab sample for testing and provided a prescription for topical (skin-applied) antibiotics while suggesting the sores could be due to a bacterial infection. But after 48 hours the sores were continuing to grow and spread across the top of her head. So we phoned the clinic and our family doctor, but they still had no test results. They then provided a prescription for oral antibiotics. But after 24 hours the sores were continuing to grow and were now on her forehead. We still had no test results so my wife took her to our family doctor. But our family doctor did not know the cause of the sores either and suggested we take her to the children's hospital emergency room.\n\nWe took our baby to children's emergency that evening. They took a look at the sores and listened to our concerns (I expressed a strong concern that herpes from my earlier kiss could be the culprit). They also took swab, blood and urine samples to try to determine the cause of the sores (bacterial or viral), and to determine if it had spread to other organs or systems. They tried to take a sample near the spinal cord as well to check if it was in her central nervous system, but they were unable to collect what they needed due to her small size (10lbs) and movement during their attempts.\n\nShe was admitted to hospital and started on IV antiviral and antibiotic medication. While waiting for the results from the hospital, we were informed that the test results from the walk-in clinic showed only a culture of normal skin bacteria. But the hospital staff said this could be due to them collecting the sample from the surface and not opening up the sore to collect.\n\nAfter spending 48 hours in the hospital we were informed that she has contracted HSV-1 and that the sores may reoccur in the same region it started originally (top of head) or around the mouth; different infectious disease doctors gave varying options on where the sores may appear in the future.\n\nThey told us that she will need at least a week of IV antiviral because she is too young to take oral antiviral.\n\nMy mom was infected with HSV-1 when she was in grade 6 (likely from her dad) and was hospitalized for a month. Apparently they thought at the time that she would die from it due to the severity of the response. And my older brother and I both were infected with HSV-1 around that same age or younger from our mom but we have had only recurring cold sores on and around the lips with no other major symptoms. I seem to get cold sores almost exclusively when I have a lack of sleep and thus put stress on the body leading to a compromised immune system.\n\nNow our little girl has been infected despite our best efforts, and it breaks my heart. We are concerned about it now being easier to spread to our other children, and the possibility of it spreading my wife's breasts which would affect her ability to breastfeed. Especially concerning if we have more children in the future. And I have found cold sores to be a cause of physical, emotional and social discomfort in my own life so I am very sorry to have passed it along to my daughter.\n\nI had no idea that HSV-1 could be spread through contact with skin. Growing up I only heard of it being through transfer to the lips or mouth (lip-to-lip kissing, sharing cups and utensils, etc.), and a few years ago I read that it could spread to breasts or genitals despite not being HSV-2 (genital herpes). Looking it up online now, I am seeing that they suggest not kissing babies under 28 days to avoid causing neonatal herpes. But it does not make it clear that kissing **ANY** part of the baby could spread the virus. The doctor stated it is possible to spread through kissing the top of her head, but prior to diagnosis said he would be surprised if it was HSV-1 because she was not under 28 days (she was 6.5 weeks at time of kiss). She was full-term and at a healthy weight with no complications during pregnancy or post-partum.\n\nSo I was sitting in the hospital full of regret over that single kiss, and hoping that she is able to make a full recovery. But I am glad that she did develop visible sores and that I suggested along the way that the sores could be due to herpes, because they were able to diagnose and treat the virus relatively early which may have prevented it from spreading to other regions of the body. I am also glad that our baby was healthy on seemingly all account prior to this incident because it would likely affect her worse had there been other compromising factors. And I am hopeful that effective and safe therapeutic and preventative vaccines for the virus will be developed in the near future.\n\nThe sores have been regressing. We were discharged from the hospital six days ago and provided with enough oral antiviral medication for one week. We also have a follow-up appointment at the children's hospital tomorrow. And we were told that we will need to come back to the children's hospital immediately if the sores present themselves again (I assume at least for the next year or two).\n\nI do not want to cause unnecessary or excessive fear among others, but I want to share my experience and raise awareness of the risk. I wish I knew what I do now three weeks ago. I would take back that kiss in a heartbeat.\n\nI would like to point out the following regarding this post:\n\n1. I am not a medical professional and I am not trying to or able to provide medical advice. My username was the first randomly offered username by Reddit and I didn't care to change it at that time; I did not mean to suggest that I am a paramedic. What I am explaining is my current understanding based on my own research and experience and those of others.\n2. I do intend on discussing management of the virus with my doctor soon to see what methods may be available, safe, and effective for me in my efforts to reduce the risk of spreading the virus.\n3. Once infected, the HSV-1 virus remains within the body for life. This may or may not be true for all types of herpes.\n4. Stigma surrounding herpes and its transmission has been preventing honest and open transfer of information or discussion on the topic.\n5. Showing affection for those you love is natural and needed, but should be done in a manner that does not put yourself or others at an increased risk of negative consequences.\n6. I deeply regret kissing my daughter when I did (while she was a baby and while having sores present on my lips) and where I did (semi-exposed skin), but I did not know that transmission through skin on any part of the body was possible. My understanding at the time was that active HSV-1 sores can transfer to others when the virus touches lips, breasts or genitals only.\n7. My mom kissed us on the lips frequently growing up. We would kiss her lips and share drinks with her as long as she did not have an active sore. When I was 14 years-old or so I told her I did not want to kiss her on the lips anymore. She expressed her sadness regarding these wishes and said that I must not love her anymore. I do not know exactly when or how I was infected.\n8. Cold sores were sort of accepted as being normal within my family, despite my mom's extreme reaction to the virus as an older child. And until recently we had other family members insist that kissing children and babies (including on the lips) is normal and needed and that it isn't a big deal to spread cold sores.\n9. When I say that the virus spread despite our best efforts, I do not mean to say that we did everything we could have or should have done. What I mean to say is that we were actively trying to stop the spread of the virus given what we had known at the time. Myself and my wife have done some of our own research regarding the virus at different points in our lives, yet we still did not know what we do now.\n10. If the results of my actions which I have shared here is expected to you given the circumstances, I am glad. But my target audience with this post is people who may not have expected what we have experienced.\n11. I am posting on different subs in an effort to reach different people with our story. We wish we knew what we do now before my kiss because I would not have kissed her when I did (as a baby and while I had a cold sore) or I might not have kissed her on her skin at all at any age knowing I could pass it to her via my saliva on any part of her body. What happened has affected us greatly the last few weeks and may continue to affect us, and we do not want others to go through what we have or worse.\n\n--------------------------------------------------------------------------------------------------------------------------\n\n**Update:**\n\nOur daughter has had two outbreaks of HSV-1 since we initially left the hospital nine months ago or so. The first of those outbreaks was around three weeks after leaving the hospital and resulted in a hospital stay overnight followed by around two months or so of oral antivirals to be provided from home. And the other time was around one month after using up the antivirals from the previous outbreak, but the sores went away on its own within 24 hours. We were going to pickup antivirals for the last time but all pharmacies were closed so we were going to wait until the morning, but the sores were almost fully gone by the morning. Both recurrences appeared in the same location as the initial kiss and outbreak.\n\nMy wife met with an infectious disease doctor in February to discuss our daughter's case, and the doctor said that \"\\[our baby\\] got really lucky. There are limited treatment options and \\[our baby's\\] case was very minor compared to most.\" For more information regarding the HSV infections for babies, search \"Neonatal Herpes\" online. The condition is very serious and often fatal especially without treatment, and there are symptoms other than cold sores which may be worth noting and monitoring because often people infected with HSV do not develop sores.\n\nMyself and most of our family now wear masks around our children or at least while holding our baby when we have an active outbreak of cold sores as a means of trying to prevent infection.",
        "num_comments": 67,
        "comments": [
            "This is very important information. Thank you for sharing this.",
            "\nHi! There is an advocacy group working towards herpes cure, treatment and prevention. They are the ONLY patient advocacy group for herpes globally. Learn more here: r/herpescureadvocates",
            "One of our huge fears when our kid was young. Wife and I both have occasional outbreaks on our lips based on stress responses. \n\nThe compeed cold sore patches have been lifesavers. They do a good job encapsulating the open sore when it gets to that point to limit the possibility of spreading. We naturally avoid any kisses when either has an outbreak but I also had no idea it could be transmitted with a top of the head kiss. That's not common knowledge and I'll be passing that on to my wife, thanks for sharing and you have no reason to beat yourself up.",
            "My daughter first got cold sores when she was about 12 months old, it made her really sick, vomiting and high fever the first few times she got them. She's now 6 and still gets them every so often, particularly if she's worn down or it's dry and her lips get dried out. We have used medicated stick on patches that you can get at the supermarket or pharmacy any time we see a red mark starting to form around her lips, and Zovirax Duo cream (not sure if that's the brand in other countries) she can also recognise the \"tingle\" now when they are coming on. They don't make her sick any more, but we still need to avoid her spreading them to her friends. I recently got my first cold sore, possibly from her, and it was on my lower eyelid, so they really can form in a range of areas, not just around the mouth.",
            "This has been an incredibly informative thread, and I can genuinely say that I learned something new and important.  Thanks, fellow Dads! (And OP for sharing)",
            "Please see your doctor and ask to be put on Valaciclovir. You can take one pill a day and you will not breakout / lower your chances of spreading the virus.",
            "I hope you have kindness for yourself. Thank you for inofming people about this. All the best to your family.",
            "Op hugs dont beatbyourself up that much, that really is such a stretch situation. Hope your baby is now better <3",
            "If it makes you feel any better, its estimated that 70% of the world has HSV-1, just not everyone shows the symptoms or just not frequently.",
            "It sucks but you got lucky. I know someone with a similar story Gma kissed the granddaughter except she lost her battle because she was so young."
        ]
    },
    "Dad, will you still be alive when I'm a grown up?": {
        "title": "Dad, will you still be alive when I'm a grown up?",
        "score": 176,
        "url": "https://www.reddit.com/r/daddit/comments/1dr2p9n/dad_will_you_still_be_alive_when_im_a_grown_up/",
        "content": "\"Dad, will you still be alive when I'm a grown up?\"\n\n\"Sure, but I'll die eventually and that's ok.\"\n\n\"We'll die at the same time?\"\n\n\"Well no, you'll go on longer than me.\"\n\n\"But I won't know how to be old without you\"\n\n..... 😭 How have you dad's dealt with the \"death talk\"?\n",
        "num_comments": 47,
        "comments": [
            "Like all big life talks, it's not a one-and-done conversation. Our understanding of death changes as we learn and mature. So will our questions. It's important to be honest and available while knowing healthy limits. And it's ok to say you dont know something. Be prepared for random follow-up questions at some random time in the future.",
            "We sang a little song about goodbyes and how they will hurt because of how much we love each other and that in all their favorite things is where they can find them again",
            "I was once talking to my son on how since were not that far apart in age, well he old men together.\n\nHe pointed out that I look used up.",
            "Ive not had to have that talk yet, but I do dread the day. But I grew up in a religious household and still believe the same way after falling away and coming back to it. So I believe in heaven. I intend to tell my son the same way I was told and thats pretty much well, we all have to go on someday or there wouldnt be enough room for everyone else. But I believe there is a place for everyone thats a good place and we go there when we die. Its where my grandparents are and where my parents will be and Ill get to see them again when I get there. And then, one day, youll come and see me and we will never be apart again. \n\nEven then, while being comforted that if/when it happened and I lost my parents Id see them again, I used to pray soo hard that wed all die at the same time because I didnt want to be left alone here. So, you can do your best and really can comfort your kid about it however you see fit, but we all still have probably had those existential moments of fear about it as we aged. And they will too. The important thing is you keep it simple and honest and be there for them when they worry about it in the future.",
            "The great Indian Sage Ramana Maharshi was dying, and a disciple asked \"Where are you going? Why are you leaving us?\" And he opened his eyes, and he laughed and said,\"Where can I go? There is nowhere to go. I will always be here.\"\n\nI will teach my children that no matter what happens I will always be with them and they will be with me.",
            "Youll learn by the time you get old\n\nI remember telling my mum I wished I died before her so I wouldnt have to be alone lol. All kids say shit like this sooner or later",
            "Its a tough talk, but fortunately Lion King has a nice scene that has us covered.",
            "A few years back, my wife lost her grandfather after a long period of being on death watch. I think it made my son, then 3yo, aware that other people had grandparents. One day, when Mum was at work, he asked me why he had never met my granddad. I'd known this was coming one day, so I was prepared with the line. \"He died when I was 18, many years ago.\" My son responded that he was sure granddad missed me.\n\nHonestly, I sometimes hear my granddads echo in my son. Flat broke me hearing that from him.",
            "It's a tough conversation. My son asked me this in the car. And I tried explaining I'd just be gone when I die. He replied \"but that's ok daddy because I'll love you forever.\" I straight up cried while driving.",
            "I vividly remember having a death talk with my mum , I asked her if people ever die on there birthday obviously she said yes. Years later in 2010 on her 57th birthday she died but I still remember her explaining death"
        ]
    },
    "She went quiet upstairs, she found the sudocrem, send help": {
        "title": "She went quiet upstairs, she found the sudocrem, send help",
        "score": 99,
        "url": "https://i.redd.it/5dqckhwzmg9d1.jpeg",
        "content": "Of course what the happened is I got it all in her hair when I took her pj's and vest off, then she repeatedly touched her face and eyes. 30 mins of scrubbing and stress, crying and screaming and I've decided I'll put the cream up higher. Happy Saturday morning guys.",
        "num_comments": 19,
        "comments": [
            "Silence around a toddler is panic inducing for me it means stuff is going too well",
            "First time? I found my kiddo eating it Winnie the Pooh style more than once",
            "i have faced similar scenes but with vaseline. getting that off was difficult to say the least",
            "Lesson learnt, I should have wiped it off with a towel first rather than getting it in her hair, face etc, absolute schoolboy error. \n\nI left the house then saw a seagull eating a pigeon on a neighbours car so it's just been a weird one!",
            "Doctors hate this one trick. \n\n(So do parents)",
            "Not gonna need to moisturise until Christmas",
            "I immediately regret my decision\n\nEdit: my daughter has the exact same top :)",
            "Get a child lock on the bathroom door. Lots of worse things a kid can do alone in a bathroom.",
            "How big was that tub of sudacrem?! Thats an impressive effort to get that much coverage.",
            "Mine gives me a warning. Go away daddy means watch me like a hawk."
        ]
    },
    "It.. is time": {
        "title": "It.. is time",
        "score": 216,
        "url": "https://i.redd.it/xn69w8duxe9d1.jpeg",
        "content": "Well boys.. time to earn my rite of passage. ",
        "num_comments": 33,
        "comments": [
            "Don't forget to complain about how uncomfortable that chairbed is! Your wife will love hearing about it.",
            "Earlier today I looked back at my own chair post from 5 months ago, and I realized that this post marks the beginning of a journey. No matter what happens next, the moment you post this chair your entire life is about to be changed forever. Good luck, dad",
            "WHOOOOO HOOO! WELCOME IF ITS YOUR FIRST",
            "I don't envy the lack of sleep you are about to have for the next three months. \n\nWelcome!",
            "Congratulations! I hope it goes quickly and uneventfully (except for the whole baby being born thing)!",
            "Get ready to eat some delicious hospital food for your (hopefully only) 2 day stay!",
            "Goodbye back, hello kiddo! Congrats to yous both",
            "My back hurts looking at it",
            "The chair that changes your soul.",
            "Congrats man!! I was there a few months ago. Even though my little guy was being wheeled into the NICU, it was the greatest feeling in the world walking behind him."
        ]
    }
}