{
    "r/dadjokes is supporting Save the Children, find out more": {
        "title": "r/dadjokes is supporting Save the Children, find out more",
        "score": 4,
        "url": "https://www.reddit.com/r/dadjokes/comments/1dqn5af/rdadjokes_is_supporting_save_the_children_find/",
        "content": "Hey everyone,  \n**This season we’re supporting: Save the Children**\n\nFounded in 1919, Save the Children is an international, non-government operated organisation dedicated to improving the lives of children worldwide. They have helped raise money to improve kids lives by creating better education, healthcare and economic opportunities around the world. In 2022, Save the Children helped 118 million children in 116 countries.\n\n**How to contribute**  \nEvery purchase of [dad joke merch](https://dadserious.co/) from [Dad Serious](https://dadserious.co/) will donate a portion to Save the Children during this season. Fresh dumb dad joke designs on the regular. Redditors can get 15% off with this code: DADJOKESMARCH\n\nOr you can donate directly to your region’s [Save The Children](https://www.savethechildren.org/) and send me a DM to verify for our total.\n\nWhether you like to keep your donation pure or get something fun for your money and know it's also doing good, you're a legend either way.\n\n**Quick update on our last season**  \nHere is [our donation](https://imgur.com/a/NV1hQCv) to Make-A-Wish Thank you to everyone who got involved.\n\n**We’ve now raised a total of $371 for charity!**  \nNot bad for early days - every little bit counts - can’t wait to see what we can do over the year.\n\n*This is still a bit of an experiment to see how we can build something that turns bad jokes into good outcomes. If you have any thoughts, or you'd like to recommend a charity, feel free to DM or comment.*",
        "num_comments": 1,
        "comments": []
    },
    "If you were conceived while your parents listened to “Red red wine” after it was first released…": {
        "title": "If you were conceived while your parents listened to “Red red wine” after it was first released…",
        "score": 557,
        "url": "https://www.reddit.com/r/dadjokes/comments/1dqxmdk/if_you_were_conceived_while_your_parents_listened/",
        "content": "UB40 now",
        "num_comments": 56,
        "comments": [
            "You've been waiting for this day, haven't you?",
            "Technically you would be like 57",
            "My coworker complained about being hungover after a UB40 concert, and I was ecstatic when I said “must’ve been all the red, red wine”",
            "How long have you been waiting",
            "Lordy lordy look who's forty!",
            "I lost my virginity to it.  Guess my age.",
            "Wait a minute… I am forty. Oh dear Lord in heaven!",
            "I googled that, u b correct.",
            "Sorry but that wasn't when it was first released. Still enjoyed the joke though",
            "I can't say they weren't listening to Neil Diamond's original version"
        ]
    },
    "I walked up to our gate with my family and my daughter said “I am so glad our gate does not have cancer”": {
        "title": "I walked up to our gate with my family and my daughter said “I am so glad our gate does not have cancer”",
        "score": 46,
        "url": "https://www.reddit.com/r/dadjokes/comments/1dravqi/i_walked_up_to_our_gate_with_my_family_and_my/",
        "content": "I turned and asked why.  She said it is B9. It is an amazingly proud dad joke day!!!!",
        "num_comments": 9,
        "comments": [
            "True story: my sister had to go to Denver on business years ago.  Walking to the baggage area there was a sign for an oncologist convention in town \" Welcome Oncologists\".... Just past it was a permanent airport sign \"To The Terminal\"",
            "That's great! Just tell her not to be too loud when she's telling jokes around gate C4.",
            "If you lived in Spain, and your gate was B11 it would be Beyoncé",
            "She loved this one as well",
            "We are on our way to Mexico so this works as well!!!",
            "She is so proud right now",
            "A pirate goes to the skin doctor and says, “Aaaarrrgghh, doc, I have these moles on me back. Tell me, do I have cancer?”\n\nThe doctor takes a quick look and says “It’s okay, they’re benign”\n\nThe pirate says “Count again, I think there be ten”",
            "Clever 😂",
            "Ouch!"
        ]
    },
    "Someone stole all my fruit": {
        "title": "Someone stole all my fruit",
        "score": 110,
        "url": "https://www.reddit.com/r/dadjokes/comments/1dr3up5/someone_stole_all_my_fruit/",
        "content": "I am peachless!",
        "num_comments": 46,
        "comments": [
            "It was a crime of passion...fruit....",
            "Guess your effort to get them back was... Fruitless",
            "That's bananas. Maybe if you call the cops a pear of officers can help.",
            "You need to fig-get about it",
            "How orange you outraged about this?",
            "That was berry mean of them.",
            "What Date did this happen.",
            "Don't worry, I'm solve this for you.  When I find out who did it, there will be blood orange",
            "Pretty sure that's a melony. You need to guavter him.",
            "Sounds like it was a berry successful crime."
        ]
    },
    "My wife threw some omega 3 capsules at me this morning.": {
        "title": "My wife threw some omega 3 capsules at me this morning.",
        "score": 227,
        "url": "https://www.reddit.com/r/dadjokes/comments/1dqxhpn/my_wife_threw_some_omega_3_capsules_at_me_this/",
        "content": "I'm okay. I only have super fish oil injuries.",
        "num_comments": 23,
        "comments": [
            "Oh thank cod for that.",
            "Seems fishy to me.. what did you do to bait her into such a reaction??",
            "Did she do that on porpoise?",
            "Friend - How often did your wife do that ?\n\nMe - One A Day.",
            "Reel her in! Take those capsules!",
            "I hope you told her she has a fatty acid.",
            "This was a Krill-er joke",
            "Hmmm... Something fishy about this",
            "At least she was sharing and not being shellfish.",
            "Be careful of those injuries though, make sure they 'eel properly"
        ]
    }
}