{
    "🔴LIVE | June 27, 2024 - \"Lori Gottlieb\" - The Daily Show Episode Discussion": {
        "title": "🔴LIVE | June 27, 2024 - \"Lori Gottlieb\" - The Daily Show Episode Discussion",
        "score": 9,
        "url": "https://www.reddit.com/r/DailyShow/comments/1dq8cwv/live_june_27_2024_lori_gottlieb_the_daily_show/",
        "content": "[**The Daily Show**](https://i.imgur.com/wXjxSxn.png) is hosted by Jon Stewart on Mondays, and by The Best F#@king News Team (correspondents/contributors) from Tuesday to Thursday. It airs at 11/10c on [Comedy Central](https://www.cc.com/shows/the-daily-show) and streams next day on [*Paramount+*](https://www.paramountplus.com/shows/the-daily-show/). Clips from the episode get disseminated on the show's social media: [YouTube](https://www.youtube.com/thedailyshow), [TikTok](https://www.tiktok.com/@thedailyshow), [Instagram](https://www.instagram.com/thedailyshow/), [Facebook](https://www.facebook.com/thedailyshow), [Threads](https://www.threads.net/@thedailyshow), and [X](https://x.com/TheDailyShow). The 'Ears Edition' of the show is also available as an [Official Podcast](https://www.iheart.com/podcast/1119-the-daily-show-ears-editi-29213961/), which features audio clips from the full show, extended content, exclusive interviews, and more.\n\n*Use this thread to discuss this episode of The Daily Show, hosted by Jon Stewart.*\n\n# ← [Previous Discussions](/r/DailyShow/search/?q=flair%3A%22%3Akarma%3A%20Episode%20Discussion%22&sort=new) | [Upcoming Guests](https://www.interbridge.com/lineups.html#DS) →",
        "num_comments": 16,
        "comments": [
            "All commentary about the debate aside this episode kind of sucked. His monologue? Awesome as always. But I expected an hour (which is what YTTV has it set as) of commentary, with an interview or two and some segments are the corespondents. \n\nWhen Jon cut off the therapist and apologized that they were short on time I was like wait...what? You're going to do a live post debate show and half the episode is this interview? Like I love the idea of having her on but on a normal episode or if they had an hour and the interview was just a small portion of that. \n\nIt was a great monologue and I'm happy we got that. But man I was expecting a really cool hour long special, or atleast thirty minutes spent on the debate and with a more relevant guest.\n\nDoes anyone else feel the same way?",
            "You can Stewart didn’t think Biden did well, from just one sentence.",
            "Was this only a 30 min episode? The guide listed it as 1 hour but South Park started playing after only 30 min even though the guide said it should have still been daily show.",
            "Can this be watched now on Paramount?",
            "I needed this after that",
            "Is anyone actually seeing this on their Paramount+? We can’t see it anywhere…",
            "Neither man met those expectations.",
            "Where is it on Paramount +?  I can't find it.",
            "Can anyone see the stream or comments about the stream???",
            "Why wouldn’t they do an hour tonight? They definitely used to for live shows. And some nights episodes go 40 min."
        ]
    },
    "Tickets for The Daily Show's Milwaukee RNC tapings available (7/15 - 7/18)": {
        "title": "Tickets for The Daily Show's Milwaukee RNC tapings available (7/15 - 7/18)",
        "score": 6,
        "url": "https://1iota.com/show/1728/the-daily-show-in-milwaukee",
        "content": "",
        "num_comments": 22,
        "comments": [
            "Awesome! I had no idea. Thanks so much!",
            "super stoked about this! it's my first time requesting tickets for a live show taping. any idea how long before the taping that they typically let people know they were chosen for ga or priority?",
            "[removed]",
            "Will Jon Stewart be hosting the Monday taping in addition to the live show on Thursday that week?",
            "You can request free tickets for The Daily Show in Milwaukee:\n\n[https://1iota.com/show/1728/the-daily-show-in-milwaukee](https://1iota.com/show/1728/the-daily-show-in-milwaukee)\n\nIt's based on a lottery system. Pretty good chance of getting the free tickets since not a lot of people know about it.\n\nYou can apply for all four days (Monday-Thursday July 15-18, 2024).",
            "I signed up for like every day this week back at the end of May and just got the email today that I got general admission for one of them.",
            "[removed]",
            "You may have misspelled Jon's name (\"*John*\"); please note that it is **Jon Stewart**. If you were referring to someone else, please disregard this comment!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/DailyShow) if you have any questions or concerns.*",
            "Probably not, given what they've done this week with the debate.",
            "Do you not know how post links work? You keep posting the link that's literally the link of the post."
        ]
    },
    "Hot take: Someone needs to convince Jon Stewart to run for the Democratic nomination": {
        "title": "Hot take: Someone needs to convince Jon Stewart to run for the Democratic nomination",
        "score": 15154,
        "url": "https://i.redd.it/5dwu0vc08a9d1.jpeg",
        "content": "Yes, I know the man doesn't want the job, but he'd honestly be the perfect candidate. He'd decimate Trump and save our nation. Newsom, Harris, no thank you.\n\nHe has the name recognition and fanbase to win. It would be a bad career move for him, sure. But it would end up saving democracy itself.\n\nDoes anyone agree?",
        "num_comments": 1416,
        "comments": [
            "He’ll never agree to it. He’s been clear for years that he has zero political ambitions whatsoever.\n\nBut…I can’t think of a single democrat who would outperform him if he stepped into the race. Widely popular, even moderate republicans consider him trustworthy, would raise millions in donations overnight that could give him a fighting chance at being viable, plays well in swing states, and he could mop the floor with anyone in a debate.\n\nI really don’t see anyone else who could do better, but that doesn’t change the fact that he would never in a million years consider running. I’m pretty sure he’d rather gnaw on hunks of broken glass than consider political office.",
            "He’s been saying he doesn’t want to do it for as long as people have been saying he should do it\n\nE: y’all I agree with you, I’m just relaying what he said from his own mouth several times and has kept reiterating over the course of a couple of decades",
            "He'd win by an absolute landslide. \n\nSeriously. It wouldn't be close. But he won't do it b/c he doesn't want the stress/anger/responsibility. What makes him the perfect candidate is what makes him not want it.",
            "Establishment democrats are a thing, and they have a lot of reasons not to invest in an outside candidate like Jon.",
            "He's too smart for that",
            "In an alternate reality Jon Stewart is the democrat nominee and he's going up against Stephen Colbert as the Republican nominee.",
            "Zelensky was a comedian before he became an effective leader.  He performed when his country needed him most.  Jon?",
            "I’d vote for him in a heartbeat. Hands down would do a better job, for sure.",
            "4 years ago after Biden was elected, democrats needed to throw their weight behind an heir apparent.  This was their second greatest failure in the last decade.  The first was nominating Hillary.",
            "Or maybe America needs to realize that it's celebrity worship is a problem."
        ]
    },
    "People were Mad Online after Stewart’s first episode back…turns out he was right after all.": {
        "title": "People were Mad Online after Stewart’s first episode back…turns out he was right after all.",
        "score": 1267,
        "url": "https://www.reddit.com/r/DailyShow/comments/1dqnp5q/people_were_mad_online_after_stewarts_first/",
        "content": "Just thinking about some of the “blowback” from Jon’s return episode from some of the online talking heads complaining about his centrism etc after he (rightfully) pointed out that Biden’s age was, in fact, an important inflection point in this election.\n\nHate to say it, he was right.\n\nNot a conservative/Trump person at all. But Jon’s point that we need to hold elected officials to higher standards, and that it’s the candidate’s job to convince us (the voter) of his or her electability is ringing truer than ever after that circus last night. \n\nIt’d be funny if the fate of the country didn’t hang in the balance.",
        "num_comments": 426,
        "comments": [
            "I’ll still take a decrepit Joe in a coffin over Trump",
            "I don’t have a problem with Stewart. Never did. He isn’t a cheerleader. That is not his job.",
            "I’m mad about the whole situation but I definitely don’t want to live under the Project 2025 craziness. So I’ll be voting blue no matter what or who. When this shit show is over, we can stage whatever protests we need to but not this year.",
            "It's crazy because both men should be retired! Like over 10 years ago. Everyone over 65 should have to retire from Congress and the Court. No reason these people should be allowed to keep going after that time. Affecting legislation from 2 generations ago. They need forced retirement. Make it happen and we won't have situations like this. They can go work wherever if they still want to, just get them out of office! Asap!",
            "His debate last night didn't do anything to change anyone's mind. It just confirmed his critics' actual issues with him.\n\nLiving in a swing state, I really didn't change how I'm going to vote based on lat night.",
            "I'll say he was not wrong.  But I don't think he was right that the age thing is such an issue.  Where he was 100% right  was that we need to hold the media to a higher standard.  They're an absolute clown show trying to draw up drama and conflict, and we're dying as a society because of it.  Nobody holds anyone to anything, and you have to go to the courts to determine \"reality\".",
            "Biden surrounds himself with competent people. Dump surrounds himself with ass lickers and morally compromised shit bags like DeVos and Pruitt.\n\nI am taking Biden every time.",
            "The time to replace Joe was during the primaries/qualifiers. Contestants lined up at the starting line, is way too late to be changing our minds. *Anyone with a pulse* will have to do.",
            "Jon wasn’t wrong, but he also wasn’t completely right. Everyone frames the vote for the presidency as a single person. It’s really not. This isn’t Trump v Biden. It’s the Biden administration v a new iteration of the Trump administration. And v2 of the Trump administration is going to be far worse than v1. So yeah, I wish Joe had stepped aside, I do, but at this point his administration is far more competent and far less dangerous than anything Trump will put together. And that SHOULD be how we frame this. Because the chance to have a different Dem nominee is long gone. And, quite frankly, it’s how every presidential election should be framed.",
            "I’d like to point out that we had a president that served after a stroke and one that was in a wheelchair for three terms both while running the country during world wars."
        ]
    },
    "Jon Stewart's Debate Analysis: Trump's Blatant Lies and Biden's Senior Moments": {
        "title": "Jon Stewart's Debate Analysis: Trump's Blatant Lies and Biden's Senior Moments",
        "score": 1808,
        "url": "https://youtu.be/3SJr44m-w1Y",
        "content": "",
        "num_comments": 494,
        "comments": [
            "That was something else. You could see the fumes coming out of Jon's ears. He was so incredibly pissed and absolutely right, nobody won tonight.",
            "How did Biden not go: “Donald that’s not what the moderator asked, and I am not going to respond to issues that are not the topic at hand”",
            "I am SO glad this man is back.",
            "Bottom line is still one administration that would uphold democracy and the other very likely ushering in a theocratic dictatorship.",
            "Trump tried to turn the entire debate into a discussion about immigration (where he polls best), so the fact that Biden turned his best issue (abortion/womens' rights) into an immigration issue ('that one woman was killed by an immigrant') is MIND BOGGLING.\n\nHow you fumble the easiest layup ever?",
            "Thank goodness for Jon, he helps us to laugh through the pain and nausea.\n\nFirst smile I've cracked since starting to watch the dumpster fire, er, debate.  been dazed with despair ever since.  it was like watching a food fight between two inmates of the old folks' home.",
            "I would have done a better job debating on bidens behalf than he did unfortunately",
            "I feel like Jon kinda missed here. The debate was actually insane, at one point I was legit jumping up and down. Some intense shit tonight people",
            "This is the longest telegraphed own goal by the Democrats since...  McGovern in 72?\n\nClearly, the DNC would rather lose to Trump than win with an outsider they don't fully control, e.g. Sanders in 2016 or even Newsom in 2024.\n\nBiden showed obvious signs of mental decline in 2020, as compared to 2016. The DNC didn't care and most Democratic voters clearly didn't care.\n\nBiden has clearly declined further -- much further -- since then. The DNC still didn't care. And Democratic voters were still in the same echo chamber, quick to attack anyone who dared to criticize a second term for a doddering old man.\n\nIf the DNC cared about winning, and cared about doing the right thing by the country (rather than preserving the status quo), they would either have forced Biden to step down, or at least not strong-armed candidates like Newsom from offering a soft 'kid gloves' challenge of Biden, to pick up the torch if Biden faltered.\n\nIf they didn't think Biden could handle a primary race and debate, why did they think he could handle a general election campaign and debate?\n\nAt the very least, the DNC should have helped put Newsom on the ticket with a very public wink and nod that Newsom would step in if and when Biden deteriorates further and the 25th Amendment needs to be invoked.\n\nKamala Harris has zero charisma, zero speaking skills, and inspires zero confidence. She couldn't talk her way out of a moment of silence.\n\nFrankly, I fear even putting Newsom on the ticket now would be too little, too late.\n\nThe DNC is betting the entire pot, America's constitutional Republic and world security on a weak, senile, and doddering old man. But hey -- status quo baby, they get rich either way!",
            "It's really a sad state of affairs that they let Biden embarrass himself this badly."
        ]
    }
}