{
    "🔴LIVE | June 27, 2024 - \"Lori Gottlieb\" - The Daily Show Episode Discussion": {
        "title": "🔴LIVE | June 27, 2024 - \"Lori Gottlieb\" - The Daily Show Episode Discussion",
        "score": 7,
        "url": "https://www.reddit.com/r/DailyShow/comments/1dq8cwv/live_june_27_2024_lori_gottlieb_the_daily_show/",
        "content": "[**The Daily Show**](https://i.imgur.com/wXjxSxn.png) is hosted by Jon Stewart on Mondays, and by The Best F#@king News Team (correspondents/contributors) from Tuesday to Thursday. It airs at 11/10c on [Comedy Central](https://www.cc.com/shows/the-daily-show) and streams next day on [*Paramount+*](https://www.paramountplus.com/shows/the-daily-show/). Clips from the episode get disseminated on the show's social media: [YouTube](https://www.youtube.com/thedailyshow), [TikTok](https://www.tiktok.com/@thedailyshow), [Instagram](https://www.instagram.com/thedailyshow/), [Facebook](https://www.facebook.com/thedailyshow), [Threads](https://www.threads.net/@thedailyshow), and [X](https://x.com/TheDailyShow). The 'Ears Edition' of the show is also available as an [Official Podcast](https://www.iheart.com/podcast/1119-the-daily-show-ears-editi-29213961/), which features audio clips from the full show, extended content, exclusive interviews, and more.\n\n*Use this thread to discuss this episode of The Daily Show, hosted by Jon Stewart.*\n\n# ← [Previous Discussions](/r/DailyShow/search/?q=flair%3A%22%3Akarma%3A%20Episode%20Discussion%22&sort=new) | [Upcoming Guests](https://www.interbridge.com/lineups.html#DS) →",
        "num_comments": 16,
        "comments": [
            "You can Stewart didn’t think Biden did well, from just one sentence.",
            "Was this only a 30 min episode? The guide listed it as 1 hour but South Park started playing after only 30 min even though the guide said it should have still been daily show.",
            "Can this be watched now on Paramount?",
            "I needed this after that",
            "Is anyone actually seeing this on their Paramount+? We can’t see it anywhere…",
            "Neither man met those expectations.",
            "Where is it on Paramount +?  I can't find it.",
            "Can anyone see the stream or comments about the stream???",
            "Why wouldn’t they do an hour tonight? They definitely used to for live shows. And some nights episodes go 40 min.",
            "Nice fine print, “streams next day on paramount+”. This dystopia of a future we have is getting on my nerves. The movie idiocracy is increasingly prophetic and I’m more of the mind that a lifeless universe would be a better one. \n\nStupid humans making everything as crappy as possible for *checks notes* shits’n giggles. I’d say go to hell but we’ve renovated hell here so… good job everyone."
        ]
    },
    "Tickets for The Daily Show's Milwaukee RNC tapings available (7/15 - 7/18)": {
        "title": "Tickets for The Daily Show's Milwaukee RNC tapings available (7/15 - 7/18)",
        "score": 6,
        "url": "https://1iota.com/show/1728/the-daily-show-in-milwaukee",
        "content": "",
        "num_comments": 23,
        "comments": [
            "Awesome! I had no idea. Thanks so much!",
            "super stoked about this! it's my first time requesting tickets for a live show taping. any idea how long before the taping that they typically let people know they were chosen for ga or priority?",
            "Will Jon Stewart be hosting the Monday taping in addition to the live show on Thursday that week?",
            "I signed up for like every day this week back at the end of May and just got the email today that I got general admission for one of them.",
            "You may have misspelled Jon's name (\"*John*\"); please note that it is **Jon Stewart**. If you were referring to someone else, please disregard this comment!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/DailyShow) if you have any questions or concerns.*",
            "Probably not, given what they've done this week with the debate.",
            "Do you not know how post links work? You keep posting the link that's literally the link of the post.",
            "I got my ticket offer yesterday for one of the shows as well!",
            "Where did you post it?",
            "It's *literally* the post. Do you not know how link posts work?"
        ]
    },
    "Hot take: Someone needs to convince Jon Stewart to run for the Democratic nomination": {
        "title": "Hot take: Someone needs to convince Jon Stewart to run for the Democratic nomination",
        "score": 15777,
        "url": "https://i.redd.it/5dwu0vc08a9d1.jpeg",
        "content": "Yes, I know the man doesn't want the job, but he'd honestly be the perfect candidate. He'd decimate Trump and save our nation. Newsom, Harris, no thank you.\n\nHe has the name recognition and fanbase to win. It would be a bad career move for him, sure. But it would end up saving democracy itself.\n\nDoes anyone agree?",
        "num_comments": 1477,
        "comments": [
            "He’s been saying he doesn’t want to do it for as long as people have been saying he should do it\n\nE: y’all I agree with you, I’m just relaying what he said from his own mouth several times and has kept reiterating over the course of a couple of decades",
            "He'd win by an absolute landslide. \n\nSeriously. It wouldn't be close. But he won't do it b/c he doesn't want the stress/anger/responsibility. What makes him the perfect candidate is what makes him not want it.",
            "Establishment democrats are a thing, and they have a lot of reasons not to invest in an outside candidate like Jon.",
            "He's too smart for that",
            "In an alternate reality Jon Stewart is the democrat nominee and he's going up against Stephen Colbert as the Republican nominee.",
            "Zelensky was a comedian before he became an effective leader.  He performed when his country needed him most.  Jon?",
            "I’d vote for him in a heartbeat. Hands down would do a better job, for sure.",
            "4 years ago after Biden was elected, democrats needed to throw their weight behind an heir apparent.  This was their second greatest failure in the last decade.  The first was nominating Hillary.",
            "I wouldn’t mind seeing Jon be the moderator of the “next” presidential debate. He would ask real questions and fact check the fuck out of them. It would bay WAY better than the fucking clown show last night",
            "Absolutely not. He doesn't want the job because he's smart enough to stay in his lane. It's a nice thought, but in reality he's never campaigned for any elected office before. While he is a popular comedian, many people would consider a Stewart candidacy a joke. It would be a huge risk and Stewart would be the first person to say \"no way, that's fucking insane.\""
        ]
    },
    "People were Mad Online after Stewart’s first episode back…turns out he was right after all.": {
        "title": "People were Mad Online after Stewart’s first episode back…turns out he was right after all.",
        "score": 1477,
        "url": "https://www.reddit.com/r/DailyShow/comments/1dqnp5q/people_were_mad_online_after_stewarts_first/",
        "content": "Just thinking about some of the “blowback” from Jon’s return episode from some of the online talking heads complaining about his centrism etc after he (rightfully) pointed out that Biden’s age was, in fact, an important inflection point in this election.\n\nHate to say it, he was right.\n\nNot a conservative/Trump person at all. But Jon’s point that we need to hold elected officials to higher standards, and that it’s the candidate’s job to convince us (the voter) of his or her electability is ringing truer than ever after that circus last night. \n\nIt’d be funny if the fate of the country didn’t hang in the balance.",
        "num_comments": 483,
        "comments": [
            "I’ll still take a decrepit Joe in a coffin over Trump",
            "I don’t have a problem with Stewart. Never did. He isn’t a cheerleader. That is not his job.",
            "I’m mad about the whole situation but I definitely don’t want to live under the Project 2025 craziness. So I’ll be voting blue no matter what or who. When this shit show is over, we can stage whatever protests we need to but not this year.",
            "It's crazy because both men should be retired! Like over 10 years ago. Everyone over 65 should have to retire from Congress and the Court. No reason these people should be allowed to keep going after that time. Affecting legislation from 2 generations ago. They need forced retirement. Make it happen and we won't have situations like this. They can go work wherever if they still want to, just get them out of office! Asap!",
            "His debate last night didn't do anything to change anyone's mind. It just confirmed his critics' actual issues with him.\n\nLiving in a swing state, I really didn't change how I'm going to vote based on lat night.",
            "I'll say he was not wrong.  But I don't think he was right that the age thing is such an issue.  Where he was 100% right  was that we need to hold the media to a higher standard.  They're an absolute clown show trying to draw up drama and conflict, and we're dying as a society because of it.  Nobody holds anyone to anything, and you have to go to the courts to determine \"reality\".",
            "Biden surrounds himself with competent people. Dump surrounds himself with ass lickers and morally compromised shit bags like DeVos and Pruitt.\n\nI am taking Biden every time.",
            "This was also my first thought after watching the Debate. That second episode where he defended himself really stands out now.",
            "The time to replace Joe was during the primaries/qualifiers. Contestants lined up at the starting line, is way too late to be changing our minds. *Anyone with a pulse* will have to do.",
            "I’d like to point out that we had a president that served after a stroke and one that was in a wheelchair for three terms both while running the country during world wars."
        ]
    },
    "Jon Stewart should not run for president. His value lies in uniting the centrists.": {
        "title": "Jon Stewart should not run for president. His value lies in uniting the centrists.",
        "score": 54,
        "url": "https://www.reddit.com/r/DailyShow/comments/1dr50tr/jon_stewart_should_not_run_for_president_his/",
        "content": "Jon Stewart is smart, relatable, and aware of the atrocities that occur under our noses every single waking moment that we spend spend distracted by survival.\n\nHe would never get a democratic nomination. Independents never win.\n\nHis value lies in bonding the severed respect that Americans used to hold for each other's independence. Foreign interference has played our population like a chess grand master in a game of tic-tac-toe. \n\nWe have supported all Americans. We can support all Americans. A person like Jon can rekindle the mutual reverence that was lost when we began to rely on media streams that were feeding a starved population. We left behind the morality that fused our nation together through decades for decisive views that barely affect us as individuals. \n\nWe have more in common with other Americans than we realize, because we are all here, struggling together. We work, go to school, and spend each day of our lives together. We are all here. We are all struggling. We are all left behind.\n\nJon Stewart sees it. He preaches it. He carries a burden we used to share, and I believe he could be the right person to show our people that we are actually still here, still together. And I truly believe, if given the platform, Jon could be one of the voices that reunites this country.",
        "num_comments": 19,
        "comments": [
            "Jon Stewart WILL not run for President. His value lies in working one day a week so he can be present in the lives of his kids and his wife.",
            "Why is this idea even floating around ? What a circlejerk of a subreddit",
            "What exactly is this \"CENTRIST\" policy that Trump is selling that these spooky communists democrats are frightening the masses away with? I call bullshit. To quote Carlin - \"Spooky language! Spooky language!\"\n\nI think this is the boogeyman communist fearmongering for democrats. Nobody can ever list the specific issue. What? Is AOC going to force your kids to be trans in school? Give this crap up already.",
            "Jon was never going to run for president.  But agreed he can help unify moderates… center left, center and center right need to have a more unified voice.\n\nThe good news on the left is they are MUCH better at electing moderates than the right.  Trump is a threat we need to all focus on beating first and then we can figure out the rest",
            "He should do it one day a week",
            "Wrong. He would be the greatest president of all time.",
            "I find the similarities between Jon Stewart and zielinski. Pretty amazing and I think he would do a great job. I also think he would not take it but for the options we have right now and even anyone in government right now, I think he'd be an amazing choice.",
            "Nah. Centrists are the whole problem.",
            "He can sit on the sidelines and try to make his voice heard or we give him the microphone and let him go for it. I'm more excited for his candidacy than I am  for Biden. If the DNC  doesn't consider exploring this as an option, I will skip. We got screwed with Bernie, done with DNC gatekeepers.",
            "They aren’t off base. Who has unified people better? He is an extremely smart and empathetic man with charisma and leadership."
        ]
    }
}