{
    "Freedom Friday Post": {
        "title": "Freedom Friday Post",
        "score": 3,
        "url": "https://www.reddit.com/r/Dallas/comments/1dqbnrg/freedom_friday_post/",
        "content": "Welcome to the Freedom Friday Post!\n\nWhat is a Freedom Friday post? It's a place to discuss pretty much anything with other r/Dallas users. Things that would usually be considered off-topic are welcome.  Rules 1, 6, 7, 8, 9, and 10 are considered suspended within this thread. Please keep the other [sub rules](https://www.reddit.com/r/Dallas/wiki/rules) in mind though.\n\nHave an opinion on a state/national/world news event? Post about it.  \nWant to advertise something? Go for it.  \nHow's your day going? Post it.   \nSuccess this week? Post it.   \nVenting about something? Post it.   \nOpinions on the driver that rode your ass on 635 on the way to work? Post it.",
        "num_comments": 4,
        "comments": [
            "To the car that got hit near the HOV lane north bound entrance on 75 today at 12:20 PM, I have the footage if you need it.",
            "How are yall celebrating the last weekend of Pride month?",
            "I saw Joe Biden got absolutely schlonged in the debate yesterday",
            "Comedy Show \nHello everyone, I'm a traveling comedian, and I'll be making my debut at the Dallas Comedy Club in August. If you need a good laugh or just want to get out of the house, feel free to come out.\n\n[Comedy Show ](https://www.prekindle.com/promo/id/533136497078167100)"
        ]
    },
    "Been to multiple states, drivers in dallas are in different level": {
        "title": "Been to multiple states, drivers in dallas are in different level",
        "score": 88,
        "url": "https://www.reddit.com/r/Dallas/comments/1dra6og/been_to_multiple_states_drivers_in_dallas_are_in/",
        "content": "What y'all think? Dallas seems to have more of a road rage attitude when it comes to driving and maturity went outta window. What yall think compare to other state drivers? ",
        "num_comments": 75,
        "comments": [
            "Yes, I have driven all over the country and in Europe and Dallas is a special sort of hell.\n\nI think it comes down to lack of police enforcement of well, really ANY rules while driving. And just a lack of drivers giving a shit about anything.",
            "I always find driving in Chicago to be particularly intense. I think it’s a big city thing tbh",
            "LA, Houston, Boston, Dallas. Lived in all of them and they all drive the same. Big cities gonna big city.",
            "Yesterday a grandma stopped on a left green arrow, when I honked at her to go she stuck her middle finger out of the window…",
            "”Keep Dallas Dangerous\" \nBut seriously driving here is awful. Have had guns pulled on me, near misses on being run off the road and just general incompetent drivers being super aggressive.",
            "Coming from Chicago I feel at home driving around here.  Just needed to speed up +20mph",
            "I’m From here ….Dallas is officially a shit hole of trash ass drivers with no respect for others.  Police do nothing about it either. I think the road rage is just a bi-product. If the police don’t police people take the matters in their own hands which make it even worse   WORST PART IS I SEE NO END !",
            "People are worse in the heat.",
            "Drivers in Dallas are unhinged. People here tend to not have good control over their mental health and anger issues and are easily triggered. Throw in that people drive big trucks that give them false bravado and the gun ownership rates, and it's a recipe for disaster.",
            "Dallas is definitely more stressful but I don’t put all the blame on the drivers. \n\nThe highway system is more convoluted than anywhere else I’ve driven; it forces drivers to be aggressive just to do normal things like exit the highway. I’ve also been in multiple situations where I have to quickly slow down from 70 to 25 even though nobody has done anything wrong."
        ]
    },
    "What does Dallas do better than most other US cities?": {
        "title": "What does Dallas do better than most other US cities?",
        "score": 43,
        "url": "https://www.reddit.com/r/Dallas/comments/1drbczn/what_does_dallas_do_better_than_most_other_us/",
        "content": "Looking for replies that aren’t sarcastic or hating on Dallas. I’m genuinely looking for responses on what benefits Dallas has that other cities can’t match. If it’s even a subtle small benefit, I’ll take it.\n\nI have hand foot mouth disease right now so I’m just looking for some positivity amidst this terrible pain LOL.",
        "num_comments": 216,
        "comments": [
            "If you like fancy things, Dallas does fancy right.",
            "Ease of exit. It’s easier to get around the world from Dallas than it is from other cities in the US.",
            "It has one of the strongest economies of any place on earth lmao",
            "Diversity of food, I think the metroplex is top 5 for food Diversity",
            "The DFW area's advantage is that it's a major metro area with a strong job market, affordable housing (relative to other big cities) and lots of dining / sports / entertainment at much lower cost than NYC, SF, LAX, Boston, DC, or Seattle. The winters, while not warm, are milder than Chicago and cities in the Midwest or Northeast because of the lack of snow. I think the goal of Dallas, both now and in the future, is to just be a major city that's also a good place to work and live.",
            "If you travel for work or pleasure, then DFW airport and Love Field are two of the most conveniently located airports in the country. You can easily get to either coast and rarely have to deal with snow/severe weather delays.",
            "The Ticket, obviously. It's crazy how many other big cities have such trash talk radio. ",
            "I’m gonna get stoned for this, but DFW has really good car infrastructure. Wide highways and in good condition for the most part. You can cross ridiculous distances in a short amount of time. It is highly car centric, and everything is built with this in mind.\n\nAlso, a really pretty skyline in downtown DFW. Best skyline in the south and one of the best in the country.",
            "Barbecue, pro sports, shopping, affordability, variety of job opportunities.",
            "Amazing Tex-Mex and compared to almost every other Texas city, the DART public transit system is halfway decent."
        ]
    },
    "Things To Do In Dallas That Doesn’t Involve Drinking?": {
        "title": "Things To Do In Dallas That Doesn’t Involve Drinking?",
        "score": 307,
        "url": "https://www.reddit.com/r/Dallas/comments/1dqvbka/things_to_do_in_dallas_that_doesnt_involve/",
        "content": "I got a boring life. Only thing I do is go to gym, go on nature trails and play video games. I hate the heat so I just bunker down in the summers. What are some things to do indoors that aren’t just bars and isn’t going to cost me crazy? Preferably north Dallas \n",
        "num_comments": 260,
        "comments": [
            "Video game mesuem is dope",
            "Freeplay is pretty good for classic video game whatnot. The one in Richardson is good. Cheap enough as such things go.",
            "Live music at indoor venues",
            "what DFW trails are your favorite? trying to find some new ones- I just moved here!",
            "Dallas Makersspace!\nGo make a thing.",
            "Common Ground Games has RPG and board game events",
            "Sometimes i go to museums and zone out looking at interesting paintings or things",
            "Cidercade, Dave and Busters, Barnes and Noble, walk around northpark, great imax theaters around, go into downtown for the perot or the DMA",
            "PuttShack, Fuzzy Labs, both inside Village on the parkway",
            "Pickleball and tennis are fun and social.\n\nEdit: saw your indoors limitations. There’s a cool indoor pickleball facility at Inwood and spring valley"
        ]
    },
    "4 Gateway Church elders take leave amid investigation into allegations involving Pastor Robert Morris": {
        "title": "4 Gateway Church elders take leave amid investigation into allegations involving Pastor Robert Morris",
        "score": 125,
        "url": "https://www.cbsnews.com/texas/news/4-gateway-church-elders-take-leave-amid-investigation-into-allegations-involving-pastor-robert-morris/",
        "content": "",
        "num_comments": 8,
        "comments": [
            ">\"These three Elders — Kevin Grove, Steve Dulin, and Gayland Lawshe — are men of integrity who have served Gateway Church with distinction, and each of these three Elders has clearly stated that they had no knowledge of the true facts of this situation,\" the statement said.\n\nI’m sure if someone spent a minute they could find similar statements the church made about Morris.",
            "This is going to keep get more interesting. Can't wait.....",
            "Way to ruin some lives and under the pretense of religion.",
            "All this prosperity gospel megamoney/we dictate your life while we do whatever shit needs to be exposed for what it is.\n\nThe opposite of what a supreme being would want for their most evolved creation. \n\nHelp each other and prosper otherwise leave people alone.",
            "Thoughts & prayers",
            "Elders 🙄",
            "Can churchgoers request a refund? I know that if I spent 10% of my income supporting this lying hypocrite, I would want my money back.",
            "This grifter supported Trump who is completely against Christs message. Sorry, he’s not Gods fallen warrior. Can you imagine? That should be enough to know he’s a Pharisee./s\n\n Now this, which hopefully has never happened again, but also shows his willingness to use God for power, which he’s obviously done. \n\n  It’s going to probably be shown that some God anointed men, knew and helped keep it quiet. Through the years he and others have made excuses and demanded forgiveness for other men in power who have abused women and kids. \n\n  I know lovely people who go to Gateway and are hurt by this and I have empathy, but anyone who knew has no authority to be in spiritual guidance. \n\n  Gateway had the opportunity to acknowledge the decades of abuse in the “church” which is widespread but hidden. They could say that we all can be forgiven, but you can’t then lie and use the story to gain power. All I’ve heard is sorry, we’re looking into how it affects us, and we’re special, so keep coming."
        ]
    }
}