{
    "A row of termites and a row of ants, both protected by a column of soldiers.": {
        "title": "A row of termites and a row of ants, both protected by a column of soldiers.",
        "score": 6238,
        "url": "https://v.redd.it/77wdbamf8g9d1",
        "content": "",
        "num_comments": 184,
        "comments": [
            "These guys would literally be having wars in the battlefield and then all of a sudden get squished by a human walking by.",
            "Ants and termites have been enemies for a long time. Ants have always hunted termites for food and their larvae, invading their nests. This rivalry has sparked battles with hundreds of them clashing, some fighting to protect themselves while others fight for domination over their food source.",
            "No blue helmets on sight? Smh UN nowdays 😒",
            "But which side would win in a death battle?",
            "I'd love to watch a movie or a documentary where the plot is essentially WW2 or the Napoleonic Wars but Ants vs Termites.",
            "This is actually just a scheme by the soldiers to chill in the sun all day. Both sides convinced their superiors that they can't protect the nest against attacks from beasts 200 times their size or help with hunting because they realllllly have to keep an eye on all the soldier ants on that random road...",
            "That looks like the Korea border",
            "Please sir, may I have some more pixels",
            "Is there such thing as a peace treaty in the ant world",
            "It sort of looks like a sped-up cattle stampede shot by an overhead drone… just imagine if these insects were actually cow/bison size 😳"
        ]
    },
    "Clement Vallandigham, a lawyer who, while trying to demonstrate how the victim might have accidentally shot himself, shot himself and died. He then won the case.": {
        "title": "Clement Vallandigham, a lawyer who, while trying to demonstrate how the victim might have accidentally shot himself, shot himself and died. He then won the case.",
        "score": 4496,
        "url": "https://i.redd.it/fum6koz4zf9d1.jpeg",
        "content": "Clement Vallandigham was a notable lawyer and politician in the 19th century, known for his opposition to the Civil War and his advocacy for civil liberties. In a dramatic turn of events that seems almost too bizarre to be true, Vallandigham met his untimely end due to a tragic mishap during a court case in 1871.\n\nHe was defending Thomas McGehan, who was accused of murder during a barroom brawl. Vallandigham’s defense strategy hinged on demonstrating that the victim could have accidentally shot himself while drawing his pistol. To prove this, Vallandigham conducted a demonstration with what he believed was an unloaded gun. Tragically, he picked up a loaded pistol by mistake and shot himself, inflicting a fatal wound ([Source](https://en.m.wikipedia.org/wiki/Clement_Vallandigham)).",
        "num_comments": 92,
        "comments": [
            "Impressive. Have any other lawyers won their cases posthumously?",
            "Talk about commitment to a role! Vallandigham took ‘method acting’ to a whole new legal level.",
            "Vallandigham’s ghost: ‘Your Honor, I’d like to appeal my own death.",
            "Such a sacrifice! But it made a huge difference, for the Clement Vallandigham case was an important legal precedent that influenced the clarification of rules and restrictions on the use of physical demonstrations in trials, especially in matters of evidence and the use of lethal weapons",
            "Vallandigham’s last act was his closing argument. And what a closing it was!",
            "Vallandigham’s defense strategy: ‘If the glove fits, you must acquit.’ And if the glove doesn’t fit, shoot yourself.",
            "At least he died doing what he loved.",
            "Shot through the heart \nAnd I’m to blame \nBaby you give ill-considered courtroom demonstrations a bad name",
            "Talk about physical demonstration 😅",
            "He won, but at what cost!"
        ]
    },
    "Grab your iced tea and Raise a toast!": {
        "title": "Grab your iced tea and Raise a toast!",
        "score": 33924,
        "url": "https://v.redd.it/xi3m0p0c7e9d1",
        "content": "",
        "num_comments": 1012,
        "comments": [
            "They’ve been 99 cents since I was in high school and I just turned 50",
            "I bought an Arizona Iced tea for the first time ever today after seeing this video a few days ago.",
            "Heading to the store to buy a few just because of the way he wants to treat his customers.",
            "It’s nice of him to do that but I’ve seen stores raise the price on their own to $1.29 and higher.",
            "The price is on the can though",
            "We need more people like this. Hopefully a ton of people now go buy his product.",
            "I'll drink tea to that!",
            "I’ll never drink anything except Arizona iced tea ever again.\n\nWater can suck my dick.",
            "Next time I’m at the store I will buy one specifically because of this interview 🫡 Much respect",
            "Makes me want a fucking Arizona green tea. Man, what a true homie of the people, I’d vote for this man"
        ]
    },
    "A phone bot far m in action": {
        "title": "A phone bot far m in action",
        "score": 23459,
        "url": "https://v.redd.it/tci9p777fd9d1",
        "content": "",
        "num_comments": 1130,
        "comments": [
            "What exactly is the purpose of this? People paying for likes and views?",
            "The dead internet theory looks more and more real as time passes",
            "Always kinda figured they used emulators rather than actual phones.",
            "What exactly are they farming",
            "This explains everything on reddit.",
            "At least they have good cable organization",
            "For those of you wondering, these are 155 mobiles stacked in there. 31 in each row, 5 rows, plus some of them on the table.",
            "It's like the grid of Mortys",
            "This is how X is filled with an overwhelming amount of trolls all saying the same thing and influencing your decisions btw.",
            "All of these assholes can kiss my grits"
        ]
    },
    "It’s pretty common for truckers in Brazil to paint the back of their vehicles. Here’s a few I’ve seen in traffic during my daily commute in São Paulo.": {
        "title": "It’s pretty common for truckers in Brazil to paint the back of their vehicles. Here’s a few I’ve seen in traffic during my daily commute in São Paulo.",
        "score": 2364,
        "url": "https://www.reddit.com/gallery/1dqxy6y",
        "content": "",
        "num_comments": 60,
        "comments": [
            "Gangster Daffy Duck repping the Broncos is the winner.",
            "You didn't see a single Jesus one? They are the most common ones",
            "Not pictured the best one, it was the cover of spider man 3, red and black spider men each on a door of the container.",
            "The designs remind me of weed rolling trays",
            "That civil war one is on point and practical.  Door opens right at the point of contact (blast and shield)",
            "That Joker one is sublime. What great visual artists you have in Brazil. So much talent!",
            "That's cool! Thanks for sharing!",
            "Upvote cuz go fucking broncos",
            "We drive in a society.",
            "Isn't it common in other countries? I will start taking some nice pictures and post them in reddit "
        ]
    }
}