{
    "Sorry Boruto": {
        "title": "Sorry Boruto",
        "score": 180,
        "url": "https://i.redd.it/jyl1gx9peg9d1.jpeg",
        "content": "",
        "num_comments": 4,
        "comments": [
            "It objectively sucks",
            "Shikamaru is a quiet and levelheaded character, still the way he killed Hidan was one of the most cruel we saw in the manga/anime. Gotta love him.",
            "![gif](giphy|3oKIPwY2xx5s9dtrSU|downsized)",
            "It was a well executed revenge"
        ]
    },
    "space time ninjutsu would be a faster option": {
        "title": "space time ninjutsu would be a faster option",
        "score": 103,
        "url": "https://i.redd.it/8224bm04ng9d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Space-Time Jutsu uses too much chakra, probably more than flying with a Susano'o for hours",
            "Actually does Susanoo only come in one size or can it be made smaller ?",
            "When was space-time ninjutsu canon for Sasuke before Boruto.\n\nEdit: Correction.",
            "Nah I love this shit because it just validates my use of the Susanoo as an all terrain vehicle in my fanfictions.\n\nNeed to extract a bunch of injured shinobi who are pinned down behind enemy lines? The Susanoo is the answer!",
            "So Uchihas are some kind of Gundam crossover now?",
            "That's the kind of logic Naruto characters need!"
        ]
    },
    "Thats a real man": {
        "title": "Thats a real man",
        "score": 984,
        "url": "https://i.redd.it/johkko18zb9d1.png",
        "content": "",
        "num_comments": 30,
        "comments": [
            "A man of culture",
            "Based",
            "How can he walk with all those ladies begging him to finally do the deed with them? He is the manliest dude ever",
            "Chad",
            "Huzzah! A man of quality!",
            "Respect bro",
            "bro could prolly pick up thor's hammer no problem.",
            "Respect, I don't simp over characters that have canon partners it just feels wrong",
            "Bro ain't Raikage.",
            "Give him Tsunade"
        ]
    },
    "What would it be? ^^": {
        "title": "What would it be? ^^",
        "score": 54,
        "url": "https://i.redd.it/m4g68k0ojg9d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Naruto - Who told you Sai is in team 7 🤬",
            "Definitely Sasuke if I can  active tattoo to come out at will",
            "Why use an image of Naruto's seal while Orochimaru's five prong seal was still in effect?",
            "I would tattoo uchiha crest on my full back. \n\nUCHIHA LIVES MATTERS",
            "Kama"
        ]
    },
    "This one": {
        "title": "This one",
        "score": 1438,
        "url": "https://i.redd.it/z4mcvk0t6b9d1.jpeg",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Extra points if the teacher played the eerie Orochimaru soundtrack while returning it",
            "Damn the teacher needs to reconsider career choices",
            "What does one do in this situation? Change schools or risk getting your body snatched??",
            "He looks great, that's some great drawing skills",
            "Student uses doodle!\n\nIt was not effective, it was not effective!!\n\nStudent suffers massive damage from counter attack.",
            "Even the teachers better than what we got in Boruto.",
            "Looks like they drew Orochimaru in the Dr. Stone art style",
            "Japanese teachers are so talented at everything",
            "naruto was bitten by a snake",
            "u/repostsleuthbot . I’ve seen this dogshit 500 fucking times."
        ]
    }
}