{
    "We live in a society moment.": {
        "title": "We live in a society moment.",
        "score": 4604,
        "url": "https://i.redd.it/nm2tsaz5328d1.png",
        "content": "",
        "num_comments": 173,
        "comments": [
            "downvote this comment if the meme sucks. upvote it and I'll go away.\n\n---\n\n[play minecraft with us](https://discord.gg/dankmemesgaming) | [come hang out with us](https://discord.com/invite/dankmemes)",
            "This is just sad.",
            "When you thought calling for help would make things better, but it just got worse. #DoubleStandards",
            "Johnny Depp timeline:\n\nShe then beats you in court as well as in real life\n\nThen you film or record everything\n\nThen you go to court again and be cool while she is performative",
            "HOLY SHIT FINALLY A WINDBREAKER MEME, LETS FUCKING GOOOOO",
            "Alright, look, I'm prior law enforcement. Ended up leaving because I didn't enjoy it. But let me tell the males out there who are victims of domestic violence. \n\nCall the police.\n\nWe're humans capable of critical thinking. If we come to a house and you're covered in injuries and she's not. You're not going to jail. She is. If she has wounds, but they appear to be defensive wounds. She'll still go. We look at the totality of the circumstances. \n\nI arrested just as many women as men. Because female offenders are really common. Especially in domestic situations. \n\nPutting on a uniform didn't change me, and neither did taking it off.",
            "The same people who say “Men should be vulnerable “ are the same people calling them pussies have icks against them and say “bullshit” when they do.",
            "Mens issues are real issues",
            "ITT: feminists in denial",
            "What show does the image come from?"
        ]
    },
    "Can somebody explain this?": {
        "title": "Can somebody explain this?",
        "score": 2615,
        "url": "https://i.redd.it/c6ovhg5h518d1.jpeg",
        "content": "",
        "num_comments": 59,
        "comments": [
            "downvote this comment if the meme sucks. upvote it and I'll go away.\n\n---\n\n[play minecraft with us](https://discord.gg/dankmemesgaming) | [come hang out with us](https://discord.com/invite/dankmemes)",
            "If you genuinely wanna know, she answered a question (“What’s one move in bed that makes a man go crazy every time”) by acting out spitting on his dick, but by saying “you gotta give him that *hawk tuah*—hocking a loogie—and spit on that thang, ya get me?”",
            "This poor kid did one of those man-on-the-steet tiktok interviews, said something crude, and is now famous for it. \n\nI am so glad I was an adult before the internet.",
            "Brain rot and porn addiction is real. \nI am one of those.",
            "hawk tua",
            "And every single time it ALWAYS fails to make me laugh",
            "Does anyone have the source ?",
            "She clrealy was answering the questions jokingly and was funny as hell, ngl. \n\nBut man, the internet didn’t stop there you know.. I genuinely feel sorry for her, at this point.",
            "*huac face",
            " You can't unsee a meme, it's game over!"
        ]
    },
    "who even listens to the radio these days anyway": {
        "title": "who even listens to the radio these days anyway",
        "score": 734,
        "url": "https://i.redd.it/t4xugz3ex18d1.jpeg",
        "content": "brought to you by the one time I drove home from work with a dead phone",
        "num_comments": 40,
        "comments": [
            "downvote this comment if the meme sucks. upvote it and I'll go away.\n\n---\n\n[play minecraft with us](https://discord.gg/dankmemesgaming) | [come hang out with us](https://discord.com/invite/dankmemes)",
            "Yeah its a collusion. Otherwise you could change a channel and avoid it. But at this point, who the fuck cares about fixing radio?",
            "They've gotta  be in on it together man. It's every time.",
            "One company, iHeartMedia, owns over 800 radio stations in the U.S.",
            "I guess all we hear nowadays is radio ga ga.",
            "I do. I live in a third world country it's pretty nice.",
            "It's amazing how many kids here act like 5% of the population listens to the radio and not 70%.\nI get you guys have Pandora, Spotify etc, so do I, but there's still a LOT of people other than you guys out there.",
            "Judging from the stations, the only people still listening to the radio are old people, religious people, and Mexicans. And of course the trifecta, old religious Mexicans.",
            "I actually found a radio that has no ads, no news, weather, traffic... none of the this bullshit. \n\nJust pure fucking metal all the time:\n\n[Open FM - Classic Metal](https://mytuner-radio.com/radio/open-fm-classic-metal-439776/)\n\nIt has a 5\" auto-ad every 3 songs and once every half an hour it has 30\" auto-ad. That's it.\n\nAnd the transition between the songs is fucking immaculate.",
            "As one who works in radio, lots of people do, god forbid I turn off the transmitter for 5 seconds, my phone literally explodes with calls"
        ]
    },
    "I wish it were true": {
        "title": "I wish it were true",
        "score": 9891,
        "url": "https://i.redd.it/0lgndh2fby7d1.gif",
        "content": "",
        "num_comments": 177,
        "comments": [
            "downvote this comment if the meme sucks. upvote it and I'll go away.\n\n---\n\n[play minecraft with us](https://discord.gg/dankmemesgaming) | [come hang out with us](https://discord.com/invite/dankmemes)",
            "You're currently a level 1 jew. You need to step up those jew skills if you want more money.",
            "I guess you're just not very good at controlling the banks, then.",
            "L + No Banks + No Illuminati invitation + No Bitches + No Secret Tunnel",
            "Litterally the same vibe as \"men control everything\" while my broke ass working at Burger King",
            "Oh, to be top jew...",
            "To be fair, they probably didn’t specify *which* jews.",
            "Same with any label. \n\nWhite, men, tall, successful. Everyone thinks the world is handed to everyone else but them for some stupid trait/grouping/whatever. Its all bullshit used to divide and concur by the real enemy: the super rich.",
            "skill issue",
            "You mean you don't just walk up to your Rabbi, ask him for a bank to control and he gives it to you, no questions asked?"
        ]
    },
    "Though shall not": {
        "title": "Though shall not",
        "score": 4478,
        "url": "https://i.redd.it/br9dtypvuy7d1.jpeg",
        "content": "",
        "num_comments": 106,
        "comments": [
            "downvote this comment if the meme sucks. upvote it and I'll go away.\n\n---\n\n[play minecraft with us](https://discord.gg/dankmemesgaming) | [come hang out with us](https://discord.com/invite/dankmemes)",
            "Though shall not hammer",
            "Is this a Harry Potter reference?",
            "Like Filtch putting the educational decrees up",
            "I really dont get how the fuck the \"personal freedom above all\" and \"lets force our religion into public institutions\" part of the american right dont cause their tiny brains to implode.",
            "All these bigots loving putting the twn commandments up without remembering that as of the new covenant, the greatest commandment is LOVE ONE ANOTHER.",
            "Thou shall not use Though incorrectly.",
            "NGL, I can't wait for the first time a smart child turns the ten commandments on a shitty teacher.",
            "Also kids: Yo, it says \"ass\" on there twice bahaha!",
            "Politicians: \"Rules for thee but not for me\""
        ]
    }
}