{
    "space time ninjutsu would be a faster option": {
        "title": "space time ninjutsu would be a faster option",
        "score": 743,
        "url": "https://i.redd.it/8224bm04ng9d1.jpeg",
        "content": "",
        "num_comments": 51,
        "comments": [
            "Actually does Susanoo only come in one size or can it be made smaller ?",
            "Its not about the chakra, its about sending a message.",
            "Space-Time Jutsu uses too much chakra, probably more than flying with a Susano'o for hours",
            "Nah I love this shit because it just validates my use of the Susanoo as an all terrain vehicle in my fanfictions.\n\nNeed to extract a bunch of injured shinobi who are pinned down behind enemy lines? The Susanoo is the answer!",
            "So Uchihas are some kind of Gundam crossover now?",
            "When was space-time ninjutsu canon for Sasuke before Boruto.\n\nEdit: Correction.",
            "Or invent any form of transport with all the modern technology around...",
            "That's the kind of logic Naruto characters need!",
            "I remember that crazy naruto classic filler arc where people from a village got chakra wings because of a space rock",
            "What if it only exhausts chakra in battle but other than that its just the chakra externalized able to be pull in when needed there for regaining the chakra"
        ]
    },
    "Sorry Boruto": {
        "title": "Sorry Boruto",
        "score": 700,
        "url": "https://i.redd.it/jyl1gx9peg9d1.jpeg",
        "content": "",
        "num_comments": 27,
        "comments": [
            "I havnt watched past like the first 10 episodes but from what ive heard there will never be a kill like this again cause everyones too op for traps and can only be taken down by outpowering them, which is basically just dragon ball lol",
            "Shikamaru is a quiet and levelheaded character, still the way he killed Hidan was one of the most cruel we saw in the manga/anime. Gotta love him.",
            "I was super excited for Boruto. It's like the whole series is one big filler episode that will never end.",
            "I'm gonna bet that this will get repeated in Boruto where Jashin Otsutsuki will give this same treatment to Shikamaru once, he gets defeated while his restrained son are watching  ",
            "It was a well executed revenge",
            "Question: was Hidan's immortality a kekei genkai or something?? Or did he obtained from his faith??",
            "\"UM ACKSHUALLY  BRO READ THE MANGA ITS GREAT\"\n\nI read the entirety of it how it is currently in one day and I remember nothing about it lmao it's almost like I have no reason to care or something",
            "Couldve gone back to the basics, couldve gone back to battles being about techniques and strategies but we got the infinity warfare treatment with a splash of Hot Topic.",
            "I sat through do much boruto waiting for it to be good but my God it just didn't happen. It sucks because Naruto more than dragon ball was the anime I really grew up with and I was excited for more of that universe but I'm just disappointed",
            "It was already like that in the 4th war , hell hidan is probably the weakest Akatsuki member since he can't use ninjutsu or genjutsu , try to do this to deidara and you'll just explode with him. Try to do this with itachi and you'll just be caught on a tsukuyomi."
        ]
    },
    "What would it be? ^^": {
        "title": "What would it be? ^^",
        "score": 564,
        "url": "https://i.redd.it/m4g68k0ojg9d1.jpeg",
        "content": "",
        "num_comments": 24,
        "comments": [
            "Even kakashi got one too \" his anbu tattoo\"",
            "Why use an image of Naruto's seal while Orochimaru's five prong seal was still in effect?",
            "I would tattoo uchiha crest on my full back. \n\nUCHIHA LIVES MATTERS",
            "Definitely Sasuke if I can  active tattoo to come out at will",
            "The moment Sai lost his, he became absolutely unimportant",
            "I will have what Neji had on manga.",
            "Naruto - Who told you Sai is in team 7 ",
            "Evidently, not Sasukes. Ive seen enough people with Sasukes tattoo and they dont even qualify as a ninja. Ill try Sais and a brave tattoo artist to do that.",
            "I mean you ain't wrong",
            "Btw is it ever revealed what these are made of? I watched the anime 3-4 times and I don't remember it being mentioned."
        ]
    },
    "Like fr 😂": {
        "title": "Like fr 😂",
        "score": 145,
        "url": "https://i.redd.it/96aw0yug6g9d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "lol",
            "sneaky snake",
            "XD",
            "that kinda looks sus.",
            "God-tier edit"
        ]
    },
    "Thats a real man": {
        "title": "Thats a real man",
        "score": 1140,
        "url": "https://i.redd.it/johkko18zb9d1.png",
        "content": "",
        "num_comments": 32,
        "comments": [
            "How can he walk with all those ladies begging him to finally do the deed with them? He is the manliest dude ever",
            "Huzzah! A man of quality!",
            "bro could prolly pick up thor's hammer no problem.",
            "Respect, I don't simp over characters that have canon partners it just feels wrong",
            "ah yes, a degen no less, but a proud one at that, i like him",
            "Hinata wasn't married to Naruto atp.",
            "Huzzah is crazyyywho tf says that anymore",
            "Where is the Raikage NTR guy btw? Haven't seen him in a while. Did he get banned?",
            "As if Tsunade isn't totally loyal to her deceased fiance? Wtf?",
            "They were destined to be and this man respects that."
        ]
    }
}