{
    "Gwynevere": {
        "title": "Gwynevere",
        "score": 172,
        "url": "https://i.redd.it/d8usyt97s28d1.png",
        "content": "How to concentrate.. (I just beat O/S. This is a great reward) ",
        "num_comments": 20,
        "comments": [
            "Try two handing",
            "Amazing chest ahead",
            "Try shooting her with a bow, you get some special dialogue",
            "Daughter of the first lord, yea uh…never made it to her because I raged and hollowed at the golden boys boss battle. Was just to much for me",
            "/r/shittydarksouls",
            "I prefet Quelaag and Fair Lady hmm hmm mmh",
            "80085",
            "People are too hard on Gwynevere, I think she deserves more support.",
            "Shoot her with a throwing knife, you get a cool reward.",
            "my gf he like"
        ]
    },
    "What boss you hate for the moveset?": {
        "title": "What boss you hate for the moveset?",
        "score": 57,
        "url": "https://i.redd.it/5z44sf8yi38d1.jpeg",
        "content": "",
        "num_comments": 31,
        "comments": [
            "The golden boys. Fuuuuuucked it took me so damn long to tread back just to fight them !",
            "Ancient dragon is probably like the worst souls move set",
            "pontiff sulyvahn",
            "Bed of chaos no questions asked.",
            "OnS simply cause their moveset is Hella broken, as in like bugged not cracked. Ornstein getting caught on something during or stopping mid dash is extremely terrifying and Smough loves to clip that hammer through pillars and shovel over and over.",
            "Epic lore and design but runback is not good. I would be better if there would be a bonfire near by the fog. It's like you enter the area you have to kill 100 or 50 black knights and then you are be able to start from the bonfire you hit to.",
            "Friede, always friede maybe midir",
            "not a dark souls 1 but ivory knight",
            "If its ds1 id prob say sif, more like a bunny that hops back and forth n i have to run after him",
            "Sif. Hate how she always junps away."
        ]
    },
    "My first run on dark souls, beating o&s on my 4th try": {
        "title": "My first run on dark souls, beating o&s on my 4th try",
        "score": 17,
        "url": "https://i.redd.it/ve1dazx4548d1.png",
        "content": "This was my favorite boss so far, I loved the dynamic in their attacks",
        "num_comments": 5,
        "comments": [
            "Praise The Sun🙏",
            "On my first run I beat Manus first try, Artorias and Kalameet second try, but O&S took a day out of my life",
            "On my first run I beat Manus first try, Artorias and Kalameet second try, but O&S took a day out of my life",
            "Damn. Haven't gotten to manus and the others yet",
            "I was very surprised. Everyone ranked the bosses by difficulty as 1. Manus 2. Artorias 3. Kalameet 4. O&S. But in my case, it turned out to be vise versa"
        ]
    },
    "I wonder why they decided to rename Ornsteins set?": {
        "title": "I wonder why they decided to rename Ornsteins set?",
        "score": 32,
        "url": "https://www.reddit.com/r/darksouls/comments/1dlqvvn/i_wonder_why_they_decided_to_rename_ornsteins_set/",
        "content": "Ornstein to dragon slayer, Why didn’t they just keep it how it was?",
        "num_comments": 11,
        "comments": [
            "I wrote this whole comment about how it was supposed to represent how Dark Souls 1 was so long ago by the time of Dark Souls 3, that the name of the original owner of the armor was forgotten by time, only to find out that the description of the armor mentions Ornstein by name... So that's my theory thrown out the window",
            "Because he used to slay dragons",
            "They didn't really. I mean. He's called Dragonslayer Ornstein. Like Smough is Executioner Smough.",
            "I assume that when he became the dragonslayer he got to design his armor a bit or something so the title stuck to the armor after his death. I’m pretty sure the majority of all armor in these games is named after titles or places, not characters.",
            "Most likely because any new player in DS3 would say \"who the hell is Ornstein?\" So they gave it a more vague name to reduce confusion given that Ornstein doesn't actually appear as a character.",
            "*makes a mod that removes ornstein being called by name just so this guys first comment can be true*",
            "Ornsteins name could still be remembered as a legend, but perhaps people started referring to him as Dragonslayer. Sounds cooler, everyone knows who you’re talking about and is easy to remember",
            "So did all of Gwyn's knights.",
            "Not really, usually the armour is named after the mob that drops it like Silver knight, black knight, hollow soldier, balder knight etc. \nA lot of boss armour is named after the boss like iron golem, gargoyle helm, Artorias, Smough and even Ornstein.",
            "I'd have thought this too....if it weren't for 'Smough's Greathammer' compared to the 'Dragonslayer Spear'\n\nSmough's set versus Dragonslayer set."
        ]
    },
    "Gwyn is like, way harder than everyone memes if you don't care about parrying lol": {
        "title": "Gwyn is like, way harder than everyone memes if you don't care about parrying lol",
        "score": 93,
        "url": "https://www.reddit.com/r/darksouls/comments/1dll2l4/gwyn_is_like_way_harder_than_everyone_memes_if/",
        "content": "Seriously this dude is kicking my ass and I beat DS3 and Elden Ring lmao",
        "num_comments": 94,
        "comments": [
            "Everyone really should try one run where you don’t party him. It’s actually a fun fight\n\nEdit: decided to keep the typo",
            "The runback fucking sucks btw too",
            "ikr first time I fought him I was so confused, I fought all optional ds1 bosses and he was the hardest, yet no one agreed with this. Only harder boss in Elden Ring was Malenia\n\nI wasn't parrying at all :P\n\nLike dayum let me breathe",
            "If you have a weapon that deals decent poise damage you can two hand it and stagger him to death. The dude has multiple cheesy strats you can semi-exploit.",
            "Can't say I relate to this, sword and shield have always done me well.",
            "Why do you think everyone parries him",
            "I can't parry reliably, but don't have any problems with Gwyn. I actually love the fight.\nI tend to dance a couple metres in front of him to bait the grab, roll backwards to avoid it and then punish with jump attack. \n\nSame for the kick, but he occasionally hits me after that one.",
            "Agree, it was one of the hardest bosses in my first playthrough.  Really satisfying to beat him properly, though!",
            "pyro fucks him up really bad. you can run past all the knights pretty easy too",
            "He was easy I just used the pillars to block his attacks"
        ]
    }
}