{
    "After beating DS1 i now understand why people disliked DS2": {
        "title": "After beating DS1 i now understand why people disliked DS2",
        "score": 51,
        "url": "https://www.reddit.com/r/darksouls/comments/1dr8t5z/after_beating_ds1_i_now_understand_why_people/",
        "content": "I’m fairly new to the Dark Souls series, and please don’t get me wrong—I love *Dark Souls II* as it was my first Souls game. However, after playing *Dark Souls I*, I now understand what people meant when they said that *Dark Souls II* was a downgrade.\n\n*Dark Souls I* is mostly excellent. I did have some unpleasant and frustrating experiences with the game as well. For example, Sen’s Fortress was really annoying with all its traps, and I tried to rush through it, which only led to getting trapped even more. The Tomb of Giants also had some frustrating enemies, particularly the Skeletal Dogs—I died to them more times than I died to Nito.\n\nThe Abysswalker Artorias and the Lord of Cinder were quite challenging, and I think they broke some of their own rules a bit. I started the DLC only after defeating the four main bosses, and I noticed that Artorias and the Lord had many attacks with lingering hitboxes that are hard to dodge. To avoid their splash attacks, you need to be both fairly far from the attack and dodge at just the right time. This is mostly true for Artorias; dodging the Lord’s attacks was a bit easier, but I still haven’t encountered many other bosses with similar lingering attacks that counter the dodge mechanic.\n\nAside from these challenges, I’d say about 90% of the game was perfect. The location design was *chef’s kiss*. Anor Londo was gorgeous with its oversized, tall white structures. The Painted World of Ariamis felt like it was frozen in time and forgotten. The Crystal Cave made me want to buy a couple of amethyst geodes, and New Londo Ruins was my favorite—its flooded city ruins with mountains of corpses at the bottom reminded me of the Dead Men of Dunharrow from *The Lord of the Rings*.\n\nIn *Dark Souls II*, I liked Majula and the design of Shrine of Amana, but that's about it. The other locations in DS2 now feel rather dull in comparison.\n\n   ",
        "num_comments": 39,
        "comments": [
            "I'd argue the fume knight dlc area competes with any ds1 area",
            "I like DS2 too, but the downgrade of map design was rough. (I played DS1 first)",
            "Just a friendly request, please man, call Gwyn by his name",
            "I disagree with the assessment of ds2. I respect that people like the first game better. I played ds1 first and loved it. I found all the running around a bit tedious. The rolling in only 4 directions suck as well. Mostly, i love the rpg mechanics better in ds2. While many people are not a fan of agility stat, i thought it a cool feature and wish they kept it going forward because the constant rolling around is a bit silly to me.",
            "DS2 is the best Dark Souls!",
            "I love DS2 in his own way but yeah after DS1 it sure feels a bit off, im with you man ",
            "I have more hours in DS2 than 1 & 3 combined. The reason? Compared to DS1, the PvP was great. Many hours were spent at the duel arena. Many more hours were spent making new builds to use in the arena. The actual game is a B-, while I'd put 1 & 3 at A and A-. (Elden Ring and Bloodborne I'd rank A+, just for comparison's sake.)\n\nBut some of the most fun I've had in souls was scaring the shit out of people during duels by using a ring to appear as a human instead of a phantom, combined with the red eyes ring, and power stanced Bone Fists. Many people would gesture and message to appreciate the build. Good times.",
            "While DS2 is my least favorite soulsborne game, id say its still in my top 20 games all time. I only plays SOTFS version. I think I read something before that people were hating on the original and said SOTFS was a huge improvement.",
            "The biggest problem DS2 has is that DS1 existed which in my opinion is the greatest game of all time. \nToday we also got other FROM games and DS2 is often viewed as the poorest sibling. If this was the only FROM game everyone would just love it.",
            "I played Demon's first so DkS1 was never the eye opener that it was for many people. Of course I enjoyed it, but for me DkS1 and 2 are the weakest of all Souls games"
        ]
    },
    "How do the what ?": {
        "title": "How do the what ?",
        "score": 20,
        "url": "https://i.redd.it/nrleseepai9d1.jpeg",
        "content": "Are you guys like either to create new champ and just put your mark on the floor to help bro in pain ?  I like help 🫡",
        "num_comments": 4,
        "comments": [
            "Black nights and some luck",
            "By making a strength build.",
            "This weapon is so broken lmao, literally 4 hit to beat ornstein wtf . I always play magician or dex build but this is insane ",
            "I always do magician or dex build , i reload ds1 to make a big boy and fk yeah, the game was never hard with black knigh hallebarde and the havel armor"
        ]
    },
    "Got lucky during my first dex playthrough :) Nice to meet you, Baller Swag Sword": {
        "title": "Got lucky during my first dex playthrough :) Nice to meet you, Baller Swag Sword",
        "score": 29,
        "url": "https://i.redd.it/tszyfh60eg9d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "I got 2 of those but im playing a strength build. Another way of the game saying fuck you i guess",
            "Didn't even have to farm for it :) First time it's ever dropped for me",
            "I got one on my strength build earlier",
            "I took the time to farm one of those up in my current dex/int playthrough and I'm having a great time with it. They weren't kidding, that swag sword can ball. Have fun with it!",
            "Man that sucks  I usually play strength builds but I wanted to spice things up and use stuff like daggers and rapiers"
        ]
    },
    "What I'm really liking about this game": {
        "title": "What I'm really liking about this game",
        "score": 66,
        "url": "https://i.redd.it/25i7esktpe9d1.jpeg",
        "content": "I started playing a few days ago. At the moment, I'm 17h and 18m into the game, I just acquired the lord vessel. The experience so far has been incredible. I love how perfect the level design is, the colors, the lighting, the nostalgia that I can feel without even having played it at the time (until it came out I was 3 years old) and that feeling still passes. I love how the bosses are simple, not that difficult, but they work really well. My favorites so far are O&S, Sif and Queelag. O&S have such a magnificent design and the battle flows so well (unlike Ds2's  duo fights). Sif has such a simple design, but it's such a good idea and so well executed that it's incredible, a wolf with a sword that has an impressive lore. Queelag was pretty easy compared to the area that she is (fuck blighttown) but she has a very good design. Anor Londo is my favorite place so far.",
        "num_comments": 7,
        "comments": [
            "Yay Im glad you loved it! How prepare for the second half to be CONSIDERABLY less polished. Devs were on a crunch and the second half of the game has some very annoying areas and bosses",
            ">!Bed of chaos is extreme cringe!<",
            "I've been saying for years and everyone gets mad at me but 2nd half of the game straight up sucks.\n\nI adored Dark Souls, loved the everliving shit out of it, until you beat OnS. After that the game loses like 30% of the things that made it awesome.",
            "nah its actually the best boss in the game, the elden ring dlc should have had multiple of them inside of eachother and making it a bunk",
            "You are so wrong!!! Its the best boss in the fucking game ",
            "it's not that bad",
            "Calm down Frenzied Flame"
        ]
    },
    "After that damn place that was Sen's fortress, this place is really beautiful.": {
        "title": "After that damn place that was Sen's fortress, this place is really beautiful.",
        "score": 161,
        "url": "https://i.redd.it/layeufeuzc9d1.png",
        "content": "",
        "num_comments": 17,
        "comments": [
            "I know right?  Super beautiful.  Its almost too good to be true!",
            "\"Phew, thank god I'm done Sen's Fortress!\"    \n***ANAL RODEO***",
            "No joke, I think Anor Londo is my favorite paradise/hell location in all of gaming. It looks amazing.",
            "Anor Lando is my favorite location from any Fromsoft game. Majula is DS2 is a close second.",
            "bastard sword, cool ass shield, pyro pants. pretty good fashion taste!",
            "it feels so clean and angular compared to everywhere else in the game",
            "Welcome to hel...ven .... Hellven",
            "I mean it's still beautiful if you... yaknow...",
            "For real, this place is insanely beautiful.",
            "Ahahahaha---hahahhahahaaahaaa!!! Welcome to Anor Londo, a.k.a , peak Dark Souls"
        ]
    }
}