{
    "Dark and Darker Helpful Links": {
        "title": "Dark and Darker Helpful Links",
        "score": 57,
        "url": "https://www.reddit.com/r/DarkAndDarker/comments/1aom9sj/dark_and_darker_helpful_links/",
        "content": "* [Dark and Darker](https://darkanddarker.com/) official website.\n* [Dark and Darker](https://discord.com/invite/darkanddarker) official Discord Server.\n* [Dark and Darker Support FAQ](https://darkanddarker.com/support/support-faq) (**in-game Ban Appeals**)\n* [New Player Quick Start Guide!](https://www.reddit.com/r/DarkAndDarker/comments/1d9ule7/new_player_quick_start_guide/) by u/SerukonGaming guide for new players!\n* [Dark and Darker Hall of Knights](https://discord.gg/darkanddarkerknights) for new players to get in-game assistance!\n* [Early Access FAQ](https://www.reddit.com/r/DarkAndDarker/comments/15o093v/early_access_faq/) by u/IronmaceGames\n* [User Suggestions](https://darkanddarker.featureupvote.com/) on the official website for all feedback and suggestions.\n* [Ban Appeals](https://discord.gg/wsKaHHrE9U) Discord Server. (**only for Discord Bans**)\n* [Patch Notes](https://darkanddarker.wiki.spellsandguns.com/Patch_Notes) Patch Notes history hosted in Spells and Guns Dark and Darker Wiki.",
        "num_comments": 0,
        "comments": []
    },
    "WELCOME NEW AND RETURNING PLAYERS!": {
        "title": "WELCOME NEW AND RETURNING PLAYERS!",
        "score": 79,
        "url": "https://www.reddit.com/r/DarkAndDarker/comments/1dkl85c/welcome_new_and_returning_players/",
        "content": "**Welcome newcomers and returning players!**\n\n---- \nQuick introduction - I am the newest mod here and I'm doing my best to stay highly active, especially with our new influx of players. I've been a user here for over a year and Held the Line like many of you.\n\n---- \n\nThis reddit can be a great resource and a place for healthy discussion of a game that can be quite frustrating. \n\n*Like a Druid that cast Mending Grove in perfect timing* - the release on Steam / Epic and some really good design changes via the devs has had this game and this sub injected with many new dungeon divers and the return of many Line Holders who are bringing good energy and good discussion!\n\nLet's keep it that way. If you encounter toxic comments here, there is no better way than to either ignore them or to try to be respectful - or to **just report them and watch us holy strike their comments.** We read the reports every day, multiple times a day. We're doing our best to stay very active here - allowing the content to generate organically while still curating spam and toxic antagonistic junk. \n\n**You'll know a gaming reddit is in a good place when the top posts are memes, fan made content, and frag videos.** So *Hold The Line* and keep this sub healthy!\n\n-----\n\n**Edit**\n\nLow effort \"Nerf XYZ Class\" posts will be removed. If you want to discuss certain abilities or attributes of specific classes that you think are creating imbalances, I will let those go as long as they seem well thought out.\n\nAnything that seems to be a \"I'm venting cus I died\" post will be removed going forward.",
        "num_comments": 53,
        "comments": [
            "Steam supremacy.  I completely forgot about Epic.",
            "just to throw this out there\n\nIn this subreddit people will often share information that’s blatantly incorrect and refuse to comment a source. They frequently get tons of upvotes, leading more people to parrot a comment that wasn’t factually correct. \n\nI just reported an example of this from a few days ago if you see what I mean",
            "I normally don't like reddit mods but this edit seems reasonable ",
            "I think the remocing nerf posts is a slippery slope. Obviously, there is a stark difference between someone who is angry and someone with valid concern.\n\nIt doesn't help either that I see far too much egging and \"Git Gud\" comments that fan the flames.",
            "Glad to see more moderation, this sub really needs it, let's keep the good vibes going. A suggestion I'd like to add is having a consolidated thread stickied when a big topic is spamming up the sub. A recent example would be \"Consolidated steam review discussion\" or some such.",
            ">I'm considering removing certain kinds of low effort \"nerf XYZ\" posts. They happen nearly hourly and are almost entirely someone venting after dying to XYZ.\n\nGo one step further.\n\nOne day ban for cryposting. This will be a harsher deterrent while silencing OP from flaming the entire subreddit until they cool down. Make it a rule and clearly posted so they have no excuse. \n\nThis will also filter out people who **only** came to this sub to cry that they died in a video game. Most people who post once and immediately get banned won't come back and we don't want them.",
            "Hello mrsnakers,\n\ncongratulations on your new position! I wish you the very best and much strength against the disrespectful posts and comments that will come. It's good to read that you will stand your ground against the toxicity of some players. \n\nJust seeing the nasty messages in the Discord when the servers are taken offline for maintenance frustrates me and my friends. Don't let the toxic players annoy you. Ironmace is on to something great and my friends and I can't wait to see the game getting bigger and bigger.\n\nKeep doing what you're doing, we're behind you. \n\nPlease greet the team and say a big thank you!",
            "Damn, I was hoping they'd be taking mod applications soon. Wanted to toss my name in the ring, but welcome!",
            "Congrats mrthneakythnaker! Maybe my favorite comment will no longer be required: “No logic in the subreddit, only rage^tm”",
            "I'm new to reddit, I created an account only to be part of the dark and darker community.\n\nI tried two times to post two different questions that I had because I'm also new to the game but both posts were removed and it only says \"post waiting for moderator approval\". \n\nDo you know what should I do to fix this?"
        ]
    },
    "I find it really cool that Dark and Darker comes with a built-in three-minute \"take a break\" feature, really helps with keeping me from playing too much": {
        "title": "I find it really cool that Dark and Darker comes with a built-in three-minute \"take a break\" feature, really helps with keeping me from playing too much",
        "score": 900,
        "url": "https://i.redd.it/q5y3s0rltb9d1.png",
        "content": "",
        "num_comments": 246,
        "comments": [
            "map is really cool, but definitly isnt fair for every class",
            "I absolutely hated frost mountain when it released. After a couple wipes, it really grew on me. I enjoyed the gold pile in the middle, which everyone would rush to. Great pvp map. Now that the pile is taken away, it's not as fun. Going into abyss can be difficult if you're not a full PDR warlock.",
            "The only reason I ever queue this map is for quests and I will continue to put off those quests for the rest of time god willing",
            "There's just really nothing do down there, in crypts and goblin caves you have bosses, my and team and me are trying to find randoms to try and beat wyvern with, pretty dumb system.",
            "Ngl I love the rotating map feature. It makes the game feel a lot better and if I just have to wait a few minutes it gives me time to do some cleaning or go to the bathroom or get food. It is a nice built in break though for me it is more “I don’t need to go there for quests yet I’ll wait”",
            "Weirdly enough, Frost Mountain is my favourite map",
            "People complaining about current map rotation have NO IDEA how good they have it..\n\nPrevious renditions were 5 minutes or more often than not just not on rotation at all.. gc was solo. Ice caves was duo and crypts was trio..\n\nCount your blessings children.",
            "Coward",
            "Bring back ruins",
            "I think it is a pretty Chill map tbh"
        ]
    },
    "Goblin Merchant Spear": {
        "title": "Goblin Merchant Spear",
        "score": 96,
        "url": "https://i.redd.it/gvpx1292je9d1.png",
        "content": "",
        "num_comments": 35,
        "comments": [
            "Bis",
            "https://preview.redd.it/lejujkntjf9d1.png?width=360&format=png&auto=webp&s=a1d86f4a69b4841ba36f90ea2e1591162ad17b0d\n\nMy goblin gave me this beautiful baby.",
            "Just search for legendary spears in the marketplace and sort by most expensive and see what similar spears are worth",
            "Wait the goblin sells legendaries? Or is it just random rolls?",
            "https://preview.redd.it/liyrsvc04g9d1.png?width=394&format=png&auto=webp&s=06010e37ceb4a32f9cdb0740a9dba2b8536fa7cc\n\nSold this For 3900 yesterday. Gobbo Provides.",
            "Ah fellow luck puller I see. Nice as a druid is take that baby.",
            "wtf",
            "Can Goblin Merchant sell you things like this as normal, or is this an item you lost in the dungeon before?\n\nedit: okay maybe I should have read the text where the Goblin says that I pay him and he gives me whatever he wants, clearly implying that he gives something of random quality. I saw that what he sold was \"\"gray\"\" when I first started and then just ignored him for the next 100 hours lol",
            "this gave me motivation to gamble, got 3 legendary trying on 3 characters",
            "Bissy"
        ]
    },
    "Extracted early and decided to see if anyone would find my trap": {
        "title": "Extracted early and decided to see if anyone would find my trap",
        "score": 43,
        "url": "https://v.redd.it/y2i0n2s8ff9d1",
        "content": "",
        "num_comments": 10,
        "comments": [
            "I'll never walk through another doorway. I'm sick of your antics!.",
            "Bro was running a shitload of Copperlight gear in normals? Couldn't have been a more perfect victim. You never would've seen that set anywhere but HR before this most recent wipe.",
            "F to cancel",
            "Based rat kill from the grave",
            "Some of my angriest moments in this game are when im deep in the zone trying to move, only to die because of a trap randomly placed somewhere",
            "I could straight up hear the Tom and Jerry scream lmao.",
            "Oh man I rat jumped through a door into a bear trap in an empty goblin caves. I was so sad.",
            "Ahhh, the old Halo announcer would've been perfect here.\n\n*FROM THE GRAVE*",
            "I mean he got out as he mentioned in the title. Its more like remote work from home."
        ]
    }
}