{
    "Dark and Darker Helpful Links": {
        "title": "Dark and Darker Helpful Links",
        "score": 59,
        "url": "https://www.reddit.com/r/DarkAndDarker/comments/1aom9sj/dark_and_darker_helpful_links/",
        "content": "* [Dark and Darker](https://darkanddarker.com/) official website.\n* [Dark and Darker](https://discord.com/invite/darkanddarker) official Discord Server.\n* [Dark and Darker Support FAQ](https://darkanddarker.com/support/support-faq) (**in-game Ban Appeals**)\n* [New Player Quick Start Guide!](https://www.reddit.com/r/DarkAndDarker/comments/1d9ule7/new_player_quick_start_guide/) by u/SerukonGaming guide for new players!\n* [Dark and Darker Hall of Knights](https://discord.gg/darkanddarkerknights) for new players to get in-game assistance!\n* [Early Access FAQ](https://www.reddit.com/r/DarkAndDarker/comments/15o093v/early_access_faq/) by u/IronmaceGames\n* [User Suggestions](https://darkanddarker.featureupvote.com/) on the official website for all feedback and suggestions.\n* [Ban Appeals](https://discord.gg/wsKaHHrE9U) Discord Server. (**only for Discord Bans**)\n* [Patch Notes](https://darkanddarker.wiki.spellsandguns.com/Patch_Notes) Patch Notes history hosted in Spells and Guns Dark and Darker Wiki.",
        "num_comments": 0,
        "comments": []
    },
    "WELCOME NEW AND RETURNING PLAYERS!": {
        "title": "WELCOME NEW AND RETURNING PLAYERS!",
        "score": 78,
        "url": "https://www.reddit.com/r/DarkAndDarker/comments/1dkl85c/welcome_new_and_returning_players/",
        "content": "**Welcome newcomers and returning players!**\n\n---- \nQuick introduction - I am the newest mod here and I'm doing my best to stay highly active, especially with our new influx of players. I've been a user here for over a year and Held the Line like many of you.\n\n---- \n\nThis reddit can be a great resource and a place for healthy discussion of a game that can be quite frustrating. \n\n*Like a Druid that cast Mending Grove in perfect timing* - the release on Steam / Epic and some really good design changes via the devs has had this game and this sub injected with many new dungeon divers and the return of many Line Holders who are bringing good energy and good discussion!\n\nLet's keep it that way. If you encounter toxic comments here, there is no better way than to either ignore them or to try to be respectful - or to **just report them and watch us holy strike their comments.** We read the reports every day, multiple times a day. We're doing our best to stay very active here - allowing the content to generate organically while still curating spam and toxic antagonistic junk. \n\n**You'll know a gaming reddit is in a good place when the top posts are memes, fan made content, and frag videos.** So *Hold The Line* and keep this sub healthy!\n\n-----\n\n**Edit**\n\nLow effort \"Nerf XYZ Class\" posts will be removed. If you want to discuss certain abilities or attributes of specific classes that you think are creating imbalances, I will let those go as long as they seem well thought out.\n\nAnything that seems to be a \"I'm venting cus I died\" post will be removed going forward.",
        "num_comments": 53,
        "comments": [
            "Steam supremacy.  I completely forgot about Epic.",
            "I normally don't like reddit mods but this edit seems reasonable",
            "I think the remocing nerf posts is a slippery slope. Obviously, there is a stark difference between someone who is angry and someone with valid concern.\n\nIt doesn't help either that I see far too much egging and \"Git Gud\" comments that fan the flames.",
            "Glad to see more moderation, this sub really needs it, let's keep the good vibes going. A suggestion I'd like to add is having a consolidated thread stickied when a big topic is spamming up the sub. A recent example would be \"Consolidated steam review discussion\" or some such.",
            "Damn, I was hoping they'd be taking mod applications soon. Wanted to toss my name in the ring, but welcome!",
            "Congrats mrthneakythnaker! Maybe my favorite comment will no longer be required: No logic in the subreddit, only rage^tm",
            "you should also ban everyone who says bad things about Ruins its the best map and slander is illegal in america",
            "How come my druid can't cast tree of life? I'm only level 16 but is this a level problem? It's a high level spell.",
            "I'm a new player. How do I get my merchants to offer anything above gray w/o questing? I've started a few quests but so far I haven't even seen once what they are asking for and I extract at least 40% of the time.",
            "Noob question about our Squire base gear loadout, should we care about -Move Speed penalties and set the base gear as minimal as needed or just load up and fill every gear slot?"
        ]
    },
    "This Guys Friend Is Hacking My Account. Recently my email/pass was found in a data leak and my account was hacked. Traded away 50k+. I was able to get in via steam for a few minutes today and caught his friends tag. These people are scum and deserved to be banned. Please Upvote So Staff Can See. ": {
        "title": "This Guys Friend Is Hacking My Account. Recently my email/pass was found in a data leak and my account was hacked. Traded away 50k+. I was able to get in via steam for a few minutes today and caught his friends tag. These people are scum and deserved to be banned. Please Upvote So Staff Can See. ",
        "score": 345,
        "url": "https://www.reddit.com/gallery/1dr7e9y",
        "content": "",
        "num_comments": 66,
        "comments": [
            "This whole thing reeks of rmt from all angles.",
            "I find it strange that people are willing to hack peoples accounts on a game where progression gets reset every so often. I mean is it even worth the trouble?",
            "Sorry this happened to you bro. Truly undeserving shitbags, I hope Ironmace can deliver you justice.",
            "Scumbags indeed. For anybody else reading this: setup your 2FA before this bs happens to you too",
            "Absolute state of RMT, like bruh this shit gonna wipe this ain't fucking World of Warcraft. Crazy that these dudes would go these lenghts for pocket money too.",
            "If you deleted your email make a new one with the same address and you might get access again that way",
            "Hmm this post seems a little sus ngl. If your username and password were leaked in some format, then you wouldn't advocate like this. You would refrain from further exposure.",
            "Theres been data leaks? I havent played in months, I wonder if my account has been leaked lmfao..",
            "sad to say not to but what if his friends are other hacked accounts like yours really sad sorry to hear about this",
            "So you knew that your account was in a data breach and didn't change your password? Kind of earned this one."
        ]
    },
    "Why do you freeze and die while there's still 10 seconds left on ice caverns?": {
        "title": "Why do you freeze and die while there's still 10 seconds left on ice caverns?",
        "score": 81,
        "url": "https://www.reddit.com/r/DarkAndDarker/comments/1dr59xw/why_do_you_freeze_and_die_while_theres_still_10/",
        "content": "I know i was cutting it down to the wire but i expected 10 seconds to mean 10 seconds, not 2. It froze me in place and killed me right at the gate. Wtf :(",
        "num_comments": 29,
        "comments": [
            "Because timer was made by kobolds and they're not very good at counting",
            "Just put a campfire and some warm clothes and you can stay for the night",
            "Happend to be tonight as well, had a glowing blue eye for the quest and i thought I was good but it froze me while I was literally in the doorway to stairs extract :(",
            "Maybe debuff duration causes the slow/damage effect to end quicker and the next effect is death. Idk but that'd explain why ppl die at different times",
            "they need to fix that",
            "You only do that once. Next time you know that you need to leave 20 seconds before the time runs up. Its a trial and error game",
            "I was about to die but i jumped in the abyss and survived i think thats why, so you dont die mid air",
            "Well you freeze at ten and die at zero duh",
            "There is not a great solution for this. The same 10-seconds rule apply in the Goblin caves and the forgotten castle maps. When the timer reaches 1:10, an effect appears. You then have one minute (from 1:10) to leave.  The extra 0:10 is a grace \"last second\" period. \n\nThe crypts has bugs taking a chunk of hp per second (about 10%?); the goblin cave collapses dealing damage (same amount iirc) and the ice caves slows you down considerably. At 0 seconds, you are dead. In the last 10 seconds, you are dying.",
            "Because it's too cold burrrr"
        ]
    },
    "This bard kept hitting me with his torch in pre-game lobby, so I told him I'd hunt him down and kill him if he didn't stop. I abandoned my team and it was worth it.": {
        "title": "This bard kept hitting me with his torch in pre-game lobby, so I told him I'd hunt him down and kill him if he didn't stop. I abandoned my team and it was worth it.",
        "score": 67,
        "url": "https://v.redd.it/tnwt8y9lgg9d1",
        "content": "",
        "num_comments": 15,
        "comments": [
            "The complete disregard for your gear, the druid, your team, etc just to fulfill your bloodthirst is very fitting as a barbarian.",
            "That was four people together were they a premade?",
            "I did the same to a warlock on Gobbo cave who kept using the L emote at me, I crushed through every door till I found him and proceeded to punish him for his crime",
            "Holy shit that's gold ",
            "VoIP is off in the lobby, so he couldnt have heard you telling you to stop.",
            "You need some anger management bro",
            "The white felling axe will be missed greatly",
            "Naw I caught up to them as they were fighting another team",
            "Pretty sure voip is on in lobbys at this time..",
            "It's literally just funny roleplaying as a barbarian. You need to spend more time outside"
        ]
    }
}