{
    "QUESTIONS & KARMA MEGATHREAD": {
        "title": "QUESTIONS & KARMA MEGATHREAD",
        "score": 25,
        "url": "https://www.reddit.com/r/darksouls3/comments/1bq9c0r/questions_karma_megathread/",
        "content": "Ask your Dark Souls III questions here!\n\nHead over to /r/SummonSign for jolly cooperation, or r/pumparum for trading/items.",
        "num_comments": 318,
        "comments": [
            "I need karma to post - an upvote would be kind",
            "Need karma to post lads, want to post a dark souls 3 Yohrm tattoo I just done 😎👍!",
            "Any chance i could get some karma to post?",
            "Being unable to post anything has been quite annoying, especially since I cannot get karma to post if I cannot make a post and I don’t particularly wanna comment on people’s posts just to get Karma, when will the requirement be lifted, if ever?",
            "I need karma for a post, I can understand it's needed, but man, I just need help in my character creator 😞",
            "My post keeps getting deleted because I don't have enough karma apparently.  \nCan you guys help me with a humble upvote? Thanks in advance",
            "upvote please :o",
            "I need karma to post LOL. Pls upvote :)",
            "do i need luck scaling on my weapon for bleed to scale, or does luck flatly effect bleed buildup no matter what",
            "I'm 10 hours into this game and I really feel like I'm doing everything wrong... I played ER, DS1, DS2 and I must say DS2 I clicked after few hours. In this game I simply can't. Not sure if my approach is bad but I can't stick with this. 10 hours on and off on \"best\" (/s) Dark Souls game is a little weird. Thing is I really enjoyed the start of DS1 and DS2. Not sure if maybe I'm burned out but I need some help to point me in right direction."
        ]
    },
    "I did it.": {
        "title": "I did it.",
        "score": 156,
        "url": "https://i.redd.it/msmsbh19p28d1.jpeg",
        "content": "A week ago, my gaming laptop suddenly broke, taking my previous run (40 hrs and every boss up to freide)with it. So, using my window Surface 8 that I use for school, on lowest settings and 800x600 res, and another 20 hours, I beat every boss in the game. GG",
        "num_comments": 7,
        "comments": [
            "Low performance cant hold bro back",
            "Good job man🙏",
            "Bro cooked",
            "Nice dedication running it back! It's like the time I had to start Sekiro all over again before I could beat Isshin...but that wasn't due to any technical issues, it was a personal choice I took because I sucked!!",
            "Congrats",
            "Haha that's impressive, what sort of of FPS was it getting?",
            "(His laptop)"
        ]
    },
    "Tell me your experience. ": {
        "title": "Tell me your experience. ",
        "score": 75,
        "url": "https://i.redd.it/2a17g5w3m38d1.jpeg",
        "content": "",
        "num_comments": 59,
        "comments": [
            "Nameless was the one who took me 50 tries, but the every time I loaded in I was eager like it was both my first and millionth time.",
            "Nameless 10  \n\nMidir 14 \n\nAbyss 17 \n\nI guess I had it better than most people...",
            "I'll start:\n\nNameless King 50 times\n\nMidir 20 times \n\nAbyss 15 times\n\nFirst time Abyss were so hard. My favorite bosses are Gael and Dragonslayer.",
            "Abyss around 10 times, the king around 25-30 and Midir is my lex Luther still haven't beaten him",
            "Namess king was the only boss I didnt manage to beat on my +2 lvl 11 build. I even managed to beat lothric legit in that run but nameless was just too much. \n\nMidir nr 2 fromsoftboss ever no questions asked.\n\nAbysswatchers is such an enigma for me. One time I absolutely wreck their shit and bully them to death and the other time they wreck my shit and bully me to death. Thank god they have about 1.69 poise bevause if they had more they's be significantly harder.",
            "Abyss Watchers 5 or 6 tries, really liked them.\n\nNameless King of course took me at least 50 tries. Dude mopped the floor with me.\n\nAnd Midir.... It's a complicated relationship. I absolutely hated him. There were some tries that i didn't even land a single hit. He took me at least 80 tries before I quit the game because of him. Then suddenly one day I came back and it clicked for me, you have to dance with his moves. Now he's one of my favourite bosses ever made.",
            "Nameless King is my favourite. He is difficult, beautiful and handsome. Also with a tragic and hard lore. I didn't count the tries on him, but it was somewhere around 30-40. This was the most interesting boss fight in the game.\n\nAs soon as I understood that the abbys guys fight each other I knew it would be an easy fight and it really was.\n\nI haven't tried Midir yet ;)",
            "Nameless King is still fun, one of the few bosses I come back to offer my sword to others\n\nAbyss Walkers are still annoying. Just one of the necessary bosses, but one that still surprise one-shots me\n\nMidir... fuck Midir.",
            "Abyss Watchers 1st try - They are fun but also fair, thanks to the mad one that also fights them. The second phase feels like a standard elite mob.\n\nMidir - Took me maybe 3-5 tries. I fought him like a Monster Hunter dragon, which made it pretty easy. I think he is the first and one of the few FromSoftware dragons that is actually fun to fight.\n\nNameless King took me a few more tries, probably around 10. After a few attempts, I was pissed because of his first phase. I still think he is cool to fight, but I hate the first phase. Even though it is pretty easy and fast to go through, it is still no fun.",
            "1st time\n\nFuck knows, I used mist in the end.\n\n1st time"
        ]
    },
    "Damn, I love irithyll dungeon so much": {
        "title": "Damn, I love irithyll dungeon so much",
        "score": 24,
        "url": "https://v.redd.it/69mcmxsmn38d1",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Lmao what happened? XD",
            "Its your fault for playing too close to the black hole",
            "This was so funny! 🤣",
            "The sound",
            "The forces of irithyll dungeon demanded a sacrifice to the hole",
            "Ah... I see... XD"
        ]
    },
    "just fought midir for the first time and killed him first try": {
        "title": "just fought midir for the first time and killed him first try",
        "score": 250,
        "url": "https://i.redd.it/ygudrb4xpz7d1.jpeg",
        "content": "",
        "num_comments": 76,
        "comments": [
            "Impressive if true",
            "This dude be playing bloodborne in dark souls 3",
            "Bro is a hunter",
            "My brother in Christ look at the blades you wield",
            "Congrats! He is my favorite boss! So damn epic",
            "Your health bar is almost as big as Midirs",
            "i havent played inna min but i remember him being the most difficult boss for me, good shit",
            "Folks giving you shit for using good weapons but that doesn't mean the boss is just an automatic win. Beating him first try is an awesome accomplishment he's a major pain in the ass, great work!",
            "Need hard evidence please. Photo off the internet doesn’t suffice.",
            "Seeing that weapon I'm not surpirsed 😅"
        ]
    }
}