{
    "man misses elevator....decides to use his mobility scooter instead": {
        "title": "man misses elevator....decides to use his mobility scooter instead",
        "score": 3273,
        "url": "https://v.redd.it/ykpwct4tqsrc1",
        "content": "",
        "num_comments": 227,
        "comments": [
            "As stated by another user, this guy actually won a Darwin Award. Good job op!\n\nhttps://darwinawards.com/darwin/darwin2010-08.html",
            "Where did he think that door went?",
            "Didn't he literally win the Darwin Award?\n\n[https://darwinawards.com/darwin/darwin2010-08.html](https://darwinawards.com/darwin/darwin2010-08.html)",
            "I don't know why obvious stupidity pisses me off so much.",
            "I hope the person IN the lift was OK",
            "Somehow I don't think his lack of mobility is his only disability.",
            "Well, he won't get pissed off again, will he?",
            "![gif](giphy|D0RvPABUNF3AQ)",
            "I did not know there is a Wikipedia article about the incident\n\nhttps://en.m.wikipedia.org/wiki/Seodaejeon_Negeori_station\n\nEdit:\nAlso, on mobile this is a toxic link but the actual Darwin Award for this person\n\nhttps://darwinawards.com/darwin/darwin2010-08.html",
            "![gif](giphy|LyJ6KPlrFdKnK)"
        ]
    },
    "Posting this video is now banned": {
        "title": "Posting this video is now banned",
        "score": 528,
        "url": "https://v.redd.it/es57rpg9q02d1",
        "content": "\n\nAlright my cheddar bunny underlings, I hoped I wouldn’t have to make another banned video post, but this is getting obnoxious.\n\nEvery time this video is posted, there are tons of people complaining about it being reposted every two seconds. \n\nTo appease the underlings, I have decided that this video is no longer allowed. This time I am posting the video so everyone knows what I’m talking about. Hopefully this appeases y’all.",
        "num_comments": 123,
        "comments": [
            "He wanted to dye his hair red",
            "What was his goal?",
            "Well he showed us!",
            "Bro became his own opp",
            "What an idiot",
            "Right before he pulled the trigger he grimaced as though he knew what he was gonna do. Sure this is an accident?",
            "finally, the storm is over!",
            "Li’l Kaboom",
            "Laser tag is a hell of a game",
            "Too bad he didn't have a Huncho to have finger control"
        ]
    },
    "Bringing a knife to a gunfight": {
        "title": "Bringing a knife to a gunfight",
        "score": 566,
        "url": "https://v.redd.it/ciij1dj9ke9d1",
        "content": "",
        "num_comments": 59,
        "comments": [
            "A friendly reminder regarding the first rule of this subreddit. The candidate in the posted material must have removed themselves from the genepool by either ***death or sterilization***. Failure to comply by this rule will result in your post being removed and a ban issued at moderators discretion.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/DarwinAwards) if you have any questions or concerns.*",
            "The transition from tough talking to cartoonish wailing in this clip will never fail to make me chuckle.",
            "Every time I see this video have lowest res, more zoom, shorter duration and more thumbnails",
            "\"Scrap like a man, pussy.\"\n\nProceeds to squeal like a hungry baby",
            "Badass to bad death in 10 seconds",
            "I'll never feel bad for this turdball",
            "&#x200B;\n\nhttps://i.redd.it/pjttcrdqqf9d1.gif",
            "… My man you had a snowball’s chance in hell, but you at least were in a somewhat okay position, and then you were like “hold on let me BACK UP and take off my shirt,” giving him twice the distance and plenty of time to actually shoot you. Did you think you were fucking Michael Meyers?\n\nEdit: he was fucked either way, I’m just trying to put into words that he went from fucked to blatantly suicidally stupid.",
            "Can someone make a mod for Elden ring so when a invader dies they scream like this guy?",
            "Who actually would walk towards a man with a gun irl? Some people 🤦‍♂️"
        ]
    },
    "tiktok challenge, ends up getting ran over": {
        "title": "tiktok challenge, ends up getting ran over",
        "score": 4078,
        "url": "https://v.redd.it/ct7qzxl9e29d1",
        "content": "",
        "num_comments": 404,
        "comments": [
            "A friendly reminder regarding the first rule of this subreddit. The candidate in the posted material must have removed themselves from the genepool by either ***death or sterilization***. Failure to comply by this rule will result in your post being removed and a ban issued at moderators discretion.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/DarwinAwards) if you have any questions or concerns.*",
            "I feel sorry for the truck driver.",
            "What was the challenge supposed to be?!? I don't get it",
            "Bro became a swastika",
            "I just unmuted the volume after they saw his body and the SpongeBob song starts playing bro😭. I burst out laughing and then i was like oh shit. That was so wrong the audio",
            "Fuck around find out moment. Stop reproducing every idiotic thing you see on the net. Another wasted life for absolutely nothing.",
            "His dreams came true. People on the internet saw him",
            "There's fucked and then there's Family Guy pose fucked.",
            "Is he sleeping? Sometimes I sleep on that position.",
            "These tiktok idiots delete themselves from the gene pool. I can't feel bad for these kinds of people"
        ]
    },
    "Hiker Falls to His Death While Trying to Retrieve Drone from Steep Mountain Slope in Wales": {
        "title": "Hiker Falls to His Death While Trying to Retrieve Drone from Steep Mountain Slope in Wales",
        "score": 302,
        "url": "https://www.ibtimes.sg/hiker-falls-his-death-while-trying-retrieve-drone-steep-mountain-slope-wales-75076",
        "content": "",
        "num_comments": 46,
        "comments": [
            "A friendly reminder regarding the first rule of this subreddit. The candidate in the posted material must have removed themselves from the genepool by either ***death or sterilization***. Failure to comply by this rule will result in your post being removed and a ban issued at moderators discretion.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/DarwinAwards) if you have any questions or concerns.*",
            "Is this an Onion piece?\n\n\"Before his death, on the way up to the mountain, Onion, had already slipped and fallen once. He was bleeding from his knee and finger and bandaged the injuries from his first aid kit before the group resumed their journey to the top.\"",
            "Crib Goch is a dangerous place.\n\nhttps://youtu.be/CRf7CnhOzXY?si=bN3WlZlmB3PEP2L9",
            "Damn, it doesn't even tell us what kind of drone it was. Sheesh",
            "That article has a link to another incident of a woman falling into a volcano while trying to pose for a photo. Yikes",
            "I would not be surprised if I hear my stbx-husband dies this way someday. I’ve seen him put himself in too many risky situations flying drones. People need to realize when to take the L on replaceable items",
            "need a drone to retrieve a drone",
            "Hope his drone survived.",
            "But is the drone okay?",
            "This is not the Onion. Onion really fell to his death to retrieve his drone.\n\n“In retrospect, just leave it.  You can always make more money and buy another drone.  Risking your life over some bullshit.” - Captain Obvious from Southpark"
        ]
    }
}