{
    "Official Giveaway: June 2024 Seagate IronWolf Pro 16TB Hard Drive Giveaway": {
        "title": "Official Giveaway: June 2024 Seagate IronWolf Pro 16TB Hard Drive Giveaway",
        "score": 85,
        "url": "https://www.reddit.com/r/DataHoarder/comments/1de9zkn/official_giveaway_june_2024_seagate_ironwolf_pro/",
        "content": "Hi r/DataHoarder crowd! We love your sub and would like to rev up another giveaway with the permission of the mod team.\n\n\nThe prize is: one 16TB IronWolf Pro Hard Disk Drive\n\n**How to enter:**\n\n**Just reply to this post once with a top-level comment response on the following topic:**\n\n**What kind of loyalty program matters to you for a company? Is drive capacity, price point, excellent customer service, etc. the highest priority for you? Please include the phrases RunWithIronWolf and Seagate in your comment.**\n\nSelection process/rules\n\nOne entry per person. Using alt accounts will result in a ban. New accounts created after this post went live are not eligible. Entries are open until June 27, 2024 at 23:59 UTC. We will use a random raffler utility to filter out top level comments (that is, top-level replies to this post, and not to another comment, and not on any cross-posts). The tool will remove duplicate usernames, sort the list, and grab the randomly chosen username, at which point the winner will be contacted within a day or so of the giveaway ending. Winners will have 48 hrs to get us their physical address and contact details for shipping (no PO boxes). Any person who does not reply in time loses their spot and everyone moves up a tier. For example: the 1st place person does not respond, so the 2nd place person gets contacted. Seagate will use the information strictly for shipping purposes only and will ship the drive directly. We reserve the right to edit this post including this process and these rules without notice. This is reddit, after all.\n\nGeographic restrictions:\n\nOur policy is for our forums and Reddit giveaways to be global where local shipping and/or giveaway restrictions/current world events don’t prevent us, however we are basing the below list of eligible counties from previous giveaways, as some counties have unique restrictions (e.g. the obvious shipping restrictions to Russia and Belarus currently)\n\nUS\n\nCanada (will require a basic skills-based question if winner is chosen by law)\n\nBrazil\n\nSouth America\n\nUnited Kingdom\n\nGermany\n\nFrance\n\nIberia\n\nAustralia\n\nNew Zealand\n\nKorea\n\nIndia\n\nMalaysia\n\nSingapore\n\nChina",
        "num_comments": 405,
        "comments": [
            "A lot of posts are saying that price is king, but that's how we get lousy service and things like the WD SMR fiasco.  Price per TB is definitely a factor, but even more important, to me, is transparency about specs, features, and performance.  The more technically detailed the datasheet the better.  That and good customer service are FAR more likely to bring me back more than saving $10.  I'm a big believer (from experience) in the \"buy cheap, buy twice\" motto and avoid \"budget\" brands for the \"quality/service\" brands.  RunWithIronWolf Seagate",
            "The first thing I look is price point, however that's just the first filter, excellent quality and customer support are very important and I'd argue that I define a base of quality and support first then decide looking at the price after. **RunWithIronWolf and Seagate**",
            "Price and reliability. Have never had a bad Seagate drive until recently when one of my 3x 12TB IronWolf NAS drives threw a ton of SMART errors after 4 weeks. RunWithIronWolf",
            "**What kind of loyalty program matters to you for a company?**\n\nNone.  The idea is, Seagate makes hard drives that don't suck, and I buy hard drives that don't suck for my servers.  Loyalty doesn't factor into it.  Making and selling products (in this case, hard drives) that work well and last does.\n\nStorage capacity per drive and price point aren't actually a loyalty program, they're two of a number of factors that go into deciding what to buy and who to buy it from.  For whatever it might be worth I look for a stable price point per drive of a certain capacity when I spec out hardware and stock up on replacements because it makes budgeting easier.\n\nI guess the \"RunWithIronWolf\" thing is supposed to make for a good hashtag, which Reddit doesn't use.  But, okay, there you go.",
            "Is \"RunWithIronWolf\" a marketing phrase?  I'm sure at least one of my drives is Seagate.  It was on sale.  Because pricepoint is importantest.",
            "Price point and reliability are tied at the top for me.\nI would love to give Seagate a chance to RunWithIronWolf as my current drives are not wolves  just red.",
            "RunWithlronWolf \n\nSeagate\n\n\nPrice. It's always price. Shit quality but low price? I'll treat them like they are disposable. High quality high price? Worth it. As long as a price point is good value, that is what is important",
            "Price point, which funny enough means that, at least being here in Canada, every mechanical drive in my server is Seagate of varying types.  WD just never had economical options in Canada.\n\nRunWithIronWolf",
            "0Hi Seagate Surfer these are always fun.\n\n  \nfor me it's\n\n  \n1) Price per terabyte *per watt*, because eletricity is expensive here.\n\n2) mechanical reliability, but most drives are pretty reliable these days\n\n3) support/RMA experience when there is a failure.\n\n#**RunWithIronWolf** \n\n#Seagate",
            "Just because drive failures over time follow a bathtub curve, it doesn’t mean that customer service should take the same approach. We’ve all experienced companies working hard to get new customers, ignoring them once they’ve made a purchase, and then bending over backwards to get them back when they finally get fed up enough to leave. The most blatant example being an ISP/TV/Phone provider that offers a sweetheart deal, immediately raises the rate as soon as the deal ends, then drops the price back down after you go through the hassle of cancelling.\n\nDon’t do that. You don’t have to flatten the curve, but it should at least be more of a vanity sink than a bathtub. Do more for your established customers and give them a reason to stay. For example, it’s frustrating when a company’s communication slows down or disappears once you’ve purchased their product. Loyalty programs can be great, as long as they’re transparent. Most seem to be just another way to obtain customer data. Solid warranties and tech-support are also important.\n\nPrice point is most important to me. It doesn’t have to be the cheapest, but I consider all the factors when choosing the best value.  I will also add the phrases “RunWithIronWolf” and “Seagate,” because you asked so politely. You’re welcome."
        ]
    },
    "Internet forums are disappearing because now it's all Reddit and Discord. And that's worrying.": {
        "title": "Internet forums are disappearing because now it's all Reddit and Discord. And that's worrying.",
        "score": 1849,
        "url": "https://www-xataka-com.translate.goog/servicios/foros-internet-estan-desapareciendo-porque-ahora-todo-reddit-discord-eso-preocupante?_x_tr_sl=auto&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=wapp",
        "content": "",
        "num_comments": 338,
        "comments": [
            "Facebook groups as well which is truly awful, FB is where niche interests go to die with the influx of the masses.",
            "It's funny how the school of thought in the 00's was \"once it's on the internet, it's forever\", where the modern day internet is ephemeral as fuck and nearly as immediate as old-school television was where if you aren't there in the moment or saving the content yourself, it's over. \n\nEven info from that 00's era has been lost to time. There was one band I _loved_ from the 00's, a tiny metal band called Erg Noor where it was just a Ukranian guy that released a half dozen albums on a webpage, no advertising or anything, just some bedroom recorded music for fun, and as far as I can tell those albums are completely lost to time outside a few songs on youtube. And once those songs are gone from youtube, the music will be gone forever.\n\nMakes me so damn sad.",
            "Me and a friend discussed opening a 'Tired ass Millennial anime fan' forum basically.  The conclusion was that operating a forum on the web in 2024 is just operating an expensive scrape and DDoS target.",
            "One thing to learn from Reddit and Discord is that people are more likely to engage if they can be anonymous. I am much more likely to be authentic with people when I know it won't show up during a job interview. I'm much less active and engaged on Facebook or LinkedIn and assume any info I get there is sanitized to the point of ambiguity.",
            "I have a love/hate relationship with reddit.\n\nI love that it has so many active subs, but I really despise the management of it.",
            "Another thing that not even nearly enough people talk about is \"Fandom\", formerly Wikia.\n\nInstead of hosting their own instance of MediaWiki or similar, far too many people make their \"own\" wiki about their interest on fandom.com. And a huge chunk of pre-established big fan wikis of the past (previously running on MediaWiki or some similar engine) migrated there, too.\n\nThe obvious problem, just like with Reddit or Discord, is that it's centralized, and that Fandom outright owns the website and all of your Wikias.\n\nIt gets to dictate what the page layout will be like, and Fandom's pages are *ATROCIOUS* nowadays. There's a metric ton of unrelated banners for whatever brain goo hype-content-of-the-day, autoplaying videos about those unrelated topics and more shit like that. The page layout/design is a horrible ADHD mess. And you can't even browse image galleries normally anymore because someone at Fandom decided that the website should behave like an app. Every direct link to an image page is forcefully redirected to the main article page, so instead of clicking previews to open in a new tab, you're forced to view images in a pop-up thing on the original page. Also, a while ago they forcibly converted all pre-existing JPGs into WEBPs, which is *maybe* not necessarily a \"worse\" format on its own, but lossy->lossy conversion, especially of stuff that was already rare and probably in low resolution, is a crime.\n\nIt gets to dictate the content, too. The GTA wiki had an issue with transcripts of missions and dialogues from San Andreas because (naturally) they had the dreaded \"N-word\" which is somehow 100x worse than \"fuck\". Today Fandom doesn't like this, tomorrow it doesn't like anything that mentions celebrities / well-known people in any form, and your wikia about some movie series is suddenly gone.\n\nIf you and the hoster of your website start to disagree about some things, you can always pack up all your files and migrate to a different hoster. But you can't pack up a Fandom-hosted wikia, or a Reddit-hosted subreddit, with all of their accumulated content.",
            "Honestly as an anime fan, it's sad to see what has happened to MyAnimeList which was the go to site for anime experience. Now, r/anime's weekly engagements is far more than what you get there. I now check r/anime's episode discussions instead of MAL because it's simply just richer.\n\nAlso, of all the platforms, I personally hate discord, because it's just a black box and the rest of the internet can't know what is going on there unless you join.",
            "I hate to admit this is true even for myself.  I used to frequent so many forums throughout the years...  Hardocp, mmochamp, so many game and hardware forums, etc..  Now, just reddit. \n\nI absolutely despise Discord though, lol.  Such a God-awful layout.",
            "Reddit was one of the great repos, now every time I search for questions on google, a decent portion of the comments are either deleted or overwritten.",
            "At this point, I blame Discord as much as I do the people shifting to it.\n\nThey know they've become the host of a huge amount of important communities and information archives, yet they actively ban people for using archival tools to save and back up content and info.\n\nI get there's probably a lot of messy privacy concerns, but Discord needs to *officially* support some sort of export chat log tool."
        ]
    },
    "When an external hard drive dies, what is your strategy?": {
        "title": "When an external hard drive dies, what is your strategy?",
        "score": 6,
        "url": "https://www.reddit.com/r/DataHoarder/comments/1dlqrqf/when_an_external_hard_drive_dies_what_is_your/",
        "content": "When Samsung and WD drives start acting up, it will be working for ages, then one day, it will be connected as usual and then, no matter what you do, it won't mount, you can feel it running in your hands, but nothing shows up on your computer, you disconnect, reconnect, try to mount it via command/terminal absolutely nothing is working... what are your strategies/next steps? \n\nI have a few that have died/stopped working? and don't know what to do now.\n\nI have a Mac by the way, and an Windows 11 NUC running MacDrive, I have connected the drive to both, and have had nothing at all.\n\nEdit: when I connect it, I can feel it running when I touch it, but it doesn’t mount at all, I can’t backup anything because I can’t see anything when it is connected. ",
        "num_comments": 21,
        "comments": [
            "\nHello /u/DrWho345! Thank you for posting in r/DataHoarder. \n\nPlease remember to read our [Rules](https://www.reddit.com/r/DataHoarder/wiki/index/rules) and [Wiki](https://www.reddit.com/r/DataHoarder/wiki/index).\n\nPlease note that your post will be removed if you just post a box/speed/server post. Please give background information on your server pictures. \n\nThis subreddit will ***NOT*** help you find or exchange that Movie/TV show/Nuclear Launch Manual, visit r/DHExchange instead.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/DataHoarder) if you have any questions or concerns.*",
            "If I know it’s about to die, then I would try to copy all data off of it and then get a new drive to transfer the data back to, if it dies in the process, then I would try going a data recovery place if it’s personal photos and videos, but if it’s movies, ROMs and other non sentimental stuff, then I would get another drive and try to reconstruct the old drive by redownloading the movies and ROMs back to the drive.",
            "Shuck it & see if there's a SATA disk inside. I've had a few lucky friends/family who had an external die on them where the only fault was with the USB control board.",
            "There's not much that can be done besides backup ahead of the failure.",
            "Just did this within the past month, actually.  External EasyStore died on me (would spin up when plugged in but nothing would show up.  I got a “drive needs to be initialized” error message once, but that didn’t show up the next time I tried plugging it in).  Checked other USB cables and USB ports.  Then I extracted the drive and tried plugging it into other SATA to USB 3 adapters I had lying around.  Confirmed it was actually the drive itself that was dead.\n\nAt that point, went into Backblaze and initiated a restore and also placed an order for a replacement external hard drive.  Took a few days to download and unzip, but I think I have all of my data back at this point.",
            "I kinda expect my external drives to fail on me randomly at some point. Every time it gets plugged in, a program on my computer does a sync to my Nas automatically. A couple folders on the external drive don't get backed up, mostly things like movies and tv shows and other things easily replaced.",
            "I usually drill through it a coupple of times or shatter it with a hammer and then go buy a new one and restore from backup.\n\nBackups are supposed to be done before the drive dies. Saves a lot of money and stress.\n\nIf the data is valuable to you and you don’t have backups then I would head to a data recovery service. But assume it will cost you 3 digits depending on location of course.",
            "Throw it away, its dead. Buy new one, copy data from backup. If you dont have backup... Well... You got a lesson why have backups",
            "macOS is especially bad when it comes dealing with drives (or volumes) that have issues.\n\nSometimes it helps to connect the very same drive to a Linux machine and suddenly you get access back to your data. Assumes you have hfs support installed on the machine, of course. A Raspberry PI can come in handy in those situations.",
            "Recycle it and get a new one. That's why I have multiple backups."
        ]
    },
    "Helping a friend archive her deceased husbands digital life.": {
        "title": "Helping a friend archive her deceased husbands digital life.",
        "score": 33,
        "url": "https://www.reddit.com/r/DataHoarder/comments/1dlgdyy/helping_a_friend_archive_her_deceased_husbands/",
        "content": "I’m helping a friend who recently lost her husband, back up and consolidate all his data. He’s an editor so he had a lot of computers around the house but luckily he had work computers that I don’t have to worry about.\n\nShe wants me to just buy a big drive and copy everything from each computer onto the drive. I’m pretty tech savvy but I know it’s going to be a little bit more complicated than that.\n\nI have 3 questions: \n\n1. Is there a good guide on the best way to about this as far as, using a drive… cloud… blu-ray.\n\n2. Is there a good step by step guide on how to do this?\n\n3. What brands do most people recommend?",
        "num_comments": 15,
        "comments": [
            "\nHello /u/SamTheManBrown! Thank you for posting in r/DataHoarder. \n\nPlease remember to read our [Rules](https://www.reddit.com/r/DataHoarder/wiki/index/rules) and [Wiki](https://www.reddit.com/r/DataHoarder/wiki/index).\n\nPlease note that your post will be removed if you just post a box/speed/server post. Please give background information on your server pictures. \n\nThis subreddit will ***NOT*** help you find or exchange that Movie/TV show/Nuclear Launch Manual, visit r/DHExchange instead.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/DataHoarder) if you have any questions or concerns.*",
            "Not a professional, but I don't see why it would be more complicated than that? First get an idea of the total storage space needed, acquire an appropriately sized drive or drives, make a folder per computer, and copy over all important folders? That's what I would do. And Western digital is a commonly recommended brand.",
            "Beside doing a backup or two on different drive, the rest would probably be too confusing/complicated for her. Also, we have no estimate of how much data we are talking about so it would be hard to give any advice.",
            "Delete the porn.\n\nI’m not being glib but I had a backup of a Motorola phone that I had sitting in a “get around to processing” folder. On it were some ex-gf nudes that I had forgotten about. They’re now safely deleted but it did give me a chill that it could cause upset even though nobody did anything wrong.",
            "Not being too specific, the first thing to do is an inventory. Make a list of all the computers (and external drives) and note how large the drives are on each of them, and when possible what operating systems and formats they are. Then assess whether you can indeed just image all of the drives onto one large hard drive, or if there are complications like varied or really old operating systems, and post again here with more specifics, leaving sorting out what's in the data for after consolidation and backups.\n\nFor older operating systems, VMs (virtual machines) are often the way, but more specifics will be needed to figure that out.",
            "Depending on how much data, I would seriously consider cloud storage (Google Drive, OneDrive, Backblaze b2) etc. Plus a local copy.\n\nAssuming your friend isn’t super tech savvy I think it’s by far the safest option. Otherwise look up 3-2-1 backup strategy and do that.",
            "Cloud + local with redundancy covers most people's use cases. So like a 2-drive external enclosure with the drives mirrored (i.e. RAID 1), plus Google or OneDrive or what have you.",
            "Dont forget to delete his browsing history. That's what friends are for....",
            "For such unique data I would make it 4 copies. Or even 4. All being different from each other. 1 copy on good HDD. 1 copy on SSD, 1 copy on Blue Rays. 1 copy on cloud (that could be only for really most precious data like, photos, own work etc.) depending on size of those things.\n\nYou can't put price on memories.",
            "\"I’m pretty tech savvy.\"\n\n Said the guy asking for step by step tutorial."
        ]
    },
    "Any advice on LTO-6 drive models (2nd hand on eBay) to look out for?": {
        "title": "Any advice on LTO-6 drive models (2nd hand on eBay) to look out for?",
        "score": 3,
        "url": "https://www.reddit.com/r/DataHoarder/comments/1dlslyb/any_advice_on_lto6_drive_models_2nd_hand_on_ebay/",
        "content": "Which LTO6 drives do people usually recommend for Windows 11? I have 20tb that I’d like to back up in addition to other sata drives. Do used tape drives go bad? Like does it have a certain amount of writes before the magnet goes bad?",
        "num_comments": 5,
        "comments": [
            "\nHello /u/freshairproject! Thank you for posting in r/DataHoarder. \n\nPlease remember to read our [Rules](https://www.reddit.com/r/DataHoarder/wiki/index/rules) and [Wiki](https://www.reddit.com/r/DataHoarder/wiki/index).\n\nPlease note that your post will be removed if you just post a box/speed/server post. Please give background information on your server pictures. \n\nThis subreddit will ***NOT*** help you find or exchange that Movie/TV show/Nuclear Launch Manual, visit r/DHExchange instead.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/DataHoarder) if you have any questions or concerns.*",
            "Be warned with tapes - if the drive goes bad, you're in for some expensive repairs. They're enough of a niche market that repair companies usually charge 4 figures as a minimum.\n\nThere's only really two players in the field - IBM and Tandberg. I have drives from both, but mostly IBM (10 IBM, 2 Tandberg). I have 3 of their LTO-6s - one standalone and two for my TL2000 autoloader. One of the latter is faulty. The other two are fully functional. Because of how finicky tape drives can be, and the fact that you need basically the same generation drive to read its tapes, I make sure I always have two drives capable of reading any given tape.\n\nThe magnets don't wear out (they're electromagnets). What tend to wear out are the other mechanical parts - the internals of a tape drive are roughly watch-making (many, many tiny parts all moving in sequence). I've found there's a weakness in the IBM 3580 leader pin grabber (the arm that pulls the leader pin out of the tape cartridge) - two of my drives have this piece broken. I'm looking to 3D-print some replacements. There are other failure modes though - I have an LTO-4 that loads a tape but then gives a generic failure message that it doesn't recognise the tape, and an LTO-3 that won't load tapes, period. I'm keeping those for spares. I also have an LTO-7 that displays an infuriating SCSI error that I can't seem to find any information on - the drive starts writing fine, but then crashes.\n\nI have a Tandberg LTO-3 and an LTO-5. The latter just flat out doesn't work (diagnostics return failure). The former works fine. However, I haven't used the former drive for long enough to know how it'll behave.\n\nSo I have:\n\n10x IBM 3580s - 5 are functional, 5 are faulty.\n\n2x Tandbergs - 1 is functional, 1 is faulty.\n\nGiving me a nice 50% problem rate with both manufacturers! Even so, I prefer the IBM drives as their diagnostic tool, ITDT, is very comprehensive and runs on any platform.\n\nNote that tape drives will use a SAS interface so you will need a SAS HBA. And you will also need disks fast enough to drive them - often you want a RAID behind them because the tape will stop moving if the data isn't flowing, and that increases wear on it, so you need something able to throw data at the tape continuously without stopping to seek.\n\nTake this as fair warning that tapes are a difficult field to get into! My setup is starting to come together with Bacula as my backup software - it'll push data to tape as fast as the mechanism will allow (160MB/s for LTO-6). I have lots of different generations of tape I've collected over the years, about 200TB total. The different sizes actually make for convenient backups because I can choose to write entire tapes at once, which they're best at.",
            "Tape drive goes bad you're out a lot of money to access that data. Secondly my experience is Linux will work pretty well but Windows 10/11 treats LTO as old hardware and refuses to let it run.",
            "Remind me! 14 days",
            "I will be messaging you in 14 days on [**2024-07-06 10:42:02 UTC**](http://www.wolframalpha.com/input/?i=2024-07-06%2010:42:02%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/DataHoarder/comments/1dlslyb/any_advice_on_lto6_drive_models_2nd_hand_on_ebay/l9qvg2k/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FDataHoarder%2Fcomments%2F1dlslyb%2Fany_advice_on_lto6_drive_models_2nd_hand_on_ebay%2Fl9qvg2k%2F%5D%0A%0ARemindMe%21%202024-07-06%2010%3A42%3A02%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201dlslyb)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|"
        ]
    }
}