{
    "[Topic][Open] Open Discussion Thread — Anybody can post a general visualization question or start a fresh discussion!": {
        "title": "[Topic][Open] Open Discussion Thread — Anybody can post a general visualization question or start a fresh discussion!",
        "score": 6,
        "url": "https://www.reddit.com/r/dataisbeautiful/comments/1d5lerv/topicopen_open_discussion_thread_anybody_can_post/",
        "content": "Anybody can post a question related to data visualization or discussion in the monthly topical threads. **Meta questions are fine too,** but if you want a more direct line to the mods, [click here](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful.)\n\nIf you have a general question you need answered, or a discussion you'd like to start, feel free to make a top-level comment.\n\n**Beginners are encouraged to ask basic questions**, so please be patient responding to people who might not know as much as yourself.\n\n---\n\nTo view all Open Discussion threads, [click here](https://www.reddit.com/r/dataisbeautiful/search?q=author%3Aautomoderator+title%3A[Open]&sort=new&restrict_sr=on).\n\nTo view all topical threads, [click here](https://www.reddit.com/r/dataisbeautiful/search?q=author%3Aautomoderator+title%3A[Topic]&sort=new&restrict_sr=on).\n\n**Want to suggest a topic?** [Click here](https://www.reddit.com/message/compose?to=%2Fr%2Fdataisbeautiful&subject=[Topic]+Topic+Suggestion&message=I+have+a+topic+suggestion+for+the+monthly+threads:+).",
        "num_comments": 28,
        "comments": [
            "I spent hours trying to get insights from Tableau and PowerBI. The tools were too complex and not designed for marketing needs. Then I found Whatagraph. It was a relief! Whatagraph is built specifically for marketing performance monitoring and reporting. It's easy to use and gives me the insights I need to make informed decisions. I've been using Whatagraph for a while now, and it's saved me so much time and frustration.",
            "Hopefully this question / comment is allowed here. \n\nI have noticed that I do not have a flair showcasing my number of submissions. Is this something I do manually? Thank you.",
            "Can anybody recommend any digital books or sites that provide a ton of non-specific data diagrams and visualizations? Sorta like this sub but in an organized pdf or archive format.",
            "I'm looking for this one post I saw years ago. It showed data describing how people interpret moidfies (e.g., extremely > very > fairly > quite...). It had a lot of words and each one was displayed as a distribution of ratings. I imagine it was motivated by some specific scholarly paper. Anybody got a clue?",
            "I feel like an idiot asking this but can anyone identify the software used to create a lot of these job search charts? I want to use them for tracking my medication and symptoms (for myself not for publication) and I've been sent a few hate messages for asking how the charts are made. Please help?",
            "I have personal data on some fanfic writing I do. I'd like to organize the data into charts for hits, kudos, and chapter word length. I use Google a lot like Sheets for charts and data collecting. I was curious if anyone had any other data tools I could try, preferably for free.",
            "I want to represent the daily routine of villagers. Their should be 2 tables 1 for men 2nd for women. Under whcih women who are in SHG's, women during harvest and women migrating.",
            "This is a very small sample to understand how a random variable changes over time. But, generally speaking, if 0-9 is continuous, you could use a kernel density plot and overlay different years (or have them side by side). If it’s ordinal or discrete, histogram or bar chart I guess.",
            "Is it a popular tool  for companies?",
            "Maybe like an upside down pyramid chart and for each row you could overlay two colours to show difference between may and June"
        ]
    },
    "5 weeks of job hunting (AUS) [OC]": {
        "title": "5 weeks of job hunting (AUS) [OC]",
        "score": 280,
        "url": "https://i.redd.it/hi9smn4fyh9d1.jpeg",
        "content": "",
        "num_comments": 50,
        "comments": [
            "Jeesh, any potential employer that puts you through the hell of 3 interviews, then has you write up a case study, and then ghosts you deserves to go bankrupt.",
            "I wanna know why you walked out of 3 interviews!",
            "The 3 interviews plus case study just to be ghosted is brutal",
            "The data is from my own job search in the marketing field and made using SankeyMATIC.",
            "Congratulations on the new job!",
            "What the heck is a case study?",
            "Such a cool graph.   May I ask your profession and location?  Just curious.   Congrats on landing a new position!  💪🏻😎",
            "What hunting techniques did you use to actually get noticed?\n\nApplying early? Tailored resume for each?",
            "Why did you “walk out” 3 times?",
            "I'm at 2000 in the US.  2000 with no response."
        ]
    },
    "Public perception of scientists' credibility in the US has gone down": {
        "title": "Public perception of scientists' credibility in the US has gone down",
        "score": 1947,
        "url": "https://phys.org/news/2024-06-survey-perception-scientists-credibility.html",
        "content": "",
        "num_comments": 400,
        "comments": [
            "According to who? A bunch of nerd scientists? Like I'd believe that.",
            "You don’t “trust scientists”. It’s not a religion you put faith into. \n\nPeople can and should be skeptical of science. That’s how science is supposed to operate. Knowing how the scientific method works is what’s more important here than just “trusting science”.",
            "When you constantly tell people that facts don't matter, some of them will actually believe you it turns out.",
            "\"Share My Values\"? What a weird thing to ask. What's really concerning is half the people thought they knew enough to give an answer.",
            "This is by design.  Politicians felt like science was interfering with their ulterior motives, so they made their own science and discredited science.  People were trusting science instead of politics and television.",
            "It’s no coincidence that education is constantly being defunded at the exact same time.\n\nThe people who are in charge of running this country want to keep us stupid.",
            "I’m pretty progressive, but my lack of trust in scientists developed due to learning more about how broken the system of scientific publishing is. Scientists are very heavily pushed to publish first, good practice be damned. Furthermore there’s a clear influence of big business within science. Plus many scientists have displayed that being very well informed in a specific area does not mean a general expertise, and if anything indicates a lack of development in other areas. So I still respect scientists and academics, but my faith in large institutions and broken systems has waned.",
            "The thing is anyone can be corrupt.  People assume its anti-intellectual to distrust \"experts\", but many people are aware that not everyone smarter than you is looking out for you.",
            "Now break those out by political identity.",
            "There needs to be a clear, standardized, legal identifier that forces study results to be accompanied by who funded the study."
        ]
    },
    "Which Topic-specific Words Dominate UK Political Party Manifestos? [OC]": {
        "title": "Which Topic-specific Words Dominate UK Political Party Manifestos? [OC]",
        "score": 104,
        "url": "https://i.redd.it/xa7mxiuq6h9d1.png",
        "content": "",
        "num_comments": 31,
        "comments": [
            "So most people concern about housing, there should be one more option of cost of living.",
            "I'm surprised healthcare or NHS was not one of the topics listed. On several polls it is frequently one of the top 3 issues cited",
            "What is the total word count for each manifesto?\n\nGreens coming second on the environment! OK.",
            "Seems like everyone agrees the rent is too damn high.",
            "This is very simple (maybe too some will say) and interesting. Is there the same for France ?",
            "The Greens lagging behind on the environment, and it being overall only their third priority, behind housing and weirdly Israel-Palestine...\n\nGuys, you literally had **one job**.",
            "Nice work.  \nHow did you assert whether a word was related to some topic? Did you build the list \"by hand\" before analysis, or was it a more advanced tool?  \nReally interested because I ran a similar analysis with New Year's Eve presidential speech in France, and lexical fields were very arbitrary.",
            "Ah the UK, a country with a two-party system with six parties, and where a party with the same amount of votes as another party can get 10x the seats in parliament if the votes are more concentrated in one region instead of scattered across the entire country.",
            "Notice how the greens care more about palestine than the environment.",
            "So the Putin apologists don't say anything about Ukraine....🤔"
        ]
    },
    "[OC] Most-subscribed YouTube channels worldwide (May 2024)": {
        "title": "[OC] Most-subscribed YouTube channels worldwide (May 2024)",
        "score": 4312,
        "url": "https://i.redd.it/7cxhwlvfha9d1.png",
        "content": "",
        "num_comments": 750,
        "comments": [
            "wtf it was just yesterday pewdiepie and t-series were fighting for top spot",
            "this chart is how i know i am out of touch",
            "Wow the last time I have seen a graph like this was when PewDiePie was battling with T-series \n\nI can't believe how long ago that was",
            "Might be a weird question but what made you pick the top nine instead of the top ten?",
            "I'm still stuck with the pewdiepie vs t series war",
            "What a cesspool of content",
            "Don’t go down to two decimal places if you don’t consistently have two decimal places worth of data.",
            "What is beautiful about this data visualisation? ",
            "I've never watched a single video by any of these and I've only heard of 4 of them.",
            "I have not watched a single video of Mr. Beast. Not on purpose, it's never been suggested on my YT feed. Same as PewDiePie. I know these guys from the news feed but never actively looked for a video of them."
        ]
    }
}