{
    "Daily sticky thread for rants, raves, celebrations, advice and more! New? Start here!": {
        "title": "Daily sticky thread for rants, raves, celebrations, advice and more! New? Start here!",
        "score": 22,
        "url": "https://www.reddit.com/r/datingoverthirty/comments/1dqlpgi/daily_sticky_thread_for_rants_raves_celebrations/",
        "content": "This is the place to put any shower thoughts, your complaints/rants  about dating, ask for quick advice, serious and (sometimes not)  questions and anything else that might not warrant a post of its own.\n\n This post will be moderated, so if you see something breaking [the rules](https://www.reddit.com/r/datingoverthirty/about/rules), please report it.",
        "num_comments": 595,
        "comments": [
            "I think the hardest part of dating over thirty is just time. I can never coordinate with another 30 year old. We all work too much and have too many social obligations",
            "I was in her town for work yesterday and she wanted to see me so we grabbed lunch together! It was really nice. That makes.... 6? dates, if you can count that. It's been really nice and I think we both really like each other. \n\nIn a lot of my past relationships, I was always anxious. I don't feel anxious with her.",
            "Date 6 last night was amazing. Weve now both paused our dating app profiles. Date 7 tonight! Im making him dinner and were going to swim. Super excited!",
            "So... I had a date scheduled for tomorrow. Time and place set, but I just checked the app and she unmatched me. We didn't exchange phone numbers... big wtf moment.",
            "Im just having a bad day!!!!! I wanna text him sooooo bad even when I know I shouldnt. Unpaused my profile on the apps but I also dont wanna talk to anyone. Im spiraling and my week is ending on the worst note ever ",
            "AHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH\n\nThis isn't even about dating, just a bit tired from life in general but I can't let it get me jaded. Thanks for coming to my ted talk",
            "Alright, Im back with an update from my post a few days ago about a coworker giving me a mixtape on a USB drive. So I gave one to her and she loved it, said some of the songs on there reminded her of things she listened to as a teenager. We had a nice conversation where there was clearly a flirty vibe(!) and in this conversation she tells me that she makes music. This got me really excited because I love creative types. I left off the conversation with telling her to send me some of her songs because I wanted to hear them. Yesterday, another mixtape shows up on my desk and one of the songs was one of hers. It was under a different name than hers, but I instantly recognized her voice. So when she came in to work I talked to her for a bit, told her it was a cute pseudonym, and she smiled and told me the story of where it came from. Ive left another mixtape on her desk today. I am thinking Ill ask her out soon. ",
            "I just found out the guy I used to talk to is seeing my friend and hes bringing her flowers, planning dates, etc. Im shook and feel like crying. Guys dont make efforts for me and now Im comparing me and my friend trying to figure out what about me doesnt attract that type of behavior.\n\nEdit: I just want to say I have self esteem. This is just one of those times where I dont understand humans ",
            "How do you cope with the fear of running out of time to become a parent and the reality/possibility you will be alone as a senior citizen?",
            "I posted earlier this week about a popular speed dating event in my city that I just discovered recently and how the thought of going has piqued my interest. The reason is because I acknowledge my dating skills are rusty, I havent been on a proper date since 2019 when I met my now ex whom I broke up with January of this year. Well, their Instagram page has just posted a new event for my age group thatll take place at the end of next month, and its on a day Im off! Im taking it as a sign that I should maybe attend. Im going to buy myself a ticket after work I think.and then try and drop 100lbs in a month haha"
        ]
    },
    "How soon should attraction be felt to continue moving forward? ": {
        "title": "How soon should attraction be felt to continue moving forward? ",
        "score": 37,
        "url": "https://www.reddit.com/r/datingoverthirty/comments/1dqpqme/how_soon_should_attraction_be_felt_to_continue/",
        "content": "I (39F) have been on 2 dates with someone (42M) and have a third date coming up this weekend. We seem to share a lot of the same values and both of us seem interested in the other. Our conversation is pretty engaging, and we have some common interests. I’ve enjoyed both dates I’ve had with him, but still don’t find myself *attracted* to him. So far we’ve done coffee on one date and drinks on another, so I suggested we do some type of activity this weekend so we can hopefully see a new side of each other. I’m thinking that if we have a bit more fun, maybe that could spark an attraction?\n\nAfter the second date we hugged, but I didn’t “feel anything.” I’ve noticed a few minor things about him that I find *unnattractive* (a couple of minor habits, he’s had something on his face/in his nose both times I met with him, psoriasis, yellowish teeth), so maybe that’s what’s driving my feelings. But I know I’m not perfect and have flaws like anyone, so am trying to give this a chance, since we get along pretty well. How long would you date someone who you have no desire to kiss? Is 3 dates enough to know one way or the other? ",
        "num_comments": 62,
        "comments": [
            "I'm one of those who needs time to warm up to someone and develop attraction (or not). I'm almost never attracted to someone right away. However, I immediately know if I'm unattracted or repulsed by someone. Does the thought of this person going in for a kiss or in the throws of passion put you off? If so, you have your answer. If there's something about him that interests you and makes you want to keep seeing him, and you enjoy your time together, then continue.",
            "when I was single I tried to give any woman at least two dates but if I wasnt feeling it after that Id politely tell them I wasnt interested \n\nI dont really believe you can force it. Either its someone you are excited to see again or not. If not, might not be worth investigating why because it could be any combo of reasons. But after 2-3 dates I think its best to stop wasting both of yalls time if youre not feeling it",
            "I think if youre asking, you already know the answer. Most people can usually tell if they like someone within the first few minutes of meeting them. \n\nIf youre not curious about this guy, if the thought of hanging out with him alone or making out doesnt excite you then let things end here and move on. You dont need to give him a chance because all that may happen is the more time you spend together the more youll fall for him out of proximity and ignore things that are turning you off, that may be fine if thats what you want but there are many people living that life who would beg to differ. Find someone youre at least curious about and go from there, dont waste precious mental energy on people who you find meh.",
            "I feel like if youre asking, youre trying to convince yourself its okay that youre not attracted. Dont force it!",
            "I think attraction is often the initial spark that ignites a relationship. If it's forced, it often doesn't develop naturally. Perhaps it's best to consider moving forward as friends initially, over time, feelings can develop organically. You could then discuss any concerns you have about his physical appearance sensitively, without causing offense.",
            "Do him a favour dont see him againhe doesnt wanna be a guy you settle for",
            "For me personally, I tend to be attracted to someones personality more than their physical appearance. However my love language is physical touch and I know that with my ex, I liked him as a person and we got on well (honestly though not even exceptionally well), but the physical attraction came for me after there was some physicality. After he kissed me for the first time I was like oh damn, theres something here. And he wasnt even the best kisser, but Id got to know and like his personality by that point. Hopefully that makes some sort of sense! I guess what Im trying to get at is not everyone feels the physical attraction early on, sometimes it comes with time.",
            "You arent here for charity. You dont feel it. Move on. If hes got things that make him unattractive, thats ok. You have standards. Dont settle and dont force a feeling that isnt there.",
            "Two dates would be enough for me. I know by one if I am into him or not.",
            "I wouldnt see him again, this isnt a Im\nNot sure  this sounds a bit like hes grossing you out - trust your heart"
        ]
    },
    "Confused on what is going on or where to go next ? ": {
        "title": "Confused on what is going on or where to go next ? ",
        "score": 3,
        "url": "https://www.reddit.com/r/datingoverthirty/comments/1dr35f5/confused_on_what_is_going_on_or_where_to_go_next/",
        "content": "I (31M) have been talking to someone (30F) for about 8 weeks and met OLD. We seemed to really hit it off and went on several dates but I had to go on an extended work trip for a month. \n\nOver the course of the trip, I noticed our texting slowing down and didn’t think too much of it, she’s busy with her own life too. We continued to make plans with each other for when I got back.\n\nFast forward this week and we reconnected and had a date. Everything went well, held hands, and kissed a lot. We made plans for later next week and texted her after telling her I had a great time. She responded that she did too. Yesterday just sent her a small message hoping her day was going well but haven’t heard anything back in over 24 hours and not sure what to do. \n\nObviously not a great sign but a little confused because we seemed to have a good time this week. Is it bad to just message her again and ask what is going on? Or just let it naturally die if she never responds? I do want to pursue something with her and her OLD profile hasn’t changed, so I don’t think she’s actively looking around either. Any advice is welcome ",
        "num_comments": 11,
        "comments": [
            "Nothing weird about missing a text or continuing to date after getting to know you for a few dates. Whats making you uncomfortable?",
            "24 hours of silence is crass. Actions always prove why words mean nothing. \nExpress your feelings openly. You have nothing to lose; she either likes you back or it's a sign to go.",
            "Yeah I would feel a little more sketched out if the last date didnt go so well and if we didnt make plans for after the weekend. I will wait and see I guess but nothing to lose by being honest",
            "Yeah I dont understand why missing one text would even be considered abnormal or cause to question anything.",
            "That was my thought I dont need to text 24/7 but I get a little uncomfortable if its more than a day or so just to send a text back, and agree I dont want to waste anyones time wondering where someone stands.",
            "Ok, well you felt the date went well.  Do you know how she felt about it?\n\nI mean 2 months in and you are still in the kissing phase.  I think you should operate under the assumption that she is still talking to other men.  You should have much more physical intimacy than you are currently getting from her by this stage, unless I'm reading this wrong.",
            "Well when we saw each other this week it was the first time in over a month due to my work trip. Didnt really feel appropriate to do anything further when we both had work the next morning too. Idk just didnt feel like the best time for the first time for us",
            "On the next date, Id tell her how youre really enjoying getting to know her and ask how shes feeling about how things are going. Tell her you feel more serious potential.\n\nIf you are worried now, Id just start a normal text convo. See how that goes.\n\nSince you have a date booked and it seems like youre mostly worried about the one missed text, I wouldnt ask her whats going on now.",
            "> she's busy with her own life too\n\n> hasn't responded in 24 hours\n\nWhat's the problem here exactly?",
            "Check the evidence the first: you two have a date planned, she told you enjoyed herself, and everything seems normal in person. \n\nYou should absolutely communicate about this since this bothering you. Don't assume or start with an accusation. Ask from a place of curiosity. Something along the lines of \"Hey is everything okay? I didn't hear back so I was worried.\"\n\nIf you know that texting about non-urgent things  and not hearing back for a while could bother you, you could try asking to do quick phone calls every once in a while. \n\nAlso be aware that people attach different things to texting. Some people do not know how to communicate, it's how they would try to detach themselves from someone, and might advise you that it's exactly what she's doing. Always communicate and avoid assumptions until you talk with her."
        ]
    },
    "Please let me hear your story if you are over 40, never married no children but want to have children ": {
        "title": "Please let me hear your story if you are over 40, never married no children but want to have children ",
        "score": 296,
        "url": "https://www.reddit.com/r/datingoverthirty/comments/1dphbzc/please_let_me_hear_your_story_if_you_are_over_40/",
        "content": "I am 38 female never married and no children. Recently got back to dating apps and have been talking to a few guys ranging from 38 to 48, all never married, no children but want to have children. I am very curious about how they got to where they are if they want to have children. If you are such a man, what is your story? \n\nSo far I met 2 of them offline and decided not to see them again, and in both cases my hunch tells me that they have anger issues and I didn’t feel safe around them. One complaint badly about his boss and the other made some bitter comments about politics and got a bit angry for missing out job opportunities because he is white etc…\n\nI am open to children if I can still have them with a good guy, but it is not a must-have. And it makes me wonder the stories of those guys, or if the better strategy to find someone who is divorced with children. Not trying to stereotype them, but more out of curiosity. \n\nThanks for any response! ",
        "num_comments": 439,
        "comments": [
            "I think that some of us 40+ folks were encouraged to extend our youths through education & travel through our 20s, then did the rise and grind to catch up in our careers in our 30s, and didnt really feel like legit adults until our 40s.",
            "I live in a very high cost of living area and couldn't afford to have kids until I was about 40. I'm now 45 and haven't met my person, so it looks like I won't have kids. \n\nI think most of the guys in this situation were Peter Pan types, but I wasn't",
            "I'm 37, no kids, and never married. It's simple for me...I never wanted to have kids outside of marriage. I grew up without my father in my life and I've seen friends who had to ping pong between parents. I never wanted to bring a child into a situation like this, so I've waited. I want to meet the right woman, be in a stable and committed relationship, and build a family with her.",
            "My mother died when I was 30. Almost my whole 30s I mourned and was good for no one. By the time the fog started to lift, I was in my late 30s, my credit score was very low, I was behind in my career, in an apartment I didnt particularly like, and had almost no friends left. Took the rest of my 30s and a little bit of my 40s to get my mind right and square myself away. By the time I looked up, I was 42 and dating was waaaay different. 2 years later, COVID. \n\nIve always wanted 4 kids. ",
            "I think a lot of men vastly overestimate their ability to attract a significantly younger partner. I've been on dates with men in their upper 40s-early 50s who insist they want to have biological children. I'm 40F, and some of these men are getting a little long in the tooth even for me (lots of them seem to be using pictures 10+ yrs old on their dating profiles, and it's jarring when you see them in reality).",
            "37 female here and always thought Id have a family though I never truly made plans to do so (does anyone truly plan that?).  Married once but no children. My sister turned 40 this year and is facing the reality of a pregnancy at an advanced age. She and the baby are healthy, but the risks are so much greater. Im truly hesitant at this age to consider having children, though my heart still holds on to that thought dearly at times.",
            "Didnt start seriously trying to date until my late 30s. Was too content and happy being single. The first few relationships were rough. I wanted to settle down but I didn't really want to be with anyone. I was happiest alone so I'd always find myself wanting my date to leave so I could relax. It took some heartbreak and being alone and sad for me to actually want to be with someone instead of just trying because I realized I was getting old. \n\nIf youre one of the first people someone like this dates, it will be frustrating and take a lot of hand holding. It took me a few tries to realize adult relationships required more than good jokes/sex. Looking back its funny how much I resisted relatively simple things like regular communication, planning dates, paying attention to them, etc. 40 now and first kid is arriving in a month.",
            "Yeah you're going to run into people who simply weren't worthy. That's dating in general, some people are single for a reason. Others haven't met their goals for reasons that are completely understandable. They were with someone and had kids already, or they had a partner who didn't want kids, or they weren't ready for kids when they were younger but are now. Just gotta keep sorting your way through em.",
            "Simple enough for me. My now-ex wife was adamant she didnt want kids. So there went many years. It didnt bother me much at the time, so Im not blaming her. After that, there was healing from the divorce, then the dating pool. It just took/takes a long while to find someone WORTH having kids with! Its not a quick commitment.",
            "I have a friend, 43M, who is single with no kids, but actively dating, and he is of the mind that if he meets someone who wants kids, he'll probably have kids, and I HATE this mentality. This fence sitting, blas attitude towards bringing a whole human in to this world without actually being sure that you want to have them. That is the only reason to have a child. Because you really, really want to be a parent. Anything less than that, do not have children."
        ]
    },
    "How to react to my partner being less affectionate": {
        "title": "How to react to my partner being less affectionate",
        "score": 101,
        "url": "https://www.reddit.com/r/datingoverthirty/comments/1dpglyg/how_to_react_to_my_partner_being_less_affectionate/",
        "content": "Hey there! I’m a 35(M) and in a 7 month exclusive relationship with a 34(F). And seeing each other for closer to 9 months. \n\nThe first few months I was met with so much reassurance from my partner. Super lovey texts all the time, and seemingly she always wanted to hang out. Somewhere in the past two months I noticed a major shift, no more lovey text messages, not wanting to hang out quite as much. \n\nI brought it up and she just mentioned that she couldn’t always be that way which is totally fine. But it seems like she is now never that way anymore. I’m figuring out how to communicate this without appearing needing, weak or that constant ask of “reassurance”. \n\nIt was just such a jarring change from her behavior the first few months to how it is now. We’ve both been pretty clear about not wasting each other’s times at our age as we both want to start a family. It just seems very hot to cold to me. \n\nAnybody else experience something similar and how did you go about it?",
        "num_comments": 182,
        "comments": [
            "Talk about it \"hey, I notice we have recently been connecting with each other less and less. Talk to me.\"\n\nAdam Lane Smith had some great content on this. Usually around the 6-7 makr the dopamine novelty hits start to disappear and insecurely attached people will start either losing interest or don't have the tools to set up the environment for long term trust, safety, and connection.",
            "Are you happy with how the relationship is currently? If not bring it up with her and if there isn't a change get out!",
            "The closest experience I've had to this was when I was seeing someone and he was affectionate physically on his own like he enjoyed holding hands and hugs and being close physically. Then he one night told me he's not an affectionate person after I reached for his hand and he pulled away. I must have looked at him like he had two heads because he quickly said he wasn't raised to be like that. I was confused because he was like that on his own without me prompting it. I felt like he was faking it because maybe he thought that's what I wanted and he really didn't, but he never said a word until that one night a few months in. \n\nAll this to say...has she experienced a change in her personal or professional life? Did she maybe think this is what you wanted and ultimately she was doing it to make you happy? Definitely have a conversation about it with her. I also wonder if it's just something where some people \"drop the act\" after a little while because most (not all) come with a facade of someone who they want to be in a relationship or who they think the other person wants them to be. Not saying this is her...primarily thinking out loud here.",
            "I experienced something similar recently but mine is way shorter than yours, just 2 months and the change started last week. I was angry but didnt say anything, matched his effort so ignored him as much as he ignored me, he then panicked I guess and started reaching out a lot, but a few days later he started pulling back again. Hot and cold, like you said. I then learned that he was losing his attraction and was feeling attracted to other women. I wonder how long I would put up with it if he didnt willingly say it to me, I mightve lost more time. I agree with the ones suggesting to have a talk about this.\n\nWe broke up but he wants to get back together. I understand feeling too comfortable in a long term relationship and losing attraction a bit but 2 months felt too early for someone to feel that about me, so I wont take that offer. Your relationship is long enough to start being in that territory, but the change is sharp enough to bother you, so its worth it to have a serious talk about it. Your needs matter (telling this to myself too as I tend to ignore my needs in a relationship).",
            "Sit down and have a conversation about how you're feeling and how she's feeling. Talk about your relationship and anything that is impacting her. Does she have life stuff going on? Does she need a break from the relationship. Is she losing interest. Could be anything. You just need to ask her and sit and talk.",
            "Could be a case of love bombing or partner having other priorities and has stepped off the cloud 9 of the honeymoon period",
            "Interested to see where this goes. Sorry you're going through this OP, haven't dealt with this situation myself but the bottom line is that enthusiasm and reciprocity are everything. The sudden change in energy is upsetting. I hope there isn't something nefarious going on with her.",
            "I'm a female in your position and it's tough. I've talked to him about a few times. He's showing more effort after I brought it up to him but I'm worried he'll fall back into his old habits. If that's the case, I'll call it quits. No need to keep asking him over and over again.",
            "You are not needy or weak for expressing your needs! There's plenty of ladies that would be so happy/relieved to find a partner tuned into their needs enough to communicate them!\n\nListen to what your heart is telling you - you don't feel comfortable bringing up your actual needs in this relationship and you're only 7 months in! When you did talk to her she dismissed your needs. Please find a match that is better suited to you. <3",
            "Have you two sat down and had a conversation where you brought up your concerns/the change in general?"
        ]
    }
}