{
    "r/Dating is NOT the place to soapbox Incel/Blackpill rhetoric.": {
        "title": "r/Dating is NOT the place to soapbox Incel/Blackpill rhetoric.",
        "score": 5791,
        "url": "https://www.reddit.com/r/dating/comments/es2cek/rdating_is_not_the_place_to_soapbox/",
        "content": "There has been a slow and steady influx of unwanted and misguided conversation plaguing our boards over the last year or so. I don't think this is a surprise to any of you all. While we ultimately encourage healthy discussion around both the positives and negatives of dating the overall spirit of this sub has been lost. Many of our readers have expressed their concern to our moderation team and we honestly feel the same way.\n\nOur \"No Soap-boxing or Promoting an Agenda\" rule has always been on the sidebar for our users to see but I want to stress our current stance on the topic. **Soap-boxing will and has always included red/black-pill ideology, \"alpha-male\" talk, and the subset of vocabulary that comes with it.** \n\nThis means that using our board to preach about how there is no hope for men (or women) who are conventionally unattractive is unwanted and will be removed. Using our board to discuss how you think women are shallow and will only choose the top percentage of men is unwanted and will be removed. Even just a mention of the term \"Chad\" is unwanted and will be removed.\n\nWe can sympathize that dating is difficult and is even more difficult for people that might not be the prettiest. It's no secret to anyone. What we value though is genuine discussion and helping those who actually want and need it. The countless misogynistic threads about how women and society aren't fair to men are toxic and don't do anyone any favors. There are better subreddits that would love to discuss these types of concerns with you in a more healthy way. Misandry is as equally intolerable. \n\nAt the end of the day let's lift each other up. Let's share our experiences and learn and/or laugh from them! Ask the questions that need to be asked. But let's not lose sight of what dating is really about.\n\n**EDIT: If you do see any rule breaking behavior please report so that we can take action. It's hard to see every comment. Thanks!**",
        "num_comments": 44,
        "comments": [
            "Welcome to /r/dating. Please make sure you read our [rules here](https://new.reddit.com/r/dating/about/rules) and remember to:\n\n* Be polite and respect each other. Do not call people names, engage in slapfights, or give bad/unethical advice.\n* Do not soapbox or promote an agenda - you will be banned\n* Follow reddit rules. Do not post content that promotes hate based on identity or vulnerability. Do not bully or harass other users.\n\nIf you have any questions, please [send the mods a message](https://www.reddit.com/message/compose/?to=/r/dating).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating) if you have any questions or concerns.*",
            "Reminder: please review our rules, especially rule 4:\n\n- No broad generalizations, e.g. \"All women are x and do y\"\n- Speak from specific personal experiences when giving advice.\n- No victim-blaming\n- This is a default message - your post has not been removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating) if you have any questions or concerns.*",
            "Reminder: please review our rules, especially rule 4:\n\n- No broad generalizations, e.g. \"All women are x and do y\"\n- Speak from specific personal experiences when giving advice.\n- No victim-blaming\n- This is a default message - your post has not been removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating) if you have any questions or concerns.*",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]"
        ]
    },
    "Men, what is the sweetest thing a woman has ever done for you?": {
        "title": "Men, what is the sweetest thing a woman has ever done for you?",
        "score": 68,
        "url": "https://www.reddit.com/r/dating/comments/1dr3ung/men_what_is_the_sweetest_thing_a_woman_has_ever/",
        "content": "What is that one thing you'll never forget a woman did for you that still brings smile to your face to this and you wish to experience it again?",
        "num_comments": 142,
        "comments": [
            "I don't have any romantic experience to pull from, but I've had two female friends send me Christmas cards past 2 years. They custom made them with cute art, decorations, and hand written. They were really sweet.",
            "Damn why this comment section sad as hell.",
            "One brought me food when I was sick.",
            "A women once loved me with all her heart",
            "Despite having been in a few relationships, literally nothing of the sort comes to mind, especially not to the extent of bringing a smile to my face.  Whilst I know other men have enjoyed the kindness of women, I am yet to experience anything.",
            "Im the woman but my ex had lost his mother to suicide a few years ago and it was coming up to the anniversary and I knew he was struggling so I bought and named a star after her and got him a star map and had it framed for him,",
            "My ex was really good at drawing and cursive writing and would doodle in a notebook I have. I still have that notebook and look at the page where she wrote I love you sometimes just to go back to that moment in time. Weve both moved on and Im happy but sometimes I want to feel heartbreak again.",
            "F***ck sending love to all my fellow homies here in this sub after reading the comments.",
            "Helped me carry on. Wish she was still here to do that.",
            "Well my mom never forgets to wish me a happy birthday. Sometimes she and my dad (graparents too) are the only ones who do. That's gotta count? Nice to have something other than \"\" raided your village, battery full remover charger, and weather L -4 H 15 on my phone screen once day of the year."
        ]
    },
    "I was cheated on many times. What should I do?": {
        "title": "I was cheated on many times. What should I do?",
        "score": 242,
        "url": "https://www.reddit.com/r/dating/comments/1dqvyrf/i_was_cheated_on_many_times_what_should_i_do/",
        "content": "Hey, so there's this guy. We've been together since high school, and things were great at first. But then I started noticing him acting distant, always busy with his new college friends. I heard rumors about him and another girl from our class, and when I finally checked his phone, I found messages that confirmed my suspicions.\n\nI confronted him, and he denied it at first, but eventually admitted to cheating. He begged for forgiveness, promised he'd change. I loved him so much that I believed him and we tried to work things out. But it happened again, and again.\n\nShould I keep forgiving him just because I love him?",
        "num_comments": 176,
        "comments": [
            "No, you deserve to be with someone who respects and values you. Leave him and find someone who will treat you right. Don't settle for less.",
            "Nah. If you keep forgiving him youre dumb as a rock. What makes you think theyre gonna change if theyve done it many times?",
            "People cheat when you give them more than they should get. You find cheaters. You let them go. World is big and the day you go out in the city there are millions of opportunities. World is so big that there is always someone for you waiting when you will be there. Dont waste time on someone who doesnt know your worth.",
            "The only logical solution here is to fuck his dad.",
            "Absolutely not. Forgiving him over and over sends a message to him that what he's doing is ultimately okay with you. Get very clear on whether this behaviour is okay with you.\n\nAsk yourself: what kind of relationship do I really want? How do I want to be treated? What does respect mean to me? Would my true love cheat on me, or would he love me as much as I love him?",
            "If someone cheats on you once and you don't leave them, they'll do it again.  He doesn't respect you or care about your feelings.  If he did, he wouldn't cheat on you.  The question is whether you respect yourself enough to cut him loose and move on.",
            "I understand you love him but your self respect is on the line .he cleary doesnt respect you or values you enough ,the bare minimum in a relationship is to be loyal please end it .",
            "Treat yourself right queen, he isn\\`t the right man for you. If he does it multiple times he won\\`t stop",
            "No, you deserve to be with someone who respects you. \nI was married to a cheater and with dv, i stayed with him because we had our son. But it isnt the environment you want to live in. Choose for yourself and love yourself more than you love him.",
            "Theres no love without respect. If he doesnt respect or value you enough to not do anything thatd hurt you then it makes no sense to be with him. Hell constantly take you for granted and keep hurting you more ahead."
        ]
    },
    "How many girls are you taking to currently. ": {
        "title": "How many girls are you taking to currently. ",
        "score": 79,
        "url": "https://www.reddit.com/r/dating/comments/1dr20tz/how_many_girls_are_you_taking_to_currently/",
        "content": "How many talking stages are you currently pursing? I ask because I am struggling in the talking stage with women on dating apps like hinge, and also wondering if talking to multiple women is the norm for must single men. ",
        "num_comments": 214,
        "comments": [
            "0\n\nAnd it will remain that way for quite some time",
            "I dont bother juggling, its tedious and unenjoyable. I prefer one at a time.",
            "0 \nI used to talked to this one girl , but she use to just talk to me for college related stuff now college is over she blocked me",
            "0. Been this way for 94% of my adult life and Im not thriving.",
            "Before my bf and I started dating (4 years ago) I would talk to everyone who would chat with me, usually 3-5 guys seriously, chatting with lots of randoms, but Ive always been serious when it came to dating so if I didnt see it becoming a relationship after one date Id rip the bandaid and tell them right away because leading people on is fucked in my opinion and Im blunt. The second I became seriously interested in a guy or girl who was equally interested in me- I dropped everyone.",
            "0. I go to work, and the gym and thats about it for my interaction with others. That being said, I havent tried online dating yet. \n\nSeems like a shit show, that Im not even prepared for. Dont have good enough pictures to the point Id feel like putting myself out there yet. And even then, the odds seem against me, to put it nicely.",
            "0. The 95% fail rate makes me not even want to try anymore",
            "0 for several months now",
            "None\nFinding a girl to talk to",
            "0.5 because she still responds every couple days lol"
        ]
    },
    "18F. How many people are you talking to rn(romantically)? ": {
        "title": "18F. How many people are you talking to rn(romantically)? ",
        "score": 24,
        "url": "https://www.reddit.com/r/dating/comments/1dr7wc5/18f_how_many_people_are_you_talking_to/",
        "content": "18F(and I'm straight). I realised that I'm literally talking to ZERO guys right now. Gosh, how I miss having crushes and stuff lol. Anyone wanna talk or become friends? ",
        "num_comments": 52,
        "comments": [
            "None at the moment. Taking a break after a disappointing end to a situation with someone I thought would lead somewhere ",
            "Having a third date tomorrow and a first date next Saturday",
            "Yeah if u aren't a scammer.",
            "Hi everyone Im new here",
            "the only message i receive from my phone operator to not forget to top up for the next months bill. No friends no family no romantic relationship. Currently everything goes fine though and it will go like that until it wont.",
            "I got 17 messages yesterday. So 0",
            "I mean yeah. Doubt you'll see this amongst the horses of fellow desperate men in your comment section now tho. 19M (suffers from stupid)",
            "Yeah... I would love too",
            "Nobody, but having a new friend would be nice  send me a message if youd like to chat and get to know each other. Or if you just want to vent lol.",
            "32f and speaking to 2 men - 27m & 36m, theyre both aware Im dating. But Im happy to see where it goes with either of these two and take it from there. Did delete my dating apps too, very overwhelming. See how they go if not Ill have a month or two not talking to anyone."
        ]
    }
}