{
    "Workflow Wednesday": {
        "title": "Workflow Wednesday",
        "score": 4,
        "url": "https://www.reddit.com/r/davinciresolve/comments/1dj8zob/workflow_wednesday/",
        "content": "Hello [r/davinciresolve](https://www.reddit.com/r/davinciresolve/)! Welcome to this month's Workflow Wednesday thread!\n\nFeel free to share any part of your workflow or questions you have to improve your workflow, from capture to delivery.",
        "num_comments": 7,
        "comments": [
            "Is there a way to do a dynamic pan using the cut page?  \nI'm pretty sure I once saw it on a video, but I forgot and can't find how",
            "Open the inspector and you can use dynamic zoom. You can use the tools to map the zoom start and end. Make the green and red boxes and equal size and it turns into a pan tool essentially.",
            "If I understand you correctly...I think what you're looking for can be done with a compound clip. I've had edits where the transition gets glitchy or just unevenly represented when trying to add the transition to the end of clips on multiple tracks at once. \n\nI've gotten around this by selecting the two clips and turning them into a compound clip and then applying the transition to that new clip (that is now on only 1 track)...hope that helps!",
            "Ended up figuring this out yesterday and it worked great, thank you!",
            "Ah - sure, no worries. Glad to hear you got it!",
            "Is there a way to essentially combine two tracks (say, footage below and a PNG overlay above) and have them combine for a transition to another track on the base level? Like having the source of the transition be both tracks flattened into each other? Whenever I try and do a crossfade to an end title, I get mixing issues (the stuff that the PNG is intended to cover becomes visible during the crossfade).\n\nI'd love a way to kind of collapse multiple tracks together for the purpose of transitioning into a single clip, I run into this problem a lot with motion graphics.\n\nI'm guessing I should be doing a nested timeline for clips with overlayed graphics instead?",
            "Thanks for your reply!\n\nI knew this, but I wanted the preset that was somewhere, idk where.  \nTurn out, if you go to the cut page and select \"Tools\" at the bottom left side of the preview window, you can activate the dynamic zoom from there. But it also has a \"Pan Preset\" which zooms both green and red windows a little, and puts them left and right, so it truly is a dynamic zoom.\n\nThe only problems with this, is that it doesn't have a top-bottom one, and you can resize both of them at the same time, so one might be slightly bigger if you were to resize them"
        ]
    },
    "DaVinci Resolve 19 Public Beta 4 Release Notes": {
        "title": "DaVinci Resolve 19 Public Beta 4 Release Notes",
        "score": 39,
        "url": "https://www.reddit.com/r/davinciresolve/comments/1dpj0wk/davinci_resolve_19_public_beta_4_release_notes/",
        "content": "DaVinci Resolve 19 Public Beta 4 has been released!\n\nYou can download the update from [the support page](https://www.blackmagicdesign.com/support/family/davinci-resolve-and-fusion) or by going to [DaVinci Resolve>Check for Updates](https://imgur.com/nQetFeK). *Note:* You must have \"Automatically Opt-In for New Beta Program Notifications\" checked in System Preferences>System>General to get beta updates from DaVinci Resolve>Check for Updates.\n\n# Reminders\n\n**Beta Bug Reports** need to be submitted to Blackmagic Design. You can post them on [the official 19 public beta subforum](https://forum.blackmagicdesign.com/viewforum.php?f=38).\n\n**Feature Requests** need to be submitted to Blackmagic Design. You can post them on the [official Feature Request Subforum](https://forum.blackmagicdesign.com/viewforum.php?f=33) or in the download form for Resolve.\n\n**Bug Reports and Feature Requests posted on Reddit and in this thread will not be addressed or seen by Blackmagic Design.**\n\n# What’s New in DaVinci Resolve Public Beta 4\n\n* Ability to Live Sync content from Blackmagic Design cameras.\n* Support for Blackmagic RAW SDK 4.1.\n* New replay menu controls to add most recent and go to end.\n* Improved speed change indicator in the Cut page.\n* Option to select checkerboard and grey alpha viewer backgrounds in the Cut and Edit viewers.\n* New nested timeline indicators in the Cut page with decompose clip context menu option.\n* Improved audio waveform visibility when trimming audio in the Cut page.\n* Improved real time control response to clip equalizer changes.\n* Ability to assign keyboard shortcuts for up to 5 UI layout presets.\n* Ability to switch Blackmagic Cloud organizations in project manager.^(+)\n* New occlusion mask input for Surface Tracker in Fusion.\\*\\*\n* Fusion tracker modifiers now default to using IntelliTrack if available.\\*\\*\n* Fusion clip listing now ignores color page clip filters.\n* Various improvements to Resolve FX Film Look Creator.\\*\\*\n* Ability to lock a node stack layer.\n* New IMF iQIYI Deliver page preset.\\*\\*\n* Media management now falls back to copy for trim failures.\n* Preferences option to automatically patch armed tracks without audio input.\n* Ability to resize 2-up and 4-up views in the media pool.\n* New projects now default to preferring originals over proxies.\n* Improved thumbnail and waveform previews for growing files.\n* Scripting API support for getting node stack layers of a timeline item.^(++)\n* Addressed issue with shape color picking offset in Fusion.\n* Addressed an issue with ending project names with periods in local libraries on Windows.\n* Addressed decompose on edit being ignored when replacing with an in out range in the Edit page.\n* Addressed the Replay Editor \"Go to End\" button not working in the timeline.^(+)\n* Addressed incorrect color for JPEG renders.\n* Addressed an issue with clearing icon when resetting Color Slice from a color panel.^(+)\n* Addressed an issue with Surface Tracker undo and redo in Fusion.\\*\n* Addressed an issue where live overwrite is not allowed when a camera is selected on the replay panel.^(+)\n* Addressed an issue where viewer playback point should stay at the out point after a live overwrite.\n* Addressed an issue where some scripts don’t show in Workspace menu at startup on Linux systems.\n* Addressed an issue with invoking show tracker controls shortcut in Fairlight.\n* Addressed potential audio issues after changing audio format of edited media in the source viewer.\n* Addressed an issue with playhead position after viewing nested clip contents.\n* Addressed an issue changing color bar values with mouse wheel hover in the Color page.\n* Addressed incorrect preview position on the full clip waveform in the source viewer.\n* Addressed an issue with exporting Audio Vivid timelines with pan automation.^(\\*\\*)\n* Addressed incorrect waveform for media with synced audio.\n* Addressed Fusion viewer corruption issues in RCM projects on systems with NVIDIA GPUs.\n* Addressed viewer overlay issue when animating a Fusion template.\n* Addressed an issue where not all selected points would be published to the Fusion tracker.\n* Addressed a cursor issue when moving between upper and lower cut page timelines.\n* Addressed an issue loading projects with Apple cinematic clips.\n* New add window option for Advanced Panels in the power window side panel.^(+)\n* Addressed incorrect data burn display with grey or checkerboard background.\n* General performance and stability improvements.\n\n# Pre-Installation Notes\n\nFor DaVinci Resolve 19.0, BMD has taken efforts to keep the project libraries compatible with DaVinci Resolve 18.6.6. While this allows you to access the project library with 18.6.6, individual projects created or opened in 19.0 will no longer be accessible in 18.6.6.\n\nBMD recommends a full project library backup as well as individual project backups before opening projects in 19.0.\n\n# Documentation & Asterisks\n\n[The new features guide is available on the BMD support web site.](https://documents.blackmagicdesign.com/SupportNotes/DaVinci_Resolve_19_New_Features_Guide.pdf)\n\n\\* - Item is in progress in this build.\n\n\\*\\* - Studio-Exclusive Feature.\n\n^(+) - Additional fees, licensing, and/or hardware required.\n\n^(++) - The Scripting API is available in the console on the free version, but external access requires the Studio version.\n\n# Installation Notes\n\n* Please install the panels firmware update to improve idle battery consumption with the DaVinci Resolve Speed Editor and Micro Color Panel.\n* If you use a Nvidia graphics card, please upgrade your driver to Studio driver 546.01 (Windows) / Studio driver 550.40.07 (Linux) or newer.",
        "num_comments": 51,
        "comments": [
            "The only thing I want is turn off auto page scroll in the edit page",
            "Anyone know what improvements they made to the Film Look Creator?",
            "Only thing I want is a refresh button in text+ where it reloads new added fonts, without having to relaunch. Also live sync from cams sounds wild.",
            "hmm but I guess shut down after render still impossible.",
            "No updates for Snapdragon X Elite? :(",
            "Transcription still doesn't seem to behave how I would expect \n\nNot sure if it's to do with Speaker Detection or not, but I liked it in 18.6 where you could have the transcription up with that timeline in your preview/source window, and then a different timeline open and could easily drag and drop after selecting the section you wanted",
            "I found this a notably heavier install than most recent ones: new CUDA requirement, new C++ runtimes, and the GBs are really mounting up ...",
            "Also where on earth can we enable this, I must be blind as I can't see it anywhere:  \n\n* Option to select checkerboard and grey alpha viewer backgrounds in the Cut and Edit viewers.",
            "I've got a random question to add to this, related to nested timelines.\n\nSay I have a title overlayed on some footage, potentially multiple interacting graphics on top of some footage. I want to add a transition to smoothly move to the next clip. What's the best way to do this? I wish there was an easy way to crush the stack. Is nesting a separate timeline the best way to achieve this? Is there another option or workflow for situations like this I'm missing?",
            "Yes. Just let the playhead go offscreen. Such a simple thing to have a toggle for. Or at least something that auto pauses the video if you're in the midst of an action that's about to get real screwey when the thing you're working on suddenly jumps sideways."
        ]
    },
    "Beware of Qazi's \"Masterclass\" and toxic FB Group!!": {
        "title": "Beware of Qazi's \"Masterclass\" and toxic FB Group!!",
        "score": 115,
        "url": "https://www.reddit.com/r/davinciresolve/comments/1dqo1cu/beware_of_qazis_masterclass_and_toxic_fb_group/",
        "content": "Waqas Qazi has already been widely panned by the industry, yet he continues to shamelessly lure gullible students into his fraudulent \"Freelance Colorist Masterclass\".\n\nFraudulent for two key reasons:\n\n1. The course itself (1000 bucks, often discounted to 500+) offers a comprehensive intro to the basics. And that's it. Beyond those basic processes, the snake-oil scam unfolds in the form of a flurry of \"secret sauces\" that represent anything but professional grading approaches. Most of them are extremely out-dated and out-of-context rip-offs from various other YouTube tutorials. His look-building structure and process is erratic, badly or not at all explained and riddled with problems. To top it up, Qazi clearly does not even understand storytelling and the creative side of color-grading.\n2. His so-called Facebook \"FCM Competition\" is not really a competition, but a scheme for Qazi - and his new partner and moderator Marieta Farfarova (a small-time Insta/YouTube colorist) - to learn from his students. Imagine that. Paying students are eager to make it in the industry, they are avid learners who constantly acquire new knowledge, tricks and hacks from other reputable YouTube tutorials, to then naturally apply them to Qazi's weekly competition projects. He requires participants to share what they do in every single node, with screenshots, etc. but then doesn't review them in the required constructive ways. Instead, Qazi simply uses them to pick up new tricks/approaches and then instantly creates his next \"secret sauce!\" video, posts it on his own social media sales channels and as marketing and sales support for his \"masterclass\". Giving credit to anyone? Sharing revenue? You know the answer...\n\nWhat a beautifully fraudulent business model, one that is decidedly useless to anyone serious about upping their color grading skills.\n\nSpend your money on courses by real professionals and mentors, for instance Dado Valentic, Darren Mostyn, Cullen Kelly, Daria Fissoun, Walter Volpatto...or spend 90 bucks on a range of short courses on Lowepost.\n\nJust stay away from those scammers Waqas Qazi and his partner Marieta Farfarova.",
        "num_comments": 48,
        "comments": [
            "the day i discovered kelly and darren i stopped and unsubbed qazi forever",
            "Damn he must be bad when a bot tells you he sucks lol",
            "I'm not a colorist at all but I watched a single one of this dudes videos when I was first learning resolve and he's just not good at teaching to begin with.",
            "what about Juan melara? I love his stuff but is he legit?",
            "Be careful, he likes to shit on people who criticize him on reddit lmao",
            "Never bought his course since I figured few things, we can color all day long, but I rather use 2383 and shoot for it with minor balance adjustments and I wont need to match shots a lot. \n\nHis videos give you - recreation vibe, while in professional world we dont recreate, we reuse. And since 2383 is in the resolve, I just copied it into the camera and it is just fantastic!",
            "Ok. So who's worth watching?",
            "WHERE DID YOU GET ALL THAT NEWS?! WE DON'T WATCH HIS SHII WE DONT CARE AND DON'T DARE TO KNOW ANY OF HIS SHII.",
            "Thank you for cautioning against Waqas Qazi.",
            "make sure to let others know, so people don't waste their time and money on qazi and farfarova"
        ]
    },
    "You can impress her without the need of 500 drones (mrwhosetheboss)": {
        "title": "You can impress her without the need of 500 drones (mrwhosetheboss)",
        "score": 4,
        "url": "https://v.redd.it/fna75kzaah9d1",
        "content": "",
        "num_comments": 2,
        "comments": [
            "r/lostredittors",
            "Thank you for posting your work for feedback! We encourage you to share a screenshot of your timeline and/or node graph in the comments.\n\nIf you're asked to share your nodes, please use [Pastebin](https://pastebin.com/) or format the nodes as a code block. Other websites may get caught by Reddit spam filters and cannot be approved.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/davinciresolve) if you have any questions or concerns.*"
        ]
    },
    "is there any way I can make both audio and video timeline same like in pr?": {
        "title": "is there any way I can make both audio and video timeline same like in pr?",
        "score": 1,
        "url": "https://v.redd.it/msz7c0dcli9d1",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Looks like you're asking for help! Please check to make sure you've included the following information. Edit your post (or leave a top-level comment) if you haven't included this information.\n\n* System specs - [macOS](https://imgur.com/a/ip6xc9G) [Windows - Speccy](https://www.ccleaner.com/speccy)\n* Resolve version number and Free/Studio - [DaVinci Resolve>About DaVinci Resolve...](https://imgur.com/a/5FawFCX)\n* Footage specs - [MediaInfo](https://mediaarea.net/MediaInfo) - please include the \"Text\" view of the file.\n* *Full* Resolve UI Screenshot - if applicable. Make sure any relevant settings are included in the screenshot. Please do ***not*** crop the screenshot!\n\nOnce your question has been answered, change the flair to \"Solved\" so other people can reference the thread if they've got similar issues.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/davinciresolve) if you have any questions or concerns.*"
        ]
    }
}