{
    "Server and Group Megathread - Week Starting June 29, 2024": {
        "title": "Server and Group Megathread - Week Starting June 29, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/dayz/comments/1dr2iz2/server_and_group_megathread_week_starting_june_29/",
        "content": "https://preview.redd.it/8v9nht7bebh81.jpg?width=1920&format=pjpg&auto=webp&s=0fcc9bd4c55f27bbba7ab3776e9d9535617db49c\n\n# Looking to Advertise a Server/Group? Post Here!\n\n* If you are **ADVERTISING a DayZ SERVER** don't forget to provide crucial info like Country, Platform, IP, Mods, Name, Description, Playstyle and Rules.\n* If you are **ADVERTISING a DayZ GROUP/CLAN/FACTION** don't forget to provide crucial info like Country, Timezone, Platform, Name, Age Range, Description, Playstyle and Rules.\n\n**Pro Tips:**\n\n* Create a FREE [**Discord**](https://discord.com/) server for your community!  \n* Use a URL shortener for your Discord since nobody can remember those official discord links. \n* Make your title or first line very descriptive like **\\[SERVER/GROUP\\]|\\[COUNTRY\\]|\\[PLATFORM\\]|\\[NAME\\]|\\[DISCORD\\]**.\n* Go back and look at the formatting of your post to make sure it's readable.\n\n[**Collection of previous Group/Server Megathreads**](https://www.reddit.com/r/dayz/collection/37ba27af-974f-4722-a272-ec2493bf58e3)",
        "num_comments": 5,
        "comments": [
            "Looking for one other to roll with on PS5.\n\nI play 3rd or 1st person high pop official servers.\n\n18+\n\nI don't care if you're new or not. I have over 1,500 hours personally. Not really looking to build a base right now.",
            "\nThe Pack DayZ\nXBOX\n\nhttps://thepack-dayz.com/\n\n[https://discord.com/invite/thepackdayz](https://discord.com/invite/thepackdayz)",
            "**Welcome to Red Winter RP: DayZ**\n\n**Sunset Island: Where Paradise Turns to Peril**\n\n\n\nAwaken in one of the resort spawn points and venture into the captivating landscape of Lux, a vacation island now transformed into an apocalyptic nightmare. Form alliances with fellow survivors, unite to conquer the island's formidable challenges, or carve your own path through the dense jungle. Every decision on Sunset Isle holds the power to determine life or death.\n\n\n\n**Key Features of Our Server Include:**\n\n- **RaG Basebuilding:** Construct your sanctuary from the ground up.\n\n- **RaG Cabins:** Find refuge in ready-made shelters.\n\n- **RedFalcon Watercraft:** Navigate the waters with ease.\n\n- **RedFalcon Helicopters:** Take to the skies for a bird's eye view.\n\n- **CanAM Side by Sides:** Traverse the island with powerful off-road vehicles.\n\n- **Wildlife:** Encounter spiders, tigers, and alligators in their natural habitats.\n\n- **Diverse Zombie Variants:** Face a multitude of undead threats.\n\n- **Extensive Vehicle Options:** Choose from a wide array of transportation.\n\n- **NPC Traders:** Engage in dynamic player commerce.\n\n- **Weather Challenges:** Survive thunderstorms and other harsh conditions.\n\n- **Cannabis Cultivation:** Engage in illicit activities for profit.\n\n- **CJ Loot Chests:** Discover hidden treasures.\n\n- **Gebs Fish:** Enjoy a variety of catches.\n\n**And much more!**\n\n\n\n**Experience the Depth of Gameplay:**\n\n- **Explore Deadly Caves:** Dark passages filled with unknown dangers and secrets.\n\n- **Fishing & Hunting:** Enjoy moments of calm before the storm, if you dare.\n\n- **Find Rare Treasure:** Hidden amongst ancient temple ruins, waiting to be discovered.\n\n- Adapt to roles like a cunning jungle bandit or a resourceful drug lord.\n\nYour narrative unfolds uniquely in your hands.\n\n\n\nAnd that's just the beginning! Red Winter introduces an array of custom features designed to enrich your gaming experience. From weapons, attire, and vehicles to innovative base-building mechanics, our enhanced map edits give endless opportunities for exploration and discovery.\n\n\n\n**Join our Community of Survivors:**\n\n**Discord:**  [https://discord.gg/frGVsH7ap4](https://discord.gg/frGVsH7ap4)\n\nEnter if you dare. The island is waiting... but so is the terror.\n\n\n\nVideo showing some of the trader areas and some of the custom locations around the map to explore.  \n[https://youtu.be/kIoVNBhIBA4?si=lHPCgUcSdKsMrhiG](https://youtu.be/kIoVNBhIBA4?si=lHPCgUcSdKsMrhiG)",
            "# XDC DayZ | Vanilla Balance | Better bases | Helis | Winter\n\n**DEDICATED SERVER FOR PC**\n\nIP: [193.25.252.52](http://193.25.252.52) port 2302\n\n**Who are we?**\n\nXDC is a group of gamers who have been hosting various game servers over the years since we were founded in 1999.  In that time we have always been able to offer mature, experienced, and trusted admins, as well as a laid back community where everyone is welcome.\n\nCome and help build a new DayZ community! [https://discord.gg/fwMb7jZjyq](https://discord.gg/fwMb7jZjyq)\n\n**Overall goal**\n\nOur setup is guided by two main principles; we want an improved vanilla experience, and where possible we want to restore features from the original DayZ mod, which the standalone devs haven't gotten around to yet.  This means that we only add mods which enhance areas which we feel are weak in the vanilla game.  This includes improved base building and raid mechanics, a better variety of military items, and the addition of Helicopters. At the same time we are keeping the overall server economy as close to true Vanilla as we can, with all modded items added with vanilla balance in mind.\n\nAbove all though we are aiming to provide a DayZ experience which is as unrestricted as possible.  This is a sandbox game and we aim to protect that as best we can. To that end we are not imposing any unnecessary limits to bases or how you play, you can build any way you want to and as big a base as you want; and our setup is designed so that pretty much anything goes when it comes to pvp.\n\n**Mod highlights**\n\n* Base building plus, alongside vanilla base building, with territories to prevent enemies dismantling your base unless they can reach your flag.\n* New upkeep and decay system using an ingame currency to pay for maintenance of your base.  This makes it expensive to hoard all the best vehicles and helps prevent large bases becoming unraidable.\n* Expanded economy around the upkeep system, with some modded items such as ores that you can mine and refine, along with special items that can be sold for the currency required to keep your base going.  This adds new meta items for teams to seek out, while also promoting movement to more dangerous parts of the map where it is easier to find the most valuable items.  \n* C4 for raiding but balanced so that expensive buildings need more explosives to destroy.  Any buildable structure can be destroyed, but entrances are weaker than walls etc to promote better looking bases and allow players more options when designing their base.\n* Helicopters - These are available for the same currency used for upkeep, so while anyone can potentially get hold of one, you will have to choose between a helicopter or paying for your base upkeep.\n* Missions from the survivor mission mod. Compete with other players for rewards that tie in with events and the new upkeep system!\n* Hunt for hidden treasure with the treasure mod!  Metal detector required!\n* Windstride's clothing, Cl0ud's gear, Tactical Flava, and the equipment system mod for better looking civilian and military clothing, while we have balanced all modded armour based on vanilla values, so nothing is overpowered.\n* The best looking and sounding weapons pack we could find.\n* Custom fortress area at Tisy.\n\n**Events**\n\n* Regular events, with prizes.\n\n**Seasons**\n\n* Season change every 3 weeks - Play autumn/fall, winter, spring, and summer maps.\n* Current season is Winter.\n\n**Other settings**\n\n* 7 hours for daytime and 2 hours for night.\n* Long wipe cycle, lasting at least 12 weeks.",
            "**EU NationZ | Vanilla+ | Active Admins | Discord | PC | ChernarusPlus | Beginner Friendly**\n\n**Hello survivor. NationZ** is a fresh, friendly, dedicated DayZ community running a Vanilla+ server.\n\n**Our core values**focus on a strong sense of community; a fair game for everyone; and creating an amazing game experience.\n\n**Our community** has Vanilla DayZ at its core, with a few mods to improve the overall game experience for everyone, and add a little bit of spice *InsertSaltBaeGif*.\n\n**We bring to you** an amazing game experience; a supportive community who is always there for you; and a fair shot to everyone in this apocalypse, from fresh to experienced players.\n\n**We provide**a balanced PVP and PVE experience where the style you play is your choice. While we do not have exclusive PVP and PVE zones, we do encourage people to be friendly or not! Join the greater community or play solo, the choice is yours!\n\n**NationZ**is the perfect place to set up camp, build a base, start a faction, buy some land, hunt, explore, survive, dominate, get some custom flags as well because why not!, and so much more!\n\nWe have a dedicated and professional moderation team who is always there for you, and host regular, awesome events for everyone to join!\n\n**Additional Info:**\n\n**IP:** 176.9.116.6\n\n**Port:**2322\n\n**Discord:**[https://discord.gg/hPPMZ9yazR](https://discord.gg/hPPMZ9yazR)\n\n**Mods:** TraderPlus; BaseBuildingPlus; CodeLock; Global Chat; Party/Group; Radio; Helicopters; Boats; Underground Bases; Car Keys; VanillaPlusPlusMap; Combinable Items; *+ other mild aesthetic mods such as custom flags, tactical equipment, and some clothing*\n\nhttps://preview.redd.it/k42dah91ph9d1.png?width=2560&format=pjpg&auto=webp&s=bfe461d9da2454bcc11867b914c8c54e88470b54"
        ]
    },
    "DayZ Frostline Dev Blog Week 24": {
        "title": "DayZ Frostline Dev Blog Week 24",
        "score": 32,
        "url": "https://www.reddit.com/r/dayz/comments/1dfy3qz/dayz_frostline_dev_blog_week_24/",
        "content": "(Source: [https://forums.dayz.com/topic/260001-dayz-frostline-dev-blog-week-24/](https://forums.dayz.com/topic/260001-dayz-frostline-dev-blog-week-24/)  \nVideos are just images, click links to view them)\n\n⚠️**Disclaimer**⚠️  \nPlease be aware: Information shared in our development blog represents a work in progress, not the final product. Contents and features discussed are subject to change before release. We aim to provide insight and foster community engagement, but details may evolve as development continues. Thank you for joining us on this journey, with the understanding that what you see here is a glimpse into the process.\n\n**Introduction**\n\nWelcome to another installment of the Dev Blog, where we're providing you with an exclusive behind-the-scenes look at the DayZ Frostline Expansion. Our goal is to be more transparent by showcasing our creative process, challenges, and achievements. We want to dedicate these to the DayZ community, who have shown deep commitment and interest in the inner workings of DayZ's development.\n\nThis time around, we are peeking into Skybox and Weather changes.   \nFor next blog, we will get to look at some of the \"Points of interests\".\n\n(Watch on yt: [https://www.youtube.com/watch?v=vVtMjoGFrG8](https://www.youtube.com/watch?v=vVtMjoGFrG8) )\n\nhttps://preview.redd.it/ty5n77wk2l6d1.jpg?width=450&format=pjpg&auto=webp&s=5bae6d3ca2387ddc98a1cc97f13cb00116d6d5f8\n\n# Sneak Pe﻿ek\n\n**Skybox**\n\n*\"Building on our legacy with Chernarus and Livonia, our goal was to craft a unique skybox texture to enrich Sakhals atmosphere distinctively. For this endeavor, a blend of Cirrus and Alto/Cirrocumulus clouds emerged as the perfect match.*\n\n*Our vision was clea﻿r, shaped by extensive exploration of the Kamchatkan region through Google Street View, complemented by our own collection of winter sky photographs taken right from our office. This process enabled us to envision the ideal backdrop that truly represents the cold and world we aim to imme﻿rse our players in.\"*\n\n-- Florian (DOJ), Environmental Designer\n\nhttps://preview.redd.it/ahudi4e80l6d1.png?width=960&format=png&auto=webp&s=85d3386efd6b5bb54fa7b8803f912300884ff1ca\n\nhttps://preview.redd.it/h1vj4x732l6d1.jpg?width=1272&format=pjpg&auto=webp&s=ea21d91ff6690085c03b4021a3c66c15265d9e26\n\n**Wind & Predicting the weather**\n\n*\"We now have more control over weather elements, especially wind, allowing us to create dynamic weather patterns and unexpected shifts. ﻿While these patterns won't occur in a predetermined manner, we are providing more hints (for example, the direction of the snow particles) to help predict these weather changes. This increased predictability should encourage you to better prepare for the harsh snowstorms of Sakhal or the thunderstorms of Livonia.*  \n*The goal is not only to make your gameplay more immersive but also to give a strategic advantage to those who can anticipate challenges from the terrains, observe their surroundings, and respond accordingly.\"*\n\n-- Özgür Nergis, Game Designe﻿r\n\nWatch video: [https://www.youtube.com/watch?v=dkMXprfMAvk](https://www.youtube.com/watch?v=dkMXprfMAvk)\n\nhttps://preview.redd.it/s5ihi8cf0l6d1.jpg?width=450&format=pjpg&auto=webp&s=f9cd46a5da9365064a3d374a3599c9c2ff7f5874\n\n**Fog & View Distance** \n\nExpanding more on the customization of weather elements, we are also enhancing fog functionality to have more control. Currently, fog is driven by overcast and distance fog values defined by the config, which is quite limiting. With the release of Frostline, both the dev team and modders will have full dynamic control over the fog through a new script API. Check out the demonstration video below to see new fog in action. \n\n(Watch at: [https://www.youtube.com/watch?v=3v2vak5mddo](https://www.youtube.com/watch?v=3v2vak5mddo) )\n\nhttps://preview.redd.it/xpcsu3an0l6d1.jpg?width=450&format=pjpg&auto=webp&s=4a57f4671fc85b6b667fbaa18ce8d17cf3653e87\n\nThe fog will now affect the visibility of the sky, which presents more possibilities for those of us who enjoy a good gloomy \"Silent Hill\" vibe.\n\nhttps://i.redd.it/ilaid4gr0l6d1.gif\n\nFor PC we are increasing view distance. This upgrade substantially expands the ranges and you will retain full control within settings. Due to current performance and testing limitations, we are not able to extend these improvements to console platforms at this time but will consider other platforms in the future.\n\n*\"In our quest to improve view distances, the team didn’t just agree—they firmly belie﻿ved it was a change whose time had come. With Sakhal, we seized the opportunity to implement this enhancement. We’re excited for you to experience this across all maps, and we anticipate it will benefit the modding community.\"*\n\n-- Aleš Stupka, Programme﻿r\n\n(Video at: [https://www.youtube.com/watch?v=kRTrQMdJli0](https://www.youtube.com/watch?v=kRTrQMdJli0) )\n\nhttps://preview.redd.it/9b9gdqsz0l6d1.jpg?width=450&format=pjpg&auto=webp&s=0ac42ce0aeed1e968d920775bf5263ffc741ca60",
        "num_comments": 11,
        "comments": [
            "Finally, the fog covering the sky as well.",
            "These are some of the core tech features a lot of us have been hoping for a long time and Im here for it! This expansion is looking promising. \n\nWhile 1.25 has caused some strife, I think in time were in for a great experience.",
            "view distance change is big for me, feels so short and its very jarring compared to arma 3 where I have it on max all the time.",
            "Look at that.\n\nNever a game 10 years old looked so good",
            "I wish they would do these permanently (not just for Frostline), because in addition to creating a better connection between the community and developers, it gives everyone an inside look into the thought process, design decisions, etc. Likewise, on top of them doing a complete revamp of their horrible website, it would be nice to see them do some sort of fan engagement in a monthly or bi-monthly Q&A on here with an AMA (or on the other platforms).",
            "looks cool snow is a fun map",
            "Yeah all the info that there coming out has me abit giddy, its not just new items and stuff but more meta background stuff that has the chance to impact the game in new and huge ways. Exciting times. \n\nJust a shame they dropped a controversial patch and said there wont be another for nearly a year lol.",
            "Just getting back into the game. Can someone give me a tldr of everyone's gripes with the new update? I notice zombies have directional microphones to find you from 2 blocks away now, besides that",
            "Cries in console :/",
            "Yeah it's great, but also annoying that they didn't do it earlier. The game has supported at least 10km view distances for about 6 years, but BI simply hasn't bothered to put it back in the video options before. Well it is in the options, but hidden in the overall quality presets setting and limited to something like 3km currently."
        ]
    },
    "Sad news from the legend": {
        "title": "Sad news from the legend",
        "score": 1110,
        "url": "https://i.redd.it/x6w6rj11ld9d1.jpeg",
        "content": "",
        "num_comments": 35,
        "comments": [
            "He makes the most in depth and valuable content for players learning about the game. He should take all the time he needs",
            "Always enjoy his posts. I hope his mom wakes up to a beautiful day on the coast.",
            "Oh wow. Reading that genuinely hurt. Hes the #1 DAYZ guy I watch when it comes to how the game works and update info. His videos are amazing. Really sad for him.",
            "Fuck cancer. I've lost three relatives to it in the last five years and my aunt is currently dying from a brain tumor. Just fuck cancer.",
            "Ight. Someone call Bohemia and get a fucking memorial put in the game for her. If you read this, sorry Wobo. We love you dude.",
            "I remember watching TRMZ charity stream for Wobos mom a couple of years ago and donating a couple of bucks back then. Very sad news and fuck cancer",
            "Back to urban legends and hearsay about how the game works for awhile.",
            "WOBO is the definitive source for DayZ knowledge. My condolences to him and his family.",
            "Fuck. I'm sorry to hear that. Lost my uncle to that crap some weeks ago. Cancer is a shit disease.",
            "May God give enough strength to the bereaved family to bear this irreparable loss."
        ]
    },
    "After a long day of work you come back home and want to play DayZ, and this is what you see:": {
        "title": "After a long day of work you come back home and want to play DayZ, and this is what you see:",
        "score": 214,
        "url": "https://i.redd.it/pt6nvdd2le9d1.jpeg",
        "content": "Nowhere to go. Fart gas, as far as the eye can see.",
        "num_comments": 49,
        "comments": [
            "I always keep a blood bag, cause this is a horrible way to return to the coast.",
            "In that situation, because I play PVE primarily, I like to snipe anything slow moving that's in the distance.",
            "Shouldnt it spawn you outside the gas?",
            "You logging out in ATC is a bigger problem",
            "At least you are not in the first floor",
            "Do people normally log out in buildings? I tend to venture far into the woods and find a nice bush or tree cluster",
            "Wait a damn second are you that sniper that keeps shooting me and like everyone else I saw that earlier and knew whoever that cannibal sniper was cant move for awhile",
            "You know it would be cool needing only a gas mask for infection zones but gas masks spawning only in tier 4 zones or sum like that",
            "\"as far as the eye can see\"   \nbro the edge of the gas zone is clearly visible",
            "Why not take the 4 minutes to not log out in a gas zone?"
        ]
    },
    "got 20 friends together to play official and we found an \"open base\" that was actually lined with land mines lol": {
        "title": "got 20 friends together to play official and we found an \"open base\" that was actually lined with land mines lol",
        "score": 166,
        "url": "https://v.redd.it/c1fajfyk4e9d1",
        "content": "",
        "num_comments": 15,
        "comments": [
            "OK, how do 1) have 20 friends, and 2) have 20 friends WHO PLAY DAYZ???",
            "Getting 20 friends to play together is crazy...i wish i have enough friends that own dayz to do the same",
            "If I saw a group of 20 running at me I think I would just lay down and cry ",
            "Im usually somewhat loud and i ask people to play sometimes",
            "(20 Twitch / YouTube \"friends\")",
            "I cant even get my irl brother to play",
            "What's crazy is me seeing 20 people cooperating on official.",
            "was either NY or LA official i dont remember",
            "lol same. To be fair dayz is a hard sell for a lot of people",
            "On Xbox I used to run with a crew of 15 and armbands were absolutely needed lol"
        ]
    }
}