{
    "With the recent confirmation that dodge is additive, LR TEQ UI's team can be damn near untouchable past turn 5": {
        "title": "With the recent confirmation that dodge is additive, LR TEQ UI's team can be damn near untouchable past turn 5",
        "score": 402,
        "url": "https://i.redd.it/o61btt1zoe9d1.png",
        "content": "",
        "num_comments": 66,
        "comments": [
            "Really makes me wonder why people were pushing that they were separate procs for so long and were so adamant about it too. Like we couldn't have datamined to make sure sooner? It makes me think this was a recent change or something",
            "No joke str dyspo is busted, as long as you get an Additional sa he is at 72% dodge and over 950k def That's pretty insane and his Damage Can get ridiculous fast just saw a Showcase from dw and dyspo breaks 10m fast While having high crit Chance ,with ui 1st domain Turn he can reach 100% dodge",
            "Still refuse to believe int gotenks can get 90% dodge as Ive seen him get hit multiple times even with the additional dodge proc",
            "teq caulifla victims are eternal",
            "I promise u I have had ago kefla dodge more than any other character in this game lol more than any of the ui units",
            "Damn phy zamasu has 50% to die now",
            "That's a game changer and a half...",
            "Where did u see this?",
            "I swear I thought this was already known, That if a unit gets more dodge from their own passive it's just added to their existing dodge.\n\nLike when Hirudegarn came out people were flipping their shit over a 70% chance to dodge then 100% after 3, Or even the God Duo who get more dodge in their passive that's just added onto their existing chance.",
            "*all* dodge isnt additive though? (E.g. hipo). I feel like a lot of people are thinking everything is...?"
        ]
    },
    "POV: You're using TEQ LR UI with the INT LR Gammas (each counter attack charges the standby)": {
        "title": "POV: You're using TEQ LR UI with the INT LR Gammas (each counter attack charges the standby)",
        "score": 1108,
        "url": "https://i.redd.it/ce8tgq4ioc9d1.png",
        "content": "",
        "num_comments": 35,
        "comments": [
            "I fucking love this meme format",
            "You're right, I forgot it counts just like SOH Trunks Standby.\n\nThis is crazy lol. I'm not going to pull on Gammas banner, but I'll have the coins ready for them when they return on a banner.",
            "New mui is soo funny man ",
            "Love this. Do you know where I can find the original template? I have no clue what its called",
            "The ghost of Gamma 2 lmao",
            "best meme format. Could anyone share more?",
            "You just gave a idea",
            "The new ui goku got the same stance as the Teq sr uub if anyone noticed",
            "Put this to the test while doing the new supreme stages. 15 stacks did less damage than a single MUI crit counter. Gammas are not cooking with numbers.",
            "It is a shame the boss is probably dead by the time they hit."
        ]
    },
    "Is majin power the best team on global rn? Effortlessly clears everything ": {
        "title": "Is majin power the best team on global rn? Effortlessly clears everything ",
        "score": 69,
        "url": "https://i.redd.it/0guovicfug9d1.jpeg",
        "content": "",
        "num_comments": 26,
        "comments": [
            "And this is with mostly recent EZAs and older units. With the INT Fat Buu it's negative difficulty.",
            "Majin Buu Saga is the stronger category overall",
            "Definitely. I can beat every stage on global right now with this team. Majin power and buu saga on top right now.",
            "Is the teq mr fat buu that good? Got him two times",
            "Majin Power or Super Saiyans, I cleared everything with ease thanks to Super Saiyans",
            "Same here, first time using Mr Buu as well",
            "Goated category and you always love the shenanigans",
            "I wish I had int buu and evil buu so I could kick LR agl buu and str super Buu off my team",
            "The movies red zone 2 is pre 9th Anni content just saying",
            "Yes. It does a little bit less damage than buu saga but the regen is insane."
        ]
    },
    "Apparently the dodge build up by some units (INT Hirudegarn, EZA AGL MUI, Yamcha, etc.) is added to their base dodge chance and not a separate proc": {
        "title": "Apparently the dodge build up by some units (INT Hirudegarn, EZA AGL MUI, Yamcha, etc.) is added to their base dodge chance and not a separate proc",
        "score": 283,
        "url": "https://x.com/proton10mg/status/1806814942613344721?s=46",
        "content": "",
        "num_comments": 63,
        "comments": [
            "This is massive and it makes me like SEZA TEQ Gotenks a lot more. Going for his 12 Ki is so much more valid with this knowledge",
            "If True this makes agl ui equal to ssbe instead of being blatantly worst Like Before",
            "So does that mean that after 3 dodges, AGL UI has a 98% chance to dodge (77 + 21)?",
            "Is the new teq ui one of them, cuz that means he has 97% chance to dodge when hp is under 50%.",
            "This is what I thought all along lol, who even pushed the separate proc bullshit to begin with",
            "Is this new or always been?",
            "I swore hirus whole gimmick was he had 100% dodge for the turn after he gets off 3 dodges. Did the community think otherwise?",
            "Is this a change or a new discovery to the mechanic??",
            "So does that mean Teq UI gives 10% to the base dodge as well?",
            "Would this make teq gotenks more comparable ti phy KB as a seza? Sounds pretty big for him and his ki consistency, would-be issues"
        ]
    },
    "Hitting the translate button on Japanese players tweets is hilarious a lot of the time": {
        "title": "Hitting the translate button on Japanese players tweets is hilarious a lot of the time",
        "score": 101,
        "url": "https://i.redd.it/igit11vcif9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Japanese google translate is like weirldy poetic",
            "So thats where my luck went. 1500 stones deep and not a single copy while this dude got 5 in 4 multi :)",
            " originally means \"taste astringency\" but in slang it means something like extraordinary. He used it because the username says \"pulled 5 copies with 4 multis\"",
            "Yep, it's a small Tsu",
            "Holy shit how are you getting mass-downvoted **for stating an obvious factual truth**\n\nthis fucking generation",
            "Egui Tsute: Awful/Amazing Pull?\n\n\nI kinda just searched google for it.",
            "Egui Tsute> Egui Tte",
            "Egui**tt**e*"
        ]
    }
}