{
    "First Image of David Corenswet as Superman in James Gunn's 'Superman'": {
        "title": "First Image of David Corenswet as Superman in James Gunn's 'Superman'",
        "score": 27027,
        "url": "https://i.redd.it/ws6ivf89xtyc1.jpeg",
        "content": "",
        "num_comments": 3114,
        "comments": [
            "James Gunn on Instagram: [https://www.instagram.com/p/C6ogjVERTl8/](https://www.instagram.com/p/C6ogjVERTl8/)\n\n>\"Get ready. #Superman 7.11.25\"  \n\"The above photo was taken by @.jessmigliophoto, our intrepid still photographer, and is entirely in-camera.\"\n\nJames Gunn on Threads: [https://www.threads.net/@jamesgunn/post/C6ogg\\_ux1r8](https://www.threads.net/@jamesgunn/post/C6ogg_ux1r8)\n\n>\"Get ready. Superman 7.11.25 @.dcofficial\"  \n\"The above photo was taken on set by Jess Miglio and was entirely in-camera.\"\n\nDC on Twitter: [https://twitter.com/DCOfficial/status/1787516112935989307](https://twitter.com/DCOfficial/status/1787516112935989307)\n\n>\"Get ready. #Superman 7.11.25\"",
            "An apartment in the city, with windows like that...on a newspaper reporter's salary? I'm not buying it!",
            "How long til the first \"10 DETAILS YOU MISSED IN SUPERMAN'S FIRST IMAGE!!\" video?",
            "Hair curl! The suit looks great, but is a bit… boxier than I would have thought.",
            "Only thing I’m not sure about is the fabric - looks really thick. Like a tire.",
            "He looks...tired.. Can't wait for this y'all",
            "Gunn says the photo wasn't Photoshopped, it was all captured in-camera: [https://www.threads.net/@jamesgunn/post/C6oghkKxOrR](https://www.threads.net/@jamesgunn/post/C6oghkKxOrR)\n\nThey must be using \"The Volume\" (giant LED TV wall instead of a green screen) for the background.",
            "You'd think Superman would feel a bit of urgency!",
            "That giant beam in the background is giving me Brainiac vibes. But he looks just fantastic, I love the design on the boots, the shade of blue and the colors selected. The S-sheild just looks incredible on him.\n\nEdit: Typos",
            "TRUNKS!!!!"
        ]
    },
    "EXCLUSIVE: Pic of James Gunn explaining the continuity of the new DCU to new viewers.": {
        "title": "EXCLUSIVE: Pic of James Gunn explaining the continuity of the new DCU to new viewers.",
        "score": 580,
        "url": "https://i.redd.it/06hs9jpplc9d1.jpeg",
        "content": "Recently James Gunn said Creature Commandos will pick up where The Suicide Squad left off and Peace Maker season 2 picks up where Peace Maker 1 left off. On top of that we are getting a Blue Beetle sequel in animated form so I don't know where new viewers will want to fall in. ",
        "num_comments": 173,
        "comments": [
            "The Suicide Squad, Peacemaker s1, and Blue Beetle happened in the DCU timeline, but those films/show themselves aren’t canon because they take place in the DCEU. You can watch them for more context, but CC-onwards is the only media that counts and will be the only media referenced by everything else. When people meet Waller, they’ll talk about CC before anything else. Peacemaker s2 is a separate story from s1. The Blue Beetle animated series will be the adventure other heroes know about when they meet Blue Beetle.",
            "James Gunn: \"It starts with Superman. We'll explain how characters who came before fit in once the new shows and movies come out.\"\n\nFans: \"Comic books have never been so confusing.\"",
            "Either reading literacy is dead, or you guys are just jumping on the latest talking point to criticize the new universe. It's funny to see \"comic\" fans, who can tell you the difference between hundreds of variants and worlds over 70+ years of stories, can't see how this new set of films can soft reboot.",
            "for me its explaining how batman is seasoned and has a child while superman is young and just started",
            "This is why a) announcing the reboot when they still had DCEU movies in the pipeline was a huge mistake, and b) they should've shifted Flash again and ever so slightly tweaked the ending so that would've been the universe reboot movie and it actually had an in story reason for it. It would still be confusing for some audiences, but I think with the MCU and Spider verse movies audience now get the concept of it being another universe, but some plot points and actors carry on now.",
            "He's been very clear that it's a reboot. New viewers can start with the new content.",
            "I think we nerds tend to overestimate how much your average non-nerd cares about continuity. The explanation will amount to \"And Harley Quinn is here too!\" and that'll be enough. Honestly, I like a bit of canon-collage myself, but that'll be enough for me too. Gimme a half-decent DC film and I'll swallow however much canon contortion I need to if that's what it takes to make it happen.",
            "Na, OCD (and impatient) comic fans are the ones making that chart \n\nGunn knows the answers, sure, and most people don’t even know what the questions are",
            "[removed]",
            "Dawg that's just anyone explaining any DC continuity lol"
        ]
    },
    "Clark Kent (David Corenswet) making his way through a crowded street": {
        "title": "Clark Kent (David Corenswet) making his way through a crowded street",
        "score": 951,
        "url": "https://v.redd.it/cjpt9n1i9b9d1",
        "content": "",
        "num_comments": 83,
        "comments": [
            "It is surreal seeing everyone in the city frozen before suddenly springing into motion.",
            "That’s crazy, the movie making process is so cool",
            "That lady behind him making damn sure she’s seen in the background of the shot.\n\nGotta respect it tho I’d do the same lol",
            "The insane muscle control Superman has to have to not break everyone’s shoulders when they accidentally bump into him in the street.",
            "Look at that dufus",
            "*getting late to work music*",
            "Chris Reeves feeling. Though it felt like I was watching Brandon Routh.",
            "Love this so much. What the Snyder Superman lacked was more of Clark. That's where Superman's real character is.",
            "Is this the movie matrix everyone been talking about?",
            "David Crowdedstreet"
        ]
    },
    "More Metropolis set details, including Big Belly Burger reveal": {
        "title": "More Metropolis set details, including Big Belly Burger reveal",
        "score": 429,
        "url": "https://www.reddit.com/gallery/1dqo6ea",
        "content": "",
        "num_comments": 31,
        "comments": [
            "I like how they’ve apparently gone to a lot of effort to make Metropolis feel like a unique city, down to a consistent visual design for stuff like the street signs and city billboards, and it isn’t just Manhattan. Everything looks retro-modern. I’m assuming they’ll add some CGI skyscrapers to hide that it’s Cleveland in the final cut.",
            "I think they may have confused loitering for littering on the sign",
            "I hope we get an art book. The prop dept went all out",
            "As a native Clevelander, I had no idea how much they were shooting in Cleveland. Excited to see this on the big screen!",
            "So is Big Belly Burger the Jameson of DC? It exists in every universe in the multiverse?",
            "Ok the big belly burger logo is based on someone, has to be \n, John Byrne?",
            "That dude Economos is really doing well in life; he even started a burger franchise.",
            "If I ever need a lawyer I'll be headed to Witcher, Stonebreaker & Payne",
            "No radios\n\nThis has me thinking that there will be no smartphones in this retrofuturist version of Metropolis.",
            "Okay I hope we get a Bat Burger in the DCU too"
        ]
    },
    "David Corenswet’s Clark Kent making it through the crowd on the set of ‘SUPERMAN’ [📸 Mike Falkenstein]": {
        "title": "David Corenswet’s Clark Kent making it through the crowd on the set of ‘SUPERMAN’ [📸 Mike Falkenstein]",
        "score": 243,
        "url": "https://i.redd.it/qm6shvgqdc9d1.jpeg",
        "content": "",
        "num_comments": 33,
        "comments": [
            "I love how everyone’s in almost 70s clothing.. I hope Metropolis and Gotham exist in ambiguous time periods. People have smart phones - but gangsters still have Tommy guns type of thing.",
            "That lady mad as hell.\n\n\nAlso, I thought he was trying to interview her at first glance...",
            "Yup that´s his actual hair",
            "I thought this was set in present day. That’s some 70s-80s color they’re al wearing",
            "Dayum. That woman really hates him, probably more than Luthor himself.",
            "looks like this movie is set in the 80s",
            "Oh I’m loving this color scheme!!!",
            "He’s just makin’ his way downtown",
            "Yes!!! Clark actually has a \"personality\" and doesn't rely 100% on the glasses to do all the work.",
            "Album Cover-Core"
        ]
    }
}