{
    "The Weekly Batusi Thread - June 24, 2024": {
        "title": "The Weekly Batusi Thread - June 24, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/dccomicscirclejerk/comments/1dnd1yo/the_weekly_batusi_thread_june_24_2024/",
        "content": "Come chill out, [hit the dance floor](https://www.youtube.com/watch?v=RsYA8Gr5NTY), and talk about whatever you want.\n\nWhat are you reading? How's your weekend? What do you want to vaguepost about?",
        "num_comments": 11,
        "comments": [
            "I know a lot of people don't like Tom Taylor's writing but his Spider-Man book is genuinely really good, read it if you haven't",
            "I've been rereading All-New All-different Avengers. I've forgotten how good it was. Another victim of Civil War 2.",
            "I know most of yall dont use tumblr, but I was trying to go through the Jonathan Kent tag on tumblr last night and there was so much Danny Phantom x DC crossover stuff I felt like I blocking every other post.\nAnyways, that reminded me of the lets see the ship numbers of the batfamily (and too much was Miraculous Ladybug crossovers) that happened a few months ago.",
            "I picked up a whole bunch of comics on Sunday, been really enjoying Superboy Secret Identity!",
            "Who wants to hear my epic pitch for an Impulse limited-series comic?\n\nEDIT: If I am not given permission to info dump, I will start listening to Kanye. This is not a threat, it's a promise.",
            "Was in a shit headspace and took my first trip to Ollies. Picked up some Moore Swamp Thing, Byrne Action Comics, Supergirl New 52. Bunch of crap for $20. Would recommend.",
            "Just read the new Zatanna book from today. So good. Javier Rodriguez art is impeccable as always and while its a out of continuity take of the character I took to the premise as quickly as they introduced it. I know Mariko Tamaki is a mixed bag but this was a fantastic start.",
            "Honestly that's the last book from him that i enjoyed. That MJ issue is still one of my all time faves.",
            "So good. I wish we got more of Kamala, Miles, Sam and Nadia as part of the Avengers mainline together."
        ]
    },
    "Reminder: Snyder subreddit screenshots are not allowed": {
        "title": "Reminder: Snyder subreddit screenshots are not allowed",
        "score": 73,
        "url": "https://www.reddit.com/r/dccomicscirclejerk/comments/1dofgch/reminder_snyder_subreddit_screenshots_are_not/",
        "content": "Recently, we've been seeing an influx in screenshots from Snyder subreddits. These screenshots are considered overdone topics, and they will be removed. Instead, consider posting screenshots from r/ScottSnyder, which is allowed. Thank you, and always remember: anti-life justifies my hate!",
        "num_comments": 8,
        "comments": [
            "Thank goodness. Its such a dead horse at this point.",
            "Petah..... The horse is here!",
            "On it boss \n\nhttps://preview.redd.it/p23g50gm3t8d1.jpeg?width=1179&format=pjpg&auto=webp&s=8551add746d2aa413daadeb261130b2e4e7cda3a",
            "What about Dana Snyder?\n\nhttps://preview.redd.it/cnkerhbi689d1.jpeg?width=2788&format=pjpg&auto=webp&s=96a228c717ffa0c434198c69f2e99183445d175e",
            "https://preview.redd.it/c7l67ku7ju8d1.png?width=2409&format=png&auto=webp&s=9f6554586d17202d126fe2b58790d9c58adc14bf\n\nWHAT DOES THE HORSE SYMBOLISM IN BVS MEAN?",
            "https://preview.redd.it/a79dbsyiju8d1.png?width=1021&format=png&auto=webp&s=b8a571bccc63e42fbf0805b28849b5f155a66979\n\nHELP ME SCOTT SNYDER!!",
            "Mods:\n\nhttps://preview.redd.it/4ibwaigyut8d1.jpeg?width=200&format=pjpg&auto=webp&s=0d3a56a4774b5f41b785a449040c09c96892c5dc",
            "thank you\n\nhttps://preview.redd.it/ezlx2ht4449d1.jpeg?width=917&format=pjpg&auto=webp&s=e80503ae7f41431cefbf7b2f06d3f9954c544530"
        ]
    },
    "Dear Japanese cowards: THIS is how you draw Amanda Waller. Sincerely, a REAL wallhead.": {
        "title": "Dear Japanese cowards: THIS is how you draw Amanda Waller. Sincerely, a REAL wallhead.",
        "score": 692,
        "url": "https://i.redd.it/2xd43vtwgf9d1.png",
        "content": "",
        "num_comments": 38,
        "comments": [
            "Everyones talking about Waller but no one is mentioning how fucked Lexs proportions also are\n\nHis head is detached from his shoulders and his ass is in the middle of his back",
            "Her nickname is The Wall, not WCILF (war criminal I'd like to fuck).",
            "Nah, anime waller needed to be skinny enough to bust it down in the outro",
            "She built like a wine cork",
            "Wow, Lex luthor just told suicide joe that he sure knows how to blow up a spot, respect for that disrespect.",
            "So thats why they call her the wall. I just thought it was because of her stubbornness (now I have a bounty on my head)",
            "what place is this one that amanda waller and lex luthor in this picture, the scenario looks like a chroma key of how smooth its the scenario, are they looking at a wall, or what place its this that amanda and lex are in?",
            "amanda waller looks so cute in this picture",
            "This is good but JLU was peak WALL in my opinion",
            "I am the egg man, I am the waller, Goo-Goo googoogjoob"
        ]
    },
    "Which characters do you think would have the biggest social media following? ": {
        "title": "Which characters do you think would have the biggest social media following? ",
        "score": 242,
        "url": "https://i.redd.it/bw986lpl4h9d1.jpeg",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Off topic but we were robbed with this",
            "Bruce Wayne would have a whole social media team dedicated to building the best image possible for their CEO\n\nLois Lane would have a huge Twitter following, even though she rarely tweets and the few times she does she ratios anyone",
            "# KILL HIM DAMIAN!!!! YEAHHH!!!! LEFT HOOK, STAB HIM IN THE THROAT!!!!!  YEEEAAAAHHHH!!!",
            "Livewire would be an rightwing grifter",
            "Wonder Woman wouldn't actually handle hers anymore after every post she does becomes flooded with \"mommy\", \"step on me\" posts.",
            "I have this stupid headcanon that Red X would literally steal the account with that name from whoever created it first and start talking shit about teen titans outta nowhere",
            "Dick is such an ass",
            "I can see Livewire running a Pop Crave kind of Twitter account. Harley would be filled with \"mommy\" comments, and Joker would always get like 1 comment a month under his 15 posts a day from a bot.",
            "He would be until batman told twitter he wasnt old enough to have an acoount or something",
            "I feel like the difference in older brother/younger brother relationships could have been fun to explore. As a whole I just like it when kon is allowed to interact with the xharacters around him."
        ]
    },
    "Forget Tim and Jon, this is the LGBT representation I want ": {
        "title": "Forget Tim and Jon, this is the LGBT representation I want ",
        "score": 88,
        "url": "https://i.redd.it/djj2l5leni9d1.jpeg",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Oh thank god he dies in this universe too",
            "For more man-loving Mallah and Brain, My Adventures With Superman has an adorable presentation of these two.",
            "Why did they use the wrong Robin? Are they stupid?",
            "Are those para demon children?",
            "They have kids? Based Teen Titans Go",
            "100%, I'm hoping we hear a little mpre from the brain in the upcoming ep!",
            "Jason was confirmed dead in an earlier episode",
            "They're robot henchmen i think",
            "They have a family and run the HOA, they live next door to the doom patrol and they are always trying to fuck with one another. \n\nGo is simply the absolute peak of DC",
            "Ah. I feel Brain would mix their DNA and grow them children but pseudo robot kids makes sense"
        ]
    }
}