{
    "Laberfaden am Samstag": {
        "title": "Laberfaden am Samstag",
        "score": 0,
        "url": "https://www.reddit.com/r/de/comments/1dlqblm/laberfaden_am_samstag/",
        "content": "PSA:  \n\nWer sich in Zukunft allgemeine Rudelguckfäden zu anderen Sportarten/Events wünscht, darf uns gerne eine [Modmail](https://new.reddit.com/message/compose?to=/r/de) zukommen lassen. Ein öffentlich zugänglichen Livestream ist allerdings notwendig.",
        "num_comments": 17,
        "comments": [
            "Klapp' die Antworten auf diesen Kommentar auf, um zu den Stickies der letzten 7 Tage zu kommen.",
            "Ich werde morgen mein neues \"Ehrenamt\" antreten.\n\nWas ich mache? Ich unterstütze eine lokale Katzenrettungsorganisation indem ich die Tiere, die gerade im Katzendorf behaust werden, beschmuse und bespiele. \n\nIch bin bereit. Fast mein Leben lang habe ich mich darauf vorbereitet.",
            "Wohnung anschauen und hoffen, dass wir einen guten Eindruck hinterlassen. Danach Geburtstag von einem Freund feiern. Wetter sieht nicht so nach Park aus, aber wir schauen mal. Morgen ist dann D&D.\n\nWünschte ich hätte mehr Zeit mich durch Shadow of the Erdtree zu sterben",
            "Ich am Freitag: Wie wäre es mal mit einem neuen Buch\n\nIch am Samstag: Doch wieder Herr der Ringe",
            "Gartenarbeit fällt aus, heute bleibe ich auf dem Sofa.\n\nGestern hat es mich plötzlich im Rücken gestochen und es hört nicht auf, ich werde alt.",
            "Brüderchen hat heute Geburtstag und heute Nachmittag zum Grillen und danach zum Spieleabend eingeladen. Leider hat fast jeder abgesagt aber ich geh auf jeden Fall hin. Bin noch am Überlegen ob ich den Kuchen doch noch backe - habe nur den Rhabarber gekauft. Aber der geht mir sonst kaputt... der Kuchen wäre aber dann etwas viel. Naja, vielleicht kann ich mich gleich noch aufraffen. Irgendwie kommt er ja schon weg. \n\nTeamevent am Donnerstag war ganz cool, wir waren in einem Kletterwald. Trotz Höhenangst hab ich mich wenigstens auf die leichten Hindernisse gewagt. Und Zipline macht einfach am meisten Spaß! Ein bisschen Muskelkater hab ich zwar aber es hält sich in Grenzen und dank Allergietabletten hab ich auch nichts von den vielen Mücken gemerkt, die einen da fast aufgefressen haben. \n\nMorgen mache ich dann nichts, je nach Wetter eventuell einen Spaziergang. Und am Montag hab ich Massage, den Termin konnte ich zum Glück da hin verschieben. Ansonsten lese ich endlich mal wieder etwas mehr und komme wieder mit Malazan voran (bin noch in Buch 7).",
            "Auf Reise zurück vom Firmenevent. Diesmal nicht durch die ganze Republik, wie die vergangenen Jahre.\n\n\nZu Hause wartet dann noch das Zimmer, das ich seit dem Auszug meiner ukrainischen Mitbewohner renoviere. Ist zum Glück überschaubar, aber neuer Boden wird etwas teurer. (Haben nicht die Ukrainer kaputt gemacht, ist nur alt und wollte ich ohnehin austauschen)",
            "Mein Körper will mich momentan auch verarschen ey. Erst hab ich mir den Magen verstimmt, weil ich Pepperoni gegessen hab, die nicht einmal besonders scharf waren, dann hab ich mir ein paar Tage später den Rücken verrenkt als ich mir ein Brot geschmiert hab und jetzt hab ich mir gestern bei nem Spaziergang nen Muskel im Fuß gezerrt. Ich habs ja schon verstanden, dass ich bald 32 werde. :(",
            "Mit Kind im Schwimmbad gewesen, damit das Seepferdchen nicht umsonst war. Auf dem Heimweg hat sie dann eine Powernap gehalten. \n\nMein Mann ist pünktlich zu den Ferien krank. Quod est demonstrandum.\n\nHeute Nachmittag chillen im Garten. Endlich Sonne.",
            "Wollte meine long distance Freundin gestern eigentlich nur mach Hause fahren, jetzt bin ich immer noch hier. Nachher lerne ich die beste Freundin kennen und heute Abend eventuell zu den Großeltern.\n\nHabe natürlich weder Klamotten zum wechseln dabei noch meinen Kulturbeutel. Notfall Parfum im Auto muss dienen..."
        ]
    },
    "Freilassing: Autofahrer erfasst Ersthelfer absichtlich mit Kleintransporter": {
        "title": "Freilassing: Autofahrer erfasst Ersthelfer absichtlich mit Kleintransporter",
        "score": 303,
        "url": "https://www.spiegel.de/panorama/freilassing-autofahrer-erfasst-ersthelfer-absichtlich-mit-kleintransporter-a-4007f55d-bc6e-440e-bab6-4d578888ffee",
        "content": "",
        "num_comments": 170,
        "comments": [
            "Führerschein bitte einziehen und eine lebenslängliche Sperre verhängen. So jemand darf nie wieder das Privileg genießen dürfen, ein Fahrzeug zu führen.",
            "Was haben wir falsch gemacht, dass jeder denkt seine Zeit wäre 10000 mal wichtiger als die seiner Mitmenschen? Manchmal passieren Dinge, manchmal muss man was negatives in Kauf nehmen weils einfach nötig ist.",
            "Jemand der sein Fahrzeug als Waffe einsetzt sollte nie wieder hinter dem Steuer von einem sitzen dürfen.",
            "Nur wegen gefährlichen Eingriffs in den Straßenverkehr ermitteln? Das grenzt ja schon an versuchtem Mord.",
            "Hoffentlich ist der Ortsname nicht Programm",
            "Notwehr, der 34 Jährige dachte bestimmt des is nen Klimakleber, das is in Bayern ja kein Problem wenn man da drüber fährt.",
            "Den sollte man ins Gefängnis sperren und nie mehr freilassing.\n\n  \nSchon gut, ich geh ja schon.",
            "Gut wie sicher langsam das Framing wandelt. Nicht das Auto erfasst mehr den Ersthelfer, der Autofahrer isses.",
            "[removed]",
            "Jedes mal wenn ich so etwas lese denke ich mir wie verrückt man sein muss um so eine GTA Nummer durchzuziehen?  \nDie meisten sind so langweilig wie ich, woher kriegt ihr plötzlich die Eier so was in die Tat umzusetzen?"
        ]
    },
    "\"Der Frust ist groß\": Standort Deutschland fällt ins globale Mittelfeld zurück": {
        "title": "\"Der Frust ist groß\": Standort Deutschland fällt ins globale Mittelfeld zurück",
        "score": 128,
        "url": "https://www.derstandard.at/story/3000000225275/der-frust-ist-gross-standort-deutschland-faellt-ins-globale-mittelfeld-zurueck",
        "content": "",
        "num_comments": 51,
        "comments": [
            "Könnten wir Bürokratie exportieren?",
            "Habe den Artikel nicht gelesen, schließe mich aber den Upwählis im Thread an, dass das alles persönlich auf Lindners Befehl passiert und wir nur doch endlich den Kommunismus brauchen.",
            "Das ist alles halb so wild. \n\nUnser Wirtschaftsexperte hätte gesagt: Der Standort Deutschland ist nicht unattraktiv sondern nur nicht mehr beliebt.",
            "Ich gebe weiterhin dem Finanzminister aus der FDP eine große Teilschuld an der Situation. Wer sich immer nur hinstellt und sagt \"geht nicht\" \"zu teuer\" \"wer soll das bezahlen\", obwohl andere Minister und Regierungsparteien zig Ideen haben, um die Wirtschaft zu retten, zeigt eindeutig, wie wenig Ahnung er von der Finanzwelt und Wirtschaft hat. Wir brauchen Investitionen und neue Schulden, um diese Krise zu überwinden und Deutschlands Stand in der Weltwirtschaft zu stabilisieren",
            "Mit der Entscheidung des ersten Bundes-Kabinetts Merz für den Wiedereinstieg in die Kernenergie wird das alles in Ordnung kommen /s",
            "Ja, irgendwie war das doch eines der Dinger von der FDP, sich um die Bürokratie zu kümmern? Entweder ist mir das entfallen oder ich höre davon einfach nichts (mehr). Bürokratieverringerung ist einer der Ansätze, wo man am ehesten Unterstützung bekommen könnte politisch.\n\nEine schöne Analogie ist ja immer der Verkehr. Jeder noch so unbedeutende Kleinscheiß ist geregelt, aber selbst den lokalen Verwaltungen ist es mittlerweile einfach \"zu viel\", was dann in kreative Schilderkompositionen endet beispielsweise. Wenn selbst die Lokalregierung Probleme kriegt... hmmja.\n\nAllerdings hoffe ich, dass die Leute aus der Wirtschaft auch ein paar Finger intern herumgezeigt werden. Man kann ja immer bunt, dramatisch auf die Politik zeigen, aber es wäre auch schon zu wissen, was ihre Lösungswege sind? Wenn ich an deutsche Konzerne denke, dann sind die viel zu träge, konservativ, etc. Da ist auch Luft nach oben.",
            "schon geschehen. Mit Troika und EU haben wir das erfolgreich in die europäischen Saftnationen exportiert die weniger davon hatten als uns lieb war. Und dafür liebt uns ganz Europa. Keiner versteht wie es ohne deutsche Bürokratie mal gegangen ist. ",
            "Vergiss nicht, dass Grüne und SPD eigentlich \"einen richtig guten Job machen\", aber das noch nicht gut genug kommunizieren.",
            "Kann man nicht wissen, denn der wurde noch nie richtig ausprobiert.",
            "Endlich mal ein vernünftiger Kommentar"
        ]
    },
    "Hessen trödelt bei Anerkennung von Heilberuflern – Fachkräfte wandern ab": {
        "title": "Hessen trödelt bei Anerkennung von Heilberuflern – Fachkräfte wandern ab",
        "score": 146,
        "url": "https://www.fr.de/rhein-main/landespolitik/hessen-heilberufen-droht-die-arbeitslosigkeit-93144082.html",
        "content": "",
        "num_comments": 37,
        "comments": [
            "\"Trödeln\" ist hier auch eine leichte Untertreibung. Ich kenne ausländische Ärzte die alle Unterlagen eingereicht haben, alle Prüfungen bestanden haben und eine Jobzusage haben aber seit > 6 Monaten auf eine Berufserlaubnis warten. Das ganze Verfahren für die Anerkennung der Approbation dauert gerne mal über 2 Jahre. Der Flaschenhals ist nicht die eigentliche Prüfung der Abschlüsse (die wird von der Landesärztekammer gemacht) sondern die schlichte Bearbeitung der Anträge.",
            "Ich dachte erst, es ginge um Heilpraktiker. Darüber wäre ich happy gewesen, aber so… =\\",
            "tja, und so wird das Land mit Vollgas gegen die Wand gefahren.",
            "Jedes Mal wenn ich Land höre, höre ich Behörden. Wenn ich Behörden höre denke ich automatisch an Passierschein A38. Wenn ich dann noch von Freunden mitbekomme, dass Datenhaltung in Excel gleich Digitalisierung ist, dann kann man den Laden hier eigentlich direkt zu machen.",
            "heißt das, dass die anderen Bundesländer diese Leute haben kann?",
            "Bei Homöopathen würde ich das Trödeln jetzt persönlich nicht verurteilen.",
            "0.01% wandern deswegen ab\n\nIst im Signal to noise nicht mehr unterscheidbar",
            "Und die Ursache ist leider mit an Sicherheit grenzender Wahrscheinlichkeit \"Bürokratieabbau\" in Form von Stellenabbau für entsprechende SachbearbeiterInnen.",
            "Ich kann hier nur exemplarisch für die Darmstädter Ausländerbehörde sprechen, und das auch nicht als direkt Betroffene Person (die Ehre gebührt dem Einwohnermeldeamt, bei dem ich nun mit anderthalb Jahren abgelaufenen Perso weiter vergeblich hoffe, einen Termin zu ergattern), aber was da läuft, präziser absolut gar überhaupt nicht läuft, entbehrt jeglicher Konzepte, die sich in der deutschen Sprache ohne übermäßigen Gebrauch herber Kraftausdrücke darstellen ließen. Auf onlineterminvergabe wird auf der Behördenwebsite zwar hingewiesen, aber ähnlich wie beim Einwohnermeldeamt werden diese Termine scheinbar nicht freigeschaltet. In der Konsequenz muss man als Betroffener teilweise um 03:00 Uhr an Sprechstundentagen am zentralen Platz aufschlagen und sich einreihen, um die Hoffnung zu haben, eine Wartenummer zu ziehen, die am entsprechenden Tag noch bearbeitet wird. Falls die feinen Damen- und Herrschaften das nicht mehr am selben Tag abarbeiten können, verfällt die Wartenummer selbstverständlich.\n\nWir sind eine, naja, irgendwie große Universitätsstadt und bilden entsprechend viele Leute mit nicht-EU Pass aus. Wenn die Leute aber Bock haben, hier ihre Abschlüsse umzusetzen, an ihre Praktika anzuknüpfen oder ihren hier geknüpften Beziehungen eine Perspektive zu geben, glänzt die Behörde flächendeckend mit *Furzgeräusche durch angespannte Lippen und teilweise ausgestreckte Zunge*. Das ist kein Forumquirk, sondern die ehrlichste Einschätzung, die diese Beobachtung über gut fünf Jahre zulässt. Denn wie anfangs angeführt, für die konzentrierte Gleichgültigkeit gehen die sprachlichen Konzepte einfach aus.\n\nIch kenne mindestens ein paar, das sich vor Plan verehelicht hat, weil die Gammelkacke nicht mehr tragbar war und zu einem zeitweisen Aufenthaltsverlust einer der beiden geführt hat. Die zuvor zugesagte Stelle hier war in Folge selbstverständlich auch weg. Dass in jeder Industrie über Fachkräftemangel geplärrt wird, aber unser unfähiger Behördenapparat die hier ausgebildeten Leute nicht einmal mit einer fortfolgenden Aufenthaltserlaubnis ausstatten kann, ist hahnebüchend. Wir haben kein Integrations- sondern ein integrierungsproblem! Zuckmayer hatte mit den behördlichen Missständen, die im Hauptmann von Köpenick dargestellt recht und wir nehmen schulterzuckend hin, dass lediglich der Lifehack mit der Offiziersuniform ausgebessert wurde.",
            "Und dann können in guter deutscher \"Wir führen Scheindebatten, um Lösungen zu vermeiden\"-Tradition wieder alle nach Bürokratieabbau schreien.\n\nDenn mal darüber zu reden, dass einfach nicht genug Personal da ist (vergleiche angestellte im öffentlichen Dienst im Verhältnis zur Bevölkerung in anderen Ländern), widerspricht ja dem Narrativ."
        ]
    },
    "AfD-Landrat muss Fragen beantworten - Der SPIEGEL siegt gegen Sesselmann": {
        "title": "AfD-Landrat muss Fragen beantworten - Der SPIEGEL siegt gegen Sesselmann",
        "score": 118,
        "url": "https://www.spiegel.de/politik/deutschland/robert-sesselmann-der-spiegel-siegt-vor-gericht-gegen-afd-landrat-a-a339657d-4c99-48a7-bb59-ddd7616ce508?sara_ref=re-so-app-sh",
        "content": "",
        "num_comments": 26,
        "comments": [
            "Haha, was sie in dem anderen Artikel geschrieben haben ist ein guter Brenn:\n\n> Er wollte Verhandlungen mit Putin, die Grenze schließen und raus aus dem Euro. In der Praxis scheitert Robert Sesselmann, erster AfD-Landrat Deutschlands, schon an einer Natursteinmauer.",
            "> Der Mann, der im Wahlkampf eine »verlässliche und geradlinige Politik zugunsten der Bürger« versprochen hatte, verweist in Bürgergesprächen kleinlaut an das zuständige Landesamt, an den Rechnungshof, auf leere Kassen oder einfach auf die da oben.\n\nIst halt typisch Totalitarismus. Erst wenn **alles** von \"uns\" beherrscht wird, können wir wirklich was machen.",
            ">Der Beschluss ist noch nicht rechtskräftig, eine Beschwerde an das Thüringer Oberverwaltungsgericht ist möglich.\n\nSo ganz stimmt der Titel (noch) nicht.",
            "Link zum Artikel den der Spiegel im April über [Sesselmanns Arbeit trotz dessen spärlicher Auskünfte geschrieben hat](https://archive.ph/T0cny).",
            "Halt typischer AfD-Schwätzer, der an der Realität scheitert.",
            "WO IST DIE MÜNZE HERR SESSELMANN??",
            "„Was hat der Landrat getan, um kriminelle Asylbewerber abzuschieben?“\n\nIst aber auch etwas frech vom Spiegel. Der Spiegel weiß ganz genau, dass ein Landrat da rechtlich überhaupt nichts machen kann bzw darf. Abschiebefragen werden von Bund und Land geregelt. Wie quasi alles in der Asylpolitik, was die Gemeinden in Deutschland ja so aufregt, weil sie nichts entscheiden aber viel bezahlen müssen. \n\nDie Frage ist offensichtlich so gedacht, dass der AfD-Typ nur „nichts“ antworten kann, was der Spiegel dann gerne so präsentiert hätte.\n\nGanz generell sollte man sich vergegenwärtigen, dass Landräte/Bürgermeister inzwischen quasi kaum eigene Politik machen können. Die Finanzen der Gemeinden in Deutschland sind inzwischen teils so katastrophal, dass man einfach nur noch die sog. Pflichtaufgaben machen kann (die eine Gemeinde machen muss). Wirklich Gestaltungsspielraum hat man nicht. Ist eher ein Verwalterjob.",
            "Und es ist seitdem nicht besser geworden:\n\n>Vor knapp einem Jahr wurde Robert Sesselmann zum ersten AfD-Landrat Deutschlands. Gefordert hatte er viel: den Euro abschaffen, Grenzen schließen, die Kliniken vor Ort erhalten. Doch Erfolge sind rar, stattdessen sind die Straßen marode, Schulen schließen und es gibt finanzielle Engpässe. Eine herbe Enttäuschung für viele Bürger.\n\nhttps://www.focus.de/politik/deutschland/sesselmann_id_260070274.html",
            "Ich muss im hier aber insofern Recht geben, dass eine Kontrolle des Gelddruckers, wofür du in der Bundesregierung sitzen musst, durchaus einen massiven Unterschied machen würde.\n\nWobei es auch Untersuchungen gab, dass die AfD ihren ganzen Kram gar nicht durchsetzen kann, weil sie viel zu sehr sparen würde, da sie panisch Angst vor Schulden hat.",
            "Er ist vielleicht nicht rechtskräftig, aber zumindest recht kräftig "
        ]
    }
}