{
    "Weekly Meta Discussion": {
        "title": "Weekly Meta Discussion",
        "score": 6,
        "url": "https://www.reddit.com/r/DeadBedrooms/comments/1dowv2h/weekly_meta_discussion/",
        "content": "Your opportunity to make observations about our sub, to ask moderators questions, or to offer suggestions for things that need changing.",
        "num_comments": 5,
        "comments": [
            "With the amount of people complaining about DMs I would something to wiki or a sticky post explaining how to turn them off if they wanted to",
            "It's continuing to be a safe place. 😊",
            "Niiiiice! \n\nI like this suggestion. We could even automod it like we did the not respecting flair stuff. \n\nThanks friend!",
            "Test",
            "Of course no problem"
        ]
    },
    "Something Positive Sunday": {
        "title": "Something Positive Sunday",
        "score": 8,
        "url": "https://www.reddit.com/r/DeadBedrooms/comments/1dm97y2/something_positive_sunday/",
        "content": "This post is a weekly opportunity for the community to share positive developments, large or small, in their relationships or lives.",
        "num_comments": 11,
        "comments": [
            "Made it another week without my DB consuming me.  I'm at 10% give-a-fuck and still dropping! Woohoo!",
            "Friday night she said her throat was bothering her and when she woke up she had a mild soar throat and didn't feel 100%, so definitely no sex happening for the next few days.\n\nThe positive? No need to even consider it for a moment so I can just do my own thing, like I always end up doing.",
            "got some last night! couldn't believe it. We had a brief chat where she said she wanted me to cuddle more and I said I wanted weekly sex. We seemed to agree. I am not going to get my hopes up but for a brief minute I remembered how fun it could be to have a wife that wants you. It's been at least 5-6 months since the last time we did it. Had honestly given up on ever having sex with her again.",
            "Had some pity sex thrown my way. No fun. She’s just not into me",
            "How do you do that?",
            "Fuck man. Personally I find pity sex more depressing that no sex.",
            "Long and painful process of wearing myself down and telling myself it's not going to happen and forcing myself to believe that I don't care.",
            "How long did this process take? Care to share the reason why you are still with your patner and not opted to look for more suitable person ",
            "It took me roughly a year and a half of agony before I became numb to it.\n\nLike so many stories in here, she's great in every way except for her LL, and I'm not willing to give it all up all we have built in 22 years for just for that one thing.  Could it happen someday when my kids are grown and on their own? Maybe.",
            "Nothing"
        ]
    },
    "I swear this is a joke at this point. ": {
        "title": "I swear this is a joke at this point. ",
        "score": 82,
        "url": "https://www.reddit.com/r/DeadBedrooms/comments/1dr9yo3/i_swear_this_is_a_joke_at_this_point/",
        "content": "I've made a few posts here so I'm skipping introductions and going straight to the vent.  \n  \nLast night the kid went to her grandparents. You instantly put your hands on me and said \"now that we are all alone...\" And then sat down on the couch and started playing your game again. I knew nothing was going to happen but I still got pissed. An hour or so later your hands are on me again so I make a comment about it. I don't remember exactly what I said but it was along the lines of \"if you don't plan on doing anything why do you keep getting my hopes up\" to which you said \"oh I do plan on doing something.\" Yeah. Must not be with me though since I can't even remember what it feels like anymore. I went to bed angry and left for work before you got up. First message you send me says \"you seem like you're in a great mood today.\" I haven't even had a chance for you to find out what kind of mood I'm in. But yeah, I am in a bad mood. I'm sick of fucking arguing over the same thing all the time. I'm sick of you pretending you don't know what I'm talking about. I'm sick of the empty promises to change. I want my marriage back not a god damn roommate. ",
        "num_comments": 25,
        "comments": [
            "I feel this so much. It’s literally like a roommate I’d give anything to have a man who wanted me 😩",
            "Yeah the frustration turns into anger, then lashing out I've been there. Lashing out doesn't turn on a LL partner so it's just a vicious cycle....",
            "Roommate.... that's the same term I told my wife I felt like.   I can do the chores, tend to her cats, etc. While she sits on her ass on her phone and doesn't give me what I need.  Today I reminded her it has been 3 months and I'm at my end.",
            "Sorry, I'm a bit confused here. She put her hands on you and made a suggestive comment. Then immediately went to sit down and play her phone? \nDid she want you to initiate from there with her?",
            "\"I want my marriage back not a goddamn roommate\" is so poignant and accurate.",
            "Feel for ya man, it’s not fun. Hang in there. hope it gets better for you!",
            "It feels like this huge, important issue to you, and yet she can brush it aside as no big deal. It doesn't matter if it is actually intentional or accidental, because it feels intentional. There are definitely points of congruity for spouses in DB situations.",
            "Yeah, my partner pretends not to know why I'm upset and keeps poking me about why I'm like this. And it makes me more upset because then I also feel like she takes me for a fool. It's infuriating!\n\nEdit: typo",
            "If it is a joke, it's not a funny one at all.  Sounds like you've made your intentions clear.  I have not read your previous posts, but I think I feel you.  As a HLM with kids, I would never let a night alone go to waste.  Clothing would not be permitted anywhere in the home for the night.... I'm sorry OP.  I honestly feel your pain.",
            "I often wonder if some people have split personalities by acting like that..."
        ]
    },
    "So this woman reached out…": {
        "title": "So this woman reached out…",
        "score": 82,
        "url": "https://www.reddit.com/r/DeadBedrooms/comments/1dr1lbi/so_this_woman_reached_out/",
        "content": "You can see from my last post I don’t believe in cheating especially after my wife’s affair despite being in a DeadBedroom.\nWell, I post videos on TikTok. Nothing sexual just random funny videos.  I’m in most of them. \nI posted a story of me literally brushing my beard.\nI noticed this one particular person was viewing my profile a lot. After two days, she messaged me. We’ve gone back and forth for the last 24hrs. This woman has a profile picture, but nothing else. The talking has been solely based off personality and semi-interesting conversation. The conversation moved from TikTok messaging to Telegram. I realize this alone is cheating. I wouldn’t want my wife to discover these chats regardless if none of it sexual. None of it, but if you wouldn’t want your spouse to know you’re taking to random person of the opposite sex, then it’s obviously not right. I get it.\nHere is the thing, she actually sent me a picture of herself. Nothing sexual. She sent me her instagram and my god she is beautiful. \nLike 9 or 10. You probably would see her and think she’s model or has models at some point.\nYes, she’s real and it’s really her. \nSo I’ve never been unfaithful to my wife, but I may have had a reawakening.\nIn order to not be a hypocrite, I need to divorce my wife. I don’t think aeparating just to have an affair, is right either.\nRemember that scene in Hook when the lost boy grabs Peter (robin william) face and says “there you are Peter”. I’m the lost boy talking my old confident self.\nI’d rather disrupt my entire fucking life all over again, so that I can get far away from this life with her.\nIt’s just so painful. Every day. The feeling of being unworthy of love or attention, living life with blue balls. Loving someone who just doesn’t feel the same.  I feel like I’m that chubby nerd in high school again. I remember this hopelessness; having a crush on a girl that has no interest in me. \nI’ve been trying for 13 years. I’ve been trying live and love this woman despite her affair and this deadbedroom. I have tried.\nI’m 37 with a fucking $28m retirement plan, six figure job, with an US slightly above average penis. Six figure job. I’m ok. I’m Fucking O. K.\nDead LL woman, shape up. Figure it. \nDon’t say it’s not that easy because you’re in we’re out.\n",
        "num_comments": 55,
        "comments": [
            "This is most likely a romance scam! Just double check everything.",
            "Leave a marriage for yourself. Never for another person.",
            "You are gonna get scammed bro.",
            "It sounds like your wife is not LL but LLFY..You might want to stop blaming women and check your sex game out. Are you a good lover (read: not selfish. Good at pleasuring HER TOO?)? A good husband? Good father? There are also tons of women on this forum that are HL with LL men BTW.. and they aren't blaming all men.",
            "This person opened your eyes. You realize it’s okay to leave, especially in your position. You don’t have to pursue someone else. You don’t have to be in another relationship in order to leave the one you’re in. This profile is probably thousands of miles away from you but what you should be thankful for is she helped you realize the situation you are in. The best thing you can do for your self esteem and sanity is leave. Wishing you the best.",
            "I would be careful here OP, you say she is real, has she sent you a photo with her holding a copy of today's newspaper? Like you said to summarise your post, You have a lot going for you and have tried. Sounds to me you just need a little courage...",
            ">Dead LL woman, shape up. Figure it. Don’t say it’s not that easy because you’re in we’re out.\n\nYou know that many of us are LL4U because the sex is bad/selfish, right? So...HL men who suck in bed, shape up!",
            "You absolutely deserve love and affection \nAlso I agree that texting other people of the opposite sex is wrong but I personally don't care at this point \nReally hope that you go for that woman!",
            "You sound miserable dude. Go for\nIt.",
            "Be very careful. Sounds like you could be getting catfished to me"
        ]
    },
    "The irony of recovering my self-esteem": {
        "title": "The irony of recovering my self-esteem",
        "score": 11,
        "url": "https://www.reddit.com/r/DeadBedrooms/comments/1draudk/the_irony_of_recovering_my_selfesteem/",
        "content": "I (48HLM) been married for 22 years to my wife (48LLF). When we were dating the sex was good, spontaneous, nothing crazy but there was passion and at 26 I had not the experience to understand or read any red flags. \n\nAfter we got married there was a significant change in her and I quickly reacted from being confused to frustrated to angry very fast. After the first 5 years our sex life was the number 1 subject of our fights. To be honest my communication and emotional skills were never at par with my wife's and obviously being a LLF she used all the tools in the box to make me feel like it was my problem, that my expectations were not based in reality, she felt angry because everything revolves around sex, I am only married to her for sex (this one hits me hard I will explain later), she felt over sexualized she also made my feel inadequate telling me I don't get her, I don't know how to turn her on, etc. Life goes fast, kids are a priority and the 2 times we have sex or to be honest the 2 times a month she donates her empty body to me to fulfill the obligation of meaningless sex (no foreplay, same position, 4 to 6 minutes before she starts complaining) felt like a good trade-off for having a family a great friend and partner, incredible mother, she is a beautiful, funny and smart woman with is terrible jaja because with each passing year the evolution of my self-esteem went from I feel wanted at 26 to why I'm not wanted, to there is something wrong with me, to I better cling to my beautiful wife or I feel anxious, to oh good I am invisible. \n\nI started therapy 5 years ago, why?... you guest it, my wife felt like I was not putting my best effort in our marriage and had a list of issues that I needed to work (all valid, but the stones on this woman), feeling completely panicked by the idea of loosing my wife and family I started therapy (just me, she is a confident, healthy and emotional evolved human that is the pinnacle of human evolution that obviously has nothing to gain from therapy). In therapy I worked on her list of issues and as I started to like how therapy was helping me I started working on myself. 2 years ago I started seeing a sexuality therapist for a year additional to my regular therapy, and she helped me recover my lost self-esteem, she had a mid session with my wife and a final session 1 year ago when we finish our journey, the results of this sessions with my wife were very informative to her. She told me my wife has no interest in sex, she probably has some sexual disfunction that could be worked to improve but it required my wife to work in many fronts to understand which issues are the causes of her disfunction, but my wife is not interested. In the year I worked with the sexuality therapist, I changed radically my views on my marriage but especially in why is not working, why is not my fault alone, why I am not a problem, and each step I saw in a mirror a different man, I started to see trough the veil, I started to recover my self esteem, my personality changed and this brought a tangible change in how I interact with other women. I felt so betrayed by my wife, so angry, but again time brought the calm to understand I will never change her, I am healthy, I am better that I was, I am a good partner, a great dad. She is not bad she is maybe a narcissist but so I am in many issues, she is selfish yes, but she does not fully understand the damage of her actions since she (and now I see it as something that makes me feel bad for her) is not capable of feeling and experience sex and intimacy like I do, at least not with me. Now I see my marriage as a trip and not a destination, I love my family, I love the time I spend with her as a friend and as the mother of my children, I have set a plan and a destination for this trip in which I will explain to her at the end of the line that this for me is not an until death do us apart situation. I have never cheated, in the past year 2 years I have been entertaining the idea and looking for validation that I deserve to cheat, but I am not that kind of guy which is not judging anyone who does, it is a living hell being in a relationship in which you have been erased by your partner. The irony of recovering my self-esteem is that it did not gave me what I wanted which was a better intimacy and sex life with my wife, it gave me the clarity to leave. Sorry for the long rant. \n\n\n\nPS.  about the \"your are with me only for sex part,\"... It took me 22 years to realize the answer is, no I am here with you by your side in love with you even if you are never here for the sex.\n\nEdit: some.typos English is not my first language ",
        "num_comments": 3,
        "comments": [
            "“Being erased”. Wow. That hit me hard. Perfect explanation. Best wishes to you on your new journey.",
            "\nCommenters, OP has marked their post as a no-advice post. We ask that you refrain from giving advice to OP and be sure to follow all sub rules.\n\nOP, if you've marked your post for no advice, please refrain from responding to commenters that give advice. If you are getting advice from commenters, please report the comments, or click below to contact the moderators.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/DeadBedrooms) if you have any questions or concerns.*",
            "This resonates so much.\nYour story is almost exactly like mine, but I did cheat. And no, I don’t feel guilty.\n\n“My marriage is a trip and not a destination”, wow never looked at it this way. Wise words."
        ]
    }
}