{
    "8.1.0 | PTB": {
        "title": "8.1.0 | PTB",
        "score": 891,
        "url": "https://www.reddit.com/r/deadbydaylight/comments/1do8343/810_ptb/",
        "content": "https://preview.redd.it/95fhn55tlp8d1.jpg?width=1000&format=pjpg&auto=webp&s=f86696cf0a3174e6a9827605e2ff262ef5952b77\n\n# Important\n\n* Progress & save data information has been copied from the Live game to our PTB servers on **June 17th**. Please note that players will be able to progress for the duration of the PTB, but none of that progress will make it back to the Live version of the game.\n\n* Players will once again receive 12,500 Auric Cells on the PTB Build to explore Outfits and Characters in the Store. Both Auric Cells and purchases made on the PTB Build will **not** transfer to the Live Build.\n\n\n\n# Content\n\n# New Survivor: Lara Croft\n\n\n\n**New perk: Finesse**  \n\n\n* This perk activates while you are healthy.This perk goes on cool-down for **40/35/30 seconds** after performing a fast vault.\n   * Your fast vaults are **20% faster.**\n\n**New Perk: Hardened**\n\n* After you unlock a chest and cleanse or bless a totem, this perk activates. Anytime you would scream, reveal the Killer's aura for **3/4/5 seconds** instead.\n\n**New Perk: Specialist**\n\n* Each time you open or rummage through a chest, gain 1 token, up to **3/3/3**.When you do a great skill check on a generator, consume all tokens. Then for each token consumed, reduce the maximum required generator progress by **2/3/4.**\n\n# Killer Perk Updates\n\n* **Darkness Revealed:** Increased the duration of the aura reveal to 6/7/8 seconds. *(was 3/4/5 seconds)*\n* **I'm All Ears:** Decreased the cooldown to 60/45/30 seconds. *(was 60/50/40 seconds)*\n* **Trail of Torment:** Decreased the cooldown to 60/45/30 seconds. *(was 80/70/60 seconds)*\n* **Oppression:** Decreased the cooldown to 60/50/40 seconds. *(was 120/100/80 seconds)*\n* **Dragon's Grip:** Decreased the cooldown to 60/50/40 seconds. *(was 120/100/80 seconds)*\n* **Machine Learning:** Increased the Undetectable and Haste duration to 40/50/60 seconds. *(was 20/25/30 seconds)*\n\n# Survivor Perk Updates\n\n* **Autodidact:** Decreased the initial progress penalty to 15%. *(was 25%)*\n* **Empathic Connection:** Increased the speed at which you heal others to 30% faster. *(was 10%)*\n* **Iron Will:** Increased the grunts of pain reduction to 80/90/100%. *(was 25/50/75%)*\n* **Resurgence:** Increased the healing progress gained to 50/60/70%. *(was 40/45/50%)*\n* **Solidarity:** Increased the heal conversion rate to 50/60/70%. *(was 40/45/50%)*\n* **Babysitter:** Increased the Haste bonus to 10%. *(was 7%)* Increased the duration to 20/25/30 seconds. *(was 4/6/8 seconds)*\n\n# Killer Updates\n\n# The Knight - Basekit\n\n* Added the ability to cycle between guards using the *Secondary Ability* button.\n* Decrease the camera push distance when entering path creation mode to 80 cm. *(was 160 cm)*\n* The Knight must create a patrol path of *at least* 10 meters before being able to spawn a Guard. It's possible to cancel early by using the *Secondary Ability* button.\n* Adjusted the Guards' detection to reduce the likelihood of being detected through walls.\n* While The Knight is within 8 meters of a Guard that is actively hunting, the hunt timer will deplete at 3x the normal speed.\n* While drawing a patrol path, its length applies a modifier on the base total hunt time:\n   * 1-15 meters: 1x\n   * 16-25 meters: 1.25x\n   * 26+ meters: 1.5x\n* Decreased The Carnifex's hunt duration to 12 seconds. *(was 24 seconds)*\n* Increased The Jailer's hunt duration to 24 seconds. *(was 12 seconds)*\n* Decreased the time it takes for each Guard to perform the Order action:\n   * Carnifex: 1.8 seconds *(was 2 seconds)*\n   * Assassin: 5 seconds *(was 6 seconds)*\n   * Jailer: 5 seconds *(was 6 seconds)*\n* Increased each Guard's detection range:\n   * Carnifex: 10 meters *(was 8 meters)*\n   * Assassin: 10 meters *(was 8 meters)*\n   * Jailer: 16 meters *(was 14 meters)*\n\n# The Knight - Addons\n\n* **Map of the Realm:** Increases the Guard's detection range by 2 meters. *(was 4 meters)*\n* **Pillaged Mead:** Decreases the Break or Damage action of Guards by 10%. *(was 15%)*\n* **Battleaxe** **Head:** Decreases the cooldown after calling upon The Carnifex by 20%. *(Rework)*\n* **Treated Blade:** Decreases the cooldown after calling upon The Assassin by 20%. *(Rework)*\n* **Cold Steel Manacles:** Decreases the cooldown after calling upon The Jailer by 20%. *(Rework)*\n* **Sharpened Mount** *(was Chain Mail Fragment)*: Increases the time it takes for the Standard to spawn by 15%. *(Rework)*\n* **Grim Iron Mask:** When a Guard detects a Survivor during a Patrol, the Survivor suffers from the Blindness Status Effect for the next 75 seconds. *(was 60 seconds)*\n* **Broken Hilt:** Guards inflict the Haemorrhage and Mangled Status Effects when damaging a Survivor. *(was only Mangled)*\n* **Ironworker's Tongs:** If a Guard fails to damage a Survivor during a Hunt, the Survivor suffers from the Oblivious Status Effect for 60 seconds. *(was 20 seconds)*\n* **Town Watch's Torch:** While a Guard is actively Hunting a Survivor, gain the Undetectable Status Effect. *(Rework)*\n* **Blacksmith's Hammer:** Guards inflict the Broken Status Effect for 60 seconds when damaging a Survivor. *(Rework)*\n* **Flint and Steel:** After summoning The Carnifex, the auras of all Survivors within 24 meters of any unbroken dropped Pallets are revealed for 8 seconds. *(was 5 seconds)*\n* **Healing Poultice:** After summoning The Assassin, all Survivors within 8 meters of The Assassin's spawn location have their auras revealed for 8 seconds. *(Rework)*\n* **Jailer's Chimes** *(was Lightweight Greaves)***:** After summoning The Jailer, Survivors that cross The Jailer's Patrol Path have their auras revealed for 8 seconds. *(Rework)*\n* **Knight's Contract:** After giving an Order, the Guard will remain for an extra 8 seconds, triggering a Hunt should they detect a Survivor. *(Rework)*\n* **Iridescent Company Banner:** Drawing a Patrol Path through Windows blocks them for all Survivors for 25 seconds after summoning a Guard. *(was 15 seconds)* The Exit Gates are blocked by the Entity Spikes for the Hunted Survivor. All Windows vaulted by the Hunted Survivor are blocked for all Survivors for the remained of the Hunt.\n\n# The Singularity\n\n* When tagging a Survivor from a Pod (and Slipstream is not completed), the Tagging progress goes down gradually over 0.5 sec *(was instant)*\n* Tag depletion starts after 0.25 seconds after Slipstream has been accumulated (but not completed) *(was 0.3 seconds)*\n* When taking over an inactive pod, the reticule will center on the closest Survivor in range and line of sight *(new)*\n* When destroying a pod while controlling it, hold down M1-Attack Button for 1.25 sec to destroy it *(new)*\n* New Killer Instinct Effect for 3.0 sec. on Survivors receiving Slipstream from another Slipstreamed Survivor or from a Bio-Pod\n* Added Aim Assist effect when aiming at a Slipstreamed Survivor\n* Decreased Tagging cooldown for Pods after Slipstreaming a Survivor to 3.0 sec *(was 3.5 - allows less downtime after shooting a Survivor)*\n* Decreased distance that Survivor can see Supply Crate aura when not Slipstreamed to 28M *(was 32)*\n* Added Hindered Icon to show the slow down when Survivors charge the EMP tool\n* Killer Wake Up time after controlling a Pod decreased to 0.5 seconds *(was 1.0)*.\n* Killer Wake Up time near a Hooked survivor decreased to 1.5 seconds *(was 5)* to account for the anti-camp feature*.*\n* Increased the Lock-On time to Slipstream a Survivor while controlling a pod to 0.8 seconds *(was 0.6)*.\n* Decreased World Detection of the aiming radius to reduce collisions and interference for shots.\n* Overclock Duration no longer scales based on the number of Slipstreamed Survivors. Base value has been increased to 5.7 seconds *(was 4.7)*\n* Increased readability of the Survivor-in-range indicator - Highlight is On = can be tagged / Highlight is Off = cannot be tagged\n* After exiting a Pod, the aura of the last used Pod is displayed in yellow for 10.0 seconds *(was 5)*\n* Soma Family Photo Addon +3% Haste effect for the duration of the Overclock is now base kit.\n* UltraSonic Sensor Addon sound effect is now base kit. Killer can hear sounds through a controlled Biopod after 0.20 seconds by default.\n* Made valid location target placement easier *(increased placement timing from 0.1 seconds to 0.2 seconds)*\n* After using an EMP, Survivors are invincible to Slipstream for 1.0 second *(was 2.0)*\n* EMP Range effect has been increased from 8M to 10M.\n* EMPs stop printing when reaching 97%. Survivors now need to complete the last 3% manually. Supply Crate auras are shown in yellow when maximum progress has been reached.\n* No longer forced to pick up EMPs after opening Supply Cases\n* Perks: Blast Mine and Head-on now both apply the Overheat effect when affected by a stun during Overclock.\n\n# Map Updates\n\n\n\n* Added 2 new Map variations to the Mount Ormond Resort\n* Added 1 new Map variation to the Family Residence from the Yamaoka's Estate Realm\n* Added 1 new Map variation to the Sanctum of Wrath from the Yamaoka's Estate Realm\n* Gameplay pass on the Forgotten Ruins map to add pallets on at the ground level\n* Added variations to the maze tiles in the pool of tiles for the Coldwind Farm Realm\n* Added lockers in the existing maze tiles in the Coldwind Farm Realm\n\n\n\n# Features\n\n# Disconnect Bots\n\n* Disconnect Bots will now be able to spawn if a player disconnects during loading. This should allow for games that used to be cancelled for not having enough players to continue on.\n\n# Hook respawn\n\n* Hooks broken by a Sacrifice will now respawn after 60 seconds.\n\n# UX - Knight Guard's Chase\n\n* Added a visual feedback when you have successfully distracted a guard by passing near a Window or downed Pallet.\n\n# UX - Lobby Update\n\n* Cosmetics and Character selection are merged into a single section. As in the store, players can use subtabs to navigate between options, including Characters' bio pages.\n* Perks widget is added to the Lobby, available when looking at the Characters Menu, allowing players to view Perks and Powers while selecting Characters.\n* Filter option allows for players to show locked cosmetics if they want to do so.\n* As long as players are not waiting for a match to start, they can unlock Characters and Cosmetics directly on the Lobby.\n* Now Moris can be previewed in the Lobby.\n* Merged certain functionalities of the Killer and Survivor lobbies to make it easier to maintain in the future.\n\n# UX - Singularity's Podding and Controlling\n\n* Biopod & Killer reticule was updated to better communicate states:\n   * **Green state:** Idle, Firing Biopod, Slipstreaming Survivor\n   * **Purple state**: Teleport to Survivor\n   * **Grey state:** On cooldown\n   * **Red state:** Destroying Biopod, Disabled Biopod\n* Biopods will now indicate to Survivors when they are about to be reactivated\n\n\n\n\n\n# Bug Fixes\n\n# Audio\n\n* The Voice-Over of the Lich is now correctly playing in the Mori Preview.\n\n# Bots\n\n* The Trapper Bot in the Survive with Friends Tutorial now correctly looks at the target it is chasing.\n* The Trapper Bot in the Survive with Friends Tutorial should be better at not stepping into his own traps.\n* Prevented multiple Bots in the same Trial to accidentally spawn with the same digits at the end of the name.\n\n# Characters\n\n* Fixed an issue that caused female survivors to remain stuck in the trapped position animation even after freeing themselves.\n* The Good Guy’s Hidey-Ho Mode cooldown now begins at the end of a Slice & Dice attack.\n* The Onryo’s intermittent invisibility when within 24 meters of the Killer now happens in sync between the Survivors’ and Killer’s POV.\n* The path leading to the Highlighted Control Station can no longer be seen when outside of tunnels when playing as the Xenomorph.\n\n# Environment/Maps\n\n* Fixed an issue where players could get body blocked on the Forgotten Ruins in Decimated Borgo. The door frames have been updated.\n* Fixed a collision issue in Toba Landing map\n* Fixed an issue where the killer gets blocked on the Blood Lodge Map\n* Updated the pallet count on the Forgotten Ruins map\n* The Pig stays in Stealth when using the Passages in Forgotten Ruins.\n* Players may no longer get stuck in Passages if multiple players try to use them at the same time.\n\n# Perks\n\n* Survivors no longer randomly fail Merciless Storm skill checks when hitting in the success zone.\n* The Mirrored Illusion illusion correctly despawns when the Killer goes through it.\n* The Trapper’s Bloody Coil Add-On, The Plague’s Vile Purge, and the Skull Merchant’s Claw Trap now activate the Dissolution perk.\n\n# UI\n\n* Fixed an issue where some perks' descriptions have an improper number format\n* Fixed an issue where the account name is displayed in the main menu when turning on or off the \"Hide your name\" setting\n* Fixed an issue where the Auric cell packs purchase screen can be accessible when starting the final countdown.\n\n# Misc\n\n* Fixed an issue that could soft-lock loading into a Trial due to a player's Loadout bringing an invalid Item.\n\n\n\n# Known Issues\n\n* The Knight can spawn a guard while another guard is already summoned.",
        "num_comments": 1003,
        "comments": [
            "Did... did they just reveal Lara Croft without a trailer or anything?",
            "Werid that lara has had 0 teasers or even a trailer",
            "Never expected Lara Croft to come to the game, not complaining though. Funny thing is she has a higher kill count than most killers in the game haha",
            ">Survivors no longer randomly fail Merciless Storm skill checks when hitting in the success zone.\n\nit will be bugged again in 3 .. 2 .. 1 ... \\*boom\\*",
            "Who the hell thinks we wanna play in non full games?",
            "The disconnect bot change feels really, really bad. I'm sure most of us would still rather just have the game end then to load in with 1 or 2 bots because someone forced close the game to avoid a map offering in play",
            "Not bots at the start please. I’d rather just requeue and play with real people",
            "Bots from the start of a trial is a bad idea. I'd rather requeue than this. Please revert this change.\n\nEdit: thank you",
            "Guys, they fucked up the UI *AGAIN*. This time with character selection",
            "No one wants disconnect bots to be spawned in when someone disconnects during loading just cancel the dang match. Bots are awful and no replacement for an actual player, just let us move on from the canceled match I really don’t care and get into a lobby extremely fast"
        ]
    },
    "8th Anniversary Event Thread": {
        "title": "8th Anniversary Event Thread",
        "score": 413,
        "url": "https://www.reddit.com/r/deadbydaylight/comments/1df1x15/8th_anniversary_event_thread/",
        "content": "https://preview.redd.it/67xdn7k4xc6d1.png?width=1920&format=png&auto=webp&s=647af707b96952ebd92c6284ccd4320ba026ab2f\n\n# [Dead by Daylight | Twisted Masquerade Event 2024](https://www.youtube.com/watch?v=ChIyUMwrfWU)\n\n# Duration: From June 13th 11 AM ET to July 4th 11 AM ET.\n\n*~~Note: The update will be delayed on Xbox. Crossplay and Events will be unavailable to Xbox players until the update goes live on the platform.~~*\n\nCompensation for XBOX players: Log-in before June 20 to receive 3.000.000 BloodPoints and 300 Gilded Trinkets.\n\n# Features:\n\nThemed generators, hooks, lockers and the \"Father Campbell’s Chapel\" map.\n\nBloodweb Itens: Masquerade Flashlights, Toolboxes, Medkits, and offering.\n\n# MEET TRYKS\n\nThis year’s Masquerade marks the arrival of the host du jour, a figure as enigmatic as she is eccentric, as gleefully unhinged as the most exhilarating nightmare. Though she goes by many names, you will come to know her primarily as **Tryks**. In fact, she happens to play a central role in this year’s gameplay event. On that note...\n\nhttps://preview.redd.it/94yp475qxc6d1.png?width=1920&format=png&auto=webp&s=cf3366f4836141b29b46bb4c07846616ce76bfc6\n\n# INVITING TROUBLE\n\nInvitations will be placed throughout every Trial, placed atop an ornate Masquerade Pillar. Grabbing one grants abilities:\n\n**SURVIVOR**\n\n* Block a window vault for the Killer.\n* Spawn a Fragile Pallet whether in and out of a chase.\n* Activate Quiet mode, which lowers your footsteps, breathing, grunts of pain, and entering/exiting a locker.\n\nhttps://preview.redd.it/wnp958k6yc6d1.png?width=1920&format=png&auto=webp&s=2451bdb52d690f8e5f30d1335efb0c280eb444f0\n\n**KILLER**\n\n* Teleport a Survivor directly to a Hook when carrying them on your shoulders.\n* Remotely break a Pallet\n* Reduce the impact of a stun.\n\nhttps://preview.redd.it/5md0inq7yc6d1.png?width=1920&format=png&auto=webp&s=9490e7f8ffecf802173304ac3ff6fcf91903535d\n\nOnce an Invitation ability is activated, the charge is used up and you must find another one. You can carry maximum of 2 Invitations at a time, and charges will regenerate over time.\n\n# BAG OF TRYKS\n\nHaving an invitation in your back pocket can be advantageous, but there’s another wildcard at play. Literally – a *wild* card courtesy of Tryks, who isn’t exactly known for playing with a full deck.\n\nAt the beginning of every Trial a set of 5 cards will be randomly selected to impact the match. Once revealed, they will activate in order, with the first card activating at the beginning of the Trial.\n\nOnce the Trial begins, players will be able to activate the next card by collectively earning points through in-game actions like Hooking a Survivor for the first time or finishing a Generators. After 2 points, a new card will Activate, replacing the previous one.\n\nWhat do the cards do, you ask?\n\n* **You're Invited** \\- All players instantly receive a charged Invitation.\n* **No Invite For You!** \\- All players instantly lose an Invitation.\n* **Peekaboo!** \\- All players have their Aura briefly revealed.\n* **Move It Or Lose It!** \\- All players gain a Haste bonus for a duration.\n* **Heal You, Expose You!** \\- All injured Survivors are healed and immediately Exposed.\n* **Wait, Where...?** \\- Survivors leave no Scratch Marks and the Killer is Undetectable.\n* **Party Totem!** \\- All Dull Totems are revealed and transform to Anniversary Totems, which remain until the next card.\n* **Party Chest!** \\- All unopen Chests become Anniversary Chests.\n* **Zzl Zilch!** \\- Nothing happens.\n\n# EVENT TOME & UNLOCKABLES\n\nThe Twisted Masquerade introduces a new Event Tome, featuring 3 levels of Challenges and 3 Community Challenges to complete. Complete challenges to earn Gilded Trinkets, which can be used to unlock lavish Outfits for the Masquerade’s guests of honor, Bill Overbeck and The Unknown, 12 new Masks for Killer and Survivor, and several unique Charms and Player Cards.\n\nhttps://preview.redd.it/51ltbnfcyc6d1.png?width=1920&format=png&auto=webp&s=f6bf458986319de37897fe4d5dd854dd22549097\n\nhttps://preview.redd.it/dgsq88adyc6d1.png?width=1920&format=png&auto=webp&s=7b2cf7c33ddb1810a1c15962e644daa0eec7ee45\n\nhttps://preview.redd.it/sfh0d5ldyc6d1.png?width=1920&format=png&auto=webp&s=6e832d42ed911a02bca754c656072d56046dd18a\n\nhttps://preview.redd.it/lfwix9vdyc6d1.png?width=1920&format=png&auto=webp&s=a0158a5ce843eef3a20281ed04fe2b1b84ed4fdc\n\n[Use code DNDBD20 before June 30th](https://preview.redd.it/3691pgbh5c7d1.png?width=1080&format=png&auto=webp&s=a582f3b70b15071efe8af347c875025d09671cce)\n\nYou can also purchase previous Event Cosmetics for both Killer and Survivor, including the fan-favourite masks from previous Masquerades, by heading to the in-game store.\n\n# DAILY LOGIN REWARDS\n\nCheck out the full list below to take home 750,000 Bloodpoints and 70 Rift Fragments. We’re also giving away 100 Gilded Trinkets to get you started, which can be claimed on any day until the Event ends on July 3rd.\n\nEach gift period starts at 11 AM ET and runs for 24 hours.\n\n* **June 13th** – 50,000 BP & 100 Gilded Trinkets (Gilded Trinkets are available whenever a player logs in during the Event)\n* **June 14th** – 25,000 BP\n* **June 15th** – 15 Rift Fragments\n* **June 16th** – 75,000 BP\n* **June 17th** – 10 Rift Fragments\n* **June 18th** – 50,000 BP\n* **June 19th** – 10 Rift Fragments\n* **June 20th** – 50,000 BP\n* **June 21st** – 25,000 BP\n* **June 22nd** – 75,000 BP\n* **June 23rd** – 75,000 BP\n* **June 24th** – 25,000 BP\n* **June 25th** – 50,000 BP\n* **June 26th** – 50,000 BP\n* **June 27th** – 50,000 BP\n* **June 28th** – 25,000 BP\n* **June 29th** – 15 Rift Fragments\n* **June 30th** – 75,000 BP\n* **July 1st** – 10 Rift Fragments\n* **July 2nd** – 50,000 BP\n* **July 3rd** – 10 Rift Fragments\n\n# EVENT SHRINE OF SECRETS\n\nShrine of Secrets Sale - **25% discount** on every Perk that appears in the Shrine. The Shrine resets every day at 11:00 AM ET.\n\nsource: [Dead by Daylight’s Twisted Masquerade Event 2024 | Everything To Know](https://deadbydaylight.com/news/twisted-masquerade-everything-to-know/)\n\n# KNOWN BUGS\n\n* Performing a pallet/flashlight save simultaneously to the killer using remote hooking causes the rescuer or a 3rd survivor to get hooked.\n* The bug above also causes killers to permanently have a survivor body stuck on them, eventually preventing the match from ending.\n\n# OTHER\n\nDon't forget to check out the new pride charms and badges: [\\#IntoTheRainbow2024](https://www.reddit.com/r/deadbydaylight/comments/1despby/intotherainbow2024/)\n\nTWITCH DROPS\n\nEarn exclusive [Twitch Drops](https://account.bhvr.com/twitch/dbd/until-june30) by watching [select Dead by Daylight streamers](https://www.twitch.tv/team/fogwhisperers) (Fog Whisperers) between June 12, 2024 (17:00 UTC) and June 30, 2024 (17:00 UTC) during Dead by Daylight's \"Into the Rainbow\" charity drive.\n\nhttps://preview.redd.it/u8zq59vg4c7d1.png?width=1080&format=png&auto=webp&s=183f0b30445e069bee1b4f1d6fb491914b2a00f5\n\nNintendo Switch players can obtain these drops by redeeming the following codes in the store:\n\n1. Use code \"DROPTS\" for the TRYKS STAND-IN CHARM.\n2. Use code \"DROPOP\" for the OWLBEAR PLUSH CHARM.\n3. Use code \"DROPMC\" for the MASQUERADE CHORUS BADGE.",
        "num_comments": 567,
        "comments": [
            "Are they not giving out iridescent shards? They mentioned them in the daily rewards section of the news",
            "Shame they don't give Iridescent Shards much anymore ;/",
            "kind of sad that there aren't iri shards being given out this year. rift fragments are kind of useless at this point since you can complete the rift in a couple of weeks nowadays.",
            "Damn, i was kinda counting on them giving shards to buy every original character left. I may have to grind quite a lot to get all of them now",
            "Xbox is missing out how delayed is it gonna be? 😭",
            "Had weeks of prep still delayed on Xbox. Can’t wait for cross progression so I can leave this console stuff behind.",
            "I feel stupid, played a few games, where are the invitations at?",
            "That instahook thing is absolutely insane. Killers got the long side of this one for sure.",
            "When will the Xbox get it",
            "It's not mentionned ; will all of the old characters be half priced ? "
        ]
    },
    "Some people lie awake at night wondering why they get tunneled, I sleep soundly knowing that this is the reason": {
        "title": "Some people lie awake at night wondering why they get tunneled, I sleep soundly knowing that this is the reason",
        "score": 653,
        "url": "https://v.redd.it/f96faw5a9g9d1",
        "content": "",
        "num_comments": 65,
        "comments": [
            "Sometimes that 1k is more satisfying than a 4k.",
            "We got ourselves a one person bully squad right here. Nice name btw.",
            "You are the reason my plan to let everyone live sometimes gets dropped. xD",
            "This may be the greatest single person bully I’ve ever seen. And to be honest it wasn’t cheap. You used all your perks here.",
            "\"Stun the killer x number times\" challenge speedrun",
            "That poor man was just walking down the street, minding his business 😭",
            "Activate quiet mode and ez escape",
            "I ain't even mad. That shit is funny.",
            "Mf hit ghostie with a full on tekkin combo with input commands",
            "...Yeah, nah, if this was me, this would have 100% earned your freedom. Sometimes you just gotta respect masterful gameplay."
        ]
    },
    "Would you eat it if you had the chance?": {
        "title": "Would you eat it if you had the chance?",
        "score": 525,
        "url": "https://www.reddit.com/gallery/1dr0z19",
        "content": "",
        "num_comments": 32,
        "comments": [
            "And Ace being Ace (i find it funny that I understand what he says)",
            "Your art is so cute!",
            "I love disgusted Nea, and Ace is adorable.",
            "I’ve always assumed clown and bubba cook for the anniversary, funny to think abt.",
            "why did Ace turned into Argentino lmfao",
            "ARGENTINA MENTIONED🗣🔥🔥🔥🔥 BOLUDO CUANTAS COPAS🏆🏆🏆TENES‼️⁉️❓️🇦🇷🇦🇷🇦🇷AGUANTE EL MATE☕️☕️🦅🦅🦅🇦🇷🇦🇷🇦🇷",
            "I thought Tryks made them, but Clown sure appreciates the fingers.",
            "I always look forward to seeing your cute art posts!",
            "If ace says it’s good then it’s good",
            "Yeah always figured it was Bubba or Kenneth. Sometimes Lisa"
        ]
    },
    "Who seems like the rarest survivor to you? Legendary skins included": {
        "title": "Who seems like the rarest survivor to you? Legendary skins included",
        "score": 716,
        "url": "https://i.redd.it/uehujww8pe9d1.jpeg",
        "content": "",
        "num_comments": 325,
        "comments": [
            "The only survivor I've never seen in a game is Rose. All of the legendaries are pretty rare though (because the price is awful)",
            "Anyone that requires you too buy survivor and then a 15 usd skin. So cybil, Steve's one, and Alan wakes 2 I'd say are the rarest. But probably Alan wakes 2 are the rarest for me",
            "yoichi, claire and cybil + alan wake & his legendary skins.",
            "Jonathan… I’ve used him forever, and only saw one other the day stranger things dlc returned. :(",
            "Of all legendary survivors, Chris Redfield (and I blame BHVR because that man looks NOTHING like young Chris)",
            "Any of the R6S skins, I've only seen one other Blitz lol",
            "I’ve only ever run into ONE Sheva Alomar in my time of playing.",
            "Jeryl if you've never seen him before, you never will.",
            "My friend mains Cybil so I'm pretty desensitized from her existence. I think for me it has to be Tubarao. Even though everyone and their mom mains Renato, I've run into maybe 1 single Tubarao ever.",
            "Counting Legendaries - The Rainbow 6 guy probably. \n\nBase skins only - Probably Detective Tapp"
        ]
    }
}