{
    "How F*CKED am I ? ": {
        "title": "How F*CKED am I ? ",
        "score": 9,
        "url": "https://www.reddit.com/r/debtfree/comments/1dr4lel/how_fcked_am_i/",
        "content": "Hello everyone! I hope you guys are all doing well. I really need your advice and input on this situation I have found myself in. I am 22 years old now. In 2020, I graduated from high school and started college that Fall semester at a highly ranked private university that was out of state, my dream school. As we all know, 2020 was a crazy year for everyone due to the pandemic. It was a very hard time for me because it was my first time away from home, alone in a new environment where I didn’t know anybody. I was the first person in my family to go away for college, so I didn't know what to expect and the transition was very hard on my mental health. Ultimately, my first semester I ended up getting depressed and I developed an eating disorder, where I over ate to ignore my sadness and even gained 40 pounds. I was so down, I struggled to perform daily tasks like showering or brushing my teeth. This was so weird to me because I had never struggled with my mental health prior to this. To this day, the only person I have discussed the difficulties I experienced in college is with the therapist I started talking to about 7 months ago.\n\nWith all the internal struggles I was dealing with, I did horrible academically for the first two years at university. A whopping 1.7 gpa overall. SMH. After my first year, I was placed on academic probation, and after my second year of still struggling, my financial aid was taken away. I found out on move in day of my 3rd year that I was no longer eligible for financial aid. \n\nThis is where my dilemma now comes into play. Because I didn't receive financial aid for that semester, there was a balance of about $30,000 on my student account. Instead of just dropping out and going back home like I should have done, I stayed on campus and continued to take the classes I had registered for that semester. I'm surprised I wasn't dropped from my classes since that balance hadn’t been paid from the beginning (Still went on to fail those classes as well). \n\nI was in denial and did not want to accept that I needed help and that I wasn't doing myself any good by just trying to continue on in my education. I dropped out of college after I completed the Fall 2022 semester, and I worked full time at a fast food restaurant in the same city. I would get emails from the university every few months about my balance and I would just ignore it (being stupid).\n\nAbout 8 months ago, I decided to finally give the billing office at my old university a call to try and see how I can solve the issue of my large balance, which due to interest had reached about $43,000. I was told that my only two options were to pay the balance in full or to pay in 3 monthly installments ($15,000 every month). I told her I couldn't afford either option and I was told there was no other option for me to solve the issue. I was told the balance would go to collections if I didn't find a way to pay it off, but I really couldn't afford either option. \n\nFast forward to January of this year, I was thinking about going back to college, applied to a different college, and have been admitted to the college! I am doing much better mentally, have been seeing a therapist regularly (best decision ever), and set to graduate in December 2026. I am so grateful to God that I have come out of this depression and that I now have my mind right to complete my education which has always been a dream of mine. \n\nFast forward again to about a month ago, I received an email saying that my balance has now reached $49,000, but now I qualify for a 24 month installment payment plan (a little over $2000 a month). I don't even make $2000 in a month, so I still can't afford to start to pay this balance off. I decided to give them a call again to request a plan that was more affordable for me, and I was told that the least I can pay monthly is $1000 a month, which I still can't afford right now. I will be graduating in about 2.5 years God willing, with a degree where I can get a job with a starting salary at around $70,000. But by that time, my balance would have probably reached around $70,000 - $80,000, and it will probably go to collections before it reaches that point.\n\nI am worried about so many things. I have made a lot of bad money decisions in my depressive state and my credit score is around 600, pretty low. How badly would this affect my credit if this goes to collections before I graduate with a decent job? I've also recently learned about wage garnishing, but it says online that it mostly happens with default student loans, alimony, and child support. Can I still get my wages garnished by a private university? I don't know what to do or where to start or how to start. How fucked am I? Will I ever get out of this? \n",
        "num_comments": 3,
        "comments": [
            "Good luck, man. I'm definitely no expert (trying to pay off debts myself) but not paying is just as bad as going to collections because that's still a mark on your payment history, which is one of the biggest factors that affect your credit. \n\nI've found that when going to collections, the collections companies are more forgiving as far as how much you can pay a month and I had one company completely wipe out the remainder of my balance after paying on time 6 months straight (about 25% of the balance remaining). You're young, and a dark mark on your credit for on-time payments will be wiped out before you know it. I think it hangs round for 7 years before it drops off. That'll give you time to graduate, get a good job, and start saving for a down payment on a house.",
            "Find out what the interest rate is on what you owe to your previous school. Hopefully you can take out a student loan for it with deferred interest while you’re in school. Not sure if you can take out a student loan for this.. otherwise look for a regular loan with a lower interest rate than the school is charging you.. and at the very least pay the interest while you’re in school so that it doesn’t continue to compound.",
            "First of all congratulations on making it through the pandemic and getting into college again, not to mention going to therapy regularly. A lot of people never make it this far.\n\n\nThe road ahead is hard but it is doable, and you've shown you can do difficult things and come out the other side.\n\n\nTalk to the office at your college about what kind of help is available to you. Take anything you can get. \n\n\nAlso, if you're in the USA, have you looked at selling (\"donating\") plasma?\n\n\nSome other subreddits that might help include /r/studentloans, /r/assistance, /r/frugal, /r/povertyfinance and /r/sidehustle"
        ]
    },
    "Best way to get debt free before income reduction ": {
        "title": "Best way to get debt free before income reduction ",
        "score": 1,
        "url": "https://www.reddit.com/r/debtfree/comments/1drdhep/best_way_to_get_debt_free_before_income_reduction/",
        "content": "I am 63 and still putting kid thru school in a foreign country.  This has cost thousands over  the last few years. I have 22K to pay on a personal loan and 30K in credit cards that are past the 0% BalTransfer rate. My job contract ends by the end of the year. what is the best way to get out of ths debt? i own my home and car outright. Can't touch my 401k as it will\nkill me tax wise. any thoughts or suggestions?",
        "num_comments": 0,
        "comments": []
    },
    "What strategies do you use to manage and reduce your debt burden?": {
        "title": "What strategies do you use to manage and reduce your debt burden?",
        "score": 1,
        "url": "https://www.reddit.com/r/debtfree/comments/1drcfi4/what_strategies_do_you_use_to_manage_and_reduce/",
        "content": "I'm working two jobs and still struggling with saving and paying debt.",
        "num_comments": 2,
        "comments": [
            "I break my payments down weekly and pay them weekly. If my credit card is $300, I divide that by 4 and pay it weekly. It still gets paid off, just in smaller increments so that a massive lump sum isn't hitting my account once a month. If I was paid every two weeks, then the credit card is paid every two weeks, so sometimes two times per month and sometimes three times per month. I have been paid twice a month so I would break down my payments by 2 instead of 4. \n\nHope that makes sense and possibly helps.",
            "1) Budgeting- ensuring my monthly and recurring expenses aren’t greater than my income and/ or supplementing extra income. Stick to it too, easy to sway and have discretionary spending but do that when you have no debt and can FIRE\n\n2) Debt/ Avalanche Method paying down debt- identifying what method works best for me (high interest debt and paying that down makes me feel better but YMMV)\n\n3) Pay yourself first- counterintuitive but if you put money in your savings, investments, etc. you’ll inevitably to find ways to drive additional income or make things work.\n\nFWIW this has worked for me but just some ideas and every situation is different"
        ]
    },
    "Woo!": {
        "title": "Woo!",
        "score": 56,
        "url": "https://i.redd.it/fj6t8nwk2c9d1.jpeg",
        "content": "Pretty happy today! Still more to go but I can’t believe I got down to one card! Just gotta fully that one off and I’m done! I’ve learned my lesson ✅",
        "num_comments": 5,
        "comments": [
            "Nothing to add except, I like the way you organize and label information. Your penmanship is impressive too. Congrats on reaching your goal 🎉!!",
            "How’s your credit score? I’m happy for you that you got your utilization rate down to 30% but if I were you I would focus on raising my limits and dropping my rates. Set an alarm on your calendar for twice a year to remind you to call each of your cards and ask for a limit increase and/or a lower rate. \n\nWhy do you have so many cards? The problem with that is that you don’t want to be closing accounts as they’ll negatively affect your score and if you don’t use them at all, eventually the credit card company will close it out on their own. I found this out the hard way when Discover closed my longest standing account for lack of use. It’s just a lot of cards to keep track of.",
            "It’s 709 right now! And yeah I’ll be extra careful about using them. And I just kept getting accepted for them so I thought it was a good idea at the time 😬",
            "Now you have them, it’s gonna be alright. Just keep calling them every 6 months and ask them to raise the limit or lower your rate. And make sure to use it at least once a year so it doesn’t get canceled. The long history of your accounts will count positively in your score too.",
            "Thank you so much!"
        ]
    },
    "Programs like Debtors Anonymous but without the religious aspect?": {
        "title": "Programs like Debtors Anonymous but without the religious aspect?",
        "score": 2,
        "url": "https://www.reddit.com/r/debtfree/comments/1dr3btw/programs_like_debtors_anonymous_but_without_the/",
        "content": "My therapist suggested I look into Debtors Anonymous but I am struggling with the aspect of the 12 steps being so faith-based. I am an atheist. Any other suggestions?",
        "num_comments": 3,
        "comments": [
            "12 step programs are not faith based. You can be an atheist and let it work for you. Do you abide by principles in your life such as honesty, acceptance, goodwill? If so and even if not you can use those as the fundamentals of  a 12 step program.",
            "Is there a not for profit credit counselling society in your area? They usually host support groups.",
            "--I don't know what your financial situation is, but have you tried a certified financial therapist? NerdWallet has [this](https://www.nerdwallet.com/article/investing/how-financial-therapist-shift-your-money-mindset) on trying to find a certified financial therapist to help you with your spending; be careful of the links--it's how they make money.\n\n--I would also go over to r/FinancialTherapy to see what they can do, if anything, for in the meantime while trying to see if you could schedule an appointment with a certified financial therapist."
        ]
    }
}