{
    "Weekly Books & Reading Discussion Thread": {
        "title": "Weekly Books & Reading Discussion Thread",
        "score": 73,
        "url": "https://www.reddit.com/r/delhi/comments/14rt8yd/weekly_books_reading_discussion_thread/",
        "content": "Hey r/Delhi! \n\nThis is your space to discuss anything related to books, literature, articles (long or short form), writing prompts, essays, novels, and short stories!\n\nDid you finish an awesome book or a short story recently, or are you eager to start one? Tell us all about it! Read any great long-form articles lately? Do share here! Got no idea what to read next? Ask for recommendations!\n\nCheck out r/IndianBooks, for discussion about books, Indian and non-Indian, and anything reading-related.\n\nAlso, visit r/Bharat, to read and share well-written, insightful long-form articles about India.\n\n**Books Thread is posted every Thursday morning.**",
        "num_comments": 254,
        "comments": [
            "I recently finished The Alchemist by Paulo Coelho and it's easily the worst book I have ever read. It's a terrible self-help book trying too hard to be masquerading as a philosophical tale. I will never ever trust those people again who suggested this to me.",
            "Currently reading 12 rules for life by Jordan Peterson. One of the best books I have ever read, and I have read quite a few. Wholeheartedly recommend to everyone.",
            "Read my first ever actual book, The metamorphosis by Franz Kafka\n\nIt deals with themes such as isolation, alienation and the absurdity of life.",
            "Avadhuta Gita - One of the best and most radical non-dual advaita vedanta text.",
            "Anybody reading Doestovesky? Started reading the idiot .",
            "I finished reading my first ever Jane Austen novel Pride and Prejudice last week and I think I don't want to come back to the real world just yet.",
            "Guys read the book\" Kane and Abel\" by Jefry Archer. You honna love it. It tells the story two people born in two different parts of this earth & how their journey meets with an intense rivalry. It has a gripping storyline which makes it exciting to read.\n\nhttps://preview.redd.it/i0w8j9p1zuwb1.jpeg?width=706&format=pjpg&auto=webp&s=47813460f38a5d6d0ccae5f04d45df5fddd83784",
            "Bhai ye WEEKLY thread 7 mahine purani kyu hai?\n\n&#x200B;\n\nHar hafte nayi thread nahi aani chahiye?",
            "My all time favorite book: Norwegian wood by murakami",
            "Whoever likes to understand selves through psychology may like to read this book called Emotional by Leonard Mlodinow. It is affective neuroscience approach to what emotions bring to the table from existence perspective, and how we can use them better. And it’s quite well written 200 something pages book, easy to understand for laypeople."
        ]
    },
    "What is the funniest Bisleri ripoff have you ever seen?!": {
        "title": "What is the funniest Bisleri ripoff have you ever seen?!",
        "score": 293,
        "url": "https://www.reddit.com/gallery/1dr4gyn",
        "content": "Here are my top favourites",
        "num_comments": 68,
        "comments": [
            "https://preview.redd.it/5bz2wq2ugg9d1.jpeg?width=960&format=pjpg&auto=webp&s=24cc614af97ced7a84557623734059b324109859",
            "Bistar pe Bihari Bestie ke Nunu ka paani... bada swaadisht!",
            "https://preview.redd.it/cgbvgl5zbg9d1.jpeg?width=1920&format=pjpg&auto=webp&s=2c4acffb3a214e748d6ddc75187a8719c777092e",
            "https://preview.redd.it/tqcerhjehg9d1.jpeg?width=3024&format=pjpg&auto=webp&s=88524002f047981b8d356e775499864f3a90da1c",
            "nunu 🤤",
            "https://preview.redd.it/u12pk08png9d1.png?width=1080&format=pjpg&auto=webp&s=5e7ebd4e542142298cd46bfb0c349c5aee8a6a2c\n\nMine is from Germany 😎",
            "https://preview.redd.it/vn9n7h3lng9d1.png?width=1080&format=pjpg&auto=webp&s=a3e6ca0ca6ca70af7e9067653a4027c91d878583\n\nBisleri will have panic attack seeing these",
            "Bihari har jageh hai",
            "They've come to the point where these ripoff words have meanings now.\n\nAnd \" Bihari \" like seriously ? Who tf came up with this.",
            "Bhai NUNU sa paani nahi peena"
        ]
    },
    "My Own relative missing, re-shares appreciated": {
        "title": "My Own relative missing, re-shares appreciated",
        "score": 2008,
        "url": "https://i.redd.it/ygzycyf8jc9d1.jpeg",
        "content": "",
        "num_comments": 170,
        "comments": [
            "May he reach home safely.",
            "15 years old male and 6ft tall.\n\nDid he leave home after a fight with the parents? Because its a bit unlikely that someone kidnapped a 6ft tall boy.\n\nHope he is found soon.",
            "I go to Sadiq Nagar to purchase books and stationary stuff from vijay bookstore , ask there if they can put out missing person pamphlets out in front of their store , it might be helpful. \nI have friends living in Sadiq Nagar too",
            "OP if he carries a cellphone, you can get your relatives to try tracking that. Also, would recommend including more angles of his face in the missing poster. \n\nHis complexion isn’t even fair in this photo they have shared. A more accurate description, more angles of his face along with a mention of the area he was last seen in would be more helpful on the missing poster than just this.",
            "very unfortunate. include some more description like his last seen wearing clothes and last seen location. also mention some reward. also try to write it in hindi + english and circulate it around neighborhood. by that time you can do is contact friends personally and ask for any info. if he is carrying cellphone and is minor then police will able to track not exact but nearby location within minutes. hope he comes back.",
            "have you tracked his phone?",
            "6ft at 15 damn but I really hope he reaches home safely\n\nschool me koi gf thi kya aaj kal me bharosa nahi isliye pata karlo",
            "Guys, cfbr doesnt work on reddit...\n\n\nI hope he reaches home safely",
            "I hope he is well.",
            "Upvoted and sharing, hope he is well and comes back home safely."
        ]
    },
    "Wow, we are in mainstream media now": {
        "title": "Wow, we are in mainstream media now",
        "score": 80,
        "url": "https://www.reddit.com/gallery/1dr4utk",
        "content": "",
        "num_comments": 33,
        "comments": [
            "that journalist smiling in the corner, careful guys he is among us.",
            "Find the journalist aka imposter!\n\n![gif](giphy|ysiCYZUJkW3XRb7k9K)",
            "I believe the reason for this is that there is someone among us who is a journalist or content writer and decides to write about incidents from reddit at their own discretion, such as the incident of a guy getting scammed by uber at the airport, a minor getting assaulted in the metro, and the moon picture.\n\nAlso, how have you been? It's been a long time.",
            "One of my reddit post was posted as an article in NDTV News and News 18. While I don't have any problem with that, I wished they atleast seeked my permission before copy pasting every bit of it",
            "Hello 👋🏻, long time no see... How's it going!\n\n>Wow, we are in mainstream media now\n\nAnd reddit's been lackluster since. No? But I do remember that first post tho...🗿",
            "I was watching a video on creative writing techniques and the video cited a reddit post---like directly, without any changes, acknowledging his anon. user name.",
            "Bhai chalo thik h mainstream ho rha h yaha itne to assault ke posts aate h harrasment ke uske bhi banao na. Drainage system ke bure halat h unke banao bc ek bande ne Naya ac leliya and bijli ka bill jayada aagya. Saalo asli problem par baat kro na faaltu ki chijo par baat kr rhe hutiye",
            "Easy content hai na unke liye, plus no one is going to claim copyright",
            "I don't want reddit to become mainstream in india \n\nI have no other option left except emerald /s\n\nNo ig,Snapchat,fb,twitter",
            "Reddit se inki dukaan chal rhi hai ajkal."
        ]
    },
    "\"Fake Vibes Matching Scam\" sees some progress ": {
        "title": "\"Fake Vibes Matching Scam\" sees some progress ",
        "score": 127,
        "url": "https://i.redd.it/ifhsq2b8nf9d1.jpeg",
        "content": "Kudos to the complainant and thanks to Delhi Police atleast one fraud has been caught. Hope all such gangs and all their actors are caught and punished. \"Vibes wagera match karenge\" scam",
        "num_comments": 23,
        "comments": [
            "\"a see-once picture made him bunk\" lol",
            "Link to online report\n\nhttps://timesofindia.indiatimes.com/city/delhi/right-swipe-for-wrong-reason-dates-fleeced-of-lakhs-at-cafes/articleshow/111353854.cms",
            "Lmao the last line",
            "Vibezzz match ho gyi?",
            "At first I was like oh no these people are getting scammed, need strict actions !. But now its kinda funny tbh. How can you still get scammed when its all over the internet ?",
            "Good one but I pray for people not on Reddit and there are many . Why don’t these dating apps mandate identity verification/kyc ? This way people can’t lie or create multiple accounts.. answer : they don’t want to lower their customer base and increase cost.. ",
            "How the heck police doing all this work? Guy must be having deep connections",
            "Ye hai woh husn pari.\n\nhttps://preview.redd.it/4eyjxnwylg9d1.png?width=1080&format=pjpg&auto=webp&s=214b07e077c10eb84cea5cf485099d78f31a1012",
            "Itna bada article kon padhe yaar. Par tune jo bola sun ke aacha laga",
            "![gif](giphy|yo3YRT766BSpMamfv3|downsized)"
        ]
    }
}