{
    "Dell Monthly Buying Advice Thread!": {
        "title": "Dell Monthly Buying Advice Thread!",
        "score": 5,
        "url": "https://www.reddit.com/r/Dell/comments/1dbk130/dell_monthly_buying_advice_thread/",
        "content": " Welcome!\n\nPlease post all requests for help regarding buying laptops in this thread. Individual posts of this nature may be removed at the moderators' discretion.\n\nSome good starter tips would be to,\n\n1. State what laptop you are interested in buying (if applicable)\n2. State what you will be using it for (e.g. word processing, internet browsing, intensive gaming, etc.)\n3. State what country you are located in, as well as your province/state.\n\nEveryone is encouraged to help!",
        "num_comments": 18,
        "comments": [
            "Daughter starts college in the fall, majoring in electrical engineering. We are an Apple family and are somewhat lost on all of the Dell options. She wants a 16” laptop so we’ve focused on Precision, XPS, and Latitude options. \n\nMinimum requirements: 32 GB memory, 1 TB storage, Intel 7 or 9 processor, Nvidia graphics card. \n\nSince a computer is one of the approved 529 expenses, cost isn’t a major factor. \n\nSorta focused on Precision 5680 but appears it may be due for a refresh. Would need to buy by mid-August so we have some time. \n\nThoughts?",
            "Ok I don’t know if this suits here but:     \n\nWhat is one laptop you recommend NEVER getting, like, the 12 inch MacBook of dell laptops, which is the WORST",
            "Is there somewhere a comprehensive list of the Precision or XPS line covering the options with 13-16\" screens and dedicated GPU from 2019-2023?\n\nBasically, I would love to find a similar chassis to the 9550 with similar I/O.\n\n1. Dell Precision or XPS (hopefully smaller than the 16\" versions)\n2. Photography and minor video editing, Internet browsing, beginner comp sci classes and into machine learning (starting a master's in public health)\n3. Oregon State, USA\n\n4. Coming from: XPS 9550 (2016), 16GB ram, 2TB SSD \n5. Wanting: 32GB+ ram, Intel core i7, dedicated GPU (3050+?), full SD card reader, 2TB+ SSD\n6. Don't need: newest model year, touch screen, oled, Intel core i9, separate number keypad\n7. Avoiding: touchbar Fn keys of the modern XPS line, AMD",
            "I bought an Inspiron 16 Plus 7630 at Costco last week, but now I'm wondering if I'm better off with a Latitude.  I paid $999.97 for the Inspiron.\n\nIt has a 1 TB SSD and 32GB RAM.\n\nIs the Latitude a better laptop?  I only need it for internet browsing (Youtube) and Quicken, mainly.  But I'm not happy with the Inspiron's limited ports.  At least the Latitude has an ethernet port built in and two USB C ports, where as the Inspiron only has one USB C port and also comes with a USB C power adapter.\n\nI'm repurposing my old Lenovo ideacentre as a monitor so screen size isn't super important.\n\nThanks.",
            "I want a dell laptop for personal use and mainly required for MS office use as I am a research analyst. I want to know which edition would work\n\nI live in India",
            "I've had a Dell Inspiron 15 5559 for about 8 years. I've been very happy with it. Not a single problem with the hinges. But it's becoming slower and has some issues now, so I'm searching for a new laptop. I'm just considering Dell, given my satisfaction with the durability and reliability of this Inspiron laptop, but I'm seeing some terrible reviews about the company, so I was wondering if Dell's reputation has fallen in the last few years...\n\nI would like a laptop to use at work and for my spare time. I am a data scientist and might work with large files, so I'm looking for 1 TB of SSD storage and 16 GB of RAM. Specs-wise, I don't think I need too much for my day to day: I mainly program some code and use Office. Since I often use media (watching videos), I would appreciate having a good sound and screen (16 inches). And of course, I would like something reliable (although having a laptop for another 8 years is probably asking for too much)\n\nGiven these needs, I was considering either the Inspiron 16 2-in-1 or the Inspiron 16 Plus (the new 7640 series). The specs are very similar (they seem to be powerful) and probably beyond what I need for my day to day life. The design looks elegant. The 16 2-in-1 probably has a better screen (2.5k, mini-LED, HDR600, 90Hz; maybe at the expense of shorter battery life?), but I'm not sure if I will make the most of a 2-in-1 with a 16-inch screen. And maybe it will have more problems with the hinges. Anyway, what worries me is that I'm reading a number of very negative reviews on the Inspiron 16 series, and I'm not sure about how representative they are of the general situation. The Latitude series seems to be more reliable (according to what I see here), but having only 500 GB of SSD is my main concern. And, at first sight, the Inspiron seems to offer better specs for a similar price range. I'm not considering the XPS series or more powerful Latitudes due to budget limitations. I would appreciate your help a lot! I live in Spain.",
            "Hello. I’m a newbie here. 👋🏻 I’m in California.\n\nI think my old Dell Latitude E5440 laptop needs replacing. I bought it second hand at least 4 years ago from an IT guy.\n\nPlease go easy on me. I’m not used to buying computers. And I’m not very good at shopping for them so I usually go for a second hand Dell on Craigslist. I’ve NEVER been ripped off in doing so. Maybe it helps I live in the Silicon Valley. Who knows, maybe I’ll buy another one that way.\n\nMy budget is up to $1K. What I would like is a laptop with a touch screen and a backlit keyboard and no keypad. I’ll be using it at home for personal use and my affiliate marketing biz which is just taking off now. Once in a while I go to a cafe or a library with my laptop and I expect to be doing more of that. I’ll be multitasking with one or two softwares running. Uploading, downloading links and documents. Not sure what else to say. I don’t use graphics much. I want something as fast as possible within my budget. I don’t know what else someone needs to know from me about my computer needs to choose the best product. I watch YT videos on my laptop and videos from courses I have purchased that I access via the company’s website. I want to be able to link my JBL Flip 5 to it. I use Zoom and GoTo very frequently. Internet browsing. No gaming at all. I would like really good speakers.\n\nAre there any Dells that can Bluetooth link to Jabra hearing aids?\n\nThank you! 😊\n\nCan I assume all Dell laptops will have:\nHeadphone outlet\nBluetooth\n\nWhen buying a Dell directly from Dell and you need to return a computer is there a restocking fee?\n\nWhen buying a new Dell laptop does the price change when choosing Windows 11 Pro over Home?\n\nAnd do I have to pay a yearly fee for a Microsoft Suite or is it a one time fee?",
            "Possibly an overkill purchase (the machine is really designed for working use, not for studying), it should serve her well. However, there are a few negatives: its weight, its battery life (will probably be less than 6 hours), and its tendency to run hot with loud-ish fans (because recent Intel CPUs tend to use decent amounts of power).\n\nIf the machine will stay most of the time on a desk, it'll be fine. But when you want to use it as a portable machine, the size and weight of it might make a smaller machine a better choice - after all, the machine's full computing power is unlikely to be required for the course and maybe a smaller, lighter, more portable and less powerful machine will serve as a better study computer. I suspect that most of the time, the web browser or some productivity apps will be the main uses of the machine.\n\nThere are similar machines from Lenovo and HP but they have the same negatives (workstation laptops favor CPU+GPU power over smaller weight and longer battery life).\n\nAs long as she knows what she's getting and the possible negatives of it, you can make an informed decision.\n\nA refresh may be pending but it might not be significantly better and there's no way to know until it comes out.\n\nHTH.",
            "I don't know of any such list but you're more or less asking for XPS 15 from 2022 to 2023. Since those machines have SO-DIMM slots and 2 M.2 slots, you can buy an underspec'd machine and upgrade yourself (or pay someone to do it). Why do I mention this method? Because Dell have discontinued the XPS 15 and no longer offer it for sale (and there aren't any in the Dell Outlet as I write this although they **might** come back into stock if Dell receives units in for exchange or repair). It looks like [Amazon \\[US\\]](https://www.amazon.com/s?k=xps+15&sprefix=xps%2Caps%2C299) do still sell them so you might have to go this route - in particular, getting one with a RTX GPU will be a struggle as they begin to sell out (I see only a few offerings on Amazon with a RTX).\n\nThe equivalent to the XPS 15 are some Precision models like the [5570](https://www.dell.com/support/home/en-us/product-support/product/precision-15-5570-laptop/docs) which have similar chassis and parts but with some workstation components (GPU typically).\n\nGood luck finding/getting one.",
            "The general opinion in this sub is that the Latitudes are better built (so better longevity) and are no-nonsense machines (comes with less crapware). It sounds like you already kind of know the answer but yeah, it's probably worth spending perhaps a little more to get a better machine. The 5000 or 7000 series of Latitudes are generally well regarded. The 3000 series? Not so much.\n\nApparently the Inspirons have a reputation for failing hinges because the mechanism or material used is a cheaper one than better built laptops (but that doesn't mean every Inspiron will have a failing hinge).\n\nHTH."
        ]
    },
    "inspiron 14 7430 2 in 1 not charging - ac adapter not connected ": {
        "title": "inspiron 14 7430 2 in 1 not charging - ac adapter not connected ",
        "score": 1,
        "url": "https://www.reddit.com/r/Dell/comments/1dr5g63/inspiron_14_7430_2_in_1_not_charging_ac_adapter/",
        "content": "I've had it for about half a year now with little to no issues, but last night when I tried to plug it in the charging led didn't light up and no power was going through - I tried again this morning with a new cable and a different plug, and it still wasnt getting power(I'm currently in another country, so thought maybe the adaptor plug i was using had something to do with it, but when I used a direct plug it still didn't work).\n\nthe battery was critically low at this point, but I managed to do a diagnostic check (which returned ⚠️ charger - unable to detect charger) and to check the bios, which said that the ac adapter was not installed \n\nwhere can I go from here? the laptop is completely dead now, so updating the bios (which is the only troubleshooting step I can find on the dell website) isn't possible, and since I'm overseas I'm fairly limited in what I can do. while I don't need the laptop right now, it would be incredibly useful to have, and I do need it functioning again by the end of July at the very latest. is there any way I can get it running again on my own, or do I need to take it to a repair store?",
        "num_comments": 0,
        "comments": []
    },
    "I purchased my bff a laptop because her computer was going caput and I wasn't using my dell credit line. Will she have access to the dell support assist and warrenty stuff?": {
        "title": "I purchased my bff a laptop because her computer was going caput and I wasn't using my dell credit line. Will she have access to the dell support assist and warrenty stuff?",
        "score": 2,
        "url": "https://www.reddit.com/r/Dell/comments/1dqzmct/i_purchased_my_bff_a_laptop_because_her_computer/",
        "content": "Will she have access or will she need my log in details if she needs support?\n\n  She's my sister from another mister, I trust her with my life, normally she's the one buying me gifts, this was a huge surprise, and we know each others log in info for basically all our accounts.  But I'm hoping she'll be able to do it on her own because I have mine set up with extra verification to be safe. ",
        "num_comments": 5,
        "comments": [
            "Warranty support is tied to the service tag, not the payment type. Supportassist is free and applicable to all Dell machines. \n\nShe should be fine :)",
            "I'd ditch SupportAssist and use Dell Command Update Windows Universal. If diagnostics need to be ran, use the F12 Diagnostics at boot up.",
            "Thank you. I actually found a transfer ownership form on the dell website, hiding in plain sight when I was looking over order info to give her.  It's just a basic inspiron so she hopefully won't have too many issues and she doesn't plan on doing anything more than basic web browsing. She got it set up okay and seems happy with it.",
            "Yea, I was going to say, you should do an ownership transfer to keep it legit. Easy to do.",
            "+1 on that"
        ]
    },
    "coil whine on monitor S2425HS?": {
        "title": "coil whine on monitor S2425HS?",
        "score": 1,
        "url": "https://www.reddit.com/r/Dell/comments/1dr25u8/coil_whine_on_monitor_s2425hs/",
        "content": "My monitor (S2425HS) have some electronic sound, I can hear it when I sit close to it. When it's in standby mode (black screen), the sound pulsates on and off, kinda annoying. Im wondering if its normal coz its a bit annoying to take it and return it. Any tips?",
        "num_comments": 0,
        "comments": []
    },
    "Best laptop for 3D design ": {
        "title": "Best laptop for 3D design ",
        "score": 0,
        "url": "https://www.reddit.com/r/Dell/comments/1dr1k3p/best_laptop_for_3d_design/",
        "content": "What’s the best laptop for 3D modeling? Preferably under $2k or around there. Looking to run AutoCAD, 3dsMax, Rhino, etc.",
        "num_comments": 1,
        "comments": [
            "Dell Precision 7xxx series laptops. \n\nhttps://www.delltechnologies.com/asset/en-us/products/workstations/industry-market/selecting-the-right-workstation-for-design-visualization.pdf"
        ]
    }
}