{
    "REMINDER: Kris uses they/them! Please respect it! ❤️": {
        "title": "REMINDER: Kris uses they/them! Please respect it! ❤️",
        "score": 2223,
        "url": "https://i.redd.it/fo5p6xwjqzha1.jpg",
        "content": "Punny [made a post about this a while back](https://redd.it/s945gf), but we've been seeing this more and more lately and people could really stand to remember this, so I'm making a new post about it to bring it to people's attention again.\n\nKris is exclusively referred to with they/them pronouns inside and outside of the game. Until confirmed otherwise, Kris should be referred to with they/them pronouns.\n\nIf you're wondering why it matters, or anything else, for that matter, [this very well-written post* contains the answer to almost any question you could have; please give it a read!](https://www.reddit.com/r/Deltarune/comments/uj8m5i/frisk_chara_and_kris_are_nonbinary_and_why_it) It's not long, and is broken down into easily digestible images.\n\nIf you get into arguments about it, nothing is going to become of it. It will be removed. It just makes a lot of extra work for the mods, and makes a bunch of people angry. So please don't do that!\n\nThank you for understanding <3 If you still have any questions, feel free to ask them under this post, assuming I haven't had to lock it. Trans rights are human rights, have a nice day, bye! ❤️\n\n*^(Although the post specifically discusses the topic of Kris being nonbinary, which is not considered an objective fact by the mod team\\*\\* & subreddit rules, it effectively answers many questions about Kris using they/them anyway, so I've linked it.)",
        "num_comments": 840,
        "comments": [
            "If you make a mistake, that's fine, everyone does sometimes. Though, if someone corrects you, please fix it! Thank you ❤️\n\nEDIT: This post was reported as \"Sexual or suggestive content involving minors\". If you believe this, **leave.** You are **not** welcome here.\n\nEDIT 2: Number of people banned so far in this comment section: 11 ❤️\n\nEDIT 3: Read [the last two slides of this post](https://www.reddit.com/r/Deltarune/comments/uj8m5i/frisk_chara_and_kris_are_nonbinary_and_why_it) before commenting, please.\n\nEDIT 4: The post has been deleted, so here's what it said in an image. This was originally by @determinators on tumblr, who has deleted all of their everything now.\n\nhttps://preview.redd.it/v9pn5n2j19na1.jpeg?width=540&format=pjpg&auto=webp&s=40f10971db7163fbecb121c7ce4ef367f115d398\n\nClick on it to see it better; skip to the part that says \"Why does it matter?\" if you can't bear to read the whole thing.",
            "It's interesting to me that players deciding kris' gender against their (kris') will fits with the narrative of the game, too",
            "“You misgender people because you don’t care.”\n\nhttps://preview.redd.it/7b1hxfkwb5ia1.jpeg?width=750&format=pjpg&auto=webp&s=35a14f533cac528a7cf145300b538075ef34b6e2\n\n“I misgender people because sometimes I don’t even remember my own preferred name. We are not the same.”\n\nEdit: It’s ok to forget Kris’s pronouns. It’s not ok to double down on misgendering them",
            "as someone named kris who uses they/them pronouns, i got VERY freaked out for a second til i saw what sub i was in",
            "i can't believe people unironically make such a fuss over how people refer to some fictional character",
            "What a kind hearted and friendly reminder, I sure hope nobody takes ill to it, for sure.",
            "it's also canon so people just be wack ig",
            "[deleted]",
            "I think something some people should think about is why people may accidentally misgender Kris in the first place\n.\nFor example, in my case I thought Kris was a boy because they're appearance in both the light and dark world looks quite boyish to me, and also their behaviors that they are seen or are mentioned doing in-game seemed so to me as well, things such as liking knifes and pulling pranks like flushing bath bombs in the toilet and butting ketchup on their arms and saying it's blood.\n\nI also thought that them being called they/them by other characters in-game was simply because they didn't know what Kris' gender was or that it was a case similar to Frisk and Chara where it's up to interpretation",
            "I occasonally screw up with that, which is a bit embarrassing given that I'm a trans girl and should be used to using the proper pronouns lol."
        ]
    },
    "Deltarune Spring Mini-Newsletrer megathread": {
        "title": "Deltarune Spring Mini-Newsletrer megathread",
        "score": 1022,
        "url": "https://i.redd.it/3smt1ijnav0d1.jpeg",
        "content": "It's here, go check it out!",
        "num_comments": 315,
        "comments": [
            "New reaction image just dropped\n\nhttps://preview.redd.it/72smqevgbv0d1.jpeg?width=720&format=pjpg&auto=webp&s=118c5f93476a1a28944baaf548d34026cd66f5fb",
            "https://preview.redd.it/ats8bshrdv0d1.png?width=578&format=pjpg&auto=webp&s=fcc49433b4b0a35c074b8273d5b76aa5160b82a0\n\nA GAME THEORY!!!",
            "Link to it: https://toby.fangamer.com/newsletters/spring24/",
            "loved the papyrus interview. very many hillarious moments and references. can't believe toby finally introduced sans and papyrus' third brother, Cursive.\n\n&#x200B;\n\nhttps://preview.redd.it/i4tirvyzmv0d1.png?width=320&format=png&auto=webp&s=88c5acb44db6b6cf07f1b700b8b9f44ec036d68c",
            "I am glad that the newsletter is a bit more specific with how much is done with the curscenes, gameplay etc. Much less vague than just \"we are getting closer\"\n\nAlso, cursive sans",
            "https://preview.redd.it/nk7baw3ckv0d1.jpeg?width=1080&format=pjpg&auto=webp&s=0fe2db6d16fd05bac4ee99b7b3d93c09647f0ea5\n\nYooo new headcanon papyrus keeps mew mew as a pet cat",
            "Papyrus: nooo you were supposed to obey me!\n\nSeven flowey the flowers:",
            "The question where Papyrus describes what a circus is, and refers to a clown that's been caged for being annoying, only to reveal he's talking about Sans just reminds me of the Reverse Boss Order Theory. Cause that has to be a reference to Jevil right?\n\n(For those unaware of the theory: King -> Asgore, Jevil -> Sans, Queen -> Mettaton EX, Spamton NEO -> Mettaton NEO, Tenna -> Mettaton?)",
            "https://preview.redd.it/cooyuezcfv0d1.jpeg?width=3072&format=pjpg&auto=webp&s=ea530c21112bcfed94c83d5cd41f9a8df43237f8\n\ncant **make believe** it",
            "https://preview.redd.it/f9ucirr4cv0d1.png?width=531&format=png&auto=webp&s=4570aaccb63beb5a81a9322e0dd804a63860e10b"
        ]
    },
    "The": {
        "title": "The",
        "score": 396,
        "url": "https://v.redd.it/mzq68apo628d1",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Why does it sound Pokémon battle esque",
            "I do love Gooseworx's cover.",
            "The Jevil Revolving",
            "The planet îs turning?",
            "CHAOS CHAOS!",
            "Full version?",
            "jevil after commitng 500 crimes in one day",
            "Fun Fact: The remix of \"The World Revolving\" you are hearing was made by the creator of \"The Amazing Digital Circus.\"",
            "https://preview.redd.it/iuev3jmr738d1.png?width=1080&format=pjpg&auto=webp&s=d0b541ccbf8ec5054b21c9c257e77e2400ead5bb",
            "Was so good I made a Gif out of it."
        ]
    },
    "Erhm... What?": {
        "title": "Erhm... What?",
        "score": 122,
        "url": "https://i.redd.it/abvhwzeqh38d1.png",
        "content": "",
        "num_comments": 8,
        "comments": [
            "“EPIC games Launcher!!!!”\n\nhttps://preview.redd.it/ourbzxunj38d1.png?width=1714&format=png&auto=webp&s=de7df983e84ab6c48e162cab449e27ff63f0da64",
            "Does that imply Kris has an Epic Games launcher?!",
            "Spamton confirmed in Fortnite",
            "Erm what the sigma",
            "Who messed with the name manipulation device",
            "Oh it is freak Friday again.",
            "oh shoot I hadn't realized and thought Azzy's game was just epic",
            "SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP SHUT UP GET OUT OF MY SKIIIIINNNN"
        ]
    },
    "Took a DougDoug clip and made it into a meme": {
        "title": "Took a DougDoug clip and made it into a meme",
        "score": 106,
        "url": "https://v.redd.it/ovg5ai78738d1",
        "content": "",
        "num_comments": 5,
        "comments": [
            "God this Is perfect do more",
            "I love DougDoug. His content is amazaing",
            "susiesusie",
            "The fact that chat is a deer with, maybe, cancer make me feel sad, also why is d###d### Susie ? Is it because he's always aggressive?",
            "For real"
        ]
    }
}