{
    "Free Talk Friday": {
        "title": "Free Talk Friday",
        "score": 4,
        "url": "https://www.reddit.com/r/DenverBroncos/comments/1dqj33k/free_talk_friday/",
        "content": "Welcome to Free Talk Friday!\n\nFeel free to comment about whatever you want here, related or not to the Broncos.",
        "num_comments": 12,
        "comments": [
            "There have been so many Magpies chirping around my house, like anywhere from 5-12 at a time. I think there's some kind of Magpie turf war going on.\n\nSide note: Magpie Turf War would be a great band name",
            "I saw Future Islands perform last night in Nashville. Great show! Check them out if you've never heard them.",
            "I shouldn’t be annoyed I got screwed by my DHGate order. I got the old jersey but the price isn’t worth the effort to rectify it.",
            "Happy Hell in a Cell day to all who celebrate",
            "I remember seeing Magpie Turf War open for Suburban Legends at the Gothic in 2005.",
            "Yeah that sucks! Mine arrived yesterday (used the same seller as the OP when they compared real vs knockoff quality) and it looks...pretty damn good? If I had paid $130 for it I would complain about the quality but not for $20. \nSorry to hear you got the old jersey for some reason. ",
            "I mean it’s still decent for $20.",
            "How's the size? Should I order a size up?",
            "It's not my size, so I need my brother to try it on (I ordered it for him). If anything I'd say order a size down. I'll give you a better answer Monday. (I double edited my last reply, get a MacKinnon!)",
            "Ohh MacKinnon's a good idea lol"
        ]
    },
    "[Broncos] 🚨 Our full #BroncosCamp schedule is here with 16 open practices! 🚨  Free mobile tickets & free parking will be available at Broncos Park Powered by CommonSpirit.   🎟️’s will be available to the public beginning Thursday at 10am MT.": {
        "title": "[Broncos] 🚨 Our full #BroncosCamp schedule is here with 16 open practices! 🚨  Free mobile tickets & free parking will be available at Broncos Park Powered by CommonSpirit.   🎟️’s will be available to the public beginning Thursday at 10am MT.",
        "score": 39,
        "url": "https://i.redd.it/djnnsfx54y8d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "First time going to training camp and trying to find cushions to bring with us. How strict are they on no zipper ones? All the ones I find have them",
            "Justin Simmons is still not under contract.  Is he taking a year off?  Sounds like it."
        ]
    },
    "Bo Nix favored over Zach Wilson, Jarrett Stidham to start Week One for Broncos": {
        "title": "Bo Nix favored over Zach Wilson, Jarrett Stidham to start Week One for Broncos",
        "score": 15,
        "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/bo-nix-favored-over-zach-wilson-jarrett-stidham-to-start-week-one-for-broncos",
        "content": "> In the three-way quarterback competition in Denver, Nix is a -400 favorite at DraftKings.com. New arrival Zach Wilson is a +450 underdog, while Jarrett Stidham, who started the final two games of last season for the Broncos, is the long shot at +650.",
        "num_comments": 12,
        "comments": [
            "Not sure how to trust DraftKings with evaluating QB play without training camp yet to happen. ",
            "Seems like insane value on Stidham",
            "I don’t believe in the concept of  developing a QB on the sidelines, learning as a backup. Maybe for the first feee weeks but real game time reps and experience is how these guys learn he game. If Bo is our future, he needs to be our starter by week 6 if not right out the gate.",
            "Unless Bo Nix gets injured, he pretty much needs to start or it would be a bad look for him.\n\nHe is supposed to be a pro-ready QB, not a raw one.",
            "Even if Nix is ready, maybe wait 8 games or so.  If the roster is a bad as they say, Nix is on a suicide mission that may damage him the rest of his career.\n\nLet Stidham take the bullets early and maximize Nix long term potential.",
            "Odds are based on where people are betting.",
            "Yeah, the real probability is probably closer to 50% Nix, 45% Stidham, 5% Wilson.  Stidham has been the best player so far, but Nix isn't far behind and he gets the shiny new-toy bump.\n\nWilson hasn't looked like he is even in the race.",
            "Pat Mahomes, Tom Brady, Aaron Rodgers, Jordan Love and Joe Montana would disagree.",
            "Mahommes is the only one who looked like a vet by the time he started. All the other ones came out looking like they had never been in a real game before but they adapted and learned fast. I believe their careers would have had the same trajectory if they had started right away. Learning in the bench wasn’t the reason for why were successful, they had the intangibles required for being a QB in the NFL. They just had to experience the game to perfect it.",
            "This assumes a causal relationship between sitting as a rookie and becoming a great QB"
        ]
    },
    "[Highlight] Best throws of John Elway, who celebrates his 64th birthday today": {
        "title": "[Highlight] Best throws of John Elway, who celebrates his 64th birthday today",
        "score": 293,
        "url": "https://v.redd.it/iidm9x388c9d1",
        "content": "",
        "num_comments": 25,
        "comments": [
            "Dude could rip the pigskin across the field for sure.",
            "Elway had a fucking cannon for an arm",
            "If Elway played today he'd put up absolutely insane numbers.",
            "\"I bet I could throw a football over them mountains\" - Elway, probably. \n\nHis arm strength was otherworldly, and this video highlights that we have not had a qb with anywhere near this level of arm talent since his retirement.",
            "Hearing John Madden making the calls also brought back fond memories.",
            "I could watch these all day.",
            "Elway was generational but this film reminds me that Shannon Sharpe was generational, too",
            "I recall seeing a comment somewhere saying \"I'm pretty sure Elway could be trapped in a refrigerator box and still rip it sixty yards.\"  It's crazy, he doesn't look like he's really winding up or putting a lot into each pass, but it just flies.",
            "So glad I got to see every single game he played! Watching this brings back a lot of fond memories!",
            "I could use some of this in my life about now"
        ]
    },
    "My Bronco Helmet Builds": {
        "title": "My Bronco Helmet Builds",
        "score": 49,
        "url": "https://www.reddit.com/gallery/1dqzhqw",
        "content": "A couple of my Broncos Game Model helmets. Tons of custom parts on these! I made them look as close as possible to what the player was wearing on the field. ",
        "num_comments": 4,
        "comments": [
            "How do you get the parts and stickers for them?",
            "A ton of searching on eBay, Green Gridiron, FB groups, marketplace. Some of the parts are really rare; Peyton’s facemask, Elway’s leather ear pads, the old style Riddell hardcup chinstraps. I actually created the Super Bowl 50 decal because nothing that I could find was close to what they had on the field.",
            "That’s sick. Have you ever considered making a little YouTube video or something about your process of making these? I bet you’d get some followers ;)",
            "These are fucking sweet!"
        ]
    }
}