{
    "Monthly Shop Critique Thread": {
        "title": "Monthly Shop Critique Thread",
        "score": 3,
        "url": "https://www.reddit.com/r/Depop/comments/1d73v5h/monthly_shop_critique_thread/",
        "content": "Welcome to the Monthly Shop Critique Thread! This thread is for users to seek and give advice on user's Depop shops.\n\nSome advice or questions to ask about can include: Advice on your photos, are your prices too high, advice on your backgrounds, what backgrounds suit better, what aesthetic your shop gives off, what are your strengths and weaknesses, why aren't/why isn't your item or items selling and similar questions.\n\n**Comments that do not fit the criteria below will be removed.**\n\n**Those requesting feedback:**\n\n* Add an image of your shop. (If this isn't working, please message the mods. For some reason, this turns off frequently.)\n* Mention what advice you're looking for.\n* Please be open and receptive to constructive criticism.\n* If you have a specific vibe you're going for, mention it.\n* If you have a specific question, mention it.\n\n**Those giving feedback:**\n\n* Keep criticism kind and constructive.\n* Answer their questions and give proper advice.\n\nDo not use this thread for advertising, buying or selling, being uncivil or posting unreleated topics. Doing any of those will result in a warning or ban.",
        "num_comments": 44,
        "comments": [
            "I think it's great that the one on the right looks more realistic and authentic, but I personally like the minimalistic look of the one on the left and would be more likely to click on that picture! I think they both look great though! <3",
            "i like both, but the second one is definitely better!",
            "honestly i would try finding a cute sheet or blanket and retaking the photos using the same background for every picture and making sure they are really good quality, you will be surprised how much more professional your shop will look and how much photo quality improves order activity!!",
            "someone correct me if im wrong but depop is mainly used for second-hand/vintage clothing. you might have better luck on etsy, and even ebay as another marketplace.",
            "If the items have been posted for longer than a month but arent selling, try delisting and relisting them. You can save the images from the post for easy access and then copy the post to a new listing, add the photos, post, and then delete the old listing.",
            "you can go to edit mode on your posts and press save changes, and it should pop up for other people searching similar items.",
            "how are u formatting your descriptions?",
            "pictures look fine, if you haven't optimized your listing details, i would go over them again and make sure to provide as much as possible so that it shows up in people's search results if people are looking for your type of items.",
            "Hi! I think this thread is only for those with shopfronts that need critique, not purchases!",
            "i think i usually gravitate more towards flat lays!"
        ]
    },
    "Monthly Description/Pricing Help Megathread": {
        "title": "Monthly Description/Pricing Help Megathread",
        "score": 5,
        "url": "https://www.reddit.com/r/Depop/comments/1d73v46/monthly_descriptionpricing_help_megathread/",
        "content": "Welcome to the Description/Pricing Help Thread! This thread is for sellers to seek advice on descriptions/bios/tags and pricing for their items.\n\nBefore using this thread, use google reverse image search or google lens.\n\n**Comments that don't fit the criteria below will be removed**\n\n**Those seeking help:**\n\n* Attach a photo of the item (please message the mods if this isn't working as it frequently turns off.)\n* Mention if you're looking for help on a description, what hashtags to use, keywords or pricing the item\n* Be open to people's different opinions\n* Do not post any rule breaking/off topic things\n* Do not use this thread to try and sell your items\n\n**Those helping:**\n\n* No trolling/unhelpful comments. If you have nothing nice to say or aren't actually going to help, don't comment\n* Do not use this thread to buy items",
        "num_comments": 29,
        "comments": [
            "theyre super cute!! personally i would try to take really good quality photos of them with a nice background and nice lighting, and list them for higher than you think they would sell i would probably do around 75-115per dress. anywhere in that range to me for vintage dresses that cute will sell, also people will also send u offers for less so its better to have a higher price but if they dont sell after a month reduce the price by 15%",
            "how long does each piece take u to make, i would charge 12 hr at minimum plus materials",
            "i suggest trying to sell smaller items you can list for cheaper first :) people will buy and leave reviews showing youre a trustworthy seller, and the more sales / reviews the more views and engagement your page will get",
            "** the little white specs are on the mirror, not the top",
            "I'd 15-30 depending on the quality of the t-shirt (what fabrics they're made of) and its condition. I can't tell how old it is since I'm unfamiliar with the brand, but it looks pretty modern.",
            "along w what the other commenter said, i'd also suggest romantic goth, j-fashion, and maybe even lolita?",
            "If you made the alternations yourself, definitely mention the fact they're upcycled and repaired! I'd also suggest mentioning cowboy/western aesthetics in your description. The cut/fit of the jeans is also important to the general look so you can use that to promote them!",
            "since they're used like $15",
            "for example if it cost you and hour to make the piece you posted and $7 in material list at $19",
            "hey thanks for your reply. the fabrics are polyester, viscose and elastane, and it's in great condition (no rips, stains etc). the RRP's of tops from this brand range from $119 - $599 currently, and if this shirt in particular is older than 5 years and not being made anymore then i'm wondering if that adds to its value? not really sure"
        ]
    },
    "Literally I’m so scared.": {
        "title": "Literally I’m so scared.",
        "score": 349,
        "url": "https://i.redd.it/7k09ftrvvd9d1.jpeg",
        "content": "Has a disagreement with a buyer on depop, refused to refund and now they say they’re gonna “find me”. What do I report them for? ",
        "num_comments": 69,
        "comments": [
            "You can report them for threats(?) possibly, but chances are depop has already flagged the chat and theyll get a warning email for their chat to you",
            "Ik ur serious but ive been crying laughing at this for the past 5 mins ngl",
            "Please dont worry, people have said that to my boyfriend many times on depop & theyve never actually found him. The threat also sounds sarcastic and even if it wasnt, what are they gonna do lol. But reporting it would be worth it because clearly the threat wasnt very funny to you, they need to know those kinds of jokes wont always land.",
            "If this person is threatening you over a sale on Depop, I can guarantee you they cant afford a plane ticket to come to your house.",
            "I mean they have your address, so good luck!",
            "I would say be careful but its not really likely for them to come after you over an item they know you know that they have ur address they just tryna scare u into a refund ",
            "im sure u have their address from the shipping label so u should just find them before they find you",
            "bro theyre clearly being sarcastic or joking ",
            "I see so many posts like this from this sub and I'm not even a member, it's fucked up that ppl immediately turn to threats and violence at the smallest inconvenience and your feelings are valid OP.\n\nFeeling fear when someone is threatening you, joking or not, is completely valid, and people in the comments saying it's funny or laughing at OP for being afraid or uncomfortable aren't capable of empathy.",
            "i think theyre like 15 and joking"
        ]
    },
    "what should I say next?": {
        "title": "what should I say next?",
        "score": 193,
        "url": "https://www.reddit.com/gallery/1dqr1ek",
        "content": "",
        "num_comments": 90,
        "comments": [
            "Nope, stick to your guns. \nDont refund until youve received the item. This is the same for almost all business models. \nAny online store will do the same, they must receive the item before the issue a refund.",
            "i also want to add they are 100% scamming you, there's not even a little chance that this is genuine. so just ignore them tbh!",
            "just keep saying that you will refund once you receive the item. sounds like the buyer is trying to scam you",
            "You handled this so well. I wouldnt respond to them again. They are clearly scamming you and definitely will not escalate this to Depop. I'd bet that's a bluff",
            "People make me sick. So many red flags here. \n\nThe fake nice nature of the message is one red flag, the idk how to sow hehe  message is weird. If you noticed a rip in a shirt, why would that be your first thought? Idk if you noticed :P it happens to me too! What happens to you??? Like what? And I will really like a refund thanks :) and the Im sending it to you so maybe you can fix it :)) ??? Who says that. No normal person talks like that?",
            "Can you keep us updated? Wanna know what happens lol",
            "No! This is definitely scammy, if the item is still in transit on your end then thats most likely what really happening with the item. The post office wouldve given this person a receipt which they couldve provided you with a tracking number. Just keep saying you wont give the refund until you receive your item. Dont let this person get a free item and keep their money too! People like this irkkkk me",
            "Let them escalate to depop, on the off chance this person is not trying to scam you they will side with you anyways as the whole interaction is sketchy! They didnt even provide a picture of the item damaged which to me means they never recieve it.",
            "You don't need to respond back anymore... Wait until. The item comes back first",
            "They havent received the item?? Report them lmao"
        ]
    },
    "Hello??? 😭": {
        "title": "Hello??? 😭",
        "score": 114,
        "url": "https://i.redd.it/ngyii8nird9d1.jpeg",
        "content": "why? go on somewhere \n",
        "num_comments": 13,
        "comments": [
            "Omg, this is so funny (I'll help you save the world, don't worry)",
            "IT GOT SO MUCH FUNNIER WHEN I LOOKED AT THE ITEM THEY MESSAGED ABOUT ",
            " before the crystal gems would fight great wars against homeworld and the diamonds themselves now all they do is sell on depop",
            "Where does one find the crystal gems?",
            "Well go on, get! Save the world OP!",
            "it was so unexpected ",
            "on depop if you try hard enough",
            "best i can do is cheap clothes that get new homes instead of landfills ",
            "That made me chuckle",
            "Did he stutter?"
        ]
    }
}