{
    "Megathread Vício em Pornografia. parte 3": {
        "title": "Megathread Vício em Pornografia. parte 3",
        "score": 623,
        "url": "https://www.reddit.com/r/desabafos/comments/yrnv4h/megathread_vício_em_pornografia_parte_3/",
        "content": " \n\nA moderação notou um grande fluxo de posts abordando vício em pornografia.\n\nCriamos essa thread para que o assunto seja discutido, de forma saudável e construtiva, sem que haja um flood no sub.\n\n[Parte 1](https://www.reddit.com/r/desabafos/comments/ps8h63/megathread_vício_em_pornografia/?utm_medium=android_app&utm_source=share)\n\n[Parte 2](https://www.reddit.com/r/desabafos/comments/uek43a/megathread_v%C3%ADcio_em_pornografia_parte_2/)",
        "num_comments": 1835,
        "comments": [
            "ai rapaziada, essa m\\*rd\\* acabou comigo, eu tinha um relacionamento perfeito mas acabei entrando muito no mundo da pornografia, comecei a querer sentir prazer so com isso e fui deixando de lado o prazer real, meu penis ja nem subia mais pra minha ex, acabei terminando com ela achando q o problema era ela q n me satisfazia mais, hoje se passou mais de 1 ano e meu penis so sobe com algum estimulo pornografico. j to quase 1 mes sem ver pq dizem q da pra voltar ao normal, vamos ver no q vai dar, se tudo voltar ao normal eu volto aqui nesse post pra atualizar.",
            "Estou a 32 dias sem ver pornografia. Me sinto realizado, espero que esse nmero aumente mais e mais. Resolvi postar isso aqui no reddit pois nunca cheguei a comentar com ningum, nem mesmo minha namorada (que foi o principal motivo de eu tomar a iniciativa de parar). Enfim, s queria registrar minha vitria aqui mesmo, obrigado",
            "\\+200 dias de nofap, sem seguir nenhum mtodo e sem vontade de voltar.",
            "Pornografia  terrvel! Vicio desgraado, sorrateiro. Voc nem percebe e quando ver ele te muda, vai destruindo teu imaginrio voc vai morrendo todo dia um pouco mais. Me sinto um merda! As mulheres so a cada dia que passa s mais um objeto sexual, voc no consegue mais olhar pra elas sem pensar em alguma posio sexual. E sabe oque  pior disso tudo? Voc nunca est satisfeito. Quanto mais voc assiste mais voc quer. Os temas vo vo variando porque voc j no goza mais com a mesma facilidade vendo um sexo comum. Voc quer ver bbw, casadas, Mulheres com 2, 3, 4 homens. No tem fim no permitam que seus filhos consumar essa desgraa.",
            "Sou viciado nessa merda desde os meus 13 anos de idade. Hoje com 22 anos ainda no consegui me livrar do vcio. At consigo passar um tempo sem, mas sempre acabo recaindo. Como j  de se esperar isso afeta e muito minha vida social. Vivo fugindo de relacionamentos e afundando cada vez mais no meu prprio mundo. J tentei diversas formas de me desvencilhar dessa condio mais tudo em vo. J tentei parar aos poucos, j tentei tirar de uma vez e nada. A nica coisa que funcionou por um tempo (6 meses) foi quando fiz uma cirurgia em 2017 e por conta disso passei um tempo impossibilitado de tocar no garoto. Outra vez (3 meses) pra ser exato, foi quando eu me mudei de cidade e arrumei um emprego (2021). Na poca quase no tinha tempo pra pensar nisso, mais foi s eu me adaptar a nova rotina que a vida voltou a ser fcil e voltei a recair. Outra vez foi quando conheci uma garota e ela acabou servindo de inspirao pra cessar os 5x1 por um tempo, mas infelizmente como minha cabea j tava muito fodida na poca (acredito eu pelo excesso de p****ta) no consegui me conectar a ela e deixar as coisas flurem. Outra vez foi quando mudei de emprego no ano passado, isso acabou mudando muito a minha rotina novamente e acabei deixando o ato um pouco de lado. 2 meses e alguns dias passei sem. Quando tudo se normalizou, mais uma recada. A ltima vez que consegui passar um tempo sem se masturbar foi a um ms atrs quando me desafiei a cumprir uma meta e foquei nela 100%. Coloquei toda energia que me restava nela e at vi uns resultados bacanas e estava tudo indo bem, eu dizendo pra mim que dessa vez era definitivo e que eu j tinha vencido o vcio. Bobagem, recai. E na verdade l no fundo eu j esperava. Mais a ltima experincia que tive me deixou um pouco curioso pois a coisa que me fez novamente passar um tempo sem, foi me desafiar a fazer algo e focar naquilo. No meu caso foi academia, dieta, estudos, trabalho e correr todas as noites. Um Hard Life total mesmo. Nunca pensei em desistir de continuar lutando e nunca vou, nem que eu tenha que passar anos at aprender oque fazer pra me livrar disso. Tive meio que uma epifania e comecei a pensar recentemente se a cura para o consumo de pornografia no est nas metas a longo prazo que criamos ou em objetivos claros que definimos. Quando olho pra trs, as vezes que consegui controlar o vcio foi justamente nas vezes em que me desafiei a correr atrs de algo. Isso me d uma fiapo de esperana que um dia eu consiga me libertar disso e consiga viver minha vida normalmente.",
            "Hoje eu reca mais amanh vou me reerguer senhores. ",
            "A cultura dos sexo me fodeu, sou mulher e to to acostumada com homens me sexualizando o tempo todo que fica difcil at de me enxergar como algo alm de um objeto. \nAtualmente eu gosto de um menino e ele nunca fez isso comigo ento eu fico o tempo todo me questionando se ele realmente gosta de mim ou s no fala nada pq no tem interessekkkkk pornografia e at onlyfans etc deixa as pessoas doentes",
            "So exatamente 21:24 da noite, e eu continuo gastando horas da minha vida (minha preciosa e nica vida) se masturbao.  bem complicado, difcil, nem lembro quando eu comecei, tudo que eu sei  que quando eu deveria est estudando, mudando minha vida, eu t procurando pornografia na internet para me satisfazer. Minha mente j ta poluda de uma maneira que eu no consigo passar um dia se quer sem pensar em algo pornogrfico. Tenho objetivos de vida, tenho emprego, pago minha faculdade, no entanto, meu crebro no consegue utilizar o mesmo nvel de foco que eu tenho para procurar pornografia para estudos e mudar minha vida. Quando digo que no lembro quando comeou isso,  pq no lembro msm, comecei a achar que isso vem de mim mesmo. No me masturbo todos os dias, porm, quando acontece fico triste, real, como se tivesse perdido parte da minha vida, e  angustiante.  Pessoalmente no consigo contar isso para ningum, pq absolutamente todos em volta de mim, so pessoas que no saberiam me ajudar, apenas me julga. Eu luto uma batalha solitria e cansativa cmg msm, preguia, insnia, ansiedade, raiva. J  tarde da noite, e eu t escrevendo esse texto pq s existe uma vida, eu nunca vivi a minha como eu realmente queria, e eu quero viver, quero realizar meus sonhos, e quero principalmente mudar.",
            "Sou H(menor de idade) eu era viciado em pornografia, vi que fazia mal ento decidi parar. Ao contrrio do recomendado eu parei de uma vez sem ir diminuindo aos poucos e sinceramente  muito melhor, no tenho mais aquele vcio e cansao que ia gradativamente me corrompendo. Para mim no foi difcil parar, uma vez que eu j tinha o porqu de parar, fiz como fao em outros vicios simplesmente parei e no pensei, ou optei por aquilo denovo.",
            "Eu sinceramente t preso em um ciclo vicioso de masturbao e pornografia constantes, t praticamente sucumbindo ao vcio de bebida, porn e s no me drogo porque j considero que este  o pice. T to deprimido com essas merdas que acabo nem conseguindo masturbar, t estressado, cansado e s consigo pensar em dormir pra acabar logo com essa dor, no quero mais socializar com meus amigos e no consigo desabafar com ningum por medo de rejeio, sinto que vou acabar fazendo coisas que vou me arrepender muito e s quero que essa dor acabe. Depois que parei de ganhar dinheiro, no vou mais a academia e perdi pelo menos uns 10kg de massa magra, de volta a estaca zero e concerteza isso vai acabar comigo alguma hora."
        ]
    },
    "Eu odeio hentai,mas quero muito desenhar isso. ": {
        "title": "Eu odeio hentai,mas quero muito desenhar isso. ",
        "score": 10,
        "url": "https://www.reddit.com/r/desabafos/comments/1drbrgd/eu_odeio_hentaimas_quero_muito_desenhar_isso/",
        "content": "Eu sinceramente n gosto de hentai, em mangas, animes, HQs, eu n gosto disso em qualquer coisa. Mas artistas de conteúdo adulto ganham fortunas em suas artes! E eu realmente presciso de dinheiro agr. ",
        "num_comments": 7,
        "comments": [
            "depende muito,  a mesma coisa de virar criador(a) de contedo adulto s pq algumas ganham mt dinheiro, a maioria n ganha nem 500 reais por ms",
            "Na verdade a coisa de que contedo adulto  lucrativo  uma farsa. A indstria de hentais  a que menos d lucro se comparado a outras industrias de mang e anime. O que recomendo  fazer comisses de desenhos e cobrar mais para fazer um desenho NSFW",
            "Pra ganhar dinheiro com isso precisa ser bom em prospeco de clientes",
            "Se todo mundo gostasse de trabalhar no existia depresso",
            "O desenhador de pirocas kkkk",
            "Superbad -  hoje!"
        ]
    },
    "Meu amigo quer me comer": {
        "title": "Meu amigo quer me comer",
        "score": 37,
        "url": "https://www.reddit.com/r/desabafos/comments/1dr5bdb/meu_amigo_quer_me_comer/",
        "content": "Somos amigos há dois anos e temos a mesma idade (18 anos). Eu sempre prezei apenas por amizade, até porque sou virgem e nem faço muita questão de sexo. Acontece que sempre que tocamos nesse assunto, ele demonstra segundas intenções. Já nos beijamos, mas nunca passou disso. Acho que só não transamos porque ele me respeita e entende meus motivos. Tem também o fato de que ele gosta de mim, mesmo não sendo recíproco (sempre deixei isso claro, e ele diz não se importar). Por mais que eu tenha curiosidade de fazer isso, fico com receio de acabar sendo ruim ou de perder uma amizade por causa de sexo. O que devo fazer? ",
        "num_comments": 43,
        "comments": [
            "Vcs j ficaram, vc j sabe que ele gosta de voc. No ficou claro se voc gosta dele tambm mas a questo de arruinar a amizade  uma linha muito tnue no momento. Tanto o sexo pode estragar a amizade como o fato dele j gostar de voc tambm, imagino que ele no v ficar feliz por mt tempo sendo s seu amigo j que gosta de voc, e como vocs j ficaram pode ter certeza que ele tem esperana que as coisas evoluam.  muito bom que ele te respeite e respeite o seu momento pois sua primeira vez  um momento bem importante, mas tem algumas coisas a se considerar alm do medo de transar e prejudicar a amizade",
            "vcs ja se beijaram, vc sabe q ele gosta de vc e tu continua essa amizade kkkjj",
            "Todo homem j quis ou quer comer a melhor amiga",
            "Se vc for atraente um amigo htero sempre vai querer ter comer, esse  o mundo, bem vindo a ele.",
            "Se ele gosta de voc, no vai ser esse sexo que vai acabar a amizade de vocs, pelo contrrio, a ausncia de afeto com ele e uma futura proximidade sua com outra pessoa vai fazer com que ele se afaste de voc. Voc deveria era fortalecer mais a amizade de vocs, faz sexo com ele.",
            "Vai por mim, vai ser bom, at melhora a amizade.",
            "Vai fundo antes um amigo do que um inimigo ",
            "a amizade ja tah arruinada nao? O cara ja te v como alguem que ele quer comer. Dar ou no, no vai mudar o status quo kk",
            "Isso vai arruinar a sua amizade, so poucas pessoas que tem maturidade para continuar uma amizade depois de sexo. E tambm tem a possibilidade de ele querem mais e mais e no te deixar mais em paz.",
            "Olha, o sexo em si no perde a amizade, mas se ele ficar falando por a sim. Mas tem que ser com algum que voc queira. E  normal homem confundir a amizade com mulher e tentar levar para esse lado (falo por que por muito tempo fui assim com minhas amigas, com algumas rolou outras no) mas depois com o tempo aprendi a diferena da amizade e no levar para esse lado. Voc disse pra ele, ele tem que respeitar, e logo voc encontra um cara que vai te fazer querer. Mas s por curiosidade, vai no."
        ]
    },
    "Engravidei de um menino mais novo": {
        "title": "Engravidei de um menino mais novo",
        "score": 104,
        "url": "https://www.reddit.com/r/desabafos/comments/1dqxig3/engravidei_de_um_menino_mais_novo/",
        "content": "Estou grávida e me sentindo culpada porque por ser mais velha que meu namorado acho que eu tinha que “pensar de forma mais responsável” do que ele.\n Tipo, eu me sinto numa idade boa para engravidar (tenho 24), e ele acabou de fazer 21, está começando a vida agora, e eu já vivi bastante coisa, estava entrando na minha fase mais caseira e sossegada.\n~ ainda não consegui conversar com ele sobre isso porque tô com a sensação de que “eu acabei com a vida dele”, e que ele vai me ver como alguém que tirou a liberdade que ele teria se não tivesse filho. Por mais que pai não cuide igual mãe, eu sei que um filho vai mexer na renda dele…. Ele ganha bem, mas não sei como falar que com o dinheiro que ele usaria para comprar peças de PC e gastar em jogos, ele vai ter que gastar com fralda KKKKKKK ~é engraçado e trágico.\nTô chorando o dia todo e sentindo que ele vai me olhar com raiva :v",
        "num_comments": 151,
        "comments": [
            "Relaxa que n precisa falar nada no, ele vai saber que nao vai da mais pra comprar a rtx... Vai ser um choque, mas se ele colocou dentro sem camisinha, tem consequencias e com certeza ele deve saber delas... A sua preocupao  vlida, mas no transforme uma preocupao em uma culpa! Voces dois tem o peso da resposta das suas atitudes.",
            "Ele optou por ter uma criana quando ele colocou em vc sem camisinha,  nessa hora que o homem decide se quer uma criana ou no, essa  a lio que ele vai aprender pro resto da vida dele. E nem  sobre voc ou ele mais, agora vcs vo ter uma criana (se vc no decidir abortar),  sobre essa criana,  sobre ela ter pais presentes,  sobre ela ter dinheiro para sobreviver.",
            "minha filha daqui 2 dias vai fazer 7 meses, eu tenho 19 anos e te garanto que mnha vida no acabou, a liberdade no acaba isso  uma mentira q falam para vc, fica bem e rlxxxxxxx a vida de ninguem acabou!!!",
            "Minha mae era 8 aos mais velha que meu pai,que sempre foi um timo pai,eu nasci ele tinha 25.\n\nSeu namorado  um homem adulto que escolheu com vc no usar nada pra previnir,no tem vilo ou inocente na histria,apenas duas pessoas adultas que fizeram uso da prpria agncia.",
            "3 anos de diferena entre maiores de 20 anos  irrelevante. So dois adultos",
            "E eu aqui com 24 achando q t nova demais pra ser me... perspectiva realmente  algo construdo de pessoa p pessoa. Digo isso pq talvez o cara tb j se ache na idade de ser pai sla",
            "Bom, 21 anos j deve ter parado de usar fralda e chupeta n? \n\nSe no  melhor ele parar e guardar para a terceira criana da relao",
            "So 3 anos de diferena, no  tanta coisa assim, ambos j so adultos, no vejo problema nenhum",
            "Pelo que voc falou, ele vai ser um bom pai e isso me deixa com corao quentinho",
            "Caramba, at eu fiquei triste por wle agora"
        ]
    },
    "Fui traído , mais uma vez ": {
        "title": "Fui traído , mais uma vez ",
        "score": 17,
        "url": "https://www.reddit.com/r/desabafos/comments/1dr6fe4/fui_traído_mais_uma_vez/",
        "content": "Essa é a mensagem que eu acabei de escrever e mandar para ela.\n\nDois meses e meio de namoro eu h44 e ela M32 ela é borderline. \n\n\n\"\nCaralho .. eu ia casar com vc ...  Eu ia ter um filho com você...  Eu ia construir uma vida com você , uma casa...  Uma família....  Ia te o meu ,o seu , e o nosso .....  A gente ia ser feliz... Ia ter um monte de planta... Um monte de bixo...  Uma casa linda.....  E no final vc me trocou por quem vc dizia que não tinha mais nada.. que não sentia nada.... E quantas vezes eu perguntei para vc ... Você ainda dentro algo por ele ?  E vc me dizia que não ... Que não tinha nada.....  E no final foi com ele que vc me traiu...  Foi com ele que vc foi.. \"  e o pior  foi querer justificar como \"porque naquela semana não estávamos bem\".  Como se só isso fosse preciso para você jogar tudo oque estávamos construindo fora e voltar a ficar com o cara que segundo você \" só te fazia mal\".    \n\nNão vô reler ou corrigir os erros .. é só um desabafo de quem perdeu tudo ....  E digo tudo porque eu só vinha tomando no cu nessa vida...  Só passando por relações que foram minando minha auto estima ,  minha  força de vontade ,  e vc prometeu que ia me ajudar a me recuperar... Me prometeu que ia me dar tudo isso que eu sempre sonhei ....  E foi vc que com tão pouco tempo, fez eu acreditar que era possível eu ter tudo isso que eu já não pensava mais ser possível. E me tirou tudo ...\n\"\n",
        "num_comments": 56,
        "comments": [
            "Regra pra vida: Com borderline no existe relacionamento. \n\nPodem at me acusar de ser preconceituoso, mas meu relacionamento com uma borderline foi a coisa que me deixou mais perto de tirar a minha prpria vida. Hoje, livre dela, eu tenho pavor s de imaginar ela presente na minha vida de novo.",
            "2 meses e meio j queria construir vida? Calma a  panetono",
            "Poxa, pena!!! Mas dois meses  vc j queria isso tudo com ela?",
            "Na moral op. Acho q no  s ela q ta doente da cabea. 2 meses e meio e dois chifres? E ainda todos esses planos ? Tem alguma coisa errada ai.",
            "OP voc cometeu o maior erro de todos, se apaixonar/relacionar com uma borderline, unica soluo pra isso  fingir que nunca viu essa pessoa na vida.",
            "Sinto muito Op, infelizmente so pessoas assim, que ns faz, no acredita nas pessoas, mais vc vai achar algum bacana",
            "Infelizmente boderline  algo complicado e que deve ser tratado, no sei se ela estava em tratamento mas acho que a traio vem do carter da pessoa e no de um transtorno. Voc no teve culpa de nada, no sei sua idade mas acredito que seja novo, tu vai encontrar muita gente legal por a! No momento  importante voc focar em voc, voc vai ficar bem!",
            "No quero soar rude, mas voc no deveria se relacionar com pessoas com problemas mentais. Literalmente pode dar merda facilmente, sei que  horrvel o que estou falando, mas infelizmente quase nunca d certo",
            "Q merda de gria  borderline?",
            "Com 2 meses de namoro e voc escreveu isso ? Vc tem 44 anos ? No  da pra acreditar , Parace coisa de adolescente."
        ]
    }
}