{
    "Megathread Vício em Pornografia. parte 3": {
        "title": "Megathread Vício em Pornografia. parte 3",
        "score": 625,
        "url": "https://www.reddit.com/r/desabafos/comments/yrnv4h/megathread_vício_em_pornografia_parte_3/",
        "content": " \n\nA moderação notou um grande fluxo de posts abordando vício em pornografia.\n\nCriamos essa thread para que o assunto seja discutido, de forma saudável e construtiva, sem que haja um flood no sub.\n\n[Parte 1](https://www.reddit.com/r/desabafos/comments/ps8h63/megathread_vício_em_pornografia/?utm_medium=android_app&utm_source=share)\n\n[Parte 2](https://www.reddit.com/r/desabafos/comments/uek43a/megathread_v%C3%ADcio_em_pornografia_parte_2/)",
        "num_comments": 1835,
        "comments": [
            "Um novo começo (Ou recomeço)\n\nNão são 36 dias, são 36 anos, e zero, zero realizações.\nNão tenho nada digno de nota, que alguém chegue e me elogie, me diga \"Parabéns Wesley, você conseguiu!\" Elogiam muito a minha inteligência, acredito ser sincero, porém eu me pergunto o que eu faço ou fiz com essa incrível inteligência?\nNada, eu não tenho um carro, não tenho uma moto, casa, nada, nada digno de nota, como falado anteriormente.\nHoje dia 06/03/2023 me masturbei, e vi pornografia uma desgraça que me acompanha há anos, e eu creio ser a raiz de todos os meus problemas, procrastinação, falta de foco, etc.\nNão lembro na minha longa vida de idas e vindas, de altos e baixos, de muitas e muitas decepções, quando eu tive o primeiro contato com a pornografia, ou quando comecei a me masturbar, mas creio que foi cedo, por volta dos 12 ou 13 anos, fui abusado por um vizinho na infância, minha mãe percebeu e me salvou, mas nunca falamos sobre isso, e apesar de ter uma tristeza profunda quando falo sobre esse episódio, sinto que superei, não me tornei um pedófilo, um abusador, se faço mal a alguém, é a mim mesmo, e creio que essa seja a última batalha rumo a realização pessoal.\nVoltando ao tema da pornografia e masturbação, eu me tornei alguém ansioso, com crises de depressão e ansiedade generalizada, tenho crises de pânico que me acordam a noite de súbito, com a sensação de estar morrendo.\nCom mais de 15 anos trabalhando na área de TI, no suporte ao usuário, me tornei um profissional mediano (mais realista dizer, medíocre) nunca investi em mim mesmo, iniciei três faculdades diferentes e nenhuma delas terminei, em 2022 fui demitido, ainda neste ano, iniciei um curso de gastronomia, área que eu muito gosto, que me faz um bem enorme e me vejo trabalhando com isto para o resto de minha vida.\nNunca fui um homem ambicioso, criado num lar simples e cristão (evangélico) tradicional, cresci cheio de dogmas e medo, aos 18 já morando só numa grande cidade, fiz amizades, comecei a frequentar a noite, e aos 19, bebendo usei cocaína pela primeira vez, e foi assim até aos 26 perdendo tudo, ganhei muito dinheiro, pois sempre fui um cara batalhador, mas apesar dos planos e inteligência, nunca fiz investimentos e nunca pensei no futuro, hoje aos 36 anos, vejo a grande tolice e farsa que foi e é a minha vida, comprei um violão que nunca aprendi tocar, comprei inúmeros livros que nunca terminei de ler, enfim, sou um homem de projetos e ações inacabados (os construtivos) apenas.\nVirada do ano, prometi a mim mesmo que iria abandonar de vez o maldito vício (pornografia e masturbação) consegui, venci uns três meses, sendo que o maior tempo que eu tinha passado sem, eram 98 dias, isso lá em 2021.\nBem, iniciei o ano com foco total, me sentia animado, disposto, estava fazendo as aulas online, nesse interim, uma velha fantasia sexual com uma conhecida muito próxima de mim voltou (através de um sonho) e já no outro dia estava na ânsia de me masturbar, aguentei algumas semanas, mas depois do carnaval acabei cedendo vendo porno e me masturbando, já notei que eu recorro a esse vício como uma válvula de escape, na primeira decepção, raiva, stress, eu me rendo.\nEu venci o vício em cocaína, foram 7 anos usando, nos últimos 2 anos quase que diariamente e me pergunto, porquê eu não venço essa desgraça que é a pornografia e a masturbação? Tô jogando a minha vida fora, o tempo tá se esvaindo literalmente entre meus dedos, meus olhos não se fixam em outra coisa que não seja, peitos e bundas, e cê sabe quanto mais você consome essa merda, mas funco você vai, isso é um poço sem fundo.\nHoje dia 06/03/23 após me masturbar por duas vezes, refiz novamente meu voto, orei e oro a Deus pedindo perdão (creio que Ele já esteja cansado, de mim) minha família (pais e irmãos, esposa) desconhecem o nível de dependência que eu tenho de tudo isto, até tentei algumas vezes dialogar, encontrar apoio, ser sincero, partilhar essa batalha com alguém, mas sempre fui um cara reservado, e isso me impede de me abrir.\nResumindo, compartilho com vocês a minha história, sei que é impossível recuperar o tempo perdido,mas eu nunca desisti e nem irei desistir, se há alguém que deve ser orgulhar de mim, esse sou eu mesmo, que apesar das inúmeras decepções, fracassos, etc, nunca se deu por vencido, nunca pensou em sair desta vida e desta batalha como um covarde, que Deus me perdoe mais uma vez, porque eu não vou desistir de mim!",
            "ai rapaziada, essa m\\*rd\\* acabou comigo, eu tinha um relacionamento perfeito mas acabei entrando muito no mundo da pornografia, comecei a querer sentir prazer so com isso e fui deixando de lado o prazer real, meu penis ja nem subia mais pra minha ex, acabei terminando com ela achando q o problema era ela q n me satisfazia mais, hoje se passou mais de 1 ano e meu penis so sobe com algum estimulo pornografico. já to quase 1 mes sem ver pq dizem q da pra voltar ao normal, vamos ver no q vai dar, se tudo voltar ao normal eu volto aqui nesse post pra atualizar.",
            "Estou a 32 dias sem ver pornografia. Me sinto realizado, espero que esse número aumente mais e mais. Resolvi postar isso aqui no reddit pois nunca cheguei a comentar com ninguém, nem mesmo minha namorada (que foi o principal motivo de eu tomar a iniciativa de parar). Enfim, só queria registrar minha vitória aqui mesmo, obrigado",
            "\\+200 dias de nofap, sem seguir nenhum método e sem vontade de voltar.",
            "Pornografia é terrível! Vicio desgraçado, sorrateiro. Você nem percebe e quando ver ele te muda, vai destruindo teu imaginário você vai morrendo todo dia um pouco mais. Me sinto um merda! As mulheres são a cada dia que passa só mais um objeto sexual, você não consegue mais olhar pra elas sem pensar em alguma posição sexual. E sabe oque é pior disso tudo? Você nunca está satisfeito. Quanto mais você assiste mais você quer. Os temas vão vão variando porque você já não goza mais com a mesma facilidade vendo um sexo comum. Você quer ver bbw, casadas, Mulheres com 2, 3, 4 homens. Não tem fim… não permitam que seus filhos consumar essa desgraça.",
            "1° - dia de nofap: 05/12/2022\n\n2° - dia de nofap: 06/12/2022\n\n3° - dia de nofap: 07/12/2022: Terceiro dia e consegui me controlar mesmo estando sozinho em casa por um tempo, num dia normal eu teria me acabado mas hoje eu resisti.\n\n4° - dia de nofap: 08/12/2022:\n\n5° - dia de nofap: 09/12/2022\n\n6° - dia de nofap: 10/12/2022: 6 dias de nofap e ainda não sinto grandes mudanças. No momento eu só me sinto \"limpo\" e acho que com tédio também, eu não sentia tédio antes mas desde que comecei o nofap tenho sentido isso, algumas coisas perderam a graça nesses seis dias.\n\n7° - dia de nofap: 11/12/2022: Minha motivação pra malhar está a mil, quero começar a segunda logo pra passar a tarde malhando.\n\n8° - dia de nofap: 12/12/2022\n\n9° - dia de nofap: 13/12/2022\n\n10° - dia de nofap: 14/12/2022: 18:00 da tarde e to malhando pesado aqui já sinto meus braços e peitoral doendo, suando igual um condenado, vou fazer agora os abdominais. 10 dias limpo sem consumir e nem fazer aquilo.\n\n11° - dia de nofap: 15/12/2022: Infelizmente, depois de 10 dias tive a maldita \"polução noturna\", mano que bagulho asqueroso, esqueci geral de por um lenço na cabeça do pau antes de dormir.\n\n12° - dia de nofap: 16/12/2022: 13:47 da tarde, e o nofap continua firme. Ontem a noite fiquei sozinho por um tempo, não resisti e abri alguns videos bem exoticos no xvideo, mas não passou disso. Minha ansiedade tá tão a mil que hoje de manhã antes de ir pra facul, eu caguei na cueca pensando que era peido, puta merda e ainda nem tinha água em casa... Tem uma ansiedade que tá me consumindo por dentro todos os dias, e tenho certeza que me borrei por causa dela, pqp.\n\n13° - dia de nofap: 17/12/2022:\n\n14° - dia de nofap: 18/12/2022: Me sinto meio abalado emocionalmente, vou começar a praticar hábitos radicais a partir de amanhã pra auxiliar com o nofap.\n\n15° - dia de nofap: 19/12/2022:\n\n16° - dia de nofap: 20/12/2022: Deixei um lencinho perto de mim ontem pra por no pau antes de dormir, acabei esquecendo, dormi e acordei todo gozado. + uma polução. Duas em 16 dias.\n\n17° - dia de nofap: 21/12/2022:\n\n18° - dia de nofap: 22/12/2022:",
            "Sou viciado nessa merda desde os meus 13 anos de idade. Hoje com 22 anos ainda não consegui me livrar do vício. Até consigo passar um tempo sem, mas sempre acabo recaindo. Como já é de se esperar isso afeta e muito minha vida social. Vivo fugindo de relacionamentos e afundando cada vez mais no meu próprio mundo. Já tentei diversas formas de me desvencilhar dessa condição mais tudo em vão. Já tentei parar aos poucos, já tentei tirar de uma vez e nada. A única coisa que funcionou por um tempo (6 meses) foi quando fiz uma cirurgia em 2017 e por conta disso passei um tempo “impossibilitado” de tocar no “garotão”. Outra vez (3 meses) pra ser exato, foi quando eu me mudei de cidade e arrumei um emprego (2021). Na época quase não tinha tempo pra pensar nisso, mais foi só eu me adaptar a nova rotina que a vida voltou a ser fácil e voltei a recair. Outra vez foi quando conheci uma garota e ela acabou servindo de inspiração pra cessar os “5x1” por um tempo, mas infelizmente como minha cabeça já tava muito fodida na época (acredito eu pelo excesso de p****ta) não consegui me conectar a ela e deixar as coisas fluírem. Outra vez foi quando mudei de emprego no ano passado, isso acabou mudando muito a minha rotina novamente e acabei deixando o ato um pouco de lado. 2 meses e alguns dias passei sem. Quando tudo se normalizou, mais uma recaída. A última vez que consegui passar um tempo sem se masturbar foi a um mês atrás quando me desafiei a cumprir uma meta e foquei nela 100%. Coloquei toda energia que me restava nela e até vi uns resultados bacanas e estava tudo indo bem, eu dizendo pra mim que dessa vez era definitivo e que eu já tinha “vencido” o vício. Bobagem, recai. E na verdade lá no fundo eu já esperava. Mais a última experiência que tive me deixou um pouco curioso pois a coisa que me fez novamente passar um tempo sem, foi me desafiar a fazer algo e focar naquilo. No meu caso foi academia, dieta, estudos, trabalho e correr todas as noites. Um Hard Life total mesmo. Nunca pensei em desistir de continuar lutando e nunca vou, nem que eu tenha que passar anos até aprender oque fazer pra me livrar disso. Tive meio que uma epifania e comecei a pensar recentemente se a “cura” para o consumo de pornografia não está nas “metas” a longo prazo que criamos ou em objetivos claros que definimos. Quando olho pra trás, as vezes que consegui controlar o vício foi justamente nas vezes em que me desafiei a correr atrás de algo. Isso me dá uma fiapo de esperança que um dia eu consiga me libertar disso e consiga viver minha vida normalmente.",
            "Hoje eu recaí mais amanhã vou me reerguer senhores. 🍷🗿",
            "**Desconstruindo a Visão Distorcida: Como Parar com a Pornografia Mudou Minha Percepção das Mulheres**\n\n\r  \nEsse foi um dos pontos que mencionei em um post sobre as razões para parar com a pornografia: o fato de você acabar desenvolvendo uma visão distorcida das mulheres devido ao consumo de pornografia. E o mesmo se aplica às mulheres, que podem ter uma visão distorcida dos homens. Quando digo \"distorcida\", me refiro ao fato de você buscar características irreais em um parceiro.\r  \n\r  \nPor exemplo, no meu caso e de muitos outros homens viciados, assistíamos vídeos em que as mulheres eram perfeitas, com corpos voluptuosos, seios grandes, bundas firmes e tonificadas, rostos lindos e angelicais, ou até mesmo coisas estranhas como mencionei no post anterior. Isso não reflete a realidade que encontramos na vida real, nunca, em hipótese alguma. O simples fato de consumirmos esse tipo de conteúdo continuamente só piora a situação. Porque quando nos encontramos com uma mulher \"normal\", não conseguimos nos conectar emocionalmente com ela, ou seja, não conseguimos vê-la como um ser humano com sentimentos. Aí está o problema.\r  \n\r  \nA partir do momento em que não conseguimos enxergar as mulheres como seres humanos que sentem, vivem, nascem aqueles sentimentos de raiva contra elas. Por exemplo, dizer que todas as mulheres são iguais, expressar sentimentos de incel e pensar coisas como \"sou tão bom, mas as mulheres não enxergam isso\", etc. Tudo isso surge da mentalidade de não enxergar as mulheres como mulheres, como seres humanos, mas apenas como objetos de desejo.\r  \n\r  \nQuando você não é capaz de ver cada mulher como um ser único, olhar nos olhos dela e perceber sua personalidade, conectar-se emocionalmente de forma específica com a mulher com quem você está naquele momento, significa que você não está vendo-a como um ser humano, mas apenas como um objeto de desejo.\r  \n\r  \nA partir do momento em que você enxerga apenas como um objeto de desejo, surgem os sentimentos de raiva, como \"ela só quer homens ricos\" ou \"ela só quer homens altos\", etc. Até certo ponto, essas questões têm sua relevância, mas como as mulheres são mais sentimentais que os homens, esses aspectos exteriores se tornam menos importantes. Se você conseguir se conectar emocionalmente com a pessoa, nada mais importa. Esses conceitos que as mulheres usam para escolher um parceiro realmente existem, mas se você conseguir entrar em seu mundo psicológico, entender suas intenções e sentimentos, se conectar verdadeiramente, o céu é o limite. Parece clichê, mas o mais importante é olhar nos olhos da pessoa e sentir a conexão. Quando você se conecta, todos esses aspectos físicos se tornam secundários!\r  \n\r  \nExistem muitos conceitos que as mulheres usam para escolher um parceiro que são baseados apenas em imaturidade e falta de experiência de vida, valores superficiais. No entanto, com muita paciência e compreendendo o contexto, é possível mudar gradualmente essa percepção.\r  \n\r  \nÉ sério. Se vocês olharem meus posts de dois meses atrás, eu estava nessa mentalidade de \"todas as mulheres são iguais! Como isso é possível?\" Mas agora estou percebendo que não é bem assim. Dois meses sem pornografia me fizeram mudar minha visão em relação às mulheres! Agora consigo me conectar melhor com elas!",
            "A cultura dos sexo me fodeu, sou mulher e to tão acostumada com homens me sexualizando o tempo todo que fica difícil até de me enxergar como algo além de um objeto. \nAtualmente eu gosto de um menino e ele nunca fez isso comigo então eu fico o tempo todo me questionando se ele realmente gosta de mim ou só não fala nada pq não tem interessekkkkk pornografia e até onlyfans etc deixa as pessoas doentes"
        ]
    },
    "Engravidei de um menino mais novo": {
        "title": "Engravidei de um menino mais novo",
        "score": 60,
        "url": "https://www.reddit.com/r/desabafos/comments/1dqxig3/engravidei_de_um_menino_mais_novo/",
        "content": "Estou grávida e me sentindo culpada porque por ser mais velha que meu namorado acho que eu tinha que “pensar de forma mais responsável” do que ele.\n Tipo, eu me sinto numa idade boa para engravidar (tenho 24), e ele acabou de fazer 21, está começando a vida agora, e eu já vivi bastante coisa, estava entrando na minha fase mais caseira e sossegada.\n~ ainda não consegui conversar com ele sobre isso porque tô com a sensação de que “eu acabei com a vida dele”, e que ele vai me ver como alguém que tirou a liberdade que ele teria se não tivesse filho. Por mais que pai não cuide igual mãe, eu sei que um filho vai mexer na renda dele…. Ele ganha bem, mas não sei como falar que com o dinheiro que ele usaria para comprar peças de PC e gastar em jogos, ele vai ter que gastar com fralda KKKKKKK ~é engraçado e trágico.\nTô chorando o dia todo e sentindo que ele vai me olhar com raiva :v",
        "num_comments": 110,
        "comments": [
            "3 crianças",
            "Relaxa que n precisa falar nada não, ele vai saber que nao vai da mais pra comprar a rtx... Vai ser um choque, mas se ele colocou dentro sem camisinha, tem consequencias e com certeza ele deve saber delas... A sua preocupação é válida, mas não transforme uma preocupação em uma culpa! Voces dois tem o peso da resposta das suas atitudes.",
            "Ele optou por ter uma criança quando ele colocou em vc sem camisinha, é nessa hora que o homem decide se quer uma criança ou não, essa é a lição que ele vai aprender pro resto da vida dele. E nem é sobre você ou ele mais, agora vcs vão ter uma criança (se vc não decidir abortar), é sobre essa criança, é sobre ela ter pais presentes, é sobre ela ter dinheiro para sobreviver.",
            "25 sem filhos, amém",
            "Minha mae era 8 aos mais velha que meu pai,que sempre foi um ótimo pai,eu nasci ele tinha 25.\n\nSeu namorado é um homem adulto que escolheu com vc não usar nada pra previnir,não tem vilão ou inocente na história,apenas duas pessoas adultas que fizeram uso da própria agência.",
            "minha filha daqui 2 dias vai fazer 7 meses, eu tenho 19 anos e te garanto que mnha vida não acabou, a liberdade não acaba isso é uma mentira q falam para vc, fica bem e rlxxxxxxx a vida de ninguem acabou!!!",
            "3 anos de diferença entre maiores de 20 anos é irrelevante. São dois adultos",
            "Bom, 21 anos já deve ter parado de usar fralda e chupeta né? \n\nSe não é melhor ele parar e guardar para a terceira criança da relação",
            "São 3 anos de diferença, não é tanta coisa assim, ambos já são adultos, não vejo problema nenhum",
            "Pelo que você falou, ele vai ser um bom pai e isso me deixa com coração quentinho😊"
        ]
    },
    "literalmente chorando de tesão 🤡": {
        "title": "literalmente chorando de tesão 🤡",
        "score": 36,
        "url": "https://www.reddit.com/r/desabafos/comments/1dqz3wz/literalmente_chorando_de_tesão/",
        "content": "É isso. eu ia sair com um cara hoje que eu tava muito muito muito afim de transar de novo, já saímos antes e foi maravilhoso. Mas infelizmente tive que cancelar porque fiquei com uma infecção urinária do nada! Faz um tempão que não transo, acabei de sair da menstruação e queria muito aproveitar. To genuinamente triste e tão frustrada porque tô com muito tesão mas tô sentindo muita dor, nem um DJ vai dar pra rolar…\n\nE o pior é que vou ter que esperar provavelmente uma semana até poder TENTAR alguma coisa. Nunca tinha me acontecido isso. Tô completamente estressada, desconcentrada e frustrada. Realmente tô chorando porque quero transar e não posso.",
        "num_comments": 31,
        "comments": [
            "Força guerreira",
            "Queria uma mulher chorando de tesão por mim também kk",
            "Puxa vida que triste.\n\nEu não sou mulher, mas ouvi dizer por aí que o excesso de higiene da área pode remover a flora boa da vagina. Será que você não emocionou demais com o date e tentou dar um capricho lá? \n\nMas quem sou eu pra falar da rotina dos outros...",
            "Sinal divino guria kkkkk",
            "Rapaz, teve uma vizinha aqui que tava chorando justamente por isso, mas era por falta de opção, eu achava que era um evento raro kkkkkk",
            "Daqui uma semana tá fortona aí sentando nele",
            "Pau é o que não falta no mundo tá safe",
            "Ideia ozada: da o furico e tenta um orgasmo por lá",
            "Eu não sou de superstição, mas parece segunda chance do universo. Quem não garante o que poderia ter acontecido com todo esse fogo ?",
            "\"nem um DJ\"\n\nAHAHAHAHAHAHAHAHAHHA."
        ]
    },
    "Gozar todo dia e ruim? ": {
        "title": "Gozar todo dia e ruim? ",
        "score": 24,
        "url": "https://www.reddit.com/r/desabafos/comments/1dqzsxa/gozar_todo_dia_e_ruim/",
        "content": "Eu geralmente tenho gozado todos os dias 1 por dia, antigamente eu ficava até 1 semana sem. Mas do nada agora todo dia sinto vontade de goza e ruim? O problema e que toda vez que gozo me sinto mal... ",
        "num_comments": 78,
        "comments": [
            "A questão da culpa é algo mais cultural do que qualquer outra coisa. Existe essa ideia que sexo e masturbação são coisas inadequadas, e às vezes a gente cai nessa ladainha, mesmo que inconscientemente. Mas o ato em si não é nada demais\n\nToma só cuidado pra não exagerar com pornografia. Isso sim faz as pessoas terem percepções erradas sobre como sexo funciona. Pode assistir, mas sem achar que aquilo é a forma como as pessoas transam no mundo real",
            "Eu me sinto um merda tbm mané dps disso essa merda aí acaba com a gente e com a pornografia é pior ainda isso é prazer fácil é ruim",
            "Tenho certeza q tem pornografia envolvida…. Senão vc não iria querer ter vontade de gozar todo dia como disse. Só tem porque assiste, lê, ouve, ou mesmo lembra de pornografia. Procure ajuda!",
            "Geralmente isso provem de algum tipo de gatilho, talvez alguma questão emocional no qual tu ta passando no momento, algum vicio/prazer que tu queira voltar a ter e não pode ter, depressão pós punheta é algo biológico, um pico de intensidade e depois a realidade bate forte, o que dita esse sentimento posterior são seus sentimentos mal resolvidos, afinal se vc tivesse bem da cabeça, não se sentiria tão mal assim.\n\nPode sim bater umazinha, mas nao se acabe em pornografia pq se nao vai se afundar.\n\nSem falar q existe aquela máxima, cabeça vazia, oficina do diabo...",
            "fisiologicamente é super saudável, mas tem que trabalhar na culpa pra se sentir melhor",
            "Em termos de fisiologia e saúde não, não é ruim, inclusivo é benéfico tanto para sua saúde mental quanto para saúde física (por exemplo: a masturbação esta relacionada a menores índices de doença prostática) \nPORÉM, se esse estímulo (gozar) ocorre por meio de conteúdo audiovisual (vídeos pornôs) você pode experienciar uma dessensibilização com relação a prática carnal propriamente dita e até uma distorção da maneira com a qual você compreender e experiência o ato carnal. Minha sugestão é: se for bater uma, não olhe conteúdo adulto na internet, use a imaginação.",
            "Acho que não. Na verdade, deve ser top.",
            "Não",
            "Não, inclusive faz bem, o.corpo.produz diariamente, só não exagera.",
            "Orgasmo libera só hormônios bons,eu amo antes de dormir."
        ]
    },
    "Minha ex ameaçou vazar nude meu": {
        "title": "Minha ex ameaçou vazar nude meu",
        "score": 110,
        "url": "https://www.reddit.com/r/desabafos/comments/1dqp2hq/minha_ex_ameaçou_vazar_nude_meu/",
        "content": "É isso do título. Ela perguntou quanto ela ganhava pra não postar e mandar pra todos que eu conheço, pra minha atual nem pra minha família. Como resposta lavrei os prints no cartório e a disse que se postar, denunciarei a polícia civil e processarei. Sei que isso na teoria é até estupro digital, sei da coação, dano moral, difamação, etc... Eu só tô bastante mal e sem saber o que fazer ",
        "num_comments": 61,
        "comments": [
            "#AVISO\n\nGostaríamos de deixar claro que comentários contendo misoginia e sexismo, incluindo apologia ao estupro, culpando a vítima de qualquer maneira, piadinhas e opinões acarretarão em remoções e bans. **REPORTEM!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/desabafos) if you have any questions or concerns.*",
            "ja devia abrir um b.o so pra ficar esperta pelos ameaços",
            "Acho que vc deveria contar pra sua atual que a ex tá te ameaçando. Ela pode te ajudar a lidar com essas merdas.",
            "Fala que ela ganha uma ficha limpa, porque isso é crime",
            "Junte evidencias e acione a polícia. Abra um BO e tenta uma medida protetiva.\n\nRemédio de doido é outro na porta.",
            "A ameaça em sí já é crime.\nEu não confiaria em palavra de ex, mandaria o b.o e olhar no Google lens porque com certeza já deve até bater vazado  os nudes.",
            "passei por algo parecido, infelizmente não tenho nenhuma palavra de conforto pra dizer, só que eu tô na torcida que dê tudo certo pra você no final, sinto muito mesmo... por bem ou por mal, isso vai passar, aguenta firme",
            "Kkkkkk amigo só faz BO e veja ela pagar multa e indenização pra vc...",
            "Vc fez o certo, se vazar aciona o PC e já era.",
            "Amigo, manda nude no grupo da família que já resolve isso tudo."
        ]
    }
}