{
    "✍🏽 Call for Wiki Proposals: Share your learnings with the developersIndia Community!": {
        "title": "✍🏽 Call for Wiki Proposals: Share your learnings with the developersIndia Community!",
        "score": 2,
        "url": "https://www.reddit.com/r/developersIndia/comments/1dqes6l/call_for_wiki_proposals_share_your_learnings_with/",
        "content": "Have a knack for writing & sharing your learnings with the community? Here's your chance to contribute to the community by writing a [wiki article](https://wiki.developersindia.in/) on a topic of your choice.\n\n#### Wiki: https://wiki.developersindia.in/\n\n### How to Contribute\n\n1. Read the [CONTRIBUTING guidelines](https://github.com/developersIndia/wiki/blob/main/CONTRIBUTING.md) to understand what kind of topics are suited for the wiki and the process of contributing to the developersIndia official wiki.\n2. Create a [proposal for your wiki article](https://github.com/developersIndia/wiki/issues/new?labels=proposal&projects=&template=wiki-proposal.yml).\n3. Work with volunteer team members to get your proposal approved.\n4. Once the wiki is written & published, we will make it an official wiki for that topic. The wiki will be announced on our Discord server, [LinkedIn](https://www.linkedin.com/company/developersindia), [Twitter/X account](https://twitter.com/devsinindia), and the subreddit.\n\n> You can also consider [joining the wiki volunteer team](https://developersindia.in/become-a-volunteer/) to help us maintain the wiki.\n\n### What to Write?\n\n- We have a [list of FAQ topics](https://github.com/developersIndia/wiki/discussions/21) that are usually repeated in the community & could be beneficial for the members.\n- The goal is to write about niche-specific topics that are not easily available on the internet.",
        "num_comments": 1,
        "comments": [
            ">Namaste!\nThanks for submitting to r/developersIndia. Make sure to follow the Community [Code of Conduct](https://developersindia.in/code-of-conduct/) and [rules](https://www.reddit.com/r/developersIndia/about/rules) while participating in this thread.\n    \n## Recent Announcements\n\n- **[Call for Wiki Proposals: Share your learnings with the developersIndia Community!](https://www.reddit.com/r/developersIndia/comments/1dbrmc2/call_for_volunteers_help_us_build_rdevelopersindia/)**\n- **[Call For Volunteers: Help us build r/developersIndia](https://www.reddit.com/r/developersIndia/comments/1dbrmc2/call_for_volunteers_help_us_build_rdevelopersindia/)**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/developersIndia) if you have any questions or concerns.*"
        ]
    },
    "Updating our definition of Rule No 3 a.k.a. \"Low Quality Posts\" on developersIndia. Must Read!": {
        "title": "Updating our definition of Rule No 3 a.k.a. \"Low Quality Posts\" on developersIndia. Must Read!",
        "score": 85,
        "url": "https://www.reddit.com/r/developersIndia/comments/1dr6blz/updating_our_definition_of_rule_no_3_aka_low/",
        "content": "We are revising posts themes that are allowed in the forum under [rule no 3](https://www.reddit.com/r/developersIndia/about/rules). Moving forward the following types of posts & comments will no longer be allowed.\n\n1. **App screenshots**\n   - Screenshots that show something weird/incorrect/wrong. E.g., notification screenshots because you get bugged-out notifications.\n   - This includes adding screenshots of your conversations with someone etc.\n   - Asking why a \"web portal\" is not working, developersIndia is not tech support, please email support of products you are using, no need to post that here.\n2. **“News” posts without source**\n    -  News without valid source links is not allowed.\n    -  Screenshots don't count as a valid source.\n    -  Screenshots of Tweets (Posts from X) are not valid news sources unless they are from the creator of a package/app/tool/company etc.\n    -  Source links shoudl not be behind a paywall.\n3. **Screenshots of Job Posts from LinkedIn/Job-portals**\n    - We are well aware of how companies don't know how to post jobs on LinkedIn, pay peanuts, or mention YoE incorrectly. There is no need to share that here. It's a lost battle.\n    - No need to post screenshots of _how many applicants_ are there for a job, we are aware times are tough, and there's no need to share that sentiment again & again.\n4. **Diversity hiring-related discussions**\n    - Very young members in the industry seem to complain about this because why not hire \"based on skills\"?\n    - Unfortunately, the reality is that women are still underrepresented in tech, and discussions around this are counterproductive. However, we encourage discussions around initiatives or solutions to balance the scale.\n    - Any rants regarding this will be removed.\n5. **Discussions around tech influencers/creators**\n    - There's no need to share your hate towards one specific creator, some of them run a business, and some share their learnings because they care about the ecosystem. Stop following people whose opinions/advice you don't like.\n    - Avoid sharing e-lafdas within the creator community as long as they don't affect the outside ecosystem. (e.g. the express.js drama was allowed because it affected the maintainers of the expressjs project)\n    - \"Course Reviews\" are however allowed, feel free to post (or request) a review of a course you bought from an independent tech creator.\n6. **Posts about cheating in interviews or Faking work experience.**\n    - Any conversations/posts supporting any of these topics will be removed.\n    - If you are in trouble for cheating/faking anything, that's on you.\n7. **Unncessary mention of gender or age**\n    - This was already put in action 5 months ago. Please [read our full announcement](https://www.reddit.com/r/developersIndia/comments/1ahsa8l/posts_containing_unnecessary_mention_of_gender/) on this.\n\n---\n\nSince this rule is generic, its definition will change with time, keep an eye on announcements to see what other types of posts may come under this. **Always visit the [rules](https://www.reddit.com/r/developersIndia/about/rules) thoroughly before posting anything**.\n\n_Subreddit Volunteer Team_",
        "num_comments": 39,
        "comments": [
            "Upvote if you want memes here",
            "Do we count as source in news post? If we see something bad(or more relevantly see a new framework) and take pics does that count as news with source?",
            "Can we have an open thread for this stuff ? A lot of sub have it and usually keeps s posting to open threads and keeps the quality of sub high.",
            "4 diversity hire related discussions are always blaming women , that too my female colleagues is dumb  kind of post , they proceed to blame the women . \n\nI feel uncomfortable to post any questions because people will say your women . Please don’t justify  saying women also do that. Openly misogynistic and sexist comments are upvoted",
            "Why soo stringent with guidelines. I mean people want to have fun discussions here.",
            "Can people still post and ask which laptop to buy?\n\nEdit: personally it shouldn't be allowed here, unnecessary",
            "Nah man, we have r/ProgrammerHumor for that, and believe it or not most of these memes already gets posted on LinkedIn as it is, so it'll be just another repost karma farm.",
            "Memes aren't allowed because there was a time when the subreddit used to be filled with low-quality reposted memes. Serious development/tech career related communities like r/programming, r/CSCareerQuestions, r/ITCareerQuestions don't allow memes - why should we? You already have r/ProgrammerHumor for programming memes.\n\nWe are focused on fostering a friendly wholesome community of developers, enthuisiasts, builders and security enginners - not memers.",
            "Reddit works best when it is an echo chamber",
            "We already have an automod regex filter that and we remove those posts on a regular basis."
        ]
    },
    "\"Will you shut up?\" said the CEO when shared an update": {
        "title": "\"Will you shut up?\" said the CEO when shared an update",
        "score": 221,
        "url": "https://www.reddit.com/r/developersIndia/comments/1dr6l3r/will_you_shut_up_said_the_ceo_when_shared_an/",
        "content": "\n\"Will you shut up?\" said one of the cofounders and CEO as a voice message in public discord channel.\n\nOnly Indian in a Germany based company (about 30 people) as a remote contractor for 2 years.\n\nWe use discord public channels for all company related talks.\n\nI sent an update yesterday, by mistake I sent it in wrong channel (not that wrong), later deleted it & sent in correct channel. It would have been 5 minutes.\n\nThe update was related to a ticket I was working on.\n\nImmediately, after that got this voice message \"Will you shut up?\" from German founder and CEO, after that another co-founder (not German) sent the message that it looked like an accidental message.\n\nLater both deleted those messages.\n\n\nI DMed my TL, who has been good and is also EU based, been with the company for more than 5 years ig, explained this incident (but he also must have heard that voice message, as it was there for few minutes), and asked for his advice to handle this incident.\n\nHe said that this has happened previously to others, he would not take it personally and would ignore it, and but he can take this up to that cofounder (who is also CEO) but it's upto me. He also mentioned that he likes my efforts and I've been outstanding!\n\nI gave a thought about ignoring or not ignoring it, and then ended up saying that I would ignore this incident and asked for the guidelines to not come across such incidents in future. I will sync with my TL on this later next week.\n\nThe thing is here I'm not at a major fault, my only mistake was to share the updates, I shared it twice in two different channels and later deleted it from other channel.\n\nI don't even know why he would have said it?\n\n- Is this normal in IT companies? \n- Am I overthinking? \n- Should I grow more thick skin to get insulted in public even when I didn't make major mistakes?\n- somehow, I really feel bad to hear such words when only thing I was doing is the company's work!\n\nWhat are my course of actions here?\n\nThanks for your input.",
        "num_comments": 69,
        "comments": [
            "Very unprofessional, but common from what I hear",
            "That is unprofessional, but if you're not directly working with the one who said you that, you should just shrug it off, if it was someone like your TL or manager, this would be a different story, also I don't think you being the only Indian was the reason. Just do your work, also its remote it's not like you have to meet or have to have good relations or anything like that, more like do your work and logoff kind of thing.",
            "once a wise old man said \"don't be loyal to a company\". on serious note, its disgusting, i would switch after finding another good opportunity!",
            "Reply back to CEO with \"no u\"",
            "Well, if that is your leaders attitude, I have some advice news. Leave before this guy runs the company into the ground. I'm betting it won't last for too long. ",
            "You've got a great manager to say the least.\nCan be an honest mistake as well IMO",
            "You know very well what happened or this question would not be here. I would say, respect yourself. In situations like this your mind is constantly telling you the correct decision, you are just ignoring it as of now. You, yourself know very well what to do. \n\nSwitch. Nothing is above self.",
            "I am not sure how it works in europe but in this case even if you report it or do something it will only put a target on your back. No one is going to take any action against the CEO of the company for a voice note that was deleted. Take your TL's advice and ignore it",
            "The ego that comes with the title",
            "I had an European senior dev who used the word fuck in an email, while questioning the team over an incorrect code, turns out it was his change actually, later he apologised. My lead should have made some noise but hey you know us Indians. One thing I would say is if you are bold and call them out on their bullshit,Europeans do respect it. I on multiple occasions fought with my onshore and they tend to subdue and respect you. You don't need to make it official but you can definitely let your CEO know you are not ok with it. If you are comfortable in taking up the consequences whatsoever."
        ]
    },
    "Should I resign my job and move to Bangalore for 5LPA.": {
        "title": "Should I resign my job and move to Bangalore for 5LPA.",
        "score": 245,
        "url": "https://www.reddit.com/r/developersIndia/comments/1dr2kls/should_i_resign_my_job_and_move_to_bangalore_for/",
        "content": "I’m a 2022 pass out.I have been working as an iOS developer in a 5 year old service based start up in Chennai for 1 year 8 months for a CTC of 2.64 LPA. My monthly in hand salary is 18400. This year since January I have not received any payment the company is saying that the client is delaying the payment and blaming us. The last amount which I received was 7000 INR for the month of April(they said they will give 50% payment) after that I didn’t receive anything. Most of us are working from home since March as they are not able to pay the rent. The company laid off some employees on February and said that the situation will return to normal after March and new projects are in pipeline. But so far no new projects have been allocated and seniors from both android and ios teams have left the company. I have attended some interviews but most of them low balled me. The max package they gave me was 4LPA for Pune location. I got an offer from a Bengaluru based company for 5LPA in Malleshwaram area. I need to move from Chennai to Bengaluru did I low ball myself for 5LPA? Should I take the offer or   wait for better offers within Chennai. In my current company there is no sign of releasing salary and we have submitted the project to client and client said OK but no payment till now. ",
        "num_comments": 57,
        "comments": [
            "It's on the lower side but In your situation you should take the offer and look for counter offers if you can get any. It's better to have a job then be jobless or living in constant fear of being sacked.",
            "It's almost 2X your current CTC, even though Bangalore is comparatively costlier to live in, career wise in 1.8 years its a good growth. And to top it off, your current company is giving you hell, so might as well move forward. All the best.",
            "Take it. It's all about the ctc in the market, more you have, more you will get in next 2 years. don't think twice, move now.",
            "Bro if u are a developer with 1+ yr 5Lpa is not bad. Consider moving to blr. Cost of living is high but as a bachelor u can find some affordable place away from office. In terms of life experience, I would suggest move to pune for 2 yrs",
            "Bro if you dont mind go to pune 4 lpa in pune is much better than 5 in Bangalore and I would say work for 1, 1.5 year in same company youll be reaching 4.5 or maybe 5 in that same company then make a switch to Bangalore if you want for 8-10 LPA or maybe more",
            "Do not disclose your ctc, say you’ve signed an nda if the HR insists. Only ask for the industry standard for your level of experience. I too made this mistake moving to Bangalore for a low salary given my YOE.",
            "Take it. Your next switch you can ask more !! You need this salary jump.",
            "Go to bangalore for 5LPA. Your situation might not improve much due to cost of living but you will get better opportunities. Good luck.",
            "You might save the same amount or maybe a lil more in Bangalore because of the high cost of living, but you will be satisfied as you will be getting paid the salary company actually promised and a sense of satisfaction is v important . Also you can find cheap options to live like pgs and all, and keep looking for an opportunity in Chennai.",
            "4 Lpa at pune location will be better than 5 Lpa in Bengaluru"
        ]
    },
    "I cant see someone i know going in such a depressed phase , PLEASE HELP ! ": {
        "title": "I cant see someone i know going in such a depressed phase , PLEASE HELP ! ",
        "score": 54,
        "url": "https://www.reddit.com/r/developersIndia/comments/1dr54ar/i_cant_see_someone_i_know_going_in_such_a/",
        "content": "My brother graduated from his 3 tier college this year in 2024 , He did pretty much nothing he dont know DSA , He is not even having good projects on his resume , no internship experience whatsoever , knows only HTML , CSS , and JS . And now everything seems overwhelming to him , all these courses , all the youtubers everything is too much for him at this point he is thinking that he wont be able to do any job and will rot in home all his life . He also is not good in connection making and have no idea how to apply rigorously . He is not talking to anyone here at home and i'm not able to see him in such a state , please suggest me something even I'm getting hopeless now , and idk how many tears I'm holding while writing this , Its overall affecting my Family Ambience now . Any kind of Help will be Appreciated .",
        "num_comments": 31,
        "comments": [
            "Tell him IT is not the only career option out there, he just graduated, let him take a breather for gods sake, I don’t understand this mindset that, oh right after I graduate I need to have a job or else I am a failure. \nLet him see what he actually likes instead of just doing courses from these YouTubers. \nWhenever I see “X LPA” in a thumbnail I skip it, hide it from my feed.",
            "Here i am on the same boat as your brother. I know situation is a bit tough for people graduating from low tier college. But we have just graduated, and there are people who are unemployed for years even after experience.\n\nSo don't loose hope, try your best, add 2 projects in resume, start connecting with hr on linkedin. Keep worshipping god everyday.",
            "Bro it's alright. Find your niche. Not everyone who graduated Btech comp science has to do a developer/IT job. There's literally so many carrier options (some pay way more than SDE profiles) that he can go for. No need to be depressed looking at other kids. Cheer up",
            "Talk to him. Tell him that careers don't always start at 21. Tell him a few stories of people who made it big in their lives and started late (ex: kfc owner, there are lots of others). He has a great time right now to upskill. Suggest him to do a few courses of HIS interest. Meanwhile, scout companies in your city. You'll find intern roles which don't require much skills, like QA, testing and documentation.",
            "All he needs is to get his foot in the door somehow. Don't let him dwell in idealism, like if not Tech, then nothing. He's very young, he's still got a lot to figure out.  Isolation is the breeding ground of depression, so do not let him isolate himself in his feelings. Have him start a proper routine and also if possible get him checked for ADHD. You never know what could be hindering him. And make sure he never stops applying and cold emailing recruiters, no matter how monotonous and soul crushing it is. Everyone has value to generate. His time will come.  All the best!",
            "Have a good talk with your brother.",
            "Take him out, lunch, park, walk. Movie. Have a casual time with him. He'll open up by himself.",
            "Your brother is in a situation similar to mine. After graduating with no job, my first action was to take a break and prepare for GATE, but I was not successful. A year since graduation, I knew nothing about coding, DSA, or anything else. However, my sister had a connection that got me an internship. I started from scratch, not knowing the syntax of any programming language. This opportunity allowed my employer to teach me everything. He began assigning tasks, and I learned as needed. It's been two years now, and I earn a decent income. I'm looking to switch jobs, which will be tough at the beginning and may feel overwhelming. However, with access to the internet and time, I don't think it's difficult.",
            "Why the hell do people want to do jobs only evyen they can do good in other fields also and he should try for something else also",
            "Explore more career options, tech world is overflowing.\nMy advice is to ask him to calm down by not rushing into things, prioritise your mental health only then you'll be able to think clearly and ahead. If he wants to stay in IT start building projects not TODO applications but something more commercial. Get good or go home. Getting into too much of tutorials and DSAs related things will only overwhelm him further and cause mental health issues. Tell him to take small steps."
        ]
    }
}