{
    "Capcom Super Elections - ask them for DMC6!": {
        "title": "Capcom Super Elections - ask them for DMC6!",
        "score": 340,
        "url": "https://captown.capcom.com/en/super_elections",
        "content": "Capcom have a survey going around to ask what fans want them to work on. There’s room to ask for DMC6 so please do that if you can! Like with 5, I think we have to show Capcom that we want another game as otherwise they’ll just ignore the series for another decade.",
        "num_comments": 98,
        "comments": [
            "Just came from the RE sub to post this here, lol. \n\nLet's go lads, DMC6 time.",
            "Bruh even tho the poll wasn't resident evil oriented (for obvious reasons) there were people who asked for code Veronica remake  c'mon guys we're starving here",
            "I already know they will make DMC 6 after dogma 2 so I hope there's options for other games they just stopped making like onimusha, breath of fire and Dino crisis. Those games need to come back.",
            "Sengoku Basara you fucking cowards.\n\nI want to see my infinite dream (TM)",
            "Done, Capcom needs to be   M O T I V A T E D   to create another DMC part.",
            "Paging moderator u/BillThePsycho to pin this!",
            "Not gonna lie. I would like MegaMan X9 or something like that",
            "i was summoned by the Okami sub to vote",
            "DEVIL MAY CRY AND DANTE #1 LETS GOOO",
            "DMC 3 Remake pls "
        ]
    },
    "...Dante..?": {
        "title": "...Dante..?",
        "score": 422,
        "url": "https://i.redd.it/ax9136se5f9d1.png",
        "content": "",
        "num_comments": 22,
        "comments": [
            "Hold on, a redditor is waiting?",
            "This aint the real Dante thats his alternate self dumte",
            "I've seen this picture before but never paid attention to the names",
            "Dante did say something like that to Patty",
            "That's not me, I promise",
            "Its clearly DmC: Devil may Cry Dante, our glorious king from the original series would never use Reddit",
            "Sus subreddit op is engaging",
            "I mean, as long as they are both consenting adults there's no problem.",
            "He definitely had pedo eyes!",
            "I was thinking this would be some kinda fanfic start that Patty would make"
        ]
    },
    "Clean shaven Dante or bearded Dante?": {
        "title": "Clean shaven Dante or bearded Dante?",
        "score": 604,
        "url": "https://www.reddit.com/gallery/1dqw6vu",
        "content": "Personally, I think the beard makes him more badass (especially in DMC4)",
        "num_comments": 96,
        "comments": [
            "I love the beard personally.",
            "Agreed, I like the dmc4 beard",
            "Aged well. Not like wine, but a goddamn social organization.",
            "It is fact that DMC5 Dante is the hotter and cooler he ever looked.",
            "Love bearded Dante. Gives him that rugged look.",
            "Peach fuzz chin Beard Dante from DMC4 I prefer.",
            "Depends on the age. In games like 5, I like how it works to show how he's more care-free, especially when compared to how Vergil is always clean shaven.",
            "Even though DMC5's Dante does have worst outfit by far imo, his beard actually is pretty cool and I think it fits him pretty well.\n\nAlthough I wish it was actually white and not so grey.",
            "Bearded. \nA good showing of his maturity through the years.\nIt fits his age",
            "I love twink Dante and I don't care what anyone says."
        ]
    },
    "How do you call this type of characters?": {
        "title": "How do you call this type of characters?",
        "score": 71,
        "url": "https://www.reddit.com/gallery/1dr7gl5",
        "content": "",
        "num_comments": 6,
        "comments": [
            "The white haired woo-hoo guys",
            "my preferred gender, a white hair guy that is cool as heck but fucking broke\n\nalso who is that other demon guy?",
            "Arataki Itto from Genshin Impact, Half-Oni Himbo Leader of the gang of missfits which feel a lot more like a goofy friend group that has heart of gold and rocks instead of brain. And he's broke because he gets scamed easily and organizes a lot of events for friends and kids.",
            "Answer: Broke",
            "Badass deadbeat",
            "[Here](https://tvtropes.org/pmwiki/pmwiki.php/Characters/DevilMayCryDante), you'll find something linking them all together eventually"
        ]
    },
    "Vergil actually gave fatherly advice to his son once... technically": {
        "title": "Vergil actually gave fatherly advice to his son once... technically",
        "score": 30,
        "url": "https://www.reddit.com/gallery/1drbnlx",
        "content": "Dea- Nero is one to throw tantrums when something goes wrong, I recall in 4 when the pope takes Kyrie he starts comboing the floor. Funny how within minutes of knowing each other, V scolds him on this flaw of his",
        "num_comments": 4,
        "comments": [
            "Vergil has both sides:  \nBri'ish dad (V)  \nAsian dad (Urizen)",
            "Him saying \"Stay back, child\" has two meanings:\n\n\n1. He doesn't want to stab, Nero\n\n\nHence...\n\n\n2. He is already teaching Nero to maintain the distance, evade, and defend.\n\n\nHim saying \"You disappoint me\". He is just like any parent teaching a child, and said child is not listening what the parent is teaching. This goes back to maintaining the distance while fighting, evade, and defend.Vergil is also talking to the player via fourth wall breaking that its the player's fault that Nero lost. Vergil is talking to two children both Nero and the player to listen to him.\n\n\nThis is also similar to the Deadly Fortune novel that Dante is teaching Nero during their 2nd fight. The twins know how to cool down Nero. But the way of talking and fighting is different. Dante is more playful aggressive, while Vergil is just holding back.",
            "Just a correction \n\nIt's not actually \"within minutes\"\n\nI'm pretty sure that since V's acquaintance with Dante (May 3rd) and their first attack on Urizen (May 15) are almost weeks apart, V knows Nero for a week or even more too.",
            "I certainly caught that.\nI enjoyed those little moments\nIt's a shame it didn't come from Vergil directly and only one half of him. Though that fits Vergil well\n\nI am glad he thanked Nero for helping him become one again, though, even if Nero had no idea he was doing it.\n\nIt might be just me\nBut I HC that if Vergil had known about Nero earlier, he might have stayed to be a dad. \nDunno will agree, but hey, it's just my opinion"
        ]
    }
}