{
    "Vessel of Hatred teaser trailer - first expansion to Diablo 4": {
        "title": "Vessel of Hatred teaser trailer - first expansion to Diablo 4",
        "score": 828,
        "url": "https://www.youtube.com/watch?v=gHuaCwmx-Rg",
        "content": "",
        "num_comments": 651,
        "comments": [
            "Diablo 4 Monster Energy Expansion",
            "Thats the Travincals right there?",
            "If they put those damn Fetish and Fetish blowdarts from D2 in here Im going to scream.  I hated those bastards.",
            "Vessel of Hatred? Oh gee i wonder what happened to Nyrelle, guess she wasn't smarter than the Horadrim after all.",
            "Shouldn't they like, finish the original?",
            "This game has been out for only months and they already drop an expansion trailer!? Fucking yikes, they chopped that shit up hard lmaoo",
            "If they can keep the 3 month season cycle, that means 0+5 seasons before expansion right? I don't think its that bad",
            "Teaser looked cool. Too early to tell anything else. I'm optimistic tho. They're making good changes, hence I'll remain positive.",
            "The zone most adored by fans they say, toran jungle, well adored because its the entire skipabble act :D",
            "Late 2024 Is gonna be a while. Hope is they put some good time on it"
        ]
    },
    "Weekly Thursday Help Desk, Ask your newbie questions here - January 18, 2024": {
        "title": "Weekly Thursday Help Desk, Ask your newbie questions here - January 18, 2024",
        "score": 19,
        "url": "https://www.reddit.com/r/Diablo/comments/199qrux/weekly_thursday_help_desk_ask_your_newbie/",
        "content": "Welcome to this week's installment of Thursday Help Desk.\n\nThis is a weekly thread for any quick/newbie/unsure questions you may have. No matter how dumb you may think the question is, now is your chance to have them answered!\n\nCheck the [Commonly Asked Questions page](http://www.reddit.com/r/Diablo/wiki/faq) first before posting! (may be horribly outdated)\n\n**Sort by new to answer the latest questions. Older questions most likely already have answers.**\n\nIf you have any feedback for this specific weekly thread, just post it here or [message the mods](/message/compose?to=/r/Diablo).",
        "num_comments": 99,
        "comments": [
            "At D4 launch, I played through the campaign and stopped pretty soon after.  In particular, I was very off-put from playing seasonal due to having to regrind map completion and whatnot.  How is S3 looking?  Is the game in a much better state now?",
            "Diablo IV - PC  \n  \nHey there,\n\nas of S4 something strange is happening on my End.  \nI am playing the PC Version with a Controller (Xbox One Wired/Wireless).  \nIn Beta till the end of S3 i held down a Button to use \"input random skill with CD\" / e.g Sorc' Teleport which then got activated and my Chara were moving along; still while the Button is held down and the Skill being on CD.\n\nBut now, as of S4, my Chara will stand still as long as the Button is held down, like playing with Keyboard and using the \"Hold Position\" Key.  \nStrange thing is - which makes me think that this is an errog/bug - while playing with Keyboard (+Mouse) its working like i am used to it. I am holding down the Key, Skill gets activated, Skills on CD, Key still held down, Chara moves... either with Mouse or via EDSF/WSAD\n\nDo you know which Setting do i need to change to get the old behavior back?\n\ntl;dr  \nhold down Button/Key for Teleport, or any other Skill with CD; does not matter if an Attack or Mobility skill  \nController=Chara does not move while TP has CD  \nKeyboard=Chara does move while TP has CD  \nWhy?\n\nAny Idea?  \nThanks in advance -  Happy Hunting",
            "Should I play D2 or D3? I see everyone recommending D2 but does it have as good as of a loot pool/cosmetics as D3? For reference I have never played this type of game before",
            "anyone know what time the season goes live?",
            "How many total items in D2 including potions, arrows, socketed swords, etc?",
            "I’ve never played diablo but heard from loads of people it’s great. I tend to like older graphics but would prioritize gameplay. Which game should I start with?",
            "I found all of the altars of Lilith at launch. Do I really have to do it again during this season?",
            "Can I upgrade my prepurchase option of the DLC on steam from base game? \n\nSo it would be more cost effective to by the Diablo® IV: Vessel of Hatred™ - Expansion Bundle on steam then upgrade it to the deluxe or ultimate edition but can I do this?",
            "boa noite. alguem sabe algum jogo parecido com diablo para jogar em lan ? ou split-screnn no pc",
            "This is less a help question and more of an opinions question. How do you feel about the skill tree in Diablo 4?"
        ]
    },
    "Favorite Diablo bossfight?": {
        "title": "Favorite Diablo bossfight?",
        "score": 25,
        "url": "https://www.reddit.com/r/Diablo/comments/1dqvar7/favorite_diablo_bossfight/",
        "content": "Which is the best bossfight in any of the diablo games? \n\nFor me its defenitely Malthael from Diablo 3, really liked that one (first time i did it felt really epic)",
        "num_comments": 83,
        "comments": [
            "The OG butcher.  Knowing exactly what you’re in for as soon as you come across the dying soldier at the church entrance. The sheer terror of trying to put enough distance to use a panic Town portal. The level 2 meta of finding a door near some bars to nickel and dime him at a distance with a short bow.  Panicking again when he finds a way around the wall…\n\nGood times.",
            "My favourite fight is Diablo in Diablo 2. \nUnlike other bosses, he is both epic and terrifying",
            "Original butcher, it was so \"wow holy shit the entire room is blood and guts\"\n\nAnd of course his famous catchphrase",
            "Diablo2 Baal fight (nostalgia city)",
            "I think Astaroth was such a cool and dynamic fight. It’s what Andariel in D4 should have been.",
            "Leoric in D1, i remember the first time i saw that giant skeleton as a child with my PS1, i literally panicked",
            "NOT EVEN DEATH CAN SAVE YOU FROM ME\n\nbosses in d4 are so lame, they might as well be big fat mobs. Duriel and Andy are only cool because of d2\n\nWhat ever happened to voice lines? I guess they don't want people to get driven mad",
            "D2 Duriel during hardcore speedrun 😂",
            "Mephisto from 2, Malthael in 3, and probably Astaroth or Lilith in 4\n\nHonestly the story bosses are my favorite part of any of the games. It’s hard to pick one. But I think Mephisto’s is most nostalgic, it was my first favorite boss in any game",
            "Astaroth in D4 campaign\n\nRunner-up D2: Resurrected Andariel"
        ]
    },
    "How do you highlight interactables? ": {
        "title": "How do you highlight interactables? ",
        "score": 4,
        "url": "https://www.reddit.com/r/Diablo/comments/1dr5ckb/how_do_you_highlight_interactables/",
        "content": "(im on PC) When im using my Xbox controller i notice like peices of paper, books, cranks, stuff like that, highlight if im looking in that direction or am around said item but when i use the mouse the outlines disappear. Alt does not reveal these items neither that only shows like stuff thats dropped on the ground like gold, weapons and stuff. Do you know what im talking about? Ive read some old posts from a year ago people were talking about this then did it ever get fixed or is that another \"new\" feature added to the game?",
        "num_comments": 0,
        "comments": []
    },
    "Playing last month of season": {
        "title": "Playing last month of season",
        "score": 2,
        "url": "https://www.reddit.com/r/Diablo/comments/1dr1hau/playing_last_month_of_season/",
        "content": "Hey guys,\n\nI'm looking to come back and play later this weekend but I'm wondering if there's enough time left in the season to make it worth it or if I should just wait for season 5. I remember from season 0 and 1 that one month probably wasn't really enough time to \"complete\" a season. However I know there's been a bunch of changes and you can at least level up alot faster. \n\nDo you think one month is relatively enough time or should I just wait to come back for a full season in August? \n\nThanks for your opinions! ",
        "num_comments": 4,
        "comments": [
            "You can pretty casually level to 100 is 10-15 hours from scratch. Speedrunners are doing it in 5ish. I do 8-10 pretty casually. 10-15 hour expectation gives you a lot of wiggle room. I would say 20-25 hours will govern you time to finish seasonal journey, level to 100, level glyphs to 15, and get started on the pits and your masterworking progress. If you can play on average 5-7 hours a week, i would say youve got plenty of time.",
            "I finished the season journey in about a week of casual playing, it's very easy to complete.",
            "You should have plenty of time to blast through the battle pass and season journey if you want to pick up some cosmetics at least. Leveling is faster than ever this season due to Helltides being available in WT 1 & 2, the Mindcage consumable increasing mob levels in Helltides, XP being increased for WT2+, and a bug allowing you to use two Elixirs at once (a regular elixir plus the antivenom quest elixir). Some of the S4 meta builds are confirmed as having bugs boosting their power and will be nerfed next season, including Bash barbs (Bash Temper is multiplicative), shadow summoner necros (a Book of the Dead setting for Reapers gives both effects), and Heartseeker rogues (Victimize key passive double dips its multiplier) so try them out before they go poof.",
            "Most people are done with the season within 2 weeks. You have a month and a half. You're fine."
        ]
    }
}