{
    "Dino-Related Game Servers Megathread": {
        "title": "Dino-Related Game Servers Megathread",
        "score": 42,
        "url": "https://www.reddit.com/r/Dinosaurs/comments/194c5oz/dinorelated_game_servers_megathread/",
        "content": "Hi all, \n\nI know there's a lot of dinosaur related games (and more coming out this year!). \n\nI want to keep it mostly separate from the regular /r/dinosaurs content to avoid a situation where we have too many people posting about their game servers. Yes, it is dino-related, but... We run the risk of being *overrun!* \n\nInstead I propose that we have this thread, where people are free to make a top level comment with links to their (dinosaur game only!) server, discord, subreddit etc. \n\nI encourage the following info to be included in such posts: \n\n>Name of Game (platform)\n\n>Name of Server\n\n>\\# of players \n\n>The Vibes: who is playing, who we're looking to add, and level of seriousness (playing \"realistic\", free for all, fun & games, etc) \n\n>Times people generally play (if any) (UTC preferred: https://dateful.com/convert/utc ) If you have a regular time to gather, it helps grow a consistent group! ie Saturday 08:00 for PST (me) = Saturday 16:00 UTC. \n\n>Links \n\nAs ever, please keep it family friendly, and in the spirit of engaging with and enjoying all things related to dinosaurs. \n\nCheers!",
        "num_comments": 14,
        "comments": [
            "Path of Titans has great potential but the devs focus only on new skins and other non-sense, instead of improving quests and actual gameplay. They haven't addressed toxic mix packing. The last time I played, I was literally added by a fellow herbivore and then they were communicating my location and following me and brought a bunch of friends to kill me. They did the same to another player who was nearby.\n\nI have quit the game since then until they actual make a meaningful improvement. I am honest tired of seeing skins of the week. They they either hired too many designers or they have no clue wtf they are doing.",
            "Its like the isle if the isle wasnt as cancerous. Still i prefer selling my soul away to",
            "I play dinosaur world mobile on roblox",
            "Please use the modmail for things like this ",
            "Imma get this 100%",
            "oh ok",
            "Hello fellow dinosaur lovers! I play a dinosaur survival mmo game called Path of Titans! Its a fantastic game and has constant updates and cool mods. I am currently building a Realism server for it. A realism server of course entails strict behaviors one must follow to immerse players into what it would actually be like to be that dinosaur. \n\nWe are currently writing profiles for each dinosaur which dictates how they need to act and limitations. However, my co owners and I are struggling to do this on our own. We are looking for folks well versed in paleontology facts to help out! If you would be interested to help bring these ancient creatures to life please message me!!! We really need some help! We want this to be as perfect as humanly possible!",
            "Hey everyone! I'm the community manager for an upcoming dinosaur + evolution inspired game called Adapt, which is coming to PC and currently has a free demo available on Steam. It's heavily Spore-inspired (we're calling it a Sporelike game), and I thought it might be of interest to those of you who are interested in dinosaurs - we're constantly looking for feedback! \n\nYou can find us over at r/AdaptTheGame, where you can also find links to our Discord and Steam!",
            "# Get a little dino to chase your mouse around\n\nHey Everyone, I made a google chrome extension that makes it so a little blue dino follows your mouse around as you navigate the web!\n\nTotally free, find it here:[Dino Pets](https://chromewebstore.google.com/detail/dino-pets/mfghfeoefceoncgdildbjebkclpfgmhj)",
            "Im building a dinosaur survival horror game you all may like called Creatures of War.\n\nThe vibe is similar to Resident Evil 4 but with 20+ real and hybrid dinosaurs for you to face off with.\n\nId love for you all to play the updated demo, wishlist it on Steam, and share your feedback in our Discord.\n\nhttps://preview.redd.it/v1jl88hdws8d1.png?width=460&format=png&auto=webp&s=d0da30a83c0cf1091d3a134119eaf2b3e247b2e9\n\n[https://store.steampowered.com/app/1733080/Creatures\\_Of\\_War/](https://store.steampowered.com/app/1733080/Creatures_Of_War/)"
        ]
    },
    "Dinosaurs are cool": {
        "title": "Dinosaurs are cool",
        "score": 383,
        "url": "https://www.reddit.com/r/Dinosaurs/comments/1cna0zc/dinosaurs_are_cool/",
        "content": "I just randomly realized “Damn, dinosaurs are pretty cool”",
        "num_comments": 70,
        "comments": [
            "Mod approved  \n\nMod stickied ",
            "Dinosaurs are and always will be awesome!",
            "Amen to that. Dinosaurs are pretty awesome.",
            "I nominate this post to be one of Reddit's finest. Dinosaurs are awesome.",
            "Would you feel the same way if one ate your family?!\n\nI would. I'd be like, that dinosaur sucked but he was cool.",
            "This was my trivia team name the other day",
            "Dinosaurs are fucking awesome.\n\nDinosaur games on the other hand...",
            "Theyre like dragons, but real",
            "Always have been. Always will be.",
            "Yes. Yes they are cool."
        ]
    },
    "I've gotta say, for all the faults of Jurassic World, the Dinotracker was definitely a welcome treat. It also allows us to see just how terrifying a dino encounter could be. ": {
        "title": "I've gotta say, for all the faults of Jurassic World, the Dinotracker was definitely a welcome treat. It also allows us to see just how terrifying a dino encounter could be. ",
        "score": 122,
        "url": "https://v.redd.it/wqxbo9ao7i9d1",
        "content": "",
        "num_comments": 9,
        "comments": [
            "I'm lucky I expected that Allo.",
            "Yup, very well done.  Very thrilling. \n\nThe marketing team did a good job here.",
            "I love how Reddit's automated captions say \"Bye bye.\" right as the Allosaurus appears",
            "When the marketing and animated series does a better job with the dinosaurs in the mainland premise than the movie",
            "Jurassic World's viral marketing campaigns for all three movies were pretty good. But yeah, the dinotracker is awesome. Really hoping the Gareth Edwards movies has more of this, just regular people dealing with dinosaurs, with the horror movie vibes this could produce. \n\nOn a quick tangent, I think A24 should make a dinosaur movie",
            "I wonder if the first one can fool Forrest Galante",
            "a halloween costume can fool Forrest, let alone hollywood level CGI",
            "For real ",
            "Really makes it seem terrifying and hammers home the threat\n\nhttps://preview.redd.it/5vjx9396oi9d1.jpeg?width=592&format=pjpg&auto=webp&s=6f205b6221891590d13ead8bd6b2f8388b9381a8"
        ]
    },
    "Thoughts?": {
        "title": "Thoughts?",
        "score": 222,
        "url": "https://v.redd.it/a2w78s0wef9d1",
        "content": "not perfect due to my limited animation experience but pretty impressed",
        "num_comments": 28,
        "comments": [
            "It looks really cool, one suggestion I'd make though is to remove the thudding while walking, it doesn't seem realistic.",
            "Fairly well done! I like the lighting and background, and the animation on its head for the roar looks very nice! Id say however that your weak point would be the stiffness of its movement, mostly in the legs. I think looking at animals like cassowary and ostriches would be a good place to study from! I hope to see more of your work in the future!",
            "I like it, but as others have said, maybe soften the steps",
            "The lighting and setting looks good, but the animation is pretty static. If you can't fix that, I think you've got something going",
            "It looks good, but make it dip down a lot less when it steps. It seems to step and then the back end drops when every it steps again.",
            "The camera shaking has no sensible connection to the physics of the things happening in the scene.  Just get rid of it.",
            "the arms are wayy too stiff. the rest of the body looks pretty alive, but the arms look like a stop-motion animation using a JW figure.",
            "I love the Jurassic-Park sort of feel, like it can be an intro to something. Going for scientific accuracy 3/10, going for something that looks cool, 8/10",
            "Pretty good! Like other have said the shaking is a bit much. The animation school Im currently attending also has an indominus model we can work with. I might try and see if I can do the same as you. But Im guessing itll be harder for me, as  Im focusing on human characters as opposed to animal ones.",
            "Blud doesn't look heavy enough to be making those thuds."
        ]
    },
    "Not a dinosaur... But.": {
        "title": "Not a dinosaur... But.",
        "score": 85,
        "url": "https://i.redd.it/1iz7xd0wlg9d1.png",
        "content": "Oh my damn god this wolly rhinos baby from the new la brea show is so cute!",
        "num_comments": 11,
        "comments": [
            "You mean it's not chasmosaurus?",
            "All I see is a fury ceratopsian.",
            "No rhino of any species is supposed to live in North America during the late pleistocene (Wooly rhino lived in Eurasia)",
            "I thought that was a toxodont for a second.",
            "Finally, r/forbiddenboops for Paleontology lol",
            "Its theorized a boggy tundra buckle in Beringia was what prevented woolly rhinos from being able to expand their range into areas of suitable tundra steppe habitat in Alaska and the Yukon.",
            "True how surprising you know it looks like a styracosaurus",
            "awwww so cutee",
            "What is this from?",
            "La Brea"
        ]
    }
}