{
    "[Awareness] There has been an increase in the number of bots, using this subreddit to farm karma and post unfunny/facebook mom typa posts, and I've noticed there are some similarities between all of them.": {
        "title": "[Awareness] There has been an increase in the number of bots, using this subreddit to farm karma and post unfunny/facebook mom typa posts, and I've noticed there are some similarities between all of them.",
        "score": 183,
        "url": "https://www.reddit.com/r/discordVideos/comments/1bw7mn3/awareness_there_has_been_an_increase_in_the/",
        "content": "1. Bot accounts use overly generic titles, things like \"Sooo unexpected, watch till the end\", especially with laughing emojis\n2. Bots take part in the following 2 other subreddits, r/TiktokCringe and r/SipsTea\n3. Bots also tend to comment on their own post, with a caption that seems to be copy pasted when posting the same video on the other two subs they repost the same media to. (To farm even more karma by getting the top comment)\n4. Inactive for a year or more, and few posts since then.\n\nPlease report posts from users that satisfy atleast 2 of the following criteria, and report the account to reddit.  \nWE SHALL NOT LET THE BOTS DO WHAT THEY WANT.",
        "num_comments": 14,
        "comments": [
            "Sooo unexpected, read til end",
            "one thing to add about the bots comments, they tend to copy the top comment from the original post. So you could easily copy and paste the comment into the search bar and figure out which post was stolen from",
            "Bots also go to r/askreddit",
            "this is a good reminder to unsub from r/sipstea",
            "thank god im not a bot, beep boop btw boop",
            "Make me a mod I'll end it once and for all",
            "It’s been over 2 months. Bots haven’t left yet.",
            "Just wakin' up in the mornin',\n\n\nI don't know,\n\n\nBarkin' from the dog, smog\n\n\nAnd momma cooked a breakfast with hog (damn!)\n\n\nI got my grub on, but I did pig out\n\n\nDidn't get a call from a girl I wanna dig out (what's up?)\n\n\nI gotta go 'cause I didn't get me a drop top\n\n\nAnd if I hit the switch, I can't make the ass drop\n\n\nHad to stop at a red light\n\n\nLookin' in my mirror, a jacker in sight",
            "Damn that's crazy bro",
            "MOOODSSS"
        ]
    },
    "A very sad meme": {
        "title": "A very sad meme",
        "score": 5101,
        "url": "https://v.redd.it/sxr7qx1l6e9d1",
        "content": "",
        "num_comments": 40,
        "comments": [
            "I knew a few kids like that in my high school, and in some of the schools I visited for athletics.\n\nThey all ended up suspended one way or another, but I really do hope life sets their head straight one day.",
            "Choices today, consequences tomorrow. Stay focused, stay positive.",
            "Was very common when I was in Elementary school. Kids would say fucked up shit 5 feet from their moms picking them up at the end of the day and then their moms wouldn’t do anything because they didn’t know the words their children were speaking.\n\nHappened with this one kid. Year one of him being at our school he was just an absolute menace, then every year after that he just became the whiny kid that would screech-cry whenever something didn’t go his way because he never learned to be social. I think he got called to the office at least twice a month",
            "Not me though, I became an unemployed  mess with mental issues.",
            "Jesus fucking Christ dude, this is depressing",
            "the amount of specificity in this makes me believe this is more than a meme, i feel like this is someone’s way of expressing something that they’ve witnessed or are personally going through and it makes me really sad.",
            "Not me though. I came from very abusive parents who hail from the Philippines.",
            "This is why the mafia is superior",
            "When you realize your potential early, and it shows.",
            "They really think this is their whole life."
        ]
    },
    "chaddete": {
        "title": "chaddete",
        "score": 633,
        "url": "https://v.redd.it/7tizamgqxg9d1",
        "content": "",
        "num_comments": 16,
        "comments": [
            "Hate how they had their answers fast and ready to go",
            "I feel like my gf like this.",
            "She didn't even answer the question 😭",
            "I mean its just a weirder version of \"Which celebrity do u find the hottest\"",
            "We got a winner",
            "MGK fuckin lmao",
            "She's a keeper",
            "🗿",
            " Really well thought out",
            "![gif](giphy|fSAyceY3BCgtiQGnJs)"
        ]
    },
    "How?": {
        "title": "How?",
        "score": 194,
        "url": "https://v.redd.it/evymzs52th9d1",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Either this shit is in reverse or bro learned from a grasshopper 💀",
            "Mans never heard of reversing a video",
            "Close enough, welcome back hinata shouyo",
            "Bro has potion of leaping II",
            "And people walking backwards is a local custom",
            "Yeah its in reverse, but would be cool for this guy to jump like the hunter from L4D",
            "how did they even get into that position if it is reversed 😭",
            "Reverse ofcourse",
            "Google en reverse",
            "Jump good"
        ]
    },
    "Cars are the best": {
        "title": "Cars are the best",
        "score": 1775,
        "url": "https://v.redd.it/dxjrd8ok2e9d1",
        "content": "",
        "num_comments": 34,
        "comments": [
            "Cars 2 is better than the other movies because an entire oil rig of cars dies in the first scene.",
            "proceeds to die a chad",
            "I absolutely loved that movie as a kid and idk why it got shat on so badly",
            "“I can replace an engine block” *dies 10 seconds later*",
            "Cars 2 is the best cars imo idk why it gets shit on so bad",
            "Cars 2 was the best Pixar movie ever fight me",
            "I've said it before and I'll say it again. If cars 2 was it's own thing and we had another cars 2 to replace it it would be a peak asf movie",
            "Outside from the fact that that car is voiced by Bruce Campbell (same guy is also in Evil Dead), this movie, although it has nothing to do with the other Cars films, is actually the BEST OUT OF THE TRILOGY and I will defend that opinion until I die",
            "I rather die than pretend that Cars 2 wasn’t peak fiction",
            "I still cant believe they got fucking bruce campbell in this"
        ]
    }
}