{
    "Swedish Open - Day 2": {
        "title": "Swedish Open - Day 2",
        "score": 9,
        "url": "https://www.reddit.com/r/discgolf/comments/1dr5rlo/swedish_open_day_2/",
        "content": "**Date:** 28-Jun to 30-Jun-2024\n\n**Location:** Boras, Sweden\n\n**Tier:** Elite\n\n[PDGA Event Page](https://www.pdga.com/tour/event/78195) | [PDGA Live-Scoring](https://www.pdga.com/apps/tournament/live/event?eventId=78195&view=Scores&division=All&round=2)\n\n**Tournament Coverage**\n\n*Live:*\n\n[Disc Golf Network](https://www.discgolfnetwork.com/show/swedish-open) - MPO and FPO Lead\n\n*Post-Production:*\n\n[MDG Media](https://www.youtube.com/@MDGMedia) - MPO & FPO Lead",
        "num_comments": 9,
        "comments": [
            "Ricky started to play lol",
            "This round kinda sucks to watch damn. Everyone just hitting trees.",
            "Pablo is locked in and Proctor turned the hat backwards, its go time",
            "The booth has me thinking we're all pronouncing Ella's last name wrong. Maybe it really is Hon-sehn. \n\nGoogled it - Hansen is Scandinavian, which Sweden is a part of.",
            "Kristnardttir putts just like Calvin",
            "Yeah wtf happened round 1",
            "Airport misplaced his raptor legs. Got them today.",
            "Seriously.  Anybody who follows his socials know if he posted anything about it?",
            "Eesh Paul that hurt"
        ]
    },
    "Luke Turnbull #63994 - PDGA BoD Candidate - Ask Me Anything": {
        "title": "Luke Turnbull #63994 - PDGA BoD Candidate - Ask Me Anything",
        "score": 10,
        "url": "https://www.reddit.com/r/discgolf/comments/1dq3dn9/luke_turnbull_63994_pdga_bod_candidate_ask_me/",
        "content": "Hey folks! \n\nIt's the last Friday here in Australia before PDGA Elections kick off. I am one of [seven candidates ](https://www.pdga.com/news/get-know-2024-candidates-pdga-global-board-directors#pdga-number-63994)up for three board positions so fire away with any questions you have and I will answer what I can. \n\nI've no set deadline for when this will finish and will drift in and out throughout the day... and being one of the mod team here, I will be around for the foreseeable weeks/months/(years?) and happy to answer any questions posted in here for however long they keep coming in. \n\n",
        "num_comments": 23,
        "comments": [
            "Being a Reddit mod, are you worried about social media pushback about Board decisions if you get elected?",
            "assuming you get elected, what candidates do you think should get the other two BoD positions?",
            "What are some things your have achieved during your time with ADG that you are particularly proud of?",
            "Why does the PDGA continue to ignore issues related to AM division splits? With an average player rating of 860, there should be equal divisions above and below that mark, not just MA4 below.",
            "Can you please remind everyone if PDGA board positions are paid positions or volunteer positions?",
            "Not overly, no. I've already signaled my intent to step down as mod here as well as my current role as Chairperson of Australian Disc Golf if I am successful in my election campaign. The PDGA interview committee said that they wouldn't expect that, but I think any potential conflict of interest, whether actual or perceived, should be reduced or eliminated where possible.",
            "I think the PDGA board needs more diversity - in terms of gender, ethnicity, geographical location and professional status. I think it's also important to have new people with new ideas on the board to capitalise on the growth of the sport post COVID.\n\nWith that in mind, two from Terhi Kyt from Finland, James Koizumi from Canada or Leah Tsinajinnie as the only current Pro representative.",
            "How about just picking the best people for the job instead of forcing ridiculous quotas. So stupid. This should be the last thing considered, not one of the most important. You come off like a disengenous politician.",
            "860 is the publicly stated PDGA male average rating. On their FAQ",
            "You come off like a reactionary idiot"
        ]
    },
    "Throwing discs into the suburban void": {
        "title": "Throwing discs into the suburban void",
        "score": 30,
        "url": "https://i.redd.it/yzj8tgc2di9d1.jpeg",
        "content": "Colonial Acres, Delmar NY",
        "num_comments": 3,
        "comments": [
            "I fell into the suburban void once. When I had finally dragged myself out, I was covered in banana republic and couldn't stop going on about how useful the underfloor storage in my SUV was.",
            "When not tossing you should read some John Cheever, if you havent already: The Swimmer"
        ]
    },
    "Hyzer Flip to flat, finish left (rhbh) mid": {
        "title": "Hyzer Flip to flat, finish left (rhbh) mid",
        "score": 14,
        "url": "https://www.reddit.com/r/discgolf/comments/1drayqo/hyzer_flip_to_flat_finish_left_rhbh_mid/",
        "content": "What is your favorite for this slot? Was trying the more traditional straight mids for this but I'm finding that I really want something to compliment my Svea in woods. I use it most of the time, but sometimes it turns more than I want if I don't give enough Heiser. \n\nI want a mid to compliment that where I can trust it to Heiser after flipping to flat. So I can throw both discs on Heiser and trust one (Svea) to finish dead straight or a little right, and trust the other to finish straight or slightly left. ",
        "num_comments": 47,
        "comments": [
            "I throw the Hex for that, specifically a Neutron or Eclipse Hex. Fission works in the winter when I throw slower, but in the summer it usually finishes flat or slightly over. My typical distance with the Hex is in the 95105 meter range.",
            "A beat in Buzzz works well for this. Personally, I find myself throwing a softer flat Crave rather than depending on the flip up. I need to add a more understable mid to make short flips and turnovers easier.",
            "If you want to keep with kasta the gote is a great slower straighter option from the svea but still carries pretty far",
            "A newer buzzz ss or beat in buzzz is good for this",
            "Glad ya ask, Tursas is my hyzer flip mid or a fuse to finish more left.\n  Hit a first available off the tee yesterday. Picked up the Tursas and put a Im mad committed Hyzer flip on it. 50 out I said Do it and it did it. 250 dead straight birdie. Glad I had a witness.",
            "Detour does this well as long as I am not throwing full power",
            "Md3, chariot, jay, metal warrior.  Theyre all the same disc.",
            "Slightly beat up kc roc.",
            "Hex or Origin.\nBoth will fit this slot.\nEven a Stig if you are going faster",
            "Streamline echo. Feels great in the hand and cheap on Amazon. Slightly more understable than a buzzz ss. Flips up easy but still has some fade."
        ]
    },
    "Ching Discs has been acquired by r/StokelyDiscs ": {
        "title": "Ching Discs has been acquired by r/StokelyDiscs ",
        "score": 181,
        "url": "https://i.redd.it/npc76gnt9e9d1.png",
        "content": "",
        "num_comments": 32,
        "comments": [
            "Very cool!  Would love to have these in my shop, any idea where we can get wholesale details?",
            "Dude. Im so happy right now. Thank you Scott. For everything you do. Thank you.",
            "What are the 6 original molds that will be released? Any chance the Tank is one of them?",
            "Who does the production for these guys and where have they been? Just haven't heard anything about them until now.",
            "I had a ching putter when I was a kid",
            "Dude I use one currently as my approach disc!!",
            "Very cool, been meaning to grab some of your stuff. I remember getting smoked by you in distance comps in the 90s. I'd see they hair and know I was going for second.",
            "Dude this is tight. How did you go about acquiring the molds? And what does your production setup look like? Ive been following Trash Pandas story for a while and would love to know the Stokely situation!",
            "My first disc ever was a Ching Sniper. I was so sad when it was lost.",
            "I made a post earlier about this, but Im glad you made an official announcement. Also, what original Ching molds do you plan on bringing back?"
        ]
    }
}