{
    "Mod approval only is now on": {
        "title": "Mod approval only is now on",
        "score": 137,
        "url": "https://www.reddit.com/r/distressingmemes/comments/1bm694z/mod_approval_only_is_now_on/",
        "content": "Since we’ve been having both issues with lapses in moderation as well as post quality as the sub has grown and people become less and less in touch with what this sub is supposed to be about, we’ve implemented mod approval only settings.  We’ll get to your posts when we get to them and they’ll be added to the post queue in the order that they are approved.\n\nWe’ll see how this method goes for a bit and then reevaluate",
        "num_comments": 1,
        "comments": []
    },
    "It always comes": {
        "title": "It always comes",
        "score": 441,
        "url": "https://i.redd.it/ba0vw0kfz59d1.jpeg",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Finally a real meme.. I can die now.\n\n(he said)",
            "For those who don't know, this is an scp\n\nEdit: Scp-965 to be exact",
            "Heyyyy you took a picture of me in the bottom right not cool",
            "the reposting is the real distressing part",
            "A repost?!?! In MY distressing meme subreddit? GRAAHHHH!!!",
            "cool, thanks for the info",
            "William Afton always comes",
            "Sackboy lookin ass",
            "which SCP is it?",
            "Scp-965"
        ]
    },
    "Oolala": {
        "title": "Oolala",
        "score": 1297,
        "url": "https://v.redd.it/rjad9myy249d1",
        "content": "",
        "num_comments": 36,
        "comments": [
            "Hehehe I can make another",
            "Donate sperm, bingo bango moloch gets baby and i get unlimited riches, offer more sperm so moloch is happy and doesn't reneg on his deal",
            "Offering up my first born child doesn't sound too bad of a deal!",
            "So Moloch is the God of Abraham? The Binding of Isaac makes a lot more sense now",
            "Ok, but exactly how much blood do you require?",
            "this one is actually disstressing tho. Good job, OP!",
            "Finally.. A good meme.. I can die peacefully..\n\n(he said)",
            "Im trans and a lesbian, lets shake on it buddy",
            "I get a get-out-of-jail-freecard from if I somehow fuck up majorly and get a child? Sign me up",
            "I just finished the Fall of the House of Usher and the dude there offers his entire bloodline.\n\nMoloch needs to step up his game."
        ]
    },
    "Is it hot in here?": {
        "title": "Is it hot in here?",
        "score": 2556,
        "url": "https://v.redd.it/wy5qd6zck19d1",
        "content": "",
        "num_comments": 113,
        "comments": [
            "me when i dip my balls in sulphuric acid",
            "oh man random scary face oooOOOoooOOOooo",
            "sending this to my homie\n(hes on an acid trip rn)",
            "The walls are covered in scratches",
            "it's a little toasty, methinks",
            "Scared me bro i don't know why, but when they said \"is it hot in here\" i jumped in fear before the actual scary thing csme",
            "whys someone burpin in my ear",
            "The face does nothing for me...The grudge noises...You need to be put in prison...",
            "Is the scary content back?",
            "bro which mod approved this "
        ]
    },
    "Game night": {
        "title": "Game night",
        "score": 943,
        "url": "https://v.redd.it/8mblr1ly609d1",
        "content": "Found it in r/discordvideos I think",
        "num_comments": 35,
        "comments": [
            "Dominos delivery guy had a bad day",
            "Roses are red cacti are pricky holy crap that escalated quickly",
            "... Ok Hear Me Out",
            "yooooo they made the unknown from dbd in real life",
            "That spin was so genuine lol",
            "would (on a real note W horror art)",
            "Ok but who the hell goes into a room that has knocking coming from it without turning the light on first?",
            "Uh oh, mark, bad decision",
            "Final image kinda ruins it imo",
            "First knock made sense to check out but the second one INSIDE would have me booking it for a weapon."
        ]
    }
}