{
    "Quick Question MEGATHREAD": {
        "title": "Quick Question MEGATHREAD",
        "score": 264,
        "url": "https://www.reddit.com/r/DivinityOriginalSin/comments/pc5jpw/quick_question_megathread/",
        "content": "Another 6 month since the last Megathread.\n\n[Link to the last thread](https://www.reddit.com/r/DivinityOriginalSin/comments/lrn0gx/quick_question_megathread/)\n\n**Make sure to include the game(DOS, DOS EE, DOS2, DOS2 DE) in your question and mark your spoilers**\n\nThe FAQ for DOS2 will be built as we go along:\n\n>My game has a problem/doesn't work properly, what do I do?\n\nCheck [this](https://steamcommunity.com/app/435150/discussions/6/3223871682609294995/) out. If you can't find a solution there contact Larian support as detailed.\n\n>Do I need to play the previous game to understand the story?\n\nNo, there is a timegap of 1000 years between DOS and DOS2. The overall timeline of the Divinity games in perspective to DOS2 looks like this: DOS2 is set 1222 years after DOS1, 24 years after Divine Divinity, 4 years after Beyond Divinity, and 58 years before Divinity 2.\n\n>How many people can play at once?\n\n* Up to 4 Players in the campaign and up to 4 players and a gamemaster in Gamemaster Mode.\n\n>Do I need to buy the game to play with my friends.\n\n* That depends on how you will play. Up to 2 Players can play on the same PC for a \"couch coop\" experience. This means you can have 4 player sessions with 2 copies of the game when using this method. If you don't play on the same PC each player is going to require his/her own copy.\n\n>Can I mix and match inputs for PC couch coop?\n\n* You can't use keyboard and mouse for couch coop, however you can mix controllers.\n\n>What's the deal with origin stories?\n\n* A custom character has no ties in the world whatsoever, nobody knows you. Origin characters on the other hand do have ties in the gameworld, that means people can recognise you and might interact differently with an origin character because of that characters reputation or because the characters have met before. Furthermore origin characters have their own questlines that run alongside the main story.\n\n>I don't like my build! Can I change it?\n\n* Yes! Once you leave the first island you get access to infinite respecs, with the second gift bag you can even get a respec mirror on the first island.\n\n>What are the new crafting recipes from the gift bag?\n\n* [List](https://steamcommunity.com/sharedfiles/filedetails/?id=1137514488)",
        "num_comments": 4664,
        "comments": [
            "DOS2 DE PC: My party is using the gift bag \"mods\" for the first time. We turned on the custom bag mod where you have a bag for every item type. It seems almost as bad as a cluttered inventory to lose your items in each bag and go searching for them with then no way to sell items from inside the bags. Any tips on inventory and making these bags work in a user friendly way?",
            "Who is the fucking shithead who programmed a new \"launcher\" which is bigger than the screen, not movable and makes it virtually impossible to play the fucking game?",
            "DOS2 DE  \nHow and when do companions leave? is it likely to trigger? and if so, how do you best avoid it?",
            "[deleted]",
            "I've been trying and failing to get into this game for 2 years, mostly cos of option paralysis. I've essentially spent 12 hours getting repeatedly murdered (often self-inflicted) and completely failing to pick a team.\n\nI need someone to recommend a solid starting crew, with ideal skills per character.\n\nYes, I'm fully aware \"staring builds don't matter that much\" and \"you get a full respec anyway\". This doesn't help. At all. I'm already drowning in choices I can't make. Being able to unmake them just adds another level of total cluelessness\n\n&#x200B;\n\nHelp me. Please.",
            "I can't open captain Zapor's chest, where the boots are. Wonder why? Can't destroy it, teleport it, bless it, I'm unable to pick the lock due to lack of thievery - or is that the only option? I fought the crew by the chest",
            "There's a unique axe in arx that automatically gets the sparkster status; does that effect stack with sparking swings/master of sparks or is it redundant?",
            "I CANNOT ADD RUNE.\n\nIm literally going crazy. I have armor with a slot. Put rune into slot. Click extract. Rune goes back to inventory and nothing happens.",
            "Just finished a Skyrim play through and decided to pick up this game. Of course since I was coming from Skyrim I set myself up in tactician mode because Skyrim difficulty is a joke. Am currently 10 hours and have been resetting the fight with the guy who summons a hound and the archers who constantly knock you down for like an hour now. Any tricks for that fight, also how badly am I gonna get fucked during this play through.",
            "I'm doing the quest Up In the Clouds, I have killed the Knight of Amadia, she attacked me when I didn't answer her question. I now don't know what to do. Guides say speaking with her completed a quest, but my active quest step is still Speak with the Knight of Amadia. Please assist, I feel dumb.\n\nUpdate: For the few maybe like me who forgot where the exit to the cloud temple is, it's near the face. How could you forget you ask? Save up there and not play for a few days, totally forgot how I got in. No idea how to resolve the issue I asked about however, I played through again, befriended her, and then found the vines. Maybe leaving updates the quest in the event you kill her? I don't know."
        ]
    },
    "Looking for group MEGATHREAD": {
        "title": "Looking for group MEGATHREAD",
        "score": 177,
        "url": "https://www.reddit.com/r/DivinityOriginalSin/comments/pc5lqg/looking_for_group_megathread/",
        "content": " \n\nOld one got archived so here is the next one.\n\nPlease keep all replies to this thread strictly LFG related. If you have any questions about the game itself, please post these in the quick questions sticky thread.\n\nThe comments will be sorted by newest, so that the most recent submission is on the top.\n\nMake sure your comment contains:\n\n**Which game the entry is for: DOS, DOS EE, DOS2**\n\n**Which Platform are are you playing on: PC, XBOX1, PS4**\n\n**How to contact you, possibly on the given platform**\n\n**Your usual gaming hours**\n\nIn addition to these 4 major details, feel free to include anything else that might be relevant- such as whether you want to play with a specific age group, want to do a lot of roleplaying etc.\n\nThere is also a section of the [DOS2 Steam Community](http://steamcommunity.com/app/435150/discussions/7/) dedicated to LFG.",
        "num_comments": 1013,
        "comments": [
            "For those that see this. I created a PS4 group chat specifically for this game. We have 10 people and rising. If you want people to play with, please DM me and I’ll add you on ps4 and add you to the group!\n\nWe are very welcoming, committed, and we communicate well! \n\nAnyone is welcome, the group is fairly experienced 😀",
            "DOS2\n\nPlatform: Xbox/PC \n\nGroup size: Hopefully we can get a group of 4 for a full playthrough.\n\nI just finished my first play through of the game about a month ago. I think I’m ready to jump back in on tactician or home mode if you’re up to it as well. I’m a 20 year old college student with a part time job as well so I’m usually available after 9pm EST. I don’t really care about your age as long as you’re 18+, I’m not interested in playing with any kids sorry. My discord is ItsPlum#2222. You can contact me there or here. Look forward to meeting you all.",
            "DOS2 on PS4\n\nLooking for a single companion, I want to run a ranger/summoner. Haven't played past reapers coast because I keep restarting and trying out different builds but I want to get a solid run through with someone and commit to this build. Comment or DM me if interested with an idea of what build you'd like to run",
            "Hey guys,\n\n(Ps4) Looking for group w/ mics, I have a friend that always runs DOS2 but we would like two more people for a full party. Add my psn @RussianSpartanX",
            "DOS 2 (PC) looking for a duo \nTactician mode \n25 years old \n\nHeya I’m from New Zealand (GMT +12) looking for a duo or group :) . I play around 7pm-9pm, maybe around 3 times a week . \n\nI like playing with the harder difficulty but I’ve always stopped playing after fort joy. Really wanting to finish this game this time . I like to take my time with the game 😄\n\nPlease message me here if you are keen 👍👍",
            "* **Game:** DOS2\n* **Platform:** PC\n* **Contact Info:** A message here on Reddit or through Discord at HorrorFan546#2808 would be best.\n* **Usual Hours:** I work Friday through Tuesday from 7 AM to 4 PM EST/EDT, so in general I'd be most available in the evenings. The big exception to this is Wednesdays, when I have an online Pathfinder 2e session from 6-9 PM.\n* **Other Stuff:**\n   * The biggest thing I need to mention is that due to being mute, I unfortunately cannot use voice chat for communication. I can however listen in and type responses as necessary, if someone really wants to; or going full text-only communication is an option too.\n   * As far as age group goes, I'm gonna say 18+ only, just to avoid any potential awkwardness from being in my 20s and playing with a bunch of younger teens or whatever. LGBTQ+ & PoC friendliness is also a must, because I won't tolerate any sort of bigotry.\n   * This *is* kind of my first playthrough still, since the furthest I ever made it was midway through Act 2 on PS4 with a co-op partner who wound up ghosting for some reason. With that said though, I am open to the inclusion of some quality of life mods from either Nexus or the Gift Bags.\n   * I played DOS1 (and what I have played of 2) on Tactician difficulty, so I would certainly prefer to stick with that. No Honour Mode though; I'm not ready for a permadeath run quite yet.",
            "Game: DOS 2\n\nPlatform: PlayStation 4\n\nPlayStation Gamertag: WickedTyrant_\n\nAvailability: Sunday- Thursday anytime after 6pm Eastern Time, on Friday and Saturday, literally all day lol\n\nI’ve played Classic mode about 4-5 times through now and I wanna run a lone wolf duo with someone on tactician but I’d be down for classic as well. If a couple of y’all wanna run a 3-4 man party, i’d also be down to do that as well.\nA lot of my friends won’t give this  game a chance so I really want to play with someone who’s down. Doesn’t matter if you’ve played a lot or barely any, anyone’s down to play with me :)\n\nEdit: Also I’m 23 years old, so I’d prefer to play with people around my age, give or take 5 years lol",
            "Game: DOS2\nPlatform: Playstation\nAvailability: Almost every day after 8pm EU time\nI never played this game before and would love some people to play with, new or experienced is both fine. I'm okay with VC too!",
            "PC.\n\n EST zone.\n\nMsg me here\n\n Available after 5pm weekdays. Weekends anytime. Game, any Larian game, not limited to Larian for breathers.",
            "DOS2\n\nPS4\n\nDM me here and I'll drop you my PSN!\n\nHours are odd, I run a bar, so usually I'm on late night EST, but sometimes I'll be available during the day during the week. Not so much weekends.\n\nI'd prefer voice chat, cause it's nice to talk to people, and 18+ because I use terrible language and some adult themes may come up.\n\nHope to see y'all online!"
        ]
    },
    "Should I be worried over the fact that these training dummies apparently breathe?": {
        "title": "Should I be worried over the fact that these training dummies apparently breathe?",
        "score": 652,
        "url": "https://i.redd.it/5l4j0i6cay7d1.jpeg",
        "content": "",
        "num_comments": 23,
        "comments": [
            "According to the crows, they are real humans",
            "“You can’t breathe now.”\n\n“I never breathe.”\n\n“Yes, but now you *can’t*.”",
            "you can put some doors to sleep too",
            "It’s a different kind of suffocation. You’re always in their hair, you won’t let them have their own friends, and your suspicious nature has sapped all their love for you away.",
            "WITCHCRAFT!",
            "That picture shows that it is in fact NOT breathing.",
            "Don't tell him about the scarecrows",
            "Slap a source collar on the sucker asap",
            "Nah she’ll be right keep punching",
            "It's fine, it's just pretending to suffocate. It takes its job seriously."
        ]
    },
    "Any mods for DOS2 like \"Into The Void\" for BG3? ": {
        "title": "Any mods for DOS2 like \"Into The Void\" for BG3? ",
        "score": 1,
        "url": "https://www.reddit.com/r/DivinityOriginalSin/comments/1dlvswa/any_mods_for_dos2_like_into_the_void_for_bg3/",
        "content": "Basically looking for a mod which would allow me to have my party members return to the boat/hide somewhere at the start of combat so that only my main character can fight and get the benefits of lone wolf. That way i can still do their story bits but still have the challenge of a solo character",
        "num_comments": 0,
        "comments": []
    },
    "Fane Sketch": {
        "title": "Fane Sketch",
        "score": 158,
        "url": "https://i.redd.it/7v84o20jgv7d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "I don't know why but he looks more like Skeletor 😂",
            "He looks pretty concerned",
            "*Yields to none*",
            "I was gonna say he looks like the cat with the salad",
            "Skeletor wearing sunglasses.",
            "It's probably because he's missing his pointy chin. The skull is human-like as opposed to it's usual angular shape. Still a handsome skeleton as always!"
        ]
    }
}