{
    "**/r/DJs NEW RULES** Please read before posting": {
        "title": "**/r/DJs NEW RULES** Please read before posting",
        "score": 303,
        "url": "https://www.reddit.com/r/DJs/comments/dbg3nr/rdjs_new_rules_please_read_before_posting/",
        "content": "New /r/DJs  Rules.\n\n\n**Top rule - BE NICE.**\n\n* Please try to be polite, friendly and helpful when commenting.\n* Trolling, slapfights, general assholery is not encouraged and it also goes without saying that **racist, sexist, homophobic, and transphobic posts and language will not be tolerated** at all.\n\n**Moderation policy**\n\n* /r/DJs is not a big sub.  We tend to encourage discussion and engagement first and foremost.  There will be times posts that are seemingly against the sub rules will be left up because the discussion in the comments is informative and engaging.  This is generally more for when a post breaking (certain) rules was missed and the community has already heavily engaged in discussion.  If you see posts breaking the rules, reporting them will help us remove them earlier.\n* remember to search - lots of questions tend to be asked multiple times and plenty of answers are given in the archives\n* remember that if you are a regular user, newer users are allowed to discuss the same things if it's not overly-frequent.  Just because something was discussed 3 months ago doesn't mean users can't have another conversation about it.\n\n\n**Please ensure you are posting to the correct subreddit**\n\n * /r/DJs is generally for more experienced/professional DJ discussion.  There is an entire subreddit dedicated to learning DJing and is filled with experienced DJs willing to spend time helping people out.\n\n**Any and all beginner questions and posts should be made in /r/Beatmatch.**\n\n*Beginner questions include posts that start with:*\n \n* “I’m new at this”\n* “I want to get into DJing”\n* “I just started”\n* etc.\n\n*And includes anything basic like:*\n\n* “What controller/headphones/speakers should I buy?” (within reason - someone experienced looking for higher end gear or looking for real world feedback on pro-level stuff is fine).\n* “What program should I use?”\n* “How do I use this effect?”\n* “Is beat matching really important?”\n* “Why the hate for sync?”\n* etc.\n\n*Any beginner posts here will be deleted.*\n\n\n**DJ Setup pictures belong in /r/DJsetups.**\n\n* There will be some exceptions - some rare or classic booths or extraordinary setups will stay up, but if you want to post a picture of your DDJ 400 and KRK Rockits, your Technics 1200s and DDJ S9, or a standard CDJ NXS setup that we've all seen, please post to the appropriate sub.\n\n**Meme/Humor/crappy image posts belong in /r/DJsCircleJerk.**\n\n* This includes the low effort, \"djs be like dis” - *stupid picture* - type posts and the like.\n\n**Mixes**\n\n* Most mix posts will be deleted. \n* Short routines, showcasing of interesting technique, and videos that shows off the poster doing something cool is fine. We will also allow high profile posts - say if a regular user gets a feature mix on DJCity or a Serato sponsored set.\n* Sets from high profile DJs like boiler room or festivals sets is allowed.\n* DJs who want to share mixes can post in /r/mixes or a weekly mix thread that we will be starting soon.\n\n**Gig pictures/Stories**\n\n* We're starting a new weekly sticky every Monday specifically for gig pictures and stories.  We've been seeing a lot more of these posts and while they tend to be heavily upvoted, they also end up just being a picture of some DJ hunched over a setup with a bunch of back-patting in the comments that clutters up the sub.  Any posts of this nature will be deleted and the user will be directed to the weekly Sticky thread.\n\n**The following topics are against sub rules and will be deleted:**\n\n* Self-promotion posts including mixes, tunes, events, companies, competitions, etc.  The one exception we may allow are open deck nights that members of /r/DJs can attend.\n* For-sale posts\n* Posts discussing music piracy (in the sense of people asking how where or how to pirate music, if you want to have an actual discussion on piracy and how it pertains to the industry, by all means).  Support the people who make your hobby/career possible. \n* Obvious spam for youtube channels/gig logs/blogs/advertisements from members who have no participation in the sub. If people are regular posters on this sub and have a video/service/etc they wish to share, we will allow it initially, although regular spam of it will not be tolerated.\n* Posts asking “what should I play for this gig?”  This is a sub for experienced DJs, if you need to ask the internet what to play for a gig, you probably shouldn't have taken the gig.  General music discussion is absolutely fine.\n* Spotify playlist posts\n\nPLEASE REPORT posts and comments that violate the above rules or just suck. Thank you!",
        "num_comments": 99,
        "comments": [
            "Who thinks self promoting in this sub is worth? That's like a baker trying to sell his bread to other  bakeries.",
            "Cheers soo. I see a lot of subs turning into pictures that people want to share and they are just after the back pats.  I appreciate the work you put into the sub.",
            "So what the hell are you allowed to discuss here? These rules seem like \"alright this is a DJ sub but you can't discuss anything about DJing, so yeah\".",
            "The no sexism, racism and transphobia rule rules!\nSure dont see it often in here, but when i do i want to break the try to be nice rule.",
            "Just popping in for my yearly comment. Hi!!!",
            "Thanks for all the great work Soo!",
            "Thank you for this. I've seen too many electronic music boards die due to pretentious snobbery (metacritic, gamefaqs, whatsapp groups) which simply turns everyone off and the board is left with 5-6 elitists who then have no one to pick on. I for one would like to see this rule seriously enforced to upkeep the livelihood of this sub.",
            "Thanks again for putting in the work to keep the sub great.",
            "Cool! I’m an experienced DJ but new to Reddit. I’m in Texas. Love, DJ GURRL",
            "What’s the subreddit for DJ learning/resources?"
        ]
    },
    "Share your stuff - mixes/tunes/routines/videos (no livestream promotion)": {
        "title": "Share your stuff - mixes/tunes/routines/videos (no livestream promotion)",
        "score": 8,
        "url": "https://www.reddit.com/r/DJs/comments/1dozbb0/share_your_stuff_mixestunesroutinesvideos_no/",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Deep House, Dance and Amapiano Mixes here : \n\n[https://www.youtube.com/@AmbitHitz](https://www.youtube.com/@AmbitHitz)",
            "Open format psychedelic audiovisual sets:\nhttps://m.youtube.com/@vox-ex",
            "I finished my first song my first song hahah [https://www.youtube.com/watch?v=wvwmg644tyg](https://www.youtube.com/watch?v=wvwmg644tyg)",
            "Chill breakbeats and techno. I think I was a little too avante-garde because I didn't retain much of an audience in my stream, but at least i had a good time.\n\n[https://www.youtube.com/watch?v=t1MwSLDxM7s](https://www.youtube.com/watch?v=t1MwSLDxM7s)",
            "My vinyl only mixes \n\nhttps://on.soundcloud.com/owuEK6xMNsZzCiEg9",
            "Link to Vol 3 of my series, this one is upbeat & vocal house, Vol 4 soon which is back to uplifting trance. All DVS mixed.\n\n[Capel Del Mar](https://www.mixcloud.com/HassallandPeck/capel-del-mar-vol-3/)",
            "heavy dark experimental techno, pretty trippy\n\nopening for Air Liquide, about/blank Berlin 2018 \n\nhttps://hearthis.at/sheldondrake/staub181027/",
            "[PROGRESSIVE HOUSE/PROGRESSIVE TRANCE/ACID/TECH HOUSE] 1h\n\nMy new Space odyssey mix:\nhttps://m.soundcloud.com/ardi_rd/ardee-klubska-scena-space-odyssey-mix\n\nFull of spacey and acid vibes. Some of artists: Aldonna, Occibel, Cybernet, Guy contact, Astro...",
            "[https://soundcloud.com/vitamind-avl/afmg-20th-anniversary?si=2cf5555a742e41f8aca50532ea473ea2&utm\\_source=clipboard&utm\\_medium=text&utm\\_campaign=social\\_sharing](https://soundcloud.com/vitamind-avl/afmg-20th-anniversary?si=2cf5555a742e41f8aca50532ea473ea2&utm_source=clipboard&utm_medium=text&utm_campaign=social_sharing)\n\nHere's my most recent set from the Asheville Full Moon Gatherings 20th Anniversary event this past weekend. Scheduled to play 2hrs but because the artist after me showed up late I played an extra 30 minutes. 2.5hrs of deep, raw, hypnotic trance music for your enjoyment\n\nTracklisting:\n\n1. Soul Alt Delete - Time Bends (Extended Mix)  \n2. Maze 28 - Quantum Touch  \n3. Paul Thomas - Summersault (Extended Mix)  \n4. Allan McLoud - Embrace Me  \n5. Deestopia - Introspection  \n6. Andrewboy + Shane 54 - Klondyke  \n7. Maze 28 - Great Attractor (Ruben Karapetyan Remix)  \n8. Ormus - Gujarat  \n9. Onen - Manipulation (Zairi Torrez Remix)  \n10. Nors Kode - Tesseract  \n11. F4T4L3RR0R. - Homage (Focus FL Extended Remix)  \n12. WeTwo - Sanctum (Eli Spiral Remix)  \n13. Herks - Supernova  \n14. Solarstone - Leap Of Faith (Collide the Sky Extended Remix)  \n15. Blufeld - Moxie Mind (Extended Mix)  \n16. Pierre Pienaar + That Girl - Still Breathing (Extended Mix)  \n17. Coss - Forever Fantasy  \n18. Sean Tyas + Enigma State - Lately (Extended Mix)  \n19. Luke Terry - Unconditional (Extended Mix)  \n20. Daisy Moon - Pine Odyssey  \n21. Rhys Fulber - Running Out Of Sand  \n22. Planisphere - Deep Blue Dream  \n23. Coredata - Strangelove",
            "Tekno/Mental Techno mix\n\nhttps://on.soundcloud.com/tDrDKzshiJY8adpd8"
        ]
    },
    "Nostalgia? I still just love looking at Vestax gear": {
        "title": "Nostalgia? I still just love looking at Vestax gear",
        "score": 14,
        "url": "https://www.reddit.com/r/DJs/comments/1dr77u1/nostalgia_i_still_just_love_looking_at_vestax_gear/",
        "content": "Man, I still just love the look of Vestax gear.\n\nI grew up djing in the early 2000's and have an old PMC05 and always loved watching dj babu and Mix Master Mike using pdx2000's.\n\nI haven't djed in a while but want to buy a little serato controller. Doing some research (not going to get a Vestax) and came across a few old Vestax gear reviews... and man I still just love looking at everything they made.\n\nMaybe it's nostalgia but even if I'm not using them any more I had to share this somewhere haha. I'm sure I can't be the only one : )",
        "num_comments": 16,
        "comments": [
            "Come and check out r/vestax then, we have loads of pics of vestax gear to look at.",
            "Halcyon days, my friend... Halcyon days...",
            "I loved my Samurai 06. Unfortunately the technology wasn't  quite up to par as it had crossfader issues pretty quickly after I got it. Sent it back and that was my first move to Rane.",
            "Yup same here! Back in those days I've owned 05,06, and 07 My original ones are long gone but I've been slowly collecting them back 05s and 06s are decently priced on the 2nd hand market. Still haven't found an 07 I'm willing to pay for yet to complete the trinity",
            "I've got a pair of PDX A1s in my loft. It really pains me to have nowhere to put them.",
            "If you want to see some really great gear search for vestax on buyee (Japanese e bay) there are so many beautiful bits of gear and it’s cheap as chips , just costs loads to get it sent . I have pdx a1 turntables since 98  and still prefer them to any other turntables",
            "I always enjoyed using Vestax decks back when I was djing in the mid 2000s. Great pieces of equipment.",
            "I loved the Vestax scratch mixers (I splurged on the 07 ProD - that thing was sexy as hell).\n\nBut, I loved the look of the Ecler scratch mixers…",
            "Sorry to hear that happened to you! Wasn’t familiar with the pmc25… so I see you are team rotary knobs ☺️. \n\nHaha jk much respect. Made me think of those debates we’d have with people in message boards back in the day rotary vs upfaders",
            "Thank you! Just went there and it appears I am already one of the 336 members! Seeing people’s personal gear rather than Google search just hits different"
        ]
    },
    "Mid level turntables??": {
        "title": "Mid level turntables??",
        "score": 2,
        "url": "https://www.reddit.com/r/DJs/comments/1drcoiq/mid_level_turntables/",
        "content": "Alright I’ve been playing records out for a bit now and want to invest in some turntables. Technics 1200 seem unattainable because of the price tag. What is a good mid level turntable? Anyone have experience with audio technicas?? Help me out gang.  ",
        "num_comments": 6,
        "comments": [
            "Find a used pair of Vestax. I had a pair of PDT5000 before getting 1200s and they were very solid.",
            "AT-LP120 or 140XP\n\nWill be the best choice, even the reloop RP4000mk2 or Pioneer PLX 500.",
            "A few month ago I welcomed a DJ who really needed to have more than +-8% and the only option available was a Reloop RP7000 MK2 that a friend have and we were all quite impressed by them.",
            "Wait and save for used Technics or vestax. There are no good intermediate options.",
            "2nd this, the PDX2000 are about the best bang for buck.",
            "Reloop RP7000 mk2"
        ]
    },
    "Looking for a decent DJ willing to partnership and grow with a standup comedian for skits.": {
        "title": "Looking for a decent DJ willing to partnership and grow with a standup comedian for skits.",
        "score": 0,
        "url": "https://www.reddit.com/r/DJs/comments/1dre40b/looking_for_a_decent_dj_willing_to_partnership/",
        "content": "The DJ needs to understand queues from comic when to drop music and verbal material to seamlessly mesh during set. Needs to be located in preferably in Southern California , Orange County area. DM me to work out details if interested. Please be reliable, honest and have integrity. Thank you.",
        "num_comments": 0,
        "comments": []
    }
}