{
    "Problem Player Megathread": {
        "title": "Problem Player Megathread",
        "score": 0,
        "url": "https://www.reddit.com/r/DMAcademy/comments/1dmln9v/problem_player_megathread/",
        "content": "This thread is for DMs who have an out-of-game problem with a PLAYER (not a CHARACTER) to ask for help and opinions. Any player-related issues are welcome to be discussed but, do remember that we're DMs, not counselors.\n\nOff-topic comments including rules questions and player character questions do not go here and will be removed. **This is not a place for players to ask questions.**",
        "num_comments": 35,
        "comments": [
            "NTA at all. This player is way too sensitive if the GM of a TTRPG *portraying an antagonistic character in an antagonistic way* is offensive enough to be called *abuse.* That's absolutely ridiculous.\n\nFrankly, the trash has taken itself out. Take a break for your own mental health, then I wish you luck curating a new group of players who *won't* fly off the handle at the tiniest imagined slight.",
            "NTA. Sounds like you just made an understandable mistake. The player has an unhealthy obsession with the power fantasy. Still doesn't justify calling you a manipulator or bad DM.\n\nI'd advise against playing with those players again. Even if you do everything perfect they'll likely still have a similar episode if they fail too many dice rolls anyway.",
            "You're fine those players are dumb. \"Oh no the antagonistic npc was antagonistic so the DM sucks\" lol wut.",
            "No, I dont think you are. I mean, even if you did do something that upset the player, you tried confronting them privately and tried to fix it. And they got mad at you for trying to make it right. And then they decided to gang up on you, and as far as I can tell, you were still trying to *fix it*, and they werent having it.",
            "This thread isn't for stories, but for advice.",
            "I have a colleague at work who is hard of hearing. A lot of times she'll turn on an app on her phone or laptop that does text-to-speech subtitles because even if we speak slowly and clearly and she can read our lips, she still sometimes misses things. If your player had this (and was not afraid of reading subtitles), it might help them out.",
            "Why are you still playing with this guy? What good does he bring to the table?",
            "Kick him. There's no reason to keep him around. The longer you keep this person at your table the more you signal \"I care more for this person's enjoyment than the rest of the table.\" doubly so the person he fucking bullied.",
            "This guy sounds like a bad time for you, and probably your other players too (almost certainly the one who was bullied). But it's true, you're not the one that has to deal with potential fallout if he goes. So talk to the three who *do* go to school with him and see if you can come to a consensus around the cost/benefit analysis of kicking him.",
            "This guy isn't bringing any positives to your table. Keeping him around will make the experience for everyone else gradually less enjoyable.\n\nSometimes you have to fire your own customers."
        ]
    },
    "\"First Time DM\" and Short Questions Megathread": {
        "title": "\"First Time DM\" and Short Questions Megathread",
        "score": 18,
        "url": "https://www.reddit.com/r/DMAcademy/comments/1dmlna8/first_time_dm_and_short_questions_megathread/",
        "content": "Most of the posts at DMA are discussions of some issue within the context of a person's campaign or DMing more generally. But, sometimes a DM has a question that is very small and doesn't really require an extensive discussion so much as it requires one good answer. In other cases, the question has been asked so many times that having the sub rehash the discussion over and over is not very useful for subscribers. Sometimes the answer to a short question is very long or the answer is also short but very important.\n\nShort questions can look like this:\n\n* Where do you find good maps?\n* Can multi-classed Warlocks use Warlock slots for non-Warlock spells?\n* Help - how do I prep a one-shot for tomorrow!?\n* First time DM, any tips?\n\nMany short questions (and especially First Time DM inquiries) can be answered with a quick browse through [the DMAcademy wiki](https://www.reddit.com/r/DMAcademy/wiki/index/#wiki_the_library), which has an extensive list of resources as well as some tips for new DMs to get started.",
        "num_comments": 123,
        "comments": [
            "This isn't a question, just a first time DM closing out their first long-term campaign! It ran 3 years, which I know isn't long for seasoned DMs but is much longer than I ever thought I could do and I just wanted to share somewhere.",
            "Most of my players are martial classes, like Fighters and Monks, with only one Warlock as a spellcaster. What would be a good way to balance out encounters, given the lack of magic? \n\nSomething to mention, my Warlock is probably going to go with the whole sentinel+polearm master combo, for reference. In my head, I was going to balance things out by adding more ranged fighters before knowing this was how the party would shape up.",
            "Hey I'm a newish dm (in the middle of my first campaign) and I'm trying to make a map for my magic based world \n\nBasically in my campaign there are different realms run by different gods, my players are now going to a very magic heavy realm next. I always feel like my maps have lots of empty space. Does anyone have suggestions on what to put here? I already have a Wizarding college, spooky mansion dungeon, druid Grove, and a town full of magic users. What else should I add?",
            "How do you handle players being forced to reveal secrets? I have a series of puzzles coming up in my game, and the first two are more traditional DnD riddles, the third one is a test for each character to reveal a secret. The puzzles come through a magical door that speaks to them, so I want there to be some measure in place to tell if they are lying and I want them to be deeper secrets than just \"I've never seen the ocean,\" like I want them to be at least somewhat personal. How would you do this, or is it a bad idea altogether?\n\nI've seen some people say that you shouldn't remove a player's agency and force them to do something, but the way I see it, my players will have every opportunity to turn around if they don't want to comply.",
            "Hi Im a new DM (only 3 sessions so far) and I was wondering how to encourage creative thinking and imagination in my players as I think collabaritve storytelling is better then me telling my players what happened. Whenever i ask them \"how do you guys do this?\" or ask \"how does this look like?\" in relation to their characters I get blank stares.",
            "hi, can someone help me understand what exactly do i need to buy from D&D beyond if i want access the Assassin archetype for a rogue ? I don't get it :-/  thanks",
            "How do you do minis in an online game",
            "What's your go-to move or suggestion for when a potential player creates a completely bland and generic backstory? How do you help them juice it up a little without being insulting?",
            "How do I start my first campign and create the plot",
            "What is a reasonable DC to set to have characters climb a tall tree and navigate in the canopy? they are tall and bulky trees"
        ]
    },
    "My player feels he deserves a Moonblade": {
        "title": "My player feels he deserves a Moonblade",
        "score": 373,
        "url": "https://www.reddit.com/r/DMAcademy/comments/1dqofxs/my_player_feels_he_deserves_a_moonblade/",
        "content": "My player structured his character's backstory around his family owning and passing down a Moonblade. Now my player's are level sixteen and he feels it's time to go and get the Moonblade. However the Moonblade specifies that the attuning elf must be neutral good. His characters actions certainly haven't been Neutral and definitely haven't been good. \n\nShould I ignore the rule and give him the moonblade anyway or should I not let him use it or something else.",
        "num_comments": 137,
        "comments": [
            "It's a sentient blade, have some fun with it. Let the player use it, but have it push back on anything done with the blade that it doesn't approve of. Have it fall loudly out of its scabbard when the character is sneaking, resist their motions (disadvantage) when doing something dishonorable, be an incredibly persistent jiminy cricket (either mentally or OUT LOUD), etc.",
            "Give him the blade but he cannot attune. Say he has to redeem his actions. My Name is Earl player quest.\n\nCan you remember all the shit he pulled? Make him go back and fix all of it.",
            "Throwing in my vote for he finds the blade but it rejects him. \n\nAlignment is so rarely important in modern d&d, give it its moment to shine.",
            "As a matter of policy, I don't let players decide unilaterally what stuff their characters will get.  It doesn't sound like they came up with this backstory in consultation with you, so I would just tell them they are SOL.",
            "Im 42 and I feel like its a good time for me to have that million bucks I put into my backstory.",
            "Let him have it. Possessing it does not mean he can use it. When he tries to attune, just narrate the blade rejecting him due to his poor character. Then, when he inevitably protests due to being a PC, have the blade tell the PC all the things they have done that make them unworthy.",
            "Sure he can get it. Whether or not it rejects him is up to you the DM.",
            "Id let him go on his quest only to find that someone elsesomeone in his family and ideally someone worthy of italready found and claimed it. And if he kills them for it, have the action corrupt the weapon, either changing its properties or breaking it, depending on what sorta flavour game youre running. If he manages to redeem himself and gains it righteously, then youre golden. But either way, his lack of worthiness currently can have a bearing on the outcome of whether or not this whole inheritance ends with him, and either outcome could make for a good story, which is the whole point anyways.",
            "Moonblades are sentient and can choose to pass over family meme bees who they dont feel have earned the blade. Still a blade but no magical effects. My first level 20 character also earned a Moonblade at level 17 but I had to perform some quests and behave appropriately or the Moonblade wouldnt work.",
            "Just dont give your players what they want, give them what they need or put it in their path and let them seek what is available."
        ]
    },
    "Experienced DMs: what's something you still struggle with?": {
        "title": "Experienced DMs: what's something you still struggle with?",
        "score": 15,
        "url": "https://www.reddit.com/r/DMAcademy/comments/1dr76o1/experienced_dms_whats_something_you_still/",
        "content": "I really enjoy commenting on posts here and helping new DMs out, but I'm by no means perfect and really we never stop learning. To that effect I thought it might be useful if we shared our own weak points and let newer DMs see that there's always something we're looking to improve.\n\nI'll start: I'm really weak at giving descriptions of characters and places. I never give it the attention it deserves because I'm focusing on other things at the same time, and my storytelling suffers because of it.",
        "num_comments": 39,
        "comments": [
            "Balancing combat. Even with adding multiple combats per adventuring day and tweaking some enemy stats mid fight I find my larger encounters to be very swingy, with the players either blitzing through a fight with minimal issues or being utterly crushed.",
            "Roleplaying NPCs is one of mine. They all have different characteristics, goals and aspirations, it is difficult to switch between them.\n\nMaking combats realistic, in a sense of letting enemy creatures attack the way it makes sense. Now for weaker creatures I already found out, i.e. hit and run tactics for Goblins, group attacks for Kobolds, and that more intelligent creatures would attack weaker enemies and steer clear of those who are clearly stronger. But I highly struggle with any enemy that is above CR10, especially adult dragons.",
            "Two of my npcs talking to each other",
            "Im DMing for 4 years now, and my main Problem is Vendors. Especially when it comes to enhanced Weapons. How do i price them? Are they even available? How do i handle minor magic items?",
            "I'm still pretty weak at making monster/enemy turns interesting and dynamic in combat, as well as balancing it. It's a shame because I do really like combat in D&D, and the satisfaction of providing your players with a fun challenge, especially ones that give them chances to showcase their different abilities.\n\nI've read up and watched videos on tips for intelligent and dynamic monster encounters, and tried to plan it in a cool way. But when I'm actually running it, there's so much to think about that I forget, or can't improv an interesting way the monster would respond to something. So PCs often end up either stomping all over the enemy, or I stick with \"it bites you again\" - more reliable but gets old fast.",
            "Ive been running the game since the mid 70s. Thing I struggle with still is allowing players to have more interactions between themselves. Ive been working hard on letting players take the lead in many areas, but I could still give them more time to develop their relationships between each other.\n\nTldr: give more time for players to talk to each other",
            "I always forget to give my players inspiration",
            "Improving scenarios: can do it all day.\n\nImproving a conversation: Im constantly stumbling over every other word I say.",
            "Complicated combat. Due to the time difference between me and my players, I'm DMing between 0230-0800. Towards the end of the session, brain fog begins to set in. Not enough where I can't run combat, but I tend to forget about the niche abilities and some specifics that would have made it more interesting.",
            "Procrastinating the actual prep. I'll spend most of the time leading up to the session by developing a rough outline in my mind of potential encounters and story beats. But as for putting it in writing and making maps and finding good stat cards for enemies.....that's all usually the day before the actual session. This isn't strictly a DnD based issue but it still does create unnecessary stress pertaining to the session."
        ]
    },
    "What is your preferred session run time?": {
        "title": "What is your preferred session run time?",
        "score": 149,
        "url": "https://www.reddit.com/r/DMAcademy/comments/1dqmvsl/what_is_your_preferred_session_run_time/",
        "content": "I'm very used to weekly two hour sessions. Tomorrow I have my first 3+!\n\nWhat's your favorite session length and why?",
        "num_comments": 311,
        "comments": [
            "3\\~4 hours, with a break around the middle. More than this and it becomes tiresome, less than this and some sessions feel like you can't accomplish anything.",
            "8-9 hours every other weekend, with time for food in there.",
            "I have run 3 hour sessions and 5 hour sessions. I feel 3 hours is perfect. You get a lot done but prepping is far easier for 3 hours tbh. There is so much more that can happen in 5 hours and it makes prepping for it so much harder I find.",
            "3 hours is usually the sweet spot. If I feel like I'm running out of steam I'll stop at 2.5, if we have a lot of momentum everyone will want to go for up to 4.\n\nIt is also just kinda the limits of our time as adults. Everyone has gotten home from work and eaten dinner by 6 or 6:30, then everyone needs to start going home to go to bed at 9 or 9:30.",
            "3-4 hours with a 10-15 minute break in the middle. I'd prefer 4 but sometimes people show up later :/",
            "Our weekly sessions on Sunday run from 1 PM (Lunch is at 12 but no D&D during eating) to 6 or 7 PM.",
            "4 hours with a break in between, 15-20 minutes. I feel you can get an awful lot done and its smooth. Most time we just do 3 hours straight though and thats still great.",
            "4-5 hrs is my favorite, keeping it closer to 4 with room for 5 if it's a big combat or eventful session",
            "My experience is limited to 3-4 hour sessions, with the exception of one \"cabin getaway\" where I DM-ed an entire weekend in 5-6 hour blocks. (four sessions over one weekend) A bit easier when you're following a module, of course.\n\nOf those two options, I prefer the 3-4 hour session, heh. Two hours sounds like it would be too short to get much progress, but the groups I am in meet at most twice a month. If it were a weekly thing, two would probably be fine.",
            "For the past 5 years or so we have been running 2-2.5 hour sessions.  I personally think it's perfect, I don't know how people run sessions 3+ hours or like 8 hour marathons."
        ]
    }
}