{
    "Weekly Questions Thread": {
        "title": "Weekly Questions Thread",
        "score": 17,
        "url": "https://www.reddit.com/r/DnD/comments/1dne7x6/weekly_questions_thread/",
        "content": "\\## Thread Rules  \n\n\n\n\\* New to Reddit? Check the \\[Reddit 101\\]([https://www.reddit.com/wiki/reddit\\_101](https://www.reddit.com/wiki/reddit_101)) guide.  \n\n\\* If your account is less than 5 hours old, the /r/DnD spam dragon will eat your comment.  \n\n\\* If you are new to the subreddit, \\*\\*please check the \\[Subreddit Wiki\\]([http://www.reddit.com/r/DnD/wiki/index](http://www.reddit.com/r/DnD/wiki/index))\\*\\*, especially the Resource Guides section, the \\[FAQ\\](/r/DnD/wiki/faq), and the \\[Glossary of Terms\\](/r/DnD/wiki/glossary). Many newcomers to the game and to r/DnD can find answers there. Note that these links may not work on mobile apps, so you may need to briefly browse the subreddit directly through [Reddit.com](https://Reddit.com).  \n\n\\* \\*\\*Specify an edition for ALL questions\\*\\*. Editions must be specified in square brackets (\\[5e\\], \\[Any\\], \\[meta\\], etc.). If you don't know what edition you are playing, use \\[?\\] and people will do their best to help out. AutoModerator will automatically remind you if you forget.  \n\n\\* \\*\\*If you have multiple questions unrelated to each other, post multiple comments\\*\\* so that the discussions are easier to follow, and so that you will get better answers.",
        "num_comments": 241,
        "comments": [
            "Hey, I am looking to run a one shot with middle school aged kids. Are there any suggestions for ones that might be on the easier side for first time players and a first time DM?",
            "New to DnD, had a question from last night’s play.\nA Druid is in wild shape (say as an Ape). Are their attack action choices between 1) multiattack 2) fist and 3) rock? Or is it just multiattack and rock? Thank you!",
            "I already posted this but I think having this as a question here would give some other options: I'm preparing for DMing my campaign which Is part of a bigger adventure that me and my group have been playing for a while and all of the playable characters are going tò meet each other for the first time in-game but I don't know how tò make this happen, can you suggest me some ways tò do It? (they will meet because they all decided to take part in the same mission for one NPC)",
            "\\[5e\\]\n\nHey guys, I'm a first time DM and curious if anyone knows good resources or just how to make a leadership chart for the syndicate which will be a long term part of the campaign. The biggest comparison I can think of is something very similar to the chart for the Cult of Kosomos from Assassins Creed Odyssey; the party will be tracking down members of the syndicate as revenge for the death of their parents and I want to be able to reveal more members as they progress and gather intel on the members. It would be great if it was interactive or editable to some extent but if not that's okay too. I unfortunately have very little coding knowledge so anything that requires coding is off the table. Thank you all for your help :)",
            "[5e]\n\nI'm wondering if anyone has advice for helping a struggling player at our table in a diplomatic fashion. We have a bard in our party who is a first time player and doesn't seem to quite understand the role or abilities of her class. Bardic inspiration is basically never handed out, and in combat she generally chooses to run into the fray with a rapier instead of spell casting (she is not College of Swords.) She hasn't asked for help, so I am hesitant to outright say anything, but it is clear that she struggles with what she's supposed to do on a given turn, and generally doesn't engage in role play either. I'm just wanting everyone at the table to have fun, and am hoping maybe if she understood what was at her disposal, and the role of a bard in the party she might have more of it. I absolutely don't want to come off like I'm trying to tell her how to play her character, though. It feels like an unfortunately fine line to walk.",
            "\\[5e\\]\n\nSo i'm in the process of writing my first campaign, and conflicted if making it a time loop is a good idea. I'm thinking right now to go through the first session like it's a normal campaign and then have the party get wiped at the end of the session, before rereading my first little intro blurb. I'm not entirely worried about if the time loop idea is something that makes sense in DND, more so if it would be a good player experience.",
            "\\[5e\\]\n\nHi, I'm currently homebrewing a world and realized I completely forgot to create a deity of Peace. The gods in my world have their domains, but their general \"alignment\" can vary based on who worships them, similar to how Greek gods had epithets that specified what \"version\" of the deity was being worshiped. I was wondering if anyone had any ideas regarding how I might make the deity of Peace more interesting and multi-faceted? Thank you.",
            "[5] I’m a new dm starting a campaign with 5 players, I’ve only dmed once before for a once shot. My question is what level should I start my characters off at? I was debating 3-5 but I’m just worried as a new dm with so many players I’ll have a difficult time balancing encounters and abilities. Does anyone have advice on what level to start them at?",
            "\\[?\\]\n\ncan a dragonborn be a specific kind like a gold one with the gold dragonborn breath ability, but also have the appearance/skin colour of a different one?",
            "\\[5e\\]  \nI can't find information about this anywhere - I have a Rune Knight with a fire rune. We're about to fight a tough opponent that we would like to capture alive if possible. Can the fire rune be set to non-lethal or be cancelled if enemy is close to dying? I know it's most likely that he'll win the saving throw eventually, but I wouldn't want to kill him accidentally. Is it something that depends on DM?"
        ]
    },
    "Monthly Artists Thread": {
        "title": "Monthly Artists Thread",
        "score": 20,
        "url": "https://www.reddit.com/r/DnD/comments/1d5mhf6/monthly_artists_thread/",
        "content": "The purpose of this thread is for artists to share their work with the intent of finding clients, and for other members of the community to find and commission artists for custom artwork. \n\nThread Rules:\n\n- Rule 3 and Rule 6 do not apply within this thread. You are free to post stand-alone images and advertise in this thread without moderator approval. You may still continue to advertise outside of this thread so long as you comply with subreddit rules.\n- You are limited to one top-level comment in this thread. Additional comments will be removed as spam.\n- Comments will be sorted using \"Contest Mode\" so that they will appear randomly. Posting early is not a guarantee of additional exposure.\n- This thread will be stickied for one week. You can find past threads by using the \"Scheduled Threads\" menu at the top of the subreddit, which will take you to a carefully pre-written Reddit search.\n\nArtists should also consider advertising their work on other subreddits specifically dedicated to commissioned artwork:\n\n- /r/artcommissions\n- /r/artstore\n- /r/commissions\n- /r/DrawForMe\n- /r/fantasyartists\n- /r/forhire\n- /r/hireanartist\n- /r/HungryArtists\n- /r/starvingartists",
        "num_comments": 30,
        "comments": [
            "Can I post a youtube video here if it features artwork entirely of my own creation, related to Dungeons and Dragons?",
            "Greetings everyone!\n\nI'm a illustrator specializing in fantasy and sci-fi art. I create individual and group character portraits for DnD/RPGs as well as book illustrations, pet portraits, game art and more!\r\n\nIf you wish to see examples of my work, you can find my portfolio here!\nBuckMoonArt.carrd.co\n\nYou can also find me on ArtStation, Twitter and Instagram!\nwww.artstation.com/christianhadfield\nwww.instagram.com/buckmoonart\nwww.twitter.com/buckmoonart\n\r\nIf you are interested or wish to know more about my rates and process, you can contact me at: c.hadfield.art@gmail.com or send me a DM!",
            "Hi there! I'm Spiderleamer, a digital artist who finally opened up their commissions. Currently I do character reference sheets, icons, and custom emote packs for all sorts of things! You can find my portfolio and shop here: [https://www.deviantart.com/spiderleamer](https://www.deviantart.com/spiderleamer) \n\nEnjoy looking around even if you don't buy anything!",
            "Hey folks I am a fantasy illustrator and 5e writer I have a book live on kickstarter now all done with my and a team of artist. Would love to know what you think of the project? The theme is dreams and art and wizards that have the power to draw and bring things to life or capture enemies on a page.  \n[https://www.kickstarter.com/projects/luminousages/luminous-lore-5e-guide](https://www.kickstarter.com/projects/luminousages/luminous-lore-5e-guide)",
            "This video features my own top down artwork, as a means of providing a combat tutorial:\n\n[https://youtu.be/Z-R0vGqYt3M?si=wYhiUnFfnebcE31z](https://youtu.be/Z-R0vGqYt3M?si=wYhiUnFfnebcE31z)",
            "hi there i'm freelancer and have 4 -5 years experience in digital art :D i'm good at making fantasy style character and concept :D here my portoflios  \n[https://www.artstation.com/piteryoh23589](https://www.artstation.com/piteryoh23589)",
            "Hi! I’m Robin and I love dnd and drawing characters for dnd! Please let me draw your character portraits! I love character portraits! Here’s examples of my work as well as prices -[portfolio](https://cara.app/post/319bb90c-cbaf-4132-9c12-202a74f37b12)- thanks for your interest I hope to work with you~",
            "Hi all! \n\nI'm currently taking commissions for any type of character illustration, whether it be fantasy, sci-fi, furry, monster, etc. Even though most of my work is of females, I can also do males and non-binary characters as well. I specialize in single character illustrations with a simple background, with an anime style. \n\nYou can check out my portfolio here: [https://vgen.co/yodogama/portfolio](https://vgen.co/yodogama/portfolio)\n\nIf you're interested, please use my VGen link to make a request!: [https://vgen.co/yodogama](https://vgen.co/yodogama)\n\nHalf-Body Illustrations are $50, and Full-Body Illustrations are $75 (USD).",
            "Hello! I draw Fantasy characters and Illustrations ina  semirealistic style.\n\nIf you are interested you can send me a DM (Direct Message, not a Dungeon Master)\n\nYou can see examplles of my works here: Deviant Art [https://www.deviantart.com/juanalbertocg](https://www.deviantart.com/juanalbertocg)",
            "Hello, Iso here.\n\nI'm a freelance character artist open for commissions. I mostly do fantasy characters, but I'm open to do sci-fi characters, monsters, sceneries etc.\n\nIf you are interested in commissioning me contact me here on reddit or on deviantart (isomurmeli) or contact me at [isomurmeli@gmail.com](mailto:isomurmeli@gmail.com).\n\nBelow are examples of my work as well as prices:\n\n[https://www.deviantart.com/isomurmeli/journal/Open-for-commissions-953975410](https://www.deviantart.com/isomurmeli/journal/Open-for-commissions-953975410)"
        ]
    },
    "My brother is screaming about random things while I try to be a DM, and it's taking all my players out of the game.": {
        "title": "My brother is screaming about random things while I try to be a DM, and it's taking all my players out of the game.",
        "score": 281,
        "url": "https://www.reddit.com/r/DnD/comments/1dr3496/my_brother_is_screaming_about_random_things_while/",
        "content": "I need to ask for some help. I'm new to DND and have only been playing for a few months. I am the Dungeon master in a little campaign I set up for my friends and brother. I love the roleplay, voice acting, and adventuring. But my brother does NOT get into character, and he keeps shouting about how he's gonna seduce everything, made French, invented credit cards, and is actually a real massive dragon. He's a kobold. I love getting into character and seeing everyone else get into character. But when my brother starts screaming, it takes us all out of character. I don't want to kill him, but I've thought about it. He said that if he dies, he'll still be at the table, won't rejoin, and be more annoying. Help me out please. He's ruining the feel of the game. Thanks.",
        "num_comments": 105,
        "comments": [
            "This is a childish problem. Go tell your mom. Or kick him out and ask one of the other players if they mind hosting at their place.",
            "Are you kids or adults? Your brother sounds like Eric Cartman",
            "This is not a D&D problem. This is a y'all being brothers problem.\n\nHave your other friends said anything to him about his behavior?",
            "Kick him out the game. Maybe smack him. (Just kidding)",
            "Kick him out of the group and start playing at someone else’s place. ",
            "Any chance you could hold the game in a different location, without telling your brother?",
            "Saying he's a giant dragon that invented credit cards is lowkey hilarious",
            "Your brothers an asshole. Have a sit down with your parents.",
            "A kobold screaming that they're really a dragon is actually kinda in-character",
            "You've got to get someone above your paygrade involved. Though honestly, I see this as a case of him making an ass of himself to those people and them trying to push him on you. You may need a change of venue you can exclude him and hope to whatever deities you think can help you you're not given an ultimatum to take him or not be allowed to play. I don't see any ages, so I can't guess. That said, you do need to kick him off your game."
        ]
    },
    "Y’all, I’ve been DMing for 3ish years, I just found out that when you roll to see if a dragons breath recharges, you use a d6. I’ve been using a d20.": {
        "title": "Y’all, I’ve been DMing for 3ish years, I just found out that when you roll to see if a dragons breath recharges, you use a d6. I’ve been using a d20.",
        "score": 865,
        "url": "https://www.reddit.com/r/DnD/comments/1dqvetq/yall_ive_been_dming_for_3ish_years_i_just_found/",
        "content": "",
        "num_comments": 146,
        "comments": [
            "Wait so how exactly have you been using it? They recharge if they roll over a 6? That's... Jesus.\n\nOr only if they roll *exactly* 6???",
            "I let one of players roll for recharge (usually whoever will be most screwed by it recharging) to really amp up the feeling of imminent danger",
            "Back in my day dragons could only use their breath weapon 3 times a day.  \\*grumbles\\*",
            "It happens. Dnd has so many rules, it's inevitable you will get one or two wrong.",
            "Better than me. I thought that meant they could use it 5-6 times.",
            "I roll a d6 and I still never roll higher than a 3",
            "Back in mah day...  *Old Man Wheezing*  Breath weapons recharged in 1d4 rounds!",
            "You should probably check out all the other monsters and recharge stuff….how many spells slots certain monsters get and such as well now.\n\nOther weapons recharge the same way!",
            "Wait until you find out about all the other stuff you dont know!",
            "Reading the Monster Manual and not just using it for the stat blocks is useful, turns out"
        ]
    },
    "My DM TPK'd us with a corner.": {
        "title": "My DM TPK'd us with a corner.",
        "score": 151,
        "url": "https://www.reddit.com/r/DnD/comments/1dr1j00/my_dm_tpkd_us_with_a_corner/",
        "content": "We were resting in a room after a particularly difficult fight against a grey slaad.  When one of our party members opened the chest of the former occupant, this triggered a Sympathy spell that locked us in a corner of the room for 10 days.  Noone was able to pass their save and we all died of starvation after running out of food.\n\nGG I guess.",
        "num_comments": 73,
        "comments": [
            "It takes roughly 4-6 weeks to starve to death. If you had a waterskin, you could probably survive. Tell your DM and party you're all likely still alive, just weak and tired.",
            "Pretty crappy of the DM unless this was meant to be a high lethality \"silly\" campaign",
            "Were all the members of the party of the same race? When casting it, \"you specify a kind of intelligent creature, such as red dragons, goblins, or vampires.\" So if you have a mix of multiple races in the party, a single casting should not affect all of them--the caster would have needed to specify human, elf, dwarf, etc.",
            "The Sympathy effect from that spell only makes you draw near the target. It does not stop you from attacking that target.\n\nYou should have just destroyed the chest to end the effect.",
            "OH No... To bad no one used spirit guardian and spare the dying",
            "Rocks fall everyone dies :D. Did you have fun? \n\nAll jokes aside yikes.",
            "I checked and you get another saving throw every 24 hours. And what stopped you resting?",
            "Were all your players the same kind of intelligent creature? All same race? Otherwise I'd say this shouldn't have grabbed the whole party?",
            "Bad DM.\n\nThis is why I hate homebrew rules.",
            "What exactly was the object of Sympathy? Was it the trapped chest?"
        ]
    }
}