{
    "Weekly Questions Thread": {
        "title": "Weekly Questions Thread",
        "score": 8,
        "url": "https://www.reddit.com/r/DnD/comments/1dhytwt/weekly_questions_thread/",
        "content": "\\## Thread Rules  \n\n\n\n\\* New to Reddit? Check the \\[Reddit 101\\]([https://www.reddit.com/wiki/reddit\\_101](https://www.reddit.com/wiki/reddit_101)) guide.  \n\n\\* If your account is less than 5 hours old, the /r/DnD spam dragon will eat your comment.  \n\n\\* If you are new to the subreddit, \\*\\*please check the \\[Subreddit Wiki\\]([http://www.reddit.com/r/DnD/wiki/index](http://www.reddit.com/r/DnD/wiki/index))\\*\\*, especially the Resource Guides section, the \\[FAQ\\](/r/DnD/wiki/faq), and the \\[Glossary of Terms\\](/r/DnD/wiki/glossary). Many newcomers to the game and to r/DnD can find answers there. Note that these links may not work on mobile apps, so you may need to briefly browse the subreddit directly through [Reddit.com](https://Reddit.com).  \n\n\\* \\*\\*Specify an edition for ALL questions\\*\\*. Editions must be specified in square brackets (\\[5e\\], \\[Any\\], \\[meta\\], etc.). If you don't know what edition you are playing, use \\[?\\] and people will do their best to help out. AutoModerator will automatically remind you if you forget.  \n\n\\* \\*\\*If you have multiple questions unrelated to each other, post multiple comments\\*\\* so that the discussions are easier to follow, and so that you will get better answers.",
        "num_comments": 129,
        "comments": [
            "What are some ideas for mini puzzles to get keys? My players are set to explore a dungeon and one room will have three locked doors that take two keys each, and I'm trying to come up with some small puzzles to get the keys. I have one, so need ideas for five more.",
            "\\[5e\\]\n\nJust curious if anybody knows a relevant lore tidbit: Is there any organization, religion, discipline, etc. in Forgotten Realms history that have found a way to forgo sleep? I'm playing a tomelock and would love to flavor my Aspect of the Moon invocation a bit, as I've flavored most of my warlock abilities as borrowed or stolen from various entities and disciplines.",
            "[5e] \nI played my first session the other day as a level 7 DB veng pally. (I know. Probably should have chosen a simpler class and definitely not at level 7. But, it was the only thing that sounded fun at the time. Started mid campaign.) I am running great weapon fighting and using the polearm master feat with a glaive. I struggled a little bit in the encounters so I was just wondering if anyone could give me some advice on veng paladin? Specifically tactics.",
            "What actually is the disadvantage of playing an Artificer? [5e]\nI will play in a new campaign soon and chose an Artificer (lvl 3 or lvl 5) when I started building it, I noticed how overpowered it actually is, I don’t see anything that is weak. I mean, I use a musket and I can just skip the reload property, my Arcane armor (infiltrator) is just amazing it can literally do anything, replace limbs, give advantage on stealth checks etc. my armor can also just negate the prone condition up to 6 times a day. \nSo is there anything bad with an artificer, or is it just completely overpowered?",
            "Am I using Thaumaturgy wrong/making it too powerful? My DM has kind of let me have a lot of free reign on how I interpreted the use of this spell, but after hearing some other examples/listening to Critical Role, I'm worried that some of my uses of this cantrip were probably too powerful. Here are some examples of things I've done with it:\n\n- Create the illusion of the sound of people laughing 30 feet away\n\n- Create the illusion of the sound of glass breaking near someone\n\n- Creating a thunder-like rumbling around myself to muffle other sounds and make it hard for someone to hear me\n\n- Causing my voice to boom so loud that I was able to cause a stalagtite to break and fall from the roof of a cave and block off an enemy's path\n\nAny feedback on my perceived power level of this spell would be helpful! Are any of these okay uses or am I making this too strong?",
            "Can anyone tell me what the creature that is being used as the mount for the ashen rider in the Mythic Odysseys of Theros (or what the closest thing is)?",
            "Is it at all possible to get into a game when you have an incosistant work life balance? I don't think I would be able to set aside a few hours on the same day every week but I really want to play.",
            "What happend if a player have negative CON?\\[5e\\]  \none of my player insist of having a negative CON(-1), so when he level up he roll Hit dice and add -1 right?  \nbut here is my question, what if he roll a 1? does he get no additional health points?  \nand also what will happen if his CON will be -2? will he lose points?",
            "TLDR: I'm multiclassing from a level 7 Bard into a warlock, but I'm drawing a bit of a blank on what subclass (and maybe invocations) I should take, does anyone have any fun suggestions?\n\nContext: We are currently in a cursed temple where my character found a cursed item that gave me the character flaw 'I crave power above all else and will do anything to obtain more'. I am playing a changeling College of Creation Bard and thought this was a nice moment to multiclass into warlock (I love warlocks a little too much lol), since my ability scores are high enough to not take the level 8 improvement. I have been running from an army since escaping so I have mostly been trying to stay under the radar, but this character flaw will probably change that up a bit lol.\n\nWould love to hear some ideas!",
            "[5e] Starting a new campaign, and just rolled stats for characters. I thought it would be kinda fun if I went down the line of stats (str, dex, con, -> etc.) and rolled for each of them, instead of picking where to put my stats after I rolled them all. So… I ended up pretty good with 15/11/13/14/14/7. What would be a good class/subclass to go with? My idea rn is Eldritch Knight fighter, and going 16s in str and int, but I feel like there are probably better/more interesting options, maybe through multi-classing or something (I’m up for anything honestly.) I’m still fairly new to the game, so I was wondering if anyone had any ideas?"
        ]
    },
    "Monthly Artists Thread": {
        "title": "Monthly Artists Thread",
        "score": 16,
        "url": "https://www.reddit.com/r/DnD/comments/1d5mhf6/monthly_artists_thread/",
        "content": "The purpose of this thread is for artists to share their work with the intent of finding clients, and for other members of the community to find and commission artists for custom artwork. \n\nThread Rules:\n\n- Rule 3 and Rule 6 do not apply within this thread. You are free to post stand-alone images and advertise in this thread without moderator approval. You may still continue to advertise outside of this thread so long as you comply with subreddit rules.\n- You are limited to one top-level comment in this thread. Additional comments will be removed as spam.\n- Comments will be sorted using \"Contest Mode\" so that they will appear randomly. Posting early is not a guarantee of additional exposure.\n- This thread will be stickied for one week. You can find past threads by using the \"Scheduled Threads\" menu at the top of the subreddit, which will take you to a carefully pre-written Reddit search.\n\nArtists should also consider advertising their work on other subreddits specifically dedicated to commissioned artwork:\n\n- /r/artcommissions\n- /r/artstore\n- /r/commissions\n- /r/DrawForMe\n- /r/fantasyartists\n- /r/forhire\n- /r/hireanartist\n- /r/HungryArtists\n- /r/starvingartists",
        "num_comments": 27,
        "comments": [
            "Hi, this is Alais,\n\nI am a freelance illustrator and character artist. I've worked with many different genres but I generally get hired for fantasy work. If you are interested, you can check more art examples and details on my carrd [https://alaisprout.carrd.co/](https://alaisprout.carrd.co/)\n\nI'm trying to get one last full body slot for my emergency sale (full body pieces are just 110 euros instead of 160) to cover the unexpected kitty vet bills expenses this month. Feel free to DM or write me with any questions, I am considering doing NSFW art too.\n\nThe sale poster with some examples for those who don't want to navigate my carrd:\n\n[https://i.imgur.com/X7JlVx9.png](https://i.imgur.com/X7JlVx9.png)",
            "Hello! Comic and TTRPG artist here. \n\n[Here’s my DND portfolio!](https://jordankroegercomics.com/dnd)\n\nI’ll do party portraits. I’ll draw important scenes from your game. I’ll draw monsters, weapons, gods, etc…\n\nDM me or email to jkroeg@gmail.com",
            "Hi! I'm a fantasy artist who can do characters, creatures, epic scenes and environment.\n\nYou can find my work and message me here\n\n[https://www.artstation.com/white\\_light](https://www.artstation.com/white_light)\n\n[https://www.instagram.com/htquang.36/](https://www.instagram.com/htquang.36/)\n\n[https://twitter.com/White\\_Light\\_36](https://twitter.com/White_Light_36)\n\n[Price sheet](https://docs.google.com/document/d/12KU-o_ALbRPe_UeqJDQYxa6-4eevxdJ8og5ie1IMehM)",
            "Hi! I’m Robin and I love dnd and drawing characters for dnd! Please let me draw your character portraits! I love character portraits! Here’s examples of my work as well as prices -[portfolio](https://cara.app/post/319bb90c-cbaf-4132-9c12-202a74f37b12)- thanks for your interest I hope to work with you~",
            "Hii, nice tomeet you!\n\nI'm a freelance artist open for creature and monsters commissions.\n\nIf you are interested to commission me you can contact me on Reddit or on Instagram (regenesis\\_01)\n\nMy portofolio:  [https://www.artstation.com/regenesis01](https://www.artstation.com/regenesis01)",
            "Hello, Cookies! 🍪\n\nI'm really into doodlish style lately and my ttRPG group encouraged me to start taking commissions like that as a fun and cheaper alternative. Whether you're looking for a team picture, a simple scene from a session, or an adorable campaign banner, I've got you covered! I can also create solo characters, emojis, silly portraits, and reaction images in this style.\n\nIf you're interested - send me a DM or use my Ko-Fi Form: [https://lailyren.art/commissions](https://lailyren.art/commissions)\n\nMore examples on my website: [https://en.lailyren.art](https://en.lailyren.art/)\n\nHave a nice day 💙",
            "Hi! Ill keep this brief because theres a lot of artists to choose from in here - Im opening commissions to help earn money over the summer semester.\n\nIf youre interested, dont hesitate to shoot me a DM or email me here: [oliibombcontact@gmail.com](mailto:oliibombcontact@gmail.com)\n\nYou can find my portfolio and shop here as well: [oliibomb.com](http://oliibomb.com/)",
            "Heya !\n\nI can draw your characters, or even design a whole new character for you :3 I can also create emotes for those who want to spice up their campaign's Discord server or stream.\n\nAs an avid TTRPG player and DM, with fantasy being my favorite genre, I'd love to draw more D&D characters ! Or even another TTRPG, but we're in a D&D subreddit here :P I'm ready to draw whatever character you want, be it humanoid, furry, monster, thin, big, buff... My limits are no porn and no robots.\n\nHere are some examples of my work : [https://www.artstation.com/almarane](https://www.artstation.com/almarane)\n\nAnd for those who want to see my prices and commission me, you can do so on either one of those websites :\n\n* Artistree : [https://artistree.io/almarane](https://artistree.io/almarane)\n* VGen : [https://vgen.co/Almarane](https://vgen.co/Almarane)\n\nFinally, even if you don't need my services for the moment but you know someone who could, it would help a lot if you shared my links to them !\n\n  \nHave a nice day o/",
            "Hey folks I am a fantasy illustrator and 5e writer I have a book live on kickstarter now all done with my and a team of artist. Would love to know what you think of the project? The theme is dreams and art and wizards that have the power to draw and bring things to life or capture enemies on a page.  \n[https://www.kickstarter.com/projects/luminousages/luminous-lore-5e-guide](https://www.kickstarter.com/projects/luminousages/luminous-lore-5e-guide)",
            "Greetings everyone!\n\nI'm a illustrator specializing in fantasy and sci-fi art. I create individual and group character portraits for DnD/RPGs as well as book illustrations, pet portraits, game art and more!\r\n\nIf you wish to see examples of my work, you can find my portfolio here!\nBuckMoonArt.carrd.co\n\nYou can also find me on ArtStation, Twitter and Instagram!\nwww.artstation.com/christianhadfield\nwww.instagram.com/buckmoonart\nwww.twitter.com/buckmoonart\n\r\nIf you are interested or wish to know more about my rates and process, you can contact me at: c.hadfield.art@gmail.com or send me a DM!"
        ]
    },
    "My players have recently come into a large sum of money. ": {
        "title": "My players have recently come into a large sum of money. ",
        "score": 125,
        "url": "https://www.reddit.com/r/DnD/comments/1dlpqu8/my_players_have_recently_come_into_a_large_sum_of/",
        "content": "My players recently sold a gold statue and a legendary item to a *VERY* rich group of Nobles. \n\nAs all totalled up, they have 165,000 gold coins to their name. Currently, they have put some money aside to upgrade their vessel however, I actually have no idea what they could do to burn that type of money. \n\nThat being said, they do get a pretty good stream of downtime events and just general not adventuring as this campaign was a Naval, exploration type of campaign. \n\nDoes any DM out there have an idea about what a 5th level adventuring party could be doing with this much gold? ",
        "num_comments": 76,
        "comments": [
            "Let them buy a CASTLE",
            "East option is a base of operations. Thats enough money to land themselves titles in certain kingdoms from acquiring large amounts of land. This also sets them up to have people that depend on them for protection (if your campaign could support that kind of thing)\n\nRegardless having them poor money into a stronghold is a solid money sink while also feeling rewarding. Hell, later have the stronghold they’ve been refurbishing and fortifying come under siege and have their personalized upgrades come in handy.",
            "Where are they keeping the money?\n\n3 300 pounds of gold isn't something you carry around in your pocket or lying about. \n\nWould be a shame if something... Happened to it 😁",
            "Invest in a business, buy a second boat, buy or craft magic items",
            "Honestly? Get robbed, because they don't have the power to KEEP that much gold.",
            "I don't understand why a few here are seeing this much wealth as a threat and saying 'have them be robbed' etc.\n\nThis money is a plot generator. It gives the players the means to invest in the world by owning land/ churches/ libraries/ whatever, all of which create story. It brings them to the attention of the (usually) broke upper classes and rich merchant guilds and others looking for money.\n\nYes, there should be the threat of being robbed, how they guard it will cause them to see the wider world as a place to be interacted with as well, and yes it could even happen if they make it so easy, but just having it happen to remove the gold (the reward they earned) from the game because the DM is scared of handling it is wrong. As a player if a DM did this just for that reason I would walk away.\n\nPlayers care about the game more when they have real stakes in the world. Let them invest in it.",
            "Some of my favorite gold sinks:\n\n- let them invest in real estate. Sure, it's a naval campaign, but wouldn't it be nice to own a tavern in your favorite harbor? A general store with a hidden tunnel so that you can smuggle marchandise or people away from the view of the tax collectors? A brothel on the docks to get all the juicy rumors floating around? I'd recommend the following supplement, it's very simple to use and brings cool benefits for several types of buildings: https://www.dmsguild.com/m/product/207377\n\n- shower the party's wizard with random spell scrolls, and let them burn money trying to learn them all\n\n- hire bards to sing their exploits. Wouldn't it be cool to be welcomed as heroes everywhere you go because your reputation preceeds you? To get rich people fighting to get your services because you're so good at what you do? Bonus points of you use this strategy to \"steal\" other people's achievements.\n\n- hire teachers to teach them stuff during downtime. New proficiencies, cool feats such as the ones to cook or heal people better with bandages, etc.\n\n- if it's  a naval campaign, a good amount of gold/treasure, etc. should regularly be offered as tribute to Umberlee. Or else...\n\n - make sure useful consumables are expensive and in limited supplies. They should buy potions and stuff like that any chance they get, even if it's prohibitively expensive...\n\n- hiring a crew and *keeping them happy* is by no means cheap, either.\n\n- bribes, etc.",
            "Retire. \n\nWhy the hell would you risk adventuring? Invest it, build hospitals, and improve infrastructure. You'll do more good that way than killing orcs one at a time.",
            "Downtime activities:\n\ninvest the money in training for certain abilities, or hire a tutor to learn another language, learn to become proficient in a tool, etc.\n\nBuying a castle or HQ is a cool thing to have once a big arc is completed too",
            "Do NOT listen to the comments telling you to just take it away unless you have a VERY good reason to do so.\n\nWhat I'd recommend is strongly suggesting that the party uses it to aquire a base of operations to stash their loot and maybe even make it where they need to start regularly paying for staff(maybe even explain how dangerous it is to carry that amount of gold with them). That way, they'll only be able to carry a certain amount of gold on them at a time without the possibility of losing it, and if they refuse your suggestions THEN have something like a dragon that's way too powerful for their current level steal it, because that way you can turn it into an interesting story thread with the promise that they can get it back at a later point when they're strong enough."
        ]
    },
    "[OC][Art] Let’s build a character together! You take your pickings, I do the art - Final round (how to vote in the comment below).": {
        "title": "[OC][Art] Let’s build a character together! You take your pickings, I do the art - Final round (how to vote in the comment below).",
        "score": 1090,
        "url": "https://i.redd.it/hma1qffjwy7d1.jpeg",
        "content": "",
        "num_comments": 135,
        "comments": [
            "Zarwix is my vote. We don't get to see old Goblins enough.",
            "Zarwix, Keeper of the cursed pets\n\nLook at 'em cute murderballs",
            "Zarwix",
            "We are on the Final Round of building a spellcaster together!\n\nIn the first two rounds the community decided to build a:\n\n**Warlock - Goblin - Level 10 - Great Old One Pact - Staff or Hands as weapon**\n\n# How to Vote:\n\nChoose one option and see if someone already made the same pickings as you. If that happens, just leave an upvote.\n\nIf you can’t find the same option, leave a new comment.\n\nThe most picked option is going to be our final character (the round ends on Sunday).\n\nNext Friday you’ll get the winning character art that you can use in your games for free.\n\nYou can [subscribe here](https://mailchi.mp/f49d11abb7c6/the-npc-portal) to get notified about the voting rounds and to download the character art in high resolution (and a few surprises as well).",
            "Gigglefizzle, the Lord of Lunacy\n\nI love the art style you're using",
            "Zarwix for the win",
            "Eldraxus…it’s the tentacle fingers for me.",
            "I like Giggle Fizzle and the keeper of pets",
            "GiggleFizzle look like a fun guy",
            "Gigglefizzle, a hundred times Gigglefizzle."
        ]
    },
    "Am I being a lame DM with my Eldritch Invocation ruling?": {
        "title": "Am I being a lame DM with my Eldritch Invocation ruling?",
        "score": 337,
        "url": "https://www.reddit.com/r/DnD/comments/1dlj9t4/am_i_being_a_lame_dm_with_my_eldritch_invocation/",
        "content": "I'm a fairly new DM. I ran a \\~15 session from last October. I'm gearing up for 2 and 3. I have a player who wants to play a Warlock with a Genie patron (Tasha's Cauldron). We're starting level 3. He'd like to take the Eldritch Invocations \"Repelling Blast\" (Player's Handbook) and \"Grasp of Hadar\" (Xanathar's Guide to Everything), which allows him to push 10ft away in a straight line and pull 10ft in a straight line respectively.\n\nHe reasons that given his Genie patron, specifically Dao, he has \"Spike Growth\" so for a 20 sq ft area any creature moves through as difficult terrain and takes 2d4 damage per 5 feet. He claims he can cast Spike Growth and, on one Eldritch blast, he can use both \"Repelling Blast\" and \"Grasp of Hadar\" to move the enemy away 10 ft and then back 10 ft for a total of 20 ft. This means his eldritch blast (at level 3) does 1d10+8d4 damage.\n\nI ruled he cannot use both \"Repelling Blast\" and \"Grasp of Hadar\" on the same Eldritch blast. If he did, it would simply cancel out for 0 ft of movement. I'm imagining Eldritch Invocation is \"invoked\" at the time of casting Eldritch Blast, and the effects happen when the spell hits its target. To allow him to push and pull implies he hits and Eldritch Blast and that grants him the ability to shake around his target like a rag doll after the fact.\n\nTo back up my ruling, I put it this way. At level 5, he gets two eldritch blasts. So, mutliply all of that by two. The maximum potential damage at level 3 is 10 + (8 \\* 4) = 42. At level 5, it's 84. A Frost Giant is 138 health. This means, at level 5, his character could 2 shot a frost giant.\n\nAll in all, my philosophy is if my players put together a broken party, I can break the things I throw at them. I'm more concerned about party balance here, especially since he's pretty veteran and some of our party is fairly new. If I break enemies for his weird eldritch invocation and spike gimmick, it sucks for everyone else. If I do nothing about it, he clears enemies before the others have a chance to do anything interesting or fun. It's a lose-lose. I chalk this up to a weird interaction when combining core content (Player's Handbook) with extra content (Tasha's, Xanadar's). All that feelings stuff away, I think I came up with a sound ruling based on the materials I have - repel and push would happen immediately, cancelling out.\n\nSo there's the details I guess. I'll pose the question again. Am I just lame?",
        "num_comments": 251,
        "comments": [
            "So I will say first I love that you understand the role of a DM so well even as a fairly new DM, you are right that party balance is first and foremost.\n\n&#x200B;\n\nFor the ruling I like the way you have it as you have the justified reason for making the change, yes technically they would be able to do this but just as true is your ability to say screw the rules I am the DM (literally in the DMs role it says you can ignore any rule).\n\nI will say if you did let this happen it isn't a strict multiply by 2 because grasp is always once per turn.\n\n&#x200B;\n\nI say keep the rule, tell them that it is just a niche overpowered scenario and tell them the base idea will still work at level 5 as the first shot pushes(or pulls) and the second shot does the opposite",
            "If you want to rule this like that then that’s alright. RAW/RAI it’s allowed but it’s up to you. I would caution against using white room max rolls in order to calculate this because he can do 84 damage if he rolls perfectly after using 1 round of set up and one of his 2 spell slots. For Reference if a fighter rolled perfectly (without crits) they could deal 69 damage at this level. So that’s 84 damage over 2 turns compared to 138. \n\nNeither of these numbers are what’s actually going to happen in your game however. Which is why I don’t think you should be evaluating just based on this math. Also him “two turning” a Frost giant wouldn’t actually two turn the frost giant because he had to use one turn of set up. It would be 1 set up + 2 turns of perfect rolls.",
            "It’s allowed RAW, though I get why you wouldn’t allow it. But my philosophy has always been that if my player wants to spend two turns setting up a combo that MIGHT work, I’m not going to tell them no.",
            "Per Xanathar's Guide to Everything, page 77:\n\n> If two or more things happen at the same time on a character or monster's turn, the person at the game table - whether player or DM - who controls that creature decides the order in which those things happen.\n\nSo, per that rule, this should be allowed to happen. However, it is stated to be an optional rule, so you are free to ignore it.\n\nThat said, once the player gets to level 5, one casting of Eldritch Blast produces multiple separate beams with separate attack rolls; one can hit and push, and then the second can hit and pull back, assuming they both hit.\n\nSome other points: First, it's definitely fully within the rules to apply one of those effects, leading to a 1d10+4d4 legitimate combo. Second, this whole thing takes two full turns to execute... One to cast spike growth, and the second to cast eldritch blast. This means the enemy has the opportunity to try to break the warlock's concentration on their turn, or simply leave the AOE of the spikes.\n\nOf course, it's possible that they might multiclass into sorcerer for Quickened Spell metamagic to do it in one turn, but at that point they've built their character to do one cool thing, why deny that? It still relies on actually hitting the target and costs sorcery points, which will be limited if they're multiclassing.\n\nOverall, I think you're overestimating the power of his combo, and should just let him have his fun once he hits level 5. After all, the vast majority of the time, he'll either miss one of the beams, or the enemy will leave the spikes before he can blast them, or he'll lose concentration from something, or he'll roll a middling or poor damage roll, or...\n\nIf you're really concerned about countering him, just put in some enemies who can Counterspell him, or Dispel Magic on the spike growth, or who are able to just fly away from the spikes on their turn... They won't take damage if they just fly straight up.",
            "I feel like you're vastly overestimating how broken the combo is. Having played it, it's not that powerful. Remember that you need a whole turn to drop the spike growth, after which the enemies can pretty easily just move outside, and spike growth is concentration so you're giving up on having another concentration spell up.\n\nI see your frost giant thing, but a level 5 fighter can also drop 80 damage in the first turn of combat with sharpshooter and action surge. Spike growth is really good, but if the rest of the party has coherent builds it shouldn't be that much of a balance issue.",
            "Eh.. it's not that strong and costs a lot.\n\nI don't think it cancels out; I'd say the enemy ends up in the same spot.  The Invocations say you can choose when to push and when to pull, so I'd rule at level 5 he could push an enemy 10ft through the spike growth and then if he hit again with the second beam he could pull it back through the same spike growth for another 10ft. \n\nI would be fine with this.  It requires a previous turn to cast Spike Growth (unless you somehow have Quickened Spell) and also costs two of the 3 Invocations you have at level 5.  If you're willing to invest that much, sure, I'd give it to you because you're sacrificing elsewhere for a very niche power spike.  The enemy you're doing this to could just run up to you or run away from the spike growth to deny you a direct line to knock it back again, plus Spike Growth also affects your party.  All for an extra 10ish damage per EB?  I mean, it's good, but I don't think it's broken any more than stacking EB, Agonizing Blast, Hex, Lifedrinker, and Hex blade's Curse.",
            "Raw they can do it\n\nThey also need to cast a spell as an action and not have their concentration broken and then hit all their attacks. I think it’s a fine combo.\n\n“But they can theoretically two shot an ice giant”\n\nOk, on the round the warlock casts the spell the ice giant throws two rocks at him cuz he doesn’t wanna walk through the spikes. The warlock with only light armor prof is probably hit by both and must make two dc14 con saves if he’s still up. \n\nGenerally monsters with like 6-8+ int should focus anyone that casts a concentration spell because they’re fucking powerful and dangerous.",
            "RAW, I'm pretty sure they can push and pull on the same blast\n\nBut it requires setup, and field manipulation, multiple turns, can miss, and a spell slot on a spell to get it working with spiked growth\n\nI'd let them do it",
            "Honestly, it's not game-breaking. Spike growth is great until the rest of the party, especially martials, gets annoyed because it's in the way.",
            "I also agree with your ruling. This is a strong enough combination of abilities already, without being able to do both push and pull in sequence."
        ]
    }
}