{
    "We've been experimenting with \"less is more\" generators and finding them to be really evocative.": {
        "title": "We've been experimenting with \"less is more\" generators and finding them to be really evocative.",
        "score": 368,
        "url": "https://www.reddit.com/r/DnDBehindTheScreen/comments/1dntikm/weve_been_experimenting_with_less_is_more/",
        "content": "A little while ago we got a dumb idea for an NPC generator with the barest essential information and I've actually used it quite a bit, because the stories sort of generate themselves:\n\n[Normal People](https://www.glumdark.com/?tableUuid=24929f6bda7f2dae65c3)\n\nBut then we doubled down on the dumb and figured out we could tell a whole life story just as easily:\n\n[A Life in Three Acts](https://www.glumdark.com/?tableUuid=m30562nsf4tw48f)\n\nI use these kinds of bare resources without any stat blocks, but I wonder if anyone else does? I think I do a lot of free-association / improv when DM'ing and obviously some folks like things more crunchy and spelled out. Curious what folks think and whether these things are worth making for any reason beyond them just being really REALLY fun to make.",
        "num_comments": 48,
        "comments": [
            "I bought Knave 2e for the tables and I have been amazed by the value of short, evocative, and random when worldbuilding.",
            " Fell from the heavens.  \n Universally hated.  \nTired of all this nonsense.  \n\nReads like douglas adams love it",
            "Childhood Bully, once saw a whale, died\n\nSounds almost like Hemingway",
            "This is absolutely amazing, I am bound to use this in my games",
            "Ah...HA!? \"A menace with two hands and pants on\" .... well.... \\*snort\\*",
            "Gotta be honest i expected simple but not that simpel i love it.",
            "This is fantastic.\n\nI generally do something similar, just one dumb hook per NPC often cribbed from pop culture in some way + one fact. Large mole on face & cousin to mobster, talks like Mike Tyson & knows back way into castle, weirdly obsessed with your shoes & witnessed robbery...",
            "“An artist with a torch and plenty of time”\n\nOminous, I like it.",
            "Check out the NPC generator tables in Knave or Shadowdark. IMO there is no reason to need more than a few details for the average random NPC. If stats even come up just give them +0, maybe +1 if they are smart or strong.",
            "I hooked up https://dungeon-mind.com/chargen.html to give me a bunch of one liners and long term goals."
        ]
    },
    "The Forest Ruins Mistery - A one page adventure ": {
        "title": "The Forest Ruins Mistery - A one page adventure ",
        "score": 59,
        "url": "https://www.reddit.com/r/DnDBehindTheScreen/comments/1dkh6zl/the_forest_ruins_mistery_a_one_page_adventure/",
        "content": "After a while I made a new one-page dungeon adventure.\n\nHere is the free download file including a hand drawn map and the printable puzzle for players: [**https://sahaakgames.itch.io/the-forest-ruins-mystery**](https://sahaakgames.itch.io/the-forest-ruins-mystery)\n\nAs it's a one-page info is very compressed and DMs will need to fill the gaps, using this pamphlet as a base to develop their adventure. This is more an exploratory adventure than a combat based one, I just described basic locations, so DM can, if they want add more content like checks for crossing the river, or some secret items to the ruins, etc.\n\nI played this one in my campaign for three lvl5 PC and it went pretty well, if someone has any suggestions or adjustments will be very welcomed.\n\nThanks for reading me!\n\n# ADVENTURE STARTS HERE:\n\nHeroes receive a letter from Glida Dierorch, a renowed herbalist of Danovar, urging them to retrieve a rare plant from ancient forest ruins. Recent lumberjack deaths and dark magical rumors deter Glida from venturing herself. As the heroes delve into the woods, they will uncover an ancient temple and face a malevolent druid who is seeking its power.\n\n**GLIDA DIERORCH**\n\nGlida accompanies the PCs but will hide during fights. When she finds the plant she is looking for in the temple, she will ask the heroes to help her investigate the temple, as its magical power is responsible for the properties of the plant.\n\n**FOREST ORIENTATION**\n\nPlayers will need to navigate through the forest, so the DM should notify them at each crossroads to decide which direction they want to go.\n\nSurvival and perception checks may give the players relevant information about the paths.\n\n**D4 RANDOM TREASURE**\n\n1. 1d6 Random seeds\n2. 1d4 Mushrooms\n3. 1d4 Goodberries\n4. 1d4 Random nuts\n\n**FINAL REWARD**\n\nHeroes will get a ring of animal influence, which has 3 daily charges for casting the following spells:\n\nAnimal friendship (DC 13)\n\nFear (DC 13)\n\nSpeak with animals\n\n# Enemies\n\n**TWISTED VINE**\n\nA vine plant corrupted by dark magic, entwines around the limbs of the unaware.\n\n(HP:12; AC:14; SP:20’; XP:25)\n\n(STR:12; DEX:8; CON:6; INT:1; WIS:7; CHA:1)\n\n(ATT: Lash: +6 | 1d6+1)\n\nEntwine: The vine can try to immobilize a medium-sized creature, this can be avoided with a DC 17 DEX saving throw. Trapped creatures can free themselves by succeeding on a DC 15 CON saving throw.\n\n**CORRUPTED ENT**\n\nAn ancient Ent dominated by Malakars domination dark spell.\n\n(HP:138; AC:16; SP:30’; XP:3000)\n\n(STR:23; DEX:8; CON:21; INT:1; WIS:16; CHA:1)\n\n(ATT: Hit: +10 | 3d6+6)\n\n(ATT: Throwing rock: +10 | 4d10+6)\n\nRange 60/180 ft, affects one creature.\n\nControlled: The Ent lacks willpower and only acts as a Malakars puppet, attacking anyone that try to reach or harm the druid. Players can end the spell if they kill Malakar or successfully cast Remove Curse on the Ent. In that case, the Ent will immediately attack Malakar if he’s still alive.\n\n**MALAKAR, THE GREEN SHADOW**\n\nThe evil druid who pursues the power of the temple. Once  a defender of nature, his heart was corrupted by ambition.\n\n(HP:40; AC:14; SP:30’; XP:1500)\n\n(STR:6; DEX:8; CON:8; INT:18; WIS:20; CHA:12)\n\n(ATT: Club: +1 | 1d6+1)\n\nAntilife shell: A shimmering barrier extends out from Malakar in a 10-foot radius and moves with him, hedging out creatures other than undead and constructs. It lasts the entire combat.\n\nLocust Swarm: A locust 10 ft swarm surrounds and attacks any living prey it encounters. A swarm deals 2d6 points of damage to any creature whose space it occupies at the end of its move.\n\n# The Forest\n\n**1. FOUNTAIN:**\n\nSeveral houses, now in ruins, surround a magnificent stone and bronze fountain. The fountain is filled with water and crowned by a statue of a woman holding a large empty jar. If the characters fill her jar, the fountain will activate, opening a compartment containing one of the three magical runes.\n\nIf the players decide to explore the houses, 1d4 twisted vines will sprout from the ground, attacking them immediately.\n\n**2. INTACT HOUSE:**\n\nA house that, unlike all others in this forest, remains in perfect condition despite the passage of time.\n\nInside, various supplies, 2d8 GP, and an ancient tome detailing the presence of ents in this forest can be found.\n\n**3.MALAKAR’S CAMP:**\n\nAt first glance, nothing is visible as the camp is hidden by a concealment spell. However, if they venture down the path, the spell’s effect will dissipate. Inside the clearing stands a large tent, several crates with supplies, and the remains of a shattered statue with barely readable inscriptions.\n\nWhen trying to access the tent, five twisted vines will sprout from the ground, attacking the adventurers.\n\nInside the tent, they will find one of the magical runes, 3d10 GP, and a 4d4+4 healing potion.\n\n**4. TEMPLE:**\n\nAn ancient hexagonal structure made of massive slabs of granite and marble stands gloomy but still imposingly among the trees. The temple is filled with a strange plant with purple flowers.\n\nBetween its columns and up a staircase, there are three altars with slots for magical runes. If all three runes are placed, the power of the temple will activate, revealing its secrets.\n\n**5. RUINED MENHIR:**\n\nA small muddy clearing with a tiny village built around a large menhir. The houses are completely destroyed and the roofs are caved in.\n\nIf the menhir is carefully examined, a series of runes in a grid can be distinguished. To solve the puzzle, the answer must be chiseled into the stone. Once the rune is taken, 1d4 twisted vines will attack the players. (You can see both, the puzzle file, and the solution in the free downloadable file, as both are images)\n\n**FINAL FIGHT:**\n\nWhen the players place the three runes, Malakar will appear alongside an Ent under his control at the temple’s staircase.\n\nOn his first turn, Malakar will cast an antilife shell on himself, fighting from the rear while the Ent attacks the players at will.\n\nA DC 14 arcana check will reveal to the players the nature of the spell Malakar uses to control the Ent.\n\nAfter the fight, PC will found the entrance to the treasure room that opened when they placed the runes in the stands.",
        "num_comments": 13,
        "comments": [
            "i really like when creators post succinct adventures like this. hmm any advice for running it?",
            "What does antilife shell literally do?",
            "Very cool - I really dig the adventure and the pamphlet style",
            "This looks cool! Any ideas on why the intact house is miraculously intact?",
            "The leaflet style is fantastic! Succinct and stylish, will try it out myself in the future instead of reams of information on Gdocs",
            "Hi! Well I think you can try to use survival checks at forks, so you can give hints to the players in order to choose the correct path. I Also played Glida as an NPC that goes with the players and give them information about the forest, the plants they can find and also warns them if anything isn't in place.  \nI think it's important to give some context about the corrupted ent, so at the final battle players can figure out what's going on, and act consequently.  \n\n\nHope this helps, and let me know if you decide to give it a try! 😁",
            "You can check it here: [https://roll20.net/compendium/dnd5e/Antilife%20Shell#content](https://roll20.net/compendium/dnd5e/Antilife%20Shell#content)\n\nBut basically prevents any living creature to enter (shell moves with the caster).",
            "Thank you so much!",
            "Maybe the owner was a sorcerer who used a strong spell to protect it, he died years ago but the spell is still active, so the interior is still full of his stuff :)",
            "Haha thank you so much!"
        ]
    },
    "Dark goblins: Kingdom Hearts and Legend of Zelda-flavoured goblin variants, that require killing with kindness": {
        "title": "Dark goblins: Kingdom Hearts and Legend of Zelda-flavoured goblin variants, that require killing with kindness",
        "score": 40,
        "url": "https://www.reddit.com/r/DnDBehindTheScreen/comments/1dipo51/dark_goblins_kingdom_hearts_and_legend_of/",
        "content": "The older I get and the more complicated my personal life becomes, the less morally complex games I like to run. I've both run and played in games with difficult decisions, where you have to either give in to the urge and kill a lot of sentient creatures, or risk said sentients overrunning a peaceful populace. The nature of D&D by default means you often have to kill gangs of goblins, bandits, kobolds, orcs and the rest, leading to questions like *\"Are all goblins evil? Are there goblin children? Are we being species-ist?\"*. Chances are, if you're reading this, you've played in games where these questions have at least been raised in passing.\n\nI'm not saying I want to excise this complexity from the game entirely: it certainly has its place. I just don't want the burden laid at my conscience every time I pick up a set of dice for a bit of escapism. If only there was a way to encourage players to be kind and leave a positive impact on the world, while adhering to D&D's core gameplay mechanic of remorselessly slicing through hordes of dark creatures for loot. If only...\n\n# What are Dark Goblins?\n\nDark goblins share the stats of normal goblins in pretty much every respect (unless, of course, you have decided that they're distinct). Dark goblins aren't biological in the same way that regular D&D goblins are, in that they're born of goblin parents, nor are they twisted versions of other species like elves, in that classical Tolkienian goblin sense. Dark goblins are genderless, fiend-adjacent creatures from the plane of Acheron, formed of shadow magic and latent energy from the wicked, malicious, spiteful feelings and actions of every sentient creature in the multiverse.\n\nAcheron is home to the divine goblin realm known as Clangor. Some religions preach that Clangor is where all greedy, mean and mischievious thoughts come from, extending outwards from Clangor to touch every corner of every plane. Whether or not that's true is up for debate, but one thing is certain: whenever there is war, or a population begins to shift from being kind to just plain mean to each other, goblins are never far away. They seem to be drawn to conflict like moths to flames, gathering in groups to create more mischief, fanning the flames of strife - which eventually begets more goblins.\n\nThey'll quite happily work for hire for a more intelligent master, which satisfies their greed for gold and gems while causing all manner of problems. They dissolve back into shadow magic on death, which crawls away into any crack or crevice it can find to await eventual reformation. To reform, these shadows need to be close to a creature or community full of malicious thoughts and deeds.\n\nDark goblins are the Hand from Marvel, the Foot clan from *TMNT*, the Putty Patrol from *Power Rangers* and the Heartless from *Kingdom Hearts*: creatures not of flesh and blood that delight in sneaky, underhanded, five-on-one hit-and-run combat. No moral quandaries about burning down goblin camps here: unrelenting and unrepentant, players can scythe through dens of goblins with zero moral quandaries as they burst into shadowy smoke.\n\nThis has a very nice implication for world consequences, that adheres quite well to the Saturday morning cartoon-esque idea of evil henchmen disappearing in a puff of black smoke on defeat. If goblins form, or are drawn to, times and places where people are nasty to one another, the only true way to permanently end the goblin threat is for the players to create a world in which it's easier to be kind to one another than mean. Acts of kindness are antithetical to a dark goblin's existence: after removing the initial goblin threat, leaving a place better than you found it might be the only way to ensure they never come back.\n\n# Running Dark Goblins\n\nWhat does this mean in practical terms? Dark goblins are both problem and symptom. A single low-level adventure might be clearing a gang of goblin thieves from the city's sewers, but you might also have a goblin clan stealing stuff from around town, burning down taverns and blaming their misdeeds on two rival factions, exacerbating the tensions that drew the goblins there in the first place. In this way, parties can both work towards a peaceful resolution between the two local factions, and have a dungeon full of goblin mooks to hack-and-slash their way through guilt-free.\n\nIn combat, dark goblins are full of mischief and spite, sliding 10-15% towards the \"Tucker's Kobolds\" or \"ninja\" archetypes. They make use of traps, hidey-holes, darkness and smoke to catch their enemies unawares. Swathed in black and wielding curved swords, they'll spring on a party unawares, perhaps trying to steal the wizard's staff instead going in for a slash, or one might trip up the paladin so two others can attack with advantage.\n\nTolkien's goblins delight in explosions and invention, and dark goblins echo this by using their bonus action Hide in conjunction with smokesticks, poison darts and simple fire-based traps. Steal your players’ magic swords from their scabbards and cut the straps on their Bags of Holding: be really, really annoying, in essence, and play up the mischief angle. When defeated, the goblins burst into black smoke, the shadow-stuff crawling out of their empty rags towards corners, cracks and crevices.\n\nThere are also mechanical implications toward \"killing them with kindness\". Spending an afternoon helping the poor tavern owner rebuild after a fire caused by dark goblins (you could even run the fire itself as a [natural hazard](https://www.reddit.com/r/DnDBehindTheScreen/comments/1dejgsd/an_update_to_an_old_post_treating_natural_hazards/)) could be considered XP or treasure-worthy, as it's ultimately working towards the party's goal of ending a goblin incursion. You could even do a skill challenge here: the bard could make a persuasion check to get the other townsfolk helping, while the barbarian could focus on athletics to hoist the biggest beams himself. \n\nKeep a tracker of intentional kind deeds and successful skill checks - you could hide it from the PCs, or choose not to - and declare the goblins vanquished (for now) after a certain number of good deeds and successes. If the party makes an effort to lift up the community, foster attitudes of kindness among townsfolk and broker deals with warring factions, the goblins will stay away. This is a good opportunity to introduce fetch-quests and have high-level players use their powers for good - for example, using *Plant Growth* or weather control spells to ensure a better harvest to stop two factions competing over scarce resources. \n\nIf you're looking for a \"nice\" PG-13 game with the tone of *Legend of Zelda*, you could certainly do worse than using dark goblins. Link doesn’t slice his way through bone and sinew, or murderize baby goblins. Dark goblins are a gang of mooks that make a special effort to be annoying at every turn, have an additional layer of complexity, but still engage with the game’s basic tenets. They also come with built-in incentives to reward behaviour and attitudes of kindness, compassion and community towards your NPCs.",
        "num_comments": 6,
        "comments": [
            "This is amazing. I’m teaching summer school and wanted to try doing a one shot with my 5th graders and obviously want to avoid violence. But really the best part is the is the morality. Frankly my kids need more of it and a great way to collaborate. Definitely stealing this",
            "This is MARVELOUS!",
            "That's great to hear. Halfway through brewing this up, it did occur to me this sort of videogamey-violence level would be perfect for kids to play, along with the morality messaging. Hope it goes well!",
            "Hey, thanks!"
        ]
    },
    "Homebrew Downtime Training Rules.": {
        "title": "Homebrew Downtime Training Rules.",
        "score": 12,
        "url": "https://www.reddit.com/r/DnDBehindTheScreen/comments/1dimrrf/homebrew_downtime_training_rules/",
        "content": "Over the past couple of months in my current game I have been playtesting some new mechanics for players to train during their downtime (I try to give a lot of options for downtime as mini games between sessions). Have been playtesting these with just 1 character in the group before rolling this out to the entire group.\n\nI wanted to reach out to the community also to see if I could get any advice over these and whether you felt the balance was correct on these. I have given examples of the skills attained by the play test character; level 6 echo knight fighter.\n\n**Personal Training Rules**\n\nAs part of downtime you can spend time training and honing your skills. This can be done by yourself, or with a skilled trainer in the discipline you are looking to train. Each time you train you will earn progress points against the discipline you are training. On hitting milestones along that training path you will gain new skills or benefits specific to your character and their fighting styles.\n\n There are 3 disciplines in which you can train;\n\n **Attack focused Skills**- Training in this area will be focused around you primary attacks be that weapons attacks for martial classes, spell attacks for casters and a mix of both of combined classes. Checks to earn progress points in this training discipline will be made with your primary attack stat; eg Strength/Dex for most martial classes, and spell modifier stat for other classes.\n\n **Defensive Skills**- Training in this area will be focused around you primary defensive stat be that constitution for more tank orientated characters, evasion for more dexterity based characters or defensive spells for . Checks to earn progress points in this training discipline will be made with your primary defence stat.\n\n **Special Skills**- Training in this area will be focused on augmenting the abilities associated with your character's sub classes, for those multiclassing you will receive options for each of your multiclass. Checks in this area may differ based on the flavour of these subclasses.\n\n **Progress points** - The number of progress point required in each discipline to acquire a new skills/ability will increase with each acquired skill, an increase in the DC to attain progress on that training pathway will also increase with each skill acquired. This means at higher levels of skill, the benefits that skilled trainers bring are an necessity.\n\n **Trainers**- Throughout the world you may be able to identify training masters who will be able to assist you with training as part of your downtime, and will have a range of effects from reducing the DC of the training checks, boosting the amount of progress that can be made or giving access to particularly powerful skills that can be gained from this specific trainer only. Most trainers will exchange there services for gold, but others may need more to secure their services and share their secrets.\n\n•Level 1 skill•3 progress points required •DC 10 1 progress point, DC 14 2 progress points, DC 18 3 progress points\n\n•Level 2 Skill•5 progress points required •DC 12 1 progress point, DC 16 2 progress points, DC 20 3 progress points•\n\n•Level 3 skill•7 progress points required •DC 14 1 progress point, DC 18 2 progress points, DC 22 3 progress points\n\n•Level 4 Skill•9 progress points required •DC 16 1 progress point, DC 20 2 progress points, DC 24 3 progress points\n\n•Level 5 Skill•12 progress points required •DC 18 1 progress point, DC 22 2 progress points, DC 26 3 progress points\n\nTraining in this manner will use up 1 primary activity as part of your downtime, and will be equal to 1 attempt to make progress against your chosen discipline.\n\nUpon completing a skill milestone you will be provided with 3 options for skills which you may choose from, allowing for a greater level of customisation for your character.\n\nExamples of skills that can be acquired; note these will be tailored to your characters and there abilities. The below examples are options that were made available to Arien (Echo Knight) when play testing these rules.\n\n **Level 1 attacking skills.**\n\n1. Riposte, when you are attacked and the opponent misses you can use your reaction in order to make a single attack against them.\n2. Improved weapons training, get a permanent +1 to hit and damage with melee weapons.\n3. Improved critical, you now score a critical hit on a 19 or 20.\n\n **Level 1 special skills.**\n\n1. Long shadow; your echo gains reach ability allowing it to attack at a range of 10ft for melee attacks.\n2. Elemental echo, when summoning your echo you can designate an element selecting from fire, cold, acid, lightning. Your echoes attacks now deal this damage type rather than slashing.\n3. Echo surge. When you use you action surge ability your echo can instantly make an additional attack.",
        "num_comments": 3,
        "comments": [
            "I like it.\n\nBut aren't the skill at level 1 a bit too powerful?\nIt's almost as if you were giving them a feat.\nI'm worried that players will abuse the system and try to train several days in a row in order to get all the points as fast as possible.",
            "I do something similar. My players can train in any skill, tool, language, they please. Even shields and light armor. But there is a time/gold requirement so as not let them have it too soon."
        ]
    },
    "Collapsible Names: a naming aesthetic, for which I parsed 9M entries of Wiktionary": {
        "title": "Collapsible Names: a naming aesthetic, for which I parsed 9M entries of Wiktionary",
        "score": 98,
        "url": "https://www.reddit.com/r/DnDBehindTheScreen/comments/1di9zmr/collapsible_names_a_naming_aesthetic_for_which_i/",
        "content": "Years ago, I wrote a [Reddit post about naming](https://www.reddit.com/r/DnDBehindTheScreen/comments/jrtub2/naming_and_what_it_can_do_for_your_worldbuilding/) which had this throwaway example:\n\n>My personal favorite are compound names: Hagrove, Treerie, Weapond – they sound fey to me. So ancient, that the language warps around the concepts they're conveying.\n\nLet’s call those *collapsible names.* Two words, the end of the first is the same as the start of the second. *Dream + amber = Dreamber.* Or, with diacritics over the shared part: **Dreȧṁber**.\n\nIn this post, I revisit that idea and show the cool names I’ve mined with a script.\n\n# Aesthetic\n\nSo, what’s special about Hagrove, Treerie, and Weapond?\n\nI got an idea from a fantasy map I saw on Pinterest, maybe a tutorial or a commission example – it had a forest named Hagrove. And I thought: oh, interesting, the ‘g’ is shared! It felt like was not a mere grove with some hags – but *the* hag grove. As if the two words were invented just to describe it. You might break the name apart and re-purpose its pieces to describe a troll grove or a hag mire – but you can see that those are derived terms, as they don’t fit as nicely together.\n\nSimilarly, I like the idea of prehistoric entities speaking in rhyme. Not intentionally – just due to the gravitas of their presence crumpling and plowing this “new thing”, the language.\n\n\n\n# Applications\n\nThe intended use for collapsible names is to be written on a map or to be mentioned in a text. An idling eye stumbles upon a familiar-yet-different word and, hopefully, piques interest. Adornment with diacritics (or over- and under- lines) is also meant to work toward that goal.\n\nAdditionally, the contrast between names draws attention to whatever cultural element behind it. If the human name for the forest is Elderwood but elves call it Arḃȯṙough – just by using the visually distinct naming styles, you can convey the information about what culture controls it.\n\n\n\n# Curated list of names\n\n**Two-letter collapsible names**\n\n|Aṗėak|ape|peak|\n|:-|:-|:-|\n|Aẇėll|awe|well|\n|Briṅėt|brine|net|\n|Buṡḣire|bush|shire|\n|Curṡėa|curse|sea|\n|Dreȧṁber|dream|amber|\n|Fȧėrie|fae|aerie|\n|Glaḋėn|glade|den|\n|Gnoṁėadow|gnome|meadow|\n|Immenṡėa|immense|sea|\n|Lak̇ėep|lake|keep|\n|Lav̇ȧlley|lava|valley|\n|Luṡḣire|lush|shire|\n|Moȯṙchid|moor|orchid|\n|Raindrȯṗal|raindrop|opal|\n|Solituḋėn|solitude|den|\n|Sliṁėadow|slime|meadow|\n|Teȧṙid|tear|arid|\n|Trėėrie|tree|eerie|\n|Wilḋėn|wilde|den|\n|Winḋẏke|windy|dyke|\n|Youṫḣorp|youth|thorp|\n\n\n\n**Three-letter collapsible names**\n\n|Aṙi̇ḋge|arid|ridge|\n|:-|:-|:-|\n|Baṡi̇ṅkhole|basin|sinkhole|\n|Charṁėṙe|charmer|mere|\n|Clȯȧk̇|cloak|oak|\n|Garḋėṅ|garde|den|\n|Gl̇ėėch|glee|leech|\n|Hidḋėṅ|hidden|den|\n|Hi̇l̇l̇usion|hill|illusion|\n|Jeẇėl̇l|jewel|well|\n|Massaċṙėek|massacre|creek|\n|Niḣi̇l̇l|nihil|hill|\n|Putṙïḋge|putrid|ridge|\n|Specṫṙėe|spectre|tree|\n|Sprïṅġot|spring|ingot|\n|Tiḋȧl̇e|tidal|dale|\n|Tṙėėd|tree|reed|\n|Veteṙȧṅge|veteran|range|\n|Weaṗȯṅd|weapon|pond|\n|Whisṗėṙch|whisper|perch|\n\n\n\n**One-letter collapsible names**\n\nI’ve got about 23k options for this one – too much noise to be practical.\n\n\n\n**Four-letter collapsible names**\n\nMy code couldn’t find any four-letter names due to a bug. If this thing gets enough interest, it might fix it. For now, purely with the sheer power of my imagination, I discovered `Sṗïṅė: spine + pine`. The second close thing is `Gl̇ȧḋdėr: glade + ladder` – but it has an extra “d” breaking the perfect overlap.\n\nIf you come up with a four-letter collapsible name – leave a comment, I’d love to see some :)\n\n\n\n**Curious finds**\n\n* Fetiṡḣire: fetish + shire\n* Genociḋėn: genocide + den\n* Cocȯȧk: cocoa + oak\n* Inferṅȯok: inferno + nook\n* Sakuṙȧin: sakura + rain\n* Ṗȯȯl: poo + pool\n* Tamṗȯṅd: tampon + pond\n\n\n\n# More Collapsible Names!\n\nI have put together an [online page](https://www.mykkonovalow.com/namess/index.html) on which you can play with the idea and generate your own names.\n\nIt’s under **CC BY-SA 4.0** – so feel free to distribute and build upon the results however you want (even commercially). The only requirement: please attribute me: *“Collapsible names by Myk Konovalow”.* A link to the online page would be much appreciated.\n\n\n\n# Parting Thoughts\n\nThis was fun. I parsed 9M entries of Wikitonary – and filtering so much data (about 17Gb) that was a fun algorithmic challenge. I tried a few fancy tricks for that but the only two things that worked were: a) limitng length ad b) looking up the word's frequency (from a third party dictionary).\n\nIf this thing gets enough interest, I’d be up to do a pass through comments and implement most requested features. Same with bugs, if any.\n\nP.S. Here’s the original post that inspired collapsible names: [\"Naming. And what it can do for you worldbuilding\"](https://www.reddit.com/r/DnDBehindTheScreen/comments/jrtub2/naming_and_what_it_can_do_for_your_worldbuilding/).",
        "num_comments": 10,
        "comments": [
            "You could also age the names by applying consonantal shifts to them. For example, Basin Sinkhole might run together to make Basinkhole, but that’s kind of hard to say. After not too long it would probably shift to something like Basingol, or bazingol. This further obfuscates the words from the player/reader, if that is a goal one has.",
            "This is a really interesting way to look at names. Totally agree that a lot of them sound very Fey. Will give this a run next time I need some NPC names, thank you!",
            "A question: How do you read these?",
            "This generator is super fun to play with!! It’s like a portmanteau but with the addition of wordplay.",
            "This rocks, thank you for sharing.",
            "Well, my next campaign needs a Feti Shire.",
            "I like this udea a lot!",
            "I prioritise one of the parts to pronounce it as clear as possible. SOLITUDEn, MassaCREEK. Which one – up to a whim, I guess the one that's more \"important\" in the context.",
            "I glad you liked it! And \"portmanteau\" is a good term i wasn't aware of"
        ]
    }
}