{
    "When your community starts migrating to another site. (Also, a goblin)": {
        "title": "When your community starts migrating to another site. (Also, a goblin)",
        "score": 3456,
        "url": "https://i.redd.it/rde7kpu21qbb1.jpg",
        "content": "",
        "num_comments": 120,
        "comments": [
            "Dalimey and I currently mod over at https://ttrpg.network/c/rpgmemes",
            "Current problem I'm facing is that I have no clue where to go next. I almost exclusively use reddit mobile as my wind down before bed so while it's great to see new websites popping up I can't exactly follow them well",
            "Link: https://ttrpg.network/",
            "Problem is the website is formatted very different. In particular you have to click on something to actually view the image which defeats the purpose to me.",
            "Remember to unsubscribe on your way out of here folks. Kick spez where it hurts. Right in the active user numbers",
            "I don't get it. Why is this community in particular still being so weird about this? Your protest failed, as many said it would, and reddit is collectively shrugging its shoulders and moving on. Stop making this so weird. Stop holding the community hostage.",
            "I would like a dnd community app pls. \nWe could even have sections like “rpg help” or “Goblin mode”",
            "Just a reminder, if you're new to the fediverse, that you can access any community on any fediverse server, from any other! (subject to some federation magic you probably don't need to know)\n\nFor example, the RPGMemes community on TTRPG.network is https://ttrpg.network/c/rpgmemes\n\nHowever, if you're on lemmy.world, you can see that same community at https://lemmy.world/c/rpgmemes@ttrpg.network - and subscribe to it from there as well.\n\nGood luck and see you there!",
            "I wouldn’t call 1 new meme a day a „migration“, so ya‘all shouldn’t worry",
            "This isn't our subreddit anymore\n\nThey have replaced our elected moderators, changed our laws, punish us for things we have voted for like fascists they are\n\nEveryone, now it's time to leave."
        ]
    },
    "Not Safe For Wednesdays": {
        "title": "Not Safe For Wednesdays",
        "score": 154,
        "url": "https://www.reddit.com/r/dndmemes/comments/174wwh3/not_safe_for_wednesdays/",
        "content": "Salutations my fellow memers and gamers. Tomorrow is the day some are dreading or anticipating. Not Safe For Wednesdays will commence Midnight PST for 24 Hours and happen every week as long as things go well. The rules for NSFW’s will be more or less the same with some differences:\n\n1) NSFW posts must be marked with the Not Safe For Wednesdays and NSFW Flairs. \n\n2) Must be a Meme/Comic, not just a pic with no text and a headline. There’s other subreddits to show your Team Scales or Team Goblin love. \n\n3) Posting outside the time window will result in it being declined. \n\n4) Posters who habitually break the TOS and rules for NSFW’s will be banned. \n\nIf there are any suggestions or feedback, leave a comment. We will be opening a new round of Mod Applications in the coming weeks. More to follow. Thank you all for your patience. Hope the rest of your week is full of NAT 20’s.",
        "num_comments": 21,
        "comments": [
            "\nInterested in joining DnD/TTRPG community that's doesn't rely on Reddit and it's constant ads/data mining? We've teamed up with a bunch of other DnD subs to start https://ttrpg.network as a not-for-profit place to chat and meme about all your favorite games.  Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dndmemes) if you have any questions or concerns.*",
            "I'm sure I'm not the only one who thinks this: NSFW memes are fucking cringe.\n\nThere's already /r/nsfwdndmemes and it has a userbase over there. Why are they needed here, exactly? Being that the subreddit **can** contain nsfw content, flaired or not, means that some people will no longer be able to view it at work or in certain settings, as there's always a risk something slips through or it gets added to a filter, despite the nsfw warnings.\n\nThe poll you're using to justify this **I didn't even see** and I literally post here almost every day. Replace the automod response to a new poll to get a more representative sample, please. \n\nNSFW memes are cringe and allowing them is stupid. Please reconsider.",
            "Oh shit, is dndmemes open to actual people again?",
            "I think the idea is neat but the name is confusing, because it's kind of the opposite...the memes posted will only be safe for Wednesdays. \n\nMaybe just call it OSFW.",
            "Nvm. The issue fixed itself",
            "you have your own setup as people that aren't online are horny bards and people online are seducing goblins you kind of have some encouragement there also boulders gate 3 has nudity and S3X unfortunately NSFW is part of DnD",
            "Honestly, I don't think any poll on reddit even means anything with the amount of bots on this site these days. It was very weird how the vast majority of the comments on the poll post were against NSFW days, while the poll showed otherwise.",
            "From this Wednesday and last Wednesday, it appears people aren't posting NSFW memes really. Which is nice.",
            "The whole point is to make the subreddit harder to monetize for reddit.",
            "I also didn't see the poll, but favor this. When the sub did it's porn protest, it was the funniest it had ever been."
        ]
    },
    "Based on a discussion under one of the posts here. As can be seen, nobody can force you to abide by the official lore": {
        "title": "Based on a discussion under one of the posts here. As can be seen, nobody can force you to abide by the official lore",
        "score": 627,
        "url": "https://i.redd.it/vld0tgb1q28d1.jpeg",
        "content": "",
        "num_comments": 42,
        "comments": [
            "The enchantment wizard is far more sinister than any necromancer. \n\nModify memory, dominate person, feeble mind. Shit are all a horror show on their own, but combined create someone who can completely userp peoples very minds at every level.",
            "The stat block for necromancers also say \"A few use their powers for good, becoming hunters of the undead and risking their lives to save others.\" So even in official lore, not all necromancy is considered bad.",
            "As a DM I go intent to determine good/evil. One’s intent and how they use a spell is more of a indication of alignment than their spell list itself.",
            "I feel like the argument you are listing isn't valid.\n\nPHB says \"Necromancy frequently makes you evil\" okay.\nDMG says \"You do not have to abide by the the PHB\" okay.\n\nThe PHB is meant for Players, the DMG is meant for DM's. The argument made with your meme basically just says \"You as a DM can homebrew that Necromancers aren't evil, or ask your DM to homebrew it if you're a player\". \nYou also said \"no one can force you to abide the official lore\" yes - fun fact people run games they call \"homebrew\".\n\nSpeaking of homebrew, couldn't that be said to literally every argument posted on DnD? Just apply homebrew!\n\nThe argument tends to pertain to \"Is it [blank] while pertaining to the rules\". Everyone knows you can homebrew things via DM. That's never been what the argument has been. The argument is always pertaining to official lore.\n\nIt's like if there is an argument of \"Is Bowser always the bad guy?\" and you reply \"No I just played this third party game where he isn't that's heavily modded! So he isn't always the bad guy:)\".\n\nYou should have listed in Yugi's side something actually countering, for example what another commenter said that retains to the Necromancer stat block.\"A few use their powers for good, becoming hunters of the undead and risking their lives to save others.\" As that actually pertains to the argument people have, that even in official lore, not all Necromancers are considered evil.",
            "*shrugs in Circle of Spores druid* 🤷🏼‍♂️ 🍄",
            "I like guild wars lore in that there is both good necromancers and bad necromancers and on the better side they maintain the balance sending off souls while using the flesh as a construct",
            "Dude who runs the game: Dungeon Master  \nDude who plays the game: Dungeon Mastern't",
            "DM: actually necromancers dont HAVE to be evi-\n\nPlayer: That contradicts the PHB! What’s your source?\n\nDM: My source is I made it the fuck up!",
            "My necromancer build is a family doctor. He's genuinely nice and kind, and tries to reunite family members when his other arcane powers fail. Dad died in a freak farm accident? He can help!",
            "The act itself might be evil but the character itself can still be good. Both the necromancer and the dead they animate.\n\nBut because the act itself is evil, it usually takes an individual of great willpower to not be tempted by the evil.\n\nMost important of all though: Good and Evil in D&D are **not** just moral concepts, they are *tangible forces* in the universe. Like law and chaos, they hold power over multiverse.\n\nSo the way I see it is this: Good characters can use necromancy, but doing so is far more taxing than an evil character doing so, because the act itself is evil. Same with evil characters casting good-aligned spells. Furthermore, using such spells in places steeped in the energies of good/evil ease/tax the process even more. Why do necromancers always appear in haunted places and graveyards? Because the places are steeped in evil energies and make it easier to raise the dead. Same with rituals - infusion of an area with the desired energies.\n\nThe moral side comes when the character has to make a decision: Some spells might be impossible for them to cast if they are too far down that path they are on until they either grow stronger or steer from the path. Do they change their moral outlook and thus their alignment to make things easier for themselves or do they keep going?"
        ]
    },
    "Rope Trick": {
        "title": "Rope Trick",
        "score": 267,
        "url": "https://i.redd.it/9u6to9tb148d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "\nInterested in joining DnD/TTRPG community that's doesn't rely on Reddit and it's constant ads/data mining? We've teamed up with a bunch of other DnD subs to start https://ttrpg.network as a not-for-profit place to chat and meme about all your favorite games.  Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dndmemes) if you have any questions or concerns.*",
            "https://hard-drive.net/hd/tabletop-games/woman-only-buys-ancient-wizard-robe-of-infinite-power-because-it-has-pocket-dimensions/",
            "what's up with her mouth in the last picture?",
            "I wouldn't mind extradimentional pockets irl too\n\n[LinkTree](https://linktr.ee/TheImmortalThinkTank) | [Instagram](https://www.instagram.com/theimmortalthinktank/) | [Patreon](https://www.patreon.com/TheImmortalThinkTank) | [Twitter](https://twitter.com/CrawfordChe) | [Facebook](https://www.facebook.com/TheImmortalThinkTank/) | [WebToon](https://www.webtoons.com/en/challenge/table-tip/list?title_no=842302) | [Threads](https://www.threads.net/@theimmortalthinktank) | [Tumblr](https://checrawford.tumblr.com/)",
            "You haven't lived until you turn your Rope Trick space into a  hotbox... or an enhanced interrogation room",
            "Why is her nose drooping down her mouth?",
            "Girls got pockets for the first time ever, let her be happy",
            "She is that happy, I guess"
        ]
    },
    "But God forbid you do anything other than waste all your spell slots on Smite, and actually get to play a diverse class for once right?": {
        "title": "But God forbid you do anything other than waste all your spell slots on Smite, and actually get to play a diverse class for once right?",
        "score": 521,
        "url": "https://i.redd.it/2tz3ocmjt18d1.jpeg",
        "content": "",
        "num_comments": 95,
        "comments": [
            "These changes sound quite good. Having summon steed earlier is a really cool change because it's thematic but not really over powered.",
            "At this rate people might even realize that paladins are half casters instead of martials",
            "There's going to be parts of the relaunch that people dislike. Once everyone remembers to not be arseholes about the bits you like and dislike, it'll be grand.",
            "Steaming take: Smites aren't all that good in 5e either. \n\nSure, they're good when you, but just spamming them is almost never worth it for the damage. Not when you have spells to cast. They seem a lot stronger than they are because of their nova potential, the damage isn't really all that great.\n\nBy making it a bonus action thing, you've actually given a clear incentive for Paladin players to explore their other options. And the improvements we've seen to this options meam Paladin is now stronger and more balanced than ever.",
            "Did they keep that you can smite on unarmed strikes and ranged weapons from the UA?",
            "Where is everyone reading this, anyway?",
            "One of the biggest problems of this change is that at higher levels this new version of smite becomes useless since bbeg's like Tiamat have inmunity to spells of 5th level and below.",
            "These charges will ironically make the average paladin much better, because they'll be smiting less and casting spells more.",
            "It isn't so much that smites are now a bonus action, its that divine smite became a spell and is now able to be counterspelled that ruins it. Paladins were good for fighting liches, now the lich can just counterspell a crit smite and laugh, as well as rakshasas being immune to smites now, that is what ruined divine smite.",
            "Sure, there’s a lot of good that’s come out of it, but for what they’ve given you, they’ve now made Smite vulnerable to Counterspell, Mage Slayer, likely Silence, any creature with Spell Turning  or Magic Immunity effects and the like, and it inherently makes one of the fan favorite multiclasses (that being Paladin/Barbarian) a shadow of its former self. \n\nIf Treantmonk is to be believed from his analysis of the new Paladin they’ve also nerfed the duration of the Paladin’s subclass capstone. Jeremy mentioned it an hour while Chris corrects him and says his preview book has a different duration, and I highly doubt they’d have increased the duration. \n\nTo pretend the changes are all positive is a disingenuous argument. You need to take the good with the bad, and it’s okay if not everyone is happy with it."
        ]
    }
}