{
    "Weekly Question Thread: Ask questions here – June 23, 2024": {
        "title": "Weekly Question Thread: Ask questions here – June 23, 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/dndnext/comments/1dmyrnv/weekly_question_thread_ask_questions_here_june_23/",
        "content": "Ask any simple questions here that aren't in the FAQ, but don't warrant their own post.\n\nGood question for this page: \"Do I add my proficiency bonus to attack rolls with unarmed strikes?\"\n\nQuestion that should have its own post: \"What are the best feats to take for a Grappler?\n\nFor any questions about the One D&D playtest, head over to /r/OneDnD",
        "num_comments": 18,
        "comments": [
            "If a Giant Barbarian/Fighter has Great Weapon Fighting, does he reroll only the base damage of the weapon or also the elemental extra damage from elemental cleaver?",
            "Is there any free online temples for creating homebrew classes?",
            "I'm looking to play a fun for the table sword and board-ish character for a one shot test run. It's my friend's first time DM'ing, my first time playing. The char may or may not go on to be my char, but I hope they do. Currently leaning towards a fighter or paladin, but open to options. Only requirement is that it uses weapons.",
            "Which feat would be considered best for overall character survivability, Tough or Defensive duelist?\n\nI'm in the mindset that preventing one instance of large damage is better than soaking all damage, but I'm not 100% sold on the idea.",
            "Does the Quasits invisibility cost an action? Or can he go invisible at the end of each turn? I know its a dumb question but Im just making sure Im not gonna be making this little bugger more difficult than he needs to be in lmop. My players ended last session in the redbrands hideout and Im excited to run the glassstaff encounter because itll be their first real boss fight after completely owning Klarg. (They literally made him grovel for his life after decapitating Ripper).",
            "What happens if you gain temporary hit points while at 0 hit points.\n\nWhat happens if you get polymorphed while at 0 hit points.",
            "> Question that should have its own post: \"What are the best feats to take for a Grappler?\n\nMake a separate post.",
            "Tough tends to work out better, because its entirely unconditional, and improves survivability against effects that bypass ac to always deal damage (falling, traps, fireball).",
            "It takes an action for a Quasit to go invisible as it is under the Actions section of their stat block.",
            "the book isnt out. the people with advance copies have NDAs so they cannot say."
        ]
    },
    "D&D Beyond Content Sharing Thread - June 27, 2024": {
        "title": "D&D Beyond Content Sharing Thread - June 27, 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/dndnext/comments/1dq4r8h/dd_beyond_content_sharing_thread_june_27_2024/",
        "content": "Whether you're requesting or offering content please feel free to post here.\n\nIf you're requesting content remember that no one is required to provide you access to their content and to be polite to those that do.",
        "num_comments": 3,
        "comments": [
            "# Here are my campaigns, I will look to reset each weekly, spread through the week.\n\nJoin one campaign at a time to ensure other players can use the spots. You may have multiple characters in the same campaign\n\nI have all theWOTCsourcebooks you canbuy, and the new Grim Hollow: Player Pack\n\n|CAMPAIGN|NEXT RESET|\n|:-|:-|\n|[Wandering through Wildemount](https://www.dndbeyond.com/campaigns/join/55874743421012737)|Saturday|\n|[Crossing Strahd](https://www.dndbeyond.com/campaigns/join/55716182883203801)|Monday|\n|[Happily in Humblewood](https://www.dndbeyond.com/campaigns/join/55659602305188125)|Wednesday|\n|[The Sword Coast](https://www.dndbeyond.com/campaigns/join/55626853982038222)|Friday|\n\n\n\nIf you have Master Tier account on DnDBeyond and can share content, Send me a campaign invite and I will add a character, all your players will be have access to the content I have.\n\nYou can also give back to the community this way.\n\nSponsored campaigns:\n\n|CAMPAIGN|NEXT RESET|\n|:-|:-|\n|[Acquisitions Incorporated](https://www.dndbeyond.com/campaigns/join/56429063856278305)|Friday|\n\n.",
            "Finally have nearly all the Sourcebooks (No Wildemount) and have a few campaigns open. Please create a character and export then leave it to make space for other people. I will **ONLY** be clearing out **every Thursday** to coincide with this post.\n\nIf you want permanent access, please consider creating a campaign and purchasing the Content Sharing from D&D Beyond. You can send me a link to your campaign and it will share all my content with anyone in your campaign. Especially useful for new DMs!\n\n**Share 1:** [https://www.dndbeyond.com/campaigns/join/4199512471660934](https://www.dndbeyond.com/campaigns/join/4199512471660934)\n\n**Share 2:** [https://www.dndbeyond.com/campaigns/join/4217290106988214](https://www.dndbeyond.com/campaigns/join/4217290106988214)\n\nAlso, I highly recommend checking out this link so you can maximize having the books: [Printing Books to PDF](https://www.reddit.com/r/dndnext/comments/10k2407/save_your_ddbeyondbooks_as_pdfs/)\n\n[Patrons](https://www.patreon.com/user?u=5350003) can get permanent access as well as helping to get books for everyone else in all the campaigns. I also post some maps that I create as well, most of which are free to everyone."
        ]
    },
    "Give me your controversial optimisation opinions": {
        "title": "Give me your controversial optimisation opinions",
        "score": 76,
        "url": "https://www.reddit.com/r/dndnext/comments/1dr16sf/give_me_your_controversial_optimisation_opinions/",
        "content": "I'll start: I think you should almost never take the Light cantrip except for flavour reasons. It's not a bad cantrip, you just shouldn't take it, because wasting one of your limited cantrip slots on an effect that can be easily replicated nonmagically is bad. You have too little cantrips to justify it. Maybe at higher levels or on characters with a lot of cantrips it's good but never at 1st level.\n\nEDIT: Ok I admit, you can't have a free hand with a torch. I still think other cantrips are way better, but Light does have some use.",
        "num_comments": 272,
        "comments": [
            "Casting Hex/Hunter's Mark is a scam unless you get it as a pure martial character. I always see them getting hyped up but every time I've cast them in a real game, it felt like I could have just cast another concentration spell that does something actually useful.",
            "i think a lot of people multiclass without a good plan or a good reason and it doesn't help them.",
            "If you are ever planning on taking a feat during your character's career, always take it as early as possible.\n\nYour character just has less features in general at early levels, so the feat is a higher percentage increase in the number of features when taken early. Going for an ASI is a negligible difference while actually playing the game, and it can be saved for later when you already have a million other features. When asked the question ASI or feat at level 4, I will always suggest a feat.",
            "Heavy armor master feat is better than a +2 to con for most frontline martial classes. \n\nIf you can use heavy armor and dont need to boost your concentration saves, then HAM is going to be way better than increasing con. Most attacks from monsters deal nonmagical b/p/s damage. So if you get hit more times in a fight than your level divided by 3 (e.g. a level 9 fighter being hit 3 times) then HAM will save more HP than you wouldve gained from that con boost. Plus, you save the healing resources you wouldve spent to heal those HP. Plus you get a +1 to Strength! Its my new favorite feat",
            "Ill post later, but on Light: have you seen how crap the cleric cantrips are? Light is one of their 7 best, for sure. (They have 9.)",
            "If you ignore \"Monk as intended\" (unarmed strike spammer), the Monk class isn't really a bad martial class. It's better than Rogue (outside of tables with generous interpretations of skills) and than Barbarian.",
            "Broken chracter builds that rely on 7 levels across 3 classes to come online are less a problem with game health and more a problem with the optimiser's mentality.",
            "I think 5e is too easy to bother power gaming. Simply not enough choices and interactions for it to be rewarding outside perhaps just trying to make a bad mechanic good for a bit",
            "The vast majority of optimization people do is meaningless in a real campaign, because the campaign is more complicated than your assumptions and your choices are only optimal when all your assumptions are true.",
            "Give a man a torch he will have light for a day. Teach a man fireball and he will never worry about kobolds in the darkness again!"
        ]
    },
    "New Ranger | 2024 Player's Handbook | D&D": {
        "title": "New Ranger | 2024 Player's Handbook | D&D",
        "score": 392,
        "url": "https://www.reddit.com/r/dndnext/comments/1dqmujm/new_ranger_2024_players_handbook_dd/",
        "content": "[https://www.youtube.com/watch?v=TF4-B9O0tyo](https://www.youtube.com/watch?v=TF4-B9O0tyo)",
        "num_comments": 500,
        "comments": [
            "I don't understand why they tripled down on HM as the Ranger's main feature and then decided to solve none of the issues surrounding the spell. It's genuinely baffling. \n\nCrawford, my dude, you're the head game designer. If you think no concentration on HM is too broken because of multiclassing, then come up with a new signature ability?",
            "So Hunters Mark is now a core feature (or four features??) but the Beastmaster has to use their BA to command their beast. \n\nIt sucks having to choose which core mechanic of your class you have to ignore.",
            "How can he say with a straight face that HM having free casts lets you use your other spells when it's still concentration along with most ranger spells",
            "If there are exactly zero consentration spells in the Rangers spell list, then the reworked hunters mark is a good ability.\n\nIf there are any concentration spells worth taking AT ALL on that list, the whole class falls apart.",
            "The lack of exploration and survival features other than a climb and swim speed makes me concerned that the exploration pillar overall didn't receive any sort of real expansion in this revision.",
            "Jeremy Crawford is the worst head designer in the industry today",
            "Not having watched this yet, the fact that this was, possibly to a greater degree than any of the others, a class that they botched in the playtest content and the dusted their hands off as though it wouldn't do well, and give people a lot of comfort, to have a well-received version of before churning out the final, official version of, leaves me apprehensive...",
            "I try to stay positive but this is fucking awful.",
            "Just play ranged rogue or fighter..  \n\nThis class is fucking cursed.",
            "Ive had some issues with other classes.  But this is the first one that actually makes me mad."
        ]
    },
    "New 2024 Warlock article is up now as well": {
        "title": "New 2024 Warlock article is up now as well",
        "score": 115,
        "url": "https://www.reddit.com/r/dndnext/comments/1dqsp2r/new_2024_warlock_article_is_up_now_as_well/",
        "content": "https://www.dndbeyond.com/posts/1756-2024-warlock-vs-2014-warlock-whats-new\n\nMight help you being distracted from the Ranger.",
        "num_comments": 99,
        "comments": [
            "We need to see the invocations, but im actually pretty happy about the new warlock.",
            "I am kind of disappointed that the article doesn't mention the changes to the Pacts, other than they are now Invocations. Would have been nice to get confirmation that the new Pact of Blade allows you to use CHA for your attack and damage rolls for your weapon.",
            "> \"Once you use this feat, you cant use it again until you complete a Short Rest, a Long Rest, or roll for Initiative.\"\n\nThis is such an excessively long way to avoid saying \"Once per encounter.\" It's so silly lmao.",
            "While I do get it it does suck that Invocations still can only be changed on level up. It depends on what they look like in general but it is good that they don't have the \"use warlock spell slot to use this\" ruling in place anymore, with exceptions (Eldritch Smite was name dropped so that might be one of them) to blunt the blow a bit.\n\nWhat I don't like however is repeatable Invocations. The idea of having two of the same Agonizing Blast apply to two different cantrips is really shitty. Sure you get more Invocations in general but again, *how* many more is the question. What was wrong with applying one to all? Just seems really resource draining as is. Again that depends on what the Invocations end up looking like. Who knows maybe Agonizing Blast can only apply to *one* roll of Eldritch Blast and that's how it was balanced.",
            "Being able to contact your patron once you hit level 9? Is it just me or does that seem odd.. In my opinion, being able to contact your patron always felt like an RP focused aspect of your character that you should have access to by default anyways.",
            "I think you should probably get the upgraded version of eldritch master at a much earlier level for how powerful it actually is. All it does is save you 59 minutes in a moment where you're probably likely to take a short rest anyway.",
            "After the bittersweet, mixed bag of mechanical goodies/flavorful crap that was the Ranger...\n\nWe get the overall upgrade for the Warlock, arguably my favorite Class alongside Artificers. Never thought I'd be more excited to play a GOOlock before today.",
            "I have the prediction that the fey patron is going to be the new ultimate dip for multiclasses ( if the number of misty steps is based on proficiency). It'd work great with any martial classes.",
            "Lore-wise how do Warlocks work if they dont have their pact unlocked till lvl 3?",
            "Have we heard if you can choose your main stt between CHA and INT? \n\nIf the \"Seekers of Occult Magics\" are still charismatic, Im a bit dissapointed."
        ]
    }
}