{
    "Weekly Question Thread: Ask questions here – June 16, 2024": {
        "title": "Weekly Question Thread: Ask questions here – June 16, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/dndnext/comments/1dhjqtl/weekly_question_thread_ask_questions_here_june_16/",
        "content": "Ask any simple questions here that aren't in the FAQ, but don't warrant their own post.\n\nGood question for this page: \"Do I add my proficiency bonus to attack rolls with unarmed strikes?\"\n\nQuestion that should have its own post: \"What are the best feats to take for a Grappler?\n\nFor any questions about the One D&D playtest, head over to /r/OneDnD",
        "num_comments": 21,
        "comments": [
            "Hey. I'm a new dm and I'm a bit confused about what Challenge Rating of monsters I should be giving my players. I have a group of 5 at lv6,so could someone advise me on what I should be looking at for a challenging encounter?So far I've just used the campaign book,but I feel they are outleveling the encounters in the book.",
            "How do artificer tools and their proficiencies work exactly? I'm about to introduce my artificer into one of my \\[5e\\] campaigns, and, since I know artificers tend to be harder characters to play, I've been reading up on the traits, and some are proving to be confusing. Any help would be appreciated.\n\n1. When making a check or ability roll that involves tools, when would you not have tool that you're proficient in? I'm thinking about \\*Right Tool for the Job\\*, or having to choose a specific artisan tool set for \\*Tool Proficiency\\* (and in my character build, \\*Artisan's Intuition\\* as well). Since you already have Thieves' Tools and Tinkerer's Tools (and Alchemist's Tools), why would there be a need for any others? Don't those cover every need? If I don't have proficency in Weaver's Tools, for example, can't I just use Tinkerer's Tools instead, and it'd do the same thing?\n2. I am a Mark of Making Human. Do those bonuses stack with the artificer ones? For example, could I use the Artificer's \\*Tool Proficiency\\* (+3), and the Mark of Making's \\*Artisan's Intuition\\* (+d4) to give myself a (+3 +d4) to an alchemy roll?\n\nThank you for your explanations.",
            "Can you order the new dnd books bundle from dnd beyond if you are outside of the US? I only see the US as country selection. I live in Europe.",
            "How does one effectively fight with great weapon user (greatsword) echo knight in combat? If it's a single creature, im assuming me and the echo just jump the target or do i just send the echo repeatedly at it while hang in the back from afar?  \n\n\n I know in mutiple enemy engagement i would send the echo to one enemy while i take on another obviously but a single target just had me wondering is all. I already watched videos on the things you can do with the echo and how it functions and i believe i understand it for most part. ",
            "First read the rules for building encounters in the DMG or Basic Rules, then use an encounter builder like [kobold fight club](https://koboldplus.club/#/encounter-builder) to help you browse options and do the math. Keep in mind that CR is helpful to establishing a benchmark but it should just be the starting point in encounter design, there are lot of factors that it or any other simple to use tool can't account for. There can be a lot of variance between individual PC builds, party composition, and player competence, so once you get a sense of what the rules say is a \"deadly\" fight actually means for how much it challenges your players you're going to be grading them on a curve. The system is also designed with the idea that the PCs are going to be getting into multiple fights in a full adventuring day (the daily XP threshold gives a rough sense of what \"full\" means) with a couple of short rests in between fights, so if you're running fewer fights between long rests then the party is going to be able to hit above their weight class and certain classes are going to be performing better than others.",
            "The CR system is not a perfect science. Ideally, a 4 person party of level x should find a monster of challenge rating x a \"challenging\" encounter. This doesn't take into account any kind of magical items the party may have that they can use to their advantage.\n\nIn practice I've found this is almost never the case especially when you consider action economy. One monster of a challenge rating a few numbers higher against a party of 4 will see the party of 4 win 9 times out of 10 purely because it's 4 turns against 1 turn.  \n\nYou have an extra player which skews things even more in their favour. Bump up the enemy's health, throw in an extra low CR minion or two.\n\nHowever, some monsters like Shadows or Intellect Devourers punch well above their weight for their challenge rating and a single one could wipe your party if the dice gods deem it so. In time, as you get more experience, you'll just naturally learn what will work and what won't.\n\nYou can use Kobold Fight Club or DND Beyond's Encounter Builder to get a decent indication into an encounter's difficulty. Although I've found that even \"Deadly\" encounters can often be steamrolled by the PCs.",
            "Any one of a number of online calculators can help with the official Challenge Rating math crunching.  Kobold Fight Club’s license has  been picked up by Kobold Plus who has added some new options. https://koboldplus.club/#/encounter-builder )\n\nbut remember that despite “using math\", the CR system is way more of an art than a science. \n* read the descriptions of what each level of difficulty means, dont just go by the name. (ie “ **Deadly**. A deadly encounter could be lethal for one or more player characters. Survival often requires good tactics and quick thinking, and the party risks defeat.”)\n* while the CR math attempts to account for the number of beings on each side, the further away from 3-5 on each side you get, the less accurate the maths are, at “exponential” rate. Read up on “the action economy” – particularly now that expansions like Tasha’s are making it so that every PC almost universally gets an Action AND a Bonus Action each and every turn, and can often also count on getting a Reaction nearly every round. Most monsters dont have meaningful Bonus Actions or any Reactions other than possible Opportunity attacks.\n\t* **Dont do party vs solo monster** – while Legendary Actions can help, “the boss” should always have friends with them. Or you will need to severely hack the standard 5e monster design constraints and statblocks. (tell your party you are doing this so that the increase in challenge comes from the increase in challenge and not from you as DM secretly changing the rules without telling the other players the rules have been changed, because that is just a dick move, not a challenge.)\n* The system is based on the presumption that PCs will be facing 6 to 8 encounters between long rests, with 1 or 2 short rests in between. Unless you are doing a dungeon crawl, that is not how most sessions for most tables actually play out – at most tables, the “long rest” classes are able to “go NOVA” every combat, not having to worry about conserving resources, so if you are only going to have a couple of encounters between long rests, you will want them to be in the Hard or Deadly range, if you want combat to be “a challenge” – but keep in mind sometimes you might just want a change of pace at the table and get some chucking of dice or letting your players feel like curbstomping badasses and so the combat doesnt NEED to be \"challenging\" to be “relevant”.\n* Some of the monsters’ official CR ratings are WAY off (Shadows, I am looking at you), so even if the math part were totally accurate, garbage in garbage out.\n\t*  as a sub point – creatures that can change the action economy are always a gamble – if the monster can remove a PC from the action economy (paralyze, banishment,  “run away” fear effects) or bring in more creatures (summon 3 crocodiles, dominate/confuse a player into attacking their party)  - the combats where these types of effects go off effectively will be VERY much harder than  in combats where they don’t\n* not all parties are the same – a party of a Forge Cleric, Paladin and Barbarian will have very different “easy successes” and “difficult challenges” than a party of a Sorcerer, Rogue and Wizard.\n* Magic items the party has will almost certainly boost the party’s capability to handle tougher encounters.(a monster's CR is based in large part on its AC and \"to hit\" - if your players have +1 weapons, they are effectively lowering the monster's AC and if your players have +1 armor, they are effectively lowering the monsters' \"to hit\". If your players are mostly kitted with +1 weapons and +1 armor, you probably should consider monsters one lower than their listed CR. Not to mention all the impact that utility magic items can bring!)\n\nApproaching the problem by tossing out the bad default CR system and replacing it with Trekiros - Game Changer’s complex mathing that is probably more representative from both the player and monster side https://www.youtube.com/watch?v=A8FNVkFuhXI\n\nand a point based alternative in development from Mike Mearls, the original designer who has taken a mea culpa for the faults of the original 5e CR system. https://www.enworld.org/threads/fixing-challenge-rating.702118/ \n \nalthough a quick in your head approach from Sly Flourish works just as well most of the time if you roughly account for the caveats above: https: https://www.youtube.com/watch?v=05VWofhNMHI",
            "1. \"Tool Proficiency\" isn't really a thing.  You have proficiencies in particular types of tool--Mason's Tool Proficiency doesn't mean you'll have proficiency in Thieves Tools, and vice versa.  Right Tool for the Job allows you to make any tool, but you will have no particular skill in using those tools unless you've chosen to take proficiency in them\n\n2.  With the above caveat--you do not have \"Tool Proficiency,\" you have proficiency in \"thieves’ tools, tinker’s tools, (and) one type of artisan’s tools of your choice (chosen and fixed at character creation)\"--but otherwise, the answer is yes, you can stack proficiency in any tools you have proficiency for with the Mark of Making ability",
            "For products shipping outside the us you need to checkout on their partner site. https://dndstore.wizards.com/uk for the UK for instance. There should be a link below the checkout button on your cart.",
            "There's often not much point in both you and the echo being next to the same target, unless you're trying to block them.  The advantage that the echo offers is that you can attack without being open to counter attacks."
        ]
    },
    "/r/DndNext is looking for moderators!": {
        "title": "/r/DndNext is looking for moderators!",
        "score": 18,
        "url": "https://www.reddit.com/r/dndnext/comments/1dcmkgc/rdndnext_is_looking_for_moderators/",
        "content": "(looking for the DDB content sharing thread? go [here](https://www.reddit.com/r/dndnext/comments/1dfc9tx/dd_beyond_content_sharing_thread_june_13_2024/))\n\n(looking for the true stories thread? go [here](https://www.reddit.com/r/dndnext/comments/1dc6us9/true_stories_how_did_your_game_go_this_week_june/))\n\n(Looking for the magical items homebrew thread? go [here](https://www.reddit.com/r/dndnext/comments/1ddrrze/magic_item_homebrew_thread_june_11_2024/))\n\nAre you perpetually online?\n\nHave you ever wanted browsing the internet to feel like a job?\n\nDo you like random strangers yelling at you and arguing with you for no good reason?\n\nIf you answered yes to any or all of the above questions there's....probably something wrong with you. You should probably get that checked out. In the mean time, however, you should also sign up right [here](https://docs.google.com/forms/d/e/1FAIpQLSdRzLa97W6Wzq5Sy1cMRzKBsk0egAfmV_TB5C-caW0sLF1FkA/viewform?usp=sf_link) to be considered for moderation of r/dndnext!\n\nAs a moderator of dndnext, you'll receive such illustrious benefits as:\n\nuhmmm.....work?\n\nSo don't delay, sign up today!",
        "num_comments": 10,
        "comments": [
            "I'm actually trying to spend \\*less\\* time on Reddit because it has become a borderline addiction, so I'll pass.\n\nBut I want to take the chance of that topic being brought to thank the whole team. I don't know if the community is just more mature or if all the work you're doing is so \"behind the scenes\" I don't even see it. But overall I feel there is a great balance between freedom of speech and enforcing respect. I'd love to say that about other communities, about rpg or otherwise.\n\nThanks for your service.",
            "Seriously, though, I have no idea why anyone mods.",
            "Interesting!",
            "Question, is there anything that spurred the search for new mods? As others have pointed out, this subreddit currently seems very well maintained. Does it feel like there's more work to be done than there are people?",
            "Thank you a lot!",
            "Free power. Free control. No real punishment. Only thing it's missing to be a dream job is $10 an hour.",
            "Why do some people volunteer to pick up garbage at the park? Because it's required for everyone, including ourselves, to enjoy the space.",
            "It actually was me who initiated the search for new mods, as I noticed that several mods had become inactive, with me having done almost all moderating alone in the last weeks.        \nI felt that with OneDnD's book releases around the corner, it would be good to reinforce our team to better handle the expected increase of activity.",
            "Power and control over a chat room just seems sad.",
            "Trust me. A lot of people get the biggest thrill out of seeing two people they don't know having a conversation and then screaming \"SILENCE! PERSON A! YOU ARE BANISHED FROM THIS HOUSE!\"\n\nthen patting themselves on the back for protecting the safety of the space from the dangers of calmly having a discussion.\n\nUnless I was top mod I'd spend most of time unbanning people that did nothing wrong until my mod status was revoked.\n\nEdit: r/CastleFalkenstein is also looking for mods if anybody wants to add to their résumé."
        ]
    },
    "OneD&D Barbarian movement speed reduction is actually insane": {
        "title": "OneD&D Barbarian movement speed reduction is actually insane",
        "score": 376,
        "url": "https://www.reddit.com/r/dndnext/comments/1dlhefx/onedd_barbarian_movement_speed_reduction_is/",
        "content": "If you are a Barbarian at level 9, you Recklessly Attack with a javelin (which has the slow property), give up your advantage, and if you hit you reduce the targets movement by 25ft with no save. You can do this ~~twice~~ once per turn, every round, and you can do it from 30ft away from the monster.\n\nThink of all the monsters with 40ft move speed or less. Imagine if every single one of them, when fought alone, always had only 15ft move speed and could still be slowed down more by difficult terrain, prone, etc. \n\nAny melee monster that doesn't have either 50ft move speed or some other movement ability will either be completely shut out or only be able to get off opportunity attacks on the players (assuming another player doesn't also have a movespeed reduction ability like Ray of Frost).",
        "num_comments": 100,
        "comments": [
            "This submission appears to be related to One D&D! If you're interested in discussing the concept and the UA for One D&D more check out our other subreddit\nr/OneDnD! \n\n*Please note: We are still allowing discussions about One D&D to remain here, this is more an advisory than a warning of any kind.*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dndnext) if you have any questions or concerns.*",
            "> You get two chances to do this per turn,\n\nWait...\n\n>If you use Reckless Attack, you can forgo Advantage on the ***next*** attack roll you make on your turn with a Strength-based attack.\n\nWhat am I missing here?",
            "Good! Let's have Martials get cool things",
            "In my playtesting stacking slows and kiting big enemies definitely seems like it'll be a very common tactic now.",
            "Very cool- martials need more control options!",
            "Sounds sick. If a barbarian wants to spend their every action staking an enemy to the ground to keep them on the back foot, that sounds like clever play. Until they meet anything with misty step. Or one of about a hundred other abilities that can counter this, because it's D&D.",
            "Just another reason why having multiple targets in an encounter is key.\n\nHonestly, I kinda like the idea of a martial getting legitimate crowd control options like that.",
            "I'm not sure if you are trying to say its broken or not, but the dm could always just have more than one guy you have to fight.",
            "If the monster has any sort of brain and can’t reach the guy, they can just move then dodge. Then the barbarian has a good chance of missing and melee combat will resume as normal.\n\nIt’s a good tactic but not insurmountable. No monster is just gonna stand there and get hit.",
            "Meanwhile a level 5 caster can cast plant growth to quarter the move speed off all creatures in a 100 ft radius with no save or attack roll to hit required. You can do this from 150 feet away."
        ]
    },
    "\"Enough of this tactical crap\" - what to do about a table divided about what they want?": {
        "title": "\"Enough of this tactical crap\" - what to do about a table divided about what they want?",
        "score": 37,
        "url": "https://www.reddit.com/r/dndnext/comments/1dlsopk/enough_of_this_tactical_crap_what_to_do_about_a/",
        "content": "For context, have started up a second 5e table semi-recently and it has two players expressing significant dissatisfaction with the way things work while others approve a lot. Specifically, they've got a lot of clever humanoid enemies with all kinds of abilities I've pulled from everywhere, from pf2e fighters to 4e psions. The emphasis has been on abilities that give people choice - bleed for ten damage per turn until a con save is passed at the end of your turn or a successful medicine check is made on you, but if you moved this turn you can't make a con save against it. That sort of thing.   \n     \nThe wizard, druid and talent players have all expressed repeatedly that they are loving the variety and feeling like their enemies are thinking people rather than video game characters, while the barbarian and fighter are visibly getting more and more frustrated every time they get handled by an enemy tank or get hit with plant growth. Obviously one answer is separate but given that outside of combat everything is going really well, that's not my ideal.\n   \nDoes anyone have any advice? The basic problem is boils down to half the players want to just charge in and start swinging and the other half want foes who wouldn't have gotten to where they are if that was something that worked on them.",
        "num_comments": 53,
        "comments": [
            "Might be another case of crit fumble syndrome. \n\nAre all your abilities and clever enemies taxing your melees disproportionately more than your casters? \n\nMelees are very sensitive to anything that makes moving around the battlefield harder; disadvantage;  anything that reduces attack bonuses; highly mobile enemies, etc.\n\nMartials also have fewer tools to interact and counter all those mechanics you're introducing to the game.",
            "Do the fighter and barbarian tend to be the ones experiencing the various effects more frequently? Id assume that is the case given they are always toe to toe. I can see it being quite frustrating for them.\n\nAlso prior to the combat are you explaining exactly how the new mechanic works if it hasn't been encountered before? While this can be meta it's still important to explain exactly what is going on. Many people don't enjoy DMs when they basically go \"monster hit you ohh by the way this happens\" when there is zero warning or indication at all.",
            "I would think about whether these clever enemies are challenging all of your party equally. If the fighter feels constantly pinned down whilst the casters get off free then that will feel bad, and you can argue that some clever enemies would want to target the squishy mage over the fighter anyway. It might feel better if you can spread the hurt, whilst still being realistic and challenging.\n\nI’d also consider if there is any way for your martial characters to learn the same abilities as are being used against them. If the enemy tank can do it, why can’t they spend some time and gold learning the same skill? That might suddenly make things feel a lot better.\n\nI would talk to your complaining players about both those aspects and see if you can fix anything there, and also see if there’s anything more to their objections.\n\nUnfortunately, if it does just boil down to a table that wants very different things, then you’ll have to consider how far you’re willing to compromise to a halfway point, or whether you like the tactical type of game and need to just tell your fighter and barb that this isn’t the right table for them. It sounds like you really enjoy the tactical combat style, and they really aren’t open to it, in which case it might be best to bid them goodbye unfortunately.",
            "The three spell casters are having a great time but the two melee martials are getting frustrated with combat... Well I can't say I'm surprised",
            "Spunds like a melee/caster issue. If there are effects you're applying that negates too much of the melees ability to do their thing,  then they'll be frustrated for sure. Try to analyze if your style is punishing them disproportionately.\n\nI'd try to come up with an item that helps them counter the more frustrating enemy strategies so they can feel more relevant again.",
            "Do they play using 5e barbarian and fighter?\n\nBecause added to crit fumble syndrome as other people said, fighting enemies that use tactics and homebrew everything when you have a class with 0 amount of flexibility and combat adaptability feels like fucking shit.\n\nLike, when you use enemies with homebrew abilities from pf2 and 4e you are kinda agreeing to the fact that 5e just doesn't have enough tools for non magic users, and being \"expected\" to get tactical with absolutely 0 tools is frustating",
            "You've described multiple abilities that disproportionately affect martials since they affect movement and what enemies they can target. Plant Growth alone can be an instant shut-down. How many enemies do you have with Counterspell or similar effects? It legit sounds like the melee players are either unable to use their features, or they get punished if they do.\n\nThis is a feature of 5e, to be clear - difficult terrain and being grappled, restrained, frightened, and even charmed - affect martials way more than they affect casters, so you might be reinforcing that pattern.\n\nThat said, it is absolutely possible that those two people gravitated towards classes that require very little thinking to begin with because they just don't like tactics. But we have no way of knowing.",
            ">Specifically, they've got a lot of clever humanoid enemies with all kinds of abilities I've pulled from everywhere, from pf2e fighters to 4e psions. The emphasis has been on abilities that give people choice - bleed for ten damage per turn until a con save is passed at the end of your turn or a successful medicine check is made on you, but if you moved this turn you can't make a con save against it. That sort of thing. \n\nThat's not a choice that's a dilemma. The difference being there are multiple options which are equally bad. The player can forgo their attacks and use a medicine check, take the damage but not move, or move and take the damage. \n\nDo you see how this type of effect really limits the players options? From the players' perspective they lose their action, movement and still take 10 damage or take 10 damage per round. And the loss of action and movement is a maybe to stop the effect. 10 damage per round averages out to 30 damage over an encounter. That's \n\nHave you given the players anything to account for the increased lethality? Do the players have any special abilities or effects beyond 5e? Do they have access to better armor or more HP or healing items?\n\n>The wizard, druid and talent players have all expressed repeatedly that they are loving the variety and feeling like their enemies are thinking people rather than video game characters, while the barbarian and fighter are visibly getting more and more frustrated every time they get handled by an enemy tank or get hit with plant growth.\n\nIt seems like the fighter and barbarian are being targeted by these new effects disproportionately and the wizard, druid, and talent, are not. \n\nThe players who likely aren't being limited by these new effects are enjoying the \"variety\" while those that are feel limited. \n\n>The basic problem is boils down to half the players want to just charge in and start swinging and the other half want foes who wouldn't have gotten to where they are if that was something that worked on them.\n\nThis is the martial caster divide. The casters have cool options that just work and the martials need to ask DM may I to do anything cool. Mechanically all a fighter and barbarian do is move and hit things. You need to give them extra cool stuff if you want them to buy in because right now it appears that they are only being penalized.",
            "\"Charge in and start swinging\" is the entire option set for martials. They usually have to close the distance, and endure what's there. So you're adding disproportionately to their adversity. \n\nMake it easier to close the distance, use BG3 jump rules (jump is a bonus action and can increase overall movement by the result of the jump check, and make the jump check equal to the distance horizontal, vertical, and standing so they can barbarian leap on top of a house) and stop adding effects that punish them for closing. There are lots of other cool tactical effects you can use.",
            "\"While the Barbarian and Fighter\" - \"Plant Growth\" - \"Take damage if they move\"\n\nmy initial thought is that maybe you are using a lot of CC, and melee characters suffer the most because of it because they have to spend entire turns not doing anything, while this kind of CC rarely effects ranged characters in the same way.  The difference between range and melee in 5e is absurd already, and you might just be making it worse."
        ]
    },
    "The 2024 Berserker Barbarian is an insane damage dealer, even with the new GWM feat. ": {
        "title": "The 2024 Berserker Barbarian is an insane damage dealer, even with the new GWM feat. ",
        "score": 170,
        "url": "https://www.reddit.com/r/dndnext/comments/1dlfar7/the_2024_berserker_barbarian_is_an_insane_damage/",
        "content": "First frenzy has been changed. Now it adds a number of d6s equal to your rage damage modifier to your attack **once per turn (not round)**. At level 3 that is 2d6, At level 9 that's 3d6, and at level 16 that's 4d6. \n\n\nAt level 10 they get retaliation. This allows them to make a weapon attack with a reaction against a creature that hits them. Which will be every turn. **This adds frenzy damage**. With a feature like this, I'd tell the DM I don't even try to dodge if necessary. \n\n\nThis build will be simple. Species doesn't matter. No other feat matters. The Barbarian will use a great sword/greataxe/maul for its weapons, and it will just take the great weapon master feat. In 2024, you can fit way more feats into builds, but we'll just take this one. With the 2024 rules, GWM gives you +1 to strength and adds your proficiency bonus to damage once per turn. You still get the bonus action cleave if you kill something. It no longer does the -5 +10 thing. \n\n\n**At lv 5 with 18 strength**: 4d6 + 12 (weapon attacks with rage bonus) + 2d6 (frenzy) + 3 (gwm) = 36 avg. An extra 11 from another weapon attack if the bonus action triggers.\n\n\n**At lv 10, now 20 strength, 3 rage damage, 3d6 frenzy, with brutal strike and retaliation added**: 4d6 + 16 (weapon attacks w/ rage) + 3d6 (frenzy) + 4 (GWM) + 1d10 (brutal strike) + 2d6 + 8 + 3d6 (off turn retaliation attack w/ rage and frenzy bonus) =  75.5 avg if all attacks hit.\n\n Add another more damage with bonus action attack.\n\nThat's every turn with no resource but a rage usage, No need for allies to boost you up with bless or anything, No need to ever turn great weapon Master off because you're facing the boss and their armor class is too high. Just consistent damage, with no accuracy penalties, **All while knocking people prone, pushing them around 10-30 feet at at a time, leaving into multiple enemies, we're doing automatic damage even if you miss. You have advantage on two out of three of your attacks each turn because you forego advantage once to do brutal strike. \n\n\nI have not factored in pole arm master to get the guaranteed bonus action attack or feats like charger to get an additional 1d8 damage each turn either. This also is not factoring in magical weapons, which will easily add another 6 to 9 damage per turn. ",
        "num_comments": 44,
        "comments": [
            "This submission appears to be related to One D&D! If you're interested in discussing the concept and the UA for One D&D more check out our other subreddit\nr/OneDnD! \n\n*Please note: We are still allowing discussions about One D&D to remain here, this is more an advisory than a warning of any kind.*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dndnext) if you have any questions or concerns.*",
            "I’ve been saying the same thing since seeing the release—I never thought I’d actually *want* to play a berserker. They also get so many more rage uses.\n\nYou’re just mentioning the offense, but they’re also nuts defensive too, especially with the improved dex save advantage, 0HP revive bringing you back to 2x your barb level in health,  and all the utility from brutal strikes. Do a bajillion damage and take a bajillion damage, sounds amazing…honestly might even be better than fighters",
            "Yeah that's true. One of the worst subclasses to one of the best.",
            "I’m glad they did change it, berserker was THE barbarian fantasy class, I’m glad it’s mechanics reflect that now",
            "Wow, I didn't notice Frenzy added per-turn.\n\nThat's actually pretty weird in an edition that _removed_ it from Sneak Attack. huh.",
            "Do we have confirmation that GWM will be a feat in 5.5? I didn't think the list of 70ish were available yet.",
            "If I remember correctly, Frenzy only adds damage when you are recklessly attacking. Which you can only do during your turn, unless they changed that as well.",
            ">Now it adds a number of d6s equal to your rage damage modifier to your attack once per turn (not round). At level 3 that is 2d6, At level 9 that's 3d6, and at level 16 that's 4d6. \n\nRogue: What am I, chopped liver?",
            "“If all attacks hit” is like assessing spells if creatures never passed their saving throws. Factor in hit averages and you’ll see that whopping 75.5 damage go down a lot.",
            "Good I framing hope so!  When they only thing you do is damage, and you're paying for it with melee range, you had better be able to deal more *of* it than anyone else.   That's always been the fantasy of Barbarian but gameplay has not really delivered on it so far in 5e."
        ]
    }
}