{
    "Doctor Who 1x08 \"Empire of Death\" Post-Episode Discussion Thread": {
        "title": "Doctor Who 1x08 \"Empire of Death\" Post-Episode Discussion Thread",
        "score": 536,
        "url": "https://www.reddit.com/r/doctorwho/comments/1dliqxa/doctor_who_1x08_empire_of_death_postepisode/",
        "content": "**Please remember that future spoilers must be tagged. This includes the next time trailer!**\n\n---\n\n**This is the thread for all your indepth opinions, comments, etc about the episode.**\n---\n\nMegathreads:\n\n\n* ['Live' and Immediate Reactions Discussion Thread](/r/doctorwho/comments/1dlg4xn/doctor_who_1x08_empire_of_death_live_and/) - Posted around 60 minutes prior to initial release - for all the reactions, crack-pot theories, quoting, crazy exclamations, pictures, throwaway and other one-liners.\n* [Trailer and Speculation Discussion Thread](/r/doctorwho/comments/1dlicv4/doctor_who_2x00_joy_to_the_world_trailer_and/) - Posted when the trailer is released - For all the thoughts, speculation, and comments on the trailers and speculation about the **next** episode. Future content beyond the next episode should still be marked.\n* **[Post-Episode Discussion Thread](/r/doctorwho/comments/1dliqxa/doctor_who_1x08_empire_of_death_postepisode/) - Posted around 30 minutes after to allow it to sink in - This is for all your indepth opinions, comments, etc about the episode.**\n* BBC One Live Discussion Thread - Posted around 60 minutes prior to BBC One air - for all the reactions, crack-pot theories, quoting, crazy exclamations, pictures, throwaway and other one-liners.\n\nThese will be linked as they go up. If we feel your post belongs in a (different) megathread, it'll be removed and redirected there.\n\n---\n\nWant to chat about it live with other people? Join our Discord [here](https://discord.gg/doctorwho)!\n\n---\n# What did YOU think of Empire of Death?\n\nClick [here](https://www.reddit.com/message/compose?to=PCJs_Slave_Robot&subject=DoctorWho%20Story%20Poll&message=320%20%28Empire%20of%20Death%29%3A%20) and add your score (e.g. `320 (Empire of Death): 8`, it should look like [this](https://ss.pcj.io/2018-10-14_15-55-50.png)) and hit send. Scores are designed to match the Doctor Who Magazine system; whole numbers between 1 to 10, inclusive. (0 is used to mark an episode unwatched.)\n\n**Voting opens once the episode is over to prevent vote abuse. You should get a response within a few minutes. If you do not get a confirmation response, your scores are not counted. It may take up to several hours for the bot (i.e. it crashed or is being debugged) so give it a little while. If still down, please let us know!**\n\nSee the full results of the polls so far, covering the entire main show, [here](https://www.reddit.com/r/doctorwho/wiki/poll_results).\n\nEmpire of Death's score will be revealed next Sunday. Click [here](https://www.reddit.com/message/compose?to=PCJs_Slave_Robot&subject=DoctorWho%20Story%20Poll&message=309%20%28The%20Star%20Beast%29%3A%20%20%0A310%20%28Wild%20Blue%20Yonder%29%3A%20%20%0A311%20%28The%20Giggle%29%3A%20%20%0A312%20%28The%20Church%20on%20Ruby%20Road%29%3A%20%20%0A313%20%28Space%20Babies%29%3A%20%20%0A314%20%28The%20Devil%27s%20Chord%29%3A%20%20%0A315%20%28Boom%29%3A%20%20%0A316%20%2873%20Yards%29%3A%20%0A317%20%28Dot%20and%20Bubble%29%3A%20%0A318%20%28Rogue%29%3A%20%0A319%20%28The%20Legend%20of%20Ruby%20Sunday%29%3A%20%0A320%20%28Empire%20of%20Death%29%3A%20) to vote for all of RTD2 era so far.",
        "num_comments": 4706,
        "comments": [
            "Died 2024\n\nBorn 2024\n\nWelcome back the Ood!",
            "Doctor: “She made her choice to keep you safe and is living a full life, best to leave well off alone”\n\nRuby: “Fuck that shit lmao”",
            "All this episode needed to have worked for me would be for them to say \"The Tardis rebelled against Sutekh by connecting itself to Ruby back when they were on Ruby Road\". All the weirdness around her was just the Tardis at work the whole time, and not actually related to Ruby. \n\nThen you can have your \"Just a normal situation\" with the reveal of her mother. But they needed to explain the snow, the changing of memory/time and how the fuck Ruby created a whole fucking alternative timeline, a process which involved her A) Creating a version of herself that would always be 73 yards away from her at all times, even when physically impossible to move that fast or be in that spot. B) Have the ability to invoke such fear in people it made a mother abandon her child and a man who was ready to nuke the world resign his post. C) Travel back in time to see her past self and correct the timeline. \n\nRuby literally time travelled without a Tardis in that episode. She made it snow ON A SPACE SHIP. That needed paid off beyond her just being normal.",
            "So what was Maestro freaking out about there being a hidden song in Ruby's heart?",
            "Very excited for the s2 finale to finally reveal that Mrs Flood is just a batty old woman whose dementia causes her to occasionally make ominous speeches and address an invisible camera.",
            "Kinda hope Ruby steps into a Martha role for a while, cropping up once a season or so",
            "Cherry doesn't get her cup of tea, then Ruby avoids her cappuccino",
            "You know I didn't *dislike* Sutekh's use here but I did wonder if it justified all the effort to bring him back; setting up an elaborate mystery involving an actor's real name as a meta clue, getting his original 90-year-old actor back... I felt like Russel was cooking some INSANE shit but he was just, like... a good villain.",
            "That \"Clever boy\" line immediately reminde me of Clara. Apparently her clothing choice may be more than just a coincidence...",
            "wHY WOULD A 15 YEAR OLD HAVE A BLACK CLOAK"
        ]
    },
    "Doctor Who 2x00 \"Joy to the World\" Trailer and Speculation Thread": {
        "title": "Doctor Who 2x00 \"Joy to the World\" Trailer and Speculation Thread",
        "score": 206,
        "url": "https://www.reddit.com/r/doctorwho/comments/1dlicv4/doctor_who_2x00_joy_to_the_world_trailer_and/",
        "content": "**This is the thread for all the thoughts, speculation, and comments on the trailers. if there are any, and speculation about the *next* episode.**\n\n\n---\n\nMegathreads:\n\n\n* ['Live' and Immediate Reactions Discussion Thread](/r/doctorwho/comments/1dlg4xn/doctor_who_1x08_empire_of_death_live_and/) - Posted around 60 minutes prior to initial release - for all the reactions, crack-pot theories, quoting, crazy exclamations, pictures, throwaway and other one-liners.\n* **[Trailer and Speculation Discussion Thread](/r/doctorwho/comments/1dlicv4/doctor_who_2x00_joy_to_the_world_trailer_and/) - Posted when the trailer is released - For all the thoughts, speculation, and comments on the trailers and speculation about the **next** episode. Future content beyond the next episode should still be marked.**\n* [Post-Episode Discussion Thread](/r/doctorwho/comments/1dliqxa/doctor_who_1x08_empire_of_death_postepisode/) - Posted around 30 minutes after to allow it to sink in - This is for all your indepth opinions, comments, etc about the episode.\n* BBC One Live Discussion Thread - Posted around 60 minutes prior to BBC One air - for all the reactions, crack-pot theories, quoting, crazy exclamations, pictures, throwaway and other one-liners.\n\nThese will be linked as they go up. If we feel your post belongs in a (different) megathread, it'll be removed and redirected there.\n\n---\n\nWant to chat about it live with other people? Join our Discord [here](https://discord.gg/doctorwho)!\n\n---\n# What did YOU think of Empire of Death?\n\nClick [here](https://www.reddit.com/message/compose?to=PCJs_Slave_Robot&subject=DoctorWho%20Story%20Poll&message=320%20%28Empire%20of%20Death%29%3A%20) and add your score (e.g. `320 (Empire of Death): 8`, it should look like [this](https://ss.pcj.io/2018-10-14_15-55-50.png)) and hit send. Scores are designed to match the Doctor Who Magazine system; whole numbers between 1 to 10, inclusive. (0 is used to mark an episode unwatched.)\n\n**Voting opens once the episode is over to prevent vote abuse. You should get a response within a few minutes. If you do not get a confirmation response, your scores are not counted. It may take up to several hours for the bot (i.e. it crashed or is being debugged) so give it a little while. If still down, please let us know!**\n\nSee the full results of the polls so far, covering the entire main show, [here](https://www.reddit.com/r/doctorwho/wiki/poll_results).\n\nEmpire of Death's score will be revealed next Sunday. Click [here](https://www.reddit.com/message/compose?to=PCJs_Slave_Robot&subject=DoctorWho%20Story%20Poll&message=309%20%28The%20Star%20Beast%29%3A%20%20%0A310%20%28Wild%20Blue%20Yonder%29%3A%20%20%0A311%20%28The%20Giggle%29%3A%20%20%0A312%20%28The%20Church%20on%20Ruby%20Road%29%3A%20%20%0A313%20%28Space%20Babies%29%3A%20%20%0A314%20%28The%20Devil%27s%20Chord%29%3A%20%20%0A315%20%28Boom%29%3A%20%20%0A316%20%2873%20Yards%29%3A%20%0A317%20%28Dot%20and%20Bubble%29%3A%20%0A318%20%28Rogue%29%3A%20%0A319%20%28The%20Legend%20of%20Ruby%20Sunday%29%3A%20%0A320%20%28Empire%20of%20Death%29%3A%20) to vote for all of RTD2 era so far.",
        "num_comments": 408,
        "comments": [
            "So no trailer on iPlayer VOD again but worth noting last week's was released after the BBC One airing. In the meantime, feel free to use as speculation for future episodes. Also there's (apparently, we're not there yet in our Discord watch) an unleashed clip if like a hundred frames suits your fancy.",
            "Surely, *surely*, with the amount of times it was mentioned this season, this special will be about 15 meeting up with Susan again? I mean, “family coming together” is a really Christmas thing.",
            "That ending got me fucked up what do you mean neighbor 😭",
            "One thing this finale lacked in RTD fashion is having some silly segue into the Christmas special. Where's a random Bride in the TARDIS. Where's the giant space ship crashing in.\n\nThe Doctor has a Jukebox - surely at the very least it could have started playing Joy to the World on its own.",
            "Will the Christmas ep give a reason for the snow? Unlikely",
            "The Mrs. Flood mystery is killing me",
            "I really hope this episode either:\n\n1. Reveals Mrs Flood’s true identity\n\n2. The Doctor finding Susan (which i personally really want?)",
            "I maintain Flood is either the Meddling Monk, or the god of stories. I don’t get Master vibes. We’ll see!",
            "Mrs flood is Mary poppins",
            "Any chance the Christmas special will be about him finding Susan?"
        ]
    },
    "This line gets me every time S5 Ep5": {
        "title": "This line gets me every time S5 Ep5",
        "score": 653,
        "url": "https://i.redd.it/rbzughifjd9d1.png",
        "content": "",
        "num_comments": 39,
        "comments": [
            "Can't believe I didn't recognise him as Jorah Mormont until I looked it up a few months ago.",
            "Angel 2 parter is such a good story",
            "Couldn't the Doctor have someone touched by an angel from one of those episodes just pop in front of him in the new seasons?",
            "I especially like this moment because of how antagonistic their relationship was at the beginning. The Doctor had some harsh words to him about the whole Church thing, and he realized later he had badly misjudged him.\n\nI think this was his way of saying \"Yeah, I was a bit of a dick back there. Sorry about that.\"",
            "\"I will die with the knowledge that my courage did not desert me at the end\"\n\nI love that line.",
            "Sir Jorah of Friendzone was just happy for a hug.",
            "I love me some sweaty Iain Glen.",
            "Wait is that Batman?",
            "I like that you put a spoiler for a 13 year old episode",
            "Such a powerful and poignant line. 🥺"
        ]
    },
    "to set a misconception straight ...": {
        "title": "to set a misconception straight ...",
        "score": 427,
        "url": "https://www.reddit.com/r/doctorwho/comments/1dqwdes/to_set_a_misconception_straight/",
        "content": "Disney does *not* own Doctor Who. I keep seeing people say \"Now that Disney owns Doctor Who...\" and that's just not correct. \n\nDisney bought the rights to stream the series outside of the UK and Ireland. that's it. they don't own the show, and they don't have a way in what happens behind the scenes, or on the screen. it's no different from when a movie moves from Netflix to Hulu.",
        "num_comments": 116,
        "comments": [
            "I kept saying this in every thread expressing this and people not believing or listening.",
            "Well it’s certainly creating a whole new generation of little Daleks and Doctors running around my little town in Texas. Last year nobody knew what it was now there’s kids and parents wearing whovian shirts!",
            "No, Disney doesn't own Doctor Who. But it *is* different to when a movie ends up on a streamer. Because Disney+ partly funds Doctor Who. This is why they absolutely do have some (perhaps only theoretical) influence. We know for a fact that they give RTD notes that he acts on. Now, he said that the note in question (asking for the Doctor to be given a big scene earlier in *The Church on Ruby Road*) was a good note, but that does not mean that their notes are just friendly advice and that they have no sway at all. That's just not how co-productions work.\n\nSo sure, Disney doesn't now have sole rights to the show and isn't the sole producer but it's a co-producer with the rights that implies.",
            "If these people could read they'd be very upset",
            "I think you are expressing the correct idea here, but I am not sure if your post is 100% accurate.  I keep reading that Disney does indeed provide \"notes\" to Bad Wolf, meaning they do have some degree of influence on the creative process.  I do not believe the level of influence has been revealed.",
            "Yes, the Mouse doesn’t own it.  \n\nHowever, believing that they have no influence over production or the scripts is naive; with the money investment Disney is contributing, of course they have a voice in the production.",
            "No Disney doesn't own it.  However they do have a bit of input into the show.  RTD has admitted to getting \" very helpful notes\" from Disney as they are putting a considerable amount of money into the production.",
            "The direction the show has gone in may have feed into that misconception.\n\nSpace Babies as the opener.\n\nLots of magic over sci fi. (Yes I know even classic who had fantasy elements)",
            "Disney don't own the show but they do fund it now and absolutely do have creative control over it as a result. They aren't bringing in their own writers and producers into the mix, but they absolutely are signing checks which ultimately dictate certain aspects of the finished product and as a result, need to be happy with those decisions being made.",
            "Whether Disney has a direct say or not is irrelevant. BBC knows that for Doctor Who to continue it has to succeed in America. \n\nThat's why The Doctor has gone from a science nerd who's a bit odd, to an ultra trendy, good looking guy who knows all the pop culture references. \n\nThat's why it's now season 1 again and why he wears a different outfit every episode. \n\nDoctor Who may not technically be a Disney show, but it's absolutely been written to appeal to Disney audiences."
        ]
    },
    "Why Not McGann In Day of the Doctor?": {
        "title": "Why Not McGann In Day of the Doctor?",
        "score": 862,
        "url": "https://i.redd.it/2c6jcmngib9d1.jpeg",
        "content": "(I’m new to the fandom not DW itself, so forgive me if this is a point discussed often.)\n\nThat said, when Eccleston didn’t return for the 50th, why did they make a whole new incarnation, in the War Doctor, instead of using McGann’s 8th Doctor? \n\nMcGann already returned for the minisode, it would’ve maintained consistency in numbering and would’ve tied the classic, wilderness and NuWho eras together beautifully!!\n\nOnly downside I can think of is losing McGann’s regeneration which is one of my favourites. ",
        "num_comments": 194,
        "comments": [
            "Someone else could probably find a link with the exact quote but at some point after the fact Moffat said that the BBC wouldn't let mcgann be the other doctor as he wasn't a big enough name. When Moffat couldn't have Paul mcgann or Christopher Eccleston he created the war doctor.\n\nIn interviews at the time though he said he didn't believe the romantic 8th doctor would destroy galifrey.",
            "Moffat said some bullshit about the 8th being too nice but the truth is probably that someone at the BBC wanted a big name to justify the (relative) big budget they were about to spend on production, marketing and distribution.\n\nPeople may not remember, but they bought a week of YouTube front page advertising, declaring it Doctor Who week or something like that, and they sponsored videos for a lot of big channels. That alone must have been a pretty penny. So Moffat had to justify their investment by getting an actor that non-Whovians would recognize. \n\nI'm still pissed about it. John Hurt did an excelent job, obviously, but Mcgann was right there! \n\nAt least they threw us a bone with Night of the Doctor, the shout out to every 8th Companion at the time, and the announcement that they'll finally allow Big Finish to play in the Time War.",
            "BBC didn't want any of the Classic Doctors back in a significant role for the 50th anniversary special (though they made an exception for a cameo for Tom Baker, the most popular Classic Doctor). And this probably went double for Paul McGann who was the least well-known Classic Doctor among general audiences.\n\nHonestly, if Paul McGann is now much better known among the fandom, and there's a clamor for his return today, its because Moffat (re)introduced him perfectly with the 'Night of the Doctor' minisode. In general, the last decade has seen a much greater openness towards acknowledging Classic Who on the show, as seen with the returns of 80's era companions, and many of the Classic Doctors having cameos in 'The Power of the Doctor'. You can argue that it all started with Moffat bringing Paul McGann back (having also previous brought back Peter Davison).",
            "Steven Moffat had promised the BBC that the 50th anniversary would be “this year’s Olympics,” and when Christopher Eccleston declined to take part, Steven *did* suggest bringing in one of the other Doctors (presumably McGann would have been his first choice, since it just makes sense), but the BBC didn’t think that was a big-enough move for the high-profile event they were expecting.\n\nStarting at 17:40, [here’s](https://youtu.be/ZOfIIqb8Uhg?si=Sas3_YPV8vpg2yw8) Steven talking more in-depth about the chaotic development of the 50th anniversary special, and the decision to ultimately introduce a new Doctor played by John Hurt.",
            "Because he has this really horrible roommate the Shalka Doctor who is always getting him in trouble.",
            "I actually think of all the Doctors, it doesn't suit 8's personality to have fought in a war in the way that we knew the Doctor did.  He is far too well-meaning and decent.  This is why I think *Night of the Doctor* was the right approach- we see him try and fail to continue in his old ways, and recognise he was going to have to reinvent himself as a Warrior.",
            "I think McGann would have been a terrific choice. (I would have missed War Doctor though, because Hurt was tremendous.) And I an easily see the \"romantic\" making the hard choice to destroy Gallifrey, quite possibly due to the companion's death. They could have easily tweaked the setup of events on Karn. The Sisterhood revives the Doctor -- give him the bad news \"you've only got about a week, our powers have limits\" and a flask with some elixir to restart the regeneration process -- and he decides to end the war. Story goes on as normal. McGann alone in TARDIS, \"Physician heal thyself.\"",
            "If they had released the anniversary with Night of the Doctor as a cold open or in any way attached to the episode itself it would’ve been even better than it already is",
            "it's too bad the BBC dropped the ball. He acted the FUCK out of the short film he got.  I was so pleased to see him play the role again.",
            "I'll always maintain that he should have been. I love John Hurt, but creating a \"War Doctor\" because Eccleston turned down Moffat felt a bit contrived to me. And, no, the Doctor wouldn't be opposed to fighting Daleks as he does that almost annually."
        ]
    }
}