{
    "[Meta] - Why does my post not appear?": {
        "title": "[Meta] - Why does my post not appear?",
        "score": 2,
        "url": "https://www.reddit.com/r/DogAdvice/comments/1dol568/meta_why_does_my_post_not_appear/",
        "content": "Sub-reddits have various settings and tools in order to prevent spam, abuse, irrelevant posts, etc... As a result, a post may be shunted to a moderator queue for review before being made live. Depending on which setting was responsible for the post or comment being place in the queue, you may or may not get a notice that it is awaiting review.\n\nThe mod team is not here 24/7, but we will generally review all items within an 8-12 hour period (should never exceed 24 hours). \n\nPlease do not double, triple, or quadruple post. If your post has not been made live after 24 hours, please use [modmail](https://www.reddit.com/message/compose?to=r%2FDogAdvice) to request us to review the post. \n\nIf you get an automated message and delete your post as a result, we cannot see or review the post to make it live.",
        "num_comments": 1,
        "comments": [
            "Have I been banned? I can’t make comments."
        ]
    },
    "Is this healthy play?": {
        "title": "Is this healthy play?",
        "score": 154,
        "url": "https://v.redd.it/9tex633xle9d1",
        "content": "The dog is a 10mo old female and the cat is a 5 year old male. Cat is usually grumpy and likes to bite us and the dog. Sometimes she will paw him like in the video and he will meow at her and lunge at her hind legs and nip them (she acts as if she doesnt mind at all his bites). \n\nI'd like to know if my pup is actually annoying him or if I can let them continue playing.",
        "num_comments": 52,
        "comments": [
            "Don't stress. \n\nThe cat doesn't want to play, but is tolerating your pup. If it gets to the point that the cat has had enough, he will let the dog know. \n\nCats can lay down the law when they want to, and they will. They can also very easily remove themselves from the situation. I wouldn't worry - they will figure out their relationship in time.",
            "The dog is trying to get the kitty to play. Cats not understanding it as play. Guessing the cat hasn't been around dogs? The pup is being very respectful, may get wacked by the cat  and yelp then probably avoid it for a while.",
            " normal. The cat could get away in an instant if it wanted too",
            "Dog is trying to play cat is not. Let the cat correct a few times and if the pup keeps going correct yourself and separate. This is how my dogs learned to leave the cats alone unless they approach first",
            "Dog is bothering cat",
            "I think they are fine. If either wanted to harm the other they certainly had the chance to. If the cat does manage to bite the dog and break the skin, I recommend a trip to the vet. Cat bites are full of bacteria and require a good cleaning and antibiotics. \nThese two seem to be testing the boundaries but I don’t see aggression to the point where it would be dangerous.",
            "The cat does not look interested in this. It is trying to create space, rather than engaging. My dog and cat’s playing is clearly very back and forth… but this looks like the dog is being pushy and the cat is slapping it away.",
            "It looks like the same way my cat and dog play, and they get along great",
            "Dog is playing, cat is not. You can clearly see the cat pull back his ears, that’s a warning to the dog.",
            "No because it is escalating and cats hold grudges. Play should be reciprocal, and the cat wasn't ever initiating play, just protecting itself."
        ]
    },
    "My baby girl got spayed a few hours ago": {
        "title": "My baby girl got spayed a few hours ago",
        "score": 137,
        "url": "https://i.redd.it/yj2sfar9fe9d1.jpeg",
        "content": "I feel do sad for her. ",
        "num_comments": 60,
        "comments": [
            "Yay no babies! \n\nShe'll be back to normal before you know it. Hang in there.",
            "On day 2 with my girl and she’s already trying to run around and play",
            "Those medical suits are AMAZING. So much more comfy than a cone \nWe had the same one for our girl last month, actually we got 2 because we forgot to clip the back up when she went outside to wee haha 🙃🥴",
            "Felt so sad for my little girlie when she got spayed, and she ended up slipping out of her cone in the middle of the night and licking open her wound… so we had extra long recovery. She seemed herself after a few days though! Your girl will get through it and then you won’t have to deal with her being in heat :)",
            "It's hard, seeing them recovering from anaesthesia, but I promise, it's the drugs that are the worst part, not the spay itself. \n\nShe will quite likely bounce back in a day or two at the most, and then you'll just have a cute little nugget in a onesie. \n\nMy pup (labrador) had the same onesie, and within 24 hours, she was bouncing off the wall as usual. I'm sure yours will be the same! \n\nIn all seriousness, you did your dog a favour. Getting pregnant and having puppies unintentionally can be very challenging, labour and delivery can be dangerous, and you won't have a mess of puppies to contend with. \n\nYou also reduced her risk of developing a handful of different types of cancer that could have shortened her life. \n\nGive her all the love and cuddles she wants, slowly and gently, and she'll be back to herself in no time, I promise.",
            "Puppy post op straight jacket?",
            "<3 I know the feeling. I felt so much guilt post my pups surgery. But I promise it will fade and her energy will come back before you know it. Hang in there!!!",
            "trust that it's for the best! she'll come out of this great don't worry <3 sending love your way",
            "I absolutely **love** those bodysuits! They’re *so* hard to find for some reason.",
            "As a human who has been spayed, I'm in awe of the resilience of dogs. To be fair, by day 4 I was feeling pretty good too, just a bit more tired than normal. I much preferred a hysterectomy over giving birth.\n\nYour dog will do great and you are being a responsible pet owner."
        ]
    },
    "Just came back from the Vet, not sure what's going on with my pup? She won't eat, trembling and lethargic. ERVet didn't find anything?": {
        "title": "Just came back from the Vet, not sure what's going on with my pup? She won't eat, trembling and lethargic. ERVet didn't find anything?",
        "score": 405,
        "url": "https://i.redd.it/2hnjbiwj6c9d1.jpeg",
        "content": "Wondering if anyone has any possible advice, experience or input. Our 22 month our Chihuahua mix woke up not herself this morning. She lethargic, she won't move, she's trembling, panting occasionally and won't eat. She did wake up with Kennel Nose. Although she is crate trained she has been displaying signs of separation anxiety for the past few nights. Could this be anxiety related? Unsure what to do?",
        "num_comments": 130,
        "comments": [
            "Did you have the vet run all the tests they can? Super important to get xrays and bloodwork with these symptoms",
            "Did they do bloodwork? My dog had a day where she puked, I took her to the vet they did bloodwork and said she was dehydrated, try to feed rice and chicken and come back if she doesn't improve in a couple days. Next day she wasn't puking but also wasn't eating. Also did the scary dog thing of sitting off by herself (usually she is anxious and follows me). Took her to the vet they gave me anti nausea meds and said to get bloodwork again if it isn't better in a couple days. Next day she was so lethargic and shaking and still not eating I thought she was dying so took her for more bloodwork and they found out she was in an addisonian crisis (addisons disease) she needed to be hospitalized and will need meds for life, but all good now! If I hadn't kept bringing her in she would have died.\n\nThis to say that if you think something is really wrong, keep bringing her in and get bloodwork. Addison's disease is rare so it probably isn't that, but there is always the chance it's something serious!",
            "Get a second opinion, don’t wait. Another ER Vet or regular vet, today. You need xrays or ultrasound.",
            "Get X-rays done. Or stomach ultrasound. Good luck to your sweet sweet baby",
            "Definitely, go to a different Vet and insist on running more tests",
            "What tests were done? The symptoms you describe are pain and the lethargy/ weakness suggests major infection- I would want that dog on antibiotics - yes the trembling and neediness could be anxiety but the PANTING - WONT MOVE - LETHARGIC says something medical is going on",
            "Go to another vet. She could have eaten something she can’t pass or digest.  Could be anything but please go to another vet. Blood work at least. X-ray too.",
            "my dog had a blockage but it was not seen in the x-rays and they had to do an exploratory surgery to find the blockage if ur dog starts to throw up with what looks like coffee grinds in it then there is a blockage with internal bleeding",
            "If u feel her stomach, is it hard or soft like normal? \n\nMy jrt used to get like this and it was mostly gas. But she'll be fine after I help her fart. (Bicycle legs then lift up and turn her legs side to side) and she will poop or uring later. \n\nI would however suggest u visit another vet tomorrow and request for a x-ray or ultrasound. In the meantime, check her gums and make sure they are still pinkish red, if not, use a syringe to feed sugar water to keep her from becoming hypoglycemic.",
            "My dog had similar symptoms and the vet couldn't figure out what it was. They finally tested her blood and she had a tick Bourne illness. Has she been bitten by a tick recently?"
        ]
    },
    "fireworks deregulate my pitty": {
        "title": "fireworks deregulate my pitty",
        "score": 4,
        "url": "https://i.redd.it/k4w0xujz0g9d1.jpeg",
        "content": "his core shakes he vibrates he seems so scared. what do I do? we need to leave Long beach next week it will be more frequent he will not take treats",
        "num_comments": 5,
        "comments": [
            "Contact your vet and ask for medicine. Don’t settle for the recommendation of otc meds or supplements advocate for your pup. Wish I got my boy his as needed rx sooner.",
            "Lay belly up and pet him. Put on tv or sound you hear regularly (i put ocean waves for them at night. I use that during storms). By laying belly up, you're showing them theres nothin to be afraid of. My super anxious dog got over her storm fears after a few nights of me sleeping with the dogs in the living room lying on my back.",
            "what does your dog take? I have trazedone but it really dopes him :(",
            "This is beautiful",
            "Yeah sadly ours is a sedative. Your vet might know of something that doesn’t sedate, but mine gets gabapentin for storms and fireworks and it is very sedating but he’s not in the bathroom shaking. I just make sure he pees and feed him and give him a chew and his medicine and by the time he’s done with the chew he’s pretty much down. He does occasionally wake up but he won’t get off his bed for anything. Make sure you talk to your vet about side effects because even though it’s safe the first time I saw him on it was scary. It’s only really as needed, and it doesn’t seem to stress him he’s so high that he doesn’t care but he’s like falling over until it knocks him out."
        ]
    }
}