{
    "Sunday Memeday is over!": {
        "title": "Sunday Memeday is over!",
        "score": 2,
        "url": "https://www.reddit.com/r/Doom/comments/1dn5kov/sunday_memeday_is_over/",
        "content": "Flagrant shitposts are no longer allowed. Feel free to refer to [this chart](https://imgur.com/oBLkQpP) for what's allowed the rest of the week.",
        "num_comments": 0,
        "comments": []
    },
    "Is this forged? Got it on ebay for 35$": {
        "title": "Is this forged? Got it on ebay for 35$",
        "score": 771,
        "url": "https://i.redd.it/9c5a8avu1d9d1.jpeg",
        "content": "",
        "num_comments": 51,
        "comments": [
            "Could be legit. Here’s another [older post](https://www.reddit.com/r/Doom/s/spg6bbabHD) claiming his autograph and they kinda look similar, esp the DO sticking together, but I’m no expert",
            "Bro it's autographed and it's only 35$, take a wild guess",
            "judging from [this](https://x.com/Bethesda_ANZ/status/1229562073396523008), probably super fake.",
            "What did the seller say, that it was genuine? Did he have proof, like where and when he got it?",
            "mick gordon signing an… art book?\n\njk",
            "fake as fuck",
            "Who would get it signed with a marker thats lid has been off for a few days lol",
            "Yep. It's fake.",
            "Let me call in a buddy of mine who specializes in this kind of stuff",
            "I always assumed he signed his name \"Mick Fucking Gordon.\"\n\nThis is a joke, and no credence should be given to it. But if I were him, I'd sign my name Mick Fucking Gordon."
        ]
    },
    "The perfect casting doesn’t exi-": {
        "title": "The perfect casting doesn’t exi-",
        "score": 2910,
        "url": "https://www.reddit.com/gallery/1dqg5ix",
        "content": "",
        "num_comments": 125,
        "comments": [
            "Nah Alan Ritchson. Got the height and the build and can already play a character of few words.",
            "Why does \"perfect casting\" to Reddit always boil down to \"he kinda looks like the character model.\"",
            "I dont care what anybody says Karl Urban is THE DoomGuy",
            "He would be nice, but let's be real. We ain't contacting whoever owns the right to doom and proposing this idea to them.",
            "[hmmm...](https://twitter.com/savickasbigz/photo)",
            "The slayer should either be someone completely random, or they shouldn't show his face at all to make him more badass and intimidating.",
            "I WILL FIND HIM",
            "Nah, doesn't fit at all. Just because he has a similar face, I can't picture him as the Slayer. Alan Ritchson is my top pick followed by Karl Urban (he would need to get a lot of mass in order to be picked over Alan IMO)",
            "Zydrunas Savickas is better",
            "Nah, too puny."
        ]
    },
    "Now that the Dark Ages got announced there's something from Eternal that dissapointed me:": {
        "title": "Now that the Dark Ages got announced there's something from Eternal that dissapointed me:",
        "score": 223,
        "url": "https://www.reddit.com/r/Doom/comments/1dqvpkw/now_that_the_dark_ages_got_announced_theres/",
        "content": "And that's that the skins that we unlock for the different demons through those monthly/seasonal (if I'm not wrong) events only were available during PVP. You cannot fathom how much happy it would have made me playing the campaing and seeing a Mancubus dressed as a hotdog. \n\nEDIT!! What I meant in the title was 'now that the dark ages got announced I was thinking of getting back into Eternal and there's something that dissapointed me:'",
        "num_comments": 18,
        "comments": [
            "They never made them available for campaign because of all the extra work they'd have to do to get the skins to work with the gore system.",
            "That's if demon skins are even coming back, for all we know dark ages will include a traditional multiplayer if any ",
            "I was so sad. I wanted hotdog Mancubus",
            "I don't like how you had to do limited events to unlock the skins\n\njust let me earn all of them through gameplay at my own pace",
            "While it would be fun, it would suck if you had to change the skins out constantly if you wanted the default ones for the campaign and custom ones for MP. Assuming it worked like the slayer’s skin",
            "i personally hate the amount of green lights they placed everywhere. i get its going for the old arcadey vibe but idk. not a fan",
            "Good point. The destructible demons",
            "I didn't think of that and now that you say it makes sense, I don't disagree at all and I understand it. Now when I see it I'm gonna think of this and say basically 'I understand why they didn't do it but I'd give whatever it takes to have it available in the campaign'",
            "Maybe the gore system could just turn off when the skins are applied? If it's just for fun I don't mind getting rid of that mechanic for silly costumes",
            "Maybe, but I think they'll try doing something gimmicky again. Maybe a Helm's Deep styled coop holdout mode where you play as Sentinels or something."
        ]
    },
    "Doom dance? I prefer the Doom ballet recital myself": {
        "title": "Doom dance? I prefer the Doom ballet recital myself",
        "score": 620,
        "url": "https://v.redd.it/pl7qnu6v2c9d1",
        "content": "",
        "num_comments": 50,
        "comments": [
            "Why does every PC clip here always look so weird? Like its super ultra wide stretched af, makes it look so whack and blurry.",
            "How did you do all that while there was a fucking carcass in existance",
            "What runes you got",
            "Looks like something that would be usually done in ULTRAKILL honestly. But how do you increase the FOV beyond the limit?",
            "Kickass. That’s awesome",
            "Why the equipment launcher pop out half way into the screen though?",
            "Someone put the nutcracker instrumental over this",
            "You can always tell a Quake player. And this is definitely some Quake-style pwnage.",
            "#Simply beautiful.",
            "The hammer is a mod?"
        ]
    }
}