{
    "Sunday Memeday is over!": {
        "title": "Sunday Memeday is over!",
        "score": 2,
        "url": "https://www.reddit.com/r/Doom/comments/1dn5kov/sunday_memeday_is_over/",
        "content": "Flagrant shitposts are no longer allowed. Feel free to refer to [this chart](https://imgur.com/oBLkQpP) for what's allowed the rest of the week.",
        "num_comments": 0,
        "comments": []
    },
    "Fuzzyguy": {
        "title": "Fuzzyguy",
        "score": 926,
        "url": "https://www.reddit.com/gallery/1dr5qev",
        "content": "Just found out the ad last week and got the motivation to draw again (kinda) ✍️",
        "num_comments": 21,
        "comments": [
            "I love the little rabbit addition, the doom guy deserves his little friend",
            "Doomguy is the only man who can be both incredibly badass and incredibly adorable at the same time",
            "I ain't even gonna lie, that shit looks comfy, doom guy is real for nappin in that",
            "The Doom Games and the Doom Community are very different lol",
            "Now that I think about it, the argent planet it's really cold.",
            "Daisy is Back and fuggin cute",
            "The second pic is so cute lol",
            "Dude I am in fucking love ",
            "Its A little daisy ",
            "It also works as a snuggie !"
        ]
    },
    "What is your favorite level in any Doom game and why is it Kadingir Sanctum?": {
        "title": "What is your favorite level in any Doom game and why is it Kadingir Sanctum?",
        "score": 136,
        "url": "https://i.redd.it/ik8w3jkb4i9d1.jpeg",
        "content": "",
        "num_comments": 34,
        "comments": [
            "I know Doom3 is not the most popular, but the Hell of Doom3 is astonishing.",
            "That is a really good one, but I also love Mars Core from Eternal.",
            "First Hell level in modern Doom ",
            "Even simpler of Doom 64.",
            "Because this and Argent Dnur looked the closest to realistic hell after DOOM 3",
            "Go 2 it from Plutonia",
            "Cultist Base, Final Sin, Vega Core, Kadingir Sanctum, all of Doom 64, all the hell sections in Doom 3 and Inferno from Doom 1993",
            "Doom Hunter Base for me. The buildup is incredible.",
            "You typed the Foundry wrong, I forgive you though.\n\nOh any dooM game lol, my bad, then I typed Toxic Refinery wrong..",
            "Ngl UAC Atlantica is easily my favourite level in doom. The challenge, the music, the visuals are all incredible"
        ]
    },
    "Doom Eternal in a nutshell ": {
        "title": "Doom Eternal in a nutshell ",
        "score": 235,
        "url": "https://i.redd.it/l230ede1rg9d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Who are you, to decide to doom a whole specy just for electricity, bitch? Its unmaykr-ing time\n\n*winds up unmaykr before unmaykring all over urdak*",
            "You know he had to do it to 'em.",
            "Me about 2 hours ago. About to pump the Icon of Sin.",
            "\"You can't stop us\"\n\n*Enemy says*\n\n*Doom Slayer nods then starts ripping and tearing*",
            "Or, more broadly:\n\nKhan Maykr/Hayden/Hell Priest/whatever: \"You cannot do the thing\"\n\nUI: \"New objective: Do the thing\"\n\nDoomguy: *Does the thing*\n\nKhan Maykr/Hayden/Hell Priest/whatever: \"HOW DID HE DO THAT IS HE GOD\"",
            "Lmao perfect meme"
        ]
    },
    "[OC] You son of a bi-": {
        "title": "[OC] You son of a bi-",
        "score": 53,
        "url": "https://v.redd.it/uhocna16di9d1",
        "content": "",
        "num_comments": 5,
        "comments": [
            "...son of a ... rocket?",
            "And was at that moment that he knew he fucked up",
            "Just imagine if this was canon\n\n\"And then the slayer fired his rocket launcher, and fucking died....\"",
            "Lol",
            "The song?"
        ]
    }
}