{
    "The International 2024 Closed Qualifiers: Southeast Asia & Western Europe - June 22 Matches": {
        "title": "The International 2024 Closed Qualifiers: Southeast Asia & Western Europe - June 22 Matches",
        "score": 11,
        "url": "https://www.reddit.com/r/DotA2/comments/1dllvyd/the_international_2024_closed_qualifiers/",
        "content": "#[The International 2024 Closed Qualifiers](https://liquipedia.net/commons/images/f/fe/The_International_2024.jpg)\n\n\n###The International 2024: Southeast Asia Closed Qualifier\n\n\n**Coverage**: \n\n[Liquipedia](https://liquipedia.net/dota2/The_International/2024/Southeast_Asia) |\n[Joindota](https://www.joindota.com/coverages/32866-the-international-2024) |\n[GosuGamers](https://www.gosugamers.net/dota2/tournaments/60972-the-international-2024) |\n[Dotabuff](https://www.dotabuff.com/esports/leagues/16840)\n\n**Streams**:    \nEN: \n[Twitch](https://www.twitch.tv/PGL_Dota2En2) | \n[Youtube](https://www.youtube.com/pgl/live) \n   \n\nID| Team | vs | Team |  Cntdwn (SGT) | PT | EDT | GMT | CET | AEDT \n:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:\nLB3a | [Execration](/logo-execration) | vs | Team Prism | [12:00](https://www.timeanddate.com/countdown/generic?iso=20240622T1200&p0=236&font=cursive&csz=1) | 21:00 | 0:00 | 4:00 | 6:00 | 14:00\nLB3b | Bleed Esports | vs | [TNC Predator](/logo-tnc) | [15:00](https://www.timeanddate.com/countdown/generic?iso=20240622T1500&p0=122&font=cursive&csz=1) | 0:00 | 3:00 | 7:00 | 9:00 | 17:00 \nUBF | Aurora | vs | [Talon](/logo-talon) | [22:00](https://www.timeanddate.com/countdown/generic?iso=20240622T2200&p0=122&font=cursive&csz=1) | 3:00 | 6:00 | 10:00 | 12:00 | 20:00 \n\n___\n\n###The International 2024: Western Europe Closed Qualifier\n\n\n**Coverage**: \n\n[Liquipedia](https://liquipedia.net/dota2/The_International/2024/Western_Europe) |\n[Joindota](https://www.joindota.com/coverages/32866-the-international-2024) |\n[GosuGamers](https://www.gosugamers.net/dota2/tournaments/60972-the-international-2024) |\n[Dotabuff](https://www.dotabuff.com/esports/leagues/16842)\n\n**Streams**:    \nEN: \n[Twitch](https://www.twitch.tv/PGL_Dota2En2) | \n[Youtube](https://www.youtube.com/pgl/live) \n   \n\nID | Team | vs | Team | Cntdwn (CEST) | PDT | EDT | GMT | SGT | AET  \n:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:\nLB3a | [OG](/logo-og) | vs | NAVI Junior | [10:00](https://www.timeanddate.com/countdown/generic?iso=20240622T1000&p0=37&font=cursive&csz=1) | 1:00 | 4:00 | 8:00 | 16:00 | 18:00 \nLB3b | [Team Secret](/logo-secret) | vs | PSG Quest | [13:00](https://www.timeanddate.com/countdown/generic?iso=20240622T1300&p0=37&font=cursive&csz=1) | 4:00 | 7:00 | 11:00 | 19:00 | 21:00 \nUBF | [Tundra Esports](/logo-tundra) | vs | [Entity](/logo-entity) | [16:00](https://www.timeanddate.com/countdown/generic?iso=20240622T1600&p0=37&font=cursive&csz=1) | 7:00 | 10:00 | 14:00 | 22:00 | 0:00 \n\n___\n\n\nCountdown times are in local time. All times are subject to change based on the length of matches and delays.  \nOther match discussions: [/r/dota2 on Discord](https://discord.com/invite/rdota2)",
        "num_comments": 749,
        "comments": [
            "\"Honey, what should we name him? I was thinking maybe Sebastien Jr?\"    \n\n\"No.\"    \n\n\"He will be named Navi Jr.\"",
            "This Navi Jr team has an average age of 17 years old. The rest of WEU teams are over 22 years old average.",
            "This TI already won't have OG, SR, Nigma, AR, BLR, VP, and probably wont have Secret. Wow, what a change of pro scene landscape in last 2 years.",
            "Looks like Ceb gave motivational speech in the hospital, his wife did a birth speedrun and now he can play (bonus: twitter drama for day).\n\nTruly Winston Wolf of Dota with the difference that he also creates problems that he needs to solve afterwards: so - superior.",
            "I didn't want to call out BZM for throwing on purpose, but it's starting to look really fuckin' bad. 6 unforced deaths this game.",
            "Talon squad Filipino, malaysian and indonesian the true SEA toxicity squad to Ti.",
            "I just want to say Niku is only 15 years old and looks pretty dang good.",
            "Good guy OG gets eliminated so that Ceb can spend time with his family.",
            "Can't believe we might just see TNC again at TI lol",
            "NaVi should just promote this team to main roster even if they don't make it. They're clearly better than the current main roster."
        ]
    },
    "OG Denied request to use standin for TI quals. ": {
        "title": "OG Denied request to use standin for TI quals. ",
        "score": 479,
        "url": "https://i.redd.it/iaccyskge28d1.png",
        "content": "",
        "num_comments": 120,
        "comments": [
            "This is some pretty important context that was missing from the other threads.",
            "OG \"go one season without causing drama over rules\" challenge",
            "Can someone explain to me why the issue with a standin is so controversial? Fresh to the pro scene of dotes. Was there a big controversy before wuth teams changing rosters mid tourneys?",
            "I mean Boom changed 1 or 2 players and they were forced to play open quals despite being 2nd or 3rd best team in SA.\n\nOG could have done the same..",
            "yeah its for CLOSED QUALIFIER  \nif they change the roster ,they have to play OPEN QUALIFIER",
            "I wonder if this is because the request for a standin was after the roster locks? DOTA 2 tourny + drama + og, name a more iconic trio.",
            "Feel like this sort of thing has been an issue in esports for years. There’s always going to be sickness, visa issues and family emergencies. Unless teams are going to start keeping reserves on the payroll, can’t they relax the stand-in rules across the board? Is the concern that teams are gaining an advantage by playing with a stand-in?",
            "Ceb in the lobby, all this OG drama for nothing",
            "So OG should make a new team without their captain 1 month before TI qualifiers because that person “may” miss 1 or 2 games because he is about to become a dad? Wow! Most fair rules ever",
            "I would suggest the poster review the title more carefully to 'OG claimed to be denied the request to use standin'."
        ]
    },
    "Sneyking's Full Statement on PGL's Decision About OG": {
        "title": "Sneyking's Full Statement on PGL's Decision About OG",
        "score": 629,
        "url": "https://www.reddit.com/r/DotA2/comments/1dlmvta/sneykings_full_statement_on_pgls_decision_about_og/",
        "content": "The situation between \n@OGesports\n and \n@pglesports\n where OG is presented a disqualification from the \n@dota2ti\n quals if \n@Ceb\n is not able to play tomorrow is justified and should not be changed. \n\nOG sees that the rules do not allow for stand-ins for this tournament and understands that there is a chance that Ceb's wife will be giving birth during this tournament which would create a scheduling conflict. In which, they had asked the tournament organizer beforehand for an exception for Ceb's special case in case of his absence. In which PGL responded with an One Day Stand In exception for the team. You can argue whether this was sufficient or not for this special case as probably more stand in time should be allowed. However, no other team competing in this tournament has had this exception made for them as far as I know. \n\nChoices were given in advance for OG to play with a stand-in in Open Qualifiers or take a chance with Ceb for the Closed Qualifiers. OG has to own up to their OWN decision on bearing the consequences as OG fully understands the gravity of the situation and decided to compete with Ceb as a part of its 5 man roster anyways. \n\nFast forward to now, that this foreseen possible scenario has come to be with the birthing of the child in conflict with the competition. In which I want to congratulate Ceb for his child and commend him for prioritizing this special moment over playing the qualifier. However, OG is only now publicly voicing the problem of the inflexible rules of the stand-in situation after the fact. \n\nWhile I do agree that the rules do not allow for stand-ins is silly as emergencies do happen and stand ins should be allowed in the event of an emergency. However, the time to change such said rule is not now. It should be done before the tournament has started or after the tournament has concluded for the competitive integrity of the tournament. If rules are allowed to be changed in the middle of the tournament at the whimsical of a team's wishes, what would be the point of having rules? As all teams and players should play on equal footing and be treated the same. That is what gives meaning to competition. \n\nI would applaud OG if they were to stand up for this problem before or after the tournament. But the fact that only now OG is publicly bringing up this issue while facing the possibility of being disqualified by PGL is an attempt to strongarm and pressure PGL with its vast fan base into complying to the wishes of OG and allowing further exceptions to be made for the team. Competitive integrity should not be compromised for a team that has already been granted unfair leniency due to the given circumstance. \n\nIn the future, I hope that tournament organizers who do not allow for stand ins to change their rules to be more lenient so that these extraordinary circumstances can be covered.\n\n---\n\nSource: [Sneyking X](https://x.com/SneykingGaming/status/1804357316550234470)",
        "num_comments": 357,
        "comments": [
            "OG should be disqualified and the rule should be changed for next year, it's that simple, isn't it?",
            "Ceb should be dqed for putting nigma in lower bracket. it's all cebs fault my king's got eliminated",
            "I think that the rulebook for these situations is downright stupid and close to inhuman.\n\nI also think they should have raised this concern publicly before, because obviously PGL is too fucking stupid to change the rulebook when they were approached about this months ago.",
            "the rules are dumb but changing the rules mid tournament is smh",
            "I mean, ceb had sex on september. Most dota players never had sex at all. He should pay.",
            "“an attempt to strongarm and pressure PGL with its vast fan base into complying to the wishes of OG and allowing further exceptions to be made for the team”\n\nThat is exactly what they are trying to do. Thanks Sneyking for saying it outloud. Really shameful for such a big team to mobilize their rabid fanbase like this.",
            "Only 1 TI after all",
            "Agreed. Absolutely do not like how OG always try to sic their fan base onto organisers or other teams when the rules don’t favour them.",
            "Good statement.\n\nCeb should take control and give birth himself so he can play in the qualifiers.",
            "I don't agree with Sneyking that this is OG's fault for not speaking up now. Namely because it's not an easily foreseen circumstance that the wife of one of your players will go into labour during the competition. Why does he characterise it as an OG powerplay when he agrees that it's not a good rule fundamentally? Is the onus not on each team to have failed to give critical feedback on this rule beforehand?"
        ]
    },
    "The Ceb drama shouldn’t even be drama": {
        "title": "The Ceb drama shouldn’t even be drama",
        "score": 234,
        "url": "https://www.reddit.com/r/DotA2/comments/1dlr0gq/the_ceb_drama_shouldnt_even_be_drama/",
        "content": "The fact that people are more offended by Ceb going to the birth of their child is a serious indicator of the nature of the current state of (some parts) of the community.\n\nIt’s hardly a shock to opposition that he’s returning to the team. And the fact people are saying he shouldn’t have gone to the birth of his child is insane. This game is not the number one priority, it is a GAME.. it’s honestly been so gross to watch people dismiss his wife and child so much.",
        "num_comments": 127,
        "comments": [
            "Almost everyone here agree that there should be some provision in the rules regarding substitutions and there is precedence from other esports on that.\n\nBut these are things bigger teams should come together and demand from the TO before the tournament starts, and in this manner will actually help smaller teams as well.\n\nThe way things stand smaller teams always get's screwed by strict interpretation of rules while bigger teams stay silent till something affects them because they know they can get away with things by creating enough outrage when the time comes. This is definitely something that needs to change.",
            "You can´t say it´s a game for him, it´s basically his day job - playing tournaments. But then again when you are about to become a father your boss doesn´t force you to come to work and there are always workarounds.\n\nAnyway, i agree with you. But mostly my thoughts go to Ceb, been reading (not sure if true as i didnt´t fallowed the news) he had issues before with his now wife because of him being away on tournaments and too involved. He definitely doesn´t need the stress all this drama generates, guy is going through one of the best moments in his life, should be allowed to do this peacefully.",
            "The fact that this bs is \"drama\"... To be fair I remember a similar situation with a football player (I think Liverpool, I remember Jürgen Klopp was the coach) where the player missed some quarterfinals or something. It was made into drama too ...",
            "Waiting for Ceb tweet",
            "[Check how this basketball coach reacted to similar question. ](https://youtu.be/G0a-Nr_vRjM?si=Ksw_owWfTXm3ULyi)",
            "I mean I think the sub rules should absolutely be changed, however OG has a long history of weaponizing their fanbase whenever a decision goes against them. And they don't act all high and mighty and morally superior when a shitty decision goes in their favor, which literally happened this year.",
            "Well the OG org is the one who made it a drama. It's because they want the dota 2 community talking about it that we're talking about it. \n\n\nI'll say that they have good reason to bring their situation to light because the rules are indeed silly, so hopefully it gets changed for future qualifiers. However, no one is at fault here. Things just turned out to not be in the favour of Ceb. Besides, it's the rest of the team that's more affected by this than Ceb himself. Dude's about to be a father and he's already won 2 TIs. ",
            "nah bro rules are there for a reason..ceb should 100% be there with his wife n child but life is not easy n fair and they already let them have a unregistered standin what more can u ask for?",
            "the worst take ive seen from people here was theyre blaming CEB for not planning for the qualifiers.\n\nIm actually baffled that people would say this but im not surprised considering majority of the people crying about it havent touched let alone talked to women",
            "Is it really a thing ? So far I have mostly saw people going about OG knowing there was a risk Ceb could not play but still registering with him.\n\nI didn't scour the entirety of reddit but I didn't see people complaining about Ceb being absent for child reasons.\n\nStrawman for karma"
        ]
    },
    "When you gotta deal with your baby, PGL, and reddit crying together": {
        "title": "When you gotta deal with your baby, PGL, and reddit crying together",
        "score": 123,
        "url": "https://i.redd.it/2ttheydb438d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "We slay together, we lose together, we raise Ceb's kid together. . .",
            "Nobody has to ever deal with \"reddit crying\" unless they were a narcissist",
            "And Sneyking. And his other 'kids' i.e. the 4 other on his team. Ceb gonna grow those white hairs fast",
            "People expecting him to roll in like [Scorcher](https://www.youtube.com/watch?v=qIeTw7dX8bE)",
            "Well OG is the 2x  back to back pee in your eyes wiener but when your time can't perform you need to create drama to keep the hype going and i almost forgot time to rewatch the true sight.",
            "don't start cheap drama, and you don't have to deal with any of this. Navi Jr. stomps them soon enough, they'll cry some more like spoiled brats, but it will be forgotten really fast.",
            "and then lost the series anyways.",
            "Trash player from a trash team",
            "Timado: Make Ceb's baby together.",
            "You almost forgot? Damn bro step it up, a real OG fan wakes up to it 😔"
        ]
    }
}