{
    "Dragon's Dogma 2 - Pawn Hiring Post": {
        "title": "Dragon's Dogma 2 - Pawn Hiring Post",
        "score": 379,
        "url": "https://www.reddit.com/r/DragonsDogma/comments/1blwszg/dragons_dogma_2_pawn_hiring_post/",
        "content": "Arisen!\n\nPlease use this thread to accost fellow Arisen to hire your Pawn, OR to make requests about what kind of pawns you're looking to hire. As a reminder, pawn hiring is **NOT CROSS PLATFORM.**\n\n[Pawn hiring can also be found over at the Dragon's Dogma Central discord!](https://discord.gg/eZ5UMv8qZQ)\n\nBe sure to include your **PAWN ID, LEVEL,** and **PLATFORM**. Feel free to have a screenshot of your pawn and any additional information such as what pawn quest you're assigning.\n\n**EXAMPLE POST:**\n\n&#x200B;\n\nhttps://preview.redd.it/pu8infhi94qc1.jpg?width=300&format=pjpg&auto=webp&s=e420eaab0ba508d46b4cdcdd2e80e190d099da9a\n\nMy pawn Rook is looking to complete his Cyclops badge!\n\nPLATFORM: Steam\n\nLEVEL: 15\n\nPAWN ID: ABCDFW1342",
        "num_comments": 3378,
        "comments": [
            "this post is a breeding ground for Bugcatchers and Giftgivers",
            "Note if you are after one speaking elvish only way to get one is offline mode. Players have not figured out how to get the spec yet so random generated pawns are your best bet.",
            "Whos got the big butt pawns for hire",
            "Hello everyone, would appreciate if you hire my Archer Pawn, just send me your ID and I'll hire your pawn as well. \n\nPlatform: Steam",
            "Does anyone have a he-man warrior pawn for hire?",
            "PSN friend is fine by me.",
            "Anyones pawn on Xbox a straight Elf in elven attire?  Pure RP?  Just looking for a good Elf in my party!  Dm me your gamertag if you do!",
            "Holy shit thats the most intense Pawn iv ever seen",
            "Man I wish you were on PS but I hope you get lots of summons. Shes awesome.",
            "Delicious in Dungeon is great...does she know explosion magic?"
        ]
    },
    "PC performance megathread": {
        "title": "PC performance megathread",
        "score": 329,
        "url": "https://www.reddit.com/r/DragonsDogma/comments/1bl4jkv/pc_performance_megathread/",
        "content": "Drop your complaints or tips and tricks to improve performance below. ",
        "num_comments": 1670,
        "comments": [
            "How are you guys even playing this game? I tried every trick under the sun and it's painful to not be able to aim properly the moment the game summons like more than 4 guys\n\nMy computer is 3.5 years old but I've never struggled with any game until now",
            "Turn up shader cache to unlimited in Nvidia control panel. This gave me some serious boosts. Don't set shadows to maximum. I've heard that you can set priority to high in task manager but I didn't personally notice any gains.\n\nI710700k, 3080 FE",
            "There is a fuzzy, pixelated grain framing my character\n Total noob, anyone experienced the same?",
            "Don't bother posting your fps / experience until you get to vernworth. Makes doing quests in that city a chore.",
            "Anyone know why the performance inside of caves is such dog-ass? The game seems like its not properly culling the geometry outside of the cave. I have worse performance in the goblin cave than I did in the capital",
            "Those of you crashing on startup and in custscenes, DELETE ALL DLC .Pak files in local files.",
            "Performance is jittery mess. My crashing was fixed with AMD driver it seems, but the jitter is nauseating.\n\nThat aside, any m+kb users here that have a fix for the horrid mouse acceleration/wierd deadzone going on? It's nearly unplayable for me.",
            "Did the new patch made things worse for anyone beside me? I i talk to vendors sometimes it drops to fucking 6 fps and where i had like 100+ now i have something like 50",
            "Ever since the first patch, opening my Inventory or going into a Buy or Sell menu for a shopkeeper causes my framerate to plummet to 30's with noticeable input lag. There's a huge delay before the menus display too where the NPC's animations freeze before the menu shows.\n\nIt never did this before Patch 1. Anyone else?",
            "I accepted my fate and capped it at 30 fps since I only have an RX 6600"
        ]
    },
    "Savan sketch": {
        "title": "Savan sketch",
        "score": 55,
        "url": "https://i.redd.it/lmo0daryxh9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "I wouldve liked the anime about Savan lmao instead of what we got",
            "DANG!! I love this, are you on ig, I'd love to drop a follow!",
            "Lol I might actually consider that",
            "I assume you are talking about the netflix one. Sadly, yes...  wished Savan had his own anime or show that tells about the events in the first game. Would have been so cool",
            "Yeah Ethan isnt even that bad of a protagonist, its just everything else in the anime thats pretty ass. Ill always say that the first episode showing his normal life be ripped away from him, ending with Hanna the pawn was just the perfect opening to a Dragons Dogma story",
            "Nice! Now shirtless",
            "John Dogma.",
            "Thankk youu!!  ah yes i do use IG if you like to follow here is the link:\n\nhttps://www.instagram.com/idrawat_i_like?igsh=M3kydTdxaGlsenV5"
        ]
    },
    "Can someone help me": {
        "title": "Can someone help me",
        "score": 381,
        "url": "https://v.redd.it/iv99lb7tfd9d1",
        "content": "",
        "num_comments": 43,
        "comments": [
            "Maybe stop dropping the psychedelics before playing the game",
            "Holy shit, someone's using a Sandevistan",
            "New splatoon looking great! ",
            "If it happens in other games try DDU maybe its a driver issue. If that didnt help maybe GPU is dying.",
            "Mods, turn his game into the Amazon forest.",
            "You need to disable 80s music video mode in the display options.",
            "Let's hope is not the GPU dying.",
            "Oh man you got the Splatoon edition, I wanted that one.",
            "Either you've dealt damage to your PC or you've fucked with the code a bit too much",
            "your arisen has been blighted, but dont worry as you actually were just taking crack in the gaol cells"
        ]
    },
    "Everyone is black": {
        "title": "Everyone is black",
        "score": 37,
        "url": "https://www.reddit.com/r/DragonsDogma/comments/1dr6aqz/everyone_is_black/",
        "content": "Every single character's skin (even me and all pawns) just suddenly turned completely pitch black. Like a void of nothingness with only eyes, hair amd tattoos still visible under the clothes.\n\nWhat am I supposed to do about this, I've tried a few thing and the only thing that helped was opening a rift and even then it only fixed me for like 10 seconds.\n\nI'm on ps5 btw.\n\nThanks.\n\n(Edit: it fixed by just restarting a few times, at this point this is just a racism joke.)",
        "num_comments": 12,
        "comments": [
            "I expected so much worse from this post \n\nSorry to hear, hope you get it fixed.",
            "Ok so the fix was just to quit out twice, turn the game off and pray.\n\nThe good ol turn it off and back on again, tho it's weird it didn't work the first time I tried it",
            "Try not seeing Race, Bigot.\n\nThe Hellish Voidspawn are people too.",
            "Uninstall and Re-install if restarting doesnt work.",
            "If you wear a pointy white hood it might fix it",
            "They're not like you and me, which means they must be evil.",
            "Sound the drums of war!!",
            "They're different then us. Which means they can't be trusted.",
            "SAVAGES!\n\nSAVAGES!\n\nBARELY EVEN HUMAN!",
            "SAVAGES\n\nSAVAGES\n\nKILLERS AT THE CORE!!"
        ]
    }
}