{
    "Dragon Age: The Veil Guard First Trailer (Fall 2024)": {
        "title": "Dragon Age: The Veil Guard First Trailer (Fall 2024)",
        "score": 3716,
        "url": "https://www.youtube.com/watch?v=4F3N4Lxw4_Y&pp=ygUKZHJhZ29uIGFnZQ%3D%3D",
        "content": "",
        "num_comments": 3854,
        "comments": [
            "Scout Harding as a companion , everyone pretty much assumed so after DAI but I’m happy to see it. I’ll hold any opinions I have until we see some gameplay",
            "https://preview.redd.it/vsvyk2s28l5d1.png?width=1248&format=png&auto=webp&s=14cb57ee773b0f03dec466f1195adbb4152b4652\n\nMy honest reaction",
            "Solas... do what must be done.",
            "Really don't know how I feel about the change in art style",
            "I really hope that was just a badly misjudged trailer, and the real tone is going to be more \"epic fantasy\" than \"hero shooter quips\".\n\nedit: can't say I'm filled with confidence by how the replies seem evenly split between \"of course they'd never do that, silly\" and \"they've always done that, silly\".",
            "Guardians Of The Galaxy: Veilguard",
            "EA sure is brazenly confident with how they shoot themselves in the foot.",
            "I really dont like the music choice, kinda ruins the more serious undertone the game should have imo :D",
            "I'll maybe get used to it but I hate the what they've done with he art style of the series",
            "Vibes are off??? I don't hate it, but it doesn't feel like DA. THAT SAID, I'll withhold judgment because this is largely a marketing move, I doubt that this is a full reflection of the game's tone.\n\nI'll have to get used to the visual style."
        ]
    },
    "Dragon Age: The Veilguard | News and Discussion Threads list  ": {
        "title": "Dragon Age: The Veilguard | News and Discussion Threads list  ",
        "score": 374,
        "url": "https://www.reddit.com/r/dragonage/comments/1dhmr1b/dragon_age_the_veilguard_news_and_discussion/",
        "content": "# DA: V Release promotions\n\n|JUNE 9, 2024|[Dragon Age: The Veilguard Companion Reveal Trailer](https://www.youtube.com/watch?v=4F3N4Lxw4_Y)|[Discussion Thread](https://www.reddit.com/r/dragonage/comments/1dbysu0/dragon_age_the_veil_guard_first_trailer_fall_2024/)|\n|:-|:-|:-|\n|JUNE 11, 2024|[**Journal #1 – Introducing The Veilguard (via BioWare Blog)**](https://blog.bioware.com/2024/06/11/journal-1-introducing-the-veilguard/)|[Discussion Thread](https://www.reddit.com/r/dragonage/comments/1ddhhaw/journal_1_blog_post/)|\n|JUNE 11, 2024|[**Dragon Age: The Veilguard Official gameplay reveal**](https://www.youtube.com/watch?v=CTNwHShylIg)|[Discussion Thread](https://www.reddit.com/r/dragonage/comments/1ddi1lb/dragon_age_the_veilguard_preview_thread/)|\n|JUNE 14, 2024|[**DA: The Veilguard: Discord Q&A with Developers (via Ghil Dirthalen)**](https://www.youtube.com/watch?v=mAuTF3Cs0dQ)|[Transcript Thread by DragonEffected](https://new.reddit.com/r/dragonage/comments/1dfucan/dragon_age_the_veil_guard_bioware_qa/)|\n|JUNE 18, 2024|[**GameInformer Cover issue**](https://gameinformer.mydigitalpublication.com/?m=10122&i=824318&p=1&ver=html5)|[Discussion Thread ](https://www.reddit.com/r/dragonage/comments/1diw9mv)|\n|JUNE 18,, 2024|[**GameInformer:  A Deep Dive Into Dragon Age: The Veilguard’s Combat, Abilities, Skill Tree, And More**](https://www.gameinformer.com/exclusive/2024/06/18/a-deep-dive-into-dragon-age-the-veilguards-combat-abilities-skill-tree-and)|[Discussion Thread](https://www.reddit.com/r/dragonage/comments/1dj3nnn/skill_trees_from_the_article/)|\n|JUNE 21, 2024|[**Discord mini Q&A with John Epler and Corinne Busche (BioWare Discord)**](https://discord.com/channels/1234565251513585736/1245247340827250739/1253765962142978120)|[Discussion Thread](https://www.reddit.com/r/dragonage/comments/1dlb6f2/discord_qa_62124/)|\n|JUNE 25, 2024|[**GameInformer Breaking Down Dragon Age: The Veilguard’s Classes And Factions** ](https://www.gameinformer.com/exclusive/2024/06/25/breaking-down-dragon-age-the-veilguards-classes-and-factions)|[Discussion thread](https://www.reddit.com/r/dragonage/comments/1doeobw/summary_of_info_from_game_informer_article/)|\n\n# DA:V Developer Interviews\n\n|JUNE 11, 2024|[**IGN Corinne Busch Interview: \"The Veilguard Romance Details Revealed\"**](https://www.ign.com/articles/dragon-age-the-veilguard-confirmed-to-let-you-romance-any-companion-you-want-will-include-nudity-it-gets-pretty-spicy)|[Discussion Thread](https://www.reddit.com/r/dragonage/comments/1ddh6kd/dragon_age_the_veilguard_romance_details_revealed/)|\n|:-|:-|:-|\n|JUNE 11, 2024|[**IGN**  BioWare Details How Previous Choices Will be Imported...](https://www.ign.com/articles/dragon-age-the-veilguard-will-allow-you-to-import-your-choices-from-previous-games-through-the-character-creator)|[Discussion Thread](https://www.reddit.com/r/dragonage/comments/1ddheb0/bioware_details_how_previous_choices_will_be/)|\n|JUNE 11, 2024|[\\***PCGamesn** Veilguard is \"just as grim\" as its predecessors, Bioware says](https://ibb.co/PttX892)|[Discussion Thread](https://www.reddit.com/r/dragonage/comments/1ddhjwl/dragon_age_the_veilguard_is_just_as_grim_as_its/)|\n|JUNE 11, 2024|[**GamesRadar** Diving into Dragon Age: The Veilguard gameplay with creative director John Epler](https://www.gamesradar.com/games/rpg/i-saw-dragon-age-the-veilguard-up-close-and-spoke-to-bioware-here-are-the-5-coolest-details-including-the-best-character-creator-the-studios-ever-put-in-an-rpg/)|[CC Thread](https://www.reddit.com/r/dragonage/comments/1dec9n4/character_customization/) / [Factions Thread](https://www.reddit.com/r/dragonage/comments/1dap8vu/spoilers_all_possible_seven_factions_of_dragon/)|\n|JUNE 13, 2024|[**RPGsite** Veilguard’s director talks RPG systems, skill trees, and being inspired by Final Fantasy XII](https://www.rpgsite.net/interview/15952-dragon-age-the-veilguards-director-talks-rpg-systems-skill-trees-being-inspired-by-final-fantasy-xii)|[Discussion Thread](https://www.reddit.com/r/dragonage/comments/1ddg4gn/dragon_age_the_veilguard_official_gameplay_reveal/)|\n\n\\*^(PCgamesn) ^(gets) ^(a) ^(screenshot) ^(and) ^(not) ^(a) ^(direct) ^(link) ^(to) ^(the) ^(article) ^(for) ^(attempting) ^(to) ^(piecemeal) ^(a) ^(single) ^(interview) ^(into) ^(20) ^(different) ^(low) ^(effort) ^(articles)\n\n# DA:V Early reviews collection\n\n|JUNE 11|[ CNET - I saw the first hour of Dragon Age: The Veilguard and we've got a lot to be excited about](https://www.cnet.com/tech/gaming/i-saw-the-first-hour-of-dragon-age-the-veilguard-and-im-excited/)|\n|:-|:-|\n|JUNE 11|[**CGMagazine** -  Dragon Age: The Veilguard Preview – A World Worth Saving](https://www.cgmagonline.com/articles/previews/dragon-age-the-veilguard-sgf/)|\n|JUNE 11|[**PC Gamer** - With Veilguard, Dragon Age becomes what it was probably always destined to be: A Mass Effect game ](https://www.pcgamer.com/games/dragon-age/with-veilguard-dragon-age-becomes-what-it-was-probably-always-destined-to-be-a-mass-effect-game/)|\n|JUNE 11|[**Digital Trends** - I saw the first hour of Dragon Age: The Veilguard and it was action-packed](https://www.digitaltrends.com/gaming/dragon-age-the-veilguard-preview/)|\n|JUNE 11|[**Eurogamer**- Whisper it, but Dragon Age: The Veilguard has me thinking the unthinkable: it looks like BioWare is back](https://www.eurogamer.net/whisper-it-but-dragon-age-the-veilguard-has-me-thinking-the-unthinkable-it-looks-like-bioware-is-back)|\n|JUNE 12|[**Screen Rant**: Dragon Age: The Veilguard Preview: I'm Worried, But Maybe That's The Inquisition Talking](https://screenrant.com/dragon-age-veilguard-preview-sgf-2024/)|\n|JUNE 13|[**IGN** -Dragon Age: The Veilguard: The First Preview](https://www.ign.com/articles/dragon-age-the-veilguard-the-first-preview)|\n|JUNE 14|[**GAMINGTREND** - I saw the first hour of Dragon Age: The Veilguard and we’ve got a lot to be excited about](https://gamingtrend.com/feature/previews/i-saw-the-first-hour-of-dragon-age-the-veilguard-and-weve-got-a-lot-to-be-excited-about/)|\n\n# Game Information\n\n|Release Date|(Fall 2024)  Currently UNKNOWN|\n|:-|:-|\n|Platforms|PC,  Xbox Series X, Playstation 5|\n|Genre|Action-RPG|\n|Has Multiplayer mode?|No|\n|Has Microtransactions?|No|\n|World State Management|In-game (No DA Keep)|\n|System Requirements|Currently UNKNOWN|",
        "num_comments": 100,
        "comments": [
            "Great hub, thanks!",
            "Great info dump! \n\nYou should, maybe, clarify save import. Maybe rename it to something like \"custom world state\".\n\nBecause many can assume that in-game means we get to import our save, like between DA2 and DAO, where save transfer will not be a thing.",
            "I hope we don't have the release date yet because EA wants to pick up the good selling window for DAV. It would suck to get released on the same date as call of duty or assassins creed.",
            "I just find it bizarre how we haven’t had a solid release date yet",
            "Did no one ask what the PC system requirements for this game will be?",
            "I like your style mod! Great organization, thank you",
            "i hope they add swimming.",
            "What's the next thing after the GameInformer article?",
            "I'm (38f) not a gamer.  The only games I've played have been lego games, animal crossing, a couple assassin's creed games, & dragon age 2. Well I bought the Harry Potter game and have played for about 8 hours because I start to get sick after 15-20 minutes. I get really nauseated playing video games, especially all the newer ones. I really want to get this because I loved dragon age 2 so much. But I'm worried I'll be spending another $80ish, just to pay a few minutes here and there.",
            "Any news about companion having their own HP bar? Or are they invincible."
        ]
    },
    "Wish she was a DA:V companion. ": {
        "title": "Wish she was a DA:V companion. ",
        "score": 342,
        "url": "https://i.redd.it/jymiwkfzce9d1.jpeg",
        "content": "I know most people disliked DA Absolution, but I found Qwydion to be really charming. It was a longshot, but I would've preferred her as a companion/romance option with her goofy humor. ",
        "num_comments": 128,
        "comments": [
            "I expected someone from Absolution to be a companion, and she seemed the most likely, so I was a bit surprised. I do wonder if we'll run into her at some point.",
            "I loved absolution, and I loved Qwydion, not because it's Ashley birch, no, not because it's Tiny Tina, no, of course not don't be silly.",
            "I thought i heard that Absolution wasn't considered as canon to the games.",
            "To be honest, I watched Absolution only for Roland and Lacklon. It’s not that bad but I expected better.",
            "Qwydion would’ve been a peak companion and probably a really *really* good romance\n\nI mean who doesn’t want just a taller horned version of basically an actual fantasy tiny tina??",
            "I was definitely the person going around saying that despite DA:Absolution’s faults, that Qwydion was DEFINITELY going to be a companion in the next game. Like vehemently defending that take… Boy howdy do I feel pretty silly now.",
            "People disliked absolution? I liked it, I didn’t think it was amazing or anything but I did enjoy it.",
            "I would of taken mage qunari or rogue.\n\n\nBut nooo looks like we got another warrior  qunari. Hopefully she's plays better then always down Iron Bull from DAI and I have no starting specialization Sten unlike all the other warriors in origins ",
            "I was amazed she wasn't a companion. So weird not to include her",
            "I feel like she was planned to be a companion, but with Absolution's ending, she'll probably be a cameo or we'll help her with their quest. (Trying to be vague in case people haven't seen it.)"
        ]
    },
    "Companion dynamic changes": {
        "title": "Companion dynamic changes",
        "score": 652,
        "url": "https://www.reddit.com/gallery/1dqpsed",
        "content": "I’ve seen Neve rock two hairstyles(her hair tied up and her hair let down), like will they just change it up from time to time since apparently they have some new hair strand based tech so imagine if companions dynamically change it up once in a while like in and out of combat, that’d be so cool, imagine Bellara with her hair down😳\n",
        "num_comments": 136,
        "comments": [
            "OK, I would really like to know just how few people here know what a Fascinator is.\n\nBut yes, the down time outfits are a bit different.",
            "I love how she has her nails painted.. I would love if we got that option in CC 🥺",
            "The second screengrab looks like she is voguing the veil down\n\n![gif](giphy|8YsZ6BGh4Ysu9PxYmq|downsized)",
            "If she doesn't wear her stupid hat 24/7, is she truly the next fashion icon?",
            "All I see is, buttons undone, buttoned up. 😆",
            "I'm true to Harding! I'm true to Harding...  Am I true to Harding?",
            "Dynamic outfits for characters is something I thought would be in every game when I played Prince of Persia Sands of time in 2003.\n\nSadly extremely rarely seen since.",
            "It's gonna be hard to choose who to romance :((",
            "Basically how they should’ve handled Ashley in ME3\n\nCombat bun but she can let it down on the Normandy. Thanks, mods!",
            "I’m pretty sure it’s just the same way a lot of games do it, where a character’s hair changes when they wear a hat."
        ]
    },
    "I know pre-orders are a touchy subject, but anyone else kinda surprised pre-orders are not available yet?": {
        "title": "I know pre-orders are a touchy subject, but anyone else kinda surprised pre-orders are not available yet?",
        "score": 256,
        "url": "https://www.reddit.com/r/dragonage/comments/1dquz36/i_know_preorders_are_a_touchy_subject_but_anyone/",
        "content": "I mean, a lot of the games that are confirmed for Fall have pre-orders up. I feel like they don't show off gameplay now. Without intending to have a full summer to promote it's fall release. I don't know maybe I'm just impatient. ",
        "num_comments": 213,
        "comments": [
            "https://preview.redd.it/60nzvqt51e9d1.jpeg?width=320&format=pjpg&auto=webp&s=73069575e8929ca4429c6482a906804fd7eac208\n\nChecking the Steam page since the trailer dropped like wen?",
            "For real I just want to know what's going to be in the collectors edition. Really hope they include an artbook because the concept art for this game/series has been really stunning.",
            "We'll get a preorder with the release date announcement. Hopefully next week?",
            "probably sometime in July",
            "There’s an EA investors Call on July 30th and there’s also gamescom on August. I suppose to they reveal the release date around that time and pre-orders too",
            "Why would we get pre orders when there’s no release date?",
            "Don't they usually wait until there is a date? I know I wouldn't pre-order before I had a date, and I've done loads of pre-orders.",
            "Preorders will open after the release date is announced. They’re also probably making sure everything is in order on the manufacturing side of things for physical and collector’s editions. Larian has had a time of it with delays of their physical editions. I still haven’t received mine. ",
            "I will buy the game a few days after launch just to give the reviews and first impressions a good look.",
            "While it is surprising I’m not upset or anything about it tbh. The amount failed launches of games there have been in the past few years has put me off of pre ordering unless I trust the game will be complete on release. Heck I pre ordered Anthem when it came out and that was not a great decision."
        ]
    }
}