{
    "We are now on Pinterest": {
        "title": "We are now on Pinterest",
        "score": 69,
        "url": "https://www.reddit.com/r/drawing/comments/18yg4yo/we_are_now_on_pinterest/",
        "content": "We are excited to announce that r/drawing is now active on Pinterest! Tag `@drawing` in your posts to have your drawing featured and please give us a follow!\n\nhttps://pinterest.com/drawing",
        "num_comments": 27,
        "comments": [
            "and yet we still don't know the answer to this question.",
            "and yet we still don't know the answer to this question.",
            " I can't post I'm new I don't know why every post I make comes out as unsubscribed",
            "How to post???  I have art I wanna show but don't know how to add stuff",
            "To be honest with you I really don't know what the question was you trying to ask so I do apologize that so I don't know what you really trying to ask it's my first time doing this so I know what I do but I think you are very nice lookin",
            "okayy",
            "Nice",
            "R",
            "hi",
            "hi"
        ]
    },
    "Weekly discussion thread for /r/drawing": {
        "title": "Weekly discussion thread for /r/drawing",
        "score": 3,
        "url": "https://www.reddit.com/r/drawing/comments/1d9uadi/weekly_discussion_thread_for_rdrawing/",
        "content": "Feel free to use this thread for general questions and discussion, whether related to drawing or off-topic.",
        "num_comments": 21,
        "comments": [
            "Thank you for your submission! Want to share your artwork, meet other artists, promote your content, and chat in a relaxed environment? Join our community Discord server here! https://discord.gg/chuunhpqsU - Don't forget to follow us on Pinterest: https://pinterest.com/drawing and tag us on your drawing pins for a chance to be featured!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/drawing) if you have any questions or concerns.*",
            "how to post my drawing ? it keep removed by weird bot althou i already use flags and other thing",
            "Alright, so I've got like no drawing knowledge. I've been using a 0.5mm lead mechanical pencil and I've done the larger areas fine, but I'm struggling to draw the smaller areas, like the facial features,. Like my lines are too large with the 0.5mm lead. Is there a way I can draw those lines smaller, or would I use a smaller lead pencil like a 0.3mm mechanical pencil?",
            "Procreate for Ipad or (already bought forever) Clip studio paint for desktop with a touch screen laptop (i.e surface pro laptop)?",
            "Need a little advice from /r/drawing \n\nI got back into drawing last year with the objective of doing digital art, but as a prelude I decided to fill a sketchbook first. The thing is, I've always favored tiny notebooks and my sketchbook wasn't the exception. Following that train of thought, I got an ipad mini to start my digital practice. The thing is, I feel a little frustration that I can't seem to capture tinier details in the same way I can with pencil and paper. It makes me wonder if maybe the surface area of the ipad is too small for me, even though it's bigger than my sketchbooks. \n\nSo, considering I'm still relearning the basics and working on fundamentals, what's your recommendation? Stick to pen and paper while I finish working on my fundamentals? Get a bigger ipad? Put in more practice in my current ipad? Try new brushes?\n\nI'm using moleskin sketchbooks and a 2MM staedtler mechanical pencil for my paper drawings. For the ipad, I'm using procreate with the HB Pencil brush. I don't have a screen protector.",
            "Where do I start? People talk about fundamentals, learning anatomy, studying, grids- there's endless tutorials, but I have no idea what any of those *mean* or *how* to study them. How do I practice effectively?",
            "I suddenly remembered an art material I saw when I took a comic illustration class back in 1984. It looked like blank paper, but it came with two solutions that would produce crosshatching. One liquid would make horizontal lines appear, the other vertical, so using them together would produce an area twice as shaded. \n\nDoes anyone have any idea what I’m talking about?? I can’t find anything like this using Google. It was very cool.",
            "so i want to add a like \"see through\" into my piece, but im not sure how to do it. what im thinking is like how they show whats insode of a box or behind a wall, it has a patch that fades from the box or wall into the inside or behind. im not sure how i would make it fade like that, would i cut out a big piece, layer, and blend or is there a different method? i did try googling this but i couldnt think of the right wording so if im doing that here too i can try to explain differently.",
            "Hi, I started drawing recently and I noticed I struggle to visualize how shapes bend or rotate or simply how to manipulate them correctly, is this something that gets better or I just genetically suck at space visualization?",
            "Today I've been feeling down because I feel like my art is not good enough. I've been comparing myself with an artist who I look up to. I can't draw like how they do even though we are the same age. I still struggle with the basics like lighting, shadows, highlights, poses, anatomy, perspective, and views. I have been doing art for a long time since I was 8 or 9 in 2010 or maybe even before that. I really want to make better art but it's so challenging. I find it overwhelming with the things I need to learn to become better and I don't have fun with following art tutorials but I like drawing. Is there anything I could do to improve my art?"
        ]
    },
    "Do you like it? (Made by me)": {
        "title": "Do you like it? (Made by me)",
        "score": 772,
        "url": "https://i.redd.it/617mwy40hd9d1.jpeg",
        "content": "I would love your opinion or any suggestions. It is most appreciated. Thank you❤🙏🏻",
        "num_comments": 58,
        "comments": [
            "Thank you for your submission! Want to share your artwork, meet other artists, promote your content, and chat in a relaxed environment? Join our community Discord server here! https://discord.gg/chuunhpqsU - Don't forget to follow us on Pinterest: https://pinterest.com/drawing and tag us on your drawing pins for a chance to be featured!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/drawing) if you have any questions or concerns.*",
            "Ah god the way you make your lowercase Rs",
            "Schadenfreude",
            "Very good 👍 👏",
            "Look like Da vinci sketchbook🔥",
            "Nice work of tonal value!",
            "Def using shapes in your artwork which is good. Also look up istebrak on YouTube.",
            "I really like this as well as your handwriting and signature, it just looks very well put together. Definitely a frame-able piece",
            "Yes, I like it. Great style, keep going this way. Figure a way to have the background work with the foreground, some push and pull with your edges will get you to the next level.",
            "Reminds me of the famous drawing with a man smoking a cigarette. But it was the skeleton well done."
        ]
    },
    "Please help me name this monstrosity": {
        "title": "Please help me name this monstrosity",
        "score": 972,
        "url": "https://i.redd.it/icx4psohzb9d1.jpeg",
        "content": "",
        "num_comments": 271,
        "comments": [
            "Thank you for your submission! Want to share your artwork, meet other artists, promote your content, and chat in a relaxed environment? Join our community Discord server here! https://discord.gg/chuunhpqsU - Don't forget to follow us on Pinterest: https://pinterest.com/drawing and tag us on your drawing pins for a chance to be featured!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/drawing) if you have any questions or concerns.*",
            "Camel Castell",
            "I have a pen, I have a camel\n\nUHHH CAMEL PEN",
            "Ticonderoga",
            "Drawmedario",
            "Steve?",
            "The draw that broke the camels back",
            "Number 2 camel",
            "Camcil",
            "Draw-medary"
        ]
    },
    "Fuck the World": {
        "title": "Fuck the World",
        "score": 204,
        "url": "https://i.redd.it/dvffoz5b9d9d1.jpeg",
        "content": "",
        "num_comments": 14,
        "comments": [
            "Thank you for your submission! Want to share your artwork, meet other artists, promote your content, and chat in a relaxed environment? Join our community Discord server here! https://discord.gg/chuunhpqsU - Don't forget to follow us on Pinterest: https://pinterest.com/drawing and tag us on your drawing pins for a chance to be featured!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/drawing) if you have any questions or concerns.*",
            "Amazing art!!",
            "BORN TO DIE WORLD IS A FUCK 鬼神 Kill Em All 1989 I am trash man 410,757,864,530 DEAD COPS",
            "Get chucked.\n\nThis is amazing, actually",
            " Very impressive",
            "Nooo my planted!!",
            "If silver Surfer sold us out.",
            "Trippy! Swallows my brain",
            "Pepsi man wasnt having it that day",
            "Amazing composition !"
        ]
    }
}