{
    "We are now on Pinterest": {
        "title": "We are now on Pinterest",
        "score": 69,
        "url": "https://www.reddit.com/r/drawing/comments/18yg4yo/we_are_now_on_pinterest/",
        "content": "We are excited to announce that r/drawing is now active on Pinterest! Tag `@drawing` in your posts to have your drawing featured and please give us a follow!\n\nhttps://pinterest.com/drawing",
        "num_comments": 27,
        "comments": [
            "and yet we still don't know the answer to this question.",
            "and yet we still don't know the answer to this question.",
            "How to post???  I have art I wanna show but don't know how to add stuff",
            "To be honest with you I really don't know what the question was you trying to ask so I do apologize that so I don't know what you really trying to ask it's my first time doing this so I know what I do but I think you are very nice lookin",
            "me too is a pain in the ass",
            "okayy",
            "Nice",
            "R",
            "hi",
            "hi"
        ]
    },
    "Weekly discussion thread for /r/drawing": {
        "title": "Weekly discussion thread for /r/drawing",
        "score": 3,
        "url": "https://www.reddit.com/r/drawing/comments/1d9uadi/weekly_discussion_thread_for_rdrawing/",
        "content": "Feel free to use this thread for general questions and discussion, whether related to drawing or off-topic.",
        "num_comments": 22,
        "comments": [
            "Alright, so I've got like no drawing knowledge. I've been using a 0.5mm lead mechanical pencil and I've done the larger areas fine, but I'm struggling to draw the smaller areas, like the facial features,. Like my lines are too large with the 0.5mm lead. Is there a way I can draw those lines smaller, or would I use a smaller lead pencil like a 0.3mm mechanical pencil?",
            "Procreate for Ipad or (already bought forever) Clip studio paint for desktop with a touch screen laptop (i.e surface pro laptop)?",
            "Where do I start? People talk about fundamentals, learning anatomy, studying, grids- there's endless tutorials, but I have no idea what any of those *mean* or *how* to study them. How do I practice effectively?",
            "I suddenly remembered an art material I saw when I took a comic illustration class back in 1984. It looked like blank paper, but it came with two solutions that would produce crosshatching. One liquid would make horizontal lines appear, the other vertical, so using them together would produce an area twice as shaded. \n\nDoes anyone have any idea what Im talking about?? I cant find anything like this using Google. It was very cool.",
            "so i want to add a like \"see through\" into my piece, but im not sure how to do it. what im thinking is like how they show whats insode of a box or behind a wall, it has a patch that fades from the box or wall into the inside or behind. im not sure how i would make it fade like that, would i cut out a big piece, layer, and blend or is there a different method? i did try googling this but i couldnt think of the right wording so if im doing that here too i can try to explain differently.",
            "Hi, I started drawing recently and I noticed I struggle to visualize how shapes bend or rotate or simply how to manipulate them correctly, is this something that gets better or I just genetically suck at space visualization?",
            "Today I've been feeling down because I feel like my art is not good enough. I've been comparing myself with an artist who I look up to. I can't draw like how they do even though we are the same age. I still struggle with the basics like lighting, shadows, highlights, poses, anatomy, perspective, and views. I have been doing art for a long time since I was 8 or 9 in 2010 or maybe even before that. I really want to make better art but it's so challenging. I find it overwhelming with the things I need to learn to become better and I don't have fun with following art tutorials but I like drawing. Is there anything I could do to improve my art?",
            "What part of the creative process do you find most frustrating or difficult?",
            "hello im new to drawing and ive done a few peices does anyone haves somes ideas for me?",
            "does it count as against the self promo rule if my handle is one of my signatures?"
        ]
    },
    "Praying Mantis. What do you think of this style?": {
        "title": "Praying Mantis. What do you think of this style?",
        "score": 354,
        "url": "https://i.redd.it/xzqzijng3h9d1.jpeg",
        "content": "",
        "num_comments": 38,
        "comments": [
            "I like it a lot!",
            "You line work is so precise it's a very cool mantis",
            "This feels like something you would see at an art gallery",
            "I love how all the patterns work together!",
            "I would love to see a painting sized work that uses this technique!",
            "The line works feel fresh with those spaces, but very neat. And I like the pop of colour with the red.",
            "Im in love with it! Super cool",
            "this makes me happy to look at. Its so nice!",
            "I personally enjoy this style a lot and I like this drawing specifically pretty much.\nI just think that its to me a bit more appealing when you give it more detailed look by varying the patterns a bit more and make them a bit smaller, but that doesnt change that I like your drawing :)",
            "Beautiful work! I like how you can easily see the arm over the wing because of the line work. I think that would have been difficult but you made it look very good"
        ]
    },
    "Bugs and booty. ": {
        "title": "Bugs and booty. ",
        "score": 133,
        "url": "https://i.redd.it/oluex2un1h9d1.jpeg",
        "content": "",
        "num_comments": 4,
        "comments": [
            "You probably have some wild fetishes dude lol",
            "Nice style. Good work",
            "GYAAATT",
            "Thank you for your submission! Want to share your artwork, meet other artists, promote your content, and chat in a relaxed environment? Join our community Discord server here! https://discord.gg/chuunhpqsU - Don't forget to follow us on Pinterest: https://pinterest.com/drawing and tag us on your drawing pins for a chance to be featured!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/drawing) if you have any questions or concerns.*"
        ]
    },
    "Charcoal of a city scene.": {
        "title": "Charcoal of a city scene.",
        "score": 64,
        "url": "https://i.redd.it/j908cvsa1i9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Thought this was a photography sub for a sec look amazing",
            "How are those details so detailed bro ?",
            "Wow wow wow. How long did it take, OP?",
            "Hang this on the fridge, this is insaneeeeeeee",
            "Looks great.",
            "Very well done",
            "https://preview.redd.it/0dko1esioi9d1.jpeg?width=1220&format=pjpg&auto=webp&s=e264ed8c087473f87909e6ce76ca423fc0c649a7\n\nMais uma encomenda finalizada, cada arte um sentimento! E voc j imaginou ter uma arte sua, ou de algum que voc ama decorando seu ambiente?",
            "Thank you for your submission! Want to share your artwork, meet other artists, promote your content, and chat in a relaxed environment? Join our community Discord server here! https://discord.gg/chuunhpqsU - Don't forget to follow us on Pinterest: https://pinterest.com/drawing and tag us on your drawing pins for a chance to be featured!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/drawing) if you have any questions or concerns.*"
        ]
    }
}