{
    "r/Drizzy Official Discord": {
        "title": "r/Drizzy Official Discord",
        "score": 183,
        "url": "https://www.discord.gg/drake",
        "content": "",
        "num_comments": 60,
        "comments": [
            "Assaulted at last nights show. New to Reddit. Brought my 14 year old for graduation. Very expensive night. Never saw the show. This mom currently sucks. What would you do? Really desperate on this one. Barclays didnt care, neither did PD. Avid concert goer/loving Mom. Please help? Anyone have Sandies number?",
            "No but seriously, why is Drizzy hiding in the picture",
            "Replying to myself to add assault was me being hit by drunken girl whose mother let her out half naked and drunk. She literally punched me! REALLY!",
            "Cross-posting is turned off currently",
            "Obviously AI and nothing to do with this thread",
            "who's behind DrakRelated?",
            "w,,,,,,",
            "![gif](giphy|LO9Pko5Enlvq6uDQAw|downsized)",
            "Good",
            "Clown ass nigga"
        ]
    },
    "Shaq apologizes to Drake for posting a BBL picture of him": {
        "title": "Shaq apologizes to Drake for posting a BBL picture of him",
        "score": 363,
        "url": "https://v.redd.it/7o0a8o5ibf9d1",
        "content": "",
        "num_comments": 58,
        "comments": [
            "Backpedal gang the boy got shaq on ropes \n\nJk lol I'm glad shaq ain't hating like that tho",
            "Hes scared of the six",
            "Like a sprained ankle boy, I aint nothin to play with",
            "He's just a big silly guy",
            "nah, nah, nah, Not this time, n*gga, you followin' through",
            "This will be a trend in a few months. Aw we just reppin the west coast it wasnt nothing us dancing to that Kendrick song  wasnt deep. Shuuuuut up",
            "Didnt think it was that serious",
            "we was just talking about thisstop being weird shaq",
            "So hell apologize for posting a meme but not to the people who hes actually offended and belittled over the years? Shaq priorities are crazy lol",
            "idk bro included the bbl drizzy song in there too lol"
        ]
    },
    "The day Push Ups leaked, it was a scary sight everywhere, I'll forever cherish that day😂😂😂😂": {
        "title": "The day Push Ups leaked, it was a scary sight everywhere, I'll forever cherish that day😂😂😂😂",
        "score": 62,
        "url": "https://i.redd.it/0qm1qxyfzh9d1.jpeg",
        "content": "",
        "num_comments": 9,
        "comments": [
            "\"Some nights I wish I could go back in life\n\nNot to change sht, just to **feel** a couple things twice!\"",
            "I wish Push ups got a music video instead of Family Matters.",
            "Cant wait until we can all start talking about how Push Ups is truly the hardest diss track ruined by leaks, AI talk and gaslighting",
            "Had the internet in a frenzy",
            "OG push ups was the best one",
            "Yeah, thought drake was gonna get sonned until he came out with that. Dude made me a fan instantly.",
            "Literally the second greatest diss ever made with family matters being first",
            "Same. \n\nOther than the solid 20 minutes we had after Family Matters, Push ups was my favorite part of the beef \n\nFelt on top of the world again and feel like the general public gave him his flowers for that one. \n\nReplay value has been so good for me too",
            "Family Matters >>"
        ]
    },
    "Camila on Drake/Kendrick beef": {
        "title": "Camila on Drake/Kendrick beef",
        "score": 730,
        "url": "https://i.redd.it/qquliubied9d1.jpeg",
        "content": "",
        "num_comments": 149,
        "comments": [
            "Someone tell Kdot to have dinner with Drake at Delilah with all of their ice ",
            "Its sad especially when you look at the comments on camilas latest instagram post with drake its filled with kenny glazers hating on drake",
            "They did have dinner, it was called \"Buried Alive\".",
            "Kenny wont have dinner with Drake cause hes too insecure about the high chair",
            "Shes a walking W bro",
            "500k or dinner with Drake?",
            "*Omfg literally Starbucks coffee just dinner guys and get over it Rawr XD *",
            "Shes been speaking really well thru this whole promo. Im glad hes working with the right ppl n got the right ppl around him. ",
            "Camilla is such a smash",
            "Bruh its annoying me that J Cole cant even do something simple like this. He was just on tour with Drake like 2 months ago, he could easily say Drakes a good dude and I never seen him do weird shit with minors. Bro can bow down to Kendrick but cant help the nigga who handed him his first #1 smfh"
        ]
    },
    "Industry insider here, the real reason they all dissed Drake is because they're jealous of his ability to grow a beard": {
        "title": "Industry insider here, the real reason they all dissed Drake is because they're jealous of his ability to grow a beard",
        "score": 218,
        "url": "https://www.reddit.com/gallery/1dr0vop",
        "content": "",
        "num_comments": 49,
        "comments": [
            "As someone with a patchy beard Im working on a diss record too",
            "Kendrick sub gonna fucking cook us.  \n\nBut hey, Im here for it.",
            "Asap rocky really walks around looking like a bitch lmao",
            "I got a full beard and can confirm these patchy brothers got beef with us  dont be mad cause you be looking like a bitch, crodie ",
            ".. you right though, why these dudes rocking that patchy ass shit lmao. Yall got money, I know there's some transplant/super chemical you can get that would fill out a beard lmao.",
            "Midsap rocky always taking Ls LOL",
            "What if that was actually true",
            "Literally everyone you showed can grow a full beard now",
            "Get you some biotin vitamins, and be sure to really wash and moisturize your face. And drink water fck nigga, no sodas",
            "They do the same stuff over there but way worse"
        ]
    }
}