{
    "Weekly Episode Thread Hub: 6/24": {
        "title": "Weekly Episode Thread Hub: 6/24",
        "score": 31,
        "url": "https://www.reddit.com/r/dropout/comments/1dnl0vj/weekly_episode_thread_hub_624/",
        "content": "# Monday\n\n[Go behind-the-scenes of Game Changer's \"Ratfish\" in today's new featurette!](https://www.reddit.com/r/dropout/comments/1dnkxh2/behind_the_scenes_of_ratfish/)\n\n[The season 3 premiere of Make Some Noise, featuring the Noise Boys (Josh, Zac, and Brennan)!](https://www.reddit.com/r/dropout/s/IX4zIRSFyR)\n\n# Tuesday\n\n[An all-new Breaking News, featuring Vic Michaelis, Grant O'Brien, Raphael Chestang, and Sam Reich!](https://www.reddit.com/r/dropout/comments/1dojjuu/sam_reich_launches_burning_sam_breaking_news_s7e7/)\n\n# Wednesday\n\n[The season premiere of Dimension 20: Never Stop Blowing Up!](https://www.reddit.com/r/Dimension20/comments/1dpcj3n/be_kind_rewind_never_stop_blowing_up_ep_1/)\n\n# Thursday\n\n[The Adventuring Party talkback for ep 1 of NSBU!](https://www.reddit.com/r/Dimension20/s/zwNvgXnSi2)\n\n# Friday\n\n[A trailer for a new series!!](https://www.reddit.com/r/dropout/comments/1dqpahs/mon%C3%A9ts_slumber_party_trailer/)\n\n[A new episode of Thousandaires, with Oscar Montoya, Ify Nwadiwe, Rashawn Nadine Scott, Ruha Taslimi, and Matt Apodaca!](https://www.reddit.com/r/dropout/comments/1dqwvpp/in_this_house_we_love_mushrooms_and_dumpers/)",
        "num_comments": 18,
        "comments": [
            "Today is my birthday and it's been pretty depressing tbh, but this is really gonna make my week. Thanks dropout :)",
            "New series is fascinating, and I dont know of much of what it could be. Maybe the advice show that they may or may not have been shooting?",
            "friggin miffed that D20 is starting while i'm back-logging Comedy Bang Bang tour episodes on the daily. I need to retire to a Listening Room for a week or so",
            "What a week. I cannot wait.\n\nTonight's MSN might be the best episode of the series to date.",
            "Is there like an official schedule somewhere I can bookmark or add to my google calendar? \n\nI'm baffled by all these streaming apps not having a simple calendar somewhere with the release dates of upcoming episodes. (and don't get me started about Amazon putting literally the wrong release date on The Boys episodes)",
            "Why did I get a notification for NSBU Ep. 1 earlier today lol",
            "The new MSN is amazing but the laugh tracks are NOT it. They just got wildly distracting",
            "Yeah i get it birthdays are tough :/ Hope you'll feel better soon :)",
            "Happiest of Birthdays, love. Have an online hug and snug from this old lady\\~",
            "I just saw this. We have the same birthday! Happy late birthday."
        ]
    },
    "In This House We Love Mushrooms and Dumpers | Thousandaires [Ep. 3]": {
        "title": "In This House We Love Mushrooms and Dumpers | Thousandaires [Ep. 3]",
        "score": 183,
        "url": "https://www.dropout.tv/thousandaires/season:1/videos/in-this-house-we-love-mushrooms-and-dumpers",
        "content": "",
        "num_comments": 93,
        "comments": [
            "\"So the Japanese sword is not the most efficient way to, like, kill people. It's better to have a machine gun or atomic bomb.\" LMAO???",
            "Just want to highlight how incredibly sweet Matt's was - not the actual hiring of puppies (which is still so cute), but donating his $1000 to a charity. That's so incredibly heartwarming to me. I assume the puppies were given to them for the production for free as a thank you for the donation, but $1000 can really help so many rescues!",
            "At first I was like, \"Holy shit, they got Ken Watanabe?!\" But then I realized it was a different Ken Watanabe.",
            "> The booty sets the bar, and drives the car\n\nIdk about anyone else but I just found my new mantra for life",
            "I gotta say the puppy gift is 1000% what Id spend the money on. Hope those cuties get great homes. ",
            "It appears a prediction was right for the first time!!!",
            "Excuse me. They just got tattoos? WHAT",
            "Awww. I love that the last line is that it's insane to describe Kingdom Hearts to anyone.",
            "Ifys purchase is sick as hell",
            "I relate to Rashawn so much with the birthday party. I too invited a bunch of classmates to my birthday (made my own invites and everything) but only one person came.\n\nIf only I was given $1000 to right that wrong with a bunch of my friends now.."
        ]
    },
    "Did anyone else know?": {
        "title": "Did anyone else know?",
        "score": 804,
        "url": "https://i.redd.it/u4jhi8ye0g9d1.jpeg",
        "content": "I just found out about this a few minutes ago. I’ve been thinking about Michael on dropout for a while, and I made a couple of comments yesterday about this. I feel really excited about it. ",
        "num_comments": 78,
        "comments": [
            "Hes one of the guys from the old Cracked website",
            "Thats so cool! Swaim was one of my favorites from the peak Cracked era. If I saw that he was involved with a video or article, it was going on my to-watch/to-read list.\n\nI think that Cracked team had a very similar energy to Dropout - just funny, intelligent people doing whatever weird stuff they thought would make people (and each other) laugh.",
            "Oh wow, I liked the whole After Hours crew. I also followed some of his YouTube stuff after the cracked layoffs. Im glad he made his way into something else that I watch on the regular. Hopefully we can see him in front of the camera for something.",
            "Pipe dream collab, all the after hours people on Dirty Laundry, both casts, even the ones who only got two episodes sadly.",
            "i love cracked alumni and dropout and i love this",
            "I have no idea who that is but good for him\n\nAnd I don't mean that in a backhanded \"well good for them\" sort of way, genuinely that's awesome",
            "Okay this is great and all but now I need to see Michael Swaim on Um Actually",
            "I saw a puppet on the new slumber party ad. Mr. Cody has a puppet on his show-dy, Some More News. Are Cracks seeping into the dropouts who were so humorous in college?\n\nYes, okay, that's a ridiculous stretch. But if they did an after hours dirty laundry they should really get Cody to barback for Grant. It would be hilarious to see him lurking around in the background again.",
            "Oh man I would love to see him be a big part of dropout! Cracked After Hours was hilarious imo",
            "Good for Michael. Hes so consistently funny I feel like he could write on any show. Im excited for the movie him and Abe are working on as well."
        ]
    },
    "Lou Wilson Appreciation Post": {
        "title": "Lou Wilson Appreciation Post",
        "score": 922,
        "url": "https://www.reddit.com/r/dropout/comments/1dr0fvp/lou_wilson_appreciation_post/",
        "content": "I just wanted to acknowledge how great Lou was in this Escape the Green Room Episode, and decided to open it up to just a full on appreciation for the immense talent that is Lou Wilson. From instantly smashing the guitar to his (imo) under-acknowledged mini-monologue at the end of episode, \"All the way back at the beginning of the game, before it all started, we all pulled a card, and thought it was a fun magic trick. But actually it was the first domino is a series of events that would lead us to fight each other, you, for me to cite Nuremberg in trying to make a camera person feel bad.\"I laugh so hard every time I watch that episode and it is in large part because of him. \n\nBut I can't forget his fantastic work in Dimension 20 campaigns either. \"Of course I'm shopping around! Of course I'm price comparing! I would never just buy!\" And then after Emily's big reveal about being married and having children, \"Gobble, another!\" Rolling every time. \n\nWhat are some of Lou's best moment's that you can think of?",
        "num_comments": 88,
        "comments": [
            "The Survivor yodel gets me every single time",
            "There are so many. One I havent seen listed was from Sam Says 3. You can have that one. If a body falls from the ceiling and I dont scream, call somebody.",
            "It wasn't just Lou who contributed but the entire \"Green Hunter\" bit in ACoFaF absolutely destroys me every time.",
            "That bit in Lou's first Make Some Noise appearance where he starts the chant with \"Kill! Some! ...\" and you could almost see the fear in his eyes as he tried to find a word to finish the chant without sounding like a serial killer, always cracks me up. Also \"Please let me win\".",
            "I saw Lou in person at a UCB show last night, and he smashed it. Hilarious.",
            "Every Steven Soderbergh montage to get those points!",
            "Also in one of the remote episodes of Gamr Changer when they were all asked to perform a monologue and tehre was just so much emotion in his voice?? Like he is genuinely a good actor too",
            "A Starstruck Odyssey where >!him and Barry lose all their money at the casino whilst out to find chefs tools aka utensils!<",
            "Lou Wilson's performance as Kingston Brown is transcendent.",
            "In D20 Fantasy High S2 - Fabian vs Chungledown Bim \n\nHE TOLD ME HE WAS GONNA SHIT IN MY MOUTH!"
        ]
    },
    "Funniest Game Changer quote from each player Day 12: Katie.": {
        "title": "Funniest Game Changer quote from each player Day 12: Katie.",
        "score": 78,
        "url": "https://www.reddit.com/gallery/1dra73g",
        "content": "Most upvoted comment wins. Please only submit quotes from Game Changer, two sentence max.",
        "num_comments": 20,
        "comments": [
            "*very hesitantly* chicken? Rooster chicken?",
            "Your eyes, your eyes are like a breath of rain, your hugs, your hugs make me go totally insane...",
            "*about to have knives thrown at her* Alright, where do you want to hit me?",
            "*points to Africa*\n\nWe all are.",
            "I'll do it for 20 dollars",
            "\"Did Wolf put you up to this? This is divorce worthy!\"",
            "I think it technically counts:\n\nHow to cook hardboiled egg",
            "*While wagging her finger sassily* You shall not pass!\n\nS6E5: Bingo",
            "Wait, Sam said I only get money if I win.",
            "I thought we were going to beat him up."
        ]
    }
}