{
    "/r/drums weekly Q & A": {
        "title": "/r/drums weekly Q & A",
        "score": 3,
        "url": "https://www.reddit.com/r/drums/comments/1doaxp8/rdrums_weekly_q_a/",
        "content": "**Welcome to the Drummit weekly Q & A!**\n\nA place for asking any drum related questions you may have! Don't know what type of cymbals to buy, or what heads will give you the sound you're looking for? Need help deciphering that odd sticking, or reading that tricky chart? Well here's the place to ask!\n\nBeginners and those interested in drumming are welcomed but encouraged to check the sidebar before commenting.\n\nThe thread will be refreshed weekly, for everyone's convenience. Previous week's Q&A can be found [here](https://www.reddit.com/r/drums/search?q=q+%26+a&restrict_sr=on&include_over_18=on).",
        "num_comments": 4,
        "comments": [
            "How do I work on playing with others by myself? I am a self taught drummer for about 7 years but I haven’t ever played with anyone because I was never confident enough. I feel like I’m ready now but I don’t know what to practice. I have been playing with a metronome more and trying to memorize rudiment sticking instead of just trying to listen and figure it out. For context I like to play a lot of grunge into late 2000: alternative pop, punk, and I’ve been getting into slightly jazzy ballads. Mostly just Adele.\nSo finally I’m asking for tips to help me play with other people",
            "it's kind of hard to simulate / practice for, there isn't really any substitute for playing with live people where you're all hearing and reacting to / playing off each other. \n\nYou could try running through some drumless tracks that you don't know super well, getting a taste of feeling kind of uncomfortable where someone throws you something you're not necessarily expecting may be good prep",
            "If you can play a song or two with the drumless track, you're ready to play with others ) Just find a band of your level and try to play. You'll get much more feedback on what you need to improve or practice. It's a unique experience that is hard to learn in other ways.",
            "Other advice here is great, I'll add that if you throw on some drumless tracks of songs you know it won't help you as much for this as throwing on stuff you don't know- find random drumless gospel tracks or whatever on youtube and let it run on shuffle. Remember you don't need to play these things perfectly the first time through and you probably never will! Just focus on keeping the beat at first and as you play through a track try to learn little bits like stops or buildups or lead-in notes and try to accentuate those. In a live situation if you're just jamming and grooving with some other cats you'll never know what might come next, you'll get the hang of it fast! Have fun!"
        ]
    },
    "Help I keep clanking my sticks together": {
        "title": "Help I keep clanking my sticks together",
        "score": 120,
        "url": "https://v.redd.it/0uwte9vbhd9d1",
        "content": "I keep banging my sticks together when I’m riding the high hat with the snare. At the end of the video you can see where it’s happening. I will also be posting a photo of my setup in the comments incase that is where the issue is stemming from.",
        "num_comments": 158,
        "comments": [
            "You are swinging your arms too much. Focus on wrist and finger movement instead",
            "1. Practice \n2. Stop doing that. \n3. Maybe get a local teacher \n\nYou are off to a good start. We all have been there. But it’s not rocket science. Have fun.",
            "I think the main issue is your wind-up. There really shouldn't be one. Not that large anyway. Your wrists are really stiff, so you're getting too much of your range and movement from your arms. Focus on letting your arms hang comfortably and developing more fluid and flexible wrists and fingers. \n\nFor a sense of it, think of a sort of effeminate \"oh, yoohoo!\" kinda wave, straight up and down from your wrists. Or mimic the way your bass pedal works, but with an open hand. Like the lever is starting at your wrists instead of your elbows. It'll be an important skill to develop as you start trying to play faster. Smaller muscle groups can work faster, and those larger arm movements will hold you back later if you don't fix it now",
            "You’re in the middle of a paradox. \n\nYou should practice different strokes (full, half, tap, etc.), and singles, doubles (paradiddles work great for those). Its boring. \n\nPlaying grooves is more fun. But when you struggle to play grooves, it’s not that fun. \n\nSpend time “in the shed” so you can moreso enjoy your time playing grooves. \n\nPractice intentionally, and practice slowly—to a metronome. Slow is smooth, smooth is fast.",
            "I say this with kindness. You're a very erratic drummer right now. You need to practice being more in control. Seasoned drummers can flail all over the place for show when they're good. But right now you need to focus on proper form. Specifically you're lifting your left arm really high to hit the snare. It's like your brain is resetting before each hit. You're likely relatively new and that's normal. Just going to take focused practice. \n\nOne of the best things I ever heard was from JP Bouvet who said it's not just practicing, but practicing with intention. You'll get it.",
            "https://preview.redd.it/3g92b8tghd9d1.jpeg?width=3024&format=pjpg&auto=webp&s=dd084d5a704d71790a82843adcad5e59f9de85bb\n\nHere is my set up",
            "A lot of bad and unhelpful advice being thrown around in this thread, OP. \n\nWhat you are experiencing is entirely due to coordination timing between your right and left hand. As you become more coordinated and experienced as a player, your two hands will better flow in tandem with one another. You will be better at executing dynamics, which will be very helpful when it comes to getting your meter/hihat hand out of the way, without it sounding like there is an obvious break in momentum. \n\nOne thing you can do to help remedy this right now, is whenever you encounter your sticks clicking together simply slow your playing WAY down and work through that same exact beat at a tempo that you have full control over. This will help your muscle memory and your brain to work it out in a manner that builds actual retention.",
            "Snare maybe slightly too high but I'm definitely no expert as I'm a beginner drummer myself 😁",
            "Too much arm, not enough wrist. Focus on your technique, and keep at it!",
            "I could never play crossed like that. Same thing would happen to me because I love to hit the snare really hard. I moved my hats to about 10-11 o clock around the snare and now my sticks don’t hit. Had to move some other things to make that work but it does.\n\nEdit: added the photo so you can see where my hats are.\n\nhttps://preview.redd.it/bwggmo6jzd9d1.jpeg?width=2562&format=pjpg&auto=webp&s=fe848a917196c8ec840a929d0ffd89a92fd9971c"
        ]
    },
    "video of the Gretsch USA Customs": {
        "title": "video of the Gretsch USA Customs",
        "score": 173,
        "url": "https://v.redd.it/u2qnzmljgc9d1",
        "content": "13x9, 16x16, 18x16, 24x18 and 14x6.5 Chrome Over Brass",
        "num_comments": 44,
        "comments": [
            "Sounds like every hit rock album of the last 40 years…and that’s a great thing. Gretsch USAs absolutely rock",
            "![gif](giphy|p8GJOXwSNzQPu)",
            "That great Gretsch sound!",
            "From the first Tom hit I thought you were about to launch into good times bad times",
            "Wow man. These are gorgeous. Sounds so good. Fuckkkkkkkkkyessssss",
            "When toms sound this good it makes me just want to play fill after fill after fill. So satisfying ",
            "radical! sounds amazing ",
            "Hell yeah!! Great looking kit and you have it sounding fat",
            "Damn, those things sound absolutely 🔥🔥🔥",
            "beefy"
        ]
    },
    "Are these cymbals worth saving?": {
        "title": "Are these cymbals worth saving?",
        "score": 70,
        "url": "https://www.reddit.com/gallery/1dqv8g7",
        "content": "I bought these used cymbals on ebay, but received them in far worse condition than it looked in the pictures. Is it worth trying to remove all the rust/corrosion or I should just return them?",
        "num_comments": 49,
        "comments": [
            "they look pretty cool if you ask me.",
            "How do they sound?",
            "that’s not rust. but you could try a cymbal cleaner. but if they sound good that is all that counts",
            "Fwiw, a lot of drummers purposely age their cymbals by doing things like burying them in their yard for months to age them. A lot of times they pour random liquids on them as they bury them too and they end up looking like this. They may have a desirable sound that you'd want to keep. Try them out before you make any changes",
            "How do they sound?  How much did you pay for them?\n\nAs others have commented, it's not rust because they're not iron, but it is probably some kind of oxidation.  If they sound good, you could try cymbal cleaner.",
            "I don't know what some weirdo did to make these iridescent, but if they sound good and the price was right, I'd rock with 'em as-is.\n\n\nAlthough, if they don't match the listing pictures, you *have* been defrauded, so your call.",
            "A zildjians. As long as they’re not cracked, they are high quality cymbals. If you want them cleaned up go after them with cymbal polish a bit and see. I rarely worry what cymbals look like anymore. If they sound good to my ears I’m happy.",
            "I can't see anything in those pictures. There's RUST on them? Are they cracked?",
            "it kind of looks like they were in a fire..I don't know of any liquids or substances you can put on the cymbal to make it turn rainbow colors.  If you check out UFIP tiger series cymbals, they have this rainbow effect on them, and they get it by blow torching the cymbals.",
            "If they sound good, roll with them!"
        ]
    },
    "Finally put led rope lights in the acrylic ": {
        "title": "Finally put led rope lights in the acrylic ",
        "score": 44,
        "url": "https://www.reddit.com/gallery/1dqw9xr",
        "content": "",
        "num_comments": 10,
        "comments": [
            "It looks really cool. You could change the colors that way, right?",
            "Groovy man!",
            "Looks fucking cool man!👍 Nice sub ohm tank too.",
            "Looks sick as shit. Shoutout Super Kick II on the toms, they pair real nice with acrylics",
            "What lights did you use and how do you set them up?",
            "Acrylic kits are the only ones that look good with that light treatment and yours looks amazing, well done!",
            "sick",
            "Thanks! And yes! I can control each drum individually",
            "Lol, thanks!\n\nI realized that after the gig, all of my good pictures had my vape in it. 🤦‍♂️ besides the one",
            "Thanks! I'm a big fan of the skII on the floor tom!"
        ]
    }
}