{
    "/r/drums weekly Q & A": {
        "title": "/r/drums weekly Q & A",
        "score": 3,
        "url": "https://www.reddit.com/r/drums/comments/1doaxp8/rdrums_weekly_q_a/",
        "content": "**Welcome to the Drummit weekly Q & A!**\n\nA place for asking any drum related questions you may have! Don't know what type of cymbals to buy, or what heads will give you the sound you're looking for? Need help deciphering that odd sticking, or reading that tricky chart? Well here's the place to ask!\n\nBeginners and those interested in drumming are welcomed but encouraged to check the sidebar before commenting.\n\nThe thread will be refreshed weekly, for everyone's convenience. Previous week's Q&A can be found [here](https://www.reddit.com/r/drums/search?q=q+%26+a&restrict_sr=on&include_over_18=on).",
        "num_comments": 4,
        "comments": [
            "How do I work on playing with others by myself? I am a self taught drummer for about 7 years but I haven’t ever played with anyone because I was never confident enough. I feel like I’m ready now but I don’t know what to practice. I have been playing with a metronome more and trying to memorize rudiment sticking instead of just trying to listen and figure it out. For context I like to play a lot of grunge into late 2000: alternative pop, punk, and I’ve been getting into slightly jazzy ballads. Mostly just Adele.\nSo finally I’m asking for tips to help me play with other people",
            "it's kind of hard to simulate / practice for, there isn't really any substitute for playing with live people where you're all hearing and reacting to / playing off each other. \n\nYou could try running through some drumless tracks that you don't know super well, getting a taste of feeling kind of uncomfortable where someone throws you something you're not necessarily expecting may be good prep",
            "If you can play a song or two with the drumless track, you're ready to play with others ) Just find a band of your level and try to play. You'll get much more feedback on what you need to improve or practice. It's a unique experience that is hard to learn in other ways.",
            "Other advice here is great, I'll add that if you throw on some drumless tracks of songs you know it won't help you as much for this as throwing on stuff you don't know- find random drumless gospel tracks or whatever on youtube and let it run on shuffle. Remember you don't need to play these things perfectly the first time through and you probably never will! Just focus on keeping the beat at first and as you play through a track try to learn little bits like stops or buildups or lead-in notes and try to accentuate those. In a live situation if you're just jamming and grooving with some other cats you'll never know what might come next, you'll get the hang of it fast! Have fun!"
        ]
    },
    "16 years with this beautiful drum, I think it sounds better than ever!": {
        "title": "16 years with this beautiful drum, I think it sounds better than ever!",
        "score": 50,
        "url": "https://i.redd.it/chvi8yyg2h9d1.jpeg",
        "content": "It’s a craviotto 13x7 cherry/maple/walnut which I got for my 21st. ",
        "num_comments": 6,
        "comments": [
            "Some money has been spent there man 😅",
            "There are 3 beautiful drums in this photo.",
            "The whole kit is beautiful. Thanks for showing it to us. ![gif](emote|free_emotes_pack|thumbs_up)",
            "Gotta spend it on something!",
            "Thanks very much! The kit is an evetts; a custom Australian builder 😊",
            "Anytime!"
        ]
    },
    "Just wanted to share my kit": {
        "title": "Just wanted to share my kit",
        "score": 13,
        "url": "https://www.reddit.com/gallery/1drba8s",
        "content": "Haven’t share in here yet so figured I would✌🏻my kit and array of snares. Happy playing all. \n\nDW Collectors in Black Ice (circa 2008): \n- 9 x 13 rack \n- 16 x 16 floor\n- 16 x 18 floor \n- 16 x 24 kick \n\nSnares: \n- 6.5 x 14 Dunnett Maple Monoply \n- 6.5 x 14 Dunnett Titanium Gold Top \n- 6.5 x 14 3mm Cast Bronze Snare with matching heavy hoops (assembled by YC Drum Co.) \n- 6.5 x 14 YC Drum Co Black Iron\n\nCymbals (Zildjian):\n- 16” K Light Hats \n- 20” Crash of Doom \n- 24” K Light Ride\n- 22” K Light Ride \n- 21” A Ultra Hammered China \n- 19” + 20” A Custom Crashes (not pictured) \n\nHardware: \n- all DW 9000 \n ",
        "num_comments": 1,
        "comments": [
            "Flex! Very nice."
        ]
    },
    "Grohl Snare & Fresh Pots": {
        "title": "Grohl Snare & Fresh Pots",
        "score": 20,
        "url": "https://v.redd.it/zaeq3kjwvh9d1",
        "content": "Audix D6 mug, crappy instant coffee and a DW Grohl icon snare. ",
        "num_comments": 8,
        "comments": [
            "Geez, even through my phone speakers it sounds nice !",
            "Where'd you get that mug?",
            "DW maple snares are bliss to play, always have that nice warm maple crack to them.",
            "They offer them for sale from time to time, keep an eye on their socials like Instagram.",
            "FRESH POTSSSSS",
            "Sweet!",
            "Screaming for decaf.",
            "Thx"
        ]
    },
    "How does the snare sound? How can i improve the snare sound if its not good?": {
        "title": "How does the snare sound? How can i improve the snare sound if its not good?",
        "score": 15,
        "url": "https://v.redd.it/21a73s1x0i9d1",
        "content": "",
        "num_comments": 20,
        "comments": [
            "Sounds good to me dude",
            "Also, don’t compare to a recorded sound.  Most recorded drums today are very processed and lots of times sampled, so it’s difficult to compare a live sound to it.",
            "The first thing I always do is check the tension on the bottom head and tighten it up some. That said, this snare sounds great, I wouldn’t worry about messing with it too much.",
            "sounds good, and it's more important how it sounds in the context.",
            "Play drums.  If the snare sound doesn't fit - think about why.  What do *you* want out of it.  \n\nSounds fine in isolation, to me, though.",
            "What kind of snare is it ? It sounds good but if it was mine I might tighten the reso head a bit I like a nice crack on my snare’s",
            "Pretty much the exact sound I always go for so I say it's perfect lol. All that matters is whether you like it or not.",
            "Sounds good to me. If you like a tight snare sound (Chad Smith, Abe Cunningham, Carter Beaufort) vs a fat low tuning (think classic rock) then you’re right on the money.",
            "Sounds alright actually. You can leave it as it is. The only thing you could change, and that of course is up to your own taste, are the heads to get a bit different sound. But the tuning on the video is pretty good.",
            "Quite nice. A bit hollow sounding for my liking but it’ll work for most things."
        ]
    }
}