{
    "Daily Random Discussion Thread": {
        "title": "Daily Random Discussion Thread",
        "score": 1,
        "url": "https://www.reddit.com/r/dubai/comments/1dqz7f6/daily_random_discussion_thread/",
        "content": "Hello,\n\nThis is the Daily Random Discussion thread, the place for anything goes discussion! Keep it PG and follow reddiquette.\n\nHere are all the active monthly threads for June -\n\n[Monthly /R/Dubai Classifieds Thread: June 2024](https://www.reddit.com/r/dubai/comments/1d5b4le/monthly_rdubai_classifieds_thread/)\n\n[Monthly /R/Dubai Job Offers Thread: June 2024](https://www.reddit.com/r/dubai/comments/1d5b4l7/monthly_rdubai_job_offers_thread/)\n\n[Monthly /R/Dubai Job Seekers Thread: June 2024](https://www.reddit.com/r/dubai/comments/1d5b4ll/monthly_rdubai_job_seekers_thread/)\n\nIf you have any feedback or complaints about this post, please [**message the mods**](http://www.reddit.com/message/compose?to=%2Fr%2Fdubai).\n\nThanks!",
        "num_comments": 4,
        "comments": [
            "Would Europe Commissions heavy duty of Chinese EVs food the gulf market with such vehicles and would we see more of them on the roads here?",
            "travelling to dubai soon with the family - which app/site should i use to buy tickets to different attractions to get deals/discounts ?",
            "**Looking for Accommodation/Roommates/Sharing - (Female Only)**  \n  \nGreetings my fellow humans!\n\nI'm looking for an accommodation for a close friend of mine. She prefers to stay in a place with all women.\n\n**If anyone on here is looking for roommates or if you know anyone that rents out spaces for women, please dm me.**\n\nShe's quiet, introverted, an avid reader, anime fanatic and overall a very sweet girl.\n\nThe location can be anywhere on the red-line of the Dubai Metro, but it isn't so important. Anywhere with easy access to the metro in general while she looks for work, preferably on the red-line of the Dubai Metro.\n\nThank you so much and have a good one!",
            "[ Removed by Reddit ]"
        ]
    },
    "spinneys Dubai just increased their prices at least an extra 10% on almost everything": {
        "title": "spinneys Dubai just increased their prices at least an extra 10% on almost everything",
        "score": 94,
        "url": "https://www.reddit.com/r/dubai/comments/1dr6exz/spinneys_dubai_just_increased_their_prices_at/",
        "content": "What is wrong with spinneys! it is like they are not expensive enough! their margins are ridiculously high and now adding an extra 10%! \n",
        "num_comments": 81,
        "comments": [
            "A sign from Universe to move to Nesto and Viva",
            "![gif](giphy|DOPKHQg6oFWUg)\n\nYou guys are shopping from Spinneys?",
            "You dont do bulk shopping at Spinneys. Wife and I get fruits/veg and our protein from there because its just better quality. Everything else go to a Carrefour or something",
            "So stop spending your money there. Id wager that the ideal spinneys customer doesnt care about a 10% hike, theyd barely even notice.",
            "Sounds like they suddenly realise theyre gonna neeed to pay that 9% corporate tax this year.",
            "They went public recently so...",
            "They have also halved the loaves in a blatant shrinkflation move.",
            "So dont shop there? \n\nProblem solved; youre welcome.",
            "Go to Viva then ?",
            "I only get meat from spinneys. Meat, especially chicken stinks from carrefour or lulu"
        ]
    },
    "Ngl bro tried his best. W Abdul rahman ": {
        "title": "Ngl bro tried his best. W Abdul rahman ",
        "score": 5,
        "url": "https://i.redd.it/t9ffmymqdi9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "These numbers are UAE based and all numbers have IDs registered with them right? It's easier to find out what's happening by the cops and shut it down for good like what happened in Ajman."
        ]
    },
    "Help": {
        "title": "Help",
        "score": 3,
        "url": "https://i.redd.it/tb3g0h750i9d1.jpeg",
        "content": "Finished the impounding tenure, is it okay to drive the car now? As today is weekend ajman police is closed so they advise me to come on July 1 which is mondah. ",
        "num_comments": 7,
        "comments": [
            "Bruh if gov sites started making typos, we are fakd.\nPlease \"dawnload the file\"",
            "Yeah Monday is fine. How much did you have to pay btw?",
            "Its not scam. This is the one that was sent to me when im in the police station",
            "1000 for fine, 600 for smart impound.",
            "But can i drive the car now?",
            "I know that its legit, but even government sites have typos, almost concerning",
            "Thanks, yes if they told you to come and collect it on 1st July then I am sure you can drive it then, shouldn't be a problem. Was the fine and impound for traffic signal violation? Usually for traffic signal violation you can drive after 30 days, no issues."
        ]
    },
    "Afraid to drive in Dubai, which option best for me ?": {
        "title": "Afraid to drive in Dubai, which option best for me ?",
        "score": 5,
        "url": "https://www.reddit.com/r/dubai/comments/1dr5f1o/afraid_to_drive_in_dubai_which_option_best_for_me/",
        "content": "Hello guys,\n\nI ll come to for a project for dubai to 3 months period. My work is brand visitings, unfortunately i don’t have confidence for driving even at my home country i didnt drive after take my driver license.\nTaxi, careem, uber , if there s any app for car sharing in here turkey you can join car sharing with low fees. I dont need full day but trying to find solution best economic way for me. \n\n",
        "num_comments": 38,
        "comments": [
            "Try driving on less rush times when you are relaxed and not going somewhere. Just drive for drive. This will give you confidence.",
            "I lived there for 8y and never bought a car\n My expenditure in taxis ,Uber, metro was almost equal if not less than owning a shitty car so I never bothered. I'd rather spend the money on other things and I get by just fine. However I did live in one of the central areas of Dubai where most things (that I felt like doing) were a Max of 10-15 mins taxi ride. If you're in the same situation no need for a car. If however you choose to live in a suburb it's different. It's a personal choice at the end of the day. Don't let anyone influence your perspective. Dubai is a very easy city with or without a car. Oh and it's worth noting that I used to share Ubers with a colleague who also lived in my area, it worked out really well for us.",
            "You can go for a combination of metro/bus and take taxis where they aren't accessible by metro or bus.",
            "If you're gonna be here in winter, then public transport. Else, taxis.",
            "drive in dubai. build up the courage. driving here is wayyyyy better than any other country. only traffic will be an issue",
            "Carlift could be an option but they have pick up and drop timings. Morning drop off is usually from 6 am to 2 pm and pick up from 6 pm to 1 am. They wont bring you place to place, just to one location.",
            "Use electric scooter, metro & bus",
            "Expereicned this and yes very cheap indeed",
            "I had a private driver dropped us to school before ahah",
            "Yes , i ll will do it definitely. How is now traffic jam now , is it still so rush ?"
        ]
    }
}