{
    "Hi": {
        "title": "Hi",
        "score": 748,
        "url": "https://i.redd.it/rgmft0pbkf9d1.jpeg",
        "content": "",
        "num_comments": 24,
        "comments": [
            "you sounded like my niece and shes 6 months old ",
            "Ryans ridiculous poker face paired with the distorted camera angle is gold.",
            "I love to watch Ryan fail.",
            "One of my favorite scenes",
            "Stanley relishing in the moment when Ryan starts to say high is picture perfect.",
            "People say how awkward Michael tots is, this is up there as well for me",
            "I love Stanley's reaction  He really enjoyed Ryan making a fool of himself.\n\nDwight was a much better mentor to Ryan ",
            "Fuck Stanley \n\nAll my homies hate Stanley",
            "Maybe it's a cultural thing, I never really understood why Ryan was so intimidated by some friendly, professional black men, and couldn't do his pitch. Is that normal for American white people?",
            "Yess, I always have to skip this"
        ]
    },
    "Andy being a gem.": {
        "title": "Andy being a gem.",
        "score": 4121,
        "url": "https://i.redd.it/0umjddkitc9d1.jpeg",
        "content": "Andy isn't one of my favorites but these scene always makes me giggle",
        "num_comments": 130,
        "comments": [
            "As someone whos worked in academia, I can assure you that Andy being kind of stupid despite a fancy degree is probably among the most realistic plot points on the show.",
            "He knows what he's talking about, he's a gunshot victim",
            "Didn't he admit that he basically coasted through his time there, barely going to class?",
            "Because Andy knows more about fire then all of us.   Heck just talk to him about the sun.",
            "Pretty sure its said between the lines that Andys family paid for his degree, he didnt earn it.",
            "He liked philosophy so much he took it again.",
            "Its pronounced colonel. Its the highest rank in the military",
            "Youre talking about the guy who thought it was a good idea to ask a girl out while literally playing a game of pretending",
            "Its a Bachelor of Arts. Not an actual degree in art. Andy isnt an artist lol.",
            "Level of education  intelligence"
        ]
    },
    "Temp Ryan was the best": {
        "title": "Temp Ryan was the best",
        "score": 2591,
        "url": "https://i.redd.it/imm6wj52wc9d1.jpeg",
        "content": "",
        "num_comments": 63,
        "comments": [
            "I liked him better as the temp.",
            "Hey it's Ry the Fire Guy!",
            "If temp Ryan was so cool, why didn't he take his pants off and run around the office like a Risky Business type situation? I mean Michael gave him permission to do it and he didn't",
            "I wish they kept him like this. In a way, he was like Mark Brendanawicz from P&R. But instead of writing him off, they just wrote him crazy. I think one really normal person would have helped, there was never a straight man. Even Jim was an odd character compared to Temp Ryan.\n\nEdit: not that the show I've rewatched countless times needed \"help\"",
            "I love how wistfully he says and Id forget too",
            "One of my favorite scenes of the whole series is the bar scene during Dwights initiation and Dwight can't figure out what to chant while Ryans chugging his beer haha. \"Temp! Temp! Temp! Ryan! Ryan! Ryan! \n\nAlso followed by 'just think, the temp agency could have sent you anywhere\" haha such a great episode.",
            "shouldve left while he could",
            "Stanley yelled at me today..",
            "He was a lot funnier when he didn't care about anything. Season 6+ Ryan is a caricature",
            "This how I treat every job. I leave nothing personal there. Just in case I get to never come back."
        ]
    },
    "Is this the dirtiest joke on the office? ": {
        "title": "Is this the dirtiest joke on the office? ",
        "score": 3113,
        "url": "https://i.redd.it/i8xmjq1o2c9d1.jpeg",
        "content": "",
        "num_comments": 277,
        "comments": [
            "So I am instituting prima nocta. before Phyllis wedding",
            "Toby didnt get a lot of laughs. Im sure it felt good to get some, just once.",
            "The dirtiest joke in the show is when Michael is talking abt how his 8th grade teacher hooked up with one of the students and ruined the school year for them",
            "Thats not what he says and thats not the joke",
            "It squeaks when you bang it.",
            "Glad Im not the only one here who knows this isnt what OP thinks it is",
            "I've got a big box yes I do! I've got a big box how bout you?",
            "\"Unless they're talking about Toby! Convicted *rapist*!\"",
            "OP you were either high in class and just don't remember what was actually said but that's not even Toby telling a joke and it isn't mumbled as you keep saying. He very clearly says: \"Great point, ummm, in fact a basic rule of thumb let's just act every day like Pam's mom is coming in. Alright that's it if anyone has any questions about anything you know where I sit in the back.\"",
            "I think this one is better- When Dwight says to Michael in the final- Michael, I cant believe you came And Michael says thats what she said."
        ]
    },
    "How did Pam find out that she was pregnant just from having a scan on her ankle? ": {
        "title": "How did Pam find out that she was pregnant just from having a scan on her ankle? ",
        "score": 390,
        "url": "https://www.reddit.com/r/DunderMifflin/comments/1dqy67v/how_did_pam_find_out_that_she_was_pregnant_just/",
        "content": "Apologies if this has been asked before but I couldn't find anything. I might be missing something obvious, but in Company Picnic when Pam finds out that she's pregnant, she's at the hospital for a check on her ankle, which you would assume is some sort of scan. How would the doctors find out that she's pregnant just from that? Whenever I've been in the hospital for a similar thing, it's been a quick x-ray (or whatever scan) specifically on the injured area and then straight out, no blood tests or full body scans, so I'm not sure how they would know.\n\nEdit: God damn it's so much harder work being a woman! Thanks for all of the answers guys, makes total sense that there's a \"better safe than sorry\" protocol. Sorry for my total ignorance and obliviousness.",
        "num_comments": 186,
        "comments": [
            "I went to the hospital for a concussion once. They drew blood and ran tests even though I told them I knew I wasn't pregnant. And that's how I found out I was pregnant.",
            "Because as women we usually can't get scans done without taking pregnancy tests first. They always ask when the last day of our period was and make us take a test in case anything they're doing might be harmful to a baby, especially things like x-rays. \n\nSource: I am a woman who has to take a pregnancy test every time I get something done at the doctor even when there's not even a slight chance I am pregnant.",
            "Are you a woman? They test for pregnancy pretty much any time we set foot in a hospital/go to the doctor, just in case lol.",
            "Before any woman of childbearing years has an x-ray, they always ask Is there any chance you could be pregnant? In the show its the last thing the nurse asks Pam as shes wheeling her away for the x-ray. Pam probably said something like, I dont think so, then the nurse asked her when was your last period, and the answer must have lead the nurse to think Pam  needed a pregnancy test and they had her do a pregnancy test.",
            "Any time Ive gotten an X-ray they always ask if theres any chance I could be pregnant. I suppose if youre not confident or 100% sure, they might do a pregnancy test before exposing you to the radiation. But Ive never experienced that.",
            "I know you know the answer now but anytime they do an x ray they have to be sure you arent pregnant. Common practice.",
            "No matter what I'm going in for, every single doctor's appointment I'm asked if I'm sexually active and if there's any chance I'm pregnant. It's common practice before they do anything else with female patients.",
            "Im a 57 y/o single woman who has had a hysterectomy yet was REQUIRED to do a pregnancy test before surgery. A pregnancy test before x-rays is standard procedure.",
            "Babies are actually carried in the ankles. Common misconception.",
            "Because they ask you if youre pregnant or could be pregnant before they do an xray because it exposes you to radiation. Doctors basically ask you if youre pregnant before they do anything."
        ]
    }
}