{
    "Don't do it, Laios!": {
        "title": "Don't do it, Laios!",
        "score": 142,
        "url": "https://i.redd.it/xb8jgaeasq7d1.jpeg",
        "content": "",
        "num_comments": 14,
        "comments": [
            "Is this blood what I think it is?",
            "https://preview.redd.it/cbq1xnau628d1.png?width=211&format=png&auto=webp&s=04d699d5865bc02ee2f9e7b5940c4c8374fe8e87\n\nDo it, Laios!",
            "I know who they’re really hunting for\n\nhttps://preview.redd.it/76hmjfrh0z8d1.jpeg?width=224&format=pjpg&auto=webp&s=8766dd11fdc71baac43b04ff6db963843ea290bd",
            "Does someone have the template for this?",
            "Do it, Laios!\n\nY’know you want to :}\n\nThis is simply your mind saying for you to do it",
            "Laios wants that blood soup",
            "Children's hospital?",
            "Nah, that's not blood, it's uh... [the title sequence to Redline](https://www.youtube.com/watch?v=y0M1IefUTlw&t=743s)",
            "...of course...(Awkward silence echoes)",
            "Darn you beat me to it"
        ]
    },
    "On moderating Daydream Hour and Bonus Chapter content": {
        "title": "On moderating Daydream Hour and Bonus Chapter content",
        "score": 93,
        "url": "https://www.reddit.com/r/DungeonMeshi/comments/1dkgav3/on_moderating_daydream_hour_and_bonus_chapter/",
        "content": "Hey folks.\n\nGonna keep this one short & sweet. Officially, under our rules, reposting content from the manga, or fan translations, falls under our 'no piracy' rules. That being said, the mod team has been lenient so far to take action, considering the major influx of people new to the content and discovering the Daydream Hour and Bonus Chapter material for the first time.\n\nIt's cool, isn't it?\n\nThat being said, as the first season of the anime comes to a close, we're going to start enforcing this again. Too many posts are just pages from the official work with little to nothing added by OP's title.\n\nFigured it's better to let everyone know this way than by just starting to remove content without notice. Thank you for your understanding.",
        "num_comments": 0,
        "comments": []
    },
    "Whyy does Laios always look so derpy 😭": {
        "title": "Whyy does Laios always look so derpy 😭",
        "score": 1875,
        "url": "https://i.redd.it/8tluwc1cie9d1.jpeg",
        "content": "",
        "num_comments": 44,
        "comments": [
            "Average older brother behavior",
            "Solid arm bar.",
            "Thats his face when he locks in",
            "picking a name is serious business",
            "Bc he is",
            "I love how by saying \"usually\" it implies that Falin won at least once. Or he let her win, either way it's cute.",
            "he needs to lock in, he is seemling stronger than fallin, and yet laios says he ***usually*** wins, not *always*, and with the way he says it it doens't sound like he let fallin win, she was def able to win by herself some times\n\nwhatever advantange Fallin had was serious enough to make laios need to take all of his mental energy and invest it in strenght to fight",
            "https://preview.redd.it/fthus8owof9d1.jpeg?width=323&format=pjpg&auto=webp&s=fa33c42924a4ccd5ad90c4f1f52a86b91869b1cb",
            "Was this in the anime, what were they naming, and what did he name it?",
            "he's locked in"
        ]
    },
    "Touden party relationship charts": {
        "title": "Touden party relationship charts",
        "score": 3529,
        "url": "https://www.reddit.com/gallery/1dqru4x",
        "content": "My “friend”",
        "num_comments": 187,
        "comments": [
            "The way Laios thinks highly of everyone sends me",
            "No more, no less.\n\nI think I've said it before, but this is a great way to create a reference for writing character interactions. Having a short phrase summarizing how one character views/their relationship with another is a great writing tool.",
            "A Cat\n\nhttps://preview.redd.it/9pbwqi1exd9d1.png?width=965&format=pjpg&auto=webp&s=58327f68c201b6c3737f46556f8071ffde14ffda",
            "I love how for Izutsumi it's just \"Cat\"",
            ">Foreigner/I want us to be friends  \n>  \n>I'm not fond of him\n\nOuch.",
            "The small, warm one ☠️😂",
            "Senshi has unc status...like wdym \"her face looks just like laios'.\" my HEART- 😭🩷",
            "I love how Senshi is basically Laios hero, probably a father figure as well",
            "This is actually a really good exercise for prospective writers.",
            "https://preview.redd.it/cv78uxv64e9d1.jpeg?width=779&format=pjpg&auto=webp&s=3037d36da97771496d10992a1ba1cee82d7bc88f\n\nIn the mind of Senshi Laios literally looks like Falin but with short hair."
        ]
    },
    "my falin cosplay!": {
        "title": "my falin cosplay!",
        "score": 4135,
        "url": "https://v.redd.it/sobfdrtrtb9d1",
        "content": "had so much fun making this, i hope you guys enjoy! the win",
        "num_comments": 91,
        "comments": [
            "How do you walk in those good god?",
            "I'm more impressed with how you walk in those heels. Must be a pain to do art so good",
            "Needs a 2nd person for dat big chicken ass",
            "Wow! Don't tell me you made it by hands. It was some dark magic you used, right?",
            "Moving wings?! Hot damn! That's awesome!",
            "When you get really into a fight do you sometimes rip off your shirt and do a dragons frigthening roar?",
            "She was a fairy ✨🧚‍♀️",
            "This is insane, very well done!",
            "Damn, that's most impressive I've seen for sure",
            "Wow! This is absolutely amazing! If you don't mind me asking what material your legs/pants were made of?"
        ]
    }
}