{
    "Weekly Friends / Followers Thread": {
        "title": "Weekly Friends / Followers Thread",
        "score": 5,
        "url": "https://www.reddit.com/r/duolingo/comments/1dp277q/weekly_friends_followers_thread/",
        "content": "Post your Duolingo username in the comments below. Don't forget to let us know what you are learning.  \n\n\nYou are welcomed to follow me. My Duolingo username is: [PorgieLingo](https://www.duolingo.com/profile/PorgieLingo)   \nI am learning Spanish, French, Chinese & German.",
        "num_comments": 39,
        "comments": [
            "My user is glutenzone, I am learning Japanese, and I have a 1013 day streak :)",
            "My username is indaclub2. I'm learning French and I have a 52 day streak :)",
            "HoughtonMatt is my username and I am highly active recently. I do Maths in the morning and then my main focus is Italian in the evenings!",
            "My username is .chro and I do Chinese/Portuguese courses. My native lang are English and Spanish. I'd be willing to help anyone with any of my two natives if needed",
            "My user is Franci_21 and I’m learning German!",
            "Hi I'm Yasser, my username is youaftouh.  \nNice to meet you all! <3",
            "misspuppychow is my username. currently focus on learning german and english (also spanish if i get bored of those two) feel free to add me! glad to be friends with all of you <3",
            "Add me at @jblasco if you also need someone for the Friends Quest this week!",
            "My username is TyKR_824 and I’m learning Japanese and I have a 23 day streak",
            "Hello! My username is @dayandconfused. I’m just starting to learn German. Looking forward to connecting! ☺️"
        ]
    },
    "How would you make the Duolingo Practice Hub better? 💭": {
        "title": "How would you make the Duolingo Practice Hub better? 💭",
        "score": 94,
        "url": "https://i.redd.it/r6nnb4s3im8d1.jpeg",
        "content": "",
        "num_comments": 107,
        "comments": [
            "Todays review should always be unit reviews or target practice. We already have a speaking and listening one available.",
            "Select words to be practised. Bring in stories earlier even if just tiny ones.",
            "As a linguist, I would LOVE to see a “practice phonemes” for a language or even a section for learning the IPA. Hell even an entire Phonetics and Phonology course on Duolingo I think would be incredibly useful so many people!",
            "let me sort by chapter when practising vocabulary.",
            "In the Japanese course, the words section needs an update, I just wanted to look for a word I learned a couple of months ago but can't find it because sorting options are so basic It needs some feature like sorting to unit or something like. And worse some words don't even show up, this needs to be fixed and improve",
            "Allow you to skip practice that you’ve done for 10 days straight! Thumbs up or down.",
            "get rid of speaking or listening lesson on the today review thing, they are always available so why put them twice",
            "I would improve the word practice. Where you would be able to type in words instead of the words being already available. Will definitely train my memory in a much better way!",
            "My marked lessons. A list of lessons i saved because i want to train them more",
            "The word list needs to have the appropriate gender with it - you have to learn both, so put them together!"
        ]
    },
    "I think that’s enough Duo for today": {
        "title": "I think that’s enough Duo for today",
        "score": 160,
        "url": "https://i.redd.it/s4bivncerf9d1.jpeg",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Don't ask how is \"how\" in Romanian.",
            "Cum means “with” in latin.",
            "Please tell me that’s fake",
            "It means “how” in Romanian!",
            "it’s just “with” in romanian",
            "Im a little busy right now, can we reschedule?",
            "It's cum, but idk, I don't speak Romanian, just seen a talakloid video where Teto spoke Romanian and I believe it from learning a little Italian.",
            "A bit off topic, but have you ever thought about how odd it is that in Catalan, \"amb\" is very different from \"con\" in Italian and Spanish, \"com\" in Portuguese, \"cu\" in Romanian, etc? 😅",
            "and \"as\" (as in \"as much as\") is \"precum\"",
            "No I think it's Latin.\n\nAlso it's used in Indian English.\n\nLike if you wanted to say brunch, you can say breakfast cum lunch. \n\nBecause cum in Hindi means 'less', so when you say breakfast cum lunch, you're saying it's more of a lunch than breakfast."
        ]
    },
    "Uhh…Is he good?": {
        "title": "Uhh…Is he good?",
        "score": 536,
        "url": "https://i.redd.it/9fd9nivl7d9d1.jpeg",
        "content": "Is this intentional or not?",
        "num_comments": 67,
        "comments": [
            "They adding the (geometry) math version into languages fr",
            "Bruh on Ozempic or some SVG export out of Illustrator didnt include radius values",
            "When the sun hits that ridge just right 👌",
            "Its giving Tiktok's \"cant see my waist\" trend",
            "When you upload your conscious to the digital world",
            "I wasn't aware that you could run Duolingo in a Nintendo 64...",
            "No I don't think so. Someone else had this problem and from what I heard something isn't loading. Idk for sure.",
            "She often studies in the library.",
            "Your internet might not be.",
            "She is slightly studying at the library?"
        ]
    },
    "Half way through, what benefits would I get though? ": {
        "title": "Half way through, what benefits would I get though? ",
        "score": 31,
        "url": "https://i.redd.it/dxobvz3qkh9d1.png",
        "content": "Been learning Spanish on and off, discovered this streak society thing recently. Is anyone from here part of it? What benefits do you get?",
        "num_comments": 12,
        "comments": [
            "You get a shiny plaque on your profile, and a \"1yr+\" flair next to your name on the leaderboards.",
            "i get some gems every 10 days or so, am at 250 days and I was just given the picture for it",
            "you get a number on the leaderboard. Thats it",
            "You get free Plus for 3 days every 100 days or so",
            "You'll be addicted to maintaining the streak",
            "Streak society is when you reach a 30 day streak, and you start getting rewards for extending your streak",
            "..whether you want it or not",
            "Could be, I never really paid attention.",
            "You get motivation.",
            "It's purely the honour."
        ]
    }
}