{
    "Weekly Friends / Followers Thread": {
        "title": "Weekly Friends / Followers Thread",
        "score": 5,
        "url": "https://www.reddit.com/r/duolingo/comments/1dp277q/weekly_friends_followers_thread/",
        "content": "Post your Duolingo username in the comments below. Don't forget to let us know what you are learning.  \n\n\nYou are welcomed to follow me. My Duolingo username is: [PorgieLingo](https://www.duolingo.com/profile/PorgieLingo)   \nI am learning Spanish, French, Chinese & German.",
        "num_comments": 38,
        "comments": [
            "My user is glutenzone, I am learning Japanese, and I have a 1013 day streak :)",
            "My username is indaclub2. I'm learning French and I have a 52 day streak :)",
            "Hi,\nLearning French daily as some family live in South of France. Occasionally, I build up on the bits of German I already know.\n\nFeel free to add me, Miralex252. Will follow back!\n\nhttps://www.duolingo.com/profile/Miralex252",
            "HoughtonMatt is my username and I am highly active recently. I do Maths in the morning and then my main focus is Italian in the evenings!",
            "My username is .chro and I do Chinese/Portuguese courses. My native lang are English and Spanish. I'd be willing to help anyone with any of my two natives if needed",
            "I’m learning French and I recently passed my 100 day streak. My username is mat.png I always friend back! [friend link](https://www.duolingo.com/profile/Mat.png?via=share_profile_qr)\n\nhttps://preview.redd.it/xjvoh9tety8d1.png?width=936&format=png&auto=webp&s=3ffddd654f81b81480fb937b7d3572391450e88b",
            "Hi! My username is [Fistashi0](https://www.duolingo.com/profile/Fistashi0?via=share_profile_qr) . Fell free to add me! Im learning Italian for now\n\nhttps://preview.redd.it/bgi7hxbq5z8d1.png?width=662&format=png&auto=webp&s=38292fe396f879deeab17068cac9f1af76727ab9",
            "Hi! My username is [joaodtx](https://www.duolingo.com/profile/joaodtx), and I'm learning English and Russian. I'll friend back.\n\nhttps://preview.redd.it/tnxmb8d0z09d1.png?width=746&format=pjpg&auto=webp&s=c2db157d2427a8d10f1448cc92b4b28cf59bf324",
            "My user is Franci_21 and I’m learning German!",
            "https://preview.redd.it/h29v39tqb39d1.png?width=1027&format=png&auto=webp&s=b7dd96cf0d0c476a8f628d1d58cf1ea05a6d2c98\n\nneed ppl to do friend quests with pleaseee\n\ni add everyone back"
        ]
    },
    "How would you make the Duolingo Practice Hub better? 💭": {
        "title": "How would you make the Duolingo Practice Hub better? 💭",
        "score": 93,
        "url": "https://i.redd.it/r6nnb4s3im8d1.jpeg",
        "content": "",
        "num_comments": 105,
        "comments": [
            "- pick units to focus on in targeted practice  \n- conjugation practice for languages that have it  \n- short story exercise practice called \"comprehension\"  \n- radio show collection like stories  \n- writing exercise only practice (no word bank)  \n- gender practice for languages with gendered articles. you get nouns and have to select/type the correct articles",
            "WE CAN ROLEPLAY??",
            "Todays review should always be unit reviews or target practice. We already have a speaking and listening one available.",
            "Select words to be practised. Bring in stories earlier even if just tiny ones.",
            "1: Suggest Units to review  \n2: Conjugation practice  \n3: Writing Only  \n4: Vocabulary ONLY practice. 1 word, no word bank, gender required (if applicable). Split into two, so if a word has two translations you must get both to fully pass the question. If this idea is really hard, \"use it in a sentence\" questions paired with the AI could be really helpful too.  \n5: Suggested outside reading/listening/general learning/music. Could be paired with sponsors in-app. Suggesting stuff like coffee break podcast, some books, news articles hand picked because they'd be relatively easy to follow for a beginner.  \n6: A word bank to help with personalized practice. So I can basically tell the AI which words it doesn't need to show me anymore. Seriously, I don't need to practice the word \"penser\" for the 150th time. I use it outside of duolingo everyday now.  \n7: Speed Practice. Take a recording (of a human, not a bot), and start slow to test speed of listening comprehension. Then speed it up until you can follow it faster than the average person speaks in that language.\n\n\\_\\_\\_\\_  \nOther things related to the personalized practice:\n\nSeparate them into super and non-super instead of what it is now. (unless you have super)\n\nTell us in the practice where the questions are coming from so we can manually review it if needed\n\nNotes paired with sections/rules/what the question is attempting to teach. So if I was repeatedly getting a concept incorrect. Let's say conjugations for example, I could write a note and that note would available to see next time conjugations are the main point of the question.\n\n\\_\\_\\_\n\nThank you for taking the time to listen to us.",
            "As a linguist, I would LOVE to see a “practice phonemes” for a language or even a section for learning the IPA. Hell even an entire Phonetics and Phonology course on Duolingo I think would be incredibly useful so many people!",
            "let me sort by chapter when practising vocabulary.",
            "In the Japanese course, the words section needs an update, I just wanted to look for a word I learned a couple of months ago but can't find it because sorting options are so basic It needs some feature like sorting to unit or something like. And worse some words don't even show up, this needs to be fixed and improve",
            "Allow you to skip practice that you’ve done for 10 days straight! Thumbs up or down.",
            "I really miss a “flashcard” option. So basically being able to choose words/phrases to practice/recall. And then having an opinion to rank it if you know it, kinda knowing it and not knowing it (or something like that). As of right now I use external app for that.\n\nSecondly I would bring stories and words to the languages that don’t have them yet.\n\nAlso I would have a general practice available all the time. Sometimes “forces” you to speak/listen.\n\nI agree with the pretty common theme on this thread of choosing the unit you practice, that would be really good.\n\nAnd specifically for Chinese I wish there was a practice where you translate a spoken sentence. Now we only have spoken to characters. Or spoken+characters to English. But that’s not only in the hub."
        ]
    },
    "Uhh…Is he good?": {
        "title": "Uhh…Is he good?",
        "score": 342,
        "url": "https://i.redd.it/9fd9nivl7d9d1.jpeg",
        "content": "Is this intentional or not?",
        "num_comments": 45,
        "comments": [
            "**Duolingo Support**  \nThank you for surfacing a possible bug! Please also be sure to file a bug report for Duolingo using this link: [Duolingo Bug Report Form](https://preview.duolingo.com/help/bug-report). All issues related to subscriptions or billing must be submitted to the Duolingo support team (which you can do through the bug report form by selecting Purchase Issue). \n\nFor urgent issues that directly impact your ability to use the Duolingo app and are not related to subscriptions or billing, you can contact Tracee Miller (Reddit username: Tracee-at-Duolingo), a Duolingo staff member who tries to help out in this subreddit. When you message Tracee, be sure to include a short (1-sentence) description of your issue, as well as your Duolingo username and the ticket number from your support request.\n\nPlease note that while Tracee will do her best to assist, she may not be able to respond to all messages. She will not respond to non-critical issues (issues that do not prevent you from being able to use Duolingo) or to messages that do not include the information listed above. She appreciates your understanding. [Click here on this link to message Tracee Miller for help](https://www.reddit.com/message/compose?to=Tracee-at-Duolingo&subject=I need help with my Duolingo account)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/duolingo) if you have any questions or concerns.*",
            "He’s looking pretty sharp",
            "They adding the (geometry) math version into languages fr",
            "When the sun hits that ridge just right 👌",
            "Bruh on Ozempic or some SVG export out of Illustrator didnt include radius values",
            "He’s origami",
            "Its giving Tiktok's \"cant see my waist\" trend",
            "When you upload your conscious to the digital world",
            "No I don't think so. Someone else had this problem and from what I heard something isn't loading. Idk for sure.",
            "Heck yeah, origami Vikram!"
        ]
    },
    "I think that’s enough Duo for today": {
        "title": "I think that’s enough Duo for today",
        "score": 49,
        "url": "https://i.redd.it/s4bivncerf9d1.jpeg",
        "content": "",
        "num_comments": 12,
        "comments": [
            "*Congrats on your Epic Duolingo Meme!*  \nHello, Duolingo enthusiasts! You've chosen to share your humor under the 'Epic Meme' flair—thank you for contributing to the fun side of learning! A quick reminder:\n- **Originality is Key**: Ensure your memes are original and truly epic. We love seeing your creativity shine!\n- **Spotlight Opportunity**: Standout memes have the chance to be featured on our [X/Twitter account](https://www.x.com/DuoSubreddit). It's a great way to get your humor seen by a wider audience.\n- **Follow Us**: Don't miss out on the fun—follow [DuoSubreddit on X](https://www.x.com/DuoSubreddit) for more epic Duolingo learning laughs and community highlights.\n\nKeep the memes coming, and let's make language learning hilariously memorable!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/duolingo) if you have any questions or concerns.*",
            "Please tell me that’s fake",
            "Don't ask how is \"how\" in Romanian.",
            "Options: \"Yes\", \"Please\".",
            "Cum means “with” in latin.",
            "Turkish?",
            "Cum now",
            "semen jumpscare",
            "No I think it's Latin.\n\nAlso it's used in Indian English.\n\nLike if you wanted to say brunch, you can say breakfast cum lunch. \n\nBecause cum in Hindi means 'less', so when you say breakfast cum lunch, you're saying it's more of a lunch than breakfast.",
            "It means “how” in Romanian!"
        ]
    },
    "Uh no?": {
        "title": "Uh no?",
        "score": 144,
        "url": "https://i.redd.it/izqlstksfd9d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "\"whats wrong babe? You barely touched your lesson!\"",
            "Duo called me bae while I was at a summer camp and I showed it to my friend and he was like ”why are you dating an owl”",
            "Just do an Italian",
            "Babe",
            "Duo burns your house and salts your fields if you ignore him long enough.\n\n*Midori no fukuro wa yandere desu.*",
            "It’s over for you I’m sorry 😞 ",
            "I got the same thing and I was so confused by being called “babe” by a green owl",
            "I’m just not that into you. \n\nIt’s not you, it’s me.",
            "Do an Italian lesson, simple as that.",
            "I hate this with a passion lmao"
        ]
    }
}