{
    "r/dustythunder Lounge": {
        "title": "r/dustythunder Lounge",
        "score": 16,
        "url": "https://www.reddit.com/r/dustythunder/comments/1047oot/rdustythunder_lounge/",
        "content": "A place for members of r/dustythunder to chat with each other",
        "num_comments": 30,
        "comments": [
            "What’s dusty thunder?",
            "Heyyy",
            "hey",
            "Hi",
            "hi! finding my way to more ⚡ content",
            "Love the YouTube video you do. You have very good insight and your voice is very clear and understandable.",
            "Hewo",
            "Hey guys I need help. We found out our preteen daughter (my bonus daughter) plagiarized a research paper. How should I handle this?",
            "And by I, I mean my husband and I",
            "Hey"
        ]
    },
    "WHAT IS THE ASCON SCALE?": {
        "title": "WHAT IS THE ASCON SCALE?",
        "score": 13,
        "url": "https://i.redd.it/3qk7xzd5cvxc1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Based on the [U.S. military's DEFCON levels](https://www.military.com/military-life/defcon-levels.html#:~:text=As%20of%20January%202023%2C%20the,on%20the%20website%20DefconLevel.com.), the ASCON Scale was created to give a consistent measurement of the levels of assholery across stories. Like the DEFCON levels, 1 is the worst, and 4 is the least severe level.  \n  \nIt was created by Dusty Thunder in a random moment some time in 2022, but it stuck, and the ASCON Scale has since become a staple of Dusty's content as well as a useful tool to many people as they seek to identify levels of assholery in their daily encounters.\n\nThis is copied from [dustythunder.com](http://dustythunder.com)"
        ]
    },
    "AITAH for telling my niece to hurry up, finish college and leave.": {
        "title": "AITAH for telling my niece to hurry up, finish college and leave.",
        "score": 518,
        "url": "https://www.reddit.com/r/dustythunder/comments/1dqu5ol/aitah_for_telling_my_niece_to_hurry_up_finish/",
        "content": "Backstory,  I (F45) was married long ago and during that marriage my ex-husband and sister had an affair.  My sister had a set of twin girls.  My ex-husand left and I didn't find out until years later that they were his.  \n\nMy dad passed away suddenly in 2019. My sister decided to go homeless.  My husband felt bad and offered to take my nieces in so they wouldn't be homeless with their mom.  We tried helping my sister but she was also battling addiction and our things would disappear.  It was too much.  Their biological father will not claim them and his son from third marriage says girls only want to be in his life is because the family is rich.  His wife has a PHD and is a big shot in our local school district.  His mom won the Powerball back in 2002 right before my ex-husband and I were married.  \n\nAnyways.  My husband and I have gotten the twins graduated high school.  They are now 20 and are going to start their second year of college this fall.  \n\nI don't know what to do anymore.  I ask for help with chores and they say we are just using them as slaves.  Now that they are over 18, we ask that they help pay some bills.  They want to see our bills and see what we have to pay.  They are constantly asking why we are struggling and why we can't pay our bills with just one paycheck.  I work two jobs since last August.  \n\nToday I asked for $50 because one of twins upgraded their phone.  She said that's not what she owes because they told her it was only going to be $25.  I was so angry.  I told her I would just pay it.  I ask her how long she had left in school.  She was it just depends.  I told her and her sister need to hurry up, finish school and leave.",
        "num_comments": 160,
        "comments": [
            "NTA at all, aren't these the affair babies from your husband and sister? Sounds like they inherited their parents' shitty attitude. I know it isn't popular on Reddit to blame kids for their faults but fuck these two tbh.",
            "Turn off the internet for their things and stop getting them anything.\n\nThey can help out or leave.\n\nWorst case…eviction",
            "NTA tell them to leave if not willingly, you might have to fill to evict them.",
            "Ouch! Sounds like niblings both need to be sent on their way! Are y'all paying their tuition?  \n\nMight be worthwhile to break down expenses on a spreadsheet, showing just what you have been laying out for them. Life isn't free",
            "Just tell them to leave by the time school starts in the fall. They aren't willing to be adults so they need to just go. You owe them nothing. Since they have so much money and are good at managing it, they can get an apartment together or go to the dorms. It is completely reasonable to tell them to move out by the fall.",
            "1st off set a payment plan. Write out every bill and add house work chores and they each owe ¼!   2nd please see that You are allowing them to take advantage of the situation. Don't pay for anything anymore. Give them 30 days to get the money or the F out!  3rd They are 20 and not your children so don't let them treat you like a credit card they can walk on. \n\nActually please don't let anyone treat you like you aren't amazing for helping them through with what you could.   \nYou have done an amazing job letting them live with you but now they are taking your kindness as weakness.",
            "They’re adults. They should have a part time job and pay at least $50 week toward bills",
            "Please stop letting these brats run over you. Take them off your phone plan. Make them pay for their own phones that they get by themselves. They're 20 fucking years old, they can go to the AT&T or T-Mobile and figure out how to get a phone. Do not pay for it. Don't stock any special foods for them, if they want something they can buy it. Change the Wi-Fi password and do not give it to them unless they pay a percentage of the bill. You're not doing them any favors by letting them continue to mooch and not be adults.",
            "You took them in and saved them from being homeless with a Mother struggling with a drug addiction and this is how they treat you. Hell no! \n\nTell them they need to leave your home and give them notice if required. Don’t let them try to change your mind once they realise how much money you’ve been saving them. They’re 20 and can stand on their own two feet from now on.\n\nThe fact that these are your ex husband’s affair babies and you still took them in is amazing to me. Well done to you and your husband.",
            "And I just wanna mention that it was years ago, but a crap load of us worked and slowly went to College part time and finished. It's absolutely possible."
        ]
    },
    "AITA for not telling my husband I’m leaving until after I moved out?": {
        "title": "AITA for not telling my husband I’m leaving until after I moved out?",
        "score": 395,
        "url": "https://www.reddit.com/r/dustythunder/comments/1dqenqk/aita_for_not_telling_my_husband_im_leaving_until/",
        "content": "So as the title says I recently left my husband of 14 years.  I moved out with the kids while he was at work.   His prior actions led me to feel it might not be safe to tell him before.  It was also suggested by a domestic violence outreach worker to not tell him before.  (No he did not hit me.)  Since I left our only conversations have been by email and he has been very pleasant.  I know I did the right thing leaving the marriage.  But maybe I could have told him before and it would have been okay.  \n\nAITA for not knowing if it was safe to tell him before and leaving then telling him?",
        "num_comments": 109,
        "comments": [
            "It's possible that he's being nice now, by email, because he knows it's shareable.  And he could be \"love-bombing\". \n\n  \nDon't worry about how you left. Just stay safe now and focus on your future.",
            "I am so pleased you listened to the outreach worker and got out safely.\n\nI wasn't physically assaulted until after I escaped.",
            "You were advised to leave safely, which you did, been there, NTA.. you know that leaving a DV relationship is the most dangerous time.. that’s exactly when things -can- get dangerous.",
            "Never feel guilty for protecting yourself, and your children. There is a reason you reached out to a domestic violence worker for advice. You knew nothing your guy it could be dangerous. Never meet him anywhere alone, and always communicate in writing (text,email). If he demands a phone call, record it. Always keep documentation of every conversation.",
            "If he was already showing all the hallmarks of an emotional/psychological/financial abuser, that last step to being a true, physical abuser wouldn't have seemed so big for him. Especially if it was during your \"breaking up of his family\" as I'm sure he views it. NTA",
            "Lock up your credit a d get your half of the money from the joint account. Get your name off of any  credit cards that you share",
            "As someone with an unfortunate amount of experience with domestic abuse, it sounds like you trusted your instincts as a mom, and as a human who deserves to feel safe, and be safe, so don't second-guess the gut reaction that led you to leave with your children in as safe a way as possible.",
            "If a DV worker advised you to leave when he wasn't home because that was the safest option for you, you're not asshole.\n\nJust because someone doesn't hit you now doesn't mean they won't go from A to Z in 60 seconds. Abusers escalate and sometimes it goes from yelling and screaming to attempted murder/murder.\n\nThe most dangerous for a woman is when she leaves an abuser.",
            "Why are you feeling guilty?\n\nHe made you feel afraid to the point you accepted advice on how to physically leave your husband safely.\n\nYou don’t know how angry he was when you left.  There was domestic violence in your marriage.  Domestic violence isn’t always what we see on tv.  \n\nYou got you and your kids out safely.  Stop this guilt - it only punishes yourself.",
            "If this was the advice you were given, why feel guilty? I guess it was a necessity. I also assume he communicates this 'pleasantly' in order to lure you back."
        ]
    },
    "AITAH for wanting to tell my in laws to not tell my daughter their \"adoptive\" granddaughter is my daughter's sister?": {
        "title": "AITAH for wanting to tell my in laws to not tell my daughter their \"adoptive\" granddaughter is my daughter's sister?",
        "score": 258,
        "url": "https://www.reddit.com/r/dustythunder/comments/1dqfc2u/aitah_for_wanting_to_tell_my_in_laws_to_not_tell/",
        "content": "My husband (32M), lets call him Alex, and I (31F) have been together 10 years, married for almost 6. When we first got together, Alex told me he has a daughter, at the time she was 3, lets call her Bee.\n \nSo for a bit of background knowledge, Alex is not Bee's bio dad. He just stepped up to be dad, which I think was amazing. Alex and his ex, Bee's mom, had been on and off for a few years before he and I got together. When we got together and I met Bee, I fell in love with her. BM of course was not happy that I was in the picture now. She did everything she can to scare me off, causing all sorts of drama and fights. Although BM was putting a strain on my mental health and my relationship, I stayed because I love Alex and loved Bee as if she were my own. She was the first kid who called me mom. \n\nFast forward to when Bee was 7 years old. After another heated argument, which this one turned physical (BM slapped me for trying to push her away from me when she was yelling at me in my face). BM took Bee away from us. Unfortunately Alex has no legal say in anything to do with Bee. \n\nFast forward 7 years, Bee is now 14 years old. Alex and I are married and have a daughter of our own who is 5 let's call her Ray. We don't really know Bee like we used to. We only see her maybe once a month for a couple hours when my in laws have her on their time allowed by BM. As of now, we want Ray to see Bee as a friend, not a sister. Ray is too young to understand this very complicated situation we are in with Bee and her mom. Ray is already asking questions on why she can't see and be with her sister because other people have told Ray that Bee is her sister (this was done without me or Alex knowing). I made it clear to Ray that Bee is her friend. I don't want her getting confused and hurt as to why Bee is not around. Alex and I will explain everything to her and help her understand better about this when she is older. But for now, to Ray's knowledge, she is an only child. \nSo, AITAH for wanting to tell my in laws to not tell my daughter that their \"adoptive\" granddaughter is not my daughter's sister?",
        "num_comments": 93,
        "comments": [
            "I would tell Ray that bee is the daughter of daddy’s friend \n\nIf the in laws say granddaughter or sister I would be there the whole time and I would immediately say - no MIL Bee is not Rays sister.  \n\nBees mom was Rays daddy’s friend and was\nClose to her growing up.  Now Bee is Rays friend\n\nLet’s not confuse Ray or we will have to stop visits",
            "NTA seems like Alex really doesn’t have a relationship with Bee anymore. The ex is only allowing his parents to see her once a month. Don’t lie to Ray and correct anyone who does.",
            "Do not lie at all. You will lose your daughter's trust! Always be honest and address it in an age appropriate way but do not lie!",
            "It will be much easier to explain the situation when she’s older if it is adding more detail to the truth you tell her now. If you say she’s ’just a friend’ whilst other people you can’t control are clearly calling her a sister then not only is she likely to be confused but you’ll also be undoing a lie sometime in the future. She’s not really a sister or a friend, as others have said step sister is probably the closest term, which may well be shortened to sister. 5 year olds can understand a lot, but they also don’t have the same inbuilt social understanding of what’s complicated. So this is no more complicated to explain to her than where babies come from or why don’t I have a grandpa or whatever.\n\n‘Before me and your daddy met and had you he lived with BM and helped take care of Bee. Later on after me and your daddy got married Bee still came to stay with us and we helped look after her too so she saw us both like an extra mum and dad. It’s been a long time since me and daddy helped look after Bee like an extra mummy and daddy, so she’s not really your sister, but that’s why some people call her your sister, because she’s an extra special person to us. There isn’t really a word for what Bee is to you, but some people might use the word step sister. You can call her your friend, your sister or your step sister, whatever feels like the right word to you.’\n\nYes there might be additional questions, and if you lay the groundwork of understanding what relationships are and that they sometimes end (info she may already understand) then explaining who BM is becomes even easier.",
            "NTA. UpdateMe",
            "I'm in a family with lots of weird relationships. I think kids can understand that and don't get too stressed about it. \"Tina is your aunt. She's not my sister, she's my cousin, but she joined our family in her teens and we consider her our sister. Reggie and Laila are just family friends but they call your Gramma their Gramma because their mom doesn't have any other family and Gramma has opened her heart to them. But they aren't your cousins and you don't have to call them that.\" \n\nI think you could just explain that it's weird and she could understand.",
            "NTA\n\nShe isn’t her sister, so it’s not a lie. Adults shouldn’t mess with kids like this. It’s cruel.",
            "nta but you need to explain to Ray the situation with Bee (age appropriate of course)",
            "Kids are smart and more emotionally intelligent than we give them credit. You kid will generally accept whatever you tell them, which can backfire if you lie. How does Bee see herself Ray? Is it really an issue if she's called a \"sister\"? Lots of people are separated from siblings and turn out just fine.\n\n  \nNTA - I see that you want to protect your child, but I don't think this is necessary.",
            "You don’t have to go into sordid details or whatever. Just say that bee is a sister of the heart or whatever. Your child is five, unless they’ve got delays they should be old enough to understand an explanation."
        ]
    }
}