{
    "r/dustythunder Lounge": {
        "title": "r/dustythunder Lounge",
        "score": 15,
        "url": "https://www.reddit.com/r/dustythunder/comments/1047oot/rdustythunder_lounge/",
        "content": "A place for members of r/dustythunder to chat with each other",
        "num_comments": 30,
        "comments": [
            "hi! finding my way to more  content",
            "Love the YouTube video you do. You have very good insight and your voice is very clear and understandable.",
            "Hey guys I need help. We found out our preteen daughter (my bonus daughter) plagiarized a research paper. How should I handle this?",
            "And by I, I mean my husband and I",
            "Started a Reddit just for this sub ",
            "If the school doesnt know I wouldnt tell them. Could cost her a lot if shes unaware of the serious consequences as she gets into higher grades.  Especially college",
            "Trying so hard to stay awake for the live I so wanted to hear the update story on financial infidelity.",
            "So Im trying to post a story but it isnt going through. This there like a glitch or something?",
            "hey, just got reddit for the Thunder Crew! love the community and commentary from all, especially Dusty!!!",
            "you guys gotta see the best of redditor post I just made the gf is wildddd"
        ]
    },
    "WHAT IS THE ASCON SCALE?": {
        "title": "WHAT IS THE ASCON SCALE?",
        "score": 14,
        "url": "https://i.redd.it/3qk7xzd5cvxc1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Based on the[U.S. military's DEFCON levels](https://www.military.com/military-life/defcon-levels.html#:~:text=As%20of%20January%202023%2C%20the,on%20the%20website%20DefconLevel.com.), the ASCON Scale was created to give a consistent measurement of the levels of assholery across stories. Like the DEFCON levels, 1 is the worst, and 4 is the least severe level.  \n  \nIt was created by Dusty Thunder in a random moment some time in 2022, but it stuck, and the ASCONScale has since become a staple of Dusty's content as well as a useful tool to many people as they seek to identify levels of assholery in their daily encounters.\n\nThis is copied from [dustythunder.com](http://dustythunder.com)"
        ]
    },
    "AITAH for telling my niece to hurry up, finish college and leave.": {
        "title": "AITAH for telling my niece to hurry up, finish college and leave.",
        "score": 682,
        "url": "https://www.reddit.com/r/dustythunder/comments/1dqu5ol/aitah_for_telling_my_niece_to_hurry_up_finish/",
        "content": "Backstory,  I (F45) was married long ago and during that marriage my ex-husband and sister had an affair.  My sister had a set of twin girls.  My ex-husand left and I didn't find out until years later that they were his.  \n\nMy dad passed away suddenly in 2019. My sister decided to go homeless.  My husband felt bad and offered to take my nieces in so they wouldn't be homeless with their mom.  We tried helping my sister but she was also battling addiction and our things would disappear.  It was too much.  Their biological father will not claim them and his son from third marriage says girls only want to be in his life is because the family is rich.  His wife has a PHD and is a big shot in our local school district.  His mom won the Powerball back in 2002 right before my ex-husband and I were married.  \n\nAnyways.  My husband and I have gotten the twins graduated high school.  They are now 20 and are going to start their second year of college this fall.  \n\nI don't know what to do anymore.  I ask for help with chores and they say we are just using them as slaves.  Now that they are over 18, we ask that they help pay some bills.  They want to see our bills and see what we have to pay.  They are constantly asking why we are struggling and why we can't pay our bills with just one paycheck.  I work two jobs since last August.  \n\nToday I asked for $50 because one of twins upgraded their phone.  She said that's not what she owes because they told her it was only going to be $25.  I was so angry.  I told her I would just pay it.  I ask her how long she had left in school.  She was it just depends.  I told her and her sister need to hurry up, finish school and leave.",
        "num_comments": 191,
        "comments": [
            "NTA at all, aren't these the affair babies from your husband and sister? Sounds like they inherited their parents' shitty attitude. I know it isn't popular on Reddit to blame kids for their faults but fuck these two tbh.",
            "NTA tell them to leave if not willingly, you might have to fill to evict them.",
            "Ouch! Sounds like niblings both need to be sent on their way! Are y'all paying their tuition?  \n\nMight be worthwhile to break down expenses on a spreadsheet, showing just what you have been laying out for them. Life isn't free",
            "Just tell them to leave by the time school starts in the fall. They aren't willing to be adults so they need to just go. You owe them nothing. Since they have so much money and are good at managing it, they can get an apartment together or go to the dorms. It is completely reasonable to tell them to move out by the fall.",
            "Please stop letting these brats run over you. Take them off your phone plan. Make them pay for their own phones that they get by themselves. They're 20 fucking years old, they can go to the AT&T or T-Mobile and figure out how to get a phone. Do not pay for it. Don't stock any special foods for them, if they want something they can buy it. Change the Wi-Fi password and do not give it to them unless they pay a percentage of the bill. You're not doing them any favors by letting them continue to mooch and not be adults.",
            "Theyre adults. They should have a part time job and pay at least $50 week toward bills",
            "And I just wanna mention that it was years ago, but a crap load of us worked and slowly went to College part time and finished. It's absolutely possible.",
            "Your house, your rules. \n\nThey can always leave if they don't want to help out. And/or, you can give them a month to get out. Shorter if they give attitude.",
            "Why get angry about having to pay their phone bill?  Just dont pay it, problem solved. Its not your phone. You control your actions. Dont pay any extras for them since they refuse to help in any way.",
            "NTA, they're not your kids, send them to your ex husbands. They're adults now and can go and live an adults life. I'd be giving them a date and time to either move out or start paying full rent and bills."
        ]
    },
    "UPDATE: AITAH for wanting to tell my in laws to not tell my daughter their \"adoptive\" granddaughter is my daughter's sister?": {
        "title": "UPDATE: AITAH for wanting to tell my in laws to not tell my daughter their \"adoptive\" granddaughter is my daughter's sister?",
        "score": 40,
        "url": "https://www.reddit.com/r/dustythunder/comments/1dr8urn/update_aitah_for_wanting_to_tell_my_in_laws_to/",
        "content": "Wow. With this being my first reddit post, I didn't really know what to expect. I do appreciate all the comments and what everyone thinks of this. (link to first post at bottom)  \nJust some more things I want to put out there to clarify some of what others have been talking about;\n\nAlex is NOT Bee's bio dad. Alex and his ex were never married. Alex's family basically took her in when she was a teen and pregnant. She was already pregnant when they got together. They were on and off for a few years. My husband has no legal claim to Bee.\n\nMy in laws are the ones who have time with Bee. But only the time that is allowed by BM. When my in laws have her, sometimes we get to see Bee as well, but that is only maybe about 6 or 8 times a year(sorry I should have been more clear about that). BM is very controlling with who on my husband's side gets to see Bee. When BM knows that my in laws are using their time with her to take her to see us or other family, BM threatens to take Bee away from them as well.\n\nMy husband and I still love and care for Bee. But we know that things are not the same between her and us anymore. We barely know her now. But the few times we do see her, we still treat her like family even though she doesn't really talk to us as much. We didn't cut her out of our lives, she was taken away from us by BM.\n\nRay doesn't see Bee as a sister right now. She just says Bee is her sister because that is what she is being told to by others. Ray doesn't fully understand what a sister is. She often times calls some of her friends or cousins sister.\n\nWhen Ray was born, we told my in laws that for now, we would like them to no try to tell Ray that Bee a sister but more of like a close family friend. But now that Ray is getting older, they are telling her Bee is a sister.\n\nMy husband and I are going to tell Ray of who Bee really is to us and the family and the situation around all that. This whole thing a just a big messed up complicated situation that'll be difficult to try to explain to a 5 year old. Yes I know kids are smart, but also every kid is different and comprehends things differently. Which is why I said we wanted to wait till she is a bit older and can understand these things better. And why we wanted Ray to see Bee as a family friend first. We were never planning on lying and keeping all this info from her. Later on, Ray can decide herself how she sees Bee as.\n\nI know we don't really have a say in how the family and Bee handles everything. But we do have a say in how it can be handled in our daughter's situation. We do plan on talking to Ray(to a certain extent as to where she can understand) soon, especially now that the sister topic is coming up more frequently.\n\nI'm sorry if all this is still doesn't make sense and that others don't agree with how I'm handling this. I've tried to explain the whole ordeal as best as I can. There is still so many things I can say but that'll just make this post longer than it already is.  \nWe know that not everyone that is involved in this situation will be happy with how we handle things, whether it is his family or Bee. But our priority is our daughter, Ray, and we will do what is best for her.  \nThank you all for your input. My husband and I will try to handle this as best as we can.\n\n[https://www.reddit.com/r/dustythunder/comments/1dqfc2u/aitah\\_for\\_wanting\\_to\\_tell\\_my\\_in\\_laws\\_to\\_not\\_tell/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/dustythunder/comments/1dqfc2u/aitah_for_wanting_to_tell_my_in_laws_to_not_tell/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
        "num_comments": 5,
        "comments": [
            "You are handling it the best for your family.  Good luck to\nYou",
            "As an adult reading this it was confusing but I reread and understood.   I wish you luck finding a child friendly way of explaining to your daughter so that she can comprehend.   \n\nYour ILs are AHs for putting you in yhis situation.",
            "I was baffled at the low comprehension of a lot of people reading the original post. So many misunderstandings and blaming you and your husband for a situation not in your control.",
            "I dont know how so many people had missed the obvious information that Alex was not the biological father.\n\nI still stand by what I said before (that I doubt you saw but might now!) that children dont have the same understanding of what is socially complex as us and its easier to build more understanding upon the truth than admit you told a lie. Rae probably already understands girlfriends and boyfriends in a loose sense so you can explain that daddy and BM used to be gf/bf when Bee was a baby and because of that Alex helped take care of bee and acted a bit like an extra dad even though he isnt. When you and daddy got married Bee used to come and stay a lot so Bee saw both you and daddy a bit like and extra mum/dad. However now shes older you dont see her as much (you might need an answer prepared for why? - could be something along the lines of BM no longer needs the extra help now Bee is older, or because its been a long time since daddy and BM were gf/bf, Bee is just more grown now might even suffice). Thats why some people say shes your sister even though shes not an actual sister and its fine for her to call Rae whatever she wants.\n\nWhat you present as not complicated to a child will seem non complicated to a child! Being told by different people she is, or is not a sister with no context is much more likely to be confusing to her!\n\nBest of luck, and sorry you guys had Bee taken away from you, that must have been heartbreaking for Alex especially",
            "OP, both your original post and this update are very clear. Your inlaws are overstepping with Ray in a big way and are causing nothing but confusion. You are handling things very well. I just wanted to share a tip. I am an adoptive mom of 3, and we are very open about it with our kids. The older 2 came together and are full siblings. The youngest joined later and is a half sibling (same birth mom). Although we as a family don't say half brother or consider him differently, he is biracial, and the rest of us are Caucasian. When he joined the family, they were 5 and 3, I drew out a family tree to help the older two understand the dynamics. As they have gotten older, I have expanded this to include the fact that there are actually other older and younger maternal and paternal half siblings, but that's another story. Art/visuals are a great way to help little kids understand these things. Using dolls is another idea. You are doing great. It must have been so hard to have Bee be pulled out of your lives like that, and for Bee too. I wish you and your family all the best."
        ]
    },
    "AITA for not telling my husband I’m leaving until after I moved out?": {
        "title": "AITA for not telling my husband I’m leaving until after I moved out?",
        "score": 436,
        "url": "https://www.reddit.com/r/dustythunder/comments/1dqenqk/aita_for_not_telling_my_husband_im_leaving_until/",
        "content": "So as the title says I recently left my husband of 14 years.  I moved out with the kids while he was at work.   His prior actions led me to feel it might not be safe to tell him before.  It was also suggested by a domestic violence outreach worker to not tell him before.  (No he did not hit me.)  Since I left our only conversations have been by email and he has been very pleasant.  I know I did the right thing leaving the marriage.  But maybe I could have told him before and it would have been okay.  \n\nAITA for not knowing if it was safe to tell him before and leaving then telling him?",
        "num_comments": 117,
        "comments": [
            "I am so pleased you listened to the outreach worker and got out safely.\n\nI wasn't physically assaulted until after I escaped.",
            "You were advised to leave safely, which you did, been there, NTA.. you know that leaving a DV relationship is the most dangerous time.. thats exactly when things -can- get dangerous.",
            "Never feel guilty for protecting yourself, and your children. There is a reason you reached out to a domestic violence worker for advice. You knew nothing your guy it could be dangerous. Never meet him anywhere alone, and always communicate in writing (text,email). If he demands a phone call, record it. Always keep documentation of every conversation.",
            "If he was already showing all the hallmarks of an emotional/psychological/financial abuser, that last step to being a true, physical abuser wouldn't have seemed so big for him. Especially if it was during your \"breaking up of his family\" as I'm sure he views it. NTA",
            "As someone with an unfortunate amount of experience with domestic abuse, it sounds like you trusted your instincts as a mom, and as a human who deserves to feel safe, and be safe, so don't second-guess the gut reaction that led you to leave with your children in as safe a way as possible.",
            "If this was the advice you were given, why feel guilty? I guess it was a necessity. I also assume he communicates this 'pleasantly' in order to lure you back.",
            "Honey I remember the posts you deleted from r/abusiverelationships. You did the right thing and I am so proud of you! \n\nYour ex is only being pleasant at the moment because 1.) its through email and he knows that there is the possibility of court dates coming in the future and 2.) He may be wanting to slowly love bomb you into returning. Your ex isolated and abused you even if he technically didnt hit you. I wont repeat anything that was in your deleted posts, but with his history you and I both know that you did the right thing. His past gaslighting is clouding your judgement on this. You did everything right! So proud of you honey!",
            "NTA. You don't know it would have been safe even now.",
            "NTA you go out safely and thats all that matters.",
            "In email and text- the abuse can be proven; he knows that."
        ]
    }
}