{
    "Philadelphia Eagles' 2024 Schedule": {
        "title": "Philadelphia Eagles' 2024 Schedule",
        "score": 524,
        "url": "https://i.redd.it/2y0ed84xio0d1.jpeg",
        "content": "",
        "num_comments": 232,
        "comments": [
            "Obligatory fuck Ticketmaster and fuck Dallas",
            "Whoever chose to do this in rows instead of columns, your moms a hoe. I glossed over the dates at first and was like damn we got Dallas early this year",
            "5 away games in those first 8 weeks is going to be interesting.",
            "We get the foreign game AND week 5 bye? The fuck is that",
            "Some of these opponents (Cinny, maybe Pittsburgh) could be better than last season, but overall this seems like a considerably easier schedule, opponent-wise",
            "We have 1pm games again.  Praise the lord",
            "The Brazil game and the super early bye aren’t fantastic. But I like that the games against the cowboys are both afternoon games. Regardless of the outcome, I am getting drunk as fuck.",
            "Love the 4 homes games with the away game being to shit ass Fed Ex to close the year",
            "Bye week week 5 is horse shit",
            "I am getting married on Nov. 10th starting around 5pm. Literally the worst possible scenario, I was hoping for a random 1pm opponent😭"
        ]
    },
    "Swag Saturday": {
        "title": "Swag Saturday",
        "score": 2,
        "url": "https://www.reddit.com/r/eagles/comments/1dr7t6u/swag_saturday/",
        "content": "Pictures of jerseys, crafts, pets, etc. can be posted on Saturdays only (but do not have to be posted in this thread).",
        "num_comments": 0,
        "comments": []
    },
    "2024-25 Kelly Green games!": {
        "title": "2024-25 Kelly Green games!",
        "score": 252,
        "url": "https://i.redd.it/tx2ctb3mwb9d1.jpeg",
        "content": "",
        "num_comments": 30,
        "comments": [
            "So Nick Foles retires as an Eagle during a kelly green game.",
            "Only having it for 2 games is a joke.",
            "Week 17 gonna be crazy.",
            "We're over from the UK for the Jags game. Hell yes.",
            "I like the jags, but week 17 is lame",
            "Am I the only one who hates these dates? I mean its more likely than not that week 17 doesn't even matter and who cares about the jacksonville game.",
            "Are they gonna announce if we will wear the black helmets again?",
            "Oh awesome! I'm going to my first game ever and it happens to be the Jags game. Nice!",
            "My first ever Eagles game will be the Jags, I guess I’ll need to buy a Kelly Green at the pro shop. I’m thinking Dickerson",
            "There a fine line between not using something enough and using it too much. If we wore it half the season, it would lose that special touch. Same reason Mcd’s doesn’t serve shamrock shakes or the McRib all year long"
        ]
    },
    "10 reasons the Eagles will be a dumpster fire this season": {
        "title": "10 reasons the Eagles will be a dumpster fire this season",
        "score": 230,
        "url": "https://www.phillyvoice.com/10-reasons-eagles-will-be-dumpster-fire-season-2024/",
        "content": "",
        "num_comments": 75,
        "comments": [
            "I think he nails this. There is every reason to be optimistic about this season but it’s not out of the realm of possibilities that we’re not as good as we think for these exact reasons. Depth especially. I feel like a lot of fans are overlooking how impactful Reddick has been for us and how unproven Huff is overall",
            "I do not remember the Lavonte David and Okereke situations.\n\nI keep forgetting how much infighting there was with the players themselves. Have to hope that's been completely resolved.",
            "As an Philly expat living in the UK, I look forward to this series of articles every year.",
            "If you're downvoting this, know that Kempski does this for every team in the NFCE.\n\nThe points he raises are all fair. This is, of course, the worst-case scenario for this team. Kinda surprised he didn't mention the possibility of Saquon being spent.",
            "I love Jimmy Kempski. He’s been doing his “dumpster fire” series for all the NFC East teams for a decade and they’ve only gotten better each year. Pisses me off each year, but helps ground me. He’s my favorite Eagles writer.",
            "Oof that article was brutal. Time to read the other NFC east ones in the series for the morale boost.",
            "I really, really liked the Eagles approach to the defensive backfield this offseason. Howie and Co. clearly looked at the state of the roster at the end of last year and said that isn't acceptable, bringing back Gardner-Johnson, and drafting Mitchell and DeJean to go along with Rodgers post-reinstatement.\n\nBut god damn I really hope that can cover up those linebackers.",
            "I'm terrified about our depth at LB and D-line. even one of our pass rushers goes down we're fucked. And I don't even know where to start with our LBs",
            "Kempski is a  sadist.\n\nI legit think it brings him joy doing the eagles last so we go into the weekend angry.  And I love it.",
            "Impossible. We were 10-1 in spite of our terrible OC and DC last year. We will make the Super Bowl vs the chiefs and hopefully stop them from a three peat. We will be playing indoors so they cant fuck the field up this time."
        ]
    },
    "[Eagles] Save the dates ‼️  @FanDuel | #FlyEaglesFly ": {
        "title": "[Eagles] Save the dates ‼️  @FanDuel | #FlyEaglesFly ",
        "score": 75,
        "url": "https://x.com/eagles/status/1806704126966804621?s=46",
        "content": "",
        "num_comments": 26,
        "comments": [
            "Spanking Dallas in the Kelly green will be Tough🔥",
            "I’m sorry Dougy I still love you . But you’re going to see what that Kelly do.",
            "I don’t like us wearing it in a game where the starters are probably sitting out in preparation for the playoffs",
            "Week 17 gonna be crazy at the Linc🤪",
            "Hash tags work on reddit?",
            "Dallas should always be in blue in Philly.",
            "I get Dallas have but Kelly Green vs expansion team?  Should’ve  been Browns game",
            "Let’s gooo 🦅🦅 IMO, I think it would be cool to go back to the Kelly Green full time, and do the Black Out(w/Black Helmets) games twice a year",
            "This is cursed.  The last time we wore Kelly green against Dallas they were in the middle of a dynasty and we sucked",
            "Week 17 is the second to last week of the season now, it’s week 18 where starters rest now. This is potentially the most important game of the season with division stakes."
        ]
    }
}