{
    "Monthly /r/ebikes promo thread": {
        "title": "Monthly /r/ebikes promo thread",
        "score": 4,
        "url": "https://www.reddit.com/r/ebikes/comments/1dh12re/monthly_rebikes_promo_thread/",
        "content": "This  thread is for anyone selling ebike products or services. Our posting  guidelines do not apply here; sellers can directly link to product  pages, provide updates and coupon codes, advertise ebay auctions and  crowdfunding campaigns and do other promotional activities without  worrying that it could be seen as spam.\n\nFront page posts are still acceptable for sellers to post actual news, articles, reviews, blog posts, videos and pictures. But if it is clearly marketing then it probably belongs here. Regular readers can of course create new threads to ask about anything posted in here. \n\nNote for [/r/ebikes](https://www.reddit.com/r/ebikes)  readers: Posts here do not constitute endorsement by anyone, use your best judgement and ask around to find out what is right for you.",
        "num_comments": 11,
        "comments": [
            "DM me for a coupon code for Velotric bikes that will save you 10-15% on an online Velotric ebike order on almost all models (On the Fold 1 you can get a free front basket that retails for $89.99). I have 5 Velotric ebikes and love them all! I can't post the code publicly since it's better than the usual flat $60 codes that are typically available.",
            "Does anyone own a Jackrabbit e-bike?",
            "When is Talaria xxx Black edition coming back to stock at Luna cycle ?",
            "Do you still have a code for the Velotric Discover 2. There prices went up; wondering if there are still any discount codes for it. Thanks,",
            "Introductory priced from only $2195",
            "How much?",
            "The new 2025 Cyberbike eMTBs are all mullets. New sealed bearing suspensions linkage, our in-house designed upside down forks, 750 peak watt motor, standard dropper seatpost. High performance, high quality, and an excellent value.\n\nhttps://preview.redd.it/7yofyjhdsj8d1.png?width=1566&format=png&auto=webp&s=65fa9af3981822b1e37b92f4fafb0b418efeb4d5\n\n[www.Cyberbike.com](http://www.Cyberbike.com)"
        ]
    },
    "1st e bike.I’m in love!": {
        "title": "1st e bike.I’m in love!",
        "score": 7,
        "url": "https://www.reddit.com/gallery/1drbcdj",
        "content": "Well, not the first since my buddy a few years back gave me his old e bike that was quickly stolen from my gated complex that same week. I did get a chain lock this time. However I’m still worrysome even though I’m going to be storing it safely at work and home for the majority. Anyway, I wanted to say thanks to everyone here at r/ebikes in their e bike wisdom as I was just a lurker in the sub. ",
        "num_comments": 4,
        "comments": [
            "I have this exact bike. Just hit 500 miles on it. My biggest advice is to get some thread glue and check every nut and bolt to make sure it's secured. This bike has a habit of dropping things off while you're riding. Most of the accessories are attached using metric bolts so if you lose them don't use standard bolts to replace them or you're damaging the threads.\n\nI really love the look of this bike, and with some elbow grease it can be a really sweet ride. I get compliments on it all the time.",
            "Thanks so much for the advice. You have good taste I also love the look of this bike. Metric bolts, got it! This bike was right in my budget and so I know it may not be the best out there but for my budget it was the one. 500 miles! I did 15 today, I cannot wait. Cheers",
            "Bg10 looks good ",
            "![gif](giphy|e2QYPpUe8WmpG)"
        ]
    },
    "Most over priced Ebike in the world": {
        "title": "Most over priced Ebike in the world",
        "score": 4,
        "url": "https://i.redd.it/0exibgq55j9d1.png",
        "content": "I just picked up this Jetson Haze on marketplace brand new for $400. \n\nSame bike cost over $3000 on Amazon....wtf\n\nSold out everywhere else...but that's still rediculous.",
        "num_comments": 6,
        "comments": [
            "You got ripped off at $400",
            "Anyone who would pay over 5k for that bike is so dumb I can't find unoffensive words to describe them.\n\nEdit: 110x48= 5280 that's best case scenario assuming the number there includes the really sweet deal that adds 30% interest.",
            "I think its $3000 on Amazon because sellers are severely penalized if they sell something and its actually out of stock, or their listing & store isnt promoted as much if shown as out of stock, so when they have 1 left they just price it as 5-10x.",
            "It was a little steep but the perfect starter Ebike for my wife... virtually new and surprisingly good for the price. \nI need to upgrade a bunch of stuff, brakes, pedals, seat... eventually tires.  But not super upset about the price.",
            "How so? I got mine for that much refurbished, and it was in excellent condition.\n\nHard to find anything else good and like new at that price point.",
            "That's fricken AMZON FFS (Becoming one of the biggest scam sites on the net)\n\n[https://ridejetson.com/products/haze-folding-electric-bike](https://ridejetson.com/products/haze-folding-electric-bike)"
        ]
    },
    "Homie following me on the trusty eBike": {
        "title": "Homie following me on the trusty eBike",
        "score": 24,
        "url": "https://v.redd.it/6ycw0u2otf9d1",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Nice trail. Where is it? Looks like Rifle area.",
            "That's so cool but also am I only only person that thinks normal bicycle helmets are a bit minimal for this? I rode with a full on helmet",
            "Fire in the mountain - new castle CO",
            "Full face is always the safer option",
            "Ah It's a black run, too intense for me lol. I live a few minutes away",
            "Scenic af"
        ]
    },
    "Lost keys": {
        "title": "Lost keys",
        "score": 3,
        "url": "https://i.redd.it/sat6cybt1j9d1.jpeg",
        "content": "I lost my keys, yes both, I never took them apart because I’m stupid. My post earlier in the week said I bought it third hand this having only one key, I didn’t, I just didn’t wanna sound stupid for losing both keys. So stop saying I stole it. I’ve contacted my support for the bike from the company, given them my info, such as my receipt. They told me to call a locksmith, and I felt don’t have a ton of money for a locksmith, how can I pick my own lock. \n They’re telling me to remove the battery to receive a cylinder ID. I’m having trouble trying to pick it myself. It’s requiring to push into the cylinder to unlock, and I’m having trouble keeping tension ",
        "num_comments": 7,
        "comments": [
            "Is it a tubular lock or a standard cylinder lock?",
            "I believe a cylinder. Takes an actual full key. I have to push the cylinder into the battery to unlock it and such",
            "Gotcha, yeah you might be able to get away with using a cheap snap gun on them, especially if you don't care about the lock.",
            "Only reason I gotta kinda care for it is cause its not fully mine its my father in laws. Idek how the keys were lost fully. I was there but saw them and then didnt.",
            "Right but I assume once you get the lock out you're replacing it right?",
            "Ok, then I'd still snap gun it open and get them that info.",
            "So they mentioned to me while I was talking to support, that the bottom of the battery would have a cylinder code, for me to get replacement keys. So I was trying to unlock it from the frame and hopefully get that code."
        ]
    }
}