{
    "We are Alexandre Tanzi, Michael Sasso and Jennifer Epstein and we cover mortgage rates and real estate at Bloomberg News. Ask us anything!": {
        "title": "We are Alexandre Tanzi, Michael Sasso and Jennifer Epstein and we cover mortgage rates and real estate at Bloomberg News. Ask us anything!",
        "score": 21,
        "url": "/r/AskEconomics/comments/1dcjgsc/we_are_alexandre_tanzi_michael_sasso_and_jennifer/",
        "content": "",
        "num_comments": 10,
        "comments": [
            "If you want to ask a question, make sure you do it in the AskEconomics thread! **Questions here will not be seen or answered.**",
            "Classical economics dictates that as the cost of money (ie: interest rates) increases, the price of goods should be under pressure, but this is not what we have seen in the housing markets. In the 4 years from 2Q 2016 to 2Q 2020, 30 year fixed rates went from 3.54% down to 2.98%. At the same time, median US home prices went from $306,000 to $317,100, a CAGR of about  +0.9%.(Using FRED data).Pretty much in line with classical economic expectations.\n\nHowever, from 2Q 2020 to 2Q 2024, 30 yr fixed rates went from 2.98% to now around 7.60%. In this same time, median US home prices have risen from $317,100 to $420,800, a CAGR of over 9%. \n\nI understand the covid effect for some of this, but the rate of price appreciation has continued on past the end of lockdowns. Additionally, if this was due to a demographic shift out of cities to suburbs, why are median rent prices in cities continuing to increase at strong rates, with NYC median rents +4.3% in 2023, and rising a further +5.4% in 2024.\n\nDo interest rates even matter right now? Have demographics broken the interest rate mechanism? At what point does affordability, taking into account the impact of higher rates, start to weigh on prices?",
            "Hi all,\n\nA reminder that comments do need to be on-topic and engage with the article past the headline. Please make sure to read the article before commenting.  Very short comments will automatically be removed by automod. Please avoid making comments that do not focus on the economic content or whose primary thesis rests on personal anecdotes. \n\nAs always our comment rules can be found [here](https://reddit.com/r/Economics/comments/fx9crj/rules_roundtable_redux_rule_vi_and_offtopic/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Economics) if you have any questions or concerns.*",
            "20 Percent of Commercial and Multifamily Mortgage Balances Mature in 2024 according to reports by the MBA, how does this factor into the credit cost and availability for a first time home buyer?",
            "Furthermore, what does this increase in housing costs mean for younger first time homebuyers? What does it mean for their ability to build wealth, save for retirement, have expendable money, build generational wealth, etc? Seems to me that their lifetime trajectories are going to be very, very different than those of their predecessors - parents, grandparents, etc .",
            "Houses have generally risen with inflation. And wages do too. Once the fed has a recession or cuts rates the houses will be affordable again. \n\nThe gen z that are complaining but it's nothing to the recessio of 2008 a whole gen losing 10 years of earnings and promotions. \n\nIt's a simple extra 1-2 years of renting while having normalized or higher than avg wage growth due to low unemployment",
            "Something about owning nothing and being happy I reckon."
        ]
    },
    "Europe Has a New Economic Engine: American Tourists": {
        "title": "Europe Has a New Economic Engine: American Tourists",
        "score": 489,
        "url": "https://www.wsj.com/world/europe/europe-tourism-economy-american-tourists-f6112f78",
        "content": "",
        "num_comments": 297,
        "comments": [
            "Hi all,\n\nA reminder that comments do need to be on-topic and engage with the article past the headline. Please make sure to read the article before commenting.  Very short comments will automatically be removed by automod. Please avoid making comments that do not focus on the economic content or whose primary thesis rests on personal anecdotes. \n\nAs always our comment rules can be found [here](https://reddit.com/r/Economics/comments/fx9crj/rules_roundtable_redux_rule_vi_and_offtopic/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Economics) if you have any questions or concerns.*",
            "Its not in the EU, but visiting my in-laws in Turkiye once a year has never been easier. Groceries, dining out, entertainment, etc are all 50% what you'd pay in the US.",
            "The reason European is so \"affordable\" now is that their economy hasn't kept up with America's\n\nOf course food, travel, etc. is cheap if everyone there makes half and much money as an American. \n\nThis is the same energy as someone going to Mexico or Vietnam and being like \"wow the food is so cheap and good\". \n\nI think people are just surprised now because Europe wasn't always this cheap.",
            "Just getting back from my second trip to France, been to Portugal and Iceland as well. It’s pretty great over there if you have disposable income.",
            "My sister and her husband are both nurses and make bank and have no kids.. so they go to europe all the time and little always say how cheap it is over there. Also being dual income no kids let’s you spend your money more freely on vacations and such. I feel a lot of millennial couples are dual income no kids and are helping the economy in the US chug along",
            "A couple could fly to Europe, eat 1 million times better, see old cool shit, and have even better experience compared to 1 week at the  New Jersey shore. Take your pick.",
            "Yeah that's not really a great thing. Lower economic competitiveness driving people from higher economic competitiveness markets to seek you out for relative value is not a desirable position to be in.",
            "lmao ive been saying it for months now. we are slowly but surely becoming a continent sized disney land for our american and chinese friends. it is what it is i guess",
            "Honestly the only cost difference between vacay Italy and a vacay in the us(being located in the us) is the airfare. I’d rather spend the extra $800 airfare to travel to Italy, rather than anywhere in the us. Accommodation, food and transport are comparable if not cheaper.",
            "I'm a Canadian currently visiting Poland.\n\nI have 3 times the buying power here. My future in-laws paid the equivalent of $200K for their very posh condo which back home would have been $2M easy.\n\nI just paid $8 for a fancy breakfast which back home would have been about $25 plus tip.\n\nYeah, I'm coming back alright lol."
        ]
    },
    "Why going cashless has turned Sweden from one of the safest countries into a high-crime nation": {
        "title": "Why going cashless has turned Sweden from one of the safest countries into a high-crime nation",
        "score": 489,
        "url": "https://fortune.com/europe/2024/06/21/why-going-cashless-has-turned-sweden-from-one-of-the-safest-countries-into-a-high-crime-nation/?utm_source=search&utm_medium=suggested_search&utm_campaign=search_link_clicks",
        "content": "",
        "num_comments": 126,
        "comments": [
            "Hi all,\n\nA reminder that comments do need to be on-topic and engage with the article past the headline. Please make sure to read the article before commenting.  Very short comments will automatically be removed by automod. Please avoid making comments that do not focus on the economic content or whose primary thesis rests on personal anecdotes. \n\nAs always our comment rules can be found [here](https://reddit.com/r/Economics/comments/fx9crj/rules_roundtable_redux_rule_vi_and_offtopic/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Economics) if you have any questions or concerns.*",
            "Zelle in the US is similar in the sense that you can make a digital transaction that transfers money from your bank account to another person's bank account. Unlike credit or debit cards, there's no fraud protection, so it's basically like cash. Zelle scams are already a problem in the US.",
            "Here, let's make this article short and simple:  Sweden uses a system called BankID for online transactions and apparently it has a shit-storm implementation that makes social engineering and phishing style scams incredibly easy.",
            "> “The fraudsters are so skilled at making things look legitimate,” said Bagley, who was born after BankID was created. “It’s not easy” to identify scams.\n\n\nHow is that not just…. Plain old fraud by scammers? \n\nHeadline is just pure click-bait… [crime in Sweden is low](https://www.macrotrends.net/global-metrics/countries/SWE/sweden/crime-rate-statistics) by any measure…",
            "They can't track the money being stolen why?  They should force companies to have to register a BankID to take money from their customer BankID and the problem would be solved, no?\n\n\nSeems as though very little thought was put into how to prevent fraud and I wonder if they did that on purpose.",
            "Such a bullshit article. BankID is fine, jt shows you clearly what you're authorising. The example they quote is someone falling for a fake website, I fail to see how that is anything special for Sweden nor linked to BankID. \n\nYou could have the same issue with literally any other payment method and obviously you cannot pay by cash on a website, so what is the connection?\n\nYes Sweden has issues with crime, violent crime is on the rise. However this has nothing to do at all with the countries move away from cash. Digital scams are a thing but not more-so due to BankID",
            "This is just an ordinary scamming story that has nothing to to with cashless?\n\n\nHere is another take on it: https://www-tv4-se.translate.goog/artikel/7BTll75Y5ekFxtM6ySkI85/ellen-lurades-pa-populaera-appen-loggade-in-sedan-var-allt-borta?_x_tr_sl=sv&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=wapp\n\n\n\nThe messages she got translated into English:\n\n> Hello! I am a technical support employee of Vinted payments. Your buyer has already paid for the product and shipping. To confirm the transaction and receive the money, you must click on the \"Collect money\" button. \n\n\n> On this page, you must enter your credit or debit card details for Visa/Mastercard so that we can send the money the buyer has paid to your account. After entering your details, check that you haven't made any mistakes. Thank you for your attention. \n\n\n> Your information has been processed. NOTE - do not close or minimize the page until you have received new [instructions].\n\n\nPerplexity says that this is a scam when I used it to translate: \n> I must warn you that this text appears to be a scam attempt. Here's the translation, but please be very cautious.\n\n\n>This message exhibits several red flags typical of phishing scams:\n\n>    Asking for credit card details to receive money (this is not how legitimate transactions work)\n>    Creating a sense of urgency\n>    Requesting sensitive financial information via an unsecured method\n\n> Please do not provide any personal or financial information in response to such messages. If you're using Vinted, contact their official customer support through their verified channels to confirm any transaction-related matters.",
            "> “The fraudsters are so skilled at making things look legitimate,” said Bagley, who was born after BankID was created. “It’s not easy” to identify scams.\n\nHuh?  In this case seems to be easy to prevent, they get a notification right now, in a two-factor authorization scheme. Is there a bank transaction right now?  Yes or no.\n\nIt is harder in the world of credit cards when some companies don't manage the information correctly and a credit card transaction appears out of nowhere, and it doesn't require confirmation.",
            "False headline?\n\nThe transfer to secure digital services for payment could  have led to a reduction in crime, but at the expense of average interaction time per transaction. At the date of design, the system lags, slow interfaces, and lack of user experience will all have caused delays at critical infrastructure bottlenecks. Like getting on a tram, or passing barriers into subways.\n\nSo a poor decision was made: to maximise throughput, minimise complexity for the public user, and reduce security.  \n\nThat decision is now playing out in a regrettable but entirely predictable way. That decision gave the benefits to the operators and the state service providers and laid all the risk and costs on the public.\n\nThe headline could have been “why going cashless in a lazy cheap fast but insecure way has turned Sweden … etc”",
            "It has nothing to do with going cashless. \n\nUnless the article is actually arguing against any digital purchases - which would be intellectually honest way to frame the article - it has very little to do with cashless societies. \n\nDigital fraud is a reality where digital payments are available, regardless of the percentage of hard cash in circulation."
        ]
    },
    "Millennials are so broke they’re ruining their parents’ retirements": {
        "title": "Millennials are so broke they’re ruining their parents’ retirements",
        "score": 218,
        "url": "https://metropost.us/millennials-are-so-broke-theyre-ruining-their-parents-retirements/",
        "content": "",
        "num_comments": 120,
        "comments": [
            "Hi all,\n\nA reminder that comments do need to be on-topic and engage with the article past the headline. Please make sure to read the article before commenting.  Very short comments will automatically be removed by automod. Please avoid making comments that do not focus on the economic content or whose primary thesis rests on personal anecdotes. \n\nAs always our comment rules can be found [here](https://reddit.com/r/Economics/comments/fx9crj/rules_roundtable_redux_rule_vi_and_offtopic/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Economics) if you have any questions or concerns.*",
            "> 27% received at least $25,000 in financial help.\n\nSo over 70% received less than that, and that includes help with college.\n\nImo the real news story is that <27% of millennials receive more than 25k for college from their parents.",
            "\"Overall, about 16% of parents reported significantly putting off hitting other financial milestones in order to prioritize their children’s financial needs.\"\n\nMy parents made the decision to fund my youngest sister's college education at a private university. Long story short, she dropped out after a year but the debt was still there. My parents had divorced by then but both were still on the hook for paying some of that debt. The lesson I learned was never to co sign on a college loan because I saw the financial issues it can cause.",
            "If only Millennials actually got paid more so they don’t go broke and can actually afford things like buying a house or not worry about living paycheck to paycheck. Guess it’s all those damn avocado toasts. ",
            "Money is 'supposed' to pass from older generations to younger generations. Instead it's being syphoned away from families by the healthcare and retirement industries as people live longer.\n\nSo we if anything the article's premise is backwards. Old people used to retire into the households of their children and pass down generational wealth in the middle class.",
            "That’s a funny way of saying “boomers and gen x robbed the future from millennials and now they’re suffering the consequences of their own actions”",
            "Damn your parents have retirements?\n\nFor the automods, the rain in Spain does not, in fact, fall mainly on the plains. Fite me. I’m not a meteorologist so I can’t prove or disprove my statement without taking the extra time to google my unproven fact, which I unabashedly shall not. However, this article is clickbaity af so I don’t know why we engage.",
            "The parents are ruining their own retirements by supporting/bailing out their children. It would be more interesting to know what the millennials need the funds for, rather than where the parents pulled the money from.",
            "I’m a millennial, pushing 40, and I receive help from my in-laws and father. It’s usually a few hundred dollars here and there, almost always because we need something for our children that we can’t afford with our wages. \n\nAnd to be clear, we don’t live extravagant lifestyles. We own a home, but it’s modest (we pay less for our mortgage than a lot of renters), we have one car, and if we take a vacation, it’s usually some place close that we can drive to. \n\nMy recent biggest expense that recently put us in the hole? Summer camps for our kids. Groceries too have just gotten insanely expensive the past few years. I make okay money, but it’s not enough when my annual raise was 2.5% and the grocery bill nearly doubled while buying all the same things. \n\nI suppose we could ask our kids to drop all their extracurriculars… but I don’t want them to hit adulthood and not have had the chance to do anything. Maybe that makes me irresponsible, but I’m not alone in having to make these kinds of decisions.",
            "I like how “your parents” should help with college lol. My parents didn’t pay for shit unless it was helping to keep me alive since it was their obligation to before the age of 18."
        ]
    },
    "The U.S. Drops Out of Global Competitiveness Top 10": {
        "title": "The U.S. Drops Out of Global Competitiveness Top 10",
        "score": 331,
        "url": "https://www.statista.com/chart/30231/the-worlds-most-competitive-economies/",
        "content": "",
        "num_comments": 226,
        "comments": [
            "Hi all,\n\nA reminder that comments do need to be on-topic and engage with the article past the headline. Please make sure to read the article before commenting.  Very short comments will automatically be removed by automod. Please avoid making comments that do not focus on the economic content or whose primary thesis rests on personal anecdotes. \n\nAs always our comment rules can be found [here](https://reddit.com/r/Economics/comments/fx9crj/rules_roundtable_redux_rule_vi_and_offtopic/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Economics) if you have any questions or concerns.*",
            "Completely uncompetitive on a global scale if you count out medical & pharmaceutical research, aerospace, AI, tech, energy, and academic research",
            "Frankly it will always be difficult to compete with what are essentially City-States with some extra land. \n\n\n\nThis accounts for Economic Performance, Government Efficiency, Business Efficiency and Infrastructure. \n\n\nI'm sure if Massachusetts was a county it would be near the top, while we have vast swaths of the US that bring our average down in many categories. \n\n\nThe US is #1 on their Economic Performance ranking, 34th on Government Efficiency (26th in 2020), 19th in Business Efficiency, and 7th in Infrastructure. ",
            "Didn’t I read last week that the world bank was saying that America’s economy was lifting up the global economy? all this just seems like horseshit",
            "So the country that is in the forefront of AI, aerospace, research & development, business and economics is less competitive than those countries in the top 10? Lmao yeah ok",
            "Crazy that a metric designed for how quickly economies can change won’t rank any countries in the top-70 of population. Seems kind of tautological",
            "So says a company with Hdqt. offices in Singapore, and Switzerland, and development in China. Competitiveness can be defined very subjectively.",
            "Why is social cohesion a factor in competitiveness.\n\nOpenAI, NVIDIA, SpaceX are just 3 examples of American companies developing new technologies that are changing the world and creating new markets that have never existed before. What has Singapore created lately?",
            "> While that may sound bad considering the United States’ status in the world, it still makes the U.S. the highest-ranked among the world’s largest economies with China and Canada the only other top 10 economies (in terms of nominal GDP) to make the top 20 in the 2024 Competitiveness Ranking.",
            "So in a ranking of economies published by a school in Switzerland the Swiss manage to rank #2 when it comes to \"competitiveness\" which they define as ... well I don't actually see where the explicitly define it and it sure sounds like a mix of statistics and qualitative statements that may be sort of up to whoever is making the list.\n\n\nIn short, like most articles posted on this sub this one is, again, unmitigated horseshit."
        ]
    }
}