{
    "Fancy Friday: Show off your new blingin' pickups! - June 28, 2024": {
        "title": "Fancy Friday: Show off your new blingin' pickups! - June 28, 2024",
        "score": 0,
        "url": "https://www.reddit.com/r/EDH/comments/1dqf6f7/fancy_friday_show_off_your_new_blingin_pickups/",
        "content": "Welcome to Fancy Fridays!\n\nPlease use this thread to show off your new card pick-ups, foils, alters, and general EDH accessories & accouterments.  \n\n\nLikewise, you may use this thread to ask questions or look for suggestions in finding your own accessories and tools!",
        "num_comments": 4,
        "comments": [
            "Shiny Etch Foil \\[\\[Elsha of the Infinite\\]\\] for Topdeck shenanigans deck.",
            "Aaaand now I have to get one. God damnit.",
            "[Elsha of the Infinite](https://cards.scryfall.io/normal/front/c/0/c0728027-a1ec-4814-87c4-10c3baced0e0.jpg?1673148571) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Elsha%20of%20the%20Infinite) [(SF)](https://scryfall.com/card/2x2/208/elsha-of-the-infinite?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/c0728027-a1ec-4814-87c4-10c3baced0e0?utm_source=mtgcardfetcher&format=text) [(ER)](https://edhrec.com/cards/elsha-of-the-infinite)\n\n^^^[[cardname]] ^^^or ^^^[[cardname|SET]] ^^^to ^^^call",
            "[Aven Mindcensor](https://imgur.com/gallery/geC980j)"
        ]
    },
    "Commander that wants to die?": {
        "title": "Commander that wants to die?",
        "score": 72,
        "url": "https://www.reddit.com/r/EDH/comments/1dr252d/commander_that_wants_to_die/",
        "content": "Are there any potential commanders that want to die or have a game plan revolving around themselves dying or getting exiled? I'm a big fan of sacrifice / aristocrat decks and was thinking a deck centered around axeing your own commander would be pretty fun / unique. ",
        "num_comments": 300,
        "comments": [
            "[[Hidetsugu and Kairi]]? Every ETB you get to dig, and every death it's potentially a free spell?",
            "\\[\\[Slimefoot and Squee\\]\\] This is my favorite. Especially if you like recursion. you can do some silly stuff. You def want him dead though in your graveyard.",
            "\\[\\[Elenda the Dusk Rose\\]\\] is exactly what you are looking for. Aristocrats that gets you a massive amount of tokens. She got way better when they changed the rule for commanders dying",
            "[[Juri, Master of the Revue]] \n\nDude gets counters when you sacrifice permanents and then deals damage equal to his power to any target when he dies. He only comes in as a 1/1 but he only costs 2 to bring in first time so with enough sacrifice in the deck he can do some real damage over the course of a game.",
            "[[Piru, the Volatile]] my friend made a non combat damage trample deck",
            "[[Prossh, Skyraider of Kher]] is on the Jund healthcare plan.",
            "Kamigawa Dragons have death triggers they are pretty okay. I'm trying to build a [[Kura, The Boundless Sky]] deck but am having a hard deciding which route to go. I'm also very new so that doesn't help too.",
            "My GF built a kickass [[Jeleva, Nephalia's Scourge]] deck recently that always has me hesitating before I kill her. Every time she recasts, your opponents have to exile her CMC in cards off the library and then you get to cast nonpermanents for free every swing. When she's out of spells, sac her and go again.",
            "[[Slimefoot and Squee]] is my personal forever deck. Its so much fun to play, between milling myself by 50+ cards a game and sacrificing all my creatures for value when a board wipe happens just to have it all back in a few turns.",
            "[[myth unbound]] makes any green commanders death less painful."
        ]
    },
    "Whos the best treasure commander?": {
        "title": "Whos the best treasure commander?",
        "score": 42,
        "url": "https://www.reddit.com/r/EDH/comments/1dr2ovk/whos_the_best_treasure_commander/",
        "content": "I really want to pick the best of the best to build. I like Jan Jansen, but he doesn't have green, which cuts out Jolene and all the really good Gruul treasure cards. I love my Prosper deck, but that's not really treasures as the main focus. So who's the top dawg?",
        "num_comments": 151,
        "comments": [
            "Magda is probably the strongest. But its really too strong for most casual tables",
            "How has no one mentioned [[vihaan, goldwaker]] yet? I've seen this guy absolutely pop off multiple times at a table before",
            "Maybe instead just treasure your commander for who they are.",
            "Vihaan is extremely good in games I have played with him (higher power 7-8 level decks). He solves one of the weaknesses of Mardu and thats card draw due to being able to sac your treasures for card draw and mana.",
            "Rashmi and ragavan is my treasure deck",
            "Idk about strongest, but man I love [[Vihaan]]",
            "I actually enjoy Kenrith as my main treasure commander. Yeah he doesn't necessarily add to the treasure theme himself, but what better to have than a mana outlet in the command zone?\n\nPlus he gives you a way to recur your treasure makers should they meat an untimely demise. And we won't even talk about dockside loops...",
            "Mr house from the fallout set. He is such a fun commander and gets out of hand quick",
            "Ognis is the best treasure commander",
            "Make Meet and Greet Sisay legal WOTC!!!!"
        ]
    },
    "What's the hype behind Bloomburrow? ": {
        "title": "What's the hype behind Bloomburrow? ",
        "score": 223,
        "url": "https://www.reddit.com/r/EDH/comments/1dqp3eo/whats_the_hype_behind_bloomburrow/",
        "content": "I got into mtg this month because of the Fallout decks and I see everyone talking about Bloomburrow. Is there a reason everyone is so hyped about this? Is it just a deck about cute animals or is there some lore behind it that I can read somewhere? I'm trying to understand why people love it because I also want to love it since it looks so good",
        "num_comments": 361,
        "comments": [
            "New plane, no humans, all the \"guilds\" are different species etc. Has children's story vibes (specifically Redwall) and aesthetic which is interesting.",
            "I think it's also just looking to be pretty fresh for a set. No UB ips, a set featuring non-human characters, a new self contained plane after a lot of revisits last year, and it'll be nice and self contained. On that last point, I loved Thunder Junction but the amount of cameos was way too much, so it didn't even feel that new.",
            "For me? Seeing some proper mice. Also if youre coming from the fallout stuff you have to understand theres a huge difference between proper set releases and Universes beyond.",
            "Its hitting nostalgia for anyone who grew up reading Redwall. Its why I am hyped for it. Plus I want to make a squirrels deck.",
            "I am here for the Otters!",
            "Redwall nostalgia for me. This is the first set I think I'm going to make a point to drop some money on collecting as much as I can from it",
            "For me its the raccoon. I am very hyped for it, because i love me some trash bears.",
            "I personally dont care for Bloomburrows art or style, but a lot of people grew up with Secret of Nimh and Redwall. Hits hard in the nostalgia to them.\n\nI like the dark and gritty fantasy elements of Magic. Cant wait for Duskmourn!",
            "Cute as fuck critters is why I'm excited for it. Hoping I can finally get my wife to play",
            "I'm excited simply because it isn't mtg clue or cowboy hats on fblthp  .. \n\nSaved me a shitload of money this year however , thanks wotc . I haven't bought sealed product in ages ."
        ]
    },
    "60 vs 60 Archenemy Commander games will be over fast": {
        "title": "60 vs 60 Archenemy Commander games will be over fast",
        "score": 40,
        "url": "https://www.reddit.com/r/EDH/comments/1dr1b4u/60_vs_60_archenemy_commander_games_will_be_over/",
        "content": "I've played a lot of Commander Archenemy. One thing that was always difficult to calculate was how to adjust the life totals. I'm not sure how well [the new official Commander Archenemy life totals](https://magic.wizards.com/en/news/announcements/evolving-archenemy) (Archenemy 60 vs. the combined 60 life for the other players) are going to work at every table.\n\nWhat we'd do in my pod was give the Archenemy 100 vs each player with 40. This always felt like it worked, and games could go either way. We settled on 100 because bringing the totals up proportionally from 60-card Archenemy (40 life for the Archenemy, 20 for each player) seemed like it gave too little chance for the Archenemy at 80 life. But we also like grindy games, so 100 felt right (maybe that's not for everybody).\n\n60 vs. 60 seems like it's going to pop off one way or the other VERY quickly. Maybe that's the idea. But it doesn't quite seem like Commander at that point, and more like 1v1 with a huddle.\n\nWhat do you think?",
        "num_comments": 9,
        "comments": [
            "I'm excited to try it out!",
            "I was always really hit or miss on Archenemy because it felt you always needed to have someone as the Archenemy playing a kind of DM role and not just building a toxic stax + combo deck.\n\nAnd by the same measure, the players can't be playing combo decks.",
            "120 Life pooled between players vs 60-Life Archenemy with a bigger Scheme Deck would make more sense, honestly.\n\n60 vs 60 with 10 Schemes sounds like a serial killer hunting down unsuspecting targets very quickly.",
            "Our experience in the past was 80 vs 40 x 3. The archenemy had a very strong advantage with scheme deck. However, power creep means the players could be playing tuned decks which can go off fast now. Life was never really the issue when we played before. Archenemy won by pure dominance or a player managed to pull off a combo win. \n\nTo balance, we made it so the players werent teammates but I dont know if this would be beneficial or not today.",
            "It feels like a format that benefits a lot if you build a \"battle box\" for it. Tune a couple of decks that the Archenemy can pick between, a few that the team can pick from, and then balance them with each other. But if people avoid combo or stax you can probably just go for it and adjust the scheme decks to make the Archenemy weaker or stronger as needed.",
            "120 vs 60 is nuts, archenemy is already skewed towards the group at 60-40 in regular games. The schemes would have to be absolutely nuts, and the health would have to be individual.",
            "As someone who has been archenemy at the table many times, 60 life sounds like easy mode. I've regularly killed off each opponent around the same time when everyone starts at 40, with certain decks. I feel like any kind of Storm deck just laughs at only needing 60 life to kill your opponents.",
            "Honestly, this format has always sounded boring as fuck.\n\nIt seems like it turns out 1 of 2 ways:\n\n* 1 player taking glee in pubstomping everyone else.\n* 3 evenly powered decks teaming up against 1 other equally powered deck.\n\nNeither of those sound like fun in any way at all.",
            "It depends on how the scheme deck is constructed. I haven't played with mine in a hot minute but it was probably 70-30 in the archenemy's favor, and we did 60 for archenemy versus 40 individual per opponent.\n\n\nMy scheme deck is absolutely not perfectly optimized but if you have basically any that can get the archenemy ahead a little bit it gets dumb fast."
        ]
    }
}