{
    "Egg👥🚀irl": {
        "title": "Egg👥🚀irl",
        "score": 271,
        "url": "https://i.redd.it/zian7cmsuh9d1.jpeg",
        "content": "Plot twist 😅",
        "num_comments": 12,
        "comments": [
            "Gosh I need titties so bad. I thought they were annoying and heavy. But for some reason I don't care. Still cis tho.",
            "I always tell them they need to communicate better",
            "Gimme b cupssssssssssss T ^ T",
            "James is the best Pokemon character :3",
            "Okay. But only if you admit you're a good girl.",
            "Can I have titties too? 🥺",
            "Meooow mrrrp mrrraw nya \n\nNyo",
            "Meooow mrrrp mrrraw meoooooooow\n\n*purrs*",
            "Bad stella",
            "T ^ T"
        ]
    },
    "egg_irl": {
        "title": "egg_irl",
        "score": 446,
        "url": "https://i.redd.it/a6y6n4lfyg9d1.jpeg",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Agender:\n\n(They don't even have their own flair)",
            "it's sad tbh, i feel sorry for them all",
            "i would make memes if i was funny",
            "Riddle me this, does this count as a transmasc, enby, or gender fluid, all, or none of the above meme. How do you classify your memes",
            "I thought we were all cis",
            "oh my god they're LITERALLY ME :O",
            "I don’t think I’ve ever seen an enby or genderfluid meme on here. Shame really, I bet there’d be some great ones.",
            "I haven't met a single genderfluid person who wasn't incredibly fucking hot, like goddamn, every single one I've met I've had a crush on lmfao",
            "Shoutout to my fellow genderfluid people",
            "The fact I am all"
        ]
    },
    "Egg irl": {
        "title": "Egg irl",
        "score": 709,
        "url": "https://i.redd.it/gpoqoneduf9d1.png",
        "content": "",
        "num_comments": 49,
        "comments": [
            "This would mean I wish I was a peak cis male which means I wish I was a guy which means I'm not trans I'm cis and I have evidence.",
            "You might not like it but this is a prime example of \"still cis tho\"",
            "Oh sweet, that certainly simplifies things!",
            "Yes that peak totally cis male performance",
            "Femboys: Well, yes, but actually yes.",
            "this is what f1nn5ter used to think.",
            "I'd love to do it so much 😭",
            "Way to trigger my gender envy... damn, girl!",
            "Where is weebi2? How early am I?",
            "It's true this is peak male"
        ]
    },
    "Egg_ irl": {
        "title": "Egg_ irl",
        "score": 455,
        "url": "https://i.redd.it/6y8dhlbxhg9d1.jpeg",
        "content": "Oh no I accidentally reposted it, oh well, guess I should just let it happen.",
        "num_comments": 18,
        "comments": [
            "Someone cracked the code to a perfect egg meme",
            "Looks like someone’s having an egg-ceptionally good time.",
            "Will they stay for cuddles 🥺👉👈",
            "Wait why is this transfem only? /genq",
            "Hope this starts a new trend on this sub lmao",
            "Ohno hit the repost button. I wouldnt mind it though",
            "Don't worry everyone, I'll take all those unwanted hormones off your hands!",
            "Oh no, that sounds terrible! :3",
            "I’m sure they will if you ask them to :3",
            "Yeah, I wanna have a cat person give me hormones!"
        ]
    },
    "Egg 😢 irl": {
        "title": "Egg 😢 irl",
        "score": 356,
        "url": "https://i.redd.it/8mz4fqd9og9d1.jpeg",
        "content": "I can’t go back to how depressed I was about life…",
        "num_comments": 21,
        "comments": [
            "Gotta consider your happiness before that of your spouse, imo. ",
            "Aw, honey, I get that relationships can be tough when something like this happens. I feel like the most important thing to remember though is that if she isn't into women, then it's important to accept that, but that she should also accept that your a women now. I hope the two of you can atleast stay friends if she isn't into girls, but if she is then I wish the two of you the best through this, and if she's just straight up not accepting of you being trans, then I'm sorry to say this but you may have to cut her out of your life. If she's not there for you, then you have to be there for you.",
            "I recommend focusing on showing her how happy it makes you feel, but remember to be genuine.",
            "🫂 I'm sorry Amy. I'll say the thing you might not want to hear, but may need to. Some relationships can't survive the transition,.for any number of reasons. Even someone thet loves yiu very much may not be able to be with someone who's gender doesn't match their orientation. That hurts, it really fucking sucks but it's how people can be.\n\nIt's also possible she is lashing out because change is hard and she may come around eventually. Though this is less likely. You could even end up with a close friend instead. But remember Amy, what matters is Your happiness here. Keep exploring yourself, be true to yourself, and what comes, comes. 🫂💜",
            "If she doesn't accept you and won't accept you no matter how long you've been together you have to end it. Put yourself before her. A life without her may be bad but a life a without yourself isn't worth your wife.",
            "If you have kids changing that relationship might cause trauma for them that might also be argument for her to accept you",
            "I know it's hard but don't ever supress yourself to make someone else happy. It never works anyways, these feelings will only come back stronger.",
            "js i've been through the \"being trans ruins relationship\" \n\nfocus on yourself more, trust me. you'll get over her eventually but you can never get over dysphoria if someone's holding you back.",
            "Not a good woman I see",
            "Fuck em, do what you feel like is best for you. if they don't love you for who you are then there's no point of being in a relationship"
        ]
    }
}