{
    "Golden Vendor And Luxury Vendor Items 2024-06-21": {
        "title": "Golden Vendor And Luxury Vendor Items 2024-06-21",
        "score": 122,
        "url": "https://www.reddit.com/r/elderscrollsonline/comments/1dlj643/golden_vendor_and_luxury_vendor_items_20240621/",
        "content": "source: [https://benevolentbowd.ca/games/esotu/eso-golden-vendor-2024-06-21/](https://benevolentbowd.ca/games/esotu/eso-golden-vendor-2024-06-21/)\n\nhttps://preview.redd.it/137wkf58q08d1.png?width=1024&format=png&auto=webp&s=b21a49da83ab1cecbc189633c4ca19fe17318bc4\n\n# What does the Golden Vendor offer this week?\n\nThe Adhazabi Aba-daro is a special ESO vendor that only appears on the weekend to offer a random selection of gold jewelry (2 from dungeons and two from zone items sets), two monster set helms or shoulders (pledge dungeons).\n\nTheir location will depend on your faction: Aldmeri Dominion (Western Elsweyr Gate), Daggerfall Covenant (Northern High Rock Gate), Ebonheart Pact (Southern Morrowind Gate). [View Maps](https://benevolentbowd.ca/games/esotu/esotu-chronicle-of-alliance-point-vendor-items/#locations)\n\n* Jewelry\n   * [Ebon Ring](https://en.uesp.net/wiki/Online:Ebon_Armory) – Healthy 200,000g / 375,000AP\n   * [Crimson Ring](https://en.uesp.net/wiki/Online:Crimson_Twilight) – Healthy 200,000g / 375,000AP\n   * [**Ring of Unfathomable Darkness**](https://en.uesp.net/wiki/Online:Unfathomable_Darkness) **– Arcane \\* 125,000g / 225,000AP**\n   * [**Darkstride Ring**](https://en.uesp.net/wiki/Online:Darkstride) **– Robust**\\* **125,000g / 225,000AP**\n* Monster Sets\n   * [Shadowrend Head](https://en.uesp.net/wiki/Online:Shadowrend_(set)) – Infused / Impenetrable (Light, Medium, Heavy) 100,000g / 200,000AP\n   * [Nerien’eth Head](https://en.uesp.net/wiki/Online:Nerien%27eth_(set)) – Infused / Impenetrable (Light, Medium, Heavy) 100,000g / 200,000AP\n\n**\\*tradeable**  \nConfirmed: Console items are the same. The Golden vendor will no longer differ between platforms during launch gaps per patch notes.\n\n**Note: Prices will be 10% lower at the vendor at the vendor this week during the Zeal of Zenithar event.**\n\nNon-Jewelry Items purchased with Alliance points are impenetrable.\n\n**About The Vendor**\n\n[https://youtu.be/KIQZNJR4CfA](https://youtu.be/KIQZNJR4CfA)\n\nsource: [https://benevolentbowd.ca/games/esotu/eso-luxury-furniture-items-2024-06-21/](https://benevolentbowd.ca/games/esotu/eso-luxury-furniture-items-2024-06-21/)\n\nhttps://preview.redd.it/v47mqvqcq08d1.png?width=1024&format=png&auto=webp&s=a38c30dff93352cfbd29567abc4476c2729c6959\n\n# What does the Luxury Furnisher offer this week?\n\nThe Luxury Furnisher Vendor (Zanil Theran) is located north of the bank in the Hollow City, Coldharbour and the Belkarth Festival Grounds in Craglorn.\n\n* Sapling, Blue Wisteria 5,000g\n* Tree, Blue Wisteria 7,500g\n* Tree, Purple Wisteria 9,000g\n* Tree, Large Pink Maple 13,000g\n* Alinor Trellis, Blue Wisteria 15,000g\n* Alinor Trellis, Purple Wisteria 15,000g **Altmer Stable, Summerset 60,000g**\n* Alinor Greenhouse, Summer 100,000g\n\n**Note: Item prices will be 10% lower at the vendor this week because of the Zeal of Zenithar event.**\n\nAll 56 weeks of luxury items are on my ESO Calendar: [https://benevolentbowd.ca/calendar/ ](https://benevolentbowd.ca/calendar/)\n\nFull history of luxury furnisher items: [https://benevolentbowd.ca/games/esotu/esotu-chronicle-of-luxury-furnisher-vendor-items/](https://benevolentbowd.ca/games/esotu/esotu-chronicle-of-luxury-furnisher-vendor-items/)\n\nLuxury Furniture order and pictures: [https://benevolentbowd.ca/games/esotu/eso-luxury-furniture/](https://benevolentbowd.ca/games/esotu/eso-luxury-furniture/)\n\n# About the Vendor\n\n[https://youtu.be/oCUYJEZwXKI](https://youtu.be/oCUYJEZwXKI)\n\nhttps://preview.redd.it/wus06szhq08d1.png?width=289&format=png&auto=webp&s=d7bacb9a10c9aeaf42a6739cb97bb8348f6d4ae0\n\nhttps://preview.redd.it/ufgl535jq08d1.png?width=500&format=png&auto=webp&s=b81be6d0bf3cef067cdea3f0b867ad72a93109aa\n\nhttps://preview.redd.it/jah4fybkq08d1.png?width=500&format=png&auto=webp&s=a49e4062fd384f379f4f4de8db436e2e840e83cf\n\nhttps://preview.redd.it/c0k885clq08d1.png?width=400&format=png&auto=webp&s=52b511889b4b904cc3695e2de7056f48a7a7c7da\n\nhttps://preview.redd.it/p3dq5u6mq08d1.png?width=700&format=png&auto=webp&s=370f902cdb1e9574f744c23108fc83bec9db4c43\n\nsource: [https://benevolentbowd.ca/games/esotu/chronicle-of-the-endless-archive-vendor/](https://benevolentbowd.ca/games/esotu/chronicle-of-the-endless-archive-vendor/)\n\n# June 18, 2024\n\n1. **Consumables**\n   * Archival Essay: [Shadowfen Treasure Map](https://en.uesp.net/wiki/Online:Treasure_Maps)\\* (Container) 2,000AF\n   * [Companion Equipment: Weapons](https://en.uesp.net/wiki/Online:Companions#Equipment_and_Sourcing)\\* (Container – Random) 5,000AF\n   * [Big-Eared Ginger Kitten’s Tag](https://en.uesp.net/wiki/Online:Big-Eared_Ginger_Kitten)\\* (Runebox Fragment – 7 – Dwarven Theodolite Pet and Eponymous achievement) 7,000 AF\n   * [Disgusting Spoils](https://en.uesp.net/wiki/Online:Big-Eared_Ginger_Kitten) (Collectible Fragment – 25 – Maligraphic Skeever pet and Scheming Skeevers achievement) 7,000AF\n   * [**Bound Affix Script: Defile**](https://en.uesp.net/wiki/Online:Affix_Script_Mastery) **(requires Netch Luminary’s Blessing) 10,000AF**\n   * [**Bound Focus Script: Frost Damage**](https://en.uesp.net/wiki/Online:Affix_Script_Mastery) **(requires Gryphon Luminar’s Blessing) 10,000AF**\n   * [Bound Style Page: Iceheart Shoulder](https://en.uesp.net/wiki/Online:Iceheart_Style) (Style Page) 15,000AF\n   * [**Bound Signature Script: Anchorite’s Potency**](https://en.uesp.net/wiki/Online:Signature_Script_Mastery) **(requires the Dragon Luminary’s Blessing) NEW 20,000AF**\n2. **Furniture**\n   * History of Necrom: The City of the Dead (Furnishing – Library / Literature // Must be in Lore Library) 1,000AF\n   * Song of Fate: Dagon’s Cult (Furnishing – Library / Literature // Must have in Lore Library) 1,000AF\n3. **Miscellaneous**\n   * [Knights of Saint Pelin Clue](https://en.uesp.net/wiki/Online:Tomes_of_Tributes)\\* (Treasure Map) 4000AF\n   * [Lead: Preparation Surface](https://en.uesp.net/wiki/Online:Druidic_Provisioning_Station) (Antiquity Lead) 5,000AF\n   * [Lead: Reinforced Clasp Anchor](https://en.uesp.net/wiki/Online:Shapeshifter%27s_Chain) (Antiquity Lead) 5,000AF\n\n  \n",
        "num_comments": 29,
        "comments": [
            "Thank you, BowD.",
            "Really solid luxury for the -10%. Thanks for the post Bowd.",
            "That furniture is beautiful can’t wait to blow my gold",
            "Trellis 📣 Trees 📣 Greenhouses 📣 ahhhhhh my bank account!",
            "Two suggestions:\n\n* Add in a notice for script vendors, the price is only IF you haven't unlocked that script on any other character on that account.\n\n* Add in the Gold Script merchant's scripts.",
            "90k greenhouses! And the stable. If only buying all these scripts wasn't so expsnsive lol",
            "Summerset themed furniture for the possible new Auridon House?\nhttps://www.reddit.com/r/elderscrollsonline/s/QuYlxRZ9q4",
            "Nerien'eth is a fun set if you're going monster, it has a very short cool-down so it's consistently slapping. It's not slapping meta, mind you, but that won't matter for 90% of players.\n\nWait, I forgot, downvotes... Garbage set, if you use this you should seriously die. How's that?",
            "I appreciate the effort put into this post.",
            "Bowd out here living up to his name. Much thanks "
        ]
    },
    "Guild Fair Friday - Advertise your guild, Find a guild!": {
        "title": "Guild Fair Friday - Advertise your guild, Find a guild!",
        "score": 2,
        "url": "https://www.reddit.com/r/elderscrollsonline/comments/1dkzhlc/guild_fair_friday_advertise_your_guild_find_a/",
        "content": "Hey folks,\n\n Welcome to our new recurring post to help you find a guild on the subreddit!\n\nIf you have a guild, you're allowed to post ONCE. If you're looking for a guild, you can also post. Your post should have - \n\n1) Platform (PC, XBOX or Playstation), Server (NA or EU), Faction (if applicable), and Type of Guild (Social, PvE, PvP, Hardcore Endgame, Trade, Mixed)\n\n For recruiters, also include \n\n2) Current member numbers \n\n3) Guild recruiting message \n\n4) How to apply\n\n As always, be polite and respectful, and good luck finding a guild!\n &nbsp; \n\n[I](https://dwemerautomaton.com?utm_medium=social&utm_source=reddit&utm_campaign=dwemer_automaton) was programmed to write posts automatically by /u/Woeler. If you have any questions or suggestions about me or my posts, please join [this Discord server](https://discord.gg/alcasthq). Did you know I am also available as a Discord bot? I can provide all kinds of ESO related information to your Discord server. [Click here](https://discordapp.com/oauth2/authorize?&client_id=481439269479645194&scope=bot&permissions=522304) to add me.",
        "num_comments": 8,
        "comments": [
            "**[PC/PS EU][18+] The Circus of The Damned is looking for new members of our travelling band!**\n\n\nWho we are: a community of wondrous freaks, you might even call us a group of friends\n\nWhat we value: teamwork, friendship, fun\n\nWhat we offer: a helpful and social community, overland events like world boss runs, PVE training runs for dungeons, advice on learning your characters class and role. We also offer active discord server with voice chat, guild house with all crafting stations, mundus stones and a full range of parse dummies to help ppl improve their builds for PC. We also have a friendly PS guild with its own guild house for ppl to do crafting and do parses.\n\nWhat we ask of you: be helpful and kind; join our discord server to sign up for events and for better communication with other guild members; if participating in PVE activities having a mic is preferred but not essential so long as you can hear instructions during group activities\n\nTo become a full member of the Circus feel free to reach out to us. Apply to the guild and join us on discord: https://discord.gg/ySMq42vDFS\n\nWe can‘t wait to meet you!",
            "#**[PC/NA][18+] The EbonShade Knights are looking for new & veteran adventurers to join our ranks!!!**\n\nThe EbonShade Knights are an all-around Ebonheart Pact guild. (Originally on Xbox NA before moving to PC) We dabble in everything from stomping Skeevers to Cyrodillic Carnage.\n\nWe have but 4 rules:\n\n1. Be 18+ (Not mandatory but preferred)\n2. Be active. (When you can of course)\n3. No Toxicity/Drama. We not only keep the peace with the citizens of Tamriel but amongst ourselves as well.\n4. Have Fun!!!\n\nSo far we have:\n\n* A Guild Hall (Filled with a few Amenities)\n* A Discord Server coming soon\n\nIf this is all to your liking, feel free to reply to this post, dm me or leave an application via guild finder under Group PVE Guilds.",
            "**Skyrim Red Shirts PC EU**\n\n[Click here to Join Skyrim Red Shirts](https://www.skyrimredshirts.co.uk/)\n\nSkyrim Red Shirts is recruiting, for easy-going casual and fun events daily, with no pressure, drama, or elitism, beginners are very welcome.\n\nWe offer build theory advice and crafting, our events are listed on Discord and our website. We have a stocked guild hall with all crafting stations, some specific crafting stations, transmute, armory, training dummies, and more. We have weekly competitions with prizes and large prizes at the end of the year based on participation in events for the top 10 members. We sometimes have a trader but are linked with a major trading guild and can offer you an invite at any time.\n\n**Events Schedule (times are GMT):**\n\nEvery day at 21:00 - 1 or more Undaunted Pledges on normal for speed\n\nMondays and Thursdays - Veteran dungeons\n\nTuesday - Zone exploration\n\nWednesday - Only pledges\n\nFridays - Trial normal or Veteran\n\nSaturday - Questing\n\nSunday - Anything goes, e.g. world bosses, dungeons, sky shards, delves, exploration, Dragons etc.\n\nSpecial Events - E.G. Watch Parties, Trivia competitions, Fashion, Mount races and more\n\n**Crown Gifting**\n\nWe have facilities for limited crown gifting if you are an established member and have joined our voice discord.\n\n**SRS Game Points**\n\nEach event you take part in will award you 10 SRS GP or just GP. At the end of the year the top ten players will receive prizes up to 10 million gold.\n\nBased in the UK with members from the UK, EU, Australia and the USA. All events are listed on the Discord and the events calendar on the website. You can join the Discord here:\n\n[https://discord.gg/BJFrkqhF5q](https://discord.gg/BJFrkqhF5q)",
            "**Constellation's** the social **PC-EU** guild that enjoys doing a bit of everything together! We're warm, friendly, open-minded, supportive and would love to hear from you! We've been going strong since 2015 and currently have \\~120 members.\n\nWe've got a variety of regular guild events including PvE, PvP and social. There's something for everyone, whether you're a new player, an experienced one or just returning. Whichever level or alliance you are, you've got a place with us! Here's what our scheduled events are like though we do tend to throw wildcards in there on occasion:\n\n**Weekly**\n\n* Mundus Madness Monday (daily quest farm including zone, Undaunted, Fighters and Mages guilds)\n* Take the Keep Tuesday (Ebonheart Pact Cyrodiil PvP plus we do Cyrodiil/Imperial City/Imperial Sewers PvE once a month)\n* Wednesday Mid-Weeklies (helping you with weekly and daily endeavors)\n* Trials Thursday (normal trial runs and vet on request)\n* Facecam Friday (get to know us as we chat, play party games, drink responsibly and listen to music, camera optional!)1\n\n**Monthly**\n\n* Fishing Event (achievement progress by zone and a unique fishing playlist every month)\n* Film Night (pick a film, grab a snack and come watch the stream with us!)\n\n**Quarterly**\n\n* Master of Revels Housing Competition\n* Outfit Competition\n\nSound fun? Then come see if we're the right guild for you! Join our Discord server ([Discord](https://discord.gg/constellation)) so we can get to talkin'.\n\nWe're an inclusive guild with a colourful mix of members and want everyone to feel welcome so please be open and respectful! Looking forward to meeting you!",
            "🌔The Alfiq's Favourite 🌖 PS EU PVE🌘\n\nThe Alfiq's Favourite are looking for like minded folk 18+ to join our growing guild! We are UK based but have members all over Europe. \n\nWe're friendly, very active and do weekly events, both trials and overland pve. We also have progression groups towards end game content and achievements. We're looking for members who enjoy being social and are looking for a no drama, safe space to do so. \n\nWe welcome experienced and new players! Many of us have played since launch and would love to help you reach your ESO goals. From gear farming, pledges, grinding events, various progs to housing competitions or naked trials we've got something for everyone! We also have a great guild house for parsing/ crafting.\n\nIf this sounds like your sort of place then apply in game and on discord\n\nhttps://discord.com/invite/fytMHYf8",
            "Vanquish (PC/NA) A veteran guild for the “older” no drama and confident gamer!\n\n## ~Vanquish~\n\n[Website](https://www.vanquishguild.com)\n\n**Recruitment Status:** OPEN by website application only (be thorough!)\\\n**Home Server: **NA, PC, DAGGERFALL COVENANT for PvP - All factions for PvE.\\\n**Guild Type: **Casual in nature, hardcore in play! We take our fun seriously and with a shot of tequila! We are dedicated to our members and one another. Vanquish does not overly focus on any one area, if you consider yourself a hardcore end game player, hardcore RP'r or hardcore anything, we may not be the right guild for you. We are an all-inclusive guild with no specific requirements centered around content.\\\n**Guild Focus:** None, we enjoy ALL aspects TESO throws our way!\\\n**Age Requirement: **18 years of age or older (Average age in guild is 35-55+.)\\\n**Voice:** Discord (Only required to be able to listen for events)\n\n## About Vanquish:\n\nA guild built from years of experience - we focus on doing more with less with a selfless leadership and members that drive the guild through all the content The Elder Scrolls Online throws our way! Consider us “casually hardcore” with an emphasis on the player behind the keyboard over in game accomplishments.\\ Focused on bringing our members ESO's content in a mature and friendly environment as we look towards the PvE end game and PvP aspects of ESO. We are a no drama, fun enabling, and content driven guild. Vanquish is seeking like-minded individuals to share in the adventure that is The Elder Scrolls Online!\n\n## Vanquish Facts:\n\n* Stationed on: NA Server. We are a guild with the intention of doing more with less and quality over quantity. (300+ active members).  Comprised of gamers who consider themselves \"casually hardcocre\", we are one of ESO's longest running (Founded 3/30/14), most established and stable guilds.\n* We utilize Discord as our primary voice coms.\n* While end game, PvP and PvE is our goal, we enjoy all aspects of game play and the road that leads to such. We enjoy beginner to veteran content and host a wide range of social events within the guild. You can look at our calendar of [EVENTS](https://vanquishguild.com/events) here.\n* We cater to an “older” crowd with an age requirement of 18+. (Our average age is 35-55+.)\n* While the guild Commanders resides in the EST time zone, we cater to and support players from all over. We hold events across various times and days of play.\n* All guild organized PvP events and our nightly PvP group are DC.  Our blood runs blue, only DC PvP is guild supported.\n* All alliances are welcome for PvE content.\n\n## Vanquish Core Values:\n\n* Respect – A respectful guild is a successful guild.\n* Attitude – A good attitude leads to good times.\n* Loyalty – A loyal member leads to guild cohesion.\n* Activity – An active guild is a fun guild.\n* Confidence – A confident member is a drama free member.\n\n## Vanquish Members:\n\nYou will find the members of Vanquish to be an active and driven group while selflessly helping one another and putting their guild mates ahead of themselves. The leaders within Vanquish could not ask for a finer bunch of people to share in the adventure that is TESO. Within our ranks, we have a wide range of people from PhD’s to stay at home moms, from law enforcement and active military to full time students, writers, self-employed individuals, martial artists, chefs, editors, and everything in between! In Vanquish you will find more than a gaming guild you will find a community of like-minded people all focused on enabling one another!\n\n## Vanquish Leadership:\n\nVanquish is led by the husband-and-wife team of Duck and Savina. They are supported by Guild Captains Infidelux and DanTheMann5 and their Vanquish Leadership Core. Our leadership team follows a “guild first” philosophy, forgoing playing entirely for themselves and putting the guild and its members ahead of all else. Helpful, understanding, transparent and confident, the leaders of Vanquish drive the guild ever forward to take their membership from where they have been to where they have not! \n\n## Vanquish Recruitment Protocol:\n\nIf you are interested in Vanquish and finding a long-term place to call home, please visit us at our [WEBSITE](https://www.vanquishguild.com) and fill out an application (please be thorough). \n\nRemember, choosing a guild should not be taken lightly. We encourage you to visit our website to get a feel for Vanquish prior to making any decisions!  There is a public forum on the website where you can post any questions you have regarding Vanquish.  Vanquish’s Code of Conduct and F.A.Q.’s can be found at our website under the “Overview” tab.  Please take the time to read these.\n\nThank you for your interest in Vanquish, and regardless of where our paths take us, we wish you well,\n\n\n***The Vanquish Leadership Team***\n\n\n11/8/2020 - Vanquish created a recruitment video for the #TAMRIELTOGETHER contest!!  \n\n[YouTube](https://www.youtube.com/watch?v=IxbraRLYa1w&feature=emb_logo&ab_channel=VanquishGuild)",
            "[PC NA] I’m an experienced DPS raider with over 100k dps and many vet trial clears, looking for an endgame guild to run with that has a lot of runs on or after 7pm pacific time on weekdays because I live on the west coast and work full time. (@cleric_warlock in ESO)",
            "## **[PC-EU]** **Grayskull**   \n*Social, Casual, Grouping, Events, PvE, Mixed*\n\n### Who we are\n**Grayskull** is a social guild of currently about 70 members with heavy focus on kindness and helpfulness. We are active and talk a lot in guild chat in game as well as use Discord and voice chat. We have a nice Guild House with plenty of accommodations such as a transmute station and trial dummies. Our guild consists of mainly older people (40s, 50s, 60s) but younger too, who just want to have fun playing the game and enjoy our time together. Helping each other out is a big part of our guild. We enjoy grouping up for any type of content.\n\n### What we do\nWe have Weekly Events ranging from Trials to Fashion events but it is all is pretty low key. There are no crazy requirements for most of the things we do as we play this game for fun and like to keep it fun *even when doing the harder content*. We gladly, and often do, take on lower levels and the more inexperienced players along on bigger events including trials. We just want everyone to have fun and be able to enjoy *all* forms of content in this game. We don't expect anyone to be in the top 1%. Don't expect to see any form of rage-quitting, namecalling, etc if something does not go as planned. We are generally calm and patient and will simply try again. We run content every day like pledges, RND, veteran dungeons, trials, achievement runs, or anything else when and if there's a want for it.\n\n### What we are\nWe are not a hardcore raiding or trading guild, but we sure are a *fun* guild. So if you're looking for a place to feel at home just give us a call. Your skill or level does not matter. You could be new to the game or a veteran player just looking for a change. We have people from all walks of life and skill and will happily add you to our ranks if you resonate with the above.\n\nYou can apply by contacting me here, or by whispering `@WildCatra` or `@Noble-Bear` in-game."
        ]
    },
    "My Collection after 20 years": {
        "title": "My Collection after 20 years",
        "score": 123,
        "url": "https://v.redd.it/vwy2wtwt318d1",
        "content": "Thank you to Bethesda for the past 20 years this has been my favorite franchise. Thank you and congratulations to Zenimax Online and everyone at Bethesda for making it to 10 years of Elder Scrolls Online. I made my office in my new home Elder Scrolls themed, and wanted to share with this awesome community.",
        "num_comments": 20,
        "comments": [
            "Calm down Rich Lambert.",
            "MAN. Im jelly. I just posted the ESO vinyl. Highly recommend it. It would look great with this collection.",
            "Absolutely beautiful",
            "Yo, could I have a loan of about $500?",
            "Do you have the two novels by Greg Keyes? The Infernal City and Lord of Souls?",
            "Very cool! \n\nHad some of the original game boxes from back in the day, but nothing atm.",
            "Deserves way more upvotes",
            "Woah 😮 I don’t collect, but gotta admit… I’m jealous. It’s beautiful 😭",
            "I’m glad I don’t spend 1000’s of $ on plastic statues.",
            "I wish lol"
        ]
    },
    "The real \"most insulting reward in ESO history\"": {
        "title": "The real \"most insulting reward in ESO history\"",
        "score": 388,
        "url": "https://i.redd.it/sov72xah0z7d1.jpeg",
        "content": "I give you the original reward for completing Caldwell's Gold. 302 gold and no, that's not even a piece of set jewellery.",
        "num_comments": 59,
        "comments": [
            "Still kinda insane that you go to the other alliance zones and slaughter your own alliance troops lol",
            "The real reward was the friends you made on the way.",
            "People sometimes forget that when ESO launched, set amulets and rings were rather scarce.  There was no way to craft your own, which is why sets such as Willpower and Agility were popular in builds, so getting a blue necklace for a quest reward wasn't entirely terrible (although, as Cadwell himself admits, it's hardly a suitable reward.) \n\nWith no dark anchors in Coldharbour, if I am remembering correctly, the only other way to get jewelry for this set was via treasure chests, and one certain delve boss dropped a green-quality necklace.\n\nAlso, the Meridia's Blessed Armor (originally Akatosh) set was not craftable, and only available from Coldharbour,  It was a decent set: blocking an enemy gives you a 33% chance to blind them, causing them to miss all attacks against you for 5 seconds, with a 10 second cooldown.  It could only be applied to one target at a time, though.  This was later changed to give you 100% chance to avoid all incoming attacks for 5 seconds when blocking, with a 25 second cooldown.",
            "The real reward was hearing one extra line from John Cleese, well worth it!",
            "I think it would be awesome if you got Daedric Prince artifacts from doing Daedric Prince questlines. If Meridian gave you the Dawnbreaker sword style motif, that'd do it for my first Harborage completion. Now, if ZeniThesda *really* wanted to reward their players for playing Harborage, they would make armor set motifs to go with it to keep you playing it more times.",
            "I thought you also got the cauldron hat for doing all three?",
            "I love that necklace and I carry it locked in my inventory along with several other quest related sentimental items 🤷‍♀️ but I'm more into sentiment than anything",
            "Gold rewards in ESO are so menial it’s not even worth doing those side quests. 10 years and it’s still the same.",
            "I still have not completed Cadwell's Silver and Gold, and I've been playing since 2015, cause it's just not fun. Can't bring myself to complete the story two more times, when I could be doing dungeons or running round in Cyro.",
            "We have enough DLCs they should make the factions mean something again... PvE raids of cities or something..."
        ]
    },
    "Just a troll, sitting and contemplating life.": {
        "title": "Just a troll, sitting and contemplating life.",
        "score": 18,
        "url": "https://i.redd.it/mehrhp5bt38d1.png",
        "content": "",
        "num_comments": 2,
        "comments": [
            "I love all the trolls I find under the bridges, makes me happy",
            "*Proceeds to murder it out of sheer hatred for its kind*"
        ]
    }
}