{
    "Daily Roundtable: Community Q&A": {
        "title": "Daily Roundtable: Community Q&A",
        "score": 4,
        "url": "https://www.reddit.com/r/Eldenring/comments/1dr2ikb/daily_roundtable_community_qa/",
        "content": "Greetings Tarnished!\n\nThis is the place to ask any questions you may have about Elden Ring. This includes obscure detail questions, \"newbie\" advice questions, build questions, boss advice questions, and what have you.\n\nWell written, constructive criticism is fine but please avoid ranting about aspects of the game you just don’t like. This includes “so and so boss is stupid and too difficult.”\n\nIf you are interested in the game but don’t own it yet, please don’t post “should I buy this game?” or “Is this game worth it?”. If you have played other FromSoftware games and enjoyed them, the answer is yes. If you haven’t, just do a little research! These games are difficult, and sometimes frustrating, and not everyone is going to enjoy them. And that’s okay!\n\nLastly, be friendly! We are all here because we are interested in the same game! Please treat your fellow players with respect.\n\nHere are a few helpful links:\n\n[Our Discord](https://discord.com/invite/r-eldenring) which has an awesome [Helper Request System!](https://www.reddit.com/r/Eldenring/comments/uda81o/er_discord_bossdungeon_help_request_for_all/)\n\n[Elden Ring Wiki](https://eldenring.wiki.fextralife.com/Elden+Ring+Wiki)\n\n[Elden Ring Map](https://eldenring.wiki.fextralife.com/Interactive+Map)\n\n[Most Recent Patch Notes](https://en.bandainamcoent.eu/elden-ring/news/elden-ring-patch-notes-106) (1.06)\n\n/r/BeyondTheFog for co-op help!\n\n/r/PatchesEmporium for item trading!\n\n/r/EldenRingBuilds for builds and build help!\n\nOur community password is **straydmn**\n\nRise, Tarnished!",
        "num_comments": 107,
        "comments": [
            "So I'm at the final boss of the DLC and I can consistently get to his second phase but I die to most of his moves mainly the one after the rock sling where he dives down with four illusions then comes down and then the one after he sucks you in and scream and then combos there is also that 1 move where before he does the simultaneous sword\nslashes, I ger hit by one of the moving swords then staggered in the said sword slash how do I dodge\nthenn",
            "is there a non-tedious way of killing the fire basket guys?  I'm at the end of my DLC playthrough and figured I'd clean up but it takes ages of repetitive bashing + jumping.  the camera is really frustrating and I've died making me repeat the process over again",
            "What level are people co-oping at?\n\nI feel like I'm only getting Rellana, Putrescent Knight, Commander Gaius, and occasionally Bayle or Divine Lion at 175.",
            "Any word from fromsoft regarding performance issues and fixing them in future or should I wait a bit more before purchasing the dlc. ",
            "I was told putting Carian Sovereignty on a greatsword gives you hyper armor during the cast but I just tried it on a Knight's Greatsword and it does fuck all, I get staggered out of it almost instantly with 66 poise. I watched a video of dudes tanking through boss attacks with it. What gives? Did it already get patched?",
            "Purely opinion based question, just completed the DLC and want to start a NG+; NG was a fun Str/Faith build, and I'm thinking of either doing a Dex/Arc or Dex/Int run for the next, but can't decide. Any votes?",
            "Any speedruns of all rememberances since DLC came out? I haven't seen Distortion2 go for it yet, not sure why I am not seeing runs",
            "Hello everyone I recently saw a video on youtube with Parfume Bottles and ashes of war or skill where the wielder just dashed on the ground. Can someone tell me the name of that? I can't find the video anymore.",
            "I've played through to Maliketh on a Dex/Arc build. I just started a new character to be mostly or entirely faith-based for a complete change of peace. Any tips? I'm extremely bad at this game, so ideally, ways to be overpowered with faith.",
            "Do you need a controller with a L3/R3 button to play ?"
        ]
    },
    "DLC tech support MEGATHREAD": {
        "title": "DLC tech support MEGATHREAD",
        "score": 177,
        "url": "https://www.reddit.com/r/Eldenring/comments/1dllf5o/dlc_tech_support_megathread/",
        "content": "Hello everyone,\n\n&#x200B;\n\nThis subreddit traditionally does not allow tech support questions, but with the release of Shadow of the Erdtree we have been flooded with requests to allow posts about this topic.\n\n&#x200B;\n\nThis megathread exists to gather all these questions.\n\n&#x200B;\n\nWe encourage people who have shared similar issues to offer solutions they found.\n\n&#x200B;\n\nWe can however as a mod team not personally verify answers given, so please use your own best judgement. \n\n&#x200B;\n\nThank you, \n\n&#x200B;\n\nThe Elden Ring mod team",
        "num_comments": 868,
        "comments": [
            "I've been getting a lot of stuttering since the patch - does anyone have any recommendations to try and smooth it out? It was never this laggy even two weeks ago. thanks",
            "Anyone else experiencing PC performance issues post update? I was under the impression that the game would run exactly the same as before, however I'm finding framerate drops in areas that I otherwise wasn't, I'm going down to 40 FPS at points in the Limgrave Tree Sentinal fight and I never had this issue before, pretty much never dropped below 50.",
            "MY fps dropped to the 45ish everytime i looked at the dlc big tree, or certain direction, changing to low doesn't help at all its so weird.",
            "my friends and i are all on ps5 and we cannot see each others summon signs anywhere. we’ve all played the base game and have in fact played with each other before on ps4. we’ve done all the usual (router resets, restart game, character and location changing). is anyone else having issues?",
            "My game is stuttering every 2 seconds or so and is catching up which is making it unplayable I have tried every fix under the sun and nothing has worked so far. Idk what to do at this point is there going to be a patch that addresses this?",
            "My game is stuttering like crazy. It’s weird, cause it’ll run fine for a while, then just start stuttering like crazy. If I restart the game, it’ll boot up, start working for a while, then start stuttering again. It’s like the game over time becomes unable to handle continuing to load the game. \n\nAny idea on how to possibly fix this?",
            "everytime i try to summon help it says summon unavailable it was not doing this in the base game  \ni also cant exit the game or put summon signs down when this happens",
            "7800X3d, 4070, 32gb RAM.  No issues pre-DLC running locked 60 on high (no RT).  Now I am running into dips into the 40s consistently.  Disappointed to have performance issues again after the major problems at launch.",
            "I've gotten the 'inappropriate activity detected' error 3 times today, and I'm considering a refund.",
            "For anyone with the constant stutters and then the game catching up on itself - ITS THE ANTI CHEAT - disabling it and playing offline works like a charm, back to original smooth game"
        ]
    },
    "No one is safe from the last boss": {
        "title": "No one is safe from the last boss",
        "score": 16732,
        "url": "https://i.redd.it/j0tv1txlse9d1.jpeg",
        "content": "",
        "num_comments": 795,
        "comments": [
            "There is a \"let me tank him\" helping on last Boss. There is a vídeo on YT.",
            "I watched his stream… ooof, makes me feel better about my abilities on the last boss lol",
            "Yeah Malenia is actually easy in comparison to Mr. Flash bang sky nuke.",
            "Unless you are Ongbal dude already has a RL1 with 0 blessing attempt",
            "People wondered why he's helping people with Messmer and not the final boss. This is his answer to that lol",
            "That 2nd phase is such bs. I’m either blinded by all the lights or miquellas hair",
            "Can we just take a second and commend how awesome this community is. To this day I still literally don't know what the final boss is and people only refer to them as \"the final boss\"",
            "Even the legend amongst Tarnished is struggling . . . god have mercy on us (fuck the last boss).",
            "Is this dude on pc? I once saw a player with that name on xbox and he got rekt’d by malenia.",
            "I beat the final boss yesterday. Chicken Leg bonk to the head for the win!"
        ]
    },
    "Biggest Criticism of DLC": {
        "title": "Biggest Criticism of DLC",
        "score": 7688,
        "url": "https://www.reddit.com/r/Eldenring/comments/1dqtwkz/biggest_criticism_of_dlc/",
        "content": "The amount of waterfalls without caves under them is criminal:(",
        "num_comments": 800,
        "comments": [
            "You know what I miss? Fromsoft hiding shit under elevators. I barely even remember to look now or try to jump down elevator shafts.",
            "Rellana  not having any dialogue or a cutscene during her fight just felt criminal.",
            "Fuck me was constantly doing this shit…and you know what? Somewhere in that motherfucker is a waterfall with a cave in it",
            "Honestly, VALID. I was so excited to find a cave but it never really happened.",
            "No opening cutscene for the DLC. I was waiting for a cool way to teleport us to the shadow realm. Something to at least set the mood.",
            "Melina didn’t kick my ass for going the frenzied flame route :(",
            "My complaint is the furnace giant. Furnace giants are terrible mobs. Boring and super easy once you remember your horse can jump. Just swing away for 10 minutes straight.... was really excited for the fight with a boss one too.",
            "For me it’s having the scadutree fragments be the exact amount needed to get to +20. There should be about 10 or so more around the map so you’re able to miss a couple.",
            "For me personally it’s the lack of cutscenes and dialogue on most of the bosses I loved the dlc but not having those I feel like make the bosses lack a bit of character I can remember vividly basically all the boss cutscenes and what they said in them even after all this time because they were all so memorable and interesting I feel like the dlc lacked that and it was pretty disappointing",
            "No new black flame incantations. Such a fucking travesty. Feels bad."
        ]
    },
    "After the dlc…all I can think of is what he looks like on the inside": {
        "title": "After the dlc…all I can think of is what he looks like on the inside",
        "score": 1005,
        "url": "https://i.redd.it/44okqbubgg9d1.jpeg",
        "content": "",
        "num_comments": 49,
        "comments": [
            "Lands Between Jar Warriors and Shadowlands jars are different. Former is the flesh of fallen warriors stuffed in a jar. No atrocities there, just a bit icky. The latter is the effect of horrible experiments performed by hornsent on shaman people. Great Jar is probably filled with the flesh of warriors that died in the arena he is guarding.",
            "You are confusing two things: In the Shadowrealm the Hornsent tortured Shamans by first whiping them until their inflamed flesh bulges out of their body, and you get what these flesh blob enemies are. Then they are put into jars. They could do that, because Shamans have a special body, that heals and merges easily (My theory why Godrick could graft shit onto himself). Iirc the intent wasnt pure torture but some kind of spiritual thing. \n\nWarrior Jars, the jars with hands and feet, are a completely different thing. Idk how they are made, but it got nothing to do with the Shadowrealm massacer of Shamans.",
            "How many ppl has bro scranned to be that large is my question💀",
            "Remember them FireGiants? I wonder where they all went…",
            "Do this many people really not know pots have always been filled with people? Did you miss Alexander entirely?",
            "All I can think of is how that jar's the only one I'm not allowed to fight. And I want to, REEEEAL bad.",
            "you can see what's inside that though",
            "they are different from the shadow realm jars",
            "Omg think of the flesh!",
            "FromSoftware: Interested in making a movie. \n\nThe movie: How these Jars came to be (esp the ones from the DLC)"
        ]
    }
}