{
    "TES 6 Discussion Megathread": {
        "title": "TES 6 Discussion Megathread",
        "score": 67,
        "url": "https://www.reddit.com/r/ElderScrolls/comments/1casp36/tes_6_discussion_megathread/",
        "content": "Hello everyone!\n\nThis megathread will serve as another place for discussions related to TES 6, and while we encourage discussions of TES 6 through this megathread, posts about TES 6 are still allowed and welcome on the subreddit.\n\nHaving both options available will hopefully make everyone happy.\n\nBelow is a link to past TES 6 megathreads:\n\n[Past TES 6 Megathreads](https://www.reddit.com/r/ElderScrolls/search/?q=speculation+megathread&sort=new&restrict_sr=on&t=all)\n\nr/ElderScrolls Moderator Team\n\n&#x200B;",
        "num_comments": 234,
        "comments": [
            "I want full \"what you see is what you get\" loot system like skyrim, and not like starfield",
            "It needs to feel like a game released in 2026/whenever it comes out. Midfield felt like it would have come out around the same time as Fallout 4. Gaming has advanced since then, and so has the expectations of large cutting edge single player experiences. Bethesda needs to do a lot of catching up for ES6.",
            "There’s a certain element of Baldur’s Gate 3’s character creator that would be fun to see lmao",
            "Why has this thread opened? Did I miss something",
            "Man I just want the game, 16 years or whatever it’s gonna turn out to be between install is actually nuts\nThat’s the same amount of time between arena and Skyrim\nMicrosoft needs to change bethesdas pipeline this isn’t sustainable for a franchise at this rate I’d be retired before elder scrolls 7",
            "My #1 ask is in-depth crafting, especially modular armor. That was my favorite part of Fallout 4, along with creating settlements.",
            "I hope they add a dodge/roll mechanic system similar to Witcher 3 so that light armor + dagger builds actually make sense for melee combat",
            "At this point I would settle for mutually exclusive factions so my roleplay choices actually matter like in Morrowind. Branching questlines and interesting dialogue options are probably too much to ask.",
            "for the love of all that is holy i dont want fallout 4 legendary weapons. Oh my god they are awful worst thing ever",
            "New Generation of Creation Kit, with integrated possibility of SKSE and more, like adding new animations without 10 other mods that requiring for this.  \nJust give us full scale game tool for modding, and i will be happy."
        ]
    },
    "What do you think happened to the Dwemer?": {
        "title": "What do you think happened to the Dwemer?",
        "score": 21,
        "url": "https://www.reddit.com/r/ElderScrolls/comments/1dngozc/what_do_you_think_happened_to_the_dwemer/",
        "content": "",
        "num_comments": 61,
        "comments": [
            "I'm kind of starting to get a suspicion Lorkhan did like a mass soul trap, and they're imprisoned in some plane of Oblivion or Aetherius.",
            "I believe when they disappeared, they entered a special demi-plane within the Heart of Lorkan. When the Nerevarine destroyed the Heart, that demi-plane was also destroyed. \n\nThey have become nothing. Their souls have not passed on to Aetherius, nor fallen to the cycles of a Daedric plane.  If not for their great architecture and works, it’d be as though they never existed.",
            "My two theories have always been that they either became part of the Numidium, or that they were sent forward in time.",
            "With how far they had their heads up their own asses I’d assume they just got sucked up completely into them.",
            "On a difrent planet or something",
            "All of them were instantaneously vaporised into almost molecule sized ash.",
            "Bound to the form of a Big Stompy Robot in a botched attempt at gestalt godhood.",
            "Personally I believe they’re in a causality loop. Hitting the Heart of Lorkhan with Kagrenac’s tools sent them into the early Merethic era which is why the Dwemer have an advanced civilization in Morrowind long before the first Aldmer left Summerset. Kagrenac would die in this transition so the rest of the Dwemer would be unaware exactly of what happened, they would opt to rebuild their civilization over again, not realizing they’re recreating history when they discover the Heart, rebuild Numidium etc.",
            "In attempting to create a new god via using Kagrenac’s tools on Lorkhan’s Heart, I think the Dwemer basically became part of the Numidium.  Or they became part of Lorkhan’s heart and were destroyed when the Nerevarine destroyed the Heart. ‘The Egg of Time’ was incorrect in my view in refuting the risks of tampering with divinity.",
            "They transcended somehow but if you do the side quest from winterhold where the guy wants you to get 10 dwemer cogs you may find out (I don't want to spoil it if you haven't played it yet)."
        ]
    },
    "Thoughts on bringing back a layered clothing system in TES 6? ": {
        "title": "Thoughts on bringing back a layered clothing system in TES 6? ",
        "score": 411,
        "url": "https://i.redd.it/42s2bivo1g9d1.png",
        "content": "",
        "num_comments": 118,
        "comments": [
            "PLEASE AT THE VERY LEAST LET MY PANTS AND SHIRT BE DIFFERENT",
            "Dude the customization in Morrowind alone makes me love the game I’d play anything with that kind of clothing system!",
            "Seperate left and right glove and pauldron spots while you are at it.",
            "basically, bring back the armor/clothing system from Morrowind? I can dig that.",
            "Yes. Do it you cowards, give us layering of clothing under armor, mix and match gauntlets and pauldrons,  enough slots to play with to give use custom looks instead of uniforms.",
            "Bethesda did bring it back for Fallout 4, so we know it does exists in the creation engine",
            "they neec to bring the flail from daggerfall too",
            "nice drip i just look like ass all the time",
            "They kind of brought it back for FO4 so I assume TES6 will have more options than Skyrim and Oblivion at least.",
            "It sure would be great. But unlikely."
        ]
    },
    "In conclusion, Morrowind is a land of contrasts 🍄": {
        "title": "In conclusion, Morrowind is a land of contrasts 🍄",
        "score": 200,
        "url": "https://i.redd.it/egwfsvlxwg9d1.jpeg",
        "content": "",
        "num_comments": 22,
        "comments": [
            "This, except they become the king of slavery.",
            "I think people really underestimate the Telvanni's power structure. They take might is right to the absolute extreme.\n\nIf a Khajiit becomes an Archmagister and has the power to overwhelm his/her opposition, that ruling becomes defacto law.. Because might is right. Telvanni certainly has xenophobic traits but magic trancends races and power is absolute. You can even kill important people in Telvanni society and get away with it if you live.",
            "Has this ever happened? I swear house telvanni don’t let anyone who isn’t a dark elf get to the top ranks",
            "You'd be dead in seconds",
            "Good luck enforcing that ban though lol\nThe other magisters would be like “ok. Make me.”",
            "First playthrough of Morrowind I became a Telvanni magister *and* patriarch of the tribunal temple as a Khajiit lady \n\nwhile also becoming champion of all three of the reclamations",
            "It can happen if you play the nerevarine as a khajiit. But the canon is that he is a dunmer.\n\nIt's not like the archmagister has real power anyway. In reality the masters do as they please",
            "I did not play pre-Morrowind games, so i can't talk for them but Nerevarine, Champion, Vestige and Dragonborn have not canon race and gender. That's why Bethesda is using fancy names when they mention them in other games.",
            "No the canon is that the nerevarine is a Brazilian Argonian.",
            "That's true, with the Nerevarine specifically having in their prophecy that they can be anyone. However, it's soft canon that they are a native of the games region with extra dialogue, tailored abilities, and said race as the depiction as the hero in promo material. \n\nThe CoC was almost certainly an Imperal, for example, because they emulate Whitestrake and become Sheo, who appears Imperial. The theme and available canon looks very Imperal."
        ]
    },
    "I love Redguard culture/aesthetic, but also love giant Nord warriors. How should I RP?": {
        "title": "I love Redguard culture/aesthetic, but also love giant Nord warriors. How should I RP?",
        "score": 34,
        "url": "https://i.redd.it/uytdhbsweh9d1.jpeg",
        "content": "",
        "num_comments": 26,
        "comments": [
            "If I like two thinks equally or around equally I usually go with the one I think less people use. Personally I'd just rp a redguard since I feel like they're a pretty underrated compared to nords. But there is nothing stopping you from Rping as a half Nord half Redguard and just embracing both",
            "An Orc born in a stronghold in the mountains between Hammerfell and Skyrim who takes the cultures of the two regions they were born between becoming an Orcish Persian Viking.",
            "Sorry but, \\*Who\\* you want to RP depends completely on you. Both have very interesting lore and culture, the only thing I can recommend is going to a wiki and reading through both races history, culture and important historical figures to decide for yourself.",
            "A Nord Yokuboo. You get a big Nord with Redguard aesthetics and weapons.",
            "When in doubt, I make a mixed race character. The lore is a little unclear as to whether that’s possible since there aren’t really any mixed race NPCs and everyone has to have a defined race, but I roll with it. Use your imagination to fill in the blanks.",
            "Play as a black Nord. Your character mother could be Redguard and their father a Nord. You were born in Hammerfell and learned the culture and traditions of Redguards, and you were also taught the ways of the Nords by your father. But one day something terrible happened and both your parents died, and this is where your story begins.",
            "Roleplay a Nord born in Hammerfell raised in Redguard culture.",
            "I RP is actually a great inspiration. Central Europeans who got access to Middle Eastern weaponry and clothing and adopted them as their own. Maybe you're a Nord from a clan in the southwest of Skyrim that controlled the crossing to Hammerfell and as a result traded with (and raided) Redguards more than with other Nords, adopting their gear?",
            "A Nord who lived in Hammerfell his whole life.",
            "The only possible answer is \"a nord warrior with a curved sword. CURVED. SWORD.\"."
        ]
    }
}