{
    "General Questions and Purchasing Advice Thread — Week of June 24, 2024": {
        "title": "General Questions and Purchasing Advice Thread — Week of June 24, 2024",
        "score": 8,
        "url": "https://www.reddit.com/r/electricvehicles/comments/1dnbra6/general_questions_and_purchasing_advice_thread/",
        "content": "**Need help choosing an EV, finding a home charger, or understanding whether you're eligible for a tax credit? Vehicle and product recommendation requests, buying experiences, and questions on credits/financing are all fair game here.** \n\n# Is an EV right for me? \n\nGenerally speaking, electric vehicles imply a larger upfront cost than a traditional vehicle, but will pay off over time as your consumables cost (electricity instead of fuel) can be anywhere from 1/4 to 1/2 the cost. Calculators are available to help you estimate cost — here are some we recommend: \n\n* [https://www.chargevc.org/ev-calculator/](https://www.chargevc.org/ev-calculator/)\n* [https://chooseev.com/savings-calculator/](https://chooseev.com/savings-calculator/)\n* [https://electricvehicles.bchydro.com/learn/fuel-savings-calculator](https://electricvehicles.bchydro.com/learn/fuel-savings-calculator)\n* [https://chargehub.com/en/calculator.html](https://chargehub.com/en/calculator.html)\n\n# Are you looking for advice on which EV to buy or lease? \n\nTell us a bit more about you and your situation, and make sure your comment includes the following information:        \n\n>\\[1\\] Your general location  \n>  \n>\\[2\\] Your budget in $, €, or £  \n>  \n>\\[3\\] The type of vehicle you'd prefer  \n>  \n>\\[4\\] Which cars have you been looking at already?   \n>  \n>\\[5\\] Estimated timeframe of your purchase  \n>  \n>\\[6\\] Your daily commute, or average weekly mileage  \n>  \n>\\[7\\] Your living situation — are you in an apartment, townhouse, or single-family home?  \n>  \n>\\[8\\] Do you plan on installing charging at your home?  \n>  \n>\\[9\\] Other cargo/passenger needs — do you have children/pets?\n\n*If you are more than a year off from a purchase, please refrain from posting, as we currently cannot predict with accuracy what your best choices will be at that time.* \n\n# Need tax credit/incentives help? \n\n* 🇨🇦 CAN — [Transport Canada iZEV Program](https://tc.canada.ca/en/road-transportation/innovative-technologies/zero-emission-vehicles)\n* 🇺🇸 USA — [Clean Vehicle Provisions of Inflation Reduction Act](https://home.treasury.gov/news/press-releases/jy1179)\n\n# Check the Wiki first. \n\nDon't forget, our Wiki contains a wealth of information for owners and potential owners, including:\n\n* [EV Databases](https://www.reddit.com/r/electricvehicles/wiki/index/evreleases)\n* [Dealer Markup Tracking](https://www.reddit.com/r/electricvehicles/wiki/index/dealermarkuptracker)\n* [General Resources](https://www.reddit.com/r/electricvehicles/wiki/index/resources)\n\n*Want to help us flesh out the Wiki? Have something you'd like to add? Contact the mod team with your suggestion on how to improve things, we can discuss approach and get you direct editing access.*",
        "num_comments": 98,
        "comments": [
            "We live in AZ and are looking to lease a new EV for a second vehicle. Work from home and would like an EV SUV to drive around town, average 10k miles a year. Living situation - house with solar and planning on installing a 240 outlet. \n\nWe're ready to lease. Test drove a Hyundai Ioniq5 and Kia EV6. Planning on test driving a Tesla Y, VW, and Chevy Blazer.",
            "With EV tech accelerating, do more people lease than buy? I'd imagine having a car for 3 years then getting the latest tech would be appealing",
            "Can anyone tell me if they have had luck getting the EV tax rebate with a used vehicle? I know that dealerships need to opt in to the program and don't have to offer the tax credit but I've heard others also say that they don't do it on used vehicles even when the rules on the tax credit specifically State used vehicles with so many transfers are accepted.",
            "My work wants to install additional charging ports for employee's who own an EV. I'm currently researching what the best options are. We are in the USA and would like something reliable, and fast charging. So something that would be capable of 50a or more. Not as worried about the cost, just more so about the best candidates in todays market would be.",
            "I'm buying from a dealer that submitted their info to be able to take advantage of advanced payments (dealer banking info, etc.) last Wednesday. The website told them it should be done within 48 hours, yet it's been 9 days now (7 business days), and it still hasn't been processed.\n\nHow long does that process actually take? Any dealers here that have experienced the wait? I'm carless and on a timeline so this is getting more frustrating each day that passes.",
            "My apartment complex is allowing us to use a unused dryer outlet to charge.  They will not be providing the 240v level 2 charging equipment, just the outlet. Maintenance told us it is a NEMA 10-30 outlet and has a 30AMP fuse. My question is, does my 40 amp portable charger pull 30 amps, as I wouldn't want it to pull more than 24 amps to prevent issues with the outlet. Would I need to by a new portable charger that limits to a 24 amp draw?",
            "Can someone help me understand how to use the car lease calculator when buying EVs. I.e, how does the $7500 credit come into play here. Does it get reduced when calculating the capitalized costs",
            "Would you get a Hyundai Kona 319 mile range version for 113 a month or the BYD Dolphin 265 mile range version for 106 a month. This is through a work discount btw.",
            "Any downsides to purchasing used? I'm seeing used EV6 GT with 15k miles for$40k and a GT line with 3k miles for around the same price. I'm curious as to what kind of downsides there are to purchasing used evs.",
            "A little different question, but how long does it take to process the dealership signing up for advanced payments?"
        ]
    },
    "You can now lease a Hyundai IONIQ 5 for less than the cheapest car in the US": {
        "title": "You can now lease a Hyundai IONIQ 5 for less than the cheapest car in the US",
        "score": 410,
        "url": "https://electrek.co/2024/06/28/hyundai-ioniq-5-lease-price-beats-americas-cheapest-car/",
        "content": "",
        "num_comments": 130,
        "comments": [
            "Its $381/mo to lease a versa? Ouch",
            "Almost went with this but went with an ID.4 for 206$ a month & no money down instead. EV leases are crazy rn",
            "I got the excellent lease deal in the Hyundai Kona.  Like $1000 down and $199/month.  So crazy.  No hassle from the dealer.",
            "Hyundai may make compelling cars but they will have to confront their dealership problems sooner than later.",
            "A $35,000 residual?! Hyundai is going to eat it big time when they get these cars back and cant sell them for $10k under that.",
            "With 3500 due at signing. Easy to say it's the cheapest when you got to pay a lot up front.",
            "Great deal. Poorly written article.",
            "the MINI SE comes out cheaper.\n\ndumb article",
            "Can we all agree that leases are just glorified rentals with fancier long term contracts?",
            "Is pay the $10/mo more with no drive off on a 2023 solterra, 1000x over before ever signing papers on a Hyundai."
        ]
    },
    "C-SPAN - Exchange on Electric Vehicles": {
        "title": "C-SPAN - Exchange on Electric Vehicles",
        "score": 104,
        "url": "https://www.youtube.com/watch?v=EgbAQpR3TeY",
        "content": "",
        "num_comments": 36,
        "comments": [
            "Mr. Perry saw what way the wind was blowing as soon as Secretary Buttigieg opened his mouth and immediately started interrupting Secretary Buttigieg's statement to try and run down his time to answer.",
            "I hope he gets a real shot a running if he decides too in the future.",
            "I actually don't care.    \nI'm just going to continually destroy cletus and his coal rolling POS at the traffic light dragraces.",
            "Yeah I dont get the whole were forced to buy EVs thing",
            "you can only run from reality for so long before you wake up in a world you don't understand. Thankfully Biden appoints competent people.",
            "Secretary Buttigieg speaks well and composed himself a lot better than I would if I kept getting interrupted like that.",
            "Its so rich when Republicans argue that people deserve choices.",
            "The same CAFE standards and free market that lead to SEVENTY THREE PERCENT of the vehicles on US roads being SUVs or Trucks. FOH with your crocodile tears over freedom to choose",
            "Scott Perry, noted insurrectionist, should be in prison not in a spot to spread lies about EV adoption",
            "Why is he not a choice for president ?"
        ]
    },
    "CNBC: Ford CEO says a profitable $30K EV is coming in two and a half years": {
        "title": "CNBC: Ford CEO says a profitable $30K EV is coming in two and a half years",
        "score": 262,
        "url": "https://www.cnbc.com/2024/06/28/ford-ceo-30000-ev-coming-in-two-and-a-half-years-at-a-profit.html",
        "content": "",
        "num_comments": 85,
        "comments": [
            "Fiesta EV? That would be sick. Bring back the hot hatch",
            "And in two and a half years that will climb to over $40k. Just watch.",
            "Probably a Chevy Bolt competitor, which should land around the same time.",
            "Ranger EV would be bad ass. I still cannon understand how they didnt make the explorer EV. That thing already sells would and would get a lot of model Y buyers who just dont want an Elon mobile",
            "When it hits the dealerships it will go up to 45 - 50k",
            "2 1/2 years for a 30K EV?  Seems long away. Where will everyone else be?",
            "With or without the tax credit though",
            "*** In US. There are affordable Evs in other places",
            "And 200 lucky buyers will be able to purchase it.",
            "Name it the Model E for lols"
        ]
    },
    "2025 Chevy Blazer EV Review: Gremlins cleared, it's a winner once again": {
        "title": "2025 Chevy Blazer EV Review: Gremlins cleared, it's a winner once again",
        "score": 46,
        "url": "https://www.autoblog.com/article/2025-chevrolet-blazer-ev-review/?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAABsHS33fWw9MjYynXs7YV-dGVaCKpv5JX4ZV2KJNFbPVyTDVZBRBri3Px3_aSdx2SgKc26MIs3uBR3Zyu1al-M2c-vNc9YnVGzXg1LKSuE6W-pXJ-33pGVl0FSKlK-xaMru-xptfBjjgIApHBpeIUmH9QLBhDAh0z83i1QtamNBd",
        "content": "",
        "num_comments": 36,
        "comments": [
            "I'm still wondering what the distinction is between the Blazer and Equinox.",
            "Meh charging speed; small cargo area; no Apple CarPlay or Android Auto",
            "Those AWD prices are going to be tough with the competition out there",
            "looks like Volvo DRL, why cant they design some original lights.",
            "The Blazer's larger and has optional 4WD I believe.",
            "All for worse specs than the Model Y at similar prices.",
            "Android automotive so you got all apps available on android like Waze, gmaps, youtube, netflix and Spotify. Those things are redundant. Create a Google account and sync everything over the cloud",
            "I got one because it was a killer lease deal. Wouldnt buy it though for the aforementioned points",
            "According to Chevy, the Blazer is only 1\" longer, and 1\" wider, both are 65\" tall. As a guy, I may be biased, but I can't imagine an extra 1\" is going to make that big of a difference.",
            "Equinox EV has a faster, AWD option coming. The big difference is that its single-motor version is only FWD. It will never get RWD. Last I read, the Blazer was supposed to get all of the configs (AWD, RWD, and FWD), eventually."
        ]
    }
}