{
    "[DAILY Q&A] Ask and answer any questions you have about the game here!": {
        "title": "[DAILY Q&A] Ask and answer any questions you have about the game here!",
        "score": 4,
        "url": "https://www.reddit.com/r/EliteDangerous/comments/1dqn4ef/daily_qa_ask_and_answer_any_questions_you_have/",
        "content": "Greetings, Commanders! This is the **Daily Q&A** post for /r/EliteDangerous\n\n***\n\nIf you have any questions about any topic, whether it be for the moderators, tips and tricks for piloting or general gameplay/development questions please post here!\n\nPlease check new comments and help answer to the best of your ability so we can see this community flourish!\n\n**Remember to check** [**previous daily Q&A threads**](/r/EliteDangerous/search?sort=new&restrict_sr=on&q=flair%3ADaily+Q%26A) **and the** [**New Q&A FAQ**](/r/EliteDangerous/wiki/faqpart2)**.**\n\n***\n\n[Wiki](https://elite-dangerous.fandom.com/wiki/Elite_Dangerous_Wiki) • [Career Chart](https://www.reddit.com/r/EliteDangerous/comments/8of96y) • [Lore](https://elite-dangerous.fandom.com/wiki/Elite_Dangerous_Timeline#34th_century) ([Brief](https://www.reddit.com/r/EliteDangerous/comments/9jxqpf)) • [Thargoids](https://www.reddit.com/r/EliteDangerous/search?q=subreddit%3Aelitedangerous+author%3Aburtonsimmons+thargoids+edition&restrict_sr=on&sort=new&t=all) • [Sagittarius Eye Magazine](https://www.reddit.com/r/EliteDangerous/search?q=subreddit%3Aelitedangerous+author%3ASagittariusEye+Sagittarius+issue&restrict_sr=on&sort=new&t=all) • [The Elite Squadron](https://www.reddit.com/r/EliteDangerous/comments/a6p60k)\n\nGame Update Summaries: [Core](https://elite-dangerous.wikia.com/wiki/Development_Plans#Season_1) • [Horizons](https://elite-dangerous.wikia.com/wiki/Horizons) • [Beyond](https://elite-dangerous.wikia.com/wiki/Elite_Dangerous:_Beyond) • [2019-2020](https://elite-dangerous.fandom.com/wiki/Development_Plans#2019-2020_Updates) • [Odyssey](https://elite-dangerous.fandom.com/wiki/Elite_Dangerous:_Odyssey)",
        "num_comments": 18,
        "comments": [
            "Is there an easy way to target/select a particular fleet carrier that your travelling to (for a delivery).  Right now, the best way I know is to go to the system, hang out in space just waiting to be interdicted while I'm scrolling through the list in the System map.  Is there anywhere I can paste the name in to search or some easier way to find one in a list of 30 or 40?",
            "Is there a safe way to enter glide mode instead of alway dropping into planetary flight? I've tried for an hour and I can't get it to work. I've tried reducing speed, keeping an eye on the angel and also the descent rate but whatever I do, I just get dropped in to planetary flight.",
            "Very new to the game, I've owned it for a long time but finally decided to jump in and commit to it after having tried NMS, Citizen and Empyrion more recently. \n\nIn order to jump or navigate to a location in the list of locations in the '1' screen I simply scroll up and down, but is there a faster way to find where my mission objective is or waypoint I set is without going up and down? I don't mind doing it, just curious if I may have missed or overlooked some instructions in the intro or if it's hidden in a mechanic of the game?",
            "What should i do if i am farming g4 raw mats at the brain trees and no g4 mats spawn? I am at the locations indicated in a previous reddit post",
            "How big is the difference between all 4 difficulties of AXCZ?",
            "It kinda depends on what you like to do.  Combat or exploration?  Your fleet makeup suggests maybe you're not that big into trading.  Do you like running missions?  Do you like the meta game?  Any of this ringing a bell?  As far as what areas are safe, I would say the answer is both anywhere and nowhere, depending.  It's *mostly safe* anywhere you go.  I would stay within about 100 light years of where you are at the moment.  The biggest danger is getting stuck way out in the deep black without a way to get home.  If you stay within a few jumps or so, that's less likely to happen.  If you have anything in your cargo hold, you're going to get jumped by (NPC) pirates.  Whereas if you have nothing or only limpets in your cargo hold, they'll mostly leave you alone.  If you play solo mode (chosen when you first open the game), that's pretty much all you have to worry about.  If you play open, then there are a few systems - Deciat and a couple of others, where player gankers like to hang out, or so I'm told.",
            "Are you playing on Horizons?  There are certain planets (with thin atmosphere) that are only landable if you have Odyssey.  But it's not particularly intuitive.  It just drops you out without giving you glide mode, and you're like wtf?",
            "Thanks.  Yeah, that's basically what I was doing.  Only, mapping ahead of time only works if it's a system you've been in before, which for a newer player, is not many.  I did notice just today that at least the Carriers are listed alphabetically by their user-given name, so if I know that I should be able to find it more quickly than having to read each one.",
            "o7 Commanders.\n\nSo I just picked up the game again after a few years of not playing. I went through all the tutorials again to refamiliarize myself with the game, but now I'm back into the actual game I have no idea what to do next. I spawned in at Long Sight Base in what seems to be an exploration ship. I looked in the galaxy view and also saw I have about 6 ships scattered amongst 3 different ports. Here are my current assets:\n\n\\* Vulture @ Diaguandri\n\n\\* Python @ Irula\n\n\\* Sidewinder @ Diaguandri\n\n\\* Dimondback Scout @ Diaguandri\n\n\\* Anaconda @ Diaguanadri\n\n\\* Fer-de-lance @ Diaguandri\n\n\\* ASP Explorer @ Long Sight Base (this is what I spawned in)\n\n  \nMy questions are, where do I even go to get started again in this game. I like playing in the open world, but I'd also like to stay safe until I understand where I'm taking a risk again. What systems are safe to be in? Furthermore, I'm sure I had different ships for different purposes, but I don't even know where to begin to figure that out. It certainly looks like Diaguandri was my \"home\" base so to speak, but I'm not sure why I'm currently in Long Sight or why I have a Python in Irula.\n\nAny tips/guidance to get me back into some kind of understanding of this game so I can start accomplishing some goals again would be very helpful.\n\n  \no7",
            "Diaguandri is a popular system for buying ships and modules due to some of the highest availability and lower prices. \n\nI would guess your ship catalog is this:\n\n* Vulture - bounty hunting and dogfighting ship\n* Python - multipurpose, so could be used for anything, but likely combat or cargo\n* Sidewinder - starter ship\n* Diamondback scout - might be a fighter, or maaybe explorer\n* Anaconda - multipurpose, but probably your big space combat tank\n* Fer-de-lance - top-tier big fighter\n* Asp explorer - likely an explorer vessel"
        ]
    },
    "Python Mk II & Updates to the Gamestore": {
        "title": "Python Mk II & Updates to the Gamestore",
        "score": 426,
        "url": "https://www.elitedangerous.com/news/python-mk-ii-updates-gamestore",
        "content": "\"Greetings Commanders,\n\n3310 is a busy year for Elite Dangerous, with three Titans down already, Powerplay 2.0 in the works, four new ship variants on their way AND the other new feature we have not shared with you yet.\n\nThis year will also see us celebrate our 10-year anniversary - the love and support you have shown us over the years has been nothing short of incredible, and we want to share with you some other changes coming this year.\n\n#GAMEPLAY ADDITIONS AND CHANGES\n\nWe are excited to share more on Powerplay 2.0 over the coming months as we get closer to Update 19. We are confident the rework of this feature will not only allow players to pledge, engage with, and support their chosen power, but also visually see the impact their efforts have on the galactic landscape.\n\nIn addition, we will also be making some balancing changes to Engineering. Our focus will be on making Engineering more accessible and predictable, allowing you to focus on your ship build rather than the materials needed. As stated in the past, we also have another brand-new feature coming to Elite Dangerous later this year.\n\n#GAMESTORE AND PRICING\n\nOver the past few years, many of you have identified that the store has become hard to navigate and that it is difficult to find the content that you really want, with this in mind we will be refreshing the store to provide a better experience for our players.\n\nStarting in May 2024, you will notice a change in how we approach the gamestore – which will also include ARX pricing adjustments for some of our cosmetic items, alongside new product types which are detailed below. Players will continue to be able to earn ARX in-game by playing Elite Dangerous daily, or by contributing to events in game.\n\n#SHIP VARIANTS\n\nWe are excited to bring ship variants into Elite throughout the year and are looking forward to seeing how you make use of each one. Starting with the Python Mk II, we are pleased to announce that this will be available in game for Odyssey players on 7 August for credits at Shipyards across the galaxy.\n\nHowever, if you cannot wait until then you can get 3-month early access to this ship on 7 May from the store for 16250 ARX.\n\nNon-Odyssey owners will be able access ship variants from the store for ARX.\n\n#PRE-BUILT SHIPS\n\nWe’re also going to be introducing a new category in the Elite Dangerous gamestore: Pre-built Ships. Pre-Built Ship packages will offer Commanders the opportunity to purchase ships that have been given a significant upgrade from their base models.\n\nWe envision these Pre-built Ships to be a quicker way for newer players to get involved in the areas they have the most interest in, or for our existing players who are considering a new career path in game, but do not have time to devote to a new build from scratch.\n\nA ‘Pre-built’ ship package will include instant-access to a pre-fitted ship, a ship kit, and a paintjob – and will typically be themed to match an activity within the game. For example, if you’re looking to jump into the current AX conflict against the Titans, the AX Combat Jumpstart package will give instant access to an Alliance Chieftain with all the necessary modules to go straight into the action within the maelstrom.\n\nThe Python Mk II will also launch with a Pre-built Ship package, allowing you to kickstart your career in the latest ship, including a brand-new paintjob and ship kit.\n\n#COSMETIC ITEMS\n\nA ‘Best Sellers’ section will be added to the gamestore, including some of our most popular items, allowing Commanders to purchase items such as Midnight Black, Stygian and Chromed all year round. We will continue to add to the store throughout the year with that same focus on items that players care about the most.\n\nWe’re excited to roll out Powerplay 2.0 and the Python Mk II, and we’ll have more to show regarding Engineering and the brand-new feature coming later this year in future Frontier Unlocked livestreams. \n\no7\n\nArf",
        "num_comments": 935,
        "comments": [
            "Prebuilt ship purchased with arx. What happens when you die and you don't have a rebuy?\nI mean if they are meant for new players thus is bound to happen. I'm curious how they're going to deal with this.",
            "Wait what? Pre-built ships will be purchasable with ARX only?",
            "A storm is brewing, a mighty brown storm..",
            "So the ship is ready, but you guys are holding it back...?",
            "This is just not a stunt you pull when you havent released a ship in 5 years",
            "Does prebuilt mean engineered ? Will that mean it will be possible to buy prebuilt engineered large ships for real money ?",
            "Lifetime expansion pass get any cheeky bonus or nada?",
            "Ship variants being sold for ARX months before being available for credits is questionable, but making engineering \"more accessible and predictable, allowing you to focus on your ship build rather than the materials needed\" sounds promising.",
            "Ship sales in Elite??? never thought id see the day!!!  having trouble believing my eyes",
            "Is that their way of screwing over lifetime pass owners? Not impressed, as usual."
        ]
    },
    "Found a system with 60 bodies": {
        "title": "Found a system with 60 bodies",
        "score": 53,
        "url": "https://i.redd.it/44pq5yh79h9d1.jpeg",
        "content": "",
        "num_comments": 9,
        "comments": [
            "There are two more in my basement ",
            "I really thought I buried them deep enough.",
            "Wow! That's a lot of bodies!",
            "What's your body count? Hehe",
            "Here's an interesting one:\n\nEesholt LH-V e2-63\n\n138 bodies, the highest count in my database so far",
            "Nice find on your 60 stellar bodies Commander, here is one that you might want to add to your list as an 'already found but big' system.\n\nPRAEA EUQ UJ-I D9-0 (61 Bodies)\n\no7\n\nCMDR Kane",
            "What",
            "The title.",
            "There have been several times where I realize that, without context, some of the phrases we say in Elite Dangerous could be very concerning.  This is one of them.\n\nI remember a time where I was running a Vulture with dual PAs, and i was playing with another guy over Discord.  We were farming bounties.  My roommate walked by right as I said to the guy I was playing with, \"Yeah that one didn't survive.  I pumped several plasma accelerator rounds up his butt.\"\n\nMy roommate did a double take."
        ]
    },
    "bright star moment": {
        "title": "bright star moment",
        "score": 161,
        "url": "https://i.redd.it/ok4gub5jbe9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Now try it with VR",
            "I play Elite with an entire wall of Philips Hue and Nanoleaf lights, so when I drop in on a big star I legit get flashbanged.",
            "I'm out at a firework show(hasn't started yet, but it's relatively dark). Someone took a picture in my direction while I was about to open the pic, and that was literally my face.",
            "The amount of times my monitor has flashbanged me while jumping... They really need to give all commanders some complimentary sunglasses with every FSD purchased.",
            "lucky my LG ~~in lab~~ got only 300 nits",
            "LMAO ",
            " whoa!",
            "https://www.reddit.com/r/EliteDangerous/comments/ljamdc/first_time_playing_got_to_a_bright_system_and/"
        ]
    },
    "Sooo far": {
        "title": "Sooo far",
        "score": 50,
        "url": "https://www.reddit.com/gallery/1dr3kg9",
        "content": "#iykyk",
        "num_comments": 2,
        "comments": [
            "Did you just have this made?  I kind of want to get one, but with a picture of an Anaconda on it.",
            "For the MUG!"
        ]
    }
}