{
    "Song of the Week #577: On Fire": {
        "title": "Song of the Week #577: On Fire",
        "score": 36,
        "url": "https://www.reddit.com/r/Eminem/comments/1dof1g2/song_of_the_week_577_on_fire/",
        "content": "[](/r/Eminem)\n\nWelcome everybody to the third and very last SotW of June! We're closing out the month with another 'Recovery' track. We're returning to the album after making a really small detour of just a few weeks. The track that we will be listening to for the next seven days, is 'On Fire'. \n\nSeguing into the mix right after the end of previous track ‘Talkin’ 2 Myself’, ‘On Fire’ is led by a hypnotizing boom-bap beat produced by Mr Porter, also known to many fans as Kon Artis from D12, which very much stays the same throughout the whole track albeit with some pauses and removal of elements to allow Eminem's voice to take more of the spotlight for brief moments. \n\nEm flat out states that this track is no more than 'a bullshit hook in between two long ass verses'. It sort of sounds like he’s making fun of the listener for putting any emotional investment into this track, which he’s no stranger to doing. But looking deeper into the lyrics, there’s nothing much that you really have to latch onto. Em is just flowing and rhyming really effortlessly. \n\nHe references Flo Rida and Brooke Hogan, throws a shout-out to the track’s producer, and makes a witty remark about Michael Jackson, who at the point of the album’s release had only been dead for just under a year. The whole track is just Em reminding us that he’s very good at what he does, culminating in the hooks where he tells us he’s on fire the way he’s able to rap so well.\n\nEvery week there will be a new song that gets featured at the top of the subreddit. Users can leave a comment and the song that gets the most votes might be the new Song of the Week. Suggestions for improving the next post are encouraged.\n\n**This week's Nominator:** [RedHood11006](https://www.reddit.com/r/Eminem/comments/1dia59d/song_of_the_week_576_drug_ballad/l92jm6q/)\n\n**The Song:** [On Fire](https://play.spotify.com/track/6HLZaECJKDjNE0jiGBeqxz) - [iTunes](https://music.apple.com/nl/album/on-fire/1440759247?i=1440759526)\n\n**In-App link(s):** spotify:track:6HLZaECJKDjNE0jiGBeqxz\n\n**Featuring Artist(s):** None\n\n**Length:** 3:33\n\n**Recorded:** 2009 - 2010\n\n**Release:** June 18, 2010\n\n**Album(s):** [Recovery](https://play.spotify.com/album/3PogVmhNucYNfyywZvTd7F) - [iTunes](https://music.apple.com/nl/album/recovery/1440759247)\n\n**In-App link(s):** spotify:album:3PogVmhNucYNfyywZvTd7F\n\n**Sample(s):** [Peace and Love \\(Amani Na Mapenzi\\): Movement IV \\(Encounter\\) - Mandrill](https://www.youtube.com/watch?v=gXCcPAk2NBY)    \n\n**Media:** Album: [Cover](http://i.imgur.com/nEnmIUJ.jpg) / [Alternative](http://i.imgur.com/Fetlz20.png) - [Back](http://i.imgur.com/Fo7s39m.jpg)\n\n**Label(s):** [Shady Records](http://shadyrecords.com/), [Aftermath](http://www.aftermathmusic.com/), [Interscope](http://www.interscope.com/)\n\n**Format:** Digital, Disc, Vinyl\n\n**Producer(s):** Mr. Porter\n\n**Extra:** [Lyrics ](https://genius.com/Eminem-on-fire-lyrics) | Video: [Official Audio](https://www.youtube.com/watch?v=hmqSuMX5fyM) - [Lyric Video](https://www.youtube.com/watch?v=0DQispWoIyA) | Full header image\n\n**Live Performances:** [Red Bull EmSee Freestyle Battle Event 2010](https://youtu.be/caaHdG5RJo8?t=176)\n\nThis is an open thread for you to share your thoughts on the current SotW or to nominate a new song. Avoid vague statements of praise or criticism. This is your chance to practice being a critic.",
        "num_comments": 8,
        "comments": [
            "One of my favorites from recovery. Not talked about enough imo.",
            "Yooooooo thank you! I’m glad you wrote about On Fire, definitely underrated",
            "I nominate cold wind blows",
            "\"All I think about\" by bad meets evil, also \"right for me\" by Eminem, must listen if haven't already heard these",
            "HIs voice and flow feel effortless here. Definitely brings you back to his peak freestyle days/vibes.",
            "My fave off recovery",
            "I Nominate: The Hills (Remix)"
        ]
    },
    "New song Tobey ft Big Sean and Baby Tron out Friday july 3rd": {
        "title": "New song Tobey ft Big Sean and Baby Tron out Friday july 3rd",
        "score": 541,
        "url": "https://www.instagram.com/reel/C8xgHEavWo5/?igsh=Y2k4c2d6ZWFtemJy",
        "content": "",
        "num_comments": 189,
        "comments": [
            "**The date has been changed on the official posts. The song is out July 2nd (Tuesday), video on the 5th (Friday)!**",
            "this shit sounds so damn fire. if big sean and babytron are on the single i know that feature list about to be some heaaaaaat.",
            "![gif](giphy|aUPfvs5MOXpxm)",
            "Man, I didn’t realise just how much I missed and needed to see *Jason-mask* Em again.\n\n![gif](giphy|l0HlKSawAN5ba4oMw)",
            "He's gonna body that beat.",
            "Fuck me we are so *so* back — also, it being a Big Sean collab makes me think the Doomsday pt.2 MV cameos are the likely features of this album\n\n![gif](giphy|3ohzdIuqJoo8QdKlnW|downsized)",
            "Bro loves Spiderman",
            "I wonder if Cole Bennet video Doomsday PT2 was Em teasing his álbum collabs. Because now we have a single with Baby Tron and Big Sean and both were on the video. JID, Tezzo and Swae Lee might be into something too.",
            "My Spidey senses are saying the album is dropping with the music video\n\n![gif](giphy|RN6OnheJ9ZEm4)",
            "He just edited it to Tuesday 7/2????"
        ]
    },
    "Hold on a sec... Houdini, Tobey... what if...": {
        "title": "Hold on a sec... Houdini, Tobey... what if...",
        "score": 448,
        "url": "https://i.redd.it/nwekj84e7e9d1.jpeg",
        "content": "Every song on his new albums are named after a famous person and they are all the suspects about who killed Slim Shady?\n\nThis could be his more thematic album ever!",
        "num_comments": 63,
        "comments": [
            "Can’t wait for the track “Eminem”",
            "So Houdini killed Slim Shady ?",
            "[deleted]",
            "Im sorry, Tobey?",
            "The Scranton Strangler",
            "The disappointment is going to be big once his album is not as tightly concept as some people are putting themselves to think. To me, if it's like Kamikaze level \"concept\" it's already good as long as it sounds good, if it's Relapse level of concept it's a surprise.",
            "You are reaching hard. There was no mention it houdini nor any references or storyline. This is just silly",
            "*album",
            "I'm sorry but who exactly is 'Tobey' referring to, I'm not quite familiar with American pop culture",
            "Wheres the BW pictures from? I see Big Sean from bottom right"
        ]
    },
    "Doomsday Pt 2 Video Features Theory": {
        "title": "Doomsday Pt 2 Video Features Theory",
        "score": 524,
        "url": "https://www.reddit.com/gallery/1dqueoz",
        "content": "\nWith the new single just announced and Big Sean and Babytron both being featured, the theory that the people in the Doomsday Pt 2 video would be the features on Em’s album still holds up. For those who don’t remember the list was:\n\n-Big Sean\n-JID\n-Denzel Curry\n-Teezo Touchdown\n-Babytron\n-Swae Lee\n-Cordae\n\nWhat are your guys’ thoughts? Would you be happy if this turns out to be the actual feature list?",
        "num_comments": 77,
        "comments": [
            "I would kill for a Denzel and Em song",
            "I hope we can get some great pictures out of this song with Em in that Jason mask and chainsaw. I want some posters for my wall",
            "Denzel and Em would go fucking crazy",
            "Gimme cordae, kendrick, royce, and wayne that would be legendary.",
            "man i truly hope he features his own artists. There's only like 3 of them. Having them feature on em's album is probably the best promo they'll ever get in their career. I'd like to see Grip on some cole bennett joint too.",
            "Teezo might fuck around and give Em a fire hook",
            "YES SIR !!!!!",
            "I'm surprised no one mention he's using a full on horrorcore beat.\n\n\nHe's going back to what people loved",
            "Add cole in for good measure as he was mentioned in the song",
            "I NEED JID \n\nif i were get him on the album i don’t care about the other features"
        ]
    },
    "What's the best thing Eminem has done?": {
        "title": "What's the best thing Eminem has done?",
        "score": 546,
        "url": "https://i.redd.it/lkz2sol3bd9d1.jpeg",
        "content": "Other than making good music ",
        "num_comments": 132,
        "comments": [
            "Might be a corny answer but I’ve always admired him for being a great father. He gave his daughter the life he never had. I also think it’s such a wholesome thing that he adopted his other 2 daughters, he got them both out of bad living situations and one of them is the child of his ex wife’s lover, lots of men couldn’t look past that. I think Marshall is a great person deep down despite what he wants us to think.",
            "I feel like he’s a rare example of honest and successful recovery. He remembers what he’s been through and where he came from, but he’s always been generous with his friends and given a lot to charity. He keeps going despite failures, and while I’m not a Stan, I find him to be quite inspiring.",
            "He has given done a lot of work with charities, donated huge sums, started the Marshall Mathers Foundation which focuses primarily on at risk youth in the Detroit area and we can't forget Mom's spaghetti and the many less fortunate that he feeds through the restaurant. He has also helped lesser known artists and often shouts out his musical influences which helps to introduce them to new audiences. Em has also used his platform to speak on political issues and especially issues that affect the black community, which Em credits with saving his life. But if you ask Em the best thing he has done it would probably be raising 3 daughters who don't seem like your usual rich brats.",
            "moms spaghetti",
            "What’s going on in this picture?",
            "Revival interlude that was for someone who was going to be on a song on revival but she died before they recorded it only got that snippet",
            "recovering from his addiction",
            "One thing that was cool that definitely flew under the radar was during Covid he was doing food donations to first responders giving them a lot of food as well as doing a contest for djs with a cash prize as well as work through the radio as a way to give them some money during the pandemic. It was all within Michigan.",
            "Adopting Whitney and Alena both were kids who needed I loving parent and em stepped in when he really didn't need to em loves those kids more then anything",
            "Since everyone has already covered my favorite things about him (besides music), his fatherhood, sharing and inspiring through his sobriety journey, his philanthropy, etc... I'll add the diamond cockrings he gave Elton John and his husband for his wedding. Ally!"
        ]
    }
}