{
    "Feedback: How are the mods and the subreddit doing?": {
        "title": "Feedback: How are the mods and the subreddit doing?",
        "score": 1,
        "url": "https://www.reddit.com/r/EngineeringStudents/comments/1dqhzjp/feedback_how_are_the_mods_and_the_subreddit_doing/",
        "content": "Put your feedback here! Please remember, mods are human and our changes are a response to community feedback!\n\nLet us know of some things you've noticed, or things you might want addressed!",
        "num_comments": 1,
        "comments": [
            "I think it might be helpful to offer flairs for country? We get a lot of people from India/the Philippines/etc. who dont necessarily state their location at first and then get advice targeted to US/UK engineers."
        ]
    },
    "Friday Check-In": {
        "title": "Friday Check-In",
        "score": 3,
        "url": "https://www.reddit.com/r/EngineeringStudents/comments/1dqhzjh/friday_checkin/",
        "content": "How are you doing? Had a rough week? Did you murder that exam in Fluids? Need a pick me up? Post here and commiserate together!",
        "num_comments": 5,
        "comments": [
            "I passed orgo. Just need to pass stat for research and the summer classes will be over!",
            "Have been being a total bum in my summer class. But I need to pass it. Time to go scorched earth.",
            "Prof said good job on a final presentation I submitted today. Summer classes are kicking my butt tho",
            "Finished a project proposal for my internship, now I should just be chilling for the rest of the internship duration ",
            "I'm already thinking about going back to school in September and my stomach's in knots"
        ]
    },
    "Update: I keep fucking up at my internship ": {
        "title": "Update: I keep fucking up at my internship ",
        "score": 317,
        "url": "https://www.reddit.com/r/EngineeringStudents/comments/1dqo59w/update_i_keep_fucking_up_at_my_internship/",
        "content": "Usually I don’t update posts but this saga has convinced me I should give up work all together and become a communist. \n\nSo on Thursday I woke up early to go buy the admin lady chocolate as suggested by a user. I got her like 7 chocolate bars of her favorite chocolate (they only had small ones). This made me look ridiculous and probably a little crazy but it’s all for the gratitude and I’ve already made a fool of myself enough. This was a great idea and she really enjoyed it, so thank you Redditor! She ensured it was all okay and not to worry about it. \n\nThe rest of Thursday was great. The problem is today is Friday and the same cannot be said. \n\nThe day starts normal enough. I ride with another intern to one of our fracking sites (parking is super tight on these so it’s better if we go together). I’m feeling good. I’m taking a nap. All of a sudden we get to this annoying road construction (they’re paving this 1 lane one lane at a time so they have to stop traffic on one side of the road. The road isn’t even that damaged. Small towns are so strange.) \n\nAnyways beside the point we’re going through this narrow lane. There’s like 5 road construction people doing shit all and one guy working. I’m annoyed. All of a sudden I’m not feeling good. There’s ofc no where to pull over because this town of 454 people decides the roads need to be better. I’m telling the other intern to pull over and once he does, folks it’s too late. I vomitted all over this dudes truck. I tried my best to clean it up but no luck. While I’m out of commission vomiting guess who he calls? The admin lady! \n\nSo now she’s in charge of getting this truck I vomited all over detailed after I just apologized for making a mess for her. My luck, but wait it gets worse. \n\nIt’s at this point an hour away from the office we decide I should probably do a day in the office if I’m not feeling well. I just vomited but I felt ok, so I thought I’d be able to maybe finish the day off doing some paperwork. In the hour drive it quickly becomes apparent that that shit is not happening. I have my head in a bag, I’m mumbling words like Joe Biden. Situation is not good. When we get to the office I just crumble onto the asphalt and the other intern has to drag me to bathroom where, no surprises, I’m back to vomiting instantly (honestly proud I made it to the bathroom.)\n\nGuess who this mfer gets to help me?! The admin lady. At this point it’s apparent I’m having a severe migraine or something, I’m vomiting in a pitch black bathroom and this sweet angel just wants to help me. She grabs me a coke and some gold fish and leaves me where I’m writhing on the bathroom floor in pain. \n\nThe worst part? This is bring your children to work day, which the admin lady, as her name suggests, is in charge of. Not only is she dealing with all sorts of children (and a bouncy castle), but now this sick young adult. \n\nY’all. \n\nShe asks and gets my boss to allow me to go home early and then offers to drive me to the hospital/home. It takes me 3 hours of bathroom pain writhing to get it together enough to go. Hospital because a bitch is sick, so there goes all my sweet summer internship money. \n\nCurrently I’m just waiting in the ER, feeling way better but hoping to figure out what could even be wrong. I’ve resigned to be the intern known for either bad luck or throwing up in the company truck or ruining the carpet take your pick. \n\nTL;DR: Chocolate was a good idea but now I need a gift to apologize for vomiting in a company truck and driving me to the ER\n\nI’ll edit this when I’m less sick so sorry for any errors. \n\nPost-Hospital Update: So my white blood cell count is elevated which means I most likely had an infection. What kind? No clue because I discharged myself. \n\nIn fairness they gave me some nausea stuff and fluids and tests but I couldn’t stay there any longer. My luck is truly terrible. The man I was sat next to in the pending area while waiting for test results had the same thing happening that my aunt recently passed from. Now she didn’t die from this (we actually don’t know exactly what she did die from) but it was the start of her declining health. He was a diabetic whose foot was starting to necrotize. I didn’t think that was that common but I guess enough so that I ended up next to him. Guys I tried to hold on and I did for a few hours but when the nurse came and started talking about it I just had to leave. I was pretty hysterical and just sobbing. I was like crying to the nurse asking if I could get discharged. I have a way to get my test results thankfully so it isn’t that big of a deal. \n\nI wasn’t able to go to my aunts funeral cause the same thing happened there (spontaneously throwing up, migraine like symptoms) and it just hit me how much I miss her. \n\nI’m doing an internship really far from home so the only person I know to drive me home is admin lady.  I had obviously been crying a lot and I think she thinks I’m suicidal now… so… not great. She stressed the good support network around as well as triple checking with me that I’d contact her if i need help. This poor lady is so kind.  So not only did I ruin a carpet, vomit in a truck, and need a ride to the ER, I also had a mini-mental breakdown. Don’t know if flowers will cover this one boys. \n\nThis isn’t even including the $300 copay I paid to find out pretty much nothing. \n\nIf anything crazy happens I’ll update but for my sanity I hope the next update is just an “it’s over.”",
        "num_comments": 55,
        "comments": [
            "Do you have a history of consecutive bad luck? Most of what you described is pretty typical of someone whos never worked before, albeit in quick succession. The migraine though, could very well have been caused by the amount of anxiety youre experiencing. \n\nI suggest taking the embarrassment on the chin, accepting what has happened already, and simply agreeing to pay more attention in the future. Every single person makes mistakes, its how you learn from them that counts. Good luck!",
            "A few summers ago I was working at a bakery just as a part time job to get some extra money between school years and on my very first day I had an anxiety attack and threw up on the floor. When I came in for my next shift my manager was shocked and said he thought he'd never see me again but applauded my courage for coming back in. It ended up being an OK job for a summer and I did not have any other major incidents but basically what I'm saying is people will generally applaud you for picking yourself up and getting back on the (metaphorical) horse.",
            "Reading the title I thought it was gonna be some work related fuck up, you've exceeded my expectations OP",
            "Oh jeez this is wild lol. At least it doesnt sound like youre not doing well at your actual job though? Most of these are human mistakes so I feel like as long as youre doing alright on the tasks youre being assigned, these fuck ups can be overlooked.",
            "But while you were vomiting and in pain, did you utilize that opportunity to enhance your professional skills?",
            "OP, I've been tuned into your internship saga and been having a lot of fun reading about while at my actual internship. This one had me stifling inappropriate amounts of laughter. From one unlucky motherfucker to another, I commend you.",
            "Being sick does not reflect poorly on you as a worker. Just relax, get better, and go back to work with your game face on.",
            "As an engineer, youll make far worse mistakes in your career and move on. These are learning experiences. Unfortunately, those experiences can be embarrassing, demoralizing, expensive, and scary. You look at what you did, what you could have done better, implement those changes, and become a better engineer (and person!) in the process.",
            "Wow. If I ever land an internship, Im gonna remember this story. Whatever I do, however I fuck up, Ill always know that its not that bad in comparison to this. \n\nIm sorry OP, joking aside Im sorry this happened to you. Im sure the ones who matter in terms of your position will understand that there wasnt much you could do. I wish you the best of luck",
            "Damn your life is basically a sitcom that I would definitely binge watch. \n\nIm sure things are fine and not as terrible as you tell yourself though so keep your head up!"
        ]
    },
    "Just bombed a midterm, looking for study tips.": {
        "title": "Just bombed a midterm, looking for study tips.",
        "score": 19,
        "url": "https://www.reddit.com/r/EngineeringStudents/comments/1dr3fpc/just_bombed_a_midterm_looking_for_study_tips/",
        "content": "Well I got a D on my pre calculus midterm. Feels bad man. I thought I knew what I was doing. Anyway, y’all have any study tips for studying higher level math in general? I know it’s only gonna get harder  and I’m working full time and have a newborn in the house so I have like 2 hours a day to study. Trying to get the most of it.  ",
        "num_comments": 12,
        "comments": [
            "Damn You have it tough man, solving as much as you can definitely will help, at least it did with me, I used to skip the definitions and most of the course and go straight to the exercises, somehow they made sense but I needed some time to get familiar with and memorize all the formulas. Good luck",
            "I skip reading and go straight to practice. Also familiarize yourself with any rules you use. If possible solve past exams",
            "Try breaking down complex concepts into smaller, more manageable chunks and practice regularly to build a strong foundation.",
            "Practice is the only thing that works for me.",
            "Yeah, when just read the explanation the math jargon makes it even more confusing for me at least",
            "Also there are many great resources online Paul's notes, organic chemistry tutor, khan academy, bprp etc",
            "Thanks for all the info my dude!",
            "Lol @ precalc being hardest",
            "Second vote for professor Leonard, dudes spectacular. Also BlackPenRedPen is good. \n\nWork as many problems as you can possibly manage, and when youre at your wits end, take an hour break eat something, and work more problems. Math never clicked for me until I worked 100s of problems. I took 5 years off between calc 1 and calc 2, only way I passed was brute force working problems for like 8 hours a day. I lived in the math help center. Use every resource you have at your disposal and ask questions to as many different people as you can who might be able to answer. Then work problems. \n\nNo shame in retaking classes. This shits hard, and it doesnt get easier.",
            "The way I managed was to first solve problems with the full solution in front of you. That way you start to familiarize yourself with the right steps you need to make to solve the problem, and prevents any bad habits (i.e. always making the same mistake at a certain point) from forming.\n\nOnce I feel like I'm starting to get it, I put the answer sheet away and try to solve the same problem without the solution. Don't be afraid to use the solution if you get stuck for a while, but before going to the last step make sure that you were able to solve the problem at least once without needing the solution.\n\nFinally, if that worked out well, start solving similar problems 'blind', i.e. try to solve them without looking at the answer beforehand. This prevents you from just learning a specific solution for a specific problem by heart, and forces you to learn the 'concept' that can be used to find any solution for any similar problem.\n\nIf you made it this far, congrats! You just learned how to integrate/differentiate/'insert math concept here'."
        ]
    },
    "How do you rationalize?": {
        "title": "How do you rationalize?",
        "score": 20,
        "url": "https://www.reddit.com/r/EngineeringStudents/comments/1dqzeb4/how_do_you_rationalize/",
        "content": "So at this point I’m going to take maybe 6-7 years to graduate, and I know everyone says “don’t let others influence you” but how do you guys do so?\n\nI hate the fact that in my 3rd year of college I am about to enter a class of freshman in physics 1 due to me failing it last semester. I also hate that in 2 years when all of my friends will be graduating and moving on I’ll have to stay back and keep studying away.\n\nI like the idea of engineering but holy that thought just almost kills me every single time and makes me want to do finance. I’ll have to live my last 2 years with complete randoms or go bankrupt in a 1 bed apartment. With all my buddies on a 4 year track\n\nI know this is negative thinking but I just want to hear people going through the same situations and how they handled it I know it will help. \n\nThank you.  ",
        "num_comments": 19,
        "comments": [
            "Took me 7 years due to failing many classes but I started engineering at 26. My new coworker just graduated and started engineering work at 34. My other coworker graduated and started working at 21. There's no one right path and at the end of the day, you'll be working eventually. But in the end, we all made it and we have the same damn job. \n\nJust don't compare your life to someone else's, and trust your path. They may graduate younger than you but you're learning how to persevere. We all bring something to the table.",
            "Yo I took 10years.. I had buddies graduate in 4 I had many do it in 6. Life happens and taking longer is not bad. It didn't hurt my chances of passing the FE or getting into Graduate school. Just enjoy your time and try your best. Don't compare others journeys to yours, it will only hinder you Mate. Best of luck!",
            "Because Ive work a dead end job now. And I dont want to forever.\n\nEdit: comparison is the theft of joy stop comparing. Just appreciate your own growth. Do your journey. Floop the pig",
            "im kind of in the same situation and i honestly just suffer through it. i dont think im gonna be able to be happy for a long time, but im just hoping to see a light at the end of the tunnel soon. i dont have any friends or peers and my old high school friends (that all moved away and went to different schools) have all graduated and started working or gone on to grad school. comparison aside, im just generally unsatisfied with where i am in life in a vacuum.",
            "Im in the same boat, except junior year but Physics 2 and calc 3. Id rather be an engineer in 6-7 years than not.",
            "You need to focus on your lane, and figure out how to retain your studies and how to make those more effective. But I get it's hard if you were doing it as a group at first, it's hard to shake off the \"feeling left behind\" feeling especially if you feel you're doing your best. Usually when high school finishes that is when everyone starts splitting off, leaving the nest ect. It's just how life is, people are starting to live their lives. For some that means they figured out how to be more effective earlier to get through the problem in front of them. \n\nFocus on being effective for yourself, make it a \"challenge accepted\" moment instead of facing the defeated side.",
            "Lol 9 years here but working full time and having a family tends to eat away at my available time.",
            "Those friends were all randos to you at one time. You will make new friends. Then you will get a job and do it all over again. No one cares how long school took you, especially if you started any time 2020-2022.",
            "Itll take me 5.5 years to graduate (Ill be 27, Covid was tough for me) but I also have 16 months of co-op work experience with 2 companies. Take it at your own pace, if your school doesnt have a co-op program and youre gonna take longer to graduate anyways Id try and find an internship or two, they probably wont affect your graduation time and then you can still come out with some experience.",
            "Completed 80% of an IT degree in my mid 20s. Got bored, quit school. At 31 I found a job in automation and fell in love. Switched to Electrical Engineering, and graduated this May with a 3 year old, 4 month old, and was offered my dream job last year as a SCADA Engineer. Im a success story, sure, but Im 35. Took me forever to get there, and I had to go to school with a full time job, kids, and a wifey. It was worth it. Itll be worth it. Wake up every day and tell yourself that. Youve got ALOT of life to live. Itll be worth it."
        ]
    }
}