{
    "Feedback: How are the mods and the subreddit doing?": {
        "title": "Feedback: How are the mods and the subreddit doing?",
        "score": 3,
        "url": "https://www.reddit.com/r/EngineeringStudents/comments/1dl2bp2/feedback_how_are_the_mods_and_the_subreddit_doing/",
        "content": "Put your feedback here! Please remember, mods are human and our changes are a response to community feedback!\n\nLet us know of some things you've noticed, or things you might want addressed!",
        "num_comments": 0,
        "comments": []
    },
    "Friday Check-In": {
        "title": "Friday Check-In",
        "score": 1,
        "url": "https://www.reddit.com/r/EngineeringStudents/comments/1dl2bot/friday_checkin/",
        "content": "How are you doing? Had a rough week? Did you murder that exam in Fluids? Need a pick me up? Post here and commiserate together!",
        "num_comments": 1,
        "comments": [
            "Took 2 summer courses. Dropped one and I just flunked an exam 3 minutes ago for the other one. It's really soul crushing when it happens."
        ]
    },
    "My professor said hard pass on a 30k robot": {
        "title": "My professor said hard pass on a 30k robot",
        "score": 30,
        "url": "https://www.reddit.com/r/EngineeringStudents/comments/1dlrzu2/my_professor_said_hard_pass_on_a_30k_robot/",
        "content": "Hello,\n\nI am a 2nd year student in romania studying industrial engineering and robotics. Sorry for my bad english I am very angry. \n\nI am the student „leader“ at my professor laboratory of industry 4.0 stuff. So we do plc programming, cfd/fem simulations, 3d printing, iiot, you know the usual. \n\nI am a programmer at heart. I love my python, my react, c++, c#, openCV, Unity and I am really really bad at mechanical engineering. Such is life. \n\nFor the last 6 months I have been begging my professor to get an industrial robot. Since you know, I love programming and a cobot is peak mechanical engineer that can be programmed to do ANYTHING. Also we are a robotics university, at the department of „robotics and production systems“. \n\nYesterday I got a phone call from *insert big robot company here* saying yes we will give a real industrial robot because you are a lab in a univerisity. And my professor was like no thanks. After I begged every company to give us one 4 free.\n\nHere is why I am furious. I have done a lot for that lab. Most of the projects there are even funded by me to some extent because election year and public money from the uni is impossible to get. I bought 14kg of 3d filament in total, vibrations sensors, microcontrollers, my old pc were all used for projects in the lab\n\nAnd he can‘t even say yes to the single thing I have been asking for??????\n\nI will probably remain at his lab and forget this all happened because I am gold fish but I am personally hurt even tho I shouldn‘t be.  \n\nAlso most of the projects he wanted to start have gone terrible wrong and usually only my projects go smoothly for some reason. I would like to detail in the comments later what projects he wanted to do. \n\nSuggestions on what should I do? \nIf I leave the lab, the team will literally not exist anymore. And next year I have a class with him sooo yeah",
        "num_comments": 17,
        "comments": [
            "Don't spend your own money in a business that you don't control. You have the right to be upset and I would be too.",
            "Free robot arms aren't actually free. Who is going to maintain and repair it? Does the city your university is in have any licensed specialists who could maintain it or will the university need to hire and train someone whose sole responsibility is to maintain it? If so, how much will that training cost? And what is the expected salary range of the employee hired for the job? Where does the funding for this come from?\n\nFurthermore, what is the university going to do with such a device? An argument could be made if you were a Ph.D student who literally needed one to further their research, but typically universities don't go for big, shiny, and expensive to maintain toys just because some random fuck off undergrad thinks they'd be cool and fun, especially when that toy requires specialized (and costly!) installation and maintenance.\n\nFinally, it doesn't matter if your professors' projects go well or not, what matters is that they continue to get funding (grants); the university can ignore a LOT of bad behavior as long as the money keeps coming in. _Especially_ if they're tenure. You, on the other hand, appear to be a particularly entitled undergraduate who doesn't understand how universities are run.",
            "He might be also worried about safety. It’s not that simple with robots (well it is, until something bad happens)",
            "read the book never split the difference by chris voss and ask him again with your newfound knowledge",
            "Why was 6 months of him saying no before not enough warning that he would also say no this time? \n\nAre you seriously considering leaving your lab because they won't buy you a big robot arm to play with? \n\n>Also most of the projects he wanted to start have gone terrible wrong and usually only my projects go smoothly for some reason. I would like to detail in the comments later what projects he wanted to do. \n\nThis comes off as very arrogant. Your professor presumably has years of research experience as he runs a lab. Does he have publications? Sometimes research goes wrong. I know I've wasted months chasing dead ends in the lab. You are a 2nd year undergraduate student, do you think it's possible your projects go smoothly because they are generally a little simpler and less novel, and not that you're simply better than everyone else?\n\nIf you really want an arm your best bet is to write a research proposal for a project that would require it and that you stand a chance of achieving. You'll need to determine required space, safety precautions, maintenance and upkeep costs, etc. because if you want to convince your professor to make a significant investment in equipment you need to actually have a use for it and already know everything that is involved in the ask. As others have said, for a master's student maybe. For an undergrad no way.",
            "He has a right to be upset with himself for spending that money and expecting others to give a fuck",
            "Amen. A lesson I learned trying to get money back from an organization with established reimbursement forms and processes. \n\nIf you aren't the one with the budget and the credit card the only things you buy are gifts-in-kind.",
            "As someone who just helped my school surplus 3 large machines that were acquired for \"free\", this is correct. Unless you are faculty you can't be making decisions on large equipment for the school. Students only stay for the time they are there for the degree, they can't accommodate everyone's desires. Faculty stays for the long haul and knows what's best in terms of educational value.",
            "well… he said he is in the robotics department. even if it just sits there it could be a good recruiting tool",
            "Good point. But don’t you think he should’ve said that to the OP while he was going ahead and trying to get one from all of these companies?"
        ]
    },
    "I just failed in 3 subjects...I feel devastated...my parents are ashamed of me..what should I do?": {
        "title": "I just failed in 3 subjects...I feel devastated...my parents are ashamed of me..what should I do?",
        "score": 269,
        "url": "https://www.reddit.com/r/EngineeringStudents/comments/1dl39zv/i_just_failed_in_3_subjectsi_feel_devastatedmy/",
        "content": "Pls help me. I'm an extc student.\n\nEdit: thank you so much everyone for your support and encouragement...I will surely give the exams and get good grades...thanks for reaching out guys.!!",
        "num_comments": 203,
        "comments": [
            "Hello /u/Key_Tumbleweed7328! Thank you for posting in r/EngineeringStudents. This is a custom Automoderator message based on your flair, \"Academic Advice\". While our wiki is under construction, please be mindful of the users you are asking advice from, and make sure your question is phrased neatly and describes your problem. ***Please be sure that your post is short and succinct.*** Long-winded posts generally do not get responded to. \n\nPlease remember to;\n\nRead our [Rules](https://www.reddit.com/r/EngineeringStudents/wiki/rules)\n\nRead our [Wiki](https://www.reddit.com/r/EngineeringStudents/wiki/index)\n\nRead our [F.A.Q](https://www.reddit.com/r/EngineeringStudents/wiki/index/faq)\n\nCheck our [Resources Landing Page](https://reddit.com/r/EngineeringStudents/wiki/resources)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EngineeringStudents) if you have any questions or concerns.*",
            "Welcome to engineering, where many fail subjects, try again, and still make it.\n\nYou can focus at the subjects you failed. But did you look at the ones you passed?\n\nAre you sure your parents are ashamed of you? Most parents wouldn't be.",
            "Just in: Engineering student who has no identity outside of grades fails classes and is now depressed",
            "Do you still want to be an engineer? Learn from your mistakes and don't repeat them.\n\nI've known people who have failed classes before and had to repeat an entire year. They still graduated. Hell, when I was doing my undergrad there was a class known for its high failure rate. The school had to arrange for a special summer class for all the students because there were just too many to repeat it next year with the incoming students.\n\nIt's school. People fail. The smart one will learn why and do better.\n\nSeriously though, sit down and really thing about what happened here. Don't just say you'll \"work harder\" like that will solve everything. Here are some questions you should ask yourself:\n\n* What were you having difficulty with? Projects, assignments, exams?\n\n* Did you understand the material? If not what could you do to learn better? Can you talk to your profs/TAs for help?\n\n* How well did you manage your time? Did you stretch yourself too thin doing extracurriculars? Too many pubnights?\n\n* Do you study/work by yourself? Can you arrange study groups?\n\n* Is you major a good fit for you? (I knew a guy who switched majors in his third year. He said it was the best decision he could have made.)\n\nAlso, talk to a counsellor if you need to.",
            "I had this happen to a Japanese classmate, who just got news that he failed an exam. He got hysteric, shouting things like \"I've dishonored my family!\" and then committed Sudoku right in the front of the classroom by solving random 5th order differential equations until his brain exploded.\n\nIt was very sad.",
            "The only way you really fail is if you don’t grow from the experience by gaining a new perspective and the motivation to improve as both a student and an engineer",
            "It's not the end of the world, take a deep breath and retake the subjects with a fresh perspective.",
            "Reflecting on your short comings and keep trucking along. Don’t beat yourself up too much. \n\nI failed 3 courses in my first sem, took 6 years to graduate EE. \n\nFast forward, 16 months internship experience, 6 months full time experience.\n\nAt my second job in embedded systems sector doing pcb design and embedded Linux making close to 6 figures full comp in the US. \n\nPreparing application for grad school (sub 3 undergrad gpa)\n\nAnything is possible, life is a journey where the learning never stops. Don’t give up",
            "Stop whining, and don't do the same thing twice.  Take some time to consider why you failed, and come up with strategies to make sure you don't do that in the future.",
            "You’ve indicated in some comments that you’re struggling with mental health. Mental health is no joke! You’re an adult, so your medical decisions are for you to make, not your parents. Please please please see a doctor about this! Lots of universities have a clinic on campus, maybe it’s something you could look into."
        ]
    },
    "i hate chemistry but need to pass my tests, what can i do?": {
        "title": "i hate chemistry but need to pass my tests, what can i do?",
        "score": 37,
        "url": "https://www.reddit.com/r/EngineeringStudents/comments/1dlcdrt/i_hate_chemistry_but_need_to_pass_my_tests_what/",
        "content": "as said in the title, i absolutely despise chemistry and just sitting all day studying for my retake exam makes me so mad. any tip to study a subject you hate? ",
        "num_comments": 29,
        "comments": [
            "Hello /u/nebelposer! Thank you for posting in r/EngineeringStudents. This is a custom Automoderator message based on your flair, \"Academic Advice\". While our wiki is under construction, please be mindful of the users you are asking advice from, and make sure your question is phrased neatly and describes your problem. ***Please be sure that your post is short and succinct.*** Long-winded posts generally do not get responded to. \n\nPlease remember to;\n\nRead our [Rules](https://www.reddit.com/r/EngineeringStudents/wiki/rules)\n\nRead our [Wiki](https://www.reddit.com/r/EngineeringStudents/wiki/index)\n\nRead our [F.A.Q](https://www.reddit.com/r/EngineeringStudents/wiki/index/faq)\n\nCheck our [Resources Landing Page](https://reddit.com/r/EngineeringStudents/wiki/resources)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EngineeringStudents) if you have any questions or concerns.*",
            "Take your anger out on it. Get petty and study that prick so much chemistry doesn’t like you either",
            "Study unless you want to retake it again lol",
            "Specifically for chemistry, try online videos like The Organic Chemistry Tutor who does a great job at explaining things.  Generally speaking for classes you hate, put some nice studying music that you enjoy that might help.  For studying do problems and try and understand the concepts (DON’T MEMORIZE).  My fluids professor once said that one way to study is by trying and explain the concepts to a rubber duck.  Literally do that, get an object and explain the concept as if you’re the professor.  I do this all the time and it helps a lot",
            "Honestly if you haven’t really, look for really good lecture/courses online, also better textbooks, I found that if you have good teachers most subjects are not that bad and are kinda enjoyable",
            "I failed the first time because my prof was trash. I found out after like 30% of the class failed... The ones who didn't took chem before. So what I did was made sure I was in the best profs class.",
            "cheat",
            "What do you dislike about it? I always thought it was cool because it involves math and physics.",
            "Find a way to make it more fun.",
            "Convert the hate energy to study energy."
        ]
    }
}