{
    "⭐️ \"What's this thing?\" ⭐️": {
        "title": "⭐️ \"What's this thing?\" ⭐️",
        "score": 4,
        "url": "https://www.reddit.com/r/EnglishLearning/comments/1dl0cny/whats_this_thing/",
        "content": "* What's the name of the long side of a book? >!(a spine)!<\n* What's the name of that tiny red joystick some laptops have on their keyboard? >!(nub⚠️)!<\n* If a hamburger is made from cow, then what is a pork burger called? >!(a pork burger)!<\n\n# Welcome to our daily 'What do you call this thing?' thread!\n\nWe see many threads each day that ask people to identify certain items. Please feel free to use this thread as a way to post photos of items or objects that you don't know.\n\n# ⚠️ RULES\n\n🔴　**Please do not post NSFW pictures, and refrain from NSFW responses.** Baiting for NSFW or inappropriate responses is heavily discouraged.\n\n🟠　**Report NSFW content.** The more reports, the higher it will move up in visibility to the mod team.\n\n🟡　**We encourage dialects and accents.** But please be respectful of each other and understand that *geography, accents, dialects, and other influences can bring different responses.*\n\n🟢　**However,** ***intentionally*** **misleading information is still forbidden.**\n\n🔵　**If you disagree - downvote.** If you agree, upvote. Do not get into slap fights in the comments.\n\n🟣　**More than one answer can be correct at the same time!** For example, a can of Pepsi can be called: Coke, cola, soda, soda pop, pop, and more, depending on the region.",
        "num_comments": 9,
        "comments": [
            "i call that like red joystick the nipple",
            "Long side of a book = spine\n\nRed button/joystick = trackpoint\n\nPork hamburger = hamburger or pork burger",
            "Ham isn’t the root word of hamburger, and also ham is pork, not beef",
            "I’m fluent and only got the first one🫠",
            ">Pork hamburger = hamburger or pork burger  \n\n\nI'd say \"pork sandwich\" instead of pork burger",
            "It's meant to be a tricky question. The answer to the question of \"What is a hamburger made from pork called?\" is >!pork burger!<, much like a hamburger made from turkey would be a >!turkey burger!<. It doesn't have anything to do with the etymology; it's about the current usage. \n\nAnother fun example of this is \"helicopter.\" \"Helicopter\" is made of the constituent parts \"helico-\" from the Greek \"helix\" meaning \"spiral,\" and \"-pter\" from the Greek \"pteron\" meaning \"wing.\" However, it makes more sense intuitively for English speakers to divide the word into \"heli-\" and \"-copter,\" and thus we get words like \"quadcopter,\" \"gyrocopter,\" and \"roflcopter.\"",
            "Where I'm from a pork sandwich is specifically a pulled/shredded pork sandwich",
            "I don't disagree, but I've also never seen a \"pork burger\" on any menu. It's just not a dish that's made.",
            "You can do a quick Google search and find loads of recipes, so they're definitely made, just maybe not or not common where you're living"
        ]
    },
    "🦄 Report Spam and Misinformation 🦄": {
        "title": "🦄 Report Spam and Misinformation 🦄",
        "score": 1,
        "url": "https://www.reddit.com/r/EnglishLearning/comments/1dl0scj/report_spam_and_misinformation/",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Well... There seems to be no rant, so.. is this misinformation?",
            "Do we report Mrinformation too?"
        ]
    },
    "Is this a common phrase to use in US?": {
        "title": "Is this a common phrase to use in US?",
        "score": 135,
        "url": "https://i.redd.it/lmmtf41kr18d1.png",
        "content": "Hi. And thanks in advance. This phrase looks and sounds interesting. Do people often use this phrase, or is it rare?",
        "num_comments": 61,
        "comments": [
            "Yep. I’d say all competent speakers of American English are familiar with this phrase.",
            "yes. everybody would know what it means and how to use it. i say it pretty often. \n\ni also just want to add that sometimes people will say “call it a night” in the same way. means the same thing. you can say “call it a day” at any time of day, including night. “call it a night” one would only use at nighttime.",
            "Yes, and acceptable in all but very formal contexts",
            "Also common in Australia.",
            "I would use it when deciding to stop something for the day.\n\nin the second example in this image, as the scope is greater than a day, I'd be more inclined toward \"call it quits\".",
            "Yes, but the second example is not a good example.\n\nBecause it implies that you'll get back to it tomorrow/ the next time you're scheduled to work \n\nCalling it a day on living and working in a country isn't something unless you're moving to another country permanently and then decide to move back a day later.",
            "Yes.\n\nI do want to mention that the second example given in the picture is either very rare, incorrect, or needs more context.\n\"Call it a day\" is almost exclusively used to mean to be done for a single day. One may \"call it a day\" but return to continue tomorrow. Or one may \"call it a day\" because the task is complete.\nThis seems to imply that she is retiring or moving to a different country. I would not use this phrase in that context.",
            "yes",
            "Yes! I often use a similar statement: “Do you want to call it there?” Or “Let’s call it there.”\n\nThese are informal statements that I use when finishing a long and sometimes incomplete activity (like a puzzle). Great question!",
            "Very common"
        ]
    },
    "Do people use this idiom in the US?": {
        "title": "Do people use this idiom in the US?",
        "score": 103,
        "url": "https://i.redd.it/9k1yfkcv308d1.jpeg",
        "content": "",
        "num_comments": 75,
        "comments": [
            "I don’t think I’ve ever heard this",
            "I've never heard it.",
            "Never heard it and would probably not understand it unless context is obvious",
            "There's a phrase, a line on, meaning you have the potential to acquire something that is rare or scarce.\n\n\"Bob has a line on some Superbowl Tickets.\" Tickets are sold out and nobody can get them but Bob has found someone who might be able to get them.",
            "I've never heard this",
            "No",
            "No. The closest in the US is the phrase “line of work” which means the industry and job someone has. E.g.,\n\n“What your line of work?”\n\n“I’m a software engineer.”",
            "Not in the U.S., no. At least not in present day.",
            "No, I'd be confused.",
            "I’m not in the US. I’m in Australia. \n\nI have heard and used - but only rarely - the expression “does a good line in” to mean broadly the same thing. \n\nBut it’s more a suggestion that the range is large and good. \n\nSo “John’s Cafe does a good line in desserts “ suggests it has a large selection of desserts and that they are also high quality. \n\nIt isn’t a common expression though.\n\nJohn does a good line in anecdotes would be an extension of that. It would suggest John has many anecdotes and they are good."
        ]
    },
    "when refer to someone who has gone, what's the difference between “he is dead” and “he has died”?": {
        "title": "when refer to someone who has gone, what's the difference between “he is dead” and “he has died”?",
        "score": 5,
        "url": "https://www.reddit.com/r/EnglishLearning/comments/1dltr8k/when_refer_to_someone_who_has_gone_whats_the/",
        "content": "Thanks for the answer",
        "num_comments": 5,
        "comments": [
            "Both mean the same thing and but *died* is focused on the act of dying (the verb), whereas *dead* focuses on their current state (adjective). \n\nHe has died therefore he is dead.",
            "\"He has died\" sounds like you're breaking the recent news to someone.",
            "\"He has died.\" is present perfect tense, so you're communicating that his death has occurred, recently. The present perfect is a \"reporting the news\" tense. Someone in 1865 might have said \"Abe Lincoln has died\", but it would be weird for us to say that. \"He is dead.\" simply says that someone is no longer alive, nothing about when he might have died. You could say \"He's dead (Jim).\" right after someone dies, or long after their death. \"Abe Lincoln is dead.\"",
            "If you're referring to the person, \"he is dead\" focuses on them while \"he has died\" focuses on the death. One is describing someone while the other is used to inform someone of a death.",
            "The same can be used with other, happier, states of being. \n\nHe is married - you have no chance\n\nHe got married - this happened recently or at a point in time in the sentence.  'He got married' means that this is news.  It just happened.  Or 'He got married in 1978' tells you the same, except that it happened almost 50 years ago.\n\nHe is married is his current state of being.  Married. \n\nHe got married is about an event that happened.  Maybe he got married and then got a divorce the next day.  He still got married."
        ]
    }
}