{
    "?????": {
        "title": "?????",
        "score": 72,
        "url": "https://i.redd.it/hbmvhvwahi9d1.jpeg",
        "content": "",
        "num_comments": 32,
        "comments": [
            "Having children is the easy part. Being a parent is much harder. \nFor Elons latest batch theres no way hes reading to them at night, being there when they have nightmares, coaching little league. Heck theres a greater than 50% chance he doesnt live until their high school graduation.",
            "He looks like a soviet autocrat at a parade.",
            "Don't forget to nut in you wife",
            "Can't cope with the fact that he has a trans daughter, meanwhile he looks like a 60 year old lesbian.",
            "Its hard to believe that people simp this much. But the evidence is right there ",
            "Why does he always have the Val Kilmer neckerchief going on?",
            "what a fucking creep! seriously want him to just fuck off to Mars already, like tomorrow!",
            "It's gotta be a fetish cause wtf. Who wants to fuck one time and have you life changed forever?? Like tf is this fucking tub of lards obsession with this shit.",
            "\"A World Full of Elmos\", tonight at 9pm on the Twilight Zone.",
            "Funny how all these \"save the children! save humanity from underpopulation!\" never adopt an orphan.\n\nThey don't care about humanity, or the children. They just care about having more taxpayers for their pensions, and more underpaid wage workers for their drive thrus."
        ]
    },
    "Elon Musk Argues Twitter Flip-Flopping Not Manipulation Because His Legal Case Was So Bad - Dealbreaker": {
        "title": "Elon Musk Argues Twitter Flip-Flopping Not Manipulation Because His Legal Case Was So Bad - Dealbreaker",
        "score": 54,
        "url": "https://abovethelaw.com/2024/06/elon-musk-legally-obligated-to-buy-twitter/",
        "content": "Galaxy brained genius.",
        "num_comments": 10,
        "comments": [
            "TLDR: Elmos legal strategy is to say that no reasonable person listens when hes obviously lying\n\nTherefore anyone that falls for his lies is foolish, and thems the breaks for those morons. Certainly HE isnt at fault ",
            "Of course he's using the Fox News defence.",
            "Lmfao.. whatever you say, elon. No, this isn't going to work LOL",
            "This article could use chat gpt for some clarity in structuring.",
            "It seems that ironically if the investors lose, it gives further credence to their argument.",
            "Your honor, the bank just had a few hundred bucks. That's so little you can't call it robbery.",
            "Alex Jones made an eerily similar argument. His company is being liquidated currently.",
            "Ahh the Tucker Carlson defense. And Sydney Powell. And Alex Jones.",
            "Too bad that anybody is listening to this twat",
            "Hip-firing my Barrett 50 cal"
        ]
    },
    "Gotta love this white woman": {
        "title": "Gotta love this white woman",
        "score": 359,
        "url": "https://i.redd.it/b5om4stotb9d1.jpeg",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Elon is king incel and hates women.",
            "Fixed the chyron: Billionaire Musk accused of 'destroying Western civilization'",
            "When someone shows you who they are, believe them the first time. -Maya Angelou",
            "While all Elon has doubled is his stomach and ego",
            "Elmo is a potato-shaped misogynist with a birthing fetish and an aversion to sex. He's doing zero favors for himself.",
            "If those women, minorities, and marginalized groups wanted help they should have been born in a super wealthy apartheid family.",
            "Good for her, but Ill love her when shes no longer a billionaire",
            "He could have been Batman, but shes Thomas Wayne.",
            "Do you know the date of this tweet? Im assuming its before Jun 27th and if it was before the white replacement that he caught heat for.\nEdit: Jan to June",
            "And fElon never donates anything to anyone. Like he has any right to talk. Greedy coward mysoginyst and useless waste of oxygen always hiding behind his keyboard or surrounded by cultists and sycophants in the real world."
        ]
    },
    "Tesla Bay Area plant ordered to stop spewing toxic emissions after repeated violations": {
        "title": "Tesla Bay Area plant ordered to stop spewing toxic emissions after repeated violations",
        "score": 75,
        "url": "https://www.cbsnews.com/news/tesla-toxic-emissions-san-francisco-bay-area-plant/?campaign_id=49&emc=edit_ca_20240628&instance_id=127444&nl=california-today&regi_id=53831380&segment_id=170802&te=1&user_id=fe5d662adf685ae9dedd7464c832fcdf",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Elon: \"Who gives a fuck about Earth? That's why we're going to Mars!\"",
            "He's doing it to save the humanity of course",
            "After yesterdays Supreme Court ruling it will just get easier for Tesla to poison the communities around their plants without any repercussions.",
            "Not gonna matter after today.",
            "He has. Done more to harm it.",
            "\"...to protect the health of those living near the facility.\"\n\n\nJust like They* do in Boka China. Where launches destroy buildings nearby and rockets only get bigger.\n\n\n*They. Aka Elon's henchman working under his direct order to not give a Fk",
            "But Elmo [said](https://youtu.be/2BfMuHDfGJI?t=15m12s):\n\n>*I've done more for the environment than any single human on Earth*\n\n"
        ]
    },
    "Of all the things that never happened, this one never happened the most": {
        "title": "Of all the things that never happened, this one never happened the most",
        "score": 800,
        "url": "https://i.redd.it/dmz8jnrpic9d1.png",
        "content": "",
        "num_comments": 118,
        "comments": [
            "\"...and then there was this other time when the father of someone in Elon's class committed suicide. Everyone was being very respectful and sympathetic about it, but not Elon. He doesn't go with the crowd, he's a disruptor. Only Elon had the courage and bravery to mock that kid's father's suicide. You should have seen the look of determination on his face as they threw him down the stairs. Even in the ambulance, he had a steely expression which said 'billionaire soon.'\"",
            "So they left a 5 Y/O by themselves at home?",
            "One time when Elon was denied a toy at the store, he fell to the ground and wailed loudly, kicking his feet and refusing to be quiet. He had this fierce determination that blows your mind and was sometimes frightening, and still is",
            "That's a lot of words to say \"we were frightened of him since he was five.\"",
            "People just sit around and write fan fiction about this guy.",
            "This bozo forgot that Kimbal was the older brother",
            "who comes up with this shit lmao",
            "A 2 hour walk and climb up a tree only sounds impressive if you've never worked a shift in your life",
            "Kimbal was 3 at the time... He claims to remember the story and how he felt about his brother at 3 years old...",
            "That kind of \"fierce determination\" in a kid... is a personality disorder and a huge pain in the ass."
        ]
    }
}