{
    "Martin Mull Dies: ‘Clue’ & ‘Roseanne’ Star Was 80": {
        "title": "Martin Mull Dies: ‘Clue’ & ‘Roseanne’ Star Was 80",
        "score": 1415,
        "url": "https://deadline.com/2024/06/martin-mull-dead-1235986557/",
        "content": "",
        "num_comments": 105,
        "comments": [
            "Colonel Mustard, in his home, with his family.",
            "It was Sabrina for me. RIP",
            "He was so great on Rosanne, gave her snark right back in a believable way. Him being gay was not presented as a huge deal but just a part of life. That was ground breaking back then.",
            "Ahhh! Gene!\n\nI love this guy. He was also the principal in the original Sabrina the Teenage Witch sitcom starring Melissa Joan Hart",
            "He was so talented. Thanks  for the laughs, Martin.",
            "The hippie who hadn’t left his apartment in 25 years in Golden Girls.",
            "Mr.Kraft ): someone get Sabrina 😭",
            "Ron from Mr Mom ❤️",
            "Rip dude seemed like a fun guy, I will always cherish his Sabrina the Teenage witch role",
            "Some people just have a funny bone that lasts a lifetime and translates to many roles. Always enjoyed seeing him pop up and enjoyed his comic relief. \n\nRest easy and thank you for the creative art."
        ]
    },
    "'I Forced Myself to Stop': Eddie Murphy Recalls Retiring Trademark Laugh": {
        "title": "'I Forced Myself to Stop': Eddie Murphy Recalls Retiring Trademark Laugh",
        "score": 774,
        "url": "https://www.cbr.com/eddie-murphy-trademark-laugh/",
        "content": "",
        "num_comments": 91,
        "comments": [
            "Who else here is old enough to remember when he tried to piggy back a singing career off of Rick James?",
            "If Party All the Time comes on the radio I’m listening to that with only some shame 😆",
            "God I wish it were possible to get him to do a trading places 2. Such a classic.\n\nIt’s a real shame that he felt the need to stop laughing because of the impressions of him. It was legitimately iconic, but I don’t think anyone thought of him as just his laugh.",
            "Some insecurities there. I mean if it was a fake laugh to start I understand but if it’s real than who gives a fuck. The only time I hated my laugh was the first time I got high.",
            "How sad is this? Guy lost his aura after too. So sad. Never let another man break you like this. Wow",
            "You mean the laugh he stole from Ricky Ricardo?",
            "I think he forgot that mimicry is the highest (sincerest?) form of flattery.",
            "Actors who embrace their quirks and works tend to be well liked and respected, and also tend to make bank off of it. Eg. William Shatner",
            "That's sad he felt he needed to change. His laugh mad me laugh. It was infectious. It's sad to know that was who he was and he felt he needed to diminish himself",
            "The Jester that lost his Jingle."
        ]
    },
    "Steve Van Zandt says he lost 100 pounds to honor what might be the last Bruce Springsteen and the E Street Band tour ": {
        "title": "Steve Van Zandt says he lost 100 pounds to honor what might be the last Bruce Springsteen and the E Street Band tour ",
        "score": 929,
        "url": "https://www.rollingstone.com/music/music-features/little-steven-van-zandt-documentary-interview-1235050146/",
        "content": "",
        "num_comments": 101,
        "comments": [
            "Van Zandt then promptly added 100lbs of scarves",
            "Just when he thought he was out… they pulled him back in",
            "He lost 100 lbs in six months.  Ummm. wow.",
            "Lilyhammer was a really good show",
            "Ozempic? Bring it heeaaaa 👇👇👇",
            "I’m down a 100 lbs and this jerkoff is trying to play Hazel?!",
            "Look at this. Before and way before!",
            "I watched him in Lilyhammer. He looked normal to me.",
            "Steve losing this weight is gonna improve this band tremendously.",
            "For ever 30-40lbs of fat a man loses he gains back an inch of buried dick. He wanted 2.5” more for the tour."
        ]
    },
    "Ben Affleck Moves His Things Out of Shared Mansion with Jennifer Lopez amid Marriage Strain": {
        "title": "Ben Affleck Moves His Things Out of Shared Mansion with Jennifer Lopez amid Marriage Strain",
        "score": 2825,
        "url": "https://people.com/ben-affleck-moves-things-out-jennifer-lopez-shared-mansion-source-8671237",
        "content": "",
        "num_comments": 381,
        "comments": [
            "We doing 2004 over again? ",
            "I had a feeling five minutes after they announced that they were getting back together that it was just a matter of time before they broke up. 🙄",
            "This is going to ruin the tour.",
            "Ah Shit! Here we go again.",
            "Why does she have to marry every man she’s dating?",
            "They have a 30 room mansion with a guest house and he had to move out? Seems one could easily stay out of each other’s way in a property that big.",
            "I’m so tired of these people.",
            "Oh no! The mansion will seem so empty!",
            "> “Ben continues to live at the Brentwood rental. He’s been there for about two months now,\" another source says. \"He seems okay. He’s been at his office every day and seems focused on work. He’s also spending time with his kids.”",
            "Good Will Hunting 2: Hunting Season might finally be happening!"
        ]
    },
    "Melissa Joan Hart Remembers 'Sabrina the Teenage Witch' Costar Martin Mull": {
        "title": "Melissa Joan Hart Remembers 'Sabrina the Teenage Witch' Costar Martin Mull",
        "score": 151,
        "url": "https://people.com/melissa-joan-hart-remembers-sabrina-costar-martin-mull-after-his-death-8671599",
        "content": "",
        "num_comments": 8,
        "comments": [
            "He drastically improved Roseanne too",
            "I loved Mr. Kraft on the show.  The seasons with him and Valerie still around are the best",
            "I laugh a lot at Arrested Development but nothing makes me laugh so hard as every time Lucille Bleuth screams when she realises she’s talking to Gene Parmesan! Cracks me up every single time. Rest in peace Martin Mull.",
            "I used to have a crush on him",
            "that’s good so she still doesn’t have dementia",
            "Damn I feel old.",
            "RIP Colonel Mustard..."
        ]
    }
}