{
    "Sean ‘Diddy’ Combs erases all posts on Instagram — including Cassie assault apology video": {
        "title": "Sean ‘Diddy’ Combs erases all posts on Instagram — including Cassie assault apology video",
        "score": 184,
        "url": "https://pagesix.com/2024/06/21/entertainment/sean-diddy-combs-erases-all-posts-on-instagram-including-cassie-assault-apology-video/",
        "content": "",
        "num_comments": 20,
        "comments": [
            "Seems a little late for that",
            "Feds about come for him",
            "Ohhh boy...he knows the internet never forgets, right?",
            "Diddy is probably on a plane to Switzerland",
            "and so it begins...",
            "That’s okay. First has a backup.",
            "The feds raided his house to collect and cover up evidence of any documented crimes from the higher elites, not to gather evidence for his incrimination…he will go down but is definitely low on this rings totem pole",
            "My guess is he wants to erase anything he’s said that was more damning or would potentially make him look like a hypocrite.\n\nDude has more than enough Fuck You money to just disappear into the sunset and live very comfortably.  But he also has a legacy he wants to keep alive.  \n\nEgo is a powerful drug, especially for a celebrity who has gotten away with all the shit he has for so long.  He’s not going to back down.  He will claim innocence regarding the major accusations and give backhanded apologies for the others.  \n\nArdent fans will back him up no matter what so it’s just a question of how many of them are out there.  He may have enough that he keeps his career alive à la Chris Brown.",
            "Hopefully he got it all down before anyone saw it. /s",
            "They forgot that talentless shmuck Travis scatt."
        ]
    },
    "Man who bought Kurt Cobain’s Mustang for $4.5m says it “doesn’t make any sense” that the Nirvana frontman’s Martin sold for $6m": {
        "title": "Man who bought Kurt Cobain’s Mustang for $4.5m says it “doesn’t make any sense” that the Nirvana frontman’s Martin sold for $6m",
        "score": 2235,
        "url": "https://guitar.com/news/music-news/man-who-bought-cobains-mustang-cant-understand-cobains-martin-sold-for-6m/",
        "content": "",
        "num_comments": 261,
        "comments": [
            "that guy obviously didn't make his millions by being smart.",
            "That Martin is a classic with very few available. As Kurt added controls to the guitar this made it unique. The fact he played it on unplugged - priceless",
            "Did he have a “main” Mustang? He was known to bust them up.  The Martin is unique, and used in a performance that is likely listened to/watched the most today.",
            "It's not like it was Jon Voight's Lebaron.",
            "Millionaires discuss price differences on items that should be in a museum or with his daughter. Who cares?",
            "Cobain would be absolutely mortified his belongings sell for millions of dollars to billionaires.",
            ">The $6 million Cobain acoustic was once in the custody of Cobain’s daughter, Frances Bean Cobain, but her ex-husband received it as part of her divorce settlement.\n\nWell, that's pretty fucked up for him to go after that guitar and a judge to grant it. It should absolutely belong to Frances",
            "His Martin is more unique. It’s a 1959 and the fact that he did an acoustic set with it is legendary. It makes a lot of sense.",
            "anyone else think Ford Mustang, and Aston Martin? 🤦‍♂️",
            "Irsay has spent more on pills than both these guitars combined."
        ]
    },
    "Actress Shay Mitchell seemingly denies Filipino roots by claiming she's 'half Spanish,' gets blasted": {
        "title": "Actress Shay Mitchell seemingly denies Filipino roots by claiming she's 'half Spanish,' gets blasted",
        "score": 454,
        "url": "https://pop.inquirer.net/364009/actress-shay-mitchell-faces-criticism-after-seemingly-denying-filipino-descent-by-claiming-shes-half-spanish/",
        "content": "",
        "num_comments": 155,
        "comments": [
            "It's crazy because she got a job as a voice actress in a Filipino Netflix cartoon called Trese because of her Filipino heritage (along with Dante Basco, Jon Jon Briones, Manny Jacinto, etc). I guess she's only Filipino when it benefits her.",
            "Her aunt is THE Lea Salonga, too. If I were Shay, I'd be proud of my heritage and being connected to such talent. For those who may not know Lea, she provided the singing voice for Mulan and Jasmine in the animated Disney films and has been a successful singer for decades now, also performing on Broadway.",
            "I no Filipino, I Spanish.",
            "That’s wild if true",
            "I would sometimes see this in high school growing up in Texas. Latinos would deny being from whatever Latin country their parents were from and say they’re Spanish or Italian. It was obviously a lie but Anglo Americans would believe them because to them Spanish is all the same to them. \n\nI just didn’t think people still did this when they’re older. I figured they grew out of it.",
            "That’s fucking sad. Cause real talk I’ve always been proud of my Filipino roots because I always thought I was a little different from others. I’m proud af of being Filipino 🇵🇭",
            "She looks pinay af too",
            "Hilaria Baldwin would like a word.",
            "That is fucking pathetic.",
            "Why would you hide the fact you're Filipino? Most of my friends are Filipino and they are the best fucking people in the world."
        ]
    },
    "Jennifer Hudson reveals her father had 27 children, and she still hasn't met all of her half-siblings": {
        "title": "Jennifer Hudson reveals her father had 27 children, and she still hasn't met all of her half-siblings",
        "score": 4207,
        "url": "https://ew.com/jennifer-hudson-reveals-her-father-has-27-children-8667047",
        "content": "",
        "num_comments": 277,
        "comments": [
            "Is her father nick cannon",
            "Papa was a rolling stone",
            "Wow. That’s. A lot of kids.",
            "I am all for a national vasectomy program making it free for all men that want one.",
            "That's one hell of a carbon footprint!",
            "This is why men need to be responsible for birth control as well.",
            "Damn! My wife’s biological Dad has 16 kids with a variety of women, I thought he was putting up insane numbers but I stand corrected.",
            "I mean does she really have to?",
            "Fucking deadbeats are scum, no way this dude fathered 27 children, he may have planted seeds but that doesn’t make you a father.",
            "I honestly don’t think this should be legal. Like that doctor who replaced the sperm donors’ samples with his own — and he fathered some 100 children. He didn’t get in any criminal trouble either. I don’t get how that’s allowed."
        ]
    },
    "Justin Timberlake's pre-arrest concert footage with ‘bloodshot eyes’ surfaces, fans worried; ‘he had something..’": {
        "title": "Justin Timberlake's pre-arrest concert footage with ‘bloodshot eyes’ surfaces, fans worried; ‘he had something..’",
        "score": 273,
        "url": "https://www.hindustantimes.com/entertainment/music/justin-timberlakes-pre-arrest-concert-footage-with-bloodshot-eyes-surfaces-fans-worried-he-had-something-101719025180491-amp.html",
        "content": "",
        "num_comments": 53,
        "comments": [
            "You mean a celebrity musician was on some substance?! OMG! How unexpected and rare!",
            "Nothing wrong with having something just don't fucking drive after",
            "Rich and powerful people get bored all the same as we do. Most of us just don’t have access/free drugs/social events they do. \n\nA drinking problem in Hollywood isn’t a problem. Driving your drunk self as a public figure who has every other option is the issue.\n\n5 years without my booze head and my heart goes out to the guy. You don’t hide this type of self medication unless you’re in real pain. And no, money doesn’t magically solve our nature and biology.",
            "Pretty much every single child star has had some kind of mental breakdown in middle age. JT is no different.",
            "I'm sure a lot of performers do drugs before performing. This isn't exactly news. Wouldn't surprise me one bit",
            "4 years off the sauce come Canada Day. Never felt better in my life. Rehab 2019, 35 guys facility by Toronto for 45 days,  you see some things and choose to make the change in your life or you don’t. Life’s not easy, but being sober I have a lot less issues financially, emotionally, physically and mentally. Life’s better off the sauce and drugs for me.",
            "Money doesn’t equal happiness. How many incredibly talented and wealthy stars have died horrible deaths too early? I am not a big JT fan, but this sucks for his family. I hope he gets help.",
            "Oh he had something alright:  COCAINE!",
            "Never heard of Visine?",
            "Ah yes, wild speculation and blurry celebrity pictures, a tale as old as time"
        ]
    }
}