{
    "Happy Birthday to Me, I guess (The State of the Sub)": {
        "title": "Happy Birthday to Me, I guess (The State of the Sub)",
        "score": 87,
        "url": "/r/IDontWorkHereLady/comments/13y4hf5/happy_birthday_to_me_i_guess_the_state_of_the_sub/",
        "content": "",
        "num_comments": 15,
        "comments": [
            "TLDR, so...due to my laziness, can someone condense this into a short story that details why this person (or whoever we're targeting with this post) is entitled?",
            "Much sympathy on your medical issues. Hope you're feeling better soon!",
            "how are you two months later, mod ?",
            "Is that why the plant's orbit has changed ?",
            "Hmmm, I like it I think.",
            "you have 5 co-moderators. you can ask one of them to take the lead, while you take a back seat. best of two worlds.\n\nIf you need help, just ask.",
            "This is a moderator announcement, not a story.  \n\n\nEdit: I guess you could say Reddit's pricing is entitled",
            "[deleted]",
            "Happy birthday",
            "I'm better every day!"
        ]
    },
    "Subreddit Protest Poll (Reddit is killing third-party applications (and itself))": {
        "title": "Subreddit Protest Poll (Reddit is killing third-party applications (and itself))",
        "score": 44,
        "url": "/r/entitledparents/comments/14nk3gc/subreddit_protest_poll_reddit_is_killing/",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Mods are ruining the community more than the api changes ever will. You want to protest then get off reddit and leave the rest of us out of it.",
            "Hot and ignorant take."
        ]
    },
    "Your son is staring at my daughters": {
        "title": "Your son is staring at my daughters",
        "score": 3629,
        "url": "https://www.reddit.com/r/EntitledPeople/comments/1dqpd14/your_son_is_staring_at_my_daughters/",
        "content": "I’m at the beach with a friend, CC and her son and his friends. The guys are all around 30 years old.\n\nMy friend’s son gets up and goes into the ocean and that’s when entitled woman  (EW)walks over to my friend \n\nEW: is that your son that just went in the water?\n\nCC: Yes, why?\n\nEW: Can you ask him and his friends to stop staring at my daughters? Your son is quite a bit older than my daughters and it’s making them uncomfortable. (EW points to three girls in bikinis  aged 14-20 ish)\n\n\nCC: bursts out laughing. No, I’m not going to tell them to stop bc I feel sure they’re not staring at your daughters since my son and his friends are all gay.\n\n\nEW blushes, stammers and walks away.\n\n",
        "num_comments": 116,
        "comments": [
            "EW: Well could they… stop… being… so GAY?! Ugh I just wanted something to post to face book…",
            "How dare your gay son and his friends not be ogling that woman's daughters.",
            "“Then they’re obviously judging my daughters’ bikinis!”",
            "Omg 🤣🤣🤣 Can I be friends with all of you?!",
            "Was thinking from the title ...please let the lads be gay",
            "EW just wanted to make some drama so she had the Spot light on herself",
            "My gay son is trying to figure out where to get that pattern for his next outfit.",
            "I’m confused did this woman just approach the mother of a 30 year old man to have her yell at him? How did she even know it was his mother?",
            "\"Of course they're looking! I mean who wouldn't? Those are the weirdest looking kids we've ever seen\"",
            "I almost spit out my drink laughing at this. 😆"
        ]
    },
    "That's for people with real disabilities": {
        "title": "That's for people with real disabilities",
        "score": 1210,
        "url": "https://www.reddit.com/r/EntitledPeople/comments/1dqsby2/thats_for_people_with_real_disabilities/",
        "content": "This happened at a Sci-Fi Convention, I was with my friend who uses a wheelchair. She decides to sit on a couch and has me put her wheelchair by it. \n\nFriend, Dana lies down on couch and I put my jacket over her. I am nursing a sore knee Dana tells me to use her wheelchair as support if I need it. \n\nI see a water refill station nearby and tell Dana about it. She said we should refill our water bottles. We went through a lot of water during the convention and we need it.\n\nSince my knee is really sore I use the wheelchair like a walker to help steady myself. I am filling Dana's water bottle and I get a tap on my shoulder. There is some guy standing by me.\n\nGuy: Hey, you need to put that back. It's not yours.\n\nMe: of course not, my friend is over there and said I could use it.\n\nI am setting Dana's bottle in the seat of the wheelchair, then fill mine. Guy suddenly decides to take it from me and wheels it back to my friend who is on the couch.\n\nMe: Hey dude, she said I need to fill the other bottle\n\nGuy: The wheelchair is hers.\n\nMe: There is another bottle in the back.\n\nGuy: Then come and get it, you're not disabled.\n\nMe: it isn't yours either, so let me refill the bottle\n\nGuy: then get it. You can walk.\n\nDana: No she can't! She left her cane in the hotel room. Let her use my wheelchair please.\n\nGuy ignores her and continues to put the chair back and locks the wheels so I can't move it. \n\nGuy: I am just helping.\n\nDana: you need to mind your own business!\n\nGuy: she shouldn't use your equipment.\n\nDana: this is seriously none of your business, OP, can you help me back into the chair.\n\nI hobble over and I get shoved away.\n\nGuy: I am right here I can help.\n\nDana: Not you, I don't know you.\n\nI am able to help unlock the chair and help her back in. She and I are frustrated and decide to go back to the hotel room.\n\nWe are both mad because we just wanted to relax and get some water. \n\nEntitled guy thinks I am stealing my own friend's wheelchair. He acts like he knows what's best and doesn't realize that he is being the entitled one. ",
        "num_comments": 86,
        "comments": [
            ">I hobble over **and I get shoved away.**\n\nThis is the point at which Security and/or the police should be getting involved….",
            "Wow….you could report him to the convention center.",
            "One of my biggest pet peeves is when someone assumes that someone doesn’t “look disabled” or a disability is questioned in any way.",
            "In the winter of 2010  my left lung collapsed.  I had emergency surgery to re-inflate my lung.  I was off work for eight weeks, and then another ten weeks at part time hours.  I was a recent widow and lived on my own.  A family friend  lent me a wheelchair and a friend took me where I needed to go (doctor appointments, groceries).  One day out grocery shopping a neighbour took it upon himself to call the cops for us illegally parking in a handicap spot and using a stolen wheelchair.  Newsflash, I have a permit, I am currently unable to walk outside.  The police officer was great and really tore a strip of neighbour.  A pleasure to watch from inside my warm, legally parked car.",
            "Start screaming that some strange dude is interfering with you and your friend. Make a public spectacle.",
            "Ugh. Did he think he was being a knight in shining armor and your friend was going to drop her panties right there in gratitude?",
            "When I was young and fit, I used to take my father out in his wheelchair. When he went to the toilet he would get out of his chair and walk to the loo. I would sit and chill in his chair until he came out. One guy insisted I needed the loo, and tried to push me in a random direction that wasn’t the toilet. \n\nI was sitting in the chair, minding my own business playing a game on my phone. I didn’t look like I needed the toilet at all. I panicked when he kept insisting. Luckily my dad walked out right on time and asked if I was ok. The guy scarpered.",
            "I'd have started screaming for security, as technically he stole the wheelchair.  Why do so many people decide they need to 'help' by literally interfereing in crap they only make worse?",
            "Guy probably thought, “A damsel in distress! In so much distress that she doesn’t even know what she wants! Luckily I’m here!”",
            "I would report the asshole to security.  I would also record the interaction if possible, if take a photo of the guy to show security.  As someone who is disabled, this one really pisses me off."
        ]
    },
    "Lady got mad at me just cause I asked her how many sets she had": {
        "title": "Lady got mad at me just cause I asked her how many sets she had",
        "score": 132,
        "url": "https://www.reddit.com/r/EntitledPeople/comments/1dr0o3x/lady_got_mad_at_me_just_cause_i_asked_her_how/",
        "content": "Quick run down: leg day at the gym, last thing left was calf raises.\nStory: \nI go up and ask: “hi, how many sets do you have left” \nBtw this person was standing next to the machine so in no way mid set\nLady: “I have 2 sets left”\nMe: “ Can I work in”\nLady yells out: “if you can just give me 5 more fucking minutes I will be done”(still standing next to the machine btw)\nMe: “alright, my bad”( walk away to sit down by a wall cause my legs are jello)\nThe wall was one machine away so I was waiting for her to be done using it \nLady( done working out, goes to get the cleaning stuff) when she’s done the cleaning, I walk up to use the machine, and she proceeded to call me a currymuncher and to fuck off from the machine.\nMe: “brudda tf did I do?”\nHer: literally just leaves from the gym\n\nShit still feels like it was not real\n\nPs: I have to do calf raises because my genetics are kinda nerfed in that department, and the gym has helped it look a lot more normal compared to the rest of my legs and upper body\n",
        "num_comments": 61,
        "comments": [
            "Sounds like her response was at least partially racially-motivated. Your behaviour towards her was perfectly reasonable for one equal citizen towards another, and perhaps she didn't like that. That reflects badly on her, and you don't deserve to be made to feel unwelcome at the gym. If you feel up to it, report the incident to staff.",
            "“Currymuncher?” Racist as hell, are we?",
            "I believe the attitude towards asking to work in shifted entirely due to covid. Prior to covid people would ask to work in / I would all the time and since gyms reopened a few years ago I haven't been asked or asked more than once or twice. If this person was new to the gym they probably had never had someone ask before. Also, if they only had 2 sets left, it may be inconvenient to change the weights unless it's a pin selector machine.",
            "People ask me all time how many sets left if they waiting for machine I'm on if they ask ill let them swap out with me and take turns for my remaining sets or I'll save the machine for them for waiting patiently for me to finish its gym culture to do this. Its a reasonable question and didn't warrant this persons reaction to you my friend,. You did nothing wrong.",
            "Are you in Australia? I've been seeing that particular slur making a bit of a resurgance in bogan circles in my neck of the woods. \n\nJust tell her that her plastic surgeon is shit (bonus points if she hasn't had any work done).",
            "People asking to work in when I’m in a machine proper riles me up. I mean, just wait until I’m finish man!\n\nHOWEVER - there is no need to be rude about it, and there is certainly no excuse for racist or intolerable comments towards you and she needs reporting just for that!",
            "Has she ever had curry????  So damned good!!!   Also, wait your turn quietly, don’t bug people while they are in the middle of their sets, that’s just rude.",
            "Bad title.\n\nShe got mad at you because you asked to work in when she only had 2 sets left.",
            "Are you admitting that you are the entitled person in this scenario?",
            "Asking how many sets to go = fine\n\nAsking to work in to someone else’s set = so fkn rude."
        ]
    }
}