{
    "Escape From Tarkov | Weekly Discussion | 14 Jun, 2024 - 21 Jun, 2024": {
        "title": "Escape From Tarkov | Weekly Discussion | 14 Jun, 2024 - 21 Jun, 2024",
        "score": 0,
        "url": "https://www.reddit.com/r/EscapefromTarkov/comments/1dg34wl/escape_from_tarkov_weekly_discussion_14_jun_2024/",
        "content": "To avoid duplicate threads and cluttering of the sub, please use this weekly thread for discussions that may not require a dedicated thread.\n\n&#x200B;\n\n&#x200B;\n\nBe sure to sort by \"new\" and check the [Subreddit Rules](https://old.reddit.com/r/EscapefromTarkov/wiki/rules) prior to posting. If you're asking a question, try searching both the subreddit and this thread to see if it's been asked.\n\n&#x200B;\n\nPlease remember no abusive or poor behavior will be tolerated. Be helpful, respectful, and constructive with your posts and questions and if you feel something needs attention, report it.  \n\n&#x200B;\n\n\\# Helpful Links\n\n&#x200B;\n\n\\* [Upcoming features](https://escapefromtarkov.gamepedia.com/Upcoming_Features) \n\n\\* [Official Discord](http://discord.gg/escapefromtarkovofficial)\n\n\\* [Wiki](https://escapefromtarkov.gamepedia.com/Escape_from_Tarkov_Wiki)\n\n\\* [Unofficial Discord](https://discord.gg/ueft)\n\n\\*[Battlestate Games Support](https://www.escapefromtarkov.com/support)\n\n\\* [Xsolla Support](https://help.xsolla.com/)\n\n\\* [Battlestate Games Twitter](https://twitter.com/bstategames)\n\n\\* [Escape From Tarkov Twitter](https://twitter.com/tarkov)",
        "num_comments": 34,
        "comments": [
            "The fact that friendly fire in Arena is enabled before the round has started is a huge mistake. I've run into people griefing each other and shooting each other but not killing before the round has started. Huge oversight. Guns should be disabled until the start of the round. There's no reason my teammates should be able to shoot me before the fight has actually begun.",
            "I had 4 minute cooldown on scav, now it’s back to 17 minutes, what happen and how to get back to those 4 min cooldowns? Rep the same 1.37.",
            "I swear the longer I play a session of Arena the worse packet loss and desync get.",
            "I tried PvE for the first time and my wait time to factory was around 8 minutes. Turned it off.",
            "Anyone know when the next patch is?",
            "Does anyone know why weapons handling and movement feels really off in Tarkov Arena compared to the main game?  I checked my sensitivity, it checks ok with my matcher but still feels a bit weird, then spray transfer and shooting while moving just seems terribly inaccurate compared to the main game.",
            "Trying to get back into Tarkov, is the game worth playing rn? As in whats the cheater situation? And is it riddled with bugs?",
            "Were post flairs reduced? I cant find the clip flair I use to shitpost",
            "What's the current state of the game? I'm interested in buying, but is it still riddled with cheaters and fully-geared vets except in the first week of the wipe?",
            "The prior patch addressed my significant stability issues (regular crashes) and getting stuck on Loading loot...entering a raid.  With the patch today all of the issues are back. I don't understand how a patch gets released that reintroduces issues that were fixed. Incredibly demoralizing."
        ]
    },
    "Escape From Tarkov | Weekly Discussion | 21 Jun, 2024 - 28 Jun, 2024": {
        "title": "Escape From Tarkov | Weekly Discussion | 21 Jun, 2024 - 28 Jun, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/EscapefromTarkov/comments/1dlgjst/escape_from_tarkov_weekly_discussion_21_jun_2024/",
        "content": "To avoid duplicate threads and cluttering of the sub, please use this weekly thread for discussions that may not require a dedicated thread.\n\n&#x200B;\n\n&#x200B;\n\nBe sure to sort by \"new\" and check the [Subreddit Rules](https://old.reddit.com/r/EscapefromTarkov/wiki/rules) prior to posting. If you're asking a question, try searching both the subreddit and this thread to see if it's been asked.\n\n&#x200B;\n\nPlease remember no abusive or poor behavior will be tolerated. Be helpful, respectful, and constructive with your posts and questions and if you feel something needs attention, report it.  \n\n&#x200B;\n\n\\# Helpful Links\n\n&#x200B;\n\n\\* [Upcoming features](https://escapefromtarkov.gamepedia.com/Upcoming_Features) \n\n\\* [Official Discord](http://discord.gg/escapefromtarkovofficial)\n\n\\* [Wiki](https://escapefromtarkov.gamepedia.com/Escape_from_Tarkov_Wiki)\n\n\\* [Unofficial Discord](https://discord.gg/ueft)\n\n\\*[Battlestate Games Support](https://www.escapefromtarkov.com/support)\n\n\\* [Xsolla Support](https://help.xsolla.com/)\n\n\\* [Battlestate Games Twitter](https://twitter.com/bstategames)\n\n\\* [Escape From Tarkov Twitter](https://twitter.com/tarkov)",
        "num_comments": 2,
        "comments": [
            "Personally I'm surprised there isn't an event this week. One every couples weeks, especially this late in the wipe is kind of disappointing, and it's been two since the last one. Credit where credit is due, the last two have been some of the most fun ones I've had in my 6+ years of playing. I'd just like to have them be more frequent, especially when there is not much time left in the wipe and the game would benefit from people being drawn back in woth some cool stuff happening.",
            "Why are there so many out of region players on european servers?\n\nWhy is this allowed/possible? Ban VPN's!!\n\nAlso the performance of the game gets worse after every patch."
        ]
    },
    "I've Printed every Stim in this game! [IRL]": {
        "title": "I've Printed every Stim in this game! [IRL]",
        "score": 383,
        "url": "https://www.reddit.com/gallery/1dli86z",
        "content": "Got a 3D printer at the start of may made it my goal to print every tarkov stim as close as u can to the colours in the game! ",
        "num_comments": 49,
        "comments": [
            "That’s so cool, any source for the stl",
            "Yo, I need that AHF1-M for crisis brotha.",
            "5000 rubles and a Loot Lord plushie for the lot, take it or leave it",
            "Mate. This is rad",
            "That MULE will go straight to my hole",
            "Dope!",
            "all I want is a propital and zagustin. I have m80 and sardines to barter",
            "Still don't know what they do.",
            "I thought these things were always a needle you quickly inject into yourself. Are they just a tube you stick up your nose and snort? That makes me more down to try some.",
            "Perfectly timed post for pride !"
        ]
    },
    "Flashlight Shadow Confirmed. [Bug]": {
        "title": "Flashlight Shadow Confirmed. [Bug]",
        "score": 1790,
        "url": "https://i.redd.it/i814njizsx7d1.jpeg",
        "content": "Not a glitch, confirmed. ",
        "num_comments": 181,
        "comments": [
            "Imagine not understanding basics on how shadows are made.",
            "\"Hey that shadow looks like a penis\"",
            "Gotta say, I use the Trex Arms flashlight extender on my guns, and it does a lot to reduce supressor shadow.  \n\nWould be neat to see it in game.",
            "I thought that was common sense ? Did people really believe this was a bug ?",
            "Calm down Cat Daddy",
            "Notice it’s a small soft shadow? Instead of 90% of the light gone and it’s dark af. Yea that’s the point people are making.",
            "The problem with the supressor and the flashlight is not the supressor casting a shadow, is being able to cast shadows from objects *that are not iluminated.* For example, with the MP7 you could see the holes on the front of the supressor casting a shadow, or clearly seeing the shadow casted by the inner cilinder in the supressor..",
            "MP7 shadow is still bugged.",
            "Patched this out IRL by adding more flashlights on all 4 rails 👍",
            "Cool. Now make a screenshot of how it looks in the game and make a comparison.          \nI’m sure it’s looks absolutely correct and is not at all bugged"
        ]
    },
    "Anyone else noticed how the reflection is from another map? [Discussion]": {
        "title": "Anyone else noticed how the reflection is from another map? [Discussion]",
        "score": 18,
        "url": "https://v.redd.it/pwiqy5xwv38d1",
        "content": "",
        "num_comments": 7,
        "comments": [
            "its like everywhere, in streets you can find reflections from factory etc",
            "I wonder if this affects FPS, having to have completely different geometry loaded just for reflections..",
            "But for what reason they would make it like that?",
            "nah normally reflections are a baked image that is then displayed on the water, like a 360 camera takes a pic of the surroundings and thats what you see so it wouldn't affect your fps",
            "I think they are just flat images",
            "It's a fake reflection because reflecting the actual map in real time would take more resources",
            "well i guess dev things, like optimization by using already rendered reflection maps or something like this 🤷‍♀️"
        ]
    }
}