{
    "Self Promotion & Store Milestones for the Week of June 24, 2024": {
        "title": "Self Promotion & Store Milestones for the Week of June 24, 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/EtsySellers/comments/1dn9ua6/self_promotion_store_milestones_for_the_week_of/",
        "content": "This is an approved thread for sharing your shop links, shop launches, shop updates, instagram handles, etc.\n\nContest mode is turned on to ensure a fair share of visibility for everyone.\n\nThis is also the approved place for sharing your shop milestones!  Please use this thread and only this thread to share your milestones. Do your best to also share any information that other sellers might benefit from including tips and tricks that got you to the milestone, etc. \n\nWe strongly prefer posts that contain more information about the milestones. Tell us your story. Talk about the struggles you went through to reach 1000 orders. Explain what you learned about producing your products that let you scale from 10 orders to 100 orders.",
        "num_comments": 74,
        "comments": [
            "[St Anne’s Spindle](http://stannesspindle.etsy.com) has handspun, traditional Nordic style yarns, perfect for your colorwork and heirloom projects.  I specialize in skeins made from one sheep (usually a Nordic short tailed breed) that has gorgeous natural colored fleece.  My work is a celebration of the Nordic fiber arts traditions of my ancestors, the stunning palette of natural colors of sheep, small-scale shepherding, and rare breeds.\n\nVisit my shop [here](https://stannesspindle.etsy.com)\n\nFollow me on Facebook and Instagram (links in profile)",
            "Good morning! \n\nMy wife and I run. [oliveitco](https://www.etsy.com/shop/Oliveitco) . We make hand crafted clay olives along with a few other items. \n\nWe recently just hit 100 sales after opening in February. We are so happy and proud that people like our products. This has been a big learning curve but well worth it! \n\n\n\nhttps://www.etsy.com/shop/Oliveitco",
            "Hi everyone! My shop is [Baked Good Studio](https://bakedgoodstudio.etsy.com) and i got my first sale this week!! It’s only been about 15 days since I opened my shop so this was exciting! \n\nMy instagram is also bakedgoodstudio :)",
            "Happy Monday! 😊\n\nMy name is Alyssa, and I sell resin items including: guitar picks, bookmarks, jewelry, coasters, etc. I have a blast making custom orders too, so please message me on Etsy if you are looking for something in particular! \n\nI also offer custom flower preservation, so if you are looking to get a special bouquet preserved, feel free to reach out!\n\nLink to my Etsy: \n[TwoPartTreasures](https://www.etsy.com/shop/TwoPartTreasures)",
            "Hey there! Welcome to MyCrazyDad on Etsy! 🐾  [https://www.etsy.com/listing/1370910422](https://www.etsy.com/listing/1370910422) We specialize in creating one-of-a-kind, handcrafted cat scratchers that your furry friends will absolutely adore. Our scratchers are not just functional but also super stylish, designed to keep your cats entertained and your furniture safe. Each piece is made with love, care, and a dash of creativity, perfect for every cat-loving home. Thanks for stopping by and supporting small businesses. Happy shopping! ❤️",
            "Hey everyone! 👋\n\nI wanted to share something exciting with you all! If you're a fan of unique stickers and vinyl decals, you’ve got to check out my Etsy shop, [Travlhen Creations](https://travlhencreations.etsy.com)! 🌟\n\n### 🌟 **Why You'll Love Travlhen Creations:**\n- **One-of-a-Kind Designs:** Each sticker and decal is crafted with love and creativity, ensuring you get something truly unique.\n- **Top-Quality Materials:** I use premium vinyl that’s durable and vibrant, perfect for your laptops, water bottles, notebooks 📚, cars, and more.\n- **Custom Creations:** Have a specific idea in mind? I’d love to create a custom design just for you! Personalized name decals, unique graphics, you name it!\n- **Eco-Friendly Options:** Decorate sustainably with our eco-friendly selections.\n- **Amazing Customer Feedback:** Don’t just take my word for it, our happy customers rave about the quality and creativity of our products!\n\n### 🌈 **Popular Items:**\n- **Cute Animal Stickers 🐾**\n- **Inspirational Quote Decals 💬**\n\n### 🛍️ **Explore Now:**\nDive into a world of creativity at [Travlhen Creations](https://travlhencreations.etsy.com). Whether you're sprucing up your own items or searching for the perfect gift, there’s something special waiting for you.\n\nThank you so much for supporting small businesses and independent artists. Your support truly makes a difference! ❤️\n\nHappy shopping!",
            "At [AloraLaneCrafts](https://www.etsy.com/ca/shop/AloraLaneCrafts?ref=usf_2020), where my wife and I showcase a diverse array of handcrafted wooden goods perfect for complementing your home and garden aesthetics!\n\nWe're thrilled to unveil our latest additions, including handmade plant propagation tubes, dog bowl holders, plant trellises, and more – all expertly crafted from cedar wood.\n\nThanks for checking us out!",
            "Ooh this is fun!! My name is Kristen and I just opened my Etsy last week! My shop is called Lavender Lane and I have 6 listings up right now and I started an instagram as well! \n\nMy Etsy is https://mskayyten.etsy.com\nMy Instagram is shop.lavenderlane\n\nI make tote bags, zipper pouches and just launched some clip bows for toddlers and little girls. I absolutely love sewing and creating everything myself!! I’m working on adding more items soon like dog/cat bandanas too which is exciting for me and honestly so fun!",
            "Introducing my fashion label [Green Riot](https://www.greenriot.net/i/international-plant-punks-welcome).\n\nVegan apparel for plant lovers – strictly sustainable, earth-positive, and worldwide, climate-friendly shipping!\n\nOur [Etsy store](https://greenriot.etsy.com) is full of cool shirts and other stuff - this is your chance to help a DIY-business out 🤝\n\nLet me know what you think of our new [Tofu Love bundle](https://www.greenriot.net/p/tofu-love-bundle-tofu-love-socks-and-crewneck) 💚🌱\n\n👉 [Etsy Store](https://greenriot.etsy.com)| [Instagram](https://www.instagram.com/greenriot.apparel/) | [Website & Shop](https://www.greenriot.net) 👈",
            "[www.designbynatalia.etsy.com](http://www.designbynatalia.etsy.com)"
        ]
    },
    "How are your sales? Monthly Sales Post for June 2024": {
        "title": "How are your sales? Monthly Sales Post for June 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/EtsySellers/comments/1d5lfe7/how_are_your_sales_monthly_sales_post_for_june/",
        "content": "Please use this stickied post (and only this post!) to discuss how your views and sales are going.\n\nThis includes discussion of trends in sales and views, as well being the place to share general suggestions on improving traffic during slow times.  \n\nNOTE: Please do not post shop names, shop links, or shop critique requests in this thread.  If you would like advice specific to your shop, please read and follow the Shop Critique Guidelines linked in the sub rules and create your own post.\n\nAny type of self promotion (including promotion of services for Etsy sellers) is also not allowed here.  If you receive a private message offering or promoting a service from anyone posting in this thread, please mark the message as spam and notify the mod team.",
        "num_comments": 103,
        "comments": [
            "I don't think May has ever been this bad, I dropped from an average of 20 orders a month to only 5. Though my yoy is still better than last year, so that's something, haha. Will for sure focus on trying to have my sales back on track for June and get that average of orders per month up.",
            "May was my highest number of orders in a single month since I started on Etsy 2 yrs ago.",
            "I actually finally had 2 sales in May thanks to reddit and art subs.",
            "May has been the best month so far this year. But every single month this year revenue/orders have been down at least 50% from last year. Is there a way to provide feedback directly to etsy about how their seo is broken and gift mode is ruining sales for sellers?",
            "June gloom",
            " Has June been super slow for anyone else ..? I have a successful shop with orders everyday with my best months all time earlier this year, but yeah super slow rn.",
            "$29k, took a dip from April but not terrible. So far this year March has been my best month.",
            "Opened new shop late april. Made 12 sales in May. Hopefully there'll be more in June!",
            "I opened my shop in October 23\n\nNovember orders: 282\n\nDecember orders: 101\n\nJanuary orders: 24\n\nFebruary orders: 21\n\nMarch orders: 64\n\nApril orders: 72\n\nMay orders: 83\n\nI’m pretty happy with this trend :-) \n\nMy initial products are highly seasonal specific, so the November/December sales weren’t exactly a shock, but I was surprised at how quickly I was able to get going after launching the shop. \n\nOver the last few months, I’ve done lots of fine tuning on prices, listing photos, SEO, and also diversifying my products a little more into niches that are a little less seasonal to help increase sales throughout the rest of the year. Very anxious/eager to see how this next holiday season turns out in comparison. \n\nOverall, $20k in revenue after ads/fees since launch, and about $9k in total profit.\n\nFor anyone wondering, I spend an average of 10 hours a week on my shop, and currently offer about 1,200 listings.",
            "Last summer I added a new product that is the most expensive thing in my shop. All of a sudden it has taken off. As a result, while my number of orders decreased 4% from last year, revenue was up 90%, making it one of my best months since starting my shop in 2019! (April was up, too.)"
        ]
    },
    "I'm so upset ": {
        "title": "I'm so upset ",
        "score": 10,
        "url": "https://www.reddit.com/r/EtsySellers/comments/1dqzav2/im_so_upset/",
        "content": "I sell a $5 tax deduction tool for Canada. I literally sold a single one in 2024 (I update them annually).  The buyer just left a one star review saying that another store is selling the sheet and they don't know which copied the other.\n\n Just to double check I went and searched other listings -there's literally only 2 stores that sell a similar product.  \nOne store has a file that looks different, and the other store has 0 sales. \n\n",
        "num_comments": 6,
        "comments": [
            "Message the customer and let them know that you were first. You can even show the date that they created their listing versus the date that you created your listing. They may not change their review, but at least you are setting the story straight. If they don't change it after a while, reply to let future customers know that you are the original.",
            "I can feel your frustration. It’s ok to feel that way. I was the same at the beginning. After a while, after 10ish fool reviews, i forgive myself. It just not worth to argue with people that cloud be in any state you don’t know. They probably have low knowledge level or just had a bad day. I will just try to get them change review first. 99.9% of time they wouldn’t. I will just public reply with claim and  explain the situation. So other buyer can do they own judgement. You have beautiful things around you. Move on🍀",
            "Did you sell to a buyer in their area? If not, how can it be anything other than coincidence where 3 people in all of Canada came up with the same idea? 🤔",
            "Thanks for the response. The thing is that there is actually no other listing! I have no idea what they are even referring to! \nMessaged the customer and said I'm shocked someone stole my sheet and asked for a link,  but they didn't respond yet. If needed I'll respond to the review but I'm hoping the customer will delete it, seems very unfair.",
            "I needed this! You're so right. Thank you for the compassionate response. It's honestly not a big deal at the end of the day. I'll give it the weekend and respond publicly. 🌻🙏🙏 you rock",
            "This is just a tax deduction tool, there are hundreds for the US but hardly any  for Canada. It's not so much of a unique idea, but a smaller market. I sold about 5 over the years but none in 2024 until this sale (because tax laws change this needs to be regularly updated)."
        ]
    },
    "Etsy released update to prohibit Sex Toys": {
        "title": "Etsy released update to prohibit Sex Toys",
        "score": 53,
        "url": "https://www.reddit.com/r/EtsySellers/comments/1dqmqtk/etsy_released_update_to_prohibit_sex_toys/",
        "content": "Apparently they released this update yesterday. This is going to kill half my sales 😕  \nThinking I should start making some Silicone BDSM gear, since for some reason that is still ok to sell. 😅  \n  \n[https://www.etsy.com/legal/policy/adult-nudity-and-sexual-content/1269612959532?ref=list](https://www.etsy.com/legal/policy/adult-nudity-and-sexual-content/1269612959532?ref=list)",
        "num_comments": 73,
        "comments": [
            "Probably has to do with the same legislation in some states requiring age verification for adult content that are coming into effect.",
            "Huh, interesting. To be fair most sex toys on Etsy are dropshipped, and I don't expect investors like it either.",
            "Everything is a sex toy if you're brave enough.",
            "Wonder why this is happening all of the sudden.",
            "Etsy updated their entire prohibited items policy yesterday, from the looks of it.\n\nOld:\n\n< As a creative community, we tend to be fairly liberal about what we allow on Etsy. That said, we prohibit pornography, illegal or exploitative items, and used intimate items. Beyond that, we allow but place restrictions on mature content so that people who are offended by this kind of material don't have to see it. If you are selling mature content, we ask that you be respectful of differing sensibilities by listing and tagging your items properly.\n\nNew:\n\n> We work hard to balance keeping our community safe while allowing creative expression. We prohibit pornography, sexual services, illegal or exploitative items, and some types of adult toys. In some cases, adult nudity is permitted, though we require some photos to be obscured as a heads-up to people who may not want to see this type of content. If your listings contain mature content, which includes photographic depictions of breasts and buttocks, we ask that you be respectful of differing sensibilities and require you to list and tag your items properly.\n\nThe Adult Nudity and Sexual Content Policy was modified to absorb some of the previous language.\n\n\"Graphic materials, such as items with violent, gory, or profane text or imagery, must follow our policy for Listing Mature Content Correctly.\" was added.",
            "Sell them as \"Sculptures\", what people do with the sculptures after purchase is their own buisness.",
            "Well, not that I hadn't expected this for years now--but, damn. It does not bode well. First they came for the Cthulhu dildos ...",
            "I changed pretty much every one of my pics to not having the head of the dildos visible or swapped for non-penis shapes the last time they got their knickers twisted. This time, I’m creating a listing for backpacking candle holders and see if they ban me for that one.",
            "Well that sucks...any suggestions for different platforms? That's going to kill more than half of my inventory and this is my full time job",
            "You're selling sculptures now. Problem solved."
        ]
    },
    "USPS raising rates Again.": {
        "title": "USPS raising rates Again.",
        "score": 15,
        "url": "https://i.redd.it/ef7q8qy3pd9d1.jpeg",
        "content": "They are a monopoly for small parcels and small business owners are being screeewed.",
        "num_comments": 18,
        "comments": [
            "If you offer free shipping raise your prices. Why should you lose money because usps charges more.",
            "Our clients pay the shipping.",
            "> They are a monopoly for small parcels and small business owners are being screeewed.\n\nAs compared to? There is competition, and that competition costs more than USPS for that segment of the market.\n\nNaturally, we all hesitate to raise our own item prices and/or shipping. But one either does that at some point or nets ever less--which holds true for everyone.\n\nThat said, the blather available at this point is insufficient in detail to be of any use. I'll need to see the PirateShip rates for the specific weights and methods I use. The \"up to $X.XX\" examples above seem more intended to inspire fear and rage and letters to congress than anything else.",
            "Damn you, USPS!",
            "There’s no real clarity on how much that increase will be. I guess I will evaluate for a couple of weeks and then decide how much to raise postage. I hate to do it but at this point I’ve eaten enough profit due to direct costs like raw materials and packaging and indirect costs such as increased power consumption related to running my business and increased gas costs for taking packages to the post office.",
            "Raising rates and losing/stealing more packages imagine that.",
            "Im really thinking it may be time to turn off free shipping. The $35 threshold has remained the same since the beginning and the shipping costs keep going up",
            "But you also need to raise your shipping rates when you sell something for $4.   My new rate will be $4.60",
            "I offer free shipping on $35+ so not always the case",
            "Agreed. Last time the rate issue came up, my rates decreased for my packages despite the fear amongst the ground advantage roll out.\n\nI'll wait and compare my average with the new pirateship rates. Then I'll get my pitchfork."
        ]
    }
}