{
    "Self Promotion & Store Milestones for the Week of June 24, 2024": {
        "title": "Self Promotion & Store Milestones for the Week of June 24, 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/EtsySellers/comments/1dn9ua6/self_promotion_store_milestones_for_the_week_of/",
        "content": "This is an approved thread for sharing your shop links, shop launches, shop updates, instagram handles, etc.\n\nContest mode is turned on to ensure a fair share of visibility for everyone.\n\nThis is also the approved place for sharing your shop milestones!  Please use this thread and only this thread to share your milestones. Do your best to also share any information that other sellers might benefit from including tips and tricks that got you to the milestone, etc. \n\nWe strongly prefer posts that contain more information about the milestones. Tell us your story. Talk about the struggles you went through to reach 1000 orders. Explain what you learned about producing your products that let you scale from 10 orders to 100 orders.",
        "num_comments": 74,
        "comments": [
            "Etsy’s fees are absurd. When we run a promotion in our store, they charge fees based on the product’s original price, not the discounted price. They should be encouraging promotions; promotions are good for customers who get to buy at lower prices, good for us because we can sell more, and good for Etsy because they generate more revenue. But Etsy is very greedy, so they charge fees based on the product’s non-discounted price. This is ridiculous.",
            "OH MY GOSH the little burger earrings!!! brb i'm favoriting your shop <3",
            "Wow your stuff is beautiful!!",
            "Your frog suncatcher is so cute! My second dad and his partner have tons of little frog figurines. I know they’d love it!",
            "I love your banner! Did you do it or order it?",
            "Aw thank you so much!💕💕",
            "Thank you so much! I appreciate you taking a look.",
            "Aww thank you so much! ❤️🐸",
            "Thank you!! I made all my banners myself :]",
            "Hello all! I sell these baby shower favors that are wildflower seed packets in my shop. Check them out. They are very cute in “Baby in bloom” themed with 5 different designs. \n\n[Baby in Bloom Baby shower favors](https://etherealartsstudioco.etsy.com/listing/1386774442)"
        ]
    },
    "How are your sales? Monthly Sales Post for June 2024": {
        "title": "How are your sales? Monthly Sales Post for June 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/EtsySellers/comments/1d5lfe7/how_are_your_sales_monthly_sales_post_for_june/",
        "content": "Please use this stickied post (and only this post!) to discuss how your views and sales are going.\n\nThis includes discussion of trends in sales and views, as well being the place to share general suggestions on improving traffic during slow times.  \n\nNOTE: Please do not post shop names, shop links, or shop critique requests in this thread.  If you would like advice specific to your shop, please read and follow the Shop Critique Guidelines linked in the sub rules and create your own post.\n\nAny type of self promotion (including promotion of services for Etsy sellers) is also not allowed here.  If you receive a private message offering or promoting a service from anyone posting in this thread, please mark the message as spam and notify the mod team.",
        "num_comments": 104,
        "comments": [
            "I don't think May has ever been this bad, I dropped from an average of 20 orders a month to only 5. Though my yoy is still better than last year, so that's something, haha. Will for sure focus on trying to have my sales back on track for June and get that average of orders per month up.",
            "May was my highest number of orders in a single month since I started on Etsy 2 yrs ago.",
            " Has June been super slow for anyone else ..? I have a successful shop with orders everyday with my best months all time earlier this year, but yeah super slow rn.",
            "I actually finally had 2 sales in May thanks to reddit and art subs.",
            "May has been the best month so far this year. But every single month this year revenue/orders have been down at least 50% from last year. Is there a way to provide feedback directly to etsy about how their seo is broken and gift mode is ruining sales for sellers?",
            "$29k, took a dip from April but not terrible. So far this year March has been my best month.",
            "Opened new shop late april. Made 12 sales in May. Hopefully there'll be more in June!",
            "Last summer I added a new product that is the most expensive thing in my shop. All of a sudden it has taken off. As a result, while my number of orders decreased 4% from last year, revenue was up 90%, making it one of my best months since starting my shop in 2019! (April was up, too.)",
            "It’s been super slow but I’m so close to 100 sales so I’m excited!!!",
            "I just hit 100 sales!!!! I’m so happy"
        ]
    },
    "Someone listing under my seller account ": {
        "title": "Someone listing under my seller account ",
        "score": 2,
        "url": "https://www.reddit.com/r/EtsySellers/comments/1drc7lz/someone_listing_under_my_seller_account/",
        "content": "I haven't used my seller account since 2017. I got an email last week (and several more since) saying items had been removed due to \"IP infringement.\" I logged in to see what was going on and someone has listed 200+ items under my name. I tried to close the shop but am unable to because there is a balance of -$165 from this person's listing fees and ads\n\nHas this happened to anyone/are there suggestions on what to do? I submitted an email to Etsy via their contact us form but haven't received a response.",
        "num_comments": 0,
        "comments": []
    },
    "I'm so upset ": {
        "title": "I'm so upset ",
        "score": 16,
        "url": "https://www.reddit.com/r/EtsySellers/comments/1dqzav2/im_so_upset/",
        "content": "I sell a $5 tax deduction tool for Canada. I literally sold a single one in 2024 (I update them annually).  The buyer just left a one star review saying that another store is selling the sheet and they don't know which copied the other.\n\n Just to double check I went and searched other listings -there's literally only 2 stores that sell a similar product.  \nOne store has a file that looks different, and the other store has 0 sales. \n\n",
        "num_comments": 6,
        "comments": [
            "Message the customer and let them know that you were first. You can even show the date that they created their listing versus the date that you created your listing. They may not change their review, but at least you are setting the story straight. If they don't change it after a while, reply to let future customers know that you are the original.",
            "I can feel your frustration. It’s ok to feel that way. I was the same at the beginning. After a while, after 10ish fool reviews, i forgive myself. It just not worth to argue with people that cloud be in any state you don’t know. They probably have low knowledge level or just had a bad day. I will just try to get them change review first. 99.9% of time they wouldn’t. I will just public reply with claim and  explain the situation. So other buyer can do they own judgement. You have beautiful things around you. Move on🍀",
            "Did you sell to a buyer in their area? If not, how can it be anything other than coincidence where 3 people in all of Canada came up with the same idea? 🤔",
            "Thanks for the response. The thing is that there is actually no other listing! I have no idea what they are even referring to! \nMessaged the customer and said I'm shocked someone stole my sheet and asked for a link,  but they didn't respond yet. If needed I'll respond to the review but I'm hoping the customer will delete it, seems very unfair.",
            "I needed this! You're so right. Thank you for the compassionate response. It's honestly not a big deal at the end of the day. I'll give it the weekend and respond publicly. 🌻🙏🙏 you rock",
            "This is just a tax deduction tool, there are hundreds for the US but hardly any  for Canada. It's not so much of a unique idea, but a smaller market. I sold about 5 over the years but none in 2024 until this sale (because tax laws change this needs to be regularly updated)."
        ]
    },
    "USPS raising rates Again.": {
        "title": "USPS raising rates Again.",
        "score": 25,
        "url": "https://i.redd.it/ef7q8qy3pd9d1.jpeg",
        "content": "They are a monopoly for small parcels and small business owners are being screeewed.",
        "num_comments": 20,
        "comments": [
            "If you offer free shipping raise your prices. Why should you lose money because usps charges more.",
            "Our clients pay the shipping.",
            "There’s no real clarity on how much that increase will be. I guess I will evaluate for a couple of weeks and then decide how much to raise postage. I hate to do it but at this point I’ve eaten enough profit due to direct costs like raw materials and packaging and indirect costs such as increased power consumption related to running my business and increased gas costs for taking packages to the post office.",
            "Raising rates and losing/stealing more packages imagine that.",
            "Im really thinking it may be time to turn off free shipping. The $35 threshold has remained the same since the beginning and the shipping costs keep going up",
            "But you also need to raise your shipping rates when you sell something for $4.   My new rate will be $4.60",
            "I offer free shipping on $35+ so not always the case",
            "Agreed. Last time the rate issue came up, my rates decreased for my packages despite the fear amongst the ground advantage roll out.\n\nI'll wait and compare my average with the new pirateship rates. Then I'll get my pitchfork.",
            "In 10 years the only packages I have lost to theft were stolen out of the USPS drop box out in front of my local PO. Some \"enterprising\" folks had taken to using powertools on them in the middle of the night. I now only drop inside the building. YMMV, and it would certainly suck if my local USPS was one of the ones that sucked hard that I hear others talk about, but I can't complain, not even about the destination POs.",
            "I like automatic calculation with some padding for handling, makes things easy"
        ]
    }
}