{
    "'Which country, what year, how well?' weekly thread : January 23 2024": {
        "title": "'Which country, what year, how well?' weekly thread : January 23 2024",
        "score": 40,
        "url": "https://www.reddit.com/r/eu4/comments/19drnpw/which_country_what_year_how_well_weekly_thread/",
        "content": "In this thread, you can post a maps from your games, and other players can try to guess who you're playing, what year it is, and any other info you specify. Please only post maps in top-level comments.      Such posts outside this thread will be removed by the moderators.       \\[Click here\\](https://www.reddit.com/r/eu4/search?q=author%3AAutoModerator+AND+%22Which+country%22&restrict\\_sr=on&sort=new&t=all) to see past threads.",
        "num_comments": 115,
        "comments": [
            "Just got the \"This is Fine\" achievement.\n\nI don't wanna talk about it lol.",
            "how to enable HRE and chinese empire in custom setup games? willing to use mods or edit savegame",
            "how are you all making these screenshots?",
            "Hello, I just noticed this when fighting America, but is it normal for their AI to max out to 100k++ total troops with 0 reserves? Esp before declaring war? I've only really noticed america doing this, so it's rather strange. Though maybe it's just that their buildings don't actually produce that much manpower compared to their standard force limit when they break free.",
            "I done Goofed... As Sweden I integrated Norway and was happy to see a proving in Florida was now mine. I decced on a nearby native to claim a bunch of land and only after peace realised I only had a colony with 200 settlers. This means I'm unable to core the land I just took and am stuck at 70% overextension. I can't keep that for the approx 32 years to get the colony finished so does anyone have any solutions. I'm wondering if I can release a vassal and feed them all land  but not sure if that's an option so nay other ideas to core them are appreciated",
            "Late response, but most defintely Riga campaign trying to have less than 6 provinces in Europe with Livonia and Prussia as vassals. Year probably 1600.",
            "Do I get the year of the picture?",
            "if you played the same campaign before it is kinda obvious :)\n\n>!Livland with riga and Teutons as Vassals? 1499?!<",
            "Netherlands 1510s? I'm noticing that neat eastern border.",
            "Yours looks exactly the same as the other guy's, so I'm gonna say 1510 Orissa"
        ]
    },
    "The Imperial Council - /r/eu4 Weekly General Help Thread: June 24 2024": {
        "title": "The Imperial Council - /r/eu4 Weekly General Help Thread: June 24 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/eu4/comments/1dncxwx/the_imperial_council_reu4_weekly_general_help/",
        "content": "[**Please check our previous Imperial Council thread for any questions left unanswered**](https://redd.it/19drnpw)\n\n&nbsp;\n\nWelcome to the Imperial Council of r/eu4, where your trusted and most knowledgeable advisors stand ready to help you in matters of state and conquest.\n\nThis thread is for any small questions that don't warrant their own post, or continued discussions for your next moves in your Ironman game. If you'd like to channel the wisdom and knowledge of the master tacticians of this subreddit, and more importantly not ruin your Ironman save, then you've found the right place!\n\n**Important**: If you are asking about a specific situation in your game, please post screenshots of any relevant map modes (diplomatic, political, trade, etc) or interface tabs (economy, military, ideas, etc). Please also explain the situation as best you can. Alliances, army strength, ideas, tech etc. are all factors your advisors will need to know to give you the best possible answer.\n\n&nbsp;\n\n---\n\n#**Tactician's Library:**\n\nBelow is a list of resources that are helpful to players of all skill levels, meant to assist both those asking questions as well as those answering questions. This list is updated as mechanics change, including new strategies as they arise and retiring old strategies that have been left in the dust. You can help me maintain the list by sending me new guides and notifying me when old guides are no longer relevant!\n\n###**Getting Started**\n\n* [Europa Universalis 4 Wiki](https://eu4.paradoxwikis.com/Europa_Universalis_4_Wiki) \n\n* [Wiki Beginner Guide](https://eu4.paradoxwikis.com/Beginner%27s_guide)\n\n* [Which DLCs should I buy?](https://redd.it/13feee3)\n\n* [Client/Game Troubleshooting Help](https://redd.it/d8xa5i)\n\n* [Reverting to a previous version](https://redd.it/n1powo)\n\n###**New Player Tutorials**\n\n* [How to play EU4, by Ezekiel (patch 1.28)](https://youtu.be/Xj4CMkmYH20)\n\n* [Arumba teaches EU4 to Civilization player FilthyRobot (patch 1.18)](https://www.youtube.com/playlist?list=PLQFX9B_9L4-nsTuK1eDEOuBHKVoKc4cQN)\n\n* [Arumba's New Player Tutorial Series (patch 1.20)](https://www.youtube.com/playlist?list=PLH-huzMEgGWC4jPjzdV9H5TQ7vbrUDCWx)\n\n* [Arumba teaches EU4 to Monk004 (patch 1.28)](https://www.youtube.com/playlist?list=PLH-huzMEgGWBbYuS-yMApLBZgVaug8NSQ)\n\n* Beginner's Guide to Coalitions [1](https://redd.it/5njq2u), [2](https://redd.it/j3dr2s)\n\n* [General tip collection thread](https://redd.it/64xzkj)\n\n* [How to revert to an older patch](https://redd.it/9khrrz)\n\n* [Reman's War Academy Volume I - Army Composition and Basic Combat](https://youtu.be/O63oZQpKt_g)\n\n###**Administration**\n\n* [Remans guide to Absolutism](https://youtu.be/_Oi9DkyqoPA)\n\n* [Guide to Religious Ideas](https://redd.it/9ofkr2)\n\n* [Converting Culture](https://youtu.be/6VrP6P-O1kI)\n\n* [Converting Religion](https://youtu.be/Gb7CxztH2MQ)\n\n###**Diplomacy**\n\n* [Personal Unions and Succession Wars](https://redd.it/5q34pw)\n\n* [Video guide to Personal Unions](https://youtu.be/seW0FRZdts4)\n\n* [A guide to multiplayer diplomacy](https://redd.it/625vt9)\n\n* [Comprehensive guide on Subject Nations](https://redd.it/d54ws7)\n\n###**Military**\n\n* [Reman's War Academy Volume II - Troop Quality and Advanced Combat](https://youtu.be/2gutDqekiqc)\n\n* [Reman's War Academy Volume III - Military Idea Groups](https://youtu.be/6OrR2TAXk6s)\n\n* [Reman's In-Depth guide to Fort Zone of Control](https://youtu.be/x3KqmV_9-bA)\n\n* [Guide on Combat Width](https://redd.it/crhpdx)\n\n* [Ideal army composition for every tech](https://docs.google.com/spreadsheets/d/1t86y02OJbi1iqiDMLzaQzk48HxOQYbHXMQbA-VUdTFc/edit)\n\n* [On War - A Comprehensive War Manual for Multiplayer](https://redd.it/4lyql4)\n\n* [Dismantling the HRE](https://youtu.be/OkbWVmpWdQ8)\n\n* [Combat Simulator](https://euiv.pdxsimulator.com/)\n\n###**Trade**\n\n* [Reman's In Depth Guide to Trade](https://youtu.be/edjLVFMjPyo)\n\n&nbsp;\n\n---\n\n#**Country-Specific Strategy**\n\n* [1.30 Aztec Guide](https://redd.it/j3w9fh)\n\n* [1.30 Granada Guide](https://redd.it/ivszda)\n\n* [1.30 Knights Guide](https://redd.it/lstiyc)\n\n&nbsp;\n\n---\n\n#**Misc Country Guides Collections**\n\n* [1.25 - 1.29 Misc Country Guides by RadioRes](https://eu4guides.com/nations/)\n\n* [1.25 - 1.28 Misc Country Guides by Lord Forwin](https://www.youtube.com/playlist?list=PLBFHMnSg-2ypxhlLc9jQ8jmqWLIK_S7mr)\n\n* [1.28 - 1.30 Misc Country Guides by AlzaboHD](https://www.youtube.com/playlist?list=PLYAndN7o-9kle7nV5u3n9Kag77lUB6h8K)\n\n* [1.30 Misc Country Guides by Ludi et Historia](https://www.youtube.com/playlist?list=PLrsZC4e_2qJ_CfLMUMsP4d2ylMwdxWPrE)\n\n* [1.31 - 1.35 EU4 Nation Guides by The Red Hawk](https://www.youtube.com/playlist?list=PLsO8A6cTBgguX6W3b2j-9IlbSHn2nR8wO)\n\n* [Misc Country Mission Visualizations](https://redd.it/jvxoyk)\n\n&nbsp;\n\n---\n\n#**Advanced/In-Depth Guides**\n\n* [Misc mechanics guides by RadioRes (culture shifting, policies, absolutism, etc)](https://eu4guides.com/mechanics/)\n\n* [Guide to personal unions and direct inheritance](https://redd.it/pzsld6)\n\n* [1.28 Three Mountains (Shogunate)](https://redd.it/at4q4h)\n\n* [Arumba's Assay series](https://www.youtube.com/playlist?list=PLH-huzMEgGWCaFaS1qcBZDjGIkhRyF78C) (misc patches, takes user-submitted failing or problematic games and helps fix them)\n\n* [A Complete Guide to EU4 Economics, Part 0](https://redd.it/bynmu5) (links to multiple in-depth guides on economics)\n\n* [Comprehensive Multiplayer EU4 Guide (1.28)](https://docs.google.com/document/d/1TnBx-v-hRRlC8HZfDL3XoDL3t3XwklUjdcB26GEQfn0)\n\n* [General World Conquest Guide](https://redd.it/7l2bfr)\n\n&nbsp;\n\n---\n\n**If you have any useful resources not currently in the tactician's library, please share them with me and I'll add them! You can [message](https://old.reddit.com/message/compose?to=Kloiper&subject=EU4%20Help%20Thread%20Tactician%27s%20Library) me or mention my username in a comment by typing \\/u\\/Kloiper**\n\n**Calling all imperial councillors!** Many of our linked guides pre-Dharma (1.26) are missing strategy regarding mission trees. Any help in putting together updated guides is greatly appreciated! Further, if you're answering a question in this thread, chances are you've used the [EU4 wiki](https://eu4.paradoxwikis.com/Europa_Universalis_4_Wiki) and know how valuable a resource it can be. When you answer a question, consider checking whether the wiki has that information where you would expect to find it, and adding to the wiki if it does not. In fact, anybody can help contribute to the wiki - a good starting point is the [work needed](https://eu4.paradoxwikis.com/Europa_Universalis_4_Wiki:Work_needed) page. Before editing the wiki, please read the [style guidelines](https://eu4.paradoxwikis.com/Europa_Universalis_4_Wiki:Style) for posting.",
        "num_comments": 35,
        "comments": [
            "Playing as Qing, just casually following the mission tree, when suddenly around the late 1600s I got a subjugation CB on Spain - not an agenda, not a mission, not an event, just suddenly I got the popup that I had the subjugation CB. Any idea what caused that? Bug?\n\nIt's on Ironman and already got the Horde achievement as Manchu before forming Qing, so it is not a mod either.",
            "Which trade power bonuses effect ship trade power other than the eponymous one and under what conditions?",
            "I am playing as Italy (started as Florence) and have conquered most of Europe and Africa. I want to form Egypt for the achievement, but the advised method of releasing the Mamluks doesn't work, as they are then still a vassal and need to be independent to form Egypt. Is there a way of making a vassal independent and still play as it? As it seems now, my two options are releasing every possible vassal as Italy, giving away everything but the capital and disbanding all armies before releasing Mamluks so it's easy to win an Independence war, or to force convert myself to Islam through rebels, moving capital to Cairo and then forming first Mamluks and then Egypt. Both seem like a lot of work so is there an easier way?",
            "Playing as Mamluks and have blobbed nicely and getting close to tech 18. Should I form Egypt or Arabia ?",
            "Are republics immune to revolution?",
            "I was playing holland, and a hre coalition formed as I got 3 provinces when I got my independence. I was allied to france and england but both dishonored their alliance as I got declared on.\n\nI don't know how this can be prevented ...",
            "If an emperor claims unlaw territory and you give it back, do you lose the AE from it?",
            "Judging by my empty savefile box, was 1.37.2 one of those updates PDX uses to clear away old savegames?",
            "how to make it most likely that appenage will attack another vassal and demand release of another tag as the peace deal? i want to do a meme strat where i woupd have appenages everywhere",
            "Are you asking for sources of Ship Trade Power bonuses?"
        ]
    },
    "I’m sorry but this has to be the absolute worst way to visually demonstrate population": {
        "title": "I’m sorry but this has to be the absolute worst way to visually demonstrate population",
        "score": 1645,
        "url": "https://i.redd.it/hwl9es08yd9d1.jpeg",
        "content": "",
        "num_comments": 116,
        "comments": [
            "one dot on the map for each pop. paradox dm me for where to send my royalties",
            "they should just render every person individually",
            "I'm sure they will have some color scale eventually, the game isn't even announced yet",
            "I can think of worse. Have a sprite on each province where the population is logarithmically proportional to the volume of the sprite",
            "It'll be linked to Excel via VBA macros so you can visualise it how you want",
            "the game is not out and wont be for a long time. You dont have to nitpick at early development. The visualization will 100% get changed",
            "i hope they add color gradiants and different levels of the map(areas or regions instead of locations). problem with color gradiants is that if 1% is 1 million, and the rest is between 1k and 100k, it wont be helpfull(see dev map in eu4), and making it logarithmic is still easy to misinterpret",
            "I'm pretty sure they've mentioned on the forums that they have some revisions for this map mode coming in the future.",
            "Pavia confirmed SaintDaveUK is working on a better visualization",
            "i do hope they do colouring to make it more understandable at a glance, and also perhaps change the numbers to be shortened to be more like 3.2k for example"
        ]
    },
    "Sikh Man of Europe": {
        "title": "Sikh Man of Europe",
        "score": 94,
        "url": "https://www.reddit.com/gallery/1dr86vf",
        "content": "",
        "num_comments": 14,
        "comments": [
            "This should be an achievement or something. Start as Mann, tag switch to Ottos, shift to Sikh religion and conquer Europe region. The Sikh Mann of Europe.",
            "Wahe guru ji da Khalsa wahe guru ji di Fateh.",
            "R5: All my haters been calling me the sick man of Europe behind my back. What now bitches??",
            "Ah yes, Ottomans, the sikh man of europe",
            "Thanks, yeah it was a pretty unOrthodox run. Im usually Ibadi at the game but I played well this time.",
            "Afaik Ottomans are not formable",
            "Don't sunni yourself about it. Or something. I don't know, I'm not good with puns",
            "Stop cursing or youll become ibadi kid",
            "Well, that's Sikh.",
            "Europe?"
        ]
    },
    "Discussion: Is the AI's tendency to stack fort defense making the single player experience worse? The current setup is honestly quick compared to reality, but imagine not being good at the game and attacking into this. 80% siege ability, and there's almost 2 months per siege tick.": {
        "title": "Discussion: Is the AI's tendency to stack fort defense making the single player experience worse? The current setup is honestly quick compared to reality, but imagine not being good at the game and attacking into this. 80% siege ability, and there's almost 2 months per siege tick.",
        "score": 205,
        "url": "https://i.redd.it/2o7sgk836f9d1.png",
        "content": "",
        "num_comments": 46,
        "comments": [
            "Its one of the few smart decisions the AI makes. Paradox please fix.",
            "The assault fort button is right there my dude. Some of them may die, but that's a sacrifice you should be able to afford if you have that many cannons.",
            "I mean, what do you mean worse? I feel like it's a valid thing to consider when going to war. Better have lots of manpower or use mercs.\n\nI know waiting for sieges is not very engaging, but I think it's nice to have some challenge and not be able to simply steamroll everyone in the late game",
            "What can i say buddy, i once started campaign on Scotland, i have stacked 78% defensiveness in 1447 on a province bordering England , and England with no siege general, sieged it less than a year, with siegtick 52 day, and didnt siege at same amount of time the lvl 1 fort in Ireland. That was disgusting. If i were to siege like this  would take over 2 years.",
            "I know Ethiopia is not the best example, but there's plenty of lvl 8 forts in Europe with 80-100% defense.",
            "Germany, China, and India are the worst examples.\n\nFuck you Westphalia. Every fucking province is a fort.",
            "How do you unlock artillery wall breaking in the new update?",
            "No I dont think it would be bether If the AI would lay on its back waiting to die even more like they do now.",
            "no this is fine, if a player isn't good at the game, this will be an opportunity to learn, we all struggle at some point and we all learn.  \nthe game isn't for casuals/people who don't like to hover over numbers to get details about every number",
            "in my experience, forts take about a year or two to fall assuming you do it properly, regardless of fort defense. once i realized that, sieging the forts became easier."
        ]
    }
}