{
    "War in Ukraine Megathread LVI (57)": {
        "title": "War in Ukraine Megathread LVI (57)",
        "score": 361,
        "url": "https://www.reddit.com/r/europe/comments/1bkysju/war_in_ukraine_megathread_lvi_57/",
        "content": "\nThis megathread is meant for discussion of the current **Russo-Ukrainian War**, also known as the **Russian invasion of Ukraine**. Please read our [current rules](https://www.reddit.com/r/europe/wiki/community_rules), but also the extended rules below.\n\n# News sources:\n\n- [The Guardian](https://www.theguardian.com/world/series/russia-ukraine-war-at-a-glance)\n\n- [Associated Press](https://apnews.com/hub/russia-ukraine).\n\n- [BBC News](https://www.bbc.com/news/world-60525350)\n\n- [Al Jazeera English](https://www.aljazeera.com/tag/ukraine-russia-crisis/)\n\n- [Financial Times \"War in Ukraine\" section](https://www.ft.com/war-in-ukraine)\n\nYou can also get up-to-date information and news from the [r/worldnews live thread](https://www.reddit.com/live/18hnzysb1elcs), which are more up-to-date tweets about the situation.\n\n### **Current rules extension:**\n \nExtended [r/europe ruleset](https://www.reddit.com/r/europe/wiki/community_rules) to curb hate speech and disinformation:\n\n- While we already ban hate speech, we'll remind you that hate speech against the civilians of the combatants is against our rules, including but not limited to Ukrainians, **Russians**, Belarusians, Syrians, Azeris, Armenians, Georgians, etc. The same applies to the population of countries actively helping Ukraine or Russia.\n\n- **Calling for the killing of invading troops or leaders is allowed, but the mods have the discretion to remove egregious comments**, and the ones that disrespect the point made above. The limits of international law apply. \n\n- **No unverified reports of any kind in the comments or in submissions on r/europe**. We will remove videos of any kind unless they are verified by reputable outlets. This also affects videos published by Ukrainian and Russian government sources.\n\n- **Absolutely no justification of this invasion**.\n\n- In addition to our rules, **we ask you to add a NSFW/NSFL tag if you're going to link to graphic footage** or anything can be considered upsetting, including combat footage or dead people.\n\n### Submission rules\n\nThese are rules for submissions to r/europe front-page.\n\t\n- No status reports about the war unless they have major implications (e.g. \"City X still holding\" would not be allowed, \"Russia takes major city\" would be allowed. \"Major attack on Kherson repelled\" would also be allowed.)\n\n- **All dot ru domains have been banned by Reddit as of 30 May**. They are hardspammed, so not even mods can approve comments and submissions linking to Russian site domains.\n  - Some Russian sites that ends with `.com` are also hardspammed, like TASS and Interfax, and mods can't re-approve them.\n    - The Internet Archive and similar archive websites are also blacklisted here, by us or Reddit.\n- We've been adding substack domains in our u/AutoModerator script, but we aren't banning all of them. If your link has been removed, please notify the moderation team, explaining who's the person managing that substack page.\n- We ask you or your organization to not spam our subreddit with petitions or promote their new non-profit organization. While we love that people are pouring all sorts of efforts on the civilian front, we're limited on checking these links to prevent scam.\n- No promotion of a new cryptocurrency or web3 project, other than the official Bitcoin and ETH addresses from Ukraine's government.\n\n### META\n\n[**Link to the previous Megathread LVI (56)**](https://www.reddit.com/r/europe/comments/1bkysju/war_in_ukraine_megathread_lvi_57/?sort=new)\n\n**Questions and Feedback**: You can send feedback via r/EuropeMeta or via [modmail](https://www.reddit.com/message/compose/?to=/r/europe).\n\n---\n \n**Donations:**\n\nIf you want to donate to Ukraine, check [this thread](https://www.reddit.com/r/europe/comments/t03lml/want_to_support_ukraine_heres_a_list_of_charities/) or [this fundraising account by the Ukrainian national bank](https://www.reddit.com/r/worldnews/wiki/ukrainewar#wiki_donations). \n\n---\n\n**Fleeing Ukraine**\nWe have set up a wiki page with the available information about the border situation for Ukraine [here](https://www.reddit.com/r/worldnews/wiki/ukrainewar). There's also information at [Visit Ukraine.Today](https://visitukraine.today) - The site has turned into a hub for \"every Ukrainian and foreign citizen [to] be able to get the necessary information on how to act in a critical situation, where to go, bomb shelter addresses, how to leave the country or evacuate from a dangerous region, etc.\"\n\n---\n\n### Other links of interest\n\n- [Live Map of Ukraine site](https://liveuamap.com/) and [Institute of War](https://understandingwar.org/) have maps that are considered reliable by mainstream media.\n\n- [Wikipedia: 2022 Russian invasion of Ukraine](https://en.wikipedia.org/wiki/2022_Russian_invasion_of_Ukraine)\n\n- [#UkraineFacts: an international coalition of journalists fact-checking media surrounding the war in Ukraine](https://ukrainefacts.org/)\n  - DO NOT CONFUSE THIS WITH \"War of Fakes\". [Deutsche Welle (DW) has reported it as being a source of fake news](https://www.dw.com/en/ukraine-war-how-a-fact-checking-website-is-spreading-russian-propaganda/a-61062940), and the Russian Defense Ministry has linked this site in their tweets before.\n\n- [UNHCR refugee tracker focusing on Ukrainians](https://data2.unhcr.org/en/situations/ukraine)\n\n- [DeepL extension for Google Chrome](https://chrome.google.com/webstore/detail/deepl-translator/kgljlkdpcelbbmdfilomhgjaaefofkfh) and [DeepL extension for Firefox](https://addons.mozilla.org/en-US/firefox/addon/to-deepl/). DeepL is a good alternative to Google Translate for Russian and Ukrainian texts.\n\n---\n\n# Please obey the request of the Ukrainian government to [refrain from sharing info about Ukrainian troop movements](https://i.redd.it/5atggucaurj81.jpg)",
        "num_comments": 1598,
        "comments": [
            "The latest round of missile strikes on Ukraine is fucking sickening. We need to give Ukraine the appropriate armaments so that they can flatten the Kremlin and take out Putin.",
            "I'm so fucking tired of Europe being afraid of Russia. We should use our superior economical and industrial might to provide the weapons for the Ukranians. When Russians are drowning in their own blood we should celebrate. Every destroyed Russian tank, IFV and airplane is a reason to be happy. We should celebrate the death and destruction we help Ukraine to inflict on the battlefield. And then we should manufacture more weapons and ammunition.   \n  \nWe should cut all ties with Russia. We should ban every member of Putins regime and oligarchy including their family from the EU. We should give the Russian assets we have frozen to Ukraine. We should enforce secondary sanctions to avoid our technology from reaching Russia.\n\nWhy are we not doing all of this? Why are we sleepwalking? What the fuck is our political elite doing? Why are they sleep at the wheel?",
            "It's really an extraordinary moment: we have a US ex-president who is, in effect, dictating American foreign policy on behalf of a foreign fascist dictator.",
            "Russian propaganda in Serbia's government-sponsored tabloids: \"US, UK and Ukraine organised the terrorist attack in Moscow.\" https://twitter.com/AgonMaliqi/status/1772922191136371096",
            "[removed]",
            "The UK plans to give equipment to Kyiv including 400 vehicles, more than 1,600 missiles (including Storm Shadows), 4m rounds of ammunition, 60 boats, as well as an additional £500m in military funding, taking the total to £3bn this financial year. \n\nThe UK’s £500m additional funding, which officials said would come from Treasury reserves, will be used to deliver ammunition, air defence, UK-built drones and engineering support to the Ukrainian frontline. https://www.theguardian.com/world/2024/apr/22/rishi-sunak-promises-uks-largest-ever-military-support-package-for-ukraine",
            "⚡️1200 km from the border with 🇺🇦 Ukraine: drones attacked enterprises in 🇷🇺 Yelabuga and Nizhnekamsk, Tatarstan. A drone arrived at the Elaz-Naftoprodukt Refinery. A second drone arrived in the special economic zone \"Alabuga\", where Shahed drones are reportedly assembled. https://twitter.com/NOELreports/status/1775046530631643427",
            "Putin and peace proposals are in the news again, so I think it is worth repeating:\n\n* Any peace deal that leaves Ukraine without NATO membership or an equivalent strong binding military alliance against Russia (with the lack of NATO or such alliance often labeled misleadingly as \"Ukrainian neutrality\") is not a peace deal but only a temporary ceasefire, which Russia will break the moment they think they have a good opportunity. Without an alliance, there is nothing to enforce Russia following the treaty. Same goes for any peace deal that seeks to disarm Ukraine. And in fact Russian proposals have generally demanded both neutrality and disarmament.\n\n* Russian proposals generally are not serious, as evidenced by them making demands such as above. Such unserious proposals have only the purpose of attempting to buy Russia time to reorganise for new offensives, or to feed grotesquely false propaganda along the lines of \"Russia wants peace, but Ukraine doesn't want it / NATO won't let Ukraine do it\".\n\n* Russia has repeatedly broken treaties and agreements and as a consequence has very little credibility and is not to be trusted. Russian propaganda will constantly point towards supposed vague verbal promises about NATO expansion made to Gorbachev, which never entered any formal written treaty, while it has constantly broken everything from the Helsinki Accords, to the Russia-NATO Founding act, to the Budapest memorandum, to the Minks agreements, all of which are actual formal treaties.\n\n* The sole responsibility for this war is on Russia, Russia is the one who invaded and started the war and continues it, and it is entirely within Russia's options to immediately make peace: Russia can end the war at any time simply by withdrawing from Ukrainian territory. \n\nThe correct answer to any Russian \"peace proposals\" is and remains this: Or Russia could just go home.",
            "https://www.ft.com/content/e63d6bb3-4381-4731-9724-d059e4eabf60\n\n*The writer, co-winner of the 2022 Nobel Prize for Peace, heads the Center for Civil Liberties in Kyiv and is on the board of the Institute for War & Peace Reporting*\n\nMy friend, a writer, texted last night from his trench to say a gentle goodbye. His unit is expecting an attack any time, but they do not have the heavy artillery they need to repel the assault.\n\nI am thousands of miles away from Ukraine, on a six-city lecture tour across the US, addressing public meetings and briefing members of Congress. But the war stays with us Ukrainians wherever we may travel. Rest is impossible when, back home, the delay in delivering crucial arms is costing the lives of our friends, our relatives, our countrymen.\n\nThe $60bn US package has been stalled for months by what, for Americans, is domestic politics; for us Ukrainians, it is a matter of life and death. In my meetings here, I am frequently asked: since Ukraine cannot expect to defeat Russia on the battlefield, shouldn’t it accept a land deal? Won’t more arms just mean more death?\n\nIndeed, Ukraine has seen far too much death — I know, because my colleagues and I see it daily. For the past decade, my organisation has documented war crimes by Russian forces occupying my country. Since the full invasion in February 2022, the scale of crimes has escalated exponentially. With a network of Ukrainian groups, we have documented killings, rape and torture — beatings, peeling off fingernails, genital electric shock. One woman I interviewed had her eye extracted by a spoon. To date, we have documented 68,000 crimes.\n\nYet this is only the tip of the iceberg, because such crimes are central to both the method and the purpose of the invasion. The Russian position, as the president has made repeatedly clear, is that Ukrainian language and culture, that Ukraine and Ukrainians, do not exist.\n\nA premature deal would be wrong — not least because we tried it already, and it failed. In 2014, Russia seized Crimea and part of the Donbas. Ukraine was not able to respond effectively, and the international response was muted. A ceasefire was then agreed. All Russia did was use the next eight years to prepare forward bases for the next attack. Moscow will only do the same again.\n\nAn early deal would also be immoral. You do not make peace by disarming the invaded country. This would be occupation and we know what that would mean.\n\nIn a de-occupied area of the Kharkiv region, after the Ukraine army pushed Russian forces back, the degraded body of beloved Ukrainian children’s writer Volodymyr Vakulenko was discovered in an unmarked mass grave in the Izyum woods. After extensive investigation, the Russian soldiers responsible for this crime have recently been identified.\n\nWhy kill a children’s writer? Russia kills Ukrainian civilians because it can. After decades of brutal warfare — in Chechnya, in Syria and beyond — it has never been held accountable.\n\nRussia is now increasing its assaults on Ukrainian civilian infrastructure, and we expect a major attack this summer. Our capital city, my home, could again be under direct threat.\n\nIn the meantime, destabilisation activities are under way against Moldova and other neighbouring countries. Moscow is the centre but Russia’s imperial vision has no defined borders. This nightmare — this endless cataloguing of human pain — will only continue.\n\nThe solution is to defeat Russia and this authoritarian ideology. A stand must be made, and Ukrainians are bravely making it. War is horrible. But Ukrainians know what Russia brings, and the clear majority of the population — more than 70 per cent — support continuing the fight “as long as it takes”.\n\nWe respect American politics. We know every country has its own priorities and financial issues. We are grateful for the generous support we have received so far from the US, Europe and other countries around the world, both from governments and ordinary citizens. But now we need more help, and we need it soon. Ukraine wants peace more than anyone. But we cannot fight evil with empty hands. Strengthen Ukraine, let us pursue the war as far as we can — our vision is to the internationally recognised 1991 borders — and then we can discuss peace. Our friends in Russian human rights groups tell us the same: the best way to help Russian democracy is to defeat Russian militarism in Ukraine.\n\nThis is not a war for land. It is a war for survival. Not just of the Ukrainian people but of the basic values of human rights, of democracy, of liberty. The majority of American people know this and support more aid for Ukraine. The majority of members of Congress agree. Meanwhile, I continue to get text messages from the front every night. Will the US send fresh arms before it is too late?",
            "The Kremlin is conducting a concerted air and information operation to destroy Kharkiv City, convince Ukrainians to flee, and internally displace millions of Ukrainians ahead of a possible future Russian offensive operation against the city or elsewhere in Ukraine.\n\nKremlin mouthpieces are seizing on concerns about a future Russian offensive operation against Kharkiv City to conduct a likely coordinated information operation in an effort to create outsized panic among Ukrainians. ISW assesses that the likelihood of a successful Russian ground offensive against Kharkiv is very low if Ukraine receives renewed US military aid rapidly. https://www.understandingwar.org/backgrounder/russian-offensive-campaign-assessment-april-22-2024"
        ]
    },
    "Moratorium on posts related to Israel-Palestine": {
        "title": "Moratorium on posts related to Israel-Palestine",
        "score": 1010,
        "url": "https://www.reddit.com/r/europe/comments/1as6y20/moratorium_on_posts_related_to_israelpalestine/",
        "content": "r/europe is the prime subreddit to share and discuss anything related to Europe, from news to data and pictures. Due to the size and complexity of the topics this subreddit covers, new rules aren't introduced that easily here.\n\nSince Hamas' attacks on Israel back in October, we've seen a flush of users that were not previously active participants in our subreddit, and also encouraged a lot of hate speech previously unseen here. As moderators, we read the same arguments in favor of each side repeatedly since the war broke out again in the region.\n\nWe know that the Palestine Question is one of the most heated discussions on the Internet, and also one that influences the political lives of many, both inside Israel or Palestine, and outside of it. However, we've seen that users rarely maintain civility, and moderators are not able to properly maintain civil discourse compared to other topics.\n\nThat said:\n\n* Until said otherwise, **any** post related to Israel, Palestine, and the war in the region will be **removed**. Insistence on posting such content will be met with warnings and bans if necessary.\n\n* News of extraordinary importance not only to Europe - **which must be related** - but to the whole world can still be shared. Our criteria will be how many websites, from news agency (AP, Reuters) to international newspapers (Euronews, NYT, France24, and others), share **original reporting** on it. That means that initial reporting on the outbreak of the war would be allowed, but Eurovision-related news won't, for example. Use your own discretion.",
        "num_comments": 318,
        "comments": [
            "Good. \n\nToo much brigading since 7th October here. It felt like the sub was being hijacked.",
            "I think part of the problem is Reddit’s new (in the last few months) feature of recommending posts on peoples feed. Suddenly people are seeing content from countries, cities, and interest-groups that they never had heard of before.",
            "thank you. Im an israeli and im tired of seeing every freaking sub being filled with 2 sides of radicalized idiots just endlessly arguing in subs that have no connection to the conflict at all...\n\nIm here to be updated with European news. not to see arguments about countries that arent in Europe",
            "> but Eurovision-related news won't, for example.\n\nI don't get this example. Eurovision is an event organised by an majority-European organisation in Europe, with Israel participating. Isn't this quite literally the most \"European\" news on Israel we can expect? Well, except some Israeli politician visiting Europe, or EU publishing some statement about Israel\n\nThat said, I understand the general idea of the moratorium. There are enough news subs where the topic can be discussed, like rWorldnews and rNews. This topic doesn't need to flood every sub",
            "Good call. It's hard to moderate when thousands of bots swarm subs all the time, especially before elections",
            "Refreshing. Thank you. I can only wish you luck for June's election now hah.",
            "I've never truly most felt posts solely about Israel belonged here anyway. Israel is not a European country, and pretty much any post in Israel without clear reference to another European nation didnt belong here",
            "Good call, those posts were so heavily brigaded, it wasn't useful at the least.\n\n\nHappy to see the mods take action. A very reasonable decision, in my opinion.",
            ">we've seen a flush of users that were not previously active participants in our subreddit, and also encouraged a lot of hate speech previously unseen here.\n\n\nThe hate speech has always been here, it's just been targeted at eastern Europeans. Each day there are comments attacking people based purely on their nationality. Be they Irish, Hungarian, Russian, Romanian Turkish etc. All of it is disgusting and has no place on this subreddit. No one chooses their nationality or where they are born and no one should be attacked for their nationality or the religious belief they were raised with. \n\nThere should be a \"Zero Tolerance\" policy to all hate speech but because that hasn't been enforced its spilled over to a point its out of control.\n\nIf you took a Zero Tolerance policy to hate speech no matter who its aimed at than r/Europe wouldn't be in the mess it is now.  By not applying the anti-hate speech rule uniformly you compromise your principles showing that this sub is not against hate speech, your just against it when it suits and thus the rule is loosely applied with a heavy amount of bias involved. \n\n\nYou either apply a rule uniformly or not at all as otherwise we are hypocrites with no principles to speak of on this subreddit.",
            "It's so insane to me that posts about migration, which invariably result in comment sections full of racist comments, have been allowed for years, while this topic gets banned after 4.5 months"
        ]
    },
    "In a historic moment, Armenia's National Assembly debates EU membership, raising the EU flag for the first time and signaling a major shift away from its historical ally ": {
        "title": "In a historic moment, Armenia's National Assembly debates EU membership, raising the EU flag for the first time and signaling a major shift away from its historical ally ",
        "score": 7794,
        "url": "https://i.redd.it/lu7m17u6gz7d1.jpeg",
        "content": "",
        "num_comments": 533,
        "comments": [
            "I wish them good luck on this path.",
            "Sides must be chosen.",
            "I salute them and wish them nothing but prosperity 🏴󠁧󠁢󠁷󠁬󠁳󠁿🤝🇦🇲",
            "Turning to an ally that might actually give a shit about them when it counts. Great news!",
            "Hell yeah Hayastan, good luck! I seriously hope they get in, the country has been suffering for way too long, they deserve a bright future with a bunch of friends who won't ditch them first chance they get",
            "I think given the current rate of degradation by 2025, Russia will be fully kicked out of Armenia, Russia’s relations with Armenia is about to enter into full meltdown mode",
            "I really dont envy Armenians. Politically the poor bastards are playing it on hardmode. Genocidal bullies in all directions. No true allies nearby. Damned if you do, damned if you dont.\n\nAs someone from Baltics, at least we managed to enter our cheatcodes (EU, NATO) while we could.\n\nI wish the Armenians a good way forward, peace and stability.",
            "Not a good title.   \n  \nArmenia never had a historic ally. Russia always bullied us.",
            "Happy to see this 🇦🇲 🇪🇺 , then sad to remember what happened to Georgia",
            "Special Military Operation really achieving its imperialist goals"
        ]
    },
    "A year ago, Russian mercenary chief Yevgeny Prigozhin challenged the Kremlin with a mutiny": {
        "title": "A year ago, Russian mercenary chief Yevgeny Prigozhin challenged the Kremlin with a mutiny",
        "score": 859,
        "url": "https://apnews.com/article/russia-wagner-prigozhin-mutiny-putin-ukraine-war-a3c617e27a67ea38364529888292efd8",
        "content": "",
        "num_comments": 113,
        "comments": [
            "Such a shame that he chikened out in the end",
            "Biggest blueball of the century.",
            "Oh my god, it's been one whole year already?! Not to mention an extra leap day cause 2024\n\nNo... it... it can't be, right...? It hasn't been a whole year since, right...?",
            "He played Russian roulette with a semi-automatic.",
            "Russian here.\n\nIt was definitely one of the weirdest mutinies in history, but I don't think he could have succeeded anyway.\n\nFirst, he didn't have any political support from any of the ruling elite. You need to remember he had 13 years' imprisonment under articles of  \"theft\", \"robbery\", \"fraud\" and \"involving a minor in the commission of a crime. Then he worked for Putin organizing mercenaries in Africa. So while being a Putin loyalist he was a complete outsider to the ruling circle, and they sure wouldn't want to let him in. Especially if they are already satisfied with Putin's system, there is zero reason to let in an outsider bandit and a mercenary.\n\nSecond, he never had any political program for his coup attempt. It wasn't \"I'll be the new president\", it was \"I'll march towards Moscow to let Putin know my dissatisfaction with undersupplying Wagner\". And the reason Wagner started getting undersupplied is the same as always - they were getting too powerful and too influential.\n\nThe whole of Putin's rule has been \"divide and conquer\" - making sure that different government departments compete against each other without having any of them dominant. Regular military vs Wagner was one of those things. And as you can see, when Wagner was done and only the regular military was left, what did Putin do? That's right, he removed the minister of defense Shoigu (despite him being one of Putin's closest allies), and cleansed all Shoigu's people from the MoD. Same principle again - no one can be allowed to get too powerful.\n\nSo essentially Prigozhin was marching on Moscow alone, without any political support, or a political program that could attract more supporters - and not being a politician himself. He was relying on the Z-circles, but those were also getting repressed by Putin to stop them from growing too powerful. Even if he took the Kremlin or the White House, I don't think he would be able to do anything.",
            "I can understand the chickening part since he didnt know if he was going to win or something but im not sure how he thought hed still be kept alive after what he did. He shouldve defected to China or stayed at the Middle East or something.",
            "Oh, Pringles. \n\nYou screaming at Gerassimov and Shoigu about not giving you enough ammunition in the middle of the night in a forrest with dead mercs as backdrop will never be forgotten.\n\nAnd forever we will laugh about your passion for cosplaying as constipated Syrian general, sun-tanned Libyan rebel and Emo-1970s-terrorist.\n\nOh, Pringles.\n\nMay you rest in piss.",
            "How did he ever get into a plane again",
            "Shooooooooooiguuuuuuuuuu!!! Geeeeeeeeeraaaaaaaaaasimoooooooov!!!",
            "If anyone is interested in Prigozhin, I highly highly recommend the book \n*Downfall: Prigozhin, Putin, and the New Fight for the Future of Russia*. It's written by a longtime Russia academic and a Russian Journalist\n\nAlso has a great audiobook version\n\nHonestly Prigozhin's journey is super fascinating in a purely narrative sense. The man's clearly talented in a very entrepreneurial type of way. \n\nHe went from child of intellectuals to criminal to prisoner to running an illegal industry in a prison to shitty car dealer to hotdog seller to supermarket investor to restanteur to professional internet trollmaster to unwilling leader of a fake mercenary leader to enthusiastic leader of a real mercenary group to rebel\n\nAt the same time, in addition to the personal characteristics of Prigozhin, his journey is kind of emblamatic of the \"upper rung but not inner circle\" class of Russians. The people with actual power are free to use him as much as they want, and punish him pretty much however they want. But no matter how hard he worked he could never join that upper rung. And quite a lot of his actions ended up being borne out of frustration and anger towards those people"
        ]
    },
    "'Barbaric' death of Indian farm worker in Italy sparks outrage": {
        "title": "'Barbaric' death of Indian farm worker in Italy sparks outrage",
        "score": 507,
        "url": "https://www.9news.com.au/world/death-of-indian-farm-worker-in-italy-sparks-outrage/09b00c6b-eafc-4e97-b56f-d9d445feee45",
        "content": "",
        "num_comments": 113,
        "comments": [
            "I feel sadness and shame for this, we have a huge problem with worker rights in agriculture and yet people fail to understand that if you want your veggies to be grown in Italy and, at the same time, you want them to only cost 0,10€ per kg, this is how those veggies make it to your plate.",
            "Did the employer have a plan what to do with the body? I can't believe they thought that nobody would notice anything.",
            "That's extremely cruel, he could have survived. Good that the local community, trade unions, and also Meloni's reactions show that this is unacceptable",
            "Here comes the comment from accounts named [adjective]_ [noun]_[number] that are barely a few days or weeks old saying horrible shit about immigration, completely ignoring the topic at hand",
            "These fucking immigrants just cant stop living off welfare cant they? /s\n\nYou can bet this headline wont get NEARLY as much cover compared to when some immigrant commits a crime.",
            "Saw that in the news today here in Australia. That's pretty fucked up to just dump him on the side of the road.",
            "They could literally fine every farm in Italy, because almost everyone there works without a regular contract, while being an illegal immigrant.\n\nUnfortunately, this makes the news only when something terrible happens.\n\nSame as everything regarding work in Italy.",
            "What a disgusting disregard for human life. \n\nTo dump him on the side of the road when he could have survived with immediate medical attention.\n\nSo young too. Really, really sad.",
            "Barbarians are within UE borders, i dont know why people fear imigration so much if these are our compatriots...\n\nPlus actually imigrarion is made by those who run these bussiness with a high exploitation rate and at the end of the day much of the inflation is greedflation as supermarkets are driving their proffits margins up as several international institutions have indicated.",
            "Right wing and the government are doing all they can to sweep this under the rug: minister Lollobrigida, Meloni's brother in law, said it's just a bad apple, nothing to see here. Alle the right wing media are just blatantly ignoring this. Not a word."
        ]
    }
}