{
    "War in Ukraine Megathread LVI (57)": {
        "title": "War in Ukraine Megathread LVI (57)",
        "score": 383,
        "url": "https://www.reddit.com/r/europe/comments/1bkysju/war_in_ukraine_megathread_lvi_57/",
        "content": "\nThis megathread is meant for discussion of the current **Russo-Ukrainian War**, also known as the **Russian invasion of Ukraine**. Please read our [current rules](https://www.reddit.com/r/europe/wiki/community_rules), but also the extended rules below.\n\n# News sources:\n\n- [The Guardian](https://www.theguardian.com/world/series/russia-ukraine-war-at-a-glance)\n\n- [Associated Press](https://apnews.com/hub/russia-ukraine).\n\n- [BBC News](https://www.bbc.com/news/world-60525350)\n\n- [Al Jazeera English](https://www.aljazeera.com/tag/ukraine-russia-crisis/)\n\n- [Financial Times \"War in Ukraine\" section](https://www.ft.com/war-in-ukraine)\n\nYou can also get up-to-date information and news from the [r/worldnews live thread](https://www.reddit.com/live/18hnzysb1elcs), which are more up-to-date tweets about the situation.\n\n### **Current rules extension:**\n \nExtended [r/europe ruleset](https://www.reddit.com/r/europe/wiki/community_rules) to curb hate speech and disinformation:\n\n- While we already ban hate speech, we'll remind you that hate speech against the civilians of the combatants is against our rules, including but not limited to Ukrainians, **Russians**, Belarusians, Syrians, Azeris, Armenians, Georgians, etc. The same applies to the population of countries actively helping Ukraine or Russia.\n\n- **Calling for the killing of invading troops or leaders is allowed, but the mods have the discretion to remove egregious comments**, and the ones that disrespect the point made above. The limits of international law apply. \n\n- **No unverified reports of any kind in the comments or in submissions on r/europe**. We will remove videos of any kind unless they are verified by reputable outlets. This also affects videos published by Ukrainian and Russian government sources.\n\n- **Absolutely no justification of this invasion**.\n\n- In addition to our rules, **we ask you to add a NSFW/NSFL tag if you're going to link to graphic footage** or anything can be considered upsetting, including combat footage or dead people.\n\n### Submission rules\n\nThese are rules for submissions to r/europe front-page.\n\t\n- No status reports about the war unless they have major implications (e.g. \"City X still holding\" would not be allowed, \"Russia takes major city\" would be allowed. \"Major attack on Kherson repelled\" would also be allowed.)\n\n- **All dot ru domains have been banned by Reddit as of 30 May**. They are hardspammed, so not even mods can approve comments and submissions linking to Russian site domains.\n  - Some Russian sites that ends with `.com` are also hardspammed, like TASS and Interfax, and mods can't re-approve them.\n    - The Internet Archive and similar archive websites are also blacklisted here, by us or Reddit.\n- We've been adding substack domains in our u/AutoModerator script, but we aren't banning all of them. If your link has been removed, please notify the moderation team, explaining who's the person managing that substack page.\n- We ask you or your organization to not spam our subreddit with petitions or promote their new non-profit organization. While we love that people are pouring all sorts of efforts on the civilian front, we're limited on checking these links to prevent scam.\n- No promotion of a new cryptocurrency or web3 project, other than the official Bitcoin and ETH addresses from Ukraine's government.\n\n### META\n\n[**Link to the previous Megathread LVI (56)**](https://www.reddit.com/r/europe/comments/1bkysju/war_in_ukraine_megathread_lvi_57/?sort=new)\n\n**Questions and Feedback**: You can send feedback via r/EuropeMeta or via [modmail](https://www.reddit.com/message/compose/?to=/r/europe).\n\n---\n \n**Donations:**\n\nIf you want to donate to Ukraine, check [this thread](https://www.reddit.com/r/europe/comments/t03lml/want_to_support_ukraine_heres_a_list_of_charities/) or [this fundraising account by the Ukrainian national bank](https://www.reddit.com/r/worldnews/wiki/ukrainewar#wiki_donations). \n\n---\n\n**Fleeing Ukraine**\nWe have set up a wiki page with the available information about the border situation for Ukraine [here](https://www.reddit.com/r/worldnews/wiki/ukrainewar). There's also information at [Visit Ukraine.Today](https://visitukraine.today) - The site has turned into a hub for \"every Ukrainian and foreign citizen [to] be able to get the necessary information on how to act in a critical situation, where to go, bomb shelter addresses, how to leave the country or evacuate from a dangerous region, etc.\"\n\n---\n\n### Other links of interest\n\n- [Live Map of Ukraine site](https://liveuamap.com/) and [Institute of War](https://understandingwar.org/) have maps that are considered reliable by mainstream media.\n\n- [Wikipedia: 2022 Russian invasion of Ukraine](https://en.wikipedia.org/wiki/2022_Russian_invasion_of_Ukraine)\n\n- [#UkraineFacts: an international coalition of journalists fact-checking media surrounding the war in Ukraine](https://ukrainefacts.org/)\n  - DO NOT CONFUSE THIS WITH \"War of Fakes\". [Deutsche Welle (DW) has reported it as being a source of fake news](https://www.dw.com/en/ukraine-war-how-a-fact-checking-website-is-spreading-russian-propaganda/a-61062940), and the Russian Defense Ministry has linked this site in their tweets before.\n\n- [UNHCR refugee tracker focusing on Ukrainians](https://data2.unhcr.org/en/situations/ukraine)\n\n- [DeepL extension for Google Chrome](https://chrome.google.com/webstore/detail/deepl-translator/kgljlkdpcelbbmdfilomhgjaaefofkfh) and [DeepL extension for Firefox](https://addons.mozilla.org/en-US/firefox/addon/to-deepl/). DeepL is a good alternative to Google Translate for Russian and Ukrainian texts.\n\n---\n\n# Please obey the request of the Ukrainian government to [refrain from sharing info about Ukrainian troop movements](https://i.redd.it/5atggucaurj81.jpg)",
        "num_comments": 1691,
        "comments": [
            "The latest round of missile strikes on Ukraine is fucking sickening. We need to give Ukraine the appropriate armaments so that they can flatten the Kremlin and take out Putin.",
            "It's really an extraordinary moment: we have a US ex-president who is, in effect, dictating American foreign policy on behalf of a foreign fascist dictator.",
            "The house just passed the Ukraine aid bill, now off to the senate then Biden's desk.",
            "Russia publicly torturing the ISIS attackers can easily rile up sympathizers. I already read that ISIS threatened retaliation.",
            "All I want to say is Slava Ukraina, can't imagine the terrors that the brave Ukrainians have to go through",
            "Anyone knows how long the approved aid from EU and USA is supposed to last, i. e. when will new aid need to be approved?",
            "Another reason for why allying North Korea is stupid and an act of desperation is that every shell sent from North Korea is one less threatening South Korea, which makes it easier for South Korea to spare some of its own shells for Ukraine.\n\nI wouldn't be surprised if the aid Ukraine gets from South Korea will end up greater than what Russia gets from North Korea, especially if Ukraine's allies are willing to compensate South Korea (in money or for example weapon systems not given to Ukraine).",
            "Haven't seen any reports of oil refineries being hit for the last 2 weeks.",
            "Countries that gave their consent to strikes on Russian territory, thank you. It's good to see that Europe is waking up.",
            "America is back, boys. 🎉 \n\nBut this dosn't mean that the EU should stop arming. Trump's threat still remains."
        ]
    },
    "Moratorium on posts related to Israel-Palestine": {
        "title": "Moratorium on posts related to Israel-Palestine",
        "score": 1027,
        "url": "https://www.reddit.com/r/europe/comments/1as6y20/moratorium_on_posts_related_to_israelpalestine/",
        "content": "r/europe is the prime subreddit to share and discuss anything related to Europe, from news to data and pictures. Due to the size and complexity of the topics this subreddit covers, new rules aren't introduced that easily here.\n\nSince Hamas' attacks on Israel back in October, we've seen a flush of users that were not previously active participants in our subreddit, and also encouraged a lot of hate speech previously unseen here. As moderators, we read the same arguments in favor of each side repeatedly since the war broke out again in the region.\n\nWe know that the Palestine Question is one of the most heated discussions on the Internet, and also one that influences the political lives of many, both inside Israel or Palestine, and outside of it. However, we've seen that users rarely maintain civility, and moderators are not able to properly maintain civil discourse compared to other topics.\n\nThat said:\n\n* Until said otherwise, **any** post related to Israel, Palestine, and the war in the region will be **removed**. Insistence on posting such content will be met with warnings and bans if necessary.\n\n* News of extraordinary importance not only to Europe - **which must be related** - but to the whole world can still be shared. Our criteria will be how many websites, from news agency (AP, Reuters) to international newspapers (Euronews, NYT, France24, and others), share **original reporting** on it. That means that initial reporting on the outbreak of the war would be allowed, but Eurovision-related news won't, for example. Use your own discretion.",
        "num_comments": 318,
        "comments": [
            "Good. \n\nToo much brigading since 7th October here. It felt like the sub was being hijacked.",
            "I think part of the problem is Reddit’s new (in the last few months) feature of recommending posts on peoples feed. Suddenly people are seeing content from countries, cities, and interest-groups that they never had heard of before.",
            "thank you. Im an israeli and im tired of seeing every freaking sub being filled with 2 sides of radicalized idiots just endlessly arguing in subs that have no connection to the conflict at all...\n\nIm here to be updated with European news. not to see arguments about countries that arent in Europe",
            "Good call. It's hard to moderate when thousands of bots swarm subs all the time, especially before elections",
            "Refreshing. Thank you. I can only wish you luck for June's election now hah.",
            "I've never truly most felt posts solely about Israel belonged here anyway. Israel is not a European country, and pretty much any post in Israel without clear reference to another European nation didnt belong here",
            "It's so insane to me that posts about migration, which invariably result in comment sections full of racist comments, have been allowed for years, while this topic gets banned after 4.5 months",
            "Good. This is about Europe. Not Middle East. There are plenty other places on reddit to talk about it.",
            "Thank you. People seem to struggle with geography.",
            "Good job mods of r.Europe working to prevent this sub from becoming an antisemitic cesspool like half of reddit. Glad to see it."
        ]
    },
    "Man arrested with explosives near Paris airport was part of vast Russian sabotage campaign": {
        "title": "Man arrested with explosives near Paris airport was part of vast Russian sabotage campaign",
        "score": 955,
        "url": "https://www.lemonde.fr/en/france/article/2024/06/27/man-arrested-with-explosives-near-paris-airport-was-part-of-vast-russian-sabotage-campaign_6675959_7.html",
        "content": "",
        "num_comments": 58,
        "comments": [
            "Is there something russia didn't try, we had it all: Polonium, Novichok,...",
            "Russia being an insufferable neighbour case 2346689769005",
            "But we must put artificial limitations on how and where Ukraine can use weapons provided to avoid the escalation with Russia. /s",
            "I wonder if in 20 years tankies will bemoan if NATO gadaffies putin?",
            "It seems Russia wants to push for far right narrative during next elections.",
            "I think that not a single country have a right to do a terrorist attack in the any airport.",
            "Can we just have one day without hearing about this shithole of a country and the morons that populate it?",
            "Well West had their chances 80 years ago, but they didn't cut of all heads of Evil.",
            "Russia: we are are scared of a NATO attack and think it is  a secret agreement to end Russia.\n\nAlso Russia: does think that would provoke a response knowing nothing will happen.",
            "He's from Donbas? I thought EU already blocked travel for anyone with a passport from the occupied regions."
        ]
    },
    "‘I am not made for war’: the men fleeing Ukraine to evade conscription | Ukraine": {
        "title": "‘I am not made for war’: the men fleeing Ukraine to evade conscription | Ukraine",
        "score": 1276,
        "url": "https://www.theguardian.com/world/article/2024/jun/29/i-am-not-made-for-war-the-men-fleeing-ukraine-to-evade-conscription",
        "content": "",
        "num_comments": 775,
        "comments": [
            "Nobody is made for war.",
            "I mean, if the women are allowed to flee, why not the men?",
            "Redditors, cozy in mom's basement, say they are cowards,",
            "Why are only men expected to suck it up and defend the country?\nWhy are they even judged for not wanting to get their limbs ripped of, bleeding to death or beeing crippled forever? Don't repeat that WoMEn GeT cHilDr3n bullshit as reasoning, their are more then enough ladies that never have a child, while you also completly leave out the importance of a father. \nMisandry at its finest",
            "The censorship here is ridiculous",
            "Oh lol, when I told you half a year ago that my UA friends mentioned about men being snatched from the streets and that they are afraid of going out I was labeled a putinist and how unreal this was. This subreddit is no different than mainstream media propaganda, what a shame.",
            "I have spoken to a few ukrainian women who have treated the invasion like they won the lottery. One who lived in Lviv of all places having a fun time trying to decide between Canada or Spain, like its some kind of joke. “tihihi i can’t decide, spanish guys are hot”. No I’m not hating on legit refugees, but I’m being serious that quite a few that I’ve spoken to have been disgustingly opportunistic\n\nNo shit that men are fleeing. These women were never expected to fight and used the war as a way to significantly improve their life, whilst they are stuck in Ukraine about to be forced into the trenches.",
            "There are no patriots in a long war, and there are no filial sons in a long illness.",
            "It would be interesting to know the demographics of people who shun draft dodgers. Anyway, I’m pretty sure some people who comment here want Ukraine to draft as many of their own people as possible because Europe will be next if they fail. Still, I wonder how some justify not being ready to go to the trenches and fight the occupiers, but are alright sending others to do it.",
            "Remember this: conscription is the act of losing the right of not being killed."
        ]
    },
    "Russia’s latest crime in Mariupol: stealing property - It is seizing homes in order to consolidate control": {
        "title": "Russia’s latest crime in Mariupol: stealing property - It is seizing homes in order to consolidate control",
        "score": 219,
        "url": "https://www.economist.com/europe/2024/06/19/russias-latest-crime-in-mariupol-stealing-property",
        "content": "",
        "num_comments": 14,
        "comments": [
            "I feel sick, when will this shit end.",
            "They took the home of a coworker of mine. A FSB officer moved in with his family.",
            "There was a Zolkin's interview with a russian tank commander: he told that his commander told him which house to turn into dust and which not, because his commander wanted to move there with his family after the town was conquered.",
            "Yeah, they are basically a virus",
            "I hope that  the people who are doing war crimes in Ukraine will face a court",
            "Like the Israeli in the west bank.\n\nMonsters both.",
            "Hopefully that terrorist will be either jailed, deported or dead. He has no place to be in Mariupol or in Ukraine in general.",
            "russia reminds me cancer, where cancerous cells attack and destroy healthy cells.",
            "Dont mind the dislikes, the comparison is spot on",
            "Crazy how this absolutely anti-human policy isn't talked about outside of Ukraine more. \n\nRussia not only destroyed the whole city, bombing it for months akin to Dresden... They have not only tortured and killed not sufficiently pro-russian citizens there... They have not only stolen tens of thousands of children...\n\nRussia also is stealing land and property of those who are glad that Russia occupied their city, and killed their neighbors. Practically evicting them from their Mariupol by selling their homes to Russians from Moscow. \n\n'Ruskiy mir' in all its glory. Akin to how in 1940 and onwards the Ukrainian population from Polish occupied territories, or recently bordering Poland, were evicted to the far east of Asia to Siberia, and instead Russian families were brought."
        ]
    }
}