{
    "Shameless Saturday - June 29, 2024": {
        "title": "Shameless Saturday - June 29, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/Eve/comments/1dr5c1q/shameless_saturday_june_29_2024/",
        "content": "Hello and welcome to Shameless Saturday.\n\nToday you're welcome to shamelessly self promote your site/video/stream/product etc provided that it's related to EVE Online and your self-promotion to interaction ratio is 10:1 (1 self promotion link for every 10 normal interactions.) Accounts should also be a month old and have prior interactions with /r/eve.\n\nNow what are you waiting for? Go out there and sell your \\~\\~soul\\~\\~ self!\n\n\\#Don't forget to check out this months contest: [https://redd.it/nhxbxs](https://redd.it/nhxbxs)",
        "num_comments": 1,
        "comments": [
            "https://youtu.be/zkUcD-JS-hc?si=acPtpbHF5LqbgV6n\n\n=)"
        ]
    },
    "Weekly /r/Eve No Question is Stupid Thread - June 26, 2024": {
        "title": "Weekly /r/Eve No Question is Stupid Thread - June 26, 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/Eve/comments/1dpc7ki/weekly_reve_no_question_is_stupid_thread_june_26/",
        "content": "Thread comments will be sorted by \"New\" by default so the newest questions are at the top.\n\nNewbies / Returning players please visit our newbie-help channel on the [/r/eve](https://www.reddit.com/r/eve) discord: [https://discord.gg/uHpxFaA](https://discord.gg/uHpxFaA)\n\nAlternatively check out reddit.com[/r/evenewbies](https://www.reddit.com/r/evenewbies)\n\nUseful Links:\n\n* [What you need to know before playing](http://www.reddit.com/r/Eve/comments/1p915i/what_you_need_to_know_before_playing_eve_online/)\n* [/r/Eve Wiki](http://www.reddit.com/r/Eve/wiki/index)\n\n\\#Don't forget to check out this months contest: [https://redd.it/nhxbxs](https://redd.it/nhxbxs)",
        "num_comments": 39,
        "comments": [
            "Will rats target an MTU if I drop one at the start or halfway through a site?",
            "So I've been trying out drugs in a shield tank missile boat. I take bluepill for the shield boost bonus and crash for the explosion radius bonus. I have neurotoxin recovery 5.\n\nLike 5 times in a row now, I've gotten blue pill explosion radius penalty or crash shield boost penalty or both at the same time. What the fuck is the point of using drugs then. Am I missing something?",
            "Which game is more complex: this game or Stellaris?",
            "In FW, when you slide into a plex, you seem to have a bit of immunity if you don't move or take any game actions. Is that the case, or am I imagining things? If I'm not, how long do you get? I'm wondering if I have enough time to quickly look at my opponent's weapons and see whether they're autocannon or artillery, for example.",
            "There is currently a Steam sale on packs which I would like to buy. If I purchase through Steam, will I be given a code so that I can allocate it to my account?\n\nMy account was created directly through CCP and I wouldnt want the code to be allocated to the account through Steam that is on my launcher",
            "Agency boosters like the 'Hardshell' TB5 Dose II are listed as limited time. What does 'limited time' mean? Does this mean they have an expiery date like the capsulars day event boosters did? I can't find anything about it",
            "With the 1m omega 2m MCT deal, do you get 2x MCT certificates to use as/when you like or does the MCT start automatically/immediately i.e no certificates?",
            "I hear a lot about Deepwater Hooligans in lowsec, but are there any other lowsec groups/alliances that are big like that? I've been really enjoying lowsec mechanics/activities, but I'm curious who all the big groups are.\n\nI can google sov maps and nullsec blocs but can't seem to find anything that covers who the big lowsec players are.",
            "Rats won't, but there are players who will. Be aware of players dropping by to antagonize you.",
            "It's chance based after all, but if your fit cannot handle the penalties, either use the synth ones or pre-roll before undocking."
        ]
    },
    "Another scam by SKINR, your skins won't even look how you designed them to look, after you sequens them": {
        "title": "Another scam by SKINR, your skins won't even look how you designed them to look, after you sequens them",
        "score": 33,
        "url": "https://www.reddit.com/r/Eve/comments/1dra2nc/another_scam_by_skinr_your_skins_wont_even_look/",
        "content": "130 plex for sequensing, +-150kk for design elements, 9 days of waiting (with generous offer to skip the waiting time for 300 plex). \n\nThis is how it looks in the creation menu: \n\nhttps://preview.redd.it/g8ursddy1i9d1.png?width=783&format=png&auto=webp&s=0af2953824037611bea56953ed5f38c73545a11d\n\nThis is how it looks in \"collection\" tab:\n\nhttps://preview.redd.it/rwlmhjj42i9d1.png?width=1277&format=png&auto=webp&s=f6f7e619e501136e9f81bd6a9b17452aed127519\n\nAnd this is how it looks in game :)\n\nhttps://preview.redd.it/hf06ci392i9d1.png?width=830&format=png&auto=webp&s=60d47ee6d9d1f625209e8632a00409fd0c5f071a\n\nYou can say that you could see those elements be painted in small skin icon, but if you tried to use the SKINR at least once, or even browsed the skin market, you know how big of the scam those icons are, i never ever payed attention to them cause of this, and therefore didn't noticed this.   \nJust as an example of how bad are they in representing how skin actually looks like: \n\nhttps://preview.redd.it/38yvosfj3i9d1.png?width=1044&format=png&auto=webp&s=40fcb5718dcbd388bc6be8ac94736d20d5410fa9\n\n  \nTbh, i don't even know how i like this skin more. But i was making it without accounting for big bright aqua things that would pop out of nowhere, i wanted it to be dark on its own. Beside that, you can't even put patterns on the solar panes (which makes sence in some way), so i wasn't even loking towards them. Not even accounting for the fact that those parts didn't even get affected by the pattern for some reason. \n\nSome could say that this is a stupid reason to rant, but if you pay so much for a skin, you would expect to AT LEAST get exactly what you paid for. \n\nI assume that this is a bug with SKINR prewiew, but honestly, i don't care. i wished to gave the ccp the benefit of the doubt, that they missed this while testing, but remembering \"trig ships missing detailed slot\" incident of day 1, i doubd they even tested this. Noone who ever saw how this system works will want to give ccp benefit of the doubt on this. \n\n  \nTL;DR: Got scammed on skin appearance, my dissapointment is immesirable, and my day is ruined. ",
        "num_comments": 17,
        "comments": [
            "The whole system is garbage cash grab.",
            "I've encountered this a lot. The models and textures in the skinr screen seems to be far higher quality than they are in game even on ultra settings. My black matte skins came out a lot more flat than they appeared in the menu. Still nice but definitely not what I made.",
            "This looks like its a potential visual bug with the layering system, Id recommend submitting a ticket to see if thats the case",
            "I wonder how much of this could be solved by allowing you to set the lighting color and intensity while using the tool.",
            "Lighting in games is the bane of all character editors, and ship skin editors are apparently no exception.",
            "It's probably just POS code messing up the visuals.",
            "The Scimitar has a very old model, maybe the material layers are not conform with the current CCP standard. I remember I had problems with those \"Minmatar Heat Sink Solar Panels\" on a bunch of ships when I imported them to Blender. My shaders that worked on everything didn't work on those parts.  \nCould be a relic of the past. The question is, will CCP fix it, or will they fix it in the future when the Scythe/Scimitar models will get updated.  \nThere are a lot of ships without warp animations that will likely get updated in the next years and I bet the Scythe/Scimi is one of those.",
            "The Monkey's Paw.\n\n- CCP\\_Things(TM)",
            "Tbh it looks better the way it came out vs how you made it.",
            "Yeah, i'm submitting the bug report already, always have been doing it.   \n(want to say that those bugs got fixed, but they just was closing all tickets older than 2 years without fixing shit, so, u know)."
        ]
    },
    "3isk no low ball offers i know what i have (worst prop mod possible)": {
        "title": "3isk no low ball offers i know what i have (worst prop mod possible)",
        "score": 108,
        "url": "https://i.redd.it/qx23n8u5mf9d1.png",
        "content": "",
        "num_comments": 26,
        "comments": [
            "you should pay me for looking this shit",
            "Damn dude. If this thing bricked any harder it could probably used in a low slot as armor",
            "I heard that paying 5b is reasonable.",
            "This is worth multiple billions.\nSource: ive seen similar contracts in jita being sold for billions. Weirdly enough, they also seem to be accepted immediately. Hmmm i wonder why...",
            "Yeah, contract it Andres Talas for the 3 isk you asked for.",
            "If you turn it upside down, it's the best prop mod I've ever seen!",
            "Can you mutate civilian modules?",
            "2 million ISK, contracted to Sir Cuddles in Jita",
            "Looks perfect for yeeting into a gatecamp",
            "A fantastic piece of kit."
        ]
    },
    "Isogen site btw": {
        "title": "Isogen site btw",
        "score": 17,
        "url": "https://www.reddit.com/r/Eve/comments/1dr9s7u/isogen_site_btw/",
        "content": "https://janice.e-351.com/a/5qUXf9 full refined amount\nhttps://janice.e-351.com/a/t9wCCg total ore in site\n\nThis is based off of a Survey scan kindly provided to me with max refine skills, implant, and T2 Tatara\n\n/discuss",
        "num_comments": 19,
        "comments": [
            "Absolute garbage. I've heard 4h and I've heard 6h respawn timers. Given only a few systems will have these due to the power requirement of the upgrade, it's just going to be shit.",
            "Bigger question. What is the respawn timer? And was this a max refine? How long to clear the site from start to finish? Need some context.",
            "The respawn timer is 5-6 hours. Enjoy! Ccp fucking lied again, surprise",
            "So the mining escalations are gonne be 100mil m3 im sure or it!",
            "But issnt the good thing that u can \"choose\" what minerals you will be mining ? Or is the \"site\" a static fix amount of Minerals ?",
            "Current respawn time is 5 hourd",
            "13 Hulks with ore strip miners and porpoise links will do that in an hour",
            "You can chose yes but you can only have one belt per system and only ~40% of all systems will be able to install the upgrade, after all the other systems that are needed for other upgrades maybe 20% of all systems will have the new anomaly",
            "So they gave a medium asteroid anom a colossal respawn timer?",
            "So an hour's content for 1 multiboxer"
        ]
    }
}