{
    "Please join us at r/christophersaintbooth!": {
        "title": "Please join us at r/christophersaintbooth!",
        "score": 229,
        "url": "https://www.reddit.com/r/everyoneknowsthat/comments/1cqv2vb/please_join_us_at_rchristophersaintbooth/",
        "content": "Hi everyone,\n\nAll good things must come to an end. For the time being, r/everyoneknowsthat will remain active so you're free to still post here. However, since the search is practically over, we aim to one day archive this subreddit when we feel it has lost its purpose.\n\nWe have now opened the doors to r/christophersaintbooth and would like to welcome you all to join us there. Over there we can still talk about the history of the search, but it will be more focused on the Booth brothers and their music, and of course general music discussion, particularly the amazing music from the 1980s that have inspired them to create *Ulterior Motives*.\n\nSince Christopher became synonymous with *Ulterior Motives* after the song was found, the community is named after him, but of course we'll also celebrate co-creator of *Ulterior Motives* Philip Booth and his fantastic musicianship.\n\nThe new sub is brand new and still under construction. Like I mentioned before, it will be a slow transition, so you're still free to post here while we setup shop in the new subreddit. Any feedback or ideas are more than welcome to please send us a message if you have them.",
        "num_comments": 0,
        "comments": []
    },
    "Ulterior Motives Album Q&A Today at 4pm/est": {
        "title": "Ulterior Motives Album Q&A Today at 4pm/est",
        "score": 17,
        "url": "https://i.redd.it/ivn6fw8vsg9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Great news, Chris! I've stickied your announcement so that it's always at the top of the page.",
            "Huge! Looking forward to it Chris :)"
        ]
    },
    "It’s been 2 months since the discovery and so much has happened.": {
        "title": "It’s been 2 months since the discovery and so much has happened.",
        "score": 223,
        "url": "https://i.redd.it/6gvomqrfwd9d1.jpeg",
        "content": "We were able to contact the Booth brothers, create a new fanbase for them, AND get a remaster of Ulterior Motives + 12 other songs we didn’t know existed.\n\nThank you Booth brothers + everyone involved in the search!",
        "num_comments": 21,
        "comments": [
            "2 months? Already?!",
            "Wow. Time really does fly",
            "2 months already?!",
            "2 months and having the full album is a massive accomplishment!",
            "I can't believe it's ONLY been 2 months, so much has happened in that span of time.",
            "Thank you. Honestly, I'd really love to thank several people, including the producer of Angels of Passion, Carl92, and South Pole Ball. Because without them, we wouldn't have this masterpiece.",
            "Sorry if this is a silly question.  But I’ve read that the cd they have for sale of the album is not a remaster but a “re-record” and is not the original recordings.  Did anyone buy the cd and know if this is true or not?",
            "Is it on Spotify yet?\n\nReally need it alongside La Canción de Alicia",
            "Time has wings I swear",
            "I opened a bag of chips to celebrate"
        ]
    },
    "Everyone knows that it's just a game": {
        "title": "Everyone knows that it's just a game",
        "score": 46,
        "url": "https://i.redd.it/xs5u07s3kd9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Get out of my head "
        ]
    },
    "Everyone Knows It!": {
        "title": "Everyone Knows It!",
        "score": 104,
        "url": "https://i.redd.it/4ltp9le96c9d1.jpeg",
        "content": "A piece I did for the Ulterior Motives fan video thingy!\n\nWhen I first heard the original clip, I imagined some cool beachgoers listening to the song on a bigass boombox. And of course, I had to use that iconic hot pink color ✨️ ",
        "num_comments": 3,
        "comments": [
            "I love them both so much! Nice art!",
            "Thank you!",
            "You’re welcome!"
        ]
    }
}