{
    "[Meta] Rules and Guide to Posting (Summarised)!": {
        "title": "[Meta] Rules and Guide to Posting (Summarised)!",
        "score": 67,
        "url": "https://www.reddit.com/r/exmuslim/comments/1anp97w/meta_rules_and_guide_to_posting_summarised/",
        "content": "#**Welcome to r/ExMuslim**, Now over 160K subscribers!\n\n**[Introduction to the aims of the subbreddit](https://redd.it/jfenr8)**\n\n\n#**Summary of the \"Rules and Guide to Posting\"** \n\n\n[(Full Rules and Guidelines post](https://redd.it/1anoje0))\n\n\n**(This post is a TL;Dr of the main post above. However, please make sure to read the full guidelines before posting/commenting here. Onus is on those participating if there are any infractions**\n\n**Introduction:**\n\nReddit is a [Western/American-centric](https://redd.it/jfdjz7) forum. Everything posted here needs to be in that geographical context.\n\n**This subreddit is primarily a recovery and discussion platform** for those who were once followers of Islam i.e. ExMoose/ExMuslim. Everyone is welcome but if you are here because of your hate for Muslims as a people then this isn't the subreddit for you. \n\nBigots, those creating a toxic environment and/or those with nefarious agendas in the subreddit will be banned without hesitation.\n\n**Posting Guidelines:**\n\nWe ask people to follow them in the spirit in which they are written and not merely by the letter. \n \nPlease:\n\n**- [A] DO NOT post any LOW EFFORT/QUALITY images, memes, TikToks etc... other than Fridays.** \n\nWe call these Fun@Fundies allowed only on Fridays. \n\n**- [B] Remove ALL confidential/personal information from your posts**\n\nUnless it's a famous or public personality.\n\n**- [D] Content posted needs to be appropriate to the subreddit**.\n\nThis is not an anti-immigration subreddit nor is to point out \"look at this stupid shit that a Muslim did\".\n\nThe post title needs to inform readers about the content and reflects it appropriately. \n\n**- [E] Linking to or calling out other subreddits is not allowed**: \n\nThese sorts of actions can lead to things like brigading and this is against reddit guidelines. \n\nGot banned on another subreddit? This isn't the place to complain about that.\n\n**- [F] Posts regarding other ExMuslim social media/discord groups will be removed.**\n\nIf you want to post about your group here and you are the admin of the group **please contact the mods first.   \n\n**- [G] Posts about things like politics and immigration are very unwelcome here because of the toxicity involved.**\n\nThis is NOT a sub about (pro or) anti-immigration.\n \n**- [H] \"Self-hate\" posts will NOT be allowed.** \n\nPosts like \"I hate my dad because he forces me to pray\" are OK (please make a proper post) however posts/comments like \"As a Pakistani myself, I hate Pakistanis. They are so dumb and stupid\" [will not be allowed](https://redd.it/jfdjz7). \n\n**- [I] Posts deemed \"concern trolling\" are not allowed**. \n\nThese are posts that say things like \"Why is this subreddit full of racists?\" or \"why do ExMuslims support the far-right?\".\n\n**- [J] Message the Mods if you disagree or have concerns** with the rules, operations, bans, posts, users or anything else . \n\nDo not make posts on the subreddit trying to discuss these matters.\n\n**Note on Bans**\n\nMods endeavour to protect, cultivate and shape this as a valuable and open space for ExMuslims. All mod decisions are made with that in mind. \n\n\n**Thanks**\n\n**ONE_Deedat**",
        "num_comments": 1,
        "comments": [
            " If your post is a meme, image, TikTok etc... and it isn't Friday, most likely it violates the rule against low effort content. Please delete it or you'll get temp-banned. Such content is ONLY allowed on (Fun@fundies) FRIDAYS.\nPlease read the [Posting Guidelines](https://redd.it/ew8trb) for further information. If you are unsure about anything then feel free to message the mods.\nPlease participate on /r/exmuslim in a civil manner. Discuss the merits of ideas - don't attack people. Insults, hate speech, advocating physical harm can get you banned.\nIf you see posts/comments in violation of our rules, please be proactive and report them.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/exmuslim) if you have any questions or concerns.*"
        ]
    },
    "Exmuslim Guide to Living in the Closet and Coming Out.": {
        "title": "Exmuslim Guide to Living in the Closet and Coming Out.",
        "score": 127,
        "url": "https://www.reddit.com/r/exmuslim/comments/1d709nm/exmuslim_guide_to_living_in_the_closet_and_coming/",
        "content": "Hello. Upon request, I've been asked to turn a comment I made into a post so that it can be a resource for more people. This post is a collection of advice I've given out about how to handle your life as a closeted exmuslim and how you'll come out in the future. It is largely based on my experience but also from what I've seen from others in this subreddit. \r\n\r\n###Introduction\r\nSo you've left Islam. You've delved through arguments, the apologetics and the bullshit and you've come to the conclusion that you no longer believe in Islam. And you may have also reached an alternative philosophical outlook on life that you can believe in. \r\n\r\nBut what now? You may have left Islam, but have you left the Muslim world? One of the most common misconceptions outsiders have is that since exmuslims are no longer Muslims, they no longer live in the Muslim world. This is painfully naive - in reality many exmuslims are closeted due to young age and financial dependency and/or live in Islamist countries or societies that enforce Islamic values. In fear of social stigma or even violence, exmuslims have to contend with closeted lives even after leaving Islam. So how do you deal with it? \r\n\r\n###Goal\r\nThe best time to come out to family is in your own home, over a dinner you paid for, alongside people who support you. That takes a lot of preparation and it means doing what you can to live your life as best as you can whilst working towards independence. \r\n\r\nThis basically means that a lot of what helps you come out of the closet will depend heavily on how well you prepared for it, so you will need to make the most of your closeted life. You may not be able to stop the shitstorm but you can at least prepare yourself to weather it. Here are some tips to achieve that goal (in no particular order) \r\n\r\n###1) Don't meander in life due to a lack of decision making skills.\r\nProbably one of the worst mistakes I made was not realise I was an exmuslim sooner. As a result I had barely any time to prepare for when the inevitable happened and I was forced to come out. I spent a lot of my life meandering, trying to reconcile the irreconcilable, and trying to be a Muslim when I knew my values didn't align with it. I didn't really have much of a concept of exmuslims, but if I had been smarter I would have figured it out. I now tell people in a similar position that it's fine to take your time but don't take too long. Half arsing two very different cultures will leave you a loser in both. \r\n\r\nSimilarly whilst planning for independence can be scary, don’t let it frighten you into inaction. The following is a passage from [this article](https://psyche.co/guides/how-to-make-a-tough-decision-break-it-down-and-listen-to-your-gut) about decision making:\r\n>Research from the 1990s led by the US psychologist Thomas Gilovich provides further evidence for why it can be shortsighted to kick a difficult decision down the road. Gilovich and his team showed that although, in the short term, people experience more regret from ‘errors of commission’ (taking an action that leads to a disappointing outcome), in the long term it is actually ‘errors of omission’ that lead to more regret – that is, disappointing outcomes that arise from not taking an action.\r\n\r\nWhen taking the time to make decisions and plans, don’t underestimate how effective it can be to map out your options on an excel spreadsheet.  When I had to decide whether I should come out or not, I actually made a spreadsheet listing out my options, what they would result in and what the impact would be. Actually having it written down to look at really put things into perspective. We waste a lot of our time keeping it in our heads, which forces us to recalculate everything from scratch every time we revisit our thoughts. But the more that is mapped out, the less you have to recalculate and the more you can focus on evaluation and further planning. \r\n\r\n###2) Study, career and finances.\r\nYour studies/career is almost always your best ticket out of your toxic situation, and the one thing to prioritise the most. If you’re young, do whatever you can to ensure that you can get into further education away from home. Even if it means spending all your time at a local library. If you suspect that your parents would be against you going to a university away from home, aim for a placement at the most prestigious university you can aim for so your parents would look worse for rejecting it. The quickest and most effective way in achieving long term independence is through good studies/career. \r\n\r\n###3) Do not telegraph irreligiosity whilst being closeted.\r\nThis is particularly important for younger exmuslims because they telegraph to their parents in ways they would just not understand until they see it for themselves when they're older. Try your best to meet the religious obligations expected from your family. The more you slip, the more they will monitor you and the more difficult it will be to do the things you need to do discreetly when the time comes. \r\n\r\nUnfortunately for girls, this usually means that wearing the hijab is a necessity and it’s inadvisable to try and get out of. (However, that subject matter is not my forte: prioritise advice from exmuslim women such as from faithlesshijabi.org) \r\n\r\n###4) Sometimes you may need to go above and beyond. \r\nIf you get the impression that your family is beginning to catch onto your apostasy then it's likely that they have and you may need to reverse that impression. \r\n\r\nOne way to do that would be to start getting books on Islam and not just for show. My advice would be to get books on Islamic history because that's the least boring stuff. Or better yet, just get whatever unapologetic salafi hate crime you can get your hands on so you can entertain yourself with how fucked up it is. Or get an annotated Qur'an like the Study Qur'an. Do something to ease their suspicions. \r\n\r\nWhat book you get depends on what kind of message you want to telegraph to your parents. If you want to telegraph a message then it will need to be a paper book and not an e-book. Something that you can lay around in your room and that you know they'll see. That means you're restricted to what you can get from your local library or Masjid. Also depends on what interests you because you'll have to actually read and demonstrate you learnt from it if you want send the best message you can. If you want purely what Muslims write about Islamic history, you can check out works like The Sealed Nectar or works by [al-Sallabi](https://en.wikipedia.org/wiki/Ali_al-Sallabi). If you want something a little more academic, but not something that would rouse suspicion then check out university press works like [this](https://academic.oup.com/book/831), [this](https://global.oup.com/academic/product/the-oxford-handbook-of-islamic-theology-9780199696703?cc=gb&lang=en&), [this](https://global.oup.com/academic/product/the-oxford-handbook-of-islamic-philosophy-9780199917389?cc=gb&lang=en&) or [this](https://global.oup.com/academic/product/the-oxford-handbook-of-quranic-studies-9780199698646?cc=gb&lang=en&). If you want something a bit more relevant to contemporary Muslim world then there books like [this](https://press.princeton.edu/books/hardcover/9780691186610/sunnis-and-shia). \r\n\r\nBut you may find that your best bet is to just see what your local Masjid might have and see what tickles your fancy. \r\n\r\n###5) Actually coming out is usually a shitstorm. \r\nBe prepared for lots of sobbing, guilt tripping and an inability to respect your beliefs and boundaries. Learn techniques like the Broken Record Technique to establish boundaries. Know what you have to say when they inevitably tell you to speak to a scholar - you don't have to eat the whole apple to know it's rotten. You know all that you need to know about Islam and you know even more about the world outside of Islam to put it into context. \r\n\r\nSteel yourself with months and months of your family sending you bad dawagandist videos through WhatsApp trying to bring you back. You may have to spend months beating their attempts and going to toe to toe with them without mercy before they’re finally willing to relent and get off your back. Even then don’t expect them to relent entirely. There will always be some micro aggressions that they will resort to, like playing religious videos loudly in your vicinity. The most you can do in those circumstances is reduce contact with them as much as possible. At this point you would hopefully already be independent from them. \r\n\r\n###6) Do not feel guilt. \r\nAs an exmuslim, you will go through a lot of guilt. Whilst this does show you are human, you need to forget about guilt: you are not responsible for your parents' failure to be reasonable, not even your mother. They take responsibility for the social stigma and oppressive life they choose to live in and perpetuate. You get *nothing* out of that guilt. It's completely pointless and ultimately counterproductive. You can't set yourself on fire to make others warm and you gain no recognition from martyrizing yourself. Do not feel guilt for what you have to do to have a completely reasonable life. The only ones to blame are those who forced you into it. \r\n\r\nDon't underestimate parents either. They will use guilt against you. Give them an inch and they will take a mile. They very often bring up their health problems as a weapon against you. Don't fall for it. It only affects them because they choose to let it affect them. They can choose to be reasonable. You have to respect their autonomy and let them deal with the consequences of their own ways. \r\n\r\n###7) Don't come out too soon thinking it's a release. \r\nI come across a lot of exmuslim kids who think coming out will help explain to their religious parents why they don't want to wear the hijab or do other religious things. But the likelihood is more that those same parents will react extremely poorly and restrict your freedom even more, making it more difficult to achieve long term independence. \r\n\r\nThere's also the mistake in assuming that coming out will lead to being disowned in the vain hope that you get an quick clean break that takes all the responsibility from you. For some exmuslims this does actually work out, but for a lot of others it's miscalculated. My family didn't disown me, I still had to deal with months of my family being insufferable manipulators and the responsibility was still on me to separate from them. And for women it can be much worse. \r\n\r\nUltimately, if you are financially dependent on your family then coming out early will very typically result in your family using that leverage against you and making your life worse. I've seen stories of exmuslims who thought their family was better and badly miscalculated - be mindful of that. \r\n\r\n###8) Don’t panic too much if they find out. \r\nSome exmuslims get found out, sometimes because of a snitch in the family or sometimes because they just weren’t convincing enough. Don’t panic – Muslims can be pretty damn deluded about their faith and your family will want to believe that you can come back very easily because according to them Islam is just common sense and most disbelievers are just silly and ignorant. Try to do your best to convince them as per Point 4. If it’s because you did something haram, blasphemous or otherwise worthy of takfir, try to act like it was because you were a misguided Quranist or progressive Muslim. They will still retain suspicion but it’s still better than the alternative. \r\n\r\nHowever, if you’re at the point of no return and you know you can’t convince them then now is the time to make calls to any secular friends you have, ask for support and maybe even shelter. \r\n\r\nAlso for Western exmuslims, make sure to act quickly if you suspect that your parents want to send you abroad and trap you in your country of ethnic origin. Sadly some parents will go to these lengths. Do not go, no matter the cost. Find organisations willing to advise, such as those listed in Point 10. Hide your passport if you have to. Note down the contact details of your embassy in that country just in case.\r\n\r\n###9) Go no contact if you fear abuse.\r\nActually think about whether it's even wise for you to come out in any circumstance. Do you suspect that there could be violence or abuse? If so then you have absolutely no need to go through this stupid bullshit. Leave and don't look back. If your parents couldn't give you safe environment to even come out about different beliefs then they are not worth the time. As per Point 6 - You have to respect their autonomy and let them deal with the consequences of their own ways. This is particularly pertinent for those who live in a predominantly Muslim countries. They have a very real reason to fear persecution and absolutely do not need to risk their own lives for the sake of their parents. \r\n\r\n###10) Make use of organisations and resources. \r\nLook into secular organisations like recoveringfromreligion.org, faithlesshijabi.org and faithtofaithless.com. Look into women's charities in your area like womensaid.org.uk or karmanirvana.org.uk (UK examples). Look into LGBT charities like rainbowrailroad.org. If you have secular school counsellors and friends then talk to them. Get advice from adults you can absolutely trust.\r\n\r\nNote: On the flip side don't take risks with people you can’t be sure of. You may be tempted to come out to your Muslim friend, but I've seen plenty of stories of exmuslims who heavily regret doing so. \r\n\r\nThere are also informal exmuslim groups on other social media platforms such as Facebook or Discord, but be careful about how much information you share and especially be wary of private messaging. \r\n\r\n###11) You may have to leave the country.\r\nThis is particularly the case for exmuslims living in predominantly Muslim countries. Unfortunately, I don't have any real world experience to offer here but you may be able to find localised advice by digging around. For example sites like wearesaudis.net might have some information (but you'll need a VPN to access this one. If you don't know what a VPN is [here's an explanation](https://youtu.be/DhYeqgufYss)). \r\n\r\nAre you multilingual? If you need money but working is restricted to you then you can try becoming an online language tutor on sites like italki.com (scroll to the bottom). [This post](https://www.reddit.com/r/WorkOnline/comments/82fnn8/where_can_i_teach_a_language_online_for_extra/) and related subreddits like [r/WorkOnline](https://www.reddit.com/r/WorkOnline) may help. \r\n\r\nNote: some exmuslims in Muslim countries fall for the doomscrolling hyperbole and think Europe is “doomed” with too many Muslims. They have a tendency of asking which country is best to migrate to as an exmuslim to avoid Islam. Please ignore the doomsayers and prioritise the country you choose based on ease of access and career opportunities. As long as it is a secular country, you can worry about avoiding Islam later. \r\n\r\n###Final stuff \r\nShout out to Imtiaz Shams who inspired me to make this list of tips. He has his own YouTube Channel [here](https://youtube.com/@imtiazshams) and plans to make his own video on this subject matter so watch out for that. On a side note, I also recommend [TheraminTrees YouTube Channel](https://youtube.com/@theramintrees) who delves a lot into toxic dysfunctional families from the perspective of a therapist and a former Jehovah’s Witness. A lot of his content helps in dealing with the emotional impact of leaving religion and dealing with a  religious family. And finally, thank you to the moderators of r/exmuslim who suggested I make this into a post. I wound\r\nup adding a lot more content lol. \r\n\r\nI will end this post with a list of subreddits that may help you on your journey leaving Islam: \r\n\r\n###Ex related subreddits \r\n* [r/exhijabis](https://www.reddit.com/r/exhijabis)\r\n* [r/ExEgypt](https://www.reddit.com/r/ExEgypt)\r\n* [r/ExSaudi](https://www.reddit.com/r/ExSaudi)\r\n* [r/AteistTurk](https://www.reddit.com/r/AteistTurk)\r\n* [r/PakiExMuslims](https://www.reddit.com/r/PakiExMuslims)\r\n* [r/ExAlgeria](https://www.reddit.com/r/ExAlgeria)\r\n* [r/ExJordan](https://www.reddit.com/r/ExJordan)\r\n* [r/MalaysianExMuslim](https://www.reddit.com/r/MalaysianExMuslim)\r\n* [r/XSomalian](https://www.reddit.com/r/XSomalian)\r\n* [r/Atheism_Bangladesh](https://www.reddit.com/r/Atheism_Bangladesh)\r\n* [r/ExSudan](https://www.reddit.com/r/ExSudan)\r\n* [r/Xiraqis](https://www.reddit.com/r/Xiraqis)\r\n* [r/ExBahrain](https://www.reddit.com/r/ExBahrain)\r\n* [r/ExLibya](https://www.reddit.com/r/ExLibya)\r\n* [r/IranianExMuslims](https://www.reddit.com/r/IranianExMuslims)\r\n* [r/chechenatheists](https://www.reddit.com/r/chechenatheists)\r\n* [r/IndonesianExMuslim](https://www.reddit.com/r/IndonesianExMuslim)\r\n* [r/ExMuslimsKuwait](https://www.reddit.com/r/ExMuslimsKuwait)\r\n* [r/exPalestine](https://www.reddit.com/r/exPalestine)\r\n* [r/ExSyria](https://www.reddit.com/r/ExSyria)\r\n* [r/exmusulmanfrance](https://www.reddit.com/r/exmusulmanfrance) \r\n\r\n###Other Useful Subreddits \r\n* [r/WorkOnline](https://www.reddit.com/r/WorkOnline)\r\n* [r/Iwantout](https://www.reddit.com/r/Iwantout)\r\n* [r/studyabroad](https://www.reddit.com/r/studyabroad) \r\n* [r/visas](https://www.reddit.com/r/visas)\r\n* [r/UKvisas](https://www.reddit.com/r/UKvisas) \r\n* [r/medicalschool](https://www.reddit.com/r/medicalschool)\r\n* [r/medicalschoolEU](https://www.reddit.com/r/medicalschoolEU)\r\n* [r/medicalschoolUK](https://www.reddit.com/r/medicalschoolUK)\r\n* [r/cscareerquestions](https://www.reddit.com/r/cscareerquestions)\r\n* [r/cscareerquestionsEU](https://www.reddit.com/r/cscareerquestionsEU)\r\n* [r/cscareerquestionsUK](https://www.reddit.com/r/cscareerquestionsUK)\r\n* [r/Ukpersonalfinance](https://www.reddit.com/r/Ukpersonalfinance)\r\n* [r/eupersonalfinance](https://www.reddit.com/r/eupersonalfinance)\r\n* [r/personalfinance](https://www.reddit.com/r/personalfinance)\r\n* [r/Ausfinance](https://www.reddit.com/r/Ausfinance)\r\n* [r/PersonalFinanceCanada](https://www.reddit.com/r/PersonalFinanceCanada)\r\n* [r/Legaladvice](https://www.reddit.com/r/Legaladvice) \r\n* [r/LegalAdviceUK](https://www.reddit.com/r/LegalAdviceUK)\r\n* [r/LegalAdviceEurope](https://www.reddit.com/r/LegalAdviceEurope)\r\n* [r/AusLegal](https://www.reddit.com/r/AusLegal)\r\n",
        "num_comments": 20,
        "comments": [
            " If your post is a meme, image, TikTok etc... and it isn't Friday, it violates the rule against low effort content. Such content is ONLY allowed on (Fun@fundies) FRIDAYS.\nPlease read the [Rules and Posting Guidelines](https://redd.it/1anoje0) for further information. If you are unsure about anything then feel free to message the mods.\nPlease participate on /r/exmuslim in a civil manner. Discuss the merits of ideas - don't attack people. Insults, hate speech, advocating physical harm can get you banned.\nIf you see posts/comments in violation of our rules, please be proactive and report them.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/exmuslim) if you have any questions or concerns.*",
            "This should be stickied.",
            "I wish I had this when I finally decided to leave the religion and lived closeted and when they found out;-; \n\nI am finally in a better place as for 3 years I had been isolated from my family while living with them (I wasn't financially in a good place back then) as well as bullied by my older sister constantly \n\nNow I have moved out and I am at peace",
            "Thank you so much, this was genuinely very helpful and I noted down some of your advice as it is especially relevant to my situation. I'm so glad this community exists 🩷🩷🩷",
            "This is an excellent guide 👏 gold! \n\nWill help a lot of people hopefully ☺️",
            "Thank you. This was very helpful. \n\"To them Islam is just common sense\". Ugh how often I used to hear that. Common sense for the blind and manipulated lol. Worst religion there is tbh. I can't wait to get out and ensure my children grow up as agnostic or atheist. At least they don't do the shit that our community does. No faith in Islam. Such a violent, misogynistic religion.",
            "Great post! This should absolutely be shown to more people!",
            "Great job!",
            "Dear OP, \n\nMay I host it on [https://atheism-vs-islam.com/](https://atheism-vs-islam.com/) (giving credit to you)?",
            "This is amazing post 😭 Thank you 🙏🏻"
        ]
    },
    "Turkish medicine students ignored Islamist faculty member's homophobic censorship attempt during the Hippocratic Oath": {
        "title": "Turkish medicine students ignored Islamist faculty member's homophobic censorship attempt during the Hippocratic Oath",
        "score": 761,
        "url": "https://v.redd.it/rqk3tvwjqc9d1",
        "content": "",
        "num_comments": 70,
        "comments": [
            " If your post is a meme, image, TikTok etc... and it isn't Friday, it violates the rule against low effort content. Such content is ONLY allowed on (Fun@fundies) FRIDAYS.\nPlease read the [Rules and Posting Guidelines](https://redd.it/1anoje0) for further information. If you are unsure about anything then feel free to message the mods.\nPlease participate on /r/exmuslim in a civil manner. Discuss the merits of ideas - don't attack people. Insults, hate speech, advocating physical harm can get you banned.\nIf you see posts/comments in violation of our rules, please be proactive and report them.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/exmuslim) if you have any questions or concerns.*",
            "Moments of tension during university graduation from Ordu University were caught on camera. The \"patient's sexual orientation\" line in the (Turkish version of) Hippocratic Oath, which students who have just graduated from the Faculty of Medicine read before starting their careers, has been censored.\n\nVice-dean Tuba Gül read the oath. The oath officially states, “Between my duty and my patient, I will not allow age, disease or disability, belief, ethnicity, gender, sexual orientation, nationality, political ideology, race, social position or any other characteristic to cause discrimination.\"\n\nThe students did not allow censorship and said the part removed from the oath in unison by memory. While Vice-dean Gül took a short pause, parents supported the students with applause. On the other hand, after these events, Gül canceled the graduation ceremony cocktail after the students' protests and removed the cakes, water and soft drinks from the area prepared for the cocktail.\n\nStudents and parents who wanted to take photos inside Ordu University Faculty of Medicine were not allowed and the students and parents were removed from the hall accompanied by private security forces. While many parents reacted to their students being removed from the hall, graduation photos had to be taken in the faculty garden.\n\nMaking a statement about this censorship on its social media account today, the Turkish Medical Association (TTB), which is the institution that officializes the text for the oath, said:\n\n\"We are proud of our young colleagues who recited the Oath of Medicine in its original form at the graduation ceremony of Ordu University Faculty of Medicine. As TTB emphasized in the letter we sent to the deans of medical faculties and chambers of medicine on May 22, 2024; 'The Geneva Declaration of the World Medical Association is common and binding for all physicians. In the physician-patient relationship, no definition other than being human can be a reason for privilege or discrimination for the patient. For this reason, it is an ethical violation and a crime to force candidate physicians to read the Physician's Oath, which every physician reads when starting their profession, which states that physicians can only approach their patients as human beings.'\"",
            "Wow, take away their drinks and cake and them kick them outside, that’ll show ‘em.\n\nWhat an absolute twat",
            "Truly incredible, you love to see it :,)",
            "This is so beautiful. Also very concerning the dean wanted to censor it from the *hippocratic oath*. I know a lot of religious people who don’t like lgbt+, but understand their right to exist and live how they want. This is like the bare ass minimum to say that as a healthcare provider you won’t actively discriminate against someone and potentially kill them for being gay.",
            "This is why I love turkey.",
            "Seeing things like this give me motivation when continuing on the premed track.",
            "This is one pf those rare moments i get excited and hopeful about my country.",
            "But why are they teaching greek medicine doctrine and not islamic? Why did allah gave the ancient greeks so much knowledge thousand years before arabs even were mentioned? Just why?😀",
            "If she can read and comprehend what she read, she will understand there is no need to censor but we don't have people with this much capacity in administration seats. It's only stating that I will look after all humans no matter what. It's not even a controversial statement."
        ]
    },
    "The woman's body was blurred to prevent men from feeling aroused or horny, it's so weird, stupid and creepy 💀": {
        "title": "The woman's body was blurred to prevent men from feeling aroused or horny, it's so weird, stupid and creepy 💀",
        "score": 266,
        "url": "https://v.redd.it/n77rnaayjd9d1",
        "content": "",
        "num_comments": 40,
        "comments": [
            " If your post is a meme, image, TikTok etc... and it isn't Friday, it violates the rule against low effort content. Such content is ONLY allowed on (Fun@fundies) FRIDAYS.\nPlease read the [Rules and Posting Guidelines](https://redd.it/1anoje0) for further information. If you are unsure about anything then feel free to message the mods.\nPlease participate on /r/exmuslim in a civil manner. Discuss the merits of ideas - don't attack people. Insults, hate speech, advocating physical harm can get you banned.\nIf you see posts/comments in violation of our rules, please be proactive and report them.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/exmuslim) if you have any questions or concerns.*",
            "She’s def ex Muslim",
            "They make her look WORST when they blur her body like that.. It makes her look like she's actually not wearing clothes when in reality, she would look MORE clothed if they just didn't blur it at all... Like, the way they blurred her body made her look more naked because you couldn't even see her clothes, but you could still see some of her skin like her arms & shoulders...\n\nThey only made her look entirely naked, it's so unsettling. If someone recorded me & blurred my body, I would feel SO many emotions such as awkwardness, disturbed, disgusted, demeaned, and inhuman etc.",
            "I debated this guy at speakers corner too, and my god, said I didn’t want to be recorded and was constantly harassed by guys with iPhones filming me. After, to be honest, battering him, he shook my boyfriends hand who had said very little. Do you think he should my hand, after speaking with me for 20 minutes? Hell nah",
            "It feels so insulting when they blur everything on a woman.\n\n\nFunny how in their eyes its respect ew",
            "The way she rolls her eyes and her body moves when she says she is a Muslim just makes it more obvious she doesn’t actually believe in anything or just doesn’t want to.",
            "She just saved her own life",
            "How disgusting. Why isn't he censored? I really don't wanna see his face.",
            "She obviously doesn't believe in islam no more, her body language says it all",
            "It's not his fault that he has a squeeky voice while being a giant, but his hysteria while \"debating\" is funny"
        ]
    },
    "what's something that made you like this the first time you discovered it in islam": {
        "title": "what's something that made you like this the first time you discovered it in islam",
        "score": 220,
        "url": "https://i.redd.it/viy765iyjd9d1.png",
        "content": "",
        "num_comments": 134,
        "comments": [
            " If your post is a meme, image, TikTok etc... and it isn't Friday, it violates the rule against low effort content. Such content is ONLY allowed on (Fun@fundies) FRIDAYS.\nPlease read the [Rules and Posting Guidelines](https://redd.it/1anoje0) for further information. If you are unsure about anything then feel free to message the mods.\nPlease participate on /r/exmuslim in a civil manner. Discuss the merits of ideas - don't attack people. Insults, hate speech, advocating physical harm can get you banned.\nIf you see posts/comments in violation of our rules, please be proactive and report them.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/exmuslim) if you have any questions or concerns.*",
            "Sex slavery ملك اليمين\n\nThis shit fucked me up. I couldn't fucking believe it",
            "Apostates must be executed hadith. That's when I realised the gangster nature of this religion.",
            "Muhammad marrying and having sex with a 9 year old 💀💀",
            "Muslim husbands being allowed and encouraged to hit their wife and kids to \"discipline\" them. Fuck that barbaric shit.",
            "Hoor al ayn 💀💀\n\nAs a little muslim girl I was daydreaming about flying in clouds and eating chocolate from rivers",
            "I mean where do I start? Should we talk about how Islam calls on violence against non-believers and apostates? How it calls on domestic abuse against women and children? Its absurd beliefs and practices and the ignorance of Muslims? The great prophet Momo who slept with a 9 year old and annihilated many lives including an entire tribe for not believing in him?\n\nAll of these are more than solid points but I have additional personal reasons for leaving Islam. My country of Syria fell victim to the hands of the 7th century Muslim Arab colonization, our entire identity as Levantine Aramaic Christians was wiped out along with our original language. Islam is the bane of all languages and cultures.",
            "Not sure how many Muslims interpret it this way but I've seen this repeatedly more than once by \"Islamic freedom fighters\"\n\nKilling civilians in conflict can be acceptable since they pay taxes that will inevitably finance the armed forces as well. Therefore they are as guilty as the government and the army.",
            "Sperm comes from the backbone and rib",
            "Multiple marriages at the same time, slavery, blatant gender discrimination, child marriages (age of marriage in general) and the list goes onnnnn...."
        ]
    }
}