{
    "New flairs added": {
        "title": "New flairs added",
        "score": 165,
        "url": "https://www.reddit.com/r/ExpectationVsReality/comments/1dgnipo/new_flairs_added/",
        "content": "Hello all!  We have added 3 new flairs, for Failed Expectations, Surprisingly Met Expectations, and Exceeded Expectations.\n\nThere have been some users confused in the past, because they didn’t realize that you are allowed to post expectations/realities that were not failures.  Additionally, it can be hard to tell in some posts if the OP was happy with their result or unhappy with it. Now you can select a flare if you would like to denote which category your expectation versus reality falls into.\n\nThanks to u/xitg1 who came up with this suggestion.",
        "num_comments": 6,
        "comments": [
            "[deleted]",
            "Thank you, this decision exceeds expectations!",
            "Great idea! Thank you!!",
            "These are great. “An attempt was made…” would also be fun",
            "Sounds like my review at work....exceeds expectations:)",
            "THANK YOU!! \nExpectation vs Reality isn’t always a disappointment!! Excited to see people utilize it."
        ]
    },
    "My son’s birthday cake": {
        "title": "My son’s birthday cake",
        "score": 1328,
        "url": "https://www.reddit.com/gallery/1dqzage",
        "content": "It looks like someone defecated on CM’s face. ",
        "num_comments": 79,
        "comments": [
            "It's not the Dookie Monster.",
            "Could be worse? I mean, ignoring the shit eating and all lol",
            "This is beyond me. The cookie monster himself looks pretty good but the damn \"cookies\" are insanely bad. Could have used a real cookie and saved time and face lol",
            "We are looking at the cakes from different angles, and I'm bothered by that more than them not using real cookies.  The first image, the mouth is on side of cake, with googly eyes on top... perception is bad",
            "“C” is for “coprophagy” which is good enough for me",
            "And it isn't sideways like the photo? Why they didn't use real cookies is baffling. r/poopfromabutt",
            "Yikes! I had a customer send me this exact photo for a smash cake this is what I made. Far from perfect, but better than what you posted lmao\n\nhttps://preview.redd.it/4j12ouvwmf9d1.jpeg?width=2046&format=pjpg&auto=webp&s=7ca516bb88ab0910095bc697403891677e9b0035",
            "Ya, that’s where I’d keep the knife too",
            "Someone took a BM on CM",
            "My mom made one of those for my sister back in the early 80s. She used Soo much blue food coloring us kids pissed and shat blue for days."
        ]
    },
    "This candy that my girlfriend got ": {
        "title": "This candy that my girlfriend got ",
        "score": 317,
        "url": "https://i.redd.it/si9ct3k9he9d1.jpeg",
        "content": "",
        "num_comments": 20,
        "comments": [
            "Yup. Paleta Payasos are the same, except they’re round!",
            "I used to get those all the time as a kid whenever I visited Mexico. Loved them. They were round back then though.",
            "What’s it taste like",
            "👁  👄 👁",
            "![gif](giphy|3ornjKVbXqbiNO59oQ)",
            "I knew it rhymed with a female body part, but I was thinking Dolores\n\n![gif](giphy|3o7TKo6uiyLXcb4fqE)",
            "Paleta payaso is getting discontinued 😭",
            "Looks super tasty",
            "they tried",
            "Id say she got an upgrade"
        ]
    },
    "Making cake pops with my son": {
        "title": "Making cake pops with my son",
        "score": 47,
        "url": "https://i.redd.it/p3l8jgwm2g9d1.jpeg",
        "content": "I am not a smart man.  ",
        "num_comments": 2,
        "comments": [
            "Ahaha, nailed it! I bet you two had so much fun tho, and thats the important part! Good parent!",
            "“My food is problematic” https://youtu.be/oV7CVKiUJ84"
        ]
    },
    "Dunkin Muffin": {
        "title": "Dunkin Muffin",
        "score": 249,
        "url": "https://www.reddit.com/gallery/1dqgjs7",
        "content": "",
        "num_comments": 20,
        "comments": [
            "I bet the muffin top was still delicious. Even in pancake form.",
            "Not much of a muffin top. Elaine would be very upset.",
            "It's flat fuck Friday",
            "Did it get squished or was it not made properly? Either way I'd eat tf outta that",
            "You sure it's not a mushroom?",
            " Did you get it from a Dunkin in Colorado? I drove cross country and when I stopped in Colorado all the muffins were like this because of the altitude I imagine.",
            "It just looks so sad…",
            "Who sat on this muffin?",
            "Dunkin Muffins would make them flat though",
            "Flat but tasty"
        ]
    }
}