{
    "Saw this sign in the thrift store. What does it mean? Why would you put it in your house?": {
        "title": "Saw this sign in the thrift store. What does it mean? Why would you put it in your house?",
        "score": 3973,
        "url": "https://i.redd.it/8fndl2pj7d9d1.jpeg",
        "content": "",
        "num_comments": 181,
        "comments": [
            ". Best I can do, its so thin its not even there, i.e. its away sending you postcards because youre not in the same place.",
            "It should say  I finally got in touch with my inner self.  Thanks single-ply!",
            "maybe so skimpy and it sent a cheap 10 cent postcard instead of making an expensive long-distance phone call?",
            "I think it means the toilet paper was so non-existent that it wasn't just \"not there\", but it was out traveling around far from home and sent back postcards.",
            "My aunt and uncle have a fun one in their bathroom. It was meant to be in your kitchen and says Life is short, lick the bowl. Its on the back of their toilet",
            "Maybe it's trying to say that the toilet paper \"sent a postcard\" because the toilet paper tore upon use, and the person using it \"brought something back\". I've heard people say that they'll bring a postcard back from their trip so they can share something when they come back. Might be a stretch, but that's my guess.",
            "I don't know what it means, but whoever signed off on this typographical abortion deserves the chair.",
            "Reading all these comments makes me feel so old. Is this not a very obvious reference to Flat Stanley? \n\nETA: as I recall, this was a story about a boy that was flat like paper. In elementary school we did a project (?) where we sent a paper cutout of flat Stanley and tried to solicit postcards in return (from Stanley, wherever he was exploring). Or something to that effect.",
            "It bothers me somebody used the materials to make this and then cursed this thing to an endless cycle of nicknackery in different thrift stores until it winds up in a landfill one day",
            "Postcards are cheap.  The TP is so cheap it sent a postcard."
        ]
    },
    "I’m lost.": {
        "title": "I’m lost.",
        "score": 2043,
        "url": "https://i.redd.it/bcr8rxqcmd9d1.jpeg",
        "content": "",
        "num_comments": 46,
        "comments": [
            "They were scrapped and turned into a still for making moonshine.",
            "They make good moonshine equipment",
            "More young actors whos lives were ruined by drugs and alcohol  so sad",
            "Scrapping them to make stils",
            "A week later they're still in Kentucky.",
            "As someone from KY, I totally agree that this is true and would happen faster than a cow tail swatting a gnat.",
            "They stood still too long.",
            "I thought it was a sleeping with your cousin joke",
            "As a Kentuckian 100% agree I had a couple ask me at 8am yall serving alcohol yet",
            "I hate all of you"
        ]
    },
    "How did he bleach his shirt? ": {
        "title": "How did he bleach his shirt? ",
        "score": 562,
        "url": "https://i.redd.it/x460uoqxhf9d1.jpeg",
        "content": "",
        "num_comments": 23,
        "comments": [
            "That is Ichigo and (I assume) Rukia from Bleach the anime.",
            "there is a manga/anime called Bleach",
            "He bleached it by drawing on the main character from an anime called Bleach.",
            "As a 33yo dad who watched Bleach growing up this is just so good.",
            "The shirt is not accurate there is no pause in bankai. Has to look like this\"BAN...KAI!\"",
            "Bleach is an anime and manga. What he meant by \"bleach my shirt\" is to draw some Bleach on the shirt.",
            "Literally the first result when you Google Bankai is the Bleach Wiki. Come on man.",
            "I thought for sure the joke was going to be that she used her vagina",
            "Reference to an anime called bleach",
            "She thought bleaching a shirt meant \"draw character from Bleach on the shirt\".\n\nBleach is a popular manga where the heroe hunt with his famous big sword some sort of evil spirits hiding in the world."
        ]
    },
    "Explain this 🤔🤔": {
        "title": "Explain this 🤔🤔",
        "score": 149,
        "url": "https://v.redd.it/zhl8jntxnh9d1",
        "content": "",
        "num_comments": 14,
        "comments": [
            "In the odyssey, Circe only returns Odysseus men after he bangs her at Hermes instructions.",
            "As a straight woman, I can't stop watching this... She's so good at it ",
            "That booty don't need explainin'",
            "Whats she gonna do when age steps in?",
            "As a straight male, I don't really understand what people find attractive about this.",
            "You dont understand that some people are attracted to butts? Thats too hard for you to wrap your brain around? LOL OK",
            "Agreed. Who is this harlot so I can make sure to never see their content again",
            "Not only, she actually transform his crewmates in \"pigs\".",
            "I finally understand fireflies.",
            "Ugh. Thats just vile."
        ]
    },
    "What is the meaning? ": {
        "title": "What is the meaning? ",
        "score": 8030,
        "url": "https://i.redd.it/4k2rkp6hrb9d1.jpeg",
        "content": "",
        "num_comments": 295,
        "comments": [
            "You know whats funny is as a person who uses Aveeno for actual skin care purposes, I suspect it would be awful as lube. Its not slippery enough and dries very quickly.",
            "its about a post (on 4chan iirc) where a guy came in a jar with an mlp character in it",
            "Oh, my sweet summer child- keep that innocence for as long as you can.",
            "they put the figure in the jar and use the lotion to fill the jar up with water",
            "I didnt know you only had to pay 45.99$ to go directly to hell. The moment you die, your soul will go directly down.",
            "reference to an infamous 4chan post where OP ejaculated into a jar with a figurine of rainbow dash inside",
            "This sub is a karma farm",
            "You do not want to understand the joke. I rarely think people are better off not knowing something, but this is one of those rare times",
            "I hate that I know what this means.",
            "**you dont want to know**"
        ]
    }
}