{
    "Black Lives Matter.": {
        "title": "Black Lives Matter.",
        "score": 34051,
        "url": "https://www.reddit.com/r/Eyebleach/comments/ii2lij/black_lives_matter/",
        "content": "We, the r/Eyebleach community stand in full support of our Black members and with all Black people in America in their fight for the rights that all Americans rightly deserve. Not all racism is hate, the deeply-rooted effects of systemic racism are even more insidious and far-reaching in American society and immediate, drastic change is imperative. \n\nSadly, this is most publicly, and devastatingly apparent through the atrocities continually committed against Black Americans by the police. This is not a new problem but, due to the prevalence of video-enabled handheld devices, these atrocities are increasingly being brought to light in ways which make them impossible for society to ignore, most recently with George Floyd and Jacob Blake. Police in America have long been empowered by public funding to enforce the law but they have never been empowered to determine guilt, nor to sentence anyone to abuse nor death. We stand for change.\n\nHere are some ways that you can take action now:\n\n[Use resistbot](https://resist.bot/news/2020/06/02/black-lives-matter) to contact your government officials to demand policing reform.\n\nYou can donate directly to fuel the Black Lives Matter campaign [via ActBlue](https://secure.actblue.com/donate/ms_blm_homepage_2019) \n\nVisit [BlackLivesMatter.com](https://blacklivesmatter.com/) to find out how you can get involved.\n\nOther ways to donate:\n\n[NAACP](https://www.naacp.org/) is a civil rights organization, founded in 1909, which is committed to political, educational, social and economic equality.\n\n[National Bail Fund Network](https://www.communityjusticeexchange.org/nbfn-directory) \n\n[Know Your Rights Camp](https://www.knowyourrightscamp.com/), started by Colin Kaepernick, has a mission to “to advance the liberation and well-being of Black and Brown communities through education, self-empowerment, mass-mobilization and the creation of new systems that elevate the next generation of change leaders.”\n\n[The Equal Justice Initiative](https://eji.org/) The Equal Justice Initiative is committed to ending mass incarceration and excessive punishment in the United States, to challenging racial and economic injustice, and to protecting basic human rights for the most vulnerable people in American society.\n\n[The ACLU](https://www.aclu.org/news/criminal-law-reform/black-lives-matter-is-about-more-than-the-police/) has filed over 160 legal actions to safeguard voting rights, realease people from prisons, jails and immigration detention, protect access to abortion, and more.",
        "num_comments": 0,
        "comments": []
    },
    "He has some choice words ": {
        "title": "He has some choice words ",
        "score": 8545,
        "url": "https://v.redd.it/tlrfhj5xle9d1",
        "content": "",
        "num_comments": 83,
        "comments": [
            "Oooooooooooow that hurts... *oOh snack* >:3",
            "He's the definition of seeewww maaaeeed.",
            "He may not be happy about getting his shots, but it will keep him healthy : )",
            "I have honestly never seen a cat react that way to a shot. What a cutie.",
            "\"Your laugh contradicts what came out of your mouth.\"",
            "“How could you? I trusted you, and you… is that food?”",
            "Kitty would like to announce his displeasure",
            "Good thing reddit blocks swear words and replaces them with meows, or this would be nsfw. :)",
            "buddy, you're scaring the octopus in jail behind you",
            "“How could you! You swine!!”"
        ]
    },
    "suki": {
        "title": "suki",
        "score": 329,
        "url": "https://i.imgur.com/QOz0Caq.gifv",
        "content": "",
        "num_comments": 9,
        "comments": [
            "Now stick her on the wall and see if the static electricity will hold her up.",
            "What a little freak lmao",
            "Cats will train you to do the weirdest shit for them hahaha",
            "Silly baby :3",
            "Hilarious 😂",
            "That's hilarious.)",
            "Paging r/oneorangebraincell",
            "Insane trust level.",
            "Silly car"
        ]
    },
    "Raylan is so sweet": {
        "title": "Raylan is so sweet",
        "score": 590,
        "url": "https://v.redd.it/ck82ros4dh9d1",
        "content": "",
        "num_comments": 7,
        "comments": [
            "I count two gentle beebs.",
            "“Well hello, Raylan. To what do I owe this unexpected pleasure?”",
            "Oh, they're so friendly.😍",
            "Sharing is so cool",
            "Sweethearts ☺️",
            "Fwiends :3",
            "Good little babies."
        ]
    },
    "The kittens that are by my job were out playing yesterday morning. ": {
        "title": "The kittens that are by my job were out playing yesterday morning. ",
        "score": 1721,
        "url": "https://v.redd.it/43mu5hqznd9d1",
        "content": "",
        "num_comments": 17,
        "comments": [
            "I thought the mostly white kitten didn’t have a tail at first. I had already named him “Bob” and I’m sticking with it.",
            "If you can, try to TNR them, they are still young enough that they could be adaptable too!",
            "Hmm... well i would die for them",
            "The little walk off omg so cute",
            "Grab them and get them fixed pls",
            "You got anymore of those?",
            "They are adorable, thank you for sharing! I’m so glad one was adopted! ❤️",
            "I love the little crab tux 😭❤️🤣",
            "Boy I'm glad you said that because I never looked twice. That cat has a \"gravel gray\" colored tail haha.",
            "I was hoping to find people this subreddit would enjoy this content I'm glad you folks are finding it adorable as I did"
        ]
    }
}