{
    "My new 2024 stx!": {
        "title": "My new 2024 stx!",
        "score": 52,
        "url": "https://i.redd.it/3zd3ys3uai9d1.jpeg",
        "content": "My first new truck and I’m completely in love. I was in a car for the past several years and it feels great to be in a truck again :)\n",
        "num_comments": 10,
        "comments": [
            "Damn. Giving me intrusive thoughts about trading in my 2018. That thing is beautiful",
            "Would you mind sharing what you paid? Beautiful truck",
            "Swap out the large antenna for an aftermarket nub antenna, looks so much better.\n\nTruck looks slick",
            "This is an interesting location! Where is this at?",
            "Did ya get a deal?\nHow much off MSRP?",
            "Agree with the aesthetic but I use my antenna to gauge the height when I enter parking garages.   If antenna hits it is a warning",
            "The side eye my wife is giving me says I shouldn’t 😅",
            "Yeah, I get it, but I don’t need to worry about those where I live luckily",
            "Looks badass. Great choice!",
            "Do it!"
        ]
    },
    "After 20 years of wanting an F150 and some very unexpected events at the dealership today… my 2024 STX": {
        "title": "After 20 years of wanting an F150 and some very unexpected events at the dealership today… my 2024 STX",
        "score": 246,
        "url": "https://www.reddit.com/gallery/1dr2mbw",
        "content": "Life is good. ",
        "num_comments": 48,
        "comments": [
            "This is my fav grill and light setup from Ford.",
            "What were these unexpected events? Nice whip! I’m getting a 24’ STX with the black appearance package next month. Really looking forward to it.",
            "That's a nice looking rig! Good color choice, too.",
            "Nice looking truck man, the new front end is growing on me.",
            "Nice truck.\n\nSide note: If anybody ever says \" all it needs is a charge\", what they are really saying is \" it needs a completely new A/C system for about $3500\".",
            "Stx always looks great, I bought a 17 f250 stx budget conscious, the only regret I ever had was not stretching and buying one more loaded up",
            "Good looking truck! keep the rubber side down",
            "Congrats. My son got an STX a few years ago with 6 years zero interest. I think the STX is the best bang for buck in the F150 line. His has the 2.7 .",
            "Had no idea the 2024 stx was that nice!! Congrats man!",
            "Nice truck, congrats! I'll be getting one in 15 years"
        ]
    },
    "Saw an unreal camping rig today from Montana (in Yukon, Canada)": {
        "title": "Saw an unreal camping rig today from Montana (in Yukon, Canada)",
        "score": 257,
        "url": "https://www.reddit.com/gallery/1dquwks",
        "content": "F-550 Lariat w/42\" tires and carbon fiber camper.  What do you think this behemoth EarthRoamer rig is valued at? ",
        "num_comments": 90,
        "comments": [
            "Yo dawg.. I heard you like beadlocks so I locked your beadlock",
            "Earthroamer started as highly specialized exploration vehicles for science/exploration and what not. then they pivoted to basically 5 star hotels on wheels.  i think they still do both, but my guess is the artic explorations dont get the built in wine rack and fridge...",
            "About half a million new",
            "They’re listed at 685k and loaded pushing a cool Mil….\n\nWild",
            "Probably not actually from Montana. Just had an LLC there to avoid taxes on a half million dollar rig.",
            "The official car of retired bay area software engineer.",
            "I'd be curious how much weight they save using CF vs fiberglass on this thing",
            "What exactly is the purpose of those wheels??",
            "I just saw a F650 Earthroamer in Tahoe today, dude waited over a year for it. 1.4 mil😳🤯",
            "That’s a solid f400 too big to be in this group."
        ]
    },
    "Dealerships that offer below invoice?": {
        "title": "Dealerships that offer below invoice?",
        "score": 3,
        "url": "https://www.reddit.com/r/f150/comments/1drdoc4/dealerships_that_offer_below_invoice/",
        "content": "I had a 24 Lariat PB on order for 3 months that my dealer sold out from under me less than 12 hours after my test drive. I said I wasn’t sure if I liked the Pro Access tailgate so let me think on it for a bit cause I wasn’t sure if this was going to work for me. I didn’t say “pass” or “go ahead and sell it”. I even texted my salesman a few hours after I left proposing a tailgate swap if I paid labor (knew it was a long shot)…\n\nBut here we are… \n\nSo, what other dealerships besides Granger in Iowa offer below invoice pricing due to their volume?\n\nI’m in Ohio and Iowa to Ohio and back is a long drive (can’t fly cause I have a trade in I want credit for), therefore I’m hoping someone can enlighten me on other dealerships that won’t price gouge in the Midwest.",
        "num_comments": 7,
        "comments": [
            "Did you sign any paper work regarding having the truck on order?",
            "Not many. We will apply any discounts or incentives, and we don’t do markups, but we e aren’t discounting vehicles thousands of bucks to get them moving. We are a tiny dealership in Texas though, so we don’t meet the high volume criteria",
            "What any given dealer does is completely up to how their sales look, inventory, and their projections. There's no way to arbitrarily list ones that do any one thing regularly.",
            "I did not, which is my fault, however they never asked me to either. I did ask if I needed a down payment and they said no.",
            "How exactly did the order process go then? When we ordered a new Transit for our business we pretty much signed all the normal paperwork making the vehicle ours from the beginning. When it arrived we went in and finished off any remaining paperwork and were done.",
            "We went through the configuration tool at the dealership together, they printed off the final order form for me, and I got the typical Ford status update emails about the build date/in production/shipped/delivered/ etc. So it was def an order in my name and not just a dealership inventory order. But they didn’t require money down or me to sign anything and said if I refused it it would be fine cause they would be able to sell it quickly. I specific asked about that when I asked if they needed down payment. Since you were ordering for a business/fleet it may have been handled differently. It is what it is now, just need to find another dealership that will give me the truck at invoice or below.",
            "Ah sorry man. Unfortunately it sounds like you dealt with scummy salesman/sales managers to do that to you. They panicked and saw a bird in the hand. Good luck on your search. I think the market has leveled out enough that most dealerships are selling under invoice at least in Southern NJ."
        ]
    },
    "‘21 Powerboost ": {
        "title": "‘21 Powerboost ",
        "score": 2,
        "url": "https://www.reddit.com/gallery/1dre54h",
        "content": "This is my 21 Powerboost with about 18k miles now. I don’t have to commute to much for work but I have been able to run my TIG welder off the 240v system in the truck and cranked it up to 225amps and she ran it no problem! I have had little to no issues with the truck only a crappy stock battery which I upgraded to a more long life larger one from batteries plus. My rims are method machined aluminum 17” with a zero offset, I’m running 35” BFG ko2 tires and have been shocked with how good the ride is with no road noise at all 🤙🏻. The truck is a lariat 502a package with FX4 and I can say the 4x4 on it is amazing gotten me out of snow and mud easily. I’ve had a few recalls but nothing the local dealership didn’t handle quickly and easily! It has given me zero problems and has been by far the best vehicle I’ve owned and I have no intention of getting rid of it. Just made my last payment of the loan so she’s all mine now, wanted to see what people thought about the truck. Looking for a nice front and rear bumper to give me dual exhaust in the rear and some more clearance in the front! Any suggestions? ",
        "num_comments": 0,
        "comments": []
    }
}