{
    "After 20 years of wanting an F150 and some very unexpected events at the dealership today… my 2024 STX": {
        "title": "After 20 years of wanting an F150 and some very unexpected events at the dealership today… my 2024 STX",
        "score": 82,
        "url": "https://www.reddit.com/gallery/1dr2mbw",
        "content": "Life is good. ",
        "num_comments": 16,
        "comments": [
            "Had no idea the 2024 stx was that nice!! Congrats man!",
            "What were these unexpected events? Nice whip! I’m getting a 24’ STX with the black appearance package next month. Really looking forward to it.",
            "Nice",
            "Stx always looks great, I bought a 17 f250 stx budget conscious, the only regret I ever had was not stretching and buying one more loaded up",
            "This is my fav grill and light setup from Ford.",
            "That's a nice looking rig! Good color choice, too.",
            "Nice looking truck man, the new front end is growing on me.",
            "Congrats man!",
            "What is an stx compared to 4x4 and fx4? For reference I've got an 18 XLT 4x4 3.5 Eco....RIP cam phasers",
            "Beautiful ride btw"
        ]
    },
    "Saw an unreal camping rig today from Montana (in Yukon, Canada)": {
        "title": "Saw an unreal camping rig today from Montana (in Yukon, Canada)",
        "score": 198,
        "url": "https://www.reddit.com/gallery/1dquwks",
        "content": "F-550 Lariat w/42\" tires and carbon fiber camper.  What do you think this behemoth EarthRoamer rig is valued at? ",
        "num_comments": 74,
        "comments": [
            "Yo dawg.. I heard you like beadlocks so I locked your beadlock",
            "Earthroamer started as highly specialized exploration vehicles for science/exploration and what not. then they pivoted to basically 5 star hotels on wheels.  i think they still do both, but my guess is the artic explorations dont get the built in wine rack and fridge...",
            "About half a million new",
            "They’re listed at 685k and loaded pushing a cool Mil….\n\nWild",
            "Probably not actually from Montana. Just had an LLC there to avoid taxes on a half million dollar rig.",
            "The official car of retired bay area software engineer.",
            "That’s a solid f400 too big to be in this group.",
            "I'd be curious how much weight they save using CF vs fiberglass on this thing",
            "What exactly is the purpose of those wheels??",
            "Eathroamer is somewhat local to me in Colorado, it’s awesome to drive by their HQ on I-25 and see the rigs parked outside. \n\nFor the poster who said they’re out of business, where’s that info come from? They look from the outside to be doing fine…"
        ]
    },
    "Just bought a new 2024 F-150 STX": {
        "title": "Just bought a new 2024 F-150 STX",
        "score": 39,
        "url": "https://www.reddit.com/gallery/1dquy4y",
        "content": "My previous truck is a 2003 Ford Ranger. Which, by the way, she’s still going strong and has 201K miles on her. It was just time for something a little more modern and a smoother ride. I got the 4x4 V8 model with this F150. I’ve only had it a couple days, so far so good. ",
        "num_comments": 18,
        "comments": [
            "First time seeing those wheels, I like them!",
            "Would you mind sharing what you paid?",
            "White is the way to go. Congrats man.",
            "Tint and rear wheel liners first on the list. Nice looking truck.",
            "Good looking truck. Congrats.",
            "Stx has always been my fav exterior. It’s great they gave a bigger screen to the new stx’s too. \n\nBeautiful truck, best of luck dude 🤙🏽",
            "Such a sweet ride. Take it easy on us mortals.",
            "Was that Amazon truck in south side of Chicago?",
            "I think they look good for a stock set of wheels.",
            "I live in CA and it came out to $55K out the door with taxes and all fees."
        ]
    },
    "Sun was hitting my fake Lariat pretty well today.": {
        "title": "Sun was hitting my fake Lariat pretty well today.",
        "score": 24,
        "url": "https://www.reddit.com/gallery/1dqteou",
        "content": "",
        "num_comments": 14,
        "comments": [
            "Cost to do it yourself vs buying a lariat?",
            "That is absolutely gorgeous. Wow.",
            "Just waiting on the painted mirror caps to come in. Have all the higher end exterior lighting done along with the heated steering wheel swap and ambient lighting added.",
            "Where did you get the ambient lighting parts, and how easy/difficult is it to add it?",
            "When I was shopping, Larait 502As with 360 and relatively similar mileage were about 47-49k. I paid 37k for the XLT.\n\n1500 for the headlight kit\n500 for raptor tails\n300 for HSW\n200 for ambient lighting\n220 for mirror caps\n110 for the grill\n\nSo I'm still positive by roughly 7-9k.\n\nOnly other future upgrades I'd like is leather and some slightly better sound. So that'll narrow the gap a bit if I can't find another good deal.\n\nI got really lucky with the lighting upgrades between the 14th gen forum and FB marketplace.",
            "Thanks!",
            "How difficult was heated steering wheel?",
            "[https://www.f150gen14.com/forum/threads/xlt-trucks-with-push-button-start-cup-holder-ambient-lighting.14926/](https://www.f150gen14.com/forum/threads/xlt-trucks-with-push-button-start-cup-holder-ambient-lighting.14926/)\n\n  \nThat thread has pretty much all the info. Its not hard to do but you do have to pull apart alot of panels.",
            "What about the transfer case? You gonna get 4A?",
            "Not bad really. The wheel swap was maybe an hour, and I had the wire already ran during the ambient lighting swap but that's maybe 30min by itself. Then just the Forscan swap. Not hard button, added the Super duty climate card to control it."
        ]
    },
    "New Shoes!": {
        "title": "New Shoes!",
        "score": 89,
        "url": "https://www.reddit.com/gallery/1dqi24l",
        "content": "Falken Wildpeak AT4’s in 285/75-17 on Raptor take off wheels. \n\nThey measure 34.1”\n\nNo rub!  No lift/level. (Yet)\n\nMuch better than the OEM 22’s with street meat. \n\n",
        "num_comments": 21,
        "comments": [
            "The chrome looks good on that truck. I'm surprised. Congrats",
            "Selling them limited rims?",
            "I like the stock wheels",
            "How’s the ride? Especially body roll?",
            "Looks good. Surprised no level. I run Wildpeaks 285/65r20 (34.6 inches) with just a 2 inch level, no rub either. 20x9 +18 offset wheels.",
            "I have the same set up (older gen of raptor wheels on my f150 with the same size tires.  But, I went with the Toyo ATIII as you can get a C rated tire.  6112s set at 1.5” is enough clearance but I might go up a notch.  ’v happy with the ride.  I get 18mpg in my 2019 5.0 with 3:55 gears and 100k miles.",
            "thanks for posting that!  I'm changing tires soon, sticking with 17\" wheels and this is exactly what I'm looking to do, needed the tire size",
            "Can never go wrong with raptor takeoffs. Looks great",
            "Badass look..",
            "Let me know how you like the AT4, considering putting a set on my truck next month! Running AT3 currently. Torn between these and the BFG KO3."
        ]
    }
}