{
    "All I see is a caringfather": {
        "title": "All I see is a caringfather",
        "score": 20308,
        "url": "https://i.redd.it/y0lmmture28d1.jpeg",
        "content": "",
        "num_comments": 3139,
        "comments": [
            "Comments that are uncivil, racist, misogynistic, misandrist, or contain political name calling will be removed and the poster subject to ban at moderators discretion.\n\nHelp us make this a better community by becoming familiar with the [rules](https://www.reddit.com/r/facepalm/about/rules/).\n\nReport any suspicious users to the mods of this subreddit using Modmail [here](https://www.reddit.com/message/compose/?to=/r/facepalm) or Reddit site admins [here](https://www.reddit.com/report). **All reports to Modmail should include evidence such as screenshots or any other relevant information.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/facepalm) if you have any questions or concerns.*",
            "I had a hard time keeping track of *one* at that age. Toddlers are ninja-level vanish masters.",
            "He's one person.   They are 5 self-propelled random number generators.   He needs the leashes for their safety.",
            "I’d like to see someone else chasing after those kids after they decide to scatter.",
            "That's a litter. Three girl + two boy **quintuplets**. His wife gave birth to a full house.",
            "All depends on why.\n\nSometimes parents are neglectful.\n\nSometimes they're outnumbered.\n\nThis appears to be the latter.",
            "It's pretty obvious when someone puts a leash in their kid so they don't have to pay attention to them.   This is not the case",
            "Having kids on reins is not only completely normal, it's recommended by all sorts of organisations in the UK. [https://en.wikipedia.org/wiki/Child\\_harness](https://en.wikipedia.org/wiki/Child_harness)",
            "Look. I am not a parent, but I remember being a kid pretty well. One child can get in so many dangers, never mind FIVE…He needs to keep them safe somehow in crowded places. I would be more worried if he would drink a beer while they run unsupervised who knows where…",
            "Same here. People have been doing this since before I was born (1969). Why is it suddenly becoming such a big issue with idiots? Would these dumbass people rather the kids ran off and got hit by a car? Then they would say he was a bad father. Can't win. He's doing exactly the right thing. They should STFU."
        ]
    },
    "Florida, USA": {
        "title": "Florida, USA",
        "score": 2876,
        "url": "https://i.redd.it/ui66jbg6g38d1.jpeg",
        "content": "",
        "num_comments": 1097,
        "comments": [
            "Comments that are uncivil, racist, misogynistic, misandrist, or contain political name calling will be removed and the poster subject to ban at moderators discretion.\n\nHelp us make this a better community by becoming familiar with the [rules](https://www.reddit.com/r/facepalm/about/rules/).\n\nReport any suspicious users to the mods of this subreddit using Modmail [here](https://www.reddit.com/message/compose/?to=/r/facepalm) or Reddit site admins [here](https://www.reddit.com/report). **All reports to Modmail should include evidence such as screenshots or any other relevant information.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/facepalm) if you have any questions or concerns.*",
            "Sara-Nicole Morales was shot and killed in the front yard of her mother's house in Orange City, Florida, United States. \nWhile returning home from her job at a Volusia County library, she had become embroiled in a road rage incident with a local motorcyclist, during which she had intentionally struck his vehicle with hers, an act witnessed by two nearby motorists. \nThe three notified police and followed her to the house, where she confronted them with her fiancé's pistol. The motorcyclist drew his own gun and shot her five times.\n\n\n**Charges**\nNone - shooting was found to be justifiable homicide\n\nMorales, who was reported by her mother to be five months pregnant, was pronounced dead following arrival at a nearby hospital. The shooter, who had a concealed carry permit, was taken into police custody and released pending the investigation. Authorities were unable to confirm her pregnancy during the autopsy. Four months later the local prosecutor's office announced it had found the shooting justified as self-defense and would not be filing charges.\n\nhttps://en.wikipedia.org/wiki/Killing_of_Sara-Nicole_Morales",
            "So was she pregnant or not?? If autopsy was unable to verify a pregnancy, sounds like that part maybe shouldn’t be in the headline",
            "She was safe in her home. What could she possibly have thought to gain by going outside armed to confront someone?",
            "Well first off this lady hit a dude on a motorcycle with her car in a road rage incident. Then that guy and his friend followed her home ( she ran from a hit and run what do you expect when you hit a guy on a motorcycle intentionally a pat on the back ?) got to her house and immediately came outside brandishing a gun( not even her own firearm it was her boyfriends ) only to then immediately get shot 5 times and lose her life. By the guy she hit with her car who was legally concealed carrying. So he ended up getting off free and clear( I believe because he didn’t take out his weapon or anything util she came out gun in hand). And I honestly can’t blame the courts. Only problem was he followed her home but again she hit him off his motorcycle and then proceeded to run away from a hit and run. It’s a shame she made every single bad choice available to her. On a completely weird note her mother claims she was pregnant but the coroner was like no she is not. So that’s weird. Or at least it to me shows dishonesty and willingness to lie for sympathy.",
            "Not pregnant, the mother was sympathy farming.  All she had to do was wait inside for the cops.",
            "Only thing missing is the alligator",
            "It's Florida, he will be charged for performing an abortion.",
            "If you draw a pistol you better be ready to use it and deal with the consequences. It's absurd how many people don't seem to understand the simple concept of escalation.",
            "Sad to say but definitely not fit to be a mother if she was willing to act like that."
        ]
    },
    "People never learn 🤦‍♂️let's see how this goes": {
        "title": "People never learn 🤦‍♂️let's see how this goes",
        "score": 1692,
        "url": "https://i.redd.it/im49w6e5538d1.png",
        "content": "",
        "num_comments": 152,
        "comments": [
            "Comments that are uncivil, racist, misogynistic, misandrist, or contain political name calling will be removed and the poster subject to ban at moderators discretion.\n\nHelp us make this a better community by becoming familiar with the [rules](https://www.reddit.com/r/facepalm/about/rules/).\n\nReport any suspicious users to the mods of this subreddit using Modmail [here](https://www.reddit.com/message/compose/?to=/r/facepalm) or Reddit site admins [here](https://www.reddit.com/report). **All reports to Modmail should include evidence such as screenshots or any other relevant information.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/facepalm) if you have any questions or concerns.*",
            "Trickle down economics.",
            "That's not even as deep as the deepest free dive.",
            "Don't worry, the galvanised square steel and eco friendly wood veneer will surely help it hold this time",
            "Yeah but I am all for billionaire fish food.",
            "673 feet is nothing compared to the Titanic depth.",
            "Can elon and bezos tag along?",
            "it‘s only 200 meters. The deepest scuba dive was 332,35m (1090ft) so with proper training and preparation/equipment you could go there safely in scuba gear lol",
            "I could take a reinforced Pringles can down to 663 feet. The infamous imploded submersible could have safely gone to that depth a million times with no issues, but they got greedy and wanted to go to the Titanic despite having no idea what they were doing.",
            "Looks like a Fleshlight. Maybe this is the reason why you are fucked when you are in there."
        ]
    },
    "SHE really can't be that stupid. She's a liar ... err, lawyer.": {
        "title": "SHE really can't be that stupid. She's a liar ... err, lawyer.",
        "score": 1217,
        "url": "https://i.redd.it/lgjaty93c38d1.jpeg",
        "content": "",
        "num_comments": 50,
        "comments": [
            "Comments that are uncivil, racist, misogynistic, misandrist, or contain political name calling will be removed and the poster subject to ban at moderators discretion.\n\nHelp us make this a better community by becoming familiar with the [rules](https://www.reddit.com/r/facepalm/about/rules/).\n\nReport any suspicious users to the mods of this subreddit using Modmail [here](https://www.reddit.com/message/compose/?to=/r/facepalm) or Reddit site admins [here](https://www.reddit.com/report). **All reports to Modmail should include evidence such as screenshots or any other relevant information.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/facepalm) if you have any questions or concerns.*",
            "At this point, it's like arguing with a three year old who thinks they can pin a towel to their shirt and fly like Superman.",
            "This made me actually laugh out loud. Megan and Simone have accomplished so much. The fact he brought up the fart is amazing. I never not think about it when I see Rudy mentioned anywhere",
            "Rush Limbaugh received a medal from Trump, permanently diminishing its value.",
            "I know the conservatives don’t like Rapinoe but since when is Biles someone that people hate???  Maybe I just don’t get it but I didn’t think she made waves with them other than just winning and being black.",
            "Convicted criminal Jenna Ellis ? Complicit Jenna Ellis ? Begging for mercy at the feet of the court Jenna Ellis  ? Had I only known Jenna Ellis ? Suspended law license Jenna Ellis ? Simone biles has never done anything except represent her county in the most honorable way possible. Megan Rapinoe has done nothing but represent her country in the most hora me way possible. You couldn’t carry their gym bags. I realize this is an old post. But that bitch is nothing but another con who got caught, and then acted like a little bitch in front of the judge, whimpering and  begging for the court not to fry her. Despicable little Trump supporter.",
            "Is her being stupid and a liar a rhetorical question right? Right?",
            "![gif](giphy|zbyE0sDeW4z3W)",
            "Liar, Lawyer, Mirror for you, what's the difference?",
            "This is the same one who was tearfully remorseful at her sentencing, lol. That ruse is obviously over.😆"
        ]
    },
    "Now wait a damn minute": {
        "title": "Now wait a damn minute",
        "score": 43028,
        "url": "https://i.redd.it/bgxnvzzgzy7d1.jpeg",
        "content": "",
        "num_comments": 3616,
        "comments": [
            "Comments that are uncivil, racist, misogynistic, misandrist, or contain political name calling will be removed and the poster subject to ban at moderators discretion.\n\nHelp us make this a better community by becoming familiar with the [rules](https://www.reddit.com/r/facepalm/about/rules/).\n\nReport any suspicious users to the mods of this subreddit using Modmail [here](https://www.reddit.com/message/compose/?to=/r/facepalm) or Reddit site admins [here](https://www.reddit.com/report). **All reports to Modmail should include evidence such as screenshots or any other relevant information.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/facepalm) if you have any questions or concerns.*",
            "The fact that they have a 2024 year old ghost in the picture is scary.",
            "Hopefully she's a step mom...",
            "Whoops…..kind of incriminated yourself with that math there.",
            "Fun fact, people intentionally put incorrect ages on these kind of posts to try to get more engagement.",
            "Please tell me this is the stepmom",
            "Weird flex.",
            "Who are these people? The post is running around social media today with no discussion of who they guy is.",
            "Plot twist: they’re all his kids.",
            "Bride and groomer"
        ]
    }
}