{
    "Examine the perimeters\n": {
        "title": "Examine the perimeters\n",
        "score": 5650,
        "url": "https://i.redd.it/o0dum4tk5h9d1.jpeg",
        "content": "",
        "num_comments": 429,
        "comments": [
            "Lmao that’s actually a hilarious response",
            "Honestly that’s funny as fuck and I respect their boundaries for not paying for the friend but also being like “word I get it, sit outside” lmaoooo",
            "\"She wanted to go out for food and drinks.\" Then she pulls out the safety card. Sure, safety is important. But this isn't the way to go about it. She can sit in the car, she can get own table and buy her own food and drinks, or y'all can set up location tracking on your phones. I'm a woman, and I would never behave like this, and I wouldn't expect a first date to pay for my friend's food and drinks. Why would any dude want an awkward as hell three person first date, let alone to have to pay for the uninvited addition?",
            "Why don’t people just pay for their own stuff?",
            "That's the appropriate response, well welcome to bring a friend to feel safe but she's not part of the date deal.",
            "I'd rather you bring your friggin mom than a friend. Have you ever watched how two friends together will nit pick something to death? Like a first date. Lol.",
            "Cancel date. Cancel, if she expects her friend to be dined too. \nMight just be dating for free food anyways.",
            "I mean, each person should pay their own bill?",
            "Why isn’t anyone optimistically considering a happy threesome as an outcome?",
            "Lol, classic case of misunderstanding safety protocols. \n\n'Examine the perimeters' made my day lol"
        ]
    },
    "Electric": {
        "title": "Electric",
        "score": 18657,
        "url": "https://i.redd.it/mzgstuzzof9d1.jpeg",
        "content": "",
        "num_comments": 1330,
        "comments": [
            "I mean there's always an option of carrying a big flashlight.",
            "This guy could say \"Salad dressing a hopscotch verily flounder the giant hairdryer\" and his base would cheer.",
            "I hate it when the sun goes down and electricity stops working.",
            "What happens? He’s a dumbass, that’s what happens…",
            "These are the kind of insightful questions you ask when your uncle was a professor at MIT.",
            "Disregarding the obvious about the sun, electric planes are not being discussed. You can't get the same sort of combustion out of electricity that a plane needs (though it might work for a propeller plane, but then you'd need to worry about battery size). Instead green fuel, such as hydrogen made with renewable electricity, is being considered.",
            "Can only lie since he is dumb as a box of rocks.",
            "Jesus how have we fallen this far",
            "How will the planes fly at night if they use any electricity? Yeesh",
            "What happens to fossil fuel planes when there isn't an oil field up there?"
        ]
    },
    "Guy tweets video of Elon getting booed and gets account deleted. So much for free speech": {
        "title": "Guy tweets video of Elon getting booed and gets account deleted. So much for free speech",
        "score": 5030,
        "url": "https://i.redd.it/vijij77pif9d1.jpeg",
        "content": "",
        "num_comments": 325,
        "comments": [
            "Be glad that he can’t run for president.",
            "Elon is such a little bitch. Dude can't handle any criticism or people dunking on him.",
            "Is elon a snowflake?\n\nInteresting",
            "Apartheid Edison has skin as thick as the outer layer of an onion!",
            "Man imagine being so deluded where in your mind, you're a free speech absolutist and ban people for disagreeing with you.",
            "When the chuds say \"free speech,\" they mean \"being a bigoted shit.\"",
            "His fault for using Twitter to begin with.",
            "Pedo's restoring CSAM accounts. 💩",
            "Elon has his life rewards, money, corporations, Twitter for his personal use. But he still expects adoration and applause wherever he goes?",
            "Brother the account’s last post was an uncensored cartel execution"
        ]
    },
    "Pathological Lying 101": {
        "title": "Pathological Lying 101",
        "score": 10020,
        "url": "https://i.redd.it/s0gaxw0jpe9d1.jpeg",
        "content": "",
        "num_comments": 518,
        "comments": [
            "Well isn’t it obvious….the democrats did it",
            "It was the woke culture of course",
            "He is the best businessman, pays people obscene amounts of money for no reason, his only mistake was not calling her a consultant, then it might have been believable that she screwed him for the money but they didn’t have sex.",
            "I feel Biden really missed an opportunity when Trump brought this up with something like \"the jury of your peers disagree and now you're a convicted felon.  Sort of like how you were found guilty of sexual assault on E Jean Carroll.\"  Then just watch Trump defame her again.",
            "“I did NOT have sex with that woman”\n\n~~Bill Clinton~~ Donald Trump",
            "Why would a Wookiee, an 8-foot-tall Wookiee, want to live on Endor, with a bunch of 2-foot-tall Ewoks? That does *not make sense!*",
            "It’s just recreational fraud. Doing it for the love of the game",
            "And risk committing fraud to do it.",
            "Apparently, at least 30% of America is not doing this…\n\n![gif](giphy|3tEFVAbfzzcwo|downsized)",
            "Biden had so much ammo this last debate, too bad he fumbled it.. he's still my choice over Jeffrey Epstein's friend and fellow child rapist"
        ]
    },
    "How is that obesity?": {
        "title": "How is that obesity?",
        "score": 11205,
        "url": "https://i.redd.it/3jpsjttjme9d1.jpeg",
        "content": "",
        "num_comments": 1989,
        "comments": [
            "\"I wish I had a pot..\" \n\n\"You wish you had some pot?\"",
            "BRO STFU YOU’RE SCARING AWAY THE WOMEN DAMMIT",
            "That's a fuckin after snack pillow....",
            "Where else is all the food I cook gonna go? Let the girl live. Damn.",
            "OP's history clearly indicate a repost bot.",
            "This is the male equivalent of 'If a guy has an android ew'\n\nIts purposeful ragebait because they know it gains traction and engagement.",
            "\"Don't eat or drink anything with flavour and work out constantly, so some guy you have never met and never wanted to engage in sexual anything with can jerk off to the thought of you naked without your consent\" - Sincerely every guy who posts this shit",
            "This would look like obesity...if your only experience with women was hentai",
            "This is so insane because even when I was dangerously underweight the belly stayed and drove me mad. Some people are just built with a lot of their body fat located in their stomach area. Especially women. We need to stop associating a flat stomach with health. It's simply untrue.",
            "I’m a size US 4/6 shmedium, and I have had this since I had kids. I’m super active and moderately health conscious with food. I’m sure if I really devoted to eating fully healthy I’d be smaller, but I’m far from obese.  \n\nAnyway, I love this on women. If men won’t love this one you, I will motor boat your soft tummy until the cows come home."
        ]
    }
}