{
    "Weekly Question Thread": {
        "title": "Weekly Question Thread",
        "score": 9,
        "url": "https://www.reddit.com/r/factorio/comments/1dhxhtj/weekly_question_thread/",
        "content": "Ask any questions you might have.\n\nPost your bug reports on the [Official Forums](https://forums.factorio.com/viewforum.php?f=7)\n\nPrevious Threads\n\n* [Weekly Questions](https://www.reddit.com/r/factorio/search?q=flair%3AWeekly%3AThread&sort=new&restrict_sr=on)\n* [Friday Facts](https://www.reddit.com/r/factorio/search?q=flair%3AFFF&sort=new&restrict_sr=on) (weekly updates from the devs)\n* [Update Notes](https://www.reddit.com/r/factorio/search?q=flair%3AUpdate&sort=new&restrict_sr=on)\n* [Monthly Map](https://www.reddit.com/r/factorio/search?q=flair%3AMonthly+Map&sort=new&restrict_sr=on)\n\n[Subreddit rules](https://en.reddit.com/r/factorio/about/rules)\n\n[Discord server](https://discord.gg/factorio) (and [IRC](https://webchat.esper.net/?channels=#Factorio))\n\nFind more in the sidebar ---->",
        "num_comments": 114,
        "comments": [
            "can you name circuit signals, like variables in code? so you don't have to remember 'Y' means 'Yes this inserter should be active'",
            "Longtime player but been away for a while and seeing a lot of excitement building for v2.0. Do we have even a rough ballpark estimate of when that may release?",
            "Asked this in the last thread and got no response.\n\nI'm using Space Exploration and LTN, with the mod to allow space elevator LTN deliveries. Every now and then I get a 'train out of fuel' warning which lasts only a second or two. It disappears before I can click it and find out where the train is, and I can never see any stopped trains in the network. All my depots refuel trains with nuclear fuel and the network isn't very large - they should never run out of fuel in normal circumstances.\n\nWhat's causing these alerts?",
            "I’m not exactly sure how to word this question, but it’s something I’ve wondered about with Factorio but also other games like Transport Fever 2, Big Pharma, Kerbal Space Program, etc. I really love games about engineering and system-building, but I feel like I’m lacking in some kind of basic mindset or skills that make people good at these games.\n\nIt’s exciting and fun in the early game, but I often hit a wall as things get more complex. Tutorials tend to ruin the fun, but without them it feels like trying to play a really complicated board game without the rule book.\n\nI guess I’m wondering if I should take a basic class in engineering or problem solving or something, just to develop the brain skills that make these games “click” for others. Are many players here engineers or have STEM backgrounds? Did you enjoy math in school and end up taking advanced stuff like calculus? What about coding? Any other things you have learned or done that gave you skills that translate to Factorio?\n\nTL;DR - Have you found that any math or engineering classes you’ve taken irl helped you in Factorio? Would you recommend anything like that for someone who loves the game but struggles with the figuring out the more complex parts?",
            "Is there a way to use spidertrons as artillery deployers? Walk them out behind enemy lines, stamp a blueprint, and run away kind of thing? I'm guessing no but not sure if I'm missing something obvious.",
            "If I offload my game to a beefy headless server, will I be able to play the game on lesser hardware as a client or does my local client need to do a load of processing too?\n\nI realise there's a trainload of \"it depends\" regarding the specs, network, etc - the essence of my question is: am I actually offloading any heavy lifting to the server or am I just running the game in two places instead of one?",
            "In a vanilla base where all resources are transported through train in city blocks, is there a way I could have a module build that doesn't drain my chips from science? Ie. A priority system.\n\nI am open to solutions with or without circuit networks.",
            "so, I started 2nd world, launched 2 rockets with satellites and still do not understand how I can finish this world. I am playing with peaceful mode on. Am I supposed to play with biters?  \nI am a new player. I have some modes but space exploration is off. I don't think I have something like changing anything related to finishing the game",
            "I'm looking for a new modded experience. \n\n\nI have previously played through Nullius and Industrial Revolution 3.\n\n\nI recently attempted SE+KR2 but bounced off, removed KR2 and bounced off SE alone shortly after reaching space science in Nauvis orbit.\n\n\nI'm looking for similar overhauls. Does anyone have any recommendations?",
            "In unmodded. \nI feel like when I look at a machine's stats/recipie it only shows a cycle. Not more important stats like how many gears/min is needed.\n\nIs there some tooltip I'm missing that shows per/min or per/second cost machine will use/make?"
        ]
    },
    "Friday Facts #416 - Fluids 2.0": {
        "title": "Friday Facts #416 - Fluids 2.0",
        "score": 1884,
        "url": "https://factorio.com/blog/post/fff-416",
        "content": "",
        "num_comments": 955,
        "comments": [
            "Didn’t expect a fluid rework and also didn’t expect to see a Minecraft mod being used as inspiration",
            "\\*sees the headline\\*  \nI felt a great disturbance in the Force. Like the millions of voices suddenly cried out in joy and then shut up to read.",
            "Would this also benefit UPS? I suppose so but im only guessing",
            "If you can now cram any amount of fluid into a pipe network (within the 100 fluid per tick per pipe restrictions) nuclear plants in particular should now be much easier to design. You should be able to cram all or at least most of your intake water into a single pipe network, and all or most of your steam into a single pipe network.\n\nIt simplifies the fluid puzzle quite a bit, but I'll happily take this over the old opaque weirdness.",
            "After years of tears and anguish, God heard the cries of his people",
            "Am I the only one who ran out of lube halfway through this FFF?",
            "Hiring skilled and motivated members from the community proves to be a good choice, again. Thanks raiguard!\n\nWhen players have to look up a wiki to play well, that's a sign that something with the game design is off. (And I like stardew valley, but my point stands). The new system has a bit less realism, but also a lot less of the unrealistic surprises, and I'm looking forward to it. Pull rate could be scaled down relative to the length or size of the segment to bring a bit of realism back, but I doubt that's necessary.\n\nBut this left me wondering: if segments can no longer contain different fluids, what happens in 2.0 when bots connect segments with different fluids? Does the bot keep hovering as if waiting for someone to clear a cliff or tree?\n\n/edit: and will this system be used for heat pipes as well, or does the old system live on?\n\n/edit: and how do boiler-chains and other passthrough-machines work? Do they become part of the segment? Do they use the old logic?",
            "The entire Factorio subreddit community have genuinely been crying out for this FFF for so long.",
            "No more tough pump circuitry at train stations! Praise Wube!",
            "This should make sushi pipes less of a headache, right? I remember trying it before and getting stuck with a tiny bit of fluid left in one section blocking everything else."
        ]
    },
    "Accidentally left an open chest of naquium heat pipe longs, there goes 56000 naquitite plates...": {
        "title": "Accidentally left an open chest of naquium heat pipe longs, there goes 56000 naquitite plates...",
        "score": 154,
        "url": "https://i.redd.it/4uhkd7bt528d1.png",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Oh well, time to create the biggest reactor SE has ever seen",
            "You will use them in Foenestra energy setup. Like half of the for sure, so dont worry :)",
            "https://mods.factorio.com/mod/reverse-factory",
            "You’re laughing? JugglingMaster accidentally made 56000 naquitite plates and you’re laughing?!",
            "Nice",
            "There's a mod for that: https://mods.factorio.com/mod/chest-auto-limit",
            "I just use a blueprint with a blue chest and either a red or purple depending on use. With an inserter each. Slots limited in red or purple. Edit forgot to add the one with the purple chest is limited by a circuit wire between chest and inserter"
        ]
    },
    "2.0 Sushi Pipe Controller": {
        "title": "2.0 Sushi Pipe Controller",
        "score": 83,
        "url": "https://i.redd.it/2zpzd0ikr28d1.png",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Don't show this to dosh",
            "Blueprint:  \n[https://paste.ee/p/Se1zi](https://paste.ee/p/Se1zi)\n\nExplanation: With the Fluid rework for 2.0 Sushi Pipes become usable. This build emptys and fills the main base sushi Pipe (Connection to base at bottom) once a second with a new fluid.  \nEach fluid need to be connected to a storage tank farm, with these connections being at the top of this build.  \nThe emptying process is done in 2 stages, to get a greater amount of pumpes working. The first stage is the bottom half, emptying the main base sushi pipe into the 2nd stage at the top where the fluid get sorted to their individual storages. This 2 stage apporoach greatly increases the pipes with access to the main sushi pipe thus empting it faster, and can get away with few pipes for individual fluids, becasue the 2nd stage sushi pipe segment is much smaller thus the pumps can work faster.",
            "What in the seven hells is this….",
            "r/factoriohno",
            "The undergrounds dodging pipes of the same fluid are so cursed.",
            "Ah finally my refinery train loading stations will be legendary",
            "perfect XD, I'm pretty sure there will be some throughput limit, it would be weird of there wasn't one",
            "add a mod that turns all resources into liquids",
            "For when paste.ee inevitably nukes your blueprint:\nhttps://factoriobin.com/post/X5_ShnjA",
            ">paste.ee\n\nyou people continue to surprise me with random text uploading sites that i've never heard of.\n\nplease just use factorio specific sites like [factoriobin](https://factoriobin.com/), [factorioprints](https://factorioprints.com/), or similar to upload blueprints. as they are way less likely to just randomly delete data and have some nice extra features like visualizations and item counts"
        ]
    },
    "Rail Blueprints": {
        "title": "Rail Blueprints",
        "score": 84,
        "url": "https://i.redd.it/4o588chli18d1.png",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Some prefab rail things I made for my up coming megabase.\n\nI'm having issues posting the string for the book (3426969 characters long) so if you want the book I'll have to send a text document.\n\n  \nEdit: [https://drive.google.com/file/d/12t-YIm-hdCxXl6xTOkEkBBEKTnS-CcRk/view?usp=drive\\_link](https://drive.google.com/file/d/12t-YIm-hdCxXl6xTOkEkBBEKTnS-CcRk/view?usp=drive_link)\n\nEdit 2: I realized that the link was restricted access, it’s now publicly accessible.",
            "hmm, I think I will save this blueprint and never build it.",
            "Gee this reminds me of Game of Life",
            "Awesome, thank you very much",
            "How can I bookmark this post :))))?",
            "Have you tested those stackers? When stackers are different in length, it can lead to situation where train tries to go to already occupied shortest stacker, blocking it. It's the reason why usually exit and entrance are placed diagonally, to ensure all stackers are of the same length.",
            "Now add solar to them all.",
            "Try pastebin for blueprints. I think there is also a similar site dedicated to factorio.",
            "Can you send it to me please?",
            "doesn't a chain signal solve this?"
        ]
    }
}