{
    "Request Wednesday - All Requests go here!": {
        "title": "Request Wednesday - All Requests go here!",
        "score": 3,
        "url": "https://www.reddit.com/r/FalloutMods/comments/1dp0873/request_wednesday_all_requests_go_here/",
        "content": "Please use this thread to post any requests you have for mods.\n\n&#x200B;\n\nPlease state the game you are requesting it for, the mod and idea you have, and any other details you have. Any request posts outside of this will be removed. \n\n&#x200B;\n\nKeep in mind, there is a LARGE chance no one will make your mod if you are not willing to put effort into helping yourself. You may want to consider looking up resources on mod creation yourself. Even with no experience, a lot of basic mods can be made with a few simple tutorials.       \n\n&#x200B;\n\nThe more discussion you create, the more chance someone may come along and be interested in helping. Ensure your ideas are well thought out to get a better response.",
        "num_comments": 5,
        "comments": [
            "I'd to request a NG update of this  \n[https://www.nexusmods.com/fallout4/mods/76454](https://www.nexusmods.com/fallout4/mods/76454)  \nAuthor stated he ain't going to update it, however he put up the source code on GitHub, so if anyone can do it would be really appreciated.",
            "[FO4] changing sprint sound in power armor while in combat\n\nInspired by the show, I grabbed an mp3 of Titus' \"fk fk fk fk no no no no\" line. If possible I'd like the sound to be activated under the conditions of: being in PA, being in combat, and sprinting. Not sure if this even possible to do such a thing, but it would be the most appropriate for the scenario. I don't want it tied to sprinting in PA out of combat as it wouldn't make sense. \n\nHere's the mp3: https://drive.google.com/file/d/1hrmVzh9SdOEofiNQsY1kNFQnJsPI_Feg/view?usp=drive_link",
            "[FO4] heartbeat monitor \n\n something like resident evil VII ethan [ecg monitor](https://imgur.com/a/Wfn7gwN) to use in no-HUD playthrough, as a quick inspect to check the essencials\nI was thinking on the [casio w59](https://www.nexusmods.com/fallout4/mods/55422) as a base or something similar.\nI made a [basic layout ](https://imgur.com/a/sRfhL5Y) to be used as a base",
            "Idea: Fallout New Vegas mod that adds an OP Will Smith companion. His punches send enemies flying across the room or even the map. His combat initiation dialogue is \"keep my wife's name out your fucking mouth\"",
            "An addition to this awesome shotgun mod.\n\n[Quad-Barrel Shotgun - Fallout Miami Standalone at Fallout 4 Nexus - Mods and community (nexusmods.com)](https://www.nexusmods.com/fallout4/mods/37493)\n\nParticularly, I'd like someone who is willing to create a variant of the normally included legendary 'Liberator', but instead of explosive shotgun shells, I'd like Gamma Gun 'Green wave things' instead.\n\nFor reasons I can't figure out, making an attachment never works for me, and I'm not sure what I'm doing wrong. I've been banging my head against a desk over this for few weeks now, between RL and stuff.\n\nIf the person who chooses to take this up, is also willing to put the 'fusion cores' from [Atom's Judgement | Fallout Wiki | Fandom](https://fallout.fandom.com/wiki/Atom%27s_Judgement) scaled down on the firing end, to act as the attachment that gives Gamma Bursts, I'd be even more grateful. Not holding out on that, but it would be neat.\n\nNot interested in any major damage changes (I like the overpowered base Quad Shotgun as it was released).\n\nThanks to anyone who takes this request up!"
        ]
    },
    "[FO4] what if there was no lights in abandoned vaults?": {
        "title": "[FO4] what if there was no lights in abandoned vaults?",
        "score": 2819,
        "url": "https://v.redd.it/ruokkixanc9d1",
        "content": "Lights were removed using [this mod](https://www.nexusmods.com/fallout4/mods/11076?tab=images). Creepy vibes",
        "num_comments": 189,
        "comments": [
            "I'm with you. I don't think there should be lights in most places. Not like there are draugr around to light the torches and braziers.",
            "3spooky5me",
            "What mod are you using to retexture vaults?",
            "It looks dark like it's a place underground spooky 😮",
            "Why do I have a sense of Deja Vu.  \nOh wait, Gmod realism videos, that's why.",
            "Now that's Stalker",
            "What's the geiger counter sounds you're using?",
            "No. Not even with a god mode on.",
            "Yeah, would be far better to let the players find nightvision goggles than having electricity and functioning lights everywhere.",
            "My guy turned fallout 4 into dead space. Based"
        ]
    },
    "[FO4] The duality of Mod.": {
        "title": "[FO4] The duality of Mod.",
        "score": 963,
        "url": "https://www.reddit.com/gallery/1dqrjks",
        "content": "",
        "num_comments": 50,
        "comments": [
            "Do them both and see what happens",
            "Unrealistic. You didn't step out for a cigarette break every twenty minutes when you were in middle school?",
            "In most poor countries IRL kids smoke cause it staves off the feeling of hunger.",
            "It’s the post apocalypse of course children smoke",
            "The extra irony is both of these are from the same mod author and were released on the same day.",
            "The mod creator that removed Miranda’s butt shots in Mass Effect 2 also created the mod that added them back in for the Mass Effect Legendary edition.",
            "Wait, can kids smoke in vanilla fallout 4 or not? Why are there two mods doing the opposite thing?",
            "The Mick and Ralph's crier definitely takes smoke breaks.",
            "\"I'm playing both sides, so that way I always come out on top.\"",
            "[excuse you, they definitely do](https://youtu.be/5oVBvxA0mm0?si=jawBgYNhQO8VkUvI)"
        ]
    },
    "[Fo4] Missing Buildings/Textures/Models": {
        "title": "[Fo4] Missing Buildings/Textures/Models",
        "score": 87,
        "url": "https://www.reddit.com/gallery/1dqlqst",
        "content": "",
        "num_comments": 14,
        "comments": [
            "Either you didn't install Desperados Overhaul's PRP patch, or your load order is all wrong. These are not missing textures, but broken precombines/previs. Please read the description and pinned posts of Desperados Overhaul.",
            "Be sure PRP is on the bottom of your load order",
            "Unrelated but this looks like it could fit some sorta fallout analog horror deal",
            "Basically these... missing \"textures\" or might I say even parts of land are present all over the commonwealth, for no reason I can identify. I use badlands2 landscapes and LOD mods, as well as desperados overhaul. I don't really know, but I think they are also the reason for crashes near Sanctuary and Diamond City. What do you think causes this?",
            "Put PRP as close to the bottom of your load order as possible and make sure you have any PRP compatibility or previs regeneration patches for mods that make significant edits to the world. Load order is key if you don’t want to break precombines and have a flickering game. RIP your game performance otherwise 💀",
            "unrelated but your graphics are beautiful, what mods are you using ?",
            "Unrelated but what animations and/or weapon are you using it looks really cool",
            "Bethesda my friend Bethesda made the game don't expect much",
            "Thanks, it turned out that the PRP patch was the problem. Unfortunately, this playthrough is broken, but when I started the next one everything was perfectly fine.",
            "This seems to be the most likely problem"
        ]
    },
    "Should I downgrade FO4?": {
        "title": "Should I downgrade FO4?",
        "score": 6,
        "url": "https://www.reddit.com/r/FalloutMods/comments/1dr0qzn/should_i_downgrade_fo4/",
        "content": "Just picked up FO4 on steam and am having trouble with mods not launching properly in the f4se log. I care mostly about QoL features and texture/weather overhauls and while some are loading fine, many are not. I’m not new to modding but I am new to modding FO4 as I’ve only ever played it on XBone, so I don’t know how active the community still is/what the chances of half of these mods ever being updated are. In your opinion, should I downgrade or wait for mod authors to update? \nEdit: to clarify, the issue is that most small QoL features like animation fixes are only updated for f4se version 1.10.163",
        "num_comments": 7,
        "comments": [
            "From what I've heard the dev for f4se has (supposedly) said that he doesnt think he'll have a new stable version until near the end of the year, and most of the bigger mods iirc can only update once f4se updates",
            "only reason not to is to save yourself the \"trouble\" of doing so",
            "I forgot to change the .in to disable updates. Searched how to rollback FO4 and followed instructions. Took 45 to an hour from first download to being on a clean (no mods) v1.10.63 start screen.\n\nPlayed through till just before you 'finalize' your SS before leaving your vault. Saved, turned off, went straight to SKSE and Nexus.",
            "Update fully and then get a mod collection like A story wealth (they have a support discord too) and it downgrades the exe at the end so mods work perfectly. Also there are over 700 mods in the collection that get updated frequently and a team that works tirelessly so they're all compatible (including all the major story ones like America rising, ss2, etc).\n\nEdit: you can find aSW on nexus and the installation is simple.",
            "F4se has been updated for like 3-4 weeks",
            "A stable version not a working version",
            "Thank you for informing me"
        ]
    }
}