{
    "Fallout (TV Show) Spoiler Master Thread": {
        "title": "Fallout (TV Show) Spoiler Master Thread",
        "score": 1476,
        "url": "/r/Fotv/comments/1bt7fzx/fallout_spoiler_master_thread/",
        "content": "",
        "num_comments": 5697,
        "comments": [
            "The hacking of the overseers terminal was a cool nod to the game",
            "Man, the very last shot of this season has gotten my hopes so God damn high, I pray we get a season 2.",
            "The cold fusion code is the date that Fallout 1 released: 101097. \n\nThought that was a nice nod.",
            "Coop Howard is Vault Boy???",
            "Wait so Lucy def fucked her cousin(s) right?",
            "I was surprised that they made stimpacks work like they do in the game (immediately repair anything). At first, I thought that was unrealistic. But then I remembered none of this is realistic, so I think it is actually a pretty cool addition.",
            "The final shot of the season gagged me to high heaven",
            "Bro they got the Junk jet on the first episode!",
            "my one and only critic about this show is that they reused the maximus flashback so many times without showing any new footage or a continuation of his flashback. i expected some more interaction with the knight that inspired him to become one, or how his life was before the city got bombed, but through the entire series we saw the same flashback over and over again.. \n\nthe show is still a 9.8/10 for me and still better than the last of us, and i'm not even a fan of the games...",
            "Interconnected vaults seems like an interesting idea"
        ]
    },
    "So in fallout 3 how did you complete the Oasis quest line???": {
        "title": "So in fallout 3 how did you complete the Oasis quest line???",
        "score": 913,
        "url": "https://i.redd.it/oq2k27cysg9d1.jpeg",
        "content": "",
        "num_comments": 108,
        "comments": [
            "I just destroyed his heart, like a normal person",
            "Apply the thing the Mother gives so his influence spreads.  \nHarold won't be mad about it, he will actually accept it rather kindly.  \nWhat you did? I hope game bugs and sends out like, 30 Talon Company mercs, or 30 Regulators.",
            "I told him how important he is to the environment that he is able to make trees grow where not even weeds could. He accepts.\n\nAlso I explained to the tree huggers that when Harold says something, he meant it exactly how he said it. If Harold's going to spend his days as a god worshipped by these people then at least I make sure they know what he's saying",
            "The most ethical thing would’ve been to lobotomize tree man, He doesn’t have to suffer the cognition of his fate and the whole capital wasteland benefits from clear water a lush reforestation. He is simply to much of a boon to the wasteland, yes his suffering is sad but I always choose to keep him alive. \n\nEveryone is suffering in the apocalypse and I think you could eventually reassure his that his sacrifice would benefit more than he could comprehend.",
            "I just finished the quest 1 hour ago. What a coincidence ! I killed him with the heart. The poor soul...",
            "I go with Laurel's plan. But if I didn't know Harold is kinda OK with it I would have more reservations.",
            "By respecting my favourite ghouls whishes and ending his life.",
            "I don’t remember. But I remember this quest as one of the best in the whole 3D fallout series.",
            "Have you guys and gals ever seen… a tree? No, no, no. Not those shriveled black things. I’m talking real trees. Brown bark, green leaves, photosynthesis, all that good stuff.",
            "I have done all four options: spread, diminish, kill, immolate.  Spreading his influence is what I chose first and default to."
        ]
    },
    "How much would it cost to commission a wearable suit of X-01 Power Armor?": {
        "title": "How much would it cost to commission a wearable suit of X-01 Power Armor?",
        "score": 2718,
        "url": "https://i.redd.it/9ezwobm5wd9d1.jpeg",
        "content": "And if anyone knows who/where I could commission it that'd be great information too.",
        "num_comments": 346,
        "comments": [
            "Hit up Etsy & ask. Some of those that do helmets may do other parts also.",
            "Enter a contract with Pentagon and a $5,463,862",
            "The fusion core is going to be the most expensive part.",
            "I'm going to need about tree fiddy",
            "As a cosplay, probably around 3000.",
            "find a fursuit creator and ask them if they do robotic OCs",
            "I've daydreamed about building a set of Power Armor in my garage out of scrap bought for pennies on the dollar from a junkyard or maybe Craig's List furniture.\n\nIf it's even 1% possible to make anything remotely like Power Armor out of old refrigerators, car parts, and cheap electronics, it'd prolly look more like Raider Power Armor than X-01.",
            "Probably impossible unless all the billionaires of the world band together and focus their efforts on this one project\n\nOtherwise itll be kinda low quality",
            "The guy who made the t-60 suit for the show could probably make you one as he takes commissions. tandaworkshop.com",
            "Tony Stark built it in a cave with scraps."
        ]
    },
    "Playing my first Fallout Game what should I know going in?": {
        "title": "Playing my first Fallout Game what should I know going in?",
        "score": 800,
        "url": "https://i.redd.it/1y0vzbh0ne9d1.jpeg",
        "content": "",
        "num_comments": 460,
        "comments": [
            "You should at least be aware that war never changes.",
            "Shoot the wings or else you will die immediately.",
            "the best way to play it the first time is to do it as if you are walking into a movie you are experiencing personally. just try to be as immersed as possible and follow your instincts and natural curiosity. don't bother trying to \"play it right\" since you can always do that in playing the game over after you finish the first time. just be in the experience your first go at it <3",
            "Have you considered The Game was rigged from the start?",
            "The House will always win.",
            "Go to quarry junction in order to grab the stash of caps and good early game weapon.",
            "That is chandler bing right there.",
            "First ten hours of play are the most intimidating and yet most rewarding in the game",
            "The guy at nipton kill him right away he won the lottery",
            "Thou shall get sidetracked on BS"
        ]
    },
    "We did our best to do a Dogmeat Cosplay!": {
        "title": "We did our best to do a Dogmeat Cosplay!",
        "score": 1291,
        "url": "https://www.reddit.com/gallery/1dqup62",
        "content": "",
        "num_comments": 38,
        "comments": [
            "The fourth pic 😂 love it",
            "For maximum authenticity: train her to constantly run under your feet, and block your path through doorways and narrow corridors.",
            "She's such a cute little dog",
            "I opened this seeing Dogmeat, processing that it was cosplay, but still made it to the comments before I realized I wasn’t in r/awww. Edit: especially pic 4, clearly the best girl living her best life.",
            "This is adorable!!! I love it!! 😍❤️",
            "don’t let her around mariposa, but oh mah gah so PRECOUIS need to pet her,,,,,,",
            "Amazing, the first one in particular is fantastic. ",
            "Look how happy he looks with his little goggles 💜",
            "Is it a corgi- German Shepherd mix?",
            "must be a really good therapist dog cause this just made my day, thank you very much emzy. happy bday!"
        ]
    }
}