{
    "Weekly Fic Showcase - NEW RULES IN POST - June 28 - July 04": {
        "title": "Weekly Fic Showcase - NEW RULES IN POST - June 28 - July 04",
        "score": 11,
        "url": "https://www.reddit.com/r/FanFiction/comments/1dqfix4/weekly_fic_showcase_new_rules_in_post_june_28/",
        "content": "Welcome to the Weekly Fic Showcase!\n\nThis is a place for you to post ALL fics.  Both yours and ones you find that are worth sharing. \n\n**Rule Changes - Trial**\n\nWe are trialling some changes in the Weekly Fic Showcase. These changes are intended to make the WFS post easier to browse for readers and to ensure a consistent standard. These are as follows:\n\n* Submissions will need to be consolidated into **one comment**.\n\n* There will be a limit of **three fics/links** included in the comment, which includes both fics and recs.\n\n* **Additional info,** including chapter summaries, snippets, author's notes, etc, will now be limited to **300 words or less**.\n\n* **Please use wordcounter.net to check the length of your additional info.** Going forward, over 300 words in wordcounter.net will be removed. \n\n* Users are responsible for making sure their comments abide by the rules. If you update a comment after it has been removed, please let the mod know so that they can reapprove the comment.\n\n\n**Please label and separate \"My Fics\" from \"My Recs.\"**\n\nFormatting Example:\n\n**My Fics**    \nFandom -    \nRating - (Mandatory for fics rated Mature or Explicit)     \nTitle -    \nGenre -    \nOff-site link for ease of reading.  [AO3](http://archiveofourown.org/) or [FFN](https://www.fanfiction.net/) encouraged -    \nSummary -    \n\nAnything else you’d like to say to promote this fic.  This is your chance to sell it to the community, get excited! However, if sharing an excerpt, a reminder that NSFW plaintext will be removed. Please host NSFW excerpts on an external site and link with a warning. \n\n**My Recs**    \nFandom -    \nRating -    \n(etc)    \n\n***\n\nNew here?  [Check out our posting rules.](https://www.reddit.com/r/fanfiction/about/sidebar)\n\n***\n\nWant to support authors from the subreddit? [Here's](https://archiveofourown.org/collections/r_FanFiction_PromptChallenge) our AO3 showcase of fics written for various different prompts and challenges on the subreddit. Curious about the past?  [Here's](http://archiveofourown.org/collections/weeklyficshowcase) the AO3 collection.\n\n[Links](https://www.reddit.com/r/FanFiction/search?q=title%3A%22weekly+fic+showcase%22&restrict_sr=on&include_over_18=on&sort=new&t=all) to previous weeks.",
        "num_comments": 40,
        "comments": [
            "**My Fics**  \nFandom - Yu-Gi-Oh! Zexal  \nRating - Teen  \nTitle - I'm Not Saying It Was Aliens (But It Was Aliens)  \n[Ao3](https://archiveofourown.org/works/55621807)  \nSummary - Things go a little differently, and the Emperor's Key makes its way to someone else instead of Yuma.\n\nThis is a roleswap AU in which Michael gets the Emperor's Key instead of Yuma. Lots of Arclight bro interaction, planned on screen duels, eventual Michael/Yuma (Aztecshipping).\n\nFandom - Yu-Gi-Oh!, Pokemon Mystery Dungeon Explorers  \nRating - Teen  \nTitle - A Tale that Spans Time and Darkness  \n[Ao3](https://archiveofourown.org/works/45563497)  \nSummary - Sometimes an exploration team can be a tiny Shinx, a human turned ghostly Zorua, and two spirits, and that's okay.\n\nA crossover between Pokemon Mystery Dungeon Explorers and Yu-Gi-Oh. Features Ryou as the human turned Pokemon, Yugi as the partner Pokemon, and planned to include spinoff characters if that's your thing. I'm hoping to update this soon since I have most of a chapter written.",
            "**Fandom:** Harry Potter\n\n**Rating:** T\n\n**Title:** Cleaved (AO3 links to the first part of the series)\n\n**Genre:** Friendship/Adventure\n\n[AO3 link](https://archiveofourown.org/works/25313044/chapters/61370932) |\n[FFN link](https://www.fanfiction.net/s/13382072/1/Cleaved)\n\n**Summary:** By all rights, the story of Holly Potter and Alex Kann should have ended when they parted ways at age 11. Their destinies lay in different worlds: witch and Muggle; magic and science; Scotland and London. Then Alex came up with the idea of selling potions to Muggles. Their waning bond is revived, but can it last while running a nascent illegal business, the challenges of school and new relationships? Fem!Harry, Time-shifted AU, Pre-Hogwarts, Years 2-4.\n\n✨More details ✨\n\nSet in an AU that's moved closer to the present, Fem!Harry makes a friend at the age of seven. This Muggle friend has a Squib mother and she learns magic and the Wizarding world sooner than canon. The family has secrets of their own that she's not privy to, and it's all about Holly and Alex trying to maintain their unlikely friendship while running a \"potions for Muggles\" business.\n\nThis fic was inspired by a number of ideas: ones where wizards secretly sell magical items to Muggles, Harry/Muggle OC fics (and the lack of Fem!Harry/Muggle fics), Squib/Squib discrimination fics a la The Second String, fics where a witch or wizard (Muggle-born or half-blood) befriend Muggles in childhood, but instead of bailing on them at 11, they're let in on the secret, and a few more to be revealed. Starts the summer after 2nd year with flashbacks to pre-Hogwarts events.\n\n\n💫**Other Harry Potter fics (all rated T)**💫:\n\n**A Date With Destiny**\n\nGenre: Angst/Adventure\n\nAO3: https://archiveofourown.org/works/37456591/chapters/93476185\n\nFFN: https://www.fanfiction.net/s/14046756/1/A-Date-With-Destiny\n\nSummary: After awakening from a magical coma to discover his best friends now dating, Ronald Weasley sets out to forge his own path, discovering who he is by discovering who he isn't. Ron-centric fic, starts HHr, final pairings undecided.\n\n**A Grangerous Adventure**\n\nAO3: https://archiveofourown.org/works/28479831\n\nFFN: https://www.fanfiction.net/s/13784165/1/A-Grangerous-Adventure\n\nGenre: Parody/Romance\n\nSummary: Even when you're the brightest witch of your age like Hermione, some things are beyond your control. Keeping Harry alive and away from the Weasleys while maintaining her Prefect status is no easy task, and that's before a certain Weasley starts sneaking around with a Slytherin... Crack/Parody, H/Hr pairing. 5th-year subplot.\n\n\n**Tale of a Weasley Tail**\n\nAO3: https://archiveofourown.org/works/54672061\n\nSummary: After the events of Ron’s second year, the Weasleys go to Australia instead of Egypt. When a series of events leave Ron alone on Mako Island, and his only way out is through a shimmering pool on a full moon night, well…\n\nHe always wanted to stand out, didn’t he?\n\nMerman!Ron, AU after second year. Fusion with H2O: Just Add Water. Slow updates.",
            "**My Fic**\n\n**Fandom** - Aggressive Retsuko, Persona 5\n\n**Rating** - Mature (Graphic Depictions Of Violence, Major Character Death)\n\n**Title** - The Phantom Thieves of Rage (9-?, 108K words, ongoing long fic)\n\n**Genre** - Thriller, Drama, Hero's Journey\n\nLink - [Link To Fic](https://archiveofourown.org/works/51992320/chapters/131478853)  \nSummary - A crossover between Aggretsuko and Persona 5, where Retsuko, the wildcard, and a few friendly faces band together from Aggretsuko into their Phantom Thieves group and change the heart of distorted people!",
            "Title: Shattered \n\nFandom: Batman (all media types)\n\n\n\nSummary: AU: Jason, a few weeks after his return to Gotham and 2 and a half years after his resurrection, is struggling. Having revealed his identity to Bruce and Dick, knowing Tim replaced him as Robin (and son/ brother) and that Bruce not only didn’t kill Joker, but is also now actively stopping Jason from doing it, Jay loses it. Betrayed by those he loved the most, resentment and thirst of revenge engulfing him entirely, he is coping by not coping. When Batman encounters a scene of brutal massacre he knows Red Hood was behind, he seeks him out to confront him, only to find him in a broken catatonic state.\n\n\nStatus: Complete One-shot\n\nRating: T\n\nPairings: None/Gen\n\n\nWarnings: Alluded Suicidal Thoughts, Violence, Drug Use\n\n\n\nLinks: \n\n[AO3](https://archiveofourown.org/works/56953447)\n\n\n[FFNET](https://www.fanfiction.net/s/14368240/1/Shattered)",
            "**My Fic**  \nFandom: Bungo Stray Dogs  \nRating: Teen+  \nTitle: Found  \nGenre: Romance  \nAO3 link [here](https://archiveofourown.org/works/56834047/chapters/144501124)\n\nSummary: Jane (OC) is an unassuming young lady who fell in love with Kunikida. But after her confession is rejected, she instead catches the attention of another Armed Detective Agency member, Dazai, who, for some reason, wishes to keep her at the Agency. Will new love bloom between Jane and Dazai or will they be torn apart by circumstances and Dazai's eccentric personality?\n\n**I would especially like to recommend this to people who like Dazai but love Chuuya.** I update every day, \\~1k words per chapter.",
            "My Fic\n\nFandom: MLP fim \n\nRating: teen+\n\nTitle: the bet\n\nGenre: drama, alternative universe \n\nStatus: complete one shot \n\nLink: \nhttps://archiveofourown.org/works/55003549\n\nSummary: Twilight makes a bet with Celestia \n\n(.                                                                           .)\n\nMy other Fic\n\nFandom: MLP fim \n\nRating: Mature (for referenced child abuse and referenced non-con)\n\nTitle: Rainbow's pot of gold \n\nGenre: slice of life, hurt/comfort \n\nStatus: complete one shot \n\nLink: https://archiveofourown.org/works/33030628\n\nSummary: \nAfter Rainbow dash has a horrific accident that almost takes her life, she comes clean about a secret she's held for nearly eleven years. through her friend, Twilight, Rainbow is able to regain her \"pot of gold\"",
            "My Fic\n\nFandom: The Last of Us\n\nRating: M (**MCD**)\n\nTitle: What We Could Have Been\n\nGenre: Hurt/No Comfort\n\nLink: [AO3](https://archiveofourown.org/works/56964460)\n\nSummary: Bill reflects on his life, and on what he and Frank could have been in another.",
            "**My Fics**\r  \nFandom - Law an order SVU\r  \nRating - Teen\r  \nTitle - Finding the right way\r  \nGenre - crime drama \r  \nOff-site link for ease of reading. [AO3](https://archiveofourown.org/works/56722102/chapters/144193459)[FFN](https://www.fanfiction.net/s/14335824/1/finding-the-right-way)\r  \nSummary - Benson is called to a crime scene in the middle of the night - the murder of a young teenager it is the 5th one is as many weeks and they all seem linked in some way but it is a mystery as to how and why. as she tries to solve the crime and bring justice to the victims both living and dead she is also trying to navigate her blossoming relationship with Elliot and keeping it under wraps from the department for the time being",
            "**UPDATE AAAAAAAAH**  \n\n\n**My Fic**  \n\n\n**Fandom** - Dungeons and Dragons  \n\n\n**Rating** - Teen (Graphic Violence)  \n\n\n**Title** - A Night of Sinister Secrets is no Secret  \n\n\n**Genre** - Fantasy  \n\n\n**Status** - Complete  \n\n\n**Length** - 4.8k words/5 Chapters  \n\n\n**AO3 link** - [A Night of Sinister Secrets is no Secret - Chapter 1 - FrogAtRest - Dungeons & Dragons (Roleplaying Game) \\[Archive of Our Own\\]](https://archiveofourown.org/works/56983942/chapters/144908344)  \n\n\n**Summary** - Led by their need for gold, a ragtag trio of childhood friends turned adventurers end up taking a mission considered a lost cause by many.  \n\n\nLittle did they know what they would come up against.  \n\n\n Loosely based (setting-wise) on the Sinister Secret of Saltmarsh/Ghosts of Saltmarsh adventure modules.   \n\n\n**Read if you** - Like fantasy adventure, a quick, punchy read, bantering/semi-dysfunctional adventurer trios and DnD  \n\n\nThe second installment of my Dungeons and Dragons Adventures series. I hope you enjoy!",
            "**My Fic**\n\nFandom - My Hero Academia/Demon Slayer\n\nRating - T \n\nTitle - Demon? I'm just trying to buy milk!\n\nGenre - Adventure, Time/dimensional travel\n\nLink - https://archiveofourown.org/works/40698297/chapters/101975406\n\nSummary - Izuku's attempt to purchase milk somehow takes him hundreds of years in the past in the gruesome world of Demon Slayer. As a hero, he of course takes it upon himself to save as many lives as he can! If only people would stop calling him a demon...\n\nThis is a bit more serious than the title would suggest, I swear XD though still some humor here and there."
        ]
    },
    "Daily Discussion - Saturday, June 29 | r/FanFiction Rules, FAQs, Weekly Schedule & Current Event Threads": {
        "title": "Daily Discussion - Saturday, June 29 | r/FanFiction Rules, FAQs, Weekly Schedule & Current Event Threads",
        "score": 4,
        "url": "https://www.reddit.com/r/FanFiction/comments/1dr7epf/daily_discussion_saturday_june_29_rfanfiction/",
        "content": "# Welcome to r/FanFiction, I love you!\n\n***\n\nNew to this subreddit? Here are links to get you started: [**Rules & Overview**](https://www.reddit.com/r/FanFiction/comments/jshhhb/newbies_start_here_sub_rules_events/) **|** [**Wiki**](https://www.reddit.com/r/FanFiction/wiki/index) **|** [**FAQs**](https://www.reddit.com/r/FanFiction/wiki/faq)\n\nGot a fic to promote? Click [HERE](https://www.reddit.com/r/FanFiction/search?q=title%3A%22weekly+fic+showcase%22&restrict_sr=on&include_over_18=on&sort=new&t=all) to find the current **Weekly Fic Showcase** thread\n\n***\n\n# Current Events\n\n**Click for today's scheduled threads:**\n\n* [Concrit Commune](https://www.reddit.com/r/FanFiction/search?q=concrit%20commune&restrict_sr=1&sort=new) - Trade feedback on pieces of your fic.\n* [Writing Weekends](https://www.reddit.com/r/FanFiction/search?q=%22writing%20weekends%22&restrict_sr=1&sort=new) - Your weekend plans writing-wise.\n* Thursday's [Beta Bartering](https://www.reddit.com/r/FanFiction/search?q=title%3A%22beta%20bartering%20find%22&restrict_sr=1&sort=new) \\- Find a Beta or co-writer, Offer Beta Services\n* The full Weekly Schedule can be found [HERE](https://www.reddit.com/r/FanFiction/comments/jshhhb/newbies_start_here_sub_rules_events/)\n\n**Don't forget to participate in our special events:**\n\n* Need a new fic idea, or have one to share? >[Visit this month's Plot Bunny Adoption Thread!](https://www.reddit.com/r/FanFiction/comments/1d5j88d/plot_bunny_adoption_thread_june_2024/)<\n* Struggling with research for your fic? >[Ask a question or check out the experts in our Ask the Experts thread!](https://www.reddit.com/r/FanFiction/comments/1d5j88j/ask_the_experts_june_2024/)<\n* What's up with the sub? Come and share your fanfiction goals and updates in this month's >[Member Roundup.](https://www.reddit.com/r/FanFiction/comments/1d5j87m/member_roundup_june_2024/)<\n* And make sure to check out all the responses to last month's >[May Challenge!](https://www.reddit.com/r/FanFiction/comments/1d5jcnn/prompts_challenge_round_41_may_2024_post/)<\n\n***\n\nGot a question or concern? Feel free to [message the mod team](https://www.reddit.com/message/compose?to=/r/FanFiction).",
        "num_comments": 32,
        "comments": [
            "It seems like AO3 will be down for ten hours on Monday. Perhaps we could have an activity thread? Or maybe we could allow memes for ten hours XD any suggestions? Not that people wither and die.\n\nI need to put aside my current WIP and start writing my untagged fest fic. I can't do to WIPs at once, and the latter has a deadline 🫣 but I can't find a good place to pause writing the current fic.",
            "Yesterday I suddenly found myself thinking of ideas for a soulmate/siren AU that was meant to be a oneshot that has now turned into a multi-chapter fic >.< I wonder if it’ll get longer somehow!!\n\nAlso, still weird to me that I’ve graduated from college and now four years of my life are just over like that 🫰it just doesn’t feel real still!!",
            "\"If you want others to be happy, practice ~~compassion~~ **wordcount**. If you want to be happy, practice ~~compassion~~ **wordcount**.\"\n\nTenzin Gyatso, His Holiness the 14th Dalai Lama",
            "I'm back from my Painful Hike! 3 days, 45km, 15kg bag and no internet. I would say that I've become better friends with the 5 other people I did it with, and also that I've experienced a weird confidence boost. I'm not very strong so when we took breaks halfway up a hill it was usually my fault, but when I apologised (I have an unhealthy tendency to apologise for legitimately everything) they just said it was fine. Which was nice. The sense of achievement (and also of being able to sleep in an actual bed in an actual house) is great. I didn't get many ideas out there, unfortunately, but I did manage to nearly finish that difficult chapter I've been working on on the bus back yesterday. I managed to put in a hug scene, which was awesome because I cannot get enough hugs. And it wasn't even ooc!\n\nI got back to 3 new kudos and hits going into the triple digits for my first fic, so that was good too! Just posted the next chapter!",
            "I'm working through my Judas Priest WIP, and I'm kinda going supernatural, where one of the characters is in a coma , and now he is viewing his own funeral, if he didn't make it, it's weird. I hope to get the funeral done this weekend.",
            "I'm telling myself I'm not supposed to be on AO3 during the down hours *anyway* so it's fine...but is it really fine. \n\nShoot, I just stop wherever I happen to be. Then when I come back I'll retype some stuff to get back in the mind of where I left off.",
            "You could've turned it around on them. \"Wow, what kind of sick, perverted car are you trying to sell me here?\"",
            "Oh god that would have been so painful.",
            "Agree that hand-writing is bleh, but desperate times, desperate measures? xD",
            "Pat pat. I can only say take it as a motivation to fill the fandom space with your fic. If there is none that can scratch the itch, you scratch it yourself.\n\nIt was how I started too lol"
        ]
    },
    "\"Give me recs NOW 🤬\" [Light rant]": {
        "title": "\"Give me recs NOW 🤬\" [Light rant]",
        "score": 86,
        "url": "https://www.reddit.com/r/FanFiction/comments/1dr6w2a/give_me_recs_now_light_rant/",
        "content": "I know Ao3 can be weird if you're new to it; it's one of the few popular sites that is extremely straightforward, with no algorithm, fancy layout, \"Explore Page\", ads, etc, and that straightforwardness can actually throw people off!\n\nBut dear Lord, why aren't people even trying to figure it out first? I understand wanting fic recs and I understand if you're looking for something rare/obscure or very specific and not easily found via tags. \n\nBut \"omg help I can't find any Harry Potter Enemies to Lovers\" or \"smh, no one seems to write [tag/ship that has at least 2,000 fics on Ao3]\". Then there's the subtle sex-negative \"does no one write stuff without smut??\" as of majority of Ao3 fics aren't General/Teen Audiences (yes, I checked the numbers).\n\nI guess I just wish that people were more curious and took the initiative to learn how to navigate the filters to find stuff instead of acting as if we're fic rec generators or something. I know I sound cranky, but I've lost count of the amount of frantic posts I've seen where people are like \"I can't find this fic anywhere, HELP\" only for me to find it within minutes by just entering a few keywords and tags to find it. And I've only been a member for 6 years.\n\nTL;DR: There's nothing wrong with wanting fic recs, but you can definitely just browse the site, play around with filters/tags, and find stuff on your own too.",
        "num_comments": 25,
        "comments": [
            "My biggest pet peeve is people saying \"I've just read [fandom's most popular fic], please give me something similar and/or equally popular!\" Like, yeah, the fic is fine in and of it self but other fics will never have a chance if we just keep recommending the same 5 fics ad nauseum. Especially when some of them are quite AU/OOC, which again is fine in and of itself, but has now led to an entire subfandom lauding these headcanons/characterisations as actual canon.\nFor the love of God, people, try to shape your own taste. Have a look around AO3. You'll discover so much gold. (Just don't sort by kudos!).",
            "Maybe I'm just old, but the process of searching for fics is part of what I love! I choose my fandom and ship(s), include and exclude depending on my mood, then I spend an hour going through the results. I read tags, summaries, sometimes the first few paragraphs... Then I set my bookmarks and enjoy later.",
            "Tbf gen fics can be difficult to find sometimes (even with adequate filters - trust me, I've tried). There always tends to be some sort of romance tie in and that's not always what people are looking for. I don't think that's meant as a criticism towards people who read or write smut/romantic content and it seems a little unfair to assume people are trying to inadvertently shame people through asking for recs.",
            "As someone who mostly reads from recs and keeps extensive rec lists, I can't relate 🤣 Okay, the wording of \"omg help I can't find any Harry Potter Enemies to Lovers\" is dramatic, but if I want to read a Harry Potter enemies to lovers, rather than sieving through thousands of fics, I would also just ask for recommendations. It's great that we have this community where people can spread the words about things they enjoyed reading. Besides, you get to talk to people about common fics that you read. Sometimes when I give recommendations, people come back and tell me how much they enjoyed it. This is a kind of interaction you can't have if you just look for fics on your own.\n\nI sometimes also roll my eyes when people have too specific or unrealistic wishes, or dramatic wording, but, again. Not every post is for me. I just scroll past.",
            "I don't mind those so much as they can give me the chance to plug my own fics (or others) when they fit the description.",
            "If people don't want to read smut and are finding a lot of it in their fandom, then it is valid for them to question what people are writing. There is no need to shame *anyone* for that. Smut is popular in fanfiction, after all.\n\nThen there is the fact that there are times when people just don't want to sort through possibly thousands of fics and just want some quick recs from others. I mean, where would fanfiction be without recs? The genre has thrived off it historicaly.",
            "It might just be because I'm sick, but I don't see the problem here. If anything, I think you significantly misunderstand what asking for fic recs is all about.",
            "Sometimes I just search fics and I don’t even read them lol",
            "There's a big difference between \"I'm looking for fics w/o smut or romance\" and the posts/comments about how \"no one writes non smut fics anymore\" and the complaints that only smut fics are popular. I see these things often. \n\nI do agree that the Gen tag is often not used properly, as well as people not knowing / vs &.",
            "Fanfiction would be just fine without these rec requests."
        ]
    },
    "Don't Start Your Fic by Apologizing": {
        "title": "Don't Start Your Fic by Apologizing",
        "score": 476,
        "url": "https://www.reddit.com/r/FanFiction/comments/1dqvxww/dont_start_your_fic_by_apologizing/",
        "content": "You wrote something, and you're letting people read it for free with no obligation. DON'T APOLOGIZE. Don't start with \"This is my first story so sorry if the writing is bad\" or \"Sorry for any typos, English isn't my first language\" or \"Sorry I know you're probably sick of this pairing but I just couldn't let this plot bunny go\"\n\nJust start your story. If people don't like it they can bounce. You don't owe them anything.\n\nIf you need a reason for my stance here, think of the young person reading your story and thinking about writing their own. \\*They\\* think your writing is brilliant, but then they see your disclaimer at the top. And suddenly the doubt creeps in... this writing is so much better than mine... if my current fave is apologizing for her bad writing, I probably shouldn't post my stuff at all, it's so much worse\n\nSo just post your story, no apologies, no disclaimers, just the awesome stuff you wrote.",
        "num_comments": 86,
        "comments": [
            "Okay, but like...what about the \"sorry, no beta\" thing? I've come across it MANY times and it never deters me from reading something. It just reminds me that the author is one person and mistakes are bound to leak through no matter how many times they've edited. That doesn't mean they don't care or don't have confidence in their writing or that their work isn't worth giving a chance.\n\nAnd although I agree with the sentiment of having pride in your writing without apologizing, it seems that based off of some of these comments, I (personally) think that some readers can be ridiculously hypercritical.",
            "My mentor told me this when I was still articling: \"no one (especially a client) wants a lawyer who opens up to the judge with, 'sorry, this is my first time, I might not be good at this.'  It immediately undermines you in front of your audience.\"\n\nFake it 'til you make it.  I think most people are definitely guilty of it at some point, but you just have to take the plunge.",
            "Yes... except for when they say English isn't my first language because most of the time that is an indicator for me that it is gonna be most likely brilliant.",
            "I automatically believe you. If you think it's bad enough to apologize for it, that tells me I shouldn't read it.",
            "hard agree. it’s a big pet peeve of mine",
            "This, and also, just own your writing in general and don't apologize or call your own writing bad. It's off-putting to the readers and you're bringing down your own self-esteem for no real reason.",
            "It’s a common defense mechanism of amateur writers who are just starting out. It’s hard putting stuff out in front of strangers, especially when you know just enough to know you’re not amazing. They think if they denigrate it first, then it will protect them from criticism and make them feel less vulnerable in front of their audience. Fortunately most grow out of it eventually.",
            "Go in the other direction. Sorry, my fic will keep you up all night. Say goodbye to your sleep schedule.",
            "Another type of apology I've seen sometimes is like \"Sorry I wrote this at 3am while high and drunk\" type of stuff. I definitely didn't need to know that. That makes it sound like a low-effort mess, so, of course I'm not going to read it. Then again, maybe it is a low-effort mess. I guess I'll never know.",
            "I like when people introduce their fics like a villain. Subject us poor mortals to your strange and niche interests, then take the unsuspecting readers as thralls, blast us with the plot beam and kick us down the cliffhanger lmao"
        ]
    },
    "What is the most chaotic thing you wrote without giving me the context?": {
        "title": "What is the most chaotic thing you wrote without giving me the context?",
        "score": 25,
        "url": "https://www.reddit.com/r/FanFiction/comments/1dr8gyw/what_is_the_most_chaotic_thing_you_wrote_without/",
        "content": "Mine has to be \"Toph, why did you put statues of random things inside of stores?\"",
        "num_comments": 40,
        "comments": [
            "> Sero is halfway through explaining to the yakuza members why raiding the Commission headquarters in order to prevent the apocalypse is a good idea when half the wall explodes.",
            "How chaotic is making chloroform in the backyard? Asking for a friend.",
            "He went to kfc and shat himself to death.",
            "*Most* chaotic? Possibly the MC trying to check into a hotel, but the concierge had lost the ability to perceive the passing of time.",
            ">Viktor, still trying to process the information, had completely forgotten about the dog under his arm. A passer-by said something, to which César replied with an apology.\n\n>“You may want to remove the petrification spell on that dog,\" César told him. \"It’s making people nervous.”",
            "Mad scientists writing the worst research paper ever made of their unethical human experimentation on their lab rats/“adopted” little siblings/kidnapping and torture victims",
            "Gay ACNH characters burying a body in a wooded area. It was during the quarantine.",
            "Bunch of people die mid-fight but they don't get to stop.",
            "A bite kink in a zombie apocalypse :D",
            "*How was Minho supposed to say that he was watching Kaichou wa Maid-sama, when Jisung, his Jisung, kissed him and he freaked out and died (?) on a wet floor?*\n\nHe didn't even die. He's just very confused. The floor is innocent."
        ]
    }
}