{
    "Weekly Fic Showcase - NEW RULES IN POST - June 28 - July 04": {
        "title": "Weekly Fic Showcase - NEW RULES IN POST - June 28 - July 04",
        "score": 11,
        "url": "https://www.reddit.com/r/FanFiction/comments/1dqfix4/weekly_fic_showcase_new_rules_in_post_june_28/",
        "content": "Welcome to the Weekly Fic Showcase!\n\nThis is a place for you to post ALL fics.  Both yours and ones you find that are worth sharing. \n\n**Rule Changes - Trial**\n\nWe are trialling some changes in the Weekly Fic Showcase. These changes are intended to make the WFS post easier to browse for readers and to ensure a consistent standard. These are as follows:\n\n* Submissions will need to be consolidated into **one comment**.\n\n* There will be a limit of **three fics/links** included in the comment, which includes both fics and recs.\n\n* **Additional info,** including chapter summaries, snippets, author's notes, etc, will now be limited to **300 words or less**.\n\n* **Please use wordcounter.net to check the length of your additional info.** Going forward, over 300 words in wordcounter.net will be removed. \n\n* Users are responsible for making sure their comments abide by the rules. If you update a comment after it has been removed, please let the mod know so that they can reapprove the comment.\n\n\n**Please label and separate \"My Fics\" from \"My Recs.\"**\n\nFormatting Example:\n\n**My Fics**    \nFandom -    \nRating - (Mandatory for fics rated Mature or Explicit)     \nTitle -    \nGenre -    \nOff-site link for ease of reading.  [AO3](http://archiveofourown.org/) or [FFN](https://www.fanfiction.net/) encouraged -    \nSummary -    \n\nAnything else you’d like to say to promote this fic.  This is your chance to sell it to the community, get excited! However, if sharing an excerpt, a reminder that NSFW plaintext will be removed. Please host NSFW excerpts on an external site and link with a warning. \n\n**My Recs**    \nFandom -    \nRating -    \n(etc)    \n\n***\n\nNew here?  [Check out our posting rules.](https://www.reddit.com/r/fanfiction/about/sidebar)\n\n***\n\nWant to support authors from the subreddit? [Here's](https://archiveofourown.org/collections/r_FanFiction_PromptChallenge) our AO3 showcase of fics written for various different prompts and challenges on the subreddit. Curious about the past?  [Here's](http://archiveofourown.org/collections/weeklyficshowcase) the AO3 collection.\n\n[Links](https://www.reddit.com/r/FanFiction/search?q=title%3A%22weekly+fic+showcase%22&restrict_sr=on&include_over_18=on&sort=new&t=all) to previous weeks.",
        "num_comments": 40,
        "comments": [
            "**My Fics**  \nFandom - Yu-Gi-Oh! Zexal  \nRating - Teen  \nTitle - I'm Not Saying It Was Aliens (But It Was Aliens)  \n[Ao3](https://archiveofourown.org/works/55621807)  \nSummary - Things go a little differently, and the Emperor's Key makes its way to someone else instead of Yuma.\n\nThis is a roleswap AU in which Michael gets the Emperor's Key instead of Yuma. Lots of Arclight bro interaction, planned on screen duels, eventual Michael/Yuma (Aztecshipping).\n\nFandom - Yu-Gi-Oh!, Pokemon Mystery Dungeon Explorers  \nRating - Teen  \nTitle - A Tale that Spans Time and Darkness  \n[Ao3](https://archiveofourown.org/works/45563497)  \nSummary - Sometimes an exploration team can be a tiny Shinx, a human turned ghostly Zorua, and two spirits, and that's okay.\n\nA crossover between Pokemon Mystery Dungeon Explorers and Yu-Gi-Oh. Features Ryou as the human turned Pokemon, Yugi as the partner Pokemon, and planned to include spinoff characters if that's your thing. I'm hoping to update this soon since I have most of a chapter written.",
            "**Fandom:** Harry Potter\n\n**Rating:** T\n\n**Title:** Cleaved (AO3 links to the first part of the series)\n\n**Genre:** Friendship/Adventure\n\n[AO3 link](https://archiveofourown.org/works/25313044/chapters/61370932) |\n[FFN link](https://www.fanfiction.net/s/13382072/1/Cleaved)\n\n**Summary:** By all rights, the story of Holly Potter and Alex Kann should have ended when they parted ways at age 11. Their destinies lay in different worlds: witch and Muggle; magic and science; Scotland and London. Then Alex came up with the idea of selling potions to Muggles. Their waning bond is revived, but can it last while running a nascent illegal business, the challenges of school and new relationships? Fem!Harry, Time-shifted AU, Pre-Hogwarts, Years 2-4.\n\n✨More details ✨\n\nSet in an AU that's moved closer to the present, Fem!Harry makes a friend at the age of seven. This Muggle friend has a Squib mother and she learns magic and the Wizarding world sooner than canon. The family has secrets of their own that she's not privy to, and it's all about Holly and Alex trying to maintain their unlikely friendship while running a \"potions for Muggles\" business.\n\nThis fic was inspired by a number of ideas: ones where wizards secretly sell magical items to Muggles, Harry/Muggle OC fics (and the lack of Fem!Harry/Muggle fics), Squib/Squib discrimination fics a la The Second String, fics where a witch or wizard (Muggle-born or half-blood) befriend Muggles in childhood, but instead of bailing on them at 11, they're let in on the secret, and a few more to be revealed. Starts the summer after 2nd year with flashbacks to pre-Hogwarts events.\n\n\n💫**Other Harry Potter fics (all rated T)**💫:\n\n**A Date With Destiny**\n\nGenre: Angst/Adventure\n\nAO3: https://archiveofourown.org/works/37456591/chapters/93476185\n\nFFN: https://www.fanfiction.net/s/14046756/1/A-Date-With-Destiny\n\nSummary: After awakening from a magical coma to discover his best friends now dating, Ronald Weasley sets out to forge his own path, discovering who he is by discovering who he isn't. Ron-centric fic, starts HHr, final pairings undecided.\n\n**A Grangerous Adventure**\n\nAO3: https://archiveofourown.org/works/28479831\n\nFFN: https://www.fanfiction.net/s/13784165/1/A-Grangerous-Adventure\n\nGenre: Parody/Romance\n\nSummary: Even when you're the brightest witch of your age like Hermione, some things are beyond your control. Keeping Harry alive and away from the Weasleys while maintaining her Prefect status is no easy task, and that's before a certain Weasley starts sneaking around with a Slytherin... Crack/Parody, H/Hr pairing. 5th-year subplot.\n\n\n**Tale of a Weasley Tail**\n\nAO3: https://archiveofourown.org/works/54672061\n\nSummary: After the events of Ron’s second year, the Weasleys go to Australia instead of Egypt. When a series of events leave Ron alone on Mako Island, and his only way out is through a shimmering pool on a full moon night, well…\n\nHe always wanted to stand out, didn’t he?\n\nMerman!Ron, AU after second year. Fusion with H2O: Just Add Water. Slow updates.",
            "**My Fic**\n\n**Fandom** - Aggressive Retsuko, Persona 5\n\n**Rating** - Mature (Graphic Depictions Of Violence, Major Character Death)\n\n**Title** - The Phantom Thieves of Rage (9-?, 108K words, ongoing long fic)\n\n**Genre** - Thriller, Drama, Hero's Journey\n\nLink - [Link To Fic](https://archiveofourown.org/works/51992320/chapters/131478853)  \nSummary - A crossover between Aggretsuko and Persona 5, where Retsuko, the wildcard, and a few friendly faces band together from Aggretsuko into their Phantom Thieves group and change the heart of distorted people!",
            "Title: Shattered \n\nFandom: Batman (all media types)\n\n\n\nSummary: AU: Jason, a few weeks after his return to Gotham and 2 and a half years after his resurrection, is struggling. Having revealed his identity to Bruce and Dick, knowing Tim replaced him as Robin (and son/ brother) and that Bruce not only didn’t kill Joker, but is also now actively stopping Jason from doing it, Jay loses it. Betrayed by those he loved the most, resentment and thirst of revenge engulfing him entirely, he is coping by not coping. When Batman encounters a scene of brutal massacre he knows Red Hood was behind, he seeks him out to confront him, only to find him in a broken catatonic state.\n\n\nStatus: Complete One-shot\n\nRating: T\n\nPairings: None/Gen\n\n\nWarnings: Alluded Suicidal Thoughts, Violence, Drug Use\n\n\n\nLinks: \n\n[AO3](https://archiveofourown.org/works/56953447)\n\n\n[FFNET](https://www.fanfiction.net/s/14368240/1/Shattered)",
            "Here's my newest! I posted Chapter 51 this week. I update weekly. \n\n**Title-** The Stray\n\n**Rating-** Mature (language)\n\n**Fandom-** My Hero Academia \n\n**Genre-** Slowburn, hurt/comfort, found family\n\n**Link-**\nhttps://archiveofourown.org/works/41473140/chapters/104007150\n\n**Summary-**\nEven though she followed the orders of one, Riyama wasn't a villain. She was a pawn, with no one to care for her or a life of her own to live. After being forced to apply to U.A. and gain the trust of its faculty members, one of them in particular offered her more than just a place to rest her head.\n\nAizawa, on the other hand, thought he was just taking in a stray off the streets who was cold and looked hungry. He never imagined that she was associated with The League of Villains. Or that she wasn’t actually a cat.\n\nWill Riyama be able to tell him the truth before it's too late?",
            "**My Fics:** \n\nFandom: The Walking Dead  \n\nRating: Explicit  \n\nTitle: Grubbing in Ashes \n\nGenre: Romance, Apocalypse, Action, Slow Burn, Found Family \n\nOff-site link: [AO3](https://archiveofourown.org/works/51113659/chapters/129143617)\n\nSummary:  My mother's timeless wisdom wove through the fabric of my thoughts. Her words echoed in my mind, a gentle reminder that fated souls have a way of finding each other, even if their journey takes unexpected turns and tests the limits of patience. Our tale unfolded amidst the backdrop of a world on the brink of collapse, where our paths collided like two pieces of a broken puzzle. It was then that I understood – you were destined to be my weakness.  \n\nIn a world unraveling into chaos, Katrina Brooks finds herself ill-prepared for the end of the world. Never in her wildest dreams did she envision a reality where the dead would rise to eat the living. But fear and despair become her constant companions in a world where she wore the stench of death like a noxious perfume. In the crumbling remnants of the world, the shadows cast by humanity's darkest depths come to light—an unsettling reality Kat grapples with directly. Alone, starved, and on the run, she desperately clings to the tattered remnants of her father's plan. Navigating the perilous landscape she finds herself thrust into an unforeseen alliance with a rugged redneck. \n\nStatus: Ongoing (currently **31** Chapters posted)",
            "**My Fic**  \nFandom: Bungo Stray Dogs  \nRating: Teen+  \nTitle: Found  \nGenre: Romance  \nAO3 link [here](https://archiveofourown.org/works/56834047/chapters/144501124)\n\nSummary: Jane (OC) is an unassuming young lady who fell in love with Kunikida. But after her confession is rejected, she instead catches the attention of another Armed Detective Agency member, Dazai, who, for some reason, wishes to keep her at the Agency. Will new love bloom between Jane and Dazai or will they be torn apart by circumstances and Dazai's eccentric personality?\n\n**I would especially like to recommend this to people who like Dazai but love Chuuya.** I update every day, \\~1k words per chapter.",
            "My Fic\n\nFandom: MLP fim \n\nRating: teen+\n\nTitle: the bet\n\nGenre: drama, alternative universe \n\nStatus: complete one shot \n\nLink: \nhttps://archiveofourown.org/works/55003549\n\nSummary: Twilight makes a bet with Celestia \n\n(.                                                                           .)\n\nMy other Fic\n\nFandom: MLP fim \n\nRating: Mature (for referenced child abuse and referenced non-con)\n\nTitle: Rainbow's pot of gold \n\nGenre: slice of life, hurt/comfort \n\nStatus: complete one shot \n\nLink: https://archiveofourown.org/works/33030628\n\nSummary: \nAfter Rainbow dash has a horrific accident that almost takes her life, she comes clean about a secret she's held for nearly eleven years. through her friend, Twilight, Rainbow is able to regain her \"pot of gold\"",
            "My Fic:\n\nFandom: Dishonored (Video Game)\n\nRating: Explicit\n\nTitle: Sea Salt and Void Ash\n\nGenre: Romance (M/F, M/M, eventual polyamory), Time Travel, Enemies to Friends to Lovers, Slow Burn\n\nOff-site link: [https://archiveofourown.org/works/47076697/chapters/118603006](https://archiveofourown.org/works/47076697/chapters/118603006)\n\nSummary: \n\nCorvo wrenched back from Jessamine. “What day is it?”\n\nShe blinked at him, clearly struggling to catch up with his strange behavior. “The second of the Month of Clans. Corvo, are you feeling alright? What’s wrong?”\n\nThe breath punched out of his lungs. “It’s 1836?” *I have many powers and abilities.* Corvo’s ears rang with the echo of whale song. It wasn’t actually possible, was it? And yet, was the proof not right there in his arms?\n\n\\[*Corvo Attano's world crumbled into ash the day the assassin, Daud, murdered his Empress, and nothing has been right in it since. When the Outsider steps in to change fate for his favored Marked, Corvo will stop at nothing to make sure the second chance isn't wasted. With all his memories from the erased time, Corvo and Jessamine must work in secret with few allies to foil the Spymaster's plot, but that means the infamous Knife of Dunwall must be dealt with. To protect Jessamine, Corvo will do anything--even work alongside the one man he hates above all others.*\\]",
            "**My Fics**\r  \nFandom - Law an order SVU\r  \nRating - Teen\r  \nTitle - Finding the right way\r  \nGenre - crime drama \r  \nOff-site link for ease of reading. [AO3](https://archiveofourown.org/works/56722102/chapters/144193459)[FFN](https://www.fanfiction.net/s/14335824/1/finding-the-right-way)\r  \nSummary - Benson is called to a crime scene in the middle of the night - the murder of a young teenager it is the 5th one is as many weeks and they all seem linked in some way but it is a mystery as to how and why. as she tries to solve the crime and bring justice to the victims both living and dead she is also trying to navigate her blossoming relationship with Elliot and keeping it under wraps from the department for the time being"
        ]
    },
    "Reading Rollcall: What was the Best Fic you read this week?": {
        "title": "Reading Rollcall: What was the Best Fic you read this week?",
        "score": 17,
        "url": "https://www.reddit.com/r/FanFiction/comments/1dqlovy/reading_rollcall_what_was_the_best_fic_you_read/",
        "content": "Welcome to this week's Reading Rollcall!\n\nThis thread is a place to share a fanfiction you're currently reading or have read this week. This can be used as an interactive rec thread - a place to simply share a story you've loved or to have a deeper discussion about it.\n\n**The Rules:**\n\n* State the Fandom | Rating | Any Applicable Content Warnings | Link to fic at the top of your comment! **Links with no information on Fandom and/or Warnings will be removed.** Please see the subreddit rules on content restrictions if you're unsure.\n* Play fair. Comments and discussion must be civil. Authors can find where their fics are linked with relative ease, so assume they're going to read what you've written.\n* If you see someone talking about a fic that looks interesting, ask them questions. If you've read a fic and recognize it, have a chat with your fellow users!\n\n**Feel free to add:**\n\n* A short summary or some hype for the fic to give people some context for your discussion.\n* Any discussion of the tropes, the characters, the setting, the plot, the themes.\n* Your interpretations and headcanons room to run. Theories and guesses are completely valid forms of discussion.\n\nHappy Reading!!",
        "num_comments": 19,
        "comments": [
            "[Columbo in...On With the Show](https://archiveofourown.org/works/56758363) by MadameHedgehog\n\nFandoms:  Columbo, The Muppet Show\n\nSummary:  Muppet Theater experiences an unfortunate accident during their latest performance. But Lt. Columbo is convinced this was no accident. Jim Carrey, Willem Dafoe, and The Muppets guest star.\n\nThis one's a wild ride from start to finish, but it's brilliant and fun despite the murders.  This same author also wrote a Columbo/Scooby-Doo crossover that's equally entertaining.",
            "https://archiveofourown.org/works/56822230\n\nWar (2019) | T | No Warnings | M/M | WIP\n\nFor all the hurt/comfort fans! It has a rare trope I'm nuts about, where one character is being rescued but is certain that it's just a hallucination and not actually happening. Full disclosure, I'm reading this one fandom blind (subbed to the author cuz they wrote for my favorite ship before), but so far I haven't really had problems following along.",
            "Stray Kids | Explicit | RPF, AU, Reverse Sugar Daddy, Age gap | [The Pursuit of Happiness](https://archiveofourown.org/works/55591048) - MyReasonsToLiveAreDwindling, TeamAlphaQ\n\nSummary: Chan lives a decent life, even if it's lacking a little. Seungmin looks a little like a too good to be true remedy to that lack served to him on a silver platter. But is it so bad to want to be wanted?\n\nHonestly blown away by this gem, an instant favorite and sure to be a personal classic over time. A fine balance between funny and (very) hot!",
            "[This one!](https://archiveofourown.org/works/11438958/chapters/25633806) It's a Dear Evan Hansen-IT au!! I don't like DEH that much, but god this fic is good. All the characters are written very well, and it can be read fandom-blind on either side of IT or DEH likers (though no IT characters show up aside from the clown- it's more the DEH characters are the Loser's Club. Probably a little harder to read fandom blind on the DEH side, though I'm pretty sure you could). Genuinely great! Check it out if you like scary/creepy fics with queer romance (both f/f and m/m) with discussions of mental illness and a good helping of freaky clowns.  \nTrigger warnings are at the top of each chapter and tagged appropriately, but for safety's sake: Blood, gore, intrusive thoughts, self harm and suicide, paranoia, body horror, and dissociation. It's pretty rough, so read the tags if you check it out.",
            "Fallout 3/4 | Explicit Violence | Angst: PTSD, Depression, similar mental health issues, and grieving | [Long Time Running - Chapter 1 - twosidessamecoin - Fallout 4 \\[Archive of Our Own\\]](https://archiveofourown.org/works/37856494/chapters/94530430)\n\nUser u/dinosaurflex was kind enough to show me a Fallout work featuring MacCready, a very popular and liked Fallout 3/4 character, going out of the established canon area (I think...) on a road trip most of the way across the continent to the Rocky Mountains. I'm not done, but what I have read is good. MacCready is shown in a believable and respectful light, and has motivation so relatable (saving his family) it's heartbreaking at times. The new friendlies are well-written, the enemies are complicated, and the setting is very well portrayed. If I'm reading this correctly it's a 115k completed work, I'm on chapter 3 of 12 so far, but I see no reason I won't finish.",
            "Batman(all media types) /T/G/suicidal thoughts +drug use \n\n\nI randomly found this on tumblr today and it's the best Jason Todd centric  fic I've read in a while. Equal parts deep, punchy, gutting, heartbreaking. \n\n\nI love that it handles Jay's character with integrity. As in, he doesn't cry and run into batfam's arms. In fact he flips them off and leaves. I also loved his suicidal thoughts and drug use (the opening scene where we see him returnibg from a killing spree to use is my favorite). \n\nIt's an one-shot. Awesome dialogue and prose. Check it out if you're into the fandom. \n\n\n[Shattered](https://archiveofourown.org/works/56953447)",
            "https://archiveofourown.org/works/46816222/chapters/144341125#workskin\nStranger Things, Stoncy, Teen, Whump, Implied/Refrenced Child Abuse, Steve Harrington In The Upside Down, medical examinations. ",
            "[A Devine (Romantic) Comedy](https://archiveofourown.org/works/53670892/chapters/135863227) by Dystopian_God\n\nFandoms: The Owl House, Hazbin Hotel, Helluva Boss\n\nRating: Teen and Up\n\nWarnings: N/A\n\nChapters: 32/?\n\nWord Count: 170,359\n\nSummary: \n\n>Depression is a horrible thing, all consuming and crushing. So when a failed attempt to cheer him up by the Six Sins leads Lucifer Morningstar, lord of the Seven Circles of Hell and Rubber Duck Enthusiast, into a random bar in a random city the last thing he's expecting is to strike up a conversation with someone who understands the pain of lost love.\n>\n>Naturally, things quickly spiral out of hand as Lucifer, now Lucius Magne, tries to date the lovely Camila Noceda while hiding his true nature, completely unaware that Camila is doing the exact same thing with the true nature of her daughters college... and her other daughters species. Add in some troublesome earth-bound imps, Some troublesome Sins trying to 'help' him, and trying to run an entire dimension sized kingdom and you got a romantic comedy for the ages.\n>\n>One could almost call it a Divine Comedy.\n\nIt started out as a crack ship fic but is genuinely well written and has only grown in detail and complexity. It puts in a lot of work to combine the lores/universes of The Owl House and the Helluvaverse and actually gets pretty creative with it. The characterizations are solid and actually makes Lucifer Morningstar and Camila Noceda a compelling couple. It’s not just a romcom and does have some angst in it. It also follows the perspectives of multiple characters and has multiple storylines going at once. It takes place after the finale time skip in TOH but before the pilot of Hazbin Hotel. Obviously very canon divergent but in such a fascinating way as the actions taken by characters that only change because of Lucifer and Camila’s romance stack up to make such interesting ripple effects. \n\nIf you like either or both fandom I highly recommend it. I don’t know what confusions could arise from not being into TOH and the Helluvaverse, but it explains things pretty well and I don’t doubt that most details could be learned through context.",
            "Without question, it was [Goddamn Teenagers](https://archiveofourown.org/works/52128295); an ongoing 87k word (and over 400 chapters long) fic, from the Worm fandom, in which Taylor lives through Golden Morning, makes it into her 50’s as an unpowered person, and then gets off’d by a letter bomb. Only to wake up still as her 50’ish year old self, in Brockton Bay, in 2011. Contessa shortly arrives with the intention of doing everything she says. \n\nMore than just my favorite fic this week, it’s my favorite ‘Taylor time travels’ fic, full stop.",
            "MDZS | Mature | Violence | [shades of grey spill from my veins (bleeding ink all over the page)](https://archiveofourown.org/works/25556128/chapters/62013934) by Reverie (cl410) \n\nSummary: A fic where Wei Wuxian is raised by the Nie instead of the Jiang."
        ]
    },
    "Don't Start Your Fic by Apologizing": {
        "title": "Don't Start Your Fic by Apologizing",
        "score": 338,
        "url": "https://www.reddit.com/r/FanFiction/comments/1dqvxww/dont_start_your_fic_by_apologizing/",
        "content": "You wrote something, and you're letting people read it for free with no obligation. DON'T APOLOGIZE. Don't start with \"This is my first story so sorry if the writing is bad\" or \"Sorry for any typos, English isn't my first language\" or \"Sorry I know you're probably sick of this pairing but I just couldn't let this plot bunny go\"\n\nJust start your story. If people don't like it they can bounce. You don't owe them anything.\n\nIf you need a reason for my stance here, think of the young person reading your story and thinking about writing their own. \\*They\\* think your writing is brilliant, but then they see your disclaimer at the top. And suddenly the doubt creeps in... this writing is so much better than mine... if my current fave is apologizing for her bad writing, I probably shouldn't post my stuff at all, it's so much worse\n\nSo just post your story, no apologies, no disclaimers, just the awesome stuff you wrote.",
        "num_comments": 63,
        "comments": [
            "Well said. Also, that doesnt really help, it only makes it worse  \n\n\nIf someone actually thinks the story or writing isn't good, an apology or \"English isn't my first language\" note/tag isn't going to change anyone's opinion of it, nor make them keep going. And worse, if people see that before reading, it makes them less inclined to read, after all, you already said it's bad, and maybe they would have read it otherwise  \n\n\nSo yeah don't apologize  \n\n\nIf you do feel like you could do better, and want to, you can always leave an end note not apologizing but asking for constructive criticism so you can improve.",
            "I think what Conan O'Brien said on [Hot Ones](https://youtu.be/FALlhXl6CmA?t=484) applies here:\n\n> \"The worst thing a guest can do is tell the audience it's not going well. Audiences want to see a good show and I was always amazed when someone would come out, and they'd be doing okay and they'd make a couple jokes and it's fine. And then they would just sigh and look at the camera and say 'This isn't going very well, is it?'. \n> \n> I'd look out at the audience and see 200 souls leave 200 bodies because they were just told they were not getting a good show. But that's not showbusiness. Showbusiness is 'You're getting the greatest show in the world!'\"",
            "Okay, but like...what about the \"sorry, no beta\" thing? I've come across it MANY times and it never deters me from reading something. It just reminds me that the author is one person and mistakes are bound to leak through no matter how many times they've edited. That doesn't mean they don't care or don't have confidence in their writing or that their work isn't worth giving a chance.\n\nAnd although I agree with the sentiment of having pride in your writing without apologizing, it seems that based off of some of these comments, I (personally) think that some readers can be ridiculously hypercritical.",
            "I automatically believe you. If you think it's bad enough to apologize for it, that tells me I shouldn't read it.",
            "My mentor told me this when I was still articling: \"no one (especially a client) wants a lawyer who opens up to the judge with, 'sorry, this is my first time, I might not be good at this.'  It immediately undermines you in front of your audience.\"\n\nFake it 'til you make it.  I think most people are definitely guilty of it at some point, but you just have to take the plunge.",
            "Yes... except for when they say English isn't my first language because most of the time that is an indicator for me that it is gonna be most likely brilliant.",
            "If anything, I'm all the likely not to click on any story that specifies \"this is my first story\" or any other such explanation or apology.\n\n\nPeople should just let their stories speak for themselves. If it's bad, no amount of apologies or justifications will make the story *not* bad, and if it's good, I don't think any explanations matter anyway.",
            "hard agree. it’s a big pet peeve of mine",
            "This, and also, just own your writing in general and don't apologize or call your own writing bad. It's off-putting to the readers and you're bringing down your own self-esteem for no real reason.",
            "You raise a very good point that I think applies to self-deprecation in general. That is, when we talk poorly of ourselves for any reason, that doesn't always affect only us, even if we don't mean to put anyone down other than ourselves. This is something that I've had to be mindful of over the years, and it's changed the way I talk about myself, at least publicly.\n\nI used to hold myself to ridiculously high standards for no valid reason. If I wrote less than 5k every day, I would get really down on myself- it was kind of delusional, honestly. The way I felt was very real, though, even if it was silly for me to have that mindset. I was genuinely upset with myself for not keeping up with what I expected of myself, and would lament as such among friends. I was so caught up in my own nonsense that it didn't dawn on me that it was discouraging someone close to me who wasn't able to write as often as me. If I didn't think what I was doing enough, then what did that imply about what they were doing? In actuality, I'd never impose my absurd mindset onto anyone else and I genuinely assert that getting any writing done whatsoever is a blessing, but in getting caught up in my own head I was still hurting someone whether I meant to or not. I tend to be a bit oblivious to social situations at times, but when I realized what I was doing, I resolved to give myself a reality check and be a little more conscientious of how I talk about myself and my writing around others."
        ]
    },
    "Someone wrote a fic for meeeee!!!!": {
        "title": "Someone wrote a fic for meeeee!!!!",
        "score": 37,
        "url": "https://www.reddit.com/r/FanFiction/comments/1dr2wcv/someone_wrote_a_fic_for_meeeee/",
        "content": "How amazing is that??? I NEVER expected this to happen. When I started talking about my brainchild pairing I thought I would be shouting into the void forever. But now I'm kinda known in my corner of the fandom as The One Who Ships So-and-So to the point someone can look at my blog and decide to write a fic made in a lab for me to enjoy, with ALL my niche headcanons included!!?!?!?!? WHOAH!!!!! that's the best notification to wake up to in the morning lol",
        "num_comments": 2,
        "comments": [
            "Wow!! That's Amazing!!! Congratulations!!!! \n\n(Now I've got another goal to work towards I guess ;p )",
            "Oh that is so cool! Congrats!"
        ]
    },
    "I fucking love writing fic": {
        "title": "I fucking love writing fic",
        "score": 69,
        "url": "https://www.reddit.com/r/FanFiction/comments/1dqxahk/i_fucking_love_writing_fic/",
        "content": "Writing fic. Getting comments and kudos. Commenters are literally the best. I get to read other people's stuff and comment on it and honestly it feels like we're all just vibing together and it's so much fun\n\nYeah, fandoms can be incredibly toxic sometimes, but I just love being able to share fic with people. Comments are so validating but I also get to ramble about my own fic like a fangirl sometimes and I get to just vibe with people and sometimes a writer I think is really cool will comment on my fics\n\nThis is just so amazing",
        "num_comments": 8,
        "comments": [
            "I just made a post on my twitter about roughly the same. I put so much love on my pieces and writing feels so personal and intimate to me. Regardless of what I write or if I condone it or not, the PROCESS feels like a 1 on 1 with my brain. Its honestly amaziny",
            "Tell me about it, it's like we're all a one person company making stories and chatting with other one person companies",
            "Mmmmm yeeessss!!",
            "Agreed 💯",
            "Same here. I love writing fic. This is such a wholesome post. For me, the very best part is before I've even started posting, when I'm still getting those very first comments from my beta. Posting and getting comments is the most exciting though! And I love connecting with other authors through the comments, it's an awesome feeling.",
            "It's the best - we all have one collective brain cell and we're using it to make amazing, beautiful stories.",
            "I'll be honest, a notif for this popped up on my phone and it was the motivation I needed to pick up my writing again :)",
            "That makes me so happy you have no, good luck to you!"
        ]
    }
}