{
    "Official: [Index] - For All Your Team/League Questions - Sat 06/29/2024": {
        "title": "Official: [Index] - For All Your Team/League Questions - Sat 06/29/2024",
        "score": 3,
        "url": "https://www.reddit.com/r/fantasyfootball/comments/1dr8r2i/official_index_for_all_your_teamleague_questions/",
        "content": "___\r\n\r\n###**PLEASE READ**\r\n\r\n* How to post a [Player Discussion](https://redd.it/52xkzc) or [Injury Thread](https://redd.it/2koxce) \r\n* [Sub Rules and Guidelines](http://www.reddit.com/r/fantasyfootball/wiki/rules_guidelines)  \r\n* [Our Wiki with tons of great content!](http://www.reddit.com/r/fantasyfootball/wiki/index)  \r\n* [FAQ](/r/fantasyfootball/wiki/faq) \r\n\r\n\r\n --- \r\n\r\n**[Play in our Weekly Accuracy Challenge](https://narffl.com/games/accuracy_challenge) sponsored by [FantasyPros](http://www.fantasypros.com)**  \r\n\r\n*^FantasyPros ^organizes ^advice ^from ^100+ ^fantasy ^experts ^all ^in ^one ^spot. ^Quickly ^get ^consensus ^opinions ^from ^your ^favorite ^experts ^or ^the ^ones ^who ^have ^been ^rated ^as ^the ^most ^accurate ^over ^time. ^With ^My ^Playbook, ^you ^can ^import ^your ^team ^in ^seconds ^to ^get ^advice ^specifically ^tailored ^to ^your ^squad. ^The ^weekly ^advice ^includes ^Start/Sit ^picks, ^suggested ^Waiver ^Pickups, ^Trade ^help, ^and ^news ^& ^notes ^for ^your ^players.*\r\n\r\n**[Official Reddit FanDuel league](https://fanduel.com/reddit/)** \r\n\r\n*^We've ^partnered ^with ^FanDuel ^to ^host ^a ^series ^of ^redditor-only ^free ^contests ^with ^$2,800 ^in ^cash ^prizes! ^During ^Weeks ^1-20, ^there ^will ^be ^a ^free ^play ^contest ^with ^$125 ^in ^cash ^prizes.*\r\n\r\n\r\n**Other /r/fantasyfootball Contests**  \r\n\r\n* Official Reddit r/fantasyfootball league at r/NarFFL or [narffl.com](https://narffl.com/)  \r\n\r\n* [View our Pick 'em, Eliminator, and Gridiron games at NarFFL.com](https://narffl.com/games/other) \r\n\r\n---\n----\n**The following users have helped the most people in all of the threads:**\n\nUser | # Helped in thread\n-------|:-----:\n --- \n\n#[Official: [Dynasty & Best Ball] - Sat 06/29/2024](/r/fantasyfootball/comments/1dr8ql3/official_dynasty_best_ball_sat_06292024/)\n --- \n\n#[Official: [Keeper] - Sat 06/29/2024](/r/fantasyfootball/comments/1dr8qlv/official_keeper_sat_06292024/)\n\n-------------\n\n\n\nUser | # Helped in thread | # Helped in all threads | Direct Link\n----|:-----:|:-----:|----\nOk_Location_1092 | 1 | 1 | [Comment](/r/fantasyfootball/comments/1dr8qlv/official_keeper_sat_06292024/laua9lh/)\nShot_Scientist_520 | 0 | 0 | [Comment](/r/fantasyfootball/comments/1dr8qlv/official_keeper_sat_06292024/laukdrb/)\nStrongCherry6 | 0 | 0 | [Comment](/r/fantasyfootball/comments/1dr8qlv/official_keeper_sat_06292024/lauknfu/)\n\n^(This table will be updated every ~15 minutes.)\n --- \n\n#[Official: [League, Commissioner, and Platform Issues] - Sat 06/29/2024](/r/fantasyfootball/comments/1dr8qml/official_league_commissioner_and_platform_issues/)",
        "num_comments": 0,
        "comments": []
    },
    "[Adam Levitan]  Anthony Richardson’s shoulder appears to be just fine.": {
        "title": "[Adam Levitan]  Anthony Richardson’s shoulder appears to be just fine.",
        "score": 59,
        "url": "https://x.com/adamlevitan/status/1806736353960276458?s=46&t=13EzzeZY2gJqjPq06FBlZg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "That was nastier than most dunks in the dunk contest",
            "Hope so. He's a very young player, he needs all the offseason reps he can get as well as a full training camp.",
            "I wish the pro bowl had athletes playing other sports.\n\nLove to see a basketball and baseball game played.",
            "Really wish the NFL pro bowl was just a round robin basketball tournament. That would be awesome. \n\nI wanna see Myles Garrett challenging this at the rim.",
            "Hopefully he can make sure it's fully healed. Got mad power in those arms!",
            "Yeaaa imma let the rest of yall take that gamble.",
            "What about the other one",
            "Wow, he is truly built different",
            "Did he burp while saying it? Dude is the gassiest Podcaster ever.",
            "Built like Tarzan but injury prone like jane."
        ]
    },
    "NFL Running Backs: Does RAS Matter? A Comprehensive Analysis": {
        "title": "NFL Running Backs: Does RAS Matter? A Comprehensive Analysis",
        "score": 10,
        "url": "https://brainyballers.com/nfl-running-backs-does-ras-matter-a-comprehensive-analysis/",
        "content": "The Saturday Script is back! Last week we dove into [Running Back 40 Yard Dashes](https://www.reddit.com/r/fantasyfootball/s/MXUB7tpYqr) and if that affects performance. For part 12 of The Saturday Script, we looked at RB RAS. Our analysis revealed that our RAS threshold occurs at a 23.3% higher rate in the top 10 fantasy football Running Backs since 2003 than in the bottom 10.\n\nAll of our research can be found on [our Analytics page](https://brainyballers.com/the-saturday-script-advanced-analytics-for-fantasy-football-stats/). Just comment what theories/myths you want to see verified or debunked and we will! Next week we’re looking at WR data to try to find a WR 40 yard dash time threshold that correlates to increased performances, if there is one. Our current lineup is to evaluate WR RAS, WR Y/A, WR drop rates.\n\nTL;DR Running backs that have better than 7.6 RAS, and who are projected for top 50 in any season, are 23.3% more likely to have a top 10 RB finish than a bottom 10 RB finish (41st-50th place). 2.3 RAS is the critical threshold that is the minimum since 2003. Further, using standard statistical methods to find trends found correlation with the P-Value, but the Rsquared value was so low that it showed RAS is an extremely small factor that predicts success.",
        "num_comments": 13,
        "comments": [
            "Just a suggestion: at least once in a large block of text you should have the full title of the thing, not just the acronym",
            "What Is RAS?\n\nRelative Athletic Score (RAS) is a metric used to evaluate the athleticism of NFL prospects based on their performances in Combine and Pro Day drills.",
            "Again buddy, love the content.",
            "I agree so much! A lot of people see analytics as witchcraft.",
            "Updating now youre right thanks!",
            "And again, thanks for commenting you legend",
            "Yup. I'm adopting the red flag strategy this year. If a player is *awful* at something then I'm not gonna be drafting them lol. \n\nGreat article. Definitely gonna ignore Bucky Irving in all drafts. Wasn't sure how he was ever gonna take much work away from Rachaad White but this cements it",
            "I don't think so. You'd probably get all the mid to bad rookies showing up in some areas. But the research should say \"almost everyone in the red flag area of this stat sucks\" or it's not really a red flag stat in the first place. If historically <1% of players succeed in the \"red flag\" area then I'm not gonna take my chances.\n\nYPRR is also a pretty great encompassing stat because it measures ability to earn targets and produce with them. College career YPRR above 2.0 is the one I follow the most religiously for rookies because it's ridiculously correlated with success. WR BMI is another one, definitely not drafting any WR with a 1st percentile BMI (i.e. Troy Franklin).  From what I've seen there aren't a whole lot more though I'll be adding RB RAS to them now!",
            "Thats exactly what Im hoping to find.\n\nBtw I ran the WR BMI for next week already. If this red flag area is what you follow then Id avoid Xavier Worthy.",
            "Thanks for the heads up! Yeah I was planning on avoiding him. This isn't a stats thing but I pay attention to how WR's protect themselves from collisions with the ground when making catches (credit to AngeloFF for bringing my attention to this) and Worthy doesn't do a good job. You can't keep smashing into the ground over and over and stay healthy, can work for a while but the minor injuries will pile up. Legette also doesn't do a very good job of this"
        ]
    },
    "Who are you not leaving the draft without this season?": {
        "title": "Who are you not leaving the draft without this season?",
        "score": 195,
        "url": "https://www.reddit.com/r/fantasyfootball/comments/1dqvru1/who_are_you_not_leaving_the_draft_without_this/",
        "content": "\nWho is a player you are happily taking a round too early or bidding a bit more than you should because they are so undervalued this year? \n\nInclude where you think they should be going too \n\n",
        "num_comments": 535,
        "comments": [
            "Unfortunately, it's my turn to get hurt by Kyle Pitts this year\n\n(it's always my turn)",
            "DK Metcalf. I dont have that great of a reasoning yet, but it feels like this is his year.",
            "Mike Evans, my man isnt even close to finished",
            "I am all in on Z White. All my mock drafts include targeting him. I had Jacobs last year and really liked Vegas run heavy offense.",
            "The sun god and I wont take no for an answer.",
            "Jake Ferguson is the only TE, its him or Im spending a dollar and streaming every week.",
            "Hockenson and Tua for the sake of my team name this season",
            "Engram. Ridley soaked a lot of targets and air yards that some of will go Engrams way. Lawrence has chemistry with him.",
            "The guy I want to prevent my buddy from getting for cheap, but I bid one extra time to get him to raise the price and I end up with the sandbag of a dud",
            "I love both Diontae Johnson and Rhamondre Stevensons value this year, Im really hoping to get both of them"
        ]
    },
    "Want to be included in our beta rollout of league flair? Make a $10 donation to Fantasy Cares this weekend.": {
        "title": "Want to be included in our beta rollout of league flair? Make a $10 donation to Fantasy Cares this weekend.",
        "score": 6,
        "url": "https://www.reddit.com/r/fantasyfootball/comments/1drb5rg/want_to_be_included_in_our_beta_rollout_of_league/",
        "content": "League flair was rolled out as part of our [Draft Prop Contest](https://www.reddit.com/r/fantasyfootball/comments/1c4p9qi/introducing_the_reddit_scott_fish_bowl_draft/) this year, among more than 40 other prizes. But with #SFB14 live drafts kicking off and the [Podathon](https://www.reddit.com/r/fantasyfootball/comments/1dpzn27/the_sfb14_podathon_is_this_weekend_tune_in_and/) this weekend, we're giving you another chance to get in on the beta rollout!\n\nMake a $10 donation to FantasyCares (dated today or later) and send a screenshot to modmail and we'll get you set up with league flair.  League flair is one of our most requested features and now it's available to benefit a good cause.",
        "num_comments": 0,
        "comments": []
    }
}