{
    "Universitário recebe PIX de R$ 100 mil por engano e devolve o valor: 'não fiz nada de mais'": {
        "title": "Universitário recebe PIX de R$ 100 mil por engano e devolve o valor: 'não fiz nada de mais'",
        "score": 109,
        "url": "https://g1.globo.com/sp/sao-carlos-regiao/noticia/2024/06/29/universitario-recebe-pix-de-r-100-mil-por-engano-e-devolve-o-valor-nao-fiz-nada-de-mais.ghtml",
        "content": "Achamos nosso membro",
        "num_comments": 59,
        "comments": [
            "Um loss de 100k + 20tao do Uber. Alguém traga um homem para esse Troféu.",
            "Farialimabets furou a bolha mainstream 🗣️",
            "Eita, esse é o cara que postou aqui essa semana?",
            ">Eu acho que não fiz nada de mais, era o que eu iria fazer de qualquer forma”, contou **Genésio**\n\nPuta que pariu, um nome desse é LOSS a vida inteira",
            "Disse o cara que estava cogitando em não devolver kkkkk",
            "Esse é aquele mano que postou aqui no grupo?\n\nEngraçado ver a cara das pessoas por trás dos perfis daqui",
            "N fiz nada de mais = N quis arriscar ir preso kkkkk",
            "A cara do meliante kkkkkkk",
            "Ih, vazou o rosto do nosso mais novo adm.",
            "posso estar super errado mas em casos assim que a pessoa tem que fazer uma pá de coisa pra conseguir devolver o dinheiro n rola um processo por danos morais ou algo do tipo por conta do inconveniente?"
        ]
    },
    "Quem de vcs foi?": {
        "title": "Quem de vcs foi?",
        "score": 545,
        "url": "https://i.redd.it/y4rkzh2ppd9d1.jpeg",
        "content": "",
        "num_comments": 78,
        "comments": [
            "Foi minha irmã, agora estamos pobres",
            "Eu ouvi falar que ela ganhou 100k só que cadastrou o pix errado e o jogo do tigrinho mandou para um desconhecido.",
            "Acho que ela não tava só gastando com tigrinho não.",
            "Vou esperar algum filho de uma puta postar um desabafo sobre roubar 179 mil do avo pra jogar no tigrinho, e depois alguem postar sobre ter sido roubado em 179 mil pelo neto",
            "Cara eu nunca imaginei ver uma noticia dessa no Brasil kkkkkkkkkkk",
            "Sempre é bom ver que tem gente mais fudida que eu",
            "Isso deveria ser tratado como saúde pública. \nNão é possível. \nPior que os governantes tão se fudendo e só veem isso como fonte de arrecadação.",
            "Eu sei que é meme mas sempre achei que já fosse conhecimento geral de que jogos de azar são exatamente isso, jogos onde só ganha quem vende o jogo, aparentemente só colocar um mascote e efeitos em estilo cartoon que o pessoal esquece esse conhecimento básico.",
            "Tinha que ser uma gorda pqp sempre esse tipo de gente",
            "Isso virou uma praga na América latina?"
        ]
    },
    "O tio do zap mais lúcido.": {
        "title": "O tio do zap mais lúcido.",
        "score": 50,
        "url": "https://v.redd.it/jgrtwmadbh9d1",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Não deixe seus idosos passarem muito tempo no celular",
            "Caralho. Pior que ele é até novo. Pqp. Doentasso",
            "hehehehhee deve ser zoeira não pode ser real hehehehe",
            "Tinha um doido do trabalho que falava que lula tava morto e que a Dilma era Reptiliana e eu karaiiii",
            "Zua o tio do ZAP, mas acha que Lula não é amigo de banqueiro",
            "O poço dos bolsonarismo, apenas lero lero e muitas teorias da conspiração, correndo atrás de um covardão que paga de macho e só quer mamar nas tetas gordas do Brasil.",
            "Tio Extrema direita mais racional:",
            "A cara do moleque é a melhor kkkkk",
            "Pra botar o paulo jegues na economia vale tudo, fds",
            "Ainda bem que legalizou os bingos e cassinos de novo, quem sabe esses velhos passam a gastar energia em algo mais saudável"
        ]
    },
    "Poder de compra do brasileiro está cada vez mais assustador": {
        "title": "Poder de compra do brasileiro está cada vez mais assustador",
        "score": 140,
        "url": "https://www.reddit.com/r/farialimabets/comments/1dr144k/poder_de_compra_do_brasileiro_está_cada_vez_mais/",
        "content": "Hoje fui no shopping e resolvi comprar umas roupas que estava precisando, fui na centauro e comprei um tênis básico (converse all star) e fiquei pasmo com o valor: 300 reais, isso mesmo, trezentos reais. Pesquisei na internet pra ver se achava mais barato e realmente esse é o valor do tênis. Essa merda custava 60 reais há alguns anos atrás e o salário não estava tão menor do que o atual, a inflação conseguiu fazer um tênis que nem é de grife valer 1/5 de um salário mínimo. Se a inflação continuar nesse ritmo e o salário não acompanhar, daqui a uns anos um tênis que era popular vai se tornar artigo de luxo pra classe trabalhadora, se não já é. Até a porra do rainha tá caro.",
        "num_comments": 80,
        "comments": [
            "\"Uma calça para uma jovem de 16 anos é mais de 300 reais.\"",
            "A converse é da nike desde 2003. Todos os produtos da nike são overpriced pq trouxa compra marca e não o produto.",
            "Cara, isso aí é foda mesmo. Têm aquela marca de roupas, Hering. Eu sempre curti camisetas sem estampa e cor única, as ditas básicas. Por volta de 2014/16, essas pohas custavam R$19,90-29,90. Faz uns dias que fui comprar uma camiseta, e estava fucks R$49,90.",
            "Paguei 150 em 2019, porém usei por uns 3 anos. Tá batido, porém segue firme aqui ksksk",
            "Sim, un tênis um pouco mais bonitinho é meio salário mínimo.\n\nAcho incrível Brasil conseguir ser país pobre e caro.",
            "Dólar a 5,59 tem esse efeito aí.",
            "Eu ia dizer \"compra na Shopee que é baratinho\", pago 60-80 reais em calçado ali pq foda-se marca...mas agora com a taxa das brusinha fodeu o barraco, tudo 20%+ mais caro.",
            "O mercado entendeu n pandemia que o brasileiro médio é burro e não sabe quantificar o preço das coisas. Não estamos na Venezuela pra inflação comer tanto assim. Óbvio que a inflação do Brasil é uma merda, economia emergente e instável. Mas o que vejo mesmo de vdd é o empresariado fazendo a boa, se eu vendia um tênis por R$ 60,00 e rendia X com o custo Y, se eu vender a R$ 300,00 e ainda render X e custar Y/6, sinceramente pra mim é uma escolha muito fácil kkkk vejam o que rolou com os carros usados, se tem demanda tem mercado",
            "Pobre não come tênis, caraio! Tem que se preocupar é com o preço do pescoço de frango, se ele subir AÍ SIM pode reclamar",
            "Jovem brasileiro aprendendo efeitos da política econômica na prática."
        ]
    },
    "Devolveu 100k do Pix errado pro china": {
        "title": "Devolveu 100k do Pix errado pro china",
        "score": 17,
        "url": "https://i.redd.it/2w6oulq9ai9d1.jpeg",
        "content": "Como pode alguém pedir conselhos nesse digníssimo grupo e simplesmente devolver essa bolada. Loss total....\n\nhttps://g1.globo.com/sp/sao-carlos-regiao/noticia/2024/06/29/universitario-recebe-pix-de-r-100-mil-por-engano-e-devolve-o-valor-nao-fiz-nada-de-mais.ghtml",
        "num_comments": 14,
        "comments": [
            "Eles não sabem, mas nos acompanhamos essa história em tempo real",
            "\"os amigos brincaram que era a oportunidade dele fugir para o Paraguai'' não, não era brincadeira haha",
            "Genésio tem que ser canonizado aqui no grupo",
            "O cara fez o bem e ainda tomou prejuízo de 20 conto.",
            "E ele está entre nós, senhores. 🍷\n\nSe ele seguisse os conselhos que esse sub estava dando a ele, a notícia seria diferente kkkkkk",
            "Mal sabem eles que o cara desconhecido era o proprio laranja dele.",
            "\"Eu tava lá\" vi tudo \"ao vivo\" no reddit",
            "Isso, bora criar vários tópicos da mesma coisa, tá incrível!",
            "Mano, isso foi histórico, sério, poderei dizer aos meus filhos, eu estava lá",
            "Foi o cara que postou aqui com a print da conta do ITAU ?"
        ]
    }
}