{
    "▐ FashionReps 2024 Beginner Guide▐  | Agents | How to Buy | Trusted Seller List | FAQ | ": {
        "title": "▐ FashionReps 2024 Beginner Guide▐  | Agents | How to Buy | Trusted Seller List | FAQ | ",
        "score": 498,
        "url": "https://www.reddit.com/r/FashionReps/comments/1cxk4z5/fashionreps_2024_beginner_guide_agents_how_to_buy/",
        "content": "&nbsp;\n\nWelcome to /r/FashionReps! In this post you will find out how to buy reps, where to source them, the trusted seller list, and how to use an agent.\n\n&nbsp;\n\n\n--------------------\n\n# \"Where do I start?\"\nFirst, it is recommended to sign up for an agent. An agent acts as a middle-man service to protect you from malicious sellers who may try to bait and switch products, deny refunds, or never send the goods.\n\nGo to the [Trusted Agent List](https://s.reps.gg/agents) and pick an agent. \n\n[Basetao VIP Level 2 Signup](https://s.reps.gg/basetao)\n\nBasetao has no brand restrictions as of right now! \n\n&nbsp;\n\n\n--------------------\n# How to use an agent\n\nRead the [how to use an agent guide](https://www.reddit.com/r/FashionReps/wiki/howtouseanagent/)\n\n&nbsp;\n\n\n--------------------\n\n# \"Now that I've picked an agent, where do I find stuff?\"\nYou can utilize the finds flair to sort posts by user-submitted links [finds](https://www.reddit.com/r/FashionReps/?f=flair_name%3A%22FIND%22) \n\nYou can also utilize the following tools to help jumpstart your journey\n\n^^If ^^you're ^^on ^^mobile ^^download ^^the ^^google ^^sheets ^^app ^^to ^^zoom ^^out ^^and ^^view ^^these\n\n**[HooBuy Spreadsheet](https://s.reps.gg/hoobuyspreadsheet)**\n\n**[SuperBuy Spreadsheet](https://s.reps.gg/superbuyspreadsheet)**\n\n**[SuperBuy Shoe Spreadsheet](https://s.reps.gg/superbuyshoes)**\n\n^^CSSBuy ^^& ^^Basetao ^^sheets ^^coming ^^soon\n\n\nYou can also visit the [TSL](https://www.reddit.com/r/FashionReps/wiki/trusted/) which features hundreds of sellers who have been deemed trustworthy by the community.\n\n&nbsp;\n\n\n--------------------\n# Terminology\n\nGreat! Now that you know how to purchase, you need to learn common rep terminology!\n\n[Read the terminology you need to know](https://reddit.com/r/FashionReps/wiki/terminology)\n\n\n## Frequently Asked Question\nCommonly asked questions can be found below. It is highly encouraged you understand these basic questions before beginning your rep journey.\n\n[FAQ page can be found here](https://reddit.com/r/FashionReps/wiki/faq)\n\n&nbsp;\n\n\n--------------------\n\n# Why are my posts not showing?\n\nAs a new member to /r/FashionReps your posts will automatically be hidden. This is to prevent spam. Once your surpass 100 karma your posts will automatically be approved unless they're missing specific critera.\n\nSome common removal reasons: \n* No flair assigned\n* Low quality post\n* Automatically flagged for banned content (EX: Blacklisted Agent, Seller, or brand)\n\nFeel free to tag /u/TheRealReplicator in the comments for approval if you believe your post was wrongfully removed.\n\n&nbsp;\n\n\n--------------------\n\n## Ending Notes\n\nIf you have any specific questions that may have not been answered in this post then comment below so a moderator or user can help answer it!\n\n[FashionReps Discord](https://discord.com/invite/fashionreps)\n\n[Message Moderators](https://www.reddit.com/message/compose?to=r%2FFashionReps)\n",
        "num_comments": 337,
        "comments": [
            "Adding Hoobuy to the trusted seller list is crazy... they are way too new, with zero infrastructure",
            "anyone know how to get links out of items in pb cart?",
            "Whats everyone's opinion on CNfans before I buy anything.",
            "should I go with cssbuy or superbuy or baetao??",
            "Do someone who have tried HooBuy tell a bit about? Like, can I shop yupoo links? Is it easy to use?",
            "whats up with the new tags? About rep rockie, rep apprentice and so on? How do they work because I got the rep genius tag ~~and suddenly dont have it anymore although im long time member :(~~  ah on another comment it appeared i dont have it lul",
            "Does the superbuy work,i've tried with pasting weidian links but i got the warning that it cant be shipped probably because its branded",
            "What do the \"minor limitations\" mean for SuperBuy and cssbuy?",
            "Which agents are still ordering blcg?  Basetao wont let me signup, hoo wont let me order as their daily limit has been reached and sugar refused to order.",
            "No link in the hoobuy spreadsheet is working"
        ]
    },
    "👑🏨Mulebuy Agent:   30winners for 40kg free + 4000 Balance  giveaway event 💰💰\n": {
        "title": "👑🏨Mulebuy Agent:   30winners for 40kg free + 4000 Balance  giveaway event 💰💰\n",
        "score": 379,
        "url": "https://www.reddit.com/r/FashionReps/comments/1dmxysl/mulebuy_agent_30winners_for_40kg_free_4000/",
        "content": "Click [here](https://mulebuy.com/register/?ref=200004750) to sign up to Mulebuy membership.\n\nMulebuy shopping agent provides assistance with purchasing both online and offline products in China. The e-commerce platforms covered include Taobao, Weidian, 1688, and many other Chinese e-commerce platforms. Order processing time is 1 day, quality inspection time is 1 day, packaging time is 1 day.\n\nGiveaway Prizes: 4kg free shipping x*10, 200CNY  balance x* 20\n\n**How To Enter This Giveaway:**\n\nUpvote this post\n\nComment \"Mulebuy\".\n\nRegister an account [here](https://mulebuy.com/register/?ref=200004750)\n\n30 lucky winners will be drawn by the host to win the prizes!  \nJoin Mulebuy Discord: Join here: [https://discord.gg/bUbKHGT8c5](https://discord.gg/bUbKHGT8c5)\n\nWhen do the giveaway end? July 1st.\n\nThe winners will receive the prizes within 72 hours after the event ends.\n\nContact Website: [https://www.mulebuy.com/](https://mulebuy.com/register/?ref=200004750)  \nDiscord: [https://discord.gg/bUbKHGT8c5](https://discord.gg/bUbKHGT8c5)  \nEmail: [pr@mulebuy.com](mailto:pr@mulebuy.com)",
        "num_comments": 498,
        "comments": [
            "Wtf is a mulebuy 😭🙏",
            "Do you guys offer ocean cargo shipping lines ?",
            "these guys run jadeship and that’s the best website ever",
            "Platform looks kinda like embuy",
            "Do you ship to Switzerland?",
            "Nah bro just checked they dont",
            "how you know its them that run it ?",
            "So hard finding one that does lol only Superbuy does but you can’t ship Nikes rn",
            "Yea i just bought some budget bapes for now",
            "Mulebuy"
        ]
    },
    "🔥MOOK-OFFICIAL🔥 ASSC/Anti Socil Club/Fear of god/Essentals/Off white/Supreme/Gallery Dept/Thom Browne/Vintage/Chrome Hearts/Erd/Rick Owens/Trapstar/CARHARTT/Casablanca/Denim Tears/Chrome Hearts/Rhude/Represent/Amiri/Hellstar/Sp5der/Cole Buxton/Vajude/SAINT MICHAEL/Cavempt/Balenciaga/CPFM/ACNE": {
        "title": "🔥MOOK-OFFICIAL🔥 ASSC/Anti Socil Club/Fear of god/Essentals/Off white/Supreme/Gallery Dept/Thom Browne/Vintage/Chrome Hearts/Erd/Rick Owens/Trapstar/CARHARTT/Casablanca/Denim Tears/Chrome Hearts/Rhude/Represent/Amiri/Hellstar/Sp5der/Cole Buxton/Vajude/SAINT MICHAEL/Cavempt/Balenciaga/CPFM/ACNE",
        "score": 230,
        "url": "https://www.reddit.com/gallery/1dqntzk",
        "content": "",
        "num_comments": 16,
        "comments": [
            "Yes they do, I purchase Rhude tees and they are fantastic quality",
            "that is exactly what im waiting to see",
            "Bought from them before all the raids, they valid",
            "What else u want dawg",
            "Contacted them on WhatsApp, I think the password for their store is LoveMook \n\nOnce you know which items you would like, ask them if the sizes are available. Once paid via PayPal, they will send you QC photos, if you are happy then they will ship.",
            "New day, same old shit. \n\n  \nMove along kids, nothing (new) to see here.",
            "Do you ship direct",
            "any one vouch",
            "2nd this",
            "How did you order?"
        ]
    },
    "Superbuy haul(supreme umbro, Nike drake nocta, stussy patta, carhartt)": {
        "title": "Superbuy haul(supreme umbro, Nike drake nocta, stussy patta, carhartt)",
        "score": 132,
        "url": "https://www.reddit.com/gallery/1dqnr2s",
        "content": "Superbuy haul that I shipped before they canceled my other orders so happy that I acctually got it in hand finally after 3 weeks :D becasue of superbuy didnt shipped my package for first 6 days we really need panda back pls\n\nSupreme x umbro tracksuit - Quality is nice, material is like on every windbreaker, its acctually water proof, take one size bigger because the sleeves r not that long, embroidery and patch are clean, not any lose stiches, hood is bit smaller but I mean its made for running so there is no need to be big, bottom are same thing take size larger to have a more comfy fit cuz the lenght but again quality is nice, string on the bottom is longh enought so no need to worry about the waist fit\nhttps://item.taobao.com/item.htm?ft=t&id=790109192184\n\nnike x nocta drake green - this is more of a crazy color than the 2 other but I like it, material is really soft and feels really comfy, for sizing I recommend yout true size, same as the supreme the strings on pants are long enought so no worry about the waist fit, tags and custom zip are looking really nice, logos around whole tracksuit are holding nicely to the tracksuit.\nhttps://item.taobao.com/item.htm?ft=t&id=788299634680\n\nCorvidae Earth Jersey - classic jersey material, take your true size to get oversized fit, main thing on the jerseys is if the print is peeling off but this one is really nice and you cant really peel off with your nail, overally the best looking jersey I ever saw\nhttps://item.taobao.com/item.htm?ft=t&id=790081861564\n\nStussy x patta tee and black tee - both tees are really nice quality, the patta tee was released in like 2019 so you cant really buy a ds tee, print is nice way better than other batches that I own, after a wash the fit is same and its not shrinking, I would say this is the higher tier batch for stussy as there is many random sellers that sell stussy for cheap\nhttps://item.taobao.com/item.htm?ft=t&id=810004986451\n\nhttps://item.taobao.com/item.htm?ft=t&id=810004986451\n\nCarhartt tee - I mean carrhart is not that expensive I just bought this one out of curiosity how the quality will be and its pretty nice, compared the material of the tee and its literally the same, atm its just depends if yu should pay the 10€ more for retial or go with rep, every money is money and the quality is same so rally depends how you look at it\nhttps://item.taobao.com/item.htm?ft=t&id=776685034744\n\ncarhartt shorts - And for shorts its 100% worth to buy rep as the retail is around 100$ this one is 20$ quality is really really good and fit is also really nice for shorts they r not short and not long, again go with your true size for normal fit, logo on backpocket have no issues and looks clean, can recommend this one\nhttps://item.taobao.com/item.htm?ft=t&id=809892111806",
        "num_comments": 26,
        "comments": [
            "i thought u couldn’t order nike items???",
            "With the supreme windbreaker does the seller just sell the jacket or do you have to buy the entire tracksuit?",
            "how tall are you and what size/fit did u go for the carhartt jorts? Im looking for an at knee or below knee fit. any help would be appreciated thanks.",
            "What size did you get? And what your measurements",
            "Can I get stussy patta link",
            "I just ordered 500€ on superbuy 4 days ago, is it trusted? I’m worried",
            "are u able to buy carhartt and essentials now on superbuy?",
            "I was probably in the last wave where you could all of my orders that I placed later got cancelled",
            "What does this mean? I ordered some Nike socks and the shop shipped them to my warehouse yesterday",
            "Any idea when vendors will be able to sell swoosh sneakers again? Been out of the loop"
        ]
    },
    "David925 Haul": {
        "title": "David925 Haul",
        "score": 7,
        "url": "https://item.taobao.com/item.htm?spm=a1z09.2.0.0.7e012e8dn776MO&id=568895398371&_u=t3vjftdf1542",
        "content": "",
        "num_comments": 5,
        "comments": [
            "How do you size it?",
            "Looks nice man",
            "As FashionReps opens back up we would like to remind you to read the most recent post related to the current environment surrounding reps.\n\n[Click Here For News Post](https://www.reddit.com/r/FashionReps/s/CT2MmUjq1B)\n\n[Beginner Guide & 1000+ Item Master Spreadsheet](https://www.reddit.com/r/FashionReps/comments/1cxk4z5/fashionreps_2024_beginner_guide_agents_how_to_buy/)\n\n [Giveaway by Chaosmade](https://www.reddit.com/r/FashionReps/comments/1dajv3r/giveaway_10_irems_from_chaosmade/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FashionReps) if you have any questions or concerns.*",
            "**Found Taobao/Weidian Links in Linked Post**\r\n\r\nhttps://item.taobao.com/item.htm?id=568895398371\r\n\r\n**********\r\n\r\n^I ^am ^a ^[bot](https://www.reddit.com/r/FashionReps/comments/k512f6/i_made_a_bot_to_link_to_missing_w2c_from_galleries) ^created ^by ^user ^'Albuyeh'. ^Send ^comments ^or ^whatever ^to ^him.",
            "**Converted Taobao Links:**\n\nhttps://item.taobao.com/item.htm?id=568895398371\n\n**********\n\n[^(I am a bot)](https://www.reddit.com/r/FashionReps/comments/5r3p1i/psa_im_a_taobao_link_converter_bot_please_read/)^(. Please use https://taobaotools.github.io to convert your links.)"
        ]
    }
}