{
    "Mentor Monday - Week of June 17th 2024": {
        "title": "Mentor Monday - Week of June 17th 2024",
        "score": 12,
        "url": "https://www.reddit.com/r/fatFIRE/comments/1dn81tx/mentor_monday_week_of_june_17th_2024/",
        "content": "[This post is for the week of June 24th.] Mentor Monday is your place to discuss relevant early-stage topics, including career advice questions, 'rate my plan' posts, and more numbers-based topics such as 'can I afford XYZ?'. The thread is posted on a once-a-week basis but comments may be left at any time.\n\nIn addition to answering questions, more experienced members are also welcome to offer their expertise via a top-level comment. (Eg. \"I am a \\[such and such position\\] at FAANG / venture capital / biglaw. AMA.\")\n\nIf a previous top-level comment did not receive a reply then you may try again on subsequent weeks, to a maximum of 3 attempts. However, you should strongly consider re-writing the comment to add additional context or clarity.\n\nAs with any information found online, members are always encouraged to view the material on r/fatFIRE with healthy (and respectful) skepticism.\n\nIf you are unsure of whether your post belongs here or as a distinct post or if you have any other questions, you may ask as a comment or send us a message via modmail.",
        "num_comments": 32,
        "comments": [
            "How did you go from $1m to $10m?",
            "The longer you can hold off the enjoyment of owning your own house while your capital is growing at 10%+ whether in your business or in equities the better off financially you will be.     Quality of life may be less (the feeling of owning versus renting feels better for most folks), but the financial results are different.",
            "You are absolutely rocking it.     $1.5m NW before 30 while earning $500k a year.     I would just keep doing what you are doing, set your saving or spending rate as a percentage of NW, and if your careers progress, let your spending progress (as your savings would also progress).     You are probably saving some $120k a year currently if you are spending $150k on $500k of earned income.    That is going to drive up the $1.5m quickly.    Just invest it in a diversified way, and let time take care of the rest.",
            "Youre on a fat trajectory and you have both time and a savings mentality on your side. \n\nKeep doing what youre doing and dont get seduced by exotic investment vehicles.",
            "And don't forget to plan for when you are too old for a tech job. Somewhere around 35-40.",
            "If they are 68 then they have lived through the dotcom implosion of 2000. \n\nIt doesnt appear they learned much from it though.",
            "Roughly 70% of net worth in two stocks. I wouldn't. \n\nOn the other hand, if you only need a couple hundred thou to live on each year and you enjoy giving back 50,60,70% of gains, go for it.",
            "Its not a plan as much as it is a general guideline as it lacks specificity. But its better than nothing. \n\nOn to execution which is where many of these things flounder.",
            "Your concepts of work seem to be focused on time an hours rather than trying to figure out what is important (to your employer) and trying to create value there.\n\nThat is probably the most important point of growing your income: having your work create value.",
            "Growing my earned income while saving 30% of my gross income and investing in diversified investments (mostly indexed equities, with a bit of investment property mixed in)."
        ]
    },
    "Seeking M&A Attorney Advice for Potential Exit": {
        "title": "Seeking M&A Attorney Advice for Potential Exit",
        "score": 2,
        "url": "https://www.reddit.com/r/fatFIRE/comments/1drbskv/seeking_ma_attorney_advice_for_potential_exit/",
        "content": "Own a small firm, $3M in revenue, $2M EBIDTA, sourced a buyer (PE looking for role up in adjacent business), NDA signed, Quickbooks basic info sent, demo/multiple meetings, LOI received for $20M valuation (35% up front, remainder earn out), 3 yr employment contract. There is a lot to be negotiated in the LOI (exclusivity, up front, salary, earn out calculations, etc), it's time to call in the experts. I interviewed a few firms who supposedly specialize in this type of work but they were CPA firms and their in house attorney seemed to be a generalist not focused on M&A which for the largest transaction of my life, I don't want a pediatrician doing my brain surgery, so I ran away from those. I will be working with a new CPA to get my QB in order for due diligence and creating/structuring my other companies/assets in a tax efficient manner, meeting on Monday to begin that process. Hoping my restated financials don't tweak the terms of the deal negatively but I have a feeling with an actual SDE statement, it should increase valuation in best case scenario. \n\nBig name East Coast law firm quoted $170k-$280k for M&A services. I like the attorney I interviewed, just not sure about spending that much and if the deal falls through. I am going to reach out to firms that have already transacted with the PE firm to get quotes and also other smaller firms who work just in M&A that have the expertise to work with the big boys the PE firm brings to the table. \n\nHas anyone here went through an exit and loved an attorney that you could recommend? \n\nI'm also all ears for any other advice you may have. My plan post sale (and eventual earn out) is to live the fatFIRE lifestyle. I'm 40 yo, two kids, wife is an in house atty in healthcare. ",
        "num_comments": 2,
        "comments": [
            "What state/area? Feel free to DM if helpful. I work on the buyside of a roll-up and have worked across from many good law firms that specialize in seller-side representation.",
            "That seems like an awfully high multiple for a PE roll up"
        ]
    },
    "Other fatfire parents": {
        "title": "Other fatfire parents",
        "score": 80,
        "url": "https://www.reddit.com/r/fatFIRE/comments/1dq3h88/other_fatfire_parents/",
        "content": "Hey parents to fat lifestyle kids, \n\nWe're 2 kids in and looking for tips on instilling thankfulness. We didn't have anything nice or special growing up, so we wake up beaming with joy every day without the weight of hunger, homelessness, or non-gainful wage work hanging over us. We have been able to provide the lifestyle we dreamed of for our kids so far and are securing their futures so they'll likely never have to worry and work will be optional for them. \n\nOur oldest isn't impressed by anything. And although we talk through the relationship between making money and getting to do and have nice things, and how special and wonderful our things and vacations are, I'm baffled by how mundane it all is to her. I want to give her everything, but the more I give her the less fun it is. \n\nOn one hand part of our strategy is to set high standards for my kids' living conditions so they don't accept less. On the other, we've known incredibly wealthy families with kids who expressed delight at receiving anything, even a candy. \n\nI take it as a cautionary tale when I meet young adults who bash their fathers for working too much or hunger strike because they were given a used, not new, land rover for their sweet 16 (yes firsthand experience on this one). One of my main goals in parenting is to raise my kids to be productive and cognizant that their great blessings aren't \"no strings attached\" but rather there to seed their great potential. I'm seeing a gap that needs bridging and I'm not sure that volunteering in the soup kitchen is the answer, but I can tell I need to do something. \n\nI'd appreciate any pointers from other parents whose teens and young adults came out appreciative of the lifestyle they were afforded. I think we have plenty of time to get through to ours, they're by no means spoiled, we are still in the early stages. ",
        "num_comments": 107,
        "comments": [
            "Help them through college, dont give them a whiff of inheritance or any meaningful help until theyre in their 30s. Having to get by on your own in your 20s is eye opening for a lot of folks who grew up with a silver spoon",
            "Its extremely age appropriate for a five-year-old to accept everything as their due. Things you can do: go around the dinner table and share one thing funny and one thing nice that happened to each of you that day. Also, if you get her excited about projects you and she do together to make/give things to other people (start with parents, grandparents, siblings, teachers, etc), this attitude of generosity can easily help foster gratitude, as they are opposite sides of the same coin. But at her age, it will be you who drums up the feelings of generosity through the making and giving of gifts. Also, work on modeling gratitude to her: thank you spouse in a heartfelt way when they give you things. Notice admiringly (and out loud) when people do things that are kind for one another. Cultivate your own gratitude when someone helps you, and tell your daughter about it if she wasnt there when it happened. Being lectured on how you should feel gratitude doesnt foster it.  Actively practicing it and appreciating it wherever you see it will help cultivate it in her as well. Have fun!",
            "Weve gotten along pretty good explaining the concept of parents money and kids money and the fact that other than education nothing else is guaranteed.",
            "I grew up not Fat, but definitely upper middle class, never needing for anything, cars always < 10 years old, big house, private high school, new car (a Civic) as a teenager, etc. (small city, so not high COL).  Gratitude was not a strength of mine.\n\nAnd then I went to college, and my parents gave me almost nothing (tuition was an earned scholarship; they paid for basic room + board only, no extra $, then would only cover cheap rent when i lived on my own).  I got a job, I lived in the cheapest places I could, etc.  I learned gratitude and the value of a dollar real quick.  I was also at a State school, and did a few hundred hours of volunteer work.  Saw lots of different ways life can turn out, and lots of different life situations people can come from.",
            "Your kid is five.  Its nuts that youre working on this now vs teaching basic manners.  Its nuts that you think you can even work in this with a five year old.  But Ill also note your post is very money focused, how special your things and vacations are, so youre probably modeling a worldview of a certain type and its not one that grateful for the little things or things that may be special but not cost money - at least that is the vibe Im getting from your post.   Also, send your kid to public school vs private if you really want to teach this value.  Then again Im almost, not quite fat probably because Im having a hard time caring about another few million so feel free to ignore me.",
            "I can so understand and empathize with your problem, not because I am hugely wealthy but in the last 3-4 years we have been living pretty comfortably especially as it pertains to taking really nice vacations. My background is a bit different, my husband died back in 2020 after a major illness- that was a rough year because he was the primary earner though I was also working. My kids (at that time 7 and 13) saw me struggle- both with their dads illness and loss and financially. But after things turned around, I made some good investments and changed to a much higher paying job -bottom line- we are pretty decently comfortable. Losing my husband changed my attitude to money - it is important to have enough but it is more important to have memories with each other. Thus we travel a lot, so much that both the kids friends frequently comment that we must be rich to do so. My older one finds it easier to understand the difference but not my younger one and I constantly struggle to convey that my priorities are different. I might object to an expensive restaurant or a expensive toy but I dont object to an expensive vacation! It is such a fine line to walk - you will get there, the fact that you realize that you need to teach them is step 1. Best of luck to you.",
            "\"They're by no means spoiled...\"\n\nNarrator: They're spoiled.",
            "I agree with most of what youre saying but why would should it be a goal for your kids to not expect less than a certain level of living conditions? I dont understand that, unless youre talking about basic needs. But it sounds like youre saying your kids should always expect to ride business class.",
            "We grew up smack dab middle class so when things started working out well we didnt change our spending habits. Our kids always had their needs met but going to private schools and universities surrounded by wealth they always had unmet wants. We encouraged them to work for them, and somehow just the right amount of motivation kicked in. \nAs young adults now we feel blessed to see them on a self made trajectory surpassing us by leaps and bounds. Meanwhile saving early helped compounding of our assets beyond our wildest dreams.",
            "I wrote a long thing about raising kids to not know their parents net worth and then deleted it bc I think you have a much simpler problem.\n\nIf you want your kid to express delight whenever he or she gets candy, simply give them less candy. It's really that simple. It may take time, but it will work. This principle works for pretty much everything."
        ]
    },
    "Anyone “taking advantage” of the tax free max giving to kids (ie, 28m)? Advisors like it but I think it would be bad for kids?": {
        "title": "Anyone “taking advantage” of the tax free max giving to kids (ie, 28m)? Advisors like it but I think it would be bad for kids?",
        "score": 93,
        "url": "https://www.reddit.com/r/fatFIRE/comments/1dpvxes/anyone_taking_advantage_of_the_tax_free_max/",
        "content": "Title is the meat of the question.  Even though it’s tax advantaged, giving 28m to someone under 30 seems like it would have a non-0 chance of really messing up their life, sense of worth, and motivation/sense of accomplishment.  Would love to hear counter views.  (Kids are college and hs)\n\nI plan to help kids with houses, etc.  Help launch business ventures (ideally as 0% loans) if they want, and generally be a safety net while allowing them to feel accomplishment.  \n\nMaybe people do it as a trust with strings?  Curious what UHNW on here have done/considered.  \n\nThe advisors are always “this may go away next year, should do this now” and seem more concerned with avoiding taxes than maybe screwing up kids.  I hate estate tax as much as the next guy… but if someone gave me 28m at 21… Jesus who knows what I would have done.  Crash my jet of hookers into a mountain in bad weather?  Shrug.  \n\nThanks for any thoughts and insights.  \n",
        "num_comments": 85,
        "comments": [
            "If you and your spouse each create $14M SLATs for each other, I think that's pretty low risk.  You still control all the money; the kids probably don't need to know about it.  And you can be as restrictive as you want in the SLAT rules.\n\nThat said, I'd take the other side of the story.  My wife and I really could have used an extra few million in our late 20's when we were deciding how many kids to have, what city we could afford to live in.  In our mid-40's we've now made $20M+ and inheriting another $20M won't change anything, whereas getting the money earlier would have made enormous impact... you cant unwind that clock and decide 10 years later you could have afforded a bigger family...",
            "It depends on the kids. I gave my two annual gifts for years and now they have several hundred thousand invested in their mid-20s. They rarely touch it and in fact I tell them to use it for major expenses sometimes as they tend not to.  The reality is they will have plenty when I pass so why not?  \n\nMy nephew, he cant not spend the money he made last week",
            "No one in their right mind would suggest that you give them $28M outright. You gift it to an irrevocable trust that exists for their benefit, and you can put whatever strings/restrictions you want on it. Talk to a good estate planning attorney ASAP about the best way to do it given your unique situation.",
            "Not UHNW, but have family in this area where kids didnt have to work a day in their life.\n\nThey are all wonderful young adults, kind, sweet and caring. But they all seem to struggle with sense of self worth. End of the day, not sure if there is a right answer one way or another, but that large a sum of money at that young an age could put them a significant dissadvantage for life goals. Even post taxes, you have enough to give them a fantastic safety net as they grow on their own.",
            "Question to all giving early dont you miss out on step up in basis?",
            "I find it hard to believe with that net worth you have advisors but no estate attorney?",
            "Theres a clip on YouTube with a news reporter asking a guy buying a lottery ticket what he would do if he won. On live TV l, he says hookers and cocaine!",
            "I would gift as an irrevocable trust with stipulations you can control",
            "I second the irrevocable trust with strings approach.  If set up the right way, the trust can even be used to protect the assets from a kids spouse should things not work out in the long term.",
            "At 28m, taxes are irrelevant. Making sure your kids are capable of receiving the money without ruining themselves is 10000x more important.\n\nI second the idea of an irrevocable trust. Honestly at that high of a number I wouldn't put a lot of strings on it, I would organize it as monthly distributions and let them treat it as their primary income. A good 1% annually for 5-10 years, ramping up to 2% for the next 5-10, then 3% until you determine they're at the age for full access."
        ]
    },
    "What changed for you above $5M income?": {
        "title": "What changed for you above $5M income?",
        "score": 176,
        "url": "https://www.reddit.com/r/fatFIRE/comments/1dpfq5n/what_changed_for_you_above_5m_income/",
        "content": "Maybe a long shot, but don’t know where else to ask. For those of you who have crossed the $5M annual income threshold or similar, did anything majorly change with your lifestyle? \n\nOn pace to exceed this mark this year, and likely much higher next. I feel like I’m reaching the point where I need some household staff quite honestly. Anyone else go down this path? ",
        "num_comments": 133,
        "comments": [
            "The problem for me, and I imagine some other folks, is that making $5M was coming from highly appreciated RSU/ISO/company stock.  So among us there will be righteously good business owners who are throwing off $5M profit per year - God Bless Them.\n\nFor me, it was a tough challenge, because I treated it as a windfall and didn't assume I'd make $5M/year for very long.",
            "Since I stopped working the $5m+ years are behind me. 2023 I made about $2.2m and honestly, I just dont spend it. I was so aggressive about getting my spending under control back when I was younger making $30k-150k per year or so and the habits just kind of stuck. I wouldnt say Im frugal but my post tax spending is really only about $350k/year. \n\nI think the biggest reason is Im planning to have kids and I dont really want to reduce my lifestyle when that happens. My current situation allows me to handle the extra expenses when I do have kids without making any sacrifices.",
            "For me not much changed because of a mindset of retiring early. I do have lifestyle creep but I keep it at a level I know I can maintain in retirement so I dont have to cut back when I pull the trigger. My life would be a lot different if I was not planning to RE. Instead it just accelerates my path to it.\n\nMy coworkers have houses in the 10m+ range, fractional private jet ownerships, etc. I would probably be in the same boat if I thought of my $2.5m post tax as spendable salary. Instead I make sure to keep my spending at less than 3.5% of my RE goal number.",
            "Started posting on Reddit more",
            "Not working now but had few years at 3-5m per year. Nothing really changes. More money for investments and more money for whole family vacation.",
            "Are you talking about a $5M personal salary, or is your business throwing off $5M/yr?",
            "I did 4 consecutive years of 3-5M, then quit to take a career break. I figured if I can't take a break now, I never can. Getting household staff etc sounds fine but is a pain. The real freedom is when you can take a few of those years and just say frack it.",
            "My shit suddenly started smelling like authentic roses. Like at 3m it was always smelling good but at 5 it was like perfume",
            "Dude. Enjoy life. Buy and get whatever the F you want or barely need. There is no second chapter in the book of life.",
            "It really depends....\n\nvery different if you went from 100k to 5M compared to you were making 4M for a few years then now making 5K. probably not much change for the later case."
        ]
    }
}