{
    "Where to get started with Fear and Hunger": {
        "title": "Where to get started with Fear and Hunger",
        "score": 250,
        "url": "https://www.reddit.com/r/FearAndHunger/comments/15noig2/where_to_get_started_with_fear_and_hunger/",
        "content": "# Introduction\n\n[The ancient city](https://preview.redd.it/3ncmr27hcchb1.png?width=6119&format=png&auto=webp&s=2b7db4466b32a03d1a19bf96b1a7aee0ab3f5eea)\n\nThis is a comprehensive newcomer's guide on the Fear and Hunger games, designed to help complete newcomers know where to begin, content creators how to handle content, as well as direct somewhat more experienced people to content they may not be familiar with. You don't have to read the whole thing, just use the contents to find any sections that are relevant to your needs.\n\nContents\n\n1. What is Fear and Hunger?\n2. How do I buy/play the games?\n   1. For content creators\n3. Which game should I start with?\n4. Official channels by the creator\n5. Other frequently asked questions\n6. Useful tools & resources\n7. Image Sources\n\n# 1. What is Fear and Hunger?\n\n\n***Fear & Hunger,*** (in the community often called 'Funger') is a horror dungeon crawler indie RPG game series that currently contains two games 'Fear and Hunger' and 'Fear and Hunger 2: Termina'. The first game was released on 11 December 2018 and is currently in version 1.4.1. You can watch the release trailer for 'Fear and Hunger' here: [https://www.youtube.com/watch?v=6lLtw3ejnGs](https://www.youtube.com/watch?v=6lLtw3ejnGs)\n\nTermina was released on 9 December 2022, is currently in version 1.9.1 and is, unlike the first game, still getting irregular updates. You can watch the release trailer for 'Fear and Hunger 2: Termina' here: [https://www.youtube.com/watch?v=OleEkB-7by0](https://www.youtube.com/watch?v=OleEkB-7by0)\n\nThe series is developed and maintained by indie developer Miro Haverinen.\n\nAt the start of 2023 and before the middle of the same year, the games received massive popularity spikes due to popular video content creators.\n\nThe games are in its core very cruel, setting and gameplay wise. They feature mature themes such as disturbing violence and sexual content. Players should be aware, that genitals will be shown in the games. There are a lot of references in both games to other media such as the silent hill series, berserk and many horror movies. To list all references would be damning, so I would like for you to find and spot them in the games yourself.\n\nSetting wise the first game takes place in medieval times, depicting an alternate reality where mighty gods, magic and inhumane monsters exist. The second game, Termina, continues the timeline of the first, and although there are multiple endings, the continuity is obvious for the avid dungeon survivor. Termina takes us to a post-world war era, but with technology more advanced in some places then others. Gods and magic still exist and you have to deal with the consequences of living in a world, with beings much mightier then yourself. The second game build and improves on all aspects of the first and is generally considered more polished and beginner friendly.\n\n# 2. How do I buy/play the games?\n\n[White mold apartments from Termina \\(Fanart\\)](https://preview.redd.it/135fd7ibhchb1.png?width=960&format=png&auto=webp&s=6d11ae7352da3686aecb3ffa8ca73a24371674ac)\n\nBoth games are available on steam and itch.io, however on some countries the games are region-blocked on steam, so you have to get them from itch.io\n\n## 1. For content creators\n\nIf you want to upload or stream the games, be aware, that some popular platforms such as youtube, twitch, etc. don't allow to directly show genitals on their platforms. Therefore it is recommend to use one of the censor mods available to censor out platform-inappropriate content from the games. The most popular ones will be linked here and can be easily installed by downloading and replacing the correct files in your game folder.\n\n**'Fear and Hunger' censor mods:**\n\n[https://frapollo94.itch.io/fear-hunger-bug-fix-mod](https://frapollo94.itch.io/fear-hunger-bug-fix-mod) by Frapollo94\n\n\\- This mod does not only censor all platform-inappropriate characters, but also fixes some of the most annoying and game-breaking bugs you can encounter in the game. To learn how to use the mod, watch this video by the creator: [https://www.youtube.com/watch?v=0kqjD9YHIRM](https://www.youtube.com/watch?v=0kqjD9YHIRM) or read the instructions on the itch.io page of the mod.\n\n&#x200B;\n\n[https://www.youtube.com/watch?v=7KNn64kngho](https://www.youtube.com/watch?v=7KNn64kngho) by NoCommentar\n\n\\- This mod is famous for replacing all genitals with 'pinecone pigs', the video contains download and install instructions in the description.\n\n&#x200B;\n\n[https://www.youtube.com/watch?v=tmk7q0zPiXY](https://www.youtube.com/watch?v=tmk7q0zPiXY) by ADarkRaccoon\n\n\\- This mod also censores the audio and replaces genitals with black shadows, the video contains download and install instructions in the description.\n\n&#x200B;\n\n**'Fear and Hunger 2: Termina' censor mods:**\n\n[https://www.youtube.com/watch?v=6LPJcCMeqM8](https://www.youtube.com/watch?v=6LPJcCMeqM8) by NoCommentar\n\n\\- This mod is famous for replacing all genitals with 'pinecone pigs', the video contains download and install instructions in the description.\n\n&#x200B;\n\n[https://www.youtube.com/watch?v=d-0QqtUb6t8](https://www.youtube.com/watch?v=d-0QqtUb6t8) by ADarkRaccoon\n\n\\- This mod replaces genitals with black shadows, the video contains download and install instructions in the description.\n\n# 3. Which game should I start with?\n\n[Marina \\(the occultist\\) from Termina \\(Fanart\\)](https://preview.redd.it/mlovzuhcichb1.png?width=960&format=png&auto=webp&s=dadcdaf459a4bc3245f4ca6cf87f9fa71ef93e7b)\n\nIf you plan on playing both games you should definitly start with the first one. Not only do you get a continues overarching storyline, you also get to experience how the creator improved his game-making skills from one game to another. Playing Termina first and then the original can be difficult, because you loose a lot of quality of live features Termina provided.\n\nIf you want to tip your toes into the franchise or just want to experience some of Funger, Termina is your way to go. This game is much more beginner friendly.\n\n&#x200B;\n\n# 4. Official channels by the creator\n\n[Miro interacting with the community on X \\(formerly Twitter\\)](https://preview.redd.it/h11im8syechb1.png?width=1170&format=png&auto=webp&s=aaef903b4bb79893a0ea0d5defded395a231df8f)\n\nX: [https://twitter.com/happy\\_paintings](https://twitter.com/happy_paintings)\n\nYoutube: [https://www.youtube.com/@fearhunger3983](https://www.youtube.com/@fearhunger3983)\n\nTumblr: [https://fearandhunger.tumblr.com/](https://fearandhunger.tumblr.com/)\n\n# 5. Other frequently asked questions\n\n[A coinflip is an always present gameplay mechanic of the series](https://preview.redd.it/77phvkjjjchb1.png?width=128&format=png&auto=webp&s=53c90cc665e4d9a0ae12e5ce387d2db6b61dfa6e)\n\n **Q: Can you give me some survival tips? My character keeps dying and I don't know how to progress.**\n\nAvoiding enemies and trying new things out will go a long way. Make sure to keep a healthy hunger meter before entering fights, as hunger will affect your performance during combat. Be prepared to die anytime and ignore the toilets. If you have specific questions you can always ask them here on the reddit.\n\n **Q: Is there a \\[insert language\\] translation mod.**\n\nProbably not. This can be outdated, but there currently aren't many language packs available. If you stumble across the internet you might find a russian and spanish translation, but they are incomplete. There is also an english translation mod (because there are a lot of grammatical errors in the game).\n\n **Q: Where Discord link?**\n\n[discord.gg/fearandhunger](https://discord.gg/fearandhunger)\n\n **Q: Can X character survive the dungeon?**\n\nNo. Crow Mauler pecks their head of.\n\n **Q: How to masturbate without killing the girl?**\n\n Ok, thats enough questions.\n\n# 6. Useful tools & resources\n\n[Enki \\(the dark priest\\) from Fear and Hunger 1](https://preview.redd.it/1pn67smsichb1.png?width=816&format=png&auto=webp&s=e5841fe7abd98e371a8d0d63c65cb94a2583cc36)\n\nThe official wiki: [https://fearandhunger.wiki.gg/wiki/](https://fearandhunger.wiki.gg/wiki/). Do not use the fandom wiki, as this one is not moderated anymore and there are trolls and misinformation on the fandom wiki.\n\nThe youtube channel of the creator: [https://www.youtube.com/@fearhunger3983](https://www.youtube.com/@fearhunger3983) contains all the OST, dev updates and more\n\n# 7. Image Sources\n\n[left to right: Moonless, Girl, D'arce \\(the Knight\\), Cahara \\(the Mercenary\\) from Fear and Hunger \\(Fanart\\)](https://preview.redd.it/jodz7xtzkchb1.png?width=960&format=png&auto=webp&s=8d054da36b72ef7ee195f4a5b4d91cfeb399bddc)\n\n[https://www.reddit.com/r/FearAndHunger/comments/11cg8q5/white\\_mold\\_apartments/](https://www.reddit.com/r/FearAndHunger/comments/11cg8q5/white_mold_apartments/)\n\n[https://www.reddit.com/r/FearAndHunger/comments/141wrbs/noted/](https://www.reddit.com/r/FearAndHunger/comments/141wrbs/noted/)\n\n[https://www.reddit.com/r/FearAndHunger/comments/10zs5h1/sleeping/](https://www.reddit.com/r/FearAndHunger/comments/10zs5h1/sleeping/)\n\n&#x200B;\n\n&#x200B;",
        "num_comments": 61,
        "comments": [
            "Feel free to correct and add stuff by writing a comment here.",
            "could've  ask for some permission before posting my art tho..",
            "is there a reddit for fear and hunger that isn't 90% awful oc's and art that doesn't fit the setting?",
            "Yall get rid of that mf who was bitchin? Or did they disappear themselves? Was kinda enjoying that ngl.",
            "How do u add the little thing of a character next to ur name?",
            "So, this sub is not NSFW now?",
            "HOW THE FUCK DO I GET TO LEVEL 6 MINES",
            "Is there an expected date/timeframe for the Termina update? I dont see many talking about it and Im getting impatient. Haha",
            "Can you add cozy mod to the mode?! This is a simple image skin mode!",
            "Are there any accessibility mods? I can't use my hands quickly, so I'm getting caught by every monster. Something to slow them down or something?"
        ]
    },
    "🫵👁️": {
        "title": "🫵👁️",
        "score": 111,
        "url": "https://i.redd.it/sk86pneg5h9d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "No, please don't break it down ancient death magic style manmade horror Oosa!",
            "What if i ate it? will it taste good",
            "Nah, it's joever ",
            "Smiling Fungs",
            "*No, please don't break it*\n\n*Down ancient death magic style*\n\n*Manmade horror Oosa!*\n\n\\- Boasconstrictor25\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")"
        ]
    },
    "Could this painting be the inspiration for Nas’hrah?": {
        "title": "Could this painting be the inspiration for Nas’hrah?",
        "score": 485,
        "url": "https://i.redd.it/k2lyjzt1ie9d1.jpeg",
        "content": "I recently came across this painting called The Apparition by Gustave Moreau, and the image of John the Baptists head in this painting is strikingly similar to Nas’hrah. I looked around and couldn’t find anyone talking about this, and it isn’t mentioned in any of the wiki’s. ",
        "num_comments": 14,
        "comments": [
            "Ts actually goes hard asf",
            "I think of the grandma from the Chocolate spongebob episode.",
            "Is it historic, religious, or fictional? Yes! Does it look similar to something from Funger? Yes! Your answer is (probably) a yes",
            "Well I guess Nashrah is more akin to Mimir from Norse mythology",
            "I don't know, but thanks for the new wallpaper man.",
            "Someone do a Paint meme with this",
            "What even is the context of this? Last time I checked Jesus wasn't beheaded. And when did Jesus's floating head float around?",
            "That's not Jesus, that's John the Baptist",
            "I said in the post its John the Baptist. The context is that that woman is Herods daughter Selome, who requested that her father kill John at her mothers behest. Beyond that, the actual meaning of the painting is considered a mystery",
            "Makes sense why you have to go to an island to fight her"
        ]
    },
    "PUT ME IN THE ARMS OF THE SULFUR GOD ALREADY": {
        "title": "PUT ME IN THE ARMS OF THE SULFUR GOD ALREADY",
        "score": 59,
        "url": "https://i.redd.it/zvsnqphsoh9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Me on Tanaka and O'saa.",
            "Oh god i was attracted to everyone in my party on my last run, im so cooked"
        ]
    },
    "Art block has been kicking my ass lately so had to draw something silly": {
        "title": "Art block has been kicking my ass lately so had to draw something silly",
        "score": 36,
        "url": "https://www.reddit.com/gallery/1dralv3",
        "content": "Not my best work, but it's funny (to me at least)",
        "num_comments": 2,
        "comments": [
            "is that a little maneba on the side? neat detail!",
            "Yes! Thanks (:"
        ]
    }
}