{
    "Work-In-Progress": {
        "title": "Work-In-Progress",
        "score": 5,
        "url": "https://www.reddit.com/r/feedthebeast/comments/1dmqqru/workinprogress/",
        "content": "Welcome to **Work-In-Progress**!\n        \nShow off your current builds, finished and finalised or still under maintenance. They can be anything from a base tour to a small machine that you made, whatever you are working on. Whether you want to just show off or ask for some help just make a post. You can keep us up-to-date with your builds week by week and, once you're done, feel free to make a dedicated post to the main sub!\n        \nTop-level comments should include a link to an Imgur album (and suitable captions would be nice). Constructive criticism should be used to express opinions on other's work. Don't forget the OP would have spent a lot of time on their project.\n        \nTo find previous \"Work-In-Progress\" posts, [click here](http://www.reddit.com/r/feedthebeast/search?q=Work-In-Progress+subreddit%3Afeedthebeast+author%3AAutoModerator&restrict_sr=on&sort=new&t=all).\n       \nAs always, please abide by the [subreddit's rules](http://www.reddit.com/r/feedthebeast/wiki/rules).",
        "num_comments": 1,
        "comments": [
            "Im working on a modpack titled MC + on modrinth. If you are intrested please visit [https://modrinth.com/modpack/mc-+](https://modrinth.com/modpack/mc-+) although it is under review so yeah"
        ]
    },
    "I got greggified. Now ready to reach stargate.": {
        "title": "I got greggified. Now ready to reach stargate.",
        "score": 1292,
        "url": "https://i.redd.it/ys54i9c9f49d1.png",
        "content": "",
        "num_comments": 54,
        "comments": [
            "This was reported but I'm going to leave it up because that level of dedication is definitely one of the things of all time.",
            "Artist is nini.inks on instagram !",
            "Very cool, I was thinking about getting a circuitry/cyberpunk tattoo of a logo myself. That way it still looks cool to someone who has no idea what the logo is from.",
            "He is the greggen one. He must link the stargates to cast away the dark and undo the curse of cringe in man. Hail the righteous successor to lord Greglyn.",
            "My favourite modpack. Horizon new tech greg",
            "This is fucking insane lmao",
            "Permanent bonus to secondary outputs from ores.",
            "his name is tech, greg tech",
            "Throughout machines and circuits, I alone am the gregged one.",
            "That looks really cool, but on your arm? You must really be John Greg."
        ]
    },
    "Not a realistic factory if you don't illegally dump your hazardous substrate waste from ethylene production to the ocean.": {
        "title": "Not a realistic factory if you don't illegally dump your hazardous substrate waste from ethylene production to the ocean.",
        "score": 148,
        "url": "https://i.redd.it/ufx99q9n9h9d1.png",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Now we need a mod that makes those items not despawn ever, and actually float along rivers, pollution is lag",
            "I don't know if it already exists, but I would love a mod that adds pollution, and that it would work with pretty much every tech mod, so that your actions have consequences.",
            "For a second I thought you were dumping clay and I was about to kill you.",
            "its still illegal? you didnt lobby to make it legal for your company to do that?  unrealistic",
            "I mean, it's not illegal if there's nobody to stop you",
            "It's legal in my world.",
            "A better idea, they accumulate at the base and form hazardous waste block that emit radiation and destroy all ocean life",
            "There's pollution of the realms but I don't think it adds water/land pollution. Only air",
            "Gregtech has pollution! Wonder how easy it would be to make a side mod that adds it to other tech mods.",
            "No, because players don't care about ocean life or radiation. They do however care about lag."
        ]
    },
    "Why do so many people rush to get the latest version of a mod?": {
        "title": "Why do so many people rush to get the latest version of a mod?",
        "score": 70,
        "url": "https://www.reddit.com/r/feedthebeast/comments/1dr2dmg/why_do_so_many_people_rush_to_get_the_latest/",
        "content": "Like, as soon as a Minecraft update comes out, there are so many people in the comments of some mod begging for the latest version. I'm just wondering why, because there is no way all the other mods they have installed are updated already, and if they don't have other mods installed then shouldn't they at least know that it takes time to develop a Minecraft mod?",
        "num_comments": 27,
        "comments": [
            "Some people (especially kids) dont understand that porting a mod is not always a one click process",
            "1. They have no idea about how much effort goes into updates and don't intend to learn.\n2. They might only be playing with a few mods, and many smaller mods do update fairly quickly.",
            "Beats me. I could play the same modded minecraft version for ages without feeling rushed to change, especially if its'd be only for a couple of mods.",
            "The benefits of sticking to 1.12.2 ",
            "So they just ask the developers of every mod they want to use to update",
            "Version chasing devs are really good at being wet blankets.",
            "I know some people feel like they are missing out on content if they cant play the new minecraft update with their mods. They feel like they are required to play with the mods, and so they have to wait for a mod to be updated so they can finally try the new version",
            "It's mostly children, so don't read too far into it.",
            "I don't get it either tbh.\n\nA lot of the new stuff is neat, but it's not like you *have* to be on the latest version at all times lol",
            "I personally hate version chasing, the community not being able to stick to one version post 1.12.2 is really annoying"
        ]
    },
    "I feel like a lot of people only use Web Displays and don't know that WaterFrames can load local files.": {
        "title": "I feel like a lot of people only use Web Displays and don't know that WaterFrames can load local files.",
        "score": 16,
        "url": "https://v.redd.it/dyi9soveoh9d1",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Not gonna lie I was prepared for a rick roll",
            "Missed opportunity",
            "The mod can load videos that you put in the .minecraft folder if you type local:// followed by the name of the video file. This also works in multiplayer apparently but I haven't tested it.\n\nIt cannot load websites but if you enter the url of a video it will play it without ads.\n\nMap was not made by me: [https://www.planetminecraft.com/project/deluxe-cinema/](https://www.planetminecraft.com/project/deluxe-cinema/)\n\nDemonstration video (String Theory): [https://www.youtube.com/watch?v=SZzehktUeko](https://www.youtube.com/watch?v=SZzehktUeko)"
        ]
    }
}