{
    "Fashion news - June 24, 2024": {
        "title": "Fashion news - June 24, 2024",
        "score": 7,
        "url": "https://www.reddit.com/r/femalefashionadvice/comments/1dn9uzv/fashion_news_june_24_2024/",
        "content": "Here you can share all the fashion related news you have come across recently. Whether it is a newly released runway, an interview with a designer, a new label slashing onto the scene or speculating new trends emerging, everything news related is welcome here.",
        "num_comments": 3,
        "comments": [
            "Hey ladies, guy here. I'm looking to treating somebody to a designer bag for about 2k, what's the best option out there? Looking for something that doesn't have the logo plastered all over the place but is in style",
            "[removed]",
            "Your post was removed because we believe that you are advertising your brand. We do not allow brands on this subreddit. If you believe that your post was wrongly removed, please [message the moderators](https://www\\.reddit\\.com/message/compose?to=%2Fr%2Ffemalefashionadvice&subject=about my removed brand content&message=I'm writing to you about the following {kind}: {url}. %0D%0DMy issue is...)."
        ]
    },
    "Daily Questions Thread June 29, 2024": {
        "title": "Daily Questions Thread June 29, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/femalefashionadvice/comments/1dr7tw6/daily_questions_thread_june_29_2024/",
        "content": "This  thread is for individual style questions that you may have, especially  those that don't warrant their own thread. We all want a diversified  opinion, so feel free to answer any questions (of which you know the  answer).\n\n***To  get the best responses, remember that people cannot; look into your wardrobe, know what style you normally like or what words like affordable or practical mean to you so please include any relevant details such as  your budget, where you live, what stores are available to you, etc.***\n\nExample questions:\n\n* Are there any basic crewneck white t-shirts that are opaque and do not have cap sleeves for <$25 available in Australia?\n* Is this dress and shoes suitable for an evening wedding with a cocktail dress code taking place in a \\[venue type\\]?\n* If  I like the outfits in this \\[imgur album / pinterest board\\], what are  some specific items I can look into to start dressing like that, and  brands with this look that carry plus sizes?\n* Does this outfit look neater with the pants cuffed or uncuffed?\n\nIf you'd like to include a picture, you can now post pictures directly in the comments, without having to link an imgur album.",
        "num_comments": 24,
        "comments": [
            "I need help im in my early 20s and middle eastern our weddings are EXTRA i have so many weddings and proposal parties this year and i struggle to find dresses that fits my body and looks good im so tired of wearing things just cuz it looks \"fine\" on my body. When i see something i like on a rack i wear it and it looks awkward on me and weird on my bust or fits awkwardly. I dont have enough time to order online and i get to scared that it will not fit and look bad on my body I always look older than i actually am if anyone has any advice pleaseee im all ears. for context im around 160cm and 72kg and i have a bigger bust and a lot of my fats are concentrated on my stomach (a big part of the problem is dresses arent made for a bigger bust so even when i size up and get it tailored it looks off) what shape dresses do you guys suggest and what are your favorite dress shops to order from?\n\nbtw when i say extra i mean it a lot of people wear gowns\\*",
            "Where can i get petite, not low-waisted plaid straight legged pants in both lighter material (i.e., good for summer but not linen) and thicker (e.g., wool material)? Could not seem to find them in my go-to online stores.",
            "hello, im traveling to london this summer just for a few days, and i would be thankful for some recommendations for clothing stores. I buy a lot second hand, so good charity shops or something a bit unique, small business or st like that. thnx 💋",
            "I don't think either are particularly flattering, but the wider are better than the skinny. The tighter fit has some gaping at the waist, but are little too tight across your glutes and lower abs. The wider ones at least fit like a standard cargo pant. If you just need something to wear casually, I'd keep the wider. If they were expensive, I'd return both and keep looking.",
            "Can you see the fabric pulling at the waist? That means they're both too small. If the next size up is also a poor fit, that means you need to look for a different style altogether.",
            "Tuck it into jeans or pair it with a pair of linen trousers and a plain white tank (wearing it sort of like a shirt jacket)",
            "I love soleil soleil! I bought a set from them in a different print and used the tunic top as a swimsuit cover up. Or I tied it in front to crop it and paired it with a crochet skirt.",
            "I don't think it's cottagecore at all, more like 60s/70s quirky. Like the original Velma and Daphne from Scooby Doo with an unlimited budget in the kid's section, but on LSD.\n\n(Except that sequin sweater, that's just bad 80s.)",
            "Twee. Joanie is a good place to look.",
            "I love their swimwear, I’ve bought from them before. Their size chart is accurate"
        ]
    },
    "What are the IT heels this summer? ": {
        "title": "What are the IT heels this summer? ",
        "score": 26,
        "url": "https://www.reddit.com/r/femalefashionadvice/comments/1dqibso/what_are_the_it_heels_this_summer/",
        "content": "Looking to purchase new pair of heels but I honestly have no idea where to start. My last purchase was from Gianvito Rossi and I absolutely love them. ",
        "num_comments": 23,
        "comments": [
            "Thought this had to do with Information Technology somehow and was very interested in learning about heels that would be required",
            "Are you looking for workplace heels, formal heels, party heels, or are you the kind of person who wears heels to the grocery store?",
            "Prada green satin mules or The Row Harlow sandals.",
            "I feel there are no IT heels this summer as heels seem to be on the way out as a whole.",
            "A stiletto pump is still in (Stuart Weitzman or Sarah flint have been my go to for pumps and sandal this year. Comfy and sexy)",
            "I'm not seeing any heels anywhere in my city, everyone is going for something more comfortable. My time has finally come, heels make me cranky",
            "Heck, I'm still wearing my Jessica Simpson and loving them but that's just me",
            "Same! Like what kind of heels would I wear to my tech job?",
            "Omg no😂 but I do have a tech job and whilst I dont really wear heels, I love the hermes oz mules",
            "Same. I was like, so what are the in heels for sys admins?"
        ]
    },
    "Daily Questions Thread June 28, 2024": {
        "title": "Daily Questions Thread June 28, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/femalefashionadvice/comments/1dqg1xq/daily_questions_thread_june_28_2024/",
        "content": "This  thread is for individual style questions that you may have, especially  those that don't warrant their own thread. We all want a diversified  opinion, so feel free to answer any questions (of which you know the  answer).\n\n***To  get the best responses, remember that people cannot; look into your wardrobe, know what style you normally like or what words like affordable or practical mean to you so please include any relevant details such as  your budget, where you live, what stores are available to you, etc.***\n\nExample questions:\n\n* Are there any basic crewneck white t-shirts that are opaque and do not have cap sleeves for <$25 available in Australia?\n* Is this dress and shoes suitable for an evening wedding with a cocktail dress code taking place in a \\[venue type\\]?\n* If  I like the outfits in this \\[imgur album / pinterest board\\], what are  some specific items I can look into to start dressing like that, and  brands with this look that carry plus sizes?\n* Does this outfit look neater with the pants cuffed or uncuffed?\n\nIf you'd like to include a picture, you can now post pictures directly in the comments, without having to link an imgur album.",
        "num_comments": 78,
        "comments": [
            "I'm going back to work in person after a few years remote. I found some pants I absolutely love and bought a few pairs but they don't have pockets. I'd love some recommendations on bags that will fit my phone and a few tiny items! I've only ever owned crossbody bags but I want something I can feel more comfortable wearing most of the time. I'd also prefer something that won't look outdated in two years which is why I'm hesitant to get a belt bag/chest bag. Thank you!!",
            "Not exactly a style question but I hope it's allowed. Are there any sites where you can see items of clothing on actual people? Something where people submit images of them wearing photos of clothing so you can get an idea of the fit on different shapes/sizes? It's one of my biggest issues with online shopping, you have no idea what it'll look like on different body types",
            "Has anyone bought anything from Asta Resort? Does the quality justify the price?",
            "what colour underwear should you wear under thin white pants? like bloomers?",
            "hello!\n\nI'm a fan of the boobs out blazer look and was hoping to try it sometime soon at a local art event. I tried googling the answer to this question but google grows more useless by the day--how does one keep the blazer stuck to the chest so that stuff isn't gaping or flopping around everywhere? thanks!",
            "Will rose gold heels pair well with a mustard yellow dress? I screwed up and bought the wrong heels. Trying to salvage it now. Please help🥲.",
            "Anybody know of a mermaid theme boutique or designer?",
            "Anyone have suggestions for classic button-down shirts for someone with real thick upper arms and semi-broad shoulders? My biggest challenge when shopping for button-down shirts is that they rarely have stretch and they almost never fit my upper arms unless I size up so much that they're far too big in the torso.",
            "I love Hobo for smallish bags. They use nice leather and their designs are cool but not tremendously eye catching, and they do a lot with tuckable straps so you have options for carrying them.",
            "Considers going to a tailor/seamstress/drycleaner and having pockets added."
        ]
    },
    "A good wardrobe ": {
        "title": "A good wardrobe ",
        "score": 1,
        "url": "https://www.reddit.com/r/femalefashionadvice/comments/1dqp7pz/a_good_wardrobe/",
        "content": "I buy a ton of clothes but I always feel like I have absolutely nothing to wear. What is your guys' advice on creating a functional wardrobe that you actually love?",
        "num_comments": 0,
        "comments": []
    }
}