{
    "POSTING GUIDELINES": {
        "title": "POSTING GUIDELINES",
        "score": 136,
        "url": "https://www.reddit.com/r/femboy/comments/17qhbd3/posting_guidelines/",
        "content": "## Titles   \nWhen writing a title to your post, please make sure you're not:      \n- Making it NSFW/explicit in nature.     \n- Engagement baiting, such as:   \n  - Telling the user to upvote or comment a specific thing (\"say X if you think i'm cute\", \"describe me with one word\", \"first thing that comes to mind seeing me?\", \"call me cute\", \"rate me\", \"upvote if you think i'm cute\").   \n  - Simple yes/no questions (\"do i look cute?\", \"do i pass?\", \"do you like me?\", \"am i fem?\").   \n  - More general/original questions do not fall under this and are allowed (such as \"what do you think of my outfit?\", \"which top should i go with?\").      \n- Baiting the reader by including suggestive questions or propositions in it         \n  - (e.g. \"i wanna snuggle with you\", \"what would you do with me?\", \"i'm your femboy\", \"can i be your femboy?, am i X enough for you, would you date me\").   \n- Sympathy baiting/fishing for compliments by being self-demeaning         \n  - (e.g. \"am i ugly?\", \"sorry for not being cute\", \"thought i'd share despite being X\", \"i'm too X to be a femboy\").     \n- Asking for messaging or DMs in any way      \n  - (e.g. \"looking for X\", \"looking for people in X\", \"DM if you want X\").     \n- Advertising or mentioning your socials or other accounts in any way     \n  - (e.g. \"should i wear this on stream\", \"instagram: XXXX\", \"follow me on snapchat\", \"check my profile for more\").       \n\n## Content\nFor a post to be considered SFW and thus approved, you must:        \n- Have sufficient skin coverage (for bottoms, it must cover as much as short shorts, for top, sports bra)         \n  - Lingerie does not count even if it covers the same amount.   \n  - Having any of the \"to cover\" areas be transparent does not count either.   \n  - Censoring them with something else does not count.   \n  - Having things barely show or raising your clothes as a \"tease\" falls under NSFW.   \n- Not show a visible bulge or genital outline.  \n- Not show underwear at all, not even a peek.  \n- Not have the picture/angle focus on butt.  \n- Not have any kink or nsfw gear in the picture, including leashes or certain outfits (like tight latex suits, bunny suits).  \n- Be more than a legs only pic, as in shows more than just lower body.  \n- If you have a watermark on it, then it must be of your reddit username, nothing else.  \n\n## FAQ\n- \"Will i get banned if my post doesn't follow this?\"\n  - It depends, if it's explicit or blatantly/intentionally NSFW, then yes, it will result in a ban, otherwise all that will happen is that the post will get removed.\n- \"*Insert post* is still here despite breaking the guidelines, how come?\n  - If it was submitted before the guidelines were posted, then it is not covered by it, as we do not seek to retroactively punish everyone when the full guidelines weren't even there.\n  - **HOWEVER** if it's clearly NSFW or the post has been submitted after this, then please do report it, as our moderators cannot see every single post on their own and we need the community to help us with this.\n- \"My post got removed/isn't showing up despite respecting the guidelines! why?\"\n  - If it did respect the guidelines then it is likely the automod or spam filter, bring it up to us in modmail and we'll approve it\n\n## Need any help or clarification? send us a message through modmail!",
        "num_comments": 2,
        "comments": []
    },
    "The official r/femboy wiki is now live (discord link in sidebar)": {
        "title": "The official r/femboy wiki is now live (discord link in sidebar)",
        "score": 113,
        "url": "https://www.reddit.com/r/femboy/comments/1960wxt/the_official_rfemboy_wiki_is_now_live_discord/",
        "content": "### We are pleased to announce that we have a wiki now!\n\n\nThe wiki covers all kinds of questions that a newcomer might ask, along with advice that we deem essential, such as how to manage your body image.    \n\nIt's been in the works for a long while now, as we wanted to ensure that it had the most accurate and up to date information. To access it just click on the link below or on the top bar.\n\n## [**Link to wiki**](https://www.reddit.com/r/femboy/wiki/index/)\n\n### We also moved the discord link to the sidebar now, if you cannot view it then you can join through [**here.**](https://discord.gg/rslashfemboy)",
        "num_comments": 24,
        "comments": [
            "As a newcomer, this wiki is a godsend. Thank you folks so much for making it!",
            "Is there also a backup link for the wiki?",
            "Any update on hair? :3 trying out new styles and need some help ",
            "Need help with makeup and hair as I am struggling with it lol but I look stunning a been told with my makeup on and hair done xx and my mini skirt and my trainer sock with lace on it and my nice boots  x",
            "This is awesome, thank you!",
            "That's good. Tough week- so far. ..",
            "Currently it's backed up on a private google doc, if anything happens to the original one then we'll add an alternative link.",
            "Unfortunately hair styling is lower down the list, currently working on the hair care section though",
            "Wow",
            "Omg!!! Thanks for this!!!"
        ]
    },
    "Does anyone think I'm pretty? 💜🧸": {
        "title": "Does anyone think I'm pretty? 💜🧸",
        "score": 368,
        "url": "https://i.redd.it/qj0q1u1nuh9d1.jpeg",
        "content": "",
        "num_comments": 37,
        "comments": [
            "Yes, and that outfit looks great. \nI hope you have a good day. ",
            "Hard to tell with the mask in front of your face. What I can see looks great though.",
            "personally no, i like blondes or very black chicks, try again",
            "Ofc, but does that not hurt your nose?",
            "Think? I can't think straight because of how beautiful you are.",
            "Love  the outfit and yes you are gorgeous  ",
            "Moi je trouve et jolie tenue.",
            "Hello and you are perfect gorgeous ",
            "I certainly think you are pretty. You have beautiful eyes.",
            "Me"
        ]
    },
    "I should post more often 😅": {
        "title": "I should post more often 😅",
        "score": 101,
        "url": "https://i.redd.it/ofpyxb273i9d1.jpeg",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Your fashionable beauty is always so stylish and pretty, and anytime that you post a picture it is a lovely highlight for this site. Your look with the radiant, blue dress is so beautiful, and the lovely high heels complement your look so perfectly.",
            "Wow, please can you help me lift my jaw from the floor",
            "And you should let me worship your regal body!",
            "Wow you are very elegant and beautiful",
            "Oh yes please",
            "Yes you should!",
            "Yes you should ",
            "Hell ye",
            "Elegant and beautiful.",
            "ABSOLUTELY!!!!! \n"
        ]
    },
    "My first goth style outfit :3": {
        "title": "My first goth style outfit :3",
        "score": 96,
        "url": "https://i.redd.it/gh9aw7hi1i9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Love it you look amazing ",
            "That should be your signature look",
            "LOVE IT YOU LOOK SO BEAUTIFUL!",
            "Im gonna get more outfits in this style soon hopefully lol",
            "Thats right it needs a tongue :p",
            "Omg the tummy~",
            ":p",
            "Thank youuuuuu",
            "Oh yea",
            "**REMINDER:** This subreddit is **STRICTLY SFW**, Creepy or NSFW posts/comments will result in a permaban, and so does gatekeeping the femboy label.  \n\nMinors are also not permitted to participate in the subreddit. For more details on what is allowed or not refer to [**posting guidelines here**](https://www.reddit.com/r/femboy/comments/17qhbd3/posting_guidelines/).\n\nIf you want any advice about anything related to presenting fem (like hair removal, skin care, fitness) then we highly recommend checking out [**our wiki here**](https://www.reddit.com/r/femboy/wiki/index/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/femboy) if you have any questions or concerns.*"
        ]
    }
}