{
    "Daily Questions & FAQ Megathread June 29": {
        "title": "Daily Questions & FAQ Megathread June 29",
        "score": 2,
        "url": "https://www.reddit.com/r/ffxiv/comments/1dr70mr/daily_questions_faq_megathread_june_29/",
        "content": "## Hello, all! We hope you're enjoying your time on FFXIV!\n\nThis is the post for asking ***any*** questions about FFXIV. Absolutely any FFXIV-related question: one-off questions, random detail questions, \"newbie\" advice questions, anything goes! Simply leave a comment with your question and some awesome Redditor will very likely reply to you!\n\n* Be patient: You might not get an answer immediately.\n* Be polite: Remember the human, be respectful to other Redditors.\n\n**Could your question already be answered?**\n\n* [Check the FAQ!](https://www.reddit.com/r/ffxiv/wiki/general_information/faq)\n* [FAQ: Why can't I create a new character?](https://www.reddit.com/r/ffxiv/wiki/definitive_faq#wiki_why_can.27t_new_characters_be_created_for_the_server_i.27m_trying_to_join.3F)\n* [Search the subreddit](https://www.reddit.com/r/ffxiv/search?q=&restrict_sr=1&sort=new)\n* [Browse the subreddit wiki](http://www.reddit.com/r/ffxiv/wiki/)\n* Use Google to [search the subreddit](http://www.google.com/?gws_rd=ssl#q=site:reddit.com%2Fr%2Fffxiv+Search_Terms_Here) or [perform a general search](https://www.google.com/)\n\n**Feeling helpful?**\n\nCheck this post regularly for new questions and answer them to the best of your knowledge.\n\n[Join the Discord server](https://discord.gg/ffxiv) and answer questions in the #questions-and-help channel.\n\n**Protect your account!**\n\nMinimize the risk of your account being compromised: Use a strong & unique password, enable [one-time password (OTP)](https://www.square-enix.com/na/account/otp/), don't share your account details.\n\nRead our [security wiki page](https://www.reddit.com/r/ffxiv/wiki/general_information/security) for much more information. **Free teleports**: Enabling OTP will not only help to protect your account but it'll also allow you to set a free teleport destination!\n\nFor your convenience, [all daily FAQ threads from within the past year can be found here.](https://www.reddit.com/r/ffxiv/search?q=title%3A%22Daily+Questions+%26&+FAQ+Megathread%22+author%3AAutoModerator&restrict_sr=1&t=year&sort=new)",
        "num_comments": 87,
        "comments": [
            "so i just used the free fantasia that you can get from a quest with a timer, and i just load the appearance i saved to change my looks which only took seconds. So how come it went from 60 minutes to 9 minutes remaining?",
            "Am I understanding the DRK changes right? DRK lost MP from 2 stacks of Bloodweapon but it was moved to the Scarlet Delirium combo so for DT content, nothing changed but for EW content and older DRK now gains less MP?",
            "Can I safely discard any raid token item with a description saying stuff like \"lost its value entirely,\" \"worthless\" or \"fallen out of style?\" They're all replaced by poetics upgrades now, right?",
            "Is there lvl 80 pictomancer and viper guide?",
            "In quests where i play as another character, their hotbar/skills are separate from my usual ones and have no keybinds. I know a long time ago it used to just replace my main hotbar and i could use my regular hotkeys, is there a setting for this?\n\nEdit: seems its because i wasnt using hotbar 1 as my main one, the pet bar only replaces hotbar 1 so swapping to that fixed it. But the reason i changed from hotbar1 in the first place was to get rid of those arrows next to it (the hotbar cycle arrows), can those be disabled?",
            "Does anyone know if the \"Register Expansion code\" is down for maintenece? Tried to enter the code but it won't let me",
            "How do I unlock scrip vendor in Tuliyolal?",
            "Should I finish Eureka? For Krile's story.",
            "How do I unlock glasses?",
            "I skipped the last crafting and gathering sets in EW as I was on a break.\nNow that I have to level them up to 100, aside from getting myself those lv. 90 sets from the marketboard and spamming leves, do I have other ways?"
        ]
    },
    "Dawntrail Early Access": {
        "title": "Dawntrail Early Access",
        "score": 317,
        "url": "https://www.reddit.com/r/ffxiv/comments/1dqdjku/dawntrail_early_access/",
        "content": "Welcome to the New World, Warriors of Light!\n\nFinal Fantasy XIV's latest expansion, Dawntrail, is now available in Early Access! This thread will serve as a central hub for any important discussion threads or updates from Square Enix. **If you're encountering any issues with the game during Early Access, please check the megathreads linked below before making a new post**. The mod team will do our best to keep this thread up-to-date throughout the launch period, so we kindly ask you all to help us out by avoiding duplicate posts!\n\nHere are some useful resources to brush up on while you wait in queue:\n\n* [FINAL FANTASY XIV: DAWNTRAIL Full Trailer](https://www.youtube.com/watch?v=kgiuQwzB6aU)\n* [FINAL FANTASY XIV: DAWNTRAIL Official Site](https://na.finalfantasyxiv.com/dawntrail)\n* [Patch 7.0 Notes (Complete)](https://na.finalfantasyxiv.com/lodestone/topics/detail/d7db61f938f9cea65e4c5cd261918edb036b3004)\n* [FINAL FANTASY XIV Job Guide](https://na.finalfantasyxiv.com/jobguide/battle/)\n* [Dawntrail Media Tour Roundup](https://www.reddit.com/r/ffxiv/comments/1d9gf3q/dawntrail_media_tour_roundup/)\n\n# MSQ Discussion Megathreads\n\nWe will be posting new discussion megathreads on a staggered schedule throughout the Early Access period so that everyone has a space to discuss the MSQ depending on their progress. These threads are **not** exclusive, so you are still free to post your own discussion threads provided they follow our [spoiler guidelines](https://www.reddit.com/r/ffxiv/wiki/flairs_spoilers_filters#wiki_tagging_spoilers).\n\n* [\\[Spoiler: MSQ Lv. 90-91\\] Dawntrail Lv. 90-91 MSQ Discussion Thread](/r/ffxiv/comments/1dqhzod/spoiler_msq_lv_9091_dawntrail_lv_9091_msq/)\n* [\\[Spoiler: MSQ Lv. 92-93\\] Dawntrail Lv. 92-93 MSQ Discussion Thread](/r/ffxiv/comments/1dqy2k1/spoiler_msq_lv_9293_dawntrail_lv_9293_msq/)\n* [\\[Spoiler: MSQ Lv. 94-95\\] Dawntrail Lv. 94-95 MSQ Discussion Thread](/r/ffxiv/comments/1dr9o1c/spoiler_msq_lv_9495_dawntrail_lv_9495_msq/)\n* \\[Spoiler: MSQ Lv. 96-97\\] Dawntrail Lv. 96-97 MSQ Discussion Thread\n   * Scheduled to go live on 6/29/24 at 8:00 PM EDT\n* \\[Spoiler: MSQ Lv. 98-99\\] Dawntrail Lv. 98-99 MSQ Discussion Thread\n   * Scheduled to go live on 6/30/24 at 8:00 AM EDT\n* \\[Spoiler: MSQ Lv. 100\\] Dawntrail Lv. 100 MSQ Discussion Thread\n   * Scheduled to go live on 6/30/24 at 8:00 PM EDT\n\n# Tech Support Megathreads\n\nIf/when any technical issues arise during the launch period, we will create new megathreads and link them **here** for easy access. \n\n * [**\\[Megathread\\] - Unable to return to home world**](/r/ffxiv/comments/1dqfrhg/megathread_unable_to_return_to_home_world/)\n\n * **[\\[Megathread\\] - A compilation of all identified, ongoing issues](/r/ffxiv/comments/1dqm4v8/a_compilation_of_all_identified_ongoing_issues/)**\n\n**If a megathread already exists for the issue you are having, please use that thread instead of making a new post.** \n\nIf a megathread does not already exist for the issue you are having **and** other users are having the same problem, please comment below and the mod team will create a new megathread and link it here.\n\n**Please do not submit screenshots of your position in queue. They will be removed on sight.**\n\n\\---\n\n# Take care of yourself\n\nFirst and foremost: remember that this is a game! Your real life health comes first. Be sure to get a decent rest, drink plenty of water, eat healthy, and take frequent breaks to stretch and walk around! The game will always be here when you get back! \n\n[Sleep, hydrate, eat, and enjoy!](https://preview.redd.it/z7bpnzf78q8d1.png?width=599&format=png&auto=webp&s=b63c66713926eb40f1908de0de747317c4321908)",
        "num_comments": 2092,
        "comments": [
            "A quick PSA for anyone seeing slightly worse performance than they expected - the game reset my screen options to \"Full Screen\". FF14 runs much more smoothly in \"Borderless Windowed\", and things improved a bunch when I changed it back.",
            "Accidentally woke up very close to release time, would be an awful shame if I just decided to stay up and play....",
            "Was amazed at how little queue there was, logged in and started figuring out what I wanted to do for a minute or two...then my building's power went out. Lol.",
            "I'm in town having a nice breakfast before the game opens ( I'm in Ireland so things go up in just under an hour and a half.",
            "Oz is no longer on daylight saving time shouldnt it be 7pm AEST?",
            "5am crew, let's fucking goooooooo!!!",
            "Syrcus Tower somehow broke, Amon doesn't spawn any ice blocks when he freezes players, so Curtain Call is now a guaranteed wipe.",
            "in endwalker i was faced with over 20k queue and constant disconnects. Ill take my 2k queue lol",
            "Sure can't wait to log on and immediately not play the MSQ because I need my Zidane class.\n\nI'm unreasonably excited for Viper.",
            "The graphics update is a lot more substantial than I thought it would be honestly. Looks great."
        ]
    },
    "Old animations working perfectly with the graphical update": {
        "title": "Old animations working perfectly with the graphical update",
        "score": 314,
        "url": "https://i.redd.it/14qvfvqmqh9d1.gif",
        "content": "",
        "num_comments": 19,
        "comments": [
            "found my new reaction gif, thank you! ",
            "The smile and thumbs up at the end is just the cherry on top.",
            "*\"Hmmm... this is some good pi-WARBGHGDGHIGDCJOLKKUYGVT-zza.\"*",
            "I love how it just plays out fine - then spazzes out, stops there for a split second and then just casually rewinds back as if nothing happened. \n\nAlso, the \"Computer Kid approves\" vibes the first moments give me add so much! This gif made my day!",
            "Pizza so good you'll undergo spaghettification to get it!",
            "\"that's was an Perfect Hot Pepperoni Slice. Great!\"",
            "the peppercorns on the pepperonis actually create a tiny lil event horizon when cronched",
            "Dont quote me on this. But grubhub is to blame.",
            "is that actually what happens???",
            "I chortled.\n\nThis becomes DT's version of low poly grapes, I hope."
        ]
    },
    "I can finally pull this cosplay off in earnest with the new eye accessory slot!": {
        "title": "I can finally pull this cosplay off in earnest with the new eye accessory slot!",
        "score": 655,
        "url": "https://www.reddit.com/gallery/1dr47cu",
        "content": "",
        "num_comments": 39,
        "comments": [
            "Your name had better be Lalucard",
            "Do you like to go on walks",
            "People might be interested to know that the black color option for these turns the actual lenses black, not just the frames like the rest of the colors.",
            "I Love that there are more hellsing abriged references in the comments than normal alucard mentions xD",
            "OMG PERFECT! IMAGINE ALEXANDER ANDERSON AS A VIPER THO. GIVE US BAYONETS, SQUARE",
            "As a certain fuck mothering vampire would say: nailed it like the romans",
            "How? It doesn't let me exchange my Pinz Nez for the face accessory version...",
            "Where do you get the glasses?",
            "Do you perhaps enjoy very enthusiastic walks in the woods?",
            "I haven't heard of this new slot....interesting."
        ]
    },
    "Been wanting to do this since Viper was announced.": {
        "title": "Been wanting to do this since Viper was announced.",
        "score": 1288,
        "url": "https://www.reddit.com/gallery/1dqzbve",
        "content": "Lady Maria of the Astral Clocktower! Now to find a weapon that looks lik Rakuyo.",
        "num_comments": 63,
        "comments": [
            "I am a simple man - I see a Bloodborne reference, I upvote. \n\n10/10",
            "You know what they say: A corpse should be left well alone...",
            "Very good, Hunter. May you find your worth in the waking world",
            "If you want a rakuyo you're gonna have to wait until you're 95% through the game and then fight off two giant shark abominations.",
            "And so, the hunt begins anew",
            "Insight required ahead\n\nFurthermore praise the message!",
            "Love it! Whats the armor set name?",
            "I can hear this picture.",
            "Lady Maria!\n\nI too also wanted to do this.",
            "We need more Souls games glam. I wanna run around as a mushroom or eileen the crow."
        ]
    }
}