{
    "[500 CHALLENGE FINAL RESULTS] We challenged r/fidelityinvestments and our Discord server to create fictional indexes that could outperform the S&P 500. Here’s where you finished as of June 27. Congrats on outperforming the S&P again! Anything you want to see different in the next one? ": {
        "title": "[500 CHALLENGE FINAL RESULTS] We challenged r/fidelityinvestments and our Discord server to create fictional indexes that could outperform the S&P 500. Here’s where you finished as of June 27. Congrats on outperforming the S&P again! Anything you want to see different in the next one? ",
        "score": 20,
        "url": "https://www.reddit.com/gallery/1dqpdfi",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Reddit is just yield chasing. Because they don't need to worry about tax and wash sale, and many other limitation that any investor need to worry about.\n\nIn the last 5 years, it's kind of always true that people can just buy a stock who recently just went up significantly, because it will continue for many many times. And sell when it has a major drop. Keep switching stocks as if no tax is involved.",
            "I love how Chipotle ended up being the stock with the highest total gain in this fictional index.",
            "Are the meme indexes available to order, and do management fees go back to the redditors here? ",
            "You shouldnt have to worry about tax in IRAs tho right?",
            "Congrats on outpacing the S&P 500 this quarter!  Just as a note, the dip before this update was due to the NVDA split not being reflected correctly.  That has been corrected and reflected correctly in this chart.\n\nBe on the lookout for a post on Monday to start Q3s picking as well as to claim a trophy in your user flair.\n\nHave a good weekend all :)\n\n\\*edit fixed spelling",
            "please make a Fidelity 500 announcement channel in Discord (https://support.discord.com/hc/en-us/articles/360032008192-Announcement-Channels)! this allows anyone to subscribe to those posts and receive updates in other servers. It's easy to miss updates on Reddit or in the current Discord channel since it's a general discussion channel"
        ]
    },
    "Daily Discussion Thread (Rate My Portfolio, What Should I Buy/Change?, Investment Strategies, etc.)": {
        "title": "Daily Discussion Thread (Rate My Portfolio, What Should I Buy/Change?, Investment Strategies, etc.)",
        "score": 1,
        "url": "https://www.reddit.com/r/fidelityinvestments/comments/1dr9nui/daily_discussion_thread_rate_my_portfolio_what/",
        "content": "Hey [r/fidelityinvestments](https://www.reddit.com/r/fidelityinvestments/),\n\n**Welcome to the Daily Discussion.** Here’s a place where you can ask the community questions about your investments. \n\nWe also have a wide range of Fidelity resources that can also help you get started:\n\n* [Fidelity Learn](https://www.fidelity.com/learning-center/overview?ccmedia=reddit&ccchannel=social_organic&cccampaign=learn&ccdate=20240503&cccreative=learn_daily&ccformat=text)\n* [Guide to diversification](https://www.fidelity.com/viewpoints/investing-ideas/guide-to-diversification?ccmedia=reddit&ccchannel=social_organic&cccampaign=guidetodiversfication&ccdate=20240503&cccreative=diversification_daily&ccformat=text)\n* [Investing ideas for your IRA](https://www.fidelity.com/viewpoints/retirement/ira-portfolio?ccmedia=reddit&ccchannel=social_organic&cccampaign=iraideas&ccdate=20240503&cccreative=iraideas_daily&ccformat=text)\n* [Create a financial plan](https://www.fidelity.com/what-we-offer/planning?ccmedia=reddit&ccchannel=social_organic&cccampaign=whatweofferplan&ccdate=20240503&cccreative=planning_daily&ccformat=text)\n* [Retirement Planning and Guidance center](https://www.fidelity.com/retirement-planning/overview?ccmedia=reddit&ccchannel=social_organic&cccampaign=PGC&ccdate=20240503&cccreative=PGC_daily&ccformat=text)\n* [Fidelity Webinars](https://fidelityevents.com/allevents/special?ccmedia=reddit&ccchannel=social_organic&cccampaign=webinars&ccdate=20240503&cccreative=webinars_daily&ccformat=text)\n* [Fidelity YouTube](https://go.fidelity.com/reddityoutubedaily)\n\nAnother helpful resource is our Screener tool on [Fidelity.com](http://fidelity.com/). We have screens for mutual funds, exchange-traded funds (ETFs), and stocks. You can access any of the screeners in the \"News & Research\" drop-down menu on [Fidelity.com](http://fidelity.com/) and then click the security type you want to research. These screeners let you compare different securities to help find which one suits your needs best.\n\nJust as a general reminder, investing involves risk, including risk of loss. The experience of customers expressed here may not be representative of the experience of all customers and is not indicative of future success.",
        "num_comments": 2,
        "comments": [
            "An unexpected benefit of SPAXX as core - one line of  'Dividend Received' in Activity rather than 4-5 lines of 'Interest Earned' at various banks. One less calc to do. (Got both this month since we switched midway)",
            "I have only been investing in IRA, there is an empty account Investing(individual) I am guessing that one is for non retirement investing?\nI am wondering if I have money I plan to put in IRA by the end of the year if everything goes well but feels like a waste leaving in the bank; can I place them in the Investing(individual) account?\nWill it be put in Spaxx and can I later transfer it to my Roth account?"
        ]
    },
    "Just started employer 401k. Got 77 dollars contributed, suddenly it got transferred and my balance is 0?": {
        "title": "Just started employer 401k. Got 77 dollars contributed, suddenly it got transferred and my balance is 0?",
        "score": 2,
        "url": "https://www.reddit.com/r/fidelityinvestments/comments/1draksg/just_started_employer_401k_got_77_dollars/",
        "content": "What could be the reason or is this normal with 401ks",
        "num_comments": 10,
        "comments": [
            "We would need a lot more information before being able to give a definitive answer. But you just started, and this is the first contribution? Its possible that it just hasnt reconciled yet. I wouldnt be too worried.",
            "Transferred from/to where? What balance?",
            "It might help if you posted screenshots.",
            "Did they purchase a fund ?",
            "My guess is it was probably used to purchase an investment fund  in your 401k and you're just between updates in the processing period. Still, it's worth a few minutes to simply call the 401k provider and ask them to explain what occurred. They can answer it a whole lot better than strangers in Reddit with no access to your account.",
            "Can you post a picture of your transaction history?",
            "Does your account have a current value. ?",
            "It doesnt say where its transferred to but it looks like i contributed my first contribution on the 20th and then yesterday it got transferred out",
            "It just says transferred in the description. It doesnt say to what.\n\nThe balance was my contributions but ive only done one because its my first contribution.",
            "Im sadly not sure what that means. \n\nAll i see is my contribution. The investment my contribution went to.\n\nThen a transfer FROM said investment my contribution went to. Transfer to what it doesnt say.\n\nAs in it sold the units i had apparently"
        ]
    },
    "I just opened a brokerage account through Fidelity, what do I do now?": {
        "title": "I just opened a brokerage account through Fidelity, what do I do now?",
        "score": 15,
        "url": "https://www.reddit.com/r/fidelityinvestments/comments/1dqxvip/i_just_opened_a_brokerage_account_through/",
        "content": "I recently opened an individual brokerage account. I want to start investing but I don’t know where to start.",
        "num_comments": 32,
        "comments": [
            "Fund it. Buy FXAIX. Research other stocks to branch out on",
            "Why brokerage? Is it your emergency fund? Do you have a Roth as well? If the answer to both of those is no, you should put money in a Roth.",
            "Buy VOO or VTI and hold it forever.\n\n(Or VT if you want international exposure)",
            "Add money. It will automatically stay in a cash money market account like SPAXX gaining close to 5% interest each month until you decide to invest it.",
            "The key to successful investing is consistency! Never stop.",
            "Get the Fidelity Visa and 2% cashback will auto deposit into that account",
            "There's so much informative.  I think the best way would be to cruise the threads and search whatever sparks your interest!",
            "FXAIX and VOO are my two options and recommendation. I just automatically put money in it each month and rarely look at it",
            "Set up $100/month in direct deposit and also set up auto purchase of an etf (voo, faix) for $50 every two weeks or 100/month. Research etfs, saving strategies, and continually increase the amount you deposit and invest per month until you start to feel it, then ease back. Identify ways to reduce spending or costs, and enjoy some of that extra cash for yourself, as well as additional monthly investments.",
            "Check out Bill pay feature"
        ]
    },
    "When are funds available to be withdrawn when you set up direct deposit with employer into the Cash Management Account?": {
        "title": "When are funds available to be withdrawn when you set up direct deposit with employer into the Cash Management Account?",
        "score": 1,
        "url": "https://www.reddit.com/r/fidelityinvestments/comments/1drbnwi/when_are_funds_available_to_be_withdrawn_when_you/",
        "content": "I want to set up direct deposit with my employer into my fidelity cash management account. My employer pays on a Friday, usually it’s available to be withdrawn on Saturday with my checking account.\n\nI know it takes multiple days for funds to sit before they can be withdrawn when I transfer from my checking account.\n\nIs the timing for direct deposits in my checking the same timeline for the fidelity cash management account? \n",
        "num_comments": 0,
        "comments": []
    }
}