{
    "EA SPORTS FC 24 | Official Career Deep Dive": {
        "title": "EA SPORTS FC 24 | Official Career Deep Dive",
        "score": 228,
        "url": "https://www.youtube.com/watch?v=hasHXEsG_UM&ab_channel=EASPORTSFC",
        "content": "",
        "num_comments": 249,
        "comments": [
            "I’m hoping the tactics end up being more in depth but it looks like a fresh coat of paint on what we already had.",
            "Embarrassing. 2nd year in a row the main new feature are cutscenes that nobody will watch after the first week of release",
            "Disappointing but not surprising. Being able to watch the full match without playing is a good feature, other notable changes are just cutscenes really. Adding coaches doesn't really add any immersion imo, just adds another menu and will likely be broken and give your players huge boosts. Hoping the training drills at the start of every career are gone, worried that there's going to be even more training from watching that though.",
            "What's the point of the touchline camera angle if your manager is just blocking your view of the pitch?",
            "Once again, they're just re-introducing features that used to exist in career mode literal decades ago, FIFA 07 manager mode had [coaches](https://guides.gamepressure.com/fifa07/gfx/word/314966984.jpg) that would help increase player attributes and FIFA 10 had [pre-match reports](https://www.swiftworld.net/wp-content/uploads/2009/10/FIFA-10-Pre-Match.jpg) on the team you were about to play.",
            "Interesting to see how impactful the pre-match reports will be. But overall, underwhelming yet again",
            "Prediction...if Real sell their  pacey wingers Carlo won't change his management style.",
            "My expectations couldn’t have been lower and I’m still disappointed lol. I just want to know how this is the only sports title on the planet that we can’t track everyone’s stats on a year to year basis and look back on. Like if I want to see how a striker performed during the 2024/2025 season while playing in the 2026/2027 season I should be able to. We as lovers of this game aren’t asking for much but they can’t even give us the bare minimum that other sports titles give us. I play FIFA (EAFC) to play the games becuz I want to play them but man I’ve been playing FM the last few years and I’ll give this game one more shot and that’s that, I may fully switch to FM especially if they deliver what sounds like cool shit in FM25 with revamped graphics engine (finally).",
            "Hoping that I can just set-and-forget the training and not have to deal with it much",
            "Couple of useless cutscenes added every year instead of that focus on online or atleast coop career mode EA"
        ]
    },
    "Least realistic transfer?": {
        "title": "Least realistic transfer?",
        "score": 176,
        "url": "https://i.redd.it/hnxm8g4lvd9d1.jpeg",
        "content": "",
        "num_comments": 63,
        "comments": [
            "Griezmann went to Real Madrid on my cm",
            "I don't get what's the issue is, especially considering all the weird transfers that happen all the time in FIFA.",
            "“27 year old on 11th place team in England, transferred to France”\n\nI’m shocked SHOCKED",
            "why",
            "I had Son, Griezmann, Gravenberch, and Kimmich go to Arsenal. Looks like a whole different team when I play them and seeing Son and Kimmich there makes me sick",
            "The only thing crazy is that they paid 34 ms for him \n\nFrench clubs are broke",
            "bruh this is nothing. In my cm, Madrid bought in Messi as a replacement to Rodrygo. Rodrygo who now plays for Dortmund 💀. \n\nIn the same cm, Inter signed Musiala 😭😭",
            "In one of my friend's save Real bought Vitor Roque and gave him number 9💀",
            "For me its Valverde and joao felix to bayern leverkusen every single cm ffs",
            "Saliba going to Spurs, completely unwarranted"
        ]
    },
    "Honestly never seen a company so out of touch with their fanbase": {
        "title": "Honestly never seen a company so out of touch with their fanbase",
        "score": 153,
        "url": "https://i.redd.it/sd25q7hypd9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "This would be very simple to do and far more newsworthy",
            "Yeah, why would they rob us of the ninja turtle mask?",
            "if Ozil is still around, his face is still from 2015. EA cunts",
            "Masked version of mbappe on ultimate team before the goal keeper glitch that’s been there since 2015 gets patched",
            "No shit. Don't fix issues, but put a mask on mbappe. Daft fuckers.",
            "are they though? honestly i think more of the fanbase these days are interested in cosmetic updates and new cards, rather than the bones of the game. sure they'll whinge when the game 'screws them' but they'll keep pouring money into it.",
            "Yes but why would they fix the gameplay? Smh",
            "How about they just let us put the mask over players like we can in player career?",
            "I mean adding Osimhens mask costs like 1 minute so yeah, why wouldn’t they do it for the player most people play as in the game",
            "If they put the France mask, all is forgiven"
        ]
    },
    "Name a better fifa for regression": {
        "title": "Name a better fifa for regression",
        "score": 667,
        "url": "https://www.reddit.com/gallery/1dqh387",
        "content": "Physicals go down at 36, and technicals go down at 38. In fc 24 it's not possible to keep everything at the same number after the age of 32 for forwards.",
        "num_comments": 74,
        "comments": [
            "FIFA 16 was really good.  My players hardly lost anything.  I felt if they played good their rating stayed high.  The latest version I have is FIFA 22 and I won’t keep a player past 33 years of age, ridiculous.",
            "I forgot how much i missed the portfolio style display, that was brilliant.",
            "Mental stats regressing at 31 is madness. If anything they should be the last thing to regress.",
            "Hey man, where did you get fifa 16 if i may ask? I have been trying to find it many torrent sites but never found it anywhere. I played every fifa since 07 except 16, so it'd be very appreciated if u could help.",
            "I really miss this form of viewing players and stats",
            "can barely even have a 30 year old in your squad anymore if you value performance in FC24.",
            "Legit the only reason why i quit most saves after 1 season\n\nI need this back rly bad",
            "God I miss this ui so much",
            "Welp seeing this layout makes me want to play 16 again. Here we go! Lol",
            "Yeah I don’t get the idea that my squad needs to have an average age of 23 in order to be competitive. I get that maybe it puts an emphasis on the YA (they’ve been mostly broken anyways, especially since dynamic potential), but it would be nice if I could bring a player over the age of 30 to an important match once in a while"
        ]
    },
    "Will Ronaldo retire after this injury": {
        "title": "Will Ronaldo retire after this injury",
        "score": 278,
        "url": "https://www.reddit.com/gallery/1dqmsbu",
        "content": "Still 3 years left on his contact ",
        "num_comments": 51,
        "comments": [
            "Had Thiago Silva retire with 2 years left after he played 50% of the games.",
            "Cr7😪",
            "Haven’t seen anyone retire with time left on their contract in game. \n\nGet rid of Greenwood though.",
            "Greenwood 🤢🤮",
            "One of my fav career saves was at Orlando when I signed CR7 to replace Nani and 6 months after I signed him he broke his leg, then retired. 😢",
            "Idk ask him",
            "No\nA player will never retire unless they have 1 year left on their contract. As long as you renew the contract to have more than 1 year left he can’t retire",
            "One of my defenders decided to retire after being injure so yeah it's possible",
            "Extend his contract lol",
            "Blud signed Greenwood 💀"
        ]
    }
}