{
    "Rule changes": {
        "title": "Rule changes",
        "score": 837,
        "url": "https://www.reddit.com/r/fightporn/comments/1cuno5u/rule_changes/",
        "content": "*Update:* We’ve been on a banning spree the past week, so I wanted to provide a more specific update on some of the common things people are getting banned for:\n\n- Well well well, typical, and similar low-effort comments. \n- Equal rights equal lefts / women shouldn’t act like men\n- Fuck you bloody\n- Intentional misgendering (this violates Reddit rules)\n\n\nIn the past 12 months:\n\n* We received 25,700+ reports of rule violating comments.\n* Over 50% of those reports were for some type of \\*ism.\n* 114,000+ comments were removed.\n* Reddit (Admins) removed 4,500+ comments.\n* Nearly 65,000 users have unsubbed.\n\nOur goal in moderating is to keep this sub alive (not banned) by enforcing Reddit's rules and removing content that violates said rules. We've previously been pretty lenient with what we allowed to be posted so long as it wasn't overt violations of those rules, but we've been getting a lot of feedback from users who are tired of the innuendo and the amount of reports and unsubs seems to support that. This is your sub and we'll moderate it how you want it moderated. To that end, the following rule changes are now in effect:\n\n* All comments consisting of any \\*ist/\\*phobic innuendo or generalizations = permaban. We previously just removed these comments if they weren't overt violations, but that approach didn't work.\n* All posts of minors = permaban. We repeat it over and over and there are a dozen school fights posted a day.\n* Any posts or comments that get removed by Reddit = permaban.\n* Obvious bait titles = permaban.",
        "num_comments": 680,
        "comments": [
            "\"Please remember that any racist comments or comments with any kind of slurs will be removed and you will be banned. /r/fightporn does not tolerate racism or bigotry. Fights with children are not permitted. Thank you.\"  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fightporn) if you have any questions or concerns.*",
            "When you [Removed by Reddit]",
            "This is where the fun begins..",
            "See yall after the purge",
            "What about the clout seekers who post a post that has nothing to do with a fight.",
            "This’ll be interesting",
            "*We'll moderate this sub the way you guys want it moderated*\n\nSo from now on, these will all be PERMABANS",
            "We need to view violence in a safe space!",
            "This is like a drug dealer telling his clients to “use responsibly.” Laughable at best.",
            "Godspeed."
        ]
    },
    "Another angle of the Summer Smash 2k24 scuffle": {
        "title": "Another angle of the Summer Smash 2k24 scuffle",
        "score": 3277,
        "url": "https://v.redd.it/9mxj6yrnm18d1",
        "content": "",
        "num_comments": 280,
        "comments": [
            "\"Please remember that any racist comments or comments with any kind of slurs will be removed and you will be banned. /r/fightporn does not tolerate racism or bigotry. Fights with children are not permitted. Thank you.\"  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fightporn) if you have any questions or concerns.*",
            "Gotta pack up and leave for the night. Idk what’s worse, the beating or the embarrassment to follow. Especially since bro jumped over the fence like he was Batman.",
            "https://preview.redd.it/96nquo0qs18d1.jpeg?width=1170&format=pjpg&auto=webp&s=726eafa99cc7a91a4f5becb9ae0e2a72ae76b14d",
            "How embarrassing for him lol",
            "dude should have known from the moment he immediately slipped on his way over that this wasn’t going to work out for him",
            "Bold strategy for that dude to use his face as a shield",
            "What happened here? Some arbitrary split in the crowd and tribalism took over?",
            "Wow! I think this might be more embarrassing than being on stage with no pants on! I got chills of cringe lmao 😂",
            "I just love how the dudes next to him hype him up and make him crash out for a chance at being seen as cool. It’s my favorite part of fight vids",
            "He’ll remember this for the rest of his life, in the worst way possible."
        ]
    },
    "WALK OUT WALK OUT": {
        "title": "WALK OUT WALK OUT",
        "score": 106,
        "url": "https://v.redd.it/0fmk7xhaz38d1",
        "content": "",
        "num_comments": 17,
        "comments": [
            "\"Please remember that any racist comments or comments with any kind of slurs will be removed and you will be banned. /r/fightporn does not tolerate racism or bigotry. Fights with children are not permitted. Thank you.\"  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fightporn) if you have any questions or concerns.*",
            "I'm tempted to download and save all the videos of this event. If I ever have kids I'll show them when they're of a certain age so they know that if they behave like idiots in public  there's a good chance it'll be immortalised for all to see in HD from multiple angles.",
            "lol I love the way the girl next to him is grabbing him/hyped",
            "Where the fuck was this?  Looks like an awful event",
            "Bro is cooked for a lifetime from like 5 angles of the same event. He’s never gonna socially recover from this.",
            "Damn, there's no way recovering from that.",
            "He won the chip",
            "Fuck that’s a lot of perms",
            "What were you on, thinking you could take that guy after getting knocked out with just one punch?",
            "Way better angle. Love the chicks reaction."
        ]
    },
    "Amazon Driver Fights Off Would-Be Carjacker After He Tried To Steal His Female Coworker’s Van!": {
        "title": "Amazon Driver Fights Off Would-Be Carjacker After He Tried To Steal His Female Coworker’s Van!",
        "score": 1260,
        "url": "https://v.redd.it/98fvtdegwz7d1",
        "content": "",
        "num_comments": 110,
        "comments": [
            "\"Please remember that any racist comments or comments with any kind of slurs will be removed and you will be banned. /r/fightporn does not tolerate racism or bigotry. Fights with children are not permitted. Thank you.\"  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fightporn) if you have any questions or concerns.*",
            "Why he let up halfway  through, finish it",
            "They are already behind schedule at best this is a firing.",
            "Thanks for defending my decorative bedding with your life.",
            "That female needed to get tf out the way & let home boy knock his ass out the 1st time I'd been pissed & cussed her ass out",
            "He's delivering things alright. He delivered several punches to the carjackers face.",
            "The way she keeps telling dude to “just go” she likely knows him personally. An affair perhaps? Pissed off crazy boyfriend? I don’t know but there is something deeper than this dude randomly trying to car jack her.",
            "The woman and “carjacker” act like they possibly know each other. 😏",
            "My dog delivered them hands and it didn’t even take two days.",
            "Just let him have it so we can GOOOO! Also my package better be waiting for me when I get home.\n\n-the honkers"
        ]
    },
    "She Had No Opponent So This Dude Stepped In!": {
        "title": "She Had No Opponent So This Dude Stepped In!",
        "score": 5213,
        "url": "https://v.redd.it/xiehvawwnx7d1",
        "content": "",
        "num_comments": 396,
        "comments": [
            "\"Please remember that any racist comments or comments with any kind of slurs will be removed and you will be banned. /r/fightporn does not tolerate racism or bigotry. Fights with children are not permitted. Thank you.\"  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fightporn) if you have any questions or concerns.*",
            "His first attempt to shoot looked like the beginning of a wheelbarrow race.",
            "Dudes striking is atrocious",
            "Pre-malone?",
            "Classic battle of girl who trains vs some guy we just found",
            "You know what? Dude stepped up and went in the ring. Respect to him",
            "I know that this wasn't any great exhibition of fighting, but I gotta say, this was highly entertaining and I was more invested in wanting to know who is going to win this then a lot of other random videos I've clicked on. Props to both of them.",
            "I thought she was gonna absolutely destroy him, it was closer than I thought",
            "[removed]",
            "She is obviously trained. Saw some clips from a former Korean ufc fighter letting his students fight in these backyard promotions to get more reps in (imo they‘re doing it for the cloud but why not). There is nothing to be ashamed about to lose to a woman. Skills pay the bills"
        ]
    }
}