{
    "CEO 2024 stream schedule and prediction thread. ": {
        "title": "CEO 2024 stream schedule and prediction thread. ",
        "score": 33,
        "url": "https://i.redd.it/ytzt20crdv8d1.jpeg",
        "content": "Street fighter 6 is looking stacked as always, Mena, and Angrybirds are obvious favorites, but I'm really looking forward to seeing a few of our US defenders try and show out, ready for Dual Kevin to make a crazy run and show what marvel players are made of. \n\nMarvel is gonna be great, RayRay is a super fun player to watch with his absolutely filthy Magneto. Escalante is someone I mostly know for his mvci play, but I've see great things from him in mvc3 and I'm looking forward to seeing more of it. \n\nCvs2 is always big at CEO, because Jebaily is a massive cvs2 fan, like is most likely gonna get top 8 this weekend. But BAS is flying out from Japan for this, and for anyone who's never seen BAS, he is the most dominant player of the fgc of all time, having won like over 80% of all majors he's entered across 20 years of actively playing the game. Always amazing to see him work.",
        "num_comments": 9,
        "comments": [
            "Why isn't Mario Kart being streamed?",
            "We’re probably not expecting much in terms of announcements here, right? It makes sense that any big announcements will be saved for EVO in 3 weeks.\n\nSome possible guesses:\n\n-\tA release date for Lidia in Tekken\n-\tA tease for the next GBVSR character to be playable at EVO since they already announced the new balance patch will playable there. Maybe the next Battle Pass costume\n-\tAt most, a new avatar collab for Street Fighter\n-\tProbably nothing for Strive since they tend to announce the first season pass character at EVO. A look at Team of 3 gameplay would be cool though\n-\tNew character trailers for unreleased games like Fatal Fury and Hunter x Hunter\n\nI feel like even these guesses are being slightly optimistic. Anything bigger would be a surprise",
            "Thx",
            "wait Mario kart 8 deluxe?!🤨",
            "Anyone know what the UMvC3 exhibition match is?",
            "Tekken looks wide open, since Arslan and the top Koreans aren't there. I could see a ton of different players winning it, but I'm gonna say Atif finds his form and wins it.\n\nFor SF6 I actually think Punk will win. He has looked unstoppable in recent online tournaments against some of the best NA players. Of course, Mena is still the favorite.",
            "I know people don't really care about platform fighters here, but Brawlhalla is likely releasing their next character as well. Otherwise yeah your predictions seem pretty solid",
            ">He has looked unstoppable in recent online tournaments against some of the best NA players.\n\nHonestly I feel like that's been the reocurring thing with Punk lately. Dude perform like a World Beater up until like the Top 4.\n\nI'd like for him to finally take a major for SF6 though.",
            "Like always + NA level isn't that great outside of 1 or 2 guys like Nuckledu so it doesn't say much, and online tournaments are different from offline ones, especially for Punk who often chokes there"
        ]
    },
    "CEO 2024 chat is now live. ": {
        "title": "CEO 2024 chat is now live. ",
        "score": 12,
        "url": "https://www.reddit.com/r/Fighters/comments/1dqvxfu/ceo_2024_chat_is_now_live/",
        "content": "Head over to the chat tab at the top of the subreddit page, this is a place for people to discuss the event as it's taking place in real time. \n\nAlso make sure to check the other pinned post for the stream sceduales! ",
        "num_comments": 0,
        "comments": []
    },
    "Try saying 6321463214 instead of hcb,hcb": {
        "title": "Try saying 6321463214 instead of hcb,hcb",
        "score": 143,
        "url": "https://i.redd.it/0vjfy49lwf9d1.jpeg",
        "content": "",
        "num_comments": 54,
        "comments": [
            "Ironic using KoF for the 'Chad' side when the largest region of SNK players are  using Numpad notation.\n\nAlso, complicated specialized motions tend to still get said out loud: Pretzel-Motions, EWGF, etc., so this notation is still verbally \"Double Half-Circle Back.\" The whole point is Numbers are unifying over Letters that change meaning between spoken languages, and the numbers can _always_ translate the exact input path in arrows you must take. \n\n(6➡️,3↘️,2⬇️,1↙️,4⬅️,6➡️,3↘️,2⬇️,1↙️,4⬅️)",
            "Ok, we can play this game. How do you abbreviate goldlewis behemoth typhoon inputs?  \nHow do you describe the inputs for option selects?  \nHow do you teach a new player how to read inputs that they haven't seen before?\n\n\"Abbreviation notation\" is only useful if the person you're talking to already knows what input you're talking about. That's not to say that it's never useful (as other comments point out, it's a lot more common to verbally say something like \"double half circle\" or \"pretzel motion\" than it is to list a string of numbers) but you're being intentionally obtuse if you pretend that it's the better notation for communicating new ideas to people.  \nYou only have to learn how numpad notation works once, and then you can understand every possible motion, no matter how complicated. If you rely on unique abbreviations for every new motion, you have to have perfect memory of the entire list, and if you ever encounter a new motion, you need to memorize a new list. For example, many games with airdashes allow 956 as a valid airdash input (upforward, neutral, forward). The best way to communicate this idea to someone who isn't already familiar with instant airdash inputs is to do the clunky thing I put in parentheses - taking 7 syllables, or 28 characters to communicate an idea that is effortless to communicate with 3 syllables or 3 characters.\n\nThat's not even to mention the fact that numpad notation immediately translates to anyone who can read arabic numerals, which is virtually everyone you will ever interact with online.",
            "i just call the moves by their names tbh",
            "I'd rather use numpad notions than these abreviations. And it's not even because I am an anime fighter fan, it's just better for any fighting game. I think it's a question about adapting yourself instead of complaining. It's not that hard \n\nI know it's a joke and all but I wanted to say it anyway",
            "Numpad is for clarifying inputs beyond simple quarter/half circles. \n\nDescribing how to buffer or what angle to go.\n\nSlayer Back Dash Cancel, which can be done in multiple ways for various results. \n\nGoldlewis with upside down/sideways half circles. And can be simplified to 3 numbers.\n\nThat's what it's meant for.\n\nSNK is one of the reasons behind complex motion inputs in the first place. Those are the games with the double half circles, whereas double half circle is pretty rare in anime scenes that use numpad.",
            "The way I know I have brainrot is that numpad notation is more understandable to me. Its like those people who read analog clocks faster than digital ones",
            "Hey what’s wrong with writing a social security number to describe a super?",
            "Unrelated Terry with his hat back should be illegal",
            "Abbreviations are better for 3d fighting games and maybe mk\nNumericals are WAY better for 2d fighting game especially the likes of guilty gear and BlazBlue\nSo idk depends I guess",
            "Pictures forever!!"
        ]
    },
    "Official Gameplay teaser for Takeda in Mortal Kombat 1": {
        "title": "Official Gameplay teaser for Takeda in Mortal Kombat 1",
        "score": 196,
        "url": "https://v.redd.it/wpz1ypdo7e9d1",
        "content": "",
        "num_comments": 33,
        "comments": [
            "I wonder what he is to them in this game. He was Kenshis son, but I don't see that happening here. I mean...he could be from another timeline where he is but I don't see it",
            "Very curious about his story. Is he still going to be Kenshin's son? I thought he would be the Takeda that left the shirai ryu to build the linkuei as per the original MK mythologies, but i guess not.",
            "Looks pretty good",
            "Holy shit this looks cool",
            "Can't wait to see Max's reaction to this",
            "Dang that’s really cool",
            "This looks absolutely 🔥🔥🔥",
            "Yep that sure looks like Takeda. Mighty Morphin Kombat Kid.",
            "Guessing a trailer after CEO?",
            "It's Kenshi's son! There's hope for the Kombat Kids yet."
        ]
    },
    "The archetype no one talks about.": {
        "title": "The archetype no one talks about.",
        "score": 1366,
        "url": "https://i.redd.it/n2v1iwfyia9d1.jpeg",
        "content": "MAD respect if you know the far right. Per usual, your additions in the comments",
        "num_comments": 127,
        "comments": [
            "Bro forgot THE femdom rep; her fucking sword turns into a whip and she literally steps on you\n\nhttps://preview.redd.it/e9tfyqs7db9d1.jpeg?width=800&format=pjpg&auto=webp&s=9ccd64b5580cd1f8ff46e3022325b2b8c9cf95d1",
            "https://preview.redd.it/w7rf3kvrgb9d1.png?width=643&format=pjpg&auto=webp&s=8f33b72271033a08414bbf7841c3152698a55f57\n\nI have no idea what you're talking about, this is clearly a zoner.",
            "Ah yes the archetype that sells these games",
            "Ivy from SC should be at the top of this archetype lol",
            "How dare you leave Ivy Valentine out of this archetype",
            "Damn, I haven't thought about Thrill Kill in about 20 years.",
            "Ever get stepped on from a full screen overhead?\n\nhttps://preview.redd.it/qj9b8obg4c9d1.png?width=1589&format=pjpg&auto=webp&s=3eec721840e2460ee34b45167d54eebcf7eaa87a",
            "Can't forget Jenny the Bat from Bloody Roar and Sofia from Battle Arena Toshinden. I wouldn't count Anarchy Reigns, but Mathilda does belong on the list too, spiritually.",
            "Juri is DEF another char that nails that archetype XD\n\nAnd that's why she's so frustrated in Dictator's SF 6 end. Is not that the man who killed her father is still alive, and once again he proved to be too strong for her. The REAL issue is \"Juri wanna be dom, not sub!\"",
            "Never want to play as them. Always want to play against them 😵‍💫"
        ]
    }
}