{
    "Wöchentliche Finanzdiskussion - KW 25 - 2024": {
        "title": "Wöchentliche Finanzdiskussion - KW 25 - 2024",
        "score": 10,
        "url": "https://www.reddit.com/r/Finanzen/comments/1dhn577/wöchentliche_finanzdiskussion_kw_25_2024/",
        "content": "Womit habt ihr euch diese Woche beschäftigt? Habt ihr Fortschritte zu eurem gewählten Ziel gemacht? Sind Probleme aufgekommen? Hier könnt ihr über alles Themenverwandte diskutieren.\n\n&#x200B;\n\nUm euch über die Traderepublic Bezahlkarte auszutauschen nutzt bitte den [Megathread](https://www.reddit.com/r/Finanzen/comments/1alrvzz/megathread_traderepublic_bezahlkarte/).\n\n \n\nDie vorherigen Posts findest du über die Suche mit [diesem Link](https://www.reddit.com/r/Finanzen/search/?q=W%C3%B6chentliche+Finanzdiskussion&sort=new&restrict_sr=on&t=all).",
        "num_comments": 145,
        "comments": [
            "Der Amundi Prime All Country World hat nun auch eine [thesaurierende Variante](https://www.amundietf.de/de/privatanleger/products/equity/amundi-prime-all-country-world-ucits-etf-acc/ie0003xja0j9) aufgelegt, deren Börsenhandel nächste Woche (26.6.) startet.\n\nTER von 0,07%, ebenfalls in Irland beheimatet und damit eine Alternative zum A2PKXG mit einem Drittel der Kosten.\n\nDer Ausschütter hat ein ziemlich rasantes Wachstum hingelegt und in den ersten drei Monaten des Börsenhandels bereits fast eine Milliarde an Fondsvolumen angehäuft. Das hat Amundi wohl dazu bewegt, dass sich auch ein Thesaurierer lohnen könnte, noch im März hatten die mir auf Anfrage geantwortet, dass das nicht geplant sei.",
            "https://preview.redd.it/hchjmqr6tx7d1.png?width=1080&format=png&auto=webp&s=cf9e377665836e5024c2bd4306fac238de98c920\n\nFalls sich jemand fragt, wie verrückt sich (deutsche) NVIDIA-Mitarbeiter in letzter Zeit fühlen müssen... (das ist unvested equity, d.h. es geht erst nach und nach an den Angestellten über - also bitte weiter fröhlich hypen)",
            "Seit ich vor zwei Jahren meine neue Stelle inne habe erhalte ich bei meiner Steuererklärung in Elster die Aussage, dass es wahrscheinlich zu einer Nachzahlung kommen wird. Daher habe ich die Steuererklärung nicht abgeschickt.\n\nBei einem Gesamtbrutto von 90k für 2023 komme ich rechnerisch auf eine Nachzahlung von 229€ für Einkommenssteuer und 198€ für den Soli.\n\nMir ist unerklärlich, wie es sein kann, dass es zur Nachzahlung kommt. Ich bin ein absoluter Standardfall als nicht-selbstständiger Arbeitnehmer. Einzige kleine Besonderheit ist, dass ich jährlich im April einen Bonus für das zurückliegende Jahr erhalte. Dieser wird nach meinem Wissen ja aber auch mit Steuerklasse 1 versteuert?!",
            "Hier nochmal für diejenigen, die auf ihre rechtmäßige Bauzinssenkung warten, wo doch jetzt die EZB gesenkt hat https://www.tagesschau.de/wirtschaft/bauzinsen-102.html",
            "@Mods Finanzen ist auf Platz 6 der Finance-Communities. Was muss für Platz 1 getan werden?\n\nDie momentane 1 hat weniger Mitglieder.",
            "Hallo liebe Community,\n\nam Wochenende wurde mir ein [neues Video von extraETF](https://youtu.be/hXFEMgtMp5c?si=Z3uSkSBBzYjJjAmX) zum Thema Laufzeit-ETFs auf meine YouTube-Startseite gespült. In dem Video ging es unter anderem um den Amundi Laufzeit-ETF auf deutsche Staatsanleihen ([LU2780871823](https://www.amundietf.de/de/professionell/products/fixed-income/amundi-fixed-maturity-2027-german-bund-government-bond-ucits-etf-dist/lu2780871823)). Anfangs war ich skeptisch und auch im Video wurde nicht deutlich, warum eine Diversifikation auf deutsche Staatsanleihen überhaupt sinnvoll sein sollte. Schließlich könnte ich auch einfach eine der im ETF enthaltenen Anleihen direkt auswählen, die gleiche Rendite erzielen und mir die TER von 0,09% sparen.\n\nNachdem ich mir jedoch den Inhalt des ETFs genauer angesehen und die Renditen verglichen habe, war ich überrascht. Auf der Amundi-Seite wird eine Rendite von 2,83% angegeben, obwohl die einzelnen Anleihen im ETF eine Rendite zwischen 2,47% und 2,56% haben. Wie kommt dieser Unterschied zustande?\n\nDE0001102424   |   [2,50%](https://www.deutsche-finanzagentur.de/bundeswertpapiere/factsheet/isin/DE0001102424?cHash=f10a4f0b33847dd20a4c4525226bfa0a)  \nDE0001141869   |   2,49%  \nDE0001102416   |   2,56%  \nDE0001141851   |   2,55%  \nDE0001102523   |   2,48%  \nDE0001135044   |   2,56%  \nDE0001030740   |   2,47%",
            "Interessant, wie viele Anleihen-ETF es mittlerweile gibt, die eine Ziellaufzeit haben https://www.justetf.com/de/search.html?search=ETFS&assetClass=class-bonds&bondStrategy=Maturity%2Bbonds\n\nNur warum es ausgerechnet zu Italien auch welche gibt checke ich nicht ganz.",
            "Zusammen mit einer zweistelligen Zahl anderer Leute werden bei mir regelmäßig kleinere Ausgaben fällig. Bisher hat eine andere Person ein GbR Konto geführt, die Person ist mittlerweile verstorben und es kann laut Bank wohl nicht auf eine andere Person umgeschrieben werden.\n\n\nGibt es eine Möglichkeit für diese Konstellation möglichst Stressfrei ein Konto zu führen? Es gibt die Überlegung einen Verein zu gründen, aber so richtig Lust hat keiner drauf.\n\n\nFür die gemeinsamen Ausgaben hatte jeder immer monatlich eingezahlt, es liegt also doch ein ganz schöner Batzen Geld rum. Daher wär es ganz nett wie bisher ein vier Augen Prinzip zu haben.\n\n\nIrgendwelche möglichst simplen Ideen? Soweit ich das sehe ist ein Geschäftskonto ohne wirkliches Geschäft wohl nicht mehr so easy wie in den 60ern.\nAh ja, soll selbstredend nichts kosten der Spaß.",
            "Ich habe die TR IBAN seit gestern. In den FAQ schreibt TR: \"Es **wird** keine Obergrenze mehr geben, die bisherige Grenze von 50.000 € wird aufgehoben.\"\n\nUnter Zinsen steht bei mir in der App aber immer noch \"Füge bis zu 50k EUR hinzu, um Zinsen zu erhalten.\"\n\nKriege ich jetzt schon Zinsen über 50k oder nicht?\n\nEdit: Ich erhalte die Zinsen.",
            "Habe etwa 100k in alten (vor 2009) in sehr konservativen Investmentfonds (DWS, Union, Templeton). \n\nWenn ich diese verkaufe und neu anlege, brauche ich  eine ziemlich gute performance der Neuanlagen, um die neue Besteuerung auszugleichen, oder habe ich hier einen Denkfehler?"
        ]
    },
    "Skandalöse Zustände während der EM": {
        "title": "Skandalöse Zustände während der EM",
        "score": 2085,
        "url": "https://i.redd.it/4ntuagg45x7d1.jpeg",
        "content": "",
        "num_comments": 664,
        "comments": [
            "In der UEFA Fanzone vor dem Bundestag konnte man nur mit Bargeld zahlen. Das aber inklusive Geldautomat mit 5€ Gebühr.\n\n\nWundert mich echt, dass ein Geldautomat weniger kostet als ein Kartenlesegerät.",
            "Ganz ehrlich, ich bin Deutscher und es nervt mich auch, wie oft man nicht mit Karte zahlen kann. Im Vergleich zu anderen Ländern sind wir hier echt (mal wieder) die Sonderlinge.",
            "Ich verkaufe Wein und wir haben im Unternehmen die Sum Up Lesegeräte inkl. Simkarte angeschafft. Auf jeder Veranstaltung können wir den Besuchern und potentiellen Kunden Wein kartonweise andrehen.\n\nAmex, American Express, Visa, Mastercard, ApplePay gerne, her damit. Übrigens: ab Betrag X versandkostenfrei. Ach, noch ein Karton? Gerne. \n\nBargeld ist verkaufshindernd.",
            "Tja sobald es mal nur noch Kartenzahlung givt wundert sich das Finanzamt über die doch gut laufenden Dönerläden.\n\ninfo: Von 6 Dönerläden in meiner nähe Tippen nur 2 Konsequent die richtigen Preise ein. Das ist eine Beobachtung von nun 5 Jahren",
            "Deutschland Geldwäscheland Nr.1. Wenn wir schon sonst nixmehr können.",
            "Wenn man nicht mit Karte zahlen kann, liegt die Vermutung nahe, dass da vieles schwarz abläuft.",
            "In London wirst du nirgends Bargeld los, sogar Straßenkünstler haben Tap-Geräte, mit denen man contactlos zahlen kann.\n\nHier vor 1 Monat auf nem Straßenfest gewesen, da wird man blöd angemeckert wenn man bei 17€ Preis (Imbissbude) mit nem 50iger zahlen will (wohl gemerkt spät nachmittags und da war sehr viel los) „man ist doch keine Wechselstube!“ darauf konnte ich auch nur entgegnen: „dann bietet doch kontaktlos an“ - „ne soweit sind wir nicht“ \n\nZum kotzen",
            "Die gleiche Beschwerde wie 2006 bei der WM? Können die sich keine neue ausdenken?!",
            "Bin grad in Kopenhagen ein Festival genießen und man kann immer und überall mit Karte zahlen. Ich liebe es einfach. Wenn man mal mit Bargeld zahlen will, gibt es im Discounter gerne Münz und Scheinautomaten. Einfach alles reinwerfen, wird automatisch gezählt und Wechselgeld ausgeworfen.",
            "Insbesondere für Gäste aus Nicht-Euro Ländern ist es wirklich nervig, weil keiner Lust auf eine Bargeld einer Währung hat, die er nicht weiter verwenden kann.\nIch war dieses Jahr bereits in UK & Polen und habe nicht einmal überlegt, ob ich Bargeld brauche, weil es in den Ländern so selbstverständlich ist alles mit Karte zu zahlen.\nTraurig, dass wir so hinterher hängen."
        ]
    },
    "Darf man Rentenansprüche aus einem Umlagesystem zum Vermögen zählen?": {
        "title": "Darf man Rentenansprüche aus einem Umlagesystem zum Vermögen zählen?",
        "score": 52,
        "url": "https://www.reddit.com/r/Finanzen/comments/1dlqanc/darf_man_rentenansprüche_aus_einem_umlagesystem/",
        "content": "Ich bin über einen Beitrag gestolpert, in dem das Vermögen in europäischen Ländern verglichen wurde. Deutschland schneidet hier nicht so gut ab. Eine Erklärung in dem Beitrag ist, dass Rentenansprüche in der Statistik nicht erfasst würden. Zitat: „Daher wird das Medianeinkommen für Deutschland im Vergleich zu Ländern mit einem kapitalgedeckten Rentenversicherungssystem zu niedrig ausgewiesen“ Dan kommen die Autoren zu dem Schluss, dass :“in Deutschland ergeben sich daraus Rentenversicherungsansprüche von rund 195.000 Euro je Haushalt. Fast ein Drittel des durchschnittlichen deutschen Haushaltsvermögens fehlt also in der Rechnung der EZB“\n\nAus Sicht desjenigen, der gerade Rentenansprüche bezieht, mag das vielleicht stimmen, aber auf die Gesellschafft bezogen ist das doch grob falsch. Im Umlageverfahren gibt es das Kapital nicht, es muss erst noch von jemandem erarbeitet werden. Im Vergleich dazu ist bei der Kapitaldeckung das Kapital ja bereits vorhanden. Hier wurde die Arbeit bereits getan. \nDaher kann ich doch nicht bereits vorhandenes Kapital mit irgendwelchen Ansprüchen gleichsetzen für die erst noch jemand in der Zukunft arbeiten gehen muss.\n\nHabe ich hier einen Denkfehler?\n\nHier der Link zum Artikel:\n\nhttps://www.rwi-essen.de/presse/wissenschaftskommunikation/pressemitteilungen/detail/deutsche-sind-die-armen-schlucker-europas",
        "num_comments": 73,
        "comments": [
            "Aus Bilanzsicht sind das Forderungen, die werden bereits zu einem Schätzwert aktiviert. Geld repräsentiert sind ja auch nur den Anspruch, zukünftig Güter zu erhalten. Ob dieser Anspruch in Rentenpunkten oder Kontostand ist, ist meiner Ansicht nach erstmal zweitrangig. Ärgerlich ist, dass Rentenpunkte prinzipiell nur Forderungen ggü. Zukünftigen Arbeitnehmern sind. Bei der derzeitigen demographischen Entwicklung ist das eher weniger attraktiv.",
            "Dann sollte man vielleicht auch die Rentenverpflichtungen des Staates als indirekte Verbindlichkeiten werten. Damit sieht unsere Staatsverschuldung nämlich ziemlich bescheiden aus.",
            "Wie würdest du dann die Rentenversicherungsansprüche berücksichtigen? Bei der aktuellen Methode besteht dann eine scheinbar riesige Vermögenslücke.",
            "\"Oxfam\" behauptet ja jedes Jahr, dass die acht oder so reichsten Menschen der Welt mehr Geld besitzen als die ärmsten 50% der Welt zusammen. So kann mein eine Statistik verbiegen, indem man zukünftige Zahlungen für Kredite reinrechnet, aber nicht zukünftige Einnahmen. Dadurch haben sehr viele Menschen in der Rechnung von Oxfam ein sehr kleines oder sogar negatives Vermögen.",
            "Man kann die Rentenansprüche schon zum vermögen zählen, aber: \n\n\n1. Du kannst sie nicht vererben oder anderweitig übertragen (ein Haus z.b. schon)  \n2. Du kannst nicht auf das Vermögen zugreifen bis du ein bestimmtes alter erreicht hast  \n3. Es ist nicht sicher, wie lange das aktuelle Renteneintrittsalter gehalten werden kann. Das ist das, weshalb sich hier im Sub auch alle Sorgen machen. Momentan wird das System gerade so noch am Laufen gehalten, aber das wird in 20, 30 oder 50 Jahren vielleicht anders aussehen und wir werden alle bis 75 arbeiten müssen. Das Rentenniveau wird evtl. auch sinken.\n   4. Rentner können nicht in alle länder ohne Komplikationen auswandern. Innerhalb der EU geht das noch, außerhalb wird es schwieriger. \n\n\n Man müsste im Detail nachschauen wie genau der Wert von 200k berechnet worden ist. Natürlich ist der Wert nicht 0, wenn ich die Wahl hätte würde ich mir den Betrag aber lieber auszahlen lassen, oder sogar 30% weniger. Auf 40 Jahre sind 130k mit nur 4% immerhin 600k.",
            "Wenn man die Rentenansprüche ins Vermögen reinrechnet müsste man sie umgekehrt auch in die Staatsschulden miteinrechnen (genau wie die Pensionen). Damit würde man sehen, dass man da Ansprüche gegen einen völlig überschuldeten Staat hat,  der keinerlei signifikante Rücklagen bildet. Mit entsprechenden Abschlag sind also die Rentenansprüche also in der Vermögensaufstellung zu bewerten. \n\n\nUnd auch wenn das natürlich nicht so offen kommuniziert wird, jedes Jahr höheres Renteneintrittsalter ist schon ein gewaltiger Abschlag auf dieses Vermögen.",
            "Wie werden denn Einnahmen aus Forderungen gehandhabt? Beispiel: man exportiert etwas aber es wurde noch nicht dafür bezahlt. Garantiert dir auch keiner dass das Geld ankommt, der Käufer könnte Insolvent gehen",
            "Bei uns in der Schweiz wird das Pensionskassengeld (2. Säule) zum Vermögen dazu gezählt. Das kann ich aber auch beziehen um z.B ein Haus zu kaufen oder Auszuwandern. Zudem wenn ich sterbe, wird es vererbt. Im Alter kann ich mir (je nach Pensionskasse) es auszahlen lassen. In dem Fall macht es meiner Meinung nach schon Sinn es zum Vermögen zu zählen.",
            "Man bekommt ja nichtmal Anspruch auf Kapital X, sondern Rentenpunkte a.k.a. Shitcoins von der Deutschen Rentenversicherung 🤡",
            "Mit der Hinzurechnung von angeblichen Renten, die erstmal für Gen Z und Y wirklich gezahlt werden müssen - was noch zu beweisen ist - kann man wunderbar verschleudern, dass Deutschland im Vergleich zu anderen wohlhabenden Ländern ein Billiglohnland und Mieterland ist. \n\nEigentlich müssten wir Gehälter wie in Norwegen oder Luxemburg oder der Schweiz haben. \n\nDie Reallohnentwicklung stagniert hier allerdings politisch gewollt und die Leute haben auch kein Wohneigentum sondern sind abhängige Mieter - das ist auch politisch gewollt. \n\nMan verbucht als imaginär „die Rente“ zum Vermögen hinzu - was natürlich nichts an den Problemen ändert aber die Statistik besser aussehen lässt. \n\nPolitisch gewollt meint übrigens vom Volke gewollt, denn das Wahlvolk wählt seit 30 Jahren zuverlässig die Parteien, die uns oben beschriebene Umstände einbrocken. "
        ]
    },
    "Was ist eure Meinung zur vorgeschlagenen Deutschland- Rente ?": {
        "title": "Was ist eure Meinung zur vorgeschlagenen Deutschland- Rente ?",
        "score": 47,
        "url": "https://www.reddit.com/r/Finanzen/comments/1dlpamx/was_ist_eure_meinung_zur_vorgeschlagenen/",
        "content": "https://finanzen.hessen.de/Initiativen/Deutschland-Rente\n\nWäre dies ein sinnhaftes System und wie würde man den Teil abdecken der bisher nicht vorgesorgt hätte.\n\nMich interessieren eure Meinungen.\n\nSchönen tach ",
        "num_comments": 128,
        "comments": [
            "Riester verpflichtend? Das ist ja wohl das letzte…",
            "Edit: Hab mal ins Konzeptpapier geschaut \n\n\"Der Arbeitgeber ist verpflichtet, für jeden seiner Arbeitnehmer einen gesetzlich festgelegten \r\nBeitrag vom „Nettolohn“ in ein Riesterprodukt eines privaten Anbieters oder des Deutsch-\r\nlandfonds einzuzahlen.\"\n\nSo ein Murks. \n\nOriginalbeitrag:\n\nNaja, wird das opt-out gespart indem ein Teil meiner jetzigen Rentenzahlungen verwendet wird oder kommt das oben drauf? Wenn ersteres können die das ruhig machen. \n\nAm Ende geht das ganze Geld dann nur in ESG Fonds Dax und damit wird die Performance eher meh. Und dem Staat trau ich auch zu den Fonds irgendwann mal zu plündern.\n\nLetztendlich ist die absolut einfachste Lösung Aktienverkäufe nach 10 Jahren Haltedauer steuerfrei zu stellen und das beim Michel fleißig zu bewerben.",
            "Ich verstehe nicht warum wir immer einen deutschen Sonderweg gehen müssen wenn viele andere Ländern doch bereits gerzeigt haben wie es geht:\n\n* Jeder bekommt automatisch und kostenlos ein Depot bei der deutschen Rentenversicherung.\n* Teile vom Gehalt oder Arbeitnehmeraktien können steuerfrei ins Depot überwiesen werden.\n* Dividenden oder realisierte Gewinne werden automatisch reinvestiert.\n* Es gibt ein standard Fond/ETF der bespart wird (heiliger Gral). Es dürfen aber andere zertifizierte Fonds bespart werden.\n* Geld wird erst beim Abfluss aus dem Depot versteuert.\n\nGute Rendite, geringe Kosten, keine Querfinanzierung der lokalen Versicherungsindustrie.",
            "Warum nicht einfach Roth IRA oder 401k?",
            "Dieses ganze Rententhema in DE ist einfach nur noch unverschämt. Lasst mich Betrag x (10000€/a) Brutto in einen ETF MEINER Wahl stecken und fertig. Dieser ganze Mist von dem nur wieder neue Beamtenstellen geschaffen werden sollen, ist so respektlos. Was von sozialer Gerechtigkeit und armen Rentnern erzählen aber es den Arbeitern nicht mal erlauben von ihren Bruttolohn was für das Alter zurückzulegen, Beamten aber mehr Rente lassen als viele nicht mal zu Lebzeiten haben. \n\nWir wissen doch alle was am Ende kommt: Du darfst 1000€/a steuerbegünstigt in einen All Green DE ETF stecken, der min. 50% Frauenquote braucht, keine Geschäfte mit dem Ausland macht und Du darfst ab ca. 80 Jahren dann jährlich 200€ entnehmen. ",
            "Warum machen die nicht einfach einen 401k? Fertig. \n\nDas Grundproblem ist doch, dass der Generationenvertrag idiotisch ist und keiner Vermögen, oder Rentenansprüche selbst aufbaut um den Ruhestand zu managen. Irgendwie soll alles vom Vater Staat kommen. Der sich nicht zu helfen weiß und die Banken und Versicherungen das irgendwie machen lassen möchte mit den alten Kackprodukten, wie Riester.",
            "Rechnen wir mal:\n- Rentner im Umlagesystem (war einfach nicht gut zu verkaufen, dass es erst Rente gab, nachdem eingezahlt wurde)\n- Rente im Ansparsystem 25% von 45.000 Euro über 45 Jahre 506.200 Euro Kapital ohne Zinsen mit Zinsen etwa \n€1.211.650,03 - €5.326.338,13\n=>4000-8600 Euro mtl. bei 4% ohne Kapitalabbau\n(je nach Inflation kann man davon leben etwa ÷4 heutiger Wert von 1000-2000 Euro könnte man leben)\n\n=> wie soll man aber 25% ansparen, wenn man noch die Rentner aus dem Umlagesystem finanzieren soll? Deutschland hätte genug Zeit gehabt, die Umlage aus den 60ern mit Kapital zu unterdecken und merkt es erst jetzt\n=> dann wurden noch Mindestrenten eingeführt, um die Sozialhilfe zu entlasten immer schön auf den Rücken der Beitragszahler.\n=> klar mussten die Rentner in der Nachkriegszeit irgendwie finanziert werden aber die langfristige Entwicklung war schon immer klar und die Sozialhilfe der Kommunen hätte diese Menschen nicht auffangen können ABER warum fällt dies erst jetzt auf?\n\nDie Idee ist, dass jeweils die neue Generation doppelt zahlt und privat vorsorgt, damit man die staatliche Rente, die diese auch eingezahlt haben, streichen kann. Probiert aktuell GB mit Rentnern aus, die im Ausland leben. Das geht jetzt seit 30 Jahren so und keine Generation will sich verarschen lassen und doppelt zahlen. Irgendwann muss sich eine ganze Generation finden, die sich so übern Tisch ziehen lässt.",
            "Wenn der Staat jedoch entscheidet, in welche Unternehmen der Deutschlandfonds investiert, könnte das wieder eine politische Sache werden. Da besteht die Gefahr, dass die Investitionen im Einklang mit der Politik stehen sollen. Also nicht, was schlecht für das Klima ist und keine Unternehmen in \"bösen\" Staaten.",
            "Ich bin vom Hochhaus gesprungen. Anfangs war alles super. Jetzt kommt der blöde Biden (Boden, natürlich , Autokorrektur…, fands aber lustig) total schnell näher. \n\n Was ist Eure Meinung zum Vorschlag einen Fallschirm zu häkeln und welche Farbe sollte er haben?",
            "Riester und Rürup sind selbst für Laien als absolute Subventionsmechanismen der ansonsten Nullsummenspieleneden Versicherungen erkennbar. \n\n\nDieser Vorschlag ist nichts anderes als auf die Bruttolohnumlage (die defakto einem gigantischen nie endenden Steuergeschenk an die Versicherungen entspricht) noch gesetzlichen Zwang zur Einzahlung zu packen. \n\n\nDas wären dann ja wirklich langsam Bananenrepublik Zustände. Da sind chinesische Staatskonzerne ja lupenreine freie Marktwirtschaft im Gegensatz zu deutschen Versicherungen..."
        ]
    },
    "Noch jemand, bei dem das DKB Depot verschwunden ist?": {
        "title": "Noch jemand, bei dem das DKB Depot verschwunden ist?",
        "score": 8,
        "url": "https://www.reddit.com/r/Finanzen/comments/1dluc77/noch_jemand_bei_dem_das_dkb_depot_verschwunden_ist/",
        "content": "Ich hab gerade festgestellt, dass sowohl in der App als auch im Browser das Depot in meinem DKB Konto verschwunden ist. Stattdessen nur eine Fehlermeldung, man solle es später noch einmal versuchen. Würde gerne einen Screenshot teilen, aber Reddit ist auch betrunken und sagt, ein Bild muss mindestens 20 Pixel hoch und breit sein. 1080x558 sind das zwar aber was weiß ich schon.",
        "num_comments": 26,
        "comments": [
            "Komisch, bei mir ist ein zusätzliches Depot aufgetaucht auf den Namen TotoMacFrame.\n\nDa war allerdings nur Mist dran, hab gleich alles verkauft und mit dem Geld einen 1st class Flug in die Karibik gebucht.",
            "Wahrscheinlich werden gerade die Sparerfreibeträge auf die jeweiligen Kundenkonten überwiesen, das kann erfahrungsgemäß dauern.       /s",
            "Wartungsarbeiten halt",
            "Jep.",
            "Jo, gerade irgend eine Fehlermeldung und es wird nicht angezeigt.",
            "ob long, ob short: das Geld ist fort.\n\nDie Bank gewinnt immer.",
            "Mist jetzt kann ich aufm Samstag nicht auf mein Depot onanieren.",
            "meine Güte wart halt einfach 🙄",
            "https://preview.redd.it/155w9ihk848d1.png?width=1080&format=pjpg&auto=webp&s=8cc5a0257d4f1f290b347eca7ad818c42a5e0af3",
            "Qualität hat seinen Preis"
        ]
    }
}