{
    "Daily FI discussion thread - Friday, June 28, 2024": {
        "title": "Daily FI discussion thread - Friday, June 28, 2024",
        "score": 26,
        "url": "https://www.reddit.com/r/financialindependence/comments/1dqf7jk/daily_fi_discussion_thread_friday_june_28_2024/",
        "content": "Please use this thread to have discussions which you don't feel warrant a new post to the sub. While the Rules for posting questions on the basics of personal finance/investing topics are relaxed a little bit here, the rules against memes/spam/self-promotion/excessive rudeness/politics still apply!\n\nHave a look at the [FAQ](https://www.reddit.com/r/financialindependence/wiki/faq) for this subreddit before posting to see if your question is frequently asked. \n\nSince this post does tend to get busy, consider sorting the comments by \"new\" (instead of \"best\" or \"top\") to see the newest posts.",
        "num_comments": 393,
        "comments": [
            "Funny how clueless coworkers use the company wide cloud storage for their personal documents. Some stuff I found: tax returns, personal budget spreadsheet, medical waivers and position appeal forms. ",
            "Over the last 6 ish months I automated all of my excess saving contributions and while it is lower maintenance, it is weird feeling like I don’t have any “extra” money to put away because an algorithm puts it all away for me. I land on the same numbers every month and it doesn’t feel like saving, even when it is. \n\nJust an interesting quirk I suppose in behavior.",
            "back to the (mostly) retired life for me.  Today was my last day at my full-time gig, decided it was time to bounce after 15 months.  It doesn't quite hit the same the second time around.  Originally pulled the trigger in may '21, went back to work in April '23.  Balance sheet when I quit was about 2.4 million and was also that same amount when I went back to work (having climbed to 2.7 then dropped to 2.0 before getting back to 2.4 again).  Just updated the spreadsheet for the end of month and we're at 3.5 million.  My wife will work for a few more months until some bonuses pay out and then we'll give full retirement a second try.",
            "This week my boss told me my goals for the year. Not even an hr later on a leadership call, the entire meeting was actively doing things against my goals. I intend to tell my boss either change my goals or you can mark me as fail now cause I’m not doing it. \n\nThis entire company is a disaster. I don’t think my plans to coast are going to work well this year with the amount of shit that keeps getting sent my way.",
            "Happy Friday all! I’ve been at literally 399.9k in liquid assets all week and this week’s paycheck finally bumped me over the 400k threshold. \n\nI’m celebrating by drinking my usual morning cup of cold brew.",
            "Sprung for the guac on my chipotle bowl today, so I guess I've made it.",
            "Welp, after talking about it for a while, finally pulled the trigger today and booked a family cruise for the three of us. Let's make those memories!",
            "The startup I'm working for had to do some layoffs recently due to funding issues. Yet somehow a remote working \"Web3 Growth Manager\" is still with the company. The only interaction I had with him was when he was justifying his existence by making a presentation on NFTs. This isn't the pandemic anymore, NFT is dead so why is he still with the company while engineers are getting laid off? We are a space company, we don't need web3 or NFT.\n\nOn another note, we just hit $1.9M net worth today. Fingers crossed that we'll be multi-millionaire status by end of the year.",
            "Six months into 2024, up $110k YTD in returns in the Vanguard accounts.  1-year is showing +$207k and 26.9%.   \n\nRetirement sure is easy when number just goes up, huh?",
            "Is today VTI dividend day?"
        ]
    },
    "The Official 2023 Survey Results Are Here": {
        "title": "The Official 2023 Survey Results Are Here",
        "score": 183,
        "url": "https://www.reddit.com/r/financialindependence/comments/1cl177n/the_official_2023_survey_results_are_here/",
        "content": "\r  \nMike you can stop asking because… [The data for the 2023 survey](https://docs.google.com/spreadsheets/d/1RtUK46jQ1C5MwVacKZiBxQFlEttFt9WT/edit?usp=share_link&ouid=112591517930876052627&rtpof=true&sd=true) is now available. Woot woot. \r  \n\r  \nThere are multiple tabs on the sheet: \r  \n•\tResponses: The survey results after I did some minimal clean up work. \r  \n•\tSummary Report – All: Summary that the survey software automatically kicks out (this is what folks were seeing after taking the survey). \r  \n•\tStatistics – All: Statistics that the survey software automatically kicks out (this is what folks were seeing after taking the survey). \r  \n•\tRemoved: Responses that I removed as either suspected duplicates or because they were almost entirely blank. \r  \n•\tChange Log: My notes on the clean-up work I did. \r  \n\r  \nAnd if you want some history, here are the prior results. I’m also linking the old Reddit posts when I released the data, you can see the old visualizations linked in those if you’re so inclined. \r  \n\r  \n[2022 Survey Results](https://docs.google.com/spreadsheets/d/1vbuTdghDb5zYrIVBQcdK-Z5U3r_XA3U4/edit)/ [2022 Response Post](https://www.reddit.com/r/financialindependence/comments/141xbp1/the_official_2022_survey_results_are_here/)  \n[2021 Survey Results](https://docs.google.com/spreadsheets/u/6/d/1KrqDJpMHBLP3ZT1hloldjfesJb6QpgpS/edit?usp=sharing&ouid=112591517930876052627&rtpof=true&sd=true)/ [2021 Response Post](https://www.reddit.com/r/financialindependence/comments/uu5373/the_official_2021_fi_survey_results_are_here/)  \n[2020 Survey Results](https://docs.google.com/spreadsheets/d/1H4RMvxioEkhOhSpOsL5SeHFSrjkN68L4HxHQRv8V52M/edit?usp=sharing) / [2020 Response Post](https://www.reddit.com/r/financialindependence/comments/m1q8ia/official_2020_fi_survey_results/) \r  \n[2018 Survey Results](https://drive.google.com/file/d/1n2IpbpA_vGKSflRNuiRo-slvJdpptLfM/view?usp=sharing) / \r  \n[2017 Survey Results](https://docs.google.com/spreadsheets/d/11rwMAOLCOH2kJMVKeywoBWFGRY5RzORNzKR_BhoXbiw/edit?usp=sharing) / [2017 Response Post](https://www.reddit.com/r/financialindependence/comments/8ai335/initial_financial_independence_survey_results_are/)  \n[2016 Survey Results](https://docs.google.com/spreadsheets/d/1z3eRFHv2qKD7i_V4e3jup5BQ8FNRt9Ki/edit?usp=sharing&ouid=112591517930876052627&rtpof=true&sd=true) / [2016 Response Post](https://www.reddit.com/r/financialindependence/comments/4tur6p/survey_results_here_you_go/)  \r  \n\r  \nNote: The 2016 - 2018 results are partial - all respondents were able to opt in or out of being in the spreadsheet, so only those who opted in are included. 2016 also suffered from a lack of clarity in the time period responses should cover, which was corrected in later versions.\r  \n\r  \nAnd if you really want to see a blast from the past… \r  \n[Here’s the very first survey that was ever posted](https://www.reddit.com/r/financialindependence/comments/4ai59t/please_complete_our_periodic_sevenquestion_fi/)  \n[And here’s how I wound up in charge of it…](https://www.reddit.com/r/financialindependence/comments/4ewajj/update_on_fi_survey_help_needed/) \r  \n[And here’s what we originally all wanted to get out of this thing.](https://www.reddit.com/r/financialindependence/comments/4feuej/prefi_survey_discussion_to_be_closed_on_sunday_424/)  \n\r  \n\r  \nReporters/Writers: Email redditfisurvey@gmail.com or send this account a private message (not a chat) with any inquiries.\r  \n\r  \n",
        "num_comments": 175,
        "comments": [
            "Now, we wait for someone to summarize.",
            "Out of the people that responded:\n\nPrimary residency value: $575,032  \nAverage (non-investment) wage: $285,619\n\nFor sure not an average cross section of the rest of reddit.",
            "Well, I guess I am the unicorn: 50, divorced, a woman, and FI(RE).",
            "LOL looking at these secret codes is the best part.\n\nProps to BANGARANG, perhaps the only other person besides me who still remembers the movie Hook!\n\nWhat a masterpiece.",
            "I'm extra old, extra poor in relations to these numbers :) but working on it! (better late than never)",
            "Shocked at the lack of medical debt.  I guess we're all planners / have  had good insurance?",
            "I just want to know what car(s) the person with $315,000 of auto loan debt has!",
            "Interesting result to me is that our biggest expense is taxes! Yay 😀 😯",
            "I definitely appreciate the effort and work in this and it just makes me realize how much I hate some people.\n\nSomeone put in they need $500 million to consider themselves retired?  Makes it hard to see actual cool analysis.\n\nThe median, however, is a great stat and is much more telling.  It's weird. I consider myself an above average consumer compared to some of the cheaper and frugal-er people here.  But my FI $ is about the same as the median.  Also seeing just how insanely conservative this sub is - a median 3.7% withdrawal rate.  I would love to see breakouts by age or current net worth to see how similar situated individuals respond.  And maybe one day if I decide to stop being lazy I'll do that for myself.  But this is cool.\n\nSome questions also aren't making sense to me.  I.e. 54 in the 'Statistics - ALL' tab. \"What age do you intend to retire?\" Range is 2 to 13?  A bunch of pre-teens roaming this sub I don't know about?\n\nThanks for doing this!  Obviously easy to complain but having the manpower and hours to put this together is still cool to see.",
            "Am I reading this wrong? Summary sheet, questions 24 and 29 — the percentages look wonky."
        ]
    },
    "Anyone here who has Coast FIRE'd and then became full FIRE? ": {
        "title": "Anyone here who has Coast FIRE'd and then became full FIRE? ",
        "score": 44,
        "url": "https://www.reddit.com/r/financialindependence/comments/1dqry9v/anyone_here_who_has_coast_fired_and_then_became/",
        "content": "I'm debating whether I want to aim for coast FIRE to reduce my working hours so that I gain hours back into my life or just pursue full FIRE so that I'm completely free from work.\n\nI took one year off of work completely in the past and it was amazing. I learned about coast FIRE last year and I'm a few years away from it, so I'm a little torn on what to do. I'm still at least 10 years or more for full FIRE.\n\nI'd like to hear experiences from people who did coast FIRE and then decided to go for full FIRE (instead of waiting until traditional retirement age). Maybe that'll help me decide...",
        "num_comments": 45,
        "comments": [
            "Not exactly, but I hit a coast-ish number and just…stopped working as hard at my decent paying job. That’s not to say I don’t do anything. I’m still a solid performer and my company needs my skill set that they can’t immediately replace (ie it’d be costly and time consuming to find a replacement). \n\nSo I just show up a bit later, head home a bit earlier, take a bit longer of a lunch, say “no” way more, stand up for myself and enforce my boundaries, speak my mind (tactfully but honestly). Basically, I’m coast enough to realize that as long as I’m not a bottom performer, it’ll likely be more difficult to fire and replace me than to just let me do my job (but not an iota more). \n\nMaybe a bit risky, but like…worked hard to get here, and starting to enjoy the benefits of F-You money in a real way.",
            "I knew nothing of these acronyms at the time but I quit my well-paid career and did minimum wage jobs from the age of about 28 to 35 when I retired. Just let the Investments grow whilst spending my minimum wage.",
            "Not yet but thats my plan.  Probably coasting 10 years then fire.",
            "The Fioneers has a lot of posts and case studies about this. They call it SlowFI.\n\nIf you are still 10 years away, I would suggest CoastFI asap but still have a goal of early FIRE. So don't completely stop adding to your portfolio. Just slow it down to gain back some freedom now.",
            "I did that -- sort of.  I went WFH in a technical consulting role for my last few years before retiring two years ago.  It was nominally full time, but my schedule was erratic and unpredictable, so while my availability for work stayed high, the actual load averaged a lot less than full time.  I found this combo meshed well with my WFH routine and the fact my time-off was doing stuff on the computer anyway, so work was mostly confirming an empty in-box every hour or so for the most part.  The biggest change after retiring is that I no longer have to check incoming e-mails regularly, so I can go shopping or out for a long walk at any time.  I don't have the desire to travel, but my gig would have been ideal for a digital nomad type if they could live happily in a location with a time zone and shift preference that is compatible with the required available hours.  I ended up retiring mainly due to family medical needs.",
            "I hit coast fire a while back, and was going to start working part-time when I hit 600k NW (67% FI) at some sort of Barista-FIRE type of job. Before taking the plunge, I asked for a 30-hour work week at my corporate job, expecting them to say no or to say yes with prorated pay. They ended up offering me the 30-hour work week with FULL PAY! I eventually got laid off from that job, but it taught me to put about 10% less effort into these salary jobs. I have the financial security to do so, and I’m only a few years from FI at this point so I don’t need to climb any corporate ladders nor do I have any interest in doing so.",
            "I'd check out /r/CoastFIRE",
            "It would be helpful to know how far along you are in % of desired FI number as well as what % of income you are currently saving. Personally I wouldn't recommend coasting until you are at least at 50% of your FI number.\n\nI quit my job last year at a lean FIRE number at age 37, but I plan to keep working a tax season job like I did this year, or something else part time or seasonal, so barista FIRE I guess. (I also got lucky in that the market has gone up 20% since I quit last year and I'll likely eventually inherit at a minimum some rental farmland where my share should be around $8k/ yr. I'll also get a small pension of estimated $6k inflation adjusted at age 62).",
            "Well, I’m still working on it. But I quit my FT job and planned to do consulting work here and there for a while or for as long as I don’t need to use savings outside of my corporate bank account….\nI’m still going at it, I make more money than I used to before and I enjoy the flexibility.",
            "I am currently CoastFIRE and wife and I are working on a plan to FIRE in a few years.  I'm only working because she doesn't want to retire yet and I'd feel bad."
        ]
    },
    "5-Year Working Anniversary - FI Progress Update": {
        "title": "5-Year Working Anniversary - FI Progress Update",
        "score": 18,
        "url": "https://www.reddit.com/r/financialindependence/comments/1dqsll8/5year_working_anniversary_fi_progress_update/",
        "content": "Hey everyone! I \\[27M as of today\\] am a long-time lurker and occasional commenter here. I discovered FI in early 2017 during my sophomore year of college at 20 after stumbling upon the ChooseFI podcast. Had minimal knowledge of finances at all as evidenced by this [post](https://www.reddit.com/r/personalfinance/comments/6lm0qm/20_yo_looking_for_financial_advice/), which gave me a chuckle. The catalyst for my interest here was pretty much how awful being confined to a desk from 7 AM to 5 PM felt, even starting with my internships in 2017 & 2018. This post is partially serving for my own edification and records, but I am welcome to constructive criticism or advice from anyone pursuing FI.\n\n**Education**: \n\nI'm a first-gen college student, I graduated in June 2019 with a BS in Mechanical Engineering from a public state school in Northeast USA, with minors in Math and Aerospace Eng. Being a \"1st gen student\", I benefited from a few scholarships and only walked out of undergrad with $32k in loans constituted by a mixture of federal and private. I am grateful to my parents who assisted me, and I made up the difference with on-campus jobs as a TA and with money made during summers through interning. \n\nI graduated with a whopping $743 in my checking account, a -$31k individual NW, and was wholly reliant on my then gf (now wife) for financial support for the first 2 months of full-time employment. My GPA and experience were decent and I managed to land a government job as a Mechanical Engineer for $59k. \n\n**Debt:**\n\nI only saved 6% in my 401k for the match from June 2019 onwards, and I shoveled all my discretionary income into my loans and paid them off by December 2020. Conversely, my wife contributed 10% into her 401k and served as the emergency fund for our household unit. Extremely fortunate to have her in my life.\n\nI got lucky with the pandemic. It pretty much allowed me to focus on just paying loans off and not do anything else with my money (since everything was locked down). I keep this part quiet because almost everyone else in the world had an opposite reaction. Was a weird life duality to be honest. Everything was terrible for friends and family members, but personally me and my then-gf were doing OK.\n\nStarting 2021, after debt payoff, we kept our lifestyles the same and maxed our retirement accounts and worked hard. I got work to pay for my masters degree, which was a nice perk.\n\nWe are fortunate to have each other as a support system financially, and to have our friends and family to support us personally.\n\n**Work**:\n\nI went from Mechanical Engineering into Project Management in January 2020, with focuses on mechanical, electrical and software systems in the aerospace and defense sectors. There's a good amount of money and a decent amount of stability here. In January 2021, I started a masters in Systems Engineering to prove to myself I could (got work to pay for the whole thing), graduated December 2022. I had a 1-year continued service clause/contract, which ended December 2023, where I then leveraged it into a Program Manager role this past March with a lot higher of pay. \n\nMy proclivity for PM really comes down to being disinterested in technical engineering, and being much better at talking to customers and communicating requirements. I also did not feel that I would be “smart enough” for rising to the top of the technical mech engineering disciplines, but I just have strengths in other softer areas. Playing to my strengths, I suppose. I was pushed/prodded into presenting and interfacing with high up stakeholders and customers and lo and behold I was a PM. \n\n**Compensation/Salary Progression**:\n\nWife \\[27\\] and I got married in 2023, but have been together since 2015. Finances were always a transparent topic and we're pretty identical in terms of frugality.\n\nMy salary:\n\n* 2019: $59,222\n* 2020: $65,114\n* 2021: $72,413\n* 2022: $86,080\n* 2023: $108,160\n* 2024: $145,000\n\n  \nHHI:\n\n* 2019 - $111k \n* 2020 - $119k \n* 2021 - $154k \n* 2022 - $176k \n* 2023 - $214k \n* 2024 - $265k (on track)\n\nWe’ve both been pretty keen on advocating for ourselves at our jobs and applying internally and externally. I was at a gov job until March 2024 where I had solid jumps due to the GS ladder. Leveraged a grad degree and experience for a big jump into private industry. My wife was able to move around internally 2 times and have great success at her current company in 2021 and late 2022. She is currently also pursuing a masters and we are expecting a big pay raise for that in 2026 or thereabout.\n\n**Net Worth:**\n\nOur generic NW history can be found [here](https://imgur.com/a/WXATtnm). We are DINK right now, and have had a dog since 2020. Kids are probably in the cards, but most likely not until ages 29 to 30. We bought a house in April 2023 which is reason for the flatline-spike-flatline (down payment flowed out, house equity flowed back in, improvements flowed back out).\n\n* June 2019 = -$31k\n* December 2019 = $0\n* April 2021 = +$100k\n* March 2023 = +$200k\n* November 2023 = +$300k\n* May 2024 = +$400k\n\nThere’s probably 0 chance we hit $500k by end of the year, but we have hope!\n\n**Current stats (combined)**:\n\n* Checking/Savings = $67k\n* 401ks (90% trad 10% roth) = $241k\n* Roths (100% VTSAX) = $24k\n* HSA = $13k\n* House Equity = $78k\n* Total NW (including house) = $423k\n\nWe do churning (bank accounts and cc's) and our balances vary from -$3k to -$12k combined, and are currently sitting on about +$6k of points equivalent. Paid off in full every month, factored into the checking/savings line item above.\n\n**Philosophy/Goals:**\n\nMy goal in life has pretty much been to just focus on learning and excelling as much as possible. I will acknowledge that it has been a surreal ride and crazy salary progression. \n\nI feel very unmotivated by work, but very motivated by money and the option for freedom.\n\nMy ideal job is one with \"no boss required,\" and potentially pivoting into part-time consulting work if I can build up an extensive network and knowledge base.\n\nThat's pretty much it. Our focuses between now and age 30 are excelling in our careers, enjoying our respective hobbies, and spending quality time with friends/family and each other. \n\nOur expenses have been high for the past year but we've also been doing a significant amount of home improvements. \n\nCurrent Annual Expenses = $90k ($8.5k x 12)\n\nProjected Annual Expenses = $120k\n\nProgress on the way to \"FI\" = \\~14%\n\nI'll probably write another post in 5 more years, at the 10-years of working anniversary. Cheers everyone, keep on chugging along.\n\nTL;DR - FI good, we were lucky, and rewarded for continued tenacity and conviction in different life areas. I am immensely grateful for this community for shaping my life. ",
        "num_comments": 3,
        "comments": [
            ">The catalyst for my interest here was pretty much how awful being confined to a desk from 7 AM to 5 PM felt, even starting with my internships in 2017 & 2018. \n\nWhy don't you look for a job that doesn't involve being confined to a desk all day?",
            "Wow, you are doing way better than I was at 27 (only 250k at that time). Quick question on the project engineer role, are you still in the Northeast?",
            "Great question! I also don’t love mandated manual labor or travel for work (I’m a home body by design). In essence, I have discovered I’m truly productive for a solid 3-4 hours per day, then I get restless.\n\nAnd there is a minimal juncture of work I am equipped to earn my level of income for, and of jobs which interest me, and most demand WFH/office work where I’m inherently computer bound 80% of my working time."
        ]
    },
    "The Gospel of The Church of FIRE": {
        "title": "The Gospel of The Church of FIRE",
        "score": 103,
        "url": "https://www.reddit.com/r/financialindependence/comments/1dqeq0d/the_gospel_of_the_church_of_fire/",
        "content": "Have you heard the good news? FIRE is here to save your soul from the fiery pits of the 9-to-5 grind.\n\n🔥 The Sacred Trinity\n\n1. Financial Independence - The Father, who blesses us with freedom from the chains of paychecks.\n2. Early Retirement - The Son, who shows us the way out of the infernal office.\n3. Enjoy Life - The Holy Spirit, filling us with the joy of not giving a damn about Monday mornings.\n\n👹 The Fires of Hell (Work)\n\nAh, the eternal damnation of work, where souls languish in cubicles of despair. But fear not, for salvation is near! The gates of FIRE Heaven are wide open to the faithful.\n\n🙌 Blessings: The Sacred FU Money\n\nMay you receive the divine blessing of FU Money. Let this holy benediction remind you of the ultimate goal: telling the corporate overlords to FU.\n\n🚨 Temptations: The Siren Call of \"One More Year\"\n\nBeware, faithful followers, of the insidious temptation to stay \"One More Year\" in the hellish confines of work and your golden handcuffs. This devilish whisper is a trap to keep you from your divine destiny.\n\n🦹‍♂️ The Devil: Sequence of Return Risk\n\nIt's lurking in the shadows, ready to devour your nest egg as you approach the gates of FIRE Heaven. Arm yourself with diversification and a hefty emergency fund to fend off this malevolent force.\n\n👼 Prophets\n\nPraise be to Mister Money Mustache and other great prophets who revealed the path to frugality and freedom. They speak the gospel of badassity and guide us with his wisdom towards the Promised Land of early retirement.\n\n😈 The Seven Capital Sins\n\n1. Individual Stock Investing - Fools' gold that leads the unwary astray.\n2. Living Paycheck to Paycheck - The pit of eternal financial damnation.\n3. Not Tracking Your Expenses - The path to perdition is paved with untracked expenditures.\n4. Ignoring Index Funds - The heresy of the impatient.\n5. Consumer Debt - The shackles that bind the soul.\n6. Inflation Ignorance - The silent thief in the night.\n7. Procrastination in Investing - The greatest sin, delaying your entrance to FIRE Heaven.\n\n📜 The Ten Commandments of FIRE\n\n1. Thou shalt save and invest thy savings, for this is the only path to FIRE.\n2. Thou shalt maximize thy income, squeezing every penny from the labor of thy hands.\n3. Thou shalt minimize thy expenses, living a life of frugality and purpose.\n4. Thou shalt invest early, for compound interest is the manna from heaven.\n5. Thou shalt honor time in the market over timing the market, for patience is a virtue.\n6. Thou shalt diversify thy investments, shielding thy wealth from the whims of fate.\n7. Thou shalt avoid the temptations of debt, for it is the gateway to financial hell.\n8. Thou shalt track thy expenses diligently, for ignorance leads to ruin.\n9. Thou shalt preach the gospel of low-cost index funds, converting the uninitiated.\n10. Thou shalt keep the faith, for FIRE Heaven is reserved for the steadfast and the wise.\n\nRejoice, for the path to FIRE Heaven is illuminated by these holy tenets. Go forth, spread the gospel, and may the sacred flame of financial independence burn brightly within you!\n\nBlessed be the FIRE within us all. GFY. 🙏🔥",
        "num_comments": 87,
        "comments": [
            "This isn't insane at all.",
            "In Bogle's name we save, amen",
            "FIRE is my sheppard, I shall not spend.\n\nFIRE maketh me to lie down my green credit card: FIRE leadeth me beside the maxed out retirement funds.\n\nFIRE restoreth my freedom: FIRE leadeth me to build the life I want and then save for it.\n\nYea, though I walk through the valley of the shadow of debt, I shall fear no layoff: for the principles of FIRE art with me; thy 6 month Efund and thy marketable resume they comfort me.\n\nFIRE preparest a retirement before me in the presence of my management: FIRE anointest my career with promotion; my 401K runneth over.\n\nSurely 10% a year average gains and the 4% rule shall follow me all the days of my early retirement: and I will dwell in a paid off house forever.\n\nEdit: /u/Nurse_On_FIRE is a wordsmith and pointed out that it should be the \"shadow of debt\" vs bankruptcy.",
            "Finally some quality OC that is worthy of the lax moderation rules.",
            "I am a heathen lol\n\n1. About 10% of my portfolio is individual stocks (was 5%, but NVDA)\n\n2. Dont track expenses closely at all, just track monthly deposits to brokerage\n\n3. Have not maximized income, chose to step back and take a 10% paycut to reduce stress\n\n4. I have 5% of my portfolio that is in bonds, that is earmarked to buy the dip with leverage whenever the market is down 20% or more. \n\n5. I never ever talk fire with anyone except my wife.",
            "In before the mods remove this 😎",
            ">Praise be to Mister Money Mustache and other great prophets who revealed the path to frugality and freedom.\n\n\nDo people still follow Mister Money Mustache? He hasn't really contributed to the FIRE community in awhile. Most of his recent blogs are \"I bought a Tesla\" and \"I moved to a cultish walking only community.\" He's good starting point for getting to know the basics of 4% Rule and that's it.",
            "For those who don’t understand religious narrative..\n\n**The Secular Guide to FIRE**\n\nHave you heard the great news? FIRE is here to liberate you from the monotonous cycle of the 9-to-5 grind.\n\n**🔥 The Core Principles**\n\n1. **Financial Independence** - The cornerstone that grants us freedom from the dependency on paychecks.\n2. **Early Retirement** - The path to escaping the endless office routine.\n3. **Enjoy Life** - Embracing the joy of not dreading Monday mornings.\n\n**👹 The Despair of Work**\n\nAh, the eternal drudgery of work, where individuals toil in cubicles of monotony. But worry not, for liberation is near! The gates of FIRE fulfillment are open to all who seek it.\n\n**🙌 The Power of FU Money**\n\nMay you achieve the empowering goal of FU Money. Let this serve as a reminder of your ultimate objective: having the freedom to say no to corporate demands.\n\n**🚨 The Temptation of \"One More Year\"**\n\nBeware the tempting thought of staying \"One More Year\" in the confines of work, clinging to the comfort of a stable paycheck. This tempting thought is a barrier to your ultimate freedom.\n\n**🦹‍♂️ The Threat: Sequence of Return Risk**\n\nLurking in the shadows, ready to jeopardize your nest egg as you approach FIRE. Protect yourself with diversification and a robust emergency fund to counter this risk.\n\n**👼 The Guiding Voices**\n\nRespect to those like Mister Money Mustache and other advocates who have illuminated the path to frugality and freedom. They offer practical wisdom, guiding us towards the goal of early retirement.\n\n**😈 The Seven Financial Pitfalls**\n\n1. **Individual Stock Investing** - A risky gamble that often leads astray.\n2. **Living Paycheck to Paycheck** - A cycle of financial instability.\n3. **Not Tracking Your Expenses** - The road to financial mismanagement.\n4. **Ignoring Index Funds** - The impatience that hinders progress.\n5. **Consumer Debt** - The chains that limit financial freedom.\n6. **Ignoring Inflation** - The stealthy thief of purchasing power.\n7. **Procrastination in Investing** - The most significant delay in reaching FIRE.\n\n**📜 The Ten Principles of FIRE**\n\n1. Save and invest diligently, for this is the path to FIRE.\n2. Maximize your income, making the most of your efforts.\n3. Minimize your expenses, living a life of purpose and frugality.\n4. Invest early, harnessing the power of compound interest.\n5. Prioritize time in the market over trying to time the market.\n6. Diversify your investments, protecting your wealth from uncertainty.\n7. Avoid debt, as it is a hindrance to financial freedom.\n8. Track your expenses meticulously, preventing financial pitfalls.\n9. Advocate for low-cost index funds, spreading financial wisdom.\n10. Stay committed, as FIRE is achieved through perseverance and wisdom.\n\nCelebrate, for the path to financial independence is clear through these principles. Embrace and share this guide, and may the fire of financial independence ignite within you!\n\nTo the FIRE within us all.",
            "Brothers! I've seen many followers make heretical claims about using networth rather than just passive investments to misrepresent their piety and devotion unto FIRE.\n\n\nThese sinners are deluded and any such preaching of home equity are but the manifestation of the Devil's trickery!\n\n\nWe must cull this practice immediately, and punish these sinners accordingly.",
            "As ex-catholic, I love this as satire."
        ]
    }
}