{
    "Wöchentliche Finanzdiskussion - KW 26 - 2024": {
        "title": "Wöchentliche Finanzdiskussion - KW 26 - 2024",
        "score": 10,
        "url": "https://www.reddit.com/r/Finanzen/comments/1dn2brs/wöchentliche_finanzdiskussion_kw_26_2024/",
        "content": "Womit habt ihr euch diese Woche beschäftigt? Habt ihr Fortschritte zu eurem gewählten Ziel gemacht? Sind Probleme aufgekommen? Hier könnt ihr über alles Themenverwandte diskutieren.\n\n&#x200B;\n\nUm euch über die Traderepublic Bezahlkarte auszutauschen nutzt bitte den [Megathread](https://www.reddit.com/r/Finanzen/comments/1alrvzz/megathread_traderepublic_bezahlkarte/).\n\n \n\nDie vorherigen Posts findest du über die Suche mit [diesem Link](https://www.reddit.com/r/Finanzen/search/?q=W%C3%B6chentliche+Finanzdiskussion&sort=new&restrict_sr=on&t=all).",
        "num_comments": 169,
        "comments": [
            "Hatte Ende letzten Jahres das Condirect Angebot fr das kostenlose Tagesgeldkonto mit 3,75% Zinsen fr sechs Monate genommen, danach 0,75%. \n\nDie sechs Monate sind jetzt abgelaufen. Ich hatte schon befrchtet nach TR umziehen zu mssen aber siehe da, Comdirect hat mir statt 0,75% jetzt 3,5% gegeben. :)",
            "Hat hier schon jemand die neue IBAN-Umstellung fr Trade Republic gemacht? Fr Deutschland wurde sie schon vor einiger Zeit angekndigt, aber ich bekomme immer noch keine Einladung.",
            "Jemand schon seine Dividende aus dem A1JX52 bekommen? Bin bei ING",
            "Hab meine letzten Fremdwhrungsgehlter via Wise vom auslndischen Konto geholt. Jetzt hab ich keinen Bedarf mehr dafr. Also einfach kndigen? Fr was nutzt ihr das?",
            "Scalable hat mir gerade fr meinen akkumulierenden Vanguard S&P500 ETF eine Dividende gezahlt. Na wann da wohl die Korrekturbuchung kommt...",
            "Hat noch jemand das Problem das nach dem IBAN Wechsle bei Tradereupblic die Einzahlung deutlich lnger dauert?",
            "Mir ist Oliveml zu teuer geworden, was sind Alternativen?",
            "Wenn man bei TR eine Limit Order mit Aktien Stckzahlen macht, wie viele Nachkommastellen werden da ausgefhrt? Durch Sparplne habe ich 6 Nachkommastellen und wrde es gerne glatt machen. Hat hierzu jemand Erfahrungen?",
            "Wrdet ihr im Moment von greren Investments in den Msci World abraten aufgrund des zuletz so starken Anstiegs?",
            "Jetzt wo der Donald wieder Prsident wird, hab ich tatschlich Angst um mein Hab und Gut. Also nicht im Sinne von S&P 500 macht 2% mehr oder weniger im Jahr sondern eher so um \"das Ende der westlichen Zivilisation\". Ist der Donald ein schwarzer Schwan mit Ansage?"
        ]
    },
    "Mal eine kleine Anekdote, da es grad um Leben retten geht.": {
        "title": "Mal eine kleine Anekdote, da es grad um Leben retten geht.",
        "score": 396,
        "url": "https://www.reddit.com/r/Finanzen/comments/1dr8e52/mal_eine_kleine_anekdote_da_es_grad_um_leben/",
        "content": "Ich habe einen Kumpel, Bernhard. Bernhard ist 32, hat Winfo studiert und arbeitet insgesamt seit vier Jahren als Front End Developer. Ist im Osten mit 45k eingestiegen und ist jetzt bei 55k.\n\nHobbies hat er neben Stand-Up-Paddeln und Dota keine. Haut ab und zu viel Geld für Hardware raus, hatte bis letztes Jahr noch Grundversorgung Strom, mit einer Growbox immer wieder lustig, Geld lag auf dem Girokonto. Vor zwei Jahren habe ihm vom heiligen Gral erzählt, dass er sich ein Tagesgeldkonto einrichten soll, wie er Kosten spart mit seinen Verträgen, usw.\n\nEr hat einen festen Dota-Stammkreis. Diese komme aus Bayern, Frankreich, Portugal, Ungarn, Ukraine.\nDer ukrainische Kumpel hat jetzt einen Einberufungsbefehl bekommen. Entweder kommt er dem nach, er versucht zu flüchten - oder er zahlt 20k Dollar an den ukrainischen Staat.\nDie Clique hat Angst um ihn. Er hat Angst. Alle zusammen betrachten es als Todesurteil. Also hat die Gruppe 20k bezahlt, Bernhard davon 12. Welche Investition kann besser sein als das Leben eines Freundes? Sparen fetzt.\n\nLiebe Grüße  :)",
        "num_comments": 143,
        "comments": [
            "Kann man nur hoffen das diese Story so stimmt und das Geld nicht irgendwo versickert ist. Aber letztlich ist es immer gut Optionen zu haben.",
            "Die Wahrheit ist aber, dass nun jemand anderes eingezogen wird der kein Geld dafr hatte.",
            "Ukrainische Mnner knnen sich nicht fr 20.000 von der Einberufung freikaufen.",
            "Finde es sehr komisch dass man sich vom Militrdienst freikaufen kann. Hat etwas vom mittelalterlichen Ablasshandel. \n\nAber zum Thema ich hoffe dein Freund bekommt das Geld wieder zurck auch wenn ich nicht daran glaube. 20k ist eine Summe die man sich in ein paar Jahren ansparen kann wenn man nicht gerade im Mindestlohnsektor unterwegs ist.",
            "Klingt fr mich belst nach Scam, sorry!",
            "Dein Kumpel Bernhard hat also jemandem geholfen einen Beamten in der ukrainischen Regierung zu bestechen? Interessante Geschichte.",
            "Eine schne Anekdote, aber ich frchte, dass der Empfnger der 20k eventuell auf die Idee kommen knnte einen erneuten Einberufungsbefehl auszustellen. Der scheint in diesem Fall ja recht lukrativ zu sein.",
            "Sorry, aber klingt nach einer zeitgemen \"Kronprinz aus Nigeria\" Geschichte.",
            "11.980 in den Gral buttern, 20 fr eine richtig nette Abschiedskarte. ",
            "Scam , man kann sich jedenfalls nicht offiziell freikaufen"
        ]
    },
    "Ist r/Finanzen jetzt ganz offiziell Kundenservice, Kummerkasten und FAQ für Trade Republic?": {
        "title": "Ist r/Finanzen jetzt ganz offiziell Kundenservice, Kummerkasten und FAQ für Trade Republic?",
        "score": 222,
        "url": "https://www.reddit.com/r/Finanzen/comments/1dr5ny6/ist_rfinanzen_jetzt_ganz_offiziell_kundenservice/",
        "content": "Frage für einen Freund.\n\nNein, im Ernst: Finde die Anzahl der Threads mit direktem und indirektem Bezug zu Trade Republic ein bisschen viel hier. Da fand ich jedes Sankey spannender. Geht es damit nur mir so?",
        "num_comments": 64,
        "comments": [
            "Nein geht nicht nur dir so. Es wird gerade an einer entsprechenden Automodregel gebastelt. Es nervt.",
            "Ja, diese Menschen haben nur dieses sub. Es gibt keine andere Mglichkeit. Sie mssen auf ewig TR Kunde bleiben und sich hier weiter beschweren. Wir sollten fr sie beten.",
            "Die Anzahl der Nrgel-Posts nimmt leider auch zu, gehrt dann wohl zur Kategorie Kummerkasten.",
            "Wenigstens hat der Post dann irgendeinen Sinn und hilft irgendwem weiter. \nSo mancher hat gar keinen",
            "Alles ist besser als Sankeys",
            "TR hat wenigstens einen direkten Bezug zu dem Thema, um das es hier eigentlich geht. Und da hier seit Jahren jeder diese Grtz-App empfohlen und viele andere Leute dort hinein getrieben hat (obwohl ihr es bereits besser wusstet!), ist es kaum verwunderlich, dass die Leute mit ihren TR-Problemen jetzt hierher zurckkehren. /r/Finanzen hat einen nennenswerten Anteil daran, dass dieses Start-Up berhaupt so gro wurde, da bin ich sicher.\n\nSeit ihr nach dem Gamestop-Debakel aber nicht damit aufgehrt habt, weiterhin TR zu empfehlen bin ich berzeugt davon, dass ihr nicht lernfhig seid. :-) Ihr bekommt von TR gerade einfach nur das, was ihr verdient. Ihr seid selbst Schuld.",
            "Ja, knnten die ganzen TR-Themen bitte in einen Extrasub ausgelagert werden? Zum Beispiel r/Handelsrepublik",
            "Frher hat man sich bei der Nachbarschaft ausgeheult. Heute gibt es das Internet",
            "Das Beste an diesem Post ist, dass der einzig sinnvolle Effekt den er haben knnte nicht eintritt, weil niemand eine Alternative anbietet.",
            "Finde es immer lustig darber zu lesen. ^^ wei schon weshalb ich von solchen Dingen die Finger lasse."
        ]
    },
    "Ein kleiner Rant gegen Girokarten und warum ich fast nur mit Kreditkarte bezahle": {
        "title": "Ein kleiner Rant gegen Girokarten und warum ich fast nur mit Kreditkarte bezahle",
        "score": 39,
        "url": "https://www.reddit.com/r/Finanzen/comments/1dr8v9g/ein_kleiner_rant_gegen_girokarten_und_warum_ich/",
        "content": "- Was ist eure Meinung zu dem Thema? \n- Womit bezahlt ihr im Alltag am liebsten und warum?\n\nIch zahle wenn möglich nur mit Kreditkarte(n), da ich für mich folgende Vorteile sehe. Einiges trifft ggf. auch auf andere Zahlungsmethoden zu, aber vereint eben nicht alle:\n- Es ist erstmal nicht mein Geld in die Transaktion mit ggf. unbekanntem Dritten involviert.\n- Ein dritter Kann Geld auf der Karte blockieren und hat Sicherheit. Gleichzeitig ist es nicht mein Geld was da blockiert ist.\n- Es gibt eine Ebene zwischen mir und dem dritten der die Macht hat Fehler/Betrug zu korrigieren an die ich mich wenden kann.\n- Ich bekomme sofort Feedback auf meinem Smartphone unmittelbar nachdem die Karte oder Smartphone das Terminal verlassen hat.\n- Ich kann den Status jeder Transaktion genau sehen (hat der Händler das Geld tatsächlich schon gebucht, wie ist der Echtzeit Umrechnungskurs, ist das Geld nur blockiert auf der Karte, wurde etwas erstattet).\n- Eine saubere Monatsabrechnung am Ende ermöglicht guten Überblick über die monatlichen Kosten \n- Häufig bessere Konditionen in Sachen Bargeldabhebung und Zahlungsbedingungen im Ausland.\n- Ggf. weitere Guddis wie Kickback Zahlungen oder gratis Versicherungen\n\nNatürlich gibt es auch Nachteile. Die reichen von, dass nicht jeder eine Kreditkarte haben kann, nicht unbedingt jeder mit Kreditrahmen gut umgehen kann und die Zahlungen für Händler ggf. teurer sind.\n\nNatürlich wird in Deutschland nicht überall Kreditkarte akzeptiert. Dann steige ich notgedrungen auf MasterCard Debitkarte, Girokarte und wenn das auch nicht geht auf Bargeld um.\n\n\nStory time zur Girocard und warum das System mMn überarbeitet werden muss:\nWenn dagegen bei einer Debitkarte etwas schief geht habe ich das Problem, denn mein Geld ist weg. Immerhin kann ich bei einer Visa oder MasterCard Debit noch mit denen reden und ggf. eine Rückbuchung veranlassen. \n\nBei Girocard hast man komplett verloren. Wenn da etwas falsch abgebucht wird musst du mit den Unterlagen zur Polizei und Anzeige erstatten, da die Hoheit der Buchung bei der anfordernden Bank liegt. Diese ist dafür zuständig das alles korrekt abläuft bei der Zahlung im Girosystem. Eine Gegenprüfung auf der Seite der auszahlenden Bank gibt es nicht. Eine Möglichkeit oder Prozess bei Fehlern gibt es nicht. Warum auch immer die Banken in Deutschland das Girosystem so entwickelt haben... Das gegenseitige Vertrauen muss ja immens gewesen sein damals.\n\nIn meinem Fall war es 2021 eine Eisdiele mit Sparkassen Lesegerät. Die haben die Zahlung erstmal erst nach 4 Wochen getätigt. Eine generierte Zahlungsid + token im Girosystem muss innerhalb von 2 Wochen eingelöst werden ansonsten verfällt diese eigentlich zu Lasten des Gläubigers. Und dann nach einem halben Jahr einfach mit exakt den gleichen Daten und der gleichen ID nochmal abgebucht als ich nachweislich mit Stempel im Pass im Ausland war. Im weiteren Verfahren stellt sich heraus, dass ich nicht der einzige betroffene war. Da es sich um eine Eisdiele handelte waren die meisten Beträge zu klein, als dass Leute sich gewundert hätten. Auch bei mir waren es nur 17,80€. Der gesamte Schaden den die Eisdiele mutwillig durch Doppelbuchungen verursacht hat sind im mittleren 5-stelligen Bereich gewesen. Und die Eisdiele konnte das alles machen weil jede Provinzsparkasse Lesegeräte rausgeben kann, Transaktionen nicht prüft bevor sie im Girosystem eingezogen werden und das System keinen Prozess für ausgeführte Fehler vorsieht.",
        "num_comments": 51,
        "comments": [
            "Schn dass ich nicht der einzige mit dieser Meinung bin. Dennoch in Deutschland ziemlich sicher die unpopulre Minderheit, denn Bargeld habe ich in der Hand und niemand kann es zurckverfolgen oder hnliche Argumente.\nWenigstens hat Corona den positiven Nebeneffekt gehabt, dass selbst Bckereien inzwischen oft Kreditkarten akzeptieren",
            "Bezahle alles mit der TR Debit Karte weil 1% saveback + das geld liegt in der Zwischenzeit mit 4% zinsen rum.",
            "Und dann stehst du im Museum oder Bibliothek und stellst fest, das die nur Giro und Bargeld akzeptieren... Yeay",
            "Ich stelle mal die (wahrscheinlich unwissende) Gegenseite auf:\n\nIch habe keine Kreditkarte und habe auch noch nie eine gebraucht. Die Debitcard funktioniert in Deutschland plus Europa berall wo Kartenzahlung mglich ist, ich hatte noch nie Probleme mit falsch abgebuchten Zahlungen und wenn ich einen berblick ber meine Ausgaben haben mchte, gucke ich halt auf mein Konto :D",
            "Sehe ich genau wie du, OP. Ich nehme wo es nur geht Kreditkarten.\n\nSie sind fr mich die logische Abstraktionsschicht, die mich im Alltag komplett unabhngig von der Hausbank macht. Kommt mir die DKB dumm: Egal, wechseln - neues Referenzkonto in die Amex und Barclays, fertig.",
            "Hab die Giro nur noch fr die Hand voll Lden die die TR Karte nicht nehmen. Die kann ich leider auch nicht bei Google wallet hinterlegen.",
            ">Bei Girocard hast man komplett verloren. Wenn da etwas falsch abgebucht wird musst du mit den Unterlagen zur Polizei und Anzeige erstatten, da die Hoheit der Buchung bei der anfordernden Bank liegt.\n\nDas ist falsch. Im Fall eines nicht autorisierten Zahlungsvorgangs muss der Buchungsbetrag zurck erstattet werden. Das ist im  675u BGB geregelt und der unterscheidet nicht nach dem Scheme. Dafr reicht es, der Bank das anzuzeigen, und der Betrag muss dann bis zum nchsten Tag erstattet sein.",
            "Ich habe genau deine Meinung. Nutze eine Kreditkarte fr Lebensmittel, Essen gehen und Konsumkufe. So kann ich alles nachvollziehen. IdR rechne ich dann mit  1.500,- an Ausgaben zum Ende des Monats. Somit hab ich immer Anfang des Monats all meine Zahlungsverpflichtungen weg und ab dem 4. eines jeden Monats packe ich den gesamten berschuss vom den Einnahmen auf die Sparrate obendrauf ins Depot oder hebel irgendeinen Quatsch, den ich hier sehe.",
            "Nutze auch ausschlielich meine Amex Platinum. Backup ist ne Barclays Visa",
            "LPT: Nach Aufzhlungen mit - Text immer eine komplette Leerzeile, erhht die Lesbarkeit ungemein."
        ]
    },
    "Bundesfinanzhof: Verlustverrechnung nicht mit Grundgesetz vereinbar": {
        "title": "Bundesfinanzhof: Verlustverrechnung nicht mit Grundgesetz vereinbar",
        "score": 32,
        "url": "https://www.reddit.com/r/Finanzen/comments/1dr8sjr/bundesfinanzhof_verlustverrechnung_nicht_mit/",
        "content": "\"Bei der im Aussetzungsverfahren nach § 69 Abs. 3 der Finanzgerichtsordnung gebotenen summarischen Prüfung ist die Verlustverrechnungsbeschränkung für Termingeschäfte gemäß § 20 Abs. 6 Satz 5 i.d.F. des Jahressteuergesetzes 2020 vom 21.12.2020 (BGBl I 2020, 3096) nicht mit Art. 3 Abs. 1 des Grundgesetzes vereinbar.“\n\n\nQuelle:\nhttps://www.bundesfinanzhof.de/de/entscheidung/entscheidungen-online/detail/STRE202410113/\n\nHier zuerst gelesen:\nhttps://finanzmarktwelt.de/verlustverrechnungsbeschraenkung-fuer-termingeschaefte-verfassungswidrig-314538/",
        "num_comments": 5,
        "comments": [
            "Absolut erwartbar. Kann mir keiner erzhlen das man nicht schon bei Verabschiedung damit gerechnet hat. Das war doch rein fr die Whler",
            "Hut ab vor den Anklgern ",
            "War abzusehen, wird denke ich bald auch fr die Aktien kommen",
            "Ist fr Aktien bereits eine Instanz hher, liegt seit 2021 beim Bundesverfassungsgericht und die gehen da nicht ran.\n\nQuelle: Hab ich die Tage irgendwo in einem Artikel erwhnt gesehen, keine Garantie, fragt Google.",
            ""
        ]
    }
}