{
    "Join our growing /r/FinancialCareers Discord server!": {
        "title": "Join our growing /r/FinancialCareers Discord server!",
        "score": 303,
        "url": "https://www.reddit.com/r/FinancialCareers/comments/eg62vy/join_our_growing_rfinancialcareers_discord_server/",
        "content": "**EDIT: Discord link has been fixed!**\n\nWe are looking to add new members to our /r/FinancialCareers Discord server!\n\n##[> Join here! - Discord link](https://discord.gg/NAwT4GBnWB)\n\nOur professionals here are looking to network and support each other as we all go through our career journey. We have full-time professionals from IB, PE, HF, Prop trading, Corporate Banking, Corp Dev, FP&A, and more. There are also students who are returning full-time Analysts after receiving return offers, as well as veterans who have transitioned into finance/banking after their military service.\n\nBoth undergraduates and graduate students are also more than welcome to join to prepare for internship/full-time recruiting. We can help you navigate through the recruiting process and answer any questions that you may have.\n\n~~As of right now, to ensure the server caters to full-time career discussions, we cannot accept any high school students (though this may be changed in the future).~~ We are now once again accepting current high school students.\n\nAs a Discord member, you can request free resume reviews/advice from people in the industry, and our professionals can conduct mock interviews to prepare you for a role. In addition, active (and friendly) members are provided access to a resource vault that contains more than 15 interview study guides for IB and other FO roles, and other useful financial-related content is posted to the server on a regular basis.\n\nSome Benefits\n\n* Mock interviews\n* Resume feedback\n* Job postings\n* LinkedIn group for selected members\n* Vault for interview guides for selected members\n* Meet ups for networking\n* Recruiting support group\n* Potential referrals at work for open positions and internships for selected members\n\nNot from the US? That's ok, we have members spanning regions across Europe, Singapore, India, and Australia.\n\n##[> Join here! - Discord link](https://discord.gg/NAwT4GBnWB)\n\n\nWhen you join the server, please read through the rules, announcements, and properly set your region/role. You may not have access to most of the server until you select an appropriate region/role for yourself.\n\nWe now have nearly 6,000 members as of January 2022!",
        "num_comments": 87,
        "comments": [
            "Man I feel like shit in this group everyone is low 20's making 100k plus a year, I'm 24 just finishing my contract with the army an wanting to get into a financial career",
            "\\*More than 700 members ;p",
            "When i try to generate my role-assignment, when i click \"Latin America\" or my title appears \"Missing Perimissions\" and i can't generate my role-assignment.",
            "What finance jobs require very little accounting knowledge besides the basics? Working as a Financial analyst right now and its basically glorified accounting. Not what I studied or enjoy, I hate accounting. I studied finance, should I look for valuation?",
            "Having issues with the invite, is anyone able to send me another link to try",
            "Hi, if you need any financial assistance hit me up",
            "Hey guys Im in college right now and looking to get into the financial world, what majors/minors would you recommend? Im currently going for economics but thinking about switching to finance. Thanks In advance!",
            "Could we have an \"Investment Banking - Restructuring\" flair pls",
            "for real estate, lodging groups, will the buyside exists be heavily focused on real estate? how often is it deals where one very large asset manager sells to another very large asset manager?",
            "Intro message saying I have no access?"
        ]
    },
    "2024 Compensation Megathread": {
        "title": "2024 Compensation Megathread",
        "score": 63,
        "url": "https://www.reddit.com/r/FinancialCareers/comments/1bhfygj/2024_compensation_megathread/",
        "content": "New year, new salaries, new jobs. Got a new job offer, internship, or want to share your current salary details with the community? Post it below! Or say hello to others who are introducing their line of work here.\n\nIf you're new to the community, don't forget to assign yourself a user flair to highlight if you're a student or in what field of finance you have experience. ([How do I get user flair?](https://support.reddithelp.com/hc/en-us/articles/205242695-How-do-I-get-user-flair))\n\nAs a reminder, please respect people's privacy and personal information. Avoid unsolicited DMs--we recommend having discussions in the community so everyone can benefit from reading and weigh in.\n\nUse the below post template as a starting point, but feel free to add more information/context if you think it would be helpful!\n\nPost Template:\n\n* Age / Gender\n* State / Country (if outside of US)\n* Job Title or Specialization\n* Years of Experience\n* Salary / Bonus / Total Compensation\n\nLooking for post examples or want to browse through older posts? [Previous salary megathread here.](https://www.reddit.com/r/FinancialCareers/comments/11ai92b/2023_compensation_megathread/)\n\n[FY2023 Bonus Thread here](https://www.reddit.com/r/FinancialCareers/comments/18nxjwx/2023_bonus_megathread/?sort=new)",
        "num_comments": 190,
        "comments": [
            "It's always insightful to hear about others' compensation experiences, especially as we navigate through different stages of our careers. Looking forward to seeing the variety of responses and learning from everyone's insights!",
            "How do you get into that field ?",
            "Damn, I'm a VP on buyside and not even close to that... How did you find that position?",
            "What did you do before jumping to buyside",
            "how are your hours and stress levels?",
            "Thats me this summer too! Cant wait till that turns into 80k after full-time offer ",
            "How did you get into corporate banking?",
            "What is your average deal size?",
            "seeing that you are very experienced. I would like to know how to get started?",
            "Mind if I shoot you a PM about energy?"
        ]
    },
    "Teller (24k) -> IR in PE in 8 years (~350k) AMA": {
        "title": "Teller (24k) -> IR in PE in 8 years (~350k) AMA",
        "score": 230,
        "url": "https://www.reddit.com/r/FinancialCareers/comments/1dqobrl/teller_24k_ir_in_pe_in_8_years_350k_ama/",
        "content": "Doing this because I see a ton of people here stressed about either their first job out of school, their career and earnings potential going forward, and a whole load of other stuff. \n\nI'm here to tell you to take a deep breath. You're just in the first inning. You also don't have to be in IB, ER, Consulting to make a shit load of money (all power to you if you love that stuff, I don't). \n\nI graduated from non-target, < 2 GPA. Took 5 years to finish a 3-yr degree. HCOL\n\nGot extremely lucky along the way, made a ton of mistakes, worked really dam hard, and got lucky again. But I do believe you can't get lucky if you don't put yourself in that situation.\n\nContext for luck: I met some incredible people along the way... Bosses, mentors, friends, who played a big part in helping me develop in to a professional and put myself in a situation for the next step. \n\nI don't mean luck in the sense that I got handouts. \n\nPls note that my bread and butter has always been sales. While I'm a CFA charterholder, I've never been in banking or research. I do have friends and colleagues who are on that side so will try my best to answer questions relating to that but I am no expert. \n\nFire away and if uncomfortable to ask on thread, dm me. ",
        "num_comments": 127,
        "comments": [
            "Do you think it'd be a good idea to email a managing director at a big bank?",
            "Curious how you characterized your front office investment work to get them to grant you a charter.",
            "I am so glad I saw this post and your career growth is very inspiring. I am currently working as teller at a bank in Ireland. I have been wanting to get into investments for a good few years now but I am not able to break in, yet. I come from a physics background and I did an MBA from a non-target which was probably not the best idea. I am currently planning to do M.Sc finance from a target school to improve my visibility and I am working on improving my skills and network. Ive been getting lot of opinions that the masters is not a good idea and that I should try and network and get into an investment role first. I wanted to know what would you do different if you were back in your teller job and the end goal is the same.",
            "I think this is a very good example that the CFA is not useless like a lot of people pretend it is on this sub. If you went to a non-target school, the CFA is a huge boost.",
            "Wow impressive, you trusted the process! Much love from a junior IR team member trying to learn something new everyday",
            "Holy shit if PE IR pays 350 I need to look at leaving my pub co IR role.",
            "How? If you had to do it again could you? How can I \"get lucky\"?",
            "How did you find IR, in terms of mental stimulation, security and development? Thanks.",
            "How did you get out of the teller role ? Currently where I am and looking to progress. Have a degree in business finance",
            "Please outline the way great person."
        ]
    },
    "Looking investment analyst roles in asset management/buy-side firm. What do y'all think?": {
        "title": "Looking investment analyst roles in asset management/buy-side firm. What do y'all think?",
        "score": 15,
        "url": "https://i.redd.it/wwefr8826g9d1.png",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Your last relevant experience is basically 4 years ago. The issue is you have the education but no work experience to back it. The certs and CFA are good and all, but they arent work experience. So theyll have to comp you for masters level qualifications but you dont actually possess the work skill set yet. Youre also international which is another issue. Companies dont want to deal w international people and pay for them. I think youre a tough sell.",
            "Been networking very aggressively for the last 3 months. At least 1 networking event every week, sometimes as many as 4. Been to all CFA society happy hours/networking events in the north east. Got a few leads. Senior members promise the moon but eventually ghost on email. International student here. Don't know what else to do",
            "Are you doing both CFA L3 and CAIA L1 at the same time? You know, after L3 you can skip CAIA L1",
            "You hit the nail on its head. I often curse myself not doing actual real work during the summers. I was too naive and had the impression that cfa may compensate. I'm tapping into the school's alumni network and just meeting people at networking events",
            "Yes exactly! Just turned 27 and with this background, I feel pretty useless. There are so many other competitive candidates",
            "I just need someone to take a bet on me. Just one chance to prove myself",
            "That's only when you get the cfa charter. I won't qualify for the charter at least for the next 3 years",
            "Ah makes sense. Good luck on both",
            "Bro i got zero business giving advice and there is zero point in dwelling on the past but you decided to get not one, but two masters and not one but both from non target schools and again, not one, but two, two year programs???\n\nYour problem now is youve been in school for 9 years with basically no work experience. Your private lending internship was 4-5 years ago. \n\nThe CFA and all of that is impressive but i feel like you should have spend your summers getting internships instead of studying for the CFA. At some point work experience trumps education.\n\nYou need to see if any of your professors know previous students or just have connections at local firms to help you get your foot in the door and start working.",
            "\"Area of expertise\" change to \"skill\" and put at the bottom and change to - xxx: xxx, xxx, xxx, xxx format\n\nCFA should put in education, you should already know that. \n\nWhat department you work in uni? put this after title, i.e., student worker - xxx department. If it is not quantitative or finance related just remove it"
        ]
    },
    "Figured this would be of interest": {
        "title": "Figured this would be of interest",
        "score": 214,
        "url": "https://i.redd.it/bllle1u1eb9d1.jpeg",
        "content": "To all 2021 and 2022 grads,\n\nI wish I were you.\n\n-2023 grad",
        "num_comments": 31,
        "comments": [
            "I graduated in 2012 so the markets were still getting their shit together from the housing crisis.  Im here to say, itll work out for you.  Keep working hard and be open to opportunities.  Some things you cant control, like labor markets and when you were born.",
            "That tracks, I left my UW job to go into Risk in 2022, I interviewed with 4 banks over 3 months and doubled my salary. Now my current employer doesnt have anything open other than associate work and internships lol",
            "Remember that many are horseshit ghost jobs. So indeed it was the stable low inflation and cheap money that allowed this. Higher inflation rates push down demand for financial services in general.",
            "Thats funny the FRED tracks this lol",
            "I cant be the only one thinking that more and more employers are looking for people with __ years of experience instead of junior positions right? Or was this always a thing (genuine question)",
            "Graduated in 2020 and looking for a new job for the last 6 months. This hurts.",
            "How do I short this",
            "I cant believe this is tracked on FRED",
            "Problem now is everyone and their mother is in finance",
            "Whats the difference between UW and Risk? Arent they the same thing? I work as an UW but Im a recent grad so excuse my ignorance."
        ]
    }
}