{
    "There's a difference between tough love and disguised-hate (false) tough love - be sure you're posting the first type or better.": {
        "title": "There's a difference between tough love and disguised-hate (false) tough love - be sure you're posting the first type or better.",
        "score": 110,
        "url": "https://www.reddit.com/r/findapath/comments/1biklrk/theres_a_difference_between_tough_love_and/",
        "content": "I've removed a lot of trolls and a lot of posts that were not constructive or helpful and I've realized some people still haven't quiiiiiite gotten with the new rules yet - which of course is fine because the rules are generic on purpose. So this is about the concept of tough love....and the clear difference between the two.\n\n**\"Disguised Hate/False Tough Love\"**\n\nExample that came directly from someone here:  \n\"Stop trying to get random people online to feel bad for you. Study harder, go to the gym, go for a walk, put your phone down, learn a new skill. Get some help man. Your life is pathetic because you’re letting it be. Grow some fucking balls and improve your life and get your degree. Good things come to those who go out and earn it. Your attitude is not attractive.\"\n\n**\"Tough Love\"** (acceptable to this group so you won't be flagged for being a dick or offering nonconstructive advice)\n\n\"From what it sounds like, you're creating your own issue here, my man. It's like you are intending to take yourself down and do it in the most self-destructive way possible. For example, you are letting your grades slip because you're sad about your girlfriend. These two things are mutually exclusive, you do not need to let this happen but you are letting it because it's easy to justify. You are also stopping going to the gym...why? You can be sad about your girlfriend sure, but you don't NEED to stop doing the other things that are beneficial to your health and future! Take a long, hard look at your behaviors and start recognizing where you're letting yourself spiral.\"\n\nWhen you are posting in this group, note your feelings. Are you feeling hot-headed anger towards the original poster for wasting an opportunity you would have loved, or being an age where you were doing better than them at that age, or angry at the original poster for thinking something wrong? **Check. Your. Anger. First. Don't post while fuming.** Your anger is not a welcome guest in this sub! Come back when you're cooled down and more level headed, and use the opportunity to note you may have some inner work yourself!\n\nTL:DR: False Tough Love = Judgement. It's insult, not insight. \n\nAs long as your posts are constructive, positive, actionable, you are fine!",
        "num_comments": 12,
        "comments": [
            "it's been a long, looooong time since i saw so much emotional intelligence in a post. extremely good job mod / OP, the world would be a better place if people followed this advice on the daily!",
            "Thank you for this. Tough love is about saying some hard truths that are constructive. Hurling insults at someone doesn't help them. So many bring their preconceived prejudices to the table. They assume that an OP is coming from a place of laziness and wanting to be handed something.",
            "This is the best post ever posted on Reddit. Well done. If only Reddit was created on the basis of this kindness, and not hateful trolldom. I just told someone that I refuse to ask for advice on Reddit anymore, due to the toxic responses. But youre making me consider potentially posting in this subreddit. Well see.",
            "Alright, lemme break this down real quick. Theres a thin line between tough love and straight-up hate, guys. Like, if youre gonna give advice, make sure its coming from a good place, not just a rage-fueled rant. Weve all seen those comments that sound like theyre just itching for a fight.\n\nTake a chill pill before you hit that comment button, alright? Nobody wants your angry vibes here. Lets keep it constructive, positive, and actually helpful. If you need to cool off, take a breather and come back when youre not seeing red anymore. Were all in this together, folks!",
            "I love this! So many \"experienced/vets\" seem to be extremely negative and dooming over people looking for advice and I find that disturbing. CHANGE is INEVITABLE-nothing stays the same or remains. Encouraging others should never pose a threat to ones standing or \"power\", it only reflects the authenticity of ones gifts and success.",
            "While I'm never angry and the 'tough love' is what I truly believe is the truth...\n\nI'll try to be a little bit more subtle : ) \n\nAs I definitely give advice in this blunt approach.\n\nonwards.",
            "This!",
            "Hello and welcome to r/findapath! We are glad you found your way here. Please know that you are not alone. We are here to listen, to offer support, and to help guide you. While no one can make decisions for you, we are here to help you find a path; we believe that everyone has the power to heal and grow.\n\nThe moderation team wants to remind everyone that individuals submitting posts may be in depressive and vulnerable situations and all are in need of guidance. Please provide a safe and constructive space by practicing empathy and understanding in your comments; your words should come from a helpful and guiding mentality, never a judgement or anger mentality. You are encouraged to share your good thoughts, feelings, and relevant experiences to assist those seeking guidance on the subreddit.\n\nWe are here to support each other and we believe that, together, we can make a difference.\n\nThank you for being a part of our community.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/findapath) if you have any questions or concerns.*",
            "\n\nglad you took the time to type out this post!\n\nChiming in here because ive had a tough but productive year in terms of learning this lesson\n\nI learned that tough love comes from a place of support. your words are intended to help someone grow rather than offering words that supplement your identity so you can feel better about yourself . \n\nI've had to learn how to pay attention to those who offer tough love from a genuine helpful place vs those who offer \" tough love\" so they can validate their own internal shortcomings. \n\nSometimes the tough love stings a bit but that's where I have to work on balancing my ego. When I listen to feedback with an open mind, I can differentiate between someone coaching me through one of my blindspots vs someone tearing me down in a subtle way.\n\nAlways good for me to be aware as well! When I give people feedback then I too need to be mindful of where it's coming from.",
            "Hello and welcome to r/findapath! We are glad you found your way here. Please know that you are not alone. We are here to listen, to offer support, and to help guide you. While no one can make decisions for you, we are here to help you find a path; we believe that everyone has the power to heal and grow.\n\nThe moderation teams want to remind everyone that individuals submitting posts may be in vulnerable situations and all are in need of guidance. Please provide a safe and constructive space by practicing empathy and understanding in your comments; criticism is welcomed with the right words. You are encouraged to share your thoughts, feelings, and relevant experiences to assist those seeking guidance on the subreddit.\n\nWe are here to support each other and we believe that, together, we can make a difference.\n\nThank you for being a part of our community.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/findapath) if you have any questions or concerns.*"
        ]
    },
    "Suicide posts....": {
        "title": "Suicide posts....",
        "score": 31,
        "url": "https://www.reddit.com/r/findapath/comments/1cwwnod/suicide_posts/",
        "content": "First I just need to say thank you for all the reports on the many, MANY suicide posts that have come through lately. I've had so many \"2: Someone is considering suicide or serious self-harm\" reports come through my feed in the last few days/week.\n\nI want you to know exactly what happens when I get those reports....and you're not going to like this. Please read every word of this LONG post! *TL:DR at the bottom.*\n\nI ignore them. As in press the Ignore button.\n\n**WHY?**\n\nTwo reasons. 1. People are hurting here and I've allowed those posts because this group has always been open to anyone with any issue within the \"finding a path\" idea. 2. I'm not a therapist nor a superhero. I cannot go fly in to save them from their own mental health, swoosh their life to better, and leave them feeling all the sunshine and rainbows!\n\nHowever, if the post is definitely an \"announcing my suicide with no wish to find a path out of it\"....I report the name to Reddit to step in, as there is a new partnership with the Crisis Hotline. Do I do this with every single post that mentions suicide at the end but otherwise states their issues and wants help out of it in some way? Nope. They are allowed to be that low. Without being reported to the Crisis Hotline for it.\n\nThere's nothing else I can do for the person professionally. There's nothing more WE can do more for them. We're here to help people find a path, or even a way out of their pain, and as long as we are leaving supportive, helpful, kind, and actionable comments....*that's all we can do.* We are nothing more than pointers, we are not therapists or situation-changers for people, but what we are doing is decently life-changing for an online forum and hopefully a bit of life-saving.\n\nSome people are simply too low to help and our job can only be to point them to the extreme therapy they need, via resources and links if possible.\n\n**These posts are depressing though!**  \nYes, they are, and I too can only handle so much of them. After clearing the feed, I basically can do 2 posts of helping/actionable comments a day!\n\nAnd the easy path is me just making a rule that says a nasty quip like \"this isn't an airport, you don't need to announce your suicide\" and set Automoderator to remove all posts that say the words we no longer want to hear. Removing all the not fully serious ones too, because I can't code Automod with AI ability. Cementing to people that they are not welcome and should go through with the act, convincing people that they can't even get help when they reach out as a last ditch attempt.\n\nIs that who we are? Should we truly go that way?  \nShould we niche down (bubble) to become exactly like r/careerchange?  \nCast out those in the most need, because we don't like seeing the negativity?\n\nIf they can't come to this group for hope....then where should they go?\n\nYour ideas on this are very welcome.\n\n**Your mental health is important too.**\n\nIf you contribute a lot to this group, you are completely allowed to burn out, especially if you give in this group a lot (and I love you for it!) You are absolutely welcome to take a break. There's a lot of people in need, and I'm hoping with tweaks to this group (and an upcoming plan I'm working on behind the scenes), we can offer even more actionable support, without feeling drained at the end of the day.\n\nThat said, I am open to ideas about select, little known helpful resources and how to position them in this group for best effect. Group Wiki? Does anyone actually read those? I'm only allowed 2 pinned posts at any one time so I'm not sure that's the best thing to use. I'm open to a new Rule that is actually just a link but what the link would go to, how to organize such a resource list....etc.\n\n**To sum up (and TL:DR)**  \nThat report to me has been somewhat useless in this group (except for the new Crisis Hotline partnership Reddit has, and yes the extreme ones I definitely send over to them!) I'd like people to only report to us when it's a more extreme \"suicide announcement\". Those who are on the lighter side, more just lost in the weeds, please use your energy to give them ideas and paths out instead. Community involvement welcome on what I'm saying (read the whole thing first then). I get the posts are tough, take care of your mental health and don't give more than you have per day. Open to resource-positioning ideas.\n\n**Update:** If I see a person who seems to be posting nothing but extreme suicidal posts, I will invoke the same 3 strikes rule we have with comments/shitposts - an automatic removal and ban, as 3 posts of the same type indicates an obvious attention/sympathy grab and no real wish for help or finding a path out. Definitely agree with y'all that finding a path should be the intent of a post (but I will never make it a rule of the group that a clear, direct request for a path is required in any post). Comments should always remain helpful or supportive to the idea that the poster can find a path even in their darkest hours.   \nThank you for helping me clarify what should be done - I might run 3 reddit groups now but I never want to assume I know what's best for any group without the group's participation. ",
        "num_comments": 27,
        "comments": [
            "Why not just direct these people to r/suicidewatch?Theyarebettersuitedtodealwiththat.It's agreatrisklettingthesepostshere.",
            "Ive lost count of how many reddit cares Ive been sent at this point ",
            "I've used suicide care resources or what people refer you to when you're suicidal online. From my experience and what I've read online, a lot of people find these resources useless. They're still good to have and help some people, but i think normal reddit comments are just as good or better in many cases.\n\nJust mark the posts as containing suicidal content so people can avoid them if they don't want to engage with them.",
            "It's reddit. What do you expect",
            "Couldnt agree more, dude. Same. I always report those too. So inappropriate. Even though Im a mental health professional, posting this suicide bs on social media is",
            "In other words, too much social media intake?",
            "Did you notice any other commonalities? For example, was it mostly those who dont know what to do, or dont know what next step to take?",
            "I think that sub is just turning into a sad pro suicide subreddit where people see it as a last solution to their problems.",
            "I've had it weaponized against me when someone didn't like my opinion.",
            "This post gave me a few whifs of ideas, though your post I'm not fully understanding your ideas....but at least some of the whiffs may lead into cool things for the \"in the background plan\" that I can't talk about yet."
        ]
    },
    "Lost Everything. What Now? (33M)": {
        "title": "Lost Everything. What Now? (33M)",
        "score": 17,
        "url": "https://www.reddit.com/r/findapath/comments/1dr6qys/lost_everything_what_now_33m/",
        "content": "I had a beautiful gf, 2 dogs, decent paying job, and a home. I lost everything but 1 of the dogs in the last 7 months and am no where close to recovering. I am now at a lost at what to do next, and don't feel a drive to succeed anymore because I feel like it's pointless. Look where all of that work and sacrifice got me...\n\nFor context I lived with my girlfriend of 5 years for 4 years. She had a dog when we met and shortly after we moved in together we got another one. I was unhappy with my job which then impacted my home life negatively. She had enough, and made the decision to leave. She was the love of my life, and I blame myself for everything. So of course I then fell into a massive depression. My mind was elsewhere at work and I ended up getting fired due to poor performance 5 months ago (Senior Project Manager). I am now living with my Dad, $10,000 in debt, and have been unable to get a job interview anywhere in tech. It feels hopeless.\n\nI honestly have no idea how I am going to get out of this situation. For the first time in my life I have zero ambition, and no purpose. Frankly it's terrifying, and I see no way out. I can't even find a minimum wage job that gives more than 30 hours/wk in my area. Hell I don't even want to work as a PM anymore anyway, because the stress caused by that role destroyed my last relationship.",
        "num_comments": 11,
        "comments": [
            "what job would you rather do?",
            "Thanks, I think this is pretty solid advice. I appreciate it. I have a friend who says that it may seem hopeless now, but it's important to keep moving even if you don't want to. Something about staying active will naturally respark that ambition I once had. I hope so.",
            "Thanks! I will definitely give counselling a shot again.",
            "UI/UX Design. I've always been good at it, but I have a Computer Science degree. Seems like I get \"type casted\" based on my degree and experience in tech despite my portfolio. I pirated photoshop when I was 7, and did designs at my last job as needed. I only did Computer Science because at the time I wanted to do Game Development.",
            "Oh mate. I feel for you. I was in a similar situation in my early 30s. Stuck in a job I never wanted to do and hated and it affected everything else. Ended up having a total crisis and walking out on everything. Lost everything and went back to square one. Went from living in a lush flat / apartment that I had to myself to sharing a house with 4 strangers because it was all I could afford. \nHeres the good news - it was the best thing that ever happened to me. \nI always wanted to be a chef but never thought I could. Didnt even think it was an option for someone like me with a good degree and a city boy life style. But I had nothing to lose, so I got a job as a junior in a kitchen. Chopping onions, cleaning up etc. that was 8 years ago. Im now a head chef at a super high end restaurant. Im back on good pay, have my own place again and Im about to marry the love of my life. Ive never been happier or more content. \nI wont say it was easy. It took a lot of work and sacrifice, but it was worth it. This is your chance to start completely fresh and pursue something you actually want to do with your life. Were only on this world once and for a short while - it would be a shame to waste that time doing something that makes you unhappy. Find something you really want to do, even if it means starting at the bottom, and do that. Once youve found something meaningful and fulfilling to focus on everything else will follow.",
            "I know what you mean with the crappy job.\nIf you're having a crisis I recommend you take some time, do cheap online courses for a while in what you want, and In you cv and future interviews you can sell it the other way round (personal issues, needed some time due to breakup, took the time to take courses etc).\n\nIt's a point of inflection in your life, long term the break can really make a difference, not if debt is 30k or 38k.\n\nEven if your not sporty, I recommend doing some exercise daily (like swimming, or gym), it has a lot of positive benefits for your mood.\n\nThen later I'd say to do your best to try to get into the line of work you want, even if its a paycut.\n\nWhen a bit better start online dating, even though might not be like your ex.. will help you recover psycologically. (In spanish the saying is: only a nail can take out another nail...)",
            "You definitely had a really rough time. Perhaps you could have sought counselling after your relationship hit the wall and depression settled in. Might even had been able to get a leave from work while you weathered that storm.\n\nBut, in fact, you had a successful life except you were miserable in your work. When that domino fell, they all came down. So you can begin again but this time with the self-knowledge of how important the right job is to you.\n\nSeek counselling from your doctor or a community counsellor and start taking small steps towards the job you want - even if its volunteering or taking a course or workshop to tip your resume toward the career you want. Since you are depressed, small steps are best - including slowly building up exercise! It can make such a bad g difference.\n\nFor now, sympathies! Sorry you went through this!",
            "Hi, I am a UI/UXer who was working a very well known company that everyone dreams of getting into but quit a few months back because of the intense stress and burn out that came with it. Grass is always greener on the other side, I guess. Corporates suck any remaining creativity you have in you. At the moment UI/UX is extremely saturated and with the rate at which AI tools are advancing the career opportunities in this domain is expected to decline drastically. Not trying to discourage you but I wanted to share a realistic perspective as someone who has worked in this domain for many years.   \nI'd say it would be best to look at roles like data analysts, cyber security etc which has more scope in the future. Not as creative but trust me, gone are the days when UI/UX folks get to use their creativity. UI/UX teams are at the mercy of marketing managers and developers who do not even understand design but quick to give feedback on it.",
            "I'm sorry you had to go through such pain. I went through something similar to what you described at your job (also in tech) and at the end it shattered me, destroyed my health, and burned me out. Perhaps you have burnout as well due to the intense stress you had to endure. \n\nBe compassionate with yourself and give yourself time. I know you're struggling, but try to do more of the things that you still enjoy. Focusing on anything that brings you joy will gradually give you more life and heal you hopefully. Maybe try volunteering or doing anything that can lift your spirit. Please know that your feelings and struggles are valid. I know how hard it feels to be in this situation because I'm struggling with this as well. Hopefully it will pass and you will find a good place in life again.\n\nWishing you the best of luck.",
            "I appreciate the feedback!\n\nI think I was mostly done with being the one accountable for everyone's work, and working 60-80 hour weeks w/ virtually unusable PTO. I was with my company for 7 years and not once was I able to take more than 2 days off without having to work. I was essentially doing multiple jobs (QA, Dev Ops, Code Reviews, etc.) UI design is just one of those things I can do for long hours without getting burnt out regardless of how interesting it may or may not be. I just want to make stuff at the end of the day. Can't say I feel the same way about data analytics, and other IT sectors. At this point I'm leaning towards starting my own design agency out of necessity until I land a job.\n\nRegarding marketing managers... I had a client who had a senior marketing manager that refused to follow ADA compliance that lead to a multimillion dollar lawsuit - good times."
        ]
    },
    "I’m so tired": {
        "title": "I’m so tired",
        "score": 8,
        "url": "https://www.reddit.com/r/findapath/comments/1dr7424/im_so_tired/",
        "content": "What is the point in all this anguish? I get nothing out of anything. I’m sick of the “oh, you need to find something you enjoy and it’s not about the money, you’ll feel better later” I’m not here for any of that. I play drums, but that’s about the only thing I sometimes enjoy. I don’t  know what to do, nor do I want to do anything. I keep seeing everyone around me do things like go to college, get in relationships, etc. I’m not one of those people. I have a good home and good family but I know it won’t last forever and I need to go and do something but I just don’t want to. The only course of action I can think of is death. I just don’t care, I thought this was a place to put this.",
        "num_comments": 13,
        "comments": [
            "relatable. for me i feel like even if i feel like doing something there's always a block to it that i can't solve so there's no point to me just being here observing others living while i can't do much of anything at all.",
            "Take a trip and find perspective. That advice given to you could be right or it could be wrong but try to focus on the smaller details of life. Leave your phone behind, take a walk and clear your mind.",
            "People often underestimate the value they will feel from having a job (any job) and their own place, that is, not living with their family.  When you're an adult living in the family you grew up with you feel like you have no life.  Once you are out of the house and paying your own way, even if you're working a minimum wage job and living with three roommates, you find that within the constraints of your salary and schedule you can make your own decisions about your activities and what you do with your time.  It's worth asking yourself why you get nothing out of anything--that's not a feature of life, it's a feature of your situation, whatever it is.  Change your situation, and you change the feeling.  And in this society, it is about the money.  Doesn't have to be a lot of money, but in order to be in charge of your own life, you have to have a source of income that belongs to you.",
            "I hate receiving advice because Im not gonna follow it and it just makes me feel worse and more pissed off and sad. I dont know how Id carry out my plan, but Id like to find a way.",
            "Please message me if you want to talk",
            "Think about all the horrible news stories about adult children (often way adult, like 40s or 50s) who murder their parents whom they live with, or who kill themselves.  That says something about how toxic it is to live like that.  Just leave.",
            "Yeah, I dont know how to get past that. I view it as an inconvenience that theyd be upset about it. Im\nJust here because of a moral obligation, thats it.",
            "Because then I'd be doing things to make them happy, not myself.",
            "You came here for a reason. You state you hate advice but you reached out. So many of us are feeling lost or uninspired these days. You love to play drums, what would be your ultimate drum goal? To play with a celebrity, be in your own band? Come up with something and work towards it. Maybe you could teach a kid drums. Sometimes looking outside yourself is the best solution.",
            "I dont know quite how to end it conveniently. My family would be upset and yada yada, so Im just here due to a moral obligation. Id rather just have an easy way out and not have to worry about being mourned. I could be an absolute dick to everyone but I dont have it in me to do that. Im just stuck."
        ]
    },
    "Cant seem to find a way no matter what I do (32M)": {
        "title": "Cant seem to find a way no matter what I do (32M)",
        "score": 4,
        "url": "https://www.reddit.com/r/findapath/comments/1drai36/cant_seem_to_find_a_way_no_matter_what_i_do_32m/",
        "content": "**Okay so first thing is first this post is going to be a bit negative and I have no intention of bringing anyone down with me, nor am I a troll just looking for attention. I have to say this as I have been accused of trolling, lying and just seeking attention before, but I can assure that is not the case. Also one last thing DO NOT tell me go seek help for mental health as in the UK that system of care is broken and to be perfectly honest my negative outlook is a perfectly normal response to a shitty life/work situation.**\n\nAny how now to get to my points. I am 32 from UK  been in continuous employment since I was 18, never any gaps in my work history nor have I ever been layed off, fired or dismissed from a job ever. I graduated school at 16 but unfortunately never passed any of my gcse exams, tried college attained a very basic level 1 IT qualification, basically the whole course was basically a tutorial on microsoft office, very menial stuff that even someone with an IQ of 60 could probably learn and pass. \n\nMy work life started out in a small bakery when I was 18 which I was there for 18 months then found a job in a supermarket which I was with that company for 10 years, now im working in catering, been there for 2 and a half years. Okay so of course many people would think its easy for someone like me to get a job anywhere as long as its simply the same or similar roles but in my experience this hasn't been the case and the reason mostly is down to me being assigned to the menial tasks/jobs that none of the other colleagues want to do or have to do but it seems perfectly fine for me to get stuck in and do the nitty gritty jobs.\n\nOkay so at this point in my post I know I am going to get the usual reddit responses of condescension telling me its my attitude thats holding me back, yada yada but I know for a fact these responses are coming from 2 types of people\n\n**1. Much younger naive people who haven't had much work/life experience and haven't had to start out in an inferior job role**\n\n**2. Snobs who think they know it all because a couple of people they know/knew started out at the bottom and now making a lot more money therefore its the same for everyone**\n\nThe problem there is it's not actually the same for everyone and the advice comes from a place of superiority and condescension. Unfortunately for some people we get treated way different and it comes down to a couple of things and sometimes these things work hand in hand together, a lot of the time its because you dont have the qualifications and experience and sometimes its your physical appearance, sometimes all three go hand in hand and in my case thats the problem why I have always been utterly screwed.\n\nOkay so by now the people who have read this are only naturally going to respond with an eye roll and say I have an attitude problem hence my inability to move on but the problem is I have always been treated as an inferior. My current job at the moment is very fucking tough as it's like they are trying to force me out and Im being unfairly treated. I have remained as the guy who just does all the shit jobs nobody else wants to do, there have been 4 new colleagues who have come in the past year and started off working with me but have now been moved onto different departments where as I am still stuck clearing up the trash.\n\nRight so I should try re-educate myself shouldn't I? I mean its not such a bad idea but what would be the point now in re-educating/training in something when I wont have the experience to transition into a new job/career. Attitude change too? thats actually not the problem as I have/had colleagues who are the most shitty people around and treat people badly but still manage to get on. My problem is im very placid and look/sound physically weak and downtrodden but this is just a normal reaction to a shitty life.\n\nConclusion - I AM UTTERLY SCREWED. It seems to be like some people are typecasted into specific job roles and theres no way out. Work in customer service? Okay thats you for the rest of your working life. Work as a stocker in a supermarket? Okay thats you for the rest of your working life. Its literally impossible to move on as nobody hires anyone without experience. I hear people on reddit job related subs share success stories about how they have job hopped and transitioned careers several times in their lives but it's all 100% fabrication. Im done, the only thing I will ever be suitable for is menial unskilled tasks as people judge at face value and my physical appearance isn't anything that helps in this whole be conventional or just slowly rot bullshit.\n\nRANT OVER.\n\n  \n",
        "num_comments": 1,
        "comments": [
            "Hello and welcome to r/findapath! We are glad you found your way here. Please know that you are not alone. We are here to listen, to offer support, and to help guide you. While no one can make decisions for you, we are here to help you find a path; we believe that everyone has the power to heal and grow.\n\nThe moderation team wants to remind everyone that individuals submitting posts may be in depressive and vulnerable situations and all are in need of guidance. Please provide a safe and constructive space by practicing empathy and understanding in your comments; your words should come from a helpful and guiding mentality, never a judgement or anger mentality. You are encouraged to share your good thoughts, feelings, and relevant experiences to assist those seeking guidance on the subreddit.\n\nWe are here to support each other and we believe that, together, we can make a difference.\n\nThank you for being a part of our community.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/findapath) if you have any questions or concerns.*"
        ]
    }
}