{
    "[Mod Announcement] The Ongoing Update of the Main Directory": {
        "title": "[Mod Announcement] The Ongoing Update of the Main Directory",
        "score": 27,
        "url": "https://www.reddit.com/r/findareddit/comments/195bysw/mod_announcement_the_ongoing_update_of_the_main/",
        "content": "Hello everyone!\n\nAs you may have noticed, you can find the [**Main Directory**](https://www.reddit.com/r/findareddit/wiki/directory/) here on r/findareddit which is an **exhausting list of subreddits divided into categories** based on their main theme, purpose, name, etc. It does not include every existing subreddit. The goal is to list as many categories as possible and to make things easier for users who are searching for a proper subreddit.\n\nThe Main Directory used to be maintained by a very helpful bot which is however no longer in service since June 2023. Its loss made us rethink the style and content of the Directory. As a result, I have been **gradually updating** each category and creating new categories, in order to make them **more helpful for users**. About half of existing categories have been updated so far. Some of them are **so excessive that they are linked on a separate page** (or linked on another subreddit if they already exist elsewhere). It's a very slow process, as you can imagine.\n\nThis is where users like you can help us. **If you have any suggestions** for a new category, a subreddit which should be added somewhere, etc., feel free to let us know here in the comments. Please keep in mind that **active subreddits are preferred**. A subreddit where people post from time to time and never receive a single upvote or comment is **not** an active subreddit. Every potential subreddit is carefully reviewed before being added to the Main Directory. The purpose of the Directory is to make searching easier for users, not to promote subreddits. Please use r/promotereddit, r/Promoteareddit and r/newreddits for that.\n\nJust a few notes for the end. The Main Directory is not and will never be the list of all existing subreddits. That is simply not possible. Another thing is that since we no longer have the bot, **the numbers of members for each listed subreddit are not updated**. We do not have resources to keep up with often rapid growths of all listed subreddits, but we decided to include the numbers to make the search easier for users.\n\nThank you and have a good day / night.",
        "num_comments": 55,
        "comments": [
            "Hey u/SmallRoot - I should have left all of this with y’all when I left, but I still have all of the python files that ran the directory. I’m not a programmer and I had someone help me build those way back then (like 2016) but I’d be happy to try and put it back together and make the directory auto-update again, if you’re down!",
            "Hi,\n\nYesterday I created a reddit (/eMclient). eMclient is a third party email app that has been and a while and has recently added a mobile app.  I see a need for users to share information, tips and tricks, troubleshooting, asking for help, new feature ideas, etc.  I am trying to figure out how to promote my new sub and also what types of community topics would be best.",
            "I love a directory, I maintain one covering all of the health and social care services across the UK for my work. With some discussion, I would enjoy helping with this if you still need this. A streamlined way this could work if the WIKI or right here allows it, is to use the directory as a knowledge base for a trained GPT model and then embed the GPT into here/ wiki which will then automate the responses and allow you to find everything easily? I'm pretty sure there's a developer nearby who might feel inclined to help the community if this is a possibility?",
            "I should have probably read first haha!",
            "Thank you for your hard work in updating the Main Directory! It's great to see such dedication to improving user experience on r/findareddit. I appreciate the transparency and effort in making the directory more user-friendly and informative. Keep up the fantastic work!",
            "can you make me a trusted member so i can post",
            "How do I post a picture/image on reddit?",
            "Hey u/smallroot Life advice questions on favorite things",
            "Hi, I recently created r/politebuns as a home for the classiest buns on the internet, and I would like to request that it be added to the list if that’s possible, thanks for your time!\n\nAnd thanks for creating this extremely user friendly list!",
            "Looking for a subreddit for followers of Court TV"
        ]
    },
    "Recommendation for horror subreddit ?? ": {
        "title": "Recommendation for horror subreddit ?? ",
        "score": 2,
        "url": "https://www.reddit.com/r/findareddit/comments/1drbag4/recommendation_for_horror_subreddit/",
        "content": "Basically need a subreddit that post horror content like horror story (fiction/non-fiction both) and horror movie scenes etc ... Thanks for help in advanced.",
        "num_comments": 1,
        "comments": [
            "Hello! Here are some often-requested subreddits for different types of suggestions and recommendations. If one of these subreddits is what you needed, please reply to this comment with \"thanks!\"\n\n* /r/IfYouLikeBlank (*a general recommendation subreddit. Post things you like and people will try to help you find similar things*)\n* /r/SuggestMeABook, /r/BookSuggestions and /r/BooksThatFeelLikeThis (*for books*)\n* /r/GamingSuggestions (*for video games*)\n* /r/MusicSuggestions, /r/MusicRecommendations and /r/MusicMatch (*for music*)\n* /r/MovieSuggestions and /r/TelevisionSuggestions (*for movies and TV shows respectively*)\n* /r/AnimeSuggest (*for anime*)\n* /r/BuyItForLife and /r/GoodValue (*for products*)\n\nIf none of these subreddits are what you are looking for, don't worry - our users will give you suggestions. :)\n\nThanks! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/findareddit) if you have any questions or concerns.*"
        ]
    },
    "Is there a sub about how to start working out? ": {
        "title": "Is there a sub about how to start working out? ",
        "score": 2,
        "url": "https://www.reddit.com/r/findareddit/comments/1dr9w2u/is_there_a_sub_about_how_to_start_working_out/",
        "content": "Not in a extreme gym bro kind of way, just home workout. \n",
        "num_comments": 1,
        "comments": [
            "/r/fitness\n\nRead the sticky, read the wiki (it's linked in the sticky), look for related communities in the sidebar."
        ]
    },
    "What’s a sub where people post those alpha/sigma wolf memes ": {
        "title": "What’s a sub where people post those alpha/sigma wolf memes ",
        "score": 1,
        "url": "https://www.reddit.com/r/findareddit/comments/1dredfd/whats_a_sub_where_people_post_those_alphasigma/",
        "content": "Can’t post an example here but if you’ve seen one you know what I mean \n",
        "num_comments": 0,
        "comments": []
    },
    "Is there a sub where I can get advice on outfits?": {
        "title": "Is there a sub where I can get advice on outfits?",
        "score": 2,
        "url": "https://www.reddit.com/r/findareddit/comments/1dr9p8p/is_there_a_sub_where_i_can_get_advice_on_outfits/",
        "content": "Apparently I'm horrible at shopping for clothes that look good on me, and I definitely need to update my wardrobe. Is there anywhere I can get opinions or help with outfits? Like what would look good on me specifically, or if a certain outfit makes sense for my body type. Thanks so much!",
        "num_comments": 1,
        "comments": [
            "There’s r/outfits"
        ]
    }
}