{
    "There's a difference between tough love and disguised-hate (false) tough love - be sure you're posting the first type or better.": {
        "title": "There's a difference between tough love and disguised-hate (false) tough love - be sure you're posting the first type or better.",
        "score": 111,
        "url": "https://www.reddit.com/r/findapath/comments/1biklrk/theres_a_difference_between_tough_love_and/",
        "content": "I've removed a lot of trolls and a lot of posts that were not constructive or helpful and I've realized some people still haven't quiiiiiite gotten with the new rules yet - which of course is fine because the rules are generic on purpose. So this is about the concept of tough love....and the clear difference between the two.\n\n**\"Disguised Hate/False Tough Love\"**\n\nExample that came directly from someone here:  \n\"Stop trying to get random people online to feel bad for you. Study harder, go to the gym, go for a walk, put your phone down, learn a new skill. Get some help man. Your life is pathetic because you’re letting it be. Grow some fucking balls and improve your life and get your degree. Good things come to those who go out and earn it. Your attitude is not attractive.\"\n\n**\"Tough Love\"** (acceptable to this group so you won't be flagged for being a dick or offering nonconstructive advice)\n\n\"From what it sounds like, you're creating your own issue here, my man. It's like you are intending to take yourself down and do it in the most self-destructive way possible. For example, you are letting your grades slip because you're sad about your girlfriend. These two things are mutually exclusive, you do not need to let this happen but you are letting it because it's easy to justify. You are also stopping going to the gym...why? You can be sad about your girlfriend sure, but you don't NEED to stop doing the other things that are beneficial to your health and future! Take a long, hard look at your behaviors and start recognizing where you're letting yourself spiral.\"\n\nWhen you are posting in this group, note your feelings. Are you feeling hot-headed anger towards the original poster for wasting an opportunity you would have loved, or being an age where you were doing better than them at that age, or angry at the original poster for thinking something wrong? **Check. Your. Anger. First. Don't post while fuming.** Your anger is not a welcome guest in this sub! Come back when you're cooled down and more level headed, and use the opportunity to note you may have some inner work yourself!\n\nTL:DR: False Tough Love = Judgement. It's insult, not insight. \n\nAs long as your posts are constructive, positive, actionable, you are fine!",
        "num_comments": 12,
        "comments": [
            "Hello and welcome to r/findapath! We are glad you found your way here. Please know that you are not alone. We are here to listen, to offer support, and to help guide you. While no one can make decisions for you, we are here to help you find a path; we believe that everyone has the power to heal and grow.\n\nThe moderation team wants to remind everyone that individuals submitting posts may be in depressive and vulnerable situations and all are in need of guidance. Please provide a safe and constructive space by practicing empathy and understanding in your comments; your words should come from a helpful and guiding mentality, never a judgement or anger mentality. You are encouraged to share your good thoughts, feelings, and relevant experiences to assist those seeking guidance on the subreddit.\n\nWe are here to support each other and we believe that, together, we can make a difference.\n\nThank you for being a part of our community.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/findapath) if you have any questions or concerns.*",
            "it's been a long, looooong time since i saw so much emotional intelligence in a post. extremely good job mod / OP, the world would be a better place if people followed this advice on the daily!",
            "Thank you for this. Tough love is about saying some hard truths that are constructive. Hurling insults at someone doesn't help them. So many bring their preconceived prejudices to the table. They assume that an OP is coming from a place of laziness and wanting to be handed something.",
            "This is the best post ever posted on Reddit. Well done. If only Reddit was created on the basis of this kindness, and not hateful trolldom. I just told someone that I refuse to ask for advice on Reddit anymore, due to the toxic responses. But you’re making me consider potentially posting in this subreddit. We’ll see.",
            "Alright, lemme break this down real quick. There’s a thin line between tough love and straight-up hate, guys. Like, if you’re gonna give advice, make sure it’s coming from a good place, not just a rage-fueled rant. We’ve all seen those comments that sound like they’re just itching for a fight.\n\nTake a chill pill before you hit that comment button, alright? Nobody wants your angry vibes here. Let’s keep it constructive, positive, and actually helpful. If you need to cool off, take a breather and come back when you’re not seeing red anymore. We’re all in this together, folks!",
            "While I'm never angry and the 'tough love' is what I truly believe is the truth...\n\nI'll try to be a little bit more subtle : ) \n\nAs I definitely give advice in this blunt approach.\n\nonwards.",
            "\n\nglad you took the time to type out this post!\n\nChiming in here because ive had a tough but productive year in terms of learning this lesson\n\nI learned that tough love comes from a place of support. your words are intended to help someone grow rather than offering words that supplement your identity so you can feel better about yourself . \n\nI've had to learn how to pay attention to those who offer tough love from a genuine helpful place vs those who offer \" tough love\" so they can validate their own internal shortcomings. \n\nSometimes the tough love stings a bit but that's where I have to work on balancing my ego. When I listen to feedback with an open mind, I can differentiate between someone coaching me through one of my blindspots vs someone tearing me down in a subtle way.\n\nAlways good for me to be aware as well! When I give people feedback then I too need to be mindful of where it's coming from.",
            "Hello and welcome to r/findapath! We are glad you found your way here. Please know that you are not alone. We are here to listen, to offer support, and to help guide you. While no one can make decisions for you, we are here to help you find a path; we believe that everyone has the power to heal and grow.\n\nThe moderation teams want to remind everyone that individuals submitting posts may be in vulnerable situations and all are in need of guidance. Please provide a safe and constructive space by practicing empathy and understanding in your comments; criticism is welcomed with the right words. You are encouraged to share your thoughts, feelings, and relevant experiences to assist those seeking guidance on the subreddit.\n\nWe are here to support each other and we believe that, together, we can make a difference.\n\nThank you for being a part of our community.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/findapath) if you have any questions or concerns.*",
            "I love this! So many \"experienced/vets\" seem to be extremely negative and dooming over people looking for advice and I find that disturbing. CHANGE is INEVITABLE-nothing stays the same or remains. Encouraging others should never pose a threat to ones standing or \"power\", it only reflects the authenticity of ones gifts and success.",
            "This!"
        ]
    },
    "Suicide posts....": {
        "title": "Suicide posts....",
        "score": 31,
        "url": "https://www.reddit.com/r/findapath/comments/1cwwnod/suicide_posts/",
        "content": "First I just need to say thank you for all the reports on the many, MANY suicide posts that have come through lately. I've had so many \"2: Someone is considering suicide or serious self-harm\" reports come through my feed in the last few days/week.\n\nI want you to know exactly what happens when I get those reports....and you're not going to like this. Please read every word of this LONG post! *TL:DR at the bottom.*\n\nI ignore them. As in press the Ignore button.\n\n**WHY?**\n\nTwo reasons. 1. People are hurting here and I've allowed those posts because this group has always been open to anyone with any issue within the \"finding a path\" idea. 2. I'm not a therapist nor a superhero. I cannot go fly in to save them from their own mental health, swoosh their life to better, and leave them feeling all the sunshine and rainbows!\n\nHowever, if the post is definitely an \"announcing my suicide with no wish to find a path out of it\"....I report the name to Reddit to step in, as there is a new partnership with the Crisis Hotline. Do I do this with every single post that mentions suicide at the end but otherwise states their issues and wants help out of it in some way? Nope. They are allowed to be that low. Without being reported to the Crisis Hotline for it.\n\nThere's nothing else I can do for the person professionally. There's nothing more WE can do more for them. We're here to help people find a path, or even a way out of their pain, and as long as we are leaving supportive, helpful, kind, and actionable comments....*that's all we can do.* We are nothing more than pointers, we are not therapists or situation-changers for people, but what we are doing is decently life-changing for an online forum and hopefully a bit of life-saving.\n\nSome people are simply too low to help and our job can only be to point them to the extreme therapy they need, via resources and links if possible.\n\n**These posts are depressing though!**  \nYes, they are, and I too can only handle so much of them. After clearing the feed, I basically can do 2 posts of helping/actionable comments a day!\n\nAnd the easy path is me just making a rule that says a nasty quip like \"this isn't an airport, you don't need to announce your suicide\" and set Automoderator to remove all posts that say the words we no longer want to hear. Removing all the not fully serious ones too, because I can't code Automod with AI ability. Cementing to people that they are not welcome and should go through with the act, convincing people that they can't even get help when they reach out as a last ditch attempt.\n\nIs that who we are? Should we truly go that way?  \nShould we niche down (bubble) to become exactly like r/careerchange?  \nCast out those in the most need, because we don't like seeing the negativity?\n\nIf they can't come to this group for hope....then where should they go?\n\nYour ideas on this are very welcome.\n\n**Your mental health is important too.**\n\nIf you contribute a lot to this group, you are completely allowed to burn out, especially if you give in this group a lot (and I love you for it!) You are absolutely welcome to take a break. There's a lot of people in need, and I'm hoping with tweaks to this group (and an upcoming plan I'm working on behind the scenes), we can offer even more actionable support, without feeling drained at the end of the day.\n\nThat said, I am open to ideas about select, little known helpful resources and how to position them in this group for best effect. Group Wiki? Does anyone actually read those? I'm only allowed 2 pinned posts at any one time so I'm not sure that's the best thing to use. I'm open to a new Rule that is actually just a link but what the link would go to, how to organize such a resource list....etc.\n\n**To sum up (and TL:DR)**  \nThat report to me has been somewhat useless in this group (except for the new Crisis Hotline partnership Reddit has, and yes the extreme ones I definitely send over to them!) I'd like people to only report to us when it's a more extreme \"suicide announcement\". Those who are on the lighter side, more just lost in the weeds, please use your energy to give them ideas and paths out instead. Community involvement welcome on what I'm saying (read the whole thing first then). I get the posts are tough, take care of your mental health and don't give more than you have per day. Open to resource-positioning ideas.\n\n**Update:** If I see a person who seems to be posting nothing but extreme suicidal posts, I will invoke the same 3 strikes rule we have with comments/shitposts - an automatic removal and ban, as 3 posts of the same type indicates an obvious attention/sympathy grab and no real wish for help or finding a path out. Definitely agree with y'all that finding a path should be the intent of a post (but I will never make it a rule of the group that a clear, direct request for a path is required in any post). Comments should always remain helpful or supportive to the idea that the poster can find a path even in their darkest hours.   \nThank you for helping me clarify what should be done - I might run 3 reddit groups now but I never want to assume I know what's best for any group without the group's participation. ",
        "num_comments": 27,
        "comments": [
            "I too was alarmed and really started kind of collecting them to see what the commonality was.\n\nReally, and this is horrible, it’s just trendy. That’s tough, I know. And it delegitimizes true cries for mental health help.\n\nI think “I’ll kill myself” is thrown around so much it means nothing. In that vein I agree with the course of action you have adopted.\n\nThe truth is generations lately are overwhelmed with online “success perception” and when they realize they won’t attain that hopelessness sets in.\n\nIt’s like it’s all they know success to be. \n\nMan, there are so many variations on success and very few of them truly have to do with money or careers.",
            "Why not just direct these people to r/suicidewatch? They are better suited to deal with that. It's a great risk letting these posts here.",
            "I’ve lost count of how many reddit cares I’ve been sent at this point 🤣",
            "Maybe someone can build on this idea. From personal experience the only thing that helped me was finding something to focus on... Maybe the links and redirects could be to a compiled list of things to get involved in that can help someone to feel like they matter, like they're needed and they're making a difference... I believe there's an opportunity to set a new standard for the way we approach mental health... If there was a way to set aside certain jobs when they arise for this, instead of sending out the opening to our friends like we normally do simply pass the info on to a email repository (is that how it works? ) or something like that to make it easy, and that email data could be governed by ai, it would just categorize the info accordingly, it could be anything , \"help wanted\" \"tutor roles\" it could be a wide range of things, simply just opportunities  that have the potential to build self worth, all in one place... , like we come up with a criteria and pin the rules for what qualifies as one of these self help roles, then just have a forum that keep the opportunitys on a list with different categories etc etc. it would likely need to be an invite only type forum cause I'm sure It would start off slow..\n\nI was winging my way through most of this....but i think it could really be a great idea, it needs a lot of work, as far as hammering out the details... But... I think this could be something... \n\nThoughts?\n\n(Edit: added a couple afterthoughts and new typos)",
            "I've used suicide care resources or what people refer you to when you're suicidal online. From my experience and what I've read online, a lot of people find these resources useless. They're still good to have and help some people, but i think normal reddit comments are just as good or better in many cases.\n\nJust mark the posts as containing suicidal content so people can avoid them if they don't want to engage with them.",
            "This is the second place I comment most (I used to tutor/mentor college students if they were unsure what they wanted to do), and I've noticed two things: the active commenting/upvoting community is split almost 50/50 by people who, like me, want to help/give advice and people who are just negative and say their life sucks without wanting to change and they just push their negativity on comments/posts.\n\nThere are also people who are probably mostly lurkers who are just lost about what to do in life, but they aren't negative about it, they just want to learn. Occasionally they post, but its completely outclassed by the number of negative posts from the people you're talking about. While its important to have help around those problems, this sub ain't the place for that. \n\nI don't have specific recommendation, just wanted to throw in my views.",
            "Wow, that's heavy. I get where you're coming from. It's tough to balance supporting folks in dark places while also keeping the vibe positive. Maybe a pinned post with resources could help? And yeah, mental health first for sure. Burnout's real. Take breaks, y'all. We're in this together.",
            "It's reddit. What do you expect",
            "Hello and welcome to r/findapath! We are glad you found your way here. Please know that you are not alone. We are here to listen, to offer support, and to help guide you. While no one can make decisions for you, we are here to help you find a path; we believe that everyone has the power to heal and grow.\n\nThe moderation team wants to remind everyone that individuals submitting posts may be in down and vulnerable situations and all are in need of guidance. Please provide a safe and constructive space by practicing empathy and understanding in your comments; your words should come from a helpful and guiding mentality, never a judgement or anger mentality. You are encouraged to share your good thoughts, feelings, and relevant experiences to assist those seeking guidance on the subreddit.\n\nWe are here to support each other and we believe that, together, we can make a difference.\n\nThank you for being a part of our community.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/findapath) if you have any questions or concerns.*",
            "Opinion: they tend to help nobody (including the person making the post) and I think they're potentially harmful in normalizing the sentiment. I don't think they need to be reported, but I do think there needs to be a filter or a way to hide these. Also, the people who tend to make these posts don't seem to want help or to \"find a path,\" they want to rant/wallow, which I feel like should be taken elsewhere.\n\nFor some, it's super annoying to see someone in a similar position as them (or sometimes in a better position) being super negative and talking about how much it sucks and that they want to die... I've encountered this multiple times and it's DEPRESSING and it's worse for other people.\n\nIt *should* be a requirement to be at least a bit productive. If they can't, they should go to a different subreddit to wallow all they want. The name of this subreddit is \"find a path\" unless you're saying that name doesn't mean anything."
        ]
    },
    "Probably going to off myself after I graduate": {
        "title": "Probably going to off myself after I graduate",
        "score": 96,
        "url": "https://www.reddit.com/r/findapath/comments/1dqoqpg/probably_going_to_off_myself_after_i_graduate/",
        "content": "I'm a rising senior in college. My major is useless, I've never had an internship, and I have basically no job prospects. I'm worthless and doomed. \n\nMoving home after college is my worst nightmare. I cannot stand living with my family. I would much rather die. \n\nI basically, have three options: move home and probably kms after a few months to a year, graduate and stay in the city my school is in and be jobless and homeless, or immediately kms after graduation.\n\nI'm picking the third option. If I can't find employment by the time I graduate next year, I'm going to just end it.\n\nEdit: I don't have insurance. Please stop suggesting therapy. ",
        "num_comments": 86,
        "comments": [
            "Hello and welcome to r/findapath! We are glad you found your way here. Please know that you are not alone. We are here to listen, to offer support, and to help guide you. While no one can make decisions for you, we are here to help you find a path; we believe that everyone has the power to heal and grow.\n\nThe moderation team wants to remind everyone that individuals submitting posts may be in depressive and vulnerable situations and all are in need of guidance. Please provide a safe and constructive space by practicing empathy and understanding in your comments; your words should come from a helpful and guiding mentality, never a judgement or anger mentality. You are encouraged to share your good thoughts, feelings, and relevant experiences to assist those seeking guidance on the subreddit.\n\nWe are here to support each other and we believe that, together, we can make a difference.\n\nThank you for being a part of our community.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/findapath) if you have any questions or concerns.*",
            "Get a job that helps you survive while you figure everything out, like server/waiter? You dont have to kill yourself just cause you dont have the job you dream (yet) and your major Im pretty sure is not useless 100%, just try to take care of yourself while everything becomes clear to you, try to not take any rushed decisions and moving back with your family is not the end of the world (I dont k ow your situation thou). Hang in there",
            "People starting out are objectively in the worst position they have ever been in for our country. \n\nI don't blame you for looking around and not liking what you see, I'm 28 and still trying to come to terms with the fact that I'll be forced to be a slave until I die. With the only hope of creating meaningful change being to violently overthrow the government. \n\nJust remember that your life belongs to you, no matter what laws exist or what responsibilities you have. You are the one that gets to control if you live or die, you're nobody's property.\n\nThe reason I still stick around is because there probably isn't anything else, once we're dead we never get to experience anything ever again, so I might as well stick it out and see what happens. If it ever gets so bad I can't take it I always have the option to die.",
            "Career consultant hwre. No degree is worthless. I see people with so-called worthless degrees all the time, they get employed pretty immediately, within 3 months. \n\nThe problem is simply one of not understanding resumes and your skillset nor how to use it to leverage yourself up! Thats it. Learning some resume writing is helpful a bit with that. See if you can take a small course on it at your college.",
            "Join military\n\nIf you are brave enough to kill yourself, you are brave enough to be massively successful in the military.\n\nGet the useful skill from the military and combine it with your college degree, and be successful. As a Army / Air Force Vet, I highly recommend Air Force. Many useful skills could be under your belt depends on your career field.\n\nWish the best.",
            "I used to want to kms in university. Looking back, my problem wasn’t depression but the alluring confidence depression gave me in my ability to predict my “terrible future”. Your worth is not defined by your ability to achieve, it is programmed into you at birth. Being alive IS being worth it, that’s how life works. \n\nYou don’t mention any option that satisfies your constraints, which seem to be: don’t move home. Consider options that satisfy this constraint before succumbing to the weight of the constraint itself. Buy a plane ticket to a country you’ve never been to and figure it out when you get there. Move to a low cost of living city after graduation and find a service job. Check out free work exchange programs like WWOOF that let you see the world in exchange for your time, not your money.\n\nEvery moment of your life is an opportunity to choose a path you are excited about. Depression tries its best to hide all of the options, but they’re there. I promise.\n\nEDIT: OP, you say you’re in California, move to a liberal city in the Midwest. I’m Californian born and raised and did 2 years in Kansas City; it was a fucking blast. You have options.",
            "I feel the same bro. Graduating next year with a management degree and hate my managerial position. I feel directionless and lost. I can’t stand being home anymore. I love my parents but fuck man I need to leave. Sometimes I feel like ending it but I think about my loved ones and what could’ve been my future. Thinking about the military if I can’t find a better job I like after graduation. Really rethink about ending it. I don’t know you but I feel you. Had a friend attempt suicide but survived he is doing better and is on his road to becoming an officer later trying to join SWAT. I wish you the best man. Salutations from Texas.",
            "I have always thought about KMS, but the twist is I have everything I need. 2 cars a house a gaming room. All sorts of neat stuff. Feel empty or..unsure of what I should do? It's hard to explain. Regardless I'm going to when it's my time. I'm very close to my mother and brother and my father when he was still here. But it's my life I live for myself. I know most would try and stop you. I'm NOT saying do it. Life is very confusing tho and hard. Thank you for being so open I admire that. Think about it before acting tho. \nI will always think about you now tho. \nI love you. I hope you find a pain free life or a pain free death.\n\nA quote tho. \"Those who seek death, find life. Those who seek life, meet death\"",
            "[removed]",
            "Is there a counseling center at your school?"
        ]
    },
    "How to find a \"Spark\" in life?": {
        "title": "How to find a \"Spark\" in life?",
        "score": 12,
        "url": "https://www.reddit.com/r/findapath/comments/1dr2h2q/how_to_find_a_spark_in_life/",
        "content": "I had an unpleasant life most of my life. Grew up in a poor home, depressed and obese. Told I was stupid and believed it. At 25 I was working minimum wage and hated everything.\n\nThe past 5 years everything has changed. I went to school, got my dream job, became financially literate and with some luck in stocks (thanks Nvidia) am fairly financially secure. (Not buying a sports car any time soon, but I don't need to worry about rent or groceries). I've been on a path to take back my health and lost 130ibs, workout 4 days a week. Have braces at 30 leading to jaw surgery which I knew I needed at 14 but couldn't afford. I go to therapy every other week.\n\nBy all accounts life should be good. I should be happy. But I'm not? I keep trying new things, I've joined clubs, go to city meetups, taking different classes. But nothing interests me? I feel like I have no spark, or joy for life.\n\nI feel like I was almost happier playing video games 12 hours a day doing nothing else. But now when I go to play a game I get bored in like 30mins.\n\nI've spoken about this with my Therapist, they seem to think I should stay the course and something will catch my eye eventually. Some hobby will stick, or group will stick.\n\nI haven't been dating persay, I'm open to it. But I just haven't met anyone I even want to date recently. \n\nI just don't know what to do. I don't know how to find my passion in anything. I just feel numb. I'm going through the motions I'm on a  good path; but I still feel nothing. I can't remember the last time I laughed until I cried. I can't remember the last time I was excited about something upcoming. I can't remember the last time I felt genuine joy or happiness.\n\nI wonder what happened. What is missing. \n\nIs there some piece of the puzzle im missing? Is there something wrong with me? Has anyone else gone through this? How did you find your zest for life?",
        "num_comments": 4,
        "comments": [
            "Hello and welcome to r/findapath! We are glad you found your way here. Please know that you are not alone. We are here to listen, to offer support, and to help guide you. While no one can make decisions for you, we are here to help you find a path; we believe that everyone has the power to heal and grow.\n\nThe moderation team wants to remind everyone that individuals submitting posts may be in depressive and vulnerable situations and all are in need of guidance. Please provide a safe and constructive space by practicing empathy and understanding in your comments; your words should come from a helpful and guiding mentality, never a judgement or anger mentality. You are encouraged to share your good thoughts, feelings, and relevant experiences to assist those seeking guidance on the subreddit.\n\nWe are here to support each other and we believe that, together, we can make a difference.\n\nThank you for being a part of our community.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/findapath) if you have any questions or concerns.*",
            "Agreed with your therapist! Keep going and something will catch your eye. I’m 36f, and I only discovered this year that I’m a raver lol I know a little late bloomer over here, but after having kids, I kinda lost myself. I have social anxiety and tend to overthink. Did a lot of therapy to work on that but I’m never one for big crowds. Little do I know, after being dragged to a huge rave this year, I found my spark. The community, the vibe, the freedom to be yourself, social anxiety who?! Anyway, all I’m saying is to keep trying new things, I’m almost 40 and I just found mine!\n\nAlso I learned this on sm which helps me when life gets “dull”. I love travelling, so even if it’s just mini road trip or 1-2 big trips a year, I try to plan ahead as much as possible. Having those little milestones in my calendar gives me a bit of joy every time I come across it. It’s so that I always have something to look forward to. \n\nHope this helps. Also congrats on all your amazing accomplishments!! It’s so inspiring to hear you do a complete 180 with your life. You have definitely inspired me to get back on that proverbial treadmill and focus on my health again. So thank you!",
            "I think a lot of people put too much pressure on themselves to be happy or find joy, which can be blissful and euphoric but also very unexpected and short lived. The older I get, the more I think it is more about creating the space for a general range of contentment. From there, exploring what sparks your curiosity? Exploring what sparks your sense of awe and wonder about the world?\n\nBtw you’re obviously a great communicator and bright. Maybe it’s time for your life to be about more than just… you? I know I wouldn’t have a sense of purpose and I would feel pretty empty inside if I didn’t want to contribute to my community and mentor.",
            "Is it possible that you are experiencing mild depression? Exercise can sometimes get the seratonin in the brain working again so that you can feel emotions instead of being flat affect. Also try something new!"
        ]
    },
    "I went from getting my company almost acquired for 10 million to now cant even finding a job - feeling like a failure ": {
        "title": "I went from getting my company almost acquired for 10 million to now cant even finding a job - feeling like a failure ",
        "score": 13,
        "url": "https://www.reddit.com/r/findapath/comments/1dqzf37/i_went_from_getting_my_company_almost_acquired/",
        "content": "I was on track last year to exit my company for 10 million, the deal fell through , my business partner quit, now I’m starting over again for the 10th time in my life and I’m tired and getting old (I’m almost 40) \n\nI said ok if I could find a job land on my feet for a bit I could stabilize and rebuild , I’ve sent out over 500 resumes , zero call backs, I keep pushing forward and getting kicked in the balls\n\nIm getting tired of people not living in integrity, I feel lost \n\nI’ve got a ton of skills, ton of life experiences, but I can’t even make a dollar these days it’s like Im useless and have no path ",
        "num_comments": 12,
        "comments": [
            "Hello and welcome to r/findapath! We are glad you found your way here. Please know that you are not alone. We are here to listen, to offer support, and to help guide you. While no one can make decisions for you, we are here to help you find a path; we believe that everyone has the power to heal and grow.\n\nThe moderation team wants to remind everyone that individuals submitting posts may be in depressive and vulnerable situations and all are in need of guidance. Please provide a safe and constructive space by practicing empathy and understanding in your comments; your words should come from a helpful and guiding mentality, never a judgement or anger mentality. You are encouraged to share your good thoughts, feelings, and relevant experiences to assist those seeking guidance on the subreddit.\n\nWe are here to support each other and we believe that, together, we can make a difference.\n\nThank you for being a part of our community.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/findapath) if you have any questions or concerns.*",
            "Industry?",
            "There’s no question here and hence there’s no answers. Recruitment is a fickle game. 500 resumes is meaningless without feedback. Why do you think you’re getting knocked back? \n\nI often worry myself that working for yourself makes you unemployable, like a dog that has bitten a human and can’t be saved. Is that it? If not, then what?",
            "I might recommend getting a career consultant in the executive spaces, if you haven't already. Sometimes it's mostly just that people aren't experts in resumes (and how recruiters/hirers think) that keeps them unemployed - a small and fixable issue. \n\nOne of my past clients was a high powered exec who couldn't be more the definition of \"business consultant\". Seeing her resume was like attending an interview and ending up in an advertisement! I felt \"sold to\" in such a bait-and-switch way (and i was just analyzing her resume for general issues like a normal resume writer would).   \nI told her that, recommended some light changes on her resume and linkedin - and she was offered a job immediately through Linkedin. Sometimes it's just that extra professional feedback from someone that is nearer to the resume zone that identifies issues.",
            "Hello,\n\nSorry about your situation.\n\nI was in a very similar position to you about 8 months ago. I had my own SaaS company, we were in final stages of settling an acquisition and it fell through.\n\nI had the same mindset as you, I have a lot of workable skills, very solid background and experience. I sent out roughly 700 to 800 resumes over the next 7 months and just got two job offers yesterday. \n\nProbably the biggest thing I changed on my resume that started getting me interviews was taking off founder from my previous company as my title. I did not even talk about owning a company or being involved in starting a company, I spoke to the role as if I worked at that company in a position that was similar to the job I was applying to.\n\nI had really hard days and weeks as well, take a break when you need it, but I promise you resilience and keep moving forward is the key. One step at a time. Good luck.",
            "Someone that knew how to create value for the economy should be able to do that again with another type of value offering, right?\n\nMost people only know how to do what they're told in return for a wage. But you're different. Do you not have a 2nd idea because the 1st was being lucky as in right place; right time?",
            "I've been feeling the same way. It's very difficult and I'm sorry you're going through that. I'm tired and feel like I'm going through a mid-life crisis after quitting my career dream job. It also feels like all of the people who I have helped over the past 10 years have turned their backs on me. I find that trying to focus on the present helps. Ruminating makes me incredibly depressed. I was also lucky enough to find a psychiatrist who helped me get the proper medicine I needed. I'm still struggling most days and haven't found a new job yet, but I like to think that there's a reason I was pushed out of my comfort zone. We're strong, just exhausted for now. If you feel like you can, maybe try to use some of this time to rest. Up until this point, I wouldn't change anything I've been through because it got me here. 5-10 years from now, there will be a reason you look back on this time and think, wow, I'm really thankful that got me to where I am today.",
            "I live in San Francisco, and there is incredible nature on the way to the new projects where my grandma lives.  I think to myself why couldn't I appreciate this nature and had to go far off somewhere for college.  Knowledge is power, perspective is power.  Personally I spend time with the Bible through chatGpt and binge watch Netflix shows.  The algorithm didn't recommend Misaeng: Incomplete Life until last week and I'm on the last episode.  It's a masterclass.  Hope you find your perspective.",
            "[removed]",
            "How much do you charge for this service? I know my resume needs help"
        ]
    }
}