{
    "General Question Thread": {
        "title": "General Question Thread",
        "score": 114,
        "url": "https://www.reddit.com/r/fireemblem/comments/13u5lz9/general_question_thread/",
        "content": "Alright, time to move back to question thread for all. \n\nPlease use this thread for all general questions of the Fire Emblem series! \n\nRules:\n\n* General questions can range from asking for pairing suggestions to plot questions. If you're having troubles in-game you may also ask here for advice and another user can try to help.\n\n* Questions that invoke discussion, while welcome here, may warrant their own thread.\n\n* If you have a specific question regarding a game, please bold the game's title at the start of your post to make it easier to recognize for other users. (ex. **Fire Emblem: Birthright**)\n\nUseful Links:\n\n* [Serenes Forest](http://serenesforest.net/) - Universal Fire Emblem Information bank and community that covers all games in the series.\n\n* [Comprehensive Guide to Starting the Fire Emblem Series](https://www.reddit.com/r/fireemblem/comments/5s5nh1/new_to_the_series_where_should_i_start_the/) by triforce_pwnag\n\n* [Fire Emblem: War of Dragons](http://www.fireemblemwod.com/) - Primarily Spanish Website with some translated pages. Includes detailed maps and enemy placement that cover most chapters throughout the series.\n\n* [Triangle Attack](https://fe3h.com/) for all info regarding Three Houses and the GBA games(6-8). \n\n* [Fates inheritance planner](https://inheritance-planner.herokuapp.com/) - For planning out pairings for Fates.\n\n* [SoV HM enemy stats by Aggro Incarnate](https://docs.google.com/spreadsheets/d/127Wg_koXrAD-l7XI-Dz81twj77Uoo_kCv-b-PKXEQDo/edit#gid=0)\n\n* [Conquest Lunatic Enemy Stats by u/TheHelpfulMercenary](https://docs.google.com/spreadsheets/d/1vXDWKA7hEsgyOBH4TRErrjeFvrs4O4xDHeVd0d1POv0/edit#gid=842790844)\n\n* [Enemy Data Compilation for all games](https://docs.google.com/document/d/1ZF8n-JPM0cT74SoCaEsC9i1fdjGVQAh5ZSUuEjI9d90/edit)\n\n* [3H Calendar](https://old.reddit.com/r/fireemblem/comments/f1x4j3/three_houses_full_calendar_resource/) \n\n* [Interactive Map for all maps in Engage](https://fe17.triangleattack.com/maps)\n\n* [Relay Code Megathread](https://www.reddit.com/r/fireemblem/comments/10oajnt/engage_relay_trials_megathread/)\n\nIf you have a resource that you think would be helpful to add to the list, message /u/Shephen either by PM or tagging him in a comment below.\n\n**Please mark questions and answers with spoiler tags if they reveal anything about the plot that might hurt the experiences of others.**",
        "num_comments": 7358,
        "comments": [
            "This isn't a question but I would just like to express my thanks to those who have helped me in the thread with beating Birthright as I have finally beaten the final chapter. Thank you all.",
            "Playing the GBA game on NSO and I just got Lucious on my team. However, I can't do anything. It make me select them first but if I try to move them they say \"sorry, I prefer to attack from this location' but I can't seem to pull up the option to attack. Is this a glitch or am I missing something? Wrong button being pressed?\nEdit: I'm an idiot. Didn't see the square they wanted to move to kept getting highlighted",
            "not really a question, but i just finished Triangle Strategy. Found out too late that I couldn't get the true ending so I'm playing NG+ now. \n\nIt was a good game to scratch that FE itch (replayed all FE I had on hand to death already). Gameplay was different but still very FE-esque, so all FE fundamentals carry over. Every unit has a unique class and identity, so you don't run into the FE thing where a unit can become obsolete because they get outclassed by another unit. \n\nI thought the plot was pretty good (disclaimer: I don't think too much story in games in general), compared to FE at least. Everything felt very grounded and there weren't any moments iirc where I had to suspend disbelief or \"go with it\" in order for the plot to make sense. This is also a me-specific gripe, but the game gives you hard decisions where none of the options seem good and it makes me feel bad lol. I know this is exactly what was advertised and what I expected, but in some way I prefer the FE saturday morning cartoon vibes where I know I won't feel like a shit person. \n\nMy only real issue was I wasn't a fan of the presentation of the story and how slow it was. I understand it's required to really flesh out the story and the people's motivations, but I can sit down for an hour and be unable to get to a story-battle because there was a lot of plot related stuff to go through.\n\nAll in all still a fantastic game. Would recommend.",
            "Would anyone be interested in a guide on how to efficiently grind BP and VP in Fates? Most of the core information is available on Serenes and is relatively self explanatory, but since 3DS online is shutting down I know some people have been stressing over obtaining the Battle and Visitation seals while they’re still legitimately available. So I figured a post containing the basic information on how the system works and some strategy tips could be helpful. \n\nIf enough people are interested I could do a quick write up. If not, that’s totally fine since I’ve been busy lately. Just trying to gage interest!",
            "So, I've been thinking about doing a Simple image guide for the series to share with people who are interested in the series and/or want to get into it. Of course, [we have triforce's amazing and super detailed guide](https://www.reddit.com/r/fireemblem/comments/5s5nh1/new_to_the_series_where_should_i_start_the/), but i wanted to have something that can be understood \"at a glance\".\n\nSo i wanted to ask y'all, what do you think of something like this or in a similar vain/structure?\n\n* Generally, You can start almost anywhere.\n\n* Good beginner titles: FE7, FE8, FE9, FE11, FE13, FE14BR\n\n* Can start there but plays different than usual: FE4, FE15, FE16\n\n* Challenging: FE6, FE14CQ, FE17\n\n* Sequels, not recommended to start there: FE5, FE10, FE12, FE14Rev\n\n* Spin offs, Kaga Saga, etc.\n\nOf course i will mention what consoles the games are on, which games are remakes of which games, which have casual mode, which have official tl or fantl, etc.\n\nAny recommendations, changes, ideas? Is it a good idea to try to make something like this at all? Should i try to mention the strengths of each game....or does that defeat the point of a \"simple guide\"?",
            "does this sub plan on taking part in the reddit blackout protests starting june 12th",
            "Is the fates shadow dragon hack worth playing? It seems like a fun way to play through the archanea again",
            "Fates:\nShould I promote at an even level or odd level? I saw a thread awhile back about promoting at an even or odd level for optimal exp efficiency or whatever",
            "I don't think this is actually worth making a whole discussion thread about, but I was just thinking about the \"What if Awakening was on Mars?\" stuff that comes up sometimes.\n\nLike, the people saying 'omg it'd be cool' know Mars is like 99% red dirt, right? Imagine the complaints about maps if it was true to that. If it was terraformed? It'd be the same as any Earth-like setting we've already had.\n\nNow, I'd take it that people would really wanna see just, the same stuff as usual but with Vibro-axes and Lightsabers, but the thought of Mars in particular does make me wonder what they actually expect out of a sci-fi FE.",
            "Is it common to lose Chapter 13 of PoR Hard (EN)  on turn one due to an enemy reaching the defense location? \n\nI just lost a randomizer Ironman to this, and I feel pretty cheated out of my run. I used the Shove/Smite strategy on Ike to recruit Astrid/Gatrie and move the fragile duo out of the way, rescuing Ike. I then used a few fliers to take out two of the closest enemies… then on enemy phase- an archer crit the Allied unit blocking the stairwell, a mymidon finished him off, and the nearest promoted halberdier walked right in. \n\nI don’t remember if my randomizer settings buffed common enemies (I think it didn’t) so I was wondering if this ever happened to someone in a similar way in vanilla PoR."
        ]
    },
    "6/18 Nintendo Direct megathread": {
        "title": "6/18 Nintendo Direct megathread",
        "score": 198,
        "url": "https://www.reddit.com/r/fireemblem/comments/1diqni2/618_nintendo_direct_megathread/",
        "content": "Good morning everyone!\n\nOnce again for today's Nintendo Direct, we will be temporarily shuttering new submissions to the subreddit.\n\nPlease use this thread for all your reactions to the Nintendo Direct!\n\n[Link to the Direct livestream on Nintendo's YouTube channel](https://www.youtube.com/live/kX3BkD5PVUM)\n\n[Link to Nintendo's Twitch channel](https://www.twitch.tv/nintendo)",
        "num_comments": 621,
        "comments": [
            "🤡🤡🤡\n\nWe're the entire circus",
            "We got Echoes, we got a tactical game, we got a multi generational game…\n\nIt’s what we asked for right?",
            "What's IS even cooking if the FE4 is not a thing? Only one FE game for the entire switch lifecycle made in-house, and it was done/nearing completion by 2022.\n\nErr i mean , Glory to the faithful who still believe in Naga's promise! 🙏",
            "Yeah it's over next direct for sure though 🤡",
            "They just twisted the knife releasing a game titled “Echoes of” and having one of the last announcements lead with “Embark on a journey spanning generations”",
            "I'm genuinely curious if the FE4 remake ever existed at this point or if we've all been holding on hope to a fake rumour",
            "a saga spanning generations huh\n\nfuck",
            "Mods I hope we're a Kirby sub like old times in 6 months",
            "At least Metroid, Zelda, and Mario fans are celebrating today\n\nI guess us FE fans will wait for next time",
            "now you see, when they say Echo in that new Zelda game, they are making a reference to the \"Echoes\" branch in the Fire Emblem series, where they make remakes of old games like Gaiden, or, haha, i don't know, Genealogy of the Holy War"
        ]
    },
    "i thought emblems couldn’t eat??": {
        "title": "i thought emblems couldn’t eat??",
        "score": 840,
        "url": "https://i.redd.it/b77g0jwtdc9d1.jpeg",
        "content": "",
        "num_comments": 60,
        "comments": [
            "We learned through Emblem Marth they become corporeal coming to Askr, Marth: \"As an Emblem, I am not accustomed to being corporeal. I can fight as a Hero here—and even eat!\" \"Oh, I see. I can be touched in this world.\" Ike: \"Not needing food was convenient, but you won't find me complaining about a post-training spicy meat dish.\" \"Huh, I keep forgetting you can touch me in this world. That wasn't possible in Elyos.\"",
            "In Engage they can't, but for some reason in FEH they can",
            "All other emblems: \"We can eat? We're finally free!\"",
            "She feels true joy over being surrounded by flowers which can drink orange tea, obviously.",
            "Emblem Ike says directly he can eat in Askr but Elyios",
            ">Citrinne: It’s wonderful to meet you, Sigurd. May I offer you some cake? I just bought a whole bakery!\n  \n>Sigurd: I cannot possibly eat that much cake─or any cake at all, actually. Still, I appreciate the offer.\n  \nOh, IntSys.",
            "Come to think of it, it's weirdly inconsistent what the emblems do and don't make contact with. Most of the conversations they talk as though they just pass through solid objects, but in battle the animations imply they're attacking with you and doing damage. And when they're enemies or if you use Veronica they do make physical contact with the enemies and the enemies make contact with them. They also dodge as if they have a reason to avoid attacks.\n\nHuh",
            "Wait, they put the Emblems from Engage in as their own distinct characters? Huh",
            "I think this falls on the camp of Heroes lore people forget about with Emblems Being Corporeal in Askr. It’s in a similar camp to OG Lyon being the Lyon from after the end of Sacred Stones, aka, the Breidablik can bring people back the dead, as we can see proved further with characters like Lumera, Greil, Rudolf, and so on. There’s also the fact the Breidablik, selectively restores the memories of a person or gives them weapons they shouldn’t have in some cases like Deidre wielding the Naga in her first appearance. With Dark Veyle we also know that the Breidablik either gives alternative personalities full control of their bodies or simply gives each personality a body of their own. (I really need those 2 to interact to get an answer on that)",
            "As marth said in feh they can have a phyisical body so they can eat"
        ]
    },
    "Lucina and Morgan meet Young Chrobin (comm by @kagura_oni) ": {
        "title": "Lucina and Morgan meet Young Chrobin (comm by @kagura_oni) ",
        "score": 817,
        "url": "https://i.redd.it/fql956bj5c9d1.png",
        "content": "",
        "num_comments": 19,
        "comments": [
            "Apple tome...",
            "Imagine being maybe 8 years old, running into some random girl you've never met, and then a pair of grown-ass adults run up to the two of you taking a bunch of pictures and claiming to be your future children",
            "Joint commission with u/LampreyLarry from [kagura\\_oni](https://twitter.com/kagura_oni/status/1806471320093241797) on Twitter! The Snapshot tome making another glorious return, this time for a very important photo op with young Chrom and Robin. Luci and Morgan will treasure these photos for years to come.",
            "What is the lore behind young Chrobin anyway? Just something that Heroes made up for fun?",
            "I bet you Morgan bought that picture tome from Commander Anna.",
            "Possibly a macbook",
            "U think they got feh on that tome?",
            "iTome χ",
            "I think Anna in the Awakening DLC actually implies that's canon (tome-cameras)",
            "Snapshot Tome!"
        ]
    },
    "Etie": {
        "title": "Etie",
        "score": 192,
        "url": "https://i.redd.it/qrwk04rxnd9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "one of the best girl!\n\n[https://twitter.com/CapooLarioo](https://twitter.com/CapooLarioo)\n\nfor commission,DM to me in my twitter/reddit",
            "Etie and Combusken is perfect!!",
            "art good, Etie good, life good"
        ]
    }
}