{
    "Firefox 128 will allow the main browser content background to be transparent": {
        "title": "Firefox 128 will allow the main browser content background to be transparent",
        "score": 85,
        "url": "https://old.reddit.com/r/FirefoxCSS/comments/1dqws4b/firefox_128_will_allow_the_main_browser_content/",
        "content": "",
        "num_comments": 9,
        "comments": [
            "Looks good for unixporn posts but can't imagine using this daily",
            "Are they trawling back through the archives for things to fix? FIrefox is 19 years old, so this bug will have related to Netscape Navigator?",
            "Why would anyone want this? It wouldnt be a usable solution. Wouldnt be able to read a damn thing.",
            "So it's basically just a \"customization\" feature. Not something useful that I'd use, but streamers/gamers might be interested in this.",
            "There's a lot of people who want this actually, just search keyword like glass firefox, and it's optional so no win no lose, just a toy.",
            "Wow... \"useful\"",
            "It depends on the color of your wallpaper, and you can change text and link color using Firefox's Dark Mode built-in, so it's always suitable for your wallpaper color.\n\nhttps://github.com/Floorp-Projects/Floorp/discussions/487\n\nMost of the time it's all about the rule of high-contrast, there's a set of text colors that always look good with another set of background colors, so you work around those colors to create perfect high-contrast."
        ]
    },
    "Bookmarks. possible the worst UI i have experienced.": {
        "title": "Bookmarks. possible the worst UI i have experienced.",
        "score": 4,
        "url": "https://www.reddit.com/r/firefox/comments/1dr880o/bookmarks_possible_the_worst_ui_i_have_experienced/",
        "content": "before it used to just store my bookmarks in in order, and had \"show all book marks\" and there they were. \n\nnow i went to \"manage bookmarks\" and they seem to be gone, the only ones i see are \"recent bookmarks\" and that is the late 15 or so, or search bookmark.\n\n\n\nfuck me 20years of the internet and bookmarks are just as shit as day one.\n\n\n\nfirefox i love you and will never leave you and others are just as bad if not worse, but please. figure this out. ",
        "num_comments": 2,
        "comments": [
            "I don't understand this post. Do you still have bookmarks in the toolbar on a new tab?\n\nWhat happens if you click Bookmarks Toolbar in Manage Bookmarks window?",
            "Manage bookmarks work well enough for me, but it was a little confusing the first time I used it. Everything that is visible in the toolbar will appear in the Bookmarks Toolbar folder."
        ]
    },
    "Windows and Mac browser RAM usage comparison for 2024": {
        "title": "Windows and Mac browser RAM usage comparison for 2024",
        "score": 16,
        "url": "https://www.reddit.com/r/firefox/comments/1dr0zgt/windows_and_mac_browser_ram_usage_comparison_for/",
        "content": "I done this test because I could not find a recent data set with every browser I use compared together. \n\nThese amounts were found out by visiting the top 10 most visited sites according to Brave Search data: \n\nGoogle.com, Youtube.com, Facebook.com, Amazon.com, Wikipedia.org, Instagram.com, eBay.com, Apple.com, Reddit.com and Yahoo.com \n\nAll websites had accounts signed in and all browsers used either Ublock Origin or the browsers native ad block (Safari used Adguard for Mac) Ad blockers were the only extensions enabled and private mode were turned on for all browsers to ensure the least amount of personal data was shared with the sites.\n\nThere are 2 sets of numbers, and they are categorized by High and Average. High is the max amount of ram found to be used during the testing and average is well the average amount found during testing. Testing time was 4 minutes per site.\n\nNow the numbers:\n\n|Browser|Windows High (MB)|Windows Avg (MB)|Mac High (MB)|Mac Avg (MB)|\n|:-|:-|:-|:-|:-|\n|Chrome|1603|1444|2219|1966|\n|Edge|1703|1437|2328|2048|\n|Brave|1471|1288|1874|1798|\n|Firefox|2308|2143|3239|3077|\n|Vivaldi|1698|1463|2213|1906|\n|Floorp|2439|2125|3681|3414|\n|DuckDuckGo|2497|2327|3827|3513|\n|Arc|1427|1273|1876|1670|\n|Opera|1723|1545|4075|3810|\n|Safari|-|-|2480|2213|\n\n*Note: Safari is exclusive to Mac. Sites were visited at the same time on each browser.*\n\n*Machine for Windows: Surface Laptop 3 with Intel Core i5-1035G7 CPU @ 1.20GHz, 8 GBs of RAM*\n\n*Machine for Mac: MacBook Air Late 2020 with Apple M1, 8 GBs of RAM*",
        "num_comments": 15,
        "comments": [
            "This is very interesting... I wonder why Firefox is such a RAM hog. One of the reasons I switched to Firefox in the first place is because it was sold as a lighter, more efficient browser, but that doesn't appear to be the case.",
            "Interesting results.. Arc and Brave are the lightest on memory usage.",
            "I need you to post it so I know it's a cross-post.",
            "its almost like you think you can compare apples and oranges.\n\nthis comparison is incredibly flawed.",
            "*I did this test, not I done.",
            "It's hard to swallow, but the Chromium engine is much more efficient compared to the Firefox Gecko engine.\nGecko engine lags behind today's standards, which is reflected in higher CPU and RAM consumption and slower loading of various websites or videos.",
            "Id question how memory use was calculated. I did a comparison Chrome va Firefox on Mac myself. Firefox used 5% less RAM than Chrome. I tested using two tabs: a Google Spreadsheet and Azure Portal.  Both very heavy websites.",
            "I believe Memory Saver that's on by default, a Chromium feature is the one the makes big different, because Firefox doesn't unload background tabs.\n\nThis could be something Mozilla needs to implement.",
            "Firefox's is called Unload**OnLowMemory** for some reasons, it only works when system is about to run out of memory, which is about 400MB, which is useless, but Chrome works actively.\n\nAnd in above test with 8GB RAM system, it didn't work for sure, because it just use about 2-3GB, there's a tons of free memory left.\n\nSo both aren't comparable.",
            "Explain?"
        ]
    },
    "Privacy-Preserving Ad Measurement & Concerns": {
        "title": "Privacy-Preserving Ad Measurement & Concerns",
        "score": 86,
        "url": "https://www.reddit.com/r/firefox/comments/1dqngjy/privacypreserving_ad_measurement_concerns/",
        "content": "Recently noticed a new feature called 'Privacy-Preserving Ad Measurement' enabled by default on my copy of Firefox Developer Edition. Looks like it's also in Nightly, but it doesn't appear to be present on Stable releases yet.\n\nI won't lie that I'm deeply disappointed in Mozilla for this, and I have serious concerns. This feature should **not** have been enabled by default without notice to the user. Something like this should **always** be left to the user to decide IMO.\n\nMozilla provides more details on it [here](https://support.mozilla.org/kb/privacy-preserving-attribution). On its surface, it doesn't sound *too* bad, but what they neglect to share in that article is that [this feature was developed with Facebook/Meta](https://github.com/mozilla/explainers/tree/main/ppa-experiment)...\n\nThis immediately raises serious red flags for me. Facebook's values very clearly do not align with Mozilla's at all. Why would Mozilla partner and work with them on a feature meant to preserve privacy? Is there something I'm missing here?? Had this just been developed by Mozilla in-house, I would still disagree with enabling it by default, but I would at least have a level of faith & trust in its design. But having Meta directly involved makes it much worse IMO. Not to mention not making this transparent or clear to users at all.\n\nLook, I've used for Firefox for several years, and defended them on a lot of decisions, even some of the more controversial ones, but I'm really struggling to look past or justify this one. \n\nMozilla needs to be very, very careful. IMO they're starting to get on very thin ice, through first buying Anonym, and now this. (To be fair to Mozilla, this seems to have been in development since ~2022, and isn't related to Anonym, just very poor taste & poor timing IMO). One of the only things still keeping Firefox alive is its commitment to privacy and trust in Mozilla & their values. Without that, what's left? \n\nThe fact of the matter is that at its core, the browser is supposed to be the **user agent**. There shouldn't be \"Ad Measurement\" features in the browser at all IMO, certainly not enabled by default. The browser is not the **advertising agent**. Mozilla is supposed to be better than this. This is something I'd expect to see in Google Chrome or Microsoft Edge, not Firefox. I'm just struggling to find Mozilla's justification & reasoning for this feature compelling, and especially with enabling it by default.\n\nMozilla has done some truly amazing work and I've always supported them over the years. Firefox is the last real engine left standing against Google's Chromium monopoly. Seeing Firefox go down this path is deeply concerning & disheartening to me. I fear that Mozilla is going to turn away the few users they have left.\n\nCurious to hear thoughts on this and if my concerns are justified or just overexaggerating. There have been plenty of other decisions Mozilla's made that I've disagreed with, but I've generally been able to at least see & understand their position despite disagreeing. But I just can't cut it for this one, IDK.",
        "num_comments": 22,
        "comments": [
            "My reaction: over my dead body, uBO for life!\n\nI never want to see ads, period. I could care less about features that make it easier for advertisers, they certainly don't care about users...",
            "If this makes it impossible to profile individual users, then I am for it.\n\nSomething like this would, in theory, be a great alternative to cookies and should be brought forward to European Parliament to expand GDPR protection.",
            "I share your concerns on this, but there really isn't an ethical web browser out there. Firefox is kind of the lesser of the evils.",
            "Disable the setting, carry on using ublock and a DNS provider. What else can be done, really.",
            "You invited alternative opinions, so I'll respectfully disagree. I didn't hear any specific technical concerns about this technology. While I'm skeptical about its success, given Google's past attempts, I believe it's a natural direction for companies to explore. They're trying to make ads more private, and by rejecting this technology outright, we might be discouraging innovation and sticking with the current system. However, I do think it was a mistake to enable it by default, considering its experimental nature.",
            "How do you think Mozilla foundation and Inc. will monetize themselves to pay astronomical salaries to their CEOs, as a way to congratulate them for Firefox ever decreasing market share?",
            "To be fair, data scraping is a fundamental part of Google's business model as well.",
            "My guess is that Meta sees new privacy legislation, browser changes to increase privacy, etc. and realizes that in the future, their data gathering could be severely limited, which would directly impact their income from ads. This is why they are trying to create a plan B that will allow them to keep that ad income and survive in a world increasingly concerned about privacy.",
            ">If this makes it impossible to profile individual users\n\nSo is Google Chrome Ad Measurement. Allegedly.",
            "True. Firefox is really the only option left at the moment..."
        ]
    },
    "How do I pin a website to the New Tab screen that isn't there?": {
        "title": "How do I pin a website to the New Tab screen that isn't there?",
        "score": 3,
        "url": "https://www.reddit.com/r/firefox/comments/1dr74pj/how_do_i_pin_a_website_to_the_new_tab_screen_that/",
        "content": "Let's say I want to pin the website [clicktheredbutton.com](http://clicktheredbutton.com) to my new tab. A website I just discovered and bookmarked.\n\nWhenever I bookmark something, I just forget about it, so I want to pin it to New Tab, so I get reminded every once in a while.\n\nThis website does not show up on the new tab by itself, like websites that I frequently visit do.\n\nI tried dragging a bookmark over the new tab, this apparently worked in 2014, but now it just opens the website.\n\nHow do I pin [clicktheredbutton.com](http://clicktheredbutton.com) to the New Tab screen?\n\nExample: I could pin YouTube because I often visit the site and it shows up by itself. I remember I used to be able to look for websites and pin them, so I pinned a lot of websites I almost never visit just as a reminder that they exist and I like them, but I cannot find this feature anymore.\n\nhttps://preview.redd.it/vjhn46448h9d1.png?width=257&format=png&auto=webp&s=206106d3369e2878c803e714c21c0ba2835afb66\n\n",
        "num_comments": 2,
        "comments": [
            "rightclick and edit an existing bookmark to whatever you choose.",
            "Please see the instructions and screenshots on these help pages: \n\n* [Customize items on your Firefox New Tab page](https://support.mozilla.org/kb/customize-items-on-firefox-new-tab-page)\n* [Customize your New Tab page to hide or display content](https://support.mozilla.org/kb/customize-your-new-tab-page)"
        ]
    }
}