{
    "What are you building, buying, or shooting this month? - June 2024": {
        "title": "What are you building, buying, or shooting this month? - June 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/Firearms/comments/1d5leqp/what_are_you_building_buying_or_shooting_this/",
        "content": "Welcome to the monthly /r/Firearms thread about what you are building, buying, or shooting this month.\n\nUse it to discuss or ask any questions you may have.\n\nWe have a /r/firearms wiki! Check it out here https://old.reddit.com/r/Firearms/wiki/index. If you have any ideas of what content should be added, please message the mods and let us know.\n\nLooking for deals? /r/GunDeals\n\nNew to firearms? Check out this Forgotten Weapons series: [How Does It Work? Gun Mechanics Explained Simply](https://www.youtube.com/playlist?list=PL9e3UCcU00TRIeypXC53S8r81DZRvoXmu).\n\nLooking for a pro-gun organization to support? [Check here for a list](https://old.reddit.com/r/Firearms/wiki/index#wiki_gun_rights_organizations)\n\nLooking for firearms YouTubers or video content? Check out the [YouTubers section](https://old.reddit.com/r/Firearms/wiki/index#wiki_popular_firearms_youtubers) in our wiki.",
        "num_comments": 23,
        "comments": [
            "I’m agonizing 🤣 over whether or not to buy an Sig MPX 9mm carbine. \n\nI have to decide in the next two weeks due to an impending additional 11% tax inflicted by my oppressive state government. I’m also restricted by the CA compliant laws which narrow my options considerably. \n\nTalk me into or out of it, please. 😉",
            "I guess I'm buying a bump stock",
            "Just bought an old Gen scorpion evo 3, need to Wait for a can before shooting ( wife and dogs hate gunfire noise)",
            "I bought another $100 Marlin M60.  I finally grabbed a Remington 552!!!  The Marlin is on the brown goodie truck, the seller of the 552 hasn't yet updated me with a shipping cost.\n\nI've got \\~250 active bids on GB right now, still winning on about 25 of them.  I need to run through the list of Not Winning stuff and see if there's anything I can cherry pick.\n\nI really want to pick up a .30-30, either lever or bolt.  Just for cast bullet giggles.  A bolt .308 or .30-06 would also be nice for the same reasons.\n\nI noticed a fairly new gun shop in the area.  Superior Outiftters.  I need to check them out.  Hopefully they'll have a used gun rack.",
            "Bought a Colt King Cobra Target 22LR 6\" and a Rival S Darkside so far.\n\nWaiting on a BFR 45-70 10\" and an Uberti 1874 Sharps Down Under that are on order but will probably be a while according to the dealer.",
            "Bought a colt 11.5inch upper from aim today, aero lower as well.  Making a pistol, then form 1 it.  Bought a 36m and picked it uptoday as well.",
            "It was a damn expensive weekend for me.  Ended up winning several GB auctions.\n\nWinchester Wildcat bolt action, Savage 135, Marlin 25.\n\nThat's five .22 rifles in the past couple of weeks.",
            "T91, mil spec, not wolf",
            "Debt... I'm building debt but I want to build am ar 10 in the next couple of months",
            "Building another 16\" ar15 and vying that hk mp5 22 cal off palmetto"
        ]
    },
    "\"What do you need a 30 round mag for?\"": {
        "title": "\"What do you need a 30 round mag for?\"",
        "score": 1200,
        "url": "https://v.redd.it/odf6pvynjb9d1",
        "content": "",
        "num_comments": 237,
        "comments": [
            "“Hey hey! The work boots and safety gear are over here”!!",
            "... and full auto. Select fire gives you more options.",
            "I think I found the news story on this one. This was a hit on a jewelry store in SUNNYVALE, Calif. on 6/12/2024.\n\n  \n[https://m.local12.com/news/offbeat/theft-theives-stole-stolen-robbery-burglary-treasure-valuable-expensive-black-market-baclava-ski-mask-weapon-bat-hammer-tool-breaking-entering-mob-mentality-team-of-20-thieves-break-into-a-jewelry-store-arrested](https://m.local12.com/news/offbeat/theft-theives-stole-stolen-robbery-burglary-treasure-valuable-expensive-black-market-baclava-ski-mask-weapon-bat-hammer-tool-breaking-entering-mob-mentality-team-of-20-thieves-break-into-a-jewelry-store-arrested)",
            "I believe that Magpul makes a 60 round magazine for just such an occasion.",
            "Shopping for work boots. 🥾",
            "How do you know there wasn't bread in those speakers?",
            "You’re going to want full auto, preferably belt fed",
            "So anyway… I started blasting.",
            "You don't need  30rounds to defend against cockroaches...once one goes down, the rest flee like the cowards they are!\n\n\n\nBut seriously...yes, we all need 30 round mags (and larger drums ;) )",
            "\"Just fire two blasts into the air.\" \n\n- Some senile old man"
        ]
    },
    "Room clearing tips": {
        "title": "Room clearing tips",
        "score": 541,
        "url": "https://v.redd.it/0jcz49omdc9d1",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Mans came prepared 😎",
            "I like that guy. \n\n\nhttps://youtube.com/shorts/YVeufBgvo50?si=4cK_A3jm9xS43Iyo",
            "The FBI method involves an Abrams.",
            "Big Chops said “work smarter not harder.” 😅😅",
            "Pretty curious how many more weapons that redneck can cough up...",
            "\"pull my finger\"",
            "now that guy kill-dozers",
            "That works",
            "you really should be able to buy grenades at your local dealer.",
            "Well, I mean sure, it clears a room. But what if you want the room intact. What if its YOUR house you're clearing."
        ]
    },
    "Goodnight ATF - Supreme Court overturns Chevron Doctrine": {
        "title": "Goodnight ATF - Supreme Court overturns Chevron Doctrine",
        "score": 608,
        "url": "https://www.supremecourt.gov/opinions/23pdf/22-451_7m58.pdf",
        "content": "",
        "num_comments": 242,
        "comments": [
            "I'll summarize the decision with this excerpt from CNN's report on this:\n\n>The decision overturns the Chevron v. Natural Resources Defense Council precedent that required courts to give deference to federal agencies when creating regulations based on an ambiguous law. Congress routinely enacts open-ended laws that give latitude to agencies to work out — and adjust — the details to new circumstances.\n\n>“Chevron is overruled,” Chief Justice John Roberts wrote in his majority opinion. “Courts must exercise their independent judgment in deciding whether an agency has acted within its statutory authority.”\n\nFederal Agencies cannot invent regulation out of thin air now, and must have Congress actually do their jobs to pass laws.",
            "This is great. But I still don’t think the ATF is going to adhere to the law because they don’t even do that now.",
            "Courts are no longer forced to accept agency interpretations as fact. This means all ATF determinations and opinions effectively no longer carry the weight of law, courts will still consider them but this opens the floodgates to challenging all kinds of things that are ATF rules and not explicitly in federal statute. For instance import regulations on firearms, opinions on certain accessories, etc.\n\nYesterday they also blew up Administrative State enforcement authority which could decimate Biden’s zero tolerance FFL policy.\n\nIt’s a big fucking deal.",
            "Between this and Cargill the forced reset trigger ban is dead.  And that's a *much* more useful device than bump stocks.\n\nPistol brace ban, also dead. \n\nNew appeal document in the autokeycard case will drop within days.  We'll get Matt and Erwin home...soon?  :(",
            "Holy shit, I'm not used to this many wins. What do I do with my hands?!?",
            "#let's fucking go!!!!!!",
            "Oh man, you mean they can’t arbitrarily make new obscure laws on a whim anymore? Shoot! Sure am going to miss the circus that was attempting to keep up with the ATF’s feelings ):\n\nBut in all seriousness, the impacts on the ATF were my first thoughts as well when this broke. What a great Friday!",
            "##**HEY GUYS!!! DID YOU KNOW THAT AR-15s DON'T MEET THE STATUTORY DEFINITION OF A FIREARM AND ATF CAN'T MAKE UP REGULATIONS TO COVER IT?**\n\nThis immediately after last night's debate...   \n\n*I'm just so happy*",
            "Holy fucking shit this is huge. \n\n\n#CHEVRON IS FUCKING DEAD LETS FUCKING GO\n\n\n\"Held: The Administrative Procedure Act requires courts to exercise their independent judgment in deciding whether an agency has acted within its statutory authority, and courts may not defer to an agency interpretation of the law simply because a statute is ambiguous; Chevron is \r\noverruled.\"\n\n\nRandyMarshComputer.gif",
            "Can someone come up with a phrase that's like the \"Hot Girl Summer\" version of the ATF getting their ass clapped this year?"
        ]
    },
    "Traveling the country shooting with the boys 😁": {
        "title": "Traveling the country shooting with the boys 😁",
        "score": 188,
        "url": "https://www.reddit.com/gallery/1dqrl95",
        "content": "Going through a divorce and decided to travel with my dog, Goop, to shoot with as many gun friends as possible for the summer, skipping CA unless I’m going in no guns :(  \nSo far it’s been a blast!! I’ve  have met some awesome people and shot all sorts of different unique builds!\nI’m in MT and working my way down (I’ve cut across from VA to here in the last few weeks) \nI’m curious if there’s anyone in here that’s down to have Goop and I to shoot, hangout and nerd out, heck even FaceTime with me!\nI’ve noticed a lot of dudes don’t really talk to people and find themselves isolated. Witnessing this in conjunction with losing a few friends to suicide, I’m hoping to also use this trip to spread mens mental health awareness, though I’m not sure how to come about it.\nThese amazing companies have graciously sponsored me so far to keep the trip afloat! \n\nFluvanna County Firearms (some ammo and support from @mad_minute_tacticians and @juice_tactician)\nOvert Industries (sponsored a barrel for me to test, class and .300 black out)\nEgundirect (provided food and shelter for Goop and I)\nShalotek (DLVIP for 10% off 😁, I don’t benefit, I just like spreading the love)\nLiberty and Co\nOn My Own time Lawn Care (payed me to pick up trash which was actually really fun and provided a place for us)\n@Tangslangs (Instagram) (gave discount to support my new build put together entirely by friends) \nRedacted images for the sick pictures provided! \n\n\nI also decided create and trademark a logo based on my dog 😆 one of the best purchases ever made! I’ve made some funny shirts and patches that I’m thinking about selling and putting towards a charity or cause, though I’m not too sure!\n\nCome support, reach out or just enjoy the trip with me! 😀 The more wholesome homies I can get, the more love I can spread! \n@justsomedudewithgoop\n\nLastly, if you find yourself in a crisis, PLEASE reach out or call 988. \nIf a friend is reaching out, please listen to them and avoid shoveling “you know what you should do bro” at them. Just listen, inquire, and validate (took me awhile to learn myself)\n\nAlso the pic with my arms crossed, the leash wasn’t tight my dog was being dramatic cause it was hot 😆\n\nTLDR: shooting with wholesome homies cross country with my dog Goop and spreading mens mental health awareness. Join me @justsomedudewithgoop 😁😁",
        "num_comments": 40,
        "comments": [
            "Is the cure to male loneliness spiting lead with the boys?",
            "This is just beautiful dude. Keep this up please!",
            "Can I be on of the boys?? I wanna have fun to :(",
            "GOOP Troop on the move.",
            "This sounds like a very cool thing to be doing. I'm actually in MT myself so I know of a good shooting place to go if you happen to be in the right area.",
            "I wish I had a decent range to bring you to nearby here in PA. Seem like a great dude. Enjoy your journey my friend",
            "I want one of those Goop shirts!",
            "Brotherhood 🫡",
            "Cool shit bro, rah.",
            "YouTube channel?"
        ]
    }
}