{
    "I closed today": {
        "title": "I closed today",
        "score": 171,
        "url": "https://www.reddit.com/r/FirstTimeHomeBuyer/comments/1dqztej/i_closed_today/",
        "content": "I (37m) just closed today after starting the process in February. Before February I had no idea I would be considering a home. I went from making under $30k annually for the past 3 years until  last year I went to over $50k. I don’t really have family or friends here so I signed, got the keys, and went back to work. I’m now sitting on my bed and just crying in my apartment. I moved to the country just under 6 years ago and I was sleeping on a reclining chair. I’ve questioned myself so much over the past years and I can’t believe I’m going to be called a homeowner now. I’ve just been overwhelmed, exhausted, and emotional. I’ve not eaten since I signed and I’m now going out to treat myself.  What did other people who didn’t have anyone to share this moment with do?  \n\nFor background info the house was sold at $140k. I got $20,500 DPA from my lender. $3,500 credit from seller and another $750 from lender for closing. I paid $0 for closing. My rate is 6.79% conventional and my credit score was 733.",
        "num_comments": 26,
        "comments": [
            "I’m just an Internet stranger here, but know that I mean it when I say I’m proud of you! Congratulations!!",
            "Congratulations! I was on my own too after I closed on my first place. I think going out to eat is the perfect celebratory treat! I drove to the settlement office with a car full of furnishings and headed to unload once the papers were signed and I had the keys. I ordered take out and sat on the deck in my new back yard enjoying my first meal. \n\nI am so happy for you - enjoy owning your own little spot in the country!! 🤗",
            "You don't have anyone to share it with?? You have all of us! 🫶 Congratulations! It is an overwhelming experience, especially the whiplash of emotions you may go through. Excited, terrified, motivated, defeated. I went through all of these within the first week after closing and by week #2 I was so exhausted that I was definitely questioning my choice. But I'm about two months in now, and appreciating the gift of reaching this huge milestone. You did it!!!! Oh -- and to answer your question, I bought myself a small plant that I put on the windowsill above my sink. First decor in my new home, and I get to look at it every single day. That was my little celebration ☺️",
            "Forget nerves. Pat yourself on the back for doing so well!  Here's my advice: take a deep breath and enjoy your first sunrise and sunset. Don't rush to buy furniture, take your time, and buy what feels right, or you'll wind up with things you don't really like. Save some money for a repair bc something will come up. Buy a small tool kit, assorted nails and screws, and a roll of duct tape. Label your circuit breaker. Get a medium camping lantern from Coleman or Ozark in case of a power failure. That covers basic emergencies. Now, move in and start enjoying your big accomplishment!",
            "Congratulations! You did it!!!! 💪🏼🥳\n\nGoing out to eat is definitely a good idea. There's no rush—take your time to process your feelings and settle in.",
            "Super happy for you, congrats!",
            "Thank you all for the kind words!",
            "Congrats on your new home! Such an amazing story. Hope this new home brings many new memories.",
            "So happy for you bro. You deserve this! All the best.",
            "What city and state!?  Congrats"
        ]
    },
    "Bought a Small Bungalow 37000$": {
        "title": "Bought a Small Bungalow 37000$",
        "score": 14,
        "url": "https://www.reddit.com/r/FirstTimeHomeBuyer/comments/1dr90i9/bought_a_small_bungalow_37000/",
        "content": "Bought a small bungalow cash for 37000$ in the Midwest. Sqft is 484. Had to buy with no inspection but bought from a people I known for years and was in good condition. New Roof, Newer furnace and central air newer siding. Taxes 500$ a year. \n",
        "num_comments": 6,
        "comments": [
            "Very nice, I got a house about 800 sqft. $800/month.",
            "Amazing! For that low a cost, it's worth the gamble. You have a place to call your own!\n\nHow much land does it come with? Are you close to town and amenities?",
            "a tiny house iT is.",
            "I’m in a very similar situation \nLong Island New York I’m in contract on a bungalow $385,000 9000sqft property \n9k property taxes",
            "Thank you u/dixon8011 for posting on r/FirstTimeHomeBuyer. \n\nPlease bear in mind our rules: (1) Be Nice (2) No Selling (3) No Self-Promotion. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FirstTimeHomeBuyer) if you have any questions or concerns.*",
            "Congrats!"
        ]
    },
    "Is it dumb to buy when rates are high then refi?": {
        "title": "Is it dumb to buy when rates are high then refi?",
        "score": 96,
        "url": "https://www.reddit.com/r/FirstTimeHomeBuyer/comments/1dqywb7/is_it_dumb_to_buy_when_rates_are_high_then_refi/",
        "content": "So new to this\n\nIs it dumb to buy a house when the interest rates are high provided that you can afford the payments at the higher interest rate and then refinance? \n\nI know that when rates drop , prices tend to go up\n\nfeel free to tell me if I’m a complete idiot ",
        "num_comments": 208,
        "comments": [
            "Rates may not drop low enough, quickly enough to make refinancing worthwhile. Buy what you can afford at current rates and prices, and consider any opportunity to refinance a bonus. What happens if you overextend yourself now and rate stay above 6% for the next five years?",
            "As long as you don't *assume* the rates will drop and you can refi, then it can still make sense to buy now.",
            "I think this is the basic strategy of most buyers now that are not buying in cash.",
            "Why do assume rates will drop a lot soon?",
            "No it’s totally fine, you just shouldn’t buy if you can only afford it if rates drop because that is never a guarantee. If you can afford it now and find a house you want then go for it and then it’s just a bonus if rates drop later.",
            "That’s why we’re all here currently. That’s my plan at least",
            "I now own a house that I can afford. Aside from small increases to HOA and property taxes, my monthly payment can only go down from here. This is a great benefit that I could never get from apartment living. My mortgage payment is $1912 now, and it'll be $1912 (or less if I refinance) in 2054 when it's finally paid off.",
            "Market is crazy asf right now even with the current rate . I cannot imagine what it will be like when rates drop . Buy now but buckle down for the long haul .",
            "It is more difficult than most people realize. We don’t know how quickly rates will come down. Also, when do you refi? Is 6% a good rate? 5%? What if you want to wait until rates get to 5%, but they bottom at 5.5% and creep back up? It’s like trying to pick the bottom on the stock market. For those who bought recently at high prices, they will feel even more pressure to pick the absolute lowest rate possible, but there is no way to know what or when that will be.",
            "Buy what you can afford today, start building equity and stop throwing money away on rent. When rates drop (if they do) then you can refi. I bought last year with that mindset and hope to do a HELOC to do an addition in 3-5 years and then a refi after the buildout is completed provided rates are sub 5.25%."
        ]
    },
    "Ready to close and seller refusing to sell, blocked her agent  ": {
        "title": "Ready to close and seller refusing to sell, blocked her agent  ",
        "score": 87,
        "url": "https://www.reddit.com/r/FirstTimeHomeBuyer/comments/1dqyxpn/ready_to_close_and_seller_refusing_to_sell/",
        "content": "Seller and I agreed to asking price plus $5k towards my closing costs. Everyone had to push her for that $5k because she doesn’t believe in compensating the buyer... But she was ultimately convinced by her daughter to sign the purchase agreement. \n\nAbout a week in she decided she wanted to back out because she was mad she agreed to the $5k and she hated her agent. I wasn’t told about this because they didn’t want me to stress since, according to our contract, she legally can’t back out. They thought she’d come around. After inspection my realtor told me about the situation. She asked if I wanted to back out because the house needs a roof repair and obviously seller wouldn’t cover it. I said I’ll cover the repair and I won’t back out. \n\nMy lender let me know today that everything is wrapped up and we’re ready for closing on our end. Seller is now saying she won’t sign anything over to me, everyone needs to stop calling/texting her and she will NOT sell the house. She has actually screamed insults at her own agent for continuing to contact her. She told her “send me the termination papers and don’t contact me anymore.”\n\nTrying to decide the next step now. I will NOT walk away without compensation for the money I have already spent… but all I want is the damn house. Seller now owns a home out of state with no family here so I’m not worried about her/anyone else trashing the house if I threaten legal action. I’m going to get a lawyer to send her a threatening message but not sure if it’s worth a full legal battle if she decides to continue being stubborn (which is a definite possibility considering her personality). I want to force the sale and I know I’d need legal counsel but I guess I just want opinions on if it’s worth it or not. I’m frustrated, this house is everything I wanted.",
        "num_comments": 61,
        "comments": [
            "We were just about to the same point in a transaction when the seller decided not to sell. She compensated us for all our expenses and relisted the home three months later for $15k more. We were a third the way packed up and had a move in date. We found another place in a nicer community  (but not near as nice of a home), and our move in date was only 5 days later, but man, were we bummed.",
            "You will likely win in a lawsuit, but if a legal threat doesn't work, you are probably wise to just back out and start all over again on your house search.",
            "Sue.  She is under contract.",
            "She technically owes her broker the commission now too since they found a willing and able buyer at her asking price. You can threaten to sue and see if she comes around. If you really want the house and she won't cooperate then you would have to take her to court to force the sale.",
            "Your lawyer can force the sale. It may take extra months, but seller signed the contract, hold them to it.",
            "My husband and I are both lawyers. It wouldn’t cost us anything and we’d both be pissed off. Win or not we’d drag her through a lawsuit and make her spend $$$ on attorney fees to punish her. We’re assholes like that. \n\nIs it worth it for you?  Probably not but it still really sucks.",
            "Back out. Get your earnest money and then some to cover inspections, surveys etc. Do you really want to live in a place where the seller can wreak havoc if she was really deranged?",
            "Did she say she would give you the money back for inspection ect ? Tbh she could fuck up the house on your dime if you push her . This is just insane , she sounds nuts . Someone liek that is a lose cannon I’d be worried she’d show up . I’d possibly do a civil suit for the money ? Bring your contract ect then your not paying a lawyer .",
            "You can sue for specific performance but it’s not really something I recommend due to how long it takes and you typically have to put all the cash in escrow. Talk to your lawyer. She may go ahead when you try to sue for your costs.",
            "Offer to pay her that $5k and see what happens."
        ]
    },
    "We did it! ": {
        "title": "We did it! ",
        "score": 8,
        "url": "https://i.redd.it/kik1yggdgi9d1.jpeg",
        "content": "Fell in love with this kinda weird house the moment we pulled in to the drive way. After Inspections we discovered the sewer line was totally fucked. After some negotiations the seller had the sewer line totally replaced! We almost walked away but now we're in our dream home ",
        "num_comments": 1,
        "comments": [
            "Thank you u/larsattacks94 for posting on r/FirstTimeHomeBuyer. \n\nPlease bear in mind our rules: (1) Be Nice (2) No Selling (3) No Self-Promotion. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FirstTimeHomeBuyer) if you have any questions or concerns.*"
        ]
    }
}