{
    "the august lineup has been revealed👀": {
        "title": "the august lineup has been revealed👀",
        "score": 2136,
        "url": "https://i.redd.it/rh9hsn9iak7d1.jpeg",
        "content": "",
        "num_comments": 322,
        "comments": [
            "Hold on, Five Laps At Freddy's???\nSo does that mean we are getting a FNAF themed Kart racer???",
            "If Aug 6th is the actual Fortnite collab it’ll be on my birthday which will honestly be amazing 😂",
            "Five laps at freddys is actually so hype",
            "Why am I most excited for the interview when I know nothing is going to be revealed 🙃",
            "Imagine if The clickteam game is like Fnaf Cart. Lolbit WAS wearing a racing-esque outfit in that one teaser.",
            "Just letting ya’ll know there will be a fortnite update on the 6th btw\n\nEdit: y’know now thinking about it it could also be a dbd collab BUT I think a fortnite collab is more likely",
            "Just a note that there's a licensed Dead By Daylight chapter in August with new killer and survivor. It's that collab ain't Fortnite nor DBD then idk what that is...",
            "NEW SCOTT INTERVIEW AND A FORTNITE COLLAB I'M GONNA DIE",
            "Why are people so excited for a Fortnite collab and not the steel wool announcement. Could we be getting a triple a release from them soon?",
            "AAAHH NEW INTERVIEW!!!\n\nI'LL BE STOCKED WITH FNAF DOPAMINE!!!!"
        ]
    },
    "[Fanverse News] The Joy of Creation on Steam": {
        "title": "[Fanverse News] The Joy of Creation on Steam",
        "score": 136,
        "url": "https://store.steampowered.com/app/2948730/THE_JOY_OF_CREATION/",
        "content": "",
        "num_comments": 15,
        "comments": [
            "I have a question. I haven't played TJOC on my own, but I've seen a good amount of it from playthroughs, and I thought it was very good, so why is it getting a remake? What kind of things are they changing or adding?",
            "I hope that they release the console versions of the game at the same time as the pc release",
            "Finally, more fanverse!",
            "Trailer looked absolutely peng, can't wait for the demo.",
            "Suddenly, lets play youtubers everywhere felt a disturbance in the force.",
            "whatever happened to nikson being a transphobe",
            "I think it was going to be a re-imagining/remake of the later TJoC titles. The first game is not going to be included.",
            "Nikson was unsatisfied with the original TJoC games (the original demo, Reborn, Story Mode) and decided to rebuild the entire thing from the ground up, starting over from scratch. It'll have updated story mode levels as well as the free roam from TJoC:R. It'll have new mechanics, new characters, and a new story.",
            "it is a full re-imagining of Story Mode. every level will be expanded on greatly, with the exception of Bedroom. Bedroom is going to be entirely different than the original bedroom. the story will also be much, much different. now it is only one main character throughout all the levels, and that main character is not Scott anymore, but still is the creator of FNAF. there's a lot more depth in here that I could go into, but I don't want this reply to be very long. I recommend checking out Nikson's twitter (@Nikson_dev) to see gameplay footage and stuff from the game.",
            "Please I want to play so bad but I hate using pc, hopefully this happens!"
        ]
    },
    "Who is the most annoying character of all of these?": {
        "title": "Who is the most annoying character of all of these?",
        "score": 1495,
        "url": "https://i.redd.it/v4u4jx7vic9d1.jpeg",
        "content": "",
        "num_comments": 535,
        "comments": [
            "Aunt Jane isn't annoying. She's just evil. DD, however...",
            "Glamrock Freddy is literally one of the only actual enjoyable parts of security breach",
            "GLAMROCK FREDDY IS NOT ANNOYING‼️",
            "the evil aunt from mike",
            "I'm sorry, Glamrock Freddy? ANNOYING?",
            "The hell did Glamrock Freddy do to you",
            "GLAMROCK FREDDY DOES NOT DESERVE TO BE HERE",
            "From what I've seen, it might be the Plush Babies and DD. Aunt Jane's a bitch, Glamrock Freddy legally cannot be here, Ballon Boy's okay now, and Gregory was just trying to stay alive.",
            "Get G. Freddy out of here, he does not deserve to be here",
            "The plush baby's or balloon boy! I don't think Glamrock Freddy or Gregory deserve to be here 😭"
        ]
    },
    "What’s your thoughts on Vanessa Shelly/vanessa afton?": {
        "title": "What’s your thoughts on Vanessa Shelly/vanessa afton?",
        "score": 165,
        "url": "https://i.redd.it/6c8i5729de9d1.jpeg",
        "content": "Honestly I don’t get why I see people hating on her. While I must admit I’m not crazy about her game counterpart because she was very overrated especially those who kept treating her better than William at the time when she’s not. Her movie counterpart I actually had no issues while yes she’s not my favorite my favorite character since January of 2015 has always been and always will be William afton nothing will change that. However she’s not that distracting and her being a new character in the old timeline doesn’t bug me and when me and my mom went to see it ( me and my mom goes to the movies together to hang out etc. it’s just something we do maybe once a year if anything good is playing. ) my mom grew an attachment to Vanessa and she became her favorite out of the four main characters and when she got stabbed she kept hoping she’ll be ok and when people are speculating about what the fnaf 2 tagline says “anyone can survive five nights but this time there won’t be any second changes. Hinting at one of the characters is most likely going to die and people speculating about who it’s going to be she hopes it’s not Vanessa. ",
        "num_comments": 53,
        "comments": [
            "She is really well written but poorly portrayed (not the actresses fault)\n\nWhen you find out the truth about her, all of her behavior makes a lot more sense. You can understand exactly why she acts the way she does in each scene and why her personality seems so flippant. The book makes it even more clear how her sudden personality changes are supposed to make you feel confused and give you whiplash, but in the movie it kinda just feels like she didn't have a solid personality.\n\n I think that's why she gets a lot of hate, her changes in behavior are very nuanced but come off as just poor characterization on a surface level.",
            "Would",
            "She's my favourite character in the movie.",
            "I love her",
            "I squealed when I saw Elizabeth Lail! I don't know much about FNAF, but I saw the movie (twice actually back to back), and I thought her character was interesting the first go, the second go things made so much more sense.",
            "Eh, not a fan.\n\nI find movie Vanessa kinda dull and she's mostly there to spout exposition for Mike and the audience, which ruins the mystery aspect of the film as a result.\n\nShe's a lot better than game Vanessa, but that's not really a high bar.",
            "I adore her",
            "I personally like her.",
            "She's cool. Her plot twist was a very welcome change of pace, but she did kinda feel inserted to be an exposition dump.",
            "I didn’t like her. There, I said it downvote me all you want. But I just didn’t like her character."
        ]
    },
    "Vanny!! With some creative liberties": {
        "title": "Vanny!! With some creative liberties",
        "score": 99,
        "url": "https://www.reddit.com/gallery/1dqzry2",
        "content": "",
        "num_comments": 6,
        "comments": [
            "She looks great!",
            "This is so cute!! Love it!!",
            "Maybe it's just because of the artstyle or her outfit, but Vanessa looks like a character from Danganronpa.\n\nNice art btw!",
            "That must be the cuteest vanny/vanessa design I've seen so far, I love that!",
            "Murder with style, cool art!",
            "👌"
        ]
    }
}