{
    "Weekly Music Feedback Thread - June 26, 2024": {
        "title": "Weekly Music Feedback Thread - June 26, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/FL_Studio/comments/1doyo1y/weekly_music_feedback_thread_june_26_2024/",
        "content": "# WEEKLY FEEDBACK THREAD\n\nHere is a place to post your music for feedback without the limitations of **Tunesday**.\n\nPlease leave feedback for others that have posted in this thread. If you share feedback for someone else, you're more likely to get feedback on your own comment.\n\nYou have the control to make it less of a mindless \"click\" thread. It is also a great opportunity to explore new music and find gems! If you didn't receive any at first you can try again after 3 days.\n\nPlease link to **specific tracks** for feedback - not artist pages or full albums.\n\n**You can** [**visit our discord**](https://discord.gg/27wgKfafmP) **at any point to post your track for feedback in our Feedback channel.**",
        "num_comments": 19,
        "comments": [
            "Really glad u enjoyed it man! I usually tuck the vocals back a bit but I always get told I mix em too quiet so I tried to give them more presence this time around. guess I overdid it lol  \n  \nReally cool track u have here man. Love the grimey feel. The drums have a really nice texture and sit so nicely in the mix. I don't listen to a lot of music in this style but I love the way it builds. I don't enjoy the piano riff that comes in much, I feel like it sits a bit weird in the mix, could sound a bit dirtier. But i do love the space as the tracks build, harmonically its very interesting and rhythmically consistent. Would've been nice to have a break from the drum beat at about the mid way point tho, i feel like it wouldve been a good breather and helped out the tracks dynamics a bit. Overall great track man",
            "The vocal mix in your track is not bad by any means, but maybe the loudness is worth keeping in mind.\n\nThank you for the feedback. Glad you liked it. I'll keep your points in mind.",
            "Nice track",
            "Thank you very much",
            "I wrote and recorded the vocals and produced the track just finished it. had to use my patcher preset on the 808 and kick as a final sweetener [https://on.soundcloud.com/41cQoDgrJCb92LtC7](https://on.soundcloud.com/41cQoDgrJCb92LtC7)",
            "[https://soundcloud.com/dabaeri/bestemt-boosted](https://soundcloud.com/dabaeri/bestemt-boosted)\n\nadded some flava to it, went for deep house, what do you think?",
            "would love feedback abt anything regarding my newest release. I handled the beat, mix, performance etc. will return all feedback  \nhttps://soundcloud.com/donatjackson/wontchange",
            "Sounds cool just a lot of mud going on. your synths have too much low end you need to cut the lows to around 300 or more i think on a lot of things anything that isnt mono. you can try my patch preset to do this it has knobs for low end and highpass but also you can enhance the high end stereo its pretty cool no branding either [https://www.dropbox.com/scl/fi/2p78vdphjf8tzyjyvogel/Stereoizer-2.0.fst?rlkey=4vrltban0v8uuupnqtqv7k1j8&st=4daxgp2b&dl=0](https://www.dropbox.com/scl/fi/2p78vdphjf8tzyjyvogel/Stereoizer-2.0.fst?rlkey=4vrltban0v8uuupnqtqv7k1j8&st=4daxgp2b&dl=0)",
            "i listened all the way through and all i wanted to change was the stereo field. if you want you can try my patcher preset on a few things like the kick and snare for some more sweetness in the stereo field. [https://www.dropbox.com/scl/fi/2p78vdphjf8tzyjyvogel/Stereoizer-2.0.fst?rlkey=4vrltban0v8uuupnqtqv7k1j8&st=4daxgp2b&dl=0](https://www.dropbox.com/scl/fi/2p78vdphjf8tzyjyvogel/Stereoizer-2.0.fst?rlkey=4vrltban0v8uuupnqtqv7k1j8&st=4daxgp2b&dl=0)",
            "This is part 3 of my four-part EP. The full 17-minute EP can be found in my Soundcloud for those who are interested.\n\nThis is a dark-edged big beat/trip-hop number that stands as the darkest moment in the EP. Tell me what you think!\n\n[\"Life Tracks Part 3: For How Long\" by proJectmaker ](https://on.soundcloud.com/wQNwd)"
        ]
    },
    "Feedback Friday is live!": {
        "title": "Feedback Friday is live!",
        "score": 3,
        "url": "https://www.reddit.com/r/FL_Studio/comments/1dq60w6/feedback_friday_is_live/",
        "content": "Today we will be having a Feedback Friday.  \n  \nAll the normal Tunesday Tuesday rules still apply, except **please use the \"Feedback Friday\" flair for your posts!**  \n  \nThe event will close around 12:00 PM **EST** on Saturday. If you have any suggestions, questions, or comments, please [send us a modmail message](https://www.reddit.com/message/compose?to=/r/FL_Studio).",
        "num_comments": 1,
        "comments": [
            "Would love some feedback on this new track please - it's not quite mixed and not mastered - sounds are all FPC, FLEX, and Punchbox.  I run neutron on each drum sound, neutron eq on each track, neutron on each bus, and neutron on master for glue.  no reverb yet.  appreciate tips for the song-writing element of it!\nhttps://soundcloud.com/timewalkerad/retrowave-rides-again-2nd-rough-mix-no-master/s-0HAS1gnCMjt?si=28202376f8e245049f853d9188b16237&utm_source=clipboard&utm_medium=text&utm_campaign=social_sharing"
        ]
    },
    "How we feel about this one?": {
        "title": "How we feel about this one?",
        "score": 32,
        "url": "https://v.redd.it/3x65phshee9d1",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Id cut the first 16 bars, I struggled to get through them the first time, couldnt listen to them twice. It goes hard when the drums drop.",
            "Love the first 8 bars, next section lost the energy though and then the drop main bass isn't that interesting and it's the main star of the show so i'd skip if played on shuffle, but drums and sub are knocking so you know what you're doing and can take it somewhere. reminds me of juelz, so if i were you i'd keep going until it sounded as good and engaging as juelz or whoever your reference is ya feel me.  good shit",
            "Dude, this was so sick!  About halfway through or a little after, my brain kept changing the chord progression up a little in my head, I think at the 38 mark, you could totally add a little bass line/riff with the other instruments following that for like 4 - 8 bars and then fade back into the main melody again; but thats just personal preference haha \n\nThis was dope, Im a slt for phonk ",
            "i was expecting brazilian funk",
            "The instruments are all louder than the vocals",
            "yeah lmao i agree absolutely",
            "You could also try adding some ear candy to spice it up in some parts, nothing crazy but something for the ear to catch onto here and there! :)",
            "I think thats the genre tbh!",
            "Hard asf ",
            "Hey u/pmmeserumpresets, thanks for submitting to r/FL_Studio!\n\nWelcome to Feedback Friday. If your video isn't a screen recording of your playlist window with your full track (not just a waveform of your track) from your project, it will be removed so please delete this post and make a new post with your playlist window. If you find your track's audio quality is noticeably decreased using Reddit's video player, you are welcome to upload your video to YouTube. We just ask that you follow the previously stated rules.\n\nYou can learn how to record your screen with this tutorial guide by SlimeCinema, [click here](https://www.reddit.com/r/FL_Studio/comments/10q7fou/screen_recording_for_tunesday_tuesday/).\n\nTake a moment to read our [rules](https://www.reddit.com/r/fl_studio/about/rules).\n\nJoin our [Discord Server](https://discord.gg/27wgKfafmP)!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FL_Studio) if you have any questions or concerns.*"
        ]
    },
    "how do i get rid of this big ass thing": {
        "title": "how do i get rid of this big ass thing",
        "score": 5,
        "url": "https://www.reddit.com/r/FL_Studio/comments/1dr5kee/how_do_i_get_rid_of_this_big_ass_thing/",
        "content": "https://preview.redd.it/7y32u61iog9d1.png?width=333&format=png&auto=webp&s=8804551e25dac81bdf8ab0251a43014713e38127\n\nhow do i get rid of this",
        "num_comments": 11,
        "comments": [
            "the thing in between master and track 1",
            "I'm pretty sure you can't but I'm also curious, why do you want to do that?",
            "Are you able to grab the edge of it and stretch/pull it so it becomes thinner?",
            "He won't be able to produce high quality music with it",
            "You are def right, but let me take a wild guess here. I can imagine that OP, like me, could have a small monitor/display, that makes navigating annoying in FL, every inch you can save makes it less tedious.",
            "Theres actually two of those separators in the mixer, one on the left and one on the right. You cant hide them completely, but you can choose which tracks go before/after them (including the master and current tracks) \n\nIn the mixer, right click on track>Layout>Dock to>Middle/left/right.\n\nIf you have any tracks docked left or right, clicking on the separator will collapse the area to the left/right respectively. It hides whatever tracks are there.\n\nTheres a helpful diagram in the user manual under Mixer & Mixing>Mixer functions. The manual should be the first place you check when you have a question.",
            "eat it",
            "U cant my guy",
            "Hey u/SufficientAverage796, thanks for submitting to r/FL_Studio! Take a moment to read our [rules](https://www.reddit.com/r/fl_studio/about/rules).\n\nIt appears you're looking for help. Please [read the frequently asked questions](https://www.reddit.com/r/FL_Studio/wiki/faq/) in our wiki, if you find the answer you're looking for, please consider deleting your post. If you don't find the answer, your thread can remain active and other users will be here to help you shortly.\n\nPlease do not post your question more than once and please be patient.\n\nJoin our [Discord Server](https://discord.gg/27wgKfafmP)!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FL_Studio) if you have any questions or concerns.*"
        ]
    },
    "I spent 60 days studying mixing. Does it show or do I still need more practice?": {
        "title": "I spent 60 days studying mixing. Does it show or do I still need more practice?",
        "score": 62,
        "url": "https://v.redd.it/xlc0cqhfpc9d1",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Sounds pretty decent at headphones, wish I could hear at reference monitor. Anyway I think u have to continue studying mix because we never finish mixing, we abandon...",
            "The low end could use a little more punch imo, but other than that it sound clean.",
            "It sounds good on my phone LOL.  That says something.",
            "I would never put this on, but it's good. 90's Movie score type music.",
            "How does one \"get good\" at mixing? Ive been kinda stuck on whats supposed to sound good for a while :/",
            "I dunno shit about mixing but this is a bop!",
            "Youre great mate! Just keep on releasing and let the world hear your talents!",
            "Ive spent 16+ years producing and mixing",
            "even the pros after 60 years didnt learned all this is music and its endless",
            "Nah man, that's good enough. Move on"
        ]
    }
}