{
    "RULE 2 WILL BE ENFORCED - YOUR POST WILL BE REMOVED if they do not include full details including: exact dates of travel, cities/airports, airlines, flight numbers, visa/passport and citizenship info, and budget. Screenshots appreciated.": {
        "title": "RULE 2 WILL BE ENFORCED - YOUR POST WILL BE REMOVED if they do not include full details including: exact dates of travel, cities/airports, airlines, flight numbers, visa/passport and citizenship info, and budget. Screenshots appreciated.",
        "score": 82,
        "url": "https://www.reddit.com/r/Flights/comments/vnkeek/rule_2_will_be_enforced_your_post_will_be_removed/",
        "content": "The number of posts lacking details too high. Please provide the full detail of your journey. \n\nInclude whether you purchased the itinerary on a single ticket or multiple tickets (self-transfers).\n\nIf you keep your airlines and airports hidden or a mystery, your post will be removed.\n\nDO NOT POST any personal info that can be used to identify you (names, DOB, PNRs/ticket numbers).",
        "num_comments": 0,
        "comments": []
    },
    "Least favourite airport?": {
        "title": "Least favourite airport?",
        "score": 168,
        "url": "https://www.reddit.com/r/Flights/comments/1dqekhx/least_favourite_airport/",
        "content": "For me it's Charles de Gaulle in Paris. Horrible airport. Poorly designed and confusing as hell. I don't know if it's improved in the last decade, but I'm still somewhat scarred by my experience there after all these years.\n\nNormally I don't have particularly strong feelings for specific airports, but to this day I still avoid flying to CDG.",
        "num_comments": 399,
        "comments": [
            "Y’all don’t travel in Africa and it shows. Lots of shitty, shitty, and corrupt, and shitty airports.",
            "I have mixed feelings about CDG. Incredibly confusing to navigate if you want to get to the train station or take a hotel shuttle bus, things aren't particularly well signed and you can feel like you're going around in circles. However, I do find the interesting range of destinations and the massive, curved departure board by the RER trains to make CDG quite an exciting experience. \n\nAs a London based person, LHR is a mixed bag for me - love travelling from T5 given the architecture, light and high ceilings. Very much dislike T3 which is like being in some underground bunker.\n\nIn London, Gatwick and Luton are the ones I like less - always seem to go to the wrong part at Gatwick, and its big enough to be tiring to get around without giving you that 'exciting' feeling you get from a major international hub. Luton is just quite depressing. \n\nOutside the UK, these are the ones I've liked least: \n\n- Portland (USA): Confusing, loads of building works, garish carpets everywhere. \n\n- Charleroi (Belgium): Claims to serve Brussels but nowhere near it. Make you wait in a kind of makeshift tent for the shuttle buses to Brussels. Very cheap vibe. \n\n- Marseille (France): Poorly served by public transport from city and chaotic. A lot of the areas don't have toilets once you've passported out of the Schengen zone and therefore cannot go back, which led to one quite uncomfortable experience once... \n\n- Tours (France): Awkward to get to if not driving as the tram line inexplicably doesn't reach the airport despite heading in that direction. Nothing to be had once inside the airport apart from one poorly stocked vending machine.\n\nBut to balance that out I'd quickly go through my favourites: \n\n- City (London, UK): Small, quick, modern, it's on the DLR. \n\n- Southend (London, UK): So few flights you can get from airport entrance to gate in 5 minutes. \n\n- Edinburgh (Scotland, UK): Exactly what a smaller airport should be like - plenty of amenities and you're never far from your gate so no last minute rush. \n\n- Rodez (France): Only has about 5 flights per day in summer and less than 1 out of season. But it has a white tablecloth, 3 course meal restaurant with views onto the runway and for that it'll always be one of my favourite airports. \n\n- Wroclaw (Poland): Modern, clean, simple, pleasant. Doesn't feel like an airport with predominantly budget flights\n\n- Copenhagen (Denmark): Interesting design, modern, so much good and interesting food.",
            "You’re all wrong. Manila gets the grand prize",
            "Lisbon airport sucks ass.",
            "Shanghai Pudong, particularly the new satellite pier of T1. No a/c or air flow, ceiling lighting kept flickering or switching on/off every minute or so, nothing except Starbucks and luxury goods stores open, rude staff (both airline and security), nothing for kids to do.",
            "Among countries that should do better: \n\nWashington Dulles (IAD). God what a shithole. Most inefficient airport ever.",
            "Mexico City is the worst.  “Your gate has been identified.  You now have three minutes to get to your gate which is 500 yards away and jammed packed with people.  GO!”",
            "LAX. The traffic to get in and out is so henious… and I was there picking up my luggage once and on the speakers was a recorded message about how lax is a world class airport and there were feces on the floor in the middle of baggage claim. I wasn’t convinced.",
            "Cairo Airport. Lots of security which slows things down significantly. Very slow check-in processes. The terminal is very dark, ugly, and depressing. More security to go through to get to your actual gate. Just a very uncomfortable and unpleasant airport.",
            "LAX and DEL were both kinda ass. The entrance area of DEL is so fucking stuffy its unbearable, and security was stupidly tedious (they made me take out anything and everything with wires). LAX is just ew. I hate the domestic terminal at LAX with a burning passion"
        ]
    },
    "U.S. passport expiring in 3 months, and I need to travel to India asap (this weekend) to attend my father's funeral. I have an OCI. ": {
        "title": "U.S. passport expiring in 3 months, and I need to travel to India asap (this weekend) to attend my father's funeral. I have an OCI. ",
        "score": 3,
        "url": "https://www.reddit.com/r/Flights/comments/1dr1z6x/us_passport_expiring_in_3_months_and_i_need_to/",
        "content": "I am so confused by all the websites. The consulate and U.S. travel website say the passport must be valid within 6 months of visa application, not travel. \n\nThe flight that I'm booking is with Turkish Airlines. So I would fly from the U.S. to Turkey, and then from Turkey to Mumbai. Please help, thank you",
        "num_comments": 2,
        "comments": [
            "**Notice:** Are you asking for help?\n\nRead the **[top-level notice about following Rule 2](https://www.reddit.com/r/Flights/comments/vnkeek/rule_2_will_be_enforced_your_post_will_be_removed/)**!\n\nPlease make sure you have included the **cities, airports, flight numbers, airlines**, and **dates of travel**.\n\nVisa and Passport Questions: **State your country of citizenship / country of passport**\n\nAll mystery countries, cities, airports, airlines, citizenships/passports, and algebra problems will be removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Flights) if you have any questions or concerns.*",
            "http://traveldoc.aero"
        ]
    },
    "Question about carry-on policy adherence for connecting flights in Seoul with different policies on connecting legs": {
        "title": "Question about carry-on policy adherence for connecting flights in Seoul with different policies on connecting legs",
        "score": 1,
        "url": "https://www.reddit.com/r/Flights/comments/1dr6vvy/question_about_carryon_policy_adherence_for/",
        "content": "*Dates*: August 8–9, 2024. *Cities*: DFW–HAN, connecting in ICN Seoul.  \n*Leg 1*: KE 5032, operated by AA 281. *Leg 2:* KE 455.\n\nI've booked a route on [KoreanAir.com](http://KoreanAir.com) on a single ticket. Leg 1 (DFW–ICN) is operated by American Airlines, which gives 1 carry-on item + an additional personal item, neither of which have any weight limits. Leg 2 (ICN–HAN) is operated by Korean AIr, which only allows for 1 carry-on item with a max of 10kg.\n\nWhat's gonna happen to my carry-ons when I transfer at ICN from the AA plane to the Korean Air plane with a backpack and a carry-on suitcase, with total weight of probably 25kg? \n\nI'm moving permanently for work and the extra AA carry-on policy, with no weight limit, would really help. I've read posts on Reddit that say you have to follow the strictest carry-on policy of all the legs...\n\nWith that said...From your experience, do the gate agents for Korean Air really care what you're bringing on the plane – or do gate agents typically turn a blind eye, assuming all passengers' carry-ons have been \"cleared\" back at the check-in desk? Honestly, I'm kinda hoping  since the first marketing carrier, AA, has more generous carry-on policies, the gate agents will just allow me to continue onwards at ICN. Or will Korean Air force me to abandon a carry-on bag behind in the airport?\n\n**Update**: I contacted American Air about this over Twitter, and American said:  Firstly, we're the First Marketing/Operating carrier and our baggage rules will apply for the entire route to HAN. We don't charge for carry-on bags. In fact, there isn't a weight limit, and you're permitted one free carry-on bag and one personal item bag at no cost.\" However, I also contacted Korean Air and they maintain I'll have to follow their 1-piece, 10-kg carry-on policy for both flights, including the AA leg.",
        "num_comments": 1,
        "comments": [
            "**Notice:** Are you asking for help?\n\nRead the **[top-level notice about following Rule 2](https://www.reddit.com/r/Flights/comments/vnkeek/rule_2_will_be_enforced_your_post_will_be_removed/)**!\n\nPlease make sure you have included the **cities, airports, flight numbers, airlines**, and **dates of travel**.\n\nVisa and Passport Questions: **State your country of citizenship / country of passport**\n\nAll mystery countries, cities, airports, airlines, citizenships/passports, and algebra problems will be removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Flights) if you have any questions or concerns.*"
        ]
    },
    "Wizz Air Vouchers?": {
        "title": "Wizz Air Vouchers?",
        "score": 0,
        "url": "https://www.reddit.com/r/Flights/comments/1dr6iq7/wizz_air_vouchers/",
        "content": "Anybody has any Wizz Air promo codes/voucher?\n\nThank you!",
        "num_comments": 1,
        "comments": [
            "**Notice:** Are you asking for help?\n\nRead the **[top-level notice about following Rule 2](https://www.reddit.com/r/Flights/comments/vnkeek/rule_2_will_be_enforced_your_post_will_be_removed/)**!\n\nPlease make sure you have included the **cities, airports, flight numbers, airlines**, and **dates of travel**.\n\nVisa and Passport Questions: **State your country of citizenship / country of passport**\n\nAll mystery countries, cities, airports, airlines, citizenships/passports, and algebra problems will be removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Flights) if you have any questions or concerns.*"
        ]
    }
}