{
    "Self-Promotion Saturday": {
        "title": "Self-Promotion Saturday",
        "score": 1,
        "url": "https://www.reddit.com/r/flying/comments/1dr7tab/selfpromotion_saturday/",
        "content": "Do you have a Youtube channel, Instagram account, podcast, blog, or other social media thing you'd like to promote?\n\nThis is the time and place!  Do remember, though, that [rule 2 (\"keep it relevant to pilots\")](https://www.reddit.com/r/flying/wiki/sub_rules#wiki_rule_2) is still in full effect.\n\nMake a comment below plugging your work and if people are interested they can consume it.",
        "num_comments": 0,
        "comments": []
    },
    "As reality sets in for many of you, here are some hot tips.": {
        "title": "As reality sets in for many of you, here are some hot tips.",
        "score": 92,
        "url": "https://www.reddit.com/r/flying/comments/1dr7ovo/as_reality_sets_in_for_many_of_you_here_are_some/",
        "content": "Wow, the last 3 years have been amazing. Many of us are still in disbelief it was even happening the way it did. Let’s go over a few of the new/old expectations. \n\n1. 1500 hours is not longer the gateway to getting that sweet CRJ/ERJ job. It’s mostly just the FAA minimum and companies are now (probably) going to require more time.\n\n2. Yes, take the job flying the twin or jet. Turbine and multi time will probably soon become standard resume basic requirements to be on top again.\n\n3. Go after those resume hot ticket items: PIC, PIC Turbine, Check Airman, OE Captain, Chief Pilot, Director of Operations, Assistant Chief Pilot etc.\n\n4. Never be above pushing a broom. A little humility in the attitude can go a very long way.\n\n5. Keep those friends and contacts up to date. Some of the best jobs you’ll have will come from someone remembering your name.\n\n6. College degrees are probably going to be a requirement again soon. Probably. It’s silly.\n\n7. Contracts. Well, they’re not new and the ones you’re looking at now are quite good compared to the last decade. I’m not advocating that you sign them, but think very hard about where you are in your career. Someone who signed that Republic contract has almost 2 years flying the EMB-175 at a 121 airline while the person who didn’t might be flying a Citation CJ 2 as an SIC for a part 135/91 company while both are still wanting to fly for a legacy airline. One of those candidates has a better chance. Weigh your options. \n\n8. GO HAVE FUN! We all (most) got into this because we have a passion for flying airplanes. Sure, it may not be the big jet but, the point was to get paid to fly. \n\nDid I forget anything?",
        "num_comments": 58,
        "comments": [
            "Patience. To those that made into that sweet RJ job, enjoy it. You're still getting paid to fly. Decent and livable money too. You're seeing some of the best places America has to offer. You what overnight isn't at fun as you'd think it is? Orlando. Downtown MCO is no more fun than downtown Phoenix or Houston. Stay by the parks and it's a giant tourist trap that charges twice as much for literal meals at Applebees and has kids screaming up and down the hall all evening. A lot of big city downtowns have little to offer over some medium sized city that are often full of charm. You know what is an awesome downtown? Des Moines. Huntsville. Moline. Augusta. Bloomington. Enjoy your free breakfasts you won't be getting them at a legacy (sure you'll get fed on the plane though), $2 beers and low cost of living overnights. Because Las Vegas is gonna 5x the price. Enjoy flying with people your own age because when you come to a Legacy, you're gonna be hanging out with a bunch of 62 year old curmudgeons. Youll very rarely interact with the FAs. Youll have little camaraderie. You'll get here eventually. You will. But understand that the folks who flew CRJ for nine months and then got a widebody job at United are the exception of the rule. Going to a regional for 4-7 years isn't a bad deal.",
            "To add to this, this isn’t the beginning of a new dark decade, it’s not even close, this is a merely a blip on the radar as things just settle in. Every legacy airline will continue to retire 300-500 or more pilots per year, it’s inevitable, people can’t stop time and aging.",
            ">College degrees are probably going to be a requirement again soon. Probably. It’s silly.\n\nIt's also a really good idea to have in your back pocket in case something happens to your ability to hold a medical certificate.",
            "As a retired legacy pilot I have watched the goldrush characteristics of the past few years with chagrin. The cyclic nature of aviation careers is historically wicked. I started in meager times and although I pushed hard luck was probably crucial. But what kept me pushing wasn't dreams of free days and bags of money.  The last tip from OP is crucial to continue, because you want to have a job flying, for the love of flying.",
            "Is PIC turbine better than PIC multi(piston)? I notice many 135 jobs require multi but not turbine. Thoughts? There are many jobs requiring both, but for those of us approaching 1500 I notice for applicable jobs Multi might be better.",
            "Don't forget paying for your own ATP CTP. Envoy, netjets, etc does it",
            "I’m a fresh CPL working on CFI and I refuse to be deterred by all the negative nellies on here complaining about the job market. I don’t care what I’m doing as long as I’m at least 1 foot AGL I’ll be happy!",
            "As someone who has a decent career but is wanting to fly for a living, how do the regionals/91/135 jobs compare to a standard 9-5?",
            "I'm going to fly for a living regardless of if I have to be a CFI for 10 years or not so IDGAF",
            "Felt like a shot across the bow to anyone that flew a corporate aircraft in your your 7th step there"
        ]
    },
    "CJO -ATP CTP & Boom CJO Cancelled.": {
        "title": "CJO -ATP CTP & Boom CJO Cancelled.",
        "score": 113,
        "url": "https://i.redd.it/rfeb86g2ff9d1.jpeg",
        "content": "CJO in March. Sent on company dime to ATP CTP in June ATP passed. Class date pushed two weeks. Then class and CJO cancelled indefinitely. Will need to start from square 1 if they decide to hire again in the new year and I haven’t found another job. \n\nNot a lot of good news right now. Thanking god I still have my non-flying job and didn’t quit. \n\nKeep your heads up sailors. The storm is always worse before it gets better. This was like putting rubbing alcohol on a cut today but I’m going to remain positive and trust the plan from the man upstairs. The world owes me nothing. \n\nThanks for the free ATP! \n\nBlue skies to all in MOD / Severe Turbulence at the moment. ",
        "num_comments": 46,
        "comments": [
            "Thought for a minute you had a CJO with Boom, the company working on making supersonic airliners and I was going to ask you how you snagged that gig haha.",
            "I like how you censored their logo on the top but didn't censor it in the body lol\n\nThey sent you to get your ATP before training? Or did you mean CTP?",
            "So we've had JetBlue, American, all three AA regionals, and Mesa stop hiring in just the last week.",
            "Gee, I wonder what airline this is! I can't tell because the logo is 75% blacked out and it didn't mention the airline in the body. Is this Mesa?",
            "Why wouldn’t they roll the CJOs or hold them till hiring again? Seems inefficient to put everyone on both sides of this through the process again.",
            "It just keeps getting worse and worse",
            "So many new pilots in this industry forget what the C in CJO means. Nothing is promised until your ass is sitting in training. Even then, you could be the MESA FO who completes training and gets furloughed with less than 12 months on property. \n\nI’m happy OP at least got their ATP/CTP completed and paid for. You walked away with something in hand, before getting f*****.",
            "Bro scribbled for no reason",
            "Don’t worry! Delta is hiring more pilots this year than like more than most of the last 20 years! The pilot hiring wave is still going strong!! /s",
            "Glad they decided BEFORE you showed up to class. Get updating your app everywhere else. Show up for meet and greets. Network networ network!"
        ]
    },
    "Southwest takes off on a NOTAM’d closed runway in Portland, Maine - possibly overflying vehicles performing a runway inspection": {
        "title": "Southwest takes off on a NOTAM’d closed runway in Portland, Maine - possibly overflying vehicles performing a runway inspection",
        "score": 399,
        "url": "https://avherald.com/h?article=51a74085&opt=0",
        "content": "By NOTAM, the runway was closed until 5:45 AM local and the takeoff occurred only two minutes prior. The tower was closed at the time. Apparently, airport ops asked the tower controller if they could reach the SWA flight when the tower opened and claimed the flight flew over them. \n\nIt seems like there were quite a few threats here: runway closures, non-towered airport ops, and a very early start time. \n\nHave you ever caught some big “gotchas” when flying in/out of non-towered airports? ",
        "num_comments": 178,
        "comments": [
            "The NOTAM I saw said it was not fully closed, just to takeoffs. It was open for taxi and crossing. Guessing the barricades/closure lighting were minimal in this case.",
            "I get that the NOTAM system is bad. The real issue here is SWA not following established procedures at a non-towered airport. A single broadcast on the CTAF would have alerted them to the closed runway.",
            "I can see missing the NOTAM but did they not broadcast on CTAF? Presumably airport ops would be monitoring the freq.",
            "My guess:\n\nA fatigued flight crew running on 5.2 hours of quality sleep and excess caffeine due to an aggressive work schedule missed the NOTAM. It’s a shame companies refuse to acknowledge that fatigue costs them money too.",
            "NOTAM system sucks, yes. As a regional CA I had a couple experiences missing important ones and that was all I needed to take as much time as I need on each flight to go over them thoroughly. Occasionally when other stuff is going on that means we block out late, maybe 3 or 4 minutes later than if I just skimmed the NOTAMs. I’ve never “blamed” a late departure on reading NOTAMs but maybe I should start. If a bunch of us did it they’d fix the system.",
            "The airport I fly medevac out of is doing construction along the sides of the larger runway and only had the larger one notam'd closed. Turns out they decided to \"close\" the smaller one too and start working on that one while driving across it haphazardly but they didn't put X's up and \"forgot\" to issue the NOTAM as well. I put forgot in quotations because it is an unacceptable mistake in my opinion. Crews had no radios. Potential accident was waiting to happen for sure. Whether it was debris left on the runway or some clown speeding across it in a truck without looking both ways. Of course the NOTAM then goes out at 8:46 when I called asking what was going on instead of a more normal time like 7:30 or whatever. Later when I called the foreman to get it back opened up for my return flight (manager gave us prior permission for med flights) he was asking me if I knew why there was a helicopter doing touch and goes on the \"closed runway\". I had to explain this is why putting NOTAMs out sufficiently early before people take off is important and also visual markers depicting that it is in fact closed....",
            "Why can't ground-based NOTAMs be reflected on taxiway diagrams generated by ForeFlight? Like if TWY G, RWY 18/36 are closed, there should be an overlay that shows them in red or with big X's.\n\nNot to say that missing the NOTAM is excusable, and not saying that NOTAMs should be replaced by this, but it seems like a very easy thing to implement. Basic human factors.",
            "Busted out on short final to see the runway covered with cop cars and cones. Training day for the department but no one bothered to tell anybody they were taking over an active airport runway on a low ceiling day.  That was a fun conversation with ATC.",
            "I have nothing to add here other than NOTAMs suck.",
            "I did the 530 flight out of PWM multiple times this month. The automated weather does have the runway on it advertised as closed.  There’s maybe 4-5 jets that leave before the tower opens. Republic with a delta and United and a few others. They all talk on the CTAF on the way to the opened runways. Not sure how SWA fucked up this badly."
        ]
    },
    "Airline pilots, how many hours do you work a month? ": {
        "title": "Airline pilots, how many hours do you work a month? ",
        "score": 75,
        "url": "https://www.reddit.com/r/flying/comments/1dr12n5/airline_pilots_how_many_hours_do_you_work_a_month/",
        "content": "Curious",
        "num_comments": 116,
        "comments": [
            "Flight hours? Duty hours? Credit hours?",
            "What's your definition of working?\n\nI *fly* ~60ish hours. I *work* 13-15ish full days.",
            "I am on OE and haven’t worked in 6 weeks. Don’t expect to work for another 4 or so. I’m gunna drive myself crazy here soon.",
            "Legacy, live in base, reserve. I work about 8-12 days per month. Around 3-5 nights in a hotel and get 73 hours",
            "I shoot for 75-80hrs of pay with 17-18 days off lol",
            "Jan thru May I flew 26hours and was gone 7 days. Reserve life.\n\nNow a line holder flew 62h, gone 14 days.",
            "Some fly a lot some fly a little.  Depends where you are and how much flexibility you have to pick up/drop.  And of course your financial needs.\nEdit: to add a little more context what you really need to look at is contractual min days off. This typically ranges from 12-15 days off. I typically as a line holder end up with 18 days off.  I then trade the existing trips I have for as high of pay as possible.  Typically can credit 10-25 more just by trading for more efficient trips without adding days of work. That obviously means I fly more on those days I am working with short overnights. But I go to work to work not hang out at the hotels. Love the crews we have but far prefer spending my time with family on days off.",
            "Captain at a major low cost European carrier, in the UK we tend to live near our bases. For May I flew 36 sectors over 17 days, 100 flight hours,  149 duty hours, 1 night stop.",
            "75-80 a month. Mostly 3 flights a month giving me 9 days away from home. Dream job.",
            "I fly between 35 and 55 hours a month. Off or on call but not used for 19-23 days a month."
        ]
    }
}