{
    "Fallout 76: Skyline Valley PTS Update Notes - May 24, 2024": {
        "title": "Fallout 76: Skyline Valley PTS Update Notes - May 24, 2024",
        "score": 151,
        "url": "https://www.reddit.com/r/fo76/comments/1czt09r/fallout_76_skyline_valley_pts_update_notes_may_24/",
        "content": "We have released an update for the Skyline Valley Public Test Server (PTS). It's a small update today. \n\nIf you haven’t joined already, you can find the steps to [join the PTS here](https://bethesda.net/en/article/6bmiDUEEucXOhjF3jFIilg/inside-the-vault-skyline-valley-pts-part-1).\n\nThank you for your continued support!\n\nUpdate Note: \n\n- Made changes to how nukes interact with Skyline Valley Events\n\nI hope you all have an amazing and relaxing weekend! ",
        "num_comments": 92,
        "comments": [
            "Can we get an update that fixes the fuckin constant game crashes on consoles? Its at least 2x per hour or mpre if you get into an event",
            "I just want an update that says meat week will prioritize unlearned plans before you start getting duplicates, the list, is getting long :')",
            "Are the devs going to add an option in the settings menu to disable the visuals from explosion effects like the Cremator? Thanks.",
            "Does anyone know how long the new content is ? Talking more like missions / story stuff. Not all the new side stuff. Really hope it comes out early June, because Elden Ring DLC is end of June.",
            "I just want to know … can we cook the turkeys ?",
            "So… what exactly changed with the nukes? Were they killing players during the two events, or was something else wrong?",
            "Will the 'Skyline' update coincide with the start of next season + new scoreboard?",
            "QOL suggestion: Add more audio sounds customization:  \n- your character sounds  \n- other players characters sounds  \n- NPCs/enemies  \n- explosions/gunshooting/receiving dmg  \n  \n I would love to decrease particular sounds like \"receiving damage\" of my character and also nearby players. It gets really noisy and weird with all of them moans and ouches and heavy guns spinning fast. I usually play in the night, so my gf have some background noise or music to fall asleep to, but not that type of chaotic noise during any event or dops/expeditions :/\n\nAlso extra QOL: possibility to tweak/turn vats critical highlight screen and sound. When we play 33 luck, we get crit every shot and this flashes screen a bit too much/too fast",
            "All I beg for is a buff to the Strangler Heart PA",
            "Does anyone know if this will add more achievements to the game like the other DLCs did?"
        ]
    },
    "FALLOUT 76: SKYLINE VALLEY RELEASE NOTES": {
        "title": "FALLOUT 76: SKYLINE VALLEY RELEASE NOTES",
        "score": 510,
        "url": "https://www.reddit.com/r/fo76/comments/1deb3ea/fallout_76_skyline_valley_release_notes/",
        "content": "Welcome to Skyline Valley! Our first map expansion of the Appalachian region. Explore this new mysterious location, uncover the true location of Vault 63, and figure out the truth behind the Lost. Read on for a full list of patch notes.\n\n# Update Highlights\n\n* **Map Expansion** — Venture south into Skyline Valley, in the heart of Shenandoah National Park, and solve the mysteries behind the ever-raging storm shadowing the region.\n* **New Questline** — Uncover the true location of Vault 63 to meet its residents while you discover the secrets of the storm and the Lost.\n* **New Public Event** — Help the thrill-seeking storm chasers get the best picture of the Storm by protecting them from the elements, The Lost, and nearby electro-charged creatures.\n* **New Region Boss** — Face off against a new, massive threat that only the combined power of the Wastelanders can overcome.\n* **New Ghoul Type** — Meet the Lost. Those who dwell in Skyline Valley. Electrically supercharged ghouls that have been driven mad. Find out why.\n\n# Update Version [1.7.12.10](http://1.7.12.10) & Sizes\n\nCheck the download sizes below for today’s update on your platform of choice:\n\n* **PC (Steam)**: 27.6 GB\n* **PC (Microsoft Store)**: 40.3 GB\n* **Xbox**: 40.2 GB\n* **PlayStation**: 40.03 GB\n\n# Skyline Valley\n\nWelcome to Skyline Valley! Our first map expansion of the Appalachian region. A mysterious location that is covered by a storm unlike any that have been seen before. There are new locations to discover, characters to meet, secrets to unveil, as well as more locations to build your C.A.M.P.S!\n\n# An Unlikely Invitation\n\nAfter finding the true location of Vault 63 you’ll work with its leaders to unravel the mystery behind the Storm and The Lost. Throughout this questline you’ll discover the mystery behind the Lost, meet new characters, and make gut-wrenching choices about the fate the residents of Vault 63.\n\n# Dangerous Pastimes\n\nThis wicked storm raging above Skyline Valley isn’t going to keep these thrill-seekers away in the new Public Event! Help a group of settlers/tourists capture the best pictures of the Storm by protecting them from nearby Lost and electrically charged creatures. They’re joy stealers, make sure they don’t crash the party.\n\n# Neurological Warfare\n\nWhile exploring Skyline Valley, you may get the inclination to nuke the region. These actions are not necessarily encouraged, but they’re not discouraged either. Guess you’ll just have to find out what happens.\n\n# Combat Rebalance Work\n\nWe are beginning a series of combat updates that are aimed to improve your experience. We’re starting this process with today’s update by making some changes to Creatures and Weapons. Our goal is for these changes to have positive effects on combat throughout the entire game.\n\nTo help set expectations, we expect these changes to take effect in a variety of different places (Weapons, Creatures, etc.) across multiple patches. Giving you all a lot of time to provide feedback on the adjustments being made to ensure we’re moving in a positive direction.\n\n# Season 17 – Pioneer Scouts\n\nThe sun is out and it’s time to head on over to Summer Camp. There’s much to learn and do at the Pioneer Scouts sleepaway camp!\n\nSeason 17 Trailer: [https://www.youtube.com/watch?v=kPjH83FSqjQ](https://www.youtube.com/watch?v=kPjH83FSqjQ)\n\nCheck out our \\[Season 17 – Pioneer Scouts article here!\\](https://fallout.bethesda.net/en/article/2NqJZC9zmanyihEhnGwe1d/fallout-76-season-17-preview)\n\n# Fixes & Improvements\n\n# Art\n\n* Muni Operator Outfit Now Looks the Same When Previewed & When Worn\n\n# C.A.M.P.\n\n* **Workshop**: Enlightened Mothman Lantern should no longer display the premium icon and can be repaired individually when destroyed\n* **Workshop**: Fluttering Moth no longer takes up CAMP Light budget\n* The Sacred Mothman Tome camp item now has candle flames\n* Nuka world radio will now correctly sync across clients\n\n# Gameplay\n\n* **Power Armor**: Fixing a state players could get in where they could no longer craft Union Power Armor when they should have been able to\n* **Power Armor**: Union Power Armor will no longer drop as loot from enemies but can be rolled from The Purveyor if the recipe or entitlement is known by the player\n\n**Dev Note**: With this fix Union Power Armor is now craftable for players who have bought and learned the recipe from Giuseppe or by players who earned the Union Power Armor entitlements in Season 10.\n\nIf you do not have the plan for Union Power Armor, it can be purchased from Giuseppe who is upstairs with Bubbles at the Refuge. Once learned, they will no longer be able to be obtained.\n\nAdditionally, Union Power Armor pieces will not drop as loot even if you can craft the Power Armor pieces, but they can be found via the random Power Amor Purchases from Murmrgh at The Rusty Pick. Players should only see Union Power Armor Pieces that they know how to craft drop from Purveyor's Mystery Picks. Pieces that they have yet to learn will not drop\n\nUnion Power Armor pieces will still have the Atomic Symbol on them and cannot be traded or dropped by players once they have been obtained.\n\n* **Workshop**: Player who had learned to build the Atlantic City Poker and Blackjack tables but lost access to them should now be able to build them again\n* **Test Your Metal**: Robot Beer Stein Display Case will now properly drop from the Test Your Metal Event\n* **Moonshine Jamboree** Improved an issue which could block enemy pathing during the event\n* **Fasnacht**: Masks of all tiers will correctly drop upon event completion\n* **Fasnacht**: Improved spawn rates of Honeybeasts\n* **Fasnacht**: Added a Donation Basket near the event! Share your repeat masks with other players\n* **Fasnacht**: Marchers now start walking to the parade start immediately when their task is completed, without needing to wait for their dialogue line to be finished\n* **Fasnacht**: Increased the walk speed of the Marchers\n* **Fasnacht**: Will now randomly pick between 5 possible end boss encounters\n* **Yao Guai Pastry**: Now counts as a cooked meal for the \"Eat a Cooked Meal\" challenge\n* Applying the Reflex Sight to the Enclave Pistol with a Flamer Barrel attachment now shows the Decrease in AP Consumption in the STATS Menu\n* Hot Rod On Blocks & Overgrown Vehicle no longer spawn damaging nuke explosions when destroyed\n* Fixed an issue which could cause players to get stuck while turning the spit in Meat Week\n* Fixed an issue with the Damage Reduction effect on the Endangerol Barrel that allowed it to stack multiple times on a target\n* Nuka Shank now requires glass & cloth to be crafted rather than oil\n* Updated mods for the Gauss shotgun, Gauss minigun and Gauss pistol to correctly require Science based perks to be applied\n* Updated the default barrel mod for the gauss rifle\n* Fixed an issue which could cause Fusion cores to appear empty when place in Power Armor\n* Players can now trade the Herdsman's Bell and Herdsman's Bell Rack to other players\n* Paddle Ball now displays the correct ammo type when inspected\n\n# Weapons\n\n* Increased the base damage of the Alien Blaster and Cryolator\n* Fixed an issue with how damage was calculated for the following weapons/mods: Auto Axe, Chainsaw, Minigun Shredder mod\n* Increased base damage for the Auto Axe\n* Adjustments to Electric/Electrified, Burning, and Poisoned mods for the following weapons: Auto Axe, Mr Handy Buzz Blade, Chinese Officer Sword,  Shepherds Crook, Sheepsquatch Staff, Sheepsquatch Club, Hatchet, Assaultron Blade, Revolutionary Sword, Baton, and Vault 63 Shock Baton.\n\n**Dev Note**: These weapon mods now evenly split their damage between Physical and Energy/Fire/Poison, and damage has been adjusted to account for damage being split between multiple damage types.\n\nThe Cattle Prod has also received a similar change - its damage has been adjusted and is evenly split between Physical and Energy damage. These adjustments generally represent an increase in damage dealt.\n\nWe have also improved how we calculate the falloff for weapon damage at range. We expect this to smooth out the falloff damage for weapons that historically lost most of their damage right away. All ranged weapons benefit from this, but it should be most visible with Shotguns and Pipe Guns, as well as when fighting larger creatures such as Deathclaws.\n\n# Localization\n\n* Fixed Various Typos\n* Fixed Some Dialogue\n\n# Quests\n\n* **Honor Bound** Fixed an issue where Vin could become hostile to the player\n* **One Violent Night**: Fixed an issue where the Nightstalker's VFX would be applied to players multiple times, creating an extremely intense effect\n* **\"Bots on Parade\" and \"A Real Blast\"** Fixed an issue that caused the objective to complete before the correct number of hostiles were defeated.\n* **\"Distant Thunder\"** Increased the objective radius to more accurately reflect the area in which Scorched can appear\n* **Hell's Eagles** Fixed an issue that would allow players to start the quest again after completion. We also removed the second broken quest from players in this situation\n* Regent of the Dead: Jordy no longer continuously starts dialogue with the player if the player exits dialogue with her before resolving the confrontation.\n* The quest Miner Miracles now starts correctly when interacting with the Garrahan Excavator Poster\n\n# UI\n\n* Items now display how much they will weigh when being placed in a character's stash\n* Score notification will no longer remain visible on ultra-wide monitors\n* Fixed an issue which would cause \"You have joined a team\" to remain visible on some super wide monitors\n* Added Height indicators for quest targets and NPCs to the Power Armor UI\n\n# World\n\n* Raider NPCs from the Coop will no longer spawn as legendary\n* The following creatures have received balance changes: Angler, Cave Cricket, Floaters, Gulper, Mutant Hound, Protectron\n\n# Miscellaneous\n\n* Fixed some dialog inconsistencies\n* Broken ProSnap Deluxe cameras will no longer appear in vendor inventories.\n* Fixed some directional prompts for Tax Evasion\n* Fixed an issue which could cause audio to cut out on some expeditions.\n* Green Thumb, Backwoodsman 4 and Verdant Season should now work on a broader selection of plants\n* Fixed an issue which would cause players to crash if they logged out during character generation\n* Fixed some cases where turret-mounted laser weapons weren't triggering the Electric Absorption perk\n* Updated “Complete Any Expedition” and “Complete Any Atlantic City Expedition” challenges to include the new Atlantic City mission from the America’s Playground update",
        "num_comments": 415,
        "comments": [
            "This is a list of links to comments made by Bethesda employees in this thread:\n\n\n* [Comment by Ghostly_Rich](/r/fo76/comments/1deb3ea/fallout_76_skyline_valley_release_notes/l8blsef/?context=99 \"posted on 2024-06-12 20:13:16 UTC\"):\n\n > It's me, I'm the problem. 😁\n\n\n---\nThis is a bot providing a service. If you have any questions, please [contact the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ffo76).[](#AUTOGEN_TSBREPLIEDBOT)",
            "Cave Cricket balance? They're not the ultimate weapons of mass destruction anymore?",
            "Thank god they made the fasnacht marchers move faster",
            "Not surprised the Endangerol was nerfed but it was nice while it lasted. I see atoms are a repeatable reward on the last bonus page too!",
            "*Fasnacht: Masks of all tiers will correctly drop upon event completion*\n\nSooooo does that mean the drop rates were bugged? And that's why I never saw a glowing mask after 150+ completions?",
            "Alien and Cryloator Buff!!!",
            "\"Items now display what they weigh when placed in a characters stash\" does this mean the actual weight so I don't have to go into my crafting build and pull off my backpack to do stash weight maintenance. Thats amazing!!!",
            "*takes out his vampire autoaxe*\nYou mean this one does even more damage now?😅",
            "> Fixed an issue with the Damage Reduction effect on the Endangerol Barrel that allowed it to stack multiple times on a target\n\nRIP.",
            "Finally fixing the Union Armor. I want my drops back"
        ]
    },
    "Being an awkward weirdo in my camp": {
        "title": "Being an awkward weirdo in my camp",
        "score": 183,
        "url": "https://www.reddit.com/r/fo76/comments/1dlsvd4/being_an_awkward_weirdo_in_my_camp/",
        "content": "I’m sure I’m not the only gamer to have social anxiety in real life but it made me laugh to realise I’ve found a way to be awkward in gaming too. \n\nWhen other players visit my camp while I’m there, I don’t know what to do with myself. It’s like when you’re having work done in your actual home and you don’t know where to go while the plumber is in your kitchen so you kind of hover about in other rooms like a weirdo. \n\nI’ll maybe give them a wave, then go and sit in my little kitchenette (the players, not the plumber). \n\nWhat’s everyone’s go to behaviour around camp visitors? ",
        "num_comments": 139,
        "comments": [
            "I jump on a workbench and pretend to look busy",
            "I play my theremin to show how cool of a dude I am.",
            "Asserting dominance by removing my armour and clothes and just stare at them from the porch.",
            "I always emote hi and then just stand there checking out folks that run around checking out my camp.\n\nI move a lot of apparel for 10 caps and my favorite bit is when buyers are trying their new outfits right on the spot.\n\nOn some difficult days I might stay at my camp for the entire session. Stay at home dude built a home in a game to stay at, lol.",
            "Well let me gives you some steps to be a welcoming host.\n\nStep 1. Stare blankly into the depths of your guests soul. Smile as you do to indicate interest, but say silent.\n\nStep 2. When asked where the vending machine is located, kindly guide them there. While they shop, stand in silence as close as possible, and breath heavy. Remember to smile!\n\nStep 3. After they make their purchase, wish them a wonderful day. Keep smiling!\n\nStep 4. Follow them around for the next 30 mins to make sure they're satisfied with their purchase. Stay silent, and watch from afar. Don't stop smiling!\n\nStep 5. Wait the next day for their return. Appear in front of them and say thank you...with a smile on your face.\n\n  \nFollow those five steps and you will do just fine!",
            "This sounds just like me.",
            "I go into my shelter so they don't think I have a surprise trap camp and stand in there with my heart pounding until they leave\n\nThe only thing worse than that for me is the anxiety of going to somebody's vendor to check for plans I don't have, and realising I have everything... but they're standing right there. Suddenly it's a mad dash to find *something* I can buy so I don't feel rude, although on one occasion I pretended I just came to see their camp and they were so excited to give me a tour that it wound up being really wholesome lol. They even had a little gameshow set up where you had to find a code in their shelter and message them with it to get 1000 caps.",
            "As soon as they begin to do something, jump out the power armour,\n\nStrip down to underwear and the raider dungeon gimp mask and stand behind them with a black lubed baseball bat.",
            "I immediately fast travel away. Personally, when I'm visiting someone else's camp and then they're there, near the vendor, I feel pressured to buy something, anything, idk why. So in an effort to make others not feel that way I just immediately leave haha",
            "I jump on my mic and yell at them to get off my lawn"
        ]
    },
    "You can tell a lot about a person by what Commander Daguerre is dressed in at their camp": {
        "title": "You can tell a lot about a person by what Commander Daguerre is dressed in at their camp",
        "score": 165,
        "url": "https://www.reddit.com/r/fo76/comments/1dlrbv1/you_can_tell_a_lot_about_a_person_by_what/",
        "content": "title speaks for itself😶",
        "num_comments": 119,
        "comments": [
            "It's depressing because she's probably the best written quest companion by a fucking mile but then you get her back in camp and she just repeats the same 5 fucking lines while she harps on a banjo or piano or whatever instrument you have lying around.",
            "My ally is Adelaide so I have no customization options :(",
            "So far I have seen her in :\n\nSpace Suit\n\nSheepsquatch outfit\n\nRed Dress\n\nHer Underwear\n\nEnclave Officer\n\nBrotherhood who steal under suit thing (that all in one gimp suit they all like to squeeze into)\n\nCasual 50s wear\n\nGolf Outfit\n\nRatty Skirt\n\nI can always tell who she is because...........\"floating off in space....but...why?\" which makes me leave the camp as soon as possible.",
            "I always give her some nice dress and always found her naked later.. I don't know her obsession with nudity but she makes ME look like a pervert",
            "She is wearing the swimsuit in my camp,  I have her stationed at the bottom of my waterslide as a life guard",
            "Mistress of Mysteries Garb",
            "The only thing having Daguerre at your camp tells me is that you're either deaf, or live with someone so annoying that the repeated \"Just .. why?\"s and bitching about headaches *doesn't* make you want to ram a 2B pencil into your ear canal and rupture your own eardrums.\n\nDaguerre should've stayed in space.",
            "Formal enclave uniform.but she keeps taking it off and running around without clothes. Alas.a free spirit at heart. (Think it’s a loading issue).",
            "Bomber jacket here. It felt right for an astronaut.",
            "She never keeps the outfit on so she is normally walking around in her underwear when I show up."
        ]
    },
    "Expeditions can potentially drop you a 10th of your stash capacity (maybe more) worth of legendary star gear. We didn't have repeatable Expeditions when stash was 400 capacity. We also didn't have Eviction Notice. ": {
        "title": "Expeditions can potentially drop you a 10th of your stash capacity (maybe more) worth of legendary star gear. We didn't have repeatable Expeditions when stash was 400 capacity. We also didn't have Eviction Notice. ",
        "score": 115,
        "url": "https://www.reddit.com/r/fo76/comments/1dlr0uk/expeditions_can_potentially_drop_you_a_10th_of/",
        "content": "The stash being 1200 capacity is outdated when potentially a 10th of your stash can be earned every 8 minutes or less. Why are we just accepting dropping stuff on the ground? Wasting what we earn or find? It's way, way worse for people that don't have Fallout 1st. That's truly weight management 76 if you want to play this game a lot. Not to mention added events that drop a lot of junk, ammo and legendary star gear. I understand some players have no issue with stash space or dropping stuff. Some definitely do though. \n\nStash attachments/upgrades (Chems, food, ammo weigh 30%/60%/90% less. Weapons, armor, misc weigh 25%/50%/75% less), or making the stash 4000-6000 capacity (scrip is at 6000) are potential solutions I see. \nHaving the decision to keep or drop stuff is way better than having the need to accommodate the 1200 stash capacity. \n\nI have no idea, but maybe upgrade your stash using gold bullion. ",
        "num_comments": 102,
        "comments": [
            "It'd be nice if stored items got a weight reduction in the stash box.",
            "Most people hoard because they have jobs and don’t have hours to play till sometimes the weekend. If I hoard things then when I get on next time I don’t have to farm for hours for things that I need I can just do events and enjoy. Stash doesn’t need to be 5 bazillion lb limit but an upgrade would be nice. I have 1st and I only have maybe 5 weapons in my stash and the rest is chems,the food that’s in my freezer and the shop items. It’s ridiculous. If they think making the stash bigger will stop people from playing that is not accurate. I stop playing when I can no longer farm legendaries because my stash is full and no way to fast travel so it’s just a mess. And I have all maxed perks cards And excavator armor so far. So yeah it needs some kind of upgrade.",
            "It sucks but honestly the real culprit it the 500 scrip limit, if i want to run 100 expeditions in a day, and scrip em why tf cant i ? I still need to do community stuff for cores, and rng is pita so even with 500 core and mods u might only get scrip, raise the scrip limit and stash can stay as is, i keep 3 weapons in there rest is scrip for the day or few days.",
            "If they ever decide to up the stash capacity they'll probably only bump it up to 16 or 1700... something small and then call it a day.",
            "Vendor shouldn’t take up stash space",
            "How did you come up with that number? \n\nI've ran 4 or 5 in a row and didn't even fill my personal weight.  \n\nIt definitely wasn't 500-600 units...",
            "There should be % chance to get legendary modules by scraping items with stars.",
            "1200 would be fine if it was for weapons, armor and appereal only. Every stackable and non-spoiling consumable should have seperate stash like the ammo and scrap has.\n\nAnd yes it should be free for all.\n\nFallout first should have the tent, the monthly atoms and few unique cosmetics only.\n\nYes I play fallout first. Its stupid others get gatekeeped from basic convenience like stash size.\n\nIt is just a case of creating a problem, then sell the solution.",
            "One thing that they *might* settle for would be adding certain premium items that apply a weight mod to a certain number of items stashed inside of them.  For instance, a chem stash where you can store 100 weight worth of chems at 1/10 weight, even though that still eats up 100 weight from your shared stash.  It'd be similar to the Military Cryo Freezer applying a no spoilage mod despite sharing space with your main stash (from what I hear, anyway).",
            "I personally would prefer if active camps/accessible vault sections were able to be loaded with categorized items that have a direct effect on your stash.\n\n\nFridges reduce expiration speed.  Stash containers increase stash storage.  New categories would reduce \"weight\" of chems and armor and so on...\n\n\nIt would give greater purpose to building and a greater purpose to the shelters in particular.\n\n\nBut then again, I also think prefabs should also exist that come preloaded with certain items, for those who don't have a huge interest in building intricately."
        ]
    }
}