{
    "/r/Football Weekly Discussion Thread": {
        "title": "/r/Football Weekly Discussion Thread",
        "score": 9,
        "url": "https://www.reddit.com/r/football/comments/1dnoaol/rfootball_weekly_discussion_thread/",
        "content": " **Welcome to the Weekly Discussion Thread!** \n\n&#x200B;\n\nUse this thread for all your football-related discussions, questions, and tactical analyses. Whether you want to share your thoughts on recent matches, discuss player performances, or dive into the nitty-gritty of tactics, this is the place for you. \n\n&#x200B;\n\n \n\n**Guidelines:**\n\n1. **Be Respectful:** Remember that everyone has their own opinions. Keep discussions civil and respectful. Disagreements are natural, but personal attacks or offensive language will not be tolerated.\n2. **Stay On Topic:** This thread is dedicated to football discussions. While some off-topic conversations are okay, try to keep the main focus on the beautiful game.\n3. **Encourage Engagement:** If you see an interesting comment or question, feel free to respond and keep the conversation going. This thread is all about community interaction.\n4. **Share Insights:** Whether you're a seasoned fan or new to the sport, share your insights and knowledge. Help create a learning environment for everyone.\n\n&#x200B;\n\n \n\n**Discussion Starters:**\n\n1. *What was the standout moment from the latest matches?*\n2. *Which player do you think is underrated and deserves more recognition?*\n3. *Tactical Analysis: Break down a recent match or discuss your favorite team's playing style.*\n4. *Have any burning questions about football rules? Ask away, and let the community help clarify.*\n5. *Ticket Questions: Planning to attend a match soon? Need advice on getting tickets or recommendations for the best fan experiences? Ask your ticket-related questions here!* \n6. *Getting into Football: New to the sport or looking to deepen your passion for it? Share your journey or ask for tips on how to begin watching football, understanding the rules, or becoming a dedicated fan.* \n7. *Jersey Talk: Show off your favorite jerseys, discuss classic kits, or ask for recommendations on where to find the best gear. What's your all-time favorite football jersey?* \n8. *VAR or Referee Rants: Frustrated with the latest VAR decisions or referee calls? Vent your feelings here and discuss the impact on the beautiful game.*\n9. *Predictions: Share your insights on upcoming matches, player performances, or league outcomes. What are your bold predictions for the season?*\n\n&#x200B;\n\nPlease make sure to read our [latest important update](https://www.reddit.com/r/football/comments/16ph90m/important_update_for_rfootball_elevating_content/) before posting/commenting\n\n[Join us on Discord](https://discord.gg/football)",
        "num_comments": 12,
        "comments": [
            "Can someone explain to me why football doesn’t have a lead on-field referee with two in support. I think collaboration in the penalty area on potential fouls would be a good thing. Additional on-field refs would prevent the game from slowing down due to flopping.",
            "Who do you guys consider to be better, rivaldo or romario?",
            "What do you think is the best pair of central defenders of all time?",
            "Guys, i'm 13 and weigh 6-7 stones (yes i know i'm bri'ish)\n\nI just want some tips to be a pro footballer in the future,\n\nAny tips/advice?\n\n⚽⚽⚽⚽⚽⚽",
            "I don’t deny that France got off to a poor start at Euro 2024. But as a French, I think we’re still the favorite to win the trophy, and that we’ll beat our Belgian friends next Monday in the Round of 16.\n\n What do you think?",
            "after seeing Federico Valverde briefly as well as the position he often plays in (CM, RW), I now start wanting him to have similar playstyle to that of David Beckham (adding RM as alternative position, utilizing accurate long pass from deeper wide position as well as occasional incisive run from the side of the field).",
            "Is this a serious question? There's only 1 answer to that as he's by far the greatest player in the history of the sport. ",
            "I mean, Maldini and Baresi?",
            "Guys reply with \"RONALDO SUUUIIIIIIII\" if u like Ronaldo",
            "Beating Belgium doesn't mean anything. Even England could beat the Belgians. Wait until you play the Germans, that's when you get spanked. "
        ]
    },
    "Why do bookmakers put England as the biggest favourites to win the EUROs?": {
        "title": "Why do bookmakers put England as the biggest favourites to win the EUROs?",
        "score": 15,
        "url": "https://www.reddit.com/r/football/comments/1dr5yc1/why_do_bookmakers_put_england_as_the_biggest/",
        "content": "I think England is really overrated as being put as the biggest favourites of the tournament. Their CB line, goalkeeper and the central midfield isn't really that good. They still lack the creativity in the midfield and have problems in creating chances. This is the problem they've been having for a long time. I thought Jude might be that creative presence they need, but he is more offensively oriented and not that creative. His playmaker ability isn't on the top level like Kroos, De Bruyne, Modric few years ago or Pedri.\n\nAlso, while Harry is a fantastic attacker, he never won anything and he is a captain of the team. This is also a problem. \n\nI feel like France, Spain, Germany and Portugal have bigger chance to win. Although, England is now in the easier draw and thus might make it to the final again.",
        "num_comments": 91,
        "comments": [
            "Mostly it comes down to France, Spain, Germany and Portugal is on the same side of the cup brackett now. Which means all those 4 competes against each other for the final.\n\nEngland mostly only competes with Italy for their place in the final.\n\nThat means the odds are what they are at the moment. But that will change especially after semi finals are played.",
            "Their game approach is actually quite good for knockout games. It's extremely difficult scoring a goal against them, whereas they definitely got the individual quality to score at least one goal in 120 minutes basically out of nowhere.\nThis approach obviously doesn't work that well in a group stage setting against weaker teams who are happy with a draw after 90 minutes.\n\nSame could be said about France. However, in contrast to France, England got a much easier path to finals.",
            "Because loads of England fans put money on it so the odds shorten so that if they do the bookies don't lose out too much. England are almost always favourites because of this even when we were much weaker and other countries were much stronger. However, England has one of the best squads in the Euros and although they're misfiring I don't think its stupid to make them one of the favourites of the tournament even if you take away the bookmakers trying to limit their losses",
            "As an Englishman, I bet heavy against England on big games. \n\nIf we win, I am happy for the country. \n\nIf we lose, I am happy for a pocket. \n\nI like to make situations where I win either way. \n\nMicro Game Theory",
            "Because their side of the bracket is so easy compared to the other side and i think most people expect them to reach the final (me included)",
            "We wouldn't be favourite in a one off match against some of those teams.\n\nBut we have an easier path to the final, which is reflected in the odds. The other side of the draw has lots of strong teams and anyone can beat anyone, so that makes the odds longer.",
            "*English bookmakers. Each country is bet upon by local delusional people everywhere. Eventually, some of them turn out to be right, but the only real winner is the betting house.",
            "Can we please have a moratorium on any England related posts until the game please? It's all getting very, very tiresome",
            "A few reasons.\n\nWe are on the good side of the draw.\n\nBest defensive record \n\nThere's the hope the attacking side of our game might turn up lol",
            "Defensively they’ve been the best team in the entire tournament.\n\nNo team has a lower xG against them than England."
        ]
    },
    "Copa America 2024: Argentina coach Scaloni handed one-match suspension, won’t coach vs Peru": {
        "title": "Copa America 2024: Argentina coach Scaloni handed one-match suspension, won’t coach vs Peru",
        "score": 12,
        "url": "https://sportstar.thehindu.com/football/copa-america-2024-lionel-scaloni-handed-one-match-suspension-for-being-late-to-miss-argentina-vs-peru/article68346153.ece",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Aston Villa sign left-back Ian Maatsen from Chelsea for reported £37.5m fee": {
        "title": "Aston Villa sign left-back Ian Maatsen from Chelsea for reported £37.5m fee",
        "score": 2,
        "url": "https://www.theguardian.com/football/article/2024/jun/28/aston-villa-sign-ian-maatsen-from-chelsea-transfer-news",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "It's wild to think that in the last 15 years, only one ballon dor winner also had a world cup (Messi). Whereas in previous years alot of ballon dor winners won it in the year they lifted the WC (Zindane, Cannavaro, Ronaldo, Sammer etc).": {
        "title": "It's wild to think that in the last 15 years, only one ballon dor winner also had a world cup (Messi). Whereas in previous years alot of ballon dor winners won it in the year they lifted the WC (Zindane, Cannavaro, Ronaldo, Sammer etc).",
        "score": 176,
        "url": "https://www.reddit.com/r/football/comments/1dqd3ni/its_wild_to_think_that_in_the_last_15_years_only/",
        "content": "Who might be the next one?",
        "num_comments": 99,
        "comments": [
            "Nothing about having both Ronaldo and Messi in the same generation was normal. \n\n\nAs an aside in 15 years there’s only 3 or 4 world cups.",
            "Sammer didn't win the world cup, but he won the ballon d'or in 1996 - the year he won the Euros.",
            "3 world cups in 15 years,  \n2 of them won due to World Cup (Messi and Modric).",
            "1 in 4 is not exactly a big sample size",
            "It's wild to think that only Michael Owen has won the ballond dor and the intertoto cup",
            "Messi and Ronaldo were so far and above others in their generation when it came to individual abilities that it didn't matter who the star player of the World cup / Euros winning team was.",
            "R9 won it before he lift world cup in 97.",
            "Sammer won it when he won the Euros, not World Cup. It’s the Messi-Ronaldo effect that caused the change.",
            "Mbappe, Estevao/Endrick/Vinicus, Musiala, Yamal, Jude/Foden, probably the best shouts to win it next and also win the WC. Argentina, Netherlands, Portugal, don't really have a generational prospect right now to win BDO in my opinion.",
            "I know it’s just a typo, but Zindane is how jails were called back in times in Turkic world."
        ]
    }
}