{
    "The \"who should I manage\" megathread - FM24 edition": {
        "title": "The \"who should I manage\" megathread - FM24 edition",
        "score": 313,
        "url": "https://www.reddit.com/r/footballmanagergames/comments/17m4yg5/the_who_should_i_manage_megathread_fm24_edition/",
        "content": "If you're looking for a team to manage, a challenge to do, or you yourself have suggestions for teams/challenges for other people to do, use this thread to discuss.\n\nPrevious thread(s):\n\n- https://redd.it/qtns33\n\n- https://redd.it/uyxwa0\n\n- https://redd.it/yu8188",
        "num_comments": 2595,
        "comments": [
            "I'm thinking of doing the Ange Postecoglou challenge this year as an Aussie, or atleast my own flexible version of it.\n\n1. Start as a manager in the Australian A-League, I will be using the western sydney wanderers as they are my local team, match his trophy achievements.\n\n2. Move to a club in Japan, match his trophy achievements\n\n3. Move to a club in Scotland, match his trophy achievements\n\n4. Move to a club in the premier league & aim to win it all to finish the save!\n\nShould be a fun year on this year's game!",
            "Hertha Berlin. In the 2.Bundesliga now, they've got a handful of great youth prospects, and you should be able to get promoted fairly easily. \n\nQPR. Predicted rock bottom with a league one level squad, although they've got a few solid championship players (Chair, Willock, Dykes). \n\nSampdoria. Nowhere near as bad as they are doing in real life, promotion should be relatively achievable. Few good youth prospects and needs a bit of a squad rebuild upon promotion.",
            "Middelfart are a team in the lower divisions of Denmark. If you want a long save and a team with a funny name then look no further!",
            "I think that Málaga are a pretty good shout. Nice crest, good support, went from being seconds away from the UCL semi-finals in 2013 to now being in the third division.\n\nI did my first save with Málaga this year and it has been such a fun save. The team is miles better than any team in the third tier and, if you improve the squad with free transfers and loans, promotion in your first season in the second tier isn't impossible either.",
            "Kerry FC. Newly formed team in Ireland playing their first ever season after getting a licence to play in the Irish First Division. They have the youngest squad in the league and are predicted to finish bottom but they have a few quality attackers for the level they're playing at to help you compete in the first season. The goal is to turn them into the best team in Ireland, with transfer restrictions being nonexistent using loans and free transfers from England and Scotland at first then build a team of wonderkids, qualify for the UCL, something an Irish team has never done before and improve Irish soccer as the top league is rated 74th in the world.",
            "If anyone wants some clubs with cool badges in Italy…\n\nCalcio Foggia 1920 \n\nDelfino Pescara 1936\n\nCesena FC\n\nSo many others though.",
            "Here's a good shout that i am considering for my first save this year:\n\nReal Zaragoza. Big city in Spain, and their club used to be a good side in La Liga. They have however been in La Liga 2 for some time now. They seem to be on the verge of a resurgence now, setting a new club record with like 28.000 season tickets bought for this season. Has very good facilities and there should be plenty of chances of getting great homegrown talents.\n\nBut perhaps the best thing is that they have a lot of young prospects in the team that you can build your team around for many years. In defence you have Alejandro Frances (20) and Hugo Barrachina (16). In midfield you have Francho (22) and when you start the save you also got Luis Carbonell out on loan, a former Real Madrid prospect. But the gems are in attack, as you got Ivan Azon (20), Pau Sans (18) and Jano Monserrate (17). Not gonna spoil what their potential are, but all i can say is that they can be seen on lists of potential wonderkids.",
            "Fc Sochaux in France.\n\nThey use to be a very good club and even got to Europe multiple times. The last time was in 2012\n\nThen they dropped to Ligue 2, and they got money problems and are now in National.\n\nThe team is now mainly focused on youth, and the whole country thinks about them.",
            "Chester - Wrexham’s biggest rivals just across the border with an even more turbulent recent past ownership. Fan-owned so it’s like the antithesis of a sugar daddy save.",
            "FC Vaduz, in the Swiss league. They are however from Lichtenstein meaning they can’t qualify for Europe through the league. Winning the Lichtenstein cup gets you into the conference league, the only way to get into the Europa league is to win the conference & to get into the champions league you have to win the Europa.\n\nThis means that you have to win the conference, europa and then finally the champions league consecutively. If you are knocked out of either the Europa or champions league, you start from the conference again the following season"
        ]
    },
    "Weekly Help Thread - Ask your help requests here | Week Commencing 19/06/2024": {
        "title": "Weekly Help Thread - Ask your help requests here | Week Commencing 19/06/2024",
        "score": 3,
        "url": "https://www.reddit.com/r/footballmanagergames/comments/1djkaf8/weekly_help_thread_ask_your_help_requests_here/",
        "content": "Please use this thread as a place to ask questions that are specific to your save, such as:\n\n- \"Why is my tactic not working?\" \n\n- \"What role should I play this player in?\" \n\n- \"I have £xxm to spend, who should I buy?\"\n\nIf you are asking for tactical help/advice, please post an image of your formation and what insutructions/roles you have set.\n\nAs a rule of thumb, if you ask a question, answer a question. This is what keeps this thread alive and useful. \n\nAlso, please remember that the team suggestion thread can be found in the sidebar, so please use that and give your suggestions to people there too!",
        "num_comments": 55,
        "comments": [
            "Here is a list of questions in this thread that do not yet have answers. I update this list in real-time. Please prioritise these questions over others:\n\nQuestions - [1](https://www.reddit.com/r/footballmanagergames/comments/1djkaf8/weekly_help_thread_ask_your_help_requests_here/l9eqjxd/), [2](https://www.reddit.com/r/footballmanagergames/comments/1djkaf8/weekly_help_thread_ask_your_help_requests_here/l9jvoiq/), [3](https://www.reddit.com/r/footballmanagergames/comments/1djkaf8/weekly_help_thread_ask_your_help_requests_here/l9l09em/), [4](https://www.reddit.com/r/footballmanagergames/comments/1djkaf8/weekly_help_thread_ask_your_help_requests_here/l9p3t42/), [5](https://www.reddit.com/r/footballmanagergames/comments/1djkaf8/weekly_help_thread_ask_your_help_requests_here/l9qvhlx/), [6](https://www.reddit.com/r/footballmanagergames/comments/1djkaf8/weekly_help_thread_ask_your_help_requests_here/l9pscnh/)\n\nIf there are no numbers in this list, then it means all questions have been answered.",
            "Is there any free in game editor for FM24? Or anyway of getting the oficial one for free? Thanks!",
            "From where can I buy the older versions of FM? FM 21 or 22?",
            "How to sell my players?\n\n-Wanted to cash-in on one/some of my better players\n\nHojlund & or Garnacho from Man Utd.\n\nplayer preferred to stay but open to talk to other teams\n\nno clubs are interested.\n\n  \nTransfer listing them would drop their morale\n\nTried to offer them via the transferroom, no teams are willing to make an offer\n\nAsked their agent, no teams are willing to put in offers.\n\nI am not sure if I am to sell them, what should I do?",
            "I wanna buy a player (I can afford his transfer cost and wages), but he says my squad needs to be significantly improved before he could consider joining. How is this significant improvement calculated (Star ratings? Reputation?)? And exactly by how much do I need to improve? I have the money to make some great signings this season, so actually making those improvements won't be an issue, but a definite target would be great.",
            "I've been using a 4-1-1-4 formation with a half back as a DM. What would some good traits be for a half back? I feel like I can get much more out of my star DM if I got the right traits for him",
            "I saw a tip in FM loading screen that the mental of the player will increase when they become older. Do the players who started regressing in the physical often transfer their attributes to mental once they reach 30 above or the tip is totally wrong?",
            "Is there a way to replicate the real EURO 2024 groups? I'd like to try a challenge and win the whole thing with all of the participating countries.",
            "I fail to comprehend what goes into the star ratings for certain roles. What are the most important factors is a forward whose best role is T or F9? Is it possible for their ratings with those roles to be higher than any of the other striker roles? Are the star ratings not a good basis for effectiveness in certain roles compare to others? Should I just use the number ratings that are highlighted in the player profile?",
            "When people play journeyman saves, do they wait until they get job offers? I've been playing for a while and haven't gotten one yet. Do they apply for jobs?"
        ]
    },
    "Any advice how to improve my tactic mid-tournament? I'm convinced this is the only way to grind out a result with such an untalented group with no natural DM, but the media seems to think otherwise, any advice for changes I can make are welcome!": {
        "title": "Any advice how to improve my tactic mid-tournament? I'm convinced this is the only way to grind out a result with such an untalented group with no natural DM, but the media seems to think otherwise, any advice for changes I can make are welcome!",
        "score": 278,
        "url": "https://i.redd.it/z853uogz438d1.png",
        "content": "",
        "num_comments": 50,
        "comments": [
            "I was about to pluck out my hairs but then I realized its southgates burner. (The lad really thinks kane should be dropping into midfield when he got great creators already)",
            "Found our lord and saviour Southgate's burner. No attacking roles all the way 💪",
            "Try and find the replacement for the lord and saviour Sir Kalvin Phillips",
            "I was going to suggest something, but it turns out these players apparently don't have the fitness and attributes to press. So sorry, this is the best you can do.",
            "Nice try Gareth",
            "If only there was a defend much, much deeper instruction",
            "Man if only you had kalvin “irreplaceable” Phillips you could go all the way but alas round of 16 is the best you can do I think",
            "I’ve been around long enough to recognise another golden generation when I see one…..",
            "I don't think Arnold will work for you as DM, he has no defensive abilities and also doesn't have the press resistance and technique to work as a pivot in possession.\nYou should replace him with a true number 6 and make Rice go forward a bit more. Do you have Calvin Phillips?",
            "Why do we need to when Ancelotti already do the work? 4123 narrow baby\n\nPickford\n\nWalker Stone Dunk Trippier\n\nRice\n\nMainoo Foden\n\nSaka Bellingham Gordon\n\nThe Ref"
        ]
    },
    "My Goalkeeper WON the Ballon d’Or in 2039 at the age of 19!": {
        "title": "My Goalkeeper WON the Ballon d’Or in 2039 at the age of 19!",
        "score": 235,
        "url": "https://www.reddit.com/r/footballmanagergames/comments/1dlqmpe/my_goalkeeper_won_the_ballon_dor_in_2039_at_the/",
        "content": "https://preview.redd.it/umn48wwey28d1.png?width=1251&format=png&auto=webp&s=b1bd223d701e544dd4a929ad10dd69789d9d01c7\n\nHe **was groomed** for this very reason. Before his arrival, the Palermo squad was a world class team. They had won everything and i have set up a U18 and U20 system to make every transition seamless. I have also controlled U20 squad for every match so he could develop faster with mentoring and the world class facilities helping along the way.  \n  \n1) The key was to make him always take **penalties** and all of the **set pieces**. This in addition to playing him as a **sweeper keeper** on **attack** (more key passes i presume) made it possible to get very often 8+ average rating with a lot of goals/assist. Having a world class defense ment that i didn’t have to worry if he was the best GK in the world in terms of pure goalkeeping skill, they were able to help him keep those clean sheets  \n  \n2) There was a special training schedule that focused on goalkeeper development (as other players were mostly developed at that point) and set pieces/penalties , although only his technique improved and free kicks even got lower  \n  \n3) He didn’t play in matches that were against harder opponents in away matches so it wouldn’t lower his average rating except when playing in champions league. I would also rotate the squad fully so they wouldn’t outshine my GK with goals/assist  \n  \n4) In the end he scored **29 goals** and made over **60 assists** (Serie A record with 18 in a Season) and had **38 POM** in 4,5 years (in all competitions)\n\nP.S. Newgens have a max value in certain attributes that can be generated when they are created. In my experiments the caps for Goalkeepers Penalties, Passing and First Touch go up to 12, Technique at 13, Free Kicks at 9, Corners at 6 and Crossing, Long Shots and Finishing at 3.\n\nSince for set pieces and penalties Technique and penalty taking were most important i looked for a 4\\*+ potential GK with at least 10 in both. Added bonus is Composure and Passing (8-10) with of course a good personality so he can develop\n\n[World Golden Glove and Rookie award](https://preview.redd.it/mtibwtuhy28d1.png?width=1656&format=png&auto=webp&s=8a8b6fbcac4139b36003f4aeeaeb86b7ce85a1a0)\n\n[Penalty was 12 his whole career even though he took every penalty. Technique went up by 4 and FKs dropped down by 3](https://preview.redd.it/u4bzw0ejy28d1.png?width=1701&format=png&auto=webp&s=a3fa880f148ea316d4436482c19dacf67a996de6)\n\n[His improvements](https://preview.redd.it/2feytriky28d1.png?width=1694&format=png&auto=webp&s=9141b3b64cf9f25e09db0d661863d473f6f64afc)\n\n[While it doesn't show all of the stats \\(only Serie A\\), he has 29 Goasl, 60+ Assits and 38 POM](https://preview.redd.it/ksgwu0jly28d1.png?width=1683&format=png&auto=webp&s=e73abbdae0f745db70689b68c808eb225032a846)\n\n[Serie A record for Ratings and Assits](https://preview.redd.it/8hn67w5my28d1.png?width=1690&format=png&auto=webp&s=32c67dd008b3d5f17fe4fbd0a24a382fed521a86)\n\n[Season 2038\\/39](https://preview.redd.it/fk5rx6omy28d1.png?width=1164&format=png&auto=webp&s=f0df32ce9f1e1d10369da5c4b8956ab289619920)\n\n[Season 2037\\/38](https://preview.redd.it/xgzw140ny28d1.png?width=1154&format=png&auto=webp&s=19e61281e7ee88583b2e4488a215874c71648709)",
        "num_comments": 28,
        "comments": [
            "this is MADNESS, i think you just did one of the hardest challenge in FM, make player from defend position win Ballon dor",
            "The mighty Palermo!!!",
            "![gif](giphy|c5skRQb3BXp8RwKGKW)\n\nPalermo",
            "What is the player skins package you use for your save? It looks good",
            ">age of 19\n\n>he **was groomed**\n\nFBI OPEN UP",
            "Used to sign Angelo Palumbo from Palermo. epic CDM.",
            "Now that tells you how realistic this game is hey?",
            "What tactic are you using? 4 at the back with wing backs too? Nuts",
            "So nice to see this, congrats!",
            "Are you not left wide open if he takes set pieces far up the pitch?"
        ]
    },
    "I think potential is done wrong in this game": {
        "title": "I think potential is done wrong in this game",
        "score": 49,
        "url": "https://www.reddit.com/r/footballmanagergames/comments/1dlr2q5/i_think_potential_is_done_wrong_in_this_game/",
        "content": "So, we know that at the start every player has a CA and PA. And PA acts as a ceilling for a player. I understand that some players are more gifted than others and chances are that 16 years old from Brasil who is scoring 30 goals a season in first league should be able to develop more than 23 years old from Slovakian 3rd league who is just warming bench. I know that for player to reach his PA he has to train hard and play good consistently. But the problem is that if player is constantly training hard and performing well, while being well utilised in team, if his PA is low, he just wont become that good of a player.\n\nI feel that this design is bad from two perspective: both game design and following real life. From aspect of game design, it creates a transfer meta which result in everyone of us buying same players at the begining of careers knowing that certain players are “hidden” gems (not so hidden if we all know them.  Sure, there is variety since there is a lot of teams and A LOT of players resulting in different games, its not like you can sign everyone with budget of 100k eur. \n\nOn the other hand, there are a ton of players that had not so promising start of the career and just bursted at the age of 27. Like if you need example, look at Jamie Vardy for example. You cant tell me anyone tought he had potential to become EPL top scorer one day while he was 18 y.o. I wont be listing similar cases because there is a thousands of cases like him.\n\nAnd then we have strangest things, like in one of my saves, Adam Armstrong was top scorer in EPL for me for three years straight, but since his CA wasnt that high (since his PA wasnt that high), I was getting offer for him in range of 20-35 milions. Like IRL City would be coming with 80 milion for him, while chelsea would be offering 150 milion (that club really got ruined fast).\n\nYou cant tell me that anyone tought that CR had 200 PA while he was 16 y.o. Or that anyone really tought he would become what he is now (or was few years ago). And we constantly hear that he is perfect example of hard work and sacrifice. Why cant we have that in a game?\n\nMy idea would be to have some system that works more as a booster to naturally talented players helping then reach higher stats faster and easier, and also helping them mantain their level more easily. But not as a ceiling. You nurtured your Lebanese left back for years, found a way to utilise him, spent years investing in him and that results in him playing good. Why cant he become on of best left backs in history of the game? \n\nI think it would be much better for two reasons: 1) we all get attached to some players and like investing a lot in them and it would be great to have them become really amazing, maybe going on to achieve greatness outsude of your club. 2) it would create variety and replayability in the game. Its not like there is none of that in game arleady, but more wouldnt hurt.\n\nI would like to hear your opinion on this, or maybe other ideas on how you would implement it differently.",
        "num_comments": 57,
        "comments": [
            "The CA/PA was probably implemented because anything more dynamic than that years ago would have caused performance issues in large databases. \n\nI agree it is time to overhaul it, I would simply favour CA ability only, with randomised development based on players age, professionalism, ambition etc. So you buy a 130CA 18 year old but you have no idea how they will actually pan out later down the line, even if they've got all the right personality traits.\n\nAll AI transfer pricing should be based around this as well.",
            "100% agree\n\nI had a CB at Juve who had perfect attribute split and was insane, my starter CB from age 17 to 20 while averaging 7.8 rating minimum.\n\nHe constantly had 3 star potential and I was getting offers for 5-7 mil for him. I assume his PA and CA was \"bad\" and every ai team knew that he was trash despite him being an absolute baller in my system\n\nInsane.",
            "This grinds my gears.\n\nPotential by the definition is how good the player can be. Your suggestions not only would break the balance of the game but also unrealistic.\n\nDiscussion about this always revolves Jamie Vardy which, first of all, is an exception not the rules even in real life. Second, it just means what we saw was Vardy's potential after all. We just failed to see it before. Not to mention FM already baked in a \"late-bloomer\" into a game which may allow us to see the Vardy-esque progression.\n\nThen, If every player that play many games with a good match rating can grow as a superstar, then everyone would be a superstar. It doesn't make any sense. Manchester United starts Scott McTominay week in week out, doesn't mean suddenly he grows into Roy Keane. He just did not have it in him.",
            "\"On the other hand, there are a ton of players that had not so promising start of the career and just bursted at the age of 27\"\n\nYou can see it this way, he always had the hidden PA to reach these levels he just didn't clicked until then (ex. Vardy as you said). So at a certain point he had a burst of CA gain to reach closer to his PA potential.\n\nThe thing is, you are not supposed to know the player's PA. Also there plenty of players that start a career being labeled as promising or wonderkids and not improving at all through their careers.",
            "And then there's YouTubers proving in experiments again and again that even scouts with perfect attributes will get some player's PA wrong. \n\nAnd the \"everyone buys the same 'hidden gems'\" argument: that's entirely on you. Don't watch those videos!",
            "I agree to an extent but also some players work very well in a system and there's a general awareness that that level of performance won't happen elsewhere. Leicester's title-winning side is a lazy example, but hear me out. The central defensive partnership they had of Morgan and Huth was fantastic in that system. And both players played extremely well individually and in combination. But neither had become an exceptional centre back - they just fit the system and the players around them very well. So Huth didn't become an £80m centre back who could have bossed it beside John Terry at Chelsea, for example.\n\nTo offer a striker example, since yours is about Adam Armstrong, Kevin Phillips was a great centre forward in the contexts in which he played. But no big club was going to break the bank for him, because his skills worked in a particular system. Slightly more obscurely, to show what happens when those players do get big moves, Igor Protti was top scorer in Serie A in the mid-1990s, scoring about 26 of Bari's 35 goals all season as Bari got relegated. That earned him a move to Lazio, where he couldn't recreate it because he was suited to Bari's style and not that of a bigger club.",
            "I think you have a lot of missunderstandings about the game and some of them answer all your questions and critics.\n\nFirst the Vardy efect already exists on the game where a player will only develop when they are already 27 old instead of 19.\n\nSecond your thing about MC buying your player for 80 instead of 20/30 that is a problem with reputation sistem not on the player side.. there are a lot of examples out there of the best players on the world on the save being evaluted for peanuts just because they play on shit league or a bad club (and before you say your club isnt bad because you won the league for 3 years straight that doesnt matter unfortunaly....the reputation doesnt rise that fast and its been a problem for years and years but they cant fix it because they build their whole game on top of it soo changing it would break the game) instead of a reputation club.\n\nThird about the players potencial or current ability, some of the players already have dinamic potencial while creating a save (in my opinion all the players under 21 should have dinamic number instead of a fixed one thats why I use a editor data that does exatly that and that makes it always diferent players becoming the best in the world), But that doesnt even matter because you can literaly have a low current ability player become the best player in his role just because he has the best atributes in the right place and I think that might be another missunderstand you have....just because X player has higher CA than Y player doesnt mean X is better than Y and it could be the other way around, thats why atributes is always most important than CA or stars... Of course there are limits for example the odds of a guy with 100 being as good as a guy with 195 are Slim to none but a guy with 150 can totaly be better than a guy with 195.\n\nI think I answered every point but if I missed something let me know please.",
            "Altough i agree the PA doesnt work really nice, Vardy example is not great... players can overachieve in real life, and in the game, a 3 star PA player can be the EPL top goalscorer, in an one off season, just because Vardy was the top scorer doesnt mean he was the best striker in the prem, it s a team game. Thats why he stayed at Leicester and slowly fell out(also ageing), don t get me wrong, he was a good player still, but if you look at Kante for example, Mahrez... those 2 players are what you d expect to have a high PA. \n\n\nWhat are you describing with Vardy is just form, he was a 3* CA player in a good form. Even if he played amazingly, he was still just a good player, nowhere near being a superstar.\n\nYou want a dynamic PA based on how players are performing, but thats not what happens in real life. Poential is potential, and ability is ability.\n\nOusmane Dembele has a much higher ability, and had a huge potential when he was younger, than lets say... Rodrygo, Rodrygo is playing better, but that doesn t mean he has the same ability as Dembele. Ability and potential is about each individual player, there are players that have amazing ability but just don t fit or play well in a team, or multiple teams. It s fair to say Dembele hasnt fulfield his potential, but his individual ability is still better than Rodrygo s. \n\nYou are basically saying that Harry Maguire playing good for 5 straight seasons since he was 20, should get close to someone s CA and PA s ability that everyone knew from the get go he was gonna be a world class player. It just doesn t work that way, you can play amazing, doesn t mean you have better abilities than someone else.",
            "The game has had dynamic potential included since 2016, and late development was introduced in 2024.\n\nYou're complaining about the game.not having things that it does, in fact, have.\n\nAlso, all the training in the world isn't going to increase a player's potential.\n\nWith the best will in the world, and the best training in the world, I can promise you that the average 25 year old in League 2 isn't going to suddenly become good enough to play for Real Madrid.",
            "Actually CR was already taunted as a prodigy at 17. Though at the time it was thought that Quaresma and Fabio Paim would be better.\n\nFabio Paim had a trainwreck of a carreer, Quaresma was pretty solid, and for me he is one of the most technically gifted players to have played in and for Portugal. Problem w Quaresma is being a hot headed brawler. Perfect fit for FC Porto and the Turkish league, but perhaps a bit of a liability anywhere else.\n\nBut yeah, lets not forget that Ronaldo at 17 was a regular in a top 3 team in Portugal, at 18 humbled Man U to a point that he had to be hired the very next day after a friendly match, and at 19 he was already appearing at a National team level that reached (and lost) the Euro Final. If this wasnt revealing of a very high ceiling, then I dont know what is 😋"
        ]
    }
}