{
    "The \"who should I manage\" megathread - FM24 edition": {
        "title": "The \"who should I manage\" megathread - FM24 edition",
        "score": 323,
        "url": "https://www.reddit.com/r/footballmanagergames/comments/17m4yg5/the_who_should_i_manage_megathread_fm24_edition/",
        "content": "If you're looking for a team to manage, a challenge to do, or you yourself have suggestions for teams/challenges for other people to do, use this thread to discuss.\n\nPrevious thread(s):\n\n- https://redd.it/qtns33\n\n- https://redd.it/uyxwa0\n\n- https://redd.it/yu8188",
        "num_comments": 2644,
        "comments": [
            "Middelfart are a team in the lower divisions of Denmark. If you want a long save and a team with a funny name then look no further!",
            "Kerry FC. Newly formed team in Ireland playing their first ever season after getting a licence to play in the Irish First Division. They have the youngest squad in the league and are predicted to finish bottom but they have a few quality attackers for the level they're playing at to help you compete in the first season. The goal is to turn them into the best team in Ireland, with transfer restrictions being nonexistent using loans and free transfers from England and Scotland at first then build a team of wonderkids, qualify for the UCL, something an Irish team has never done before and improve Irish soccer as the top league is rated 74th in the world.",
            "Chester - Wrexhams biggest rivals just across the border with an even more turbulent recent past ownership. Fan-owned so its like the antithesis of a sugar daddy save.",
            "FC Vaduz, in the Swiss league. They are however from Lichtenstein meaning they cant qualify for Europe through the league. Winning the Lichtenstein cup gets you into the conference league, the only way to get into the Europa league is to win the conference & to get into the champions league you have to win the Europa.\n\nThis means that you have to win the conference, europa and then finally the champions league consecutively. If you are knocked out of either the Europa or champions league, you start from the conference again the following season",
            "Belenenses in Portugal. One of two teams besides the big 3 (Porto, Benfica and Sporting) to ever win the league title, they split from their investors in 2018. So a new club, B Sad, was created, that everyone hates. Belenenses went all the way down to the regional tier, slowly climbing back up and they are now in the second tier of portuguese football\n\nDespite a lackluster squad they have good to great youth recruitment and facilities. They are also based in Lisbon, which helps. It's a nice chance to restore glory to a historic club",
            "I love French league. Lyon has great youth system and it can be really fun developing your youth players! Lens and Rennes has great teams, OM is also really looking interesting!\n\nPlus, its always fun to try and break PSG dominance!",
            "Want to play 1860 Munchen in 3. Liga, Someone in the second division in England, a bad team in Premier League, Empoli in Serie A, Someone bad in Ligue 1. \nBut i just look at the computer screen for hours without stimulus",
            "Opinions about Dynamo Dresden? Great fan culture, big stadium, East Germany etc. No idea about the squad/facilities etc.",
            "I'm doing a Gibraltar build a nation with Lions Gibraltar this year",
            "1860 munchen man, gotta takedown the big fat brother bayern munchen"
        ]
    },
    "Weekly Help Thread - Ask your help requests here | Week Commencing 26/06/2024": {
        "title": "Weekly Help Thread - Ask your help requests here | Week Commencing 26/06/2024",
        "score": 3,
        "url": "https://www.reddit.com/r/footballmanagergames/comments/1dozq7m/weekly_help_thread_ask_your_help_requests_here/",
        "content": "Please use this thread as a place to ask questions that are specific to your save, such as:\n\n- \"Why is my tactic not working?\" \n\n- \"What role should I play this player in?\" \n\n- \"I have £xxm to spend, who should I buy?\"\n\nIf you are asking for tactical help/advice, please post an image of your formation and what insutructions/roles you have set.\n\nAs a rule of thumb, if you ask a question, answer a question. This is what keeps this thread alive and useful. \n\nAlso, please remember that the team suggestion thread can be found in the sidebar, so please use that and give your suggestions to people there too!",
        "num_comments": 128,
        "comments": [
            "How do you guys watch full games?  I can do highlights but keep taking me back to the menu.",
            "Is FM24 worth buying if i already have FM23?",
            "I'm running into a regular occurrence in my recent games of absolutely dominating the first half, and then getting absolutely dominated in the second half.  To the point every single first half highlight is me peppering the goal and I don't give up a single shot, possession in the 60's%.  I'll take a 2 or 3 goal lead into halftime, whatever halftime speech I give boosts everyone's morale....then I come out for the second half and just watch highlight after highlight of my opponent's attacks.\n\nAm I supposed to change tactics at halftime?  My starting tactic is pretty defensive and possession based, and truly dominant to start every game.  I have no idea what is happening in the second half, or how to address halftime adjustments....any suggestions regarding in game tactics adjustments?  Any easy way to identify what adjustments opponent has made and counter on the fly?",
            "Currently got an excellent youth prospect from the academy. Five star potential and already valued at 39-67 million pounds. However his determination is only 4. Am I best of bringing him up to the first team to mentor him or will this naturally improve if I let him play with the U18s?",
            "Can playing a first team player in youth team matches help them develop familiarity with a new position?",
            "Hi, I am a beginner in FM24, I have started a carrer at sunderland, I have tried to sign a player and it tells me that I already have the 4 ESC slots filled, how do I know who those 4 players are? To be able to sell them and create space, or is there any other solution?",
            "How do you get the board; to give you a foreign club as an affiliate?",
            "When hiring staff, do you ever care whether they speak the language or not? I usually just go for the best available and send them on a language course if needed, but maybe hiring someone with slightly lower stats but actually speaks the language results in more effective coaching...",
            "So where do you report bugs? Something is badly wrong with my Shamrock Rovers save.",
            "Do any of the winger roles drift into the midfield?"
        ]
    },
    "What’s your thoughts on the added/removed features? [credit FMInside]": {
        "title": "What’s your thoughts on the added/removed features? [credit FMInside]",
        "score": 214,
        "url": "https://i.redd.it/lg9o8t91vh9d1.jpeg",
        "content": "",
        "num_comments": 195,
        "comments": [
            "Still don't know what the data chalkboard actually is",
            "Scouting 15 year old Colombian wonder gals will make me feel so uncomfortable",
            "Due to how big the jump will be from 24 to 25, I'm fully expecting these features to be postponed, rather than scrapped entirely. Once the new engine is out there and in use, I'm sure some of these old, low priority features will be brought back in future entries",
            "I saw Miles comments on touchline shouts not taking effect untill the ball is out of play and players not knowing how long they last ets \n\nNo shit, but why not just fix that instead of yanking it?",
            "No more create-a-club?! Why the fudge not? Love creating my own team for a rags to riches style save. Literally won't even look at the womens side of it. New interface and match engine depends on how good they are. Rest meh.",
            "All I do during matches is touchline shots wtf",
            "I know it's different and everyone hates change ,  but the new UI looks 'dumbed down' and looks very FIFA esque.  We don't play FM for the graphics, we play for the stats lol.  I get the feeling this might attract more casual players at the expense for people who've played the games for years.  I'll be sticking to FM24 and just download an updated database I think u until I get a good look at the reviews from the normal streamers.",
            "But without the social media how else would I know that we always win when we play with a 4-1-1-3-1 DM AM Wide Asymmetric Formation?",
            "Looks like Im in the minority. I always do create a club mode.",
            "i feel like they remove these so they can introduce it as a novelty in later editions, not cool SI, not cool"
        ]
    },
    "Football Manager Transfer Announcement video - Working with a professional football club and being an FM fan for a long time, I got to crossover the two as I edited together this announcement video for Galway United. Thought my fellow FM addicts here might enjoy 👊": {
        "title": "Football Manager Transfer Announcement video - Working with a professional football club and being an FM fan for a long time, I got to crossover the two as I edited together this announcement video for Galway United. Thought my fellow FM addicts here might enjoy 👊",
        "score": 124,
        "url": "https://v.redd.it/dr9qkn158h9d1",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Oh boy! Gotta love this. Miss my time living in Galway :( Now I want a shirt! Thank you",
            "As a Galway United fan I'm always a bit blown away by the quality of the social media team, given the level of the club/league.\n\nFair play, this is unreal, as is all the other content, so well done on that too assuming you're involved!",
            "That's crazy cause I started a Rochdale save last week and yesterday when I was on I let this guy go for free to Galway just before the end of the first season   ",
            "Can u send link for GTA6 in dm ? I offer you 1 shillingsfor this",
            "Awesome work dude  you should be very proud",
            "Nice, can you play now gta 6 i want to see the gameplay",
            "It is a lovely jersey to be fair, you're welcome back to Galway any time!",
            "Great to hear, thank you!",
            "Crazy!! I signed an aging Erling Haaland for Galway United on mine, will that come true aswell? ",
            "We got a deal dude"
        ]
    },
    "Holds you in the highest regard as a manager": {
        "title": "Holds you in the highest regard as a manager",
        "score": 76,
        "url": "https://www.reddit.com/r/footballmanagergames/comments/1dr7dci/holds_you_in_the_highest_regard_as_a_manager/",
        "content": "Aww thanks buddy, that's so sweet.\n\nOh hang on, I promised you a loan but then my starting player got a long term injury and you became the regular starter, so now you're livid that I didn't send you down to league 2 for a year and our relationship is irrevocably damaged. Ace.\n\nAm I your god or am I the devil?",
        "num_comments": 20,
        "comments": [
            "I feel you should be able to renenge on promises and have the opportunity to explain to them...",
            "I just had a player get ragey because I broke a promise I made to him when I signed him.\n\nI didn't sign him.",
            "If they play a lot they'll drop it quickly.",
            "Yeah the promise system is a bit fucked still after all these years\n\nBest to just treat it as a game, you're never going to be able to create the perfect sim",
            "Just one of the many ways the interaction system could be improved by integrated AI...",
            "Not always, I've had some that didn't drop it in time and the promise was broken.",
            "Have you seen how bad every existing LLM (calling them AI is an insult to Alan Turing) is at the moment? Integrating them into FM player interactions would make them much more frustrating, not less.",
            "Still if they play, they'll drop it quickly. Still annoying, and of course there should be a possibility to \"upgrade\" the promise from loan to playing time. But it is one of the promises that relatively easily gets dropped if they play a lot.",
            "By drop it he means theyll stop being upset about it. And, tbh, even if they are upset about it, it doesnt mean shit unless they are both influential in the locker room (which loan promised players rarely are) and complaining about it to teammates or the media.",
            "I assumed that giving the system less possible outcomes might increase usefulness. You're essentially just asking it to turn language into something it knows what to do with - the possible outcomes are going to be significantly reduced from, say, ChatGPT, so surely that improves usefulness?"
        ]
    }
}