{
    "I DON'T KNOW WHAT'S HAPPENING ": {
        "title": "I DON'T KNOW WHAT'S HAPPENING ",
        "score": 1847,
        "url": "https://i.redd.it/pt6g0tt5mh9d1.jpeg",
        "content": "",
        "num_comments": 46,
        "comments": [
            "I think we have to pay extra for that",
            "Driving me nuts seeing them zoom in on a random mechanic and not seeing the battle between the leaders and then not even the timing tower",
            "Spending 2-3 laps with alpines ",
            "Pastry's lunge broke the data tab",
            "Confronted me with the fact I usually spend 80% of the race looking at the timings",
            "as a degenerate williams fan, as soon as they brought it back I did not wanna see it again ",
            "Piastri could be diving on Max for all I know during that seemingly 5 minute period where they replays of people not even getting overtaken lmao",
            "That was so annoying\n\nHad no idea what was going on",
            "Tbf, 'luckily' nothing much happened when the timings went byebye. 3 laps of racing, 20 laps of nothingness. Honestly, I was kind of excited for this Sprint as the Ring tends to provide good racing. Oh well.",
            "I remember when they decided this was a good idea in Starcraft II - it wasn't.\n\nIt's for sure more exciting not to know everything at all times, but the casters need to be aware of that and do more of a \"radio-cast\" than they're used to, which they didn't, hence why it wasn't a good show."
        ]
    },
    "Seb spitting facts": {
        "title": "Seb spitting facts",
        "score": 742,
        "url": "https://v.redd.it/urxci4qbkh9d1",
        "content": "",
        "num_comments": 24,
        "comments": [
            "AI is getting really terrifying \n\nother than that, funny vid",
            "yep knew from the start it was ai generated",
            "Queue the \"AI Is GeTtInG CrAzY\" comments under what is clearly a very shitty AI voiceover",
            "I honestly ~~think~~ hope 26 car makes it more interesting with cars able to get closer and the new overtake engine mode theyve hinted at",
            "This message has been approved by AI.",
            "Yeah I immediately suspected that dialogue was too cool to have come out of Seb's mouth. Nothing against Seb.",
            "Fuck you. Fuck your comment. Angrily up votes*",
            "I like them, they allow me to rear a lot faster and focus on the video at the same time",
            "Sad thing is AI is now up to the same standard as Netflix's interview editing. For better or for worse.",
            "I hate well as them"
        ]
    },
    "That's okay sky. I didn't want to know driver positions anyway ": {
        "title": "That's okay sky. I didn't want to know driver positions anyway ",
        "score": 696,
        "url": "https://i.redd.it/alex7lutlh9d1.jpeg",
        "content": "",
        "num_comments": 44,
        "comments": [
            "Its on every broadcast that misses the drivers positions, not just sky",
            "No graphics and only showing p9-12. nice",
            "Bono, my leader board gone.",
            "Not Sky's fault, but it was really annoying",
            "Honestly, its so annoying bruh",
            "How could you possibly keep up with what lap theyre on??? Are they stoopid?!",
            "I was looking for a red button to mash, but alas, nothing was forthcoming in the F1TV app. No data, nothing. I had to drag out my dowsing rods, and read entrails to know WTF was happening.",
            "First 1 minute I enjoyed no HUD race. Just was watching cars without distraction and I even thought it was intended.\n\nMaybe they should disable HUD for 20-60 sec from time to time.",
            "No need for a graphic if the race is boring ",
            "Nothing to do with Sky. Also where dank?"
        ]
    },
    "My local mall would make a sick F1 Track ": {
        "title": "My local mall would make a sick F1 Track ",
        "score": 674,
        "url": "https://i.redd.it/m07oidw7sg9d1.jpeg",
        "content": "That split chicane down below. ",
        "num_comments": 51,
        "comments": [
            "Stretch it vertically and you basically have redbull ring",
            "Formula E would actually be an option tho",
            "F1 needs more traffic islands",
            "a track with a splitting path that converges would be sick! Imagine the 50/50 mind games",
            "Ah! Fellow Melbournian! Essendon DFO haha",
            "This just looks like Hockenheimring mirrored",
            "Only if we keep the shops in the middle of the track so we have multiple sections with more than one racing line.",
            "There's even potential for a pit stop",
            "Thought this was chadstone for a sec",
            "Wonder which side of the ice cream studio would be quicker"
        ]
    },
    "The new HAM BOT VER": {
        "title": "The new HAM BOT VER",
        "score": 651,
        "url": "https://i.redd.it/9zls7sbprg9d1.jpeg",
        "content": "",
        "num_comments": 29,
        "comments": [
            "Vernorpia. Kinda sounds like a fantasy land of lions and witches and clothes and such and such.",
            "Still a brit a dutch and an aussie",
            "Thought it was gunna be popular French driver Ver Lecsai",
            "Vernopia sounds like a land far far away.",
            "I'm still recovering from HAM ROS VET",
            "Does that mean we get the true Aussie bogan soul redemption arc when Piastri moves team in 5 years?",
            "Can we start making these result posts on the same day of the race as spoilers???\n\nYou know, for the sake of those idiots like us that live on the other side of the world? Ffs",
            "I think you mean verpianor",
            "1342 since they finished in HamBotVer order :(",
            "Or the name of a medication\n\nAsk your doctor about Vernorpia"
        ]
    }
}