{
    "Downtime for v30.20 begins at 1 AM ET with matchmaking ending shortly beforehand.": {
        "title": "Downtime for v30.20 begins at 1 AM ET with matchmaking ending shortly beforehand.",
        "score": 57,
        "url": "https://vx.seebot.dev/FortniteStatus/status/1804222786446963151",
        "content": "",
        "num_comments": 46,
        "comments": [
            "A new breed of players will born tomorrow: Reload only. And I'm here for all of it.\n\n(I just hope it will be fun playing solo/fill)",
            "How long will servers be down?",
            "1AM? That's quite a bit earlier than usual.",
            "All I need and ask from this update is a boys collab I don’t care about anything else.\n\nEdit: ):",
            "If the Capcom skins aren’t in the files, I might genuinely lose my mind",
            "When are the servers expected to go back up 🥹 10 PM downtime on a Friday is crazy",
            "West coast players Can't play fortnite after 10PM on a friday night... crazy timing.",
            "What is this update does anyone know?",
            "these new modes are awesome, but im just concerned theyre stealing from an already dwindling playerbase on br and creative etc",
            "[deleted]"
        ]
    },
    "Fortnite Reload Launch Trailer - New Mode": {
        "title": "Fortnite Reload Launch Trailer - New Mode",
        "score": 178,
        "url": "https://v.redd.it/qborseqvr18d1",
        "content": "",
        "num_comments": 93,
        "comments": [
            "**See also:**\n\n* [Oh hiiiii, Tilted 👋](https://www.reddit.com/r/FortNiteBR/comments/1dl7jm2/oh_hiiiii_tilted/)\n* [Kai Cenat, Sketch, and AMP Assemble the Reload Squad | Fortnite Reload Teaser](https://www.reddit.com/r/FortNiteBR/comments/1dlht93/kai_cenat_sketch_and_amp_assemble_the_reload/)\n* [40 Players. 10 Squads. 🔁🔁🔁. 1 Victory.](https://vx.seebot.dev/FortniteGame/status/1804363787484410307)\n* [Squad Up For Fortnite Reload](https://www.fortnite.com/news/squad-up-for-fortnite-reload)",
            "This is a foreshadow to a Chapter 2 OG season as much as it is a Chapter 1 thing\n\n\nthey made Lonely Lodge in a way that makes it extremely close to Weeping Woods\n\n\nThat mini-Dirty Docks looking POI\n\n\nAnd a Konata Small song for the trailer (Konata Small made the song that played on the Chapter 2 launch trailer and it would play at the start of your first match in Chapter 2 Season 1)",
            "40 Players - 10 Squads\n\nSquads Only (Fill or No Fill)\n\nAvailable in both Builds and Zero Builds",
            "In the blogpost it says\n\n>Here’s just a handful of items returning for Reload at launch:\n\nWhich makes it pretty clear that there are likely going to be updates to the mode as time goes on",
            "I'm very much looking forward to playing with the Chapter 1 weapons\n\nI haven't liked the lootpool at all this chapter",
            "Here's what I have found that wasn't in the blog post:  \nScoped Burst AR  \nCrash Pads  \nLegacy AR + SCAR  \nChug Splashes and Chug Jug  \nShield Bubbles  \nP90  \nHunting Rifle  \nPump Shotgun",
            "No way Dirty Docks is back. 9/10 map\n\nIf it was Camp Cod, the map would've been a 10/10",
            "I get the mechanic wouldn't work in solos but damn a mini solo br with a map like this would've been really fun, especially if in future updates they mixed and matched POIs from past seasons",
            "Wanted a reload glitch fix. Got a reload game mode. 🤷",
            "I think it's really important here that they aren't making it clear that it is just exclusively based on ch 1 stuff. They could add stuff from other chapters if they wanted, I'm thinking ch 2 specifically if we get ch2OG"
        ]
    },
    "Which one do you choose?": {
        "title": "Which one do you choose?",
        "score": 2784,
        "url": "https://i.redd.it/f649bplb5y7d1.jpeg",
        "content": "These are the two best heals in the game right now, in my opinion. Which do you choose to carry? \n",
        "num_comments": 474,
        "comments": [
            "Nuka Cola is better for solos and fizz for teams",
            "Fizz but ill pick up and consume the nuka just to see the bottle cap animation",
            "Nuka Cola, because it can also heal HP.",
            "Nuka Cola gives 25 health and 75 shield. It can be used in under 3 seconds, whereas the flowberry fizz takes a bit to fully shield you. \n\nI like Nuka Cola better and I’ll carry a couple around with me in case I need to quickly heal mid combat.",
            "Nuka Cola for that sweet, sweet \"gulp gulp gulp, Ahhh!\" sound effect!\n\nPlus it gives you one gold, which is a nice little nod to the bottlecaps in Fallout. Always loved getting drinks that give you money haha.",
            "Nuka. It's a quick enough heal and the animation is satisfying. I wish they'd make it into an emote.",
            "Solos, Cola. Team modes, Fizz",
            "flow berry fizz + nitro boost = 🔥🔥🔥",
            "I use nuka cola the exact same way i do in fallout, drink it immediately for the cap and ignore its purpose entirely",
            "Nuka cola gives health as well sooo"
        ]
    },
    "I'm glad they're focusing on guns and BR again rather than bootleg mimecraft, guitar hero, and track mania.": {
        "title": "I'm glad they're focusing on guns and BR again rather than bootleg mimecraft, guitar hero, and track mania.",
        "score": 670,
        "url": "https://i.redd.it/iadbravf208d1.jpeg",
        "content": "",
        "num_comments": 245,
        "comments": [
            "Curious where people are finding that it says it's only going to be a squads mode. Will be very disappointed if that's true.",
            "You're gonna complain by sunday",
            "Mfw all different modes have different teams working on them. What Insomnia (Racing), or LEGO corp, or Guitar Hero devs do has nothing to do with BR.",
            "Now we wait the post about it be madness and not fun.",
            "People still cry about the other modes despite them not even being developed by the BR devs?",
            "When has the focus to BR ever shifted? There’s still big updates and collabs focused on Battle Royale. Yes they made new modes but BR still receives the majority of the attention.",
            "Tbf Festival is the only one that I can see passion from the devs that’s reflected in the playerbase as well",
            "I'm like 99.99(repeating)% sure each mode has their own respective team.\n\nThe BR team has likely been cooking this Reload mode for a month or two, and are also working on skins and the rest.\n\nThe Lego team is likely working on making Lego styles for all 1000+ skins and also adding new mechanics\n\nThe Festival team are likely working on adding tracks and stages each FSeason.\n\nThe RRacing team are likely working on porting RL cars and making unique tracks \n\nThe STW team are non-existant (/s if needed)\n\nThey are focusing on each mode, each team is likely working hard, and the BR team has been working on this mode.\n\nI understand you are just likely mad that the other modes have been getting more focus as they are all new modes with much less content, but trust me when I say BR is definitely still on the front of their mind as it is the most profitable and most played game mode.",
            "This doesn’t sound like BR when you read into it lol",
            "fortnite players try to not complain about completely unrelated modes challenge (impossible)"
        ]
    },
    "Oh hiiiii, Tilted 👋": {
        "title": "Oh hiiiii, Tilted 👋",
        "score": 2157,
        "url": "https://v.redd.it/ek8zqyaa7y7d1",
        "content": "",
        "num_comments": 416,
        "comments": [
            "https://x.com/fortnitegame/status/1804182998579056649?s=46\n> A place of high energy!! And forgiveness. All new mode - TOMORROW!",
            "This is probably gonna be like resurgence from warzone, smaller map, less players, if your partner stays alive for a certain amount of time you get reloaded in",
            "Wonder if this will be fn version of rebirth🤷‍♂️",
            "I don’t think they’re ever bringing back the OG map in its entirety again now. This is probably gonna be a permanent mode.",
            "Wonder if there are ZB and Build versions of this?",
            "RETAIL ROWWWWWWWW",
            "Hell yeah. Fortnite finally remembered they could create alternate game modes and draw in millions of people. Good start to the revamp!",
            "Not a bad idea. Maybe a 25, or 50 player BR. Maybe quicker storm too, so fast games",
            "If this ends up being a permanent build/zb mode with updates and a potentially a map rotation (which i think would work well with this gamemode and could bring back more og stuff) it would be amazing",
            "I’m hoping this becomes a permanent mode, this looks like an awesome mini BR. Might even break me away from Shadow of the Erdtree"
        ]
    }
}