{
    "Monthly Content Sharing Post": {
        "title": "Monthly Content Sharing Post",
        "score": 4,
        "url": "https://www.reddit.com/r/fortinet/comments/1d59ye1/monthly_content_sharing_post/",
        "content": "Please provide a link to your content (blog, video or instructional guide) to share with us.  Please accompany your post with a brief summary of your content.\n\nNote:  This is not a place to advertise your services or self-promote content you are trying to sell.  Moderators will review posts for content and anyone violating this will be banned.",
        "num_comments": 0,
        "comments": []
    },
    "Learning how to ask a support question": {
        "title": "Learning how to ask a support question",
        "score": 19,
        "url": "https://www.reddit.com/r/fortinet/comments/1aovupq/learning_how_to_ask_a_support_question/",
        "content": "This is a generic post, however it relates (in my experience) to supporting security and networking environments.  Some might find this post patronizing but that's not the intention - it's to talk openly about the issue and offer solutions ...\n\nThe single biggest factor (and frustration) for anyone offering support is the quality of a support query. This refers to both end-users and technical folk. No offense to anyone but IT engineers can be particularly bad at this.\n\nTo a degree, you can expect low quality queries from end-users, but it's often the case that IT folk themselves (as comes out in the wash and many posts here) ask low quality questions leading to more generic answers, or a difficulty in narrowing down on solutions.\n\nWe can ask the question why ...\n\n* you're in the heat of the moment, maybe panicked and don't take/have the time to formulate a question properly\n* maybe you genuinely don't know how to ask a question\n* you haven't done your homework in preparing to ask a question\n* you're just lazy and want someone else to do the hard work\n* etc.\n\nI'll add one last/special item to the list:\n\nThere's very few courses IT folk can do on how to support a variety of technical environments that includes both literate and \"non-literate\" users (by non-literate I mean an end-user that is not trained in a specific IT discipline and therefore can't be expected to provide technically-oriented supporting info). I'm talking about the process of supporting an environment, not the technical details themselves. ITIL probably comes closest but how many have completed this?\n\nAnd the % of IT folk who have done some form of customer service or formal operational support training is very low. This has a huge impact on the efficiency of resolving technical queries.\n\nAnyone requesting support needs to remember that the provider can (generally) only support the requester based on what information is given to them. A low quality query will lead to extended resolution times, and sometimes no resolution at all. It's a waste of both the requester's and provider's time, and can lead to frustration on both sides. Note I'm not assigning fault here, it's simply fact.\n\nBoth the asking for and resolving of technical support is an art, and requires a logical state-based step-by-step approach. You need to move from A through to Z otherwise you could miss an important factor relating to the issue. You need to be patient.  You need to be methodical. There's also a component of teasing certain information out of the requester, an option that assists in the troubleshooting process.\n\nNot everyone is made or in a position to provide good quality queries or responses. And sometimes through no fault of their own. So there's also an aspect of patience needed in cases like this.\n\nHow do we resolve this? I don't think there's a one stop methodology that fits everyone, and one that will give you a 100% or even high success rate. But putting some processes in place can improve the situation.\n\n* both sides need to be patient\n* be methodical and don't skip troubleshooting steps\n* taking more time upfront could result in a speedier resolution\n* understand as a requester that the more info you give up front, the easier it is to support your query\n* as a supporter, learn to ask leading questions that give you the info you need\n* make sure you have documentation\n* put in place, and enforce, a technical support policy\n* have change control, ticketing, infra design, etc. in place\n* and so on\n\nThe no. 10 rule of this forum talks specifically to this issue. Yes it's last on the list - maybe it should be higher, although all the others arguably have equal or more importance. But the fact is that a good percentage of questions asked here (and on other forums) are low quality, and this is indicative of the state of support in orgs. Folk post questions here in the same fashion as done internally in their orgs.\n\nIf both sides of the fence make more effort, both camps will benefit.\n\nA ramble ...",
        "num_comments": 23,
        "comments": [
            "The real issue is that the industry is full of solution jockeys and very few actual engineers. The solution in business is to have these people baby sitted by engineers. The solution online is to troll and shame them for being retards.",
            "Pinning this because it should be considered before posting for help. Thanks for writing this up!",
            "Thanks for the reply - I agree with you to an extent although I don't think it's that simple. My post assumes a minimum level of capability on the engineer's side. If we don't have that, then yes, it's a crapshoot.",
            "Thanks for the expansion u/ultimattt. It's great to see discussion on this topic.\n\nI'll add another from my side: never make assumptions ... always confirm each piece of information as fact before acting on it (of course if possible, sometimes there is no choice). I've been down the rabbit hole many times before realising that it's the wrong rabbit hole.",
            "Thanks u/EyePnetworks some very good points made here especially when dealing with external vendors.",
            "Oh duuuuude, that f-ing feeling when you realize you’ve been chasing the wrong thing for too long.",
            "There is no doubt situations where one should call and ask for urgency, but this shouldn't be abused for every small request someone have. This is all I am saying :)",
            ">To the requester: If it’s important, or you’re not getting the response you need in the time you need it, pick up the phone and call.\n\nBad idea. It often happens that CSRs verbal promises to do something, only to never follow through, and then later feign ignorance of even making the assurance. Even for simple callbacks. \n\nThat's where written communication keeps an audit trail. Which, sometimes, is also a corporate requirement.\n\n>Phone calls are always prioritized over ticket entries and emails.\n\nI hope not. Issues should be assigned a priority depending on the criticality, no matter how they are reported, and dealt with according to this assigned priority.",
            "Let me tell you something from experience, the majority of \"IT engineers\" calling on a hotline, are the worst from the OP lists e.g. the ones that are too lazy or under qualified or both and wants someone else to do the hard work (have you heard the term \"do the needful\" ?). Not all, but the majority!  \n  \nThe problem with this calls is, just ask yourself a question: Would a really expert engineer in any field accept a job where he sits there and waits for random phone calls e.g. like call center ? Knowing that the majority of those calls are almost scam and waste of skills and time ? \n\nLet me answer it for you - No! Skilled engineers does not work on a phone hot line. \n\nThe chance to get someone experienced by calling on the phone is slim, and the chance to get someone experienced in the specific topic you have issue with is even smaller.\n\nThe minority of the calls which are really reasonable, for real P1 situations, suffer the most from this, because vendors cannot afford to put enough skilled engineers which would answer the high amount of scam calls and maintain reasonable price for the service at the same time.\n\nOn the other side, if you report your query properly and point to the issue with the corresponding logs and information, the chance to get someone more experienced in that field is much higher.\n\nAlso adjust your expectations according to the SLAs in the contract you have signed, it should also list the specific conditions required for ticket prioritization.",
            "And at times it can be.   \n\n\n\"Waiting for Vendor to email back\"   \n\n\nExecutives loves this one response!!!"
        ]
    },
    "Fortigate 200f available": {
        "title": "Fortigate 200f available",
        "score": 3,
        "url": "https://www.reddit.com/r/fortinet/comments/1drc0bu/fortigate_200f_available/",
        "content": "Good day... I just pulled a 3 year old fortigate 200f from a rack.\nLicensing expired early June.\nFirewall is still in mint condition..\nWhat would it sell for and where would you sell it? \nIt is currently registered to me and would be transfered to new owner.\n\n",
        "num_comments": 12,
        "comments": [
            "2500 for a used 200F? Jesus new with our discount they are only a tad more.",
            "Market is ultimately going to decide, but I feel like you could get somewhere between $2000 and $2500 based on what I see on ebay history. Might take awhile to move it though, you could try r/homelabsales",
            "You could contract Fortinet for a trade up / trade in. They have a dedicated division for that. Probably only get a minor discount for a newer model, but at least less e-waste or the hassle of transferring ownership.( Sometimes it's a pain)",
            "Use that for a trade in for a new Forti ;-)",
            "Heck, I just got an NFR quote back on a 120G for under $2500 with 1yr of UTM",
            "I tried that when upgrading... Didn't make sense what they where offering for it.. Should still be able to get at least 2 grand for it the way I see it",
            "Hahah I got it for 1500$ as nfr",
            "Damn, why the heck is Ingram/Forti ripping me off",
            "Yeah, we had that conclusion as well, dont get much value. But to sale a corporate asset is pain for accounting and asset management. Therefore, we chose for trade up or just have another third party do digital shedding. If you are not in a heavy regulated section, e.g. health or financial. You should just sale it online and make sure you could transfer the ownership successfully. I have a occasion that Fortinet screwups a firewall's ownership and was under another guys name. They outsource so much resources, it's hard to find support on account level right away.( Not talking about tech support)",
            "Was that with licensing/support? Legit curious how you got that"
        ]
    },
    "Problem Fortclient VPN post update to version 7.4.0.1658": {
        "title": "Problem Fortclient VPN post update to version 7.4.0.1658",
        "score": 3,
        "url": "https://www.reddit.com/r/fortinet/comments/1drbgvd/problem_fortclient_vpn_post_update_to_version/",
        "content": "After updating fortclient VPN, icon disappeared from systemtray and does not connect to SSL VPN, freezes in connecting status",
        "num_comments": 5,
        "comments": [
            "Resolved: Install Visual C++ Redistributable for Visual Studio",
            "Well shit.  We tried 7.4 without success.  This may be it....\n\nThanks",
            "How did you figure out that you needed this installed?",
            "On the fortnet forum. One user said they solved it by manually running the executable fortray.exe\n\nI tried to do this and it gave DLL not found error.  \nAnd from previous experience I already knew that this DLL was included in Visual C++ Redistributable\n\nI installed it and it worked",
            "Where and how?"
        ]
    },
    "Losing connectivity after enabling HA": {
        "title": "Losing connectivity after enabling HA",
        "score": 3,
        "url": "https://www.reddit.com/r/fortinet/comments/1dr8nfc/losing_connectivity_after_enabling_ha/",
        "content": "SOLVED - Issue wasn't with Fortigate-VM. Needed to turn on Port Mirroring for the Virtual Switch in Hyper-V. Thanks all for your help.\n\nRecently got 2 Fortigate-VM 7.4 to practice on and wanted to activate HA.  This is the setup prior to enabling HA.\n\nFW-Primary: [192.168.1.39/24](http://192.168.1.39/24)\n\nFW-Secondary: [192.168.1.40/24](http://192.168.1.40/24)\n\nAt this stage, I can access both FW like normal through the browser and SSH. However, once I configure HA and click on Save, as per below config:\n\n**FW-Primary**\n\n    config system ha\n      set group-id 1\n      set group-name \"TEST-CLUSTER\"\n      set mode a-p\n      set password <omited>\n      set hbdev \"port2\" 0\n      set priority 255\n      set monitor \"port1\"\n\n**FW-Secondary**\n\n    config system ha\n      set group-id 1\n      set group-name \"TEST-CLUSTER\"\n      set mode a-p\n      set password <omited>\n      set hbdev \"port2\" 0\n      set priority 129\n      set monitor \"port1\"\n\nI immediately lose access and cannot ping or connect to the FW-Primary anymore. Even after clearing the ARP-Cache on the switch multiple times, I still cannot access the the FW-Primary and it just shows ping unreachable.\n\nIf I console into FW-Primary and ping itself (192.168.1.39) then it succeeds but I cannot ping the gateway.\n\nIf I console into FW-Secondary, I can see it syncing with FW-Primary and the configuration is duplicated over.\n\nOnce I console into FW-Primary and change the HA mode back to standalone, then I regain access. I'm not sure if I'm missing anything and would appreciate some help and guidance.\n\nhttps://preview.redd.it/j70tfsn4sh9d1.png?width=567&format=png&auto=webp&s=b727c40aa3bb66314a94ad7de9984fb67b255d35",
        "num_comments": 9,
        "comments": [
            "If you still want to reach them on their individual ips you need to set up individual management ips (In band or out of band as you prefer or need).\nYou can find a guide in the knowledge base.",
            "Primary should have the lower number to have the higher priority.",
            "For me, I can't even access the Primary IP. After activating HA, both the IP of FW-Primary and FW-Secondary becomes unreachable. So once I activate HA, I'm fully locked out from the FW apart from using console.",
            "Yes, I have done that. Same result. After the duplication is done, both FW-Primary and FW-Secondary shows that they are holding .39\n\nCore Switch still can't ping .39 even after 30 mins.",
            "Yeah agreed. It looks like OP issue is on your hyper-v networking side.\n\nHA sounds like it's working as intended.",
            "Holy hell, you're right. I enabled the port mirroring then it works. So it was actually the IP/MAC issue. Thanks!",
            "If those are the Lan interfaces. Turning on HA mode will make the secondary match the first one. As said you need to make dedicated management interfaces if you want to access the GUI of both at the same time. Once in HA, the firewall with the longest uptime and lowest serial number will become the HA primary. You have also set the secondary with the lower priority number. Meaning it is the preferred device. \n\nOnce done you will only see the primary IP as the IP of the cluster. The second IP is gone. They will fail over and take over the use of that one primary IP. \n\nYou can force failovers by resetting the HA uptime through the cli of the primary firewall at the time. What your finding is normal operation in other words.\n\n\nEdit: deleted link as I posted the wrong one.",
            "Setup your primary .39 first, leave it running with HA turned on for 5 minutes at least. Set it as having the lower priority number.\n\nReboot the secondary .40 unit and join it to the HA. With the higher priority number (reverse your current config). Allow time to sync. You will only ever see 1 IP after Ha is turned on. The secondary unit mirrors the primary. In active-passive mode one unit is in essentially standby mode. In active active you hand over sessions for processing but still only ever see one unit and again only ever see one IP.",
            "My guess is that this is an issue with the Hyper-V switch and the FGT mgmt virtual IP/MAC. However, could also be split brain due to HA not working correctly.\n\nDoes \"get sys ha status\" show them members in-sync? If not try unicast heartbeat: [https://docs.fortinet.com/document/fortigate-private-cloud/6.4.0/microsoft-hyper-v-administration-guide/397100/high-availability](https://docs.fortinet.com/document/fortigate-private-cloud/6.4.0/microsoft-hyper-v-administration-guide/397100/high-availability)"
        ]
    }
}