{
    "Monthly Content Sharing Post": {
        "title": "Monthly Content Sharing Post",
        "score": 4,
        "url": "https://www.reddit.com/r/fortinet/comments/1d59ye1/monthly_content_sharing_post/",
        "content": "Please provide a link to your content (blog, video or instructional guide) to share with us.  Please accompany your post with a brief summary of your content.\n\nNote:  This is not a place to advertise your services or self-promote content you are trying to sell.  Moderators will review posts for content and anyone violating this will be banned.",
        "num_comments": 0,
        "comments": []
    },
    "Learning how to ask a support question": {
        "title": "Learning how to ask a support question",
        "score": 19,
        "url": "https://www.reddit.com/r/fortinet/comments/1aovupq/learning_how_to_ask_a_support_question/",
        "content": "This is a generic post, however it relates (in my experience) to supporting security and networking environments.  Some might find this post patronizing but that's not the intention - it's to talk openly about the issue and offer solutions ...\n\nThe single biggest factor (and frustration) for anyone offering support is the quality of a support query. This refers to both end-users and technical folk. No offense to anyone but IT engineers can be particularly bad at this.\n\nTo a degree, you can expect low quality queries from end-users, but it's often the case that IT folk themselves (as comes out in the wash and many posts here) ask low quality questions leading to more generic answers, or a difficulty in narrowing down on solutions.\n\nWe can ask the question why ...\n\n* you're in the heat of the moment, maybe panicked and don't take/have the time to formulate a question properly\n* maybe you genuinely don't know how to ask a question\n* you haven't done your homework in preparing to ask a question\n* you're just lazy and want someone else to do the hard work\n* etc.\n\nI'll add one last/special item to the list:\n\nThere's very few courses IT folk can do on how to support a variety of technical environments that includes both literate and \"non-literate\" users (by non-literate I mean an end-user that is not trained in a specific IT discipline and therefore can't be expected to provide technically-oriented supporting info). I'm talking about the process of supporting an environment, not the technical details themselves. ITIL probably comes closest but how many have completed this?\n\nAnd the % of IT folk who have done some form of customer service or formal operational support training is very low. This has a huge impact on the efficiency of resolving technical queries.\n\nAnyone requesting support needs to remember that the provider can (generally) only support the requester based on what information is given to them. A low quality query will lead to extended resolution times, and sometimes no resolution at all. It's a waste of both the requester's and provider's time, and can lead to frustration on both sides. Note I'm not assigning fault here, it's simply fact.\n\nBoth the asking for and resolving of technical support is an art, and requires a logical state-based step-by-step approach. You need to move from A through to Z otherwise you could miss an important factor relating to the issue. You need to be patient.  You need to be methodical. There's also a component of teasing certain information out of the requester, an option that assists in the troubleshooting process.\n\nNot everyone is made or in a position to provide good quality queries or responses. And sometimes through no fault of their own. So there's also an aspect of patience needed in cases like this.\n\nHow do we resolve this? I don't think there's a one stop methodology that fits everyone, and one that will give you a 100% or even high success rate. But putting some processes in place can improve the situation.\n\n* both sides need to be patient\n* be methodical and don't skip troubleshooting steps\n* taking more time upfront could result in a speedier resolution\n* understand as a requester that the more info you give up front, the easier it is to support your query\n* as a supporter, learn to ask leading questions that give you the info you need\n* make sure you have documentation\n* put in place, and enforce, a technical support policy\n* have change control, ticketing, infra design, etc. in place\n* and so on\n\nThe no. 10 rule of this forum talks specifically to this issue. Yes it's last on the list - maybe it should be higher, although all the others arguably have equal or more importance. But the fact is that a good percentage of questions asked here (and on other forums) are low quality, and this is indicative of the state of support in orgs. Folk post questions here in the same fashion as done internally in their orgs.\n\nIf both sides of the fence make more effort, both camps will benefit.\n\nA ramble ...",
        "num_comments": 23,
        "comments": [
            "The real issue is that the industry is full of solution jockeys and very few actual engineers. The solution in business is to have these people baby sitted by engineers. The solution online is to troll and shame them for being retards.",
            "Pinning this because it should be considered before posting for help. Thanks for writing this up!",
            "I’m going to add a few more:\n\nTo the requester: If it’s important, or you’re not getting the response you need in the time you need it, pick up the phone and call. Phone calls are always prioritized over ticket entries and emails.\n\nTo the support provider: I cannot overstate the importance of u/rpedrica’s statement on asking leading questions. Ask how it’s supposed to work, ask why they feel it’s not working (even caveat with “I’m not familiar with how you use it, so help me see it from your eyes”), ask if anything has changed, and while this is not your fault, show empathy, I’m not saying apologize, but do acknowledge the frustration, after all you’re their last life line, they would have taken all steps (as few/many as those were) before calling you.",
            "Having read numerous support tickets with only the statement *X doesn't work* I couldn't agree more on this.   \nI tell all customers and partners to be very specific with what the perceived issue is, when did it happen, was something changed before the issue happened, what troubleshooting steps has been taken, etc. The more relevant information you provide, the better the answer from TAC will be. \n\nRespone times is another thing I often see people having opinions about. Mostly it comes down to people not knowing the SLA and the terms in the support contract. Be sure to know what to expect when you register a ticket with a certain priority level.",
            "Thanks for the reply - I agree with you to an extent although I don't think it's that simple. My post assumes a minimum level of capability on the engineer's side. If we don't have that, then yes, it's a crapshoot.",
            "Thanks u/afroman_says!",
            ">To the requester: If it’s important, or you’re not getting the response you need in the time you need it, pick up the phone and call.\n\nBad idea. It often happens that CSRs verbal promises to do something, only to never follow through, and then later feign ignorance of even making the assurance. Even for simple callbacks. \n\nThat's where written communication keeps an audit trail. Which, sometimes, is also a corporate requirement.\n\n>Phone calls are always prioritized over ticket entries and emails.\n\nI hope not. Issues should be assigned a priority depending on the criticality, no matter how they are reported, and dealt with according to this assigned priority.",
            "Thanks for the expansion u/ultimattt. It's great to see discussion on this topic.\n\nI'll add another from my side: never make assumptions ... always confirm each piece of information as fact before acting on it (of course if possible, sometimes there is no choice). I've been down the rabbit hole many times before realising that it's the wrong rabbit hole.",
            "Thanks u/EyePnetworks some very good points made here especially when dealing with external vendors.",
            "[deleted]"
        ]
    },
    "Which Fortinet certification should I look at? ": {
        "title": "Which Fortinet certification should I look at? ",
        "score": 5,
        "url": "https://www.reddit.com/r/fortinet/comments/1dqz503/which_fortinet_certification_should_i_look_at/",
        "content": "I am looking to take a Fortinet certification in the coming months.  The company I work for is beginning to deploy them to our customers so in more of an MSP/ISP based role.  Is there any one certification that would lend more of a focus on this aspect?  I am currently looking at the FCP-Network Security. ",
        "num_comments": 8,
        "comments": [
            "The FCP is the right cert to start with.\nJust got mine this week 🙂",
            "Make sure your company registers as a partner. Get your FCF and FCA, they are both free to take in the partner portal. Reach out to your channel team to claim a fortigate 70f as a gift (sometimes supply chain prevents, but last I checked they were doing this). Use tolhe 70F to prepare for your FCP.",
            "Start with fcf and fca if you're new to fortigate",
            "None. You don’t need it. Just learn it.",
            "Fortinet it self has a \"training institute\" (https://training.fortinet.com/). Everything you need to learn and to prepare for exams is available there. For free.\n\nUnless you decide yourself that you need other sources as well (there is always youtube and other learning platforms that might offer Fortinet stuff) - there is no need. Just make sure that you always use the Fortinet training as the main source (because this is the exam is based on).\n\nAnd yes, the FCP woud be the first (bigger) exam to take - from there it is up to you which path you want to take next (you can't \"block\" yourself from an certificate by doing another cert - the only thing you might \"lose\" is time).\n\nGood luck on your journey",
            "Why would you waste time on certificates? \nNo bigger time waster than IT certifications.\nI have CCNA, beyond CCNP knowledge and I earn more than many CCIEs 😅",
            "How was your exam? What did you use for studying?",
            "I believe they are offering a 70F, switch and AP now. At least that is what our channel reps told us."
        ]
    },
    "Fortimanager": {
        "title": "Fortimanager",
        "score": 5,
        "url": "https://www.reddit.com/r/fortinet/comments/1dqtn7z/fortimanager/",
        "content": "An abundance of changes were made on the Fortigate, APs added, and DHCP reservations created.  What is the proper steps to pull those changes into FMG?  Needless to say their local admin login has been removed. ",
        "num_comments": 11,
        "comments": [
            "Device Manager - > Managed Devices - > Double click the FortiGate - > Dashboard - > Summary - > 'Configuration and Installation' widget - > Revision - > select the menu icon  - > Retrieve",
            "Overwrite the local changes, and have the person responsible enter them on the FortiManager.",
            "If you want them to learn a lesson, follow u/FrequentFractionator's advice. \n\nOtherwise depending on the changes you might be able to retrieve them.",
            "If a config change was made locally on the gate, Fortimanager will pick this up automatically and show \"auto-update\" under status instead of \"synchronized\". If a policy change was made on the gate too then you could get a conflict error. If in doubt you can either diff the configs between the manager and the gate or just \"retrieve config\" on the manager and do a fresh policy import and overwrite what you already have to essentially get back to a clean state between both.",
            "Depending on the version of FortiOS and FortiManager you are running, all of those are device level changes and should be synced back to the FortiManager automatically.",
            "Most has been already said about \"device settings\" - there are different approaches (some are more optimal, others maybe not as much or have more worked involved).\n\nI just want to add - the config part that is definitively NOT being synced back from the Fortigate to the Fortimanager are local changes on the Fortigate to firewall policies (and some other related configs - address objects, etc.).  \nThose are NOT synced back as they are not \"device settings\\* and you will need to deal with that sync specifically and with due care.",
            "https://community.fortinet.com/t5/FortiManager/Technical-Tip-How-to-fix-synchronization-issue-in-FortiManager/ta-p/223802",
            "I would love to but that would take the entire wireless down. I’m not looking for what I’d like to do but how can I get those changes into FMG",
            "This is the way",
            "In that case have them enter the changes into FortiManager and check the install preview. If there are still changes pending, they are not done entering all changes."
        ]
    },
    "Question about old fortiap": {
        "title": "Question about old fortiap",
        "score": 1,
        "url": "https://www.reddit.com/r/fortinet/comments/1dquqz2/question_about_old_fortiap/",
        "content": "My work gave me a few old fortiaps to mess around with, model 220b, I am able to access them with the serial cli, but when logging into the web console it flashes the proper screen the kicks me back to the login screen. I cannot upgrade the firmware because the fortinet website wants them to be licensed, but they are old and no longer licensed to my knowledge. I tried using an old version of firefox to see if it was a browser issue and no luck. This is my cfg -s output if it helps:\n\n    FAPxxxxxxxxxxxxx # cfg -s\n    BAUD_RATE:=9600\n    LOGIN_PASSWD_ENC:xxxxxxxxxxxxxxxxxxxxxxx\n    ADMIN_TIMEOUT:=5\n    ADDR_MODE:=DHCP\n    AP_IPADDR:=192.168.1.9\n    AP_NETMASK:=255.255.255.0\n    IPGW:=192.168.1.1\n    AP_MODE:=0\n    DNS_SERVER:=208.91.112.53\n    STP_MODE:=0\n    AP_MGMT_VLAN_ID:=0\n    TELNET_ALLOW:=0\n    HTTP_ALLOW:=1\n    DDNS_ENABLE:=0\n    AC_DISCOVERY_TYPE:=0\n    AC_IPADDR_1:=192.168.1.1\n    AC_HOSTNAME_1:=_capwap-control._udp.example.com\n    AC_DISCOVERY_MC_ADDR:=224.0.1.140\n    AC_DISCOVERY_DHCP_OPTION_CODE:=138\n    AC_DISCOVERY_FCLD_APCTRL:=\n    AC_DISCOVERY_FCLD_ID:=\n    AC_DISCOVERY_FCLD_PASSWD:=\n    AC_CTL_PORT:=5246\n    AC_DATA_CHAN_SEC:=2\n    MESH_AP_TYPE:=0\n    MESH_MAX_HOPS:=4\n    MESH_SCORE_HOP_WEIGHT:=50\n    MESH_SCORE_CHAN_WEIGHT:=1\n    MESH_SCORE_RATE_WEIGHT:=1\n    MESH_SCORE_BAND_WEIGHT:=100\n    MESH_SCORE_RSSI_WEIGHT:=100",
        "num_comments": 0,
        "comments": []
    }
}