{
    "FH5: Series 35 Autumn Seasonal Breakdown and Rewards ": {
        "title": "FH5: Series 35 Autumn Seasonal Breakdown and Rewards ",
        "score": 18,
        "url": "https://www.reddit.com/gallery/1dpsfmz",
        "content": "# Miscellaneous\n\n> **20 Pts** - IONIQ 5 N ‘23 *(New)*      \n> **40 Pts** - Nissan Z ‘23         \n\n> **Photo** - Take a photo of any car used in the *Horizon Special: World's Fastest story* in *Guanajuato*.\n>> `Reward: Keeno - Nocturne (Song)`\n\n**Weekly** \n\n• 2020 Toyota GR Supra               \n• Earn 6 Stars at Speed Traps           \n• Win a Drag Race Event          \n• Drive for 5 miles (8km)           \n\n> **EventLab** - *Laderas Core* - B700 + Retro Sports Cars - Road Racing     \n>> `Reward: Shark Outfit (Clothes)`\n\n> **EventLab** - *Mexico Island Raceway Club* - A800 + Japan - Road Racing\n>> `Reward: Ford Mustang S5`\n\n> **Horizon Open** - Earn 5 Clean Racing Skills in any Horizon Open Racing Event.\n>> `Reward: Painter Hoodie (Clothes)`\n\n> **Collectibles** - Smash 10 Robots near Gran Telescopio.\n>> `Reward: The Robot (Emote)`\n\n# Online\n\n> **The Trial** - A800 + Honda - Dirt Racing \n>> `Reward: Ferrari 812`\n\n> **PGG** - S2:998 + Anything Goes - Ek’Balam \n>> `Reward: Pop ‘n’ Lock (Emote)`\n\n# PR Stunts\n\n> **Speed Zone** - *Orilla Del Río* - 193,1kph / 120mph - S2:998 + Anything Goes      \n>> `Reward: Super Wheelspin`\n\n> **Drift Zone** - *Arbolada* - 150,000 Pts - S2:998 + Anything Goes    \n>> `Reward: Super Wheelspin` \n\n# Championships\n\n> **Dodging Demons and Dirt** - S1:900 + Rally Monsters - Cross Country     \n>> `Reward: Dodge SRT Demon`\n\n> **Keeping Things Civil** - A800 + Super Hot Hatch - Street Scene  \n>> `Reward: Honda Civic ‘18`\n\n> **Delta With It** - S1:900 + Modern Supercars - Road Racing\n>> `Reward: Lancia Delta`\n\n# Rally Adventure Challenges\n\n> **Speed Trap** - *Orogrande Rush* - 257,5kph / 160mph - S2:998 + Anything Goes \n>> `Reward: Super Wheelspin`\n\n> **Turbo Reservations** - B700 + Subaru - Dirt Racing \n>> `Reward: 911 Turbo ‘14`\n\n# Hot Wheels Challenges\n\n> **Danger Sign** - *Ice Crash* - 600m / 1968,5ft - S2:998 + Anything Goes \n>> `Reward: Super Wheelspin`\n\n> **Picking Your Favourite** - S1:900 + Forza Cover Cars - Speed Racing \n>> `Reward: M-B SLS AMG`\n\n",
        "num_comments": 20,
        "comments": [
            "So what cars are actually in the \"World's Fastest\" story? I've tried the Jesko and the Concept Two but neither are counting, and I don't even see the story on the map to check.",
            "this week championship, the dodging demons are crazy hard, S1 900 is too fast for those tracks, took me 3 tries with a friend clearing this, definitely not fun since all my attention are glued to the track and one mishap will cost you dearly..",
            "Thanks for these each week! We appreciate you!",
            "So in the info update it says you can win kia’s new electric vehicle for 20 points in the autumn challenges. Am i missing something or did they just call the ioniq 5 a kia?",
            "Anyone else stuck on 1.2 of 5 miles for the 2020 Supra GR?",
            "One of the Eventlab rewards this week is a Ford Mustang S5. Is this car in the Autoshow to buy? I ask because I don't see it anywhere under \"Ford\". Does anyone know the specific name and year of this car????",
            "Hello, just got the game from the sale. I feel like I'm overlooking or misunderstanding something. I'm working my way through the playlist but for the Bugatti event it wants me to spend 2 mil on a car just to participate. That seems completely absurd.",
            "I actually think they've made the AI faster than usual this time.\n\nThat championship is doing wonders for my blood pressure... /s",
            "I found it pretty easy with the hoonigan RS200. Cleared it solo on my 1st try.",
            "2018 Ford Mustang RTR Spec 5 - 105,000 Cr in the Autoshow"
        ]
    },
    "Go get Horizon 4 if you don’t have it, NOW!": {
        "title": "Go get Horizon 4 if you don’t have it, NOW!",
        "score": 3830,
        "url": "https://i.redd.it/q0dq1qmwtq8d1.jpeg",
        "content": "",
        "num_comments": 751,
        "comments": [
            "Oh man this is sad, it’s my favorite Forza game, already have the game with its dlc on Microsoft store, maybe I should get it on steam too 🤣",
            "The other thing I noticed is you will be able to buy backstage passes with forzathon points",
            "Horizon 4 is one of the best racing games out there, definitely worth getting.",
            "This game is the sole reason I visited Scotland and the UK last year.\n\nIf I wanted to own it whole, that would be the Deluxe or Ultimate edition? I just want the DLCs, not interested about the cars.",
            "Looks like all editions are 80% off on Steam. As someone who has only played Horizon 5, I think I'm going to bite.",
            "Unfortunate, but them adding every playlist exclusive car to the backstage & continuing to give out those backstage passes even after the delist is such an incredibly W move",
            "Will the seasons still change every seven days after August 22?",
            "Guess I gotta buy it now. Anyone know how cheap FH3 was right before it was delisted?",
            "this is my first forza horizon game, i liked it very much, i still wish i could get FH3 on steam though",
            "I didn't realise they've still been running series for FH4. Great news about making all previously exclusive cars forever available."
        ]
    },
    "It's been 6 years. What were some of the best memories you had/made?": {
        "title": "It's been 6 years. What were some of the best memories you had/made?",
        "score": 283,
        "url": "https://i.redd.it/byxx4faxhh9d1.jpeg",
        "content": "",
        "num_comments": 75,
        "comments": [
            "Definitely the forzathon lives. Setting alarms 10 minutes before the forzathon began, the sheer number of people, it was almost always just pure fun ( except when your teammates cannot offroad drift )",
            "Winning the Hypercar shootout trial after 15 to 20 attempts with awful team mates.",
            "Hitting npc cars in the left lane when in your country you drive on the right.",
            "I loved  Isha's Taxis chapters ... took me at least 15 tries to beat the last one ... but it was fun most of the time and that's why it stays in my heart!",
            "Coming back to racing games after a decade away. Forza Horizon 4 was my first Horizon and my first racing game back since NFS: Underground 2. Shout out to Gamepass for making it all possible. I do miss FH4s map, Mexico in FH5 is played out. I've had enough of this map at this point, I'm ready for FH6, I was really hoping they'd announce the new Horizon at their games event this year.",
            "Met one of my best friends in this game",
            "Probably the best memories is racing up and down the motorway in FH4. \n\nAlways folks hanging out at each end parked up around the roundabouts, messing around honking, racing etc was nice",
            "Still didnt get used driving on the wrong line of the road 🤣",
            "The other night I was cruising in my Trackhawk and rolled up on a bunch of Mopar bros. Challengers demons and my trackhawk doing 40 rolls and dragging. No events just a hellcat fest. Twas awesome.",
            "The time I avoided the entire defending team on a Flag Rush game and got the flag into the area and caused two people on the other team to rage quit"
        ]
    },
    "Microsoft actually gifted me FH4 because i bought Fortune Island years ago, does anyone else had this chance ?": {
        "title": "Microsoft actually gifted me FH4 because i bought Fortune Island years ago, does anyone else had this chance ?",
        "score": 112,
        "url": "https://i.redd.it/5b8cqd0m6g9d1.jpeg",
        "content": "",
        "num_comments": 30,
        "comments": [
            "I saw another post where someone said if you played it through game pass but bought a dlc you get the game for free.",
            "Ages ago I bought the expansion pack and played through Game Pass, and they gave me a code today as well.",
            "Yes, multiple similar posts today",
            "Yup, got it by just having the Lego DLC. Never owned the base game itself.",
            "based move from xbox turns out i have like 5 other codes like this for other games",
            "I haven’t gotten mine yet and I bought the Lego dlc. Guess I have to keep waiting :(",
            "I had the same message because I bought the expansion passes.... Also happened with Forza Motorsport 7 😊 have both on disc so saves me having to get my lazy a$$ up to change discs lol",
            "Yeah, I bought Lego Champions way before they announced fh4 delisting",
            "Yes, just happened to me too, it's an old game but it's still a nice gift :)",
            "I got this message as well."
        ]
    },
    "Katya is a dirty rammer": {
        "title": "Katya is a dirty rammer",
        "score": 56,
        "url": "https://v.redd.it/2tlf3ze4ug9d1",
        "content": "",
        "num_comments": 16,
        "comments": [
            "AI is going really crazy this season.",
            "Rami lives up to his name with me.\n\nAlways..",
            "The bots at the start always swerve",
            "I don't know how you can play with inconsistent fps, maybe it's just the recording software but it's stuttering so bad.",
            "Cute CRX you got there bro 🥰",
            "I've been completely yeeted off the map once. It was a trial a couple months back where a race started right before a large bridge. As we went over it one of the AI cars turned into me with the force of an unstoppable object launching me into the ravine below. Had no choice but to do a rewind and ended up behind everyone.",
            "The AI is much worse in FH4.I can deal with them in 5 but in 4 they have a force field",
            "It happened to me too during the last trial. I was sure it was a real asshole but... it wasn't",
            "Who me? What did I do?",
            "i have a GTX 3070 playing on Ultra there's no issues on my end."
        ]
    }
}