{
    "Help Me Choose / Daily Discussion (Post here to follow rules A & B) - Saturday June 22, 2024": {
        "title": "Help Me Choose / Daily Discussion (Post here to follow rules A & B) - Saturday June 22, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/fragrance/comments/1dlser6/help_me_choose_daily_discussion_post_here_to/",
        "content": "Looking for a signature scent, or a new scent for the season? Need suggestions of scents to try? \n\nShopping advice? Trying to decide between two fragrances? Searching for \"the best\" of anything?\n\nWondering what to wear to school, to work, on a date, or for a special occasion? \n\nTrying to choose a fragrance to give as a gift?\n\nThis is the place to ask those questions.\n\nTell us what you want the fragrance to smell like. You can list notes, styles, or the names of other fragrances that you like or don't like. \n\n***Without this information you are unlikely to get any recommendations.*** \n\nOther information that may be helpful -- your country/region, your budget, some description of the person who will be wearing the perfume.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n***When can you ask these questions in your own post?***\n\n* If you aren't getting suggestions, your request may be too vague. If you’ve tried your best and didn’t hear back after 24 hours, make a new post outside the daily thread. Be sure to mention that you already posted in the daily thread and didn't get a response.\n* If your question is about clones, layering, or some very unusual note, you can choose to skip the queue and post directly to the front page.\n* If your question is about sex appeal, batch variations, performance, or wearing perfume marketed to another gender, keep it off the main feed and in the comments section only.\n\n💥 Need immediate answers? Legit check? Batch comparison? Best place to buy bottles and decants? Advice on how to wear a specific perfume? **Try asking your question on Discord!** \n\n[LINK TO DISCORD](https://discord.gg/ChzvxqsQwy)\n\nComing back to discuss hits and misses is a great way to show appreciation when you get advice here. Consider posting a review or starting a discussion about the perfumes that you tried, and tell us what you ultimately chose.",
        "num_comments": 9,
        "comments": [
            "I am looking for a fragrance for my graduation day! The heat is scorching in July so I need something fresh but also unique. I was about to get bal d afrique but the performance didn’t convince me. 24M btw",
            "I’m looking for a new niche signature scent. \nI’ve been wearing This Is Her by Zadig&Voltaire for years now and that’s really my signature scent. I haven’t found anything like it that scratches my itch. \nI never thought I would like this sweet, lactonic smell but somehow it captivates me every time. At first I thought it was the sandalwood that really fit me, so I bought Santal Volcanique by Maison Crivelli and Bois de Balincourt by Maison Louis Marie. Although I like them, they’re not my favorite. I even think Bois de Balincourt smells like pickles on me sometimes. \nDoes anybody have any recommendations?",
            "M21 in Southern California (it can get hot but i avoid heat and sweating as much as i can). I don't like chemical (idk how else to describe them) smelling colognes. I'm also sensitive to super strong scents they make my head hurt. Anyone have recommendations for somewhat natural smelling and not super strong fragrances that aren't too expensive (less than $50). Even better if they're widely available in walmart, Target, etc. looking for something to have on all day without being overpowering",
            "does anyone know the name of this perfume i’ve been trying to find it everywhere (not sure if this should be a comment or separate post)\n\nhttps://preview.redd.it/gq5fwd32648d1.jpeg?width=563&format=pjpg&auto=webp&s=6e7c7510b60c930968ab08d351cb9cc72956ff11",
            "What about an Aqua Allegoria that you can re-spray during the day? Very festive!",
            "Kerosene Summer of 84",
            "Blanche bête is supposedly a creamy skin scent. Try picking up a sample of that. You could also give commodity milk a go although to me that pulls a bit more woody than lactonic, that's not everyone's experience.",
            "DS & Durga discovery set (particularly Radio Bombay)",
            "Actually, maybe check out Ode to Dulness. To me it's in the same family as This is Her. I pick up slight fruitiness a bit of the star anise, it's great.\n\nShunkoin from Xerjoff is also an interesting sandalwood with a hint of coconut, but not sweet."
        ]
    },
    "SOTD Saturday June 22, 2024": {
        "title": "SOTD Saturday June 22, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/fragrance/comments/1dlseqv/sotd_saturday_june_22_2024/",
        "content": "Welcome! Please post your scent of the day here in the daily community thread. \n\nFor accessibility and to help new users we kindly ask that you type out the full name of your fragrance. \n\nPosting just the name is fine, but we love it when you tell us a little bit more.\n\nSome ideas:\n\n* Describe the scent or what you like best about it\n* Tell us why you chose it today\n* Tell us how wearing it makes you feel\n* Tell us something that the scent reminds you of or helps you to imagine\n* Describe your local weather, and/or tell us what you're doing today\n\n[Join the r/fragrance Discord](https://discord.com/invite/ChzvxqsQwy)",
        "num_comments": 12,
        "comments": [
            "Chanel Paris - Venise! The citrusy notes mixed with iris are the best for this heat and I just love my fruity florals anytime.",
            "Currently wearing Le Labo Gaiac 10 , a fresh woody scent that compliments the rainy season in a tropical country. Gaiac reminds me of a dewey rainforest and I always feel refreshed everytime I’m wearing it.",
            "L’ombre dans l’eau ",
            "Akro - Infuse eau de parfum\n\nThe shop assistant sprayed this twice on my arm this afternoon. \n\nOolong tea, osmanthus and apricot is what does it for me. My hope is that it makes it past the 4 hour mark, even in today's 37°C, so I can buy a bottle.\nThis is the best tea perfume I have ever met.\n\nI am looking forward to wear the perfume I bought today, to go through the samples that came with the purchase. And, of course, to share it all with you.",
            "Bvlgari au The Bleu ",
            "Recently got interested in sampling again, so today I'm wearing Memento Santa Casa by Filippo Sorcinelli. This wasn't even on my to-try list, but I saw a picture of the bottle on the website I was ordering from and I was just too intrigued. Literally sprayed 10 minutes ago so this isn't a proper review, but so far I smell mostly smoke and vetiver, in a good way. \n\nI also ordered samples of A'mmare by Carthusia and Olibanum by Profumum Roma, will probably try those later today.",
            "Going with Rosendo mateu no.5 amber,floral, sensual musk. \n\nFor me a safe bet and good chance to be my first signature scent.",
            "Second wear of a 2023 blind buy **Demeter Thunderstorm**\n\nGot it in the fall and just couldn't smell it. Is it one of those molecule fragrances? Because yep, am among the woeful minority who can't smell ambrox, cetalox, amberwood etc.\n\nBut in the hope that instead, this one really blooms in heat and humid thunderstorm weather, I'll give it another try 🤞",
            "This morning I'm wearing Commodity Moss+. It was the first perfume I ever bought and it's still probably in top 5 out of all the ones I've tried. It has so many of my favorite notes and they just come together so nicely! It doesn't last super long on me (4-5 hours max) but I don't really mind.\n\nI actually chose it today because I have a first date after work and I want to wear something different for that. It's supposed to be hot and it's just a casual afternoon boba date so I'm trying to beside between Imaginary Authors' Sundrunk or Falling Into The Sea or ELDO's You Or Someone Like You. Suggestions welcome.",
            "Portrait of a Lady\n\nMy first blind buy fail that I picked up a few weeks ago, and after half a dozen wears I think it’s finally grown on me. I still didn’t love it this morning, but a few hours ago I was watching The Boys with my chin resting in my hands and caught a big hit of it and it smelled great. I think I didn’t like it initially because it’s so different to what I expected, but I think it might have clicked. \n\nI have been wearing a lot of rose over the last few weeks to try and appreciate it more, so I think that helped. I also sprayed some Nishane Favonius on card today and that’s one I know have to buy."
        ]
    },
    "Why do people want nasty scents ": {
        "title": "Why do people want nasty scents ",
        "score": 183,
        "url": "https://www.reddit.com/r/fragrance/comments/1dlc47g/why_do_people_want_nasty_scents/",
        "content": "Genuine question. Why do people want perfumes that smell like \"saliva, blood, and cum\" or want animal type smells? What's the appeal in wearing pigs blood. Do people actually wear this stuff??? Or is it just like to build a collection. I'm new to the fragrance game and haven't developed my pallette quite yet so ... enlighten me please lol",
        "num_comments": 205,
        "comments": [
            " Some people approach fragrance as an art or entertainment. Like I can't stand scary movies but some people have to have them. And some people do collect fragrances they don't necessarily want to wear. I'm into superhero movies and mall perfumes. Others want the most accurate mountain lion postcoital fragrance they can get. ",
            "I think most of it isn't that extreme. For example, I like pure green fragrances (think: just-watered garden, dirt, etc). Some ppl think it just smells bad & like \"outside\" &c. I also really enjoy this one fragrance that was modelled after the smell of an ant pile. Not in a I-trained-my-nose way, but in a genuine, my first-instinct taste is in this direction—it's just a matter of taste\n\nPersonally, I love to see it. I saw a request for a \"bone\" scented fragrance earlier this week, and it was really fun & exciting to see",
            "As others have said, the more extreme ones are sometimes intended to be art, and people like them more because they are interesting or thought provoking than because they are pleasant. Like how people don't always want to listen to upbeat pop music, but sometimes want something angry or sad or with harsh guitars or screamy vocals.\n\nBut also, people just have different tastes. A lot of people genuinely like animalic notes, or notes like dirt or metallic notes or green notes. Animalic notes used to be common even in really popular fragrances because they smell good. They don't smell good to you maybe, but that doesn't make them not a good smell.\n\nAnd lastly, a lot of fragrances claim that they have out-there notes like \"blood\" or \"cocaine\" or \"credit cards\" or whatever as purely a marketing thing. The ad copy (because that's what note lists are) is far more shocking than the actually fragrance. If no one told you those notes were supposed to be there, you'd never guess.",
            "Because it's entertaining. To me, perfume is like 10% fashion accessory and 90% fun. These scents lean into the fun part of it. I enjoy it when perfumers push the boundaries like this. It also develops my own sensibility, to smell different things outside the context they're usually found in. (Doesn't mean I'd wear Against Nature to a job interview, mind.)",
            "Fragrance is art and not all art has to be pretty. \n\nOther than that, some people find various types of animalic stink rather comforting. \n\nDifferent tastes.",
            "For the same reason you have people who enjoy extreme piercings and tattoos,people have different tastes. Some people absolutely hate gourmands. Some people do like building a collection of different fragrances. Also the notes don’t mean they quite literally smell like that,I think..either way those types of perfumes aren’t popular, I don’t think it’s common to casually run into someone wearing such a scent either",
            "It's preference and a little bit of fun. I love heavy animalics. I genuinely like the smell and I appreciate the artistry. Do I wear them out and subject the general populace to sweaty booty scents? No lol HOWEVER, I do love when I come across an animalic that's very wearable like the Francesca Bianchi line. I wouldn't wear them to work, but out and about doing errands or on a night out I sure would.",
            "I'm fascinated by scents that are evocative, whether or not they are pretty, traditional scents. I love when they manage to create an *experience* using scent. \n\nA fragrance that feels like walking along a rocky beach on a rainy day next to the forest...wet earth and stone, driftwood, salt, seaweed, pine needles...it immediately brings me there and I love that. \n\nA campfire on a late summer night, smoky and earthy and maybe some ground coffee..\n\nOlympic Orchid's Kingston Ferry is *the exact* experience of walking around an old ferry dock. How did they do that??\n\nSpent gunpowder, leather, and  paper. An old pistol in a dark study, smoking a pipe. \n\n That's what I love about it. Creating or re-creating a memory through scent. \n\nI also like standard fragrances and they are most of what I wear daily but these other ones are the ones that excite me. They are an experience.",
            "In this space? People really appreciate the hobby, and find genuine joy and appreciation for the artistry behind a photorealistic scent. Around the office? ✨attention✨ lmao",
            "Take a look at [this](https://www.russh.com/schiaparelli-haute-couture-ss22/). Do you see people wearing clothes like that at the local wal-mart? Would you wear that on a date?\n\nDo you consider [this a pleasant painting](https://albertinum.skd.museum/en/exhibitions/der-krieg/) to hang above your fireplace in your living room?\n\nYou can wear a comfy t-shirt, you can put up a painting of a pleasant sunny landscape. But some people creating clothing and paintings are using them as a medium for artistic expression, not just decoration\n\nSame goes for fragrance."
        ]
    },
    "My impression of 6 hyped niche fragrances": {
        "title": "My impression of 6 hyped niche fragrances",
        "score": 8,
        "url": "https://www.reddit.com/r/fragrance/comments/1dlut0s/my_impression_of_6_hyped_niche_fragrances/",
        "content": "So I bought a fragrance and I decided to add a few samples of popular fragrance to my order. I usually selecy my samples with different criteria but this time I just wanted to know what some hyped fragragrances smell like.\n\n**Parfums de Marly delina**: Strong dislike, something just smells off to me. Rose with some sharp and acidic fruitiness. there is also a weird note slightly reminiscent of gasoline that makes my nose dry and phisically uncomfortable. Does not get better in the drydown. It is the one I disliked more of the bunch and I am surprised It 's considered a crowdpleaser.\n\n**Goldfield & Banks Ingenious Ginger:** I really liked this one. Opens sparkly, zesty and uplifting whith some floral undetones, and turns into a sweet candied ginger kind of smell. The drydown is a slightly spicy, warm vanilla. It is a nothing groundbraking but pleasant to my nose, overall quite sweet and leans feminine.\n\n**Liquides Imaginaire Blanche Bete** : I already knew I don't get along well with lactionic notes, but I wanted to try this one and give one last chance to this category. I did not hate It, but the milky note is exremely strong and prevented me from enjoying the fragrance. Opens with a blast of tuberose and Jasmine, after a few seconds the powder milk note prevails over anything else. In the drydown in tones down a little bit and becomes a musky laconic white floral.\n\n**Floraiku One Umbrella For Two:** The most unique of the bunch. Opens very savory and  nutty. Than jammy, sour fruity notes make thair appereance. It reminded me slighly of L' Erbolario Argan in the opening, but It is overall quite different from anying else I have tested . It is sweet but not overly so, maybe because the savoury \"toasted\" smell prevails over the sugary smell. Definitely very edible smelling though. Not my kind of fragrance but I found it interesting.\n\n**BDK Gris Charnel**: I thought I was going to love this one but found It  meh. Maybe my nose is broken. The opening is strong on cardamom, but I didn' t pick up the fig nor the tea note. Once top notes  are gone I don' t even smell any spiciness, but a quite fresh Iris/sandalwood fragrance. Definitely unisex, not unpleasant, totally forgettable.\n\n**Dusita Le pavillon D' or:** Ok this one is not really hyped, but I have seen people mention Dusita quite often. Maybe I choose the wrong fragrance from her. It was just unpleasant chaotic sour green with pissy notes to me. It tones down a bit in the drydown to be more wearable.",
        "num_comments": 1,
        "comments": [
            "You might really like Gingermoss by Pineward. It's gorgeous and not too spicy!"
        ]
    },
    "What perfumes are popular amongst Emirati woman? ": {
        "title": "What perfumes are popular amongst Emirati woman? ",
        "score": 14,
        "url": "https://www.reddit.com/r/fragrance/comments/1dlprvz/what_perfumes_are_popular_amongst_emirati_woman/",
        "content": "Maybe we have Emirati women here? Or anyone living in UAE. What perfumes are popular in UAE? I just visited Abu Dhabi, the heat is blasting there but still, every local person seems to smell amazing and kind of strong but I really liked it.",
        "num_comments": 23,
        "comments": [
            "Baciami by Bvlgari is popular right now. You might be smelling that, but honestly Emirati women wear everything and tend to have large perfume collections. They buy what’s new and being promoted in the malls. You can always ask the workers promoting designer perfumes around the mall too, they are everywhere and will let you know what locals are buying.",
            "Before I answer you, keep in mind that most Emirati women use Bukhoor (incense? Not exactly sure if that's the correct English term) and they use it on their clothes/hair before going out. \nThey also tend to layer and use oud or musk oil before applying their perfumes. \nNow, besides that, Perfumes by Anfasic Dukhoon (shay shay is their best seller and it's a local Emirati brand found in mall booths. They're mainly known for their bukhoor),\n\n Abdulsamad al Quraishi - Musk Al aroos (bridal white musk oil or oil turned perfume - they do this in store.)\n\nSi by Giorgio Armani was very popular at some point and I think it still is. If you walk into a local sephora you can ask the employees for the popular perfumes bought by Emirati women. Also, underrated brand used by some Emiratis is Roberto Cavalli. Guerlain's Santal Royale, and Dior's perfume Gris Dior and Oud Ispahan are also commonly used. Besides those, some people do use Lattafa, and perfumes/oils from Rasasi and Swiss Arabian (all local companies to the UAE).",
            "i used to work as a fragrance specialist for versace and then ysl in sephora and debenhams dubai and i agree with everyone commenting - emirati women (and men) love to layer scents so from body wash to lotion to body powder the perfume oils then perfume (some even go the extra mile and spray on a body most before perfume - one that has either similar or complementary notes) and then a little razzle dazzle with bakhoor (smoke).",
            "It’s very likely they are wearing attars - oil based (alcohol free) perfumes. \n\nMany of them contain Oud - so that might be a note you enjoy.\n\nEdited to add: I have a few attars in my collection, and they tend to be strong with massive sillage and longevity. Definitely a fun and inexpensive way to play with new scents.",
            "Is there a good UK source anyone can recommend for attars? I had an amazing bottle of attar of roses I brought back from Egypt, but it suffered a sad fate.",
            "Sidebar on attars: are they best in hotter climates or would they still work in, say, Ireland? I’ve had mixed results in the cold and damp with oils. Seems they need the alcohol to disperse",
            "Yes, I think I might do that as I am still for a few days. My mission is to buy a few fragrances now :D So I will ask shop assistants for some help.",
            "Just to add on - Incence as in wood chips, oud, sandalwood, oil infused pressed tablets, etc. \n\nNot the common frankincense and myrrh incense.",
            "This is an NZ website which I’m familiar with, to give you an idea of what I’m talking about. \n\nhttps://www.dubaiaroma.nz",
            "I would say it depends on the Attar since there are many there which are priced with way over 1k especially the ones with really old Oud in there."
        ]
    }
}