{
    "Help Me Choose / Daily Discussion (Post here to follow rules A & B) - Saturday June 29, 2024": {
        "title": "Help Me Choose / Daily Discussion (Post here to follow rules A & B) - Saturday June 29, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/fragrance/comments/1dr7yfy/help_me_choose_daily_discussion_post_here_to/",
        "content": "Looking for a signature scent, or a new scent for the season? Need suggestions of scents to try? \n\nShopping advice? Trying to decide between two fragrances? Searching for \"the best\" of anything?\n\nWondering what to wear to school, to work, on a date, or for a special occasion? \n\nTrying to choose a fragrance to give as a gift?\n\nThis is the place to ask those questions.\n\nTell us what you want the fragrance to smell like. You can list notes, styles, or the names of other fragrances that you like or don't like. \n\n***Without this information you are unlikely to get any recommendations.*** \n\nOther information that may be helpful -- your country/region, your budget, some description of the person who will be wearing the perfume.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n***When can you ask these questions in your own post?***\n\n* If you aren't getting suggestions, your request may be too vague. If you’ve tried your best and didn’t hear back after 24 hours, make a new post outside the daily thread. Be sure to mention that you already posted in the daily thread and didn't get a response.\n* If your question is about clones, layering, or some very unusual note, you can choose to skip the queue and post directly to the front page.\n* If your question is about sex appeal, batch variations, performance, or wearing perfume marketed to another gender, keep it off the main feed and in the comments section only.\n\n💥 Need immediate answers? Legit check? Batch comparison? Best place to buy bottles and decants? Advice on how to wear a specific perfume? **Try asking your question on Discord!** \n\n[LINK TO DISCORD](https://discord.gg/ChzvxqsQwy)\n\nComing back to discuss hits and misses is a great way to show appreciation when you get advice here. Consider posting a review or starting a discussion about the perfumes that you tried, and tell us what you ultimately chose.",
        "num_comments": 8,
        "comments": [
            "Maybe Van Cleef & Arpels Bois D’Amande or Orchidee Vanille for more elevated feeling sweet/gourmand scents?",
            "Fzotic Ummagumma (spicy chocolate) \n\nMFK BR540, Xerjoff Italica and Profumum Roma Confetto for almond",
            "This is so reassuring, thank you!!! Maybe it’s a good sign to go back to basics like you’ve said and come back to these after I’ve covered that base, to see if my thoughts have changed\n\nETA: Would there be any classics/designers that you’d recommend re-starting with? :)",
            "I’m not sure if this is too long for this post, so please let me know and I will make a separate post :)\n\nLooking for scent recommendations/tips on how to find a new favourite scent family after finding no hands-down winners from 30 samples. I’m new to fragrance and am struggling a bit with feeling like a scent problem-child! \n\nI recently bought 30 fragrance samples from Scent Split and The Perfumed Court (mostly dabbers) after looking through recommendations and reviews on here. I thought I liked gourmand scents, but the ones I’ve bought seem to be too sweet/copying compared to the ✨idea✨ I’ve had of them. So I’m looking for recommendations of fragrances I might like based on the samples I didn’t ~mind~, \nor \nrecommendations on how to figure out a scent family that I enjoy to restart the hunt.\n\nLikes, but not loves:\n- Killian Rolling in Love \n- Killian Princess (but did come across a bit too ginger-y on my skin)\n- Montale Chocolate Greedy (nice but I wasn’t blown away)\n- Killian Black Phantom\n- Croissant Cafe\n- Panettone (interesting, but not sure if it’s a scent I would wear)\n- Vicious Caca\n- Zadig and Voltaire This Is Her (the first musk I’ve found that hasn’t made me think of a toilet spray)\n\nDislikes: \n- Montale Cafe Intense (I thought I liked this, until I put it around my face and it something in it made me feel sick) \n- Bianco Latte \n- Drink Menta (this smelt almost off on my skin) \n- Hot Milk (this smelt almost like lavender to me?)\n- Chocolate Citronique \n- Amore Cafe (smells like Black Opium to me which I find a bit sickening)\n- Over the Chocolate Shop (this had some sort of almost tobacco scent on me)\n- Créma Di Latte\n- Ouai Melrose Place\n- Chabaud de Lait \n- Zoologist Harvest Mouse \n- Issey Drop D’Issey\n- DS & Durga I Don’t Know What (this smelt too “green”!on me)\n- Sorcellerie the Cookie Party (smelt like buttered popcorn to me) \n- Escentric Molecules Molecule 1 + Iris \n- Diptique Fleur de Peau (ever since someone described this as smelling like clean genitalia, I haven’t been able to properly get rid of this association lol, there really is something…intense about it in a way that’s a bit too heavy for me, but maybe it could be layered with something??)\n- Hermes Twilly\n- Chloé EDP\n- Kayali Musk (it reads as a toilet spray on my skin)\n- My Burberry \n\nOf perfumes I already own, I really like Si Armani, and like the dry downs for Glossier You and Floral Street’s Sweet Almond after they’ve been worn-in for a few hours, but the opening of both aren’t quite right for me to justify the wait and zero projection. Otherwise Kayali Vanilla is nice, but not wow.",
            "Hi! My mum has yet again requested perfume(s) for her birthday so I’m looking for recommendations based off her current collection. I’m not very knowledgeable about notes etc but willing to learn :)\n\nSome info:\n\nHer all time fave - has repurchased many times: CK Euphoria \n\nLoves - repurchased a few times: CH Good Girl, Zara hibiscus recently \n\nLikes: PR Olympea, Narciso Rodriguez for her forever\n\nIndifferent - wears ocassionally because she has it: La vie est belle\n\nDislikes - does not wear at all: Armani Sì, JPG Scandal \n\nShe’s tried a Jo Malone (can’t recall exact one) but unsurprisingly finds it doesn’t last. \n\nNot sure if this is of any help but appreciate any suggestions, both designer and niche. No set budget, but I’d be nervous to blind buy. Thank you!",
            "Which smells way better?\n\nVersace Yellow Diamond\n\nVersace Eros Pour Femme\n\nI like fresh scents btw.",
            "Just chiming in to say that especially starting out, I bet I liked maybe 1 in 50 *at best*! \n\nAnd if I'd started with as many niche as you appear to have, it might've been fewer!\n\nMy recommendation is to start with the classics and designers. They are proven. If something that debuted at least 15 years ago is still being made, it is a proven winner. \n\nNot saying to stick with only the most popular! \n\nJust keep experimenting. Now that I know my likes, I have a better hit-to-miss ratio. \n\nPeople here mention getting bundled samples or minis on eBay or the second-hand sites. Maybe try that if you're on a budget. \n\nGood luck on your quest  🍀",
            "Imo it's too individual. \n\nIf you haven't already, maybe make an account (it's free) on Parfumo and enter the ones you liked as your collection (delete later as you go). \n\nDoing so gives you access to its analysis tools. It will give you breakdowns and types and categories. Start there."
        ]
    },
    "SOTD Saturday June 29, 2024": {
        "title": "SOTD Saturday June 29, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/fragrance/comments/1dr7yfu/sotd_saturday_june_29_2024/",
        "content": "Welcome! Please post your scent of the day here in the daily community thread. \n\nFor accessibility and to help new users we kindly ask that you type out the full name of your fragrance. \n\nPosting just the name is fine, but we love it when you tell us a little bit more.\n\nSome ideas:\n\n* Describe the scent or what you like best about it\n* Tell us why you chose it today\n* Tell us how wearing it makes you feel\n* Tell us something that the scent reminds you of or helps you to imagine\n* Describe your local weather, and/or tell us what you're doing today\n\n[Join the r/fragrance Discord](https://discord.com/invite/ChzvxqsQwy)",
        "num_comments": 12,
        "comments": [
            "It’s finally warm but not so hot that it makes my health act up, there’s lots blooming in the garden, happy bees everywhere, and I’m having a good friend over for a barbecue (or rather what we call “barbecue” here in Europe). Life is good and I’m wearing Annick Goutal’s Songes. Sultry, tropical white flowers, a lot floral sweetness, great stuff. I’m rarely in the mood for it but every time I do wear it I’m blown away.",
            "SOTD: Bon Parfumeur 104 - green orange, hyacinth & ivy",
            "I did a thing yesterday and I'm going to try it again today. Hermès Un Jardin à Cythère on my outer, flowy layer and Chanel Gabrielle Chanel Essence on my skin.",
            "Here in Melbourne Australia it is mid winter and raining today.  I decided to wear Olfactive Studio’s Panorama.  It is woody and slightly sweet but also features a very unusual note of wasabi, which surprisingly works with that hint of spice",
            "Continuing with my Zoologist samples, today I went for Nightingale. It's a super-mossy floral chypre. Oakmoss is one of my favorite notes, so I'm a big fan. It's elegant enough that it'd be a lovely special occasion fragrance, while not being unusable on the day-to-day (and thank goodness for that, because I'm at work today).\n\nThe rose chypre formula reminds me of ELDO's Exit The King. Exit The King is more fresh and soapy, whereas Nightingale is warmer and more amber-y, but they could be cousins in my book.",
            "**Nishane Sultan Vetiver.**\n\nIt's a drab, rainy day here in Pittsburgh, and I'm a loamy mulch boi.",
            "Hello Printemps - Yves Rocher\n\nNice refreshing light scent for warm summer day.",
            "**Atelier Studios Orange Sanguine**\n\nIt was on my Must Try list. Then I heard they were pulling out of North America to \"reinvision.\" So I blind-bought a whopping big bottle. \n\nIt's everything (and no more) that you've heard: the smell arising when slicing a good Florida orange into quarters.\n\n(Say what you want about Florida but they do have the world's best oranges)\n\nIf I overspray a lot - my notes say 8 sprays - it projects and lasts pretty well.\n\n🍊🍃",
            "My SOTD is **Zara Vibrant Leather Warm**. \n\nIts a personal sorrow that this one has been discontinued. I am saving the last 20mL of my bottle, using once a season. \n\nI can't discern or describe notes within, but I can describe how it feels I love its metallic-clean-slightly sweet feel. Also, I find there a clean fabric note as well, which really ties the fragrance together very well. Wish the performance was a bit better. \n\nI especially love wearing it on sweaters or sweatshirts. Makes me feel very cozy yet clean & airy. \n\nI am from India, and the local weather is hot. Saying it's 'tropical' is just a polite and sugarcoated way of saying it's superhot and humid. The weather doesn't help a perfumes performance and really stunts it.",
            "Hermès - Concentré d'orange verte\n\nI did 6 sprays today, but I wanted 10 or something 😊 greedy. The 34°C weather makes me a citrus addict of sorts.\n\nWe traveled to a city nearby so my husband can attend an athletic event in the evening. Just as we were entering the hotel, I smelled Blanche bête in the wild for the first time ever. I had debated in my head earlier, and the green orange had won.\n\nThere is an air of serendipity around today.\n\nSomething is up 😊 and I wonder if I manage to figure it out in advance."
        ]
    },
    "Rough experience at Louis Vuitton": {
        "title": "Rough experience at Louis Vuitton",
        "score": 111,
        "url": "https://www.reddit.com/r/fragrance/comments/1dr2t21/rough_experience_at_louis_vuitton/",
        "content": "I recently had a frustrating experience at a Louis Vuitton store in Los Angeles while trying to explore their fragrance collection. I had heard great things about their scents and was excited to find a new fragrance to add to my collection.\n\nWhen I arrived, the store was fairly busy, and the sales associates seemed occupied. I decided to start sampling a few fragrances on my own, spraying them onto test strips and taking my time to appreciate the different notes. As I was enjoying the scents, one of the employees approached me saying, “Excuse me, but do you even know what you’re looking for?” sounding more condescending than helpful. I told him I was just exploring and trying to find a fragrance I liked, but he cut me off, insisting that I shouldn’t just spray the perfumes randomly.\n\nAs he sprayed the fragrances on the test cards for me, I described my personal thoughts and what I was smelling. But every time I said I smelled a specific note, such as pickles in the new LV Lovers fragrance, he would argue and tell me that wasn't what I was smelling. That really annoyed me because who is he to tell me what I smell?? The entire interaction left me feeling humiliated and unwelcome.\n\nThere were some nicer sales associates who asked if I needed assistance, but that specific sales associate made me leave the store without making a purchase.",
        "num_comments": 44,
        "comments": [
            "That's too bad. It sounds like you just got stuck dealing with a douche. I've had several good experiences at LV in Scottsdale and own 3 of their fragrances. You should definitely leave them a review.",
            "Not surprising. They definitely have a certain aura there. Both times I've gone I've purchased a fragrance and they still act snobby. Then I bought one online and that was an even worse experience with them. They messed up my address and refused to fix it. They kept blaming me and saving it was correct. And UPS couldn't fix it bc Louis Vuitton has full control on the delivery changes and you need to be there to get a signature. Had to call out of work to sign for it acted orseikg Saturday delivery. Total mess. Good thing for me I only liked 3 of their scents so won't see me back there for years.",
            "Talk to customer service. I had to do that because the Costa Mesa store treated me like shit when my mom and I *were* pretty loyal. Not anymore after that.",
            "Everybody thinks I’m crazy when I say I can smell pickles in some perfumes! I’m glad I’m not the only one!",
            "It sounds like you want to leave a review for this store? Maybe on Google?",
            "I thought it is a well known fact, that clerks in the low-level luxury brands are condescending on purpose? To make you feel unworthy and buy stuff just to make a point?",
            "Welcome to high end boutiques. Tale as old as (retail) time. They are there for sales and to chase customers they don’t want away.",
            "Thats the really shitty thing about designer stores: it’s all about management. Sometimes you get great assistance and sometimes they’re just snobby freaks. Unlike with other stores it doesn’t seem like on the “corporate” end they really enforce being nice to customers in designer stores so its all down to whether or not the manager is cool.",
            "Happened to me with Chanel beauty, she wasn’t helpful and couldn’t answer my question and looked down on me cuz I just wearing basic clothes. Ask for different SA if you can.",
            "These jumped up retail workers think they are special, because they are selling a luxury product that is in demand. \n\nAbsolutely no disrespect to retail workers, but it’s mostly low paid and low skill work. You’d think that some of these people hand crafted the goods themselves. Same thing happens when walking into a Rolex or Porsche showroom."
        ]
    },
    "Stop measuring longevity this way! ": {
        "title": "Stop measuring longevity this way! ",
        "score": 24,
        "url": "https://www.reddit.com/r/fragrance/comments/1dr6eq4/stop_measuring_longevity_this_way/",
        "content": "I have to mention this somewhere or else I'll go insane. I know it's not that big of a deal but still i get soooo annoyed by it!! \n\nWhy is it that on fragrance forums nowadays, especially fragrantica but everywhere else as well, everyone suddenly seems to measure the fragrance performance and longevity by spraying it on clothes!? It's fabric! It absorbs literally anything, it's not impressive! \n\nLiterally anything will stick to clothes staaahhp it!!. When a fragrance lasts for days on clothes it doesn't actually last for days!!! It just sticks to fabric because it's fabric!!! \n\n I've come across so many weak fragrances of wich people claim it lasts forever only to find out they meant on CLOTHES!! asside from the fact that fragrance doesn't develop and project the same on fabrick as it does in skin since it can't warm up on fabric and such. I do not want to need to spray on clothes in order for it to last?! When something doesn't last on skin for more then 3 hours but then lasts ages on clothes it is NOT A LONGLASTING FRAGRANE\n\n*ahem*\n\nThere i feel much better now haha. I mentioned this very politely on fragrantica and people just post over it talking again about the amasing longevity as they could smell it on their shirt all day. And if someone deares to mention the actual bad performance they have to be anosmic according to everyone else because it's lasts forever on their clothes. D: bleogjds \n\nAnyway thanks for reading my rant. XD have a good day.\n",
        "num_comments": 20,
        "comments": [
            "Seriously, I remember a while ago I commented someone in a frag sub on how they said the smell of their fav perfume lasts days on clothes. \n\nI was like “bleach would, too. Your point?” It’s like dealing with aliens who came to earth and surprised to find the basic fact. It doesn’t mean anything. Measuring SPL is not like that. And your fragrance is not an air freshener let alone **a fabric freshener.**",
            "Well, yes and no. If something doesn't last on clothes, it won't last on the skin. And the other way around. People that deal with perfumes are aware that there is a difference and they do not compare longevity on skin with longevity on fabric, there are different standards for both. Though for winter perfumes I really see no point in being annoyed they are tested on clothes, as this is how they will be worn. Only with summer fragrances I expect them to last on bare skin, and they usually don't.\n\nBtw, I wear perfumes at home, so almost always on my bare forearms. Hence I never-ever got a longevity that people mention in reviews. It is always few hours max. But it is to be expected.",
            "This would certainly explain the ratings on the various websites - a fragrance can’t be both weak and eternal lol",
            "Anybody rating longevity based on spraying on clothes is basically a pleb. It is completely meaningless when you offer longevity opinions based on spraying clothes, because there's no realistic time scale for accurate measurement. \n\nI remember Hibiscus Mahajad went 2 weeks on one of my office jackets when I was newer to the game, I know some ouds would likely make it 4 weeks. If 4 weeks is the 10/10, is 9/10 3.5 weeks? See how there's no realistic way to assess the result?",
            "I‘m sorry but… I‘d rather have a long-lasting on clothes-perfume than long-lasting on skin. Maybe it’s because I don’t usually walk around naked, though. 🤷‍♀️",
            "Well people measure it that way cuz that's how they spray, if they were to measure it on a test strip id be wrong cuz nobody sprays on test strips and puts them in their pocket, but people do spray on clothes, which is what makes it a useful parameter to compare for longevity.",
            "I am not annoyed that people spray on clothes i am annoyed that they judge the performance of the fragrance solely on how well it lasts on their clothes when the performance of a fragrance can't be judge by the way it behaves on fabric.",
            "XD that made me laugh haha. Ofcourse you can spray on clothes if you want but the performance isn't representative to the fragrance that way also you don't have to spray it on your nipples xD. You spray it on your neck and wrists in ex.. As we all know those to be the common places people spray perfume, not to say you can't spray on clothes I'm judy saying you can't judge the performance correctly if you only spray on clothes xD. I mean we all have our prefference. I spray myself all over usually. Hair, back of the neck etc. I also spray on my shirt but like i said the longevity of the fragrance can't be measured solely by the performance on fabric.\n\nBut no haha please don't walk around naked doused in perfume xD.",
            "You shouldn't base it's longevity off a teststrip and you shouldnt base it off of fabric either. Not saying you can't spray on clothes i am just saying literally everything lasts on clothes so it's not representative. If it doesn't last  more then an hour on skin it has poor longevity no matter how well it sticks to your clothes. :)",
            "If you compare apples to apples it is ok, no? I was comparing Gris Charnel Extrait to it's clone, and actually the biggest difference in performance was on clothes. Liam disappeared in few hours, Gris was still there with all complex notes on the second day. I think it is a great comparison, especially, that one of the things I love about Gris, is how it lingers on winter coats for days without becoming some sort of meh woody amber. Most people will always wear winter perfumes on top of fabric. hence that's how they judge. Unless you go comparing summer freshie worn on a sweaty, bare skin, with a winter perfume worn on woolen pullover (will stay for a weak) it is, imho, perfectly fine."
        ]
    },
    "Tom Ford- I’m converted ": {
        "title": "Tom Ford- I’m converted ",
        "score": 48,
        "url": "https://www.reddit.com/r/fragrance/comments/1dqxddu/tom_ford_im_converted/",
        "content": "I was walking past a counter at a store and finally smelled some Bitter Peach. I just can’t justify spending that price on a bottle of perfume but I LOVED it. I kept thinking of it all the way home. I haven’t felt that way about a fragrance in a long time. \n\nI was able to snag a second hand bottle for pretty cheap and I am absolutely infatuated. I was all anti- Tom Ford mostly for the price and some of the names put me off but now I’m converted. I also got Santal Blush from the same person and I am putting F***ing Fabulous on my list. \n\nSo this is my contrition, I love Tom Ford Fragrance now. ",
        "num_comments": 47,
        "comments": [
            "It’s overpriced but it’s also very well made so who cares— if you can afford it get it!",
            "He is overpriced, but Tom Ford is definitely a favorite fragrance house for me, by far. F***ing Fabulous, Tobacco Vanille, Fougere d'Argent, Neroli Portofino, Mandarino di Amalfi, Oud Wood, Noir Extreme, and Noir de Noir are among my favorites.",
            "Stay away from Oud Wood …. Instant buy if you smell it.",
            "This is exactly how I felt... Bitter Peach is what sent me on my fragrance journey (I've always liked perfumes but that one made me fall down the rabbit hole into it becoming an actual hobby). Lusted after it for 3 years before finally pulling the trigger for a good discount that took it juuuuust under my hard limit of £200. After testing 100s of perfumes it's still my #1 favourite. But I STILL think TF private line is horrifically overpriced. Overrated? I think that's a matter of opinion, though I suppose even \"overpriced\" is... but what I CAN say is it's actually one of very few brands where I like multiple of their offerings. It's rare for me to like more than 1-2 perfumes from a brand, rarer still if I like 3. More than 3? I can count all the brands on one hand.\n\nThe thing I really dig about TF is they straddle that line between mass-market appeal and the unusual with many of their releases. Nothing so crazy that people go \"WTF is this unwearable shit? Who is it for???\" but also daring enough that you don't see those scent profiles coming from other designer brands",
            "Wait'll ya get some ombre leather and tobacco vanille going.",
            "I have a slew of TF scents. All great quality and smell great. Fucking Fabulous is very good. Highly recommend it.",
            "I love Bitter Peach, too. And all their cherry scents. And Black Orchid. I don't get the Tom Ford hate honestly lol",
            "I love most of their fragrances. They’re really well done and smell great. They’re overpriced but I’m ok with buying on discounters or second hand. I got my bitter peach from the cosmetics company store which is like an estee lauder outlet, and I got it for half price.",
            "I love Tom Ford, though I feel like Fucking Fabulous is overhyped",
            "Yes! Every time I put on my travel spray of bitter peach I quietly curse stupid Tom Ford and his delicious expensive fragrances. Damn you Tom Ford!!"
        ]
    }
}