{
    "Wohin woll ihr unbedingt einmal in eurem Leben?": {
        "title": "Wohin woll ihr unbedingt einmal in eurem Leben?",
        "score": 9,
        "url": "https://www.reddit.com/r/FragReddit/comments/1dr4thg/wohin_woll_ihr_unbedingt_einmal_in_eurem_leben/",
        "content": "",
        "num_comments": 64,
        "comments": [
            "Japan zur Kirschblüte",
            "Ich will eigtl überall mal hinreisen.",
            "Kuba und Japan stehen bei mir ganz weit oben. Leider mit vorgegebenen Urlaubszeiträumen nahezu unbezahlbar für vier Leute.",
            "Die Pyramiden würde ich schon gern mal in echt sehen, auch wenn mich der klassische All-In Ägyptenurlaub nicht wirklich interessiert.",
            "Patagonien",
            "Dublin will ich unbedingt nochmal sehen",
            "Castrop-Rauxel. Die Perle an der Emscher",
            "Galapagos zum Tauchen.",
            "- zum Mond (sehr unwahrscheinlich)\n- Malaysia, Singapur und einmal in eine „echte“ Wüste: wird diesen Sommer passieren \n- Australien(einmal selbst Koalas sehen)\n- Afrika (mein Cousin wohnt da. Also ihn mal besuchen und gucken wie er so lebt)\n- Schottland (Whiskytour)\n- Griechenland (die alten Griechen besuchen:D)\n- Island und oder Finnland dort die Polarlichter sehen",
            "USA und da 2-3 Monate eine Rundreise durch das ganze Land machen, ist schon mein Traum seit ich klein war.\n\nEdit: Grammatik"
        ]
    },
    "Du wachst Nachts zu Hause in deinem Bett auf und hörst seltsame Geräusche an der Eingangstür, du realisierst schnell, Einbrecher kommen, was tust du jetzt? (Realistisch)?": {
        "title": "Du wachst Nachts zu Hause in deinem Bett auf und hörst seltsame Geräusche an der Eingangstür, du realisierst schnell, Einbrecher kommen, was tust du jetzt? (Realistisch)?",
        "score": 84,
        "url": "https://www.reddit.com/r/FragReddit/comments/1dqqqb5/du_wachst_nachts_zu_hause_in_deinem_bett_auf_und/",
        "content": "",
        "num_comments": 302,
        "comments": [
            "Diese Situation hatte ich vor fast 20 Jahren. \nMit dem Unterschied,  dass die Tür gerade dabei war aufzugehen,  als ich es fast durch den Flur geschafft hatte .\nHatte mich dagegen geschmissen, laut und und unzusammenhängend irgendeine scheisse gebrüllt (mein Freund wurde davon leider nicht wach) und die 110 angerufen. \nDie brauchten ca 45 Minuten und fanden uns insgesamt eher amüsant .\n\nDie Scheisse hat mich 10+ Jahre meines Lebens gekostet.\nÄngste, Panik, Schlafstörungen, Therapien- mit Anschaffung eines Hundes wurde es besser",
            "Als mein Nachbar im Vollsuff Spraydosen ins Lagerfeuer geschmissen hat, wachte ich aus dem Tiefschlaf auf und war der Meinung dass uns jemand die Terassentür zertritt.......\n\nAm Ende stand ich Splitterfasernackt mit einem Holzspeer welches die Kinder in unserem Zimmer liegen gelassen haben auf der Terrasse. \n\nDie Aktion des Nachbarn endete mit einem riesigen Polizeieinsatz und das Jahr darauf brannte deren Bude ab...\nAufgrund genannter Aktion und anderer Geschichten hat es niemanden gewundert als die Bude abgefackelt ist. Denn solche \"SO EIN FEUERBALL JUNGE!!!!\"\" Aktionen gab es ständig.",
            "Hatte ich tatsächlich mal. Hab mir ein Messer gegriffen und die atür aufgerissen. War damals in meiner 1-Zimmer Wohnung und die wären eh reingekommen. Deshalb wollte ich sie überraschen. Hat geklappt. Sie sind abgehauen",
            "Nackt ausziehen und in den verrückten Modus schalten und dann schreiend die Tür öffnen",
            "#WIR KAUFEN NIX !!",
            "Licht an, 110 wählen, während dessen zu den Kids und im Zimmer einschließen.\n\nDie Kids brauchen keinen Helden im Krankenhaus, die brauchen einen liebenden Papa Zuhause.",
            "Bei mir wars tagsüber, ich habe mich im Bad eingeschlossen und die Polizei gerufen. Sobald er mich gehört hat, ist er ohne Beute abgehauen.",
            "110 wählen, direkt die Adresse durchgeben. Lärm machen, damit die Einbrecher wissen dass du Zuhause bist.\n\nKeiner hat lust auf Konfrontation. Die meisten Einbrecher hauen sofort ab wenn sie wissen das du Zuhause bist bzw man ihn/sie gehört hat.",
            "Nun wenn sie noch nicht drin sind und ich nur die Geräusche höre, dann die Polizei rufen, dabei so laut sprechen, dass sie mich hören und die Tür zuhalten.\n\nWenn sie schon drin sind, puh. Ich gehe mal davon aus, dass die in irgendeiner Weise vorbereitet/bewaffnet sind. Helden spielen bringt da also nix. Handy hab ich i.d.R. nicht im Schlafzimmer, sonst hätte ich vielleicht von dort die Polizei gerufen oder wäre gar aus den Fenster gesprungen (Hochpattere) und hätte das von da gemacht.\n\nGgf. einfach so tun als schläft man und ein paar Schnarch Geräusche machen, ala es ist jemand da, der aber keine unmittelbare Gefahr ist. Klar kann man auch so tun als würde man telefonieren.\n\nAber ganz ehrlich, die sind schon drin, man wacht gerade auf, das Hirn funktioniert ohne hin noch nicht, Panik. Ich denke mal man wird sich da schon irgendwann gegenüber stehen.\n\nDann wohl probieren ruhig zu bleiben, ihnen bereitwillig alles in die Hände stopfen, was sie tragen können. Sollen sie sich freuen und verpissen. Kein Grund dafür im Zweifel sein Leben zu lassen.\n\nIch mein groß versteckt ist der Kram eh nicht und die finden relativ fix alles, da kann ich mich auch gleich kooperativ zeigen, sie ggf. beruhigen ala ist eh versichert etc. Hauptsache sie verpissen sich und ich hab nicht ein dritten Nasenloch oder ein Messer im Bauch.\n\nSo hinterher fällt mir ein, dass ich hier ein paar Amazon Echo Geräte habe. Keine Ahnung in wie weit die ein Notruf absetzen können. Aber ganz ehrlich, da würde ich in der Situation nie drauf kommen. Ich mein bevor ich meinen ersten Kaffee habe packe ich morgens schon einmal die Ofenhandschuhe, die im Weg liegen in den Kühlschrank..",
            "Ist mir tatsächlich schon mal passiert. Ich war am Schlafen und schlief direkt in dem Zimmer neben unserem Garten in der Türkei, wo ein ziemlich großer Zitronenbaum wuchs. Es war ein heißer Monat, also waren die Fenster offen. Nur das Fliegengitter war zu.\nWir haben vor der Haustür und in der Gartenecke einen Lichtsensor, der angeht, wenn etwas davorläuft. Der macht dann immer das bekannte Schalter-\"Klick\"-Geräusch beim Angehen. Dieses Geräusch hat mich schon stutzig gemacht. Habe mich dann mit dem Kopf Richtung Fenster gedreht.\nAuf einmal fing der Baum extrem zu rascheln an (unüblich bei einer Windstärke von 0 km/h). Gefühlte keine Sekunde später sah ich zwei Hände in schwarzen Handschuhen an der Veranda vom Fenster. Ich schrie extrem laut auf und weg war er. Da war ich glaube ich 15. Seitdem schlafe ich immer mit geschlossenen Jalousien und den Zitronenbaum haben wir umgepflanzt. Weit weg vom Fenster. Man sah sogar noch seine Dreckigen Schuhabdrücke an der Stelle wo er geklärt ist, da unser Garten nach der Bewässerung ziemlich matschig ist."
        ]
    },
    "Was würde passieren wenn Trump an die Macht kommt?": {
        "title": "Was würde passieren wenn Trump an die Macht kommt?",
        "score": 17,
        "url": "https://www.reddit.com/r/FragReddit/comments/1dqylnv/was_würde_passieren_wenn_trump_an_die_macht_kommt/",
        "content": "",
        "num_comments": 96,
        "comments": [
            "Er würde \"I WON BY A LOT!!!\" auf X posten, wie immer halt.",
            "Project 25",
            "In Grundzügen natürlich Project 2025, aber was er konkret machen wird, ist schwer zu sagen. Da Trump eben vollkommen unberechenbar ist und auch schon mal seine Politik umwirft, weil er sich in einer einseitigen Fernsehreportage oder in einem Telefonat mit einem \"Freund\" \"informiert\" hat. Und weil er nur wenig auf seine Berater hört, geschehen dann diese Wechsel ungebremst. Apropos Berater: In seiner ersten Amtszeit waren ja tatsächlich noch ein paar fähige, rationale Berater in seinem Stab. Die haben ein oder zwei mal das Schlimmste (z.B. einen Angriff auf den Iran) verhindert. Jetzt  wird es aber nur noch völlig verrückte Berater auf Trumplinie geben.\n\nAus dieser Mischung aus Rechtsextremen, Evangelikalen und \"Minimal-State\"-Liberalen kann nur eine toxische Mischung rauskommen. Welche genau, werden wir sehen. Der Supreme Court ist ja schon mal auf Trumps Seite. Es wird also wenig Bremsen geben, wenn es um Gesetze gegen Minderheiten, gegen Migranten und gegen Frauen geht. Oder wenn die Gesetze gewisse Gottesstaats-Vibes haben.\n\nInternational wird eine so sprunghafte USA eine Katastrophe sein. Der restliche Westen muss irgendwie hoffen da durch zu kommen, weil auf die USA absolut kein Verlass ist. Trump entscheidet ja nicht mal im Interesse seines Landes, sondern einfach nur nach Bauchgefühl und Profilierungsmöglichkeit.",
            "Tschau Kako Ukraine vermutlich",
            "Ich kann da John Olivers Auseinandersetzung mit dieser Frage sehr empfehlen:\n\nhttps://youtu.be/gYwqpx6lp_s?si=tA3OmGlAcU26Q-H6",
            "Autokratie Wird passieren. Siehe Project 2025",
            "Man kann nachlesen, was er tun wird.  [Project 2025](https://de.m.wikipedia.org/wiki/Project_2025)",
            "Gott kommt und schaltet alles ab, er hat genug gesehen und kein Bock mehr!",
            "einfach wieder 4 jahre lang seine fresse zu erst in der Tagesschau",
            "Zuerst ein paar soziale Unruhen, aber nix großes. Politisch wird sich die Trump Regierung wieder mehr auf innen- als auf außenpolitische Angelegenheiten kümmern. Das wird keinem wirklich gut tun aber in 4 Jahren kann er außer für die Ukraine nicht viel unumkehrbar kaputt machen. Es braucht nur einen Anti-Trump als Nachfolger damit alles wieder glattgebügelt werden kann."
        ]
    },
    "Was macht ihr, was man eigentlich nicht tun sollte (Wattestäbchen ins Ohr, bei Gelb Vollgas, Elterntaxi, regelmäßig Fast Food)?": {
        "title": "Was macht ihr, was man eigentlich nicht tun sollte (Wattestäbchen ins Ohr, bei Gelb Vollgas, Elterntaxi, regelmäßig Fast Food)?",
        "score": 112,
        "url": "https://www.reddit.com/r/FragReddit/comments/1dqew5g/was_macht_ihr_was_man_eigentlich_nicht_tun_sollte/",
        "content": "",
        "num_comments": 360,
        "comments": [
            "Ich benutze manchmal Glasreiniger für Sachen die nicht aus Glas sind",
            "Jap passt so. Und ich benutze meinen Feuer Rettungsbalkon als normalen Balkon im Sommer.",
            "Ich kaue mein Essen nicht genug und esse spät am Abend.",
            "Ich stopfe auch die guten Pfannen und Messer in die Geschirrspülmaschine. Ich wasche eigentlich nichts mit der Hand ab.",
            "Ja, in der Reihenfolge.",
            "Na, Vollgas nicht, aber ich fahr ab und an schon auch noch bei Dunkelgelb drüber.\n\nWattestäbchen im Ohr empfinde ich halt als überaus angenehm.",
            "Rauchen und Alkohol. Ja nicht geil aber nicht in Verbindung mit Wattestäbchen oder Elterntaxi. Daher OK denke ich.  \nIch esse gerne Absurde Mengen an Keksen, Schokolade oder Torte. Manchmal diese Asia Tüten Nudeln. \nAnsonsten mag ich zum Frühstück gerne Redbull und Ne Zigarette. Viel Kaffee.",
            "Ich fahre oft mit dem Auto zur Arbeit, obwohl die Bahn ohne Umsteigen durch fahren würde und ich sogar ein 49euro Ticket habe (gut momentan gibt's ne triftigen Grund, da es durch Bauarbeiten super nervigen Ersatzverkehr gibt) \n\nIch scrolle abends im Bett vorm schlafen am Handy (blaues Licht rausgefiltert und Bildschirmhelligkeit ganz niedrig). Heißt ja immer wäre schlecht fürs einschlafen, bei mir ist es aber das Gegenteil und mir hilft es richtig müde zu werden. Also hör ich da lieber auf mein eigenes Gefühl als das was \"alle sagen\". \n\nIch esse zu 90% Weißbrot (Weizentoast), weil es mir einfach besser schmeckt als die Vollkorn Varianten. \n\nIch frühstücke meist entweder gar nicht, ziehe es mit dem Mittagessen zusammen oder esse \"zum Frühstück\" irgendwas an Süßkram, Keksen oder Kuchen was ich rumstehen hab.",
            "Sehr heiß duschen :') Viel zu angenehm ums nicht zu machen. \n\nSchnell viel Wasser trinken.  Und hab letztens gelesen, dass man kein warmes Wasser aus der Leitung trinken soll? Mach ich seit Ewigkeiten. Kontroverse Meinung aber warmes Wasser schmeckt mir viel besser xD Fühl sich irgendwie \"weicher\" an.",
            "Süßigkeiten als ganze Mahlzeiten ballern, wenn der Tag mal richtig scheiße war."
        ]
    },
    "Was sind eurer Meinung nach die „deutschesten“ Wörter?": {
        "title": "Was sind eurer Meinung nach die „deutschesten“ Wörter?",
        "score": 57,
        "url": "https://www.reddit.com/r/FragReddit/comments/1dqgs01/was_sind_eurer_meinung_nach_die_deutschesten/",
        "content": "",
        "num_comments": 266,
        "comments": [
            "ordnungswidrigkeit",
            "verschlimmbessern",
            "Doch",
            "Sollbruchstelle. Für mich das schönste deutsche Wort.",
            "Doppelhaushälfte",
            "Reissverschlussverfahren",
            "So! (Begleitet vom Klatschen beider Handflächen auf den Oberschenkeln)",
            "Urlaubssperre",
            "* Zeug das fliegt: Flugzeug\n* Zeug das fährt: Fahrzeug\n* Zeug das Feuer macht: Feuerzeug\n* Zeug zum Spielen: Spielzeug\n* Zeug wo man draufschlägt um Musik zu machen: Schlagzeug\n* Zeug zum Werken: Werkzeug",
            "Eine durch Tommi Schmitt inspirierte Liste:\n\n* Graupelschauer \n* Übergangsjacke \n* Vergnügungssteuer \n* Bundeskegelbahn \n* Bierwurst \n* Stoßlüften \n* Halbpension \n* Schnupperkurs \n* Übergardine \n* Löschwassereinspeisung \n* Schwere Saucen \n* Wahlpflichtfach \n* Doppelhaushälfte \n* Gefrierbrand \n* Trauerfeier \n* Handschuh \n* gallertartig"
        ]
    }
}