{
    "Samedi Écriture - Sujet Libre ou \"Vous vous faites pincer par un crabe mutant, et acquérez de super pouvoirs\"": {
        "title": "Samedi Écriture - Sujet Libre ou \"Vous vous faites pincer par un crabe mutant, et acquérez de super pouvoirs\"",
        "score": 4,
        "url": "https://www.reddit.com/r/france/comments/1dlutcq/samedi_écriture_sujet_libre_ou_vous_vous_faites/",
        "content": "Bonjour À Tous ! Aujourd'hui C'est Samedi, Donc C'est Samedi Écriture ! Et comme ça sera tout le temps le cas maintenant, c'est aussi Sujet Libre ! (merci de l'indiquer au début de votre commentaire, sinon je m'y retrouverai pas)    \n    \n**SUJET DU JOUR :**    \n    \n**Au choix :**    \n    \n* Sujet Libre      \n      \n*  \"Vous vous faites pincer par un crabe mutant, et acquérez de super pouvoirs\"    \n    \n* Sujet alternatif : Rédigez un texte en utilisant au moins 5 des mots suivants : \"Scorpion, Fuir, Bourse, Rural, Flou, Examen, Deuxième, Document, Mascara, Nouveau\".    \n    \n    \n**Sujets De La Semaine Prochaine :** \n \n**Au choix :**    \n    \n* Sujet Libre.    \n \n* \"Vous voyagez dans le temps, et êtes venus assister à la fin d'une ère\"              \n    \n* Sujet alternatif de la semaine prochaine: Rédigez un texte en utilisant au moins 5 des mots suivants : \"Talc, Agent, Convertir, Climtisation, Formel, Plage, Torsion, Cidre, Calmar, Outil\"\n     \n**Sujets à venir :**      \n \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nA vos claviers, prêt, feu, partez !",
        "num_comments": 1,
        "comments": [
            "Je l'avais dit il y a 2 semaines mais je le réécrit : j'ai vraiment plus l'énergie de continuer à poster ce fil toutes les semaines.\nDonc le 29/06 (samedi prochain donc) ça sera le dernier Samedi écriture que je posterai. Si quelqu'un veut reprendre le flambeau, ça sera avec plaisir que je lui dirai le très peu de trucs qu'il y a à savoir.\n\nPS : merci à celles et ceux qui m'ont envoyé des messages auxquels j'ai pas répondu jusque là, c'est gentil :)"
        ]
    },
    "Forum Libre - 2024-06-22": {
        "title": "Forum Libre - 2024-06-22",
        "score": 7,
        "url": "https://www.reddit.com/r/france/comments/1dllvfd/forum_libre_20240622/",
        "content": " \n\n**Partagez ici tout ce que vous voulez !**\n\nCe sujet est généré automatiquement vers 7h - [Archives](https://www.reddit.com/r/france/search?q=Forum+Libre++author%3A%22automoderator%22&restrict_sr=on&sort=new&t=all).",
        "num_comments": 65,
        "comments": [
            "C'est quoi les exigences les plus WTF que vous ayez vu sur une offre de location immobilière ? Hier, en parcourant les annonces sur lbc, un propriétaire a mis \"je visite le logement de chaque candidat\".",
            "J'ai fait des tests avec un tailleur, en lui demandant s'il pouvait faire des fringues d'après une photo tout en la modifiant selon mes critères.\n\nÇa a été nickel, donc je passe à l'étape suivante : Lui faire réaliser des trucs sur des dessins. Je commence à dessiner mes prochaines fringues pour me donner des idées et m'habituer au coup de crayon.\n\nJe vais y prendre goût.",
            "Ah noooon, la personne que j'ai vu hier qui se réveille sans goût ni odorat. Pitié, pas de covid à une semaine du début de mes vacances...",
            "J'ai eu 2 révélations ce matin en allant acheter le pain :\n\n- La technique pour pas manger le crouton de la baguette sur le chemin du retour c'est d'acheter une chocos et de manger la chocos.\n\n- Les gens qui grimpent l'Everest, ils portent des couches/se retiennent/se font dessus quand il font la partie final qui dure plusieurs heures? Sachant qu'il fait juste beaucoup trop froid pour baisser son pantalon.",
            "Bonjour le FL du samedi !\n\n\nJe cherche un truc à dire mais j'ai le cerveau grillé par la fatigue due à mini pintade. Je rêve d'un 6h de sommeil d'affilié. Je me contenterais de 5h si il faut. Ou seulement 4h. 3h est dans le domaine du possible mais le tunnel est encore loin.",
            "Salut les gens, j'espère que vous allez bien. Go rester doux et soyeux. Bonne journée à tous et à toutes.",
            "Ça fait des années que j' attends patiemment que mon vieil ordi crame pour le remplacer avec enfin quelque chose de bien et ça y est, le jour est arrivé. Par contre je ne sais pas ce que je veux et j' en suis même à me dire que finalement je pourrais peut-être faire sans. Alors que non parce qu'il me faut au moins un truc pour lire des médias",
            "Je suis giga crevé aujourd'hui. Je devais faire le ménage mais je crois je vais rester dans le canap a lire des BD avec mon chat.\n\nBon je vais quand même ranger un petit peu mais pas trop.\n\nÉdit : grosse sieste ! Fait du bien",
            "J'ai mis des plombes à m'endormir même avec CBD + mélatonine et Sous la Seine en fond sonore pour distraire mes oreilles mais j'ai du dormir 8h au final. Mais en me levant la misère qu'est ma vie désormais m'a fait essayer d'imaginer que je peux arrêter mon coeur à volonté. Je dois tirer les enfants au marché pour voir mon père et j'ai pas l'énergie pour ça. Un pote me parle d'activités que je peux plus faire de sports en intérieur. J'ai rêvé que je chantais avec un groupe dans un micro. J'ai aussi rêvé d'activités à la montagne. En vrai rien de tout ça.\n\n\nEt le botox dans lequel j'ai mis plein de fric marche pas bien. Je vais devoir retourner et espérer qu'ils en mettent plus. Mais en vrai je sais pas trop pourquoi je fais ça. C'est un peu absurde je vais devoir vivre comme une petite vieille autant en avoir la tronche.",
            "Ca intéresse quelqu'un deux tickets pour le dimanche des Francofolies de la Rochelle? Je vais rien en faire perso."
        ]
    },
    "Mon opinion sur le conflit Israélo-Palestinien est-elle antisémite ?": {
        "title": "Mon opinion sur le conflit Israélo-Palestinien est-elle antisémite ?",
        "score": 253,
        "url": "https://www.reddit.com/r/france/comments/1dlrl12/mon_opinion_sur_le_conflit_israélopalestinien/",
        "content": "1- Le Hamas est indiscutablement une organisation terroriste \n\n2- Les attaques du 7 octobres sont des attaques terroristes d'une ignominie sans nom. Aucune cause ne peut justifier les assassinats, enlèvements, viols et autres crimes qui ont été perpétrés envers des civils par le Hamas au cours de cette attaque.\n\n3- Les Palestiniens et notamment les gazaouis sont opprimés par l’Etat d’Israël, qui  pratique une politique d’extrême-droite ignoble. Rien ne peut justifier les bombardements massifs, aveugles et sans aucune proportionnalité qui ont lieu aujourd’hui à Gaza, qui visent principalement les civils. Rien ne peut justifier que l’on affame un peuple entier en limitant l’accès à l’aide humanitaire et que l’on s’attaque à l’UNRWA. Rien ne peut justifier les politiques de colonisation de l’Etat d’Israël en Cisjordanie et les conditions d’existences que l’on fait subir aux Palestiniens depuis des années.\n\n  \n4- Aucune amélioration de la situation n’aura lieu en perpétuant ces horreurs. Les attaques du 7 octobre nourrissent la haine israélienne envers les Palestiniens, et plus globalement les musulmans. La guerre à Gaza nourrit la haine des Palestiniens envers les Israéliens et plus globalement les juifs. En continuant sur cette voie on est dans un cycle de violence infini qui ne s’arrêtera que par le génocide de l’un ou de l’autre peuple. \n\n5- La seule solution est l’arrêt des exactions et la recherche d’une solution pour que chacun puisse vivre dans de bonnes conditions d’existence et de sécurité.",
        "num_comments": 221,
        "comments": [
            "Non, c’est la position de bon sens je dirais",
            "Pour moi, absolument pas.\nLa tristesse de ce conflit, c'est que tu as des deux côtés les pires personnes au pouvoir pour permettre une paix, et surtout une amélioration des conditions de vie des populations.\nLe problème, c'est que dans notre pensée politique contemporaine, une part importante des personnes considère que si tu as un méchant, tu dois avoir un gentil, alors que la nature humaine est bien plus compliquée.",
            "Pas du tout. Il faut arrêter de parler d'antisémitisme à chaque fois qu'on critique Israël. Par ailleurs, tu as une position tout à fait standard sur le sujet. Si tu veux approfondir un peu, tu peux te renseigner sur le caractère colonial de la situation, ça aide à comprendre pourquoi les choses se passent ainsi.",
            "Un point supplémentaire: \n\nIsrael et la communauté juive dans le monde sont pris en otage par les extremistes/suprémacistes de leur communauté.\n\nRabin a été assassiné par un extrémiste juif pour empêcher la paix Israel-Palestine. Le [Hamas est autant une création du Likud](https://www.timesofisrael.com/for-years-netanyahu-propped-up-hamas-now-its-blown-up-in-our-faces/) que des saoudiens/Qataris: le but avoué étant d'empêcher le Fatah de créer un état palestinien stable. Les [extrémistes juifs oppriment les communautés non juives](https://youtu.be/Ug0p3GDSrD0?si=EUiLeWknkQ3IlwtX) en Israel même. Sans parler des colons en cisjordanie.\n\nTant que ces extrémistes auront voix au chapitre en Israel, il n'y a pas de paix possibles ni pour Israel ni pour la Palestine.",
            "Non. Beaucoup de choses que tu as écrites sont des faits, pas des opinions.",
            "Le constat est bon, la conclusion est une illusion hors de tout encrage du réel. L'enfer est pavé de bonnes intentions.",
            "C'est que des avis consensuels je dirais.\n\nEst ce que le Hamas est un mouvement de résistance selon toi? \n\nÇa c'est un point plus épineux",
            "C'est la seule position acceptable à mon sens.",
            "C'est la position de la diplomatie française depuis octobre. Donc à moins de dire que la France est antisémite (bon, faut dire que c'est la position de Netanyahou), la réponse à votre question est non.",
            "Tout les gens a peu près censés ont cette position sur le conflit. Sauf que tu laisse sur un point :\"trouver une meilleure solution\".\n\n\nC'est bien beau de le dire mais s'arrêter là c'est donner 20% de son avis... Oui la guerre c'est horrible, oui les meurtres ça pue la merde, mais c'est juste pas possible de dire \"arrêtez tout !\" sans offrir aucune alternative"
        ]
    },
    "Caricature de Soulcié dans Mediapart": {
        "title": "Caricature de Soulcié dans Mediapart",
        "score": 192,
        "url": "https://i.redd.it/pa3slaeb138d1.jpeg",
        "content": "",
        "num_comments": 12,
        "comments": [
            "\"Rions tant qu'on peut\"\n\nPutain ouais. L'avenir s'annonce pas jouasse.",
            "En plus Macron, il joue avec l'argent des autres. Même s'il perd, il sera encore président pendant 3 ans. Ceux qui vont payer, c'est les députés de Renaissance qui ont commis l'erreur de croire en lui. Et puis la France, ensuite.",
            "En soirée du 30 juin prochain:\n\n*\"- Cette dissolution, c'est le peuple qui l'a voulu.\"*",
            "Sauf qu'à la différence de Winamax, les perdants, ce sera toute la France.",
            "Maintenant je veux les mêmes chaussettes bordel !\nCœur cœur sur toi Killian.",
            "Attention à pas le prendre au premier degrés, demander aux français de voter n'est pas un jeu de hasard ou une perte de crédibilité dans la vrai vie :)",
            "Pas mal, bien trouvé !",
            "Excellent !!",
            "Première fois de ma vie qu'une caricature me fait rire",
            "Avec la censure des médias si/quand le FN passe, ça sera pas jojo"
        ]
    },
    "Législatives 2024 : le ton commence à monter aussi entre les économistes": {
        "title": "Législatives 2024 : le ton commence à monter aussi entre les économistes",
        "score": 223,
        "url": "https://www.lesechos.fr/elections/legislatives/legislatives-2024-le-ton-commence-a-monter-aussi-entre-les-economistes-2103173",
        "content": "",
        "num_comments": 268,
        "comments": [
            "De Julia Cagé au Prix Nobel Esther Duflo, plusieurs économistes en vue contribuent au programme du Nouveau Front populaire. D'autres, tels qu'Olivier Blanchard ou Philippe Aghion, sont très critiques. Aucun économiste ne s'affiche en revanche ouvertement au côté du RN.\n\nLes économistes de gauche montent sur le ring politique. Ce vendredi, trois d'entre eux ont rejoint sur l'estrade les représentants du Nouveau Front populaire qui présentaient à la presse leur programme économique  : Julia Cagé, professeur à Sciences Po, Eloi Laurent de l'Observatoire français des conjonctures économiques (OFCE), et Eric Berr, co-animateur du département économie de l'Institut La Boétie, un think tank proche du leader LFI, Jean-Luc Mélenchon.\n\n« C'est un programme crédible sur le plan économique. C'est pour cela qu'on est là pour le défendre. En face de chaque dépense, on a mis une recette », s'est enflammée après la présentation Julia Cagé tout en assurant devant quelques journalistes qu'elle « n'était pas encartée ».\n\n« Provoquer un choc de confiance »\nTous ont d'ailleurs tenu à préciser qu'ils avaient été sollicités en tant qu' « expert », « invités à porter un regard indépendant », selon Eloi Laurent. Leur conviction est néanmoins que « sept années de Macronisme ont fracturé la société ». « L'intérêt de ce programme est de provoquer un choc de confiance. Car en économie, sans confiance rien n'est possible », a défendu Eric Berr.\n\nEgalement soutenues par Thomas Piketty, Michael Zemmour ou Esther Duflo, Prix Nobel d'économie et spécialiste de la pauvreté, les mesures proposées par l'union des gauches inquiètent en revanche au plus haut point le patronat et la majorité présidentielle par l'avalanche des dépenses et une hausse sans précédent de la taxation qu'il prévoit.\n\nDaniel Cohen, mentor commun\nCe ne sont pas les seuls à être critiques. Ce vendredi, l'ancien chef économiste du FMI, Olivier Blanchard, a jugé sur X que le programme du Nouveau Front populaire était « plus dangereux » que celui du Rassemblement national , avec un long développement à la clef. Olivier Blanchard, qui se revendique social-démocrate, souligne l'aspect confiscatoire des mesures proposées, à la différence d'un programme de gauche qui viserait la redistribution tout en préservant les incitations à la création de richesse.\n\n« J'aimerais avoir une discussion économique avec lui », a réagi Julia Cagé rappelant qu'il avait été à l'origine de la politique « catastrophique » menée en Grèce au lendemain de la crise financière. Ambiance…",
            "Pour une fois qu'on a un débat sur la politique économique du pays, on devrait les encourager.",
            "Je suis surpris qu'il y ait une telle disparité d'avis au sein de la \"communauté\" des économistes. Je veux dire, on passe quand même du jour à la nuit, comment est-ce possible qu'ils ne soient à ce point pas d'accord ?",
            "Duflo n’a pas contribué au programme du NFP. Elle soutient la gauche mais c’est tout. Il n’existe aucune source montrant qu’elle a soutenu le programme économique.",
            "Dans ce thread : les Redditeurs ne comprennent pas le concept de \"science sociale\", épisode 480075.",
            "Je ne sais pas si tout le monde prend mesure des enjeux d'une élection du NFP :\n\nCôté pile, si leur programme économique se réalise, c'est un fait majeur : ils font voler en éclat le fameux TINA de Thatcher en montrant qu'il existe une autre politique qui soit viable que celle des libéraux du centre.\n\nCôté face, s'ils se plantent, on risque une crise budgétaire majeur. Avec les conséquences sur les plus vulnérables d'entre nous.\n\nJe ne sais pas pour vous mais moi, j'ai l'impression de jouer aux dès là. Je m'y connais juste assez en économie pour savoir que je ne m'y connais pas assez pour me faire un avis rationnel.",
            "Ce serait bien que ce genre d’article précise quels économistes sont orthodoxes et quels économistes sont hétérodoxes. Il y a une grande différence entre un économiste qui analyse les programmes selon la ligne standard de le recherche académique en économie, et un économiste qui les analyse selon un prisme plus idiosyncratique, ou en tout cas non-mainstream.",
            "Le FMI comme boussole qui indique le Sud.  Je prends",
            "Trop drôle Eric Berr était mon prof d’économie politique à la fac de Bordeaux",
            "Les météorologues sont plus précis que les économistes. C'est un domaine trop chaotique pour prétendre avoir raison."
        ]
    }
}