{
    "Monthly /r/Freefolk Free Talk Thread! - June 2024": {
        "title": "Monthly /r/Freefolk Free Talk Thread! - June 2024",
        "score": 8,
        "url": "https://www.reddit.com/r/freefolk/comments/1d5eco0/monthly_rfreefolk_free_talk_thread_june_2024/",
        "content": " This is a Monthly Free Talk thread. Feel free to discuss whatever you like!",
        "num_comments": 7,
        "comments": [
            "Lmao do you ever look at the state of these subs now and then understand why everything got so shit. Dont get me wrong HOTD is the best thing on tv but theres a general vibe to that reminds me of the general vibe of everything lol. I think the Acolyte write said it best. Its all just so gay",
            "can someone dm me some good streaming sites for the new season?",
            "Unsubbing, yall are fuckin kneelers for watching anything GoT related after those shit shows of the last seasons.",
            "Does anyone know some good streaming sites to watch the second season of hotd?",
            "So lets recap whats going to be in this season. Blood and cheese kill a kid, no nettles Aegon presably gets burned and fused to his armor the dragon seeds bond with dragons Creagan stark appears. Rhaenys dies most her dragon dies i forgot its name. I think thats it i might be missing somethings",
            "HBO MAX",
            "We have updated all episode theories in Automod.  You can request a specific episode (`!Ep01`,`!Ep02`,...`!Ep10`) or all of them at once (`!SendAll`). These are theories that have held up past Episode 01 and are curated from message boards, Discord, and Reddit posts.  \n*If you see fan theories that aren't covered here, but are accurate, feel free to forward them via [Modmail](https://www.reddit.com/message/compose/?to=/r/freefolk).*\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/freefolk) if you have any questions or concerns.*"
        ]
    },
    "House of the Dragon Season 2 Episode 2 discussion thread": {
        "title": "House of the Dragon Season 2 Episode 2 discussion thread",
        "score": 89,
        "url": "https://www.reddit.com/r/freefolk/comments/1dmzit2/house_of_the_dragon_season_2_episode_2_discussion/",
        "content": "Discussion thread for House of the Dragon Season 2 Episode 2\n\nAir date: 6/23/24",
        "num_comments": 608,
        "comments": [
            "Thought the head was gonna fall off tryna get the cart out the pothole",
            "I love Otto so what have you morons done now? And immediately oh shit its even worse than I thought",
            "![gif](giphy|11Xc3nOtJcb8Aw)\n\nDaemon during the Blacks council discussing why anyone would think they would murder a child.",
            "Two episodes in a row that end with Allicent and Criston fucking, how about three?",
            "Father I have sinned\nI dont want to hear about it lmaoooo Otto gives no fucks",
            "For someone who was all, fuck the Hightowers... Blood sure went down like a lil bitch",
            "Gotta say, this was pretty dank. I really like the parts when they focused on the commoner's suffering, as well as public perception",
            "i love how otto hightower draws a line when it comes to the ratcatchers",
            "The Rhaenyra/Daemon and Otto/Aegon scenes are some of the best in the series.",
            "That poor model :( RIP"
        ]
    },
    "The only correct take": {
        "title": "The only correct take",
        "score": 1610,
        "url": "https://i.redd.it/8adjz0y2je9d1.jpeg",
        "content": "",
        "num_comments": 81,
        "comments": [
            "Another based take from Otto",
            "Not sure why people argue about who won, the entire message of this conflict is that nobody won. House Targaryen lost many members of their house and ultimately lost their dragons. House Targaryen no longer had a chokehold over Westeros without dragons.",
            "To the defilement of Earth, and the corruption of its people.",
            "Honestly based, I will say that it feels like Otto in the show is kinda a giant idiot who caused this whole thing. The wars only happening because he pushed for Aegon to take the throne, but also ignored how people would hold their oaths to another candidate and didn't even teach Aegon HOW to rule. And gets upset that he's not listening to him",
            "He's got banned in r/HOTDBlacks",
            "Both are shit, so I'm siding with the cooler shit.",
            "Yup, that's where I am. Even the best of these characters would be on the chopping block if I lived in-verse. Entitled aristocrat scum, the lot of them!",
            "When is he gonna open an OnlyIfans",
            "His argument gives context as to why Otto was keeping Viserys \"weak\" with years of peace.  Do people really need medieval bombers armed with napalm going scorched Earth?  No.\n\nDoes HBO want it for higher ratings and Emmy nominations?  Yes.",
            "I thought people were being funny, like in The Boys comment sections when they were taking sides in a fictional civil war in a TV Show. Then I visited the HOTD Black sub and ohh boy."
        ]
    },
    "Welp.": {
        "title": "Welp.",
        "score": 695,
        "url": "https://i.redd.it/jztb4ql2ve9d1.jpeg",
        "content": "",
        "num_comments": 162,
        "comments": [
            "You have to be a really bad showrunner if you screw up the best character of the dance",
            "Didn't Otto mention daeron in the most recent episode? Why wouldn't he be in it? I'm not a big fan of the show so I don't expect much either way",
            "When they don't depict Daeron as brutally murdering the townsfolk of Bitterbridge but instead have Aemond do it - I'm sure you'll be so into the integrity of the book narrative right?",
            "Guys, HotD isn't bad all things considered. You seem to be confusing it with GoT seasons 7-8 (and parts of 5 and 6). Fire and Blood is a history book told by maesters and a fool, it has unreliable narrators with their own agendas. I get that we're all gunshy from GoT, but the show is awesome! We're about to get our first major battle with dragons pretty soon too!",
            "Why fear as its obvious they are making daeron is bastard or not and give him black hair more of muh hypocrisy and shattering logic.Cant wait for the Book is unreliable and propaganda twist this time.",
            "Its all Propaganda so yeah daeron is gonna get his character gutted",
            "We got what we wanted, but at what cost? \n\nThere are already rumours that he will be a bastard =/",
            "Calling it now it's gonna be implied he is coles basterd",
            "Ill be pissed if they make him Alicents secret bastard or something. I wouldnt it past them since canon seems to be thrown out the window these days. Yes I know hes a dragon rider but I wouldnt it past them to make him some secret criston Cole bastard",
            "If you mean Addam Velaryon, sure. Fuck Daeron."
        ]
    },
    "Agent of Chaos": {
        "title": "Agent of Chaos",
        "score": 160,
        "url": "https://i.redd.it/snh2z0fuwg9d1.jpeg",
        "content": "#OC",
        "num_comments": 5,
        "comments": [
            "\"I'm a guy of simple tastes. I enjoy dragonfire, swordfighting and head bashing!\"",
            "\"Alicent has plans. Otto has plans. Y'know they're schemers. Schemers trying to control their little worlds. I'm not schemer. I try to show the schemers how pathetic their attempts to control things really are.\"",
            "\"How about a magic trick? I'm gonna make Vaemonds head disappear!\"",
            "\"You know what I've noticed? Nobody panics when things go 'according to plan' even if the plan is horrifying! If, tomorrow, I tell the realm that a bunch of peasants will get massacred by a royal with a dragon... Nobody panics. Because it's all 'part of the plan'. But when I say that one little son of a queen will die... WELL THEN EVERYONE LOSES THEIR MINDS!\"",
            "Cursed Juggalo Daemon."
        ]
    }
}