{
    "FGF (Bonus) Giveaway: Powered by Reddit Community Funds!": {
        "title": "FGF (Bonus) Giveaway: Powered by Reddit Community Funds!",
        "score": 131,
        "url": "https://www.reddit.com/r/FreeGameFindings/comments/1dfvomu/fgf_bonus_giveaway_powered_by_reddit_community/",
        "content": "**MAIN EDIT:** Winners have been officially drawn and sent their codes! The winners are...\n\n/u/TOMdMAK, /u/ALaRequest, /u/MrGoaty07, /u/3SunsGaming, /u/failtality, /u/Kienan, /u/ImCursedM8, /u/SmileyBMM, /u/leeec, & /u/Nickyshane\n\nWinners have been PM'd their batches of codes for GMG. Huge thanks to everybody for entering and massive thanks to Reddit and the Community Funds team for powering the event!\n\n**To the winners, I linked the wrong redemption page. The page you should use is this one. You'll redeem through the wallet - https://www.greenmangaming.com/my-account/wallet/**\n\n\n---\n\n\n**US and UK Only**. It's a legal thing from the Reddit team. Apologies for the limitation.\n---\n\n---\n\n\n\n[A couple months ago, we ran our first ever event powered by Reddit directly](https://redd.it/1bwn50k)! It was a great opportunity, but some users had some reservations about the way we handled it. We needed to do it that way to widen the range and size of the event. It may not have been perfect for some, but we wound up with a fantastic event that had some great entries. That event came in under-budget due to sales of games at the time. Thanks to that, a second event is officially under way! This time though, it'll look a little more familiar to what you might be used to in FGF Giveaways.\n\n---\n\nThe **Reddit Community Funding** program is Reddit's way of giving back to their communities. Back in April we ran an Art Contest for some of my favourite video games using the Community Funds. That event left use with nearly **$1,600 USD**. Many months later, we can officially use it for something! I was able to convince the team to let /r/FreeGameFindings run a second promotional event. \n\nFor this event, I used the roughly **$1,600 USD** to build 10 prize packs of roughly $160 USD per winner. To make things easier, as well as a means of letting you pick exactly what you want, the prizes will be gift cards to the popular video game storefront [GreenManGaming](https://www.greenmangaming.com/)! GMG was used heavily in the last event and was by far the easiest one to work with in terms of bulk purchasing. Considering that, I felt it was wise to let users make purchases of whatever they want!\n\nTo be eligible for this event, you must be in The United States of America or The United Kingdom. You also must be at least 18 years of age. You must have a one month old Reddit account with at least ten total karma. You also cannot be banned from /r/FreeGameFindings, nor be on the [universal scammer list.](https://www.universalscammerlist.com/) \n\n**To enter,** all you need to do is make a comment! Replying to a comment wont count, but please refrain from having other discussions in this thread. Now on to what specifically will be the winnings. **There will be ten total prize packs on offer. The prize pack includes the following gift cards:**\n\n* **4** x $50 CAD Green Man Gaming Gift Cards\n* **1** x $20 CAD Green Man Gaming Gift Card\n\n*Conversion rates as of time of posting is $50 CAD = $36.42 USD, and $20 CAD = $14.57 USD.*\n\nCodes will convert to US or UK currency when redeemed on your GMG account. As to be expected, you will need to have/make one of these accounts. Once redeemed, feel free to buy whatever you like!\n\n**This campaign runs until the 28th of June. On the day, I will close the thread, update it, and make a new post announcing all the winners. Each winner will be contacted by Reddit PM or Chat. Please ensure you can be contacted through at least one of those methods (I prefer PM if possible).**\n\n---\n\n**For a full list of Contest Sweepstakes Rules, visit this link -> https://www.reddit.com/r/FreeGameFindings/wiki/fgf-giveaway-info/powered-by-community-funds-bonus** \n\n**Your entry into this contest means you agree to the terms, the rules, and are stating you are eligible to win.**\n\n\n---\n\nMassive thanks to Reddit's Community Funding team for powering this and the first event. Glad to be able to use the leftover cash for the FGF community.\n\n\n---\n\n\n*For the sake of transparency, I did not receive any items/gifts/money/etc for putting on the event.*\n\n[*Here is a list of past promotions where I have and have not been given something during FGF Giveaways.*](https://docs.google.com/spreadsheets/d/1RFeaSIpqFvvSzfOowecLz_rbbFo-YKa25PYAqF6Y6ko/edit?usp=drive_link)",
        "num_comments": 780,
        "comments": [
            "Man only UK and the US :(( \n\nbut good luck everyone!",
            "trans rights are human rights",
            "Good luck everyone! Elden ring is calling my name",
            "Man i hope i get something. I want to get the Elden ring DLC",
            "Welp my birthday is coming up soon so here's to a birthday present eh?",
            "Good luck to all. May the luckiest comment win.",
            "This among other reasons why this subreddit is top tier. Thank you for the time, effort and dedication to all involved in seeing their vision through of what a subreddit like this should be.",
            "May the odds be ever in your favor ladies and gents",
            "Thanks for the chance, and good luck to everyone participating.",
            "Thank you! Good luck everyone!"
        ]
    },
    "Exiled Giveaways and Itch.io Mega Threads": {
        "title": "Exiled Giveaways and Itch.io Mega Threads",
        "score": 37,
        "url": "https://www.reddit.com/r/FreeGameFindings/comments/1dnihhl/exiled_giveaways_and_itchio_mega_threads/",
        "content": "To increase visibility, the mega threads are posted on a weekly basis. This is being done following the overall discussion of Mega Threads via *FGF Update* - https://redd.it/jkxyzw\n\n---\n---\n\nPlease use the below threads for your posts. :)\n\n[**Exiled Giveaways Mega Thread** (#2)](https://redd.it/p0ijjx)\n---\n[**Itchio Mega Thread** (#10)](https://redd.it/p0ik3q)\n---\n\n---\n\n---\n\n**Want to setup alerts to these threads? RSS Feed information can be found in our wiki!**\n\n**https://www.reddit.com/r/FreeGameFindings/wiki/rssfeed**\n\nIncluded is information about our discord bot and general RSS feed stuff. Definitely give it a look!",
        "num_comments": 1,
        "comments": [
            "**DISCUSSION THREAD - https://redd.it/1cag0q5**"
        ]
    },
    "[Steam] (Game) Megaloot: Prelude": {
        "title": "[Steam] (Game) Megaloot: Prelude",
        "score": 96,
        "url": "https://www.ign.com/rewards/megaloot-prelude-steam-keys",
        "content": "",
        "num_comments": 53,
        "comments": [
            "Just for clarification, this is a f2p game but if you add it with this steam key you will get a +1 to game count.",
            "Free keys to a already free game? is IGN on crack?",
            "Hmm it gave me a used key.",
            "remember to remove the game from library to add the key ;)",
            "Thanks Saulios !  Useful info.",
            "You can check if you have the non+1 license by going to the account licensing page.  If it says (Remove) (Complimentary) for this game, you can remove it and then redeem the key provided by IGN and it should now say (Retail) instead of (Complimentary).\n\nI had to do this to get the +1 to count, otherwise steam thought I already owned the game.",
            "Who don't know. Every game +1, gives you +1xp",
            "geez , what a waste !",
            "Isn't the game already free bruh :|",
            "damn already closed\n\nanyone got spare keys?"
        ]
    },
    "[Xbox] (Game) Matchstick Puzzle Mastery": {
        "title": "[Xbox] (Game) Matchstick Puzzle Mastery",
        "score": 30,
        "url": "https://www.xbox.com/games/store/matchstick-puzzle-mastery-for-pc-xbox/9npktfjcjm38",
        "content": "",
        "num_comments": 22,
        "comments": [
            "Not free here, it's €2,09 or did I something wrong?",
            "The AI generated cover does not inspire confidence.",
            "In which country url it's showing free?",
            "the cover art with this game was generated..eww",
            "Crappie game, adding it anyway.",
            "Not free in Argentina either",
            "It's seemed expired or specific country are free? If so, which.",
            "Hololens is Microsofts failed AR glasses for businesses. No idea what Hub is though",
            "lmao 6 fingers with that one random one sticking up",
            "strange... not free, maybe specific country is free?"
        ]
    },
    "[Steam](Other) V Rising Razer Night Serpent Pack": {
        "title": "[Steam](Other) V Rising Razer Night Serpent Pack",
        "score": 45,
        "url": "https://gleam.io/Njvl6/razer-x-v-rising-giveaway",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Btw it's DLC not Other 😅",
            "I got this years ago and lost the key so couldn't use it when I got the game. A couple of months ago a divine thought came to me to try to look for the gleam.io and managed to find my key.",
            "Looks like I already had this. V Rising - Razer Night Serpent Pack: Z7NC2-??HBF-G6X7M\n\n?? = The day of Christmas.",
            "I can't seem to redeem the code on my Ukraine region account so I guess it's region locked?",
            "anyone got a spare code? seems all are claimed and I really don't want to make an X account...",
            "Looks like a kids Halloween costume.",
            "XCJJN-JTW**-PI2AD Abbreviation for Guild War.",
            "**MB5\\*\\*-RQ5NR-HBBJ9   Hong Kong short form=\\*\\***",
            "Hmm... I don't see any country restrictions though, assuming you own the Base Game... kind of weird that they country restrict a DLC but not the Game itself...",
            "Just claimed it, thank you!"
        ]
    }
}