{
    "R/FTM Sub Hub: Monthly threads, Frequently Posted Topics, Sibling Subs, and more!": {
        "title": "R/FTM Sub Hub: Monthly threads, Frequently Posted Topics, Sibling Subs, and more!",
        "score": 31,
        "url": "https://www.reddit.com/r/ftm/comments/193tomc/rftm_sub_hub_monthly_threads_frequently_posted/",
        "content": "Welcome to r/FTM ! Whether you're new here, or you've been here for ages, this is the central hub for all sorts of helpful links, information, and frequently asked questions.\n\nRecent mod posts:  \n[Announcement regarding journalists asking about DIY HRT](https://www.reddit.com/r/ftm/comments/1c8wcpr/announcement_regarding_journalists_search_for/)\n\n[Rules explained in detail](https://www.reddit.com/r/ftm/comments/1c98ezh/mod_post_reminder_about_rules_please_read_so_you/)\n\n[Moderator applications \\[OPEN\\]](https://www.reddit.com/r/ftm/comments/1cscrws/mod_applications_for_rftm_and_our_sibling_sub/)",
        "num_comments": 23,
        "comments": [
            "Under frequently posted topics, you guys should consider listing atrophy. I feel like I see posts about it multiple times per day. Its usually men and non-binary people on T describing textbook symptoms of atrophy, wondering if they should see a doctor. There are many posts about it they could look through",
            "Maybe add r/FTMHysto to the surgery subs?\n\nLove this run-down, btw.",
            "Hey, you should add r/transnord under region specific subs.",
            "Hey, could you add r/transfitcheck? It's a subreddit i just made but it's meant to be a place where people can ask \"am i flat\" type questions, as well as a fashion sub specific to trans people.",
            "There's r/ainbow for general LGBT subs, r/TransgenderIndia and r/germantrans for region-specific, r/MilitaryTrans for niche, r/tmpoc for general ftm subs. These are just a few I can think of.",
            "Hey, would y'all add r/Transgender_Surgeries for surgery subs? I think it's the largest surgery sub intended for all transgender people",
            "r/metalheadtransmen could be put in trans + niche subs!",
            "for frequently posted topics could you please add \"am i valid?\" it's constantly posted and i dont know about others but it gets annoying after a while",
            "Can't believe I forgot that one! I'll add it.",
            "Can do! And if you'd like, you're more than welcome to make a post about it on the sub, if you haven't already."
        ]
    },
    "Feeling dysphoric while having a small chest is invalid?": {
        "title": "Feeling dysphoric while having a small chest is invalid?",
        "score": 115,
        "url": "https://www.reddit.com/r/ftm/comments/1dr8nqs/feeling_dysphoric_while_having_a_small_chest_is/",
        "content": "I told my friend that i really hate my chest and want to get top surgery one day, and they said “but your chest isnt big and cant even be seen” i said it still makes me uncomfy, and that altho im grateful it isnt larger, it doesnt mean its invalid to be uncomfortable w it, and asked them whats the point of what they said anyway, to which they replied “just to make you feel better because people with a large chest are the ones who *actually* suffer” ? I’m not sure how to respond to that\n\nDoes it piss yall off when someone with a small chest feels dysphoric about it regardless? Does it sound ungrateful? ",
        "num_comments": 46,
        "comments": [
            "Your friend was being a jerk. I'm sorry they said that. You don't have to \"earn\" being dysphoric.",
            "I have experienced both bc of weight gain, and while I have to admit that yes, a bigger chest made me definitely way more dysphoric and envious than I was when I had a smaller chest, the dysphoria and struggle still was a real pain in the ass when I was smaller and made my life significant worse than it would've been with simply no tits at all. \n\n You're valid, don't take his words too seriously. It's a dumb and shitty thing to say",
            " As someone with small chest too, he is a jerk a dumbass. Even though you have a small chest you cant take your shirt of, it still doesnt fit in the cis male body and therefor you have all the reasons to be dysphoric. I have to admit though having a small chest is way more better than having a big one but its still not fun",
            "Your friend is just being a jerk. I also have a very small chest.  Do I NEED to bind? No, but that doesn't stop me from hating my chest.  I so badly need top surgery one day and that's not any less valid due to the size of my chest, and its the same for you",
            "cis guys with gyno and a cups are allowed to feel dysphoric and get top surgery to fix it, and so are us trans guys. your friend is being a jerk",
            "That's total bullshit, on your friend's part. if you have dysphoria, you have dysphoria. Like, you're not out there saying that \"it's not that bad to just bind\" or anything like that. Your friend is being an ass.",
            "Absolutely not thats BS? I had a G and they had no right to say that. Yes, having a large chest could possibly be worse but comparing isnt helpful at all. You can have the same dysphoria level at a smaller size. Just because a larger chest can make it harder to bind or pass doesnt mean you automatically cant have dysphoria or dont deserve surgery. I would have had just as much dysphoria had I been with a small chest tbh.",
            "Um my chest is small but I still cant go shirtless anywhere and I still get hit on if people notice it and I still get told Im female because of it.",
            "It's not the pain Olympics. Once you truly come to terms with that you will be set free from interactions like this. People who talk like that don't know what they're talking about.",
            "as a transmasc with huge ol knockers, even if i had a double A cup i still would feel dysphoric. comparing peoples suffering is not the move; your friend is being a jerk. you deserve top surgery and anything else that helps you in your transition! "
        ]
    },
    "How many trans guys out there are dysphoric about their hips?": {
        "title": "How many trans guys out there are dysphoric about their hips?",
        "score": 55,
        "url": "https://www.reddit.com/r/ftm/comments/1draayd/how_many_trans_guys_out_there_are_dysphoric_about/",
        "content": "Hi, trans girl here, I've been transitioning for 3 months now and I've been absolutely loving the changes. One change that I can't wait for is for my hips to come in, it's one of the clearest things that's always felt wrong to me about my body. This made me think though about how I'm sure there must be plenty of trans guys out there who are dysphoric about their hips. It's honestly kind of difficult for me to see it as anything other than direct upgrade, especially since my FtM boyfriend isn't dysphoric about his hips, but I know that that's just my bias.\n\nWhat is your hip dysphoria like (if that's not too forthcoming to ask)? I kind of imagine it being like my dysphoria about my broad shoulders, in that it's a part of the body that feels so much wider than it should be.",
        "num_comments": 68,
        "comments": [
            "The hips and thighs are my biggest dysphoria, at the moment. My chest was one of them, but I recently got top surgery! I'm hoping to start working out again soon to help make them look more masculine.",
            "I'm definitely dysphoric about my hips. I don't know what your dysphoria around having broad shoulders feels like but I imagine it's similar. It's just distressing to see my hips. sometimes I hold my hand or arms in front of them in the mirror so it looks like a straight line from my torso and it's just like, that's how I'm supposed to look! but no, there's these extra bits of flesh sticking out that aren't supposed to be there.",
            "I feel like my hips are as wide as a house (they aren't) and that everyone who sees me must notice them immediately (they didn't lol). I feel aware of them all the time. It's the way I used to feel about my chest. Since I got top surgery, I don't notice or think about my chest at all, which was the goal lol. It just feels normal now. Hopefully one day I can get there about the hips. Good luck with your transition, I'm happy for you.",
            "yeah. hugely dysphoric. its the biggest source of dysphoria now. and i dont think theres much i can do about it.",
            "Not my hips so much but my love handles make me super self conscious. Thankfully Testosterone got rid of my hips but its all move to the back now :(",
            "You should probably use the guest flair next time you post. I'd say yeah, it's probably similar to being dysphoric of broad shoulders and makes one feel disproportionate where nothing really \"fits\" right, and it makes you easier to clock. :/",
            "The way I be having thick ethnic hips... Yes it's one of my biggest insecurities as it's the biggest flag on my body that I'm female. I come from a very curvy family and I got cake. Like I'm so serious sometimes it just looks SO goofy.",
            "My hips are so wide that it gives me chronic pain  and I haaaate it. Thankfully theyve rotated on T to be slightly less prominent",
            "Its so bad lolol. When I was younger I would spend hours in front of the mirror trying to find the best way to wear pants so I wouldnt have any curves. The answer is baggy pants worn pretty low. But in more recent years I just dont look in the mirror without something on",
            "Yup. One of my \"aha\" moments that I was trans came when this girl I was dating held me and said \"you have such womanly hips\". I damn near lost my mind because I never saw any part of my body as \"womanly\" until then."
        ]
    },
    "still don’t pass even in queer spaces ": {
        "title": "still don’t pass even in queer spaces ",
        "score": 152,
        "url": "https://www.reddit.com/r/ftm/comments/1dr1xh5/still_dont_pass_even_in_queer_spaces/",
        "content": "been on T 9 months. i’m a member of a local shadow cast of rocky horror. today is our pride show. 3 audience members have called me ma’am so far. (the worst of the feminine terms imo) i’m so tired. i’m currently sitting out in the parking lot of the theatre instead of being in there with my friends. pls tell me to go back in there lol ",
        "num_comments": 9,
        "comments": [
            "I think passing is harder in queer spaces tbh. People expect to see GNC ppl so theyre more likely to gender you as a GNC woman than a man. Go to a space with a bunch of cishet boomers and youre probably more likely to get gendered right.",
            "Just GO BACK IN THERE! Normal societal expectations re: gender do NOT apply at a RHPS/RHS event - you cant indicate your gender using any of the usual clothing and behaviour clues (if you could Frank would be a woman!)\n\nHave fun.",
            "I'm also in the not passing club after 9 months. if it helps lol",
            "So true, I got correctly gendered pre t so often by boomers at school functions just because I had short hair and wore boy clothes.",
            "I have the weird experience of the opposite being true before starting t, which I know is particularly unusual. Queer people never believed me when I told them I didn't pass and think I was being hard on myself, and when meeting me would either assume I was a binary trans man or immediately ask me my pronouns. Weird boomers were the ones that ma'amed me constantly.",
            "This exactly. It's *much* harder for me to pass in progressive places. In Canada I passed 0%, in Nepal I pass exactly as much as I want to. If I am in company where I still haven't come out, I can wear a dress and people will immediately assume woman. If I'm out with friends I trust, I'll wear a more masc outfit and every stranger who sees me will call me sir. It's so much easier to pass however you want in nepal. Mostly as long as you wear clothing and/or have a hairstyle associated with the gender you're trying to present as, nobody will even notice anything else about you. I can literally pass as male with my 36F chest (no binder usually) with no issues",
            "I can also second this, however I will admit that I really never had any issues passing after I started T (I went from looking like a butch lesbian to looking like a cis straight guy), but because of that I never felt welcome in queer spaces because I was just like cis men. I dont even know if this helps but I understand how you feel, but in the opposite way. I feel like I pass TOO much",
            "Agreeing with this bc it was my experience while working customer service early in transition. The older folks were more likely to \"sir\" me based on clothing and haircut, and the younger more tuned-in folks were more likely to \"miss\" me.",
            "I second what the other commented said about passing in queer spaces, but also, nine months on T isn't even that long. \n\nAnd maybe it's a bit harsh but there's something, maybe your clothes or hair, or appearance or mannerisms or way you speak or general dynamic with your friends or idk, literally a quatrillion things that's holding you back from passing. \n\nThis isn't meant to be an accusation, I just usually think of it as some sort of balance; how many femmenine/not hyper-masc things can you have and still pass? Pre-everything the number is usually from very low to non-existant, but as we go along our transition in the many ways, specially with the big stuff like T, we can start to just be a normal human being doing our stuff without worrying *too* much. \n\nSo, something's flicking that scale against your favour, that's the bad news. Good news are it can only get better now, T will continue to work its magic and who know, maybe you'll do some voice training that'll help, or one lucky T-shirt society liked enough; perhaps you're even one haircut away from being gendered correctly (I know I was lol). \n\nSo... just relax. You're only at the beggining of the rode, nobody expected for a whole magical flip to be swiched in less than a year (and if you did... yeah sorry). Go back and enjoy the time spent with your friends and remember all those who missgender you don't know you actually now have a dick."
        ]
    },
    "how do i explain being trans to a barely fluent Ukrainian kid.": {
        "title": "how do i explain being trans to a barely fluent Ukrainian kid.",
        "score": 372,
        "url": "https://www.reddit.com/r/ftm/comments/1dqvy1f/how_do_i_explain_being_trans_to_a_barely_fluent/",
        "content": "my 2nd cousin (14 i think and Male)  is a emigrant from Ukraine. he is diagnosed but definitely has ASD. i keep trying t explain that im not female but he doesn't understand. i tried telling him \"i was girl, now i am boy\" or saying things like \"im a guy/boy\" but doesnt understand. apparently there's  no Russian or Ukrainian word for trans. does anyone have tips? \n\nps, hes also said things like \"i hate gay people\" i dont blame him though because he grew up in a homophobic country with my homophobic conservative cult leader uncle (not joking, he runs a cult)",
        "num_comments": 28,
        "comments": [
            "There absolutely is a word for being trans in Russian and Ukrainian (who told you that??) he's probably just very unfamiliar with the topic because of his personal upbringing. Even the average Russian bigot (won't speak for Ukraine) is likely to be aware of trans existence, they're just more likely to think of us in terms of slurs.\n\nsource: am Russian and trans",
            "Russians and Ukrainians calls trans \"\" too\nBut there aren't much information abt this stuff in there so he probably just doesn't know that it's possible",
            "he does actually run a Conservative cult. he doesnt let his 4 AFAB kids wear rainbow or like rainbows because its too gay. : I\n\nim not related to him though (thank gods)",
            "As someone who speaks both russian and ukrainian, there actually there IS a word for trans in both russian and ukrainian and its the same - trans. The issue here is not that he doesnt understand what you mean. Its that he is prejudiced towards people like you, and doesnt want to delve into it. He may think youre crazy or just not want to listen to your homo bullshit (an actual phrase Ive heard concerning this from another prejudiced russian guy I know). Youre not the issue, he is. Whether to waste your time trying to make him understand/reconsider is your choice!",
            "I say that as Ukrainian trans person, our country is kinda queerphobic and for some reasons cishet teenage boys is THE MOST queerphobic kind of people. He understand what you mean, most likely he's just one of that queerphobic teen boys. Trying to explain something to that kind of people is really hard, cause after ussr Ukrainians still very uneducated about lgbt+ people and that cause tons of stereotypes and assumptions, that's not correct. You can try show him some Ukrainian educational content about queer people. Not that long ago Ukrainian lgbt+ film \"Tolerance lessons\" ( ) came out, it's about gay man's interaction with average Ukrainian family, not exactly what you're looking for, but good start. And also you can ask Ukrainian lgbt+ organization \"KyivPride\" for some educational content for your cousin. That organization have account on insta where you can contact them.",
            "There is the word for being trans in Russian, its the same as pronunciation English - ",
            "Trans is trans in Russian and Ukrainian as well I believe. Say that you was born as a girl but u dont feel like one so now you are a boy",
            "Ukrainian kid who emigrated to my town was legit non binary  i wont claim to know everything about it- because I certainly do not- but they seemed pretty comfortable in their identity and was out to their whole family and friends back home.",
            "Russian word for trans is transgender",
            "Is it possible to ask him where hes not understanding? See where the logic is falling apart and work from there. I think you were explaining it very clearly without having the word transgender there."
        ]
    }
}