{
    "R/FTM Sub Hub: Monthly threads, Frequently Posted Topics, Sibling Subs, and more!": {
        "title": "R/FTM Sub Hub: Monthly threads, Frequently Posted Topics, Sibling Subs, and more!",
        "score": 34,
        "url": "https://www.reddit.com/r/ftm/comments/193tomc/rftm_sub_hub_monthly_threads_frequently_posted/",
        "content": "Welcome to r/FTM ! Whether you're new here, or you've been here for ages, this is the central hub for all sorts of helpful links, information, and frequently asked questions.\n\nRecent mod posts:  \n[Announcement regarding journalists asking about DIY HRT](https://www.reddit.com/r/ftm/comments/1c8wcpr/announcement_regarding_journalists_search_for/)\n\n[Rules explained in detail](https://www.reddit.com/r/ftm/comments/1c98ezh/mod_post_reminder_about_rules_please_read_so_you/)\n\n[Moderator applications \\[OPEN\\]](https://www.reddit.com/r/ftm/comments/1cscrws/mod_applications_for_rftm_and_our_sibling_sub/)",
        "num_comments": 23,
        "comments": [
            "Under frequently posted topics, you guys should consider listing atrophy. I feel like I see posts about it multiple times per day. It’s usually men and non-binary people on T describing textbook symptoms of atrophy, wondering if they should see a doctor. There are many posts about it they could look through",
            "Maybe add r/FTMHysto to the surgery subs?\n\nLove this run-down, btw.",
            "Hey, you should add r/transnord under region specific subs.",
            "Hey, could you add r/transfitcheck? It's a subreddit i just made but it's meant to be a place where people can ask \"am i flat\" type questions, as well as a fashion sub specific to trans people.",
            "There's r/ainbow for general LGBT subs, r/TransgenderIndia and r/germantrans for region-specific, r/MilitaryTrans for niche, r/tmpoc for general ftm subs. These are just a few I can think of.",
            "Hey, would y'all add r/Transgender_Surgeries for surgery subs? I think it's the largest surgery sub intended for all transgender people",
            "r/metalheadtransmen could be put in trans + niche subs!",
            "for frequently posted topics could you please add \"am i valid?\" it's constantly posted and i dont know about others but it gets annoying after a while",
            "Could you please  add  r/transgender to the General Subs catagory for news specifically focussed on tran issues\n\nAlso I noticed  r/LGBTnews is listed twice here \n\nThanks for all your work making this post",
            "Can't believe I forgot that one! I'll add it."
        ]
    },
    "how do i explain being trans to a barely fluent Ukrainian kid.": {
        "title": "how do i explain being trans to a barely fluent Ukrainian kid.",
        "score": 242,
        "url": "https://www.reddit.com/r/ftm/comments/1dqvy1f/how_do_i_explain_being_trans_to_a_barely_fluent/",
        "content": "my 2nd cousin (14 i think and Male)  is a emigrant from Ukraine. he is diagnosed but definitely has ASD. i keep trying t explain that im not female but he doesn't understand. i tried telling him \"i was girl, now i am boy\" or saying things like \"im a guy/boy\" but doesnt understand. apparently there's  no Russian or Ukrainian word for trans. does anyone have tips? \n\nps, hes also said things like \"i hate gay people\" i dont blame him though because he grew up in a homophobic country with my homophobic conservative cult leader uncle (not joking, he runs a cult)",
        "num_comments": 21,
        "comments": [
            "There absolutely is a word for being trans in Russian and Ukrainian (who told you that??) he's probably just very unfamiliar with the topic because of his personal upbringing. Even the average Russian bigot (won't speak for Ukraine) is likely to be aware of trans existence, they're just more likely to think of us in terms of slurs.\n\nsource: am Russian and trans",
            "Russians and Ukrainians calls trans \"транс\" too\nBut there aren't much information abt this stuff in there so he probably just doesn't know that it's possible",
            "As someone who speaks both russian and ukrainian, there actually there IS a word for trans in both russian and ukrainian and it’s the same - trans. The issue here is not that he doesn’t understand what you mean. It’s that he is prejudiced towards people like you, and doesn’t want to delve into it. He may think you’re crazy or just not want to listen to your “homo bullshit” (an actual phrase I’ve heard concerning this from another prejudiced russian guy I know). You’re not the issue, he is. Whether to waste your time trying to make him understand/reconsider is your choice!",
            "he does actually run a Conservative cult. he doesnt let his 4 AFAB kids wear rainbow or like rainbows because its too gay. : I\n\nim not related to him though (thank gods)",
            "I say that as Ukrainian trans person, our country is kinda queerphobic and for some reasons cishet teenage boys is THE MOST queerphobic kind of people. He understand what you mean, most likely he's just one of that queerphobic teen boys. Trying to explain something to that kind of people is really hard, cause after ussr Ukrainians still very uneducated about lgbt+ people and that cause tons of stereotypes and assumptions, that's not correct. You can try show him some Ukrainian educational content about queer people. Not that long ago Ukrainian lgbt+ film \"Tolerance lessons\" (Уроки толерантності) came out, it's about gay man's interaction with average Ukrainian family, not exactly what you're looking for, but good start. And also you can ask Ukrainian lgbt+ organization \"KyivPride\" for some educational content for your cousin. That organization have account on insta where you can contact them.",
            "There is the word for being trans in Russian, its the same as pronunciation English - Транс",
            "Trans is trans in Russian and Ukrainian as well I believe. Say that you was born as a girl but u don’t feel like one so now you are a boy",
            "Ukrainian kid who emigrated to my town was legit non binary 😂 i wont claim to know everything about it- because I certainly do not- but they seemed pretty comfortable in their identity and was out to their whole family and friends back home.",
            "Russian word for trans is transgender",
            "Can you check in a Ukrainian subreddit for someone who can act as a translator?"
        ]
    },
    "Scared for our community": {
        "title": "Scared for our community",
        "score": 1017,
        "url": "https://www.reddit.com/r/ftm/comments/1dqj6xu/scared_for_our_community/",
        "content": "Just watched the presidential debate and had an interesting convo with my mom afterwards.  I am openly out to her and on T.\n\nI don’t like either candidate, so I am having so much trouble deciding.  The debate didn’t touch on queer issues, so I expressed I was worried about it.\n\nIn response, my mom called me “selfish” and said I need to focus on “everyone else” and what will benefit the majority.\n\nUMMM THERE ARE MILLIONS OF QUEER PEOPLE IN THE US???\n\nI just don’t even comprehend this response.  She is about to retire and only wants to vote for Trump bc he promises better protection for retiring people.  Doesn’t that make her incredibly selfish???\n\n\nEdit: I do not support Trump at all.  I want to vote for Biden, but inflation is destroying us.  He is making it hard to support him.  I want a new candidate against Trump that I know will protect us and slow down/reverse inflation.  I just wanna eat and pay rent that isn’t through the roof 😭 I also want to make sure I don’t have to keep looking over my shoulder because some crusty man wants to get rid of queer people.",
        "num_comments": 237,
        "comments": [
            "I have had to simply look at it like this - I am not voting for trump or biden, I am voting for the supreme court. That's it. Full stop. The next president will have the chance to most likely appoint 2 new SCJ and I need to vote for the person who is most likely to appoint SCJs that won't try to revoke my rights to simply exist. This is going to be a rough 4 years no matter who gets elected, so I'm trying to think long-term about what is best for our country past this upcoming term and just try to hunker down and survive until better options become available.",
            "You have to choose whether or not you want rights. That is ultimately the choice it comes down to. Biden isn’t the ideal candidate, but he’s not coming after trans people. He’s not the one pushing Project 2025.",
            "Your vote isn’t a full-chest endorsement. It’s a chess move. Theres no third option where if enough people avoid voting out of moral principle because they don’t like Biden they go “Oh! Guess no president this time!”\n\nIf a bus is driving through a rainstorm with 50 passengers and 1 votes to pull over and wait, and two vote to drive off a cliff to get out of the situation, and everyone else abstains because they don’t like either option: the bus is going off a cliff.",
            "I'm an anarchist, so, not a Democrat, but I ended up registering as one and will be gritting my teeth n vote for Biden. He's probably going to die in the next 4 years anyway. In the end shit isn't going to change until it all collapses or all the old fucks drop dead, I'd rather have faux support than none",
            "She’s pretty foolish for thinking trump cares AT ALL about anybody but himself. He’s all lip service and his presence makes it ok for shitty people to be more outwardly shitty.",
            "In my opinion, Biden is mediocre at worst. Trump actively breaks the law and wants to be a dictator.\n\n\nI would love it if we had a better candidate than Biden, but the way the US electoral system works, it's very difficult for third-party candidates to stand a chance. \n\n\nI also think it's really important to be conscious of what the president can and can't directly control. Even a great president is going to be limited by a legislative branch where MAGA Republicans refuse to cooperate and a Supreme Court that currently skews conservative and has multiple Trump appointees. The president also has limited power over state laws ",
            "Did you tell her Trump wants to take away social security and Medicare?     \n\nI don't get how people can vote for him.\n\nNote: I'm not a Biden fan but will be voting for him. As I understand the negative global impact of another 4yrs under Trump.",
            "The way I saw it put somewhere was voting is not like driving a car but taking a bus. Look at which candidates will get you closer to where you want to be.\n\nI don't like either candidate but I sure as shit know one will do our community far more harm.",
            "You’re having a hard time choosing between Trump and Biden?",
            "I just want Blue to win bc if any more of the Supreme Court dies/retires we need to have dems put in the replacement. The time for a new candidate is the day after the election we need a solid candidate for the next go around...tbh tho if both of them croaked before election day it would be best for the country. They're too damn old."
        ]
    },
    "How do I “WOOO”": {
        "title": "How do I “WOOO”",
        "score": 461,
        "url": "https://www.reddit.com/r/ftm/comments/1dqoxsj/how_do_i_wooo/",
        "content": "At pride this year I kept wanting to “WOOOO!” during the parade, but since starting t I literally can’t. If I try to do it normally, where I get louder and high pitched, my voice dies out. If I try and do it lower but louder I just literally sound like I’m saying “WOO” in basically my normal voice \n\nI can’t rlly get louder with a male voice when I yell like that ",
        "num_comments": 57,
        "comments": [
            "I have found that “YEAHhHhHhHh” is a lot easier   Lmk lol",
            "i’m 5 years on T and i literally still haven’t figured out how to scream/cheer with a deeper voice lmaooo",
            "I think i had something similar, because of my range getting lower lol. I think you'll have to experiment and it may get easier as your voice settles more",
            "Just practice in your car 😂 it definitely takes some adjusting, you won’t be able to do it like you used to but play around with different pitches and styles of “woo” and you’ll get there!",
            "Me call has transformed into a crescendo from chest voice to head voice 'yyyyyeeeeeeEEEAAAAAHHHHHHHH!!!' hope that helps lol",
            "Give em a good ole YEE HAW baby",
            "I’m four years on T and just getting my “woo” back lol. I’m a singer so I’ve been experimenting with my range a lot, which has helped. Before T, all the notes on the scale were accessed with pretty much the same technique. Now I notice a couple of really marked transition points on the scale where if I don’t change my technique, my pitch does all kinds of weird stuff. \n\nSing an open note in your chest voice, then slide up the pitch without stopping, like a slide whistle. There might be a point at which your voice cuts out for an instant, and when it comes back the note you produce might be quite a bit higher or more whistle-like than you intended. Wherever your voice cut out, that’s the note you have to avoid, because singing or woo-ing anywhere near it is likely to make your voice crack. Learn to hold a note and do scales above that breaking point to strengthen your head voice, then find a comfortable note or couple of notes in that head voice to practice woo-ing at. \n\nAmateur singer, might not be using all the above terminology correctly, etc. but this is what worked for me.",
            "I had to go to masculinization speech therapy to learn how to yell again after being on T for 18mo. My kid would be running ahead of me too far on our hikes and I couldn't yell for her to stop or come back. It freaked me out. The therapist helps you learn where/how to project your voice differently. It was very helpful.",
            "I can only do a short WOO cause otherwise I sound like a dying dog. Maybe doing a short one might work for you as well",
            "I have also lost a chunk of my higher range and during the first couple months when my voice was starting to crack I was shocked at how many of my normal sound effects I couldn't make anymore 😭 But I just started singing (badly) and shouting and testing my range and pushing the limits of my new voice as it changed so I could get used to my range and now I just basically scream in a lower register but it's still loud and sounds like a scream or shout. You gotta try to hoot and holler and find your new noises!! I've even improved my singing voice a bit!"
        ]
    },
    "is this common for trans guys? ": {
        "title": "is this common for trans guys? ",
        "score": 84,
        "url": "https://www.reddit.com/r/ftm/comments/1dr0jcu/is_this_common_for_trans_guys/",
        "content": "Hopefully the title isn't offensive. I can't tell if it is. if so, then it isn't your fault for being offended, I haven't been in the community in a while and I apologize in advance. \n\nSo there was this one trans guy I saw on the internet and he said that he doesn't like meeting other trans guys irl because they feel like competition to him and he constantly compares himself to them thinking that they're more tall, masculine, etc. and he flexes off what he has to make them feel lesser than him. \n\nHe also said that he doesn't \"belong\" the LGBT because he doesn't like labels which is an obvious logical contradiction/lie because he said that he identifies as a trans man. \n\nHave you guys ever had this thought process? Have you heard of any other trans men having this mentality or something akin to this mentality? ",
        "num_comments": 36,
        "comments": [
            "Internalized transphobia and misogyny are what it's giving to me. Along w low self-esteem and heightened insecurity. Seems like he could stand to learn how to build himself and his empathy up",
            "I get what the other comments said but I honestly just feel bad for him, a mindset like that doesn’t come from nowhere. He probably was hurt by some fellow trans guys and a lot of trans guys from what I’ve seen can feel isolated from the lgbt community. \n\nI do agree it does sound like toxic masculinity, and some internalized transphobia, but they didn’t appear from nowhere and this is why I try to practice as much kindness as possible. As a trans person trying to love themselves, I think someone like this would be exhausting to be around, and I love meeting fellow trans people. But, again imo he was likely hurt or let down by another trans dude. ",
            "That's called insecurity.",
            "sounds like toxic masculinity",
            "Extreme insecurity is common among trans men, yes.",
            "I have never been that insecure in my life, no.",
            "I mean this just sounds like regular toxic masculinity with an extra step. He is just an insecure guy. Hopefully he sorts that out for his own sake.",
            "I can totally see comparing yourself to other trans guys. That's one reason why I don't really hang out with other trans guys. The other being I'm stealth and introverted AF. I am insecure as FUCK and my dysphoria just makes it 100x worse. So for my own sanity I just stay online, where it's easier to separate myself from things. (The tiny people in my internet box aren't real so they can't hurt me lol)\n\nBUT taking it out on others and posturing like that is not cool. If you've got issues, it's kinda your job to handle your issues like a big boy. This dude sounds immature tbh.  I would not condone that type of behavior, even if I understand where it comes from.",
            "I see it in r/ honest transgender from trans men and women. I think it's really sad that some people seem this negative and jealous towards others. When I see a successful trans man it gives me hope for my own future of what could be possible. Also, I am happy for others when their transition went well or their life is going in a positive way. \n\nIt doesn't only apply to trans people either. Some people in life hate to see other people's success. We should be happy when things are going well and celebrate with people rather than all the jealousy and negativity. And hope that they support us in return when we have success also. It's all about mindset, how people choose to view it.",
            "okay so i do like meeting other trans guys but my brain does immediately compare me to them and it often leaves me feeling bad. i'm aware this is insecurity and fragile masculinity\n\ni dont get the not belonging in the lgbt community but i feel like straight trans guys get thrown under the bus so i can understand that"
        ]
    }
}