{
    "Rules Updated and Changed!": {
        "title": "Rules Updated and Changed!",
        "score": 515,
        "url": "https://www.reddit.com/r/FundieSnarkUncensored/comments/128ubo9/rules_updated_and_changed/",
        "content": "Hello everyone!\n\nHappy Saturday!\n\nAnd a Happy April's Fools, unfortunately this is not a joke announcement or post (sorry about that!) but we do have some news for everyone.\n\nWe've updated and changed the rules! Below, you'll see the newly updated rules. We essentially condensed and changed some of the wording to make a shorter list. A reminder that the claim of 'I didn't know that was a rule' or 'I didn't see that rule' is NOT an excuse. We urge everyone to read through this list carefully, and if you have any concerns, send us a modmail. \n\n&#x200B;\n\n1)    **Look but don’t touch:** \n\nYou can view their content, but you cannot interact with their content. This includes (but is not limited to) commenting, answering poll questions, emailing them, etc. Anyone found to be engaging with the fundies will be met with a permanent ban with no eligibility for appeal.\n\n&#x200B;\n\n2)    **Be kind & remember the human:** \n\nComments that are rude and/or antagonistic will not be tolerated. Bigoted, xenophobic, transphobic, homophobic, racist, ableist, antisemitic, or misogynistic language will not be tolerated. T**his includes speculating on the sexuality or gender identity of literally anyone**. Do not use terms such as \"Hitler\" or \"Heitler\" to refer to fundies. Doing so will result in an immediate permanent ban. Being kind also means using trigger warnings as needed.\n\n&#x200B;\n\n3)    **Archive links of fundie-run websites and mirror YouTube videos:** \n\nDirect links fundie-run websites will be removed because we don't want to send traffic to these sites. You can archive links to these sites via: [www.archive.is](https://www.archive.is), [www.archive.org/web/](https://www.archive.org/web/), or [www.unvis.it](https://www.unvis.it). Just paste the URL in, and it will create an archive link for you to share. You can use websites like [hooktube.com](https://hooktube.com) and [https://ytprivate.com/feed/trending](https://ytprivate.com/feed/trending) to share videos without giving the fundie any views. \n\n&#x200B;\n\n4)    **Verify with mods prior to doing AMAs:**\n\nDid you escape the fundie life? Did you rub elbows with a fundie at a cream of crap convention? We’d love to hear about it! If you’re interested, please get in touch with the mods first to get yourself verified. We want to keep the experience authentic, so all AMA's must be mod approved.\n\n&#x200B;\n\n5)    **Christian snark only:** \n\nThis is a snark sub for fundamentalist Christians- keep it fundie & keep it snarky. While we welcome snarkers from all different backgrounds, **the people we snark on are Fundamentalist Christians and only Fundamentalist Christians**. There are other subs dedicated to other faiths or about religious bullshittery in general if you find run-of-the-mill religious weirdness. This means no snarking on Hinduism, Islam, Judaism, etc. Some branches of Christianity considered fundamentalists (in addition to fundie Protestants) are TradCaths, hardcore Mormons, and Jehovah’s Witnesses.\n\n \n\n6)    **Appearance snark and body shaming:** \n\nWhile it’s hard to define what is crossing the line, you’ll know it when you see it. Saying Fred/Franny Fundie looks like X is fine. (Ex: David Rodrigues looks like Shrek, B-Beal looks like the Grandpa from The Munsters.) Saying you do/don’t find someone attractive is fine. Do not snark on the appearance or bodies of children, with the exception of choices that their parents have made for them, or how they may appear in relation to their parents. (Examples: Janessa looks malnourished while David is obviously well-fed, or how the Collins kids always wear filthy clothing is fine.)\n\n&#x200B;\n\n7)    **No Fundie-esque crap:** \n\nIf your content could come out of the mouth of the fundies, we don’t want it here. Users found to be engaging in such rhetoric will be banned. It’s okay to hold a nuanced view of complex issues, but if your opinion would be at home in a fundies mouth, we won’t tolerate it.\n\n \n\n8)    **No gatekeeping:** \n\nDo not tell people what they can and can’t snark on. Different people have different opinions on what is/isn’t snarkable and we want to respect that so long as it isn’t rule-breaking. **Do not tell people they have to censor kids’ faces. You can censor them if YOU want to, but nobody HAS to and YOU don’t get to tell people they have to.** Personally disliking something is *NOT* a reason to report a post or comment. Unless a post or comment breaks sub rules or Reddit ToS, do not report it. Scroll past. \n\n \n\n9)    **Armchair Diagnosing:** \n\nWhile it’s fine to comment that you think a fundie is showing the signs X illness, it’s not okay to make fun of it. Mental illness is a serious issue, and it’s ok to have concern, but it’s not cool to be snarky about it. Cool: “I think Kelly is exhibiting signs of bipolar disorder.” Not Cool: “Karissa is acting more depressed than the economy.” or \"Franny Fundie for sure has multiple personality disorder.\"",
        "num_comments": 1,
        "comments": [
            "#Welcome to /r/fundiesnarkuncensored. Please take a minute to review the new rules:\n\n* Look but don't touch\n\n* Be kind and remember the human. This means using trigger warnings as needed, no sexuality or gender identity speculation. Users found to be engaging in such rhetoric will be permanently banned.  \n\n* Referring to anyone as Hitler or Heitler is likewise not allowed, and will not be tolerated at all. If you do so, you will be permanently banned with no possibility of appeal.\n\n* Archive links of fundie-run sites and social meida.  \n\n* Verify with the mods before doing an AMA.\n\n* This subreddit is for *snarking* on *Fundamentalist Christians*. Keep it snarky and keep it fundie.\n\n* Please take a moment to [review our new rule on appearance snark](https://www.reddit.com/r/FundieSnarkUncensored/wiki/index)\n\n* If your content would be at home in the mouth of a fundie, we won't tolerate it here. \n\n* Don't gatekeep. Just because you don't think it's snarkable doesn't mean it's not snarkable. Scroll past.\n\n* Please see the updated wiki for new rules regarding armchair diagnosing. \n\n   \nIf you have any questions, please send us a modmail.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FundieSnarkUncensored) if you have any questions or concerns.*"
        ]
    },
    "This screenshot conveys so much": {
        "title": "This screenshot conveys so much",
        "score": 528,
        "url": "https://i.redd.it/a1mhlpc7se9d1.jpeg",
        "content": "Quil has sadness in his eyes.  JD Lott mocks his toddler’s feelings on camera for the gram.  I just hate the way they treat their children.  ",
        "num_comments": 176,
        "comments": [
            "#These people vote in every election- do you? Are you registered to vote?  [You can check your voter registration here!](https://www.nass.org/can-I-vote)  \n\n#Also, there's a few things to remember as far as rules go:\n\n- You can view the content- you cannot interact with it. This includes (but is not limited to) commenting, answering poll questions, emailing them, etc. ***Anyone found to be engaging with the fundies will be met with a permanent ban with no eligibility for appeal.It does not matter if you did so before you joined the sub.***\n\n- Speculating on the sexuality of literally anyone is prohibited. ***Anyone found to be doing so will be met with a permanent ban with no eligibility for appeal.***\n\n- Appearance snark: What's allowed? You're allowed to make comparisons. (Bethy looks like Grandpa Munster, for example.) You are allowed to say you find them attractive or repulsive looking. Saying Kelly Havens has dry skin that could benefit from sunscreen and a moisturizer is fine. You are allowed to snark on the appearance of children *as it relates to their parents choices for them.*. Examples: Janessa looks malnourished and sickly while Shrek has clearly never missed a meal. If you feel it is crossing the line report it, but if the content falls within the parameters above, leave it alone.\n\n- Don't gatekeep. This means no comments such as \"I don't think we should snark on....\" or any iteration of that. If you don't like it, scroll past. Don't report it or comment how you don't like the content. Along the same vein, don't backseat mod. Leave that up to us. \n\n- Lastly, if the rhetoric you are posting would be at home in the mouth of a fundie, we don't want it here and we won't tolerate it. \n\n\nShould you have any questions, please feel free to reach out. Have a Lord Daniel day, and may the power of snark compel thee. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FundieSnarkUncensored) if you have any questions or concerns.*",
            "That guy isn't attractive AT ALL",
            "That poor baby. JD Lott is such an asshole.",
            "The fact that JD doesn’t see how poorly this picture reflects on him is really something. That poor kid.",
            "It’s the JD and Britney Lott show! They are the only ones who matter. The kids are simply bit players, easily replaced.",
            "what a chode",
            "When I watched the video I was angry at how JD and Britney Lott were supposedly engaging in a chat with the toddler but instead of speaking to him and looking him in the eye,’they are speaking to the camera and looking at the camera. Normally both parents should be turned to the child they are talking with but these “parents”‘are sitting beside him facing the camera. No engagement or trying to understand what the child is feeling, just mocking him for falling asleep in the “special treat ride.”",
            "My cat when I come to bother her for the twentieth time this morning.",
            "Is he pulling on the kid’s forehead???",
            "The lack of respect for boundaries, bodily autonomy, & the promotion of rough-housing's gonna bite SusBus on the ass one of these days. He's got a whole passel of boys, most of whom will prolly end up bigger than him. I suspect most all of those boys are going to leave as soon as they can, their sperm donor seems the kind to passively-aggressively push them out."
        ]
    },
    "Just what strugglebus needs, a puppy. Is this just the summer of new animals to neglect?!": {
        "title": "Just what strugglebus needs, a puppy. Is this just the summer of new animals to neglect?!",
        "score": 386,
        "url": "https://i.redd.it/6k7owr8m3e9d1.jpeg",
        "content": "",
        "num_comments": 179,
        "comments": [
            "#These people vote in every election- do you? Are you registered to vote?  [You can check your voter registration here!](https://www.nass.org/can-I-vote)  \n\n#Also, there's a few things to remember as far as rules go:\n\n- You can view the content- you cannot interact with it. This includes (but is not limited to) commenting, answering poll questions, emailing them, etc. ***Anyone found to be engaging with the fundies will be met with a permanent ban with no eligibility for appeal.It does not matter if you did so before you joined the sub.***\n\n- Speculating on the sexuality of literally anyone is prohibited. ***Anyone found to be doing so will be met with a permanent ban with no eligibility for appeal.***\n\n- Appearance snark: What's allowed? You're allowed to make comparisons. (Bethy looks like Grandpa Munster, for example.) You are allowed to say you find them attractive or repulsive looking. Saying Kelly Havens has dry skin that could benefit from sunscreen and a moisturizer is fine. You are allowed to snark on the appearance of children *as it relates to their parents choices for them.*. Examples: Janessa looks malnourished and sickly while Shrek has clearly never missed a meal. If you feel it is crossing the line report it, but if the content falls within the parameters above, leave it alone.\n\n- Don't gatekeep. This means no comments such as \"I don't think we should snark on....\" or any iteration of that. If you don't like it, scroll past. Don't report it or comment how you don't like the content. Along the same vein, don't backseat mod. Leave that up to us. \n\n- Lastly, if the rhetoric you are posting would be at home in the mouth of a fundie, we don't want it here and we won't tolerate it. \n\n\nShould you have any questions, please feel free to reach out. Have a Lord Daniel day, and may the power of snark compel thee. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FundieSnarkUncensored) if you have any questions or concerns.*",
            "“We could smell drugs” girl, what? This woman will say anything to appear like a martyr. I can’t imagine the smell in that bus.\n\nETA: I live in Idaho, so I’m aware of the rampant drug use, especially in the northern region. I just don’t believe Bethany lol. She’s a known liar for rage bait and they consistently have “bad experiences” in every place they visit",
            "Oh man. A puppy, two cats, and 7 people in an RV? Definitely sounds safe and sanitary…",
            "Selling puppies to random people in a parking lot is pretty shit but it’s from one shit situation to another. ",
            "Sorry pup. Out of the frying pan and into the dumpster fire.",
            "Oh FFS. They can’t even afford to keep full propane tanks so their actual children won’t freeze in the winter, and now they are going to take on a puppy who needs shots, spayed/neutered, food, leash, crate, etc? And now on top of the poop explosion, they are going to have puppy pee soaking in their cheap, poorly made, used travel trailer? For real? These two shouldn’t even have a goldfish",
            "I'm sure the drug couple were thinking she smells like poop exploded in her bushome and it was never properly cleaned.  Now they have a not housebroken puppy in that mix.",
            "And in doing that, you've encouraged them to breed MORE puppies! Fuck backyard breeders and fuck Struggle Busany.\n\nAlso, as the owner of a four-month-old Australian shepherd, does she have the slightest idea how much work goes into raising a puppy??",
            "What do drugs smell like and how would they know?",
            "What does she mean by COUNTRY (😉)? I feel like I’m missing something?"
        ]
    },
    "JD and Britney Lott are reaching a tipping point...": {
        "title": "JD and Britney Lott are reaching a tipping point...",
        "score": 778,
        "url": "https://www.reddit.com/r/FundieSnarkUncensored/comments/1dqqiwm/jd_and_britney_lott_are_reaching_a_tipping_point/",
        "content": "in which they can no longer claim plausible deniability that something is wrong with their infant son, Boone. \n\nIf they took him to a medical professional now, and expressed concern about even just one of his glaring issues, they are still at the point where they can claim that they thought ALL of the other things were a \"variation of normal\".\n\nIf they continue to try to somehow convince the Internet that everything is \"perfect\" with their baby son, there will come a time when any medical professional who comes in contact with this child will be able to clearly see the medical neglect that we have all been witness to. \n\nThis could trigger a full investigation as to WHY they waited so long to seek help for this child, and could potentially start an investigation into their living situation and all of the other children involved. \n\n",
        "num_comments": 233,
        "comments": [
            "#These people vote in every election- do you? Are you registered to vote?  [You can check your voter registration here!](https://www.nass.org/can-I-vote)  \n\n#Also, there's a few things to remember as far as rules go:\n\n- You can view the content- you cannot interact with it. This includes (but is not limited to) commenting, answering poll questions, emailing them, etc. ***Anyone found to be engaging with the fundies will be met with a permanent ban with no eligibility for appeal.It does not matter if you did so before you joined the sub.***\n\n- Speculating on the sexuality of literally anyone is prohibited. ***Anyone found to be doing so will be met with a permanent ban with no eligibility for appeal.***\n\n- Appearance snark: What's allowed? You're allowed to make comparisons. (Bethy looks like Grandpa Munster, for example.) You are allowed to say you find them attractive or repulsive looking. Saying Kelly Havens has dry skin that could benefit from sunscreen and a moisturizer is fine. You are allowed to snark on the appearance of children *as it relates to their parents choices for them.*. Examples: Janessa looks malnourished and sickly while Shrek has clearly never missed a meal. If you feel it is crossing the line report it, but if the content falls within the parameters above, leave it alone.\n\n- Don't gatekeep. This means no comments such as \"I don't think we should snark on....\" or any iteration of that. If you don't like it, scroll past. Don't report it or comment how you don't like the content. Along the same vein, don't backseat mod. Leave that up to us. \n\n- Lastly, if the rhetoric you are posting would be at home in the mouth of a fundie, we don't want it here and we won't tolerate it. \n\n\nShould you have any questions, please feel free to reach out. Have a Lord Daniel day, and may the power of snark compel thee. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FundieSnarkUncensored) if you have any questions or concerns.*",
            "It will go much better for them if they are the ones to initiate medical care then if it's forced on them by CPS.",
            "At this point I'm convinced they would rather let their child DIE than take him to the doctor. They do not want to care for a special needs child or acknowledge they've done anything wrong. Brittney would ADORE the attention she would get for such a tragedy, they can continue traveling \"unburdened\", and never have to face the fact their own neglect harmed their child.",
            "It’s been depressing as hell to watch Boone get worse via the internet. I can’t imagine what it’s like watching it in real life and just doing nothing. They’ve had enough babies to know he’s not behaving normally. I bet even the older kids can tell there’s something different about Boone.",
            "I want to make about post about her claim that her red light made all her forehead wrinkles disappear but I’m not sure if that would be considered appearance snarking. \n\nYa’ll. She can barely move her face muscles she has so much freaking Botox up in there. You can hear it in her voice.",
            "it could trigger a full investigation if the authorities can track them down. seems to be a real sticking point with those two, they seem to be running from *something*",
            "Yep. They are too stupid to realize they have potentially destroyed their family. It’s like watching a bad car accident in slow motion.",
            "They’ll never take him to the doctor just to spite the online haters.",
            "Yes, but I do want to add a fair warning for everyone on here, a CPS investigation is unlikely to result in many changes, and especially not in the removal of the children. \n\nThe first and most glaring issue is the lack of address. Despite CPS being a national organization, they only operate within their own state, and in most cases do not talk with CPS workers in other states. Which means that if an investigation is opened, they can just pack up and roll over to the next state and try again. Eventually, they will find a doctor that doesn’t report it. So unless they took Boone to a hospital and they placed a hold on him so that he can’t realized a la Take Care of Maya, it’s unlikely anything happens here. \n\nBut ok best case they stick around and an investigation happens. Most likely they will be initially mandated to take Boone to his appointments while a full investigation is done. Keep in mind that while they may talk with the other kids, the main purpose here is to prove if there was medical neglect for Boone or not, they are not looking at the other kids as potential victims initially, though if something come up it will be addressed. Of course the biggest thing will be the sleeping arraignments. CPS may require them to move somewhere with more space per child, or at least one bed per child. \n\nHowever, the kids are fed, the kids are clean, and as long as they are not being repeatedly physically beaten CPS is not likely to remove them. Remember, homeschooling is not illegal, if they can prove some type of education then they will not be required to put them in school. Parentifying your older kids is not illegal, frowned upon, but not illegal. Locking your kids in their rooms at bed time is not illegal. Bullying your children is not illegal. Emotional neglect is unlikely to result in charges. \n\nWhile we know they are shitty parents, in terms of the CPS system (which is also trash) they will likely have to pay a fine, maybe community service, maybe attend consulting sessions, and prove they are providing care for at least Boone (though may be required to yearly physical therapy other kids). Though this does depend on what state they are in when they decided to take him in. \n\nI know that was long but I really just want to people here to have a more realistic understanding of the likely outcomes of a CPS investigation. I could be wrong on somethings, I’m just a teacher who has felt with the system a lot trying to protect some students, not a CPS expert.",
            "Baby Boone deserves so much better. Heck, all of those kids do."
        ]
    },
    "This is the most typical I've seen Boone act since birth.": {
        "title": "This is the most typical I've seen Boone act since birth.",
        "score": 449,
        "url": "https://v.redd.it/c9d2kd1sbd9d1",
        "content": "Britney is definitely trying to convince her followers that Boone is fine, and the increasing comments about her needing to take him to a doctor are just trolls.",
        "num_comments": 127,
        "comments": [
            "#These people vote in every election- do you? Are you registered to vote?  [You can check your voter registration here!](https://www.nass.org/can-I-vote)  \n\n#Also, there's a few things to remember as far as rules go:\n\n- You can view the content- you cannot interact with it. This includes (but is not limited to) commenting, answering poll questions, emailing them, etc. ***Anyone found to be engaging with the fundies will be met with a permanent ban with no eligibility for appeal.It does not matter if you did so before you joined the sub.***\n\n- Speculating on the sexuality of literally anyone is prohibited. ***Anyone found to be doing so will be met with a permanent ban with no eligibility for appeal.***\n\n- Appearance snark: What's allowed? You're allowed to make comparisons. (Bethy looks like Grandpa Munster, for example.) You are allowed to say you find them attractive or repulsive looking. Saying Kelly Havens has dry skin that could benefit from sunscreen and a moisturizer is fine. You are allowed to snark on the appearance of children *as it relates to their parents choices for them.*. Examples: Janessa looks malnourished and sickly while Shrek has clearly never missed a meal. If you feel it is crossing the line report it, but if the content falls within the parameters above, leave it alone.\n\n- Don't gatekeep. This means no comments such as \"I don't think we should snark on....\" or any iteration of that. If you don't like it, scroll past. Don't report it or comment how you don't like the content. Along the same vein, don't backseat mod. Leave that up to us. \n\n- Lastly, if the rhetoric you are posting would be at home in the mouth of a fundie, we don't want it here and we won't tolerate it. \n\n\nShould you have any questions, please feel free to reach out. Have a Lord Daniel day, and may the power of snark compel thee. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FundieSnarkUncensored) if you have any questions or concerns.*",
            "Yes, lift weights right above your baby, cause there is no risk in that... /s",
            "I cannot imagine making the life choices that would lead me to working out in 24 square inches of free (ish) space with a baby between my legs next to the toilet on a van I share with 10 people, 8 of those people I made and effectively held hostage in the van with me. \n\nMake better choices Britney. And have your baby looked at by a doctor. ",
            "Tell me she’s not waving a 15 lbs kettlebell over an infants bassinet??",
            "Because lying on his back is the only position where she can fake Boone looking up at her. Every attempt to stage him looking at her from an upright position has failed.",
            "I was so anxious watching her lift and lower a heavy weight literally inches from her newborn baby.",
            "He’s yawning. Complete with lip smack after. Glad to see the kicking but this does not demonstrate any engagement with her. Fists still closed too. \n\nThere has been no suggestion of any developmental toys - no mobiles, baby gyms, Sophie giraffe or other grippy teether toys, rattles or other grabby toys, those little ankle things you can strap on, a taggy blanket, nothing that I have seen. I know he’s still tiny and she doesn’t show everything of course but it seems so bleak. We had so many things for our babies because you never knew what they would like or react to and they change so quickly. The simpler toys blow their minds too - it is so reinforcing for their development to get a reaction from a rattle or a crinkly blanket and they just love the interaction from that kind of play.  \n\nAnd the kettlebell - people I know have killed pets with those things - she’s being unbelievably careless.",
            "It still doesn't look like he is focusing on the big lady right in front of him moving around.",
            "He is not baking in the dessert sun for once.",
            "his arms are still concerning but at least hes showing emotion 🥹"
        ]
    }
}