{
    "Forging A Return to Productive Conversation: An Open Letter to Reddit": {
        "title": "Forging A Return to Productive Conversation: An Open Letter to Reddit",
        "score": 1191,
        "url": "https://www.reddit.com/r/funny/comments/14jmh7e/forging_a_return_to_productive_conversation_an/",
        "content": "To All Whom It May Concern:\n\nFor fifteen years, /r/Funny has been one of Reddit’s most-popular communities. That time hasn’t been without its difficulties, but for the most part, we’ve all gotten along (with each other and with administrators). Members of our team fondly remember Moderator Roadshows, visits to Reddit’s headquarters, Reddit Secret Santa, April Fools’ Day events, regional meetups, and many more uplifting moments. We’ve watched this platform grow by leaps and bounds, and although we haven’t been completely happy about every change that we’ve witnessed, we’ve always done our best to work with Reddit at finding ways to adapt, compromise, and move forward. \n\nThis process has occasionally been preceded by some exceptionally public debate, however.\n\nOn June 12th, 2023, /r/Funny joined thousands of other subreddits in protesting the planned changes to Reddit’s API; changes which – despite being immediately evident to only a minority of Redditors – threatened to worsen the site for everyone. By June 16th, 2023, that demonstration had evolved to represent a wider (and growing) array of concerns, many of which arose in response to [Reddit’s statements to journalists](https://www.washingtonpost.com/technology/2023/06/16/reddit-ceo-blackout-moderators-steve-huffman/). Today (June 26th, 2023), we are hopeful that users and administrators alike can make a return to the productive dialogue that has served us in the past. \n\nWe acknowledge that Reddit has placed itself in a situation that makes adjusting its current API roadmap impossible. \n\nHowever, we have the following requests:\n\n- Commit to exploring ways by which third-party applications can make an affordable return.\n- Commit to providing moderation tools and [accessibility options](https://www.reddit.com/r/Blind/comments/14ds81l/rblinds_meetings_with_reddit_and_the_current/) (on Old Reddit, New Reddit, and mobile platforms) which match or exceed the functionality and utility of third-party applications.\n- Commit to prioritizing a significant reduction in spam, misinformation, bigotry, and illegal content on Reddit.\n- Guarantee that any future developments which may impact moderators, contributors, or stakeholders will be announced no less than one fiscal quarter before they are scheduled to go into effect.\n- Work together with longstanding moderators to establish a reasonable roadmap and deadline for accomplishing all of the above.\n- Affirm that efforts meant to keep Reddit accountable to its commitments and deadlines will hereafter not be met with insults, threats, removals, or hostility.\n- Publicly affirm all of the above by way of updating Reddit’s User Agreement and Reddit’s Moderator Code of Conduct to include reasonable expectations and requirements for administrators’ behavior. \n- Implement and fill a senior-level role (with decision-making and policy-shaping power) of \"Moderator Advocate\" at Reddit, with a required qualification for the position being robust experience as a volunteer Reddit moderator.\n\nReddit is unique amongst social-media sites in that its lifeblood – its multitude of moderators and contributors – consists entirely of volunteers. We populate and curate the platform’s many communities, thereby providing a welcoming and engaging environment for all of its visitors. We receive little in the way of thanks for these efforts, but we frequently endure abuse, threats, attacks, and exposure to truly reprehensible media. Historically, we have trusted that Reddit’s administrators have the best interests of the platform and its users (be they moderators, contributors, participants, or lurkers) at heart; that while Reddit may be a for-profit company, it nonetheless recognizes and appreciates the value that Redditors provide. \n\nThat trust has been all but entirely eroded… but we hope that together, we can begin to rebuild it.\n\nIn simplest terms, Reddit, we implore you: **Remember the human**. \n\nWe look forward to your response by Thursday, June 29th, 2023.\n\nThere’s also just [one other thing](https://i.imgur.com/xLmTxcR.jpg).",
        "num_comments": 1,
        "comments": []
    },
    "] REMINDER] ANY political content will earn an immediate 30-day ban\"": {
        "title": "] REMINDER] ANY political content will earn an immediate 30-day ban\"",
        "score": 699,
        "url": "https://www.reddit.com/r/funny/comments/160kuuf/reminder_any_political_content_will_earn_an/",
        "content": "",
        "num_comments": 1,
        "comments": [
            "---      \n>✨⭐ **Don't miss [our 50-million-subscriber-mark celebration](https://www.reddit.com/r/funny/comments/14eg7k5/to_celebrate_reaching_50000000_subscribers_rfunny/)!** ⭐✨\n>\n>This is a friendly reminder to [read our rules](https://www.reddit.com/r/funny/wiki/rules). \n>\n>Memes, social media, hate-speech, and pornography are not allowed. \n>\n>Screenshots of Reddit are expressly forbidden, as are TikTok videos.\n>\n>**Rule-breaking posts may result in bans.**\n>\n>Please also [be wary of spam](https://www.reddit.com/r/funny/wiki/spam).\n>\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/funny) if you have any questions or concerns.*"
        ]
    },
    "The service is good but the waiter seems in a bit of a hurry": {
        "title": "The service is good but the waiter seems in a bit of a hurry",
        "score": 2023,
        "url": "https://v.redd.it/9oyq8fya438d1",
        "content": "",
        "num_comments": 84,
        "comments": [
            "---      \n\n>This is a friendly reminder to [read our rules](https://www.reddit.com/r/funny/wiki/rules). \n>\n>Memes, social media, hate-speech, and pornography are not allowed. \n>\n>Screenshots of Reddit are expressly forbidden, as are TikTok videos.\n>\n>**Rule-breaking posts may result in bans.**\n>\n>Please also [be wary of spam](https://www.reddit.com/r/funny/wiki/spam).\n>\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/funny) if you have any questions or concerns.*",
            "This is how u get that 15years experience when u are 20 years old.",
            "Who would've thought that child labor could be so cute.",
            "I've been to Costco exactly once in my life.  I grabbed a bag of bagels and went to the checkout.  The cashier announced, \"sir, these are buy one get one free\".  Immediately the guy bagging groceries ran off to the other side of the store and ran back with another bag of bagels.  Sadly it was so many bagels they all got moldy three days later before I could eat all of them.",
            "His name must be Gonzales.....",
            "Nice spinoff on bob’s burgers lol",
            "child labor is so cute",
            "Best waiter",
            "O Letting your child help with the restaurant you own - Good idea\n\nX Letting your child help fly your plane - Bad idea",
            "The little hop !"
        ]
    },
    "Be Honest!": {
        "title": "Be Honest!",
        "score": 13983,
        "url": "https://v.redd.it/sb7afts1hz7d1",
        "content": "",
        "num_comments": 792,
        "comments": [
            "---      \n\n>This is a friendly reminder to [read our rules](https://www.reddit.com/r/funny/wiki/rules). \n>\n>Memes, social media, hate-speech, and pornography are not allowed. \n>\n>Screenshots of Reddit are expressly forbidden, as are TikTok videos.\n>\n>**Rule-breaking posts may result in bans.**\n>\n>Please also [be wary of spam](https://www.reddit.com/r/funny/wiki/spam).\n>\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/funny) if you have any questions or concerns.*",
            "When I was a kid I had a friend who would fart in his hand and throw it at people. It worked surprisingly well.\n\nEdit: this comment really blew up. I didn’t realize the flatulence grenade had so many names. Some of my favorites: \n\nScoop and serve,\nThe Dutch hand grenade,\nCup o’ cheese,\nThe boofa,\nScooby snacks,\nNinja dust,\nAir biscuit,\nThe ancient rasengan,\nPalm bomb",
            "This video looks to be in reverse",
            "Only every time I drive my Prius",
            "It's an emergency energy source, sort of like drinking your own urine if you are in the desert.",
            "[removed]",
            "Nope, sadly I can smell my own fart even in a hurricane. Might have digestive problems tho.",
            "My sister fell asleep on the couch in the middle of the day when she was 16 and I was 12. On the way to the bathroom, I saw her sleeping and farted in her face and she didn’t wake up, but me and my other sister thought it was hilarious. Later that day she woke up and told us that she had the craziest dream that she was in this field and then all of a sudden these mud puddles started to appear and smell so so bad. We died laughing and told her. She wasn’t even mad.",
            "Of course everybody loves their own brand",
            "“So what do you do for work?”\n\n“I work in accounting. How about you?”\n\n“I hold up an umbrella for Taylor Swift.”"
        ]
    },
    "A take on psychosexuality [Bilbro Braggins (parody) on X]": {
        "title": "A take on psychosexuality [Bilbro Braggins (parody) on X]",
        "score": 2853,
        "url": "https://v.redd.it/2n1azmeoj08d1",
        "content": "",
        "num_comments": 73,
        "comments": [
            "---      \n\n>This is a friendly reminder to [read our rules](https://www.reddit.com/r/funny/wiki/rules). \n>\n>Memes, social media, hate-speech, and pornography are not allowed. \n>\n>Screenshots of Reddit are expressly forbidden, as are TikTok videos.\n>\n>**Rule-breaking posts may result in bans.**\n>\n>Please also [be wary of spam](https://www.reddit.com/r/funny/wiki/spam).\n>\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/funny) if you have any questions or concerns.*",
            "Oh my god I think I have this disease!",
            "It was a white Jeep compass but pretty spot on lol.",
            "Guys.... I have a problem",
            "“If she’s fucked in the head, she can fuck in the bed” 😂 I love it!",
            "I was told never put it in the crazy…..now I’m reconsidering",
            "The tongue thing😂 wtf was that",
            "My sister’s ex-roommate was in a psychosexual relationship. Whenever the couple had a petty fight, he would drunkenly storm off and ride Chicago’s L, turning his location on and off. The roommate would then make my sister get in her car and frantically follow him to whenever he turned his location on, all while sobbing non-stop. They’d end up chasing him throughout the city. If he didn’t storm off, she would throw things at him and lock herself in her room blaring Taylor swift. My sister moved out as soon as she could. \n\nThey just got engaged. I’m sure it will be an uneventful marriage.",
            "Wow, after all these years I found the name for my ailment. I just thought Becky \"ruin your life\" Lynn was my type I didn't know it was an actual condition!",
            "Did you know that all those guys who warn you to \"never stick your dick in crazy\" are just saying it so they can have the crazy ones for themselves?"
        ]
    }
}