{
    "NEW RULE: NO POLITICAL POSTS": {
        "title": "NEW RULE: NO POLITICAL POSTS",
        "score": 1789,
        "url": "https://www.reddit.com/r/FunnyAnimals/comments/wdf6t9/new_rule_no_political_posts/",
        "content": "Luke here, your friendly neighborhood moderator. I have discussed with the rest of the team the potential banning of all political-related posts and the team has agreed with my proposal.  \n\n\nSo, from now on \\*\\*all political-related posts will be removed and the OP may be permanently banned\\*\\*.\n\n\\*\\*An example of what would be removed:\\*\\*\n\n&#x200B;\n\n[I will smack you in the head with the ban hammer if you post this.](https://preview.redd.it/stjugxud83f91.jpg?width=538&format=pjpg&auto=webp&s=aad1142df8733ea9819ae643b6421bb9e6689606)\n\nI'm not against the cause, my views are not important. I just don't want the subreddit to be filled with political posts, this place is for wholesome/funny content related to our animal friends.",
        "num_comments": 429,
        "comments": [
            "Why is luke SO COOL?",
            "Thank God! Literally everything is so political now that it has literally turned my brain to mush and stomach in knots. Im so sick of it.",
            "This is a good rule !",
            "I mean there's plenty of other places for political posts I just want to see chonky pups",
            "Thank you, there is definitely no need for politics here. We just want to see animals act all cute and funny and shit. Now... if you're team would kindly take over moderating a couple of other subs, that would be just amazing haha.",
            "Great. This is a place to laugh and have a good time after a hard day, politics most of the time poisons people's minds and kills the nice vibes of this sub. There are other hundreds of subs about politics.",
            "Are we allowed to post videos of elephants and donkeys?  \n  I know, I know. Lame. I'll be going now...",
            "Such a good ruling.  We need at least ONE place where we can take a break from all the divisiveness and hyperbolic rhetoric.",
            "I have a very funny Ukrainian hamster. Is he allowed?",
            "KEEP YOUR POLITICS OUT OF MY HECKIN HAPPY FLOOFER ZONE. Thanks! "
        ]
    },
    "NEW MODERATORS NEEDED: IMPROVING THE SUBREDDIT QUALITY": {
        "title": "NEW MODERATORS NEEDED: IMPROVING THE SUBREDDIT QUALITY",
        "score": 40,
        "url": "https://www.reddit.com/r/FunnyAnimals/comments/1c49qv8/new_moderators_needed_improving_the_subreddit/",
        "content": "Recently there has been a surge of reposts/unfunny/just outright low quality submissions that have been made on this subreddit and to help improve the browsing experience for all we need a few extra hands on board to filter through the posts in this community. \n\n[WE NEED YOUR HELP!](https://preview.redd.it/c4fq8soinjuc1.jpg?width=600&format=pjpg&auto=webp&s=0fbef56dab583b32691fc66f5d671c31f01222b1)\n\nTo apply to become a moderator here, please write down an explanation as to why you'd be a great fit for moderation for this subreddit (we welcome small levels of crazy, just not too much). ",
        "num_comments": 24,
        "comments": [
            "I would love to help moderate this sub.  I'm  sure I could be a great moderator for this subreddit, because I'm fairly experienced in moderation  outside of reddit, and would love to gain more experience here.",
            "I wouldn't mind helping out. I love animals!",
            "You need someone with a keen eye for the staged videos too (where behind the scenes animal care is questionable) Get enough of that crap on Facebook. Ideally someone with more than a couple of braincells to rub together unlike most moderators on reddit.",
            "I would LOVE to help with this! I also need somthing to do. ;p I have autism and love animals.",
            "I would love to help out as well. I spend lots of time checking up on subs Im interested in, and I love animals. Im actually considering a wildlife sort of degree in the future so  theres that. This may sound lame but I actually love following rules, as long as they are not stupid. Its more satisfying when you win a game, or make a popular post when playing by the rules. I think its equally important for people to respect and follow rules online, especially since you can say/do just about anything on here. Im always open to communication/direct messages, and I take reports very seriously (as long as they do).\n\nThank you and I hope you consider my proposal.",
            "Cab I present as a moderator, I have experience and I'm very polite when moderating.",
            "Ad me, I already know about half the bot spammers here.",
            "I don't know. Cab you?",
            "Yes I can, sorry, I'm a bit dislexic.",
            "If you can't think of a caption for it, it's probably no good.\n\nI understand people want an excuse to post their pets but it's got to be amusing.\n\nI would run every new account post through a repost search personally.\n\nAnd what's with the lame laughter soundtrack epidemic?"
        ]
    },
    "The same size too": {
        "title": "The same size too",
        "score": 2246,
        "url": "https://v.redd.it/brmnxaqocg9d1",
        "content": "",
        "num_comments": 28,
        "comments": [
            " Your cat secretly owns multiple business ans make 10 figure per year and is chilling with you because, she loves you more than everything. ",
            "Congratulations! You have a standard issue, normal sized, avarge house cat :D",
            "The new spokeskitty for Meow Mix",
            "Patient boy too!\n\nHow neat!",
            "what the fuck is this background music bro just let me hear the video sound",
            "And as literally always: completely unnecessary and unfitting music",
            "Kitty blink twice if you need help",
            "I also have the same cat as yours!",
            "Why does this tickle me so much ",
            "Europeans cats always look a lot similar to me ![gif](emote|free_emotes_pack|thinking_face_hmm)"
        ]
    },
    "He is totally innocent😤": {
        "title": "He is totally innocent😤",
        "score": 2818,
        "url": "https://v.redd.it/08k3xiqr4f9d1",
        "content": "",
        "num_comments": 176,
        "comments": [
            "the dog is ready to face death",
            "Is there an explanation why pets do this? Is this a result of lack of exerting energy? Do they just don't know this isn't good behaviour because they weren't trained? Do their neurons just activate when their owners aren't present and decide to be dicks?",
            "I cant believe somebody broke into your house and destroyed your bed like that. Good thing your dog was there to chase them away and guard the bed until you got home.",
            "Uhmmm, doesn't really seem like a funny animal video to me, this whole thing stressed me out",
            "Dang! He sure did a number on the mattress! Not to mention the remote. \nGuilty face and body language.  What a mess.",
            "The way he just turns belly up and starts wagging his tail like dude read the room, it's not scratchies time.",
            "I love how hard he's trying to wiggle out of this with his charms.",
            "Thats why I dont have pets. Sure they bring joy but also need proper training. Otherwise they will bring anxiety as well like in this video.",
            "At least the remote is saf... Oh.",
            "Obviously, the bed exploded, and doggo is trying to fix it"
        ]
    },
    "Dance like nobody’s watching.": {
        "title": "Dance like nobody’s watching.",
        "score": 484,
        "url": "https://v.redd.it/dkjz6a1urh9d1",
        "content": "",
        "num_comments": 14,
        "comments": [
            "Why does he dance better than me? ",
            "how does he feel the rhythm",
            "He needs to collab with that green parrot",
            "Lost: One pirate. Appx 59 with long blond beard and longer hair. Bathes once a year. Probably drunk. Says arrr a lot. If found, contact white parrot in the dancing area. Birdseed reward$$$!",
            "Such a beautiful little bird!",
            "Boss Bird doing what he does... Lol",
            "HES SO CUTEEE",
            "That's cool",
            "wow",
            "Rio 3: Japan"
        ]
    }
}