{
    "T-shirts are not memes. Report any post of people showing off t-shirts they claim they received recently. They're made by art thieves.": {
        "title": "T-shirts are not memes. Report any post of people showing off t-shirts they claim they received recently. They're made by art thieves.",
        "score": 224,
        "url": "https://i.redd.it/fij22ccece3c1.jpg",
        "content": "",
        "num_comments": 3,
        "comments": []
    },
    "You don't need gas when you have family😂": {
        "title": "You don't need gas when you have family😂",
        "score": 2958,
        "url": "https://i.redd.it/hguo56b6ji6d1.jpeg",
        "content": "",
        "num_comments": 61,
        "comments": [
            "No one ever needs to pee either",
            "They always talking about family but they ditch their wife and kids as soon as they hear a v8 drive up.",
            "They did steal an 18 wheeler of gas.",
            "Never blew a tire or got a flat at all",
            "When did Fast in Furious go to stealing DVD players to saving the world and into space?",
            "Fast and furious is the only movie that they drive cars in.",
            "Every time the gas runs out, they change the car.",
            "They only live there lives a quarter mile at a time.",
            "They shift something like 20 times in a Supra in a drag race so what were you expecting?",
            "The thing that annoys me most is how they just talk normally to each other as if they're all in the same room.  No fumbling through BluTooth menus.  No repeating the same voice commands over and over.  It's like they're all in a never-ending Zoom meeting with their phones on speaker mode.  \n  \nSo if they *did* stop to refuel, it would be preceded with a fifteen minute conversation about which gas station had the lowest prices, with one of the central arguments being whether or not to go *into* the Sam's Club store and if so, should it be after using their gas station or before."
        ]
    },
    "Just marriage things": {
        "title": "Just marriage things",
        "score": 10945,
        "url": "https://i.redd.it/rrq18vg0dh9d1.jpeg",
        "content": "",
        "num_comments": 493,
        "comments": [
            "I was a circus performer and juggling help me manage my asd/adhd, my marriage was falling apart and my wife demands I train less, tour less, and make more money. She actually convinced me I was the problem.",
            "Why are you out earning us millions and millions of dollars in a job that doesnt risk your life, that youve practiced to do since you were a child and long before you met me that you have become one of the best in the planet at, Why Rory? Why do you do that?",
            "Women get married thinking he will change. Men get married hoping she won't change.",
            "Couples do that all the time. \n\n\"Hey, you know that thing I already knew about you before we got married? Change it or else!\"",
            "She might have seen that coming.",
            "he's a golfer. what is he supposed to do?",
            "Turns out it takes a lot of time to stay competitive, who knew?",
            "The grass is greener on the other side,  right?",
            "Her: \"Where are you?  Are you golfing again?\"\n\nHim:  \"Honey, it's The Open Championahip!!!\"",
            "More like  \"Your golfing hasn't been worth sh*t lately man what the f*ck\"\n\nWhich, like, aight wife chill you're supposed to love him for himself"
        ]
    },
    "🤌": {
        "title": "🤌",
        "score": 1018,
        "url": "https://i.redd.it/67hl0qaege9d1.jpeg",
        "content": "",
        "num_comments": 179,
        "comments": [
            "As a bleeding heart liberal who respects and understands the trans issue, I always thought this was fucking stupid and this hurts the cause.",
            "If I was a woman swimmer Id be pissed",
            "That is just pathetic. Idk why would people allow it. Can't they have their own category? It is interesting than no trans would go to men's league.",
            "Noted.. Removing 4 letters from your name makes you faster..",
            "according to feminists and lgbt community this is just fine and moral enough to 'be socially acceptable'",
            "Something tells me this post will get locked soon",
            "Yeah, because there's no way this guy would identify as trans and then compete with women so he could place first, that's not possible. I think people are underestimating the fragility of some peoples egos. And yeah , he's still a dude. Waiting for the shower of downvotes and offended people. Bring it on.",
            "Makes me think of Futurama",
            "This is celebrating mediocre idiots",
            "She isnt ranked 1 and never was. She won a competition and her minimum rank shown on the meme was when she had started transitioning. Biased as hell meme"
        ]
    },
    "Girls in a nutshell": {
        "title": "Girls in a nutshell",
        "score": 830,
        "url": "https://i.redd.it/np0jczpwgh9d1.jpeg",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Say anything in this post to her and you could have 0 ",
            "Take her phone away and you could have up to 15",
            "James Franco and Henry Cavill but who is Xavier?",
            "Take away her hair dresser you could have 20",
            "The rule is: single-attractive-sane; you get to pick 2",
            "If she's guy before, you got another contender",
            "Sometimes its better to keep your mouth shut.\n\nThis is one of them fellas.",
            "Redditors in natural habitat deconstructing a female species ",
            "Could? Safe bet I reckon",
            "Or maybe a black eye and a single life."
        ]
    }
}