{
    "Is it a scam? Yes, yes it is.": {
        "title": "Is it a scam? Yes, yes it is.",
        "score": 877,
        "url": "https://www.reddit.com/r/furry/comments/1bw3om8/is_it_a_scam_yes_yes_it_is/",
        "content": "**==Art Commissions==**  \nIf an account sends you a private message or chat request and they ask you to purchase an art commission from them, it is 99.99% of the time a scammer.  You'll either receive nothing or a badly generated image that looks nothing like your character.  \n\nActual artists will NEVER randomly message people and ask them to buy commissions.  Artists want to reach out to as many people as possible, which is why they'll post announcements that they're taking commissions.  The only reason to randomly message people is to hide your activity from those who can stop it.  \n\nIf you get these messages, report the messages and the account as spam and let us know their username so we can ban them.  \n\n**==Fursuits==**  \nDid you find a fursuit on a website like Etsy, Aliexpress or Amazon for dirt cheap?  That's a scam.  The pictures you're looking at are of someone else's fursuit.  With these websites, you'll either receive nothing or a cheaply and badly made copy of someone else's suit.  \n\n**==Things to Look Out For==**  \n* Scammers will typically try to pressure you by creating a sense of urgency, such as by offering steep discounts or claiming to have an emergency.  \n* Some people make posts looking for artists and fursuits makers.  You have to be careful if you do that because these same scammers use bots to search for these posts to leave ads on.  You can sus them out by looking at their profile and seeing that all they do is post ads in subreddits for tattoos, 3D modeling, mod making, website design and more.",
        "num_comments": 109,
        "comments": [
            "Amusingly enough I have someone offering an art commission in my DMs right now.",
            "Ok and also I see that the art style is the exact same like it always looks weirdly shaded I always found it weird and I've gotten like 10 of these already probably more",
            "One time, I had a person that I thought was a real artist (because I didnt know any better) follow me on Twitter, so I followed them back. Within two hours, they were pressuring me hard to buy a piece from them. I was kinda suspicious, because their art style was super inconsistent and pretty mid. What broke me was when they quoted me *$200* for a custom character, whatever the hell thats supposed to mean. Ive gotten far better art for *$30* and Ive seen similarly better art quoted for even less. I am now much, much more wary of who I follow back",
            "I LOVE messing with these guys.\n\nI like to drag the process as long as possible while making them think I'm interested, I'll even make fake payment screenshots to confuse em further. It's a blast",
            "I've had people like that message me on Twitter. It's super annoying.",
            "Back in my days (2 months ago) they still used (presumably) free, watermarked progress reports, none of them matching in art style LOL\n\nAs pathetic as it was they were at LEAST still putting some infinnitesimal amount of effort into it",
            "I am so sick of these types of scammers ._.",
            "Ah yes, \"artists\" who love your OC (always \"OC\", never \"fursona\") enough to message you asking if they could do art of it, but not enough to do art of it without receiving payment from you beforehand.",
            "I've gotten so many of these on Reddit I could probably report then with my eyes closed. Please just report them and block them if you get a random DM like this.",
            "not furry related but a girl that followed me sent me my own insta post and praised how i looked and begged to use MY FACE in a commission for a stranger?! when i politely declined she got so mad (she insisted on it being free aswell but nah man.)"
        ]
    },
    "Wulfk's Sis is challenging you": {
        "title": "Wulfk's Sis is challenging you",
        "score": 130,
        "url": "https://i.redd.it/gmltkoebdh9d1.jpeg",
        "content": "Wulfk's Sis is inviting u for a ride or she's challenging your ride\nhttps://linktr.ee/rickwulfk95\n",
        "num_comments": 7,
        "comments": [
            "If we are doing a drag race or going off road, I am screwed",
            "I wouldn't mind going for a ride with her. She seems like she would have some fun stories to tell.",
            "I Forgot to note in the description the car model, an Abarth ES031, a monster able to reach more than 300km/h",
            "That mean, you'll get a ride xD",
            "I must warn you: I'm dangerous on the road. \n\n\n\n  \nI don't know how to drive...",
            "Wanna see me race to that finish line and back?\nYou wanna see me do it again?\n\n\n\nhttps://youtu.be/VE-Q9s8iyeU?si=ggHZlsPtzKAPtW4E"
        ]
    },
    "Is the Furry Fandom Really Made Up of LGBT People, or Is This Just a Stereotype?": {
        "title": "Is the Furry Fandom Really Made Up of LGBT People, or Is This Just a Stereotype?",
        "score": 524,
        "url": "https://www.reddit.com/r/furry/comments/1dr03zw/is_the_furry_fandom_really_made_up_of_lgbt_people/",
        "content": "Since I entered the furry fandom and the discovery of my homosexuality, I see that the vast majority of people in the furry fandom are considered within the LGBT spectrum (be it lesbian, gay, bisexual, pansexual, etc.), however, I saw in some sources that this would be a false stereotype and that a large part of the fandom would be heterosexual. I'm new to the fandom (I joined in 2017, at 15\\\\16 years old) and I wanted answers from people who have been in the fandom for longer.",
        "num_comments": 153,
        "comments": [
            "The majority of the fandom is definitely queer but that doesnt mean there are no het people in it",
            "Ive met like two straight people so Id say yeah theres truth to it",
            "There are straight people in the fandom but they do make up a minority",
            "Furscience did a survey and about 80% of respondents identified as something other than heterosexual. So only 20% of the fandom labels themselves as straight",
            "The fandom is like 75-80% some flavor of queer.",
            "New to the fandom?? You've been here for 7 years... ",
            "the furry fandom has a predominently lgbt history. It draws in us lgbt people. Im sure there's lots of reasons for it. But yeah heteros are a minority in the fandom. I think i've only met like 3 actually straight furries",
            "It's not a false stereotype, polls have shown that about 70% western of the fandom is non-heterosexual. I'm not sure about other parts of the world though.",
            "While not entirely LGBT+, we definitely lean a lot more then way than most large groups. I think it gets exaggerated and we became known as a group you have to be gay or something to be part of, but there's truth in us being a lot more likely to be LGBT+ then the background population. We're also very accepting of these kinds of people so even our cishet folk seem queer.\n\nI also only really know of 1 cishet person personally, but that might just be because I prefer LGBT+ company.",
            "There's definitely some truth to it, but I think most cool people are either LGBT or Allys  so perhaps that's why "
        ]
    },
    "What did you say to make us mad?": {
        "title": "What did you say to make us mad?",
        "score": 755,
        "url": "https://i.redd.it/jeooh73cfe9d1.jpeg",
        "content": "",
        "num_comments": 68,
        "comments": [
            "Coke and Pepsi taste the same.",
            "\"nice face! Where'd you get it? The.... Face... Store?\" (NAILED IT THEY SUSPECT NOTHING!!)",
            "I yelled \"I'ma bite you\" and ran away",
            "I said nothing. I don't want you to be mad. ",
            "\"God made Abraham, and God made animals\"\n\nOr something of the sort.",
            "I'm sorry, I just got too excited!! I forgot to ask before hugging!! :(",
            "I told them we were out of graham crackers for smores",
            "I put ketchup on cosmic brownies",
            "Ill give you $20 if you get mad right now",
            "\"pineapple on pizza is a good idea\""
        ]
    },
    "Doodlepage commission I drew for Lince! 🛸✨": {
        "title": "Doodlepage commission I drew for Lince! 🛸✨",
        "score": 82,
        "url": "https://i.redd.it/hr8dy5dysh9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Such adorable pictures. What kind of animal is your friend?",
            "Oh he is an allosaurus! :>",
            "[main post!](https://x.com/kazunekomori/status/1806490195438559344) Have a nice weekend c:"
        ]
    }
}