{
    "Is it a scam? Yes, yes it is.": {
        "title": "Is it a scam? Yes, yes it is.",
        "score": 877,
        "url": "https://www.reddit.com/r/furry/comments/1bw3om8/is_it_a_scam_yes_yes_it_is/",
        "content": "**==Art Commissions==**  \nIf an account sends you a private message or chat request and they ask you to purchase an art commission from them, it is 99.99% of the time a scammer.  You'll either receive nothing or a badly generated image that looks nothing like your character.  \n\nActual artists will NEVER randomly message people and ask them to buy commissions.  Artists want to reach out to as many people as possible, which is why they'll post announcements that they're taking commissions.  The only reason to randomly message people is to hide your activity from those who can stop it.  \n\nIf you get these messages, report the messages and the account as spam and let us know their username so we can ban them.  \n\n**==Fursuits==**  \nDid you find a fursuit on a website like Etsy, Aliexpress or Amazon for dirt cheap?  That's a scam.  The pictures you're looking at are of someone else's fursuit.  With these websites, you'll either receive nothing or a cheaply and badly made copy of someone else's suit.  \n\n**==Things to Look Out For==**  \n* Scammers will typically try to pressure you by creating a sense of urgency, such as by offering steep discounts or claiming to have an emergency.  \n* Some people make posts looking for artists and fursuits makers.  You have to be careful if you do that because these same scammers use bots to search for these posts to leave ads on.  You can sus them out by looking at their profile and seeing that all they do is post ads in subreddits for tattoos, 3D modeling, mod making, website design and more.",
        "num_comments": 109,
        "comments": [
            "Amusingly enough I have someone offering an art commission in my DM’s right now.",
            "Ok and also I see that the art style is the exact same like it always looks weirdly shaded I always found it weird and I've gotten like 10 of these already probably more",
            "One time, I had a person that I thought was a real artist (because I didn’t know any better) follow me on Twitter, so I followed them back. Within two hours, they were pressuring me hard to buy a piece from them. I was kinda suspicious, because their art style was super inconsistent and pretty mid. What broke me was when they quoted me *$200* for a “custom character”, whatever the hell that’s supposed to mean. I’ve gotten far better art for *$30* and I’ve seen similarly better art quoted for even less. I am now much, much more wary of who I follow back",
            "I LOVE messing with these guys.\n\nI like to drag the process as long as possible while making them think I'm interested, I'll even make fake payment screenshots to confuse em further. It's a blast",
            "I've had people like that message me on Twitter. It's super annoying.",
            "I get this with vrchat avatar commissions. Usually on discord,  it's people who both friends me and message request me,  and always as something like \"do you know for Vrchat, avatars or models? \", always with broken English,  always the same script. \n\nBe safe out there y'all",
            "Back in my days (2 months ago) they still used (presumably) free, watermarked progress reports, none of them matching in art style LOL\n\nAs pathetic as it was they were at LEAST still putting some infinnitesimal amount of effort into it",
            "I am so sick of these types of scammers ._.",
            "Ah yes, \"artists\" who love your OC (always \"OC\", never \"fursona\") enough to message you asking if they could do art of it, but not enough to do art of it without receiving payment from you beforehand.",
            "I've gotten so many of these on Reddit I could probably report then with my eyes closed. Please just report them and block them if you get a random DM like this."
        ]
    },
    "What did you say to make us mad?": {
        "title": "What did you say to make us mad?",
        "score": 486,
        "url": "https://i.redd.it/jeooh73cfe9d1.jpeg",
        "content": "",
        "num_comments": 44,
        "comments": [
            "Coke and Pepsi taste the same.",
            "I yelled \"I'ma bite you\" and ran away",
            "\"nice face! Where'd you get it? The.... Face... Store?\" (NAILED IT THEY SUSPECT NOTHING!!)",
            "\"Awww look, how cute.\"",
            "I said nothing. I don't want you to be mad. 😁",
            "\"God made Abraham, and God made animals\"\n\nOr something of the sort.",
            "boop",
            "I'm sorry, I just got too excited!! I forgot to ask before hugging!! :(",
            "I told them we were out of graham crackers for s’mores",
            "Called you cute! ^^"
        ]
    },
    "Is the Furry Fandom Really Made Up of LGBT People, or Is This Just a Stereotype?": {
        "title": "Is the Furry Fandom Really Made Up of LGBT People, or Is This Just a Stereotype?",
        "score": 272,
        "url": "https://www.reddit.com/r/furry/comments/1dr03zw/is_the_furry_fandom_really_made_up_of_lgbt_people/",
        "content": "Since I entered the furry fandom and the discovery of my homosexuality, I see that the vast majority of people in the furry fandom are considered within the LGBT spectrum (be it lesbian, gay, bisexual, pansexual, etc.), however, I saw in some sources that this would be a false stereotype and that a large part of the fandom would be heterosexual. I'm new to the fandom (I joined in 2017, at 15\\\\16 years old) and I wanted answers from people who have been in the fandom for longer.",
        "num_comments": 98,
        "comments": [
            "The majority of the fandom is definitely queer but that doesn’t mean there are no het people in it",
            "I’ve met like two straight people so… I’d say yeah there’s truth to it",
            "There are straight people in the fandom but they do make up a minority",
            "the furry fandom has a predominently lgbt history. It draws in us lgbt people. Im sure there's lots of reasons for it. But yeah heteros are a minority in the fandom. I think i've only met like 3 actually straight furries",
            "The fandom is like 75-80% some flavor of queer.",
            "Furscience did a survey and about 80% of respondents identified as something other than heterosexual. So only 20% of the fandom labels themselves as straight",
            "New to the fandom?? You've been here for 7 years... 😂",
            "Yeah from my experience the majority of furries are LGBTQ+. This is probably the most welcoming and accepting fandom for LGBTQ+ ppl, and heteronormativity feels almost non-existent. I've never met another furry who would just assume another furry is straight.",
            "There's definitely some truth to it, but I think most cool people are either LGBT or Allys 😆 so perhaps that's why 😅",
            "It's not a false stereotype, polls have shown that about 70% western of the fandom is non-heterosexual. I'm not sure about other parts of the world though."
        ]
    },
    "Silly gay mini-comic": {
        "title": "Silly gay mini-comic",
        "score": 1990,
        "url": "https://i.redd.it/i6hcfn48hb9d1.png",
        "content": "",
        "num_comments": 32,
        "comments": [
            "Awww ❤️",
            "I need this to be my situation Immediately",
            "Spooky furry boys always turn out to be the best boys!",
            "*smug*",
            "Please tell me there already is a furry comic with this story line",
            "Imagine if this is real",
            "When the scary guy is secretly in love with you",
            "Adorable 🖤",
            "So cute! I like your artstyle :)",
            "Ah…if only that was real life"
        ]
    },
    "Would you hug them? ": {
        "title": "Would you hug them? ",
        "score": 960,
        "url": "https://i.redd.it/1id02g9i5c9d1.png",
        "content": "Art by me [ _Kotas_art_ ] on Instagram ",
        "num_comments": 63,
        "comments": [
            "Yesyesyes",
            "Yes",
            "I would hug th’ smol.  Must protecc!",
            "Of course I would hug them, but I can't unsee open toothy mouths instead of eyes😭",
            "Yeah",
            "For sure, they look cute",
            "no he will bite me",
            "Definitely.",
            "For sure.",
            "*YES!"
        ]
    }
}