{
    "Known Issues EAFC": {
        "title": "Known Issues EAFC",
        "score": 92,
        "url": "https://www.reddit.com/r/fut/comments/16nx2rc/known_issues_eafc/",
        "content": "# -flair:\"Pack Flex\"\nCopy and paste that into the search bar when searching in r/fut and you'll see all posts except for pack flex posts. The same will also apply if you replace pack flex with any other flair name.\n\n\n# **[Check Here For FAQs & Helpful Info](https://www.reddit.com/r/fut/s/70oZ6Zkm70)**\n\n\n\n\n **If you're interested in becoming a mod, send me a message in modmail.** \n\n# **GAMEPLAY**\n\n* usual \n\n\n# **MENU**\n* upgrades for live cards missing. This is EA so nobody knows when they'll go live.\n* visual bugs everywhere\n* the store only shows 30 packs, to see them all use the app\n* can't submit cards into evolutions\n* New loans are expiring after 7 games, you can apply a contract on the webapp to fix the issue until ea fully fix it.\n\n# **WEB & COMPANION APP**\n\n* Player stats of special cards are showing as their base card stats\n* visual bugs everywhere, All round just a buggy mess\n* only shows 50 items at a time, store them to show the next batch\n* not all cards are shown\n* can't submit cards into evolutions\n\n",
        "num_comments": 488,
        "comments": [
            "I am unable to complete the objective \"Build 12 Chemistry\", it won't mark it as complete",
            "Input delay is crazy, lag is crazy",
            "My game keeps freezing in the fut menus i can move in a certain are but can't exit",
            "I don’t know where my evolutions Darwin Nunez went",
            "I just straight up can’t get into Ultimate Team. Anyone have similar problems or a solution?",
            "Ultimate edition has reverted to standard edition on PC so now I can't play, Absolute pain in the arse considering the price",
            "I bought ultimate version on pc, locked me out of it after restarting pc, says i cant play till the 29th",
            "So one of the objectives is get 1 star in world tour moments. I ended up getting 2 stars and its not counted. Since I’ve earned the stars I can’t go back and get 1 star but really getting 2 should count no?",
            "[removed]",
            "Completionist's (finish 5 SBCs) set won't count as done, even though I've done like 7 SBCs so far."
        ]
    },
    "FAQ and Beginner Help": {
        "title": "FAQ and Beginner Help",
        "score": 6,
        "url": "https://www.reddit.com/r/fut/comments/19bc27p/faq_and_beginner_help/",
        "content": "Below are some FAQs and some helpful notes for beginners. Feel free to add anything in the comments.\n\n# **FUT CHAMPS** \n\n**1)** You play rivals to earn fut champs points. \n\n\n**2)** You can use those points to gain entry to champ qualies. Here you have 10 games to get 20 points. 4 points for a win and 1 point for a loss so that's 4 wins, winning 4 will reward you with a finals entry token. This can be done at anytime during the week. If the season ends and you havent finished your qualies you'll lose your progress.\n\n\n**3)** On the weekend you can redeem your finals token. Here you have 20 games to get as many wins as possible\n\n\n**4)** once the games are over you repeat the process. Depending on your win bracket you can skip step 1.\n\n\nExtra - You can only enter finals once a week. If you don't use your token you can save it for a future week. \n\n\n# **WHEN TO OPEN PACKS**\n\nOpen when you want, it's all luck, if the current contents of the packs interest you then open them, if not then don't.\n\n\n# **RED EVO**\nThis is purely a cosmetic item. You should choose whoever you want.\n\n# **XP**\nXp is only earnt via objectives or rivals rewards, champs finals and squad battles rewards. Usually towards the end of the season they release more XP. Best way to find out it's to wait. XP can also occasionally be bought via select packs or kits.\n\n# **WHO TO PICK**\nUse something like futbin or futwiz to check a players price, this usually gives a rough idea in who's better. If they're not worth much and none help your squad take the highest rated for fodder. If they're all similarly price take whoever helps your team.\n\n# **HOW PEOPLE GET GOD SQUADS**\nThese recent fifas are very easy. The game throws fodder at you with the season progress. There's also a crazy amount of packs available in rivals, champs, qualies and squad battles aswell as objectives and milestones. We also have plenty of sbcs to get more packs, fodder and players\n\n# **WHERE IS COMPENSATION**\nIts EA,  nobody know when they'll release compensation \n\n# **NOT RECEIVING SQUAD BATTLE POINTS** \nCheck the top right and see how many matches you played. You get 32 matches a week, unplayed matches count as played when you refresh. You can still play and earn progress to challenges and objectives but you won't receive any squad battle points until the refresh\n\n# **SEASON 7 LADDER PLAYERS** \nThese are the players from the season progress.\n\n# **NEW LOAN TYPE** \nThese new loans are based of time and not games. They will expire once the Euros is over. Currently they are bugged and inly last 7 games but that will be fixed(applying contracts on the app seems to be a workaround)",
        "num_comments": 18,
        "comments": [
            "Side note.. \n\ncan only enter WL once per weekend .. \n\nYes everyone had glitchy gameplay.. \n\nW or L posts are annoying.. \n\nMost of what you ask has been previously asked on here, use the search bar",
            "EA didn't give anything last day before completing season XP i need 1700xp to complete it, time left 1day3hours",
            "Does anyone know why the fut founders evolution isn’t available to me?",
            "Anybody willing to do the Nike mad ready thing with me?",
            "Is there anyone that plays friendlies? I have searched for a week and can never find anyone. I just want to finish the founders objectives. If anyone is in Japan and willing to assist ill take it. DM and ill add you, im on PS5.",
            "Thanks, I've added some extra wl notes.\n\nYeah the spam last night was crazy, it was close to forcing the sub to temp lock since nobody knew about the search bar or either pinned post.\n\nI remove the posts asking obvious questions like if a toty is a w or l. Feel free to report any you see like that and I'll remove them.\n\nYeah people need to use the search bar more",
            "They have released plenty of xp to complete the season. The nwsl objectives also contained alot of xp at the end of the season.",
            "When did you start?",
            "what nike mad thing? I just got the kits yesterday.",
            "Done all daily obj and fantasy still need 1700xp"
        ]
    },
    "Dude hasn’t seen the sun in months": {
        "title": "Dude hasn’t seen the sun in months",
        "score": 317,
        "url": "https://i.redd.it/wodz52vnj08d1.jpeg",
        "content": "Just seen in objs. Touch grass fc ",
        "num_comments": 85,
        "comments": [
            "NUNO, ENZO, FEKIR, CLAUSS, BERNARDO SILVA?! HOW",
            "Doing them all is nuts. I have no interest in playing with an Argentine squad for Mendes when there’s plenty of good LBs on offer. Did Enzo as a Chelsea fan but that’s it for me",
            "I mean cool he has the rarer objectives but I have a way better team.",
            "Honestly people will talk about toxicity in this community, but not a single person has told you that this is a pathetic post to make. Someone’s getting their money worth, leave it at that instead of making a childish post about it",
            "respect…but sad..",
            "How do u get the preview of the opponents team",
            "As most EA FC players",
            "I would have backed up coming up to this guy lol u can tell he. Try’s too hard",
            "Time spent well 🤣🤣🤣",
            "How is Bonucci on full chem?"
        ]
    },
    "Played FUT 23 for the first time since last year.": {
        "title": "Played FUT 23 for the first time since last year.",
        "score": 59,
        "url": "https://i.redd.it/nhici6vom28d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Do they still update store packs? Just wondering the effort they go to to maintain it.",
            "Man I miss it. This year the game is so shit",
            "Seeing those level ups give me squad battles PTSD",
            "https://preview.redd.it/0hozllouj48d1.jpeg?width=2495&format=pjpg&auto=webp&s=eece97266dcfe6a34dd7e79cef7818db5a2ce9c4\n\ndamn bro i miss it",
            "Man it isn't worth it you'll probably get a game every 3-5 minutes correct me if im wrong \nBut because everyone fell for the same trick every year only a few people stayed at fifa 23",
            "It’s just the normal game cards:Gold,silver and bronze cards.",
            "Usually I’d say people say the same thing every year but I feel with this game - there has been far more garbage than any other fifa.",
            "The game is shit every year. Last year was just less shit.",
            "There are so much more mechanics this year. The casuals who don’t have time to practice just get smoked everytime",
            "Actually i played like 2 weeks ago and surprisingly there were lots of games. But trash teams tho lmao"
        ]
    },
    "Who do you pick?": {
        "title": "Who do you pick?",
        "score": 52,
        "url": "https://i.redd.it/20bx2cc7u28d1.jpeg",
        "content": "",
        "num_comments": 29,
        "comments": [
            "I got martinelli and sadly he is nothing Special. Maybe the Upgrades will help him. Havent played the new garnacho but even the tots hm is imo better than this martinelli Card.",
            "Have both, packed Martinelli 2 squads into Garnacho, I have to say Garnacho is more present in the games I've played with him, dribbling feels a little more controlled with the finesse shots outside the box being more prominent also.",
            "Right now Garnacho but i think Martinelli will overtake him after upgrades.",
            "I did Garnacho and he’s honestly a beast for me",
            "Garnacho all the way, almost broken",
            "Martinelli my king the one and only love of my life. He’s the hero I always needed. He stays in my team at all times",
            "What about Nunez?",
            "Is it worth doing garnacho if you have martinelli",
            "Garnacho for sure",
            "Garnacho without a shadow of doubt."
        ]
    }
}