{
    "Known Issues EAFC": {
        "title": "Known Issues EAFC",
        "score": 90,
        "url": "https://www.reddit.com/r/fut/comments/16nx2rc/known_issues_eafc/",
        "content": "# -flair:\"Pack Flex\"\nCopy and paste that into the search bar when searching in r/fut and you'll see all posts except for pack flex posts. The same will also apply if you replace pack flex with any other flair name.\n\n\n# **[Check Here For FAQs & Helpful Info](https://www.reddit.com/r/fut/s/70oZ6Zkm70)**\n\n\n\n\n **If you're interested in becoming a mod, send me a message in modmail.** \n\n# **GAMEPLAY**\n\n* usual \n\n\n# **MENU**\n* upgrades for live cards missing. This is EA so nobody knows when they'll go live.\n* visual bugs everywhere\n* the store only shows 30 packs, to see them all use the app\n* can't submit cards into evolutions\n* New loans are expiring after 7 games, you can apply a contract on the webapp to fix the issue until ea fully fix it.\n* Making a card with a chem boost red will remove the Chem boost \n\n# **WEB & COMPANION APP**\n\n* Player stats of special cards are showing as their base card stats\n* visual bugs everywhere, All round just a buggy mess\n* only shows 50 items at a time, store them to show the next batch\n* not all cards are shown\n* can't submit cards into evolutions\n\n",
        "num_comments": 488,
        "comments": [
            "I am unable to complete the objective \"Build 12 Chemistry\", it won't mark it as complete",
            "Input delay is crazy, lag is crazy",
            "My game keeps freezing in the fut menus i can move in a certain are but can't exit",
            "I dont know where my evolutions Darwin Nunez went",
            "I just straight up cant get into Ultimate Team. Anyone have similar problems or a solution?",
            "Ultimate edition has reverted to standard edition on PC so now I can't play, Absolute pain in the arse considering the price",
            "I bought ultimate version on pc, locked me out of it after restarting pc, says i cant play till the 29th",
            "So one of the objectives is get 1 star in world tour moments. I ended up getting 2 stars and its not counted. Since Ive earned the stars I cant go back and get 1 star but really getting 2 should count no?",
            "Completionist's (finish 5 SBCs) set won't count as done, even though I've done like 7 SBCs so far.",
            "Its literally not letting me into FUT. says I cant access it at the moment"
        ]
    },
    "FAQ and Beginner Help": {
        "title": "FAQ and Beginner Help",
        "score": 5,
        "url": "https://www.reddit.com/r/fut/comments/19bc27p/faq_and_beginner_help/",
        "content": "Below are some FAQs and some helpful notes for beginners. Feel free to add anything in the comments.\n\n# **FUT CHAMPS** \n\n**1)** You play rivals to earn fut champs points. \n\n\n**2)** You can use those points to gain entry to champ qualies. Here you have 10 games to get 20 points. 4 points for a win and 1 point for a loss so that's 4 wins, winning 4 will reward you with a finals entry token. This can be done at anytime during the week. If the season ends and you havent finished your qualies you'll lose your progress.\n\n\n**3)** On the weekend you can redeem your finals token. Here you have 20 games to get as many wins as possible\n\n\n**4)** once the games are over you repeat the process. Depending on your win bracket you can skip step 1.\n\n\nExtra - You can only enter finals once a week. If you don't use your token you can save it for a future week. \n\n\n# **WHEN TO OPEN PACKS**\n\nOpen when you want, it's all luck, if the current contents of the packs interest you then open them, if not then don't.\n\n# **XP**\nXp is only earnt via objectives or rivals rewards, champs finals and squad battles rewards. Usually towards the end of the season they release more XP. Best way to find out it's to wait. XP can also occasionally be bought via select packs or kits.\n\n# **WHO TO PICK**\nUse something like futbin or futwiz to check a players price, this usually gives a rough idea in who's better. If they're not worth much and none help your squad take the highest rated for fodder. If they're all similarly price take whoever helps your team.\n\n# **HOW PEOPLE GET GOD SQUADS**\nThese recent fifas are very easy. The game throws fodder at you with the season progress. There's also a crazy amount of packs available in rivals, champs, qualies and squad battles aswell as objectives and milestones. We also have plenty of sbcs to get more packs, fodder and players\n\n# **WHERE IS COMPENSATION**\nIts EA,  nobody know when they'll release compensation \n\n# **NOT RECEIVING SQUAD BATTLE POINTS** \nCheck the top right and see how many matches you played. You get 32 matches a week, unplayed matches count as played when you refresh. You can still play and earn progress to challenges and objectives but you won't receive any squad battle points until the refresh\n\n# **SEASON 7 LADDER PLAYERS** \nThese are the players from the season progress.\n\n# **NEW LOAN TYPE** \nThese new loans are based of time and not games. They will expire once the Euros is over. Currently they are bugged and inly last 7 games but that will be fixed(applying contracts on the app seems to be a workaround)\n\n#**STARTING 11 VS FULL SQUAD**\nIf an objective says full squad then that means your full squad, so starting 11 and subs. If an objective says starting 11 then it's only the starting 11 you need.\n\n#**MAKING A CARD RED**\nPurely a cosmetic change so use who you like. Keep in mind any card with a chem boost (such as radioactive or MYM cards) will lose their boost",
        "num_comments": 18,
        "comments": [
            "EA didn't give anything last day before completing season XP i need 1700xp to complete it, time left 1day3hours",
            "Does anyone know why the fut founders evolution isnt available to me?",
            "Anybody willing to do the Nike mad ready thing with me?",
            "Is there anyone that plays friendlies? I have searched for a week and can never find anyone. I just want to finish the founders objectives. If anyone is in Japan and willing to assist ill take it. DM and ill add you, im on PS5.",
            "They have released plenty of xp to complete the season. The nwsl objectives also contained alot of xp at the end of the season.",
            "what nike mad thing? I just got the kits yesterday.",
            "Done all daily obj and fantasy still need 1700xp",
            "Only bought the game today but I had accessed the web app since day 1",
            "Then excluding tonight's release, there's nothing more you can do",
            "Think you needed to log into the game to claim it"
        ]
    },
    "Naaa man,I refuse to believe this 😄": {
        "title": "Naaa man,I refuse to believe this 😄",
        "score": 90,
        "url": "https://i.redd.it/b989a9ln8h9d1.jpeg",
        "content": "",
        "num_comments": 19,
        "comments": [
            "Imagine paying $100 for a game that revolves around microtransactions only to get hit with ads everytime you play a game lol. This company is such dogshit",
            "You thought they couldn't make it any worse. My mind is blown by how much of a joke EA is.",
            "People need to actually start boycotting this shit and not blindly buying the game every year",
            "We have already advertising in boards by the pitch, in some kits, in volta and in other places and that doesn't bother me. Just use it wisely, not like that fatigue stat on the pitch that sometimes hides the ball for a couple seconds.",
            "They ALREADY have \"Ads\" in the game- Amazon Prime anyone? They're just not videos.\n\nI can't think of many other companies that treat it's customer base like this.",
            "There are already tons of ads during the game on the boards around the pitch. Scum.",
            "Ok, but make the game free of charge, not 80",
            "Yet people are going to still purchase it",
            "Why don't they.. put the ads.. on the advertisements boards in game.. and then it actually makes sense.",
            "They do this, I'm out! Will be the first fifa I've not bought since the vet start. Bye EA"
        ]
    },
    "Do your 82+ picks guys": {
        "title": "Do your 82+ picks guys",
        "score": 257,
        "url": "https://i.redd.it/p20xd6jmwe9d1.jpeg",
        "content": "",
        "num_comments": 87,
        "comments": [
            "That dynamic image is so fire",
            "This guy is beyond a joke to play against. Literally walks through a team and scores from anywhere on the field",
            "Did 50 82+ pp and got 2 trezeguets ",
            "Love it . Lost 800k in the casino today boys. 2 400k packs and got Campos. RIP ",
            "Francescoli for me, I will stay in my lane",
            "Am I the only one who doesnt get Dinho ",
            "Did 320 pps, opened 12 84x10, 2 85x2, etc. around 70 packs in total since yesterday  and havent seen a single promo card.",
            "I got Roberto Carlos, the Brazil game today will count for upgrades right?",
            "There is no fucking way",
            "Pulled Trezeguet on my first try omg"
        ]
    },
    "Who would you pick?": {
        "title": "Who would you pick?",
        "score": 52,
        "url": "https://i.redd.it/icjdgzyj8h9d1.jpeg",
        "content": "Who do i pick?",
        "num_comments": 31,
        "comments": [
            "Bro come open some packs for me\nHenry all day",
            "Im Bulgarian so I would go with Stoichkov but probably the safe bet is Henry",
            "First I'd prob turn the screen around so I'm not confused or don't break my neck. \n\nThen pick Thierry.",
            "Have the other version of Henry. Is a beast. Take him.",
            "Reddit users will do anything but screenshot",
            "I've got both. Haven't had time to try out Stoichkov yet but Henry is class.",
            "Henry is a no brainer. I had Blanc, he was good for weeks but he is really under the power curve now.",
            "Henry no doubt, stoichkov is an incredible striker, but there are better cards than him for less than 200k",
            "The answer is Henry. It just is.",
            "I got henry from mine as well."
        ]
    }
}