{
    "[WEEKLY MEGATHREAD] Game Questions, Recommendations, and Everything Else": {
        "title": "[WEEKLY MEGATHREAD] Game Questions, Recommendations, and Everything Else",
        "score": 0,
        "url": "https://www.reddit.com/r/gachagaming/comments/1dq60is/weekly_megathread_game_questions_recommendations/",
        "content": "This thread is the place to post any questions or random thoughts that you may have for the community. We have an army of veteran summoners who are happy to share their opinions and recommendations. Whether you are new to the genre or a grizzled veteran, you can use this thread to ask for: \n\n* Help choosing which gacha game to start \n* Recommendations on using different emulators \n* Recommendations on finding a new gacha game to play \n* Help remembering the name of an old gacha game  \n* Updates on how games are doing from current players (“How is \\[game\\] these days?”) \n* Any sort of advice relating to gacha games at all \n\nThis is also the place to ask general questions, like  \n\n* What people’s favorite games or types of games are \n* How do people feel about a particular game feature or event \n* How do people feel about the monetization in whatever game \n* What do abbreviations mean \n* Where people get their news / information \n* What are people’s favorite content creators \n* Even topics that are only indirectly related to gacha gaming, like happenings in the subreddit, international politics, celebrity gossip, etc.  \n\nReally, any post that is just asking a question belongs here.  \n\nYou can feel free to talk about or ask about anything at all in this thread, but just don’t be surprised if your off-topic question is downvoted and you get no answers. If you are looking for game-specific help, you may ask for it here, but you are more likely to get better answers by posing those questions in their game-specific subreddits.  \n\nIf you want to contribute, please read the request thoroughly, and then make sure not to recommend something that they already tried. Please reply without bashing games or arguing with other recommenders – this is not a win-lose thing. Helpful replies should include the full names of anything. Keep in mind that new summoners may not know what “GI” or “FGO” or even “F2P” means, and even if they do then it’s helpful to spell things out so that the results are more searchable.  \n\nRule #1 still applies, so make sure to keep it friendly. Religious and political discussions, personal information, and other such comments will be moderated. Make sure to follow The Reddiquette. With that said, feel free to talk about day-to-day life here and make acquaintance with your friendly gacha gamer neighbors.",
        "num_comments": 41,
        "comments": [
            "What is some turn base game that recently release or have less than 1 year lifetime ? Tried to find some new game and nowadays seem like people mostly talking about action or open-world gacha game which don't really suited me.\n\nEDIT: A game that didn't release but soon or a game only in JP is okay too",
            "Is there anything that approaches similar to Opera Omnia? I haven't touched a gacha since it shut down and I really enjoyed the game.",
            "Looking for a grindy game with lots to do. Currently playing only Nikke which except for the same 10 minute dailys doesn't really offer anything.\nI couldn't really get into HSR and Genshin, not really a fan of open worlds. Several years ago I played Kings Raid, DFFOO and Dragalia Lost. Graphics aren't too important, I really like that kind of bad PS2 era 3D artstyle. Fan service would be nice but isn't a must. Thanks!",
            "Looking for decent lightweight Gacha that runs very well om mid range 2021s phone\n\nAny suggestions?",
            "I'm looking for a gacha game to play. I only played one gacha game longer term before which was fire emblem heroes. I tried Genshin impact and honkai star rail but I found out I don't like playing open world 3d games on my phone. I'd prefer something more akin to classic final fantasy so turn based is a plus. Also graphically I don't mind if it's jrpg style but I'm not looking for a waifu collector. Money wise I wouldn't mind spending 5-10 euro per month if it makes the game more fun but that's also my limit so it should be budget friendly. I already pre-registered for sword of convallaria but maybe there is a different game for me.",
            "I would like some recomendations for games similars to Brown Dust 2 and Android Emulators for Win10 besides Google Play Games Beta. My PC specs are ok\n\nI really don't like HSR and Genshin.",
            "Crowd Control is on. Can't see shit, **WHERE ARE THE COMMENTS?!**",
            "Any gacha games when there are lots of (as in not sig. less than females) mae characters?",
            "is there any game that is similar to BD2? simple, doesn't take too much time, decent story, cute pixel-ish chibi, and light enough to play on the phone.\n\nlooking forward to Sword of Convallaria since it looks pixel-ish, but that's still a month away i think?",
            "Looking for fun idle/autoplay gacha. Atm playing Omniheroes, AFKJ, Eversoul and Tower of God. Already played AFK Arena, Mythic Heroes, Mobile Legends Idle game, Idle Heroes."
        ]
    },
    "Zenless Zone Zero: Plans & Predictions Pre-Launch Discussion Megathread": {
        "title": "Zenless Zone Zero: Plans & Predictions Pre-Launch Discussion Megathread",
        "score": 80,
        "url": "https://www.reddit.com/r/gachagaming/comments/1dpdiom/zenless_zone_zero_plans_predictions_prelaunch/",
        "content": "https://preview.redd.it/oudfdry3qz8d1.png?width=2208&format=png&auto=webp&s=fb1840c2d0a41efba8a54c0e8c15216a6f68ce4d\n\n[Featured Image](https://i.imgur.com/9X5ayBH.png)\n\n# Zenless Zone Zero Pre-Launch Megathread\n\nWelcome to the Zenless Zone Zero Pre-Launch Megathread. **This thread is intended to serve as a central place to converse about plans, predictions, expectations and any other topic often discussed in the leadup to a new game's release.** Are you excited and planning to play the game yourself? Do you expect the launch to have significant issues that need to be fixed? What story will the all-seeing first month revenue report tell? *Let us know below!*\n\nSome example topics that we used to inquire about as part of our Predictions pre-launch threads:\n\n* What aspect of the game are you most excited for (ie. Story, Combat, Characters, Exploration)?\n* Will the game be well-optimized upon release? If not, what will the biggest issue be?\n* What will the game's revenue be for the first calendar month? Where will it rank on the chart?\n* Will the game have a major social/cultural/monetization controversy at launch? If so, what will it be?\n* Where will the Google Play Store and App Store ratings sit following the game's first week?\n\n*Unfortunately, Reddit no longer offers the native Predictions post type that we used to publish, and we are still looking for a suitable way to replace them while maintaining the original gamified intent. Please keep an eye out for updates!*\n\n\\_\\_\\_\n\n# Game Information\n\n**Release Date: July 4, 2024**\n\n**Platforms: Android, iOS, PC, PS5**\n\nZenless Zone Zero is an upcoming free-to-play, 3D urban fantasy action role-playing game developed and published by miHoYo Co., Ltd. (COGNOSPHERE PTE. LTD. , d/b/a HoYoverse). The game takes place in a world set in the near future, where a mysterious natural disaster known as \"Hollows\" has occurred. A new kind of city has emerged in this disaster-ridden world — New Eridu. This last oasis has mastered the technology to co-exist with Hollows and is home to a whole host of chaotic, boisterous, dangerous, and very active factions. As a professional Proxy, you play a crucial role in linking the city and the Hollows. Your story awaits.\n\nOfficial Links→ [Website](https://zenless.hoyoverse.com/en-us/), [Twitter](https://x.com/ZZZ_EN), [YouTube](https://www.youtube.com/@ZZZ_Official), [Reddit](https://www.reddit.com/r/ZZZ_Official/), [Discord](https://discord.gg/zenlesszonezero)\n\nPre-Registration→ [Google Play Store](https://play.google.com/store/apps/details?id=com.HoYoverse.Nap), [App Store](https://apps.apple.com/us/app/zenless-zone-zero/id1606356401), [Epic Games Store](https://store.epicgames.com/en-US/p/zenless-zone-zero-c7c151), [PlayStation Store](https://store.playstation.com/en-us/concept/10009763)\n\n\\_\\_\\_\n\nThis thread is part of a new series of Launch Megathreads. [Read the announcement here](https://www.reddit.com/r/gachagaming/comments/1dokt6m/introducing_launch_megathreads_and_other_plans/).\n\n# Poll Question: Do you plan to play Zenless Zone Zero?\n\n[View Poll](https://www.reddit.com/poll/1dpdiom)",
        "num_comments": 375,
        "comments": [
            ">Platforms: Android, iOS, PC\n\nI'm pretty sure there will be PS5 launch on release too",
            "Who is on everyone's wish list?? I want Ellen, Grace, & Rina!",
            "Gotta stay strong for Miyabi bois",
            "Im incredibly interested to see how this impacts Genshin and HSR, especially with HoYos plan of having their updates spaced a fortnight apart.",
            "Seriously debating taking a day off on 7/5 so I that Id have four consecutive days to binge this game",
            "I really liked that persona-style hangouts. \n\nTotally not related to me playing through Reload right now.",
            "Maybe it's just me but I have a feeling that the tv gameplay won't end up being as bad as some streamers have been making it out to be, specially since apparently it's been sped up in the more recent beta testing and is also non-existent in some game modes.  Overall, if the action game play feels exciting and challenging enough then the game will probably do really well in the long term.  The interesting character designs will also probably end up being the game's main selling point",
            "Hope it's good. I'll be playing day 1 on PS5.",
            "Can't wait for it since I liked this kind of combat focused game. I'd like to jump into PGR and HI3 but being 5 years behind isn't fun.\n\nI'm gonna save so hard for the trio of girls, I hope the robo girl is playable too",
            "Wow, 1.0 and beta look like 2 seperate games, absolutely can't wait to play this next week."
        ]
    },
    "choose your fighter among the 2": {
        "title": "choose your fighter among the 2",
        "score": 372,
        "url": "https://i.redd.it/ppo5j14drh9d1.png",
        "content": "",
        "num_comments": 58,
        "comments": [
            "the pixelated tree looks kinda nice ngl, it would fit like a glove in a retro-styled game",
            "Kuro copying genshin bug, if this isn't dedication, then I don't know what is",
            "Yinlin so I can be her doll",
            "i need context on roblox impact, is that like when it was in beta or is that a bug or a mod to lessen resource cost on your PC?\n\nalso in Minecraft waves, I think the fix there is in settings and has something with general log or something to be turned on",
            "I just noticed that the latest hotfix made some bushes and tree pixelated when they looked fine before (WuWa). Was this happening since 1.1 for everyone else?\n\nEDIT: reset the game and its back to normal",
            "that pixelated tree looks fire tho",
            "What's sad is the genshin bug is on mobile while wuwa's is on PC. They've fixed stuff but there's still a lot to do",
            "THe new minecraft update. It is my  first time playing and we even have a dragon!",
            "This is like that cart wheel meme but backwards. You have the 1 good wheel - yinlin and 3 bad wheels. \n\nIf you put the blue outfit girl instead this would be tougher, but yinlin is such an ez decision",
            "roblox impact is fitting considering both are games for kids. maybe they'll collab one day"
        ]
    },
    "What characters in your gacha have gotten a meme or \"reputation\"?": {
        "title": "What characters in your gacha have gotten a meme or \"reputation\"?",
        "score": 280,
        "url": "https://i.redd.it/aivck0sxch9d1.jpeg",
        "content": "",
        "num_comments": 86,
        "comments": [
            "momoi the racist gamer goblin",
            "\"I can't take it anymore. I'm sick of Xiangling. I try to play Diluc. My Xiangling deals more damage. I try to play Yoimiya. My Xiangling deals more damage. I try to play Cyno. My Xiangling deals more damage. I try not to play Dehya. I want to play Klee. Her best team has Xiangling. I want to play Raiden, Childe. They both want Xiangling.\nShe grabs me by the throat. I fish for her. I cook for her. I give her the catch. She isn't satisfied. I pull Engulfing Lightning. \"I don't need this much er\" She tells me. \"Give me more field time.\" She grabs Bennett and forces him to throw himself off enemies. \"You just need to funnel me more. I can deal more damage with Homa.\"\nI can't pull for Homa, I don't have enough primogems. She grabs my credit card. It declines. \"Guess this is the end.\" She grabs Gouba. She says \"Gouba, get them.\" There is no hint of sadness in her eyes. Nothing but pure, no icd pyro application. What a cruel world.\"",
            "Trailblazer being dumbass Trash panda",
            "We have Herta, animated by Dork Dragoon",
            "Gorilla Queen Mika and Poison Iroha (don't look this one up to avoid nsfw :D )",
            "The potential man and sloshing juice",
            "Uh i dont think i need to say much about astolfo.\n\nMerlin is always the go to for bringing up \"weird nasuverse bullshit\", by mentioning his cock wizard shenanigans.",
            "I think Nero maintenance from fgo especially the santa nero especially at Christmas countdown",
            "none cuz star rail fans think they are the characters so if we make a character a meme theyd get personally offended",
            "I think fucking the hagged or something is the popular one from rhombus company"
        ]
    },
    "Let’s talk, what did hoyoverse do?": {
        "title": "Let’s talk, what did hoyoverse do?",
        "score": 247,
        "url": "https://www.reddit.com/r/gachagaming/comments/1dr6uxo/lets_talk_what_did_hoyoverse_do/",
        "content": "I have been browsing around Reddit, YouTube lately and it seems like under every comment\na wuthering wave video or ZZZ is made. There would be someone saying something along the lines of \n\n“I can never go back to hoyo after how they treated their fanbase!”\n\nOr\n\n“Hoyoverse treating their player base like garbage”\n\nAnd as a genshin player who quit during the desert map because of the poor exploration experience who recently just to go through the main story quest and roll furina.\n\nI’m actually so incredibly confused about this sentiment/hatred towards hoyo right now?\n\nFrom my experience, a lot of the previous pain point have been addressed which made me quit in the first place. Having quest interrupted midway because of a character is taken, not having layered map for exploration. There is a lot of QOL updates to like Paimon’s EN Voice got a lot better, opening/exploring counts towards dailies. The Fontaine quest was also arguably a step up.\n\nLike I can understand people are burnt out playing genshin for a few years. But how did this few years of enjoyment turn into this monstrous hate towards Hoyo? \n\nThe only drama I heard was the 3 rolls but wasn’t that already proven to be out of context as it was actually like 10+3?\n\nHow did the gacha community become this dog shit water pile mess right now? I have to be missing context here right.\n\nDoes anyone know what happened? \n\n\nEdit: 10+3",
        "num_comments": 637,
        "comments": [
            "> Lets talk, what did hoyoverse do?\n\nThey did not pay the friendship fee.",
            "Nothing happend. Its just the standard comments. Fans of one game is trying to crap on another game, true or not. Its not limited to gacha.",
            "be mainstream. Its that simple. People new the gacha games think that genshin invented greed.",
            "\"Hoyo is treating us like garbage\"\n\nYes, with love and care like Trailblazer to their trash",
            "From what i see from twitter (which can be different from other platforms) it is because of freebies. If you check whenever freebies being given by any gacha game, there would be someone would just comment equivalent of \"Genshin could never\" and if you argue all the qol genshin has been getting, they conveniently branded you as hoyo shills, mint picker, etc. of course it's only a small loud minority, but they still obnoxious",
            "A bunch of weird people take pride in hating popular things, just to feel special.\n\nLiterally \"I'm different than other girls\" mentality.",
            "Beats me. As far as I am concerned, the main points in Genshin, story, exploration, lore, and characters have only gotten better, even QoL and a new game mode have been added. My best guess for the people who say that we are getting treated like trash are either ones that have never played and ride the hate wave, or people that have played too much and the only way for them justify their frustration is to hate on it, as pointless as that may be.",
            "they din't give enough free pulls and din't add more endgame and difficulty in genshin even tho the devs did not want genshin to be something hardcore, that's it really.\n\nit's mostly a clash of wants",
            "Unfortunately what you're seeing is what happens when people develop parasocial relationships with companies.\n\nJust see it as an Ex-girlfriend bitching about her Ex-boyfriend on the internet because she felt he was neglecting her and not cherishing her during their \"relationship\".",
            "Mainstream popularity and drama content creators happened"
        ]
    }
}