{
    "Rugged Armor showed up today ": {
        "title": "Rugged Armor showed up today ",
        "score": 11,
        "url": "https://i.redd.it/7tax7f800j9d1.jpeg",
        "content": "Face - https://play.google.com/store/apps/details?id=time.flies.waytogo",
        "num_comments": 13,
        "comments": [
            "My 5 Pro came in the same day as my Rugged Armor. Took it out of the box, took the strap off, and placed it directly in that bad boy. It has never left. Accessories like this are, in my opinion, one of the main reasons to go with a Galaxy watch. \n\nI've been rocking the Oneplus Watch 2 lately and it's great, for the most part. Stainless steel and sapphire build, but nobody makes cases for it. I like to have a protective bezel around keeping my screen safe. This case will serve you well.",
            "I bought, realised it can't be placed on Flat Samsung Wireless Charger. Returned",
            "Bro , what is that tempered glass",
            "A great way to make a $400 watch look like a $60 watch.",
            "Aye the only reason I got it was because I broke the screen on my Galaxy Watch 4 44mm LTE, it was cheaper to get a new watch than get it repaired",
            "The Samsung d-clasp band or whatever it's called won't either. I just put it on its side and it is all good.",
            "My charger sits on my soundbar,  so instead of sitting along it, now I'll just tuck the long strap over the back of the soundbar against the wall",
            "The watch 6 has a sapphire lens",
            "Way To Go, link's in the post",
            "means it is matte by default?"
        ]
    },
    "[UI Images] ALL One UI 6 Watch Features, UI ": {
        "title": "[UI Images] ALL One UI 6 Watch Features, UI ",
        "score": 78,
        "url": "https://www.reddit.com/r/GalaxyWatch/comments/1dr1oro/ui_images_all_one_ui_6_watch_features_ui/",
        "content": "[⬅️ Swipe left for more](https://preview.redd.it/j6smfbm0hf9d1.jpg?width=1190&format=pjpg&auto=webp&s=31a7aa984bdd44dcbde86ab18ddee99a57286cc3)\n\n[⬅️ There's more](https://preview.redd.it/rc7mlnr0hf9d1.jpg?width=1190&format=pjpg&auto=webp&s=442af20f76769a4e336792dc6a1df8b3121f7b5d)\n\nhttps://preview.redd.it/7l2vrcm0hf9d1.jpg?width=1190&format=pjpg&auto=webp&s=92759dbc09ba51d18cf14e1ea031f1387b06b6e2\n\nThe UI improvements and new features may seem little compared to previous years, but trust me, the animations and overall UX are so much smoother and bouncier.\n\nMost of the One UI 6 Watch UI improvements/upgrades and new features. Enjoy!!",
        "num_comments": 31,
        "comments": [
            "Thank you for putting the effort into making this post. It made me more excited for one UI 6. \n\nOut of curiosity, what's \"back and forth\" in the first picture?",
            "Looks solid, but the charging screen looks a downgrade since the texts are all cramped together.",
            "great, thank you so much for taking your time and sharing",
            "Seems like double pinch is implemented properly in this OS",
            "Any improvements in battery life?",
            "Could you see if double pinch works on the media player coming from your phone? I am really curious",
            "not all heroes wear capes.",
            "Do you know when it will be available?",
            "Does the pincode screen to unlock the watch also have a different UI or is that still unchanged?",
            "There's no new watch face?"
        ]
    },
    "I keep getting inconclusive on my watch ECG, should I go to the doc?": {
        "title": "I keep getting inconclusive on my watch ECG, should I go to the doc?",
        "score": 14,
        "url": "https://i.redd.it/81pk5a9tdh9d1.jpeg",
        "content": "",
        "num_comments": 26,
        "comments": [
            "From my understanding, if your HR is over 100 it will say inconclusive no matter what. Why it works that way I have zero idea. But read in the app it says inconclusive is literally defined as either atrial or sinus which is what you want. It's just for some reason if its over 100 it won't specify. Maybe someone else knows why they decided to make it work like that.",
            "Not a doctor, but at a glance, it looks fine to me.  Probably due to the HR being over 100 it just won't say for sure if there are any issues.\n\nIf you feel fine, I am sure it is nothing to worry about.",
            "If your HR is always over 100, yes. If it's not, ignore the ECG app and only use it if you feel bad. You'll drive yourself nuts if you keep doing it over and over again.",
            "Just a heads up, my wifes Galaxy 5 Pro kept doing that for a few days, so she went to the ER. They told her it was one of the after-effects of recovering from COVID.",
            "Have you taken this while resting for at least 15 mins? Like sitting? If ur resting HR is high, then you should (except if you have fever etc)",
            "The same happens when your heart rate is consistently below 65. Mine is usually in lower 60s and it always shows an inconclusive.",
            "When in doubt check it out",
            "Last year, I noticed my resting heart rate had gone up from high 40s to low 50s - about a 10% jump in just a month or two. So I went to my doc, she ordered some tests, long story short, I had a triple bypass just over a month ago. \n\nSo I'm glad I went to my doc. Wouldn't you feel silly if you had a heart attack, and the doc said \"If only you'd come in sooner?\". Because my surgery wasn't urgent and thus completely planned, it went very smoothly, and I am recovering quite nicely. It might be different if I'd actually had a heart attack, and they'd had to scramble in the ER. Better safe than sorry, my friend!",
            "Do you really routinely have a resting HR over 100bpm (assuming you are an adult)?",
            "This is like perfect sinus rhythm. Slight tachycardia but I'm assuming u were just doing something or had anxiety. Unless you have a history of coronary artery disease this is completely fine."
        ]
    },
    "Finally got a GW5 after two-ish years of wishing. Any recommendations? ": {
        "title": "Finally got a GW5 after two-ish years of wishing. Any recommendations? ",
        "score": 147,
        "url": "https://i.redd.it/3ywq72ji7c9d1.jpeg",
        "content": "After a long-ass time, I got a new job with better pay, and my old Mi Band 4's strap gave up. I also found a deal, this 44mm GW5 for essentially 110USD. \n\nAnything y'all recommend? I'm running AOD, low brightness, raise wrist off, WIFI/BT/NFC/GPS all on. I also used a sideloaded app to turn the Samsung Pay (unavailable in my country) button hold into Google Pay. ",
        "num_comments": 55,
        "comments": [
            "Congratulations , enjoy your new watch.",
            "Turn on security pin if you haven't. You only have to input it when you take the watch off and put it back on, but it will secure your data. It's not part of the standard setup for some odd reason.",
            "Check out r/galaxywatchface. Lots of free or discounted faces there.  A lot of them that I dig I follow the designer and purchase ones I like.\n\nEdit: also r/androidwatchfaces",
            "Switch the bottom right complication to a Timer. Afterwards, you can touch it, set a timer, and watch it count down on your watch face.\n\nSuper handy for cooking, waking up from a nap, or reminding yourself to let the dog in from the backyard.",
            "Install Google Assistant, turn off hey google.",
            "Turn on the setting that makes it vibrate when it disconnects from the phone",
            "Replace the rubber band with some nice fake leather.",
            "For more accurate health data, wear it tighter than they recommend",
            "No matter what anyone tells you.....it doesn't look too big on your wrist.",
            "I just got my gw5p and insta locked into this interface"
        ]
    },
    "Need Help ": {
        "title": "Need Help ",
        "score": 2,
        "url": "https://www.reddit.com/r/GalaxyWatch/comments/1drcvzm/need_help/",
        "content": "Hello everyone,\n\n is it possible to bind every kind of turn on to take me to a Home Screen? What i need is, wherever I'm in the  any of the apps or notifications and the screen goes off - i want it to turn on to the watch face. Couldn't quite find answers online\n\nIts Galaxy watch 6 classic  \n**if its not understandable, please ask me for further explanation**",
        "num_comments": 0,
        "comments": []
    }
}