{
    "BEGINNER MEGATHREAD - How to get started? Which engine to pick? How do I make a game like X? Best course/tutorial? Which PC/Laptop do I buy? [Feb 2024]": {
        "title": "BEGINNER MEGATHREAD - How to get started? Which engine to pick? How do I make a game like X? Best course/tutorial? Which PC/Laptop do I buy? [Feb 2024]",
        "score": 301,
        "url": "https://www.reddit.com/r/gamedev/comments/1agdesg/beginner_megathread_how_to_get_started_which/",
        "content": "Many thanks to everyone who contributes with help to those who ask questions here, it helps keep the subreddit tidy.\n\nHere are a few recent posts from the community as well for beginners to read:\n\n[A Beginner's Guide to Indie Development](https://www.reddit.com/r/gamedev/comments/1adji3r/a_beginners_guide_to_indie_development/)\n\n[How I got from 0 experience to landing a job in the industry in 3 years.](https://www.reddit.com/r/gamedev/comments/1adqik4/how_i_got_from_0_experience_to_landing_a_job_in/)\n\n[Here’s a beginner's guide for my fellow Redditors struggling with game math](https://www.reddit.com/r/gamedev/comments/1ae8s03/heres_a_beginners_guide_for_my_fellow_redditors/)\n\n[A (not so) short laptop purchasing guide](https://www.reddit.com/r/gamedev/comments/17ykkmu/a_not_so_short_laptop_purchasing_guide/)\n\n[PCs for game development - a (not so short) guide :)](https://www.reddit.com/r/gamedev/comments/1cwttz8/pcs_for_game_development_a_not_so_short_guide/)\n\n\n\n\n\n&nbsp;\n\n###Beginner information:\n\nIf you haven't already please check out our guides and FAQs in the sidebar before posting, or use these links below:\n\n[Getting Started](https://www.reddit.com/r/gamedev/wiki/faq#wiki_getting_started)\n\n[Engine FAQ](https://www.reddit.com/r/gamedev/wiki/engine_faq)\n\n[Wiki](https://www.reddit.com/r/gamedev/wiki/index)\n\n[General FAQ](https://www.reddit.com/r/gamedev/wiki/faq)\n\nIf these don't have what you are looking for then post your questions below, make sure to be clear and descriptive so that you can get the help you need. Remember to follow the subreddit rules with your post, this is not a place to find others to work or collaborate with use r/inat and r/gamedevclassifieds for that purpose, and if you have other needs that go against our rules check out the rest of the subreddits in our sidebar.\n\n&nbsp;\n\n[Previous Beginner Megathread](https://www.reddit.com/r/gamedev/comments/18ycuf1/beginner_megathread_how_to_get_started_which/)",
        "num_comments": 1071,
        "comments": [
            "Are there any resources where people breakdown games and show how they worked? Even if it's just nes games at an abstract level or something.",
            "What would be a good starting point and engine for a turn based game like Civ?",
            "so i wanna get into game dev I've started learning godot and I'm quite liking it, but my question is should I learn engine or framework or libraries? which one would be good for a resume or something like that. if I want to like get a job in this field or like work for a company should I be learning engine or frameworks? also another question how should i be learning godot? should i learn the Godot script or c# or cpp?",
            "This is a super cool idea honestly.",
            "Hey, I (C# Backend Software Dev) am planning a small game project mostly for fun and the learning experience, but open for anything more, with a friend who studied webdesign/digital design. the plan is a tamagochi like game with interesting game elements. The plan is for both of us to get into the respective other side design/coding. what is a smart choice language/engine wise?",
            "I am completelly new to programming. i had c# in school for 5 years but wasnt that good. but i want to get started in programming a game. should i choose unity? i want to publish it sometime i think. i once programmed a little space invaders on unity but i dont know if this is the best engine to make a game. can someone help pls.",
            "If the intention is to make something that is model/sprite wise similar to trine, but with the camera completely locked off. Is it correct to just make a 3d game and just lock off the rotation and 3rd axis of the models,  or is there some 2.5d technique/jargon that is a good idea to go learn? Have never worked with models or sprites before.",
            "Hi, I want to study the design of X-COM 2. Does anyone know how I can learn about the design and development of the game in detail? For example, I'd like to take a look at the code that was used, as well as to learn about the trials and tribulations of the development process. Thanks!",
            "Is it possible for 2 people to learn how to make a game in 3-4 months using Unity?\n\nMy friend and I have 0 experience in game development, but we do have some experience in Python and C++. Is it possible for us to learn enough C# and become good enough to make a game in less than 4 months? We're not actually planning on making and selling a game, we just want to become skilled enough to make a simple game from scratch (like Flappy Bird or Snake) without the help of a tutorial.",
            "How to start on \"Art\"? I can code and design ok-ish but my art skills are lacking, I tried using AI like \"Scenario\" and it's cool but I wanna know how to at least do the final touches like adding proper background and border.  \nshould I go for PS or GIMP or some other options?"
        ]
    },
    "FEEDBACK MEGATHREAD - Need feedback on a game mechanic, character design, dialogue, artstyle, trailer, store page, etc? Post it here!": {
        "title": "FEEDBACK MEGATHREAD - Need feedback on a game mechanic, character design, dialogue, artstyle, trailer, store page, etc? Post it here!",
        "score": 52,
        "url": "https://www.reddit.com/r/gamedev/comments/1cqt2so/feedback_megathread_need_feedback_on_a_game/",
        "content": "Since the weekly threads aren't around anymore but people have still requested feedback threads we're going to try a megathread just like with the beginner megathread that's worked out fairly well.\n\n&nbsp;\n\n### RULES:\n\n- **Leave feedback for others after requesting feedback for yourself**, at least for two others if possible otherwise do it later once more comments have showed up.\n\n- Please respect eachother and leave proper feedback as well, short low effort comments will not count.\n\n- Content submitted for feedback must not be asking for money or credentials to be reached.\n\n- Rules against self promotion/show off posts still apply, be specific what you want feedback on.\n\n- This is not a place to post game ideas, for that use r/gameideas\n\nSee also: r/playmygame and r/destroymygame\n\n&nbsp;\n\nAny suggestions for how to improve these megathreads are also welcome, just comment below or send us a mod mail about it.",
        "num_comments": 294,
        "comments": [
            "It looks really good. If you want to add something to make it better, you can add gifs or images to \"about this game\".",
            "Please remember to leave feedback for others if you want feedback for your own game.",
            "I feel like you should mix in some gifs with the body text - that usually helps to break the monotony of reading.",
            "needs a bit more animation love.  Put in some anims that compress him when landing to start with.  just some overall flair in that department will go far.",
            "It's hard to know how much feedback to give about the appearance knowing it's a prototype. But visually it's a bit hard on the eyes--I think the environment could be softer (less contrast between sunlight and shadow, maybe more fog/haze) and darker so that the HUD and UI pop more against the 3D visuals. The combat itself looks pretty good, I really like the replay(?) system you show at the end!",
            "I'm assuming \"Combat Ace\" is way too close to \"Ace Combat\" and will get you in trademark trouble.",
            "I like the look of the game a ton.  The black screens with text tho are a little stark, maybe use something else as a backdrop for them that matches the game art.",
            "Love it!  My daughter loves MS Paint, and I'm trying to work her stuff into my game for fun, but this is next level.  Could there be a way for kids to get their own art into the game?",
            "The use of your kid's art works really well - maybe replace the sky with a hand coloured blue texture though. Makes me think of yoshis Island - just need to use the art better in a few places. The path also needs a better work around, maybe bigger sections rather than small tiles",
            "I would honestly play this it looks fun and trippy"
        ]
    },
    "Got laid off from a fin-tech company, do I go full-time game dev?": {
        "title": "Got laid off from a fin-tech company, do I go full-time game dev?",
        "score": 13,
        "url": "https://www.reddit.com/r/gamedev/comments/1dr9kzv/got_laid_off_from_a_fintech_company_do_i_go/",
        "content": "I was given a 90-day notice period and about 8 months severance at my job where I'd been a lead software developer for over 9 years. My role along with 400 others were eliminated one fine day recently. My wife works at another company that earns a lot higher salary than mine already. I've been working on my game for the past year and a half and this job was honestly affecting my mental health a lot. It was never about the work anymore and there were lots of politics going on. This lay off was inevitable but still a shock to my system.\n\nI've hated working in corporate since the last 2-3 years because it always took a lot of time away from the game development. This lay off and with a generous severance should be some kind of sign right? My wife is 100% supportive of me whatever path I choose. She thinks I should go the game-dev route and use this time to start the business. I think I can make a working demo in 6-7 months from now, and finally begin marketing now. My problem is, I don't know anyone around me in this industry. Classmates, friends, family, they are all corporate junkies and will not understand this path I take. My dad might, he used to be a business owner here and there in the 90s and 2000s. I really feel this urge to start my own business and really kickstart the game studio but not sure if anyone has thought of this in a similar situation.\n\nHas anyone gone through this? Or am I alone in this endeavor?",
        "num_comments": 43,
        "comments": [
            "Id say start searching for a job while working on the game. You might find a better oppurtunity, who knows.",
            "Have you ever released a commercial game before? If not you shouldn't consider this going full-time in a new business. You're not likely to make a lot of money from solo game development. You don't need to know anyone else doing it, it's just that it's a very rare game actually made by one person (it's a lot easier to make something good when everyone can be an expert in a different skill), and it takes a lot of experience (and investment) to make something people really want to play. You also likely don't want to start promotion 6 months before a demo (you'd start 6-7 months before final launch).\n\nThat being said, it sounds like you need a break. You could use a sabbatical and don't need to jump back into work right away, so spending some time working on a game, if you enjoy that, could be great for you. Just don't start working 60 hour weeks because you think your new solo start-up is going to replace your day job. Most likely you'll release it, get a few sales (some thousands if it's decent and you promote it well), and then you go back to software development somewhere. Treat this like a mental health break, not a new full-time career.",
            "You will just loose your precious life time what I did for months or years stuck in a OCD game dev solo experience struggling and being overwhelmed into a creep scope. If even you manage the end, your game will be instantly into the limbo, except you have a lot of money into marketing. Just make something to get busy until you get a new job.",
            "I'm on a pretty similar situation, but I've not been laid off. I'd love to, to be honest, as my current job is draining me mentally.\n\nSince your situation provides some security, it could be a great opportunity to develop your game demo, while networking within the industry. Use this time to both recover from your previous job, and to lay the groundwork for your game studio.",
            "Might as well try it for 3 months or so - you can always use the same business entity to do contract work too.\n\nThis was my idea if I were to get the same deal, but they only laid off my colleagues instead :(",
            "Start a game, and look for a job? See what pans out.",
            "Are you willing to salary sacrifice? You could work at a game company and develop your chops, but the pay won't be any where as good as far as my undersstanding goes. But if your financial situation is ok, perhaps there's no harm spending a year or 2 working at a game development studio.\n\n8 months is a pretty good runway to find a game dev job.",
            "Youre in good financial shape, it sounds like, so to a degree, you might as well. But why start a business? Why not just start making something and figure out if you actually like it enough to treat it like a job first?",
            "Been looking for a partner who is game developer to help create a game that has been in my mind for years that I know would be a game that this specific audience would love. Lets chat!",
            "I'd say send it! You got 8 months severance make a goal to have some slice done in 4 months if you have something that is half there and fun keep going if not maybe look for a new job to cover yourself"
        ]
    },
    "Stay Away from Daily Indie Game": {
        "title": "Stay Away from Daily Indie Game",
        "score": 420,
        "url": "https://www.reddit.com/r/gamedev/comments/1dql676/stay_away_from_daily_indie_game/",
        "content": "I joined Reddit to warn other indie devs about [dailyindiegame.com](http://dailyindiegame.com)\n\nI provided them with so many keys for 2 steam games (FarRock Dodgeball & Die in the Dark). Once I asked for payment, he asked for ALL my sensitive bank account information plus more, essentially setting me up for all kind of scams / hidden surprises in my bank account. Once I refused and suggested to get paid via Paypal, Cash App, Venmo etc. I was insulted and threaten to get sued for not giving out sensitive information. I didnt get paid but some how I turned into the bad guy for calling out their tactics.\n\nPoint of the story stay away from Daily Indie Game.",
        "num_comments": 166,
        "comments": [
            "Did they promise payment via wire? Bank account number, bank routing number, bank name, your name, and your address are all needed for a wire transfer.",
            "What was asked for beyond the standard information you would give a platform such as Steam to receive payment?",
            "\"Sensitive bank information\" can we get what that is?  BErcause Account number, routing number bank name and your name are NORMAL information for bank transfers.  It's far shadier to go to paypal, or venmo because there's not as much proof who the other side is, and as a \"Real business\" I would struggle to go through one of those versus a direct deposit which has a firm record.",
            "It's weird, both OP and the person claiming to run said site in question are both posting from new accounts both made on the same day. 4 days ago.\n\nSeeing how the site rep is commenting here I wouldn't want to do business with them and would suggest to OP to stick to the widely known sites if they wish to be doing something like this.",
            "I have not done business with them, but I've seen negative experiences posted on Reddit often enough that I'd avoid. One common thread has been unprofessional and possibly even threatening communication.",
            "You should supply screenshots if you're going to claim people are trying to do shady stuff and saying things they shouldn't. I don't think anyone is going to be inclined to take a 3 day old account with no comments other than complaining about that site seriously.",
            "Revoke the keys you gave them then so they can't be activated, but also the info they asked for is standard to be paid",
            "Yo! side B,whats up lol \nYeah they are very scammy its best to stay away from them. I think a few other folks have posted about them.",
            "I'm on old.reddit.  Did the OP purposely make dailyindiegame.com a clickable link so we can easily go there anyways or does new.reddit automatically do this for you?",
            "Don't give out keys to anyone that you don't know is legitimate."
        ]
    },
    "(Actually) Free Marketing Guide for Personal Branding as an Indie Dev": {
        "title": "(Actually) Free Marketing Guide for Personal Branding as an Indie Dev",
        "score": 19,
        "url": "https://www.reddit.com/r/gamedev/comments/1dr4u3q/actually_free_marketing_guide_for_personal/",
        "content": "Hey all,\n\n\\*not selling anything. Hope this doesn't break the self-promotion rules. If so let me know, please.\n\nI'm an indie game marketer and I've been working on a guide for indie devs for what seems like forever now, but it's finally done! Or, at least, the rough draft is.\n\nIt's free. Completely. No email sign ups required or anything like that.\n\n*I want to be completely transparent:*\n\nThere are some affiliate links in it, but the tools I talk about are mostly all free, so they don't serve much of a purpose unless someone decided to upgrade or something.\n\n[~~Here's the Guide~~](https://drive.google.com/file/d/1wbHEUgH1YW-acLYWk9eY0DgUZJflm1kp/view?usp=drive_link)~~.~~   <----Eyebleeder design\n\n[Here's the UPDATED guide](https://drive.google.com/file/d/15eMYgcdAr9s_SgXYMICy1Zyv7CA8LH_B/view?usp=sharing) (best I can do on short notice, let me know if it's better)\n\nThe reason I'm making this is two-fold, because I'm an honest an upfront person, I'll share what those reasons are:\n\n1. To help indie devs, for real.\n2. To grow an audience for long term course creation and other affiliate programs (long way away).\n\nYou guys would effectively be getting all the information for free as I test it out and get your feedback.\n\nIf you have things you want covered, ask for them, and I'll probably produce free content for you.\n\nAnyways, I hope you get some value out of it, it took a while to make,\n\nJohnathan, Founder of Stories For Games\n\n(EDIT): Updated my guide for better accessibility. ",
        "num_comments": 34,
        "comments": [
            "the neon blue black is so hard to read.",
            "Thanks for sharing this!!! As someone about to be heading into more marketing initiatives soon stuff like this is awesome to read to get the ideas flowing! :)",
            "Thank you so much! We need these kind of things so badly!",
            "Thank you for taking the time to make this. I suspect most can learn at least a little something from it.\n\nLet the haters do the only thing they know how.",
            "Hey man thanks for the share, the updated colour scheme was definitely better but honestly the first was also completely fine to me, people just love to tear into each other  online I wouldn't think too much about it.\n\nGood luck with whatever you got going on",
            "This looks great - super useful! Thanks for sharing with the world. Will definitely use this!",
            "The font is ahhhh, also the color.",
            "I'm sorry but you completely lost me at \"use AI to make content\". Why don't I use AI to make the whole game then lol",
            "Yup I am interested in reading this but the colors needs to be desaturated for a more pleasant reading experience.",
            "Yeah I had some concerns with this. I'll see how many agree and I might change it. Or at least offer it in another format for vision accessibility."
        ]
    }
}