{
    "BEGINNER MEGATHREAD - How to get started? Which engine to pick? How do I make a game like X? Best course/tutorial? Which PC/Laptop do I buy? [Feb 2024]": {
        "title": "BEGINNER MEGATHREAD - How to get started? Which engine to pick? How do I make a game like X? Best course/tutorial? Which PC/Laptop do I buy? [Feb 2024]",
        "score": 286,
        "url": "https://www.reddit.com/r/gamedev/comments/1agdesg/beginner_megathread_how_to_get_started_which/",
        "content": "Many thanks to everyone who contributes with help to those who ask questions here, it helps keep the subreddit tidy.\n\nHere are a few recent posts from the community as well for beginners to read:\n\n[A Beginner's Guide to Indie Development](https://www.reddit.com/r/gamedev/comments/1adji3r/a_beginners_guide_to_indie_development/)\n\n[How I got from 0 experience to landing a job in the industry in 3 years.](https://www.reddit.com/r/gamedev/comments/1adqik4/how_i_got_from_0_experience_to_landing_a_job_in/)\n\n[Here’s a beginner's guide for my fellow Redditors struggling with game math](https://www.reddit.com/r/gamedev/comments/1ae8s03/heres_a_beginners_guide_for_my_fellow_redditors/)\n\n[A (not so) short laptop purchasing guide](https://www.reddit.com/r/gamedev/comments/17ykkmu/a_not_so_short_laptop_purchasing_guide/)\n\n[PCs for game development - a (not so short) guide :)](https://www.reddit.com/r/gamedev/comments/1cwttz8/pcs_for_game_development_a_not_so_short_guide/)\n\n\n\n\n\n&nbsp;\n\n###Beginner information:\n\nIf you haven't already please check out our guides and FAQs in the sidebar before posting, or use these links below:\n\n[Getting Started](https://www.reddit.com/r/gamedev/wiki/faq#wiki_getting_started)\n\n[Engine FAQ](https://www.reddit.com/r/gamedev/wiki/engine_faq)\n\n[Wiki](https://www.reddit.com/r/gamedev/wiki/index)\n\n[General FAQ](https://www.reddit.com/r/gamedev/wiki/faq)\n\nIf these don't have what you are looking for then post your questions below, make sure to be clear and descriptive so that you can get the help you need. Remember to follow the subreddit rules with your post, this is not a place to find others to work or collaborate with use r/inat and r/gamedevclassifieds for that purpose, and if you have other needs that go against our rules check out the rest of the subreddits in our sidebar.\n\n&nbsp;\n\n[Previous Beginner Megathread](https://www.reddit.com/r/gamedev/comments/18ycuf1/beginner_megathread_how_to_get_started_which/)",
        "num_comments": 1025,
        "comments": [
            "I feel like this link should be included in any beginner guide: https://develop.games/",
            "Recommended starting point for someone with ADHD? All this research has only succeeded in overwhelming me and stressing me out:\n\nI've always been interested in game development ever since I was a child. I'm 39. I'm educated in linguistics and psychology. I am able to learn things. I grew up playing video games, and have been tinkering with computers beginning with my parents' old windows 3.1 computer. I don't know how to code, but I generally know my way around a computer. I've played with Doom mods/level editors, rom hacking for sprite editing or fan translating. I feel like I could learn coding and be good at it, but jumping straight into learning coding is just too much, too boring, and fails to keep my attention. On and off over the last few years I've tried online courses for game development and coding (C++, unreal, etc...), but I feel like that's all a number of steps past where I should be; I'll start, do a few lessons, feel like I'm not grasping it or making any progress, give up, go back later, then having to redo old lessons because too much time has passed I need to relearn the old lessons, repeat. When you have ADHD, anything that isn't actively interesting, rewarding, or attention-grabbing is nearly impossible to stay focused on without quickly getting unbearably stressed out, overwhelmed, and just giving up. If I am properly motivated and interested, I can learn ridiculously complex things, but without motivation and confidence, I am practically unable to even get started. I need to learn in increments: start with something easy that I *can* do, so I can build my confidence and interest and slowly learn new techniques as they become relevant. I want something simple, like a creation suite where all the programming, assets, etc,.. are all taken care of and I can just play around with and feel like I'm learning and achieving something to build my motivation and then slowly build my repertoire as I try different things.\n\nI know there are a lot of such creation tools, engines, suites, whatever, and I spent *soooo* long researching them, and the more I research them, the more paralyzed and overwhelmed I feel. There are *so* many, and having so many choices just makes my brain scream, ultimately making me unable to make any choice.\n\nAs I said, if I have the motivation and get that first spark to spur me on, I could do amazing things, but that first hurdle is the hardest (especially with ADHD). I need something simple and easy to start with that will build my motivation. What is a good program/engine/tool that someone with little to no experience could play with to build motivation and feel a concrete sense of learning or achievement?",
            "To get it out of the way: **What engine should I use?**\n\nThe answer is going to be:\n\n* Unreal, Unity or Godot if you want to do a 3d game\n* Godot or Unity if you want to do a 2d game\n* Ren'Py if you want to create a visual novel\n* RPGMaker if you want to create a 16bit-style JRPG\n* No engine if you want to make a game that is nothing but UI. Pick a programming language with a UI framework instead.\n\nIf you are not sure which one exactly, just google \"Godot vs. Unity\" or \"Godot vs. Unreal\" or \"Unreal vs. Unity\" and you will receive countless results of people debating this very question. Every argument one could make in this debate has already been made. We don't need to start yet another one.",
            "I would like to develop my own game engine, then eventually develop my own game(s) with said engine. The game I’m most interested in eventually developing is an MMORPG. I have a few questions related to this that I could use some feedback on:\n\n1) I am trying to learn C++ and, while I can learn on my own, I’d like to get additional help. Which degree would be the best to look into for the programming side? I was thinking computer science, but do you think there would be a better option? I’m not looking into getting a job with a company, team, etc. This would be purely for myself. \n\n2) I’m assuming that a desktop would be better than a laptop for this. What are some must haves, for a desktop, that you recommend me get for it/with it?; Whether hardware or software. \n\n3) I currently have a laptop that I plan on resetting for the sole purpose of using for developing on the go. What would you say would be the best storage for my projects so that I can access them from both computers?; Whether a cloud, external storage, etc?\n\n4) Besides the obvious time, money, scale of project, stupidity of my ambitions.. are there any other considerations I should keep in mind? Any recommendations that may make it easier for me?\n\nI greatly, and sincerely, appreciate any and all advice you are willing to give.",
            "Are there any resources where people breakdown games and show how they worked? Even if it's just nes games at an abstract level or something.",
            "What would be a good starting point and engine for a turn based game like Civ?",
            "so i wanna get into game dev I've started learning godot and I'm quite liking it, but my question is should I learn engine or framework or libraries? which one would be good for a resume or something like that. if I want to like get a job in this field or like work for a company should I be learning engine or frameworks? also another question how should i be learning godot? should i learn the Godot script or c# or cpp?",
            "As a hobbyist gamer ( not like the quit my dayjob kinda guy but keep my dayjob and work on this as a side project), I read a Light novel recently that had a pretty cool game concept so trying it out for a initial game.\n\nThe game: \n\n1) it's a basic mecha brawler / fighter kinda game. Where u just have to reduce the other mecha health to zero. But mechs might need to be customized based on the environment cause they operate differently on land / water.\n\n2) movement & combat style : each mech should be capable of 360 movement and fight mobile rather than like a tower defense game. Thinking of using 2D maps cause they seem easier to model and handle than 3D ones( for a newbie atleast , am I wrong? Or 3D ones are more easier to handle )\n\nSo was looking for tools which can help here. I don't want player to feel like they are playing on 2D maps but similar to 2.5D with depth like Gen 4/5 Pokemon games so what concept can I use here? Elevated Shadows / something like 2.5D kinda one ( is it even possible to do this on a 2D map ? ) \n\nTLDR : [ If anyone is afraid to answer the question due to the thought that I am asking a controversial topic and might start a debate , don't worry I AM GENUINELY ASKING FOR A CLARITY ON THE SUBJECT NOT TRYING TO START A DEBATE WHICH I DONT HAVE TIME / PATIENCE TO ADDRESS OR CLARIFY MY INTENTIONS and ONLY ASKING HERE CAUSE PPL HERE SEEM TO BE MORE EXPERIENCED OR SOMETHING IN THIS FIELD COMPARED TO ME ] \n\nOn a basic note :  I have some experience in C++/ python programming not from a game dev POV but from web app dev POV so understand things technically but not so much on modelling / animation / level design side of things & not looking to develop my own game engine ( for now atleast till I get some familiarity with game development ).\n\nQuestions:\nQ1: So is unity a good choice for this? I heard Unity removed certain plugin's & services no?  Is it still good for stuff like this? Cause unity was first choice based on how optimised it is for small assets.\n\nQ2: What about unreal , how is it good with these kind of maps? Since unreal works best with large assets and mostly optimised for PC.\n\nQ3: Is it possible to use blender to create map & char models and port them later into either unity / unreal engine later for animations?\n\nNot sure on GODOT , just heard about it a while back will need to look into it but if any of u guys have experience with it , mind giving some pointers?",
            "Any tips for starting from a blank canvas so to speak? I've followed tutorial projects, but they tell you exactly what to do. Now that I'm looking to start my own game, the \"blank canvas\" effect has me stuck where I don't even know where to start.\n\n  \nI'm assuming this is the initial high entry point learning curve and over time that initial barrier will lower and I can prototype ideas quickly like I see folks do on YouTube, in game jams, etc. But for now, I'm really stuck. Any tips?",
            "This is a super cool idea honestly."
        ]
    },
    "FEEDBACK MEGATHREAD - Need feedback on a game mechanic, character design, dialogue, artstyle, trailer, store page, etc? Post it here!": {
        "title": "FEEDBACK MEGATHREAD - Need feedback on a game mechanic, character design, dialogue, artstyle, trailer, store page, etc? Post it here!",
        "score": 46,
        "url": "https://www.reddit.com/r/gamedev/comments/1cqt2so/feedback_megathread_need_feedback_on_a_game/",
        "content": "Since the weekly threads aren't around anymore but people have still requested feedback threads we're going to try a megathread just like with the beginner megathread that's worked out fairly well.\n\n&nbsp;\n\n### RULES:\n\n- **Leave feedback for others after requesting feedback for yourself**, at least for two others if possible otherwise do it later once more comments have showed up.\n\n- Please respect eachother and leave proper feedback as well, short low effort comments will not count.\n\n- Content submitted for feedback must not be asking for money or credentials to be reached.\n\n- Rules against self promotion/show off posts still apply, be specific what you want feedback on.\n\n- This is not a place to post game ideas, for that use r/gameideas\n\nSee also: r/playmygame and r/destroymygame\n\n&nbsp;\n\nAny suggestions for how to improve these megathreads are also welcome, just comment below or send us a mod mail about it.",
        "num_comments": 251,
        "comments": [
            "hey, looking for feedback on my store page [https://store.steampowered.com/app/2640570/Fantasy\\_Senate\\_Simulator/](https://store.steampowered.com/app/2640570/Fantasy_Senate_Simulator/)",
            "Hi, I recently uploaded a [Demo](https://store.steampowered.com/app/2676270/Teo_Dove_Am_Skater_2/) of my skateboarding game to steam. Looking for feedback on controls and also general feedback.\n\nDoes the skater fall down too easily e.g is the game too hard? Is the skater too fast? I want to encourage careful skating.\n\nLink : [https://store.steampowered.com/app/2676270/Teo_Dove_Am_Skater_2/](https://store.steampowered.com/app/2676270/Teo_Dove_Am_Skater_2/)",
            "Feedback Needed: Overall game appearance, concept\n\nHello everyone!\n\n\n\nI'm making a game called \"Combat Ace\" that's similar to \"Ace Combat\".\n\nAt the prototype stage, I'm focusing on gameplay and physical behavior, and it has the following features:\n\n- Capable allies (they can shoot down enemies and help you play)\n\n- Capable enemies (enemies help each other and are tough)\n\n- Realistic behavior (enemies avoid missiles honestly)\n\n\n\nI look forward to your suggestions and opinions on improvements and additional features!\n\nThanks :)\n\n\n\nLink: [https://www.youtube.com/watch?v=U2ihVO7JRzY](https://www.youtube.com/watch?v=U2ihVO7JRzY)",
            "[Have a new trailer for my mobile game based on my kiddo's art!](https://youtu.be/hwWRogQ87uc)",
            "With Next Fest coming up fast I havent updated the store or trailer much in the last few months for my game HardAF.  Trying to figure out best use of my time and would just like to know if there's anything that stands out that needs to be reworked in either.  One big thing I'd like feedback on, alog with the trailer, is the screenshots I'm showing.  The game is a precision pixel art platform game.  Thanks!  \n[HardAF on Steam (steampowered.com)](https://store.steampowered.com/app/2679880/HardAF/)",
            "Hello! New here, and new to development as a whole. I've been experimenting with pixel art, and so far this is my characters animation for unfolding their wings and flying. I don't know why but I'm just not the biggest fan of it. I'm not sure whether its because of my design, or the colours, or what, so I'd appreciate some constructive criticism for it :) Attached is the gif, the 'unfoldings' a bit quick, and also perhaps just the head and depth. Not sure why it looks so small also, will try and figure out a way to make the image bigger so anyone can see it clearer, thank you! [https://pasteboard.co/JXX3U6tWtPbA.gif](https://pasteboard.co/JXX3U6tWtPbA.gif) P.S. I get that art of any sort is practice makes perfect. Just checking that I'm not missing something at my level. It might even be something as simple as needing a greater resolution (was only 32x32)",
            "Just finished a new trailer for my retro-inspired RPG, Starlight Legacy!\n\n[https://www.youtube.com/watch?v=CSnQ1MDml2A&t=1s](https://www.youtube.com/watch?v=CSnQ1MDml2A&t=1s)",
            "Hey! I made my first small game, and I want you to try it and give some feedback. It's short platformer/bullet hell combo that could be fun to play around. I learned lots of things, from making my own character controller to using tile maps and animations. If there's anything off-putting or unintuitive in terms of game design, please let me know! Thanks again!\n\nhttps://oily-razor.itch.io/dungeon-king",
            "Looking for feedback on an intro video for the game I'm working on.  Any pointers, hints, dislikes or hates to share?\n\n  \n[https://www.youtube.com/watch?v=SZwvUjgQW9g](https://www.youtube.com/watch?v=SZwvUjgQW9g)",
            "I'd like some feedback on the marketability of my Steam page. Is it appealing? Do you get what the game is about? Would you wanna play the demo or wishlist it?\n\n[https://store.steampowered.com/app/1304530/SlingAThing/](https://store.steampowered.com/app/1304530/SlingAThing/)"
        ]
    },
    "I just played Monopoly Go for a while and am in shock. This is now the highest grossing digital board game of all time by a wide margin. There are almost no strategic decisions, it's basically candyland. Even the dice are automated as rolling the dice is apparently too tedious.": {
        "title": "I just played Monopoly Go for a while and am in shock. This is now the highest grossing digital board game of all time by a wide margin. There are almost no strategic decisions, it's basically candyland. Even the dice are automated as rolling the dice is apparently too tedious.",
        "score": 271,
        "url": "https://www.reddit.com/r/gamedev/comments/1dlgnmy/i_just_played_monopoly_go_for_a_while_and_am_in/",
        "content": "I've spent years of my life crafting a delicate balance between strategic decisions in our board games and trying to add layers of depth and interaction. This clearly shows that is not what the larger market wants. I understand they have the Monopoly brand and millions in user acquisition money, but the gameplay itself is just abysmal. They already have billions of players that know and love Monopoly rules, and yet they chose to throw those out the window and make a simple copy of coinmaster, rolling dice and earning money. And they are clearly spectacularly successful in doing so. As digital tabletop game designers, how do we process this? Granted this is the casual mobile market and not the hobby gaming market, but I'm still shocked that it is so addictive and profitable while using an IP originally from the hobby gaming world. Is the simple idle game really the pinnacle of mobile board gaming?",
        "num_comments": 95,
        "comments": [
            "Want to know the secret?\n\nIt's a ding ding ding machine. People love that.",
            "Monopoly Go is not a board game and it's not trying to be. It's more of an idle game in the style of Pirate Kings or Coin Master as you say, and it's aimed at an entirely difference audience. It's hard to adopt a lot of board games into a F2P model, which is why they don't do as well on mobile, and tend to be more premium experiences along the lines of Uno or Ticket to Ride.",
            "You deal with it in many ways. Some of them from my experience are below.\n\n- Realize that not only do different people want different things, but they also want different things at different times. Someone who loves deep, complex strategy games may also enjoy some mindless shooter games, idle phone games, etc as well. \n\n- Genres like \"digital board games\" are super wide. The existence of more casual games does not automatically cannibalize the audience for deeper, more complex games. In many cases the opposite can be true, new players are drawn in through casual, easy games and then end up looking for more and growing the audiences of other games. \n\n- Realize that compared to \"all games\" or \"everyone playing games on a phone\" you are in a small niche. This is ok! finding your niche is the best way to be successful as a small developer when you can't complete with the money and reach of large ones. \n\n- Stop worrying about games you are not actually competing with. The indie game movement really started to come into its own when both players and developers stopped looking to it like AAA-lite, and started looking to it for the unique games, stories, and experiences they could provide. \n\n- Stop making blanket assumptions on why things were done. Things like \"Even the dice are automated as rolling the dice is apparently too tedious\" is jumping to a conclusion that almost certainly isn't true, and is designed to paint both the game \\_AND\\_ its players (**many of which likely overlap with your players**) negatively without any substance.",
            "The \"Shut Up and Sit Down\" crew touched on this in a review of Rummiukub. It's the distinction between a game and an activity. Monopoly Go is an activity that is intentionally simple. It's primary goal is to facilitate a group of people enjoying each others company, and it supersedes the goal of creating interesting systems to grapple with.\n\nI think it's a little arrogant to just assume that most people are stupid and so they like stupid games. Rather, I think it's likely that when groups of people get together many/most of them do it to enjoy their company, more so than solve a systems puzzle. And a game that requires too much attention won't give them what they want from the night.",
            "it's not your audience. You and the indie market in general do not exist for them. Heck, these people don't play the AAA, either",
            "Keep in mind, the Monopoly license is also incredibly popular with slot machines. This an entirely different market segment. \n\nMy grandma enjoys Monopoly licensed slot machines but would never play any kind of board game because she's not into any of those aspects of interesting decisions and strategic thinking. People are looking for different things from their games and you just have to be able to put yourself in their shoes somewhat. \n\nThere's absolutely a market for digital board games. Monopoly Go doesn't really represent any of that, one way or another.",
            "Years ago, before smart phones existed, a friend of mine who is no longer with us pitched his game idea to me. He called it Press A, Get Points and the concept was that as you press the A button, you get more points. We would laugh about it at the time but he was completely serious.",
            "its a skinner box",
            "The gameplay isn’t abysmal, it’s brilliant. \n\nWhich means you’ve identified your first problem - you don’t understand the single largest and BY FAR most lucrative segment of the game player market.\n\nSo either don’t try to sell it, or find a niche that thinks like you do.\n\nAnd viewing this massive market disparagingly…honestly…dude, if you want to sell anything to anybody, you need to learn how to read people better. Or partner with someone who can, before you start building.",
            "its a slot machine"
        ]
    },
    "How I Reached 5,000 Wishlists for My First Game on Steam in 6 Months": {
        "title": "How I Reached 5,000 Wishlists for My First Game on Steam in 6 Months",
        "score": 115,
        "url": "https://www.reddit.com/r/gamedev/comments/1dlj3w5/how_i_reached_5000_wishlists_for_my_first_game_on/",
        "content": "Hey everyone!\n\n[Store Page](https://store.steampowered.com/app/2140570/Time_Is_Honey/)\n\nI’m releasing my game in about a month so I decided to share how I managed to get 5000 wishlists for my Steam game Time is Honey in around 6 months!   \n  \nSo Time is Honey is my first ever game on Steam. I’m a solo developer, and when I started, I had no pixel art skills or marketing knowledge I just knew how to develop games and that's it. Everything I know now, I learned while developing my game and doing the Steam page.   \n  \n**Here’s a basic breakdown:**\n\nI began learning marketing from Chris on [howtomarketagame.com](https://howtomarketagame.com). This site has a ton of free stuff, and I highly recommend joining his Discord server (NOT A PROMO I just really enjoy being a part of the community). The community there is incredibly helpful, and you can get responses to your questions in about 10 minutes.  \n  \nIt’s a lifesaver when you’re unsure about Steam or marketing in general.\n\nBefore I explain what I did I would recommend to start your marketing as soon as you have something nice to show.   \n  \nI created my Steam store page and posted my demo a week after publishing it. I earned around 500 wishlists without promotion, but it soon dropped to 1-5 per day.\n\n**Marketing Methods I tried so far**\n\n**Posting on Subreddits**\n\n* I began posting cute and cozy gifs and photos on subreddits like r/pixelart, r/cozygamers, and r/incrementalgames. I noticed that r/pixelart loves interactive posts, like asking users to choose between options. These viral posts gave me around 200-300 wishlists each. Eventually, I started getting around 30 wishlists per day without promotion.\n\n**Steam Festivals**\n\n* I Entered two festivals which gave me a big boost. Farming Festival has gotten me around 700 wishlists, and Steam Next Fest added about 850 wishlists. The only thind I don't like about festivals is that you need some wishlists already to stand out in festivals, but ALWAYS enter them when you can. There are no downsides as far as I know.\n\n**Ads**\n\n* **Facebook/Meta Ads:** Started using Meta ads after hitting 4500 wishlists. They were alright, nothing great but  were expensive, costing around $1-$2 per wishlist. I think ads do not work well with some games.\n* **Twitter...I mean X Ads (Elon give me back my dog he didn't do anything to you):** Not effective for wishlists but good for networking with other developers and publishers. Especially if you dont have a twitter friendly game.\n\n**Contacting YouTubers and Streamers**\n\n* I contacted YouTubers by collecting their emails and sending a nice email with a press kit. Out of 50 emails, I got two big YouTubers, ImCade and InterndotGif, to record videos. I guess its not a lot BUT while this has helped mostly with exposure it didn't help much with wishlists. However, it’s beneficial as it can create a chain reaction if other YouTubers pick it up and start creating more videos about your game :D!\n\nWith these If I can call them strategies, I reached 5000 wishlists in 6 months. My game releases in a month, and I’m hoping for another 500 wishlists by then. My starting goal was 7000, but I’ve adjusted it to 6000, which is still a great achievement for my first game!\n\nI hope this post helps someone out there! If you have any questions, feel free to leave a comment! :3",
        "num_comments": 31,
        "comments": [
            "At least it’s good to see someone admit that those comparison posts are just cheap marketing, but too bad this will just create more of these duplicious posts",
            "Very helpful info, thanks a lot! I've been watching a lot of Chris videos, he's always said about 7000 wishlists to get featured. By the way, your game looks pretty nice, I'll be following your progress.",
            "I saw this a while back and wishlisted it. What won me was the nice UI and unique concept.",
            ">I noticed that [](https://www.reddit.com/r/pixelart/) loves interactive posts, like asking users to choose between options. These viral posts gave me around 200-300 wishlists each. Eventually, I started getting around 30 wishlists per day without promotion.\n\nSmart thing to do when marketing. It makes for a more engaging post when someone asks for my input about something.",
            "Congrats on your marketing and wishlist success! \nThis looks like such a fun game and I love the little propeller hat :)",
            "$1-2 per wishlist isn't terrible. Depending on your price you can print money with that!",
            "Ooh a month! This has been on my wishlist since one of your previous posts and I can’t wait to play! \n\nAppreciate you sharing your experience :)",
            "Congrats 👏!\n\nAt what point during development did you create the Steam Store page? Was the game close to being finished?",
            "Hey, can I ask you what you did to develop pixel art skills? Or did you eventually outsource it? Because your game looks nice and I am currently struggling with maintaining a persistent high quality look.",
            "That's pretty good. I have seen your game before, it looks interesting. But the number of followers seems very low for that many wishlists. I think the quality of the wishlists might be low."
        ]
    },
    "Anyone regrets starting with smaller games?": {
        "title": "Anyone regrets starting with smaller games?",
        "score": 49,
        "url": "https://www.reddit.com/r/gamedev/comments/1dlj5oc/anyone_regrets_starting_with_smaller_games/",
        "content": "The usual advice is to start with the smallest games possible. Does anyone have any examples or personal experience where that was a mistake or you wish you started with a bigger game?",
        "num_comments": 88,
        "comments": [
            "No. Always start with smaller games. You have absolutely nothing to lose.",
            "I’m glad I got that advice, since the first project I finished that wasn’t super small was in fact tough to finish.\n\nToday? That project would be easy and small compared to my current stuff but at the time, it felt like scaling Mount Everest with extra gear.",
            "I've a lot of experience outside gamedev. I've started or been an early founder of several startups that went on to have various levels of success.\n\nSomething I know about myself is I need a 'grand vision' to stay focused. I am self taught in several programming languages but always did so on ambitious projects. And yet, my experience there has taught me one very important lesson: I can't know what I don't know when still learning the relative basics of a new technology. I have to get my hands dirty first.\n\nSo I agree that small games is good advice, if for no other reason than to better understand the limits and capabilities of yourself and the technology you're using.\n\nBut to deal with my impatience and need for a big vision... I am keeping my small projects aligned with that bigger vision. Starting by focusing on a handful of key systems and from that prototyping a vertical slice.\n\nThis ~~why~~ is how I still avoid over investing before I can properly determine scope while also staying aligned with my original vision so I feel like I am on track.",
            "I doubt anyone regrets that, it is great advice. But maybe you don't want to stay at that stage for too long and make your projects bigger over time.",
            "I'll say this and I hope people see it: I did not start with a small game. I went right into 3D multiplayer games. \n\n\nWhich is to say I spent 10 years banging my head against a wall figuring out stuff the hard way. Now I feel fairly comfortable here but I could have gotten here SO MUCH SOONER if I just followed the tried and true practices of starting with small games. \n\n\nDon't do what I did.",
            "you’ll never regret actually making something",
            "I wished I started bigger, so I scoped the project up a level. I vastly prefer scoping up vs scoping down.\n\nMy first completion project was basically Snake, and I added elemental biomes with different challenges and score rewards (\"Gaia Snake\").\n\nThe process taught me a lot.",
            "The regret was opposite for all the abandoned big projects. Always go small.",
            "Start with small games, but make them complete games, with sound effects, music, score boards, pause button, save  and load games, maybe add some extra levels, great UI/UX.\n\nYes, polishing games is not the fun part (at least for me) but it's also an important component. Games must have all the qualities of life features for players to fully enjoy them, and I say this as a hobbyist.",
            "I can't seem to bring myself to make something small.  I'm working on a game that's fairly complicated and am about 9 months in.  I expect another 9 months to completion maybe.  \n\nIt's great, it's coming along, it's beautiful.\n\nThat said, I did try another ambitious project a few years back that taught me a lot, but had to stop because of some art related collaborators.  That was painful, but I'll remake that game after this one from scratch with my new skills. \n\nI think everyone says go small because learning incrementally is safe, you aren't risking as much when something goes wrong.  But if you're willing to risk it, I think you learn as much or more on complex larger games.  \n\nI don't regret going big."
        ]
    }
}