{
    "Daily /r/Games Discussion - Free Talk Friday - June 28, 2024": {
        "title": "Daily /r/Games Discussion - Free Talk Friday - June 28, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/Games/comments/1dqg1ew/daily_rgames_discussion_free_talk_friday_june_28/",
        "content": "It's F-F-Friday, the best day of the week where you can finally get home and play video games all weekend and also, talk about anything not-games in this thread. \n\nJust keep our rules in mind, especially Rule 2. This post is set to sort comments by 'new' on default. \n\n**Obligatory Advertisements**\n\n/r/Games has a Discord server! Feel free to join us and chit-chat about games here: https://discord.gg/zRPaXTn\n\n**Scheduled Discussion Posts** \n\nWEEKLY: [What Have You Been Playing?](https://www.reddit.com/r/Games/search?q=author%3AAutoModerator+AND+title%3A%28What+have+you+been+playing%29&restrict_sr=on&sort=new&t=all)\n\nMONDAY: [Thematic Monday](https://www.reddit.com/r/Games/search?q=author%3AAutoModerator+AND+title%3A%28Thematic%29&restrict_sr=on&sort=new&t=all)\n\nWEDNESDAY: [Suggest Me A Game](https://www.reddit.com/r/Games/search?q=author%3AAutoModerator+AND+title%3A%28Suggest%29&restrict_sr=on&sort=new&t=all)\n\nFRIDAY: [Free Talk Friday](https://www.reddit.com/r/Games/search?q=author%3AAutoModerator+AND+title%3A%28Friday%29&restrict_sr=on&sort=new&t=all)",
        "num_comments": 9,
        "comments": [
            "I'm playing through the Ace Attorney trilogy, and I'm on the last game. I'm really enjoying it except I have to admit I'm getting annoyed by the constant reuse of characters. It makes the world very small if all cases involve the same handful of dumbasses",
            "Last three games I finished were: FFVII Rebirth, Like a Dragon Infinite Wealth, and Animal Well. It's really weird to spend months and months finishing two enormous games, and then my next game is over in like 10 hours. That's that, onto the next thing.\n\n(I know there's a ton of post-game and post-post-game stuff but I think I've seen everything I need to.)",
            "I like the influx of creature collecting games we've been getting as of late. I just wish most of them werent roguelikes. Hard to care about actually collecting the creatures when they will be gone in a 10 minute run. Especially when the game includes shinies (or whatever their equivalent is). It just seems like creature collecting and roguelikes are something very counterintuitive",
            "Have you got any examples of games you like? I like collecting things.",
            "We really were out here getting excited for Starfield previews.  I watched them, and got so hyped for years.  I mean, Bethesda does not miss - right?  I even told my wife about how great this game was going to be.  I entertained myself with Outer Worlds while I waited, but I knew the real deal was coming.         \n\n\nWell, it’s been out for a long time now.  And I still haven’t played it.  Everything I read about it makes me want to play it less.  ",
            "Your Weekly /r/games Recap\n\n\n\n**Friday, June 21 - Thursday, June 27, 2024**\n\n###Top 10 Posts\n\n| score | comments | title & link |\n|--|--|--|\n| 2,519  | [1,068 comments](/r/Games/comments/1dnokmn/game_developer_midnight_society_is_terminating/)  | Game Developer Midnight Society is terminating their relationship with co-founder Guy Beahm aka Dr Disrespect|\n| 2,393  | [217 comments](/r/Games/comments/1dp2hfh/hideo_kojima_when_i_had_just_started_my_own/)  | [Hideo Kojima: \"When I had just started my own studio and had nothing, I pitched the DS project to Norman at a sushi restaurant and asked him if he would like to do it with me. He instantly said yes even though I didn't even have a script\"](https://twitter.com/HIDEO_KOJIMA_EN/status/1805997039253356924)|\n| 2,373  | [721 comments](/r/Games/comments/1dp0eaj/starfields_20minute_7_bounty_hunter_quest/)  | `[Review]` [Starfield’s 20-Minute, $7 Bounty Hunter Quest](https://kotaku.com/starfield-vulture-quest-worth-it-review-1851557774)|\n| 1,756  | [470 comments](/r/Games/comments/1do9kcy/eurogamer_sonys_new_playstation_2_emulator_tested/)  | [Eurogamer: Sony's new PlayStation 2 emulator tested - and it's another disappointing effort](https://www.eurogamer.net/digitalfoundry-2024-df-direct-sony-is-wasting-ps5s-emulation-potential)|\n| 1,626  | [245 comments](/r/Games/comments/1docfgk/steam_users_have_spent_19_billion_on_games_theyve/)  | `[Industry News]` [Steam users have spent $19 billion on games they’ve never played](https://www.pcgamesn.com/steam/pile-of-shame)|\n| 1,466  | [661 comments](/r/Games/comments/1dl4ym7/hotly_anticipated_black_myth_wukong_is_delayed_on/)  | `[Industry News]` [Hotly anticipated 'Black Myth: Wukong' is delayed on Xbox for 'optimizations' — and now, Microsoft has responded](https://www.windowscentral.com/gaming/hotly-anticipated-black-myth-wukong-is-delayed-on-xbox-for-optimizations-and-now-microsoft-has-responded)|\n| 1,284  | [256 comments](/r/Games/comments/1dl3ipx/bandai_namco_studios_developer_of_tekken_8_sees/)  | [Bandai Namco Studios, developer of Tekken 8, sees negative annual income for the first time since founding](https://automaton-media.com/en/news/bandai-namco-studios-developer-of-tekken-8-sees-negative-annual-income-for-the-first-time-since-founding/)|\n| 1,282  | [125 comments](/r/Games/comments/1dn257o/war_thunder_developers_community_manager_issues/)  | [War Thunder developer's Community Manager issues apology for accidentally using the explosion from the Space Shuttle Challenger disaster in one of the latest key images](https://forum.warthunder.com/t/noticed-a-little-something/119652/26)|\n| 1,239  | [387 comments](/r/Games/comments/1dlwckm/nintendo_wont_reveal_mario_luigis_new_developer/)  | [Nintendo won’t reveal Mario & Luigi’s new developer, but says ‘original staff’ are invovled](https://www.videogameschronicle.com/news/nintendo-wont-reveal-mario-luigis-new-developer-but-says-original-staff-are-invovled/)|\n| 1,157  | [461 comments](/r/Games/comments/1dp3epk/eurogamer_elden_ring_shadow_of_the_erdtree/)  | [Eurogamer: Elden Ring: Shadow of the Erdtree - long-standing tech issues remain unaddressed](https://www.eurogamer.net/digitalfoundry-2024-elden-ring-shadow-of-the-erdtree-long-standing-tech-issues-have-been-ignored)|\n\n\n&nbsp;\n\n###Top 7 Discussions\n\n| score | comments | title & link |\n|--|--|--|\n| 888  | [1,376 comments](/r/Games/comments/1dotcok/elden_ring_calibration_update_1122/)  | `[Update]` [ELDEN RING - Calibration Update 1.12.2](https://en.bandainamcoent.eu/elden-ring/news/elden-ring-calibration-update-1122)|\n| 1,112  | [1,135 comments](/r/Games/comments/1dm0ohv/elden_ring_shadow_of_the_erdtree_faces_mixed/)  | [Elden Ring Shadow of the Erdtree faces ‘mixed’ Steam rating as players share issues](https://www.pcgamesn.com/elden-ring/shadow-of-the-erdtree-steam-reviews)|\n| 676  | [532 comments](/r/Games/comments/1dmnyzc/a_thread_with_questions_and_answers_about_dragon/)  | [A thread with questions and answers about Dragon Age: The Veilguard from the BioWare Discord &#40;Rook and Character Creator, Story, Companions, Marketing and Release, Gameplay features, Hardware, Accessibility&#41;](https://twitter-thread.com/t/1804341063894929512)|\n| 973  | [494 comments](/r/Games/comments/1dldg4a/avowed_preview_avoweds_creators_on_why_romance/)  | [Avowed Preview - Avowed's Creators On Why Romance Was Considered, But Ultimately Not Included And Skyrim Comparisons - Game Informer](https://www.gameinformer.com/preview/2024/06/20/avoweds-creators-on-why-romance-was-considered-but-ultimately-not-included-and)|\n| 922  | [463 comments](/r/Games/comments/1dpf4m2/donkey_kong_country_returns_hd_is_priced_at_60_usd/)  | [Donkey Kong Country Returns HD is Priced at $60 USD](https://noisypixel.net/donkey-kong-country-returns-hd-price-60-usd/)|\n| 434  | [352 comments](/r/Games/comments/1dp7b88/games_that_teased_the_studios_next_game_ingame/)  | `[Discussion]` Games that teased the studio's next game... in-game?|\n| 772  | [341 comments](/r/Games/comments/1dp0qct/dead_rising_deluxe_remaster_teaser_trailer/)  | `[Trailer]` [Dead Rising Deluxe Remaster Teaser Trailer](https://www.youtube.com/watch?v=xyZ7gagpgsU)|\n\n\n&nbsp;\n\n\n\nIf you would like this roundup sent to your reddit inbox every week [send me a message with the subject 'games'](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=games&message=x). Or if you want a daily roundup, [use the subject 'games daily'](https://www.reddit.com/message/compose?to=subredditsummarybot&subject=games%20daily&message=x). Or send me a chat with either games or games daily.\n\n#####Please let me know if you have suggestions to make this roundup better for /r/games or if there are other subreddits that you think I should post in. I can search for posts based off keywords in the title, URL and flair - sorted by upvotes, \\# of comments, or awards. And I can also find the top comments overall or in specific threads."
        ]
    },
    "Daily /r/Games Discussion - Suggest Me a Game - June 26, 2024": {
        "title": "Daily /r/Games Discussion - Suggest Me a Game - June 26, 2024",
        "score": 8,
        "url": "https://www.reddit.com/r/Games/comments/1douw31/daily_rgames_discussion_suggest_me_a_game_june_26/",
        "content": "/r/Games usually removes suggestion requests that are either too general (eg \"Which PS3 games are the best?\") or too specific/personal (eg \"Should I buy Game A or Game B?\"), so this thread is the place to post any suggestion requests like those, or any other ones that you think wouldn't normally be worth starting a new post about.\n\nThis thread is set to sort comments by 'new' on default. \n\n**Obligatory Advertisements**\n\nIf you want to post requests like this during the rest of the week, please post to other subreddits like /r/gamingsuggestions, /r/ShouldIBuyThisGame, or /r/AskGames instead.\n\n/r/Games has a Discord server! Feel free to join us and chit-chat about games here: https://discord.gg/zRPaXTn\n\n**Scheduled Discussion Posts** \n\nWEEKLY: [What Have You Been Playing?](https://www.reddit.com/r/Games/search?q=author%3AAutoModerator+AND+title%3A%28What+have+you+been+playing%29&restrict_sr=on&sort=new&t=all)\n\nMONDAY: [Thematic Monday](https://www.reddit.com/r/Games/search?q=author%3AAutoModerator+AND+title%3A%28Thematic%29&restrict_sr=on&sort=new&t=all)\n\nWEDNESDAY: [Suggest Me A Game](https://www.reddit.com/r/Games/search?q=author%3AAutoModerator+AND+title%3A%28Suggest%29&restrict_sr=on&sort=new&t=all)\n\nFRIDAY: [Free Talk Friday](https://www.reddit.com/r/Games/search?q=author%3AAutoModerator+AND+title%3A%28Friday%29&restrict_sr=on&sort=new&t=all)",
        "num_comments": 21,
        "comments": [
            "Games for someone who just built their first PC. Preferably co op!",
            "What are some good **highly linear 3D indie platformers**? Specifying indie to help me find more obscure games. I specifically prefer linear games where you just go from point A to point B; for me, \"hallways\" is a good thing when discussing platformers. I prefer the challenge to come from the platforming, not interested in exploration, nonlinear design, or games that are highly based on powerups/combat (so not interested in games like Psychonauts or A Hat In Time).\n\nExamples of what I'm looking for (some obscure indies so check these out if you're interested): Demon Turf: Neon Splash, Frogun, Spark the Electric Jester series.",
            "What are some great **2D shooter games with great bosses**? Can include roguelikes. Exclude space shooters. Can be top-down or sidescrolling run and guns.\n\nExamples of what I'm looking for (also recs if you're interested): Gungeon games, Cuphead, Contra games (and others like Gunstar Heroes), Revita, Star of Providence, Bleed and Bleed 2, Biolab Wars, Biomech Hell, Blazing Chrome.",
            "Anything with combat as good as God Hand? (If I get recommended Sifu one more time I'll laugh)",
            "Try Solve to Survive... it's a web based puzzle game that is a pretty good time kill",
            "Is there a base builder, city builder, automation game that uses RTS controls? Basically is there a game like Age of Empires but is focused on building? Kind of like Banished, I guess, but Banished has too much micromanagement of individual people.",
            "Looking for aRPGs (Diablo, Grim Dawn, etc.) set in a fantasy world that resembles Classical Antiquity (sandalpunk, if you prefer). However, not looking for settings in *our* actual Classical Antiquity world (so not Titan Quest).",
            "How does Horizon's bow and arrow feel? It looks like a gun tbh. I'm looking for bow action that also has a decent drop so you have to compensate. What recent games have good bow and arrow action? Ex. like Far Cry and Crysis series",
            "I'm just casually scrolling this thread and I think most people should just ask these as ChatGPT prompts since they'll get much better answers (if they even get a response here to begin with). Just my 2 cents.",
            "What kind of games/genres are you most interested in, and also what kind are the people you'd be playing co op interested in?"
        ]
    },
    "Upcoming Xbox RPG Avowed features some \"darker, scarier areas\" and \"tonal variety,\" according to directors": {
        "title": "Upcoming Xbox RPG Avowed features some \"darker, scarier areas\" and \"tonal variety,\" according to directors",
        "score": 425,
        "url": "https://www.windowscentral.com/gaming/xbox/upcoming-xbox-rpg-avowed-features-some-darker-scarier-areas-and-tonal-variety-according-to-directors",
        "content": "",
        "num_comments": 197,
        "comments": [
            "I sure hope so. Honestly I adore when there's some genuine variety in maps.  \n  \nYou know those moments where you just stand at a cliff, looking over the horizon and think \"I can't belive this is the same game from the starting area\"? I live for that shit.",
            "Haven't been in a truly \"dark, scary area\" since I first played Oblivion and went into its dungeons/caves. And it was mainly because of its ambient soundtrack.\n\nIt's about time a game of the likes manages to deliver a kinda scary experience tbh.",
            "Why does almost every article about this game always seem to be defensive? That doesn't really speak to well to the consumer looking at your product.",
            "I feel like people are sleeping on this game because they’re still shook that The Outer Worlds wasn’t “New Vegas 2.” Seriously, this game looks insanely promising. Eora is a wonderfully developed world and I’m so excited to get to experience it from a new perspective.\n\nPlus it truly sounds like they’re responding to the criticism from The Outer Worlds. Combat looks like it has a ton more variety, and companions (which were already one of the highlights from TOW) are getting an even stronger focus.",
            "And it needs them because that art style, and this game, looks super generic and forgettable to me. I sing the praises of New Vegas constantly but as for what I have seen of Avowed? It isn't doing anything for me.",
            "Such a bullcrap. From the gameplay bits I saw so far Avowed looks like reskinned Outer Worlds with the stiffest, most generic combat there is. This kind of games are made towards certain focus groups. Its not auteur vision, its a corporate one, and for me its a hard pass.",
            "I am so over this game. It’s not even out yet. Other Worlds was so meh and I feel it in my bones it will be pretty much the same.",
            "I don’t know what it is but I just don’t like any Obsidian games and I’ve played most (aside from NV, I’m not a Fallout guy). They always seem to be the Wish version of games from better studios. The one game I did like was Kotor 2 but even that was an incomplete mess in the end.",
            "I have those moments in dark souls and elden ring. Just a crazy world that has moved on without me, where I am a stranger and see this world around me",
            "That was Horizon: Forbidden West for me. Each biome was incredible and they all felt so distinct from each other."
        ]
    },
    "Sega sees net loss of 6.6 billion yen due to business restructuring in Europe and cancelled games": {
        "title": "Sega sees net loss of 6.6 billion yen due to business restructuring in Europe and cancelled games",
        "score": 1109,
        "url": "https://automaton-media.com/en/news/sega-sees-net-loss-of-6-6-billion-yen-due-to-business-restructuring-in-europe-and-cancelled-games/",
        "content": "",
        "num_comments": 156,
        "comments": [
            "No wonder Creative Assembly did such a deep soul-searching 180 to now be aaaall customer-friendly.\n\nSEGA must have pulled a belt to whip them to shape after Hyenas",
            "Holy cow.. 87% decline in profit. I thought their games sold well this year. Wasnt FM24 the best selling in the series?",
            "6.6 billion *WHAT?* yen *oh..*. So only 41 million in freedom units.",
            "Bums me out, since the only part of Sega that makes games I care about was their European division.\n\nHope Amplitude bounces back, at least. Endless Legend was such a great game.",
            "I remember that during the Wii U era some people were saying that Nintendo should do what Sega did, i.e., leave the console market and focus on making games.",
            "Yo Sega, i just bought Project Diva Mega Mix+ and the Lost Judgment Kaito Files DLC, i'll get Like a Dragon 8 early next month.\n\nGonna grab some SMT stuff later this year, i promise. Just stay in there :)",
            "It sounds like a joke, but I seriously think if they helped out with Shenmue 4 and actually stopped Yu Suzuki from making people look in 1500 drawers for an hour, it would be a legendary comeback.",
            "6.6 billion yen. Aka $40 million. Not a small amount of money. But not nearly as large as the English title implies.",
            "Not sure how related this is but it sure as hell would have helped if Infinite Wealth and P3 Reload didn't release a week apart considering they're both turn based RPGs and why would you give away reload something you have been working on since 2019 with hundreds of staff, on game pass... Microsoft couldn't have given them that much money.",
            "cancelled games? so there was going to be more sonic weird games?"
        ]
    },
    "Konami producer says it would be ‘the dream’ for Kojima to return to Metal Gear": {
        "title": "Konami producer says it would be ‘the dream’ for Kojima to return to Metal Gear",
        "score": 1207,
        "url": "https://www.videogameschronicle.com/news/konami-producer-says-it-would-be-the-dream-for-kojima-to-return-to-metal-gear/",
        "content": "",
        "num_comments": 412,
        "comments": [
            "The producer Noriaki Okamura is a KCEJ / KojiPro veteran that worked with Kojima on the Beatmania console versions, Guitar Freaks console version, Metal Gear, Policenauts, Tokimeki Memorial Drama Series Vol. 1-3 and Zone of the Enders. He also directed and write Zone of the Enders 1 and was the director of Tokimeki Memorial Drama Series: Vol.1 and 2. So he and Kojima likely had a good relationship and worked together from the early 1990s till the release of MGSV in september 2015. He also said that many of the original MGS3 staff is still at konami and involved in MGS Delta Snake Eater like for example creative producer Yuji Korekado who worked on Policenauts, MGS 1/2/3/4/PW/V, MGRR and directed Metal Gear Online in MGS4.",
            "There’s literally no reason for Kojima to go back. Not only does he have his own projects to worry about now, but it should also be okay to let MGS lie dormant. The series is over.",
            "I don't think it would be a terrible thing if Kojima had a consulting role with a MGS spinoff or remake project.\n\nMainline MGS is over and Kojima will never make a full on MGS game again. Nor would Konami ever invest in him like that ever again.",
            "Well, Kojima is not on bad terms with Konami developers. It is only a feud with the executives of Konami.",
            "Kojima has been posting a lot of MGS stuff on his socials lately. Hopefully this means a smoothing out of things. I do not want Kojima back to MGS fully but him giving any form of blessing or suggestions would be great.",
            "Negative benefit to him doing so when he's now in a position to own his work and get mega funding to make it. The last few entries he worked on really felt like bowties to the franchise after going back in time from MGS4's finale.",
            "This cut the rest of the phrases, saying that it's not very realistic and everyone has moved on, and he would like metal gear to be able to continues with the new team.",
            "Yeah, and it would have been a dream to let the creator of Suikoden come back.  And the good Castlevania teams to come back.  And the creator of Goemon to come back.  And the head of DDR to come back.  What's the common denominator in all these cases?  Oh right, Konami management forced them out and then blacklisted them...  It's like Disney stabbing all their creatives in the back, ruining their careers, then wondering why they won't return to make more content for them.",
            "Kojima is working on a new action stealth game. Going by his recent output, he clearly has different sensibilities now as a writer and designer. I think it's for the best that he starts with a new IP since, for the sake of both his creative freedom and preserving MGS' integrity (for better or worse).",
            "Honestly, would Kojima even want that? Does anyone else for that matter? Seems like a step back at this point. I get that Death Stranding isn't everyone's cup of tea, but it's very evident that there's new ideas brewing in that skull of his. I say let the man cook with some new ingredients."
        ]
    }
}