{
    "HOTD S2E2 - Live Episode Discussion": {
        "title": "HOTD S2E2 - Live Episode Discussion",
        "score": 10,
        "url": "https://www.reddit.com/r/gameofthrones/comments/1dn1345/hotd_s2e2_live_episode_discussion/",
        "content": "# S2E2 - Live Episode Discussion\n\nhttps://preview.redd.it/v08yi9n1p48d1.png?width=1688&format=png&auto=webp&s=ba0348953bb358c3bc9c0e47c886d8e0d9d0489b\n\nAir date: June 23, 2024\n\nDiscuss your thoughts on the episode while you watch! After, join the conversation in the Post-Episode Discussion Thread.\n\n* **This thread should include no spoilers for HOTD based on the books or leaks.** Find or make a post tagged \\[Book Spoilers\\] or \\[Leaks\\] if you'd like to discuss.\n* Please read the [Posting Policy](https://www.reddit.com/r/gameofthrones/wiki/posting_policy) before posting and the [Spoiler Guide](https://www.reddit.com/r/gameofthrones/wiki/spoiler_guide) before participating.\n\n[Join us on Discord!](https://discord.gg/gameofthrones)",
        "num_comments": 80,
        "comments": [
            "Was anyone else expecting the baby's head to roll off when the wagon got stuck?  I was bracing myself, thank god they (surprisingly) didn't go that low. Gloomy episode all around",
            "Criston Cole is literal scum.",
            "Cole hand of the king during the day fingers of the queen at night lmao",
            "Anyone else feel like Criston Cole character is just the reverse of Jamie Lannister. Like he cant stop being progressively dehumanizing and doing sneaky shit for his own personal desires?",
            "not the twins fucking dying bruh. I actually liked them goddamn.",
            "The interaction with Hugh and his wife was just brilliant imho. Him tasting the soup and shes already grabbing the salt plate to offer it to him because she knows hes gonna add seasoning. So simple, so human, so real.",
            "bro COLE IS SCUMMMMMMM how is he becoming the hand omg",
            "I just wanna know one thing: who's gonna die, man?",
            "Dog at gallows hoping to see the person who kicked him hanging",
            "Aegon is actually grieving and behaving how most people would with essentially unlimited power. Murder my kid? I go full crazy on the vengence. Can't nail down exactly what nobody did it? Everyone suffers. You can say he is shitty, but pretty much every parent says something along the lines of exactly what he did if they had their kid murdered."
        ]
    },
    "HOTD S2E2 - Post-Episode Discussion": {
        "title": "HOTD S2E2 - Post-Episode Discussion",
        "score": 115,
        "url": "https://www.reddit.com/r/gameofthrones/comments/1dn2cav/hotd_s2e2_postepisode_discussion/",
        "content": "# S2E2 - Post-Episode Discussion\n\nhttps://preview.redd.it/wfdxo5xep48d1.png?width=1688&format=png&auto=webp&s=efb1c5e1a094747a7046099dab1845ec815170d2\n\nAir date: June 23, 2024\n\nDiscuss your thoughts and reactions to the episode you just watched. Did it live up to your expectations? What were your favourite parts? Which characters and actors stole the show? **Please avoid discussing details from the next episode's preview, unless using a spoiler tag.**\n\n* **Turn away now if you aren't caught up on the latest episode!** Open discussion of all officially aired TV events are allowed here.\n* **This thread should include no spoilers for HOTD based on the books or leaks.** Find or make a post tagged \\[Book Spoilers\\] or \\[Leaks\\] if you'd like to discuss.\n* Please read the [Posting Policy](https://www.reddit.com/r/gameofthrones/wiki/posting_policy) before posting and the [Spoiler Guide](https://www.reddit.com/r/gameofthrones/wiki/spoiler_guide) before participating.\n\n[Join us on Discord!](https://discord.gg/gameofthrones)",
        "num_comments": 605,
        "comments": [
            "Otto's face when Allicent tried to add more bullshit onto his shitty day was AMAZING. \n\n\"I do not wish to hear of it.\" 10/10.",
            "Is it me or did anyone else expect the imposter twin realize he made a mistake after killing his brother and simply take over his identity?  Felt that for all of ten seconds",
            "How did they make me like Otto a little more.",
            "Ep 1: A Tragedy of Grief.\n\nEp 2: A Cavalcade of Cock Ups.",
            "Otto Hightower was spitting some absolute heat on Aegon there. Holy shit, straight evisceration.",
            "Ser Criston Cole is the perfect example of failing upwards.",
            "Everyone is so unlikeable\n\nYall some hoes, Ser Erryk has always been and dies likeable.",
            "We got the Cargyll Bowl before I knew I wanted a Cargyll Bowl.\n\nI liked this episode. Moved a little slower and we got to see the acting chops of a lot characters. Halaena and  Aegon in particular.",
            "The common folk are getting face time. I love that for contextual purposes of the pending war. They have a great feel for whats about to go down",
            "I thought it was pretty classic that Aegon was given the option to torture Blood with all of those gnarly tools and maybe get some information but opted for a swing of the mace instead. I feel like the source of chaos will continue to be impulsive decisions made with a lack of information, compounding as we go."
        ]
    },
    "Bronn has to be the funniest character in GoT": {
        "title": "Bronn has to be the funniest character in GoT",
        "score": 279,
        "url": "https://i.redd.it/45byok06ng9d1.jpeg",
        "content": "",
        "num_comments": 21,
        "comments": [
            "He is 100% right and justified. \nAs he said to Jamie and Tyrionn in Winterfell, their ancestors were upjumped cutthroats aswell, every house starts somewhere.\nAlso he was in my opinion the single biggest winner in the entire series. From being a lowlevel sellsword to owning Highgarden, being Lord Paramount of the Reach and the Master of coin on the small council.",
            "To be honest, he is what most of us would have been in that universe if we had set of skills. The guy doesnt have an ulterior motive. Give him more money than the next guy and he will be loyal to you, until someone offers him a castle.",
            "He is indeed a sellsword since dawn of time",
            "He indeed really want his own castle!",
            "I read this in his voice too",
            "I still can't believe Tyrion didn't give him the twins.  It would have been so perfect with the \"Anyone makes you an offer, I'll double it\".",
            "Bravo for meme, and concept. Yes, THIS is why I come here.",
            "Its pretty funny because that is literally how all the British Aristocrats got their land and titles from William the Conqueror, they were mostly just soldiers in his army.",
            "Bronn truly won the game of thrones",
            "Going by Varys riddle, guess the sellsword did not believe in the king, the priest nor the rich man, but in himself."
        ]
    },
    "Who is the worst character in Game of Thrones?": {
        "title": "Who is the worst character in Game of Thrones?",
        "score": 308,
        "url": "https://i.redd.it/l8zpqkyj9g9d1.jpeg",
        "content": "I laugh at the existence of the idea that someone thinks they can change my mind about her. \n\nWho cares about what she did to Tyrion at the end, that's not even why I dislike her. I really only say that to emphasize how it was not what she did but everything she did. She's just a bad character, all the way up to the actor that played her. I'm sorry Sibel Kekilli.\n\nEverything she says is an eye roll. She doesn't make me believe that she doesn't like to talk about her past, but rather, she forces me. \n\n\na quote by her, probably: \"I'M IMPORTANT\"\n",
        "num_comments": 363,
        "comments": [
            "Meryn Trant. I fucking hate his character",
            "Like the most despicable? Either Rast or the Tickler.",
            "Euron, bookwise, is the worst in my opinion.",
            "Shae was exciting at first I still remember the drinking game at the tent but then she turned into this useless character :/ still I like her accent and find her beautiful",
            "Grand Maester Pycelle. Definitely smelled like dead cats.",
            "Elaria Sand. Sand snakes, whatever. Hate all of them",
            "Depends if you mean worst written or most detestable.\nFor worst writing id have to say Arya or Euron for sure, but for detestable its gonna have to easily be Robin Arryn the little shit, damn shame he lived to the end.",
            "Cersei Lannister.  In the books as well.",
            "It pains me but Euron. A perfect cast a perfect character and they fucking ruined it!",
            "Ramsy or cersies. Both as horrible as each other"
        ]
    },
    "She was kinda crazy": {
        "title": "She was kinda crazy",
        "score": 69,
        "url": "https://i.redd.it/kol456admg9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "She was intense man ..",
            "The Greatest Plotters of the Game",
            "The moon door is open now, Lysa",
            "Lysa is such a psycopath eversince",
            "\"Oh Lysa, if only there was someone out there who loved you!\"",
            "More than Kinda......she had that kid hanging of her tit until he was like 10 also....",
            "**Spoiler Warning:** All officially-released show and book content allowed, EXCLUDING FUTURE SPOILERS FOR HOUSE OF THE DRAGON. No leaked information or paparazzi photos of the set. For more info please check the [spoiler guide](/r/gameofthrones/w/spoiler_guide).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gameofthrones) if you have any questions or concerns.*",
            "Kinda is an understatement. She was bat shit crazy. Seriously instead of being multiple bricks short of a full load, she had like 2-3 bricks at best, also obsessed with beyond belief. Delusional doesnt even begin to describe her.",
            "scary and ugly too",
            "Peter!"
        ]
    }
}