{
    "Discussion, News, and Request Thread - week beginning 6/17/24": {
        "title": "Discussion, News, and Request Thread - week beginning 6/17/24",
        "score": 50,
        "url": "https://www.reddit.com/r/GamingLeaksAndRumours/comments/1dhbsud/discussion_news_and_request_thread_week_beginning/",
        "content": "Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics  you want to talk about.\n\n*Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!*\n\nHot Threads of the past week:\n\n* [EpicDB: Several Publisher games are being leaked](https://reddit.com/r/GamingLeaksAndRumours/comments/1ddua4x/epicdb_several_publisher_games_are_being_leaked/)\n* [Midori confesses to be an alternative account ran by MysticDistance](https://reddit.com/r/GamingLeaksAndRumours/comments/1deltzv/midori_confesses_to_be_an_alternative_account_ran/)\n* [Bloodborne “just not happening at the moment”](https://new.reddit.com/r/GamingLeaksAndRumours/comments/1dfe8h4/bloodborne_just_not_happening_at_the_moment/)\n* [First Details on cancelled Disco Elysium Sequel ](https://new.reddit.com/r/GamingLeaksAndRumours/comments/1df2l9z/first_details_on_cancelled_disco_elysium_sequel/)\n* [Files from a cancelled Cyberpunk 2077 expansion leaked on 4chan](https://new.reddit.com/r/GamingLeaksAndRumours/comments/1dg3yxq/files_from_a_cancelled_cyberpunk_2077_expansion/)\n\n# [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39)\n\n# [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "num_comments": 127,
        "comments": [
            "![gif](giphy|MFRwgBq5N4xPUytCB1)\n\nWe're nearing the expected Nintendo Direct...(hopefully?)  \nWhat is everyone's wishlist/prediction for stuff to be shown?",
            "I just hope the Direct is indeed this week. ",
            "I'm tired of so many posts in this sub being meta, about leakers or about leaker drama. This content should go into a dedicated sticky thread.",
            "No Mafia 4 news was pretty soul crushing (not that Im not happy for Civ fans)",
            "Midori's drama was fucking hilarious. Just the fact that a guy was pretending to be a Japanese girl with broken English and there were people simping 'her', and the guy saying he has a boyfriend in order to stop people. 😂 ",
            "Well, it looks like another Midori's leak was wrong. Dragon Quest 3 HD-2D won't be the whole trilogy, they'll sell 1 and 2 as a standalone duology.",
            "I muted this sub and Pyoro's twitter in preparation for the Direct because I wanted to actually be surprised, but I guess that wasn't really necessary lol. \n\nI know it's the point of the sub, but sometimes it's nice for things to not get leaked",
            "GEX better be at the Direct🦎",
            "[deleted]",
            "Happy Father’s Day to all the cool dads on here!"
        ]
    },
    "GLAD Team Recruiting": {
        "title": "GLAD Team Recruiting",
        "score": 77,
        "url": "https://www.reddit.com/r/GamingLeaksAndRumours/comments/1dj0mag/glad_team_recruiting/",
        "content": "Our GLAD Team (Gaming Leaks Accuracy Database) is expanding and looking to get things underway.\n\nIf you are interested in joining the team, please message me either here or add me on Discord. Both usernames are the same.\n\nYou must have a discord to be on the team.\n\n\nYou will voluntarily help us keep accuracy tabs on each leaker that we frequently have on the sub, providing more insight to the community with our automod tier lists.\n\n\nThanks!\n\n-Janitor",
        "num_comments": 0,
        "comments": []
    },
    "Apparently, Pyoro’s source works for Nintendo of Japan": {
        "title": "Apparently, Pyoro’s source works for Nintendo of Japan",
        "score": 540,
        "url": "https://www.reddit.com/r/GamingLeaksAndRumours/comments/1dla2qq/apparently_pyoros_source_works_for_nintendo_of/",
        "content": "https://x.com/nintendeal/status/1804209292343677189?s=46\n\nhttps://www.bloomberg.com/news/newsletters/2024-06-21/rumors-go-dark-as-video-game-leakers-face-a-reckoning\n\nClock seems to be ticking on him. I still very much think he’s just saying shit to try and save face after he pretty much confirmed the belief that he has access to the EShop backend. Because otherwise why would he have gotten that 2D Zelda rumor dead wrong. That just doesn’t check out. Not to mention Nintendo of Japan doesn’t exist. \n\n**EDIT:** He has since made his account private. Something tells me Pyoro might not be sticking around for much longer",
        "num_comments": 234,
        "comments": [
            "#Pyoro is a Tier 2 - Generally Reliable Source as determined by the community.\n\n *To join the GLAD (Gaming Leaks Accuracy Database) Team and help us track leaker accuracy, please DM \"Spheromancer\" on Reddit or Discord.*\n\n *To contribute to the community reliability rankings, please take the*  **[Community Reliability Poll](https://forms.gle/TU5Q8sTiLDR3cQcE7)**\n\n *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)**\n  \n *These statistics will be updated weekly. Last update: 2/11/24*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
            "In a now deleted tweet he said he didn’t know his responses would be included in the journalist’s report ☠️ ☠️ ☠️",
            "Nintendo cleaning house before they are ready to announce Switch successor lmao",
            "his source is dead now",
            "This is kinda like the Wizard of Oz if the Wizard had *some* actual powers but it was like making grass grow at will up until 4 feet or some shit",
            "He may have speed up the clock by accidently helping Nintendo narrowing where his source is lol.",
            "It's ogre",
            "His source is getting sent to a CIA black site as we speak RIP",
            "Been some wild weeks for the videogame leaking scene lol",
            "Nintendo otw to execute the leakers family in 4K Ultra HD."
        ]
    },
    "RockPaperShotgun: Embracer killed a potential Red Faction: Guerrilla sequel last November": {
        "title": "RockPaperShotgun: Embracer killed a potential Red Faction: Guerrilla sequel last November",
        "score": 475,
        "url": "https://www.reddit.com/r/GamingLeaksAndRumours/comments/1dl46z5/rockpapershotgun_embracer_killed_a_potential_red/",
        "content": "Source: [https://www.rockpapershotgun.com/how-embracers-cuts-killed-a-potential-red-faction-sequel-and-gutted-a-promising-studio](https://www.rockpapershotgun.com/how-embracers-cuts-killed-a-potential-red-faction-sequel-and-gutted-a-promising-studio)\n\nEntire article is well worth a read with much more detail and information but here are some very brief notes:\n\n* Internally known as \"Project White\"\n* Was being pitched by Fishlabs, developers of the space combat game Chorus and was described as a \"visual prototype\"\n* The \"basic ambition\" was to create something similar to Red Faction: Guerrilla, would have ignored Red Faction: Armageddon.\n* \"Set 100 years after Guerrilla on a more terraformed and colourful Martian world map of similar size to the previous game's world, featuring new and redesigned locations. There were plans for a female protagonist, who would once again take part in an underground workers revolution. There would likely have been a range of factions, from predatory corporations to homegrown Martian communities, with whom you might have had to forge alliances to complete your objectives.\"\n* \"While the game was envisaged as a \"safe sequel\" with a familiar emphasis on wrecking buildings, members of the Project White team also wanted to create a more open-ended play experience - closer to an immersive sim, perhaps, with opportunities for stealthy infiltration and player disguises alongside vehicle customisation. There were pie-in-the-sky aspirations to create an extremely reactive setting with dynamic dialogue, in which characters would comment on your methods of completing quests.\"\n* The internal vote to greenlight the project was 50-50, so it was immediately cancelled and the Fishlabs leaders were told to \"lay almost everyone not attached to an active project off\"",
        "num_comments": 78,
        "comments": [
            "i just miss games with destructive environments.",
            "Any embracer news just makes me pissed off lol. One of the worst things in gaming is these idiots",
            "> Embracer turned down a new Red Faction.\n\nGod damn it.\n\n> That would have ignored Red Faction: Armageddon.\n\n**MOTHERFUCKER!**",
            "I just want to be happy man..",
            "It was a pitch. It wasn’t in development. They pitched a Red Faction sequel and it got turned down. That is what pitching is. There are plenty of games that gets turned down in that stage, that’s the whole point of pitching.\n\nI read the article and it’s a bit clickbaity. Pitches gets turned down all the time. Ragebaiting over that is a bit weird.\n\nIt’s not like they cancelled a game in the middle of development…",
            "First the news that the Saints Row reboot was supposed to have the original cast, but Deep Silver didn't think it would be popular so we got the new cast instead.\n\nAnd now this news.\n\nSaints Row and Red Faction Guerilla were some of my favorite games from the 360/PS3 gen. And so to think we were decently close to getting a true and honest attempt to revive both so close together, but both attempts were sabotaged, is just depressing.",
            "Man fuck Embracer, I don't even want to think about how many potentially great games they have killed. The thought bums me out.",
            "One day I'll see some news regarding Embracer that'll actually make me happy",
            ">Was being pitched by Fishlabs, developers of the space combat game Chorus and was described as a \"visual prototype\"\n\nBit of a side-topic but I really liked Chorus (or \"Chorvs\" as it is appeared to be stylistically spelled). Runs really well on lower spec hardware like handheld PCs, too. Played most of the game on my ROG Ally through Game Pass some time last year. Really scratched my itch for a Star Fox \"All Range Mode\" style dogfighting game, and it had some really surprisingly interesting worldbuilding and writing. Would have loved to see what they'd do with Red Faction.",
            "Embracer, the serial killer of video-games"
        ]
    },
    "V Scooper - NetherRealm is exploring to make an spin-off for one of their titles": {
        "title": "V Scooper - NetherRealm is exploring to make an spin-off for one of their titles",
        "score": 151,
        "url": "https://www.reddit.com/r/GamingLeaksAndRumours/comments/1dlc0to/v_scooper_netherrealm_is_exploring_to_make_an/",
        "content": "\"Take it cautiously, it's too early but its what I've been hearing. NetherRealm is reportedly exploring an Action-Adventure mode or spin off for one of their titles. Most likely for MK, but Injustice might not be too far behind. We'll see how it all plays out\"\n\n[https://twitter.com/thevscooper/status/1804227788859412529](https://twitter.com/thevscooper/status/1804227788859412529)",
        "num_comments": 84,
        "comments": [
            "Shaolin Monks 2 or I commit self fatality",
            "Ed has talked about trying to convince Warner Brothers for YEARS to make a spin off of Mortal Kombat (mostly Shaolin Monks 2/remake/remaster anything really), and they always blew off their pitches. Hopefully something actually got through to WB this time",
            "Finally! I always wanted mortal kombat as an action adventure game. I love everything about the MK universe but just not into fighiting games.",
            "Motor Kombat let's go",
            "Mythologies Sun-Zero 2 here we come",
            "SPECIAL FORCES 2",
            "Oh please be in the vein of Shaolin Monks! I love the MK universe but am not always in the mood to go hard on a fighting style game.",
            "We need a Deception Konquest mode like game or spin off mode.",
            "How reliable is V Scooper? If highly, I think will post it in one very specific sub (lol)",
            "Shaolin Monks Remaster and Shaolin Monks 2 is the dream. \n\nA full-fledged Armageddon-style campaign could also be a lot of fun too."
        ]
    }
}