{
    "E key split into half. Anything I can do without sending laptop to service? ": {
        "title": "E key split into half. Anything I can do without sending laptop to service? ",
        "score": 45,
        "url": "https://i.redd.it/6z0kw9nydg9d1.jpeg",
        "content": "",
        "num_comments": 57,
        "comments": [
            "Search for an aftermarket key",
            "Duck Tape with a black e from a sharpie",
            "Your a heavy user how the hell did it break across .",
            "Do you smash your keyboard? It's just not the e key that's damaged, if you look closely",
            "Take care of your shit hoooly",
            "Dafuq u was doin with the damn key?",
            "Replace the whole keyboard man, look like your keyboard has been damaged",
            "Order a replacement on eBay and well diy that replacement, I did that with my key too",
            "Never in all my life seen a keyboard this bashed up.\n\nThems is rager hands",
            "Guys, bro just needs us to vouch that he needs a new laptop. He needs to show this thread to his girl.\n\nTime for a new laptop bro, 100%"
        ]
    },
    "Finalized my Gaming Setup": {
        "title": "Finalized my Gaming Setup",
        "score": 68,
        "url": "https://i.redd.it/p53gq6zlxd9d1.jpeg",
        "content": "",
        "num_comments": 9,
        "comments": [
            "That's one way to mount your monitor stand on a gimbal",
            "And yes i do plan on getting a proper monitor stand, I spent all my budget on the laptop cooler",
            "Very nice, want to have a setup similar to this once my tower isn't worth upgrading any longer.\n\nI am a relatively old dude, never thought I would ever use a laptop in general, let alone for gaming, but the performance to price ratio is hard to argue with IF you want/need some portability.",
            "Gigabyte G5, perfectly balanced for price-perf ratio. Enjoy!",
            "I had the same mouse lasted for years lol",
            "Gotta a good deal on it too because it was open box",
            "what cooler/stand is this?",
            "IETS GT500 on Amazon",
            "Does the job"
        ]
    },
    "the thing i do to make my laptop 3-5 celcius cooler": {
        "title": "the thing i do to make my laptop 3-5 celcius cooler",
        "score": 454,
        "url": "https://www.reddit.com/gallery/1dqhfjn",
        "content": "",
        "num_comments": 175,
        "comments": [
            "This definitely deserves the NSFW tag and may God help us all",
            "I think you only need to put a hole where the fans are.",
            "Instead, a compressor-type fan base would have worked better, which would have forced more air into the device.",
            "If you have done this much, can you somehow attach a pc cooler to the cpu? Or maybe attach the cooler on top of the vapur pipes?",
            "As much as I really wanted to say this, this may NOT help your laptop cool.  \nAnother method is repasting the laptop which does the job, or get a laptop cooling pad.",
            ".. that's pretty fucking stupid... and I'm talking about the design of the laptop's vent locations.\n\nOP, next time you feel the need to do this, take the back plate off, circle where the intakes are and then use a holesaw with some steel mesh.",
            "Why not put it in water to take it all the way to 10-25 Celsius cooler",
            "Wtf is wrong with you?",
            "Now thats what I call under engineered",
            "Remove heatsink, the plate that make contact with CPU and CPU, sand with 2000 grind sand paper, and use polish compunt to make a mirrow like finish, use artic MX4 thermal compunt, that makes me reduce 8 to 10 degrees on my gamign laptop"
        ]
    },
    "OLED laptops": {
        "title": "OLED laptops",
        "score": 3,
        "url": "https://www.reddit.com/r/GamingLaptops/comments/1drb8d4/oled_laptops/",
        "content": "I really want to purchase a gaming laptop this weekend. I'm looking at the rog strix scar 18 with the nebula display and I'm also looking at the rog zephyrus with the OLED display. Of the two laptops which one has the better display? The reason I'm asking is I can't see them anywhere as I live in an area that only has one Best buy. I have an LG C2 monitor on my desktop and I absolutely love oled. Any help would be appreciated as I want to make a purchase today.",
        "num_comments": 1,
        "comments": [
            "can you put the link of those two so we can see the specs on them two gaming laptops?"
        ]
    },
    "Should I get this?": {
        "title": "Should I get this?",
        "score": 10,
        "url": "https://i.redd.it/4t4pl1alkg9d1.jpeg",
        "content": "I play a lot of game(mostly fps games) and my current 60hz msi laptop with 1050ti which I have been using for 4 years while in uni hasn’t been able to let me enjoy gaming. Especially csgo, literally unplayable. I read a lot that it’s better to get 4060 but this is my maximum budget so that’s not happening. I’m wondering if is this what i should go for or is there any other laptops i should consider as well. Also it would be nice to see some reviews on this as well.",
        "num_comments": 24,
        "comments": [
            "I actually got this one recently and i can say for the price compared to some other gaming laptops its well worth the price. Just as an example the other day i booted up valorant and the frame rate didnt go below 300 fps. I personally think its a very good investment",
            "Dude, I also live in Malaysia. And do not get any laptops from Shopee unless its from an official page. I am soon about to buy a new gaming laptop as well but I am going to order it directly from Asus Malaysia website. And as for Lenovo, I was checking this model in morning and this variant does not exist on Lenovo Malaysia website.",
            "Hey just wan to tell you at least buy from lazada if you're in Malaysia, but this shopee page seems to have wrong specs I am scared that you will get a 3050 version instead. Aph9 should have ryzen cpu instead of Intel chip",
            "12GBs of ram is a bit low for a gaming build, youd want at least 16GBs. You can always upgrade it, but if you buy it from a virtual shop on Shopee with no known locations im not sure how you can upgrade its ram without voiding the warranty.\n\nI bought mine face to face and they guarantee they can add ram and ssd at anytime while still ensuring the warranty on the device",
            "I personally wouldn't buy the LOQ series. Too many motherboard dead issues I myself have seen 3",
            "Ahh thats greatt thankss for that",
            "Probably sold out on lenovo's website",
            "The shop seems legit and has a high count of sales and ratings, this one only has 2 sold cause i think it was reposted since i saved a similar one from the same shop and that had hundreds sold and good ratings before if i recalled properly but it was unavailable/deleted. Nevertheless we can never be too sure also so i will be careful thankss!",
            "Truee i did read about that too, thanks for the validation!",
            "I did research on this and apparently it only affects the 13-14th gen hx not the 12th, but im not too sure about it."
        ]
    }
}