{
    "Mythic Map - Search Games by Similarity": {
        "title": "Mythic Map - Search Games by Similarity",
        "score": 383,
        "url": "https://www.reddit.com/r/gamingsuggestions/comments/z0h1zh/mythic_map_search_games_by_similarity/",
        "content": "[Here](https://www.mythicmap.com) is the website.\n\nObservation: I have asked for permission to make this post.\n\nMythic Map is a website that suggests games based on similarity.\nMy goal is to help people find meaningful game suggestions while increasing the visibility of the great games out there.\n\n~~Currently it only supports Steam games. This will change in the future (probably).~~\n\nEdit (02/08/2023): Things have been sorted out and from now on I will be adding non-Steam games -hopefully- daily. Some switch games are in there now, like Zeldas and Pokemons.\n\nIt also checks daily for what is currently on sale on steam (some sales might be missing \\- if I check at 8AM and a sale spawns at 4PM, the website will only be aware of the new sale the next day). I might try adding other sales sources in the future.\n\nAlso, some suggestions might be a little strange, but keep in mind that different players might be looking for different traits in games, so I have to cast a broad net. An example is Skyrim, where a good portion of the suggestions are not open world RPGs, but instead are games that have a big modding/user created content community. \nStill, if you feel a game is missing or is completely out of place, do not hesitate to tell me about it \\- you can send me an email at [mythicmap.dev@gmail.com](mailto:mythicmap.dev@gmail.com) or maybe post about it in the comments.\n\nEdit (05/07/2023): After a couple of months, I have finally implemented most the fixes/features suggested in the comments! The new version might have some bugs or issues, so if you find any, please tell me about it. Same goes for features.\nMeanwhile, I'll keep working on some ideas I have for the website.\n\nEdit (09/14/2023): I thought it would be cool to find games based on other types of entertainment. My tests were done on anime and they ended up being serviceable, but I'm not very happy with the cross-category suggestions and it might take a while until I figure it out, but when I'm done, Mythic Map will start suggesting things based on movies, series and maybe books.\n\nHope it helps!",
        "num_comments": 124,
        "comments": [
            ">Observation: I have asked for permission to make this post.\n\nDidn't know HK-47 from KOTOR had a reddit account.",
            "This guy has asked permission from the mods to post this, and I said it was ok because his site is very relevant to the goals of the subreddit.",
            "Just a heads up, there's also Steampeek.hu which does the same thing",
            "it's pretty good. how does it work? I always hoped someone could build something like the Netflix prize for gaming",
            "the amount of gems i found using this yesterday, thanks! My wishlist doubled💀",
            "this is honestly so amazing. Thank you",
            "How are recommendations generated?",
            "This is cool. I do think the mobile UI could use some work though. Maybe desktop too, but I'm only looking at mobile right now. The suggested search, search target, and search results are presumably three different sections. But they all look the same and blend together. Some visual grouping/separation would be helpful.",
            "Really like this. Would love it if it could cover other platforms in the future. I have wanted a tool like this to find retro games or games for a specific for the longest of time",
            "Observation: your count of steam review is odd\n\nE.g. for Hegemony III: Clash of the Ancients your site says that it is \"80% POSITIVE REVIEWS OUT OF 366\". 80% is correct but 366 is not. Total number of steam reviews is 441, all reviews incl. third parties is 479 and all positive only is 388. So the 366 you give may be only the positive reviews from buyers on steam instead of all reviews (negative + positive)?\n\n&#x200B;\n\nObservation: some games come up twice\n\nE.g. when I've searched for Hegemony 3 the game Total War Shogun 2 comes up twice with identical entries.\n\n&#x200B;\n\nObservation 3: it's not possible to sort by review score\n\nMaybe just add this sort option or even better create a rating like steamdb that factors in both the steam user rating and the number of reviews\n\n&#x200B;\n\nObservation 4 - \"similar\" games not neccessarily very similar at all?\n\nI searched Europa Universalis 4 and the most similar game (ranked by popularity) according to you is Risk of Rain 2, which is... a completely different genre!? I don't know your algorithm but it seems to need a touch here and there."
        ]
    },
    "Annual 2023 Steam Winter Sale Hidden Gems thread": {
        "title": "Annual 2023 Steam Winter Sale Hidden Gems thread",
        "score": 111,
        "url": "https://www.reddit.com/r/gamingsuggestions/comments/18ohxns/annual_2023_steam_winter_sale_hidden_gems_thread/",
        "content": "Welcome to the Hidden Gem thread - Im a big fan of indie games, and always look for under-reviewed games that deserve a second life. This table is all automated based on the list of games I maintain, so let me know if theres more info that would be good to see in it.\n\nUnfortunately, as I found out, something broke between the summer sale and today, so it didn't properly pull out the New games from the list - Hence the delay. I set up the New Game Table manually, so none of the fancy prices, review percentage, or things go with it right now, but I'll update it once I fix the pipeline that gets the data from my database\n\n It now features a neat Table that can be filtered and sorted in all sorts of ways to help with discoverability (since markdown tables are not good for that). [You can find the table here](https://ncdb.prosperitea.net/dashboard/#/nc/view/e7c1fbae-6048-456a-9a2e-8652ba9ffe03)\n\n---\n\n**Big News though** - In the future, this thread will morph into a website of it's own. Ive been building a 'hidden gem discoverability platform' that will let you slice and dice the entire steam catalog by a ton of attributes, including the number of reviews, release dates, steam deck compatibility, genre tags, and more. Its a tool I started to help me find games for this list, so I figured with some polish, I could throw it up for anyone else to use.\n\nI was hoping to launch it today, but the UX is still a WIP. Just be on the watch for it soon ;)\n\n---\n\n**TL:DR** - Out of the 100 games on the Master List there are:\n\n- 3 new games on the list\n\n- 86 on sale\n\n- 64 games over 50% off\n\n- 51 games with a review score of 90% or Higher\n\n- 11 games with Overwhelmingly Positive Reviews\n\n- 7 early access games \n\n- 30 Steam Deck Verified games \n\n- 13 games have demos\n\n\n---\n\n** New Games**\n\n---\n\n\n\nName | Description | Genre | Link\n----|-----------|-----|----\nIslets | I honestly thought I had this on the list since it launched, but Islets is a short (~8 hours) cozy metroidvania that doesn't overstay its welcome. Highly recommend for people looking for a game along those lines. | Metroidvania | https://store.steampowered.com/app/1669420/Islets/\nVoid Stranger | If \"Sokoban + LaMulana\" catches your eye, play this game. It's one of those games you should play without looking anything up about, so I hesitate to say much more. Meta Puzzles await you | Puzzle | https://store.steampowered.com/app/2121980/Void_Stranger/\nChants of Sennaar  | While I had this on my list when it only had a mere 157 reviews on steam, GMTK made a video about it which absolutely exploded its popularity. I have a love of Linguistic based puzzle games (Outer Wilds, Heavens' Vault, this) and had been watching for it to release for months. Glad it got popular enough that the studio can do something else interesting in the future | Puzzle | https://store.steampowered.com/app/1931770/Chants_of_Sennaar/\n\n\n---\n\n**Under 100 Reviews**\n\n---\n| Name  | Description  | Genre  | Released  | Positive Review %  |  Total Reviews | Discount  |  Price | Early Access  | Deck Verification  | Has Demo  |\n|:--|:--|:--|:--|:--|--:|:--|--:|:---|:--|:--|\n| [Alvora Tactics](https://store.steampowered.com/app/643900/)  | The second of three games like Final Fantasy Tactics from a passionate developer  | RPG  | 2017-06-01 | 92%  |  99 | 30% Off  |  6.99 | No  | Unsupported  | No  |\n| [Dungeon Wizards](https://store.steampowered.com/app/1842610/Dungeon_Wizards/)  | If you remember the old Android game 'Dungeon Raid' (R.I.P.), this game is a great recreation of that. Connect adjacent tiles to fight monsters, level up, earn gold, and more in this 'casual puzzle roguelite'.  | Casual  | 2022-02-04 | 94%  |  37 | 50% Off  |  3.49 | No  | No Rating  | No  |\n| [ETHEREAL](https://store.steampowered.com/app/751220/)  | A super trippy 'open world' puzzle game structured like a zelda game. You start flipping between sides of blocks, but it quickly expands.  | Puzzle  | 2019-03-07 | 88%  |  43 | 70% Off  |  2.99 | No  | No Rating  | No  |\n| [NEXT JUMP: Shmup Tactics](https://store.steampowered.com/app/624690/NEXT_JUMP_Shmup_Tactics/)  | A turn based Shoot-em-up, what? Super interesting take on a genre that is basically the antithesis of turn-based  | Strategy  | 2017-04-28 | 75%  |  49 | 50% Off  |  1.99 | No  | No Rating  | No  |\n| [Obscurant](https://store.steampowered.com/app/1465440/Obscurant/)  | An interesting, narritive rpg (?) where the gameplay mechanic is about mimicing the AI's movement/behavior patterns to not get caught as you try to sneak through different areas  | Puzzle  | 2022-04-29 | 100%  |  18 | 67% Off  |  4.94 | No  | No Rating  | No  |\n| [Puzzle Pelago - A Drag & Drop Economy](https://store.steampowered.com/app/1064540/Puzzle_Pelago__A_Drag__Drop_Economy/) | You take each level trying to connect supply chains together using limited space. Levels become more difficult as complex products need more involved supply chains with limited space  | Puzzle  | 2020-04-29 | 84%  |  19 | 50% Off  |  4.99 | No  | No Rating  | No  |\n| [Seals of the Bygone](https://store.steampowered.com/app/1093790/Seals_of_the_Bygone/)  | Co-op survival roguelite thats a pretty clearly inspired by Risk of Rain 1, which is not a bad thing.  | Roguelite  | 2020-03-13 | 88%  |  45 | 40% Off  |  7.79 | Yes  | Playable  | No  |\n| [Slime-san: Superslime Edition](https://store.steampowered.com/app/473530/)  | Supermeatboy meets retro graphics. So sad the community never took off, since the devs released a [Level Creator for it as well](https://store.steampowered.com/app/924130/Slimesan_Creator/)  | Platformer  | 2017-04-07 | 90%  |  42 | 80% Off  |  2.99 | No  | Playable  | Yes  |\n| [Songbringer](https://store.steampowered.com/app/367080/Songbringer/)  | A 'Zelda Roguelite'. Not just dungeons, but the whole world generates each 'run' you play, so its always a different game. If you like Zelda Randomizers, might be worth checking this out.  | Roguelite  | 2017-09-01 | 75%  |  95 | 50% Off  |  9.99 | No  | Verified  | No  |\n| [The Farnese Hercules](https://store.steampowered.com/app/2005290/The_Farnese_Hercules/)  | Unique puzzle game that's inspired by picross, but very very different in execution. You are given a 'block' of material and have to chisel it down based on observations from different angles. Hard to describe, but satisfying and fun once you understand it. Took me the first 3 levels to really get it. | Puzzle  | 2022-10-15 | 100%  |  3 | 50% Off  |  2.49 | No  | No Rating  | No  |\n| [Bots Are Stupid](https://store.steampowered.com/app/1578160/Bots_Are_Stupid/)  | Super Meat-tronics. Superhard platformer, but you don't control the player character. Instead, you program its movement like a zachtronics game. Custom level editor with an online level browser for even more levels after playing.  | Platformer  | 2022-12-15 | 87%  |  64 | 50% Off  |  6.49 | No  | No Rating  | Yes  |\n| [Togges](https://store.steampowered.com/app/1550270/Togges/)  | Puzzle Platformer with a Mario Galaxy Aesthetic where you play as a Roomba that can suck and create blocks. All blocks have to touch another, so you need to create paths through the map to explore. A bit weird on controls, but the really long demo gives plenty of time to decide if it's for you.  | Puzzle  | 2022-12-07 | 78%  |  14 | 50% Off  |  9.99 | No  | Playable  | No  |\n| [Treasures of the Aegean](https://store.steampowered.com/app/1607530/Treasures_of_the_Aegean/)  | Outer Wilds Time-loop style parkour metroidvania. I think it controls fun, and some of the puzzles remind of me of La Mulana. You Uncover the map as you loop each time thanks to an ingenious narrative design, and the map is huuge. Almost feels too big at times. One of my recent favorites, for sure  | Platformer  | 2021-11-11 | 92%  |  40 | 60% Off  |  7.99 | No  | Verified  | Yes  |\n| [DIG - Deep In Galaxies](https://store.steampowered.com/app/1442840/DIG__Deep_In_Galaxies/)  | If you crossed Starbound with Noita/Broforce, this is what you might get.  | Roguelite  | 2023-03-08 | 93%  |  75 | 50% Off  |  4.99 | No  | Verified  | No  |\n| [Arto](https://store.steampowered.com/app/1906510/Arto/)  | Hack and Slash built around restoring color to a destitute world. Has some fun mechanic changes along the way.  | Action-Adventure | 2023-05-01 | 82%  |  35 | 50% Off  |  9.99 | No  | Unsupported  | No  |\n\n\n---\n\n**Between 100-500 Reviews**\n\n---\n| Name  | Description  | Genre  | Released  | Positive Review %  |  Total Reviews | Discount  |  Price | Early Access  | Deck Verification  | Has Demo  |\n|:--|:--|:--|:--|:--|--:|:--|--:|:---|:--|:--|\n| [1001 Spikes](https://store.steampowered.com/app/260790/)  | One of the first 'superhard platformers' I remember playing through back on the 3DS. Has a ton of postgame content if you can beat the main game.  | Platformer  | 2014-06-03 | 87%  |  359 | 80% Off  |  2.99 | No  | No Rating  | No  |\n| [Atrio: The Dark Wild](https://store.steampowered.com/app/1125390/Atrio_The_Dark_Wild/)  | Weird, survival + Automation game set in a 'cyberpunk inspired post-apocalyptic' world. Great art direction and style  | Survival  | 2023-01-10 | 85%  |  353 | 20% Off  |  15.99 | No  | Playable  | No  |\n| [Beat Blast](https://store.steampowered.com/app/1072640/)  | You equip items you get onto a 'beat bar' which activates in sequence to the beat of the music where each row has a different attack. The dev has a web demo up on his site as well.  | Roguelite  | 2021-08-25 | 89%  |  227 | 50% Off  |  5.49 | No  | Verified  | No  |\n| [Blossom Tales: The Sleeping King](https://store.steampowered.com/app/446810/Blossom_Tales_The_Sleeping_King/)  | Classic Legend of Zelda inspired game with some pretty fun puzzles to it. Narritively framed like The Princess Bride, and despite weird controls, one of the better zelda-inspired games Ive played.  | Action-Adventure | 2017-03-28 | 83%  |  326 | 75% Off  |  3.74 | No  | Verified  | No  |\n| [Coin Crypt](https://store.steampowered.com/app/264690/Coin_Crypt/)  | Roguelite Deckbuilder where your 'deck' is a bag of coins you collect and spend through the game. If you've played the board game 'Quacks of Quedlinberg', its similar to that  | Roguelite  | 2014-10-28 | 92%  |  140 | 90% Off  |  0.99 | No  | Verified  | No  |\n| [Cypher](https://store.steampowered.com/app/746710/)  | A first person puzzle game all about cryptography.  | Puzzle  | 2018-02-20 | 89%  |  297 | 70% Off  |  1.49 | No  | Playable  | No  |\n| [Erannorth Chronicles](https://store.steampowered.com/app/1580800/Erannorth_Chronicles/)  | A mix of Slay the Spire and old school sandbox RPG. Instead of Turn Based Combat like Battle Brothers might have, your encounters and inventory are card based. Over 4300 cards, and 2 DLCs which add even more with a 3rd on the way  | RPG  | 2021-09-16 | 90%  |  255 | 75% Off  |  5.24 | No  | Playable  | No  |\n| [Fort Triumph](https://store.steampowered.com/app/612570/)  | Fantasy Xcom with a fully interactable and destructible environment, with a Heroes of Might and Magic overworld and base expansion system  | Strategy  | 2020-04-16 | 77%  |  377 | 75% Off  |  4.99 | No  | Verified  | No  |\n| [Fossil Corner](https://store.steampowered.com/app/1587710/Fossil_Corner/)  | Fun little puzzle game about being a paleontologist and organizing evolutionary timelines of fossils. Super simple, but fun while baked or listening to an audiobook  | Casual  | 2021-06-12 | 98%  |  218 | 50% Off  |  4.99 | No  | No Rating  | No  |\n| [Ikenfell](https://store.steampowered.com/app/854940/)  | A turn based rpg set in a magic school. Lots of charm and heart in the characters. Plus the save points are cats  | RPG  | 2020-10-08 | 93%  |  492 | 70% Off  |  5.99 | No  | Verified  | No  |\n| [Intergalactic Fishing](https://store.steampowered.com/app/949600/)  | No Man's Sky, but with actual depth, and a hell of a lot more fish. Hop to randomly generated planets and craft lures to catch randomly generated and simulated fish.  | Casual  | 2020-04-21 | 97%  |  214 | 67% Off  |  4.94 | No  | Verified  | No  |\n| [Knytt Underground](https://store.steampowered.com/app/248190/)  | A pure exploration based metroidvania platformer with a massive world. No combat to be found here.  | Platformer  | 2013-10-25 | 82%  |  164 | 85% Off  |  1.04 | No  | Playable  | No  |\n| [Linelith](https://store.steampowered.com/app/1923790/Linelith/)  | 'The Witness' style gameplay that opens up with the revelation that you can be a piece too. Not an interesting open world, but \"open\" in the sense of a large level to wander and solve puzzles in.  | Puzzle  | 2022-05-19 | 98%  |  415 | 25% Off  |  2.24 | No  | No Rating  | No  |\n| [Metamorphosis](https://store.steampowered.com/app/1025410/)  | A Kafka~esque adventure puzzle walking sim.  | Walking Sim  | 2020-08-12 | 81%  |  187 | 80% Off  |  4.99 | No  | Verified  | Yes  |\n| [MicroTown](https://store.steampowered.com/app/931270/MicroTown/)  | Casual village building sim with some interesting production chains, while keeping the learning curve low. Great as a 'background game'  | Base Building  | 2019-08-30 | 94%  |  296 | 30% Off  |  6.99 | Yes  | No Rating  | No  |\n| [Popup Dungeon](https://store.steampowered.com/app/349730/)  | A top down dungeon crawler roguelite with absolute freedom of creation tools. Create, or download, custom campaigns, enemies, heroes, skills, and more.  | Roguelite  | 2020-08-12 | 80%  |  485 | 60% Off  |  9.99 | No  | Playable  | No  |\n| [Prodigal](https://store.steampowered.com/app/1393820/)  | A wonderfully done homage to the old Legend of Zelda games, harking back to Oracle of Ages/Seasons on the Game Boy Color  | Action-Adventure | 2020-10-15 | 95%  |  204 | 75% Off  |  3.74 | No  | Playable  | No  |\n| [Recursed](https://store.steampowered.com/app/497780/)  | A puzzle game similar to Baba is You where the rooms themselves are items that you can move inbetween other rooms  | Puzzle  | 2016-09-30 | 97%  |  275 | 75% Off  |  1.99 | No  | No Rating  | No  |\n| [Reignfall](https://store.steampowered.com/app/935930/)  | An wave based RTS where you can drop down and control your 'hero' on the battlefield. No campaign, but earn relics throughout games you can bring into future games.  | Base Building  | 2018-12-10 | 89%  |  200 | 80% Off  |  0.99 | No  | No Rating  | No  |\n| [Sagebrush](https://store.steampowered.com/app/864100/)  | Trapped on a cult compound and you gotta figure out what happened here  | Walking Sim  | 2018-09-18 | 95%  |  162 | 60% Off  |  2.79 | No  | Verified  | No  |\n| [Tenderfoot Tactics](https://store.steampowered.com/app/1061610/)  | Really surreal take combination of open world party RPG and RNG Free turn based tactical combat. Super trippy visuals where the distant landscape shifts around you.  | Strategy  | 2020-10-21 | 82%  |  169 | 75% Off  |  3.74 | No  | No Rating  | No  |\n| [The Dungeon Beneath](https://store.steampowered.com/app/1359120/)  | Quick Autobattler with an awesome soundtrack and plenty of unlocks.  | Strategy  | 2020-10-23 | 87%  |  475 | 60% Off  |  5.99 | No  | Verified  | No  |\n| [TRI: Of Friendship and Madness](https://store.steampowered.com/app/293660/)  | Puzzle Platformer like portal, but you use geometry instead. It rewards you for thinking outside the box too. I built a staircase to get outside the level, and get to the highest point, and found a collectible at the top. The devs know you will try to break it, and they reward you for doing so, instead of shaming you for thinking creatively.  | Puzzle  | 2014-10-09 | 83%  |  218 | 66% Off  |  5.09 | No  | Playable  | No  |\n| [Unexplored 2: The Wayfarer's Legacy](https://store.steampowered.com/app/1095040/Unexplored_2_The_Wayfarers_Legacy/) | This game is the definition of a Gem. A procedurally generated RPG/Roguelite that has Real Depth to the generation. Factions fight as you explore, you influence those worldly changes, and each 'node' on the hexcrawl map you visit is deeply interconnected with itself in unique dungeon generation. If you know what 'OSR RPG' means, PLAY THIS GAME | RPG  | 2022-05-27 | 75%  |  203 | 30% Off  |  13.99 | No  | No Rating  | Yes  |\n| [Wilmot's Warehouse](https://store.steampowered.com/app/839870/)  | Let your inner OCD run rampant as you organize boxes for delivery inside of a warehouse.  | Casual  | 2019-08-29 | 96%  |  296 | 50% Off  |  7.49 | No  | Verified  | No  |\n| [Songbird Symphony](https://store.steampowered.com/app/909820/Songbird_Symphony/)  | A cute metroidvania with 'guitar hero' style rhythm battles.  | Platformer  | 2019-07-25 | 88%  |  190 | 75% Off  |  4.24 | No  | Verified  | Yes  |\n| [Venineth](https://store.steampowered.com/app/976500/Venineth/)  | Marble Madness with a thin, THIN layer of Outer Wilds. It is NOT open world, which is what I expected going into it, but instead you're unlocking 'planets' (levels) in a hub you can explore. Beautiful landscapes and visuals, pretty decent marble physics, and some fun puzzles.  | Puzzle  | 2020-04-16 | 83%  |  177 | 75% Off  |  4.99 | No  | Verified  | No  |\n| [Sensorium](https://store.steampowered.com/app/1307870/Sensorium/)  | Yet another open world puzzle game, but with puzzles themed around the five senses. Has some Obtuse puzzles, but for the most part, has logical puzzles that don't follow Moon Logic  | Puzzle  | 2020-08-28 | 92%  |  133 | 75% Off  |  2.49 | No  | No Rating  | No  |\n| [Ctrl Alt Ego](https://store.steampowered.com/app/1571940/Ctrl_Alt_Ego/)  | Immersive Sim where you play as a disembodied consciousness EGO trying to stay alive on a remote space station. Need I say more? Well, if I have to - It recently got an update with a 'Sandbox Mode' that lets you tweak the world generation and play through it in a new way each time.  | Sandbox  | 2022-07-22 | 96%  |  395 | 35% Off  |  12.99 | No  | No Rating  | Yes  |\n| [Can of Wormholes](https://store.steampowered.com/app/1295320/Can_of_Wormholes/)  | Reminiscent of a top-down Snakebird with an element of exploration to find your puzzles.  | Puzzle  | 2023-03-24 | 99%  |  216 | 20% Off  |  15.99 | No  | Verified  | No  |\n\n\n---\n\n**Between 500 - 1,000 Reviews**\n\n---\n| Name  | Description  | Genre  | Released  | Positive Review %  |  Total Reviews | Discount  |  Price | Early Access  | Deck Verification  | Has Demo  |\n|:--|:--|:--|:--|:--|--:|:--|--:|:---|:--|:--|\n| [3030 Deathwar Redux - A Space Odyssey](https://store.steampowered.com/app/464360/)  | A Space Sim mixed with an old fashion Indiana Jones adventure game, with a sprinkling of cyberpunk atmosphere.  | RPG  | 2017-09-13 | 94%  |  868 | 50% Off  |  7.49 | No  | Playable  | No  |\n| [A Monster's Expedition](https://store.steampowered.com/app/1052990/)  | Open World Puzzle game with immaculate world and puzzle design by the creator. One of my favorite recent plays in a while.  | Puzzle  | 2020-09-10 | 95%  |  588 | 50% Off  |  12.49 | No  | Verified  | No   |\n| [Astronarch](https://store.steampowered.com/app/1234940/Astronarch/)  | Wizard based rogulite autobattler. No 'active battle' system like some auto battlers have, instead all strategy from your positioning and preparations. Bit of an infodump and learning curve, and I wish there were some qol features, but good fun.  | Auto Battler  | 2021-01-22 | 92%  |  550 | 70% Off  |  4.49 | No  | Playable  | No  |\n| [Astrox Imperium](https://store.steampowered.com/app/954870/Astrox_Imperium/)  | EVE Offline. A fun space sim with an 'rts' style way to play. Become a Miner, Trader, Pirate, or whatever else you desire in this sandbox game  | Space Sim  | 2019-03-22 | 90%  |  752 | 60% Off  |  5.99 | Yes  | Playable  | No  |\n| [Battle Chef Brigade Deluxe](https://store.steampowered.com/app/452570/)  | Its like a ghibli movie, with the superb animations, mixed with a monster slaying version of chopped, and a bit of match 3 gameplay for the cooking.  | Action-Adventure | 2017-11-20 | 97%  |  749 | 65% Off  |  6.99 | No  | Verified  | No  |\n| [Brutal Orchestra](https://store.steampowered.com/app/1734320/Brutal_Orchestra/)  | A weird, fleshy dance through purgatory with a unique 'pigment' based battle structure. Fill up your stash of pigments by hitting things, but don't get too much, otherwise you'll start to take damage. Amazing soundtrack to go with it.  | Roguelite  | 2021-12-17 | 97%  |  901 | 20% Off  |  15.99 | No  | Playable  | No  |\n| [Cogmind](https://store.steampowered.com/app/722730/)  | An incredibly polished rogueLIKE all about creating weird builds and swapping out your machine's parts as you come across new ones, and your old ones degrade.  | Roguelike  | 2017-10-16 | 94%  |  924 | 10% Off  |  17.99 | Yes  | Unsupported  | No  |\n| [Dungeonmans](https://store.steampowered.com/app/288120/)  | Another great rogueLIKE that works as a great intro, with some good writing and humor. Has a castle you build up and fill out as you continue dying over and over again, and has options to turn off the persistent map and progress, if you like a more faithful roguelike experience. | Roguelike  | 2014-12-09 | 89%  |  792 | 67% Off  |  4.94 | No  | Unsupported  | No  |\n| [Galactic Mining Corp](https://store.steampowered.com/app/1218500/Galactic_Mining_Corp/)  | A casual mining game that feels like a love letter to old flash games like Motherload. Sequel to GEO that was originally on the list with lots more content, and perfect for second monitor gameplay while you watch or listen to something.  | Casual  | 2021-05-18 | 84%  |  636 | 50% Off  |  6.49 | No  | Playable  | No  |\n| [Horizon's Gate](https://store.steampowered.com/app/1224290/Horizons_Gate/)  | Strategy Sandbox RPG set in the open seas. From the developer of Alvora Tactics, you can skill up your crew in different FF Tactics style jobs, Explore the world, or even earn your living as a trader. Has quite a few interacting systems under the hood  | RPG  | 2020-03-09 | 96%  |  693 | 50% Off  |  9.99 | No  | Playable  | No  |\n| [It Lurks Below](https://store.steampowered.com/app/697550/)  | Survival ARPG from one of the designers of Diablo 2  | Survival  | 2019-05-29 | 84%  |  912 | 80% Off  |  3.99 | No  | Playable  | No  |\n| [Kingsway](https://store.steampowered.com/app/588950/)  | A Medieval game like ftl, where the 'OS' is your way to interact with the world. Monsters pop up as windows in the 'OS' and you have to fight and dodge through the interface itself. Nice retro feels, while having some fun gameplay and possibilities.  | Roguelite  | 2017-07-18 | 91%  |  980 | 68% Off  |  3.19 | No  | Playable  | No  |\n| [Merchant of the Skies](https://store.steampowered.com/app/1040070/)  | Ever wanted to be a trader in a steampunk world of islands floating in the sky, and play a magic flute for a giant carrot? Well you can here! Great trading game that has a ending goal  | Tycoon  | 2020-04-17 | 88%  |  773 | 34% Off  |  9.89 | No  | Verified  | No  |\n| [Odd Realm](https://store.steampowered.com/app/688060/)  | A 'cozy' feeling basebuilder like Rimworld. A bit light on content, but has great sound design and mechanically different factions worth playing.  | Base Building  | 2019-01-10 | 89%  |  576 | 30% Off  |  10.49 | Yes  | Playable  | No  |\n| [SanctuaryRPG: Black Edition](https://store.steampowered.com/app/328760/SanctuaryRPG_Black_Edition/) | Weird, ASCII and Console Driven game similar to old style MUDs (Multi User Dungeon). Has some interesting depth to it with different systems available to work with  | Roguelite  | 2015-02-13 | 92%  |  822 | 89% Off  |  0.87 | No  | Verified  | Yes  |\n| [Snakebird](https://store.steampowered.com/app/357300/)  | A deceptively cute puzzle game that will destroy your brain with its difficult puzzles. They released an easier take on the game with Snakebird Primer  | Puzzle  | 2015-05-04 | 94%  |  615 | 50% Off  |  3.49 | No  | Playable  | No  |\n| [Stellar Tactics](https://store.steampowered.com/app/465490/)  | A Space Sim RPG with xcom esque planetary exploration and combat. Lots of interlocking systems for people who like complex games.  | Space Sim  | 2016-09-22 | 82%  |  952 | 50% Off  |  9.99 | Yes  | Playable  | No  |\n| [Tangledeep](https://store.steampowered.com/app/628770/)  | An easily accessible rogueLIKE for those who want to try out the genre. Lots of systems, including a pet system that lets you capture any enemy as a pet, and a few dlc's that add to the game.  | Roguelike  | 2018-02-01 | 87%  |  582 | 75% Off  |  3.74 | No  | Playable  | No  |\n| [The Magic Circle](https://store.steampowered.com/app/323380/)  | Too perfectionist to finish any endeavor you start? Well now you can feel called out while avoiding that work too!  | Walking Sim  | 2015-07-09 | 91%  |  857 | 65% Off  |  6.99 | No  | Playable  | Yes  |\n| [Vagrus - The Riven Realms](https://store.steampowered.com/app/909660/Vagrus__The_Riven_Realms/)  | Sandbox, Trading RPG based on the devs RPG campaign world. Feels rich and Alive as an open ended RPG experience  | RPG  | 2021-10-05 | 83%  |  780 | 35% Off  |  19.49 | No  | Verified  | No  |\n| [Garden Galaxy](https://store.steampowered.com/app/1970460/Garden_Galaxy/)  | Soothing and Tactile 'desktop garden' style game, where the real gameplay is designing your area how you like it. Just feels nice to play.  | Casual  | 2022-12-14 | 97%  |  703 | 30% Off  |  6.99 | No  | Playable  | Yes  |\n| [Rift Wizard](https://store.steampowered.com/app/1271280/Rift_Wizard/)  | Well known in the Roguelike Areas, its an open information puzzle game as you descend the dungeon while purchasing spells and solving each floor with the resources you have. Reminiscent of Desktop Dungeons  | Roguelike  | 2021-09-01 | 92%  |  775 | 50% Off  |  7.49 | No  | Unsupported  | No  |\n| [Taiji](https://store.steampowered.com/app/1141580/Taiji/)  | A 2d take on \"The Witness\". The puzzles aren't as beautifully crafted as Jonathan Blow would do, but it still elicits the same sense of enjoyment and puzzle solving the witness provided  | Puzzle  | 2022-09-09 | 93%  |  605 | 30% Off  |  17.49 | No  | Verified  | No   |\n| [Bio Prototype](https://store.steampowered.com/app/1498040/Bio_Prototype/)  | A Vampire Survivors style game where you 'program' your attacks out into a skill rotation like Diablo with body parts you pick up through the game  | Casual  | 2023-04-11 | 91%  |  608 | 20% Off  |  3.19 | No  | Verified  | No  |\n\n\n---\n\n**Over 1,000 Reviews**\n*Generally I want to stick to games with less than 1k reviews, but occasionally I find a game so good that I think it deserves to be seen more - Or it's still on the list and got popular (as deserved)*\n\n---\n| Name  | Description  | Genre  | Released  | Positive Review %  |  Total Reviews | Discount  |  Price | Early Access  | Deck Verification  | Has Demo  |\n|:--|:--|:--|:--|:--|--:|:--|--:|:--|:--|:--|\n| [Ara Fell: Enhanced Edition](https://store.steampowered.com/app/440540/)  | An RPGMaker JRPG with great art, memorable characters, and a good story.  | RPG  | 2016-06-02 | 95%  |  1206 | 70% Off  |  4.49 | No  | Playable  | No  |\n| [Blue Fire](https://store.steampowered.com/app/1220150/Blue_Fire/)  | Tight, action 3d platformer with combat like the classic 3d zelda games. Feels a bit limited in movement at first, but once you start to get various 'badges' to upgrade your movement abilities, things start to go wild  | Platformer  | 2021-02-04 | 83%  |  1003 | 66% Off  |  6.79 | No  | Verified  | No  |\n| [Broken Reality](https://store.steampowered.com/app/757480/)  | Ever wanted to explore the 80s vaporwave internet in first person? Nows your chance  | RPG  | 2018-11-29 | 92%  |  1149 | 75% Off  |  3.74 | No  | Playable  | Yes  |\n| [Colony Survival](https://store.steampowered.com/app/366090/)  | A great first person game all about growing and protecting a colony. Use your sla... workers to automate a ton of tasks and start thriving.  | Base Building | 2017-06-16 | 91%  |  4879 | 30% Off  |  17.46 | Yes  | Playable  | No   |\n| [DYSMANTLE](https://store.steampowered.com/app/846770/)  | A Zombie survival game that plays more like an ARPG, with a healthy dose of exploration and mystery. Now out of EA, and even has a DLC which adds a whole new Map to the game  | Survival  | 2021-11-16 | 91%  |  3954 | 60% Off  |  7.99 | No  | Verified  | No  |\n| [Eastshade](https://store.steampowered.com/app/715560/)  | Bob Ross RPG anybody? Paint your way into the humanoid animal people's hearts  | RPG  | 2019-02-13 | 89%  |  3049 | 50% Off  |  12.49 | No  | Playable  | No   |\n| [Element TD 2 - Tower Defense](https://store.steampowered.com/app/1018830/)  | A deep tower defense game straight out of Warcraft 3 from the original devs. Has Solo play and multiple ways to play online: Coop, Duels, and Free For All Survival  | Tower Defense | 2021-04-02 | 91%  |  1339 | 50% Off  |  7.49 | No  | Playable  | No  |\n| [Heaven's Vault](https://store.steampowered.com/app/774201/)  | Man it saddens me that this never got big. Its got the same exploratory feeling that The Outer Wilds left me with. Its linear up until one point, and then you are free to explore wherever you want to go.  | Walking Sim  | 2019-04-16 | 89%  |  1300 | 60% Off  |  9.99 | No  | Verified  | No  |\n| [Hypnospace Outlaw](https://store.steampowered.com/app/844590/)  | An insane nostalgia kick to the early days of the internet. Track down misdeeds on the Hypnospace  | RPG  | 2019-03-12 | 97%  |  2983 | 70% Off  |  5.99 | No  | Playable  | No  |\n| [Impossible Creatures Steam Edition](https://store.steampowered.com/app/324680/) | An old, old RTS where you build units by genetically smashing together creatures. Want to take the camouflage gene from a chameleon and mash it with a whale, so you have an invisible water behemoth? You better believe you can. | Strategy  | 2015-11-11 | 96%  |  1012 | 75% Off  |  2.49 | No  | Unsupported  | No  |\n| [Siralim Ultimate](https://store.steampowered.com/app/1289810/Siralim_Ultimate/) | A sequel to Siralim 3, which was originally on the list. An indie Pokemon/Creature Collector game, but actually innovative and good. Has a ton of endgame content  | RPG  | 2021-12-03 | 93%  |  1121 | 50% Off  |  9.99 | No  | Playable  | No  |\n| [Warsim: The Realm of Aslona](https://store.steampowered.com/app/659540/)  | ASCII kingdom management game with way too many race and characteristic combinations to count.  | Base Building | 2022-12-20 | 97%  |  1100 | 45% Off  |  5.49 | No  | Playable  | No  |\n| [Wildermyth](https://store.steampowered.com/app/763890/)  | An rpg/turn based tactics mashup that does randomly generated characters and story better than anything I've played. If you like dnd, you NEED to play this game. Plus modding tools and transparent devs.  | Strategy  | 2021-06-15 | 95%  |  10244 | 30% Off  |  17.49 | No  | Verified  | No  |\n| [Wuppo: Definitive Edition](https://store.steampowered.com/app/400630/)  | Move over Hollow Knight. You've been dethroned as one of the top modern metroidvanias (okay, not really). Just a pure fun, silly game.  | Platformer  | 2016-09-29 | 93%  |  1021 | 90% Off  |  1.49 | No  | Verified  | Yes  |\n| [Chained Echoes](https://store.steampowered.com/app/1229240/Chained_Echoes/)  | A Solo Devs passion project to create an RPG classic like Chrono Trigger. The RPG equivalent of Stardew Valley in terms of dev passion and quality  | RPG  | 2022-12-08 | 92%  |  3096 | 25% Off  |  18.74 | No  | Verified  | No  |\n| [Lil Gator Game](https://store.steampowered.com/app/1586800/Lil_Gator_Game/)  | Reminds me of A Short Hike. Cute 3d platformer with some rpg elements. Enjoyed demo during a steam fest, but full release has come for it.  | Platformer  | 2022-12-14 | 99%  |  2573 | 40% Off  |  11.99 | No  | Verified  | No  |\n| [Deadlink](https://store.steampowered.com/app/1676130/Deadlink/)  | I generally don't play Early Access games, but pitching this as Doom Eternal - The Roguelite sold me on it immediately. If you want more fast paced, non-stop combat, this is what you want  | Roguelite  | 2023-07-27 | 92%  |  1662 | 30% Off  |  17.49 | No  | Playable  | Yes  |",
        "num_comments": 51,
        "comments": [
            "If you haven't played them, the Shadowrun Returns Trilogy is about $13 for all three right now. Very fun setting, high replay ability. I've beat all of them at least 3 times each with different play styles and still boot it up every once in a while.",
            "Great list! I'll also shout out \n\n[Quadrilla](https://store.steampowered.com/app/2554780), a weird mix of tetris and digging physics. Not perfect by any means (there's some crazy difficulty jumps) but I was addicted to playing its really short runs for about a week.\n\n\n[Ocnus Theory](https://store.steampowered.com/app/2026260/Ocnus_Theory/) Frustratingly few reviews still, I bring this up every chance I get. It's a metroidvania-katamari-darksouls mix (with a heavy dose of Getting Over it) where you'll have to reshape yourself constantly to try and make your way up a vertical world. There are checkpoints (unlike GOI), and the metroidvania-like growth actually works super well with the \"fall back down through the world\" element, since it allows you to gather powerups/collectibles that you couldn't the first time through. A sort of \"accidental backtracking\". It's got programmer art and sound, but is very much still worth playing IMO. \n\nIt left the biggest impression on me of any indie game I played this year.",
            "[Combalt Core](https://store.steampowered.com/app/2179850/Cobalt_Core/) \\- Slay The Spire with intresting space combat and [chill tunes](https://youtu.be/eHmgt7UUa14?feature=shared).   \n[Slipways](https://store.steampowered.com/app/1264280/Slipways/) \\- Single player strategy-puzzle game 'bout tryin' to build  the best empire there is, by linking planets\n\nBoth of 'em are great, if ya wanna wind out post-work",
            "jesus am I ever tired of *roguewhatevers* and cards.",
            "Prodigal really surprised me, there's so much hidden stuff in that game.",
            "Great list - very much looking forward to the proposed hidden gem discoverability platform!\n\nCouldn't help noticing some of the review counts are out of date here e.g. for Ctrl Alt Ego, just to pick a game at random",
            "* [Vision Soft Reset](https://store.steampowered.com/app/1005450/Vision_Soft_Reset/): Time-manipulation metroidvania where your \"save points\" are saves in a timeline (with some upgrades that persist when you jump between them.)  A good game for people who like the idea of tool-assisted speedruns.\n\n* [Conquest of Elysium 5](https://store.steampowered.com/app/1606340/Conquest_of_Elysium_5/): Strategy-RPG with simple mechanics but a ton of depth and a huge amount of replay value.  By the makers of [Dominions](https://store.steampowered.com/app/722060/Dominions_5__Warriors_of_the_Faith/).\n\n* [Wizards and Warlords](https://store.steampowered.com/app/567080/Wizards_and_Warlords/): Magic-focused 4x game loosely inspired by Master of Magic.",
            "I cross-checked my hidden gem post from the [other hidden gems thread](https://www.reddit.com/r/GameDealsMeta/comments/18nt0sj/steam_winter_sale_2023_hidden_gems_thread/), and was surprised that not one of them was on this huge list.  It's such a sad life for hidden gems.  Anyway:\n\n0-100 reviews:\n\n* $3.19 [Devader](https://store.steampowered.com/app/706850/Devader/) (31 reviews) -- intense twin-stick shooter defense roguelite with some unique ideas and lots of weird enemies\n* $3.07 [Twin Ruin](https://store.steampowered.com/app/1094400/Twin_Ruin/) (16 reviews)-- intense twin-stick shooter roguelite with color switching mechanic\n* $3.99 [Gravity Ace](https://store.steampowered.com/app/1003860/Gravity_Ace) (27 reviews) -- mission thruster with good base game and user level building\n* $2.49 [Zeit\\^2](https://store.steampowered.com/app/33390/Zeit/) (26 reviews) -- scrolling shmup with a puzzly time manipulation mechanic (does not use the 3rd party DRM Steam warns about anymore)\n* $4.99 [Yar's Revenge](https://store.steampowered.com/app/99120/Yars_Revenge/) (54 reviews)-- rail shooter with hit chaining named after an old Atari game it's got nothing in common with\n* $10.49 [Cavity Busters](https://store.steampowered.com/app/1084220/Cavity_Busters/) (73 reviews) -- top-down roguelite with a lot of really game-play heavy mechanics and creativity\n* $1.99 [Space Bandit](https://store.steampowered.com/app/1435470/Space_Bandit/) (65 reviews) -- simple but tight and fast top-down shooter roguelite with enemies that act more interestingly *[not on sale but they dropped the base price to $2 sometime, so it's cheap regardless]*\n* $6.79 [Metal Mutation](https://store.steampowered.com/app/1840790/Metal_Mutation/) (50 reviews) -- janky top-down melee roguelite with various abilities (including a strong parry) and layered metaprogression\n* $9.09 [Red Tether](https://store.steampowered.com/app/1714080/RedTether/) (56 reviews) -- weird top-down roguelite where your weapon is launching bungie cables \n* $2.49 [Dracomaton](https://store.steampowered.com/app/2457890/DRACOMATON/) (28 reviews) -- simple, cute little top-down shooter where you pick three modes for your character/moves\n* $0.99 [Galacide](https://store.steampowered.com/app/356790/Galacide/) (31 reviews) -- mind-bending cross of scrolling shmup and Magical Drop style puzzle game\n\n100-500 reviews:\n\n* $4.19 [Jydge](https://store.steampowered.com/app/654050/JYDGE/) (390 reviews) -- top down mission/objective game built on Neon Chrome\n* $9.09 [Quantum Protocol](https://store.steampowered.com/app/1328530/Quantum_Protocol/)(487 reviews) -- deckbuilder with very gamey deck mechanics and programmed enemy cards that tick/respond, so there is no enemy turn, just things that happen as you play\n* $17.99 [Trinity Fusion](https://store.steampowered.com/app/1911360/Trinity_Fusion/) (194 reviews) -- platformer roguelite with some good fighting that just came out of early access but is probably going to get crushed under Oblivion Override and Entropy Effect\n\n500-1,000 reviews:\n\n* $3.74 [Cryptark](https://store.steampowered.com/app/344740/CRYPTARK/) (853 reviews) -- top-down style roguelite with infiltrate and destroy design\n\n1,000+ reviews:\n\n* $3.99 [Fury Unleashed](https://store.steampowered.com/app/465200/Fury_Unleashed/) (1,427 reviews) -- twin-stick style action platformer roguelite with an emphasis on fun, fast play\n* $5.99 [Trials Rising Gold Edition](https://store.steampowered.com/app/641080/Trials_Rising/) (2,228 reviews) -- really rich evolution of 2d platforming with a fantastic user level building community (only buy gold edition because the progression is a lot worse without the expansion levels)\n* $10.49 [Devil Slayer Raksasi](https://store.steampowered.com/app/1016600/Devil_Slayer__Raksasi/) (2,605 reviews) -- top-down melee roguelite with good spacing-oriented fighting, lots of varies enemies, and nice art\n* $8.99 [Brigador](https://store.steampowered.com/app/274500/Brigador_UpArmored_Edition/) (3,924 reviews)-- stompy mecha style mission game with various vehicles and procedural mission generator\n* $7.19 [Nova Drift](https://store.steampowered.com/app/858210/Nova_Drift/) (9,473 reviews) -- thruster-style space shooter roguelite with really rich build system, finally nearing the end of early access\n* $0.99 [One Finger Death Punch](https://store.steampowered.com/app/264200/One_Finger_Death_Punch/) (12,409) -- simple but impressively fun two-button timing-heavy horde fighter (original better than the sequel)",
            "Get persona 5 Royal and Yakuza like a dragon...\n\nThere's half of the new year sorted for you!",
            "[Definitely Sneaky But Not Sneaky](https://store.steampowered.com/app/954010/Definitely_Sneaky_But_Not_Sneaky/) \\- An absolute steal for the price, so much local co-op fun."
        ]
    },
    "Looking for a really addictive/ immersive games that you can really get lost in. ": {
        "title": "Looking for a really addictive/ immersive games that you can really get lost in. ",
        "score": 90,
        "url": "https://www.reddit.com/r/gamingsuggestions/comments/1dlm3fe/looking_for_a_really_addictive_immersive_games/",
        "content": "I have adhd and some games are hard for me to keep my attention for a long time. Lately gaming has seemed mundane. I am open to all genres. Thanks for the recs! ",
        "num_comments": 187,
        "comments": [
            "Kingdom Come Deliverance. Hyper realistic medieval rpg. Sequel is coming out later this year. Check it out.",
            "Factorio has a reputation for being insanely addictive. I almost flunked my first year of college because of that game lol\n\nThey don't call it Cracktorio for nothinf",
            "Shadows of Doubt is a great immersive sim that doesn't get talked about enough.\n\nIt's a full blown noir detective game in a procedurally generated city oozing with atmosphere and charm. \n\nThe main gameplay loop is investigating murders and trying to put the killer behind bars before they have a chance to kill again. \n\nBetween murders you can take on all sorts of odd jobs to get some extra cash that you can spend on tools, upgrades, food, even renting/decorating apartments.\n\nIt's a good game.",
            "Il name some of the only games that pulled me in, in order of best. All of the following, do not look up spoilers, unless you're absolutely 100% stuck.\n\n1) project zomboid. (Main thing about this game is have patience in the beginning and learn as much as you can. One of the best zombie simulators ever made.\n\n2)subnautica. Go in blind. Enjoy the shallows and embrace the deep.\n\n3)grounded. The crafting system will keep your adhd busy. This game is a breath if fresh air.\n\n4)satisfactory and/or factorio. Satisfying is satisfactory. The atomization will scratch itches you didn't know needed scratching. I havent played favorio but it's a top down view instead of 3rd person and many say it's superiority addictiveness.\n\n5)valheim. Amazing survival game where immersion is done beautifully. The food system is excellent, each biome is unique and thrilling..\n\nI realized all of these are survival games for the most part. But they are all amazing picks to dive into (I got to the point where a)moved and got shitty internet so all these games I played offline and b)everyy game I was playing I got bored with. These games made me realize how beautiful and amazing games can be. \n\nBest of luck on your search! Summer sale incoming on steam!!!",
            "A list of some of my favorite games:\n\nGhost of Tsushima\n\nDeath Stranding\n\nThe Witcher 3\n\nCyberpunk 2077\n\nElden Ring\n\nAI: The Somnium Files\n\nBaldurs Gate 3\n\nDivinity Original Sin 2\n\nStray",
            "dwarf fortress. a game made and polished for 20years. infinite replay value.",
            "My recent adhd binge is abiotic factor. It’s basically open world half life 1 with base building.",
            "Red dead redemption 2",
            "Ghosts of Tsushima",
            "Try My Time at Sandrock."
        ]
    },
    "Game that makes you feel ur actually in it ": {
        "title": "Game that makes you feel ur actually in it ",
        "score": 245,
        "url": "https://www.reddit.com/r/gamingsuggestions/comments/1dl9m5p/game_that_makes_you_feel_ur_actually_in_it/",
        "content": "\n\nLooking for a game that makes u feel ur actually in it, it's real. Especially on an emotional factor.\n\nMy favourites for this:\n\n- Cyberpunk 2077 \n- Firewatch ",
        "num_comments": 301,
        "comments": [
            "Red Dead Redemption 2.",
            "*Immersive*, I believe is the term that best describes what your're looking for here.\n\n\nFor a immersive experience, my vote goes to [Subnautica](https://store.steampowered.com/app/264710/Subnautica/).",
            "Skyrim, Bioshock.",
            "Kotor 1 and 2, Kingdom come deliverance, Vampire the masquerade, Mass Effect, Dragon Age, Jade Empire, Baldurs gate",
            "Skyrim",
            "VR games",
            "Metro series.",
            "Id suggest immersive sims like deus ex, prey etc. \nPerosnally the only games i ever got immersed in were the citadel, F.E.A.R, trepang2, S.W.A.T 4, fallen aces (really recent game but i love the atmosphere and story, basically i like to have a reason for doing what im doing), mirrors edge, mgs V, prey, dying light, cyberpunk, deus ex. \n\nMost of these games are pretty personal preference i guess and you might not like them. The citadel has amazing atmosphere and gameplay fitting it along with a pretty scarse story leaving it to your imagination, F.E.A.R is simillar to the citadel but with a more coherent story, trepang2 is basically a spiritual succesor to F.E.A.R, S.W.A.T 4 has amazing atmosphere, fallen aces is a mix of im sim and boomer shooter and it works great tho i think the emotional factor might not be for you, mirrors edge again atmosphere and some parts can get pretty emotional, mgsV is just masterclass. Everything from cinematography, lighting, gameplay, sound design is perfect for immersion. I would recommend to play all games tho personally mgsV can hold up on its own as someone who begun with it. Prey has amazing atmosphere and is overall very immersive, dying light has gameplay, atmosphere, emotional moments so it should be to your liking.\n\nThese explanations might not make sense but im not sure how to explain it. Also as i said its personal. I can see most of these not fitting you. Some games will just click some wont. Personally i hardly find cyberpunk immersive. If you find any of those games interesting let me know so i can try doing a better job at summing them up lol i have some more recommendations but i feel like they are hard to recommend.",
            "Kingdom's Come, Visage, The Forest",
            "outer wilds"
        ]
    },
    "RPGs where you can dual wield pistol + dagger/sword ": {
        "title": "RPGs where you can dual wield pistol + dagger/sword ",
        "score": 3,
        "url": "https://www.reddit.com/r/gamingsuggestions/comments/1dlu2vr/rpgs_where_you_can_dual_wield_pistol_daggersword/",
        "content": "Also hoping for a game with lots of skill tree decisions and lots of RNG loot. Preferably with free/cheap respeccing and build experimentation (so no PoE). \n\naRPG, JRPG, sRPG, Genre doesn't matter too much. Any help is much appreciated!\n",
        "num_comments": 9,
        "comments": [
            "E.Y.E Divine Cybermancy... but it's a weird one lol",
            "Bloodborne haha",
            "Torchlight 2 is older now but would totally fit this\n\nAnother one is Grim Dawn (imo, one of best ARPG ever made) \n\nGuild Wars 2 also features pistols and swords\n\nHero Siege also has these type of weapons",
            "The upcoming game Avowed does what you want. Pillars of Eternity 2 also lets you dual wield pistol+dagger and is a very easy CRPG to pick up on.",
            "Phantasy Star Online 2. You can switch between different loadouts on the fly. There's also offline versions on other consoles but I'm not sure how they play",
            "Mmorpg guild wars 2 , thief profession all the way",
            "Caves of qud. Can wield up to 4 pistols and pretty much an unlimited amout of melee weapons",
            "I’ve seen EYE mentioned twice today in different subs. Truly a blessing.\n\nMany brouzouf to you.",
            "Torchlight 2 is old, but it's solid gold"
        ]
    }
}