{
    "Self Promotion Saturday! Small streamer? Just getting started? Tell us about it here!": {
        "title": "Self Promotion Saturday! Small streamer? Just getting started? Tell us about it here!",
        "score": 2,
        "url": "https://www.reddit.com/r/gaming/comments/1dlov8z/self_promotion_saturday_small_streamer_just/",
        "content": "Use this post to tell us about your YouTube Channel or Twitch stream! Show us your creativity and tell us why we should subscribe. What makes you unique?\n\nPlease note that this thread is NOT for selling or advertising stores. Report any such posts and we'll deal with them. Thanks!\n\nThis thread is posted weekly on Saturdays (adjustments made as needed).\n\nReminder that you must follow our [rules of promotion.](https://www.reddit.com/r/gaming/wiki/index?utm_source=reddit&utm_medium=usertext&utm_name=gaming&utm_content=t5_2qh03#wiki_rule_7.3A_self-promotion)",
        "num_comments": 3,
        "comments": [
            "Hi, I post Minecraft content from ideas and more! \n\nI also love creating funny horror videos! \n\nHere is my YouTube channel: [https://www.youtube.com/channel/UCBC81wmvtDo1U8T5UQyZrNA](https://www.youtube.com/channel/UCBC81wmvtDo1U8T5UQyZrNA)",
            "www.twitch.tv/Bminutes\n\nNintendo and JRPG playthroughs, mostly. I’m starting Pikmin on Saturday 👀"
        ]
    },
    "Oh how the times have changed!": {
        "title": "Oh how the times have changed!",
        "score": 12728,
        "url": "https://i.redd.it/vl1zlb59428d1.png",
        "content": "",
        "num_comments": 626,
        "comments": [
            "And said hot coffee thing was unused content players normally couldn’t access. Just something left in the game’s files that wasn’t deleted. so its just stupid that it caused just a controversy and got slapped with an unnecessary AO rating",
            "I remember at a panel when this was news either Burnie Burns or Gus Sorola of Rooster Teeth basically said that if a kid is smart enough to download the GTA Hot Coffee mod, mod their PS2 and install it they are probably smart enough to go to Google and type in 'titties'.",
            "Mass Effect was getting flak for having sex scenes and romance routes",
            "Wait till this guy hears about leisure suit larry",
            "I may have to pick up a copy of BG3 huh",
            "Eating out that githussy",
            "The difference between hot coffee and bg3 is that the hot coffee was unused and unrated code inside the game. When modders found it in the pc version the esrb board re-evaluated the game and increased its rating. Adding on top of that bad faith news reporting as if the content was accessible by anyone including children(which honestly shouldn't have been playing it in the first place based on the esrb rating) leading to many outraged parents who didn't properly understand the situation.  \n\nWhile BG3 was well just out there with its content... Including bears. Anyone checking the game would reasonably know the content was there.",
            "Shout out to Witcher 3 and the animator who did the sex scenes who left to do 3d porn!",
            "[deleted]",
            "That's what Jack Thompson being disbarred / discredited will do for an industry."
        ]
    },
    "Zero-G PvP shooter that sold 100K in a day is closing after a year—publisher blames developer, developer blames them right back, players just review bomb it": {
        "title": "Zero-G PvP shooter that sold 100K in a day is closing after a year—publisher blames developer, developer blames them right back, players just review bomb it",
        "score": 6877,
        "url": "https://www.pcgamer.com/games/fps/zero-g-pvp-shooter-that-sold-100k-in-a-day-is-closing-after-a-yearpublisher-blames-developer-developer-blames-them-right-back-players-just-review-bomb-it/",
        "content": "",
        "num_comments": 385,
        "comments": [
            "Never heard of it",
            "What did people expect, it was a generic shooter with its only gimmick being zero-g.",
            "[removed]",
            "That fucking sucks.\n\nI was watching this game for a while and I love its aesthetic. Gameplay isn’t anything *THAT* special but it was a lot of fun. Sucks to see it shutting down so soon.",
            "I am so tired of \"Negative Criticism\" being labeled \"review bomb\". Sure as hell sounds like this was deserved feedback.\n\nA review bomb is an astroturfed campaign for generally non-game related reasons; culture war, angry about a launcher, angry it came out on PS5 but not XBox, etc.",
            "If I had a nickel for every time a zero-G next gen shooter bombed because there was nothing else special about it, I would have two nickles.  Which isn't a lot, but it's weird that it happened twice.\n\nEdit: I have a frightening amount of nickels.",
            "Can someone explain the cheating with ping? Is that like a lag switch kinda dealio? Its been awhile and I'm rusty haha",
            "Its just funny that ALL OF THEM see PvP shooters come and go (go fast) but they still wanna try and \"do better\". I tried Marauders, boring crap and even if you kill a squad of 4 guys you start asking yourself \"what for?\" pretty soon. I would prefer cool CoOp stuff. When read PVP I just keep scrolling.",
            "There are just too many PvP shooters. You have to really stand out and steal market share, or just get lucky. You can do everything right in this space and still fail.",
            "So it’s a knock off of Shattered Horizon?"
        ]
    },
    "Gaming in 2005": {
        "title": "Gaming in 2005",
        "score": 3600,
        "url": "https://i.redd.it/mc4714uxsz7d1.jpeg",
        "content": "I just came across this picture. 2005 was 🔥",
        "num_comments": 641,
        "comments": [
            "I wonder if OP was there, in 2005. There were a bunch of cool games (like there are any year), but overall it was a transition year. The Xbox and Playstation 2 were hitting their limits, and the next generation was just around the corner. (Yes, technically the X360 was out in some places, but it hadn't exactly burst onto the scene yet.)\n\nI thought FEAR and Fahrenheit were cool, but it was a (wait for it) Far Cry from the previous year with Halo 2, Half-Life 2, DOOM 3, Unreal Tournament 2004, Grand Theft Auto: San Andreas, Rome: Total War, Burnout 3, World of Warcraft, Chronicles of Riddick, MGS3, Fable, KOTOR2, Gran Turismo 4, Battle for Middle Earth, and at least a dozen more awesome games.",
            "Ah yes, who can forget the icons “50 cent bulletproof” and “NBA 06.” Truly industry changing.",
            "Putting Shadow the Hedgehog in there is wild ngl",
            "Pes 5 > Fifa 06",
            "Needs more Guild Wars.",
            "This ages me",
            "Both 2004 and 2007 have all the other years beat.",
            "MVP baseball 2005 was elite",
            "80% of the titles here are either \"yearly sports\" title or outright ass. Nostalgia for sure, but very few of these are actually great.",
            "Not bad, but I still think 2007 was GOATed."
        ]
    },
    "The stunning art shared by CD Projekt on social media to congratulate Elden Ring on becoming the best reviewed expansion for an RPG!": {
        "title": "The stunning art shared by CD Projekt on social media to congratulate Elden Ring on becoming the best reviewed expansion for an RPG!",
        "score": 8932,
        "url": "https://i.redd.it/rq36mopasx7d1.jpeg",
        "content": "",
        "num_comments": 320,
        "comments": [
            "Its so sweet and professional to see game devs acknowledging and respecting each other for being so awesome. It feels like there is some sort of positive rivalry and competition over quality between them, instead of just sales and numbers and business part of things. I think it's really rare these days.",
            "[They also shared images of developers waiting to access the DLC](https://x.com/witchergame/status/1804130617786761722)\n\nThis whole post is very wholesome",
            "Those Witcher 3 DLC's are truly the gold standard for DLC's",
            "That's ****ing badass. Geralt would love beating the shit out of Mogh",
            "Would love to play as Geralt from The Witcher 3 in Elden Ring. Would be a nice mix",
            "Anybody else getting Darkest Dungeon vibes?",
            "Bowing out with grace as always CD Projekt Red being a class act",
            "She made it. \n\n\nPreem.\n\n\nThat's what counts.\n\n\n🚀🌙 ",
            "Phantom Liberty is one of the greatest DLC of all time.\n\nI play on PC and with Path Trace lighting graphic turn on. One of the greatest gaming experience for me.\n\nCDPR knows how to make great DLCs with Witcher 3 and Cyberpunk.",
            "Does anyone Know artist name?"
        ]
    }
}