{
    "Friendly Friday Thread": {
        "title": "Friendly Friday Thread",
        "score": 3,
        "url": "https://www.reddit.com/r/gardening/comments/1dl0c29/friendly_friday_thread/",
        "content": " This is the Friendly Friday Thread.\n\nNegative or even snarky attitudes are not welcome here. This is a thread to ask questions and hopefully get some friendly advice.\n\nThis format is used in a ton of other subreddits and we think it can work here. Anyway, thanks for participating!\n\nPlease hit the report button if someone is being mean and we'll remove those comments, or the person if necessary.\n\n\\-The [/r/gardening](https://www.reddit.com/r/gardening) mods",
        "num_comments": 34,
        "comments": [
            "Hoping someone might be able to lend some insight into what's going on with this blue salvia. I bought three plants (presumably all the same...) late last summer and planted them in the yard. The existing stems were pretty wimpy and all died/fell off over fall/winter, but they came back surprisingly strong. Now that they're coming in, two look bushy, green, and healthy, while the third is looking pretty sad and wilty. They're all in roughly the same area, probably get the same amount of light, and they all get watered at the same time, more or less the same amount. At first I thought it looked maybe over-watered, so I tried to cut back and kind of watered around it. Didn't really show improvement over a couple days, and I also read that leaves tend to curl up when underwatered, so now I'm watering it again, but it still looks about the same. Soil doesn't seem wet or mushy. Pretty sandy/dry sticking my finger in an inch or so down. So... I dunno.\n\nIs there something more I should be doing? Is it just genetics? Also, the other two salvias have real wide, fat leaves, but this one has narrow, spindly leaves. Genetics again, or maybe I bought a different variety by mistake?\n\nOh, it basically gets full sun and I'm in zone 7b. Low humidity, dry, has been high 80s, low 90s the last couple weeks, brief cold front aside.\n\nhttps://preview.redd.it/o8vthg1y2y7d1.jpeg?width=3072&format=pjpg&auto=webp&s=15bbd98c034289c5228b8b8c4b3ba870a6e6c151",
            "I'm Minnesota zone 4 with a ton of direct sun, and the plants that seem to thrive best in my yard are native sunflowers, coneflowers, and goldenrod. Any suggestions for plants that might enjoy my conditions but that bloom earlier in the season? I'm basically bloomless until mid-July when everything pops off at once",
            "What do I do about all this (maybe) purslane that's emerged in my raised beds? For context, I moved into this new place less than a month ago, and just barely had time to amend the soil of these raised beds and pull approximately five million weeds before planting in them. It seems that my turning over awoke a dormant seed bank, and now we have what looks like purslane all over. Will this be a problem for the plants, including the basil that I planted from seed? And if so, how should I deal with it so that I don't harm the peppers, beans, tomatoes and tomatillos that are in here? Photo for reference, it's quite dense in this bed especially.\n\nhttps://preview.redd.it/j58kxyn1vy7d1.jpeg?width=3024&format=pjpg&auto=webp&s=2f6cd8456480ef108400e56611f1daaa241edee8",
            "posted this comment at the tail end of the last thread, will remove it if it counts as spam \n\nRecently moved into an apartment with fairly large back yard and have been wanting to start gardening so I figured this would be great time to start. I already planted some beans as I read they’re a good choice. I probably should’ve thought about this before but I’m worrying if this area is too shady. So I was wondering did I screw up and plant something that won’t survive? And what suggestions would you guys have for new additions that would fit will into this area\n\nPictures were taken at approximately noon\n\n[https://imgur.com/a/yard-photos-jfFpX0f](https://imgur.com/a/yard-photos-jfFpX0f)\n\nI'm in eastern Pennsylvania, zone 7a",
            "https://preview.redd.it/v1xblbjkjx7d1.jpeg?width=3448&format=pjpg&auto=webp&s=7092c043ba43a4fc402995c76e0de6dac5b9c0b4\n\n~~Can anyone help me identify what kind of eggs are on this leaf? The plant is a river birch and it's located in Southern Maine. They definitely don't look like they're part of the leaf, and there are a ton of them!~~\n\n  \nSolved thanks to u/scotty\\_beams ! \"Those are leaf galls of one of the eriophyid mites (→ Gall and Rust Mites, [Family Eriophyidae](https://www.inaturalist.org/taxa/55584-Eriophyidae))\"",
            "I’m at my wits end with the critters here (Pennsylvania zone 6b). I suspect squirrels and rabbits. They chew some - not all - my lilies, leaving just a stem. Others they dig in the soil/mulch and just leave holes in the ground. They dig up my creeping thyme and irises - apparently just for the fun of it because they aren’t eating anything. I’ve tried those cayenne pepper sprays and sprinkled red pepper flakes, but it doesn’t keep them at bay for long. Is the anything at all that deters them? They’re such jerks! Do I have to build little chicken wire fences around everything?",
            "Does anyone else here struggle with kneeling to weed/plant/mulch/whatever? I am getting the WORST head rushes, even if I'm only squatting down for a minute. I'm fine while squatting but as soon as I stand back up I get slammed with fuzzy head, vision going dark, face feels flushed, and heart beats like crazy. Then like 30 seconds later I'm fine. I don't have any DX medical conditions (tested for POTS 8 years ago, tilt test negative). If anyone else gets this I'd love to know how you garden around it or if you've ignored it, whether it was fine or got worse. I'm afraid I'm going to pass out 🤦🏻‍♀️",
            "Can someone help me get a better understanding of different fertilizers? \n\nI recently got all my plants into pots with a raised bed/container mix that came premixed with some nutrients. The bag said N=0.3% P=0.1% K=0.1%. \n\n  \nI've read that in containers fertilizing every 2 weeks or so is a good idea so that was my plan for this weekend. \n\nI've seen recommendations for a few different brands of things but I'm a bit confused by the NPK.\n\nIn one case, Neptunes Harvest Tomato and Veg solution, the NPK is listed as 2-4-2. Then I looked at Miracle-Gro performance organics edibles mix and the NPK is MUCH higher at 9-4-12. Those are the extremes but other mixes have been 5-7-3, 4-4-4, etc. \n\nMy question is why is there such a wide range here? I don't want to go overboard but I also don't want to under fertilize. \n\nAt this point I think I'm supposed to prioritize the nitrogen to encourage plant growth over flowering (I've got tomatoes, peppers, cucumbers) so I'm just trying to figure out what the best thing I should add is and how best to do it. \n\nThanks!",
            "Could these various sunflowers be dead headed so they’ll grow back or do y’all think they’re too small?\n\nhttps://preview.redd.it/pjtxy2nkrz7d1.jpeg?width=5712&format=pjpg&auto=webp&s=d2d4d325c3bed04bb97078de053f5f644f945a0c",
            "[removed]"
        ]
    },
    "Mentioned to my bf that I needed a trellis for my beans and I came out the next day to find this setup. 🥹 How'd he do? ": {
        "title": "Mentioned to my bf that I needed a trellis for my beans and I came out the next day to find this setup. 🥹 How'd he do? ",
        "score": 3214,
        "url": "https://i.redd.it/geirt1m0ry7d1.jpeg",
        "content": "The front row is okra, back row is beans. \nMade me want to cry I was so happy he did this for me! ",
        "num_comments": 224,
        "comments": [
            "I think you mean your future husband. This relationship is definitely sprouting to be something special!",
            "get him pregnant asap",
            "Looks good.  He wants to impress you.",
            "As a single gardener... marry this man immediately because he cares enough to do this for you <3",
            "Anchored to the ground. The stakes are solid, the spacing is good, the height seems to work.\n\nMarry him. If you want another solid test plant peas next year.\n\nOn secon thougt just marry him.",
            "That's one VERY smart man!",
            "It doesn't matter how he did... he took the time to give you something you wanted! It's amazing! When is the wedding date???",
            "That’s so sweet! I told mine I needed a temporary shade for my tomato plants and he stopped watching TV and went and built me one with drop cloth until I got a real plant shade.\n\nhttps://preview.redd.it/s1nexgoklz7d1.png?width=3809&format=png&auto=webp&s=517a9afdf8dbb2af6cfba06dddd8d795b7943cd9",
            "Yeah idk why this sub is going off script so let me… BREAK UP WITH HIM YESTERDAY!",
            "Best BF. Gold stars."
        ]
    },
    "First time growing Cherokee Purple, anybody know what's going on here?": {
        "title": "First time growing Cherokee Purple, anybody know what's going on here?",
        "score": 842,
        "url": "https://www.reddit.com/gallery/1dlhs7t",
        "content": "I have six plants, the other five look relatively similar to each other and only have one of the big flowers in the middle; this looks like 3 fused together, and I counted 29 flower buds in that cluster around it/them lol.",
        "num_comments": 257,
        "comments": [
            "The flower is fasciated. It's a growth abnormality.\n\nYou will end up with a very interesting tomato.",
            "Almost thought you were growing some sweet kush from that first picture",
            "OP if you can afford it, take off the rest of the blooms from that plant and let it focus its energy on that mammoth specimen.",
            "you will get the ultimate legion tomato out of that.",
            "Flowers are fused. This happens a lot in beefsteak type tomatoes. That's part of the reason they can grow so big. Sometimes you get multiple fruit fused into one. I don't think I've seen an example that extreme before though. It would be interesting to see what turns out of that, but it would probably be a drain on the plant and the rest of the fruit.",
            "Check out r/fasciation!",
            "Now you just need Cthulhu to come pollinate it",
            "You have to post what it looks like!",
            "I am fascinated by this tomato fascination!",
            "Ooooh I can’t wait to see. I couldn’t grow Cherokee purples for shit last year and now you’re going to have a giant alien baby one."
        ]
    },
    "Look at them. ": {
        "title": "Look at them. ",
        "score": 1560,
        "url": "https://v.redd.it/x2q8lmif1z7d1",
        "content": "Loving the magnolia! ",
        "num_comments": 61,
        "comments": [
            "My favorite is the bee on the bottom left who gets in there, flips upside down and starts rolling around 😆 reminds me of my little dog when he finds something stinky to roll around in outside",
            "It's crazy that Magnolias are older than bees. They developed the large waxy leaves and petals so that they could be pollinated by beetles before bees existed.",
            "Love seeing some reasons why ancient things like a Magnolia are still around",
            "I too would like to roll around in a magnolia flower",
            "I can smell Memaw from here!\n\nSide note I have a love hate with my magnolia tree. It’s beautiful but so messy: first it’s the leafs, then the flowers, then more leaves and then the seed pods.",
            "Absolutely lost in the sauce.",
            "Crackheads",
            "Last bee gets freaky",
            "Par-tay!!  Bees are the best.",
            "I’m so jealous! My area is too populated, so I might see an average of one bee a week :(\n\nAt least there are plenty of butterflies around"
        ]
    },
    "Little snack tray from my berry garden": {
        "title": "Little snack tray from my berry garden",
        "score": 52,
        "url": "https://i.redd.it/iqwbv47eg48d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Can you name them all please!",
            "This looks so well curated!!!",
            "Clockwise: Black raspberry, yellow raspberry, tayberry, blackberry, polarberry, purple raspberry and then in the middle: red currant, jostaberry, black currant and wineberry."
        ]
    }
}