{
    "Reminder: these posts are a SCAM. they seem to be attacking this sub again relentlessly, so please report it. Thanks": {
        "title": "Reminder: these posts are a SCAM. they seem to be attacking this sub again relentlessly, so please report it. Thanks",
        "score": 1402,
        "url": "https://i.redd.it/gbnfbtuhig0a1.jpg",
        "content": "",
        "num_comments": 64,
        "comments": [
            "And the bots are getting smart. They are blocking any account that calls it out for being a scam and then are hammering them with downvotes. In one of them a few days ago me and another poster had about 80 downvotes within 5 minutes.",
            "Usual chain of action is \n\nReport >Spam >Harmful Bots >Block Account\n\nSome of them also try and disguise themselves as real users with karma by reposting popular images to farm karma so they don't immediately get flagged as suspicious. \n\nYou can usually tell because all of their \"activity\" is done around the same time and there will be a massive gap between their \"activity\" and when they begin posting these t-shirt scams.",
            "i didn't realize those posts were a scam cause they never have a link selling them. but i guess i've only seen like 2 of them and with the duck version. those shirts are everywhere now....do they just hope people somehow buy it from their store?",
            "How does the scam work?",
            "Can you pin this post? When the bots upvote their post to be at the top of the subreddit, it won't help them so much if it's immediately below a pinned \"Warning: SCAM\" post.",
            "Also PSA: check. every. comment. \n\nOn a thread recently I counted 9 bots replying to a bot who had posted this image, with the OP bot dropping a link, and then real people were replying to those replies bc it lended some credence to the OP’s post that it had people replying/stating they would buy. \n\nAll but one of the accounts I saw that said “cute!! Link??” or “wow I want one” were like a year old with one post and 9 comments going back 5 days. Literal full convos involving 2-4 different bots that were “talking” to one another. \n\nBe smart, bots are everywhere lmao.",
            "On that post anyone saying it was a scam got downvoted to hell. Hmmm",
            "You know I should probably be more careful because I actually bought a mug that had a similar design to this from a sub not unlike r/gaybros, but thankfully I got my mug and kept the money in my bank account.",
            "Oh my dumbass clicked on one of the links 💀",
            "I have no idea what “be gay, do crime” even means, much less what a cat has to do with it."
        ]
    },
    "Who else is with the husband?": {
        "title": "Who else is with the husband?",
        "score": 1522,
        "url": "https://i.redd.it/pk9lb5efjd9d1.jpeg",
        "content": "",
        "num_comments": 94,
        "comments": [
            "It’s a “pool party”. If you want to just sit and stand around drinking that’s called “brunch”. I gotta agree W Husband L Everyone else",
            "I don't personally love going in the pool, so I'm here for sipping cocktails on the deck, but I would definitely find it weird to go to a pool party and not see anyone in the pool, lol. Husband has the right idea.",
            "I’ve been in that situation while visiting friends in Florida from New York. There was some unspoken prudishness about getting in the water that completely went over my head. Their loss.",
            "Why don't they just drink in the pool? I love a pool beer",
            "My partner and I threw a \"pool & disco party\" Saturday pre-Pride Parade and all 23 people were in the pool at the same time! So fun. We're middle age and while there was flirting and some sexual tension, the emphasis was on FUN. Join us next year!",
            "Words can't begin to describe the admiration I have for people who just do their own thing in situations like this lol. No regard or care for if it's the \"cool\" thing or what others are doing, just having fun in their own way. I truly think it's the highest level of freedom a person can attain.",
            "Why call it a pool party?\n\n??????",
            "Isn\\`t that a cocktail party then?  Husband was integrated to the name and soul of the party. Nothing wrong in that.",
            "“…while everyone else is standing around and *edging*…”\n\nLol my brian",
            "This is an obvious bait to have everyone side with the husband, which like, sure he’s in the right. \n\nBut also even when gays mean pool party as “stand nearby and drink,” the implication is that it’s in speedos lol. So attacking the husband for putting on a bathing suit seems odd to me."
        ]
    },
    "Adult Film Actor Justin Heath Smith, a/k/a “Austin Wolf,” Charged With Distribution Of Child Pornography": {
        "title": "Adult Film Actor Justin Heath Smith, a/k/a “Austin Wolf,” Charged With Distribution Of Child Pornography",
        "score": 805,
        "url": "https://www.justice.gov/usao-sdny/pr/adult-film-actor-justin-heath-smith-aka-austin-wolf-charged-distribution-child",
        "content": "",
        "num_comments": 404,
        "comments": [
            "Jfc I knew there were underage and dodgy teens but these are literally infants.  The details are unspeakable. Content warning, it's not just collabs with twinks, it's little kids, being hurt, badly.",
            "Fucking gross.",
            "‘…including a video showing a 10-year-old child bound and raped’\n\n![gif](giphy|ukGm72ZLZvYfS)",
            "That’s fucking evil.",
            "Wonder if he'll spill the names of any other well known actors in exchange for a good/better deal...👀",
            "I always used to run into him with a 17yo on his arm, no one who knows him is surprised by this. Shocked, but not surprised.",
            "Absolutely disgusting and heart breaking for the victims who continue to be exploited. Hopefully any video he currently earns money from is removed from the internet and part of his sentencing includes internet restriction so he can’t go back to his old life after he is out of prison.",
            "Awful. Unacceptable. Those poor kids.",
            "I feel disgusted for watching him at all. \n\nI had an encounter with a model in Atlanta (twinky young guy) two years ago at  a bar. Someone name-dropped Austin and the guy pulled a face like he was gonna vommit \"Gross, do yourselves a favor and avoid that guy\".\n\nI had no idea what he meant, now it makes sense.",
            "Can't wait to see everyone who ever fucked him either backtrack or \"expose\" their experiences with him for clout"
        ]
    },
    "What songs would you put on  a sex playlist? ": {
        "title": "What songs would you put on  a sex playlist? ",
        "score": 31,
        "url": "https://www.reddit.com/r/gaybros/comments/1dr2ugh/what_songs_would_you_put_on_a_sex_playlist/",
        "content": "A lot of people talk about songs that you shouldn’t play before having sex, but no one really say what songs would get you the mood or just appropriate during sex. ",
        "num_comments": 37,
        "comments": [
            "CBAT",
            "Cantina Band and Yub Nub",
            "I should think it would depend on the *kind* of sex one wants to have.\n\nSuper kinky, full of latex, leather & BDSM? Maybe heavy metal, NIN or something like that.\n\nFull of passion, fire and carnal savagery? Some house music, EDM or similar.\n\nYou making love with your husband/boyfriend? Romantic guitar instrumentals, 100%.\n\nOr, you know, totally fuck with his mind and play the theme song for Bluey followed by Entry of the Gladiators by Fucik. Your call.",
            "Ne and my hubby enjoy lofi during sex lol",
            "Just play the whole Dirty Computer album by Janelle Monae.",
            "Closer by NIN",
            "Normani’s new album is perfect for it",
            "Joji’s nectar album",
            "Glass animals",
            "This is actually a really good question."
        ]
    },
    "Confused by what my **ck just did": {
        "title": "Confused by what my **ck just did",
        "score": 9,
        "url": "https://www.reddit.com/r/gaybros/comments/1dr555k/confused_by_what_my_ck_just_did/",
        "content": "tl;dr: slept overnight with a hookup. couldn't get hard during the sex before bed, but got hard during morning sex\n\nI'm a bottom and last night I matched with a Tinder guy who basically invited me over to his house immediately to sleep over. We exchanged like maybe 4 sentences and then he went to dinner. He messaged me while he was still there and wanted me to meet him at his home after he finished his drink.\n\nI said fuck it. I got out of the bath, was glad that my body was already ready to get fucked so I didn't have to prepare much, and I rushed over to his place.\n\nI was comfortable with this guy. No bad vibes at all, at any point. Looking back on it, it was a beautiful night.\n\nWe cuddled immediately. I'm pretty sure he wanted to fuck since the moment we matched, but the only thing we had talked about prior was \"are you looking for romance, sex, or friendship\" and his answer was romance. Yet here I was headed to his place to sleep overnight after just connecting that same day and barely having a conversation.\n\nI think I was really attracted to the idea of just cuddling. But yeah, I arrived and my clothes were off within minutes. I think I might have been disappointed. I didn't want to move that quickly...but I still liked it?\n\nOh fuck, that's what it was. It wasn't nerves, it was disappointment. No wonder I didn't feel anxious. I only see it in hindsight now. I think I was mentally blocking my disappointment because I'm used to doing that on dates and hookups. I push through with the whole experience, because I don't want to make a snap judgement that's negative; I want to give people a chance.\n\nI don't know. Maybe it was a mix of disappointment and nerves. Or maybe I was just tired. I really don't know, but I couldn't get it hard for pretty much the whole night. I loved the grinding, I loved the boxers play, he was fit, strong, and bearded. We were naked pretty quickly. I loved the fingering, I loved the rimming, and he was a great top. I did cum but it was one of those zero to sixty nuts where you just stroke your frenulum quickly and cum in 60s. I think he was a bit relieved that I finally got card because as soon as I was hard he grabbed my dick from me and went hard and fast so we both came right away. My load was average, like a few shots. Not peak (it had been 2 days) but not minimal either. Honestly, it was pretty good considering I was hard for what felt like just one minute out of the whole evening.\n\nWe cuddle a bit and he falls asleep as soon as he says \"OK, let's get some sleep\". One of those lucky people that can just close their eyes and fall asleep immediately. My ex was like that, and he had no trouble getting hard either...\n\nWas me not getting hard ED? Or just nerves? I didn't feel nervous. This guy was hot and kind. \n\nI did eventually fall asleep. We were laying on top of the covers. All the cum was dry.\n\nIn the morning, he did one of my favorite things, and something I haven't experienced since sharing a bed with my ex: he slid over to me in the morning to get into big spoon position. At some point over night, we had crawled under the sheets, but I did it wrong and was above the flat sheet while he was below. We had a laugh, but I also had a boner. It was immediate. I don't think I had morning wood... but maybe; I don't remember clearly because I just woke up.\n\nI quickly rolled out then back in, under the correct number of layers, and we cuddled for a bit just naked and sleepy. It felt great. I guess oxytocin was flowing, and perhaps I was more relaxed. Or perhaps it was anticipation. I had a hard on the whole time, and his quickly joined mine. The grinding was great, and the moment he kinda pushed me to roll me over so we could spoon was so hot. He spread my ass to align his hard on between my cheeks. I could feel the spring of his erection just slightly pressure my ass. It's honestly one of the best feelings in the world if you're a bottom. \n\nAnyway, I'll spare you the details, but I was hard the entire time. Precumming too. \n\nSo what was different? \n\nWhy was I hard in the morning but not the night before? I felt calm and aroused both times. Is it possible I wasn't actually calm but didn't realize it? I'm actually wondering if supplements I'm taking (Mg and Gaba) which I find chill me out successfully actually are numbing either my sense of arousal or my sense of calmness.\n\nThinking back to other encounters this year... I do struggle to get hard and stay hard. Maybe it's because I'm jerking off too much on my own? Or that I'm just not as comfortable/relaxed as I was while in an LTR?",
        "num_comments": 8,
        "comments": [
            "Jesus christ. \n\nYour cock and your brain are diametrically opposed. Stop thinking about it. Just be in the moment. \n\nYou enjoyed the morning because when you slept, your brain stopped. And then you just enjoyed the moment. This is obvious from your 250 paragraph essay about the night before, in contrast to your brief summary of your morning.",
            "¯\\\\\\_(ツ)_/¯ Sometimes the little guy doesn't want to participate and sometimes he does. It's not abnormal and you shouldn't feel bad about it. Maybe you were just in your own head about it and couldn't really focus on the moment.",
            "Everytime I read too much details, sounds like fanfiction.",
            "Good point about the elaboration. I’ll research how to overthink less (unless it just means I need to get used to someone)",
            "Yeah, might have spent too much time thinking about what might happen next rather than what was currently going on. Then the next morning I was either too tired to do any thinking, or already knew what was going to happen and felt not only comfortable with it but excited.",
            "Yeah, and in a way it is since I’m focusing on specific details and being descriptive of sexual content. It’s not something you typically read unless seeking it out.\n\nIt’s cathartic for me to write it all out like that, and relive it in a way. It’s kind of like a journal entry. I summarized my question at the top so you can skip the details if it’s too much info",
            "Getting used to someone didn't help me. 8 year marriage and I still over thought shit constantly. \n\nExercise and nutrition helped me get a better handle on my brain/shut it off/quiet the noise. Exercise lead to more confidence and better testosterone production. Nutrition and hydration helped my brain function at its best.",
            "Interesting. It’s been the inverse for me so far. I’ve been single for 1 year, and in that time, I’ve become much more fit, in large part because of a healthier diet and daily exercise. But my libido and specifically my arousal has been out of whack."
        ]
    }
}