{
    "Welcome to /r/Genshin_Memepact": {
        "title": "Welcome to /r/Genshin_Memepact",
        "score": 2466,
        "url": "https://www.reddit.com/r/Genshin_Memepact/comments/j77d3k/welcome_to_rgenshin_memepact/",
        "content": "dank memes only.\n\nhave fun and enjoy!",
        "num_comments": 65,
        "comments": [
            "Hello Genshin r/0sanitymemes...\n\nJokes aside, thank God because the main sub is just filled up.",
            "Can I just say that this subreddit is my god damn happy place instead of that ***other shitty*** subreddit (y'know, the umm.. official genshin reddit page. Yeah fuck that! I'm staying here!)  \nLove the memes people post here. And a super massive thank you for creating this subreddit!",
            "There are some solid memes on this subreddit. I wish they got more traction.",
            "are there any gentlememer rules about ripping on the mainsub? i badly want to but i don't know if it's thought of as bad taste?\n\nsee r/FFXIV vs r/ShitpostXIV",
            "Ah yes the fun one",
            "Seeing as how I can't get into the main sub to ask this CAN SOMEONE HELP ME GET A MIHOYO ACCOUNT SO I CAN PLAY THE DAMN GAME? Their stupid website wont load on any of the browsers. What am I supposed to do?",
            "This sub has turned into a tier-list memes sub :/",
            "Don't mind me, I just felt like appearing in this post's replies.",
            ":)",
            "[deleted]"
        ]
    },
    "I am sorry, my dear team but Fontaine is next then Natlan.": {
        "title": "I am sorry, my dear team but Fontaine is next then Natlan.",
        "score": 418,
        "url": "https://i.redd.it/kn033d96928d1.png",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Who's the one between Mona and Ayaka?",
            "Almost tear my eyes out exploring Sumeru 😭, unfortunately need primos for furina",
            "Exploring the entire region 100% is much longer than Archon and Story Quests.",
            "Don't worry guys the desert is so much quicker to max than the rainforest",
            "This is literally me farming primos to do more pulls before Clorinde's banner goes away lol. I recently 100% Petrichor and the past week I've been doing the Sumeru desert WQs (Jeht's storyline)",
            "Ayakers",
            "Are the two boys Xiao and Kazuha?",
            "Me with Xianyun: hah. peasant",
            "Don Sombrero corroding into pixels.",
            "On my end, I see a little silhouetto of a man"
        ]
    },
    "screw which mains subreddit has the most members, get ready for which mains subreddit has the most subreddits for a specific character": {
        "title": "screw which mains subreddit has the most members, get ready for which mains subreddit has the most subreddits for a specific character",
        "score": 541,
        "url": "https://i.redd.it/opyulx25718d1.jpeg",
        "content": "",
        "num_comments": 53,
        "comments": [
            "In the end, _nsfw or _hentai will win so it doesn't matter lol",
            "Of course the _ at the end one has kaiser",
            "Everyone fighting to be special and i guess they want the \"luxury\" of being an owner of a subreddit? Kinda cringe if you ask me",
            "More like which one will a normal person be comfortable in",
            "I had a quick look at the smaller subs,  it  seems that except for one, the rest are inactive where no posts and the mods are not actively posting either despite lack of activity for like... at least a month+\n\n\n Unless there is a collective effort to get the sub running by the players and the mods, people are just going to just join the one with the most members, and Reddit algorithm also means the sub with highest members will more likely to be recommended.",
            "I love it because somehow in these kinds of subs they always feel different from each other despite everyone being the same main",
            "Do not visit them...\n\nI saw pictures of Sigewinne that should have never been drawn...\n\nDunno where I can find a normal place to chill and discuss my love for Sigewinne.",
            "Ask-Me-For-Directions-Arnold mains [https://www.reddit.com/r/AMFDArnold/](https://www.reddit.com/r/AMFDArnold/) solos",
            "idk who has the most but alhaitham has 2 official subreddit one for the horny ones and one for sfw",
            "Sige\"wine\" 🍷at the end"
        ]
    },
    "Neuvineuvi cute tho ": {
        "title": "Neuvineuvi cute tho ",
        "score": 734,
        "url": "https://i.redd.it/wscfz96rl08d1.jpeg",
        "content": "",
        "num_comments": 33,
        "comments": [
            "Llettellette is just a JoJo's character",
            "Neuvineuvi looks like when you hose down a long-haired dog",
            "They would be Neuvivuen and Llettettell, no?",
            "They both look like Dante and Vergil respectively",
            "Neuvineuvi needs to start a glam rock band",
            "Neuvineuvi .....\n\n\n\nW O U L D",
            "So, i need to see the people commenting something about \"🛐\" to Neuvineuvi",
            "I want neuvineuvi ingame",
            "They look like Dante and Vergil",
            "Neuviivuen\n\nEttellllette"
        ]
    },
    "An Eremite Dancer and a Mirror Maiden": {
        "title": "An Eremite Dancer and a Mirror Maiden",
        "score": 67,
        "url": "https://v.redd.it/shld66oot38d1",
        "content": "",
        "num_comments": 4,
        "comments": [
            "And here, we can see the mating dance of the Eremite as it tries to wow a potential mate.",
            "I fucking love eremite clearwater\n\nWe should've gotten Jeht as a playable character, you can't change my mind",
            "Jeht trying to impress Agafya",
            "Canon Jeht activity"
        ]
    }
}