{
    "Words like violence, break the Temple of Silence - General Question and Discussion Megathread": {
        "title": "Words like violence, break the Temple of Silence - General Question and Discussion Megathread",
        "score": 330,
        "url": "https://www.reddit.com/r/Genshin_Impact_Leaks/comments/1dkru8v/words_like_violence_break_the_temple_of_silence/",
        "content": "Please use this thread for discussion of leaks, or if you have a simple question that can be easily answered or you have an off-topic question or discussion point e.g. \"When does X come out?\" or \"will X character be a good dps?\" instead of making a separate post. Also, before posting please read the [posting guidelines](https://www.reddit.com/r/Genshin_Impact_Leaks/wiki/posting_guidelines). All other various off-topic discussions are allowed here.\n\n**REMINDER TO SPOILER-TAG COMMENTS DISCUSSING 4.7 ARCHON/WORLD/STORY/EVENT QUESTS. ALSO SPOILER TAG ANY STORY LEAKS.**\n\n**Please mention the subject of your spoiler tagged comment as this can be more helpful for people to engage with your comment, as follows:**\n\n>\\[4.7 Archon Quest spoilers\\] >\\!*spoiler tagged text here*!<\n\nUseful Links/Resources (Check the sidebar for more!)\n\n✧ [**Daily Hoyolab Login**](https://act.hoyolab.com/ys/event/signin-sea-v3/index.html?act_id=e202102251931481)\n\n✧ [**Apply to be a Moderator Here! Applications are permanently open.**](https://docs.google.com/forms/d/e/1FAIpQLSdpy9BY-16hbT79X3nokRaPHZIiMLEe9pZLzMHCiWW4SG6O8A/viewform?usp=sf_link)",
        "num_comments": 3888,
        "comments": [
            "mihoyo really said no natlan leaks. by this time last year we had a leak that said ~~finina~~ furina had summons and would buff your damage based on hp fluctuation and all we have for natlan is geo [big boobs](https://www.youtube.com/watch?v=aYN7JLTeMQQ)",
            "Petition to MHY to add capybaras to natlan",
            "- capitano\n\n- pyro archon (no name given)\n\n- xbalanque \n\n- columbina (sometimes)\n\nthese are the only characters leakers are capable of talking about with regards to natlan. this actually means that these are the only 4 natlan characters. iansan has been removed from existence. the rest of 5.x will be dedicated to liyue patches. I hope you like",
            "#UTeyvat\n\n\nI'm afraid there won't be any Natlan image leaks until the week of 5.0 beta. HoYo is serious... Well, with the exception of some text description of certain 2 characters perhaps.\n\n\n----------------------\nThu Jun 20 2024 14:35:35 GMT+0800 (China Standard Time)\n\n\nvia Twitter @UTeyvat",
            "|Date|Days left|Event|\n|:-|:-|:-|\n|24 June 2024|4|Sigewinne Demo|\n|26 June 2024|6|4.7 Phase 2; Sigewinne Debut|\n|3 July 2024|13|4.8 livestream announcement|\n|5 July 2024|15|4.8 livestream|\n|15 July 2024|25|4.8 Preload; 5.0 Drip Marketing|\n|17 July 2024|27|4.8 Patch; 5.0 Beta|\n|31 July 2024|41|Emilie Teaser|\n|5 August 2024|46|Emilie Demo|\n|7 August 2024|48|4.8 Phase 2; Emilie Debut|\n|14 August 2024|55|5.0 livestream announcement|\n|16 August 2024|57|5.0 livestream|\n|21 August 2024|62|??? Teaser|\n|26 August 2024|67|5.0 Preload; 5.1 Drip Marketing|\n|27 August 2024|68|??? Demo|\n|28 August 2024|69|5.0 Patch; 5.1 Beta|\n\nHere's the timetable as usual\n\nYou can check out Genshin fanart I've commissioned [here](https://www.reddit.com/r/Genshin_Impact_Leaks/s/PxQIoD2a2k)\n\n: Corrected dates for Emilie's teaser and demo",
            "Why doesn't hoyo let us have those unique poses that those ep videos generally have , like furina sitting on a chair with one leg over other, when randomly sitting a crystalfly would come to her, etc, and for many other characters\n\nLike they made all these and it's only used in content outside the game",
            "Sometimes I think about that time when Albedo straight up told Cyno \"your jokes are bad but you're amusing regardless lol\". I need that trio reuniting again.",
            "when i picked genshin up a couple months ago i didnt expect it to be a diet. i usually play a couple hours before bedtime, which *used* to be my prime snacking time, but i cant snack and hold a controller at the same time. I've dropped nearly 5 kilo running around teyvat.",
            "In Avidya Forest, my two eyes see  \nA big-eared forest ranger in the trees  \nThe ranger jumps down, he has come for me  \nHe proudly proclaims, \"I have come to break your knees\"",
            "3.6 desert and 4.7 archon quest spoilers\n\n>!So I was re-going over the 3.6 desert lore released in that version after I made that comment explaining Arkhe/Pneumousia, and I'm at least 80-90% sure that the 5 sinners of Khaenri'ah were mentioned here.!<\n\n>!You can find various notes from the perspectives of low ranking Khaenri'ah citizens/soldiers and it mentions the Sage, and the 4 pillars of Khaenri'ah. Someone pointed out on the main sub I think? That in the Winter Night's Lazzo, Pierro was referring to a singular sage instead of plural in the CN translation. (If this is false then rip my theory), but I'm pretty sure that the Sage refers to Vederfolnir, and the 4 pillars are the other sinners. They mention how they were trying to persuade the higher ups to stop them from continuing to poke around the secrets of the Heavens/Celestia. We now know in 4.7 that these 5 did in fact not stop prying, but betrayed Khaenri'ah causing the Cataclysm.!<"
        ]
    },
    "Sus Columbina Voice Direction related crumbs from Keitaro_GG via snezhfed (spoilers for possible character personality direction) ": {
        "title": "Sus Columbina Voice Direction related crumbs from Keitaro_GG via snezhfed (spoilers for possible character personality direction) ",
        "score": 336,
        "url": "https://prnt.sc/9o6jyGZUTn7C",
        "content": "Context: google translated \n\n🙍‍♀️About the character of Columbine.\nSubject to change (stc).\n\nOrigin of information:\nThis material was provided as an audition for voice actors and the information may be out of date or have changed significantly since that time.\n\n➡️An example of similar files.\n\nkeitarogg homdgcat snezhfed\n❅ Snow Federation ❅",
        "num_comments": 211,
        "comments": [
            "###OP, please reply to this comment with leak source and alternate screenshot mirrors of the post content. Mirror links are MANDATORY to ensure accessibility for all. \n\n**If you are unable to view the post, PLEASE EXPAND THE REPLIES TO VIEW MIRROR LINKS.**\n\n**If you would like to refer to this content in the future, please save the image/video/text to your device or create a mirror and save the link**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Genshin_Impact_Leaks) if you have any questions or concerns.*",
            "We are getting va directions before Natlan character leak 😭😭😭",
            "Columbina touches a bird\n\nIt's dead\n\n\"Oh no, anyway.\"",
            "Bigger qiqi",
            "CLINICALLY INSANE BUT DOESNT KNOW IT. IT'S ALL I EVER WANTED!!",
            "imagine the first scene with her in it is just her murdering a saurian in cold blood 😭😭\n\n“it died… ok”",
            "So this is the source of \"Columbina is conservative\".... what does that even mean for her?",
            "With how nonchalant she appears to be I hope she keeps her eyes closed most of the time in and out of combat. Only to open them when she's like using her ultimate or something.",
            "very polite in combat, neuvi flashback",
            "\"Could you please... spare no effort in fighting me? I'm sure you'll be able to break my defenses, cut through my skin and make me bleed\" — ok slay i cant fix you and i wont. Be who you are, live for your pride"
        ]
    },
    "Capitano's age via Team Mew": {
        "title": "Capitano's age via Team Mew",
        "score": 95,
        "url": "https://imgur.com/a/h4UXHwx",
        "content": "",
        "num_comments": 72,
        "comments": [
            "###OP, please reply to this comment with leak source and alternate screenshot mirrors of the post content. Mirror links are MANDATORY to ensure accessibility for all. \n\n**If you are unable to view the post, PLEASE EXPAND THE REPLIES TO VIEW MIRROR LINKS.**\n\n**If you would like to refer to this content in the future, please save the image/video/text to your device or create a mirror and save the link**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Genshin_Impact_Leaks) if you have any questions or concerns.*",
            "You sure he's not 13 ?",
            "Why are we getting such random leaks lol",
            "Keep in mind Team Mew is on a Loss streak\n\nAlmost 3-4 leaks of their own source in a row have been wrong starting with ”Sethos has white hair”",
            "Everyone in genshin is around the age of 500 at this point",
            "Now someone credible leak his release patch",
            "Dude's been training for over 500 years no wonder he's the strongest human",
            "Woah.\nI think this leak may be based on the rumours that he is the Bloodstained Knight.\n\nIf it is the other way, then this leak is gets us 1 step closer to confirm that he is indeed the Bloodstained knight.",
            "Goatpeakhimchadsigmaohiotano is a human in his mid 20s, this leak is nonsense /s\n\n\nGotta maintain the agenda",
            "what's with all these capitano and columbina leaks lol. white is the one who started this trend, i'm not believing any of these until i play 5.0 myself lol"
        ]
    },
    "Speculated Dates for 4.7 & Beyond": {
        "title": "Speculated Dates for 4.7 & Beyond",
        "score": 1181,
        "url": "https://www.reddit.com/r/Genshin_Impact_Leaks/comments/1dla125/speculated_dates_for_47_beyond/",
        "content": "Here's a time table of upcoming demos, teasers, livestreams and so on. These dates were calculated based on on-going patterns but they may not be correct, seeing as Hoyoverse has delayed or advanced these things before. Per the mods' request, I will post this once every patch or so.\n\nI have a similar time table for HSR which you can find [here](https://www.reddit.com/r/HonkaiStarRail_leaks/comments/1diyjrh/comment/l9kdngz/).\n\nI will also likely have one made for Zenless Zone Zero once it's had a couple patches to establish patterns.\n\nEmilie will be debuting in 2nd phase according to Dimbreath, hence why her promotional videos are expected to come later.\n\n|Date|Days left|Event|\n|:-|:-|:-|\n|24 June 2024|3|Sigewinne Demo|\n|26 June 2024|5|4.7 Phase 2; Sigewinne Debut|\n|3 July 2024|12|4.8 Livestream Announcement|\n|5 July 2024|14|4.8 Livestream|\n|15 July 2024|24|4.8 Preload; 5.0 Drip Marketing|\n|17 July 2024|26|4.8 Patch; 5.0 Beta|\n|31 July 2024|40|Emilie Teaser|\n|5 August 2024|45|Emilie Demo|\n|7 August 2024|47|4.8 Phase 2; Emilie Debut|\n|14 August 2024|54|5.0 Livestream Announcement|\n|16 August 2024|56|5.0 Livestream|\n|21 August 2024|61|??? Teaser|\n|26 August 2024|66|5.0 Preload; 5.1 Drip Marketing|\n|27 August 2024|67|??? Demo|\n|28 August 2024|68|5.0 Patch; 5.1 Beta; ??? Debut|\n|18 September 2024|89|5.0 Phase 2|\n|25 September 2024|96|5.1 Livestream Announcement|\n|27 September 2024|98|5.1 Livestream|\n|28 September 2024|99|Genshin Impact 4th Anniversary|\n|2 October 2024|103|??? Teaser|\n|7 October 2024|108|5.1 Preload; 5.2 Drip Marketing|\n|8 October 2024|109|??? Demo|\n|9 October 2024|110|5.1 Patch; 5.2 Beta; ??? Debut|\n|30 October 2024|131|5.1 Phase 2|\n|6 November 2024|138|5.2 Livestream Announcement|\n|8 November 2024|140|5.2 Livestream|\n|13 November 2024|145|Pyro Archon Teaser|\n|18 November 2024|150|5.2 Preload; 5.3 Drip Marketing|\n|19 November 2024|151|Pyro Archon Demo|\n|20 November 2024|152|5.2 Patch; 5.3 Beta; Pyro Archon Debut|\n\nHere is Pengepul Teyvat's 2024 Calendar:\n\nhttps://preview.redd.it/jpzetomnjy7d1.png?width=1920&format=png&auto=webp&s=d8cfe6274b0d4178f079a86a4349084a89c0f6cd\n\nThank you to the megathread for helping me correct mistakes, thank you to the mods for their excellent work on this subreddit and thank you to Furina for being pretty \\^\\_\\^",
        "num_comments": 232,
        "comments": [
            "Cant wait to experience a new character reveal trailer without leaks\n\nAlso hoping for some mindblowing Hexenzirkel content in 4.8 and maybe even their own Winter Night Lazzo",
            "Natlan waiting room",
            "Thank you for this! Calendars marked for the 15th of July, I just can't wait to see the first Natlan character(s)",
            "Are we not expecting a natlan reveal cinematic  kind of like last years overture teaser, very soon as well",
            "And which of these patch, Shenhe will get her rerun ?",
            "Natlan's ver of Final feast and Lazzo should also be on the 15th of July. Im just imagining seeing Capitano on the thumbnail of that vid",
            "Shouldn’t there also be a story trailer for Natlan when 4.8 preload comes out?",
            "Hmm...looks like we are gonna have lantern rite in 5.3 this time and holy shit 5.3 will starts on new year  , so like both new year (global/cny) will be in same patch , I hope they celebrate it with a good events this time ",
            "only 99 days left for 4th anniversary… oh my",
            ">thank you to Furina for being pretty \\^\\_\\^\n\nBased"
        ]
    },
    "Capitano story leak via White": {
        "title": "Capitano story leak via White",
        "score": 1118,
        "url": "https://imgur.com/a/gDO1IPI",
        "content": "",
        "num_comments": 623,
        "comments": [
            "###OP, please reply to this comment with leak source and alternate screenshot mirrors of the post content. Mirror links are MANDATORY to ensure accessibility for all. \n\n**If you are unable to view the post, PLEASE EXPAND THE REPLIES TO VIEW MIRROR LINKS.**\n\n**If you would like to refer to this content in the future, please save the image/video/text to your device or create a mirror and save the link**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Genshin_Impact_Leaks) if you have any questions or concerns.*",
            "white: posts 5.4 \"leaks\"\n\neveryone: white is a fraud and literally knows nothing nobody should believe anything they say\n\nwhite: capitano is an alien\n\neveryone: 🤯🤯🤯",
            "Capitano being alien was not on my natlan bingo card ngl",
            "what does the 2nd paragraph even mean?",
            "It pains me to think that we are close to seeing HIM, but the leaks are probably still in their “Fontaine has two archons” (and one of them is Navia) level.",
            "~ nothing from 4.8\n\n~ nothing from 5.0\n\nbut of course I'm supposed to believe in story leaks from the future.",
            "Yeah i'm not trusting ANY story leaks after the fontaine leaks we got lmao. That second paragraph is confusing as hell",
            "Now I am starting to think that Capitano is actually from Glamoth too.",
            "Capitano is not a Descender but an actual alien, okay. \n\nThis \"humanity is the highest level of existence\" sort of thing lends to the idea that being mortal is the best because the Primordial One is a human-loving colonizer that he rewrote everything in Dinosaur Land to bow down to featherless bipeds.",
            "No one remembers Xiao Developers Note saying that Humana have a higher purpose? Okay \n\n\nSomething like this was said back there"
        ]
    }
}