{
    "Daily Questions Megathread (June 29, 2024)": {
        "title": "Daily Questions Megathread (June 29, 2024)",
        "score": 5,
        "url": "https://www.reddit.com/r/Genshin_Impact/comments/1dr70h8/daily_questions_megathread_june_29_2024/",
        "content": "Ask about anything about the game that doesn't necessarily require a dedicated thread.\n\nThat is, if your question can be answered rather quickly/without significant  difficulty (e.g. \"Can my phone run this game?\"), ask here. If you think your question can contribute to some constructive discussions (e.g. \"What do you think of Amber's combat efficiency? Here's my opinion.\"),  make a particular post with the \"discussion\" flair.\n\n## Other megathreads:\n\n\n* [**Weekly Friend Request Megathread**](https://www.reddit.com/r/Genshin_Impact/search?q=title%3A%22Weekly+Friend+Request+Megathread%22+author%3AVeritasibility&restrict_sr=on&sort=new&t=week) \\- Find some friends!\n* [**Weekly Gacha and Drops Megathread**](https://www.reddit.com/r/Genshin_Impact/search?q=title%3A%22Weekly+Gacha+and+Drops+Megathread%22+author%3AVeritasibility&restrict_sr=on&sort=new&t=week) \\- The thread where you can share the results of your gacha rolls and lucky drops.\n* [**Weekly Team/Character Building Megathread**](https://www.reddit.com/r/Genshin_Impact/search/?q=title:%22Character%20Building%20Megathread%22%20author:Veritasibility&restrict_sr=1&sort=new) \\- Ask about team-building or Character-building!",
        "num_comments": 40,
        "comments": [
            "I'm building a team with Noelle, Xingqiu and xiangling. For my second geo character, should I use ninguang or garou?",
            "How to beat 11-1 floor 2 fast they keep freezing me",
            "Is zhongli still worth getting in 2024? Many people have mentioned character stronger than him which I should try to get, so I wonder if getting Zhongli would be of any benefit",
            "Hi! I have a lot of chars (ar 60) and the last two on my most wanted list is Shenhe and Nilou. I heard that Nilou would get a rerun very soon, and I’m at pity so I’m excited but… I’m a person who gets a lot of drive by building characters and doing tons of dmg, and i’m wondering if I should get Furina? I really like her design, I don’t like her personality, amazing va btw, but I think that will change when I’m completely done with fountains story? I heard she becomes more likeable. Should I get Furina the god tier char or should I stay strong for Nilou?",
            "Does kaeya synergise well with the flute or should I stick with cool steel? I’m AR30 if that influences anything",
            "How much space does genshin takes on pc now (with chinese Language only)?\n\nI have 232 GB of free space and i lil want to come back to the game after 1 year of break. But idk if i have enough space...",
            "Building Raiden national rn what stats should i aim for Raiden in terms of cr,cd and er (i have r5 catch)",
            "Does the level of a character that adds an element to the main dps matter in  terms of damage done? Like Raidens ability after you've switched to another character. Does the damage scale off of Raidens level or the character you switched to?",
            "Any idea during which version Columbina might get released and what element she might have? I am kinda assuming Cryo,  but...",
            "gorou but that team is gonna have hella ER issues"
        ]
    },
    "Weekly Gacha and Drops Megathread (June 23, 2024)": {
        "title": "Weekly Gacha and Drops Megathread (June 23, 2024)",
        "score": 21,
        "url": "https://www.reddit.com/r/Genshin_Impact/comments/1dmi0hn/weekly_gacha_and_drops_megathread_june_23_2024/",
        "content": "Please keep all gacha discussion / salt / pull / in-game drops screenshots here.\n\n​\n\n## Other megathreads:\n\n\n\n* [**Daily Questions Megathread**](https://www.reddit.com/r/Genshin_Impact/search?q=title%3A%22Daily+Questions+Megathread%22+author%3AVeritasibility&restrict_sr=on&sort=new&t=day) \\- For your questions.\n\n* [**Weekly Friend Request Megathread**](https://www.reddit.com/r/Genshin_Impact/search?q=title%3A%22Weekly+Friend+Request+Megathread%22+author%3AVeritasibility&restrict_sr=on&sort=new&t=week) \\- Find some friends!\n\n* [**Weekly Team/Character Building Megathread**](https://www.reddit.com/r/Genshin_Impact/search/?q=title:%22Character%20Building%20Megathread%22%20author:Veritasibility&restrict_sr=1&sort=new) \\- Ask about team-building or Character-building!",
        "num_comments": 146,
        "comments": [
            "Saved 205 Intertwined Fates and 21 pity to wish for Furina. Then won the 50/50 today within 30 wishes. Which means I have enough Fates left to pull for Yelan too! My plan was to skip Yelan and save up for Zhongli next but if my calculations are right it should be possible to get both :)",
            "2 hours left for Chlorinde, had to make some past quests and buy some crystals, but I managed to get her",
            "New account saved up for 1 month and got C2 Furina in 90 pulls  \nSo happy!",
            "MY FIRST FIVE STAR CHARACTER IS FURINA!\n\nUnfortunately I’ve yet to reach Fontaine :(",
            "Just cooked getting both Furina and Rosaria in the same 10 pull first try. So happy. Now just need to pull Gaming",
            "Went from not owning Furina to C3 within 100 pulls. Insane luck for the first time in Genshin even getting my first 5\\* double pull. Happy that the waiting paid off. Good luck everyone!",
            "Lost hard pity with Qiqi… should I keep trying for Furina? I’m on 40 pity now",
            "Lost 50/50 on furina... I haven't won a 50/50 since Yelans release over 2 years ago i'm gonna cry",
            "Lost 2 50/50s in a row to keqing (80 pity) and mona (40 pity) respectively, got my first furina at 70 pity before the mona. I am completely out of primogems but have a guarantee. Go for C1 or stop?\n\nI have arlecchino and alhaitham",
            "Going for a Furina const, wish me luck!\n\nEDIT: C3 is in the bag :)"
        ]
    },
    "Kevin leaked gameplay": {
        "title": "Kevin leaked gameplay",
        "score": 2124,
        "url": "https://v.redd.it/s69ebp3o0g9d1",
        "content": "",
        "num_comments": 89,
        "comments": [
            "Dang, I wonder if he can compete with Haitham as he seems to be a Dendro On-Fielder.",
            "Damn his kit looks game breaking!",
            "Was this played on a 360x480 CRT monitor?",
            "Judgement of Shamash is so broken",
            "The aoe dendro should be useful in hyperbloom or nilou teams,  right ?",
            "Oh dang it I don't have enough primo! I'll get him on his next rerun",
            "Damn they're releasing Ke🅱️in before Capitano\n\nFor the Serpent.",
            "Honestly very underwhelming. I expected him to be meta-changing and his kit is too basic.",
            "Cant wait for his Might of an Utu ult",
            "Huh? Claymore? Rattail? Tall man? Dendro? Living in poverty? Swinging like weightlessness? I think this a trend after what Dori and Jinshi (Wuwa) did."
        ]
    },
    "I can't believe Fontaine is near its end, and we didn't get any Yanfie content 😔😔": {
        "title": "I can't believe Fontaine is near its end, and we didn't get any Yanfie content 😔😔",
        "score": 1346,
        "url": "https://i.redd.it/wqqou5h59f9d1.png",
        "content": "",
        "num_comments": 78,
        "comments": [
            "Just wait till Itto gets arrested in Fontaine",
            "I get what you mean because of her profession, but we didn't have Lisa in a single Sumeru quest, Ganyu in Inazuma, etc. There's a bunch of characters with literal ties to other nations who would have made a great cameo or other extension of their story, so many obvious missed opportunities. But alas, we can only hope",
            "Wasn't she in the Kabuto event?",
            "bro I'm still recovering from no xinyan in the rock n' roll event.",
            "Do keep in mind Yanfei isn't a lawyer. She is a legal advisor.",
            "I thought we'd also meet kavehs mom since they mentioned before that she moved there.",
            "Plot twist: she was disguising herself as Charlotte the whole time",
            "For 500 years Furina has been making up weird laws to get a weird trial and any sane lawyer wouldn't want to touch that.",
            "It is written in her character's story that she doesn't know the laws of Fontaine, therefore prefer not to get involved.",
            "I just put Queenfei on my teams in Fontaine and pretend"
        ]
    },
    "I'm sorry, but why am I seeing this mail about an event that started like 2 days ago? What are we doing with these events lately??": {
        "title": "I'm sorry, but why am I seeing this mail about an event that started like 2 days ago? What are we doing with these events lately??",
        "score": 966,
        "url": "https://i.redd.it/uin7ozutqf9d1.png",
        "content": "",
        "num_comments": 126,
        "comments": [
            "the irony of the \"Endless\" Forms Most Martial being in fact everything but endless was not lost on me.",
            "Not that I keep track, but this event did feel unusually short. I might not be able to spread my encounter points over the days before the event ends.",
            "Seriously, what's up with 4.7's events? They've been very very shorts.",
            "I mean... this event is 8min of gameplay. No quest, no NPC, you just port in. Nothing to stretch out here.",
            "Small events between larger ones",
            "The event did not start 2 days ago, unless you're in EU or NA. They speed ran all events to prepare for the new permanent content, Imagirium Theatre which will start at July 1st at most.",
            "Same with the previous event. I went in to check and it was 4 days left even though not all stages were released.",
            "There's one more upcoming event, and guess what? It will be the third consecutive week long event. Even the main event of this patch, which usually lasts for 2 weeks or more, only lasted 11 days",
            "I would not have minded the shortness of the events if all of the stages have been unlocked since day 1.\n\nAs it is, all of them are still time-gated, with only 3 days to spare. Before, we usually had a whole week after the whole event is unlocked, and I liked it that way. Our extra free times to play events don't always fall in the weekends. :[",
            "The event was like 8 days instead of the usual 2 weeks"
        ]
    }
}