{
    "Yes, there are mods here.": {
        "title": "Yes, there are mods here.",
        "score": 522,
        "url": "https://www.reddit.com/r/GenX/comments/1c40z8f/yes_there_are_mods_here/",
        "content": "So we had a report earlier today on the thread about people riding in the back of a pickup truck that asked if there are any mods here, and we “keep letting boomer memes in here.” First, it doesn’t work like that. This is a public subreddit, anyone can view and post here. Second, we have a three active mods for a subreddit of over 134,097 members as I write this. In case you don’t know, here are a few facts about the mods:\n\n\n1. We don’t get paid.\n\n\n2. We have lives outside Reddit.\n\n\n3. See #1.\n\n\nPlease continue to report problematic threads. Before you write some shitty little comment about the mods, though, take a minute and look at what you’re saying to an unpaid volunteer who is doing their best to keep 134,097 people happy. \n\nWe’re happy to take suggestions, we’re happy to make improvements, but if you can’t be civil to other members *and moderators,* we’re happy for you to go somewhere else. \n\n",
        "num_comments": 103,
        "comments": [
            "To be very briefly serious: Mods here must be doing a good job because off topic or inflammatory stuff gets removed but, at the same time there is no feeling of intrusive or heavy handed moderation.  Y'all are doing good.",
            "\"I'm not even supposed to be here today.\" \n\n(That was my Gen x thanks for volunteering your time and energy.)",
            "I just wanted to tell everybody, that this sub keeps me sane. And I think the mods are doing a good job.",
            "I just want to tell you both good luck, we're all counting on you",
            "So I neglected to lock comments on this thread, and I sincerely was not fishing for pats on the back or anything, or hugs. They are sincerely appreciated, though. Thanks very much!",
            "Mods here seem pretty unobtrusive.  Keep doing what you're doing.",
            "The best mods are those that go largely unnoticed.  This place is pretty chill, y'all are doing great.",
            "I would say the \"riding in back of truck\" thing is in line with rule 4 of this sub, as it does very well pertain to GenX, not only boomers. Some people can be so petty. \n\nAnyway...good job mods 👍",
            "Please don’t overmoderate. Light moderation is best. And Thank You for donating your time. \n\nAnd I was born in’73 and I definitely remember riding in the back of my Dad’s truck as a kid and down to the football field with helmet and pads in high school in 1990.  So that can still be a GenX thing and not just a baby boomer thing.",
            "My dad's truck had a big tool rack on it and we used to ride in the back of the truck standing up, holding on to the rack.  This is totally a Gen X thing, but whining and narcing on people isn't.  I can't believe someone complained about that."
        ]
    },
    "STOP WITH THE QUICKSAND POSTS": {
        "title": "STOP WITH THE QUICKSAND POSTS",
        "score": 88,
        "url": "https://www.reddit.com/r/GenX/comments/1demiqy/stop_with_the_quicksand_posts/",
        "content": "Bans will follow. I’ve deleted ten of the fucking things just today.",
        "num_comments": 0,
        "comments": []
    },
    "Martin Mull, Comic Actor in ‘Clue,’ ‘Arrested Development,’ Dies at 80": {
        "title": "Martin Mull, Comic Actor in ‘Clue,’ ‘Arrested Development,’ Dies at 80",
        "score": 432,
        "url": "https://variety.com/2024/film/news/martin-mull-dead-clue-arrested-development-1236057168/",
        "content": "",
        "num_comments": 66,
        "comments": [
            "He'll always be the boss from Mr. Mom for me. Great actor, whether as the creepy antagonist or the loving dad. I see him and Dabney Coleman in the same light, with Brian Cranston and William Macy in their shoes. RIP",
            "Gene Parmesan! Although I first knew him as Leon from Roseanne",
            "One of the best. 79 80 whatever it takes. RIP",
            "This is war, Peacock!",
            "Jessica Walters waiting at the gates\n\n![gif](giphy|wrg1J9NWeu7nWwIXeJ)",
            "I loved him in Fernwood 2 Night. He and Fred Willard were hilarious.",
            "R.I.P., Colonel Mustard",
            "\"His daughter Maggie announced his death on Instagram, writing “I am heartbroken to share that my father passed away at home on June 27th, after a valiant fight against a long illness. He was known for excelling at every creative discipline imaginable and also for doing Red Roof Inn commercials. He would find that joke funny. He was never not funny.\"\n\nLol",
            "a staple of our childhood. may his memory be a blessing.",
            "Oh damn. This one really hurts."
        ]
    },
    "The Time Has Come. Someone Please Step Up! ": {
        "title": "The Time Has Come. Someone Please Step Up! ",
        "score": 613,
        "url": "https://i.redd.it/c0zkfcca2d9d1.jpeg",
        "content": "",
        "num_comments": 242,
        "comments": [
            "Number should have been 1-800-867-5309.",
            "Not it.",
            "Check the White House parking lot. Look for the cloud of smoke.",
            "Nah! That job sucks. Good luck everyone!",
            "Shush you! We're GenX - we've been ignored all our lives. Don't draw any attention to us now! ;)",
            "Man I had some hope for Fetterman, but after he got back from the hospital for his depression things *changed.*",
            "https://preview.redd.it/dsfn5nnncf9d1.png?width=559&format=png&auto=webp&s=89132bea2b2040122eae0f6af0db4787c2092824",
            "Gavin Newsom is waiting in the wings…",
            "I'm voting for giant meteor.",
            "True Gen-X sentiment… “Someone else do it”"
        ]
    },
    "“Yeah, you gonna make it all 220?” - Martin Mull as Ron Richardson in Mr. Mom - RIP to an 80s Icon": {
        "title": "“Yeah, you gonna make it all 220?” - Martin Mull as Ron Richardson in Mr. Mom - RIP to an 80s Icon",
        "score": 143,
        "url": "https://i.redd.it/qx8xwez2ef9d1.jpeg",
        "content": "",
        "num_comments": 9,
        "comments": [
            "\n\nJack Butler : Wanna beer?\n\nRon Richardson : It's 7 o'clock in the morning.\n\nJack Butler : Scotch?",
            "“Howdya like a little trim on that mustache, Ron?”",
            "I'll be at the gym or the gun club.",
            "I like to paint, sculpt",
            "220, 240, whatever it takes",
            "Face it Ron, she doesn’t know a tuna fish from a cheerio.",
            "“220, 221, whatever it takes.” You need a rewatch, my friend.",
            "What did you use, a .38?",
            ".38 .39 Whatever it takes."
        ]
    }
}