{
    "What have you learned this week?": {
        "title": "What have you learned this week?",
        "score": 15,
        "url": "https://www.reddit.com/r/GenZ/comments/1dl0c7c/what_have_you_learned_this_week/",
        "content": "",
        "num_comments": 36,
        "comments": [
            "Telling people your plans is a bad move, all they do is put you down and tell you youre going to fail.",
            "Hard choices are coming in my personal life. \n\nI dont want to do them, but its needed.",
            "That i HATE my job and wasted years doing it.",
            "That I need to fix my hair.",
            "That germans are some of the nicest people ive ever met and that ill miss my host family sm",
            "That TV remotes are universal! Most remotes can connect to any TV!",
            "No one likes me and I have no idea why",
            "That anhueser bush in upstate NY is a massive fucking pain in the ass to deal with, also that we have the tech to almost completely automate a warehouse, istg maybe 3 people worked in there n robots loaded my trailer. Was kinda cool to watch",
            "It was almost two weeks ago, but dark humor is used as an excuse to get away with stuff like misogyny and racism.\n\nClass representative and other people pretended used racist, homophobic and ableist words against me, and pretended it was okay and they were friends so they got away with it.",
            "I may not be cut out for working on site 5-7 days a week on overnight shifts and having someone talk my ear off for all those days in a row. I am genuinely losing my mind."
        ]
    },
    "Our futures still depend on the older one": {
        "title": "Our futures still depend on the older one",
        "score": 1167,
        "url": "https://i.redd.it/qhtlyxnl0f9d1.jpeg",
        "content": "",
        "num_comments": 361,
        "comments": [
            "Next generation of men is gonna be very right wing",
            "Most Reddit post ever bro ",
            "Based on the comments here and others, fuck this sub is targeted and infested. The future affects you and Gen Alpha more than us. Most of you genuinely care. Please vote.",
            "As a minor, GO VOTE IF YOU CAN PLEASE PLEASE PLEASE",
            "Millennials really coming here and posting Avengers Assemble memes about politics. How are you guys not embarrassed?",
            "Ironically, (in contrast the every previous generation since the beginning of time) younger generations are not going to save anyone.  This is because our demographics are now becoming inverted due to very low birth rates.  Wealthy western and Asian countries will have old populations and older generations that will always wildly outnumber younger generations.  Countries arent getting younger, they are getting older.  The kids arent saving anyone.  Unless they figure out how to grow babies in artificial wombs.",
            "This is bulshit, and from the likes no one understands shit about how politics will effect the generations. The decisions made today will effect gen alpha and the type of place they live in the most. The old men soon to die wont live to suffer the consequences of their actions. Our future depends on the older people stepping down from running for office.",
            "If you saw voter turnout numbers among Gen Z, you would delete this.",
            "My generation settled in team politics. They bought in the lie that we must vote for the lesser evil or the whole bloody universe will explode. The days of grass roots movements in the major parties are over. I hope the younger generations will start backing independents or third party candidates.",
            "Not even just voters, this is how I see gen Z in general.\n\nWill always appreciate yall handling workplace bullshit especially. Boomers blame you even though weve been complaining about it too."
        ]
    },
    "Biden’s face": {
        "title": "Biden’s face",
        "score": 4228,
        "url": "https://i.redd.it/s593ks3n3d9d1.jpeg",
        "content": "This was Biden’s face when Trump was talking about Charlottesville being fabricated and that the videos were fake.\n\nU can see the horror in his eyes LOL.\n\nIt was just so funny seeing his facial expressions, like he really couldn’t believe the utter bullshit he was hearing while hon national tv with millions watching.\n\nAnyways…. That debate was something……………………..\nI keep hearing a lot of “Trump won” “Biden lost.”…… truth be told, this is actually scary if they are our only option.. which they shouldn’t be.\n\nSo let’s go out there and vote cause…. There wont be a future for us if we don’t get these candidates replaced. ",
        "num_comments": 418,
        "comments": [
            "He was in power saving mode between questions obviously lol",
            "Both of those guys are not fit for office",
            "I still cant believe they talked about golf",
            "Why are american presidential candidates so old!? Both guys will be 80+ during their time as president! Neither of these guys should be allowed to be president!",
            "Yeah I dont blame Biden looking like that after what Trump said about Charlottesville being fabricated ",
            "At least Biden didnt lose his train of thought and forget what he was saying several times. Oh wait, never mind.",
            "He looking like he just shat himself",
            "If nothing else good comes from this debate, Bidens expressions will lead to some funny meme formats",
            "You can't be a Republican or even just a critical thinking Democrat and post on Reddit, you'll get torched for posts like this",
            "Im voting for the guy  nazis are not voting for."
        ]
    },
    "Teenage rebellion": {
        "title": "Teenage rebellion",
        "score": 170,
        "url": "https://i.redd.it/besvc67z7h9d1.jpeg",
        "content": "",
        "num_comments": 38,
        "comments": [
            "Wait. Gen Z comes after millennials? Does that make me a millennial? I'm so confused.",
            "More like \"Yeah that'll end soon, in time, along with everything else you're passionate & happy about. Don't worry. You'll be miserable too\"",
            "That's actually a baby boomer, talking to a millennial, while his Gen x mom is out chilling with the Mexican cartel... ",
            "My parents cracked down on my teenage rebellion the moment I showed signs of it \n\nThey called my bluff a couple times, \"amazing how now you don't like/want to the moment we are ok with it\"",
            "Pretty much,. I'm enjoying how the boomers and gen x are losing their shit",
            "Every generation goes thru teenage rebellion. Its not that. Its the entitlement that seeps out of their pores every day.",
            "I am rewatching this show for the first time. Also I smoke weed now which I didn't my first time through. Doug is the best. Hands down.",
            "Oh god lmao Its basically me and my brother",
            "Idk about u but Im 22 and not a teen",
            "Isn't the oldest Gen Z around 27 atm?"
        ]
    },
    "Is this true Europe zoomers?": {
        "title": "Is this true Europe zoomers?",
        "score": 1537,
        "url": "https://i.redd.it/vr0586valc9d1.jpeg",
        "content": "",
        "num_comments": 576,
        "comments": [
            "I mean it makes sense, what have European conservatives conserved exactly?",
            "European nationalism is very different from the American understanding of nationalism and even then that varies by country - Irish nationalism for example is inherently left-wing and rooted in communist and socialist ideology, likewise being conservative in Europe is nothing akin to what Americans regard as conservative, be very mindful when trying to draw these parallels because theyre covering completely alien concepts to the average American",
            "I agree but I've noticed that who's kinda younger than me (2007-2009) are generally more right wing leaning and I've also heard a lot of people noticing this",
            "I mean... Pretty much, yeah. We don't really have young \"boring\" conservatism, we have progressives and nationalists, and the odd radical Libertarian (Which is much more focussed on ancap than whatever American libertarians are smoking). There are some older generations which are conservative, but very rarely the youth, presumably because they're not seeing a state of life they particularly want to conserve and just disagree on how to change it.",
            "European conservatism is dead. It started in the 80s and its died in the 2020s. Populism has taken over. Its entirely true.\n\nOur politics has become massively Americanised.",
            "It should be noted that Keith Woods is a far-right loon that believes Jews are dumping Muslims into EU.",
            "The alt right pipeline with the \"feminist gets owned compilation\" Like videos on YouTube is real and i almost fell into it, many of the people that are the same age as me and started pandemic as young Teens trying to find and identity fell into that.",
            "It's that guy a literal strasserist?",
            "Yes. Very true, also highly influenced in places with much migration with second and sometimes even third generations of migrants.",
            "Yeah, this sounds about right"
        ]
    }
}