{
    "June 23 - Weekly r/geometrydash Questions & Achievements Thread": {
        "title": "June 23 - Weekly r/geometrydash Questions & Achievements Thread",
        "score": 7,
        "url": "https://www.reddit.com/r/geometrydash/comments/1dmdjsq/june_23_weekly_rgeometrydash_questions/",
        "content": "Welcome to /r/geometrydash! This is a catch-all megathread for a variety of discussion topics that don't require their own individual posts. Here's an idea of some things you can share and talk about here:\n\n* Quick or common questions with closed-ended responses\n* Recent completions, progress on levels, or other in-game achievements, if you can't record footage\n* Asking for suggestions on levels to play or other opinions/feedback\n* Collab recruiting, planning, and organization\n* ...and much more! If you're not sure where to post it, this thread is likely the right place.\n\nCommunity Resources:\n\n* [Geometry Dash Discord Server](https://discord.gg/geometrydash)\n* [Pointercrate Demonlist](https://pointercrate.com/demonlist/)\n* [Geometry Dash /r/Place Discord Server](https://discord.gg/hZj5evMRZr)\n\nHelp:\n\n* [Setting up a user flair beside your username](https://support.reddithelp.com/hc/en-us/articles/205242695-How-do-I-get-user-flair-)",
        "num_comments": 46,
        "comments": [
            "just died on the gboy transition in supersonic for the 3rd time",
            "Allegiance 98%  I nearly fluked from 82, the ending is so hard and I passed it all just to die to the dumbest thing ever",
            "i got 16-26 on my beloved level (arcturus :3) out of boredom and it's hard to believe i even did that run on a top 30 extreme demon while my hardest is digital disarray LOL",
            "i beat acu as my 4th extreme in 27200 attempts on 60hz mobile; but it is not in my flair as i consider it my 2nd hardest(above lost love/sigsegv, below glisten), however i will not be able to play insanes/extremes for awhile due to my arms being signficantly weakened, as well as my fingers, so i will have other priorities for now",
            "I just beat Arctic Alpine as my first weekly demon (and my third demon overall).\n\n338 attempts!",
            "I got a 30-100% run on BoJ (It isnt too much better than my previous best run (34-100%), but I had just taken a 3-week break from playing the level, so Im honestly just happy I didnt lose my consistency)",
            "ALLEGIANCE 100% AFTER 6 MONTHS AND 41,340 ATTEMPTS I FINALLY HAVE AN EXTREME DEMON",
            "Beat Deadlocked as my first demon today on Mobile! Any recommendations for my next demon?",
            "Please recommend me some good levels that can build Ship skill cz im so bad at ship lol thanks (preferably Hard to Beginner Extreme Demon)",
            "My game is screen tearing every time I open a level and whenever I turn on v sync, there is a delay for some reason. Is there a fix?"
        ]
    },
    "Introducing the Unofficial GD Improvement Guide!": {
        "title": "Introducing the Unofficial GD Improvement Guide!",
        "score": 69,
        "url": "https://docs.google.com/document/d/1F42JgU1R0qAFFo0sh3TdYy3MXcT66myCKEXctrkGrD8/edit",
        "content": "Spent a few months working on this. dozens of hours of interviewing top players, condensing information, and making sure everything made sense. Enjoy!",
        "num_comments": 11,
        "comments": [
            "Kaiguy viewers hate this one simple trick!",
            "The definitive Garmin W\n\nGuaranteed to be better than the Scam, too...",
            "happy to have helped with this, I hope this will be useful to as many people as possible",
            "Woah thank you, exactly what I needed",
            "garmin still putting in the work to this day i see, epic fr o777",
            "What do you mean \"don't jump\"? How do you go over the spikes then?",
            "Could use this.",
            "very interesting, I like",
            "common garmin w",
            "Common u/GarminBro W"
        ]
    },
    "be honest, am I cooking?": {
        "title": "be honest, am I cooking?",
        "score": 436,
        "url": "https://v.redd.it/ewi6u58ubg9d1",
        "content": "",
        "num_comments": 72,
        "comments": [
            "Heres what your level would look like if it were stereo madness or nine circles",
            "\"Jesus Christ, you're moronical\"\n\n- level",
            "very good transition, i like how you're shown the gamemode in a stylish yet effective way and given a second before you actually change into it",
            "The Red letters say JESUS CHRIST, YOU'RE MORONICAL",
            "Cooking a Michelin star level thats for sure",
            "YES YUH UH OF COURSE HELL YEAH    YUP",
            "\"here's what your wave would look like if it was black or Chinese\"",
            "but what would it Look Like in Black or Chinese",
            "Good work mate! That's amazing",
            "Talk about some elbow grease in the kitchen."
        ]
    },
    "Am I a bad person for thinking this?": {
        "title": "Am I a bad person for thinking this?",
        "score": 140,
        "url": "https://www.reddit.com/gallery/1dr5wzo",
        "content": "I’ve played a few Michigun levels, and they were ass to say the least, I’ve seen comments saying stuff like “no disrespect and RIP to Michigun but this sucks” or something which keeps getting disliked, Am I considered a “bad person” in the GD community for hating Michigun levels?",
        "num_comments": 23,
        "comments": [
            "No. RIP Michigun, but his levels are not automatically untouchable because he passed. I personally believe his levels are annoying, but charming.",
            "no. you are absolutely free to criticize and hate his levels despite him having passed away. you're just hating his gp of his levels, not michi himself",
            "No. You're a bad person if you laugh at his death. You **aren't** a bad person because you hate his levels.",
            "No. You're still allowed to criticize his levels even though he passed.",
            "No any piece of art including gd levels arent immune to criticism just because the creator died.",
            "Separate The art from the artist, if you find his levels annoying to play, that's entirely fair and you're not disrespecting him just because he passed away.\n\nAs long as you only focus on the level itself, all complaints are valid.",
            "you're not a bad person, the levels do suck but that's not an attack on michigun himself",
            "not really. RIP Michgun, and his levels were revolutionary at the time. You don't have to like it at all. That's like saying you don't like XXX to a rap community. Just pay them the respect they deserve; you have something called freedom of speech.",
            "RIP, but i hate all of his levels and all of his parts in MC's. the gameplay is just so unbelievably annoying",
            "I commented on his level called double triple trial (his 2 star level I don't know if that was the name) and said: \"RIP Michi but this shouldn't be rated\" and hours laters I looked the comment and I saw I had 21 dislikes on my comment."
        ]
    },
    "Am I the only one who thinks this?": {
        "title": "Am I the only one who thinks this?",
        "score": 51,
        "url": "https://i.redd.it/zdjw3g9i4i9d1.png",
        "content": "",
        "num_comments": 5,
        "comments": [
            "It actually is like that. At first glance, UFO might seem like a free gamemode like the ship, because your every input registers into the icon, unlike cube and robot, which only register inputs when on the ground, but in actuality, one wrong input on the UFO, and you're fucked, because it completely throws you off your tracks with basically no way to recover, unlike ship which still provides some leeway. It's a really deceptive gamemode.",
            "That's how the part feels like but you do get a bit of room to decide when you jump into it, making it slightly different depending on how you do it if you know what I mean",
            "AGHHHH the last f*cling spike is the worst",
            "That ufo really does feel stupidly tight. Hardest part of michigun for sure.",
            "Once you realize that you can go a bit into the spikes, it's not AS BAD, still really tough tho"
        ]
    }
}