{
    "June 16 - Weekly r/geometrydash Questions & Achievements Thread": {
        "title": "June 16 - Weekly r/geometrydash Questions & Achievements Thread",
        "score": 12,
        "url": "https://www.reddit.com/r/geometrydash/comments/1dgz8nj/june_16_weekly_rgeometrydash_questions/",
        "content": "Welcome to /r/geometrydash! This is a catch-all megathread for a variety of discussion topics that don't require their own individual posts. Here's an idea of some things you can share and talk about here:\n\n* Quick or common questions with closed-ended responses\n* Recent completions, progress on levels, or other in-game achievements, if you can't record footage\n* Asking for suggestions on levels to play or other opinions/feedback\n* Collab recruiting, planning, and organization\n* ...and much more! If you're not sure where to post it, this thread is likely the right place.\n\nCommunity Resources:\n\n* [Geometry Dash Discord Server](https://discord.gg/geometrydash)\n* [Pointercrate Demonlist](https://pointercrate.com/demonlist/)\n* [Geometry Dash /r/Place Discord Server](https://discord.gg/hZj5evMRZr)\n\nHelp:\n\n* [Setting up a user flair beside your username](https://support.reddithelp.com/hc/en-us/articles/205242695-How-do-I-get-user-flair-)",
        "num_comments": 31,
        "comments": [
            "I beat Caput Mundi a couple hours ago as my second demon ever (and my first easy demon ever (and my first gauntlet demon ever))!!!!!!!!!!!!!!!!!!!\n\nlevel was absolutely beautiful and really fun (even though the ending part was kinda confusing)\n\nedit: forgot to mention, 134 attempts!!!\n\nhttps://preview.redd.it/synnvno1yu6d1.png?width=487&format=png&auto=webp&s=2dad29b49295b5f04c7239fa477e3ea6eefdd077",
            "https://preview.redd.it/sdmpadh54w6d1.jpeg?width=2436&format=pjpg&auto=webp&s=dcac22a115e7e1fe5a2043194cc1647431af4b02\n\nGot 89 on poltergeist this week as a 60hz mobile player. I dont think its gonna be a new hardest since so far i havent struggled with it too much. (My current hardest is supersonic)",
            "I deadass just pulled an EVW and fluked one of my hardest demons from 49% and beat in 456 attempts. And I thought I was gonna spend several days on this. Just how?\n\nhttps://preview.redd.it/5nv76kqmq37d1.jpeg?width=2340&format=pjpg&auto=webp&s=3af82232953ddad39424d4d2b6da2de6a8b977ff",
            "Almost finished with Deadlocked as my first Demon! Any suggestions for what I could do after Deadlocked?\n\nStarted the level roughly 5 days ago, made progress really quickly :D",
            "I beat B as my first medium demon 2 weeks ago, Color crusher as a new hardest and second medium a week ago, and im currently beating biru as my third medium demon, new hardest and 30th demon",
            "Pretty stupid one, but I hit 1 billion jumps by weighing down the jump button for 5 hours on 96333369 by CatGirlBlitz.",
            "I need a new hardest.\n\nMy hardest is currently Leyak and I have 76% on Acu but quit after dying from 71-76 way too many times.\n\nMy best skills are memory/learny and fast paced, but I am really horrible at ship.\n\nI want to do something harder than Acu that isn't Triple Six.",
            "I beat CraZy in 4272! It’s a fun level but holy shit I got unlucky. 97% 3 times…yeah\n\nhttps://preview.redd.it/b2qpf3yg6o7d1.jpeg?width=2160&format=pjpg&auto=webp&s=38dcd9e3cabed30637a405c77d9c970f37d0978f",
            "My 9 year old just beat the insane demon Poltergeist!  He had 6566 tries.  He’s super happy.",
            "I beat In Perceptible as my first medium demon. Is definitely easy demon or 9 stars in actual difficulty though."
        ]
    },
    "Geometry Dash Retrospective - A Klaux Animation (~2.7K layers total, took 5 months)": {
        "title": "Geometry Dash Retrospective - A Klaux Animation (~2.7K layers total, took 5 months)",
        "score": 1268,
        "url": "https://v.redd.it/2cm6ulnbiw0d1",
        "content": "",
        "num_comments": 126,
        "comments": [
            "Holy shit dude that’s incredible. The 3d scenes are insane.",
            "THIS IS INSANE!!!\n\nhttps://preview.redd.it/ipfkqjjaxw0d1.jpeg?width=640&format=pjpg&auto=webp&s=845ee6caf3021e0f907449997cd179672f3c11bf",
            "I dont even know which is gd and which is not, absolutely insane",
            "[removed]",
            "stcubing wants his AE license back",
            "absolutely goated, keep up the good work!",
            "Bro how are you this good at editing??? All im waiting now is for it to be recreated in gd",
            "someone name all the levels",
            "I think we have our first mythic autolevel",
            "I kept going \"hey I know that\" every 2 seconds lmao"
        ]
    },
    "Me and my friends got into a disagreement about this, Which game is harder?": {
        "title": "Me and my friends got into a disagreement about this, Which game is harder?",
        "score": 292,
        "url": "https://i.redd.it/4ffl9hprh18d1.jpeg",
        "content": "(I obviously said GD)",
        "num_comments": 154,
        "comments": [
            "As a player of both, I say both are difficult in their own ways and aren't comparable due to how differently their respective games work\n\n\nGeometry dash banks hard into tight timings, memorization, and generally very unforgiving gameplay, but the levels usually only last a few seconds to a few minutes in terms of how much gameplay\n\nJuke's towers of hell is a lot more reliant on special strategies for specific jumps, endurance, and much longer length (anywhere from a few minutes to hours to complete towers); but towers are generally more forgiving since you can catch yourself on lower floors if you fall",
            "As someone who thinks that Tidal wave is in the top 3 accomplishments in any video game bare minimum, Its GD and its not close, I think Trials of death in Mario make is about tied with Tidal wave (I believe that the individual that beat ToD was less equipped to beat it than zoink was to verify tidal wave, I also believe if Mario maker became competitive to the degree of gd, there would easily be more than one person who beats trials of death)",
            "i think coiv and tidal wave are both some bullshit",
            "You can't compare JToH and GD.\n\n\nGeometry Dash relies on precise clicks, jumps, gamemodes and speed to create a level. Not mentioning that it's in 2D.\n\n\nJuke's Towers of Hell relies on various mechanics such as client objects, mechanics, flicks, and glitches to form its towers, which are all in 3D (not minding CoTaW that utilizes a 2D section halfway through).\n\n\nThe building process however is kiinda the same on both games, you build creative gameplay, design it, spend months of your time making the level/tower, and what you get is a finished product that if executed well, will get the hearts of the players that beat it.\n\n\nif anyone asks, hardests are ToCA and a weekly easy demon (I can't remember the name😭)",
            "cant be compared. very different games, both based off user generated levels.\njtoh has a much higher skill ceiling potential but gds difficulty has been raised much higher due to a bigger playerbase",
            "gd there is no competition",
            "kinda obvious, does juke's tower of hell have levels like emptiness",
            "Idk bruh they both crazy.",
            "I play both, i’d say they are hard for their own reasons, but JTOH has a greater capacity for difficulty, but GD’s peak is much better explored and explorable\n\nIt being 3D and the fact a whole coding language and engine is used should be all the proof needed for its capability for difficulty",
            "jtoh is younger so ofc it's not as established in terms of difficulty yet\n\nHaven't had a new top 1 for months and it has like 10 victors\n\njtoh has a lot more potential for difficulty than in GD since the movements can become more complex, precise and not to mention that it's 3D which allows for more room in terms of error\n\njumps in jtoh are nearly impossible compared to gd since every tower is different and has many mechanics and different kinds of jumps that need learning, stratting and technicality, while gd is just clicking\n\ngd rn is harder, but jtoh has so much more potential we just beat our first unreal tower like 7 ish months ago which is probably around where bloodlust is now prob\n\nwhat also proves its difficulty is the large community gd has that has beaten an extreme, compared to those who are capable of beating any intense tower in the game\n\nI do play both for the purpose of reliability, hardests are ToGF and diligence"
        ]
    },
    "throwback to the time my friend thought he could reset the gd shop": {
        "title": "throwback to the time my friend thought he could reset the gd shop",
        "score": 86,
        "url": "https://i.redd.it/60lwwynn738d1.png",
        "content": "",
        "num_comments": 7,
        "comments": [
            "bro mustve looked for hours where the microtransaction store was",
            "I mean there is a geode mod for it but i dont think geode is up now soooo",
            "“What do you mean it doesn’t refresh?!”",
            "_\"where can i buy V-orbs?\"_",
            "Exactly what I was about to say",
            "pretty sure geode betas have dropped, i have a friend back on geode",
            "Beat an extreme demon for 500 v-orbs :)"
        ]
    },
    "I BEAT QDYNAMIX 100%, HAVEN'T BEATEN AN EXTREME DEMON IN 2 YEARS LETS GO!": {
        "title": "I BEAT QDYNAMIX 100%, HAVEN'T BEATEN AN EXTREME DEMON IN 2 YEARS LETS GO!",
        "score": 753,
        "url": "https://v.redd.it/ef22dijlfz7d1",
        "content": "",
        "num_comments": 102,
        "comments": [
            "I was going to say “I wish you did a backflip” but then you did one",
            "I thought to myself, “this guy looks a lot like KingSammelot”. Then I realized you actually are KingSammelot. GG!",
            "GG! how hard is it?",
            "**HE AIN'T THE KING FOR NO REASON** 🔥",
            "gay demon?",
            "Common KingSammelot WWWw, great mashup too GG",
            "GG",
            "I didnt even know queer dinamix exists",
            "my poor eyes\n\nhttps://preview.redd.it/q08pt3yuuz7d1.jpeg?width=564&format=pjpg&auto=webp&s=7b3f8748c5c142803a37e49a9263912aa5bb4746",
            "ggs"
        ]
    }
}