{
    "Russia Invasion of Ukraine Live Thread": {
        "title": "Russia Invasion of Ukraine Live Thread",
        "score": 68,
        "url": "https://www.reddit.com/live/18hnzysb1elcs",
        "content": "",
        "num_comments": 154,
        "comments": [
            "It will be interesting to see how the Russian military adapts and changes over the next couple months. Despite many units having low morale, the attempted(?) mutiny by Wagner, the deliberate targeting of their artillery assets by Ukrainian counter battery fire, and now the removal of frontline commanders due to political maneuvering, they still keep going. \n\nPeople like to talk in absolutes, like saying the Ukrainian counter offensive is failing, or that the Russian units are under equipped. I think it’s best to assume that most of us haven’t the slightest clue what is happening at any given moment. No matter how much information we get in real time, it’s still a war.",
            "Amid the ongoing conflict in Ukraine, the United States takes a steadfast stance in defense of Ukraine's sovereignty. But this goes beyond politics; it's a testament to the enduring power of principles. Through sanctions, military aid, diplomacy, and vocal support, the U.S. raises an essential question: In a world where nations often grapple with competing interests, what's the true measure of commitment to international norms and democratic values? It's a reminder that, ultimately, the pursuit of a peaceful and sovereign future is a collective responsibility we all share in this complex global landscape.",
            "Move over Ukraine, USA got a new old side piece, Israel.",
            "By looking at this and a few other conflicts (Vietnam, Iraq, Afghanistan) I got to a conclusion that we are hungry of some metrics indicating a win or a loss. We lool at destroyed equipment, expended munitions, eliminated personnel and ground covered.\nBut I still struggle to make sense of those numbers. For example, in Vietnam the losses were indicating a clear upper hand by the US, and yet the outcome was nowhere near where that indication was pointing to.\nDoes anyone have any metric that I have missed that may come to help here? Thank you in advance.",
            "Where exactly did the claim that \"NATO is at fault for the war because it was provoking Russia\" come from? I know about Mearsheimer's lecture on Youtube, but is he the first person to use this argument or did he get it from someone else?",
            "When will this end?",
            "\"Pro-Putin Disinformation Warriors Take War of Aggression to Reddit\"\t\n\nhttps://cepa.org/article/pro-putin-disinformation-warriors-take-war-of-aggression-to-reddit/\n\nhttps://www.reddit.com/r/europe/comments/18hcsvw/proputin_disinformation_warriors_take_war_of/\n\n\"There is evidence that Russia and its supporters have engaged in a broad campaign on the site for some time. In 2019, the tech blog, Engadget, noted that Russian propaganda was specifically targeting at least 89 leftwing and rightwing subreddits, “suggest[ing] a Russian-led attempt to antagonize and influence Americans online, which is still ongoing.”\"",
            "So reports are coming in that Wagner has just been decapitated in Russia. A plane carrying Prigozhin and other Wagner folks has crashed killing all onboard.\n\nI suppose Prigozhin's fate was sealed, but I wonder what happens next now.",
            "What is the likelihood that South Korea sends advanced weapons to Ukraine if North Korea sends ammunition to Russia? Will the use of North/South Korean weapons cause any immediate shift in the battlefield in favour of either side?",
            "Russia indeed throwing those bodies into the meat grinder, now those casualties are on putin's shoulders, but if Ukraine, God forbid, losses, all western world would be guilty and those casualties would be on them. I hope you guys understand what I'm saying, success is never blamed. We better help Ukraine as much as we could."
        ]
    },
    "Sudan’s Civil War and the Future of Information Warfare": {
        "title": "Sudan’s Civil War and the Future of Information Warfare",
        "score": 12,
        "url": "https://encyclopediageopolitica.com/2024/06/28/sudans-civil-war-and-the-future-of-information-warfare/",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Submission statement: In this piece, our newest writer Adam Greco examines the information warfare domain of Sudan's brutal civil war, and explores what it can tell us about the future of warfare. Adam examines the methods used by the various actors (often trained by the same actors, leading to confusing overlaps), as well as their objectives."
        ]
    },
    "American involvement in Ukraine": {
        "title": "American involvement in Ukraine",
        "score": 61,
        "url": "https://www.reddit.com/r/geopolitics/comments/1dr3285/american_involvement_in_ukraine/",
        "content": "I got into a argument with my dad today about Ukraine and he’s an isolationists type, I could explain why the United States needs to defend its European Allies but it wouldn’t work as he’d always want to know how it would directly help the United States, could someone help me?",
        "num_comments": 96,
        "comments": [
            "The US built its global economic empire as a defense strategy, keeping wars abroad protects Americans, allowing nations to conquer other lands threatens the geopolitical system that has kept America safe and even defeated it's only real geopolitical rival in the modern era the Soviet Union. Allowing belligerent nations to grow in power threatens the security of the USA.",
            "60% of the aid money allocated for Ukraine was spent here in the US. All the equipment sent, while taken from non-active reserves,  still has to be replaced. All arms for the US military are required to be produced domestically. \n\nAlso, all the aid is Lend-Lease, so it'll get paid back with interest. Also, because of the American equipment being showcased, orders for US equipment are through the roof.\n\nFurthermore, after the war, if Ukraine is victorious, it'll have to be rebuilt. And which country has the capacity, expertise, and logistics to take on rebuilding a whole country? Imagine how open Ukraine might be to US companies setting up shop.\n\nNext, all our other issues, like the Houthi attack on shipping, which affects us, whether we like it or not, can all be traced back to Russia via Iran.\n\nThen there is China. Taiwan is the leading producer of microchips in the world. Everything we use nowadays requires this supply to be secure. If Western equipment being used by people trained crash course stye can stop the Russians trying to cross their own border, how well will an amphibious invasion crossing a 100Km of open water do?\n\nThis conflict has ripple effects. And isolationism went down with the Arizona at Pearl Harbor. Our quality of life is only capable because we are interconnected with the rest of the world.\n\nWould that be helpful in any way?",
            "In what world is letting another country get bigger and stronger than you by letting it absorb more land, people, and resources into it while you sit by doing nothing ever a good idea? If you don't like them now, you definitely won't like them when they become 10x than now. Even if you have no issue right now, issues can always develop in the future, by which you'd have to deal with someone who's 10x than before.",
            "The US has a strong military to defend itself from its adversaries and act as a deterrent to ww3\n\nSupporting the Ukrainians does both.  First? It degrades the ability of the Russians to wage war and the Russians are one of our primary adversaries.  Second, letting the Russians go hog wild in Europe is what will cause ww3.",
            "the simplest and most truthful answer is that Ukraine winning will help the west project hard and soft power and weaken the east, which helps cement the dominance of the USD and the American economy\n\nwhen the US loses power and influence abroad, people start looking to deal in other currencies and strike agreements with other nations, it weakens the USD and the entire US economy with it",
            "If we let Russia take Ukraine, there's a very good chance the Russians will expand further west into Europe where they have various territorial and cultural claims and they may eventually make it somewhere in Europe where the US has strong interests in and will inevitably be drawn into a significantly more costly war, perhaps within a generation. \n\nIn contrast, Ukraine seems to be able to match Russia on the battlefield (when they have US military aid) and are bleeding the Russian military of personnel and equipment--all without the use of US troops and at around 5% of the DOD's annual budget.",
            "Directly, I don't think it actually helps the US. It does help the US indirectly as it is draining Russia's military and cash far more rapidly than Russia can sustain.  The war is comparatively low cost for NATO.  Generally, the common wisdom is that Russia will run out of equipement by 2026 or so if something radical isn't done to replenish it. Right now, Russia is mostly coasting off the reserves of the USSR, especially in terms of military equipment. If Russia stops now, they could possibly rebuild their reserves of equipment in 10 years or so, if they really go on a focused building program. In a couple more years, it could take them a *generation* to rearm to the level that they were at before the war. \n\nIn general, the current way things are going is good for NATO, since they can bleed Russia of resources, can easily beat any possible investment Russia could economically put into the war, and can do so without risking the lives of their citizens.",
            "Same reason we defended the French and British from the Germans.",
            "You should tell your dad that his way of thinking is what caused America to eventually get forced into WW1 and WW2.\n\nShutting the windows, pretending everything is fine, while fascists run rampant across the globe, is only going to succeed in delaying conflict. It will come, and the longer you wait to address it, the worse it hurts.",
            "The US’s most notorious enemy is being kept at the eastern border of Europe in a non-NATO country largely due to US + NATO support. The US must show that it will defend its allies in the face of an enemy invasion, especially with the possibility of a Chinese invasion of Taiwan."
        ]
    },
    "Why Do India and China Keep Fighting Over This Desolate Terrain?": {
        "title": "Why Do India and China Keep Fighting Over This Desolate Terrain?",
        "score": 4,
        "url": "https://www.nytimes.com/2024/06/27/magazine/india-china-border.html",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Submission Statement:\n\nThe article gives a detailed account of the 2020 Galwan Crisis, a critical point in India China relations after the 1962 war. \n\nIt gives an account of the history and context related to the event as well as subsequent efforts by both countries to bolster their position and strategic interests.\n\nAlso gives an account of the 'sinification' intent by Beijing for the Buddhist population in the state of Arunachal Pradesh",
            "1. Sovereign land must be protected however small or desolate might be.\n\n2. This practical piece of land is at a high altitude which works as a sort of watchtower. Which ever set up base there can watch over the other country. And none of them want to lose that advantage."
        ]
    },
    "Best sources/sites for the analysis of specifically French or Dutch politics?": {
        "title": "Best sources/sites for the analysis of specifically French or Dutch politics?",
        "score": 9,
        "url": "https://www.reddit.com/r/geopolitics/comments/1dqz17x/best_sourcessites_for_the_analysis_of/",
        "content": "Hi! I've recently taken an interest in Western Europe, due to the snap elections in France, and studying the Dutch far right little bit. So, I'm looking for analysis for these two countries. Many thanks! ",
        "num_comments": 1,
        "comments": [
            "Submission statement: I've recently developed an interest in European politics, and so I'm looking for sites focusing on specifically the two countries I've taken an interest in. I looked at the think tanks on the wiki, and they all seem to focus on international affairs instead of intranational politics. Any sources are appreciated."
        ]
    }
}