{
    "See here: r/German's WIKI and FAQ. Please read before posting, and look here for resources!": {
        "title": "See here: r/German's WIKI and FAQ. Please read before posting, and look here for resources!",
        "score": 770,
        "url": "https://www.reddit.com/r/German/wiki/index",
        "content": "",
        "num_comments": 41,
        "comments": [
            "Does anyone know of a site that lets you look up all the prefixes for a word such as a verb? Ex. If you type in 'Stehen', you'd get 'stehen', 'aufstehen' uzw.",
            "Why is Wo where, and why is Wer who?\n\nThe logic in me has a hard time not seeing Wo has who and wer as where",
            "Not a site but the \"German Verb Conjugator\" app by Ian Tipton. In options/settings change the (default) search type from \"Start\" to \"Wildcard\"",
            "I don't but it's a brilliant idea and would be super useful, I think it's my new mission to find one!",
            "Also on new reddit, the wiki didn't show up anywhere on the page. So having a stickied post is great",
            "I had made that point in the past as well, hooray for us :)",
            "Also, low effort \"i can't read the wiki\" posts are finally getting locked!\nNice!",
            "Wie kriege ich den Native Label?",
            "Das kommt auf die App an, die du benutzt, bei manchen kann man das gar nicht. Am einfachsten ist es, dich mal auf der Webseite einzuloggen, da findest du es einfach in der Sidebar. Im Reddit-Jargon nennt sich das \"Flair\".",
            "[deleted]"
        ]
    },
    "Announcement: Issue with requiring a link to post and how to resolve it": {
        "title": "Announcement: Issue with requiring a link to post and how to resolve it",
        "score": 7,
        "url": "https://www.reddit.com/r/German/comments/1dp4pxw/announcement_issue_with_requiring_a_link_to_post/",
        "content": "Hi Everyone,\n\nWe have received a lot of mod reports recently from users who are only able to make posts if they include links. This problem affects some users and not others, and we do not currently know what the cause is. Indeed, it seems to be a Reddit-wide problem, as users on some other subs are experiencing similar issues.\n\nOne solution that often works is to change the method of posting. For example, if you are currently using the regular Reddit website, switching to [old.reddit.com](http://old.reddit.com) or the app can often solve the problem. If doing this does not work, please continue to feel free to reach out to us.",
        "num_comments": 4,
        "comments": [
            "Having read a few posts/threads where this is addressed it looked to me like this is primarily happening to people using the reddit app on smartphones? Just an observation.",
            "So I actually personally experienced this issue on a different sub. When I tried to post on that sub using new Reddit on my computer, it did not work, but I was able to post using old Reddit. \n\nI then decided to try making a test post on my iPhone, and the post button appears, so it seems that it would work on my phone too. But it could be that the issue affects different people on different subs differently.",
            "Yes, unfortunately not, and the problem now doesnt only affect Android users. \n\nThis is also not an issue on the other sub that I moderate, but, as I mentioned above, did happen to me on a different sub (using two different browsers on my MacBook).\n\nI just hope that these workarounds work for everyone.",
            "I [reported](https://new.reddit.com/r/ModSupport/comments/1cydk3v/android_client_requires_web_link_to_post/) the issue a month ago. Looks like it wasn't fixed yet."
        ]
    },
    "TIL how Pfirsich is spelled (correctly!)": {
        "title": "TIL how Pfirsich is spelled (correctly!)",
        "score": 49,
        "url": "https://www.reddit.com/r/German/comments/1dr6ps6/til_how_pfirsich_is_spelled_correctly/",
        "content": "I've been a learner of German for years now and I'm hovering around B2 level. For some reason I would always think that peach in German is Pfirsch.\n\nOnly today, while listening to a podcast did I come to the epiphany that it's called Pfirsich, with an extra i in it, changing my entire viewpoint on peaches.\n\nThroughout your German adventure, what is a word you were convinced is spelled in a way you thought it was correct, but later turned out you were wrong the whole time?",
        "num_comments": 43,
        "comments": [
            "I genuinely learnt this the other day ordering ice cream! I said \"Pfirsch\" and my boyfriend kept saying they don't have cherry...",
            "I know how it's pronounced, and how it's spelled too, afterall I'm a native, but any time I see Pfirsich I consistently misread it as Pfirsch. The i is really small, so I overlook it between the s and the ch",
            "There are southern German dialects that actually say \"Pfirsch\". (Pfurrsh).",
            "\n\nBrb, reassessing my whole German vocabulary",
            "I had the exact same with Pfirsich! \nAnother I had was \"eklig\", I always thought it was \"kelig\" for some reason",
            "I love my language even when it has such ridiculous words like Pfirsich, Pflock, Bauch and Schlauch.",
            "Here's a fun one for you: In my local dialect, Pfirsich is called Peesch. :)",
            "Not with German, but I did a Duolingo Hebrew course once and always thought the Hebrew word for peach is , pronounced aporsek. Turns out the o was wrong all along and its actually , afarsek/afersek. The day I realised I was like - hold on that sounds a whole lot like ein Pfirsich. Googled it and fuck yeah, theyre actually related! Both are taken from the Greek word for Persian, as they were called Persian apples.",
            "I also thought that Pfirsich was spelled Pfirsch for a long time! \n\nTill I was in the supermarket one day and I asked my boyfriend if we should buy some \"Pfirsche\" and he laughed me out of the store.",
            "Never came to my mind as a native but its actually quite funny. Imagine ordering Pfirrsch :D \n\nGlad you found the mistake, the illusive i is awesome"
        ]
    },
    "Too many commas?": {
        "title": "Too many commas?",
        "score": 6,
        "url": "https://www.reddit.com/r/German/comments/1drac2q/too_many_commas/",
        "content": "I came upon this example dialogue in my B1-B2 conversational book.\n\nI wonder if this is a typo since there are many commas being used in one sentence.\n\nThe question in the dialogue:\n\n(Was ist das Erste, was Sie tun, wenn Sie aufwachen?)\n\nAnd the answer, the one with “too many” commas:\n\n“Das Erste, was ich mache, wenn ich aufwache, ist, ein Glas Wasser zu trinken.”\n\nIs this correct use of commas or a typo? \n\nEdit: changed “Wasss” to “Wasser” (typo on my part)",
        "num_comments": 9,
        "comments": [
            "It's correct. \"..., was ich mache\" is a relative subclause, \"..., wenn ich aufwache\" is a conditional subclause.\n\nThey need to be separated by commas. If you remove them, you get \"Das Erste ist, ein Glas Wasser zu trinken\", and separating an extended infinitive with a comma is also correct.",
            "> Das Erste, was ich mache, wenn ich aufwache, ist, ein Glas Wass**er** zu trinken.\n\nThat's the perfect amount of commas. Not too many, not too few.",
            "Everythings correct. German uses lots of commas.",
            "It's certainly an unusually large number of commas - but they would all appear to belong there. The sentence itself sounds a little clunky, though. \"Nach dem Aufwachen trinke ich als Erstes ein Glas Wasser\" conveys the same meaning, for example",
            "Grammatically that's certainly true, but style wise I would rather write something like \"Wenn ich morgens aufwache, trinke ich erst einmal ein Glas Wasser\" to avoid that barrage of commas.",
            "There should still be a comma after \"aufwache\" to terminate the subordinate clause.",
            "Yes, its correct but stylistically its questionable imo\ntoo \"chopped-up\"\n\n(these types of sentences are also known as Schachtelstze)",
            "This is correct. You may have been taught in English classes that a comma marks a slight pause, but this is untrue: it serves a grammatical function. Even more so in German, where commas are used to separate clauses from each other whether or not you pause when speaking.\n\nIn this sentence, you start with the subject of the main clause, \"Das Erste\". Here the clause is interrupted by two subordinate clauses: \"was ich mache\" and \"wenn ich aufwache\" -- so they have to be separated from the main clause and from each other with commas.\n\nSo far you have \"Das Erste, was ich mache, wenn ich aufwache, ist...\" and from this point on it would normally be plain sailing: \"Das Erste, was ich mache, wenn ich aufwache, ist das Wordle-Rtsel.\" But in this case the complement isn't a simple noun like \"das Rtsel\", it's a whole clause: \"ein Glas Wasser zu trinken\". And because it's a whole clause, that too has to be separated from the rest of the sentence with a comma.\n\nAnd that's why the word \"ist\" is completely surrounded by commas. It looks weird, but those are the rules.",
            "Absolutely, danke schn!"
        ]
    },
    "Should I translate the name of a university from the original language to German, or keep original language?": {
        "title": "Should I translate the name of a university from the original language to German, or keep original language?",
        "score": 4,
        "url": "http://www.youtube.com",
        "content": "For instance, institutional names like \"University of California\" in English or \"Universidad de Salamanca\" in Spanish, should I translate them? The context is my Bewerbungsschreiben. Hope it is not a too obvious question, I got contradictory or no results in my search.\nPs: random link, I don't understand why am I requested to put one?",
        "num_comments": 5,
        "comments": [
            "Keeping the English original names is definitely okay within the context of a Bewerbungsschreiben. Maybe - if you claim to have very good German knowledge (>=C1) it might cause irritation, but otherwise it is definitely fine.",
            "That's the way to go.  \nGenerally Wikipedia can be great translation tool if you wanna make sure that translated a specific context.",
            "That's a great method, thank you! Strangely enough, for my case (not the examples I gave) the North American university is named in English while the Spanish one is in German, leading to some inconsistency in my letter.\n\nEdit: *most* Spanish universities are translated to German, for some reason.",
            "That doesn't really surprise me. It's probably mostly universities from the English speaking world that are mainly used with their native names. Besides Spanish, I'd expect the same with French, Italian or Swedish universities, eg. That doesn't necessarily mean that their original names wouldn't be understood in German of course.",
            "As long as it's clear what is meant and where it is, I wouldn't bother. Like your two examples are fine, but in cases like *Dschamiat al-Qahira* I would rather write \"Universitt Kairo\" for example. Or instead of *Prifysgol Caerdydd* I would go with either \"Cardiff University\" or \"Universitt Cardiff\".\n\nAs a rule of thumb, look up [your university in the German wikipedia](https://de.wikipedia.org/wiki/University_of_Notre_Dame) and go with whatever name they use."
        ]
    }
}