{
    "Please read before posting!": {
        "title": "Please read before posting!",
        "score": 530,
        "url": "https://www.reddit.com/r/germany/comments/ubio8u/please_read_before_posting/",
        "content": "Welcome to /r/germany, the **English-language subreddit about the country of Germany**.\n\n**Please read this entire post and follow the links, if applicable.**\n\nWe have prepared **[FAQs](https://www.reddit.com/r/germany/wiki/faq)** and an extensive  **[Wiki](https://www.reddit.com/r/germany/wiki/index)**. Please use these resources. If you post questions that are easily answered, our regulars will point you to those resources anyway. Additionally, please use the **Reddit search**. [Edit: Don't claim you read the Wiki and it does not contain anything about your question when it's clear that you didn't read it. We know what's in the Wiki, and we will continue to point you there.]\n\nThis goes particularly if you are asking about **studying in Germany**. There are multiple Wiki articles covering a lot of information. And yes, that means reading and doing your own research. It's good practice for what a German university will expect you to do.\n\n**Short questions** can be asked in the comments to this post. Please either leave a comment here or make a new post, not both.\n\n**If you ask questions in the subreddit, please provide enough information for people to be able to actually help you.** \"Can I find a job in Germany?\" will not give you useful answers. \"I have [qualification], [years of experience], [language skills], want to work as [job description], and am a citizen of [country]\" will. If people ask for more information, they're not being mean, but rather trying to find out what you actually need to know.\n\n----------------\n\n**German-language content** can go to **/r/de** or **/r/FragReddit**.\n\nQuestions **about the German language** are better suited to **/r/German**.\n\n**Covid-related content** should go into **[this post](https://www.reddit.com/r/germany/comments/r7ui9b/megathread_corona_rules_vaccination_questions_etc/)** until further notice.\n\n**/r/LegaladviceGerman/** has limited **legal advice** - but make sure to read their disclaimers.",
        "num_comments": 3694,
        "comments": [
            "Nice, a new pinned post.\n\nNow I would send the usual \"How to study in germany\" to this thread. \n\nYou should add a link to r/legaladvicegerman. Some questions are better ask there then here.",
            "Got an update for reddit on android today. Wiki seems to be working on the app now.",
            "@Mods maybe it's time to archive this thread and open an new one?",
            "Happy new year, folks.",
            "This might be slightly OT but anyone here knows what happened to /u/mkugelfisch? She was one of my fav. users in this sub but now her account is gone.",
            "Hi Mods! Thanks for the great job running the sub ❤️\n\nI found a couple of websites that are helpful for traveling in Germany. Looking quickly I didn’t find them mentioned. I leave them here anyway. Might be a nice addition.\n\nbahn.guru \n\nTo find cheap trains tickets.\n\ndirekt.bahn.guru \n\nTo find direct trains from each station.",
            "Mods, could we maybe get a sticky post for the upcomming public transport strike? The posts start piling, and i am sure there will be more",
            "So this is somewhat off-topic, but I found it interesting and figured some people here might too: [Award ceremony with obstacles: Winner of the Domagk Award ends up in Munster instead of Münster](https://www.medizin.uni-muenster.de/fakultaet/news/preisverleihung-mit-hindernissen-traegerin-des-domagk-preises-landet-in-munster-statt-in-muenster.html)\n\nTL;DR is that the recipient of an award was supposed to pick it up at a ceremony in M**ü**nster (Westphalia, 310.000 inhabitants, known for bikes) but instead took a train to M**u**nster (Lower Saxony, 15.000 inhabitants, known for tanks) and thus missed the ceremony. Don't disregard the umlauts people, they make a difference of 250 km!",
            "I apologize for my ignorance from the start. I don't know if you know that Baumkuchen is immensely popular in Japan and thanks to worldwide shipping, I've been really enjoying them. I heard rumors that in Germany, Baumkuchen is usually eaten like once a year on a holiday but I couldn't find much info on that. Is that true? You can't just go to nearest bakery or grocery store to purchase them? Is it popular or is there another dessert that dominates social gatherings? Also would you say German Baumkuchen is different than the ones sold in Japan?",
            "Next bahnstreik was just wnnounxed, according to spiegel. \n\nIf the mods want to re-pin the last megathread, i am willing to edit the post with the new info as it comes out tonight"
        ]
    },
    "European elections 2024 + local elections in 9 federal states": {
        "title": "European elections 2024 + local elections in 9 federal states",
        "score": 16,
        "url": "https://www.reddit.com/r/germany/comments/1dbz0tl/european_elections_2024_local_elections_in_9/",
        "content": "There is a lot of voting today! Primarily the 2024 European elections, as well as local/regional elections (or run-off elections) in Baden-Württemberg, Brandenburg, Hamburg, Mecklenburg-Western Pomerania, Rhineland-Palatinate, Saarland, Saxony, Saxony-Anhalt and Thuringia. We wish all voters every success in folding their ballot papers and all poll workers strong nerves when counting. \n\nBe aware, most links are in German. If you have good alternatives, please provide them via Modmail.\n\n\n**European election 2024**\n\nElection results and polls from Germany\n\n|||CDU/ CSU|AfD|Grüne|SPD|BSW|FDP|Linke|FW|Die PARTEI|Tierschutzpartei|\n|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|\n|Ipsos|07.06|30|14|15|15|7|5|3|3|n/a|n/a|\n|FG Wahlen|06.06|30|14|14|14|7|4|3|n/a|n/a|n/a|\n|Institut Wahlkreisprognose|01.06.|30,5|15,5|15,5|13,5|6,0|4,0|3,0|2,5|1,5|1,5|\n|INSA|31.05.|29,0|16,0|13,0|14,0|7,0|4,0|3,0|3,0|n/a|n/a|\n|Infratest dimap|29.05|29,0|14,0|14,0|15,0|6,0|4,0|3,0|3,0|n/a|n/a|\n|FG Wahlen|29.05|30,0|14,0|15,0|14,0|6,0|4,0|4,0|n/a|n/a|n/a|\n|**Election result 2019**||**28,9**|**11,0**|**20,5**|**15,8**|**n/a**|**5,4**|**5,5**|**2,**|**2,4**|**1,4**|\n\nCurrent status of the distribution of seats in the EU Parliament by political group:\n\n|[EVP (Christian Democrats)](https://www.eppgroup.eu/de/)|[S&D (Social Democrats)](https://www.socialistsanddemocrats.eu/de)|[renew europe (liberal)](https://www.reneweuropegroup.eu/)|[Grüne/ EFA (green)](https://www.greens-efa.eu/de/)|[ID (right-wing)](https://de.idgroup.eu/forms/user_sessions/new)|[EKR (Right-wing conservative/populist)](https://www.ecrgroup.eu/)|[Linke](https://left.eu/)|Non-attached|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|176 (24,96%)|144 (20,43%)|102 (14,47%)|77 (10,07%)|64 (9,08%)|64 (9,08%)|38 (5,39%)|46 (6,52%)|\n\n**Forecast/projection**\n\n||CDU/ CSU|AfD|SPD|Grüne|BSW|FDP|Linke|Volt|Other|Voter turnout|\n|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|:-|\n|[ARD/infratest dimap](https://www.tagesschau.de/wahl/archiv/2024-06-09-EP-DE/index-content.shtml)|29,6|16,4|14|12|5,7|5|2,8|2,8|11,7|64%|\n|[ZDF/Forschungsgruppe Wahlen](https://www.zdf.de/nachrichten/thema/europawahl-142.html)|30|16,1|14|12,4|5,9|4,9|2,9|3|10,8|65%|\n\nTime: 18:30\n\nCollection of links:\n\n* [Wahl-O-Mat European elections 2024](https://www.wahl-o-mat.de/europawahl2024/)\n* [Overview of all parties standing for election in Germany](https://www.zdf.de/nachrichten/politik/deutschland/europawahl-2024-parteien-deutschland-100.html)\n* [Overview of all pan-European parties and their lead candidates](https://www.europawahl-bw.de/eu-parteien)\n   * Note: The President of the Commission is neither directly elected by the voters nor by the EU Parliament, but by the heads of government. Top candidates therefore have a more aesthetic role\n* [Analyses on davum.de](https://dawum.de/Europawahl/)\n\n* Livestreams:\n   * [phoenix](https://www.phoenix.de/livestream.html) - starting 17:00 Uhr\n   * [ARD](https://www.ardmediathek.de/live) - starting 17:30 Uhr\n   * [ZDF](https://www.zdf.de/live-tv) - starting 17:35 Uhr\n   * [arte](https://www.arte.tv/de/live/) - starting 19:10 Uhr",
        "num_comments": 66,
        "comments": [
            "Well, fuck.",
            "I guess I'll learn Russian and Chinese then.",
            "The fact that it is the German young people who want fascism does not bode well for Germany, or the world's, future. I guess 'never again' really means about 80 years.",
            "What problems have Germans politicians/the current government ignored?\n\nI know the question is probably very open and general, but I just keep seeing people blaming the election results as a consequence of the current government \"ignoring problems\".\n\nI'm not judging anything, I'm just uninformed and would like to change that. There's no trick, sarcasm or political bias in my question. I seriously just want to know which problems people are claiming the current government failed to address.\n\nThank you for any answers this gets.",
            "hello guys\n\nI just graduated medical school and im currently in the pathway of pursuing medical residency in Germany , i should land a medical residency in Germany by next year .\n\nI recently saw that AFB has won significant portion in the EU and while i know it is the opposition party i didn't know much about it . Upon googling further i was shocked to learn that they are **extremely right and even considered Neo Nazis by some Germans . I also came to find that they are extremely Xenophobic and misogynistic in nature the most shocking thing of all is they do have a huge following in Germany with such radicalized and ardent supporters .** i have seen such polarization , right wing radicalization happen in my own country and it was ugly where the party supporters feel they are superior to other humans around them and impose their radical views on the rest , claim anyone who opposed their views as antinational .\n\nI'm a south east Asian and brown skin color person , which makes me kind of scared now what will happen if they come to power which seems like a very likely outcome , i will be at the middle of residency by the time ... will i be subjected to racial slurs , discriminated and been looked down upon as the stigma around being a racist/supremist would have be broken ? coz if a party in power assures its the normal thing to do then the citizens will follow suit usually ...\n\nFrom what i heard of doctors who work in Germany who came from my country , they have experienced subtle racism but they people always keep to themselves coz of the fear of embarrassing themselves , but thats about it on the contrary most of the Germans they met were super sweet and extremely helpful . The German colleagues in the hospital have been so well accommodating and very amicable as opposed even doctors from own country\n\nBut reading about the articles online about the activities of AFB has left me least to say horrified , to the extent im reconsidering my decision to pursue my residency in Germany.... from what ik i wouldn't be having a problem with immigration status as im a skilled worker that's not really the issue , what bothers me the most is their attitude towards immigrants, people of different ethnicities and im really scared the German people will follow suit , thus resulting in me having a very uncomfortable experience in your country where i would end up feeling not welcome at all !\n\nwhat do you guys think ? am i a being overly concerned ? i would love to hear the status quo there from the eyes of a German people\n\nPlease provide your valuable thoughts and insights on the situation , Thanks in advance :)",
            "Because I saw in another german sub that people say the right-wing parties would ruin the german economy and mostly uneducated young people voted for them, basically because they are stupid and just listen to \"easy solutions\", here a few links with regards to the german economic trends over the last decades of rule of other parties:\n\n[https://www.zeit.de/wirtschaft/2023-10/iwf-prognose-deutschland-schrumpft-rezession](https://www.zeit.de/wirtschaft/2023-10/iwf-prognose-deutschland-schrumpft-rezession)\n\n[https://www.destatis.de/DE/Presse/Pressemitteilungen/2023/06/PD23\\_N032\\_81.html](https://www.destatis.de/DE/Presse/Pressemitteilungen/2023/06/PD23_N032_81.html)\n\nThe years from 2021 onwards are particularly interesting here, although things are not looking good from 1990 at the latest. Now you can say GDP is not a good economic marker, and I would agree, but what about this:\n\n2015\n\n[https://www.faz.net/aktuell/karriere-hochschule/buero-co/oecd-studie-jeder-dritte-auswanderer-hat-studienabschluss-13623987.html](https://www.faz.net/aktuell/karriere-hochschule/buero-co/oecd-studie-jeder-dritte-auswanderer-hat-studienabschluss-13623987.html)\n\n2019\n\n[https://www.zeit.de/gesellschaft/2019-12/bevoelkerungsforschung-auswanderer-akademiker-deutsche-studie](https://www.zeit.de/gesellschaft/2019-12/bevoelkerungsforschung-auswanderer-akademiker-deutsche-studie)\n\n2023\n\n[https://www.agrarheute.com/management/recht/fachkraefte-hunderttausende-deutsche-wandern-gruende-608481](https://www.agrarheute.com/management/recht/fachkraefte-hunderttausende-deutsche-wandern-gruende-608481)\n\ndestatis has also shown a consistently negative balance of German migration since 2005, i.e. more people are leaving the country than coming back.\n\n[https://www.destatis.de/DE/Themen/Gesellschaft-Umwelt/Bevoelkerung/Wanderungen/Tabellen/wanderungen-zwischen-deutschland-und-dem-ausland.html](https://www.destatis.de/DE/Themen/Gesellschaft-Umwelt/Bevoelkerung/Wanderungen/Tabellen/wanderungen-zwischen-deutschland-und-dem-ausland.html)\n\nOf these, between 1/3 and 3/4 have university degrees, and the trend has been increasing over the period. So if you want to make the point here that it's only the stupid people who \"vote for populists with simple solutions\" you have to keep in mind that a not inconsiderable proportion of the well-educated and educated are constantly leaving the country and have already left. They basically voted with their feet, as the saying goes. What is left is people who do not want to leave, for one reason or another, and those who cannot.\n\nOn the other hand, it is not the right-wingers (don't say that the CDU under Merkel was right-wing) who have had the political and economic power in their hands in recent years. Ruin will come even without this, but who or what do you blame? It couldn't have been the previous governments (CDU, SPD, Greens)...",
            "[deleted]",
            "\n**Have you read our extensive wiki yet? It answers many basic questions, and it contains in-depth articles on many frequently discussed topics.\n[Check our wiki now!](https://www.reddit.com/r/germany/wiki/index)**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/germany) if you have any questions or concerns.*",
            "Hey there, guys! I really hope you read this post. I really hope it gets approved and not blocked.\n\nI’d love to tell you a little bit about myself!\n\nHi there! My name is Alex, and I'm 22 years old. I'm gay, and I live in Belarus, which is near Poland. I'm currently facing some money problems here, and I've decided that I don't want to stay in this country. I've always wanted to move to Germany, where I studied German, so I'm hoping that you can help me make this happen!  I've started working with a gay dating site and now I have a referral link. If you just follow it and register on the site, they'll give me a couple of dollars. And since I'm sharing it with you, I can get a hundred dollars from you that way!\n\nThat money will go towards getting my visa and finding guys in Germany.\n\nHey there! I was wondering if I could leave a link in my profile? Or maybe you could tell me how to do that? Thanks so much!",
            "[deleted]"
        ]
    },
    "What the actual fuck are the British fans doing to German cities? ": {
        "title": "What the actual fuck are the British fans doing to German cities? ",
        "score": 801,
        "url": "https://www.reddit.com/r/germany/comments/1dl8ieu/what_the_actual_fuck_are_the_british_fans_doing/",
        "content": "***I mean English fans. Please help me understand. Genuinely. Is this normal behaviour? I’ve never been to a euro cup and am from canada. What I’m seeing is shocking. \n\n\nUpdate: I am glad I asked this as it’s also changed my understanding of the German perspective. I really did not realize you were such a passive, chill, accepting bunch. I’m amused and impressed that you just shrug off the English fans, tolerate their behaviour, and move on with your lives. I respect this a lot. It is what it is. Guess I’ll just watch it as part of the show. Just maybe not from the fan mile again. \nDanke 🙏 ",
        "num_comments": 802,
        "comments": [
            "What exactly do you mean? Drinking until you drop, shouting bs half-naked? There haven't been any serious riots yet, have there?",
            "We intentionally put them to cities that already look like the UK so that they can feel right at home. Gelsenkirchen and the Frankfurt train station area.",
            "[This](https://www.reddit.com/r/funny/comments/42tizy/how_the_british_as_seen_by_americans_and_europeans/) s normal for us europeans.",
            "English fans*… the Scottish were a much better crowd.",
            "I don’t feel offended by the English fans. \n\nEverybody knows they’re a bit „special“ so we’re fine with them, I guess.",
            "You want /r/britain",
            "The Scottish have been nothing but a delight.",
            " im British; they do this back home too. Unfortunately football attracts seemingly the worse people in england . I live near a stadium (arsenal football stadium) and the streets are always in a mess after a big game. Hope this doesn’t represent all of us to you guys 😭",
            "The Polish fans in Berlin are trying to challenge the English fans",
            ">Is this normal behaviour\n\nNo it's not that's why your country went independent."
        ]
    },
    "What is the name of these kind of houses with this weird roof? I see a lot of these in Baden": {
        "title": "What is the name of these kind of houses with this weird roof? I see a lot of these in Baden",
        "score": 73,
        "url": "https://www.reddit.com/gallery/1dliwqa",
        "content": "",
        "num_comments": 22,
        "comments": [
            "The specific roof form is called a \"Schopfwalmdach\" or \"Krüppelwalmdach\" and is typical for traditional houses in the area. The houses themselves are simply known as \"[Schwarzwaldhaus](https://de.wikipedia.org/wiki/Schwarzwaldhaus)\".",
            "In English, it is a hipped-gable.",
            "Hahaha... yeah those crazy Germans... with their crazy roofs... hahahaha.... what are they thinking?\n\n**clicks link**\n\nHey, that looks like my roof!",
            "[https://de.wikipedia.org/wiki/Walmdach](https://de.wikipedia.org/wiki/Walmdach)",
            "The big overhang especially allows to go around the house to the stable and feed your cattle even when large amounts of snow fell.",
            "What's weird? The roof has a big overhang to protect the outer walls from rain and cast shade",
            "Snow is heavy",
            "In Englisch search for jerkinhead roof. Although since learning about it in my bachelor, like the others said, the literal translation would be \"crippled hip roof\"",
            "Here in the Rhineland we call this kind of house a \"Schwazwaldhaus\" (\"Black Forrest House\") because they are, like you mentioned, very common around the black forrest in southern Baden.",
            "Dark Helmet?\n\nMy first reaction was tons of attic space"
        ]
    },
    "This older man in my gym is clearly a voyeur and it's getting embarassing": {
        "title": "This older man in my gym is clearly a voyeur and it's getting embarassing",
        "score": 158,
        "url": "https://www.reddit.com/r/germany/comments/1dlb3ao/this_older_man_in_my_gym_is_clearly_a_voyeur_and/",
        "content": "I live in a relatively small town and usually go about 4-5 times a week to the gym, normally around the same time of the day.\nFor some time now, I've noticed this one older man (I believe he is somewhere between his 55-65) who is constantly in the changing room and passing from one side to another and throwing glances at naked men, including myself.\n\nI took the time to write this because today I saw him through the mirrors. He was gazing very penetrantly at me while I was in the showers. When I saw him, I immediately felt extremely uncomfortable and want to call him upon it, but wasn't sure if that would be wise and calmed myself down a bit. \n\nSome younger, very fit boys I know from this gym came in and we started discussing football and the EM and, I shit you not, he passed through us like six freaking times giving this air of \"ooops I forgot something\" and checking the boys in underwears or even naked from head to toe at every single one of his turns.\n\nI'm not sure what to do in this situation and I have a vague feeling that calling him out directly will do no good, maybe it will even cause me trouble if he's resentful or doesn't like it being called out. I'm also not sure how to approach this with the gym staff, I can't possibly imagine what they would or even could do.\n\nAs a foreign, I must ask: what would the average German do in a situation like this? How to deal with this situation as clean and effectively as possible? Is this something for the police, even?\n\nThank you for any answers this receives.",
        "num_comments": 42,
        "comments": [
            "As an average German, I'd ask the guy if he'd rather take a photo instead of pulling that shit.\n\nIf you're uncomfortable with talking to them, talk to the staff. A situation isn't going to magically change on its own if nobody addresses it.",
            "I think by the time this gentleman had come in for about the fourth time, I'd have asked the guys I was talking to, \"Am I imagining it, or is that man just really creepy?\" If they agree that yes, he was making them feel uncomfortable too, I would announce that I think we should talk to staff.\n\nTalking to staff is the next step. They can have a word with the guy; if they continue to get complaints, they can ask him to leave the premises and not return. There is probably a clause in the house rules about respecting other patrons' privacy that they could cite, for example. If he refuses to leave, or returns later, they can call the police and have him escorted off the premises or even arrested for trespass.",
            "Not German but Austrian and I'd say this is extremely creepy and you should definitely talk to him. Just speak in a tone that isn't aggressive but firm and tell him very clearly that you can tell he's looking at you and if he doesn't stop you will talk to the gym employees. (also I'd talk to the gym employees anyways: maybe find some other guys that have noticed the same thing and report the dude together that way you have more credibility) Don't let some man just harass you, that's not cool and shouldn't be accepted.",
            "Wow funny I’m reading this because today even I confronted a guy at the gym. He was facing me and completely staring while I was doing the exercises in the machine next to him. At some point I went further away from him to do a free exercise and he was literally leaning into the machine while staring for a looong time. I got stared at before but this was another level really. I was so uncomfortable.\n\nI just walked on him while looking at him in the eyes and then he smiled bc he thought it was a good sign and I just told him to stop staring, that is disrespectful. He immediately said sorry and I turned my back. It felt so good afterwards. I think he won’t do\nIt again anytime soon.\n\nThis is your sign to do it but maybe you don’t need to do it in such a confrontational way 😅",
            "Probably just making eye contact with him and firmly saying \"Is there something I can HELP you with?\" would work, just as long as your tone is definitely not friendly. I mean, there's always the option of ignoring him, because I don't really think there's anything the police could do if he hasn't touched anyone, etc. Depending on the gym's policy, they might talk to him about it if someone (or more than one person) complains to them about him. But yeah, I think pointedly making him aware might get him to stop without having to escalate things.",
            "I am a bit shocked, that so much people here say, that you \"have to\" talk to him directly. From a female point of view- i probably wouldn't do that. \nI would go to the staff, maybe check out other opinions and confront as a group. If only one person talks to him, he would maybe check out, if you are there an hide from you. But you cannot hide from staff.\nAlso: It is not your responsibility as a \"victim\" to bring yourself in an uncomfortable situation.",
            "From a country that is heavily focused on protecting personal data, this sort of crap shouldn’t be tolerated. Report it to the staff or speak to him yourself, but if you do it, nothing will change after one or two visits more.",
            "I'm an immigrant, now a citizen with dual nationality. I can tell you that, unless you're sneaking in without paying, the staff will be very interested in the pervert stealing the changing room. And will have no problems banning him.",
            "\n**Have you read our extensive wiki yet? It answers many basic questions, and it contains in-depth articles on many frequently discussed topics.\n[Check our wiki now!](https://www.reddit.com/r/germany/wiki/index)**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/germany) if you have any questions or concerns.*",
            "Now you know what it’s like to be a woman. When I report it, I’m the one who gets in trouble."
        ]
    }
}