{
    "[Plan] Friday 28th June 2024; please post your plans for this date": {
        "title": "[Plan] Friday 28th June 2024; please post your plans for this date",
        "score": 2,
        "url": "https://www.reddit.com/r/getdisciplined/comments/1dn8bxn/plan_friday_28th_june_2024_please_post_your_plans/",
        "content": "Please post your plans for this date, and if you can, do the following;\n\n\n\n* give encouragement to two other posters on this thread.\n\n* report back this evening as to how you did.\n\n* give encouragement to others to report back also.\n\n\n\nGood luck.",
        "num_comments": 43,
        "comments": [
            "🫧 HYGIENE ETC: Shower ✅Brush hair ✅Comb hair ✅Brush & floss teeth morn ✅night ✅moisturiser ✅hand cream & eye cream ✅📓 Gr@ Journal ✅❤️daily reminder: Speak kindly to self & self compassion 👍EFT ✅🤩Listen to affs & repeat ✅📱Have a call with the back to work program take notes etc. Be assertive while listening well! Try to be calm ❌ They didn’t call but I’m kinda pleased 😂 they might on Mon/Tues which is fine. ☺️ 😀Day 6 process of The Magic (The process on work!)✅👩‍💼Go to once wk volunteer job (1st day argh 😛😬) for training today. Bring a lunch! 🥪 📝 Take notes. 📸 Screenshot them. 📆 Together, schedule what day works for next wk. Be kind to yourself & positive NO unnecessary apologies or self deprecation! ✅🥣 Buy extra breakfast food on way home if you remember. ✅🤔 Do an LDR - what did I learn, do right etc. ✅And CHILL! ✅😌 For my records & rewards: 4, 8, 12",
            "(By the unnecessary apologies, what I mean is this: I had a job at one point where almost EVERY day they praised my performance & I kept saying “Sorry I couldn’t do more, I’ll try to do more tomorrow.” I’m not bringing that tomorrow or again! If I make a mistake I can say sorry, of course, or even just “Thanks for letting me know”)",
            "Good luck on your speaking exams, and I hope you the best.",
            "Have a lovely time with your friends.  Yay! The last of the speaking exams! All the best with your list today!\n\nI’m happy to see that even though you have a busy life you do make time for your friends and for your health & fitness too among other things &  I think that’s really good!",
            "Hi there,   \nWishing you a lovely day!",
            "Have a beautiful day, Cyan!",
            "Hello, Good luck with your things today. Wishing you a Chill day ;)",
            "Hope that you can finish all your tasks smoothly and well done.",
            "Really proud of you here! I know I struggle with this as well 💜",
            "Hope you have a nice day and finish work!"
        ]
    },
    "What daily ~10min habit has helped your mental/physical health the most?": {
        "title": "What daily ~10min habit has helped your mental/physical health the most?",
        "score": 1064,
        "url": "https://www.reddit.com/r/getdisciplined/comments/1dqmm4d/what_daily_10min_habit_has_helped_your/",
        "content": "As the heading says, share so that we can all start incorporating it.\n\n",
        "num_comments": 326,
        "comments": [
            "Hip/hamstring stretching.  Has cut my lower back pain by about 60%.",
            "me reading this thread and ending up with 5 hours worth of 10min habits to do every day ✍️",
            "Going for a 10 min walk as soon as I wake up, ideally as close to after sunrise as possible.",
            "Intentional gratitude.  Any brain activity acts like a muscle, you get stronger the more you do it, and if you start the day just saying out loud (sounds stupid but it's important) something you're grateful for, AND WHY (the why is important) you're gonna get really good at seeing the upside of your day.  Bonus points if you practice being grateful for stuff you don't actually like.",
            "Complete boredom, just stare at a wall in your room all alone.",
            "10 minute declutter of every room 2x a day",
            "10 mins of running. crazy how our ancestors used to run like 8 hours a day prob lol and now we can barely get ourselves to run 10. it makes such a huge diff. ancestors must have all been like gigachads mentally and physically, seriously",
            "I decided to start my mornings by reading a challenging book, especially non-fiction instead of picking up my phone and flooding my mind with petty information. Eventually, it became difficult to limit myself to just 10 minutes and still get ready for work. So, I began waking up earlier and sticking to a consistent sleep schedule. This also motivated me to read more non-fiction something I hadn't done much before. I honestly had no idea how much this would positively impact every other aspect of my life.",
            "Last couple minutes of every shower are cold as the water gets.  Ice bath if it's available.  Cheapest body hack in the world and will set the rest of your day on a good trajectory.",
            "Planning my day the night before.  I prepare my lunch.  Make the kids lunch.   Sort out my meetings for the next day.  Get my to-do list arranged in order of priority.  Get my gym bag ready.  Load up my car.  Wash face and brush teeth.  Read myself to sleep.  Now that I type it out, more like a 30 minute habit."
        ]
    },
    "I made a 100% free alternative to MyFitnessPal": {
        "title": "I made a 100% free alternative to MyFitnessPal",
        "score": 275,
        "url": "https://www.reddit.com/r/getdisciplined/comments/1dqpmmk/i_made_a_100_free_alternative_to_myfitnesspal/",
        "content": "Hey, I’m Tiernan and I’m the developer of HealthMode: Fitness for Free, the 100% free fitness app with no premium subscriptions.\n\nI’m sharing this with you because I think we all hate subscriptions, I know I do, it’s the main reason I made this. I became annoyed that features were locked behind paywalls like barcode scanning, which I consider to be essential to getting in shape.\n\nBut it seemed like every fitness app out there was just after your money and wanted to lure you in with basic features and then charge you $10-20 per month for their premium.\n\nI decided to do something about it and make my own, 100% free app.\n\nHealthMode has:\n\n-Food, Calories, Macro & Micronutrient Tracking\n-Water Tracking\n-customizable goals\n\n-Weight Tracking\n-Body Fat Tracking\n-Body Part Tracking\n-Up to 3 progress pictures per day\n\n-Workouts\n-Custom Workouts\n-Recovery Hub to view how your muscles are doing after a workout\n\nAnd more!\n\nI believe this is the start to a change in the fitness app space. Download for iOS or Android now!\n\n[iOS](https://apps.apple.com/us/app/healthmode-fitness-tracker/id1673572195)\n\n[Android](https://play.google.com/store/apps/details?id=app.healthmode.healthmode&hl=en_US)",
        "num_comments": 49,
        "comments": [
            "Sign up appears to be broken and your TOS mentions an ad free premium subscription which is a little different from how your post presents. Good luck, I'm happy to offer some feedback once you get sign up working.",
            "Do you intend to keep it free forever? Seems pretty cool",
            "Legend. \nI'm a UX designer (well, I manage a team now but I still design too sometimes)\nWould you like help in improving the design of this app a bit?",
            "Hey mate, thanks for doing this. I've downloaded the app and put it in my first screen.\n\nI'm not from the US so none of the brands in the food search work for me. Can I just create a custom one if I know all the macros for it?",
            "You’re doing the lord’s work 🙏",
            "Awesome work man, really proud of you",
            "This is great!  Makes me want to do the same thing for workout tracking.  May you share some insight into when you started and some difficulties you’ve overcame?",
            "Feedback: There is a bug when trying to insert the day of birth, it goes one number back. For example if I press '22' and press ok it inserts '21', if I insert '3' and hit ok it inserts '2'\n\nAnd also it is bugging when I try to insert the username. It ads multiple unnecessary letters",
            "Just downloaded. Was using Caliber but this is much better with everything I need in one place and intuitive. Thanks for the awesome app.",
            "Just downloaded it. This is awesome! Thank you for making fitness tracking more accessible!"
        ]
    },
    "what’s your morning routine? ": {
        "title": "what’s your morning routine? ",
        "score": 17,
        "url": "https://www.reddit.com/r/getdisciplined/comments/1dr31xs/whats_your_morning_routine/",
        "content": "^title! curious to know what you gets get up to every morning, which systems work for you and what you’re working on! \n",
        "num_comments": 15,
        "comments": [
            "Currently wake up at 6/7, play a podcast while cooking, cleaning.\nI will control myself to not tap on any social media!💪\nAnd it works tho🤍",
            "Currently: Wake up at 4, walk dog, fasted 45 min cardio, go to work. Used to weight train in the morning everyday but it left me tired by 11 am",
            "Wake and bake, make coffee, smoke like 3 cigarettes and poo.",
            "Make bed , 10 min to stretch everything, drink bottle of water",
            "Up at 4-5am, make coffee (30 minute chill and sip), perfume, deodorant, brush teeth, get shoes on, out the door for work, 8-9pm shower then sleep. I sleep in the clothes i wear the next day, just makes life easier. Or it's 4-5am wake up, chill n sip, see what those I live with have going on, do errands, be a nerd till 8-9pm, shower then sleep.",
            "(In detail) Get up at 5am, take my probiotics, oral hygiene (oil pulling, tongue scraping, floss), chug water, workout, cold shower + skincare, meditation for 5-10mins, then journaling and planning my day, if i have some extra time i’ll read, then take my supplements + have breakfast & get ready for my day",
            "Wake up scroll YouTube shorts---> go to library study",
            "Wake up at 4 (on weekdays), go to the toilet, weigh myself, making my bed, eating oats, then going to the gym, come home, eating breakfast, and start working.\nWeekends are the same except i din’t set an alarm, usually it means i wake up 0.5 hours later, and no work.",
            "Damn are y’all insane… I mean I’m all for getting up early I hate sleeping in and I can only achieve harmony and focus throughout the day by waking up like before 11-10, but how tf do u get up at 4? Is it even healthy? At what time are you supposed to go to sleep then?",
            "There’s this really good podcast I listen to called the moth"
        ]
    },
    "23 tired of wasting away, but not doing anything about it.": {
        "title": "23 tired of wasting away, but not doing anything about it.",
        "score": 3,
        "url": "https://www.reddit.com/r/getdisciplined/comments/1drba7l/23_tired_of_wasting_away_but_not_doing_anything/",
        "content": "Hi. I'm 23. I have low/no desire to do anything. I've been killing my attention span and willpower for the past 5 years or so. I'll just mention whatever feels relevant in no particular order.\n\n\nI've always felt a bit different socially speaking, I noticed this when I started high school. I didn't really do anything outside of class. I repeated high school year three times. I used to randomly screm in class a few times every day, I stopped around 16yo. I also ate paper around that period and later on. Paper, napkins. \n\n\nOutisde school I spent my whole day online playing games, scrolling, masturbating to pornography, eating junk food. I still do.\n\n\nSo as I kept failing and being kind of socially awkward, by 2020 I had really isolated myself. I was 20. Started smoking and loving weed, smoked like a gram per day, stopped, started again, etc. From that point onwards up until today I went hard on the degeneration, I had no school now which meant more free time to play, masturbate, scroll, etc. Drugs were a plus. Fantasizing about girls giving me attention. But that was the extent of it, fantasy. Daydreaming about building social circles, doing stuff.\n\n\nNot long ago I had quite a realization, an epiphany if you will, that showed me how much repressed emotions I had. I always thought I was \"just a loser\", \"just low self esteem dude\", \"just awkward with people\" etc etc but that day I understood it's not a random thing, we are shaped by our childhood. I realized my father figures were on the abusive side. I lived with fear in my own home since 10/11 years of age and obviously learned to repress that and live with it, pretending I wasn't afraid of my dad. But it's all there, I resent my family for not doing much against it, I'm awkward with people, I don't seem to get them. My empathy is so low but on the rare occasion I manage to ignore my coping mechanisms, I burst out crying. I have so much repressed anxiety ANGER, shame, guilt, etc. \n\nI just KNOW that underneath all the repressed stuff is something good, I remember feeling more energized, smarter, more clarity in my brain, charismatic, funny, etc etc. I had a few good days where the baggage was dropped and I felt like this and Realized it was my actual true self, my nature. But the energy quickly drops, I suppose that it all goes into sheltering my ego from the repressed trauma/emotions.\n\n\nI'm very selfish (and yet, like with the rest of problems, I feel this conflicts with me because deep down I don't belueve myself to be selfish, I help out and act from my heart when I'm on my rare \"good days\"), rarely doing things for others, always thinking about how I look, how my actions look, to appear confident, etc. I struggle to see women as anything but sexual creatures, constantly craving their validation and attention (not necessarily sexual). \n\n\nI don't feel like I know myself. I've always felt my connections with people were superficial and now I know it's because my connection with myself is superficial. I'm just not there.\n\n\nI could go on but I think this enough lol. So to get to the point of this post:\n\n\nI'm not doing what I know can help me. This realization about having tons of repressed emotions showed me that it'd be a very good first step to start therapy, psychoanalytic and/or somatic (The Body Keeps The Score stuff always made sense to me), and go from there but I'm just NOT doing it. I keep saying aight this week I'll definitely look up good professionals close by and visit a few to start the process of finding one I like, but no. I spend the day scrolling youtube, twitter, reddit, etc. Playing game, pornography, cigarette. I know meditation can help but God forbid I spend any anount of time without stimulation. I'm getting more and more irritated by my family when they ask for stuff, which has taught them to leave me alone in my room which breaks my heart. But I cringe and resist opening up to them.\n\n\nI crave compassion from outside, like some benevolent stranger showing they understand me and that they believe in me, knowing I can heal and grow. Is this actually my desire for SELF compassion projected onto other people? Is my apparent lack of belief in myself causing me to look for others to believe in me? \n\n\nI'm just tired. I know I CAN keep going like this, I'll just really regret it, but right now I can avoid that feeling because I still \"have time\". I've always fantasized about that, \"having time\" and turning into a winner... But next week. Or next month, right now I just keep watching YouTube and playing Brawl Stars.\n\n\nI know that despising this behaviours and just brute-forcing my way out of procrastination is not the way, that's why I consider  some kind of therapy to be the first step I should take. \n\n",
        "num_comments": 1,
        "comments": [
            "Hi it sounds like you’re self medicating.  Eating paper can be a sign of a medical issue- I encourage you to speak to a doctor as well as your plan for therapy.  You might feel so much better if a medical problem is diagnosed.  I am not a medical professional so I don’t know.  It sounds like you’ve been dealing with a lot of adversity. It’s not fair but you can get through this.  People will support you and it’s totally normal to want others to be in your corner, supportive of your efforts.  If you need to watch YouTube, try to watch at least some informational and inspirational content to motivate you.  Be kind to yourself :)"
        ]
    }
}