{
    "[Plan] Friday 28th June 2024; please post your plans for this date": {
        "title": "[Plan] Friday 28th June 2024; please post your plans for this date",
        "score": 3,
        "url": "https://www.reddit.com/r/getdisciplined/comments/1dn8bxn/plan_friday_28th_june_2024_please_post_your_plans/",
        "content": "Please post your plans for this date, and if you can, do the following;\n\n\n\n* give encouragement to two other posters on this thread.\n\n* report back this evening as to how you did.\n\n* give encouragement to others to report back also.\n\n\n\nGood luck.",
        "num_comments": 40,
        "comments": [
            "- Laundry\n- Cats\n- Meet friend 1\n- Meet friend 2\n- Last speaking exams\n- Grade\n- Work on one page of article\n- Start next book",
            "🫧 HYGIENE ETC: Shower ✅Brush hair ✅Comb hair ✅Brush & floss teeth morn ✅night ✅moisturiser ✅hand cream & eye cream ✅📓 Gr@ Journal ✅❤️daily reminder: Speak kindly to self & self compassion 👍EFT ✅🤩Listen to affs & repeat ✅📱Have a call with the back to work program take notes etc. Be assertive while listening well! Try to be calm ❌ They didn’t call but I’m kinda pleased 😂 they might on Mon/Tues which is fine. ☺️ 😀Day 6 process of The Magic (The process on work!)✅👩‍💼Go to once wk volunteer job (1st day argh 😛😬) for training today. Bring a lunch! 🥪 📝 Take notes. 📸 Screenshot them. 📆 Together, schedule what day works for next wk. Be kind to yourself & positive NO unnecessary apologies or self deprecation! ✅🥣 Buy extra breakfast food on way home if you remember. ✅🤔 Do an LDR - what did I learn, do right etc. ✅And CHILL! ✅😌 For my records & rewards: 4, 8, 12",
            "(By the unnecessary apologies, what I mean is this: I had a job at one point where almost EVERY day they praised my performance & I kept saying “Sorry I couldn’t do more, I’ll try to do more tomorrow.” I’m not bringing that tomorrow or again! If I make a mistake I can say sorry, of course, or even just “Thanks for letting me know”)",
            "Warmup  ✔️    Cardio 30 min     ✔️       Duolingo ✔️     Gre magoosh Vocabulary training✔️    Drawing  ✔️      Piano lesson ✔️     \n\n\n30 minutes on syllogimous website     \n\n\n  Studied    ✔️   Meditation, journaling , used habit tracker✔️    \n  Skincare routine: sunscreen in AM. Cerave cleanser, adapalene and a cerave moisturizer at night ✔️",
            "✅ Get up early (woke up too early a few times, got up at 6:50)  \n✅ School stuff, two times. This disrupted my morning routines entirely.  \n✅ Respawn: morning routine  \n✅ Respawn: daily and weekly routine\n\n✅ Clean the first carpet again  :-(  \n✅Good scrub for the bathroomfloor  \nHelp write message\n\n✅ Remove the weed along the strip next to the stables PART 5/5: sweeping or blowing\n\n>POSTPONING  Start drawing, calculate volumes of the rooms ??\n\n\\_\\_now\\_\\_ Do some more detailed design for a piece of the Great Garden Plan)\n\n✅ Some Gardening  \n✅ Tidy shelves hotspots (today or tomorrow)  \n✅ Water the flowers\n\nRespawn: evening + before bed routine  \nRemove contacts  \nEarly bed and  \nno phone",
            "Follow up report (i probably haven't finished typing this (?) before my phone died) \n\n* Finished first two chapters of Colloquial Japanese. \n* Finished first chapter of Revenge on Geography + preface\n* Started with chapter 1 of On Writing Well \n* Can't finish blog post, didn't realise how bloody much errors it had until I skimmed through it. \n* Katakana by Tofugu unsuccessful. \n* Watched two videos of Economics Explained + additional Money & Macro video \n\nNew plan for 28-29: \n* Finish third chapter of Colloquial Japanese.\n* Finish second chapter of Revenge on Geography.\n* Get through my bloody blog post. \n* Have a daily report of 2-3 hours on my phone. (this would be in effect until mid July) \n* Try exercising. (same as above)\n\nI'm very well preoccupied with a party tomorrow afternoon, so let's see what'll happen.",
            "I don't think I'm actually going to get much work done today, but I want to update my list so I'm ready on Monday:\n\nStatus| Task| Importance| Urgency|Minutes (est.)\n---|---|----|----|----\n[]| **Fix that billing issue** | 10| 10| 20\n[]| **Project A - compare frameworks** | 10| 10| 20\n[]| **Project S - create endpoint** | 10| 10| 60 \n[]| **Project S - send script** | 10| 10| 60\n[]| Project I | 8| 10| 20\n[]| Call insurance| 8| 8| 15\n[]| Put new cc somewhere safe| 8 | 4| 2\n[]| Shower curtain| 3| 3| 30",
            "Good luck on your speaking exams, and I hope you the best.",
            "Have a lovely time with your friends.  Yay! The last of the speaking exams! All the best with your list today!\n\nI’m happy to see that even though you have a busy life you do make time for your friends and for your health & fitness too among other things &  I think that’s really good!",
            "Hi there,   \nWishing you a lovely day!"
        ]
    },
    "What daily ~10min habit has helped your mental/physical health the most?": {
        "title": "What daily ~10min habit has helped your mental/physical health the most?",
        "score": 799,
        "url": "https://www.reddit.com/r/getdisciplined/comments/1dqmm4d/what_daily_10min_habit_has_helped_your/",
        "content": "As the heading says, share so that we can all start incorporating it.\n\n",
        "num_comments": 264,
        "comments": [
            "Intentional gratitude.  Any brain activity acts like a muscle, you get stronger the more you do it, and if you start the day just saying out loud (sounds stupid but it's important) something you're grateful for, AND WHY (the why is important) you're gonna get really good at seeing the upside of your day.  Bonus points if you practice being grateful for stuff you don't actually like.",
            "Hip/hamstring stretching.  Has cut my lower back pain by about 60%.",
            "me reading this thread and ending up with 5 hours worth of 10min habits to do every day ✍️",
            "Complete boredom, just stare at a wall in your room all alone.",
            "Going for a 10 min walk as soon as I wake up, ideally as close to after sunrise as possible.",
            "10 mins of running. crazy how our ancestors used to run like 8 hours a day prob lol and now we can barely get ourselves to run 10. it makes such a huge diff. ancestors must have all been like gigachads mentally and physically, seriously",
            "10 minute declutter of every room 2x a day",
            "Not wasting time in bed!\n\nThis was especially true when I quit my job. The rest of society was out and about getting on with their day and I was laying in bed.\n\nIt bugged me so much I ended up building an app to force me to get up. If I didn't get up and scan my toothpaste barcode within a few mins (less than 10 minutes) of my alarm, I'd have to pay $10.\n\nApp is called Nuj Alarm Clock.",
            "Mindfulness",
            "I decided to start my mornings by reading a challenging book, especially non-fiction instead of picking up my phone and flooding my mind with petty information. Eventually, it became difficult to limit myself to just 10 minutes and still get ready for work. So, I began waking up earlier and sticking to a consistent sleep schedule. This also motivated me to read more non-fiction something I hadn't done much before. I honestly had no idea how much this would positively impact every other aspect of my life."
        ]
    },
    "I made a 100% free alternative to MyFitnessPal": {
        "title": "I made a 100% free alternative to MyFitnessPal",
        "score": 191,
        "url": "https://www.reddit.com/r/getdisciplined/comments/1dqpmmk/i_made_a_100_free_alternative_to_myfitnesspal/",
        "content": "Hey, I’m Tiernan and I’m the developer of HealthMode: Fitness for Free, the 100% free fitness app with no premium subscriptions.\n\nI’m sharing this with you because I think we all hate subscriptions, I know I do, it’s the main reason I made this. I became annoyed that features were locked behind paywalls like barcode scanning, which I consider to be essential to getting in shape.\n\nBut it seemed like every fitness app out there was just after your money and wanted to lure you in with basic features and then charge you $10-20 per month for their premium.\n\nI decided to do something about it and make my own, 100% free app.\n\nHealthMode has:\n\n-Food, Calories, Macro & Micronutrient Tracking\n-Water Tracking\n-customizable goals\n\n-Weight Tracking\n-Body Fat Tracking\n-Body Part Tracking\n-Up to 3 progress pictures per day\n\n-Workouts\n-Custom Workouts\n-Recovery Hub to view how your muscles are doing after a workout\n\nAnd more!\n\nI believe this is the start to a change in the fitness app space. Download for iOS or Android now!\n\n[iOS](https://apps.apple.com/us/app/healthmode-fitness-tracker/id1673572195)\n\n[Android](https://play.google.com/store/apps/details?id=app.healthmode.healthmode&hl=en_US)",
        "num_comments": 40,
        "comments": [
            "Sign up appears to be broken and your TOS mentions an ad free premium subscription which is a little different from how your post presents. Good luck, I'm happy to offer some feedback once you get sign up working.",
            "Do you intend to keep it free forever? Seems pretty cool",
            "Legend. \nI'm a UX designer (well, I manage a team now but I still design too sometimes)\nWould you like help in improving the design of this app a bit?",
            "Legend. Downloading now!",
            "I'd much rather support this alternative to Myfitnesspal. Just downloaded and everything seems great and intuitive. Thanks for the alternative, I'll be sure to leave positive feedback on the app store!",
            "You’re doing the lord’s work 🙏",
            "Just downloaded it. This is awesome! Thank you for making fitness tracking more accessible!",
            "How do I edit my goal weight etc after it’s been submitted? Can’t see where to do this in the app.",
            "The calorie number looks like it’s really high for me is there a way to recalculate it?",
            "Downloading now, I’ll try it for the next little bit and see how it goes"
        ]
    },
    "Going for monk mode starting from June 29 for 6 months": {
        "title": "Going for monk mode starting from June 29 for 6 months",
        "score": 16,
        "url": "https://www.reddit.com/r/getdisciplined/comments/1dqztju/going_for_monk_mode_starting_from_june_29_for_6/",
        "content": "During this time I want to completely detox myself of - \n1. Short term pleasure of watching serials  drama \n2. I will be off from all kind of gossiping or spying like not to use picuki , will be off from reddit also , might just copy the content of top post in my word to follow the advice \n3. Completely avoid YouTube from my phone \n4. Leave all the bollywood gossips and interests \n\nBut will be doing in very systematic post and will not rush to follow these in on day. \nThis is my last option to save myself , will not leavesl challange if missed one day will try to hit max of my daily goal and accepted ambitions. ",
        "num_comments": 2,
        "comments": [
            "Best of luck, friend. Make sure you have a game plan for the hard days so you don’t slip back and have to start all over again. If the old version of you comes up go kick him in the dick and say no! You got this in the bag.",
            "All the best!!! We believe in you."
        ]
    },
    "what’s your morning routine? ": {
        "title": "what’s your morning routine? ",
        "score": 7,
        "url": "https://www.reddit.com/r/getdisciplined/comments/1dr31xs/whats_your_morning_routine/",
        "content": "^title! curious to know what you gets get up to every morning, which systems work for you and what you’re working on! \n",
        "num_comments": 4,
        "comments": [
            "Wake and bake, make coffee, smoke like 3 cigarettes and poo.",
            "Currently: Wake up at 4, walk dog, fasted 45 min cardio, go to work. Used to weight train in the morning everyday but it left me tired by 11 am",
            "Currently wake up at 6/7, play a podcast while cooking, cleaning.\nI will control myself to not tap on any social media!💪\nAnd it works tho🤍",
            "Wake up at 0415-0430 to terrifyingly loud alarm\nDrink water \nMake my bed + journal + meditate\nWorkout for about an hour and a half\nMake and eat breakfast \nGet ready plus leave for school at 0730\n I like getting up early, i'm a morning person (mostly)."
        ]
    }
}