{
    "YouTube links & Crossposts are now banned in r/GetMotivated": {
        "title": "YouTube links & Crossposts are now banned in r/GetMotivated",
        "score": 157,
        "url": "https://www.reddit.com/r/GetMotivated/comments/10fvwtm/youtube_links_crossposts_are_now_banned_in/",
        "content": "**The mod team has decided that YouTube links & crossposts will no longer be allowed on the sub.**\n\nThere is just so much promotional YouTube spam and it's drowning out the actual motivational content. Auto-moderator will now remove any YouTube links that are posted. They are usually self-promotion and/or spam and do not contribute to the theme of r/GetMotivated\n\nCrossposts are banned for the reason being that they are seen as very low effort, used by karma farming accounts, and encourage spam, as any time some motivational post is posted on another sub, this sub can get inundated with crossposts.\n\nSo, crossposts and YouTube links are now officially banned from r/GetMotivated\n\nHowever, We encourage you to Upload your motivational videos directly to the subreddit, using Reddit's [video posting tool](https://www.redditinc.com/blog/video-is-coming-to-reddit/). You can upload up to 15-minute videos as MP4s this way.\n\nThanks, Stay Motivated!",
        "num_comments": 71,
        "comments": [
            "Spammers ruin everything. Lets keep it inside the club anyways",
            "Can we revise the rules around posting links? \n\nIronically, there's a repost up that was posted by a karma-farming account, but when I try to post a link of the original in the comments, the automod deletes my comment claiming it's a crosspost.",
            "How do I post longer videos? I was about to post an old Tony Robbins video from 1989 that is really good, but it is 18 minutes long.",
            " Glad to hear it! It can be frustrating when a subreddit gets flooded with irrelevant content, and hopefully this change will help keep the focus on actual motivational content. Are there any other changes or improvements that you think could be made to the sub",
            "Probably the best decision ever made in this community :D",
            "Oh poo, and I found a great video from someone else I thought might have helped some folks.\n\nIs there a \"Get advance approval from the mod team\" exception available?",
            "That's fantastic news! It can be aggravating when a subreddit becomes overrun with unrelated stuff; ideally, this update will help preserve the focus on actual motivational content. Are there any additional adjustments or improvements you think the sub may benefit from?",
            "why does linking to somebody's profile in the comments count as a crosspost?",
            "Yes, spammers can definitely ruin a good thing. It's great to see that the mod team is taking steps to keep this subreddit focused on genuine motivational content. Do you have any other suggestions for how to keep this community spam-free and on track?",
            "I completely agree with you. It's important to have focused and relevant content on any subreddit. Regarding the comment on more user engagement, have you thought about having a weekly thread for users to share their own personal motivational success stories?"
        ]
    },
    "[Text] You're not lazy, unmotivated, or undisciplined. You procrastinate because...": {
        "title": "[Text] You're not lazy, unmotivated, or undisciplined. You procrastinate because...",
        "score": 122,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1dr6rx3/text_youre_not_lazy_unmotivated_or_undisciplined/",
        "content": "If I could only share one lesson with the world, it would be this.\n\nProcrastination is an emotional problem.\n\nYou don’t put things off because you’re lazy, unmotivated, or lack discipline.\n\nWe put things off because it’s the easiest way to cope with the negative feelings caused by a daunting task. And one of the most common obstacles we face is fear. So, here’s why fear could be holding you back - and some actionable steps you can take to overcome it.\n\n1) Name your fear\n\nThere could be many reasons why fear is limiting your productivity. Perhaps you’re scared of getting something wrong in front of your new boss, so you just ignore the task completely. Maybe you’re confused about where to begin.\n\nYou could even be scared of success - what if my new business takes off and my life changes completely? Whatever your situation, first you need to work out exactly what it is that’s holding you back.\n\n2) Reduce your fear\n\nEasier said than done, right? When we’re scared, we tend to jump to the worst possible conclusions. This is called catastrophising - what if I make a mistake and lose my job? What if I fail this exam and my life is ruined?\n\nInstead of letting your mind come up with all sorts of disasters, you need to try to refocus your thoughts in reality.\n\nI like to ask myself this: Will it matter in ten minutes? In ten weeks? In ten years?\n\nIf you really fail an exam, you might feel pretty rubbish for a while. But in ten weeks time you’ll have studied more and worked with your teachers and you’ll be feeling a lot more confident, ready for a resit. And in ten years time you’ll barely remember that you failed at all.\n\n3) Overcome your fear\n\nOne of the best ways to overcome your fears is to increase your confidence. One of my favorite methods for doing this is called The Batman Effect.\n\nBasically, you need to imagine yourself as someone else - someone you admire, who’s brave, confident, and capable.\n\nPerhaps you picture yourself to be a famous writer, or your favorite singer, or a billionaire CEO.\n\nHow would they feel about the job at hand? They’d tackle it head on, and feel good too. When you sit down to a daunting task, you’re not doing it, it’s your superpowered alter ego.\n\nDon’t let fear hold you back from doing the things that matter the most to you.",
        "num_comments": 18,
        "comments": [
            "A more nuanced version of this is actually what my therapist talks with me about. At first i also thought nah i just proceastinate because im lazy. Fear is not always obvious",
            "For me sometimes its a feeling of god Im so sick of doing the same thing day after day, Id rather not do that report or those slides because its boring \n\nSometimes its fear but I have a lot of confidence if I put my mind to it it will come out well. Its just boring a lot of times",
            "This is good advice, but sometimes it really is just being lazy. What I have found is doing the job for your \"future self.\" This has really helped me over come my procrastination. For instance, I used to leave the dishes for the morning, but now I do them right away after dinner and the next morning when I go into the kitchen I'm very happy that I did them the night before. This goes for everything. I could get gas after work today or I can get it tomorrow before work - I will always get it today bc that way it's out of my head completely and I'm not inconvenienced by it. Basically when some job comes up I do it as quickly as I can. I do make a mental note of what I did the day before and kinda consciously thank my old self for doing that for \"future self.\" Kinda corny I know, but it really works for me and I hope it works for someone out there too. Give it a try.",
            "Nope. I'm lazy, unmotivated, and undisciplined. Thanks though.",
            "Nice, thanks for sharing ",
            "I fear the shame of not living up to others expectations. It ties into fear of being perceived.",
            "Procrastination is actually a good thing.\nYou always have something to do tomorrow. Plus theres nothing you have to do today",
            "I appreciate the post but it always seems as if no one is lazy, we just have fears or such and such. Sometimes it's just laziness and that's ok too.",
            "I am lazy. It's not that I have a fear, it's just that I'd rather do something else more enjoyable.",
            "I fear that I dont want to make those garden boxes for my wife. I fear that it will suck."
        ]
    },
    "[Discussion] How do you find the strength to keep going even though your best is not enough? 🥲": {
        "title": "[Discussion] How do you find the strength to keep going even though your best is not enough? 🥲",
        "score": 18,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1dr914y/discussion_how_do_you_find_the_strength_to_keep/",
        "content": "As a kid I did my ABSOLUTE BEST to be a 1st team Varsity Footballer... Yet I was always a 2nd teamer. Benched because I wasn't good enough. \nNowadays I've done my absolute best as a content creator and still I suck😭\nNot being good enough is all I've known, however, my strength lies on the fact that I NEVER give up! I know I'll make it big someday, but I'm tired of being the underdog, I really am😓. How do you guys find the strength to keep going?",
        "num_comments": 17,
        "comments": [
            "It goes to show that effort and hard work alone will NOT get you everywhere. I have a genetic condition that affects hand/eye coordination. All the effort in the world will still leave me being a truly awful tennis player because i can't hit the ball! Hard work and ability will always beat hard work alone.\n\nI think the thing to do is combine an ability to work hard (which is incredibly hard to teach to someone) with something you have ability at and enjoy.",
            "Start counting your wins rather than your failures. Break large, unachievable goals into smaller, achievable goals. (You cant win Mr Olympia tomorrow, but you *can* hit the gym, which is more than you did yesterday and definitely achievable).",
            "Stop limiting yourself to just a few cliche means of succeeding and focus on how you want to feel instead.",
            "You propably won't make it big. Very few people do. If not being rich and famous is dissapointing then prepare for dissapointment in life. You should find fullfilment from other things in life besides fame and fortune.",
            "Hey, I feel you. It's tough when you pour your heart and soul into something and don't see the results you want. But remember, even the most successful people started out as underdogs. It's that drive and determination that sets them apart. You're not alone in feeling tired and frustrated... Keep grinding, keep learning, and keep pushing yourself. Your breakthrough moment might be closer than you think.",
            "You need to reframe, bro. Focus on what's going right and on your strengths. Maybe you're focusing on goals that are not right for your. Doesn't mean you're failing, maybe just aiming wrong.",
            "Try something else? You dont know what youll actually be the best at but maybe its not football or content. Beach out and keep an open mind",
            "Try something new occasionally? Dont let yourself get stuck on something that doesnt really work for you just because youve invested so much of your time.",
            "Let them. Celebrate the success of others. Focus on your own path. Honestly, no one cares about any of the best people at anything. Human nature makes you care about yourself and your small circle. \n\nWhy do you care so much? Get therapy if you need to answer that question. Is it your ego? Is your life too hard and you think it will be easier if you're more successful? Find the \"why\" and create a plan to overcome it. The only person you've ever been in competition with is yourself.",
            "**\"It is possible to commit no mistakes and still lose.****That is not a weakness; that is life.\" - Captain Picard.** \n\nOn a more serious note, try reading - The Subtle Art of Not Giving a F\\*ck by Mark Manson"
        ]
    },
    "[Text] Your future self is watching yourself through memories right now. Will you make him proud? ": {
        "title": "[Text] Your future self is watching yourself through memories right now. Will you make him proud? ",
        "score": 6,
        "url": "https://www.reddit.com/r/GetMotivated/comments/1drakiv/text_your_future_self_is_watching_yourself/",
        "content": "... or will he be disappointed?\n\nStrive to make choices that will fill your future self with pride and gratitude. Work hard, stay focused, and remember that the effort you put in now will define the life you lead tomorrow. Delayed gratification do really works wonders. I felt it on my own skin.\n\nHave a productive weekend. \n\nGet to work 🏆✅🎯🚀\n\n",
        "num_comments": 3,
        "comments": [
            "Perfect timing. Thank You Brother",
            "If this is still a question in your mind wether will you make your future self proud or not.\n\nYou have a long way to go my friend.\n\nLife is harsh and unfair. Do you think the soldiers in Russia right now are thinking about this?\n\nNO. There more bigger problem to defeat.\n\nThe point is if you are still thinking about these kind of things wether should you do your workout today or not wether should you make yourself proud or not.\n\nEither way you will lose to the people who doesnt need to think about this they just win its just normal.\n\nThese problems are surface level. When a killer pull up in your house and your family is inside and this is how shallow you think.\n\nWell good luck my friend because in the killers mind that question doesnt exist he is full will to end you.\n\nIn the end these type of question shouldnt even be a question in the first place. ALWAYS MAKE YOURSELF PROUD MOVE ON.",
            "O dag"
        ]
    },
    "[Video] Chelsea J. Smith's inspiring journey from battling thyroid cancer at a young age to becoming a successful actress, producer, and writer": {
        "title": "[Video] Chelsea J. Smith's inspiring journey from battling thyroid cancer at a young age to becoming a successful actress, producer, and writer",
        "score": 6,
        "url": "https://youtu.be/cxobzvp_syk",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}