{
    "2 Million Members - Thank you from the mod team": {
        "title": "2 Million Members - Thank you from the mod team",
        "score": 25,
        "url": "https://www.reddit.com/r/GetStudying/comments/1bhdczf/2_million_members_thank_you_from_the_mod_team/",
        "content": "Hello college students, high-schoolers, educators, and everyone in between whose used r/GetStudying,\n\nThank you for 2 million members! This subreddit was created to help connect motivated learners, and help inspire those who were ready to achieve the best they academically could. While education can be a hindrance for some, this subreddit has helped so many people do great things, and we hope this subreddit helped contribute to academic success in some way.\n\nFrom the Moderation team, thank you so much. We never would've imagined having this many people in our subreddit, but we're thankful to everyone for all their help. Onto the next milestone!\n\nAs our subreddit continues to grow, we're looking for moderators to help with the community. Visit the link below to start the application process!\n\n[https://forms.gle/5V1LK8akj9Wfppve8](https://forms.gle/5V1LK8akj9Wfppve8)\n\n&#x200B;\n\nOnce again, thank you. We hope your school year is going well, and we wish you the best to come!--\n\nThe Moderation Team @ r/GetStudying",
        "num_comments": 4,
        "comments": [
            "This subreddit is my ace-in-the-hole for motivation and focus!",
            "I want to post but i cannot. The bot asks me if I'm a bot or not and after hitting post it just do not post! What is wrong with it"
        ]
    },
    "Daily Accountability Thread - June 29, 2024": {
        "title": "Daily Accountability Thread - June 29, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/GetStudying/comments/1dr4fuy/daily_accountability_thread_june_29_2024/",
        "content": "Hi everyone! This is the Accountability Thread where people can list what they need or want to accomplish today and have everyone else help keep you accountable to do them. So, in general, a post will look like this:\n\nThings I have to get done today:\n\n~~1: Post Accountability Thread~~\n\nIf I had more to do that I had not completed I would list them and update this when these things were complete.\n\nAlso, if I saw someone doing something that I happen to be well-educated or have some sort of expertise in I can offer support or help on the topic/task.\n\nThe thread is a versatile one, use it in a way that helps you and others stay on task!\n\nHappy studying!",
        "num_comments": 0,
        "comments": []
    },
    "Im really bad at math and I have no clue what to do": {
        "title": "Im really bad at math and I have no clue what to do",
        "score": 15,
        "url": "https://www.reddit.com/r/GetStudying/comments/1dr0he3/im_really_bad_at_math_and_i_have_no_clue_what_to/",
        "content": "I used to be pretty alright in math up until highschool. I would always have a 80 in my math class never above a 86 but I was pretty alright with that. However since I started highschool I was been failing all my exams despite me doing very well on classwork and homework. \n\nI had gone to tutor but no matter what when it came to the test I would get shocked on how difficult it was to me compared to my peers. I hated this since all my friends would score well besides me. I would get so ashamed to ask my friends for help because I felt slow to understand and didn't want my friends to think poorly of me. \n\nNow Im currently at a SAT tutor prep center and its worse than ever, Im so lost in the lessons and its only the first day I wish I could be like everyone else who gets math but idk why I was so cursed to not understand it. \n\nAny suggestions please :(",
        "num_comments": 7,
        "comments": [
            "Go back to the basics. You're probably weak when it comes to fundamental math and that's why you find it hard to follow like your peers do, you're missing information.\n\nEdit: just to expand on it a bit and give you a clearer idea:\n\nTypes of numbers, addition, subtraction, multiplication (+ multiplication tables) division, square roots, quadratic formulas. \n\nAfter you practice all this and are able to do basic operations easily in your head, you should review your math subjects. \n\nAll along the way, you should be looking for the definitions of everything so that you have a good understanding of the meaning of all the symbology and concepts. Math is a language, after all. Look up math dictionaries and handbook formulae.\n\nComplement the practical knowledge by learning about math history, it'll give you insight into the development of mathematical thinking. It's very cool. Here are a couple books about it: \n\nA brief history of mathematics by Tianxin Cai\n\nThe Math Book from the series Big Ideas Simply Explained by DK",
            "If you are doing well on your homework then I’m not sure what would be happing with the exam. As with maths there are no surprises everything follows the same principles. See if you can access past exams from previous years. Eg. If you are in yr9 access yr 7 and 8 exams. Do 1 each with an open book marking the questions you needed help with, then do another closed book and see what you get correct and what you get wrong. Then you and your tutor can work through the exams together.",
            "Keep studying the math books until the concepts makes sense and your able to create your own problems with the understood applied mathematics learned in each chapter. Once youve memorized each chapter on how to solve those particular problems and can recite them like scriptures from the holy bible, move on to something more advanced and repeat until your einstein making new theories and have surpassed everyone else",
            "I bet it's either doing a math that you don't need irl (most likely) or you need steps on fundamental stuff. So like formulas steps and ever present rules like pemdas and +/-. Having actual steps like 1-5 > I generally do this that etc. Basically exactly how a problem should work in those \"rare\" situations. This is why I really hate the fact that schools teach math you won't mostly use irl. Just makes ya hate math and preform at a level that you're not on. And judges you harshly for it.",
            "Khan academy has free videos.  Even though you know 85% of it, start back at 1st grade and work thru all of his videos.  Don’t move on until you master each topic. \n\nHe actually says it’s like building a house, you shouldn’t move to the next grade until you perfect the course work.  No one would build a house with 80% of the foundation or 75% of the load bearing walls.",
            "It might be a problem with fundamentals. I have had this issue as well before, where it feels like no matter how much I'm learning it doesn't reflect on my tests or exams. To fix this I revised the basics of my topics, even if it feels like they are common knowledge.\n\n  \nFor example, when learning 3D vectors, I kept messing up certain parts such as finding the vector form of a 3D plane, and kept making the same mistake. It turns out I had to revisit an old topic I had already covered in the previous year to help.\n\nIt might feel shameful to you to ask your friends for help, but it's one of the best ways to improve.  You can compare questions you got wrong and they got right, following their chain of thought and process through that question to see where you and they differed. \n\nThe most important thing with this however is to come in with an open mind, and be open to learning different ways of problem-solving, even if it contradicts what you know. This was something I struggled with since I was quite stubborn when it came to learning new methods, but once I got over that the advice I got helped tremendously.\n\nOf course, practice problems help a ton as well, as they allow you to apply the theory you learn in an exam-like setting, helping you practice for what you want to do good in. Additionally understanding the theory behind the math helped me tremendously. Understanding the theory behind calculus and how it is applied in real life helped me see what I was trying to achieve in an exam question.\n\n  \nHopefully, this helps :> I have more advice in my free newsletter if you wanna check that out (https://substack.com/@notsotopstudent?utm\\_source=profile-page).\n\nGood luck in your studies and remember don't doubt yourself, you got this.",
            "I actually do what I want at my own time"
        ]
    },
    "Student life isn't easy": {
        "title": "Student life isn't easy",
        "score": 224,
        "url": "https://i.redd.it/ue8q3z4wy99d1.jpeg",
        "content": "",
        "num_comments": 4,
        "comments": [
            "The smartest people are those who don't go to college.\n\n-Not even a dropout, more like never even registered.",
            "Bro , we don’t even go to classes anymore",
            "Out of curiosity,what are you doing instead like what do you do for living?",
            "I work for Jesus Christ, and slay demons. I get paid by grace from The Holy Spirit and my rewards in treasure in heaven go up forever without ending. They're infinity for the haters that tried 2 end me."
        ]
    },
    "Why is this happening to me ?": {
        "title": "Why is this happening to me ?",
        "score": 4,
        "url": "https://www.reddit.com/r/GetStudying/comments/1dr4n9f/why_is_this_happening_to_me/",
        "content": "Hey\n\nI have a lot to do. I am a CS student and actively searching for jobs. I have a lot of study and prep for assessments and job interviews and also I need to apply to a lot of them. Right now my top priority is to study and get a job.\n\nThe thing I know all of this and I love coding too. Not sure what the problem is but I just don’t feel waking up that I want to study. I don’t have that determination and drive for it. I am dragging myself and giving up too. I don’t know why. In fact at this point I should lose my sleep over my state but I am not.\n\nI don’t know why.",
        "num_comments": 2,
        "comments": [
            "There is nothing abnormal in this, it is a phase, it will happen. You have put lot of emphasis on your job prospects, so the anxiety. It is normal, will go away with the first offer you get. yes, the market is down, but do not get overburdened by that, if you have capability, you will get opportunities. it may be delayed, but not that it will not come. All the best",
            "Yeah you can feel this way but you need to get your ass in gear get that job and start moving and having a routine going from one thing to the next thing that is a priority to you not just that but you need to be actively writing down tasks to complete on a yellow note pad that you need to do and then you need to just go down that list and do all of them and you'll feel so much better when you get them done. \n\nAll of this advice as well mission number one you got to have a positive attitude every single day you wake up you have a choice you can either be negative or positive which one do you think is going to enhance your life duh mission number two you got a PT and be healthy that means every single day you got to devote yourself to respect your body respecting your car and respecting your soul and your mind and you just got to pee to your mind more than anything because it's all in your mind. You need to practice good nutrition you need to earn people's respect and start building a community of people that are the people that you spend your entire life around many of times this will turn into people who will start businesses together and become successful but you need to start talking to people and you need to start developing your social skills asking questions more than anything listening to what they're saying and then reciprocating back from that knowledge they told you you need to talk more about that knowledge. Medication number four gotta earn respect and I know that's an easy concept you think but it's not you don't deserve respect you got to earn respect and you do that through your actions you do that through your humility in your life you got to do all that stuff every single day of your life and learning it other human beings they look at you they look at your actions they listen to your words and then that should go into the respect that you should hear mission number five integrity now in my opinion this is the most important mission out of all of them you have to wake up every single day and know that you're living of righteous life living with confidence. Every single one of us understands the difference betweem right and wrong I don't care if you think you don't know you do know you know when you're hurting another human being and you know when you're hurting yourself living with integrity allows us to accept those truths in life what is right and wrong and in that governs our actions you live with honor you have to live with integrity. Mission number six finder mentor somebody to teach me this isn't the only advice you need in your life it's just one tool for your toolbox find a mentor then just think how great you're going to feel when you can bestow this knowledge on somebody else who needs it. Mission number seven you have to have fun life is about having fun if you're not having fun what you're doing you're wrong you should be laughing having seen your day when was the last time you had a pee in your pants laughter when was the last time your gut was putting so hard and you were just tackled cuz you're having so much fun in your life the love for living the love that's in your heart that comes out to the point you have"
        ]
    }
}