{
    "Discontinuation of the MEGATHREAD": {
        "title": "Discontinuation of the MEGATHREAD",
        "score": 19,
        "url": "https://www.reddit.com/r/gigabyte/comments/17p8ssq/discontinuation_of_the_megathread/",
        "content": "I am no longer at the company so hopefully if someone new will take over they will be able to continue the support :(\n\nI wish y'all the best in making your products work!\n\nPrevious week [link](https://www.reddit.com/r/gigabyte/comments/17jy4o6/weekly_support_and_questions_megathread_w44_23/).",
        "num_comments": 2,
        "comments": [
            "Good luck on your next job! \n\nDo you keep the reddit handle or does it go to the next employee?",
            "Come on newcomers"
        ]
    },
    "AM5 UPDATE TO NEWEST BIOS": {
        "title": "AM5 UPDATE TO NEWEST BIOS",
        "score": 40,
        "url": "https://www.reddit.com/r/gigabyte/comments/13dxrzh/am5_update_to_newest_bios/",
        "content": "~~Newest BIOS is lookin stable for AM5 users!~~ Let me know in the support megathread if you have any questions! READ THE EDITS\n\n&#x200B;\n\nEdit: IT HAS BEEN BROUGHT TO MY ATTENTION FOR SOME USERS\n\nIf you are using AORUS B650i Ultra STAY ON F4 BIOS to prevent AUDIO ISSUES. I have passed up this info to HQ so we will see what they do with it!\n\n\\-----\n\n5/15 Edit: Looks like a wait longer angle. Current BIOS is not limiting according to hwbusters. Will continue to provide updates. Also to note: TESTING A BETA BIOS WILL NOT VOID YOUR WARRANTY. Unless you break your board over your knee (this is an exaggeration please don't do this pins are sharp) using a BETA Bios will NOT void your warranty.\n\nAlso I can't edit the title heh. Hope everyone reads this\n\n\\-----\n\n5/16 Edit: F5d fixes the audio issue for AORUS B650i Ultra. Have 1 report saying it's stable under 1.3v (may or may not update the count for every user I find)\n\n\\-----\n\n5/16 Edit: I'm being told that the most recent BIOS (should be the same beta one with AGESA 1.0.0.6) properly limits the voltage under 1.3v. To test this, using HWInfo, you can check the **CPU VDDCR\\_SOC Voltage (SVI3 TFN)** voltage and if it ever goes above 1.3 send me a link to an image or some video proof so I can send it up the chain and report accordingly!\n\n\\-----\n\n5/17 Edit: Some BIOSes have been pulled and I have already sent like 20 screenshots of users asking where'd they go to my HQ contact so please stay tuned. u/duke605 was kind enough to compile a short list of those affected:\n\nRemoved BIOSes:\n\n* B650 Aorus Pro AX = F5d\n* x670E Aorus Master = F10d\n* [B650E Aorus Master](https://www.reddit.com/r/Amd/comments/12yq4yb/megathread_for_am5_ryzen_7000/jkjkzt3/) = Unknown BIOS version\n* B650M Aorus Pro AX = idk where'd it go\n\nIf there are any updates to this let me know and I'll add them accordingly (hopefully they put them back up or I get a message clarifying why they were pulled)\n\nTo clarify, I have 0 knowledge of when BIOS will be released or when they get pulled I find out the same time y'all do so please bear with me and appreciate the continued support.\n\n\\-----\n\n5/18 Edit: A new non-Beta BIOS has been released for all AM5 mobo models while I was sleeping!\n\nSo if you've seen it awesome time to update! If not then hey here's your announcement. It is still AGESA [1.0.0.6](https://1.0.0.6) and I have no info on whether there will be an update or new BIOS containing AGESA 1.0.0.7a so if you ask me I will respond with a sad face!\n\nSecond Edit of the day: It seems the Video that was sent internally is now public!\n\n[https://www.youtube.com/watch?v=HOUAy9n104A](https://www.youtube.com/watch?v=HOUAy9n104A) This video shows the voltage stability and what you should be looking for on the motherboard!\n\nHopefully this was able to help and definitely ask me anything if you have any questions! (don't ask for anything from the video idk specs settings any of that)\n\n\\-----\n\n5/22 Edit: Hey y'all. There is a new BETA BIOS for those interested in 1.0.0.7a.\n\nI know a lot of people have been asking about this but do keep in mind this is a BETA BIOS. If you're worried, stay on the standard [1.0.0.6](https://1.0.0.6) version but do remember that if you do download the BETA BIOS your warranty IS NOT VOID.\n\nSo feel free to try out the AGESA version and definitely let me know if you find anything interesting! (Preferably good interesting and not bad interesting)\n\n\\-----\n\n8/8 Edit: Everything is lookin good now so this post will prob be dropped from the stick once I've decided to replace it with another thread! Appreciate everyone of the updates and sticking through this with me.",
        "num_comments": 182,
        "comments": [
            "Can you provide some more details? Which bios and agesa? Are we talking about the beta's with 1.0.0.6 or 1.0.0.7 that I don't see publicly yet. Can you provide more information around the fixes, timelines and status of bios to address this?",
            "Gigabyte X670E Aorus Master F10d BIOS is exhibiting excessive SOC voltages at stock auto, no EXPO settings. \n\nOn two occasions I have seen VDDCR\\_SOC hit 1.7v and 1.5v for a fraction of a second and my CPU die temps hit TJMAX.",
            "Im using Ryzen 7 7800X3D and B650 AORUS ELITE AX (F5c), should I be scared of the recent issue with these CPUs when theyre bloating up killing themselves and sometimes their motherboards? Updated from F1 specifically because of that issue.",
            "My front and rear audio connectors completely stopped detecting any devices that I plug in after updating to F5C on b650i aorus ultra",
            "I know you're just a marketing representative, but please let HQ know the F5c BIOS literally kills your aorus B650i mobos' audio(ALC4080). There's even a thread for that.",
            "I have just update to F5c for my B650i Aorus Ultra, it killed my realtek soundcard just like F5b, F4 is fine !",
            "I know Buildzoid found f10c does not limit SOC voltage to 1.3 on startup for his board. But did limit it lower while running. But the version I find online now says f10d. So that one does for sure limit it to 1.3v at all times? Including boot?",
            "u/GBT_Calvin one thing that might help future BIOS releases is a KNOWN ISSUES section below the changelog. That way, instead of removing a BIOS because of a known issue, you can let the users decide if they want to skip that or not. I think this would cause less confusion.",
            "Newest non-beta BIOSes are out for what looks like all AM5 motherboards. Tho they're not using 1.0.0.7a AGESA. Still only 1.0.0.6",
            "Is it recommended by HQ to update to newest beta BIOS with AGESA 1.0.0.7a or to stay on stable BIOS with AGESA 1.0.0.6 for the time being?"
        ]
    },
    "Broke retention clip": {
        "title": "Broke retention clip",
        "score": 3,
        "url": "https://i.redd.it/fx38uglu0i9d1.jpeg",
        "content": "In an attempt to uninstall my GPU I broke the retention clip, is there anything I can do? I literally did not even press hard at all. B-650 Auros elite ax motherboard.\n\nIt does not seem like the GPU will come off easily\n",
        "num_comments": 2,
        "comments": [
            "Don't worry it will work without as well.\n\nEnjoy Freedom",
            "The problem is it seems as if the GPU is still latched to the motherboard it won't wiggle out easily as if the remaining part of the clip is still intact securing it..."
        ]
    },
    "B650 Gaming V2, Ram RGB lights staying on during sleep, and RST_SW ( MULTIKEY)": {
        "title": "B650 Gaming V2, Ram RGB lights staying on during sleep, and RST_SW ( MULTIKEY)",
        "score": 1,
        "url": "https://www.reddit.com/r/gigabyte/comments/1drcoin/b650_gaming_v2_ram_rgb_lights_staying_on_during/",
        "content": "Hello everyone,\n\nIn bios, I turned off LED lights during sleep mode -> Still ram lights are on during sleep mode.  \nI even changed RST\\_SW ( MULTIKEY) to turn LED off, does not work, pressing the reset button, restarts computer, i even tried to change it to enter bios from the reset button, it still restarts computer.\n\nFeel like none of the settings actually work.\n\nRam is Oloy Blade 32gb (16x2)  \nCpu is 7500F.\n\nAny ideas? Or anyone in the same boat?",
        "num_comments": 0,
        "comments": []
    },
    "PSA: RTX HDR 1000 nits on Aorus F032U2P": {
        "title": "PSA: RTX HDR 1000 nits on Aorus F032U2P",
        "score": 1,
        "url": "https://www.reddit.com/r/gigabyte/comments/1dr9dp9/psa_rtx_hdr_1000_nits_on_aorus_f032u2p/",
        "content": "Hey folks,\n\nUntil Gigabyte see fit to bother actually supporting their expensive new monitors with regular firmware updates, a workaround to get 1000 nits using RTX HDR.\n\nGo here and download this - https://www.nexusmods.com/site/mods/781\n\nMake sure to download the main file and also the “TrueHDRTweaks”.\n\nNow place the files from the TrueHDRTweaks zip (x64 folder) into the .exe folder of the game you want.\n\nGo to the .ini file you’ve dropped into game folder and change the Peak Brightness setting to 1000ish nits.\n\nExtract and run the NVTrueHDR.exe, drag and drop your chosen game .exe in the command prompt window opened up.\n\nEnjoy your game.",
        "num_comments": 0,
        "comments": []
    }
}