{
    "Come hang with us and game with us on our /r/GirlGamers Discord server!": {
        "title": "Come hang with us and game with us on our /r/GirlGamers Discord server!",
        "score": 265,
        "url": "https://www.reddit.com/r/GirlGamers/comments/dl7d84/come_hang_with_us_and_game_with_us_on_our/",
        "content": "# About Our Community\n\nLooking for a women-centered group to chat and game with? Come join our r/GirlGamers Discord server - a curated & partnered community of over 7000+ members!\n\n# How to Join\n\nPlease send a modmail message to [r/GGDiscordInvites](https://www.reddit.com/r/GGDiscordInvites/) by following [this link](https://www.reddit.com/message/compose?to=%2Fr%2Fggdiscordinvites&subject=Discord%20Application&message=Tell%20us%20about%20yourself%21).\n\n* Tell us a little bit about yourself! A single short paragraph is fine! No need to write an essay.\n* Please include your gender identity/expression in your application.\n* We do not need your Discord ID!\n* This community is LGBTQIA+ INCLUSIVE! Homophobes and transphobes need not apply.\n* IF YOU ARE HAVING ISSUES APPLYING, PLEASE TRY ON A DESKTOP AND NOT AN iOS DEVICE.\n* We manually process each request. Please allow us up to 7 days to process your application. If you don't hear from us after a week, feel free to message the mods.",
        "num_comments": 0,
        "comments": []
    },
    "I’m just about old enough to get this……": {
        "title": "I’m just about old enough to get this……",
        "score": 271,
        "url": "https://i.redd.it/7v6m75l0jd9d1.jpeg",
        "content": "",
        "num_comments": 34,
        "comments": [
            "We had Pong at home - it was so exciting at the time! A game you could plug into your TV? We were living in the future LOL.",
            "Fun fact: If Sony continued supporting the PS2 for another year or so, it would have dethroned the 2600 as the longest supported console.",
            "Nobody would ever throw any of these consoles in the trash... they just put them up on eBay for exorbitant prices.",
            "Ah, I miss my Atari 2600. So many hours spent playing Asteroids and Combat with my sister.",
            "Remember when you could buy those consoles for cheap? TT A TT",
            "I grew up with a Mega Drive, good times. :')",
            "Your missing the vectrex. Nothing will ever beat its screen",
            "I still want them. I'm want to get the Atari 2600 for my mom she had one when they first came out.  She will be so happy. 😊",
            "I giggled.",
            "Is it sad that I really laughed out loud reading this.?🤣😅"
        ]
    },
    "First shiny on pokemon go!": {
        "title": "First shiny on pokemon go!",
        "score": 8,
        "url": "https://i.redd.it/nl0dtc4hlg9d1.jpeg",
        "content": "Was complaining to my fiancé about how I’ve never gotten a shiny on pokemongo and like two days later I got one 😂 even though the color is only slightly differentt from the non-shiny I was so excited. Also if anyone plays and is looking for more friends! send me a pm! I need more friends who play this game since I need to send so many gifts for one of my challenges.! ",
        "num_comments": 0,
        "comments": []
    },
    "what are you getting from the steam sale?": {
        "title": "what are you getting from the steam sale?",
        "score": 52,
        "url": "https://www.reddit.com/r/GirlGamers/comments/1dqs8oo/what_are_you_getting_from_the_steam_sale/",
        "content": "so far I've picked up:\n\n• Tony hawk pro skater 1+ 2, state of decay 2, jurassic world evolution 2 & Alice madness\n",
        "num_comments": 97,
        "comments": [
            "I got Mass Effect: Legendary Edition (it has a 90% discount, so great price) and I am checking some other games, maybe I will get Balatro or some cozy games.",
            "btw you guys are bad influences bc I'm right back in the steam store looking these games up!",
            "As is tradition .. I'm broke again right when the sale is happening. It's both a blessing and a curse lmao",
            "I already own it but llmiddle earth shadow of war is 3 dollars.....that's SO much game for 3 dollars and witcher 3 is 4 dollars that's so much gaming for less then a coffee, PC gaming is truly in its golden age",
            "Picked up Lords of the Fallen and Horizon: Forbidden West! 🥰",
            "I got two Planet Zoo dlcs.  Will probably also get Disco Elysium and Subnautica.",
            "Sun Haven, Later Alligator, Fire Tonight and Bugsnax. They’ve all been on my wish list for ages",
            "So far I picked up Pacific Drive, I'm liking it so far!",
            "I got Sunhaven and Dave the Diver",
            "So far I’ve picked up START AGAIN: a prologue and No Case Should Remain Unsolved. Two short indies that cost me under $10 total!\n\nIn Stars in Time was my favorite game of 2023, and START AGAIN is basically a prologue to it. I wish I’d played them in the opposite order but what can you do 😅"
        ]
    },
    "makes me not wanna talk in games 😭": {
        "title": "makes me not wanna talk in games 😭",
        "score": 4,
        "url": "https://i.redd.it/1rwva15c1h9d1.jpeg",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}