{
    "Weekly Premier/Matchmaking/Cheating Discussion & Complaints Thread": {
        "title": "Weekly Premier/Matchmaking/Cheating Discussion & Complaints Thread",
        "score": 23,
        "url": "https://www.reddit.com/r/GlobalOffensive/comments/1dnl4ni/weekly_premiermatchmakingcheating_discussion/",
        "content": "Welcome to **Matchmaking Monday**! This is the weekly megathread where you can share your experiences, complaints, and feedback related to:\n\n* Ranked & Unranked Matchmaking\n* VAC, Hacking, and Cheating\n* Prime, Trust Factor, and Trusted Mode\n* Ranking\n* Queuing and Lobbies\n\nFeel free to discuss your matchmaking experience, rant or vent, discuss ideas & share feedback for improvement, and talk about your recent games.\n\n# What you should know\n\nKeep in mind that there is a limited amount of information available about these systems and how they work to keep them effective. If you have questions, here are some resources to review:\n\n**Trust Factor**\n\n* [Trust Factor Matchmaking FAQ (Steam Support Article)](https://support.steampowered.com/kb_article.php?ref=5966-WKLC-4172)\n* [The Trust Factor: CS:GO Blog Post](https://blog.counter-strike.net/index.php/the-trust-factor/)\n* [Everything About Trust Factor](https://www.reddit.com/r/GlobalOffensive/comments/m3vk43/everything_about_trust_factor_that_i_could_find/) by u/awsmninja \n* [GDC Presentation by John McDonald (Valve)](https://www.gdcvault.com/play/1024994/Robocalypse-Now-Using-Deep-Learning)\n* [Do you Trust the Trust Factor?](https://www.youtube.com/watch?v=IpKgLAE1OdY) by u/3kliksphilip\n\n**Ranks**\n\n* [Competitive Skill Groups and Profile Rank](https://support.steampowered.com/kb_article.php?ref=5629-WUDL-8495)\n\n**Bans**\n\n* [Myth: Why doesn't Valve ban cheaters?](https://steamcommunity.com/app/730/discussions/0/1621726179584501164/)\n* [Competitive Cooldowns and Bans](https://support.steampowered.com/kb_article.php?ref=1203-WJCV-7019)\n* [I've been Overwatch banned](https://support.steampowered.com/kb_article.php?ref=5393-TLZX-2230)\n\n# What you can do\n\n**Give Feedback:**\n\n* Posting feedback or complaints on the subreddit is **not** the best way to get the attention of the developers. If you have any specific feedback to give, you can email the CS2 Development team here: cs2team@valvesoftware.com\n* They do read every email received, but are not able to reply to each one.\n* If you're experiencing low-quality matches, it is always worth emailing them. They use these reports to help improve the system.\n\n**Report Cheaters:**\n\n* Report cheaters using the in-game report system by right-clicking their name on the scoreboard, and clicking \"report\". If the game is over, report their Steam Community profile.\n* If you notice certain trends or have other feedback, you can email the developers using the email address above.\n* To report a specific cheat, follow [these steps](https://support.steampowered.com/kb_article.php?ref=7849-Radz-6869#report) to notify the VAC development team.\n\n# The guidelines\n\nWhile we encourage discussion about these topics, as a reminder, the following are _not_ allowed. Note this isn't an exhaustive list, and you should review the [r/GlobalOffensive rules] (https://www.reddit.com/r/GlobalOffensive/about/rules/) before commenting.\n\n* Accusations towards any player related to cheating\n* Posting profiles of alleged cheaters (if posting pictures of matches, redact any usernames)\n* Posting any cheating gameplay footage\n* Reporting cheats, linking to cheats/websites, or discussing cheats in technical detail\n\nThis weekly discussion thread does not change any of our existing submission rules - you're still allowed to discuss these topics elsewhere on the subreddit as usual, but we do remove a large number of them as they quickly become repetitive and the majority have little meaningful discussion. If you decide to make a separate post instead of utilizing this thread, we encourage you to focus on starting meaningful discussion or providing constructive criticism.",
        "num_comments": 28,
        "comments": [
            "Matchmaking in nova(old rating) is a complete disaster, cheaters in the enemy team, cheaters in my team, and this more then 50% of my current games. The better cheater win.. nice",
            "Being teleported when you get shot is stupid af and ruins the game",
            "I finally have gotten my first 1V5 last alive clutch in CS2.\n\nOddly enough I have no issues getting aces, just normally I clutch up before everyone else dies, now when I look at cs stats I am not sad about a 0% 1v5 ratio lol",
            "High premier rank goes away too quickly due to inactivity. I had a bit over 25k and after a week of not playing I lost the rank.\n\nThe only way I get my rank back is if the (probably 4) cheaters on my team are better than the (probably 5) cheaters on the enemy team.",
            "the new patch feels terrible, been experiencing what feels like the first week of cs2 when it comes to peeking/holding, and dying to (seemingly) running enemies is 10x worse",
            "actually this is insane, how is it even a thing that game has no anti cheat. after u hit 20k ( and i got 21k idk how) is impossible to play. there is not just one, there are 8 people at the same time whos' cheating and running with a scout like crazy. at least give us overwatch so we can do your job !  on top of that reddit or any other social media must be flooded about cheating !",
            "Premiere is such a joke. We couldnt queue with our mate because  he was unrated and supposedly not on our skill level ( 20-22K ELO) . We queued at the same time in different lobbies and played against each other... thanks valve.",
            "Somehow I gained 90 exp while asleep? Any reason how this could've happened? I checked and my account is secured",
            "My CS is saying I don't have G-Sync/compatible with G-Sync enabled but it is enabled and the indicator shows up on other games but never showed up on CS lol, what should I do?",
            "I can't queue with my mates in prem because I don't have 10 wins, but when I solo queue to chase those wins I never get a game.  \nCurrently sitting in queue - 36 minutes with no game. 6PM Friday night."
        ]
    },
    "Valve can make movement feel better INSTANTLY by changing 1 server command": {
        "title": "Valve can make movement feel better INSTANTLY by changing 1 server command",
        "score": 498,
        "url": "https://www.reddit.com/r/GlobalOffensive/comments/1dr4lrc/valve_can_make_movement_feel_better_instantly_by/",
        "content": "I know some people already know about this but I feel like it should be being discussed more.\n\nThe sv\\_jump\\_spam\\_penalty\\_time command by default is set at 0.015625 - This command basically controls when you can jump or when you are locked out of jump, and the value of 0.015625 correlates to 1 of 64 ticks in 1 second.\n\nI encourage anyone to go into a map alone and change this value to even 0.01000 or 0.0078125 (half of the default which would correlate to 1 of 128 ticks in a second). It is 1000x more smooth to play with. No more randomly getting stuck or feeling locked out of movement when having to jump up 2 boxes or doing 2 jumps in quick succession, and bunnyhopping feels much better and very similar to 128tick in CSGO.\n\nI see no reason why this value shouldn’t be lowered from what its currently at, as 128 tick movement correlating to the value of 0.0078125 was already deemed acceptable in professional play for years, and would improve game feel for literally every player in the game.\n\nThe movement in CS2 doesn’t ”have to” match CSGO, but I would argue that lower values than the current one just straight up both feel and function better (and would also curb both pros and players in general from complaining about the movement with minimal effort for a big payoff).\n\nmore info on this topic in \\[this\\](https://www.reddit.com/r/GlobalOffensive/comments/166edpl/sv\\_jump\\_spam\\_penalty\\_time\\_should\\_be\\_001171875\\_to/)\n\nEDIT FOR ALL OF THE ”this would break competitive” or ”this makes bhopping too easy” PEOPLE:\n\nhundreds of thousands (maybe millions) of matches (all of ESEA, FACEIT, CEVO, any 128tick service), including all of pro play for the past decade or more has been played on the equivalent of the 0.007 configuration or at least the 0.011 configuration depending on how you want to look at it. I personally dont think it would break the game and I encourage you to please try the values for yourself before commenting this. This would benefit everyone and there are many many players including all pros who have already played countless hours on my/the other poster's suggested values.",
        "num_comments": 84,
        "comments": [
            "That would bring back bhopping",
            "Valve dev has already explained here that the value 0.015625 is   correct. He gave some technical explanation almost nobody understood, but hey they made the engine so Ill trust them on that.",
            "I have a better solution. Make the game 128tick like we've been able to since years before cs2!",
            "I suck at movment but i hate that bhop is almost out of the game, makes the flashy players less flashy",
            "It's almost as if 128 ticks was better",
            "Paging that one Valve employee who regularly scrolls through the sub. Please look into this ",
            "just tried it, its ofc better but still feels shit but thats due to cs2 being shit(at the moment) they might work on the game or just keep it noob friendly as it is right now.",
            "woah this is big if true, i need to test this out",
            "!remind me in 15 hours",
            "Oh for God's sake not this argument again"
        ]
    },
    "i miss how good spraying felt in csgo": {
        "title": "i miss how good spraying felt in csgo",
        "score": 74,
        "url": "https://v.redd.it/tkgno42vkh9d1",
        "content": "",
        "num_comments": 30,
        "comments": [
            "The screen shakes way less",
            "You can feel the crispness in that clip. Sadly I doubt CS2 will ever feel that good. Its just sluggish",
            "I can't spray in cs2. Whiffed more sprays in last 6 months of cs2 than like last 3 years of my play in GO.",
            "Man i miss csgo sooo much Fuck CS2 :(",
            "bro, rn everything is so sad, that we should have be happy about spray even in 64tick",
            "Just quit, its much better",
            "The targets are actually MOVING straighter not this  thanks to new CS2 leg animation. You don't even know where to start your spray looking at those wobbly moving targets",
            "Sluggish is actually a very good description of CS:2's gameplay.",
            "Someone clearly didnt play csgo back at the start",
            "(Arguable) But, hit-reg got better. Although sometimes I get kills which I shouldn't have gotten and other times, die behind walls. Subtick is partially at fault for both i suppose."
        ]
    },
    "G2 announce malbsMd": {
        "title": "G2 announce malbsMd",
        "score": 1246,
        "url": "https://youtu.be/0oK33JyT-FM?si=zKDOEqeTrTLGAmCI",
        "content": "",
        "num_comments": 198,
        "comments": [
            "The classic Bosnian-Danish-Russian-Guatemalan mix team",
            "It is such an L for Liquid and Col to not get this guy. Best talent to come from NA in awhile and he goes to Europe.\n\nRIP",
            "What a massive career move for him and after a long time G2 games are exciting to watch.\n\nEdit: did a whoopsie on countries, my bad",
            "G2 is finally cooking something",
            "I think watching G2 with stewie I realized how much they need a guy who will relentlessly take space and control without hesitation and let the stars follow up. I think he can provide that for them. Malbs is wayyyy more talented than Stewie at this point and even if he doesnt work out, I think the role could be good. Im kind of excited to see how it turns out",
            "how the fk have g2 won a tourney, dropped a player, announced his replacement...B4 C9 HAS ANNOUNCED A SINGLE THING. IM ABOUT TO LOSE MY SHIT",
            "Time for Hooxi and Taz to show they worth or else this gonna be a square peg round hole situation",
            "Malbs is good but hes replacing nexa so hes going to seem insanely good comparatively like when yekindar replaced shox. In a few months hell be igling and Niko and hooxi will be gone while g2 welcomes pwnalone and rainwaker",
            "Roster is so stacked Hooxi is gone if they don't produce the goods",
            "no more excuses for hooxi now. the team is stacked with talent."
        ]
    },
    "Rumors: Into the Breach trials BOROS": {
        "title": "Rumors: Into the Breach trials BOROS",
        "score": 62,
        "url": "https://csgo.com/news/112143-rumors-into-the-breach-trials-boros",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Hope he gets a second chance and makes good on it. Irrespective of how the falcons stint went, he still had some clear issues and this is his chance to grow  out of them.",
            "lets goo, ITB aim-maxxing is going crazy",
            "most underrated player available atm\n\ntry is good af too",
            "Smooya and BOROS sounds like the perfect combo",
            "BOROS story is hilarious, from Major debutante wonderkid to toxic work life kid kicked from his only relevant regional team",
            "Insane that this clown gets a second chance after what he did in Falcons.",
            "What did he do that was so terrible?",
            "you know he wasn't kicked for changing his mouse, right? He was kicked because he wasn't good enough",
            "bro is the Into the Breach investigator",
            "He dared to be the scapegoat for all their problems."
        ]
    }
}