{
    "No shit": {
        "title": "No shit",
        "score": 981,
        "url": "https://www.reddit.com/gallery/1dlhh8i",
        "content": "",
        "num_comments": 84,
        "comments": [
            "I mean, realistically, no one would expect a creature like this to exist and she probably thought Kōichi was simply over exaggerating due to PTSD. So obviously, after seeing the giant monster that matches the descriptions of Kōichi’s tale, she’d obviously wonder that…\n\nI don’t think anyone ordered a Yappachino but you got one anyways.",
            "She might think godzilla was this EXACT height all those years ago.",
            "https://i.redd.it/qpo03h9r318d1.gif",
            "https://i.redd.it/3016zpcmc08d1.gif",
            "“It looks like Godzilla, but due to international copyright laws, it is not”",
            "Why does Noriko ask the window, if that is Godzilla, when he is there and could answer her question? Is she stupid?",
            "![gif](giphy|bSa7cOkZ2pG2A)",
            "Weirdly enough no, that is a completely unrelated giant monster.",
            "Guys. She never heard of anything called Godzilla before, nor has she ever seen anything like this. She wasn’t actually asking, she was just shocked. ",
            "Actually it's Gigantis, figured that was obvious"
        ]
    },
    "The glazing is crazy😭": {
        "title": "The glazing is crazy😭",
        "score": 167,
        "url": "https://i.redd.it/6hbfm7npr28d1.jpeg",
        "content": "",
        "num_comments": 60,
        "comments": [
            "https://preview.redd.it/n0adho5t538d1.jpeg?width=556&format=pjpg&auto=webp&s=4a3f1b6512ccc34d2861c70955c84da21c1d5f80",
            "I. . . I think you may have a different understanding of 'glazing' than I do.",
            "For me they’re pretty close.\nMonsterverse is a lot more agile but Heise has a lot more power.\nFor me based on what we see on screen monsterverse should win but based on what we know with all the statements heise should win",
            "I watched both movies and think Evolved would win.",
            "It's hard for me to get a good grasp on how strong Godzilla is supposed to be in GxK because he didn't do anything. Like, he's more agile and glows a different color, but that seemed to be about it? I don't recall anything he did being particularly effective against the monsters he and Kong were fighting. Kong's power glove felt like a bigger upgrade.",
            "Unfair fight, Burning is already dying, this is Mike Tyson vs Mike Tyson who is having a heart attack",
            "Showa beats them both though",
            "that's probably because, comparitively, very few people have watched GvD and just vote evolved because they know he his powerefull without knowing anything about burning godzilla",
            "Honestly, I think Evolved does take this fight 😅\nMV Godzilla is just so strong these days",
            "Evolved does win, until he doesn’t. And then everyone loses. Unless they become friends and Evolved Godzilla rips Burning Godzilla like a bong dialing him down from death"
        ]
    },
    "Here is what Minus One looks like with classic colors": {
        "title": "Here is what Minus One looks like with classic colors",
        "score": 993,
        "url": "https://i.redd.it/cvp3cpvgoz7d1.jpeg",
        "content": "Feel free to give your thoughts.",
        "num_comments": 40,
        "comments": [
            "https://preview.redd.it/69sz0t2q108d1.jpeg?width=828&format=pjpg&auto=webp&s=f531af6eb7f8b12c85f0951152e926f555155175\n\nThe evolution of mankind",
            "Love it, does feel classic for sure",
            "I kind of like it.",
            "Is this the S.Hmonster arts figure done the classic colors or is it photoshop.",
            "Reminds Me of The Gemstone Goji Design From “Godzilla vs. Gigan Rex”.\n\nhttps://preview.redd.it/3rbie5cyg08d1.jpeg?width=640&format=pjpg&auto=webp&s=653abba5cde5e8f8df16f03e725c690638ffe92b",
            "WAY better imo.\n\nMinus one's design is amazing, but I hate the one color tone he and legendary have (besides evolved). \n\nThe dorsal plates need to be a different color from the skin to work imo, it doesn't feel right otherwise.",
            "looks really good.. honestly if TOHO was gonna keep the design for mass marketing use these colors .. or even use Heisei Godzilla colors.",
            "I like it it looks really nice 👍",
            "So much better than the mud look in my opinion",
            "It doesn’t really feel right, imo. Besides the fact that Minus One already has “classic” colors, outside of the dorsal fins. In the movie, and on the stock SH figure, he’s very much a charcoal gray color with patches of tan across his body, most notably on his feet and chest. And, his fins also have some color to break up the grayness."
        ]
    },
    "20 years ago, the Prince of the Monsters would enter his first battle in protection of humanity. ": {
        "title": "20 years ago, the Prince of the Monsters would enter his first battle in protection of humanity. ",
        "score": 867,
        "url": "https://v.redd.it/jdpgxu0ypz7d1",
        "content": "",
        "num_comments": 29,
        "comments": [
            "Desteroyah getting folded by a child",
            "Isn't this movie 30 years old or something?",
            "First, it was nearly 30 years ago. And second, are we gonna forget that Minilla fought and landed the final blow on King Ghidorah?",
            "This was actually the first old school Togo godzilla movie I ever watched",
            "Even as a juvinile,jr was fearless ,just like his dad",
            "Heisei godzilla is peak fiction",
            "I remember that good one",
            "I haven’t watched the Heisei era. But I gotta admit I love this fight scene.",
            "Very nice battle",
            "Junior!"
        ]
    },
    "Pick three to protect you, the rest attacks you": {
        "title": "Pick three to protect you, the rest attacks you",
        "score": 54,
        "url": "https://www.reddit.com/gallery/1dlsu47",
        "content": "",
        "num_comments": 34,
        "comments": [
            "Mecha g,godzilla and ghidorah is the strongest of the six",
            "Godzilla, Mecha Godzilla and Ghidorah. \n\nThere is no reason to choose anyone else. Maybe Kong will be a slight problem but not too much.",
            "Ghidorah, MechaGodzilla and Mothra. Mothra would convince Godzilla to join my side and I win.",
            "Muto, Mechagodzilla, and Ghidora",
            "Godzilla, ghidorah and muto, cuz mutos kill mg with emp , king ghidorah kills mothra and rodan and godzilla jills kong. Gg",
            "Godzilla, Ghidhorah and mothra",
            "Godzilla ghidorahmothra. Use ghidorah t kill mothra. Turn godzilla into burning godzilla and solo everyone else",
            "Well, the two obvious picks are gonna be King Ghidorah and Godzilla, that’s a no-brainer. Mechagodzilla or Kong could be the third member, but if it's the Kong shown and not current MV Kong, then you should pick Mechagodzilla.",
            "Godzilla mechag and king g. They lurking everyone.",
            "Godzilla, mecha g, and ghidorah"
        ]
    }
}