{
    "[Official Tournament Discussion Thread] 2024 Rocket Mortgage Classic": {
        "title": "[Official Tournament Discussion Thread] 2024 Rocket Mortgage Classic",
        "score": 16,
        "url": "https://www.reddit.com/r/golf/comments/1dpfpdu/official_tournament_discussion_thread_2024_rocket/",
        "content": "Event: Rocket Mortgage Classic\n\nLocation: Detroit, MI\n\nCourse: Detroit Golf Club\n\nPurse: $9,200,000\n\nDates: 6/27 - 6/30/2024\n\n[Tournament Website](https://www.rocketmortgageclassic.com/)\n\n[Field](https://www.pgatour.com/tournaments/2024/rocket-mortgage-classic/R2024524/field)\n\n[Tee Times](https://www.pgatour.com/tournaments/2024/rocket-mortgage-classic/R2024524/tee-times)\n\n[Course Overview](https://www.pgatour.com/tournaments/2024/rocket-mortgage-classic/R2024524/course-stats)\n\n[Leaderboard](https://www.pgatour.com/tournaments/2024/rocket-mortgage-classic/R2024524/leaderboard)\n\n[Fedex Cup Standings](https://www.pgatour.com/fedexcup/official-standings.html)\n\n[TV Schedule Link](https://www.pgatour.com/watch)",
        "num_comments": 222,
        "comments": [
            "Lol, 4 putt from Zach Johnson. Love to see it.",
            "Neil Shipley is quickly becoming a favourite of mine.",
            "Organizers of the Rocket look just brilliant right now for giving the exemption to the 15 year old, even if he doesnt make the cut.",
            "That 15 year old amateur just drove the ball 305. It's definitely my clubs guys, going to Carl's Golfland now.",
            "Wild they havent shown Wesley Bryan at all and hes -3 thru his first 8",
            "Cant believe Finau took the weekend off instead of giving the journeymen tour players their annual shellacking. Thought he would have been licking his chops heading into this.",
            "Wes Bryan playing really well ",
            "Why do they go to Kim so early, knowing his lengthy pre-shot routine?",
            "Akshay is playing such great golf lately",
            "Super cool for Russell shooting even par at his first PGA tournament. Pretty much guaranteed he will get some exemptions into tournaments going forward"
        ]
    },
    "Holy shit you guys it actually works... ": {
        "title": "Holy shit you guys it actually works... ",
        "score": 1082,
        "url": "https://i.redd.it/39d7289hle9d1.jpeg",
        "content": "Alright first things first, I know full well how much of a nerd I am.  If your only takeaway from this is \"holy shit that guy is a fucking geek\" then that is completely valid and I agree with you.  \n\nThat being said, I feel like I just accessed a new part of the matrix... \n\nYour balls are off balance.  Even brand new out of the box, there's a heavy side and a light side.  (This information is not my own, I got it from watching a Bryson video...but being the scientist that I am, I couldn't just take his word for it). \n\nI filled a tub with Epsom salt and water to the point where the balls would float. I spun them around a bunch until I was satisfied that I had found the heavy point on each one, and I marked a small dot just opposite of that heavy point (so I can put the dot on top and the heavy point is touching the ground) \n\nCursed knowledge incoming :\n\nTMy first test was on my putting mat (replica of the \"perfect practice\" mat with the regulation and also the smaller cup), and I discovered that from about 10' away, if the heavy point on the ball is set up on the left or right, it's actually enough to pull the ball COMPLETELY OUT of the smaller hole because the ball wants to turn towards the weight.   So you could realistically miss a 15 foot putt and it be 100% because of how the ball is set up... \n \n\nToday I got out on the course and did some experimenting...my natural shot shape is a draw.  I discovered that I can set up the ball on the tee with the heavy spot just a touch inside (the dot just a touch outside), and even exaggerating my normal shot shape I couldn't get it to draw as much as I expected... To the point that it completely blew my mind and I had to come tell all of you.   I didn't notice a lot of variance on a well - compressed iron or wedge shot, but tee balls absolutely were affected, and a lot more than I expected to see.  \n\nI definitely plan to use this to shape my salty balls into primo position in the very near future...  I just thought I'd share in case anyone else out there is as big of a nerd as me.   \n\nI used new TP5s and they're not terribly out of balance, but as I mentioned it does have a noticeable effect on a lot of shots.   If anyone uses a different ball and gets drastically different results I would love to hear about it.   ",
        "num_comments": 263,
        "comments": [
            "So, what I'm taking from this is that if I take a bunch of Epsom salt to the course, a lot of balls are going to float to the surface. I may never have to buy another ball...",
            "Well shit. Now I have a good excuse for my terrible shot dispersion, bad balls.",
            "Ill just attribute my slice to heavy balls now.",
            "My wife is going to be annoyed with me when I use up a bunch of her Epsom salt.",
            "Now everyone after they hit a 50 yard banana slice out of bounds.\n\nStupid ball I knew that one had a heavy spot. Give me another ball that one doesnt count.",
            "It's been known to work for 20+ years. I used to do it to all my tournament round balls",
            "MyGolfSpy measures off-centeredness of different brands. Titleist is the most consistent iirc.",
            "Use this to shape my salty balls  This sub needs more NSFW tags.",
            "Bryson didnt invent this. Its been going on for at least 20 years. So many years ago, Wilson Staff had a ball they marketed against other balls including the Strata and Pro-V1 where they had a display with balls in liquid showing this exact concept.",
            "Commenting so I remember to research this and the potential effect"
        ]
    },
    "Good to see a course properly enforcing pace of play": {
        "title": "Good to see a course properly enforcing pace of play",
        "score": 1872,
        "url": "https://i.redd.it/zslkj909xc9d1.jpeg",
        "content": "",
        "num_comments": 75,
        "comments": [
            "Did you ask them what they shot today",
            "Looking for the guy that shot 278 yesterday",
            "The boys playing a quick 9 before heading out?",
            "I'm probably just letting them play through, honestly.",
            "When a president goes golfing there has to be some level of something like that right? Especially if they were at say the Medal of Honor golf course at Quantico or whatnot.",
            "lol this is what happened when president Obama played the course I worked at back in Chicago.  Surreal experience, hilarious amount of security checkpoints filled with hilarious secret service agents giving caddies shit for having cigarettes, dip, or weed.  And, full blown tac gear and high powered rifles. Great stuff",
            "At gunpoint: Play it where it lies",
            "Ha! Saw two staties in a cart last Sunday afternoon while setting up an approach. They were polite and waited for the group in front to tee off before moving on. \n\nTurns out someone put a cart in the water and it looked like it was being handled as criminal mischief.",
            "Third sicario movie looks to be coming along nicely",
            "Staying on the cart path better than the walnuts that insist on having 2 wheels in the grass right next to the teebox"
        ]
    },
    "Twirling the practice swing": {
        "title": "Twirling the practice swing",
        "score": 1299,
        "url": "https://v.redd.it/zrha0sh0dd9d1",
        "content": "",
        "num_comments": 249,
        "comments": [
            "As long as its just one practice swing versus 6 and a 20 second waggle-fest.",
            "Perhaps he is nervous due to the star wars shirt pony tail reddit nerd filming him for god knows what.",
            "It was a nice practice swing",
            "It's the most important part of his swing",
            "Swear this sub hates fun man. Damn let the kid live and have fun",
            "Who gives a shit as long as he keeps pace. Honestly if it gives him a good feel than more power to it.",
            "I twirl my club constantly lol. It's a fidget thing.",
            "Perhaps it's positive visualization... setting the outcome mentally.\n\nGranted, I would never do such a thing, but what do I know?",
            "Practice how you play. Don't hate player.",
            "You just film strangers that get paired with you? I would hate playing with you"
        ]
    },
    "Nelly Korda when asked why she withdrew from upcoming tournament": {
        "title": "Nelly Korda when asked why she withdrew from upcoming tournament",
        "score": 2782,
        "url": "https://i.redd.it/5b8ec1vo4c9d1.jpeg",
        "content": "",
        "num_comments": 46,
        "comments": [
            "This is so dumb +1",
            "I feel terrible for laughing at this",
            "Dude your references are out of control. Everybody knows that.",
            "And this is why i internet.",
            "The dog had good taste.",
            "As one dad joke loving idiot to another, bless you sir",
            "Great template, one of the funniest interactions ever",
            "I was drinking water while scrolling and saw this, I spit a little on my screen, thanks for the laugh ",
            "is this skibbidi of the golf world?  I can't follow the references",
            "Please help Im obviously out of the loop?"
        ]
    }
}