{
    "Goofy Ahh Music Video": {
        "title": "Goofy Ahh Music Video",
        "score": 78,
        "url": "https://v.redd.it/4nki9ha03e9d1",
        "content": "",
        "num_comments": 12,
        "comments": [
            "I need real shows, real music videos fuck all this ai bs and no mic shows, ye give us what we want old man",
            "Me and all my goons hate ai",
            "Tf happened to the Mandela Catalogue",
            "Mods why is this pinned 😭",
            "I like to get my cyber dick sucked while im gettin high",
            "It’s not ai it’s actually aai artificially artificial intelligence ",
            "AI deniers stand together ✊",
            "Make her deep code her 10101 never get dry",
            "She say who data is this I say AI $ign who data is this I say AI $ign",
            "💀💀ts funny as hell"
        ]
    },
    "How Goons look when Kanye announces an album then ghosts everyone": {
        "title": "How Goons look when Kanye announces an album then ghosts everyone",
        "score": 193,
        "url": "https://v.redd.it/l4z4i1d28g9d1",
        "content": "",
        "num_comments": 6,
        "comments": [
            "I haven't laughed this hard in so fucking long 😭",
            "Now that I'm seeing it again, what if it's March 8 2025? And then April 5 2026?",
            "“pizza, pizza, pizza!” ahh comment",
            "![gif](giphy|fZRuTp3Zu8o9O)",
            "\"It's coming out May 3rd\"\n\nhttps://preview.redd.it/v7ynnobr8g9d1.jpeg?width=982&format=pjpg&auto=webp&s=4fb343760ee228dd0686976c6115ee451c8a50b7",
            "https://preview.redd.it/5yjrey5q8g9d1.jpeg?width=750&format=pjpg&auto=webp&s=c11ba26e16bf6e121deb42587c4708df2a8ec658"
        ]
    },
    "Shoutout to all the refreshers 🗣": {
        "title": "Shoutout to all the refreshers 🗣",
        "score": 46,
        "url": "https://v.redd.it/0fxmy4wf7i9d1",
        "content": "",
        "num_comments": 6,
        "comments": [
            "It's kinda nice. It's like we're silent friends 🙂‍↕️",
            "i love those gas goons",
            "all the other goons left because of the DRY SZN 😞",
            "Im done with Gas. Kanye fandom died with Kanye‘s willingness to put effort into a project.",
            "Shoutout to the lurkers",
            "GAS is a family🗣"
        ]
    },
    "2022 could've been Ye's best year or worst year, no in between": {
        "title": "2022 could've been Ye's best year or worst year, no in between",
        "score": 75,
        "url": "https://www.reddit.com/r/GoodAssSub/comments/1dr7nqb/2022_couldve_been_yes_best_year_or_worst_year_no/",
        "content": "Best Year:\n\n* Finished Donda 2 released on streaming\n* WAR collab album released\n* McDonald's collab\n* Jeen Yuhs Netflix documentary released\n* Donda Sports\n* Donda Academy thriving\n* Yeezy Gap releases\n* YZY SHDZ and other YZY drops\n* YZY video game\n* Weekly Promotional Youtube videos for clothes drops and albums like \"LAST WEEK\"\n* Ye looking fresh and energetic for the first time in a long time (Especially after the Free Hoover concert)\n* His team taking advantage of the \"Ye TikTok boom\" (similar to Taylor) making him the biggest rapper\n* Possible tour planned either with Carti or by himself\n* Ye press tour but instead of politics. He talks about clothes and music (he did that for a few tbf)\n* After witnessing the success of YZY, Ye is appointed the new creative director of Louis Vutton instead of Pharrel Williams\n* Overall Ye is happy and single or messing around with models\n* Ye finally gets Kim back after she sees he's stable and had a glow-up. The family has returned.\n\nWorst Year is self-explanatory.",
        "num_comments": 14,
        "comments": [
            "I shed a tear 🥲",
            "Thi is so funny cause I remember thinking this a day before the WLM shirt",
            "I doubt that war would be released in 2022",
            "2022 was fr a split in the timeline",
            "Ye just loves to blow everything up tho",
            "Uzi would've also opened for the Carti x Ye tour he fumbled what could have legendary 💔",
            "we lost all of this because of a shirt",
            "when i saw the interview of his reasoning behind it i could actually understand him a lot more. all my understanding was lost when he said that stuff abt Hitler tho. i believe he was being manipulated by the holocaust deniers he was working with OR he purposefully did ts to destroy his contracts ",
            "Who knows, he was already promoting it and it was looking at an end of year release before the controversies happened.",
            "we both know damn well that a tour between 3 generational liars like that would've never happened no matter what"
        ]
    },
    "Wow": {
        "title": "Wow",
        "score": 460,
        "url": "https://i.redd.it/cxyf0kqg9e9d1.jpeg",
        "content": "",
        "num_comments": 59,
        "comments": [
            "Ye nigga we know you hate Jews just finish the fucking album",
            "Hard to even be mad atp this shit is just so outlandish it’s almost funny like why is my goat like this 💀",
            "WELL HE CUT IT OUT SO THAT MUST MEAN SOMETHING GOOD",
            "Is this the DJ Khaled's Son of the Vultures era?",
            "I mean those lines haven’t been present since January or February at the latest, so this really doesn’t matter",
            "Add it to the other 734 reasons why dead is ass",
            "Ye please stop no one give a shit abt your opinion on Jews just give us music that we can listen to and not be called bad people for being your fans 😭🙏",
            "at this point the ye community is hanging on by a thread that truly collapsed many years ago\n\nstill gonna try to enjoy the music but its getting increasingly hard too the more he spews his shit",
            "Dead is amazing and it breaks my heart yall switched up",
            "How tf we getting these type of infos man!"
        ]
    }
}