{
    "Weekly #TeamPixel Photos Megathread June 27 2024": {
        "title": "Weekly #TeamPixel Photos Megathread June 27 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/GooglePixel/comments/1dpnkxa/weekly_teampixel_photos_megathread_june_27_2024/",
        "content": "This is the weekly photo Megathread. Photos captured with your Pixel (or other Google devices) posted outside of this thread are not allowed. Also, please mention the device you took the photo with. For more pictures, check out r/pixelography.\n\n**\\#TeamPixel**\n\n*An archive of past photo Megathreads can be [found here](https://www.reddit.com/r/GooglePixel/wiki/photos).*\n*To return to the Superthread, [click here](https://reddit.com/r/GooglePixel/about/sticky?num=2).*",
        "num_comments": 1,
        "comments": [
            "Not a photo, but has anyone noticed weird AI artifacts caused by moving arms in photos recently?"
        ]
    },
    "The June 2024 Superthread: Battery; Orders; Which Pixel?; and More": {
        "title": "The June 2024 Superthread: Battery; Orders; Which Pixel?; and More",
        "score": 15,
        "url": "https://www.reddit.com/r/GooglePixel/comments/1d5jmpj/the_june_2024_superthread_battery_orders_which/",
        "content": "*If you were redirected here from a removed post or a Megathread link, please scroll down.*\n\nThis is the Superthread, the subreddit's collection of Megathreads and other useful links.\n\nHere are the Megathreads:\n\n* **To open to the weekly Photos Megathread**, [search for the latest thread here](https://www.reddit.com/r/GooglePixel/search/?q=%22Photos%20Megathread%22%20author%3AGooglePixelMods&restrict_sr=1&sort=new). You can also share your photos on r/pixelography.\n* **To open to \"Which Pixel should I buy?\" Megathread**, [search for the latest thread here](https://www.reddit.com/r/GooglePixel/search/?q=\"Which%20Pixel\"%20author%3AGooglePixelMods&restrict_sr=1&sort=new).\n* **To open the Shipping Megathread**, home of order-related comments, issues, and suggestions, [follow this link](https://reddit.com/r/GooglePixel/comments/185kvy9/madebygoogle_2023_holiday_shipping_megathread/).\n* **To access the Battery Megathread**, for all support regarding battery life and condition, [search for the latest thread here](https://www.reddit.com/r/GooglePixel/search/?q=Battery%20Megathread%20author%3AGooglePixelMods&restrict_sr=1&sort=new).\n\n##Links\n* *[Google Store](https://store.google.com)*\n* [Subreddit Discord Server](https://discord.com/invite/GooglePixel)\n* [Rules](https://www.reddit.com/r/GooglePixel/wiki/guidelines)\n* [Wiki](https://www.reddit.com/r/GooglePixel/wiki/index)\n* [Reddit Request, for if you ever need more help with Google Support](http://gprr.dmzapps.com/)\n* **[Arbitration Agreement Opt-Out \\(only applicable in United States\\)](https://www.reddit.com/r/GooglePixel/comments/j2sjmg)**",
        "num_comments": 147,
        "comments": [
            "when will the June feature drop update release ?? waiting eagerly.....",
            "Still waiting for the June feature drop. It's late again!.",
            "When's the June update coming?",
            "Anyone know when the June 2024 Pixel Update is out?  For Pixel 8/8 Pro?  Thanks.",
            "June 17 and my Pixel 8 Pro still doesn't have the June update. Wild.",
            "Pixel 7 Pro/Pixel Watch 1 user here, a friend of mine recently switched from Android to iPhone and no longer has a need to keep his Pixel Watch 2. In a desire to get it out of his hands as quickly as possible, he's offered me the upgrade for $50. Would this be worth it? I know it's not a huge upgrade but it's also not a huge price so I figured I'd check in here. Thanks!",
            "What is the first thing i should do after getting new Pixel 8?",
            "I distinctly remember that I was going to buy the 8 Pro by trading in my good condition 6 Pro 128gb which was quoted for $400 and I added them to cart. Wasn't going to place the order until today afternoon and just noticed that the trade in estimate is now $300. I thought it was an error so added them again in cart but still $300. Has this been happening to anyone else? I'm not sure whether to place the order or wait. Can anybody suggest what should I do?",
            "I plan on switching to Google Fi and they have good offers for a Pixel if I switch, and I'm wondering if I should take advantage of it, or just switch my current phone (S24 Ultra) to Google Fi and hold off until the Pixel 9 Pro comes out? I'm honestly just tempted by the deal more than anything else.",
            "Why can't I post in this sub? It asks for links to post. Reddit bug?"
        ]
    },
    "Those who've owned Smart Watches, what are your thoughts of Pixel Watch 2?": {
        "title": "Those who've owned Smart Watches, what are your thoughts of Pixel Watch 2?",
        "score": 36,
        "url": "https://www.reddit.com/r/GooglePixel/comments/1dqy1k8/those_whove_owned_smart_watches_what_are_your/",
        "content": "?",
        "num_comments": 58,
        "comments": [
            "Pixel Watch 2 was a huge jump from 1 in battery life so on par and lasted longer than Samsung and Apple's counterparts which is great cos 1 was astrocious. But size was a dealbreaker for me so waiting for PW3 XL to come out this year.",
            "Fuckin love it, I use it more as a Fitbit so there is that... But idk battery life is ok... I wish it was more in line with the Fitbit charge series. The night time mode works beautifully",
            "I love it in terms of aesthetics and functionality. Battery life sucks though.",
            "Absolutely loved mine apart from the hellish battery life.  Wife just got me a Garmin Venu 2 and battery is at 24% after almost a week.",
            "Never buying a pixel watch again, customer service is a nightmare for pixel watch they just won't reply to you contacted them 3 times and every time they say \"that pixel watch teams aren't available at the moment will get you to you by mail\". It's been 2 weeks and I still have no mail or follow up. So avoid at all cost , if you broke it good luck fixing it by yourself.",
            "I just switched from Galaxy watch to pixel watch 2. It's way more seamless but also depends on the phone you use. If you use a pixel phone go for pixel watch 2... However the dial looks small so I bought a rugged Spigen case on the watch looks super cool ...",
            "I love my pixel watch 2 for the features and software and the super bright display that I can easily view in direct full Florida sun. Just wish Fitbit hadn't  turned into a dumpster fire when Google bought them.",
            "PW2 LTE , i can live with having to charge it every day since i do not take baths with the watch ,it is no problem for me to charge it while showering ,but imo in general the wearos ecosystem seems still a work in progress after so many years the devs have not embraced it. You have so limited apps options that actually the only use is to mirror the phone notifications and take calls.",
            "It's my first smart watch ever. I like it. I basically only use the Fitbit functionality though (heart rate monitoring during sports, sleep tracking) and checking the time, date, maybe weather/temperature from a glance. I like how it vibrates though for notifications and alarms and calls (especially since I always leave my phone on vibrate and I often missed calls due to not feeling the phone vibrating). I don't check notifications on my watch. Once in awhile I'll use my watch to talk on a call (only if I really can't get to my phone for some reason), but I try not to.\n\nIf I had to get a new watch, I'd probably just get a reduced functionality Fitbit one or something, since that's all I use and the battery life and cost would be much better.",
            "I have one. It's a very smooth experience. But it's so small it looks very feminine on my wrist. And the battery lasts no more than a day which means a lot of charging."
        ]
    },
    "Duplicating photos": {
        "title": "Duplicating photos",
        "score": 2,
        "url": "http://Googlephotos.com",
        "content": "When I upload pictures to Instagram or Facebook they show at the top of my Google photos as if they were taken that day so now I have duplicate pictures with different dates. \n",
        "num_comments": 0,
        "comments": []
    },
    "Google Pixel 8 Black Bar": {
        "title": "Google Pixel 8 Black Bar",
        "score": 12,
        "url": "https://www.reddit.com/r/GooglePixel/comments/1dr0rk7/google_pixel_8_black_bar/",
        "content": "This a Google Pixel 8 (Obsidian), I'm wondering what's the black bar at the top of my phone I haven't seen it to other Pixel 8.\n\nhttps://imgur.com/a/kcjOHgs",
        "num_comments": 8,
        "comments": [
            "Specifically thats the mmWave 5g antenna cut out. \n\nThey make sub 6 and they make mmWave phones.",
            "I have a pixel 8 in obsidian, and do not have that matte black section up top. Mine is a 256gb model, but I'm not sure that matters though. My guess is that you're a carnie, and you carnies are always a bit odd.",
            "Antenna. It can't receive signal through metal.",
            "Ohh I see. I'm sorry but what does the carnie means?",
            "Sorry, Mate. I was just teasing. A carnie is slang for a traveling carnival employee. All for grins, and nothing personal.",
            "Thats the MMWave antenna. You got the Pixel 8 model (GKWS6) that has 5G Sub-6 plus MMwave.\n\nGoogle sells multiple Pixel 8s: \n\nThere are 3 versions of Pixel 8 Pro: Japan (GE9DP), Global (GC3VE), & USA (G1MNW).\n\nThere are 4 versions of Pixel 8: G9BQD (USA/CA with Sub-6 only), GKWS6 (USA/CA with Sub-6 + mmWave), Japan (GZPFO), & Global (GPJ41)\n\nPixel 8 looks like the only model where you would have to purchase from a carrier to get mmWave in USA.",
            "That's the 5G antenna.",
            "That's the 5G antenna. There are multiple variants of Pixel 8 Pro with different support of 5G bands\n\nHappy cakeday btw! "
        ]
    }
}