{
    "Support Megathread - November 2023": {
        "title": "Support Megathread - November 2023",
        "score": 40,
        "url": "https://www.reddit.com/r/google/comments/17kz862/support_megathread_november_2023/",
        "content": "Have a question you need answered? A new Google product you want to talk about? Ask away here!\n\nRecently, we at /r/Google have noticed a large number of support questions being asked. For a long time, we’ve removed these posts and directed the users to other subreddits, like /r/techsupport. However, we feel that users should be able to ask their Google-related questions here. These monthly threads serve as a hub for all of the support you need, as well as discussion about any Google products.\n\n        \n> **Please note!** Top level comments must be related to the topics discussed above. Any comments made off-topic will be removed at the discretion of the Moderator team.\n>\n> [**Discord Server**](https://discord.gg/techcollective) We have made a Discord Server for more in-depth discussions relating to Google and for quicker response to tech support questions.",
        "num_comments": 1340,
        "comments": [
            "What's the point of this \"Megathread\" if no one ever helps anyone?? 😅🤣",
            "Who else is getting the annoying \"Search with an AI-powered boost\" pop-up from Google searches? There doesn't appear to be any option to actually disable it, just a \"Not Now\" button which seems to get ignored after a few searches and the pop-up comes back.",
            " So lately we have been having problems with our Nest Hub 2nd Gen in the kitchen - asking it a relatively simple maths question such as 'hey google, whats 353 divided by 4' it pauses then says 'i doent know how to help but i found these answers on search.' I noticed that when asking the question it the text on the screen says 'whats 3 5 3' then it stops. I have tried this on our other Nest Hub 2nd Gen and our first Gen - all of them are doing the exact same thing. Yet, asking the Hub Max it answers the question with no problem at all. Is / has anyone else had this issue?",
            "I have one user in my domain that is unable to send and receive internal emails, but external emails seem to be working just fine. This users' settings are no different than any others, but seem to be the only one experiencing this issue. Any ideas why, or what i can do to fix this?",
            "I did post this in the tech section but so far got no response, so apologies if this is in the wrong place?\n\n# My hijacked thumbnail and google inability to solve the problem\n\nMy most sucessful yoube video went viral for a few weeks, gaining a 1,000 views every day, then suddenly the traffic started to slow down to a trickle of 50 views a day. In searching for the reason I found out that the thumbnail has somehow become attached to other people's video of the same name **Veloute Sauce** in google images.\n\nAt first I thought someone had hacked my account in someway but the more I looked using different search terms, the more examples I found of my thumbnail being attached to other videos.\n\nSo I filled in the necessary DMCA form to take down the illegal versions of my thumbnail.\n\nGoogle action the DMCA reports which currently stand at 5, but as I write this post I can still find my thumbnail in **google images,** wrongly attached to other people's video's.\n\nToday (November 29th) I have even tried replacing the thumbnail and then pinging my Veloute video to see if that helped, it did not.\n\nI have reached to **google communities** who's only help was to leave a link to fill in the DMCA form.\n\nAt this point, I believe the problem has been caused by **google** but because I can not get google to respond to emails or my messages I do not know how to fix this problem which is damaging my monetised youtube channel and taking up way too much of my time.\n\nAny help from google to resolve this would be very much appreciated.",
            "[deleted]",
            "I can't get rid of \"Search with google lens\"\n\nI entered chrome//flags and searched for lens and there's nothing there. I can't disable that stupid feature.\n\nI'm on phone btw",
            "someone has been attempting to log into my Gmail accounts and I keep getting texts for it (and even calls). I have 2FA on but I’ve noticed my legit logins have G in front of the code and the other person’s attempts do not (ex: g-xxxxxx vs xxxxxx). Any ideas as to why? It still comes from the 22000 usually but I also got one from 833-902-0108 and two phone calls from a 202 number. I have a complex password & 2FA on so I’m not tooooo concerned but I am a little anxious.",
            "I accidentally sent an email through the wrong gmail account and I didn't realize I had the undo button enabled yet I deleted the email from my sent folder and trash bin. Does that still unsend it? or nah.",
            "**If you send an email with the term \"IA\" as its subject it will be blocked or your account will be disabled?**\n\nI was sending an email (from my personnal account) to a friend of mine, meaning to type \"AI\" for the subject title (asking him about AI), but instead I typed the subject as \"IA\".\n\nThe email got **blocked** and I recieved an email from \"Mail Delivery Subsystem <[mailer-daemon@googlemail.com](mailto:mailer-daemon@googlemail.com)\\>\" and was told my message was blocked. The intended recipient reported that it was not in spam, he just didn't get the email at all.\n\nI tried to send an email to myself with the subject set to \"IA\" and it was blocked. I thought that I might have been flagged as a bot/scammer so I then sent an email to my friend with no subject title at all and he successfully recieved it.\n\nI then tried sending an email to myself (email address of sender is the same as email address of recipitent for this test email) from an alternate account I rarely use to see what the problem is. The email immediately got flagged for **suspicious activity and I was logged out**. I could not log back in unless I gave Gmail a phone number so that they could send a code to it and confirm that I was a \"real person\"? Be aware I never once attached a phone number to this alternate email, so its just asking to make sure I am not a robot? No matter what device I used to try to login, it demanded my phone number.\n\nI then sent Gmail my phone number and recieved a code from my SMS messages, but instead of having to type it in, Google just immediately let me login without needing me to input the code. This **could** be explained away as the device I tried to sign into Gmail with is my phone which has my phone number and I probably gave Gmail permission to access my contacts, but its still kinda weird.\n\n**I have no idea why the two letters \"IA\" results in all this. My best guess is that \"IA\" is an acronym for some kind of illegal activity, but searching it up, it could litterally mean anything and if this is a security measure I could just immediately abandon the Email and start sending emails from an alternate account without \"IA\" as its subject. If anyone knows why \"IA\" results in these problems I would like to know.**"
        ]
    },
    "I just got rickrolled by Google Gemini. ": {
        "title": "I just got rickrolled by Google Gemini. ",
        "score": 81,
        "url": "https://v.redd.it/o1cdcjr4jd9d1",
        "content": "As the title goes, I asked something to Gemini only for it to provide me with a YouTube link that redirected me to Never Gonna Give You Up. Made me laugh but.. Is this a thing? ",
        "num_comments": 2,
        "comments": [
            "Well, it represents how we communicate on the Internet. I guess this is a feature and not a bug 😂",
            "AI memeing it up."
        ]
    },
    "Google's autocorrect is badass": {
        "title": "Google's autocorrect is badass",
        "score": 2,
        "url": "https://i.redd.it/laqptvhoxg9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            " how long did it take until they caught him?"
        ]
    },
    "Gemini censorship is sad": {
        "title": "Gemini censorship is sad",
        "score": 55,
        "url": "https://i.redd.it/jj67qeqp8b9d1.png",
        "content": "This is censorship at its finest and it's silly ",
        "num_comments": 62,
        "comments": [
            "Meanwhile, you got ChatGPT over here giving out wrong information on how to vote. \n\nhttps://www.cbsnews.com/news/chatgpt-chatbot-ai-incorrect-answers-questions-how-to-vote-battleground-states/\n\nMonths ago, Google [shared](https://www.cnbc.com/2024/03/12/google-restricts-election-related-queries-for-its-gemini-chatbot.html) that they would block Gemini from answering political related questions for 2024 since it's an election year for many countries. \n\n>*\"As we shared last December, in preparation for the many elections happening around the world in 2024 and out of an abundance of caution, we're restricting the types of election-related queries for which Gemini will return responses,\" the spokesperson said.*\n\n They seem to block Gemini from answering anything even remotely related to elections, like answers about politics, politicians, laws, etc. It appears Microsoft's Copilot AI has [similar restrictions](https://www.washingtonpost.com/technology/2024/06/16/ai-chatbots-alexa-2020-election-results/).\n\n>*Meanwhile, Microsoft and Google say they intentionally designed their bots to refuse to answer questions about U.S. elections, deciding it’s less risky to direct users to find the information through their search engines.*\n\nGoogle and Microsoft are well-known, established brands, and likely face far more scrutiny from the media and politicians in comparison to younger companies like OpenAI. So they likely have to be more careful about how their AI chatbots respond to certain user prompts.",
            "The last thing our current political hellscape needs is half-baked LLMs spewing hallucinations and unsourced nonsense everywhere. Disinformation is a big enough problem already, why on earth would we want AI regurgitating it? \n\nAlso, the prompt in the OP is a terrible example. Just ask it what halting means, there's no need to add a political context.",
            "You have trivialized so much the word “censorship” that it’s becoming useless to describe it for countries where it is a real thing.\n\n“My comment removed for insulting is censorship”\n“This AI not wanting to enter on political debates is censorship”\n“That company not wanting to have their image associated with antivaxxers or covid deniers is censorship”\n\nMeanwhile, in some countries people get incarcerated or even executed for speaking up or writing against their governments.",
            "I don’t think it’s censorship so much as their attempt to limit bias and potentially harmful responses. They’re not trying to protect a particular politician, for example, they just want to ensure the information being provided is less arbitrary and more definitive.",
            "Why do people insist on trying to get Gemini to talk politics? Chatbots don't have much insight on the subject. All they can do is introduce bias.",
            "I don’t think this is censorship. AI sometime gets things wrong. They are trying not to give misinformation",
            "“Censorship is when I don’t get the answer that I was fishing for”",
            "Have you tried their [Flash model](https://aistudio.google.com/app/prompts/new_chat) yet? It has some safety settings you could tweak.",
            "I'd rather the AI stay out of politics, even when the question is about a word, the overall theme is political and misinterpretation will happen",
            "I saw “Gemini censorship” and assumed it was another r/yugioh thread about how Komoney hates (insert summoning method here)\n\nVery confusing moment for me."
        ]
    },
    "Deadline For Getting Payment in Google $350M Settlement Is In a Month": {
        "title": "Deadline For Getting Payment in Google $350M Settlement Is In a Month",
        "score": 8,
        "url": "https://11thestate.com/cases/alphabet-investor-settlement",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}