{
    "Breakups in grad school": {
        "title": "Breakups in grad school",
        "score": 163,
        "url": "https://www.reddit.com/r/GradSchool/comments/1dqrb5i/breakups_in_grad_school/",
        "content": "My girlfriend of 4.5 years, who I lived with for a year, recently broke up with me after cheating on me with someone in her program and left me to live with him. To make matters worse, he was her TA. \n\nWe’re both grad students at the same university, however in departments with no overlap. Currently I’m working on my thesis but the grief and stress of this situation has made me fall insanely behind. \n\nI’m wondering if anyone has experience with long term/messy breakups during grad school. How do you regain your motivation? How do you navigate seeing them (as well as the person they cheated with) at the university? ",
        "num_comments": 68,
        "comments": [
            "Breakups during school are the WORST. Some people like to have school as a distraction, but for me trying to work while dealing with heartbreak and grief is just nearly impossible. My undergrad boyfriend broke up with me a few months before graduation and I had to go the last semester of my undergrad career just randomly seeing him around campus and feeling like I was being stabbed every time. Somehow though I managed to get everything done. It will probably be the same for you. Just go on auto-pilot the best you can. Try setting a timer for small chunks of time and say to yourself, “I’m gonna give my thesis my full attention for an hour and then take a break after that.” And if asking for extra time is an option for you, don’t be ashamed of doing that. \n\nIt gets better. You know that, but it always helps to hear. I met my husband in my PhD program soon after he and his previous girlfriend had broken up. Maybe your next person is right around the corner, or maybe you’ll take some time for yourself first, but either way, it will get better.",
            "Yeah, I’m currently going through a divorce at the tail end of my PhD. We were together through the length of my program. All seven years of it. It sucks ass, it really does. She said she didn’t love me anymore.  But I’m channeling the anger and heartbreak into finishing my last manuscript and my dissertation because I owe it to myself. Because I’ve worked hard for this. And more importantly because **I** still love me. There are moments when it hurts too much to act, I won’t lie. But it gets easier every day. You and I both got this, OP. We’ll make it.",
            "i found out my wife was cheating 2 weeks before my dissertation proposal meeting. Passed but it was another year before I could actually start my data collection because i needed to get my head right. I talked through every bit of my proposal with her so her thoughts were present on every page.\n\nMy advice is to talk to your advisor about what you need and how to proceed toward success. Worrying about them on campus, well that's something you're going to have to find a way to put behind you. Don't let their relationship take anything from you, and just live as well as you can. \n\nTherapy can help too. I did some intensive imaygo therapy with a therapist at the on-campus counseling center and that helped me manage the first few months.",
            "I went through a horrific break up in grad school. It definitely made everything significantly harder and my way of getting over it was basically saying \"fuck this\" about everything else. Ultimately, I graduated and am better for it, but it was in my final semester and one of the roughest periods of my adult life. \n\nThe things that helped me were a therapist and a cat. The therapist basically gave me the space to be angry and sad so I could work on other graduate school things. That cat provided unconditional love that would never actually leave me.",
            "Go find the TAs mom and date her.",
            "My ex and I were living together. He was working remotely while I was doing my PhD, and he told me he was going to go stay with his mom for a couple weeks; we lived far enough away that he hadn't seen her in about a year. \n\nHe gets there, and stops answering my texts in a timely manner. No big deal, I'm busy, he's busy, I know he arrived safely, it's all good. \n\nA week after he left, his mom messaged me to ask how I was going to get all of his stuff to him because he's never coming back.\n\nThat was...not awesome, to say the least. I took about a week to sulk, did basically no work, and then rearranged all the furniture in the apartment so it felt like it was 'mine' and not 'ours.' Then I threw myself into attending conferences, seminars, whatever I could do to keep my mind off of it. \n\nI'm sorry you're going through this. Break ups are awful. Break ups in grand school are worse. I hope you start feeling better soon!",
            "I feel like half of our cohort went through a devastating break up (or divorce) in our first year. They had a hard time, but they made it through. I think it helped that everyone relied on each other. They were also transparent with the professors if they noticed they were falling behind. Thinking of you, OP.",
            "Breakups are the absolute worst. It's one of the harder things in life somebody can go through.",
            "Last year I was in a two week situationship that devastated me two months before my MS defence. I am sure it is not comparable to your situation but I was truly going through it and out of the loop for a month, couldn’t do anything. I was crazy and sent myself to therapy. It worked and I got a little better for my defence. What helped me were 1) my friends and their support 2) emotional regulation methods such as radical acceptance. I am back to dating now but it’s been extremely hard for me for a lot of reasons but I still use the emotional regulation methods and they help me a lot",
            "Has a few.  Most schools have on campus counseling and psychological services.  Go talk to them."
        ]
    },
    "Can I be a therapist with just a masters degree in psychology ": {
        "title": "Can I be a therapist with just a masters degree in psychology ",
        "score": 3,
        "url": "https://www.reddit.com/r/GradSchool/comments/1dr36d8/can_i_be_a_therapist_with_just_a_masters_degree/",
        "content": "I have a masters in psychology is it possible to become a therapist without going back to school?\n",
        "num_comments": 6,
        "comments": [
            "If your masters program didn’t permit you to sit for licensing (after supervised hours) then no.",
            "You need to contact your states licensing board. It’s dependent on your states requirements, your program, the classes you took, etc… \n\nWe always required therapists to be eligible for licensure before hiring them, none with masters in psych ever came back after contacting the board so I never did find out what the conclusion was but I’m guessing they were not successful.",
            "It’s heavily dependent on the state but in general if your looking to be a clinical mental health counselor (I.E private practice therapist) then you’ll need your masters in addition to supervised hours after you graduate. Also, you’re going to have to pass licensing exams (typically the NCE or a state equivalent).",
            "To be a psychologist, no. you would required a doctorate. You could become a clinical counselor with just a masters.",
            "I think you need a PhD (i could be wrong)",
            "You could be wrong because you are"
        ]
    },
    "Has anyone taken 8 week classes?": {
        "title": "Has anyone taken 8 week classes?",
        "score": 7,
        "url": "https://www.reddit.com/r/GradSchool/comments/1dqxvaj/has_anyone_taken_8_week_classes/",
        "content": "I recently got my schedule for my first semester of grad school and I noticed that instead of 6 classes in 16 weeks, my school is doing 3 classes in 8 weeks. The first module I’m taking has a pretty difficult class and my program is hybrid so I know that I will need to be more responsible to make sure I get everything done. Any suggestions on how to be successful in 8 weeks classes/grad school in general??? ",
        "num_comments": 6,
        "comments": [
            "I am currently doing 3 classes in 6 weeks. They condense courses over the summer (when I did my masters it was the same). You just have to keep on top of all the due dates…",
            "As someone who's taken 8-week classes, prioritize self-discipline, set realistic goals, and stay organized.",
            "8 week classes, in my experience, are typically pretty easy. Most of them have a heavier weight on participation and projects",
            "Yes, I took 8 week classes for my masters. Sometimes it felt overwhelming just due to the pure content that had to be covered in such as short amount of time. For me, I had to curate a checklist each week of tasks and set aside specific study time - just think in only a few short weeks, you'll be one step closer to the finish line!",
            "I took quite of them in my undergrad during summers to get ahead, although only two concurrently at a time. \n\nIt can be hectic, but it’s manageable as long as you don’t leave everything to the last minute. If you do, you might end up doing all your assignments and multiple tests at once 😬",
            "I hate 6 week classes 😭. My prof decided to take next Friday off, so now it’s a 5 week class!"
        ]
    },
    "Impact of a C on Grad School Applications": {
        "title": "Impact of a C on Grad School Applications",
        "score": 6,
        "url": "https://www.reddit.com/r/GradSchool/comments/1dquhx7/impact_of_a_c_on_grad_school_applications/",
        "content": "Hi everyone,\n\nI have one C on my undergraduate transcript (it was in an English literature class) and a few B+'s as well. While I'm not as worried about my GPA overall, I'm concerned about how this C might appear to grad schools, especially those in the Top 20-50 range. I attend an average school for my undergrad, and it's  not a Top 100 university.\n\nHas anyone had any experiences with this? How significant was a lower grade in your application process?\n\nEdit: My major has nothing to do with English or humanities. I am a technology related major. ",
        "num_comments": 12,
        "comments": [
            "I got a C- on a few chemistry courses (labs, mostly) and had a major GPA of 3.09 (overall 3.21).  I'm currently about to take my second PhD exam in chemistry",
            "I have no clue how my university ranks, but I also got a C — in my intro to English literature class. \n\nIt didn’t stop me from getting a fully funded MA in English, though, so I have faith you can persist in spite of it.",
            "I made it to an Ivy with a C in a major specific course.",
            "I have 4 Cs on my transcript. They were in my first 6p hours and were major specific courses. 1 C shouldn't ruin you but also context matters",
            "There are so many things that can overcome grades. I for example had a 2.6 uGPA and am now in a PhD at a pretty good (top 50 overall, top 20 subject) R1 because my post-doc from my MS is faculty here now and got me in.",
            "Do you want to study literature? If not, it really doesn’t matter. If yes, as long as the rest of your literature grades are strong, it probably doesn’t really matter. I got a C+ in my science class in undergrad and no one cared at all during my MA and PhD applications (as someone that studies humanities).",
            "I had 3 D’s and a W on my transcript, all in required classes for my major (chemistry). I explained in my app, and retook them all. All it takes is one acceptance.",
            "In my experience, it largely depends on how related the course is to your intended degree and on whether or not the course was recent. If they based my application off of my first semester of undergrad I never would have gotten in.",
            "If you’re worried, there is usually a supplemental section where you can bring up anything you want. Usually people use it to bring up personal issues they had during school. I used that section to write why I got a b in a class. Granted that was during my MA, and I’m in a field where if you don’t get an A in the class, you basically didn’t pass",
            "I had a D in a major class that I had to retake, and some C’s as well. But upward gpa trend + relevant experience mattered more, and I got into my two top choices. One C will not matter much at all if the other elements of your application are solid."
        ]
    },
    "Help with deciding future plans": {
        "title": "Help with deciding future plans",
        "score": 1,
        "url": "https://www.reddit.com/r/GradSchool/comments/1dr54z0/help_with_deciding_future_plans/",
        "content": "I apologize if this is a long post but any help is appreciated. \n\nI am currently a rising senior pursuing mechanical engineering student at a t20 university in the US. I also had a computer science minor. I finished a 2 internships last 2 summers. \n\nI took a few CS classes and loved it. I eventually dropped my minor and made it into an additional CS major to hopefully pursue a CS career. I am still able to graduate in 4 years due to the amount of credits I came in with. The problem is I am not sure how to proceed from here.\n\nTo describe my situation more accurately, I have been reading up on computer vision and I find that field very interesting. I made one project using openCV (nothing to complicated to fancy but it is there on my github). I am trying to work on another project to give me more leverage and looking for hackathons to participate in next sem. I am looking into grad schools for computer vision but since I have been working towards getting a manufacturing/CAD job, I am not sure what to do to become competitive for a masters in CS. I am hoping to get a research based masters so I am able to get it funded (do not have money to pay for it). \n\nI am also open to getting a job and returning to grad school a couple of years later. I think this option makes sense since my application for grad school is extremely weak.  But on the other hand, I doubt Ill be able to land a job where I can make a good app for computer vision or ML. \n\nI am wondering how did people with relatively weak applications decide on schools to apply to and/or what steps did you take improve your application and show your research potential. I am not only lost about what to do but also how to figure out what to do. \n\n If anyone has thoughts specifically about applying to schools for computer vision, this is a brief look at my applications: \n\nMajors: Mechanical Engineering and Computer Science\n\nGPA: 3.2\n\nGRE: not given yet\n\nApplication stuff: \n\n1. Research  related to computer vision but in a interdisciplinary field (biostatistics): It has been a month since I started working in this lab. I am kind of slow and trying to pick things up but so far not as well as I'd like. My friend joined his lab and has made so much more impact since they joined the lab, I worry I will fall behind. As for the work I have done, I have done preprocessing and managed to train one model I was asked to evaluate. \n\n2.  Senior Design: Making a positioning system for a device that will be used for research in a National Lab. Used CAD to design said machine and I am using C++ to program its functionalities. Hoping my second letter of recommendation comes form this client. \n\n3. Formula Club: Worked there a year ago. Used CAD to make parts for various purposes and run simulations occasionally. \n\n4. Jobs Held: Fast food worker in freshman year making sandwiches, Resident assistant for a year and a half, 2 summer internships, 1 more summer internship going on (more related to electrical engineering as I am working with AutoCAD, suppose to go on for a year)\n\n5. Course Work: Introduction to Machine Learning (A), Neural Networks (B), Big Data Systems (AB), (taking optimization and software security next sem and plan to take OS and Data structures and algos the sem after that)  ",
        "num_comments": 2,
        "comments": [
            "Sorry, this is very important but just way too long, May you provide me a synopsis?",
            "Fair enough, let me try to make this short: \n\nI am a ME major, decided to pursue CS instead in second semester of Junior year (only a year and a half left at this point) -> interested in grad school for computer vision but don't have a good application for a research based masters -> cant do professional masters as I don't have the money -> cant get CS job because I don't have a good  resume for CS -> have one project and working on some other stuff to help with that tho -> additionally, I am also a CS major now\n\nThe bottom half of my post is a brief description of what my application would look like"
        ]
    }
}