{
    "Breakups in grad school": {
        "title": "Breakups in grad school",
        "score": 198,
        "url": "https://www.reddit.com/r/GradSchool/comments/1dqrb5i/breakups_in_grad_school/",
        "content": "My girlfriend of 4.5 years, who I lived with for a year, recently broke up with me after cheating on me with someone in her program and left me to live with him. To make matters worse, he was her TA. \n\nWe’re both grad students at the same university, however in departments with no overlap. Currently I’m working on my thesis but the grief and stress of this situation has made me fall insanely behind. \n\nI’m wondering if anyone has experience with long term/messy breakups during grad school. How do you regain your motivation? How do you navigate seeing them (as well as the person they cheated with) at the university? ",
        "num_comments": 77,
        "comments": [
            "Breakups during school are the WORST. Some people like to have school as a distraction, but for me trying to work while dealing with heartbreak and grief is just nearly impossible. My undergrad boyfriend broke up with me a few months before graduation and I had to go the last semester of my undergrad career just randomly seeing him around campus and feeling like I was being stabbed every time. Somehow though I managed to get everything done. It will probably be the same for you. Just go on auto-pilot the best you can. Try setting a timer for small chunks of time and say to yourself, “I’m gonna give my thesis my full attention for an hour and then take a break after that.” And if asking for extra time is an option for you, don’t be ashamed of doing that. \n\nIt gets better. You know that, but it always helps to hear. I met my husband in my PhD program soon after he and his previous girlfriend had broken up. Maybe your next person is right around the corner, or maybe you’ll take some time for yourself first, but either way, it will get better.",
            "Go find the TAs mom and date her.",
            "I went through a horrific break up in grad school. It definitely made everything significantly harder and my way of getting over it was basically saying \"fuck this\" about everything else. Ultimately, I graduated and am better for it, but it was in my final semester and one of the roughest periods of my adult life. \n\nThe things that helped me were a therapist and a cat. The therapist basically gave me the space to be angry and sad so I could work on other graduate school things. That cat provided unconditional love that would never actually leave me.",
            "Breakups are the absolute worst. It's one of the harder things in life somebody can go through.",
            "When I was in grad school, those of us who were married got divorced and those of us who were single got married. Not to each other.\n\nGrad school is stressful. People change.",
            "Has a few.  Most schools have on campus counseling and psychological services.  Go talk to them.",
            "I’m sorry. This has happened to me twice, once in undergrad & once in grad school. Both times were right before finals. It’s hard and devastating so let yourself feel your emotions and know they are valid. I can confidently say each day gets “better” and one day you will look up and realize how much you’ve healed. Hugs.",
            "Srry abt this man idk how to help. For me doing my thesis and focusing on it alone helped me escape but everyone is diff. Also shame shame on her wow",
            "I stayed at the school I went to undergrad for to go to grad school because my ex was finishing up there and we loved the area. She broke up with me 4 months after I started my first semester. Completely blindsided. I had never experienced something so painful before and I occasionally get kidney stones. \n\nLong story short, I stayed in bed for a month, got Covid, and then got a kidney stone. I still miss her.",
            "Wow she dated you for almost 5 years and left? Thats too long, must be tough. To be close to someone, and then next day your nothing, after you thought she was everything, now you gotta think of her as nothing. Crazy."
        ]
    },
    "REMOTE African American Studies Program": {
        "title": "REMOTE African American Studies Program",
        "score": 4,
        "url": "https://www.reddit.com/r/GradSchool/comments/1dr4gpx/remote_african_american_studies_program/",
        "content": "Hey All!\n\n  \nI'm wanting to apply to an African American Studies graduate program. Keep in mind, my focus is the education not the degree (fortunately, I'm in the financial position where I can get higher education basically for fun). Any suggestions on which universities have the best remote AA Studies program? \n\n  \nTIA! :)",
        "num_comments": 2,
        "comments": [
            "Have you considered the University of Maryland's online African American Studies program? It's highly regarded and offers a flexible remote option.",
            "look at HBCUs"
        ]
    },
    "Can I be a therapist with just a masters degree in psychology ": {
        "title": "Can I be a therapist with just a masters degree in psychology ",
        "score": 4,
        "url": "https://www.reddit.com/r/GradSchool/comments/1dr36d8/can_i_be_a_therapist_with_just_a_masters_degree/",
        "content": "I have a masters in psychology is it possible to become a therapist without going back to school?\n",
        "num_comments": 8,
        "comments": [
            "If your masters program didn’t permit you to sit for licensing (after supervised hours) then no.",
            "You need to contact your states licensing board. It’s dependent on your states requirements, your program, the classes you took, etc… \n\nWe always required therapists to be eligible for licensure before hiring them, none with masters in psych ever came back after contacting the board so I never did find out what the conclusion was but I’m guessing they were not successful.",
            "It’s heavily dependent on the state but in general if your looking to be a clinical mental health counselor (I.E private practice therapist) then you’ll need your masters in addition to supervised hours after you graduate. Also, you’re going to have to pass licensing exams (typically the NCE or a state equivalent).",
            "To be a psychologist, no. you would required a doctorate. You could become a clinical counselor with just a masters.",
            "I think you need a PhD (i could be wrong)",
            "You could be wrong because you are",
            "Thanks for the correction",
            "Some states allow it but require reaching a specific score level on the E triple P. The [EPPP test](https://home.pearsonvue.com/asppb) can be found here."
        ]
    },
    "Has anyone taken 8 week classes?": {
        "title": "Has anyone taken 8 week classes?",
        "score": 8,
        "url": "https://www.reddit.com/r/GradSchool/comments/1dqxvaj/has_anyone_taken_8_week_classes/",
        "content": "I recently got my schedule for my first semester of grad school and I noticed that instead of 6 classes in 16 weeks, my school is doing 3 classes in 8 weeks. The first module I’m taking has a pretty difficult class and my program is hybrid so I know that I will need to be more responsible to make sure I get everything done. Any suggestions on how to be successful in 8 weeks classes/grad school in general??? ",
        "num_comments": 11,
        "comments": [
            "I am currently doing 3 classes in 6 weeks. They condense courses over the summer (when I did my masters it was the same). You just have to keep on top of all the due dates…",
            "As someone who's taken 8-week classes, prioritize self-discipline, set realistic goals, and stay organized.",
            "Yes, I took 8 week classes for my masters. Sometimes it felt overwhelming just due to the pure content that had to be covered in such as short amount of time. For me, I had to curate a checklist each week of tasks and set aside specific study time - just think in only a few short weeks, you'll be one step closer to the finish line!",
            "I took quite of them in my undergrad during summers to get ahead, although only two concurrently at a time. \n\nIt can be hectic, but it’s manageable as long as you don’t leave everything to the last minute. If you do, you might end up doing all your assignments and multiple tests at once 😬",
            "8 week classes, in my experience, are typically pretty easy. Most of them have a heavier weight on participation and projects",
            "I hate 6 week classes 😭. My prof decided to take next Friday off, so now it’s a 5 week class!",
            "I keep seeing people say they only take 1-2 at a time but my program has us doing 3 every single module.",
            "Depends on your discipline. Greatly.",
            "It would depend on how the program is set up. So mine if you did 2 every term without any breaks it works out to 30 credits in a year. They typically run 3 classes a term, but they won't let you sign up for more than 2 anymore. Briefly when they switched formats some people did 3, but they were full time students. Most of us work full time jobs in addition to grad school.",
            "Yeah, taking anatomy and neuroscience in 8 weeks just seems a little rough"
        ]
    },
    "I need advice for a motivation letter.": {
        "title": "I need advice for a motivation letter.",
        "score": 1,
        "url": "https://www.reddit.com/r/GradSchool/comments/1dr7dwi/i_need_advice_for_a_motivation_letter/",
        "content": "I have a bachelor’s degree in chemistry from a Latinamerican university, and won a scholarship in 2020 for a master’s degree in chemistry at a European university. I had a really hard time because of some mental health issues, and although I followed all the courses, I did not do my thesis and did not graduate. \n\nAfter that, I decided to study another master’s degree in something more “applicable” and with more job opportunities. I am now finishing that master’s degree in another European country.\n\nI found that there is a great institute in the country I am currently living in, where they offer a very interesting master’s degree in chemistry, and although the first time I did not do well, I want to pursue it, because I keep thinking about having a life dedicated to research in my field.\nIn order to apply for this program, I have to write a motivation letter.\n\nNow, the question: should I mention all this in my motivation letter? They will see my CV and wonder about all the changes in my studies, and I do not know if explaining them would be a good idea.\n\n",
        "num_comments": 0,
        "comments": []
    }
}