{
    "Admissions/Rejections season can be really hard. Please offer support to one another and other resources here.": {
        "title": "Admissions/Rejections season can be really hard. Please offer support to one another and other resources here.",
        "score": 478,
        "url": "https://www.reddit.com/r/gradadmissions/comments/11bcrvq/admissionsrejections_season_can_be_really_hard/",
        "content": "Original post: https://old.reddit.com/r/gradadmissions/comments/dyxhsw/modpost_graduate_admissions_is_a_grueling_process/\n\nMore recent post:\nhttps://old.reddit.com/r/gradadmissions/comments/lakb6l/admissionsrejections_season_can_be_really_hard/\n\n\nMany if not most of those previous numbers are still valid, but please continue to contribute and build a new database for helplines.\n\nWhether you get in, don't get in, get in and then lose your funding, don't get funding at all, or whatever, everyone has risk at having a crisis when they need to talk. I personally used one of these helplines after losing funding as a graduate student during the '08 recession when I was in a really bad way. There is no shame in calling them. At. All.\n\nWhy is this necessary to post and share and sticky? As /u/ThrowawayHistory20 said in a previous thread:\n>Many of us seeking admission to top tier grad schools, and just grad schools in general, grew up our whole lives hearing “wow you’re so smart!” Or “you’re so good at X field!” from parents, teachers, friends, etc. That then causes many of us, myself included, to internalize this belief that being smart or good at our field or just knowing a lot of things is what makes us valuable. It can help drive us to be good at our field (though in a toxic way because it’s driven by a fear that if we fall behind, we lose the thing that make us valuable), but it also makes rejection very rough.\n\n>We know logically that when we get rejected from a top school in a competitive field that it means “you were a well qualified applicant, but there were too many well qualified applicants for us to take everyone,” but it can feel more like “you’re not good enough at the one thing you’re good at and the one thing that gives you value as a human being.”\n\nAgain, please share any additional resources and/or helplines here.\n\nArchived Helpline Info:\n\nIn the US, you can call 988 for crisis support, or 1-877-GRAD-HLP for support specific to graduate students/grad school issues.\n\nText 'HELP' to 741741 in the United States, or 686868 in Canada.\n\nAustralian folks can call 13 11 14.\n\nIn the UK, text 85258.\n\nIn Brazil, The CVV number is 188.\n\nIn India, call 022 2754 6669.",
        "num_comments": 132,
        "comments": [
            "The fact that there is a number in the U.S. specifically dedicated to graduate student crisis is alarming. . .\n\nBut glad the resource is there!",
            "I just got rejected. It was my first time applying as Im 42 and finishing my undergraduate degree currently. I cant help but feel its because Im older and changing careers. Its really humbling and definitely not a good experience",
            "I wnated to say, I really massively respect the dedication, focus and insane tenacity and skill of all people who seek to do a Masters or PhD. Your passion for the field and your ability and willingness to care for every detail, and the reams of article drafts you have to pour over... when universities say they stand on the shoulders of giants, they are standing on yours too! \n\nThis includes folks who are not commencing a Masters or PhD this cycle. Whether you try again (I hope you do!! Damn the application fees) or apply your skills and virtues elsewhere, the world needs your gifts and is the better for it.",
            "One of the tougher issues is getting admission and being denied a visa to go to school. For some of us in developing countries, the trauma is sometimes twofold. 1. Getting for the admission process hurdle and 2. Getting over the visa application process hurdle.",
            "Applied to twelve PhD programs, rejected from ten of them, still haven't heard back from two. I thought I was a strong enough candidate to at least get an interview, but I guess not. All that time and money down the drain and now I don't know what to do. I'm trying to bounce back and am applying to jobs and researching master's programs. Trying to see it as a blessing because I'm not so sure I even want a PhD anymore. I just feel so guilty like I'm letting my family down because I would have been the first in my family to go to grad school and I took a post-bacc year to focus on strengthening my profile and applying and now.....all that time and money gone. Sigh. Can't talk to my friends about it because they've been getting good news and I don't want to make them feel like they can't celebrate it with me. So I'm just venting here. I knew my program was competitive, but geez. Wasn't expecting this sudden life crisis lol",
            "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAH Where do I grow more patience  I'm obsessively refreshing my email 60 times an hour, still haven't heard back from unis with December deadlines ;__; it has been a full quarter guys pls get back to me thnx looking forward to your positive reply xoxo sincerely\n\nI finally understand why they repeatedly tell us to not contact them regarding admission status (:",
            "Pretty sure i got rejected from my masters programs. Saw people post about their acceptances on grad cafe but i haven't heard back lol.",
            "This is so so thoughtful, hang in there everyone! Good things are coming ",
            "As someone who got rejected from all 10 PhD programs two years ago (worked on masters in meantime), I just want to give some solidarity to whoever needs it. I've been putting off working on my applications this year because even though I know getting rejected isn't a comment on my abilities or on myself, it still hurt and it still left some scars. \n\nI just want to tell anyone who needs to hear that they're not alone. We'll get through this. It might take time, but we'll get through this.",
            "thank you for pinning this!"
        ]
    },
    "Admitted into LMU Munich!": {
        "title": "Admitted into LMU Munich!",
        "score": 12,
        "url": "https://i.redd.it/b26ri4y8nh9d1.jpeg",
        "content": "Took a chance and only applied to one university. Having to take time off work for the exam, interview, and studying through the evenings and weekends, it finally paid off! They had the highest number of applicants this year and I didn’t think I even stood a chance! Absolutely looking forward to be in Munich in a couple month’s time!",
        "num_comments": 1,
        "comments": [
            "Congrats!!"
        ]
    },
    "Roast my CV": {
        "title": "Roast my CV",
        "score": 91,
        "url": "https://i.redd.it/wx58j3khad9d1.jpeg",
        "content": "Hey guyz, first time posting on reddit, needed y'alls honest opinion on this CV, applying for MS in CS. Thanks in advance.\n",
        "num_comments": 34,
        "comments": [
            "Looks like you are from India",
            "You say that NoteVerse is designed to revolutionize the way users manage their notes but that doesnt really say anything. How exactly does it do that? What makes it different from other note platforms? Expanding on that will be more meaningful to admissions",
            "1. US people dont care abt 10th and 12th std marks. Remove that.\n2. Experience wise, add the clients name you worked for if possible or atleast the industry the client operates in. \n3. For projects, remove the more superfluous elements (revolutionary, breathtaking, appealing) and add the tech stack you used to create it.",
            "Not bad, however the look is a bit mediocre. I suggest you look at some nice templates ( e.g. take a look at europass or some tamplates that can be found in Overleaf). Not a pro but I think this can help.",
            "For experience, anything Im currently a part of I typically would put Start Date - Present so they know Im still involved. If thats not the case for you then please ignore me lol",
            "Specifically what did you do in / learn from these projects? Especially NoteVersesell yourself, not the app.",
            "What did you do with NoteVerse? The other two projects have what you did with them, but noteverse is just a description.",
            "Great start, but consider adding more relevant experience and skills to make it stand out.",
            "this is not exactly related to rating your resume, but I am truly impressed by your experience and projects, specially the projects you made during your internship. I'm interested in ML as well and your ML internship projects look so cool and informative! can you please give me tips on what sort of materials you used to prepare/learn about these projects? many of the terms sound so alien to me....",
            "Whenever you list your skills, its important to specify how many years of experience"
        ]
    },
    "How should a resume look for an admission in a T10 for grad (Engineering)?": {
        "title": "How should a resume look for an admission in a T10 for grad (Engineering)?",
        "score": 3,
        "url": "https://www.reddit.com/r/gradadmissions/comments/1dr86xx/how_should_a_resume_look_for_an_admission_in_a/",
        "content": "Hello! My apologies if this isn't quite the right flair or the subreddit to ask this question. Please redirect me if that's the case! I'm a bit unfamiliar with reddit and it's workings. English isn't my first language so please ask me to elaborate if I'm not clear!\n\nI'm a student who has just graduated high school and I'm in a summer break before college starts. I will be taking a course related to electronics in college and will be doing a bachelor degree in technology for my UG. It's always been my dream to be admitted into a T10 college so as the title suggests, I'm looking for what I need to have my application be stellar! \n\nWhile I have scoured the internet for requirements (I don't believe that's the exact word I'm looking for?) I haven't found a solid answer to my question, Basically I want to know how my resume should look.  I've always had an avid interest in electronics so I'm looking for courses related to that. EECS is kind of like the goal course. \n\nWhat are the bars that I should be hitting with regards to: \n\n* CGPA \n* Extra curriculars \n* External research (Should I be doing projects and stuff? How many?)  \n* Awards (What kind of awards should I be having?) \n* Exams + scores I need to hit\n\nThese are the things I've generally seen the internet refer to when it comes to \"admission criteria\" but are there more things I need? What kind of projects should I be doing? Are there any suggestions you'd like to give me? What else do I need?\n\nThank you so much for reading this post! Please share your thoughts if you have advice for me. ",
        "num_comments": 0,
        "comments": []
    },
    "Help me with my cv": {
        "title": "Help me with my cv",
        "score": 3,
        "url": "https://www.reddit.com/r/gradadmissions/comments/1dr8z7q/help_me_with_my_cv/",
        "content": "I'm composing my cv but don't know what to deal with the typesetting since i have about 7 TA job.\n\nShould I just write each out in different section and elaborate on what i did during that particular course(cuz some are very different), or should i just put it like: \n\nTA\n\nCourses:A, B, C, D....\n\n-combine into one or two bullet point ",
        "num_comments": 0,
        "comments": []
    }
}