{
    "Questions Thread (2024-06-24 to 2024-06-30)": {
        "title": "Questions Thread (2024-06-24 to 2024-06-30)",
        "score": 6,
        "url": "https://www.reddit.com/r/Granblue_en/comments/1dmut8b/questions_thread_20240624_to_20240630/",
        "content": "This thread is for any and all basic gameplay questions and technical issues you may have in order to prevent the subreddit from being cluttered with basic question posts.\n\n***If your question is an open-ended one that you feel most people can participate in or benefit from, feel free to make a thread about it instead!***\n\n*Got a question?* Don't be shy! Post away and there will *almost* always be someone happy to help. This thread is sorted by **new** in order to ensure that your post ends up at the top.\n\nIf you have something else to discuss, please check if it would belong in one of the following threads:\n\n* [Friends and Crew Recruitment Thread](https://www.reddit.com/r/Granblue_en/search?q=title%3A%22Friends+and+Crew+Recruitment+Thread%22+flair%3A%22Megathread%22&restrict_sr=on&sort=new&t=week): Recruit or search for crew, or search for friends.\n* [Salt Thread](https://www.reddit.com/r/Granblue_en/search?q=title%3A%22Salt+Thread%22+flair%3A%22Megathread%22&restrict_sr=on&sort=new&t=week): Share your luck, good or bad.\n* [Progress and Achievement Thread](https://www.reddit.com/r/Granblue_en/search?q=title%3A%22Progress+and+Achievement+Thread%22+flair%3A%22Megathread%22&restrict_sr=on&sort=new&t=week): Share your goals and progress.\n* [Event Discussion or Important Announcement](https://www.reddit.com/r/Granblue_en/about/sticky?num=2): Discuss the current event. Occasionally, important announcements are posted here.\n\n*If this post is more than a week old,* [*click here for the current thread*](https://www.reddit.com/r/Granblue_en/about/sticky/)*.*",
        "num_comments": 254,
        "comments": [
            "Under what hashtags on twitter do people normally find all the GW themed art that pops up?",
            "Is there a celestial weapon priority list?\n\nI already have sword fully uncapped.",
            "I'm a little confused on how to get Celestial weapons (I have a 3\\* Celestial Sword from previous runs that I'd like to uncap): I got the 10 fortune boxes from the basic missions, and I know there's a limit of 50 more fortune boxes on top of that, and each'll have a core. But then I also saw said that NM90 is the best place to farm drops for Celestial weapons themselves. While, alternatively, good fortune chests only come from NM95 or higher. So I'm really confused as to where the best place to get more of them is?",
            "What are the chances of chests of good fortunes popping?",
            "Hey all.  \nI fialy got 44 weapons to recruit Seox. I am the process changing the weapons element and i am not sure what element would be good for the Fist. Is there an element grid that benefits from Fist beeing main hand weapon?  \nThank you.",
            "Is it okay to dismantle celestial weapons you don't want for a different one in shop?",
            "How hard is it to farm evolite on sandbox? is it reliable? I really don't want to spend 500 valor badges on evolites.",
            "Are there any ways to disable Strike Time/ prevent 100% charge bar from it. As this would completely ruin my 1T setup for NM95",
            "I have 8 eternals FLB'ed and the only eternal I transcended is Six(130). Should I transcend Nio to 130 or get one of my remaining FLBs?",
            "Does veil negate all debuffs or is it just the first debuff that gets negated"
        ]
    },
    "\"The Last Sumo Warrior\" Event Discussion Thread (2024-06-28 to 2024-07-06) ": {
        "title": "\"The Last Sumo Warrior\" Event Discussion Thread (2024-06-28 to 2024-07-06) ",
        "score": 22,
        "url": "https://www.reddit.com/r/Granblue_en/comments/1dpzzfg/the_last_sumo_warrior_event_discussion_thread/",
        "content": "[Sumo Warriors: drenched in sweat and donning but a single loincloth, they are relentless in their pursuit of new heights.](https://preview.redd.it/ka23nfae269d1.jpg?width=640&format=pjpg&auto=webp&s=9921eb6998d2ce5e3e3f3839ebb1230e512f0fe6)\n\nThis thread is for any discussions that are directly related to the current event story or the lore to which it relate.\n\n* Event starts: 17:00 JST, June 28, 2024.\n* Event ends: 20:59 JST, July 6, 2024.\n\nTimestamp for Discord: `<t:1720267199:R>`\n\nWiki page: [https://gbf.wiki/The\\_Last\\_Sumo\\_Warrior](https://gbf.wiki/The_Last_Sumo_Warrior).\n\n*The use of the spoiler tool is recommended to ensure a pleasant experience to the players who are still in the process of reading the story.*\n\nThis is a **Token Drawbox** event.\n\n>The recommended approach for this task is to alternate between hosting the \"Very Hard\" raids to obtain the materials required for the \"Extreme\" raid. The latter will reward you with a substential amount of Tokens upon defeat. Additionally, \"Extreme\" raids have a higher chance of spawning Nightmare solo-battles, which will grant the player 100 Tokens for each successful clear and replenish a few host materials.\n\n>These multi-battles are suggested due to their relatively low amount of hit points, making it possible to cycle through them quickly. Commonly agreed-upon milestones are 4 Boxes (for Golden Gifts), 10 Boxes (for Damascus Crystals), and 20 Boxes (for Crystals). However, you can choose to clear many more boxes to generate Half-Elixirs and Soul Berries, depending on your specific needs.\n\n>Typically, acquiring around 750 materials from \"Very Hard\" raids, along with the additional ones from Honor and Battle Badges, should provide you with enough host materials to acquire the Tokens needed to clear 20 Boxes from Extreme raids and Nightmare battles.\n\n>As mentionned above, one can make the choice to stop at 4 Boxes and only acquire around 100 host materials. If the goal chosen is only 10 Boxes, then around 300 host materials should be obtained.\n\n>The first 5 multi-battles of the day cost no AP or host materials. It is recommended to spend them on either \"Impossible\" or \"Extreme\" raids to acquire more tokens.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nPast event threads: [LINK](https://www.reddit.com/r/Granblue_en/search/?q=flair%3A%22Event%22&restrict_sr=on&sort=new).",
        "num_comments": 124,
        "comments": [
            "Gotta love how Siete managed to avoid getting bullied in an event for once, mostly because Raziel was around and posed a fresher target, lmao",
            "It's so silly XD I'm glad snarky Vyrn made a return. Poor Raziel.",
            "Absurd is something rather common in the gbf universe but man was this something.  It was at the very least quite entertaining which made it a decent read.  Raziel coming out that stacked was something of a surprise.",
            "cool new Tier V preview",
            "My god, Raziel looks amazing. My spark is so gone. \n\nSilly event, it wasn't that bad.",
            "The Diviners and Vyrn are so funny this event. Also release summer Wilnas Cygames!",
            "What kind of cracked me up a bit is how Raziel's explanation of dosukoi is utter bullshit IRL, but might very well be what it is in GBF's universe.",
            "OK event overall. the casts despite being seemingly too large ended up somewhat justified (unlike some certain events). however i have to say i find the constant recurring tsukomi-ing / haha-funny-response / funny SFX moments really distracting. it feel like poor attempts on making the reader laugh and it really lessen the enjoyment of the event for me.",
            "I loved this event I couldn't stop laughing. Raziel being a lovable dork with her fun facts, Bennu almost killing the poor kappa in fear of his life, Sumo once again being a force that can bend reality, and Vyrn being extra snarky. Plenty of characters and many are involved in some kind of joke that brings out their personality.",
            "Damn, Raziel is stacked, I see your game Cygames"
        ]
    },
    "I hope you didn't skip through the latest event": {
        "title": "I hope you didn't skip through the latest event",
        "score": 89,
        "url": "https://i.redd.it/xncvjjkbgf9d1.jpeg",
        "content": "",
        "num_comments": 34,
        "comments": [
            "Yup, and if you play Gran similar thing happens w/ Seafon",
            "hold up is this real what the fuck",
            "I haven't started the event yet. Does this only happen if you're playing as Djeeta?",
            "They could've easily kept Narmaya on both MC genders and it would've still worked well but they went all out and paired Gran with Seofon and I really appreciate that.",
            "Just in time for pride month",
            "By chance does anyone know what uh...chapter of the event this is?",
            "Borderline smut? In my Christian Granblue Fantasy? Goodness gracious!",
            ">!That new power that mc gets looks dope asf too, maybe it could hint to the new class copium!<\n\nDamn i should have switched to female mc for this section smh.",
            "So is this like a canon pairing or can captain just pick whomever they want. Genuinely curious as I have not played the original game yet ",
            "iam feel blessed, hear this scene with headset"
        ]
    },
    "September Unf Pre checklist": {
        "title": "September Unf Pre checklist",
        "score": 34,
        "url": "https://www.reddit.com/r/Granblue_en/comments/1dqwsyd/september_unf_pre_checklist/",
        "content": "* Hrunting: 150 GM weapon\n\n* please farm your Earth M3 and Sieg HL\n\n* Galleon Sticks \n\n* Character list (normal): Earth olivia, Arulumaya(debuff issue)/Satyr, Earth koruru, Sabrina\n\n* Limited character: Halloween Cou cou, X helel, y pholia(post 10 turns), X naru (outdated but who knows she can be used).  Beware of the next seasonal (summer part2 earth units)\n\n* Evoker/eternal: caim (possible FLB), let's hope threo get some good use.\n\n* Next Earth Rotb character\n\n* Grand/limited:  uriel, Galleon, Sandalphon(we know the 50%),  zodiac tiger, Golden knight (only for copy attack?).  Let assume the next rumored grand/limited is also *Earth*\n\n* The earth kengo team. MC, OTKO (150), Satyr/aruru, Monika or  Benjamin\n\n* IF you have not flb your free Aletheia, that's your problem\n\n* Not released: Grand Sieg/Vane (Dragon knight story usually on September end), Grand/limited beatrice\n\n* FLB: Alexiel (Not likely since cygame often flb the ones that we do not wanted).   Other primal that have not FLB yet- I mean baal or medusa.  Let's throw in *Jin* (since he is a meme character and Cygame did not fix him correctly and the worse one always get the highest chance)\n\n* Bub\n\n* New class(tier 5?):  Although Sumo warrior from the June end story have unique battle animation.  Yes, We have  oniyoji from **chaosruler**/yamato.   It seemed sumo warrior is a fist (kind of lucha + ???)\n\nNothing is black and white for Unf boss yet.  The programmer could even change the boss right after August Leg or September flash.   \nThe meta is: did you prefarm extra mats and prepare extra for open up your unf options.\n( I don't have oro and Tyra during dark but i am doing fine.  I have even seen X yuni use in unf)\n\nRemember. We have not seen any part 2 summer (only reveal 2  characters but not specs) or new grand/limited yet.  Not having olivia does not mean the ending of earth (><)",
        "num_comments": 23,
        "comments": [
            "I love how you say that xmas naru is outdated while she's unfortunately still dirt's best non-mc attacker ",
            "I expect the boss to be designed to disrupt Kengo teams since Kengo with Satyr stomped NM200 for two Earth advantage GWs in a row.\n\n.....Which is a shame because I didn't have Satyr last time but I do now.",
            "I have the characters but I have a hard time farming sieg where I have to rely on ascendant prayer for constant clears...",
            "Siegfried is still the most painful Revans to farm.",
            "no galleon, no olivia, no satyr, no hallo cou cou, x helel, y pholia, no zodiac, no monika, oof im fked",
            "guess I should suptix satyr :-D",
            "My Earth grid needs some serious work....easily my weakest element right now.",
            "From this list my earth kinda sucks I hope summer can save me.",
            "At least mk2 lv 20 one each of sieg dagger and axe. Consistent hosting for diaspora probably enough before gw as for agastia oh well lmao",
            "it's not a rule per say, but we usually only get 2 Grand FLBs a year (I think there's been one exception during the first year Grand FLBs started being a thing), and we've already gotten both Europa and Lucio FLB'd this year.\n\nI'm not ruling it out, but I'd keep my expectations low."
        ]
    },
    "Upcoming Schedule (Light DB in July, Earth GW in Sept)": {
        "title": "Upcoming Schedule (Light DB in July, Earth GW in Sept)",
        "score": 70,
        "url": "https://i.redd.it/gnq8uytp5c9d1.png",
        "content": "",
        "num_comments": 66,
        "comments": [
            "For the benefit of anyone else who was wondering what to do with earth gw prep, what are earth magna grids looking like right now? Are exalto grids better than Caim grids now? Or a mix of both?",
            "As Olivia less person I'm fuck on that gw",
            "no Hrunting so brain dead Kengo it is. my 150 Octo is ready this time.",
            "Earth gw next\nWell Thank God I suptixed my Olivia LMAO",
            ">Earth GW\n\nOk. I'm fucked up",
            "Loud Olivia and hrunting noises! This is my time titan let's go!!!",
            "Y.Pholia might also see some use? She does have the twilight debuff Olivia has + teamwide assassin + GTA for 1hit",
            "So it's confirmed it's Water GW (Earth Advantage) and Dark DB (Light Advantage)? Gets a bit confusing when the wording gets swapped like that.",
            "Considering I'm almost close to finishing my Silver Sword for Seofon's 5*, I NEED those DB tickets.",
            "Earth is probably my worst element since its grands are so ass and it's so reliant on hyperlimiteds. I'll be fine gridwise (sans Hrunting) but I can only hope Caim and the eternals will pull through for me."
        ]
    }
}