{
    "Relink Questions Megathread / Community Discord": {
        "title": "Relink Questions Megathread / Community Discord",
        "score": 85,
        "url": "https://www.reddit.com/r/GranblueFantasyRelink/comments/1aec6xw/relink_questions_megathread_community_discord/",
        "content": "Submit all your questions about the game here!\n\nIf your posts contains spoilers, please mark it in spoilers!\n\n(How to make your spoiler your text)\n\n>!Text here!<\nOutput: Text Here\n\n---\n\n**Unofficial Granblue Fantasy: Relink Fan Discord**\n\nhttps://discord.gg/gbfr",
        "num_comments": 2401,
        "comments": [
            "Could we get a new link for the community server? The current one in the post and the sidebar are expired.",
            "so the story seems short, right? what about the other content? do yall see the potential to grind this game for like at least 50-100hrs, are there things to chase (like very hard fights, lots of stuff to level up/build)?   \n\n\nmight be too early to ask but given that story is short some people might already be in the \"postgame\"",
            "How do I matchmake? Do I go online choose a quest and depart for the matchmaking to start or do I choose a quest and wait in town for party to fill up before I ready?",
            "Not sure why it bothers me so much, but renaming the main char \"Captain\" makes cutscenes way more bearable. ",
            "How do I change my controller visualization in PC? Its showing at Xbox controller and I have a PS4 controller.",
            "I'm really interested in how the level scaling works. I have repeatedly ran into other players in Quick Quest using awakened terminus weapons who absolutely melt any boss encounter below Proud, and they're *clearly* not being scaled down. Don't have the level down arrow beside their profile icon either. Meanwhile I'm running a 150 Stinger weapon and shitty sigils and getting synced? It's bizarre.\n\n&#x200B;\n\nAlso, is it just me or does Percival's Strength/Sup Damage self-buff apply incredibly slowly compared to other characters' self buffs? Doesn't even feel like you can dodge out of the animation in a reasonable time and still get it going.",
            "Can you replay story quests? Missed some omen stones.",
            "Is there like a spreadsheet of what skills can be rolled as a substat in sigils?",
            "On PC using a controller.\n\nI want to use a configuration similar to one from Elden Ring or Dark Souls, but the key mapping shows only keyboard settings. Is there anyway around that? Thanks!",
            "I just want to complain that I hate the transmutation system as it is with a passion.  It's clunky, it's slow, it requires hours of getting vouchers,  transmutting, vouchering the ones you just got got, transmutting, vouchering the ones you just got. Rinse repeat."
        ]
    },
    "Future content ": {
        "title": "Future content ",
        "score": 8,
        "url": "https://www.reddit.com/r/GranblueFantasyRelink/comments/1dln0gr/future_content/",
        "content": "Anyone got any ideas on what the future holds I that seen relink will be at anime expo 2024 and im just curious or wondering if anything new is bound to come out ",
        "num_comments": 4,
        "comments": [
            "Simply put, we don't know. They have basically stated that 1.3.1 was all they had planned, but they MIGHT, keyword MIGHT do more.\n\nI wouldn't expect more than paid DLC characters at this point, if anything at all.\n\nRelink at Anime Expo seems more like they bought out the slot to demo the Shadowverse and Umamusume games, but decided to put up some Relink demos with Seofon, Tweyen, and Sandalphon unlocked to try to garner some more sales.",
            "Unlikely. Relink isn't carrying its own presentation or anything, it's a Cygames booth and it it's one of their recent cult hits so relink is gonna be there on the floor which makes sense, and does not suggest there's going to be any kind of unexpected announcements.",
            "I’m personally hoping for a Balanced graphics mode on ps5",
            "Honestly I would say it’s like a 50/50 chance of there being announcements"
        ]
    },
    "Ok can anyone else agree that this games PS5 version really needs a balanced graphics mode?": {
        "title": "Ok can anyone else agree that this games PS5 version really needs a balanced graphics mode?",
        "score": 2,
        "url": "https://www.reddit.com/r/GranblueFantasyRelink/comments/1dlpn6g/ok_can_anyone_else_agree_that_this_games_ps5/",
        "content": "The game plays great on performance mode but just looks really blurry and graphics mode looks good and all but locking it at 30fps has really bottlenecked it. I just feel like a balanced mode would really benefit this version of the game. I mean other anime games have managed to pull this off. Genshin Impact for example. That game can run at 4K 60fps on console so I don’t see why the devs for Relink can’t work on putting in a balanced mode in the game that runs at like 1440p 60fps. It just seems like they aren’t really taking advantage of some of the PS5s capabilities",
        "num_comments": 3,
        "comments": [
            "Yup, I agreed with you on this. An RTX 2080 which is equivalent of PS5 gpu can actually do above 60 fps max settings at 1440p. So there is no reason why they put such restrictions on PS5 version.",
            "I agree. I play in 4k 120hz monitors, performance mode look like shit while graphics mode hurts my eye because of 30fps.",
            "The only reason I have mine set to performance is because of the fps and yeah the graphics in performance mode are indeed crap. They should’ve just had balanced mode right from the start"
        ]
    },
    "In defense of buffs and debuffs": {
        "title": "In defense of buffs and debuffs",
        "score": 9,
        "url": "https://www.reddit.com/r/GranblueFantasyRelink/comments/1dlikfy/in_defense_of_buffs_and_debuffs/",
        "content": "I believe that people who say that ATK up/DEF down are useless have never experienced the pure, unbridled joy of 5 million damage from Paradise Lost. \n\nIt's a gimmick build for sure, but with an atk buff and DEF down on the enemy, SBA's hit way, WAY harder. I mean it's significant. It depends on the attack scaling of the SBA in particular obviously but DEF down is always useful.",
        "num_comments": 4,
        "comments": [
            "Back in 1.0 there was a funny 6.3m SBA Io build, dunno if it survived the tide of time, some SBAs are just like that (mostly the ones that have a lot of hits in them)",
            "I admit i didn't see DEF buffs having any value till the 1.3 boss rushes were added, played with a rossetta who kept DEF on the entire time and had a seigfried who spammed his party DEF buff, all those 1 shot sneak attacks from bosses only hit for 18-25k, makeing it easier to not get sniped off screen.",
            "my AI team noticeably does better whenever I main cag and keep the 30% def shred up. unfortunately, her AI is shit at it.",
            "OP is referring to defense down, not defense up. Defense up is as useless as the player is good before even factoring in the utility. That's only really good for very few things, like Zathba where offscreen nukes exist."
        ]
    },
    "Thinking about getting the game, did I miss the boat?": {
        "title": "Thinking about getting the game, did I miss the boat?",
        "score": 22,
        "url": "https://www.reddit.com/r/GranblueFantasyRelink/comments/1dkvf46/thinking_about_getting_the_game_did_i_miss_the/",
        "content": "I saw it’s on sale (ps5) and tried out the demo, had a lot of fun. But I tried like 5 times and  can’t beat the golem nowhere near the three minutes for the bonus goal.( Any tips would be appreciated.)\n\n So I tried going online and had no luck finding anyone to help. Now I dunno if the game has an sos flare equivalent from monster Hunter world or how matchmaking works ( or maybe demo online is only with other demo people ?) With all that I wondering the likelihood of finding help with some of the harder missions the game might have, or is the player base pretty much gone? \n\n\n\n\n\nThanks :) \n\n",
        "num_comments": 27,
        "comments": [
            "This is a game where you can solo grind and become so powerful that it literally doesn't matter if you have anyone to play with or not.\n\nStarting Bahamut runs and anytime new content comes out is about the only time its beneficial to have others play with you",
            "Anything that isn’t high level will be a struggle to find anyone",
            "You'll find people in endgame quest.\n\nIf you want to find people to help use the sup discord",
            "I believe the demo only allows you to join other demo players, which at this point likely has a dead online presence. Even if there were some playing it, I doubt they're gonna bother trying to queue for the S++ on the Golem cuz you don't need it to get all the demo rewards. \n\nThat said, if you want the S++ anyway, I recall a really old post just before launch showing a player achieving that using Charlotta as their character. I don't remember who they used for their AI party members or their sigil setup but looks like it's possible. Good luck.",
            "don't worry about the quest bonuses, you can come back later when you're stronger.",
            "It’s a primarily single player game. Even at launch, you’d only easily find players online quickly for the top two difficulty levels of quests. It also doesn’t have crossplay, so you’re playing online with players only on your platform.\n\nThe AI is good in this game and you can do most of it with your AI team. It’s a great game. Pick it up. It’ll be worth your time if you’re interested.",
            "I've played for over 50 hours and I've never gone into multiplayer, you don't need to and honestly you probably won't even want to unless you have friends playing",
            "Ive had the game for ages yet I would still ask the same question as OP.",
            "It’s pretty fun - but you need to get past the story solo. Matchmaking is an absolutely trash heap candidly - unlike monster hunter which does this well - GB for some reason just takes forever, and has loads of menus to load in for a 5-10 min match. \n\nResults may vary - could have been a very “meta” style game but kind of fell short - hoping they improve the formula in the future as combat is fun as hell.",
            "You can solo with AI through most of it save for the few later endgame missions. There is a currency locked behind co-op with randoms though, which stings a bit when you need to grind for mats faster."
        ]
    }
}