{
    "Free Talk Friday": {
        "title": "Free Talk Friday",
        "score": 0,
        "url": "https://www.reddit.com/r/GreenBayPackers/comments/1dqj2nr/free_talk_friday/",
        "content": "Friday = Good",
        "num_comments": 12,
        "comments": [
            "Wow am I nervous about this country. Thank god we have football soon to distract us!",
            "Anyone see mike tannenbaum say in a redraft he’d take Love #2, only after Mahomes? \n\nI love my man but that’s a bold statement",
            "Green Bay Packers",
            "Ami free to say I like the team",
            "I have perfected my homemade \"Chipotle\" \n\n\n\n\nAlso Mateo's Salsa is god tier \n\n\nAlso also \n\n\nMy neighbor asked what i was cooking and if she could have some. Sharing is caring, so I had her make a bowl. Felt good man. ",
            "ChatGPT is good for some things, but it absolutely mangles anything that needs fine details.",
            "Random thought for Free Talk Friday: I wish we the Packers fanbase could find out why the G-logo at midfield hasn't been painted in with the official shade of green since 2005. In RGB terms, it's R-24, G-48, B-40.\n\n\n-Gridiron Fields Database is my source; a website with the purpose of archiving how NFL fields looked through images.",
            "My wife is trying to perfect her cheese and queso dip recipe before the season starts so hopefully it’ll be perfect by game 1!",
            "Looking at the 4th quarter of the playoff game, what the hell happened to the offense?  Love goes 5 of 7 for 20 yards, and a pick.  Jones went off for 53 yards early in the quarter and one more carry for a yard.  We absolutely owned them on the ground like nobody else did all year.  \n\nWas it Love?  \n\nWas it the rain?  \n\nWas it Jones getting dinged (they were working on his helmet)?  \n\nThe offense just came to a screeching halt after that huge run at 9:37.\n\nWas it conservative playcalling by LaFleur?  Did he let off the gas?  Were we tired?\n\nWhen Jones snapped off the long gainer, I thought we punched our ticket.  Then basically nothing.\n\nedit.  And I've said it many times, but on that last McCaffrey touchdown Quay once again just guessed wrong and took himself completely out of the middle.  SMDH.  And they are going to count on him to be the man in the middle this season.  He can't shed blocks and just guess and runs recklessly into holes.  McCaffrey just waited for Quay to commit and walked right through the gap he vacated.  We are in trouble in the middle if he doesn't improve significantly.  \n\n[https://youtu.be/NT0gLmJu8jI?t=1466](https://youtu.be/NT0gLmJu8jI?t=1466)",
            "Don't be.  To be honest, this country has weathered many storms.  This is just another one.  I've been hearing it's TEOTWAWKI since 1998.  It's a lot of sensationalism."
        ]
    },
    "What caused our 4th quarter meltdown in the playoff game vs SF?": {
        "title": "What caused our 4th quarter meltdown in the playoff game vs SF?",
        "score": 41,
        "url": "https://www.reddit.com/r/GreenBayPackers/comments/1dqxryy/what_caused_our_4th_quarter_meltdown_in_the/",
        "content": "Looking at the 4th quarter of the playoff game, what the hell happened? Love went 5 of 7 for 20 yards, and a pick. Jones went off for 53 yards early in the quarter and one more carry for a yard. We absolutely owned them on the ground like nobody else did all year.  And then we just abandoned the run completely.  Jones got 3/4 of our offense output for the 4th quarter on that one play.   \n\nObviously, LaFleur needed to get him the ball more (drink!). \n\nLove didn't play well.  He missed a wide open Jones for a first down.  We got fucked out of a first on an uncalled facemask on Jones at one point that would have been huge.  \n\nI wonder if Jones got dinged (they were working on his helmet)?   They pulled him for Wilson who made a really nice hurdling first down but that was the final carry.  The offense just came to a screeching halt after that huge run at 9:37.   \n\nWhen Jones snapped off the long gainer, I thought we punched our ticket. Then basically nothing.\n\nedit. And I've said it many times, but on that last McCaffrey touchdown Quay once again just guessed wrong and took himself completely out of the middle. SMDH. And they are going to count on him to be the man in the middle this season?  He can't shed blocks and just guess and runs recklessly into holes. McCaffrey just waited for Quay to commit and walked right through the gap he vacated. We are in trouble in the middle if he doesn't improve significantly.\n\n[https://youtu.be/NT0gLmJu8jI?t=1466](https://youtu.be/NT0gLmJu8jI?t=1466)",
        "num_comments": 79,
        "comments": [
            "It was all Downhill after Zach Toms injury",
            "Both of our tackles went down, allowing Nick Bosa to wreck our offense. Then our defense refused to blitz or play aggressive - allowing the Niners to kill the clock on their way to a TD.",
            "Don’t forget Darnell Savage dropped a Pick 6, would have been a huge difference.",
            "Inexperience",
            "Zach Tom getting a concussion. IIRC that’s when Bosa moved to the right side and there was a lot of pressure in the 4th.",
            "The last 11 passes went for 19 yards and 2 interceptions.  Not gonna win when those are the numbers.  \n\nTough as he basically dominated the almost 10 games before that (counting the rest of SF).  23 TD, 1 INT with about 2/3rds completion percentage.",
            "It wasn’t a meltdown. It was a loss. There’s a difference. San Fran was a better team that day. Hopefully this year Green Bay will be.",
            "I’m not one to over analyze. I assume they know their problems and will work on it.",
            "Biggest difference in the game was their secondary didn’t drop gifts while gb did",
            "The rain, it only rained hard when we had the ball. Our last drive was the hardest it rained all game. Watch the tape."
        ]
    },
    "I have some NFL Packers memorabilia, and I'm trying to see if it is worth authenticating and if so how much it might be worth.": {
        "title": "I have some NFL Packers memorabilia, and I'm trying to see if it is worth authenticating and if so how much it might be worth.",
        "score": 25,
        "url": "https://www.reddit.com/gallery/1dqxn05",
        "content": "",
        "num_comments": 15,
        "comments": [
            "If the Reggie's real, that's the one that's going to be worth anything. Favre's image tanked and a signed dirty hat might fetch the cost of authentication. \n\nBut the Reggie could go for $175-$200.",
            "Probably both worth your time to get looked at. Reggie White is always pretty valuable and Favre stuff should go up as time passes, especially a Superbowl hat.",
            "My dad has a ton of cool old memorabilia.  One thing in his collection that I suspect could be worth a lot is this unused ticket to the Ice Bowl:\n\nhttps://imgur.com/a/UNvANJD\n\nIt was too cold that day for his car to start.  And my mom bailed because of the weather.  My dad hitchhiked to the game instead, planning to sell her ticket to someone outside the stadium.  He was excited and cold and completely forgot it was in his wallet.\n\nFun fact:  He still has the same 4 tickets he has had since the \"new stadium\" (as he still calls it) opened 1958",
            "Anyone have any Jack Vainisi stuff?",
            "Oh how I love that vintage hat signed by Reggie White. One of my favorite Packers.",
            "Where can I find that second hat?",
            "First one is a cool hat but was ruined since it was signed by a Viking.  The second one however might be worth it.",
            "Those Super Bowl hats were ugly. The main reason I never bought one back in the day.",
            "100% agree with this. Favre signs a ton of stuff and will keep signing a ton of stuff cause he has no other income.\n\nWhite’s signatures are super valuable and a limited commodity since he died so young. That’s probably worth making sure it’s clean and stored well, and authenticated if you don’t want to hold onto it.",
            "Thanks for the information. They are both real. The owners of the hats used to be very close to the team and got them signed themselves."
        ]
    },
    "It's T.J. Lang days until the #Packers play. Go Pack Go!! 😁": {
        "title": "It's T.J. Lang days until the #Packers play. Go Pack Go!! 😁",
        "score": 167,
        "url": "https://i.redd.it/kxduytocbb9d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Bahk, Sitton, Linsley, Lang, Bulaga was a fucking brick wall of a line.",
            "Damn forgot about TJ, what a GOAT 🫡",
            "He and Sitton baby!",
            "Damn 29 days flew by! Preseason and the fun before the fun is almost here boys! LFG!!!",
            "As we Are see azr the aa",
            "The one constant in 2016 was Rodgers would have 5 seconds to look for an open man."
        ]
    }
}