{
    "Friendly Reminder: Proper Use of the Report Button and Community Voting": {
        "title": "Friendly Reminder: Proper Use of the Report Button and Community Voting",
        "score": 43,
        "url": "https://www.reddit.com/r/greysanatomy/comments/15c1pgn/friendly_reminder_proper_use_of_the_report_button/",
        "content": "Hello /r/greysanatomy!\n\nAs the stewards of this subreddit, we want to take a moment to remind all users of the importance of using the report button responsibly and appropriately. Recently, we've noticed an increase in reports for posts and comments that do not violate either subreddit-specific or site-wide rules. This misuse of the report button disrupts the moderation process and diverts our attention from addressing genuine issues that require our immediate attention.\n\n***\n\n**Using the Report Button:**\n\nThe report button is an essential tool for maintaining the quality and integrity of our community. If you come across content that violates subreddit rules or goes against the Reddit guidelines, please don't hesitate to report it. Our team of moderators will carefully review all reports and take appropriate action when necessary. Remember, reports are anonymous, so don't be afraid to speak up when you encounter genuine problems.\n\n***\n\n**The Report Button is Not a \"Disagree\" Button:**\n\nIt's important to emphasize that the report button should not be used as a \"disagree\" button. Just because you may disagree with someone's opinion or find a post you don't particularly like, it doesn't automatically qualify as a reportable offense. The report button is meant to address content that is genuinely in violation of the rules, such as harassment, spam, or explicit content.\n\n***\n\n**What if something doesn't break the rules but I'm tired of seeing it or too much of it and I think it's spam?**\n\nWe understand that not every post or comment will resonate with everyone. Reddit is a platform that relies on community voting to determine what content is popular and what isn't. If you come across something that you find uninteresting, repetitive, or spam-like, please use the upvote and downvote buttons accordingly. This system allows the community to have a voice in shaping the content they want to see more or less of.\n\n***\n\n**False Reports and Consequences:**\n\nMaking false reports not only clutters the moderation queue but also creates unnecessary work for our team. This behavior is against Reddit's site-wide rules and can lead to serious consequences for the offending user. We want to foster a positive and welcoming environment for everyone, and that starts with using the report button responsibly.\n\nWe encourage everyone to engage in respectful discussions, share valuable content, and participate in the voting process to influence what gets more visibility in our subreddit.\n\nThank you for being a part of our community and helping us maintain a healthy environment for all members. If you have any questions or concerns, please don't hesitate to reach out to the moderation team.\n\n***\n\nSincerely,\n\nThe Grey's Anatomy Moderation Team",
        "num_comments": 2,
        "comments": [
            "Jackson, come get your Momma!! She needs to go back to the home! She done went crazy!!"
        ]
    },
    "name a sadder patient": {
        "title": "name a sadder patient",
        "score": 595,
        "url": "https://www.reddit.com/gallery/1dqre50",
        "content": "",
        "num_comments": 181,
        "comments": [
            "The girl stuck on the pole after the train wreck, I bawled!",
            "The girl whos familys RV was in the accident with Meredith and Alex on the ambulance, both her parents died on her 18th birthday",
            "The worst part of this patients story was that she went into the surgery convinced that her brain was hallucinating the boyfriend this entire time.",
            "The little girl who Bailey held all day because her dad was determined to get her to treatment in Mexico. She needs her dad for this part. \n\nCrying just thinking about it",
            "The STEM teacher who was visited by all her students.",
            "The jewish rabbi that died a slow death from a bad reaction to antibiotics, but spent his final hours helping April through her crisis of faith.",
            "Mary. The woman who survived gary clarke with bailey but not a simple colostomy bag removal. The documentary episode where she passes is one of my favourites i wish there were more episodes that style",
            "Not a patient but the old man whose wife died and when he was walking out of the er he said something like \"can you point me to the nearest bus stop my wife used to know everything\"\nI CRIED SO HARD",
            "The woman who had pancreatic cancer and wanted to carry the baby to term despite being terminally ill. I felt so sad for her best friend who was also the father.",
            "I didn't like George that much but how he went was awful . No one knew who he was until it was too late . I can't imagine being surrounded by people who know me but didn't know it was me ."
        ]
    },
    "I want this ending ": {
        "title": "I want this ending ",
        "score": 222,
        "url": "https://i.redd.it/5sw93b1pbe9d1.jpeg",
        "content": "",
        "num_comments": 31,
        "comments": [
            "This has been an ongoing theory for YEARS. Like none of the characters who 'died' are actually dead but Meredith forgot about them",
            "She doesn't necessarily have to have alzheimer's, but an ending that would make sense is that later in life she goes on to write a book about becoming a surgeon and how the experiences she had are what led her to become the \"great Meredith Grey.\" Final scene could be her at a book reading, finishing her last monologue, big applause, and then last shot is of her closing the book titled \"Grey's Anatomy\"\n\n(as for the other character voice-overs, maybe Meredith let them have some of their own chapters lol)",
            "Oh fucking God if the ending is Derek walking in and Mer mistakes him for George and Derek has to remind her that George died in the army or something",
            "I never understand this theory cause other characters do voice overs too. So, Dr. Bailey or Weber secretly broke into Mers house and wrote in her journals?",
            "Why do yall want Mer to have such a sad ending?",
            "I think itd be such a disservice to the character to have the whole show framed around her getting Alzheimers and forgetting people. \n\nAnd honestly with the breakthrough she just made on Alzheimers research in season 20, I really dont see the show going in that direction.",
            "Private practice already did the ending but I always hoped they were her books or her memoirs.",
            "I dont understand why anyone wants Meredith to end up like Ellis. The whole point was Meredith working so hard not to turn into her mother. What a depressing way to end a show. \n\nHow about she wrote the journals out of fear of getting Alzheimers but instead their a record of her journey to curing it. Maybe its part of a lecture shes giving. But I will be really pissed if the show ends on such a downer.",
            "No absolutely not. Meredith the woman who survived quite literally everything deserves a way better ending than ending up in a nursing home just like her mom. It would feel so cheap to bring it full circle in that specific way.",
            "corny. this kinda reminds me the \"it was all a dream\" trope"
        ]
    },
    "If you know you know": {
        "title": "If you know you know",
        "score": 1061,
        "url": "https://i.redd.it/tt98nxtrjb9d1.jpeg",
        "content": "",
        "num_comments": 46,
        "comments": [
            "Is that the little kid Derek paid to call Sloane \"Dad\" lol?",
            "Dylan minette trick or treating for ears will always make me happy",
            "damn so it was indeed dylan minnete from 13 reasons why. i did think he looks oddly similar initially tho",
            "I love the scene where Derek pays him to call Mark \"daddy\"  and Marks reaction is priceless ",
            "Just watched him die last night ",
            "Love the reference but there's no way in hell that Mark Sloan, M.D. F.A.C.S. would have made such abnormally tiny ears. He was a perfectionist.",
            "omg when was this pic taken? recently? this is amazing ",
            "Which episode was this? I want to rewatch",
            "Was this the kid that went trick or treating for ears?!?",
            "Ive been watching greys for the first time and I saw this episode for the first time earlier today and this kid was my favorite part"
        ]
    },
    "Y'all can come at me": {
        "title": "Y'all can come at me",
        "score": 14,
        "url": "https://www.reddit.com/r/greysanatomy/comments/1drb2bl/yall_can_come_at_me/",
        "content": "But I do not like izzie. She acts like its not her fault. Which it isn't just hers but she knew he was married. She doesn't need to act like what she did, doesn't matter. Ya she got cancer but doesn't mean anything just because she had cancer doesn't make you a good person either. Ik she prob becomes better but it's just my opinion. Then her saying Meredith slept with a married man ya but she didn't know so she did absolutely nothing wrong, she stopped seeing him after she found out but izzie is still trying to get with him and wanting him to get a divorce like ew. She can't even compare herself to Meredith. Just find someone from the bar don't go after married men. Same with O'Malley, why didn't he just not get with Callie absolutely no one can feel sorry for izze what she did was wrong. ",
        "num_comments": 11,
        "comments": [
            "Im not defending Izzie sleeping with a married man, but she wasnt wrong about Meredith.  Meredith absolutely knew that Derek was married when they had sex at prom.  He was there with Addison and she was there with McVet when they snuck off to have sex in an exam room.",
            "Well well, my most hated character in the show.",
            "who the hell likes izzie?",
            ">Just find someone from the bar< .... well",
            "True I honestly forgot that episode. That episode pissed me off to like Derek was so broken when he got cheated on but then he cheated to like sheesh. Why can't they at least break up with the person there with, before going onto someone new or if they do cheat then end the relationship don't try to work on it and just keep cheating.",
            "Fr I did but now it's just hard to even like her. A lot of the people on the show are hard to like.",
            "Well what it's not hard.",
            "For once I want to see someone hate characters that dont have a million posts about how theyre hated and omg that OP must be the only one who hates them. Lets get creative. Hate characters that dont get hate posts. And dont be a wuss and stick it under unpopular opinions posts. But just so its clear, the following get regular hate posts so youre not making any new observation that doesnt have a billion posts:\n\nOwen, Derek, Izzie, Catherine, Teddy. \n\nHeres to more creative posts!",
            ">Meredith slept with a married man ya but she didn't know\n\nMeredith knew at the fake Prom. Then her panties ended up on the board \n\nNonetheless. I agree that it's super duper not cool for anyone to cheat on their spouse OR for someone to knowingly pursue a person who is already married. Looking at Izzie, Mark, Lauren Boswell, Alex who should have sent Ava packing, Teddy, etc. \n\nI'm not an Izzie fan either, but I might have been if she stayed on the show a bit longer. She didn't really get a redemption storyline in the same way someone like Cristina did.  The departures on GA are largely unsatisfying.",
            "Christina. Cant stand her!"
        ]
    }
}