{
    "Friendly Reminder: Proper Use of the Report Button and Community Voting": {
        "title": "Friendly Reminder: Proper Use of the Report Button and Community Voting",
        "score": 39,
        "url": "https://www.reddit.com/r/greysanatomy/comments/15c1pgn/friendly_reminder_proper_use_of_the_report_button/",
        "content": "Hello /r/greysanatomy!\n\nAs the stewards of this subreddit, we want to take a moment to remind all users of the importance of using the report button responsibly and appropriately. Recently, we've noticed an increase in reports for posts and comments that do not violate either subreddit-specific or site-wide rules. This misuse of the report button disrupts the moderation process and diverts our attention from addressing genuine issues that require our immediate attention.\n\n***\n\n**Using the Report Button:**\n\nThe report button is an essential tool for maintaining the quality and integrity of our community. If you come across content that violates subreddit rules or goes against the Reddit guidelines, please don't hesitate to report it. Our team of moderators will carefully review all reports and take appropriate action when necessary. Remember, reports are anonymous, so don't be afraid to speak up when you encounter genuine problems.\n\n***\n\n**The Report Button is Not a \"Disagree\" Button:**\n\nIt's important to emphasize that the report button should not be used as a \"disagree\" button. Just because you may disagree with someone's opinion or find a post you don't particularly like, it doesn't automatically qualify as a reportable offense. The report button is meant to address content that is genuinely in violation of the rules, such as harassment, spam, or explicit content.\n\n***\n\n**What if something doesn't break the rules but I'm tired of seeing it or too much of it and I think it's spam?**\n\nWe understand that not every post or comment will resonate with everyone. Reddit is a platform that relies on community voting to determine what content is popular and what isn't. If you come across something that you find uninteresting, repetitive, or spam-like, please use the upvote and downvote buttons accordingly. This system allows the community to have a voice in shaping the content they want to see more or less of.\n\n***\n\n**False Reports and Consequences:**\n\nMaking false reports not only clutters the moderation queue but also creates unnecessary work for our team. This behavior is against Reddit's site-wide rules and can lead to serious consequences for the offending user. We want to foster a positive and welcoming environment for everyone, and that starts with using the report button responsibly.\n\nWe encourage everyone to engage in respectful discussions, share valuable content, and participate in the voting process to influence what gets more visibility in our subreddit.\n\nThank you for being a part of our community and helping us maintain a healthy environment for all members. If you have any questions or concerns, please don't hesitate to reach out to the moderation team.\n\n***\n\nSincerely,\n\nThe Grey's Anatomy Moderation Team",
        "num_comments": 2,
        "comments": [
            "Jackson, come get your Momma!! She needs to go back to the home! She done went crazy!!"
        ]
    },
    "name a sadder patient": {
        "title": "name a sadder patient",
        "score": 485,
        "url": "https://www.reddit.com/gallery/1dqre50",
        "content": "",
        "num_comments": 157,
        "comments": [
            "Thank you for contributing to r/GreysAnatomy! Tagging your post would be         greatly appreciated as the mods try to clean up and organize the sub. Not sure what tags to use? [Here's a link to the wiki page](https://www.reddit.com/r/greysanatomy/wiki/tags/) that explains the purpose of each post flair. Remember that name calling, hate speech and general rude behavior is not tolerated. You can call ideas stupid, but not the user. No direct personal attacks over a difference in opinion. Thanks for being part of this community. It's a beautiful day to save lives!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/greysanatomy) if you have any questions or concerns.*",
            "The girl stuck on the pole after the train wreck, I bawled!",
            "The girl who’s family’s RV was in the accident with Meredith and Alex on the ambulance, both her parents died on her 18th birthday",
            "The worst part of this patient’s story was that she went into the surgery convinced that her brain was hallucinating the boyfriend this entire time.",
            "The little girl who Bailey held all day because her dad was determined to get her to treatment in Mexico. “She needs her dad for this part.” \n\nCrying just thinking about it",
            "The STEM teacher who was visited by all her students.",
            "For me the saddest is Bonnie. Broke my 💔\n\nBut from not mentioned ones:\n\n- Elsie 16:22 Clatch, a surgeon that came in with her husband of 60 years and the husband pronounced her dead at 16:22\n\n- Nick the exposed carotid artery guy\n\n- Alison Clark, Izzy’s cancer friend (aka Liza Weis and Paris from Gilmore Girls) NOT the Alison Clark wife of Gary Clark. This Alison seemed to beat stage 4 cancer and was doing really well until she wasn’t.\n\n- Jeremy from the brain tumors trial",
            "The jewish rabbi that died a slow death from a bad reaction to antibiotics, but spent his final hours helping April through her crisis of faith.",
            "Wallace",
            "I didn't like George that much but how he went was awful . No one knew who he was until it was too late . I can't imagine being surrounded by people who know me but didn't know it was me ."
        ]
    },
    "I want this ending ": {
        "title": "I want this ending ",
        "score": 183,
        "url": "https://i.redd.it/5sw93b1pbe9d1.jpeg",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Thank you for contributing to r/GreysAnatomy! Tagging your post would be         greatly appreciated as the mods try to clean up and organize the sub. Not sure what tags to use? [Here's a link to the wiki page](https://www.reddit.com/r/greysanatomy/wiki/tags/) that explains the purpose of each post flair. Remember that name calling, hate speech and general rude behavior is not tolerated. You can call ideas stupid, but not the user. No direct personal attacks over a difference in opinion. Thanks for being part of this community. It's a beautiful day to save lives!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/greysanatomy) if you have any questions or concerns.*",
            "This has been an ongoing theory for YEARS. Like none of the characters who 'died' are actually dead but Meredith forgot about them",
            "Oh fucking God if the ending is Derek walking in and Mer mistakes him for George and Derek has to remind her that George died in the army or something",
            "She doesn't necessarily have to have alzheimer's, but an ending that would make sense is that later in life she goes on to write a book about becoming a surgeon and how the experiences she had are what led her to become the \"great Meredith Grey.\" Final scene could be her at a book reading, finishing her last monologue, big applause, and then last shot is of her closing the book titled \"Grey's Anatomy\"\n\n(as for the other character voice-overs, maybe Meredith let them have some of their own chapters lol)",
            "I never understand this theory cause other characters do voice overs too. So, Dr. Bailey or Weber secretly broke into Mer’s house and wrote in her journals?",
            "Private practice already did the ending but I always hoped they were her books or her memoirs.",
            "Why do y’all want Mer to have such a sad ending?",
            "I think it’d be such a disservice to the character to have the whole show framed around her getting Alzheimer’s and forgetting people. \n\nAnd honestly with the breakthrough she just made on Alzheimer’s research in season 20, I really don’t see the show going in that direction.",
            "No absolutely not. Meredith the woman who survived quite literally everything deserves a way better ending than ending up in a nursing home just like her mom. It would feel so cheap to bring it full circle in that specific way.",
            "I don’t understand why anyone wants Meredith to end up like Ellis. The whole point was Meredith working so hard not to turn into her mother. What a depressing way to end a show. \n\nHow about she wrote the journals out of fear of getting Alzheimers but instead their a record of her journey to curing it. Maybe it’s part of a lecture she’s giving. But I will be really pissed if the show ends on such a downer."
        ]
    },
    "If you know you know": {
        "title": "If you know you know",
        "score": 975,
        "url": "https://i.redd.it/tt98nxtrjb9d1.jpeg",
        "content": "",
        "num_comments": 42,
        "comments": [
            "Thank you for contributing to r/GreysAnatomy! Tagging your post would be         greatly appreciated as the mods try to clean up and organize the sub. Not sure what tags to use? [Here's a link to the wiki page](https://www.reddit.com/r/greysanatomy/wiki/tags/) that explains the purpose of each post flair. Remember that name calling, hate speech and general rude behavior is not tolerated. You can call ideas stupid, but not the user. No direct personal attacks over a difference in opinion. Thanks for being part of this community. It's a beautiful day to save lives!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/greysanatomy) if you have any questions or concerns.*",
            "Is that the little kid Derek paid to call Sloane \"Dad\" lol?",
            "Dylan minette trick or treating for ears will always make me happy",
            "damn so it was indeed dylan minnete from 13 reasons why. i did think he looks oddly similar initially tho",
            "I love the scene where Derek pays him to call Mark \"daddy\" 😂😂😂😂 and Mark’s reaction is priceless 🤣",
            "This is so cute",
            "#DADDY",
            "Eaws 🥺",
            "Just watched him die last night 😭😭😭",
            "Trick or treat"
        ]
    },
    "Eric Dane Reflects on Being 'Let Go' from Grey’s Anatomy: 'I Wasn't the Same Guy They Had Hired'": {
        "title": "Eric Dane Reflects on Being 'Let Go' from Grey’s Anatomy: 'I Wasn't the Same Guy They Had Hired'",
        "score": 73,
        "url": "https://people.com/eric-dane-reflects-on-being-let-go-from-greys-anatomy-8671568",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Thank you for contributing to r/GreysAnatomy! Tagging your post would be         greatly appreciated as the mods try to clean up and organize the sub. Not sure what tags to use? [Here's a link to the wiki page](https://www.reddit.com/r/greysanatomy/wiki/tags/) that explains the purpose of each post flair. Remember that name calling, hate speech and general rude behavior is not tolerated. You can call ideas stupid, but not the user. No direct personal attacks over a difference in opinion. Thanks for being part of this community. It's a beautiful day to save lives!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/greysanatomy) if you have any questions or concerns.*",
            "> When Shepard, 49, noted the actor was “struggling” with drug and alcohol addiction at that point, Dane responded, “I was struggling. They didn't let me go because of that, although it definitely didn't help.\"\n\n> \"I was starting to become — as most of these actors who have spent significant time on the show — you start to become very expensive for the network,\" he claimed. \"And the network knows that the show is going to do what it's going to do irrespective of who they keep on it—as long as they have their Grey they were fine.\"\n\n> Dane went on to praise Rhimes’ handling of the situation, saying, \"She protected us fiercely. She protected us publicly, she protected us privately... I love Shonda Rhimes and she protected me but I was probably fired. It wasn't ceremoniously like, 'You're fired,' it was just like, 'You're not coming back.'\"",
            "I really wish they’d picked ways to fire people without always killing them. With the show having gone this long, they’ve built so much history that they can’t even use because they killed so many characters. Imagine if they’d just let George go into the army. People change jobs all the time.",
            "IMHO, letting him go was a mistake. He really helped with the comedic moments on the show. He had very believable banter with Derrick. You could really see the non sexual chemistry they had not to mention the dynamic with Callie. I'd give them 10 Maggie's to get back Mark and Lexie. I get that the man whore stuff doesn't play as well to younger audiences but stuff was sadly like that back then. Nothing they showed or said at that day and age was unrealistic as far as him being so gross now.",
            "why did they photoshop mark’s hair to look ginger like owen’s in that picture?",
            "Honestly, his character just doesn’t survive after Lexies death. Like I can’t imagine a version of Greys where Mark ever really recovers from that. Even though they had broken up, he clearly still loved her (I mean he literally says it to his gf lol) so he would have been forever changed by watching her die",
            "Well I appreciate him taking responsibility for his own mistakes it's unfortunate that he is one of the few all time great characters with a definitive not moving back exit obviously because his character died. Sucks I'd love to see more Sloan he and Lexie were a welcome surprise during season 17.",
            "Seeing Mark go on with Lexie being dead would've been more painful",
            "I hate that we were robbed of seeing where the characters could have gone for the sake of drama.",
            "“McStreamy”????"
        ]
    }
}