{
    "Regarding Female Space Marine posts on Grimdank": {
        "title": "Regarding Female Space Marine posts on Grimdank",
        "score": 2122,
        "url": "https://www.reddit.com/r/Grimdank/comments/10w7usq/regarding_female_space_marine_posts_on_grimdank/",
        "content": "Grimdank has always and will be a sub for sharing of the dankest Warhammer, 40K, AOS and other tabletop memes, Jokes and other forms of media. The mod team strongly believes in the freedom of expression of all the voices that contribute and bring this wonderful hobby of ours together.\n\nHowever, there is a recent rise in drama-baiting using a specific topic of female space marines, which then in turn results in more flame wars and other drama.  **We believe that these posts contribute nothing (not even a laugh) and serves no purpose other than to stir up drama in this sub-reddit. And to be frank, this topic has been well discussed and the proverbial dead horse well and truly beaten.**\n\nDue to the above reasons, moving forward all female space marine posts (Specifically posts that reference female space marine, this does not include Femboy posts, transfem meme etc) **will be considered as Malicious trolling and removed as part of rule 7. Depending on the severity of the post the user can face a ban.**\n\n&#x200B;\n\n\\- Grimdank Mod Team.",
        "num_comments": 0,
        "comments": []
    },
    "When the Gellar field in the middle of training": {
        "title": "When the Gellar field in the middle of training",
        "score": 514,
        "url": "https://v.redd.it/71wk674l3g9d1",
        "content": "",
        "num_comments": 22,
        "comments": [
            "looks like I picked the wrong week to stop sniffin' glue",
            "...I needed some visual inspro for new fanfic. \n\nThank you, kind poster, for providing.",
            "Okay but imagine the orgies",
            "I screamed a little after the first clip, thought i was watching final destination.",
            "Yeah, watching the Olympics on Acid is wild.",
            "I don't feel so good, captain",
            "5 Dimensional life forms be like:",
            "\"Deamons doing gymnastics\" damn. We just got all our cgi done with a single prompt.",
            "You never stopped..\n\nAnd there is no toast.",
            "@werners_ai_art on instagram\n\nIt's in the bottom left corner in case I spelled it wrong"
        ]
    },
    "Some are luckier than others": {
        "title": "Some are luckier than others",
        "score": 2862,
        "url": "https://i.redd.it/bqfsu6s0dd9d1.jpeg",
        "content": "",
        "num_comments": 345,
        "comments": [
            "A moment of silence for all tomorrows fans",
            "Being happy with living in the Star Wars universe is highly dependent on WHEN in the Star Wars Universe. Because a lot of the time it sucks quite bad",
            "Wait, Stargate is literally just living in the late 90s to mid 2000s. It's not that bad. We could save Harambe and keep the world from falling apart. Am I missing something?",
            "I do not think that Star Wars is a good option.   \nWith bad luck you are in the middle of galactic war, or giverned by Sith regime, or nazi-like regime and some planets will blow up.",
            "Theres also Warframe, Gundam, BattleTech, and Three-Body Problem for the lower-right corner",
            "*Me who knows about the weakness of my flesh and is disgusted by it\n\nExcellent",
            "Meanwhile I'm living a quiet life in the Culture.",
            "Me who likes most of these: what the actual fuck",
            "I mean starship troopers isn't even thag bad compared to the rest",
            "Babylon 5 and Farscape fans: forgotten as usual"
        ]
    },
    "A Sixty-Seventh Meme": {
        "title": "A Sixty-Seventh Meme",
        "score": 2597,
        "url": "https://v.redd.it/hc68t8t5bd9d1",
        "content": "",
        "num_comments": 40,
        "comments": [
            "That's way too quick and painless to be Curze.",
            "The fuck is this from",
            "Must have been a mild offense.",
            "i think Konrad Curze would lose against her though",
            "not show: curze being eaten by 2 anime dragons",
            "I hate that this is the most funny thing I ever saw on this sub",
            "But but.... Both are dragons.",
            "its always disheartening when sick degenerates gain a creative outlet",
            "Man this is always a treat with how well animated it is",
            "\"You are anime girls! The sentence is Death!\" (Konrad Kurze, probably)"
        ]
    },
    "How about a taste of your own medicine ": {
        "title": "How about a taste of your own medicine ",
        "score": 568,
        "url": "https://i.redd.it/fr3l4ykacf9d1.jpeg",
        "content": "",
        "num_comments": 20,
        "comments": [
            "Just saw that short on YouTube,  spacemarines really were about to rage quit and then got spawn camped lol.",
            "Im pretty sure the tau even mocked the hecc out of the ultramarines during the process too.",
            "Does ObLotai have a sibling named Obloti?",
            "Got the chapter master leaning forward in his chair",
            "Just heard the audiobook. They were scarlords, not ultra marines. If it were ultramarins then they would somehow have made it",
            "The imperium is next level dumb sending the Scarlords, a chapter that from my understanding seems to be melee focused, against an enemy whose whole thing is shooting you super hard with big guns until you are reduced to hamburger meat.",
            "You sure? I swear I remember something about commander farsight mockinf cato himself",
            "Its like Imperium was handling its war efforts incompetently.",
            "It's the imperium. They didn't *send* space marines anywhere. Those Marines chose to answer the call, of their own accord, and got roflstomped for it. (Not even Lord Inquisitors can officially requisition space marines. They can \"politely request\" it, and the marines may choose to agree, for whatever reason. But they are still beholden to themselves.)\n\nAka: the marines, in their hubris, thought they couldn't lose.",
            "100% scarlords. Just finished that book today"
        ]
    }
}