{
    "Regarding Female Space Marine posts on Grimdank": {
        "title": "Regarding Female Space Marine posts on Grimdank",
        "score": 2118,
        "url": "https://www.reddit.com/r/Grimdank/comments/10w7usq/regarding_female_space_marine_posts_on_grimdank/",
        "content": "Grimdank has always and will be a sub for sharing of the dankest Warhammer, 40K, AOS and other tabletop memes, Jokes and other forms of media. The mod team strongly believes in the freedom of expression of all the voices that contribute and bring this wonderful hobby of ours together.\n\nHowever, there is a recent rise in drama-baiting using a specific topic of female space marines, which then in turn results in more flame wars and other drama.  **We believe that these posts contribute nothing (not even a laugh) and serves no purpose other than to stir up drama in this sub-reddit. And to be frank, this topic has been well discussed and the proverbial dead horse well and truly beaten.**\n\nDue to the above reasons, moving forward all female space marine posts (Specifically posts that reference female space marine, this does not include Femboy posts, transfem meme etc) **will be considered as Malicious trolling and removed as part of rule 7. Depending on the severity of the post the user can face a ban.**\n\n&#x200B;\n\n\\- Grimdank Mod Team.",
        "num_comments": 0,
        "comments": []
    },
    "people keep saying why don't we put the emperor in a dreadnought or hook him up to a titan. I say we hook him up to the main terra defence grid ": {
        "title": "people keep saying why don't we put the emperor in a dreadnought or hook him up to a titan. I say we hook him up to the main terra defence grid ",
        "score": 1245,
        "url": "https://www.reddit.com/gallery/1dlkmj2",
        "content": "",
        "num_comments": 69,
        "comments": [
            "What's the point of- \n\n(*Flips over to your second picture*) \n\nWell, here's my money.",
            "I’d crack a joke, but I’m not sure whether to compare Unicron to a C’tan or a Chaos God. He kind of fits both depending on the continuity.",
            "“Sir- we CANT move the Emperor off the throne.”\n\n“Then move the throne.”\n\n“Sir- we CANT move the thrown offworld.”\n\n“Then move the planet.”\n\n“Sir- we… huh… that might work.”",
            "But a bunch of rockets and warp drives on terra, loads of weapons and make big E control it. Space ship emps",
            "I fully support Big Empicron",
            "Then I already have a BIG E figure!\n\nhttps://preview.redd.it/wqwn52g2v18d1.jpeg?width=2280&format=pjpg&auto=webp&s=b730ff0f7114168d26b484b216789e2378ccbdde",
            "You will get a cease and desist from the necrons",
            "Why not do the 2nd thing and turn Terra into  phalanx 2.0 and he can go on a greater crusade and bring the fight to the eye of terror.",
            "https://www.reddit.com/r/ImaginaryWarhammer/comments/p0wbvk/based_on_a_4chan_joke_about_terra_being_actually/\n\nWe have thought of this before",
            "My brother/sister in Imperial glory, He is already hooked up to the GALACTIC defense grid. That's what the golden throne is. It amplifies His psychic power across the imperium and enables Him to assist when a human prays & acts in His name.\n\nI'm really not trying to be a dick here but if this post isn't a troll it's a massive fuckin woosh."
        ]
    },
    "But hey that just a Gaaaaaammmme Theory": {
        "title": "But hey that just a Gaaaaaammmme Theory",
        "score": 968,
        "url": "https://i.redd.it/t2w7kw03218d1.png",
        "content": "GW might be coming up with something ",
        "num_comments": 55,
        "comments": [
            "The updates to the Codex Astartes following Rowboat Girlyman’s resurrection allow for multiple captains in the same company in certain situations. \n\nAdditionally, the First Company is implied to have had a pretty rough time on Oghram, so it’s possible the captain deployed there was killed and replaced. \n\nIt’s also possible that Mr. Roboto Gorrillaman simply gave one of his captains terminator armor as a reward for good service. \n\nAll of this is pointless conjecture, however. The true answer is that he is Alpharius. (This is a lie.)",
            "There can be only one 1st Company captain, but other Captains may have had Terminator honours from induction into the 1st prior to becoming Captains - and so can still requisition the armour.  \nOr the Ultramarines have loads of spare suits since the 1st company are professional redshirts.  \nOne or the other.",
            "It’s the guy on the right obviously.\n\nGuilliman is blonde, Alpharius/Omegon are bald.\n\nIn the grim darkness of the 41st millennium, all bald guys are evil.",
            "If I’m not mistaken Captains of any company can have Terminator Armour/Honours.",
            "The guy on the right is left handed.",
            "My fourth company captain has termie armour so checkmate, “Alpharius”",
            "They’re the same dude.\n\nThey both have versions of Captain Agemman’s Red and white checkered heraldry.\n\nThey’re two versions of the same person.",
            "Other companies can have Terminator armor, it's just that it's highly unlikely those other companies will reach the heroic feats required to earn it.",
            "my head canon is that captains can wear whatever armor they feel like, regardless of company, i assume that all captains have the right to wear terminator armor, it would be a bit weird if they didn't.\n\nhowever there have been well more then 10 ultramarine captains depicted since the introduction of primaris marines: 10 currently available (uriel ventris, primaris capt, gravis capt, gravis capt with bolt rifle, capt with relic shield, jump capt, phobos capt, pushfit termie capt, termie capt, company heroes capt), 1 in a blind bag (space marine heroes series 4 capt), 1 no longer available (dark imperium gravis capt), and two promotional (2017 store anniversary capt, imperium magazine capt). \n\nmeaning there have been 14 captains of the ultramarines since the indomitus crusade. which it seems totally reasonable that the ultramarines would have lost 4 captains considering how many conflicts they participate in.",
            "\"Only first company can have terminator armor\" is not a rule on the codex astartes, nor anywhere else. It's just that a chapter barely have enough terminator armor to outfit their first company with them, if even that. But of course a captain of another company who wants one gets one, they are among the most honored and skilled warriors of the chapter."
        ]
    },
    "HIS COMING WAS FORETOLD": {
        "title": "HIS COMING WAS FORETOLD",
        "score": 2864,
        "url": "https://www.reddit.com/gallery/1dlb91s",
        "content": "",
        "num_comments": 57,
        "comments": [
            "LISAN AL-GAIB\n\n![gif](giphy|UJG2T7uZeJuZCLitY8)",
            "Somebody should make an inflatable Greater Unclean One punching bag",
            "Rejoice! Plague be upon ye!",
            "LETS GOOO. Instant buy and will be seated next to his brothers on the chair of chaos in my living room. (The cats chair they use as a perch)",
            "https://preview.redd.it/c8z2nurzvz7d1.jpeg?width=920&format=pjpg&auto=webp&s=9c3c2685c53e0b8c918a32f0652d85d93f84286d\n\nIf u wanna get pedantic Boltgun just straight up took his design from the one on the base of the Plague Marine Champion.",
            "Now let's do a Credo mini.",
            "now I never was intersted in plushies but I sure as hell getting this one",
            "I'd buy it just to throw and call Chaos Filth",
            "I am not ashamed to say I bought two of the last wave. Will definitely get this one too!",
            "When is he coming out"
        ]
    },
    "Turns out being neglected and forgotten has its perks.": {
        "title": "Turns out being neglected and forgotten has its perks.",
        "score": 3802,
        "url": "https://i.redd.it/56n28kow3y7d1.png",
        "content": "",
        "num_comments": 79,
        "comments": [
            "Oh, fr? How'd Drukhari get indirect buffs? I've only seen the point changes. I mean, I've seen the rules changes but I don't know how it'd affect them.",
            "Explain",
            "*WHAT , XENOS BEAT MARINES? NEERF THEM*",
            ">me having bought a drukhari army last week",
            "For clarification: \n\nOur vehicles all have bases so we can all pivot for free, getting some extra distance.\n\nArchon's Vect (the ability that increases command point cost) ability got replaced with a better version, meaning that its now a 12 inch aura and no longer requires him to be a Warlord, meaning multiple of them can cover a huge part of the field.\n\nHeroic Intervention is now 1 CP, which makes it dangerous to charge when Lelith is around.",
            "deets OP, give us the deets",
            "Come on give an explanation",
            "Blood Angels feel you bro.",
            "The coloration here made me think of Vivec long enough I got confused by the title",
            "I think this is exactly why Eldar armies as whole have a history of being overpowered. GW literally forgets about us and assigns their worst teams to create our rules, which results in undertuned abilities that interact with the rest of the game strangely."
        ]
    }
}