{
    "Weekly GTA6 FAQ and Wishlist Post": {
        "title": "Weekly GTA6 FAQ and Wishlist Post",
        "score": 8,
        "url": "https://www.reddit.com/r/GTA6/comments/1dhxigq/weekly_gta6_faq_and_wishlist_post/",
        "content": "# Welcome to our new weekly post for FAQ's and Wishlists that is replacing our monthly FAQ/Wishlist post. This post will refresh every Monday at 9am EST.\n\n&#x200B;\n\nSome examples of FAQ's are listed below, but this is only a small list of the repetitive questions/posts we're seeing:\n\n* **When is GTA6 being released**\n* **When do preorders start**\n* **When will the PC version be released**\n* **What hardware will I need to run the game on PC**\n* **Will we be able to...in the game**\n* **Will GTA6 have...in the game**\n* **How big will the game be**\n* **Speculation on who the voice actors will be**\n* **Will GTA6 Online have...**\n* **Will (any previous GTA character) be in GTA6**\n* **What music will be in GTA6**\n\n&#x200B;\n\n# Other useful resources:\n\n[**Official r/GTA6 Discord**](https://discord.gg/gta-vi)\n\n[**Official Trailer**](https://www.reddit.com/r/GTA6/comments/18ax6xd/official_gta_vi_trailer_video/)\n\n[**Trailer Analysis Documents**](https://www.reddit.com/r/GTA6/comments/18gn019/gta_vi_comprehensive_trailer_1_analysis/)\n\n[**r/GTA6 Rules**](https://www.reddit.com/r/GTA6/about/rules)\n\n&#x200B;\n\n# As far as what you want to see in the game, post those wishes in the comments below.",
        "num_comments": 20,
        "comments": [
            "It’s very minor, but new episode(s) of Republican Space Rangers.",
            "i want it to show your character enter your properties and not show a black screen and it cuts to you inside",
            "For Online: If they are going to have the exact same cut scenes play over and over, and it's over a minute long,  for the love of everything that's good,  please let us be able to skip them if we've already seen it,  thank you",
            "Story mode/single player mode DLCs.",
            "Jasmy Coin + GTA 6 = wen lambo🏎️",
            "As far as Story mode i hope we get a lot more robberies than v story mode. Now for online more broken down businesses as far as the drug businesses. For example when we first buy the business we start with small deals therefore as we level up so does our clientele. Our have our introduction to Leonida somewhat pay homage to vice city",
            "Why am I unable to make topics on here? I have ore that 5 karma and my account is more than a day old. I just mde a post and it got removed straight away, what the hell?",
            "Car livery customization similar as Forza horizon",
            "Please let there be a photomode day one, I know we’ll have a phone that we can take pictures with and that’ll be great, but I also really hope for a Photomode too.\n\nAlso I hope they change their photo saving method that they have in GTA V & RDR2 with it being saved inside a gallery in the game, and then having to upload it to the social club, then having to go onto the social club and downloading my images to my phone/laptop. Most games nowadays when taking images in photomode it automatically puts it in your consoles gallery, which I then can seamlessly transfer to my hard drive, then to my Laptop.",
            "Over the weekend I got the itch to play GTA5 online. But I was suddenly reminded why I dont play it that much. Tried to do the Cayo Perico heist and it froze on loading screens back to my sub three times. Finally I just exited out and played something else. Coming from playing a lot of MMO's I love the concept of GTA online and would play it a WHOLE LOT more if it wasn't so buggy and the menus were such garbage. I obviously played it a lot more when it was newer (2013-2017). But slowly stopped playing it regularly due to difficulty loading into sessions or trying to join a friends session then getting kicked.  I've still popped in for updated content here and there but its always the same. Start playing it, convince other gamer friends to join and eventually we all get frustrated with kicks, freezing loading screens or just game breaking bugs in general. I've always said I would be happy to pay a $5-$15 monthly fee if that meant R\\* would actually maintain their servers. I know a lot of people, especially in this type of game genre would absolutely scoff at the idea. But coming from MMO's where its either pay to win or has a monthly sub, I would have no issues with a monthly sub whatsoever. Again, given its less pay to win and the servers aren't complete dog s\\*\\*\\*. \n\nAlso did I mention the menu system in GTA5 online is also hot garbage? Game matching menus included. I hope they fix that too."
        ]
    },
    "Sad thing about gta 6": {
        "title": "Sad thing about gta 6",
        "score": 32,
        "url": "https://www.reddit.com/r/GTA6/comments/1dltu25/sad_thing_about_gta_6/",
        "content": "Remembered that some people will actually race through this once in a decade experience just so they can ruin the ending for everyone else. ",
        "num_comments": 30,
        "comments": [
            "One hour after the game launches: GTA 6 (VI) LUCIA KILLS JASON AND GIVES BIRTH TO THE DEVIL SAD SCENE 4K 1080P 60FPS",
            "Or rush through it to avoid having it ruined by someone else. Which is also shitty. I want to be able to take my time and enjoy the experience but I have legitimate concerns that it's going to be spoiled for me if I don't essentially speed run the game.",
            "People are also going to complain about every little thing that they think is missing.",
            "PC players have it even worse. I’m going to have to just shut this community out when it releases on console.",
            "Definitely. Just stay offline to avoid spoilers. It’s common practice for me if I haven’t finished a big trending game, tv show or movie \n\nTrolls are everywhere and the only way to beat them is to avoid them",
            "Or you can just not show up in any gaming communities that involve GTA 6. That way you can just play the game and finish until then?",
            "All rdr2 endings appeared the day after release, so yes",
            "Basically, a couple days before GTA 6 releases, I will leave this sub (or just not visit it) and not open YouTube until I complete the game. It worked for me with GTA V, I'm hoping it will with GTA 6.",
            "The last one most of us will play",
            "Take a week off from work. Stay at home. Stay offline. Don't talk to anyone."
        ]
    },
    "Online character creation will look spectacular.": {
        "title": "Online character creation will look spectacular.",
        "score": 488,
        "url": "https://i.redd.it/8pe4ns2x9z7d1.jpeg",
        "content": "I truly belive rockstar will deliver an insane character creator, one that is easy to use, yet massively diverse and allows everyone to create a truly unique and personalized look. \n\nGTA Onlines character creator was honestly awful. I mean you couldn’t even apply a proper beard to your character, and most faces I had seen in game honestly all shared resemblance. \n\nWith that being said, I cabt wait to see what this character creation will look like for 6, I truly believe that whatever it is rockstar will deliver. ",
        "num_comments": 136,
        "comments": [
            "Spoilers - It won't look anything like this. I expect it to be slightly better if not identical to RDRO.",
            "As long as that horrible “choose your parents” feature goes away I’m good.",
            "![gif](giphy|mPAfmTMIGPZsqACDPf|downsized)",
            "it won’t, I 100% sure you’ll need guide to not make an abomination (I hope not)",
            "I doubt it. It’ll be a minor improvement over RDR2’s creator but it’s not going to revolutionize anything. Their character creators have always been kept to the necessities with more focus on gameplay.",
            "If you are genuinly expecting Reallusion tier character creation tools INSIDE GTA 6 you're gonna be real dissapointed.",
            ">I truly belive rockstar will deliver an insane character creator \n\nFollowed by \n \n>GTA Onlines character creator was honestly awful \n\nBro why would you expect some generation defining character creator if you thought they were awful at it?",
            "Are you like 12?",
            "![gif](giphy|PjU0WtzRVbQUO4qe6v)",
            "Will it mate yeah"
        ]
    },
    "The homeless man that found the diamonds in GTA 4 was said to be going to Vice City to open a gun shop & liquor store according to the Liberty Tree. Be on the lookout for Jerry Kapowitz": {
        "title": "The homeless man that found the diamonds in GTA 4 was said to be going to Vice City to open a gun shop & liquor store according to the Liberty Tree. Be on the lookout for Jerry Kapowitz",
        "score": 273,
        "url": "https://i.redd.it/pktasu4rvz7d1.png",
        "content": "As long as they didn't forget about him, this would be cool to find his gun & liquor store",
        "num_comments": 35,
        "comments": [
            "Vietnam Veteran? He will be at least 70 in 2025",
            "Someone probally has to remind sa developer to make a refrence.  But I'm sure developers look at these reddits imo because imagine working on a game as a full time job as a 25-35 tech savy nerd. Not being curiose of what people kn twitter and reddit is probally not possible",
            "I bet there’s gonna be a gun store owned by him and they’ll use a pun on his surname “Kap-owitz” lol",
            "The gta universe is wild for all these mini spin-off moments. Honestly rabbit hole 🕳️ vhybes in the best way",
            "he will probably be for some missions like how Karen (Michelle) was in a heist for GTA online as well as the story mode",
            "I'm sure developers read these reddit lol. Their 25-35 year old tech savvy guys",
            "Sounds like someone stole some diamonds and hid them in the trash to collect them later and the trash got picked up earlier than expected.",
            "Has anyone taken the delay test on the game, saw it for the first time the other day. well funny",
            "Good find.",
            "It wouldn’t surprise me if they forget about this guy since he’s pretty much not that important"
        ]
    },
    "Since Jason and Lucia is a couple how do y’all see the strip club being used in GTA 6?": {
        "title": "Since Jason and Lucia is a couple how do y’all see the strip club being used in GTA 6?",
        "score": 1039,
        "url": "https://i.redd.it/wdrkko5jqx7d1.jpeg",
        "content": "I predict that we may not be able to fully used to strip club due to Jason and Lucia being in a relationship\n\nIn the game maybe we might if were to break up and be back together or some shit lol 😂 \n\nOr cheating with each other like Michael from GTA 5\n\nIdk 🤷🏾‍♀️ tbh I just can’t see both of them being in the strip club together unless they’re that kind of weird ass couple.\n\nI do think Lucia might be the type to be jealous if she sees Jason throwing money on a big booty chick \n\nEither way, I am going to look forward to see on how they’re going to use the strip club for GTA 6",
        "num_comments": 299,
        "comments": [
            "this might come as a surprise but sometimes characters in GTA games make morally questionable decisions",
            "Maybe you’ll get a phone call from Lucia if you been visiting too often. But I doubt there would be any serious consequence",
            "Micheal from GTA 5 was married (even if they weren't happy most the time they were) but he still can go do I doubt it'll prevent us from going",
            "They both are at strip club in the leaks for the missions. Why would they implement it and couldn't use it for some kind of \"morally right\"-reasons? It's a fucking GTA game which rounds on bad life habits.",
            "Have you heard that Lil Wayne song Mona Lisa",
            "I mean they're not glued at the hip. Hopefully you can have the other follow you whenever you want (holy shit, I've never thought about that before - that would be amazing), but its not like they're always going to be with you.\n\nBesides, this is GTA in Miami of all places. Monogamy and faithfulness is the last thing the game is going to try to uphold. This isn't Red Dead or the sims or something lol",
            "I bet the owner or some vip who hangs out there will have missions for you. Other than that, it's just a bar with titties. I don't really expect Lucia and Jason to directly interact much outside of missions, scripted events tied to missions, and dialogue cues, so maybe at the most they will make a comment about glitter on your clothes or the smell of stripper perfume or something.",
            "Theyll have male and female strippers, there we go.",
            "In gta iv, I’m sure you could take some girlfriend out to strip clubs on dates. I guess it’d work the same.",
            "> I do think Lucia might be the type to be jealous \n\nDude the game won't be out for another year how are you making conclusions on their personalities?"
        ]
    }
}