{
    "Weekly Bonuses, FAQ, and Important GTA News - Please Look Here First": {
        "title": "Weekly Bonuses, FAQ, and Important GTA News - Please Look Here First",
        "score": 42,
        "url": "https://www.reddit.com/r/gtaonline/comments/1djmhg6/weekly_bonuses_faq_and_important_gta_news_please/",
        "content": "The Community Hub we were trying out really wasn't working as well as we had hoped, but we loved the idea of a hub where we can post links to all of the important posts that keep this community informed.\n\nSo going forward we will be consolidating links to all of our normal weekly posts and GTA Online news into this one permanent sticky. This will allow us to be able to use the only other sticky post we have available for important announcements.\n\n[**Updated Subreddit Rules - Please Read**](https://reddit.com/r/gtaonline/comments/1djppu8/subreddit_rules_revised/)\n\n&#x200B;\n\n**Important News**\n\n# [Casino Heist and Arcade Purchases have been disabled on PC due to a dangerous exploit](https://reddit.com/r/gtaonline/comments/1df5hon/casino_heist_disabled_and_new_exploit_on_pc/)\n\n# GTA V/GTA Online has been removed from PS+. You will have to purchase the game to continue playing. (no link)\n\n# Bottom Dollar Bounties DLC to be released on June 25th (see DLC Related Links section below)\n\n&#x200B;\n\n**Weekly Posts**\n\n# [Weekly Bonuses and Discounts](https://reddit.com/r/gtaonline/comments/1djrpgy/weekly_discounts_and_bonuses_june_20th_to_june/) June 20th to June 25th\n\n&#x200B;\n\n# [Simple Question/FAQ Thread](https://reddit.com/r/gtaonline/comments/1djrsbz/simple_question_and_faq_thread/)\n\n&#x200B;\n\n# [Common Bugs and Solutions Thread](https://reddit.com/r/gtaonline/comments/1cy64u2/common_bugs_and_simple_bug_questions_thread/)\n\n&#x200B;\n\n**DLC Related Links**\n\n# [Bottom Dollar Bounties DLC Trailer and Discussion Post](https://reddit.com/r/gtaonline/comments/1dirj5r/bottom_dollar_bounties_dlc_coming_june_25th/)\n\n&#x200B;\n\n**Bottom Dollar Bounties DLC Hype Thread (coming soon)**\n\n&#x200B;\n\n**Bottom Dollar Bounties DLC Launch Day Megathread (Coming June 25th)**",
        "num_comments": 1,
        "comments": [
            "Comments are locked as this is only meant to be a place for links, but if you have any feedback about the hub please send it to [**modmail**](https://new.reddit.com/message/compose?to=/r/gtaonline)."
        ]
    },
    "DLC Release Day Information for r/GTAOnline and Exclusive User Flair": {
        "title": "DLC Release Day Information for r/GTAOnline and Exclusive User Flair",
        "score": 41,
        "url": "https://www.reddit.com/r/gtaonline/comments/1dlb6yj/dlc_release_day_information_for_rgtaonline_and/",
        "content": "Once again we find ourselves with an inbound update for GTA Online, the Bottom Dollar Bounties DLC. For new people who plan on checking in here on DLC day I want to go over how we usually handle those busy first few hours and general posting requirements on that day.\n\n&#x200B;\n\n1. About 30 minutes or so before the DLC releases (\\~4AM EDT) we will lock down the sub. What this means is that we will be filtering posts to help control the flood of posts we normally get in the opening hours so a ton of repetitive stuff and \"Is the dlc out yet?\" posts don't takeover the timeline.\n2. When the DLC releases will will post a Megathread and will be directing most repetitive posts to it. We will work to approve posts as quickly as possible with the first posts on specific DLC discussions being approved. The Megathread will be updated with information as it becomes available, like what platforms the update has been released to already and other information on what we got on launch day.\n3. **SPOILER TAGS MUST BE USED** on all posts discussing missions, characters, and especially plot points for the first 24 hours. Any posts without spoiler tags that contain any of the above listed content may be removed. \n4. **Dripfeed content that gets datamined MUST HAVE A SPOILER TAG** or the post will be removed.\n\nOne more thing, we will be offering a limited time flair for people who come by the sub on DLC release Day (June 25th). \n\n[Limited Time Flair](https://preview.redd.it/amqnalskvy7d1.png?width=768&format=png&auto=webp&s=18d31fd4696a0a6e84b97ae511d9a863236e733f)\n\n**To get the flair you will need to do the following:**\n\n* Go to the DLC Megathread we will have pinned on June 25th at 5AM EDT\n* Go to the pinned comment on that post that will also have these instructions\n* Reply to that pinned comment with **#bountyhunter**\n* You'll get an automod PM telling you the flair has been changed\n* Refresh the page to see the flair applied\n\nThis flair will only be available to claim for 24 hours after the DLC is released, so it will end at about 5AM EDT on June 26th. After which the flair will no longer be available to get. \n\n**PLEASE NOTE:**\n\n**If you decide later to change the flair you will not be able to get the Bounty Hunter flair back.** \n\n&#x200B;\n\nPlease check our pinned [Community Link Hub](https://www.reddit.com/r/gtaonline/about/sticky) for links to the most current DLC information.\n\n&#x200B;",
        "num_comments": 13,
        "comments": [
            "Aha, good to know.",
            "Thats cool",
            "Wohoo!",
            "Good To Know!",
            "RemindMe! 3 days \"unlock limited time flair\"",
            "[deleted]",
            "RemindMe! 3 days \"unlock limited time flair\"",
            "[removed]",
            "I will be messaging you in 3 days on [**2024-06-25 06:50:26 UTC**](http://www.wolframalpha.com/input/?i=2024-06-25%2006:50:26%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/gtaonline/comments/1dlb6yj/dlc_release_day_information_for_rgtaonline_and/l9qcgwh/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fgtaonline%2Fcomments%2F1dlb6yj%2Fdlc_release_day_information_for_rgtaonline_and%2Fl9qcgwh%2F%5D%0A%0ARemindMe%21%202024-06-25%2006%3A50%3A26%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201dlb6yj)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
            "[**Today's Gun Van Location**](https://gtaweb.eu/gtao-map/ls/2)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gtaonline) if you have any questions or concerns.*"
        ]
    },
    "'Allright now that's fini- what the f*ck?'": {
        "title": "'Allright now that's fini- what the f*ck?'",
        "score": 71,
        "url": "https://v.redd.it/ht10bppup38d1",
        "content": "First time ever encountering this?",
        "num_comments": 20,
        "comments": [
            "I've had an NPC in there once, they survived 3 grenades quietly eating pizza.\n\nA few others have also mentioned it.",
            "He’s just enjoying his pizza. Let him eat in peace",
            "I’d take out the witnesses",
            "He's right, come on now, let's take a chill!",
            "Wait what",
            "POV me: boots through door, Pulls RPG from my ass and let’s rip.",
            "I always use the grenade launcher to shoot a grenade into the room which usually takes everyone (or nearly everyone) out in one shot, so hard to say if I’ve ever encountered this. \n\nI have seen others post similar clips though. \n\nI gave a feeling that NPC is going to two-star review that pizza place bc of you now though 😂😂",
            "Must be the junkie.",
            "Guy was just wailing for his order to be loaded on the truck.",
            "bro just wanted to enjoy his pizza"
        ]
    },
    "This guy killed us so we trolled him a little": {
        "title": "This guy killed us so we trolled him a little",
        "score": 388,
        "url": "https://i.redd.it/id63ubim908d1.jpeg",
        "content": "",
        "num_comments": 41,
        "comments": [
            "Doing this in the masks and dark clothes really sells it. Y’all even dressed for it lmao.",
            "“A little”",
            "Trolling a troll is always fun. 😂",
            "Locking people in clothing stores / tattoo shops / AmmuNation is one of my favorite past times. 😍",
            "Trolling >>>> Griefing\n\n![gif](giphy|yJFeycRK2DB4c|downsized)",
            "*\"You see what happens, Larry? This is what happens when you fuck a stranger in the ass!\"*",
            "Damn that’s cruel but why didn’t he just return the car",
            "Classic",
            "Woulda been so much better if you poured gasoline on it then lit it and ran",
            "zooming in on him made me laugh. Good work guys"
        ]
    },
    "can we agree this car IS GARBAGE": {
        "title": "can we agree this car IS GARBAGE",
        "score": 1354,
        "url": "https://i.redd.it/ggkxl9w3wx7d1.jpeg",
        "content": "",
        "num_comments": 318,
        "comments": [
            "It’s a giant luxury barge, what did you expect?",
            "Do you think a rear wheel drive V12 landboat would be easy to drive?",
            "I actually love the car it’s based on, the rolls royce phantom ",
            "Fucking massive skill issue\n\nRule 1 to be a good driver is adaptability \n\n\nA fucking luxury saloon can not be driven like a high downforce car",
            "No. Not everything is a top tier supercar. This car has a different purpose that it fulfills nicely. Not a bad car at all.",
            "Just like an actual Rolls Royce, heavy boats with a bit of power to put down.",
            "Nope still one my good cars, not the greatest but it is a Drift tank",
            "I think it's pretty alright, even good, if you consider what kind of car it represents. You might just not be an adaptive driver.",
            "I dig it,just bought it last night",
            "OP farming downvotes to die on this hill"
        ]
    }
}