{
    "Weekly Bonuses, FAQ, and Important GTA News - Please Look Here First": {
        "title": "Weekly Bonuses, FAQ, and Important GTA News - Please Look Here First",
        "score": 72,
        "url": "https://www.reddit.com/r/gtaonline/comments/1djmhg6/weekly_bonuses_faq_and_important_gta_news_please/",
        "content": "The Community Hub we were trying out really wasn't working as well as we had hoped, but we loved the idea of a hub where we can post links to all of the important posts that keep this community informed.\n\nSo going forward we will be consolidating links to all of our normal weekly posts and GTA Online news into this one permanent sticky. This will allow us to be able to use the only other sticky post we have available for important announcements.\n\n[**Updated Subreddit Rules - Please Read**](https://reddit.com/r/gtaonline/comments/1djppu8/subreddit_rules_revised/)\n\n&#x200B;\n\n**Important News**\n\n[~~Casino Heist and Arcade Purchases have been disabled on PC due to a dangerous exploit~~](https://reddit.com/r/gtaonline/comments/1df5hon/casino_heist_disabled_and_new_exploit_on_pc/) **Patched on June 25th**\n\n# GTA V/GTA Online has been removed from PS+. You will have to purchase the game to continue playing. (no link)\n\n&#x200B;\n\n**Weekly Posts**\n\n# [Weekly Bonuses and Discounts](https://reddit.com/r/gtaonline/comments/1do36ax/weekly_discounts_and_bonuses_june_25th_to_july/) June 25th to July 3rd\n\n&#x200B;\n\n# [Simple Question/FAQ Thread](https://reddit.com/r/gtaonline/comments/1djrsbz/simple_question_and_faq_thread/)\n\n&#x200B;\n\n# [Common Bugs and Solutions Thread](https://reddit.com/r/gtaonline/comments/1cy64u2/common_bugs_and_simple_bug_questions_thread/)\n\n&#x200B;\n\n**Bottom Dollar Bounties DLC Related Links**\n\n# [Launch Day Megathread](https://reddit.com/r/gtaonline/comments/1do1gnu/bottom_dollar_bounties_dlc_release_day_megathread/)\n\n&#x200B;\n\n# [Full DLC Guide and FAQ](https://reddit.com/r/gtaonline/comments/1do55kw/bottom_dollar_bounties_full_guide_and_faq_thread/)\n\n&#x200B;\n\n# [Patch Notes](https://reddit.com/r/gtaonline/comments/1do6jq2/full_patch_notes_for_the_bottom_dollar_bounties/)\n\n&#x200B;\n\n# [DLC Bug Reporting Thread](https://reddit.com/r/gtaonline/comments/1do12nm/bottom_dollar_bounties_dlc_bug_reporting_thread/)\n\n&#x200B;\n\n# [Trailer and Discussion Post](https://reddit.com/r/gtaonline/comments/1dirj5r/bottom_dollar_bounties_dlc_coming_june_25th/)\n\n&#x200B;\n\n# [Release Day Information - Please Read](https://reddit.com/r/gtaonline/comments/1dlb6yj/dlc_release_day_information_for_rgtaonline_and/)\n\n&#x200B;\n\n# ",
        "num_comments": 1,
        "comments": [
            "Comments are locked as this is only meant to be a place for links, but if you have any feedback about the hub please send it to [**modmail**](https://new.reddit.com/message/compose?to=/r/gtaonline)."
        ]
    },
    "Worst part of the whole DLC": {
        "title": "Worst part of the whole DLC",
        "score": 1007,
        "url": "https://i.redd.it/twe4keik2f9d1.jpeg",
        "content": "",
        "num_comments": 133,
        "comments": [
            "I wanted running boards. They only had walking boards.",
            "I was just happy that you dont have to use it the whole time. Once you nab the target it just appears",
            "Useless damn sidesteps, they should just remove them, capacity of 4 is enough. I think the Police Transporter has bulletresistant windows, that wouldve been nice too.",
            "Love how for any business in the game youre always given the slowest damn vehicle to do your missions. Anything to slow down the grind",
            "![gif](giphy|qcbvrRRaQQYhDv3mrj|downsized)\n\nMe when I hit anything with those steps",
            "It's not even the van. It's the fact you drive all the way across the map to kill 75 NPCs and capture one then you have to deal with endless ones chasing you all the way back. And all for 129,000.",
            "Worst part about the van for me is it feels so light. Has no ram power, even with the armor. They hit me and it feels like I go flying.",
            "Honestly, I wish I could put them into the back of a police cruiser or any police car.  Instead of the van.",
            "Just wanna say mother FUCK whoever decided to make that not removable",
            "If an npc just touches the side while driving, you spin"
        ]
    },
    "What's Your Favourite House In Gta Online?": {
        "title": "What's Your Favourite House In Gta Online?",
        "score": 391,
        "url": "https://i.redd.it/vutgeydptf9d1.jpeg",
        "content": "",
        "num_comments": 156,
        "comments": [
            "3655 wild oats drive, prettiest latin style home only downside is the garage doesn't connect but atleast Franklin lives like 2 houses down",
            "i like this one its in the paleto bay far from los sentos and all its chaos, in the peace!",
            "From the available ones; the Eclipse Penthouses have the nicest interior, but 4 Hangman Ave absolutely has a perfect plot of land. \n\nAs for unavailable ones, theres a McMansion at 2112 Mad Wayne Thunder Dr that I absolutely adore, and would love to own, even if it cost like $20 million. That or one of those houses in Mirror Park.",
            "I own four houses in GTAO, the blue one in Paleto Bay, the trailer in Sandy Shores, the white house in Murrieta Heights and the regular one on Hangmans Ave in Vinewood. \n\nThey all have their use and charm but I like the last one the best I think. The interior isnt the best, but it has a really nice exterior, a pool (with topless visitors) and a garage with 80s italian sports cars.",
            "Weazel Plaza Apt. 101 will always be where I hang my hat.",
            "I thought I was the only one who liked this house. This is my getaway house, I use it when I need time away from the city and griefers and the garage is filled with off road vehicles.",
            "4 hangman avenue, mid end home with an excellent view over LS and the only house I know of that has a backyard pool",
            "While I didn't buy this one, I bought 2 other houses close to this one. Paleto Bay is my favourite in-game place now.",
            "I love everything in Paleto Bay, but 1115 Blvd Del Perro will always have a special place in my heart for being my first ever apartment:)",
            "Available to own? 4 Hangman Ave. Favorite static? The one up in the hills with a working garage or the other house in Tongva Hills"
        ]
    },
    "The fact a $15,000 bike can compete with a $2,480,500 bike is fascinating to me": {
        "title": "The fact a $15,000 bike can compete with a $2,480,500 bike is fascinating to me",
        "score": 3291,
        "url": "https://www.reddit.com/gallery/1dqmteu",
        "content": "",
        "num_comments": 330,
        "comments": [
            "I remember GTAO day 1 and thinking wow the vehicle prices are actually very similar to real life. How quickly that changed",
            "No body underestimates the legendary BATI",
            "I fucking love the Bati 801, I hope it stays competitive",
            "Hush, don't remind R*. They'll remove it and add it back later for millions.",
            "I lost to the Lamborghini Urus in a McLaren P1. In the game. Both maxed upgrades.. Lamborghini SUV is 1 of the fastest cars in the game",
            "I aways read the name as Bati Boi, still cracks me up lol",
            "This is an accurate representation that expensive things are not always the best",
            "I'm gonna be honest, I love the Shinobi so much. Probably one of my favorite vehicles in the game. I don't even care that its 2.48 million and gets beat by way cheaper bikes.\n\nThen again, this is an issue with pretty much every car/bike that Rockstar adds into the game. The new cars added in recent years are all way more expensive than the original cars that have been in the game. But yet, their performance isn't that huge of an improvement. Just goes to show how fucked the economy has gotten.",
            "I prefer the shinobi due to better handling and it just feeling \"sharper\" to drive but other than that it's really not worth it compared to the bati",
            "the Bati is WAYYY too good lol, 15k for a BEAST "
        ]
    },
    "Rockstar giving me subtle hints that it hates I don't buy Shark Cards": {
        "title": "Rockstar giving me subtle hints that it hates I don't buy Shark Cards",
        "score": 80,
        "url": "https://i.redd.it/mv4rps4hph9d1.png",
        "content": "",
        "num_comments": 7,
        "comments": [
            "It's more like :\n\nF - U - R\\*",
            "Been playing gta for 8+ years never even touched the store that sells the bullshark cards",
            "It's just Felix ungar",
            "Lmao ",
            "R - Y",
            "please dont",
            "furry"
        ]
    }
}