{
    "Weekly /r/GuildWars2 Question Thread - June 22, 2024": {
        "title": "Weekly /r/GuildWars2 Question Thread - June 22, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/Guildwars2/comments/1dlv579/weekly_rguildwars2_question_thread_june_22_2024/",
        "content": "This thread is dedicated to questions that you've never really felt the need to start a thread for, but would still like to see answered/discussed.\n\nResources:\n\n* [Old Weekly Questions posts](/r/Guildwars2/search?q=title%3A%22question+thread%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=week)\n\n* [The Official Guild Wars 2 Wiki](https://wiki.guildwars2.com/wiki/Main_Page)\n\n* [Subreddit new players guide](/r/Guildwars2/wiki/newplayers)\n\n* [Subreddit returning players guide](/r/Guildwars2/wiki/returningplayers)\n\nPlease also consider sorting the comments in this thread by \"new\" so that the newest comments are at the top, since those are most likely to still need answers.\n\n\n#Join the Guild Wars 2 Discord\n\nhttps://discord.gg/guildwars2",
        "num_comments": 0,
        "comments": []
    },
    "FINE, Elementalist's Spear skills": {
        "title": "FINE, Elementalist's Spear skills",
        "score": 177,
        "url": "https://i.redd.it/zyg9s8f7438d1.png",
        "content": "",
        "num_comments": 51,
        "comments": [
            "Ele spear is truly a haboob tier gaming",
            "So far, i'm a big fan of the new weapons having their own mechanics. If only they could go back and add some to the original ones.",
            "YOU SAID YOU WON'T DO IT. NOW I DID IT AS WELL (thanks buddy)",
            "gotta say i'm really impressed with the elementalist spear, really cool feel and visuals",
            "thanks for uploading all of these!",
            "Fire auto: 1 target\n\nWater auto: 1 target\n\nAir auto: 🤷‍♀️\n\nEarth auto: 🤔",
            "Finally 1200 range, yes eles they listened! \nSpells sounds fun, caint wait to try it out.",
            "I DID NOT DO ALL THE FLIPPED ETCHING SKILLS CUZ I CANT FIND ALL OF THEM AND MY OCD WONT ALLOW ME TO PLACE SOME OF THEM ONLY.\n\nEDIT: [GO HERE FOR ETCHING SKILLS](https://www.reddit.com/r/Guildwars2/comments/1dlr6xy/elementalist_spear_overview/) thank you /u/CROWdelusion",
            "Yknow I might actually finally like weaver with this weapon. I didn't get to see the weaver skills for spear until now and that attunement refreshment is kind of *fresh*",
            "I like how all the cds are same by key (all 5s same cd) for probably the first time but ele changes weapon cd based on attunement trait, so it means nothing."
        ]
    },
    "Fine, I will start. Here's Revenant's spear skills screenshot": {
        "title": "Fine, I will start. Here's Revenant's spear skills screenshot",
        "score": 133,
        "url": "https://i.redd.it/7ia1t1o4928d1.png",
        "content": "",
        "num_comments": 25,
        "comments": [
            "I DID MY PART NOW YOU DO YOURS",
            "Those cast times are *abbys(m)al*",
            "So...\n\n3x Abyssal Raze for 3 x 10 = 30 energy.  \n1x Abyssal force to reset = 5 energy.  \nAnother Abyssal Raze = 10 energy.\n\nSo at this point I have 45 energy spent just on weapon skills.  \nNow assume I get some of it back through natural energy regeneration, that means either Abyssal Blot (if running Abyssal Chill for this) or a Utility not overly expensive. That is 4x Abyssal Raze. Versus a single target not enough to trigger Crushing's secondary effect to trigger another Raze upon weaponswapping (which would have to be paired with legendswap anway it seems, as you are at such low energy at this point you can't do shit).\n\n\nThat feels like quite an energy-hungry weapon that leaves little room for Renegade Legends or Mallyx shenanigans.  \n\nI take it you will pretty HAVE to run the trait that gives additional energy when legendswapping below X amount of energy with this.\n\nAlso wondering how this will stack up vs the condi options Rev already has. It does not seem to beat Shortbow, so can it beat Mace/Axe? It it doesn't, it is mainly a flavour weapon. It it does, Mace/Axe suddenly has no niche anymore.\n\nAnd with just torment, I feel it could use a cover condition of sorts (as well as some speed-buffs, it looked quite slow).\n\nI will 100% keep an open mind until I test this, but I see some bumps on the road ahead.",
            "The tempest killer",
            "abyssal raze should be 5 energy cost cause it's something you gonna spam in the rotation, the berzerk dmg looks good so maybe can be a replacement of bow for vindicator second weapon. This weapon having more cc than the bow with mines + pull.. 600 range should be for the dash and 900 range should be the average range of this weapon.\n\n(edit : i said all of this for pve, i'm not a pvp/wvw player)",
            "That spear 4 is a pull, so it's gonna be doing a total of 0 damage in competitive in addition to doing 0 damage from not hitting all your slow ass skills.\n\nBravo Anet, bravo. You finally implemented unarmed combat in the game.",
            "I like the look of revenant honestly the only issue it looks slow hopefully before launch they speed up the animations on it.",
            "Hopefully it can replace  mace and axe, so i can just go fully ranged.",
            "For a supposed \"condition-based weapon\", that's a really shitty amount of condis.",
            "Im sad about the revenant spear. I love playing herald and vindicator with its weapons, but i was very disappointed with the scepter. The scepter is so useless and im afraid that, if they keep the spear as it is now, that it will be useless too…. But we gotta see it in the beta first so we can give our feedback and hope they can change some things up…"
        ]
    },
    "Warrior's Spear skills": {
        "title": "Warrior's Spear skills",
        "score": 87,
        "url": "https://i.redd.it/7jt1crbxw28d1.png",
        "content": "",
        "num_comments": 14,
        "comments": [
            "I was afraid the spear will be a ranged weapon that will do more damage up close, which would be kinda stupid, but range from target only seems to effect aoe effect of some abilities, not the main target damage, which is actually a cool mechanic",
            "You're an actual saint for this",
            "Very straightforward weapon designwise.  \nMaybe not what warriors hoped for, but that is somewhat consistent with how Anet designs warrior weapons.\n\nNow it is obviously a power weapon.  \nFlavourwise I suppose is a matter of taste, but where is this weapon going to land?\n\nBladesworn is married to off-hand pistol and cannot use the burst (where a big part of the power budget sits) that one is out.\n\nI don't think this can compete damage or cc-wise with the Spellbreaker Hammer+Dagger/Axe kit, so that one is also 90% sure to be out.\n\nThat leaves Power Berserker.  \nOnce again, it won't beat Axe/Axe, so the question remains is if it is more powerful than Greatsword.\n\nIf it is, then Greatsword has now officially no purpose left in any PvE setup whatsoever. If it isn't, Spear has no real PvE usecase and will most likely end up as a PvP weapon if it can thrive there.\n\nAnd considering its range components, Spear will also push out whatever usage is left for Rifle, making that weapon absolete as well (aside from maybe WvW Gunflame memes).\n\nFor PvE I also see a design-flaw in Spear Swipe that we also saw back when Ele Catalyst got revealed, where the spec wanted to be in melee but its air CC skill catapulted the ele backwards.  \nThis warrior skill does the same. It wants to be in melee, but with this skill catapults itself back and also pushes foes away from it.\n\nSo warrior either gets a very straightforward (meaning it will get old relatively quick in terms of 'new gameplay excitement') niche weapon for Power Berserker only, or it gets something that is somewhat meh aside from flavour.\n\nFeel free to correct me if you do not share this view, but I am a bit worried.",
            "I know everyone is assessing this from a “where does it fit in the meta” PoV; but I really like these from an open world perspective. Being at range doesn’t feel punishing, especially for single target; but you do feel rewarded for being in melee. Because of that, rifle could eventually find a niche as ranged aoe; and you can continue attacking even when you have to retreat, and let your passive heals top you off. \n\nI know it’s hard to not assess it from a meta perspective, but flavor-wise, this is exactly what I want from warrior.",
            "It definitely feels like _something's_ missing for Warrior Spear - it feels a bit bland with no ''uniqueness'', no special mechanics\n\n&nbsp;\n\nIt'd be interesting to see a special, stacking bonus for **every consecutive hit** that resets once a hit is missed/blinded/evaded, etc\n\nJust a little thing to add some interesting mechanic - the effect would increase **power** & **ferocity** per stack _(max 10)_, complementing the Power-based nature of the Spear. Stacks could also lead to increased adrenaline generation?\n\n&nbsp;\n\nI just feel it is missing _something_ to mix up gameplay",
            "The only place i can see it being played is on Berserker. But only if it is better DPS than GS.\n\nYou probably could make a somewhat decent OW build with it. But i have 3 amazing OW builds already and none of them would play Spear.\n\nI genualy dont see a use case right now.",
            "Sorry but this weapon design makes no goddamn sense.\n\n\\-A ranged weapon that is geared towards... close-quarters???\n\n\\-Skill 2 radius is pathetic, pitiful ranged, horrible for melee\n\n\\-Skill 4 is for... interruption. Has an abyssmal cast time---for a supposed quick attack... What?\n\n\\-Skill 5 is a massive nerf flag, calling it now.\n\n\\-900 range. Basically a two handed pistol\n\nHonestly, what was the goal of this weapon again? A ranged weapon with barely any ranged viability. Should have just been a melee weapon. Honestly what the actual hell is even going on with this?",
            "Would have been better to put everything into one thread. But hey, more Karma this way.",
            "I'm in the opposite camp. I dislike when the weapons become too gimmicky, especially since that layers on top of elite spec mechanics. Thief Axe is the worst offender in that regard, considering that only Deadeye can wield it reasonably well and thus has to juggle Initiative, Malice and Axe count simultaneously.\n\nThe only thing I'm somewhat disappointed in is that the role of Spear will be once again nothing but raw power DPS *(overlapping with Rifle for the 'range' niche, outright overshadowing it)*. If it had some non-standard boon share or special utility on one or two of its attacks, it could have made offensive support roles *(qDPS Berserker and aDPS Bladesworn)* at least a bit more interesting.",
            "> Would have been better to put everything into one thread\n\n* Better flow and relevancy for conversation. The conversations are limited to the profession, rather than a megathread, so it stays relevant to the single skillset\n* OP also evidently went through the process manually and one at a time so it is also understandable they are their own seperate threads, submitted at intervals _(as OP was screenshotting and such)_\n* Feedback threads have always been **per profession** rather than unique megathread so it is not out of the ordinary - it has also been this trend whenever there were Twitch Previews"
        ]
    },
    "Guardian's Spear skills": {
        "title": "Guardian's Spear skills",
        "score": 92,
        "url": "https://i.redd.it/za6ku51kr28d1.png",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Healing on a non-mace auto is nice, albeit I don't think Guard really needed more healing in its support builds personally (it already has S tier values imho).\n\nHealing increase on skill 2 at first glance does not really seem worth illuminating for, so it will come down on how bad you want to give out Resolution.\n\nskill 3 seems somewhat worth Illuminating for the fury, which should be permanent upkeep under alacrity and even easier with a bit of boonduration. I seem to remember that the fury was one of the reasons for Healbrand to run their Axe, so maybe it can compete with that slot (albeit you lose some off-hand goods in the process).\n\nNoticable condi clear on 4, not sure if it scales with shards or is a fixed value. If the condi removal scales with shards that's pretty huge.\n\nSkill 5 will heal with symbol trait and illuminates your entire kit, could be used as either a way to do a 'support burst' or simply something you throw down at the start of your Spear uses anyway.\n\nSeems like something you'd take for extremely heavy condi fights or fights with massive boon corrupts as a main niche. Will have to test to see how it really fares ofcourse and if bringing it is better than guard's normal goods in terms of weapon boons (prot/might/fury/regen/aegis).",
            "Keep em coming sir, I'm waiting patiently for warrior and elementalist",
            "so lootstick is back with this yeah?",
            "I'll wait till the beta test next week to make any judgements....but I personally don't think guardian needed another support weapon....even in hybrid form\n\nAt least loot stick for ToT bag farming is back...ish",
            "We'll see how the coefficients turn out, but to me, this seems a bit underwhelming. \n\nIt's too little healing for PvE and probably too little utility for small scale PvP. \n\nHowever, with a lot of condi cleanse, cleave and almost perma resistance, I could see this beeing used by WvW zerg guardians. Maybe this is where it is targeted anyways..",
            "Now all I need is a pair of angel wings and I can be the Valkyrie I've always wanted to be.",
            "As a Guardian main since release I have to say I am excited about spear. It looks way better than pistols which turned out to be all damage and no utility. \n\n**Daybreaking Slash**\n\n1. It can hit 3 allies and 3 enemies so 6 targets in total. \n\n2. It's great in WvW, good in PvP and decent in PvE if you slot in Permeating Wrath. \n\n3. Also 350 range is what Guardian was lacking. In competitive modes it will allow to keep the pressure while being off node.\n\n**Helio Rush**\n\n1. Movement skills are something that only Willbender had easy access to and it was its major strength. It is also something that Firebrand desperately needs to be more competitive. \n\n2. Illuminated version seems weak. I think it should make the dash longer distance. Using it twice in a row could let us travel 600 units with the first use and then 900 units with second. \n\n**Gleaming Disc**\n\n1. That's a really interesting skills. We have to get up close to get the initial hit. The shockwave though is more forgiving as it has higher radius. \n\n2. A lot of boons can be applied with a proper positioning. But it all relies on allies and enemies being tightly packed together as the radius is only 300. It will work well as a self sustain if you pick Altruistic healing.\n\n3. It is a whirl combo finisher. Which means additional condition cleanse for most elite specs. Firebrand can play with it more as depending on which tome we use it with it can also apply burning or healing.\n\n4. Overall it feels like a more offensive rework of staff #4. It applies half the might but does a lot of damage, blinds and most importantly doesn't lock us in place. \n\n5. I think its illuminated version is also weak.\n\n**Solar Storm**\n\n1. It is an amazing skill. It's great to initiate the fight with.\n\n2. Condition cleanse doesn't fit this skill. I would rather have this effect swapped with the previous skill - Gleaming Disc. As I said this skill is great for initiating combat so it would be better if it granted us and our allies might and fury and for Gleaming Disc to cleanse conditions.\n\n3. Illuminated version is actually good. I quite like the condition we have to fulfill for the next attack to be illuminated. It works well with the theme of Guardian's spear to constantly keep enemies and allies in close range but not full on melee.\n\n4. It has a lot of synergy with disabling effects: cripple, immobilize, chill, slow, wards. Interestingly Dragonhunter can utilize it greatly with Hunter's Ward, Dragon's Maw and Soaring Devastation or even when using Solar Storm on ourselves and pulling the enemy in with the Spear of Justice. \n\n**Symbol of Luminance**\n\n1. It is weakness overload and I love it. It allows Guardians to counter bursts of power damage coming from close range. It is also weakness which will be constantly reapplied. \n\n2. It's good even without using Writ of Persistence. I think the symbol's radius is more important than its duration. Slotting in Writ of Persistance will allow Guardians and especially Firebrands to negate power damage not only from close range but also from mid range.\n\n3. It's a knockback that can interrupt but doesn't push the enemies off the symbol.\n\n4. It can have a lot of synergy with Glacial Heart, Weighty Terms, Stoic Demeanor, Mantra of Truth. A build which buffs allies by blinding, chilling, immobilizing, weakening etc. enemies can be interesing. But also it is easily countered by condition builds.\n\n5. As for the illuminated version. I have mixed feelings. On the one hand it kinda breaks the idea of chaining skills to empower them. On the other it enables spear on non-stationary Guardian elite specs - Willbender. And it also requires you to have it illuminated first. The value of the illuminated Symbol of Luminance will vary greatly on the elite spec used.\n\n**Summary**\n\nIn short I look forward to Guardian's spear. I can see it being used more in competitive game modes. But depending on the damage scaling it may have a place in endgame PvE as well. \n\nAfter looking at all of the spear skills I can see similarities to the Thief and Ranger in terms of mechanics - using a certain skill will flip others into a more powerful versions of themselves. It looks like Guardian's empowered spear skills though can be easily accessed and thus are balanced to be weak (unlike Ranger for example who has to fulfill additional condition to empower spear skills). \n\nIt worries me that spear gameplay will rely on placing Symbol of Luminance and then spamming all other skills in their illuminated version followed by weapon swap. I hope that ANet will make a revision on illuminated versions of spear skills.\n\nTell me what you think about Guardian's spear.",
            "This looks really solid but I feel like it's gonna be tough for WvW guardians to decide when to use it. Mace/shield/staff is such a solid support kit that I can't see myself giving up blocks/aegis, or the utility that staff provides. Guardian truly is the choice paralysis class",
            "Lack of symbols is disappointing. 5 is the only one that does and it's on a 20s cooldown with a 6s duration when traited. It'll limit build since some strong traits turn symbols into healing and debuffing moves.\n\nI suppose you could pair it with, say hammer, but I'm not sure what that rotation would look like.\n\nStill looking forward to it but I'm not sure how it's going to compete with other support weapons. At least in PvE.",
            "Auto hits just 3 targets while ranged warrior spear hits 4 and old staff hit 5. Smaller cone than old staff. Symbol is way smaller than ele edgings although symbols are guard's thing. Forced movement garbage on 2. Thanks for nothing. Dogshit weapon.\n\nFun how you designed ele spear to be as broken as possible and then designed guard spear like it may not even exist. You gave eles their broken dps staff back and guards can't even have their lootstick again. No favoritism at all.\n\nThe effects aren't even blue. It's also an ugly yellow weapon."
        ]
    }
}