{
    "No Stupid Questions - June 2024": {
        "title": "No Stupid Questions - June 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/guitarpedals/comments/1dbo8xn/no_stupid_questions_june_2024/",
        "content": "Wow, I can't believe none of us noticed that this thread needed updating to the current month! Yikes. 😬 We must be losing our touch...\n\n&nbsp;\n\n***Please use this thread to ask any questions that don't deserve a real thread.***\n\n*Power supply recommendations, specific \"versus\" questions, signal chain recommendations, pedal ID help, troubleshooting tips, etc. belong here.*\n\n&nbsp;\n\n####**Here are a few helpful resources:**\n\n* [Pedal settings doc.](https://docs.google.com/spreadsheets/d/1DaSwHPjVdE698L3bGrtpmpXgdsxuLS68u4Ar4GfP5u8/edit#gid=2060719108)\n\n* [Everything you need to know about getting power to your board.](https://www.reddit.com/r/guitarpedals/wiki/power?utm_source=reddit&utm_medium=usertext&utm_name=guitarpedals&utm_content=t3_9fs6r0#wiki_power_supplies)\n\n* [List of recommended youtube gear channels.](https://www.reddit.com/r/guitarpedals/wiki/index?utm_source=reddit&utm_medium=usertext&utm_name=guitarpedals&utm_content=t3_9fs6r0#wiki_recommended_youtube_gear_channels.3A)\n\n* [Our wiki.](https://www.reddit.com/r/guitarpedals/wiki/index?utm_source=reddit&utm_medium=usertext&utm_name=guitarpedals&utm_content=t3_9fs6r0)\n\n* Check the [**sidebar**](https://imgur.com/a/J2eXqAa) for the **[Posting Rules](https://www.reddit.com/r/guitarpedals/about/rules/?utm_source=reddit&utm_medium=usertext&utm_name=guitarpedals&utm_content=t5_2r0bp) FAQ** and more fun links!\n\n&nbsp;\n\n####**Other pedal related subs:**\n\n* [/r/diypedals](https://www.reddit.com/r/diypedals?utm_source=reddit&utm_medium=usertext&utm_name=guitarpedals&utm_content=t3_9fs6r0) - getting started, troubleshooting builds, and DIY pedal help.\n\n* [/r/letstradepedals](https://www.reddit.com/r/letstradepedals?utm_source=reddit&utm_medium=usertext&utm_name=guitarpedals&utm_content=t3_9fs6r0) - for when you've got the itch to try some new pedals.\n\n&nbsp;\n\n**You can find the previous NSQ thread**, 👉 [**HERE!**](https://old.reddit.com/r/guitarpedals/comments/1cl4xmi/no_stupid_questions_may_2024/) 👈",
        "num_comments": 229,
        "comments": [
            "I recently got a new (used) acoustic guitar for 1,000 (thanks to a generous family members loan). The Furch Green OM-SR goes for about 2,200 new. Its just got some nicks n dings. Im really happy about it. Surprised how quickly I adapted to the 1 3/4 nut after playing thick 1 5/8 vintage tele necks for so long - the soft V shape helps. \n\nI dont have a question. I just wanted to share my joy somewhere and Ive been banned from r/guitar for years due to r/guitarcirclejerk membership.",
            "Anybody run the Life Pedal with Strymon Iridium? I love the sound of the Life Pedal from demos but i dont have a huge amp. Is it a waste to use it with an amp sim like the Iridium?",
            "Is it possible to achieve feedback using a multi fx pedal with a feedbacker pedal? i currently have a NUX MG-30 as my multi fx and am planning to buy the Boss FB-2 as a booster and also feedbacker, will it work if i'm just practicing at home with headphones as my output or do i need to turn the speakers on to achieve feedback",
            "I used someone's Zoom G5n and immediately enjoyed it, I'm planning to buy myself one, but is it really worth it or should I just aim for Zoom G3xn cuz I feel like it's the same, just without a 4th pedal?",
            "how can i identify the date of my crybaby based on the serial number? is there a lookup somewhere?",
            "Can I use a ToneX One with a tube amp or will it blow up? (Will it sound good) \nAlso, can it be used to model delays or are they purely amp/cab sims?",
            "Looking for the cheapest and smallest flanger.\nAfter almost buying the mooer (~50$) i saw many at half price (AKLOT, ISET, and many more)\nAre they any good or might aswell buy the mooer?",
            "Looking for a fuzz to stack on top of my main drive sound (Oneder Drive + SD-1) for fuzzed out splatty lead lines/solos.  \n\nI started using my Behringer Super Fuzz in that context and I love how it sounds for lower notes but anything above the 12th fret leans too hard on that octave-ish sound. Any recommendations for something that'll get me there?",
            "I just had a pedal given to me by a friend, and I cannot find ANYTHING online about it. Its a tiny boost pedal called a little more by Nth Degree Tonesmiths. Its the roughly the size of pollytune mine, good color, and has 4 screw hole flanges. Its a super cool little pedal that adds a nice creamy warm tone to my rig. Would love to know more about it! Thanks!",
            "What should I buy... A 1010 Blackbox, a NeonEgg v3, a Limelight, or save the money?"
        ]
    },
    "Running synth pedals in parallel thanks to the JHS summing amp.": {
        "title": "Running synth pedals in parallel thanks to the JHS summing amp.",
        "score": 22,
        "url": "https://i.redd.it/08h9c09xeh9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Quick update summing amp output now goes into the korg tr-s so both my normal signal chain and synths get the NUTube treatment",
            "Data Corruptor into Slicer, one of my absolute favorite sounds.",
            "Thanks for sharing that description! Interesting way to do it, as I am trying to figure out how to integrate my board in the most flexible way. How do you like the SY-200? I am thinking about getting one. What is your favorite sound out of it?",
            "I ordered a similar AB/Y pedal with some blending ability, excited to crossbreed my drives and end up with a tone that sounds like it has a birth defect",
            "Yeah it is pretty sweet.",
            "I love the pad and string sounds. Running it now parallel alongside my normal signal it is way more useful for me now. Im a guitar player and Ill play a certain way so having the synth previous dominate my sound when on, I just couldnt adapt to it. Now it kinda sits in the back and adds something.",
            "Oh and the sy 200 is great. I love that I can now have fuzz and synth sounds run parallel with each other and it sounds amazing",
            "Ive had in my arsenal a few synth pedals and always wanted to run it in parallel to my normal chain.\n\nUsing the jhs summing amp Ive been able to achieve this and how I did it is as follows:\n\nGtr > EQD Swiss things (gain pedals in loop 1 and modulation in loop 2) - output 1 into a Marshall and output 2 into a fender.\n\nUsing the tuner out of the eqd swiss things I send a signal to a boss tu3w which then goes into the 3 synth pedals and boss slicer this then goes into 1/2 input of the summing amp.\n\nOutput 2 that goes into the fender amp I have, I actually send it to the boss loop station (which I basically use as a splitter) output 1 goes into the fender amp and output 2 into a korg tr-s (which I use as a way to add tube character to a orange super crush) this then goes into the 2/2 input of the summing amp.\n\nThe output of the summing amp then goes into an orange super crush.\n\nThis set up works really well and Im able to blend in a synth signal into my normal setup."
        ]
    },
    "What's your guilty pleasure pedal? I'll go first.": {
        "title": "What's your guilty pleasure pedal? I'll go first.",
        "score": 167,
        "url": "https://i.redd.it/kvbfqa725e9d1.jpeg",
        "content": "",
        "num_comments": 138,
        "comments": [
            "Why guilty? Mt2 is fucking BOSS.",
            "Fuzz Factory. Tweaking knobs and glitching unsure if I even like whats going on or not for hours",
            "I can noodle and riff on this pedal for hours.",
            "Soul Food is probably my closest thing to a guilty pleasure. I just think its ugly and dont like the name. Probably the least cool and most generic looking of all the bazillion klon clones but Ive had it for like a decade and it still sounds good.",
            "Alright so I just need to get one of these dont I",
            "Behringer uc200 chorus. At that price it just straight up shouldn't sound as good as it does. I'm always worried something's going to go wrong with it being in a plastic case (not the whole \"oh it's gonna snap when I step on it, my problem is that sometimes the footswitch feels like it's gonna break) but honestly I can look past that and it sounds awesome",
            "Sammy used this in Acid Bath. If it's good enough for him, it's good enough for me. ",
            "No guilt with that pedal...it is awesome.",
            "I have a micro q tron that when I throw it on the board, I smile and sound like p funk for the next two hours.",
            "Either my Fz-1w or my slrp when i'm chugging and after a series of 000 i hit a 111"
        ]
    },
    "STOB: I’m liking it so far! ": {
        "title": "STOB: I’m liking it so far! ",
        "score": 25,
        "url": "https://i.redd.it/nbnb1l4wtg9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Jekyll & Hyde club upvote!\n\nLooks like a fun pedal board",
            "How are you using the Chase Tone in your board?",
            "STOB..Amps: Sky King for cleans, Ampeg VT40 for cranked distortions, boosts and fuzz.\n\nTook me a bit to get here using my main amp and added a second 6 months ago. It sounds how it looks pretty much. I cant imagine much better for what Im playing right now.\n\nEverything is very specific and thought out. But I will say I have a LOT more to dig into the Collider. Everything else is pretty straight forward. But having the Collider last allows midi, and preset changes on the fly Im trying to work into my sets."
        ]
    },
    "First Pedal Board Build": {
        "title": "First Pedal Board Build",
        "score": 36,
        "url": "https://i.redd.it/7zuaxk1zqf9d1.jpeg",
        "content": "Just finished putting together my board after tweaking with it for over a year. I got a lot of ideas from Radiohead and also a lot of shoegaze artists as well. What do you guys think?",
        "num_comments": 8,
        "comments": [
            "considering my first pedal board was a big muff and a tremolo on a beer box, I'd say you're miles ahead.  \n\nJokes aside, it looks tidy and everything is accessible.  Nice work.",
            "you want to squish the rat sound? :O",
            "wow that looks very clean, nice job! i love that reverb, could never go wrong.. and the RAT is a staple. that delay is beautiful as well",
            "Nice! Have you considered a Joyo reverb to pedal?",
            "I dont use the compressor whenever I use the rat lol but I was wondering if someone would say something",
            "just asking mate since its really ur only drive. you can get alot of sound with that and the compressor+eq just wanted to see the reasoning.",
            "Oh yeah I totally get you. I typically run the compressor when Im playing more In Rainbows esc songs with a clean tone.",
            "Im big into this."
        ]
    }
}