{
    "r/GuitarLessons Monthly Gear Thread": {
        "title": "r/GuitarLessons Monthly Gear Thread",
        "score": 2,
        "url": "https://www.reddit.com/r/guitarlessons/comments/1d5ga8c/rguitarlessons_monthly_gear_thread/",
        "content": "**Welcome to the** r/GuitarLessons **monthly gear thread!**\n\n&#x200B;\n\n**First, we want to let you all know about the official** r/GuitarLessons **Discord server!**\n\nYou can join to get live advice, ask questions, chat about guitars, and just hang out! You can click [here](https://discord.gg/fmbBfeX) to join! The live chat setting opens up lots of possibilities for events, performances, and riffs of the month!   We're nearing 600 members and would love to have you join us!\n\n&#x200B;\n\nHere you can discuss any gear related to guitars, ask for purchase advice, discuss favorite guitars, etc.   This post will be posted monthly, and you can always search for old ones, just include \"Monthly Gear Thread\". \n\n&#x200B;\n\nHere, direct links to products for purchase are allowed, however please only share them if they relate to something being discussed and the simple beginner questions that are normally not allowed are allowed here.  The rest of our subreddit rules still apply!   Thank you all! Any feedback is welcome, please send us a modmail with any suggestions or questions.",
        "num_comments": 11,
        "comments": [
            "I bought a black strat, but it has a white pickguard, what is the cheapest way to get a fitting black pickguard?",
            "Any recommendations for an adapter that will work with an Android phone? I want to practice with yousician and all the other adapters seem to only work with iOS devices or are cheaply made.",
            "I'm not sure why TH-3 is showing you're tuned 2 octaves up, but your strings would not still be in one piece if you were tuned 2 octaves up. You should be all good, and 82.4hz is just about what it should be.",
            "They aren't trained the same way nor do they use the same materials.",
            "You're looking at incorrectly. Theoretically, what you're saying would be correct if the premise was true...but it's not. Fender doesn't make the same guitar in all these locations. Their higher end guitars are made in USA where they have a better market for materials and labor, easier oversight, etc. The cheaper guitars, materials, training etc are purposefully outsourced to other countries where it's cheaper toproduce instruments, where quality isn't as important. If what you said were the case you should be able to buy a Mexican standard and an American standard and see a direct comparison of materials, but you can't. It doesn't exist.",
            "Materials, manufacturing process, finishing process all contribute to the quality of the end result. I don't know the difference in playability between those two guitars as I don't have experience comparing the two. I don't really have much insight here for what you are trying to accomplish, just wanted to point out that the difference in price/quality isn't simply location.",
            "big beginner here. I am using DAW-VST to tune my guitar, and one VST shows octave while another shows Hz.\n\nTH-3 shows that my guitar goes from 6th string is E4 and 1st string E6, while NeuralDSP shows my 6th string is 82.4 Hz.\n\nI read online that \"standard tuning\" is 6 string to be E2 and 82.4 Hz.\n\nAm I tuned right or is there an issue? I am not good enough to discern if it's just guitar difference or octave is off.",
            "Should I buy Online or from a store?\n\nI have finalized the Yamaha FG800 but I read many posts talking about the \"Setup\".  \nIf I buy it online do I need to take it to a store for setup? Or do you recommend I buy it directly from a store.  \n  \nTotal guitar noob and I have 0 idea most stuff.",
            "Why does the location of manufacturing influence the quality of a guitar?\n\n  \nThe implicit assumption seems to be that american build fenders are better than mexican built and those in turn are better than indonesian built fenders. But how?\n\n  \nIf employees are trained in the same way by fender, then build the guitar using the same materials and machinerie, and to top it off built the guitar following the same fender process, how in the world can the results vary from location to location?\n\n  \nIs this just chauvinism? Are people just basically saying only americans can somehow build guitars? It just doesn't make any sense. If the same process is followed the workers have the same training and the materials are the same, you would expect all three locations indonesia, Mexico, and america to produce guitars of similar quality.",
            "So what would you describe the difference in playability foremost and then secondly sound of the Mexican made Fender Stratocaster and the USA made Fender Stratocaster?\n\nI felt a markedly better playability and sound in my Mexico Fender Strat compared to my Indonesia Squire Strat.\n\nI don't understand why though, the neck's playability should not depend on the materials. It seems like the Squire has a more cumbersome neck like it's thicker. Maybe the Squire woods need to be thicker to withstand the stresses of the strings?"
        ]
    },
    "Been making this up": {
        "title": "Been making this up",
        "score": 31,
        "url": "https://v.redd.it/6qn6gtz3gh9d1",
        "content": "Has anybody got ways to deal with keeping \nsomething interesting in other tunings ? \n\nI feel like while nonstandard tunning’s sound amazing, I find them hard to get variation because they are a little more limited ?\n\nI know my playing is very rough \n\n\n\n\n",
        "num_comments": 4,
        "comments": [
            "I think you're being a little hard on yourself. Yes there were some minor playing mistakes, and you still sounded great. Very relaxing and soothing for this rainy day ",
            "Great playing. Good job.",
            "Gorgeous piece!",
            "Very nice stuff"
        ]
    },
    "How’s this sound? 🔥 or 🚮": {
        "title": "How’s this sound? 🔥 or 🚮",
        "score": 179,
        "url": "https://v.redd.it/ki2xcwztbd9d1",
        "content": "First off, am I the only one who absolutely loves finger picking on electric? I don’t see people doing it too often. \n\nWas just noodling around and thought it was kind of catchy, feedback always welcome! \n\nThanks for listening! ",
        "num_comments": 51,
        "comments": [
            "Sounds really good! Timing is the only thing that stands out as being a little shaky in spots, but its better than I can do finger style ",
            "Time for you to learn different voicings and challenge yourself to play the whole progression in one position. That will make the changes from one chord to another sound smoother and more connected.",
            "Finger picking in electric is pretty common in jazz and stuff, it definitely has a good sound I agree\n\nIdea sounds good, things to improve thatl make it sound better is keeping time (slow it down with a metronome n dont speed up until its all in time) and working on smooth chord changes",
            "I just started playing and this is what I want to be able to do at some point. I think it sounds fire!",
            "Mark knopfler gets a lot of his signature sound from his finger picking. For that reason, I also love finger picking on electric",
            "Sounds great.. only suggestion is to work on not rushing those arpeggios.",
            "Practice with a metronome set to the 16th notes youre sort of rolling on the chords, they might seem like a textural addition but they need to be in time too, cause it sounds sloppy. Overall chord progression, rhythm, and harmony is pretty cool here. I particularly like when you add a slide before a repetition, maybe add more single note embellishments like that.",
            "Sounds good man, I dig it!",
            "As a somewhat beginner guitar, this is the type of guitar I want to learn. \n\nAre you just playing different chord progressions and playing notes as filler ? (sorry if I am not using the right terminology)",
            "Nice riffs but you are early on the beat a lot"
        ]
    },
    "stairway to heaven solo (6 months)": {
        "title": "stairway to heaven solo (6 months)",
        "score": 42,
        "url": "https://v.redd.it/pgyb5qhw5f9d1",
        "content": "super messy sorry… also idk why my fingers look like that",
        "num_comments": 21,
        "comments": [
            "Good job for 6 months!",
            "Good progress for 6 months, but I'd encourage you to find a easy solo and work on the basics.\n\nSound good on the easy stuff before engraining bad technique on harder ones.",
            "Dont apologize, you did pretty good!",
            "6 months, awesome. Doing it sitting on the wall, even more awesome.",
            "Great job!\n\nThat said, one thing to work on is relaxation  that pinky especially is carrying a lot of tension. Try playing this slowly as relaxed as possible while keeping all of your fingers over the fretboard within an inch of the strings. As soon as a finger is no longer fretting, make sure its tension free  pliable if you were to move it with your other hand. Thats probably the most important thing.",
            "As others have said, pretty good for 6 months. If you want to be pushed, I'd call your playing \"timid.\" Be more confident and play with more power.",
            "Great time actually. And youre definitely getting there my person! Keep at it and ina mother 6 months you gonna nail so many more cool stuff too",
            "Good picking hand and impressive progress. One suggestion to supercharge your advancement might be hand strength or ear related, as the bends are not quite hitting the notes they should. Likely these things will come in time naturally, but focussing these areas will continue your already fast-paced learning.",
            "good idea! do you have any solos that you'd recommend?",
            "thanks :) but im actually floating so"
        ]
    },
    "Does anyone else ever bend strings by accident?": {
        "title": "Does anyone else ever bend strings by accident?",
        "score": 54,
        "url": "https://i.redd.it/qr49igwene9d1.jpeg",
        "content": "Pretty much as the title says, am I the only one that struggles with accidentally bending strings while forming chords? For example: when I finger this Bm triad, my A string gets bent down to where sometimes it ends up muted by my pinky on the D string. It’s especially bad on faster chord changes and stretched out shapes like this.\nIt’s the only real issue I’ve found with my playing that I haven’t been able to improve by just practicing more, so clearly my technique is lacking somewhere that I haven’t been able to pinpoint. Thanks in advance!\n",
        "num_comments": 41,
        "comments": [
            "Just embrace it and add vibrato lol",
            "You are not the only one. What this means is you have improved to the point where you are noticing the details more. Now you just need to... practice more. You'll get it, but now you need to develop the fine motor and listening skills to play clearly in tune.\n\nThat means spending time just focusing on varying your pressure on the strings to learn the minimum amount you require to sound the notes cleanly. Make sure you are applying pressure straight down on the string and not stretching it into a bend in either direction. It's just another thing we always need to control.",
            "I have played acoustic for well over ten years and recently tried to jam on electric. I can say with confidence that I bend tf out of the strings without trying.",
            "Im afraid you have Boomeritis. Its terminal.",
            "This is a mark of excess tension and effort. Instead of gripping with the hand to make contact with the fret, try bracing the guitar with your strumming hand and pulling the fretting hand against the fretboard. For thisand other stretches, its way harder to keep things in line, so try relaxing your fingers on the strings in the correct place but not pressing down, then pulling the entire hand toward the fretboard as a unit, then relaxing, then pulling again, etc. That should help.",
            "Yes. Playing how you feel helps you find your own voice imo",
            "Theres no by accident. You are doing wrong. \nBy accident you can discover things that you like and apply them  on purpose.",
            "yes, death grip player here. practice fretting with the lightest touch possible. using higher gauge strings will also help.",
            "Pretty much all the time",
            "Common thing starting out, focus more on getting pressure in your fingertips and not pulling on the strings"
        ]
    }
}