{
    "Official No Stupid Questions Thread - Spring 2024": {
        "title": "Official No Stupid Questions Thread - Spring 2024",
        "score": 51,
        "url": "https://www.reddit.com/r/Guitar/comments/1bikipn/official_no_stupid_questions_thread_spring_2024/",
        "content": "The weather is getting warmer, but that doesn't mean we have to go outside... unless we bring an axe with us! Sorry for the delay in getting this thread back up. I hope all you fine people are well and shredding those guitars as much as possible.\n\nFeel free to ask whatever you want here. The world of guitar is vast and confusing no matter what level you are currently working from. Find out what you need to know here. Have fun out there and keep playing!\n\nnf\n\nEdit: This post will temporarily be unstickied. It will be back up on June 11th. ",
        "num_comments": 1194,
        "comments": [
            "r/musictheory needs one of these threads as well.",
            "Is it possible to realistically learn guitar if I suspect I have learning disabilities?\nI'm a male 44 yo, and since my teen years I have always liked the electric guitar but never got to get one and learn. Lately I've been feeling really drawn into it and I've been thinking about getting a guitar and learning, but I think I might have a learning disability.\nDo you think it's possible to for me to learn at all?\nThanks in advance.",
            "Why my post asking for the best travel guitars got deleted?",
            "New to guitar and need help understanding the logic of the fretboard.\n\nI understand the frets descend via the fifths — I understand the circle of fifths — but I’m confused about where it breaks the pattern and seems to be a half-step lower than what the fifth would be.\n\nIE going down the fifth fret, C leads to E instead of F.\n\nWhy is this? What is the logic of this? Is there a trick to remembering this?\n\nAlso, I see so many guitar fretboard maps online and they’re all inverted from what you see when you actually hold the guitar. It’s really frustrating — any tips to dealing with this?",
            "Whats the general consensus on chibsons? Find a nice looking one online and thought of buying it. If I do buy it I am in no way treating like a legit gibson or would try to resell it. I just want a cheap afforable guitar with humbuckers. Folks online seem to talk highly of them and the other half seem to disagree",
            "Is it better to try to learn a n easy song before you start on chords to get a feel for guitar or should you just jump strait into chords and scales",
            "Apologies if I don't really know how to describe this very well. I'm still relatively new to playing guitar, and still very new at learning about recording and putting songs together. I notice in the music I listen to (mostly hard rock, and some light metal), the sound of the guitars is always very sharp and crisp and has a high level of clarity.\n\nAdmittedly, I'm just a \"bedroom guitarist\" with a $500 guitar using NeuralDSP plugins on a laptop, so I'm sure I'm limited with how good I can get the final output to sound. But I notice my sound always lacks that sharpness or that clarity. It always kinda sounds grainy or blown out no matter what I do.\n\nSo, I guess my first question is, what is the actual difference that I'm hearing? Is that a matter of better gear? Better recording space? Is it just a matter of post production stuff (like EQ, etc.)?\n\nAnd follow up question, then; is that attainable for a \"bedroom guitarist\" with a $500 guitar using NeuralDSP plugins on a laptop?",
            "I have a repetitive stress question and I don't know if it is from just over practicing or bad technique. \n\nBasically when I play I use the base of my palm as a point of contact to ground myself and stay consistent. I press the bottom pad of my palm against the bridge when I can. Unfortunately I think this causes my wrist to be in a state of always being bent up, which is wearing on my upper forearm, causing the same type of burn as if you were using a mouse with your arm elevated high off the desk.\n\nDoes this sound like something I need to address, or will a better practice regiment take care of this?",
            "I have no experience in playing guitar.  \nThe main genre I wanna play is Jpop/Jrock, any recommendations on electric guitar brands, amps, and other equipment for a sound that fits the genre? In terms of budget, probably somewhere $2000-3000 of the price of all equipment all in all. I want equipment that will last a long time.",
            "I've been absolutely obsessed with [this](https://www.youtube.com/watch?v=2N1Bq81Tx0M) album and her rhythm guitar style lately, but my ear isn't good enough to figure out what's happening and it's not well-known enough for there to be good tabs available.  Are there any better-known artists who play in a similar style that I could study to try to learn?  Specifically what I'm looking for is like \"Youth\" (opening track) and \"Celluloid\" (second-to-last):\n\n* upbeat rhythm\n* emphasis on upper strings\n* jazzy harmony\n* also really like the kinda staccato/\"scratchy\" muted articulation on \"Youth\""
        ]
    },
    "Weekly One Take - Get feedback on your improv! Week 29": {
        "title": "Weekly One Take - Get feedback on your improv! Week 29",
        "score": 9,
        "url": "https://www.reddit.com/r/Guitar/comments/1dgo92r/weekly_one_take_get_feedback_on_your_improv_week/",
        "content": " Welcome back to Weekly One Take, the weekly improv thread with a focus on **constructive** feedback.\n\nThank you to everyone who posted takes or gave feedback last week! Great to see all the fantastic submissions and comments.\n\n**The Concept**\n\nThere are two ways you can participate in this thread, and they are not mutually exclusive!\n\n1. **Record a take** of yourself improvising over the backing track provided. The idea is not to achieve perfection - record a real, live, raw and unedited solo. It can be a video or just a recording. Upload your take to YouTube or Soundcloud and share it in the comments. *Tip: keep your take short and sweet. If you record a 10 minute take, think about chopping it down and submitting just the first few minutes.*\n2. **Give feedback** on someone else's take. We're looking for supportive, constructive comments - putting yourself out there for everyone to listen to is scary, and everyone is at a different stage in their guitar journey. Critiques are welcomed, but don't just criticise - offer suggestions on how to improve, and highlight the things you did like too.\n\n**This week’s track:**\n\n[Funky Blues](https://www.youtube.com/watch?v=kwzywATXGFU)\n\nIf you have any feedback on the concept as a whole, please let me know in the comments/DM me.\n\n*Check out previous weeks* [*here*](https://www.reddit.com/r/Guitar/wiki/index/#wiki_weekly_one_takes)",
        "num_comments": 66,
        "comments": [
            "https://youtu.be/NKg3Mt6GK_c\n\nLet me know what you think!",
            "[Tried to out-punch the drums :)](https://soundcloud.com/horizonforevergold/ots160624/s-iFzwbG6UKlc?si=40b2a993ed4d4b1185ed8ea3134e8146&utm_source=clipboard&utm_medium=text&utm_campaign=social_sharing) \n\neasy pickings for the Am pentatonic :D",
            "It's been a while since I've participated but glad to have caught it right on time! [https://youtu.be/udmJx9EFXQ8?si=IFGhkzlsMjJNmu8R](https://youtu.be/udmJx9EFXQ8?si=IFGhkzlsMjJNmu8R)",
            "deleted my other comment bc i decided to take my own criticism and try again right after (not the first take at all ;-;). i tried to be less repetitive cuz the other one felt very bland. this one still isn't amazing but it's slightly better in terms of variety, although i'd say it's a still bit too repetitive. besides that, please critique it, be as nitpicky as u can\n\n[https://www.youtube.com/watch?v=FtUwkdmEfVg](https://www.youtube.com/watch?v=FtUwkdmEfVg)\n\nfor improvement, im gonna start to meet with a teacher soon. also gonna (hopefully) start expanding my vocabulary for once by learning songs which i have neglected for a very long time. that should also help w my technique",
            "[https://www.youtube.com/watch?v=H2Xu5sLgQqg](https://www.youtube.com/watch?v=H2Xu5sLgQqg)\n\nHere's mine! Went a bit overboard with the chromatic experiments and fell flat on my face. Otherwise, some potential ideas!",
            "Seemed like a good excuse to use the new baritone again.\n\nhttps://www.youtube.com/watch?v=TIhKMpmeODg",
            "[https://www.youtube.com/watch?v=dq6QoMT--Xc](https://www.youtube.com/watch?v=dq6QoMT--Xc)\n\nHere's my take.",
            "Gave it a shot: [https://soundcloud.com/user-900498089/jam-of-the-week-6-16-24-wav](https://soundcloud.com/user-900498089/jam-of-the-week-6-16-24-wav) it goes for about 2 minutes, forgot to clip the rest.",
            "https://youtu.be/9Ly_RPPO9oQ?si=yCudV2Dc_XEBq6PY\n\nThis was a fun one 😎",
            "Here's my take yall!\n\n[https://youtu.be/zCJ4eprPiJo?si=2DxJQuTnjp8R1SOM](https://youtu.be/zCJ4eprPiJo?si=2DxJQuTnjp8R1SOM)"
        ]
    },
    "What’s my favorite band?": {
        "title": "What’s my favorite band?",
        "score": 372,
        "url": "https://i.redd.it/u31n5ek1l08d1.jpeg",
        "content": "Any suggestions on my pedals/chain are welcome. Haven’t turned it on in while. Just finished pulling it out of storage.",
        "num_comments": 361,
        "comments": [
            "The Wiggles?",
            "Every Hardcore band of the last 2 decades.",
            "Anal Cunt",
            "Gojira.",
            "Machine Head?",
            "A bit unorthodox to put your delay in front of the OD/distortion and noise gate anywhere but either up front or in the loop. Great gate, btw.",
            "A 2000s metal core band",
            "Killswitch",
            "Looks an awful lot like Matt Tuck’s setup.",
            "Nickleback?"
        ]
    },
    "Found this Teisco Tulip missing tuners at a flea market for $5. Got some tuners off Amazon for $16 and boom, instant noise machine.": {
        "title": "Found this Teisco Tulip missing tuners at a flea market for $5. Got some tuners off Amazon for $16 and boom, instant noise machine.",
        "score": 158,
        "url": "https://v.redd.it/e05i3djxz08d1",
        "content": "Not my best playing, just a quick celebration of giving life back to this weird little thing and adding it to the collection. Anybody else have one? ",
        "num_comments": 22,
        "comments": [
            "If you don't already know how to play slide, you now have a great guitar to learn it with.",
            "You sure you used the tuners? lol",
            "I have yet to own a $21 guitar. Am jealous.",
            "Nice - you got an original Gibson Theodore for 5 bucks",
            "Not gonna lie.  This is a fucking interesting sound you got there.  Actually sounds killer as.  Riffs are sick and that guitar suits that style.  Keep it up dude.",
            "Let it rip! Hell yeah man.",
            "Nice work lad",
            "I have something similar.  Those pickups are pretty damn unique sounding.",
            "love a Teisco. Please, millionaires, make a company that makes left handed Teisco guitars",
            "Looks very good actually. I'd be intrigued as well and I have way too many guitars."
        ]
    },
    "Bought myself a guitar for my birthday. How’d I do?": {
        "title": "Bought myself a guitar for my birthday. How’d I do?",
        "score": 457,
        "url": "https://i.redd.it/96s2nb9x4z7d1.jpeg",
        "content": "Martin GPC X Series Ziricote\nCame with the really nice bag too 🙂",
        "num_comments": 86,
        "comments": [
            "Solid choice. \n\nA single acousic electric guitar can take you far, and supposedly, Martin is the gold standard.",
            "I have the same model and case. Great choice!",
            "Looks great. What does something like that run, if you don’t mind me asking?",
            "Awesome choice! May I suggest that you put on some Elixer Polyweb strings and a set of bone bridge pins? By all means, play those stock Martin strings until they break, but I heard a huge improvement after I put these inexpensive upgrades on. Enjoy!",
            "Treat it right and it will treat you right back.  \n\nMartins are wonderful instruments.  It's going to give you years of enjoyment.",
            "Gorgeous.",
            "I am a Taylor man but Martins are a Great choice..IMHO It is disgusting that it did not come with a hardshell case",
            "Solid",
            "We just got that for my house it’s my girlfriends but I love the fuck out of it good choice",
            "You did good sir. You did good. \n\nEnjoy."
        ]
    }
}