{
    "Weekly Buy Curious Thread": {
        "title": "Weekly Buy Curious Thread",
        "score": 22,
        "url": "https://www.reddit.com/r/gundeals/comments/1dne874/weekly_buy_curious_thread/",
        "content": "",
        "num_comments": 346,
        "comments": [
            "Ruger MK IV 22/45 with a threaded barrel",
            "Need a tacticool shotgun.  Steal on a A300 Ultima Patrol OR 1301 Tactical Mod 2\n\nStandard grip only, FDE or ODG would be dope but open to any.",
            "2011 under 1k in 9mm",
            "Exps2-0 FDE sub 500 shipped.",
            "Still looking for shot timer deals",
            "CZ 75 SP-01 for around $600-800",
            "PCC Surpressors RS9, CA$Hk9, MK9, YHM R9. Looking for either of these at a really discounted price",
            "Looking for a garmin chrono for around 500 if possible",
            "A300 Ultima Sporting or any recommendations for clay ty",
            "STEINER MPS FDE less than $399 new"
        ]
    },
    "[ACC] Romanian Accessory Packs on sale $25 at AKOptions,LLC.  Also use code \"welcomeback\" to get $5 flat rate shipping site wide. ": {
        "title": "[ACC] Romanian Accessory Packs on sale $25 at AKOptions,LLC.  Also use code \"welcomeback\" to get $5 flat rate shipping site wide. ",
        "score": 38,
        "url": "https://akoptionsllc.com/romanian-accessory-pack/",
        "content": "",
        "num_comments": 8,
        "comments": [
            "I just need a cleaning kit, which set should I go for, the romanian or Polish?",
            "Oops, I fixed it. We have plenty.",
            "We just put these together as a way get sell this stuff cheaper than we could individually.  We also have a Polish version of them on the website.  If you have an AK these are easy and cheap way to get the basic accessory all at once.\n\nDon't forget to use code \"welcomeback\" to get $5 flat rate shipping.   its great no matter what you are buying but even better when buying heavy stuff like mags, bayonets, parts kits and more!\n\nHave a great 4th of July!",
            "Showing out of stock",
            "Ordered, thanks",
            "You can buy just the cleaning kit for $10 if you want.  [https://akoptionsllc.com/ak47-akm-cleaning-kit/](https://akoptionsllc.com/ak47-akm-cleaning-kit/)",
            "Thanks for posting /u/AKOptionsLLC! \n\n/r/GunDeals has updated the **[website blacklist](https://reddit.com/r/gundeals/wiki/blacklisted_websites)**, check it out before making your next purchase!. \n\nMade a gun related purchase recently? Leave a review over at **/r/GunDealsFU** to let others know how it went!  \n\nAre you a dealer? Make sure to read the **[](https://re.reddit.com/r/gundeals/wiki/dealer_rules)** and apply for a dealer flair as soon as possible!\n\nFirst time to /r/GunDeals? Read up on the **[user rules](https://re.reddit.com//r/gundeals/wiki/user_rules)** before you break a rule!\n\nHave a question that isn't answered in our wiki? Send the **[/r/GunDeals modteam](https://www.reddit.com/message/compose?to=%2Fr%2Fgundeals&subject=Thread%20Question&message=)** a message!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/gundeals) if you have any questions or concerns.*",
            "In an effort to help users make informed decisions, we have aggregated the following information on the retailer above. Please note that this is no way an endorsement or guarantee of the retailer or their products.\n\n###Domain Insights:\n\n| akoptionsllc.com |  |\n|:--|:--|\n| Registered | April 10, 2017 |\n| Times posted | [249](https://reddit.com/r/gundeals/search/?q=site%3A\"akoptionsllc.com\"&include_over_18=on&restrict_sr=on&sort=new) |\n| Feedback rating | [100%](https://reddit.com/r/gundealsFU/search/?q=flair%3Areview+\"akoptionsllc.com\"&include_over_18=on&restrict_sr=on&sort=new) (6 positive, 0 negative, 0 neutral) |\n\n___\n\n*^(I am a bot, and this action was performed automatically. Please) [^(contact the moderators of this subreddit)](https://www.reddit.com/message/compose/?to=/r/gundeals) ^(if you have any questions or concerns.)*"
        ]
    },
    "[Rifle] Andro Corp Industries ACI-15 Bravo16 MLOK 5.56 NATO AR-15 Rifle with 16 Inch Barrel and Black Finish $369.99 + Tax FREE SHIPPING": {
        "title": "[Rifle] Andro Corp Industries ACI-15 Bravo16 MLOK 5.56 NATO AR-15 Rifle with 16 Inch Barrel and Black Finish $369.99 + Tax FREE SHIPPING",
        "score": 28,
        "url": "https://www.sportsmansoutdoorsuperstore.com/products2.cfm/ID/278069",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Geez theyre giving these things away",
            "My first rifle. Ive had no issues at all, no malfunctions. Of course the upgrades done cost more than what I paid for it (furniture/optics/bcg, the usual).",
            "Great first / extra ar",
            "Lowest price I have seen it. Bought one a year ago and it is solid.",
            "I don't need it. I DO NOT need this.",
            "It comes with an AO bolt, thought that was one of the selling points at this price. Have issues with it?",
            "None whatsoever, just spent too much time on gundeals.",
            "Ill 2nd this. Have about 2k rounds through mine, majority of which was steel case ammo. Zero problems thus far.",
            "No kidding",
            "I can relate"
        ]
    },
    "[ACC] Esstac Shotgun Cards $13.50 In-Cart | 7% Off USNV Lasers + FREE PMAGS & SLING WITH ORDERS | BFG GMT Slings $12 Off | WarHorseConcepts Sling + Magpul QD Points $50.90 + Shipping | Brand New 2024 Elcan 10% Off | No Tax Except to VA": {
        "title": "[ACC] Esstac Shotgun Cards $13.50 In-Cart | 7% Off USNV Lasers + FREE PMAGS & SLING WITH ORDERS | BFG GMT Slings $12 Off | WarHorseConcepts Sling + Magpul QD Points $50.90 + Shipping | Brand New 2024 Elcan 10% Off | No Tax Except to VA",
        "score": 16,
        "url": "https://intelgoons.com/products/7-round-12-gauge-shotgun-card",
        "content": "",
        "num_comments": 36,
        "comments": [
            "Whats the best way to attach the 3x 5.56 midlength kywi pouch to a chest rig thats just molle all the way across? And then a 2x pistol kywi to the molle on the front of that 5.56 pouch?",
            "+1 for u/IntelGoons. Dude fucks.",
            "This might sound stupid, but how do I attach the esstac cards to my shotgun? Do I get an adhesive, Velcro thingy and slap it on my shotgun stock?",
            "Thanks, been meaning to get some of these for a while now. Just ordered 4 blk and 2 rg 7 round cards. Appreciate the hook up and deal!",
            "How does the DesignateIR-V compare to the DBAL A3? I've been looking to get into the Night Vision/LAM game (my wallet is not happy) and I'm trying to apply the \"buy once cry once\" policy to a LAM purchase. I see the Holosun LS321R, and the price is tempting. I'm a fan of their dots, not familiar with the 321.\n\nAs always, IntelGoons fucks on every day that ends in Y.",
            "Someone say shotgun card ",
            "I had tracking within 7 minutes. He ain't playin!!",
            "Dang it. Those black cards went fast!",
            "Sounds like they need a juicy government contract.",
            "I personally run the 3x 5.56 Daeodon on my PC - I bought QASM buckles from...AXL I believe, that weaved right into the front of my chest rig. Alternatively, if you're referring to like the triple 5.56 pouches, you could attach via one-wrap velcro or WTF straps. And then one-wrap the pistol KYWI to the front of the triple 5.56...\n\nI don't recommend this, in all honestly. You're better off going with a dedicated placard to save some space and not have too many snag points. Also, it would be incredibly hard to work from the prone with the setup you're describing."
        ]
    },
    "[acc] Auto 9 kit for m9a1 $600 preorder": {
        "title": "[acc] Auto 9 kit for m9a1 $600 preorder",
        "score": 61,
        "url": "https://www.salemlakesarmory.com/firearm-kits/build-kits-5026/auto-9-kit-for-the-beretta-m9a1-4952886",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Hell yeah! Id buy that for a dollar!",
            "I have never owned or wanted to pay for an M9A1 until now.",
            "Auto 9 sounds like the type of thing that has some very angry men in plate carriers at your door.  Neat kit for an m9 though.",
            "Too cool!!!  Would be fun to shoot once or twice at the range and never again.",
            "Dead or Alive Creep, you're coming with me.\n\nNever thought I'd be dissatisfied buying a 92A1 for my Samurai Edge clone.",
            "Shut up and take my money!",
            "This is awesome! going to track down an m9a1 for this!",
            "Silly question but is the credit card charged now or in January when everything starts moving forward ? Trying figure out my budget for all the sales this month",
            "I think youtube deleted your video because of \"firearm modifications\". It's stupid.",
            "I think your website went down."
        ]
    }
}