{
    "Gundam Seed Freedom - Megathread 3.0": {
        "title": "Gundam Seed Freedom - Megathread 3.0",
        "score": 25,
        "url": "https://www.reddit.com/r/Gundam/comments/1deeaj9/gundam_seed_freedom_megathread_30/",
        "content": "With the film now heading to a number or European countries and being released on Netflix in Japan, it is time for a new mega thread. \n\nAlright, new thread, same film, same ol' rules, so let's keep all spoilers and discussion inside this thread. If you are going to post outside this thread then please keep it in line with the spoiler policy, so flag it appropriately, keep the spoilers out of the title, and none of that [insert character name here] x [emoji] nonsense either. Please don't be that cunt that spoils the movie for the rest of us that haven't seen it yet. Failure to comply will result in getting smacked with the ban hammer.\n\nPrevious megathread: https://www.reddit.com/r/Gundam/s/JG0nJ87Eb8",
        "num_comments": 230,
        "comments": [
            "I finally realized what I was comparing this movie to mentally when I was thinking of it having a \"90's action movie vibe\". It's basically the same kind of movie as Starship Troopers or Independence Day: they may not have the deepest or best written plots, but damn are they so fun to watch in the most bombastic way that you can rewatch them multiple times while quotable quotes and moments get stuck in your head.",
            "Utterly fucking stupid dumb shit fan wankery. Peak Seed/10. Would freedom again. Loved it.",
            "The first 1/3 was stupidly soap operatic that even I, a CE apologist, had to cringe. But gad damn I was in tears when Kira and Lacus were affirming their love to each other even when separated, like shit, they were so nonchalantly perfect in Destiny, it's nice to see their walls break down. Especially Kira.\n\nStory beat was simple, but man, this is truly a love letter to CE fans with all the callbacks. The last 1/3 of the movie was a blast, I wish I didn't partially spoil myself months ago.",
            "Fun fact: Seed Freedom now grosses over 12 million HKD in Hong Kong alone, 1/20 the amount it made in Japan. Hong Kong has 1/17 of Japan’s population so Seed is almost as popular in HK as in Japan.",
            "The movie needed 3 hours.. In what we got it felt like we had very little time for all the new and returning characters (which in total is like 20 characters), little time for showcasing the new mechs and technology, and not enough time for the story. The first half of the movie was well paced, but by the final half it felt like a frantic rush to get things out the way so things can wrap up.\n\nI liked the movie but damn it there just wasn't enough time and it suffered for it very anticlimactically.",
            "When I was a kid, I used to imagine all sorts of superhero/gundam scenarios with the Archangel.  I’m sad that it’s gone, it was a badass ship.",
            "I wished they spent more time in Kira and Lacus' time with ZAFT and the PLANTs. At the very least I wanted to see Kira interact with Yzak.",
            "I actually burst out laughing when they paused the whole movie for Lunamaria to line up a shot and everyone clapped after she hit the missile. Fukuda has definitely studied the fan feedback to Destiny.",
            "i hope it comes to streaming and/or DVD/digital in the US soon",
            "I am happy Athrun and Cagalli got the bare minimum. A gag and a six second scene take it or leave it. Fukuda doing his wife proud."
        ]
    },
    "PSA: The spoiler policy still applies to Gundam Seed Freedom.": {
        "title": "PSA: The spoiler policy still applies to Gundam Seed Freedom.",
        "score": 40,
        "url": "https://www.reddit.com/r/Gundam/comments/1ded9z0/psa_the_spoiler_policy_still_applies_to_gundam/",
        "content": "Just because it's on Japanese netflix and some pirate streaming sites doesn't give you guys carte blanche to post stuff regarding the film willy nilly. Either follow the policy by probably tagging, flairing, and marking the post as a spoiler along with keep the post titles spoiler free, or you can enjoy a temp ban.\n\nYou can read the rules in the sidebar/community info or w/e reddit has renamed it this time.",
        "num_comments": 0,
        "comments": []
    },
    "Why aren’t there more Gundam games on current gen consoles? Is Sunrise allergic to money or something?": {
        "title": "Why aren’t there more Gundam games on current gen consoles? Is Sunrise allergic to money or something?",
        "score": 532,
        "url": "https://i.redd.it/tsqvxaqsje9d1.jpeg",
        "content": "",
        "num_comments": 189,
        "comments": [
            "The mecha genre is definitely making a resurgence. The issue is that there just aren’t many companies that have popular mecha games that Bandai could go to and know they’d do good. \n\nThe only one at the moment that could guarantee something successful is from soft but they are currently busy with the next AC.",
            "Yes, yes they are. That goes for all the top companies... We either get regurgitated pvp trash (pretty much every anime game we got this generation) or nothing at all.",
            "I want more gundam games like \"Gundam: Federation vs Zeon\"\n\nPlayd the shit out of that on ps2",
            "Bandai handles this, and tie in games for franchises, and I say this for most franchise, not just gundam, are rarely on consoles these days, most being on mobile.",
            "Armored Core 6 is my favorite Gundam game",
            "I don't think the audience is there given the cost of development.",
            "If they roped fromsoft into making a gundam game with the bones of armoured core, I'd be extremely happy",
            "Most of the Japanese companies only care about pachinko now.",
            "Gundam breaker 4 comes out this year. 8/29/24",
            "When Bamco comes to the same conclusion as Disney that it's a better idea to let multiple companies make games with their IP's rather than force exclusivity (Bamco with Bamco and Disney formerly being EA or in-house exclusive), that's gonna be a good day not only for Gundam fans but SJ fans too."
        ]
    },
    "They had a great transforming MS as the basis. How did they screw up the Rising Freedom and Immortal Justice? Saviour needs more love as well. ": {
        "title": "They had a great transforming MS as the basis. How did they screw up the Rising Freedom and Immortal Justice? Saviour needs more love as well. ",
        "score": 107,
        "url": "https://i.redd.it/4rzpc5af5h9d1.jpeg",
        "content": "",
        "num_comments": 24,
        "comments": [
            "I can only assume it was a last minute addition to the designs to make them more distinct from Strike Freedom and Infinite Justice and thus more marketable.",
            "Okawara has always been pretty bad at doing transformable suits. He can do okay ones like with the Saviour and both Wing Gundams but anything more complicated than that and it’s asking too much. It’s long been rumoured that the Aegis, which has an extremely complex transformation, was actually designed by someone else along with the rest of the Heliopolis 5 (I can’t remember his name atm). It’s possible the same thing could’ve happened with the Savior too and he was just hired for clean up on the lineart. We know that Fukuda requested transformable suits from the start (he said as much when discussing the animation process when the movie was still in production) meaning that the poor transformations on the Rising and Immortal likely weren’t late additions but Okawara being unable to design a solid transformable suit AND keep all the bells and whistles intact, so the shield and beam rifle just awkwardly lock onto the bottom of the transformed suit",
            "In terms of the actual transformation mechanism, there's no real difference between the Savior and the Rising & Immortal, since all of them just plank and have stuff cover them up. In fact, Rising Freedom and Immortal Justice cover up the heads of their respective MS better. If you look at just the base transformation for the Rising and Immortal without their handheld weapons, they don't actually look half-bad.\n\nWhere the transformations on the Rising and Immortal fall short though is the shield and rifle, since it's clear both weren't designed with a transformation mechanism in mind, and thus the way they're attached to their respective MA modes looks tacked on and unwieldy. The Savior meanwhile has a shield designed for the transformation in the first place, and thus it gives the MA mode a much better appearance, not to mention the rifle being stored in a better place than directly underneath. There's also the shoulders, which the Savior's back cannons cover up in MA mode, and thus better hiding the arms from view, whereas the Rising and Immortal just go full exposure in the same way as the Wing/Airmaster/Raider Gundams.",
            "Downright my favourite MS from SEED.",
            "The Rising Freedom and the Immortal Justice actually follow the Savior's transformation, itself just a variation of the Wing Gundam's planking method. The problem is that the gimmick felt unnecessary for both suits.",
            "My head canon is that they used the money to help upkeep and upgrade those older MS they kept hidden and used the development of the new Mobile Suits as a cover for the expenses.",
            "The Saviour had a neat transformation and the MA mode looks great.\n\nWhy were the transformations in FREEDOM so lazy? The Rising Freedom literally just covers the head and then is planking.",
            "I wonder how a Savior Knight Gundam would look if Kazami from Build Divers Re:Rise were to make one ?",
            "they shouldve gotten kawamori to do the transformable ms",
            "If not the savior, they could've also pulled from gundam eclipse. Anything other than what we got in the movie imo."
        ]
    },
    "What's everyone else's favorite melee based Gundam?": {
        "title": "What's everyone else's favorite melee based Gundam?",
        "score": 388,
        "url": "https://i.redd.it/tpvhlu859e9d1.png",
        "content": "Gonna glaze Soran Ib- I mean Setsuna- I mean the Exia here. \n\nAs far as I can see, the Exia is one of the best choices and probably the best choice out of the Setsuna Gundam Trinity when it comes to melee.\n\nIt was basically designed to excel in melee under any circumstance unlike the 00-Raiser which is more balanced and the Qan(T) which we all saw performs best in a wider range.\n\nI'd love to look into more melee suits (excluding the Barbatos because of Gundam Evo trauma.) So if you see this post, please feel free to drop your favorite melee based gundam!",
        "num_comments": 289,
        "comments": [
            "Gonna have to go with the melee built Shining Gundam or God Gundam that Domon uses in the G Gundam.",
            "Altron EW movie version. The double beam trident is pretty sick. And of course the dragon arms.",
            "Maybe simple but Barbatos or deathsythe.",
            "Oooh man, hard choice between 00 Raiser or Epyon.\n\nThink I have to go 00 Raiser.",
            "Master Gundam has held that spot for years. It just looks like an utter monster. \n\nAGE-1 Titus doesn't get enough love. The beam lariat alone is worth celebrating.",
            "Unicorn is technically a melee gundam, karate chop his way to victory.",
            "Schwartz or however it was spelled. Not enough screen time but big sword",
            "Can't go wrong with Infinite Justice Type II. I love how the backpack no longer looks like it's an aircraft meant for ramming enemies (it even lost the beam tip), and more an actual melee weapon for Athrun. They realized Athrun prefers to fight like a beyblade instead of sending out its backpack like an oversized DRAGOON.\n\nAlso the Exia Repair IV. Personalized and weebified for Graham with katanas.",
            "Gundam Gusion Rebake Full City.\n\nFour arms and giant pliers to squish your enemies.",
            "Definitely Bael, love that thing."
        ]
    }
}