{
    "Friday Buyday 06/28/24": {
        "title": "Friday Buyday 06/28/24",
        "score": 11,
        "url": "https://www.reddit.com/r/guns/comments/1dqalxo/friday_buyday_062824/",
        "content": "[Starting a subscale gun collection](https://imgur.com/wPl8c2w) edition\n\n  \nAlt text: >!SOLD 1/3 Scale 1893 Police Model Gatling Gun, Sale Price $16,486.00!<",
        "num_comments": 59,
        "comments": [
            "First day in Seattle over and done with and I haven't even spent a single buck. I traveled with my friends family, the one getting married, and so of course Asian family being Asian family they refused to let me pay for anything and treated me like I'm a guest. I tried to at least ask to pay for the tip after a large meal, they refused. I tried even hard to offer at least $20, they still refused. It's a losing fight.\n\nFlew Delta into Seattle, and unlike Alaska Airlines if you fly with a firearm you will have to pick up your luggage from their office. I caught my luggage before it got there, he was securing a zip tie on the zipper and I just let it happen because \"oh I've got a multitool I can just cut it when I get out\". Well after I get out I realize my multitool was inside that luggage so now I had no way of cutting it open and I felt like a helpless idiot.",
            "I was really worried about my credit card bill after going on vacation and getting every meal and parking, but it wasn't as bad as I thought it was. It probably was more than I wanted to spend but it's manageable. I did order a new side chute for the lawnmower.\n\nSighted in both 2011s yesterday, I forgot to bring extra fibers so I didn't get a chance to compare red vs green side by side.  I'll probably stick with green since that's what I've used for years now. Nickel cases ran fine so I'll load up 500 or so for the next major. It's clear to me that I need to get out and live fire more often.",
            "On this Friday, we pay insurance bills and match fees. Between my car, house, and umbrella policy, my insurance went up a full 10% POG.\n\nI should probably buy another 10K primers, but instead I bought ETFs(because stonks), although I'll probably still buy the primers.",
            "2x 1200rd cases of IMI 5.56 from Midway for $1k; one for me and one to split for two co-workers. I try not to stash too much extra ammo unnecessarily but adding a suppressor to my setup has made me yearn for more night shooting and make an effort in matches to save my hearing when in tight spaces. I got bit by the \"HODL\" last fall and missed out on the sub 40cpr Winchester so I'll take the hit now and hope for cheaper prices later, if not then I came out ahead in the long run.",
            "Third from the right - is that an old wingmaster, but with a rail?",
            "Have you glassed any stocks before?",
            "Have you no teefs? Or shims?",
            "> Not to mention the $200/yr state surcharge for EVs (allegedly to recoup lost fuel tax revenue, which is equivalent to buying 833 gallons of gasoline or diesel per year- itself equivalent to driving over 16,000 miles/yr if you average 20mpg; no doubt in my mind this is punitive)\n\nEVs are also significantly heavier than their ICE equivalent. Your R1T has a GVWR of 8500lbs, compared to almost identically sized 2024 Tacoma at ~4500lbs. Gas tax is not just a carbon tax, its also a road use tax meant to offset the wear and tear on my asphalt and resulting maintenance costs. A heavy-ass Rivian ripping 8000lbs off the line at 700 horsepower does a lot more damage to my subgrade than the average mid-size truck, a higher road use tax compensates for that.",
            ">  itself equivalent to driving over 16,000 miles/yr if you average 20mpg\n\nThat actually seems like a reasonable figure to land on.",
            "103F heat index LFG! Hydrating and snacking every 30 minutes is gonna be the name of the game tomorrow."
        ]
    },
    "Official Politics Thread 06/28/24": {
        "title": "Official Politics Thread 06/28/24",
        "score": 31,
        "url": "https://www.reddit.com/r/guns/comments/1dqhyjt/official_politics_thread_062824/",
        "content": "Post-Debate Edition",
        "num_comments": 132,
        "comments": [
            "The main reason for this is that outside of forums like this gun control isn't a very high priority issue for the average voter. It only really comes up when a politician makes a bad gaffe like O'Rourke saying he'd take people's guns away in Texas which may have cost him a win against Cruz who was pretty unpopular himself. I don't recall it coming up much in 2020 so it's unlikely to make much of a feature in the rerun either.\n\nThe media class has a lot of grabbers because of class snobbery (they are seen as for \"rednecks\") so it is made out to be more important than it should be by some.",
            "You’re telling me there were moderators last night? Kidding aside, neither of them answered the questions being asked so even if there was a gun control question, they would have responded about something completely unrelated that they already had sound bites ready for.",
            "How did the debate go? The first debate in 2020 was so bad with the interruptions from Trump and the moderator injecting himself into the debate that I didn’t even bother watching this one. ",
            "Chevron is gone. LOPER BRIGHT ENTERPRISES ET AL. v. RAIMONDO, SECRETARY OF COMMERCE, ET AL.\n\n>The Administrative Procedure Act requires courts to exercise their independent judgment in deciding whether an agency has acted within its statutory authority, and courts may not defer to an agency interpretation of the law simply because a statute is ambiguous; Chevron is overruled.",
            "Works on contingency?  No!  Chevron down!",
            "Chevron is dead. Long live Chevron",
            "It took a century to get where we are on First Amendment law, and we're still fighting about the details.  It's going to be baby steps all along for the 2A as well, and all that matters is that we're moving in the right direction.  \n\nHardcore gun culture folks are mad that we don't have suppressed Glock 18s in vending machines two years after *Bruen,* but this sort of stuff--challenges to stop-and-frisk based on a norm that possession of a firearm in public is presumptively lawful--is what winning really looks like.",
            "Honestly, it was probably so specifically Trump couldn't whine after the debate. If you have moderators doing any sort of fact checking or 'please answer the actual question' it will be described as selective and one sided. And honestly I thought it, the muted mics, and no audience was very refreshing after the last 8 years or so of just drama around it.\n\nI also think the people choosing questions probably realized Trump would just ramble during any gun control questions so it would be kinda pointless to ask for any reason other then to highlight Biden's fear mongering.",
            "I mean, I'm a little surprised Biden didn't shoehorn his \"you can't own a cannon\" line in somewhere.",
            "And most importantly, he ball. 🏀"
        ]
    },
    "Can someone tell me what this? was was looking through my grandads stuff.": {
        "title": "Can someone tell me what this? was was looking through my grandads stuff.",
        "score": 598,
        "url": "https://i.redd.it/89k2vw4qaf9d1.jpeg",
        "content": "",
        "num_comments": 120,
        "comments": [
            "dust cover has big star with arrow. that’s mark of factory in tula, ussr. \n\nif the year under the star is 1954, that’s one of the more common years.",
            "A damn good looking sks.",
            "Dude just casually stumbles upon a Russkie SKS. \n\nTheyre a ton of fun to shoot. Most people have Yugos, the Russians are more rare.",
            "Soviet Union SKS made by Tula.  Nice piece, they don't bring those over anymore. You should hold on to it. Take it to the range. They are extremely well made and are a lot of fun to shoot.  Take good care of it and it will outlast you, and someone will find it someday while looking through your stuff, and take it to the range and shoot it.",
            "Damn good looking SKS, probably my top 5 favorite rifle.",
            "Nice Russian SKS. learn to shoot it!",
            "Do research on value. Don’t give it away. Edit: like commenter said below. Don’t sell it at all. That’ll only go up in value.",
            "Everybody is right: Russian SKS. \n\nI just want to add that if you do want to go out and shoot it (you totally should!), and you found any old military surplus ammo along with it, the ammo might be \"corrosive.\" It's usually fine to shoot, but it takes special care to clean up. Otherwise, it'll rust your gun surprisingly quickly.",
            "Looks like a Soviet sks 7.62x 39",
            "The wood grain on that sks is very pretty."
        ]
    },
    "What’s your favorite gun to take a shit with ?": {
        "title": "What’s your favorite gun to take a shit with ?",
        "score": 161,
        "url": "https://i.redd.it/8kfo6ufyrf9d1.jpeg",
        "content": "",
        "num_comments": 80,
        "comments": [
            "Take shit posting to the next level",
            "Why do you have a gun in your bathroom?  Don't you have a poop knife?",
            "I usually take a shit with my butt.... usually. \n\nbut  Ruger SR45",
            "Mossberg 500, can blast possible intruders through the door, but more importantly, it ensures minimal chance of survival if the taco bell hits too hard and i need to take the coward's way out",
            "I rig the door with a claymore so I can focus on other things.",
            "A shotty by the shower if you wanna shoot me while I'm shittin.",
            "Wasr-10, because right after I take a hot shower, and all the moisture gives it RUST, adds a lot of character .",
            "The one between my thighs.",
            "BRN-9. Cause it kinda sounds like a turd and it fits in my hand",
            "Abrams Tank. You just never know 🤷"
        ]
    },
    "this too guys": {
        "title": "this too guys",
        "score": 165,
        "url": "https://i.redd.it/dneeaambbf9d1.jpeg",
        "content": "",
        "num_comments": 36,
        "comments": [
            "Dude, this has to be trolling? Dude just found 2 immaculate rifles.",
            "imperial japanese arisaka from ww2",
            "If the mum is intact, it could be even more valuable.",
            "What are your plans for these?",
            "Your granddad had some great taste my guy",
            "The type 99 is the best bolt action rifle. I'll die on this hill.",
            "Does it shoot the past few months I’ve seen a increase in Japanese rifles in non firing conditions",
            "That my friend is an M16A1, I know this because my son served in nam.",
            "Post author: twilks3x.  This comment is an attempt to control posts made by a new type of spam bot.  If you are a human, you can ignore it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/guns) if you have any questions or concerns.*",
            "Is the chrysanthemum destroyed or is it still intact?"
        ]
    }
}