{
    "Friday Buyday 06/21/24": {
        "title": "Friday Buyday 06/21/24",
        "score": 12,
        "url": "https://www.reddit.com/r/guns/comments/1dkux4l/friday_buyday_062124/",
        "content": "[Collectable tupperware](https://imgur.com/TEUSyCR) edition\n\n  \nAlt text: >!SOLD Early Gen1 Glock 17, Sale Price $5450.00!<",
        "num_comments": 57,
        "comments": [
            "300 shims from SendCutSend. Because cutting out even a handful manually was too much of a pain in the ass.  \n\nAlso, [a threaded barrel and mag extension](https://imgur.com/7QiDaqJ) for the Beretta.  \nSwapped the thread protector because I hate \"default\" ones.",
            "$36 for breakfast at the hotel, it was continental so not really that great tasting and the kids mostly wasted food. $35 for parking at Sesame Street place, we brought food in so I only spent $20 on dippin dots before we left, since it was mid 90s. The hotel bar upped their prices on beer from Wednesday to Thursday, a $2 increase in the same beer which I thought was a little strange, same time I was drinking too, just a different bartender. Wawa for breakfast today before we head into Philly for some kid museum, we found an Irish restaurant that looked good but zero parking so instead we plan on a Mexican place closer to the hotel.",
            "I broke down and got a copy of the [German rucksack](https://www.military1st.com/14016001-mil-tec-german-army-mountain-rucksack-olive.html) that \na bear stole from me, and I'm actually pleased at how its made. Doesn't feel quite as heavy duty as the original but I think it'll work well regardless.",
            "Had some OP call me a snowflake before swiftly blocking me and others in their \"pwease choose a Turkish 1911 knockoff for me\" post. Another OP said to me \"reprioritize your time management and do everyone a favor\" in a post where they were essentially asking everyone to outsource their time and effort into spoon feeding them a complete mk18 clone parts list, so that they wouldn't have to waste their own valuable time doing so. Irony is dead.\n\nIn other news, it hit 92 with all of the humidity here in southwest PA while the contractors were digging post footings for the carport. Fellas were slamming beer when I came out to check on them. They got it done, though.",
            "May go to the range tomorrow, if I do I'll need to buy some 9mm as I only have 1 box left, and that won't last at all.\n\nAlso going to call the bank that we got our car loan through, I should be coming up on the 7 month time where I can pay off the balance of our financing.\n\nEdit: I own my vehicle now!",
            "Nothing for me this week. Currently in Florida, so all our money is going to vacation stuff. I was sold on this as about 1k from us but I think it's costing way more. Kid is having fun but, damn.",
            "Neat bit of history but that seems spendy.",
            "Should be getting my Steiner T432 in tomorrow, my trigger kit for the B&T TP9 in next week along with some new batteries for the 509T X2 on the same gun. Batteries lasted over a year so I can't complain at all on a high setting with the circle dot reticle.\n\nI'm also going to give the Heathen Systems Assaulter Bipod a go as I'd like a simple bipod that I can keep on the rifle at all times, and the whole thing weighs 3.5 ounces with a barricade stop built into it. Not expecting it to be anything but light and adequate.",
            "I have a neighbor with a Glock 17 Gen 1, a couple years ago he was talking about possibly getting a Gen 5 and I offered to trade him but he turned me down. Oh well.\n\nBought a Condor shirt, one of those t-shirts with velcro patches. Gonna try wearing it at work to see if it's more comfortable in this heat. Nice thing is that now I'm buying t-shirts sized L instead of XL like I used to. My only problem is that sometimes shirts sized L vary in sizes, and so the shoulder width doesn't always match me. But buying XL sized shirts doesn't feel good either because they're meant to accomodate a way bigger gut than I have.\n\nApparently our boss got in a shouting match with someone from corporate arguing over how he should be running the branch, and this was perfectly timed to coincide with him getting a call that one of our crews locked themselves out of their truck at a stop over an hour away. Our boss was fuming for that day.",
            "[I'm buying some small magnets](https://youtu.be/1_X-nLYZ3Xc?si=wR28A-ViGQpuyWIq) that's what."
        ]
    },
    "Official Politics Thread 2024-06-21": {
        "title": "Official Politics Thread 2024-06-21",
        "score": 37,
        "url": "https://www.reddit.com/r/guns/comments/1dl1h1q/official_politics_thread_20240621/",
        "content": "[The antis have lost their minds](https://giffords.org/analysis/the-supreme-courts-reckless-bump-stocks-decision/)",
        "num_comments": 166,
        "comments": [
            "PaaP, or Politics as a Personality, is a very real psychological affliction.  If you are suffering from it, you'll probably have a Bad Time™ here.\n\nThis thread is provided as a courtesy to our regular on topic contributors who also want to discuss legislation. If you are here to bitch about a political party or get into a pointless ideological internet slapfight, you'd better have a solid history of actual gun talk on this sub or you're going to get yeeted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/guns) if you have any questions or concerns.*",
            "Now bump stocks are allowed again people won't want them anymore.",
            "US Supreme Court Decision in United States v. Rahimi is out. Rahimi loses 8-1, (Thomas Dissenting) with the majority opinion focusing on the fact a court found he posed a credible threat to the physical safety of others when issuing the restraining order. Note, he did have a chance to challenge it, and consented to the restraining order.\n\nhttps://www.supremecourt.gov/opinions/23pdf/22-915_8o6b.pdf",
            "[The GVA tweeted](https://x.com/GunDeaths/status/1803558458886631440):  \n\n>YTD comparison of U.S. gun violence, this year vs. last year.  \n\n>So far, 2024 has seen:  \n\n>↓ Fewer gun deaths  \n>↓ Fewer gun injuries  \n>↓ Fewer children shot  \n>↓ Fewer teenagers shot  \n>↓ Fewer mass shootings  \n>↑ More defensive use incidents  \n>↓ Fewer unintentional shootings  \n>↓ Fewer murder-suicides  \n\nI would like to know how they think this is possible. We have an all-time high number of firearms in the US, 28 states with constitutional carry effective, all 50 states with shall-issue permits (well, for the most part), courts post-Bruen starting to smack down anti-gun laws, something like 100x \"ghost guns\" than last year, etc.",
            "The Trace, not satisfied with the low levels of media sensationalism about school shootings and mass shootings, decides to inflate the figures by now claiming [500 yards is nearby a school](https://www.thetrace.org/2024/06/shootings-near-k-12-schools-us-data-map/).  \n\n>In Chicago, our analysis found, there were 97 schools with at least 100 shootings over the last decade.  \n\nAh, let's casually drop the \"nearby\" wording and assume the reader won't notice and will now assume those are school shootings.  \n\n>There is a clear racial divide running through Washington, D.C. The vast majority of the population living west of busy 16th Street NW is white. East of the same street, the population is majority African American.  \n\n>Nearly all of the school-adjacent shootings identified by The Trace were on the eastern side of the district.  \n\nIt's gotta be white supremacists doing these, right? AG Garland [did say](https://thehill.com/policy/national-security/553161-biden-officials-testify-that-white-supremacists-are-greatest/) they are the biggest threat out there: \"the top domestic violent extremist threat we face comes from racially or ethnically motivated violent extremists, specifically those who advocate for the superiority of the white race.”",
            "Has any of the big CCW insurance companies like CCWSafe or USCCA ever actually published numbers on their members, i.e. how many members have called in to report an incident, how many were actually charged, and how many were convicted?",
            "**Turks and Caicos**  \n\nRealizing that their hard stance on ammo was about to devastate their economy due to a significant drop in tourism, the government has [repealed a mandatory minimum of 12 years in prison](https://www.foxnews.com/us/turks-caicos-backtracks-ammunition-law-landed-american-tourists-behind-bars) as punishment for firearms offenses.  \n\n>The country's parliament agreed unanimously to revise the new ordinance after \"a great deal of flacking\" from American lawmakers, the country's Newsline TCI reported.",
            "> The antis have lost their minds\n\nYou love to see it",
            "**SCOTUS**\n\nThe Supremes will be dropping more opinions today at 10 a.m. Eastern. Normally they only release opinions on Thursdays, but we're late in the cycle and they can't go on summer break until they release everything. This schedule isn't unusual, and they announce their schedule at the beginning of the week. \n\nWe're still waiting on *Rahimi*, and I would not be surprised if they dropped that one on their last day before adjourning for the summer. *Cargill* was released last Friday, and if memory serves, *Bruen* and *Dobbs* were both dropped on Fridays as well. \n\nIf you're a fucking nerd like me, SCOTUSBlog does a live chat when opinions are dropping.\n\nRAHIMI DROP INCOMING\n\nVote is 8-1 with Thomas dissenting, will read shortly.",
            "[*SNRK!*](https://reason.com/volokh/2024/06/19/when-i-see-an-animal-that-looks-like-a-duck-swims-like-a-duck-and-lays-eggs-like-a-duck/)"
        ]
    },
    "Grandpa passed. Grandma is selling his guns ASAP. Looking for info on the limited info I have.": {
        "title": "Grandpa passed. Grandma is selling his guns ASAP. Looking for info on the limited info I have.",
        "score": 72,
        "url": "https://i.redd.it/rvr1zipq148d1.jpeg",
        "content": "I am reposting this as I posted this last night before bed and while I was sleeping it was removed due to not having a description in the comments.  All of your help is appreciated!\n\nAs the title states, our Grandpa passed away.  His guns are now being sold very abruptly by Grandma. I would like a 20 gauge but I'm curious if anyone can identify the circled 20 gauge in the photo and/or recommend a fair price for it?\n\nI'm told a broker came by and put a \"fair price\" on the lot of guns at $5000. I have no idea if that is high or low or even the exact details on many of the guns on the table. Getting the details from Grandma at the moment is very difficult. She wants the money for a good cause to help another family member in need. However, none of us imagined these weapons going to non family and especially this fast - so im looking to see if I can get any info and keep one or more in he family.\n\nIf anyone sees anything else in the photo they can identify and/or put a value to or recommend that I try to purchase, I would greatly appreciate it.\n\nP.S. They live in Montana and I'm in Michigan so there's no reasonable way for me to do recon for more info other than what I get from Grandma.",
        "num_comments": 53,
        "comments": [
            "Definitely leave all the pistols in their holsters and do not post descriptions of any of the firearms so they are harder to identify. /s Sell them to a family member. Getting rid of family heirlooms like this is robbing your future ancestors of the chance to have a connection with your grandfather.",
            "My grandfathers guns were auctioned off in front of my face and I’m still pissed a decade later. I would’ve love to pass them to my boys one day",
            "If my kids sell my firearms, I'm going to curse them all. I'll haunt them and disown them when we meet in the afterlife. \n\nDidn't mean to shame OP. Posts like this just make me a little mad 😅",
            "Circled gun looks like a Remington Wingmaster, great heirloom gun.  It's a shame your grandma is selling these.  I have several firearms from deceased family members and they're worth more than money to me.",
            "Way more than $5k. Broker sounds like a scammer or idiot.",
            "I like the Browning Hi Power and whatever that S&W with target grips is.",
            "No offense, but your grandma kinda seems like a bitch. They're heirlooms that I'm sure you and multiple other people in your family would like to have, and she's selling them",
            "Shotgun is a 870 wingmaster.  Relatively modern given the flexi tab.  \n\n\nProbs a extra high grade model, given the beautiful wood, but I don't know that level of detail as my interests are more tactical in nature",
            "I am reposting this as I posted this last night before bed and while I was sleeping it was removed due to not having a description in the comments.  All of your help is appreciated!\n\nAs the title states, our Grandpa passed away.  His guns are now being sold very abruptly by Grandma. I would like a 20 gauge but I'm curious if anyone can identify the circled 20 gauge in the photo and/or recommend a fair price for it?\n\nI'm told a broker came by and put a \"fair price\" on the lot of guns at $5000. I have no idea if that is high or low or even the exact details on many of the guns on the table. Getting the details from Grandma at the moment is very difficult. She wants the money for a good cause to help another family member in need. However, none of us imagined these weapons going to non family and especially this fast - so im looking to see if I can get any info and keep one or more in he family.\n\nIf anyone sees anything else in the photo they can identify and/or put a value to or recommend that I try to purchase, I would greatly appreciate it.\n\nP.S. They live in Montana and I'm in Michigan so there's no reasonable way for me to do recon for more info other than what I get from Grandma.",
            "I'd guess that each of the pistols could go from $600-1000.\n\nBiggest issue is selling them without paying too much to in fees.\n\nA local gun store that can sell on consignment including gunbroker would probably net a little more.\n\nAlso the Blue Book of Gun Values, recent sales on Gunbroker, and looking the serial number of each gun on the manufacturer's site would assist in nailing down a fair price."
        ]
    },
    "Single or Double?": {
        "title": "Single or Double?",
        "score": 21,
        "url": "https://i.redd.it/hdo7s2dip38d1.jpeg",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Finally completed my “PMM” (IJ70-18AH) double stack Makarov with a complete military look. Although the small amount of military double stacks are different. The hard to find “Bakelite” (textolite) grips, combined with a surplus slide, hammer, safety and mag catch really make this gun look as aesthetic as possible. Very sweet little piece I’ve always wanted set up this way is finally complete.",
            "I should have bought the Bulgarian mak (circle 10) with bakelite grips and safety's they had at the pawn shop in town.  Super cheap, I'm sure it is gone now.",
            "What are you doing today? Go look mane. They are not making any more.",
            "I know, maybe I will on the way back through.  As someone from Memphis, I am damn proud to be called mane on reddit. Hahah."
        ]
    },
    "A collection of pea shooters.": {
        "title": "A collection of pea shooters.",
        "score": 29,
        "url": "https://i.imgur.com/DXkXznR.jpeg",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Someone commented the other day they just couldn't find fun in shooting .22 long rifle, so I was inspired to finally stack 'em all in one spot and grab a picture because I feel no such lack of pleasure in propelling tiny projectiles shorter distances without much fanfare.\n\nStarting from the right top and going down:\n\n* Ruger Single Six Bisley \n* Ruger Single 10 with Swift 2x20 Scope\n* 1974 Colt Peacemaker .22lr\n* Colt M1991 frame with Ciener Platinum Cup Conversion\n* S&W Model 41 with UltraDot \n* Buckmark Camper\n* 1969 Browning Challenger I 6\"\n* Buckmark Camper with UltraDot\n* Ruger Mk. 3 22/45 with Bushnell Centurion 2x20\n* Taurus 9422UL",
            "More cost effective as well. Nice colection.",
            "Favorite?  And what would you recommend ",
            "Until I finally get the nerve to setup the reloading kit and try, this is about the only thing I can afford anymore."
        ]
    }
}