{
    "DISCUSSION MEGATHREAD: SYNT #75": {
        "title": "DISCUSSION MEGATHREAD: SYNT #75",
        "score": 15,
        "url": "https://www.youtube.com/live/R-u2gC_CQJI?si=8l3dxOKkV8REHhWY",
        "content": "",
        "num_comments": 52,
        "comments": [
            "i love how giddy dan gets when they find the most moronic far right content",
            "begging superchats are cringing me TF out.",
            "Wom Ward",
            "Can’t afford a membership rn, can anyone give me a cliff notes version of what he says about the kendrick concert pls (if he talks about it)",
            "Bro Ethan chews food like a 4 year old 😭",
            "My issue with Ethan chewing is he smacks his lips every couple of words after taking a bite.",
            "Real question: What does Terrance Howard think 2x1=? Would he say 2? Does he think 1x1=2 and 2x1=2??",
            "PSA to Ethan: artificial sweeteners can cause diarrhea/digestive issues for some people. I don't know how much of it he's ingesting in a day but it doesn't take much for me and I'm ruined for the next 48 hrs 💀 if he hasn't done it already, it might be worth cutting all fake sugar for a while to see if the tummy troubles get better. From there you can slowly add them back one by one to see if any of them trigger your symptoms.",
            "I love these episodes, they seem more chill, Ethan seems more at ease. Good times.",
            "Petition to have Tom Ward on every SYNT!"
        ]
    },
    "DISCUSSION MEGATHREAD: This Influencer Killed Her Cat - H3 Show #26": {
        "title": "DISCUSSION MEGATHREAD: This Influencer Killed Her Cat - H3 Show #26",
        "score": 0,
        "url": "https://www.youtube.com/watch?v=GkAiYALkd9Y",
        "content": "",
        "num_comments": 1268,
        "comments": [
            "I know for 100% fact Ian is just straight up playing solitaire or something on his computer right now, and has been for the past 3 hours",
            "I still haven’t figured out why Ethan decided to conduct the interview like that… that’s not how you interview someone, especially when you have no proof they are in the wrong. A cat doesn’t get that sick over night, she had plenty of time to take her to the vet. As a cat owner, I’m always on high alert for any symptoms I notice. Cats are good at hiding their pain, so if it got to the point of what we saw in the video, she must have been suffering for a while. I’m disappointed by how Ethan handled this issue.",
            "Appreciate Olivia and Dan, especially this episode.",
            "Dan proving once again why he's the most level headed",
            "PLEASE if you see a dying animal you should 100 percent try and rescue it. The fact that she had this cat for months sick and he tried to rescue this cat speaks volumes to each of there characters if you ask me.",
            "Am I the only one who is suspicious that she never took the cat to the vet EVER, like never a check up for vaccines or a microchip or nothing? Like or did she take him to the vet before but not recent enough.",
            "\nI’m having a really hard time with the conclusions the crew are getting to….\n\nI think when they did the interview the guy was obviously flustered and forgetting specific details, but he was still implying a lot of things. Like to me it was obvious that he was at that house and was passively observing the cat for a decent amount of time and noticing the way it was being treated, to me it sounded like there was a conversation between the roommates about the condition of the cat and it seemed like they had all agreed upon taking action if this girl wasn’t. \n\nOn top of that Olivia is right, during Covid it would’ve been incredibly hard to get a pet in. And to top that, yes, urgent cares do not have the same amount of care an actual vet would. And why would you bring a sick animal to wait hours in emergency, just to get subpar care? Wouldn’t you rather the animal feel safe and wait a day or two when you KNOW the animal will actually get treated and correctly observed? \n\nNot to mention the guy literally said he thought the cat was starving at first, and didn’t realize that the cat maybe had more going on which is why it took an extra day or two to get to the vet. Also coming down on this guy for waiting 3 1/2 days compared to the MONTHS this girl had the cat.. like really? \n\nWith the seizures too.. cats don’t randomly have seizures, usually that happens because of an underlying condition that requires medication. I wouldn’t be surprised if that was happening in her care before he took the cat.\n\nWhen I originally heard about this situation I had watched her first tiktok about it. My initial reaction was that something was off because if I was in her situation and my cat got out and it was sick, I would be destroyed. Even years later I find it hard to talk about my dog that passed because I was away at college when it happened and I feel incredibly guilty that I wasn’t there for her. Imagine thinking that your cat is sick, lost, and alone and just talking about how “you didn’t kill your cat”. Like please, and the fake in and out of crying on her videos… really girl? \n\nIn conclusion I would’ve done the same thing that the guy did. I’ve been in a similar situation before with a roommate and I did speak with him, eventually he decided to give the cat to someone who would care for it. But we don’t know this girl, that conversation could’ve been had between other roommates. Ultimately if the cat was this sick to the point where he brings it to the vet and their best advice is to put it down.. it was very obviously neglected, and it bothers me how this guy is on the hot seat and not the girl. \n\nI get they need to question every motive of this guy but they did it so harshly and focused on small things and it felt like they missed the point of what he was saying.\n\nI love the H3 podcast and I’ll always be a dedicated viewer but I feel like they missed the mark with this one (as doobrik would say)",
            "BUT YOU WERE GIVEN THE OPPORTUNITY, GIRL. she’s saying that Seven got sick often, and she never took her to get checked out. you were given the opportunity to address her health concerns multiple times and YOU DIDN’T. \n\nthe guy who took her cat is definitely a bit strange too, but i don’t think he’s responsible for Seven’s death at all.",
            "I knew this was going to go downhill when the girl dropped a superchat.",
            "This is sad, as someone who works in the vet field regardless of what happened the cat should not have gone 3 weeks without seeing a vet… also the shelter should’ve been contacted only to discuss medical history and advice, she should have absolutely seen a vet a few days after symptoms pursued. Yeah it’s her first pet but don’t get a cat then if you don’t know what you’re doing 🥲 she has more than enough $$ I’m sure to have gotten her adequate care."
        ]
    },
    "I see no other option": {
        "title": "I see no other option",
        "score": 531,
        "url": "https://i.redd.it/0p9x1d60338d1.jpeg",
        "content": "",
        "num_comments": 65,
        "comments": [
            "And why was the girl seen as not the problem? Was so confused that they got to that after four fucking hours",
            "“if you don’t want to watch, just skip the segment!” but the segment is the whole show…",
            "4*",
            "Why couldn't they have just done the high school stories. That would have been more fun",
            "4 hour segment of 2 grown adults harassing someone for trying to save a cat while the girl that never even bothered to take it to the vet got off Scott free.",
            "Why even bother to spend so much time on some random he said she said influencer drama anyway. No one knows anything, no facts or real evidence and there’s so little to go on but their own misconstrued stories. What a fucking train wreck of an episode, I’d rather watch paint dry. In fact I did just that and it was way less frustrating and more entertaining, highly recommend.",
            "Such a shame... The show is supposed to be entertaining but it was just really stressful and frustrating to listen to. I've supported the show since day one but this was by far the worst episode with some horrible takes.\n\nEthan and Hila really need to be more open to opposing opinions too. They just had shitty attitudes for the 4 hour long ep :/.\n\nI really hope they acknowledge and learn from it.",
            "Yeah I skipped this episode and dropped my sponsorship level.  Been on board since 2016 and am struggling lately with the show’s content.  It’s probably just me but I’m not loving it as much as I used to. 🤷‍♀️",
            "Wtf is happening since the H3 show rebranding?!",
            "Yeah I just skipped the entire episode after the first 20 minutes"
        ]
    },
    "Only 1 man can humble Ethan enough to give the show the reset it needs": {
        "title": "Only 1 man can humble Ethan enough to give the show the reset it needs",
        "score": 1607,
        "url": "https://i.redd.it/7pmu9pice08d1.jpeg",
        "content": "",
        "num_comments": 158,
        "comments": [
            "\"What is this weird fucking cat podcast you're doing here??\"",
            "What Ethan did with Sam Seder on Steven Crow~~der~~ning’s podcast is what Bobby Lee should do with Bill Burr on Ethan’s podcast.",
            "“You showed them a dead cat? Seriously man, what the fuck is wrong with you? You think people are tuning into your show after slaving away in some factory for eight hours to watch you look at a dead cat? No wonder you’re losing subs man!”",
            "Bring him back lol",
            "LISAN AL GAIB!!!!",
            "Oh. My. God.\n\nHonestly, the crew is too soft for Bill. He would definitely make AB cry.",
            "He's on the side of the kids",
            "When the world needed him most……",
            "I'm absolutely not watching 4 hours of one subject and especially animal abuse, frankly they shouldn't even cover stuff like that. Where's the \"show\"?",
            "i tried skipping the episode to see when the cat segment would be over (i don't like seeing anything about abuse of animals) and there was NOTHING ELSE! friday is my favorite show, it's supposed to be fun and light."
        ]
    },
    "Just close your eyes bro ": {
        "title": "Just close your eyes bro ",
        "score": 2966,
        "url": "https://i.redd.it/9lm7h25kdz7d1.jpeg",
        "content": "",
        "num_comments": 337,
        "comments": [
            "Ethan: I want to see the cat. We need to get mad \n\nAlso Ethan: I would have rather not seen a seizure",
            "Skipped this one and I never skip",
            "Poor AB can’t win. 😆😆😆\n\nSubreddit: “we are sick of Olivia power points”\n\nH3 response: “let’s have AB do the next power point…..on animal abuse”\n\nThis podcast 🤣🤣🤣",
            "I have 4 cats and I cannot handle seeing animal abuse/neglect. my heart can't handle it. I'll be waiting til they switch to a different topic and then watch",
            "i think we need at least a month of just goofs and gafs. maybe a year 😅",
            "I hate to be that guy but, I just lost my 17-year-old cat this week. I think I'll skip this one.",
            "I am begging for one light hearted episode. Please. As a treat.",
            "This one is definitely a skip",
            "Watched for aslong as I could but i have to turn off the pod. Just bumming me out, don't need to listen about some random tiktoker who neglected a little soul.",
            "i mean literally though, who tf are these people we're hearing about? yes this is not a nice story but, exactly WHY tf are we going over this in powerpoint detail?"
        ]
    }
}