{
    "DISCUSSION MEGATHREAD: Meeting The Queen Of Melrose - H3 Show #28": {
        "title": "DISCUSSION MEGATHREAD: Meeting The Queen Of Melrose - H3 Show #28",
        "score": 270,
        "url": "https://www.youtube.com/live/-YJSijE7AZM?si=-amtDZXT06JGKvGh",
        "content": "",
        "num_comments": 365,
        "comments": [
            "someone drop the Jimmie Lee tea ASAP",
            "I LOVE COSMO !! these are the vibes needed not maga adjacent boomers",
            "Im thoroughly enjoying this. Cosmo has so much charisma",
            "QUEEN OF MELROSE WAS THE HIGHLIGHT OF MY PRIDE MONTH YASSSS",
            "Best episode in the past 6 months probably. I love Cosmo, their little short with Olivia and Zac was incredible! They are so charismatic and interesting ",
            "I love this so much. Her energy is amazing.",
            "Cosmo is absolutely fascinating and I love how they are so open and honest even if its uncomfortable. Love it.",
            "Did the Queen just dethrone Jimmy and Trisha in a single episode? Yes, the answer is yes.",
            "We all love Cosmo, more cosmo. What a breath of fresh air.",
            "So sexting a minor is completely legal as long as theres no pictures involved? I feel like that law needs to be updated"
        ]
    },
    "DISCUSSION MEGATHREAD: The H3 Show LIVE From The Greek Theater!": {
        "title": "DISCUSSION MEGATHREAD: The H3 Show LIVE From The Greek Theater!",
        "score": 167,
        "url": "https://www.youtube.com/live/sBpB7feVjd4?si=cUZ8pSjasa3N4Jni",
        "content": "",
        "num_comments": 770,
        "comments": [
            "shout out to the ASL interpreters!! we love the deaf dont we folks! they look like theyre genuinely having so much fun i love this so much the vibes are amazing so far",
            "Cam really made it ahhhh",
            "Forgot that Ian and Dan get to be on stage now that Nate is part of the crew.",
            "Not ethan almost dying in the first 3 mins ",
            "I love he didnt actually ask the question hes been wanting to ask since the the day he met her ",
            "Gummy bear dude is gonna be jet propelled on the toilet later ",
            "MR AND MRS STAMPS DOT COM",
            "THE WAY DAN IS EATING SO HARD WITH THAT KRATOS COSPLAY WOWOWOW",
            "OF COURSE Ian listens to Chappell Roan. He is so girly pop.",
            "A 2nd gummy has hit the h3 show"
        ]
    },
    "The most beautiful moment I have ever witnessed ": {
        "title": "The most beautiful moment I have ever witnessed ",
        "score": 3022,
        "url": "https://v.redd.it/nwmhsem61g9d1",
        "content": "",
        "num_comments": 179,
        "comments": [
            "The only time Ive ever seen Dan act nervous ",
            "SO CUUUUUTE!! Mr. amd Mrs. Stamps.com ",
            "i CRIED  i wish them soooo much love and happiness!!!! and i think it's SO funny and also precious that dan was dressed as fucking kratos  what a proposal story",
            "Everyone's reaction and Love tearing up is so sweet !!!! Ugh I could not stop smiling",
            "How are they going to mail out their wedding invitations?  Stamps and shipping is so expensive these days",
            "love wiping his tears ",
            "She got her passport, and she got her shots ",
            "Love in the background! ",
            "I heard Dan's fiance uses stamps dot com",
            "Also shout out to AB the camera man  he got ALL the angles"
        ]
    },
    "The new H3 heartthrob": {
        "title": "The new H3 heartthrob",
        "score": 1793,
        "url": "https://i.redd.it/g7w2d9ctuf9d1.jpeg",
        "content": "Killed it 🖤",
        "num_comments": 67,
        "comments": [
            "They should come on the show!!",
            "Majorly crushing!!  such a good sport",
            "luckily they hired a queer person, not sure if every ASL interpreter would know the sign for strapon",
            "No literally theyre so cute. I was blushing queerily. They were fully committed to the bit",
            "GET THEM ON THE SHOW ITS PRIDE MONTH",
            "Those moments made me fucking cry laughing  so funny! Such a good sport",
            "Yesssssssss. I have the biggest crush on them! Hilarious, cute, a good sport and an extremely talented ASL interpreter. What more can ya ask for?",
            "My favorite part of the show tonight ",
            "My 15 percent went up to 90",
            "No they stole the show fr"
        ]
    },
    "Zach’s reaction to Ally and Dans engagement is killing me 😭🩷": {
        "title": "Zach’s reaction to Ally and Dans engagement is killing me 😭🩷",
        "score": 1101,
        "url": "https://i.redd.it/lmfpfnz2ag9d1.jpeg",
        "content": "",
        "num_comments": 30,
        "comments": [
            "That stance is his final form",
            "lolll i was making the same exact face",
            "I really wish someone caught ABs reaction, he was literally jumping up and down on the couch when Dan was about to propose ",
            "Was it him or AB that yelled \"Where's my phone\" in the middle of it ? xD Poor dude just wanted to take a video ",
            "Damn, forget I was going to avoid this sub until having watched the whole episode ",
            "My man looks like the Seal gif from The Voice",
            "They zilly zonked us all",
            "lego lew is a free elf",
            "Kemo stood so Kratos could Fly",
            "\"I'm gonna need TWO Capri Suns for this\""
        ]
    }
}