{
    "How to start hacking? The ultimate two path guide to information security.": {
        "title": "How to start hacking? The ultimate two path guide to information security.",
        "score": 11771,
        "url": "https://www.reddit.com/r/hacking/comments/a3oicn/how_to_start_hacking_the_ultimate_two_path_guide/",
        "content": "Before I begin - everything about this should be totally and completely ethical at it's core. I'm not saying this as any sort of legal coverage, or to not get somehow sued if any of you screw up, this is genuinely how it should be. The idea here is **information security.** I'll say it again. **information security.** The whole point is to make the world a better place. **This isn't for your reckless amusement and shot at recognition with your friends.** **This is for the betterment of human civilisation. Use your knowledge to solve real-world issues.**\n\n&#x200B;\n\nThere's no singular all-determining path to 'hacking', as it comes from knowledge from all areas that eventually coalesce into a general intuition. Although this is true, there are still two common rapid learning paths to 'hacking'. I'll try not to use too many technical terms.\n\n&#x200B;\n\nThe first is the simple, effortless and result-instant path. This involves watching youtube videos with green and black thumbnails with an occasional anonymous mask on top teaching you how to download well-known tools used by thousands daily - or in other words the 'Kali Linux Copy Pasterino Skidder'. You might do something slightly amusing and gain bit of recognition and self-esteem from your friends. Your hacks will be 'real', but anybody that knows anything would dislike you as they all know all you ever did was use a few premade tools. The communities for this sort of shallow result-oriented field include [r/HowToHack](https://www.reddit.com/r/HowToHack) ~~and probably r/hacking as of now~~.\n&#x200B;\n\n\nThe second option, however, is much more intensive, rewarding, and mentally demanding. It is also much more fun, if you find the right people to do it with. It involves learning everything from memory interaction with machine code to high level networking - all while you're trying to break into something. This is where Capture the Flag, or 'CTF' hacking comes into play, where you compete with other individuals/teams with the goal of exploiting a service for a string of text (the flag), which is then submitted for a set amount of points. It is essentially competitive hacking. Through CTF you learn literally everything there is about the digital world, in a rather intense but exciting way. Almost all the creators/finders of major exploits have dabbled in CTF in some way/form, and almost all of them have helped solve real-world issues. However, it does take a lot of work though, as CTF becomes much more difficult as you progress through harder challenges. Some require mathematics to break encryption, and others require you to think like no one has before. If you are able to do well in a CTF competition, there is no doubt that you should be able to find exploits and create tools for yourself with relative ease. The CTF community is filled with smart people who can't give two shits about elitist mask wearing twitter hackers, instead they are genuine nerds that love screwing with machines. There's too much to explain, so I will post a few links below where you can begin your journey.\n\n&#x200B;\n\nRemember - this stuff is not easy if you don't know much, so google everything, question everything, and sooner or later you'll be down the rabbit hole far enough to be enjoying yourself. CTF is real life and online, you will meet people, make new friends, and potentially find your future.\n\n&#x200B;\n\nWhat is CTF? (this channel is gold, use it) - [https://www.youtube.com/watch?v=8ev9ZX9J45A](https://www.youtube.com/watch?v=8ev9ZX9J45A)\n\nMore on /u/liveoverflow, [http://www.liveoverflow.com](http://www.liveoverflow.com) is hands down one of the best places to learn, along with r/liveoverflow\n\nCTF compact guide - [https://ctf101.org/](https://ctf101.org/)\n\nUpcoming CTF events online/irl, live team scores - [https://ctftime.org/](https://ctftime.org/)\n\nWhat is CTF? - [https://ctftime.org/ctf-wtf/](https://ctftime.org/ctf-wtf/)\n\nFull list of all CTF challenge websites - [http://captf.com/practice-ctf/](http://captf.com/practice-ctf/)\n\n\\> be careful of the tool oriented offensivesec oscp ctf's, they teach you hardly anything compared to these ones and almost always require the use of metasploit or some other program which does all the work for you.\n\n* [**http://pwnable.tw/**](http://pwnable.tw/) (a newer set of high quality pwnable challenges)\n* [**http://pwnable.kr/**](http://pwnable.kr/) (one of the more popular recent wargamming sets of challenges)\n* [**https://picoctf.com/**](https://picoctf.com/) (Designed for high school students while the event is usually new every year, it's left online and has a great difficulty progression)\n* [**https://microcorruption.com/login**](https://microcorruption.com/login) (one of the best interfaces, a good difficulty curve and introduction to low-level reverse engineering, specifically on an MSP430)\n* [**http://ctflearn.com/**](http://ctflearn.com/) (a new CTF based learning platform with user-contributed challenges)\n* [**http://reversing.kr/**](http://reversing.kr/)\n* [**http://hax.tor.hu/**](http://hax.tor.hu/)\n* [**https://w3challs.com/**](https://w3challs.com/)\n* [**https://pwn0.com/**](https://pwn0.com/)\n* [**https://io.netgarage.org/**](https://io.netgarage.org/)\n* [**http://ringzer0team.com/**](http://ringzer0team.com/)\n* [**http://www.hellboundhackers.org/**](http://www.hellboundhackers.org/)\n* [**http://www.overthewire.org/wargames/**](http://www.overthewire.org/wargames/)\n* [**http://counterhack.net/Counter\\_Hack/Challenges.html**](http://counterhack.net/Counter_Hack/Challenges.html)\n* [**http://www.hackthissite.org/**](http://www.hackthissite.org/)\n* [**http://vulnhub.com/**](http://vulnhub.com/)\n* [**http://ctf.komodosec.com**](http://ctf.komodosec.com)\n* [**https://maxkersten.nl/binary-analysis-course/**](https://maxkersten.nl/binary-analysis-course/) (suggested by /u/ThisIsLibra, a practical binary analysis course)\n* [**https://pwnadventure.com**](https://pwnadventure.com/) (suggested by /u/startnowstop)\n\n&#x200B;\n\n[http://picoctf.com](http://picoctf.com/) is very good if you are just touching the water.\n\nand finally,\n\n[r/netsec](https://www.reddit.com/r/netsec) \\- where real world vulnerabilities are shared.",
        "num_comments": 986,
        "comments": [
            "We should make this a sticky, we could reduce 50% of the posts here.",
            "Been subbed here for about 2 months, this is the first post I actually found worthwhile, thanks.",
            "I think that you missed the third way which may be linked to ctf path but they can be independent. Read read and read books and articles about how things work in network and computer world. If you are doing ctf you will need to read and learn how things work but you still can read without ctf.",
            "I study engineering (optics and lasers) and information security/hacking has always fascinated me. Many thanks for this.",
            "I’m really interested in becoming an ethical hacker. I’m getting a late start at the age of 30 and I am not very familiar with any of it, but I am pretty good with electronics and software. Im gonna humble brag a little but I think I have a good mind for it. I’m a critical thinker/can think outside the box and I’m a good problem solver maybe even a problem solving addict lol. The idea of doing it for a living isn’t just a dream it’s something I am willing to give my all. Thank you for this information. Does anyone have any recommendations for a starter machine and OS that would be best as I learn and progress?",
            "It's time to finally draw a line between hackers and cybersecurity researchers. I'm tired of walking into hacking rooms only to find a bunch of neckbeards talking about \"being ethical.\"\nNo offense to anyone, but when can we finally say that cybersecurity is not hacking and a rectangle is not a square? Clarity please!",
            "Four years later and this is still a gold mine.",
            "So... which path are you personally recommending?",
            "Want to start hacking. Lesson 101 is social engineering.",
            "this post changed my understanding of 'hacking'"
        ]
    },
    "Sub banner contest 2024": {
        "title": "Sub banner contest 2024",
        "score": 29,
        "url": "https://www.reddit.com/r/hacking/comments/1ahkbke/sub_banner_contest_2024/",
        "content": "New year new you\n\nThis sub needs a new banner for both old.reddit.com and new.reddit.com\n\nThis is a call to arms for any of our resident gfx designers out there. If I tried to make it, it would look like a cracked out Albert Gonzalez, Conor Fitzpatrick, or Roman Seleznev made it in MS Paint. We need halp.\n\nFor banner size specs on new:\n\nhttps://www.reddit.com/r/redesign/comments/87uu45/usage_guidelines_for_images_in_the_redesign/\n\nFor banner size specs on old:\n\nhttps://www.reddit.com/r/BannerRequest/wiki/index/artguide/#wiki_sizing_guidelines.3A\n\nNo real theme or guidance besides make it hacking culture related. Let your imagination flow. \n\nJust submit something and then I guess we will hold a community poll to pick the winner out of whatever is submitted.\n\nThanx",
        "num_comments": 5,
        "comments": []
    },
    "NASA hacked a computer that was 22.5 light hours away from earth": {
        "title": "NASA hacked a computer that was 22.5 light hours away from earth",
        "score": 305,
        "url": "https://youtu.be/v5wUqhpr07M?si=8lph9O-Akuo4pq5u",
        "content": " \nNasa basically hacked Voyager 1. \nSource: [X.com/NASA](https://x.com/nasa/status/1801665076010611074?s=46) \nVideo: Anton Petrov\n \n",
        "num_comments": 24,
        "comments": [
            "Turns out the people who work at NASA are very smart.",
            "I hate the title. Their motivation wasn’t to prove “us” (who the fuck is “us”?) wrong. It was a proof of concept and as an extension of their directives of exploration and furthering the body of human knowledge. This framing of their accomplishments as motivated by petty, immature attitudes lowers NASA reputation.",
            "People would be very worried if they knew how easy it was the hack satellites from the ground.",
            "I read “light year” instead of light hour and thought that was waaaaay more impressive than it actually was",
            "We need to gas light more so they can do other stuff.",
            "I don't know. Hacking voyager isn't exactly rocket science.",
            "And old.  Iirc, most of the Voyager team is in their 60's and 70's.",
            "A certain 90s movie showed us it's pretty darn easy to hack the planet. So it makes sense.",
            "Should still be a new world record.",
            "\\*raising hand\\* Took 4 hours for data to come in from Voyager 2 on Jupiter Encounter in 1979. In between transmissions we beta tested the internet."
        ]
    },
    "Finished building my DIY war driving setup, using Raspberry Pi, Kismet, and ALFA AWUS1900 ": {
        "title": "Finished building my DIY war driving setup, using Raspberry Pi, Kismet, and ALFA AWUS1900 ",
        "score": 4,
        "url": "https://www.reddit.com/gallery/1dr2fk8",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Do you have this to run on car power? Side note I love the alfa it great.",
            "The box may need a few vents for airflow",
            "Yeah, it runs off a 200W inverter (overkill for this purpose) but it only needs a small fraction of that available power. Only when the car is running it's gonna get power."
        ]
    },
    "It better to start as software developer then move to hacking?": {
        "title": "It better to start as software developer then move to hacking?",
        "score": 2,
        "url": "https://www.reddit.com/r/hacking/comments/1dr9h9w/it_better_to_start_as_software_developer_then/",
        "content": "If I start building projects, apps, websites would it be easier to land a hacking job cause I'm looking a hacking job that combines programming and hacking.Like how hard would it be to get a hacking job without prior experience? If anyone wanna share their experiences.",
        "num_comments": 8,
        "comments": [
            "Moral “Hacking” jobs are in cyber security. Learning app development is helpful, but cloud computing and networking is probably more applicable. It would be incredibly hard to land a “hacking” job without experience. Your first step is to probably stop calling it a “hacking” job. Are you 14?\n\nSinister hacking jobs…. Well talk to your local bad guy boss.",
            "Yes it will help but that alone is just a small piece that is needed. It will be nearly impossible without prior experience in IT/cybersecurity.",
            "You want a cyber security job. \n\nAlso. How will you know what to hack if you do Under how programs or the internet works? Do you understand Google's cloud infrastructure? Do you understand what businesses use at the back end so the websites you visit run? You learn all this stuff in it/cybersecurity courses. You can go on google and learn stuff yourself and then go do hacking bounties but that's probably not going to pay the bills unless your some kind of genius. And if you're asking on here. You probably aren't. (Sorry) . Look into cyber security. Learn to code machine learning models. And start investigating how machine learning and cyber security can be used together. You'll be far Infront of anyone in the field who hasn't yet.",
            "Eh. Neither.\nStart by being creative. \nListen to people's problems. \nTake mental notes.\n\nSee if you can find a way to fix their problem logically.\nNevermind pseudocode: write it out in English. \nMake a workflow. Think of all events.\n\nThe development/coding will come naturally.\nYou need to focus on the blueprint before you build a house.",
            "let me tell you. real hacking and “hAcKiNg jObs” are miles apart. \n\nif you want a hacking job it doesn’t matter what you study get a bunch of certs to impress the HR lady that couldn’t even tell you one of the OSI layers. then run your scans write your report and charge 400-near ∞. \n\nI had pentester jobs where literally all you do is Nesus scans and try to live with yourself.",
            "Security is an extremely wide field - that answer is \"it depends\". If you're interested in software security, and software development security practices, for example auditing source code, then of course being a developer is a must, and you probably need to start there.\n\nIf you're only concerned with social engineering then you might not need to start out with software engineering. Though software development can be generally useful; for example, being able to make fake websites can help social engineering.\n\nI think one misconception people have is that learning is a linear process. That's never the case. People learn from multiple sources, in a variable order. I don't think you'll do any permanent 'damage' by 'learning in the wrong order'.",
            "Once upon a time being a dev meant you could easily make that jump, but not anymore. Even if we set aside the vast differences in technologies that dictated much of this shift, there's the professional requirements aspect that still demands a specialized certificate to become a CS engineer. \n\nNow, if you just want to straight-up become a black hat, that's a whole different story. In this case, you're still best off using physical penetration methods or phishing. As long as humans touch it, their interactions will always be the easiest hacks. If that still doesn't get it for you then go the OSINT route. \n\nNo matter which path you choose, learning the aforementioned black hat ways is still a strong recommendation IMO. If you want to be a White Hat, learn Black Hat to be better. \n\nOnce you learn black hat, you realize the only thing separating the “good guys” from the “bad guys” is a choice that is made every day with every interaction. And, yes, that choice can be changed at the drop of a hat (pun very much intended). You will also understand how easy it is to be well-intended and still make a black hat choice. "
        ]
    }
}