{
    "How to start hacking? The ultimate two path guide to information security.": {
        "title": "How to start hacking? The ultimate two path guide to information security.",
        "score": 11762,
        "url": "https://www.reddit.com/r/hacking/comments/a3oicn/how_to_start_hacking_the_ultimate_two_path_guide/",
        "content": "Before I begin - everything about this should be totally and completely ethical at it's core. I'm not saying this as any sort of legal coverage, or to not get somehow sued if any of you screw up, this is genuinely how it should be. The idea here is **information security.** I'll say it again. **information security.** The whole point is to make the world a better place. **This isn't for your reckless amusement and shot at recognition with your friends.** **This is for the betterment of human civilisation. Use your knowledge to solve real-world issues.**\n\n&#x200B;\n\nThere's no singular all-determining path to 'hacking', as it comes from knowledge from all areas that eventually coalesce into a general intuition. Although this is true, there are still two common rapid learning paths to 'hacking'. I'll try not to use too many technical terms.\n\n&#x200B;\n\nThe first is the simple, effortless and result-instant path. This involves watching youtube videos with green and black thumbnails with an occasional anonymous mask on top teaching you how to download well-known tools used by thousands daily - or in other words the 'Kali Linux Copy Pasterino Skidder'. You might do something slightly amusing and gain bit of recognition and self-esteem from your friends. Your hacks will be 'real', but anybody that knows anything would dislike you as they all know all you ever did was use a few premade tools. The communities for this sort of shallow result-oriented field include [r/HowToHack](https://www.reddit.com/r/HowToHack) ~~and probably r/hacking as of now~~.\n&#x200B;\n\n\nThe second option, however, is much more intensive, rewarding, and mentally demanding. It is also much more fun, if you find the right people to do it with. It involves learning everything from memory interaction with machine code to high level networking - all while you're trying to break into something. This is where Capture the Flag, or 'CTF' hacking comes into play, where you compete with other individuals/teams with the goal of exploiting a service for a string of text (the flag), which is then submitted for a set amount of points. It is essentially competitive hacking. Through CTF you learn literally everything there is about the digital world, in a rather intense but exciting way. Almost all the creators/finders of major exploits have dabbled in CTF in some way/form, and almost all of them have helped solve real-world issues. However, it does take a lot of work though, as CTF becomes much more difficult as you progress through harder challenges. Some require mathematics to break encryption, and others require you to think like no one has before. If you are able to do well in a CTF competition, there is no doubt that you should be able to find exploits and create tools for yourself with relative ease. The CTF community is filled with smart people who can't give two shits about elitist mask wearing twitter hackers, instead they are genuine nerds that love screwing with machines. There's too much to explain, so I will post a few links below where you can begin your journey.\n\n&#x200B;\n\nRemember - this stuff is not easy if you don't know much, so google everything, question everything, and sooner or later you'll be down the rabbit hole far enough to be enjoying yourself. CTF is real life and online, you will meet people, make new friends, and potentially find your future.\n\n&#x200B;\n\nWhat is CTF? (this channel is gold, use it) - [https://www.youtube.com/watch?v=8ev9ZX9J45A](https://www.youtube.com/watch?v=8ev9ZX9J45A)\n\nMore on /u/liveoverflow, [http://www.liveoverflow.com](http://www.liveoverflow.com) is hands down one of the best places to learn, along with r/liveoverflow\n\nCTF compact guide - [https://ctf101.org/](https://ctf101.org/)\n\nUpcoming CTF events online/irl, live team scores - [https://ctftime.org/](https://ctftime.org/)\n\nWhat is CTF? - [https://ctftime.org/ctf-wtf/](https://ctftime.org/ctf-wtf/)\n\nFull list of all CTF challenge websites - [http://captf.com/practice-ctf/](http://captf.com/practice-ctf/)\n\n\\> be careful of the tool oriented offensivesec oscp ctf's, they teach you hardly anything compared to these ones and almost always require the use of metasploit or some other program which does all the work for you.\n\n* [**http://pwnable.tw/**](http://pwnable.tw/) (a newer set of high quality pwnable challenges)\n* [**http://pwnable.kr/**](http://pwnable.kr/) (one of the more popular recent wargamming sets of challenges)\n* [**https://picoctf.com/**](https://picoctf.com/) (Designed for high school students while the event is usually new every year, it's left online and has a great difficulty progression)\n* [**https://microcorruption.com/login**](https://microcorruption.com/login) (one of the best interfaces, a good difficulty curve and introduction to low-level reverse engineering, specifically on an MSP430)\n* [**http://ctflearn.com/**](http://ctflearn.com/) (a new CTF based learning platform with user-contributed challenges)\n* [**http://reversing.kr/**](http://reversing.kr/)\n* [**http://hax.tor.hu/**](http://hax.tor.hu/)\n* [**https://w3challs.com/**](https://w3challs.com/)\n* [**https://pwn0.com/**](https://pwn0.com/)\n* [**https://io.netgarage.org/**](https://io.netgarage.org/)\n* [**http://ringzer0team.com/**](http://ringzer0team.com/)\n* [**http://www.hellboundhackers.org/**](http://www.hellboundhackers.org/)\n* [**http://www.overthewire.org/wargames/**](http://www.overthewire.org/wargames/)\n* [**http://counterhack.net/Counter\\_Hack/Challenges.html**](http://counterhack.net/Counter_Hack/Challenges.html)\n* [**http://www.hackthissite.org/**](http://www.hackthissite.org/)\n* [**http://vulnhub.com/**](http://vulnhub.com/)\n* [**http://ctf.komodosec.com**](http://ctf.komodosec.com)\n* [**https://maxkersten.nl/binary-analysis-course/**](https://maxkersten.nl/binary-analysis-course/) (suggested by /u/ThisIsLibra, a practical binary analysis course)\n* [**https://pwnadventure.com**](https://pwnadventure.com/) (suggested by /u/startnowstop)\n\n&#x200B;\n\n[http://picoctf.com](http://picoctf.com/) is very good if you are just touching the water.\n\nand finally,\n\n[r/netsec](https://www.reddit.com/r/netsec) \\- where real world vulnerabilities are shared.",
        "num_comments": 986,
        "comments": [
            "We should make this a sticky, we could reduce 50% of the posts here.",
            "I don't know if the CTF path will work for everyone. \n\nI believe some individuals would be better off learning the fundamentals to networking, learning how to work in a Linux environment, and then slowly progressing to a CTF environment.\n\nOtherwise you may end up with someone who can \"do the thing\" but not understand \"the thing\".",
            "Been subbed here for about 2 months, this is the first post I actually found worthwhile, thanks.",
            "There is a MASSIVE flaw in this suggestion. CTF's are amazing to put what you have learned to the test... but CTF's are not going to teach you core fundamentals. Every hacker should aspire to know not only the big picture but all the individual pieces that make up the puzzle.\nNo CTF is going to help you memorize the 4 layers of the TCP/IP stack and the 7 layers of the OSI model. Not that knowing those two things are essential but a basic understanding of Networking (at least) ABSOLUTELY is.\nYou could spend the next year playing with CTF's everyday and only learn a quarter of what you could learn in a single CISCO networking course. I just feel that there is no substitution for really sitting down and studying the craft. Listen to a Defcon talk while you take a free Python class on www.CodeAcademy.com, spend 30 minutes a day on a free class with www.Cybrary.com and another 30 minutes reading one of Kevin Mitnick's book to help immerse yourself into the world and mindset of a hacker. \nI can only speak for myself but I had to break some bad, lazy habits. CyberSecurity saved my life and made me a better person. I feel like a part of that was making myself sit down and crack open a book for at least an hour a day, it helped create discipline. I got a hold of \"The Basics of Hacking and Penetration Testing - by Pat Engebretson on Syngress Press.\" By the time I finished it, I COULD NOT WAIT to restart it because I was getting apparent, noticable results.\nCTF's are totally kickass, I endorse them fully (who the hell wouldn't?!) but if learning is your goal I feel there's faster ways to make gains. When it comes to practice though, there's nothing on earth better than a CTF. \n",
            "Bookmarking this",
            "www.hackthebox.eu is good too.",
            "I think that you missed the third way which may be linked to ctf path but they can be independent. Read read and read books and articles about how things work in network and computer world. If you are doing ctf you will need to read and learn how things work but you still can read without ctf.",
            "another fact to add would be\\~  you need to be committed towards it and have patience. You won't become a hacker over night. You will have to read lots of books related to hacking. To get started you need to have the following requirements.\n\n Programming Languages:\n\nLearn C, Assembly, C++ for system hacking.\n\nLearn any object oriented programming - C++ or Java or C# whichever you are comfortable with\n\nLearn PHP, Python etc for website related hacking\n\nMaster SQL in order to perform SQL Injection on website and retrieving information or gaining unauthorized access to the database\n\n2. Computer Networks\n\nIts a heart of hacking. First learn basics of network. Learn TCP/IP suite and learn how things actually work on the network\n\n3. Linux\n\nGet used to linux environment. In order to start with linux go for Ubuntu since its debian based user friendly OS. Learn commands and get used to commands to ease your work while working on Kali Linux(Linux distro for penetration Testers)\n\n\\-----\n\nAfter all that you should get started with the practicals. To get started with practicals you should have the following things.\n\n1. Virtual Box or VMWare Workstation:\n\nUsed to create virtual environment for practicing hacking and perform penetration testing. Install kali linux, one or more windows OSes and metasploitable linux(intentionally vulnerable linux) in your Virtual box or VMWare workstation.\n\nYou can also install Kali linux on your hard disk and create virtual windows OSes and linux. Choose whichever you are comfortable with.\n\n2. Kali Linux:\n\nIts a debian based linux distro meant for penetration testers. There are n number of tools already built in to distro viz Nmap, Wireshark, Burpsuite, OWASP ZAP, Metasploit to name a few. Learn how to use the tools by either google searching, going through hack related sites and youtube videos. Now use Kali linux to perform penetration testing on windows or metasploitable linux.\n\nIt probably goes without saying that to become a hacker you need some basic computer skills. These skills go beyond the ability to create a Word document or cruise the Internet. You need to be able to use the command line in Windows, edit the registry, and set up your networking parameters.Networking SkillsYou need to understand the basics of networking, such as the following.DHCPSubnettingIPv4IPv6DNSRouters and switches VLANsOSI modelMAC addressing ARPAs hackers are often exploiting these technologies, the better you understand how they work, the more successful you will beLinux SkillsIt is extremely critical to develop Linux skills to become a hacker. Nearly all the tools a hacker uses is developed for Linux and Linux gives us capabilities that we don't have using Windows .Security Concepts & Technologies A good hacker understands security concepts and technologies. The only way to overcome the roadblocks established by the security admins is to be familiar with them. The hacker must understand such things as PKI (public key infrastructure), SSL (secure sockets layer), IDS (intrusion detection system), firewalls, etc .Wireless Technologies  In order to be able to hack wireless, you must first understand how it works. Things like the encryption algorithms (WEP, WPA, WPA2), the four-way handshake, and WPS. In addition, understanding such as things as the protocol for connection and authentication and the legal constraints on wireless technologies. Scripting Without scripting skills, the hacker will be relegated to using other hackers' tools. This limits your effectiveness. Every day a new tool is in existence loses effectiveness as security admins come up with defenses. To develop your own unique tools, you will need to become proficient at least in one of the scripting languages including the BASH shell. These should include one of Perl, Python, or Ruby. Database Skills If you want to be able to proficiently hack databases, you will need to understand databases and how they work. This includes the SQL language .Web Applications Web applications are probably the most fertile ground for hackers in recent years. The more you understand about how web applications work and the databases behind them, the more successful you will be.  In addition, you will likely need to build your own website for phishing and other nefarious purposes .Forensics  To become good hacker, you must not be caught! You can't become a pro hacker sitting in a prison cell for 5 years. The more you know about digital forensics, the better you can become at avoiding and evading detection .The beginner hacker must understand TCP/IP basics, but to rise to the intermediate level, you must understand in intimate details the TCP/IP protocol stack and fields. These include how each of the fields (flags, window, df, tos, seq, ack, etc.) in both the TCP and IP packet can be manipulated and used against the victim system to enable MitM attacks, among other things.  Reverse Engineering Reverse engineering enables you to open a piece of malware and re-build it with additional features and capabilities. Just like in software engineering, no one builds a new application from scratch. Nearly every new exploit or malware uses components from other existing malware. Think Creatively There is ALWAYS a way to hack a system and many ways to accomplish it. A good hacker can think creatively of multiple approaches to the same hack.  Problem-Solving Skills A hacker is always coming up against seemingly unsolvable problems. This requires that the hacker be accustomed to thinking analytically and solving problems. This often demands that the hacker diagnose accurately what is wrong and then break the problem down into separate components. This is one of those abilities that comes with many hours of practice. Persistence A hacker must be persistent. If you fail at first, try again. If that fails, come up with a new approach and try again. It is only with a persistence that you will be able to hack the most secured systems.\n\nAll The Best!",
            "I study engineering (optics and lasers) and information security/hacking has always fascinated me. Many thanks for this.",
            "I’m really interested in becoming an ethical hacker. I’m getting a late start at the age of 30 and I am not very familiar with any of it, but I am pretty good with electronics and software. Im gonna humble brag a little but I think I have a good mind for it. I’m a critical thinker/can think outside the box and I’m a good problem solver maybe even a problem solving addict lol. The idea of doing it for a living isn’t just a dream it’s something I am willing to give my all. Thank you for this information. Does anyone have any recommendations for a starter machine and OS that would be best as I learn and progress?"
        ]
    },
    "Sub banner contest 2024": {
        "title": "Sub banner contest 2024",
        "score": 30,
        "url": "https://www.reddit.com/r/hacking/comments/1ahkbke/sub_banner_contest_2024/",
        "content": "New year new you\n\nThis sub needs a new banner for both old.reddit.com and new.reddit.com\n\nThis is a call to arms for any of our resident gfx designers out there. If I tried to make it, it would look like a cracked out Albert Gonzalez, Conor Fitzpatrick, or Roman Seleznev made it in MS Paint. We need halp.\n\nFor banner size specs on new:\n\nhttps://www.reddit.com/r/redesign/comments/87uu45/usage_guidelines_for_images_in_the_redesign/\n\nFor banner size specs on old:\n\nhttps://www.reddit.com/r/BannerRequest/wiki/index/artguide/#wiki_sizing_guidelines.3A\n\nNo real theme or guidance besides make it hacking culture related. Let your imagination flow. \n\nJust submit something and then I guess we will hold a community poll to pick the winner out of whatever is submitted.\n\nThanx",
        "num_comments": 5,
        "comments": []
    },
    "NASA hacked a computer that was 22.5 light hours away from earth": {
        "title": "NASA hacked a computer that was 22.5 light hours away from earth",
        "score": 166,
        "url": "https://youtu.be/v5wUqhpr07M?si=8lph9O-Akuo4pq5u",
        "content": " \nNasa basically hacked Voyager 1. \nSource: [X.com/NASA](https://x.com/nasa/status/1801665076010611074?s=46) \nVideo: Anton Petrov\n \n",
        "num_comments": 16,
        "comments": [
            "Turns out the people who work at NASA are very smart.",
            "I hate the title. Their motivation wasn’t to prove “us” (who the fuck is “us”?) wrong. It was a proof of concept and as an extension of their directives of exploration and furthering the body of human knowledge. This framing of their accomplishments as motivated by petty, immature attitudes lowers NASA reputation.",
            "People would be very worried if they knew how easy it was the hack satellites from the ground.",
            "Why does this matter",
            "Surprised_pikachu.jpg",
            "I don't know. Hacking voyager isn't exactly rocket science.",
            "And old.  Iirc, most of the Voyager team is in their 60's and 70's.",
            "I just linked the video because it provides information about Voyager 1 in case you or anyone else in this sub is interested, and because I copied somebody's comment from the YouTube section and used it for the title of this reddit post. You obviously don't have to watch the video.",
            "A certain 90s movie showed us it's pretty darn easy to hack the planet. So it makes sense.",
            "Oh yea? Do you think I can teach my dog to do it? \nAnd since the satellite's information is shared globally, do you know of any aliens who might be interested in the data?"
        ]
    },
    "Kadokawa hit by Blacksuit Randomware. Hackers demand over $8,000,000 for 1.5TB of stolen data. Had been lurking for over a month since May 2024.": {
        "title": "Kadokawa hit by Blacksuit Randomware. Hackers demand over $8,000,000 for 1.5TB of stolen data. Had been lurking for over a month since May 2024.",
        "score": 15,
        "url": "https://www.youtube.com/watch?v=eoaEPc-LUY0",
        "content": "",
        "num_comments": 4,
        "comments": [
            "What is Kadokawa?",
            "Can’s see what they’ll achieve from this. Japanese ppl are very zealous with their data. Other than personal info and your email address nothing much to be sold to be honest.",
            "https://en.wikipedia.org/wiki/Kadokawa_Corporation"
        ]
    },
    "South Korean telecom company attacks customers with malware — over 600,000 torrent users report missing files, strange folders, and disabled PCs": {
        "title": "South Korean telecom company attacks customers with malware — over 600,000 torrent users report missing files, strange folders, and disabled PCs",
        "score": 226,
        "url": "https://www.tomshardware.com/tech-industry/cyber-security/south-korean-telecom-company-attacks-torrent-users-with-malware-over-600000-people-report-missing-files-strange-folders-and-disabled-pcs",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Lol, this is going to end well",
            "Oh wow. Should all file a class action lawsuit",
            "This looks like a straight up criminal hacking to me.\n\n\nHoo boy this is going to be good. \n\n\n*Grabs popcorn and chair*",
            "Time to pay for Starcraft.",
            "I'm not sure if Xfinity still does it, but they would know when you're downloading stuff from using Bit Torrent, and they would send you a letter to stop. Lol \n\nWould like to know what the laws are in Korea about ISP and purposely infecting your computer.",
            "imagine torrenting linux mint to run on a vm and this happens.",
            "What? How it is technically done?",
            "i want to know more about the malware",
            "We’re very sorry about the computers that were accidentally bricked and photos lost. Users of our service can reclaim an average of $8/person by filling out this form",
            "This is in Korea isn't it? North Korea at that. I doubt they are even allowed to learn what lawsuits are, let along be compensated for something like this."
        ]
    }
}