{
    "Haircare Advice Megathread - Week of June 22, 2024": {
        "title": "Haircare Advice Megathread - Week of June 22, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/HaircareScience/comments/1dlyw66/haircare_advice_megathread_week_of_june_22_2024/",
        "content": "# Hello r/haircarescience! Welcome to our weekly megathread for haircare advice.\n\nThis is your place to freely ask for personal advice on styling, coloring, product recommendations or any other burning questions you may have about hair care that may not warrant its own thread due to the rules currently in place. \n\n**Medical advice and questions are still prohibited along with spamming and advertising**. \n\nPlease make sure that you include this information when asking a question. This will be enforced.\n\n* Hair type: (fine, coarse, thick, thin)\n* Hair texture: Straight/wavy/curly/coiled\n* History of chemical processing: (Coloring/straightening/perms/use of heat styling)\n* Hygiene regimen: (daily, twice weekly, once weekly shampoo and conditioning)\n* Style: (Blunt cut/layered/bob or waist length)\n* Product regimen: (State products, whether you are actively avoiding sulfates or silicones or following any particular regimen)\n\nThe normal \"source your facts\" rule do not apply here as individual professional opinion mostly comes from personal taste or anecdotal evidence. We simply ask that you don't state your advice as fact. The opinion of one individual may not represent the opinion of a profession as a whole. Hairdressers this is your time to shine!\n\nAny posts asking for personal advice that are made throughout the week will be redirected here. This post will remain stickied until the end of the week.\n\nWe hope you enjoy this format and if you have any feedback please let the mod team know!",
        "num_comments": 69,
        "comments": [
            "[deleted]",
            "i have curly hair (wavy-curly) that is low porosity, my hair is beautiful and shiny in some strands but i have a few strands that are completely destroyed and tangled and frizzy and hard, but the rest of my hair is great except for maybe the front part which always looks like i brushed my curly hair (if you know you know) I've tried all sorts of oils, my hair responds except for those strands! I don't want to purchase any hair masks and/or shea/mango butter, i have alo but why is those strands like that? please help! haha!\n\noh yeah:\n\nI do scrunch my hair and only brush when its wet\n\nMy hair is neither thick/thin its in the middle\n\nI have wavy-curly hair\n\nI've only straightened it once, sometimes put lemon to lighten it\n\ni wash my hair 3 times a week\n\nalmost waist length\n\nhave also tried rosemarry oil for hair growth and it is very hard to find split ends because of my curls\n\nI use pantene, aussie curls, ogx oils, and super nature conditioner, sometimes do masks like honey",
            "I bought Olaplex No.8 Bond Intense Moisture Mask for my bleached hair. I have naturally black hair so I have to bleach it in stages to achieve a light enough shade of blond to dye it a bright colour. Between these bleachings, I use hair masks, including now the No.8.\n\nHowever, the instructions are bit unclear. They say to use on damp clean hair. But do I use it before conditioner? After conditioner? In place of conditioner? I've found official instructions online that says that it can be used in conjunction with their own Olaplex conditioner, so I assume I should it before conditioner and then condition my hair afterwards?",
            "i just recently rebleached my hair and tried using k18 leave in mask last night for the first time. I accidentally did 10 mins for some reason I thought it was 10 and not 4 lol but my hair feels like that “squeaky clean” feeling you get, stripped i guess and stiff this morning. It’s soft but not like it usually is and I followed the K18 mask with Amika The Kure conditioner in the shower, out of the shower I always use Redkin Acidic Bonding Leave in conditioner and Olaplex Bond Repair Oil while damp then blow dry and straighten and seal with Kerastase Elixr. This is my usual routine besides the K18 so could it be that product causing this feeling in my hair and will it go away? I read it’s ok to use for 4-6 washes in the beginning and then every few weeks from there. Will it always make my hair feel like this and should I discontinue using it or does it actually improve overtime?\n\nHair type: Medium, Fine Hair texture: Wavy History of chemical processing: Bleach Blonde, Heat Styled often Hygiene Regime: Hair wash x2 a week Style: Shoulder Length Long Layers\n\nhttps://preview.redd.it/mwkjztxtpx8d1.jpeg?width=3024&format=pjpg&auto=webp&s=e1d2631898c92663626835878733d7545900f912\n\nignore my double chin thx",
            "I am looking for recommendations for hair oil. I used the Umberto Giannini spoil me oil and loved it, but it is now discontinued - link https://www.amazon.co.uk/Umberto-Giannini-Transform-Defrizz-Cruelty/dp/B071XVBX19\n\n\nI am very low maintenance with my hair, rarely blow dry and never straighten it. I have thick long hair and don’t get split ends but it does get quite frizzy. I found that oil was great for making my hair softer and smoother, but I have just finished my last bottle.\n\nAny suggestions would be appreciated.",
            "Hello I need help. I am a nursing student and it is required of us to have black hair. I recently dyed it brown (permanent). It was an impulsive thing I did and didn't think of the consequences. And my frizzy hair has been going back. In 2 months I need it to be black again, and I also need to rebond it. I need help because my mom said it's a bad idea to do both black hair is a requirement for college, and I have frizzy hair. Help. i need to accomplish both.\n\n* Hair type: Thick (frizzy, naturally black)\n* History of chemical processing: (Coloring)\n* Product: Bremod permanent hair color",
            "How often would y’all use bondbar shampoo and conditioner for breakage? (I have slightly wavy fine hair, it’s about bra length, and I usually wash/condition every other day)",
            "I really struggle with bouts of greasy, crunchy hair. My hair will be smooth and shiny for months, and then bam, greasy and nasty with no changes in hygiene habits. This time, I believe it’s due to the fact that I went swimming in a local lake on Saturday. I took a shower and washed my hair after the swim, but my hair felt incredibly greasy. I’ve washed it every day since with my usual shampoo (i usually wash every other day), but it’s still greasy at the scalp and almost dry/crunchy at the bottom. Any ideas? It still doesn’t feel clean, but I’m also afraid that I’m overdoing it with the shampoo and stripping it too much. \n\nThis happens from time to time, usually if I’m exposed to a different water/shampoo combination than usual. Seems to be taking longer than usual to resolve itself though.\n\nEdit to add: straight/wavy hair. Medium length. No colors or treatments. I rarely use heat or products.",
            "You know how if you wear extentions you can still see*\nwhere your hair stops in the middle? Can someone tell\nme why my hair \"naturally\" grows that way? My hair that\ngrows on the bottom grows so long and beautiful but the\nhair that grows on top of my head all stops at my upper\nback region.. my hair is EXTREMELY thin just because\ngenetics, but it also breaks off and looks so damaged\non the top hair, so my hair is really long but only a tiny bit\nof hair is actually long which makes it look ridiculously\nthin(im not looking for advise on thinning as if i can\nget my hair to grow evenly that would help my issue).\nI've tried chopping it all off and letting it regrow and it\ngrows the same exact way! If id have known that i never\nwould have cut my hair I don't use any heat on my\nhair, I only use scrunchies when I pull my hair up, I wear\na silk bonnet to bed, I even use sulphate free shampoo\nand put oil on my hair after, I use detangling spray, and\nhave even tried taking prenatals to give the extra vit and\nminerals, i don't brush when it's wet, i dont scrub my\nhair with a towel (I wrap it for a few minutes to soak up\nsome and the rest air dries in like 20 minutes). Nothing\nchanges it. It also tangles VERY easy because the hair\nstrands are also extremely thin so I've tried brushing\nless, I've tried brushing more, I brush from bottom to top,\n*etc. I do dye it VERY RARELY only because after a LONG\ntime of not dying my hair it still didn't help; so I figured if\nit's going to look like that no matter what might as well\ndye it🤷‍♀️\n\nThis pic was taken a while back so my hair is about 4ish inches longer now but the top layer is still where it's at in this photo (around armpit length) while the hair on the bottom is a LOT longer..so it looks pretty funny..the hair that grows on the bottom of my head will keep growing but the top is stuck at this length, send help!",
            "Is using shampoo with sulfates disastrous after a keratin treatment or is using it once okay?\n\nI got a keratin treatment recently and the main thing impressed upon me by my hair stylist was to only use sulfate-free shampoo. This wasn’t an issue back home in the US since most don’t have sulfates but I’ve been traveling for 10 days in Iceland and Denmark and cannot for the life of me find any sulfate-free shampoo (and stupidly didn’t bring any with me). I’m going on about 2 weeks of not shampooing my hair and it’s getting pretty oily even with my hair being generally very dry + dry shampoo. If I shampoo my hair once with shampoo with sodium laureth sulfate, will that ruin my keratin treatment?? TYIA!\n\nHair type: Coarse\nHair texture: Wavy (straight-ish after keratin treatment)\nHistory: Keratin treatment 3 weeks ago\nHygiene: Usually wash (shampoo/condition) hair once a week, otherwise use shower cap\nStyle: long, past shoulders\nRegimen: Avoiding sulfates"
        ]
    },
    "Haircare Advice Megathread - Week of June 15, 2024": {
        "title": "Haircare Advice Megathread - Week of June 15, 2024",
        "score": 7,
        "url": "https://www.reddit.com/r/HaircareScience/comments/1dgl5cq/haircare_advice_megathread_week_of_june_15_2024/",
        "content": "# Hello r/haircarescience! Welcome to our weekly megathread for haircare advice.\n\nThis is your place to freely ask for personal advice on styling, coloring, product recommendations or any other burning questions you may have about hair care that may not warrant its own thread due to the rules currently in place. \n\n**Medical advice and questions are still prohibited along with spamming and advertising**. \n\nPlease make sure that you include this information when asking a question. This will be enforced.\n\n* Hair type: (fine, coarse, thick, thin)\n* Hair texture: Straight/wavy/curly/coiled\n* History of chemical processing: (Coloring/straightening/perms/use of heat styling)\n* Hygiene regimen: (daily, twice weekly, once weekly shampoo and conditioning)\n* Style: (Blunt cut/layered/bob or waist length)\n* Product regimen: (State products, whether you are actively avoiding sulfates or silicones or following any particular regimen)\n\nThe normal \"source your facts\" rule do not apply here as individual professional opinion mostly comes from personal taste or anecdotal evidence. We simply ask that you don't state your advice as fact. The opinion of one individual may not represent the opinion of a profession as a whole. Hairdressers this is your time to shine!\n\nAny posts asking for personal advice that are made throughout the week will be redirected here. This post will remain stickied until the end of the week.\n\nWe hope you enjoy this format and if you have any feedback please let the mod team know!",
        "num_comments": 101,
        "comments": [
            "shampoo alternative? and dry ends..\n\nI have thin/medium thickness and medium/high porosity straight hair and it goes down to my waist. I use Viori shampoo and conditioner bars and I feel they work wonderfully! However, I workout every day in the mornings and my hair feels fine throughout the day even though I sweat a good amount, but by the morning next day I look like I did a leave in oil treatment lol. im afraid shampooing my hair everyday will dry it out, especially the ends. I looked into the [Raw Sugar Rosemary Hair Rinse](https://rawsugarliving.com/products/vinegar-hair-rinse-rosemary-mint-6-oz) ... would it really be any difference to just shampooing? Is this a solution that prevents my ends from feeling like tumbleweeds?",
            "Hii!! I have low porosity oily hair and live in a tropical hot and humid country. I typically wash my 1A hair every 2 days.\nRecently, i bought a leave in heat protection soy protein treatment, is it okay if i use this every 2 days alongside a hair oil? Or will it cause protein overload?",
            "hair care routine for 1b-1c straight hair male\nlooking into bettering my hair care and starting a full routine, thoughts on products for my hair type, looking to add more volume/thickness to give hair a wavier look:\nMielle Organics Rosemary Scalp Strengthening oil (1x/week)\nVerb Ghost Oil (1x/week)\nLiving Proof Full Shampoo (2-3x/week)\nAveda Rosemary Mint Weightless Conditioner (daily)\nLiving Proof Styling Treatment (1x/week)",
            "Please help me find a shampoo and conditioner that I can use daily? Which ingredients should I avoid to use every day?\n\nHair type: fine or thin.  \nTexture: wavy.  \nHistory of chemical processing: none.  \nHygenie regimen: daily.  \nStyle: layered.  \nProduct regimen: I try to buy cruelty-free and avoid perfume because I'm sensitive to it",
            "Hello you. ♡ I wanted to ask for recommendations for my hair. I do have wavy hair, it's more wavy when it's wet but I am not happy with it. My hair looks kinda not structured and frizzy, especially one day after showering. My routine is daily scalp massage, silk bonnet overnight, washing two times a week. I use RedKen All Soft, Hair Mask Morocco (sadly the heavy version, will buy a light hair mask soon) and sometimes a little bit argan oil in my lengths. I am now thinking about how I can make my hair look more structured and wavy. I read a lot about hair products like cleansing shampoo, leave in conditioner, gel for wavy/curly hair but I don't really know. Maybe some of you can give me some tips. Thanks a lot for reading. ♡♡\n\nhttps://preview.redd.it/8pw0mk3yz48d1.jpeg?width=579&format=pjpg&auto=webp&s=18dded5a8618a60e58bce2fdd5af26dc4e18db8b",
            "Hey y'all! I've always had problems with my hair, and this time it's genuinely become unfixable. For weeks now, my hair has felt almost waxy with product buildup. It also quickly gets greasy/stringy, and neither feeling goes away, even after washing. I tried an Aveda shampoo, Garnier, and a once-a-week clarifying shampoo, all with no results. I also noticed my hair looks wavier than it used to after air drying, but I know it isn't curly & additional moisture just weighs it down. I've also always had issues with greasiness since I was 13-- I'm 19 now. \n\nHair type: thick, wavy/straight hair\n\nHistory of chemicals/heat: Blow dry a few times a week\n\nHygiene: just shampoo every 2 days, no conditioner \n\nStyle: mid-length\n\nProduct regimen: Aveda shampoo\n\nPlease save me! Ponytails are ruining my hairline!! I will literally take any suggestion :\")",
            "https://preview.redd.it/rid45e0nid7d1.png?width=2923&format=png&auto=webp&s=e7bd50fdd475598038495076a0d53d6287762eff\n\nnew growth or breakage? Ive gotten this hairs ever since i started using rosemary oil and they have grown steadily but apparently rosemary oil doesn’t work for hair growth now? Ive been told by others (not haircare professionals though.) that it doesn’t look or feel like breakage but I’m just paranoid. Thanks!",
            "https://preview.redd.it/u7m1xeud8d7d1.jpeg?width=2316&format=pjpg&auto=webp&s=9d27fab444bb776fa58ce8595af087b3d332004b\n\nLooking for ways to make my breakage less frizzy. A baby pulled my hair and broke it straight off and the hairs will not chill out no matter what I do.\n\nHair type: fine but thick if that makes sense?\n\nHair texture: fairly straight- maybe a slight wave but when I brush my hair I usually lose any wave (except my baby hairs)\n\nHistory of chemical processing: salon balayage and deep conditioning. I rarely blow dry my hair but when I do I use the Dyson air straight. I never straighten or curl my hair.\n\nHygiene/product regimen: condition every other day with verb ghost conditioner, deep condition once a week with amika orange deep conditioner, shampoo once a week with amika pink shampoo, purple conditioner once or twice a month (either verb or amika), always do a leave in conditioner (I’ve been experimenting with brands but usually either verb, amika, or JVN) and then after the leave in I put in some ghost oil.  I use a tangle teaser brush\n\nStyle: very long hair, super long layers and a slight angle",
            "Hair type: probably thin?\nHair texture: Straight\nHistory of chemical processing: none\nHygiene regimen: twice weekly, just shampol\nStyle: i dunno \nProduct regimen: some generic normal shampoo, im new to this stuff.\n\nI need help with identifying whether my hair is oily or dry.\n\nI tried looking in many thread and they hardly help.\n\nSo this is what i know about my hair.\n\n1. It can get oily, greasy, dirty after many days of not showerimg/shampoo (never use conditioner in a long time), i assume this is normal.\n2. After a day or two shampooing, my scalp, is itchy, makes me want to... itch it.\n3. It is flakey as well.\n4. I don't think i have dandruff, but it is possible i mistaken dandruff with flakey as well.\n\nI thought i had oily hair but reviewing what i know about my hair, my scalp is more likely a dry one than oily,.no?\n\nI need your guys opinion.\n\nI am also planning to buy that expensive Nazarol shampoo, but the problem is that it is expensive than your normal shampoo, and I'm not sure if my scalp has a dandeuff problem or not.",
            "What causes a halo of frizz ?\n\nI’ve heard multiple things and have tried multiple things. I usually airdry my hair , might use gel or hair oil but no matter how much I moisturize  or use anti frizz, my hair ends up with a halo of frizz. I’ve tried living proof,etc\n\nDo I need olaplex ? More protein? K18? Silicones ?I live in NYC and I’m Latina. This is my natural hair texture. Im not sure my texture, I have been told coarse, normal and “fine but with just a lot of hair”. I wash 2-3x a week. I don’t bleach my hair or use heat styling, I sometimes do a henna gloss.\n\nRecently ive been using Davines volume shampoo and Davines vegetarian miracle so I often use silicone free and sulfate free. I put Kinky Curly gel in wet hair . Sometimes I put an oil over it but doesn’t make any difference .\n\nhttps://preview.redd.it/vyb18a8uuk7d1.jpeg?width=1072&format=pjpg&auto=webp&s=289fe5456ad54fc4ed9c775dd0703744be650dfc"
        ]
    },
    "Is washing twice a day damaging my hair?": {
        "title": "Is washing twice a day damaging my hair?",
        "score": 2,
        "url": "https://www.reddit.com/r/HaircareScience/comments/1dr58e3/is_washing_twice_a_day_damaging_my_hair/",
        "content": "I (Male) have straight, fine hair. Probably 1A. I use a couple sprays of Sea Salt Spray and some hair paste to style my hair every day. I've been washing it out every night, but I don't know if that's damaging to my hair. I only use water on most days, and use shampoo and conditioner about 1-2 times per week.\n\nIs this damaging to my hair?",
        "num_comments": 5,
        "comments": [
            "If you use a lot of pasta and salt you should buy a product that will clean remains of them from your skin.\n\nUsing only water won't damage your hair (there is a chance it will if water is very hard). Use shampoo only when you need it. I use it every three days. That's all there is to say.",
            "It's way more likely for your hair to be damaged by using the sea salt daily than the rinsing. It's usually not recommended as an everyday product because salt draws moisture out of the hair and swells the cuticle of the hair (generally things that open/rough up the cuticle are a source of hair damage). So I'd be way more worried about that than the rinsing. Generally rinsing is fine, but with that said, hair is in its most vulnerable state when wet, it's more prone to stretching and stuff like that. So if you've got long hair, that's more of a problem than if you've got short hair where it's likely to not cause an issue unless you're somehow being rough on your hair while it's wet even though it's short",
            "Using water is not washing your hair.  It’s just rinsing it.  I wash my hair twice a day most of the time.  Use a very mild shampoo that doesn’t dry or strip your hair.  And occasionally, use a clarifying shampoo since that hair paste can build up.  \n\nBut as of now, you don’t wash your hair daily.  You wash it 1-2 times a week.  The rest of the time, you just get it wet.",
            "Only using water is damaging to your hair. Use a lightweight shampoo and hydrating conditioner every time you wash. If you’re noticing buildup add a clarifying shampoo once every couple weeks.",
            "We noticed you mentioned moisturizing hair. Please view [this archived post](https://www.reddit.com/r/HaircareScience/comments/lmmlcn/does_water_actually_make_hair_feel_moisturized/) on this topic. If this isn't relevant to your comment, please disregard.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HaircareScience) if you have any questions or concerns.*"
        ]
    },
    "Hair texture changed!": {
        "title": "Hair texture changed!",
        "score": 2,
        "url": "https://www.reddit.com/r/HaircareScience/comments/1dr3ysk/hair_texture_changed/",
        "content": "I have pin-straight hair. Whenever I wash my hair, after a few hours there are literally no waves visible. \nI've been on a vacation to the US since the last 2 weeks and I've noticed that my hair is becoming a bit wavy from the bottom. I don't know why this is happening. Is this a cause of worry or what \nFor context, I live in India ",
        "num_comments": 0,
        "comments": []
    },
    "My hair was incredibly oily I made the big chop and now its really dry": {
        "title": "My hair was incredibly oily I made the big chop and now its really dry",
        "score": 4,
        "url": "https://www.reddit.com/r/HaircareScience/comments/1dqog3p/my_hair_was_incredibly_oily_i_made_the_big_chop/",
        "content": "Does anyone know why this is happening. My hair used to be at an average length a good few centimetres under my cleavage. And the thing is, it was very oily. Like awful a day after washing oily. I had just about starting to learn how to manage it and getting it to behave and stay longer between washes etc when after years of contemplating I decided to get the big chop and go for a bixie.\n\nI really *really* love my new hair. Its very low maintenance and just awesome all around. But I started noticing that instead of oily it is actually dry. Like needs more conditioner than my longer hair dry. I've started investing in stuff like hair masks, dry conditioner etc but does anyone why this is? And any tips to share from experience?\n\nBTW my hair is straight/very slightly wavy",
        "num_comments": 0,
        "comments": []
    }
}