{
    "Haircare Advice Megathread - Week of June 22, 2024": {
        "title": "Haircare Advice Megathread - Week of June 22, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/HaircareScience/comments/1dlyw66/haircare_advice_megathread_week_of_june_22_2024/",
        "content": "# Hello r/haircarescience! Welcome to our weekly megathread for haircare advice.\n\nThis is your place to freely ask for personal advice on styling, coloring, product recommendations or any other burning questions you may have about hair care that may not warrant its own thread due to the rules currently in place. \n\n**Medical advice and questions are still prohibited along with spamming and advertising**. \n\nPlease make sure that you include this information when asking a question. This will be enforced.\n\n* Hair type: (fine, coarse, thick, thin)\n* Hair texture: Straight/wavy/curly/coiled\n* History of chemical processing: (Coloring/straightening/perms/use of heat styling)\n* Hygiene regimen: (daily, twice weekly, once weekly shampoo and conditioning)\n* Style: (Blunt cut/layered/bob or waist length)\n* Product regimen: (State products, whether you are actively avoiding sulfates or silicones or following any particular regimen)\n\nThe normal \"source your facts\" rule do not apply here as individual professional opinion mostly comes from personal taste or anecdotal evidence. We simply ask that you don't state your advice as fact. The opinion of one individual may not represent the opinion of a profession as a whole. Hairdressers this is your time to shine!\n\nAny posts asking for personal advice that are made throughout the week will be redirected here. This post will remain stickied until the end of the week.\n\nWe hope you enjoy this format and if you have any feedback please let the mod team know!",
        "num_comments": 70,
        "comments": [
            "How often would y’all use bondbar shampoo and conditioner for breakage? (I have slightly wavy fine hair, it’s about bra length, and I usually wash/condition every other day)",
            "ahhh looking for a leave in product rec from kerastase. I don’t usually use silicones on my fine, dry, wavy hair but I’ve heard good things about amodimethicone as an ingredient. There’s a mask that’s basically that or I was also looking at the curl cream Which is mostly sunflower oil and honey. They both seem like good options? ",
            "I'm more just coming here to complain a moment. I saw something that sounded like absolute BS--that some Lush conditioner caused someone's hair to become brittle and break. I'm just a fan of the products.. and it took me down this whole rabbit hole of hair care. They kept discussing protein sensitivity, protein overload.. and I was like 'protein doesn't cause hair to become brittle or break.' And people Absolutely got angry about it. Saying I was pretending this isn't real, that the science IS the anecdotal stories from people, implying I was gaslighting people, etc. etc. I ended up on this subreddit explaining this ad nauseum and probably posted 20 links before I just gave up and said forget it, believe whatever yall want. \n\nBut, this subreddit is really cool, so in the end it was worth all the big mad people insisting protein overload is real to find this place at all! Happy to be in a more nuanced subreddit.",
            "I bought Olaplex No.8 Bond Intense Moisture Mask for my bleached hair. I have naturally black hair so I have to bleach it in stages to achieve a light enough shade of blond to dye it a bright colour. Between these bleachings, I use hair masks, including now the No.8.\n\nHowever, the instructions are bit unclear. They say to use on damp clean hair. But do I use it before conditioner? After conditioner? In place of conditioner? I've found official instructions online that says that it can be used in conjunction with their own Olaplex conditioner, so I assume I should it before conditioner and then condition my hair afterwards?",
            "If I decide to mainly cowash and shampoo every once in a while, should I use a conditioner and shampoo with or without silicones?",
            "I'm a 26M living in the Midwest and I have thick hair that often gets dandruff. My doctor prescribed me a 2% ketoconazole shampoo, which I follow up with Dove conditioner twice a week. When I use the shampoo and conditioner, my hair becomes somewhat silky and smooth. However, starting the next day, it gets tangled and sticky, and I notice a lot of damaged hair when I comb. Also, my doctor mentioned that because I have thick hair, the shampoo doesn’t spread well on my scalp.  I need advice on how to prevent my hair from getting damaged and become sticky. I would greatly appreciate any help. Thank you!",
            "everyday after i shower i lightly coat my hands in oil and massage it into my scalp. is this healthy?",
            "I need a good keratin safe shampoo. Anyone know if any of the goldwell ones are?",
            "Is sodium benzonate bad for keratin bc I know sodium chloride is a big thing to avoid w a keratin treatment",
            "As Moroccan Oil has formulated this product specifically as heat protectant and give guidelines that product could be used on either damp or dry hair I don’t see problem with oils as part of formula."
        ]
    },
    "Haircare Advice Megathread - Week of June 15, 2024": {
        "title": "Haircare Advice Megathread - Week of June 15, 2024",
        "score": 7,
        "url": "https://www.reddit.com/r/HaircareScience/comments/1dgl5cq/haircare_advice_megathread_week_of_june_15_2024/",
        "content": "# Hello r/haircarescience! Welcome to our weekly megathread for haircare advice.\n\nThis is your place to freely ask for personal advice on styling, coloring, product recommendations or any other burning questions you may have about hair care that may not warrant its own thread due to the rules currently in place. \n\n**Medical advice and questions are still prohibited along with spamming and advertising**. \n\nPlease make sure that you include this information when asking a question. This will be enforced.\n\n* Hair type: (fine, coarse, thick, thin)\n* Hair texture: Straight/wavy/curly/coiled\n* History of chemical processing: (Coloring/straightening/perms/use of heat styling)\n* Hygiene regimen: (daily, twice weekly, once weekly shampoo and conditioning)\n* Style: (Blunt cut/layered/bob or waist length)\n* Product regimen: (State products, whether you are actively avoiding sulfates or silicones or following any particular regimen)\n\nThe normal \"source your facts\" rule do not apply here as individual professional opinion mostly comes from personal taste or anecdotal evidence. We simply ask that you don't state your advice as fact. The opinion of one individual may not represent the opinion of a profession as a whole. Hairdressers this is your time to shine!\n\nAny posts asking for personal advice that are made throughout the week will be redirected here. This post will remain stickied until the end of the week.\n\nWe hope you enjoy this format and if you have any feedback please let the mod team know!",
        "num_comments": 101,
        "comments": [
            "So for context, I have shoulder length hair and bad dandruff. wash my hair every 3rd day with off the shelf medical shampoo but it is not working properly. Also, since my hair are damaged get breakage and fall excessively. I definitely don't know how to maintain the hair and wash them properly (time periods and methods) checked this sub and find this most common thing that people don't know how to wash their hair. My hair type is black, wavy.",
            "Hi! I’m looking to grow my hair more and reduce damage caused by black box dye over the past few years. My hair is pin straight but not paper thin, while not being thick either. It reaches my waist but is thinning significantly at the ends. I use a drug store shampoo and conditioner without containing sulfate in the shampoo. I wash my hair once every fortnight (I’ve trained it ahaha) and I may use other products like oils between washes. I use heat to dry my hair but I always use a heat protectant and I only heat style once in a blue moon. Let me know any products to help! Thanks!",
            "Hii!! I have low porosity oily hair and live in a tropical hot and humid country. I typically wash my 1A hair every 2 days.\nRecently, i bought a leave in heat protection soy protein treatment, is it okay if i use this every 2 days alongside a hair oil? Or will it cause protein overload?",
            "I've seen many derms mention Ketoconazole for hair loss prevention/early treatment. Is there any evidence Pircotone Olamine (different anti-fungal) might have similar benefits? Or is Ketoconazole unique in this?",
            "Hello everyone! I am 27f and from India. I have recently discovered that I have wavy hair and need suggestions/tips regarding routine and products. My hair is low porosity and it might be 2b/2c. I have never colored or bleached my hair or any heat treatment except while styling during a chop off. Thanks in advance!\nEdit-I also have dandruff and my hair is shoulder length. I am planning to use Re'quil Murumuru conditioner as it's beginner friendly.I wash my hair twice a week due to oily dandruff prone scalp.",
            "I need help badly my hair is curly frizzy and I have dry scalp!! What do I do... Ugh I don't know what to use",
            "Im tired of having super frizzy and poofy hair. I shampoo and condition every 2 days to control my dandruff but it makes my hair unstylable. I have thick low porosity hair. Longest i went without shampoo was about 3 weeks and it looked and felt exactly how i wanted it to. But i got huge dandruff and my head itched. I ended up getting large bumps on my head, 3 of them. I started washing again and itchyness went away. Dandruff is smaller and bumps i think are here to stay. What should i do?",
            "Looking for a dupe or similar product to Pantene's essential oils volumizing shampoo and conditioner with mint and ginseng. I love what this does for my hair, but I believe it was discontinued. Any suggestions would be great! Thanks!",
            "I've seen many derms mention Ketoconazole for hair loss prevention/early treatment. Is there any evidence Pircotone Olamine (different anti-fungal) might have similar benefits?   \n  \nOr is Ketoconazole unique in this?",
            "I have been using Nutrafol balance for eight months now and while I love it, I think their customer service sucks. Any suggestions for a replacement? Thank you."
        ]
    },
    "Are silicones good for hair or not?": {
        "title": "Are silicones good for hair or not?",
        "score": 7,
        "url": "https://www.reddit.com/r/HaircareScience/comments/1dr7u2n/are_silicones_good_for_hair_or_not/",
        "content": "Hi guys, basically just the title. Ive abandoned silicones for a long time because back in 2020 I’ve read that it can cause build up and damage hair in the long run by preventing product penetration, but recently have been seeing the opposing discourse that it protects your hair shaft by forming a layer on top. Idk what view on silicones is the most scientifically credible, they both sound pretty reasonable to me. \n\nI do miss when my hair was quite shiny looking due to silicones, and am thinking of bringing it back IF it isn’t bad for my hair. So what are your opinions?\n\nHair info: very very thin, bleached highlights, don’t think it’s damaged but can easily be, somewhat frizzy, wavy\n",
        "num_comments": 4,
        "comments": [
            "In my view, the debate on silicones in hair care depends on what works best for your hair. They can make hair shiny and smooth by forming a protective layer, which is beneficial for thin, bleached hair like yours. However, be mindful of potential buildup over time. Using silicone products sparingly and ensuring you can easily wash them out might help you achieve the shine you want without harming your hair.",
            "Thank u!",
            "The tldr of it all is no, they are not harmful to the hair or scalp. \n\n[Here's a megapost from 10 months ago](https://www.reddit.com/r/HaircareScience/comments/15rq4hq/are_silicones_mainly_dimethicone_deserving_of/jwbkgcs/) exploring the most common myths regarding silicones.",
            "Check out lab muffin beauty. She goes into a lot of this stuff on YouTube. Here’s one of her videos [here](https://youtu.be/ri_SqZVthaU?si=0uMmO9DaDnQsydza) where she discussed it."
        ]
    },
    "Ketoconazole long term use": {
        "title": "Ketoconazole long term use",
        "score": 4,
        "url": "https://www.reddit.com/r/HaircareScience/comments/1dr8eji/ketoconazole_long_term_use/",
        "content": "Hi all,\n\nQuick question as I can’t really find much about this online.\n\nI’ve found that ketoconazole 2% shampoo works for my scalp over the years. I’ll usually use it for a few months until I run out then stop using it until my scalp flares back up. \n\nThe directions say to use monthly once flare up has gone to keep symptoms at bay. Does this mean I’ll need to use this product for the rest of my life? Does anyone know/ have a success story where they’ve used this and not had any issues since? I wonder if I’m using it wrong (despite following instructions) or if I’m just doomed to buy this shampoo forever.\n\nThanks in advance !! ",
        "num_comments": 1,
        "comments": [
            "Seb derm is a chronic health condition, so it’s likely not going away forever unless something changes in your hormones over a long time. You just manage it, I alternate between ketoconazole for flare ups and 1% zinc for everyday maintenance."
        ]
    },
    "Curly Dry Hair (Caucasian) ": {
        "title": "Curly Dry Hair (Caucasian) ",
        "score": 2,
        "url": "https://www.reddit.com/r/HaircareScience/comments/1dr9sb0/curly_dry_hair_caucasian/",
        "content": "I bleached my long curly hair last year (awful idea it destroyed it completely), then dyed it brown and cut it short— so it’s been growing out and healing over the past year and a half or so.\n\nStill, my hair is quite dry at the best of times. I wash with shampoo maybe once a week but I wash it daily with just conditioner and it goes all soft, until the next day where it’s all dry again— making a bit of a cycle. I don’t really care for anything that defines my curls, but ideally I want a routine for my hair that is hyper healthy (then again i’m assuming healthy hair would be curl definitive). \n\nI tried this honey olive oil mayo mask I read online the other day and have been doing my usual wash with conditioner and it’s made a little difference but i feel i can do a lot better. \n\nThe water quality for showers is from the United Kingdom, if this makes any difference at all. ",
        "num_comments": 0,
        "comments": []
    }
}