{
    "Reminder: Zero Tolerance for Racism and Bigotry": {
        "title": "Reminder: Zero Tolerance for Racism and Bigotry",
        "score": 134,
        "url": "https://www.reddit.com/r/halifax/comments/1dpf4mp/reminder_zero_tolerance_for_racism_and_bigotry/",
        "content": "Hello r/Halifax, \n\nWe want to remind everyone that racism, bigotry, and any form of hate speech are strictly prohibited in our community. Engaging in such behaviour will result in an immediate ban, as outlined in our “Respect and Constructive Engagement” and “Safe and Legal Posting” rules. \n\nPlease think before you post, and help us maintain a respectful and welcoming environment where everyone can feel safe to participate. If you encounter content that violates these rules, please use the report button promptly. \n\nThank you for helping us keep r/Halifax a great place for everyone!\n\nYour r/Halifax Modteam ",
        "num_comments": 0,
        "comments": []
    },
    "Things to do in HRM this Month — July 2024": {
        "title": "Things to do in HRM this Month — July 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/halifax/comments/1dps9d7/things_to_do_in_hrm_this_month_july_2024/",
        "content": "Post your suggestions and announcements for events and goings on in HRM for others to know about!\n\nIf you like to host your own events or meetups this is also allowed on here.\n\n**Note:** Self-promotion is allowed in this thread\n\n[Previous months' thread](https://www.reddit.com/r/halifax/comments/1d5kelx/things_to_do_in_hrm_this_month_june_2024/)",
        "num_comments": 11,
        "comments": [
            "There is a country wide protest on July 1st I might attend",
            "the kite festival is July 6 and 7",
            "Oh, I was hoping for some one-on-one combat using phasers or light sabres or whatever the new fantasy weapon is nowadays. Damn! Oh well, there's always Pride...",
            "Tiki Tours Halifax!",
            "I protest your attendance.",
            "As is your right! As long as you remain nonviolent your protest has my support",
            "There are many events planned for July 1. See them all at https://www.hrmcanadaday.ca",
            "https://preview.redd.it/ubpa907mef9d1.jpeg?width=1170&format=pjpg&auto=webp&s=7b0511d879e293ac49df2b76cc94379506043c3c\n\n(Im considering it a July event, because it goes into the early morning hours of the first, haha) Starts at about 10 after the Sunday Sesh!!",
            "Actual Wizard - live magic show July 27 at 7:30 pm at the Bus Stop Theatre\n\nhttp://actualwizard.ca",
            "[removed]"
        ]
    },
    "The email I sent to my MP Andy Fillmore in January regarding immigration (and his response)": {
        "title": "The email I sent to my MP Andy Fillmore in January regarding immigration (and his response)",
        "score": 32,
        "url": "https://www.reddit.com/r/halifax/comments/1dranoc/the_email_i_sent_to_my_mp_andy_fillmore_in/",
        "content": "# Concerns Over Immigration:\n\nHello,\n\nI am writing to express my immense dissatisfaction with the Liberal Party's handling of immigration in 2023. Like many Canadians, one of my parents immigrated to this country, and I believe strongly in the benefits of immigration when it happens in a sustainable manner. However, it cannot continue at present rates. The absurd influx of people that is presently taking place, while our healthcare and housing systems are already overburdened, is killing people. There is no reason to beat around the bush. Liberal policy has forced people out of homes and hospital appointments, in the sole interest of appeasing big business. This is a disgusting betrayal of working- and middle-class Canadians, and one that as I voter I will not soon forget. It is essential that we severely limit immigration in the coming years (preferably only allowing in people who will help with the aforementioned healthcare and housing shortages), until we have returned to a more stable and sustainable footing.\n\nWithout a complete one-eighty on current policy, I cannot conscionably vote for the Liberal Party again.\n\nYours sincerely,\n\n[My name]\n\n[Postal code]\n\n---\n\n\n# Fillmore’s Response:\n\nHi [my name], thank you for your message. Canada has certainly seen tremendous growth in the last couple years, and we are struggling with the challenges of that growth in areas like housing and health care. Immigration is an important part of Canada's story and our success, but of course we need to have immigration policies that ensure everyone can share in and contribute our prosperity. I was pleased to see this addressed by Minister of Immigration Marc Miller last month when he put a cap on non-permanent residents - ie, international students - for the next two years. I agree we must ensure that the pace of our growth is aligned with our ability to provide the necessary services to Canadians and permanent residents. I have raised this issue with my colleagues in Ottawa. \n\nThank you for making your views known and please stay in touch. \n\n-Andy.",
        "num_comments": 100,
        "comments": [
            "This is just a nice way of saying, they don't care what the peasants think",
            "Current issues with healthcare and housing are the cause of multiple failures by all 3 levels of government, yes, unchecked immigration levels has put painful pressure on our healthcare and housing but it's not the whole picture. Should we tie immigration levels to available or created housing? Yes. Will it solve all the issues? No. \n\nSide note: a liberal (lower case for a reason) being smug and not caring about common opinions because their farts are the only ones that smell like roses? Color me shocked.",
            "I (unfortunately) think hell still win if he runs for mayor; regardless of his lame response.\n\nThe rats are bailing on the sinking ship of the Liberal party.",
            "Immigration is about suppressing wage growth. Not something the centrist con/lib governments will give up on. Imagine the political fallout and soul searching in NP opeds if Tim Hortons went bankrupt. Although the conservatives will certainly ramp up public sector austerity as another weight to keep downward pressure on wages.",
            "So basically, \"We stopped increasing the number of international of students for two years. Good enough?\"",
            "I don't think the issue is caused by immigration per se. The type of immigration we are seeing is a symptom of other issues.    \nOur economy is based entirely on growth, and without making fundamental changes to our economy, immigration will remain a key driver of that growth. In my view, the issue is a fundamental lack of intervention by the government in the housing market, a TFW program that imports a class of under-waged and subsidized workers (that only serves to undercut opportunities for the most economically precarious Canadians), and the chronic underfunding of our universities (while allowing a loop hole to charge foreign students inflated tuitions).    \nIf we actually addressed those issues, immigration would cease to compound our problems, and would help to drive the economy rather than simply helping corporations make more money.",
            "Guys, I just want to throw this out - it is very generous to the boomers to blame the hospital woes on immigration.  This was ALWAYS going to happen whether we brought people in or not.",
            "Likely a generic reply put together for MPs by the central party PR folks. I hot similar types of responses from Fillmore on other issues.\n:(",
            "Oh wow, I guess Marc solved it last month. I hadnt noticed!",
            "The immigrants arent the ones who raised your rent"
        ]
    },
    "Same sex couple speaks out after being attacked": {
        "title": "Same sex couple speaks out after being attacked",
        "score": 250,
        "url": "https://atlantic.ctvnews.ca/video/c2949659-same-sex-couple-speaks-out-after-being-attacked",
        "content": "",
        "num_comments": 373,
        "comments": [
            "Why is the video blurring out the top half of the perps???",
            "Why didnt the police arrest them?",
            "theres no chance these poor girls could have defended themselves. imagine ganging up with your buddies and beating up someone so vulerable to feel tough. pathetic.\n\nthis disgusting behavior does not belong in halifax. especially from GROWN ASS ADULTS.",
            "Its frustrating that when this story first came out to this sub, people immediately started saying it wasnt true, sounded made up, blah blah blah.\n\nThere, theres your proof. A video of a group of men punching two women in the streets of Halifax.",
            "This should be Canada-wide news. Its pride month for goodness sake. Hope these girls are recovering well.",
            "Did the cbc cover this at all?",
            "Its absurd to me how Canada says it welcomes and accepts everyone, and then the people who are welcomed into this country do things like this because they aren't accepting of others. Theyre going against the same reason they are welcomed here. \n\nAt least that's my take. And I also think it's awful that this will make other muslims look unaccepting as some of the kindest people ive met have been muslim.",
            "hfxnoise never even covered this, beyond laughable",
            "I am a member of the LGBT2S+ community (F here) and always have been in fear. Even though its pride month, I still dont feel comfortable. And no, I don't mean specifically towards immigrants, I mean in general (doesn't matter what your religion, your home country, etc.,) And also downtown can be scary at night - you never know what's going to happen. I hope these women are going to be okay, I cannot imagine how terrifying this was for them. And I do hope that the police will take this seriously and press charges on these jerks.",
            "What is 'manly' about feeling threatened by some random stranger's sexuality that has absolutely nothing to do with you? Please make it make sense, what the hell is wrong with these guys? Why would a mob of dudes think it's OK to do that to anyone.\n\nI am sorry for the 2 poor victims of this mob attack and I hope authorities treat it as the hate crime it appears to be and throw the book at them."
        ]
    },
    "Looking to meet sober friends in Halifax": {
        "title": "Looking to meet sober friends in Halifax",
        "score": 38,
        "url": "https://www.reddit.com/r/halifax/comments/1dr1jgw/looking_to_meet_sober_friends_in_halifax/",
        "content": "Hi everyone I’m a 20 year old female and I’ve just freshly started my sober journey over again. Finding friends that are also sober in this city has been extremely hard😅 and it’s been hard to keep my sobriety when I’m not surrounded by others who want to do the same. If anyone is in a similar situation and wanting to make friends or meet new people message me! ",
        "num_comments": 22,
        "comments": [
            "Hello friend. Today is my 900th day without a drink. I'm on the south shore, but hopefully you can find some solid like-minded friends in the city. One day at a time ",
            "Im on day 3306 of sobriety.  Since June 15.  You can do this",
            "Always looking to make new friends here! I'm 25, don't drink or smoke :)",
            "Boardroom Cafe has drop in nights for various games. Meetups has groups dedicated to sober fun. Look around, there are a lot of options for 20 (somethings) to engage in this city.",
            "coming up on 7 years as an active musician, it can be done!",
            "It's a very difficult journey in this province, where binge drinking culture is so prevalent. I'm pulling for you!",
            "Sober City in Halifax!!\nHello as a 31F alcohol free person ",
            "Hey! Im 27 and coming up on 4 years without a drink or harder drugs, pretty much since Ive moved here from Alberta. I still smoke weed, but I definitely understand the difficulties around meeting people in your 20s while not drinking. The journey is so worth it though!",
            "Im 22 and having the same problem. Im tryna be sober and try new things but my entire group of friends is engulfed in drinking and smoking. I been wanting to branch out and just do simple things. Simply eating somewhere, road trips, just anything that doesnt involved spending money to make myself feel horrible the next day. I also do mixed martial arts so definitely not tryna do that hungover",
            "If you're part of the lgbtqia+ community, check out untoxicatedqueers on Instagram"
        ]
    }
}