{
    "Weekly Questions Thread": {
        "title": "Weekly Questions Thread",
        "score": 4,
        "url": "https://www.reddit.com/r/handbags/comments/1dncxij/weekly_questions_thread/",
        "content": "Hey folks! Welcome to the weekly question thread. Going forward for a short  while, we will be having a weekly question thread that will be pinned.  You can ask questions about specific bags that don’t require an entire  review to see if anyone has the answer!\n\nWe are doing this so that we can start building up an FAQ so that your  questions can be more easily answered. Questions are NOT restricted to  this post, especially if those questions involve discussions! If you have posted in a previous Weekly Question Thread but your question was not answered, feel free to repost it again. \n\nHere are some example questions:\n\n1. Can an iPhone 13 Pro fit in the Loewe Mini Puzzle?\n2. What bag can I use in the rain under $X?\n3. Does this bag match this outfit? (Can be asked in this thread or as a discussion post).\n4. Has anyone had any experience shopping at <boutique> in <city>?\n\nExamples of what NOT to post:\n\n1. What bag are you wearing today? (This would be better as a discussion post).\n2. Where was your best boutique experience? (This would be better as a discussion post).\n3. Review  request for Mlouye! (There’s a chance someone who’s purchased won’t see  it as a comment and may be better off as a post for now).\n\nThis thread will be reposted every Monday. You can always revisit any previous [Weekly Question Threads](https://www.reddit.com/r/handbags/search/?q=flair_name%3A%22Weekly%20Questions%20%F0%9F%94%AE%22&restrict_sr=1). If you cannot see that link, please ensure that you toggle safe mode on your browser, then refresh and try again. Weekly Question Threads have their own post flairs to make searching easier. \n\nThank you for your continued patience as we continue to build up our community! 💖",
        "num_comments": 22,
        "comments": [
            "Hello! I’m new and still unsure whether my question is for this thread or for a separate post. So please let me know if this isn’t the best place TIA\n\nI want to buy handbags - one for daily use (one that fits my ipad) and smaller one for going out. I’m not one to discriminate on any shapes but my only non negotiable is that I love long shoulder straps! I want a le pliage just because of that, but I’d love different options. Maybe you guys have suggestions? Thank you in advance for your advice ☺️",
            "I feel stupid asking this but couldn’t find anything in the wiki. What are the most reputable places to sell handbags? My mother is downsizing and wants to sell her non-classic handbags.",
            "My cousin was gifted a Bulgari bag on Celebrity cruise. She does not love it. However it was all sales final on the cruise. She has box, bags, receipts and everything.  Would a Buglari store accept the return?",
            "Is it true that some limited edition longchamp doesn’t have a button on the bottom to fold?",
            "as someone who carries around my laptop and accessories for work every day, i've found that having a high quality, waterproof bag is essential. i went through a bunch of cheaper bags before finally investing in a premium leather briefcase from killspencer. it has a dedicated laptop compartment, pockets for organizing cables and gear, and a lining to protect everything. it was more than i wanted to spend initially but it's held up amazingly well and still looks great after heavy use. for me, having a dependable bag that i don't have to worry about damaging my computer has been totally worth the investment. just wanted to share my experience in case it's helpful for anyone else looking for a solid everyday work bag!",
            "check your messages! I have an authentic gucci gg canvas eclipse shoulder bag I'm selling for the low, and it can fit your iPad!",
            "If you have a picture of them you can try a reverse google image search. I have found the year and season of a Chanel jacket this way before from an old Vogue runway editorial on line.",
            "The Real Real is great.  Depends on if the handbags are on their brand list. They will take a bigger cut, but do all the work for you.  Poshmark and eBay if you want to sell it yourself, but it's more work and a little more risk.",
            "That looks unique, without a brand it's hard to narrow it down.  The base construction I would call a tote bag or boat bag.  My suggestion is to go Etsy and search for \"blue with clouds canvas tote bag\" to find something a bit similar.",
            "Mid tier brands? I’m not exactly sure how to show my range? Kate spade below? Most expensive bags I’ve had are Kate Spade, MK, Charles & Keith 😅"
        ]
    },
    "[Megathread] Handbags Brand Transparency": {
        "title": "[Megathread] Handbags Brand Transparency",
        "score": 88,
        "url": "https://www.reddit.com/r/handbags/comments/1df8c18/megathread_handbags_brand_transparency/",
        "content": "Hey handbag lovers! \n\nWith all the news coming out and many individual posts being created, we are trying to centralize that discussion into a megathread. I've seen some folks asking for a way to help identify who owns what from the larger brands. With that in mind, I've been working on a small project to make the parent companies into something that can be more easily referenced and I'm asking for your help! I would love to add this information to the r/handbags wiki, but want to make sure that I don't miss out any brands. \n\nOn the wiki, this infographic will be in text and image format. Please let me know what additional brands you're looking to see added (and their parent group, if you're aware), if any information below is **incorrect**, and if you'd like to see any additional information either on the infographic or the wiki. I'm also open to changing this to a horizontal format, if that's easier for folks. \n\nBelow is the **first pass**, which means that this is a **draft only**. \n\nhttps://preview.redd.it/cd6z01i2ae6d1.jpg?width=800&format=pjpg&auto=webp&s=011e953d89792453aa1ba5114b786b8f46ba8202\n\n# What is this megathread for?\n\n* Discussing transparency in the handbag industry based on [this news](https://www.reddit.com/r/handbags/comments/1deho2m/im_devastated_and_feeling_incredibly_guilty_for/) (multiple threads were posted, sharing the most popular one)\n* Discussing alternatives\n* Discussing parent groups and brands\n\n# Community rules still apply. \n\n* Please remember to be kind to one another. Personal attacks will not be tolerated. \n* Duplicative posts will be removed. Please post updates in this thread only to centralize discussion. \n\n",
        "num_comments": 40,
        "comments": [
            "How about Longchamp - it seems like they are independent/private?",
            "I’m going to be a Chloe girl for life. They have a mission statement about their fair labor practices. It doesn’t get any more transparent than that. 😊",
            "This may be slightly off-topic, but when is it enough? When does #1 have enough money that they stop ripping us off ? When do they start charging us a reasonable fee for how much they pay for the bag? Or charge us half price and pay your employees more how much is too much? How much more greed do we need?",
            "So I been seeing several post and redditors comments on the recent Dior exploitation of workers and post about boycotting brands. To be honest, I contemplated on sharing my own opinion as I am bounded by NDA as an ex LVMH staff, so before I share my insight I would like to know if I would get into trouble",
            "Is there anywhere to actually buy an authentic re sale handbag?",
            "Also, doesn’t Estée Lauder own Tom Ford ? And L’Oréal owns mugler ",
            "I'm not sure if Joseph Duclos is private or what, but they're not LVMH.",
            "Oh that’s great! Do you know if see by Chloe is the same?",
            "They will charge as much as customers are willing to pay, and will pay their workers as little as they can because outsourced labor to developing countries is a dime a dozen. All we can do is be diligent with how we vote with our dollar",
            "Fashionphile is likely the most reputable."
        ]
    },
    "Coach now in Shein?!": {
        "title": "Coach now in Shein?!",
        "score": 119,
        "url": "https://i.redd.it/mzlgrly9kg9d1.jpeg",
        "content": "I'm a little bit shocked that Shein now sells Coach bags. ",
        "num_comments": 64,
        "comments": [
            "This has to be a grey market situation or dupes or something - there’s no way Coach would nuke their brand credibility like this. Clearly not second hand since they say new. I don’t think Coach has okayed this.",
            "? This is obviously fake lol why would coach sell under “Premium Brand Fashion Store” when “Coach” holds more weight. A lot of bags are made in China so it’s pretty easy to get overruns and class A copies from them. Lmao.",
            "Idk why Coach would allow this but they are likely all outlet bags. From the photos I recognize most of these from my outlet. It sucks because this will definitely damage the brand just as they are really getting a resurgence in popularity.",
            "What’s funny is that the online Coach outlet website is half the price for the same bag on the top right. What would be the incentive to buy from Shien if the official website charges less?",
            "Nah, I bet those are just pictures borrowed from the website. The real product will be really poor quality.",
            "Yes, SHEIN now operates as a marketplace similar to Amazon and AliExpress. I would not buy any “luxury” goods from them, but they vow that those products are authentic. My opinion is that it is an attempt to lend them some credibility and change their image. Only time will tell.",
            "I think these would be outlet bags? If they are legit. In that case, I would just buy from the outlet…",
            "They literally cost more than coach outlet prices. But they do have some colour ways we don’t get in the UK",
            "If this is real I will lose all my respect for coach 🙃",
            "And not one of those is authentic that Mickey one is completely off"
        ]
    },
    "I’m in love with this Thom Browne bag!": {
        "title": "I’m in love with this Thom Browne bag!",
        "score": 66,
        "url": "https://www.reddit.com/gallery/1dr6sb0",
        "content": "",
        "num_comments": 11,
        "comments": [
            "🥺she’s so sweet looking. If I bought her, I’d definitely name her.",
            "Very cute, love these animal themed bags. Different from the rest.",
            "I’ve wanted one similar to this but cannot picture me ever using it lol",
            "I kind of love it! It also looks like good quality.",
            "I am imagining resting it at the counter pointing at people when I am checking out.",
            "Omg I love turtles, thank you for sharing",
            "r/cultofthelamb would love this",
            "I actually love this",
            "That’s an emotional support purse if Ive ever seen one.",
            "Oo I have been enjoying seeing all these animal themed bags. This looks fun! \n\nThe animal bags that I been eyeing are [jellycats](https://jellycat.com/timmy-turtle-bag/)"
        ]
    },
    "Leather bucket bag I made": {
        "title": "Leather bucket bag I made",
        "score": 441,
        "url": "https://www.reddit.com/gallery/1dqufz1",
        "content": "",
        "num_comments": 41,
        "comments": [
            "That is absolutely gorgeous and it looks so luxe! I would have guessed designer for sure.",
            "Girl, you are SO talented. I love seeing your posts here!",
            "I didn’t look at the sub & came to comment thinking this was one of the leatherwork subs.  Was going to tell you that this bag looks designer & you should post in this group because it would get a lot of appreciation.\n\nHave you been practicing the craft for a while?",
            "Amazing 🖤 love the texture design you added!!",
            "I’m in love! I feel like I haven’t seen many bucket bags I love but this has to be it ❤️ So beautiful",
            "Oooooooo I love it. Especially that braided drawstring, the beautiful braided detail. It’s a beauty.",
            "It is so cute!!!! I’d buy if you made more",
            "Another gorgeous creation! I love the size of the handle and the shoulder straps as well. I really love seeing the goods you make! Thank you for sharing them with us! ❤️",
            "I can’t wait for this to come in 😍🖤 you are seriously the best!!",
            "When are you making it for us!!"
        ]
    }
}