{
    "Reminder: Please do not submit tech support or build questions to /r/hardware": {
        "title": "Reminder: Please do not submit tech support or build questions to /r/hardware",
        "score": 246,
        "url": "https://www.reddit.com/r/hardware/comments/3n9tky/reminder_please_do_not_submit_tech_support_or/",
        "content": "For the newer members in our community, please take a moment to review our rules in the sidebar. If you are looking for tech support, want help building a computer, or have questions about what you should buy please don't post here. Instead try /r/buildapc or /r/techsupport, subreddits dedicated to building and supporting computers, or consider if another of our related subreddits might be a better fit:\n\n* /r/AMD (/r/AMDHelp for support)\n* /r/battlestations\n* /r/buildapc\n* /r/buildapcsales\n* /r/computing\n* /r/datacenter\n* /r/hardwareswap\n* /r/intel\n* /r/mechanicalkeyboards\n* /r/monitors\n* /r/nvidia\n* /r/programming\n* /r/suggestalaptop\n* /r/tech\n* /r/techsupport\n\nEDIT: And for a full list of rules, click here: https://www.reddit.com/r/hardware/about/rules\n\nThanks from the /r/Hardware Mod Team!",
        "num_comments": 19,
        "comments": [
            "Are all new posts blocked pending moderator approval? Sorting the subreddit by \"new\" puts a 15-hour-old thread above a 12-hour old thread.",
            "Added to the list, thanks!",
            "Which ones? We'll contact them.",
            "Nope, new posts should appear immediately.",
            "/r/mousereview, /r/keyboards and /r/mechanicalkeyboards all have fairly active communities. For general computer suggestions /r/buildapc works too.",
            "Yep, I just added it to the list in this thread not the sidebar.",
            "Where? I don't see anything in their sidebar.",
            "Lots of those subreddits aren't appropriate places for questions and help either.\n\n* /r/programming \n* /r/datacenter\n* /r/battlestations is for pictures of PC setups.\n* /r/buildapcsales is for links to good deals on PC components and peripherals.\n* /r/tech is for news articles and \"informative [...] self-posts\" about technological advancements\n* /r/hardwareswap is an informal marketplace for used hardware\n",
            "Where should we go for random product recommendations? Just small random things like mice, keyboard, sound cards, general hardware.. etc. \n\n/r/buildapc ??\n",
            "This post isn't just referring to questions and help.\n\n>or consider if another of our related subreddits might be a better fit:\n\nThis covers the subreddits you're talking about."
        ]
    },
    "Soon, QDEL Screens Could Perfect What OLED Couldn't": {
        "title": "Soon, QDEL Screens Could Perfect What OLED Couldn't",
        "score": 71,
        "url": "https://www.howtogeek.com/soon-qdel-screens-could-perfect-what-oled-couldnt/",
        "content": "",
        "num_comments": 31,
        "comments": [
            "I expect display names to become more confusing. When these technologies reach consumer displays, OLED, QLED, QDEL, Mini-LED, Micro-LED, and Micro-OLED must be confusing to the average person.",
            "by this \"soon\" microled will be shipping already",
            "I just want miniLED brightness on full window sizes, that's all I need",
            "Isnt Micro-LED set to be the solution to OLED?",
            "First rgb oled will be released next year which is really nice.\nWill qdel compete with micro led?",
            "Screen this, display that, my eye cant tell no difference.",
            "Because Samsung took over the QLED term to intentionally confuse customers",
            "They're intentionally confusing. Why do you think Samsung calls their LCDs QLED which is strangely close to QD-OLED \n\nQD-EL does make sense though. It's about the same as QD-OLED",
            "2028+ minimum for final products going by optimistic timeframes from the original article.\n\nI.e no impact on current spending decisions.",
            "Agreed, u/xen0us gave us a false headline"
        ]
    },
    "Snapdragon 8 Gen 4: Adreno 830 GPU rumoured to launch with DLSS Frame Generation-like feature": {
        "title": "Snapdragon 8 Gen 4: Adreno 830 GPU rumoured to launch with DLSS Frame Generation-like feature",
        "score": 19,
        "url": "https://www.notebookcheck.net/Snapdragon-8-Gen-4-Adreno-830-GPU-rumoured-to-launch-with-DLSS-Frame-Generation-like-feature.854000.0.html",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Between the new Oryon cores and Qualcomms excellence with Adreno I am far more excited about the 8 Gen 4 than I ever was about the X Elite. I think the fruits of the Nuvia team and their mobile division will shine here as opposed to the disappointed reaction from the X Elites Windows woes and good but not that impressive performance.",
            "In my own testing my M1 Pro GPU is easily 10-20x faster than my S24U when running a bunch of different compute shaders. The M1 Pro GPU isn't even particularly fast.",
            "Adreno 830 looks like it will be the biggest architectural overhaul of Adreno in a long time:\n\n- Slice GPU architecture.     \n- New memory compression algorithm.    \n- New Dynamic Wave Pairing technology.      \n- Addition of HGEMM.   \n- Improved FP32 performance.    \n\nSources: \n\nhttps://x.com/negativeonehero/status/1805561685119492561\n\nhttps://x.com/negativeonehero/status/1805561685119492561",
            "Mobile GPU architectures continue their march in adopting desktop-class GPU features, but they are still far behind in the curve. Here's several tweets that explain the differences in depth:\n\n[https://x.com/SebAaltonen/status/1805616029332021721](https://x.com/SebAaltonen/status/1805616029332021721)\n\n[https://x.com/SebAaltonen/status/1805862452875104453](https://x.com/SebAaltonen/status/1805862452875104453)\n\n[https://x.com/SebAaltonen/status/1806221164345229373](https://x.com/SebAaltonen/status/1806221164345229373)\n\n[https://x.com/SebAaltonen/status/1806217804162445629](https://x.com/SebAaltonen/status/1806217804162445629)\n\n[https://x.com/SebAaltonen/status/1806234348955279786](https://x.com/SebAaltonen/status/1806234348955279786)\n\n[https://x.com/SebAaltonen/status/1806234702493241368](https://x.com/SebAaltonen/status/1806234702493241368)\n\n[https://x.com/SebAaltonen/status/1806244885684490526](https://x.com/SebAaltonen/status/1806244885684490526)"
        ]
    },
    "Chips and Cheese: \"Examining the Nintendo Switch (Tegra X1) Video Engine\"": {
        "title": "Chips and Cheese: \"Examining the Nintendo Switch (Tegra X1) Video Engine\"",
        "score": 90,
        "url": "https://chipsandcheese.com/2024/06/28/examining-the-nintendo-switch-tegra-x1-video-engine/",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Crazy to think that Nintendo went with a chip designed for smart tvs and auto entertainment systems, and even more crazy is that half the cores on the X1 are disabled because they could never get the big little working right on it.",
            "This would have been cool 7 years ago",
            "When the Switch becomes the top selling console of all time, would the Tegra X1 be the most sold chip in history in terms of units?\n\nIts on the switch, shield tv and Jetson Nano.",
            "Nvidia also used the Tegra chips in their line of gaming tablets, so makes sense for Nintendo's gaming tablet to use :)",
            "Retrospectives are still valuable tech journalism.",
            "You mean NINE years ago when it was used on SHIELD TV, you know, the thing where the video engine is the titular feature.",
            "Maxwell really was kind of a surprise generation at the time too.\n\nIt was a pretty big improvement in performance from Kepler to Maxwell, and both were on the same process node, so all the improvements were purely from architecture.",
            "A deep dive into even wholly obsolete technology can still be very interesting, too. The techniques and mechanisms themselves are very cool to see explored. This article will also make a great point of comparison when the successor eventually releases, so if anything, it's a bit early. :)",
            "> We haven't even touched chips that doesn't have a CPU yet.\n\nSome of those are easily selling in the billions or tens-of-billions even...",
            "I remember when the 750Ti (the very first Maxwell card released before the 900 series) came out  and all the reviewers were boggled at the performance of this tiny card. It heralded the start of Nvidia's efficiency dominance for the next decade.  Before this AMD was typically the *more* efficient choice."
        ]
    },
    "PC World Tested: Don't buy a Snapdragon X Elite laptop for PC gaming": {
        "title": "PC World Tested: Don't buy a Snapdragon X Elite laptop for PC gaming",
        "score": 430,
        "url": "https://www.pcworld.com/article/2378322/qualcomm-adreno-x1-vs-intel-arc-real-world-performance-in-7-games.html",
        "content": "",
        "num_comments": 160,
        "comments": [
            "Was anyone seriously even considering that?",
            "Love the dont play league just because you liked arcane energy",
            "Motoring World Tested: Don't buy a moped for performance 4x4 offroading",
            "The vanguard press we need",
            "The niche for this product seems to be for people that want to run Office and webapps. Basically a thin client at thick prices for thick people.",
            "Between this sub being filled with commenters just destroying the surfaces and the surface subreddit worshipping them Im actually getting a pretty decent idea of what this device is capable of",
            "We are never kicking x86 for video games. Were gonna stay here forever",
            "The results are impressive for a first gen product (I know they had a couple cpus earlier, but those were more like beefed up phone cpus, this is the first time they went all in)",
            "Dont by any non-gaming machine/laptop for gaming. Lol",
            "Really? No we know it, thank you GiJose"
        ]
    }
}