{
    "Monthly Question and Answer Thread: June 01, 2024": {
        "title": "Monthly Question and Answer Thread: June 01, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/HarryPotterGame/comments/1d59z0y/monthly_question_and_answer_thread_june_01_2024/",
        "content": "All simple/common questions about the game, its features, and anything else related to it should be asked here. Some examples of these questions are:\n\n* \"Can my PC run the game?\"\n* \"What is the difference between each edition?\"\n* \"How do I do \\_\\_?\" or \"Where do I find \\_\\_?\"\n* \"What is the best way to complete \\_\\_?\" or \"What is the best gear/talent build for \\_\\_?\"\n\n**Before asking a question, users should view these resources as it may answer it for you:** [Game FAQ](https://www.hogwartslegacy.com/en-us/faq), [PC Specs from Steam](https://www.reddit.com/r/HarryPotterGame/comments/wxjuzx/hogwarts_legacy_pc_requirements_on_steam/), [Differences between Editions](https://www.reddit.com/r/HarryPotterGame/comments/x036qy/updated_info_for_all_editions_new_post/), [Fan Club Account Linking](https://www.reddit.com/r/HarryPotterGame/comments/x3di2u/harry_potter_fan_club_account_linking_confirmed/).\n\nAll questions/answers containing spoilers must be correctly tagged. For detailed instructions on how to do this check out our [posting guidelines](https://www.reddit.com/r/HarryPotterGame/comments/wvug37/updated_posting_guidelines_and_info_about/). Feedback relating to the subreddit should be directed [here](https://www.reddit.com/message/compose?to=/r/HarryPotterGame); this thread is for questions relating to the game.\n\nAsk legitimate questions; if you're trolling in this thread you'll be banned.\n\n**Go** [**here**](https://www.reddit.com/r/HarryPotterGame/search?q=flair_name%3A%22Weekly%20Q%26A%22&restrict_sr=1&sort=new&include_over_18=1) **to view past Q&A threads, your question may have already been answered! :)**",
        "num_comments": 47,
        "comments": [
            "Not sure if this goes here or not, if not ill delete it but my game crashes constantly, on basically any cut scene at least once and randomly when i open the map \n\nThese are my specs, not sure if they matter or not   \nryzen 5 7600x\n\n16gb of 6000mhz ram\n\nA 4060 ti \n\n1tb of m.2 ssd",
            "Has anyone noticed their collection chests not registering since the new update? I’m on the ps5, have opened a few since the update, but they’re still showing on the mini-map, and not in stats for the village. They’re definitely open. I can’t re-collect them and the wand handles and, room of requirement stuff are showing up in collections. I’ve noticed it in the villages, haven’t tried it in the castle or hogsmeade yet.\n\nIn fact, I’ve also noticed it’s showing up Merlin trials I’ve already done. It’s got the fern leaf symbol under the awning thing that pops up.",
            "Playing the game on hard (first time playing this, but highly experienced with these types of games). Is it possible to chain Protego on rapid fire attacks? I see videos of people playing on hard mode and enemies stand around and attack one at a time to allow Protego to work, but I regularly get chain attacked where if I Protego, while the animation is coming off, another attack strikes through before I can dodge or Protego.\n\nAdditionally, I know red aura means unblockable, and yellow means you can use Protego, but what does it mean when there's an attack without an aura? Is that an enemy attacking off screen?\n\nMy experience with parry/dodge mechanics tells me that the parry mechanic SHOULD be better, but my in-game observation is that it is actually the weaker option. Is there a breakdown on those mechanics, and how a player is expected to Protego chain attacks, or attacks without warning (is it tied to a talent?)?",
            "Do we think the update will break any mods? Specifically visual ones (hairstyles/face)? Should I wait to start for next play-through until after it’s released?",
            "I've been trying to use Fidelity Mode with Raytracing on my PS5 but I keep getting a \\`CE-108255-1\\` crash.\n\nThis happens specifically while I'm talking to Olivander about the wand which leads to a confrontation with an enemy when walking out of the shop. As soon as the battle starts, like 1-2 seconds in, the whole system crashes. \n\nDisabling raytracing fixes the issue.\n\nAny suggestions?",
            "So does everyone else’s game crash on PC since the new update",
            "Haven't played the game since the month it released. Did the exclusive PlayStation quest every come to PC?",
            "I had to save my old games in another folder.  Uninstall amd reinstall not only once but a total of 3 times before the DLC showed the updates. Then the game that I was playing...new runthrough as  Hufflepuff...had all spells, clothing, spellcrafts etc...unlocked. I was not going to delete the game so I have a \"freebie\" game.  By the way I decided on being a Hufflepuff as yellow is one of my favorite colors.",
            "How long do I have to wait for Albie Weeks to restock his brooms? I'm missing three brooms that I apparently need to buy from the vendor, but he hasn't changed what he was selling in over an in-game week.",
            "https://preview.redd.it/eb30y9nmhn6d1.png?width=1920&format=png&auto=webp&s=44499515782130fc7bccd4eb1b8418a14d09f1ae\n\non PC, why does my photo mode look like this? with place holder type text and no actual... like \"Press \\[button\\] to \\[do thing\\]\" this happens with some of the clothes too, like one scarf i have in my inventory is labeled as \\[NECK\\_66\\_LEGENDARY\\] with the description \\[Neck\\_66\\_Legendary\\_desc\\]."
        ]
    },
    "Victor Rookwood in Photo Mode - My favorites out of 400+ I've taken..": {
        "title": "Victor Rookwood in Photo Mode - My favorites out of 400+ I've taken..",
        "score": 42,
        "url": "https://www.reddit.com/gallery/1dqzjzq",
        "content": "",
        "num_comments": 14,
        "comments": [
            "Welcome to r/HarryPotterGame! Don't forget to join [our Discord server](https://discord.gg/harrypottergame) where you can talk about Hogwarts Legacy & Portkey Games in real time with other fans!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HarryPotterGame) if you have any questions or concerns.*",
            "Come now, no need for theatrics. Lol I love Rookwood.",
            "i’d hit it",
            "I adore his voice actor. I love villains that are, for the most part, very polite and can still navigate normal society simply because the law cannot prove the terrible things everyone knows he has done. That being said... Rookwood and Harlow need either no hats or different hats.  It's may be wizarding-world fashion, but it's not fashion I'm intimidated by.",
            "Love the shots. Also, I recognize the username? I think I've read some of your work on Ao3 😅 (it was very enjoyable)",
            "big same if it wasn't obvious",
            "IDK if you knew this, but the VA for Victor Rookwood also voiced the Sorting Hat, Nearly Headless Nick, the Fat Friar, Peeves, Professor Cuthbert Binns, Gladwin Moon, Ferdinand Octavius Pratt, Rowland Oakes - amongst others\n\n [Jason Anthony | Harry Potter Wiki | Fandom](https://harrypotter.fandom.com/wiki/Jason_Anthony#:~:text=Jason%20Anthony%20is%20a%20British,Westland%2C%20goblins%20Bragbor%2C%20Arn%20and)",
            "I love villains, period..  Doesn't hurt that he's hot though!\n\nThe hat rules in addition to being period-correct.  It's perfect just how it is.\n\n[The hat is sacred.  All hail the hat.  ](https://www.youtube.com/shorts/dnJkPm0EFBM)",
            "https://i.redd.it/b939mh5a8f9d1.gif",
            "I did not know that! At this very second I cannot picture Rookwood and Peeves being the same person... but maybe now that I know this I'll hear subtle commonalities. Thanks for letting me know!"
        ]
    },
    "That new summer update lighting is… something else": {
        "title": "That new summer update lighting is… something else",
        "score": 176,
        "url": "https://v.redd.it/dh3icblh4b9d1",
        "content": "",
        "num_comments": 26,
        "comments": [
            "Welcome to r/HarryPotterGame! Don't forget to join [our Discord server](https://discord.gg/harrypottergame) where you can talk about Hogwarts Legacy & Portkey Games in real time with other fans!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HarryPotterGame) if you have any questions or concerns.*",
            "It’s a shame that this update broke so many things. I want to replay the game but not while it’s buggier than it was even at launch",
            "they gotta fix the lighting across the whole game. None of the hair colors look right in the sun anymore aside from black",
            "So dumb they broke the game for such worthless content they called an \"update\"",
            "Game is completely broken (I'm on PC). I have these weird lighting at times too, for the 10/15 minutes I can play before the inevitable crash. I just stopped playing it completely, sad because was such a fun game before this catastrophic \"update\" everyone waited for.",
            "Looks like the filter from the 3rd keeper trials",
            "Unc unc unc unc unc unc unc um\n\n🕺",
            "Yeah, lighting is really bad, everything is so washed out, disabling fog helps a bit (at least on PC) but it's not really a solution, just a hack. Plus during conversations faces are awkwardly lit up like they all have their own spotlight.\n\nBtw, does anyone also has a problem with House Fan-atic School Robe during cutscenes? It's really blurry and it looks like the textures loaded with incorrect LOD.",
            "Just got a new rig and have played for 10 hours now (first time). I did think something was off with the lighting, but I thought that was just how the game looked.. sounds like I timed it wrong with my first playthrough",
            "I haven't seen any lighting issues like this on PC but I have noticed the fog is a lot more invasive. I walked into a random treasure vault the other day and I couldn't even see well enough through the fog to see what I needed to do. It was the middle of the day in game and there was no fog outside."
        ]
    },
    "What masks do you wear? Which one's your favorite?": {
        "title": "What masks do you wear? Which one's your favorite?",
        "score": 10,
        "url": "https://i.redd.it/74so9g8opf9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Welcome to r/HarryPotterGame! Don't forget to join [our Discord server](https://discord.gg/harrypottergame) where you can talk about Hogwarts Legacy & Portkey Games in real time with other fans!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HarryPotterGame) if you have any questions or concerns.*",
            "Don't wear a mask/hood tbh, I like seeing my characters face/expressions when they're talking to people (I know you can toggle it but that somewhat breaks the immersion for me, same with Mass Effect and removing the Helm for conversations lol 😆 )",
            "What robe are you wearing? It looks so good",
            "Legendary one only",
            "I like duelist mask. I like to pop it on when I’m hunting down bad guys.",
            "I've been doing the wolf mask. I'm also sometimes partial to the sanguine mask, when I've gotta go do war crimes against poachers.",
            "Legendary Masquerade",
            "Exclusively pumpkin head. 100% of the time. 😂",
            "None. I wear my school robes. I’m a student at Hogwarts, even if I’m not allowed to sleep in a bed or sit in the Great Hall for a meal.",
            "i don't wear one, don't even wear hats. i found myself laughing out loud during cutscenes when my character was wearing all these weird fashion like they're headed for the weirdest fashion show on earth. so i keep it simple."
        ]
    },
    "I finally got a shiny of every beast.": {
        "title": "I finally got a shiny of every beast.",
        "score": 48,
        "url": "https://www.reddit.com/gallery/1dqo28f",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Welcome to r/HarryPotterGame! Don't forget to join [our Discord server](https://discord.gg/harrypottergame) where you can talk about Hogwarts Legacy & Portkey Games in real time with other fans!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HarryPotterGame) if you have any questions or concerns.*",
            "I spent so long catching beasts once I completed the game.\n\nShiny male, female and baby for each in my Vivariums. One of each male and female colour variant in my inventory. I wish I had 4 more Vivariums.",
            " we have photo mode now btw",
            "I haven’t gotten shiny beats yet. How does it happen?",
            "[You should try to take screenshots, and upload those, instead of taking photos with your phone.](https://support.challengermode.com/en/frequentlyaskedquestions/how-to-take-a-screenshot-on-consoles)",
            "I’m on my 4th play through and I think I have seen a shiny variation for each except for the Graphorn! Your Graphorn is stunning! (I also love how the shiny Unicorns are golden! ) \n\nI really wish we had bigger Vivariums or at least one more, because I really want at least one animal of every color , especially the Fwoopers!",
            "I used it for the graphorn",
            "It's just chance. Like pokemon.",
            "It's with my chromebook actually. And I don't know how to upload photos.",
            "What do you mean you don't know how to upload photos? You did it here."
        ]
    }
}