{
    "Friday Fanart Megathread": {
        "title": "Friday Fanart Megathread",
        "score": 4,
        "url": "https://www.reddit.com/r/HazbinHotel/comments/1dqn4rw/friday_fanart_megathread/",
        "content": "Share your fanart here in this thread! This thread will be automatically recreated every Friday!",
        "num_comments": 1,
        "comments": []
    },
    "Old Chaggie AU with Queen Charlie and Exorcist Vaggie (Art by Winter_Berry)": {
        "title": "Old Chaggie AU with Queen Charlie and Exorcist Vaggie (Art by Winter_Berry)",
        "score": 702,
        "url": "https://i.redd.it/n87ekqujye9d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "I love the designs and how Charlie just looks like \"yep this girl is gonna be my wife\" it seems that in this au she got her mom's dominant genes",
            "So what's the scenario here? Queen of Hell punishes a prisoner of war?",
            "I feel like Charlie would be the one to let go with the “you look like my first wife” line, if you know the line, you know the line",
            "Just a couple of great galpals",
            "~~I mean, Lilith canonically dommed Lucifer half the year, makes sense for an AU Charlie to look less like a pureblooded Seraphim.~~",
            "temptation\n\nMight be no forbidden fruit, but something's getting ate",
            "When did this happen? 👀",
            "oh my god *they were roommates*",
            "*sigh* Sesbian lex…",
            "Hot af tho"
        ]
    },
    "Human designs [@NakariiaLe on X]": {
        "title": "Human designs [@NakariiaLe on X]",
        "score": 1774,
        "url": "https://i.redd.it/i124vxav5d9d1.jpeg",
        "content": "",
        "num_comments": 41,
        "comments": [
            "Husk is literally Keith David from another universe",
            "Nifty died in the 1950’s and Godzilla first attacked Japan in the 1950’s…coincidence, I think not",
            "Alastor is the only one with his blood splat on the side of his human eye while everyone else's is on the side of their demon eyes. Just thought that was interesting",
            "Punching the air bc of Anthony he’s so babygirl 🤭",
            "Niffty looks so cute I love her 🥺",
            "yesss i love the husk design",
            "Alastor giving huge Elias Bouchard vibes",
            "Wait I thought husker was confirmed to be a white guy in life",
            "I really want to know more of Nifty's stories.",
            "Angel reminds me of kian from blood in the bayou\n\nAnd I like that :3"
        ]
    },
    "Velvette is judging you [OC] ": {
        "title": "Velvette is judging you [OC] ",
        "score": 245,
        "url": "https://i.redd.it/g02c4i289g9d1.png",
        "content": "",
        "num_comments": 28,
        "comments": [
            "~~Judge me mommy~~\n\nSeriously great art",
            "Velvette is the second most underrated character, and sir pentius as the most underrated\n(In my point of view) ",
            "Please mommy let me get on my knees",
            "Yeah, what else is new?\n\nLovely art! 5 stars, flawless, greater than great!",
            "She can judge me all day.",
            "Her design is so amazing! She is such a sassy little upstart and I love it.",
            "And I'll judge her back with my critical eye (hint).\n\n(Kudos to anyone who can guess what mobile game I'm mocking)",
            "If velvette judges me ill judge her\n\nGreat art",
            "But what have I done",
            "Okay but what is she judging me for."
        ]
    }
}