{
    "r/headphones Shopping, Setup, and Technical Help Desk": {
        "title": "r/headphones Shopping, Setup, and Technical Help Desk",
        "score": 1,
        "url": "https://www.reddit.com/r/headphones/comments/1dkbxxp/rheadphones_shopping_setup_and_technical_help_desk/",
        "content": "Looking for advice with a purchase or help troubleshooting a problem? This is the place. This post will be refreshed and replaced when it is 4 days old.\n\n## Purchase Advice\n\n* For purchase advice questions, consider searching and using r/HeadphoneAdvice.\n* Please make use of [this template](https://www.reddit.com/r/headphones/wiki/purchaseadvice). It helps others answer your question. Questions without enough detail will often remain unanswered.\n* Remember that the more specific you are, the better quality the responses you are likely to receive.\n\n## What kind of questions are considered Tech Support:\n\n* How can I fix issue X (e.g.: buzzing / hissing) on my equipment Y\n* Have I damaged my equipment by doing X, or will I damage my equipment if I do X?\n* What does equipment X do, or do I really need equipment Y?\n* Can my amplifier X drive my headphones Y?\n* What's the meaning of specification X (e.g.: Output Impedance / Vrms / Sensitivity)?\n* How should I connect and set up my system hardware or software?\n\n*After asking a question, please be patient since volunteers may not always be immediately available.*",
        "num_comments": 31,
        "comments": [
            "I've got two pairs of Sony 7506 headphones I use for recording and mixing. I really like the way they sound, I think the honest sound is helpful for mixing, but I feel like they might be lacking on bass? They never give a booming sound. When I turn on my bigger studio monitors, the bass sounds completely different than what I was hearing with the 7506s.\n\nWhat should I trust more? I know the 7506s are the 'truest' headphones, but am I the only one that feels like the bass response is lacking? Should I trust my 7506s, my studio monitors, or should I mix somewhere in-between the two?\n\n  \nThanks!",
            "i bought a pair of LG tone FP5 less than a year ago and i am having some quite annoying issues.\n\nAs of now my right earbud is working pretty bad, when i connect the device to my phone/pc only the left bud works, the right one is completely disconnected and doesnt even do the \"blip\" sound when you put it in your ear, as if it's completely turned off. at random if i put it back in and out it reconnects, works for 10 seconds then disconnect again. Sometimes it even goes mad and it's suddenly the left one not working instead of the right? (but still, mainly the right one is not working)\n\ni downloaded the app, lg tone free, and it says the earbud is literally disconnected.\n\nsometimes when it \"works\" if i put it back into the custody it should turn off and music should only exit from the left earbud but for some reason it stays on and you can hear music coming out of its charger box, as if it was still in my ear.\n\ni tried polishing the electrodes and i tried to do factory reset multiple times but i don't know why it keeps having this problem. anyone has a fix to try?\n\nconsidering i had these less than a year and considering how much they cost i can't reccommend them as a product to buy\n\nedit: i should also mention that it keeps saying the battery is very low but even staying inside it's box all day it doesn't charge. there was this one time where if put inside the box it showed \"right bud battery at 45%\" and the moment i removed it it dropped to 15%, starting to scream \"battery is very low, please charge now\"",
            "My Moondrop LittleWhite ear hooks just kinda... Slipped off. How do I put them back in the hole? \n\nhttps://i.imgur.com/943H8Fx.jpeg",
            "Need Help Finding/Designing a Headband Reinforcement for AKG K371BT Headphones\n\nHi everyone,\n\nI'm hoping someone in the headphone community can help me with a DIY repair project. I have a pair of AKG K371BT headphones that I love, but they have a known design flaw where the headband can easily crack or break at the joint (see attached image with measurements).\n\nI'm looking for ideas on how to reinforce this weak point to prevent further damage. I've considered using a metal strip or U-clamp, but I'm having trouble finding one with the right dimensions (0.5 cm thickness, 1.5 cm width, 3 cm length).\n\nHas anyone else encountered this issue and found a solution? Any suggestions for materials, designs, or where I might find a suitable clamp would be greatly appreciated!\n\nThanks in advance for your help!",
            "I want this: [https://www.alpine-gehoerschutz.de/products/motosafe-race](https://www.alpine-gehoerschutz.de/products/motosafe-race)  \nBut in IEM form, as small as possible, doesn't actually need to be good at isolating sound",
            "Hey guys, I have purchased a Moondrop Chu 2 from a shopee vendor around 2 months ago and yesterday I noticed that the left ear was a bit quieter than the right one and then I tried to fix it from windows left right audio balance settings and used them to play games, but after a few hours i noticed it had gotten even worse to the point i had to make the left ear 2x louder in settings to match the right one, and if I use it with my phone it is very noticeable since I dont know how to make just one side louder than the other and frankly I dont want to have to do that for all my devices, I've checked the filter and it wasnt clogged at all. What should i do?\n\n\nThanks in advance",
            "I was playing Lego Marvel Superheroes 2 and at a certain point my headphones made a strange noise, like a small \"pop,\" and after that, I couldn't hear anything anymore. I tried turning the headphones on and off, but it didn't work. I also tried unplugging the USB dongle connected to the headphones, but nothing. Luckily, after restarting the PS5, everything went back to normal. Why this happened? I was using Sony PULSE 3d headset.",
            "I have Sennheiser 450BT headphones, which have worked perfectly fine for the last 6 months. After charging them, they will not turn off. Even worse, they no longer connect to any device. In the on mode, when I try to turn off, they say \"Power On\".",
            "Between moondrop may, truthear zero red or Artti t10?\n\nWich is better for listening rock and metal songs alongside with mpb and rap?\n\nI'm thinking upgrade up from my Qkz Hbb that i love.",
            "Between Moondrop may, truthear zero red or Artti t10, Wich is better for listening rock and metal songs alongside with mpb and rap?\n\nI'm thinking upgrade from my Qkz Hbb that i love."
        ]
    },
    "Previously I shared my semi-modular stand for the Fiio K7 to organise my desk. As there was interest, here is the updated design!": {
        "title": "Previously I shared my semi-modular stand for the Fiio K7 to organise my desk. As there was interest, here is the updated design!",
        "score": 26,
        "url": "https://www.reddit.com/gallery/1dlsjfv",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Version 2 of my semi-modular desktop and under-desk mount for the popular Fiio K7 and the Fiio BTA30 pro.  \n  \nJust so you know, this is still a work in progress. Most of these parts need to be refined or will continue to be refined, but they function as intended.  \n  \nYou can download the files [here](https://www.printables.com/model/919666-fiio-k7-mount-stand-v2-semi-modular-desktop-and-un) to print them out for those interested!  \n  \nThis package provides a semi-modular system for both under-desk and desktop use.  \n  \nThis package contains:  \n- Fiio K7 enclosure, with an additional storage section  \n- Desktop stand  \n-under desk mount (with a slide-n-lock system)  \n- storage drawers (2 versions for different methods of insertion)  \n- headphone/ headband rest  \n- BTA30 / BTA30 pro mount/ bracket  \n  \nThe enclosure (V2) can be used in isolation or with various attachments.  \n  \nThe front and rear are left exposed, with a side grill for access and heat dissipation.  \n  \nThe circular design feature enables headphones to clamp and rest on the enclosure. It is measured to work with most headphones (Hifiman Sundara, for example). Of course, this is optional.  \n  \nI have designed this to enable others to remix, customise, or design their attachments.  \n  \nFeedback, specifically from those who have used/ tested the design, would be much appreciated!",
            "Looks amazing 👌",
            "3d printing is just in another level lately",
            "How does that affect the temperature? There must be a heat bubble around it at all times right? But I do like the idea of having my stack suspended so I don't have to leave it on top of my cpu.",
            "Man, this is really cool. I may have to look into 3d printing some accessories of my own.",
            "Surprisingly, it's not that warm, I have never felt heat from it.\nFor comparison, the Monilith liquid spark is much hotter than the K7 and i can feel that but not the K7."
        ]
    },
    "OG Ananda is $360 on Amazon right now": {
        "title": "OG Ananda is $360 on Amazon right now",
        "score": 102,
        "url": "https://i.redd.it/bytyzom8oz7d1.jpeg",
        "content": "Insane value. Crazy to think you can get an ananda for the price of a sundara. Get it while it lasts! ",
        "num_comments": 39,
        "comments": [
            "This is V2 - stealth magnets.",
            "This is the Stealth, not the OG.",
            "You can also get it refurbished from hifiman.com directly for $300 tax free",
            "Not a big difference from retail",
            "How does this compare to the edition xs",
            "Mine Ananda BT got broken 1 month past the warranty period. Customer support only offered to buy a new unit with a small discount.",
            "Huh, I had no idea that Hifiman shifted the costs of the upper end of their product line up. Gonna be honest. It annoys me that they have 3 different versions of every model. It does nothing but make shopping for what you want more difficult.",
            "I love mine. I do want to try to edition xs but I might jump straight to the aryas. \n\nIt’s crazy coming bs k to headphones and see these prices when last I checked these were way more expensive.",
            "The edition XS are normally in this price range and I’ve heard a lot of people think that the different between that and this isn’t worth the price gap, but with this at similar price is there any reason not to get this over the edition XS (purely in terms of sound, I’ve heard a lot about the controversial headband on XS some people love it many hate)",
            "Remember, if they're anything similar to the Nano, then Voarmaks memory foam velour pads and my custom headband suspension mod transforms them for both sound and comfort 👍\n\nThey're like a new headphone entirely after that, all the details still but not piercing highs and the sub bass is retained perfectly \n\nAmazing what £20 pads can do as well as a cheap diy but factory looking mod to the headband.\n\nThe stock pads are essentially garbage quality. And hifiman has the nerve to out them on even more expensive headphones too...\n\nMy mod: https://youtu.be/RLKuQxR58lI"
        ]
    },
    "FiiO K9 Pro ESS Skylight": {
        "title": "FiiO K9 Pro ESS Skylight",
        "score": 31,
        "url": "https://i.redd.it/s0hfxg9gb18d1.jpeg",
        "content": "K9 showed up in the mail and I've gotten my first day of listening in. Very happy with the upgrade from the Topping L50.\n\n",
        "num_comments": 9,
        "comments": [
            "Looks really nice. Would be cool if you could see the guts though.",
            "Nice! I'm using the topping A30 Pro, with a Fiio M11 Plus. \nWhat earpads do you have on the 109 Pro, please...? How they perform? Thank you!",
            "I went with the 109s and the K9 (no pro) AKM. Really enjoying.",
            "That power cable be like 🍆",
            "Started with a Topping E50/L50 stack, powering the Meze 109 Pros. It came very nicely packaged, the build quality is exceptional (and heavy) and the sound is amazing! On another note, I have not been able to find much info on this Skylight edition aside from it being a limited edition and only 200 units were supposedly produced.",
            "Thanks! I agree, I wish the plastic cover inside was more transparent to see better details, as well as having customizable lighting inside to show it off. But, it is a fantastic looking combo.",
            "Thanks, they are the Dekoni DT Elite Hybrid pads and they are way better than the stock pads. See the link:\n\nhttps://dekoniaudio.com/product/elite-hybrid-ear-pads-for-beyerdynamic-headphones/",
            "Fantastic combo, isn't it?",
            "Thank you very much."
        ]
    },
    "What is the favorite headphone in your collection purely from a music-enjoyment point of view?": {
        "title": "What is the favorite headphone in your collection purely from a music-enjoyment point of view?",
        "score": 7,
        "url": "https://www.reddit.com/r/headphones/comments/1dlsobr/what_is_the_favorite_headphone_in_your_collection/",
        "content": "For me, it has to be the Hifiman Edition XS. I'm still using Resolve's EQ profile to this day, it woeks so well I never really bothered tweaking anything else unlike most other headphones in my collection. \n\nThere's something that feels so complete or simply \"right\" about this package that makes it my go to when I just want to have fun listening to music on my DAP around the flat. \n\nIt's got good treble extension without ever coming across as being sibilant. Good extension in the sub bass while being surprisingly punchy for a planar. The technical performance is just right, enough so that I don't feel like I'm missing anything in the mix (and then some!). The overall frequency response is balanced across the board such that no particular range is overly emphasized or muted. With Resolve's EQ, it has this ever so mild V-shape quality to it, with just a bit of mid to sub bass bump and a touch of treble sparkle that I feel benefits most genres, particularly stuff that uses percussion heavily, like metal. \n\nIt may not have the same imaging precision / separation ability of my HD800, or the soap-bubble popping timbre of the HD6XX/HD600, but I find myself enjoying this pair time and time again without fail when all I want to do is listen to music. If I were to start from scratch with this hobby, I think that the Edition XS is the pair I'd go for and call it a day.",
        "num_comments": 20,
        "comments": [
            "hd600 with cavali tube hybrid was my audiophile heaven for a long while. I don't think I will ever get rid of the 600s.\n\nIn iem, it was se846 with cayin ru6. \n\nedit: iem is tough choice, maybe Andromeda 2020.",
            "Well HD800s because it has the best imaging and separation I mean you can point where everybody is the band ",
            "Clear mg",
            "I have a lcdi4 and a qudelix. I've updated their PEQ setting probably over 10 times in the almost 3 years I've had both. I'll never sell them.",
            "Arya.",
            "Different music genres, different headphones. There no headphones that fits all. But if I had to pick single headphones, I'd go with HD600.",
            "560S",
            "KOSS Porta Pro",
            "KSC75 on PP Headband or the KPH30i on 3D Printed bands. Plays nice with whatever source I have atm",
            "For music listening, it depends on the context and where I listen, so here is my choice:\n\nHeadphone: Hifiman Arya Stealth,\nInears: InEar ProPhile 8,\nTrue Wireless Inears: Apple AirPods Pro 2"
        ]
    }
}