{
    "r/headphones Shopping, Setup, and Technical Help Desk": {
        "title": "r/headphones Shopping, Setup, and Technical Help Desk",
        "score": 4,
        "url": "https://www.reddit.com/r/headphones/comments/1dqjxjb/rheadphones_shopping_setup_and_technical_help_desk/",
        "content": "Looking for advice with a purchase or help troubleshooting a problem? This is the place. This post will be refreshed and replaced when it is 4 days old.\n\n## Purchase Advice\n\n* For purchase advice questions, consider searching and using r/HeadphoneAdvice.\n* Please make use of [this template](https://www.reddit.com/r/headphones/wiki/purchaseadvice). It helps others answer your question. Questions without enough detail will often remain unanswered.\n* Remember that the more specific you are, the better quality the responses you are likely to receive.\n\n## What kind of questions are considered Tech Support:\n\n* How can I fix issue X (e.g.: buzzing / hissing) on my equipment Y\n* Have I damaged my equipment by doing X, or will I damage my equipment if I do X?\n* What does equipment X do, or do I really need equipment Y?\n* Can my amplifier X drive my headphones Y?\n* What's the meaning of specification X (e.g.: Output Impedance / Vrms / Sensitivity)?\n* How should I connect and set up my system hardware or software?\n\n*After asking a question, please be patient since volunteers may not always be immediately available.*",
        "num_comments": 25,
        "comments": [
            "Just got a pair of wireless Back Bay Firstclass 70 ear buds because I've been wanting to go wireless. I've tried a number of times in the past but, but ever time I do I cannot get them to sound like my wires Zero Audio Carbo Tenore headphones, I just love the way the make my music sound.\n\nIs there any way I can make my new headphones sound like my old ones? I downloaded an EQ app but I'm not sure how to get an accurate sound. Any help is appreciated!",
            "So I recently bought a pair of kz zsn pro 2 IEM’s, but when I put them on I realized that one of the cable was bent (like the part that goes around your ears) is there a way to reshape that part or am I gonna have to replace the cable entirely?",
            "Any focal Bathys owners here that can give me an opinion of how are they nowadays with all the updates rolled out by Focal? Any possible flaw I should be aware of before buying them?",
            "I recently bought a used pair of sony wh-1000xm4, everything works except the sound quality of calls is awful and basically not functional. Is this a common issue with these? Anything i can fix in settings or was there something wrong with the ones I bought?",
            "Hi all if I use a 14 ohm impedance IEM with a 6.4 ohm impedance DAP will this affect the IEM sound? Would I need a less then 2 ohm DAP for these IEMs?",
            "Hey yall, I have a pair of DT770 pros, not even a year old, the left side stopped working, not sure why, made a warranty repair request, it was approved, sent them off, they confirmed they received them, a week later they send me an email “thank you for your order” and let me know they were shipping them back to me. A week later, I receive them, nothing has been fixed, it still has the same issue, the left side is still not working. I asked what was wrong with them/what they fixed when they said they were shipping them back to me, never got an email back. So I’ve just emailed them asking them like “what the heck yanno?” But I’m curious if my amp could maybe be an issue with the left side not working? I am not sure though",
            "Hello\n\n I am in europe, so I want to know  as pixel 7 owner if it is better a LG v30 (here it goes for 30-40€ used) or an USB c DAC AMP (maybe a btr3k used, or a proper dongle around 50€) to drive my kph40/30i and some cheap iem at a proper volume. Apple dongle...no, thanks, it is a pain on android, and also with  UAPP it is very poor volume on my kph30i through pixel 7.",
            "Could a damaged cable damage my headphones?\n\nStarting yesterday, the right side of the cable for my HD600's started cutting out at certain angles, and it ended up just not working at all. Would using the cable despite the functionality damage the headphones?",
            "hey guys, I have a schiit magni/modi stack and a yeti nano, used to have hifimans HE400i, sundara, LCD-2Cs, always ran them off the stack, and of course if through the nano, they'd have issues with power (volume) and a noise floor. Recently ended up with a sennheiser HD660s2, trying to A-B the stack and the nano, I dont seem to notice a difference in the noise floor/audio quality, is there still a benefit running it off the stack?",
            "what open back headphones should i get if i love the sony mdr 7506"
        ]
    },
    "These are seriously f*cking good.": {
        "title": "These are seriously f*cking good.",
        "score": 20,
        "url": "https://i.redd.it/wgemdm2e8i9d1.jpeg",
        "content": "\nI made a post yesterday about receiving my HD800s and I just had to make another. After using them for about a day now I can safely say these are elite. I’m just thoroughly pleased with these, they aren’t bass monsters but damn are they exciting to listen to. Another major plus is that they’re the gaming kings. I’m using them primarily for music but it’s good to know I’ve got these at my disposable if I need them. \n",
        "num_comments": 8,
        "comments": [
            "Listened to this song bc of you and it's really good! Would love to see more recs!",
            "Have you tried the Hifiman HE1000SE? I'm on the fence about which to buy.",
            "one the best headphone in my opnion and scale very well especially on tubes it feels like a different beast. ENJOY!!!",
            "This is the part way back in the day where my high school english teacher marks my paper with a red annotation saying 'and? elaborate.'",
            "True by Spandau Ballet is also a classic - it sounds amazing on the 800s' as well",
            "Other 80’s performers that are similar to Spandau Ballet? I guess Howard Jones, Human League, Tears for Fears are in the same general ballpark. Culture Club is a bit different, but kinda adjacent.",
            "No I haven’t yet. I’ve got Arya Stealths, but never owned anything more premium than that (from the HiFiMan Line)",
            "I really want a tube amp but the desktop options are just a little out of budget for me after buying this 😂"
        ]
    },
    "Collection": {
        "title": "Collection",
        "score": 21,
        "url": "https://i.redd.it/ijycuurvfh9d1.jpeg",
        "content": "Current collection I’ve kept after 4 years\nHeadphones:\nHD800s\nUtopia 2022\nSusvara (have an Sus Unveiled otw)\nDiana TC\n\nAmps/Dac:\nGSX mini\nBakoon 13R\nAuris Nirvana\nA90\nD90\nChord Qutest\nBricasti M3\n",
        "num_comments": 11,
        "comments": [
            "That's the yearly wage I have in my country in audio equipment. Impressive.",
            "My susvara is my endgame, I plan to get a Holo Bliss KTE, or A Ferrum Stack with a PrimaLuna Evo 300 preamp to complete the setup. I still end up using my HD800s quite a bit, the sound staging is always something fun. Other than that I want to try adding some IEMs into this collection but I don’t know where to start.",
            "What mic is that??, Neumann??",
            "Which one is the best?",
            "Wow, nice spread of headphones!",
            "Mega5est, Mest MK2, IER-Z1R, Symphonium Audio Crimson or the Multiverse Mentor.\n\nAll of them are easily end game stuff and TOTL in every regard. BUT, if you never want to buy an IEM again, get a Multiverse Mentor.",
            "Yeah, the TM 103 I believe, I have a Apollo twin but it doesn’t seem to want to work with my windows PC",
            "Okay cool!! Do u have windows 11?",
            "Windows 10, maybe it would work with 11, but there’s a constant crackling noise whenever audio is picked up I can’t seem to fix",
            "Okay are u tried update a firmware ?"
        ]
    },
    "Got my endgame ": {
        "title": "Got my endgame ",
        "score": 75,
        "url": "https://i.redd.it/lu665icf5f9d1.jpeg",
        "content": "Got these Arya Stealths for 599 refurbished on the Hifiman website, and they even came with a second cable and a 1 year warranty. Can't believe I spent less on my endgame than my previous headphone. ",
        "num_comments": 18,
        "comments": [
            "I just upgraded to these from the Sundara. It's going to be difficult to listen to the other headphones now.",
            "Is there any problem with your unit or is it like new? Mine is currently stuck in Canadian customs and the wait is killing me.\nBtw the coupon AY79OFF takes another 50$ off",
            "Mine too, got a longer, balanced cable",
            "Good haul. I have the Stealth as my main right now. I stepped up to them from the Arya.",
            "I actually just got my Arya Stealth refurbished today as well. Definitely enjoying them. The bass is so linear compared to my 6xx. Treble can be a bit spicy at times. I might mess around with oratory's EQ setup and see if I like it. But I'm definitely enjoying the sound for now",
            "An almost perfect headphone to my ears",
            "Congrats, your happiness is what matters! I can say I hated them, switched from Sundara to them (with EF600 amp). And I had a chance to listen to Arya Organic and they are perfect, they are polar opposite to Arya Stealth and I love them! They beat Meze Elite, Liric2 and Empyrean2 for me!",
            "I'm SO jealous, literally waiting on mine to arrive, got them on the recent sale as well.",
            "ive a set of the arya organic and have loved them so far",
            "Pair it with an RME ADI-2 DAC FS for complete control over your sound and live in bliss."
        ]
    },
    "RIP!! to qkz x hbb": {
        "title": "RIP!! to qkz x hbb",
        "score": 13,
        "url": "https://i.redd.it/kndo1f8idh9d1.jpeg",
        "content": "Broke iems by stepping on them. definitely gonna be careful now. at least they still work also they don’t fall out of the connector pins as easy now lmao\n",
        "num_comments": 20,
        "comments": [
            "I feel you. I listen in bed each night; it’s hard remember to take my IEMs out before I snooze out, but I don’t want to wake up to instant tears.",
            "Literally what happened to mine \n\nIf you wanna make it last putting mighty bond on the thing and never ever remove the cable after",
            "i’m 14 so i don’t really have a steady source of income so i full on *almost* cried",
            "Yeah this happened to my Tangzu wan er as well. But it did give me a learning experience as to not buy iems with this type of pins",
            "mine is the qkz x hbb and my quality is decent although it does feel a little greasy",
            "i use them for gaming and nothing else so i don’t need to remove them from the cable",
            "are the pins just broken off inside?",
            "yeah i’m thinking of super gluing",
            "Superglue it then never remove it after para magamit mo",
            "nope the pins are fine it’s the side part of it that sort of bent the whitish part"
        ]
    }
}