{
    "Helluva Boss APOLOGY TOUR // S2: Episode 9 Official Discussion Post (PLEASE READ)": {
        "title": "Helluva Boss APOLOGY TOUR // S2: Episode 9 Official Discussion Post (PLEASE READ)",
        "score": 572,
        "url": "https://www.reddit.com/r/HelluvaBoss/comments/1dm08fh/helluva_boss_apology_tour_s2_episode_9_official/",
        "content": "This is the official discussion post for the latest episode of Helluva Boss  Any posts, outside the official discussion post, DISCUSSING or SHOWCASING the latest episodes in ANY CAPACITY will be automatically REMOVED. This restriction and discussion post serves to reduce the influx of spam which occurs during a release of a new episode and will be lifted after 2 days. Any attempts to circumvent this restriction may result in a temporary ban.  P.S. fanart posts are the exception to the restriction but must be appropriately tagged with the spoiler tag.",
        "num_comments": 1275,
        "comments": [
            "Without realizing it, this is exactly how I wanted the aftermath of Full Moon to be handled. There was no episode-long gap away from Blitz and Stolas to focus on different characters and draw out their fight. There was no escalation due to them being purposefully dense. We got several lovely, frank conversations of growing self-awareness and the realization that it's only step one. Good, they recognize what the issues were. Now they get to grow and actually work on them. I also loved how Verosika was handled. She's pissed, and rightfully so - and she acts like a pissed off person who really loved Blitz and still wants to see him make things right.",
            "I should not have laughed as hard as I did at Stolass previous Halloween party.",
            "Lmao at Mrs. Mayberry getting it with the woman she took a hit out on.",
            "I can only applaud the decision to not have them get back together immediately. \n\nHoly shit. Stollas getting a fun night and feeling desired again? Sign me the fuck up!",
            "Cant believe they brought back Do [a] sex.",
            "Also, Stolas has a cult. I suppose every Goetia and sin has a cult. And does Charlie have a cult?",
            "Martha and Mayberry. That I didn't expect.",
            "I feel bad for everyone who analyzed the stolas singing clip from the trailer, correctly surmized they were on earth on Halloween but then understandably cane to the incorrect conclusion that itd only happen in the Halloween episode lol",
            "Wow! First of all, congratulations to all the Verosika simps on being right! I really thought when we got the full story she'd end up looking at least a little shitty herself, but nope.\n\nAlso, is anyone else kinda conflicted because they still want Blitz and Stolas to get back together, but on the other hand, that succubus guy is HOT?",
            "So I'm going to be the first to ask, who thinks Stolas got laid with 'Better than Blitzo' guy? I like to think he did, but it's going to be a comparatively healthy one night stand kind of arrangement."
        ]
    },
    "New pride month image from the Helluva Boss Twitter": {
        "title": "New pride month image from the Helluva Boss Twitter",
        "score": 8849,
        "url": "https://i.redd.it/uf7amrx4hy8d1.jpeg",
        "content": "",
        "num_comments": 1307,
        "comments": [
            "The fact Stella isn't there, but her brother is, is fucking hilarious.",
            "This looks awesome! Also, good way to confirm everything. Good to know Andy is also just zesty and not lusting after Stella.\n\nIn other news, a fleet has gone missing...",
            "With a lot of the Goetia being gay, no wonder Paimon had to force Stolas to marry Stella ",
            "Mammon, the ace rep I never asked for. (jk, as a MBA I love it)",
            "Ok not the point but it would be funny if striker is the token straight guy in the show, another reason every one in hell irks his toxic ass lmao. Great art, kinda surprised Octavia is ace but that's pretty cool!",
            "Stolas out here serving kink at pride",
            "Love Millie being the token straight",
            "Welp. So this confirms the theory that Mammon really doesnt like the sex fizzies but still goes through with them cause they make money",
            "Barbie slays with her design in most situations but the gold hoops on the horns as a form of earrings is like S++ character design.",
            "I also love Blitz topless with rainbow paint being wild while Stolas is strutting his stuff in a regal outfit."
        ]
    },
    "Stolitz Body-Swap (Art by Coyotepretty)": {
        "title": "Stolitz Body-Swap (Art by Coyotepretty)",
        "score": 1421,
        "url": "https://i.redd.it/bms2xy4kue9d1.png",
        "content": "",
        "num_comments": 97,
        "comments": [
            "I would kill for a freaky friday ep in the actual show.",
            "I bet learning how to walk around with Stolas's long ass legs is a nightmare. ",
            "No joke, Blitz's eyes on stolas's body makes him look like The Grinch",
            "Moxxie would immediately suspect something was wrong when his boss didnt insult him or make fun of his dick size and Stella wouldnt like that her victim told her off.",
            "Blitz first action is totally stroking his bird dong, don't even try to deny it.",
            "Blitz: Christ on a stick am I really that short compared to you?!",
            "I fucking kill for a fic after this concept",
            "Somehow, I was able to read this in Blitz's voice with Stolas' inflection",
            "That'd be fucked up, but also funny\nI like the \"take a walk in my shoes\" vibe too",
            "Not gonna lie, they probably need a Freaky Friday situation just to fix their issues."
        ]
    },
    "Symbolism??": {
        "title": "Symbolism??",
        "score": 2301,
        "url": "https://www.reddit.com/gallery/1dqwadj",
        "content": "Okay this might make zero sense but hear me out okay?\n\nSo in Apology Tour during the fight between Verosika and Blitz we see this clip of them sitting down. Blitz is sitting with his legs between the poles creating an impression of him behind bars like in a Jail cell. Verosika however kicks one of the poles out and sits in the open space left behind.\n\n (See second image for visual details)\n\nCould this be symbolism for their feelings? Verosika being open about hers while Blitz keeps all of his locked up behind his happy facade?",
        "num_comments": 137,
        "comments": [
            "Those glorious thighs wouldn't fit between the bars. But I like that you weren't thinking horny, first time in this sub",
            "That makes sense. I kinda think it was because Verosikas legs couldnt fit between the poles.",
            "i highly doubt thats why, Verosika is just much larger than Blitz, and wouldnt be able to fit comfortably the way he is sitting",
            "I wouldn't put it past the team to use symbolism in this way. They've been pretty good at doing small details and symbolism. I think on the surface level it is because she can't fit between the bars. But then again they also could have just made the bars wide enough for each of her legs to fit through.\n\nThe thing that stuck out more to me is Verosika sitting down to be on almost the same level as Blitz. Which shows her trying to see from his POV and understanding him, rather than looking down on him from the top and talking down to him.",
            "Reminds me of those stupid twitter beta male things with the triangles and the arrows on couples pics",
            "Ooh, I like that interpretation. Similarly, I think it could also be that Blitz is still imprisoned by his past, whereas Verosika's way is free for her to move on now. That and the bars probably couldn't contain her glorious thighs",
            "Yeah, I think you're right tbh",
            "Nah, it's probably because verosika's thicc thighs wouldn't fit in between the fences unlike blitz's skinny legs",
            "Blitz still feels trapped. Verosika is free.",
            "Verosika looks better with short hair.  \nYes I know its tied up in a tail & off to the side.  \nJust zoom in a bit on her face to see what I mean."
        ]
    },
    "Hell is Forever 😈": {
        "title": "Hell is Forever 😈",
        "score": 1246,
        "url": "https://www.reddit.com/gallery/1dqzlfq",
        "content": "Breaking news: Jesus heckler not okay with being heckled.",
        "num_comments": 209,
        "comments": [
            "Jesus saves, Mammon invests wisely. :)",
            "Do yall ever think about the fact that Fizz would probably sound just like Adam if not for the fire",
            "Well if hes not okay with it then tell him to seek unemployment cause thats what hes doing",
            "I would loudly play Hell is forever on my phone if I wasnt so nervous about confrontation",
            "Needs an Adam Cosplayer\n\n![gif](giphy|l7jAMfirihQFQi4hxN)",
            "Fucking Evangelicals \n\nI am very religious and I hate these people",
            "*random guy on the other side of the street*\n\nwhy is a there a medieval jester acting weird with one of those religious doom preacher? maybe its a YouTuber thing or something",
            "As a devout Christian, if someone in a fizz cosplay came up to me my first reaction would not be to try to convert them, it would be to ask for a pic and cosplay tips",
            "Nah let me fall buddy",
            "This is amazing and your cosplay is beautiful as well"
        ]
    }
}