{
    "Q&A Megathread (Ask your questions here!) ": {
        "title": "Q&A Megathread (Ask your questions here!) ",
        "score": 428,
        "url": "https://www.reddit.com/r/Helldivers/comments/1beilg1/qa_megathread_ask_your_questions_here/",
        "content": "Greetings, Helldivers!\n\nSo we have noticed that most Questions asked on the subreddit don’t need their own post therefore we have decided to create this Q&A Megathread, a place where all Helldivers can ask questions and get help/advice from others. And if you decide that what you have to ask requires a separate post then you should know that we will be actively moderating and critically assessing the quality of those posts to lessen the amount of reposts and low-effort content on this subreddit.\n\n**If you're here to help out by answering questions we thank you** 🫡  **Just please make sure to sort the post by 'New' (if it isn’t already) so you can see the newer, unanswered questions.**\n\n\n\nP.S. This megathread has been added to the sidebar.\n\n\n\n— The r/Helldivers Mod Team",
        "num_comments": 11857,
        "comments": [
            "Why does my strategem sometimes bounce from enemies and sometimes stick?",
            "In the new update whenever I log back into the game my character voice, emote and weapons are all reset and it keeps telling me new stratagems are available when their not; customise your arsenal; and check the war table where it keeps giving me the major order from super earth every time. How I fix?",
            "Do Helldivers have a weak spot? Damaging limbs seems to be very effective until they seemingly harm themselves with a stick to their thorax. How is DEMOCRETY destroyed? Any help is thankful.",
            "When are they going to fix friend requests on cross play? I convinced my friend to buy this game and now we can't play together.",
            "Can anyone explain what the new booster does?",
            "Has the issue of not being able to add people cross platform been fixed with the new update?",
            "Since the most recent patch, has anyone on PS5 had an issue where your voice pack, primary and secondary gun, and emote are reset every time you log in? I also have all the tutorial pop ups even though I have 90+ hours in the game. \n\nThis issue only popped up for me after the patch that went out on Monday I think?",
            "Anything on the cross platform friend request glitch? Is it fixed? I'm not able to accept the request from my pc friends",
            "Ok, please clarify. I once shot 5 EATs to the face of bile titan and it was still fine. Where should I be aiming the EAT instead? I bring an autocannon too fyi.",
            "Can we get a major orders megathread? I figured it could help with coordinating defense major orders."
        ]
    },
    "🛠️ PATCH 01.000.403 ⚙️": {
        "title": "🛠️ PATCH 01.000.403 ⚙️",
        "score": 2148,
        "url": "https://www.reddit.com/r/Helldivers/comments/1do1rdp/patch_01000403/",
        "content": "# 🌍Overview\n\nFor this patch, we have made improvements and changes to the following areas:\n\n* Crash fix related to the FAF-14 Spear\n* General fixes\n\n# General\n\n* Japanese language voice-overs are now available globally on PS5 (also on PC).\n\n# 🔧Fixes\n\n**Crashes**\n\n* Fix for crash happening when players with unique hellpod patterns leave during hellpod launch cutscenes\n* Crash fix while aiming with the FAF-14 Spear\n\n**Misc fixes**\n\n* Fixed corrupted text showing \"?\" for some characters when having Traditional Chinese language selected\n* Fix for Plasma Punisher being unable to shoot out of the SH-32 Shield Generator Pack and the FX-12 Shield Generator\n* Fixed so the Quasar Cannon has the correct change to its heat when on hot and cold planets\n* Fixed issue where Spore Spewer would appear purple on certain planets\n* Fixed some cases where pink question marks would appear in missions on various planets\n* Fixed Peak Physique armor passive not properly affecting weapon ergonomics\n* Fixed issue where available Operations were reset after player reconnected from getting kicked due to inactivity\n\n# 🧠Known Issues\n\nThese are issues that were either introduced by this patch and are being worked on, or are from a previous version and have not yet been fixed.\n\n* Sending friend requests via friend code in game currently does not work\n* Players may be unable to be joined or invited to the game\n* Players added to the Recent Players list will appear in the middle of the list\n* Players may experience delays in Medals and Super Credits payouts\n* Enemies that bleed out do not progress Personal Orders and Eradicate missions\n* Deployed mines may sometimes become invisible (but remain active)\n* Arc weapons sometimes behave inconsistently and sometimes misfire\n* Most weapons shoot below the crosshair when aiming down the sights\n* Stratagem beam might attach itself to an enemy but will deploy to its original location\n* Hand Carts ship module does not reduce Shield Generator Pack's cooldown\n* Superior Packing Methodology ship module does not work\n* Bile Titan sometimes does not take damage to the head\n* Players may become stuck in the Loadout when joining a game in progress\n* Reinforcement may not be available for players who join a game in progress\n* Planet liberation reaches 100 % at the end of every Defend mission\n* Raise Flag of Super Earth objective does not show a progress bar\n* Mission count in the Career tab is being reset to zero after every game restart\n* Some weapons’ descriptions are out-of-date and don’t reflect their current design\n\n...................\n\n[Patchnotes Megathread](https://www.reddit.com/r/Helldivers/comments/1bd6hse/helldivers_2_patch_notes/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
        "num_comments": 992,
        "comments": [
            "Spear users tentatively holding their breath.... \"is it working? Can we come out now?\"",
            "* Fixed Peak Physique armor passive not properly affecting weapon ergonomics: time to test",
            "Superior Packing Methodology still not fixed. Bummer...",
            "ballistic shield bugs arent even in the known issues smh",
            "why i feel like there's going to be some new bug with spear.. hope it's finally fixed.",
            "Ill be back when pc optimisation is better, hopefully soon because i actually want to be back ",
            "when will they fix those known issues I feel like they are known but unfixed for 5 patches in a row  lmao",
            "Salute to General Fixes! Long time no see! Send my regards to General Crash!",
            "Still havent been able to play with my brother. Fix the damn friends system!",
            "Where are my frames Arrowhead?"
        ]
    },
    "750 hours later and all I can say is this...": {
        "title": "750 hours later and all I can say is this...",
        "score": 709,
        "url": "https://www.reddit.com/r/Helldivers/comments/1dr7q19/750_hours_later_and_all_i_can_say_is_this/",
        "content": "Thank you Arrowhead.\nThank you Everyone who contributed.\nThank you Volunteers.\nThank you Community Managers, Moderators both discord and Reddit.\nThank you Sony (but screw you also you know why)\n\nBut most of all. \nThank you to all of you amazing Helldivers.\nThe player community.\nNever have I had the honor and pleasure of being apart of such a fun, loving, dedicated, unfiltered, and just above all outstanding Community of players in all my years of gaming! You all have by far been the best player base that I have ever seen, Not only giving positive feedback, new suggestions and input but also not pulling any punches when it came to calling out poor behaviour, additions, management, and so on and so forth while also remaining reasonable and respectful and fair towards those it was directed against.\n\nOf course I have to acknowledge how receptive, transparent, accountable and professional Arrowhead has been with the Helldiver Community and Game. Aswell acknowledge the incredible work they managed to accomplish given the overwhelming growth and popularity the game achieved in such a short time especially when you take into account the size and budget of Arrowhead as a studio at the beginning and still to this day. They have shown how much they love a care about the game and it's Community and I want them to know that has not gone unnoticed or unappreciated.\n\nI have now logged over 750 hours playing Helldivers 2 and I can confidently say I still am not remotely tired or feeling burnt out and enjoy each mission as much as my next. \n\nSo my fellow Helldivers with 750 hours surpassed all I have left to say now is Glory to Super Earth! Praise Liberty! And for the love of Freedom let's spread some Managed Democracy!\n\nI'll update again when I hit 1000 hours, until then, Spill Oil, Squash Bugs",
        "num_comments": 137,
        "comments": [
            "![gif](giphy|KAf66yGCa93uTqod1q)\n\nWe all salute you Sir!",
            "750 hours well spent! Your expertise must be off the charts by now.",
            "Dude, same here... I'm like 600 hours in right now.\nAnd I will be playing today same as yesterday",
            "This game is truly something special.",
            "Me reading this in a banned country:",
            "That's about 4.5 hrs per day, every day so ce launch. Does that sound about right to you?\n\nNot doubting, just doing napkin math.",
            "I salute you sir! Thanking even Sony shows true magnanimity (hope it's the right word, english is not my native language :P)",
            "Agreed. I have also sunk well over 500 hours in it. I do miss the defense missions though",
            "While I have the chance to ask, do you think the game was better several months ago, or now? Also I need your opinion on the eagle smoke strike for undisclosed reasons.",
            "Its a good casual game to jump into after a long day at work for an operation"
        ]
    },
    "Tried to be edgy. Failed miserably. ": {
        "title": "Tried to be edgy. Failed miserably. ",
        "score": 16803,
        "url": "https://v.redd.it/1hu574vzwc9d1",
        "content": "",
        "num_comments": 460,
        "comments": [
            "I like your cut, G.",
            "This is the coolest shit I've ever seen",
            "Holy shit that was brutal as fuck",
            "Was that their head falling out of the sky at the very end?",
            "\"He flew too close to the sun\"",
            "\"I once watched a man get roundhouse kicked in the head by an exploding four-story bug\" and other stories by B4 in the background there",
            "The way your character collapses after being decapitated feels so real. This game has so much polish with some of its animations.",
            "was that the head landing in the background at the end?",
            "I'm saving this to always come back to to remind myself to never be cock",
            "That was some final destination shit right there"
        ]
    },
    "Made this for my discord friends. Maybe you'll find it funny too": {
        "title": "Made this for my discord friends. Maybe you'll find it funny too",
        "score": 8664,
        "url": "https://i.redd.it/e26ktkurrc9d1.png",
        "content": "",
        "num_comments": 278,
        "comments": [
            "FOR ROCK AND STO- err...\n\nFor Democracy!",
            "I want music integration so I can listen to heavy metal while helldiving",
            "Democracy for the Democracy Spreaders.  Liberty for the Liber-tea Mug",
            "One is openly fascist, and another is basically the west but more hardcore. I pick both.",
            "I chose both options. For Super Terra!",
            "This is the illusion of choice. Both, the answer is both. because the outcome is the same.",
            "That Space Marines is Leandros. Leandros is a colossal douche. Super Earth all the way, baby!",
            "FOR ATOMA\nFOR ROCK AND STONE",
            "For the Emperor of Democracy !",
            "\\*Ducks under the sign and proceeds straight into the mountains\\*\n\n\"FOR THE EMPEROR OF DEMOCRACY AND CARL! ROCK AND STONE!\""
        ]
    }
}