{
    "Weekly Recap - June 20, 2024": {
        "title": "Weekly Recap - June 20, 2024",
        "score": 8,
        "url": "https://www.reddit.com/r/help/comments/1dkglzj/weekly_recap_june_20_2024/",
        "content": "Hello! Another week, another recap! So without further ado...\n\n**Top  posts**\n\n* **[I don't understand Reddit](https://www.reddit.com/r/help/comments/1dgiz2d/i_dont_understand_reddit/)**\n\n* **[Moderator harassed, insulted me](https://www.reddit.com/r/help/comments/1dfibnc/moderator_harassed_insulted_me/)**\n\nA user made a comment in a subreddit and then received a message that it had been removed by a moderator for being off-topic. They were genuinely confused by the removal, but moved on. Later, they felt that all of their content was being removed from all subreddits and were wondering if a moderator had the ability to do that. \n\nAnd the other user felt that a mod was harassing and insulting in their responses to them. \n\nBoth of these are definitely not ideal situations. Moderators do have the ability to remove your content within the subreddit that they moderate, but they are unable to extend that permission to subreddits that they do not moderate. \n\nIf you feel that your content is not showing up in the sub, feel free to contact the moderators of that subreddit. Their contact information can be found on the sidebar of the sub on desktop or by tapping the three dots in the upper right and tapping \"Message moderators\" on the mobile apps.\n\nIf you feel that the moderators are acting in bad faith, you have a couple of options. If you would like to file a report about a subreddit, you can use [this form](https://reddit.zendesk.com/hc/en-us/requests/new?ticket_form_id=360001103212). \n\nAnd if you would like to report a Moderator Code of Conduct violation, you can use [this form](https://reddit.zendesk.com/hc/en-us/requests/new?ticket_form_id=179106). \n\n* **[Is it a bug or a feature? Previously, I could return to the feed from a post with just a click on the side. Now, I have to use the back button, and it takes me all the way up to the top. This issue occurs when I use the new.reddit.com page.](https://www.reddit.com/r/help/comments/1degkk3/is_it_a_bug_or_a_feature_previously_i_could/)**\n\nBoth! Returning your feed to the top so that you lose your place is not intentional. I have flagged that to the appropriate team and that is being worked on.  But I'm sorry to report that the other part is intentional. I am happy to pass along constructive feedback about that to the team, though!\n\n**TOP HELPERS FOR THE WEEK** \n\n* jgoja\n* Timozkovic\n* IMTrick\n* formerqwest \n* Markiemoomoo\n* sea_stomp_shanty\n* tumultuousness\n* Eclectic-N-Varied\n* TheOpusCroakus\n* antboiy\n\n\n\nY'all are [rock stars](https://i.giphy.com/media/v1.Y2lkPTc5MGI3NjExZjQ3bXNhNXU5b2RxemE3Nnljd3YxbzY0bGQ3NTdqYnhuMjZ6cW12byZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/xT5LMwo52zAlr8TsAM/giphy.gif)! Thank you so much for your help! I appreciate everyone so much! \n\nThat's it for this week! Ready, set, GO! =)",
        "num_comments": 10,
        "comments": [
            "Thank you for the report.\n\nThis was a fairly calm, quiet week. Lots of reports as always but no big trends that I have seen. But my time was down again this week so I may have missed something.\n\n**In very old business.** The algorithm has continued to be problematic. Not showing some subreddits on peoples feeds at all, showing all new content on the app home feed. Reports still are coming in. We also still have reports of not posting in profile or sub. Yesterdays [post](https://www.reddit.com/r/help/comments/1dk0ak8/comment/l9f43vn/?context=3) was android app.\n\n**New UI.**  Same issues and under performing as always\n\n**Issues.** Some Reddit's Filter reports again here. They did seem to be down this week so I am hoping they took our feedback into consideration\n\n**Issue.**  We have regularly received reports of not being able to add subreddits to custom feeds. To my recollection most have been from the app but I am not sure the percentages. The two yesterday were on the Android app. Uninstalling and reinstalling and clearing cache sometimes allow one more. The first one linked below from yesterday mentioned adding 10 subreddits, but only 2 added. I have linked the two from yesterday, but I can see if there are any more in the few days I can see on the feed if you need them.\n\n[https://www.reddit.com/r/help/comments/1dja4k5/comment/l9esn90/?context=3](https://www.reddit.com/r/help/comments/1dja4k5/comment/l9esn90/?context=3)\n\n[https://www.reddit.com/r/help/comments/1djsk70/cant\\_add\\_communities\\_to\\_custom\\_feed/](https://www.reddit.com/r/help/comments/1djsk70/cant_add_communities_to_custom_feed/)\n\n[https://www.reddit.com/r/help/comments/1dk5a42/i\\_cannot\\_add\\_anything\\_in\\_my\\_feed/](https://www.reddit.com/r/help/comments/1dk5a42/i_cannot_add_anything_in_my_feed/)\n\n**Issues**. This is a newer issue I noticed yesterday and hope to get ahead of since we I have room this week. Some people who have set their account settings to opt out of redesign are getting put into [new.reddit.com](http://new.reddit.com/) . Not the old reddit they want and not the current reddit. There were 2 reports of this, but the other appears to have been deleted.\n\n[https://www.reddit.com/r/help/comments/1djacjf/when\\_i\\_log\\_in\\_i\\_am\\_given\\_newredditcom\\_despite\\_me/](https://www.reddit.com/r/help/comments/1djacjf/when_i_log_in_i_am_given_newredditcom_despite_me/)\n\n**Issues**: Over time we occasionally see reports of ads in one of the opt-out categories that always get through. I am not talking the occasional add because I know it is not 100%, but a specific add that falls in a category not be removed at all. You provided the ad report form previously for inappropriate ads, but can anything besides the normal reporting be done with them. Even though it is said reporting works, I have never seen that to be true. Here is the post that prompted this.\n\n[https://www.reddit.com/r/help/comments/1djqy52/disable\\_ads\\_not\\_working\\_properly/](https://www.reddit.com/r/help/comments/1djqy52/disable_ads_not_working_properly/)\n\nThank you for reading my ramblings.",
            "can we get some help for /u/TheOpusCroakus on /r/redditrequest\n\n:) \n\nSeems Opus the only active admin there doing any of the work! \n\nbased on all the other admins post history, some not even active anymore :(",
            "The sitewide filters are completely unfit for purpose and there's no recourse when they go awry.  Removal has happened so often that mods are unwilling to unblock content and rightfully so—they'd be absolutely overwhelmed with the number of requests.  \n\n*Why* is there no accurate, automated override for wrongly removed content?  I've probably had well over 100 comments quashed by now because of some filtering function (don't know which one).  My posts tend to be longer and informative, but apparently that's considered spam.  For the admins, many links to removed comments are here, if you're curious as to content: [https://www.reddit.com/r/bugs/comments/1d8vdmv/desktop\\_web\\_reddits\\_sitewide\\_spam\\_filter/](https://www.reddit.com/r/bugs/comments/1d8vdmv/desktop_web_reddits_sitewide_spam_filter/) \n\nBy the way, I am still seeing a bug where if a person replied to one of my (eventually) deleted comments, the reason for the removal is \"Comment removed by moderator\".  I am *very* certain the comment was not removed by a moderator.  When a comment is removed but *doesn't* have any replies or child comments, there is no reason given for removal: it's just a blank space when logged out.",
            "It wouldn't be a Thursday without your much appreciated not-ramblings! =)\n\n* I just checked with the team that is working on the disappearing posts issue. They have been working on it and feel that it should be happening less frequently within the last month or so. Would you say that is the case or that there it has increased/stayed the same? I also learned that the fixes that have been implemented for this may not have had the same effect on gallery posts. \n\n* Will share the new UI feedback with that team. It should be getting better! \n\n* Glad to hear some of the filter reports are going down! \n\n* I was able to reproduce not being able to add a sub to a custom feed on Android, but I wasn't able to do it on iOS. I've flagged this to the team and a ticket has been created and it is actively being looked into at this time. \n\n* For the issue with not going to old.reddit.com, I was able to reproduce this (and I'm not thrilled about it)! I am flagging this right now to get someone on it. I don't think that should be happening. Thanks for the early heads up! The workaround would be just to log into old.reddit.com with that setting on. \n\n* Users shouldn't be seeing ads from categories that they've opted out of. I'd be interested in where this is happening (desktop or mobile) and which sort of ads (home feed, comments or sidebar). \n\nWhew! I think I've just talked to every team at Reddit this morning. LOL",
            "Hi! Sorry that you're having trouble. Do you have an example of a comment that says it was removed by a mod when it wasn't? Thanks!",
            "Hello, thank you for responding.  Yes, I have quite a few that claim they're removed by moderators.\n\n\n\n[https://www.reddit.com/r/BuyItForLife/comments/1d0dd7f/comment/l5o8wn6/](https://www.reddit.com/r/BuyItForLife/comments/1d0dd7f/comment/l5o8wn6/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1d3wslx/comment/l6e9jee/](https://www.reddit.com/r/BuyItForLife/comments/1d3wslx/comment/l6e9jee/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1d3qyxm/comment/l6bdjz2/](https://www.reddit.com/r/BuyItForLife/comments/1d3qyxm/comment/l6bdjz2/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1d3qyxm/comment/l6bb1uj/](https://www.reddit.com/r/BuyItForLife/comments/1d3qyxm/comment/l6bb1uj/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1d3qyxm/comment/l69nzg8/](https://www.reddit.com/r/BuyItForLife/comments/1d3qyxm/comment/l69nzg8/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1d0dd7f/comment/l66jtq8/](https://www.reddit.com/r/BuyItForLife/comments/1d0dd7f/comment/l66jtq8/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1d0dd7f/comment/l5rma04/](https://www.reddit.com/r/BuyItForLife/comments/1d0dd7f/comment/l5rma04/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1d0dd7f/comment/l5rdzgt/](https://www.reddit.com/r/BuyItForLife/comments/1d0dd7f/comment/l5rdzgt/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1d0dd7f/comment/l5qy0pt/](https://www.reddit.com/r/BuyItForLife/comments/1d0dd7f/comment/l5qy0pt/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1cxhydv/comment/l56k2tm/](https://www.reddit.com/r/BuyItForLife/comments/1cxhydv/comment/l56k2tm/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1czlntx/comment/l5hcrxu/](https://www.reddit.com/r/BuyItForLife/comments/1czlntx/comment/l5hcrxu/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1bdavoz/comment/kuoarqy/](https://www.reddit.com/r/BuyItForLife/comments/1bdavoz/comment/kuoarqy/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1b77vv0/comment/kthhfyq/](https://www.reddit.com/r/BuyItForLife/comments/1b77vv0/comment/kthhfyq/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1b77vv0/comment/ktgvodb/](https://www.reddit.com/r/BuyItForLife/comments/1b77vv0/comment/ktgvodb/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1aipn9w/comment/kpnm8zi/](https://www.reddit.com/r/BuyItForLife/comments/1aipn9w/comment/kpnm8zi/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1djng65/comment/l9de0xc/](https://www.reddit.com/r/BuyItForLife/comments/1djng65/comment/l9de0xc/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1djncrc/comment/l9cf85o/](https://www.reddit.com/r/BuyItForLife/comments/1djncrc/comment/l9cf85o/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1ddg0zt/comment/l859yax/](https://www.reddit.com/r/BuyItForLife/comments/1ddg0zt/comment/l859yax/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1das8qr/comment/l7pyilu/](https://www.reddit.com/r/BuyItForLife/comments/1das8qr/comment/l7pyilu/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1das8qr/comment/l7pifdq/](https://www.reddit.com/r/BuyItForLife/comments/1das8qr/comment/l7pifdq/)\n\n[https://www.reddit.com/r/BuyItForLife/comments/1das8qr/comment/l7mqyvj/](https://www.reddit.com/r/BuyItForLife/comments/1das8qr/comment/l7mqyvj/)",
            "Hi! Thank you so much for those links. This is interesting! I have shown this to the correct team and it's being looked into. \n\nAppreciate you taking the time to grab all of those! Impressive! =D",
            "Thank you, I appreciate your time and help.  😊"
        ]
    },
    "How to use Reddit properly ?": {
        "title": "How to use Reddit properly ?",
        "score": 7,
        "url": "https://www.reddit.com/r/help/comments/1dlqw13/how_to_use_reddit_properly/",
        "content": "I have just started using Reddit, and I am not familiar with the cultural here. Is there any guide/rule I should be following?\n\n*Thank you for your comments, Redditer!*",
        "num_comments": 14,
        "comments": [
            "1. Upvote things you like, comments that express what you're thinking, comments that are helpful or that explain something well, comments that someone clearly put some effort into, and as a courtesy, I usually upvote any comment that I reply to.\n2. Downvote things that are false or misleading, comments that express bigotry or are otherwise intended to cause harm, comments that add nothing to the discussion, or comments that are obviously fishing for upvotes (you'll learn to recognize these as you become more familiar with the site). Note that you should not downvote things just because you do not like them or because you have a difference of opinion with someone. In those cases, simply do not upvote.\n3. Before commenting yourself, check to see if someone already said what you were going to say. If so, upvote that comment instead of repeating what's already been said.\n4. Read the article, not just the headline. Headlines can be misleading, they're usually written by an editor who did not write the article. Sometimes the people you encounter in the comments didn't read the article, and when that happens, it shows.\n5. If the post is an image with text on it, or a video of someone unknown to you, and it is making claims of fact, do not upvote it unless you already know it is true, or until you have verified for yourself that it is providing true and accurate information.\n6. If you're debating with someone, link to reputable sources when making claims of fact that are not widely known or are in dispute. This isn't required, but it is customary, and it will make your argument stronger and more convincing to others who are reading.\n7. Don't take downvotes personally. Sometimes your post or comment will get downvoted for no apparent reason, or reasons that are not immediately clear to you, and nothing will earn more downvotes than complaining about downvotes. Take your licks and move on.\n8. The /all feed is mostly garbage because most people don't do what's in suggestions 1 through 5. Search for subreddits about topics that interest you and subscribe to those. The buttons marked Best, Hot, New, Rising, etc. only show you results from subreddits you've subscribed to. You'll get the most out of the site by focusing on your own areas of interest or expertise.\n9. There are different rules in each subreddit and you should read them before posting or commenting. Moderators have nearly unlimited discretion in their own subs and **they are not required to be fair or helpful**. There is no one to complain to if the mods simply don't like you, all you can do about it is find a better sub, or create one of your own. That said, most mods are nice as long as you are nice to them. Don't fly off the handle or attack them if they do something you don't like or agree with. Approach them calmly and politely and they will usually explain where things went wrong.\n10. Just something I've learned after long experience and observation: The third top nested comment is where all the worst comments live. There is a symbol next to each comment that looks like this [-] and if you click it, it will collapse the comment and all of the replies to it. If you start to use this site often, collapsing the third top comment as soon as you enter a thread with more than 500 comments will add years to your life, trust me. This is what you're looking for:\n\n> [-] Top comment responding to the article or link\n>> [-] Reply to top comment that is usually still germane to the linked topic\n>>> [-] This is where things start to go off course, nearly everything under this is worthless\n\nThe above only applies to the top-level thread, threads below that do not suffer from so much entropy in the third top comment as the thread spawned by the highest upvoted top-level comment does.\n\nGood luck, and try not to take this place too seriously. It's still just the internet.",
            "Yes, yes there is!\n\nI learned the hard way.\n\nOne is - each subreddit has its own culture and rules. Read the rules. Slowly learn the culture. But don't be afraid to dive in and be yourself too.",
            "[https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette)\n\n[Content Policy - Reddit](https://www.redditinc.com/policies/content-policy)\n\nKey takeaways;\n\n• Reddit has its own rules we all must follow.  \n\n• Each subreddit has their own rules you must follow while there.\n\n• Don't be an asshole.\n\n• Have fun!",
            "r/newtoreddit has good starting Reddit info  \n  \nhttps://www.reddit.com/r/NewToReddit/wiki/ntr-guidetoreddit/",
            "When you first check out a sub and want to get a really good idea of what kind of people are there, select to sort the posts by Top : Year.\n\nThis will sort the posts to show you what has been upvoted the most in the last 12 months and should give you the general vibe of the sub.",
            "Before you start commenting everywhere maybe spend some time ”lurking”, that is, just reading the posts and comments you are interested in. This way you will learn the culture for that sub better and be able to have more insightful insights.\n\nUse the search function before posting something. Chances are someone alse already had the same idea or question.\n\nAnother tip. If you want to be part of the discussion and not just scream into the void once too many have commented and moved on, then sort by Recent (or Latest I don’t remember) for your feed. This way you will see only new posts and people will actually respond to your comment. I think it is more fun this way.",
            "i cant post",
            "why i cant post i m new",
            "You are so kind to write these points and I have learned how to use upvote and downvote! They are very useful not only on reddit but also on other social media. I think this comment should be pinned.",
            "It seems like you are experienced in Reddit!"
        ]
    },
    "How do I make dark theme.... actually dark on desktop?": {
        "title": "How do I make dark theme.... actually dark on desktop?",
        "score": 2,
        "url": "https://www.reddit.com/r/help/comments/1dlt5yi/how_do_i_make_dark_theme_actually_dark_on_desktop/",
        "content": "Hi, I haven't used Reddit for awhile and came back today and I noticed that on the desktop version there is a New UI, so far i like it other than the fact that certain communities have the most hideous background color for their posts and I can't seem to find a way to turn it off other than going back to light mode. Is this a missing feature or is there a toggle for this?. I remember a toggle for this on \"old new\" reddit but I can't find it here",
        "num_comments": 4,
        "comments": [
            "It is not part of the new Ui.  So what you are seeing is working as intended",
            "If you don't like the background colours on the desktop UI, you can go back to \"old new Reddit\" by using new.reddit.com.\n\nYou can use [this extension](https://chromewebstore.google.com/detail/ui-changer-for-reddit/bfcldjodnnkndfccfjndmdlppfkmccgh?pli=1) on \"Chromium\" browsers (Chrome, Edge, etc.) and [this one](https://addons.mozilla.org/en-US/firefox/addon/ui-changer-for-reddit/) on Firefox to make it stay on that version of Reddit.",
            "Oh okay, thank you for the answer",
            "Thank you! That's a lot better"
        ]
    },
    "How do I label myself account as NSFW on mobile?": {
        "title": "How do I label myself account as NSFW on mobile?",
        "score": 5,
        "url": "https://www.reddit.com/r/help/comments/1dloeg2/how_do_i_label_myself_account_as_nsfw_on_mobile/",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Posting on a nsfw subreddit will do it.  To manually change it, you will have to use your mobile browser.  Tap your avatar in the upper right, settings, profile, scroll down to nsfw nd flip the toggle on.",
            "It looks like you're trying to view NSFW content in the reddit app on iOS. If that's right, please note that your NSFW settings for iOS are managed in your device settings - reddit - View NSFW Content / Blur NSFW. Set those to your preference, then refresh your feed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/help) if you have any questions or concerns.*"
        ]
    },
    "Deleted Reddit Account Email Still Appears to Be In Use?": {
        "title": "Deleted Reddit Account Email Still Appears to Be In Use?",
        "score": 1,
        "url": "https://www.reddit.com/r/help/comments/1dlv0xy/deleted_reddit_account_email_still_appears_to_be/",
        "content": "I'm not quite sure I will explain this correctly ... but I sure would appreciate some help.\n\nI have an active Reddit Account associated with a Gmail account I wish to delete.\n\nI figured out how to change the email associated with my Reddit account.\n\nBUT when I submit the new email that I wish to link to my Reddit account I get the message \"The email link you have followed is for a different user.\"\n\nI know it's my email. \n\nAll I can think is that it is still associated with an old Reddit account that I used to have but am almost 100 percent sure I correctly deleted. ALL THE WAY. I got the \"sorry to see you go\" message from Reddit and everything.\n\nAny idea how I can figure this out? And hopefully free up my email and associate it with my active Reddit account?\n\nThank you so much for your help!",
        "num_comments": 0,
        "comments": []
    }
}