{
    "Help us test Season Eight for the Marketplace!": {
        "title": "Help us test Season Eight for the Marketplace!",
        "score": 282,
        "url": "https://www.reddit.com/r/HermitCraft/comments/1d55lnq/help_us_test_season_eight_for_the_marketplace/",
        "content": "Hey everyone, our recent collaboration with the Minecraft Marketplace allowed us to bring the Season Nine world to a much wider range of players given the bedrock platforms reach across multiple devices. It was a great experience to see so many of you enjoying the world and sharing your excitement. We would like to do that again with our previous seasons but I don't think I can do this without the communities help.\n\nSeason Nine was quite time intensive and the recentness of it made that far easier. I simply don't have the time to hand to manually check the Season Eight world for missed builds and mistakenly pruned areas. I have rather aggressively trimmed the world down to 300MB with the goal of it being as slim as possible, to reach more devices with storage limitations. I've kept track of everything removed and can restore regions if needed.\n\nIf you would like to spend your time helping out, exploring the world for things that have been pruned by mistake would been immensely helpful. Players who download the world from the marketplace will have a better experience with your help!\n\nI will provide a download for both Java and Bedrock, as well as this image of the pruned overworld - so you don't go looking in places that are not pruned. Any help is appreciated but please provide it in these formats\n\n1 - A description of whats missing with the co-ordinates of that location.\n\n2 - For bedrock, a description of any form of conversion discrepancy that could be fixed and where to see it in the world.\n\nOverworld map - [https://download.xisumavoid.com/s8\\_overworld.png](https://download.xisumavoid.com/s8_overworld.png)\n\nBedrock Download - [https://download.xisumavoid.com/Hermitcraft\\_Season\\_Eight\\_Test\\_1.mcworld](https://download.xisumavoid.com/Hermitcraft_Season_Eight_Test_1.mcworld)\n\nJava Download - [https://download.xisumavoid.com/Hermitcraft\\_Season\\_Eight\\_Test\\_1.zip](https://download.xisumavoid.com/Hermitcraft_Season_Eight_Test_1.zip)\n\n  \nThank you for your time :-)",
        "num_comments": 8,
        "comments": [
            "I don't have time to test because school but I hope it all goes smoothly!! Season 8 was the first season I ever watched and I loved it so much",
            "I'll try to help test the Hermitcraft Season 8 world for bedrock edition.",
            "Hey x, not sure if youll see this but, as console player Id love it if you could maybe attach the hermits skins to one of the worlds or as a separate pack. Just a thought, keep up the great work ",
            "How do I do this",
            "Thank you! Please report back if you find anything wrong with it :-)",
            "Will do.",
            "Tip for contributors: There's a helpful list of co-ordinates that was posted just after the dowload was released [here](https://www.reddit.com/r/HermitCraft/comments/rpqfp0/list_of_season_8_world_download_coordinates/) if you're looking for specific places to test, assuming that the co-ordinates match the original world (correct me if I'm wrong, X!).\n\nYou should be able to use the `/teleport` command to get you there if you enable commands."
        ]
    },
    "Happy Birthday Joel!": {
        "title": "Happy Birthday Joel!",
        "score": 176,
        "url": "https://i.redd.it/44c6txa55g9d1.jpeg",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Happy birthday to our Youngest Old Man",
            "Oh snap, happy birthday mr Joelbeans!",
            "Hap Birf to the most baddest of bad bois, who although has only recently been added to the whitelist full-time this Season, has been a Hermit at Heart since all the way back to the days of Third Life! \\~DMA",
            "Happy birthday Joel I hope you you get a lot of beans for your birthday",
            "Happy Birthday humble Joel",
            "Happy Birthday, Joel! ",
            "Happy birthday joel!",
            "Happy birthday tall man",
            "Happy birthday",
            "Happy birthday Joel!"
        ]
    },
    "Mini Skizz's Etho": {
        "title": "Mini Skizz's Etho",
        "score": 97,
        "url": "https://www.reddit.com/gallery/1dr6har",
        "content": "While this little etho is not the best thing I've ever made, I still really enjoy how it turned out, and had a lot of fun making it. For anyone wondering, I made the scaplutre out of air-dry clay and then painted over the top and sealed it with a varnish.",
        "num_comments": 7,
        "comments": [
            "U got snappers on ur phone?",
            "I love how much of a grip this has over the fandom, it's incredible!",
            "When I first saw this thing on people's episode I think of :\n\nAmogus Etho",
            "Eefo",
            "Frogger the mobile game",
            "Sorry about that"
        ]
    },
    "Just spent real money on a hat for a nonexistent business belonging to a nonexistent man": {
        "title": "Just spent real money on a hat for a nonexistent business belonging to a nonexistent man",
        "score": 119,
        "url": "https://www.reddit.com/r/HermitCraft/comments/1dr172k/just_spent_real_money_on_a_hat_for_a_nonexistent/",
        "content": "Anyone else hyped for the new mumbo merch?? Ive been LOVING all his oc’s and now theres merch for these characters! Obviously i had to immediately get my hands on some lol",
        "num_comments": 12,
        "comments": [
            "I also bought the hat ",
            "Going to buy some T-shirts! The mumbo logo is a must have",
            "Im sad that his merch has come out at a time I cant get it by any means. I would have loved to have some of the merch there.",
            "HermitCraft is taking all my money, from TCG alter-egos to Big Ron's",
            "The description of the Big Ron's corduroy cap is excellent.\n\n\"MY END GOAL FOR THIS CAP IS THAT IT EVENTUALLY ENDS UP IN A VINTAGE SHOP, AND SOMEBODY BUYS IT THINKING IT'S A COOL PEICE OF EARLY 90'S COMPANY UNIFORM BUT IT'S ACTUALLY MINECRAFT YOUTUBER MERCH.\"",
            "Same!! I would have loved to buy it! I hate my country's currency!",
            "Indian Rupees. It's approx 2.8k excluding shipping ",
            "Where to find merch???",
            "Which one is it?",
            "[found on mumbos twitter](http://mumbo.store)\n\nTo anyone checking this out for the first time, make sure to read the descriptions! They add even more to the world building and its great"
        ]
    },
    "Fanart for Docs most recent episode": {
        "title": "Fanart for Docs most recent episode",
        "score": 406,
        "url": "https://i.redd.it/hikg2jwaad9d1.jpeg",
        "content": "Speedran this drawing after the court episode lmao\nHow do you think he’s gonna get his revenge…? >:}",
        "num_comments": 17,
        "comments": [
            "Oh this is amazing!!! Thumbnail material for sure!! Also the dead pig ",
            "Orbital strike canon from skyblock lol",
            "His first move after getting a cobble gen up and running is definitely sky bridging until he is over an area he can make a redstone farm in.",
            "The mental healthcare system has failed this poor deranged boutique owner, and now the justice system has doomed all hope of recovery. He should have been sentenced to get help, not exile. Putting him in Skyblock isolation will surely lead him down a villainous path!\n\nFr though, 2 weeks of Doc doing skyblock is gonna be crazy. I wonder how he will obtain diamond ore and redstone for his doomsday device from up there? I'm somehow confident he will find a way.",
            "dang, how do you guys get this stuff out so fast? i would have been messing with this for weeks and still never be this good",
            "i hope he is gonna mark down locations on the map so he can cover cleo's base from above as revenge",
            "This is REALLY awesome! Great work!!",
            "I think he should get revenge by leaning in and enjoying the skyblock mini game. You definitely can apply G.O.A.T. to skyblock.\n\nMeanwhile he should be able to win the case against the diamond thief and get some BDubs justice flowing in his direction.",
            "Thanks a ton! Also Im glad u noticed the pig XD thought it was a fun lil detail heheh",
            "I half imagine him building a staircase down to diamond level, but just using a cobble platform the entire time so that he isn't *technically* touching the ground."
        ]
    }
}