{
    "The human race has stopped evolving by biology alone. We are evolving via culture and technology. Our biology hasn't changed in 50,000 years according to some scientists. But our culture is evolving at a faster and faster rate. What's next for human evolution?! ": {
        "title": "The human race has stopped evolving by biology alone. We are evolving via culture and technology. Our biology hasn't changed in 50,000 years according to some scientists. But our culture is evolving at a faster and faster rate. What's next for human evolution?! ",
        "score": 202,
        "url": "https://iai.tv/articles/culture-is-driven-by-evolution-auid-2878?_auid=2020",
        "content": "",
        "num_comments": 171,
        "comments": [
            "Were gonna develop the ability to digest plastic due to the amount of micro plastics in our food",
            "What scientists say we haven't evolved in 50k years? I'll wait...",
            "you know what's next.   biological androids  thanks to AI.. that can be controlled in everyway.. slowly and then rapidly replacing the human race",
            "I don't think you understand how evolution works? Bodies don't evolve unless they need to (see crocodiles, coelocanths, cockroaches). We've been the best in our ecological niche for 50K years. Maybe we'll go cyborg someday or something, but that's not really natural selection.",
            "I think the idea that genetic evolution is a completely dependent on random events is going to be seen as a misunderstanding. Our DNA, epigenetics and the associated biological community have the same sort of complex relationships as any economy or ecology.",
            "The part about our biology not changing isnt true just so you know...its just happening at a microscopic level, and its always like that its not static. If it was then we would have all died out ages ago.",
            "Weve handed off the baton of evolving intelligence :) weve done it. Weve won. We can rest <3",
            "That link doesn't say that you're misunderstanding; within the first few paragraphs they include cultural evolution in the evolution of humanity.\n\nEvolution is not inherently a positive or a negative effect, it just means change. Biological evolution is constant and does not stop. We change over several generations to adapt to our environment(including things like culture as our society and culture e is a part of our environment) ;which we affect which affects us and so on.",
            "Thats not true. We are literally growing a new vein in our hand.",
            "Thats not true. Some babies are being born with a new artery in the forearm I believe"
        ]
    },
    "Something in my room at night": {
        "title": "Something in my room at night",
        "score": 14,
        "url": "https://www.reddit.com/r/HighStrangeness/comments/1dr7ka4/something_in_my_room_at_night/",
        "content": "Recently moved to a new apartment and for the first time ever in my life I'm having sleep paralysis. Every single time I feel a presence, someone touching my side and back with their fingers. I have abandoned my room at this point and never go in there anymore unless I have to. It's not just becuase of this other things have been happening as well...\n\nA couple months ago I was laying in my bed and in the reflection of my TV I saw a being about 3 feet tall standing and staring at me. As soon as I noticed it, in a strangely inhuman way it ducked down incredibly fast out of view. I immediately got up and looked under my bed and there was nothing I could see. This happened to me when I was a kid too. I was having a nightmare about a short hooded figure about the size of a child and when I ran up to itto see what it was I felt a sharp pain in my left side and woke up. When I opened my eyes I saw a being in the darkness standing about a foot from my face that was about 3 feet tall as well. After seeing it a couple seconds it vanished into thin air as if it turned invisible... \n\nWell the sleep paralysis with it touching my back happens also to that same exact side I felt a sharp pain in when I was a kid that woke me up. It got so bad I had to abandon the room I was sleeping in as I mentioned. The last couple nights I was in there something terrifying happened. One night I felt something get up on my bed next to me, moving my mattress. I could feel the weight of it. The next night I woke and saw what looked like the hand of a child reaching up from under my bed in the reflection of my mirror trying to grab me. \n\nWell this is where shit gets really scary. The literal next day my roomate tells me how his coworker had a weird experience. A being reached up from under the line in a restaurant when he was closing alone and grabbed his leg. It then tried to do it again. Thing is he was alone and there is no room for a person down there to hide at all... I didn't tell him what happened to me and we have no contact with each other at all...\n\nThings like this have been happening to me since I was a kid, literally doesn't matter where I go it follows me everywhere. I don't know if it is one thing or multiple different things happening to me. I've had experiences where a man talking to me wakes me up, it's always the same voice. Or another time someone clapped third hands directly in my face but I was home alone. Recently even though I've been sleeping in the living room with my cats I've been women up twice now by a voice talking directly in my ear. The last time it happened it was so loud it hurt my ear. One night I got drunk and was taunting it, I know stupid idea but I was at the end of my rope and feeling really stressed out. I told it how it's a coward for hiding and that I'm going to find it, I was laughing. Well it yelled directly in my ear one morning saying \"aren't you going to laugh at me?!\". \n\nThings at different homes have been moving on their own, there's been lights turning themselves off. Cats chasing and growling at something I can't see. This is bizzare but just a couple weeks ago when I was watching TV with my roomate I saw something duck down behind my mattress. (I have it in my living room now) thing is whatever it was couldn't have been larger than half a foot. What even is that small? And when we got up to look there was nothing there.... \n\nI know some people will probably say its hallucinations or that it's just sleep paralysis but it happens when I'm awake as well. I feel it's important to note I haven't been having just paranormal or supernatural type experiences but I also saw a grey alien as well. One night when I was walking home, around 2 in the morning I saw a very tall slender being with no clothes on crouched behind some bushes right outside my bedroom window. It had a teardrop head and absolutey massive black eyes and was just staring at me. Barely any nose or mouth, no ears. I'd say if it stood up it would be about 8-9 feet tall. There was another time I woke up with my shirt on backwards and blood in my mouth. Had a dream that I was on a table somewhere I've never been and a grey was standing over me smiling. \n\nI don't know what to do, I don't know what this all is. I feel like I am a magnet for the weird and I hate it. It has ruined my life, I am not normal anymore and I am so depressed and anxious. I constantly carry a knife everywhere I go in my apartment and in scared to sleep. I'm always watching my surroundings and feel like there is always something watching me, ready to attack me at any moment. What do I do? Does anyone have any simular experiences or have any idea why this is happening to me? I feel so isolated and like nobody believes me.",
        "num_comments": 8,
        "comments": [
            "Most people here are unwilling to consider that this is demonic oppression. They will come up with every other possibility, theory, and explanation to avoid talking about the battle between good and evil - the battle for your soul. The next time this happens, pray to Jesus and he will help you.",
            "Ohmygod. No one's ever described the back/side pain thing I used to get as a child. I always told my parents that someone was stabbing me with their hands and they never believed me. I grew up thinking (as always) that I was wrong and there must have been a medical explanation, like growth spasms or something. I never saw anything, but I always knew it was a thing. I knew it wasn't internal to my body, it was an external force causing it.\n\nI too am a weird magnet, but was very rarely if ever believed so stopped focusing on it.",
            "Use to have sleep paralysis alot. Best advice I was given was to try lick your lips with your tongue as your fighting to come out of it.",
            "Following. Maybe contact a paranormal group.",
            "The Hatman is coming for you",
            "You say that but Ive seen the hat man twice and both times it was in the spring at 4.00am. I smiled at it and went back to sleep.\n\nIve had 10 near death experience so a ghost isnt going to scare me at all.",
            "Hmm most of the time I would tend to agree with the guy saying call on god/Jesus, but this seems very personal & physical. I feel like it will take a considerable amount of effort from OP regardless of what they decide to do.   \n\nResearch online for Catholic or Christian groups that deal or investigate the paranomal? Maybe look for a more cultural route?   \n\nThe most important thing I want to impart on you is to not give up! Keep searching for a solution & way to fight. I dont buy the idea that we cannot fight back/hurt these beings, these types of interactions are always a two way street. If you can hurt me I can hurt you. Ask everyone you know, even if you sound nuts. Maybe eventually youll get connected with someone that can really help you.  \n\nThink outside of the box! Maybe whatever feels right in the moment is what you should do? Wish I could help more since it seems like youre really going through it. Take care, be safe ",
            "**Strangers**: Read the rules and understand the sub topics listed in the sidebar closely before posting or commenting. Any content removal or further moderator action is established by these terms as well as Reddit ToS.\n\n\n\nThis subreddit is specifically for the discussion of anomalous phenomena from the perspective it may exist. Open minded skepticism is welcomed, close minded debunking is not. Be aware of how skepticism is expressed toward others as there is little tolerance for ad hominem (attacking the person, not the claim), mindless antagonism or dishonest argument toward the subject, the sub, or its community.\n\n\nWe are also happy to be able to provide an ideologically and operationally independent platform for you all. Join us at our official Discord - https://discord.gg/MYvRkYK85v\n\n---\n\n'Ridicule is not a part of the scientific method and the public should not be taught that it is.'\n\n_-J. Allen Hynek_\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HighStrangeness) if you have any questions or concerns.*"
        ]
    },
    "Stargates equipment and jrods. What is going on?": {
        "title": "Stargates equipment and jrods. What is going on?",
        "score": 10,
        "url": "https://youtu.be/P-zGzPykI5o?si=4_i9QMtQLrliHXE5",
        "content": "What an interview Dan Burisch\n",
        "num_comments": 9,
        "comments": [
            "He should know, he did the chevron encoding\n\nActually he looks a bit more like General Hammond. Maybe both characters were based on him",
            "Bunch of gobbeldeyguk hooha\n\nSaying a lot without saying anything",
            "seems like the real thing",
            "This guy seems very genuine.",
            "this video should be saved offline, before it gets deleted ...",
            "Hammond of Texas - **pats head**",
            "Indeed. Read about him - he was in the military and it shows. I think he was a good guy. Italics not bold",
            "Yes, this guy was exposed as a fraud a long time ago: [http://www.ufowatchdog.com/burischdirtbag.htm](http://www.ufowatchdog.com/burischdirtbag.htm)",
            "**Strangers**: Read the rules and understand the sub topics listed in the sidebar closely before posting or commenting. Any content removal or further moderator action is established by these terms as well as Reddit ToS.\n\n\n\nThis subreddit is specifically for the discussion of anomalous phenomena from the perspective it may exist. Open minded skepticism is welcomed, close minded debunking is not. Be aware of how skepticism is expressed toward others as there is little tolerance for ad hominem (attacking the person, not the claim), mindless antagonism or dishonest argument toward the subject, the sub, or its community.\n\n\nWe are also happy to be able to provide an ideologically and operationally independent platform for you all. Join us at our official Discord - https://discord.gg/MYvRkYK85v\n\n---\n\n'Ridicule is not a part of the scientific method and the public should not be taught that it is.'\n\n_-J. Allen Hynek_\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HighStrangeness) if you have any questions or concerns.*"
        ]
    },
    "Interdimensional Being Claimed to Have Been Caught On Cellphone Camera by Child": {
        "title": "Interdimensional Being Claimed to Have Been Caught On Cellphone Camera by Child",
        "score": 3,
        "url": "https://v.redd.it/rx25sjadli9d1",
        "content": "Translation: A child captured images of a strange creature or monster while using his camera phone. The image is brief but disturbing. He was taking a video of his father at the computer. \n\nHe took shots of the tattoo on his back, quickly brought the camera to his own face, then back to his father.\n\nLater, after reviewing the phone footage, the child noticed the image of another \"person\" or \"monster\", which was not initially in the same room with them.\n\n The mother mentioned how they were surprised and how she thought the image was of someone \"not natural\" or \"futuristic\".\n\n The father related, \"we have heard things around the house before, but never seen\n\"something\" or \"someone\" before. He was flabbergasted.\n\nAdditional Info:\n\nAlso wanted to say that there are a lot if things missing from the translation. When the mother was talking about how the creature looked not natural and spooky, the father said that theyve been hearing footsteps and weird noises from time to time, but then he offers a possible explanation: It used to be very common in the past (like 60-40 years ago) for some Ecuadorian families to keep small bones from dead relatives or even any dead person, because some believed this would \"tie\" the spirit of that person to guard your home and loved ones. \n\nThe father said: \"we have some huesitos (small bones) to keep our home safe, maybe it has something to do with the creature\" So, the family was more into the idea that it was a ghost or dead person's spirit haunting their house over the Aliens theory.\n\nI also find it interesting that things like this always seem to happen In South America. This incident happens in Ecuador. \n\nOriginal source:\n\nhttps://m.youtube.com/watch?si=J0QHmRKnFF9COMJv&v=qIDTHA8oosw&feature=youtu.be",
        "num_comments": 1,
        "comments": [
            "**Strangers**: Read the rules and understand the sub topics listed in the sidebar closely before posting or commenting. Any content removal or further moderator action is established by these terms as well as Reddit ToS.\n\n\n\nThis subreddit is specifically for the discussion of anomalous phenomena from the perspective it may exist. Open minded skepticism is welcomed, close minded debunking is not. Be aware of how skepticism is expressed toward others as there is little tolerance for ad hominem (attacking the person, not the claim), mindless antagonism or dishonest argument toward the subject, the sub, or its community.\n\n\nWe are also happy to be able to provide an ideologically and operationally independent platform for you all. Join us at our official Discord - https://discord.gg/MYvRkYK85v\n\n---\n\n'Ridicule is not a part of the scientific method and the public should not be taught that it is.'\n\n_-J. Allen Hynek_\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HighStrangeness) if you have any questions or concerns.*"
        ]
    },
    "Bill Brazel Jr. talks about his father Mack, discoverer of the 1947 Roswell UFO wreckage": {
        "title": "Bill Brazel Jr. talks about his father Mack, discoverer of the 1947 Roswell UFO wreckage",
        "score": 2,
        "url": "https://youtu.be/p-j9JXuGLRI?si=aBy7rHj58CHZgUge",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Bill Brazel Jr. and Jesse Marcel Jr. talk about the debris from the 1947 Roswell UFO incident. \n\n\n\nWilliam Ware \"Mack\" Brazel was born in 1899. He died on September 24, 1963 in Reserve, New Mexico, USA.\n\n\n\nOwner of the ranch upon which the \"Roswell Incident\" occurred. He and his son were the first to come upon a crashed UFO and reported it later to the nearby Roswell's sheriff's office.\n\n\n\nMack Brazel was a member of the Masonic Order of Tularosa, New Mexico. [https://archive.org/details/img-6442\\_202406/IMG\\_6442.jpeg](https://archive.org/details/img-6442_202406/IMG_6442.jpeg)\n\n\n\nRowell UFO 1947 playlist on EOC [https://www.youtube.com/playlist?list=PLbFbLvJse3mrHwLAB2\\_sSu6i8Fpc1yBHg](https://www.youtube.com/playlist?list=PLbFbLvJse3mrHwLAB2_sSu6i8Fpc1yBHg)",
            "**Strangers**: Read the rules and understand the sub topics listed in the sidebar closely before posting or commenting. Any content removal or further moderator action is established by these terms as well as Reddit ToS.\n\n\n\nThis subreddit is specifically for the discussion of anomalous phenomena from the perspective it may exist. Open minded skepticism is welcomed, close minded debunking is not. Be aware of how skepticism is expressed toward others as there is little tolerance for ad hominem (attacking the person, not the claim), mindless antagonism or dishonest argument toward the subject, the sub, or its community.\n\n\nWe are also happy to be able to provide an ideologically and operationally independent platform for you all. Join us at our official Discord - https://discord.gg/MYvRkYK85v\n\n---\n\n'Ridicule is not a part of the scientific method and the public should not be taught that it is.'\n\n_-J. Allen Hynek_\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HighStrangeness) if you have any questions or concerns.*"
        ]
    }
}