{
    "The human race has stopped evolving by biology alone. We are evolving via culture and technology. Our biology hasn't changed in 50,000 years according to some scientists. But our culture is evolving at a faster and faster rate. What's next for human evolution?! ": {
        "title": "The human race has stopped evolving by biology alone. We are evolving via culture and technology. Our biology hasn't changed in 50,000 years according to some scientists. But our culture is evolving at a faster and faster rate. What's next for human evolution?! ",
        "score": 164,
        "url": "https://iai.tv/articles/culture-is-driven-by-evolution-auid-2878?_auid=2020",
        "content": "",
        "num_comments": 152,
        "comments": [
            "**Strangers**: Read the rules and understand the sub topics listed in the sidebar closely before posting or commenting. Any content removal or further moderator action is established by these terms as well as Reddit ToS.\n\n\n\nThis subreddit is specifically for the discussion of anomalous phenomena from the perspective it may exist. Open minded skepticism is welcomed, close minded debunking is not. Be aware of how skepticism is expressed toward others as there is little tolerance for ad hominem (attacking the person, not the claim), mindless antagonism or dishonest argument toward the subject, the sub, or its community.\n\n\nWe are also happy to be able to provide an ideologically and operationally independent platform for you all. Join us at our official Discord - https://discord.gg/MYvRkYK85v\n\n---\n\n'Ridicule is not a part of the scientific method and the public should not be taught that it is.'\n\n_-J. Allen Hynek_\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HighStrangeness) if you have any questions or concerns.*",
            "We’re gonna develop the ability to digest plastic due to the amount of micro plastics in our food",
            "This is the first I've heard about it.\n\nThe human race is evolving faster than ever before. There are seven billion of us, generating 50 novel mutations per generation. Our haploid genome is only 3B base pairs, 99% shared: we may be generating every possible mutation, every generation.\n\nToday, someone born to an uncontacted tribe in Brazil can have a child with someone from New Guinea. That was almost impossible, in all of recorded human history. Genetic mobility is the fastest it's ever been.\n\nIt isn't clear what is going to come out of this process, but we're generating more novel content than ever before. If, or when, selection returns, we're in the best possible state to survive it.",
            "human adaptations; such as larger spleens for oxygen storage in divers who live by the sea and Tibetan and Andean peoples, have developed physiological adaptations to cope with lower oxygen levels. This includes changes in hemoglobin levels, lung capacity, and blood flow regulation.\n\nArctic regions, like the Inuit, have developed adaptations to cold climates, including shorter limbs and stocky builds to conserve heat and specialized metabolic processes to maintain body temperature.\n\nidk, maybe a benefitial mutation might come along advance us or do it ourself but that raises ethical challenges",
            "What scientists say we haven't evolved in 50k years? I'll wait...",
            "No. The appearance of different skin colors. Adaptation to high altitudes. Immunity to a huge number of diseases. Adaptation to different types of food: from strict veganism in India to eating rotten meat in the far north.\n\nThese are all examples of evolutionary adaptation.\n\nWell, in general, the size of the brain decreases, if that’s what you’re talking about.",
            "Extinction.",
            "you know what's next.   biological androids  thanks to AI.. that can be controlled in everyway.. slowly and then rapidly replacing the human race",
            "We will split into at least two separate species.  At least initially.  \n\nThe dominant species will be a biologically engineered, highly intelligent humanoid that has merged with AI. They will be immortal or very close to it.  Death will be a choice.  \n\nThe poor will be left behind and will likely devolve into highly violent and unstable creatures fighting with each other for scraps.  Over time they will probably go extinct as did Neanderthals.  \n\nNot too dissimilar to concepts explored by H.G. Wells’ book, the Time Machine.  \n\nIf the UAP time traveler hypothesis is correct, I suspect that the future version of the first species lost some potentially useful genetic data along the way.  They might have gone back to recover it prior to their AI transcendence…or a societal collapse.",
            "Aliens"
        ]
    },
    "Stargates equipment and jrods. What is going on?": {
        "title": "Stargates equipment and jrods. What is going on?",
        "score": 10,
        "url": "https://youtu.be/P-zGzPykI5o?si=4_i9QMtQLrliHXE5",
        "content": "What an interview Dan Burisch\n",
        "num_comments": 4,
        "comments": [
            "**Strangers**: Read the rules and understand the sub topics listed in the sidebar closely before posting or commenting. Any content removal or further moderator action is established by these terms as well as Reddit ToS.\n\n\n\nThis subreddit is specifically for the discussion of anomalous phenomena from the perspective it may exist. Open minded skepticism is welcomed, close minded debunking is not. Be aware of how skepticism is expressed toward others as there is little tolerance for ad hominem (attacking the person, not the claim), mindless antagonism or dishonest argument toward the subject, the sub, or its community.\n\n\nWe are also happy to be able to provide an ideologically and operationally independent platform for you all. Join us at our official Discord - https://discord.gg/MYvRkYK85v\n\n---\n\n'Ridicule is not a part of the scientific method and the public should not be taught that it is.'\n\n_-J. Allen Hynek_\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HighStrangeness) if you have any questions or concerns.*",
            "seems like the real thing",
            "This guy seems very genuine.",
            "He should know, he did the chevron encoding\n\nActually he looks a bit more like General Hammond. Maybe both characters were based on him"
        ]
    },
    "Tom Delonge and The Gods of Eden Part II: Chris Bledsoe, the \"Lady\", and I Can't Believe It's Freaking Reptilians (Possibly)": {
        "title": "Tom Delonge and The Gods of Eden Part II: Chris Bledsoe, the \"Lady\", and I Can't Believe It's Freaking Reptilians (Possibly)",
        "score": 63,
        "url": "https://www.reddit.com/r/HighStrangeness/comments/1dqljva/tom_delonge_and_the_gods_of_eden_part_ii_chris/",
        "content": "A little while ago, I argued that [Tom Delonge's theory of UFOs and the Phenomenon ](https://www.reddit.com/r/HighStrangeness/comments/1dnkfq9/the_tom_delonge_theory_of_ufos_the_gods_of_eden/)is about malevolent NHI that start wars using religion and certain secret societies so they can feed off of negative human energy a la The Gods of Eden and that we are a cattle farm or agricultural product. Basically, the elites who are in these secret societies are co-opted to work with the malevolent NHI on this.\n\nIf you've kept up with a lot of the \"woo\" side of ufology, then you've also probably heard of [Chris Bledsoe](https://www.youtube.com/watch?v=mbg3KSgn2k0) and [his interaction with the \"Lady\"](https://youtu.be/5TYkgmLTIQs?t=1134) - a mysterious, angelic-like being/woman that came through a portal to Chris Bledsoe on the back of a mysterious bull.\n\n[Take a look at this comment by Ryan Bledsoe, Chris Bledsoe's son, regarding Tom Delonge's theory of the Phenomenon](https://twitter.com/SkyFireNews/status/1800207913526669412). It lines right the fuck up. The idea that there are NHI walking among us who feed off energy.\n\nMoreover, I think that [the sighting of the Lady suggests that said malevolent NHI are trying to use religious imagery and concepts to push us towards war](https://www.reddit.com/r/conspiracy/comments/lp81sx/chris_bledsoe_and_the_lady/?share_id=ph_Id6tyH1Mt_FQFyaYcH&utm_content=1&utm_medium=android_app&utm_name=androidcss&utm_source=share&utm_term=4).\n\nWhy do I think that? Because I think that the description of the Lady matches up with imagery from the Book of Revelations, specifically [the Whore of Babylon](https://en.wikipedia.org/wiki/Whore_of_Babylon). (I know this sounds schizo, but I'm not religious, I'm not Catholic, I'm just noticing similarities).\n\n>So he carried me away in the spirit into the wilderness: and **I saw a woman sit upon a scarlet coloured beast**, full of names of blasphemy, **having seven heads and ten horns**.\n\n>And **the woman was arrayed in purple and scarlet colour**, and decked with gold and precious stones and pearls, having a golden cup in her hand full of abominations and filthiness of her fornication:\n\nWhile the bull is not described in detail, the Lady supposedly came to Chris Bledsoe on the back of a horned beast.\n\nAccording to people hanging out with Chris Bledsoe, \"[there are others, especially those in the higher ranks of NASA, who take The Lady very seriously, and revere her like a deity. They know She has been appearing to humans for thousands of years, and even as recently as 1917 during an event known as The Miracle of the Sun](https://www.reddit.com/r/conspiracy/comments/lp81sx/chris_bledsoe_and_the_lady/?share_id=ph_Id6tyH1Mt_FQFyaYcH&utm_content=1&utm_medium=android_app&utm_name=androidcss&utm_source=share&utm_term=4).\" In other words, this sighting last came in the middle of WWI - one of the bloodiest events in human history.\n\nAnd look at this fucking patch:\n\n[A lady in purple and scarlet](https://preview.redd.it/n6k7p326sb9d1.png?width=295&format=png&auto=webp&s=8cd96efb3e0f527aaafeea273e772cfa51170ef7)\n\nThis is my theory based on the extension of Tom Delonge's thoughts. I'm not saying that the Lady is the Whore of Babylon from the Book of Revelations. I'm saying that the malevolent NHI take on these mystical forms and come to us with prophesies and talks of wisdom to gear us up for war and violence.\n\nIf the theory is correct, the Lady is not this pretty being that's a sign to Chris Bledsoe. She is a malevolent NHI or NHI manifestation that is meant to create religious fervor among our co-opted elites/secret societies to drive us into war.",
        "num_comments": 64,
        "comments": [
            "**Strangers**: Read the rules and understand the sub topics listed in the sidebar closely before posting or commenting. Any content removal or further moderator action is established by these terms as well as Reddit ToS.\n\n\n\nThis subreddit is specifically for the discussion of anomalous phenomena from the perspective it may exist. Open minded skepticism is welcomed, close minded debunking is not. Be aware of how skepticism is expressed toward others as there is little tolerance for ad hominem (attacking the person, not the claim), mindless antagonism or dishonest argument toward the subject, the sub, or its community.\n\n\nWe are also happy to be able to provide an ideologically and operationally independent platform for you all. Join us at our official Discord - https://discord.gg/MYvRkYK85v\n\n---\n\n'Ridicule is not a part of the scientific method and the public should not be taught that it is.'\n\n_-J. Allen Hynek_\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HighStrangeness) if you have any questions or concerns.*",
            "Can't have evil with out good so always hope if there's \"demons\" logically there are \"Angels?\"",
            "Well its clear you did not listen to anything he said or read the book. She did not appear riding a bull at all. Have a wank, get rid of the tension and negativity. Its all doom and gloom with some.",
            "In the book , The Lady implies that she has been known as Hathor, for which a cow or bull is a symbol.",
            "Oh, here we fucking go with another guy who thinks he's figured out Revelations. We're as close to figuring out that book as people one thousand years ago were. Surely, they also thought that symbols and events they were experiencing were just as pertinent and clear to their understanding as yours are to you.",
            "Did you read his book?\n\nThe Lady consistently brought him messages of peace, love and healing.  \n\nThe encounter when she came to him on a bull, she was protecting him from unwanted encounters.\n\nBill clinton is a child eating reptilian that took the most visible job in the world? I don’t know…\n\nI really don’t see it.",
            "I have come to realize that this is true, but it is very much polarized. They want us to think with our right brain on both fronts. The symbols are a form of art. Art is a form of truth from a higher plain. There are malevolent and benevolent beings. Benevolent ones want to dismantle our nuclear arsenal. The malevolent ones want us to use it. They are higher dimensional physical, light density forms of pure consciousness that live inside and around the planet. Likely taking their charge from the ionosphere. As seen in the 1996 NASA tether incident.\n\nhttps://youtu.be/dlIF0P9j0cM?si=h4-f1mRzefZzA73i",
            "Didn't she also give Bledsoe some type of strange chihuahua creature that he proceeded to lose/never mention again? Lines up with \"cup full of abominations\" I guess. Also you have to remember Chris Bledsoe is deeply religious and is no stranger to this imagery and Delonge will say anything to push his \"aliens are demons/angels\" agenda.",
            "In the Bible there are several passages about the armor of god being armor you arm yourself with that protects you in the spiritual realm and his word being your weapon. That there is a spiritual realm that’s exists and affects the physical realm, and try as we might. We’ll never be able to wage war in that realm, that does exist and that god and gods spiritual army fights that battle for us. All of what delogne is saying is just a repeat of that. They can call them reptilians because it’s human lore that the average person can connect to. But they are essentially just repeating what’s already in the Bible. So should there be shock?",
            "I believe this to be an accurate take on the situation. At least what has been conveyed to me in my contacts lines up. Pretty disconcerting stuff. I believe there cause for true concern if disclosure occurred because people that sway towards negative polarization could wholesale begin helping these beings in mass which would be tragic for our species on this living rock!"
        ]
    },
    "Anyone find anything interesting in Dr Steven Greer's Data Dump? DPIA has Pages of PDFs and videos. There is WILD information in the documents. ": {
        "title": "Anyone find anything interesting in Dr Steven Greer's Data Dump? DPIA has Pages of PDFs and videos. There is WILD information in the documents. ",
        "score": 17,
        "url": "/r/WelcomingTheUnknown/comments/1dqrpik/anyone_find_anything_interesting_in_dr_steven/",
        "content": "",
        "num_comments": 13,
        "comments": [
            "**Strangers**: Read the rules and understand the sub topics listed in the sidebar closely before posting or commenting. Any content removal or further moderator action is established by these terms as well as Reddit ToS.\n\n\n\nThis subreddit is specifically for the discussion of anomalous phenomena from the perspective it may exist. Open minded skepticism is welcomed, close minded debunking is not. Be aware of how skepticism is expressed toward others as there is little tolerance for ad hominem (attacking the person, not the claim), mindless antagonism or dishonest argument toward the subject, the sub, or its community.\n\n\nWe are also happy to be able to provide an ideologically and operationally independent platform for you all. Join us at our official Discord - https://discord.gg/MYvRkYK85v\n\n---\n\n'Ridicule is not a part of the scientific method and the public should not be taught that it is.'\n\n_-J. Allen Hynek_\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HighStrangeness) if you have any questions or concerns.*",
            "[Witness list analysis](https://youtu.be/IiWZF2se-Qs?si=VsyQ6RFtMZ9zQ2SQ) by UAP Gerb.",
            "So, how was the detector valve different from a diode?\n\nBecause, we got diodes. And you can capture energy using wires and a diode. That's just radio, baby.\n\nBut unless you have a really big antenna, it's not really possible to get a lot of energy out of it.",
            "I know how and why some of these work basically through the principles that made the Townsend Brown Experiments work ( not ionic winds). It lets us mimic gravity through the use of energy sources rotating around each other (rather than mass) because as Einstein's famous equation lets us equate mass to energy and vice versa. We place capacitors closer than they would naturally find equilibrium  if they were masses rotating in space. Its why its important to have two different sized Tesla capacitors. They generate an EM field by rotating at a certain distance so that the fields overlap and this overlap of the fields produce lift. My paper doesn't explain this specifically but it is the principle that makes this work. We need to accept that space is not empty, space is full of energy, fluctuating at the Planck Scale. Once we realize we live in a medium we can explain gravity through the principles of displacement.\n\nDisplacement is where mass takes up an area of a medium and increases the volume, but other things happen as well. The medium pushes up against mass and the mass resists the medium, this constitutes work. In all things this energetic field we live in, I simply call the scalar field (because it allows us to quantize each unit of space), comes in contact with mass, work is done and an EM field is produced, it even happens in living beings. This also explains why space is \"denser\" or \"thicker' in certain areas, namely around mass. The mass/energy equivalency determines the strength of the displacement, and this along with the rotation of the mass distorts spacetime, giving us the curvature that Einstein describes. I feel like using logic we can determine the veracity of this. On the ISS the density of the field is so much less that astronauts lose muscle mass and tone, it's because they don't have the resistance we are used to on Earth. On the Moon the density is 1/8 I believe so it's extremely easy to move through, much easier to move through than on Earth.\n\n[https://www.researchgate.net/publication/381327118\\_Unified\\_Cosmic\\_Theory\\_Dynamics\\_of\\_an\\_Energy\\_Ocean](https://www.researchgate.net/publication/381327118_Unified_Cosmic_Theory_Dynamics_of_an_Energy_Ocean)\n\n[https://www.academia.edu/120625879/Unified\\_Cosmic\\_Theory\\_The\\_Dynamics\\_of\\_an\\_Energy\\_Ocean](https://www.academia.edu/120625879/Unified_Cosmic_Theory_The_Dynamics_of_an_Energy_Ocean)\n\nI really want to build a version of the rotating pulsing tesla capacitors to see if my hypothesis of the overlapping field  does anything.\n\nMy paper also explains the anomalous Pioneer 10 and 11 acceleration, and all acceleration in space. When this field exerts pressure against an object that has inertia and a trajectory, rather than is at a stable rotation, it assists the object through the pressure it exerts on it. Which is why we se gravitational assists when objects move towards masses, because the field is denser and exerts more pressure against it.",
            "Is there enough info where some home tinkerer or semi smart individual can build one at home? It's hot and I need AC dammit",
            "Only one thing has to be true for the levee to break on this topic, so don't discount the whole based on the sum of it's parts.",
            "Hell no. The man is a joke.",
            "I'm about 10 mins into this so far and damn. This is a hell of a video. Interesting look into witnesses. \n\n  \nDid you make this video?",
            "From what I can tell from the document I posted, no. The archive is huge though so there might be some more detailed information in there.",
            "No, I'm just a fan of the channel.  All his videos are great, he does exceptional research compared to most youtube channels."
        ]
    },
    "Holy Uncanny Valley! ": {
        "title": "Holy Uncanny Valley! ",
        "score": 360,
        "url": "https://i.redd.it/g3jv32zrv69d1.jpeg",
        "content": "",
        "num_comments": 78,
        "comments": [
            "**Strangers**: Read the rules and understand the sub topics listed in the sidebar closely before posting or commenting. Any content removal or further moderator action is established by these terms as well as Reddit ToS.\n\n\n\nThis subreddit is specifically for the discussion of anomalous phenomena from the perspective it may exist. Open minded skepticism is welcomed, close minded debunking is not. Be aware of how skepticism is expressed toward others as there is little tolerance for ad hominem (attacking the person, not the claim), mindless antagonism or dishonest argument toward the subject, the sub, or its community.\n\n\nWe are also happy to be able to provide an ideologically and operationally independent platform for you all. Join us at our official Discord - https://discord.gg/MYvRkYK85v\n\n---\n\n'Ridicule is not a part of the scientific method and the public should not be taught that it is.'\n\n_-J. Allen Hynek_\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HighStrangeness) if you have any questions or concerns.*",
            "I have no mouth and I must scream",
            "\"Moisturize Me! Moisturize Me!\"\n\n(Doctor Who reference)",
            "Man I gotta make me some fried bologna tonight",
            "Peppa pig",
            "Where is the “uncanny valley” part?\n\nBecause it looks like bubblegum",
            "I have never understood this concept, like even if they made a robot body with a perfect copy of their personality installed, they themselves would still die and be dead. Or do they expect their soul/consciousness to float over to the robot brain being like well this is the same?",
            "Oh wow, maybe we should make an army of these and powered them with AI. Would be cool if we threw the 3 Laws of Robotics down the drain too!\n\nBe right back, a big naked fella just appeared in my front lawn and he's asking me for my ja",
            "Hi there, face here! Berp berpberp!!",
            "The 600 series had rubber skin. We spotted them easy, but these are new. These are the T 1000’s. They look human... sweat, bad breath, everything. Very hard to spot. I had to wait till he moved on you before I could zero him."
        ]
    }
}