{
    "Koli, Finland": {
        "title": "Koli, Finland",
        "score": 48,
        "url": "https://i.redd.it/h8oi2l18xh9d1.jpeg",
        "content": "Pretty nice view from top of Koli 😎",
        "num_comments": 2,
        "comments": [
            "Nice!",
            "\nI see you've posted an image.  Thanks for your contribution!\n\n*Did you include the* ***required*** *title information?*  **[Your text.] [Most Specific place], [Specific place], [General place], [COUNTRY].**  \n      \nIf you didn't include this information, please delete your post and resubmit it.  **Your post will be removed without warning if it does not follow this rule!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*"
        ]
    },
    "Am I wrong to be disappointed with my Merrel Moab Speed 2 GORE-TEX not being able to stand up to wet grass?": {
        "title": "Am I wrong to be disappointed with my Merrel Moab Speed 2 GORE-TEX not being able to stand up to wet grass?",
        "score": 25,
        "url": "https://www.reddit.com/gallery/1drbh5b",
        "content": "",
        "num_comments": 32,
        "comments": [
            "Did the water get in through the top, or did it soak through the toebox? I wouldn't recommend goretex-anything that isn't at least ankle high. Also, goretex could hold sweat in.",
            "I am guessing there is a manufacturer’s defect. Take them back where you bought them and ask for another pair.",
            "A shoe cannot be breathable and waterproof at the same time. I love my Merrels because when my feet get wet in them, they dry in no time at all. You don't want waterproof hiking footwear for regular use, it can lead to foot fungus.",
            "I hunt in Merrel Moab 3s Mids and walk through streams and have never gotten wet socks unless the water comes over the top. I’ve got 2 pair and my oldest have 3 or 4 seasons on them.",
            "Their leather boots are the only Merrell I have that are actually waterproof, unless you're me and you shove your leg in a creek under a snow drift",
            "Nike has a 60 day online return policy and 90 day in-store if I’m not mistaken. Return them if unhappy.",
            "Get some bean boots lol",
            "It looks like your pants have water on them as well - so it probably got in from the top",
            "The title makes me feel you know why your toes are wet but you don't want to share the truth.",
            "Think about it. How can something be breathable and water proof? Those two things are opposites.\nGore-tex is a lie."
        ]
    },
    "Blauherd-Sunnegga, Zermatt, Switzerland": {
        "title": "Blauherd-Sunnegga, Zermatt, Switzerland",
        "score": 48,
        "url": "https://www.reddit.com/gallery/1dr7jcs",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Wow, what a breathtaking view! The combination of the Blauherd-Sunnegga area in Zermatt, Switzerland, is simply stunning. The contrast between the rugged mountains and the serene valleys below is like something out of a painting. Definitely adding this to my travel bucket list!",
            "Beautiful peak ! The ideal place to be in order to relax and release all the stress !",
            "Yes, it truly was breathtaking. You’d really be out of words first time seeing it from that vantage point. Wish you get to take it off your bucket list soon!",
            "It sure is! :)"
        ]
    },
    "Hiked my first 14ner at Mt. Sneffels, Summit in Colorado, USA ": {
        "title": "Hiked my first 14ner at Mt. Sneffels, Summit in Colorado, USA ",
        "score": 227,
        "url": "https://www.reddit.com/gallery/1dqyuqh",
        "content": "",
        "num_comments": 15,
        "comments": [
            "That peak above the green,  heart-shaped lake is one bad -ass climb! Hardest centennial in Colorado!",
            "Beautiful! How were the conditions?",
            "Love the different colors of the water",
            "Wow, what an incredible achievement! Summiting Mt. Sneffels must have been an unforgettable experience. The view from up there must be breathtaking!",
            "The colors are amazing.  Beautiful pics.",
            "Looks awesome, how many miles and hours?",
            "3 times. All solo. Very scary 😨",
            "Little gusty but otherwise great!",
            "Right those lakes are gorgeous 😍",
            "Oh yeah, but you have to have the right conditions, that's for sure.  In the winter months, avalanche danger is usually high and the right conditions will happen on just a few days now and then.  But any year that gets enough snow, you can ski down gullies from a little way below the summit in the late spring and early summer quite safely, as long as you're done by late morning, before the sun warms the snowpack up too much.  Did you climb up from Yankee Boy Basin?  The gully that you climb in the last few hundred feet of that route is skiable in the spring some years, but due to its south facing aspect, it gets melted out early."
        ]
    },
    "What is your favorite app to use for hiking route planning and recording hiking trails": {
        "title": "What is your favorite app to use for hiking route planning and recording hiking trails",
        "score": 39,
        "url": "https://i.redd.it/ykcsoagyhg9d1.jpeg",
        "content": "I downloaded these four apps, but I don't know which one is more useful. I prefer those with a variety of map types and routes. Which one do you use? Can you tell me something?",
        "num_comments": 98,
        "comments": [
            "AllTrails is great for me",
            "I’ve used a few and love Gaia.  But that’s probably because I’m only interested in GPS data of my hike.  I don’t need social stuff or trail reviews or background info.  I just want to know (for fitness purposes) how many miles I’ve hiked, ascension, pace, that kind of stuff.",
            "I use Gaia (paid version).",
            "Wikiloc for planning new trails and also for its community and vast trail network",
            "Wikiloc, no doubts. (Pro plan, 10€/year aprox)",
            "I use old-fashioned paper maps, as hiking is one of those situations that I don't want to combine with screen time. If I'm interested in recording the hike as a sort of sport activity, I just use my Polar sport watch.",
            "I use Komoot, but Mapy.cz is also quite good.",
            "Washington Trails Association, but obviously it’s only good for trails in Washington state",
            "For Scottish hiking and when I go on holiday abroad I always use outdooractive. For planning routes I sometimes use os maps but always transfer the route to outdooractive to use.",
            "I love WikiLoc! I also love how it lets you import other people's routes too."
        ]
    }
}