{
    "Hiked my first 14ner at Mt. Sneffels, Summit in Colorado, USA ": {
        "title": "Hiked my first 14ner at Mt. Sneffels, Summit in Colorado, USA ",
        "score": 138,
        "url": "https://www.reddit.com/gallery/1dqyuqh",
        "content": "",
        "num_comments": 12,
        "comments": [
            "That peak above the green,  heart-shaped lake is one bad -ass climb! Hardest centennial in Colorado!",
            "My first 14er, too.      \n42 years ago.      \nNever skied off the top of Sneffels.      \nI'd like to someday.",
            "Beautiful! How were the conditions?",
            "Love the different colors of the water",
            "Whoa! Solid work!",
            "3 times. All solo. Very scary 😨",
            "Damn you’ve climbed that?",
            "You can do that?!",
            "Little gusty but otherwise great!",
            "Right those lakes are gorgeous 😍"
        ]
    },
    "Amphitheater and Delta Lake, Grand Teton Nat'l Park, WY, US": {
        "title": "Amphitheater and Delta Lake, Grand Teton Nat'l Park, WY, US",
        "score": 43,
        "url": "https://www.reddit.com/gallery/1dr0ezc",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Gorgeous!…",
            "So wonderful places. Everything looks majestic !"
        ]
    },
    "A hike in Emmental Switzerland.": {
        "title": "A hike in Emmental Switzerland.",
        "score": 66,
        "url": "https://www.reddit.com/gallery/1dqv8gu",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Land of cheese",
            "Switzerland really hits the spot aye?",
            "I was just thinking I need some cheese and crackers."
        ]
    },
    "Hiking 180km in the Swiss Alps from Chamonix to Zermatt on the Walker’s Haute Route (France and Switzerland)": {
        "title": "Hiking 180km in the Swiss Alps from Chamonix to Zermatt on the Walker’s Haute Route (France and Switzerland)",
        "score": 144,
        "url": "https://v.redd.it/g0bqztwt3c9d1",
        "content": "",
        "num_comments": 8,
        "comments": [
            "nice, looks amazing!! did you do it last summer? the snow depth was roughhhhh until like 2 weeks ago 😭",
            "[removed]",
            "I did this 2 years ago! Best thing I’ve ever done. What was your favorite part?",
            "Hey, thank you! I actually did this back in 2018, and the winter of 2017/2018 was also a relatively high snow year, and hiking in early July we had to go through a few snowy sections, and while some people decided to skip some of the higher sections, for me there weren't any sketchy snowy parts. (I tried showing them in the full video). And yeah, I don't know if you saw, about a week ago they had to close off the entire Zermatt resort due to flooding for big amounts of rain and snowmelt...",
            "We do not allow blog posts and/or self promotion. If uploading a video please use Reddit's free video uploader. Sorry for any inconvenience.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hiking) if you have any questions or concerns.*",
            "I was kind of confused when you said that you were inexperienced because ive seen a video of you doing Gr20 in 9 days, but this explains a lot. Love your videos!",
            "Thank you for the continous support! Yeah, this footage was staying on my harddrives for years, and finally got the time to finish editing it. It was my introduction to to multi-day backpacking trips making classic mistakes and carrying big, heavy gear :)",
            "can you post a link to the vid again?"
        ]
    },
    " Fagaras Mountains, Part 3, Romania ": {
        "title": " Fagaras Mountains, Part 3, Romania ",
        "score": 11,
        "url": "https://www.reddit.com/gallery/1dr3vgp",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Absolutely gorgeous!"
        ]
    }
}