{
    "Weekend's Daily Thread: General Dating Questions and Open Thread": {
        "title": "Weekend's Daily Thread: General Dating Questions and Open Thread",
        "score": 1,
        "url": "https://www.reddit.com/r/hingeapp/comments/1dqdijf/weekends_daily_thread_general_dating_questions/",
        "content": "Welcome to Hingeapp's Daily Thread.\n\n**Daily Threads are the place to post questions seeking quick advice, vent your frustrations, celebrate successes, or anything related to Hinge that does not need its own post.**\n\nFor Weekend's Daily Thread - the theme is General Dating Questions, and also open thread for anything you like to talk about.\n\nThe weekend is here! Ask here for any questions related to the Hinge app, your profile, or dating in general. Or talk about anything you have planned for, or are feeling this upcoming weekend.\n\nDo you have some last minute questions before a big date? Do you need some help with the date you have scheduled for the weekend? Or perhaps you want help with the next message to send to revive a dying conversation? When should I ask this person out on a date? Is this person ghosting? What does this text mean? Or any events related to Hinge or your dating life that happened during this week or recently that you want to share?\n\nAlso feel free to discuss whatever you like that is not necessarily related to dating or Hinge.\n\nRemember: No personal attacks, identifying information, or misogynistic/incel comments will be allowed.\n\n***A reminder to please check out the guides, sub rules, and additional resources on the subreddit sidebar.*** [***Please read this post with a collection of guides, answers to common questions, sub rules, and other resources related to Hinge.***](https://www.reddit.com/r/hingeapp/comments/15g2bbu/read_this_before_submitting_a_post_a_collection/)\n\n***The Hinge subreddit also has a*** [***Discord channel***](https://discord.gg/e8kZjVeBR6) ***if you wish to seek further assistance, or just want to meet members of the community.***",
        "num_comments": 33,
        "comments": [
            "Anyone else just feeling exhausted? Getting matches and there’s just never any replies after the initial match or first message.",
            "Got unmatched overnight because I went to bed early? \n\nLast night I (22M) matched with someone (23F) around 10pm. We had two texts and then I went to bed because I had to wake up early this morning. I finished off by asking her something and this morning when I got up (like 6am), I saw she answered and asked me something else (notification showed it was around 11pm). As I was excited to open the chat and reply, the match disappeared?! Did I just get unmatched overnight because I didn’t reply fast enough? I’m by no means a morning person but it’s just that I had a train to catch this morning. It was my first match in ages and I can’t believe I messed it up simply by going to bed ‘too early’. Am I in the wrong here? How much time do you usually allow others to text back before you unmatch them?",
            "[deleted]",
            "Should I post my occupation in my profile?\n\nI’m a fighter pilot in the Air Force. But I know we can get a bad reputation in the dating world. I thought about posting “pilot” so I don’t come off as “bragging” but that could also give off the impression of a lifestyle I don’t live. \n\nI’m not one of the reputation guys. I’m here to find my wife. So, what should I post as my occupation?",
            "I met a woman last week at a cafe. We ended up talking for four hours (we lost track of time and stayed 45 minutes after closing), and we saw a movie together a couple days later. She said she wanted another date, and I want to show her that I am taking her seriously. I thought about getting her flowers, but, and maybe this is overthinking it, I don't want to awkwardly have a flower lying around during a date. Does anyone have any good ideas, suggestions, or tips for something else I could do? It doesn't have to be a physical item. Thank you in advance.",
            "[deleted]",
            "\nI 25F matched with a 34M… We have plans to meet next weekend and have had great conversation so far on the app. His profile states that he is looking for a long-term relationship. Within the last 24 hours, I learned that I will have to relocate in two months for work. Should I… A)message him and tell him this, then ask if he still wants to get together or B)proceed with the date as planned since it is only a first date/our first time meeting? \nThank you!",
            "Any women enjoy getting tucked in? This girl really wanted a tuck-in and that’s kinda when I realized we are on different wavelengths.",
            "I sent out a rose to a standout. I responded to one of her prompts with hope of initiating conversation. She matched with me (to my surprise), but didn't respond to what I said. I tried to initiate a conversation again after we matched, and there was still no response. Has this happened to anyone? If so, what did you do?",
            "Sometimes I get matches, but most of the time they never seem to go anywhere.  The conversation fizzles out quickly, usually because the match is not very talkative, and my attempts to either engage in further conversation or set up an in-person meeting rarely ever go anywhere.  Why is this?  Why would someone go to all the trouble of matching with me, only to not respond when I try to talk to them?  Is this normal neurotypical behavior on their part, or am I just really boring?\n\nEDIT:  Also, yes, I know of the post on the FAQ, it doesn't help.  It's not normal, or at least shouldn't be, for this to be happening \\*consistently\\*."
        ]
    },
    "The Your Turn Limits Megathread & Link to Sub FAQ": {
        "title": "The Your Turn Limits Megathread & Link to Sub FAQ",
        "score": 27,
        "url": "https://www.reddit.com/r/hingeapp/comments/1dcf6xr/the_your_turn_limits_megathread_link_to_sub_faq/",
        "content": "The [Your Turn Limits feature](https://www.reddit.com/r/hingeapp/comments/1cs07fw/hinge_tests_limiting_unanswered_messages_to/) is starting to roll out to selective accounts as we've started seeing some people talk about having this feature on their Hinge. \n\nInstead of having a bunch of different posts about the feature, use this thread exclusively to share your reaction, feedback, and experience with Your Turn Limits.\n\n\\*\\*\\*\n\nTo those NEW to this subreddit, or for those seeking out the guides or the very common answers to questions already answered, the compilation post with all the relevant links is [HERE](https://www.reddit.com/r/hingeapp/comments/15g2bbu/read_this_before_submitting_a_post_a_collection/). In the few days, the sub FAQ will be updated to better serve the community.",
        "num_comments": 58,
        "comments": [
            "Ah, finally a way to clean up the graveyard of dead matches effectively.\n\nQuality over quantity, this will be a wake-up call that it's a dating app meant to be used to connect to hopefully your next partner, not to collect matches like pokemon.",
            "Question to anyone with this update on their account: Does hitting the limit only stop you from sending likes, or does it also stop you from accepting incoming likes and making new matches?",
            "So after responding to a different post about a guy's match rate dropping, could this be a side effect of the limits?\n\nI would think it would push both men and women to be more selective, and there's definitely more fellas on the apps than the ladies.\n\nSo would the match rates for men drop off more than the match rates for women? Would they stay the same? Or would both rates drop equally?",
            "I usually unmatch someone within 72 hours anyway depending if it’s a weekend holiday etc.  so this shouldn’t change much for me",
            "Ehhhh women are just going to stop using the app altogether.",
            "What's the point of the update, you can just hide matches to avoid the limit. So people are less likely to get responses now.",
            "I think this is great. Sure, it may cause a reduction in Matches, but those were hollow Matches to begin with. Now a Match will become more meaningful, which is a good thing.\n\nOf course, the ideal solution would be to make it free to see all Likes. That’s what’s causing the hollow Matches problem in the first place. But this is a good second-best option.",
            "I believe this feature would get removed after a few months when hinge realises that the issue with dating burnout these days isn’t because people are getting too many matches but because people have unrealistic standards which limiting the amount of people they can communicate with won’t change. Even if women get more selective and chose specific men it won’t get those men to commit or want to go on dates with them and the average joes who keep the app going and tend to get a date here and there off their consistency would leave the app entirely as they now get no matches. The idea of quality over quantity is massively overblown because that’s not what’s making dating difficult it’s the unrealistic standards of people that’s making dating difficult and that’s something that hinge can’t change no matter what new features they roll out.",
            "What happens if you send a message to someone at their 8 limit?",
            "this has made women even more selective lmao\n\nsurely the odds for men are even worse after this...."
        ]
    },
    "This is why I avoid people who won’t meet within a few days after matching. ": {
        "title": "This is why I avoid people who won’t meet within a few days after matching. ",
        "score": 62,
        "url": "https://www.reddit.com/r/hingeapp/comments/1dqta5e/this_is_why_i_avoid_people_who_wont_meet_within_a/",
        "content": "I(37m) matched with someone(33f) on hinge two weeks ago. \n\nWhen we started talking we hit it off pretty quick. We shared playlists, horror movies that we liked, blah blah blah. You can imagine. \n\nI asked if I could get her number and plan a time to meet and she said “here’s my number. How does next Friday(today) sound? I said “that’s a bit far out but hang on I’ll text”\n\nSo we texted. She explained she works early shifts, around 4am and ends up napping when she gets home and doesn’t want to meet during the week because of it. She also said she had plans with friends that coming weekend so her next avail was the following week. I explained I usually don’t like to wait that long because it builds up a ton of convo and anticipation and then it’s a drain if you meet and don’t click. But then I agreed anyway. \n\nSo for two weeks we talked nonstop. Like she didn’t skip a heartbeat on a reply. We shared music and our thoughts on life with each other. At one point I suggested we pretend we were going on a roadtrip and make each other a playlist of our favorite songs. That was cute. \n\nLast week she thought I was ignoring her because one of my iPhone voice clips that I sent never got delivered. Said she was depressed all day and was sad thinking I ghosted her. So she seemed very into me.\n\nConvo ended up getting a bit hot and we agreed that if we met and hit it off, then maybe we get a room together because of where the convo was going. I mean realistically how much can you talk about in two weeks with someone you are vibing with. \n\nWell last night we get into a weird fight. Keep in mind up to this point we never had a disagreement. She said something like “omg I feel so bad for making you think that, I could jump off a bridge” and I said “haha don’t joke about that! But if you do, wait until after we get that room on Friday 🤣”\n\nShe did not find it funny? Like she was very mad and we went silent for the day because I didn’t know what to say. We had been having a lot of hot convo prior and it was just a joke. After hours of not texting she unmatched me on hinge.\n\nAfter I noticed, I texted her and asked why she did that. She said “what’re you doing on hinge buddy? Already looking for my replacement??? It shows. I did it to get your attention and it worked” I told her that was weird and that I didn’t like mind games. Told her I was joking. Then she love bombed me and was saying stuff all night like “I’m so attached to you I’m sorry for overreacting” “I won’t be able to control myself around you tomorrow” “can I confess something, no, I want to say it in person, but I think you’ll like it” “I want to be your baby girl” like I think she was going to try and tell me she loves me in person… the confessing bit felt that way.  \n\nWe moved past the drama and said goodnight. \n\nToday she was getting ready to come meet me and she was sending one word replies. Said she was feeling low. Then out of nowhere she was like “I just want you to know I still have my period and it’s really bad” so I said “ohhh bummer. I guess no fooling around today? Let’s just meet and see what happens”\n\nThen she texted me raging “I KNEW THATS ALL YOU WANTED” and I was like “ whoa what? I just said it was no big deal and we can just meet and see what happens” and she started saying how I didn’t genuinely want to meet her. That I just wanted to hookup. \n\nSo I said “I think you’re thinking too much. We are supposed to meet in an hour. Why are you picking a fight right now??”\n\nThen she said “f*** you, I don’t want to meet anymore”\n\nSo I was like “listen, that’s rude and I think you’re misunderstanding me but talking to me like that is not cool. If you aren’t going to meet me today then I think we should part ways.” \n\nShe replied with “good luck”\n\nSo I waited until I was about to leave to meet her and I said “listen we’ve been talking nonstop for two weeks straight. I’m about to leave. Are we going to meet or not”\n\nNo reply. \n\nSo I texted again and said “if you’re going to act like this then I’m going to block you and move on” \n\nNo reply. \n\nI replied with “…” and it went through as undelivered because she blocked me instead. \n\nIdk what that was about. But there were red flags I should’ve listened to. She didn’t want to talk on the phone. She wouldn’t send me a voice clip if I asked. She picked fights and then blamed me. \n\nIdk what that was but I just wasted two weeks of my life to be ghosted by a psycho. ",
        "num_comments": 32,
        "comments": [
            "**All \"Dating Question\" and \"Hinge Experience\" posts must provide clear context (as per subreddit Rule 3), such as reasons for asking, and basic info such as ages, genders, location or orientation (if applicable).** Age range or general location is acceptable. \n\nMinor dating questions or Hinge experiences should be posted in the Daily Threads pinned on top of the subreddit.\n\n*Posts that do not satisfy these requirements will be removed.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hingeapp) if you have any questions or concerns.*",
            "I got drained just by reading that. Kind of surprised you were still interested in meeting her after the F-you. Also struggling to wrap my head around the fact this is a 33 year old adult we are talking about.",
            "What in the bpd did I just read LMAO. You seriously should have exited that entire interaction light years earlier. I don't care how hot she is or how much y'all initially got along.\n\nNever be desperate to date to someone.",
            "I fundamentally think that your problem was that you continued the sexual comments after you said you would figure it out when you met. The comment about the bridge was particularly strange to me - I'm sure it was a joke to you, but it was really uncomfortable to read. \n\nIf someone ever unmatches you on the app, I think that's a pretty clear sign that it's time to move on. Even if you're getting along really well with someone, you still don't really know this person.",
            "I try to not engage in conversations more than a general 1-2 day get to know you basics before meeting. \n\nY’all have been pen pals for 2 weeks and already had an argument like a couple? Not a good sign in general",
            "What in the fuck.",
            "You both sound pretty psycho tbh.",
            "So many red flags coming from both sides here. The issue isn’t really that you had to wait two weeks to meet up, it’s that you allowed yourself to get swept up in someone that you’ve never met. You need to learn boundaries and emotional regulation. I’m sure all the spicy sexting was fun but it’s very clear to me that she was insecure and worried it’s the only reason you were interested- why wouldn’t you offer her some reassurance? Instead you accuse her of thinking too much?",
            "I mean, this was definitely your fault. It comes off as if you were leading with sexual motive, based on her appearance. I’m sure you’re not the first man to find her attractive.\n\nYou were pushing boundaries that didn’t need that much pushing, before ever meeting. In other words, you overdid it.\n\nPersonally, I don’t crack jokes about having sex prior to meeting a woman I genuinely want to date, only after.\n\nAll of that being said, women who go from one extreme to another like this are never any good. They usually have their own internal issues and insecurities that need working through.\n\nIn the future, chill out a bit. If you think a woman is a bit out of your league, never let it show.",
            "You come across as ridiculously horny. It's annoying when guys press the issue. Your joke wasn't funny, unfortunately."
        ]
    },
    "Am I wasting my time?": {
        "title": "Am I wasting my time?",
        "score": 3,
        "url": "https://www.reddit.com/r/hingeapp/comments/1dr3duc/am_i_wasting_my_time/",
        "content": "I’m (33f) relatively new to online dating and I have a question. My Hinge match (37m) is in the state that I’ll be moving to this fall and we’ve been consistently talking for a couple of weeks. \nI have no experience in this “prolonged talking phase” especially if we’re planning on meeting when I do move, but is there a rhyme or reason for how texting should go? It makes sense that we haven’t set anything up yet, but the conversation is good sometimes and leaves room for improvement on other days d/t our busy schedules. I actually really like him and we’ve video chatted a couple of times.  \n\nI’m taking a break from the app currently, but I feel like maybe I shouldn’t be putting all my eggs in one basket. This guy in particular is really rare and I don’t know what to expect here.",
        "num_comments": 6,
        "comments": [
            "**All \"Dating Question\" and \"Hinge Experience\" posts must provide clear context (as per subreddit Rule 3), such as reasons for asking, and basic info such as ages, genders, location or orientation (if applicable).** Age range or general location is acceptable. \n\nMinor dating questions or Hinge experiences should be posted in the Daily Threads pinned on top of the subreddit.\n\n*Posts that do not satisfy these requirements will be removed.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hingeapp) if you have any questions or concerns.*",
            "I hope this works out for you but definitely don’t put all your eggs in this basket. \n\nIt is unusual to talk for a long amount of time before meeting up. You should learn about each other in person before dedicating so much time to texting and FaceTime.",
            "Terribad idea, sorry. I don't see why you'd every match with someone you can't meet with IMMEDIATELY. He could be an entirely different person in face to face.",
            "Keep talking to him if you want, but don’t expect too much out of it. Really I’d just focus on the move and getting settled. Moving in a couple months is going to make it hard to start something in either place.",
            "Yes, don’t fall victim to Oneitis. \n\nAlso, too much texting beforehand is not good. At least get on a phone call or video call. I really don’t understand people who text for months at a time without so much as a phone call. This person might as well be another Reddit poster.",
            "Fall is a long time away. What are you doing matching in that area?\n\n\nAs for this guy, setup a video call to see how the vibe is. Google Meet and Zoom both let you send meeting links so you don't have to exchange numbers."
        ]
    },
    "22M looking for advice with profile": {
        "title": "22M looking for advice with profile",
        "score": 6,
        "url": "https://www.reddit.com/gallery/1dqq8nd",
        "content": "",
        "num_comments": 6,
        "comments": [
            "\n**[ALL profile reviews will be manually approved](https://www.reddit.com/r/hingeapp/comments/vdao06/announcement_change_with_profile_review_posts/) and will NOT appear immediately. DO NOT contact the mods about this. Any modmail asking why your review is not approved will result in your profile review not being approved and you will not be allowed to post another profile review until seven full days have passed.**\n\n**Profile review submission MUST have all 6 photos and 3 text prompts included. You may include the optional prompts such as voice, poll, and video prompts if you choose so, but it is not required. See [this post](https://www.reddit.com/r/hingeapp/comments/1biua2j/profile_review_requirements_and_standards/) for details. Additionally, do not verbally abuse the subreddit moderators for rejection your review submission for not following proper rules. This subreddit is not obligated to allow you to submit a review.**\n\n   To assist reviewers in providing valuable feedback for your profile, please comment and answer the following questions *in the comments*:  \n   - Are you looking for something serious or casual? \n   - How long have you been using this current version of your profile? And how long is your overall time on Hinge?\n   - How often do you use Hinge per week?\n   - How many likes/matches are you receiving on average?\n   - How many likes are you sending? How many with comments? How many without comments?\n   - What is the type of person you send likes to and ideally want to match with? What kind of person do you want to attract?\n\n   **Your post WILL NOT be approved until the above questions have been answered *fully*. Failing to answer these questions in a timely manner will result in your post being removed. Please continue reading this automod comment.**\n\n   **In the meantime, be sure to check out the guides and resources on the subreddit sidebar. [Please read this post with all the pertinent links included.](https://www.reddit.com/r/hingeapp/comments/15g2bbu/read_this_before_submitting_a_post_a_collection/)**\n\n   **A strict formatting standard will be enforced. [See this post for further info.](https://www.reddit.com/r/hingeapp/comments/1958p08/psa_proper_profile_review_submission_example_with/) All submitted review posts not following the proper format will be rejected.**\n\n   **Please wait SEVEN FULL DAYS (one full week) before posting a separate update to your profile review. If you want more immediate feedback, update your original posts instead. Deleting your original post will not work. The rule will still apply.**\n\n   **To reviewers:** Review the [Providing Feedback guide](https://www.reddit.com/r/hingeapp/wiki/profileguide/feedbackguide).  You are reviewing the **profile**, not the person. Please provide **constructive criticism**, and use positive language. Any troll, hateful, misandric, misogynistic, incel, or unhelpful comments such as \"I would date you,\" \"How are you not getting matches?\" or unrelated to the profile will be removed and you will be banned.  \n\n   **To the original poster and commenters:** Please report any inappropriate or abusive messages and individuals so proper actions can be taken. Please review the sidebar for additional profile and picture guidance.\n\n   **If you DO NOT want to receive unsolicited direct messages, go to [your Reddit settings here](https://www.reddit.com/settings/messaging) on desktop to disable Direct Messages and Chat Requests. On the official Reddit app, click on your avatar on the top right corner, then click on \"Settings\" at the bottom, click on your username under \"account settings\", scroll down to \"blocking and permissions\", and click on \"chat and messaging permissions\" to disable DMs or chats.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hingeapp) if you have any questions or concerns.*",
            "You have clear photos and the prompts give a good sense of your interests and have some conversation starters in there. I wouldn’t change anything, good job and good luck :)",
            "I feel like your “worth splurging on” and “l want someone who” prompts are very similar. I feel like they paint a good picture of what you would want for your relationship. I feel like there could be something else about you and maybe something that you would look for in your potential matches that would make them a good match. Great pictures tho! Super cool and a lot of personality.",
            "-I’m looking for something serious\n\n-I’ve been using this current version for about a week, I had different prompts before but I just changed them\n\n-Around once a day\n\n-0 likes and maybe one match per week\n\n-I’m sending roughly 3 likes per day. Typically 2 out of the 3 likes have comments\n\n-I want someone who is also nerdy (my biggest thing) and someone who enjoys concerts, music, and traveling!",
            "You’re my type aaaaaaa",
            "As a 20 y/o F. You’re profile looks great tbh. Put something nerdy that most common people would get in your bio/prompt that woman can respond with. Instead of just casually liking profiles, respond with something witty and funny (not a pick up line) but something that can make them blush and feel good. Something that can can be easy to start a conversation and see your personality. But at the same time dating apps suck! "
        ]
    }
}