{
    "Dr. Dre got many weird cases, why is he around?": {
        "title": "Dr. Dre got many weird cases, why is he around?",
        "score": 2450,
        "url": "https://www.reddit.com/gallery/1dlvw5b",
        "content": "",
        "num_comments": 498,
        "comments": [
            "I’m not joking what must be going thru Dre’s head introducing that song? Is he just thinking “thank god I came up before the internet” or does he really block out the fact that he shouldn’t be throwing stones",
            "dre the heavyweight champion in women’s boxing",
            "Dr. Dre seems to be one of the only cases of a person that's too influential or iconic to bring down, only way to do it would be with an investigation like Diddy. Seems like even Kendrick is guilty of turning a blind eye for someone he looks up to.",
            "Dr. Dre beat his girlfriend so hard that she had to get plastic surgery. No wonder they call him the “Doctor” 🤦🏽‍♂️",
            "uj for a second this is for sure hypocrisy. Kendrick has this thing going about platforming abusers as some kind of redemption, but the people he chooses are ones who have not done the work to be better and earn back the trust of the public. I can’t pretend to know the interior lives of Kodack or Dre, but I do know they haven’t done much to publicly address the individuals they’ve hurt. Dee Barnes obviously doesn’t forgive Dre, and that lame ass ghost written apology he put out around when his movie was popping off doesn’t cover it tbh.  \n\nI get that this was supposed to be a West Coast reunion, but this combined with the big steppers rollout makes me think Kendrick prioritizes the concepts of his artistic projects over his own ethics",
            "Sounds like you forgot about Dre…\n\nBut seriously, dude has made more off selling headphones than his own music",
            "this beef is the wife beaters vs the child molesters, I think it’s time I join the winning side!",
            "“What the fuck is cancel culture, dawg”\n\n- Kendrick Lamar, N95",
            "You know what fuck this sub and its dog shit automod messages. NBAcirclejerk was so much better once that shit was gone. \n\nIt’s like wadding through shit just to find something funny.",
            "Dre has a whole Wikipedia section titled “violence against women” dawg wtf is Midrick on 😭"
        ]
    },
    "Outjerked by TikTok comments": {
        "title": "Outjerked by TikTok comments",
        "score": 2497,
        "url": "https://i.redd.it/7vr42ro67d9d1.png",
        "content": "",
        "num_comments": 114,
        "comments": [
            "Hey drake they are slow",
            "I thought Kendrick lamear meant the graham crackers (the second word of that is a white slur! Directed towards drake)",
            "Holy shit we got outjerked so fucking hard",
            "Wow what a hidden entendre, kendrick really is the goat",
            "Is it really an outjerk if they are intellectualy disabled?",
            "Meet the grahams. Quadruple entendre in the name of the song\n\n\n\n1. “Graham”- Is drakes last name, as in aubrey GRAHAM\n\n\n2. “Graham” is 6 letters, as in the heart part 6, slight jab by kendrick showing that he doesnt care about the diss track\n\n\n3. More numerology, Meet(4)+The(3)+Grahams(7)=14. 6+1+6=13 (6:16 in LA) Kendricks basically saying with this is that hes one upping himself with meet the grahams\n\n\n4. He titles the song “Meet the Grahams” as he goes on to introduce the members of the family, where we literally go on to “Meet the grahams” this probably went under the radar to less keen fans.",
            "I thought he came out of the womb just named Drake, no last name",
            "It's funny I've seen people sing out \"tryna strike a Chord and it's probably a minor\" and then you ask them if they know music theory and they don't even know what the fuck Kendrick was referring to hurts my fucking brain",
            "Oh I thought his name was Drake Aubrey, now I'm more confused",
            "Now it all makes sense😧"
        ]
    },
    "Violently outjerked by this whole twitter thread": {
        "title": "Violently outjerked by this whole twitter thread",
        "score": 862,
        "url": "https://i.redd.it/vfojnj9xzd9d1.jpeg",
        "content": "AI couldn’t write this shit. Also can we get the old flairs back these new ones fucking suck.",
        "num_comments": 52,
        "comments": [
            "I’m a 127 year old great great memaw, I really dont like the hardcore gangster stuff, but that Tom McDonald guy is my favorite!!!!",
            "Strong Stormfront.com influence",
            "This the type of guy to listen to Beethoven and Mozart while thinking Penderecki, Cage, and Xenakis will be the downfall of Western society.",
            "Bottom comment gotta be an automod reply now",
            "Well Vinnie, that’s more for us.",
            "Dudes name is dick craven lol",
            "https://preview.redd.it/hi7vxop96g9d1.png?width=1080&format=pjpg&auto=webp&s=8db98027524180df034ee6426c7026d2f8fb4b18\n\n😬",
            "https://preview.redd.it/qlpgo3oiqf9d1.jpeg?width=426&format=pjpg&auto=webp&s=995bf86cfe8a7a0b2f8c14a2de1f398f82bf7d9a",
            "Bro I saw a video of a white girl bumping MF Doom and I wanted to marry her on the spot",
            "He’s gonna have a meltdown once he realizes that pretty much anyone under 30 listen to rap, a lot of"
        ]
    },
    "What is J. Cole’s best song?": {
        "title": "What is J. Cole’s best song?",
        "score": 173,
        "url": "https://i.redd.it/016wh1mqxf9d1.jpeg",
        "content": "",
        "num_comments": 26,
        "comments": [
            "https://preview.redd.it/7ql4e4p36g9d1.png?width=720&format=pjpg&auto=webp&s=dd43af1d839266913fdb4a0f448348bff1f34f0a",
            "https://preview.redd.it/y4zns1lp3g9d1.jpeg?width=1170&format=pjpg&auto=webp&s=2b78371682eec1bd5010d8d5caaf158d3358224d",
            "It’s…it’s..its…🤔",
            "Its grippy😃☝️\n\nUnJerk/ its l e t . g o . m y . h a n d or no role modelz",
            "Grippy!!!\n\nhttps://preview.redd.it/1n4ym8uqhg9d1.jpeg?width=300&format=pjpg&auto=webp&s=b6d4a7d5f900a046f263a86345bd0cfaeca94f8a",
            "Didn’t he do Throw It In The Bag?",
            "The one where he raps about banging a high schooler 🔥🗣️😮‍💨",
            "I’ll have to get back to you on that. Are you able to be put on hold?",
            "Trae the Truth in Ibiza",
            "G"
        ]
    },
    "Sorry Kenny, the culture has spoken. ": {
        "title": "Sorry Kenny, the culture has spoken. ",
        "score": 1003,
        "url": "https://i.redd.it/y1zheqp00c9d1.png",
        "content": "",
        "num_comments": 54,
        "comments": [
            "Bladee can make tpab but Kendrick could never make icedancer",
            "where's the jerk",
            "There wouldn't be a Kendrick without Bladee",
            "mountain moment",
            "Bladee IS the culture itself",
            "But not that kinda free I’m talking bout my nigga bladeee",
            "Bladee could write the entirety of TPAB but I bet Kendrick could never even THINK of a masterpiece like BeNice2Me",
            "Kenny = al sharpton of rap",
            "Bladee could make Father Time but Kendrick couldn’t make ITS OK TO NOT BE OK",
            "Why does the bottom cover kind of look like udyrs splashart from league"
        ]
    }
}