{
    "Dr. Dre got many weird cases, why is he around?": {
        "title": "Dr. Dre got many weird cases, why is he around?",
        "score": 2455,
        "url": "https://www.reddit.com/gallery/1dlvw5b",
        "content": "",
        "num_comments": 498,
        "comments": [
            "I’m not joking what must be going thru Dre’s head introducing that song? Is he just thinking “thank god I came up before the internet” or does he really block out the fact that he shouldn’t be throwing stones",
            "dre the heavyweight champion in women’s boxing",
            "Dr. Dre seems to be one of the only cases of a person that's too influential or iconic to bring down, only way to do it would be with an investigation like Diddy. Seems like even Kendrick is guilty of turning a blind eye for someone he looks up to.",
            "Dr. Dre beat his girlfriend so hard that she had to get plastic surgery. No wonder they call him the “Doctor” 🤦🏽‍♂️",
            "uj for a second this is for sure hypocrisy. Kendrick has this thing going about platforming abusers as some kind of redemption, but the people he chooses are ones who have not done the work to be better and earn back the trust of the public. I can’t pretend to know the interior lives of Kodack or Dre, but I do know they haven’t done much to publicly address the individuals they’ve hurt. Dee Barnes obviously doesn’t forgive Dre, and that lame ass ghost written apology he put out around when his movie was popping off doesn’t cover it tbh.  \n\nI get that this was supposed to be a West Coast reunion, but this combined with the big steppers rollout makes me think Kendrick prioritizes the concepts of his artistic projects over his own ethics",
            "Sounds like you forgot about Dre…\n\nBut seriously, dude has made more off selling headphones than his own music",
            "“What the fuck is cancel culture, dawg”\n\n- Kendrick Lamar, N95",
            "You know what fuck this sub and its dog shit automod messages. NBAcirclejerk was so much better once that shit was gone. \n\nIt’s like wadding through shit just to find something funny.",
            "Dre has a whole Wikipedia section titled “violence against women” dawg wtf is Midrick on 😭",
            "It was never about him caring about weird cases or victims, it was always about him hating Drake."
        ]
    },
    "Why Do All Legends Die?": {
        "title": "Why Do All Legends Die?",
        "score": 648,
        "url": "https://i.redd.it/dht9a4xrwf9d1.jpeg",
        "content": "",
        "num_comments": 46,
        "comments": [
            "i need this in a XXL so that i look like a child when i wear it",
            "The worst part is the time stamps. Pac was the first to text. Bro just randomly texted \"Die?\"",
            "Imagine Tupac sliding into your DMs",
            "All legends die because all humans die",
            "2Pacs twitter account lol also someone tell the Lil Peep fans dying doesn't automatically make you a legend",
            "Avicii included because they couldn’t think of any other dead rappers",
            "Maybe 2-3 legends here. Peep and XXX were not legends. Sure they made a good album but they weren’t legends",
            "unjerk avicii a legend lowkey",
            "Some don't die soon enough",
            "Proof Pac didn’t die, man tweeted 12 years after his supposed death"
        ]
    },
    "Outjerked by TikTok comments": {
        "title": "Outjerked by TikTok comments",
        "score": 3281,
        "url": "https://i.redd.it/7vr42ro67d9d1.png",
        "content": "",
        "num_comments": 124,
        "comments": [
            "I thought Kendrick lamear meant the graham crackers (the second word of that is a white slur! Directed towards drake)",
            "Hey drake they are slow",
            "Holy shit we got outjerked so fucking hard",
            "Wow what a hidden entendre, kendrick really is the goat",
            "Is it really an outjerk if they are intellectualy disabled?",
            "I thought he came out of the womb just named Drake, no last name",
            "Oh I thought his name was Drake Aubrey, now I'm more confused",
            "It's funny I've seen people sing out \"tryna strike a Chord and it's probably a minor\" and then you ask them if they know music theory and they don't even know what the fuck Kendrick was referring to hurts my fucking brain",
            "Now it all makes sense😧",
            "\"hey drake they're not slow\""
        ]
    },
    "These mfs aren't real bro": {
        "title": "These mfs aren't real bro",
        "score": 390,
        "url": "https://www.reddit.com/gallery/1dr4b1p",
        "content": "",
        "num_comments": 75,
        "comments": [
            "uj/ I’m so fucking sick of this false narrative that gen z is trying to cancel him, we r not, the vast majority of us don’t care. This kinda shit makes me embarrassed to be an Em fan",
            "Did we get outjerked? ……………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………yes 😂😂",
            "Does cancel even mean anything anymore",
            "how can you cancel a man who wears a blonde wig???😂 so emotional 😂😂😂😂\n\ncry all you want we'll just vibrate to houdini on repeat 🤓",
            "YouTube comments and Instagram comments are written by the lowest quality people currently existing",
            "musicmedia doesn’t even believe in that narrative as well, he’s just using em fans for views 😹",
            ">If you're offended by Em, you're probably one of the things he's making fun of in his lyrics\n\n- The same people who stan him while he made \"Stan\" to make fun of these people.",
            "Bloody hell, this sub gets outjerked everyday",
            "omg he's such an epic sigma 💯💯",
            "Im this close to pulling the trigger"
        ]
    },
    "What is J. Cole’s best song?": {
        "title": "What is J. Cole’s best song?",
        "score": 456,
        "url": "https://i.redd.it/016wh1mqxf9d1.jpeg",
        "content": "",
        "num_comments": 48,
        "comments": [
            "Its grippy😃☝️\n\nUnJerk/ its l e t . g o . m y . h a n d or no role modelz",
            "Didn’t he do Throw It In The Bag?",
            "Trae the Truth in Ibiza",
            "The one where he raps about banging a high schooler 🔥🗣️😮‍💨",
            "I’ll have to get back to you on that. Are you able to be put on hold?",
            "W picks even if they’re basic",
            "G.O.M.D. Is very underrated. The first verse is amazing",
            "Oh shit nevermind that was Akon",
            "I think your confusing him with Drake",
            "She was in my math class😩"
        ]
    }
}