{
    "Never underestimate an outnumbered army": {
        "title": "Never underestimate an outnumbered army",
        "score": 2779,
        "url": "https://i.redd.it/3u9r652cgh9d1.png",
        "content": "",
        "num_comments": 48,
        "comments": [
            "He killed the Boss, of course the mobs despawned",
            "I don't get why mercenaries wanted to sell their skills, loyalty and soul for the price of coin. The mercenaries are always sacrificed first, to spare your own people. But also the less survive, the less you pay.\n\nThe act of charging them into the enemy and get them slaughtered seems like an economical win too.",
            "Roman's were built different (insane)",
            "Been listening to the History of Byzantium podcast? Laskaris was covered recently.",
            "Chad mercenaries, charging into certain doom",
            "Seems to me if the Sultan stayed in the rear he would have won the battle pretty handedly",
            "Why do I always read these history memes in drew durnils voice? ",
            "Henry V: I like those odds.",
            "Georgia also won the battle of didgori in 1121 despite being grossly outnumbered by the seljuks",
            "In terms of military strategy, doesn't necessity usually require the smaller force to act first?"
        ]
    },
    "Can we finally put this to bed please?": {
        "title": "Can we finally put this to bed please?",
        "score": 1959,
        "url": "https://i.redd.it/w8rbzg60yd9d1.jpeg",
        "content": "Storm of Steel is a wonderful memoir by Ernst Jünger, a soldier in the German Army during WWI. Hemingway fought for the loyalists during the Spanish Civil War, and this experience informed much of his work. The Catastrophe is Kerensky’s account of the Russian Civil War. From Manassas to Appomattox is James Longstreet’s memoir of the US Civil War. Inside the Third Reich is Albert Speer’s very self serving memoir of his time in the Nazi government (take this one with a giant grain of salt). Thucydides was an Athenian general during the Peloponnesian war.",
        "num_comments": 189,
        "comments": [
            "To quote Max Miller of Tasting History, \n\n\"History is written by those who write.\"",
            "You're right. None of those authors are named Victor.",
            "\"History is written by the victors\" doesn't mean losers never tell their story. It's a proverb; it's not meant to be taken literally.\n\nIt's saying that those that win wars usually control the narrative, so we generally believe the winners are telling the truth. It's not true 100% of the time, but again, it's a rhetorical device, not an objectively true statement.",
            "History is written by those willing to write it, thats the truth. The Athenians wanted their deeds to be remembered, the Spartans cared little. Who is the largest source of historical documents on classical Greece? Athnes, inspite of losing the power struggle with Sparta, and then getting conquered by Macedonia",
            "I also recommend Barefoot Gen by Keiji Nakazawa. Is a story based on the author's own experiences about a family that lived in Hiroshima when the atomic bomb was dropped. I'm on the second volume and it's pretty good.",
            "History is written by the writers",
            "I remember reading a book on polish history which open with this it is said that history is written by the victors, but losers right history too. They just dont get translated.",
            "Awfully demanding for someone who completely misunderstood the statement.",
            "The entire bible is full of stories of the Jews being killed and oppressed by one empire after another",
            "Inside the Third Reich?! That falsefied to the core piece of shit wtitten by one the biggest war criminals saved by the allies with probably the sole reason as to wright this crap?! **REALLY?!**"
        ]
    },
    "Worst fate than death": {
        "title": "Worst fate than death",
        "score": 5850,
        "url": "https://i.redd.it/ph9b4v9e9c9d1.jpeg",
        "content": "",
        "num_comments": 46,
        "comments": [
            "Context:  \nUnder Ming law, any man marries into the royal family would have to forfeit all rights to have official position, personal title, participation in state examination. So if you have any ambition to have any power, say goodbye to all of it. Furthermore you have to live in your own quarter away from your wife whom live inside forbidden city. You're only allowed to visit her twice or thrice a year or you can bribe your way into her chamber, but that would not be cheep cause there tons of eunuchs, court ladies to be paid off. You also banned from having concubine. So nearly all your life pleasure is stripped away from you so that you can brag that you are in-law to the emperor.",
            "Ming Dynasty Pussy Got Me Acting Unwise",
            "Still sounds like a good deal, tbh",
            " Id take it off chance my kid could be their heir and or marry the heir",
            "She is one expensive  bitch.",
            "So, is the royal family completely isolated politically? What incentive does one have to marry a princess if that is the price.",
            "So you just chill with your buddies, all expenses payed and get to shag three times a year?",
            "Honestly, all sounded fine until the no living with or seeing your wife except twice per year.",
            "Honestly, thought it would be way worse.",
            "I can't imagine the princess would be happy with those terms."
        ]
    },
    "Tzar Alexander's kids wish they received the same mercy as emperor Puyi did": {
        "title": "Tzar Alexander's kids wish they received the same mercy as emperor Puyi did",
        "score": 6650,
        "url": "https://i.redd.it/2zalmwy62c9d1.jpeg",
        "content": "",
        "num_comments": 210,
        "comments": [
            "The fallout from the Tsar's death is specifically \\*why\\* Mao wanted a living monarch: a dead one makes the new government look afraid of the old one, makes the monarch look better if they face death bravely, and you end up with weird things like the Anastasia myth. \n\nReduce the monarchy to the level of office water cooler trivia, though, and all those romantic elements disappear into the dustbin of history.",
            "Honestly one of the smartest things Mao ever did. Imagine being a depressed street cleaner and then you see a coworker say Hey I used to be royalty and I prefer this to that",
            "And then you have the French.",
            "Nicholas. Alexander II was assassinated in 1881 by nihilist revolutionaries.",
            "I dont feel particularly bad for Nicholas but his children deserved better.",
            "I know a guy related to the Laotian royal family and came to the US after they were deposed. Many of his relatives got a similar treatment to the Czar.",
            "It is said that the order to execute Royal Family was given by region commandment under Bolsheviks without consent of Lenin, which is a crime - region organs had no right to persecute such measures without approval of government higher. So basically that makes execution of Nicholas || family literally a crime without justification, a brutal slaughter of emperor's kids and even house workers.",
            "Don't worry guys, alexei lives",
            "Heyyy apparently I got some names mixed up in the post's title, just a heads up, I'm referring to tzar Nicholas II, not Alexander",
            "To be fair, though, that's Russia dealing with anybody"
        ]
    },
    "Its more complicated then people think": {
        "title": "Its more complicated then people think",
        "score": 8790,
        "url": "https://i.redd.it/ha8a86adhb9d1.png",
        "content": "",
        "num_comments": 276,
        "comments": [
            "Not to mention, after Elizabeth I's death, James VI of Scotland became James I of England as well and thus permanently uniting the two Kingdoms together",
            "Scotland's contribution to the United Kingdom cannot be overstated. They have punched well above their weight in almost every sphere of human endeavour. Plus they are very good fighters.",
            "It is funny seeing Americans catch themselves to say England rather than Britain, because they seem to think Scotland is innocent, when they are far from it.\n\nThe entirety of the UK has played a major part in our atrocities.",
            "Anglo-Scottish union in the movies: \"RAA FREEEDOM!!!\" *tragic bagpipe music*\n\nThe union in real life: \"I need tree-fiddy.\"",
            "or how England basically invaded during Macbeth's reign to(ironicallly given Capercullen) place Malcolm Canmore on the throne. Everyone sees thanks to Bill S, the one time it applies people rooting with the English as shown by Disney of all people.",
            "Highest proportion of East india company officers were scottish lol",
            "We can thank Scotland for Gordon Ramsay",
            "Yeah, it was mostly Scots who migrated to Northern Ireland, not English people (although both did come)",
            "Historical England: Anglo Saxon Kingdoms in the east and Welsh Kingdoms in the west.\n Historical Scottish Lowlands: Anglian Northumbria in the east and Quasi-Welsh Strathclyde in the west.",
            "I meanhistorically speaking the union was originally Scottish led due to king James."
        ]
    }
}