{
    "We need to talk about how people discuss controversial events, organizations, and people": {
        "title": "We need to talk about how people discuss controversial events, organizations, and people",
        "score": 1281,
        "url": "https://www.reddit.com/r/HistoryPorn/comments/f6gksv/we_need_to_talk_about_how_people_discuss/",
        "content": "#Introduction\n\nHere on r/HistoryPorn, we deal with a lot of sensitive and controversial topics such as the Holocaust and Nazism, Communism, certain wars and atrocities, and certain political figures. When these topics come up, we often see people expressing strong emotional perspectives. While totally understandable, this often leads to unproductive discussion and rule breaking behavior. Furthermore, the moderator team is often falsely accused of defending or supporting those topics or figures by enforcing the rules. Thus, we feel that it is necessary to briefly talk about the purpose of our community, and why we enforce these rules.\n\n#This subreddit’s purpose\n\nThe purpose of HistoryPorn is that people can submit photographs of historical events, and/or the people in them, and members can discuss those people, events, and the contexts surrounding them further in the comments section. We want these discussions to be substantial and constructive so that users can share their thoughts and perspectives, knowledge, and experiences regarding the topics. This sets us apart from many other communities on Reddit; rather than encouraging jokes, slapfights, and vulgar statements about certain subjects, we want to encourage substantial discussions so that people leave threads having gained something from the discussion.\n\n#The rules\n\nThis is where our comment rules come into play. The rules that apply to this post are: Don't attack other users (or those in the photographs), don't troll, don't go on political rants, and don't use overly vulgar language. For instance, in every post featuring a picture of a Nazi, there will be a variety of rule-breaking comments that we have to deal with. Such comments include ones that call for all Nazis to die, comments that consist of nothing but obscenities and vulgar statements, and comments that compare those historical figures to contemporary political figures. None of these contribute to a constructive discussion that furthers our understanding of history. We agree that Nazis are terrible but wishing them to be dead doesn't really accomplish anything; those in the pictures are long-dead, or at least not reading these Reddit threads. We should note that this is merely an example; as we said above, we see similar issues in threads about other figures and events as well.\n\nVulgar statements are simply vulgar statements that don't contribute constructively to the discussion. As well, while it is tempting to make comparisons to modern political events, because we are on the internet this often simply means that we have another internet slap fight on our hands instead of a productive discussion about the historical event in question. Given the sensitive nature of these topics, people often get confused and angry when we remove those comments and sanction those who made them. However, as we said, there are many places on Reddit where people can make those sorts of comments. At HistoryPorn, we want users to aim for a higher level of discussion.\n\n#What we’d like to see\n\nAll that being said, this does not mean you can't criticize historical events, organizations, and people. In fact, we *encourage* it. However, we want these criticisms to have substance, instead of breaking the rules just because of the subject at hand. If we allowed rule breaking comments on these controversial threads, we'd devolve into a place where high quality discussions wouldn't likely be the norm anymore. These threads would be filled with the same old \"fuck nazis/fuck communism/fuck imperialism/etc.\" in every thread. So we certainly don't want to stop discussion, we simply want discussion to be about the historical subject pictured and of good quality. It is entirely possible to discuss committed atrocities and terrible people in a historical discussion without vitriol.\n\nIf you want to criticize things, express yourself properly. Talk about the crimes that the subject committed. Talk about why those figures, organizations, or events were bad. Bring up a personal anecdote (for instance, perhaps you knew a veteran who experienced the subject first-hand, or the post reminded you of something you read). It doesn't matter what route you take, so long as you do so in a way that adds to the discussion and doesn't break the rules. People should leave your comment having gained something from reading it. Obviously we won't be deleting comments that aren't \"substantial enough\". We just want people to try and be constructive. We wouldn't pass an assignment in a history course by saying \"communism is a cancer that kills people\", even though it's \"only\" insulting Communism. We’d still be expected to explain why it was bad, when it killed people, etc. In that same vein, explain yourself here and don't use obscenities or vulgarity as a crutch for your point.\n\n#Conclusion/TL;DR\n\nWe hope that helps to explain the stance of the moderator team, and why we oftentimes remove seemingly agreeable comments. We aren't Nazis, Communists, Fascist, Imperialist, or any other kind of \"ist\". All we want to do is ensure that discussions on r/HistoryPorn remain substantial, constructive, and high quality. Profanity, calls for people to die, and other simple and vulgar comments do not add anything to the discussion, and will be removed *regardless of context*. If you want to criticize people, events, or organizations, do so in a way that adds to the discussion and gets your point across without breaking the rules.",
        "num_comments": 155,
        "comments": [
            "Those sound like good rules.  Thanks for moderating.",
            "My main concern is that I don't see how vulgarity and clear, cohesive reasoning are mutually exclusive. A person could be very well spoken, and make great points, but if they threw in some cursing to emphasize their statements, it would be against the rules?",
            "Is there a subreddit like this but without all the glamorizing of war?",
            "Good to see these rules: it means we could discuss about submitted pictures in a civilized manner.",
            "Why doesn't anyone ever talk about how many innocent Christians and non Christians that Stalin and his special police murderd and women that were raped at the time of ww2. The numbers were much high than that of the German army did. But not much press about it.",
            "So are you guys ever actually going to do anything about the creepy sexual commentary that pops up unter nearly every picture of a conventionally attractive woman in this sub, or is that what you think of when you talk about \"high quality discussions\"?",
            "Hi mods,\n\nIt feels like this thread is starting to devolve into a faces of death -esque competition to me.  I just unexpectedly looked at severed Childrens hands/feet, and there was no tag or warning on the post. Probably ruined my week. Is it just time for me to leave this sub, with all due respect to you guys?",
            "Glorification of us war crimes does it for me. I'm out anyway. Too little, too late.",
            "Bravo.  This is fantastic and hopefully ideas for constructive conversation will matriculate to other parts of our online behavior.",
            "As a history and American government teacher, I am grateful I cite as this exists. Teaching at a college is incredibly hard; students do not know history because Post-Modernism keeps us in a perpetual present with no forgiveness or benchmarkers to look backward to allow students to see how societies have changed over time.\n\nI look forward to the discussions."
        ]
    },
    "Grand Central Station - New York (1941) (758x582)": {
        "title": "Grand Central Station - New York (1941) (758x582)",
        "score": 509,
        "url": "https://i.redd.it/mxpf83grzd9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "No matter how many times I see this picture, I'm in awe of its beauty!",
            "I used to do lighting for a museum and would sometimes be asked to recreate beams of sunlight in the exhibition spaces. Besides the limitations of light sources you can fit in a building, you need particles suspended in the air. Concerts use smoke or haze, this pic could be steam or smoke from the trains, none of the above are good for your Picasso",
            "Its sad how light no longer comes through due to the high rises around it",
            "By the great Alfred Stieglitz",
            "Cover on the book of Winters Tale, by Mark Helprin.\n\nPerfect choice. Beautiful.",
            "I love the shadows left by moving people because of the exposure time",
            "Beautiful, but likely only possible because of a terrifying amount of secondhand smoke. You need particulates in the air to be able to see sunbeams like that.",
            "It's Grand. And it's Central.",
            "It's 1941 so I'm guessing that people are helping to produce smoke as well.",
            "*Terminal\n\n/pedantic"
        ]
    },
    "A group of Boer commandos in the 2nd Boer War. Seated are Jan Smuts and Manie Maritz. After the war, Smuts moved on and slowly softened his racist views. Maritz doubled-down on them, led a white supremacist uprising in 1914, and later became an ardent supporter of Nazism, 1901 [1920 x 1076].": {
        "title": "A group of Boer commandos in the 2nd Boer War. Seated are Jan Smuts and Manie Maritz. After the war, Smuts moved on and slowly softened his racist views. Maritz doubled-down on them, led a white supremacist uprising in 1914, and later became an ardent supporter of Nazism, 1901 [1920 x 1076].",
        "score": 242,
        "url": "https://i.redd.it/4c2f41bhvd9d1.png",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Boer history is so interesting to me, as it has elements of anti-colonialism against European countries, along side some significant colonialist, white supremacist elements.\n\nIn other words, Boer history should be seen as nuances built on nuances.",
            "White supremacist who was also a Nazi lover, well that's something you don't see everyday. /s",
            "God damn look at those outfits.",
            "The white tribe of Africa?",
            "And then went on to be the oppressors. Humans be like that.",
            "We have Boer Stalin on the right.",
            "They were a slave-holding society. One of their primary grievances (although there were others) against the British was Britain's strong anti-slavery stance",
            "As I said: nuances upon nuances (upon Apartheid)",
            "Facial hair is on point",
            "Learn something new everyday I'll have to do some research"
        ]
    },
    "Russian tanks on the streets of Prague in 1968. [1154 x 768].": {
        "title": "Russian tanks on the streets of Prague in 1968. [1154 x 768].",
        "score": 748,
        "url": "https://i.redd.it/3dxpja4v0b9d1.jpeg",
        "content": "",
        "num_comments": 26,
        "comments": [
            "To be fair, those are Soviet tanks",
            "Now those 1968 Soviet tanks are in Ukraine",
            "I bet some of these tanks are in Ukraine right now lol",
            "There are some really cool photos of this uprising. 'Good old Communists' treating people well... /S\n\nThanks for sharing!",
            "Now those very same tanks are in Ukraine",
            "I'm guessing the usual tankie brigade won't be showing up to this thread.\n\nEDIT: Nope, just silently downvoting.",
            "My grandma was running behind one of those tanks yelling at them.",
            "They are liberating Prague from Czech control",
            "Technically those were Warsaw Pact tanks, but its no coincidence that the most popular protest song at that time started with Go home, Ivan; Natasha is waiting for you.",
            "I really wish I could find a publicly available order of battle for this invasion.  I'm curious about *which* units, specifically, were chosen, and I wonder if there about the politics involved in that decision making."
        ]
    },
    "Two bald eagles rescued from Exxon Valdez oil spill in Alaska. 1989 [640×480]": {
        "title": "Two bald eagles rescued from Exxon Valdez oil spill in Alaska. 1989 [640×480]",
        "score": 47,
        "url": "https://i.redd.it/482hqk1i9e9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Those two are pissed off"
        ]
    }
}