{
    "Weekly History Questions Thread.": {
        "title": "Weekly History Questions Thread.",
        "score": 15,
        "url": "https://www.reddit.com/r/history/comments/1dlu3ju/weekly_history_questions_thread/",
        "content": "Welcome to our History Questions Thread!\n\nThis thread is for all those history related questions that are too simple, short or a bit too silly to warrant their own post.\n\nSo, do you have a question about history and have always been afraid to ask? Well, today is your lucky day. Ask away!\n\nOf course all our regular rules and guidelines still apply and to be just that bit extra clear:\n\nQuestions need to be historical in nature. Silly does not mean that your question should be a joke. [r/history](https://www.reddit.com/r/history/) also has an active [discord server](https://discord.com/invite/r-history-284001693044310016) where you can discuss history with other enthusiasts and experts.",
        "num_comments": 48,
        "comments": [
            "I love History and am a software eng.  Making a 'Local History' Map has been a project thats called to me for so long.\n\nIf I made this would others use it / care?",
            "Can anyone explain the difference between Japanese emperors and shoguns? Was this a situation of ceremonial leadership versus actual leadership, shared leadership, or something altogether different?",
            "Hello fans of historical fashion!  I'm looking for any super-early documents regarding the codpiece.  Particularly, any advertisements for codpiece sellers/makers, or any pamphlets/sermons etc denouncing them. Can you help?",
            "Looking to learn the whole of English history.\n\nWondering if there is a popular book set etc.\n\nWould perferable read a book but if my best bet is documentary/youtube series then please send them in!",
            "What were the largest cities in the Roman Empire? I’m doing a commission and there’s some obviously biggest ones from my knowledge but many of the lists seem to not include the Iraqi area/are just limited to the top 5-10, if anyone can give me a best guess of the top 20 or so it would be much appreciated",
            "Would have Napoleon lost Waterloo if he never lost close to half a million men (RIP) in Russia?",
            "If a soldier in WWII got sick and died on the way home, say on a ship, post-war, what would they do with the body? Would they do a sea burial? Autopsy? Thanks!",
            "I'm drafting a sword and sorcery fantasy story at the moment. It's set in Viking Age Ireland (9th century). What are some things I should keep in mind about the period when I'm writing it? Apart from the obvious such as  Ireland had been Christian for 500 years by this point, politics was bound up with the ambitions of local kings, and prominent clerics were often aristocrats with fighting experience? Thanks!",
            "During the Battle of Nivelle (1813), was the French camp on the peak of La Rhune? Or was their position lower down the mountain?",
            "Just wealthy did you have to be to afford full-plate armor?\n\nLet's say that I'm a well to-do french peasant in the 14-15th century beholden to a small local lord that doesn't tax me overmuch. My father has told me some stories about the time that the current lord's father levied him and one of his brothers for a small war with another small local lord and that the reason I never met this uncle is because he was shot in the face. I take this story to heart and decide I would like to not die in this way if I'm ever levied for a similar conflict.\n\nWould it even be a possibility for someone of my social class? Is it something that might be achievable if I save up the meagre profits I make from the surplus I sell at the market and do labour for the town tradesmen in winter?\n\nCould I, maybe, purchase old munition plate from retired soldiers that live nearby and bring it to an armorsmith to have him fit it to me and complete the set for less than the full cost?\n\nOr is this something that would have people laughing me out of their shops given my station? Do I face restrictions to the access of the armor other than just monetary ones? Is custom-fitted full-plate only allowed to the nobility and their armsmen?"
        ]
    },
    "Bookclub and Sources Wednesday!": {
        "title": "Bookclub and Sources Wednesday!",
        "score": 16,
        "url": "https://www.reddit.com/r/history/comments/1dovtb1/bookclub_and_sources_wednesday/",
        "content": "Hi everybody,\n\nWelcome to our weekly book recommendation thread!\n\nWe have found that a lot of people come to this sub to ask for books about history or sources on certain topics. Others make posts about a book they themselves have read and want to share their thoughts about it with the rest of the sub.\n\nWe thought it would be a good idea to try and bundle these posts together a bit. One big weekly post where everybody can ask for books or (re)sources on any historic subject or timeperiod, or to share books they recently discovered or read. Giving opinions or asking about their factuality is encouraged!\n\nOf course it’s not limited to \\*just\\* books; podcasts, videos, etc. are also welcome. As a reminder, [r/history](https://www.reddit.com/r/history/) also has a recommended list of things to read, listen to or watch",
        "num_comments": 8,
        "comments": [
            "Hi everybody, \n\nI’m looking for a book about the Hungarian raids/conquest of the early 9th/10th century. It’s a fascinating time period, but I can’t find literature about this topic. Any recommendation would be highly appreciated!",
            "Supreme Commander: MacArthur's Triumph in Japan by Seymour Morris Jr is my recommendation. The book is mainly about MacArthur's rule over Japan as Supreme Commander Post World War II. Tidbits on the writing of the Japanese Constitution, the Japanese surrender on USS Missouri and the capture of war criminals are expertly woven together. It's a must read for any World War II buff. Link below.\n\n[Amazon.com: Supreme Commander: MacArthur's Triumph in Japan: 9780062287939: Morris Jr., Seymour: Books](https://www.amazon.com/Supreme-Commander-MacArthurs-Triumph-Japan/dp/0062287931)",
            "I recently reviewed *The Sleepwalkers: How Europe Went to War in 1914* and made a \"cheatsheet\" that might help anyone reading it: https://river.me/blog/sleepwalkers-notes/\n\nI thought it was really good! I'm hoping to read *The War That Ended Peace* soon",
            "Happy Wednesday everyone!\n\nJust finished Caaroline Burt and Richard Partington's \"Arise, England: Six Kings and the Making of the English State\". \n\nThe book does a fantastic job of going over the rule of  6 of England's Plantegenet king's and their role in the emergence of English statehood. I also found the writing style to be engaging and far from being dry.",
            "Took me nearly a month but I've just finished **Napoleon the Great by Andrew Roberts**. Not much to say about it beyond it being very good. It's long at just over 800 pages but covers a lot of stuff, his personal life, military campaigns and his political reforms. The military sections are very detailed. I haven't read much about the French Revolution or the  Napoleonic Wars (apart from a couple of books about Waterloo) but  I found the book to be mostly easy to follow.",
            "Thanks for sharing! Sent this over to a buddy of mine :)",
            "I'm interested in reading this. Does it read like narrative history (eg like Dan Jones if you know his style)?",
            "Funny you mention this, Dan Jones actually recommends the book! I found it quite readable myself :)"
        ]
    },
    "New study provides new evidence that the Antikythera mechanism was used to track the Greek lunar year - Anatolian Archaeology": {
        "title": "New study provides new evidence that the Antikythera mechanism was used to track the Greek lunar year - Anatolian Archaeology",
        "score": 233,
        "url": "https://anatolianarchaeology.net/new-study-provides-new-evidence-that-the-antikythera-mechanism-was-used-to-track-the-greek-lunar-year/",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Arthur C Clarke had this to say:\n\n* “Few activities are more futile than ῾what if …᾽ type of speculation, yet the Antikythera mechanism positively compels such thinking. Though it is over two thousand years old, it represents a level (of achievement), which our technology did not reach until the eighteenth century…. If the insight of the Greeks had matched their ingenuity, the industrial revolution might have begun a thousand years before Columbus. By this time (1975) we would not merely be pottering around the moon; we would have reached the nearest stars.”\n\nThe link is here\n\n* https://greekreporter.com/2022/12/17/antikythera-mechanism/\n\nBut I found it by remembering a similar quote from his autobiographical work \"[*The view from Serendip*](https://en.wikipedia.org/wiki/The_View_from_Serendip)\", Serendip being the name he lends to his adoptive Sri Lanka.\n\n------\n\n@ Is anyone here aware of any comparable technological \"outlier\"? Consider! This is a single example of technology that left no other copies, nor traces of the tools used. To build this single machine, there would be need for a design based on some mathematical procedure in some social context that should also have left traces in literature.  Then, if the machine was even worth constructing, you'd expect there to be dozens lying around in various states of disassembly. Multiple copies should also have been manufactured over centuries, not necessarily on such a small scale requiring precision workmanship. In any case, such a well-finished item as the one we see will hardly be a prototype. So its some way down a path of technical evolution.  \n\nAlso, by adding the single invention of an escapement mechanism, the Ancient Greeks would have had access to modern clocks. Even without time pieces, clockwork should have started a fashion, the the sorts of mechanisms you'd want to show off to wealthy guests, mechanical toys for upper class kids... \n\nOr are there other Antikythera mechanisms lying around but never recognized nor catalogued?",
            "Incredible fabrication accuracy for that time !  It still feels like the robotic arm from the Terminator , left behind in the wrong time and subsequently used to inspire new technology.",
            "[removed]",
            "Fascinating!  I wonder how many people were involved in creating this and how long it took from concept to an actual working mechanism?",
            "When I first heard about the antikythera mechanism, it was in some conspiracy book in the 90s that said it was alien technology that was accidentally left on earth.\n\nThis is honestly much more interesting.",
            "There’s a nice BBC doc about its discovery and reconstruction",
            "Beautiful object. I saw it at Ancient Greek museum in Athens",
            "I wonder if there's a link with the vision of Ezekiel (the Seraphim) in the Bible. If angels are not a poetic description of technology and engineering.",
            "There are similar devices opaquely described in texts.\n\nIt seems unlikely the mechanism was unique, but that they were very rare and maybe obstructively expensive, resulting in very few having been built and only this one example having survived (as far as we know thus far).\n\nEDIT: As for why you don't find pieces; metal is valuable and easily melted down for other uses. Most of our surviving 'Greek' statues are Roman copies made in marble. The Greeks used bronze but the actual statues were scavenged for materials and repurposed long ago. Marble is not very easily reused in comparison, so the Roman copies survived while the Greek originals did not.",
            "Not a mechanism exactly but look up the Baghdad battery. It has been posited it was used for electroplating"
        ]
    },
    "Archaeologists discover ancient dwellings in Samoa": {
        "title": "Archaeologists discover ancient dwellings in Samoa",
        "score": 106,
        "url": "https://www.stuff.co.nz/nz-news/350323735/archaeologists-discover-ancient-dwellings-samoa",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Is this discovery that Samoans in general developed in the same hierarchical fashion as virtually every other society, or is it the time period that makes it profound?"
        ]
    },
    "A team of researchers has now employed a range of imaging techniques and methods of chemical analysis to better understand how the earliest known rubber balls from Mesoamerica were fashioned.": {
        "title": "A team of researchers has now employed a range of imaging techniques and methods of chemical analysis to better understand how the earliest known rubber balls from Mesoamerica were fashioned.",
        "score": 104,
        "url": "https://archaeology.org/issues/july-august-2024/digs-discoveries/rubber-ball-recipe",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Free scholarly article which covers the process in much more detail https://link.springer.com/article/10.1007/s12520-023-01930-1",
            "I'd like to see an analysis of the Kramerica rubber ball for oil tankers."
        ]
    }
}