{
    "We need to talk about how people discuss controversial events, organizations, and people": {
        "title": "We need to talk about how people discuss controversial events, organizations, and people",
        "score": 1274,
        "url": "https://www.reddit.com/r/HistoryPorn/comments/f6gksv/we_need_to_talk_about_how_people_discuss/",
        "content": "#Introduction\n\nHere on r/HistoryPorn, we deal with a lot of sensitive and controversial topics such as the Holocaust and Nazism, Communism, certain wars and atrocities, and certain political figures. When these topics come up, we often see people expressing strong emotional perspectives. While totally understandable, this often leads to unproductive discussion and rule breaking behavior. Furthermore, the moderator team is often falsely accused of defending or supporting those topics or figures by enforcing the rules. Thus, we feel that it is necessary to briefly talk about the purpose of our community, and why we enforce these rules.\n\n#This subreddit’s purpose\n\nThe purpose of HistoryPorn is that people can submit photographs of historical events, and/or the people in them, and members can discuss those people, events, and the contexts surrounding them further in the comments section. We want these discussions to be substantial and constructive so that users can share their thoughts and perspectives, knowledge, and experiences regarding the topics. This sets us apart from many other communities on Reddit; rather than encouraging jokes, slapfights, and vulgar statements about certain subjects, we want to encourage substantial discussions so that people leave threads having gained something from the discussion.\n\n#The rules\n\nThis is where our comment rules come into play. The rules that apply to this post are: Don't attack other users (or those in the photographs), don't troll, don't go on political rants, and don't use overly vulgar language. For instance, in every post featuring a picture of a Nazi, there will be a variety of rule-breaking comments that we have to deal with. Such comments include ones that call for all Nazis to die, comments that consist of nothing but obscenities and vulgar statements, and comments that compare those historical figures to contemporary political figures. None of these contribute to a constructive discussion that furthers our understanding of history. We agree that Nazis are terrible but wishing them to be dead doesn't really accomplish anything; those in the pictures are long-dead, or at least not reading these Reddit threads. We should note that this is merely an example; as we said above, we see similar issues in threads about other figures and events as well.\n\nVulgar statements are simply vulgar statements that don't contribute constructively to the discussion. As well, while it is tempting to make comparisons to modern political events, because we are on the internet this often simply means that we have another internet slap fight on our hands instead of a productive discussion about the historical event in question. Given the sensitive nature of these topics, people often get confused and angry when we remove those comments and sanction those who made them. However, as we said, there are many places on Reddit where people can make those sorts of comments. At HistoryPorn, we want users to aim for a higher level of discussion.\n\n#What we’d like to see\n\nAll that being said, this does not mean you can't criticize historical events, organizations, and people. In fact, we *encourage* it. However, we want these criticisms to have substance, instead of breaking the rules just because of the subject at hand. If we allowed rule breaking comments on these controversial threads, we'd devolve into a place where high quality discussions wouldn't likely be the norm anymore. These threads would be filled with the same old \"fuck nazis/fuck communism/fuck imperialism/etc.\" in every thread. So we certainly don't want to stop discussion, we simply want discussion to be about the historical subject pictured and of good quality. It is entirely possible to discuss committed atrocities and terrible people in a historical discussion without vitriol.\n\nIf you want to criticize things, express yourself properly. Talk about the crimes that the subject committed. Talk about why those figures, organizations, or events were bad. Bring up a personal anecdote (for instance, perhaps you knew a veteran who experienced the subject first-hand, or the post reminded you of something you read). It doesn't matter what route you take, so long as you do so in a way that adds to the discussion and doesn't break the rules. People should leave your comment having gained something from reading it. Obviously we won't be deleting comments that aren't \"substantial enough\". We just want people to try and be constructive. We wouldn't pass an assignment in a history course by saying \"communism is a cancer that kills people\", even though it's \"only\" insulting Communism. We’d still be expected to explain why it was bad, when it killed people, etc. In that same vein, explain yourself here and don't use obscenities or vulgarity as a crutch for your point.\n\n#Conclusion/TL;DR\n\nWe hope that helps to explain the stance of the moderator team, and why we oftentimes remove seemingly agreeable comments. We aren't Nazis, Communists, Fascist, Imperialist, or any other kind of \"ist\". All we want to do is ensure that discussions on r/HistoryPorn remain substantial, constructive, and high quality. Profanity, calls for people to die, and other simple and vulgar comments do not add anything to the discussion, and will be removed *regardless of context*. If you want to criticize people, events, or organizations, do so in a way that adds to the discussion and gets your point across without breaking the rules.",
        "num_comments": 155,
        "comments": [
            "Those sound like good rules.  Thanks for moderating.",
            "I'm not saying civility doesn't matter - Obviously everyone should try to be, at the very least, calm and collected, but with that being said, I can't help but be a bit worried about these types of policies enforcing civility because it's so incredibly subjective.\n\nSpecifically it's the \"regardless of context\" thing that makes me kinda uncomfortable. A week ago there was a post on this subreddit showing anti-Soviet partisans in Estonia. Some commenters pointed out that these partisans were former SS-members, and it ignited a big argument in the comment section about whether or not the Waffen-SS is bad.\n\n[This is one](https://i.imgur.com/Hmj6B3m.png) of the interactions from that thread. Here we have a person talking, in a way that's pretty fair, about how one of the people in the picture was from the SS. Someone responded derisively. That was not deleted. However when the original user responded to *that* in a derisive way, then it got deleted.\n\nNow to be clear, I don't think any of it should have been deleted. There weren't any real insults thrown around. But if it was to be deleted, [why was this](https://i.imgur.com/vzSdzOC.png) considered civil and constructive, [but this](https://i.imgur.com/WEXr8tU.png) crossed the line? It feels really arbitrary.\n\nMore than anything else, I feel uncomfortable with the idea that defending members of ***the Waffen-SS*** without using insults is somehow better than criticising the Waffen-SS but saying \"stroke yourself harder\" at the end of it.\n\nIn the aforementioned thread, one guy was saying the Nazis didn't plan on committing genocide against the Baltic countries. I responded by saying that the way he was whitewashing German atrocities was disgusting. That's an insult, no? But that didn't get deleted. What [about this](https://i.imgur.com/qjJFlgK.png)? It isn't civil, but I think it's a fair response to some really dubious both-sides-ism.\n\nThis is just a few examples of this. I imagine there will be many more. Could you guys clarify it for me?\n\nSorry I rambled so much. I am just a bit concerned about these types of arbitrary lines in the sand.",
            "Coming here is always a privilege and an honor.\n\n\n\n\n\nThank you.",
            "My main concern is that I don't see how vulgarity and clear, cohesive reasoning are mutually exclusive. A person could be very well spoken, and make great points, but if they threw in some cursing to emphasize their statements, it would be against the rules?",
            "Is there a subreddit like this but without all the glamorizing of war?",
            "I do not know where to post this, so I hope the mods read it here.\n\n&#x200B;\n\nI do not think \"old\" pictures of celebrities in the mid to late 20th century should be on this sub.  These pictures are more for old school cool then history porn.  I am not sure what the historical significant of the Beatles vacationing in Greece is, or Ringo with a good looking actress.  There is movie sets, just in general Hollywood type pictures.  I am also not sure why they post them in black and white, I think many of them are available in color.\n\n&#x200B;\n\nI know they are popular.  Still I do not think they meat the spirit of the sub",
            "I think what you are trying to promote is the basic sense of having a discussion while attempting to eliminate profanity which certainly takes a reader's eye off the topic and makes him rather more aggressive and irrational in certain cases. I support the cause. \n\nThank You!",
            "Good to see these rules: it means we could discuss about submitted pictures in a civilized manner.",
            "I completely agree on these rules. \nLike everyone else I suppose, I can get caught in my anger when witnessing atrocities and behaviors. When that happens,I'm aware that I can easily lose focus and not even see it. My comments although valid to myself, lose their purpose in a discussion, which really to bad since I do enjoy joining a conversation and lending my opinion. \nSo good job on reminding me, in a constructive, calm, and fair way that even if I feel very strongly about something, that to lose my head greatly discredits my perspective and objectivity. \nI appreciate being reminded of this, especially these days with the politics as they are in the world. It's okay to feel furious and disgusted. Taking a deep breath however and deflating those emotions so that I can make a point that I see, without invalidating others, even if I disagree with them, is more important than ever. \nWell done.",
            "Why doesn't anyone ever talk about how many innocent Christians and non Christians that Stalin and his special police murderd and women that were raped at the time of ww2. The numbers were much high than that of the German army did. But not much press about it."
        ]
    },
    "Grand Central Station - New York (1941) (758x582)": {
        "title": "Grand Central Station - New York (1941) (758x582)",
        "score": 288,
        "url": "https://i.redd.it/mxpf83grzd9d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "No matter how many times I see this picture, I'm in awe of its beauty!",
            "I used to do lighting for a museum and would sometimes be asked to recreate beams of sunlight in the exhibition spaces. Besides the limitations of light sources you can fit in a building, you need particles suspended in the air. Concerts use smoke or haze, this pic could be steam or smoke from the trains, none of the above are good for your Picasso",
            "Cover on the book of Winter’s Tale, by Mark Helprin.\n\nPerfect choice. Beautiful.",
            "By the great Alfred Stieglitz",
            "I love the shadows left by moving people because of the exposure time",
            "It's 1941 so I'm guessing that people are helping to produce smoke as well."
        ]
    },
    "A group of Boer commandos in the 2nd Boer War. Seated are Jan Smuts and Manie Maritz. After the war, Smuts moved on and slowly softened his racist views. Maritz doubled-down on them, led a white supremacist uprising in 1914, and later became an ardent supporter of Nazism, 1901 [1920 x 1076].": {
        "title": "A group of Boer commandos in the 2nd Boer War. Seated are Jan Smuts and Manie Maritz. After the war, Smuts moved on and slowly softened his racist views. Maritz doubled-down on them, led a white supremacist uprising in 1914, and later became an ardent supporter of Nazism, 1901 [1920 x 1076].",
        "score": 129,
        "url": "https://i.redd.it/4c2f41bhvd9d1.png",
        "content": "",
        "num_comments": 11,
        "comments": [
            "[The article where I found the photo: A Differing Outlook](https://samilhistory.com/2023/06/01/a-differing-outlook/)\n\nThe character limit prevented me from mentioning that Manie Maritz also [massacred black people in the Second Boer War](https://en.wikipedia.org/wiki/Leliefontein_massacre), participated in the [Herero and Namaqua genocide](https://en.wikipedia.org/wiki/Herero_and_Nama_genocide) (he wasn't the only Afrikaner nationalist to do so, either; as many as 5,000 Boers were employed in Namibia during the genocide), and was so rabidly racist that, in 1939, a South African court found him guilty of promoting racial hatred. Jan Smuts was also racist, but his viewed softened with age. In 1942, Jan Smuts, who got South Africa to join the United Nations, remarked that, \"Isolation has gone and segregation has fallen on evil days, too.\" The United Party was gradually accepting that racial integration was inevitable, and perhaps it was time to start dismantling South Africa's system of segregation. This was their fatal flaw. Smuts and those like him really were changing. However, they struggled to accept that the Afrikaner nationalists would never change. They were incorrigible, and that became more obvious in the Second World War. During the war, pro-British Afrikaners, along with black, Indian, and other non-white South Africans, did all of the work (literally, South Africa did not have conscription in the war; they all volunteered). Meanwhile, the Afrikaner nationalists did everything they could to prevent South Africa's entry into the war, cheered Hitler on, and took notes. Their actions never should've been tolerated, but they sadly were, as seen with the aftermath of the [Maritz rebellion](https://en.wikipedia.org/wiki/Maritz_rebellion). They were willing to suppress an Afrikaner nationalist uprising, but not properly punish the surviving rebels afterwards.\n\n>Maritz took to farming, but came under the influence of National Socialism (Nazism) in 1936 and founded an \"anti-parliamentary\" (dictatorship led) party called the Volksparty (People’' Party) in 1940. Maritz also took control of another ultra-right, national socialist, pro-Nazi movement initially set up by Colonel J.C. Laas (the first Commandant-General of the Ossewabrandwag) called \"Die Boerenasie\" (The Boer Nation), he then merged the Volksparty with Die Boerenasie and continued under the \"Die Boerenasie\" banner. He became known as a very outspoken proponent of The Third Reich and admirer of Adolf Hitler. During this time, he had also developed a theory about the alleged Jewish conspiracy and interference in South African and world politics and became a fanatical antisemite.  \n>  \n>Maritz would detail his antisemitic and National Socialist views in his autobiography *My Lewe en Strewe* (My Life and Aspiration) which he published in 1939, a book regarded as lacking in objectivity, inciting racial hatred and like his hero Adolf Hitler's book *Mein Kampf* (My Struggle) Maritz's book was full of emotional and racially driven rhetoric.  \n>  \n>He was even taken to court over all the anti-Semitic statements he made in his book, found guilty of fomenting racial hatred and he was fined £75.\n\nFun fact about South Africa's role in World War II:\n\n>According to an apocryphal tale, Adolf Hitler broke out laughing when he heard of South Africa's declaration of war against Germany in 1939. On the face of it, the Fuhrer had good reasons for being amused: South Africa's armed forces were puny and her British connection widely unpopular among the Afrikaners, the most numerous white community in the country - a people reckoned by Nazi race specialists to be of niederdeutsch derivation, and likely to side with Germany.  \n>  \n>\"If the report is true that Hitler laughed when he heard that this young nation, small in population and possessing few great industries, had come into the war, he could not possibly have known that she was to build up a great volunteer army of one out of every three of the adult population; to create a powerful air force that was destined to drop both the first and last bombs in the African campaigns, and naval forces that were to operate in foreign waters.\"",
            "Boer history is so interesting to me, as it has elements of anti-colonialism against European countries, along side some significant colonialist, white supremacist elements.\n\nIn other words, Boer history should be seen as nuances built on nuances.",
            "White supremacist who was also a Nazi lover, well that's something you don't see everyday. /s",
            "God damn look at those outfits.",
            "[deleted]",
            "And then went on to be the oppressors. Humans be like that.",
            "No, the Boer Wars were racist and imperialist infighting. Also, most indigenous Africans supported the British since the Anglos were far less racist than the Boers. Some British politicians had advocated for forcing the Boers to accept partial enfranchisement for blacks, like in the Cape Colony. However, they deferred the question of black rights at the end of the war since they were exhausted. Alas, maybe the Anglos wouldn't have been so exhausted had [thousands upon thousands of white supremacists from all over Europe](https://en.wikipedia.org/wiki/Boer_foreign_volunteers) not volunteered to help the Boers. There was a literal holocaust happening in the Congo Free State and thousands of Europeans were instead volunteering to save an apartheid state from potentially being strangled in the crib.",
            "We have Boer Stalin on the right.",
            "As I said: nuances upon nuances (upon Apartheid)",
            "As a South African, this is the most bizarre take I've ever seen about the Anglo-Boer Wars. Racism was not the main focus of the war. It was supposed to be a white man's war although it did not turn out that way and Africans fought on both sides for many reasons but mostly for practical reasons (servitude, wages) and not political (that they feared the Boers). \n\n>There was a literal holocaust happening in the Congo Free State and thousands of Europeans were instead volunteering to save an apartheid state from potentially being strangled in the crib.\n\nApartheid only passed in 1948 after these wars concluded (1902). Before then, there was racial oppression and segregation but it wasn't Apartheid yet. The British won the Second Boer War and Apartheid was still implemented. The Boers' ideas about race definitely played into why they did not want to be ruled by the British but there were many other factors as well such as language, religion and not wanting to be overrun by immigrants (albeit ironic, was an existential threat to their people). Thousands of Boers  also died in British concentration camps. There are hundreds of ongoing conflicts in the world at any given time, it's dumb to condemn people for volunteering to fight in one war and not another war. Pretty sure, that's also not why foreigners volunteered to fight for the Boers, e.g.: there were many Irish volunteers since they hated the British for other reasons.\n\nThat said I am white South African, so take what I say with a grain of salt since I'm probably biased."
        ]
    },
    "Russian tanks on the streets of Prague in 1968. [1154 x 768].": {
        "title": "Russian tanks on the streets of Prague in 1968. [1154 x 768].",
        "score": 672,
        "url": "https://i.redd.it/3dxpja4v0b9d1.jpeg",
        "content": "",
        "num_comments": 25,
        "comments": [
            "To be fair, those are Soviet tanks",
            "Now those 1968 Soviet tanks are in Ukraine",
            "Soviet tanks",
            "I bet some of these tanks are in Ukraine right now lol",
            "There are some really cool photos of this uprising. 'Good old Communists' treating people well... /S\n\nThanks for sharing!",
            "I'm guessing the usual tankie brigade won't be showing up to this thread.\n\nEDIT: Nope, just silently downvoting.",
            "Now those very same tanks are in Ukraine",
            "Russkiy mir",
            "My grandma was running behind one of those tanks yelling at them.",
            "They are liberating Prague from Czech control"
        ]
    },
    "US Army staffers with some of the evidence of the Holocaust that they've collected for the prosecution during the Nuremberg trials, c. 1946 [1579x1200]": {
        "title": "US Army staffers with some of the evidence of the Holocaust that they've collected for the prosecution during the Nuremberg trials, c. 1946 [1579x1200]",
        "score": 349,
        "url": "https://upload.wikimedia.org/wikipedia/commons/5/52/Evidence_in_Nuremberg_trials.jpg",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Hi!  \nAs we hope you can appreciate, the Holocaust can be a fraught subject to deal with. While don't want to curtail discussion, we also remain very conscious that threads of this nature can attract the very wrong kind of responses, and it is an unfortunate truth that on reddit, outright Holocaust denial can often rear its ugly head. As such, the /r/History mods have created this brief overview. It is not intended to stifle further discussion, but simply lay out the basic, incontrovertible truths to get them out of the way.\n\n##What Was the Holocaust?\nThe Holocaust refers the genocidal deaths of 5-6 million European Jews carried out systematically by Nazi Germany as part of targeted policies of persecution and extermination during World War II. Some historians will also include the deaths of the Roma, Communists, Mentally Disabled, and other groups targeted by Nazi policies, which brings the total number of deaths to ~11 million. Debates about whether or not the Holocaust includes these deaths or not is a matter of definitions, but in no way a reflection on dispute that they occurred.\n\n##But This Guy Says Otherwise! \nUnfortunately, there is a small, but vocal, minority of persons who fall into the category of Holocaust Denial, attempting to minimize the deaths by orders of magnitude, impugn well proven facts, or even claim that the Holocaust is entirely a fabrication and never happened. Although they often self-style themselves as \"Revisionists\", they are not correctly described by the title. While revisionism is not inherently a dirty word, actual revision, to quote Michael Shermer, *\"entails refinement of detailed knowledge about events, rarely complete denial of the events themselves, and certainly not denial of the cumulation of events known as the Holocaust.\"*\n\nIt is absolutely true that were you to read a book written in 1950 or so, you would find information which any decent scholar today might reject, and that is the result of good revisionism. But these changes, which even can be quite large, such as the reassessment of deaths at Auschwitz from ~4 million to ~1 million, are done within the bounds of respected, academic study, and reflect decades of work that builds upon the work of previous scholars, and certainly does not willfully disregard documented evidence and recollections. There are still plenty of questions within Holocaust Studies that are debated by scholars, and there may still be more out there for us to discover, and revise, but when it comes to the basic facts, there is simply no valid argument against them.\n\n##So What Are the Basics?  \nBeginning with their rise to power in the 1930s, the Nazi Party, headed by Adolf Hitler, implemented a series of anti-Jewish policies within Germany, marginalizing Jews within society more and more, stripping them of their wealth, livelihoods, and their dignity. With the invasion of Poland in 1939, the number of Jews under Nazi control reached into the millions, and this number would again increase with the invasion of the Soviet Union in 1941. Shortly after the invasion of Poland, the Germans started to confine the Jewish population into squalid ghettos. After several plans on how to rid Europe of the Jews that all proved unfeasible, by the time of the invasion of the Soviet Union in 1941, ideological (Antisemitism) and pragmatic (Resources) considerations lead to mass-killings becoming the only viable option in the minds of the Nazi leadership.\nFirst only practiced in the USSR, it was influential groups such as the SS and the administration of the General Government that pushed to expand the killing operations to all of Europe and sometime at the end of 1941 met with Hitler’s approval.\n\nThe early killings were carried out foremost by the *Einsatzgruppen*, paramilitary groups organized under the aegis of the SS and tasked with carrying out the mass killings of Jews, Communists, and other 'undesirable elements' in the wake of the German military's advance. In what is often termed the 'Holocaust by Bullet', the *Einsatzgruppen*, with the assistance of the Wehrmacht, the SD, the Security Police, as well as local collaborators, would kill roughly two million persons, over half of them Jews. Most killings were carried out with mass shootings, but other methods such as gas vans - intended to spare the killers the trauma of shooting so many persons day after day - were utilized too. \n\nBy early 1942, the \"Final Solution\" to the so-called \"Jewish Question\" was essentially finalized at the Wannsee Conference under the direction of Reinhard Heydrich, where the plan to eliminate the Jewish population of Europe using a series of extermination camps set up in occupied Poland was presented and met with approval.\n\nConstruction of extermination camps had already begun the previous fall, and mass extermination, mostly as part of 'Operation Reinhard', had began operation by spring of 1942. Roughly 2 million persons, nearly all Jewish men, women, and children, were immediately gassed upon arrival at Bełżec, Sobibór, and Treblinka over the next two years, when these  \"Reinhard\" camps were closed and razed. More victims would meet their fate in additional extermination camps such as Chełmno, but most infamously at Auschwitz-Birkenau, where slightly over 1 million persons, mostly Jews, died. Under the plan set forth at Wannsee, exterminations were hardly limited to the Jews of Poland, but rather Jews from all over Europe were rounded up and sent east by rail like cattle to the slaughter. Although the victims of the Reinhard Camps were originally buried, they would later be exhumed and cremated, and cremation of the victims was normal procedure at later camps such as Auschwitz.\n\n##The Camps  \nThere were two main types of camps run by Nazi Germany, which is sometimes a source of confusion. Concentration Camps were well known means of extrajudicial control implemented by the Nazis shortly after taking power, beginning with the construction of Dachau in 1933. Political opponents of all type, not just Jews, could find themselves imprisoned in these camps during the pre-war years, and while conditions were often brutal and squalid, and numerous deaths did occur from mistreatment, they were not usually a death sentence and the population fluctuated greatly. Although Concentration Camps *were* later made part of the 'Final Solution', their purpose was not as immediate extermination centers. Some were 'way stations', and others were work camps, where Germany intended to eke out every last bit of productivity from them through what was known as \"extermination through labor\". Jews and other undesirable elements, if deemed healthy enough to work, could find themselves spared for a time and \"allowed\" to toil away like slaves until their usefulness was at an end.\n\nAlthough some Concentration Camps, such as Mauthausen, did include small gas chambers, mass gassing was not the primary purpose of the camp. Many camps, becoming extremely overcrowded, nevertheless resulted in the deaths of tens of thousands of inhabitants due to the outbreak of diseases such as typhus, or starvation, all of which the camp administrations did little to prevent. Bergen-Belsen, which was not a work camp but rather served as something of a way station for prisoners of the camp systems being moved about, is perhaps one of the most infamous of camps on this count, saw some 50,000 deaths caused by the conditions. Often located in the Reich, camps liberated by the Western forces were exclusively Concentration Camps, and many survivor testimonies come from these camps.\n\nThe Concentration Camps are contrasted with the Extermination Camps, which were purpose built for mass killing, with large gas chambers and later on, crematoria, but little or no facilities for inmates. Often they were disguised with false facades to lull the new arrivals into a false sense of security, even though rumors were of course rife for the fate that awaited the deportees. Almost all arrivals were killed upon arrival at these camps, and in many cases the number of survivors numbered in the single digits, such as at Bełżec, where only seven Jews, forced to assist in operation of the camp, were alive after the war.\n\nSeveral camps, however, were 'Hybrids' of both types, the most famous being Auschwitz, which was vast a complex of subcamps. The infamous 'selection' of prisoners, conducted by SS doctors upon arrival, meant life or death, with those deemed unsuited for labor immediately gassed and the more healthy and robust given at least temporary reprieve. The death count at Auschwitz numbered around 1 million, but it is also the source of many survivor testimonies.\n\n##How Do We Know?  \nRunning through the evidence piece by piece would take more space than we have here, but suffice to say, there is a lot of evidence, and not just the (mountains of) survivor testimony. We have testimonies and writings from many who participated, as well German documentation of the programs. [This site](http://holocaustcontroversies.blogspot.de/2012/10/index-of-published-evidence-on.html) catalogs some of the evidence we have for mass extermination as it relates to Auschwitz. Below you'll find a short list of excellent works that should help to introduce you to various aspects of Holocaust study. \n\n* [Third Reich Trilogy](https://books.google.com/books?id=HZmXOPGTGjIC) by Richard Evans\n* [Hitler, the Germans, and the Final Solution](https://books.google.com/books?id=Z7FiPwAACAAJ) by Ian Kershaw\n* [Auschwitz: A New History](https://books.google.com/books?id=bx-dZEV228QC) by Laurence Rees\n* [Ordinary Men](https://books.google.com/books?id=HFB-dkuZzSwC) by Christopher Browning\n* [Denying History](https://books.google.com/books?id=Q-0B9-D5Vz4C) by Michael Shermer and Alex Grobman\n* [The Minutes from the Wannsee Conference](http://www.holocaustresearchproject.org/holoprelude/Wannsee/wanseeminutes.html)\n* [/r/AskHistorians FAQ](/r/AskHistorians/wiki/wwii#wiki_nazi_germany)",
            "Someone knocks those stacks over in the foreground and a bunch of war criminals get off",
            "Woah cool my grandfather was in the RCAF and was injured so they put him at a desk and then he worked the Nuremberg trials.",
            "Where are the documents now?",
            "Was the Pilecki report part of it?",
            "Carefully sorting out the information on thousands of administrative personnel, scientists, and officers that they plan on employing for the next 4 decades lol",
            "Just a few pages of complaints and grievances.   \nNothing major.",
            "The [World War II War Crimes Records](https://www.archives.gov/research/captured-german-records/war-crimes-trials) are in the US National Archives.",
            "Just the important and talented ones"
        ]
    }
}