{
    "Weekly History Questions Thread.": {
        "title": "Weekly History Questions Thread.",
        "score": 14,
        "url": "https://www.reddit.com/r/history/comments/1dr9n17/weekly_history_questions_thread/",
        "content": "Welcome to our History Questions Thread!\n\nThis thread is for all those history related questions that are too simple, short or a bit too silly to warrant their own post.\n\nSo, do you have a question about history and have always been afraid to ask? Well, today is your lucky day. Ask away!\n\nOf course all our regular rules and guidelines still apply and to be just that bit extra clear:\n\nQuestions need to be historical in nature. Silly does not mean that your question should be a joke. [r/history](https://www.reddit.com/r/history/) also has an active [discord server](https://discord.com/invite/r-history-284001693044310016) where you can discuss history with other enthusiasts and experts.",
        "num_comments": 2,
        "comments": [
            "What is one misconception about the Middle Ages that  is often not talked about?"
        ]
    },
    "Bookclub and Sources Wednesday!": {
        "title": "Bookclub and Sources Wednesday!",
        "score": 16,
        "url": "https://www.reddit.com/r/history/comments/1dovtb1/bookclub_and_sources_wednesday/",
        "content": "Hi everybody,\n\nWelcome to our weekly book recommendation thread!\n\nWe have found that a lot of people come to this sub to ask for books about history or sources on certain topics. Others make posts about a book they themselves have read and want to share their thoughts about it with the rest of the sub.\n\nWe thought it would be a good idea to try and bundle these posts together a bit. One big weekly post where everybody can ask for books or (re)sources on any historic subject or timeperiod, or to share books they recently discovered or read. Giving opinions or asking about their factuality is encouraged!\n\nOf course it’s not limited to \\*just\\* books; podcasts, videos, etc. are also welcome. As a reminder, [r/history](https://www.reddit.com/r/history/) also has a recommended list of things to read, listen to or watch",
        "num_comments": 8,
        "comments": [
            "Hi everybody, \n\nI’m looking for a book about the Hungarian raids/conquest of the early 9th/10th century. It’s a fascinating time period, but I can’t find literature about this topic. Any recommendation would be highly appreciated!",
            "Took me nearly a month but I've just finished **Napoleon the Great by Andrew Roberts**. Not much to say about it beyond it being very good. It's long at just over 800 pages but covers a lot of stuff, his personal life, military campaigns and his political reforms. The military sections are very detailed. I haven't read much about the French Revolution or the  Napoleonic Wars (apart from a couple of books about Waterloo) but  I found the book to be mostly easy to follow.",
            "Thanks for sharing! Sent this over to a buddy of mine :)",
            "I'm interested in reading this. Does it read like narrative history (eg like Dan Jones if you know his style)?",
            "Funny you mention this, Dan Jones actually recommends the book! I found it quite readable myself :)",
            "Happy Wednesday everyone!\n\nJust finished Caaroline Burt and Richard Partington's \"Arise, England: Six Kings and the Making of the English State\". \n\nThe book does a fantastic job of going over the rule of  6 of England's Plantegenet king's and their role in the emergence of English statehood. I also found the writing style to be engaging and far from being dry.",
            "Supreme Commander: MacArthur's Triumph in Japan by Seymour Morris Jr is my recommendation. The book is mainly about MacArthur's rule over Japan as Supreme Commander Post World War II. Tidbits on the writing of the Japanese Constitution, the Japanese surrender on USS Missouri and the capture of war criminals are expertly woven together. It's a must read for any World War II buff. Link below.\n\n[Amazon.com: Supreme Commander: MacArthur's Triumph in Japan: 9780062287939: Morris Jr., Seymour: Books](https://www.amazon.com/Supreme-Commander-MacArthurs-Triumph-Japan/dp/0062287931)",
            "I recently reviewed *The Sleepwalkers: How Europe Went to War in 1914* and made a \"cheatsheet\" that might help anyone reading it: https://river.me/blog/sleepwalkers-notes/\n\nI thought it was really good! I'm hoping to read *The War That Ended Peace* soon"
        ]
    },
    "New study provides new evidence that the Antikythera mechanism was used to track the Greek lunar year - Anatolian Archaeology": {
        "title": "New study provides new evidence that the Antikythera mechanism was used to track the Greek lunar year - Anatolian Archaeology",
        "score": 255,
        "url": "https://anatolianarchaeology.net/new-study-provides-new-evidence-that-the-antikythera-mechanism-was-used-to-track-the-greek-lunar-year/",
        "content": "",
        "num_comments": 24,
        "comments": [
            "Incredible fabrication accuracy for that time !  It still feels like the robotic arm from the Terminator , left behind in the wrong time and subsequently used to inspire new technology.",
            "Fascinating!  I wonder how many people were involved in creating this and how long it took from concept to an actual working mechanism?",
            "When I first heard about the antikythera mechanism, it was in some conspiracy book in the 90s that said it was alien technology that was accidentally left on earth.\n\nThis is honestly much more interesting.",
            "There’s a nice BBC doc about its discovery and reconstruction",
            "Beautiful object. I saw it at Ancient Greek museum in Athens",
            "I wonder if there's a link with the vision of Ezekiel (the Seraphim) in the Bible. If angels are not a poetic description of technology and engineering.",
            "Not a mechanism exactly but look up the Baghdad battery. It has been posited it was used for electroplating",
            "I highly recommend subscribing to Clickspring on YouTube.  He's not only making a replica, he's making tools to make the replica that could have been easily manufactured at the time.  And the production quality of his videos is fantastic too.",
            "Probably just Archimedes based on previous knowledge.",
            "Yes yes the advanced alien technology of….. brass gears?"
        ]
    },
    "Archaeologists discover ancient dwellings in Samoa": {
        "title": "Archaeologists discover ancient dwellings in Samoa",
        "score": 105,
        "url": "https://www.stuff.co.nz/nz-news/350323735/archaeologists-discover-ancient-dwellings-samoa",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Is this discovery that Samoans in general developed in the same hierarchical fashion as virtually every other society, or is it the time period that makes it profound?"
        ]
    },
    "A team of researchers has now employed a range of imaging techniques and methods of chemical analysis to better understand how the earliest known rubber balls from Mesoamerica were fashioned.": {
        "title": "A team of researchers has now employed a range of imaging techniques and methods of chemical analysis to better understand how the earliest known rubber balls from Mesoamerica were fashioned.",
        "score": 106,
        "url": "https://archaeology.org/issues/july-august-2024/digs-discoveries/rubber-ball-recipe",
        "content": "",
        "num_comments": 3,
        "comments": [
            "I'd like to see an analysis of the Kramerica rubber ball for oil tankers.",
            "Free scholarly article which covers the process in much more detail https://link.springer.com/article/10.1007/s12520-023-01930-1"
        ]
    }
}