{
    "The rule of two": {
        "title": "The rule of two",
        "score": 70,
        "url": "https://i.redd.it/bce9271u0g9d1.jpeg",
        "content": "✌️",
        "num_comments": 8,
        "comments": [
            "always 2 there are, no more no less",
            "All you need now is two 2-minute penalties for each team",
            "This is just too much.",
            "I appreciate moments like these",
            "the fact its player 22 as well",
            "A master and an apprentice",
            "hockey *is* a sport of emotion...",
            "Shout-out to Johnny's Icehouse."
        ]
    },
    "Using only one foot": {
        "title": "Using only one foot",
        "score": 3,
        "url": "https://v.redd.it/1rj6ney65j9d1",
        "content": "Hi! First time poster here. So my son is about to be 5 and in his 3rd season of learn to play. He’s getting faster than what he was the first two seasons but he seems to only use one foot to push off and one to skate, he doesn’t alternate them. \n\nIs there anyway I can help him? Or is this something he just picks up eventually. He’s in tier 2 of the learn to play but right now is the smallest and slowest kid in his group. I don’t know if it’s because it’s his first time being in tier 2 or what. \n\nI’m very much about him just having fun right now which he is. Just simply asking for advice. ",
        "num_comments": 2,
        "comments": [
            "First off, its normal to want him to do better, but my advice is let him be 5! He will get better with time and confidence. Maybe tell him to take a couple slides for fun or, play some tag on the ice.",
            "Get him comfortable with his gear. Once they have some confidence that it won't hurt, they take more risk, which is when you'll see more growth.\n\nSuperman dives and barrel rolls seemed to do the trick for my kids.\n\nYou can also try doing laps with him while holding your hand and gliding with more speed. This can make them feel more comfortable with going fast."
        ]
    },
    "Shot help!": {
        "title": "Shot help!",
        "score": 18,
        "url": "https://v.redd.it/9ms5p5lzie9d1",
        "content": "Shot is slow and I cannot hit top shelf— what am I doing wrong? Thx.",
        "num_comments": 24,
        "comments": [
            "Youre leaning/falling back away from the shot, lean into it instead. See how youre largely off balance and kinda flailing once the puck leaves your stick? Thats making your shot weaker.",
            "First thing I saw was how close to your body your top hand is.  You want it to go out as you're pressing down and then crank back in a lever-like action. \n\nAlso, I think your stick may be too flexy if you can get that kinda flex without much force.",
            "Besides what everyone else is sayingyour foot needs pointed at your target. Also youve got a whole body & youre using mostly just your arms. Put that back, hips, thighs & shoulders into it!",
            "Said before, but your momentum isn't going fully forward during the weight transition. You can probably give your left hand more room away from your body to be able to pull back more as well imo.",
            "Im no pro by any means but you could benefit from loading more weight on your stick before release.  This will help trap the puck a bit under your blade on the skating surface and keep it from fluttering on release, giving you more power and control on where it ends up.",
            "Im just a 49 year old beer league player but to me it looks like your doing to much with your bottom hand.",
            "Move those hips, and flex that stick.",
            "Youre pushing the puck. It doesnt matter how strong you  are, your muscles alone are not going to get you the kind of speed and power you need to have an effective shot: you have to flex your stick. \n\nInstead of focusing on getting your weight and strength behind the puck, focus on loading the blade by using that same strength and weight to push down on the stick behind the puck. Then follow through to the target.",
            "Weight transfer is everything. Load up your back leg and transfer to the front. One motion; right to left, square up to your shot and point where you want the puck to go with your bottom hand. Good luck",
            "Do NOT comment on my socks and sandals I couldnt find my shoes lol"
        ]
    },
    "RIP In Piece  ": {
        "title": "RIP In Piece  ",
        "score": 11,
        "url": "https://i.redd.it/dsqj7v5f9f9d1.jpeg",
        "content": "Clapped its last bomb.\n\nI have not purchased a hockey stick in 10 years so I’m not familiar with all the “new” setups.\n(Last stick was a Synergy SL)\n\nI loved this Super Novium, my dad bought “game used” (didn’t even have a tape job) at the Panthers arena with a STH discount comes out to $100 so it’s a no brainer. \n\nIt’s an Ekblad curve (which I love, but no idea if there’s a similar factory option)\n\nI assume it’s midkick? \n\nDefinitely could tell it wouldn’t be very durable, so I’m open to anything similar but with a longer lifespan\n\nThanks!",
        "num_comments": 6,
        "comments": [
            "ATM Teller Machine",
            "Thank you",
            "MVP Valuable Player",
            "PIN Identification Number",
            "",
            "Google is showing ekblad similar to the P92. If it's similar to [THESE ](https://www.prostockhockey.com/player-sticks/?&search_query=player-sticks&filter=Retail_Curve_Comparison_fq:%22P92%2FP29%2FW03%2FE3%22%20OR%20Retail_Curve_Comparison_fq:%22P92%2FP29%2FW03%2FE3%2FW90%22&rows=20&start=0) then you should be gtg."
        ]
    },
    "Tips for a slow winger": {
        "title": "Tips for a slow winger",
        "score": 19,
        "url": "https://www.reddit.com/r/hockeyplayers/comments/1dqwgba/tips_for_a_slow_winger/",
        "content": "What tips do you guys have for a slower skating winger on offensive zone entries/making offensive plays on the rush? I feel like  when I have the puck I don’t have enough speed to blow past the defenders and always end up just trying to shoot it through the defenders or end up getting angled off by them along the boards and coughing up the puck. Any tips would get greatly appreciated! ",
        "num_comments": 25,
        "comments": [
            "Get deep enough to be able to throw it back to the point and head for the net",
            "As soon as you enter the zone with the puck you can stop, hold it for a second, then hit a teammate with a pass across the ice or deeper in the zone",
            "Dont be the guy entering the zone. Take the pass along the boards and pass to your centre or other winger when they are in full stride.",
            "If youre last into the zone and on the rush, hang back as the trailer. You can find a soft area and be another option the puck carrier has or be in better situation if theres a turnover.",
            "First you should drill to get faster. Practice starts and stops with explosiveness at a stick and puck or open skate. In the gym do lunges, squats, box jumps, etc. Airplanes and monster walks with a band are really great for activating your core and hips, and will translate to explosiveness almost immediately. Build those muscles with compound exercises. In the meantime, you can stop up top when you cross and then pass. Talk to your center or wingers so they know to keep moving for the pass. Bonus is theyll draw coverage when trucking across the blue line and that will open a little more space for you.",
            "Pick up speed in the dzone or neutral zone before getting the puck. Youll probably have to start your breakout closer to your dman, making his first pass easier. A good dman on the opposing team will keep a great gap tho, watchout for that.",
            "You're only feeling slow because you're only seeing your options as blow around guys or shoot. Where are your teammates? How can the boards help you? Create and see options and you'll feel much faster. If you do this and work on your skating, then you're looking at being a much better player",
            "Pucks in deep. If the defense pinches you off along the boards or closes the gap in open ice, don't just cough it up to them. Look for an open teammate or dump the puck to the opposite corner so your linemates can hopefully retrieve it.",
            "Get good at tipping and park your ass at the top of the crease.",
            "Take some strides or some skating lessons."
        ]
    }
}