{
    "Weekly Questions Thread Jun 25": {
        "title": "Weekly Questions Thread Jun 25",
        "score": 2,
        "url": "https://www.reddit.com/r/hoggit/comments/1dnsdx5/weekly_questions_thread_jun_25/",
        "content": "# Greetings Hoggit!\n\nWelcome to this week's Question thread. This thread has replaced the regular Tuesday Noob Questions thread. We encourage you to as all your questions here, as this will help us cut down on the number of repetitive posts we get on the front page! This thread is linked with the #questions channel on our [Discord](http://discord.gg/hoggit) so that any time someone posts a new comment in here, it will be reviewed and replied to quickly! If you felt like you had a question but didn't want to bother people with it, now's your chance.\n\nAs always, we also have a discord for hoggit over at [http://discord.gg/hoggit](http://discord.gg/hoggit) which you can use for chatting with other members of the hoggit community. And don't forget to check out our wiki at [http://wiki.hoggitworld.com](http://wiki.hoggitworld.com/)\n\nHoggit Training Server runs a training MP mission that runs 24/7 that's focuses on training up the newer folks (just like this weekly thread). Every DCS module is available in this mission, and there are numerous ranges to test your skills at. There are frequently knowledgeable folks around to answer any questions you might have, or show you how to do what it is you're looking to learn. Anyone can join, even if you've never stepped foot in a MP session before.\n\n^(If you're interested in teaching/instructing at hoggit, please poke squinkys on Discord!)\n\nServer is be named `Hoggit - Training Map`. The password is `hoggit1fw`. SRS will be available at `tnn.hoggitworld.com` (it should autoconnect, but if not, use that). Come in, have a good time, learn a few things and teach a few things.\n\nThe only rule is Do not teamkill, unless the other party is a willing combatant...ie: you can dogfight if you find a partner...just don't shoot down some random A-10 trying to learn how to land.\n\n**Please review our FAQ on our wiki before posting here:** [**https://wiki.hoggitworld.com/view/Frequently\\_Asked\\_Questions**](https://wiki.hoggitworld.com/view/Frequently_Asked_Questions)",
        "num_comments": 31,
        "comments": [
            "F-16:\n\nIs it possible to slew TGP and/or create a markpoint to a SAM radar that the HTS has found via HAD page ?",
            "Has anyone here had any success using the Oculus Quest 1 with DCS? I was able to find a tutorial on it but even following all the steps DCS doesn't want to boot into VR mode. Is the original Quest just not compatible with it?",
            "If I purchased the FC3 pack on steam forever ago, and did the transfer, am I eligible for the discounted FC2024 update? Or do I just need to suck it up and buy the pack again? (This would be so that I get the discount on any future FC updates down the road)",
            "is dcs still worth investing money into at this time, or should I look elsewhere for simulating modern aircraft?",
            "Newbie here, would like to start playing on multiplayer maps once I learn some planes from FC3. Which map is the best to buy?",
            "I'd love to try Grayflag but I don't really know where to start, I read the .pdf but it was kinda intimidating with the amount of information. Anyone got any tips for a beginner?",
            "You can make the target the SPI, slew the TGP to the SPI, then drop a TGP markpoint. \n\nBut making that radar SPI gives you steerpoint functionality on your HSI and targeting for your weapons, so the question is more \"what problem are you trying to solve?\"",
            "How old is the tutorial? If it predates DCS switching to native OpenXR it may be out of date.",
            "You should be eligible, yes. \n\nI'm basing off the fact I had BS2 via steam before I transferred and I was eligible for BS3 upgrade on standalone. I would assume the same will apply to FC24.",
            "Yes, just avoid the RAZBAM modules due to ongoing issues. The Heatblur stuff is particularly excellent."
        ]
    },
    "PSA: Please Read Before Purchasing Razbam Modules": {
        "title": "PSA: Please Read Before Purchasing Razbam Modules",
        "score": 550,
        "url": "https://www.reddit.com/r/hoggit/comments/1dab8dx/psa_please_read_before_purchasing_razbam_modules/",
        "content": "06/18 edit:  [ED has confirmed that](https://forum.dcs.world/topic/351813-edrazbam-situation-info-discussion/), despite the fact that they know the F-15E module is broken (at this moment it's radar does not work), they still intend to sell this broken module on their storefront:\n\n>June 12th at Midnight the F-15E radar stopped working. While we have internally identified the issue no fix has been presented as of yet. once we have solid news on that we will share that ASAP. Again this had nothing to do with core compatibility but rather something in the coding of the F-15E. \n\n>*How can you keep selling the F-15E or other modules?*\n>Right now we are working within the framework of the legal advice moving forward and not wanting to cause any more riffs or issues. It's a complex process at this point and most likely why it seems to be moving so slowly for everyone. Nothing more can be said about that right now. Sorry. \n\nGiven that ED has no qualms about selling you a broken product *that they do not know if they can fix*, at this point we're strongly recommending that users avoid purchasing products from the ED store.\n\n--------------------------\n\nGoooood morning r/hoggit!\n\nFor those that are not yet aware of the ongoing rift between Eagle Dynamics and Razbam, we intend to leave this post up and stickied until the conflict is resolved and the status of future support for the F-15E, M-2000C, Harrier, and MiG-19 are no longer in question. If you are out-of-the-loop:\n\n* RB has publicly accused ED of withholding payment from module sales from ED's webstore, and as a result the 3rd party has ceased all ongoing development for DCS.\n* ED confirmed that they have been witholding payments from RB over an ongoing IP violation dispute.\n* RB has stated the ED's accusation of IP violation is nonsense, and ED has stopped commenting on the situation altogether.\n\nThanks to this, the futures of the F-15E, M-2000C, Harrier, and MiG-19 are all up-in-the-air. Different members of the RB team have stated that ED does not have the source code for any of their modules, which was corroborated by NineLine when he stated in the ED Discord that they are unable to support any RB modules in the long term...meaning if ED/RB can't find a way around this impasse, the F-15E, M-2000C, Harrier, and MiG-19 all go the way of the VEAO Hawk.\n\nDespite the uncertain future of all of these modules, ED continues selling them on their store, compared to Razbam, who disabled the ability to purchase the modules from their own storefront. At this time, we strongly recommend that community members exercise caution when considering the purchase of these modules. There is a real possibility that they will remain unsupported until their eventual removal from the DCS: World platform, just like the Hawk.\n\nWe encourage ED to provide the DCS community with an update to this situation. We also encourage them to remove these products from their storefront until the situation is resolved...it's *really* not a good look to be selling a product that is currently unsupported. And lastly, u/NineLine_ED, u/BIGNEWY, u/NSSGrey, u/dotrugirl...please feel free to stop by and let us know if any point raised here is incorrect in any way. We would love some clarity on this situation.\n\nTo the community, we encourage you to use this post as a megathread to discuss the situation, but we will not be squashing other discussions that occur outside of this thread as the situation continues to develop.",
        "num_comments": 223,
        "comments": [
            "It's all fun and games until the Harrier is part of this.",
            "I picked the wrong day to look for alternative games to Star Citizen, because I didn't like the drama ",
            "I dont know the details of the dispute, but I do know that selling shit thats not being updated because of a dispute with YOUR COMPANY is very inappropriate.",
            "This is a reminder that personal attacks or harrassment are not tolerated against anyone, ED or otherwise.\n\nSince this is an ongoing legal dispute it's likely that the parties involved have been instructed to not comment publicly, and that's fine. This post is intending to bring visibility into the ongoing issue so that customers can make informed decisions about what they are buying.",
            "Ill be the first to admit that I have no idea what the reality is to the accusations throw around about both ED and Razbam. Ill also say I am often very critical of ED and how they run their business, as a quick browse through my post history would show. Having said that: I can almost promise you that any reputable legal counsel would be advising ED to not comment publicly in any way regarding the situation, and would also likely advise them not to remove Razbam modules from their store, as for all we know, this might put ED in breach of whatever agreement they have with Razbam, an agreement that is probably the source of the ongoing dispute to begin with.",
            "I'm not sure I *deserve* a refund for my Harrier and M2000 etc, as some folk are demanding, I would, however, take a free module in their place if abandoned as a good will gesture. Just putting that out there.",
            "Any word or talk about refunds? I mean, Harrier and M2000 I've already got my hundreds of hours of fun out of, but I bought the Strike Eagle right before all this started and have used it for maybe 20 minutes",
            "Whatever IP infringement and if RB where to blame for breaking the agreements between them - does ED not understand that they are killing their own product by this prolonged semi public fist fight? So some module was sold to a South American air force (?) without ED getting their cut, and they withhold all payments for a year for a product that they keep in their store on the top location... More people buying it and they keep the payments for those sales, knowing that the buyers might end up with a non usable product as they do not own the source code...",
            "Unfortunate situation but valid concerns.  I really hope that in the future a viable commercial competitor to DCS emerges.",
            "Everyone loses in this. Sucks."
        ]
    },
    "Took the Hornet for a spin (Screenshots)": {
        "title": "Took the Hornet for a spin (Screenshots)",
        "score": 16,
        "url": "https://www.reddit.com/r/hoggit/comments/1dr8827/took_the_hornet_for_a_spin_screenshots/",
        "content": "Decided to pick up the Hornet (glad i did) two days ago, since it was gathering dust since release. Me and my buddy Belphe decided to go for some sight seeing on the Persian Gulf map. It ended up with me practicing formation flying, and i managed to pull off a formation landing. Since my buddy used to be a dedicated Hornet driver in DCS, he gave me a hand. And we got some eyecandy we decided to share. Hope you like it.\n\nhttps://preview.redd.it/jyxm67w5nh9d1.png?width=5120&format=png&auto=webp&s=1af5b19d8d9cbb2ce66fead863beb966b1769ff4\n\nhttps://preview.redd.it/i97xz5w5nh9d1.png?width=5120&format=png&auto=webp&s=0af1fadd3674722b050153a7650037d5f532a585\n\nhttps://preview.redd.it/80yifgx5nh9d1.png?width=5120&format=png&auto=webp&s=134060d219edf8ebb493e33b05204384d10f5334\n\nhttps://preview.redd.it/x9nq79w5nh9d1.png?width=5120&format=png&auto=webp&s=e7169229732b33a2992438a714e2888d28132384\n\nhttps://preview.redd.it/euppvex5nh9d1.png?width=5120&format=png&auto=webp&s=d95e12bd5641fcab472f7b43d0dc9f816425253b\n\nhttps://preview.redd.it/xi2f56w5nh9d1.png?width=5120&format=png&auto=webp&s=363a9b9e9194f5866f042f7f27a1fda1d0d1ef14",
        "num_comments": 3,
        "comments": [
            "Nothing excites me more than spamming 10 AMRAAMs  at one enemy or deleting 8 ground enemies with JDAMs.\n\nThat and carrier actions are pretty cool too.",
            "What map is this?",
            "PG"
        ]
    },
    "Deimos Grumman A-6 Intruder - First Look Review! - MSFS.": {
        "title": "Deimos Grumman A-6 Intruder - First Look Review! - MSFS.",
        "score": 10,
        "url": "https://youtu.be/wlEoVvTRIWM?si=ZPJYcg2RosESWx6N",
        "content": "Need this in DCS.",
        "num_comments": 7,
        "comments": [
            "My eyes saw in the title the Intruder first and MSFS last. What a heart attack.",
            "\"You see, Intruders are my thing.\"",
            "I don't have MSFS but from this video i really can understand why people criticize ground handling. It really likes to be handling something weighting only a few lbs/kgs",
            "Yeah I got really excited until I saw msfs lol",
            "Heatblur be like hmmmm"
        ]
    },
    "A map I didn't think I would do, but here we are! ANNOUNCING Grayflag Caucasus Coming Soon!!!! Testing Starting This Weekend!!!": {
        "title": "A map I didn't think I would do, but here we are! ANNOUNCING Grayflag Caucasus Coming Soon!!!! Testing Starting This Weekend!!!",
        "score": 111,
        "url": "https://www.reddit.com/r/hoggit/comments/1dquqfj/a_map_i_didnt_think_i_would_do_but_here_we_are/",
        "content": "https://preview.redd.it/4wotbge3rd9d1.jpg?width=3617&format=pjpg&auto=webp&s=c632010e617144301ba928c3c3df427e3d131404\n\nFind out more at our discord here :)  \n  \n[https://discord.gg/deathfromabove](https://discord.gg/deathfromabove)\n\nFirst will be a modern version and will eventually be an 80's version.\n\nThanks!",
        "num_comments": 22,
        "comments": [
            "Hell yeah! A Grayflag in Caucasus is what I've been looking forward to one day!\n\nAlso, any idea if OH-6A Loach mod is on your guys' radar at all? I can understand if it's not worth the extra effort",
            "The more Grayflag the better!",
            "omg yes! I havent gotten Syria yet (pc wont like it) so I have been waiting to try Grayflag after all the good things Ive heard!",
            "u just made my week bro ",
            "Looks nice. Though i would love to have seen a 60's version of your campains. That would be so nice.",
            "Will you be including the original geography in the map, or will it be the post-invasion version without Crimea?",
            "As soon as the official herc is out, the A4 will come",
            "Crimea isn't modelled in dcs",
            "That isn't DCS though? Currently Crimea is not moddled in DCS.",
            "Yes, however, you worded the first part as a question. Just trying to help out."
        ]
    }
}