{
    "Pretended to be a plush toy": {
        "title": "Pretended to be a plush toy",
        "score": 1968,
        "url": "https://v.redd.it/pfdb7glk3h9d1",
        "content": "",
        "num_comments": 29,
        "comments": [
            "The way the cat was looking at the end as if he couldn't even believe his trick worked lol",
            "Oh, that poor cat has seen some crazy shit. XD",
            "You can feel the sigh of relief from the cat as danger passes by.",
            "\"Their perception is based on movement, hold on tight\"",
            "\"Dang he almost saw me\"",
            "he is so cute, he can't believe that he did it.",
            "It didn't even move its eyes until the danger had passed.",
            "Cats are MUCH smarter than we give them credit for\n\n![gif](giphy|mrTjb8ZXFeJdC|downsized)",
            "The toys in Toy Story when Andy enters the room.",
            " \"I fear no man. But that thing, it scares me.\""
        ]
    },
    "Entering the shower": {
        "title": "Entering the shower",
        "score": 4093,
        "url": "https://v.redd.it/ibk3iyonre9d1",
        "content": "",
        "num_comments": 86,
        "comments": [
            "\"I don't want a bath\"\n\n\"I don't want to get out of the bath\"",
            "What an excellent baby!\n\nMine would have been leaping the walls and chewing off my arm.",
            "“You’re not going to do this to me right?” (Fives mins later) “K get my good side though.”",
            " Ah, the daily ritual of cleansing the body in a waterfall of warm water.",
            "Btw, cats don't need shower.",
            "Why do you shower him",
            "Bot account, downvoted and reported!",
            "That cat looks clean before it went into the shower.  Hopefully they're not overdoing it for clicks.",
            "Wjy do people do this? Cats don't meed showers. (Especially not with shampoo)",
            "Why are you showering him and the throat grab just before the shower shows just how stupid your are. I can't believe the a-holes like you that post this stuff."
        ]
    },
    "The cats were offered something tasty, but they made the right choice": {
        "title": "The cats were offered something tasty, but they made the right choice",
        "score": 5633,
        "url": "https://v.redd.it/y235hjkpud9d1",
        "content": "",
        "num_comments": 84,
        "comments": [
            "I feel like I'm intruding here",
            "I... I don't really know how to react to this, they're just going at it full french style",
            "Dude, you  got a little bit on your chin, let me help \n\nSaid both cats",
            "I feel like they've both had a bit and now they're both licking the residue off each other.",
            "I... think I shouldn't have seen this private moment between them.",
            "Dude, where's the NSFW tag??",
            "Dang catnip, turning the fucking cats gay",
            "yo these cats gay af happy pride month",
            "the cat got more romance than me (never).",
            "Rights in front of my salad"
        ]
    },
    "Evil biscuits": {
        "title": "Evil biscuits",
        "score": 2287,
        "url": "https://v.redd.it/r1dhaybf3f9d1",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Oh my. That’s actually truly scary, like a horror movie featuring a possessed cat.",
            " Evil biscuits? Sounds like a deliciously diabolical snack! Just make sure they don't plot against you while you're enjoying them.",
            "Making biscuits while plotting to take over the world 😂",
            "Didn't realize how cat was sitting 'till other cat moved.",
            "Don't watch this video or you will die in 3 days!!!",
            "I can't tell what it is kneeding. Is it its own butt or a blanket or another cat?",
            "Kitty has the Norman Bates look :)",
            "Invader Zim shit right there",
            "Those are self kneading biscuits",
            "When you are asleep I will be making those biscuits"
        ]
    },
    "kitty invites a new friend over": {
        "title": "kitty invites a new friend over",
        "score": 4567,
        "url": "https://v.redd.it/xmv6663g4d9d1",
        "content": "",
        "num_comments": 64,
        "comments": [
            "Those little hops omg 😻",
            "A fox is cat software running on dog hardware, of course that kitten made a new friend.",
            "Adorable. But watch out for Momma fox she will eat your kitty in one bite.",
            "The Fox and the Hound, except it's a kitten. So cute!",
            "I love crabs that go “boing,” bouncing with all four feet at once! You’ve got a good “boing” crabber! 🦀",
            "It’s all well and good when they are babies. But this isn’t a Disney movie. Foxes hunt cats. I would never let my cat around a fox and think they are friends bc then they won’t fear them outside in the wild. Foxes eat and kill cats.",
            "Very cute.  LOVE the bouncing crabwalk.  But....Bit.....    Be careful,  kitty!  \n\nOP, beware of new friend's older family members who may think kitty is a snack.",
            "I sure hope whomever originally filmed this knew that was a fox.",
            "Foxy Foxy on the run",
            "Well since here  in the UK they’re still being hunted for fun that fox is now mine hehe! One less fox being chased to death\n\nSeriously though that’s adorable!"
        ]
    }
}