{
    "They found us, act normal": {
        "title": "They found us, act normal",
        "score": 1079,
        "url": "https://v.redd.it/24qd07n3a38d1",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Congrats! You finally found the hidden gem!",
            "https://preview.redd.it/e4erubvk748d1.jpeg?width=354&format=pjpg&auto=webp&s=f4f24cf9bafe40aef621fae36082bc60726d3c26",
            "The one on the left with the eye was having issues acting normal.",
            "Awww poor babies!",
            "Oh dear. Was Mama kitty in there too?",
            "How cute and lovely",
            "They are in the walls! THEY ARE IN THE GODDAMN WALLS!!!",
            "I've never been luck enough to stumble upon a treasure trove such as this. I guess i am cursed.   :(",
            "r/councilofcats",
            " cat in the wall, eh? now your talkin my language.."
        ]
    },
    "Leave the vehicle": {
        "title": "Leave the vehicle",
        "score": 920,
        "url": "https://v.redd.it/edjipupq038d1",
        "content": "",
        "num_comments": 19,
        "comments": [
            "The audacity.",
            "https://i.redd.it/cxa04wscc38d1.gif",
            " Oh, you want me to leave the vehicle?",
            "The captain goes down with the ship",
            "Cat:  What the heck was that?!?!??!",
            "This is my cat! 😂 An the look in the end… How outrageous!",
            "The look of *betrayal*",
            "The cat's reaction is priceless. Just another day with a feline friend.",
            "By now, these things should have pet friendly versions with build in cushions. There would be a market for that.",
            "My favorite part is the little bed jiggle from the camera person laughing."
        ]
    },
    "Hold my catnip while I steal this dudes heart. ": {
        "title": "Hold my catnip while I steal this dudes heart. ",
        "score": 6561,
        "url": "https://v.redd.it/66jnmwj7zz7d1",
        "content": "",
        "num_comments": 65,
        "comments": [
            "~~I always try and link the original accounts, but I can’t find it.~~\n\n[living_with_nala](https://www.instagram.com/living_with_nala/) can be found on IG\n\nThank you to u/Balc0ra for finding!",
            "That cat loves their human. I bet that guys play better when his cat is around.",
            "As annoying as it can get\n\n\nWhen they’re gone you will cry for one more moment enjoy every moment while you can. \n\n\n\n\nI miss you every day little mans.",
            "r/PetTheDamnCat",
            "The floof!",
            "If he wasn't a cat person before, he is now.",
            "Nothing on the earth loves this man as much as this cat.",
            "My cat likes lap time when I'm playing Dark Souls 3. There is no pause.\n\nHe's gotten me killed many times.",
            "If you lose a match, don't blame the cat. You can blame the control. Blame the router. Blame anything else but do not blame your forever fan!  It's obvious he/she's your biggest fan!",
            "how cuuuuute"
        ]
    },
    "Unique Cat": {
        "title": "Unique Cat",
        "score": 1011,
        "url": "https://v.redd.it/rpsnse0hp18d1",
        "content": "",
        "num_comments": 29,
        "comments": [
            "Poor cat",
            "This is so sad wtf 😭😭",
            "Maybe if she helped and stopped recording instead of giving useless orders the cat would have been more able to help",
            "Poor fucking cat. If it was scared enough of the dog to do this, paired with the people in the video acting upset with the cat, man fuck these people. \n\nProbably have an aggressive ass dog and are obviously real concerned for the cats well being. *Get out get out*. It’s stuck and scared you fucking morons",
            "So, they think it's funny to scare the cat and record it.",
            "Those windows are designed to be opened out to the side, not just up and down. You can see the gray clips that would push in the bottom on the outside pane. These people are dumb and making it worse",
            "I would bet that they either forced the dog into the room with the cat instead of letting the cat decide when to engage or the dog is a bad match in that house and they don’t respect the cat enough to accept that. Or best case scenario the cat is a certified orange and panicked",
            "Damn did the cat get out?",
            "Just pop the screen/storm window out of the frame instead of trying to slide it up or down.",
            "Assholes"
        ]
    },
    "At any random time": {
        "title": "At any random time",
        "score": 147,
        "url": "https://v.redd.it/jjb2ddkm548d1",
        "content": "",
        "num_comments": 8,
        "comments": [
            "we need to downvoted this type of post and report it for animal abuse.",
            "Stop fucking using animals for views.",
            "i need to know how the cat even got up there",
            " I like to break out into spontaneous dance parties! It keeps life interesting, you know?",
            "This cat would like to be a ceiling fan",
            " I might be eating a sandwich, watching cat videos, or contemplating the mysteries of the universe.",
            "already done that",
            "Im sure that idiot filming it throw cat on the ceiling fan for views. I hate those idiots."
        ]
    }
}