{
    "#holoJustice DAY 1: Elizabeth Rose Bloodflame & Gigi Murin": {
        "title": "#holoJustice DAY 1: Elizabeth Rose Bloodflame & Gigi Murin",
        "score": 2039,
        "url": "https://www.reddit.com/r/Hololive/comments/1dlj28x/holojustice_day_1_elizabeth_rose_bloodflame_gigi/",
        "content": "Elizabeth: [https://www.youtube.com/watch?v=NdlSHUEVCj8](https://www.youtube.com/watch?v=NdlSHUEVCj8)\n\nGigi: [https://www.youtube.com/watch?v=15aufXwBIKw](https://www.youtube.com/watch?v=15aufXwBIKw)\n\n\\#hololiveEnglish #holoJustice",
        "num_comments": 1384,
        "comments": [
            "You know Biboo has unleashed something catastrophic onto the world when a new gen debuts with \"sticking out your gyatt for Nerizzler.\"",
            "For the non-brits, that waiting screen is a parody of the old BBC out-of-service screen from back in the days when TV wasn't 24-hours.",
            "......I think I just saw a grown woman fail to tie her own shoelaces.",
            "The moment Elizabeth & Nerissa do a duet performance at HoloFes will be the day the roof literally blows off the building",
            "well, based on these debuts, i don't think advent is getting caught anytime soon",
            "Elizabeth took too long and had to get ushered off, GiGi is so fast she's speedrunning her debut - perfectly balanced debuts, no notes",
            "Grown woman fails to put on shoes, fails math, and is repeatedly turned into roadkill by chat",
            "Lol, that smash cut ending into the cover redirect was somehow incredibly scuffed but felt incredibly deliberate. Like even when she does something wrong, her commanding aura makes it seem right.",
            "Definitely one of the most unique debut streams in a while. I loved the fact we got to choose Gigis story via poll. I picked the bad options bc I wanted a girlfailure, turns out I didnt even need to intervene because RNG screwed her over.",
            "An ojou laugh, for free?In this market?"
        ]
    },
    "#holoJustice DAY 2: Cecilia Immergreen & Raora Panthera": {
        "title": "#holoJustice DAY 2: Cecilia Immergreen & Raora Panthera",
        "score": 2190,
        "url": "https://www.reddit.com/r/Hololive/comments/1dm9s8m/holojustice_day_2_cecilia_immergreen_raora/",
        "content": "Cecelia: [https://www.youtube.com/watch?v=p\\_ZQs-kgUKI](https://www.youtube.com/watch?v=p_ZQs-kgUKI)\n\nRaora: [https://www.youtube.com/watch?v=JW7j8tKMOfY](https://www.youtube.com/watch?v=JW7j8tKMOfY)\n\n&#x200B;\n\n\\#hololiveEnglish #holoJustice\n\nhttps://preview.redd.it/z6risj0yp08d1.jpg?width=4096&format=pjpg&auto=webp&s=33d5810d4f51b86747252f2e51086329f8bd33de\n\nhttps://preview.redd.it/chq2168yp08d1.jpg?width=1200&format=pjpg&auto=webp&s=7c5057333f3d1c92a2ea4f01ed9d5b3e176cbbe2",
        "num_comments": 1467,
        "comments": [
            "Green women playing Skyrim, gotta be one of my favorite genders.",
            "Fuwamoco: EXTREME VIOLENCE\n\nCece: EXTREME VIOLINS",
            "Shes died twice already in her debut lmao",
            "So Cecelia can speak 4 languages, play 3 instruments, code, compose, sing, animate????\n\nLike holy crap. Truly a renaissance woman.",
            "HER GREETING IS CIAORA\n\nABSOLUTE PERFECTION",
            "Soo.... TIL I have a thing for her accent. Welp.",
            "We have a German who drinks tea and a Brit who does not. No idea how to feel here.",
            "Green woman following her fellow green woman footsteps by playing Skyrim and Eurotruck simulator.\n\nI'm excited for her Violin karaoke!",
            "I have never gaslit anyone in my life\n\nThats gonna be a solid X, there, Cecilia",
            "The chat flip gimmick is fantastic."
        ]
    },
    "Image that you can hear ": {
        "title": "Image that you can hear ",
        "score": 3155,
        "url": "https://i.redd.it/0ojjv8opsf9d1.jpeg",
        "content": "",
        "num_comments": 124,
        "comments": [
            "Uhhh, umm... \n\nLOOK OVER THERE!",
            "Where's the poll results I wanna see.",
            "She's not sexy, she's Mococo",
            "It was least sexy Hololive member and Biboo won!\n\nShe received her prize as Red Supa during her stream.",
            "There is a difference between being sexy and being kawai or cute and Fuwamoco are cute, if we were to say who is sexy it would be moona, choco, kiara.",
            "Mococo is sexier than even Luna-tan.",
            "I'm pretty sure I've heard \"what about Mococoae\" more times than days since they debuted",
            "Gura in the top 3 lmao coward votes",
            "All I can say is that, I'm happy that Bijou won. Sexy or not, she is the best and the cutest, always ",
            "I expected Miko place in this XD"
        ]
    },
    "The unsung Hero of Hololive": {
        "title": "The unsung Hero of Hololive",
        "score": 1310,
        "url": "https://i.redd.it/bywvfe4s0h9d1.jpeg",
        "content": "The girl who started everything, to realize her bestfriend's dream, the backbone of Hololive. \n\nThank you for everything, A-chan.\n\n\n\n\n\nCredit to Jun Wei from Danbooru",
        "num_comments": 17,
        "comments": [
            "The artist goes by   \njunwei611 on Twitter  \nJune on Pixiv",
            "I wouldn't go as far as calling her \"unsung\" though, she's pretty famous.",
            "Just one thing, friend: Danbooru is an archive/translation site, you're not even allowed to post your own stuff in there\n\nThe actual source page is linked on the left under the tags",
            "Now I want A-chan on Holocure...",
            "Please don't treat danbooru as a primary source for art. It's a useful secondary resource but take the time to find the artist's actual account and source it there.",
            "This is a really nice picture. Can't wait for her last hologra tommorow o7",
            "i will miss her, but hololive is in good hands.",
            "Crediting to Danbooru is as effective as crediting to Rule34.",
            "Made Sora able to achieve her dream by becoming an idol. The path that they took is incredibly challenging to say the least, Sora wasn't able to become an idol in the traditional sense because she's physically fragile, so they decided to try the virtual route, in which A chan handled the IT and background work, which was a pretty challenging task because it was a newly made market with very limited information regarding that market.\n\nAt the beginning, Yagoo's company wasn't an idol company that we know now, it was a new tech app company. Somehow these two highschooler managed to convince Yagoo to venture into a new business in a market that's also newly discovered so it was a big gamble for all of them.",
            "I don't know why you are getting downvoted, that's a reasonable question to ask for a new person in the community. A-Chan, together with Tokino Sora, where two people who approached Yagoo and suggested to create Hololive. So it is reasonable to say that she is one of the creators of Hololive."
        ]
    },
    "Due to A-chan leaving the company, her model in Hololy will also be removed at the end of the month. So, I supposed it was best to do this last shoot.": {
        "title": "Due to A-chan leaving the company, her model in Hololy will also be removed at the end of the month. So, I supposed it was best to do this last shoot.",
        "score": 881,
        "url": "https://i.redd.it/9vuqhd4z9g9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "ahh, wouldn't it be nice to be able to keep the model for prosperity's sake?",
            "I have her Koikatsu card. So I don't worry about it.",
            "A bit off-topic but what's Hololy?",
            "Ah I almost forgot about that.\n\nGuess its time to buckle down and port her model to COM3D2",
            "So why do they take down amicably left talents why not just leave something like this up and just dont update it in the future.",
            "The word you're looking for is \"posterity's sake\".",
            "Official Hololive photo app. You can also take pictures of some talents' models in AR. The app can be downloaded for free.",
            "Quite the way for the hololy model of Yuujin A(A-Chan) to go out.\n\n**\"(SHOT) Dooooooownnnn In A Blaze Of Gloryyyyyyyy!\" **\n\n*#ThankYouYuujinA(A-Chan)*  (#WeAcknowledgeYou)",
            "Dang it",
            "Of course"
        ]
    }
}