{
    "#holoJustice DAY 1: Elizabeth Rose Bloodflame & Gigi Murin": {
        "title": "#holoJustice DAY 1: Elizabeth Rose Bloodflame & Gigi Murin",
        "score": 1501,
        "url": "https://www.reddit.com/r/Hololive/comments/1dlj28x/holojustice_day_1_elizabeth_rose_bloodflame_gigi/",
        "content": "Elizabeth: [https://www.youtube.com/watch?v=NdlSHUEVCj8](https://www.youtube.com/watch?v=NdlSHUEVCj8)\n\nGigi: [https://www.youtube.com/watch?v=15aufXwBIKw](https://www.youtube.com/watch?v=15aufXwBIKw)\n\n\\#hololiveEnglish #holoJustice",
        "num_comments": 1346,
        "comments": [
            "You know Biboo has unleashed something catastrophic onto the world when a new gen debuts with \"sticking out your gyatt for Nerizzler.\"",
            "......I think I just saw a grown woman fail to tie her own shoelaces.",
            "For the non-brits, that waiting screen is a parody of the old BBC out-of-service screen from back in the days when TV wasn't 24-hours.",
            "The moment Elizabeth & Nerissa do a duet performance at HoloFes will be the day the roof literally blows off the building",
            "Elizabeth took too long and had to get ushered off, GiGi is so fast she's speedrunning her debut - perfectly balanced debuts, no notes",
            "well, based on these debuts, i don't think advent is getting caught anytime soon",
            "Grown woman fails to put on shoes, fails math, and is repeatedly turned into roadkill by chat",
            "Nerissa: I'll have to marry Elizabeth. Sorry Shiori we have to divorce.\n\nShiori: We were married??\n\nLmao.",
            "Lol, that smash cut ending into the cover redirect was somehow incredibly scuffed but felt incredibly deliberate. Like even when she does something wrong, her commanding aura makes it seem right.",
            "Definitely one of the most unique debut streams in a while. I loved the fact we got to choose Gigi’s story via poll. I picked the “bad options” bc I wanted a girlfailure, turns out I didn’t even need to intervene because RNG screwed her over."
        ]
    },
    "TakaMori's strongest soldier": {
        "title": "TakaMori's strongest soldier",
        "score": 4751,
        "url": "https://i.redd.it/m3vi25jxq18d1.jpeg",
        "content": "",
        "num_comments": 82,
        "comments": [
            "That was so wild LOL",
            "With her impressions, she's like Miss HoloEN.  lol.",
            "I seriously wonder if she's going to cause some chaos in collabs at some point or another.",
            "She has great range and control of her voice. Really lends itself very well to voice acting and doing impressions of the other members",
            "Wait, it was dubbed by her?!",
            "Plot Twist: She was that one concert goer who made the Calli and Kiara dolls kiss.",
            "It's 2024. \n\nDad had a facelift and is cuter than ever. \n\nMom is going to zumba classes and watching national football. \n\nThey've been separate parents raising their child for two years. \n\nTakamori is so back.",
            "best part it was just randomly done in the middle of her singing then she continued the song as if nothing happened",
            "It was perfect that Calli could [react live](https://x.com/Remy0049/status/1804365934293061787?t=apH8rxRNM5XusQCHb4o2Ww&s=19) lol",
            "Absolutely based"
        ]
    },
    "THIS WOMAN STOLE MY HEART ALREADY": {
        "title": "THIS WOMAN STOLE MY HEART ALREADY",
        "score": 3771,
        "url": "https://i.redd.it/zk6ejyuji18d1.png",
        "content": "",
        "num_comments": 133,
        "comments": [
            "She doesn't seem nervous in the slightest. Must be that stiff upper lip.",
            "HOLD IT TOGETHER WE STILL HAVE THREE MORE",
            "SHE OPENED THIS UP WITH DADDY DADDY DO LMFAO WHAT AM I SUPPOSED TO DO",
            "The SWIG O W'TER. She's PERFECT 🥹",
            "She's got the rich girl laugh",
            "She's so comfy and talented.\n\nIf she's already this relaxed and comfy on debut, I can't wait to see how she'll be in a couple months once she gets fully settled in and used to the Company.",
            "the calli and kiara impersonation was so fucking good even better that calli was watching it live as well",
            "She's so PON, she's amazing",
            "The amount of talent this woman showed just in the debut is incredible, Cover can't stop finding stars every gen.\n\nI can't wait for a cover duet with Nerissa.",
            "She do be singing"
        ]
    },
    "A british person not liking tea? That's blasphemy! ": {
        "title": "A british person not liking tea? That's blasphemy! ",
        "score": 3049,
        "url": "https://i.redd.it/xy3qi47gn18d1.jpeg",
        "content": "",
        "num_comments": 136,
        "comments": [
            "She didn't get the extra dlc that comes with the British expansion",
            "She's a brit that skipped some section of the tech tree",
            "She had me at hot cocoa",
            "She will be exiled to Baeland for that.",
            "\"No, Mr. President, I don't think even this blew her Cover. Her infiltration was successful. God bless America.\"",
            "Guys, guys this is just another trick implemented by her royal majesty to throw us off the trail of finding out she didn’t actually die in 2022",
            "Tea is nothing more than hot leaf juice!",
            "British drink alcohol instead of tea. It is a well-established fact.",
            "She was the chosen one…",
            "As fellow Brit who hates tea, me happy :)"
        ]
    },
    "Do do we call it holoEurope now?": {
        "title": "Do do we call it holoEurope now?",
        "score": 444,
        "url": "https://i.redd.it/zm8lfpjkl38d1.png",
        "content": "",
        "num_comments": 56,
        "comments": [
            "Kobo: holo my what?!",
            "holobrexit 🗣🗣🗣",
            "last i check, uk has not lifted itself out of the continent of europe",
            "EU refers not just to the European Union, but also Europe itself, so that doesn't change anything.",
            "We're still in Europe, EU is a continent as well as an abbreviation for the European Union. We haven't magically moved to the middle of the ocean despite some people wishing we had. This is important as it means Kiara and Elizabeth can both apply for Eurovision!",
            "Hey UK when will you cancel that Brexit thing? We'd like to have you back.",
            "I live in Russia, so everytime I want to feel included I say that I'm with Europe. It kinda works.",
            "Untill i see her shedule i dont believe it, unfortunatly.",
            "holoEMEA",
            "Their is still a chance than Cecillia is German right ?"
        ]
    }
}