{
    "This sub sucks. Want to mod it?": {
        "title": "This sub sucks. Want to mod it?",
        "score": 1203,
        "url": "https://www.reddit.com/r/HolUp/comments/1c3iw8r/this_sub_sucks_want_to_mod_it/",
        "content": "Hello inbreds. \n\nAs some of you may have noticed, our community sucks ass right now. Very few posts are on topic. Instead we have rage bait, some dudes podcast, shitty memes and  photos of random trans people. \n\nMany of you leave comments along the lines of \"what's the holup?\" and \"this sub used to be good.\" We feel the same. This subreddit has been kicked from mod to mod for a long time and many have tried and failed to bring it back to what it once was. Which brings us to today: we no longer have enough mods and need a hand moderating. \n\nIf you're interested in ~~cleaning up our mess~~ helping out, here's our [mod app](https://forms.gle/kYDj63fye45uYZbf7) and no, it's not paid.",
        "num_comments": 175,
        "comments": [
            "Wait. This sub had mods?",
            "If only I’m allowed to ban myself for no reason",
            "Can't, finally getting adopted on tuesday",
            "I applied because I love slave labor.",
            "I would venmo you a 20 for boob pic",
            "I’m down to help out, but I won’t do more than remove posts that don’t fit the sub. That cool?",
            "Ok I’m done where’s my paycheck?",
            "Why would anyone want to become a mod?? its the most thankless job ever and you have to do it for FREE!!  lol   I think i'd be happier being a ..............  ( looks for the most hated job in America )......... a teacher",
            "Mad respect for acknowledging this",
            "If I got paid to mod, then I could give you $20. \n\nI applied. Am from Kentucky, am inbred."
        ]
    },
    "You played this game before?": {
        "title": "You played this game before?",
        "score": 1509,
        "url": "https://v.redd.it/x8yxhco1yf9d1",
        "content": "",
        "num_comments": 43,
        "comments": [
            "My workmate did this on me a few weeks ago, I fell for it",
            "The version I heard was the guy had to guess the different types of fruit getting shoved up his arse.",
            "A guy tried this on me at work last week, I said \"bog brush.\" He said \" ah! you supposed to say plunger.\" Another guy who must've got him with it said \"Lee you idiot it don't matter what he says, you just have to say - have you played before, he don't know the right or wrong answer\"\n\nLee looked so confused, guy says \"that's why we call you LeeTard",
            "A real holup and funny too. Well done OP",
            "Even now I know it was coming, it still was hilarious",
            "I think I don't get it cuz as far as I understand the joke, it's not that funny",
            "Guess I am a bit slow, can someone elaborate ?",
            "That made me laugh out loud.",
            "I actually grinned. Good stuff, I needed that",
            "Funny as hell. Good one OP!"
        ]
    },
    "Good news!": {
        "title": "Good news!",
        "score": 738,
        "url": "https://i.redd.it/vzqwimak0h9d1.jpeg",
        "content": "",
        "num_comments": 66,
        "comments": [
            "Just don't eat the brain or spinal tissue. Creutzfeldt-Jakob disease can be passed if you eat those parts of an infected human.",
            "Clearly this was written by Wendigo's",
            "Any animal that eats meat is a parasite risk which is why most people typically stick to herbivores. But yeah most of the “health risk” from cannibalism is just social conditioning",
            "Just stay away from clowns, those guys taste funny.",
            "World hunger and overpopulation? All-in-one solution",
            "Why was OP googling this?",
            "Cannibalism would solve both, world hunger... AND overpopulation... Change my mind.",
            "Only the taste is a bit different",
            "It also reduces global warming",
            "Bro, Whatever AI used to generate this was probably trained off Reddit. I would trust that"
        ]
    },
    "It just came out of nowhere.": {
        "title": "It just came out of nowhere.",
        "score": 9378,
        "url": "https://v.redd.it/934ss4esid9d1",
        "content": "",
        "num_comments": 506,
        "comments": [
            "What’s the purpose of giving the horse blue balls?",
            "Oh sure, he's a gentleman. But when I strut around with a raging boner I'm a \"dirty, disgusting, sick, pervert\" and am no longer allowed at The Container Store.",
            "Why is his leg broken? Oh....",
            "This horse is not welcomed at Fenton’s Stables and Horse Ranch.",
            "Look at my horse, my horse is amazing",
            "It was like a fire hose that just kept unrolling! Damn horse may have been holding back some for all we know!",
            "It's only because she's dressed up like those other whores... I mean horses...",
            "Does your horse hang low, does it wobble to and fro…",
            "Sometime my sister, she show her vazhïn to my brother Bilo and say \"You will never get this you will never get it la la la la la la.\" He behind his cage. He cries, he cries and everybody laughs. She goes \"You never get this.\" But one time he break cage and he \"get this\" and then we all laugh. High five!",
            "Wang dang doodle, that things bigger than my poodle"
        ]
    },
    "\"The Option\" if Joe phases out": {
        "title": "\"The Option\" if Joe phases out",
        "score": 1244,
        "url": "https://v.redd.it/csqzu9wgzf9d1",
        "content": "",
        "num_comments": 255,
        "comments": [
            "I'm convinced the whitehouse still has lead pipes in its plumbing.",
            "When your presentation was 2 minutes long but required to be at least 5",
            "Maybe I’m too high but I just watched this twice and have no clue what she’s trying to convey.      Textbook word salad.",
            "When the teacher calls you to the front to present your project you completely forgot about.",
            "I‘m not American so a question to you guys over there: Does she even do anything?\n\nSince the last election I never heard of her or saw her again in any news. Seems like she got the office and disappeared.",
            "If you have to repeat yourself you think people are dumb \n\nLet me repeat this",
            "I'm left wing. The last two people I wanted last election were Biden and Kamala.\n\nNow I have an older Biden and Kamala.",
            "Speaks about the passage of time then why you be talking like your stuck in a loop",
            "Will you shut up man.",
            "Never thought that the passage of time was that crazy"
        ]
    }
}