{
    "This sub sucks. Want to mod it?": {
        "title": "This sub sucks. Want to mod it?",
        "score": 1195,
        "url": "https://www.reddit.com/r/HolUp/comments/1c3iw8r/this_sub_sucks_want_to_mod_it/",
        "content": "Hello inbreds. \n\nAs some of you may have noticed, our community sucks ass right now. Very few posts are on topic. Instead we have rage bait, some dudes podcast, shitty memes and  photos of random trans people. \n\nMany of you leave comments along the lines of \"what's the holup?\" and \"this sub used to be good.\" We feel the same. This subreddit has been kicked from mod to mod for a long time and many have tried and failed to bring it back to what it once was. Which brings us to today: we no longer have enough mods and need a hand moderating. \n\nIf you're interested in ~~cleaning up our mess~~ helping out, here's our [mod app](https://forms.gle/kYDj63fye45uYZbf7) and no, it's not paid.",
        "num_comments": 174,
        "comments": [
            "What's the hold up?",
            "Wait. This sub had mods?",
            "Would love to help but I'm just too busy banging my head against the wall and burning myself with hot pokers.",
            "If only I’m allowed to ban myself for no reason",
            "Can't, finally getting adopted on tuesday",
            "I applied because I love slave labor.",
            "I would venmo you a 20 for boob pic",
            "I’m down to help out, but I won’t do more than remove posts that don’t fit the sub. That cool?",
            "Fuck it why not",
            "Ok I’m done where’s my paycheck?"
        ]
    },
    "What dude did to himself for views": {
        "title": "What dude did to himself for views",
        "score": 5188,
        "url": "https://v.redd.it/mlaz5ia0i28d1",
        "content": "",
        "num_comments": 448,
        "comments": [
            "OP sent the following text as an explanation on why this is a holup moment:\n\n---\n\n>!He gained an unhealthy amount of weight very quickly just to get views!<\n\n---\n\nIs this a holup moment? Then upvote this comment, otherwise downvote it.",
            "Different girl, same dude",
            "This is sad as fuck",
            "Wasn't there a time not too far back when he gave up the binge eating videos and was working on getting back in shape? Did that go away?",
            "Social media is a plague on those who can't withstand its influence",
            "Why do people watch this?",
            "This is a black mirror episode if I ever seen one",
            "Keep watching this channel to see a morbidly obese  narcissist have a heart attack with his girlfriend.",
            "My Dessert. My Dune. My Arrakis.",
            "Why on Earth would you....?? 😞"
        ]
    },
    "Anal Marriage": {
        "title": "Anal Marriage",
        "score": 3581,
        "url": "https://v.redd.it/9agk59w9n28d1",
        "content": "",
        "num_comments": 44,
        "comments": [
            "OP sent the following text as an explanation on why this is a holup moment:\n\n---\n\n>!It looks like the Gaurds are checking his colon hor items as ordered. But it was an engagement ring planted in him by anotger gaurd.!<\n\n---\n\nIs this a holup moment? Then upvote this comment, otherwise downvote it.",
            "What the fuck",
            "This will be a heartwarming story at their 25th anniversary",
            "Anal delivery service",
            "Shit hit the fan with this.",
            "THIS IS AN AD!?",
            "Usually I got to buy jewellery to get this treatment",
            "I knew it once she told him about his boyfriend",
            "The drip.",
            "Felt like I have seen another version of this. Wonder which one comes first"
        ]
    },
    "Paracord, a versatile product popular with survivalists and beyond": {
        "title": "Paracord, a versatile product popular with survivalists and beyond",
        "score": 1156,
        "url": "https://i.redd.it/i68b0z8me28d1.jpeg",
        "content": "",
        "num_comments": 23,
        "comments": [
            "OP sent the following text as an explanation on why this is a holup moment:\n\n---\n\n>!Scantily clad attractive young women are especially dangerous and need to be tied before they steal your food and water.!<\n\n---\n\nIs this a holup moment? Then upvote this comment, otherwise downvote it.",
            "yes those ropes are popular for shibari because the fine quality of the fiber is softer on skin than coarse rope",
            "We gonna ignore the rope grenade?",
            "Practise safe sex: tie your partner to the bed, so they don't fall off.",
            "I, too, am enthusiastic about shibari.",
            "I also like to knot corpses like that.",
            "hemp rope is better for shibari, you will have to treat it well, but the knots and formations have better friction so it wouldn’t change over the use give weight and stretch, while the pracord can change dimensions while under stress, like pull…",
            "Holup you sound like you know your ropes.",
            "Except it’s hemp rope that’s being used not paracord. It looks quite coarse.",
            "Apparently."
        ]
    },
    "This is electrifying ": {
        "title": "This is electrifying ",
        "score": 1189,
        "url": "https://i.redd.it/g5xtv8hw228d1.png",
        "content": "",
        "num_comments": 13,
        "comments": [
            "OP sent the following text as an explanation on why this is a holup moment:\n\n---\n\n>!A man's son was eating electrical cords and a person suggested that they \"ground him\"!<\n\n---\n\nIs this a holup moment? Then upvote this comment, otherwise downvote it.",
            "First of all - TOTALLY NOT A HOLUP \n\nSecond of all - Absolute banger punny comment",
            "More like r/dadjokes",
            "No hol up.",
            "That's shocking",
            "im guessing his child is an electric guitar",
            "I have a feeling he already is",
            "That guy must have at least 10 kids to come up with that comment",
            "Exactly, file this under r/funny.",
            "Holup!!! [Indian Man Consumes 39 Coins, 37 Magnets in Belief of Zinc’s Bodybuilding Benefits.](https://knovhov.com/man-consumes-39-coins-37-magnets-in-belief-of-zincs-benefits/)"
        ]
    }
}