{
    "Home Assistant Forums & Chat": {
        "title": "Home Assistant Forums & Chat",
        "score": 164,
        "url": "https://www.reddit.com/r/homeassistant/comments/4iokdi/home_assistant_forums_chat/",
        "content": "All discussion related to Home Assistant and related Home Automation is welcome in this subreddit. If you find you aren't getting help required, please feel free to try the [Forums](https://community.home-assistant.io/) or [Discord Chat](https://discord.gg/home-assistant).",
        "num_comments": 27,
        "comments": [
            "Hey, just wanted to mention I love the new look - so much more suited for HA!  Nice work!",
            "Hey I'm new here and just starting to dive into smart led lights and light bulbs...\n\nProbably a stupid question but  are smart lights  only going to work on the app they recommend?\n\nIs there a better app to few to choose from rather than using generic (my first 2 bulbs are Jinvoo) one the product recommends.\n\nIf I want to build \"scenes\" (I think that's what they are called according to my all) where would be a good place to start. Would love to have green/red combo for xmas, but not sure if I can teach myself by then\n\nThanks for any and all suggestions, going to go browse the sub now and try not to be jealous lol",
            "I have been using Home Assistant for about 8 years, off and on. I was attracted to it initially since it was the only HA system that didn't use Java. I'm a Python veteran and have been using Linux since Redhat version 1.\n\nI am becoming increasingly frustrated with Home Assistant since the developers have decided that Docker is the only way to implement additions. I really hate Docker for several reasons, but mostly because so much of it is tied to \"magic\" and the Docker cloud. One of the major selling points of Home Assistant is the independence provided since you don't need any \"cloud\" providers to get the job done.\n\nI currently use Proxmox on a rather large server and have little need for SBCs to run things like HA. With a substantial UPS, my system can weather several hours of failed commercial power. I find it much easier to just spin up a Proxmox container than to fiddle around with a Docker container. \n\nI realize that most HA users are not Linux experts and that the \"plug-and-play\" installation on an RPI or other SBC is attractive, but for those of us who really like to tinker, that is not much fun. \n\nBeing a dinosaur is such a challenge.",
            "no IRC?",
            "Hey u/Frenck_nl (I am only really tagging you as I have seen you active here a bit in the past) is it possible to take at look at github pull for gotify notifications? [https://github.com/home-assistant/core/pull/53050](https://github.com/home-assistant/core/pull/53050)\n\nIts been basically ready for a while now and pings to the reviewers has done nothing to assist in getting this merged.\n\nBeing on a degoogled platform I am unable to use FCM and i would like to have notifications back working. Gotify is fairly useful in that regard for other self hosted apps/services so wouldn't mind this being included",
            "Finally bit the bullet and started setting HA up, working through the docs to get various things integrated.\n\nI have noticed some odd behaviour, with HA running some.of my hue lights appear to be changing to white.\n\nI have no automation or anything running yet, just hue integrated.\n\nI turned the HA VM off and this has stopped happening.\n\nHas anyone encountered this before?",
            "Does anybody know of a good Bluetooth adapter I can use with home assistant so I can discover switchbot devices.  I have home assistant installed on an Intel nuc via the official nuc installer",
            "Anybody else having issues with ios app needing to be closed and restarted before it works again after not using it for a while?",
            "I started with home assistant new and try to implement and Tuya switch for a door. But I can only integrate the switch for the door to send the signals or the sensor to get the current status.\nI don't know how I can integrate both functionalities with local tuya.",
            "[deleted]"
        ]
    },
    "Roadmap 2024 Midyear Update: A home-approved smart home, peace of mind, and more!": {
        "title": "Roadmap 2024 Midyear Update: A home-approved smart home, peace of mind, and more!",
        "score": 195,
        "url": "https://www.home-assistant.io/blog/2024/06/12/roadmap-2024h1",
        "content": "",
        "num_comments": 77,
        "comments": [
            "> There are already some good hardware choices to start using voice, but we’re exploring building our voice satellite hardware to create a more plug-and-play experience.\n\nNow thats what is needed to actually get people to convert to Assist. I love being a power user and using Rpis, but man I wish I could just buy something (even if its more expensive) to replace the ease of google home, and have it in stock.\n\nGet the hardware down, add timers and the ability for assist devices to play music on spotify (or wherever) and I am switching no question.",
            "Just chiming in to say that I'm always so impressed with the HA team's ability to consistently deliver, innovate and improve the \"product\". I have not seen a project that goes \"we are going to do x\" and then easily, measurably, consistently does so.  \nI religiously check for the latest version and am always excited by what's new. Thank you for making such a brilliant and open-standard product!",
            "It’s been a few months since I last played with it, but when it comes to Assist I found it struggled with my households New Zealand accent and at the time, I couldn’t find anything to make that better. Things like asking it to “turn off the hall light” was interpreted as “turn off the whole light”. \n\nIn regards to point on security, I hope that means they’re interested in adding support for IdM’s like Entra so external logins can be protected by conditional access policies",
            "definitely want to +1 for the dashboards to have definable permissions for users and guests. I'd really like visitors to my home to have a landing page when they connect to the wifi that tells them how to adjust stuff in their room and see temperatures and things. It should be a customized dashboard that I've made just for guests and they shouldn't be able to get to anything else. Also, this would be even more important for people have short-term rentals like airbnb homes - when a guest comes into the home and connects to wifi, they could be shown a customized dashboard with all the things they need, including the checkout instructions, and not be able to get to anything else in home assistant. And lastly, I think it would be very useful to give kids a dashboard for their controls without them having the ability to get to anything else other than what is on their dashboard. Just some basic permissions settings on dashboard pages would allow for all of these use cases and people could get really creative with them. Thanks HA!",
            "This was announced during [State of the Open Home](https://www.youtube.com/live/oa__fLArsFk?si=kVLznuIvuXN5l7zA&t=7649) on 4/20, with some small update since! For those who want to read more about it, the text summary is now available. 🙂",
            "A good dashboard feature could be a out of stock Room card, simple and neat… nice to see and to understand, where it shows and let you use all the suff of that room.\n\nSomething like this, but much better 😂 easy to create and configure\n\nhttps://preview.redd.it/sk01qszur76d1.jpeg?width=1179&format=pjpg&auto=webp&s=3aed02dcb8c9e0d06bec06c37855531585c82cd4",
            "Any hope for a full user friendly version? There's a dumpster out there now that I don't want to learn it a second time. I set up a dashboard a few years ago and I don't want to go through it again. ",
            "It would be great to have a strategy built into automations for validation. As you start to scale up, it becomes difficult to know when a device failed to update within an automation, unless you experience it firsthand.",
            "That's not really much of a roadmap, is it",
            "For me this is total irrelevance, I need better things like **global variables that will work on trigger conditions and actions and variables that don't have local scope** so we can create better automation's but ya I understand flashy things like AI, Assistants and Dashboard drag and drop can be flashy for the beginners eye and attract more ppl."
        ]
    },
    "Just want to share how HA is helping our old dog. ": {
        "title": "Just want to share how HA is helping our old dog. ",
        "score": 94,
        "url": "https://i.redd.it/gyzg5sgad18d1.png",
        "content": "So we have a middle aged/older dog who is having some liver problems and lots of accidents lately. I recently set up a cheap camera pointed at the front door rug (Danger zone), BlueIris uses CodeProject.ai to detect a dog, sends an MQTT alert, NodeRed gets the alert and plays \"Dog at the door, please let her out!\" On our homewide Google nest speakers. In two days it's helped us out at least five times. Still needs some tweaking, but this would not be possible without HA at it's core. Happy Friday all!  ",
        "num_comments": 16,
        "comments": [
            "Awesome! All you need now is an automated doggie door that opens when it detects them instead of broadcasting over the google speakers.",
            "That's awesome. We have an automated fan in the dogs' room, but this clearly above this.",
            "Very cool. I have a mat outside to let us know when the dogs are ready to come back in. The wife and I both work from home and we dont have to stand there and wait for them. We can just go back to our offices and we will get notified when the dogs are at the back door. Works well when Im in the gym. Whatever rooms are occupied will get the message.\n\n[https://youtube.com/shorts/jjYvMmKQtyw?si=\\_YUjZLNO4S5baOZ\\_](https://youtube.com/shorts/jjYvMmKQtyw?si=_YUjZLNO4S5baOZ_)",
            "We have a dog with incontinence issues. Would love to be able to detect when she is having a pee inside. Anyone know if this is possible with Frigate or something similar?",
            "What camera did you use?",
            "We have a cat we don't want getting out, otherwise an old fashioned doggie door might have been the ticket. AI isn't quite good enough for 100% reliable dog vs cat.",
            "I have an automated fan in the bedroom, has made waking up so much easier. (If bedroom warm, turn off fan 1 minute before wakeup. If cold, 3 minutes before wakeup. If {wife is not working nights} turn on the lights to morning mode).",
            "Thanks, one of our cats will bang on the door to be let in, the other just stares at the door sadly and hopes someone notices. #1 could absolutely learn to use a doorbell, but #2 is as dumb as a bag of rocks.",
            "How did you get the mat to sense their presence? Like a weight sensor or something?",
            "It's a 14 dollar TP-Link Tapo camera, I recently got one to test out as a baby cam. So far I'm reasonably happy with them, and no back to back server/security issues like Wyze has with it's cheap cameras. For anything security related though I would at least do Amcrest and something with a proper webui."
        ]
    },
    "HA COMPONENT KIT - New Update 4.0.0": {
        "title": "HA COMPONENT KIT - New Update 4.0.0",
        "score": 20,
        "url": "https://www.reddit.com/r/homeassistant/comments/1dlsuy4/ha_component_kit_new_update_400/",
        "content": "# HA COMPONENT KIT - New Update & New Dashboard\n\nA MASSIVE new update to the component kit was just released, a few minor breaking changes, nothing too dramatic, but lots of cool new features!\n\n**Links:**\n\nDiscord: [https://discord.com/invite/cGgbmppKJZ](https://discord.com/invite/cGgbmppKJZ)  \nRepository: [https://github.com/shannonhochkins/ha-component-kit](https://github.com/shannonhochkins/ha-component-kit)  \nDocumentation: [https://shannonhochkins.github.io/ha-component-kit](https://shannonhochkins.github.io/ha-component-kit) (documentation website not responsive, see [demo](https://shannonhochkins.github.io/ha-component-kit/iframe.html?id=introduction-demo--default&viewMode=story))  \n@hakit/core - [https://www.npmjs.com/package/@hakit/core](https://www.npmjs.com/package/@hakit/core)  \n@hakit/components - [https://www.npmjs.com/package/@hakit/components](https://www.npmjs.com/package/@hakit/components)\n\n# [4.0.0](https://github.com/shannonhochkins/ha-component-kit/pull/149)\n\n# hakit/components\n\n* [AlarmCard](https://shannonhochkins.github.io/ha-component-kit/?path=/docs/components-cards-alarmcard--docs) - Alarm entities now fully supported, down to keypad control and more\n* [All Cards ](https://shannonhochkins.github.io/ha-component-kit/?path=/docs/components-cards-climatecard--docs)- now have the ability to display related entities and featured entities which behave similar to home assistants new features option\n* Overhaul on the styles and responsiveness\n* [MULTILINGAL](https://shannonhochkins.github.io/ha-component-kit/?path=/docs/hooks-uselocales--docs) - the entire code base, core and components are now supported in all languages that home assistant supports and by default will render in your preferred language of choice from the config\n\n# hakit/core\n\n* NEW [useDevice](https://shannonhochkins.github.io/ha-component-kit/?path=/docs/hooks-usedevice--docs) hook - a hook to retrieve the device information, this is different from useEntity\n* NEW [localize](https://shannonhochkins.github.io/ha-component-kit/?path=/docs/hooks-uselocales--docs), useLocale, useLocales - hooks to help you with language optimisation - fully typed so you know what's available\n* [HassConnect](https://shannonhochkins.github.io/ha-component-kit/?path=/docs/components-hassconnect--docs) - you can now login via a token as well as redirecting to the HA login screen\n\nMuch has changed in this release, see the notes below\n\n# [Github Release](https://github.com/shannonhochkins/ha-component-kit/pull/149)\n\nhttps://preview.redd.it/e7oasvb0u38d1.png?width=668&format=png&auto=webp&s=8837d76b9ccf16191a6067571bae507c679fa7e6\n\nhttps://preview.redd.it/rztx05f0u38d1.png?width=404&format=png&auto=webp&s=4d9f43dc48c41b84bca175c1c1b899f4dbfa802d\n\nhttps://preview.redd.it/gwk0c0c0u38d1.png?width=419&format=png&auto=webp&s=7d954b828748ae748553bd219a5b04cf3a804315\n\nhttps://preview.redd.it/pc6v7xb0u38d1.png?width=1025&format=png&auto=webp&s=e2c4e4291e5027c17909c85b12b33ad475dc50a0\n\nhttps://preview.redd.it/haqgjwb0u38d1.png?width=1022&format=png&auto=webp&s=91fe075ff9d5bffd52b70ccc8222a858a56010d8\n\n  \n",
        "num_comments": 0,
        "comments": []
    },
    "Am I really the only one using Homeassistant with X10?": {
        "title": "Am I really the only one using Homeassistant with X10?",
        "score": 117,
        "url": "https://www.reddit.com/r/homeassistant/comments/1dlayfs/am_i_really_the_only_one_using_homeassistant_with/",
        "content": "I was looking at the integrations page for Homeassistant \nhttps://www.home-assistant.io/integrations/x10/\nAnd notice it says x10 has only on active installation.   I happen to be using it in Homeassistant, but really?  I'm the only one?  Or is that inaccurate?",
        "num_comments": 85,
        "comments": [
            "Amazing you can post here from your typewriter",
            "I thought I was king shit of fuck mountain in 1998 when I got my first X10 kit and set it up so that a lava lamp, disco ball, and record player with a Barry White LP would all get turned on when you opened the door. The only person who ever triggered it was my mom.\n\nThank you, X10.",
            "I started this home automation journey in the early 90s with X10. I have one remaining X10 device ... a light switch.  It will stay in play until it stops working.",
            "Well 1 install that has analytics enabled. So it's probably more than 1, but still a very small install base",
            "Let me fix this.\n\nAm I really the only one using ~~Homeassistant with~~ X10?\n\nYes, yes you are.\n\nKidding aside Im proud of you for not letting that get turned into e-waste. What are you doing with it. I haven't seen x10 since my dad bought some of it from RadioShack in  the 90's. \n\nGood times!",
            "I’m using X10! I use this add on:  https://github.com/dbrand666/docker-heyu-mqtt\n\nI still have about 15 devices that are from the early 2000’s.  Prior to Home Assistant, I used Domoticz.\n\nI use zigbee (2 networks), zwave, 433mhz (RFXcom), X10 (firecracker), and wifi.  Of all the technology’s I’m using, I like my 433mhz devices the most because they are so cheap, battery life is amazing, the range is extremely long. They don’t report state so I use zigbee where that matters on things such as windows that never get opened so I know the battery life.\n\nEdit: the link points to the docker version because the add-on is no longer maintained but I’m using the old add-on version.",
            "X10 is a very old home automation technology. I imagine most of us that once used it moved on to other technologies that allow state broadcasting and polling.",
            "So my Capstone project -- like our final design project -- for my engineering degree in 2003 was a cool system we developed for a dynamic shading windshield that had sensors to check for glare and shaded accordingly. With a full working prototype where you could shine a flashlight on the screen and it would shade accordingly based on an array of photoresistors. Even 20 years later I'm proud of the work we did on that project\n\nWe lost the prize (they awarded a prize to the best project in addition to, you know, your degree) to a team that made a \"smart house\" by hooking up a bunch of X10 devices to a doll house. \n\nI will never see X10 and not think of that.",
            "From analytics.home-assistant.io\n\n>  279,126 of 346,187 (80.63%) installations have chosen to share their used integrations.\n\nYou might be the only one using X10 with analytics on, otherwise there's no way to tell.",
            "Wow. What a blast from the past. I started my journey with X10 in 2010 (late, I know) and actually won a naming contest for their remote control web app - \"ActivePhone\". Got some free software and hardware for doing occasional blog posts too.\n\nNaturally, I don't have any of it anymore..."
        ]
    }
}