{
    "Home Networking FAQs": {
        "title": "Home Networking FAQs",
        "score": 85,
        "url": "https://www.reddit.com/r/HomeNetworking/comments/162gl9g/home_networking_faqs/",
        "content": "Here’s a list of common questions posted that usually have the same solution.\n\n**“Why won’t my Ethernet cable plug into the weird looking Ethernet jack?” or “Why is this Ethernet jack so skinny?”**\n-UTP cable used for Ethernet transmission is usually terminated with an RJ45 connector. This is an 8 conductor plug in the RJ series of connectors. You’ll find similar looking jacks which are used to plug in a landline phone. These jacks could be an RJ11, RJ14, or RJ25 which are 4 or 6 wire jacks. This will not work with your RJ45 cable for Ethernet. \n\nRefer to these sources to identify the type of jack you have.\n\nhttps://www.digikey.com/en/articles/understanding-and-specifying-modular-connectors\n\nhttps://www.diffen.com/difference/RJ11_vs_RJ45\n\n**“Is this Ethernet?” or “can I convert this to Ethernet” or “what category cable do I need”**\n-Fortunately many homes built in the 21st century use cat 5e cable and use 2 or 3 of the twisted pairs for phone use. (This is where you’d see the 4 or 6 pin RJ connectors). However not every build used 8 conductor so if you have less than 8 conductors and 4 twisted pairs. You will need to look into other methods of getting your lan from A to B. \n\nAs far as choosing the type of cable you need, look into cat 5e, cat 6, or cat 6a. Building your home network you most likely don’t need cat 7 or 8. If you don’t know the exact reason you need cat 7 or 8 you don’t need them because these standard typically aren’t used to access the internet.\n\nInformation for reference for UTP cabling \n\nhttps://stl.tech/blog/what-is-a-utp-cable/#Different_Categories_of_UTP_cable\n\n**I bought this flat cat 8 cable from Amazon but I’m only getting 50 Mbps**\n\n-Sorry but it’s become a common issue of Chinese companies putting out cable that don’t meet its category’s specs. Try to return it and go to your local store that sells computer stuff and get one there. On top of that cat 7 and 8 patch cable will not do you any good you will not get any benefit even if you are paying for the best internet available.\n\n**Helpful resources:**\n\n[Terminating cables](https://www.truecable.com/blogs/cable-academy/how-to-terminate-an-unshielded-pass-through-rj45-connector)\n\n[Understanding internet speeds](https://www.comparitech.com/internet-providers/internet-and-broadband-terms-explained/)\n\n[Home network structure examples](https://lazyadmin.nl/home-network/home-network-diagram/)\n\n[Wired connection alternatives to UTP Ethernet](https://www.techreviewer.com/tech-answers/moca-vs-powerline/)\n\n[Understanding WiFi](https://www.duckware.com/tech/wifi-in-the-us.html)\n\n\nIf anyone has other FAQs to add I can add that to the post.",
        "num_comments": 22,
        "comments": [
            "Can we get something added to the text that warns people authoring posts? A warning along the lines of:\n\n> **POWERLINE ADAPTER NOT PERFORMING TO EXPECTATIONS?** Power line adapters work for some people, but they are generally considered to be the least reliable way of extending your home network, and their performance is frequently subpar. See [link any of a million powerline threads here]",
            "also people think fiber is lighting proof... it is not, never has been. if its a direct strike.",
            "hi. im unable to set my hg8245h5 into wireless bridge. need help",
            "I am using the GT-AXE11000 router with Merlin. It seems good. However, sometimes I am away from home and every three weeks randomly the internet would stop working and I would need someone to manually go to my home to unplug my cat5 cable or power cycle my cable modem. Is this normal or should I replace my cat5 cable? Also, should I use cat5 or cat6 cable with this configuration? I need 100% reliability and downtime like this won't allow me to remotely connect",
            "This is great, thank you.",
            "Excellent work Austin. Answered lots of my queries!",
            "Hello I just bought from ebay a fritz 7590 router. Ive never bought a used router.. any recommandation about what to do before installang it?",
            "Is double nat a big deal? I have a fibre modem that’s a gateway, and a larger mesh network behind it.\n\nEverything seems to work.",
            "Disagree, I found this subreddit from Google and I read the FAQ *and* it answered my questions lol",
            "This FAQ was helpful for me!"
        ]
    },
    "We have a Discord!": {
        "title": "We have a Discord!",
        "score": 19,
        "url": "https://www.reddit.com/r/HomeNetworking/comments/16pe6l0/we_have_a_discord/",
        "content": "The mods of r/HomeNetworking are pleased to announce the new Discord server that we have created. There isn't much there right now, but we intend it as another place where people can ask for and receive help with their home networking issues as well as an outlet for hanging out and discussing related topics.\n\nWe welcome any and all feedback regarding the server's direction, what channels it offers, and things like custom emoji. You can leave that here or in the #feedback channel in the Discord server.\n\nJoin our Discord at https://discord.gg/DAW9gu4ztK",
        "num_comments": 10,
        "comments": [
            "I get: Unable to accept invite.",
            "Thank You here is all my money",
            "Yep, my bad.  I seem to have to open another window and login often, otherwise I get this error.  Thanks for the help!",
            "There's already plenty of discord in the sub. \n\nI'll be here all week and join. Cheers",
            "I feel dumb with Discord for some reason. I click on \"accept invite\" and then... nothing. I end up in the friends section and I don't see the sub's server anywhere.",
            "We have discord and datcord.",
            "If discord doesn't work try datcord.",
            "If the account is brand new, wait a day and try again. Otherwise, try accessing the invite link from an incognito/private window. If that fails, check if you’re already at the server limit or it is possible that your account is flagged by discord as being unable to join new servers (no idea how that works but searching around indicates it is a thing)",
            "When in discord, you could follow the following steps:\n\n* Click the plus sign on the left side, near the bottom of the servers list\n* \"Join a Server\"\n* Copy and paste the link into the \"Invite Link\" text field"
        ]
    },
    "Finally got an UPS for my network: 1h battery life. ": {
        "title": "Finally got an UPS for my network: 1h battery life. ",
        "score": 10,
        "url": "https://i.redd.it/c7g1ugbtph9d1.png",
        "content": "",
        "num_comments": 7,
        "comments": [
            "1 hr at 18 w 😂\n\nExpect under 10 mins at load.",
            "if everything including cell signal etc drops out there's a good chance the fibre would too, only something like a starlink on a generator would keep you up in that situation really, all the corporate sites I manage as part of my job generally have 2/3 circuits now, at least 1 fibre in, a 4/5G cellular and a starlink. \n\nMost of the time we see serious outages it's due to either power or fibre, but generally during proper power outages the fibre goes too.",
            "The beauty is the OLT I'm connected is in another town, so local outages wouldn't affect fiber. Larger outages are exceptional, as I live in a dense urban area.",
            "Last power failure my ONT stayed up with help of a relocated UPS. Need to find an affordable one that'll keep it up eight hours.",
            "PON has no active components in the field between the OLT and ONT. In most deployments, the OLT is in the Central Office, backed by battery and generator. If you can keep your end powered, it will often stay up for days.",
            "ah yeah fair enough, makes sense. hopefully that 1 hour serves you well :)",
            "This is my 3rd UPS.   \nI have one for my PC that gives 15 min. just to shutdown, another for my Synology NAS and ap/switch in 1st floor where my pc is, and this new one which essentially powers ONT, Router and AP on ground floor.\n\nWe don't have too many power outages, but the last one just cut off the world : no cell signal, no nothing. Now I can have a bit of autonomy and keep internet up if power goes down."
        ]
    },
    "TP-Link Introduces Pocket-Size Wi-Fi 6 Travel Router With VPN Support": {
        "title": "TP-Link Introduces Pocket-Size Wi-Fi 6 Travel Router With VPN Support",
        "score": 2,
        "url": "https://www.forbes.com/sites/marksparrow/2024/06/27/tp-link-introduces-pocket-size-wi-fi-6-travel-router-with-vpn-support/",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Should I get mesh for 4k sq ft home with basement?": {
        "title": "Should I get mesh for 4k sq ft home with basement?",
        "score": 5,
        "url": "https://www.reddit.com/r/HomeNetworking/comments/1dr39wu/should_i_get_mesh_for_4k_sq_ft_home_with_basement/",
        "content": "1GB internet with cable.\n\nModem located in basement. 2k sq ft on each floor.\n\nBeginner about networking, want something that just works.",
        "num_comments": 18,
        "comments": [
            "Why do you want mesh? If to improve coverage, wired access points will do a better job.",
            "About the same size home here with a mesh system from tp-link and it works just fine without a wired backhaul. Get around 500mbps but that's also what I pay for. I have the main router and then two satellites. One satellite on the 2nd level, then the router and another satellite on the first floor.\n\nIf you go through with a mesh system just make sure to get a tri band system that uses a dedicated 6ghz connection for the backhaul",
            "Do you have Ethernet or Coax RG6 on each floor? Mesh should work well for you.",
            "Simple would be to setup mesh. That’s what I’d do",
            "I don’t really want wires run through the house. I want something simple",
            "I think I only have coax in basement. How hard is it to get coax on both floors? Is that possible",
            "Just have the ISP install their wireless device as central as you can in the home, and call it a day.  It doesn't get simpler than that.",
            "seems like everyone on this sub just suggests blasting through the walls to set up freaking internet wifi it's all a bit much",
            "I just ask because you could do a Mesh/MoCA (which needs coax cables) combo network. That’s what I did in my parent’s CA home. I had 4 nodes covering 3,000sqft on two floors. \n\nHard to put more coax/ethernet? Not really. The tricky parts would be between floors because there’ll definitely be some drywall to be repaired on ceiling/wall.",
            "Because most of us here understand the many conns of using a mesh instead of ethernet backbone."
        ]
    }
}