{
    "Neighbor’s Doberman charged at me — what would you do?": {
        "title": "Neighbor’s Doberman charged at me — what would you do?",
        "score": 206,
        "url": "https://www.reddit.com/r/homeowners/comments/1dqq150/neighbors_doberman_charged_at_me_what_would_you_do/",
        "content": "Sorry I don’t know if this is the right place to post this but I’m at a loss. Our neighbors across the street have an aggressive, territorial Doberman that is almost always in their backyard, and barks like crazy any time anyone walks by. It barks its face off at 3am sometimes for no reason. Other neighbors have confronted them, some even went to the HOA. Nothing has changed. It’s been 2 years of this. This morning I was on a walk, and as I walked by the front of their house (across the street, not directly in front), I heard it barking. It normally isn’t on that side of the house so I was immediately surprised. I looked and saw their gate open, and the dog came charging out and ran across the street to me, stopped about 5 ft from me and was barking a ton and the hair on the back of its neck was standing straight up (it might be a Doberman mix, I’m really not sure). My first instinct was to run, but I’m a small woman, not as fast as I once was, and I’m rehabbing a torn meniscus. I said as calmly as possible “hi, hi there, good dog, hi” she kept barking so I called my husband and he talked me through it to keep me calm. The dog eventually walked away after I stayed frozen in the middle of the street for a few minutes. Now… I grew up with a dog (half lab, half German shepherd Rottweiler mix) and I’ve always been a dog person, but this was terrifying. As I was walking into my house I heard the dog start barking again, and saw an older neighbor walking her very small dog. The older neighbor scooped up her dog and darted around one of our trees in front of our house to get out of the other dog’s eyesight. I’m mad as hell. We called the neighbors and texted them to tell them what happened. No apology, just “oh I don’t know how that happened, she’s inside now.” I have two small children and I don’t know what I would have done if they were with me. What do I do? Talk to them more about it? Obnoxiously go to the HOA or just escalate it to animal control? ",
        "num_comments": 321,
        "comments": [
            "Animal Control needs to be called ASAP. They need to know that they have to be responsible and close their damn gates, make sure they know where their aggressive dog is at all times. Call Animal Control again every time that dog is ever outside the bounds of it's secured fence. \"I don't know what happened, she's inside now\" doesn't help anyone if their small dog, small child, or elderly neighbor has been mauled.",
            "Keep reporting it and escalate to police or city. Dobermans are smart dogs that can be trained and integrated into people's lives but they're about as scary as a breed can get if they're in a bad mood.",
            "Something similar happened to us with a German shepherd. It ended up biting one of my kids on the hand as they walked into the house to play with a neighbor friend so animal control and the police were called. They made the owners quarantine the dog for 3 weeks, it wasn't allowed out of the house except to relieve itself and it had to be on leash. They also had to take the dog to a class to be observed by a trainer and signed off on that it could be rehabilitated. \n\nI was actually really impressed on how the city handled it.",
            "Call Animal Control. Carry any device legal to carry in your area with which to defend yourself. Know how, and when, to use said device. Pet Corrector, wasp spray, walking stick, super soaker are all non-lethal means to protect yourself. I highly recommend using koolaid in the super soaker if you go that route.",
            "I got a 5-figure payout from a dog that bit me, so, if anything happens, get their homeowners insurance info and file a police/insurance claim",
            "Defend yourself. Pepper spray it. Shoot it if you feel it's going to actively attack you.\n\nMost of us love dogs. But at the end of the day they're property that the owners are refusing to control. Big dogs are big responsibility.",
            "Not obnoxious at all. It sounds like youd be doing your other neighbors a service to report the 3 AM barking.",
            "You call the police. Im a dog person. But what if you were a 6 year old child? The police should get you in touch the correct department",
            "Weve got neighbors like this. Their rescue habitually hops their fence and its aggressive. One day it went after my wife in our own driveway. The neighbors wife apologized but they did nothing to prevent it from happening again. The next day I put up ultrasonic pest deterrents. The neighbor begged us to take them down saying her precious dog couldnt hear them but she could. The dog didnt come near the fence on our side of the property any longer, let alone jump the fence so I considered it mission accomplished and left them on.",
            "Police or self defense of your choice"
        ]
    },
    "What is the nicest thing a seller did for you, or left for you?": {
        "title": "What is the nicest thing a seller did for you, or left for you?",
        "score": 19,
        "url": "https://www.reddit.com/r/homeowners/comments/1dr4xp6/what_is_the_nicest_thing_a_seller_did_for_you_or/",
        "content": "Our sellers left vases of handpicked flowers throughout the house, left a very kind handwritten note and had the house professionally cleaned. Anyone have any notable experiences?",
        "num_comments": 43,
        "comments": [
            "Our sellers had the home professionally cleaned, left us several boxes of well-organized documents about the home's mechanical systems and the home's history and left a bottle of champagne in the fridge.  They also left a lovely fixture that was initially on the list of exclusions.\n\nThis is the way to do it.  We'll pay it forward if we ever sell this home.",
            "The sellers on my current place left me a ton of rattlesnakes (sort of kidding, this was their second home and since it was only occupied a couple of months a year the snakes figured free real estate)\n\nThe sellers did leave a full size Craftsman upright tool chest.  I think they just couldn't take it but hell I'll take a tool chest.",
            "Ours left a bottle of champagne, lots of documents about the home (historical stuff as it was built in 1900, plus all their info on the renovations they did 20 years ago), and their 3 year old left a dinosaur toy buried in the garden, which we found the following spring because its tail was sticking up out of the dirt!",
            "A nice, handwritten list of warranties and info for work that had been recently done, like roof and water heater. Tins of paint that had been used with notes on what it went to, especially helpful because they used different shades of white and tan that wouldve been hard to get just right and now we can do touch ups when needed.",
            "Ours left a folder with appliance manuals, receipt/warranty info for a few items, paint cans in the storage room (so we could see what theyd used in each room if we needed to touch up), and an otherwise clean house. What Id expect and what Ill do when we sell.",
            "Ours left us a bottle of wine and a teddy bear for our daughter.",
            "Ours forgot they left their absurdly long garden hose under the carpet of autumn leaves they failed to clean up. We used that hose for years before we had to replace it; it could reach every far corner of the whole property and it was awesome.",
            "We usually leave 2 rolls of toilet paper and a roll of paper towels and have the house cleaned.",
            "Our seller left a list of things that need to be maintained around the house along with who she used for servicing for things that need professionals. Septic, oil heat, etc. We came from an area where we did not have a well/septic system so its been very helpful.\n\nAnd bookshelves! Lots of bookshelves which I love!",
            "Weve bought four houses and no one has ever left us anything. Except for our current home, they left a huge mess to clean up and a pool that didnt run."
        ]
    },
    "Would it be weird to leave out water, soda, and snacks for the company[s] we will be hiring?": {
        "title": "Would it be weird to leave out water, soda, and snacks for the company[s] we will be hiring?",
        "score": 66,
        "url": "https://www.reddit.com/r/homeowners/comments/1dqv89g/would_it_be_weird_to_leave_out_water_soda_and/",
        "content": "My husband and I are closing on our first house woo! There are some things that need done right away that we cannot fix ourselves and we will be hiring a few different company\\[s\\] for different \"specialty\" things that need done. Getting the roof done VS tree removal for example!\n\nI planned on getting some coolers or just use the fridge to have drinks and snacks available for the workers to grab whenever they want. Like bottled water, soda ( and diet variety too for those who need sugar free), some monster energy drinks though not sure if anyone would drink those, and some snacks like those assorted bags of chips boxes.  \nI was going to leave some bottled water out for the people that prefer warmer water too.\n\nI was about to order all the stuff and then I started to think..... maybe this is dumb...  \nWould this be a weird thing to do for the workers?\n\nWe will be getting the roof done and the heat has been brutal so I'd like to leave out bottled water at the least for the workers on that job!\n\nI wasn't sure if the company\\[s\\] we hire will think this is weird or something so I just wanted to get a few opinions from you all here! Let me know if this is okay or if there is something else I can do!!!\n\nThanks in advance!\n\nEdit: I'm adding gatorade too. Thanks for the comments! ",
        "num_comments": 90,
        "comments": [
            "No, this is a great idea. Even just water is often appreciated. If it's early in the day, I've never seen a worker complain about donuts.",
            "Not weird at all. I once had a contractor tell me that he knew he was attracting a higher caliber of clients when they started offering snacks/drinks/asking them if they wanted anything on hand for longer projects. \n\nHigher caliber  higher project cost or wealthier, just a better quality of client in that they had more courtesy, consideration and empathy.",
            "Not weird at all.\nI bought cases of Gatorade and boxes of snack sized mixed chips while doing my last house.\nAnd always always bottled waters.",
            "do this just leave them a note letting them know about the goodiesthey will love it",
            "Absolutely not weird, and very considerate! And don't be offended if they don't partake, some companies have weird rules, and some companies have pizza parties after a big job, lol",
            "If you are comfortable with it (I know not everyone is), welcoming your workers use of one of your restrooms is always very appreciated.",
            "I think it would be greatly appreciated",
            "Always cool to do and appreciated.",
            "I rarely do snacks but water is almost always appreciated. Especially cold. Also show them where the bathroom is and tell them to feel free. Bonus if you leave that orange hand cleaner out and a towel tossed on the counter so they know it's ok to use.",
            "They will love it. I know our crews are always really happy when customers do things like that. We did this huge project at one house, patio around a pool, stone walls, a gazebo, outdoor kitchen, stairs, plantings and a new lawn. We were there for a few months. The couple had water and sandwiches every day and when the whole project was done, the husband cooked them steaks on the grill and they got to take the first honorary swim in the pool."
        ]
    },
    "Neighbor died.  No debt, no family.  Had a roommate.  What happens to house?": {
        "title": "Neighbor died.  No debt, no family.  Had a roommate.  What happens to house?",
        "score": 68,
        "url": "https://www.reddit.com/r/homeowners/comments/1dqtlg5/neighbor_died_no_debt_no_family_had_a_roommate/",
        "content": "The roommate was a homeless guy he was helping, so the neighborhood is curious what’s going to happen.  The homeless guy has a bunch of other homeless shacking up.  Any suggestions?",
        "num_comments": 108,
        "comments": [
            "Not to scare you, OP, but I know someone who's been living in his buddy's former house that said buddy walked away from during the housing collapse circa 2008. Somehow the house slipped through the cracks, and the bank never officially foreclosed on it. Guy's been paying the taxes and utilities, and nobody has said boo to him about it in approximately 15 years.",
            "That sounds like the early stages of a squatter shituation.\n\nI would suggest you reach out to an estate attorney and ask what the laws dictate for your jurisdiction.  That's not to suggest you be the one to deal with this. But just to get an understanding of how this potentially plays out.",
            "It'll probably get hung up in probate for years. You might notify code enforcement/police about the squatters.",
            "Depends on if the taxes keep getting paid.",
            "Probably goes to the state.",
            "Sounds like they aren't homeless anymore.",
            "By the time it becomes available for someone to purchase it you may lose interest due to conditions.   Especially if homeless are shacking up there. Doubt theyre much into maintenance",
            "Probably depends on local laws but it may just go to the state and will be auctioned off. Since the person was living there he may be harder to remove because laws in many areas allow \"tenants\" a lot of rights when it comes to eviction.",
            "Check every once in a while to see if the taxes has been paid if not, you can pay them and after a certain period of time you own if you arent paid back. But check your state laws on how its done",
            "Im not sure how concerned you are about the roommate and his pals disturbing the neighborhoodseems to me the quickest way is to report to the police that your neighbor died and someone is squatting in the house. Ask them to check it outrather than wait for it to slip through the cracks for a few years before probate catches up."
        ]
    },
    "Closing Day is Here! Sellers need More Time. 🤬": {
        "title": "Closing Day is Here! Sellers need More Time. 🤬",
        "score": 267,
        "url": "https://www.reddit.com/r/homeowners/comments/1dqiy24/closing_day_is_here_sellers_need_more_time/",
        "content": "Closing is in T-39 minutes. However the sellers want until end of day to move their shit. I have no choice right? I mean I don’t like being an asshole. But every time I’ve sold a house in the past I had to be out right away. No exceptions. They are leaving the 75” TV until after they get done work. Maybe I use that as collateral considering mine is a 55”? 😂 ",
        "num_comments": 179,
        "comments": [
            "Don't close until their shit is out.\n\nYou instantly become a landlord if not.",
            "Dont close until theyre out.",
            "Make 'em pay for the time, that motivates most people. Don't close until you do your walkthrough. Try to chill though, this is one day of the rest of your lives.",
            "Do not close until the house is empty. Do not close until you have completed the walkthrough. DO have a locksmith ready to re-key everything.",
            "We closed on our house and the sellers just left a ton in the house when we were doing the final walk through. Our realtor pitched a fit and called their realtor, so she and her husband went in and got everything out within an hour while we waited on the front lawn.  They knew when closing time was, and I bet the realtor was embarrassed but she should've checked beforehand too.",
            "Don't close until they are out of the house and you've done your final walkthrough.  If your realtor or title company pressure you to close anyway, realize they just want to get paid.  They don't care if you close, show up to your home, and while moving out the previous owners punched a hole in a wall.",
            "DO NOT CLOSE UNTIL YOU DO A FINAL WALKTHROUGH",
            "You take ownership at close, if they still have stuff in the house you can make an amendment that it needs to be picked up by a certain time, after which it is yours. They sign this, you close, they get their stuff or you get their stuff. Easy Peasy.",
            "There is likely a per day charge.NO late checkouts",
            "You close, their movers then drop a dresser down a flight of stairs, cause $5k in damage and sue YOU because YOU are the owner and the steps were wet."
        ]
    }
}