{
    "Weekly Deals Thread": {
        "title": "Weekly Deals Thread",
        "score": 1,
        "url": "https://www.reddit.com/r/hometheater/comments/1dh73h1/weekly_deals_thread/",
        "content": "Use this thread to share and discuss current sales on home theater gear or ask about pricing on a specific item. Posts of this nature outside of this thread are still against the subreddit rules and will be removed. Comments within this thread are still subject to the subreddit rules, including but not limited to rules governing spam, self promotion, referral links, etc.",
        "num_comments": 3,
        "comments": [
            "Denon x1700h for $300 vs x1800h for 425? \n\nWhich is the better deal? What does the 1800 does to justify the price increase?",
            "Can anyone recommend an entertainment stand?",
            "U.S. version of the x1800h has pre-outs and slightly improved GUI I believe."
        ]
    },
    "Why is this hdmi so expensive?": {
        "title": "Why is this hdmi so expensive?",
        "score": 158,
        "url": "https://i.redd.it/bxkp9ono818d1.jpeg",
        "content": "This is crazy ,,, I’m just speechless. Really waiting for someone to justify this. ",
        "num_comments": 231,
        "comments": [
            "Because someone will buy it.",
            "4k is supposed to be the resolution not the price!",
            "4.0/5 based on 29 reviews, my sides 😭",
            "I worked at Best Buy for a combined eight years. Worked in a Magnolia Design Center. I sold a lot of stuff. I was never given an A B demo of HDMI cables from the various AudioQuest reps. I even setup a blind A B test of Rocketfish HDMI cables versus AudioQuest, and each time the AudioQuest reps declined to participate. AudioQuest reps hated me, because I constantly asked for proof of their claims and was always declined. Fun times.",
            "Audioquest uses magic crystals in the fibres or something. Sure you can’t measure any difference between it and an Amazon Basics cable, but you just have to BELIEVE!",
            "When you're rich and you want to get fucked but don't want the issues that come with a high priced escort, you can buy one of those cables instead.",
            "Money laundering.",
            "A fool and his money are soon parted.",
            "It's liquid cooled with snake oil",
            "imagine buying an HDMI cable on layaway (the $187/mo price to the right)"
        ]
    },
    "Finished basement theatre area": {
        "title": "Finished basement theatre area",
        "score": 31,
        "url": "https://www.reddit.com/gallery/1dll1fh",
        "content": "This space is a long time coming. It’s not a dedicated space but still better than the tv above the fireplace in my living room (using mantel mount to lower it). My wife had a requirement that wires couldn’t be running around or speakers be hanging off the wall, which is why everything is either in the wall or in ceiling. I know it’s not ideal. At least I took the sticker off my AVR.\n\nThe equipment is:\n- Epson LS12000\n- Denon X3800H\n- 6x Klipsch CDT-3800 in ceiling\n- 3x Klipsch DS-250W-LCR in wall\n- 2x Klipsch R101SW\n- 100” Vivid Storm ALR sound transparent screen\n\nI used the Audyssey feature to tune the speakers and subwoofers for the space. I also tilted the in-ceiling speakers to be at the right angle for my main seat. The configuration is 5.2.4 but I might change it to 7.2.2 if I don’t feel the atmos height channels aren’t working well given my speaker placement.",
        "num_comments": 9,
        "comments": [
            "Why the drop-down screen instead of fixed frame?",
            "I really like the way your room looks. Nice job!",
            "I like 7.2 more than 5.4, you will have to report back on any good movies or audio tracks that use atmos",
            "Very similar looking size/space to house I just bought. Still in planning on eventual HT. What are some details of your setup?",
            "Didn't realise you could even buy drop-down AT screens. Very discreet setup.",
            "My wife didn’t want it always on the wall to get wrecked. I have three children.",
            "Currently I’ve only played some Halo Infinite. It sounds great and I can hear when the ships go above me or when shots are coming from behind me. I want to watch a movie to see if it still holds up. I’ll see if any of the Fast and the Furious movies are mastered with Atmos.",
            "What details do you want to know? I posted the equipment but are you looking for dimensions?",
            "I bought this [screen](https://vividstorm.ca/product/vividstorm-alr-p-slimline-motorised-drop-down-projector-screen-for-standard-throw-projectors-with-acoustic-transparency/)"
        ]
    },
    "I asked an AI for design inspiration for in-wall speakers for my new house… ": {
        "title": "I asked an AI for design inspiration for in-wall speakers for my new house… ",
        "score": 367,
        "url": "https://www.reddit.com/gallery/1dl0e3q",
        "content": "I’m sure i missed the WAF toggle button somewhere 😂 ",
        "num_comments": 105,
        "comments": [
            "I don’t see a problem.",
            "What every kitchen needs, more bass.",
            "the AI is a certified bass head",
            "Apparently this AI was fed images from AVS lmfao.",
            "sometimes AI does something and I think to myself \"could you be ANYMORE STUPID!\"....then it goes and does something like this...AND TOTALLY REDEEMS ITSELF!",
            "lol that's a kitchen of my taste!",
            "-Where's the oven? \n-Don't worry. These speakers will cook the pizza. ",
            "I’d love to put some wisdom audio-esque line arrays in my living room and kitchen. But this may be a bit too wild…",
            "Marty McFly would like to have a word with the AI architect",
            "Now give it a budget limit under $50k and see what it produces, lol."
        ]
    },
    "Looking for something like “The Frame” but that doesn’t suck…": {
        "title": "Looking for something like “The Frame” but that doesn’t suck…",
        "score": 2,
        "url": "https://www.reddit.com/r/hometheater/comments/1dluvgr/looking_for_something_like_the_frame_but_that/",
        "content": "So I love the idea of it— but the reviews are hot garbage. Does anyone have any suggestions for a super thin tv I could ”frame” & display art on that works better & doesn’t run $4.5k for an 85 inch?",
        "num_comments": 3,
        "comments": [
            "LG G3/G4? \n\nNice wall mount, bright AF, has a gallery of nice screensavers. \n\nIt is OLED though, so I wouldn’t run 24/7",
            "Sony and Leon have this:\nhttps://www.leonspeakers.com/studioframe",
            "As a frame owner the operating system sucks but I only use it to display art and the matte screen combined with auto off/on via smart things likely makes it the best product for my intended application. In my two years of ownership software updates have broken the tv twice. For 3 months the scheduling wouldn’t work until another push fixed it and another time they deleted all the artwork I had uploaded."
        ]
    }
}