{
    "How do you get comfortable with privacy ?": {
        "title": "How do you get comfortable with privacy ?",
        "score": 3,
        "url": "https://i.redd.it/8fda5fetsh9d1.jpeg",
        "content": "Buying a property (in blue) with quite a bit more privacy than what I’ve ever experienced. \n\nI grew up in dense subdivisions with semi detached homes and everyone seeing everyone’s business. While this can be annoying, to the point of not feeling comfortable hanging out in your own backyard, it’s also a bit of a comfort, knowing that you have multiple eyes on your home. \n\nThe house that we are buying is on a 4 acre lot, with a single wide (un-lit) 500’ driveway. You can’t see anything from the house aside from the road (500’ away) and the smallest glimpse of the neighbours property through the tree line, during the winter. Summer time will has foliage that obscures it entirely. \n\nWe plan to have a security system installed, as we have now. Consisting of door / window contacts, motion sensors and the addition of a camera or two (primarily one pointing up the driveway). \n\nWe also have plans to install solar powered motion activated lights along the driveway on the power poles (the power company may bark about it, but I’m willing to take the risk lol). \n\nThis new subdivision is considered quite safe, and incident free, but my wife works from home and we do want her to feel comfortable and safe. \n\nAny tips, tricks, devices/products or advice?  \n\nWe have 2 young children and a dog, no braver than Scooby Doo. ",
        "num_comments": 0,
        "comments": []
    },
    "What is this thing?": {
        "title": "What is this thing?",
        "score": 26,
        "url": "https://i.redd.it/s52wedwb0e9d1.jpeg",
        "content": "And can I remove it?",
        "num_comments": 22,
        "comments": [
            "It's a release for the bars on the window",
            "With out a good look at the window I can't be sure. Bit I lived in a ground floor apartment that had bared windows and there was a cable pull device much like that one so you could open the bars for fire egress.",
            "There should be another one on the other side of the room for pec flys",
            "What is at the top of the conduit? This looks like an accessibility device to step on and cause something at the top to happen.",
            "Would have to see the top part also at the very top of it. Where does it go? Where does it end?",
            "You must live in the Southside of Chicago",
            "The way it's been painted over how lazy lol.",
            "Possibly some kind of assistive device for a previous tenant? Looks like something you could operate with a foot. What does it do?",
            "Its just an old curtain rod pull, just take it down and patch holes",
            "Wth even is that never seen one"
        ]
    },
    "What is this strip below my patio door (not a sliding door) called?": {
        "title": "What is this strip below my patio door (not a sliding door) called?",
        "score": 1,
        "url": "https://i.redd.it/jx4uyy2a2i9d1.jpeg",
        "content": "I am looking to replace this broken part from my patio door as bugs and geckos are entering in through this way.  thanks for your input. ",
        "num_comments": 1,
        "comments": [
            "Its called the sweep and is a wearable part. They vary in design by every manufacturer but that looks like it just slides in from the side, some are screwed on with a bracket where there is more of a lower panel on the door."
        ]
    },
    "Wall crack": {
        "title": "Wall crack",
        "score": 4,
        "url": "https://www.reddit.com/gallery/1dr1e65",
        "content": "How concerning is this wall crack? It runs horizontally from the window to the corner. It is in an upstairs bedroom. \n\nOutside is the chimney. There aren’t any cracks in the brick or mortar. ",
        "num_comments": 2,
        "comments": [
            "Most likely a bad drywall seams.",
            "I have only ever seen regular crack, how is wall crack? /s For real I don't know bro."
        ]
    },
    "Ideas to decorate this plain wall in my kitchen?": {
        "title": "Ideas to decorate this plain wall in my kitchen?",
        "score": 28,
        "url": "https://i.redd.it/8qzwicz1pb9d1.jpeg",
        "content": "",
        "num_comments": 88,
        "comments": [
            "I would say some wallpaper or either antique mirror panes would fit well in that space.",
            "A large sign with \"EAT\" written in cursive, otherwise nobody know what to do in that room",
            "I was thinking a big piece of art or a mirror with a small shelf for plants/decorations also.",
            "Get some copper or cast iron pans to hang there.",
            "3 smallish framed 'herbal' drawings.   simple simple simple",
            "A painting or a print. Something that sparks interest for your eye and that can be swapped for something else when it suits you. Check out thrift stores for some interesting finds.",
            "Great place to add on unexpected pop of color!  If you really arent into a statement art print (doesnt have to be a real painting if you dont want to make it a permanent choice) you could go with a smaller set of 4 framed prints.",
            "Wallpaper murals are very cool",
            "Do a Stencil accent wall!",
            "Make it an accent wall with some cool paint or funky wallpaper."
        ]
    }
}