{
    "Why are modern homes in the Midwest dominated by massive sloped roofs and large attics?": {
        "title": "Why are modern homes in the Midwest dominated by massive sloped roofs and large attics?",
        "score": 48,
        "url": "https://www.reddit.com/r/Homebuilding/comments/1dqj20p/why_are_modern_homes_in_the_midwest_dominated_by/",
        "content": "I’ve been wondering why we don’t see much in the way of true 2 story homes with beautiful architectural elements anymore. Usually, it’s brick facade that wraps the first floor, then a massive roof line, then the second floor kinda pops out of the roof. What’s the deal with that?",
        "num_comments": 44,
        "comments": [
            "Because snow",
            "You need a good pitch on the roof to handle the weight of snow.  Which, on a modern build footprint ends up meaning fairly high peaks.  Easier then to tuck the second floor into that roof space and throw in some dormers than to raise the  eaves.",
            "Beautiful architectural elements are expensive.",
            "Often it's snow.. \nYou want that stuff coming down.\nI have relatives in the Midwest and a lot of those harms are very charming. My home is here in the southwest and we have a lot of tile Spanish roofs.",
            "Like others have said, snow is a big thing, but also that quite a few houses have basements because of tornados. Most people don't feel like they need a 2nd floor when they've got a full basement to work with too",
            "Various formal reasons in terms of actual shedding water, snow, heating and cooling or whatever. BUT the crux of the question to me is \"why isn't it better?\".  \nIn my opinion (having grown up there and seen the industry now for 15+ years). Its 100% due to the way single family homes are built. Blame DR Horton, Pulte, Lennar, KB Homes, etc. These are the people that have virtually zero incentive to improve anything that they do. The industry is slow moving and as a business model, they are doing everything they possibly can to cheap out and skimp every corner. Ask anyone who has bought a built home by these people --- they are awful. Furthermore, design wise, when working with places like this, you want the most broad appeal to not ostracize anyone. Any element you put onto a home could steer away a potential buyer. Its why everything is as boring vanilla-middle-of-the-road as you can get. This strategy is also why high rises in cities are middle of the road, and sometimes every-other-floor employs different aesthetics slightly to attract a wider group of buyers.\n\nYou will find great homes done custom by architects and custom builders, however the amount <1% probably (guessing no idea in reality) is so small that they dont enter the public mind and public really doesn't get much exposure to them (unless you read design blogs and whatnot). Even if you do have exposure tho, they cost more for quality (much of the quality hidden such as insulation, waterproofing, etc), so its tough to obtain. Even if you want a modest great home with a flat roof or something else --- its hard to find GCs with experience in it, which ultimately leads to a price premium regardless.\n\nHence the wheel keeps going round and people are forced to keep buying shitty homes.",
            ">then a massive roof line, then the second floor kinda pops out of the roof. What’s the deal with that?\n\nSo you see a lot of Cape style homes with dormers in other words? Probably because its cheaper to build that way than a full second story and a lot of modular homes are built this way too now.\n\nEverything comes down to $$$. Nice, architectural, and trendy tend to blow up budgets.",
            "Snow and wind.\n\nWind is counterintuitive. The high slope reduces lift.\n\nIn the coastal areas they use brackets and tie it all down to the foundation. But once you add in the snow loading the path of least resistance is pretty clear.",
            "Around here all new builds are black and white McMillenials (modern farmhouse).",
            "Building the second floor under the roof is less expensive than building full two story exterior walls and facing them with brick, stucco, stone, or even siding. That’s what my builder clients always say."
        ]
    },
    "Whole home audio…still relevant?": {
        "title": "Whole home audio…still relevant?",
        "score": 8,
        "url": "https://www.reddit.com/r/Homebuilding/comments/1dquyb8/whole_home_audiostill_relevant/",
        "content": "Do people still like these? I’m looking at buying a house that has a whole home audio system installed, though likely outdated. Home was built in 2007.\n\nUnless you’re throwing a house party, can someone please explain why on earth you would want that?\n\nThe house we are looking at is 3,000 sq ft. I have 4 kids. There’s no way everyone in the house is going to be wanting to jam out to the same thing at the same time. Everyone just uses headphones nowadays. I don’t blast music unless I’m working out anyways.\n\nI’m wondering if we decide to sell in years to come if it will continue to be looked at as outdated and undesirable. \n\nAm I missing something? Why is it not appealing to me at all? Is it just me?",
        "num_comments": 44,
        "comments": [
            "We have speakers out back, in the kitchen and family room. All are wired to a simple speaker input with receiver.",
            "AV designer here. These days houses still get audio distribution, but mostly with small aperture speakers that match the small size and shape of the downlights in any particular room. Nobody likes giant 10” speakers pockmarking their ceiling in every room, but it’s a whole lot cheaper to just install newer style flangeless ceiling speakers than patching and painting the holes in your ceiling and deleting that built in feature. Go buy 5 Sonos amps and a couple Alexa dots or whatever and enjoy what happens when you say “Hey Alexa, play Skynyrd in the Master Bathroom” whenever you’re getting ready.",
            "IMO, desirable. Many won’t care. Most will view it as a cool upgrade that they won’t pay much if any more for.",
            "Imagine waking your kids to the gentle sounds of classical music, or birds chirping, or even blasting them out of bed with some metal or something.  \n\nThe only other thing I can think of is putting on a podcast and being able to listen to it everywhere without earbuds. Could be good while cleaning the house. \n\n And of course, partying.  \n\n I wouldn’t view it as a negative unless it was a hazard in some way. ",
            "Are you sure it's not zoned? Wired audio was excellent then, very likely it's better than what a new system would look like.",
            "sonos is imploding. old wired system is nice",
            "Even if it’s all wired to one receiver you can pull it and zone it with Sonos/Sonance amps. Everything would be wireless and you can play different music to different areas or jam all of them when you want. Christmas and Halloween party’s it’s nice to have background music",
            "I use whole-home audio all the time with my HomePods. It's super nice to be able to do all sorts of chores without the music ever going away, without needing to put on headphones. It would be even better if it tracked where I was and only played where I was at the time, but I guess that feature is for another day, when the technology to make it happen, eventually gets productized.\n\nAlso, parties - nothing helps set the mood throughout the entire place more than good ambient music.",
            "I think you are referring to wired whole home audio? I prefer wireless and there are so many options now. We declined wired audio on our new build and used Sonos indoor and outside instead.",
            "I think a wired audio system is kind of outdated, it was a big deal 20 years ago and no one's going to pay a premium for it these days but no one's going to think the house is worse for having it either.  We have whole house audio but it's wireless and controlled by room via an app.  We use it frequently but the only time the whole house is playing the same music is when there's a party or at Christmas.   I'll put on the same music in two or three rooms if I'm going on between them doing some project."
        ]
    },
    "Is this wall thickness enough for a garden \"room\" regarding sound dampening?": {
        "title": "Is this wall thickness enough for a garden \"room\" regarding sound dampening?",
        "score": 1,
        "url": "https://www.reddit.com/r/Homebuilding/comments/1dr5zt6/is_this_wall_thickness_enough_for_a_garden_room/",
        "content": "Hello!\n\nI want to build a \"room\" in the garden. I want to use timber frame and mineral wool insulation (90kg/m3 density) and drywall.\n\nI would like to sleep in this room at night. There is no significant noise in the area just the usual dog barking etc....\n\nI am thinking of 100 mm (4\") wall thickness. Would it be enough?",
        "num_comments": 0,
        "comments": []
    },
    "Where to begin the home building project?": {
        "title": "Where to begin the home building project?",
        "score": 2,
        "url": "https://www.reddit.com/r/Homebuilding/comments/1dr2al9/where_to_begin_the_home_building_project/",
        "content": "I bought farm land in Florida, now I have to build a house. How do I even begin? I'm overwhelmed with the task.\n\nDo I need an architect? Do I go directly to a builder? Get plans online?\n\nI want a traditional Southern farm house, or close to that, hopefully two floors, with a back porch, etc. However, I'm also worried about insurance, flood and hurricanes.\n\nIs it unreasonable to build in concrete or cinder blocks? Is it worth it?\n\nIs this the right place to ask?",
        "num_comments": 2,
        "comments": [
            "Try searching this sub, question must get posted daily.",
            "I'll start with that. Thanks"
        ]
    },
    "Acceptable imperfections?": {
        "title": "Acceptable imperfections?",
        "score": 7,
        "url": "https://www.reddit.com/gallery/1dqtdg5",
        "content": "Are these types of imperfections acceptable for a newly poured foundation?\n",
        "num_comments": 9,
        "comments": [
            "They had the vibrator in their azz instead of the concrete 🥴",
            "Bro wtf is this?",
            "There’s a couple spots on mine that I don’t love but nothing as bad as this. It looks like shit.",
            "So what’s the remedy? Ripping out the walls and re-pouring? Spot repairs? What about the footer?",
            "1 and 2 are concerning",
            "Oh my! I've never seen finished concrete exterior walls like this.",
            "Well, if you hired a contractor, then you have the right to either accept the work or not. Personally, I would not be happy with this work; they should have vibrated the concrete and obviously did not. Must be rookies. It's pretty crappy looking, typical idiot workers that take good material and cock it up due to their workmanship.",
            "Not good at all. That’s honeycombing due to lack of proper vibration. Honeycombing can be just surface but this definitely runs much deeper. This is going to let a lot of moisture seep in, corroding your reinforcement and reducing the service life drastically. \n\nI would ask the contractor to remove all loose concrete and do a patch repair or if it’s too bad, maybe even a repour.",
            "I am working with a builder. I did not choose the contractor. I agree thought this is shoddy work."
        ]
    }
}