{
    "Home Assistant Forums & Chat": {
        "title": "Home Assistant Forums & Chat",
        "score": 168,
        "url": "https://www.reddit.com/r/homeassistant/comments/4iokdi/home_assistant_forums_chat/",
        "content": "All discussion related to Home Assistant and related Home Automation is welcome in this subreddit. If you find you aren't getting help required, please feel free to try the [Forums](https://community.home-assistant.io/) or [Discord Chat](https://discord.gg/home-assistant).",
        "num_comments": 27,
        "comments": [
            "Hey, just wanted to mention I love the new look - so much more suited for HA!  Nice work!",
            "Does anybody know of a good Bluetooth adapter I can use with home assistant so I can discover switchbot devices.  I have home assistant installed on an Intel nuc via the official nuc installer",
            "Anybody else having issues with ios app needing to be closed and restarted before it works again after not using it for a while?",
            "I started with home assistant new and try to implement and Tuya switch for a door. But I can only integrate the switch for the door to send the signals or the sensor to get the current status.\nI don't know how I can integrate both functionalities with local tuya.",
            "\\>are smart lights only going to work on the app they recommend?\n\nI'd like to know that too.",
            "No need to hate on docker, man. It's just a bunch of kernel features for process isolation put together. There's no cloud. Just image registry for downloading images - that's no different than fetching an rpm from a repository.",
            "I like to tinker and docker is really helpful for this. It's not only the plug and play side of things, it's the \"when something fucks up I know how to unfuck it back\". In relative difficulty, I'd rate setting up a proxmox container and a docker container about the same.",
            "Please ask questions in their own post",
            "Nice, I did see zig bee as an alternative to wifi when I was trying to learn the basics and that sounds like the way to go. And HA seems to come up a fair bit too, so at least as a step 2,sounds like what I should look for to play around with\n\nThank you so much for taking the time to help me out",
            "It's seems like there are options, there seems to be a couple of different protocols that smart bulbs can run on, and then there are a few apps to choose from depending...\n\nBut that's as far as I have gotten so far, don't know the names or anything, need to post and ask once I reviver from Christmas hahaha"
        ]
    },
    "Roadmap 2024 Midyear Update: A home-approved smart home, peace of mind, and more!": {
        "title": "Roadmap 2024 Midyear Update: A home-approved smart home, peace of mind, and more!",
        "score": 203,
        "url": "https://www.home-assistant.io/blog/2024/06/12/roadmap-2024h1",
        "content": "",
        "num_comments": 79,
        "comments": [
            "Just chiming in to say that I'm always so impressed with the HA team's ability to consistently deliver, innovate and improve the \"product\". I have not seen a project that goes \"we are going to do x\" and then easily, measurably, consistently does so.  \nI religiously check for the latest version and am always excited by what's new. Thank you for making such a brilliant and open-standard product!",
            "definitely want to +1 for the dashboards to have definable permissions for users and guests. I'd really like visitors to my home to have a landing page when they connect to the wifi that tells them how to adjust stuff in their room and see temperatures and things. It should be a customized dashboard that I've made just for guests and they shouldn't be able to get to anything else. Also, this would be even more important for people have short-term rentals like airbnb homes - when a guest comes into the home and connects to wifi, they could be shown a customized dashboard with all the things they need, including the checkout instructions, and not be able to get to anything else in home assistant. And lastly, I think it would be very useful to give kids a dashboard for their controls without them having the ability to get to anything else other than what is on their dashboard. Just some basic permissions settings on dashboard pages would allow for all of these use cases and people could get really creative with them. Thanks HA!",
            "Any hope for a full user friendly version? There's a dumpster out there now that I don't want to learn it a second time. I set up a dashboard a few years ago and I don't want to go through it again. ",
            "It would be great to have a strategy built into automations for validation. As you start to scale up, it becomes difficult to know when a device failed to update within an automation, unless you experience it firsthand.",
            "That's not really much of a roadmap, is it",
            "For me this is total irrelevance, I need better things like **global variables that will work on trigger conditions and actions and variables that don't have local scope** so we can create better automation's but ya I understand flashy things like AI, Assistants and Dashboard drag and drop can be flashy for the beginners eye and attract more ppl.",
            "Definitely what I’m waiting for. \n\nEvery time Alexa turns on a light and’s then “Did you know…”’s me, I want to throw it through the window.",
            "If they made a voice assistant similar to a Google nest with the screen and it just automatically could display selected dashboards of your choice that would be a game changer. No more tablet hacks or clunky programming of open hass. I would definitely pay 100$+ for something that worked seamlessly with HA!",
            "Where exactly are the good hardware choices to start using voice? Other than building your own (which I'm not against) I haven't seen anything \"good\" yet.",
            "Really do want to make the jump to this, but I don't want to spend hours getting everything working. Currently Alexa can do 90% of what I need, but if something was plug and play falling in with everything set up in HA I would be sold immediately."
        ]
    },
    "Sharing my Integration: Playstation Network": {
        "title": "Sharing my Integration: Playstation Network",
        "score": 148,
        "url": "https://www.reddit.com/r/homeassistant/comments/1dqwuz9/sharing_my_integration_playstation_network/",
        "content": "[An example dashboard featuring all the data available in the playstation network integration](https://preview.redd.it/n6y9sp6f7e9d1.png?width=1796&format=png&auto=webp&s=b5b15fe0be87005bd566465d522395aa60e85edd)\n\nHi everyone,\n\nI created an integration for those of you that want to integrate your playstation network data into Home Assistant. You can review the image for a visual look at what this integration provides or continue reading to find out more.\n\n[Integration Repository](https://github.com/JackJPowell/hass-psn/)\n\n[Direct HACS Link](https://my.home-assistant.io/redirect/hacs_repository/?owner=JackJPowell&repository=hass-psn&category=Integration)\n\n# What this integration provides:\n\n* 1 media player to display your currently playing game's cover art and title\n* 1 sensor that reports your current trophy level\n   * Additional data\n      * Total Platinum trophies earned\n      * Total Gold trophies earned\n      * Total Silver trophies earned\n      * Total Bronze trophies earned\n      * Percent complete of current level\n* 1 sensor that reports your availability status\n   * Additional data **about your active game**\n      * Earned trophies by category\n      * Total trophies by category\n      * Play time\n      * Play count\n      * PSN User Rating\n      * ESRB Content Rating\n      * Game description\n* 1 Notify service which accepts a list of friends and a message\n   * With this service you can message your friends from within home assistant\n   * Automation: When state changes to 'Overwatch' message <psn\\_friends>\n\n# What this integration does not provide:\n\n* The ability to control your console locally\n   * Check out the great [ps5-mqtt](https://github.com/FunkeyFlo/ps5-mqtt) add-on if you're looking for local power control\n   * Optionally, track down a [PDP IR Receiver](https://www.amazon.com/PlayStation-Receiver-Logitech-Harmony-Control-4/dp/B01K3VMBM0) on ebay\n\n# Why would I use this integration?\n\n* You want an easily installable integration (rather than an add-on)\n* You want to be able to easily integrate your game's art and title into your dashboard or [remote](https://www.kickstarter.com/projects/marton/unfolded-circle-remote-3)\n* You want to display your trophy information or game details on a home assistant dashboard\n* You want to be able to automate messaging your psn friends\n\n# That's a pretty cool dashboard. How can I recreate it?\n\n* Sadly there is no easy button here. You can follow the directions outlined [here](https://github.com/matt8707/hass-config) but this is not plug and play. Also note that Mattias has moved on to another project. It appears he got tired of dealing with home assistant's lovelace dashboard and decided to roll his own. [Looks pretty sick](https://github.com/matt8707/ha-fusion) though. \n\n  \nThanks for reading! I hope some of you will find this useful. Enjoy",
        "num_comments": 38,
        "comments": [
            "This looks awesome. I am definitely going to install this, spend a few hours configuring the shit out of it, and then never use it again.",
            "Amazing! Will try soon, could be a sick combo with the mqtt-ps5 addon I use.",
            "Just installed it, super easy and works well. Awesome work!",
            "Hi, I'm actually here because of your dashboard. I use the same one, and I was wondering if you could share your sidebar.yaml. 😃",
            "This is pretty sweet. I wouldn’t use any of those things aside from now playing :> but since I go between Nvidia shield and ps5, it would be cool to have the ps5 game being played displayed so I can have what’s on the tv.\n\nNicely done good sir",
            "YOOOOO!!!! THIS IS AWESOME!!! Just installed it. Can't figure out how to get the trophy cards though",
            "Out pretty much moments after getting my first PS5? That’s a good sign right there",
            "Would the now playing be a perfect time tracker? How long what game is played? Maybe with account info?",
            "+1 on this! This looks exactly like the sort of thing I NEED for absolutely no reason",
            "Thanks! Hope you enjoy it"
        ]
    },
    "Give me some ideas. I would like to make my main page more efficient, and less cluttered, but I use almost everything on this page.": {
        "title": "Give me some ideas. I would like to make my main page more efficient, and less cluttered, but I use almost everything on this page.",
        "score": 11,
        "url": "https://i.redd.it/ibqmqtk9yh9d1.png",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Conditionals.\nFor example, have a helper toggle that when on shows your video feed. Then set up your video feed cards to display when the toggle is on OR when the motion sensors detect motion. You could do the same thing for the meat/grill temps. Only show that card when the grill is in use by using a conditional badges on temp being anything other than NaN. I create a helper toggle. Then create a vertical stack card. Next, create an entities (not entity) card with the toggle entity for the top card in the stack. Finally, first the bottom card in the stack create a conditional card that only displays when the helper toggle is on. I leave the masonry view for the panel. However, if the page is only for a wider screen, I like the 2 column panel layout. In that scenario, I place all of my toggle helper entities in one card, and make separate cards for all the other stuff using the new visibility tab for each card. The visibility tab works like the conditional.",
            "Automate all of it so the dashboard isn't needed? 😀",
            "You can hide stuff so that it only shows up when it's some state that you like to see it. Example when some is open or am alert. Saves space and less cluttered.",
            "Definitely conditional cards, anything that is an alert should only be on the screen when the alert is active. I have mine as individual cards that blink red so when they are active it gets your attention, then goes away when not.",
            "> You could do the same thing for the meat/grill temps. Only show that card when the grill is in use by using a conditional badges on temp being anything other than NaN\n\nThat is really a good one!",
            "Most of it is, but need the state of it for information purposes, lol",
            "While this is a good idea, I also like to know when motion was triggered in area last, as it showing up, and I don't see it, I won't know when it was last triggered. I am pretty sure I can do the grill temps, the Washing Machine/Dryer, and the Rain Sensor as conditional to be hidden when not in use.\n\nThanks for the info",
            "That is the issue though, so for instance, on a motion alert. I don't want to be watching it the whole time just to know an alert happened. I would like to know when the last alert was, hence while all the motions have last updated in the secondary info.\n\nFrom the looks of it, I have missed conditional cards, and they will free up a bit of room on this page.",
            "How are you doing the time until sensors?\n\nAnd I used to do it for informational purposes and recently quit, only get actionable information. Use conditionals and split between areas/floors.",
            "I'm sure people have already said this but conditional cards are your biggest friend. Particularly with things like your grill temp. If it were me I'd have them hidden until the device registers a temp and then have them show up.on the dashboard. Same with your motion detection areas. Unless you're watching your dashboard non-stop then I assume you only want to know if there's someone in a specific zone *when* you're looking at your dash board. If they're all connected to a conditional cards that only has them show up *WHEN* there's motion in them then you'll know if you look at your dashboard and one is showing that there's motion in any given zone that's showing up at that moment. Alternatively if you have these showing because you want to see them at a glance when you are away from the house have them show up only when the house is set to \"away mode\" or something like that.\n\nSame for cameras really. Again unless you're watching your dashboard all day then why not have them only show up when there's motion detected or the doorbell is rung or something like that.\n\nLastly for your weather content consider exactly how much forcast data you want to see at any given time and consider condensing it into a mushroom chips card to save space. Then have one of the chips have an 'on tap' action of 'open full weekly forecast' or something. I realise it probably seems like you're loosing instant access to all that info. But I'd suggest you try it and see how often you *actually* end up tapping on your \"weekly weather view\" and then if the answer is all the time go back to what you have. For me I have one chip that tells me today's weather and then one chip that tells me the weekend forecast and that's all I need. For all other weather things I have automations that let me know when certain events are going to happen. E.g it's going to rain tomorrow I will get a notification as part of my wake up routine and that way I can plan for the day ahead then. If I really want to drill down further on weather after getting notifications then I can go in and look."
        ]
    },
    "Inovelli 240V switch is published": {
        "title": "Inovelli 240V switch is published",
        "score": 11,
        "url": "https://inovelli.com/collections/smart-home/products/blue-series-zigbee-smart-dimmer-eu-version",
        "content": "Inovelli 240V Switch is published\n\nI’ve been following the 240v thread on their forum and just saw that the switch has been published on their site. I’m very excited to try out the switch that seems to get a lot of love from the US smart home users ",
        "num_comments": 4,
        "comments": [
            "I can't wait to see how well they review.  I'm sure the Erics have it all figured out.  Hopefully they aren't shipping those from the US.",
            "Hopefully we get some stock in Australia",
            "Man sold out already? I’m curious to try too. 220v Asian countries need some smart switch love",
            "No man, they haven’t released pre sales yet. Hopefully it comes soon!"
        ]
    }
}