{
    "Better to apply for a loan single or married? ": {
        "title": "Better to apply for a loan single or married? ",
        "score": 1,
        "url": "https://www.reddit.com/r/Homebuilding/comments/1drcwcs/better_to_apply_for_a_loan_single_or_married/",
        "content": "Not sure if this is the right place to ask this question but I would appreciate any thoughts on this.\n\nMy fiancé and I are throwing around the idea of building a home. He has a few student loans, good credit. I do not have any loans and have good credit. \n\nAre we more likely to be approved for a loan AFTER we are married and share joint finances/combined household income? Or would I be more likely to be approved for a loan going through the home building process as a single individual with zero loans? \n\n",
        "num_comments": 1,
        "comments": [
            "Banks evaluate your income vs your monthly required payments; the total payments due (including the new loan) can't be above a certain percent of the total income.  As long as his payments aren't super high you are better off applying with joint income and some loans."
        ]
    },
    "Dense packed blown fiberglass in walls?  ": {
        "title": "Dense packed blown fiberglass in walls?  ",
        "score": 1,
        "url": "https://www.reddit.com/r/Homebuilding/comments/1drbswh/dense_packed_blown_fiberglass_in_walls/",
        "content": "My sheathing is zip FYI\n\nThoughts on dense packed blown fiberglass insulation in 2x6 walls. My builder typically flash’s the cavities first with 1” of closed cell spray foam followed by dense packed fiberglass but some on here have stated some concerns about the foam. And my wife actually has some sensitivity too chemical smells and so I’m thinking we want too forget the foam all together.  \n\nSo my question is, without the foam is the dense packed fiberglass in the wall cavities alone good enough ?  Or would rockwool Batts work better?  I’ve used rockwool before but I had to redo a lot of it because it was installed with gaps all over. The blown seems like it would fill the entire cavity better.  \n\nI also have concerns with a super airtight house so getting rid of that foam will let the walls breathe too the outside.  Regardless I’m doing an ERV \n\n",
        "num_comments": 8,
        "comments": [
            "I’m a big fan of Rockwool, but if I was doing blown-in it would be cellulose not fiberglass.",
            "Compressing fiberglass reduces its R value, compressing cellulose increases its R value.",
            "Why would you flash it and not just insulate with 2lb foam……do people just love spending money",
            "What climate zone are you in? The foam method greatly reduces the chance of condensation in a cold climate. Otherwise you're relying on a well-installed vapor retarder.",
            "What are you basing this on? It reduces the r value for the same mass of fiberglass, but it increases the r value per inch. So if you loosely pack a 2x4 wall you'll get r13, if you pack it tight you'll get r15 (and if you put that r15 amount of insulation in a 2x6 wall you'd have r21)",
            "Ok ill talk too him about switching too cellulose. I was figured cellulose would easily grow mold if wet compared to fiberglass",
            "Northwest kansas so 5? its 90-100 in the summer and can get down into the single digits in the winter.",
            "Idk"
        ]
    },
    "What is the latest you should break ground?": {
        "title": "What is the latest you should break ground?",
        "score": 0,
        "url": "https://www.reddit.com/r/Homebuilding/comments/1drb74m/what_is_the_latest_you_should_break_ground/",
        "content": "I’m in Michigan and I’m starting to worry about getting enclosed in time before the weather turns. I have quotes lined up and financing set up but my windows carry a 13-15 week lead time which would land me late September or early October. Is that too late in the year to break ground? I’m around the Detroit MI area. ",
        "num_comments": 11,
        "comments": [
            "Southern Ontario small builder here. Peterborough county. Start excavating now. 1 week excavating and laying out the footprint. 2 to 3 weeks to pour footings, foundation walls then backfill. 2 to four weeks to frame. Another week to shingle the roof. After the house is framed, its ready for exterior windows and doors, and plumbing electrical rough ins, basement garage porch concrete pours. After rough in inspection, you can insulate. Once you got electric service to the house and a panel, insulated and exterior w/d, your ready for winter. Expect delays when building or you'll be disappointed. Good luck!",
            "Drive around new neighborhoods in January with snow out. You'll see work done on new houses. These guys can't stop making money just because it's winter. \n\nAside from making life miserable, the only thing low temps really hold up is concrete pours. Freezing destroys concrete if it isn't cured yet. But I've seen foundations and even pools poured in the winter. They have tricks for this, covering with blankets and using space heaters. It's usually only for a few days to a week. There might be a modest hit in labor cost.",
            "Who is the builder? builds your house based on your availability to build it to line everybody up. The project general contractor or project manager should have a production schedule based on the start date and the finish date you work into the situation your delivery times for all finishes . So your windows take 15 your cabinets are gonna take 12. Your tile might take 5 Drywall guy might take three who knows you have to start and figure it out as you go and you make provisions for your weather conditions.",
            "Consider your building materials and how long they will be exposed to weather before pulling the trigger. For instance, the timing / choice of siding is critical if you are planning to use housewrap.  Some siding materials can't be installed when it's too cold out so the contractors will leave the siding work \"until it warms up\".. in the meantime the housewrap is out unprotected for months on end, which destroys its integrity and violates its warranty.  Yes, the house still gets built, but with a compromised WRB and you won't know it's a problem until years down the line when the builder is long gone.  If you're using zip in this case it's less of a problem as it's rated for 180 days exposed.",
            "I’m in in northern Pennsylvania and they were going to start mind in October and just work when they could type thing.",
            "I'm in Minnesota. We build all year long. Cold or not",
            "In Vermont and my parents’ last house was started in October (I believe the foundation was poured in early September). The only issue they had was with the roof. There was some minor leaking the first year, I think around the flashing for the chimney. But after the following summer it was fine. I see places around here being built almost year round now.",
            "We broke ground the middle of Nov. We showed the inlaws around the day after Christmas- The inside was a sheet of ice :) \n\nWe had to buy ( could have rented but we bought one) a large propane heater to bring the house up to the fifties in March for the drywall being done.",
            "SE Michigan builder, that’s a fine time to start.  Ideal?  No.  But perfectly acceptable.",
            "You can break ground and build houses all year long. Wtf do you think we do up in canada, we dont shut er down for 6 months"
        ]
    },
    "\"Off-grid\" homestead dream home - Questions about cost & acreage": {
        "title": "\"Off-grid\" homestead dream home - Questions about cost & acreage",
        "score": 1,
        "url": "https://www.reddit.com/r/Homebuilding/comments/1dram8x/offgrid_homestead_dream_home_questions_about_cost/",
        "content": "I want to have secluded property with a 3bd/2ba home,  2 car garage, ~500sq ft greenhouse, solar power, rainwater collection, swimming pond, greywater system bio pond, 30x40 pole barn, and 2bd/1ba guesthouse\n\n\nIf unused land like for hunting or farming is not a concern, what is a ballpark minimum acreage to be looking at?\n\nRough idea of out-of-pocket cost using an FHA construction loan?\n\nOpinions on everything? Assume I know nothing. This is just my dream. I'm a 24yo who's renting a single family home right now for 1700/m\n\nLuxury isn't a concern but things like a nice sized kitchen, a fireplace, and outdoor patio would be nice.\n\nAm I correct to assume that I can build a million dollar home/property for 35k/3.5% down? And then maybe 70k out-of-pocket after fees and expenses?\n\nI'm trying to figure out how much I need to have saved before I can start bringing this to fruition. I don't necessarily expect everything to be built all at once, it could be something I work out over time, but I assume it's most efficient and cost effective to do everything up front and take advantage of the early stages of the construction process to prep land for these things and have everything be designed and engineered upfront as a single coherent unit rather than piecing things together over the years I live on the property. ",
        "num_comments": 4,
        "comments": [
            "Good luck on getting an accurate free answer to your question from reddit!",
            "Thanks for this info. Definitely gives me a better understanding. My fiancee and I combined make 110k total, so obviously, a million is unrealistic, but I was just curious about that number. I'd look into budgeting a 30-year mortgage and base my decision off of that.\n\nGood info about buying the land. Any opinion on what the lowest amount of acreage I should look at would be? I'd do my own research prior to any purchase, obviously; I'm just saying, like, if I open the zillow app, what number could I filter for?",
            "Tons of variables here and be aware that in many areas FHA loans have a $500k limit.  Higher in high cost areas.  Are you going to buy the property outright?   Not sure if you can use an FHA loan to buy the house and then build it… but you may be able to buy the property out of pocket and use its value as a down payment.  FHA loans also require mortgage insurance and may have higher interest rates and you still have to have  high enough income to qualify on a large loan.  \n\nFor costs… land costs and building costs can vary massively depending on the site.   Construction costs for an off grid house will likely be higher than a normal house assuming you have a large solar array, battery storage, well, gray water processing system, etc.  you will probably want to build a more efficient home with a lot of special features which will require a skilled custom contractor who will charge more. \n\nThe best approach would be to save up and buy the land and use it for money down.  Assuming you can afford a $1m property, you should have a high enough income to save up for land in a year or two.  \n\nWhatever the build costs… I recommend having 5-10% of the total cost in cash for surprises… especially given all of the features you want on the site.  You also need to budget for surveys, soil borings, etc.   are you designing the house and complex off grid systems yourself or hiring someone with skills?\n\nAre you buying build ready farmland?   Desert land?  Forested land?  The type will hugely impact your development costs.  \n\nYour best bet is to pay an architect who is specialized in eco friendly houses for a couple of hours of consultation to scope out your ideas.",
            "This is one of those \"champagne dreams on a beer budget\" type of questions, but to make any dream come to you just make a plan, and a budget, adjust the plan to fit the budget, and go from there. \n\nThese are guesstimated prices in my area, so you will want to meet with your local bankers, real estate folks, and contractors to adjust. \n\n5 acres of land- $150k\n3bed/2bath/2car - $300/sqft so 1350sqft for $400k. \nGreenhouse 500sqft- lots of different types but I'm looking at a $5k kit. \nSolar - $3/watt installed so 30k for a 10kwatt setup but tax credits involved so 21k.\n30x40 pole barn - $100/sqft so 1200sqt for 120k.\nRainwater, swimming pond, greywatar - no clue how to price this so let's assume you do it on the weekends for $20k. \n2bd 1 bath guesthouse 900sqft - $300/sqft so 270k. \n\nSo all that is right at $986k so adding 20% for overages and things we forgot about like a $20k septic and a $30k well can absolutely be a million dollar question. \n\nYou were asking about downpayment, but what you need to be worried about is the typical 30% of income is what you can 'afford' on a mortgage. If you pop a million dollar property into a calculator you need to make almost 15k per month, almost 200k a year to be able to afford that property. 5k a month just on your mortgage. And remember 'pity'... well piti... principle, interest, taxes, insurance. Taxes and insurance can add another 2-400 to that monthly payment, and if you are on the line suddenly you can't afford it. \n\nIf you start with just the land and the small guest house  with the 3.5% fha $18k downpayment... at today's terrible rates you are looking at about $3200 a month, plus taxes (in my area about $200/mo) plus insurance ($150/mo) so $3550/month just to get started... multiply by 3.33 so you really want to pull in 11,822/month to be able to 'afford' it... so about 142k per year. Two people making $70k each can do it. \n\nhttps://www.myamortizationchart.com/mortgage-calculator/500000/6.86/?down=18000&years=30\n\nAnyway if you are paying 1700 a month right now, ask yourself if you are ready to bump up to 3550 or 5,000 a month. But like anything, make a budget, make a plan, and then adjust to what lifestyle you want to live. You may be able to find a property with most of what you want at a discount because it is a fixer upper. Not everyone can afford new construction. \n\nHope that helps!"
        ]
    },
    "Building a home in Northwestern Ontario, Canada": {
        "title": "Building a home in Northwestern Ontario, Canada",
        "score": 1,
        "url": "https://www.reddit.com/r/Homebuilding/comments/1dra83z/building_a_home_in_northwestern_ontario_canada/",
        "content": "My apologies if this question has been asked a zillion times.\n\nMy wife and I will be building a new house. Our plan is to have the builder do the work up to the point where the house has been wrapped and the electrical and plumbing is completed, including the drywall.\n\nHow much per square foot do the wonderful folks here think this will cost?\n\nWe own the land, and we currently live in a house on the same land we will be building on. Which means we can live in our current house while the new one is being built. Which is pretty awesome.\n\n# NOTE: please write if you are giving prices in USD, as I live in Canada and I would need to convert the price. Thank you! :)",
        "num_comments": 7,
        "comments": [
            " north west ontario as in closer to Winnipeg? Provinces  are crazy big!",
            "You need to speak with local builders for a real answer. If you're serious, you'll have to do this anyways. Too many people come to this sub with unrealistic expectations of what this sub is good for. Perfect example of what this sub isn't good for! Good luck on your new home!",
            "The section of Ontario I'm in used to be apart of Manitoba. Northwestern Ontario us huge! Folks in the Northwest will travel to Winnipeg because it is our closest largest city.",
            "wow.. what industries are there?  just Oil?",
            "No oil here 🙂\n\nTourism, health care, social services, gold mining, a small fishing industry because of all the lakes, mining for other metals that can be used for the making EV batteries. I'm sure I missed a few...lol",
            "Why don't you want to say Kenora lol",
            "I estimate in USD  a small builder 225  square foot.\nYou'll basically end up with a shell \nI'm assuming the electrical just pulls in the electrical. Does not to the labor for the receptacles switches \nPulling the wires is pretty rapid but wearing"
        ]
    }
}