{
    "Daily Questions Megathread ( June 22, 2024 )": {
        "title": "Daily Questions Megathread ( June 22, 2024 )",
        "score": 0,
        "url": "https://www.reddit.com/r/HonkaiStarRail/comments/1dlqm92/daily_questions_megathread_june_22_2024/",
        "content": "Hi Trailblazers!\n\n⭐🚂 Welcome to the Daily Questions Megathread! Feel free to ask any general questions about Honkai: Star Rail that don't necessarily require their own dedicated posts.\n\nAny questions that can be answered rather quickly (i.e. anything that can be adequately addressed without any discussion or can be given definitive answers) can be asked in the thread below.\n\n\\>>> Example: Can my phone run this game?\n\nIf your question has discussion potential, please create a separate post, and include the “discussion” flair.\n\n\\>>> Example: What do you think of March 7th’s combat efficiency? Here's my opinion…\n\nBefore making new discussion posts, please be sure to consider if your question could be better suited to this thread!\n\nWhen both asking questions and sharing answers, be concise and detailed so other players can understand. Please maintain a stellar and respectful attitude toward others, and don't forget to share your appreciation to fellow trailblazers for helping you out!\n\nLooking for another Megathread? See the full list below: \n\n**>>> Weekly Megathreads**\n\n[Astral Express Lounge](https://www.reddit.com/r/HonkaiStarRail/search/?q=title%3A\"Astral%20Express%20Lounge\"%20author%3Amizuromo&restrict_sr=on&sort=new&t=week)\n\n>Hang out and talk! Discuss whatever you'd like with your fellow Trailblazers!\n\n[Weekly Gacha and Drops Megathread](https://www.reddit.com/r/HonkaiStarRail/search/?q=title%3A%22Weekly%20Gacha%22%20author%3Amizuromo&restrict_sr=on&sort=new&t=week)\n\n>Share your lucky (or unlucky) rolls on Warps and Relics!\n\n[Weekly Friend/ID Megathread](https://www.reddit.com/r/HonkaiStarRail/search/?q=title%3A%22Weekly%20Friend%20ID%20Megathread%22%20author%3Amizuromo&restrict_sr=on&sort=new&t=week)\n\n>Share your ID to make some friends or show off your E6 S5 4k atk 70/140 Seele!\n\n**>>> Monthly Megathreads**\n\n[Monthly Issue Megathread](https://www.reddit.com/r/HonkaiStarRail/search/?q=title%3A%22Monthly%20Technical%20Issues%20Megathread%22%20author%3Amizuromo&restrict_sr=on&sort=new&t=month)\n\n>Post issues you've run into and share solutions with your fellow Trailblazers!",
        "num_comments": 229,
        "comments": [
            "Hello Trailblazers! Please see below for some helpful links and other resources. \n\n[Subreddit Wiki](https://www.reddit.com/r/HonkaiStarRail/wiki/index/): Help acquaint yourself with the game, the subreddit rules, and the other official channels of Honkai: Star Rail!\n\n[HoyoWiki](https://wiki.hoyolab.com/pc/hsr/home): Official Resource domain, containing information about Characters, NPCs, Game Mechanics, Events, Enemies, and more. \n\n[Interstellar Map](https://star-rail-map.appsample.com/): A Detailed map of the worlds, containing chest locations, readable items, enemy locations, and more. \n\n[Leveling Calculator](https://act.hoyolab.com/sr/event/calculator/index.html#/home?target=Character): A tool to help you plan ahead for building Characters, resource management, and prefarming. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HonkaiStarRail) if you have any questions or concerns.*",
            "I might be the clown of the day. I got this sphere and thought \"Wow, you can't get anything better than this for Firefly\". Levels it up and turns out good. Proceeds to spend stellar jades to get Firefly.\n\nThen I check a guide for her and I see she needs an attack% sphere.\n\nWell, my question is this: if I use the fire dmg sphere instead of the attack% one, how big of a difference would that be?\n\nEdit: I checked and she doesn't even need crit stats... I'll just go put my clown make up on.\n\nhttps://preview.redd.it/9xeo4eoj538d1.png?width=1920&format=png&auto=webp&s=30baee1f7e895e51f75fd5cc1fa458c64f9e6860",
            "Does Trend work with Aventurine?",
            "For a team of Firefly, Trailblazer, Ruan Mei, and Gallagher, what’s the ideal amount of Spd tuning for each character for which ones to act first. I’m mainly unsure of the turn order since of the various buffs they provide and when they should be used.",
            "How do I change my title in my trailblazer profile? (you get titles in the new divergent universe for first time clearance.....)",
            "I ended up doing the equilibrium (trailblaze lvl 65) and now I can't do anything, I'm too weak, my story is practically locked because I can't even clear the 1st phase of aventurine boss, I don't know how to get stronger characters fast (I need firefly , I lost 50/50 and now I'm at 30 pity) need to gather those jades, HELP\n\nhttps://preview.redd.it/r7ihv21eb38d1.jpeg?width=1080&format=pjpg&auto=webp&s=913fdc3c55ee703756d9d5850a26077d26c9be6c",
            "does anyone have any idea when acheron might return? like the probable patch she could return?",
            "I don't know if this considered talking about leaks but looking at Jade's kit, is she good without having the other FUA character and support (aside from herta)?",
            "Just to be sure: you can't use items during battle in this game, correct?",
            "Please keep in mind our spoiler policy during this new update window. We are going to be very strict with spoilers during this time. As a reminder, here are our spoiler rules:\n\nDo not include spoilers in the title. All submissions which involve spoilers should be marked. Spoilers include all story content for the first three weeks after \nrelease.\n\nSpoilers can be discussed in spoiler-flaired posts, but must be hidden in non-spoiler flaired posts. \n\nIf you think you broke the spoiler rules in the post you just made, such as having spoilers in the title, you should remove your post now and repost it without \nbreaking the rules. If you do not remove your post and the moderation team has to remove it later on for breaking spoiler rules, you will be given up to a week ban \nfor a first infraction and stricter punishments for any additional infractions. Please be considerate of your fellow Trailblazers and do not include spoilers in the \ntitle of your post, do not forget to flair your post as spoilers if needed, and do not spoil people in your comments.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HonkaiStarRail) if you have any questions or concerns.*"
        ]
    },
    "Firefly Team Challenge Giveaway! 📢": {
        "title": "Firefly Team Challenge Giveaway! 📢",
        "score": 25,
        "url": "https://www.reddit.com/r/HonkaiStarRail/comments/1djxzlu/firefly_team_challenge_giveaway/",
        "content": "Attention all Trailblazers! \n\nIt has come to the Express's attention that with the recent release of Firefly, many Trailblazers are working diligently to put her abilities to the test! Now's your chance to show off your strategic prowess and snag **one of five Firefly merchandise packs!** \n\nJoin the Firefly Team Challenge and showcase your creativity and teambuilding prowess in Honkai: Star Rail!\n\n**How to Participate:** \n\n1. Build your best team composition featuring Firefly. Your team can include any characters you believe synergize well with her!\n\n2. In your reply, include a brief description of why you chose each character and how they might work well together. You might like the way their kits synergize, or maybe you just feel like they would work well together lore-wise!\n\n3. Make sure to include your Hoyoverse Account ID in your comment!\n\n*How do I find my HoYoverse Account ID? Go to* [*https://account.hoyoverse.com/#/account/accountInfo*](https://account.hoyoverse.com/#/account/accountInfo) *and find your \\[User ID\\].*\n\nPlease be aware that if you are selected as a winner and the provided AID in your entry is incorrect, your eligibility as a winner will be automatically revoked. \n\n**Challenge Duration:** \n\nKindly submit your entry before June 26, 2024 to secure your spot in the challenge. Winners will be announced within 10 days afterwards, so keep an eye out!\n\n**Rules and Guidelines:** \n\n1. While multiple submissions are allowed, please note that each person can only win one prize. \n\n2. Eligibility requires an active and well-regarded Reddit account. \n\n3. As always, ensure your submission aligns harmoniously with the subreddit's regulations. \n\n4. Any content of an inappropriate or offensive nature shall be disqualified without hesitation. \n\n5. Authenticity is of paramount importance; only original creations will be deemed worthy of consideration. \n\nBest of luck to all Trailblazers! ",
        "num_comments": 95,
        "comments": [
            "Just started the game last month after a friend told me there’s a mech character being added and I hoarded my stellar jade for her.\n\nI am currently running Firefly, Harmony MC, Gallagher, and Asta. Harmony MC to increase her break effects, Gallagher because he does fire damage and allows her to heal when she attacks (which she does often) and Asta because she also does fire damage and buffs speed to let Firefly attack more often.\n\nUID: 619048916",
            "The usual of course: Trailblazer, Ruan Mei, Firefly, and Gallagher because she deserves the best team with all of her teammates offering break effect, efficiency, dmg, and super break.\n\nMy User ID is 42143522",
            "My best team that helped me clear MOC 12 on full auto is composed of Firefly, Harmony TB, Gallagher, and Ruan Mei. I believe it's the best team composition because the AI can understand the synergy, which helped me clear MOC 12 on full auto. It's crucial to note that if the AI can build synergy, it means the team is well-suited for the task. Realistically, the other three characters enable quicker break effects, and Gallagher provides almost 100% uptime on the heal-on-hit effect, which was originally Luocha's specialty.\n\n  \nUID: 800964046",
            "A nonconventional team for people missing Ruan Mei (and who already went for mono quantum set ups) would be:\nFirefly, Harmony Trailblazer, Silver Wolf, and Fu Xuan.\n\nTrailblazer currently is a must have with Firefly boosting her damage by a ton via super break while boosting the break effect of the whole team. \n\nSilver Wolf for her debuffs/defense shred, pretty decent break efficiency, but more importantly a weakness implant of imaginary for HMC or Quantum for herself and Fu Xuan. This alleviates some cases where firefly is the only one that can do break damage depending on enemy variety.\n\nLastly Fu Xuan to keep everyone alive and having a debuff immunity buffer while keeping the variety of elements low for Silver Wolf's implant. Alternatively Gallagher will work just as well sacrificing sustainability for damage and sp generation as he's already fire element.\n\nHopefully this aids the Silver Wolf havers or those whom want to play something else besides the traditional FF, HMC, Ruan Mei, and Gallagher team!\n\nID: 101633822",
            "My best synergy team for firefly is herself, silver wolf, male harmony mc, and blade. \n\n\nThe reason firefly will work well with them because they're doing great working together in Penacony (silver wolf & blade), best stellaron hunter team for her. And finally male mc harmony is there for best skill synergy and best moral support for her.   \n\n\nMy hoyoverse ID 11488896, thank you.  \n\n\n*Edit grammar ",
            "For me it's Firefly, Trailblazer, Ruan Mei, Gallagher.  \nTrailblazer for boosting super break damage, Ruan Mei for boosting firefly speed to breakpoints and some shred res for super break damage and Gallagher because it's only sustain doesn't eat skill points (my firefly is c0) and break damage amplification.\n\nID:326166053",
            "Right now I'm using Ruan mei, Fu Xuan (until i can get Gallagher decently built to try him out), harmony trailblazer, and Firefly. All the break effect\n\nUID: 15816846",
            "I have Firefly, Harmony MC, Ruan Mei and Gallagher as a team!\n\nNot only they work well, I just really want Firefly and TB as a pair, and apart from Ruan Mei I never tried to play Gallagher yet and I really wanna do a team with the Super Break mechanic. Interaction wise I think Firefly wouldn't expect to be in a team like this!  \nMy hoyo id is 600741769",
            "My synergy team will be Firefly, Caelus, Topaz and Fuxuan\n\nThe reason I chose this is because I ship firefly and Caelus and they worked well together in penacony. I chose topaz as she has one of my favorite designs and Fuxuan to solo sustain. Topaz can also be a great team moral supporter for team. (this is a team composition for fun) \n\nID : 808544201",
            "Gallagher, Firefly, Trailblazer (Harmony), Robin\n\nAll are characters that debut during the Penacony arc and has interacted with Firefly! Firefly holds amicable friendships with Robin and Trailblazer. Gallagher might have been a questionable character during a part of the story but he was able to collaborate for Firefly later. Gallagher can sustain (while also improving break effect for Firefly) while Robin and Trailblazer provide a helping hand for the team, enabling further damage and super break.\n\n I also think this team is suitable for having a party! Robin brings the music and sings, Trailblazer dances, Firefly is the cheerleader and watcher from the audience and Gallagher brings the snacks. This team is suitable for gameplay and lore as well n.n\n\nID: 19602446"
        ]
    },
    "what men want": {
        "title": "what men want",
        "score": 3616,
        "url": "https://i.redd.it/i055mrzxo08d1.png",
        "content": "",
        "num_comments": 78,
        "comments": [
            "&#x200B;\n\nhttps://i.redd.it/jbs0r8vpr08d1.gif",
            "https://preview.redd.it/bx84kr99g18d1.png?width=733&format=png&auto=webp&s=53d210a01a66a254e8aa6c8e4b65efcb520c07c3",
            "https://preview.redd.it/hgdgnx8rv08d1.png?width=1139&format=png&auto=webp&s=fa684055f50a5a0b9721fc769767dd9a517b7fd0\n\nsparkle fumo png, get your sparkle fumo png here\n\n[pixiv](https://www.pixiv.net/en/artworks/119856370) | [twitter](https://x.com/l_unaSy/status/1804309575556043227)",
            "https://preview.redd.it/q8r9toyll18d1.jpeg?width=964&format=pjpg&auto=webp&s=7a06ae4b1d9ab189b28ef5c02b89e2576ab8128d",
            "https://preview.redd.it/wvxszkbs318d1.jpeg?width=480&format=pjpg&auto=webp&s=ee387005bba1a35fb7bfaa65d6e37f2e0c7344ee",
            "https://preview.redd.it/f340jloq618d1.png?width=1535&format=pjpg&auto=webp&s=5e5ffe1940299aa3f0bfecd52062d7136cdc78f4",
            "I would absolutely love a plushie. Hoyo, please make a plushie. You would sell millions.",
            "\"Front facing Sparkle plush isn't real, she won't make your mailbox explode\"\n\nFront facing Sparkle plush:\n\nhttps://preview.redd.it/igo0s1e3k18d1.jpeg?width=626&format=pjpg&auto=webp&s=f4f11ab682d1d9b9776f7c4d48d13fdcfbdd5827",
            "https://i.redd.it/su5olkttc18d1.gif\n\nIm having a brainrot every time i see fumo Sparkle",
            "https://preview.redd.it/qvv4o4s2q18d1.jpeg?width=1170&format=pjpg&auto=webp&s=da143b1991ebfb5fdc3df40ad3f7f071f49399ac"
        ]
    },
    "What did he say?": {
        "title": "What did he say?",
        "score": 1402,
        "url": "https://i.redd.it/igmht1dty18d1.jpeg",
        "content": "",
        "num_comments": 165,
        "comments": [
            "https://preview.redd.it/cr9lr0nb828d1.png?width=2127&format=pjpg&auto=webp&s=e4fcfc24d5722c0f29d13fee40e1426575e5ac4e",
            "https://preview.redd.it/5ljdh1c5f28d1.jpeg?width=1080&format=pjpg&auto=webp&s=2eb7bfd318cfbc122ed5daf2ffa94db9408aa3a9\n\nBRUH",
            "\"Hey you got me from the 50/50\"\n\nhttps://preview.redd.it/ktov9u64d28d1.jpeg?width=1280&format=pjpg&auto=webp&s=0ca58dcf0e5eba472d0b83ae209793a0635445af",
            "\"Nah, I'd win.\"\n\n\"Against me? No, you wouldn't!\"",
            "Step on me",
            "my sword is bigger",
            "I'M F\\*\\*KING INVINCIBLE!!!",
            "\"2.3 was a filler patch\"\n\nNo seriously people have said it",
            "\"can I smell your feet\"",
            "https://preview.redd.it/jql2kbt2t38d1.jpeg?width=828&format=pjpg&auto=webp&s=b2bfbccc9d6c87ec0c0ea4b668b6312e68e02fb6\n\nI got this advert underneath this post 😭🙏🏼"
        ]
    },
    "Not again, Silver Wolf... (@NueBunny)": {
        "title": "Not again, Silver Wolf... (@NueBunny)",
        "score": 1085,
        "url": "https://i.redd.it/6h1ceb7u228d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Silver wolf said the gamer word too many times, she’s going to outpace Balde",
            "https://preview.redd.it/kn9nl29at28d1.png?width=1590&format=png&auto=webp&s=66da389a2993e86d8c4b3b5440de8ac83e3be2bc",
            "**Source**: [https://twitter.com/NueBunny/status/1804093695005987007](https://twitter.com/NueBunny/status/1804093695005987007)\n\nThis one hits close to home.\n\nYou said \"GG\"?! PERMABANNED!\n\n/s",
            "SW vs Acheron but SE just lost 10 ranked matches back to back, who wins",
            "Please keep in mind our spoiler policy during this new update window. We are going to be very strict with spoilers during this time. As a reminder, here are our spoiler rules:\n\nDo not include spoilers in the title. All submissions which involve spoilers should be marked. Spoilers include all story content for the first three weeks after \nrelease.\n\nSpoilers can be discussed in spoiler-flaired posts, but must be hidden in non-spoiler flaired posts. \n\nIf you think you broke the spoiler rules in the post you just made, such as having spoilers in the title, you should remove your post now and repost it without \nbreaking the rules. If you do not remove your post and the moderation team has to remove it later on for breaking spoiler rules, you will be given up to a week ban \nfor a first infraction and stricter punishments for any additional infractions. Please be considerate of your fellow Trailblazers and do not include spoilers in the \ntitle of your post, do not forget to flair your post as spoilers if needed, and do not spoil people in your comments.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HonkaiStarRail) if you have any questions or concerns.*",
            "Hey Trailblazer! We see that you posted this with the Non-Original Content flair. Please note that all Non-OC **MUST** include the name of the artist in the title, and a link to the artist's social media should be included in a top-level comment. Please verify that your post follows these rules. If it does not, please delete your post and resubmit it while following those rules. If you do not do this and the post is ultimately removed for breaking Non-OC rules, you may be subject to a ban. Please note this is also only for art posts. Videos and screenshots should be flaired as \"Media\". \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HonkaiStarRail) if you have any questions or concerns.*",
            "Stellaron Hunter Cyborg Trooper: \\*inner monologues\\* HOW STUPID IS SHE!?",
            "&#x200B;\n\nhttps://preview.redd.it/08jrbov9o28d1.png?width=675&format=png&auto=webp&s=94dd35cfe7f73d7fe20747240312c072a4f3c240",
            "Oh fuck this isn’t the buddy sub",
            "Poor arl\\*n"
        ]
    }
}