{
    "Weekly Discussion: Watchlist Wednesday": {
        "title": "Weekly Discussion: Watchlist Wednesday",
        "score": 5,
        "url": "https://www.reddit.com/r/horror/comments/1djilyd/weekly_discussion_watchlist_wednesday/",
        "content": "Welcome to Watchlist Wednesday! \n\nDive into the horror discussions by sharing your top picks of the week, from classics to hidden gems. Explore new titles and swap recommendations with fellow horror enthusiasts. Uncover the next chilling thrill together! \n\nAs always, be sure to use spoiler tags if necessary.",
        "num_comments": 15,
        "comments": [
            "Any recommendation of supernatural horror movie from middle east? I've already watched Under The Shadow, Dhabbe, Siccin.",
            "I watched Arcadia this week. Really enjoyed it, the monster design was really unique and creepy.\n\nAlso watched I Saw the TV Glow. I thought this was going to be more of a horror film than it is, it's really more of an artsy indie vibe exploring escapism and sexuality/gender dysphoria. Not particularly suspenseful but it is a great movie nonetheless.",
            "I saw infested a few days ago, it’s about spiders taking over an apartment building. Honestly pretty solid movie 8.5/10",
            "The Outwaters - this is a found footag Blair Witch wanna be. A group of young folk go out into the desert and cosmic horror strikes. Watchable but weird pacing and barely a story.",
            "I just finished The Witch with Anya Taylor-Joy. Really enjoyed it! Much better than I expected, actually.",
            "I rewatched Friday the 13th Part 2 and 3. Part 2 has the best character of the series: Ginny, and I do wish that she appeared again. The rest of the film is pretty good, but standard. Part 3 I felt nothing, but it was pretty funny to see how cliched the film is. It is ultimately boring tho, which I knew going in, but people convinced me to watch it \"because it has the best final chase in the franchise\". It did not have the best final chase in the franchise.",
            "Anyone else watching the new British series, *Insomnia*? It was slow at first, but now I'm glad I stuck with it. \n\n\nSynopsis:\n>Successful career woman Emma Averill fears that she is losing her mind as her hard-won lifelong dream begins to turn into a nightmare, forcing her to do everything she can to prevent it from collapsing around her.",
            "I watched Saw X and I somehow had high expectations, but more surprisingly it didn't disappoint. Tobin Bell was on screen most of the movie and that's probably the main reason. Minor gripes with minor spoilers:\n\n>!The villains would have been better off getting real jobs. For the amount of effort and the risk, plus the damage they were causing people, it was hard to believe that their scam could have been profitable enough to be worth it. Towards the end the main lady says that she's happy she won't have to split the cash now, she's got a bag of money and it would seem she never paid her associates. I was annoyed that she got the easiest game even though she was the mastermind of the scam.!<",
            "Be My Cat: A Film for Anne - really liked this. Small budget, docu style \"filmed\" by the main character. The writer/director is working on a trilogy and I look forward to watching those. It's just a fun time.\n\nGreat rec if you like Creep (the one with the videographer, not the subway one).",
            "I just watched a found footage movie called the butterfly kisses and I must say my mind was blown. A fairly unique concept around the whole premise of the found footage genre, and with the ambiguity and confusion created to divert the audience is great in the movie and the ending was well done too. Overall a soldi 9/10"
        ]
    },
    "Official Dreadit Discussion: \"The Exorcism\" [SPOILERS]": {
        "title": "Official Dreadit Discussion: \"The Exorcism\" [SPOILERS]",
        "score": 9,
        "url": "https://www.reddit.com/r/horror/comments/1dl57vp/official_dreadit_discussion_the_exorcism_spoilers/",
        "content": "**Summary:**\n\nA troubled actor begins to unravel while shooting a horror film. His estranged daughter wonders if he's slipping back into his past addictions or if there's something more sinister at play.\n\n**Director:**\n\n* Joshua John Miller\n\n**Producers:**\n\n* Kevin Williamson\n* Ben Fast\n* Bill Block\n\n**Cast:** \n\n* Russell Crowe as Anthony Miller\n* Sam Worthington as Joe\n* Ryan Simpkins as Lee Miller\n* Chloe Bailey as Blake Holloway\n* David Hyde Pierce as Father Conor\n* Marcenae Lynette as Monica\n* Tracey Bonner as Regina\n* Samantha Mathis as Jennifer Simon\n* Adrian Pasdar as Tom\n* Adam Goldberg as Peter\n\n  \n**-- IMDb:** 4.7/10\n\n**Rotten Tomatoes:** 32%",
        "num_comments": 17,
        "comments": [
            "I watched this a few days before release on Scream Unseen. It started promising but they really did drop the ball in the third act.",
            "Russell Crowe in another exorcism movie? Didn't I just see him on a vespa?",
            "This wasn't very good. Some story elements had potential, but the script never came together in a cohesive way. There was no tension to keep my attention. The actors did their best, but it wasn't enough to salvage this from being a slog. I'd reccommend skipping this one.",
            "This movie made 0 effort to tie anything together cohesively but had a few fun moments. It was not as bad as people are making it out to be if you can turn your brain off during it. The writer wanted to make a movie about alcoholism and used the demon possession stuff to represent how suppressing your feelings and trauma can affect the people around you. Predictable horror movie but worth a watch if you're bored.",
            "I thought the first half of the film was excellent. It wasn't clear what was going to happen, but it was genuinely scary for awhile (although it relied a bit more on jump scares and loud noises than I like). The music was really solid.\n\nI think leaning into the struggling alcoholic trope gave it a cool The Shining sort of vibe. I also liked the meta plot pointing at The Exorcist, which reminded me of Wes Craven's New Nightmare (which I thought was actually pretty scary, for a Nightmare on Elm Street movie).\n\nUnfortunately the plot didn't really pay off or go anywhere interesting. >!The characters didn't react to absurd situations in ways that made any sense (Russell Crowe bent over backwards in an impossible way and smashed his face into a table, then murdered someone, and they...sent him home with his teenager daughter?). I still don't understand the childhood trauma that happened to Russell Crowe either.!<\n\nStill better than The Pope's Exorcist.",
            "Pretty large pile of shit. \n\nLove some schlocky Russell Crowe (See The Pope's Exorcist or Land of Bad) but this was basically irredeemable, some baffling directing choices, very little actual horror. David Hyde Pierce is solid at least and the premise of Crowe's character is interesting but doesn't really pay off in a meaningful way. \n\n1.5/5",
            "I didn't realize that the director is Jason Miller's son (and Jason Patric's half brother).  That makes it a more interesting idea.",
            "It's been a while since I've seen a film this dull. Or this dark. Not in terms of tone. Just in terms of lighting. It's got a dark tone too. I think. Hard to tell. Couldn't really see what was happening on screen about 60% of the time. \n\nI want to blame it being so dull on the fact that it was just being a string of clichés but I don't think that's the root cause. I mean, that's true-- this is a fully derivative film in every respect-- but so are lots of things and they're not as big of a drag as this film is. Scientists should study this, because it really was so dull that it almost crossed the line into being fascinatingly experimental in how phoned in and bland something could be and still technically qualify as a \"film\"... but then... it didn't.\n\nI wish the power of Christ had compelled the writer/director/producers to do something more interesting than this.",
            "Why did the priest sacrifice himself at the end?\n\nAnd who did Adrian Pasdar play?",
            "I love Russell Crowe movies, but this was pretty bad. A lot of the scenes tried building tension, but almost every one of them just went on way too long and delivered little payoff.   \n\nPlus, while the ideas might have been interesting (filming an exorcist horror movie, main lead getting abused/molested[?] in childhood and consequently struggling to face that trauma while filming), the execution of making them into a cohesive plot felt incredibly disjointed.  \n\nAlso, Sam Worthington and Adam Goldberg were insanely underutilized throughout the whole movie. I especially would have loved to see Goldberg’s dickhead producer character get a deserved comeuppance for constantly berating Crowe’s character.  \n\n2/10.  \n\n If I wanted to watch a demonically-belligerent Russell Crowe, I would have watched him sailing around the world on a tugboat finding cancer-ridden children to fight."
        ]
    },
    "Just watched The Autopsy of Jane Doe.....": {
        "title": "Just watched The Autopsy of Jane Doe.....",
        "score": 174,
        "url": "https://youtu.be/mtTAhXuiRTc?si=iLsI7gnj1RFeblFT",
        "content": "I kept hearing it's a very scary film. I enjoyed it's direction, makeup and performances from Brian Cox and Emile Hirsch, but other than that, it wasn't scary, like...at all. Maybe it's just me and anything that can happen in real life scares me. This was a little ridiculous. Thoughts?",
        "num_comments": 56,
        "comments": [
            "It's more of an atmosphere/tension sort of scare I think, instead of a jump or a visual or a concept you can't get out of your head",
            "I love this movie. I love the dread, the tension, the slow build and the gradual reveal of what's truly going on.",
            "Not super scary, but still a fantastic film. It felt like an X-Files episode, which is always a plus in my book.",
            "A great example of straightforward, fairly basic premise elevated through execution. I thought it was great and even my wife enjoyed it.",
            "I thought it was pretty terrifying ngl, especially towards the third act when they found out the truth. Besides that, i think it's more gory and disgusting because it deals with organs, dissection and etc...\nBut this movie still remains as my biggest suprise. 5/5",
            ">!Atmosphere, setting, sadistic manipulation and cruelty, human puppets on strings—everything I look for in a good witchy movie! I really like it.!<\n\n>!A bit like *The Blair Witch Project (1999)*, the events at the centre of *The Autopsy of Jane Doe*, the ones people tend to focus on—the flashing lights, power failure, paranormal activity, corpses re-animated, the \"accidents\" that happen in the funeral home—are all a diversion; the real underlying story—the mystery of the dead woman—is right there on the mortician's slab, hidden in plain sight, and beautiful Jane Doe herself doesn't have to move a muscle to tell it, she enjoys leaving that kind of work to others.!<",
            "I didn’t find it scary but it’s still a great horror movie.",
            "I just watched this for the first time a few days ago. I thought it was cool the way it was like a mystery movie that unraveled into a horror movie.  \n\nI don’t know, trying to say things were or weren’t scary is kind of a subjective mess to deal with and quantify.  I thought it was a good movie, it felt like horror should feel to me.",
            "One of favorites! I first saw it a few years ago during the rona lockdowns, and it was one of the only movies to actually *scare me* in years, and my oft-horror-hating partner loved it. I love how it takes place in a single location and how much spookiness is conveyed by the actress' facial expressions and body manipulations. Plus Emile Hirsch is *so* good. I wish he'd do more horror! Just an awesome movie, glad it has been getting the love it deserves the last few years.",
            "This is actually one of my favourite recent horror films. I think it was beautifully executed and had me in a chokehold throughout the whole film. The atmosphere is so uncomfortable and tense. It was one of those few movies that didn't leave me with a \"Meh, was alright\" but a \"Woah, that was great\". Shame you didn't enjoy it as much :("
        ]
    },
    "Why some brains like horror movies": {
        "title": "Why some brains like horror movies",
        "score": 240,
        "url": "https://www.verywellmind.com/why-do-people-like-horror-movies-5224447",
        "content": "I recently watched a video and read some articles  that try to explain why some brains are attracted to scary movies and they go from the adrenaline rush (someone called us sedentary adrenaline junkies!) to the sense of accomplishment and survival once it's over. Maybe even morbid curiosity. What do you think is the reason you like horror movies? ",
        "num_comments": 100,
        "comments": [
            "The primary reason I watch horror instead of other genres when given the choice - horror really doesn’t have any rules, and I’ve seen so many fantastic horror movies made on a shoestring budget and are at the very least interesting\n\n But, it’s basically because - if I watch an action movie, more or less, I know what’s going to happen.  A drama or romance etc generally have like 2 or 3 ways they’ll “play out” once you hit Act 2.\n\nA horror movie may not even really show you what is going on until the end of Act 2.  It may change protagonists, it may change location abruptly and other options that typical genre films don’t have\n\nIt’s the unique aspect of horror that gets me to watch more of it than other genres\n\nThen if it manages to be truly unsettling or crazy, then, awesome.  But mainly here for the unique stories that typical genre films just can’t do.",
            "It's an escape mechanism for me. I'm a survivor of CSA and Horror has always been a good way for me to experience positive anxiety, knowing it's not real and will definitely end rather than the actual horror of my memories and the stress associated with it. \n\nIt's also a family thing for me, going back generations. Grandpa, Dad, me and my girls all love nothing more than a great horror movie all together, from gory or scary af, cheesy low budget and ridiculous dialogue or a mindbending psychological scare fest, we love it all.",
            "I have a special interest in death and related topics",
            "I put it down to being a sick fuck",
            "I like seeing what sick twisted shit some producers are capable of imagining.",
            "Honestly I just think the storytelling of other story arc types are boring. Horror has always been the style that actually keeps my attention and makes me want to read/watch it",
            "Seeing people go through the most fucked up stuff in a safe controlled environment makes me feel somewhat ok with (burden to some gift to others) life",
            "I’ve always said I like comedies and horror the best, and I feel like they’re two sides of the same coin, but it wasn’t until Jordan Peele talked about it that I felt like I could really explain it to people. He said the buildup is the same - you do the setup, and then subvert expectations. I thought that was so interesting. I want to be surprised. \n\nI agree with another poster, romance especially is so formulaic, I find it generally boring. I sometimes like drama, but usually I don’t want to feel my heart hurting from sadness because of what I’m watching. \n\nObviously, especially lately, there’s been more horror that digs into trauma and tragedy (Ari Aster for one), and I do enjoy those movies but I still mostly want to enjoy horror movies to be scared. I can be fully engrossed (hard to be half paying attention to horror), have some fun, be surprised if I’m lucky, and hopefully not get my heart beaten to a pulp.\n\nEdit: sorry, I thought it was OP who talked about other genres and their formulas.",
            "I find the controlled fear grounding; it can soothe my anxiety like almost nothing else.",
            "I have such a silly reason: my birthday is very close to Halloween so anything spooky, horror, Fall, Halloween-themed is like comfort food."
        ]
    },
    "Best horror movies that a devoted horror fan has probably not yet seen?": {
        "title": "Best horror movies that a devoted horror fan has probably not yet seen?",
        "score": 466,
        "url": "https://www.reddit.com/r/horror/comments/1dl7qhy/best_horror_movies_that_a_devoted_horror_fan_has/",
        "content": "Which movies do you think are, borderline defining, of the horror genre, yet they are the most probable to have slipped from your typical \"horror afficionado\"?\n\nFor example, my favorite subgenre is found-footage, but I only recently discovered \"Hell House LLC\", which I can safely say is a great representative of the genre.\n\nWhat are your picks that you believe are almost unanimously considered great horror films, but have probably evaded many horror fans, due to distribution/release timing/language e.t.c.?",
        "num_comments": 599,
        "comments": [
            "Dead & Buried",
            "I feel like **Dust Devil** doesn't get mentioned nearly as often as it should be, but I don't know if that's because people who have seen it had the misfortune of watching one of the truncated versions rather than the director's cut and so write it off as crappy.\n\nAlso, **Dellamorte Dellamore** aka **Cemetery Man** seems weirdly slept-on.",
            "Absentia!",
            "A personal pick that I think is great and made me stressed is the FF movie “Final Prayer” (or its other name: The Borderlands) from 2013.\n\nEdit: fixing the alternate title.",
            "Not that it’s super unknown, but Frailty (2001) is one that flies under the radar for a lot of horror fans.  Very dark and disturbing, but really well done and Bill Paxton did a great job starring and directing.",
            "November (2017) Kanopy/NightFlight  \n\nMagic (1978) Amazon prime/AMC+/Peacock - an early Anthony Hopkins film.\n\nThe Little Girl Who Lives Down the Lane (1976) Amazon prime/Tubi - an early Jodi Foster film.\n\nBedevilled (2010)  Plex \n\nAutohead (2016) \n\nThe Sentinel (1977) Amazon *rent*\n\nThe Entity (1982)\n\nThe Ninth Configuration (1980) Amazon prime/Tubi/Kanopy",
            "The Pact (2012)",
            "Let's Scare Jessica to Death\n\nScream of Fear\n\nJug Face \n\nGlorious \n\nA Lizard in a Woman's Skin",
            "- Chaser (South Korea) is a cat and mouse movie as the title implies. So much tension from beginning to end\n\n- Mockingbird (pretty sure this is the first film of Bryan Bertino who directed The Strangers and The Dark and the Wicked). It's found footage.\n\n- Crimes of Passion - a Ken Russell film starring Kathleen Turner and Tony Perkins about a killer prostitute. The whole vibe and look of this movie is so cool\n\n- Son - this might have been straight to Shudder but it's great. Different people are trying to abduct a little boy and you spend the movie trying to figure out their motives. Turns what you think you know on its head.\n\n- The Feast - mother nature takes her revenge and it's fucked up\n\n- ATM - 3 friends are trapped in an ATM kiosk late at night with their would be killer standing outside. The walls are glass. What to do?",
            "The nameless.... \nPsychedelic Hooror\n\nand all the alex.de la Iglesia movies :\nEl Dia de la bestia\nAccion Mutante\nBest Fun-Horror like Return of the living dead"
        ]
    }
}