{
    "Official Dreadit Discussion: \"A Quiet Place: Day One\" [SPOILERS]": {
        "title": "Official Dreadit Discussion: \"A Quiet Place: Day One\" [SPOILERS]",
        "score": 31,
        "url": "https://www.reddit.com/r/horror/comments/1dputpk/official_dreadit_discussion_a_quiet_place_day_one/",
        "content": "**Summary:**\n\nA Quiet Place: Day One is an upcoming American apocalyptic horror film written and directed by Michael Sarnoski, based on a story he conceived with John Krasinski. It serves as a spin-off prequel and is the third installment in the A Quiet Place film series. \n\n**Director:** \n\n* Michael Sarnoski\n\n**Producers:**\n\n* Michael Bay\n* Andrew Form\n* Brad Fuller\n* John Krasinski\n\n**Cast:**\n\n* Lupita Nyong'o as Sam\n* Joseph Quinn as Eric\n* Alex Wolff as Reuben\n* Djimon Hounsou as Henri",
        "num_comments": 109,
        "comments": [
            "The heartwarming tale of a depressed, terminally ill woman whose life is turned around when she adopts a stray business man off the streets.",
            "Just saw a screening of it. Was pretty good and self-contained. It added just a bit more lore to the monsters themselves. Was fun throughout!  Only thing more unrealistic about the movie than aliens from outer space, was just how quiet the cat was. My cat would have gotten me killed within the hour.",
            "They added a sprinkle of lore about the aliens. Was hoping for more.\n\nHoping the video game adds more",
            "Loved the movie and cried at the end but did anyone else wish they had subtitles when they were whispering? With Erics accent during the rain scene it was so loud I couldnt hear what he said lol",
            "I thought it was a well done movie. I think New York would look like this one day after an invasion. Scenes have a lot of tension, but did not care about the jump scare. Sam and Eric have a lot of chemistry and the cat is cute.\n\nThe only thing I didnt understand is what is wrong with Sam? What disease does she have?",
            "this had me wondering who'd win between a xenomorph and a quiet place alien. do we have an official term for them?",
            "I couldnt help but be distracted at the cat being barely  wet after being submerged in water TWICE",
            "I really enjoyed it. I didnt see a ton of trailers or reviews so was pleasantly surprised that they did a good job of amping up the aliens while also still having the heart of the first one. Probably not for everybody but I hope it makes a good chunk of change.",
            "I was surprised by how much I liked this.  I've not seen the other films and am not a fan of apocalyptic horror in general, but the theater had AC, so...  Great performances all around -- especially from Lupita Nyong'o, Joseph Quinn, and the cats (Schnitzel and Nico ) -- and a lot of heartfelt moments that had me tearing up a little.  The scenes with the creatures were the parts I liked least, though, so I think it falls a little short on the horror front.",
            "Ngl, I kind of wished the entire movie took place from the perspective of animals/the main cat. That would've been soooo cool. Almost like a horror Homeward Bound."
        ]
    },
    "I'm lowkey horror icon Lindsey Haun AMA": {
        "title": "I'm lowkey horror icon Lindsey Haun AMA",
        "score": 60,
        "url": "https://www.reddit.com/r/horror/comments/1do8aam/im_lowkey_horror_icon_lindsey_haun_ama/",
        "content": "Hi! \n\nI'm Lindsey Haun. I was a child actor (you may know me as the leader of the evil children in John Carpenter's *Village of the Damned* or the little racist white girl who overcomes her racism in *The Color of Friendship*), Disney Movie Surfer, and then a grown-up actor who did a lot of horror (I was in *Shrooms* and on *True Blood*). \n\nI'm also a musician, and for a while I was on a national label and toured with Toby Keith. I just directed my first feature film, a comedy-horror movie called *Hanky Panky* that you can now stream for free on Tubi. Ask me anything!\n\nPROOF: [https://www.instagram.com/p/C8nIWZYsF7g/](https://www.instagram.com/p/C8nIWZYsF7g/)\n\nHere are all my credits: [https://www.imdb.com/name/nm0369424/ ](https://www.imdb.com/name/nm0369424/)\n\nSee me on Instagram: [https://www.instagram.com/lindseyhaun](https://www.instagram.com/lindseyhaun)\n\nListen to my solo album on Spotify: [https://open.spotify.com/album/5NRAgxC3qOCMnnxBndt5NI](https://open.spotify.com/album/5NRAgxC3qOCMnnxBndt5NI)\n\nCheck out my new movie, Hanky Panky: [https://hankypankythemovie.com/](https://hankypankythemovie.com/)",
        "num_comments": 42,
        "comments": [
            "Cant believe you left out your iconic role in Addams family.\n\nWhat drove you to make Hanky Panky your directorial debut?",
            "Whats your favorite movie you've been in and why is it Shrooms?",
            "Watching Brave New Girl is a core memory! Did you get to meet Britney Spears?",
            "Congrats on your movie release! Pretty cool you got Seth Green to do a voice over. I'll definitely give it a watch.\n\nRIP Toby Keith.",
            "Any key take aways from working with John Carpenter that you brought to your work in hanky panky?",
            "Did you get to meet dick van dyke? How was that?",
            "Wait..I love Shrooms - the movie- let me check this out!",
            "Will you be in any future projects?",
            "I'm an independent filmmaker myself, I've been having a ton of issues getting actors to commit to my films for the past few years. Do you have any advice for that?",
            "How was it transitioning from Disney roles to more mature roles? Did you ever feel the same good girl image that other Disney alums had?\n\nAlso I wanted to be a movie surfer so bad! What were those scenes like? Did you get to see movies before they came out?"
        ]
    },
    "Did anyone else find grizzly man deeply unsettling, no film has freaked me out quite like it, it's been 9 years and I still feel uncomfortable about rewatching it": {
        "title": "Did anyone else find grizzly man deeply unsettling, no film has freaked me out quite like it, it's been 9 years and I still feel uncomfortable about rewatching it",
        "score": 602,
        "url": "https://www.imdb.com/title/tt0427312/?ref_=ext_shr",
        "content": "",
        "num_comments": 155,
        "comments": [
            "Him and his GF getting eaten alive by a bear is absolutely unsettling. Seems very reasonable to feel that way.",
            "I think the most disturbing part was his actor friend who was clearly going for an Oscar when talking about Timothy. Not really the time and place.",
            "Grizzly Man and Into the Wild were both powerful films to me when they came out, but now they just make me mad. Guy makes a bad decision, everyone tells them this bad decision will kill them, guy does it anyways, guy dies. Great story.",
            "I saw \"Wedding Crashers\" accidentally. I bought a ticket for \"Grizzly Man\" and went into the wrong theater. After an hour, I figured I was in the wrong theater, but I kept waiting. Because that's the thing about bear attacks, they come when you least expect it. - Dwight Schrute",
            "Oh its incredibly unsettling. You watch him in the videos and hes talking about how friendly the bears are and you know what happened to himits intense.",
            "My grandma put this on for a movie night with me and my cousins during a sleepover when I was about seven years old. It fucking terrified us. We had to check under my bed and in my closet every night for a month to make sure there were no grizzlies around ",
            "The horror is that they had to kill two grizzly bears because of this chucklefuck.",
            "I never thought of it as horror, but it is definitely disturbing so I can see how someone would. I work in the environmental field, and people like Tredwell who romanticize nature do just as much destruction because they encourage this sorta stuff. I feel angrier about that Into The Wild movie though. A lot of people went out and died trying to find that stupid bus.",
            "Yeah it gave me a very sick unsettling feeling after watching it.\n\nJust imagining the terror they had to be going through, and the girlfriend staying there trying to help Treadwell for an extended period of time instead of trying to run somewhere.",
            "It's because not only the dead are odd people, also the living ones in the doc are very unsettling too. The coroner and the director creeper me out so much."
        ]
    },
    "What horror movie has filled you with the most dread while watching it?": {
        "title": "What horror movie has filled you with the most dread while watching it?",
        "score": 983,
        "url": "https://www.reddit.com/r/horror/comments/1dqo773/what_horror_movie_has_filled_you_with_the_most/",
        "content": "I just finished watching The Coffee Table and I think it takes the number one spot, although that might be recency bias. I felt a knot in my stomach the entire time and had to leave my screen and pace around giving myself a pep talk to continue at multiple points.\n\nWhat are y’all’s picks?",
        "num_comments": 1184,
        "comments": [
            "Funny games 1997. The whole egg scene was so disturbing. The entire movie was just awful in the sense that I felt miserable the entire time.",
            "Can I cheat and say Chernobyl on HBO?\n\nIve never felt more dread in my entire life than in the first few episodes of that show. Highly recommend it lol",
            "Eden Lake and The Dark and the Wicked were pretty dread inducing.",
            "The original Blair Witch Project. Well, particularly the final 5 minutes the original Blair Witch Project.\n\nWatched it back when it first hit vhs. I was alone in my room in the dark. It's silly, but I remember kinda just sitting there a minute, not really wanting to get off of the bed. Lol",
            "As Above So Below was super anxiety inducing through most of the film.  I also have a huge phobia of being underground so I am sure that added to it.",
            "It Follows - I couldnt trust any person on the screen.\n\nSurprisingly, Smile had that same effect on me",
            "I'm a big horror fan but Stephen King's 1408 is the ONLY movie that gives me nightmares EVERY time I watch it.",
            "Climax by Gaspar Noe\nHoly shit that film is intense",
            "The first half of Barbarian. IMO it is the greatest example of tension building I've ever seen. I was just wondering when the other shoe was going to drop and what was going to happen",
            "I havent heard of The Coffee Table now Im intrigued"
        ]
    },
    "What are some good Satanic or cult-themed horror movies?": {
        "title": "What are some good Satanic or cult-themed horror movies?",
        "score": 115,
        "url": "https://www.reddit.com/r/horror/comments/1dr104c/what_are_some_good_satanic_or_cultthemed_horror/",
        "content": "I love horror movies that revolve around occultism in some way. My all-time fave is The Witch, and I also really enjoyed The Ritual, Midsommar, Hereditary, As Above So Below and Deliver Us From Evil. I’ve been meaning to watch Late Night with the Devil and the Blackcoat’s Daughter. Are there any other films I should add to the list?",
        "num_comments": 185,
        "comments": [
            "How has The Wicker Man (the 70s version, not the Nick Cage one lol) not been mentioned yet?! It definitely inspired Midsommar and the slightly off putting vibes are beautiful and immaculate. One of my faves!",
            "A Dark Song is an amazing portrayal of a specific series of occult rituals, super underrated flick.",
            "Kill List\n\nHouse of the Devil",
            "If you want something funny and kinda.dumb, *Satanic Panic* is a great one. I really enjoyed it.",
            "Race with the Devil (1975)",
            "The Lords of Salem (2012)",
            "Funny because my wife and I literally just finished The First Omen, and I can definitely recommend that.",
            "The House of the Devil (2009)",
            "Check out The Devil's Rain. Shatner. Borgnine. Travolta. Skerritt It's got all the ingredients.\n\nAlso check out Angel Heart, The Omen, Rosemary's Baby, Blood on Satan's Claw and The Black Cat.",
            "The Devil Rides Out starring Christopher Lee."
        ]
    }
}