{
    "Game-related Questions Thread: v7.5 Update": {
        "title": "Game-related Questions Thread: v7.5 Update",
        "score": 9,
        "url": "https://www.reddit.com/r/houkai3rd/comments/1d9dqkg/gamerelated_questions_thread_v75_update/",
        "content": "Welcome to Honkai Part 2, Captains!\n\n&#x200B;\n\nIn this thread, any and all questions about the game that can be addressed with a direct or single answer, especially if they involve your own gameplay, account and/or future investment plan, should be asked in here and here alone.\n\n**Please always start your question post by specifying which server you play in (e.g. SEA, Global, JP, CN, TW/HK/MO, KR), and your Captain Level**. \n\nYou may also include other information which may help veterans give more specific and tailored advice if you're asking for such (eg: spending tips or in-game goals you want to achieve).\n\nCheck the thread to see if your question has been asked already, and refrain from asking questions regarding future content as they are always subject to change, especially regarding upcoming banners as no one ever knows for sure.\n\nAlso see the pinned post for helpful links, as your question may be addressed there too.\n\n[Previous Thread](https://new.reddit.com/r/houkai3rd/comments/1cdezj5/gamerelated_questions_thread_v74_update/)\n\n# Please check the first stickied post for helpful links!",
        "num_comments": 330,
        "comments": [
            "sea 88\n\ndo i pull for lantern if i am willing to do anything to make songque stronger",
            "GLB 88\n\nAbout Thelema Sena Lantern team. How does summoning them during stellar outburst work? Does it not matter when and how you summon so long as you keep up the buff that doubles the point gain? Or maybe you're supposed to prioritize summoning whoever does more damage out of the two? Or just summon both as soon as possible?",
            "When Thelema was released, I had a hard time using her. Until I learned that the simpliest strongest rotation for her is: ground: 3x basic atk > weapon atk > hold weapon atk. Or simply ground: 3x basic atk > weapon atk.\n\nMy question right now is about Lantern, I don't know if I'm doing it right? When non-AR, I simply spam basic atk, and then use weapon whenever it's available. Whenever the bar is full, I use hold atk. Whenever the ult is available, I use it. And then during AR, I ignore weapon button. I just simply spam basic atk, use hold basic atk when the bar is full and ult when possible. Idk if this is the right way to use her? It's too simple that I feel like I'm doing it wrong.",
            "Global 88\n\nWhen the flying heck is the maintenance over? Seems like it's been more than 6 hours.",
            "\"Comprehensive Guide to HI3\" seems to have been deleted.",
            "I play global/Europe.\nOn the wiki it says that with patch 7.5 chapter 3 (A crime foretold) should be released, but I still have no main quest available. Is it going to be released later? Do we know when?",
            "I have a Lantern and Sena but no Thelema; when building a team for Lantern should I put Cora in the 3rd spot or a unit like HoTr or AiChan instead.. Or should I just straight up run her like a Part 1 DPS with Truth & Aichan?",
            "This current event (auto-chess) story, when did this happen? The previous events stories feels more canon than this one.",
            "This is just out of curiosity, how many players still play the game every day globally?\n\nEdit: After making my way to BiliBili, I can assume that it's less than 100K players who log in every day, but there are plenty of people who still play the game (especially in China).",
            "Hey guys. I hope someone can help me. I am a completely new player and would like to have the character Lantern. According to Steam she is available until July 5th. Can someone just explain to me how I can get her? Thank you."
        ]
    },
    "Code word confirmed! Brightness max!\nWhat did \"Lantern\" hear to shine this blindingly bright??? (Fortunadragon)": {
        "title": "Code word confirmed! Brightness max!\nWhat did \"Lantern\" hear to shine this blindingly bright??? (Fortunadragon)",
        "score": 261,
        "url": "https://i.redd.it/cbc8z0loyh9d1.jpeg",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Wonder how she would react to \"Free healthcare\" since Lantern (the organisation) doesn't cover her bills.",
            "All this time people were comparing her to Kalpas, turns out she's the Mars version of Adam",
            "Adam: \"could this lady be one of my people?!\"",
            "Nh nh sng ca ng.",
            "Are you trying to make a sun?",
            "Lantern only wanted one thing and it's disgusting \n\n\"paycheck\"",
            "He kinda got a point tho",
            "What do you think that giant ball of fire was in the final battle against Will of Shadows?",
            "Damn, fellow Vietnamese spotted.",
            "Source:\n \nFacebook: https://www.facebook.com/share/Y9kYw23XHSQMudoq/?mibextid=oFDknk\n\nX/Twitter: https://x.com/HonkaiImpact3rd/status/1806900407752433930?t=65_-YlpmWc3QufH-wBelRw&s=19\n\nArtist:\n\nReddit: u/fortunadragon\n\nX/Twitter: [@fortunadragon](https://x.com/FortunaDragon?t=Gj85GxBT9bCvwJDYPhlkCw&s=09)"
        ]
    },
    "In her darkest moments, she forces herself to smile.": {
        "title": "In her darkest moments, she forces herself to smile.",
        "score": 591,
        "url": "https://i.redd.it/wa4ycpt1nf9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Poor Kiana.. I hope she still isn't faking her happiness/optimism.",
            "Someone get mei senpai the tuna is crying",
            "Quick, deeploy tactical headpats, cuddles, pizza toasts and Mei-senpai!!!",
            "The only REAL MC we'll ever love and care about in HI3",
            "She is one of a kind heroine who makes those Marvel and DC superheroes look like a joke",
            "Majestic art of Kiana never disappoints",
            "Somehow I can also see this as a creepy pasta thing waiting to happen",
            "That's actually the biggest difference between the characters then (let's say, before ER) and now. The amount of suffering and losses Kiana goes through makes you really want her to finally succeed. In the later story, I couldn't care less about whether the characters win, when I never see them lose and experience any actual hardship.",
            "nah after HoF she is way pass all of that trauma since they stated only those who true accept themselves can unlock the full potential of the Herrscher power. \n\nLike how Mei immune to HoD influence, and way stronger than typical Honkai influence herrscher.\n\nBut she is lonely on the moon",
            "Kiana is like one of those protagonists we want to cheer for her with all she went through, the hell, the struggles, nearly falling into despair and through the people around or within her; she stood right back up and burn brighter like the moonlight that she is. \n\nALSO THAT THIS IS A MOBILE GAME. Unless you make a story like Honkai, I'm not interested. Then again most mobiles are taking notes. But regardless, Kiana deserves happiness like any other!"
        ]
    },
    "Lantern has metamorphosed. ": {
        "title": "Lantern has metamorphosed. ",
        "score": 255,
        "url": "https://www.reddit.com/gallery/1dr4hqd",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Wow..... it took me a  while to figure out it was a body swap on the first one.... because it fit lantern so much.",
            "i didnt notice on the first pic.... wtf.....",
            "Similar but different (in personality)",
            "Ironic that Lantern is closer to Blade in personality and fighting style",
            "It's the same picture",
            "Same. Amazing"
        ]
    },
    "Images of the best wife of this game until she gets a new Battle Suit , Day 086 : She saw you": {
        "title": "Images of the best wife of this game until she gets a new Battle Suit , Day 086 : She saw you",
        "score": 72,
        "url": "https://i.redd.it/eedrbjzdbi9d1.png",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Well... Mobius is a snake, thus she has scales, but she also has a human appearance. It's easy to theorise that while moving she drops some of the scales that would otherwise cover her human skin. And, as we all know, wet lubricant is embedded on snake scales, as that's what allows them to slither (unlike snails, who secrete lubricant on the ground to help them slither).\n\nSo there you have it ; that goo is snake slime.",
            "I don't think it's ever elaborated on. I think going by that one Recollection it might be blood?",
            "yes give bio gel now",
            "So her goo is a lubricant ?",
            "My headcanon is that it is the cells that Make her Snake Mecha like nanomachines that can be reshaped the way she wants also she could became it to \"dive\" (becoming a pool instead of diving on it) but I never find the correct answer to know if this is right or wrong",
            "I love Mobius",
            "I love more",
            "[\"Do you want to taste my Bio Gel? perv Rato-San\"](https://www.pixiv.net/en/artworks/105745128)\n\nAnyway wtf is her green goo that she releases while moving/dodging/attacking ?"
        ]
    }
}