{
    "House of the Dragon - Season 2 Episode Discussion Hub": {
        "title": "House of the Dragon - Season 2 Episode Discussion Hub",
        "score": 115,
        "url": "https://www.reddit.com/r/HouseOfTheDragon/comments/1dj70iz/house_of_the_dragon_season_2_episode_discussion/",
        "content": "This is the one stop shop to find all discussion threads for the second season of House of the Dragon, airing Sundays at 9pm EST on HBO.\n\n**Season TWO episode discussion threads:**\n\n●  **2x01 - \"A Son for a Son\"** [No Book Spoilers](https://www.reddit.com/r/HouseOfTheDragon/s/eUFi6iow11) | [Book Spoilers](https://www.reddit.com/r/HouseOfTheDragon/s/T5KX57Mw8d)\n\n● **2x02 -  \"Rhaenyra the Cruel\"** [No Book Spoilers](https://www.reddit.com/r/HouseOfTheDragon/s/7cgwL1J0oG) | [Book Spoilers](https://www.reddit.com/r/HouseOfTheDragon/s/kW5FSb2Vsc) | [LIVE Discord Stage Event](https://youtu.be/8EBNS-TxPx0?si=G-QGMtAkGq_XFK2U)\n___\nWelcome back everyone for a new season of House of the Dragon! Join the official subreddit discord server to discuss everything related to the Game of Thrones Universe!!\n\n[JOIN THE DISCORD](https://discord.gg/hotd)\n\nWe are also still accepting moderator applications. If you are interested in helping out:\n\n[APPLY TODAY!](https://docs.google.com/forms/d/1RHFVqtGdiy89QGkRRPSQTsXOLXnuf8TYAqMJkt3uT4c/edit)\n___\n\n**This post will also be used as a general discussion thread for Season 2. Book spoilers must be marked and no leaks are allowed**",
        "num_comments": 505,
        "comments": [
            "I wish Erryk had taken the opportunity to point out to Daemon that you *really* dont want the armed knights who watch over you and your family while you sleep to get it into their heads that they can decide when a member of the royal family should die. See: Praetorian Guard.",
            "Am I the only one who laughed at Daemon calling an ancient dragon 'whory old bitch'?",
            "Was Helaena saying she was scared of the rats a hint at the rat killer murdering her son?",
            "The episode was spectacular with one major blemish in the execution of the finale, though it was still exciting. There are zero guards around the royal quarters? I get that they used the tunnel directly into the floor, but to have zero guards in the vicinity of those bed chambers is crazy. And why was there a whole miniature conflict around choosing the male child? The guard and snake catcher will kill babies but draw the line at identifying the babys gender?",
            "So....did they use CGI or a stunt dog? are we just like not gonna seriously talk about this? lmao ",
            "So good to have this show back, another cracking episode. But my god that ending was dark",
            "Don't they have locks on doors in this world?",
            "I've been rewatching game of thrones and damn it Joffrey, a throwaway line in your random history lesson for Margaery Tyrell spoiled how this war ends",
            "The Lannister advisor will be happy, no more taking his ball",
            "Mysarias new accent is the biggest win of the episode #powertothepeople"
        ]
    },
    "18 New HD Stills for 2x03": {
        "title": "18 New HD Stills for 2x03",
        "score": 2975,
        "url": "https://www.reddit.com/gallery/1dpx8xo",
        "content": "",
        "num_comments": 346,
        "comments": [
            "I love the random Ryan Condal image can't wait to see how he enters into the world of Westeros.",
            "I'm really looking forward to slide 7, my favourite part of the book",
            "Love Steve tousant expression radiating such love/fondess for Rhaenys through the picture",
            "I can't belive that after the Starbucks cup debacle in Got Srason 8, they'll now let a dude in modern clothes wearing a freaking headphone in the scene ! /s",
            "Some gorgeous pictures! That Rhaenys and corlys picture  \nNo shots of Aemond? Think he's the only main cast not featured in any of the promos",
            "Who's the character in the 7th picture? Why did the maesters write him out of history?",
            "Baela's fit this episode ",
            "The costumes in those stills are amazing! Am I wrong, or even Crispin's costume seems a little bit different?\n\nThe still o Daemon in the stairs is probably my favorite. The last one with Corlys is so very nice. And may I applaud Rhaenyra's dress and pashmina in the last pictures?",
            "Aaa everyone looks so good. I want to know what Alicent and Helaena are talking about",
            "17 & 18 makes me sad we didnt see their courtship. How did he bag a dragon-riding baddie?"
        ]
    },
    "Since many took offence that we didn’t get “book accurate Rhaenyra”, portrayed by a plus sizes actress:": {
        "title": "Since many took offence that we didn’t get “book accurate Rhaenyra”, portrayed by a plus sizes actress:",
        "score": 541,
        "url": "https://i.redd.it/9bjan9a6oh9d1.jpeg",
        "content": "",
        "num_comments": 166,
        "comments": [
            "The only reason I wouldnt want plus sized Rhaenyra, Aegon, Helaena, and Viserys (but especially Rhaenyra and Helaena) is because of the truly revolting amount of body shaming they would be subjected to. \n\nEven with the cast we have the amount of people who act like book! Rhaenyra committed the ultimate sin by not losing baby weight after 6 pregnancies is so, so gross.",
            "I think finding people who can actually act supersedes finding people that look how theyre described in the book.",
            "I always loved the idea of curvy Targaryens, however Im glad they decided to not go for it in the show so I dont have to see all the body shaming.",
            "I honestly just didn't want these castings to be book accurate because I didn't want the amount of horrendous cruelty, bullying and misogyny that would be targeted towards the actresses and their characters. That's just the world we live in and its a sad fact. House of the Dragon does not have the same general audience with the same expectations as something like 'Bridgerton' or 'Euphoria' plenty of whom aren't even aware that Emma D'Arcy are non-binary irl. If Rhaenyra was actually plus size on the show, her and her actress would have gotten more hate than Skyler White and you'd probably have a lot more ass-wipes teaming up on a campaign trying to sabotage and review-bomb the show for being 'woke propaganda'. Would it have been cool to have a book accurate Rhaenyra and Helaena; yeah, but this is the sad reality of the current climate we live in.",
            "If you a reacting to some photoshop from the circle jerk sub, they don't care. They despise Rhaenyra and it's about mocking her not a desire for book accuracy. They hate Emma D'arcy near as much as they hate the character with constant jokes from even the lead mod mocking their gender identity, calling them ugly, and saying they ruin the show. Those dudes don't give a fuck. The sub should consider a name change since it's been less funny and purely hateful the last few times I've been there. I don't remember the same hateful tone at all in the early days of post season 8.",
            "Let's be real, if they made these characters even half a pound heavier on screen the actors would be bodyshamed to oblivion and probably quit acting all together. People are fucking vile these days and are completely shameless. They will hate on an actor for breathing wrong",
            "Aegon was literally described as being bloated. greens body shaming nyra should look back at their own king",
            "Yeah, I don't like how those shows are so resistant to portraying thicker characters. It seems to me that being slightly overweight is perceived as a character flaw and any character that is supposed to be related to can't have this trait.\n\nI am not advocating for BMI 30 Rhaenyra, but goddam, she is a mother 5? She should have a Molly Weasley body lmao.",
            "I mean weve already seen how fans reacted to Aemonds body. I could not imagine what a plus sized actor would be subjected to.",
            "Are we really Fatscaling Targs?\n\nFucking hell, this place is gonna be a shitshow when the Dance kicks off."
        ]
    },
    "Olivia Cooke & Phia Saban EP 2 BTS": {
        "title": "Olivia Cooke & Phia Saban EP 2 BTS",
        "score": 246,
        "url": "https://www.reddit.com/gallery/1dr9p84",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Helaena Targaryen, sponsored by Coke",
            "Wait the dress is different (at least Haelena) right?? ",
            "phia is so cute ",
            "I love all the BTS content from HOTD. The cast looks like a blast to be around",
            "Could be the weather, is the reason for the ice pack",
            "This makes me want a cold Coca Cola!",
            "I love that HBO hires the best costume and hair people.",
            "I still cant picture Olivia/Alicent being a grandma when she looks so young lol",
            "Wow Phia looks like a total badass here! Absolutely loving it!",
            "Must have been hot! Poor Olivia, getting cooked alive in a velvet dress!"
        ]
    },
    "Looks like season 3 is eying an early 2026 release.": {
        "title": "Looks like season 3 is eying an early 2026 release.",
        "score": 3339,
        "url": "https://i.redd.it/1w2xteujwd9d1.jpeg",
        "content": "",
        "num_comments": 475,
        "comments": [
            "I hate the new TV show model. Eight episodes every two years? Come on.",
            "This is ridiculous. They shouldve already been filming season 3 while 2 was airing. HBO knows this is probably their biggest current show.",
            "Well if youre going to make us wait that long then give us 10 episodes not 8",
            "This new industry standard for shows is so disappointing. No wonder people lost interest in the show with the long wait.",
            "Two year gaps between <13 episode seasons is going to kill television",
            "We eat good for 8 weeks and then starve for 104+ weeks",
            "They need to stop with this two year shit.",
            "I genuinely loose interest when seasons are spaced so far apart. Like I wasnt even that hyped for this season because its just been so long.",
            "Im going to be dead by the time this show is finished",
            "Come on. 8 years for a 4 season show? Thats ridiculous"
        ]
    }
}