{
    "House of the Dragon - Season 2 Episode Discussion Hub": {
        "title": "House of the Dragon - Season 2 Episode Discussion Hub",
        "score": 114,
        "url": "https://www.reddit.com/r/HouseOfTheDragon/comments/1dj70iz/house_of_the_dragon_season_2_episode_discussion/",
        "content": "This is the one stop shop to find all discussion threads for the second season of House of the Dragon, airing Sundays at 9pm EST on HBO.\n\n**Season TWO episode discussion threads:**\n\n●  **2x01 - \"A Son for a Son\"** [No Book Spoilers](https://www.reddit.com/r/HouseOfTheDragon/s/eUFi6iow11) | [Book Spoilers](https://www.reddit.com/r/HouseOfTheDragon/s/T5KX57Mw8d)\n\n● **2x02 -  \"Rhaenyra the Cruel\"** [No Book Spoilers](https://www.reddit.com/r/HouseOfTheDragon/s/7cgwL1J0oG) | [Book Spoilers](https://www.reddit.com/r/HouseOfTheDragon/s/kW5FSb2Vsc) | [LIVE Discord Stage Event](https://youtu.be/8EBNS-TxPx0?si=G-QGMtAkGq_XFK2U)\n___\nWelcome back everyone for a new season of House of the Dragon! Join the official subreddit discord server to discuss everything related to the Game of Thrones Universe!!\n\n[JOIN THE DISCORD](https://discord.gg/hotd)\n\nWe are also still accepting moderator applications. If you are interested in helping out:\n\n[APPLY TODAY!](https://docs.google.com/forms/d/1RHFVqtGdiy89QGkRRPSQTsXOLXnuf8TYAqMJkt3uT4c/edit)\n___\n\n**This post will also be used as a general discussion thread for Season 2. Book spoilers must be marked and no leaks are allowed**",
        "num_comments": 489,
        "comments": [
            "Ending was crazy",
            "I mostly like the changes to the ending of this episode from the book. \n\nBut I don’t really understand the pseudo-dilemma of making Helena point out the boy from the girl. \n\nCheese even says “look for a cock.” But then they both abandon that idea and try to ascertain if Helena is telling the truth. When they already set up how important it is that they *have* to kill a son for a son.",
            "I wish Erryk had taken the opportunity to point out to Daemon that you *really* don’t want the armed knights who watch over you and your family while you sleep to get it into their heads that they can decide when a member of the royal family should die. See: Praetorian Guard.",
            "Was Helaena saying she was scared of the rats a hint at the rat killer murdering her son?",
            "Am I the only one who laughed at Daemon calling an ancient dragon 'whory old bitch'?",
            "The episode was spectacular with one major blemish in the execution of the finale, though it was still exciting. There are zero guards around the royal quarters? I get that they used the tunnel directly into the floor, but to have zero guards in the vicinity of those bed chambers is crazy. And why was there a whole miniature conflict around choosing the male child? The guard and snake catcher will kill babies but draw the line at identifying the baby’s gender?",
            "So....did they use CGI or a stunt dog? are we just like not gonna seriously talk about this? lmao 🤣",
            "So good to have this show back, another cracking episode. But my god that ending was dark",
            "Don't they have locks on doors in this world?",
            "I've been rewatching game of thrones and damn it Joffrey, a throwaway line in your random history lesson for Margaery Tyrell spoiled how this war ends"
        ]
    },
    "18 New HD Stills for 2x03": {
        "title": "18 New HD Stills for 2x03",
        "score": 2962,
        "url": "https://www.reddit.com/gallery/1dpx8xo",
        "content": "",
        "num_comments": 345,
        "comments": [
            "I love the random Ryan Condal image can't wait to see how he enters into the world of Westeros.",
            "I'm really looking forward to slide 7, my favourite part of the book",
            "[removed]",
            "Some gorgeous pictures! That Rhaenys and corlys picture 😔 \nNo shots of Aemond? Think he's the only main cast not featured in any of the promos",
            "Love Steve tousant expression radiating such love/fondess for Rhaenys through the picture",
            "I can't belive that after the Starbucks cup debacle in Got Srason 8, they'll now let a dude in modern clothes wearing a freaking headphone in the scene ! /s",
            "Who's the character in the 7th picture? Why did the maesters write him out of history?",
            "Baela's fit this episode 😮‍💨🤌",
            "The costumes in those stills are amazing! Am I wrong, or even Crispin's costume seems a little bit different?\n\nThe still o Daemon in the stairs is probably my favorite. The last one with Corlys is so very nice. And may I applaud Rhaenyra's dress and pashmina in the last pictures?",
            "Aaa everyone looks so good. I want to know what Alicent and Helaena are talking about"
        ]
    },
    "Rhys does have a point here": {
        "title": "Rhys does have a point here",
        "score": 4433,
        "url": "https://i.redd.it/n7wnb70ozc9d1.jpeg",
        "content": "",
        "num_comments": 339,
        "comments": [
            "\nThank you for your post! Please take a moment to ensure you are within our spoiler rules, to protect your fellow fans from any potential spoilers that might harm their show watching experience.\n\n1. All post titles must NOT include spoilers from Fire & Blood or new episodes of House of the Dragon. Minor HotD show spoilers are allowed in your title ONE WEEK after episode airing. The mod team reserves the right to remove a post if we feel a spoiler in the title is major. You are welcome to repost with an amended title.\n\n2. All posts dealing with book spoilers, show spoilers and promo spoilers MUST be spoiler tagged AND flaired as the appropriate spoiler.\n\n3. All book spoiler comments must be spoiler tagged in non book spoiler threads.\n\n---\n\nIf you are reading this, and believe this post or any comments in this thread break the above rules, please use the report function to notify the mod team.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HouseOfTheDragon) if you have any questions or concerns.*",
            "Based, spare Helaena and Baela tho. My goats 🥰",
            "Common Rhys W",
            "Based as fuck",
            "REAL",
            "This is the proper answer",
            "He's fucking right",
            "![gif](giphy|oI4YTZajUlEAM)",
            "I agree both sides are terrible, but I feel like we keep watering down the word 'genocide'. A mass killing and warcrimes do not automatically equal genocide. Unless I'm missing something here?",
            "I like him"
        ]
    },
    "Looks like season 3 is eying an early 2026 release.": {
        "title": "Looks like season 3 is eying an early 2026 release.",
        "score": 2399,
        "url": "https://i.redd.it/1w2xteujwd9d1.jpeg",
        "content": "",
        "num_comments": 368,
        "comments": [
            "\nThank you for your post! Please take a moment to ensure you are within our spoiler rules, to protect your fellow fans from any potential spoilers that might harm their show watching experience.\n\n1. All post titles must NOT include spoilers from Fire & Blood or new episodes of House of the Dragon. Minor HotD show spoilers are allowed in your title ONE WEEK after episode airing. The mod team reserves the right to remove a post if we feel a spoiler in the title is major. You are welcome to repost with an amended title.\n\n2. All posts dealing with book spoilers, show spoilers and promo spoilers MUST be spoiler tagged AND flaired as the appropriate spoiler.\n\n3. All book spoiler comments must be spoiler tagged in non book spoiler threads.\n\n---\n\nIf you are reading this, and believe this post or any comments in this thread break the above rules, please use the report function to notify the mod team.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HouseOfTheDragon) if you have any questions or concerns.*",
            "I hate the new TV show model. Eight episodes every two years? Come on.",
            "This is ridiculous. They should’ve already been filming season 3 while 2 was airing. HBO knows this is probably their biggest current show.",
            "Another 2 years….\n\n![gif](giphy|WxxhLX1fMthLbIpsD3|downsized)",
            "Well if you’re going to make us wait that long then give us 10 episodes not 8",
            "We eat good for 8 weeks and then starve for 104+ weeks ",
            "This new industry standard for shows is so disappointing. No wonder people lost interest in the show with the long wait.",
            "Two year gaps between <13 episode seasons is going to kill television",
            "They need to stop with this two year shit.",
            "I genuinely loose interest when seasons are spaced so far apart. Like I wasn’t even that hyped for this season because it’s just been so long."
        ]
    },
    "You can’t name a father & son duo with more luscious hair in the 7 Kingdoms.": {
        "title": "You can’t name a father & son duo with more luscious hair in the 7 Kingdoms.",
        "score": 1194,
        "url": "https://i.redd.it/0ttm514jod9d1.jpeg",
        "content": "",
        "num_comments": 71,
        "comments": [
            "\nThank you for your post! Please take a moment to ensure you are within our spoiler rules, to protect your fellow fans from any potential spoilers that might harm their show watching experience.\n\n1. All post titles must NOT include spoilers from Fire & Blood or new episodes of House of the Dragon. Minor HotD show spoilers are allowed in your title ONE WEEK after episode airing. The mod team reserves the right to remove a post if we feel a spoiler in the title is major. You are welcome to repost with an amended title.\n\n2. All posts dealing with book spoilers, show spoilers and promo spoilers MUST be spoiler tagged AND flaired as the appropriate spoiler.\n\n3. All book spoiler comments must be spoiler tagged in non book spoiler threads.\n\n---\n\nIf you are reading this, and believe this post or any comments in this thread break the above rules, please use the report function to notify the mod team.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HouseOfTheDragon) if you have any questions or concerns.*",
            "Casting is nuts. He really looks like he’s their son!",
            "Harwin would have been so proud of his boys.",
            "L’Oreal. Because you and your unacknowledged son are worth it",
            "The seed is Strong.",
            "You know, I think Vaemond Velaryon might've been right.",
            "Rhaegar Targaryen and Jon Snow",
            "Love these boys 🥹",
            "It’s really Rhaenyras face with Harwins hair 😭",
            "Cregan really looked at Jace was like we can’t do that and gave him a make over in the north. Poor Jace wish someone would’ve acknowledged his glowup"
        ]
    }
}