{
    "🌵 Discussion Topic: Succulents - May 31, 2024": {
        "title": "🌵 Discussion Topic: Succulents - May 31, 2024",
        "score": 11,
        "url": "https://www.reddit.com/r/houseplants/comments/1d562up/discussion_topic_succulents_may_31_2024/",
        "content": "Let's discuss succulents! Please use this thread to post anything related to the topic including questions, pictures, experiences and tips / tricks.",
        "num_comments": 29,
        "comments": [
            "Does anyone have a favourite succulent? If so, why?",
            "best  make -it -yourself soil for succulents????",
            "Mesembs are so much fun to grow.  I especially like titanopsis.  Is anyone else growing them?",
            "Oooooh that is sooo cool!! I just LOVE succulents but had to give them up as I always killed them and felt so bad",
            "very cool. id like to try that someday.",
            "If you think youre gonna change me for me too good you came the wrong way shouldve took in the whole different route if you wanted to change me instead of just dumping me and leaving me in the fucking street dont you think that they did? Did they teach you guys out in medical school, I dont know if you know someones hurting they always take the easy way out made it worse. I dont know how to do that knife but you dont spit someone out and shouldnt trash and expecting to change. Its not how you do it so whatever book you on tell him, I said theyre full of you know what else",
            "The best time to prune Aucuba is in late winter to early spring before new growth begins. This timing allows the plant to recover and put out new growth during the growing season",
            "cut the large stem right below where the three mini offshoots are, and lay it on the soil in that the roots are all touching the soil. Do not bury it.\n\nmoldy leaves during propagation means you are watering it way too much. You generally just lay detached leaves on dry soil and leave them there until they have grown roots on their own.",
            "Also, if that pot has no drainage holes I would get it into something that does have drainage. Succulents like a good drink when you water but dont like wet feet.",
            "Yeah, remove all the dead leaves and material, cut the stem part at the top and you can just pus that in the soil with those cute little pups facing up, cut the main stem back too and lean that alone and youll likely get new growth from the cut point. Make sure its well draining soil and dont water until its very dry. They want lots of direct sunlight."
        ]
    },
    "🌱Weekly /r/houseplants Question Thread - June 24, 2024": {
        "title": "🌱Weekly /r/houseplants Question Thread - June 24, 2024",
        "score": 8,
        "url": "https://www.reddit.com/r/houseplants/comments/1dne6nb/weekly_rhouseplants_question_thread_june_24_2024/",
        "content": "This  thread is for asking questions. Not sure what you're doing or where to start? There are no dumb questions here! If you're new to the sub, say \"Hi\" and tell us what brought you here.",
        "num_comments": 79,
        "comments": [
            "Roots are growing up into the air on my monstera plant. Any idea why or what's happening?",
            "Hi, I'm a new plant mom with a host of pothos cuttings that I've successfully rooted and transferred to soil. My issue is that I tried to research how many cuttings to place in a pot based on size and found answers ranging from 1 node more than the number of inches of the pot to one node less. So, for my 6\" pots, I went with 5 cuttings apiece. I'm not getting the full/fluffy look of some I've seen and have realized that the commercial pots have way more vines per inch, and they're also grouped more closely together than my cuttings are. I saw one person doing semi-hydro recommending 20 cuttings to a 5\" pot!\n\nI don't want to shock/traumatize my babies,  which are about 4 months old now (between water propping and transfer to soil). I'd appreciate any advice.   Should I repot and group more to a pot or leave them as is? I know I can always add in more nodes in the future,  but want to make sure I'm making the best decisions overall.",
            "Where do yall buy ceramic indoor pots (that are not expensive as hell, and also for less common sizes)?\n\nImpulse bought a new plant that's in a grower pot that's 8 inches in diameter at the top, 6.5 or 6.75 inches in diameter at the bottom, and only 6 inches in height. Online I keep finding pots that are either marked as 8 inches but actually not 8 inches all the way through, or if they are truly 8 inches wide then they're too tall. Online pot prices are also pretty ridiculous but that's another topic.",
            "I thought I asked this maybe in main group, idk how to use Reddit but happy to be here.  I bought a monstera at the grocery store the other day and forgot to bring it in - I live in vegas and it was in car for about 6 hours. Some leaves were black and wilted.  Do I cut them off? How can I fix it?",
            "I have bought a very pretty ceramic flowerpot cover (11cm internal diameter, 12 cm height) and I don't want to drill a hole in it (but given it's a flowerpot cover, I'm absolutely fine with putting another, smaller pot inside of it). What would be a good plant that would survive in conditions of rather limited drainage?\n\nI live in Poland, so my climate is somewhat similar to northeastern US (not sure if it's relevant if I'm going to keep it indoors)",
            "Hey guys!\nHow reliably does purple passion plant root from a cutting? \nMine is getting good size and I think I'd like to cut the apical merristem to even out the height.",
            "Hey guys! Bought a spider plant a couple days ago. Its my first indoor plant. Im planning to hang it after I repot it. Can I just use potting soil? Do I need to mix anything else in?",
            "My beautiful calathea has the thrips so I bought insecticide that says on the label \"Do not discharge this product into the sewage system\". My first thought would have been in the bathtub but seems that's no good. Where are you guys spraying your indoor plants? On the balcony at some point it will go into the sewage system too through the rain??",
            "Hi, new here, the tips of my philodendron imperial red are turning brown, if this is from overwatering, and I let this soil completely dry before watering again, will I still lose the leaves??",
            "Which houseplant would be best for Alaska? We keep the temp inside around 65-75 year round (using the heater in the winter and in the summer its usually around 70-75 inside). The issue is we dont get a lot of sun though whats a nice house plant that is idiot proof for us? Thank you! "
        ]
    },
    "Could use some positivity": {
        "title": "Could use some positivity",
        "score": 2458,
        "url": "https://www.reddit.com/gallery/1dqqfl0",
        "content": "Well my apartment caught on fire on Wednesday out of over 100 plants I’ve been able to try and save 20 remaining ones which aren’t in the best shape at all. Could use some positive vibes ",
        "num_comments": 238,
        "comments": [
            "A little dose of positivity: youre still here  you were able to nurture and grow your plant babies and you will be able to do it again, may the love you have in your heart extend through the tips of your fingers and heal your remaining plants, and bring into your life new ones to enjoy. \n\nSending you a big hug!",
            "Your plant room has more light now. \n\nPhew, glad you're safe, physically.",
            "Im so sorry! What country/area are you in? If youre in my country Id mail you some cuttings.",
            "Im so sorry! This sounds so stressful and difficult for so many reasons. I hope you and your little surviving plant babies rebuild quickly and easily.",
            "First off, youre alive. Ive been in this boat. Im so sorry.\n\nSecond, remember the fire in Lahaina, Hawaii? The Banyan tree that was the center of everything and was SOOO old and vast was caught ablaze. Months later and she is blooming and thriving again. I cant imagine losing my babies, but do keep hope for the 20 you savedthey are tougher than we give them credit for sometimes. Sending you hugs and light ",
            "Im glad youre safe! If youre in the US, Id be happy to send you some cuttings and props, whenever youre ready of course.",
            "Do you have a go fund me? I'd be happy to help restart what you lost. I'm so sorry for what you're experiencing and I'm glad you're safe.",
            "Glad youre still with us. You can replace plants, but we cant replace you. Itll be a joy to watch new/different plants grow. Hoping your joy grows with them. Sending you virtual hugs! ",
            "I'm glad you're OK! If you need cuttings, DM me  I have lots of begonias!",
            "if you are in SoCal hit me up, i have a ton of plants and would happily give you some!"
        ]
    },
    "Met him last night. Didnt come home with me then. Thought about him all night. Woke up this morning thinking about him. Went back and got him!": {
        "title": "Met him last night. Didnt come home with me then. Thought about him all night. Woke up this morning thinking about him. Went back and got him!",
        "score": 586,
        "url": "https://i.redd.it/xv2xd2y1ne9d1.jpeg",
        "content": "",
        "num_comments": 49,
        "comments": [
            "This is a better story than twilight",
            "I love that he's in a mug",
            "I have killed two of those so far. And they kinda hard to find around here. Better luck to you.",
            "The stems on it look so cool!",
            "I'm scared he falls off the balcony.",
            "I killed my little zebra plant  month after month a leaf would die. He couldnt handle my dry aired apartment (dubai based, we have to blast AC Year around to survive) I was really upset about it. Good luck with yours!!",
            "This right here is the love story Im looking for. I wish I was a plant ",
            "im so ready to throw mine out. shes been pissing me off",
            "Sounds like true love. Hes definitely a keeper!",
            "I have one and hes a champ! Got the bitchy begonia and tropical corner a light for the winter and relatively low maintenance, all things considered. Congrats on your lovely find!"
        ]
    },
    "I live above a flower shop and sometimes they like to leave me mystery plants at my doorstep. Today it was cacti. ": {
        "title": "I live above a flower shop and sometimes they like to leave me mystery plants at my doorstep. Today it was cacti. ",
        "score": 811,
        "url": "https://i.redd.it/a9cffunztd9d1.jpeg",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Wow, that's super nice of them! And beautiful arrangements.\n\nIf I lived above any kind of shop that sold houseplants I would bring one home every day. And gladly pull from my dining/entertainment/subscription budget.",
            "Give em a shout out. They need advertising.",
            "This is a great problem to have, the arrangements are gorgeous!",
            "This random acts of plants to you is so delightful! May your space be a testament to their kindness and the beauty of plants",
            "that is SO pretty and so kind of them!! ..... that said, whatever you do, do NOT touch the ones with the fuzzy hair-like spines with your skin (bottom of the bottom pot, 8 o'clock on the top pot). those are demon plants with demon spines that once stuck in you are too thin to remove with tweezers (mine are very hearty, not too picky about light and growing like the blazes and i'm not sure that's entirely a good thing lol)",
            "i neeed to know the buisiness",
            "Though they are showing signs of etiolation already...",
            "This sounds amazing! What did you do to get this gift?? They're beautiful",
            "Trust me, same. Just spent $60 on plants last week",
            "Unfortunately this would also reveal where they live"
        ]
    }
}