{
    "Stolen Bag Ditched Somewhere at Buafflo Bayou": {
        "title": "Stolen Bag Ditched Somewhere at Buafflo Bayou",
        "score": 29,
        "url": "https://www.reddit.com/r/houston/comments/1dr8e0l/stolen_bag_ditched_somewhere_at_buafflo_bayou/",
        "content": "Hey everyone! I’m so sorry if this is against the reddiquette — if so let me know and I’ll take this down. \n\nIt’s a hell of a long shot, but I had my backpack stolen yesterday while at dinner — it was a car break-in. For some reason my air tag shows the backpack is somewhere on Allen Parkway — near-ish to Elenor Tinsley. I do know the thief did ditch other stolen bags from my vehicle in different parts of Houston. \n\nI looked for a couple hours earlier this morning and had no luck. If someone on here sees it, and could get it for me I’d be so grateful. \n\nLook, I know some of my stuff is probably gone, but my hope is some of the clothes and other personal items of low value may be in the bag so I don’t have to buy everything again from scratch. \n\nIf you see a black backpack (sadly idk what brand) with t-shirts, clothes, retainers, portable chargers, business cards — somewhere near Sabine Park/Eōs Fitness area, could you please let me know? I’d be so grateful. If you do check while there, I still greatly appreciate it. ",
        "num_comments": 16,
        "comments": [
            "I think Air Tags work by using proximity of Apple phones. Sadly when I was looking it was 2am at the park. I would have to be near it and not a ton of people were out in that part.",
            "Might want to check the visitors center, they have a lost and found there. Just across sabine bridge near the skate park.",
            "Ah, how unfortunate that there are still people who have never seen any of the thousands of \"my bag got stolen out of my car\" posts here in /r/houston .\n\nGet ready, humble muskrat, you're going to be told a couple/few times that you can't leave anything valuable in a car parked in Houston.  Same with any big city.",
            "Hey I appreciate the update. Tbh it’s quite possible that could have been it. It’s a little north of the AirTag but I know it stopped tracking at 10pm and it’s not 100% accurate. Thank you for sharing the info!\n\nI will see what I can do on that.",
            "Huh. That’s a great idea! Didn’t consider that. Thank you for the recommendation. I’ll do that asap.",
            "Yeah. Fair point. Not expecting much but hey, if someone sees it at the park and cares, beats not trying at all. But agreed.",
            "Yep. You aren’t safe anywhere in Houston. Even the parking garages of “luxury” apartments constantly have people posting videos of their tires stolen. Sometimes I wonder if I should just leave my windows rolled down. 😂",
            "What restaurant were you at/where was car parked when the break in happened?",
            "Gus’s World Famous Fried Chicken. Guess some guy has been robbing cars there several times in the past week. \n\nAlso, what time was your run? If I may ask",
            "Aw that sucks. I eat there regularly. How'd it end up over at Eleanor Tinsley? Not particularly close if you're by foot. And by car you can toss it anywhere. Unless the Airtag just happened to ping while they were driving across the Sabine St Bridge."
        ]
    },
    "Does it seem hotter than usual? ": {
        "title": "Does it seem hotter than usual? ",
        "score": 118,
        "url": "https://www.reddit.com/r/houston/comments/1dqyjst/does_it_seem_hotter_than_usual/",
        "content": "My AC is struggling right now, it’s 83 inside and the AC is set to 77 every day but it never makes it to 77. I don’t remember having this issue last year in June. Sweet Jesus help me, Summer is just beginning. Just venting. Ok bye. ",
        "num_comments": 179,
        "comments": [
            "Last year was definitely hotter. You might need to get your AC serviced",
            "If it was 77 in my house I’d be fighting someone. Call a reputable HVAC company.",
            "I think I'm being gaslit by the weather now after last year because while mid 90s is hot, it's...tolerable? I never want to go through another summer like last year's.",
            "Get it serviced. I have a laser thermometer to check the vents and return and take it from there.",
            "Nope.  This years weather seems me normal,  heat with a few days of rain here and there.",
            "An easy thing to try yourself would be to hose off the coils on the outside unit. If they are dirty this can make an immediate difference.",
            "It’s the coldest summer of the rest of your life!",
            "When did you get your AC serviced?",
            "If your ac can’t cool 20 degrees below the outside ambient temperature that means it’s broken.",
            "You gotta \"preload\" your ambient temp. Understand everything in your house also has to be cooled down. My house is old, too. Single pane windows. Shit insulation. I drop it down to 68 at night and it gets there by probably 4am. By noon it's back up to 73, and 4pm it's at 77. Rinse repeat. \n\nThis is a shit climate city."
        ]
    },
    "What’s the deal with the huge bike group on the weekends?": {
        "title": "What’s the deal with the huge bike group on the weekends?",
        "score": 49,
        "url": "https://www.reddit.com/r/houston/comments/1dr05eo/whats_the_deal_with_the_huge_bike_group_on_the/",
        "content": "I live near Allen Parkway and I feel like every weekend a huge group of bikers with lights, obnoxiously loud speakers, and ignorance of traffic laws shows up. \n\nAre they a group? They seem to hold up traffic or weave through it. ",
        "num_comments": 107,
        "comments": [
            "Critical mass, last Friday of the month a group gets together to bike through Houston.",
            "I detest them, but I will fight for their rights to bike lanes!",
            "less than an hour ago, a truck almost hit me on my bike (nothing to do with a group ride)  as I crossed Allen Parkway out of the park at Shepherd.     I had the cross signal light and he tried to make a right turn into me.  \n\nWhat's the deal with that?",
            "I love bicycles. I own 5 currently. I hate large group rides. Hate",
            "they are out there to have a good time.  unfortunately that can come at the expense of people just trying to get where they wanna go.",
            "There's a bunch of different ones with different vibes. Ultimately not really different from Houston drivers, other than the fact that the bikes probably won't kill anybody.",
            "Whats the deal with the huge car groups on weekends? I feel like every weekend a huge group of drivers with lights, obnoxiously loud speakers and ignorance of traffic laws constantly show up.\n\nAre they a group? They seem to hold up traffic or weave through it.",
            "The bikes are a slightly annoying but forgivable oddity. What really bothers me is the large groups of dirt bikes and ATVs. They will roll through multiple times a night and multiple nights a week. It regularly wakes me up. A bunch of wheelies, going well over the speed limit, and not a helmet in sight. Is that associated with Critical Mass also?",
            "How dare they inconvenience me for 3 minutes on my way to the bar?! The indolence!",
            "A while back I noticed them coming my way and they had a green while I was on a red light. Two of their bikers stopped in front of me and blocked me when I had the green light. They’re terrible people and I’ve seen videos of them getting violent when someone tried to navigate through them."
        ]
    },
    "Do men wear suits to job interviews in the summer??": {
        "title": "Do men wear suits to job interviews in the summer??",
        "score": 112,
        "url": "https://www.reddit.com/r/houston/comments/1dqu3wd/do_men_wear_suits_to_job_interviews_in_the_summer/",
        "content": "So I'm curious if a suit is suicidal in the Houston Summers for interviewing. Do people do more of a business casual or are suits normal?",
        "num_comments": 183,
        "comments": [
            "I would wear a second suit on top of your first to be safe",
            "Yes, you're not interviewing outdoors. You're moving from your car's AC to the building's AC.",
            "Na, bathing suits and margaritas in the conference room.",
            "I'm in an executive position and interview several people per month for many roles. I'm honestly ok for dressing a step above the role you're applying for. I'm pretty surprised at how often people interview in a suit and are dressed well above the position. However, that is significantly better than being underdressed. I've never docked points for someone dressed in a suit, unless it was a really terrible suit and I still don't think I docked any points. I just told myself this guy probably borrowed his dad's suit and at least he was trying. \n\nSo, dress above the role you're applying for. Be comfortable in your dress and confident in your discussion and you'll be fine.",
            "I’ve never worn a suit to a job interview…but I do work in lab environments so a suit is not practical in my situation. If I was an executive level employee that would be different. I would say it depends on the job said man is going after.",
            "Depends on the job. You might be able to get away with a sport coat and khakis.",
            "Depends on the job but always good to overdress than to underdress. If it’s an office job where business attire is ok and business casual is the norm then for a job interview wear the suit to make sure. Then when you start the job you can dress down to business casual if that’s the norm. AC from your car to AC in the office. But there’s comfortable suits that aren’t as heavy for summer.",
            "Generally you dress professionally for an interview. For the people in the thread questioning if anyone wears a suit anymore: if you work a corporate role, of course business casual is generally the way companies will request you dress, but you’ll probably have a few situations requiring a suit as well.",
            "I saw a guy wearing a three-piece suit, leather\\\\trench coat thing at Costco yesterday... I was sweating my inexistent balls off in a regular tshirt and shorts and the man seemed cool as a cucumber",
            "No need. Just long sleeve white dress shirt with tie and nice pair of slacks along with dress shoes."
        ]
    },
    "Popular Midtown bar to close for newer concept after 7-year run": {
        "title": "Popular Midtown bar to close for newer concept after 7-year run",
        "score": 5,
        "url": "https://www.chron.com/food/article/houston-midtown-beer-bar-closing-19540994.php",
        "content": "",
        "num_comments": 1,
        "comments": [
            "“A new concept…” because people need new ways to sit down, drink, and be social."
        ]
    }
}