{
    "Crystal Klein Naked Piano 2005": {
        "title": "Crystal Klein Naked Piano 2005",
        "score": 42,
        "url": "https://v.redd.it/fnrt0jowlh9d1",
        "content": "",
        "num_comments": 10,
        "comments": [
            "How the fuck did the show go from this to Wilding and Blitt???",
            "I'm stroking my hydrogen rod",
            "100x hotter than beth and I bet shed do way more than just lay there like a dead fish.",
            "Shes the hottest chick weve ever had up here.",
            "Too poor to keep crystalklein.com registered",
            "Howard loves them skeleton ass women",
            "Show has aged as poorly as Artie",
            "Im getting blood flow",
            "Great cans",
            "Is that Samona Dinnerstien?"
        ]
    },
    "\"He's like the white Al Sharpton...\"": {
        "title": "\"He's like the white Al Sharpton...\"",
        "score": 24,
        "url": "https://i.redd.it/vw8vubsr2i9d1.jpeg",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Steak for two, for one....me Dominic!",
            "Dominic really shit his pants",
            "Whenever I see a pic of him I instantly do that noise Fred makes the moment Dominic gets on the line.",
            "I think he has a pretty good lawsuit against George Lucas for stealing his Wookie sound.",
            "We did a study! Guh guh guh guh guh",
            "First of all, I wish Dominic was still licensed so we can sue everyone in shelter island",
            "Vodka with a splash of cranberry and two lemons!",
            "55! 622! 73 35, 418.",
            "I do the same. Or if a caller by the name of Dominic calls, I do the gurgle.",
            "I'm on fiah, the boat's on fiah!"
        ]
    },
    "Richard and Sal throw out the first pitch at the Reading Phillies game.": {
        "title": "Richard and Sal throw out the first pitch at the Reading Phillies game.",
        "score": 16,
        "url": "https://i.redd.it/43ytwf8kri9d1.png",
        "content": "",
        "num_comments": 11,
        "comments": [
            "This was in celebration of Pride Month ",
            "Oh, no!\n\nIs Imus ii going to yell at them now? Saying that the Reading Phillies were just using them in hopes to be mentioned on the p.c. Imus ii podcast",
            "Crowd must have been highly confused as the boys were not allowed to put up that they were from Howard's show, Sirius, or even that they are on radio lmao.",
            "Cream Chipped Beef Hat sounds like a sexual practice Richard and Sal are into.",
            "Did anyone in the crowd know who the fuck they are...?",
            "They shouldve intentionally thrown Booey-balls",
            "How much do you think they got paid for this?",
            "I was so tortured playing baseball? You wouldve been tortured because you were looking for a place to stick the bat up your ass!",
            "They likely know them as much as howimus",
            "Cream chipped beef is muh faaaaavorite"
        ]
    },
    "Off the air footage of the crew discussing the most vile & atrocious guest appearance in the history of cable television.": {
        "title": "Off the air footage of the crew discussing the most vile & atrocious guest appearance in the history of cable television.",
        "score": 7,
        "url": "https://v.redd.it/sytaj3dw4j9d1",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Anyone got the Lotus Notes on the backstory? Already checked GP3 in yellow.",
            "Artie's rationale is, the show was boring so what I did was justified. The same could be said for that scene near the end of joker. And his jokes are funnier.",
            "20 year listener never seen this before.",
            "I remember hearing that the producer told him to go for it if he felt things were dragging, or something like that. Not sure if that is true, but what I read."
        ]
    },
    "Motherfucker I’m on probation.": {
        "title": "Motherfucker I’m on probation.",
        "score": 123,
        "url": "https://i.redd.it/dswl8x3s4e9d1.jpeg",
        "content": "",
        "num_comments": 33,
        "comments": [
            "I gotta tell you son, your act is a piece of shit",
            "Man, Howard really talked some shit about Riley's symbols. This is actually pretty cool looking.",
            "And things of that nature",
            "That is awesome.  Great color too!\n\nRIP Friend Martin.  You were the best.",
            "You call here again mother and I'm calling the cops.",
            "Uh.     .           .            ..               huh?",
            "\"In the Bareknuckle ring whoopin mfs asses that looked like you.\"",
            "Ahhh Shuli. Your act is a piece of shit.",
            "I love this. Good work. I want one for my man cave now.",
            "Oohhh! I have mine hanging in my office at work! Should I post it?"
        ]
    }
}