{
    "Liquid marks on wooden kitchen cabinet. How to remove the stains?": {
        "title": "Liquid marks on wooden kitchen cabinet. How to remove the stains?",
        "score": 8,
        "url": "https://i.redd.it/f6l63xh53h9d1.jpeg",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "How to remove super glue from straw hats?": {
        "title": "How to remove super glue from straw hats?",
        "score": 10,
        "url": "https://i.redd.it/cipe8p7gtg9d1.jpeg",
        "content": "I have a beautiful white and beige straw hat but unfortunately I got super glue on it and it seeped into the hat. I tried the acetone method but it didn't do anything. \nDoes anyone know how to remove deep super glue stains from straw hats without damaging them?",
        "num_comments": 0,
        "comments": []
    },
    "How to repair this busted pipe": {
        "title": "How to repair this busted pipe",
        "score": 2,
        "url": "https://www.reddit.com/gallery/1drcy62",
        "content": "This is a propane water heater that we use for the outdoor shower at our farm property. Just got it last year and it was missed when winterizing. How would I fix that pipe? It doesn't look like I can get it out of the housing without a lot of work and potentially causing more problems. If there is another sub that could help please redirect me. ",
        "num_comments": 0,
        "comments": []
    },
    "How to make toddler pajama bottoms more grippy?": {
        "title": "How to make toddler pajama bottoms more grippy?",
        "score": 2,
        "url": "https://i.redd.it/x42g922cxi9d1.jpeg",
        "content": "After washing toddler pajamas, the feet get less grippy, especially on non-carpeted floor. Right now, the toddler slips and slides and has had some falls. Is there a way to make the feet more grippy?",
        "num_comments": 4,
        "comments": [
            "Hang the pj's to dry instead of putting them in the dryer.",
            "Some people use fabric puffy paint to make their own grippy socks. Looks like it’s washable too, but I have not tried it myself. And then you can use fun colors and cute designs :) ",
            "In addition to the previous reply you could try to put some shoe goo on the tread in a zig zag to create new tread.",
            "Yeah a build up of fabric softener could affect it. Maybe soak in vinegar to remove any residue before next wash."
        ]
    },
    "How to install an underground sprinkler system": {
        "title": "How to install an underground sprinkler system",
        "score": 2,
        "url": "https://youtu.be/vzYoUkAu7ZE?si=FUBofXhvjsX5UT-V",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}