{
    "[Mod Announcement] Repeat violation of subreddit rules will lead to a ban": {
        "title": "[Mod Announcement] Repeat violation of subreddit rules will lead to a ban",
        "score": 350,
        "url": "https://www.reddit.com/r/howyoudoin/comments/tk7amx/mod_announcement_repeat_violation_of_subreddit/",
        "content": "First of all, I apologize on behalf of the moderators for not being responsive enough during the situation we had in this subreddit a few days ago. I’m not blaming the other moderators, because like me, I assume all of them have their own chores to take care of. \n\nFrankly, I’m the newest addition so I usually stay away from stuff like this and let the senior mods handle it, but when I checked the mod queue yesterday (I logged in after months) , it was a dumpster fire. There were so many reports regarding breaking subreddit rules and verbally abusing cast members and subredditors. The main culprit had already been banned , I think one of the other moderators had done that. But there were other creeps who were still roaming free in the sub. I don’t judge people for being horny but there are NSFW subreddits for those kind of things. Also, no one, and I mean no one disrespects Phoebe in this sub! (Rachel and Monica too). But seriously, how much a scum you have to be constantly spamming with posts that degrade women, let alone celebrities? These people should be getting professional help. \n\nSo I went over the reports and deleted posts and comments that had broken the sub rules. Remember you are allowed to criticize a character (that too without calling them slurs) but not the actor/actress. Is that too hard to understand? \nAnd afterwards I checked post history of the users that kept spamming the sub and banned them. Some users who had violated rules once or twice got 1 week / 2 weeks ban while the other got permanent bans. Don’t harass the mods via alternative accounts, asking to overturn that. I made sure I checked the previous post and comment history before banning them. I’ve tried my best to check the reports, some of them were not breaking the rules at all (like memes), and this sub lacks memes imo, therefore I didn’t remove every reported post/comment. If you still have issues, please report them or if it’s too severe, reach out to moderators. And please don’t direct message me, because I’m not always logged in and if you send the message to moderators, chances are at least one of us would see that. \n\nFriends is a sitcom that started airing almost 3 decades ago and while it might not always resonate with the cultural and ethical standards today, we can always get the positive points out of it and have civilized discussions about the show and the characters. This is a wholesome sitcom and therefore, I believe the subreddit too has to be like that. I’ve seen fan subreddits that allow assholes to run rampant but this one shouldn’t be like that. People (including me) love this show not just because of its humor element, but also it acts like a virtual friend who comforts us. So let’s keep the subreddit wholesome so that even the newcomers can enjoy it. \n\nAlso, no politics. Period. I don’t care if you’re left wing, right wing or Chicken wing, this isn’t the sub for that. For the love of God, if any of you started abusing fellow members or cast members, you too will be kicked out, because here in this subreddit we don’t allow sexist, misogynistic assholes. They can sod off. \n\nThank you.",
        "num_comments": 54,
        "comments": [
            "Thank you!! That creep was posting stuff like that in other subreddits too and it was really gross",
            "Chicken?",
            "How dare you remind me how old I’m getting by mentioning 3 decades! 😆",
            "As a supporter of the chicken wing party I feel very discriminated against",
            "Anyone wanna catch me up a bit?",
            "Thanks for the response. Don’t be too sorry, it’s actually better when mods don’t intervene too much, this got out of hand quickly but it’s unwelcome by the majority of members and you’re aware now, so that’s great. Thanks again.",
            "Maybe this subreddit can move to r/friends_tv_show\nThe mods are relatively more active there.",
            "Thank you for your swiftness in dealing with this. That was quite gross   \nto have to click 'hide' for most of the new posts in this group.",
            "https://www.reddit.com/r/howyoudoin/comments/usyhla/how_to_iron_wrapping_paper_just_like_monica/i9az7pn/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3\n\nThat idiot is still spamming porn here.",
            "Hi, I'm new here, but an old fan of 'Friends'\nIs it allowed to post designs with phrases from 'Friends' which I'm selling on Redbubble?"
        ]
    },
    "Joey had a gorgeous haircut in the first season. Why did they ruin it so soon after?": {
        "title": "Joey had a gorgeous haircut in the first season. Why did they ruin it so soon after?",
        "score": 745,
        "url": "https://i.redd.it/igq5ckthoe9d1.jpeg",
        "content": "",
        "num_comments": 71,
        "comments": [
            "He looked so darn good in season one 😩🤌🏻",
            "This has to be Carl's fault",
            "He went gray very early. His hair is dyed every episode.",
            "In the DVD commentary something came up about hair styles. The actors used to tell the producers when they were getting a cut or color change, but the producers did not ask them to do so. The actors just did it out of courtesy. The producers said that they never had anything to say about the actors' personal choices regarding hair. They just let the actors choose their own style and made the necessary adjustments in the show, like dyeing Matt LeBlanc's grays or using a longer wig to cover Lisa's shorter hair cut.",
            " His hair looked the best in season 1 but tbh for the most part I think his hair looked fine the other seasons too.",
            "Honestly I feel like this look went out of style at that time and his haircut which replaced it was more on trend. It looks good now again because the 90s styles are on trend again.",
            "He was so fine in Season 1 😍😍😍",
            "I love those coffee cups so much. Perfect 😃",
            "joey’s hair in s1 went so hard",
            "It was an early 90’s cut and by season 2 we were entering the mid 90’s so everyone just continued to move forward in style. Chandler’s hair as well as Frasier’s in season 3 all had a refreshed look in 1995"
        ]
    },
    "Showing my husband an iconic episode 🛋️": {
        "title": "Showing my husband an iconic episode 🛋️",
        "score": 137,
        "url": "https://i.redd.it/4o1fg321qe9d1.jpeg",
        "content": "It’s the hardest he’s laughed at an episode yet. 🤣 \n\n***PIVOT***",
        "num_comments": 16,
        "comments": [
            "SHUT UP SHUT UP SHUT UUUUUUUPHAIAOQAB",
            "“I mean you had a sketch!”\n\nThis is my absolute favorite episode. I’ve watched this episode ten times more than the others.",
            "I moved a couch today and I had to say 'pivot' like Ross did.",
            "**PIVOT!**",
            "This couch is cut in half.",
            "Lol. A classic",
            "Surely you think a lot of yourself",
            "Don’t forget to show him the bloopers! Lol",
            "lol he’s one of us now\n\n![gif](giphy|ejpCynLi88pGEUbmvQ)",
            "It's also a sweet scene between Ross and Rachel. Because of Emily, Ross is became homeless and Rachel is the one who's there helping him to carry that couch. I just love these funny scenes after those heavy \"Emily\" arc and \"Ross can't see Rachel anymore\" arc.\n\nFor those who are watching the HD/bluray version, here's the part that was cut [https://www.youtube.com/watch?v=dUKLcq4BnbA](https://www.youtube.com/watch?v=dUKLcq4BnbA)"
        ]
    },
    "Can’t tell you how many times a week I say “DAMNIT CARL”": {
        "title": "Can’t tell you how many times a week I say “DAMNIT CARL”",
        "score": 84,
        "url": "https://i.redd.it/eex3060y6f9d1.gif",
        "content": "",
        "num_comments": 12,
        "comments": [
            "WE LIKE PIZZA!",
            "How you dooooin",
            "Did you have another Minute Maid fiasco?",
            "Every time I see Carl posts in this sub, I just remember the trivia one redditor posted — that the actor auditioned for Joey.",
            "https://preview.redd.it/81s3ee4m9f9d1.jpeg?width=602&format=pjpg&auto=webp&s=a0c3832211d8fa2957cbe2067511dd080fafbc57",
            "Go wait in the hall",
            "One of, if not the best Joey episodes",
            "“Hey Mon, heeeey Chan….just getting a soda”",
            "How are you doiiiiiin?",
            "Go wait in the hall...."
        ]
    },
    "F*ck, marry, kill: love interest edition": {
        "title": "F*ck, marry, kill: love interest edition",
        "score": 23,
        "url": "https://www.reddit.com/gallery/1dr3cne",
        "content": "",
        "num_comments": 19,
        "comments": [
            "All I know is that I'll be killing Joshua.",
            "F and marry David. Maybe kill Joshua cause he bugs me lol.",
            "Sex: Tag / Marry: Bruce Willis / Kill: Joshua\n\nSex: Kate / Marry: sex and the city actress / Kill: Janine \n\nSex: Sean Penn / Marry: David (not the final season David) / Kill: Cop (bird killer 🤮)\n\nSex: Chandler's coworker / Marry: Kathy / Kill: Janice (sorry Janice, hate your voice)\n\nSex: Fun Bobby (drunk Bobby, not sober Bobby) / Marry: Richard / Kill: Pete\n\nSex: Charlie / Marry: Mona / Kill: Julie",
            "I am not gay but I would still choose.... I use left to right 1 2 3.\n\n>!You should've put Gavin, he was the only love interest that wasn't only physical. Others were all just physical and Joshua was just a desperation. Ok here we go anyway.!<\n\n*  Rachel\n   * Kill 3\n   * Fuck 1\n   * Marry 2 \n      *  HE IS RICH\n* JOEY\n   * Kill 1\n      * I forgot who she is\n   * Fuck 3\n   * Marry 2\n* Regina Phalange\n   * Kill 1\n   * Fuck 3\n   * Marry 2\n* Chandler Muriel Bing\n   * Kill 3\n   * Fuck 2\n   * Marry 1\n* Monica\n   * Kill 3\n      * I hate him.... its creepy that he knew Monica as a child. I know it is a sitcom but bro.....\n   * Fuck 1\n   * Marry 2\n      * HE IS RICH\n* Mental Geller\n   * Marry and Kill 2\n   * Marry and Fuck then Divorce 1\n   * Marry and stay with 3\n      * She is wife material. She sucked up all of Ross's bullshit. \n      * Even Ross judged why Mona didn't break up with him sooner",
            "Bed: tag, Dina, cop, Janice, Richard, Mona \n\n\nWed: Bruce Willis, the first girl, David, Kathy, Pete, julie \n\n\nBehead: Joshua, Janine, Sean penn, the other girl, Bobby, charlie",
            "Fuck Elizabeth’s Dad, Marry Tag, kill Joshua",
            "I'm shooting straight and that cop Gary & hoping it doesn't miss. \nSex with Richard and Erin.\nMarry Kathy. \nGavin would make my list for fuck and marry.",
            "Fuck: Tag - Marry: Paul - Kill: Joshua.\nTag is handsome but Paul is rich & handsome, I don’t hate Joshua but someone had to go.\n\nFuck: Eric - Marry: David - Kill: Gary.\nI don’t particular want to fuck or marry anyone in this category but Gary sucked for shooting that bird so kill for sure. \n\nFuck: Richard - Marry: Pete - Kill: Fun Bobby.\nNot attracted to any of them, but I guess I might as well be a gold digger and I wasn’t gonna kill off Richard.",
            "Every time I see Mona all I can think about is when Ross says “in a way I kind of judge her for not breaking up with me sooner”",
            "Marry Janine?? That's surprising."
        ]
    }
}