{
    "Important Update: Maintaining Respect and Focus in Our Community": {
        "title": "Important Update: Maintaining Respect and Focus in Our Community",
        "score": 22,
        "url": "https://www.reddit.com/r/HubermanLab/comments/1br4pw8/important_update_maintaining_respect_and_focus_in/",
        "content": "Dear HubermanLab Community,\n\nAs the moderators of this subreddit, we are committed to fostering a respectful, informative, and supportive environment focused on the scientific contributions and insights provided by Dr. Andrew Huberman and his team.\n\nOur platform has always been a place for thoughtful discussion, learning, and growth centered around neuroscience and its application to improving our lives.\n\nWe recognize that recent events may have stirred strong emotions and led to an influx of content that deviates from our core mission. It is crucial to remember that the primary aim of this subreddit is to discuss and share knowledge related to the science of neurobiology and its practical applications, as shared through the HubermanLab.\n\nTo preserve the integrity of our community and ensure it remains a resource for those genuinely interested in its content, we must make it clear that any posts, comments, or content not related to the scientific and educational aspects of the HubermanLab will not be tolerated. This includes, but is not limited to, personal attacks, unsubstantiated claims, and off-topic discussions that do not contribute constructively to our collective learning experience.\n\nWe understand this is a challenging time for our community, and emotions may run high. However, we must ask everyone to respect the purpose of this subreddit. Let us use this moment as an opportunity to reaffirm our commitment to science, learning, and mutual respect.\n\nPlease be aware that moving forward, a strict enforcement of our guidelines will be in place. Any individual found posting inappropriate or off-topic content will face immediate moderation actions, up to and including a permanent ban.\n\nWe appreciate your understanding and cooperation in keeping our community a positive and educational space. Let’s continue to support each other in our pursuit of knowledge and personal growth.\n\nThank you\n\nP.s. If you want to help, the best thing you can do is flag any content that violates our rules. All flagged content will be reviewed.",
        "num_comments": 0,
        "comments": []
    },
    "The strength gains from following Mike Mentzer's HIT protocol are insane": {
        "title": "The strength gains from following Mike Mentzer's HIT protocol are insane",
        "score": 3,
        "url": "https://www.reddit.com/r/HubermanLab/comments/1drb4hv/the_strength_gains_from_following_mike_mentzers/",
        "content": "I've been on this protocol for a few months because I've been traveling and missing many workouts. The basic premise is that you rest at least 96 hours between workouts, regardless which muscle group you work on.\n\nAnd you only do 1-2 sets per exercise to absolute failure, this doenst mean its easier, you will have to push yourself very hard. \n\nI was stuck forever on military press doing push pull legs but with this protocol I was able to gain 1-2 reps per week until I stacked more weight and so on.\n\nI saw a bunch of shorts by Mike Mentzer and then I listened to his Heavy duty book, which really opened my eyes on how much time I've been wasting in the gym doing more and more volume. \n\nIf high volume works for you and you see progress, thats great but this works for me.",
        "num_comments": 3,
        "comments": [
            "How often do you workout on his program? I work a 3/4 schedule at work and can only workout 2x per week before hitting fatigue, usually 48-72 hours apart, in that case could i workout once a week? That doesn't seem optimal for me. I would love to try it on a 2 day plan, but if i have to wait 96 hours, that would be tough.",
            "You’re following the true Mentzer Program? Not the one Dorian Yates did? \n\nThat’s really interesting and I am sure a lot of bodybuilders would like to hear about it. I’ve done his modified program for years and it got me to a HW bodybuilder physique. Lots of food and other stuff was involved. But I’m glad you’re following the program those are awesome gains.",
            "Hello! Don't worry about the post being filtered. We want to read and review every post to ensure a thriving community and avoid spam. Your submission will be approved (or declined) soon.\n\nWe hope the community engages with your ideas thoughtfully and respectfully. And of course, thank you for your interest in science!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HubermanLab) if you have any questions or concerns.*"
        ]
    },
    "What supplements should Joe Biden take to offset his cognitive decline?": {
        "title": "What supplements should Joe Biden take to offset his cognitive decline?",
        "score": 218,
        "url": "https://www.reddit.com/r/HubermanLab/comments/1dqj5nu/what_supplements_should_joe_biden_take_to_offset/",
        "content": "It was painful to watch Joe Biden mumbling his way through that debate with Trump. What protocols should Joe Biden implement to help him get sharper mentally?",
        "num_comments": 392,
        "comments": [
            "The protocol is called retirement",
            "Good night of sleep, sun exposure first thing in the morning, followed by blood transfusions from virgin young men, testosterone replacement therapy and a cocktail of pure cocaine mixed with crack!",
            "A supplemental candidate might work",
            "First off, hes clearly hes not taking his AG-1. Secondly, theres no way this man is waiting 4 hours upon waking to drink his coffee. Thirdly, you can be assured hes not doing a testicle ice bath in the morning. Lastly and most importantly, hes a twink and hes not blasting TRT. Lots of room for improvement, Mr. President",
            "AG1 and 6xF girlfriend pickups",
            "Retirement and i dont mean that in a bad way. What a great life filled with accomplishments that less than 45 other people have been able to experience, just enjoy the rest of it peacefully.",
            "Are you kidding he’s god damn 81 years old most people his age are zoned out watching price is right",
            "He's the POTUS, he has access to stuff we've never even heard of. That performance was *after* he took whatever shit they gave him and it was still that bad. Just imagine his normal state.",
            "I think glynac has shown promise for aging, as well as blueberry juice and Curcumin",
            "The guy is in his 80s and had a brain aneurysm a few years ago. Supplements wont fix that. He needs to retire."
        ]
    },
    "Have you listened to Barbell's Medicine Podcast's review of the Huberman's Back Pain episode?": {
        "title": "Have you listened to Barbell's Medicine Podcast's review of the Huberman's Back Pain episode?",
        "score": 4,
        "url": "https://www.reddit.com/r/HubermanLab/comments/1dr82uz/have_you_listened_to_barbells_medicine_podcasts/",
        "content": "Link: https://podcasts.apple.com/gb/podcast/barbell-medicine-podcast/id1199780143?i=1000654314940\n\nThe first 40 minutes reviews the podcast content. Interesting perspective from two powerlifters who are physicians and treat patients with back pain.",
        "num_comments": 2,
        "comments": [
            "TLDL version: They discuss several inaccuracies from the episode regarding the description of the anatomy as well as methods being recommended with shaky science behind it (eg. only working in 5 of 11 cases when tested on pig spines)",
            "Hello! Don't worry about the post being filtered. We want to read and review every post to ensure a thriving community and avoid spam. Your submission will be approved (or declined) soon.\n\nWe hope the community engages with your ideas thoughtfully and respectfully. And of course, thank you for your interest in science!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HubermanLab) if you have any questions or concerns.*"
        ]
    },
    "TUO bulbs worth it?": {
        "title": "TUO bulbs worth it?",
        "score": 2,
        "url": "https://www.reddit.com/r/HubermanLab/comments/1drb8nq/tuo_bulbs_worth_it/",
        "content": "I have heard quite a bit about circadian bulbs but I cannot distinguish why the TUO bulbs are so much more expensive than other circadian bulbs I find online. I just want to use one at my desk and am leaning towards something cheaper. ",
        "num_comments": 2,
        "comments": [
            "Just get a big ass corn bulb on Amazon. Then you don’t need to sit near it.",
            "Hello! Don't worry about the post being filtered. We want to read and review every post to ensure a thriving community and avoid spam. Your submission will be approved (or declined) soon.\n\nWe hope the community engages with your ideas thoughtfully and respectfully. And of course, thank you for your interest in science!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HubermanLab) if you have any questions or concerns.*"
        ]
    }
}