{
    "Important Update: Maintaining Respect and Focus in Our Community": {
        "title": "Important Update: Maintaining Respect and Focus in Our Community",
        "score": 20,
        "url": "https://www.reddit.com/r/HubermanLab/comments/1br4pw8/important_update_maintaining_respect_and_focus_in/",
        "content": "Dear HubermanLab Community,\n\nAs the moderators of this subreddit, we are committed to fostering a respectful, informative, and supportive environment focused on the scientific contributions and insights provided by Dr. Andrew Huberman and his team.\n\nOur platform has always been a place for thoughtful discussion, learning, and growth centered around neuroscience and its application to improving our lives.\n\nWe recognize that recent events may have stirred strong emotions and led to an influx of content that deviates from our core mission. It is crucial to remember that the primary aim of this subreddit is to discuss and share knowledge related to the science of neurobiology and its practical applications, as shared through the HubermanLab.\n\nTo preserve the integrity of our community and ensure it remains a resource for those genuinely interested in its content, we must make it clear that any posts, comments, or content not related to the scientific and educational aspects of the HubermanLab will not be tolerated. This includes, but is not limited to, personal attacks, unsubstantiated claims, and off-topic discussions that do not contribute constructively to our collective learning experience.\n\nWe understand this is a challenging time for our community, and emotions may run high. However, we must ask everyone to respect the purpose of this subreddit. Let us use this moment as an opportunity to reaffirm our commitment to science, learning, and mutual respect.\n\nPlease be aware that moving forward, a strict enforcement of our guidelines will be in place. Any individual found posting inappropriate or off-topic content will face immediate moderation actions, up to and including a permanent ban.\n\nWe appreciate your understanding and cooperation in keeping our community a positive and educational space. Let’s continue to support each other in our pursuit of knowledge and personal growth.\n\nThank you\n\nP.s. If you want to help, the best thing you can do is flag any content that violates our rules. All flagged content will be reviewed.",
        "num_comments": 0,
        "comments": []
    },
    "What supplements should Joe Biden take to offset his cognitive decline?": {
        "title": "What supplements should Joe Biden take to offset his cognitive decline?",
        "score": 197,
        "url": "https://www.reddit.com/r/HubermanLab/comments/1dqj5nu/what_supplements_should_joe_biden_take_to_offset/",
        "content": "It was painful to watch Joe Biden mumbling his way through that debate with Trump. What protocols should Joe Biden implement to help him get sharper mentally?",
        "num_comments": 358,
        "comments": [
            "Hello! Don't worry about the post being filtered. We want to read and review every post to ensure a thriving community and avoid spam. Your submission will be approved (or declined) soon.\n\nWe hope the community engages with your ideas thoughtfully and respectfully. And of course, thank you for your interest in science!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HubermanLab) if you have any questions or concerns.*",
            "The protocol is called retirement",
            "Poppers and Psilocybin",
            "Good night of sleep, sun exposure first thing in the morning, followed by blood transfusions from virgin young men, testosterone replacement therapy and a cocktail of pure cocaine mixed with crack!",
            "A supplemental candidate might work",
            "First off, hes clearly hes not taking his AG-1. Secondly, theres no way this man is waiting 4 hours upon waking to drink his coffee. Thirdly, you can be assured hes not doing a testicle ice bath in the morning. Lastly and most importantly, hes a twink and hes not blasting TRT. Lots of room for improvement, Mr. President",
            "AG1 and 6xF girlfriend pickups",
            "Perineum Sunning",
            "1890's Coca-Cola",
            "Are you kidding he’s god damn 81 years old most people his age are zoned out watching price is right"
        ]
    },
    "Is it possible to build muscle if one cannot lift but very light weights?": {
        "title": "Is it possible to build muscle if one cannot lift but very light weights?",
        "score": 16,
        "url": "https://www.reddit.com/r/HubermanLab/comments/1dqm1gl/is_it_possible_to_build_muscle_if_one_cannot_lift/",
        "content": "I cannot lift weights because of a health condition (if I do, my lungs will hurt, badly - unfortunately, there is no solution to my condition). Again, I cannot lift weights nor do any activity that will get you out of breath.\n\nIs there a way for people in this kind of situation to build muscle? I dont think lifting very small weights for many reps and for a long time would work. Toning the muscles it would, but I would say that for that I am better off gardening or doing other similar activities (to the extent I can).\n\nThanks in advance for your help.",
        "num_comments": 31,
        "comments": [
            "Hello! Don't worry about the post being filtered. We want to read and review every post to ensure a thriving community and avoid spam. Your submission will be approved (or declined) soon.\n\nWe hope the community engages with your ideas thoughtfully and respectfully. And of course, thank you for your interest in science!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HubermanLab) if you have any questions or concerns.*",
            "I don’t like breathlessness when I’m weight training so I do fewer & slower reps with very controlled breathing. It can almost feel like meditation when you are focused on nice long in breaths through the nose and out the mouth while lifting at same time. And there’s a good hack for this. Don’t play pumped up music in your earphones. Play zen music (like the stuff you hear in a spa or massage place. Make yourself a play list). Let that be your soundscape. And you will become the most chilled weight lifter. \n\nGood luck!",
            "zero weights is still good, just master the movements",
            "Try [EMS](https://en.wikipedia.org/wiki/Electrical_muscle_stimulation) [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6464134/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6464134/)  \nWhen choosing a device note that TENS != EMS",
            "[deleted]",
            "Yes. Be sure to make reps last at least 2-4 seconds, mostly focusing on slow eccentric movement . Training at end of range will also help. Loading a muscle while stretched is said to maximize benefits.",
            "It's confirmed that you can still grow muscles by performing up to 30 rep sets. Is that still under the amount of reps you can do with the weights you can handle?\n\nThe key to building muscles is doing between 10 and 20 hard sets weekly per muscle group, getting the sets very close to failure (having 2 reps in reserve is close enough) and eating a surplus of calories. It's hard to miss it and not worth it to overthink it. Just do it\n\nNike",
            "Have you tried blood flow restriction training? I would recommend working with a PT on that.",
            "Push ups off ur knees one day squats the next, rest day , start over ",
            "Yes pushups and pullups are enough. Don't listen to gym bros"
        ]
    },
    "Rick": {
        "title": "Rick",
        "score": 0,
        "url": "https://www.reddit.com/r/HubermanLab/comments/1dr3ydx/rick/",
        "content": "…",
        "num_comments": 1,
        "comments": [
            "Hello! Don't worry about the post being filtered. We want to read and review every post to ensure a thriving community and avoid spam. Your submission will be approved (or declined) soon.\n\nWe hope the community engages with your ideas thoughtfully and respectfully. And of course, thank you for your interest in science!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HubermanLab) if you have any questions or concerns.*"
        ]
    },
    "How i can  increase my focus?": {
        "title": "How i can  increase my focus?",
        "score": 2,
        "url": "https://www.reddit.com/r/HubermanLab/comments/1dqthet/how_i_can_increase_my_focus/",
        "content": "How i can  increase memory?\n",
        "num_comments": 5,
        "comments": [
            "Hello! Don't worry about the post being filtered. We want to read and review every post to ensure a thriving community and avoid spam. Your submission will be approved (or declined) soon.\n\nWe hope the community engages with your ideas thoughtfully and respectfully. And of course, thank you for your interest in science!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HubermanLab) if you have any questions or concerns.*",
            "Many ways. Diet, supplements, exercise. We need more info about you though.",
            "Do you suffer from ahdh or just can't focus? Because there are very different \"protocols\" in dealing with them.",
            "memory: NAC, good sleep, physical exercise\nfocus: caffeine or nicotine (as a gum so u dont harm ur health as much). enough short breaks from your activity, fresh air and even a small walk, and not overdoing things.\nall supported by a healthy diet, sunlight exposure and distancing yourself from any toxic environment. i quit my adhd meds because in an environment i can motivate myself, i no longer need them in order to function. nicotine is debatable since i think it gives good focus but they should develop some adhd med XR version of it.",
            "Lions mane"
        ]
    }
}