{
    "/r/HunterXHunter 1 Million Survey Results - Favorite Characters": {
        "title": "/r/HunterXHunter 1 Million Survey Results - Favorite Characters",
        "score": 104,
        "url": "https://www.reddit.com/r/HunterXHunter/comments/1bh1sew/rhunterxhunter_1_million_survey_results_favorite/",
        "content": "The results are in! And while the participation was sadly disappointing with a 97.5% decrease compared to last time, hopefully the actual results wont be.\n\nSo who were your favorite characters from the 2011 anime?! Check out the chart below.\n\n---\n\n#RESULTS\n\n|Rank|Character|Popularity|\n|-|-|-|\n|1|Killua|73.2%\n|2|Kurapika|66.5%\n|3|Gon|62.6%\n|4|Hisoka|56.4%\n|5|Chrollo|55.6%\n|6|Meruem|55.3%\n|7|Leorio|51.4%\n|8|Netero|45.9%\n|9|Knuckle|42%\n|10|Morel|41.6%\n|11|Biscuit|38.9%\n|12|Ging|37.7%\n|13|Neferpitou|35.8%\n|14|Kite, Komugi|31.5%\n|16|Pariston Hill|29.6%\n|17|Zeno|29.2%\n|18|Melody|28.8%\n|19|Machi|27.2%\n|20|Illumi, Feitan|26.1%\n|22|Shaiapouf|22.6%\n|23|Ikalgo|21%\n|24|Alluka, Nobunaga|19.8%\n|26|Phinks, Silva|17.9%\n|28|Pakunoda|16.3%\n|29|Uvogin|16%\n|30|Razor|14.8%\n|31|Shoot|14.4%\n|32|Knov|14%\n|33|Meleoron|13.6%\n|34|Shizuku|12.5%\n|35|Shalnark|11.7%\n|36|Gotoh, Menthuthuyoupi|10.1%\n|38|Canary, Hanzo|9.7%\n|40|Wing|9.3%\n|41|Palm|8.9%\n|42|Kalluto|7.8%\n|43|Welfin, Zushi|7%\n|45|Tonpa|6.2%\n|46|Colt, Ponzu, Satotz|5.8%\n|49|Mito|5.1%\n|50|Cheadle|4.7%\n|51|Basho, Bonolenov, Gyro, Menchi, Pokkle|3.5%\n|56|Beans, Franklin, Genthru, Goreinu, Neon Nostrade|3.1%\n|61|Mizaistom, Tsubone|2.7%\n|63|Kortopi|2.3%\n|64|Cheetu, Izunavi, Kastro, Tsezguerra, Zepile|1.9%\n|69|Amane, Cluck, Kanzai, Kurt, Ship Captain, Squala|1.6%\n|74|Abengane, Assassin B, Koala, Leol, Peggy, Spinner Clow|1.2%\n|80|Assassin A, Bean, Elena, Gel, Hina, Linne Horsdoeuvre, Kikyo, Loupe, Mito's Grandmother, Owl, Pike, Pyon, Stick Dinner|0.8%\n|93|Baise, Bara, Bat, Bloster, Botobai, Chimera Ant Queen, Cocco, Coco Loo, Dalzollene, Light Nostrade, Linssen, Lippo, Quizzing Lady, Rabid Dog, Reina, Shidore, Sub, Worm, Zazan, Zebro, Zenji|0.4%\n\n---\n\n#Future Surveys\n\nPlease look forward to the next surveys when we get news about a return from hiatus. We'll be asking you about your favorite characters from the manga, post-anime, as well as your favorite arcs. Hopefully participation will be better then.",
        "num_comments": 69,
        "comments": [
            "Ofcourse Hisoka gets 4",
            "The 15th chairman election results are out!",
            "I love kurapika but I can’t believe he beat gon!!",
            "The top 3 match the [official popularity polls](https://hunterxhunter.fandom.com/wiki/Category:Popularity_poll) that were published. Pretty accurate considering the low turnout.",
            "didnt even know there was a survey",
            "The bad guys in HxH are so bad (e.g. torturers, rapists, murderers of children), that I can't really use the word \"like\" to describe my relationship to their design, personality, nen ability, and so on.\n\nMaybe Hisoka and some of the Zoldycks have sufficient redeemable qualities to be liked? They seem to have rules about who they harm and to what extent. They often let people leave unscathed; Hisoka likes fair fights and the Zoldycks only kill \"professionally\". I dunno.\n\nThen there's Meruem. Although he's guilty of indiscriminate killing, matricide, infanticide, and other callous, murderous acts...His ignorance concerning morality and human nature allows me to forgive him. >!If he had survived and spent the rest of life living a life of nonviolence and good works,!<I think that would work.\n\nOut of the good guys...I hate the fashion styles of Kurapica and Leorio. Kurapica's nen abilities, although very powerful, are not appealing to me. I like Gon and Killua.",
            "Now, can we get the 40K Survey results?\n\nI'm never letting that go.",
            "Killuaaaa! ❤️❤️❤️",
            "Pitou on place 13 - let's go! :3",
            "[deleted]"
        ]
    },
    "The Dank Continent — Weekly Low Effort Content and Off Topic Discussion (week of June 25, 2024)": {
        "title": "The Dank Continent — Weekly Low Effort Content and Off Topic Discussion (week of June 25, 2024)",
        "score": 3,
        "url": "https://www.reddit.com/r/HunterXHunter/comments/1dnwyy7/the_dank_continent_weekly_low_effort_content_and/",
        "content": "Hi there everyone, and welcome back to the Dank Continent. For those who don't know, this is our weekly thread for you to post memes, shitposts, or any other content that would normally get removed for being \"low effort.\"  [**Past Threads**](https://www.reddit.com/r/HunterXHunter/search?sort=new&restrict_sr=on&q=flair%3ADank%2BContinent)",
        "num_comments": 19,
        "comments": [
            "What is the source of this [This photo](https://x.com/kurapikagallery/status/1797684764809531697?t=JoXW0nKW532QMvz1V7ExnQ&s=19)? I thought we only had the cropped version in the volume!",
            "u/Carock_ I finally finished Assassin's Quest, overall it was a really emotional read and I haven't felt that sad to finish a series in a while. Solid A tier book, and once they got to the Skill Road I was hooked. I'm kinda glad I finished Liveship Traders first since it basically explores >!what Verity did and the entire lore behind the Elderlings and their magic practices with memory stone to craft fake dragons. I probably would've been a bit lost if I finished Farseer first lol!<\n\nAlso now I know why Amber wears gloves in Liveship Traders. Makes me wonder too if >!Wintrow!< is Skilled.\n\nAlso rankings so far:\n\n1. The Mad Ship (S)\n2. Ship of Magic (S)\n3. Royal Assassin (S)\n4. Ship of Destiny (A+)\n5. Assassin's Quest (A)\n6. Assassin's Apprentice (A-)",
            "Togodshi we bow",
            "Have a nice week everyone and we can smile again :3",
            "I really want Luigi's Mansion 2 hd, but the price is just insulting \n\nIt costs more than when it came out 15 years ago",
            "[deleted]",
            "Not off topic but I don't want to make a whole post about it.\n\nI just finished the anime, and I want to know about the manga. HxH's manga is famously always on hiatus, soo... is it even worth to read it?\n\nHow much ahead is it from the anime? Any finished arcs?\n\nDo we resurrect Ponzu and Pitou with the Dragon Balls?",
            "Persona 3 Reload is on slae but it's still $50. No regional pricing killed steam here man.",
            "just finished the anime , does anyone know where the manga starts after the anime and how many chapters have been released? thanks!!",
            "Maybe unpopular opinion but Togodshi’s stories  reach new levels of peak whenever the mafia is involved."
        ]
    },
    "New tweet from Togashi (June 28, 2024)": {
        "title": "New tweet from Togashi (June 28, 2024)",
        "score": 706,
        "url": "https://i.redd.it/ntklz9ap6b9d1.png",
        "content": "",
        "num_comments": 50,
        "comments": [
            "[Link to tweet](https://twitter.com/Un4v5s8bgsVk9Xp/status/1806670555355189615)",
            "Isn't this the 2nd or 3rd time we are seeing Gon in blue? \n\nFor a character that has been with the same colors this whole time, this is, at least, of notice",
            "I wonder if we are gonna see Gon regaining his abilities.",
            "Ah yes, Bonolenov using his disguising hatsu. We finally get to see it.",
            "Gon is going on the manga?",
            " fans rejoice",
            "Good to see he's enjoying retirement",
            "man really wants us to know gon is alive and kickin",
            "Is Gon coming back?",
            "New chapter on duh wei"
        ]
    },
    "But it is though": {
        "title": "But it is though",
        "score": 14,
        "url": "https://i.redd.it/4biapqoewg9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Not wrong though"
        ]
    },
    "How did Shalnark become a hunter without any personal records?": {
        "title": "How did Shalnark become a hunter without any personal records?",
        "score": 113,
        "url": "https://www.reddit.com/r/HunterXHunter/comments/1dqt1pf/how_did_shalnark_become_a_hunter_without_any/",
        "content": "I know anyone can become a hunter but don’t you need some kind of legal document to show who you are? \n\nWhen they were speaking of disqualifying Illumi someone brought up the point that he didn’t use his real name. But then it was pointed out he was only using Gittaraker as an alias and singed up using his real name. \n\nAlso, it’s said that the hunters license is useless to everyone else but can sell for a lot since collectors buy them. This means you have to have an identity attached to the license. ",
        "num_comments": 30,
        "comments": [
            "Probably because the hunger association really doesn’t give a fuck about who becomes a hunter as long as they are powerful and can protect the secret of nen.",
            "He could just fake some 🤷🏻‍♂️",
            "He was born with no personal records. By the time he became a hunter he'd probably obtained some - illegal or otherwise.\n\nThere are things called Golden Visa's where you essentially 'buy' a nationality by investing significant money (typically $250,000 or more) in certain countries - it's reasonable HxH's world has similar loopholes.",
            "I have a friend that was birthed at home and his parents never informed the government so like he only got documents after being an adult already. You can get documents legitimately if you started off without them.",
            "He became a hunter because he passed the hunter exam that he took. Also He knows his name and he came from meteor city and most likely his photo was taken/recorded on the hunter database and that is plenty enough of an identity to be recorded on his license. The fact that they even accepted Gon who is 12 yrs old(not sure iirc) at that time and apparently Tonpa was 10yrs old when he first took it means that the HA could care less when someone was born or who they are.",
            "I mean... Hisoka is Hunter :3",
            "Dude come on, do you think there were records on Illumi? He even registered under Gittarackur and no one gave a flying fuck",
            "Not in the manga. (?)  \nAs long as you make it to the testing grounds you are illegible for the exam.  \nThe name you give will be registered on the license.",
            "Giving how wild the world of HxH is, I'm sure they don't give a f* if you come from the City of fallen start, the hunter association could even give you an ID after.",
            "I think they could have just given him a card with no name and just the number. But Shalnark probably has a fake ID and fake papers in case he needs them."
        ]
    }
}