{
    "/r/HunterXHunter 1 Million Survey Results - Favorite Characters": {
        "title": "/r/HunterXHunter 1 Million Survey Results - Favorite Characters",
        "score": 105,
        "url": "https://www.reddit.com/r/HunterXHunter/comments/1bh1sew/rhunterxhunter_1_million_survey_results_favorite/",
        "content": "The results are in! And while the participation was sadly disappointing with a 97.5% decrease compared to last time, hopefully the actual results wont be.\n\nSo who were your favorite characters from the 2011 anime?! Check out the chart below.\n\n---\n\n#RESULTS\n\n|Rank|Character|Popularity|\n|-|-|-|\n|1|Killua|73.2%\n|2|Kurapika|66.5%\n|3|Gon|62.6%\n|4|Hisoka|56.4%\n|5|Chrollo|55.6%\n|6|Meruem|55.3%\n|7|Leorio|51.4%\n|8|Netero|45.9%\n|9|Knuckle|42%\n|10|Morel|41.6%\n|11|Biscuit|38.9%\n|12|Ging|37.7%\n|13|Neferpitou|35.8%\n|14|Kite, Komugi|31.5%\n|16|Pariston Hill|29.6%\n|17|Zeno|29.2%\n|18|Melody|28.8%\n|19|Machi|27.2%\n|20|Illumi, Feitan|26.1%\n|22|Shaiapouf|22.6%\n|23|Ikalgo|21%\n|24|Alluka, Nobunaga|19.8%\n|26|Phinks, Silva|17.9%\n|28|Pakunoda|16.3%\n|29|Uvogin|16%\n|30|Razor|14.8%\n|31|Shoot|14.4%\n|32|Knov|14%\n|33|Meleoron|13.6%\n|34|Shizuku|12.5%\n|35|Shalnark|11.7%\n|36|Gotoh, Menthuthuyoupi|10.1%\n|38|Canary, Hanzo|9.7%\n|40|Wing|9.3%\n|41|Palm|8.9%\n|42|Kalluto|7.8%\n|43|Welfin, Zushi|7%\n|45|Tonpa|6.2%\n|46|Colt, Ponzu, Satotz|5.8%\n|49|Mito|5.1%\n|50|Cheadle|4.7%\n|51|Basho, Bonolenov, Gyro, Menchi, Pokkle|3.5%\n|56|Beans, Franklin, Genthru, Goreinu, Neon Nostrade|3.1%\n|61|Mizaistom, Tsubone|2.7%\n|63|Kortopi|2.3%\n|64|Cheetu, Izunavi, Kastro, Tsezguerra, Zepile|1.9%\n|69|Amane, Cluck, Kanzai, Kurt, Ship Captain, Squala|1.6%\n|74|Abengane, Assassin B, Koala, Leol, Peggy, Spinner Clow|1.2%\n|80|Assassin A, Bean, Elena, Gel, Hina, Linne Horsdoeuvre, Kikyo, Loupe, Mito's Grandmother, Owl, Pike, Pyon, Stick Dinner|0.8%\n|93|Baise, Bara, Bat, Bloster, Botobai, Chimera Ant Queen, Cocco, Coco Loo, Dalzollene, Light Nostrade, Linssen, Lippo, Quizzing Lady, Rabid Dog, Reina, Shidore, Sub, Worm, Zazan, Zebro, Zenji|0.4%\n\n---\n\n#Future Surveys\n\nPlease look forward to the next surveys when we get news about a return from hiatus. We'll be asking you about your favorite characters from the manga, post-anime, as well as your favorite arcs. Hopefully participation will be better then.",
        "num_comments": 69,
        "comments": [
            "The 15th chairman election results are out!",
            "I love kurapika but I cant believe he beat gon!!",
            "didnt even know there was a survey",
            "Now, can we get the 40K Survey results?\n\nI'm never letting that go.",
            "Pitou on place 13 - let's go! :3",
            "ohh i didnt know pariston's surname was hill lol i see the word play now",
            "Nobunaga is kinda cool and lame at the same time. He is somewhat stupid at times, and extremely straight-forward, kinda like Gon (with different things they value). He doesn't think much about what he does, he just instantly goes in.",
            "im suprised chrollo is at #5. hes not a favorite character of mines but i thought he would be at 2 or 3. i stilll dont understand ow killua is at #1.",
            "For some reason I thought Shizuku would be higher up (maybe all the cosplays) and didn't realize Machi would be the second most popular Spider (I mean, I voted for her but I probably voted for Peggy as well so my preferences don't say much).\n\nWho the heck voted for Pike lol.",
            "Uvogin in top 30, let's gooo\n\nCan someone please link the previous poll?"
        ]
    },
    "The Dank Continent — Weekly Low Effort Content and Off Topic Discussion (week of June 25, 2024)": {
        "title": "The Dank Continent — Weekly Low Effort Content and Off Topic Discussion (week of June 25, 2024)",
        "score": 3,
        "url": "https://www.reddit.com/r/HunterXHunter/comments/1dnwyy7/the_dank_continent_weekly_low_effort_content_and/",
        "content": "Hi there everyone, and welcome back to the Dank Continent. For those who don't know, this is our weekly thread for you to post memes, shitposts, or any other content that would normally get removed for being \"low effort.\"  [**Past Threads**](https://www.reddit.com/r/HunterXHunter/search?sort=new&restrict_sr=on&q=flair%3ADank%2BContinent)",
        "num_comments": 19,
        "comments": [
            "Have a nice week everyone and we can smile again :3",
            "I really want Luigi's Mansion 2 hd, but the price is just insulting \n\nIt costs more than when it came out 15 years ago",
            "Persona 3 Reload is on slae but it's still $50. No regional pricing killed steam here man.",
            "just finished the anime , does anyone know where the manga starts after the anime and how many chapters have been released? thanks!!",
            "Maybe unpopular opinion but Togodshis stories  reach new levels of peak whenever the mafia is involved.",
            "\"This photo is printed in one of the old HxH volumes. Maybe from the time he attended  cons.\"\n\nby @/mori\\_yyh4ever on twitter",
            "Yeah about 10% through Fools Errand and loving it, hating Starling more and more with every page though. >!I lost all respect for her when she told Hap hes as cold as a rapist because he told Fitz shes cheating on her husband!<",
            "Is he still writing it?",
            "Minstrels do have a way with words, lol. Her best insults are for Fitz though. More to come XD",
            "u/Carock_ I finally finished Assassin's Quest, overall it was a really emotional read and I haven't felt that sad to finish a series in a while. Solid A tier book, and once they got to the Skill Road I was hooked. I'm kinda glad I finished Liveship Traders first since it basically explores >!what Verity did and the entire lore behind the Elderlings and their magic practices with memory stone to craft fake dragons. I probably would've been a bit lost if I finished Farseer first lol!<\n\nAlso now I know why Amber wears gloves in Liveship Traders. Makes me wonder too if >!Wintrow!< is Skilled.\n\nAlso rankings so far:\n\n1. The Mad Ship (S)\n2. Ship of Magic (S)\n3. Royal Assassin (S)\n4. Ship of Destiny (A+)\n5. Assassin's Quest (A)\n6. Assassin's Apprentice (A-)"
        ]
    },
    "New tweet from Togashi (June 29, 2024)": {
        "title": "New tweet from Togashi (June 29, 2024)",
        "score": 218,
        "url": "https://i.redd.it/hendsp5ldh9d1.png",
        "content": "",
        "num_comments": 23,
        "comments": [
            "Are they sailor moon characters at bottom of page?\nWondering if he drew it.",
            "Dude hasn't had many reasons to draw Gon in the current arc, probably just misses his boy.",
            "Gon the older women enthusiast",
            "OMG how much I love Togashi's art!!!! And people still want somebody else drawing HxH, you guys are nuts!",
            "Sailor Guardians at the bottom??? lmao",
            "THE GOAT IS SINGING ",
            "Sailor moon omg two of my favourite shows together!!",
            "Not Togashi just spoiling a scene of Gon rizzing up the Sailor Moon characters in the Succession War Arc",
            "He's also using Naoko Takeuchi's manuscript paper here.",
            "The Inner Senshi arent that much older than Gon. The age difference is 2 years at most."
        ]
    },
    "Patch of Shore": {
        "title": "Patch of Shore",
        "score": 27,
        "url": "https://i.redd.it/jg1h58n62i9d1.jpeg",
        "content": "Found this cool key chain at Animate Nipponbashi. A bit pricey though but I guess its okay considering I didnt have to fight Razor.",
        "num_comments": 3,
        "comments": [
            "Did anyone die in the volleyball game?",
            "Good job beating the dodgeball game",
            "Gem :3"
        ]
    }
}