{
    "Subreddit rules - October 2023": {
        "title": "Subreddit rules - October 2023",
        "score": 18,
        "url": "https://www.reddit.com/r/hvacadvice/comments/17k734h/subreddit_rules_october_2023/",
        "content": "This post will serve to collect the current ruleset of [r/hvacadvice](https://web.archive.org/web/20220821120517/https://www.reddit.com/r/hvacadvice) as of **October 2023**.\n\n[r/HVACadvice](https://web.archive.org/web/20220821120517/https://www.reddit.com/r/HVACadvice) exists to give end users, homeowners, renters, and others a place to ask their questions about HVAC systems, filters, pricing, and troubleshooting.\n\n**1) When posting in this sub, please include in brackets the type of fuel and make and model of the unit.** *Also please post as many pictures of the unit and components as possible.* Something you may not think is important to your problem may be important to us to figure out what is wrong.\n\n**2) Mods, homeowners, and end users should be the only people making posts in this subreddit.** If you are a tech and have a question, go to [r/hvac](https://web.archive.org/web/20220821120517/https://www.reddit.com/r/hvac), even if it seems like a stupid question.\n\n**3) ALL HVAC techs offering advice should be verified to get \"Approved Technician\" flair.** This ensures that the people giving the advice are qualified to give it. Using imgur or some other hosting service, [send the mods a picture](https://www.reddit.com/message/compose/?to=/r/hvacadvice) that includes your license, EPA card, or a qualifying certificate *along with* a piece of paper that has your Reddit username and the date. **All** identifying information, such as phone or license numbers, names, or companies should be redacted. This is basically the verification system used on gonewild but applied to good purposes, not just awesome ones. Once you have your flair, please feel free to delete your picture.\n\n* If you are giving advice from an unflaired account, it may be removed at a moderator's discretion.\n* **All advice given must be safe.** An immediate ban will be given to anybody who, in the moderator's assessment, is knowingly giving out unsafe advice. If a reply to your question seems sketchy, \"report\" the post, and a mod will check it out.\n* **All advice given must be public.** Anyone asking you to PM them or who messages you with a solution that they don't want to post in the sub is quite possibly advocating a potentially dangerous fix. Don't engage them, and report the post to the mods.\n* **Mods have the right to revoke your flair based on bad practices/bad advice at our discretion.** You will receive a Probation flair, and after 6 months, you may get your flair back. If you lose your flair again, you will be permanently banned. \n\n**4) Absolutely no advertising is permitted.** You can not link to your blog. You can not promote a product. You can not post your company's contact information, or the contact information of any specific service provider for any reason.\n\n* It must also be noted that Reddit automatically removes posts or comments containing links from Alibaba, link-shortening websites, amazon (almost always), and image-hosting services other than imgur, among others. The mods do not have time to police removed comments or posts to check if the link was okay and we will not reapprove them, so just don't post links.\n* Offers of jobs or requests for employees are prohibited.\n* You can not link to the service that you are making. You can not link to a survey for people. You can not ask about lead generation. You can not link a poll. No companies offering a service on this sub are allowed. Your post will be removed and you will be banned.\n\n**5) Some things are not safe to DIY and are not open to discussion.** An up-to-date list will always be located on the subreddit's sidebar.\n\n**6) Keep in mind that those who chose to answer your questions** are doing so out of the goodness of their own heart and spending their very valuable time trying to help you. Please be kind and respectful and you will be treated the same.\n\n**7) Basic civility is required.** No politics, name-calling, or other nonsense.\n\n* Follow [reddiquette](https://web.archive.org/web/20220821120517/https://reddit.zendesk.com/hc/en-us/articles/205926439-Reddiquette) and be polite.\n* We will remove shitty comments and ban assholes. This rule should count as your only warning.\n\nAny questions or comments about these rules, or suggestions or complaints, should go here.",
        "num_comments": 0,
        "comments": []
    },
    "Trane TCONT203AS42MA Thermostat, 7 Day or 5-1-1 Programmable Schedule, Heat/Cool, XR203 ballpark estimate of buying this to replace previous faulty thermostat ": {
        "title": "Trane TCONT203AS42MA Thermostat, 7 Day or 5-1-1 Programmable Schedule, Heat/Cool, XR203 ballpark estimate of buying this to replace previous faulty thermostat ",
        "score": 6,
        "url": "https://www.partstown.com/trane/trntcont203as42ma",
        "content": "",
        "num_comments": 21,
        "comments": [
            "OP got their answer, rant out? Locking.",
            "It would probably run you $300-$500 installed. Prices GREATLY depend on location. But that is Tranes cheapest stat. Its just a basic programmable stat. You can get any really. You sure its actually faulty or not? They havent been around terribly long and 9/10 times a customer tells me they have a thermostat issue, its not the thermostat.",
            "The poster of this should take it down and re-evaluate his views on professional services. I am sorry, but this is precisely the type of customer we all need RUN AWAY from. They are belligerent and feel that our training, cost of tools, cost of doing business and experience somehow relate to what he can go online and buy a part for. You would be even more upset if i let you know that thermostat you found online is about 2X more expensive than what we can buy it for as contractors from wholesalers.",
            "Thats an expensive stat. Probably gonna be close to $1,000",
            "If not provided already you will need to post a picture of your thermostats wiring connections and those inside your furnace to get better help. Use imgur or your own Reddit profile to host your pics as Reddit will often remove others. Thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hvacadvice) if you have any questions or concerns.*",
            "Including the price to have a professional installl it",
            "u/notify_me_bot create heat pump, \"heat pumps\"",
            "Thank you.  I was cross checking the actual bill i received.  Im just pissed at myself because I could have done it myself for 160 apparently.  The issue was that there was a short in the wire harrness between the air handler and heat pump.  Tech just used another unused wire in same harness.  I believe the thermostat was bad, the previous owners let batteries corrode in it and it the display was still intermittent when i put fresh in.  But no, Im not certain and just went with what service guy said",
            "If you people think that me asking why a thermostat cost so much is some sort of abuse, maybe you people shouldnt choose a career that involves interacting with the general public and seek a safe place instead.",
            "Well how come this website is selling them for 150$?  To program it and click it onto wall is $850 in labor?"
        ]
    },
    "Brand new HVAC system not cooling, installer saying that's normal?": {
        "title": "Brand new HVAC system not cooling, installer saying that's normal?",
        "score": 11,
        "url": "https://www.reddit.com/r/hvacadvice/comments/1dr7rhi/brand_new_hvac_system_not_cooling_installer/",
        "content": "Posted here a little while back asking advice about repairing an old unit vs installing a new one -- I decided to install a new one.\n\nThe techs finished replacing my old system (3 ton Trane outside unit, 4 ton air handler, which the company said was inefficient) with a 3 ton Carrier 38mura (?) system.\n\nThey finished at around 4pm, and the temperature in the house was 75 when we turned on the new AC. Told them it didn't feel like much air was coming through, and they said I was just used to the oversized air handler. By 7pm, the temperature had gone down only a single degree. \n\nCalled the salesman about this and he said \"we can get someone out there, but it's going to take a while to cool since you've been without AC for a while and the humidity in your house is so high.\" (Humidity indoors was 64%.)\n\nI decide to wait overnight. After running all evening and all night with the thermostat set to 66, I'm looking at it now and the temperature has only gone from 75 at 4pm to 72 over twelve hours later at 5am and the humidity has actually gone up, to 65%. It is now literally the same temperature inside as it is outside.\n\n(And all of this with a temporary portable AC unit running the second half of the night in my bedroom when I gave in and realized the HVAC system wasn't cooling much if at all.)\n\nIt isn't a house issue, as my last 18-year-old HVAC system worked beautifully and cooled the house quickly with zero problem, before it got a refrigerant leak this summer.\n\nI feel sure when I call them they're going to say again that everything's fine and just wait, it'll work! But this just doesn't seem at all right. I'd like some outside opinions from people with experience, so I have some frame of reference while trying to stand up to them. And if I'm wrong, if it really does just somehow take a few days for a new HVAC system to actually begin working, please let me know that, too!\n\nY'all were really helpful before -- thanks in advance!\n\nUpdate: Due to disability I'm not able to get into my crawlspace, so I can't directly check anything there. I did manage to get under my deck to open the crawlspace and poke my head in, and the air down there is as cool if not cooler than in my house. I believe they must've done something to the ducts, or incorrectly installed the air handler, as several commenters here have suggested.",
        "num_comments": 64,
        "comments": [
            "It 100% isnt working right. Have them come out.  Hopefully its something minor.  Especially once the sun goes down the system shouldnt have any trouble dropping a degree an hour to get to set point.",
            "Disregard all these comments telling you do check this and that.  Its a new system, get their asses back out there to fix their f up.",
            "Go outside and hold you hand over the condenser unit. The air blowing out should be warm. Feel the suction line, the big one, at the base of the unit. It should be cold on a hot day. Next, hold a thermometer at the air filter, and the vent in your bedroom. There should be a 15-20\\*F difference.",
            "This is 100% not normal. Not sure why everybody is saying wait until Monday. You paid a lot of money to have air conditioning. Call and demand someone other than the installer come fix it.",
            "If its not cooling, ie dropping the temperature and reducing humidity, its not working. Simple as that. You can wait and see what happens, but its not likely to be something time will fix. \nThe installer needs to put gauges on it, measure pre and post air handler temperatures, and figure out what is going on.",
            "It can be a duct issue if the techs didn't connect the new handler properly.",
            "Check your thermostat settings. Heat/Cool differential. Could be set to high/lo. If your Heat temp is 70 and cool temp is 75, your unit won't go below 75 degrees. Also you should not lower your temp more than 7 degrees from air temp. Some units will freeze up or shut down. If it's 88 degrees in your house and you turn the temperature down to, say 72 degrees....you will freeze your lines and your unit could shut down. Or go on auto defrost which reverses unit to turn the heat on to minimize freezing lines. You may be stuck in this temp zone. You need to consider outside air temp and inside air temp. Your unit will only drop a 20 degree difference from outside air. If it's 95 degrees outside, 85 degrees in your house, and you turn your thermostat down to 70 degrees?? You will overwork the system, freeze the line, then thaw the line which produces Heat and repeat that process again and again. Good luck",
            "I would pay a competitor of your installer to check your AC.",
            "Is the inside part of the unit that contains the evaporator coils getting cold to the touch (on the outside) when the system is running?\n\nWhat is the air temperature of the air coming out of the vents when the AC is running - put an actual digital thermometer on it and see.",
            "Take a meat or another thermometer and stick it in one of your supply registers. The temp of that air should be 20 degrees or more cooler than your inside temp. That should give you an idea if it's doing anything. But I think it would be more effective by now cooling your home if it was working correctly. \n\nIs the fan on your outside condenser spinning?"
        ]
    },
    "Is there a thermostat that automatically flips to \"off\" if the power goes out?": {
        "title": "Is there a thermostat that automatically flips to \"off\" if the power goes out?",
        "score": 4,
        "url": "https://www.reddit.com/r/hvacadvice/comments/1drc3tt/is_there_a_thermostat_that_automatically_flips_to/",
        "content": "So here's the problem. We live in an area where the electricity likes to go out for short periods of time, a few seconds at most, at least once a week. When the power goes out, the protocol in our house is to run to the thermostat and flick it to the \"off\" setting so that when the power is restored, it doesn't cause the house to basically double surge from the power coming back on and the air conditioning kicking back on at the same time because it could cause damage to the air compressor. \n\nThe problem is with these short few seconds power outages we don't have enough time to get to the thermostat before the power comes back on. \n\nSo what I'm wondering is, is there a thermostat you can get (preferably not one of these stupid smart home devices) that automatically flips to \"off\" when the power goes out so that way the AC doesn't come back on when the power is restored a few seconds later?",
        "num_comments": 15,
        "comments": [
            "Lots of thermostats nowadays have a \"compressor saver\" delay built in for this exact reason. If it senses power loss from the controls, when the power comes back on it will engage this timer, default of usually 5 minutes, to prevent the condenser from flashing on an off. \n\n   Examples off the top of my head are the honeywell t series stats (t4,t6,ect).",
            "So to get AC back, some has to walk to the thermostat and turn it on again?",
            "If not provided already you will need to post a picture of your thermostats wiring connections and those inside your furnace to get better help. Use imgur or your own Reddit profile to host your pics as Reddit will often remove others. Thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hvacadvice) if you have any questions or concerns.*",
            "The Honeywell / Resideo 8000 series thermostats has a compressor protection setting of 0-2-3-4-5 minutes off between cycles to prevent short cycling. This same time out will happen with the loss of power. Research this model and see if it will fit your needs.",
            "I thought that was standard now, all my window units I have a delay on the compressor restart.",
            "Condensers also have startup delays. This allows the grid to start back up.",
            "Yeah I'm only kinda just now understanding that it also might be because we have an older thermostat.",
            "Well yeah that... That would be ideal. We want a thermostat that slips to the off setting when the power goes out to prevent a surge when the power is restored a few seconds later.",
            "most old style units dont. only more modern version and inverter units have that. with inverter units the time is actually random (between 30 seconds and 3 minutes) to protect the grid,",
            "If you get an ecobee, it takes about 10 seconds for it to boot up after power loss. Is that enough of a delay to prevent surge?"
        ]
    },
    "AC HVAC unit replacement is the quote reasonable?": {
        "title": "AC HVAC unit replacement is the quote reasonable?",
        "score": 2,
        "url": "https://www.reddit.com/r/hvacadvice/comments/1drd9m8/ac_hvac_unit_replacement_is_the_quote_reasonable/",
        "content": "Hi, I live in Houston and I need to replace my existing AC unit. I received a quote and I would be grateful if anyone can confirm if it is  reasonable\n\n\n3 ton 15 SEER American Standard full HVAC system: condenser, coil and furnace\nWe will remove the existing mechanical equipment and install a 3-ton 15 SEER factory matched American Standard full HVAC system. The copper lines will be flushed with R-11 to clean the lines. We will seal the duct to energy star standards at the new plenum location. We will connect to the existing duct work, thermostat, and drain lines. New overflow protection will be present in the new drain pan. All work will meet the local building code requirements. All debris associated with this project will be hauled off\n\n\nQuote: $9725 if I want to install a soft start it is an additional $625\n",
        "num_comments": 4,
        "comments": [
            "Based on West Central Florida prices, that's in the ballpark.",
            "Seems pretty good, but do go out for more quotes to see the pricing in your area. You also should ask about labor warranties.",
            "Thanks for your advice ",
            "Thank you "
        ]
    }
}