{
    "Weekly Questions Thread - (June 24)": {
        "title": "Weekly Questions Thread - (June 24)",
        "score": 3,
        "url": "https://www.reddit.com/r/HypixelSkyblock/comments/1dnbr8r/weekly_questions_thread_june_24/",
        "content": " Welcome to the [r/HypixelSkyblock](https://www.reddit.com/r/HypixelSkyblock/) Weekly Thread!\n\nThe Weekly Thread serves two purposes:\n\n* to ask progression questions that comply with the subreddit rules,\n* to find dungeon teammates.\n\nTo prevent confusion in the comments, it is best if your comments follow specific formats depending on what you are using this thread for. Please read everything carefully to see which format applies for your situation.\n\n***Progression Questions — Info***\n\nTo prevent large amounts of spam or small posts, you can ask smaller questions that don't need full posts here. Questions that should be asked here instead of making its own thread include but are not limited to:\n\n* what stage of the game you are in,\n* what you should progress for,\n* questions about items and minions,\n* questions about game mechanics,\n\n*However, some questions that comply with DTD have been asked very often, and as such should be asked here instead. As of this week, those questions are:*\n\n* Baby Yeti Pet/Shadow Assassin Chestplate\n* Livid Dagger/Shadow Fury/Flower of Truth\n* Baby Yeti Pet/Blue Whale Pet\n\n***Progression Questions — Formatting***\n\n*Please start each progression question/comment with a line with the prefix \"\\[PROGRESSION\\]\" (not case-sensitive), followed by your* *sky.shiiyu.moe* *(aka SkyCrypt) link followed by whatever questions you may have (example below!):*\n\n>\\[PROGRESSION\\]: [https://sky.shiiyu.moe/stats/GoodboyFM/Pineapple](https://sky.shiiyu.moe/stats/GoodboyFM/Pineapple) how do i craft more minions\n\n***Dungeon LFGs (looking for group) — Info/Formatting***\n\nAs per popular demand, dungeon LFGs are now taking place in this post. However, as this thread also has other types of questions, you should follow this format in order to make your LFG request distinguishable:\n\n>\\[DUNGEON LFG\\]: [https://sky.shiiyu.moe/stats/GoodboyFM/Pineapple](https://sky.shiiyu.moe/stats/GoodboyFM/Pineapple)\\- Dungeons Class + Class level (ie: Tank 24)- Dungeons Type + Level (ie: Catacombs 24)- Armor + Pet (ie: Full 5 star fragged HPB'd Shadow Assassin armor, level 100 Enderman)- Weapon(s) (ie: recombobulated 5 star withered FOT)**1**\\- Support items (if applicable, ie: Mana Flux Power Orb, Weird Tuba)\n\n\\*\\*1\\*\\*If you have multiple of the same weapon (ie multiple Bonemerangs), just list the quantity of the weapon that you have (\"4 bonemerangs\", \"5 bonemerangs\", etc).\n\n***General Housekeeping in This Thread***\n\nIf you want to post a dungeons LFG and a progression question at the same time, please do so in separate comments.\n\nRemember to also check out the sidebar and subreddit wiki (the \"Menu\" and \"About\" tabs on Reddit mobile respectively) which have some other helpful links that might answer your questions.\n\nHappy Minecrafting!",
        "num_comments": 117,
        "comments": [
            "i havent played hypixel skyblock in a few months- is it worth getting back into skyblock?",
            "I recently got the melon dicer. now, what should i do with the turbo crop melon lvl 1 books. should i directly apply them to the hoe. like as soon as i get a book, i enchant the hoe/combine books to make it appropriate level OR should i stock the books and make an turbo 5 enchantment book first and then apply it to hoe. plz tell",
            "Is there a way to get runecrafting in stranded",
            "I recently started playing again after many years and so much has changed. Last thing I remember was the dragon armour was end game. Looks like that is now beginning/mid game now.\n\nWhat should I start working towards? (collections, armour, weapons, pets)",
            "Should I get sheep minions if I already have maxed (t11) snow minions (given to me by a friend)? I want to make as much money as possible but currently have 26m in the bank.",
            "So im going to college at the end of the summer and wont have time to play, im sitting at 2.8b networth, im thinking of liquidating and investing or buying hyper max minions, whats the peak of minions or what do i do. IGN = ferrsir if you wanna look and see what i could do",
            "i get game sickness while mining and cannot continue for long. what should I do?",
            "i just copped a giant sword from f6, should i sell or use it as primary. ACCOUNT: DMRMINTY",
            "Is the bestiary's automation drops correct? I have killed about 200 automations, and theoretically with a 1% drop chance for each part, plus magic find, I should have had about 8-9% for each to get a drop, and that's not counting the 30 of them that were lv 150, with 2% each. I haven't gotten any actual drops from them, outside of two times: Both were assists. Can someone please explain why this is?",
            "Hi ya'll, i started playing skyblock again after a bit of a break. (half a year ish on and off) I have quite a bit of money available and im not sure what to work towards. I bought an AOTS for a bit, decided i was done with revs, sold the aots and my shadow fury and im currently raising funds for a giants sword. (I have the money its just stuck in an auction that i forgot to check the length of before bidding. Im dumb i know) I've invested quite a lot of time and money into farming as well and i started making a custom pumpkin plot but i don't know if its even worth doing as just the premade plots already are infinite and long enough for a contest. What should i do? Is it even worth buying a giants sword? Thanks!\n\nign is \\_kiwan"
        ]
    },
    "Why do nons act like they’re better than you for rushing progression?": {
        "title": "Why do nons act like they’re better than you for rushing progression?",
        "score": 100,
        "url": "https://www.reddit.com/r/HypixelSkyblock/comments/1dr5pc0/why_do_nons_act_like_theyre_better_than_you_for/",
        "content": "I will see lvl 140 players with a 3b nw, combat 25 and 500mp, and a hype telling me that they’re better than me at a lower lvl. Why the fuck do people think they just win the game by getting a hype and investing nothing into other aspects of the game. \n\n“You only have a GS HAHAHHAHAHA” yeah and I’m also combat 50 with 800 mp, I don’t even main combat, and I actually level up other parts of the game. \n\nPeople act like you should be maxed out on everything just because you’re a higher lvl than them when they’re just fucking lazy. Grinding skyblock xp is the cheapest thing you can possibly do and being “better” at a lower lvl doesn’t mean jack shit. It means that you don’t know how to grind the one most basic and easy thing you could possibly grind and that you waste money by making dumb financial decisions like buying a hype when you have 500mp and a 3b nw. Wow it’s so impressive that half your nw is in your weapon and your combat lvl is complete shit!\n\nI used to wonder why higher lvl players never speak or respond to nons and I’m slowly realizing why. It is just completely insufferable to talk to some people because they constantly compare themself to you and demean you when you’re not completely rushed on progression.",
        "num_comments": 97,
        "comments": [
            "you're not wrong but which level 100 hurt you",
            "I kinda am the opposite of a non, doing everything that doesn't progress me at all XD",
            "Me when a guy with shadow assasin armor and a turtle pet want to be tank in f6 (i have a max goldor set)",
            "Bro Im confused how these guys have so much net worth I got lvl 140 and had like 300m net worth. What am I missing",
            "as a sa 55 with 3b networth, i believe it's just different playstyles. Lowkey annoying how they act better than you though",
            "Just do it like me and 7 star a Juju and apply fatal tempo 1 \n\nThe reactions from all the ,\"high emdgame players\" that think Skyblock is more worth than reallife is priceless",
            "Bc they need to feel good bout themself and tbh sometimes some nons are truly better than ppl with higher lvl and better gear but thats rare anyway",
            "The nons don't really care about skill levels or anything which isn't a direct flex all of the youtubers have made 6 billion videos about hype necron's term etc these nons mostly watch these kinds of videos and think oh having a hype means I'm good at the game having this armor means I'm good at the game. I know this because I was in the early days like them.",
            "Dont compare yourself to others. Compare yourself to an earlier version of yourself",
            "A 13 year old wrote this"
        ]
    },
    "Final destination/Eman set :)": {
        "title": "Final destination/Eman set :)",
        "score": 170,
        "url": "https://i.redd.it/r0qj19a2ve9d1.png",
        "content": "Another comm for u/maplemaelstrom :)) this one came put even better than the last I think :) she's were full destination, ender equipment with an edrag and atomsplit <3 (if anyone wants to join the art server and see stuff like this in progress, dm or comment below!!!)",
        "num_comments": 22,
        "comments": [
            "Omg she looks so slay :P\n\nAnyways, total vouch! If anyone considers commissioning, the process is very easy, so 100% recommend!",
            "oh what i would do for a t5 eman",
            "That art looks so good, I have two things, so say/ask.\n1. How much do you charge for those?\n2. I'm going for #1 in Ender Pearls and would like something (like an art piece) to show off as an accomplishment when talking about it and not just a screenshot of some numbers.",
            "Surprised to see no insane comments yet",
            "Cool and all but can we talk about how adorable the ender dragon pet is.",
            "Interesting, I always pictured FD to be more revealing type armour.  I even made the custom texture for it to be so.  I like the idea of the strap boots, though.",
            "This is epic :D please continue cooking",
            "How I be feeling after putting on one pc of fd over necron (I am a straight male)",
            "fd would genuinely be an interesting armor set irl",
            "How long did that take?"
        ]
    },
    "Why isn't this unlocked? I have class average 31": {
        "title": "Why isn't this unlocked? I have class average 31",
        "score": 29,
        "url": "https://i.redd.it/e3feb640sh9d1.png",
        "content": "",
        "num_comments": 10,
        "comments": [
            "are you absolutely sure your class average is level 30? could you send some screenshot proof?",
            "Nah cause its not 30 its 31 \n(I dont play hypixel)",
            "i have class average at 32 and don't have this either. it's more like a \"minimum class level\" achievement.",
            "Definitely a probability considering the incompetence of hypixel's qa",
            "I think class average just means have a 30 minimum in all, its a stupid system",
            "That is so dumb and misleading lol. It's not like I'm going to choose this emblem anyway but I just noticed that its locked",
            "Its not really that dumb if you think of where it got its inspiration aka ca50",
            "Can't you technically be arch lvl 51 but tank 49 for it? Also they should have been more specific as ca50 and ca30/40 doesn't have the exact same conditions",
            "Nope have to be atleast 50 for all of them. The reason its like that is more the player bases fault in the sense that overflow xp was never accepted as ca50 so it just stuck for the admins too",
            "[https://imgur.com/a/65715Z2](https://imgur.com/a/65715Z2)"
        ]
    },
    "Lets goooo 🗣️": {
        "title": "Lets goooo 🗣️",
        "score": 31,
        "url": "https://i.redd.it/5ahmmq5mlh9d1.png",
        "content": "",
        "num_comments": 6,
        "comments": [
            "GG what are you going to spend the money on or if youre Ironman what do you play on putting this on",
            "The experimentation table is my new favourite form of gambling",
            "GG",
            "Ayy gg",
            "[removed]",
            "Your comment was automatically removed as your account seems to be quite new. Please contact the mod team [HERE](https://www.reddit.com/message/compose?to=/r/HypixelSkyblock)\n\nIn the meantime, please view this post for any questions you may have: https://www.reddit.com/r/HypixelSkyblock/comments/o1l2ar/re_increasing_account_age_quota_requirements_to/\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HypixelSkyblock) if you have any questions or concerns.*"
        ]
    }
}