{
    "[META QUESTION] Money questions. How do we feel?": {
        "title": "[META QUESTION] Money questions. How do we feel?",
        "score": 3,
        "url": "https://www.reddit.com/r/hypotheticalsituation/comments/1dq6loh/meta_question_money_questions_how_do_we_feel/",
        "content": "Hi everyone. We've added a few new moderators and have introduced new rules. I apologize for how slow this has been, but I have been fairly busy. That's not much or an excuse, but life comes ahead of a subreddit.\n\n&#x200B;\n\nWe at r/hypotheticalsituation have noticed a large amount of posts have a focus on monetary incentives. While this is not inherently a bad thing, the sheer \\*amount\\* of posts of this nature brings a certain level of attention that cannot be ignored. We have also heard from several users about their feelings regarding money posts, so we want to get your opinions in the form of this poll as well as your comments. The poll will last for 3 days.\n\n&#x200B;\n\nWe want to be clear: We are not simply going to blindly follow the majority. We want the community to speak. We are thankful to all of you that are active members and those that simply read posts. Please, in the comments feel free to give your thoughts.\n\n[View Poll](https://www.reddit.com/poll/1dq6loh)",
        "num_comments": 14,
        "comments": [
            "Money posts are fine. I think it's just a way of saying \"would thing X bother/benefit you THIS much\"",
            "I'll give you $1 bazillion to leave the thread exactly as is, except please filter out the jokers who are clearly trolling and wasting space.  Example: $10 billion, but you have to have a full body massage 3 days in a row ",
            "I mean, it's a lot better when someone does an equivalent exchange kind of post. But money as the incentive is nice, easy to understand, easy to exchange to your local currency if you're not in the U.S. It's a good metric. \n\nThe part that makes it silly is when the benefit so obviously outweighs their proposal. Would you be mildly uncomfortable for a few hours per month for fabulous wealth and prizes? Well yes. Yes I would. As would 99% of respondents and the discussion bears that out. \n\nLast week there was one, I got my highest upvote rating ever for calling it out. Over a thousand upvotes for telling the poster that his hypothetical was *a* >!*handjob* !<*rather than a monkey's paw*. That speaks more to the state of things than just \"money issues bad\" if you ask me. Which you did, hence this post.",
            "Some of the money posts are interesting from a morality point of view, but the majority of them have a certain samey-sameness to them. \n\nFor the record, the ones that offer X amount per day if you do ~some specific task~ that you can't miss (the ones where you have to decide in advance how many days) are interesting thought experiments. Sure, money is involved, but it takes some thought and self-awareness instead of just Y/N answers.",
            "I agree with the others that filtering out some of the simpler and repetitive ones would be fine, but please don't become hyper exclusive, because some other subreddits are like that and it really sucks the fun out of it. All I mean is with some of them they're like way overboard on rules, and if people fear that their posts are going to not even make it it'll mean less interaction.\nThanks for all you do! btw",
            "I personally hate more the ones mocking them with dumb premises than the actual ones, every day yo might have 3 about the money and 6 compaining about them or making ridiculous ones to show how dumb they are, those are the ones that shouldn´t be allowed honestly",
            "I voted for option four. Money questions are fine, but it would be nice to have more creative posts. Maybe they don’t have to be one day a week, though.",
            "While they are typically extremely stupid, the concept itself isn’t bad. We just need people to ask better questions related to this.\n\nInstead of “$100 for a finger”, ask “What is the bare minimum you’d sell a finger for?”\n\nDon’t simply say “$100 a day for walking 10 kilometers”, also add “how long could you keep this up?” because there is no reason not to take the offer, even if you fail on the first day.\n\nIt would help nice if people got a suggestion or a post that tells them how to write better questions to reduce the amount of stupid questions",
            "Yeah. I deleted a post just like that earlier today.\n\nThis subreddit has a filter system when posts get reported up to a certain degree. Once that occurs it gets auto removed by our automod. This way the users can also vote on what they're okay with seeing.",
            "> when the benefit so obviously outweighs their proposal.\n\nI almost feel like some would be better off asking \"What's the minimum you'd accept to deal with this situation?\"  That might get some debate, even about the minor inconveniences.\n\n\"Would you take a million dollars a day to have your shoes randomly come untied 3 times a day?\"\n\nOf course you would, that's a dumb question.\n\nBut \"what's the LEAST you'd take a day to have your shoes randomly come untied 3 times a day?\" is kind of interesting.  \n\nThat brings up a little debate about just how inconvenient it would be.  It's CLEARLY worth 1 million a day.  But is it worth $1000 a day? $10 a day?  Where is your limit?  We'd have to think more just about how inconvenient that could be to find the exact dollar amount."
        ]
    },
    "You are granted $10 Billion, but you can only eat Taco Bell for every meal for the rest of your life. Do you take the deal? ": {
        "title": "You are granted $10 Billion, but you can only eat Taco Bell for every meal for the rest of your life. Do you take the deal? ",
        "score": 732,
        "url": "https://www.reddit.com/r/hypotheticalsituation/comments/1dqsbln/you_are_granted_10_billion_but_you_can_only_eat/",
        "content": "$10 billion instantly, but you can ONLY eat Taco Bell for every meal, and you MUST eat 3 meals a day. Do you take the deal? Would this be worth it? How would it effect you?",
        "num_comments": 990,
        "comments": [
            "Question...can I use my $10 Billion to buy a franchise and have them change the menu to my liking? If not I'd have to pass. I mean it's a lot of money but for me there's not much on the menu these days I want to eat",
            "Yes, do you need my account and routing numbers?",
            "So I live in the world of demolition man now neat.",
            "I'd eat ass for the rest of my life for $10 and a smile",
            "Do not threaten me with a good time!!\n\nI would take this deal in a heartbeat. As a mostly-vegetarian, Taco Bell is my favorite, and I think I could have a pretty healthy, balanced diet full of fiber with some planning. Not to mention, the person who mentioned the menu worldwide is different - so I could always use the money to travel, and get some variety!",
            "Honestly the 3 meals is the issue. I'm not great at eating 3 times a day",
            "Don't they sell salads and other things?",
            "Yeah, just buy shares or the company and have them change the menu from time to time",
            "No, in my mind, a BIG part of the fun of being mega rich would be the different foods I could eat.",
            "I’m on day 14 and I make $40 an hour. Slide me my coin underneath the bathroom door."
        ]
    },
    "Never have sex with anybody again, for 20 million?": {
        "title": "Never have sex with anybody again, for 20 million?",
        "score": 260,
        "url": "https://www.reddit.com/r/hypotheticalsituation/comments/1dqr792/never_have_sex_with_anybody_again_for_20_million/",
        "content": "No sex, no oral, you can only do it yourself \n",
        "num_comments": 601,
        "comments": [
            "Not that different except now I have 20 million.",
            "As a Widower this is basically where Ive been at for half a decade already so sure,deal",
            "WHERE'S MY MONEY??!!",
            "Hell nah I’m clapping cheeks, broke but happy lmao",
            "I've been doing that for free for awhile now lol",
            "So like.. get married, but instead of a wife you get $20 million?\nI'm in",
            "Sex is nice but a bit overrated. With 20 million I could find many more ways to occupy and entertain myself ",
            "This isn't a hard or difficult hypo for a lot of people.",
            "What a sad existence",
            "Fuck no. \n\nMy wife and I have been having mind-blowing sex for 15 years.  \n\nI would rather keep that."
        ]
    },
    "Win 20 billion if you survive ": {
        "title": "Win 20 billion if you survive ",
        "score": 429,
        "url": "https://www.reddit.com/r/hypotheticalsituation/comments/1dqj43g/win_20_billion_if_you_survive/",
        "content": "There are three choices of biomes in where you have to survive for 1 week( if you do you get 20 billion)\n\n1) on K2 mountain range (on top)\nYou are given :- a torch, a book with 400 pages\n, a matchstick box and a metal katana\n 2) Amazon rainforest ( right from where there is no human inhabitation) \nYou are given:- a partner ( 50 - 50 share), a matchstick box, a mosquito repellent  and a Machete\n3) hot desert( in the middle of nowhere)\nYou are given:- a 2 litre bottle of water, a walking stick and a never melting ice pack\n\nWhere would you survive and how would you survive ",
        "num_comments": 613,
        "comments": [
            "1 is 100% a death sentence. The top of K two is over 28,000 feet, which is well above what is called the death zone. No one could survive up there for a week without supplemental oxygen, but you’d freeze to death first. The tree line is over 10,000 feet below the peak so there’s nothing to burn and I don’t know what you plan on doing with a sword. \n\n2 is survivable, barely. Having two people means you can sleep in shifts. You’re unlikely to get a fire going because all the wood would be wet but using a machete you could hack apart dead trees, and hopefully get some dry wood. You don’t have a pot to boil water the water filter so you’re going to get all kinds of parasites but that can be treated. The big risk is dying to a big cat so getting a fire going and making some spears would be life or death.\n\n3 is also a death sentence. The water would run out in hours, and no one is surviving in the desert for a week without water.",
            "2 is the only one where you even have a small chance of surviving.",
            "Why do we get a shotgun for the desert? Are we robbing other people for their water? 🤣",
            "\"There are four choices of biomes in where you have to survive for 1 week( if you do you get 20 billion)\"\n\nso....what's the fourth choices?",
            "Y'all are going absolutely mad with the machete. It's ONE WEEK. You can make it a month without food if you have a water source. You do not need to butcher and eat your partner in a one week survival challenge.",
            "The second option is significantly easier than the other two. Made obvious by the fact that people actually live in the Amazon Rainforest. But not at mountain peaks or in the middle of sandy deserts.",
            "2 and if I get to pick the partner an old friend who is a biologist who specializes in the region (plus we get on well so good company and I get the bonus of also making a friend rich). She can easily pick out what local plants are good to eat and which will kill so fruits should hopefully give us the liquid we need if we can't collect rainwater (reduces parasite risk) and as long as we can get liquids can likely tough it out for a week humans are big enough to scare of most things above ground level so cimb a tree as a base go down to forage for food and sleep in shifts where possible.",
            "1 and 3 are a very likely death sentences. The environment (temperature in the case of 1, no access to water in the case of 3) will kill you.\n\n2 is survivable. Humans can go one week without eating easily. You just need to find a water source (or make one by catching rain water) which may be possible.",
            "There's a few ways I know of to produce drinkable water in the desert, there's not many creatures of significant danger, and the average human can go a week without eating(ketosis ftw). Even places like Death Valley have shade. It's just a week.\n\nCompared to the first two choices, realistically I have an exponentially better chance of surviving in the desert. K2 is guaranteed hypothermia, and the Amazon is going to eat you in every possible way you could imagine",
            "I feel like option 2 is the most survivable."
        ]
    },
    "How many Popeyes biscuits can you eat?": {
        "title": "How many Popeyes biscuits can you eat?",
        "score": 51,
        "url": "https://www.reddit.com/r/hypotheticalsituation/comments/1dqwcaf/how_many_popeyes_biscuits_can_you_eat/",
        "content": "In front of you is 500 Popeyes biscuits. You have 1 hour to eat as many as you can. You can't drink anything or put anything on the biscuits. For each biscuit you eat, you get $1000 dollars. How much money will you have after 1 hour? ",
        "num_comments": 119,
        "comments": [
            "Between 5 and 10. \n\nWith no drink your mouth and throat gonna get so dry. 😩",
            "You know what? Just for Shits….literally, & giggles and research, I am going to try this weekend. I will film it and take pictures and get back to you.",
            "How hot are the biscuits? If they are fresh and stay warm/hot I’d say 15-20 if they are cold probably 5-10",
            "I'll try for 10, but those are so dry, and I do not like biscuits at all. Just rip them into teeny pieces and try to get them down an hour is a fair amount of time given you have the right technique without liquids.",
            "I'd go got 7. The first 2 in 10 minutes, then one every 10 minutes after that seems doable.",
            "Like 6? Dry ass biscuits gonna be hard.",
            "All of them.",
            "Am I allowed to throw up? What kind of prep do I get?",
            "As many as I can handle I guess, either way I’m walking away with at least 1000 dollars",
            "No clue, but I'd have fun finding out.\n\nNow if we were talkin Red Lobster biscuits.... DAYUM"
        ]
    }
}