{
    "Avoiding personal info and getting your posts approved": {
        "title": "Avoiding personal info and getting your posts approved",
        "score": 94,
        "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/18sci04/avoiding_personal_info_and_getting_your_posts/",
        "content": "Hey folks!    \n\n\nWe just wanted to mention quickly that we want to avoid posting identifying information and social media handles that lead to the \"pos\"s account directly.    \n\n\nPeople will take real stories and attach it to someone innocent, or fabricate stories in order to turn this sub into a on-demand brigade. As well as that, it's against reddit's terms of service- likely for this exact reason.    \n\n\nThanks for understanding. At the end of the day, if it's a real story people will find it on Google, and in our eyes that's great, y'all are fact checking yourselves and that's how things should be when it comes to internet strangers telling you to be angry at someone, tbh.",
        "num_comments": 13,
        "comments": [
            "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "I don’t understand why yinz don’t allowed news articles to be shared. Like why is it on us to verify if a post is true? Actually it should be mandatory to post a news link if they’re screenshotting an article.",
            "Zionist extremists are already doing this shi.Theres a discord server keeping an eye some on sub reddits, where they downvote anything non-zionist. Even going through profiles to find personal info",
            "Worst rule",
            "Reddit is a wild place sometimes…",
            "hey there, im not 100% sure what that Y word means, but we generally will let news videos get uploaded to the sub directly. as far as posts go, we like people to be able to stay on the sub if that's where they started- so direct video/gif/screenshot upload to reddit.\n\nas for the news article links in comments, our automod is very aggressive in order to fight off spam bots and malicious links, and it's about 14 pages worth of regex code (it's been like that since before i got here and has gotten larger over the years from other mods), so it can be at times difficult to make changes to it to allow certain things :/\n\nif you as the OP post the news article as a comment while the post is waiting approval, we do check the comments and can see the removed website- so the news article. that speeds up the approval process drastically as we do like to try and verify posts as well. If I notice them I try to approve the news links if it doesn't look like a sketchy add-farm site, too.\n\nwhat happens tho is people copy paste stuff from the news article and include a ton of personal info as a comment, which is against tos. as well as that we'll remove that stuff as this is when we're allowing random users to explain things to people and they can lie or manipulate the info with the idea that no one will actually check the news article and take what was said at face value.\n\nlot of folks with agendas come here.\n\ntldr sorry, i do want news articles but it's just there's so many scammers on this site and it can be easy to lose track of them in the cracks, and it's very difficult to make changes in automod as ours is extremely large.",
            "Ok\n\nYinz = you, yall \n\nSo you can post a video news link but not a printed one because the bot removes those?",
            "you can upload a news video directly to reddit so that its contained in the site, we approve those ones often. links to a news article we dont- but those rarely do well as a post as  redditors want to just doom scroll and upvote or downvote. most people dont care much to go deeper than that so if your goal is to get your post seen that is in your best interest to do anyways. screenshots also do well.\n\nwhen you type out a website automod will kill it. there are multiple paragraphs across the 14 pages set up to target websites and its a nightmare to try and whitelist certain websites without harming the bots abilities to target scammers and malicious links.",
            "Ok thanks"
        ]
    },
    "IAATPOS is looking for new mods": {
        "title": "IAATPOS is looking for new mods",
        "score": 40,
        "url": "https://www.reddit.com/r/iamatotalpieceofshit/comments/1bu6fso/iaatpos_is_looking_for_new_mods/",
        "content": "Hi folks! Hope all's well.\n\nWe're looking for new mods! We need help with post approvals. In order to prevent the sub from getting banned, and to ensure no one innocent gets doxxed, we approve most posts manually.\n\nMy goal is for people to mod 1-3 times a week and I will do check-ins to make sure no one feels burned out. Please be aware I do spot-check your work as well. I try to ensure that the amount of content on the sub matches what our moderation team can handle, and respect and value all of the mods that choose to help here.\n\nI like down to earth, empathetic, and reasonable people. I dislike mod abuse and agendas, and will work with a mod if that kind of situation comes up to prevent it from happening again. I am very patient and understanding, though.\n\nIf you have an interest in news, journalism, or like posting informative content, you'd enjoy modding here. The mod team is very low-drama and friendly, too. We're fairly active in discord as well if you like shooting the shit, and are all very familiar with modding if it's something you have an interest in.\n\nThis will not be a good sub for you if you need to see progress with fixing problematic behaviors common with large angry groups of anonymous people. The users ban evade and use alts, and the only way to win is to remove the content that brings them here. That of course doesn't mean we just let it run rampant/don't mod, but understand this- there is no finish line.\n\nA better way to look at it is to consider that if you caused everyone to leave forever, they would go to another sub and who knows if that other team would abuse their position to threaten/doxx others, push agendas, or if they would let personal info be posted and unregulated leading to innocent people getting doxxed. The mob's always gonna want blood and a ban won't stop that type of person, but at least here we can ensure no one innocent gets their life ruined.\n\nIAATPOS tries to be as neutral as we can, and focuses on the person being an asshole. I do like diverse teams, and right, centrist, left, whatever-leaning people are welcome. Coming from different countries is of course welcomed, as is knowing multiple languages. I don't want an echo chamber and I want to ensure we have people approving posts with multiple viewpoints to help decide. I do expect everyone to be respectful of each other and keep an open mind, though.\n\nThanks folks, I appreciate it.\n\n&#x200B;\n\n[https://forms.gle/zidafinJNvPN2i1v6](https://forms.gle/zidafinJNvPN2i1v6)",
        "num_comments": 42,
        "comments": [
            "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "Sweet stuff. I've been on this sub for a while but I don't really comment, so I don't think I'm quite up for it lol",
            "I don't want to be a mod, just waste your time reading this. Maybe I am the embodiment of this page",
            "Do you need any experience",
            "make me mod because",
            "My dad kisses me on the lips.",
            "I don't have much interest in modding so I'll probably not bother with applying, but is a Discord account mandatory?",
            "Can I please?",
            "i accidentally put my username as just johndoey in the forms. Its me tho :D",
            "Woah ark jumpscare"
        ]
    },
    "Drug addict live Streamer berates her viewers for not giving her more money for drugs.": {
        "title": "Drug addict live Streamer berates her viewers for not giving her more money for drugs.",
        "score": 8056,
        "url": "https://v.redd.it/a6srqhsjzu7d1",
        "content": "This is the same streamer whose dog defecated worms on a to go Uber eats order and she knowingly delivered it to the customer. The same one who also hit a girl with her car high on meth and weed and then proceeded to yell at her after. She's known for being the most toxic streamer and has been featured on several channels including Penguinz0 and Law&Crime Network. For those wondering the number on the screen is her ex's phone number, she's been doxxing him for months and has his number up there every stream so people can call and harass him.",
        "num_comments": 431,
        "comments": [
            "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "\"get off your ass and support me better\"\nWow... Just wow.",
            "\"I'm not chaos completely\". The driving and being on the phone is concerning. She does have drive. I'll give her that.",
            "Yet here we are... and I'd never heard of them... so who is doing more to increase their exposure...",
            "Stupid bitch needs to put the fucking phone down before she causes an accident",
            "Lmao Lucy from trailer park Boys doppelganger especially her voice",
            "She's vile.  She's ran people over on stream. Crashes the car all the time .maggots in the car .a dog lives in there with her .there's videos of her smoking meth .she's always out of head not looking at the road .oh and I've seen her pee stood up .oh and she delivers shopping and her dog shit a tape worm on someone's and she still delivered it .",
            "She needs to be charged for that hideous phone cover.",
            "This should be enough evidence to take someone off the road permanently. Driving is a privilege after all.",
            "Is that the same streamer that surprised point blank maced her “friend”? Held the can to side of his face, called him and maced him straight in the eyes when he turned to respond. Then bitched as she got arrested."
        ]
    },
    "Berating a truck driver publicly for internet points": {
        "title": "Berating a truck driver publicly for internet points",
        "score": 3900,
        "url": "https://v.redd.it/vwfdch0chs7d1",
        "content": "",
        "num_comments": 227,
        "comments": [
            "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "I don't think this guy understands that some truck drivers are no touch loads. They get loaded at pick up and unloaded at delivery.",
            "The guy berating the driver is an idiot. He’s pissed because he has to unload it and the pallets are pinwheeled in the trailer, and he only has a hand jack. \n\nHe’s trying to shame the driver to unload it. The way the load was brokered probably was a Wepay, to save money, so they have to unload it, and he’s crying.",
            "Omar’s Wheels and Tires. Dallas Tx. SMH that’s fucked up.",
            "I've worked for douchebags like this, they want you to put in 110% effort while they act like they're doing all the work. Then they don't pay on time or fuck with your check at the end of the week.",
            "This guy’s annoying as fuck",
            "Truck driver did his job. It’s not his job to unload it, or have the equipment to unload it. This fricken guys bitching to the trucker for having to do his OWN job.",
            "That is one annoying fucking man",
            "There’s MULTIPLE reviews of this place saying they straight up took a drill bit to the wheels they sold them cause it was the wrong size and attempted to CNC the correct size. \n\nWith a fucking drillbit. Pictures provided in the review too. This guys is a major scumbag.",
            "What an annoying fuck"
        ]
    },
    "No way that wasn't on purpose ": {
        "title": "No way that wasn't on purpose ",
        "score": 2128,
        "url": "https://v.redd.it/ka0cvplp3q7d1",
        "content": "",
        "num_comments": 119,
        "comments": [
            "\nPlease note that we will ban you if a post or comment breaks any of our rules. **Be especially mindful of the following**:\n\n**Rule 1: Do not post or ask for identifying information, including first and last names and social media usernames.** Public figures are **not** exempt. We remove all external links to prevent accidental posting of identifying information.\n\n**Rule 2: Do not post violent comments, and do not glorify violence, per TOS.** We can't take responsibility for how angry a post makes you, you need to do that. Telling us \"it was a joke bro\" is not an excuse.\n\n**Rule 7: Do not link to or post screenshots of reddit posts, reddit comments, reddit personal messages, reddit profiles, etc.** We cannot allow you to use this subreddit to harass other people on reddit. \n\n**Rule 8: No bigotry, no racism or race baiting.** It is hard to believe that we even need a rule like this. \n\n**Our rules are zero tolerance. You will be banned for breaking them.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iamatotalpieceofshit) if you have any questions or concerns.*",
            "Christ… usually am desensitized to bad stuff happening in videos (what Reddit has done to our brains).\n\nBut not gonna lie, this time I let out a quiet scream of No! in my head, then a giant sigh of relief when I saw they were all ok and went between the wheels instead of under them.",
            "I audibly gasped to the point my wife came running downstairs to see if I was OK.\n\nWhat the fuck is wrong with these people?",
            "My neighborhood has a \"duck crossing\" sign. Most people stop for mama duck to get her ducklings across, but every once in a while (read: prob all the time) these ass faces blow past everybody stopped. I've taken to parking my car sideways, blocking their \"fast lane\". One mom has a 'lame' hatchling and ive gotten out more than a few times to holdup traffic. \"Lame\" baby is getting bigger, and is always the last to cross, but they're still alive.",
            "Douche bag was most likely on a cell phone. People today suck ass bags.",
            "Had some one do this while I was kid. a ton kids that I walked to elementary school with had spotted the momma duck and we followed her to watch her lead the ducklings to the local pond. They were literally across the street from it but they had to cross a pretty busy road. Every car had stopped to let them past and this one ass hole purposefully drives past and turns his car to make sure he hits them. Momma duck made it out with a couple but a lot of them were already smashed into the road. It was horrible sight and wish nothing but the worst on that man.",
            "100% on purpose….this is serial killer behavior.\n\nEven if you are having a terrible day, no way in hell do you accelerate to try to kill defenseless and innocent baby ducklings.\n\nLook inside this asshole’s basement because I think you’ll find some shit!",
            "In my part of Kansas there are lots of box turtles on the highways at this time of year. We are forever stopping to carry them across, but you keep seeing smooshed ones on the other side of the white line where people obviously went out of their way to hit them…",
            "One did not come back.",
            "That is so fucking inhumane. I would rather risk damage to my car via swerving than to endanger BABY birds and the mother. What a POS."
        ]
    }
}