{
    "[Crosspost] I turned a passion project about Doctor Who into a publication in Scientific American. AMA!": {
        "title": "[Crosspost] I turned a passion project about Doctor Who into a publication in Scientific American. AMA!",
        "score": 93,
        "url": "https://www.reddit.com/r/IAmA/comments/1dkwk29/crosspost_i_turned_a_passion_project_about_doctor/",
        "content": "[Link to my article](https://www.scientificamerican.com/article/doctor-whos-time-lords-have-two-hearts-heres-how-their-dual-cardiac-system/)\n\n[Link to the AMA](https://www.reddit.com/r/DoctorWhumour/comments/1dknlqe/i_turned_a_passion_project_about_doctor_who_into/)\n\n[Proof - screenshot of me promoting this AMA on my Instagram account](https://imgur.com/a/tZBtc0O)",
        "num_comments": 2,
        "comments": [
            "Hello! Please note that this post is a link to another subreddit, where the AMA is actually taking place. Comments here have been disabled. Please click on the link above to ask your questions in the sponsoring subreddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*",
            "This comment is for moderator recordkeeping. Feel free to downvote.\n\n**u/AmeliaMarvit**\n##[Crosspost] I turned a passion project about Doctor Who into a publication in Scientific American. AMA!\n\n[Link to my article](https://www.scientificamerican.com/article/doctor-whos-time-lords-have-two-hearts-heres-how-their-dual-cardiac-system/)\n\n[Link to the AMA](https://www.reddit.com/r/DoctorWhumour/comments/1dknlqe/i_turned_a_passion_project_about_doctor_who_into/)\n\n[Proof - screenshot of me promoting this AMA on my Instagram account](https://imgur.com/a/tZBtc0O)\n\n-----\n\nhttps://www.reddit.com/r/IAmA/comments/1dkwk29/crosspost_i_turned_a_passion_project_about_doctor/\n\n-----\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*"
        ]
    },
    "I'm Dr. Kevin Robertson, Fire Ecology Research Scientist at Tall Timbers Research Station. Ask me anything about wildland fire in the southeastern US: fire ecology, prescribed fire, wildfire, remote sensing, or air quality!": {
        "title": "I'm Dr. Kevin Robertson, Fire Ecology Research Scientist at Tall Timbers Research Station. Ask me anything about wildland fire in the southeastern US: fire ecology, prescribed fire, wildfire, remote sensing, or air quality!",
        "score": 212,
        "url": "https://www.reddit.com/r/IAmA/comments/1dkehyo/im_dr_kevin_robertson_fire_ecology_research/",
        "content": "Hi Reddit! Dr. Kevin Robertson here, the Fire Ecology Research Scientist at Tall Timbers Research Station in Tallahassee, Florida since 2003. I study ecosystem and plant community ecology of the southeastern US, fire frequency and season effects on plant communities and soils, longleaf pine and shortleaf pine forest ecology, remote sensing of fire and natural communities, and prescribed fire effects on air quality ([see my papers here](https://scholar.google.com/citations?user=5Jb84L4AAAAJ&hl=en)). I have research associations with and advise graduate students from the University of Florida, Florida State University, Florida A&M University, Auburn University, and Louisiana State University.\n\nI'll be here 12:00-1:30pm EST answering your questions live. Ask me anything!\n\n[Proof](https://imgur.com/610QIKI)\n\nThis is an event hosted by the Southern Fire Exchange. [Check out our website](https://southernfireexchange.org/#/) for information about fire science in the Southeast United States! You can also visit [Joint Fire Science Program](https://www.firescience.gov/ords/prd/jf_jfsp/jf_jfsp/r/jfspublic/jfsp-exchanges) website to find the Fire Science Network for other regions of the country.\n\n",
        "num_comments": 36,
        "comments": [
            "Hello, and thank you for doing this AMA.\n\nI have two questions:\n\n1) In the southeastern region of the US that you study, are there any estimates or predictions that have a consensus in the scientific community about how much more frequent wildfires will become in the coming decades?\n\n2) Given that you have associations with and advise graduate students at Florida-based institutions, will [the recent change in Florida state law that effectively scrubs mentions of \"climate change\"](https://www.npr.org/2024/05/16/1251769080/florida-desantis-climate-change-law) from the state code at all impact your or their work?",
            "Hi Dr. Robertson, thanks for doing this AMA.  I'm curious what you might suggest as long-term solutions / remediations for fire danger.  I live in the PNW and the last decade or so at the end of the summer we have \"smoke season\" from wildfires in the West and Canada.\n\nWe obviously need forests for the long term health of our planet, but is there anything we (or specifically timber companies) can do differently to manage AND protect them?",
            "As a Virginian, I was quite surprised by the outbreak of wildfires here and in eastern West Virginia back in March - especially given that it seemed like we got a decent amount of precipitation plus the ever-present humidity.\n\nWas this a sign of things to come or a fairly unique set of conditions?",
            "What is your opinion of Chad Hanson?",
            "What research or technology from the past two decades has most changed the way we manage wildfire?",
            "Is it true there is a job titled “Burn Boss”?",
            "Why do you think that prescribed fire has continued to be so successful in the American South? Are you optimistic about the future of prescribed fire in the US?",
            "I am a undergrad IT student, Is there any way that modern IT solutions could aid your work/field?",
            "Decades after my st Helen's erupted and burned a ton of forest. Is the charcoal and regrowth a net gain for the area?",
            "Is it windier on average this year compared to other years or decades?"
        ]
    },
    "Crosspost of an AMA with Dan Clark, politics reporter and newsletter author. He covers New York politics and puts all his reporting in the Capitol Confidential newsletter.": {
        "title": "Crosspost of an AMA with Dan Clark, politics reporter and newsletter author. He covers New York politics and puts all his reporting in the Capitol Confidential newsletter.",
        "score": 7,
        "url": "https://www.reddit.com/r/IAmA/comments/1dkdv9k/crosspost_of_an_ama_with_dan_clark_politics/",
        "content": "Direct link to the AMA: https://www.reddit.com/r/politics/comments/1dkdra0/im_dan_clark_politics_reporter_and_newsletter/",
        "num_comments": 1,
        "comments": [
            "Hello! Please note that this post is a link to another subreddit, where the AMA is actually taking place. Comments here have been disabled. Please click on the link above to ask your questions in the sponsoring subreddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*"
        ]
    },
    "[Crosspost r/RetroNickelodeon] AMA with Crystal Lewis, CCM and Jazz Musician and original cast member of Nickelodeon's SNICK show Roundhouse": {
        "title": "[Crosspost r/RetroNickelodeon] AMA with Crystal Lewis, CCM and Jazz Musician and original cast member of Nickelodeon's SNICK show Roundhouse",
        "score": 8,
        "url": "https://www.reddit.com/r/IAmA/comments/1dkc2rs/crosspost_rretronickelodeon_ama_with_crystal/",
        "content": "[https://www.reddit.com/r/RetroNickelodeon/comments/1dkbzbb/50k\\_ama\\_crystal\\_lewis\\_original\\_cast\\_member\\_of/](https://www.reddit.com/r/RetroNickelodeon/comments/1dkbzbb/50k_ama_crystal_lewis_original_cast_member_of/)",
        "num_comments": 1,
        "comments": [
            "Hello! Please note that this post is a link to another subreddit, where the AMA is actually taking place. Comments here have been disabled. Please click on the link above to ask your questions in the sponsoring subreddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IAmA) if you have any questions or concerns.*"
        ]
    },
    "I’m the hacker that brought down North Korea’s Internet For Over A Week. AMA": {
        "title": "I’m the hacker that brought down North Korea’s Internet For Over A Week. AMA",
        "score": 27206,
        "url": "https://www.reddit.com/r/IAmA/comments/1divlp3/im_the_hacker_that_brought_down_north_koreas/",
        "content": "Hey everyone so let’s see if this is interesting for anyone, here’s a link to the [https://www.wired.com/story/p4x-north-korea-internet-hacker-identity-reveal/] that broke the news. Since then it’s been an insane amount of interviews with french, german, south korean, south american, and international news outlets. \n\nRecently I was on NPR’s The World and a bunch of other sh**. Anyway, AMA about the hack, personal stuff, whatever! Happy to answer. I have not yet been murdered or arrested, so that’s pretty good.\n\nProof: https://imgur.com/a/B2hD9OY  + https://www.wired.com/story/p4x-north-korea-internet-hacker-identity-reveal/\n\nMore proof with username: https://imgur.com/a/pih4WWG\n\n##Edit: Holy shit folks, how did this actually get popular? \n\nI expected like 5 upvotes lol. I have to do some actual work but I'll get back to absolutely everyone that asks a question who isn't a dick :). Thanks to everyone for being here, I promise I'll be back and answer everything!\n\nI don't have a PR team unfortunately. But I'll see if my cats are up for answering with mashed keyboard type shit in the meantime.\n\n##\n\nEdit 2: Shameless plug for my twitter https://x.com/_hyp3ri0n but really, I do share everything I do there.\n\nAnyway I'll STILL BE BACK. I can't believe this is at the top. I feel like president Obama. Someone just has to \"an asteroid\" me.\n\n##Edit 3: \n\nI'm intermittently back because holy fuck 6.1k?!? Shit. OK. Time to answer, I made a promise.\n\n##Edit 4: \n\nJust a word of thank you to everyone, no I am NOT leaving, I just wanted to say thanks for coming and asking shit. https://imgur.com/a/6SHKbNT\n\n##Edit 5: I see some bitching about the length of the article. First of all that's Andy Fucking Greenberg, he's a fucking boss so read his shit. Second there's ChatGPT. Third here's my short summary of how i did it: https://x.com/_hyp3ri0n/status/1803195682662051854\n\nEdit 6: i’m going to sleep but keep asking and i’ll get to everyone :).\n\n##\n\nEdit 7 common questions and answers:\n\n- yes i’m single (ok not that many have asked but fuck you it’s my AMA :P\n\n- If you’re intelligence, DoD, or have interesting propositions beyond some vague “you should do x” (those are welcome if they’re unique) you can email me here: pax-ama@opayq.com\n\n- Here’s some semi-technical details of the attack: https://x.com/_hyp3ri0n/status/1803195682662051854\n\n- No civilians were harmed in the attack. Only the elite aka regime have internet access, this was quite targeted. Civilians are unlikely to even know this happened. In fact they probably don’t.\n\n##Edit 648\n\nNext person to tell me i’m an amoral imperialist is going straight to DCSA (DoD investigations)\n\n##How I hack!?\n\nFirst buckle in because it’s a years not weeks or months endeavor to be good. If you’re willing to put in the work anybody can get good. It’s like Ratatouille (or Racacoonie depending on your universe), anyone can hack!\n\nFirst read a fuckton of introductory online resources. Go to securitytube and watch anything by Vivek. Man knows his shit.\n\nFind introductory courses or buy intro books, some recommendations:\n\n- Linux Basics for Hackers\n\n- Metasploit: something somethjng (forget the full title)\n\n- This next one is challenging and dated but an absolute must read: Hacking the Art of exploitation\n\n- I hear Georgia Weismann’s PenTesting book is good and she’s a nice lady. So is her mom. That’s not a mom joke. I actually met her and she’s very sweet.\n\n- Download and learn how to use virtualbox it’s probably the easiest way to start. It’s a virtualization software that you run essentially an operating system within an operating system. It’s open North Korea’s malware on my machine and that’s why it could not spread absolutely anywhere.. it’s useful for learning other operating systems so install Linux on there. I generally recommend Linux mint or Ubuntu. Parallels for MacOS users. If you want to real challenge, install something like freeBSD and learn how to use that.\n\n- The web application hackers handbook is the Bible Web application hacking I always tell people if you read it from cover to cover and do all of the exercises. You’ll absolutely be a really good web app hacker\n\n- Black hat python by Justin is recommended. Justin is a really good dude and does some really amazing projects. I know he knows his shit. In terms of the actual content, the goal is to learn python so don’t worry if you don’t fully understand all of the attacks going on. Although he explains them really well.\n\n- for mobile, hacking I don’t know fuck all about it. So ask somebody smarter than me. Georgia I mentioned earlier I did some work in there so I don’t know fucking ask her.\n\n- If you’re interested in macOS hacking there’s just a little bit of a dated book called the macOS hackers handbook I honestly haven’t read it so I can’t speak to the quality, but is the absolute Jesus of macho ass hacking.\n\n- for more macOS stuff there are some books that are called. I think exploiting the macOS Colonel or maybe it’s just called the macOS Colonel highly suggest those but none of these ones are for the faint of heart.\n\n- Use a lot of resources for courses. Security tube is an amazing resource watch anything by a dude named Vivek know who I’m talking about. He has a bunch of shit on there. If you’re starting out, look for beginners shit, go onto Udemy.\n\n- if you want to pay out the ass, but also get a certification that people actually respect there is OSCP by offensive security, but in my opinion, the shit is a little bit overrated\n\n- For programs, you can literally just download and learn right now and nmap is one of the most important ones for beginners. I think metasploit is really important and there’s a shit ton of material out there on it. Learn how passwords are stored and cracking passwords. Even just knowing what that means is important. So look up hashing and no, it doesn’t have anything to do with smoking hash, though that is an optional step\n\nI did see interest in MacOS so here:\n\n- \n\n\nwill post more soon ",
        "num_comments": 3703,
        "comments": [
            "Once you knew you had access, did you make a point of saying “I’m IN!” out loud, even if no one was in the room with you?",
            "I see that you've mentioned you can take it down at any time.\n\nI know you probably can't answer this in great detail but why hasn't NK put measures in place to prevent you from doing this again? Is it a hardware exploit that can't be patched unless they change their hardware out? Do they not know how you did it? Do they know how you did it and for some reason purposely haven't patched it or they just do not have the knowledge to patch it?\n\nAnytime we identify a vulnerability at work it's priority #1 to resolve the issue, so I'm just curious why NK hasn't done anything about it.",
            "What Consequences do you think you are most likely to suffer, and what are you doing to avoid them?",
            "How do you feel about being called a \"Florida man\" in the Wired article?",
            "Was it hard to take it down?",
            "Could you even hack my profile?",
            "maybe this is off topic but do you have any book recommendations  for someone that is currently studying computer science with specialising in cyber security?",
            "Can you please bring down my internet for a week? I need a break.",
            "I’m curious why you are OK with exposing your personal identity and face after doing this, when just last week on Reddit there was a video circulating of North Koreans leaders stepbrother apparently being assassinated by VX nerve gas/agent in an airport. I really am curious do you not think that there’s any repercussions to your actions? Are you not afraid to look over your shoulder at all times now?",
            "how prepared do you think the US is to defend itself against large scale cyber attacks? or to safeguard the data of its citizens? what should we be doing that we're not currently?"
        ]
    }
}