{
    "So dooo": {
        "title": "So dooo",
        "score": 22228,
        "url": "https://i.redd.it/vi7ngehzgd9d1.jpeg",
        "content": "",
        "num_comments": 423,
        "comments": [
            "Neither of them produced a certificate stating they did not have donkey brains, very concerning",
            "Anyone want to go and get addicted to crack?",
            "Who am I suppose to vote for the democrat whos blasting me in the ass or the republican thats going to blast me in the ass?",
            "I didnt hear either one of them lay out their spaghetti policy.",
            "![gif](giphy|nXUCkgH6BmigU|downsized)\n\nMy face during the debate",
            "So who is the pickle party nominating.",
            "Taxes. Theyll be lower. Son.",
            "Stupid science bitches couldnt make they more smarter",
            "Idk why this debate would change anyones mind lol",
            "The democratic vote is right thing to do, Philadelphia. SO DO."
        ]
    },
    "WHAT UP?! We're three cool guys who are looking for other cool guys who want to hang out on our Party Island.": {
        "title": "WHAT UP?! We're three cool guys who are looking for other cool guys who want to hang out on our Party Island.",
        "score": 282,
        "url": "https://i.redd.it/xvt4p66dei9d1.jpeg",
        "content": "",
        "num_comments": 31,
        "comments": [
            "Is *that* what The Isle of Man is?  I've always heard of it",
            "Never knew there was an peninsula that looked like a bicep.",
            "Dudes in good shape encouraged.",
            "You knew it was a dick!?",
            "Dude that's a sweet bicep peninsula.",
            "Must be facing the Virgin Islands!",
            "I need to get laid. I found this landmass entirely too exciting lol.",
            "Its pointed right at the part of Italy that looks like a boot.",
            "How did yall get my profile?",
            "Needs more veins if its a bicep."
        ]
    },
    "To celebrate the 18th anniversary of Danny DeVito's first appearance on IASIP, here's a look at Frank throughout the seasons. What are your favorite Frank moments? 💩": {
        "title": "To celebrate the 18th anniversary of Danny DeVito's first appearance on IASIP, here's a look at Frank throughout the seasons. What are your favorite Frank moments? 💩",
        "score": 168,
        "url": "https://i.redd.it/p65ytn29mh9d1.jpeg",
        "content": "",
        "num_comments": 77,
        "comments": [
            "I cherish every single second I see him on screen.\n\nSo I can proudly say, he has serviced my heart.",
            "Clawing and sliding his way out of a leather couch, naked and sweaty and panting, in the middle of an office Christmas party is peak Frank Reynolds ",
            "When questioned under pressure he gets the stress-burps.",
            "His laugh after he shoots Doyle McPoyle while tripping on acid and says holy shit, this thing is loaded.",
            "DENNIS! God dammit! Frank, youre losin it!!",
            "I love when they are all stoned with country Mac and Frank just says Yes!! to everything so emphatically whilst munching - the delivery of this one simple little word is perfection!",
            "So anyways I started blastin",
            "Do you think this is a fresh shrimp or is it a frozen shrimp?",
            "The beginning of the Wolf Cola episode when he doesnt realize the whole gang is watching him with his morning routine. He sure loves those delicious nose clams.",
            "Oops I dropped my monster condom that I use for my magnum dong"
        ]
    },
    "They were clearly ahead of their time.": {
        "title": "They were clearly ahead of their time.",
        "score": 432,
        "url": "https://v.redd.it/lu2kikhqtf9d1",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Just disappointed they didnt shed light on their spaghetti policies during the debate.",
            "I think this is extremely underrated. If the definition of our current state affairs is, its this.",
            "I love that they can say fuck uncensored now, Charlies delivery is always perfect lmao",
            "This is the best and funniest scene from the Ireland episodes.",
            "5/5 post. The only thing that could have made it better would be that it came with an egg in these trying times.",
            "Ones piss water, the other is piss mix with diarrhea chunks scooped out of the toilet",
            "Haha thats exactly what all the politicians say. Ohh noo.",
            "Frank is respectful, he carries out his waste.",
            "FFS, now is not the time to whine about the \"two-party system.\" Either we keep the ability to cast a meaningful vote or we lose that entirely. We don't do that by voting for Stein or whoever jabroni is running as the libertarian.",
            "You're gonna say that when the Dennis trying not to cough scene exists??"
        ]
    },
    "Hell, I woulda let ya turn me into swiss cheese... I woulda let ya make me uh, make me into a mailbox, just open the slot and put whatever you want inside. Not no more. I got a wife now. So I will not suck you and I will not be sucked on by you, K?": {
        "title": "Hell, I woulda let ya turn me into swiss cheese... I woulda let ya make me uh, make me into a mailbox, just open the slot and put whatever you want inside. Not no more. I got a wife now. So I will not suck you and I will not be sucked on by you, K?",
        "score": 96,
        "url": "https://i.redd.it/8fshc8kb8h9d1.png",
        "content": "",
        "num_comments": 26,
        "comments": [
            "Split him open.... like a coconut,",
            "Byron, remember you said you didnt want that anymore!",
            "Whoa! Mister Hottie, come on now!",
            "I usually dont find lizards in the wild",
            "What do we say, Dennis?",
            ".. shoulda locked my damn door",
            "I really miss tom sizemore",
            "This is probably my favourite episode, amazing scenes one after the other!",
            "I got cash in my pocket, I got desire in my heart, I'm frothin' and'a foamin'",
            "This was stuck in my head all yesterday"
        ]
    }
}