{
    "Meta_iel": {
        "title": "Meta_iel",
        "score": 30,
        "url": "https://www.reddit.com/r/ich_iel/comments/1d57fkr/meta_iel/",
        "content": "Liebe Zuhausis,\n\nHier ist wieder unser monatlicher Metafaden. In diesem Pfosten könnt ihr wie üblich Anregungen, Bemerkungen, konstruktive Kritik, Vorschläge und so weiteres loswerden. \n\n^(Oder einfach **friedlich** miteinander über Gott und die Welt diskutieren.)",
        "num_comments": 34,
        "comments": [
            "Hiermit beantrage ich eine Erweiterung der Öffnungszeiten. Es kann ja wohl nicht angehen, dass man als hart arbeitende Person abends ein wenig michmichs betrachten möchte und dann haben die studentischen Hilfskräfte schon wieder Feierabend. Die nutzen den doch eh nur zum saufen!\nHalbes /s",
            "bin vollkommen damit einverstanden dass hier keine politischen Pfosten mehr erlaubt sind, aber gibt es einen deutschen Unter ders erlaubt und nicht ein braunes Ekelparadies ist? will einfach manchmal witzige Meimeis zum Thema sehen. Empfehlungen wären nett.",
            "Seit längerer Zeit mal wieder im sub, es sind auffällig viele memes aber nichts politisches. Hat sich was geändert?",
            "\"ich🇩🇪iel\" wird als titel nicht mehr angenommen. Das sollte auf einem deutschen Unter schon möglich sein. Bitte sachaut mal nach wie sich das einrichten lässt. Danke sehr.",
            "Ist Politik wieder erlaubt? Es sind nämlich zwischenzeitlich wieder viele politische Pfosten aufgetaucht, gegen die nichts unternommen wird.",
            "Warum lockt ihr alle politischen posts? Wenn überall die Blauen in den Kommentaren wären würde ich das ja verstehen.",
            "Auch wenn es sich nicht zu 100 % vermeiden lässt begrüße ich es wenn ich_iel ein unpolitischer sub ist auf dem shitposts o.ä. lustige Begebenheiten des alltäglichen Lebens gepostet werden.",
            "Für linke scheißepfosten gibt es r/gekte",
            "Sollte nun wieder funktionieren. Unsere Titelregel wird mit jeder Anpassung etwas genauer. Danke für den Hinweis!",
            "Wir haben bei der EDV-Heißlinie angerufen und uns wurde versichert dass sie in naher Zukunft einen Techniker vorbeischicken."
        ]
    },
    "ich_iel": {
        "title": "ich_iel",
        "score": 1378,
        "url": "https://i.redd.it/86ai6shbee9d1.jpeg",
        "content": "",
        "num_comments": 77,
        "comments": [
            "Oder du freust dich, dass die Lebensmittel so teuer geworden sind. Jetzt musst du nicht mehr soviel schleppen und schonst deinen Kiefer und deine Zähne. Win-win. 😀",
            "Um mal bisschen ne andere Perspektive reinzuwerfen: \nEvolutionär betrachtet ist es (überlebens)wichtig, überall das Negative und die Gefahren zu sehen, so gesehen, ist es das Normalste der Welt.\nWichtig ist aber auch, >bewusst< die kleinen schönen Dinge im Leben zu feiern, sonst Abwärtsspirale und so, ne... Ich spreche aus Erfahrung 😅",
            "Geil, wieder Überstunden, die im Zeiterfassungssystem nicht auftauchen!",
            "Ich könnte dein Meimei noch ewig weiterführen und liebe dich für diese Idee!",
            "Jaaa endlich Zusatzarbeit, nachdem ich heute früher heim wollte. Aber ich wollte ja lernen flexibler zu sein, warum nicht auf der Arbeit damit anfangen?",
            "Kein Problem, wenn Söder die 6-Tages-Woche einführt dann hast genug Geld zum tanken, kannst noch nen Tag mehr um 6 aufstehen und evtl. reichts ja dann auch für warmes Wasser, zumindest am Sonntag.",
            "Yay wieder ne Woche rum und kein Geld ausgegeben. Wofür denn auch, wenn man nur arbeitet und schläft.",
            "Heizen ist schweineteuer geworden? Geil, wer im Winter in 'ner kalten Bude sitzt trägt weniger zur globalen Erwärmung bei.",
            "Na ja, letztendlich ist Rahmung ja schon ein Ding … Kontext oder Bedeutung, Werteorientierung etc. Aber ja, hab auch wenig Bock um 6 aufzustehen :D",
            "irgendjemand hat mir mal gesagt, dass man die kleinen Dinge im Leben schön finden soll. Wie \"Diese eine Blume, konzentrier dich darauf, ist die nicht schön? Ja, die Blume ist schön. Konzentrier dich darauf! Schöne Blume! Konzentration? Oh, das hilft nicht gegen die drückende Last von Lebenszeitverlust und finanziellen Schwierigkeiten? Tja, dann ist das halt DEINE Schuld, dass du dich nicht auf diese wunderschöne Blume konzentrieren WILLST!\"\n\nunschön."
        ]
    },
    "ich💸iel": {
        "title": "ich💸iel",
        "score": 1835,
        "url": "https://i.redd.it/bbenr1tpag9d1.jpeg",
        "content": "",
        "num_comments": 123,
        "comments": [
            "Also wird ab jetzt die FDP gewählt?",
            "uhh, der feine Herr hat ein Konto",
            "Uuuuuuuund da ist es weg!",
            "Meins 7 Stellig. Oh das war die Kontonummer.",
            "*Heult in Gehalt an Mitte des Monats*\n\nUnd trotzdem ist mein Geld am Ende des Monats weg",
            "Fragt sich nur, für wie lange",
            "sind wir jetzt zu gut für diesen unter lases geworden, der herr?",
            "Meins ist auch vierstellig und rot mit einem Strich davor. Erbitte Instruktionen.",
            "Die besten 23 Sekunden des Monats",
            "Wer am 5. des Monats noch Geld hat, ist geizig."
        ]
    },
    "Ich🍞iel": {
        "title": "Ich🍞iel",
        "score": 196,
        "url": "https://i.redd.it/0jj2b1q5eh9d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "Ich bin mir bei dem Template immer nicht sicher, ob das ironisch oder ernst gemeint ist",
            "Ich finde, bei der der maimai Schablone fehlt irgendwie die Pointe und sie wird zu oft genutzt…",
            "Wann verschwindet diese Vorlage endlich wieder?",
            "kann ich deins mitessen, wenn du es nicht willst?",
            "Finde Kürbiskern nicht soo geil. Sonnenblumenkerne sind geiler. Mehr zu puhlen und schmeckt geiler.",
            "Lies den Pfosten vom Original pfostierer nochmal",
            "Hässlich =/= Ekelig, steht auch auf meinem Tinderprofil",
            "Karola pult leider keine Krabben mehr",
            "Ooooh Karola,\n\nsiet letzte Woch is dat um me geschehn!\n\nIck heb di inne Köök\n\nKrabben pulen sehn.",
            "Hochwähli für \"pulen\" 👍"
        ]
    }
}