{
    "POS didn’t look before changing lanes [oc] nsfw for language?": {
        "title": "POS didn’t look before changing lanes [oc] nsfw for language?",
        "score": 4300,
        "url": "https://v.redd.it/u60wiungqy7d1",
        "content": "",
        "num_comments": 438,
        "comments": [
            "Hello /u/memeNOTavailable! Please reply to this comment with the following information to confirm the content is OC\n\n* What country or state did this take place in?\n\n* What was the date of the incident?\n\n* Please reconfirm that this is original content \n\nIf you are unable to reply directly to this comment, please leave a standalone comment in your thread with the requested information.  \n\nIf you fail to answer these questions, your post will be removed.\n\n\n \n ------\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IdiotsInCars) if you have any questions or concerns.*",
            "Correction: Didn't Care before changing lanes.  \n  \nAlways drive like everyone else is an idiot.",
            "Need to upgrade to a horn for this type of situation",
            "~~Brake~~ Brace for impact I guess?",
            "That wasn't a \"didn't look\" situation, that was a \"didn't care\"",
            "If you drive long enough, you start to recognize these situations as high risk situations. You have to assume every car you’re around is going to do something stupid. Assume the truck driver doesn’t look over his shoulder and starts moving over. Would he see you if he’s looking forward? Not in his blind spot, no. So you have three options. Accelerate to be in front of him. Coast down so you end up behind him in case he moves over. Or just be ready to hit the brakes if he moves over. After he moved into the first lane, you have to assume he won’t stop. It’s very basic defensive driving. I’ve been driving 15,000 miles a year for about a decade now. Not one accident because at this point these situations are pretty much ingrained in me to stay away from. Part of it is just luck, but I’ve avoided a lot of potential accidents, even if I was completely in the right. Graveyard is full of people who had the right of way. \n\nTake this as a learning moment between the heavy roasts and the experience itself. You weren’t wrong, but you were certainly not right.",
            "You're about to be roasted. Sub is ruthless.",
            "OP, you have the reactions of a sloth.",
            "This is Dallas, isn’t it?",
            "great driver, even applied the horn for 5 seconds and everything!"
        ]
    },
    "Kid forgot how to put the car in “park” and doesn’t leave a note saying he hit my car [oc]": {
        "title": "Kid forgot how to put the car in “park” and doesn’t leave a note saying he hit my car [oc]",
        "score": 629,
        "url": "https://v.redd.it/rq4ad8ldlz7d1",
        "content": "",
        "num_comments": 47,
        "comments": [
            "Hello /u/TristalMeth! Please reply to this comment with the following information to confirm the content is OC\n\n* What country or state did this take place in?\n\n* What was the date of the incident?\n\n* Please reconfirm that this is original content \n\nIf you are unable to reply directly to this comment, please leave a standalone comment in your thread with the requested information.  \n\nIf you fail to answer these questions, your post will be removed.\n\n\n \n ------\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IdiotsInCars) if you have any questions or concerns.*",
            "This reminded me that I don’t have a pad of paper in my glovebox. I’d have to draw my number on their window with my nose grease",
            "I love car parks. On the old Passat I had, there were nicks in the paint all round from shopping trollies. This one has a thicker rubber buffer strip on the doors that stops this.\n\nPeople just don't give a fuck.",
            "Did it cause any visible damage?",
            "If there is no damage, the note is unnecessary.",
            "It would have been HILARIOUS if his door had been locked,,,",
            "That's why I drive sh\\*t cars when going to parking lots.  Scratch on my bumper?  Hey- you gave it more character!",
            "Subaru means ‘Love’. Right.",
            "If you pause just before he gets back in his car, you can see him laughing about it too.",
            "Man, if I saw this and saw no damage who freaking cares."
        ]
    },
    "Whose fault is this? [oc] I cut the video because I turned off the car shorty after to check the front for projectile damage.": {
        "title": "Whose fault is this? [oc] I cut the video because I turned off the car shorty after to check the front for projectile damage.",
        "score": 60,
        "url": "https://v.redd.it/b01s9t3h138d1",
        "content": "",
        "num_comments": 44,
        "comments": [
            "Hello /u/npatel0713! Please reply to this comment with the following information to confirm the content is OC\n\n* What country or state did this take place in?\n\n* What was the date of the incident?\n\n* Please reconfirm that this is original content \n\nIf you are unable to reply directly to this comment, please leave a standalone comment in your thread with the requested information.  \n\nIf you fail to answer these questions, your post will be removed.\n\n\n \n ------\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IdiotsInCars) if you have any questions or concerns.*",
            "Why was the truck with the load still in the passing lane when being passed by vehicles on the right?  At some point you need to drop your ego, slow up, and move over.",
            "Truck driver towing shit in the left lane who intentionally wouldn’t let somebody in front of him after they clearly showed intention.  Why do people have such fragile egos?  Now you got a fragile truck dummy, feel better than that guy you wouldn’t let pass you?",
            "In many states if either party contributed to the accident, then they are liable for the accident.  The Mercedes driver looks to be the one who caused the accident, but it could be argued the truck driver sped up to prevent the merge and wasn't moving forward in the passing lane.  They both could be deemed at fault and liable for damages.  \n\nIMO both were being dicks and paid an unfortunate price.   Worse, they put others at danger too.",
            "Both of them are being idiots",
            "The truck driver at pretty much every moment of that video. He deliberately rammed the white car after it had already fully occupied the lane. His little landscaping business just came to an end.",
            "hard to judge speeds, but it looks to me like the white car was fully in the left lane, and maintaining a constant speed when the truck tried to accelerate around him. I'd argue the white car made a risky decision, but both legally and ethically the truck caused the accident.",
            "I blame the truck that shouldn't have been in the passing lane in the first place.",
            "Id put both at fault, as has been said by others. Truck with small peepee energy not letting the white car get in front but white car for being aggressive in trying to move over",
            "Obviously the white sedan, even though I personally would have let him through because it was absolutely obvious what would happen. They literally announced they'll do something stupid so let them be stupid in a way that doesn't involve a lot of stress.\n\nThey may get a new truck and trailer but it surely won't be worth the pain and paperwork."
        ]
    },
    "Gotta love Charlotte drivers [oc]": {
        "title": "Gotta love Charlotte drivers [oc]",
        "score": 294,
        "url": "https://v.redd.it/h99k7gq3oz7d1",
        "content": "",
        "num_comments": 41,
        "comments": [
            "Hello /u/Young-Jerm! Please reply to this comment with the following information to confirm the content is OC\n\n* What country or state did this take place in?\n\n* What was the date of the incident?\n\n* Please reconfirm that this is original content \n\nIf you are unable to reply directly to this comment, please leave a standalone comment in your thread with the requested information.  \n\nIf you fail to answer these questions, your post will be removed.\n\n\n \n ------\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IdiotsInCars) if you have any questions or concerns.*",
            "If it's anything like Toronto, they thought you were trying to jump a few spots by using that lane",
            "Wait and see what happens on I-85 till it rains:)",
            "That guy is clearly upper management material.",
            "My guess, people hit that lane and then cut back in, dude is probably tired of it. Saw you driving up, decided to not let it happen to him. Road rage makes people do stupid stuff",
            "Alan Parsons. Nice music, lad.",
            "That driver ought to be retested",
            "Omg, I asked out loud “what the fuck are you doing??” as if I were OP.",
            "Solution:  forward mounted gun turrets.",
            "I have yet to meet anyone from the Carolinas with an IQ above room temp 🤣😂"
        ]
    },
    "This exit keeps getting closed off and it’s hard to see til it’s almost too late. Close call. [OC]": {
        "title": "This exit keeps getting closed off and it’s hard to see til it’s almost too late. Close call. [OC]",
        "score": 469,
        "url": "https://v.redd.it/a9hmqtlgry7d1",
        "content": "",
        "num_comments": 52,
        "comments": [
            "Hello /u/No-Understanding-980! Please reply to this comment with the following information to confirm the content is OC\n\n* What country or state did this take place in?\n\n* What was the date of the incident?\n\n* Please reconfirm that this is original content \n\nIf you are unable to reply directly to this comment, please leave a standalone comment in your thread with the requested information.  \n\nIf you fail to answer these questions, your post will be removed.\n\n\n \n ------\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IdiotsInCars) if you have any questions or concerns.*",
            "That's dangerously bad traffic control. Write a complaint email to the State dept of transportation citing lack of \"advanced warning\" for that night closure. But if you want faster results. Post the complaint on the state's dept of transportation Twitter (x) page with this video.",
            "Almost ran over a state trooper one time because of shitty construction signage like this. \n\nThere were no lights at all, except for him standing in the middle of the off-ramp waving his flashlight. Not NEAR ENOUGH lighting to protect him. Super lucky I didn't become a felon that night! 😱",
            "Wow, whoever designed that is really not smart.. But you definitely gave that guy enough room to get back over. He must've REALLY wanted to get off that exit LMAO.",
            "New found glory YouTube binge has been uncorked.",
            "I ran into this in Minnesota. I was super on the ball, unfamiliar area, paying total attention and yet I was caught like this. No room for the merge, wtf, fortunately a trucker with his superior visibility and probably local knowledge saw my problem and slowed way tf down to let me in. I was towing, too. Just piss poor design and no taper to condense the traffic.",
            "So wait, who's the idiot in this situation if the shit is hard to see until you're right on it?",
            "NFG!",
            "I don't understand who's the idiot here. It's just a bunch of people on the road getting caught out by a terribly announced exit closure and getting in each other's way.",
            "Next time, please only include one audio source....\n\nI can't stand this auditory assault"
        ]
    }
}