{
    "Weekly Thread: Playlist and Self-Promo drop!": {
        "title": "Weekly Thread: Playlist and Self-Promo drop!",
        "score": 47,
        "url": "https://www.reddit.com/r/ifyoulikeblank/comments/14anaw5/weekly_thread_playlist_and_selfpromo_drop/",
        "content": "# Welcome to the weekly playlist drop & self-promotion thread. :)\n\nA reminder: Please keep **all playlists and self-promotion** to this thread. Thank you!",
        "num_comments": 289,
        "comments": [
            "[removed]",
            "If you like EDM with chords that resolve nicely:\n[Hash Cartel](https://music.apple.com/ng/playlist/hash-cartel-pt-2/pl.u-55D6XYqT8BY77Ga)",
            "If you like 2pac or overall old school/underground rap with a throwback meets modern approach and you're a nerd/geek that has dealt with depression/emotional strain/deep thinking/suicidal thoughts: https://civicmusic2023.bandcamp.com/album/fall-and-winter-2022-enhanced-audio",
            "If you like Pop Country, don't listen to this playlist.\n\nhttps://open.spotify.com/playlist/4PAiazkexpJ3S6nvsNMYF1?si=1OQcipV6R9CWnntUz9O8DA",
            "[new HOUSE MUSIC MIX show](https://youtu.be/VEmenbYbfv4)",
            "If you're looking for Retro Soul or Soul Pop feel good vibes. If you lik Leon Bridges,  The Dip, St Paul and the Broken Bones, Black Pumas.\n\nhttps://open.spotify.com/track/4oVDopGdLrWqBIpzpRhCqV?si=695d6899896d4a5b",
            "If you like bones, suicide boy$, city morgue check me out I go by Capobankz. Here’s my latest AMV (HALF EVIL) now on YouTube and all streaming lmk what ya think.Link below  🕸️🕷️[(Capobankz Half evil )](https://youtube.com/shorts/50TpcOfB5fA?feature=share)",
            "https://distrokid.com/hyperfollow/anthonyescobar/day-by-day Anthony Escobar 🔥🔥🔥",
            "If you like experimental hip hop and boom bap, then you might like my new song:\n\nhttps://youtu.be/8mJHOrTGxyI",
            "If you like rock music that *strays (hehe)* away from the usual chords and rhythm and fuses genres together, then give this lil ole local band a shot. Many thanks!\n\n[The Stray by The Hell Catz](https://open.spotify.com/track/1R6g5ihi9R3JkgRlHBAEwC?si=5897e7a5eef54e2d)"
        ]
    },
    "[META] [Mod Announcement] How to use this sub - and how (not) to use the [META] Tag": {
        "title": "[META] [Mod Announcement] How to use this sub - and how (not) to use the [META] Tag",
        "score": 55,
        "url": "https://www.reddit.com/r/ifyoulikeblank/comments/16jbz7y/meta_mod_announcement_how_to_use_this_sub_and_how/",
        "content": "Hello r/ifyoulikeblank!  \n\nThis is your friendly neighborhood moderator, here with some information on how to correctly use this sub and our title tags, and to address some recent frequent misuse of the [META] tag in the sub.\n\nIf you are new here, please read this post before posting.  If you have been around a while, please take a moment to refresh yourself with some of our rules. :)\n\n#There are two - and **only** two - kinds of posts allowed in this sub.\n\nOur sub is NOT a self-promotion vehicle for new artists or creators, and it is NOT a general discussion or song/movie/actor/music/genre identification sub.  We are a media recommendation sub, and we have very specific guidelines for posts to be allowed here.  \n\nThere are two ways to format your post titles here, depending on if you would like to ask for recommendations or to give others recommendations with your OP.\n\n#If you want people to recommend things to you:\n\nThe “IIL” acronym stands for \"If I like...\" - to be used in a way that states \"If I like (this song) because of (reasons,) what else will I like?\"\n\n**This is the most common type of post here, and most OPs should be using THIS format for their posts! Your title *must* use the [IIL] tag - It *will* be reported by our frequent long-time members here if it does not, and it will be removed if you use the [IYL] or [META] tags instead of the [IIL] tag.**\n\nThe title should look like the following example:\n\n>[IIL] The song (name a song you like here) because (give a specific trait about it you want suggestions to include), [WEWIL?]\n\n* The \"WEWIL\" acronym stands for \"What else will I like?”\n\n* Your example should include something specific *about* the song that you want to hear more of in the music recommended to you.  (Without details, no one can give you appropriate responses and you won't get suggestions that you will actually LIKE.)\n\n#If you want to recommend media *to others* that you think they'll like based on some other piece of media that is similar:\n\nThe “IYL” acronym stands for \"If YOU like...\" - to be used in a way that states \"If you enjoy (this song) because of (reasons,) you might also like this song.\"\n\n**This tag is not for self promotion.  This SUB is not for self promotion.  If you post your own material here, you WILL get banned, without warning.  No exceptions, no appeals.**\n\nThe title should look like the following example:\n\n>[IYL] The movie (some movie similar to your suggestion) because (your reason you think it is similar to your recommendation), [YMAL] (this suggested movie).\n\n* The \"YMAL\" acronym stands for \"You may also like...\"\n\n* This is a VERY uncommon post type in this sub, unless people are attempting to subvert rule 2.  We ALWAYS look at these posts, but if we miss one, our long-term members sure won’t - and they WILL report you for a rule 2 violation and you WILL be banned.\n\n* If you are suspected of passing off your own media as an \"I found this new media and you might like it!\" post, that will earn you an immediate *permanent* ban from the sub for trying to subvert rule two. \n\n*Please note that moderators look at your posting history across Reddit, and if you are spamming your own stuff elsewhere, you are going get a ban here.  Period.*\n\n#How to use (and how NOT to use) the [META] tag:\n\nThe [META] tag is NOT so you may post off-topic posts or general media discussion posts or music identification posts, or anything that is not an IIL or an IYL.  \n\nThe [META] tag is *only* to be used if you have questions or comments about this subreddit itself, and how it operates on Reddit.\n\nExamples include suggestions for new rules here, asking for clarification about a rule here, suggesting a new theme, stickied post, etc in the sub, or asking ***the moderation team*** any other question about this sub - not asking *the members here* about media.\n\nThank you all for reading, and for your help in ensuring these rules are adhered to.  We are a million-member (and counting) sub with a VERY small moderation team, so your help in following these rules and reporting rule-breaking posts to us is greatly appreciated!\n\nHave a wonderful day :)",
        "num_comments": 22,
        "comments": [
            "[deleted]",
            "Think your Automod's a bit broken after this update. Seems like anything with square brackets in the title is automatically tagged as a meta post.",
            "I have read it multiple times now, I have posted again, I don't see the issue with my post",
            "I just made a post asking for artist/song recommendations for a playlist that i’ll be using to promote my music outside of reddit, is that okay or does that still count as self promotion?",
            "How do I prevent reddit from automatically embedding the first YouTube or Spotify link and thus creating a post with a thumbnail?",
            "Is it possible to create a new post to ask for recommendations of something I've already asked recommendations for a few years ago? Is it possible to link to that older thread on the new one for more references, or no?",
            "I just made a post and included the things I like about X in the body, but not the title. Should I resubmit?",
            "I keep trying to ask a post about a certain type of singer (alto specifically) and I've reviewed it multiple times and it prevents me from posting. Am I missing something? Is there something I'm not doing right?",
            "I agree. I'm a new user and I had no idea that I had to use these tags or how NOT to. Very confusing",
            "I almost don't want to post"
        ]
    },
    "IIL the band Amberkill, WEWIL?": {
        "title": "IIL the band Amberkill, WEWIL?",
        "score": 7,
        "url": "https://www.reddit.com/r/ifyoulikeblank/comments/1dr45q6/iil_the_band_amberkill_wewil/",
        "content": "I loooooove Amberkill, but their catalog is TINY!  I need more of that vibe",
        "num_comments": 0,
        "comments": []
    },
    "IIL obscure phrases like \"stoned like a biblical whore\" or \"colder than a witches tit\" WEWIL": {
        "title": "IIL obscure phrases like \"stoned like a biblical whore\" or \"colder than a witches tit\" WEWIL",
        "score": 54,
        "url": "https://www.reddit.com/r/ifyoulikeblank/comments/1dqoli6/iil_obscure_phrases_like_stoned_like_a_biblical/",
        "content": "",
        "num_comments": 93,
        "comments": [
            "nervous as a long tailed cat in a room full of rocking chairs",
            "colder than a well digger’s ass\n\nhotter than two rats fucking in a wool sock",
            "Louder than two skeletons fucking on a tin roof",
            "A janitor I used to work with used to say \"I'm lower than whale shit around here.\"",
            "Higher than a giraffe’s breakfast.",
            "drunker than cooter brown.",
            "Stumbling around like a blind dog in a meat house.",
            "Drunk as a lord / sober as a judge",
            "There's a book called The Joy of Lex, has all these old fun phrases. 😁",
            "\\* Useless as tits on a boar (or bull)\n\n\\* Happier than a tornado in a trailer park\n\n\\* Sweating like a hooker in church (or the \"family friendly\" variant used in The Princess and the Frog, \"sweating like a sinner in church\")\n\n\\* As useless as a chocolate teapot\n\n\\* \"Like a fart in a whirlwind\" (this one always makes me giggle)\n\n\\* Not quite the same, but I really like it when \"not the sharpest tool in the shed/not the brightest bulb/not the sharpest crayon in the box\" are unintentionally Frankensteined together into something like \"Not the sharpest crayon in the attic\""
        ]
    },
    "IIL Encre Noire for its moody, old library smell WEWIL?": {
        "title": "IIL Encre Noire for its moody, old library smell WEWIL?",
        "score": 6,
        "url": "https://www.reddit.com/r/ifyoulikeblank/comments/1dr35d2/iil_encre_noire_for_its_moody_old_library_smell/",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}