{
    "Weekly Thread: Playlist and Self-Promo drop!": {
        "title": "Weekly Thread: Playlist and Self-Promo drop!",
        "score": 47,
        "url": "https://www.reddit.com/r/ifyoulikeblank/comments/14anaw5/weekly_thread_playlist_and_selfpromo_drop/",
        "content": "# Welcome to the weekly playlist drop & self-promotion thread. :)\n\nA reminder: Please keep **all playlists and self-promotion** to this thread. Thank you!",
        "num_comments": 289,
        "comments": [
            "i have a new song coming out on 2/22 about the infinite nature of love in a society driven by manufactured scarcity : ) Check me out on IG @ imyourluckybreak",
            "If you like Electric Callboy or similar heavy music with a dancey twist, come check r/partycore :)",
            "IYL Billy Joel, The Kinks, Badfinger,",
            "IYL Tara Westover’s Educated and Sarah Polley’s Run Towards The Danger memoirs. Specifically memoirs about overcoming difficult childhoods and murky memories.",
            "New band Nova Buzz, soon to release their first album in a few weeks, give them a listen! They have two singles currently available. www.novabuzzmusic.com",
            "if anyone has any songs that they truly think deserve more recognition than they get r/underated_songs is a good place to share them",
            "Thanks. Right off my alley.",
            "i love your music man\n\nkeep doing what you do",
            "whats your favorite song on there?",
            "Cool meter thing you're doing, awesome riff and stellar vocals"
        ]
    },
    "[META] [Mod Announcement] How to use this sub - and how (not) to use the [META] Tag": {
        "title": "[META] [Mod Announcement] How to use this sub - and how (not) to use the [META] Tag",
        "score": 56,
        "url": "https://www.reddit.com/r/ifyoulikeblank/comments/16jbz7y/meta_mod_announcement_how_to_use_this_sub_and_how/",
        "content": "Hello r/ifyoulikeblank!  \n\nThis is your friendly neighborhood moderator, here with some information on how to correctly use this sub and our title tags, and to address some recent frequent misuse of the [META] tag in the sub.\n\nIf you are new here, please read this post before posting.  If you have been around a while, please take a moment to refresh yourself with some of our rules. :)\n\n#There are two - and **only** two - kinds of posts allowed in this sub.\n\nOur sub is NOT a self-promotion vehicle for new artists or creators, and it is NOT a general discussion or song/movie/actor/music/genre identification sub.  We are a media recommendation sub, and we have very specific guidelines for posts to be allowed here.  \n\nThere are two ways to format your post titles here, depending on if you would like to ask for recommendations or to give others recommendations with your OP.\n\n#If you want people to recommend things to you:\n\nThe “IIL” acronym stands for \"If I like...\" - to be used in a way that states \"If I like (this song) because of (reasons,) what else will I like?\"\n\n**This is the most common type of post here, and most OPs should be using THIS format for their posts! Your title *must* use the [IIL] tag - It *will* be reported by our frequent long-time members here if it does not, and it will be removed if you use the [IYL] or [META] tags instead of the [IIL] tag.**\n\nThe title should look like the following example:\n\n>[IIL] The song (name a song you like here) because (give a specific trait about it you want suggestions to include), [WEWIL?]\n\n* The \"WEWIL\" acronym stands for \"What else will I like?”\n\n* Your example should include something specific *about* the song that you want to hear more of in the music recommended to you.  (Without details, no one can give you appropriate responses and you won't get suggestions that you will actually LIKE.)\n\n#If you want to recommend media *to others* that you think they'll like based on some other piece of media that is similar:\n\nThe “IYL” acronym stands for \"If YOU like...\" - to be used in a way that states \"If you enjoy (this song) because of (reasons,) you might also like this song.\"\n\n**This tag is not for self promotion.  This SUB is not for self promotion.  If you post your own material here, you WILL get banned, without warning.  No exceptions, no appeals.**\n\nThe title should look like the following example:\n\n>[IYL] The movie (some movie similar to your suggestion) because (your reason you think it is similar to your recommendation), [YMAL] (this suggested movie).\n\n* The \"YMAL\" acronym stands for \"You may also like...\"\n\n* This is a VERY uncommon post type in this sub, unless people are attempting to subvert rule 2.  We ALWAYS look at these posts, but if we miss one, our long-term members sure won’t - and they WILL report you for a rule 2 violation and you WILL be banned.\n\n* If you are suspected of passing off your own media as an \"I found this new media and you might like it!\" post, that will earn you an immediate *permanent* ban from the sub for trying to subvert rule two. \n\n*Please note that moderators look at your posting history across Reddit, and if you are spamming your own stuff elsewhere, you are going get a ban here.  Period.*\n\n#How to use (and how NOT to use) the [META] tag:\n\nThe [META] tag is NOT so you may post off-topic posts or general media discussion posts or music identification posts, or anything that is not an IIL or an IYL.  \n\nThe [META] tag is *only* to be used if you have questions or comments about this subreddit itself, and how it operates on Reddit.\n\nExamples include suggestions for new rules here, asking for clarification about a rule here, suggesting a new theme, stickied post, etc in the sub, or asking ***the moderation team*** any other question about this sub - not asking *the members here* about media.\n\nThank you all for reading, and for your help in ensuring these rules are adhered to.  We are a million-member (and counting) sub with a VERY small moderation team, so your help in following these rules and reporting rule-breaking posts to us is greatly appreciated!\n\nHave a wonderful day :)",
        "num_comments": 22,
        "comments": [
            "Think your Automod's a bit broken after this update. Seems like anything with square brackets in the title is automatically tagged as a meta post.",
            "I have read it multiple times now, I have posted again, I don't see the issue with my post",
            "I just made a post asking for artist/song recommendations for a playlist that i’ll be using to promote my music outside of reddit, is that okay or does that still count as self promotion?",
            "How do I prevent reddit from automatically embedding the first YouTube or Spotify link and thus creating a post with a thumbnail?",
            "Is it possible to create a new post to ask for recommendations of something I've already asked recommendations for a few years ago? Is it possible to link to that older thread on the new one for more references, or no?",
            "I just made a post and included the things I like about X in the body, but not the title. Should I resubmit?",
            "I keep trying to ask a post about a certain type of singer (alto specifically) and I've reviewed it multiple times and it prevents me from posting. Am I missing something? Is there something I'm not doing right?",
            "I agree. I'm a new user and I had no idea that I had to use these tags or how NOT to. Very confusing",
            "I almost don't want to post",
            "The best advice on every sub across Reddit is to always read the sub’s rules before you post there - that will keep you from ever having any issues again since all mod teams run their subs differently and have different rules and guidelines for how each operates. \n\nThanks for taking a look at ours!"
        ]
    },
    "IIL Swans, Nick Cave, Tom Waits and Radiohead WEWIL?": {
        "title": "IIL Swans, Nick Cave, Tom Waits and Radiohead WEWIL?",
        "score": 4,
        "url": "https://www.reddit.com/r/ifyoulikeblank/comments/1dr9myj/iil_swans_nick_cave_tom_waits_and_radiohead_wewil/",
        "content": "More specifically bands that have 1) Their own distinct sound 2) Great lyrics 3) Lengthy discographies without many missteps 4) Were constantly evolving their sound 5) Exploring dark / profound themes in their music\n\nI'm not looking for similar musicians but rather those that fit the above list. I know that these kind of artists/bands are usually the exceptions but still if you know any (maybe more obscure?) picks let me know. Thanks",
        "num_comments": 7,
        "comments": [
            "Here are a few to consider:  \n  \nThe Cure (there were some missteps here and there but they have a powerful oeuvre)    \n  \n  \n  \nFUGAZI (might hit all of your criteria)  \n  \nSonic Youth (their lyrics are not dark *per se,* but might be of interest)  \n  \nFailure/Ken Andrews/Year of the Rabbit (his lyrics can be pretty obscure at times but also tackle addiction and other dark themes)  \n  \nPJ Harvey (nails your criteria imo)  \n  \nMogwai (they don't fit most of your criteria but they seem perfect at the same time, I'm not sure I could explain why)",
            "David Bowie \n\nScott walker \n\nDead Can Dance\n\nTim Buckley\n\n\nSome missteps, but great overall",
            "Jason Molina/Magnolia Electric Co/Songs:Ohia \n\nBill Callahan/Smog\n\nTindersticks",
            "This Heat",
            "Liars, This Heat",
            "Madrugada. \n\n[This Old House](https://www.youtube.com/watch?v=apw6YMRMmTs) is one good example",
            "[The Perfect Disaster](https://www.youtube.com/watch?v=-5GA54W0RmA&pp=ygUPdHYgZ2lybCBvbiBmaXJl)\n\n[Spiritualized](https://www.youtube.com/watch?v=m9C9uItXQsM)\n\n[Nico](https://www.youtube.com/watch?v=iJf8s3t0qCY)\n\n[The Soundtrack Of Our Lives](https://www.youtube.com/watch?v=DGf2PDldges)\n\n[Portishead](https://youtu.be/VgorUrtDJXo?si=pPlDkGr7GMeJIzCS)\n\n[Elliot Smith](https://www.youtube.com/watch?v=RWn9ocrMhlE)"
        ]
    },
    "[IIL] Daft Punk music, but I don't really dig no-vocals, what would I like": {
        "title": "[IIL] Daft Punk music, but I don't really dig no-vocals, what would I like",
        "score": 5,
        "url": "https://www.reddit.com/r/ifyoulikeblank/comments/1dr7wes/iil_daft_punk_music_but_i_dont_really_dig/",
        "content": "Or just maybe any electronic / synth-based band with vocalism?\n\n",
        "num_comments": 10,
        "comments": [
            "Sorry if these are obvs: Probably other French artists like Phoenix (\"Rome\"). Then there's LCD Soundsystem (\"Tribulations\"), M83 (\"We Own The Sky\"), C3zr (\"Kingsbury\"), Logic1000 (\"Can't Let Go\").",
            "Your good deed for the day: I always thought \"Music Sounds Better With You\" was Daft Punk. Possibly the Avalanches. Bravo, sir. Saved me from embarrassment.",
            "Oh yeah I've fallen in love with Kavinsky since I've watched Drive\n\nDefinitely adding Benjamin Diamond to listen to, same for Parcels\n\nReally liked Justice so far from what I've seen, they remind me of Tame Impala\n\nDon't dig others so far",
            "Yeah, will defo listen to more Justice when I'm at work\n\nWill check out Junko Ohashi too, really pleasant to ears\n\nListened to Drug Cabin here and there, they remind me heavily of Mac Demarco, wish they had more music",
            "Air",
            "Chromatics ",
            "Stardust is (was) one of the guys from Daft Punk with another person\n\nhttps://en.wikipedia.org/wiki/Music_Sounds_Better_with_You",
            "Daft Punk is my favorite band, some of my favorite similar songs with vocals:\n\n\n* Stardust - Music Sounds Better With You https://www.youtube.com/watch?v=FQlAEiCb8m0 (coproduced by Thomas Bangalter, half of Daft Punk)\n* The Supermen Lovers (feat. Mani Hoffman) · Starlight https://www.youtube.com/watch?v=h61QG4s0I3U\n* Armand Van Helden - You Don't Know Me (feat. Duane Harden) https://www.youtube.com/watch?v=-bsONE-kZwI \n* Benjamin Diamond - Fit Your Heart https://www.youtube.com/watch?v=DFWYfDVKmq0 (same singer as in Stardust)\n* Kavinsky - Nightcall https://www.youtube.com/watch?v=MV_3Dpw-BRY (produced by Guy-Man, half of Daft Punk)\n* Jerk Boy - Satellite (Art of Tones Disco Mix) https://www.youtube.com/watch?v=h-N6--NAoe0\n* Parcels - Overnight (Produced by Daft Punk) https://www.youtube.com/watch?v=BTdBc2Ba8ts\n* Justice - Mannequin Love (Starring The Flints)  https://www.youtube.com/watch?v=KTOgfHb8dZk\n* Purple Disco Machine - Something On My Mind (Braxe + Falcon Remix) https://www.youtube.com/watch?v=b7OFqyV3bLs",
            "[Modjo](https://www.youtube.com/playlist?list=OLAK5uy_nuuCUQioki41czlt80YqQ_WPQ5fzBEN6U)\n\n[L'Impératrice](https://www.youtube.com/playlist?list=OLAK5uy_mkdxFsDjF-puJixYe7w6r6IOpUIsZVgvU)\n\nMaybe even [James Pants](https://www.youtube.com/watch?v=qvErrmMZNVY)\n\nOf older artists, perhaps [Funkstar De Luxe,](https://www.youtube.com/watch?v=q1k8msfYVfw) [Dirty Vegas,](https://www.youtube.com/watch?v=gLCduDJVksc) [X-Press 2,](https://www.youtube.com/watch?v=qB_I1YBAozE) [Spiller](https://www.youtube.com/watch?v=syOK6zmpOe0)",
            "Signal boosting Justice from the other comment. Alternatively, look up French House(Daft Punk and Justice) as a genre, City-Pop (Junko Ohashi), or even Psychedelic Pop (Tame Impala)\n\nHere's some songs I like \n\n[Memory Box - Peter Cat Recording Co.](https://youtu.be/K6TWekfnjDQ)\n\n[Stop - Justice](https://youtu.be/x-R19oA1m8w)\n\n[Telephone Number - Junko Ohashi](https://youtu.be/XJWqHmY-g9U) a total classic\n\n[Balloon - Crumb](https://youtu.be/3xRxP6A5uUs)\n\n[Steely Dad - Drug Cabin](https://youtu.be/St9v5tAjbKM)\n\nAnd now time for something completely different to the request but I feel is adjacent\n\n[Hollywood Nights - Bob Seger](https://youtu.be/M-NW3qLcUlA)"
        ]
    },
    "IIL artists like Kali Uchis, Frank Ocean, Grimes, Billie Eilish, Weeknd ( essentially R&B ) in german language WEWIL?": {
        "title": "IIL artists like Kali Uchis, Frank Ocean, Grimes, Billie Eilish, Weeknd ( essentially R&B ) in german language WEWIL?",
        "score": 3,
        "url": "https://www.reddit.com/r/ifyoulikeblank/comments/1dra3hi/iil_artists_like_kali_uchis_frank_ocean_grimes/",
        "content": "I'm learning German and would like to listen to the music every now and then. Thanks in advance for the help 🙌🏼",
        "num_comments": 0,
        "comments": []
    }
}