{
    "ik_ihe": {
        "title": "ik_ihe",
        "score": 103,
        "url": "https://i.redd.it/wwl0m9iloh9d1.png",
        "content": "",
        "num_comments": 2,
        "comments": [
            "[Bron:](https://youtu.be/bMhlKts9Q_o?si=U2rmicXvSd_Fcmjr&t=86)",
            "[waaaaaaaa](https://youtu.be/mGfLVaDJkdw?si=p4tshTmiZZE3sFob)"
        ]
    },
    "Ik🙁😁ihe": {
        "title": "Ik🙁😁ihe",
        "score": 220,
        "url": "https://i.redd.it/mh3mugu3eh9d1.png",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Erg memewaardig, kan alleen geen leuke tekst bedenken",
            "Perfect getimede foto",
            "",
            "Oke?",
            "https://preview.redd.it/zjb10a3s8j9d1.jpeg?width=793&format=pjpg&auto=webp&s=a71ff5e9a4d6104a4e60764d69553192bfe2fa30\n\nGeen flauw idee wat deze afbeelding betekent maar hier is ie alsnog"
        ]
    },
    "Ik🪿🥚ihe": {
        "title": "Ik🪿🥚ihe",
        "score": 527,
        "url": "https://i.redd.it/ptws80r3yf9d1.jpeg",
        "content": "",
        "num_comments": 84,
        "comments": [
            "Ik twijfelde even of het politieke fanfiction was.",
            "Wat de fuck heb ik nou net gelezen? Waar GAAT dit over?",
            "Dames en heren: de nieuwe leiders van ons land.",
            "PePziNL wil graag worden opgehaald uit deze tijdlijn",
            "Ik na het kijken van het Amerikaanse politiek debat: gelukkig is onze politiek wel voornamelijk bezig met zaken die er toe doen\n\nIk na het lezen van dit stuk: ",
            "Neef ja man eier snackie 4 later danny doet hetzelfde in ze onderbroek en dan zeggen dat hij 3 ballen heeft blijft klessik alleen bestuurd danny geen land en karolin van der peepee wel vergeten ook echt ik ga niet liegen 4 je broer is wel echt goed goor",
            "Dit is hoe dromen voelen",
            "Huh?? Hoe bewaart iemand een ei in hun bh? Of je draagt een te grote maat, of je vind het ok om een platgedrukt gekookt ei uit je bh te eten (uberhaupt een ei uit je bh eten kan ik echt niet aan denken). Misschien begrijp ik de geschetste situatie verkeerd, maar what the fuck.",
            "Wat in de fanfiction is dit",
            "En weer gaat er een dag voorbij in den Haag."
        ]
    },
    "Ik🐮ihe": {
        "title": "Ik🐮ihe",
        "score": 219,
        "url": "https://v.redd.it/tbu7ogy3nf9d1",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Dit is de realiteit die de BBB wilt ",
            "Een bloemetjes deken? Wel leuk dat je vriendin even wilt poseren op bed voor de video..",
            "Die Paula is een koe, die zegt niet alleen boe",
            "Neef kapot lief soms voel ik me schulliedig dat ik ze eet want veel van die moemoes en knorretjes en zelfs kippetjes hebben gewoon persoonlijkheid en besten vriend en spelen zoals de homies dus ik probeer minderen vlees te eten want dan voel ik me iets beter maarja ik eet toch vlees ik vroeg aan neef marco wat hij vond en hij zei dat ik gelijk had en daarna zei hij ewaja en ja het is ewaja maar ook ewaja :(",
            "Is gewoon z'n date van de avond ervoor",
            "oh mijn god een biessonn",
            "\"Hotel Kamer met gratis vlees\"",
            "Eerlijk gezegd zou ik dit echt geweldig vinden? GEEF MIJ HET ADRES IK MOET WETEN WAAR DIT IS",
            "Enige wat BBB hier ziet is ontbijt op bed.",
            "Die maakt een vla met koeienvlekken. Speciaal voor echte lekkerbekken."
        ]
    }
}