{
    "Stock Check Megathread": {
        "title": "Stock Check Megathread",
        "score": 28,
        "url": "https://www.reddit.com/r/IKEA/comments/17375tp/stock_check_megathread/",
        "content": "Hej everyone! From now on please use this thread for stock check requests. Generic “When will X product be back in stock” posts will be removed. I have verified the following users employment with IKEA, and they may be able to assist with stock checks.\n\nUS: [u/IngvarIncarnate](https://www.reddit.com/u/IngvarIncarnate/)  [u/treehousepiee](https://www.reddit.com/u/treehousepiee/)  [u/sharakus](https://www.reddit.com/u/sharakus/)  [u/WunderPicka](https://www.reddit.com/u/WunderPicka/)  [u/CoWorker\\_\\_Throwaway](https://www.reddit.com/u/CoWorker__Throwaway/)  [u/pyrozombies16](https://www.reddit.com/u/pyrozombies16/)  [u/loudduc](https://www.reddit.com/u/loudduc/)  [u/dank\\_IKEA\\_memes](https://www.reddit.com/u/dank_IKEA_memes/)  [u/odzbo](https://www.reddit.com/u/odzbo/)  [u/GrapeStrudel](https://www.reddit.com/u/GrapeStrudel/)  [u/ryomatua](https://www.reddit.com/u/ryomatua/)  [u/CM\\_TA-20](https://www.reddit.com/u/CM_TA-20/)  [u/thegeekgolfer](https://www.reddit.com/u/thegeekgolfer/)  [u/surprisegerbil](https://www.reddit.com/u/surprisegerbil/)  [u/CatnipChapstick](https://www.reddit.com/u/CatnipChapstick/)  [u/LiveTillYouDie](https://www.reddit.com/u/LiveTillYouDie/)  [u/casuallysentient](https://www.reddit.com/u/casuallysentient/)  [u/Apocopa](https://www.reddit.com/u/Apocopa/)\n\nCA: [u/dissident46](https://www.reddit.com/u/dissident46/)  [u/Mach1zmo](https://www.reddit.com/u/Mach1zmo/)  [u/CWrkrTWay](https://www.reddit.com/u/CWrkrTWay/)  [u/VitalumVitalus](https://www.reddit.com/u/VitalumVitalus/),  [u/zodiaciym27](https://www.reddit.com/u/zodiaciym27/),  [u/lxndrjw](https://www.reddit.com/u/lxndrjw/)\n\nGB: [u/Scarz\\_V2](https://www.reddit.com/u/Scarz_V2/)  [u/Barnesyy99](https://www.reddit.com/u/Barnesyy99/)  [u/lukajuno](https://www.reddit.com/u/lukajuno/)  [u/fluxt\\_](https://www.reddit.com/u/fluxt_/)  [u/SubtractAd](https://www.reddit.com/u/SubtractAd/)\n\nDE: [u/aosgoesoutside](https://www.reddit.com/u/aosgoesoutside/)\n\nDK: [The\\_Danish\\_Dane](https://www.reddit.com/user/The_Danish_Dane)\n\nSE: [u/robin\\_reala](https://www.reddit.com/u/robin_reala/)  [u/ArreBarre1](https://www.reddit.com/u/ArreBarre1/)  [u/ZealousidealFarmer23](https://www.reddit.com/u/ZealousidealFarmer23/)\n\nNL: [u/sjnarruf](https://www.reddit.com/u/sjnarruf/)  [u/DukeDucky](https://www.reddit.com/u/DukeDucky/)\n\nNO: [u/denniz84](https://www.reddit.com/u/denniz84/)  [u/Lower-Employer4010](https://www.reddit.com/u/Lower-Employer4010/)\n\nFI: [u/Kimosabbe](https://www.reddit.com/u/Kimosabbe/)\n\nThe IKEA website provides stock information when you select your store on the article page, please check there before posting. You can also sign up for back-in-stock notifications by email or SMS.\n\nStock check requests in the comments must include the following information:\n\n* Country\n* Preferred Store(s)\n* Article number(s)\n* Acknowledge you checked the website before posting. If a delivery date is listed this would be the same information co-workers here would have available. Instructions are as follows:  [https://imgur.com/a/GnoCoHh](https://imgur.com/a/GnoCoHh)\n\nRetail co-workers are not able to advise on availability for online orders. I have heard from a call centre co-worker that they are not able to check stock at the distribution centres either, and that only the IKEA website can provide this information by adding the item to the shopping cart, and seeing if a delivery option is available.",
        "num_comments": 337,
        "comments": [
            "Hi! I am in the USA. My preferred store is Centennial Colorado. Article # is **193.249.95 for**  **DOCKSTA** Table, white/white, 40 1/2 \". I checked the website and it is in stock in some other stores in the US but unavailable for shipping and at my store.",
            "Any clues when USA stores will receive the KIVIK three seater sofa?\n\nI did spot checks on the East Coast, West Coast, Texas, and Minnesota, and no stores seem to have them. I tried to sign up for SMS or email alerts, but the IKEA website produces an error when I do that.",
            "NYC. 392.873.98. No restock information online. Thank you!",
            "Jattebo Chaise, 794.853.01 IKEA Coquitlam, British Columbia #313 Or IKEA Richmond, British Columbia. Thanks!",
            "US - Burbank, 304.495.88. Have checked for a while now - out of stock without restock day for months. Thank you for your help!",
            "Wondering if the Idanas 4 drawer dresser in white is gone for good or coming back. Can pickup up in Charlotte , Jacksonville, or Norfolk.\n\nItem - 104.587.72",
            "Country: CH, preferred store: Vernier.\n205.572.86 (DAJLIEN Bench with storage, bamboo, 100x30x37 cm)\nWebsite isn't showing a restock date. I know this is a limited edition series but it was only released last month - am I out of luck already?",
            "Country: CA Store: Richmond Article Number 095.694.36 Kallax white stained oat effect TV Bench. I checked the website. Please and thank you!",
            "US, West Sacramento, item 804.776.68 Tjog storage box 13 3/4\" x 22\" x 11 3/4\". I've checked the website and it's unavailable at West Sac or for order. Mostly concerned it's not going out of production because I am looking for four more to complete a visual \"set.\" If it is going out of production, I'll drive to Emeryville or East Palo Alto since I see it in stock there. Thanks for any update.",
            "Country: Belgium.  \nStore : Zaventem Item: Sagstua bed sides Colour: Black Article no.: 404.294.10 Have set up a website alert. Don’t have a car, so can’t go for any other store. "
        ]
    },
    "Malm and other \"Chest of Drawer thing's\"": {
        "title": "Malm and other \"Chest of Drawer thing's\"",
        "score": 54,
        "url": "https://www.reddit.com/r/IKEA/comments/191qysw/malm_and_other_chest_of_drawer_things/",
        "content": "As  u/CoWorker__Throwaway  so elegantly put it:\n\n>This whole Chest of Drawer thing needs a stickied thread at this point, I'm tired of answering the same question over and over again.\n\nAnd this is this megathread. Here is the rest of the information they provided:\n\n>IKEA is releasing a new range of Chest of Drawers (COD) sometime in the summer that is designed be more tip-proof.  \n>  \n>The new range will have a built in feature that only allows one drawer to be open at a time. If the unit is attached to the wall, it allows for all drawers to be used as normal. The VIHALS dresser already has this function.  \n>  \n>Essentially every single COD article is being discontinued. The new range coming the summer **WILL NOT** be called MALM, HEMNES, etc.  \n>  \n>95% of current COD units are discontinued as of Jan/Feb24, but some are being replaced by temporary versions with the new tip function until Summer.  \n>  \n>The temporary range includes popular articles like MALM, HEMNES, BRIMNES, and others. But it is temporary in nature so it's difficult to say how much stock individual stores will have of any given article.  \n>  \n>If your store is already out of one of the discontinued COD articles, it's unlikely they will have more unless there is a temporary version of that article.\n\nEdit:   \nPS. This does NOT apply to all markets (at least not in denmark) Coworkers are welcome to update below :)",
        "num_comments": 157,
        "comments": [
            "The temporary range is for the US to be compliant with the new CPSC regulations as a temporary measure ahead of the planned new rollout",
            "So upset. I love the nordli. I have the 12 chest of drawers and a 2.5 year old. Never has it fallen. Its also mounted because that is MY responsibility as the mom, not ikeas.",
            "Something strange is happening. Majority of the new dressers went offline on IKEA website this weekend. I went into the store and they said they had none in stock because of a quality issue. They didn’t elaborate more on it. ",
            "BRIMNES and SONGESAND will be the same, just not open as far. IDANAS will have a wider base. Everything else is getting temporary range and will be going away completely July 1st. I've seen the replacements, and they're all different colors, so if you like something, get it asap. \n\nAs far as I know, this only impacts the US and maybe Canada, but I'm not 100% sure about that.",
            "Is there a renter friendly way to make these new dressers work?",
            "I've had a restock notification for two locations for the 6 drawer TARVA for so long that I've had to renew them. Today I got a notification that they will no longer be available. Are they also apart of this redesign, or just not going to be coming back in the summer? Does anyone know if the TARVA gets a temporary line?",
            "This thread is so helpful. Thanks coworker_throwaway!\n\nAny idea of what to expect with a new version of the hemens 8 drawer? Is it safe to say it won’t be out until summer? Does ikea standardly put out a preview of their new lines?",
            "Got a notification white Hemnes 6 drawer dresser will be back in stock near me next week. Any way to know if it’s going to have the half opening drawers or not? Trying to avoid after reading recent reviews on the Koppang.",
            "The new hemnes dresser is back in stock in my store in FL. Is there somewhere I can see a video of the new pull out function?",
            "Just bought a Hemnes and am furious about the loud clicking noise. We have an older Hemnes and love it and these drawers absolutely suck. Has anyone else actually tried ripping off the plastic tabs? Will you do it from each drawer or from the interior of the dresser? I’m afraid I’ll mess something up and no drawers will open 😂"
        ]
    },
    "Billy Bookcase downgrade": {
        "title": "Billy Bookcase downgrade",
        "score": 21,
        "url": "https://www.reddit.com/gallery/1dr7g1o",
        "content": "I’m devastated, why has the quality taken such a nosedive??\n\nBought this bookcase to fit along with my others and its quality is rubbish. Pieces of the shelf scratched/taken out, shelves and overall wood pieces are thinner than previous versions.\n \nIt’s slightly discoloured to be a cream rather than its previous white. Usually for the shelves you could use both sides of the shelf and display whichever looked better outwards but now one side is literally horrific to look at, rough, textured as if someone folded over the white coating or someone experimented with 3D art and failed, a massive line going through it, as I mentioned earlier thinner shelves which look unnatural and cheap next to my older billy bookcases.\n\nI’m devastated at the decrease of quality, it’s really an insult to consumers as dramatic as that sounds. The photos speak for themselves. Not sure if ikea is cutting corners or changed manufacturers but this new level of quality is appalling, what happened? :(\n\nFor pics older Billy is on left while newest is on right. ",
        "num_comments": 5,
        "comments": [
            "I work at IKEA, and the company truly doesn’t care about the customer anymore… They’ve done everything in their power to cut down quality so they can pump out more but charge more money.. IKEA’s going downhill.. Fast..",
            "Oh no!   I was always a fan of them and have lots in my library.    That is terrible to hear.",
            "I don’t buy the chipboard stuff, I found it just doesn’t last in high humidity",
            "I’d heard it was coming, but it’s very disappointing. I could always count on Billy.☹️",
            "I’m not sure about IKEA as a whole, but for sure INGKA group is ruining what IKEA has always been about."
        ]
    },
    "Have the resealable bags gotten A LOT worse in quality?": {
        "title": "Have the resealable bags gotten A LOT worse in quality?",
        "score": 5,
        "url": "https://i.redd.it/qg1uv00khi9d1.jpeg",
        "content": "I bought a box of resealable bags in 2021 and another box today. The sizes I bought may actually be the same, I noticed that they changed up the colors of the bags as well. \n\nThings I noticed:\n- The bags snap open with the lightest pressure from within. The ones I used to have actually needed some force to open. They don’t stay closed.\n\n- The bags are A LOT thinner. They tore from within for some reason, a big tear, see pic\n\nHas anyone noticed the same things? Thanks",
        "num_comments": 3,
        "comments": [
            "Sadly most things have gotten a lot worse in quality.",
            "Yup",
            "I haven't been to IKEA for a very long time because I feel it has gone from great value (reasonable quality/good price)  to poor quality and outrageous price.\n\nLast time I was there, by very long payment lines, they had an expensive \"bookcase\" that looked barely capable of supporting a single book."
        ]
    },
    "IKEA IN BELGRADE ": {
        "title": "IKEA IN BELGRADE ",
        "score": 4,
        "url": "https://i.redd.it/91cwmjd07i9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Aftonsparv"
        ]
    }
}