{
    "I’m a federal agent with an agency focused on immigration. AMA!": {
        "title": "I’m a federal agent with an agency focused on immigration. AMA!",
        "score": 402,
        "url": "https://www.reddit.com/r/immigration/comments/w2w0pp/im_a_federal_agent_with_an_agency_focused_on/",
        "content": "Previous AMA [here.](https://www.reddit.com/r/immigration/comments/mz4qhl/i_am_a_federal_agent_with_a_us_immigration_agency/)\n\nSame as last time, don’t ask about your specific case. Don’t share identifying info (names, case numbers etc). I am *not* with USCIS, so I might not have a lot of insight into complex procedural questions. I am *not* a CBPO either. \n\nBit of background— female, 30s, over 10 years in the field, worked for 3 different agencies. \n\nAsk me anything!",
        "num_comments": 1222,
        "comments": [
            "is immigration process(timeframe) actually getting better? or just pretending?",
            "My husband was denied a US tourist visa for us to go visit my family despite us both living in his home country, having jobs and assets and a dog and myriad ties to his country. The interview was over the minute they found out his spouse was American, and the officer said (paraphrased), \"don't even bother. You'll never get a tourist visa being married to an American because so many have illegally adjusted status, just apply for the spousal visa\". Is this true? Is the reviewer speaking out of his ass? Is there any way around this? Thanks for doing this :)",
            "Not sure if you deal with this kind of thing, but if you run into them, how much do you and your colleagues care about green card holders who don't keep their green cards on them, or nonimmigrant workers who don't have their passports with them all the time?",
            "Why does CBP make such a strong distinction when a foreigner is coming to the US to look for work (not allowed) vs. interview for work (allowed)? In either cases, they are not working.",
            "What do you think about the internal checkpoints in the US, that are set up by the agency you work for, at which ordinary Americans are stopped and questioned without reasonable suspicion or probable cause?",
            "What's the point of what you do? Since 2021 there have been over 2 million migrants allowed into the U.S. making false claims about being refugees seeking asylum. The border patrol let's them in, no hassles. Every day there are thousands being smuggled in, they want to be stopped by the border patrol so they can make an asylum claim and be put on a 5-7 year waiting list for a immigration hearing.",
            "Green card holder for more then 5 years husband left me at the beginning of covid to be with another woman hes a citizen. Im currently battling cancer for the 3rd time. Ive attempted to reconcile with him he said he wants a divorce but he wont put in the paper work. Ive thought about filing for divorce myself but I worry about how it will affect my citizenship cus of my health an how Im not able to get health insurance but need Medicare for treatment. Should I still apply for citizenship as a 5 year green card holder or will it be an issue cus my green card was given based of marriage. Thank you in advance for any help.",
            "Thoughts on where DACA will be heading in the future? Do you think it will be getting cancelled In the upcoming years?",
            "For Healthcare Professionals already in the US, would you recommend applying for Green card through Adjustment of Status or Consular Processing?\n\nI believe Consulates are still expediting Immigrant Visa Petitions for healthcare professionals, whereas AOS only expedites EAD (not AP or I-485)?",
            "Best president in last 40 years when it comes to enforcing immigration laws and prioritizing legal immigrants?"
        ]
    },
    "Spouse used me for green card": {
        "title": "Spouse used me for green card",
        "score": 106,
        "url": "https://www.reddit.com/r/immigration/comments/1dr1ypq/spouse_used_me_for_green_card/",
        "content": "2 weeks ago I found out my wife was planning to divorce me after getting her permit green card. Her plan was to leave me and be with her boyfriend from India who planned to come here on work permit. He is married and has 2 kids and he is planning to leave his wife as well. My wife who is going to be my ex now came on K 1 visa. I have sent USCIS to withdraw her 129F and 1-864 for Adjustment of status. Her application is still pending and not approved yet. I am literally heartbroken from all this going on. ",
        "num_comments": 77,
        "comments": [
            "Withdraw immigration application immediately \n\nSue her for immigration fraud and seek divorce",
            "At least you found out now and not later. Divorce her right now. Did you file I-130/ I-485 yet?",
            "This is awful to hear. Especially knowing how long the K1 process lasts, knowing you were sitting waiting throughout that for her just for it to end this way. I have no legal advice, just wish to tell you I'm sorry. You don't deserve that at all.",
            "You dodged a bullet. Just image finding out all of this after her getting the green card or citizenship even. You found out at the right time",
            "You're one of the lucky ones. So many people find out once it's too late. You caught her BEFORE. You're blessed.",
            "Sorry to hear about that. Where did you meet her and how long have you all been together?",
            "Move on bro... You will)l be okay.",
            "If the two of you are separating pending the adjustment application, and you notify USCIS that you are withdrawing your 485 and 864, then USCIS may put her in removal proceedings. Its unclear though what you said about her permit card if she has a 10 year green card already then it will be very difficult to have it taken away.",
            "How did you find out? What would you advise to people who could be in your shoes potentially?",
            "Can you not sue her? For marrying under false pretenses? Speak to a lawyer who specialises in immigration and family laws?? And keep all evidence!"
        ]
    },
    "Does filing a police report/restraining order as a VICTIM affect a migrant’s application process?": {
        "title": "Does filing a police report/restraining order as a VICTIM affect a migrant’s application process?",
        "score": 2,
        "url": "https://www.reddit.com/r/immigration/comments/1dr9vn0/does_filing_a_police_reportrestraining_order_as_a/",
        "content": "\nHello, as per the subject question, my girlfriend is a Venezuelan migrant who entered the US in 2021 via the Mexican border (no Visa) and who has applied for both Asylum and TPS and is awaiting for confirmation on both (primarily TPS).\n\nThat said she is being harassed and stalked by an ex boyfriend and is scared/hesistant to take action with police due to her immigration status.\n\nWould filing a police report or a restaining order as victim affect her immigration process negatively?\n\nI am a born US Citizen and we are planning to get married so she can apply for a green card as well. Would that be affected with something like this? Thank you.",
        "num_comments": 1,
        "comments": [
            "No. Reporting a crime does not interfere with her immigration process."
        ]
    },
    "Experience working with Your Roots in Poland?": {
        "title": "Experience working with Your Roots in Poland?",
        "score": 1,
        "url": "https://www.reddit.com/r/immigration/comments/1drd787/experience_working_with_your_roots_in_poland/",
        "content": "Hi all- I'm looking into securing my Polish Citizenship by Descent, and while I'm fairly confident that I qualify based on some previous stories and detective work, I'm missing many of the documents I'll need as proof. I came across [yourrootsinpoland.com](http://yourrootsinpoland.com/) who might be able to help with this, and I was curious if anyone has insight into working with them?\n\nThis field of expertise seems to be filled with scams, so I'm trying to do my due diligence before just reaching out. I'd also love any other referrals for organizations that do this if the one I'm asking about is not right.\n\nThanks in advance for any insight you may have.",
        "num_comments": 0,
        "comments": []
    },
    "Land border": {
        "title": "Land border",
        "score": 0,
        "url": "https://www.reddit.com/r/immigration/comments/1drd0qy/land_border/",
        "content": "It seems the US consulate in Toronto thinks that CBP can make determinations of US citizenship at the land border.\n\nIf you go to this link https://ca.usembassy.gov/embassy-consulates/toronto/ and click on the U.S. Citizen navigator and then click land travel to US, it says \n\n> For last-minute travel across a land border from Canada into the United States, expired U.S. passports, U.S. birth certificates, and other U.S. citizenship documents may be accepted at the land border as proof of citizenship, especially when presented with a valid photo ID. However, plan accordingly, as travelers without compliant documents are likely to be delayed at the border as U.S. Customs and Border Protection (CBP) officers work to verify identity and citizenship. \n\n> CBP also has the discretion to make citizenship and entry determinations for minor children born in Canada to U.S. citizens.  \n\nI am wondering about the last point on minor children born in Canada to US citizens. Why is it only limited to minor children born in Canada as opposed to children born in other countries US citizen parents? Is Canada somehow special? \n\nSo suppose a man, woman, and a child show up at the border. Father is a US citizen. He has a passport. Mother isn't a citizen, but has a foreign passport with a visa. There's no father on the child's birth certificate. But he is the biological father. If he agrees in writing to support the child and acknowledged the child as his own, is CBP obligated to do a DNA test, that the dad agrees to pay, to confirm the child's citizenship?",
        "num_comments": 1,
        "comments": [
            "> Is Canada somehow special? \n\nYes, Canada has a number of special privileges in US immigration law. It's a country with deep ties to the US, similar levels of wealth reducing the motivation for immigration fraud, and is essentially impossible to enter illegally other than from the US. All of these factors have resulted in policy that is more favorable to Canadians.\n\n> is CBP obligated to do\n\nCBP isn't obligated to do anything. As the link you quoted says, CBP has the *discretion* to make citizenship determinations. If there is ambiguity they will refuse and tell you to go talk to the consulate."
        ]
    }
}