{
    "Laptop/Hardware Queries Megathread": {
        "title": "Laptop/Hardware Queries Megathread",
        "score": 23,
        "url": "https://www.reddit.com/r/IndianGaming/comments/1ck4u1j/laptophardware_queries_megathread/",
        "content": "Post all your laptop or hardware queries here. Join the subreddit discord if you want a faster resolution.\n\nPrevious thread - https://www.reddit.com/r/IndianGaming/comments/17kslry/hardware_queries_megathread/",
        "num_comments": 355,
        "comments": [
            "Xbox game pass for the 1st person who see this (since i dont need it):\n\n3QP2F-WYDRW-MR4HJ-3D29Y-D6TYZ",
            "Is MD Computers safe. It doesn't allow cash on delivery and I think it's a bit sus for that.",
            "Can anyone suggest a pc build within 1.5L :). I'll probably not build it myself. Looking at 4070ti super",
            "Looking for most price efficient gaming laptop in 50k to 65k any suggestions would be appreciated",
            "Wanting to purchase a customized loq laptop from the online store ... It's says it will get shipped by June 20th ... Saw many instances on this sub that it gets Delayed by 3 to 4 weeks or even 6 weeks ... So should I get the laptop or order it via somewhere else",
            "Hi, I'm a bit out of the loop here, why is everybody advising not to purchase a hp laptop? Last time I bought a laptop hp was all the rage. What happened? Are there any good alternatives? Dell, Lenovo or something else? \n\nWhat should I buy for my brother with a budget of 35k-40k ? He'll normally some do college work and light gaming on it.",
            "Help! Doubt about cosmic byte firefly keyboard on Amazon",
            "Hi Guys ,   \nI want to buy good gaming headphones for pc (fps gaming) and my budget is around 3.5k INR. Can somebody suggest me some good headphones according to my budget",
            "Hello folks suggest a cpu configuration, budget is 90k.",
            "Hi guys, I am heading to Nehru Place next week to get my first pc assembled, can you please suggest what specs I should go with.  \nRequirements: Video editing and Games (Mostly valorant, story games like read dead, etc.)  \nBudget: 60-70k for only cpu, i already have a monitor, keyboard and a mouse."
        ]
    },
    "Steam Summer Sale 2024 Megathread": {
        "title": "Steam Summer Sale 2024 Megathread",
        "score": 133,
        "url": "https://www.reddit.com/r/IndianGaming/comments/1dprvse/steam_summer_sale_2024_megathread/",
        "content": " **Steam Summer Sale is here.**\n\nJoin our Discord Server https://discord.gg/jVJgAdM\n\nPost all links to games , discussions on prices etc. in this thread all other threads will be removed.  \n**More Info will Edited in when Required and available**      \n\n****    \nStore Page:  http://store.steampowered.com/   \nLink to Steam Awards :  https://store.steampowered.com/steamawards\n****  \n\n**Remember to collect your Trading Cards from voting and the queue daily**   \nSteam Status : https://steamstat.us/    \n**I would recommend checking it after an hour or so or in the morning .**   \nFirst of all install this extension : https://augmentedsteam.com/\nThis will help you a lot , and also allow you to put in custom wallet amounts  \nYou can visit  /r/GameDeals and /r/GameDealsMeta to check out interesting Deals.  \n\nFor a more live and animated discussion head over to our Discord -https://discord.gg/jVJgAdM\n\n****  \nPlease do go through the FAQs in our wiki : https://www.reddit.com/r/IndianGaming/wiki/index .    \n***\nYou can track Price History here: https://steamdb.info/  \nFull List of Games on Sale : https://steamdb.info/sales/   \nSteam Subreddit: /r/Steam , [DailyThread](https://www.reddit.com/r/Steam/comments/kiakd8/steam_2020_winter_sale_megathread/)  \nSteam trading card : /r/SteamTradingCards   \n****  \nSteam Front page resets at 10:30 PM everynight  \n****  \nRemember to vote with your wallet!  \nBuy Good games , priced reasonably!\n****",
        "num_comments": 286,
        "comments": [
            "Time to buy a ton of games that I'll never have the time to play, yippee!",
            "Can't wait to buy underrated games like the gta 5, rdr2, elden ring and witcher 3!",
            "Thinking of getting Forza Horizon 4 as it will be delisted soon. Will also get Hades, Dead Cells, Left 4 Dead 2 and a few others. Wish Diablo 2 Resurrected was available on Steam.",
            "Arma 3 on 200rs les go",
            "prices of many games r similar level or a bit higher than other sales, summer sale is the cheapest thing is gone?",
            "Buy Disco Elysium. It is heavily discounted(90rs). Trust me, you won't be disappointed.",
            "Please have elden ring on sale 😭🙏",
            "Looking forward to buying GTA-IV and The Orange Box.",
            "Disco Elysium - Rs 89 !!",
            "Here's a bit of advice. If you looking to buy ForzaHorizon 4 but won't be playing anytime soon, would recommend to wait for few more months. As per Microsoft's messaging, it looks like the game could be discounted further as they near the delisting date.\n\nHowever, since this is not confirmed by them and only inferred from their statement, the decision to wait is at your own risk 😛."
        ]
    },
    "Trying To beat the Game I Couldn't as a Kid": {
        "title": "Trying To beat the Game I Couldn't as a Kid",
        "score": 210,
        "url": "https://i.redd.it/5litneihkf9d1.jpeg",
        "content": "Titan is giving me a hard time😅,  any tips would be appreciated 🙏",
        "num_comments": 34,
        "comments": [
            "Go for the weapon with life steal or bleed",
            "even i tried but got bored of how many ads they put\nthough i switched of my wifi and mobile data, it doesn't let me continue the game",
            "i still play this game everyday. my fab is composite sword, if i pronounced this name correctly😅",
            "Damn Shadow fight 2 feeling nostalgic",
            "good old days i still remember how i beat the shit out of Titan",
            "You need to hit his legs on time, also idk if its still there but I used Tempest rage enchantment to beat him.",
            "I pretty much played the whole game using the golden katana with an overheat enchantment. The moveset of the golden katana can be linked a lot and could be used to unleash long combos making it easy to tackle difficult fights.",
            "I don't remember clearly, but I used that sickle attached to a chain. Didn't use anything else.",
            "Only weapon which worked for me was yari.",
            "They still couldn't replicate sf2 magic again. Too sad they chose to make money instead of making good games"
        ]
    },
    "Uncharted: The Lost Legacy is so beautiful ": {
        "title": "Uncharted: The Lost Legacy is so beautiful ",
        "score": 57,
        "url": "https://www.reddit.com/gallery/1dr60ue",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Shame that it was so short",
            "Its was a great game and i enjoy every moment of it",
            "Lost legacy must be one of the most beautiful games I have played",
            "Ya, but the thief's end was amazing",
            "Join our Discord server https://discord.gg/WX6jbCD\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianGaming) if you have any questions or concerns.*"
        ]
    },
    "Ask a wierd question but do answer it": {
        "title": "Ask a wierd question but do answer it",
        "score": 60,
        "url": "https://i.redd.it/fnqnw41gdg9d1.png",
        "content": "Can I use external gpu with it to play games or upgrade it's cpu ?",
        "num_comments": 19,
        "comments": [
            "Sadly no on both counts. This is a laptop masquerading as a Desktop. It has a laptop processor which is non-upgradable and neither does it have a compatible port for eGPU.",
            "No and fuck this shit got scammed into buying this when I was younger didn't know shit about tech",
            "Gpu external are possible but those are usually niche ,very high end laptop .They tend to utilise proprietary connection and require an external assembly.\n\nCpu for this form factor is embedded /soldered in so for both question No you cannot",
            "Watch Indian gamer video on this",
            "Such devices are not meant for gaming better save up and get a decent pc or a console",
            "You could've, but you'd need extra hardware and a thunderbolt compatible laptop and of course a regular gpu + power supply",
            "Bought an AIO, played a lot of AAA games, got excited that it ran so smooth on high settings, lack of airflow fried all circuits internally in about a year and half. It needs repairs to the motherboard and sdd is lost. Now it just sits in my room. I'm thinking of converting it into another monitor.\n\nNever buying another AIO again ever.",
            "No. And don’t buy this it’s not gonna play ANY game",
            "Would not recommend you to buy this, especially for gaming related purposes.",
            "You need a thunderbolt 4 for that. If you got that, you can covert a GPU to an external GPU. There are tutorials on how to do that."
        ]
    }
}