{
    "Bi-Weekly Movies, TV Series, Documentaries & Podcast Discussion & Recommendation Thread - 29 June, 2024": {
        "title": "Bi-Weekly Movies, TV Series, Documentaries & Podcast Discussion & Recommendation Thread - 29 June, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/indiasocial/comments/1dr1zho/biweekly_movies_tv_series_documentaries_podcast/",
        "content": "Hello r/IndiaSocial, Welcome to Bi-weekly Movies, TV Series, Documentaries & Podcast Thread!  \n\nWhat have you been Watching/Listening lately? Or you can share your Original Content with us.  \n\nThis space is not limited to just International or National content. You can share any Regional content too.  \n\nFeel free to share, recommend or discuss any content you have come across!\n\nNote: Remember to use Spoiler Tag >!Spoiler Content!< for spoilers.\n\n----\n[**Discord**](https://discord.com/servers/r-indiasocial-727016164215226450) | [**Instagram**](https://instagram.com/indiacasual) | [**Website**](https://indiacasual.com)",
        "num_comments": 0,
        "comments": []
    },
    "Late Night Random Discussion Thread - 28 June, 2024": {
        "title": "Late Night Random Discussion Thread - 28 June, 2024",
        "score": 16,
        "url": "https://www.reddit.com/r/indiasocial/comments/1dqmebr/late_night_random_discussion_thread_28_june_2024/",
        "content": "Place for Random Thoughts. Share away anything you want, and make some new friends along the way :)\n\n[**Rules**](/r/indiasocial/w/rules) **|** [**Bot Commands**](/r/indiasocial/wiki/bot_commands) **|** [**Socials**](/r/indiasocial/wiki/socials/) **|** [**Helpline**](/r/indiasocial/wiki/support/) **|** [**ModMail**](/message/compose?to=/r/indiasocial) **|** [**Wiki**](/r/indiasocial/wiki/index) **|** [**XP**](/r/indiasocial/wiki/xp) **|** [**Vellabot**](/r/indiasocial/wiki/vellabot)",
        "num_comments": 8847,
        "comments": [
            "Men have too much confidence for someone with negative boob existence.",
            "Mere appendectomy ke time we consulted some big shot senior surgeon, and he was soooo rude to us, my dad was really pissed about it. The entire car ride home was awkward because of his anger  ye bade doctors ko kya hi guroor hota hai bhai?",
            "Mujhe nahi lagta I'll amount to anything in life.",
            "Saw an absolute beauty at mandir today doing shiv pooja ![img](emote|t5_2qp7h|51074)![img](emote|t5_2qp7h|51074)",
            "Bache hue ek condom mein paani bharke gubbare banaunga ab",
            " light vibhaag Ki aisi ki taisi ",
            "Shared my room with this kid and usne laat toh nahi maare, but neend me 2-3 thappad maar diye mujhe. ![img](emote|t5_2qp7h|51086)",
            "Doctor has ordered a brain CT scan on my mom I am scared",
            "Aajkal iss thread ke kuch log mujhpar bohot gussa karte hai. But kar bhi kya sakte. :(",
            "Rate your kaleshi level from 1-10"
        ]
    },
    "What are the funniest Bisleri ripoffs you've ever seen?!": {
        "title": "What are the funniest Bisleri ripoffs you've ever seen?!",
        "score": 1186,
        "url": "https://www.reddit.com/gallery/1dr4j40",
        "content": "Here are my top mentions ",
        "num_comments": 90,
        "comments": [
            "Let's get my bestie a bistar with Bishnoi's nunu who is a bihari",
            "WTF IS BESTIE IM PISSING WHAT IS ALL THIS \n\nMy dad came from a trip and he brought home: beriberi (im deadass not lying.)",
            "u had us in last pic...ngl",
            "Bihari wla mera pic hai profile mei ja dekkh",
            "Vaise bestie ki jaroorat idhar sabko hai",
            "i saw once name BOSRIVALI (bhosdiwali)",
            "\"Vaiya 1 lit bestie dena\"![img](emote|t5_2qp7h|51075)",
            "4th one is just to scare off Salman Khan.",
            "Their is a graph question on leetcode where a starting word and end word is give and we have to go from starting word to ending by only changing one character of the word and return the minimum step required.",
            "LMAO this post is gold"
        ]
    },
    "What the hell did I actually read!! (Indian student fakes Father's death certificate for US Scholarship)": {
        "title": "What the hell did I actually read!! (Indian student fakes Father's death certificate for US Scholarship)",
        "score": 332,
        "url": "https://www.reddit.com/gallery/1dr6zxg",
        "content": "Ik it's vert long but it's worth every second.\nContext:-\nhttps://www.moneycontrol.com/news/trends/how-a-reddit-post-exposed-indian-student-who-faked-fathers-death-for-us-university-scholarship-12758162.html#goog_rewarded",
        "num_comments": 123,
        "comments": [
            "he was clever enough to do all this yet dumb to tell everyone on reddit lol",
            "bro had one job, all he had to do was SHUT THE FUCK UP! and keep living the dream...\n\n/s",
            "Dawg can sell the college and get away with it \n\nEdit just read the article . What was bro even thinking",
            "I don't think people would have believed his story when he posted for the first time.  Now everything is believable. \n\nHe mentioned something about \"like to do fraud\" which makes you wonder that he will be in India for the foreseeable future, always planning, defrauding people.",
            "Waiting for a Bollywood director to pick this up and make a movie out of it.",
            "I thought mods are useless ![img](emote|t5_2qp7h|51238)",
            "aree baapre itna dimaag, lekin galat use krlia![img](emote|t5_2qp7h|51238)",
            "itna dimag hone ke bawjood 11-12 me padhai kaise nhi ho paayi",
            "If he just kept quiet. He could have been well settled. But he has to brag about it.",
            "Bro was a genius but he also wanted fame and people to acknowledge this"
        ]
    },
    "Aaj bhi darr lagta h question dekh ke": {
        "title": "Aaj bhi darr lagta h question dekh ke",
        "score": 468,
        "url": "https://i.redd.it/4y62mtc19g9d1.jpeg",
        "content": "I am 23 now.\n",
        "num_comments": 27,
        "comments": [
            "Solve kar le bhai book ki aatma ko shanti mil jayegi, wo kya kehte hain; closure",
            "Cute . Mujhe mummy ka text sirf ye batane ke liye aata hain ki \"Ghar aa jao, bohut late ho gaya hain\"",
            "Yeh maths ne bohot truama diya hai mujhe",
            "I love how I used to get beaten for not being able to subtract a one-digit number from a two-digit number and the borrowing from left side number, lmao. I remember once my mum beat me hard for some 11-7 substraction, yarrr ab hands par 10 fingers hi hai eleventh kaha se lau???\n\nWell well, small flex since 9th I topped maths with 100 in 9th and 10th, 95 in 12th, missed 100 in 12th due to silly mistakes and the JEE thing :')",
            "Iske liye kam se kam 30 saal ka time toh dein....",
            "Bhai aaj bhi exams de raha hoo and muze kuch aa nahi raha, time slip ho raha and meri fatt rahi, aise sapne aate hai.![img](emote|t5_2qp7h|51073)",
            "Bachpan me Jo daant padhti thi when you weren't able to solve ",
            "Haha cute \nPr trauma kyu hone laga mujhe ",
            "Me to  Maa \"Still the questions are difficult, give me 2 years more\"",
            "I remember my elder sister while teaching me the integers chapter , she was whooping my arse on every mistake but at the end i understood the topic really well. Maths is such a horrible subject "
        ]
    }
}