{
    "Monthly random discussion & queries thread on bikes...": {
        "title": "Monthly random discussion & queries thread on bikes...",
        "score": 3,
        "url": "https://www.reddit.com/r/indianbikes/comments/1d5bofm/monthly_random_discussion_queries_thread_on_bikes/",
        "content": "This thread is for random discussion about bikes in India and the rest of the world,  and also for all the queries. No abuses, just the friendly banter.. \n\n[\\[Past RDT posts\\]](https://www.reddit.com/r/indianbikes/search/?q=random+discussion+thread&restrict_sr=on&sort=new) \\- [\\[Discord server\\]](https://discord.com/invite/Q9nSrDn6tE)\n\nHelp out fellow redditors if they ask any queries here. Keep a watch on comment count of this post! \n\n[\\[Sub description post\\]](https://www.reddit.com/r/indianbikes/comments/1awderf/welcome_to_indianbikes_description_in_comments/) \\- [\\[Cars India sub\\]](https://www.reddit.com/r/CarsIndia/)\n\nWhich new bike to buy queries should mention ex-showroom or on-road budget, highway or city usage percentages, city of use etc for better response.Make sure to follow both reddit website rules and this subreddit rules while posting and commenting in this subreddit.",
        "num_comments": 30,
        "comments": [
            "This is a recurring scheduled post of the subreddit, start a discussion or a query by commenting in this post. Thank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/indianbikes) if you have any questions or concerns.*",
            "Hi. Planning to buy my first bike. I've only ridden bikes like passion, glamour and splendor plus till now. I'm 183cm and 65kg. Thinking of RE hunter 350. Also I'm not an experienced rider. Is hunter 350 good? Budget is roughly 2L. Any suggestions?",
            "Is it necessary to shift down during engine braking?\nIs the engine braking and rev-matching the same thing? \nAs far as I understand, engine braking means turning the throttle in the opposite direction while braking & has nothing to do with rev-matching. Please correct me if I'm wrong.",
            "Is duke 200 going to get a gen 3 update?",
            "Best budget bike with decent looks and good mileage ?\n\nHi guys, I'm going to buy my first bike in a few days. Budget - 1.3 lakh or lower, must look decent and must have good mileage. What are some options to consider ?",
            "*Bangalore*. Any Riding groups which organise weekend trips. \nRE showrooms should also be organising something of this sort right?",
            "Delhi/Gurgaon riding groups\n\nHi, I'm about to finish college and will soon be returning to Delhi, I have an Avenger 220 (old model) and would love to connect with people/groups who go on road trips.",
            "Have you checked SMK Typhoon? I am also looking for good helmets within budget and SMK Typhon (or Steller) seems to be decent. It is difficult choosing riding gear.",
            "Maybe go for the ns400? Test ride both",
            "Try V storm and see how you like it."
        ]
    },
    "City-wise chat on Discord server for Indian Bikes and Cars India subreddits..": {
        "title": "City-wise chat on Discord server for Indian Bikes and Cars India subreddits..",
        "score": 3,
        "url": "https://discord.com/invite/Q9nSrDn6tE",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Discord has option to give reactions to every message, unlike reddit..\n\nhttps://discord.com/invite/Q9nSrDn6tE\n\nDiscord server needs mandatory linking of your reddit account before sending gif messages."
        ]
    },
    "Game over": {
        "title": "Game over",
        "score": 210,
        "url": "https://v.redd.it/bj3osmeugh9d1",
        "content": "",
        "num_comments": 33,
        "comments": [
            "This has got to be fake. I used to push my NTORQ Race XP like crazy and still only reached 96 top speed. How does he reach 112 and that too on a curve?",
            "free highway on a scooter, 70 max...who tf takes it beyond 100",
            "Has 2 business days to stop",
            "Why are bridge roads this slippery?",
            "Ntorq has good brakes. It'll stop but not advisable to go such high speed in city",
            "Which bridge is that ?",
            "I would say, the meter is not showing the actual speed. His actual speed would be around 60/70",
            "It is frustrating to see these look at me how amazing I am...and justifying the act.",
            "Mera dost bhi aise hi Bina source diye aadhe adhure video post karta tha ek din use hijde utha ke le gye",
            "I managed to do 109 in my ntorq in the first month after I bought it. Idk what happened but I can't do more than 102 now. Probably he is going down on the slope in that video."
        ]
    },
    "18K done. Don't ask me anything!": {
        "title": "18K done. Don't ask me anything!",
        "score": 91,
        "url": "https://i.redd.it/uhbfdbe7ii9d1.jpeg",
        "content": "",
        "num_comments": 29,
        "comments": [
            "Damn, dude's a PM candidate!",
            "Ahhh a contrarian are we.",
            "Ye T-shirt Jockey ki hai na?",
            "I don't need to ask you. I have one 😤",
            "Why didn't you buy metro or classic 350",
            "Is the rear suspension stiffer compared to other bikes?",
            "hunter waley to proper RE bhi nahi h lol, so yeah justified \n\nJK Congo Bhai",
            "Why shouldn't we ask you anything?",
            "Haha, iska bhi jabaab ni duga",
            "Sometimes we need to be"
        ]
    },
    "Himmy and Kimmy": {
        "title": "Himmy and Kimmy",
        "score": 118,
        "url": "https://i.redd.it/5dqg8jusbh9d1.png",
        "content": "Inspired by another post on this sub.\n\nWhen 2 Competitor brand products end up in the same group 😁\nRecently bought KTM ADV 390x\n\nClocked in 350km on day 2 ✌️\nMore kms to go 🤞",
        "num_comments": 20,
        "comments": [
            "I also bought 390x recently, can't wait to go on adventures with it.",
            "Here’s a controversial statement: Kimmy is better than Himmy.",
            "Himmy looks like tht sibling who has body of a gymnast.",
            "What model is that ktm?",
            "I also got myself ktm adventure 390 standard version this February only... Power is top notch 💯🔝",
            "Himalayan looks more premium bike\n\nWould love to here from you. What do you recommend among these? Ktm definitely has better engine but I want to know how is Himalayan performing",
            "And both will do Yimmy Yimmy.\n\nI'll see myself out.",
            "KTM is definitely the winner here",
            "The power delivery is slingshot like 🤌",
            "KTM 390x Adventure. OP has mentioned it already."
        ]
    }
}