{
    "r/IndiaSpeaks - April 2024 - Mod applications | We need new mods!": {
        "title": "r/IndiaSpeaks - April 2024 - Mod applications | We need new mods!",
        "score": 27,
        "url": "https://www.reddit.com/r/IndiaSpeaks/comments/1bxvgkh/rindiaspeaks_april_2024_mod_applications_we_need/",
        "content": "Namaste Everyone\n\nWe are now a \\~600k Sub, with such numbers also comes work and responsibilities. So we come back to the community to ask for help!\n\nYes we are looking for users who can volunteer , have enough time, who can bring in new ideas and drive our journey on reddit to new heights!\n\n# Some things to remember:\n\nApply only if you think you would have enough time to help out!\n\n* One of the main requirement is being available at least once day on discord to check the queries/discussion of the Mods\n* Being available everyday for minimum an hour for moderation duties\n* Being active and initiating or helping in organizing Debates/Cult-ex/AMAs or other threads\n* Active user with an account age of minimum 6 months.\n* Users should have a minimum of 25 submissions or 250 comments on our Sub\n\nPlease fill out the Application Form below if you think you would be a perfect fit for us,\n\n# [MOD APPLICATIONS - APR 2024](https://form.jotform.com/240883371796469)\n\nThe last date for filing application closes on 20th May 2023!\n\nThank you so much, and good luck to all!\n\nRegards, The Mod Team",
        "num_comments": 24,
        "comments": [
            "When can we apply again?",
            "Applied.",
            "i am interested",
            "Please apply",
            "* One of the main requirement is being available at least once day on discord to check the queries/discussion of the Mods",
            "Why this post delted, mods? [https://www.reddit.com/r/IndiaSpeaks/comments/1cqayug/what\\_is\\_your\\_opinion\\_on\\_gst\\_tax\\_system\\_in\\_india/](https://www.reddit.com/r/IndiaSpeaks/comments/1cqayug/what_is_your_opinion_on_gst_tax_system_in_india/)",
            "hello, I am new to this server, I am only commenting because I saw a video on youtube which denies Genocide of Hindus by the Mughals. I tried posting the video but am unable to do so because \"removed by reddit's filter\".\n\nHere is the video : [https://www.youtube.com/watch?v=TQutHGvAXDY](https://www.youtube.com/watch?v=TQutHGvAXDY)  \nCan someone else post this video instead and put the attention of the server to this given how distasteful it is? I can't imagine youtube letting a video that defends/denies the fact that Nazis gassed the Jews but they will allow this?",
            "[removed]"
        ]
    },
    "r/IndiaSpeaks - What are you doing this Weekend ?": {
        "title": "r/IndiaSpeaks - What are you doing this Weekend ?",
        "score": 2,
        "url": "https://www.reddit.com/r/IndiaSpeaks/comments/1dr1zge/rindiaspeaks_what_are_you_doing_this_weekend/",
        "content": " Tell us about your plans for the weekend. Any place you are visiting? Or doing things which you don't get time to do on weekdays?\n\n&#x200B;\n\n* Newbies and lurkers who feel shy in participating, you are also welcome :)\n* Feel free to talk anything but politics.\n* You can also join our [Discord server Invite](https://discord.gg/V8sCPac)\n* The \"Weekend\" thread is posted every Saturday. [Previous Thread](https://www.reddit.com/r/IndiaSpeaks/search/?q=What%20are%20you%20doing%20this%20Weekend%20&restrict_sr=1&sort=new)",
        "num_comments": 0,
        "comments": []
    },
    "Maharashtra boy goes to hospital for leg surgery, doctors circumcise him 'by mistake', probe on": {
        "title": "Maharashtra boy goes to hospital for leg surgery, doctors circumcise him 'by mistake', probe on",
        "score": 716,
        "url": "https://i.redd.it/c2uq6h6ofh9d1.jpeg",
        "content": "",
        "num_comments": 119,
        "comments": [
            "They wheeled Mohan inside, they wheeled Mohd outside .",
            "Leg se lund par kaise pahunche?",
            "How tf it is by mistake lol.\n\nYou can't mess up this bad.",
            "This is not acceptable at all",
            "they are high on weed or what",
            "what kind of gerk Z people we have nowdays on reddit. Thats a nine year old boys life we are talking about. Imagine the pain parents and the kid will have to go through in his life ahead.",
            "I will never go into GOV hospital even if I am on verge of death.",
            "Iss dssh abh lund bhi safe nahi hai",
            "Bro has a third leg.",
            "Ye katbulle doctor kab se ban gaye?"
        ]
    },
    "Here are some funniest Bisleri ripoffs you'll ever see...": {
        "title": "Here are some funniest Bisleri ripoffs you'll ever see...",
        "score": 388,
        "url": "https://www.reddit.com/gallery/1dr4i0w",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Bestie k sath bistar pe bisnoi ka  nunu ",
            "Bihari Bestie ke saath Bistar pe Bisnoi ka Nunu ",
            "Nunu is not even trying.",
            "Nunnu   \n   ",
            "The last one is my company! ![img](emote|t5_3d4x4|20098)",
            "4th one salmon bhai k liye trap hai![img](emote|t5_3d4x4|20020)",
            "Today I saw Bislleri. Double l",
            "Ye bisnoi Bihari hai ka?",
            "Nunu ",
            "OP loves nunu water"
        ]
    },
    "Canadians are Now Openly Calling Khalistanis Terrorists!": {
        "title": "Canadians are Now Openly Calling Khalistanis Terrorists!",
        "score": 429,
        "url": "https://youtu.be/3E6rDadzR-s?feature=shared",
        "content": "",
        "num_comments": 25,
        "comments": [
            "The sooner you Canadians realise this, the better for you!",
            "Punjab in pakistan is larger than Indian Punjab. Makes you think why don't they bark at pakistan and want to take it over. Why only India?, I guess the dog doesn't bark at the feeding hand.",
            "Apparently comedians have more sense than politicians",
            "Terry Milewski has been calling them terrorists ever since the plane explosion, so this isn't anything new",
            "Took them so long to call a spade a spade. We didn't brand them as terrorists for no reason.",
            "Anything against India to suit their interests. They forget that the government is not Gandhi.",
            "Trudeau won't, in a thousand years and neither will Opposition. But if the public starts mounting pressure on to political parties, something might happen.",
            "They will not realize it but people will vote right wingers into power. The antics are hitting news now and creating law and order problems everywhere affecting normal day to day life, plus increasing crime overwhelming local police. It will create a backlash against Indian diaspora",
            "Exactly exactly....",
            "I just don't understand why they chose to support them in the first place?"
        ]
    }
}