{
    "IMPORTANT: Read this !": {
        "title": "IMPORTANT: Read this !",
        "score": 43,
        "url": "https://www.reddit.com/r/indiadiscussion/comments/11mnb8u/important_read_this/",
        "content": "# Please follow the rules while posting.\n\n&#x200B;\n\n1.**Censor all usernames and sub names. PROPERLY.**\n\n&#x200B;\n\n2.No YT links\n\n&#x200B;\n\n3. When giving links to OTHER subreddits, **replace www with np.**\n\n&#x200B;\n\n4. **DO NOT SUMMON USERS. Do not tag them in comments.**\n\n&#x200B;\n\n5. DO NOT use u/   or  r/  in the **title of the post.**\n\n&#x200B;\n\n6. **Do not mention username, even without u/  in the title of the post.**\n\n&#x200B;\n\n7. This is a **META** subreddit. **DO NOT POST NON-META content here unless if it is personal advice/help required.**\n\n&#x200B;\n\n# Meta = posts about other subs, twitter etc\n\n&#x200B;\n\nWe have given enough warnings and users continue to post without following these rules. We had even pinned the post relating to the rules. The biggest violation has been rule 1 so far.\n\n&#x200B;\n\n# Therefore, we will now be banning users for 3 days when they violate rules 1 and 4.  Others will result in removal.\n\n&#x200B;\n\n# Repeated violation of rules 1 and 4 will result in an increase in the ban time.\n\n&#x200B;\n\n# And no, we aren't going to excuse violations as we are pinning this post. Which makes it visible to all.",
        "num_comments": 28,
        "comments": [
            "Should censor twitter usernames too? I'll delete my latest post if you can clarify",
            "Could you expand the meaning of meta? Post about other subs or Twitter. So if we post a screenshot of a post or a tweet, won't it be meta? Or does it have any title requirements?",
            "Someone explain me the rules ..I am not really getting it where are the rules for banned word",
            "No need to censor for twitter.",
            "Meta - you can post about other subreddits,twitter, YT, FB, Instagram. You can post about the views of users there.\n\nAll others are non-meta and are not allowed unless if it is personal advice",
            "Can't do anything about that afaik",
            "#DO NOT PARTICIPATE IN THE LINKED THREAD/SCREENSHOT.\n \nBrigading is against Reddit TOS. We do not encourage such behaviour nor we are responsible if your account is being actioned upon.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/indiadiscussion) if you have any questions or concerns.*",
            "Hi, \n\nCan somebody explain what is Meta and Non Meta content? \n\nCan I ask Tech related question here? \n\nThank you",
            "Additionally, do not post non-meta content unless if it is personal advice/help needed.\n\n&#x200B;\n\nAdded in post",
            "#DO NOT PARTICIPATE IN THE LINKED THREAD/SCREENSHOT.\n \nBrigading is against Reddit TOS. We do not encourage such beahaviour nor we are resonsible if your account is being actioned upon.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/indiadiscussion) if you have any questions or concerns.*"
        ]
    },
    "Terrorism has no religion but paper-leakers have caste.": {
        "title": "Terrorism has no religion but paper-leakers have caste.",
        "score": 812,
        "url": "https://i.redd.it/cmodqmjjyg9d1.jpeg",
        "content": "",
        "num_comments": 74,
        "comments": [
            "Then terrorism has a religion too. They have common names. These dallas just won't accept",
            "Discrimination and divide are rampant",
            "Jaha dekho waha caste ghusa dete h yeh log. Inlogo ke saath casteism krne mein mujhe koi problem nhi h",
            "Islamists do not understand the word cohabitation. They only understand kill , conquer and rule . If physical violence is not possible, they move on to inflammatory statements antagonising the majority population.\nGoddamn scum , creates problems everywhere they go.",
            "Ye bnda scam me caste dhundh rha",
            "Aise har jagah se paper leak hui hai, lagta hai 90% aspirants ko leaked paper mil gaya tha.",
            "Nair is a Keralite Brahmin name no? Explains everything. Unse zyada cucked aur koi nahi hai.",
            "Why such double standards by our own people.",
            "This will turn all the  main reasons for fighting against the paper leak into the dust bin Now it will be a religious fight 😔",
            "We all know who is the chairman for caste politics"
        ]
    },
    "Freebies are anti-development.": {
        "title": "Freebies are anti-development.",
        "score": 897,
        "url": "https://i.redd.it/9czwibba5g9d1.jpeg",
        "content": "",
        "num_comments": 142,
        "comments": [
            "Muft paani & 200 unit bijli, free bus ride etc etc",
            "To jab Congress ye Khata Khat kr rahi thi, tab kyu chaat rhe the ??",
            "It's ironic that after PM Modi warned about the dangers of the 'revri culture' of offering freebies for votes, the BJP government in Maharashtra is now embracing that very approach to secure votes. Quite the turnaround!",
            "I hate to admit but i completely agree with Dhruv tatti opinion. Freebies are easy way out for any government instead of creating something substantial that can help people earn better livelihood. Freebies are parasite that kills the states fiscal targets and also makes freebies beneficiaries complacent.",
            "Ohh and I thought Congress giving 100k was generosity",
            "yes bro, its verified account... i can see 🤡🤡",
            "Dhurtrathee naam 😂 bhai fake id hai wo",
            "Freebies is for beggers and poor dogs 😂",
            "Karnataka govt has increased almost all taxes under its control to fund their freebie schemes",
            "This is better use of taxpayers money than the rest of the welfare schemes. \"Universal tax refund\" is the cheapest, most cost-effective and impactful welfare scheme. It can replace all the wasteful welfare schemes. We can't have nice things so be happy with whatever crumbs the govt throws at you."
        ]
    },
    "What is the nationality of this guy? He's has been in Germany for long now.": {
        "title": "What is the nationality of this guy? He's has been in Germany for long now.",
        "score": 990,
        "url": "https://i.redd.it/5i7cwl56of9d1.jpeg",
        "content": "",
        "num_comments": 212,
        "comments": [
            "It is just a hypothetical video🤦\n\nBut yeah he is now playing fame games and encashing by making some random topics videos.",
            "Nationality = Indian .... Citizenship ... probably German !!!",
            "I think we should ignore him,he is not worth it",
            "He is Germany citizen 🇩🇪  he not india citizens but dreaming to become india PM ..one Italy lady living in india fail to became PM how can he .",
            "If he was an Indian citizen he would have shown the proof till now after so much speculation over the years to get more credibility.",
            "The german who doesn't like expressways....",
            "He was born in Haryana, India and moved to Germany back in mid 2013, his marriage was held in Belvedere Palace, in Vienna, Austria. There is no information available as to Dhruv getting a German citizenship (which he can and if he did, it will invoke his Indian citizenship as our country doesn’t allow dual citizenship) and there is no solid evidence as to if he’s still an valid Indian citizen . My pure guess, he has a German citizenship , even if he doesn’t, I don’t consider him Indian. Imagine living in a well developed comfortable country like Germany and still leach off YouTube to push bullshit propaganda for money about a country you left 10years ago 🤷🏾",
            "He is still an Indian Citizen from what I can gather",
            "he is just sharing ideas not running in election so it doesn't matter.",
            "He needs to stop seriously"
        ]
    },
    "Achievement unlocked, revealed who the actual mods are without telling": {
        "title": "Achievement unlocked, revealed who the actual mods are without telling",
        "score": 287,
        "url": "https://www.reddit.com/gallery/1dr71w3",
        "content": "",
        "num_comments": 35,
        "comments": [
            "Can we call it **Randiamemes** now😂?",
            "Seriously even I'm banned there.. f*cking randiamemes",
            "It's like mini khalifa in reddit",
            "The same I was wondering when they were adding more politics related topics other than memes so when I pointed out they downvoted me like hell 😄",
            "Bruh that's not even a meme sub.\n\nRetards over there post insta edits and call it a meme.",
            "should i post this on that sub",
            "They have infiltrated everywhere 🤨",
            "Roads,bridges,pani,hawa,greencover have all left the chat.",
            "We need a new sub for memes now \"RW Memes for General Teens\"",
            "Why all major Indian Reddit subs Librands ?"
        ]
    }
}