{
    "r/IndiaSpeaks - April 2024 - Mod applications | We need new mods!": {
        "title": "r/IndiaSpeaks - April 2024 - Mod applications | We need new mods!",
        "score": 26,
        "url": "https://www.reddit.com/r/IndiaSpeaks/comments/1bxvgkh/rindiaspeaks_april_2024_mod_applications_we_need/",
        "content": "Namaste Everyone\n\nWe are now a \\~600k Sub, with such numbers also comes work and responsibilities. So we come back to the community to ask for help!\n\nYes we are looking for users who can volunteer , have enough time, who can bring in new ideas and drive our journey on reddit to new heights!\n\n# Some things to remember:\n\nApply only if you think you would have enough time to help out!\n\n* One of the main requirement is being available at least once day on discord to check the queries/discussion of the Mods\n* Being available everyday for minimum an hour for moderation duties\n* Being active and initiating or helping in organizing Debates/Cult-ex/AMAs or other threads\n* Active user with an account age of minimum 6 months.\n* Users should have a minimum of 25 submissions or 250 comments on our Sub\n\nPlease fill out the Application Form below if you think you would be a perfect fit for us,\n\n# [MOD APPLICATIONS - APR 2024](https://form.jotform.com/240883371796469)\n\nThe last date for filing application closes on 20th May 2023!\n\nThank you so much, and good luck to all!\n\nRegards, The Mod Team",
        "num_comments": 20,
        "comments": [
            "hello, I am new to this server, I am only commenting because I saw a video on youtube which denies Genocide of Hindus by the Mughals. I tried posting the video but am unable to do so because \"removed by reddit's filter\".\n\nHere is the video : [https://www.youtube.com/watch?v=TQutHGvAXDY](https://www.youtube.com/watch?v=TQutHGvAXDY)  \nCan someone else post this video instead and put the attention of the server to this given how distasteful it is? I can't imagine youtube letting a video that defends/denies the fact that Nazis gassed the Jews but they will allow this?",
            "Applied.",
            "Why this post delted, mods? [https://www.reddit.com/r/IndiaSpeaks/comments/1cqayug/what\\_is\\_your\\_opinion\\_on\\_gst\\_tax\\_system\\_in\\_india/](https://www.reddit.com/r/IndiaSpeaks/comments/1cqayug/what_is_your_opinion_on_gst_tax_system_in_india/)",
            "i am interested",
            "* One of the main requirement is being available at least once day on discord to check the queries/discussion of the Mods",
            "[removed]",
            "When can we apply again?",
            "Please apply"
        ]
    },
    "r/IndiaSpeaks - What are you doing this Weekend ?": {
        "title": "r/IndiaSpeaks - What are you doing this Weekend ?",
        "score": 1,
        "url": "https://www.reddit.com/r/IndiaSpeaks/comments/1dlmeai/rindiaspeaks_what_are_you_doing_this_weekend/",
        "content": " Tell us about your plans for the weekend. Any place you are visiting? Or doing things which you don't get time to do on weekdays?\n\n&#x200B;\n\n* Newbies and lurkers who feel shy in participating, you are also welcome :)\n* Feel free to talk anything but politics.\n* You can also join our [Discord server Invite](https://discord.gg/V8sCPac)\n* The \"Weekend\" thread is posted every Saturday. [Previous Thread](https://www.reddit.com/r/IndiaSpeaks/search/?q=What%20are%20you%20doing%20this%20Weekend%20&restrict_sr=1&sort=new)",
        "num_comments": 0,
        "comments": []
    },
    "BJP leader Ramesh Bidhuri leads a protest outside Delhi Jal Board office in Delhi, over water crisis in the National Capital. Delhi Police use water cannon to disperse the protesters": {
        "title": "BJP leader Ramesh Bidhuri leads a protest outside Delhi Jal Board office in Delhi, over water crisis in the National Capital. Delhi Police use water cannon to disperse the protesters",
        "score": 1338,
        "url": "https://v.redd.it/y7xfjydxu28d1",
        "content": "",
        "num_comments": 133,
        "comments": [
            "They are using Water Canon against protest on Water Crisis 💀",
            "Win-win for. Both sides..get your buckets",
            "bjp waale kitne acche hai, logon ke liye free shower ki suvidha kar di.",
            "delhi walo ki nautanki agag hi level ki hoti hai.\n\nEk taraf govt hi anshan par baith gayi hai, dusri taraf water crisis ke protesters pe pani daal rahe hain.",
            "Irony ho rahi baadi bhayankar",
            "ek min....delhi police to bjp ke under nhi hai kya? To ye water cannon ka order aap ne diya ya bjo ne",
            "Delhi police toh central k under aati hain na? Yeh log khud se hi lad rhe😂",
            "hypocrisy 100 bar revive ho kar maar gayi lamao",
            "Carry buckets - jokes on police. Thanks for free water!",
            "Delhi Police comes under the Central government."
        ]
    },
    "Thief shows how he steals Royal Enfield motorcycles in less than 60 seconds": {
        "title": "Thief shows how he steals Royal Enfield motorcycles in less than 60 seconds",
        "score": 996,
        "url": "https://v.redd.it/lqugsm01038d1",
        "content": "",
        "num_comments": 63,
        "comments": [
            "Namaskaram /u/sixty9e, Thank you for your submission. Please provide a source for the image / video (if not a direct link submission). We would really appreciate it if you could mention the source as a reply to this comment! If you have already provided the source or if it is an OC post, please ignore this message.  Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndiaSpeaks) if you have any questions or concerns.*",
            "Police looks impressed lol",
            "Beta mehmano ko apna talent dikhao..😅😅",
            "60? The entire clip is for 30 secs. He did it in 25 secs...",
            "I'll be right back, Imma go find a parked royal Enfield",
            "Showoff ![gif](emote|free_emotes_pack|trollface)",
            "New skill unlocked",
            "They wanted to clap but somehow refrained lol.",
            "Bro this video is like 2-3 years old",
            "Damn, is there any catch here? It can't be that easy right? Or is there a serious issue with Royal Enfield's antitheft mechanism? Can't believe such a big company sleeping on this."
        ]
    },
    "'The Steel of India': Jindal steel's film wins Cannes Lion awards for direction and craft creativity": {
        "title": "'The Steel of India': Jindal steel's film wins Cannes Lion awards for direction and craft creativity",
        "score": 698,
        "url": "https://v.redd.it/r32ys6ft538d1",
        "content": "",
        "num_comments": 40,
        "comments": [
            "Namaskaram /u/cometweeb, Thank you for your submission. Please provide a source for the image / video (if not a direct link submission). We would really appreciate it if you could mention the source as a reply to this comment! If you have already provided the source or if it is an OC post, please ignore this message.  Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndiaSpeaks) if you have any questions or concerns.*",
            "That ad was dope ngl",
            "It Deserved .",
            "The only ad during ipl which did not shit even after played like a billion times like others",
            "Bro cooked well",
            "Also, music for this video is composed by Sneha Khanwalkar (music director of Gangs of wasseypur). \n\n\nI found it interesting because Sneha does have a unique talent of creating music from literally anywhere and anything. If you have watched her MTV show, you would know. ",
            "Loved the film when it came out",
            "Wah jindal jee wah",
            "It's so good, i didn't even blink while watching it, every frame is lit. Kudos to Jindal steel",
            "The steel industry making waves in cinema."
        ]
    }
}