{
    "Monthly random discussion & queries thread on bikes...": {
        "title": "Monthly random discussion & queries thread on bikes...",
        "score": 3,
        "url": "https://www.reddit.com/r/indianbikes/comments/1d5bofm/monthly_random_discussion_queries_thread_on_bikes/",
        "content": "This thread is for random discussion about bikes in India and the rest of the world,  and also for all the queries. No abuses, just the friendly banter.. \n\n[\\[Past RDT posts\\]](https://www.reddit.com/r/indianbikes/search/?q=random+discussion+thread&restrict_sr=on&sort=new) \\- [\\[Discord server\\]](https://discord.com/invite/Q9nSrDn6tE)\n\nHelp out fellow redditors if they ask any queries here. Keep a watch on comment count of this post! \n\n[\\[Sub description post\\]](https://www.reddit.com/r/indianbikes/comments/1awderf/welcome_to_indianbikes_description_in_comments/) \\- [\\[Cars India sub\\]](https://www.reddit.com/r/CarsIndia/)\n\nWhich new bike to buy queries should mention ex-showroom or on-road budget, highway or city usage percentages, city of use etc for better response.Make sure to follow both reddit website rules and this subreddit rules while posting and commenting in this subreddit.",
        "num_comments": 30,
        "comments": [
            "We need to think of ideas t make this thread more useful. When someone doesn't get an answer here they learn not to post in this thread instead make a new post. Not sure what the harm in that is but probably is something there which is why mods create these threads for discussions.\n\nGetting more people to check and reply would probably be super helpful in making this thread a lot more relevant and useful for people.\n\nFrom today onwards I will check this thread first and answer if I have the knowledge.",
            "Hello all,\n\nI am not a biker,more of sedated driver ,mostly using Activa for citi driving and seldom goes for highway ride even then speed is below 80-90kmph\n\nHowever,due to recent small accidents and due to some of idiot drivers, would like to purchase a safe allrounder helmet for city usage and occassional outside rides.god forbid,if no accident happens- I am buying helmet for atleast 5-6 years usage.\n\nMy major criteria in helmet are\n1. Safety - top most priority\n2. Reliability of company and availability of spare parts/visor\n3. Comfort and even distribution of weight.\n\nMy short listed helmets are:\n\n1. Mt thunder 3 pro\nGood safety -ece 22.05.p and sharp 4 tested\nGood allrounder and price is within my budget\n\nIssues :\nNeed to purchase pinlock for antifog,then price goes around 9k\nSeems there is issue with availability of visor and pinlock,nearby seller saying,they are not available as of now.\n\n2. Ls2 ff800 storm2\nGood safety - latest ece 22.06 rated but not sharp rated :(\nPinlock and sunvisor included\n\nIssues:\nPrice is on higher side\nNot much reviews availability about long term usage of ls2 helmets.\n\nIn these two,I am thinking of ls2 , though price on higher side,I could get around for 10000, for price addition of 1.2-1.5 over thunder 3 pro,it seems vfm choice with latest ece rating.\n\nPlease share your views,if you are using any of above helmets. Would love to hear any other safe helmet suggestion below 10k budget. Will check them in offline shop along with above helmets.\n\nThanks a lot for your time.",
            "This is a recurring scheduled post of the subreddit, start a discussion or a query by commenting in this post. Thank you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/indianbikes) if you have any questions or concerns.*",
            "Hi. Planning to buy my first bike. I've only ridden bikes like passion, glamour and splendor plus till now. I'm 183cm and 65kg. Thinking of RE hunter 350. Also I'm not an experienced rider. Is hunter 350 good? Budget is roughly 2L. Any suggestions?",
            "Is it necessary to shift down during engine braking?\nIs the engine braking and rev-matching the same thing? \nAs far as I understand, engine braking means turning the throttle in the opposite direction while braking & has nothing to do with rev-matching. Please correct me if I'm wrong.",
            "TLDR: Bike stolen, was hoping to get some help on how to proceed.\n\nHey all, just had the experience of having my bike stolen, posting here, hoping to get any help if possible. Looking at other related posts, I don't really have much hope of getting it back.\n\nHad used my bike last on Wednesday night (05/06/2024), after which it was parked in the garage of the standalone apartment building I stay at. Had not gone outside the next day and by night, needed to get some food and noticed that the bike is missing. Apparently the security guard has no clue and the police just asked me to come in the morning. There are CCTV cameras installed, but the owner being abroad, he can only provide them tomorrow.  \nI will be going to them tomorrow and will get an FIR filed. I do have insurance which covers theft, but had made a claim a couple months back, which was settled based on an inspection of the damage (before the actual repairs) and hadn't gotten around to fixing my bike.\n\nBike details:\n\nGixxer SF 2017, Blue, KA 63 E 6223, probably around 4L of petrol in it.\n\nI was hoping to know what further steps I can do.\n\n1. The insurance provider is Acko. Will contact them after the conversation with the police tomorrow. But would they go ahead with the complaint considering that I do not have the repair evidence for the earlier damages of my bike?\n2. If the insurance company does accept the claim, I've read that they will not proceed unless the police give a report that it cannot be found. Is that true? Does it take a few months for that to happen?\n3. If any one else here have had a similar experience: What are the chances of getting my bike back? In one piece?",
            "[deleted]",
            "Hero 125r Or n160\n\nI'm 19 and this will be my first bike and i want to know which bike would be better for me, so please help me decide. \n\nThings I like about 125R :\nMilage\nLooks\nPrice\n\nThings I like about n160 :\nPerformance\nLooks\n\n\nI know they they are not in the same price segment but i can afford either of them just want to know if It'll be worth it to spend the extra on the N160. \n\nRight now I usually ride my uncles suzuki gixxer 155, cruising at 60-70 kmph.",
            "**Question regarding bike selling.**\n\nI have a Pulsar 200 NS which I want to sell. I had bought it via a loan from Bajaj Finance.\n\nAll I have in terms of paper work is a paper which has this written on the corner:\n\n>NEW REG\n\n>Subject to HPA/HYP/Lease Agreement with:\n\n>Bajaj Finance Ltd.\n\n><address of the bajaj branch>\n\n>\n\n>(Under Reg. Owner's name, my own name is written)\n\n\n\n**My question:**\n\nDo I need to get an NOC from Bajaj Finance to sell my bike? The loan has been paid for long long ago.\n\nWill the RTO require me to produce some sort of a No Objection Certificate from Bajaj Finance to sell my bike?\n\n  \nThis bike is located in Mumbai and will be sold to a person in Mumbai. It is a 2012 model, if that matters.",
            "Hey everyone,\n\nI'm in the market for a new bike and could really use some advice. Here's my situation:\n\nI’ve got a budget of a maximum of ₹1.6 lakh. I'll be riding it to the office every day. I live in Hyderabad, so the roads are pretty busy and the whole ride goes through frequent use of brakes. I also plan to take it out for around 100 km rides on weekends. Comfort is key, so I need a relaxing, upright seating position to avoid back pain. I also want something that looks a little sporty, and I'm open to both naked and faired bikes. And yes, I’m looking to buy new, not used. I've been checking out a few models, but it's a bit overwhelming. Any suggestions or personal experiences with bikes that fit these criteria would be awesome!\n\nThanks a ton!"
        ]
    },
    "City-wise chat on Discord server for Indian Bikes and Cars India subreddits..": {
        "title": "City-wise chat on Discord server for Indian Bikes and Cars India subreddits..",
        "score": 4,
        "url": "https://discord.com/invite/Q9nSrDn6tE",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Discord has option to give reactions to every message, unlike reddit..\n\nhttps://discord.com/invite/Q9nSrDn6tE\n\nDiscord server needs mandatory linking of your reddit account before sending gif messages."
        ]
    },
    "when the bikes are competitors in the same segment but the owners are best friends ": {
        "title": "when the bikes are competitors in the same segment but the owners are best friends ",
        "score": 98,
        "url": "https://i.redd.it/q0vb73gfcg9d1.jpeg",
        "content": "life is better with a bike ",
        "num_comments": 27,
        "comments": [
            "How's the bar end mirrors visibility in Ronin",
            "Muttukaadu ?",
            "Pretty sweet ride you guys, I personally lean towards Ronin because of pretty bassy exhaust for a 220cc and the front look is well a looker if you know what I mean.",
            "Ye toh apni story hogyi \nu/KaliyaaBabu",
            "Enga area",
            "TVs is definitely the winner here",
            "Hello rohithrage24! If this post is your original content then mark or comment as [OC]. Else please give the source link as a comment in the post. Thank you.\n\nAll users are requested to downvote the low quality posts. Memes, pics, accident videos, buy/sell, motor bike recommendations, etc can be posted on the [discord chat server.](https://discord.com/invite/Q9nSrDn6tE)  Any repair queries should go to /r/MechanicAdviceIndia. Cars related posts should go to /r/CarsIndia subreddit. Also please report the content you see breaking the rules so that we can act on it. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/indianbikes) if you have any questions or concerns.*",
            "RONIN looks muh premium in first hand than in pictures. People dont like it, for me its looking as good as triumph 400.",
            "TamilNadu se aya mera dost usko vanakkam bolo.\n\nDin me idliy khao, raat me sambar piyo",
            "ngl the ones i got are pretty lame, i got them cus they were cheap asf and theres the possibility of switching to stock mirrors whenever i want; saving up to get better ones later on"
        ]
    },
    "Thoughts on this bike.": {
        "title": "Thoughts on this bike.",
        "score": 135,
        "url": "https://i.redd.it/ppefdietuf9d1.jpeg",
        "content": "",
        "num_comments": 43,
        "comments": [
            "Good bike but slightly expensive compared to it’s siblings",
            "Low ground clearance. Isn’t designed for Indian roads",
            "Super cool with retro looks and morden performance",
            "One of the best looking bikes imo",
            "Ground clearance 👎 1**25 mm**",
            "Too expensive",
            "Image credit - overdrive",
            "Hello systemm201! If this post is your original content then mark or comment as [OC]. Else please give the source link as a comment in the post. Thank you.\n\nAll users are requested to downvote the low quality posts. Memes, pics, accident videos, buy/sell, motor bike recommendations, etc can be posted on the [discord chat server.](https://discord.com/invite/Q9nSrDn6tE)  Any repair queries should go to /r/MechanicAdviceIndia. Cars related posts should go to /r/CarsIndia subreddit. Also please report the content you see breaking the rules so that we can act on it. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/indianbikes) if you have any questions or concerns.*",
            "I wanted to buy this but the small fuel tank capacity put me off as a replacement for my first gen duke 390. \n\nBeautiful, good engine and approachable. No idea why it's got such a small tank.",
            "Looks wise this is really sexy"
        ]
    },
    "Bought my first bike at the age of 19. It's been a dream of me owning a riding a bike of my own and I finally achieved it.": {
        "title": "Bought my first bike at the age of 19. It's been a dream of me owning a riding a bike of my own and I finally achieved it.",
        "score": 64,
        "url": "https://i.redd.it/7xsph86u8g9d1.jpeg",
        "content": " Before someone spam the comments with \"daddy's money\" let me clear things out. Iam 19 and paid 1.5 lakhs of my own nd my father paid the rest.\n",
        "num_comments": 17,
        "comments": [
            "Congratulations dude, but can I ask how did you managed 1.5 lakh at 19",
            "Dude that's so cool!! You must be so proud of yourself :) Congrats buddy and have some memorable rides with this bike ❤️",
            "Congrats man, that’s a great achievement!\nHope your hard work makes all your dreams come true!",
            "Hello itsonlyjoeyyt! If this post is your original content then mark or comment as [OC]. Else please give the source link as a comment in the post. Thank you.\n\nAll users are requested to downvote the low quality posts. Memes, pics, accident videos, buy/sell, motor bike recommendations, etc can be posted on the [discord chat server.](https://discord.com/invite/Q9nSrDn6tE)  Any repair queries should go to /r/MechanicAdviceIndia. Cars related posts should go to /r/CarsIndia subreddit. Also please report the content you see breaking the rules so that we can act on it. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/indianbikes) if you have any questions or concerns.*",
            "now that's something good..saving for over an year, you must love her dearly!",
            "The red and black combo looks so gooood.",
            "Core memory stuff!",
            "Now work for another few months to pay back your dad’s part. Then it’s all yours. Hehe \n\nCongratulations on the bike man !!",
            "Bro does ur father's shop has vacancies? So that I'll also join 😜 (congrats for the bike op.. have fun riding 😁)",
            "Worked at my father's shop for one year. Got paid 10k per month and saved it all and rest was savings from the past"
        ]
    }
}