{
    "Three infographics that help show what is and what is not an infographic": {
        "title": "Three infographics that help show what is and what is not an infographic",
        "score": 103,
        "url": "https://imgur.com/gallery/y40KCDH",
        "content": "",
        "num_comments": 16,
        "comments": [
            "Can you make an infographic so I can better understand it?",
            "Really valuable information. It will help us thanks for sharing.",
            "Thank you very much, this information I needed",
            "I also hate when the infographic is low quality. Such low quality I can't even read it.\n\nLike, two things:\n\n* You obviously didn't create it, you stole it.\n* What's the point of posting it?",
            "I am just doing my first infographic using drawings.google.com, and for some reason whenever I export as jpg or png it never becomes in focus like it does when it is on the web or as a .pdf\n\nThe drawing looks great when viewing 100% in my browser, but once exported into one of those two image formats it's like a complete layer of subtle blur has applied to the entire document (both image + text)\n\nAny idea what I am doing wrong or anything to check?",
            "Thanks",
            "Hmm, understood!",
            "Thanks for the info",
            "I don’t follow"
        ]
    },
    "GDP Per Capita Projections for G7 Nations": {
        "title": "GDP Per Capita Projections for G7 Nations",
        "score": 256,
        "url": "https://i.redd.it/vcfqme1zvc9d1.jpeg",
        "content": "[Source](https://posts.voronoiapp.com/economy/GDP-Per-Capita-Projections-for-G7-Nations-1562)",
        "num_comments": 199,
        "comments": [
            "Reasoning for the forecast : trust me bro.",
            "I mean there was always a gap. It’s not like America caught up and then passed the others",
            "All this chart is telling me is that in the US, income inequality is going to get worse and worker exploitation is going to get worse and probably nothing will improve in the housing market or healthcare",
            "America’s economic strength and overall wealth is just insane. It accounts for 1/4 of world output. Mints the global reserve currency. Dominates all technology sectors destined for future economic growth, as well as scientific research, and corporate R&D (with only China as a credible competitor). Basically all developed, wealthy countries are garrisoned protectorates of the U.S. military and in any case enthralled to American culture and soft power.\n\nThis has all the hallmarks of a *1000 year Reich*. I wouldn’t be surprised if a thousand years from now terms like CENTCOM might be used as geographical descriptors without anyone remembering their origins as imperial military districts, like happened with “Africa” and the Roman Empire.",
            "The title should have been \"America robs the world by printing money and exporting inflation\"... 🤣🤣🤣",
            "UK is up thanks to the new londongrad residents taking up shop while some 'drama' happens near the EU",
            "Do you see that decline in Japan, this was the yen depreciating, however the Japanese economy has been the second best on a per capita basis of all the above\n\nWhy doesn't it look like it? Because nominal gdp fluctuates significantly due to currency exchanges",
            "This is GDP at current prices, this is heavily influenced by exchange rates and different inflations across borders. USD was very strong through the high inflation period as global money flower to US bonds when interest rates started rising along with geopolitical risk. Japanese Yen for example lost a third of its value vs the USD between 2021 and 2024 which is the biggest reason there's a huge drop recorded. But if one adjusts for local living costs (which aren't gonna jump up and down hugely every time exchange rates change) and calculate based on a constant USD from a certain year, Japan's GDP grew relatively strongly from 2021 to 2025.",
            "That is a massive gap even today. However a better measure would be average income.",
            "Too bad its all taxes for wartoys and rich people. No housing or healthcare and people thing Trump is the answer 😪"
        ]
    },
    "The World’s Least Affordable Housing Markets in 2024": {
        "title": "The World’s Least Affordable Housing Markets in 2024",
        "score": 1441,
        "url": "https://i.redd.it/qg25g1w2w99d1.jpeg",
        "content": "",
        "num_comments": 237,
        "comments": [
            "Australia : where even the house prices are trying to kill you.",
            "\"Anything over 9.0 is rated as 'Impossibly Unaffordable'\"\n\nAuckland: Why am I in the picture? I'm only 8.2!",
            "Housing crisis in Canada and Australia, where there is only roughy 4 people per square km",
            "London is 14.29.\n\nVery crap infographic",
            "What about the most afordable places?",
            "A lot of nouveau rich from asia took their money to these places, post 2008. Expensive property became exceedingly more expensive over a 15 year period. Europe is also looking unaffordable because it's bought up by the same people. Hong Kong was the first place money was parked because it was easiest to shift it there. The big western banks and financial institutions in Hong Kong help move the money overseas to aforementioned places - hence the title of \"money laundering capital\" of the East.",
            "This infographic only looks at 8 countries, and while I think the way it presents itself is slightly misleading, nowhere does it claim to be showing the \"least affordable in the world\" like OPs title does. \n\nOP, I think you should probably delete and repost this with corrected title.",
            "Mumbai is definitely missing from this list.",
            "So pretty much all the largest cities on the California coast.\n\nOn another note, when my brother once tried to sell his house in SoCal, had a native Hawaiian family come and look at it. They’re getting priced out their own land. It’s fucked.",
            "Crazy how most of these could be fixed by punting nimbys, fixing zoning laws, and putting caps on foreign investment. Even crazier NYC and Singapore are suspiciously absent."
        ]
    },
    "SpaceX Valuation Hits $210B": {
        "title": "SpaceX Valuation Hits $210B",
        "score": 203,
        "url": "https://i.redd.it/uslftw8tub9d1.jpeg",
        "content": "",
        "num_comments": 35,
        "comments": [
            "Crazy that we are comparing a space company to Chipotle and Disney. Why not compare it to... similar businesses?",
            "But their burrito bowls are shit",
            "The power of government grants !",
            "How much of SpaceX is owned by Elon?",
            "The comparison and groupings seem a bit arbitrary.",
            "Something tells.me that this valuation is blown out of reason in the same way how Tesla is. The difference is that Tesla shares are kept high priced by idiots who keep believing in Elons lies. SpaceX is relying on US donations otherwise they would stop existing. This company is not profitable and their value is hugely dependent on the success of the rocket which keep exploding.",
            "Oh yes space x is bigger then lulu  lol",
            "Palantir prob has the best AI software in the market",
            "Hahaha, exactly. This comparison makes SpaceX look rather ridiculous.",
            "This.\nIf there are some more insider stock sales being done to some sketchy rich guy at $240 tomorrow, the \"valuation\" of SpaceX will double.\nThese calculations are pretty useless."
        ]
    },
    "Foreign holders of US debt ": {
        "title": "Foreign holders of US debt ",
        "score": 2,
        "url": "https://i.redd.it/5cxztlok9j9d1.jpeg",
        "content": "[Source](https://www.visualcapitalist.com/which-countries-hold-the-most-us-debt/)",
        "num_comments": 0,
        "comments": []
    }
}