{
    "I guess we have to codify this: this is a pro-choice subreddit and we will not accept submissions which undermine the right to abortion.": {
        "title": "I guess we have to codify this: this is a pro-choice subreddit and we will not accept submissions which undermine the right to abortion.",
        "score": 18385,
        "url": "https://www.reddit.com/r/insanepeoplefacebook/comments/vy9810/i_guess_we_have_to_codify_this_this_is_a/",
        "content": "This is an expansion on our *No insanity in the comment section* rule.\n\nIf you choose to break this rule you will be banned.",
        "num_comments": 356,
        "comments": [
            "    user reports:\n    1: No insanity in the comment section\n    1: self harm\n\n\n\nPlease note that reports like this break TOS and are reported to the admins with one click.\n\n\nBut wait! There's more:\n\n    1: No hatespeech or personal attacks\n    1: This is spam\n    1: self harm\n\n\nEdit: ~~I'm off to bed so we're locking this up for the night.~~\n\nUnlocked.",
            "Glad the mods pinned this.",
            "Lmao i forget sometimes people think **we’re** the crazy ones for demanding the right to our own bodies.",
            "Good mods",
            "Not that anyone asked for my opinion, but here it is: I'm religious (Catholic). I think abortion is horrific. And I am staunchly pro-choice, because denying women the moral agency to make their own choices is MORE horrific. Declaring dominion over women's bodies is MORE horrific. Thinking you're entitled to impose \"consequences\" on women for having sex is MORE horiffic. Putting people in prison for having/performing/aiding and abetting abortions is MORE horiffic. Forcing girls and women to carry pregnancies conceived through rape is MORE horiffic. Denying women life-saving abortions and miscarriage care is MORE horiffic. Imposing your religious beliefs on other people, to whom God gave free will to follow Him or not, is MORE horiffic. \n\nIf your vision of an \"ideal\" society requires any of the above, don't you DARE position yourself as a moral authority. And don't you DARE claim to have God or humanity at heart. Other people matter besides \"the unborn.\"",
            "But…but…muh FREEDUMBS!!",
            "Now, ironically, the insane people will get mad at this.",
            "Yeah! Ban hammer!\n\nMy work just emailed from the CEO today saying they would pay for people to leave the state to access reproductive health services. I thought this was awesome.",
            "On the user reports, keep sharing this data! This is the kind of stuff users need to see in order to make this a better place.",
            "At least *someone* has our backs."
        ]
    },
    "We will not be allowing anymore AI generated images.": {
        "title": "We will not be allowing anymore AI generated images.",
        "score": 832,
        "url": "https://www.reddit.com/r/insanepeoplefacebook/comments/1dc5n4d/we_will_not_be_allowing_anymore_ai_generated/",
        "content": "Yeah they're stupid. Yeah old people and idiots fall for them.  But if you've seen one you've seen them all.",
        "num_comments": 44,
        "comments": [
            "Register and vote:https://www.usa.gov/register-to-vote\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/insanepeoplefacebook) if you have any questions or concerns.*",
            "This is why pictures like that never trend.\n\nHave you considered what this does to the beautiful cabin crew? HAVE YOU?",
            "Thanks!",
            "Thank you for this!  If I had to see more African kid with a soda art installment, I'm going to pull my hair out.",
            "I'm glad this subreddit is putting an end to that nonsense.",
            "Thank god. That weird Cow with Jesus made my hair stood up and gave me bad vibes",
            "Dear GOD thank you.",
            "I don't know, I thought my comment on the Asian lady with the \"baby bouquet motorbike basket\" one was pretty funny. \n\nAre we certain we aren't missing opportunities to prove with absolute certainty that I am indeed as foolish and unfunny as I suspect I may be (deep down in the cock(les)?",
            "Come to r/messAIh if you have any AI jesus pictures you wanna share still!",
            "Thank you!"
        ]
    },
    "Help! Help! I’m, “devastated” my adult daughter can think for herself! ": {
        "title": "Help! Help! I’m, “devastated” my adult daughter can think for herself! ",
        "score": 3102,
        "url": "https://www.reddit.com/gallery/1dldj46",
        "content": "",
        "num_comments": 198,
        "comments": [
            "Register and vote:https://www.usa.gov/register-to-vote\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/insanepeoplefacebook) if you have any questions or concerns.*",
            "I would bet that among the many good reasons this woman chose to end her pregnancy was the horror-show of a grannie this lady would surely be. She’d 100% stomp all over her daughter’s parenting boundaries and quote God as an excuse for her behavior the whole time. ",
            "You can still have an abortion even if your overbearing, fruitcake of a mother disagrees. Aid Access provides abortion pills through the mail in all 50 States. \n\nhttps://aidaccess.org/",
            "what a fucking bitch, I hope her daughters park her in a retirement home and never visit.",
            "Hilarious how she wants to control her daughter with religion, while at the same time talking back to her husband and opposing abortion, both things incompatible with the holy book she claims to adhere to.",
            "Good dad",
            "I found the original post and my god the comments are worse than the post. Insanely horrible advice being given to this woman",
            "Sometimes despite all of our best efforts to raise them with our values, children turn out to be decent human beings instead.",
            "Newsflash to mom: You lost your daughters ages ago, you’re just figuring it out now.",
            "I’m gonna say it, your kids don’t need to have any children, you should respect their decision instead of bitching and whining about it on Reddit."
        ]
    },
    "Taking a photo mocking her dead ex is pretty up there": {
        "title": "Taking a photo mocking her dead ex is pretty up there",
        "score": 1429,
        "url": "https://i.redd.it/rmoc5nwk7z7d1.jpeg",
        "content": "",
        "num_comments": 184,
        "comments": [
            "Register and vote:https://www.usa.gov/register-to-vote\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/insanepeoplefacebook) if you have any questions or concerns.*",
            "\"I would live tweet a funeral, take selfies with the deceased\"",
            "Looks like he dodged a bullet. Or didn’t.",
            "So she’s single then…?",
            "Depends. When I found out my sister’s abusive ex died, I couldn’t stop laughing.",
            "Is there anything that indicates the post was made by the person in the photo?",
            "Damn they couldn’t even give my man a belt.",
            "She looks stoned af 😳",
            "I’m not saying this is fake, but I’m saying I’ve never seen a funeral where the deceased was as dressed in such casual clothes and posed so lazily. What’s up with that?\n\n\n\n\nAlso is it hot or cold out. She’s wearing a fleece and sandals.",
            "I mean I wouldn’t take or post it but there would be thoughts. He abused me."
        ]
    },
    "Plan F": {
        "title": "Plan F",
        "score": 64,
        "url": "https://i.redd.it/mqjetvyf948d1.png",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Register and vote:https://www.usa.gov/register-to-vote\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/insanepeoplefacebook) if you have any questions or concerns.*",
            "We all know one of those people.\n\nThey are the people who were semi-normal until they had to wear a mask for 30 minutes while getting groceries at Walmart four years ago and carries the \"trauma\" of that event around like they spent 3 years in a Russia prison.  \n\nNow they latch onto every conspiracy theory that comes across their feed and inbox like they are infected with RFK, Jr brain worms.",
            "If you’re a selfish, entitled, spoiled brat with a massive persecution complex over the age of 40 but with the emotional intelligence of a 9 year old do we have a political party for you! The only drawback is the party is riddled with “kiddie fiddlers” but all you have to do is pretend they aren’t there!",
            "\"im happy to live and let live\". \n\nHas never let anyone who disagrees with them live and peace and actively participates in behavior that harms other people because they decided the science they don't understand must be fake.",
            "You already take orders from kiddie diddlers — thought that was well established by now.",
            "Yeah you will. You will sit there, pay your taxes, do what you are told and do nothing but post angry memes on Facebook.",
            "Plan 'Failed out of high school'.",
            ">I am happy to live and let live until you push me too far\n\nGiven that people you hate existing and being asked to not kill people counts in your head as \"pushing you too far,\" I'm gonna go ahead and say that's a fucking lie.",
            "\"I am happy to live and let live until you  push me too far by being different than me.\"",
            "I believe this is the reasons for conspiracies and ignorance. They feel like they need to be in control because they are scared of the situation and don’t understand it. Covid really did a number on these people."
        ]
    }
}