{
    "I guess we have to codify this: this is a pro-choice subreddit and we will not accept submissions which undermine the right to abortion.": {
        "title": "I guess we have to codify this: this is a pro-choice subreddit and we will not accept submissions which undermine the right to abortion.",
        "score": 18381,
        "url": "https://www.reddit.com/r/insanepeoplefacebook/comments/vy9810/i_guess_we_have_to_codify_this_this_is_a/",
        "content": "This is an expansion on our *No insanity in the comment section* rule.\n\nIf you choose to break this rule you will be banned.",
        "num_comments": 356,
        "comments": [
            "Glad the mods pinned this.",
            "Lmao i forget sometimes people think **were** the crazy ones for demanding the right to our own bodies.",
            "Not that anyone asked for my opinion, but here it is: I'm religious (Catholic). I think abortion is horrific. And I am staunchly pro-choice, because denying women the moral agency to make their own choices is MORE horrific. Declaring dominion over women's bodies is MORE horrific. Thinking you're entitled to impose \"consequences\" on women for having sex is MORE horiffic. Putting people in prison for having/performing/aiding and abetting abortions is MORE horiffic. Forcing girls and women to carry pregnancies conceived through rape is MORE horiffic. Denying women life-saving abortions and miscarriage care is MORE horiffic. Imposing your religious beliefs on other people, to whom God gave free will to follow Him or not, is MORE horiffic. \n\nIf your vision of an \"ideal\" society requires any of the above, don't you DARE position yourself as a moral authority. And don't you DARE claim to have God or humanity at heart. Other people matter besides \"the unborn.\"",
            "Now, ironically, the insane people will get mad at this.",
            "Yeah! Ban hammer!\n\nMy work just emailed from the CEO today saying they would pay for people to leave the state to access reproductive health services. I thought this was awesome.",
            "On the user reports, keep sharing this data! This is the kind of stuff users need to see in order to make this a better place.",
            "At least *someone* has our backs.",
            "Thanks mods for this rule, shame it's so controversial and not just common sense",
            "I hope youre appointed to the Supreme Court soon.",
            "If the argument changes to Life begins at erection, then the men can perhaps realize they are just as responsible."
        ]
    },
    "We will not be allowing anymore AI generated images.": {
        "title": "We will not be allowing anymore AI generated images.",
        "score": 851,
        "url": "https://www.reddit.com/r/insanepeoplefacebook/comments/1dc5n4d/we_will_not_be_allowing_anymore_ai_generated/",
        "content": "Yeah they're stupid. Yeah old people and idiots fall for them.  But if you've seen one you've seen them all.",
        "num_comments": 44,
        "comments": [
            "This is why pictures like that never trend.\n\nHave you considered what this does to the beautiful cabin crew? HAVE YOU?",
            "Thank you for this!  If I had to see more African kid with a soda art installment, I'm going to pull my hair out.",
            "I'm glad this subreddit is putting an end to that nonsense.",
            "Thank god. That weird Cow with Jesus made my hair stood up and gave me bad vibes",
            "I don't know, I thought my comment on the Asian lady with the \"baby bouquet motorbike basket\" one was pretty funny. \n\nAre we certain we aren't missing opportunities to prove with absolute certainty that I am indeed as foolish and unfunny as I suspect I may be (deep down in the cock(les)?",
            "Come to r/messAIh if you have any AI jesus pictures you wanna share still!",
            ">A woman has twins, and gives them up for adoption. One of them goes to a family in Egypt and is named \"Amal.\" The other goes to a family in Spain; andis named \"Juan.\" Years later, Juan sends a picture of himself to his mother. Upon receiving the picture, she tearfully tells her husband that she wishes she also had a picture of Amal. Her husband responds, \"But they are twins! If you've seen Juan, you've seen Amal.\"",
            "Thank god. They were truly bottom of the barrel at this point.",
            "Thank you. Im so tired of its my birthday blah blah blah with a kid with too many limbs.",
            "Thank you! I appreciated them at first but it quickly became evident that they needed their own, *separate* sub"
        ]
    },
    "Another post on the anti-dog FB group. Idc if you don’t like dogs this is sadistic.": {
        "title": "Another post on the anti-dog FB group. Idc if you don’t like dogs this is sadistic.",
        "score": 778,
        "url": "https://i.redd.it/z5cm0w6tje9d1.jpeg",
        "content": "",
        "num_comments": 116,
        "comments": [
            "It's one thing to not like dogs, everyone has personal preferences.\n\nHowever taking pleasure in the suffering of dogs is a massive step over those personal preferences and straight into serial killer territory.",
            "This person literally types like a batman villain LMFAOOO",
            "Hi, I don't like dogs. We don't vibe. Keep them far away from me, I find them quite stressful.\n\nUnless the only other option is this crazy person, in which case I will absolutely keep an eye on that dog until someone more responsible or enthusiastic about doing so can come help.",
            "Boggles my mind that there's an anti-dog group. I have a genuine phobia of dogs but I don't HATE them, I just avoid them. The guy from the screenshot sounds like a budding serial killer.",
            "Thats just someone itching to tell them how much they want to be a serial killer",
            "I don't understand the internal logic here at all.",
            "Id bet money those humans have harmed dogs. I would like to know more about this group",
            "I don't even want the few creatures I 100% dislike to suffer, let alone an animal like a dog. I don't understand this mindset, and that's probably a good thing that I literally cannot comprehend what kind of monster could ever feel this way. I understand disliking dogs, I understand fearing dogs, but flat out hatred where you revel in their suffering??? Incomprehensible.",
            "Someone should leave this person in a hot car.",
            "Did the spirit of H.P Lovecraft write this?"
        ]
    },
    "Twitter, everybody": {
        "title": "Twitter, everybody",
        "score": 3579,
        "url": "https://www.reddit.com/gallery/1dqk4u6",
        "content": "",
        "num_comments": 244,
        "comments": [
            "I love it when they fight amongst themselves. Bring in Charlie Kirk while you're at it.",
            "Far-right weirdos fighting each other? Must be a day of the week ending in y.",
            "I literally spent the last couple of days blocking random people showing up on my feed. People like this idiot. I literally blocked him too when suddenly one of his racist dumb tweets was shown to me.\n\nI then deleted twitter. Its over.",
            "Ah yes, the very \"Jews run everything\" narrative that contributed to the Nazi Regime",
            "Disappointing that Nick didnt use the clean up your room response but I guess maybe thatd be projecting.",
            "Stop giving these loser attention. They thrive off of it. Let them rot in their rock-dwellings and stew in their own hate.",
            "When Jordan Peterson is calling you a rat, you know things are bad",
            "BAD GUY FIGHT!\n\nI don't particular care about a winner, I just hope it goes the distance.",
            "This is tame for Twitter, Musk took platform with a dog whistling problem and turned it into a full on hate fest. Everyone is openly racist, misogynistic.",
            "Im sorry but when he said I shit on you I definitely lold who is that an insult to? Seems embarrassing to himself"
        ]
    },
    "Man, the topics on my husband's Facebook feed are WILD": {
        "title": "Man, the topics on my husband's Facebook feed are WILD",
        "score": 312,
        "url": "https://i.redd.it/iyvsgehese9d1.jpeg",
        "content": "",
        "num_comments": 61,
        "comments": [
            "ALL of my favourite Christian music artists??? There's so many though!",
            "I had to look at for a good minute before I realised what she was licking.",
            "Is the problem that he's looking at porn or that he wants to be eaten out?",
            "Apparently that answers the question \"what would Jesus do?\"",
            "Eating ass at Hillfest. Just how GOD intended. \n\nRimjobs for Jesus.",
            "To be clear, I LOVE the top post. I was put off by it being very immediately followed by a Christian summer music fest ad. I love all of my husband, and everything he's into I just don't feel the same about Facebook lol",
            "All your favorite Christ are belong to us",
            "I couldve gone my whole life without seeing that",
            "At the age of fourteen, a Zoroastrian named Vilma ritualistically shaved my testicles. There really is nothing like a shorn scrotum, it's breathtaking, I suggest you try it.",
            "Are Christians allowed to eat ass at hill fest? Asking for a friend......"
        ]
    }
}