{
    "hello po": {
        "title": "hello po",
        "score": 34,
        "url": "https://www.reddit.com/r/insanepinoyfacebook/comments/uumjnb/hello_po/",
        "content": "Di po ako magdedelete ng nga comment unless may nilabag na rules.\nMagha-hide naman ako ng mga post  na lumabag sa rules like di naman katangahan yung pinost or di natakpan yung kahit surname.\n\nPag fake news po ang pinost, dapat po sa r/fakenewspinas.\n\nPag di katangahan yung post, dapat po sa r/philippines po.",
        "num_comments": 1,
        "comments": [
            "u might wanna lock this comment section down  if u merely want this to be  a PSA boss modchief. You run the risk of people vandalising this PSA  kung sakali"
        ]
    },
    "New Rule": {
        "title": "New Rule",
        "score": 19,
        "url": "https://www.reddit.com/r/insanepinoyfacebook/comments/1b272j0/new_rule/",
        "content": "NSFW posts that contain uncensored images  would not be allowed here, please repost it to another subreddit.",
        "num_comments": 1,
        "comments": [
            "Currently contacting the moderator of r/pinoycrazyvids.\n\nIf di payagan, gawa na lang po ng bagong sub about dito and ioopen ko na lang sa mga gustong maging mod."
        ]
    },
    "crazy cool dad 🥶 (nandamay pa ng bata eh no)": {
        "title": "crazy cool dad 🥶 (nandamay pa ng bata eh no)",
        "score": 51,
        "url": "https://www.reddit.com/gallery/1dr9ety",
        "content": "",
        "num_comments": 17,
        "comments": [
            "oooor stolen identity ng bata at ginamit na sa tiktok para mabash siya. ooor talagang papansin",
            "Pwede ba kapag magpopost kayo dito ng galing sa ibang socmed. Lagyan niyo naman ng context kasi 'di naman namin maiintindihan post niyo. Hindi namin alam kung sarcasm or katangahan 'yung OOP. Hindi rin kami aware sa trend ng mga kagaguhan sa Tiktok at Epbi.",
            "Sarcasm lang naman yung ganyang trend, diba?? Or am i missing something?",
            "Sooo, both of them might go to prison for this (One for Abuse, the other one is Adultery)",
            "Sino tayo para humusga, diba?",
            "Andaming enabler ng cheating dito oh a😂😂😂",
            "That's not cool that's insane! 22 people liked her response that is crazy! Future Tulfonatics si ate at sure ball si dad.",
            "May bagong pumalit sa \"Pulis ang tatay ko\"",
            "Hindi ba ito sarcasm lang? Tindi naman if re-yal yan",
            "Real or not, do not give them the attention they want. Just forward the info the authorities and move along."
        ]
    },
    "When stupid is exposed and expounded.": {
        "title": "When stupid is exposed and expounded.",
        "score": 19,
        "url": "https://i.redd.it/d7cu8keaki9d1.png",
        "content": "Nag post pala to ng address? 😅 ",
        "num_comments": 5,
        "comments": [
            "Ang kawawa dyan yung mga delivery rider. Pabor pa sa kanya yan magiging vlogger pa yan",
            "Mas ok sana yung hindi na mapurwisyo pa ang mga rider at uba pang negosyo. Baka naman may pagasa na mayor ng san juan na ang magbigay parusa sa kagaya niya",
            "Parang is Otlum yung ngnakaw ng celphone, pinasikat pa",
            "The story of this country. Morons are celebrated.",
            "did someone dox him?"
        ]
    },
    "Buhay ka pa pala?": {
        "title": "Buhay ka pa pala?",
        "score": 152,
        "url": "https://i.redd.it/f7goardspe9d1.png",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Too bad majority sa kanila cannot vote, or even understand that statement lol",
            "lol may nakikita akong casino dealer dati sa IG mukhang sa pogo nagwork dati, nung nag pandemic eh di nawalan ng work. nung election todo campaign kay bbm tapos puro hate post kay Leni. tapos ngayon si BBM may crackdown din sa  POGO haha. nag asawa na lang ng foreigner eh nakikita ko sa IG eh",
            "Paano ba yan, karamihan sa mga POGO employees ay ibang nationalities 😂😂😂😂",
            "I have this one co-worker he was a driver from those POGO shits, gumagamit ng S*abu para lang siya magising sa pagdadrive, yes nakalikom siya madaming pera at nakapundar ng sasakyan at condo guess what yung condo galing din sa POGO. Mahirap katrabaho pag Illegal Mindset ang ginagawa, may something na siya sa utak bigla siyang nagalit samin, nagiinom siya habang nasa work which is bawal, siguro he's back in business nadin sa Bato kaya ganun ugali. I hope mahuli siya sa pinaggagawa niya, sobrang natakot ako nun nung nagalit, like he was punching the wall while walking habang nasa likod niya kami like nag tataunt siya.",
            "Huhusgahan ko siya base sa pic niya. Galawang diskarte si boy",
            "Kasalanan pa pala ni Risa? Wahahahahahha",
            "Ito yung HINAYUPAK na gumawa ng kwento tungkol nakasabay niyang chinese sa elevator.",
            "Madaming POGO workers na walang malay sa kung anong kababalaghan at illegal na activities ang nangyayare sa mga compound. My partner's cousin was once a housekeeper sa Porac POGO na na raid recently, Naghahatid pa kami ng gamit doon during the pandemic. The cousin thought they were cleaning the apartments of foreigners pero di nila alam na they work for a 'syndicate'. Alam lang din naman housekeeper sya sa isang serviced apartment compound. At akala namin kaya mahigpit ay dahil sa COVID protocols. We were soooo wrong. Kaya pala nung nag ttake ako ng videos for my tiktok doon, binawalan ako ng guard haha maganda kasi yung place doon sa loob ng Palazzio kaya I attempted to take videos of the compound. May tinatago pala.",
            "Sa post mo talaga makikita kung sino yung mga ignorant and taong bobo. Ito yung literal na may ma-post lang dahil gusto magpasikat sa social media 🥴",
            "Villain arc na yan 😂"
        ]
    }
}