{
    "Weekly Tech Support Megathread": {
        "title": "Weekly Tech Support Megathread",
        "score": 3,
        "url": "https://www.reddit.com/r/Instagram/comments/1dhvc0v/weekly_tech_support_megathread/",
        "content": "*Please* post all support related issues here. Issues with your feed, account, messages, etc. Everything tech support related outside of this post will be deleted.\n\n&#x200B;\n\n[Link](https://www.reddit.com/r/Instagram/comments/uzp2pk/account_deleteddisabled_megathread/) to the account deleted/disabled megathread.",
        "num_comments": 107,
        "comments": [
            "I want to recover an account.\nMy phone number is not there.\nMy old device, where it was logged in, is not there, and I can't use the device log-in method\nNor code\nNor SmS beacuse I have no number.\nI forgot my password\nI want to die",
            "I can log into my account on chrome but not on the application,when I try to log in on the app it says wrong password and any other form of logging in results in an error message. The Instagram support team never responds",
            "I can't seem to login to instagram web??? It just refreshes\n\nLink to screen recording - [https://jmp.sh/s/FRImT2gyJLJtQfhxfMr8](https://jmp.sh/s/FRImT2gyJLJtQfhxfMr8)\n\nThanks",
            "PLEASE HELP \n\nI made the mistake of following too many people at once because I had no idea that was a restriction on Instagram for this. So my account got suspended twice. Both times I have successfully appealed because I wasn't breaking their rules I was just using the website too much. So I downloaded the app afterwards since I was told it was better to use the app. Then for some reason, I can access my account now, but I can't follow or like anyone's posts. I also checked in my instagram account to see for any restrictions and it said none, but as soon as I try to like or follow it says I'm restricted until the 24th of June. I am running a campaign account so I have to be active on it! Please help!! Do I just wait it out or what do I do? I am so afraid it puts another ban on me right after because that is what happened when I stopped being on instagram for a while and then it just banned me again.",
            "someone requested to follow my instagram, when i click their account it doesnt say accept or deny and when i go to my notifications and hit accept it just refreshes and gives me the option to accept or deny again...anyone know whats going on?",
            "Please help!\nI can't make a Community channel even after having 105k followers and 50 million views",
            "I have one Instagram account connected to a single email (A), And i have another email (B) in my phone. I just don't get it, I've logged to my IG account using email (B) and the same password. Is this normal??? In the account information there's only email (A) which is connected to my IG but i can still use both emails to login what is this??",
            "I went into instagram and inside the app i had a notification for a dm, when I clicked the notification it led me to the message chain but the message itself was deleted by the sender. I was able to read a snippet of the message in the notification window, is there a way for me to see/recover this message/notification?",
            "Hello! I run an instagram for my FT and of course I must not have written down the new password. I've lost track of how many times I have hit the password reset link and nothing is coming to my email. Any help?",
            "I tried creating an instagram account. i added username, phone number and password, followed the step and reached the confirmation phase. i  entered the instagram code immediatly after receiving it and it told me it was outdated, i asqued for annother code and did not receive it, waited 10 minutes and asked again, still not recieved it. i then tried creating a account with my phone and it told me it was already used for an existing account,, and i recieved a text with an istagram code and an username that wasnt mine and after looking up it is an account with 10 picture dozens of followers and over a thousand follows. looking right now my account actually exist as created and i am just confused as to why i received someone else username. do anyone ever had the same problem or an answer ?"
        ]
    },
    "Follow Friday/Follow Chain - Share Your Usernames & Find New People To Follow!": {
        "title": "Follow Friday/Follow Chain - Share Your Usernames & Find New People To Follow!",
        "score": 5,
        "url": "https://www.reddit.com/r/Instagram/comments/1dkuxau/follow_fridayfollow_chain_share_your_usernames/",
        "content": "Basically this is a weekly thread dedicated to expanding your follower base and find new people/content.  Just leave your Instagram username below and if you want accompany it with a little description of what you do.\n\n**This thread is not for F4F. There is no obligation to follow back the people who follow you from this thread.**",
        "num_comments": 55,
        "comments": [
            "Hey everyone,\nWe just started our journey to the beautiful world of photography.\nWe‘re a couple which tries to bring the nature and our beautiful planet closer to the people.\nWe follow the goal to show you that there are many animals and plants that you can discover.\nWe don’t want to earn money, we just want to share our hobby with you.\n\nPlease check us out but remember we just started.\nThank you ❤️\n\nOur Instagram: [https://www.instagram.com/pixelluminary?igsh=cTZydzI5Zm9jendw&utm_source=qr](https://www.instagram.com/pixelluminary?igsh=cTZydzI5Zm9jendw&utm_source=qr)",
            "https://www.instagram.com/ayo_itsmaryjayne?igsh=MTZuZmcwZTE3N2Y0ag%3D%3D&utm_source=qr\n\nMy personal account. I’m an ER nurse living in NE. I try to have as much fun as I can with my time off with my dog. Let me know you are from Reddit and I’ll follow back",
            "www.instagram.com/itsricksung \nFollow me and support me as a content creator!",
            "www.instagram.com/swizznerd\n\n👋🏼I focus on my life in LA through Popculture and just in general more positive, spirited content!✌🏼\n🌆🎮🎬🎧🎡🐶🩵🪩",
            "https://instagram.com/moro_fred\n\nUrban photography mostly around Montreal, New York City and Ireland. Street art, murals, buildings and other things like that",
            "Hi everyone!  I do a lot of nature, landscape and wildlife photography on my Instagram!  It’s also my personal account so I sometimes will put up stories from my daily life.  Don’t mind following back so long as the account is family friendly, just message me on instagram and let me know you’re from Reddit!\n\n[Ejrichvalsky](https://www.instagram.com/ejrichvalsky/)",
            "https://www.instagram.com/ejtemmephotography/\n\nNature and landscape photography!",
            "Hello everyone, I’m just someone who always never had a interest in social media, but wanted to express myself more and find cool people with interesting life goals and activities they are currently doing to influence myself as well. My account is going to be mostly about vlogging my life as I get used to it and would like to have cool peeps to share it with. Just let me know you followed from Reddit and I will add back!\n\nMy instagram: https://www.instagram.com/estbpanda?igsh=MXFjZzdobnZ2MTd5OQ%3D%3D&utm_source=qr",
            "https://www.instagram.com/james._.gry7\n\nJust a personal account that sometimes share experiences.\n\nIf you want, DM me on IG and let me know you’re from here for a follow back. Highly recommend similar content like mine, photography/art/travel and authentic ones.",
            "\nI follow everyone back\n\nhttps://www.instagram.com/tomkuno84"
        ]
    },
    "Whats a terrible song that went viral on instagram reels?": {
        "title": "Whats a terrible song that went viral on instagram reels?",
        "score": 2,
        "url": "https://www.reddit.com/r/Instagram/comments/1dlvbs4/whats_a_terrible_song_that_went_viral_on/",
        "content": "For me its that \"I like the way you kiss me\" song my god fucking hated that shit ",
        "num_comments": 2,
        "comments": [
            "Oh no oh no oh no no no no no. Annoying af. 😂",
            "That too😭😭I had to bring my phones volume all the way down whenever i heard that shit"
        ]
    },
    "Instagram profiles show black images": {
        "title": "Instagram profiles show black images",
        "score": 6,
        "url": "https://www.reddit.com/r/Instagram/comments/1dloy0f/instagram_profiles_show_black_images/",
        "content": "I am having trouble with images loading on Instagram and it makes no sense! Let me explain:\n\nOn my personal account: I can do everything\n\nOn my other account: it’s a professional page (meaning it has the professional dashboard that shows random account statistics)\n\nI am able to scroll through my feed or “for you page” and like posts, share, or comment AND message people\n\nHowever, when I click to my own profile or anybody else’s, the wall of posts are all black! You can click on a post and it shows the little “try again” circle with the arrow type of thing. If I click on a picture it’s black but when I click on a reel, it appears black but opens and plays once I click it whereas the picture stays black. I can also see any accounts reel section and tagged photo section.\n\nAlso, when I log in from my browser on my laptop, there are 0 issues and I can do/see everything.\n\nIt’s been over 24 hours and I’m just wondering if anyone else had dealt with this.\n\nI tried to reset the phone, uninstall Instagram, and all of the basic things but I’m just curious if anyone knows what to do :) Thanks\n",
        "num_comments": 3,
        "comments": [
            "I’m getting exactly this too since the update! Scared to logout as I’ve seen some people can’t log back in 😭",
            "Same for me as well."
        ]
    },
    "Does anyone know if this is a new update? Hold to share isn’t people anymore?": {
        "title": "Does anyone know if this is a new update? Hold to share isn’t people anymore?",
        "score": 4,
        "url": "https://i.redd.it/4877rstb038d1.jpeg",
        "content": "I didn’t do anything it just suddenly became this way when I opened the app?",
        "num_comments": 1,
        "comments": [
            "This is so annoying"
        ]
    }
}