{
    "Tired of shoppers just replacing things and not listening": {
        "title": "Tired of shoppers just replacing things and not listening",
        "score": 135,
        "url": "https://i.redd.it/sm9om3mdehtc1.jpeg",
        "content": "I ordered the peach-pear la croix (yeah, I know. La croix is kinda garbage, but I'm trying to be healthier)\n\nI specifically stated I wanted a refund on the item if it was out of stock. I made sure to select that option and save it.\n\n I backed out of the app and was doing my own thing for a while when a notification came up, stating that my shopper had replaced it. I went into the app as quickly as possible to hit refund AGAIN and within 5 minutes, she had checked out with the wrong item. \n\nShe never made any attempt to chat me or tell me she was replacing it, never asked me what flavor I'd prefer to replace it with (if they had had another flavor that I liked, I honestly would have been ok with a replacement). She just checked out. I'm pissed. \n\nI always tip well, at least 20% if not more depending on the distance of the store...\n\nI contacted support and they told me I have to wait until it's delivered for them to be able to do anything about it.\n\nHonestly I'm over using this stupid app. None of the shoppers seem to care anymore 😔 The good ones all got pushed off the app by the shit pay... I used to get awesome shoppers every time, a few years ago. ",
        "num_comments": 166,
        "comments": [
            "Most of the time I just mark not to replace anything",
            "In some instances it is the speed of the available internet. Both of my ALDIs in Wausau have abysmally slow internet throughout the store either on their IC network or using my cell service. Do shopper may not see the guidances\nBut that is certainly no excuse for not observing you requested refund on that item. IC has this little line that you can SUGGEST an alternative item when the original one is unavailable, but if I saw refund I would only suggest in chat and take a photo of options & let you decide.",
            "I had a fantastic delivery yesterday. Shopper was fast, great communication on replacements. Pre-tipped $20 on a $100 order (15 units including 3 12packs of soda). I had no idea it had started to POUR rain during the delivery. Tipped an extra $10 afterward. \n\nSo many horror stories, figured I’d post one about a good experience.",
            "IMHO, your problem is with Instacart. Their expectations for how quickly a shopper should complete an order are entirely unrealistic. They make it almost impossible for a shopper to provide the level of service they advertise and when something goes wrong they just blame the shopper when it fact, they essentially punish shoppers for getting an order ‘right’ and their training is basically “figure it out as you go”.",
            "They are both green fruits what’s the problem",
            "It's not always the shopper.   I always select refund if out of stock for the items I don't want to replace, but recently several shoppers told me the system asked them to select a replacement.  So sometimes I wonder those other times when some shoppers just picked a random replacement, if it's because the system told them to.  Now I select refund if out of stock, plus putting in comment 'no replacement'.  I use the web to order not the app.   And it's the grocery store's website.  I don't know if the instacart web has the same issue.  But instacart web has the problem of not refreshing the chat message so I often thought there was no response when I chat with a shopper.",
            "Don't forget to tip extra bc it's their birthday /s",
            "I feel you OP and it’s extremely annoying especially when you are the one who tips 20%+ everytime. Or when they refund something that you know is definitely in stock… There has been several times when I have had to have Instacart send somebody else out and they found the item.",
            "Super weird that some shoppers just pick a random replacement.",
            "I now send a message as soon as I’m assigned a shopper and let them know replacements are selected, and to pls let me know if they’re also unavailable. It’s still about 50% that they actually listen, many times I don’t even get a response. But the other 50% the shoppers are great, follow instructions and IC is still much better than using Uber or other apps imo."
        ]
    },
    "Hmmmm": {
        "title": "Hmmmm",
        "score": 1255,
        "url": "https://www.reddit.com/gallery/1bzdilv",
        "content": "",
        "num_comments": 248,
        "comments": [
            "I’ve had items refunded that I never even saw on the customers list. I went in to send them a message and it showed I refunded something.  The app is super glitchy sometimes.",
            "Trust him, he does this for a living.",
            "But did he check the seafood department?",
            "App has been glitchy lately… a few people have said this about auto refunds.",
            "Did you add it to the list after he began shopping or was it on the original list ?",
            "It happens to me when a customer add an items the app randomly refunds it without I even get a chance to see it..\nI get the notification that a customer added an item but it’s not on my list but if I got to the “done” section, I see it there as refunded… very annoying.",
            "I've had shoppers that will wait to put everything in the app until literally when they check out. All of a sudden 5 texts about not being able to find something, then check out. It's so the customer can't ask for a substitution, according to the shopper sub.",
            "Once or twice i've caught myself accidentally refunding items before even seeing them. But that's only if you have. It requested a refund if they are out of stock. The way they have it set up now. Kind of screws us if we accidentally hit a button on the phone when we're not looking.. Other than that I like to find absolutely everything. Because I don't like my tip to go down.",
            "Isn't there a whole country song about this?",
            "Instacart needs to follow Lyft and filter out the men cuz it’s getting crazy. \n\nAlso no shade to anyone looking for a job but the amount of ppl who can’t read level 1 basic English is insane on all delivery platforms"
        ]
    },
    "If you leave a note when you rate your shopper does Instacart see it or just the shopper?": {
        "title": "If you leave a note when you rate your shopper does Instacart see it or just the shopper?",
        "score": 29,
        "url": "https://www.reddit.com/r/instacart/comments/1bzy4he/if_you_leave_a_note_when_you_rate_your_shopper/",
        "content": "So I placed an order today and had an amazing shopper. He got everything I asked for and when he wasn’t sure he asked and took pictures of whatever was out of stock. The only problem was when I got my order. It was in one giant box. It was so heavy I couldn’t even lift it. My husband picked it up and the stuff all fell out on my porch. it wasn’t the end of the world we just picked it up and nothing was broken. I gave him five stars, I decided not to deduct one for packing and leave him a note instead.  I still upped his tip for being so good with communication. Also I requested him to shop for me again. I want the note that says if I ever do get you again can you please use bags instead of one big box because it’s too heavy for me to lift and I’ll pay for the bags. I just don’t want him to get in trouble for packing wrong if Instacart sees it or do they not really care? He did a really good job and I don’t want it to affect him. Thank you.",
        "num_comments": 40,
        "comments": [
            "I have a few customers who put a delivery not saying \"please make sure the bags are not heavy\".\nBut sometimes shoppers don't read the delivery note til after checkout. So ... Text your shopper when they start and let them know .",
            "They don't care",
            "[removed]",
            "If you rated 5 stars the shopper will see the comment.. anything less we don’t.",
            "You are our ever-elusive dream Instacart customer.",
            "To answer your original question, we shoppers don’t know if Instacart sees the note on a review, but we just assume that Instacart can see everything.",
            "Upping the tip says everything. Ty\nIf he is that good, it was an error.",
            "Pretty sure only the shopper sees comments.",
            "You truly seem to be a very sweet person.  ",
            "Where were the groceries coming from? If it’s Costco, they don’t have bags, it’s box or nothing. I’m curious where else boxes at checkout. Most of the time those notes aren’t seen unless the shopper reads batch details. Best practice is if he’s communicating well, you should as well."
        ]
    },
    "Would you deliver in this? I need to know.": {
        "title": "Would you deliver in this? I need to know.",
        "score": 18,
        "url": "https://www.reddit.com/gallery/1bzxhqf",
        "content": "",
        "num_comments": 68,
        "comments": [
            "Deliver what a candy bar?",
            "We call them DUI Scooters or Liquor Kickers where I’m from (Midwest).",
            "Hell no…it’s bloody dangerous enough out here, with all these idiotic drivers, not catching me on that death trap, especially packing groceries!😭",
            "That would be good only for DoorDash/Grubhub-type deliveries in urban areas, or densely-packed suburbs. (Think Brooklyn/Queens or western Long Island).",
            "You get one case of water your cooked",
            "I thought you asked if I would deliver this. Yeah. I’d just put it in my pocket. 😂",
            "I've thought of doing really small orders on my bike and just keep a large backpack to put stuff in. But my bike is very loud, I have a feeling it would bring my reviews down so I probably won't lol.",
            "I've delivered on my ebike multiple times, small orders only of course. I have an oversized milk crate with cooler bag on the back (check my profile for a pic)",
            "How do you not fall over on two wheels?",
            "I personally wouldnt… save a grand or two extra and buy a beater! I’ve seen someone stack 2 40packs between their legs and have a huge rack in the back to hold the rest of the bags. I don’t know how they’re maneuvering safely with all that weight, it’s an accident waiting to happen.."
        ]
    },
    "why do you use instacart": {
        "title": "why do you use instacart",
        "score": 15,
        "url": "https://www.reddit.com/r/instacart/comments/1bzylrk/why_do_you_use_instacart/",
        "content": "i don't know why this subreddit got shown to me, but wtf are you all doing complaining about this so much. unless you have \"fuck you\" money, just go to the store yourself. it is really not that hard people. it does not take that long. complaining that some complete stranger got you the wrong flavor water is so goddamn stupid. this isn't even first world problems at this point it is bot world problems.",
        "num_comments": 69,
        "comments": [
            "I have things delivered to my disabled mother",
            "i don't know why this loser troll decided to comment on this subreddit, but wtf are you doing complaining about this so much. unless you have \"fuck me I am loser loving in my moms basement\" time on your hands, just go to the  GenZ subreedit. it is really not that hard to get a life. it does not take that long. complaining about complete strangers in a Subreddit is low effort trolling, don't be goddamn stupid and at least put in some effort. this isn't even first world problems at this point it is mommy and daddy ignored me as a kid and now I have am sad a lonely problem..",
            "I can't speak for everyone who uses them, but personally, I'm home sick today so I ordered some medicine in addition to the water which was replaced incorrectly. I'm trying to stay indoors to not spread germs. (I ordered contactless delivery as well, so that I wouldn't infect my driver.)  \n\n\nIf you had a problem with my post, you could have just come onto it and asked me about it there 😉",
            "Because I live off the side of the highway like fifteen minutes drive from the store with no sidewalks or busses going out to our location at all and I can't drive.  \nSo I'm kinda just, forced to.   Uber there and back costs more than ordering from instacart and I do not even think uber comes to our location for some insane reason.",
            "1. I've always hated shopping. For anything.\n2. Online ordering and delivery with IC is 15 minutes to order, delivered within 2 hours.\n3. I have mobility issues so this is the better option for me.\n4. IC always delivers to my door, only once was it left in the lobby, I was furious, the IC rep told me the instant I know the driver didn't follow my instructions to call IC because they'll contact the shopper and tell him to bring it upstairs.\n5. I can afford to do it.\n6. I've always hated shopping. For anything.",
            "I use Instacart almost always because I hate going to the grocery store. I have no problem paying people for tasks I don’t want to do, simple as that. I’m always a generous tipper and not a pain in the ass so it’s a win for everyone involved. If you don’t want to use a service then don’t but don’t judge other people who do",
            "Most people are too busy with their own lives that an hour or two at the store, wrangling one or more children, driving through traffic, is just too much for them. Or they do have “fuck you” money and they like to complain. I’ve been on both sides of both good and bad customer service and can say with certainty…people suck.",
            "Go to the therapy.",
            "mods killed the sub!",
            "My Mom uses Instacart because she has had a knee replacement and needs her other knee done as well. \n\n\nInstacart has been a lifesaver for her and she always tips 10% of the subtotal. \n\n\nAnd she is NOT one of those folks who removes tip money if there are issues..  she will complain, but she leaves the tip alone."
        ]
    }
}