{
    "Weekly Tech Support Megathread": {
        "title": "Weekly Tech Support Megathread",
        "score": 6,
        "url": "https://www.reddit.com/r/Instagram/comments/1dnaqq6/weekly_tech_support_megathread/",
        "content": "*Please* post all support related issues here. Issues with your feed, account, messages, etc. Everything tech support related outside of this post will be deleted.\n\n&#x200B;\n\n[Link](https://www.reddit.com/r/Instagram/comments/uzp2pk/account_deleteddisabled_megathread/) to the account deleted/disabled megathread.",
        "num_comments": 105,
        "comments": [
            "does anyone know how to bypass login requests? Im not logged in on any other device and i dont think i have any authenticator app or backup, i logged out of instagram when i was trying to fix a problem on another account and now im stuck trying to fix this problem. Someone let me know. I kinda really need my instagram account so if any1 could help me out that would be much appreciated.",
            "hi, a couple of days ago my account got hacked. is a new account made with a friend for an art project, we retrieved it because we still had access to our email, but in the meanwhile, the hacker had followed around 3k random people, when we retrieved it, it took me 3 days to unfollow all the weird accounts, but after 3 days of having my account back It was blocked and now when I log in it shows me the account is in revision for approx 24hrs for the last 3 days\n\ndoes anyone have any idea if there is something I can do?",
            "i really need help, i have a account on instagram that i made in 2017, i need to delete it! but i forgot the password, as you can imagine... The problem is, i tried many times when i was younger to change it by email, but i forgot the password too lol. when i got the right password the email was blocked (microsoft hotmail) because \"someone guessed the wrong password too many times\" and i don't know what to do, i can't change by email, i tried to get back the email but it is impossible.... i really need help\n\nexcuse my bad english",
            "Hello, I have been experiencing a login problem for 6 hours+. My instagram account keeps saying that my password is incorrect, but no matter how many times I reset it, it still says it is incorrect. However when i click to reset my password and use the password i tried to enter, it says that i cannot change it to my curent password, so i know that my password and username is correct.I really wish it isn't hacked because it is my only method of communication and community, and just for other reasons i can't make another one. Does anyone know what i can do?\n\nP.S for the past few days instagram logs me out because they 'suspect automated behaviour'",
            "Recently (for the past day or so) I've been seeing numbers next to the like, comment and share symbols on posts in my feed. This didn't use to be the case. These numbers were only displayed on reels when I went into that dedicated interface. The app is updated to its latest version, on Android.\n\nIs anyone else getting this? Is there a way of getting rid of this number spam?",
            "Hi, i wanted to learn if i can delete someone off my blockled ist without unblocking them. I blocked someone and i don't want their account to show in my blocked list.",
            "When I search for a user it says following beside their name but when I click on their profile it shows the follow button even though I never unfollowed them. Did they block me? Is this happening to anyone else?",
            "I need some help. I had my account suspended temporarily, got it back, but it's now asking me to change my password due to \"Suspicious Activity\".   \n  \nThis would be fine, except I can't remember my original password. There's a \"Forgotten Your Password\" option, but when I click this, the link takes me back to the same place where I have to enter my old password to change it. Is there any way around this? Seems like I might be locked out if I can't figure out what I used as a password the first time around...",
            "Why are my likes disappearing? I look at the likes list, and my profile doesn't appear in the list. My likes on other people's photos are disappearing frequently. Instagram think I'm a bot? ban? bug? Help ",
            "I need help related to to IG and Meta new policy for Europeans with the new select what ads to view. The message pops up but i cant do anything about it its like the app freezes anyone else encountered this problem?"
        ]
    },
    "Follow Friday/Follow Chain - Share Your Usernames & Find New People To Follow!": {
        "title": "Follow Friday/Follow Chain - Share Your Usernames & Find New People To Follow!",
        "score": 8,
        "url": "https://www.reddit.com/r/Instagram/comments/1dqam4l/follow_fridayfollow_chain_share_your_usernames/",
        "content": "Basically this is a weekly thread dedicated to expanding your follower base and find new people/content.  Just leave your Instagram username below and if you want accompany it with a little description of what you do.\n\n**This thread is not for F4F. There is no obligation to follow back the people who follow you from this thread.**",
        "num_comments": 61,
        "comments": [
            "I'm an aspiring podcast host, recording artist and musician. My Instagram is Mr. Martell Sincere and TeamMartellClout",
            "This is my main Instagram account \n\nthekuromibarbie24 go check it out on ig ",
            "Hi, just a personal account to follow that shows me travelling, attending sport events and other stuff. Username is oscar\\_ayoprice.",
            "www.instagram.com/swizznerd\n\nI focus on my life in LA through Popculture and just in general more positive, spirited content!\n",
            "F4f @tamzarmoch",
            "www.instagram.com/itsricksung",
            "I post photography (film/digital) \n[Instagram.com/trackk44](https://instagram.com/trackk44)",
            "https://instagram.com/lilumijudith?igshid=NzZlODBkYWE4Ng%3D%3D&utm_source=qr\n\nHi everyone! Personal blog/lifestyle account. Let me know youre from Reddit so I can follow back :)",
            "Hey there, check out my photography @ [https://www.instagram.com/momo979/](https://www.instagram.com/momo979/)\n\nIt is mostly wildlife :)",
            "https://www.instagram.com/temptation.ports?igsh=MThyam9neTBxNjhvbw==\n\nI do boudoir and fine art photography"
        ]
    },
    "Are reels down for you guys too?": {
        "title": "Are reels down for you guys too?",
        "score": 109,
        "url": "https://i.redd.it/wzr8cfp9gg9d1.jpeg",
        "content": "",
        "num_comments": 37,
        "comments": [
            "omg yes im so confused, and my whole explore page is different for some reason ",
            "YES I thought I was the only one ",
            "Yup, Down for me too",
            "Yep, and the explore page is messed up for me as well",
            "Yes! Thought i got banned or something",
            "Dude Im high rn and I thought I was just really fucking high im so glad its not just me",
            "Yep. Looks like instagram from back in 2012 when it was just art and photography",
            "Fine by me, I've been laughing non-stop for about 2 hours now lol",
            "My explore page is either default or it wont load",
            "Yup. And my explore page absolutely sucks"
        ]
    },
    "Instagram search section feed Images ": {
        "title": "Instagram search section feed Images ",
        "score": 49,
        "url": "https://www.reddit.com/r/Instagram/comments/1dr4uik/instagram_search_section_feed_images/",
        "content": "[ 29-06-2024] What is this? refresh your Instagram search feed and you will see many nature images like landscapes and .... I think these images are AI generated and Instagram is updating its database to improve AI, may be. \n\nWhat are your thoughts, any official statement or talk?\n\n\nCan you guys confirm, it is happening in all regions, I am from India.",
        "num_comments": 30,
        "comments": [
            "I was just about to comment the same thing, that or ai shit wtf is up is insta",
            "I thought this was only happening to my account. \n\nGlad its not.",
            "ai take over has started ",
            "Same thing happened to me! One minute I was looking at K-pop and now Im looking at nature!",
            "I cant access reels either",
            "Same here. And I cant scroll reels anymore.",
            "Can't look up anything either, when I enter it refuses to show me anything under \"for you\", but it will let me see accounts\n\nMy feed is now nothing but nature!",
            "I think its just set to default suggestions, nothing with AI",
            "im going through the same thing and i cant check other peoples stories anymore?? like whats going on",
            "I kinda dig it I noticed the change and was refreshed to see something new."
        ]
    },
    "This is not my FYP. What is happening!?": {
        "title": "This is not my FYP. What is happening!?",
        "score": 43,
        "url": "https://v.redd.it/l1rkjqyhgg9d1",
        "content": "",
        "num_comments": 8,
        "comments": [
            "im happy to see im not the only one with this problem, ill try and wait it out",
            "everyone seems to have this problem is so f***ing annoying.",
            "It says popular in your country & thought i got hacked lmao",
            "The search function is not even working for me.",
            "Just added 2 fac authenticator ",
            "Same problem here",
            "It is now",
            "Same"
        ]
    }
}