{
    "WEEKLY FREE TALK THREAD": {
        "title": "WEEKLY FREE TALK THREAD",
        "score": 4,
        "url": "https://www.reddit.com/r/InstaCelebsGossip/comments/1dncbak/weekly_free_talk_thread/",
        "content": "Hello everyone!\n\nThanks for participating in our sub. Our weekly free talk thread is back! Please use it to have off topic conversations and connect with other members on stuff outside of this sub’s themes. To prevent spamming the sub, this thread is the right place to ask for recommendations, handles to follow, share YT videos, TV gossip, jokes and just about everything else.\n\nWe have also created a set of [guidelines for creating high quality posts](https://www.reddit.com/r/InstaCelebsGossip/wiki/index/), please go through these before making new posts to reduce spam and make ICG an enjoyable experience for everyone.\n\nPlease follow these three basic rules -\n\n1. No political discussions\n2. No promotional comments\n3. Be kind to each other, don’t attack members\n\n**For your own safety, never disclose your personal information. If you come across someone breaking rules like being abusive, insulting a member or body shaming, report them at once. We do not accept name calling in this sub and such comments will be taken down.**\n\nHave a great week!",
        "num_comments": 13,
        "comments": [
            "[mod approved] Hi guys!\nFor the members of this subreddit, we have this very nice, active, enthusiastic community to hangout, chill and also discuss our favourite topics related to Instagram Celebrities and also other general Discussions. We have voice chats and Game nights as well.\n\nHere is the discord link, do join us ❤️\n\nPlease note this is an unofficial server of ICG and isn’t linked to the sub!\n\nLink to the server: https://discord.gg/xCWGnYjZpr",
            "I have a random question in my mind what do people as customers look for in a makeup package for their wedding or any function.??.ur inputs will be highly appreciated & it will help budding makeupartists to serve u better💓",
            "Explain it to me like I’m 5: \n\nHow do I select the right foundation and concealer shade online ?",
            "Why are “any tea?” Posts banned ?",
            "I have so many times posted to ask about Shivesh but no you, you guys don’t budge! \nWhat is it with you guys and shivesh? \nSome collab? \n\nGuys, is Shivesh Bhatia and that boho girl in relationship? Am I missing on something?",
            "[deleted]",
            "Yes this.. Also I m totally zero in the makeup department.. So if anybody replies plz explain as if you are to a boy",
            "This is really tough even influencers also make mistakes . \n1. findation.com is a good site to start if you know any shade from any brand.\n2. Go to a mall & test there & buy from their first time . (This is for beginners)\n3. Find someone (content creator ) same as your skintone and use them as reference. I got mine from @spellsparkles . I asked her in DM and she helped me to find my shade as I was noob in makeup\n4. Watch YouTube swatches of particular brand which you are interested in and then click your picture in nature lighting - go to insta story - use that pic- use text tool - use color tool to select a area around your cheeks - screenshot that shade/color - go online and match that screenshot with the shade picture on nykaa \n.\nI hope it make sense . If you have any further questions do let me know",
            "Shivesh is gay and this topic has been discussed at least a couple times in the sub. You'd know if you bothered to search.",
            "Name calling and abusing is against sub rules. Multiple posts of yours were removed with fair warning about following sub rules, you still didn't follow them and were thus temp banned. Any more rule breaking will lead to permanent ban. Reach out over modmail if you have an issue with post approval."
        ]
    },
    "We need more mods for this sub, please send us a modmail if you're interested in joining our team!": {
        "title": "We need more mods for this sub, please send us a modmail if you're interested in joining our team!",
        "score": 7,
        "url": "https://www.reddit.com/r/InstaCelebsGossip/comments/1dk7vyi/we_need_more_mods_for_this_sub_please_send_us_a/",
        "content": "Hi guys, we're looking to add a couple of mods to our team - one in IST and others can be in different timezones as well.\n\nIf you're someone who's very active on Reddit and your views align with the rules of this sub, we'd love to have you on our team and help us moderate it! \n\nPlease send us a MODMAIL if you're interested.",
        "num_comments": 22,
        "comments": [
            "will i be paid?",
            "interested! I won't be from IST but EST ( eastern standard time- Washington DC)!",
            "interested!",
            "Interested! How to send a mod mail?",
            "Very Interested",
            "interested! I spend 8hrs usually on a daily basis here- better work & get paid",
            "Mailed!",
            "Interested",
            "Interested",
            "how does one send a mod mail? 🥲"
        ]
    },
    "Ankita really should not do fashion like WHAT IS THIS!!!!! NO JUST NO, proof that money doesn’t buy style": {
        "title": "Ankita really should not do fashion like WHAT IS THIS!!!!! NO JUST NO, proof that money doesn’t buy style",
        "score": 20,
        "url": "https://www.reddit.com/gallery/1dr3j2v",
        "content": "",
        "num_comments": 26,
        "comments": [
            "babushka gworl 💅🏽",
            "Is she trying to look like a schoolgirl?",
            "I used to get colds easily as a child. My mom used to tie a scarf to protect my head from the cold and tell me not to open it. I used to go out to play and open my shrug but being an obedient girl, I would never remove my scarf. This is what I used to look like back then.",
            "She always dresses SO EXTRA whenever she’s going out. It looks so odd when her friends are dressed up normally",
            "Ye toh koi class 1 ke bacchi ka outfit copy kiya hai!",
            "imagine seeing her walking around like this randomly… i’d laugh so hard😭😭😭",
            "she’s trying to replicate something but it just looks tacky 😭",
            "Those hair clips\n\n![gif](giphy|BLvlJQK9AjWjbrcIxF)",
            "I’ve seen this look being pulled off with longer hair but with hair like hers the scarf looks odd",
            "![gif](giphy|Ia62g1fUnD1egRBsU0|downsized)\n\n👀"
        ]
    },
    "Okay so apparently this is a real Mother and Son duo💀": {
        "title": "Okay so apparently this is a real Mother and Son duo💀",
        "score": 50,
        "url": "https://v.redd.it/bl99tesche9d1",
        "content": "Now I just came across this video on my feed randomly as I was scrolling on Insta and what in the effing shit is this? For all the non Hindi users, she saying that she will remove his (her son’s) juices 💀🤢🤢 and that smile after that like helloooo???!!! ",
        "num_comments": 51,
        "comments": [
            "the dialogues are one thing... but why the fuck is she looking at him sooo seductively??? 🤢 wtf has social media come to be.. someone getting fame for openly having 2 wives, someone promoting incest/pedophilia... yuck!!!!!",
            "They defo know what they are doin !! Cheap ah tactics",
            "Wth did i just watch and hear..\n\n![gif](giphy|WQy9FkJlhGSwl3eQ5V|downsized)",
            "They need psychiatrist",
            "imagine him growing up & going to college / office 😭\n\nI'm traumatized for him",
            "What the fuck! Even without knowing what she said I got creeped out. She's looking so horny while saying that.",
            "https://preview.redd.it/fbsgfpeong9d1.jpeg?width=410&format=pjpg&auto=webp&s=3a61be634a3631c9e57dd4b3f7aded697b723b80",
            "I thought it was Kullu for a moment.",
            "Aur gossip karo. Mil jaegi inko big boss ke next season me entry. This is what they want.",
            "Ewwww"
        ]
    },
    "So sick of @whos.devuu’s reels mocking women and insinuating that women who speak with an Indian accent are “wannabe english speakers”": {
        "title": "So sick of @whos.devuu’s reels mocking women and insinuating that women who speak with an Indian accent are “wannabe english speakers”",
        "score": 330,
        "url": "https://v.redd.it/vhhr42z7za9d1",
        "content": "I initially found a few of her reels funny but now they’re just downright annoying and mostly targeting women and how they may act in a wannabe/pick me/over enthusiastic etc etc manner ",
        "num_comments": 151,
        "comments": [
            "She's doing this at Max where most of the middle-class shops. I dare her to pull this stunt at H&M, Zara, M&S 🙄 so elitist and narcissist bitch.",
            "She has such a slappable face",
            "Oh she’s so fucking irritating. I literally HATE her content. She thinks she’s being funny but her content is cringe as shit. Nobody normal talks like her stupid characters.",
            "Al these girls who make reels like this : her, Ankita Sehgal, RJ Karishma etc etc, i strongly believe, they either ARE their most repetitive character OR they WANT TO BE their most repetitive character. You get what I mean?  It's ALWAYS passive aggressive BS. Dharna is a sweetheart though. Her content I actually enjoy.",
            "I just went on her Instagram and checked a few of her reels. \nThis woman has no personality of her own and thus tries to appropriate other people’s personalities in order to mock them, all the while not realising that she has become a caricature herself.",
            "I worked with her once and she is INSUFFERABLE IRL. Also extremely dumb. And her videographers keep telling her shes funny and good at acting. Lmao",
            " द ऑडेसिटी ऑफ दीस बिच !!",
            "See the thing is, to be so accurate about any kind of demographic, you have to either be a part of it yourself or spend a lot of time with them. Most of these cases, they’re a part of this demographic and are trying hard to “other” themselves from it. ",
            "At this point, these content creators are using such characters to get personal about certain people is what I feel? So what if this person finds a 999rupees top expensive? This is so classist and she's rage baiting. So what if people talk like this? We've got too much on our hands as a country to be dealing with people attacking on how others speak. Imagine how it can affect a person who's already under confident about speaking a coloniser language. Asshole behaviour?",
            "Someone needs to slap her for her expressions and voice."
        ]
    }
}