{
    "A Loose Guide to Tipping": {
        "title": "A Loose Guide to Tipping",
        "score": 23,
        "url": "https://www.reddit.com/r/InstacartShoppers/comments/1bli2il/a_loose_guide_to_tipping/",
        "content": "*On a weekly basis we receive a handful of posts from Customers asking about appropriate tips.*  /u/InstacartDoctor *was kind enough to help me get two sources to help with general questions about tipping gig workers.  This post isn't meant to discourage discussion, if someone has a question not covered in this quick reference, please do ask.*\n\n&#x200B;\n\n**\"A good rule of thumb is to tip $10 or 20% whichever is greater on Instacart, as you would for any service based business… like a restaurant, or nail salon, or hairdressers.**\n\n**Instacart Shoppers are paid similar to waitstaff.**\n\n**You can find suggestions for tipping from NY Magazine's exhaustive tipping guide… (20%) and** [**Gigworker.com**](https://gigworker.com/instacart-tipping/) **did a stint as an Instacart shopper he also recommends 20%.\" -** /u/InstacartDoctor\n\n&#x200B;\n\nWhile I included a link to the Gigworker guide to tipping, I was unfortunately only able to find a [slideshow](https://www.reddit.com/r/antiwork/s/cOdeH1aVQ8) of the NY Magazine guide to tipping.  It doesn't necessarily touch on Instacart, but shows how other tip driven jobs and gigs tend to operate.\n\n&#x200B;\n\nhttps://preview.redd.it/7opsf17s10qc1.jpg?width=1284&format=pjpg&auto=webp&s=408a4ad9ff83e8fbb0ca9fa1ac973cad2e52f5bc\n\n&#x200B;\n\nhttps://preview.redd.it/9nfrkits10qc1.jpg?width=1284&format=pjpg&auto=webp&s=9c11b38def7eb941ca60d4a58cc01fd9901d5a23\n\n&#x200B;\n\nhttps://preview.redd.it/yq2m20et10qc1.jpg?width=1284&format=pjpg&auto=webp&s=dc993fe86e6cfab35ee2801818e87b7473653a75\n\n&#x200B;\n\nhttps://preview.redd.it/odin6byt10qc1.jpg?width=1284&format=pjpg&auto=webp&s=c2a771d7c87768baace9bef8897250ad0ddcdda9\n\n&#x200B;\n\nhttps://preview.redd.it/rpvsjlhu10qc1.jpg?width=1284&format=pjpg&auto=webp&s=a0d6e8f9ee132d470a8fe1010e1887e0adb84169\n\n&#x200B;\n\nhttps://preview.redd.it/wilag47v10qc1.jpg?width=640&format=pjpg&auto=webp&s=4f1b58aaf510e241fe678fdde317c3698b37308c\n\n&#x200B;\n\nhttps://preview.redd.it/puiabvnv10qc1.jpg?width=1284&format=pjpg&auto=webp&s=ea9e05d85ada5c85ce1f76f7b76c38b340991033",
        "num_comments": 1,
        "comments": [
            "[deleted]"
        ]
    },
    "Application outage and status Megathread ": {
        "title": "Application outage and status Megathread ",
        "score": 7,
        "url": "https://www.reddit.com/r/InstacartShoppers/comments/1dkg9kd/application_outage_and_status_megathread/",
        "content": "All posts related to today’s 6/20 Thursday outage and status go here.  All others will be deleted.  \n\nApp status appears to have normalized around 1250pm eastern.  ",
        "num_comments": 37,
        "comments": [
            "Now I have to wait on hold for customer support because I’ve had fish in my car on a hot ass day for over 30 minutes and my scores aren’t about to get affected because I have to deliver hot ass fish",
            "With the garbage orders dropping in western mass I do not think the outage matters, lol. We missed NOTHING.",
            "Still on hold. Waiting for somebody to pick up. Also, I tried reaching out to trust and safety and they sent me back an auto response claiming I'm being deactivated for something that was already resolved a month ago, simply because I responded to that email asking what to do because the app wouldn't let me even contact help. So now I'm stuck and have to find out if I'm deactivated for asking for help. Lovely. ",
            "When there is and outage, do not even bother calling support.  Just keep refreshing. Thats all u can do.  And don't log out. I got totally locked out for a few minutes as that wasn't working either.  There is no need for support when there is and outage.  If your order gets cancelled or u don't get paid  2 hrs after it's back up, then contact support.  And always screen shot addresses. It crashed as I was loading the car. Had $700 of stuff I really dodnt want from costco.  Just headed that way and the app came back on as I arrived. Worked out totally fine",
            "[removed]",
            "Lmao can I just go about my day? Customer didnt answer phone calls and I couldnt leave their stuff at the door, so I was instructed to cancel batch and return is but then the app went down.",
            "Threads up but CHI is back online already lol",
            "Back up in Scottsdale - was able to keep my order mid shop",
            "App is up",
            "Over an hour for chat or phone support"
        ]
    },
    "As a shopper, it hurts to deliver to older folk. ": {
        "title": "As a shopper, it hurts to deliver to older folk. ",
        "score": 171,
        "url": "https://www.reddit.com/r/InstacartShoppers/comments/1dlj1cb/as_a_shopper_it_hurts_to_deliver_to_older_folk/",
        "content": "I live in the middle of nowhere. \nI sometimes end up delivering to places where the population barely hits 2k. \n\nI deliver to older folk all the time. One time, an older woman tipped me in 3 strawberries. :) 🍓 \n\nToday, I was in my car waiting for an order, and the only order that popped up? A grocery store 47 MINUTES AWAY, and her home a total of 42 miles from me. \n\nI sighed, but figured I had nothing else going on today, so I accepted the $20 order. \n\nI traveled, I shopped, loaded up and drove some more miles. When I arrived, I didn’t even know if I was at the right place. I peaked at the locked up fence and overgrown yard. 4 unleashed dogs lost their marbles when I approached. (I learned quickly they were just protective. They were actually very sweet)  I just stood there, gazing around for about 10 minutes. I tried calling and texting the customer and all, no answer. \n\nI took one final peak passed the gate and there she is, an old woman sitting with her wooden stick of a cane on her concrete stairs. I had a hard time unraveling the chained up fence, but I managed, and carried her groceries up her overgrown driveway. \n\n“Sorry about that Joyce, I didn’t see you there!” \n\nShe kinda nodded her head and kept telling her dogs to shut up. This poor old woman. My soul freaking hurt for her man.\n\n I said “are you alright darlin’?” \n\n“No. I’m sick, but I just need to take my iron and once I’m better I’m getting the heck out of here.” \n\nShe also apologized for not opening the gate for me. She said she has a hard time walking down there. I said it was no worries at all. \n\nInstead of leaving her semi-heavy groceries outside, I offered to put them inside for her, to which she said I could leave them on the floor near the fridge. \n\nI unbagged and put her items on her counter instead so she wouldn’t need to crouch down for them. \n\nI came out and told her I was all done, and she thanked me. Then I asked, “you live out here all alone?” Yup. She did. \n\nShe had no car, and no family to check on her. She said she usually orders from Walmart, but the last delivery she placed was TWO DAYS LATE, and her + her dogs went without food for that time. \n\nI asked if it was okay if I left my number for her, that way if she ever needed anything, she could just call me, and I’ll make every effort to be there. And that’s what I did. Wrote it in bold with my name. I wished her a good day, she blessed me, and I headed on out but man… it shook me up so bad. I hope she’s alright. I hope she calls when needed. :(",
        "num_comments": 49,
        "comments": [
            "This almost made me cry. I understand because I feel the same way when I do those types of orders. And like you, I do always leave my number and feel so bad just doing that. There have been a time or 2 when someone very much older and/or crippled have offered me CASH tips, but I never EVER like to take it. I figure that could be my grandparents or parents or me someday and what would I want someone to do. \n\nAfter talking to my grandma about it, she told me that if they are super persistent, then I should take the tip and maybe leave it inside their mailbox or use it to bless someone else. She said when I refuse (her opinion, of course), I'm taking away the blessing from that individual. I guess I never looked or seen it that way, but I can see how that could be possible. It just doesn't make me feel good at all. \n\nI always offer to put the groceries away and leave out anything they may need for that evening, etc. It's really sad when you learn they are all alone and it sounds like she was way out there in the middle of nowhere. You did the right thing and you will forever be rewarded.",
            "Hands down my favorite part of this gig is the customers who really do need the help and appreciate us. \n\nClose second is the cute pups that we get to see!",
            "You're such a good person to do that for her. We are a community and have to take care of one another. People have mostly forgotten that. I'm glad you didn't.",
            "Thank you for being a good person. I wish there was a way to see it it's an elderly person because I would do those for lower tips.",
            "There's a man who's order I didnone time. I didn't do this but think all the time that I should have. He needed help. Next time I see his order I'm taking it and making note of his address so I can help him. \nThank you",
            "Besides the money this is what it’s all about my favorite part about doing this helping the truly needy",
            "Needed this wholesome post. I was recently helped put by neighbors, and don't know what I would have done without them.",
            "I delivered to a Salvation Army complex. The lady was clearly not ok. I did her dishes and put her food away. I left in tears. Permanently haunted.",
            "Weird..halfway reading through this sitting in the parking lot..an order popped up for a customer i have delivered to before. An old man in a wheelchair that has to meet me downstairs of his building to let me in. Then i have to follow him to the elevator while he moves along pushing with his 1 good leg. He is such a nice old man and it hurts my heart. Well i better start shopping..",
            "This brought me tears. Awesome gesture."
        ]
    },
    "Item list before accepting orders changed?": {
        "title": "Item list before accepting orders changed?",
        "score": 7,
        "url": "https://www.reddit.com/r/InstacartShoppers/comments/1dlszja/item_list_before_accepting_orders_changed/",
        "content": "Has anyone else's list of items they you can see before accepting an order changed? For years the heavy items were listed first, along with alcohol. This past week it would say heavy pay, but the items are at the end of the list. I would never accept an order with multiple cases of water, but it's making it hard to grab orders quick when I have to scroll to the end of the list. ",
        "num_comments": 7,
        "comments": [
            "Same, I noticed this yesterday 🙄",
            "Yup. Never cancel batches. But accepted  Costco and had to cancel bc 7 waters hidden in there.",
            "Yeah, think it's intentional to do exactly that, get quicker bites or orders with big packs of drinks. IC will claim they've been \"alphabetized\" or some shit lmfao",
            "Yes. Intentional for sure. Their shadiness is at a high.",
            "I am a part part time shopper. I looked at the app a couple weeks ago and was offered a batch with no item list.\n\nThis is against the contract if you ask me.",
            "Yea i had a case of water hidden time to times. It wasnt there cuz i always check for heavy items. And recently been seeing water cases after i hit start shopping",
            "What type of car do you drive. I have a Corolla and when I set the choice correctly I don’t see orders with that much heavy. So I did change the settings once to see bigger orders but overall it wasn’t even worth it"
        ]
    },
    "You don't want much, do ya? ": {
        "title": "You don't want much, do ya? ",
        "score": 4,
        "url": "https://i.redd.it/knezvhtmd48d1.jpeg",
        "content": "70 miles, and what I'm assuming to be 25lbs of meat with no tip. I am excited to watch how long this batch sits there.",
        "num_comments": 4,
        "comments": [
            "Oh no… it’s all out of stock 🤷‍♂️",
            "Some illegal immigrant will end up taking it. Always happens",
            "Yeah looked good from afar untill i saw the mileage",
            "I sure will especially if my two other accounts have orders heading the same direction"
        ]
    }
}