{
    "A guide to interacting with this sub - read me first": {
        "title": "A guide to interacting with this sub - read me first",
        "score": 105,
        "url": "https://www.reddit.com/r/Insurance/comments/1742occ/a_guide_to_interacting_with_this_sub_read_me_first/",
        "content": "This post is designed for people posting here for the first time, for the people that have been volunteering to help here for years and everyone in between.  The stated goal is to foster a friendlier attitude throughout the sub.\n\nIf you are new here, please realize that none of us have any stake in your claim or coverage.  We are not here to sell you anything or to save some company money. Treating responders poorly because you don't like the answer is going to attract a lot of negative attention.\n\nWe get the same questions over and over, and maybe this is the answer that you need:\n\n* *How much will my insurance go up after a ticket/accident/lapse in coverage?*  We don't know unless your state has a statutory requirement for your very specific situation.\n* *My premium went up $X.  How do I fight this?* You can't.  The only thing you can do is shop for new coverage, which we can't do for you.\n* *How much does everyone else pay for coverage?* Unless you're lucky enough to get someone in your exact demographic in your exact part of the world, the answers you're going to get are useless.\n* *How much is my claim worth?* We don't know. (note: if you're asking a more complex question about your claim, that could be very different)\n* *How long will my claim take to close?* We don't know (again: a more complicated question might have different answers)\n* *Why is this person trying to sell me something?* Report that post/comment/chat/private message to the moderators and let them handle that.\n* *Will you help me commit fraud or otherwise break the law?*  No.  Absolutely not.  And we may ban anyone that does try to do that.\n\nUltimately, we are here to help you.  This is a community of volunteers that wants to help navigate a complex system that is one of the lubricants of the financial world.  Lots of lives are impacted by insurance directly and indirectly, and it can be a complicated system.  Here are some things that make a good post where you can get help:\n\n* Location (Country and state/province at a minimum)\n* Type of insurance involved (Auto, Homeowners/Renters, Commercial, Health, something else)\n* A brief description of the problem and any advice you've gotten so far\n\nFinally, here are some definitions of common terms that could help you get taken more seriously:\n\n* Adjuster - the person that handles your claim, makes coverage determinations and processes payments\n* Agent - the person that sells a policy.  Some agents get involved in some claims, although that is the exception to the rule.\n* Underwriter - the person that decides how much a specific policy will cost for a specific risk.\n* Rate - this is the way your final price is calculated and is usually used synonymously with \"premium\", \"cost\" and \"price\".\n* ~~Full coverage~~ \\- don't use this term.  There's no agreed definition, even among the regular posters here.  People asking otherwise good questions or posting good answers that use this term often find themselves down voted to oblivion for including it.\n* No Fault - there are 18 states that, at least to some extent, make automobile bodily injury claims be paid by your own policy first instead of someone that caused your injury.  There is only one state (Michigan) that makes damage to your vehicle No Fault.  All Canadian provinces have some sort of No Fault provision for injuries, which is one reason why we need to know where you are when you're asking questions.\n* Collision coverage - this fixes your car when it collides with something else or another car hits it.\n* Comprehensive coverage (also known as Other Than Collision) - this covers your car for almost everything else, including floods, fires, tree branches and lightening strikes. Usually animal strikes are covered here, but not always. \n* Deductible - this is the amount that you agreed to pay in case of any claim.  Your payment comes before any insurance payment.  Deductibles are occasionally waived, but that's the exception, not the rule.\n\nThis is a community of volunteers that generally understands the insurance system. When we get things wrong, it is usually through lack of information to get a precise answer.  Hopefully this guide will help you get good results.  ",
        "num_comments": 47,
        "comments": [
            "i do see quite a lot of repeated questions and i would add a few more for auto claims:\n\n1. Disputed total loss: For first party: Most insurance companies use a market survey to find the market rate of your vehicle. If you disagree, make sure all the options and conditions are correct on your vehicle. If that doesn't work, you can usually submit your own comparables (vehicles that are similar to yours). Your ultimate recourse would be the appraisal clause where you hire an independent appraiser and the insurance company hires an independent appraiser. they then agree upon the value of the vehicle and this will be your settlement amount. For third party, your options are far limited. You can either mitigate through your own collision coverage or pursue the other party in court.\n\n2. Liability disputes. Each insurance company determines the fault of an accident. They may agree or disagree. Police reports do not determine liability. A lot of word vs word disputes are finalized with neither carrier accepting fault for the loss. Options would be to use your collision coverage or sue the other party. \n\n3. I cannot reach my adjuster/my adjuster doesn't return my calls. Very frustrating for sure. A lot of times they'll leave a supervisor's number on their voicemail so try them. You can try also pressing \"0\" and that can sometimes transfer you to a live person in the claims department. Lastly, most companies have a complaint main number. That's a good way to light a fire as usually those complaint calls go up the chain of management. \n\n4. Issues with estimates: When an adjuster writes an estimate, we can only write for what we can see is damaged. When a shop writes for an estimate, they write for what they assume is damaged. This leads to a lot of variances between a field estimate vs shop estimate. Once the vehicle is at a shop and torndown, a reinspection can be done to resolve any missed damaged items. Or get an agreed price with shop.",
            "It might be helpful to make this an automod reply to all posts. Sometimes subreddits even require an acronym be added to posts to allow them to stay up ... [irtr] - I read the rules.",
            "one thing id like to specifically add about auto insurance - an estimate is just an educated guess whats damaged. unless you can physically see the part thats broken, and its proven, its still a guess. \n\nonce the car is taken apart the price only goes up",
            "Depending on the company, sometimes the underwriter just determines if a risk is acceptable or not. The actuary does the pricing. But, great post. \n\nAlso- some of the folks who comment here honestly just hate their jobs, and wanna use this as an outlet to be dicks. Those people suck. That's all I have to add.",
            "Thank you!  Perhaps add to definitions:  customer service reoresentative / CSR - insurance company or agency employee who responds to questions and/ or makes changes to existing policies.  May process payments.  *Often* has the same license as agent but generally doesn't write new policies.",
            "I love this! I love you! Something about household\nMembers might be worth mentioning can this be stickied or something ? Idk I’m not a Reddit pro",
            "is it possible to require a poster to select a flair that consists of their country and state before their post can be submitted? that would be excellent",
            "Question for a recommendation for specific insurance in my state are not accepted?",
            "If I wrecked my car on my property, basically I slid in the snow hit my fence damaging my car. Question is in Colorado do I have to file with my insurance under collision and pay the deduct? The only vehicle involved was min",
            "Hello, I have a question or two about health insurance. I’m getting Cigna insurance through my employer and was told that none of the insurance policies offered will cover a gastric sleeve surgery, for weight loss. Is this common? Can they exclude a procedure even if it’s deemed medically necessary or appropriate? I also live in Va. Thanks in advance"
        ]
    },
    "Soliciting, private messages and you": {
        "title": "Soliciting, private messages and you",
        "score": 29,
        "url": "https://www.reddit.com/r/Insurance/comments/1aly7zs/soliciting_private_messages_and_you/",
        "content": "It's time for a new reminder about the rules of this sub.  There is *never* any reason to offer to contact another poster privately, especially if that poster has a question about placing coverage or a claim.  Here is the rule:\n\n> The only rule of [r/Insurance](https://www.reddit.com/r/Insurance/) is that solicitation is prohibited. This means asking people to PM for any reason, offering to quote coverages for visitors, or soliciting agents and/or buyers to use your particular carrier. [r/Insurance](https://www.reddit.com/r/Insurance/) should be a place where people come to exchange information and ask questions without worrying about solicitation from agents. This includes adjusters, underwriters and brokers since we do not vet anyone. \n\nYou also received a version of this if you subscribed to the sub.  \n\nIf you think that this doesn't apply to you, please think again.  There are no exceptions in this, including \"but *I* asked *them* to message me!\"  This sub is a safe space for people to ask questions about insurance.  It is not here for anyone to try to profit from it, whether they're an agent, public adjuster, software vendor, personal injury attorney, headhunter, diminished value expert or anyone else that is not here to offer free help with no expectation of remuneration.  \n\nIf you receive a message from someone offering you any sort of business proposition, whether a quote for insurance, legal representation (yes, there are lawyers unethical enough to solicit people on Reddit), damage reports or anything else, please let the moderators know via mod mail or in this thread.  You should also report that message to the admins (we don't see that report, though).  We take things like that seriously.  \n\nWe really don't like banning people.  Seriously, it's the exact opposite of why any of the moderators volunteered for the role.  But we don't vet people before they post, and if people that break the rule find out that we enforce it whenever we see it broken.  \n\nAnd with that in mind, we have a very healthy community of posters that are here not only to help but to make sure that those who can't follow the rules have the damage that they're doing limited.  Thank you to all of you for volunteering to help not only those confused by the insurance process but help keep those that want to think that they're special at bay.",
        "num_comments": 7,
        "comments": [
            "How do we feel about users offering to run black book estimates for totaled vehicles? I’ve seen about 4 or 5 comments like this, all different users and all on different threads, and it feels mad shady to me (and it gets the hopes up of the OP who may not know any better).",
            "What does this have to do ,with me ?",
            "I’ve asked to discuss cultures at different carriers/brokers when looking for jobs. People generally want to do that via PM for obvious reasons. Maybe these conversations are more often had on r/insurancepros though. Regardless, are we ok with that here?",
            "It is shady. Please report it when you see it.",
            "I wouldn't touch that at all.",
            "It’s going to depend on how it’s phrased and what mod reads it. I can tell you that someone did get banned for something along those lines recently, although there was more to it than what you’re saying. The rules of the other sub are very different because it’s a different environment.",
            "Totally agree - I’m a total loss adjuster and it honestly pisses me off, especially when the OP clearly has no idea of what to expect and these shady ass people slide into the thread offering to run black book like it’s the be all end all."
        ]
    },
    "The billboard attorneys aren’t your friends. ": {
        "title": "The billboard attorneys aren’t your friends. ",
        "score": 159,
        "url": "https://www.reddit.com/r/Insurance/comments/1dqkuzy/the_billboard_attorneys_arent_your_friends/",
        "content": "I’m a liability adjuster and spoke with a claimant this morning: \n\n“Yeah, I had an attorney but I was shocked when I realized I’d never meet them face to face. Their receptionist would only text me and when she sent me screenshots she was on Facebook on her phone at the same time she had my medical information open. Then they dropped me when I said I wasn’t getting surgery.” ",
        "num_comments": 76,
        "comments": [
            "Lawyers aren’t held nearly as accountable as insurance companies are.",
            "Are there people out there who don't already know this?  Obviously if there's no money in it for the lawyers, there's no reason for the lawyers to be in it.  But that doesn't mean that in the right cases having the right attorney won't help you do better.  It's just that a \"small injury\" case typically isn't the right kind of case to have an attorney involved.\n\nIt's certainly better for the attorney to back out at an early stage than have them stay in and add no value when pursuing a claim.",
            "Everytime i get claims assigned that have Morgan & Morgan on them, i die a little bit inside.",
            "As a litigation adjuster, the mills are the worst. Never know their clients or the cases, overly aggressive and barely want to discuss actual case merits.",
            "When I was a complexity BI adjuster I had so many claimants who would smugly tell me they had an attorney and six months later would call and try to talk to me about their case because they couldn't get ahold of anyone at their attorneys office.",
            "But Anh Phoong told me I could call her if something was wrong.\n\nhttps://preview.redd.it/jq6ntt30nd9d1.jpeg?width=2048&format=pjpg&auto=webp&s=f62afe14ba4403bbbc79d56f04af5b74013ceacb",
            "I live in a rural, but heavily-populated, part of SoCal and a local PI attorney here cites \"you will have access to me personally\" as a reason to retain him, as opposed to other attorneys. Good marketing move, imo.",
            "That's why it is so important to choose the right attorney though most of them act \"right\" if you have a \"reasonable\" amount to pay.",
            "I had attorneys refusing to take my motorcycle claim because I got my UM payout already. \nThey did not want to pursue the other person or even hear anything about my claim, despite having to spend several days in the hospital and needing surgery to save my arm. \n\nAttorneys (generally speaking) only want the easy payouts and will push you for unneeded medical treatment because they know what triggers big payouts.",
            "In my experience the highly reputable ones that aren’t on billboards aren’t any different"
        ]
    },
    "CALIFORNIA: Claims adjuster hung up on my sister (insured) stating she has counsel and adjuster will therefore only talk to the attorney": {
        "title": "CALIFORNIA: Claims adjuster hung up on my sister (insured) stating she has counsel and adjuster will therefore only talk to the attorney",
        "score": 19,
        "url": "https://www.reddit.com/r/Insurance/comments/1dqucyh/california_claims_adjuster_hung_up_on_my_sister/",
        "content": "Is this accurate? My sister called about a recent (DENIED) renter's insurance claim and the adjuster said she (adjuster) needs to END the conversation because my sister is represented by counsel. All my sister wanted is a MOST recent / current COPY of her policy booklet to review the limitations and exclusions for herself. The adjuster said, \"No, I cannot deal with you, I will call your attorney and speak to him,\" then just hung up. \n\nIs this normal / appropriate? Please advice. My sister needs the policy booklet to review their exclusions for themselves. Thanks. ",
        "num_comments": 72,
        "comments": [
            "If she is paying a lawyer in cash or contingency, the lawyer should be gathering the policy documents and contract as that is what the money is for.",
            "As an adjuster it baffles me that attorneys don’t explain this to their clients, but turn around and get mad at us if we speak to their client when we didn’t know they were rep’d. Just ranting. \n\nYour sister’s adjuster was right. Maybe a little hasty to disconnect so quickly but I don’t blame them. Her attorney is supposed to handle everything with the insurance company from this point forward.",
            "Yup, but this document is often available online.",
            "She cannot talk to the adjuster if they value their employment. \n\nDon’t worry about the limitations and exclusions. Her lawyer will request a CERTIFIED copy of the policy soon enough and advise what’s covered.",
            "They are legally not allowed to speak directly to the insured (you) once you obtain an attorney. You must get all your information from your attorney. The adjuster is just protecting his license; he could lose his license over it. He wasn’t trying to be rude.\n\nEdit: If you need a copy of your policy booklet, call your Agent or the customer service line. Not the claims department.",
            "Yes. Also a claims adjuster is not the right person to ask for a copy of the policy.",
            "Always drives me crazy how everybody threatens a lawyer when they don't like the answer they are given by their adjuster, but nobody seems to have any clue what the consequences of getting a lawyer actually are. \n\n\nWouldn't that be part of some sort of ethics on the part of th lawyer too? ",
            ">Is this normal / appropriate?\n\n\nYes",
            "Yes, when you hire an atty you cut off personal communication with the insurer. That's the consequences of your decision to lawyer up.",
            "Yup."
        ]
    },
    "Voting with.my wallet": {
        "title": "Voting with.my wallet",
        "score": 0,
        "url": "https://www.reddit.com/r/Insurance/comments/1dr6jb6/voting_withmy_wallet/",
        "content": "Almost 6 months ago I signed up with State Farm. My 6 month policy totaled a little over $1,200. Their coverage is excellent and their customer service is friendly. I was happy with them overall. \n\nBased on past experience I was expecting my premium to drop after my initial 6 months passed without incident \n\nI got a letter in the mail informing me that they would be *increasing* my premium to $1,650! What is that? Around 30%? Instead of rewarding their greed by resigning I switched to Farm Bureau and got it back down to $1,200. \n\nYou're *not* finna jack me like that!",
        "num_comments": 0,
        "comments": []
    }
}