{
    "What would be a good redeemable quality that i can use as a weakness for my job interview?": {
        "title": "What would be a good redeemable quality that i can use as a weakness for my job interview?",
        "score": 349,
        "url": "https://www.reddit.com/r/interviews/comments/7hc7c1/what_would_be_a_good_redeemable_quality_that_i/",
        "content": "I heard its best to have a \"weakness\" that you can say you redeemed and worked on to improve rather than a full negative. \n\nI was thinking of saying \"i suck at prioritizing in multi-tasking but ive worked on it with my last job and feel like i've improved.\"\n\nThough, this position involves a lot of multitask and teamwork and i wouldnt want that to be a \"weakness that i've improved\" \n\nAny suggestions would be great.",
        "num_comments": 158,
        "comments": [
            "I always say that I have struggled with self-confidence in the past and can sometimes second guess myself, and that this is something I have improved on greatly and I take a few seconds to calm down and focus and then come back to the task feeling better.\n\nIt is mostly true and I feel it is something that most people have experienced so the interviewer may relate. Plus, someone being overly confident and hell-bent on pursuing bad ideas just because they like them would be a hindrance to a team.",
            "The best weakness is an honest one. Can you draw any insight from past reviews?\n\nSome of my personal weaknesses (and how I think I have improved) are: \n-I am uncomfortable with delegating tasks and often get overwhelmed trying to manage things alone (worked on trusting the skills of my employees and holding them accountable). \n-I am not great at multitasking (use software to make lists and better track projects so that I can more easily manage multiple tasks simultaneously).\n-I am not good at networking, which is an important part of my job (I’m making an effort to push outside my comfort zone... I recently attended a meeting with x and y outside of our organization to collaborate on an important project).\n\nHope this helps!",
            "I always say that I'm impatient--especially with myself! I then say that because it is a weakness, I have learned to be self-aware of it and then step back when I see the signs and assess whether I'm being ridiculous or the impatience is justified. Then, when justified, it comes out as a motivator!",
            "The weakness question is your opportunity to talk about something you’ve worked on and improved at recently. ",
            "Definitely don't say suck 😂😂 say something like I've had trouble with , or an obstacle ive overcame was etc etc",
            "\"As demonstrated, I interview pretty badly\" \n\nI'm kidding, but I've used it to lighten the mood, and it worked. Other options for WIYGW: Carbs, and Texas BBQ. Keeping plants alive. and my personal favorite: \"what's a weik-ness?\"\n\nThen I usually talk about how I have a hard time walking away from something, and in that, I've found that sometimes walking away is needed, in order to get a fresh perspective.  I've learned with time to let myself take a step back, more often - before trying to force a step forward. \n\n&#x200B;\n\n&#x200B;\n\nGL OP, HTH",
            "Whatever weakness you choose, you always want to portray it in a positive light to your potential interviewer. Always mention on what action you have taken to counteract the wekness and the result from that action. If we use this approach, you will likely tick the box regardless of what weakness you choose. Why is this the case you may ask? The interviewer isn't really looking for a specific weakness and whether it's good or bad, they are looking for specific personality traits, one being the ability to overcome challenges! I hope this helps",
            "I say I have issues saying \"no\" when people ask for help. It works very well.",
            "I used to use the old chestnut, \"I am just too much of a perfectionist\", lol. My most recent interview, I liked the guy and said, \"I feel like I am eager to hit the ground running hard from day 1, but have learned that it's important to really observe, learn and listen to get an idea of company culture, values, etc before going full throttle.\"",
            "I have ADD, so I know i tend to create a lot of little fires everywhere that I don't finish. I have been working towards creating little goals and deadlines so, I always feel like I am accomplishing something to motivate me."
        ]
    },
    "Nice way to decline a job offer?": {
        "title": "Nice way to decline a job offer?",
        "score": 22,
        "url": "https://www.reddit.com/r/interviews/comments/1dqslw0/nice_way_to_decline_a_job_offer/",
        "content": "Had an interview last week. The job was interesting pre-interview but during the interview I found out this job is a 2-3 man job wrapped up into a \"one man army\". It wouldn't be a promotion, so I wouldn't make any more money. I left the interview thinking I didn't want it anymore but decided to sleep on it. Found out today they are calling my references so I'm preparing for a job offer to come soon. I'm planning on declining. I've never had to decline a job offer. What is a professional way to reply (via email) that I don't want the job because they are asking too much of one person? Should I mention if they were to give me a raise or hire a partner I would accept? I have nothing to lose if they say no but don't want to come off overbearing.\n\n  \nTLDR: Best way to word a declination to a job offer?",
        "num_comments": 23,
        "comments": [
            "You should just withdraw your application now so they don't waste their time.  I'd say, \"I enjoyed discussing the position with you but after learning more, I don't feel this is the right fit for me at this time.  I'd definitely be open to applying to something in the future that aligns more closely with my goals.\"  Or something to that effect.",
            "Dear Hiring Manager,\n\nUnfortunately due to a change in circumstances I will have to decline the position. If there is a suitable opening in the future that is a better fit for my current situation, I would be happy to reconsider. Thank you for your time and consideration.\n\nBest Regards,\n\nYour Name",
            "You can just save yourself the headache, send them an email today withdrawing your candidacy. Thank them for their time and say you've decided to go in a different direction.\n\nI would avoid talking about hiring additional people, they could easily promise to do so then you come on board and it never happens.",
            "Roses are red\n\nViolets are blue\n\nI got a new job\n\nBut it's not with you",
            "Dear Hiring Manager,\n\nAfter careful consideration, I have decided to reject your job offer. But I would like to thank you for the opportunity to be considered, and I wish you luck in your candidate search.\n\n\nSincerely,  \n \n(Your name)",
            "Dear Hiring Manager,\n\nSuck it\n\nBest Regards,\n\nYour Name",
            "Make sure to end the email with your Nick. ***PUNISHER*** that will give it a nice touch",
            "I think your wording here is pretty good, you just might want to think of specific things that make the job too much for one person.",
            "Have a polite talk with them. \n\nThank them for their time, leave the door open for future opportunities. (never burn bridges)\n\n\"Your team really impressed me during the interview process, I specifically appreciated \\_\\_\\_\\_\\_ about your company. I did have several job offers come in once, and I've moved forward on accepting the other role. I'd be happy to keep you on my contact list and will follow up with you should I become available again. Thank you again for your time.\"",
            "Just say\" I would like to hear your offer. Which will help me evaluate our potential relationship\"...If the money is decent    say \" I had more like $$$$  after evaluating the position  as you described \"\nAt this point you have stated your conditions...And you have left it up to them. to decide.."
        ]
    },
    "Is this a good answer? ": {
        "title": "Is this a good answer? ",
        "score": 2,
        "url": "https://www.reddit.com/r/interviews/comments/1dr4mmu/is_this_a_good_answer/",
        "content": "I have been filling out applications for a medical assistant role, Ive had a couple interviews and Im practicing ansering some questions. I dont want to be caught off gaurd for some questions. \n\nWhy would you be a good asset to practice name?\n\nI would be a great asset to practice name because I'm a quick learner who is eager to learn. I am empathetic and compassionate and I want to help deliever a welcoming and pleasant experience to patients while they are recievimg their medical care. ",
        "num_comments": 0,
        "comments": []
    },
    "[ny] ": {
        "title": "[ny] ",
        "score": 1,
        "url": "https://www.reddit.com/r/interviews/comments/1dr6flc/ny/",
        "content": "Everytime I had a phone interview the talent acquisition or recruiter told me they’ll send notes to the hiring manager to see if it’s a mutual fit. Does this mean it’s a rejection? Is this the new norm instead of “we’ll let you know” because can’t they have the power to schedule on the spot",
        "num_comments": 0,
        "comments": []
    },
    "How to describe achievements that aren’t on paper?": {
        "title": "How to describe achievements that aren’t on paper?",
        "score": 2,
        "url": "https://www.reddit.com/r/interviews/comments/1dr25rj/how_to_describe_achievements_that_arent_on_paper/",
        "content": "Hey guys! Currently prepping for an interview in a finance department but I’m having a hard time figuring out how to share my achievements at my current role. I work as a receptionist currently and my achievements have all been feedback from management and clients. I have no metrics to prove anything. I have also been given more responsibility despite being the employee with the least seniority. I don’t want to sound like I’m throwing my coworkers under the bus if I use this or bragging but how can I mention these things without doing that? Pls help lol",
        "num_comments": 2,
        "comments": [
            "Google STAR interview method \n\nYou don't want to talk bad about your coworkers but you DO want to highlight how you've become an integral part of the team and then give examples of how you helped the team, improved process, made a better client experience, saved the company money etc\n\n\nIn addition when you get your new role always keep track of your achievements if your management doesn't. A simple word doc etc. itll help later on.",
            "Thanks for the advice! I was struggling with how to put it into words I really like this, thanks! \n\nGood point! I’ll definitely make notes, appreciate your help. :)"
        ]
    }
}