{
    "Daily Fasting Check-in!": {
        "title": "Daily Fasting Check-in!",
        "score": 3,
        "url": "https://www.reddit.com/r/intermittentfasting/comments/1dr4fpd/daily_fasting_checkin/",
        "content": "* **Type** of fast (water, juice, smoking, etc.)\n* **Context** of fast (start, end, day x of y, etc.)\n* **Length** of fast (8 hours, 3 days, etc.)\n* **Why?** What you hope to accomplish with your fast\n* **Notes** How is it going so far? Any concerns? Insights to share?\n\nBe sure to check back often as comments get posted throughout the day. Sort comments by \"new\" to be sure the newer comments get some love as well.",
        "num_comments": 1,
        "comments": [
            "Type: 16:8\nContext: Start around lunch time which usually means I'm eating lunch and dinner. \nLength: 8h eating window\nWhy: Weight loss  \nNotes: Stuck. Not really losing any weight at the moment. Fluctuating up and down (likely water weight). Clothes do feel slightly loser than they did last year (when I was the same weight as my starting weight) and my stomach is less bloated, but scale-wise not much is happening. I'm not eating that much as it is so I'm trying to increase my steps instead of shrinking the eating window even more."
        ]
    },
    "Moratorium on posting articles about the new IF study. ": {
        "title": "Moratorium on posting articles about the new IF study. ",
        "score": 210,
        "url": "https://www.reddit.com/r/intermittentfasting/comments/1bioso1/moratorium_on_posting_articles_about_the_new_if/",
        "content": "We don’t need tens of posts about the same thing. Further posts will continue to be removed. ",
        "num_comments": 153,
        "comments": [
            "Can we please have a pinned thread? Or a megathread? \n\nParts of it seem like bullshit but I still think it's worth discussing even if it's just to debunk it. Just saying the study is flawed and should be ignored doesn't help at all",
            "I appreciate it as the posts were getting out of hand, but I do feel like a megathread would be a good option to help with the influx. That study doesn't seem to hold enough evidence to firmly prove that IF can cause cardiovascular issues (hell, it even says that they didn't take into account other factors that play a role in health like dieting, which is a way bigger point to cardiovascular health), but I do feel like a megathread would help at least ease tensions. Lots of people coming here to either warn people about it or to ask if that study holds up, that a loved one sent them that and that they're worried sick because they do IF or they know somebody who does IF and such.",
            "I remember in the late 2000s or early 2010s, I was put off fasting because some articles came out that fasting wasn’t good for women. And then I thought about it, like how? Both men and women went through periods of feasting and famine. Anyways, wish I started sooner.",
            "This is the only comment that should have focus from the article, \"Although the study identified an association between an 8-hour eating window and cardiovascular death, this does not mean that time-restricted eating caused cardiovascular death.”",
            "Can there be a pinned thread to discuss it then? I think it is very important to discuss and for people to get more information",
            "Sponsored by makers of your favorite semiglutides",
            "Can we get this pinned?\n\nApparently people think that looking at a subreddit to see if something has already been posted about will break their fast.",
            "When it goes through peer review, I think I would like to read it. I am curious of the methodology. The title for the article I did read was very click baity, which makes we wonder how much vitriol is swirling about in the diet subs against IF, that such naming is guaranteed to clicked and shared. Regardless, this stuff is going to run its course on the internet make the site a bunch of ad money and then they will be onto the next one.",
            "Can you pin one then? This is only the second mention of it I’ve seen on this sub and I am literally on reddit all day every day.",
            "Propaganda. I don't believe it. The study hasn't been released. I've seen things in media, healthy things, touted as unhealthy... in an effort to steer people wrong. \n\nAmerican based research is needed."
        ]
    },
    "4 years maintaining my 100lbs weight loss": {
        "title": "4 years maintaining my 100lbs weight loss",
        "score": 371,
        "url": "https://www.reddit.com/gallery/1dra88v",
        "content": "I used to post a lot about my weight loss and received a lot of criticism. Im proud of myself for not giving up and proving everyone wrong and that i can continue to keep the weight off. Its been 4 years and i continue to make better and healthier choices for myself everyday.",
        "num_comments": 17,
        "comments": [
            "M/27 5ft9in. Started off around 270lbs but got down too 165. I felt like i 165 was too restrictive, so i think 170-175 is a good goal weight for me. My biggest problems always would be snacking or over eating, my portion sizes were always too much. I would eat from 10am-6pm and stop all snacking and eating outside of those windows. I think that just helped remind me that i was snacking at all hours of the day. I do work out but not as much as i did in the beginning. Now its only a few times a week were i use weights and do 100 squats per workout.",
            "my dude. if it weren't for the shape of your ears and the beauty mark on your chin, I straight up would not even believe that these pictures are of the same person. this is phenomenal!! you should be so, so proud of yourself. truly inspirational!!",
            "Wow congrats!! Massive accomplishment! You look great! ☺️",
            "Super hero sh*t. You’ve saved yourself! Congratulations!",
            "that IS a great accomplishment. I hope you are pleased and low key smug.",
            "Amazing! You look like a complete different person!",
            "I would never lose a single pound in an 8 hr window. Did you count calories? Even six hours I don’t lose. 20:4 seems to be all that works and it’s hard 😬",
            "I only eat for 8 hours so theres 16 hours where i didnt eat. So im not as strict with myself as others are on here. I didnt count calories, i just listened to my body and stopped when i was full, i didnt do massive diets or cut myself off from eating things. I just cut back my portions and stopped snacking so late. I dont use fasting as a way to drop weight fast, i use fasting as a way to stop myself from eating all hours of the way.",
            "Do you fast clean? (Only plain black coffee/ tea and water, no sweeteners)",
            "Happy for you that this worked for you!"
        ]
    },
    "I've lost 10lbs in a month and I'm no longer considered obese": {
        "title": "I've lost 10lbs in a month and I'm no longer considered obese",
        "score": 74,
        "url": "https://www.reddit.com/r/intermittentfasting/comments/1dr9ucv/ive_lost_10lbs_in_a_month_and_im_no_longer/",
        "content": "F, 24, 5'2, SW: 171.5, CW: 161.5, GW: 125\n\nI've been overweight for most of my life and I hated it so I finally decided to make a change. I started my weightloss journey on the 1st of June and fasting has become an integral part of it. I typically fast for 23 hours and allow myself to eat whatever I want from 6pm-7pm. I don't restrict certain types of foods but I do count the calories. I also do enough cardio everyday to burn 500-600 calories. \n\nI feel great. I have more energy and I've noticed a huge positive change in my breathing and stamina while working out.\n\nMy bmi is finally below 30 for the first time in several years and I'm so happy about that. I can't wait to eventually be at a normal weight for my height.",
        "num_comments": 7,
        "comments": [
            "Congrats my friend I remember that my bmi was about 45 at one point and i remember the below 30 and below 25 great achievements keep it up and keep building on it",
            "Congratulations fellow 5’2 cutie!! I had a similar start weight and I’ve lost 30 lbs since starting IF about 9 months ago. \n\nBMI is such a junk metric, but it’s worth celebrating that you’re becoming a healthier you. Happy for you!",
            "Congrats on your continued journey to become a shadow of your former self ;)",
            "I'm at what was similar to your start point. Any tips or tricks for what I imagine will be a long journey? Only been at it a few weeks but already seeing movement on the scales which I'm happy with.",
            "So I started last June at a whopping 26stone 7lb (1 stone = 14lb ) and I’m as of today 14 stone 7 lb so yes it’s a very long journey but the main thing is stay on path but allow urself tgat pizza or something once a week as I have but I was also unhealthy at points on starvation so don’t do that but just keep going that’s best tip",
            "congrats! keep at it",
            "👏🏿👏🏿👏🏿👏🏿"
        ]
    },
    "what should i do ?": {
        "title": "what should i do ?",
        "score": 24,
        "url": "https://www.reddit.com/gallery/1drcx82",
        "content": " \nmy first hand at intermittent fasting was January 2023 during my senior year after my football season ended. I weighed about 225-230 and i did omad until about late April and I weighed in at about 190-195 which the first time i was under 200 in an extremely long time. \n\nAfter that i started eating more regularly (lunch and dinner and a few in between here and there) but i jumped rope almost everyday to not gain the weight back, and i weighed about 200-205 for the majority of the summer. Once i began college i made myself believe i still felt like i wasn’t where i wanted to be and so i start OMAD again in mid October to Thanksgiving and i went from in high u about 205ish to about 185ish, but then i impulsively tried a smoothie diet because someone i knew was doing it and i wanted to see how much weight i could lose, and i began it December 1st for about 2 weeks and i was at my lowest weight at 177 but i noticed a bit of loose skin probably because the abrupt diet change but i don’t know. After my friends insisted that stop the diet, i abruptly stopped just before Christmas break and started eating regularly again and i was so scared of gaining all the weight back. After break, around mid January 2024, i didn’t pay much attention to my weight, but i could feel it coming back on.\n\n Around mid February i started weight training and a bit of cardio alongside OMAD, but i would often find myself having worse cravings and giving in. I stopped working out and OMAD completely for about a month and in mid April i decided to pick OMAD back up and i was making progress, but it felt like my body had become adjusted to the fast quickly now after only 2 weeks. I became demotivated as the number on the scale wasn’t moving and just gave it up on my birthday May 4th. I weighed roughly around 208. After about a month, starting June 4th, i started consistently working out and burning 400 calories doing cardio 5-6 days a week and have being doing until present day, but my weight has increased to 211 most recently.\n\nI recently stopped working out for about 2 weeks now (10 days to be exact) and i went down from 212 to 203, but ive been stuck at this weight for the past several days. Im scared my body has learnt how to get used to OMAD now, and its seems like nothing is working anymore. Please help:(",
        "num_comments": 13,
        "comments": [
            "Keep a consistent plan and stick to it and you’ll see results. You can do it!",
            "What are you eating?\n\nCalories still count, even if you're only eating once a day.",
            "You’re eating too much.  You need to be in a calorie deficit.  Find a TDEE calculator and use it to determine your daily TDEE.  Make sure you eat less than that each day.  The greater the calorie deficit, the faster you will lose weight.\n\nStrength training regularly will improve your visual results and will also help you lose weight faster.  Other exercise is helpful as well.",
            "Dude, you look solid though putting on good muscle 💪",
            "also just fyi, i work 9-5 and my eating hours are at 9pm until i go to sleep which is usually around 12-1 am",
            "Your shoulder genetics are sogood dude I'm jealous",
            "Also second pic is a typo it’s  november 2023",
            "i’ve recently been taking my lunch from work with a diet coke and greek peach yogurt and eating that and they’re restaurant establishments, i know the yogurt and the coke is 120 total but i haven’t been able to the calories on the meal. I ocassionally would have something additional on top of that like hummus and chips or some frozen food i would get out the fridge.",
            "This. When I finally started tracking I realized that a handful of foods (like nuts) were adding lots of calories without much satiety. Crazy how I can throw down 1,500 calories as a “snack” out of that Costco bag of nuts.",
            "Might think about those hours,,, I’d try an earlier eating window and a few hours of not eating before bed. And try to get to sleep earlier too!"
        ]
    }
}