{
    "Guy makes a pressure sensitive coffee table design": {
        "title": "Guy makes a pressure sensitive coffee table design",
        "score": 2720,
        "url": "https://v.redd.it/t7ynoj2g9i9d1",
        "content": "",
        "num_comments": 104,
        "comments": [
            "Never before have I seen something so fascinating and sophisticated yet so completely purposeless",
            "This isnt pressure sensitive. I believe it senses electrical conductivity.",
            "All fun and games till it starts lighting up patterns on its own",
            "The cat sold it for me",
            "That's very impressive. Does he take orders? ",
            "I too, would like to acquire this",
            "this is pretty cool ngl, but I kinda wish the lights would turn of after bit.",
            "Love the creativity here. Would love to have a table like this at home.",
            "Its not pressure sensitive though...",
            "Send it to me. Please "
        ]
    },
    "Man Rescues Dog From Being Drowned by Kangaroo": {
        "title": "Man Rescues Dog From Being Drowned by Kangaroo",
        "score": 146,
        "url": "https://v.redd.it/gzi39n27vi9d1",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Kangaroos seem like complete assholes from what Ive gathered.",
            "I love how he actually takes a right hook like he's fighting with another dude. Avage day in Australia",
            "That thing was so rood ",
            "i dont know how australia is not yet considered an alien land, these mfs literally drown their prey and does boxing  on top of that.",
            "Everyone goes on about the killer spiders in Australia but the kangaroos look demonic!",
            "How the fuck was the dog being held by the roo in the river?\nIm going to need a whole lot more information",
            "Why would a kangaroo drown a dog?  So many questions",
            "all I see is target",
            "This video will never get old. lol Australians",
            "Damn that thing is jacked"
        ]
    },
    "Cleaning a coin using laser": {
        "title": "Cleaning a coin using laser",
        "score": 201,
        "url": "https://v.redd.it/337xbg70yh9d1",
        "content": "",
        "num_comments": 25,
        "comments": [
            "Here's your 20 cent coin good as new! That'll be 200 euros.",
            "The sound... why...\n\nSounds like J.P from Grandma's Boy",
            "The laser sounds sound like four shooting a beam a bit",
            "Sounds like the theme of that basketball god in Regular Show.",
            "I need to see this sound used for Godzillas atomic breath. At first, it sounds cool, and then it becomes hilarious.",
            "These sounds always remind me of that old Berzerk arcade game.",
            "Sounds like the intro of a movie",
            "Soundscape like me on the porcelain throne",
            "Kinda like the sounds to be honest",
            "The other face of the coin : ( .- .)"
        ]
    },
    "Solar parhelion or sun dog": {
        "title": "Solar parhelion or sun dog",
        "score": 468,
        "url": "https://v.redd.it/5ejkkjibpf9d1",
        "content": "Solar parhelion, or sun dog, is a\nfascinating atmospheric phenomenon that occurs when sunlight is refracted through ice crystals in the atmosphere. These ice crystals are typically found in cirrus clouds, which are high-altitude clouds made up of tiny ice particles.\n\nSun dogs appear as bright spots on either side of the sun, often forming a halo or rainbow-like effect around it. They are most commonly seen when the sun is low on the horizon, such as during sunrise or sunset.\n\nThe scientific name for sun dogs, \"parhelion,\" comes from the Greek words \"para\" (beside) and \"helios\" (sun), reflecting their position relative to the sun. Sun dogs are also sometimes referred to as mock suns or phantom suns because of their appearance.\n\nWhile sun dogs are beautiful to observe, they are purely optical phenomena caused by the interaction of sunlight with ice crystals in the atmosphere.",
        "num_comments": 33,
        "comments": [
            "This is fascinating. Wish I could see it.",
            "It's the second coming of Elvis ! ... that's his belt buckle symbolic sign !",
            "Are my posts in this sub really bad? Pls give me honest opinion, if it bothers, i will stop posting, cause some people thrashing me in dm and comments stating i am not posting any oc, but i always left credit to maker whenever possible. I dont make these videos or content. If i find something interesting, i check if it's been posted here before. If not, i share it in this sub.",
            "I've seen a lot of those in my lifetime. I grew up in the mountains. But I've never seen one that good. That is absolutely amazing!",
            "i saw something like this in my bathroom window but it wasnt the sun",
            "Cool shit to see irl.",
            "im pretty sure thats just the radiance or an elder ring boss",
            "Cool! Now where can I see this?",
            "Someone has reached the peak of pantheon 5 and angered Radiance",
            "This is incredible. I wish I could experience something like that once in my lifetime. It would make me so happy."
        ]
    },
    "In 1943 electric vehicle taxis utilized pack swapping to help cut back on long charging downtimes": {
        "title": "In 1943 electric vehicle taxis utilized pack swapping to help cut back on long charging downtimes",
        "score": 5530,
        "url": "https://v.redd.it/fr20zqzrma9d1",
        "content": "",
        "num_comments": 251,
        "comments": [
            "Why is no one talking about the fact we had electric vehicles since then?",
            "For this to work now, which is indeed a really good idea, companies would need to standardise the packs so any stop point could help all vehicles.\n\nBut EV companies are guarding their battery pack secrets to outdo each other. Shame really.",
            "Don't bend over that thing with a loose chain around your neck. Jesus.",
            "80+ years later and we can barely do this to our phones any more ",
            "How many miles do you think they got out of a charge?",
            "We used to have electric powered milk floats.\n\nMan, I'd love one of those babies now.",
            "It's amazing how ahead of their time they were in 1943! Imagine if electric cars had taken off back then.",
            "Used to do the same thing with our fork trucks in the AC industry. We had banks and banks of lead acid batteries charging and someone always manning the station to swap batteries throughout the day.",
            "There is nothing new under the sun",
            "Jesus I would rather plug in and wait"
        ]
    }
}