{
    "Posts concerning the Palestine/Israel Conflict": {
        "title": "Posts concerning the Palestine/Israel Conflict",
        "score": 362,
        "url": "https://www.reddit.com/r/interestingasfuck/comments/1bqwhh3/posts_concerning_the_palestineisrael_conflict/",
        "content": "Beginning immediately, posts concerning the current and ongoing conflict involving Palestine and Israel will be locked for comments.  Conflict-related posts are still subject all other rules.",
        "num_comments": 1,
        "comments": []
    },
    "Rare sighting of the deep blue underside of a glacier during a collapse caused by glacier calving": {
        "title": "Rare sighting of the deep blue underside of a glacier during a collapse caused by glacier calving",
        "score": 12125,
        "url": "https://v.redd.it/qr1oiin1z18d1",
        "content": "",
        "num_comments": 333,
        "comments": [
            "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* Memes are not allowed.\n* Common(top 50 of this sub)/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [our rules](https://www.reddit.com/r/interestingasfuck/wiki/index#wiki_rules.3A) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "why is the bottom so much of a richer blue?",
            "Dayum bluer than I expected.",
            "That's where the healing waters on The Waterboy needs to be collected from",
            "Mountains in the water, amazing.",
            "The most beautiful shade of blue in the world.",
            "That’s where blue Gatorade comes from",
            "Beautiful, powerful, dangerous, cold\n\nIce has a magic can't be controlled\n\nStronger than one, stronger than ten\n\nStronger than a hundred men",
            "Damn that looks like some high quality H2O",
            "Still impressive no matter how many times it gets posted."
        ]
    },
    "My anxiety could never": {
        "title": "My anxiety could never",
        "score": 3425,
        "url": "https://v.redd.it/v5hujtezr08d1",
        "content": "",
        "num_comments": 235,
        "comments": [
            "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* Memes are not allowed.\n* Common(top 50 of this sub)/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [our rules](https://www.reddit.com/r/interestingasfuck/wiki/index#wiki_rules.3A) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "Fuck no, never away from the boat",
            "Can any premium GeoGuessr please verify his statement on site?",
            "We’re missing the really amazing part. Who is his cell phone provider? How is he getting a signal out there? Verizon drops if I go into the garage.",
            "😲\n\nMy stomach sank just thinking about being that far away from the boat. 😳",
            "That's a paddlin'",
            "It is disorienting to be alone, let alone in a sea, that too the Pacific Ocean and worst of all, on a paddle board. How many levels of anxiety is that? I would have died multiple times if it were possible.",
            "This is how people die at sea.",
            "I've done offshore sailing and something you really really want to do is de-risk  as much as possible. You're doing something inherently risky in the first place so having backups for backups is important. 1% chance you need it but bascally if you're in that 1% you want to have your backups ready to go and a plan rehearsed because if you don't you're 100% dead.\n\nHere for instance is an inflatable paddle board that could have a puncture or could get a puncture (A paddle board there in the ocean would be like catnip to a shark and sharks investigate with their teeth) and I guarantee you his boat is further away than he thinks, can he swim that far? who knows. All I know is that he doesn't have to be so far from the boat to get excercise and if a seacock breaks or something else happens on the boat while he's not there then the boat is going down and probably taking his liferaft with it.  \n\nEven in the doldrums a breeze can pick up quickly, like in an instant, his boat has more surface area than he does and his mast without sail is enough to push the boat and it can move more quickly than he can, it could be over the horizon while his back is turned. \n\nstupid stupid stupid.",
            "Seems like a huge risk leaving the boat like that."
        ]
    },
    "Russian president Vladimir Putin waving goodbye to his friend, Kim Jong Un": {
        "title": "Russian president Vladimir Putin waving goodbye to his friend, Kim Jong Un",
        "score": 48392,
        "url": "https://v.redd.it/heaf1yc5u08d1",
        "content": "",
        "num_comments": 3963,
        "comments": [
            "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* Memes are not allowed.\n* Common(top 50 of this sub)/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [our rules](https://www.reddit.com/r/interestingasfuck/wiki/index#wiki_rules.3A) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "What the fuck is going on lol",
            "“Just know that we’re looking at the same moon when we look up each night. ❤️”",
            "The world is just a meme at this point",
            "Summer lovin’",
            "You wouldn’t know him. He lives in North Korea.",
            "Some of the weirdest shit I’ve seen happen ever. The whole visit. wtf is going on? We’re truly living in the twilight zone",
            "This has been the weirdest news story I've seen in ages",
            "You know you're in deep shit when you have to have Kim Jong Un as a friend.",
            "“Hey! Don’t forget to ask your mom if you can stay over next weekend!  I just got Crash Bandicoot!”"
        ]
    },
    "The beginning of a flash flood in a slot canyon": {
        "title": "The beginning of a flash flood in a slot canyon",
        "score": 21610,
        "url": "https://v.redd.it/ob6d9pkxw08d1",
        "content": "",
        "num_comments": 307,
        "comments": [
            "\n**This is a heavily moderated subreddit. Please note these rules + sidebar or get banned:**\n\n\n* If this post declares something as a fact, then proof is required\n* The title must be fully descriptive\n* Memes are not allowed.\n* Common(top 50 of this sub)/recent reposts are not allowed (posts from another subreddit do not count as a 'repost'. Provide link if reporting)\n\n*See [our rules](https://www.reddit.com/r/interestingasfuck/wiki/index#wiki_rules.3A) for a more detailed rule list*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "How did Eric die?\n\n\nHe recorded a flash flood from the bottom of a canyon with an IPhone.",
            "The first time you hike in a slot canyon you will inevitably notice a few things. They are really clean early in the season. No trash. No sign of human activity. And there a lot of weird branches bent flat 20 feet above your head with debris trapped in them. \n\nOnce you connect the dots it’s a little terrifying",
            "As someone who does slot canyons, this is absolutely TERRIFYING. You can't outrun the water. I've heard stories that it sounds like a train and the canyon becomes dark. \n\n  \nIn 2015 [7 people](https://www.outsideonline.com/outdoor-adventure/exploration-survival/special-report-keyhole-seven/) went into keyhole canyon in Zions. None of them made it out alive. What is sobering to think is that the canyon is probably one of the shortest in Utah (3 rappels and only 1200 feet long). You can do the entire thing in 20-30 minutes. Despite being such a short canyon, they couldn't outrun the water.",
            "Any context to this? I'm curious how he knew it was coming.",
            "I grew up in Utah. If you get a flash flood warning DONT IGNORE IT. If you see a random stream of water flowing towards/near you RUN. Seriously. They can turn from a small trickle of water to a full on raging river in less than 2 minutes. People die every single year in southern Utah because they don’t take it seriously.",
            "WAIT A MINUTE I KNOW THIS TRAIL! That’s Icebox Canyon in the RedRock National park like 45 minutes outside Vegas, the rock face directly in front of you that you have to take to get up to the falls I got stuck like 10 feet up",
            "Flash flood? Yes let me stand here and record this video!",
            "As soon as you hear the water rushing above you RUN to higher ground. Even better, don't be at low ground in a canyon with heavy clouds overhead. \n\nHe's a few feet above the stream level, but it can get much higher.",
            "The fact that we have this video means he got out right?... right?"
        ]
    }
}