{
    "Trump’s Not ‘Bluffing’: Team MAGA Is Planning an Extreme Second Term": {
        "title": "Trump’s Not ‘Bluffing’: Team MAGA Is Planning an Extreme Second Term",
        "score": 2784,
        "url": "https://www.rollingstone.com/politics/politics-features/trump-not-bluffing-maga-extreme-second-term-1235044464/",
        "content": "",
        "num_comments": 218,
        "comments": [
            "Project 2025. Read it. Vote against it.",
            "Excerpts:\n\n\n\n“Any activists who doubt President Trump’s resolve in the slightest are making a drastic error: Trump will unleash the vast arsenal of federal powers to implement the most spectacular migration crackdown,”....\n\n“During the first Trump term, some of the policies he was dissuaded from — wanting to pull the U.S. out of NATO, family separation, things like that — he was able to be dissuaded from those things, because of some of the personnel around him,” says Sarah Matthews, who served as one of Trump’s deputy White House press secretaries. “In a second Trump term, he is not going to have any of those people around him ,and he’s going to go ahead and move forward with these kinds of controversial policies he wanted to pursue during his first term …",
            "If he gets elected again, it will literally be the end of democracy in the USA. Mark my words.",
            "    Trump and his maga cult are pure evil.",
            "Trump is always telling you what he’s doing and what he wants to do. He just does a reverse Uno and uses Biden’s name and the Democratic parties name in place of his own and the GOP.\n\nBelieve every word that Trump states as far as his actions when and if he becomes president.",
            "They are planning/ planed coup number 2- \n\nBigger, bolder and more dastardly than the first.",
            "Reinstate segregation. Death penalty for women who miscarry. Death penalty for same sex relationships. Establishment of state churches. These are all literally on their agenda. \n\nRead the history of 1930s Germany.",
            "We know! Vote blue or wind up in a concentration camp, the cotton field, or the southern front in the war with Mexico that Trump will start!",
            "Nobody should ever assume he’s bluffing.  Yes, he lies all the time.  But he also believes in retribution for any percieved slight.  In fact retribution appears to be his true religion.",
            "TRUMP WILL RUIN THIS COUNTRY\n\nLOCK HIM UP!"
        ]
    },
    "Trump Just Revealed How He’ll Attack Biden at Debate—and It’s Vile": {
        "title": "Trump Just Revealed How He’ll Attack Biden at Debate—and It’s Vile",
        "score": 216,
        "url": "https://newrepublic.com/article/182993/trump-biden-debate-attack",
        "content": "",
        "num_comments": 93,
        "comments": [
            "I'm convinced that Trump will bail on the debate using some excuse that the world will find laughable but his sycophants will find totally noble and reasonable.",
            ">The argument is always that Biden’s policies are to blame for these horrors. But at the most obvious level, this is absurd, because immigrants do not commit crimes at higher rates than native-born Americans do.",
            "If he shows am glad they will cut his mic. Will be funny hearing him scream from the side via Bidens mic. Dude is gonna look shit can rat insane.",
            "He'll back out - dude doesn't have the juice to win anyway between Herman Cain award winners and Jan 6th. He doesn't have the shit.",
            "Trump is vile, completely and totally Vile.",
            "You can expect that even though we cannot hear Trump because his mic is off, Biden will be subjected to a stream of vulgar insults intended to rattle him.  \n\nYou can expect that Biden is practicing his debating skills in this environment, and Trump in his rehearsals is practicing his insult streams to see which ones cause the victim to pause, giving the impression of zoning out.",
            "If immigration is so bad, why did they vote against the best solution to date?  So Biden can’t get credit? Sounds like the orange turd has blood on his hands.  That’s what the response should be. Don’t hold back , be aggressive!",
            "Considering his many many many MANY many malfunctions when speaking solo with a teleprompter lately, I'd be absolutely shocked if he shows up. But hell he's managed to barely grit his teeth through a debate in the past by snorting just enough of something to keep his brain focused for at least part of it. It's obvious he's high as a kite when he does it but the network can't say that unfortunately. \n\n\nBut even if he shows and even if he's high enough to not babble about how hard it is to put in pants and which sharks he doesn't want to pet or whatever, Biden is going to be prepared for his basic level debate tactics. Oh no you plan to point out something bad happened during Biden's presidency? Hmm now is there anything bad that happened during convicted felon Trump's presidency? Maybe something that WAS actually a direct result of his decision that led to a million and counting unnecessary American deaths? 🤷‍♀️ If he wants to cherry pick negative consequences I'd be willing to bet Biden can play that game all night. Certainly can play it longer than whatever the felon snorted lasts.",
            "If there’s a god … that god would not waste precious oxygen on this waste of a soul.",
            "Respond that that was a horrible, but also Mr Trump you told Mr Johnson to kill a bipartisan border Bill, not once but twice, your party even said it was the best border deal yet, and you told them “ don’t give Biden a win “ that isn’t making America great that’s your selfishness making it all about you."
        ]
    },
    "A GOP Lawmaker Was Arrested After Chasing a Stripper With a Gun in the Middle of the Night": {
        "title": "A GOP Lawmaker Was Arrested After Chasing a Stripper With a Gun in the Middle of the Night",
        "score": 729,
        "url": "https://slate.com/news-and-politics/2024/06/neil-friske-arrest-michigan-representative-gun-adult-dancer-stripper.html",
        "content": "",
        "num_comments": 73,
        "comments": [
            "Let's see <checks list>.....stripper...gun...arrested...\n\nWow, if we find out that this guy used stolen campaign funds to pay her for stripping, he might make it to  the top of Trump's list for VP.",
            "The real problem here is that strippers don't have enough guns.",
            "The stripper was at his house at 2:45 am, and he chased her with a gun.\n\nWhat are the odds this is not the first stripper or sex worker he has assaulted? Sex workers are targeted by serial killers and serial sexual assaulters because they know the cops don’t care about them.",
            "I believe it's called a VP audition.",
            "All good, doesn't break any of the 10 commandments.",
            "Trump: what a guy he’s got my endorsement",
            "Trumps VP. The evangelicals will love this guy.",
            "*checks notes... yep, on par with REPUBLICAN CHRISTIAN VALUES.",
            "r/upliftingnews",
            "The GOP is racing for the bottom as if the prize were something good."
        ]
    },
    "Justice Samuel Alito absent from Supreme Court session for second day in a row": {
        "title": "Justice Samuel Alito absent from Supreme Court session for second day in a row",
        "score": 5367,
        "url": "https://edition.cnn.com/2024/06/21/politics/samuel-alito-not-present-supreme-court/index.html",
        "content": "",
        "num_comments": 341,
        "comments": [
            "https://www.usa.gov/register-to-vote",
            "Probably taking a free trip somewhere.",
            "Probably busy hanging flags or something.",
            "[removed]",
            "wrenched his back helping Martha Ann hoist her WWG1WGA and Confederate flags for Independence Day",
            "I hope something awful hasn’t befallen him. That’s a big, fat, hairy lie.",
            "It would be EXTREMELY FUNNY if Alito dropped dead while trying to play delay games with the immunity ruling and this ended up not having his vote counted, which could end up deciding it against Trump after all 🤣\n\nI know he's probably fine and just has the vapors from all this flag hanging or whatever treason he's busy with but I mean 🤞🤞",
            ">  Alito’s absence, for which the Supreme Court has not provided an explanation, is unusual because it’s the end of the term and the justices have issued nine opinions over the last two days.",
            "[removed]",
            "Two-day strategy session at Mar-a-Lago."
        ]
    },
    "Judge dismisses Nevada ‘fake electors’ case\n": {
        "title": "Judge dismisses Nevada ‘fake electors’ case\n",
        "score": 2124,
        "url": "https://thehill.com/regulation/court-battles/4733915-nevada-fake-electors-case-dismissed/",
        "content": "",
        "num_comments": 268,
        "comments": [
            "https://www.usa.gov/register-to-vote",
            "Literally got away with treason.",
            "The party of law and order my ass.\n\nMore like the party of avoiding law and order.",
            "How much do you think the odds of this happening if it was YOU?\n\nREMEMBER IN NOVEMBER.",
            "Michael McDonald, Jesse Law, Jim DeGraffenreid, Durward James Hindle III, Shawn Meehan and Eileen Rice\n\nLet those names at least go down in history as treasonous fucks that made a lame attempt at a coup.  They are unpatriotic and undeserving of being mentioned in the same breath as any of the rest of us.",
            "Jim DeGraffenreid, Durward James Hindle III, Shawn Meehan and Eileen Rice will definitely be trying again to illegally get Trump elected again. \n\nFake electors all trying to get their orange messiah  back in office",
            "All we can do is Vote Blue up and down the ballot. The courts are corrupt and must be protected from further damage.",
            "So the judge dismissed it because it should have been filed in a closer city. Can’t they just do that, then?",
            "This is most likely going to be a repeat pattern, with some judges being harsh on the fake electors while others simply let them go free. \n\nThese cultists have been working for YEARS to prepare surprise rulings and laws like we've seen recently.\n\nThis is the biggest hidden weapon of the fascists.\nBoth observable and camouflaged cultists are spread far throughout our government, at the local/state/federal levels.\n\nHow many more judges/attorneys/heads of governance do they have in their pocket that can do stuff like this?\n\nWe are at a precipice of \"how much of our leadership is going to need to be removed?\" \n\nFascism can not be tolerated.  \nTheir leaders need to be removed from office \nTheir minions need to be shown how they are outnumbered\nTheir ideology must be challenged at EVERY point with aggression (voting booths/offices/laws)\n\nIt's the only way to purge them and help our systems start to heal and improve.",
            "What fucking dimension are we living in?"
        ]
    }
}