{
    "Daily General Discussion and Advice Thread - June 22, 2024": {
        "title": "Daily General Discussion and Advice Thread - June 22, 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/investing/comments/1dlrg5y/daily_general_discussion_and_advice_thread_june/",
        "content": "Have a general question?  Want to offer some commentary on markets?  Maybe you would just like to throw out a neat fact that doesn't warrant a self post?  Feel free to post here! \n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions, you should include relevant information, such as the following:\n\n* How old are you? What country do you live in?  \n* Are you employed/making income? How much?  \n* What are your objectives with this money? (Buy a house? Retirement savings?)  \n* What is your time horizon? Do you need this money next month? Next 20yrs?  \n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)  \n* What are you current holdings? (Do you already have exposure to specific funds and sectors? Any other assets?)  \n* Any big debts (include interest rate) or expenses?  \n* And any other relevant financial information will be useful to give you a proper answer.  \n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq\nAnd our [side bar](https://www.reddit.com/r/investing/about/sidebar) also has useful resources.  \n\nIf you are new to investing - please refer to Wiki - [Getting Started](https://www.reddit.com/r/investing/wiki/index/gettingstarted/)\n\nThe reading list in the wiki has a list of books ranging from light reading to advanced topics depending on your knowledge level. Link here - [Reading List](https://www.reddit.com/r/investing/wiki/readinglist)\n\nCheck the resources in the sidebar.\n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered investment adviser if you need professional support before making any financial decisions!",
        "num_comments": 6,
        "comments": [
            "How do you read stock information and find out more about specific stocks/etfs etc so you know what ones to invest in? I don’t understand the information I’m looking at",
            "I am trying to help my mom invest some money, and while I know lots about specific aspects, I of course don't know everything under the sun, and what might be best for her situation. For context, we live in Canada.\n\nShe has $10,000 she wants to invest for 8-10 months. She also wants to put in an additional $2k per month for this period. \n\nShe is pretty adamant that she CANNOT lose the principal 10k, as she needs it back at the end of this period. (I think she needs to pay something off at that time.) and she says it has to be \"accessible enough in case of emergency.\"\n\nNow, I know these are some pretty impossible conditions, but is there something for her that would be a \"best option\"? The bulk of my knowledge is on buying stocks, so that's the first thing I recommended to her, but obviously she isn't guaranteed to NOT lose money. I suggested she see an accountant or financial advisor, but she doesn't really want to do that.\n\nAny help is appreciated!",
            "What should I invest into? I can invest 700€ and I would like it to increase in 1 month",
            "If she can’t afford to lose then just do treasuries. Guaranteed 5%.",
            "[removed]",
            "Your comment was automatically removed because you may be using an unnecessary large font. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/investing) if you have any questions or concerns.*"
        ]
    },
    "Regulators hit Citigroup, JPMorgan Chase, Goldman Sachs and Bank of America over living will plans": {
        "title": "Regulators hit Citigroup, JPMorgan Chase, Goldman Sachs and Bank of America over living will plans",
        "score": 89,
        "url": "https://www.reddit.com/r/investing/comments/1dlb1s3/regulators_hit_citigroup_jpmorgan_chase_goldman/",
        "content": "KEY POINTS\n\n* Banking regulators on Friday disclosed that they found weaknesses in the resolution plans of four of the eight largest American lenders.\n* The Federal Reserve and the Federal Deposit Insurance Corporation said that the so-called living wills of Citigroup, JPMorgan Chase, Goldman Sachs and Bank of America filed in 2023 were inadequate.\n* Regulators found fault with the way each of the banks planned to unwind their massive derivatives portfolios; derivatives are Wall Street contracts tied to stocks, bonds, currencies or interest rates.\n\nBanking regulators on Friday [disclosed](https://www.federalreserve.gov/newsevents/pressreleases/bcreg20240621a.htm) that they found weaknesses in the resolution plans of four of the eight largest American lenders.\n\nThe Federal Reserve and the Federal Deposit Insurance Corporation said that the so-called living wills — plans for unwinding huge institutions in the event of distress or failure — of [Citigroup](https://www.cnbc.com/quotes/C/), [JPMorgan Chase](https://www.cnbc.com/quotes/JPM/), [Goldman Sachs](https://www.cnbc.com/quotes/GS/) and [Bank of America](https://www.cnbc.com/quotes/BAC/) filed in 2023 were inadequate.\n\nRegulators found fault with the way each of the banks planned to unwind their massive derivatives portfolios. Derivatives are Wall Street contracts tied to stocks, bonds, currencies or interest rates.\n\nFor example, when asked to quickly test Citigroup’s ability to unwind its contracts using different inputs than those chosen by the bank, the firm came up short, [according](https://www.federalreserve.gov/newsevents/pressreleases/files/bcreg20240621a3.pdf) to the regulators. That part of the exercise appears to have snared all the banks that struggled with the exam.\n\n“An assessment of the covered company’s capability to unwind its derivatives portfolio under conditions that differ from those specified in the 2023 plan revealed that the firm’s capabilities have material limitations,” regulators [said](https://www.federalreserve.gov/newsevents/pressreleases/files/bcreg20240621a3.pdf) of Citigroup.\n\nThe living wills are a key regulatory exercise mandated in the aftermath of the 2008 global financial crisis. Every other year, the largest US. banks must submit their plans to credibly unwind themselves in the event of catastrophe. Banks with weaknesses have to address them in the next wave of living will submissions due in 2025.\n\nWhile JPMorgan, Goldman and Bank of America’s plans were each deemed to have a “shortcoming” by both regulators, Citigroup was considered to have a more serious “deficiency” by the FDIC, meaning that the plan wouldn’t allow for an orderly resolution under U.S. bankruptcy code.\n\nSince the Fed didn’t concur with the FDIC on its assessment of Citigroup, it was overall deemed to have the less-serious “shortcoming” grade.\n\n“We are fully committed to addressing the issues identified by our regulators,” New York-based Citigroup said in a statement.\n\n“While we’ve made substantial progress on our transformation, we’ve acknowledged that we have had to accelerate our work in certain areas,” the bank said. “More broadly, we continue to have confidence that Citi could be resolved without an adverse systemic impact or the need for taxpayer funds.”",
        "num_comments": 5,
        "comments": [
            "Because it's an impossible task to unwind even your small piece of the quadrillion dollar derivatives market. Pull a couple threads and the whole sweater unravels.",
            ">and that ongoing weaknesses regarding data reliability and the firm’s compensating controls contributed to materially inaccurate calculations of resolution capital execution needs (RCEN) and resolution liquidity execution needs (RLEN). \n\ncould I get an eli25 on this portion?",
            "I sold my boa shares yesterday.. didn’t have much to begin with. sold my wells fargo in february. \n\nfinancials are so much underperformed compared to tech.",
            "I'll be adjusting my strategies accordingly.",
            "Just a guess without digging too deep. It could mean their administrative controls are lacking and that they are likely underestimating their true risk exposure. This can happen when miscategorizing assets. Different types of assets have different attributable loss estimates given default of the borrower/client (LGD). If you categorize, say, a loan collateralized by real estate as an asset based loan, you are miscounting your total LGD. \n\nThey could also have misaligned notional schedules between their underwriting for loan facilities vs the schedule of their derivative facilities as the people doing the calcs on the derivatives are not always the same folks doing the calcs on the underlying loans, even if both facilities are closing together."
        ]
    },
    "Does anyone not automatically reinvest?": {
        "title": "Does anyone not automatically reinvest?",
        "score": 35,
        "url": "https://www.reddit.com/r/investing/comments/1dlg3ag/does_anyone_not_automatically_reinvest/",
        "content": "I've always set my investments to automatically reinvest, kind of a set it and forget it method of investing.  But today I started to reconsider the idea.  If instead you pool the resources maybe you'd make different decisions.  Maybe money sitting there would be useful for purchases or expenses.  Maybe there's a new stock you'd like to jump into.  \n\nI'd love to hear from people who don't automatically reinvest.  Why do you take the money, and what do you use it for?",
        "num_comments": 45,
        "comments": [
            "I turn it off for certain, individual stocks if I no longer like the stock but don't want to sell because I'm still short-term CG. Instead use the money to buy shares of something else. Most of the time I DRIP, though.",
            "I'm guessing when you say \"automatically reinvest,\" you are referring to DRIP, as in auto reinvesting the dividends back into the original source. Depending on your portfolio, it can make reinvestment easier. However, if you want to maintain a set allocation, DRIP is generally bad because it throws away a free opportunity to rebalance your portfolio.\n\nFor example, lets say you have a simple portfolio that holds 50% domestic and 50% international total market. Both pay 2% dividends. In one year, the domestic market gains a lot, while the international market is stagnant. Your allocation becomes skewed 55% domestic and 45% international. But if you remain convinced that the 50/50 allocation is optimal, then you'll need to rebalance by selling some domestic and/or adding more funds to international. One \"free\" way to rebalancing is to use the dividends you get to purchase the underweighted areas. If you use DRIP, you will likely be purchasing more of the overweight areas, which will cause more portfolio skew.",
            "I only DRIP inside tax-deferred accounts, as the investments inside are mostly set it and forget it, and then I rebalance every time I make a deferral/contribution. In my taxable account, I like to make more decisions and do not set anything to automatically invest.",
            "I never do drip. It can be great, but it inadvertently also decreases diversification. I use any divs for adding more of something else I have and want more of or for something new. Usually something else that does a div or something growth I think will appreciate well.\n\nThat said drip works especially with the safer ETFs, but I’d rather use it to diversify into other things that may help balance and do well when others take a downturn.",
            "I get like $3 in dividends, so no I dont.",
            "Except for my money market funds, I don't automatically reinvest dividends/interest. I use the cash to buy what I want, when I want, in the amount I want, at the price I want.",
            "I never used it because in Australia brokers don't do tax reporting and calculations for you. I figured DRIP would just complicate things by creating extra odd tax lots.\n\nNow I'm heading into draw-down phase, I want to take the dividends as spending money anyway.",
            "I always take the dividends in cash and then decide what to do with them.",
            "As I said in another recent thread, DRIP is only if you'd buy the stock at the current price. There's nothing wrong with holding a stock long term but not reinvesting in it. I scooped up some regional banks' stock in 2020 during the worst of the pandemic. They have an excellent yield compared to the purchase price but I think they're currently overvalued compared to general market, so I don't DRIP them. On the other hand, I have some staples like KO and funds like VIG that I just leave reinvesting.\n\n*what do you use it for*\n\nPretty much anything I don't DRIP goes into an VTI/VOO or equivalent fund. All of my brokers have some form of partial share purchase at this point, so it's mostly automated, plus a few days at most.",
            "On my investment account I have dividends deposited so I can buy other stuff or choose to reinvest."
        ]
    },
    "Crowdfunding investments - thoughts?": {
        "title": "Crowdfunding investments - thoughts?",
        "score": 2,
        "url": "https://www.reddit.com/r/investing/comments/1dltra4/crowdfunding_investments_thoughts/",
        "content": "I am curious what experience and advice people have about various forms of crowdfunding. I am mostly in equities (brokerage and 401k) and just sold a rental property, but I have a small investment ($16.5k) in DiversyFund. I am curious about Yieldstreet and other forms of crowd-based investing in real estate, art, etc. Would like to hear more about people’s experiences and expectations. ",
        "num_comments": 5,
        "comments": [
            "Hard pass, just imho. Limited or no liquidity in many cases, often heavily oversold/advertised as some variation on \"now you can have access to asset classes previously only reserved for the super rich\" - then you look at what you can invest in and it often feels like what wealthy people have passed on.\n\n\"DiversyFund\"\n\nhttps://www.trustpilot.com/review/diversyfund.com\n\nhttps://www.google.com/search?q=DiversyFund&rlz=1C1VDKB_enUS1102US1102&sourceid=chrome&ie=UTF-8#lrd=0x80d9550149c46f27:0x7c664f462ac4ea0c,1,,,,",
            "not going to say yes or no as i think you should judge on your own merit\n\n  \ncrowdfunding is extremely illiquid. you will not be able to liquidate whenever you want and there is extreme counterparty risk. you could easily be investing in a ponzi scheme without knowing it, regardless of how \"reputable\" a site is (anyone can buy bots). \n\n  \none main advantage of the stock market is the easy liquidity. want a REIT? buy one in a millisecond. want to sell a REIT? sell one in a millisecond. want to know what's under the hood? it's required by SEC to disclose every little dirty secret.\n\n  \ncrowd funding sites have no such mandates. if you choose to invest in one of them, you must absolutely make sure you are being compensated for taking such risk",
            "i use prosper.\n\nwhich is a small private lending site. you contribute to loans people are wanting. typically something people would get a personal loan for. the firm takes 1% the rest is yours return. i am averaging 10% right now",
            "I am due my 5 year ROI next year so I will see how I did with DF. That’s why I started with something manageable and didn’t keep investing",
            "10% a year?"
        ]
    },
    "Stellantis Loyalty Shares ": {
        "title": "Stellantis Loyalty Shares ",
        "score": 1,
        "url": "https://www.reddit.com/r/investing/comments/1dlvgts/stellantis_loyalty_shares/",
        "content": "Hi! I have some shares in Stellantis that have been in my account for a few years so they’re eligible for the Loyalty / Special Voting Shares program (https://www.stellantis.com/content/dam/stellantis-corporate/investors/stock-and-shareholder-info/special-voting-shares/Special_Voting_Shares_Terms_and_Conditions.pdf).\n\nI read the T&C and registering them for the program makes them untradable unless I ask for them to be de-registered. Aside from the Class A special voting share benefit (but I have so little shares it’s irrelevan to the operation of the company) is there any other benefit to registering them? I seem to think making them less liquid makes no sense but perhaps I’m missing something?",
        "num_comments": 0,
        "comments": []
    }
}