{
    "Passo a passo de investimentos": {
        "title": "Passo a passo de investimentos",
        "score": 2018,
        "url": "https://www.reddit.com/r/investimentos/comments/8ukd9e/passo_a_passo_de_investimentos/",
        "content": "Então você conseguiu um emprego, e agora quer começar a investir?\n\nPrimeiramente, parabéns! Pelo emprego, e pela consciência que é importante poupar para o futuro. Agora vamos ao que interessa, o que você deveria fazer? \n\n0)\t**Definir objetivos**: antes de mais nada, é importante que você tenha consciência do que quer da sua vida financeira. Quer poupar para comprar uma casa? Quer juntar para viajar no final do ano? Quer ter uma renda extra para ficar menos dependente do trabalho? Ou, melhor ainda, quer conseguir se aposentar sem ter que depender do governo/previdência privada? A resposta para a pergunta “o que eu quero?” vai guiar seus investimentos, inclusive seu perfil de risco, necessidade de liquidez e produtos recomendados\n\n1)\t**Montar um Fundo de emergência**: um fundo de emergência é um valor deixado em aplicações mais líquidas (poupança, ou CDB com liquidez diária), para se proteger de imprevistos – por exemplo, gastos médicos, reparos no carro, uma necessidade de viagem repentina, etc. Esse fundo também é um “colchão de liquidez”, caso você precise de dinheiro (por exemplo, caso você perca o emprego), você pode usar o dinheiro que está aqui ao invés de sacar dos seus investimentos \n\n-*Quanto dinheiro devo deixar no meu fundo de emergência?* Isso depende de você, mas normalmente 3-6 meses de gastos é o recomendável. Algumas pessoas preferem pensar em termos de ganhos, eu por exemplo deixo 3 meses de salário no meu fundo de emergência. \n\n2)\t**Pagar suas dívidas**: dever dinheiro é ruim. Dever dinheiro no Brasil, que tem juros altíssimos, é pior ainda. Se você tem dívidas de cartão de crédito ou cheque especial, pague isso o mais rápido possível, pois são juros completamente abusivos. Dívidas como empréstimos pessoais e financiamentos podem ser benéficas, dependendo da taxa de juros, mas nunca deixe atrasar – pague as parcelas em dia, e adiante parcelas se achar que vale a pena\n\n3)\t **Abra uma conta numa corretora**: não vale a pena investir através de banco. Corretoras tem mais variedade de produto, e taxas mais atrativas. As mais recomendadas são Rico, XP e Easynvest, mas faça uma pesquisa por conta própria para ver qual te agrada mais.\n\n4)\t**Comece a investir em produtos simples e seguros**: Enquanto você tem pouco dinheiro investido (e pouco conhecimento), vale mais a pena investir em produtos de renda fixa – esses investimentos são mais seguros porque, a não ser em um colapso total da economia, seu dinheiro inicial está protegido. Os principais são:\n\n\t\n-*Tesouro direto*: Emprestar dinheiro para o Governo. Tem liquidez (você pode resgatar antes do final do prazo), e é tributado de forma regressiva – quanto mais tempo você deixar seu dinheiro lá, menos imposto paga, o ideal é deixar pelo menos dois anos. Dependendo do papel, pode pagar juros semestrais, ou só ir acumulando pra ser resgatado no final. Pode ser pré-fixado (paga um percentual fixo, não importa o que aconteça), atrelado à inflação, ou atrelado a SELIC\n\n-*CDB*: Emprestar dinheiro pra banco. Normalmente paga um percentual do CDI, mas também existem alguns papéis atrelados à inflação, ou com taxa pré-fixada. Pode ou não ter liquidez, e é tributado de forma regressiva – vale a pena deixar o dinheiro lá por pelo menos dois anos.\n \n -*LCI/LCA*: Emprestar dinheiro para alguém que trabalha com imóveis (LCI) ou agropecuária (LCA). Normalmente pagam um percentual do CDI, e são livres de imposto. Ótimos produtos caso você queira o dinheiro em menos de dois anos, e podem ser bons também para prazos maiores.\n\n5)\t**Estude**: procure sites, livros, amigos, etc., que possam te ajudar a entender mais de investimentos, para que você se sinta confiante em avançar para o passo 6. **NUNCA INVISTA NO QUE VOCÊ NÃO ENTENDE**, é uma garantia de se perder dinheiro.\n\n6)\t**Renda variável**: fundos, ETFs, câmbio, ações, opções... são investimentos mais arriscados, onde é possível perder parte do dinheiro inicial investido (e em alguns casos, como opções, você pode até sair devendo mais dinheiro do que colocou). Sempre que for colocar dinheiro aqui, pense bem sobre seus objetivos, e sobre sua tolerância ao risco – é fácil olhar só para a promessa de retornos maiores, sem pensar que você pode perder muito dinheiro aqui.\n\n7)\t**Outros investimentos**: investir em imóveis (para revender ou para alugar), franquias, start-ups, cryptocurrency... investimentos fora dos que são negociados em bolsa podem ser muito atrativos, mas aqui vale ainda mais o passo 5: **ESTUDE** antes de sair investindo, e tenha certeza de só colocar aqui dinheiro que você pode perder sem se comprometer\n\n8)\t**Aproveite**: Tudo deu certo e você agora tem vários investimentos, te proporcionando uma renda passiva que complementa (ou até supera) seu salário? Meus parabéns, você conseguiu o sonho de muita gente de virar independente financeiramente. Continue gerenciando seus investimentos para manter (ou aumentar) seu retorno, e vá aproveitar a vida sem se preocupar em perder o emprego ou ter uma emergência, sabendo que você construiu pra si mesmo uma sólida rede de segurança financeira.",
        "num_comments": 205,
        "comments": [
            "Pela utilidade pública, tenha um cimavoto, sr.",
            "Muito boa a iniciativa. Recomendaria apenas pagar as dívidas antes do fundo de emergência.",
            "Comprei cyberpunk 2077 por 213 reais, na época 60 dólares convertidos em reais, pedi reembolso me devolveram mais de 250 reais, Po o dólar tava aumentando tão rápido que em menos de uma semana subiu pra caralho, ou seja, ganhei sem fazer nada",
            "Post mais útil que já vi no reddit, obrigado hahaha",
            "Dúvida de iniciante, na XP por exemplo, um completo iniciante que acabou de ganhar um primeiro emprego, começa a investir por app sozinho ou procura um corretor pra me guiar e ajudar em qual melhor cdb ou melhor fundo imobiliário? (São os únicos nomes que conheço até agora com 2 dias de pesquisa)",
            "Aprendi de duas formas: com o curso “enriquecer faz bem à saúde “ e seguindo a Ações Garantem o Futuro da louise Barsi. Mas a maioria do conteúdo das corretoras e you tuber e furada",
            "Ótimo resumo! Se me permite uma sugestão, talvez fosse interessante mencionar os FIIs já que são amplamente divulgados por aí.",
            "muito boas dicas. Obrigado amigo",
            "Mandou a braba! Adorei esse aulão sobre o basico em investimentos.",
            "Belo resumo OP! Vai ajudar muita gente."
        ]
    },
    "No 'Gilmarpalooza', mesa de debates reúne presidente da CVM e empresário que ele condenou | O Globo": {
        "title": "No 'Gilmarpalooza', mesa de debates reúne presidente da CVM e empresário que ele condenou | O Globo",
        "score": 7,
        "url": "https://oglobo.globo.com/blogs/lauro-jardim/post/2024/06/no-gilmarpalooza-mesa-de-debates-reune-presidente-da-cvm-e-empresario-que-ele-condenou.ghtml",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Esse evento é uma vergonha."
        ]
    },
    "Custo para ter um bebê de proveta: 138 mil reais.": {
        "title": "Custo para ter um bebê de proveta: 138 mil reais.",
        "score": 172,
        "url": "https://www.reddit.com/r/investimentos/comments/1dqsmlv/custo_para_ter_um_bebê_de_proveta_138_mil_reais/",
        "content": "TL;DR: ~R$ 46.000  X  3 tentativas = R$ 138.000 (valores de 2023, clínica mais cara)\n\nCustos por tentativa:\n\n11.350 medicamentos\n\n1.620 ultrasons\n\n995\t exames de sangue\n\n715 anestesia\n\n1.870 embrioscope\n\n3.000 biópsia\n\n24.400 coleta, cultivo e implantação dos óvulos\n\n2.500 congelamento\n\nR$ 46.450\tTOTAL\n\n\nDuas não deram certo, na terceira nasceu um bebê.\n\nMedicamentos (R$ 11.350):\ndiversos hormonios para mulher descer vários óvulos no mês da coleta (ao invés de um só que é o normal). Os medicamentes variam bastante de pessoa pra pessoa. Pra comprar com desconto tem que entrar em contato com várias farmácias especializadas do Brasil (não de rede). Mostre orçamento uma pra outra, peça desconto. No nosso caso deu mais de 11 mil pois precisou de medicamentos extras por outras complicações como endometriose e ajustes no metabolismo.\n\nUltrasons (R$ 1.620):\num monte de ultrasons mensais pra monitor se os óvulos estão maduros, se tem endometriose, se está no mês certo pra coleta, etc. As vezes a clínica de fertilidade inclui o ultrasom \"de graça\", mas como moramos fora da capital, tivemos que pagar do bolso aqui.\n\nExames de sangue (R$ 995):\npara monitorar a data certa de tomar medicamentos, de coletar, além de HIV, Sífilis, Hepatite e um monte de outros. Plano de saúde cobriu só alguns.\n\nEmbrioscope (R$ 1.870, opcional):\nEles gravam um time-lapse os teus embriões crescendo, dão nota para os melhores e você descarta os ruins. Dessa maneira evita implantar embriões que gerariam perda.\n\nAnestesia (R$ 715):\né pago diretamente para o anestesista que vai trabalhar no dia da extração dos óvulos. A retirada dos óvulos precisa de anestesia total, já a implantação do embrião não precisa de nenhuma anestesia. \n\nBiópsia (R$ 3.000, opcional):\nAcho que foi uns R$ 1.500 por óvulos pois fizemos em dois. É um exame de DNA direto no embrião. Detecta problemas genéticos que gerariam aborto e doenças. Pode ainda escolher o sexo. Pode detectar síndromes tipo síndrome de Patau, síndrome de Edwards, síndrome de Down, Hemofilia, Turnner e outas coisas. Inclusive se você tem uma síndrome genética que passa pra filhos homens e não mulher, você pode selecionar só embriões mulher para não dar continuidade à tua síndrome.\n\nColeta, cultivo e implantação dos óvulos (R$ 24.000):\nNo mesmo dia coleta-se vários óvulos da mulher e também o esperma do homem. O material vai para o laboratório para ser cultivado. Durante os próximos 7 dias eles vão te informando quais embriões deram certo. Os bons são congelados. Daqui uns 2-6 meses a clínica vai monitorando a mulher para saber o melhor mês de implantar. Dos nossos 15 óvulos extraídos, apenas 4 viraram embrião, apenas 2 tiveram nota boa, 1 foi implantado e virou bebê, 1 ficou congerado pro futuro.\n\nCongelamento (R$ 2.500):\nCusto inicial pra congelar todos os embriões que sobraram, depois tem uma mensalidade de R$ 120.\n\n\nOutras opções pra engravidar:\n\npegar um óvulo doado de outra mulher, pegar esperma doado de outro homem ou pegar um embrião já pronto outro casal. A clínica tem um software que encontra doadores fisicamente parecidos com você (usam fotos de criança dos doadores e também suas). Em São Paulo, que tem doadores de tudo quanto é tipo, é fácil achar alguém parecido com a tua família. Mas pode pegar também óvulo da irmã, esperma do primo. Uma prima minha optou por doação de óvulo de outra mulher, mas usou o esperma do marido, deu bem certo.\n\n\nFAQ\n\n\nEssa porra é muito cara, não tem outro jeito?\n\nEscolhemos uma das clínicas mais caras de São Paulo. Os valores são menores em outros lugares. Decidimos por uma cara pois eles trabalham meticulosamente com o casal, com base em estatísticas, são muito atualizados nos estudos de fertilização in vitro. Na nossa clínica preferem implantar apenas um óvulo por vez. Já em clínicas mais baratas, implantam vários esperando que só um nasça. Mas as vezes nasce tudo. Os três óvulos que minha amiga implantou deram certo, nasceram 3 numa gravidez só. Além disso nós pagamos por exame de DNA e embrioscope, encarece um monte, mas reduz a quantidade de abortos.\n\nTem que pagar mesmo essa implantação aí de 20 mil mangos?\n\nExiste uma opção mais barata sem pagar implantação: a mulher toma o medicamento pra descer vários óvulos e transa em data marcada, torce pra dar certo. Mas sei também que há clínicas que implantam por R$ 10 mil.\n\nPlano de saúde não paga?\n\nOs planos deveriam pagar, mas o entendimento jurídico atual da empresas de saúde é que nos caso de infertilidade o cliente tem mais é que se foder sozinho mesmo. Há discussão na justiça, mas nada concreto - alguns ganham, outros perdem.\n\nTu é muito otário, quem é que faz filho nesse mundo caótico??\n\nKkkkk. Mas o guri é tão bonitinho. Precisa ver ele de pijama brincando de carrinho com o papai aqui. \n",
        "num_comments": 108,
        "comments": [
            "Caramba. Meu caso foi uma abobada de 3 min e nasceu uma, no outro foi uma brincadeirinha nasceu outra  \n\nAgora mantenho 3m da minha esposa a todo tempo",
            "Dinheiro é pra isso. Vc tinha um problema, tinha a grana (pq soube juntar/fazer), foi lá e usou.\n\nFelicidades à família e mt saúde ao neném.",
            "Comigo foi uma rapidinha de 30s no banheiro dos meus pais bebâdo no fim do carnaval, agora tenho uma princesa que só usa Pampers e come aproximadamente 10kg de comida por dia.",
            "caraca duas leitadas e ta feito aqui",
            "Achei interessante essa parte do estudo genético. Tenho um cagaço do caralho de gerar uma criança com problemas, ainda que sem qualquer fundamentação para isso (tirando o fato de minha esposa já ter 33 e a gente não se imaginar engravidando antes dos 35/36 dela).",
            "Amigo... Que caro. Onde foi isso? Fiz todo esse rolê 1x só (graças a Deus), com exame genético e congelamento e etc, e ficou na casa dos 30 e poucos mil. Em uma clínica top de SP.\n\n...e olha que no Brasil é beeeem mais barato que em outros países (EUA e Ásia).",
            "Parabéns pelo neném! A tecnologia é tão fantástica, né?",
            "É caro mas você garante um filho saudável estilo Gattaca vs tentar a sorte.",
            "Que ele dê valor a vida, OP. Pois foi concebido com muito esforço e amor.\n\nAlguém encomenda alguma clínica no RJ?",
            "Enquanto isso varios cara ganhando filho de outro e ainda separa"
        ]
    },
    "Por que o BACEN interviu no câmbio em 2022 durante as eleições, mas não intervém agora? ": {
        "title": "Por que o BACEN interviu no câmbio em 2022 durante as eleições, mas não intervém agora? ",
        "score": 4,
        "url": "https://www.reddit.com/r/investimentos/comments/1dre0iq/por_que_o_bacen_interviu_no_câmbio_em_2022/",
        "content": "Título",
        "num_comments": 5,
        "comments": [
            "porque o que tá ocorrendo está com o aval do banco central pra “penalizar” a demora na correção do fiscal. geral sabe que é manobra especulativa, mas aumento no câmbio preocupa muito brasileiro (com razão) e aumenta a pressão da sociedade por medidas de austeridade.",
            "É diferente, eles gostavam do antigo presidente e tudo bem queimar reserva de dólares quando vc gosta quem tá no poder",
            "Estão vendendo dolar pra enriquecer e depois vão corrigir o \"problema\"",
            "Para guardar a carta na manga para as próximas eleições?",
            "não contente em simplesmente não intervir vive mandando indiretinha e recadinho via mídia"
        ]
    },
    "‘Tiro pela culatra’: entenda por que anúncios de imóveis acima do preço ideal afastam interessados | Exame": {
        "title": "‘Tiro pela culatra’: entenda por que anúncios de imóveis acima do preço ideal afastam interessados | Exame",
        "score": 63,
        "url": "https://exame.com/mercado-imobiliario/tiro-pela-culatra-entenda-por-que-anuncios-de-imoveis-acima-do-preco-ideal-afastam-interessados/",
        "content": "\"Estudo do QuintoAndar mostra que 37% dos imóveis para aluguel e 54% dos colocados à venda são sobreprecificados\"\n\n\"O estudo mostrou que mais da metade (54%) dos imóveis anunciados para venda estão acima do preço recomendado pela plataforma.Quando o assunto é aluguel, 37% dos anúncios também extrapolam o preço. O cálculo é feito a partir de informações como metragem, tipologia, localização, valor do condomínio e IPTU, que, comparadas aos dados da base do QuintoAndar, informam uma faixa de preço ideal para o imóvel em determinadas condições.\n\nPara aqueles que decidem colocar os preços lá em cima, a consequência pode ser uma demora maior em alugar ou vender o imóvel. A pesquisa avaliou que somente dois em cada 10 imóveis em aluguel e menos de 3 em cada 10 imóveis à venda têm contratos fechados com o valor acima do recomendado pelas ferramentas de precificação do QuintoAndar.\"",
        "num_comments": 75,
        "comments": [
            "Isso é bom sinal. Tem gente que perdeu a noção no preço dos imóveis",
            "Pessoal se acha \"o negociador\" joga o preço 2 vezes o valor do local. Resultado, ninguém nem olha. Eu nem vejo quando o aluguem tá muito a cima da região.",
            "Isso resume bem a diferença de \"querer vender\" e \"precisar vender\" o imóvel. Tem muito proprietário que reside no apartamento e pensa : \"Sei que o imóvel vale no máximo 500k, mas como não tenho intenção de sair daqui, vou anunciar por 900k. Se algum idiota comprar, eu vou embora. Caso contrário permaneço de boa.",
            "Cada vez sinto que a \"fipe\" imobiliária não é uma má ideia.... Tanto vai ficar mais evidente os preços doentes, quanto vai ficar mais caro vc largar ele lá pra especular",
            "Bem legal.\n\nO time de dados so QuintoAndar é bem competente.",
            "Tem muito imóvel no Brasil que não vale a metade do que custa. E em grandes cidades costuma ter **muito** imóvel vazio, mesmo assim os preços altos continuam. Tem mais imóveis vazios que gente morando na rua no Brasil. Comprar o primeiro imóvel parece cada dia mais difícil. O poder de compra das pessoas não acompanha a especulação imobiliária. É um emaranhado de coisas que fazem esses preços ficarem fora da realidade para um país onde **90%** da população ganha menos de R$ 3.000 por mês. Brincadeira, viu...",
            "Preço muito acima do mercado geralmente sinaliza que o vendedor é um idiota e não vale a pena perder tempo com ele. Geralmente são aqueles imóveis que ficam décadas até serem vendidos.",
            "no prédio onde eu moro o AP eram anunciados a 295k\n\ndo lado, absolutamente do nada, apareceu UM anúncio de um apartamento a 405k. e agora estão aparecendo outros com esse preço.",
            "Interessante. Comentei isso esses dias com um amigo, mas apenas com base na minha percepção. Legal saber que tem uma base. \nAcredito que a razão por trás disso é que os detentores de imoveis não tem pressa para alugar e/ou vender... aí colocam o preço que querem (no caso, superior ao valor real) e ainda assim conseguem fechar negócio, só demora mais...",
            "Eu quando fui comprar um terreno, fui atraído por uma oferta abaixo do valor. Uma vez la, vi que o terreno era furada e me ofereceram outros. Pasmem, teve um que tava 5x o preço do anunciado. Fizeram desconto ate chegar a 2x do valor. Nao comprei. Nao sei como vende desse jeito"
        ]
    }
}