{
    "Daily General Discussion and Advice Thread - June 29, 2024": {
        "title": "Daily General Discussion and Advice Thread - June 29, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/investing/comments/1dr70vy/daily_general_discussion_and_advice_thread_june/",
        "content": "Have a general question?  Want to offer some commentary on markets?  Maybe you would just like to throw out a neat fact that doesn't warrant a self post?  Feel free to post here! \n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions, you should include relevant information, such as the following:\n\n* How old are you? What country do you live in?  \n* Are you employed/making income? How much?  \n* What are your objectives with this money? (Buy a house? Retirement savings?)  \n* What is your time horizon? Do you need this money next month? Next 20yrs?  \n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)  \n* What are you current holdings? (Do you already have exposure to specific funds and sectors? Any other assets?)  \n* Any big debts (include interest rate) or expenses?  \n* And any other relevant financial information will be useful to give you a proper answer.  \n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq\nAnd our [side bar](https://www.reddit.com/r/investing/about/sidebar) also has useful resources.  \n\nIf you are new to investing - please refer to Wiki - [Getting Started](https://www.reddit.com/r/investing/wiki/index/gettingstarted/)\n\nThe reading list in the wiki has a list of books ranging from light reading to advanced topics depending on your knowledge level. Link here - [Reading List](https://www.reddit.com/r/investing/wiki/readinglist)\n\nCheck the resources in the sidebar.\n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered investment adviser if you need professional support before making any financial decisions!",
        "num_comments": 7,
        "comments": [
            "I am in my 40s and totally new to investing. I have about 250k and recently had a good conversation with a fiduciary at Captrust and was considering hiring them for 1%. However, Im also thinking about just buying a few investment funds and going it alone. The Bogle approach. I already opened a brokerage account at Schwab and maxed out a Roth IRA, Im now debating on just opening a national and global ETF and being done with it. Im not too worried about it going down. I realize there will be ups and down along the way, its just for retirement. As well as managing my portfolio, would the fiduciary also manage my tax concerns? Thanks!",
            "Why is PYPL down?\n\nAlso, I saw a number of Ethereum ETFs on Robinhood, even though I thought they weren't available yet. Can someone explain what they are and what they do?",
            "I have found if you do not have an complex situation like just have a job want to stick away money for retirement some financial advisor is not needed if you have display\n\nYou already seem to understand the bogle approach what means you are not clueless about investing. Some will help with taxes and tax planning but as far as filing your taxes you would have to ask them",
            "You will probably need to specify your country\n\nBrokerages like banks are highly regulated and not all brokerages service all countries. Then there are some tax considerations depending on the country you are in , like can you buy an accumulating fund that does not generate dividends because it internally re-invests them",
            "PYPL not sure , my guess is there is little moat . You have things like google pay, apple pay , zelle , probably other services \n\nHowever the Ethereum funds you see probably track the pricing using futures contracts vs holding the actual coins",
            "Oh sure. Added the country - Lithuania",
            "So Ive been researching alot. It seems that most tutorials are for people who at least understand the very basics.\n\nI have some very basic questions.\nSo say I want to start putting part of my salary into S&P500 maybe NASDAQ100 and that kind of thing.\n\nHow would I go about this?\nAs I understand I first need a broker? How can I choose the right broker?\n\nWill my broker also allow me to do trading as well as investing or do I need separate brokers for this?\n\nAlso what about the trading app? I know most people use MT4 or 5 or Trading view for trading? But what about for long term investments? Do I use the same apps or is there a different way I should go about this?\n\nAlso how do I reinvest the earnings. Say if Im holding S&P500 long term and I want to reinvest what I earned and buy more of the index. Do I just sell that portion and buy more for the money? Or is there some automation which can reinvest for me?\n\nAs you can see I am a complete complete beginner. I would really appreciate some help. \n\nThank you very much!\n\nEdit I am from Lithuania"
        ]
    },
    "America’s Frozen Housing Market Is Warping the Economy": {
        "title": "America’s Frozen Housing Market Is Warping the Economy",
        "score": 126,
        "url": "https://www.reddit.com/r/investing/comments/1dr1l96/americas_frozen_housing_market_is_warping_the/",
        "content": "Cheap mortgages are forcing millions of U.S. homeowners to stay put. That is becoming a problem well beyond the property market.\n\nhttps://www.wsj.com/economy/housing/americas-frozen-housing-market-is-warping-the-economy-35e4f0e5\n\nIf you locked in a dirt-cheap mortgage when interest rates were low, congratulations for being one of the winners in America’s skewed housing market. Renters, realtors and recruiters are among those getting the raw end of the deal.\n\nHigh interest rates have had an unexpected impact on U.S. housing. Instead of triggering a fall in home prices, as happened with commercial real estate, costlier mortgages have pushed residential values higher. The value of the median existing home rose to a record $419,300 in May, according to the National Association of Realtors. Before the pandemic, it was $270,000. \n\nBlame the “lock-in” effect of ultracheap mortgages secured when interest rates were low, which are trapping owners in their homes. It is an unforeseen consequence of years of easy money. Two-thirds of outstanding U.S. mortgages have a rate below 4%, according to Morgan Stanley’s housing strategist Jim Egan. Were these homeowners to move, they would have to pay close to 7% for a new 30-year mortgage. The gap hasn’t been as wide since at least the late 1980s.\n\nCompounding the lock-in effect, most people have fixed-rate mortgages today. More than 90% of newly issued home loans in recent years were 30-year fixed-rate loans, compared with two-thirds in the run-up to the 2008 housing crash.\n\nAs more owners stay put, the number of homes on the market has fallen. Tight supply is pushing prices higher, shrinking the pool of buyers who can afford a home. A household earning $100,000 a year can only afford 37% of home listings today, according to the NAR. In a balanced market where there is around five months’ supply of inventory available the number should be 62%.\n\nThe frozen housing market has economic consequences. Spending linked to home sales has dropped. People normally splurge to fix up houses before putting them on the market or to renovate them after they move in. Work has dried up for professionals handling the logistics of transactions, such as attorneys and real-estate brokers. Together with the construction of new homes, these activities normally account for 3% to 5% of U.S. output, the National Association of Home Builders estimates.\n\n\nThe flip side is that millions of households that are locked into cheap mortgage rates can afford to spend elsewhere. They are feeling flush thanks to the $119,000 of additional equity the average U.S. mortgage holder has accumulated over the past four years. This may be one reason why consumer spending has been so resilient in the face of higher interest rates, making it harder for the Fed to bring inflation back to its 2% target. \n\n\nA less obvious loser is the U.S. labor market. Workers are reluctant to accept job offers in another state if it means sacrificing low housing costs, so labor mobility has taken a hit. One study by economists at the University of California Irvine and UC Berkeley estimates that the lock-in effect discouraged 660,000 moves to a new zip code over the year through June 2023.\n\nCraig Picken, co-founder of Northstar Group, a search and recruiting firm of top talent in the aerospace sector, said that it had become difficult to match companies with the right executives because relocations have financial costs that neither employees nor employers want to shoulder. He gave the example of a vice president of engineering trapped in a “toxic and bureaucratic” workplace with a long commute who nonetheless turned down a new role because he had an existing 3% mortgage.\n\n“His decision came down to an Excel spreadsheet…The salary increase he’d get with the new job was eaten by higher mortgage costs,” says Picken.\n\nAnother impact of the lock-in effect is that America’s new homes are shrinking. Houses constructed in 2023 were 5% smaller than those built two years earlier. Builders are trying to keep new homes as affordable as possible for first-time buyers, but the trade-off is less space.\n\nSome housebuilders are winners from the supply crunch, specifically large builders like D.R. Horton that have lending arms. They can use excess profit from high home prices to subsidize buyers’ borrowing costs through mortgage buydowns. They are also less reliant on bank loans to finance construction than smaller rivals. This is one reason why the market share of publicly traded home builders jumped to 51% last year, up from 41% in 2021, according to data provider Zonda.\n\nIn theory, if people can’t afford to buy their own homes, landlords should be able to charge more. Rents for individual family homes rose 3% in April compared with a year earlier, according to CoreLogic data. But rents on apartments are barely rising because there is a glut of new supply, offering some relief for tenants for now.\n\nHow long could complications caused by the lock-in effect last? Thomas Ryan, economist at Capital Economics, thinks mortgage rates would need to fall closer to 5% for supply to start to normalize. Most projections are for the 30-year rate to be around 6% by the end of 2025. Even at this level, two-thirds of existing homeowners would still have a mortgage in place that was at least 2 percentage points cheaper.\n\nSome homeowners may decide that they can’t delay big life decisions. Divorces and growing families will always force some people to sell up. But this will only boost supply on the margin. The strangest housing market in decades won’t improve soon.\n\n---\n\nI would just add that housing is easily one of the largest sectors in the economy, and that for most people, their house is by far their most valuable asset.  Back in the 90s and 00s, equity loans from homeowners propelled the stock market to new highs, and may also be partially responsible for the stock market's recent performance post-covid.",
        "num_comments": 146,
        "comments": [
            "Did I just actually read something that says realtors are VICTIMS?  Are you kidding me?",
            "This is me. We moved for a grad program, started a family, want to move back home but it just doesnt make sense to walk away from 3%. If we move, it wont be for financially sound reasons.",
            "I honestly think this effect will be more temporary than people think. People move or die eventually, and there are so many factors that go into moving, that I think more people will let go of their once-in-a-lifetime rates than some worry.",
            "\"Another impact of the lock-in effect is that Americas new homes are shrinking. Houses constructed in 2023 were 5% smaller than those built two years earlier. Builders are trying to keep new homes as affordable as possible for first-time buyers, but the trade-off is less space.\"\n\nThis isnt as much of a downside as they are trying to make it.  Builders have been going larger to squeeze more profits out of each building",
            "Rent price on apartments are stagnant as a result of people already living below their means in quality while paying double in price. How can you raise prices when you aren't attracting tenants at your current price? Businesses in the housing industry need to stop looking at lowering prices like it's losing money and start looking at it as the single greatest opportunity to undersell their competition while still making money.",
            "I like how this article completely ignores the 30%+ of homes being bought up as investment properties. In my area we have entire neighborhoods being built to rent.\n\nIn the 2021-2022 time frame, in my area new homes were being bought, held for 18 months and resold. No one ever moved in it, just went from one institution to another.",
            ">He gave the example of a vice president of engineering trapped in a toxic and bureaucratic workplace with a long commute who nonetheless turned down a new role because he had an existing 3% mortgage. His decision came down to an Excel spreadsheetThe salary increase hed get with the new job was eaten by higher mortgage costs, says Picken.\n\nSo a company passed on a candidate because they wouldn't let him WFH, yet somehow it's our fault? Bro fuck these economists and fuck these companies.",
            ">If you locked in a dirt-cheap mortgage when interest rates were low, congratulations for being one of the winners\n\nI stopped reading after this as this is just whining and I don't take any investing advice from feelings.",
            "I pay less in rent than interest ",
            "Have you seen the houses theyre building now? Cheap AF garbage and charging out the ass, pisses me off how they are ripping off younger people and they have no choice"
        ]
    },
    "Has everyone else seen what has happened to NKE today?": {
        "title": "Has everyone else seen what has happened to NKE today?",
        "score": 80,
        "url": "https://www.reddit.com/r/investing/comments/1dr1x7y/has_everyone_else_seen_what_has_happened_to_nke/",
        "content": "19+% decline and is reportedly the largest single-day decline ever in the company's history. I guess all of the \"sneakerheads\" are tapped out and out of money in this economy. This also isn't surprising considering there are loads of up-and-coming competitors that provide a way better value for consumers in this space such as Hoka, On and Under Armour. Speaking of apparel, $ANF is reportedly making an amazing comeback.",
        "num_comments": 104,
        "comments": [
            "Lmao UA is in a worse spot than Nike. They'll be bankrupt in 10 years.",
            "I realize that by a lot of value metrics, Nike still isn't a buy. It doesn't stand out by free cash flow, P/E, PEG, etc., etc. With that said, I am pretty interested now. We're in an era of overly optimistic guidance so any time a company is more pragmatic, they get annihilated in the short term. I think their revenue will continue on its steady trajectory. They have a shitton of brand value. Nike isn't going anywhere no matter how objectionable some of their business practices are. There is no reason to think they'll stop being the premier sports brand anytime soon.\n\nIt might actually be a prudent move for companies to get ahead of the market with this type of guidance, because I have a feeling that this era of good vibes is going to have a crash landing for a lot of companies that have been telling investors that they will have exponential growth curves the past few years. Companies that are willing to take their licks now and revise future estimates down are probably going to take less of a beating when reality sets.",
            "This is an easy buy for me,  Nike will bounce back. There was a 45 minute line to get into the Nike factory in Amsterdam on a Tuesday morning. They are a global powerhouse and always will be.",
            "Their $200 air max squeak when walking. I tried 3 pairs, fuck em.",
            "Wow, that's a huge dip. I won't be buying though, as I've been anti-Nike for quite some time due to their antics in Track and Field.",
            "Better believe Im buying the dip",
            "Competition yesbut not sure Id call Hoka or On better value as stock or shoes. They definitely have the growth and long runways to grow their market share for a few more quarters or years.\nNike always carried a premium with that brand name and clearly there are upstarts who have disrupted Nike. To me we are seeing similar trends with other household brand names like LULU and SBUX",
            "If you look at their actual report, its because theyre expecting sales in China to be way down",
            "I will gladly take your shares under $80. This is an incredible time to get into one of the top brands in the world. Jordan, Kobe, Lebron, CR7, so many other generational talents forever linked to the Nike swoosh. They are the official suppliers for the Olympics, NFL, NBA, MLB they arent going anywhere.",
            "Haven't used Nike in a while due to the downhill in quality, but Hoka's really ugly, and ON shoe quality is not that great, but it has decent look. I don't know anyone who ever wore Under Armour. Adidas is really the only decent one among the publicly traded."
        ]
    },
    "Working 24/7 with zero cost of living.. ": {
        "title": "Working 24/7 with zero cost of living.. ",
        "score": 26,
        "url": "https://www.reddit.com/r/investing/comments/1dr6ny3/working_247_with_zero_cost_of_living/",
        "content": "I work 9-5 and am paid to be on call for emergencies 24/7. I do get called in nearly every day. I live in a studio at work for free and have maybe half a years worth of canned food/ jarred nuts and beans/ and a deep freezer of meat. (From family that has moved).\nOnly thing I really would need to buy is vegetables. I don’t pay internet. I drive a 2012 Prius but rarely drive. My only frivolous spend is a Spotify account. I eat out maybe twice a month.\nAnyways, this is all for the hopes of someday being a homeowner. \nBut I see it would probably be wise to invest rather than horde it all waiting for a buying opportunity. \nCurrently saving about 95% of my pay.\n",
        "num_comments": 47,
        "comments": [
            "Find a nice balance in life, no one is guaranteed old age.",
            "No offense,  this sounds depressing af",
            "If you think about it, you can 4x your expenses and your savings amount would only drop about 15%.",
            "Go Down to 90 %. Its okay",
            "Personally it sounds like a great opportunity. \nIf it were mei would out 50% of the savings in a HYSA for the house, I would max out a Roth IRA or Roth 401k if available, and I would start an investing account with the remainder. Research a couple good ETF and sleep good!",
            "As someone who has lived like you, down to even the 2012 Prius, itll be a tough and lonely road. I did it to pay off student loan debt and to own a home, both of which I did. The price paid was more than just time and health If you can stick it out, dont lose yourself in the end.",
            "Humans can go a month without eating. You could sell half your beans for increased savings",
            "Bro go live your life. Travel, hang with friends, drink some beers\n\nLife is too short to live like this",
            "Cash is trash. You can get 5% in a hisa wish no risk",
            "Why is home ownership that important to you?"
        ]
    },
    "Investing in the new climate": {
        "title": "Investing in the new climate",
        "score": 6,
        "url": "https://www.reddit.com/r/investing/comments/1dr9eyp/investing_in_the_new_climate/",
        "content": "Looking for advice:\n\n\n\nThe Supreme Court rulings are making it difficult for me to choose investments.  Regulation is apparently no longer a thing, which is bad because now companies have the expense of accounting for 50 state-level regulatory agencies.  However, bribery is now legal, which means that once any legislator or judge makes a favorable ruling, they can spin around the iPad to get their tip/ \"gratuity\", which will be favorable for larger businesses that can afford the payola.  I am currently seeing it as a net negative (stock markets hate uncertainty, and this is two body blows in a week) and am shuffling most investments overseas.  However, any other perspectives would be welcome and invited.",
        "num_comments": 14,
        "comments": [
            "Regulation is most definitely still a thing.  OSHA and the EPA are alive and well.  And my girlfriend is an accountant and she assures me that financial regulations are as burdensome as ever.",
            "Lol. What are you smoking?",
            "You need to step back from the liberal media trying to get you thinking that the world is going to end if anything doesnt go their way.  All the Chevron ruling did was to say that if the written law is unclear, that regulatory agencies cant make up whatever rules they want and treat it as law.  Hopefully it will make Congress actually do their job for once and pass legislation that clearly defines the law and what the agencies are entitled/obligated to enforce.  \n\nIm not sure what youre referencing regarding bribery but campaign contributions are not a new idea.",
            "Especially if what you wrote guides your investment strategy",
            "Well, obviously it's going to take some time to remove the regulations, this won't be immediate.  The SEC just got massively curtailed, so I forsee an era where Enron and Bernie Madoff imitators have carte blanche.",
            "Snyder v. United States, No. 23-108  The upshot of this case is that you can only bribe officials after they comply with your wishes, but not before. It guts most corruption laws.  \"Gratitude\" is allowed.",
            "Lol. For real. These kids today.",
            "Lol. You cant be serious.",
            "Im not a fan of bribery at all but I doubt theres going to be a massive sea change that affects the country enough to change your investment strategy.  You can already make campaign contributions, buy overpriced artwork from your favorite politicians son, or donate to a family foundation that employs their children, etc.",
            "What is your take on the rulings this week?"
        ]
    }
}