{
    "Weekly 'What Should I Buy' and Order/Shipping Thread": {
        "title": "Weekly 'What Should I Buy' and Order/Shipping Thread",
        "score": 2,
        "url": "https://www.reddit.com/r/iphone/comments/1dhuvdd/weekly_what_should_i_buy_and_ordershipping_thread/",
        "content": "Welcome to the weekly stickied WSIB thread.\n\nHave any questions about buying, selling, trading, or giveaways? Ask away! Please remember to adhere to our rules, which can be found in the sidebar. As usual, if you have a serious issue with the subreddit, please contact [the moderators directly](https://www.reddit.com/message/compose?to=%2Fr%2Fiphone).\n\n&#x200B;\n\nThis thread is also for questions about preorders and shipments of devices\n\n**Note: Comments are sorted by /new for your convenience.**\n\nHere is an [archive](https://www.reddit.com/r/iphone/search?q=title%3A%22What+Should+I+Buy%22+author%3A%22AutoModerator%22&restrict_sr=on&sort=new&t=all) of all previous \"What Should I Buy\" threads. This is best viewed on a browser. If on mobile, type on the searchbar \\[title:\"What Should I Buy\" author:\"AutoModerator\"\\] (without the brackets, and including the quotation marks around the title and author.)",
        "num_comments": 84,
        "comments": [
            "Is overheating still an issue on iPhone 15? also is it just on the pro model or all models have this issue?",
            "I've been watching and reading a lot of phone reviews lately and been planning on switching from Android to ios, what's the best value iphone in 2024? Many reviews say it's the iphone 13 pro... but I'm not really knowledgeable on ios devices.",
            "Currently have an iPhone 12 but the battery health is at 81% currently and noticeably drains really quick. Apps often freeze for a couple seconds as well. Was planning on getting the iPhone 15 plus. Is it better to get that now or get a battery replacement and then wait til September for the discount?",
            "Hi!\n\nI'm thinking about switching from Android to iOS and I'm curious to know how they hold up on the long term.\n\nSo, for people who still uses an older iPhone (13 and older):\n\nHow long does your battery lasts and do you experience any lags, stutters or bugs?\n\nAlso, I'm currently using a low/mid-range Android and I live in a country where iPhones are extremely expensive; should I get the 15PM now or wait for the newer model?\n\nThanks in advance!",
            "I have an 11 Pro Max that has been super slow and wonky lately. My battery health/capacity says 75%, but I believe it is actually much lower than that. I used to be able to go days without charging. \n\nAre the anticipated/rumored upgrades from 15 to 16 worth delaying my purchase until the new release?",
            "I found an iphone 14 pro max on facebook marketplace (used and slightly dirty) for £75. Is this a scam?",
            "I have an iPhone X.  I want to upgrade.  What should I get?",
            "So my 11pro just took a total shit, the battery has been degrading, but the TrueDepth got destroyed. Got caught in rain this weekend and apparently the water resistance completed failed. Additionally, the charging port is fucked. Constantly disconnecting and reconnecting.\n\nneed a new phone, been thinking of getting the 15pro from costco for 1269 when back in stock as it comes with applecare+ which maybe I should do since I am clumsy. Could also get it from apple, since costco does not carry the blue color.\n\nWas also thinking of swappa, and maybe get a 12-14pro? Thought theyre a bit expensive, checked apple refurbished and 800 for a 12 or 13 pro refurbished is..potentially too much?\n\nWhat do y'all think? I tend to keep my phones for a while but I somehow ALWAYs ,manage to break them around the 4-6 year mark :(",
            "Currently have an iPhone 11 Pro Max with about 75% battery life. It’s been a bit laggy recently and dies pretty quickly. Thinking of upgrading. Is it worth waiting for the iPhone 16 pro max or should I go ahead and get the 15 pro max?",
            "So basically my Iphone X is currently getting outdated, and my parents have given me a challenge. My Dad had an Iphone 13 Pro max, which he had used originally for around a year or two and instead decided to upgrade. I don't really prefer large phones like the Pro max, so im thinking about either trading the Pro max in for it, or my second option is selling the phone somewhere like Ebay or anywhere else.  Its in very good condition, any ideas on how much i should sell it for? Im looking to get the extra money from selling it and buying an Iphone 13 Mini and having that spare cash. However this may take time and i think about just trading it in, although im confused on wether or not i'll get extra money. Getting back to the question though, how much should i sell it for offhand?"
        ]
    },
    "Weekly iOS Battery Support Megathread": {
        "title": "Weekly iOS Battery Support Megathread",
        "score": 3,
        "url": "https://www.reddit.com/r/iphone/comments/1dl3rq5/weekly_ios_battery_support_megathread/",
        "content": " \n\n**General advice for those concerned about their battery from the Support FAQ Wiki:**\n\n**Battery health**\n\nBattery health depends on usage and a variety of other factors. It is normal to see a decrease in battery health by 7-10% per year, resulting in a battery health of 80-85% after 2 years. This number can fluctuate, remain the same, or decrease quickly over a small period and should not cause undue concern.\n\nApple recommend battery replacement when your device falls below 80% battery health if you notice reduced battery life. If it falls below 80% within the first year you may be eligable for a free battery replacement. It fails after your warranty, it's a $69-$89 USD replacement cost for a battery. Contact Apple Support [here](https://getsupport.apple.com/solutions).\n\nYou can find more information about battery health and performance from Apple [here](https://support.apple.com/en-gb/HT208387).\n\nYou can check the cycles count with [Coconut Battery for Mac](https://coconut-flavour.com/coconutbattery/) or [iCopyBot for Windows](https://www.icopybot.com/download.htm).\n\n​\n\n**Battery life**\n\nIssues relating to battery life can be categorised in three ways:\n\n1. Normal battery life that is to be expected due to use\n2. Reduced battery life caused by a recent update, iOS indexing, an iOS bug, or a third-party application\n3. Reduced battery life, or other abnormalities such as overheating or sudden power-off, caused by device or battery aging\n\nIf you experience issues with your battery:\n\n1. Check your battery health. If it is below 80% or you are experiencing issues you suspect are related to device or battery age, see [Apple Support](https://support.apple.com/).\n2. If you have a new or recently updated/restored device, wait a number of days for background process to complete. If you continue to have issues, wait for a further iOS update. If you are on iOS Beta, you can expect to have a decreased battery life.\n3. Review the advice below on [maximising battery life](https://www.apple.com/uk/batteries/maximizing-performance)\n4. Consider restoring your device.\n5. If issues persist, contact [Apple Support](https://support.apple.com/).\n\n​\n\n[Maximising battery life](https://www.apple.com/uk/batteries/maximizing-performance) \\- the amount of time your device runs before it needs to be recharged.\n\n* Use low power mode (This reduces mail fetch, turns off background app refresh and increases the auto lock timer)\n* Remove apps from background app refresh\n* Ensure auto lock is on\n* Turn off auto brightness and manually reduce brightness\n* Use dark mode if your device has an OLED display\n* Clearing background apps from the app switcher does not improve battery life\n\n​\n\n[Maximising battery lifespan](https://www.apple.com/uk/batteries/maximizing-performance/) \\- the amount of time your battery lasts until it needs to be replaced.\n\n* Avoid extreme temperatures\n* If you notice that your iPhone gets hot when charging, remove it from its case\n* Store your iPhone in a cool place, switched off, and half-charged if not using it for long periods - and charge it every 6 months when in storage",
        "num_comments": 4,
        "comments": [
            "If you're looking for help or support, you should search for your issue on Google, the [Apple Support Community](https://discussions.apple.com/welcome), r/iPhone and the [iPhone Support FAQs](https://www.reddit.com/r/iphone/wiki/support-faq/). We review submissions for quality, so basic support issues may be removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/iphone) if you have any questions or concerns.*",
            "My iPhone 14 Pro Max batter decreased from 98% to 94% within 3 weeks, is this normal or is there something wrong?",
            "Hello,\n\n1. How come iOS doesn't automatically tell users of the battery health going under 80%? I never saw them in both old iPhone 11 Pro Max and 12 mini.\n\n2. How many times have you changed your batteries in each iPhone so far and how long between?\n\n3. How low did you let your iPhone's battery health go before replacing it? \n\n4. Where did you replace your batteries? From Apple? An authorized Apple service provider (e.g., Best Buy)? A third party? Yourself?\n\nThank you for reading and hopefully answering soon. :)",
            "My iPhone 14 has 85% battery health after 1yr and 7 months. I always charged 40 - 80. Which percentage is  iOS goin to slow down the performance?"
        ]
    },
    "Iphone 4 disabled for 35 years": {
        "title": "Iphone 4 disabled for 35 years",
        "score": 563,
        "url": "https://i.redd.it/fxl76cm3nz7d1.jpeg",
        "content": "Found an old iphone 4 of mine. Plugged it in and found it is disabled for 18 million minutes (about 34.5 years). Any ideas on what i should do with it? I know getting into it without erasing it is likely impossible\n\n",
        "num_comments": 94,
        "comments": [
            "Just wait",
            "When it’s ready, you’ll look like this: 👴",
            "Now you have a good reason to live.",
            "That’s a 5 not a 4, also pop a SIM card in so it can sync the time from the network, it’ll then show a realistic time to wait if I remember right.",
            "How did you manage to capture astigmatism in a photo?",
            "The iPhone 4 has a terrific stabdby time but I’m not sure 9% will make it through those years. Plug it in for 15 mins to be safe.",
            "Check back when the iPhone 51 comes out.",
            "I know it’s entirely besides the point of this post, but man iOS 7 was special",
            "!remind me 35 years",
            "just be patient"
        ]
    },
    "AirDrop has become a complete shame  ": {
        "title": "AirDrop has become a complete shame  ",
        "score": 27,
        "url": "https://www.reddit.com/r/iphone/comments/1dls0w0/airdrop_has_become_a_complete_shame/",
        "content": "It seems as if nobody is really talking about it but AirDrop is working worse and worse with every update. For me and my friends, it’s only working in 25% of cases. Other than that you have to turn it on and off, reboot your phone and do other unpleasant things to make it work. I was hoping that it would be fixed with massive Dynamic Island update but it looks like it only got worse. \nAirDrop used to be one of those wow-things from Apple and it’s a shame that the lack of stability is killing the feature.",
        "num_comments": 30,
        "comments": [
            "I’m constantly airdropping between my phone Mac and iPad without issue and can send to my son’s iPhone without issue. Maybe you have a problem with the Bluetooth receiver?",
            "Works fine for me and my friends. We constantly share photos and videos with each other by just touching phones 'heads'",
            "Weird, it’s been working fine for me. I wonder why.",
            "Works fine, use it on the daily with my phone and work laptop/coworkers iPhones.",
            "Just switched from Pixel 7 Pro to 15 Pro Max. Switched the entire family. So far, AirDrop is one of our favorite features.",
            "Weird, it's been working better than ever for me, lately. Enter the share panel, hold the phones top against top, wait a few seconds for the indicator to go all the way, and the transfer starts & completes really fast.\n\nIt only fails if I forget to enable both WiFi and Bluetooth, so almost never.",
            "Never had an issue here airdropping to and from friend’s devices. We all have different iOS versions and phones too.",
            "Well I don’t have issues using devices which use the same iOS version. However, whenever I try to airdrop to older devices, it works 50% of the time.",
            "I have no issue.  I air drop between my iPhone devices regularly. ",
            "The devices must be updated to the same version to work all the time. Not sure why. It should just work."
        ]
    },
    "Apple Intelligence Features Not Coming to Europe at Launch Due to DMA": {
        "title": "Apple Intelligence Features Not Coming to Europe at Launch Due to DMA",
        "score": 409,
        "url": "https://www.macrumors.com/2024/06/21/apple-intelligence-europe-delay/",
        "content": "",
        "num_comments": 171,
        "comments": [
            "Do we know if it’s just the EU?",
            "Just in case people need more clarification with the EU law\n\n\n\nClear gatekeeper obligations across the EU\n\nThe new rules establish obligations for gatekeepers, “do’s” and “don’ts” they must comply with in their daily operations.\n\n\n\n\nExamples of the “DO’S” - Gatekeeper platforms have to:\n\n \n- allow third parties to inter-operate with the gatekeeper’s own services in certain specific situations;\n\n\n- allow their business users to access the data that they generate in their use of the gatekeeper’s platform;\n\n\n- provide companies advertising on their platform with the tools and information necessary for advertisers and publishers to carry out their own independent verification of their advertisements hosted by the gatekeeper;\n\n\n- allow their business users to promote their offer and conclude contracts with their customers outside the gatekeeper’s platform.\n\n\n\n\n\nExample of the “DONT’S” - Gatekeeper platforms may no longer:\n\n \n- treat services and products offered by the gatekeeper itself more favourably in ranking than similar services or products offered by third parties on the gatekeeper's platform;\n\n\n- prevent consumers from linking up to businesses outside their platforms;\n\n\n- prevent users from un-installing any pre-installed software or app if they wish so;\n\n\n- track end users outside of the gatekeepers' core platform service for the purpose of targeted advertising, without effective consent having been granted.",
            "Guess I’ll stick with my 14 pro max then instead of upgrading",
            "What the?!",
            "I wonder if this will cause their market share to drop ovee there in favor of samsung or soon google who haven't had this problem",
            "\n“Secure and private AI processing in the cloud poses a formidable new challenge. Powerful AI hardware in the data center can fulfill a user’s request with large, complex machine learning models — but it requires unencrypted access to the user's request and accompanying personal data. That precludes the use of end-to-end encryption, so cloud AI applications have to date employed traditional approaches to cloud security.”\n\nThis most likely has to do with the API and apple protecting it from 3rd party due to privacy concerns.\n\nNot to say I agree or disagree with the choice. Yet this is a con when you pass excessive regulations/overreaching laws. As Apple is its own company, it deems the right to protect itself.\n\nAgain I don’t agree, yet it makes sense on why there may be push back.",
            "So will Apple Intelligence never come to the EU or will it be delayed?\n\nEdit: And how come my S23 Ultra has AI features that apparently pose no threat for the EU?",
            "This is one of the few times the EU is pushing in favor of big companies instead of consumers. Apple should not allow third party entities from accessing our information... Yet the EU is forcing them to.",
            "First it not being available on 15 plus (A phone released in the last 12 months) now not in Europe. Feels pretty crappy being an Apple customer in the EU right now.",
            "Could you just set your region to US?"
        ]
    }
}