{
    "Welcome to Glastonbury": {
        "title": "Welcome to Glastonbury",
        "score": 410,
        "url": "https://i.redd.it/xqd1i1jnid9d1.jpeg",
        "content": "",
        "num_comments": 29,
        "comments": [
            "It's just Bury, not GlastonBury.",
            "Yeah, that's going to last all weekend\n\n![gif](giphy|PVfSR2nddzGz6)",
            "That's excellent.\n\nJust hope some cunt doesn't write \"London\" on it.",
            "That's superb. 👏👏",
            "Did you make this? Or is this a thing you can buy? Did you pay for this like?",
            "Nothing says republican like attending an iconic UK festival",
            "26+6",
            "Taylor Swift isnt playing there.",
            "The PC name is Bury/GlastonBury",
            "[deleted]"
        ]
    },
    "Mother died in Drogheda after 'freebirth' at home with no midwife or doctor present": {
        "title": "Mother died in Drogheda after 'freebirth' at home with no midwife or doctor present",
        "score": 483,
        "url": "https://www.thejournal.ie/maternal-deaths-ireland-2-6421898-Jun2024/?fbclid=IwZXh0bgNhZW0CMTEAAR2UDjtOTtMoZPV5LylK9iR9qVrLbOFdwROagge9D2WrLzN6WAnvmyEjFd4_aem_h5N0t83Eu-WpaCvSkCBGfg",
        "content": "",
        "num_comments": 478,
        "comments": [
            "From reading the article am I right in saying the hospital were pushing for a cesarean because a natural birth was too high risk so she decided to do the high risk natural birth anyway without any medical support?\n\n\nFirst of all, that's nuts, second, that doula should be charged and jailed if there is any proof she in any way encouraged this women to take this risk.",
            "2 previous c-sections and she decided to have a home birth? \n\nThat seems a crazy choice. \n\nRIP to that woman and condolences to her family.",
            "There's a reason childbirth without medical intervention used to kill people so regularly.",
            "Obviously absolutely heartbreaking for her family, but ffs. There's a reason we stopped birthing on piles of leaves in the woods.",
            "I hope whoever agreed to be her Doula is arrested and charged.",
            "> The doula who was present for Naomi’s labour told The Journal yesterday: “This is a very distressing time for all involved. Naomi was an absolutely sensational woman and birthed her baby boy with incredible power.\"\n\nWhat a weird comment in the circumstances. She still absolutely believes it was the superior course. The article says she ran a 'retreat' that Naomi and other pregnant women attended. Strong cult vibes.",
            "No words, she took what she thought was a calculated risk and paid with her life.",
            "I remember being in labour one night when a mammy and baby died in the room next to me. The howls of her husband I can still hear now 25 years later. I’ve had 7 kids, started with elective c section, banged out 5 with no pain relief, and finished with the rotunda saving mine and my babies life with an emergency c section. Never once, after how many babies, would I think it’s a great idea to give birth at home. Fuck whoever convinced that woman it was gonna be ok. I feel sorry for her babies.",
            "Childbirth is like a medically controlled car crash. Do it unsupervised at home and it’s just going to be a car crash. I’m sorry - and I know some women have bad experiences and want a less formalised setting. But in prior decades and centuries, childbirth was the leading cause of death for women. Turning your nose up at the medical profession is not safe.",
            "Mad to think that we progressed so far past the massive risk and occurrence of incidents of women dying in pregnancy that people now willingly try to avoid medical interventions at all costs."
        ]
    },
    "Sound people in Dublin City Centre": {
        "title": "Sound people in Dublin City Centre",
        "score": 232,
        "url": "https://www.reddit.com/r/ireland/comments/1dqu2qz/sound_people_in_dublin_city_centre/",
        "content": "Was walking back from BoCo on Bolton street today with the nephew and for some reason the pizza didn’t agree with him. He threw up on the corner of Bolton Street and Dominick Street. Thankfully he’s alright and it looked like something didn’t agree with him.\n\nI just want to thank the lads in Bros Barbers on the corner who gave him a bottle of water and the girl who gave us some hand sanitiser (you were in a pride T-shirt and with your friend heading into the city centre. I think you had black hair with some purple dye). I really appreciate your kindness and soundness in the moment. ",
        "num_comments": 40,
        "comments": [
            "This post was reported. \n\n> 1: This is the kind of shite users here want removed\n\nMaybe other users could use this as an opportunity to talk about other times strangers have helped them? \n\nPositivity instead of negativity! Mirth instead of misery!",
            "I was late for the dentist this morning and the parking ticket machine wouldn’t take my credit card. A woman getting into her car told me it was on the blink and rummaged around in her car and purse and handed me €1.50 unprompted. Absolute star!",
            "Sometimes we forget (with tabloid news, sensationalism and social media etc…) that 90% of people are absolutely sound.",
            "Was heading to Greenday last night, only booked tickets on Tuesday and the Luas shuttle was sold out. So we planned to get to Dundrum and walk, we got to Dundrum had a few pints and decided to head on. Asked to young lads did the know the directions to walk. Said our taxi will be here in five sure jump in with us. Absolutely sound young fellas.",
            "I was getting a heavy object out of the boot at B and Q to return it and a lad walking by offered to help so I wouldn't pull the rubber seal.\n\nWe then had a small chat about the object I was returning.\n\n(Bought a BBQ and then they started a sale, so returned it to get the sale price).",
            "I'm home for a holiday and was at the LCD gig in Malahide, soundest crowd I've come across at a gig in a long time. In the pit during Idles after every song everyone picked up dropped phones and wallets and held them in the air til the owners came to collect them. The vast majority of people are still bang on.",
            "Was in Dublin Airport last night and there was a foreign-looking bloke in the corner of a stairwell leading from the car park into the main arrivals hall. He was kneeling on a prayer mat praying in his language. \n\nA very big tattooed skinhead took off his cap while walking past the man and as he passed he respectfully and quietly said \"Peace be with you brother\".\n\nI, to my shame, automatically expected an altercation, but instead, my faith in humanity was restored.",
            "Oh this was my girlfriend! She's honestly always going out of her way to help people, if she can! I hope your nephew is feeling better!",
            "A lad crashed into the back of my car a while ago while I was stopped at the lights.  Some damage done to both vehicles.  \n\nWe both got out, took a look and sighed in unison.   In that moment I realised there is enough shit going on in the world that nobody should worry about some bent metal.  I said \"shit happens\".  He agreed.  We got back in our cars and went on with our journeys.",
            "I'm in Asia. Summer, temp is about 36 deg.  One of those fuckin days where everything just goes to shit. My shite, ancient  scooter broke down and I had one hill to push it over and then I could freewheel down to the town. Hill was not steep but scooter is heavy and I am not physically strong. \n\nMiddle aged farmer dude comes pootling up behind me on HIS ancient crappy scooter, gives me a nod, puts his boot on the back of my bike and drives forward propelling me and my scooter up to the crest of the hill. And then he just drove off with me yelling xiexie ni (Thank you) after him,\n\nNot a word spoken by him throughout the whole thing. (Guy didn't even crack a smile. He was strangely casual and yet efficient. ) Really made my day."
        ]
    },
    "I fell in love with Ireland": {
        "title": "I fell in love with Ireland",
        "score": 220,
        "url": "https://www.reddit.com/r/ireland/comments/1dqt105/i_fell_in_love_with_ireland/",
        "content": "I visited some weeks ago (Greek guy here). I always wanted to visit Ireland. Your country is amazing. It's as green as it gets. And the people were very pleasant too. \n\nI had some minor (could be major) trouble with getting the locals (I mean their accent) but they sure did get mine (which was a positive thing for my english).\n\nI was also astound by the number of gingers you have. I'd never met a naturally ginger person. It felt almost supernatural to my eyes\n\nHonestly, if I was still a student I would definitely search for an Erasmus placement. I have a Greek friend there who moved several years ago and he had lots of Irish friend. I definitely felt hugged by them\n\nI hope I will be able to visit again soon. Love form Greece",
        "num_comments": 59,
        "comments": [
            "You need to come during the summer {July 20-21). The rest of the year the weather is hit and miss.",
            "Love Greece, fantastic country, the best people.",
            "Love me some Saganaki. Fried cheese, genius.\n\nGlad you had a good time",
            "During the bad old days of the late 1980’s when Ireland was in a deep recession and every Irish person I knew was emigrating to London, Boston & New York, I flew to Greece and spent 6 months picking olives and oranges in the beautiful peleponese region. Mostly around Nafplion, Argos & Tolo. It was one of the happiest times of my life. I was 19 and didn’t have a care in the world. Beautiful, warm, welcoming people, spectacular scenery, history in every footstep and the best food on the planet. I’m 55 this year and a grandparent. I can still count to ten and swear like a sailor in Greek! It’s 35 years ago this year. I must go back to visit.",
            "Ah feck off, yer making us blush.",
            "Glad you liked it here. \nBeen to Greece a few times. Lovely country. Walking the streets, it felt like walking through ancient times, the town I was in anyway. Really nice people and going to Greece really made me appreciate eating healthy I have to say. The yachts and boating culture is really impressive I have to say.",
            "The Greeks, a great bunch of lads",
            "I've spent 7 months in Ireland and loved it. People were very nice and welcoming. The landscape was beautiful, although I hadn't seen all of it regrettably.",
            "Thank you for inventing gayness",
            "Came for the grass, stayed for the Gingers!"
        ]
    },
    "Aer Lingus pilots begin eight hour work stoppage": {
        "title": "Aer Lingus pilots begin eight hour work stoppage",
        "score": 20,
        "url": "https://www.rte.ie/news/business/2024/0629/1457223-aer-lingus-work-stoppage/",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Nearly two years of trying to keep pace with inflation, using negotiation, Workplace Relations Commission, Labour Court, direct negotiation. \nManagement just seem to want to break their union as an example to other staff, and are apparently willing to use and lose customers to achieve this.",
            "From the little i know of this, they should all be fired and contractors brought in",
            "The one piece of information I haven't found from this is, is their current pay at market rates? \n\n\nIf pilots feel there's better deals to be had can they just find an alternative employer? That's what most people do. Nobody is owed increases due to inflation.",
            "OP it’s not that simple. Pilots are extremely  well paid and paid well\nAbove average but it can take 20 years to reach the top of the pay scale. On the other hand as a union member I support their right to strike. But both parties went to the labour court, an award of 9.3% was made instead of the  near 23% pilots wanted. Hence the strike.",
            "Where you gonna find 800+ experienced A320 type rated pilots who are trained in Aer Lingus Standard Operating Procedures and who will cost less than the employees?",
            "Agreed, line them up against a wall ",
            "And so say all of us.",
            "It's the shareholders I worry about.",
            "They are better paid than Ryanair pilots who are probably the biggest competition by far for pilot pay where the pilot can live in Ireland.\n\nOther comparisons are flawed because the other country is less/more expensive to live in.\n\nWhen trying to draw comparisons to the market the pilots union talk a lot about how pilots with other airlines have gotten payrises over the last few years but they haven't.\n\nNo discussion as to whether the pilots were on less than Aer Lingus after their payrises.",
            "Exactly. It's pure greed."
        ]
    }
}