{
    "I'm sure its been said.": {
        "title": "I'm sure its been said.",
        "score": 154,
        "url": "https://www.reddit.com/r/ireland/comments/1dr9ux1/im_sure_its_been_said/",
        "content": "But not being able to watch your national sport for free when you pay a T.V License is pretty shocking. Being gouged from every feckn angle. ",
        "num_comments": 65,
        "comments": [
            "I thought gouging was the Irish national sport?",
            "I blame the politicians for this, it's cheap political point scoring at its worse..",
            "Kinda shocked they are paywalling All Ireland quarter finals when basically everyone feels the sport needed more competitive games with stakes. €12 per game is quite steep aswell if you compare it to basically every streaming service. If you want to compare it to boxing, mma, or whatever, they don't sell those piecemeal.\n\nGood news if you run a pub, I guess, but makes the GAA advertising come across as even more deluded than it is.",
            "Likely wouldn’t be on tv at all if not behind a paywall. \nPeople seem to think they was a golden age where every game they wanted to watch was live on tv. This never existed",
            "The only hurling is on TG4 which is free to air????????",
            "What do the angles have to do with it, leave them out of it\n\nSeriously though you are right. It's a load of bollocks lol",
            "We never got all 4 quarter finals shown on free to air ?I don't see the problem, if it bothers you that much head up to Croke Park",
            "There’s enough of it on tv as it is ",
            "Id say youre the type who complains about the deposit return scheme.",
            "There's way too much sport on TV as it is already."
        ]
    },
    "Aer Lingus pilots begin eight hour work stoppage": {
        "title": "Aer Lingus pilots begin eight hour work stoppage",
        "score": 237,
        "url": "https://www.rte.ie/news/business/2024/0629/1457223-aer-lingus-work-stoppage/",
        "content": "",
        "num_comments": 258,
        "comments": [
            "The money's there. If it doesn't go to pilots or crew, it goes to some exec patting himself on the back for another 'record breaking year in profits'\n\nAnyway I like the pilot who's flying the plane to be happy and well paid",
            "Irish people sometimes drive me insane, we are so negative. Unions and protesting for wages are essential for workers rights. Otherwise we wouldn’t have as many days leave, 5 day working weeks, suitable redundancy payments etc. these are things that we benefit from those who protested before us.",
            "Nearly two years of trying to keep pace with inflation, using negotiation, Workplace Relations Commission, Labour Court, direct negotiation. \nManagement just seem to want to break their union as an example to other staff, and are apparently willing to use and lose customers to achieve this.",
            "Work-to-rule is basically only doing what you’re employed to do. If the company can’t put planes in the sky then they haven’t employed enough staff for the task and have relied on overtime and flexibility. \n24% is 3% per year since 2019 and that’s what they want, and deserve. Sounds fair to me. \nThe company don’t want to pay it because it’ll open the flood gates across the industry. Since the crash in 2008 wages have basically been repressed. I’m not in the industry but when I was a service tec in 2008 I was earning ~€50k/yr. That’s still the rate!!! Maybe even less. With everything since then like USC, house prices, rent prices, cost of living crisis and Covid the value of that money has greatly reduced.",
            "Are people who miss their flight entitled to the EU flight cancellation compensation as well as the refund?",
            "Quite disheartening to see the amount of Irish people that seem to be against the Pilots and Unions in general. \n\nIt’s all very Tory. Thatcher would be proud.",
            "23% pay increase. Nice work if you can get it.",
            "If all the people in this thread that think being a pilot is so easy and so well paid why don't they just become one?",
            "If this was Ryanair I'd probably be shrugging, but I genuinely appreciate the service of an Aer Lingus flight and wish them well on the strike.",
            "As someone who's worked for bastard corporations who take advantage of constantly fair play to them."
        ]
    },
    "Patti Smith": {
        "title": "Patti Smith",
        "score": 129,
        "url": "https://i.redd.it/7ebankaheh9d1.jpeg",
        "content": "Ah lads what an absolute legend. Really felt like the gig of a lifetime!\n\nAnyone catch her? \n",
        "num_comments": 36,
        "comments": [
            "I thought it was Mick Wallace at first lol",
            "Wow, where did she play?  \n\nDid she do People have the Power?",
            "Is this why we celebrate st pattis day",
            "Not a crow in sight, good job",
            "No. We were all at Taylor Swift. The real gig of a lifetime.",
            "I suppose Mick better start keeping busy now",
            "Came here for this comment!",
            "Her voice sounds perfect even now. She sounds just like her records!",
            "It was her encore the first night! Really incredible stuff",
            "Vicar Street, I saw her Thursday and she played it, she's a legend "
        ]
    },
    "'Hon the lads!": {
        "title": "'Hon the lads!",
        "score": 52,
        "url": "https://i.redd.it/80v7hixp9i9d1.jpeg",
        "content": "",
        "num_comments": 25,
        "comments": [
            "Great band. They got a lot of stick from bands saying they're not \"real punk\" but I think a lot of this was emanating from a place of jealousy. Noel Gallagher and John Lyndon among those who have criticised them.",
            "A great band but the flag thing starts to become a bit of a cliche at gigs now. That and the \"oh I've never played such an amazing gig at (insert city)\"",
            "Who are we looking at?",
            "What has this to do with Taylor Swift?",
            "Not sure what basis Gallagher would have to criticise Greenday for not being \"real\" punk. Oasis were about as pop rock as it gets.",
            "John Lydon who is now so punk he's a simp for Brexit and right wing nutjobs like Trump. Said he'd vote for Jacob Rees-Mogg to be PM over there. It's honestly sad to see what he's become.",
            "They're pop punk, but that doesn't mean their tunes aren't absolute bangers tbh",
            "For sure. I've seen them live 6 or 7 times now and they're always great. They put on a terrific live show.",
            "Love Oasis and Green Day. Have to take everything the Gallaghers say with a pinch of salt. He loves Bono and U2. They’re as far away from “punk” as it gets. Fact is Punk is young and rock stars grow up.",
            "It's actually what Time Of Your Life is about.\n\nA lot of people think it's a breakup song but it's about leaving behind the hardcore punk scene."
        ]
    },
    "Taylor Swift's hand-written note from the members of U2 prior to her Dublin show": {
        "title": "Taylor Swift's hand-written note from the members of U2 prior to her Dublin show",
        "score": 95,
        "url": "https://i.redd.it/xyogbwtlfc9d1.png",
        "content": "",
        "num_comments": 113,
        "comments": [
            "The florist has lovely handwriting",
            "Is this the same U2 that is so proud of their country they don’t pay tax in it?",
            "She really is bigger than Bono",
            "Is it pronounced Bono, Bono or Bono?",
            "Them flowers are looking a little rough.\nMust have picked them up in a circle k last minute",
            "Lovely message from U2! The concert was amazing, my kids danced all night, traded bracelets and sang their heart out. She put on a great show.",
            "Which one of her assistants had to tell her who they were",
            "Oh shit, did U2 do something again.  Reddit told me they are shit, they don’t pay any tax at all and they forced everyone to download an album so that makes them the worst band of all time and to be honest, possibly the worst humans of all time. \n\nI bet these aren’t even flowers.  I bet the bunch of cunts  gave her weeds.",
            "Probably going to announce a Tyler Swift x U2 collab. As if the world wasn't already bad enough as it was",
            "Ha that's cute. Fair play."
        ]
    }
}