{
    "Topic of the Day: Tips & Tricks": {
        "title": "Topic of the Day: Tips & Tricks",
        "score": 2,
        "url": "https://www.reddit.com/r/ironscape/comments/1dr2iu9/topic_of_the_day_tips_tricks/",
        "content": "What kind of tips have you accumulated throughout your ironman journey? If you have suggestions for how someone can do a grind better, but don't want to share an entire guide, this is the time for you!\n\nUse the \"Tips & Tricks\" flair to make a post and let us know what little bits of knowledge you've picked up.",
        "num_comments": 4,
        "comments": [
            "Most of you probably know this but I just learned it and it blew my mind. Raw Karambwanji (the fish that you use as bait for Karambwan vessels) is the best kitten food. You can catch 1000 in 5 minutes and its stackable with no weight.",
            "To add onto this a ball of wool will keep the kittens attention for 51 minutes as opposed to 18 or 25 mins from stroking. Not super critical as you still need to feed it regularily but I found it nice.",
            "if you have the hunter levels you can also now make the butterfly mix things that are 2 dose ppots",
            "Use prayer liberally. Piety every slayer task.\n\nPpots are stupid easy to get. Piety boosts dps by more than max gear over obsidian.\n\nIf you can’t get ppots easily, focus on that before you hard grind slayer"
        ]
    },
    "[Game Update] Colosseum NPC Clickboxes & More": {
        "title": "[Game Update] Colosseum NPC Clickboxes & More",
        "score": 44,
        "url": "https://secure.runescape.com/m=news/colosseum-npc-clickboxes--more?oldschool=1",
        "content": "",
        "num_comments": 104,
        "comments": [
            "I dropped 4 frog tokens yesterday to make bank space AMA",
            "Probita will look harder for pets??? Tf does that mean",
            "They added a hot fix that heavily nerfed zombie pirate drops if you haven't done the medium wilderness diary. Hopefully that will reduce both the number of bots and pkers, but as a chunk account that unlocked zombie pirates literally yesterday, I'm so mad lmao.",
            "Cool to see someone selling official osrs pc cases, it’s a shame it costs so much though (400usd)..\n\nEdit: for anyone wondering, in attempt to convince myself this isn’t such a big mark up… best I can tell the same case without the artwork goes for $190 on Amazon atm (LIAN LI O11). Everyone has to make their money somewhere I guess.",
            "> Updated the Kiss the Frog random event such that players no longer need to kiss the frog to get the rewards – the royals will be happy with a simple pat on the head. You are still able to choose to kiss the frog and transform into a frog as before.\n\n… What exactly was the point of this? The random event was based off of the “The Frog Prince”, an old fairytale where the frog prince requires a kiss to be turned back to normal. Weird, random addition that was not asked for by anyone.",
            "Just gonna throw this out there, the fact so many people care enough to comment how \"absurd\" the removal is, is proof enough that there will be plenty people out there who care about the opposite being true and fully welcome the change.\n\nIt's pride month and all that, just be respectful 🤷🏼‍♀️",
            "Might as well remove the random event if someone is offended",
            "What's your preferred method of cooking eggs?",
            "How many hours of rune crafting did you drop?",
            "I feel your pain. I think I dropped about the same and have been dismissing them for a while now."
        ]
    },
    "It finally happened. 3558 kc.": {
        "title": "It finally happened. 3558 kc.",
        "score": 1214,
        "url": "https://i.redd.it/v9og3gqzbc9d1.png",
        "content": "",
        "num_comments": 206,
        "comments": [
            "Jagex should really etch your name somewhere in the Gauntlet lobby. This is dedication and perseverance",
            "Finally, I remember your post from a few months ago, I'm glad you didn't hit 4k dry.",
            "I declare this post to be the dry standard. No more CG posts unless you're dryer than this guy LOL",
            "Calling it now. Buddy is gonna get a 1 KC Twisted bow.\n\nEdit: I just looked up OP. He has all megarares from Cox",
            "We rarely see people this dry because they gave up but you didn’t. You stuck with it despite every reason to stop but you kept going and got the drop. Congrats dude. The sun is out, go have fun and play the game",
            "Nah this is some bs. I got fed up going only slightly over drop rate. I couldn't even fathom going that high, kudos for having that much determination (or insanity)",
            "Nope. I’m 536kc atm. I WILL NOT do this. Call me a quitter.",
            "I think it’s time for them to implement a hard pity for enhanced. I think 1200kc should drop an enhanced if you haven’t gotten one by then kinda like Vorkath head.",
            "Absolutely spooned on armor seeds, drop rate has you at only 71 by now /s",
            "i need to see the loot tab PLEASE"
        ]
    },
    "Finally Bit the Dust After 4 Years Playing Hardcore": {
        "title": "Finally Bit the Dust After 4 Years Playing Hardcore",
        "score": 35,
        "url": "https://i.redd.it/2wecjtp1ch9d1.png",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Oh no :( I saw you lose hc in the beta worlds and thought it was real. Now it actually is :( sorry broski ",
            "I got too comfortable at CG, and went from 70-0 instantly",
            "Kc? Also props to actually doing dangerous context zammy pet was hard hc flex",
            "I was only at 8 lol. I did 20 today in the Beta World to learn it, and was confident after that. Never even got close to dying in any attempt. I also have like 60 normal gauntlet for what its worth",
            "Did you really get two armour seed in 8 kc 🫢",
            "He got the pet also",
            "I got one from Normal Gauntlet and another at 5KC Corrupted. I also got the pet at like 10 Normal Gauntlet KC. My most spooned pet by far",
            "howd u die!"
        ]
    },
    "I.... Sorted the team out at cg? ": {
        "title": "I.... Sorted the team out at cg? ",
        "score": 66,
        "url": "https://www.reddit.com/r/ironscape/comments/1dr2wdr/i_sorted_the_team_out_at_cg/",
        "content": "https://preview.redd.it/ugsjjtyitf9d1.png?width=1000&format=png&auto=webp&s=ccecd63bdce5bad2153b6f05c4d9fc8fdd6de4d6\n\nI was green logged at 201, but figured I'd keep the RNG rolling xD",
        "num_comments": 27,
        "comments": [
            "Is this a ban able  offence?",
            "Yo, wtf is this shit I’m seeing?",
            "Dude what the hell. My GIM has 7 armour seeds at 710 runs and 0 enhanced. Please tell your dad at Jagex to spare some of us some RNG!",
            "According to osrs dry calculator getting just 5 enh's in that amount of kc is a 0.00004632% chance. Absolutely disgusting but huge gzzzzz.",
            "Wish this rng was bannable. Meanwhile people go 1k kc without one enh",
            "“Yes, officer. This post right here. It’s criminal!”",
            "So 2 full sets of Crystal, one extra Seed and 5 BoFas? Aight",
            "My brain cannot comprehend that this isn't photoshopped",
            "My team is like, 6th on the hiscores for 4man CG and we only ever got to 4 lol.",
            "How is this even possible? Im at exact same KC, 10 armor, 10 wep seeds. No pet nor enhanced..."
        ]
    }
}