{
    "FINALLLLLLY!!!!!!!": {
        "title": "FINALLLLLLY!!!!!!!",
        "score": 13,
        "url": "https://www.reddit.com/r/IRS/comments/1dr9wpn/finalllllly/",
        "content": "Woke up and checked \"Where is my Refund?\" like i normally do since I filed and 4 months later, I FINALLY get an update and a DD date of July 3rd. This has been by far the worst tax experience I ever experienced but im just glad it's finally coming. I filled 3/11 and has been on Accepted since 3/11..... until today. I also went through a tax advocate as well.",
        "num_comments": 7,
        "comments": [
            "And I was told I have to wait 9 week's",
            "They told me the same thing but it definitely didn’t take the whole 9 weeks. 3 weeks tops since verifying in person and talking with a Tax advocate ",
            "It's been 2 weeks since I did my verify in person. I really hope I get mines next week then. Did u email a Tax advocate or you called??",
            "I called and they transferred me over to the tax advocate and spent about an hour on the phone with her. Come to find out when I went in person to verify myself, the lady never put my stuff through, she just made a note on my account that I have been verified in person. The lady said I had indicators on my account which is why I haven’t seen any movement with my refund. Idk what she did but she worked it out for me. ",
            "Congratulations!!!",
            "Thank you!!!!!",
            "Welcome to r/IRS, the subreddit for taxpayers and tax professionals to discuss everything related to the Internal Revenue Service. We are glad you are \nhere!\n\nHere are a few reminders before you get started:\n\nPlease be respectful of others in the community. We do not tolerate personal attacks or harassment.\n\nBe wary of scammers and spammers. The IRS will never contact you via direct message or email. If you receive a message from someone claiming to be from \nthe IRS, do not respond and report it to the IRS immediately. The same rules apply to r/IRS\n\nDirect messaging is forbidden and can lead to a ban on r/IRS. If you have a question or need assistance, please post it in the subreddit so that everyone \ncan benefit from the discussion.\n\nFor more information about r/IRS rules, please visit our subreddit wiki: https://www.reddit.com/r/IRS/wiki/index/\n\nLink to finding local tax advocate: https://www.irs.gov/advocate/local-taxpayer-advocate\n\nWe welcome international users to r/IRS. Please feel free to participate in our discussions, even if you are not a US taxpayer.\n\nThe moderator team is committed to keeping r/IRS a safe and welcoming community for everyone. We will not tolerate hate speech or discrimination of any \nkind.\n\nIf you see something that you think violates our rules, please report it to the moderators. We appreciate your help in keeping r/IRS a positive and \nproductive space.\n\nThank you for being so cooperative! We hope you enjoy your time on r/IRS.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IRS) if you have any questions or concerns.*"
        ]
    },
    "1/29 filer - all hope lost ": {
        "title": "1/29 filer - all hope lost ",
        "score": 4,
        "url": "https://www.reddit.com/r/IRS/comments/1drbpol/129_filer_all_hope_lost/",
        "content": "Welp. Filed 1/29 - received the typical 570 and 971 codes. I’ve done everything I needed to do. Tax advocate has done nothing after my communications a few weeks ago but not surprised. I have a glimmer of hope when I see everyone posting on here - so please keep giving us your happy news and maybe one day, the rest of us will too. LOL. I have student loans that are 4 months defaulted now 😀😀😀 (and they’re private loans with Sallie Mae - wouldn’t suggest them) - might just file bankruptcy who knows? 🤠 ",
        "num_comments": 7,
        "comments": [
            "Im actually on the same boat as you in terms of congressman and also student loans. I also filed 1/29 and have 570/971 codes! We should keep updating ourselves!",
            "Same boat as you but mine were accepted 1/19 I filed 1/7… just waiting. Can’t get a call back from TAS agent, my congressmans office just keeps telling me to wait 30 days now… TWICE… no answers no returned calls and 5 voicemails left. Nobody will contact me. Nobody will answer. Just left out here twisting in the wind.",
            "The only time the congressman replied was to get my info - ID verification and tax return lol then ghost 👻",
            "Yeah when I did that it took them about 3-4 weeks to get back in touch with me. That’s when they put in my first request (whatever that means) then I heard back May 15th that they needed my last 2 pay stubs so I sent those over the same day. They emailed me to confirm they received those and sent them to my TAS agent. But I had to call TAS myself to get the name of my TAS agent they gave me her name and her phone number I’ve called 5 times left her a voicemail each time and her recording states that due to an increase in cases it could take her up to 2 weeks to respond to voicemails… it’s been a month and haven’t heard from her. I’m sick of waiting I need this money for my small business. These people are all a joke but I’m not laughing anymore.",
            "I filed 2/22 \n570 code on 4/1\nNothing else \n\nI went back to look at old transcripts. Lots of codes and we had our return in a matter of weeks. I don't understand what the hell is going on. Our accountant is looking into it but I'm so frustrated.",
            "Omg please!!!",
            "Welcome to r/IRS, the subreddit for taxpayers and tax professionals to discuss everything related to the Internal Revenue Service. We are glad you are \nhere!\n\nHere are a few reminders before you get started:\n\nPlease be respectful of others in the community. We do not tolerate personal attacks or harassment.\n\nBe wary of scammers and spammers. The IRS will never contact you via direct message or email. If you receive a message from someone claiming to be from \nthe IRS, do not respond and report it to the IRS immediately. The same rules apply to r/IRS\n\nDirect messaging is forbidden and can lead to a ban on r/IRS. If you have a question or need assistance, please post it in the subreddit so that everyone \ncan benefit from the discussion.\n\nFor more information about r/IRS rules, please visit our subreddit wiki: https://www.reddit.com/r/IRS/wiki/index/\n\nLink to finding local tax advocate: https://www.irs.gov/advocate/local-taxpayer-advocate\n\nWe welcome international users to r/IRS. Please feel free to participate in our discussions, even if you are not a US taxpayer.\n\nThe moderator team is committed to keeping r/IRS a safe and welcoming community for everyone. We will not tolerate hate speech or discrimination of any \nkind.\n\nIf you see something that you think violates our rules, please report it to the moderators. We appreciate your help in keeping r/IRS a positive and \nproductive space.\n\nThank you for being so cooperative! We hope you enjoy your time on r/IRS.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IRS) if you have any questions or concerns.*"
        ]
    },
    "Transcript updated!": {
        "title": "Transcript updated!",
        "score": 14,
        "url": "https://www.reddit.com/gallery/1dr4lmm",
        "content": "Transcript finally updated been waiting since February! Where’s my refund still says pending and not approved but hopefully I get this soon!",
        "num_comments": 18,
        "comments": [
            "How about wmr? Did it update?",
            "Omg I really hope I get an update soon too! I also been waiting since February. But can I ask a question? Have your WMR been updated? Or it's still stuck on the first slot?",
            "Did you have to verify with control number ?",
            "Filed Feb 3, transcripts update Friday with a DD 7/2.  Checked my bank last night and the deposit was already there.",
            "Scroll over it’s the second picture, wmf did not update",
            "Sorry didnt see that. Same tho got 846 on my transcript but wmr didnt update too",
            "It’s all good, yours updated today as well? I wonder if the refund dates on the transcript are accurate. Hopefully we get it soon!",
            "Yes it did. I hope so too. Its been forever",
            "By chance Have you seen anyone else post when there’s updated then how long the refund actually took or when their wmf updated?",
            "They said fridays are for transcript and saturdays are for wmr."
        ]
    },
    "Question…": {
        "title": "Question…",
        "score": 2,
        "url": "https://i.redd.it/zjr0308s4j9d1.jpeg",
        "content": "Why does the filed date show after the date the refund was issued? The irs refund status site says it was mailed 6/14 but still waiting. This is from tax year 2021. I called the irs yesterday and they told me it was mailed 6/14 but I should’ve received it by now \n",
        "num_comments": 2,
        "comments": [
            "The \"filed\" date is just the legal schmegal official processing date for your 1040. Perfectly normal. \n\nThe refund date is when the check was placed in the loving hands of the great United States Postal Service. \n\nIs the address on your 2021 return current?",
            "Welcome to r/IRS, the subreddit for taxpayers and tax professionals to discuss everything related to the Internal Revenue Service. We are glad you are \nhere!\n\nHere are a few reminders before you get started:\n\nPlease be respectful of others in the community. We do not tolerate personal attacks or harassment.\n\nBe wary of scammers and spammers. The IRS will never contact you via direct message or email. If you receive a message from someone claiming to be from \nthe IRS, do not respond and report it to the IRS immediately. The same rules apply to r/IRS\n\nDirect messaging is forbidden and can lead to a ban on r/IRS. If you have a question or need assistance, please post it in the subreddit so that everyone \ncan benefit from the discussion.\n\nFor more information about r/IRS rules, please visit our subreddit wiki: https://www.reddit.com/r/IRS/wiki/index/\n\nLink to finding local tax advocate: https://www.irs.gov/advocate/local-taxpayer-advocate\n\nWe welcome international users to r/IRS. Please feel free to participate in our discussions, even if you are not a US taxpayer.\n\nThe moderator team is committed to keeping r/IRS a safe and welcoming community for everyone. We will not tolerate hate speech or discrimination of any \nkind.\n\nIf you see something that you think violates our rules, please report it to the moderators. We appreciate your help in keeping r/IRS a positive and \nproductive space.\n\nThank you for being so cooperative! We hope you enjoy your time on r/IRS.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IRS) if you have any questions or concerns.*"
        ]
    },
    "FINALLY....Im gonna go cry now.": {
        "title": "FINALLY....Im gonna go cry now.",
        "score": 81,
        "url": "https://www.reddit.com/r/IRS/comments/1dqrqk3/finallyim_gonna_go_cry_now/",
        "content": "Yesterday was just checking my bank balance and there it was. Just a sudden deposit. I had received yet another wait 60 days letter on the 7th of june. I had basically written it off as something i was never going to get...and then there it was. Just in my bank account.",
        "num_comments": 43,
        "comments": [
            "Congratulations to you! On another note I just got a letter from my auto loan company I got 10 days or my car will be repossessed and this has never happened to me before. I know my refund got to be coming soon, Lord do I need it right this minute. I need Prayer folks all I can get.",
            "I'm happy for you...but sad for me 😭",
            "I received my 2nd 60day review notice as well...2 weeks ago....I've stopped even hoping.....I'm only here to see this cause I got a notification lol....I have really just stopped thinking ill get it foreal but ur post is helpful to my thoughts....\n\n1605 still...no update. Filed 2-21",
            "How often did you check your WMR? Was there any updates?",
            "Did you get an update on your transcripts?? Congratulations!!!!!! 🎉",
            "Was the letter you got on the 7th your 3rd letter or? I just received a 3rd letter today saying I have to wait another 60 days 🤦🏽‍♀️ my 120 days ends on July 2nd and I feel like I had to restart all over again 😭",
            "Are you 1--29 by any chance 🤞 congrats btw",
            "That's awesome! 🥂🎉 Congrats! Definitely a breath of fresh air.",
            "I hope I get good news like you this weekend.",
            "Great we are being destroyed by the government and the politicians who make these laws that give breaks to the wealthy and hell to us soon thevtides will turn the IRS has screwed us over and over but aside from that I hope now your hard earnings can being you a little joy because you will need it there more hard stuff coming as america enter her fall be well"
        ]
    }
}