{
    "An r/Isekai Discord Server": {
        "title": "An r/Isekai Discord Server",
        "score": 99,
        "url": "https://www.reddit.com/r/Isekai/comments/aucckv/an_risekai_discord_server/",
        "content": "Someone recently brought it up and I think it would be good to have a place where Isekai can be discussed without making a lot of posts here, so I made an r/Isekai discord. If anyone has any ideas for different channels, let me know.\n\nInvite Link: https://discord.gg/DvcMWQU",
        "num_comments": 24,
        "comments": [
            "The original matrix movie invinted isekai, prove me wrong…",
            "Where do I comment bro",
            "hope this isn't a mistake",
            "Im not sure if my manga counts as an isekai or not...? Take a look an see for yourselves... Right now its only words looking for an artist to help me get this ball rolling\n\nHead on over to r/Psience and take part in building a manga",
            "Can anyone tell me the name of a manga where the Mc was reincarnated as a baby of the royal family but because he didn’t have high magical abilities,he was thrown into the forest by his mom,the queen. He meets a wolf,who has the ability to turn into a woman and is adopted by a man who found him in the forest. He has a younger sister and the ability to use shields. In the last chapter I read,he had arrived in an academy in the capital. Please tell me if you know,it got lost in the hundreds of tabs in my phone.",
            "i know this is unrelated but is trash hero ever getting an anime run?",
            "Wizard Of Oz, 1900.  Few decades before Matrix, no?  \n\nXD",
            "> Can anyone tell me the name of a manga where the Mc was reincarnated as a baby of the royal family but because he didn’t have high magical abilities,he was thrown into the forest by his mom,the queen. He meets a wolf,who has the ability to turn into a woman and is adopted by a man who found him in the forest. He has a younger sister and the ability to use shields. In the last chapter I read,he had arrived in an academy in the capital. Please tell me if you know,it got lost in the hundreds of tabs in my phone.\n\nyo this is a lot of spoilers but it does sound nice",
            "Jitsu wa Ore, Saikyou deshita?",
            "There are many others that are way older."
        ]
    },
    "Is he the only isekai ANIME protagonist who became a parent?": {
        "title": "Is he the only isekai ANIME protagonist who became a parent?",
        "score": 538,
        "url": "https://i.redd.it/regn18vztjic1.jpeg",
        "content": "",
        "num_comments": 222,
        "comments": [
            "Kumo desu ga nani ka",
            "A certain spider does. Although she doesn't spend much time raising them, she at least gives them some food.",
            "Kirito always becomes a parent apparently",
            "So early on, yes. MANY isekai stories MCs have children, but it's usually much further in the story. How a Realist Hero saved the Kingdom is getting close to the first child that should come next season if they do a 3rd.",
            "Chilling and another world at level 2",
            "Re: monster. The other farming one as well?",
            "While not in the anime, Souma from realist hero has children",
            "Check out Isekai Monster: Trying to be a Hero, When Back Home you where called a Monster",
            "There are plenty of them, but I have yet to see one where the child actually became an important/relevant character",
            "Ainz is pretty much Pandora's Actor's dad"
        ]
    },
    "Yes, Isekai Medieval BATMAN.": {
        "title": "Yes, Isekai Medieval BATMAN.",
        "score": 69,
        "url": "https://i.redd.it/0dalefz5qh9d1.png",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Batman Ninja was a trip",
            "Before saying Batman Ninja for the bottom picture. That aint Batman Ninja that's from Isekai Shikkaku PV2",
            "OP, gimme the sauce of the left girl",
            "Bro this gives me flash backs to that RWBY colab",
            "The bottom ain't from Batman Ninja XD",
            "Somebody already gave it to you XD",
            "Shit, what season is RWBY now?",
            "I have no idea anyway more",
            "Griffith",
            "Danke"
        ]
    },
    "A quick meme that basically summarizes my 3 WIP isekai series (and what inspired them) before I get back to writing.": {
        "title": "A quick meme that basically summarizes my 3 WIP isekai series (and what inspired them) before I get back to writing.",
        "score": 117,
        "url": "https://i.redd.it/3mbtvqguyd9d1.png",
        "content": "",
        "num_comments": 25,
        "comments": [
            "as a warhammer fan, i am curious about the second one",
            "Will this be on any websites?",
            "I must tell you, the John Brown Isekai story would be perfect for the first one",
            "Third one is literally just Arifureta.",
            "Is English not your first language? Just a genuine question.",
            "Let’s see them, all three sound good",
            "The whole slavery thing has become stale, id suggest something more original as a premise. I like the other two though",
            "Meanwhile, I'm wiring one where a crusader brings the good qord of Jesus to the unbelievers.",
            "As a person intrigued by Warhammer, I am further intrigued about the second one",
            "Slaanesh inspired, so... everyone and everything and every-object. \n\nThen one tall and very shiny man, in shiny armour, got jealous and had a bunch of sons. Who proceeded to have half of them get a little jealous as well, and things went a little darker."
        ]
    },
    "Isekai characters got summoned to a Holy Grail war as servants. Which character should be on that class? Day 3 Class Archer.": {
        "title": "Isekai characters got summoned to a Holy Grail war as servants. Which character should be on that class? Day 3 Class Archer.",
        "score": 8,
        "url": "https://i.redd.it/4gxt48cbvh9d1.png",
        "content": "Class Saber - Teacher [Reincarnated as a Sword]\n\nClass Lancer - Shalk [Ishura]\n\n(Based on that daily Isekai Characters series pls tag him/her so I can give credit next time)",
        "num_comments": 20,
        "comments": [
            "Tanya. No Archer uses an actual bow anyways",
            "Btw, on Archer Class, as long as it shoots projectiles it can be an archer like Ishtar and Gilgamesh, even one of the Archer Class in Fate uses sword that he was Mistaken to be a Saber at first *Ehem Emiya*.",
            "Ok hear me out Sakamaki Izayoi. He threw a rock really hard once during the first episode and it be funny",
            "Hajime just hajime we all know with how many guns he has he is a perfect fit.",
            "Tanja from Saga of Tanja the evil. Makoto is a way too easy choice.",
            "Kazuma(Konosuba) the only one I can think of rn.",
            "Grand Archer Orion uses a bow (as a blunt weapon)",
            "Hajime from Arifureta uses a lot of guns, lasers, and other ranged/projectile weapons.",
            "Hard agree, Makoto is best isekai archer I can think of right now.",
            "Orion, like every other Archer, just throws stuff. In his case, he throws hands"
        ]
    }
}