{
    "Free-Talk Friday - 28/06/2024": {
        "title": "Free-Talk Friday - 28/06/2024",
        "score": 0,
        "url": "https://www.reddit.com/r/islam/comments/1dqhy9j/freetalk_friday_28062024/",
        "content": "We hope you are all having a great Friday and hope you have a great week ahead!\n\nThis thread is for **casual discussion** only.",
        "num_comments": 3,
        "comments": [
            "Hey so uhh anybody here likes playing terraria? I'm looking for someone to play multiplayer with.",
            "Any chess players, pls d.m😭."
        ]
    },
    "There are trolls sending DMs to people who post in this sub. Do not engage.": {
        "title": "There are trolls sending DMs to people who post in this sub. Do not engage.",
        "score": 21,
        "url": "https://www.reddit.com/r/islam/comments/1dp9mnf/there_are_trolls_sending_dms_to_people_who_post/",
        "content": "",
        "num_comments": 11,
        "comments": [
            "They got nothing better goin on in their lives… trolling people they don’t know is one of the few things that keeps them going each day",
            "What they do is for them, may Allah  ﷻ guide them.",
            "Yeah, honestly, it’s everywhere. Does anyone know how to turn off DMs??",
            "hii, there’s also a person on this subreddit spreading misinformation about Islam through the comments",
            "Maybe they just genuinely don't know. Could you post an example or screenshot of responses, just curious what it looks like?",
            "Yes there are but could you elaborate on what happened",
            "Elaborate maybe...",
            "Under chat and messaging permissions in settings of your profile",
            "They send sincere sounding questions, don’t read your answers, tweak the question a bit again so you think they read and ask it again. Again you spend time preparing answers they repeat the cycle.",
            "They send sincere sounding questions, don’t read your answers, tweak the question a bit again so you think they read and ask it again. Again you spend time preparing answers they repeat the cycle."
        ]
    },
    "Don't be sad, future is better than the past. Allah's with us always.": {
        "title": "Don't be sad, future is better than the past. Allah's with us always.",
        "score": 57,
        "url": "https://i.redd.it/9ixdt734qf9d1.jpeg",
        "content": "Have sabr and be thankful.",
        "num_comments": 3,
        "comments": [
            "Ameen. 🤲🏽",
            "I needed this. Jazakallah Khayran, OP."
        ]
    },
    "Listen to Quran and pay attention 💐❤️🎧": {
        "title": "Listen to Quran and pay attention 💐❤️🎧",
        "score": 58,
        "url": "https://v.redd.it/bnzpts388f9d1",
        "content": "",
        "num_comments": 5,
        "comments": [
            "What surah is this",
            "What surah is this",
            "Beautiful",
            "\nAl Baqarah:186\n\nوَإِذَا سَأَلَكَ عِبَادِى عَنِّى فَإِنِّى قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ ٱلدَّاعِ إِذَا دَعَانِ ۖ فَلْيَسْتَجِيبُوا۟ لِى وَلْيُؤْمِنُوا۟ بِى لَعَلَّهُمْ يَرْشُدُونَ ١٨٦\n\nWhen My servants ask you ˹O Prophet˺ about Me: I am truly near. I respond to one’s prayer when they call upon Me. So let them respond ˹with obedience˺ to Me and believe in Me, perhaps they will be guided ˹to the Right Way˺.",
            "Baqarah,Ayah 186"
        ]
    },
    "Islam on spying": {
        "title": "Islam on spying",
        "score": 102,
        "url": "https://v.redd.it/eudeto9y1e9d1",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Thank you mossad,  no one will spy so you can spy freely.",
            "In the context of day-to-day interactions then yeah i agree but this quickly becomes grey when you think from a governance perspective no? I mean even counter-intelligence involves some degree of espionage, so it can't possibly mean that protecting one's country means going against god?",
            "Ayat please i want to read it in context",
            "Spying on a cheater is terrible…but cheating in itself is not?! It should be concealed? Wonder how you’d like someone seeing your wife with another man and not telling you?! Makes no sense",
            "You can get stoned to death if you cheat on your spouse in Islam how is that not terrible lol"
        ]
    }
}