{
    "we want your photos! (of israel)": {
        "title": "we want your photos! (of israel)",
        "score": 35,
        "url": "https://www.reddit.com/r/Israel/comments/1dqiipr/we_want_your_photos_of_israel/",
        "content": "hello dear sub! after a lot of discussion amongst the team, we decided to update a few things around here, some of them are behind the scenes stuff BUT one of them is the banner photo for the subreddit. and we want your help! if you think that you have a photo that represents Israel in terms of vibes/culture/views/etc please share BUT before you do here are a few ground rules: the photo MUST be of israel, and if you did not take the photo yourself make sure to credit the original photographer! also importnatly the photo MUST BE **2000 X 224 px** lastly, you can only send the photos HERE in the comments and we will not look at it if is anywhere else, now do note that there is HEAVY filtering going on here so even if you dont see your comment, we do. make sure to upvote your favorite photo! and shabat shalom\n\n",
        "num_comments": 4,
        "comments": [
            "Hmmm, I'd dearly love to contribute and I'm an amateur photographer. Having shot hundreds of images in Israel over the past decade(s), I've been looking through my city-scapes (mostly Haifa, Nahariya and Tel Aviv) and recognizable Israeli landscapes but in the banner size quoted nothing really fits.\n\nI definitely am looking forward to see what others can come up with and maybe get inspired for my next visit in October (just got back on Wednesday night). Cool idea! If I do come across a potential, how do we upload in the comments? I can only see a way to link, not to upload an actual image.",
            "i did not know you cant post images here tbh, i guess just link to the image (imgur would be the best)",
            "Is it not a setting that mods can change?",
            "Not really no"
        ]
    },
    "Not every left person in the west is lost": {
        "title": "Not every left person in the west is lost",
        "score": 86,
        "url": "https://www.reddit.com/r/Israel/comments/1dr4fx7/not_every_left_person_in_the_west_is_lost/",
        "content": "This is from the Fusion Festival near Berlin. The organizers of the festival made weird statements regarding the war in Gaza and this is the answer from some of the festival attendees:\n\nhttps://preview.redd.it/qjs6yvsjag9d1.jpg?width=1134&format=pjpg&auto=webp&s=e99a00eb483e8af1b61336d6676f7ccda3f69f53\n\n",
        "num_comments": 22,
        "comments": [
            "The German left is, due to the historical context, a special case.\nThe antifa movement in Germany is typified by people like Beate Klarsfeldt. \nYou even have the anti-German movement, which is very pro Israeli.",
            "There are more of us than you think in Europe, I am not Jewish, but I strongly support Israel and it's people",
            "I was in Frankfurt a month ago and was so happy to see the Israeli flag flying outside the townhall.",
            "Glad to see this support.",
            "Seeing how Germany and Germans reacted to October 7 gave me a lot of hope. Overall, the german government has done a great job on cracking down on antisemitism. I have a lot of German friends who consider themselves far left and they have been incredibly supportive along with the rest of their movements. It’s a shame other leftist groups can’t follow in germanys lead and properly call out anti semitism",
            "There are about 30,000 Israelis living in Berlin.\n\nI'll be willing to bet most of this crowd is made up of that community.",
            "I see an awesome ANTIFA flag!\n\n[The Philosophy of Antifa | Philosophy Tube](https://www.youtube.com/watch?v=bgwS_FMZ3nQ&list=PLPCENRDc3DcQ5TzUMlp_tJHA139tv2wRR)\n\nTrump is an idiot:\n\n[ANTIFA.org](https://www.antifa.org/)",
            "Look, we need to be honest with things.  This is mostly expats from Israel living in Germany right now. Not a bunch of concerned allies.",
            "But the left politics are very anti",
            "Thank you. It means a lot in times like these."
        ]
    },
    "IDF kills dozens of terrorists hiding in UNRWA schools, increase attacks in Shejaia": {
        "title": "IDF kills dozens of terrorists hiding in UNRWA schools, increase attacks in Shejaia",
        "score": 241,
        "url": "https://www.jpost.com/israel-hamas-war/article-808147",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Good!",
            "What is UNRWA doing to distance itself from Hamas?",
            "G-g-g-g-genocide! /s",
            "baruch hashem",
            "Waiting for the CNN headlines",
            "May their memory be a Borat comedy movie",
            "Hamas hiding behind civilians, nothing new. May their memory be erased.",
            "My honest reaction: [https://www.youtube.com/watch?v=UnyBJJI2eqs](https://www.youtube.com/watch?v=UnyBJJI2eqs)\n\nCan't wait for the spin on how this is bad in the W\\*stern media.",
            "May their existence be wiped out\n\n:)",
            "Nothing. So intertwined that they practically are Hamas at this point."
        ]
    },
    "Only in Israel": {
        "title": "Only in Israel",
        "score": 61,
        "url": "https://i.redd.it/fj4n0ugtlg9d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Unpopular Opinion: Taking pictures of random people faces to prove a political point is not cool",
            "The lady on the left seems unhappy to have her picture taken...",
            "I hope the safety is on.",
            "I see that there's another empty seat to the left. Maybe we should scooch down a bit?",
            "The whyte colonizer on the right, the white looking lady on the left is wearing a hijab so she is brown",
            "She's mad because the Lady on the right just told her she was going to drink the Blood of Palestinian Babies.\n\n/S"
        ]
    },
    "Pro-Palestinian Brainrot": {
        "title": "Pro-Palestinian Brainrot",
        "score": 104,
        "url": "https://www.reddit.com/gallery/1dr21h4",
        "content": "So I was debating with a pro Palestinian about the famine in Gaza and he absolutely dodges the point of the whole argument. He goes on to say how I’m “brainwashed by the western zionist media” despite me sending mountains of evidence from the UN and credible medical sources that might say otherwise while he had only sent one source from instagram and one from NPR (both incredibly biased and western outlets). He then devolves this argument by spamming emojis and talking about Russia and Ukraine and also how the UN is biased towards the West. \n\nIm done arguing with pro-Palestinians🤦🏾‍♂️.\n",
        "num_comments": 27,
        "comments": [
            "Lmao - that pro-pali is raging xD\n\nAnti-Isralies are inherently unreasonable and can't handle mature discussion. They just spam qatar talking points and when that fails attempt to change topics to something else. Utterly devoid of critical thinking.",
            "I feel dumber having read this, and I don't have many brain cells to spare.",
            "Stop wasting your time with these people, engaging with them, you are assuming there will be a good faith argument based on facts, a sadly inaccurate one.",
            "Bro can't provide proof but results to rage",
            "Open arms ???? Do you have to list the insane numbers of pogroms and massacres we suffered at their hands before and after 1948",
            "Funny that it never occurs to them that their behavior only reinforces Zionist sentiment. Nothing happens in a vacuum after all ;)",
            "Whether 2023 or 1948.\n\nWe didn’t start either of those.",
            "their IQ level is below room temperature.\ncan't argue with them on facts. but i m surprised to what extent they are delusional, kind of scary.",
            "brief instruction on how to feed your troll",
            "Hollow head"
        ]
    }
}