{
    "[June 2024] State of IT - What is hot, trends, jobs, locations.... Tell us what you're seeing!": {
        "title": "[June 2024] State of IT - What is hot, trends, jobs, locations.... Tell us what you're seeing!",
        "score": 15,
        "url": "https://www.reddit.com/r/ITCareerQuestions/comments/1d7rznu/june_2024_state_of_it_what_is_hot_trends_jobs/",
        "content": "Let's keep track of latest trends we are seeing in IT. What technologies are folks seeing that are hot or soon to be hot? What skills are in high demand? Which job markets are hot? Are folks seeing a lot of jobs out there? \n\nLet's talk about all of that in this thread!",
        "num_comments": 45,
        "comments": [
            "Still waiting for AI to go beyond venture capitalist hype...",
            "Seems to be getting better. Only been getting call backs for jobs that I applied to within 24 hours of being posted.\n\nI had 12 callbacks on my resume, of which 4 have turned into meetings with the hiring manager. been aggressively applying everyday for 1 month",
            "How hot is the cloud?",
            "Thursday, June 13th @ 1pm. New Jersey. Constant calls for jobs.  \n  \nI guess funding opened up for a lot of spots.",
            "I got nothing. Some in PA, mostly senior positions in seems",
            "Southeast Michigan Jobs  \n  \nSeems like Network and System Administrator positions are hot right now in SE Michigan. Been looking for myself and these seem to be hitting the job boards in abundance.",
            "Hoping it gets better in 2025, market still seems oversaturated in entry, especially after all the \"learn to code\" hype crowd. Hopefully it lets up in entry level roles, still struggling to find employment recently. Given how the layoffs have impacted things.",
            "Created this account to beg and plead about information on the entry level market in the Long Island, NY area. From what I can tell, it's oversaturated.",
            "Feels like a mid level white collar recession to me. I'm not seeing that many cyber RMF positions compared to a couple months ago, and my job is circling down the drain a bit so I'm starting to need to look. Not sure if other fields are experiencing the same but compliance seems to not have that many postings on indeed or linkedin, also getting recruiters only once every couple weeks or so when I was getting hit up every other day a few months ago",
            "Entry level cyber security jobs in Europe seem to be incredibly hard to come by, with the majority instead being postings asking for several years of experience... \nBeen like this for as long as I've been tracking the area (i.e. since around January)."
        ]
    },
    "[Week 26 2024] Skill Up!": {
        "title": "[Week 26 2024] Skill Up!",
        "score": 1,
        "url": "https://www.reddit.com/r/ITCareerQuestions/comments/1dr4m8b/week_26_2024_skill_up/",
        "content": "Welcome to the weekend! What better way to spend a day off than sharpening your skills!\n\nLet's hear those scenarios or configurations to try out in a lab? Maybe some soft skill work on wanting to know better ways to handle situations or conversations? Learning PowerShell and need some ideas!\n\n**MOD NOTE:** This is a weekly post.",
        "num_comments": 1,
        "comments": [
            "So i an a chef trying to change careers working in IT, Im thinking software / app developer, using java and i thought python to go with that, but also very much trying to integrate AI into the mix, any one company creating any ai specific jobs? Any thoughts or suggestions"
        ]
    },
    "does anyone else just not do much work?": {
        "title": "does anyone else just not do much work?",
        "score": 71,
        "url": "https://www.reddit.com/r/ITCareerQuestions/comments/1dqwigp/does_anyone_else_just_not_do_much_work/",
        "content": "i’m in an entry level role so i’m not getting paid a ton and i guess less is expected of me but my work day usually consists of ~6 hours of playing video games/browsing reddit/whatever and ~2 hours of work/meetings. and i’m usually still browsing reddit in those meetings with my camera off\n\ni do my job and complete my tasks it just doesn’t take very long or much effort. i’ll do enough work to show off at a meeting to make it look like i’m doing something but that never takes me long. everyone always says my work is really good as well so it’s not like i’m not doing enough for them. i used to ask for more work but i just can’t be arsed anymore and no one’s asking me to do more\n\nanyway is this normal? i’m not exaggerating, i literally napped all day and did nothing. when i try to express this to people they say i have imposter syndrome but i don’t, i think my work is good i just genuinely don’t do much. is everyone else just doing nothing all day?",
        "num_comments": 71,
        "comments": [
            "I generally come in at least fifteen minutes late. I use the side door - that way Lumbergh can't see me. After that I sorta space out for an hour.\n\nI just stare at my desk, but it looks like I'm working. I do that for probably another hour after lunch too, I'd say in a given week I probably only do about fifteen minutes of real, actual, work.",
            "You WFH dont you. When you have a job like this simply work another one at the same time.",
            "Dude stop letting that time go to waste. The only thing separating you from higher level roles is you aren't studying networking , systems, etc . I got my CCNA thanks to my first IT job having lots of downtime while my coworkers were waiting for a promotion and they were just playing video games.",
            "Usually Fridays i do around 1-2 hrs of work and do whatever the hell i want for the rest of the day. I work systems admin for county",
            "It can be. My job is like that right now, but I have also had times when I was running around all day getting things done. Part of why you're paid is to be available if something comes up, not necessarily to be maximizing efficiency.",
            "On certain days, yup. Love the days where hardly any tickets come in. Nice and quiet and no meetings! On those days, I either work on schoolwork or poke around on YouTube. \n\nBut then things could easily turn around to an all hands on deck situation where a severity 1 ticket comes in and the customers production environment is completely fried and theyre losing a ton of money. And then you find yourself on a troubleshooting call for several hours tangling with an issue youve never seen before. And thats when management and the developers get involved to escalate the issue. Its all very exhausting.",
            "This sounds like a great opportunity. If I had this job, Id up-skill during the down time, like learn backend or something, and then network my way into a different dept at the company with more responsibility. I wish I were you.",
            "Naw, I'm constantly on back to back tickets/calls. There are slow periods tho.",
            "My current job is like this. Spent the first 6 months doing exactly what youre doing. Finally, Ive gotten bored of even that and am studying certifications to move up to a higher paying position. Realized although its nice to be paid to waste time, I could capitalize on it by getting a ton of certs jump to a much higher paying job.",
            "I dont have nearly as much downtime as you do but I have enough that eventually makes me bored. Have been thinking about finishing my degree during the downtime while planning an exit from tech in general."
        ]
    },
    "Bachelor's degree or Certifications? ": {
        "title": "Bachelor's degree or Certifications? ",
        "score": 2,
        "url": "https://www.reddit.com/r/ITCareerQuestions/comments/1dr8uxt/bachelors_degree_or_certifications/",
        "content": "Hello, I've been pretty anxious and indecisive lately over what to do moving forward. I went back to school via community college after the pandemic. I got on a plan to get an associate degree in something that's a combination of some CS and CIS classes. I was able to get some certificates from the school but nothing major. \n\nI feel like the best I can do with this degree is transfer to a university for a bachelor's. This associate degree left me in a better spot to transfer for a CIS major but I generally preferred the CS classes and that major sounds more interesting to me. However, I'd have to take over another year of math classes to meet lower division requirements for the CS major.\n\nI also found out the community college had an IT major with a pathway where one could get networking, A+, and security certifications along the way and was told I could probably land a job right after one semester. I would have probably gone this route if I knew about it sooner. \n\nConsidering these circumstances, I would really appreciate any guidance on how to move forward. Is the extra time for a bachelor's worth it, and if so, which major? Or should I kind of start from scratch again and work on getting certifications and hopefully start working in IT sooner than later?",
        "num_comments": 4,
        "comments": [
            "Bachelors Will always be worth it. Youll be more competitive in the job search, be able to negotiate more pay as opposed to a candidate with a HS diploma, will cap out higher, you should do it.",
            "Experience is more important than certifications.  \nCertifications are more important than Associates or Bachelors degrees.\n\nI wouldn't waste time or money on a degree in computer science, information technology, or cybersecurity.  Get a few certifications and get an entry-level job.  You'll be further along in your career in four years without the student loan debt.\n\nEven the US National Cyber Director Harry Coker Jr. has stated that the policy of the US Government is moving towards skill-based hiring for tech over requiring degrees.",
            "Bachelors and Certifications",
            "The early-career job-pool for IT is **FLOODED** right now with minimally-qualified applicants all fighting for positions.  \n\nAn AS or AAS degree in something technical, plus an industry certification or two ***SHOULD*** make you a perfectly qualified applicant for Help Desk, Deskside and possibly even NOC roles.  \n\nBut you will be competing against applicants with 4-year degrees (that may or may not be in IT) and internship experiences or longer lists of technical certifications which will potentially bump you down the list.  \n\nI would encourage you to go for a 4-year degree in Information Systems or Information Technology and make internships a high priority.  \n\nPutting some relevant, technical work experience on your resume before you graduate will be a huge improvement in how your resume is evaluated.  \n\n-----  \n\n | \n---| \n[/r/ITCareerQuestions Wiki](/r/ITCareerQuestions/wiki/index) | \n[/r/CSCareerQuestions Wiki](/r/cscareerquestions/wiki/index) | \n[/r/Sysadmin Wiki](/r/sysadmin/wiki/index  ) | \n[/r/Networking Wiki](/r/networking/wiki/index) | \n[/r/NetSec Wiki](/r/netsec/wiki/index) | \n[/r/NetSecStudents Wiki](/r/netsecstudents/wiki/index) | \n[/r/SecurityCareerAdvice](/r/SecurityCareerAdvice) | \n[/r/CompTIA Wiki](/r/CompTIA/wiki/index) | \n[/r/Linux4Noobs Wiki](/r/linux4noobs/wiki/index) | \n | \n**Essential Blogs for Early-Career Technology Workers** | \n[Krebs on Security: Thinking of a Cybersecurity Career? Read This](https://krebsonsecurity.com/2020/07/thinking-of-a-cybersecurity-career-read-this/) | \n[\"Entry Level\" Cybersecurity Jobs are not Entry Level](https://www.reddit.com/r/SecurityCareerAdvice/comments/s319l5/entry_level_cyber_security_jobs_are_not_entry/) | \n[SecurityRamblings: Compendium of How to Break into Security Blogs](https://www.securityramblings.com/2016/01/breaking-into-security-compendium.html) | \n[RSA Conference 2018: David Brumley: How the Best Hackers Learn Their Craft](https://www.youtube.com/watch?v=6vj96QetfTg) | \n[CBT Nuggets: How to Prepare for a Capture the Flag Hacking Competition](https://www.cbtnuggets.com/blog/training/exam-prep/how-to-prepare-for-a-capture-the-flag-hacking-competition) | \n[David Bombal & Ivan Pepelnjak: 2024: If I want to get into networking, what should I study?](https://www.youtube.com/watch?v=0f19JuhhQvM) |  \n |"
        ]
    },
    "How much programming is there in IT": {
        "title": "How much programming is there in IT",
        "score": 4,
        "url": "https://www.reddit.com/r/ITCareerQuestions/comments/1dr61vx/how_much_programming_is_there_in_it/",
        "content": "Im interning at a banks IT departmant and been scrolling through IT subreddits for a while now and apparently there are lots of programmers in IT but I havent really seen people in my company writing code like the most Ive seen was sql and thats in the data analyst departmant from what Ive seen from mine and others departmant is mostly server work like restarting ,shutting down and monitoring servers kinda like Network engineering I guess. Like there are packages other departmants use but they are definitely not coding those themselves Idk its a medium sized bank so I guess they havent set the IT departmant properly yet but yeah question is Is there really coding in IT?",
        "num_comments": 15,
        "comments": [
            "Technically all programming is in IT ... programming is a branch of IT. You just haven't worked with software developers, because why would you, you work at a bank.\n\nThat said there are definitely a team of programmers at your bank's HQ working on the website and the phone app.",
            "It depends on what role.",
            "I do a decent amount of powershell scripting.",
            "Oh for sure but Im confused about why they arent included in the IT branch?",
            "Yeah there are definitely programmers in the company but when I spoke with my seniors they said the wage gap between programmers and us networkers arent very high which kinda pushed me away from programming a little bcuz I myself love coding but network engineering seems easy and if the wage gap is not that It seems not worth it",
            "When  most people say IT what they actually mean are IT operations, which is where sysadmins and helpdesk live. Development is ussally separate because development is very different from operations, it's much more like research.",
            ">network engineering seems easy\n\nGood one. Whens the last time you had to design multi-path routing solution that had to traverse multiple environments without breaking any of the existing routes?",
            "Try designing an oscillator then get back to me (Its an easy one)",
            "Awww sorry to hurt your feelings buddy. Im an electronics engineer so I compared it to that",
            "That is a very broad question since IT is a blanket term.\n\nYes, there is coding in IT, no, not every job will require it.\n\nCoding is nice to have as a piece of knowledge as certain jobs, you might be able to automate or create nifty tools to assist with daily functions.\n\nNot every facet of IT will require the knowledge. As you say you have seen a little of how the networking team works. Yes, you can work with coding on those, but most of it is going to be beyond anything you would worry about. You would be better served knowing networking concepts, terminologies, and applications than straight coding(again, you can use it, depending on place, but not commonly)"
        ]
    }
}