{
    "Iwtl to be a good listener?": {
        "title": "Iwtl to be a good listener?",
        "score": 7,
        "url": "https://www.reddit.com/r/IWantToLearn/comments/1dqzqgr/iwtl_to_be_a_good_listener/",
        "content": "I zone out when people talk about mundane stuff, but I want to listen. ",
        "num_comments": 7,
        "comments": [
            "Read Supercommunicators by Charles Duhigg.",
            "Theres a technique where you summarize what someone said to you back to them in your own words to make sure you understood them, once u fully understand them then you can tackle it with problem solving skills.\nTrying to understand what someone is telling you is a good way to listen",
            "Good thing to do is pay most attention to their eyes. Dont focus on anything else. Maybe their lips once in a while. Concentrate on what theyre saying.",
            "True. And it's also a good way to subtly let them know that you did listen to what they said and not just waited for them to stop so you could start talking.",
            "Thank you for your contribution to /r/IWantToLearn.\n\nIf you think this post breaks our policies, please report it and our staff team will review it as soon as possible.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IWantToLearn) if you have any questions or concerns.*",
            " I've been told that I'm a great listener and that I am nice to talk to by a friend, so I'll give you what I know. \n\nThe thing is, try to be genuinely interested in them. Don't just wait for them to stop talking so you can say what you want to. That's the problem most people have. They have something in mind already and they are just waiting to say it, so they don't listen to what the other person has to say\n\nSo when someone is talking, take an interest. And when you reply, try to reference something they said, would be preferable if it's some detail and not just a general statement. I do this a lot and people love it. People love it when you take interest and when it's clear that you listened to what they said. \n\nDon't be too caught up on what to say next. That's another thing people struggle with. I usually don't have much to say, but listening to the other person without stressing about that  inadvertently helped me continue the conversation anyway.",
            "You dont need any of those tricks to make it look like youre listening, if you are actually listening.\n\nListen to understand. Dont listen to respond.\n\nDont try to be interesting. Try to be interested.\n\nSee this TED Talk by Celeste Hadlee.\nhttps://m.youtube.com/watch?v=R1vskiVDwl4"
        ]
    },
    "Iwtl to have conversations without revealing personal details?": {
        "title": "Iwtl to have conversations without revealing personal details?",
        "score": 7,
        "url": "https://www.reddit.com/r/IWantToLearn/comments/1dqzq0j/iwtl_to_have_conversations_without_revealing/",
        "content": "",
        "num_comments": 9,
        "comments": [
            "I don't understand your problem. You keep just accidentally telling people shameful secrets while you're trying to discuss the football?",
            "There's no trick to it, you just have to practice.",
            "Make up a persona for yourself.\n\nThat way NO information gets out",
            "If it's something you can get good at by practice then there are tricks to it, you just don't know how to articulate them",
            "Good way to ruin your self esteem, mental health, and trustworthiness with other people if anyone ever realises what you're doing",
            "Thank you for your contribution to /r/IWantToLearn.\n\nIf you think this post breaks our policies, please report it and our staff team will review it as soon as possible.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IWantToLearn) if you have any questions or concerns.*",
            "But those tricks would be unique to the person who's experiencing the problem. Why do they keep blurting out personal information? I have no idea. It is probably for a different reason than I would, if I had that problem.\n\n\nTherefore, my advice would not be applicable to OP. They have to figure it out on their own.",
            "Yes, I agree the tricks will probably be very personal to OP.\n\nBut that's different from saying there's no tricks to it\n\nThere probably are. And if OP gave more information then we might be able to help them figure it out",
            "Me too pal."
        ]
    },
    "IWTL to fluently speak made-up languages": {
        "title": "IWTL to fluently speak made-up languages",
        "score": 5,
        "url": "https://www.reddit.com/r/IWantToLearn/comments/1dr249x/iwtl_to_fluently_speak_madeup_languages/",
        "content": "Like the elven language of Lord of The Rings, or the dothraki language from Game of Thrones.\n\nHow and/or where can I learn languages that are made up for fictional worlds?",
        "num_comments": 2,
        "comments": [
            "If I were you, I would make vocab card on Anki to learn word and when I feel I know enough, try to translate children book.",
            "Thank you for your contribution to /r/IWantToLearn.\n\nIf you think this post breaks our policies, please report it and our staff team will review it as soon as possible.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IWantToLearn) if you have any questions or concerns.*"
        ]
    },
    "IWTL how to not be afraid to sweat?": {
        "title": "IWTL how to not be afraid to sweat?",
        "score": 10,
        "url": "https://www.reddit.com/r/IWantToLearn/comments/1dqx5s7/iwtl_how_to_not_be_afraid_to_sweat/",
        "content": "I do not know why but I have always toned down my work outs to make sure I do not sweat. It is like I do this without even thinking about it. How do I go about working out and making sure to not care about sweating or getting sweaty?",
        "num_comments": 9,
        "comments": [
            "Interesting. I sort of get this, but mostly with non-workout clothes or places out of that kind of context, although I live in a hot climate now so I think Ive gotten more used to it.\n\nWhen you work out, do you specifically wear workout clothes? Because to me, that matters. Theyre mentally designated as sweaty clothes intended for it. Other than that, I think if you can just try to convince yourself to actively try to sweat, like telling yourself sweating means the workout was successful that might help if you do it enough times. Maybe even try to Pavlov yourself with a small reward, haha.",
            "Hydrate first? Sweating is also healthy for you so I think if you just go into your next workout with the goal to work up a sweat you can do it.",
            "Get clothes that are specifically for working out and sweating only. Keep a hamper specifically for these clothes, and wash them separately from your daily clothes.",
            "Is it the sweat itself you don't like or the lead up to the sweating you don't like? For me, that feeling of overheating just before sweating makes me feel uncomfortable.",
            "i used to struggle with this and sometimes still do. even with pushing myself to do yoga, HIIT, crossfit, and powerlifting sweating was NOT my thing and i would do anything to not sweat. ice water, multiple fans on me, cranked AC. then i finally got into heated yoga and bruh i can be in down dog and still sweat! its desensitized me lmao. mentally, other exercises feel TOTALLY different to me now because i have such a drastic decrease in anxiety, etc., around sweating.",
            "Thank you for your contribution to /r/IWantToLearn.\n\nIf you think this post breaks our policies, please report it and our staff team will review it as soon as possible.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IWantToLearn) if you have any questions or concerns.*",
            "Go to a sauna.\n\nOr do swimming as a workout.\n\n.\n\nBut on a deeper issue, this is a psychological thing. So you either just do it and you'll become desensitized to the idea of sweating. Or you talk to a therapist and try to get to the root why you're afraid.",
            "I think you need to be able to answer why you are worried about sweating in the first place. Sweating is a natural human function and reaction to becoming hot. Sweat in and of itself is simply water and some micronutrients. If the issue you have with sweat is the smell or the feeling of being wet and clammy\n\nTo address smell, invest in deodorant and antiperspirants. Dont wear synthetic fibers. Take a shower immediately after working out once you are done for the day.\n\nIf its being clammy and gross feeling, dont wear skin tight athleasure clothing. Wear as loose a set of clothing that you can. Dont work out without air circulating. Keep towels handy. \n\nIf you dont like the feeling of suddenly getting cold because of the need to sweat and air circulating, that is something you will need to acclimate yourself to. Your sweating is a form of protection. Its nothing to be ashamed of when youre doing something thats beneficial (exercise).",
            "Don't sweat. mycarpe <--"
        ]
    },
    "Iwtl to be normal ?": {
        "title": "Iwtl to be normal ?",
        "score": 3,
        "url": "https://www.reddit.com/r/IWantToLearn/comments/1dqzm7j/iwtl_to_be_normal/",
        "content": "I have anxiety depression and ADHD, the combination can be quite debilitating, I’ve been to counselling I’m on medication but I feel very stagnant. \n\nI’m very frustrated at my self for not being able to do the same amount as others my age, what’s the best way to talk to people and to read the room.\n\nExpression is very hard and I’ve been taught to keep a lot to myself. \n\nAny tips on coping with these things or how you cope and not beat yourself up over things you cannot help?",
        "num_comments": 1,
        "comments": [
            "Thank you for your contribution to /r/IWantToLearn.\n\nIf you think this post breaks our policies, please report it and our staff team will review it as soon as possible.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IWantToLearn) if you have any questions or concerns.*"
        ]
    }
}