{
    "Iwtl How to stop interrupting, and crying at confrontation  ": {
        "title": "Iwtl How to stop interrupting, and crying at confrontation  ",
        "score": 6,
        "url": "https://www.reddit.com/r/IWantToLearn/comments/1dr4vys/iwtl_how_to_stop_interrupting_and_crying_at/",
        "content": "I have a disability its not an excuse but I interrupt people without realizing it. I live with a gal and her husband. When he gets mad he yells you guys did this or that and I try to defend the situation. \nThe other issue I cry when I'm confronted. I am being yelled at I'm ruining their marriage. I don't know if I should find another host home. I know before I moved in with them she cheated on him, and a week ago for caught again. I'm not sure their anger is projected onto me. They say their entire world revolves around me. I stay home when they leave for vacations or weekend trips away. I don't understand. ",
        "num_comments": 2,
        "comments": [
            "Thank you for your contribution to /r/IWantToLearn.\n\nIf you think this post breaks our policies, please report it and our staff team will review it as soon as possible.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IWantToLearn) if you have any questions or concerns.*",
            "Next time interrupt yourself..like a mental watchdog kinda thing."
        ]
    },
    "Iwtl to have conversations without revealing personal details?": {
        "title": "Iwtl to have conversations without revealing personal details?",
        "score": 6,
        "url": "https://www.reddit.com/r/IWantToLearn/comments/1dqzq0j/iwtl_to_have_conversations_without_revealing/",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Thank you for your contribution to /r/IWantToLearn.\n\nIf you think this post breaks our policies, please report it and our staff team will review it as soon as possible.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IWantToLearn) if you have any questions or concerns.*",
            "Me too pal.",
            "Make up a persona for yourself.\n\nThat way NO information gets out"
        ]
    },
    "IWTL to fluently speak made-up languages": {
        "title": "IWTL to fluently speak made-up languages",
        "score": 4,
        "url": "https://www.reddit.com/r/IWantToLearn/comments/1dr249x/iwtl_to_fluently_speak_madeup_languages/",
        "content": "Like the elven language of Lord of The Rings, or the dothraki language from Game of Thrones.\n\nHow and/or where can I learn languages that are made up for fictional worlds?",
        "num_comments": 1,
        "comments": [
            "Thank you for your contribution to /r/IWantToLearn.\n\nIf you think this post breaks our policies, please report it and our staff team will review it as soon as possible.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IWantToLearn) if you have any questions or concerns.*"
        ]
    },
    "IWTL how to not be afraid to sweat?": {
        "title": "IWTL how to not be afraid to sweat?",
        "score": 8,
        "url": "https://www.reddit.com/r/IWantToLearn/comments/1dqx5s7/iwtl_how_to_not_be_afraid_to_sweat/",
        "content": "I do not know why but I have always toned down my work outs to make sure I do not sweat. It is like I do this without even thinking about it. How do I go about working out and making sure to not care about sweating or getting sweaty?",
        "num_comments": 9,
        "comments": [
            "Thank you for your contribution to /r/IWantToLearn.\n\nIf you think this post breaks our policies, please report it and our staff team will review it as soon as possible.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IWantToLearn) if you have any questions or concerns.*",
            "Go to a sauna.\n\nOr do swimming as a workout.\n\n.\n\nBut on a deeper issue, this is a psychological thing. So you either just do it and you'll become desensitized to the idea of sweating. Or you talk to a therapist and try to get to the root why you're afraid.",
            "Interesting. I sort of get this, but mostly with non-workout clothes or places out of that kind of context, although I live in a hot climate now so I think I’ve gotten more used to it.\n\nWhen you work out, do you specifically wear workout clothes? Because to me, that matters. They’re mentally designated as “sweaty clothes” intended for it. Other than that, I think if you can just try to convince yourself to actively try to sweat, like telling yourself sweating means the workout was “successful” that might help if you do it enough times. Maybe even try to Pavlov yourself with a small reward, haha.",
            "I think you need to be able to answer why you are worried about sweating in the first place. Sweating is a natural human function and reaction to becoming hot. Sweat in and of itself is simply water and some micronutrients. If the issue you have with sweat is the smell or the feeling of being wet and clammy…\n\nTo address smell, invest in deodorant and antiperspirants. Don’t wear synthetic fibers. Take a shower immediately after working out once you are done for the day.\n\nIf it’s being clammy and gross feeling, don’t wear skin tight athleasure clothing. Wear as loose a set of clothing that you can. Don’t work out without air circulating. Keep towels handy. \n\nIf you don’t like the feeling of suddenly getting cold because of the need to sweat and air circulating, that is something you will need to acclimate yourself to. Your sweating is a form of protection. It’s nothing to be ashamed of when you’re doing something that’s beneficial (exercise).",
            "Hydrate first? Sweating is also healthy for you so I think if you just go into your next workout with the goal to work up a sweat you can do it.",
            "Get clothes that are specifically for working out and sweating only. Keep a hamper specifically for these clothes, and wash them separately from your daily clothes.",
            "Is it the sweat itself you don't like or the lead up to the sweating you don't like? For me, that feeling of overheating just before sweating makes me feel uncomfortable.",
            "i used to struggle with this and sometimes still do. even with pushing myself to do yoga, HIIT, crossfit, and powerlifting— sweating was NOT my thing and i would do anything to not sweat. ice water, multiple fans on me, cranked AC. then i finally got into heated yoga and bruh… i can be in down dog and still sweat! it’s desensitized me lmao. mentally, other exercises feel TOTALLY different to me now because i have such a drastic decrease in anxiety, etc., around sweating.",
            "Don't sweat. mycarpe <--"
        ]
    },
    "Iwtl to be a good listener?": {
        "title": "Iwtl to be a good listener?",
        "score": 4,
        "url": "https://www.reddit.com/r/IWantToLearn/comments/1dqzqgr/iwtl_to_be_a_good_listener/",
        "content": "I zone out when people talk about mundane stuff, but I want to listen. ",
        "num_comments": 3,
        "comments": [
            "Thank you for your contribution to /r/IWantToLearn.\n\nIf you think this post breaks our policies, please report it and our staff team will review it as soon as possible.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IWantToLearn) if you have any questions or concerns.*",
            "Good thing to do is pay most attention to their eyes. Don’t focus on anything else. Maybe their lips once in a while. Concentrate on what they’re saying.",
            "Read “Supercommunicators” by Charles Duhigg."
        ]
    }
}