{
    "Welcome to /r/JapanTravelTips! If you're new to the subreddit, start here.": {
        "title": "Welcome to /r/JapanTravelTips! If you're new to the subreddit, start here.",
        "score": 71,
        "url": "https://www.reddit.com/r/JapanTravelTips/comments/19cfb5s/welcome_to_rjapantraveltips_if_youre_new_to_the/",
        "content": "Hello! Welcome! We are the sibling subreddit of /r/JapanTravel. While /r/JapanTravel is for detailed and researched posts, /r/JapanTravelTips is for more unstructured questions and advice. We welcome posts of (almost) all kinds, especially advice for fellow travelers and questions meant to generate discussion.\n\n**This subreddit is intended for questions and discussion about traveling _within_ Japan.** If you have more general travel questions about topics like flights/airfare/hotels/clothing/packing/etc., please direct those to subreddits such as /r/flights, /r/travel, /r/solotravel, /r/awardtravel, /r/onebag, /r/hotels, /r/airbnb, or similar (as applicable).\n\nIf you are just starting your Japan travel planning, make sure to check out /r/JapanTravel’s [wiki](https://www.reddit.com/r/JapanTravel/wiki/faqs/japantravel/) and [resources page](https://www.reddit.com/r/JapanTravel/wiki/resources/). The wiki includes a bunch of information about common topics such as:\n\n* [Immigration and Customs](https://www.reddit.com/r/JapanTravel/wiki/advice/airportimmigration/)\n* [Internet/SIM Cards/Pocket WiFi](https://www.reddit.com/r/JapanTravel/wiki/advice/technology/internet/)\n* [Budgeting](https://www.reddit.com/r/JapanTravel/wiki/advice/budget/budgeting/)\n* [Luggage Forwarding](https://www.reddit.com/r/JapanTravel/wiki/advice/luggage/storageandforwarding/)\n* [Exchanging Currency](https://www.reddit.com/r/JapanTravel/wiki/advice/currencyandpayment/)\n* [IC Cards](https://www.reddit.com/r/JapanTravel/wiki/advice/transport/iccards/)\n* [JR Passes](https://www.reddit.com/r/JapanTravel/wiki/advice/transport/jrpass/)\n* [Onsen and Onsen Towns](https://www.reddit.com/r/JapanTravel/wiki/advice/culture/onsen/)\n* [Prescription Medication](https://www.reddit.com/r/JapanTravel/wiki/advice/health/prescriptions/)\n\nPlease be sure to abide by the rules, keep things on-topic, and stay civil.",
        "num_comments": 0,
        "comments": []
    },
    "Do you have a JR Pass or IC Card (Suica/Pasmo/etc.) question? Start here! (Monthly Thread - June 01, 2024)": {
        "title": "Do you have a JR Pass or IC Card (Suica/Pasmo/etc.) question? Start here! (Monthly Thread - June 01, 2024)",
        "score": 3,
        "url": "https://www.reddit.com/r/JapanTravelTips/comments/1d5jnlx/do_you_have_a_jr_pass_or_ic_card_suicapasmoetc/",
        "content": "Got a question about JR Passes or IC cards (Suica/Pasmo/ICOCA/etc)? Read through the information below and feel free to ask additional questions in this thread! Please [see here](https://www.reddit.com/r/JapanTravelTips/search/?q=%22Do%20you%20have%20a%20JR%20Pass%20or%20IC%20Card%20(Suica%2FPasmo%2Fetc.)%20question%3F%22&restrict_sr=1&sort=new) for old versions of this megathread.\n\n## JR Pass Info\n\nThe nationwide JR Pass is a travel pass that allows train and bus travel for a fixed cost over a certain period of days on Japan Railways (JR) services. For a comprehensive source of information on the pass, check out [our wiki page](https://www.reddit.com/r/JapanTravel/wiki/advice/transport/jrpass/) or [Japan Guide’s JR Pass page](https://www.japan-guide.com/e/e2361.html).\n\nThe JR Pass can be purchased in one of two ways:\n* Online at the [official site](https://japanrailpass.net/en/)\n* Online from an authorized retailer (also often called a \"third-party seller\")\n\nThere is no way to be certain if a JR Pass will be valuable for you without knowing your exact itinerary and doing the math out. If you are trying to work out whether a JR Pass is the right choice for you, here are some calculators:\n* [JRPass.com’s calculator](https://www.jrpass.com/farecalculator)\n* [Japan Guide’s calculator](https://www.japan-guide.com/railpass/)\n* [Daisuki calculator](https://www.daisuki.com.br/jrpass_calculator.html)\n\n**As of October 1, 2023, the nationwide JR Pass and regional JR Passes have increased in price significantly.** The price increase makes it so that there are _very few itineraries_ that the nationwide JR Pass will be worth it for. For more information and discussion on the price increase, see [this search result of prior discussion threads](https://www.reddit.com/r/JapanTravel/search/?q=jr+pass+increase).\n\n## IC Card Info (Suica, Pasmo, ICOCA, etc.)\n\n### General Information\n\nAn IC card is a stored-value card used to pay for transportation in Japan. That means you can load the card with money and use the card to pay for trains, buses, etc by tapping the card at train station gates or fare readers. Even if you have a JR Pass or other travel pass, an IC card is recommended because it can be used across transportation systems operated by many different transit companies, as well as for payment at convenience stores, restaurants, shops, vending machines, and other locations.\n\nFor tourism purposes, there are nine major IC cards and all of them are completely interchangeable and usable in each other's regions, so it doesn’t really matter which one you get. Where you start your travels in Japan often dictates what IC card you get, since different IC cards originate in different regions, but then you'll be able to use it during most of your traveling, even if you move to a different region. For general information on IC cards, see [our wiki](https://www.reddit.com/r/JapanTravel/wiki/advice/transport/iccards/) or [Japan Guide’s IC card page](https://www.japan-guide.com/e/e2359_003.html).\n\n## Physical IC Cards\n\nCurrently, sales of regular Suica, named Suica, regular Pasmo, and named Pasmo cards [are _technically_ suspended due to a semiconductor shortage](https://www.timeout.com/tokyo/news/sale-of-pasmo-and-suica-cards-suspended-except-those-for-tourists-080223) (except children's versions and commuter versions). That said, there have been recent reports in early 2024 of people getting regular Suica cards at some stations in Tokyo.\n\n**If you are landing in/starting your trip in Tokyo,** tourists can still get:\n\n* A [Welcome Suica](https://www.jreast.co.jp/multi/en/welcomesuica/welcomesuica.html) at Haneda Airport (HND) or a [Pasmo Passport](https://www.pasmo.co.jp/visitors/en/) at both Tokyo airports (HND and NRT) (**Note:** Pasmo Passport will be discontinued in August 2024, and may be subject to limited availability before then, based on supply)\n* _Possibly_ a regular Suica at some major JR East stations in Tokyo (subject to limited availability)\n* _Possibly_ a [Toica IC card](https://global.jr-central.co.jp/en/tickets/buy/toica/) at the JR Central portions of Tokyo Station (Yaesu North Exit) and Shinagawa Station (Shinkansen North Exit) (subject to limited availability)\n* A  digital IC card (see next section for more information)\n\nA Welcome Suica or Pasmo Passport acts exactly like a regular IC card, with two exceptions: it is only valid for 28 days, and it cannot be refunded. Please see [this thread and its top comment](https://www.reddit.com/r/JapanTravel/comments/15ebhwb/issuing_of_personalized_suica_and_pasmo_cards_is/) for information.\n\n**If you are starting your trip in another region** (e.g., Kansai, Kyushu, etc.), sales of their regional IC cards are unaffected by Suica and Pasmo shortages. Please see [this page](https://www.japan-guide.com/e/e2359_003.html) to identify which card you'll get, and it should be available at airports and train stations in those regions.\n\n### Digital IC Cards\n\nIf you are looking to get a digital IC card, please note that digital Suica, Pasmo, and ICOCA cards can only be used on iPhones, Apple Watches, or *Japanese* Android phones (this means the phone was purchased in Japan). For instructions on how to get a digital IC card in Apple Wallet, see [here](https://support.apple.com/en-us/HT207155). You _do not_ need the Suica or Pasmo apps (which are all in Japanese) in order to get a digital IC card. It can be loaded and used entirely through Apple Wallet.\n\nPlease note that not all credit cards work to load a digital IC card. Amex cards seem to have the highest success rate, but Mastercards and Visas can be flaky. Although Visa previously didn't work at all, as of December 2023, loading a digital Suica with some Visa credits cards seems to work, although not all of them. See this [At A Distance blog post](https://atadistance.net/all-about-apple-pay-suica-recharge/) for more info and updates. It is not uncommon to not have any of your cards work to load a digital IC card, and if that happens, you might need to stick with a physical IC card.\n\nKeep in mind that digital IC cards cannot be refunded (that requires a Japanese bank account), so you will need to burn down whatever value you’ve loaded onto them before the end of your trip.\n\n### IC Card FAQ\n\n**I have an old IC card from a previous trip. Can I use it on my upcoming trip?**\n\n> IC cards are valid for ten years after their last date of use, so if you received the card and/or used the card in/after 2014, it’ll work.\n\n**Can more than one person use the same IC card for travel?**\n\n> No. All travelers who want to use IC cards on transit need to have their own card. Most transit in Japan is distance-based, and the card is “keeping track” of your journey, and it can only keep track of one at a time.\n\n**Are there children’s IC cards? How do I get one for my child?**\n\n> Children under six years old can ride transit for free. If your child is between the ages of six and eleven, you can get a children’s IC card from JR offices by presenting the child’s passport for proof of age. There are also Welcome Suica and Pasmo Passport versions for children. If you are getting IC cards at the airport, they are able to provide children’s cards.\n\n**Can I load money onto a physical IC card with a credit card?**\n\n> No. Physical IC cards can only be loaded with cash, which can be done at ticket machines in train stations, convenience stores, and 7-Eleven ATMs. \n\n**I have a physical IC card and I want to transfer it to my phone. If I do that, can I still use the physical card?**\n\n> No. Once you “move” the physical card to your phone and turn it into a digital card, the physical card becomes invalid. It cannot be used or reactivated.\n\n**I’m landing in Tokyo, but then I’m going to Osaka and Kyoto. Do I need a suica in Tokyo and then an ICOCA in Osaka/Kyoto?**\n\n> No. Once you have one of the major IC cards, it can be used pretty much anywhere. There are some exceptions to this, but they are mostly on individual lines or in specific rural regions. If you are traveling to major tourism cities such as Tokyo, Kyoto, Osaka, Hiroshima, Fukuoka, etc., you are likely fine with whatever IC card you originally received upon arrival.\n\n**Should I buy an IC card online before arriving in Japan?**\n\n> If you want to get an IC card online from a reputable vendor, there’s nothing wrong with that. Some of the authorized JR Pass website (as well as other websites targeted at tourists) will sell them bundled with other purchases. That said, there isn’t really any reason to get your card ahead of time. If you’re landing in Tokyo, the 28-day Welcome Suica or Pasmo Passport is good enough for most tourists. And if you do end up in the country for longer than 28 days, you can simply get an IC card from another region once you’re in one (such as the ICOCA from Kansai).\n\n**Help! I tried to load my digital IC card through Apple Wallet and the transaction didn't go through! What do I do?**\n\n> To start, did you attempt to create it/load it overnight in Japan? The digital system goes down for maintenance from about 1am to 5am JST, so try again during Japan's daytime hours. Beyond that, Visa cards often cannot be used to load digital IC cards. Mastercards sometimes have issues too, depending on the issuing bank. Unfortunately, if you can't find a digital card + credit card combo that works for you, you may not be able to use digital IC cards.\n\n### Recent IC Card Threads\n\nTo see some recent discussion on IC cards, check out [the following threads from our search results here](https://www.reddit.com/r/JapanTravelTips/search/?q=IC+card).",
        "num_comments": 184,
        "comments": [
            "Landed at NRT on 6/17. Suica was available in both T1 and T2.",
            "For those traveling soon, I was able to get Suica cards at Narita Terminal 1 today.",
            "I can confirm from last week that you can indeed get Suica cards again. I got mine and my daughters childrens one at Tokyo station and a friend got one at Ikebukuro.",
            "As of 6/21 at Narita Terminal 2, Pasmo Passport at the Skyliner and Keisei info center and regular Suica at the JR East travel center were both available for purchase.",
            "Well, I just boarded the Narita Express from terminal 1. I can confirm that the JR travel center DID have regular suica cards. I just bought 5 of them for the family.",
            "I understand each person needs their own IC card but if you're reserving seats or paying a supplement (e.g. for Nozomi or other express train) does each person need to do it individually or can one person do it for the group?",
            "I saw a notice that SUICA card sales will be suspended on June 8 on their website. Does anyone know more about this?",
            "So just to clarify, assuming I want to avoid the JR Pass - if I want to travel across regions (Tokyo > Kyoto > Hiroshima, etc), I have to get an individual JR ticket for the trip (either regular train or Shinkansen)? Then, within any region, IC cards are good for most travel (unless trying to use a JR specific train line)?",
            "Fresh update: on Narita Terminal 1, ordinary Suica (not Welcome Suica apparently) can be purchased (only with cash) at the JR East office (basement level).\nI think the Keisei office next door has Pasmo but I think only with online reservation.",
            "I will be heading to Japan soon, and our first stop is in Sapporo. Is there any particular IC card we should get? I know there are options for Suica and Pasmo cards on Apple Wallet, but I also know there's the Pasmo Passport and Welcome Suica cards, and I was just wondering which one is more worth it."
        ]
    },
    "All the pokemon cafe reservation tips gathered": {
        "title": "All the pokemon cafe reservation tips gathered",
        "score": 10,
        "url": "https://www.reddit.com/r/JapanTravelTips/comments/1dr614w/all_the_pokemon_cafe_reservation_tips_gathered/",
        "content": "Alright, I’ve been so obsessed myself trying to book a Pokémon cafe reservation for our upcoming vacation, that I think I’ve read all the possible post/blog and youtube there is about it.\nSo.. I want to put everything I found here in one place for other people. \nBTW, I’ve managed to make a reservation successfully a few times (say 1 in 10 tries XD, with two people in two laptops trying), it really is hard. but with right effort, and help, you can manage it too! It’s also part of the fun :>\n\nI’ll start with my own two cents..\n\n***1.a - Resellers.** I know.. I’m not even a fan. I’ll just get it out and be done with this, a lot of people have also suggested this. There are a couple out there reselling an existing reservation. And also an awful lot of scammers!! I didn’t use it myself as I am also against it. They are one of the reason why it became more difficult for normal people like us. I definitely believe they use bots, as how can a normal human get a reservation within seconds?! We need to stop patronizing them so they stop doing their business. I think most of the cancellations we see one day before are from them from the unsold slots… I even saw one advertising the dates they have secured and available to sell, so… Let us all help stop them, and please stop buying, be prepared like the rest, who did their research in advance and gave their best effort during the advanced reservation. \n\n\n***1.b Booking service agents.** I see this differently as the “resellers”. Who knows maybe they are the same. That’s why I still has mixed opinion about them. There are some\noffering doing the reservation for you like your personal assistant. I guess they can be OK, if you really don’t want to waste your own time and get stressed trying for days for that one time reservation. If you don’t have time, and you have the money, why not. I won’t be recommending anybody as I didn’t use it myself (the cheapskate that I am as well (@~@). I found the prices also absurdly high for a reservation that is supposed to be free. Some are reasonable though. I saw them in facebook and fiverr, and there are others with their official website. Again, be wary of scammers.\n\n\n*From here on my experience and tips on getting that reservation* ——>\n\n***2 - Slot opening day/time:** reservation open up 31 days in advance at 6pm Japan time. Get prepared for the day you want (one month ahead). Open up the cafe reservation page, select guest #, click on (future) day you want. it will say N/A. That is correct, just click it so you are ready, text will be bold once clicked. the previous day should say Full, then you know the day after, that is N/A will be open for the upcoming one month advanced reservation.\n\nMake sure you navigate to the calendar page at most 10 mins before 6pm JST. Otherwise if you have it open for too long, your session will be invalid. And when you click next, you will have to start from beginning, lost chance already.\n\n\n***3 - Minutes before opening time (6pm JST release time\nof reservation slot):** open a world time with seconds in another browser, set it side by side in your screen or something so you have the pokemon reservation calendar page open, and the time up to seconds visible. place you mouse on the Next/Submit button (note: desired month and date should have been pre-selected at this point), ready you other hand or finger at the F5 - refresh key on your keyboard.\n\nOnce the seconds count up to 5:59:59 JST, click Submit button. If it is not a peak day, click on 6:00:00 exactly is best, this is where you need to practice to get the best timing that will work for you and also see how fast your device reacts, Sometimes clicking one second too early gives you “Sorry no seats available for selected day/time” and then this is a missed chanced again because you have to start all over.. It depends on how busy that day is really. precisely 06:00:00 is always safest. But sometimes that one second ahead helps!!\n\n\n***4 - Time selection:** If you get to this page, BE QUICK, as all others says. that is true, you have to BE THE FIRST to select an available time, ANY time. Because if multiple people have selected it, and you are milliseconds late, you will get “Sorry no seats available on selected time”. Missed chance for you. Try not to select the very first, as that is easiest, so more people will surely select it at same time. This will be highly dependent on your luck too and computer speed, if you are the fastest.. \n\nThat is why, it is best to increase your chances by asking every capable person in your circle to try get a reservation, on multiple devices. For me I have a gaming laptop, so I guess it gave me an edge on loading speed. And two persons are trying for us. Note if multiple people in your family are trying to get a slot, assign to pick a different time each. You don’t want all of you picking the same time since it gets reserved to only one.\n\n\n***5 - Busy reloading page:** This is where your other finger should be ready with the refresh F5. once you see this page, for both after the Submit at calendar page and after select time page, hit F5 immediately. wait for refresh to finish and if still a busy page, just keep refreshing - again for both moments! before you get to select time page and after you have selected time!\n\n\n***6 - Registration details:** Once you get to this page then your slot is secured. CONGRATULATIONS! you just need to finish the registration, and confirm to officially reserve your day and time. Be ready with a hiragana version of you name, and email of course for the auth code verification. Sometimes you get the busy page after filling the details and click next, it’s ok, just patiently refresh with F5. You don’t need to rush at this point as long as you receive an email with the authentication code. You still need to complete within 15 mins though. Else your reservation will get released for the next opening time…\n\n\n***7 - 20 and 40 minute mark chances:** is real! if you missed the 6:00 pm chance, wait again in 20 or 40 minutes. Sometimes even at 7pm, depends how many are still available at every round. Here you can ready the page up to the time selection, and just refresh at 06:20:00 or 06:40:00 mark. Again, session time\ncounts, so just prepare the page at most 10 minutes ahead.\n\n\n*…….And here are the other tips I’ve gathered in other posts. I’ve definitely used all these tips and wouldn’t have gotten myself a reservation without them. Also Thank you from me for the rest sharing their experience!!*\n\n***8 - general tip** what I’ve summarized above [https://www.reddit.com/r/JapanTravel/comments/11bh4xf/my_experience_making_pokemon_cafe_reservations/](https://www.reddit.com/r/JapanTravel/comments/11bh4xf/my_experience_making_pokemon_cafe_reservations/)\n\nand this one, also detailed tips and trick that  will give you higher chance of success!\n[https://www.reddit.com/r/JapanTravelTips/comments/17egft7/comment/kqcq1vr](https://www.reddit.com/r/JapanTravelTips/comments/17egft7/comment/kqcq1vr)\n\n\n***9 - comment with url directly pointing to day/time selection.** This one didn’t work for me, not sure if it is outdated already, or pokemon cafe changed their backend process, or I just don’t understand how to use it correctly \nhttps://www.reddit.com/r/JapanTravel/comments/11bh4xf/comment/ja82ue3\n\n\n***10 - if you want to be one of them\nbots probably..** here is instruction how you can automate some of the steps of reservation\n[https://medium.com/@patrickgwl/how-to-get-a-pok%C3%A9mon-cafe-reservation-in-japan-daccd1835237](https://medium.com/@patrickgwl/how-to-get-a-pok%C3%A9mon-cafe-reservation-in-japan-daccd1835237)\n\n\n***11 - good discussions on common tips.**  Also mentions chances when there is cancellations. Good thread read\n[https://www.reddit.com/r/JapanTravelTips/comments/15biqb0/pokemon_cafe_reservations_dont_be_discouraged](https://www.reddit.com/r/JapanTravelTips/comments/15biqb0/pokemon_cafe_reservations_dont_be_discouraged)\n\n\nHow about you what was your experience or success story in getting the reservation? Please feel free to add in the comments something new you’ve discovered yourself about tips getting the reservation. Or any reservation experience you want to share =D\n",
        "num_comments": 0,
        "comments": []
    },
    "Daikoku Car Meet": {
        "title": "Daikoku Car Meet",
        "score": 1,
        "url": "https://www.reddit.com/r/JapanTravelTips/comments/1drbfqt/daikoku_car_meet/",
        "content": "I went by Daikoku today at around 9.30 pm and was unpleasently surprised by a single police car and no car meet whatsoever. Is it shut down? I found a video on the matter from 2 days ago, but im pretty sure the shots and video were from last weekend. Any info?",
        "num_comments": 0,
        "comments": []
    },
    "Beef lover and restaurants ": {
        "title": "Beef lover and restaurants ",
        "score": 1,
        "url": "https://www.reddit.com/r/JapanTravelTips/comments/1drbecl/beef_lover_and_restaurants/",
        "content": "Beef lover here. \n\nI have shortlisted some famous restaurants. However, I won't be able to try all the restaurants. Which of the restaurants is a must try when I'm in tokyo? Any other recommendations? \n\n1) Yakiniku Motoyama Shinjyuku (Korean inspired bbq with Kobe beef)\n2) Roast Beef Ohno \n3) Gyukatsu Motomura\n4) Center Beef @WEST-Shinjuku (japanese steakhouse)\n5) Miyoshitei Hitsumabushi (beef rice bowl)",
        "num_comments": 0,
        "comments": []
    }
}