{
    "The r/Jerma985 FAQ": {
        "title": "The r/Jerma985 FAQ",
        "score": 1182,
        "url": "https://www.reddit.com/r/jerma985/comments/nw3am9/the_rjerma985_faq/",
        "content": "Welcome to r/Jerma985! :)\n\n**Official links:**\n\nJerma's Twitch stream: [https://www.twitch.tv/jerma985](https://www.twitch.tv/jerma985)  \n2ndJerma channel (stream highlights): [https://www.youtube.com/channel/UCL7DDQWP6x7wy0O6L5ZIgxg](https://www.youtube.com/channel/UCL7DDQWP6x7wy0O6L5ZIgxg)  \nOriginal Jerma985 channel: [https://www.youtube.com/user/Jerma985](https://www.youtube.com/user/Jerma985)  \nJerma's Twitter: [https://twitter.com/Jerma985](https://twitter.com/Jerma985)\n\n**Other useful links:**\n\nThe \"Required Reading\" thread: [https://www.reddit.com/r/jerma985/comments/vvarpn/the\\_jerma985\\_required\\_reading\\_thread/](https://www.reddit.com/r/jerma985/comments/vvarpn/the_jerma985_required_reading_thread/)  \nJerma stream archive: [https://www.youtube.com/channel/UC2oWuUSd3t3t5O3Vxp4lgAA](https://www.youtube.com/channel/UC2oWuUSd3t3t5O3Vxp4lgAA)  \nDiscord ban appeals: [https://www.reddit.com/r/jerma985/comments/mkaj8e/discord\\_ban\\_appeals](https://www.reddit.com/r/jerma985/comments/mkaj8e/discord_ban_appeals/)  \nJerma lore wiki: [https://jerma-lore.fandom.com/wiki/Jerma\\_Lore\\_Wiki](https://jerma-lore.fandom.com/wiki/Jerma_Lore_Wiki)  \nJerma clips megathread: [https://www.reddit.com/r/jerma985/comments/mbn66m/jerma\\_clips\\_megathread/](https://www.reddit.com/r/jerma985/comments/mbn66m/jerma_clips_megathread/)  \nMore links to nifty stuff: [https://www.jerma.org/](https://www.jerma.org/)\n\n**FAQ:**\n\n**Is this subreddit run by Jerma, or any of his mods?**  \nNope, we're just fans, but we run it relatively close to Jerma's Discord and Twitch chat.\n\n**How can I find out when the next stream will be?**  \nYou can type \"!sus\" in Jerma's Twitch chat, or check the #schedule-forecast channel in the Discord.\n\n**Can you contact Jerma for me?**  \nIt's nearly impossible to contact him directly, unfortunately, but any business inquires can be forwarded to jerma@evolved.gg! \n\n**Can I appeal my subreddit ban?**  \nIt depends on the severity of the situation, but you can reach out to us by clicking \"message the mods\".\n\n**I was banned from Twitch chat/Discord/etc, can I appeal it here?**  \nWe don't handle bans outside the subreddit - Twitch bans can be appealed through Twitch, and Discord bans can be appealed [here](https://dyno.gg/form/3a9e2855). ",
        "num_comments": 93,
        "comments": [
            "It is impossible to contact Jerma. He lives in the woods all by himself. The man is off the grid to escape his dumptruck-hungry fanbase.",
            "Anyone else find the phrase \"it's nearly impossible to contact him\" really depressing for some reason?",
            "Hello I hope this is the right place to ask this. Why is Jerma so smelly?",
            "I have a question that isn't listed. Are you guys aware that the flairs on old reddit are broken?",
            "Who tf is Jerma and why do you guys simp so hard?  Serious question",
            "Does anyone remember the clip where he goes into a closet for some reason, gets out, and pretends to have been in there for 30 years? If so, can someone link me the clip? Thanks",
            "What would be considered an off topic post? Like if I got a onion ring in my French fries and titled it pog?",
            "Ever since the whole Rat problem of 96, 1896 that is. Jerma has been pretty hard to contact.",
            "Hey on the doll house stream i can't click any of the item purchase menu stuff except the action ones. How do i fix this?...",
            "Anyone know what his birth chart is?"
        ]
    },
    "I GOT A FRENCH FRY IN MY ONION RINGS": {
        "title": "I GOT A FRENCH FRY IN MY ONION RINGS",
        "score": 193,
        "url": "https://www.reddit.com/gallery/1dr8x4a",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Why didn't you hold it with your index finger",
            "Looks like the onion ring shitted that out",
            "OHHH MY GO FRENCH FRY ITS A FRENCH FRY !!",
            "Quickly, eat it as if Chat is gonna rch through the screen and steal it",
            "yeah I did not eat that shit lol",
            "fucked up looking fry",
            "That's a french burn victim",
            "tarantula leg",
            "What restaurant is this?",
            "The thing that everybody"
        ]
    },
    "carried jerma with me to a trans march": {
        "title": "carried jerma with me to a trans march",
        "score": 358,
        "url": "https://i.redd.it/wsxdcubucf9d1.jpeg",
        "content": "",
        "num_comments": 20,
        "comments": [
            "I read that as match and thought you were going into battle",
            "didnt see the charm at first so i thought you were saying he was the flag",
            "I didn't see the logo, so I thought you were saying that Jerma was the trans flag.",
            "Jerma is literally an lgbtq icon",
            "I love being a trans Jerma fan",
            "wait where did you get the charm???",
            "The one time he went out of his way to stick up for trans fans in the chat, very bluntly and directly in a way a lot of content creators don't really struck a chord with people",
            "Hes stated on several streams that hes super open and accepting, and he shuts down any homophobia etc IMMEDIATELY. There was also a stream where he was doing a silly wizard RP and another random called him (or just said it in general I forgot) the f slur, and he quickly became very down and stopped the RP, and moved somewhere else in the game map. He talked to chat then as well about not accepting that shit in the slightest",
            "from what ive observed, its mainly bc of the fact that he makes his community safe and open for everyone. he automatically comes across as very chill and respectful just from the ways that he communicates and interacts generally.",
            "I find it so funny that hes stated hes both straight and cis yet the fact that hes so openly accepting has made him such a big icon lol"
        ]
    },
    "Saw a jerma pride flag at the pride parade today in helsinki, finland.": {
        "title": "Saw a jerma pride flag at the pride parade today in helsinki, finland.",
        "score": 21,
        "url": "https://i.redd.it/icmnx0y74j9d1.jpeg",
        "content": "I was so taken aback by this. Any explanations on why he’s on the pride flag? ",
        "num_comments": 2,
        "comments": [
            "Thats random as fuck and I absolutely love it",
            "jorma985"
        ]
    },
    "my girlfriend made these for me at work today <3": {
        "title": "my girlfriend made these for me at work today <3",
        "score": 164,
        "url": "https://i.redd.it/llmao8hepe9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "SO CUTE!!! By any chance you know where she got the beads for it?",
            "just on amazon! she searched \"friendship bracelet beads\", it's the quefe beads lol",
            "What is her job"
        ]
    }
}