{
    "Success and Disappointment Megathread for the Week": {
        "title": "Success and Disappointment Megathread for the Week",
        "score": 11,
        "url": "https://www.reddit.com/r/jobs/comments/1dmyrkh/success_and_disappointment_megathread_for_the_week/",
        "content": " This is the weekly success and disappointment Megathread for the week. Please post all of your successes and disappointments for this week, including job offers and other victories, as well as any venting of frustration, in this thread, and this thread only. Thanks!",
        "num_comments": 53,
        "comments": [
            "Start my new job tomorrow bright and early.",
            "Got laid off back in March and after 3.5 months of applying non-stop, getting ghosted, messing up final round interviews, lots of tears, waking up in the middle of the night because of nightmares and isolating myself from people because of shame... i finally landed a job! I start in 3 weeks which means I get to enjoy summer. Hang in there folks! It only takes one \"yes\".",
            "I was fired in early June and I spent the whole month applying and interviewing like crazy and I finally got the offer! Signed today and submitted background check info and now as long as nothing goes wrong, I start on Monday! Better pay and better job than I've ever had so I'm so excited.",
            "Success?: I have a tentative offer as an employment specialist starting in the fall, theres some murkiness on why its taking as long but Im using the time between now and then to look around to see if there are other job opportunities",
            "I got fired  I was the last person in my office remaining after everyone else quit or got fired, saw the writing on the wall so I already have a new job, but got my official notice midnight last night.",
            "After 2 years of applying to various jobs and not even getting a response, today I got an offer from a place that I actually really like. Now I'm freaking out because it's time for the background check and my current employer is an absolute organizational shitshow. My immediate supervisor barely knows my name. I've worked in a new role at this company for the past year and that's the role that made me qualified for the job I just got offered, but I'm 95% sure that my supervisor's supervisor never actually documented my new role with HR (long story). I'm worried that when HR is contacted to confirm my background details, they'll say they have no record that I did this role. This place has screwed me over so many times, to the point that we all have a department-wide joke about it, and if they cost me this job offer I'm going to lose my mind. \n\nBut yay I finally got an offer!",
            "Just got my official written offer after a month of back and forth with the team. In my neighborhood and in my preferred field with great people my age. :)",
            "Finally secured a job in my preferred industry! Salaried position with overtime  and profit share and full benefits with a simple IRA with a 3% company match.",
            "Have some follow up interviews this week and should get my first batch of Unemployment, not great but I feel that good things are coming",
            "A recruiter reached out to me for a Data Analyst position. Had my screening with HR and Manager today. Fingers crossed. This opportunity will change my life."
        ]
    },
    "Anyone kind of regret their degree?": {
        "title": "Anyone kind of regret their degree?",
        "score": 81,
        "url": "https://www.reddit.com/r/jobs/comments/1dr3t3f/anyone_kind_of_regret_their_degree/",
        "content": "I graduated with a Marketing degree with a dual minor and I've been working since 2020. I've been working in HR and to be honest, it hasn't been that great. HR itself is fine but the wage and companies have been a rough experience. First role was underpaid and toxic, second was a contract that didn't go permanent and third laid me off along with a few others due to budgeting. I'm at my fourth company out of school on contract.\n\nSo while my friends are getting promotions, new job opportunities, vacationing and getting homes, I just feel stuck. I'm making $32/ hour with no benefits and rarely any OT. I moved back home to save some money up for a home but I keep thinking if my life would be more stable if I had graduated in Accounting or something. I had friends who started at $60k - $70k while I worked my way up in experience. Some of them didn't even do well in school.\n\nI'm not even sure what to do at this point. I've looked at getting certifications, an MBA or maybe looking for a new line of work and I just don't know at this point. I guess I'm just rambling at night at this point. But yeah, I think about if I should have picked a different degree. No one to blame other than me.\n\nFunny enough, I was initially an accounting student and just had the 400 level classes left, but everyone in that field told me how much they hated their jobs. Long hours, low pay, high stress. It sounded terrible in all honesty. I met dozens of people over my college career including internship supervisors and the story was always the same. The reddit also didn't help.\n\nNight anxiety rant over.",
        "num_comments": 91,
        "comments": [
            "$32/hr is over $65k/year. Thats not a bad salary!",
            "Wasted three years on a bachelor in Biology. There are no jobs in Sweden, except working on the institution but all the jobs are not payed ones...The situation is so bad that their was only one full time marine biologist in Sweden. I hated my self for many years until I accepted my loss and studied 5 years in engineering. Working as an engineer for 5 years now and I out-earn 75 % of all engineers with same years of experience now. Accept your loss like me and pick a new career.",
            "Masters in marketing. Cant find a job.",
            "English/Poli Sci double major here. I was fist in my family to graduate from college so everyone was jacked about that. Then i worked 11 years at Frito Lay as a driver/salesman which was the worst job I could have imagined for myself. I literally wanted to die. I worked 50-60hrs per week at a job I hated for 11 years. Then I went to work for the state helping people apply for public benefits. Took a MAJOR pay-cut to go there but my boss asked for my college transcript at the interview and that was huge for me. Been here almost 5 years, working from home, great work/life balance,  and almost making what I did at Frito. Happy to be where I am but I could have gotten here with a lot less pain had I been smarter about how I went about college. As a 38 year old with 3 kids, an affordable mortgage, not worried about homelessness, I can't complain.",
            "Nah, couldn't afford one. Wanted to get one but I can't manifest money out of thin air. Did well for myself and still love learning but am glad I never went into debt. May reconsider if I do well enough, just for the learning, I think history would be fun.",
            "Philosopher here hahahaha, yeah, i regret it",
            "I'm in the exact same boat, but with a Biology degree. I also make the same per hour as you do. And I also feel stuck because all the labs around me pay waayy lower or I don't have the special certification for a different but similar paying job.",
            "I don't regret my degree and graduate certificate but if I had the choice to do it over, I would have done trade school.  I would have gone the electrician or HVAC/R route and industrial controls.",
            "I got a marketing degree, and pivoted to accounting after 2 years without a job.",
            "I regret getting a degree in a passion industry rather than one that will actually make more than 35k a year and don't have the energy or funds to get another bachelors."
        ]
    },
    "Damn I need a job": {
        "title": "Damn I need a job",
        "score": 21,
        "url": "https://www.reddit.com/r/jobs/comments/1dr5632/damn_i_need_a_job/",
        "content": "I can't even pay my phone bill. I'm three dollars short.",
        "num_comments": 18,
        "comments": [
            "Me too but dont give up hope! Ive been unemployed for 7 months. Nobody wants to hire me presumably since my resume doesnt look good. I continue to apply and make the calls knowing if I give 100% everyday it will pay off. Heres to us and our future success",
            "Best job market ever Sounds like what you need is to walk the Appalachian trail, my friend.",
            "I too need a job badly",
            "All of us do  its getting bad out there",
            "Get your security guard card",
            "Am I the only one but no ones hiring ?",
            "I need a job too",
            "Try WMATA they are always hiring",
            "Haha gotcha, just offering, good luck on the job hunt ",
            "Im hiring in CO, FL, IL, MI, MN, OH, PA, UT, WA in solar sales. It is a d2d job that commission based so unfortunately no guarantee pay.\n\nIve been working for half a year, and Ive made around $30 an hour on average. It is a difficult job that not many can handle, but its better than nothing.\n\nYou can message me for more info."
        ]
    },
    "After finishing onboarding, I found out I wasn’t their top choice to hire.": {
        "title": "After finishing onboarding, I found out I wasn’t their top choice to hire.",
        "score": 666,
        "url": "https://www.reddit.com/r/jobs/comments/1dqhixp/after_finishing_onboarding_i_found_out_i_wasnt/",
        "content": "I inherited a laptop from my coworker whose position I will be taking as they are transitioning out. In the laptop, I found a document containing the word “hiring.” Against my best judgement, I opened it out of curiosity. Biggest mistake. In it, I found out that they had originally planned to hire someone else. They had already sent the offer letter to them, but something fell through and now I have the job. They had glowing comments about this person, and the comments about me were somewhat lackluster. Out of three candidates they interviewed, I was ranked last. I’m not sure why they didn’t hire #2, but I wish I never read this document. I now have feelings of doubt, and I’m not sure how to move forward with this. I want to keep the job because it is an amazing position, but I can’t help but to feel inadequate and more pressure to perform better. What can I do?\n\nEdit: Thanks everyone for your advice and support! This is my first job post grad so I apologize if it seems a little trivial. I appreciate everyone’s responses! I feel a lot better and have definitely gained a new perspective on my job. I’m going to take this as an opportunity to improve myself. Much love to everyone.",
        "num_comments": 252,
        "comments": [
            "The red flag here is that their IT security processes are so lax that they handed a new hire a laptop with old user files AND gave the new hire access to those files.",
            "Actually, this is really useful feedback. You now know what they think about you and you can act to improve in your weaker areas. Even if they happen to be right, you know what to work on. You should also analyze your CV to understand where their negative feelings come from.",
            "You have the opportunity to make them say \"Im so glad we hired you, we are so lucky to have you on the team\".",
            "A dollar is still worth the same regardless of who they wanted to give it to. This isn't a romantic relationship. I'm sure that you could name other jobs that you'd rather have as well.",
            "When I started this job the resumes of all 82 candidates for the position were sitting on my desk. I was the only one they interviewed. Not because Im anything special. The position was left open for 2 years and my bosss boss said enough is enough, hire someone. I was the last applicant. \n\nIve had to hire the second best applicant before. That was because the best applicant, on paper and in the interview process, failed the required drug test. Things happen.",
            "I would not care.  My first real job I was the fallback guy.  I can tell you they were so happy they hired me instead of the other guy.  \n\nBeing the fallback isnt a bad thing.  I may not have been the first choice, but I was the first correct choice.",
            "I'm recently retired from a technical career and had many management responsibilities along the way.  The things you mention, hiring reviews, only linger for days or a few weeks.   Once you are into the daily routine your reputation, performance and advancements are wholly owned by you.   To be blunt, you are really the only one who cares about these results, the rest of the organization has moved on.\n\nThis was a huge management screw up.   If there were any medical or pay history on this laptop there were probable legal and process violations.   It's a mess.   If you can find a way to just turn the laptop back to IT and get a new one I would do that.",
            "forget about it. congrats on your new job. show up every day and knock it out of the park. top 3 out of maybe hundreds, maybe dozens of resumes is still pretty good the place i work now, i interviewed at and they picked someone else over me. almost a year later they called me and said the person they chose over me was taking a promotion and they wanted me to interview for the position again. i accepted just for kicks, even though i was happy where i landed. they ended up offering me the job and a good bit more money. i ended up accepting it. my boss told me one day i was his second choice back when we first talked and he held on to my resume afterwards. the other person landed the job based on more experience with the software the company uses. 9 months later i was promoted and given a huge raise and i love working here. moral of the story, dont dwell on the past. work towards the future.",
            "Wow, what a huge fuckup on their IT dept. They gave you a laptop that was not wiped / configured properly and had possibly the worst document possible left on the device for you to open.",
            "You just reminded me this happened to me once. My boss let on at my probationary review that there had been concerns about a response Id made in an interview but that I had proven them right in taking the chance and was exceeding their expectations. I had no clue there had reservations. It did mess with my head a bit but then I focussed on the fact I was given a chance, I was doing well and that I was respected and well thought of and that theyd probably forget it in time so I should too."
        ]
    }
}