{
    "June 16, 2024 Daily Discussion thread - Alien Sunday!": {
        "title": "June 16, 2024 Daily Discussion thread - Alien Sunday!",
        "score": 3,
        "url": "https://www.reddit.com/r/JoeRogan/comments/1dh3x6u/june_16_2024_daily_discussion_thread_alien_sunday/",
        "content": "Welcome to our weekly Aliens thread! Here we discuss all things extraterrestrial, from UFO sightings and conspiracy theories to the possibility of intelligent life on other planets. Whether you're a believer in the existence of aliens or just curious about the topic, this is the place for you. Share your thoughts, experiences, and knowledge about the subject, and let's explore the mysteries of the universe together!",
        "num_comments": 19,
        "comments": [
            "Mods too lazy to sticky an episode after Action Bronson?",
            "Do we no longer have mods?",
            "Is Joe Rogan still talking about Covid every episode?",
            "fuck aliens, I want to watch Joe submissively blow rich guys while complaining about young people",
            "The mods on this sub fucking suck. Always making sure it's a dead propaganda sub, and too lazy to make new daily discussion threads, despite the fact that users are not allowed to make discussion threads. Huh, it's almost like they don't want people having genuine conversations here. Really makes you wonder why all the mods here hate Joe Rogan and his fans so much.",
            "Wtf just happened on YouTube",
            "Wtf I had to unsub PowerfulJRE, my subscriptions page is bombarded with possibly mass uploads of past episodes?",
            "Crazy amount of videos just up on youtube my feed is endless joe",
            "OutdoorTwink is one of the worst mods on Reddit",
            "Who cares about them, they some fat ass slobs who give some fuck you vibes in their auto mod messages. Fuck you ban me cocksuckas"
        ]
    },
    "Joe Rogan Experience #2170 - Max Lugavere": {
        "title": "Joe Rogan Experience #2170 - Max Lugavere",
        "score": 24,
        "url": "https://www.youtube.com/watch?v=_tnCsKVltdE",
        "content": "",
        "num_comments": 192,
        "comments": [
            "Unlucky for this guy his episode dropped the same time 75 other episodes were posted lmao",
            "Thought this was Matt McCusker by the thumbnail and got real stoked for a second.",
            "My entire YouTube feed is JRE episodes",
            "No way, Joe likes a guy who thinks being vegan gives you Alzheimer's and supplements are the key to good health. Wonder what he thinks about COVID vaccines.",
            "Was into this one took a little break then episode dumpgate happened. Maybe joe is right we are in weirdest time man..",
            "So, what happened to the protect our parks on YouTube",
            "This guy was awesome last time. Alzheimers is some scary stuff",
            "This guy looks like he gets winded just looking at a kettlebell.",
            "His documentary isnt on a streaming platform its a paid only doc. Tells me all I need to know, hes a grifter",
            "This guy didn't have much time to grift, guys.  I just heard an hour of Joe's workout and dietary habits."
        ]
    },
    "Khabib's gym just got raided by Russian special forces": {
        "title": "Khabib's gym just got raided by Russian special forces",
        "score": 1676,
        "url": "https://i.redd.it/vismuycfcd9d1.jpeg",
        "content": "",
        "num_comments": 489,
        "comments": [
            "These Russian cops all gonna get their backs taken.",
            "How are they going to stop him he knows jiu jitsu",
            "Opportunity missed. UFC 303 could have be revolutionary.",
            "Hope the police are ready for some high level problem solving with dire physical consequences.",
            "There is only room for one state sponsored Russian MMA goat. His name is Fedor ",
            "Somebody call the comedians! Theyre our last line of defense!!",
            "Whoa, i really want to know the outcome.",
            "His dad was never allowed in the US.",
            "Everyone tough until you have a AK 47 pointed at your head.",
            "I mean the dude is a great MMA fighter but hes also really extreme in his beliefs. I wouldnt be surprised at all if hes connected personally to any of this wack shit, considering his own wack beliefs."
        ]
    },
    "Ari can piss in a beer can and on the floor but harland can't chew some celery for his tape worm..not fair my guy.": {
        "title": "Ari can piss in a beer can and on the floor but harland can't chew some celery for his tape worm..not fair my guy.",
        "score": 534,
        "url": "https://i.redd.it/m0tlple4ke9d1.jpeg",
        "content": "",
        "num_comments": 130,
        "comments": [
            "He did chew celery for Dimitri.",
            "Ari Is a 50 year old pig",
            "I like how Shane was having none of it.",
            "Tbf at least Joe has been telling Ari to stop doing it and use the bathroom like a normal person the last few times. Ari is just a fucking weirdo and does nasty shit as a disguise for \"funny\".",
            "Ari is a fuckin loser",
            "Still amazed that the worst he got from the Grizz is getting his chest clawed.",
            "I only watched a 15 min clip but the whole time he kept throwing out zingers and Joe would go quiet and say what? Then Joe would explain what he meant like he was annoyed that the guy wasn't understanding the story.\n\nAbsolute old guy moment.",
            "Ari pissing is still a better guest than Bert",
            "Joe thinks we watch the podcast to see Joe",
            "Ari grosses me the fuck out. At least he doesnt look like hes been living under a rock eating moss but yeah, I bet he absolutely fucking stinks."
        ]
    },
    "Carl Sagan in 1995 predicting the future ": {
        "title": "Carl Sagan in 1995 predicting the future ",
        "score": 679,
        "url": "https://i.redd.it/jrxb8qihrd9d1.jpeg",
        "content": "",
        "num_comments": 106,
        "comments": [
            "This was an amazing book. Sagan was a great writer. Deep thoughts, clearly written. He liked his weed as well. Liked it a lot. He would have been the perfect guest.",
            "If Joe could have on anyone alive or dead, Sagan would be my choice.",
            "If people in this sub could read they would be very upset",
            "Demon Haunted World is an excellent book",
            "Bet he never took Alpha Brrain though.",
            "Sagan, Zappa, and Goldwater all had good foresight.",
            "Seems hes commenting about most of the people commenting in this thread.",
            "Hes talking about Rogan and RFK",
            "*Well the words speak like Prophecy.*",
            "Hence my online name. Could not agree more Carl Sagan. You are missed"
        ]
    }
}