{
    "r/JRPG Weekly \"What have you been playing, and what do you think of it?\" Weekly thread": {
        "title": "r/JRPG Weekly \"What have you been playing, and what do you think of it?\" Weekly thread",
        "score": 12,
        "url": "https://www.reddit.com/r/JRPG/comments/1dmkkzi/rjrpg_weekly_what_have_you_been_playing_and_what/",
        "content": "Please use this thread to discuss whatever you've been playing lately (old or new, any platform, AAA or indie). As usual, please don't just list the names of games as your entire post, make sure to elaborate with your thoughts on the games. Writing the names of the games in \\*\\*bold\\*\\* is nice, to make it easier for people skimming the thread to pick out the names.\n\nPlease also make sure to use spoiler tags if you're posting anything about a game's plot that might significantly hurt the experience of others that haven't played the game yet (no matter how old or new the game is).\n\nSince this thread is likely to fill up quickly, consider sorting the comments by \"new\" (instead of \"best\" or \"top\") to see the newest posts.\n\nFor a subreddit devoted to this type of discussion during the rest of the week, please check out /r/WhatAreYouPlaying.\n\nLink to Previous Weekly Threads (sorted by New): [https://www.reddit.com/r/JRPG/search/?q=author%3Aautomoderator+weekly&include\\_over\\_18=on&restrict\\_sr=on&t=all&sort=new](https://www.reddit.com/r/JRPG/search/?q=author%3Aautomoderator+weekly&include_over_18=on&restrict_sr=on&t=all&sort=new)",
        "num_comments": 73,
        "comments": [
            "Got through the Midgar section of **Final Fantasy VII*, and I loved it. Easily one of the best sections of an RPG I've ever played. Very excited to continue at Kalm. Currently watching the flashbacks there.\n\nI'm just got the first boss in Chapter 8 of **Paper Mario: The Thousand Year Door**, gosh it was tough (currently doing a 10 HP run, and it's my first challenge run), and is one of two boss fights were I lost! Loving the remake so far and still hate Chapter 6, but the backtracking in Chapter 7 provided an excellent way to get the rest of the  Shrines and Star Pieces!",
            "Finally got back into Persona 5 Royal. Had a save 30 hours into it, dont remember why I dropped it but love it all over again. I play 1-3 hours a night. What a treat.",
            "Yakuza Infinite Wealth finally. I loved the first one to death and I full intend to love this one too. Made it to chapter 5 and its consumed my life thus far",
            "SMT 5: V. I enjoyed the original for what it was and finished every route. So far the re-release is more than I expected and I'm enjoying my time with it.",
            "Bought soul hackers 2 a couple weeks ago. I've made it a couple hours in. I like the vibe, combat, and Ringo. Game's talking way too much for my taste, but that's the atlus early game MO. Gonna push through and hopefully get way into the game.\n\nThat is if I can pull myself away from fire emblem, which I cannot stop playing lately",
            "The SMT V Vengence hype motivation me to continue my paused first playthrough of Shin Magami Tensei V. I think I will never love this game but I see the apeal and I do get some enjoymeant out of it. I am in the third area after the boss fight with >!that sword and gun wielding guy who hates Demons but has a Demon girlfriend!<. \n\nI think I will finish this game but I dont think I will ever buy SMT V Vengence.",
            "I found the first hour or so of **Golden Sun** quite charming, with the bright colours and the obsessively animated dialogue scenes. By the second or third hour it had already worn a bit thin, though. I kept going for a while but I already get the sense that I've seen what this game is doing and I'm ready to move on.\n\nIn other news, **Unicorn Overlord** continues to be excellent. I do need to be in the right mindset for some of these longer battles, and will do something else instead if I'm too tired or something, but as long as I'm mindful of that I am consistently enthralled by this game.",
            "Picked up **Ghost of Tsushima**...wow. Just wow. I mean, I've played other big open world games before (like Horizon) so it's not exactly reinventing the wheel, but there's something about it that's just hitting the sweet spot for me right now. It's beautiful, it's fun, it's focused, it's addictive.",
            "**Final Fantasy Tactics.** I think this game has too much grinding for a tactics game. I dont usually mind grinding but it kinda feels off now. Its the most difficult game I have played in the last 10 years so it suits for people who are looking for some challenge. One of those PS1 era games that never got PAL release for some reason.",
            "Currently replaying **Paper Mario** after recently beating the Switch remake of TTYD.\n\nThe games are enjoyable. It's nice to be able to replay them as a much older adult, and better understand a lot of the humor, metaphors and implications you may not have appreciated as a kid. Though being older and having played more JRPGs also makes it hard to ignore that the combat is pretty simplistic, so while charging a hundred times and then Power Bouncing is still a joy, things do feel a bit shallow. Granted, next to no grinding is really needed."
        ]
    },
    "r/JRPG Weekly Free Talk, Quick Questions, Suggestion Request and Media Thread": {
        "title": "r/JRPG Weekly Free Talk, Quick Questions, Suggestion Request and Media Thread",
        "score": 0,
        "url": "https://www.reddit.com/r/JRPG/comments/1dqhz9n/rjrpg_weekly_free_talk_quick_questions_suggestion/",
        "content": " There are four purposes to this [r/JRPG](https://new.reddit.com/r/JRPG/) weekly thread:\n\n* a way for users to **freely chat on any and all JRPG-related topics**.\n* users are also free to **post any JRPG-related questions** here. This gives them a chance to seek answers, especially if their questions do not merit a full thread by themselves.\n* to **post any suggestion requests** that you think wouldn't normally be worth starting a new post about or that don't fulfill the requirements of the rule (having at least 300 characters of written text or being too common).\n* to **share any JRPG-related media** not allowed as a post in the main page, including: unofficial videos, music (covers, remixes, OSTs, etc.), art, images/photos/edits, blogs, tweets, memes and any other media that doesn't merit its own thread.\n\nPlease  also consider sorting the comments in this thread by \"new\" so that the  newest comments are at the top, since those are most likely to still  need answers.\n\nDon't forget to check our [subreddit wiki](https://www.reddit.com/r/JRPG/wiki/index)  (where you can find some game recommendation lists), and make sure to  follow all rules (be respectful, tag your spoilers, do not spam, etc).\n\nAny questions, concerns, or suggestions may be sent [via modmail](https://www.reddit.com/message/compose?to=/r/JRPG). Thank you.\n\nLink to Previous Weekly Threads (sorted by New): [https://www.reddit.com/r/JRPG/search/?q=author%3Aautomoderator+weekly&include\\_over\\_18=on&restrict\\_sr=on&t=all&sort=new](https://www.reddit.com/r/JRPG/search/?q=author%3Aautomoderator+weekly&include_over_18=on&restrict_sr=on&t=all&sort=new)",
        "num_comments": 11,
        "comments": [
            "Was scrolling in the Steam Sale thread - how viable is it to play Like a Dragon on a computer without a controller?",
            "Ys VIII: Lacrimosa of Dana, a really great action jrpg made by Falcom.",
            "Isn't Trails of Cold Steel basically Persona in a fantasy setting tho?\n\nAnyway check out Ys VIII and Tales of Vesperia",
            "Just to make sure I understand, are the titles you are looking for ones that have \"natural environment\" as the main plot, like the weather stuff in Vesperia, or do you mean that the environment of the world should be natural and away from too much focus on technology and or being too barren ?",
            "It's a turn-based game so it shouldn't matter too much whether you play it on keyboard or controller. Maybe there's a minigame or two that might be a bit unwieldy, but you should be fine overall.",
            "Thanks for the recommendation! I meant I have played the first trails of the sky game. So I havent played cold steel. Since people recommend to start with the first game?",
            "The second one I guess, tho it's fine if it's like Xenoblade. What I don't want is if most if not all the environment either modern city or desert/barren. Something like Trails is also fine but definitely not something like Persona.",
            "In my opinion if you don't enjoy the first Trails in the Sky after playing it, you can try Cold Steel or even the newest Trails Through Daybreak without any problem. People recommend to start with the first game and play through it because story reason, but it's alright to just play from the start of any arcs.",
            "Hey Im looking for recommendations for jrpg! Im pretty new to jrpg. \n\nI have already played fire emblem three houses/three warriors and persona 5/3 I also like Disgaea and Valkyrie chronicles . \n\nI'm looking for a JRPG to play. I don't really enjoy pixelated games like Octopath Traveler or the trails series (Just my personal preference and immediate thought when playing those games) I prefer something more modern looking instead I haven't played many jrpg, so take my opinion with a grain of salt but that's my initial thoughts after trying trails of the sky and octopath traveler \n\nBonus if its currently on sale on steam.",
            "Re-asking here from last thread. I've been playing Infinite Wealth, but I'm not really feeling it after finishing Outer Wilds. Really want something like Xenoblade, my eyes on Monster Hunter Stories 2 and Baten Kaitos, Idk any suggestions? PC or Switch please (emu also ok).\n\nI'll try to elaborate, what I'm focusing here is the \"natural environment\" and story with a twist, tho either one is fine. In the last thread sleeping0dragon suggested FFXII or Vesperia, yeah Tales of Vesperia or Xillia are what I'm looking for, kinda, but I have already played them. For FFXII, I don't know it looks like it's either modern looking city or desert, how about the story/characters?\n\nAlso, you don't need to mention Trails, Persona, or Nier, or other Xeno games."
        ]
    },
    "Trails Through Daybreak has settled on a 88 Opencritic score, highest in series' history": {
        "title": "Trails Through Daybreak has settled on a 88 Opencritic score, highest in series' history",
        "score": 29,
        "url": "https://www.reddit.com/r/JRPG/comments/1dr9quc/trails_through_daybreak_has_settled_on_a_88/",
        "content": "https://opencritic.com/game/16923/the-legend-of-heroes-trails-through-daybreak\n\nThis seems to be a decent starting point for people thinking about getting into the Trails series. Reviews especially praise the interesting fresh cast, plot and worldbuilding. \nThe game comes out next Friday on PS4, PS5, Switch and PC",
        "num_comments": 9,
        "comments": [
            "I've played Trails of cold steel only and I can say that I liked Kuro no Kiseki muuuuuuuuuuuch more. I haven't finished it yet ( I was playing with the patch). But hell, that game is really interesting.",
            "Definitely using opencritic... meta only ha 16 listed reviews",
            "Good entry point to the series if you don't want to play the previous games. New country, new characters.",
            "I remember when I first played the game a couple years back, I felt that this game would better match the sensibilities of the west in terms of tone and setting. It seems that it came true.",
            "Think I'm going to try it on the Deck. I sure need a fresh starting point on the series.",
            "Oh wow, that number got a lot higher then when I last saw it.  I thought it would settle around 83",
            "I haven't played the series before but it sounds like this might be a good entry point. The videos I've seen look really good. I also heard that they are remaking the initial trilogy, I might start there. In any case, the series is on my radar now.",
            "I would love to play it as i like jrpgs and long stories with a lot of worldbuilding, BUT i really hope it doesnt have anime fanservice and that characters do die and have dramatic moments. \nI prefer seinen so the more shonen tropes would repel me.",
            "The first 8 hours with the demo was good. Soundtrack is upbeat and fun, and it's probably the biggest shakeup to combat in the series while still being Trails."
        ]
    },
    "After working for the last 3 months, I have a demo for my JRPG inspired by Welsh mythology!": {
        "title": "After working for the last 3 months, I have a demo for my JRPG inspired by Welsh mythology!",
        "score": 47,
        "url": "https://www.reddit.com/r/JRPG/comments/1dr5vc0/after_working_for_the_last_3_months_i_have_a_demo/",
        "content": "Play the demo: [https://deviserene.itch.io/toward-dawn](https://deviserene.itch.io/toward-dawn)\n\nEver since I was young, I've always loved JRPGs, and always wanted to make one myself! So for the last couple of months, I've been learning the Godot Engine and trying to make a game with it. Obviously, it is still very early stages, but I would very much appreciate any feedback you guys have.\n\n**Story**: The theme of the story is dealing with trauma, and how through friendship and addressing it, one is able to push through to a brighter tomorrow. After her temple is raided, Carys finds herself at the mercy of Bleddyn, a Gwyllgi, feared by society for their wolven qualities. But Carys finds that their differences only bring them closer - inspiring them both to seek answers to the events that led both their lives down a dark path.\n\n**Gameplay**: The combat system is a mix between Child of Light and Octopath Traveler. Break your enemies by depleting their poise, and gain mana from completing your ability's objectives to be able to deliver a powerful finishing blow. While I wanted to make a more accessible story-based game, I do hope that the combat still has some depth and strategy to it! While the characters only have a base 6 abilities, you can upgrade them as you level up through the skill tree. Your equipment gives you more than just stats as well, with most offering a variety of abilities to change the character's playstyle.  \n  \n**Screenshots**:\n\nhttps://preview.redd.it/5f42awqhsg9d1.png?width=1274&format=png&auto=webp&s=9410e7c93af3b1e4eb8baaf75420ba3e5e5b0f1d\n\nhttps://preview.redd.it/bv5hj3jisg9d1.png?width=1273&format=png&auto=webp&s=09d701c84865061566774a32e325730b61e52a2b\n\nhttps://preview.redd.it/3t90o94jsg9d1.png?width=1273&format=png&auto=webp&s=7ac197874df854ab40694d04c1adbe37c59bb548",
        "num_comments": 6,
        "comments": [
            "Congratulations on the demo release! \nCant say Ive seen much Welsh mythology influence in games, will have to give this a try",
            "Pretty good for just 3 months can see you put a lot of work into it. Congrats on the release and hope the rest goes smoothly for you!",
            "Actually good. The art takes my mind back to simpler times, and the UI is unique enough that it doesn't look like 100 other games. The choice of the main character being the robe wearing healer is interesting as well. I don't often heap praise upon indie games, but it's got charm.",
            "Tolkien was inspired by a lot of Welsh writing, so there is plenty out there that does have Welsh DNA, but I still want to share more of the culture. Thank you very much!",
            "Thank you. It was a lot of fun to work on, and I feel like I've learned so many skills too!",
            "Thank you so much, it means so much to hear this feedback."
        ]
    },
    "JRPGs with non-linear or 'open' progression?": {
        "title": "JRPGs with non-linear or 'open' progression?",
        "score": 9,
        "url": "https://www.reddit.com/r/JRPG/comments/1dr88j2/jrpgs_with_nonlinear_or_open_progression/",
        "content": "I'm well aware this is often a trait of CRPGs. Games like Fallout 2 and Wasteland 2 give you a goal, nudge you into the direction but you absolutely can self-explore and sequence break. For a more 'modern' example, Zelda BOTW/ToTK lets you progress in any order you want with each area.\n\nJRPGs typically don't do this but I did manage to find some examples. Asking if there are any more?\n\nAgain, not specifically 'open world' but non-linear *progression*. Examples I've played:\n\n- Pokemon R/B/Y. This is obviously an older title but is my go-to example to get the point across. After the 3rd badge (vermillion), the game really opens up as you're allowed to tackle the next few areas/gyms in any order you want. Even near the end with the 2nd last gym (cinnabar) you're given two ways to get there - either south from fushchia city or south from pallet town. \n\n- Crystal Project. Turn based, open world indie jrpg. Purposely open (you collect crystals and other stuff that opens more areas to explore. No specific order). \n\nI also heard Atelier and Saga has them but I don't know which ones, specifically. I also left out something like FF12 because although it definitely is very open, I recall the main quest was linear in terms of progression.",
        "num_comments": 9,
        "comments": [
            "SaGa from Romancing SaGa onwards makes this one of the main features.",
            "Metal Max series. There are actual steps that you need to do to progress in the main story, but there's 0 indicator of where you're supposed to go. So you're expected to explore the world and find clues yourself. The world is pretty open, you can go to settlements and do sidequests non-linearly. But there are still gated areas depending on progress of the story.",
            "Octopath Traveler fits the bill. It's a non-linear game because players choose from eight protagonists, each with their own story. You can explore freely and recruit characters in any order, with each bringing a unique perspective. The open world, varied side quests, and flexible character development allow for a tailored experience.\nPersona 3-5  can fit in a way the game allows players to choose how to spend their time, whether improving relationships with friends, exploring dungeons, or completing side quests. Each decision impacts the story's progression and the relationships with characters.\nI think SaGa series also fits too, with how SaGa games typically offer multiple protagonists or parties with intertwining stories. Players have the freedom to tackle these stories in various sequences, influencing how the overall narrative unfolds.",
            "Dragon Quest 3 absolutely nails this. \n\nThe first third of the game is linear but after that the world opens up and you can progress in any order.",
            "Final Fantasy XIII: Lightning Returns is nonlinear in a way that resembles the Switch Zelda games. After a brief linear introduction, youve got four discrete areas to explore, each with their own main storylines which you can do in any order. The ending sequence begins once the in-game timer runs out- I cant remember if you have to beat the main quests or not to be able to complete the game, but I think so?",
            "If you want to try something different, SaGa games are like the Bizzaro FF series and I love them!",
            "Sadly, Metal Max Xeno threw that out along with the goofy sidequests and wild characters themselves.  It's always annoying that we've only gotten two Metal Max games released out of Japan and one of them is such a poor representation of it.  What part of the games makes them so hard to bring Stateside?  It's not like SRW with licensing issues, so why?",
            "Live A Live ?",
            "https://www.reddit.com/r/JRPG/s/dhAYXDCpZ1\n\nNot SaGa 1-3 on GB."
        ]
    }
}