{
    "Question Thread": {
        "title": "Question Thread",
        "score": 12,
        "url": "https://www.reddit.com/r/Jujutsushi/comments/1dpmq76/question_thread/",
        "content": "This sub is catered to quality, in-depth manga discussion, so please post questions that have simple manga answers here. If you don't have 500 comment karma yet, you can post here too.\n\n# Hot Topics:\n\n**Where can I read leaks?**\n\n>Read Rule #3 on the sidebar for where and when to find leaks on Twitter, Discord, and fanscan sites (TCB and Shishiso scans). DON'T post leaks outside of the pre-release megathread when you find them. Don't post them in this thread.\n\n**Where can I read the official Fanbook/Databook?**\n\n>Scans and translations [here](https://imgur.com/a/HGmL2zu) and searchable text [here](https://docs.google.com/document/d/1FCbQq3YSqQkCuO1UitrlEXKEtjV8aepWgykeyjAe_ZE/edit). Also on the sidebar and sub wiki.\n\n**What is Uraume's gender?**\n\n>Uraume's gender is currently unconfirmed.\n\n**What would happen if Yuji ate another Sukuna finger?**\n\n>We don't know since the manga hasn't answered that question. Sukuna's fingers are Cursed Objects containing pieces of his soul so make of that what you will.\n\n**Is Gojo really dead?**\n\n>Yep, looks like he is.\n\n**What is Kenjaku's plan with the Culling Game?**\n\n>In short, he's using the Culling Games to produce a lot of Cursed Energy within its Barriers, with which he plans to use to evolve the human race. He wants to create a new golden age of Jujutsu. Kenjaku has apparently not revealed all his plans, Yuki cast suspicion on Tengen (the Culling Game plan infodumper) before they fought, and Kenjaku called Tengen his \"friend\", so it's unclear if Tengen was entirely truthful. We don't yet know how Sukuna fits into this plan, even though he and Kenjaku have been cooperating.\n\n**What is Ijichi's Cursed Technique?**\n\n>How naive of you to ask. He wouldn't cheat by giving it away.",
        "num_comments": 76,
        "comments": [
            "In chapter 260 we see Rika get dispelled by a punch from Ryu, however this Rika does not appear to be fully manifested when she is hit. In the official translation it makes it seem like Yuta’s 5 minute timer was still up, however it seems a lot more likely that Yuta’s 5 minute timer ended here. Does anyone know if that’s a translation error or is there another explanation for Rika’s full manifestation ending before the punch?",
            "My question: why did Sukuna stop using domain amplification in order to adapt to UV, instead of continuing to use it, not getting hit so much by Gojo and not having to heal and consequently delay his opening of the domain, if he could simply use amplification and resist Gojo until Gojo's domain was broken and kill him?",
            "How was Megumi able to summon Mahoraga in Shibuya if he still had to go through the Deer, Ox, and Tiger? Can he just skip shikigamis?",
            "Why didn’t Sukuna incarnate and then use world cutting dismantle to kill gojo instead of using a binding vow and then incarnating afterwards?",
            "Has it been explained why sukuna suddenly changed his mudra to activating his domain similar to gojo’s?",
            "Could Agito have healed Sukuna's brain damage?",
            "Can Todo boogie woogie hollow purple?",
            "Thank you for this! I really like this question thread that’s nice and helpful and I like how you worded the answers.",
            "We have seen that Yuta’s transformation to Gota has been foreshadowed since at least the start of Shinjuku but maybe even further back to the moment Gojo got sealed. Do we think Yuji may also have something big coming that’s been foreshadowed that long or will it just be Yuta? Personally I think Yuji does have something coming just not sure what",
            "If the worst consequence breaking self imposed binding vows can have is losing what was gained, then what would happen if Sukuna broke his binding vows he used to kill gojo by just using the world dismantle without the handsign, chant and directing of the dismantle?"
        ]
    },
    "Ijichi's Colosseum: Powerscaling Megathread": {
        "title": "Ijichi's Colosseum: Powerscaling Megathread",
        "score": 7,
        "url": "https://www.reddit.com/r/Jujutsushi/comments/1dnwp4z/ijichis_colosseum_powerscaling_megathread/",
        "content": "Welcome to Ijichi's Colosseum, the [r/Jujutsushi](https://www.reddit.com/r/Jujutsushi/) bloodbath curse pit where  sorcerers can throw hands over hypothetical Jujutsu matchups! We've moved the thread back to Tuesday as per user feedback.\n\nIs Toji stronger than Ijichi? Would Sukuna beat Ijichi in a fight? Compared to Ijichi, is Kenjaku really a Special Grade threat?\n\nSate your powerscaling urges here!",
        "num_comments": 24,
        "comments": [
            "Yuji vs Maki\n\nCursed Naoya vs Yuji",
            "Yuji extreme diff \n\nNaoya(technically) extreme - impossible diff(Vengeful curses cannot be killed unless you unravel their curse) Yuji's soul punches MIGHT be able to bypass this immunity though, if so, Yuji low - mid diff",
            "Yes. It's kinda hard to admit it, but if WS didnt have the drawsback it has right now and Sukuna could use it with only 2 hands, the manga would end before chapter 240. WS is just too strong, all Sukuna needs is a small opening, and he showed us that he is the most durable character in the series by far (no one would take that first 200% purple and live to tell the tale)",
            "Probably Sukuna, given that he was confident that he could at least fight Gojo when he was freed from the prison realm, also remember that Gojo wouldn't have that month of training and preparation, but if he misses the slash, he's fucked",
            "yeah he’s like 7th strongest in the series after maki. ",
            "It's an amazing feat but that purple was was shot from 4km away. Point blank he's dying.",
            "Yeah I agree. The only way Gojo wins is to domain expansion immediately, but I don’t think that’s something he would do, especially if he doesn’t know about WCS.",
            "I would rate him higher than maki purely because she is the hard counter to his domain. \n\nHe beats a lot of folks I don’t think she could beat but she beats him 100% of the time",
            "Where would you put Todo?",
            "Naoya’s domain is a top 3 and maki is a hard counter that’s the whole point. His domain can’t effect her"
        ]
    },
    "Powerscaling Saturday - Free Posting": {
        "title": "Powerscaling Saturday - Free Posting",
        "score": 7,
        "url": "https://www.reddit.com/r/Jujutsushi/comments/1dr3i9m/powerscaling_saturday_free_posting/",
        "content": "As always, keep chapter leaks inside the pre-release thread!\n\nWe will continue to monitor free posting in the coming weeks. Leak prohibitions and low-effort content rules still apply.",
        "num_comments": 1,
        "comments": [
            "Reminder:\n\n- **DO NOT POST CHAPTER LEAKS** outside the pre-release leaks megathread. Officials are free range. See the sidebar for info on leaks.\n- Powerscaling should stay in the designated Tuesday Colosseum thread.\n- Repetitive or low-effort topics will be removed.\n- Questions that can be answered by reading the manga more closely should be posted in the FAQ.\n\n[Fanbook & Other Canon Material](https://www.reddit.com/r/Jujutsushi/wiki/canon)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Jujutsushi) if you have any questions or concerns.*"
        ]
    },
    "I still don’t understand the whole Sukuna and Love subplot": {
        "title": "I still don’t understand the whole Sukuna and Love subplot",
        "score": 251,
        "url": "https://www.reddit.com/r/Jujutsushi/comments/1dqa43t/i_still_dont_understand_the_whole_sukuna_and_love/",
        "content": "The entire thing just feels… anti-climactic? We know Sukuna is a hedonistic being; during the first Mahito fight it was stated that Sukuna only does things for his own pleasure so this is expected. \n\nFor the whole love thing to be brought up by Yorozu, then somehow in his death by Gojo(???), only for the conclusion with Kashimo be what we knew all along… I don’t quite understand the reason for having this baked into the undercurrent of the Shinjuku fight. If you take this aspect away I don’t think it would have changed anything. \n\nWhat are your thoughts?\n\nEdit: I get comment notifs but I can’t load any of them on thread. Reddit broken? Rip bad timing. ",
        "num_comments": 47,
        "comments": [
            "This love subplot first showed up in JJK 0 when Gojo had a theory for the reasoning as to why Yuta is so strong and abnormal, and he thinks that it’s because Yuta and Rika love each other and love is the most twisted curse of them all. \n\nSo enter Sukuna a year later and he’s regarded as the king of curses…literally THE curse of all curses & he basically serves as an antithesis to this theory and says he understands love enough to say fuck love & that it’s useless. That’s basically it…you have one side saying that love is the key to strength, and you have another side saying that love is nothing and solitude is everything.",
            "Well, Yorozu was right about one thing: Sukuna is lonely. It was stated to us that the price of being the strongest is being all alone. Yorozu saw that loneliness in Sukuna’s eyes and thought that Love was what was missing. But Sukuna embraced the loneliness that comes with strength rather than rejecting it, like Gojo did. \n\nBut I, personally, think that this plot about love comes because of Yuji. As I said before, strength comes with the price of loneliness. But Yuji, as the main character, comes to break those statements. Whilst a Sukuna became strong all by himself, Yuji became strong by trusting others (Gojo’s training, Todo’s help, replacement training) to the point of making the King sweat.",
            "Because Sukuna represents the ultimate idea of strength in jjk. Manifested through self centered ness/ a lack of empathy. Love is the antithesis of that.",
            "“Feel anti-climactic..”\n\nProbably because it hasn’t reached its climax?",
            "Thou seeketh violence. What is love but to shower the target of your affection with your heart’s deepest desires?",
            "I think we have yet to see how the sentence ends. It’ll be love (the greatest curse) that ends up beating Sukuna…\n\nSeeing as yorozu/whatever her name is said it, it’ll probably be megumis love of friends and family BS that causes Sukuna enough trouble to remember/reveal the entire quote in his final moments.",
            "I think it comes down to the idea that you can’t love someone until you truly understand and respect (I’m not saying that Gojo has to respect everything about Sukuna (and vice versa )just their power. The thing let’s kept them both out of other peoples reach.  Someone like Sukuna is so powerful that he can only love someone who can relate/understand the kind of being he is.  Gege is not talking about romantic love, but just having love for another person. That is where Gojo comes in because the same applies to him. They don’t realize that mutually love until after the fight is over or at least a point in the fight when they realize that they are both the same (or at least close enough than anyone else has ever been to them).  You can see this when Gojo was disappointed that he was not strong enough to draw out Sukuna’s full strength. Not because it made him feel weak, but because he wasn’t able to return the kind of challenge that he received and he then wished he could have done that for him.",
            "It’s stupid. That’s about it.",
            "Me neither man. Really feels out of place.",
            "Don't worry, none of us do"
        ]
    },
    "Hiatus Enrichment (2) - Branch out, dip in gothic literature. ": {
        "title": "Hiatus Enrichment (2) - Branch out, dip in gothic literature. ",
        "score": 75,
        "url": "https://www.reddit.com/r/Jujutsushi/comments/1dqd1rn/hiatus_enrichment_2_branch_out_dip_in_gothic/",
        "content": "Hi there ! \nWhile Gege’s well deserved break is soon to be over, summer break is right around the corner. Why not take another stab at the Reading Comprehension Devil by branching out and read a few classic novels ? \n\nPSA : There’s no such thing as “too old to start” to build yourself a literary culture. Just pick a book ! Any book ! \n\nDrawing from Jujutsu Kaisen’s horror genre, its villains and motifs, here are three recommendations from gothic literature classics : \n\nA) Want a story about an overwhelming evil like Sukuna, and mankind’s struggle  to overcome it ? Bram Stoker’s Dracula (1897) is right there for you. The original vampire novel, and a great first dip into the epistolary novel (a story told through letters, log entries and news articles).\nAvailable for free on https://www.gutenberg.org/  (lots of great public domain classics ! available on digital for free !!!)\n\nB) Are you more interested in mad scientist-type characters like Kenjaku ? Boom, Mary Shelley’s Frankenstein or the modern Prometheus (1818) might be just the thing for you ! \n\nC) Did Jogo’s discourse on Curses being the “true humans” as they were born of mankind’s darkest, most primal pulsions resonate with you ? I warmly recommend Robert Louis Stevenson’s Strange Case of Dr Jekyll and Mr Hyde (1886) !\n\nAlso, on the topic of cultural decline and cultural defiance among part the public…\n\nD) Ray Bradbury’s Fahrenheit 451 (1953) is more than ever an essential read. Read it, learn from it, share it. \n\nOn that note, thanks for reading me ! I wish you a wonderful day and Stay hydrated ! (US/FR : Register to vote/go vote on Sunday)",
        "num_comments": 11,
        "comments": [
            "The comprehension curse has fallen, billions shall read",
            "DON'T MARRY JEFF!\n\nThere I did it.",
            "Not related but I’ve been wanting a fantasy fix since JJK’s been on break and I’ve started reading Eragon and I’m digging it so far",
            "You are cool, I like you. I saw your 1st enrichment post, but I never read it. I should go look for that too",
            "Out of curiosity, are these all books people usually haven't read? I think I read them all in high school",
            "I don’t partake in theories or powerscaling conversation. It’s taken some time, but yeah, that’s going to be my contribution to the community :>\n\nLet’s spread the word ! Help exorcise the Reading Comprehension curse !",
            "…I’m sorry, what ? \nUpvoted because I sensed a smile behind the comment. Have a nice day !",
            "Not JJK related but very on topic ! The first book is very flawed imho but the series will always have a special place in my heart as the 4th book was my first English reading experience (I’m French) !",
            "If you like complex power systems and fantasy, try Mistborn, The Last Empire by Brandon Sanderson.",
            "I think it depends on the country you live in, and don’t forget that reading for school is not the same as reading for yourself. There is no compulsion, you go at your own pace, so there’s a higher chance of gaining something from the experience !"
        ]
    }
}