{
    "The BloodLusted Golden Age AU Chapter 28": {
        "title": "The BloodLusted Golden Age AU Chapter 28",
        "score": 47,
        "url": "https://www.reddit.com/gallery/1dlqhv9",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Read the rules. The new chapter leaks must be flaired the orange \"new chapter spoilers\". Comments relating to new chapter leaks are only allowed under such posts. [Join the discord!](https://discord.gg/8Cd4NrvzXP) This is a manga spoilers subreddit and the spoiler tag is NOT used for all posts about officially released JJK chapters. \n\nThe message is an automated one and has nothing to do with this post specifically.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Jujutsufolk) if you have any questions or concerns.*",
            "Bro pumping these out faster than Mahito can idle transfigure humans 😭\n\nAlso, FUCKING HELL that is one hell of a CT, what the fuck??? Sukuna, Kenny, why didn't you steal this mfer's CT  😭\n\nBlud finally decided to lock-in too thank fuck but we all know how this ends since Sukuna is in the modern era\n\nhttps://preview.redd.it/nnpv0o8dx28d1.png?width=480&format=pjpg&auto=webp&s=d126211788235b936f80bdd2b3c481ff6f382a59\n\nOnce again, a meal was served",
            "Throughout heaven and earth you alone are the best cook\n\nhttps://preview.redd.it/32u9q93mz28d1.jpeg?width=1179&format=pjpg&auto=webp&s=6f8c6b45aebc80f19ed9a18f3b1004a895608d67",
            "https://preview.redd.it/rfyy5aczx28d1.jpeg?width=609&format=pjpg&auto=webp&s=c64b3a12b3f489a37aa99ce53e04efd695616e03\n\nPeak character inspiration chat?",
            "Damn, you are cooking with this shit, fr 🔥🔥 Also, this pace is crazy 😅",
            "Damn that's one hell of a CT...\n\nhttps://preview.redd.it/y67dlxkd138d1.png?width=1080&format=pjpg&auto=webp&s=a1f4caae9109b8a0d1a814e5e28218d374ea5ac6\n\nCan't wait to see if they manage to cook Sukuna next chapter or get cooked...",
            "Seeing goldjos head with 3 slices did scare me, I get the feeling Earthbending woman is gonna somehow hinder Goldjo. Cant wait for next chapter 🔥🔥",
            "Your cooking exceeds expectations as always.",
            "Blawg is cooking on the daily",
            "Also i changed sukunas 2nd face design, instead of the current \"giant eyes wood looking mask\" it looks more like deformed flesh. Like the one gege used here\n\nhttps://preview.redd.it/t4lworxl638d1.png?width=720&format=pjpg&auto=webp&s=f0bf791e257e94a8c0c8b82ef1bb8cff5d7237a6"
        ]
    },
    "Yuji if he used 1% of his true power": {
        "title": "Yuji if he used 1% of his true power",
        "score": 230,
        "url": "https://i.redd.it/3u9f0hgrs38d1.jpeg",
        "content": "where is sukuna's double dick tho?😭",
        "num_comments": 20,
        "comments": [
            "Read the rules. The new chapter leaks must be flaired the orange \"new chapter spoilers\". Comments relating to new chapter leaks are only allowed under such posts. [Join the discord!](https://discord.gg/8Cd4NrvzXP) This is a manga spoilers subreddit and the spoiler tag is NOT used for all posts about officially released JJK chapters. \n\nThe message is an automated one and has nothing to do with this post specifically.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Jujutsufolk) if you have any questions or concerns.*",
            "did yuji fucking strip sukuna with divergent fist",
            "Why is Sukuna naked?",
            "Then bro stop holding back wtf 😭",
            "JJK true ending",
            "Good that Yuji used cleave on his twin cocks so Gege can keep the image to himself",
            "why can i see his little hiten",
            "Then he must be a real asshole",
            "https://preview.redd.it/h9e08xqd948d1.jpeg?width=1284&format=pjpg&auto=webp&s=597cfc4eaf8917bae792c4cd157e882ee4209783",
            "Bruh 💀"
        ]
    },
    "Smartest character": {
        "title": "Smartest character",
        "score": 2913,
        "url": "https://i.redd.it/skfduwk5mz7d1.gif",
        "content": "",
        "num_comments": 88,
        "comments": [
            "Read the rules. The new chapter leaks must be flaired the orange \"new chapter spoilers\". Comments relating to new chapter leaks are only allowed under such posts. [Join the discord!](https://discord.gg/8Cd4NrvzXP) This is a manga spoilers subreddit and the spoiler tag is NOT used for all posts about officially released JJK chapters. \n\nThe message is an automated one and has nothing to do with this post specifically.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Jujutsufolk) if you have any questions or concerns.*",
            "There's Takaba too who's currently sleeping\n\nhttps://preview.redd.it/pih26oogd08d1.png?width=743&format=png&auto=webp&s=5c1247bdef40f5b4ffd77326f2fc3f2b26b8a843",
            "Little do you know Uraume intercepted the flight beforehand",
            "Ya'll not ready when Sukuna venmos HIM $20...\n\nhttps://preview.redd.it/q7f6ip7gt08d1.png?width=1600&format=png&auto=webp&s=ea3a25ed860aff283c1c34edc32df770f0ca58ee",
            "Also That random girl who simped for megumi",
            "I wonder if Sukuna will have enough points to override the rules further once he accepts that he can't beat everyone. Maybe remove anyone who is outside certain colonies from the game.",
            "This is why the merger CANT happen.\n\nKamo (and presumably others) left just booked it away.\n\nSukuna has to kill the cast like Yuji first, then hunt down all for them.\n\nThe merger is just the doomsday stakes for the fight, Gege isn’t gonna make a kaiju or some shit.",
            "You also have Remi, Uro, katana, sumo guy and Takaba.",
            "Guys, sorry if I disappoint you with me being able to read, but there is a little rule to the culling games that literally allows the exchange of players meaning that one can leave the culling games as long as there is a replacement for him. Not only that, but it would be completely illogical for kamo to go somewhere else if he was a culling game player, because he would inevitably die in 19 days by cursed technique removal.",
            "Watch sukuna make a binding vow or something to start the merger and then it just turns out to be the smiley face\n\nI believe"
        ]
    },
    "Re reading the whole gojo vs sukuna fight made realise how one-sided the whole fight was until the end. ": {
        "title": "Re reading the whole gojo vs sukuna fight made realise how one-sided the whole fight was until the end. ",
        "score": 188,
        "url": "https://www.reddit.com/r/Jujutsufolk/comments/1dlsjzj/re_reading_the_whole_gojo_vs_sukuna_fight_made/",
        "content": "Aside from the first two domain expansions where Sukuna won (though he somehow still got his ass kicked inside his own domain), almost the entire fight was dominated by Gojo. Gojo went in with zero info, and within minutes, he found a way to counter his domain's biggest weakness. Then, when the second round began, he had to hold back both Red and Blue so that Mahoraga wouldn't adapt to them, but he still beat Mahoraga's and Sukuna's asses to the ground, sending his opponents to sleep in the middle of the fight. Even after his hand got chopped off, he took on Sukuna, Agito, and Mahoraga and won. If Gojo were the protagonist of the series, he would have won.",
        "num_comments": 129,
        "comments": [
            "Read the rules. The new chapter leaks must be flaired the orange \"new chapter spoilers\". Comments relating to new chapter leaks are only allowed under such posts. [Join the discord!](https://discord.gg/8Cd4NrvzXP) This is a manga spoilers subreddit and the spoiler tag is NOT used for all posts about officially released JJK chapters. \n\nThe message is an automated one and has nothing to do with this post specifically.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Jujutsufolk) if you have any questions or concerns.*",
            "Sukuna holding back be like :\n\nhttps://preview.redd.it/w74iv0yi048d1.jpeg?width=500&format=pjpg&auto=webp&s=3019769843a245ee60dd7b6c3e1840d5aa7e1e99",
            "Ignore the Sukuna glazing weirdos. Stand Proud, you can ~~cook~~ read. \n\nSukuna was the smarter sorcerer, but Gojo was stronger. The whole fight was Sukuna trying to find a way to take down Gojo despite having the 10 Shadows as backup & far more knowledge of Gojo than Gojo had of Sukuna.\n\nSukuna was more experienced & resourceful. Had Gojo been raised in the Heian and/or fought more elite sorcerers, he probably would've won. Sukuna had to pull out every trick he had and put in months of planning to bring him down.\n\nIf anything, it's kind of a reversal on the whole \"protagonist\" point you brought up. Sukuna took down Gojo the way a protagonist would usually take down the antagonist. Sukuna was weaker, and he struggled to find a victory.",
            "Fight was so one sided that Gojo got a Toji PTSD mid fight",
            "Yeah well. Sukky's powers wouldn't really work against Gojo, as they'd never reach him. So he leaned heavily on Mahoraga the whole time. The domain battles were also not in the bag for sukky, otherwise he'd never have gone as far as putting his life at risk to ensure adaptation. And I think we're about to see why...The risk of relying just on domain battles was too high for sukky.\n\n  \nPeople who believe sukky would have easily won are reading Sorcery Fight honestly, not Jujutsu Kaisen.",
            "Not just holding back red and purple, gojo was also trying to get bumgumi back...why gojo didn't aim for brain here?\n\nhttps://preview.redd.it/32plju5t648d1.jpeg?width=900&format=pjpg&auto=webp&s=b01a5efbd9d43ed4b05077f8f395df9f7d2f5569",
            "Why do you think the whole Fraudkuna meme took off, Gojo vs Sukuna was completely one sided and Gojo heavily dominated the fight, hence why the ending of the fight was so awful as it made little sense for Gojo to simply get killed in such a way while still being in peak condition and Sukuna holding on a thread, it was completely asspull. \n\nGojo has heavily demonstrated that he was \"The Strongest\" and I think declaring him the winner was to signify that.",
            ">gojo vs sukuna fight made realise how one-sided the whole fight was until the end. \n\nThat's why I didn't enjoy their fight that much, Sukuna was treated like a clown through out the fight, it's hard to take it seriously. \n\nThe thing about Sukuna not being able to maintain his domain because he took a bit of damage didn't make sense, in every fight except this one, the domain got disactivated when the sorcerer/curse die or is close to dying.\n\nYuta got cut and half but his domain was still active for a while.\n\nGege obviously made the fight too one sided because he planned to kill off Gojo in the end.",
            "Sukuna couldn't even use Devine Flame. Goatjo should have won",
            "Exactly , the plot defeat Gojo , and even the Sukuna glazers know that but they are too selfish to say that . \n\nGojo will remain the strongest ."
        ]
    },
    "JJK characters if they had their English VA’s names.": {
        "title": "JJK characters if they had their English VA’s names.",
        "score": 1353,
        "url": "https://www.reddit.com/gallery/1dlhv9i",
        "content": "",
        "num_comments": 252,
        "comments": [
            "Read the rules. The new chapter leaks must be flaired the orange \"new chapter spoilers\". Comments relating to new chapter leaks are only allowed under such posts. [Join the discord!](https://discord.gg/8Cd4NrvzXP) This is a manga spoilers subreddit and the spoiler tag is NOT used for all posts about officially released JJK chapters. \n\nThe message is an automated one and has nothing to do with this post specifically.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Jujutsufolk) if you have any questions or concerns.*",
            "Yuta as Kayleigh is hilarious",
            "Nah the sukuna one got me laughing my ass off😭🙏. imagine, the most dangerous person in the world and his name is just Ray.",
            "Mahito as Lucien actually makes sense",
            "Nanami look like a David",
            "Yuji as Adam goes hard as fuck tbh",
            "Adam, David, Lucien, and Nicolas work well for Yuji, Nanami, Mahito, and Toji.",
            "gege would name two separate characters xander\n\nalso lmao mech-keith-maru",
            "A decent chunk of these actually work tho.",
            "Michael Jogo = **MJ**\n\n# MJ, the true king of curse!\n\n![gif](giphy|6pJNYBYSMFod2)"
        ]
    }
}