{
    "Anime Questions Thread": {
        "title": "Anime Questions Thread",
        "score": 6,
        "url": "https://www.reddit.com/r/JuJutsuKaisen/comments/1dpmq7c/anime_questions_thread/",
        "content": "# Anime Questions Thread\n\n**All manga spoiler questions should be redirected to the MANGA Questions Thread crossposted from** r/Jujutsushi **each week.** ***This thread is anime-only.*** **Manga spoilers will be removed.**\n\n## FAQs\n\n# What chapter should I start reading the manga at?\n\n>The anime leaves off at Chapter 63, or the start of Volume 8.\n\n# Where can I read JJK?\n\n>If buying physical copies isn't an option...  \n>  \n>Officially: [**Shueisha**](https://mangaplus.shueisha.co.jp/titles/100034) \\- Only the first three chapters and the most recent 3 chapters are available. New chapters are released every Sunday at around 10 PM MST (UTC-7). [**Viz Media**](https://www.viz.com/shonenjump/chapters/jujutsu-kaisen?locale=en) \\- Only the first three and most recent 3 chapters are available for free, but for $2 a month, you can read the entire series (and every series on their site), including Volume 0, Jujutsu Kaisen's Prequel. New chapters are also released on the same day and time as on the Shueisha site.  \n>  \n>Unofficially, Google \"read Jujutsu Kaisen free\" and make sure you have an adblocker installed.\n\n# What is the movie about?\n\n>It covers Volume 0, a one-shot prequel that Gege wrote before writing the main series of Jujtusu Kaisen. Yuta Okkotsu is the main character and it the story takes place 1 year prior to the main series.\n\n# Should I read Volume 0? And when?\n\n>You can read it whenever you like, but Chapter 63 is a good point to read it. It explains some of the events and motivations that happen in the JJK storyline.\n\n# Where can I watch the anime and movie?\n\n>Legally on Crunchyroll. We unfortunately have to keep links to aggregate sites off of the sub or risk it being flagged for takedown. Otherwise, try Googling \"where to watch anime free reddit\".\n\n# Which chapters correspond to which episode?\n\n>u/HououinKyoma23 created an amazing guide that covers every episode:chapter in the series! Check it out [here](https://www.reddit.com/r/JuJutsuKaisen/comments/mfb16f/a_complete_animetomanga_comparison_chart_for/)!",
        "num_comments": 12,
        "comments": [
            "I just finished watching S1 and S2, as well as the movie, and am absolutely loving the story and animation. However, I know that since S2 just came out a few months ago, we're probably not getting another animated piece of content for at least two something years (unless there is something that I don't know about). To add onto that, just looking at the amount of chapters in the manga, it seems like it will take more than just one season to get to the current point of the manga (going off how many chapters S1 and S2 covered).\n\nThat leads to my question, would I be really missing out if I just picked up the manga and read ahead and experience the anime after the fact? It would be my first manga too, so I don't really have any prior experience when it comes to this department. Is what is coming up so good that it would be better to wait a few years and experience it first in the anime rather than the manga?",
            "Are DEs tied to CTs or the individual?\n\nWas in the process of making two original characters with the same inherited technique when I began thinking about possible DEs for them, but I ran into a question. Would their DEs even be different? I cant remember any discussion in the anime or manga about DEs being tied to CTs or if theyre tied to the individual, so I'm somewhat confused if they'd share a DE along with sharing a CT. Any input or clarification from the anime or manga would be very much so appreciated. :)",
            "How do characters like Yuji and Mahito know when to say “black flash”? Isn’t it at random?",
            "How do black flashes work? It’s supposed to multiply the strength of your punch by the power of 2.5 (x^2.5) but the outcome can be wildly different based on what unit of measurement you use. For example 24 inches = 2 feet, but if I take the 24 inches and bring it to the power of 2.5, it’s over 2800 inches, while if I take 2 feet^2.5, it’s only 5 feet, way less then 2800 inches (with the force of the punch, I could use newtons, or pounds-force and get the same problem, even if the starting amounts are equal, if I convert them after the (x^2.5) then it’s all messed up.",
            "What was the purpose of Nobara's backstory?\n\nI didn't really understand what they were trying to convey or tell us about her with the whole backstory about the foreign girls and the village she grew up in.",
            "It depends on what you prefer in the story, the manga of course conveys what it needs to well enough but fight scenes especially on the scale/speed they are it's difficult to understand what's happening and how fast it's happening. In the anime adaptations they add filler to the fights to make them feel more whole and you get a better image of what's actually happening. I wouldn't necessarily recommend JJK as a first manga, Gege has a habit of text-walls that can be extremely confusing, not to mention the AWFUL official tranlsation. But since you're already invested in the story go for it, just try to get a fan translation. Also, at the end of season 2 they announced Culling Games as the next season, so we'll probably get a movie of the post shibuya/preparation arc next year",
            "Domains sure-hit effect cancel out infinity, along with the inverted spear of heaven, (what Toji uses against him) other cursed tools, and black flashes",
            "Either..\n1. They aren't actuat saying it and it's just added for watcher enjoyment\n2. Sorcerers can \"feel\" when they're about to hit a black flash, could explain why Mahito seemed so damn happy to call himself a Curse even before hitting the black flash",
            "It’s supposed to be random but you can try Yuji did it against hanami and didn’t hit one while he said it. Most of the time it’s internally saying black flash though.",
            "What can bypass infinity?"
        ]
    },
    "Jujutsu Kaisen is officially confirmed to be on break next week in Weekly Shonen Jump Issue #32": {
        "title": "Jujutsu Kaisen is officially confirmed to be on break next week in Weekly Shonen Jump Issue #32",
        "score": 612,
        "url": "https://www.reddit.com/r/JuJutsuKaisen/comments/1dmouxp/jujutsu_kaisen_is_officially_confirmed_to_be_on/",
        "content": "Series was scheduled to resume after 2 weeks of absence, but after consultations with the author and the editorial department, will resume in Issue #32. For those wondering this means leaks will release July 4th and the official chapter will release July 8th\n\n[Source](https://x.com/jujutsu_pr/status/1804892173407867175?s=46&t=ChjWTAm7UFCRAwG6w3kCtg)",
        "num_comments": 104,
        "comments": [
            "Good. Greg deserves the break.",
            "I wait for Berserk chapters. This is nothing.",
            "Relieved to hear that Gege's health is improving",
            "All those binding vows slowly catching up",
            "Ive waited years for new HXH so this is fine. I hope he is doing well",
            "It is what it is.\n\nHope he is doing fine.",
            "That's fine. Peak fiction can wait, let Gege rest.",
            "Here’s hoping he gets better before coming back. I don’t want another Miura, these guys work their asses off and deserve some rest instead of working themselves to an early grave.",
            "Can’t wait for my 8-10 pages of gojuta",
            "I know the meme is Gojo makes him sick or he’s playing Elden Ring - but the guy takes a lot of sick breaks, I hope it’s nothing serious!"
        ]
    },
    "Poor Yuta, the double standard is not in his favor": {
        "title": "Poor Yuta, the double standard is not in his favor",
        "score": 4008,
        "url": "https://i.redd.it/z7bqaph3xc9d1.jpeg",
        "content": "",
        "num_comments": 120,
        "comments": [
            "The whole copy thing with Kakashi gets dropped pretty quickly. The author realized that each ninja having a small number of signature moves was better. Each Kage only have 1-3 jutsu for instance.",
            "Kakashi is at least limited by his average chakra reserves",
            "Its established that he cant copy Bloodlines or hard elements like Ice or Crystal, and even if he had 1000 jutsus they all would be inefficient since he would still need to train them.\n\nYuta eats someones fingernail and makes them lose 100% screentime because of irrelevance",
            "Yuta at least use them... :3",
            "The chakra system isn't the same as cursed energy. Everyone with chakra can do anything any other user can do with training and understanding of the technique. Unlike cursed techniques, which are seemingly individual powers. And for the record, I don't mind Yuta copying others cursed techniques, since it only works for around five minutes.",
            "I get the whole “Yuta removes screentime” arguement. But like… What are the actual CT holders gonna do? Yuta can only contend cus hes got the raw stats to back it up. Inumaki and Hana get sliced to bits instantly.",
            "Sadly Yuta OGOATsu was born in an era where the agendas are strong.",
            "Kakashi’s whole “copy ninja” thing goes out the window when you realise “Oh shit, every Sharingan user can just do that” so it’s not a big deal",
            "Kakashi only knows like 5 jutsu and 4 of them are chidori under different names",
            "I frankly like Yuta more. He used copy to its maximum possible extent and beyond. Kakashi used it against zabuza and i don’t even remember when after that. Yuta using it one last time to go against sukuna, the sheer goosebumps and the adoration of sukuna is many times better than what happened to the copy ninja."
        ]
    },
    "Only 3 times I cheered for Mahito": {
        "title": "Only 3 times I cheered for Mahito",
        "score": 753,
        "url": "https://www.reddit.com/gallery/1dqzboi",
        "content": "",
        "num_comments": 45,
        "comments": [
            "if only he ended haruta there",
            "I’m not a huge Mahito fan, but I gotta say I think he died too soon. He was a young curse and really strong. I’d like to see if he had the potential to get stronger.\n\nEdit: I understand why his death to Kenjaku was important for the story but at the time I didn’t agree with it.",
            "I cheered for him every time, Idle Transfiguration is my favorite CT and Mahito's personality and voice actor are 10/10.",
            "Yeah the bullies and Haruta aren't as evil but I hate them way more. Pseudo-Geto is much worse though, even if there was absolutely no chance Mahito killed him, it still would've been a much better outcome for everyone than him getting absorbed",
            "People don’t understand that he’s one of the best anime villains. Because he did his job as a villain so well.",
            "How is Geto worse than Mahito at this point? This was practically the best thing he's done on screen.",
            "Only in the last moment",
            "I love his Szene in the opening -Spezialz because that Train Szene lives rent free in my head",
            "Never. I wanted Mahito to take that L in his second fight. I'm glad it ended with Todo and Yuji. Simply amazing fight but it took way too long to get here.",
            "Tbh, the bullies were just in their teen years. That’s just how most teenagers act, because they are young and stupid. Killing them for being loud is too much, don’t you think?"
        ]
    },
    "Megan Thee Stallion mentions Yuji, Gojo, & Sukuna in her latest song “Otaku Hot Girl”": {
        "title": "Megan Thee Stallion mentions Yuji, Gojo, & Sukuna in her latest song “Otaku Hot Girl”",
        "score": 1957,
        "url": "https://i.redd.it/we9170th4d9d1.jpeg",
        "content": "’Fightin' demons in my head like I'm Itadori’\n\n‘Ayy, can't touch me like Gojo’\n\n‘bow down when I pop out like Sukuna’\n\nThe music sampled is the commercial bumpers/eye catchers from season two. The intro is Yuji Itadori’s English dub voice actor \n",
        "num_comments": 85,
        "comments": [
            "Got Yujis voice actor to do the Intro too.",
            "Perfect for Gojo's thirst traps.",
            "JJK stays winning as always. Genuinely.",
            "LOL the VA at the beginning I was like YO WAIT THAT WAS ITADORI",
            "“I like a tall woman with a nice big ass, Just sayin. Like Grammy-winner Megan Thee Stallion.” is so tuff",
            "Never listen to her music, but she likes jjk and jojo thus far, good taste",
            "Shes a baddie and has taste? Zamn! 🥵",
            "I need a video for this more than I need air right now.",
            "Words cannot express how obsessed I am with this song. And the fact she's the first one able to get an anime sample... her talent. Hottie-gato indeed.",
            "Cant touch me like Gojo was a 👌 line"
        ]
    }
}