{
    "Champ Pool mains megathread": {
        "title": "Champ Pool mains megathread",
        "score": 55,
        "url": "https://www.reddit.com/r/Jungle_Mains/comments/154v71v/champ_pool_mains_megathread/",
        "content": "Hey all Mod here,\n\nmaking a megathread here for people wanting to post about their mains because there are a ton of posts on here about it.\n\nI will also be deleting any posts that pertain to a champ pool.",
        "num_comments": 194,
        "comments": [
            "I started playing the game as fiddle and he’s by far the champ I’m best on but he’s so boring to one trick. I’ve started playing eve, kha, Rengar and Kayn. But I’m s4. Am I trolling myself playing these snowball champs at a low elo?",
            "Any fellow OTP Skarner weirdos on this subreddit?",
            "I’m an Ivern main, through and through, but I’ve also been playing Nunu, and it’s nice having those two in my pool. That being said, I want to add another character to my pool that’s more capable of carrying a game, whilst still kinda fitting the role of a utility champion with a love of ganking, much like how Ivern and Nunu are. Does any champion come to mind that fits the description?",
            "I have a hard time narrowing things down. I main Kindred, I second Fiddlesticks as an AP pick, and I have Udyr as a flexible tank. I also like to play Warwick cause I learned jungle with him, but I have to admit those first three seem to work out better. I have have Poppy as a flex pick whenver I see Yasuo, Kayn, Yone, and Lee Sin because I hate overly mobile champions.",
            "My champion pool is Eve.You can't even understand how satisfying is to watch chat yelling when overfed Mordekaiser gets evaporated.\n\nOther time you just look at her animations and listen her quotes.",
            "i only play graves if i cant play graves in a match, i dodge, i played warwick to a 100k mastery when i was learning the game, and the jungle roll and now i wanna get my graves to 1000000 mastery points i am 200k in silver",
            "Currently Maining Warwick and Trundle. What other champs would be good to round out my champion pool?",
            "To be honest I main Jax in jungle and I don’t understand how in hell it is less a thing than Ekko or Maokai",
            "Mained Sejuani last split and peaked at diamond 1. But got to a point where i couldn't carry games and was too much dependant on my carries (Sorry excuse for my mental in game being shit, which resulted in me droping down to plat 4 again).\n\nNow i main Hecarim, and pick Sejuani as my backup whenever Hecarim is banned. Both champs aren't in the best state right now, but atleast i feel like every game is winnable, no matter the early game outcome",
            "Any Wukong mains here? I would like to have an ap pick too (that is not Diana) whose gameplay is a bittt similar"
        ]
    },
    "Jungle Mains Discord": {
        "title": "Jungle Mains Discord",
        "score": 13,
        "url": "https://www.reddit.com/r/Jungle_Mains/comments/196i554/jungle_mains_discord/",
        "content": "[Link](https://discord.gg/jungle-mains-271021255556071425)\n\nIf anyone wants to discuss jgl diff on discord as well :)",
        "num_comments": 3,
        "comments": [
            "Hell yeah will be looking for coaching on there",
            "Poggies",
            "Yess sir"
        ]
    },
    "Finally after 2 years: MASTER": {
        "title": "Finally after 2 years: MASTER",
        "score": 5,
        "url": "https://i.redd.it/ylek7b502j9d1.jpeg",
        "content": "Hello everyone! I’m [Geass](https://www.twitch.tv/geass14) Main Belveth since the champion’s release.\n\nWhen I started playing Bel my elo was silver. I had to polish my game to go up the division until during the last 2 splits I reached Diamond.\n\nAt the beginning of this split I did terribly, I got to have 30% winrate in my first 100 games, but finally I achieved my goal: Master.\n\nIn the process I reach [2.7MM Mastery Points](https://www.leagueofgraphs.com/es/summoner/las/Geasiwi-LAS) becoming Top 3 in the world with Belveth (in Mastery)\n\nIf I could get there, anyone can.\n\nIf you have any questions about the champion, I'll be waiting for you.",
        "num_comments": 1,
        "comments": [
            "Whats ur playstyle with bel veth?"
        ]
    },
    "Have you ever been autofilled out of jungle?": {
        "title": "Have you ever been autofilled out of jungle?",
        "score": 105,
        "url": "https://i.redd.it/a3pqtyy4pd9d1.png",
        "content": "",
        "num_comments": 69,
        "comments": [
            "once or twice but generally its just 10 second queues.",
            "I got auto filled out of jungle to play top one time. Not really sure how since it says you’re autofill protected.",
            "Literally one time. Someone dodged and I didn’t even get to play the game",
            "Wait, you guys get jungle easily? It fills me adc or sup most of the time.",
            "Never once from silver to emerald",
            "Once in like 1k games",
            "I only get autofilled from jungle when I play with more than 1 player. If I que solo or duo, always jungle. If there is more people, no more jungle",
            "Only in norms when I am put into a 4 stack.",
            "Never been autofilled out of jungle in my life",
            "Exactly twice. Once to supp and once to  mid of all things which was incredibly weird."
        ]
    },
    "Brief statistical analysis of ranked games": {
        "title": "Brief statistical analysis of ranked games",
        "score": 3,
        "url": "https://www.reddit.com/r/Jungle_Mains/comments/1dr9gj2/brief_statistical_analysis_of_ranked_games/",
        "content": "Hi everyone,\n\nI have not been winning that mutch in second split as I did in others, my in-game thoughs were in a circle between \"Im seriously unlucky with teammates\" and \"I should forget about that and focus into me\".  So, after more than 100 games I wanted to do a statistical analysis of my games to convice myself that ranked games follow the 20/60/20 rule\\* and there exist not luck when you count a certain number of games.\n\n  \n\\*20/60/20 rule is a typical answer from Riot employers when people is complaining about Ranked System, it sets that you win 20% of games yes or yes, loose 20% and the rest 60% depends on your performance. This rule obviusly changes in each situation, for example for a diamond player in gold would be like 5/90/5. I believe this is a great approximation for the ranked games.\n\n\n\nTo not making so complex, I wanted to express the \"luck\" in matchmaking in terms of losing lanes, so I went to my opgg and registered the number of losing lanes I had each game. 0 means no lane lost, and 3 all of them did. I want to clarify certain points about this:\n\n* Lanes that were not obviusly lost by the opgg data were not count into any category (\"Draw lanes\")\n* Games with my duo were not take into account as It obviusly bias the data\n* Total ranked games played: 142, where 95 were played alone (Lenght of the data)\n* This nothing has to do with demostrating a losing queue or that. Just trying to see if a player can be realy lucky or unlucky at the matching. If you play to improve its more probable that you win and climb with time.\n\nThe purpose of this was to convince myself that matchmaking is fair, and I get equal games with optimal conditions and worse ones. So, I expected to get a mean of 1.5 losing lanes and a histogram similar to a normal distribution.\n\nResults are shown below, first you have a histogram with counts of data, and then the PMF (For those not familiarized with statistical analysis, pmf is like a normalized histogram showing probabilities of each category).\n\nSurpsrisingly, the mean is higher than expected. Theoretically along more games played this should decrease and get closer to 1.5, but shows that I have not been lucky in my first 100 games :').\n\nEDIT:\n\nFor those with less statistics knowledge, an histogram is a graph that counts the number of cases of a specific possible one. In this case, the graph shows the number of cases of having 0, 1, 2 and 3 losing lanes.\n\nPMF shows the probability of each case, for example, if in 100 games I had 10 times only 1 losing lane, its probability is 10%. This is extended to the case.\n\nAs you can appreciate, the more common case in my experience is 2-3 losing lanes. This is is a very high approximation and does not represent 100% the game experience as other factors have to be taken into account.\n\n  \n\n\n  \n\n\nhttps://preview.redd.it/25hk6c6p0i9d1.png?width=560&format=png&auto=webp&s=53e913302b4bf999b66cebe002e98d2c8c21cbc2\n\nhttps://preview.redd.it/zsr2wl6r0i9d1.png?width=560&format=png&auto=webp&s=b6a1c528a60478956f64e9f10e9c982a8f32a86e\n\n  \n",
        "num_comments": 16,
        "comments": [
            "So the average amount of losing lanes on your team is 1.9158? --- as in, either you're fucking up and losing lane most of the time or you have unfair games? I would expect it to be 25-25-25-25 over 100 games. Having 10 games with 0 losing lanes and 34 with all losing is an insane statistic, no?",
            "Can you write, like a sumamry, for people who do not speak statistics?",
            "At least you can’t get losers queue on MatLab xD",
            "Do you just look at the endscreen and say \"this one lost the lane\"?\n\nAlso there are 4 lanes in that case.",
            "I must do more with my life than playing soloq 🤣",
            "In terms of evaluating the pseudo-random matchmaking it makes no sense to force it to have a lane that is not random, then a % of data is biased to my favour",
            "Dear beta, this is not a win/loose analysis. That’s a work for my own",
            "DuoQ does not affect solo games. The analysis is for solo queue. DuoQ games should be evaluated in a different way, that’s why not included.",
            "You’re telling me if you play 10 games solo lose every game, 20 games duo win every game that the next x number of solo games your duo games had no effect on them? Hilarious",
            "Dear mate, nobody said nothing about winning or losing games. This is about the random matchmaking on lanes. I won and lost all type of games, with and without duo, but that’s not the point of the post"
        ]
    }
}