{
    "Anti-loli is  bodyshaming  apparently": {
        "title": "Anti-loli is  bodyshaming  apparently",
        "score": 1000,
        "url": "https://www.reddit.com/gallery/1dqtrj3",
        "content": "",
        "num_comments": 129,
        "comments": [
            "Except lolis often look like a child, have a child like voice, and BEHAVE like a child, despite being \"500 years old.\" Yet they claim it isn't pedo shit...",
            "they realize theres more defining features of lollis that resemble children other than a flat chest right?",
            "Looking petite and young does not make someone a pedo for liking you. If you act like an actual child (with the mentality of one) then yeah it's creepy as fuck. A lot of the anime lolies that are technically legal still ACT LIKE CHILDREN! that's disgusting.",
            "I find that the weebs who compare lolis to real life short women, do not actually are about real bodyshaming ( notice  how they will never say shit when fat  women get bodyshamed. Don't get me started on their racism issues.).  They just want to defend their precious lolis",
            "Shit like this is why other people think anime fans are weird.",
            "Nobody drew you up with the proportions of a twelve year old and used magical nonsense to create and excuse for you to be legally fuckable. This is about artists and their intent.",
            "LMFAO the \"sieg heil\" comment bc people don't condone adults being attracted to children",
            "If you end up with someone that is an adult that looks like a child, it's fine. If you are with someone because they look like a child or that's a major factor in your attraction to them, that's not okay.",
            "He forgot about his avatar lol",
            "I honestly forgot how gross some of the people on this site could be. Like I still knew reddit had uts degenerates, but this is wild"
        ]
    },
    "Neckbeardy? Or just desperate?": {
        "title": "Neckbeardy? Or just desperate?",
        "score": 294,
        "url": "https://i.redd.it/mnq4d40nl89d1.png",
        "content": "",
        "num_comments": 54,
        "comments": [
            "Either neck beard or else a gross hypocrite.",
            "bruhh i thought the site was fake. singleguyfromadelaide.com dude has a huge fucking page describing hinself and at the bottom some people are praising him for being vulnerable",
            "Neckbeard mixed with the obsession for a pure kindred soul.",
            "He's apparently been trying this for 8 years",
            "My bet is on Human trafficker.",
            "Im looking for an ignorant victim  is what this means.",
            "Oh look, Chris Chan escaped containment",
            "They later called him the \"creepy homepage killer\"",
            "He wants a girlfriend that doesnt know that how he acts is unacceptable.",
            "\"Handsome,\" I doubt it\n\n\"I'm not in a hurry to have children.\" he is 43!"
        ]
    },
    "You know, just because one thing is bad, it doesn’t make the other thing ok. ": {
        "title": "You know, just because one thing is bad, it doesn’t make the other thing ok. ",
        "score": 1239,
        "url": "https://i.redd.it/ygqdcwdoc59d1.jpeg",
        "content": "",
        "num_comments": 93,
        "comments": [
            "I like how they say streamer instead of 35 year old in the bottom one",
            "except onlyfans is an 18+ only website and children lying and stealing their parents credit cards is not at all the same as talking to those minors directly",
            "I mean, I think there's a difference between women posting sexual content on a site where minors may see it vs a grown man intentionally going out of his way to talk to a minor",
            "Why yes, Morgpie being a POS makes Dr. Disrespect innocent, that's how it works",
            "The difference is that one is an adult posting pictures of themselves and the other is an adult trying to obtain pictures of minors. I feel like thats a pretty clear difference.",
            "The minors age in the Dr.disrespect situation was never even stated. And because of that I'm believing it's a preteen",
            "Do they mean attempting to lure *men*? In general? Its not their fault horny teenagers managed to get access to an 18+ only site.",
            "\"happily steal this\" no thanks you can keep that",
            "Being on the beach leads to OF. Huh! Who knew!?",
            "Is the bottom scenario alluding to Dr Disrespect? Isn't the dude in his 40s? How *weird* they specify the age in the first scenario, but don't in the second."
        ]
    },
    "Brother, she's 16": {
        "title": "Brother, she's 16",
        "score": 117,
        "url": "https://i.redd.it/2fuh6lp2499d1.png",
        "content": "",
        "num_comments": 7,
        "comments": [
            "dollar store  dr disrespect looking ass",
            "Why is he smoking an invisible cigar",
            "Guy looks like a biker who only has a scooter.",
            "Oh wow, that suddenly makes it okay! Its now like the law can ever be wrong",
            "OHUIO?!??,?!??!? SIIBIDI DO DON DON YES TES SKIBIDI DUBIDIBDUIP DIIP Skibidi sigma pomni digital Fortnite Chamba Oh my G*d! Flow xxxtentacion hotmail Lionel ronaldo",
            "Assistant TO THE Tech Disrespect",
            "Assistant Tech Disrespect"
        ]
    },
    "Average Facebook Experience ": {
        "title": "Average Facebook Experience ",
        "score": 216,
        "url": "https://www.reddit.com/gallery/1dq6ua1",
        "content": "Help\n",
        "num_comments": 39,
        "comments": [
            "It's 4chan for boomers, except instead of being anonymous, your uncle gets fired.",
            "Dude fb just irritates me at this point, I got banned so many times but then they have ads and profile stories of hardcore porn. \n\nI only reported 1 thing in my life on fb, a tree full of kids hanging on nooses dead like 5or 6 of them couldnt have been older than 8. Fb sent back how it didnt go agains their community standards",
            "that specific character is 12 years old. gross :(",
            "There was a community just like this. They were cool for about a year but now they're posting thirst traps and characters of VERY questionable ages. I reported them but I don't think FB is going to do anything. Ps, the mods aren't doing shit about it and I don't want any part.",
            "me saying \"bitch\" crosses the line and gets me banned for 30 days, BUT THIS????",
            "Gross especially since I'm pretty sure the character is a child",
            "I wanted to downvote this post so badly then I realized it wasnt actually from a neckbeard, just a repost, but im still disappointed ",
            "YES AND IM OVER IT!! Ive given up on reporting these because they always say that these ai hentai post dont break community guidelines",
            "Obligatory boomer not realizing comments are public",
            "i spent months fb jail because of litlle edgier meme (not insulting, just edgy) but they can share this stuff.\n\nthank god I dont use socials anymore (reddiit only)"
        ]
    }
}