{
    "Thank you, JNM! Megathread": {
        "title": "Thank you, JNM! Megathread",
        "score": 0,
        "url": "https://www.reddit.com/r/JUSTNOMIL/comments/1dknr9r/thank_you_jnm_megathread/",
        "content": " Are you a lurker who has benefitted from the support and advice given to others? Tell us about that here!\n\nAre you an adult child who had to deal with a heinous cunt and has come out the other side with the support of the sub, whether through running out of fucks to give, getting in touch with your inner granite, becoming a copy editor of the information disseminated to her, or voluntarily ghosting her? We want to hear about it! \n\n^(This thread reoccurs on the 20th of each month.)",
        "num_comments": 2,
        "comments": [
            "This sub has helped me stop wasting my time thinking and writing about my MIL.",
            "**Quick Rule Reminders:**\n\nOP's needs come first, avoid dramamongering, respect the flair, and don't be an asshole. If your only advice is to jump straight to NC or divorce, your comment may be subject to removal at moderator discretion.\n\n[**^(Full Rules)**](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_rules) ^(|) [^(Acronym Index)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_acronym_dictionary) ^(|) [^(Flair Guide)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_post_flair_guide)^(|) [^(Report PM Trolls)](https://www.reddit.com/r/JUSTNOMIL/wiki/trolls)\n\n**Resources:** [^(In Crisis?)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_crisis_resources) ^(|) [^(Tips for Protecting Yourself)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_protecting_yourself) ^(|) [^(Our Book List)](https://www.reddit.com/r/JUSTNOMIL/wiki/books) ^(|) [^(Our Wiki)](https://www.reddit.com/r/JUSTNOMIL/wiki/)\n\nOther posts from /u/botinlaw:\n\n\n* [BEC Megathread](/r/JUSTNOMIL/comments/1dcxwii/bec_megathread/), 1 week ago\n\n* [justYESmil Megathread](/r/JUSTNOMIL/comments/1d5y0fm/justyesmil_megathread/), 2 weeks ago\n\n* [Thank you, JNM! Megathread](/r/JUSTNOMIL/comments/1cwrppv/thank_you_jnm_megathread/), 1 month ago\n\n* [BEC Megathread](/r/JUSTNOMIL/comments/1cp1gmy/bec_megathread/), 1 month ago\n\n* [justYESmil Megathread](/r/JUSTNOMIL/comments/1chyloo/justyesmil_megathread/), 1 month ago\n\n* [Thank you, JNM! Megathread](/r/JUSTNOMIL/comments/1c91qmi/thank_you_jnm_megathread/), 2 months ago\n\n* [BEC Megathread](/r/JUSTNOMIL/comments/1c0xwti/bec_megathread/), 2 months ago\n\n* [justYESmil Megathread](/r/JUSTNOMIL/comments/1bth58c/justyesmil_megathread/), 2 months ago\n\n* [Thank you, JNM! Megathread](/r/JUSTNOMIL/comments/1bjprkb/thank_you_jnm_megathread/), 3 months ago\n\n* [BEC Megathread](/r/JUSTNOMIL/comments/1bbmew8/bec_megathread/), 3 months ago\n\n^(This user has more than 10 posts in their history. To see the rest of their posts,) [^(click here)](/u/botinlaw/submitted)\n\n\n\n*****\n\n\n\n^(To be notified as soon as botinlaw posts an update) [^click ^here.](http://www.reddit.com/message/compose/?to=botinlaw&subject=Subscribe&message=Subscribe botinlaw JUSTNOMIL) ^(|) ^(For help managing your subscriptions,) [^(click here.)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_.2Fu.2Fthejustnobot)\n*****\n\n\n\n\n*^(I am a bot, and this action was performed automatically. Please)* [*^(contact the moderators of this subreddit)*](/message/compose/?to=/r/JUSTNOMIL) *^(if you have any questions or concerns.)*"
        ]
    },
    "I lost it on my convicted MIL- she won't back down": {
        "title": "I lost it on my convicted MIL- she won't back down",
        "score": 283,
        "url": "https://www.reddit.com/r/JUSTNOMIL/comments/1dr6x2t/i_lost_it_on_my_convicted_mil_she_wont_back_down/",
        "content": "Update, see thread for back story.. I usually post in /inlaws beacuse all members are very toxic but MIL the one driving me crazy. So I finally lost my cool on my MIL.  The last visit we had was around 3 weeks ago for a birthday, whenever I am around them I keep to myself as much as possible for the sake of DH, I usually read magazines, books, spend time outdoors sunbathing or go on my phone. I am polite and cordial but do not engage much. I have always been on guard with them because of what I heard about their daughter going NC with them and them getting sued and convicted for trespassing and disturbance of the peace. FIL is a total brute and I steer clear from him, he has a very anxious and angry energy that I find unpleasant. MIL is sickeningly sweet, you would never guess there is something wrong with her upon meeting her but she is in perpetual victimhood. I think covert narcissist describes her very well. They have never done or said anything mean or rude to my face or behind my back that I knew about up until recently but she really annoys me.\n\nDuring a visit 3 weeks ago FIL made some comments about my growing body (I am 8 months pregnant). I replied that I didn't tolerate comments about my body, that I was healthy and that was the most important. DH and MIL also backed me up in the moment. I thought he was sloppy and that at least he wouldn't make the same mistake again. Oh boy was I wrong. Speaking up for myself, telling him how and how not to speak to me must has REALLY triggered him. \n\nLast week we visited again and he didn't say hello just started telling me how big I was getting and telling me to lay off the chocolate. I was in complete shock. DH immediately told him to fuck off so did MIL I just sat there in shock. I was relieved that DH cut him off immediately (not that it matters but I am a healthy person and have gained the recommended amount of weight during my pregnancy). I don't feel insecure about how I look but I immediately felt furious and felt tears coming to my eyes. I walked out of the room slammed the door and threw myself on a bed and started crying. DH followed me shortly after and he let me know that he spoke to him again about how wrong he was to do that. He also let me know that MIL was also furious and yelling at him and that he had simply replied that that's the way he was and he wasn't going to change. When I heard that I felt a bold of energy surge inside me and I said let's go home- DH agreed and we grabbed our things and headed to the car. I felt so relieved that DH was on board that he wanted to go home too. But then things went to hell.\n\nMIL and FIL followed us up to the car and FIL apologized to me- it was too soon I was not ready to receive any type of apology from him I didn't even want to look at him. I told him I didn't want to speak with him and that I wanted to go home. Then MIL starts crying and demanding that I accept his apology- telling me I shouldn't leave, asking me \"Haven't you ever made a mistake?\" Telling me that I was beautiful and that I shouldn't be so affected by his comment- I said I know I am beautiful but I don't feel safe here, I want to go home. She started sobbing even harder and telling me that I should stay and accept his apology- that I am overreacting and this just felt so manipulative I snapped and said \"It's not my fault you have a shitty husband\". She was in shock and DH cut me off. I told him to get his mother away from me and to take me home. I don't regret what I said. I felt attacked by both of them, even more so by MIL who clearly did not care about me or how I felt, just wanted to sweep everything under the rug and go on pretending like she has a happy close-knit family. \n\nNow things have been really tense for the past week between DH and I. They have been making him feel guilty about his decision to leave, to the point where he begged me to go back there to smooth things over. DH is really sad about everything and I can tell he feels torn between his family and I. I did not want to go. He spoke to them on the phone to smooth things over and let them know that we can move on from this but if something similar were to happen we would leave again so I went, it was extremely unpleasant for me although nothing happend. \n\nOne big source of annoyance for the past 2 years was that they included me in a group chat I found this really annoying for many reasons. I don't like group chats, they all speak a different language than me so I would have to translate a lot of the messages. I stayed in it because there was a renovation project with a family property and they would frequently ask about tiles, paint color etc. I would give my 2 cents every now and then but since I have no desire to share a property with a dysfunctional bunch I didn't participate much and found that when I did my opinion was rarely considered. Once the project was over I left the chat group. During that same day she repeatedly added me and I left each group 4 times in a row. At the end of the day she made a group with just DH and I. I gave up and just stayed since I figured communication would not be so frequent- it wasn't but messages have increased since we announced our pregnancy. Around 4 months ago things between us and them seemed to had been improving. DH and I had kept more distance and used the grey rock technique so when she added me to another group with the other ILS again I was annoyed but I just stayed in the group and didn't reply to any messages.\n\nSince this moment of conflict when I lost it on her I realized I'd given in too much (getting messages from them frequently and the frequency of visits has increased again). The way this family speaks to each other on this group really triggers me. BIL belittles DH and she pretends like we have this happy united family...I decided I would leave the group after the incident since I need to reduce the amount I am exposed to them to as little as possible and DH clearly told her that I did not want to be in any chat groups. She tried to throw me under the bus and suggest that I was dramatic and that I overreacted- this obviously made me more angry. I removed her from social media and within 12 hours she had requested to follow again. I left the group with the ILS and yesterday I find that she added me again. I finally decided to block her. I am so sick about this situation. ",
        "num_comments": 37,
        "comments": [
            "My mil is this way too. Expects everyone to deal with her husbands piss poor behavior because she does. It’s exhausting",
            "Yes, I always wanted to flee my dysfunctional in laws house when I was pregnant it was like the energy in the house activated my flight response in a very strong way… so odd this happens. \n\nTake care of yourself and have some deep talks with DH about boundaries once baby is born too… she feels entitled, so it’s going to get worse and triggering for her especially if she is a narcissist…",
            "Your DH is behaving like an enabler, this is unfair and deceiving, because he sides you and later he sides them.    The enablers cause as much damage as the abusers.  The critical problem is him.",
            "What made your husband choose for his parents and not for his sister?\n\nI think the answer to this question is really important for you. Will ge ever protect you 100% or will he always choose his parents in the end?",
            "OP, your MIL and FIL are problematic, but you really have a\nDH problem. He wants you to let them make it all better. He wants you to allow them to apologize and let it all go. He’s “sad,” because you won’t. He’s manipulating and guilt-tripping you.",
            "I've turned of notifications on a certain family group chat, just that group not the whole app. it just goes on without me like im not even there.",
            "Frankly your husband did'nt learn first lesson of being married, ***thats not his family***. Those are relatives. Family's your partner, kids etc. I'm sorry your JNIL are so shite. Would suggest therapy for the DH.",
            "I would consider that with hormones and pregnancy that the ILs behavior may be triggering you more than what would be usual, and you should tell your DH this. Maybe he would agree to lay off the pressure to participate and explain this to his family. But realistically, it sounds like you need to just go LC or NC for your mental well-being, at least in the short term.",
            "I only know a small portion of what really happened. All I know is from what I have observed is that they have a dysfunctional enmeshed family where loyalty is given first to the parents. The mom made herself out to be the victim of her crazy daughter and the brothers just sided with her…",
            "Thank you for input. I want to have more boundaries and more clear consequences for their violation. Does anyone have and resources? I looked at the page resources but haven’t found much .."
        ]
    },
    "Pregnant with #2 and I refuse to let MIL make this pregnancy about herself": {
        "title": "Pregnant with #2 and I refuse to let MIL make this pregnancy about herself",
        "score": 238,
        "url": "https://www.reddit.com/r/JUSTNOMIL/comments/1dr3i9a/pregnant_with_2_and_i_refuse_to_let_mil_make_this/",
        "content": "Pregnant at 5 months PP. Had a slip up, took a Plan B, two weeks later got a positive test. I’m excited and terrified at the same time!!\n\nBeing that I’m only 5 months pp, the way MIL acted during my pregnancy with #1 is still very fresh on my mind. I feel like she truly believed my pregnancy was equally about her becoming a grandmother as it was about DH and I becoming parents. She made me feel like an incubator for “her baby” and took away from a lot of the joy. I spent quite literally every day of my pregnancy stressed out over her ridiculous and unpredictable behavior. \n\nI think we did well in regards to setting boundaries during the first pregnancy, and when MIL got to be too much I went NC. With #1 I actually didn’t have to see MIL my entire pregnancy because we live across the country, and even when she attempted to guilt me into flying 3,000 miles so she could throw a baby shower with her friends (the same friends she sits and gossips about me with) I declined. This time will be a little bit different because we will be moving about a 6 hour drive from MIL later this year. As with last time, I plan on having MIL/FIL wait 6 weeks before visiting after birth. I’m so glad we made that choice with #1. I have a post up about MIL’s visit and what a nightmare it was. \n\nThe difference with this pregnancy is that I refuse to allow MIL to take away from my joy. There are no chances to overstep and I won’t sugarcoat anything. When it comes to a shower, she’s not invited, and if she finds out and gets upset- oh well. Even if we’ll be a car ride away this time it doesn’t mean I want her around while I’m healing. I’ve already told my husband point blank “I’m not doing anything that makes me unhappy this pregnancy”. \n\n\nETA: For those that have multiple children, was your MIL’s behavior with the second pregnancy any better/worse than the first?\n",
        "num_comments": 23,
        "comments": [
            "Don't tell her you're pregnant. She doesn't need to know.",
            "Congratulations!  Is it worth not telling her about the pregnancy at all?  Make a birth announcement and give yourselves the gift of peace.",
            "My MIL was HORRIBLE with my first, so she didn't get to meet my second until she was almost 3 months old. Her behavior was better, but only because I had set so many impossible to cross boundaries after my first pregnancy and postpartum period left me absolutely traumatized because of how terrible she was to me. My second pregnancy wasn't as soon after as yours, so my MIL had gotten enough time to kind of lose interest in my first once she finally seemed to understand she wasn't going to get what she wanted in regards to babysitting, alone time, etc. I think she kind of would've lost interest anyways, as she's much more into babies than toddlers, since she really just wants dolls to carry around rather than actual humans with their own feelings.\n\nI think the 6 week plan is a great plan and good for you for setting that expectation with your first too. I think your boundaries will make a huge difference in your pregnancy experience this time around.",
            "It will be better because you know what to expect from her. Also, you have much more experience with telling her no.",
            "Congratulations! I feel like the best way to keep her out of this pregnancy is to do what you did last time -- go NC, this time right away. Let DH be the brick wall between you and her and let him handle her. No visits, no texts, no calls, no FaceTime, nada. She wants something involving LO#1, DH takes care of it. And **no visits**, especially after you move. She'll probably try to talk DH into giving her a key for \"emergencies,\" don't let him. You already know what she's going to try to do, all the better to head her nonsense off before she can even start it up again. 🙂💛",
            "Hey, this has one benefit anyway — you can keep it from her till quite late on. Just keep telling her \"Oh I know, I really need to lose the baby weight\" till you're, ooh, 8.5 months..?!\n\nGood luck. \"Irish twins\" can be fun, if exhausting — at least you get a lot of the messy early stuff over at the same time..!",
            "My now EX MIL was worse. She made it about her and how SHE can't afford another (because she was paying for them? No her 20 dollar gifts at birthdays and Christmas don't count.) \"She should abort that\" yep... so much worse the second time around. Mind you it would have only been her second blood grand child. Then the pity party started when I blocked her access to me and my youngest completely. She wasn't allowed in my home, near me or at the hospital. She met the baby a few weeks after birth and she wasn't allowed to hold him, didn't get to hold him until he was over 4 months old. And the flying monkeys...",
            "My second was lil more hyped because it was a different sex and we lived with them for the majority of my pregnancy. When I tell you the anxiety was maddening for me. She was extremely passive aggressive towards me and rude! The moment we closed on our house and begin to move she lost her marbles! I believe she realized the access she had once to us would be limited or even non existent and she was scrambling to be apart of *something* to secure her spot and I wasn’t giving in. \n\nShe complained about me doing “too much” and I need to ask for help, little did she know, I was excited to get up early in the morning and come back late at night because I was being productive at my house. She even made a comment about us not being entirely moved out until my baby was born, not the case. We were completely out in two weeks.",
            "Because I’d set concrete  boundaries the first time, things were MUCH better the second time around!",
            "I 100% see this happening. MIL and FIL are both uncomfortably obsessed with #1. They’ve only visited once so far and kept pushing to babysit, which was declined. They only had boys, so they’ve said things like “I finally got my daughter!!”. I’ve already decided it’ll be my mom helping with #1 if anything."
        ]
    },
    "I just achieved everyone’s dream": {
        "title": "I just achieved everyone’s dream",
        "score": 43,
        "url": "https://www.reddit.com/r/JUSTNOMIL/comments/1drbw4h/i_just_achieved_everyones_dream/",
        "content": "Long time lurker of this sub. I have a MIL who might take the cake as one of the worst people I ever met. She made my pregnancy absolute hell, including yelling at me and trying to guilt trip my boyfriend into spending more time with her instead of me. saying she would have her own baby shower. And post partum, trying to make me bring her my baby whenever she wanted to see him. \n\n\nMake a long story short: we live in their basement apartment with our 5 month old. Last week, she handed us an eviction notice. I asked her to meet with us to explain herself. Immediately, things went south. I was holding our baby when she started screaming in my face. Big mistake. I handed my baby to my boyfriend and unleashed pent up rage I had since the moment I met this woman. I told her she goes every Sunday and lies to god, everyone can see past her fake kindness, nobody likes her, she’s a horrible person, she’s attention seeking, she’s evil, and a bunch of very colorful curse words. She ended up screaming in my face at one point and I felt like she was going to hit me so I quietly took back my baby, went back to our basement apartment, and called the cops on her.\n\nThe pleasure of seeing her name listed as a suspect was the best pleasure I’ve had in a long time. As of now, I will never have to see this woman again, and hopefully my baby will not have to either. For once, I didn’t hold back and fawn with her. I was on the full offense, and god did it feel good and I don’t regret a single word I said.",
        "num_comments": 5,
        "comments": [
            "Hell yeah!! Way to go my friend. Sweet relief… 💯🎉",
            "What do you mean she's a suspect?  Suspected of what?",
            "Blessings!!!!💜",
            "What about BF ? Did he support you ? or take MIL's side ?",
            "**Quick Rule Reminders:**\n\nOP's needs come first, avoid dramamongering, respect the flair, and don't be an asshole. If your only advice is to jump straight to NC or divorce, your comment may be subject to removal at moderator discretion.\n\n[**^(Full Rules)**](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_rules) ^(|) [^(Acronym Index)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_acronym_dictionary) ^(|) [^(Flair Guide)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_post_flair_guide)^(|) [^(Report PM Trolls)](https://www.reddit.com/r/JUSTNOMIL/wiki/trolls)\n\n**Resources:** [^(In Crisis?)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_crisis_resources) ^(|) [^(Tips for Protecting Yourself)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_protecting_yourself) ^(|) [^(Our Book List)](https://www.reddit.com/r/JUSTNOMIL/wiki/books) ^(|) [^(Our Wiki)](https://www.reddit.com/r/JUSTNOMIL/wiki/)\n\nWelcome to /r/JUSTNOMIL!\n\nI'm botinlaw. I help people follow your posts!\n\n\n\n*****\n\n\n\n^(To be notified as soon as archnemmmy posts an update) [^click ^here.](http://www.reddit.com/message/compose/?to=botinlaw&subject=Subscribe&message=Subscribe archnemmmy JUSTNOMIL) ^(|) ^(For help managing your subscriptions,) [^(click here.)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_.2Fu.2Fthejustnobot)\n*****\n\n\n\n\n*^(I am a bot, and this action was performed automatically. Please)* [*^(contact the moderators of this subreddit)*](/message/compose/?to=/r/JUSTNOMIL) *^(if you have any questions or concerns.)*"
        ]
    },
    "Radio silence since I gave birth last week": {
        "title": "Radio silence since I gave birth last week",
        "score": 292,
        "url": "https://www.reddit.com/r/JUSTNOMIL/comments/1dqyxh6/radio_silence_since_i_gave_birth_last_week/",
        "content": "Am I thankful to not deal with her right now? Absolutely. But it’s also giving me anxiety because we KNOW she’s setting up her next victimization by waiting to see how long it takes us to invite her over. What would you do—invite her over and rip the bandaid off, or let it sit knowing she’s going to act all hurt that it took x amount of time for her to be allowed to visit? My preference is the latter. How do we not participate in this little game??",
        "num_comments": 73,
        "comments": [
            "I don't play games like that. She can sit and stew until she decides to be a grown up and communicate like one.",
            "Wait until you’re ready for visitors then invite her.  Thank her for giving you time to adjust to your new life and not pressuring you to come visit before you were ready.  Make it so she can’t turn it against you without looking like a complete asshole.",
            "You can make a post about how wonderful everyone has been in allowing you time to bond with your baby without having to deal with demanding family members trying to visit before you’re ready.",
            "I LOVE THE SILENT TREATMENT. Keep it going, don’t break. It’s a power move to get you beg. Don’t fall for it.",
            "Enjoy the silence. Enjoy the baby. Stop letting her live rent free in your head.",
            "You aren’t responsible for her feelings. Focus on your new baby and the only priority!",
            "You wait until she says something and say “ we appreciate your kindness in giving us space to get settled as a family of_. You must remember how difficult it was when husband was born. I appreciate your thoughtfulness!” All sweet and then plan a visit a week or so out. If family brings up her not visiting because she’s been crying to them you say the same, you’re grateful she has been so considerate! You are lucky to have such a kind MIL. If they still bring it up you can then tell them you must have misunderstood her gesture and didn’t realize she was playing games with a postpartum mother instead of using her words, thank them for the info and now maybe you need to rethink her intentions.",
            "If she guilt trips you, say you've been soaking up all the fantastic new baby love and can't even think about anything else 🥰",
            "Oh, MIL, there you are! Honestly, we’ve been really hurt that you didn’t seem to care enough about us in this hugely difficult and emotional time to even check on us. What’s that? YOU are hurt? Because…WHAT?! \n\nAnd just keep repeating what she says back in a soft, incredulous tone.",
            "Personally I'd go for some reverse psychology. I'd tell people (but not her) that MIL is so considerate in waiting, that she understands the need for space and bonding for young parents. That way, if she starts her victim-spiel she'll come off as a complete  ass."
        ]
    }
}