{
    "Original Content ONLY": {
        "title": "Original Content ONLY",
        "score": 8687,
        "url": "https://www.reddit.com/r/Justrolledintotheshop/comments/6kuoc5/original_content_only/",
        "content": "There seems to be a recent influx of posts from people who are attempting to karma harvest by way of stealing other people's images or reposting from different websites.\n\nYou are not allowed to post images that are not your own. Facebook reposts are not allowed. Reposts of other user's content is most definitely not allowed and WILL result in a permanent ban from JRITS.\n\nLast but not least, i want to say thank you to all the JRITS subscribers that do detective work and catch these people red handed. it really makes a moderator's job quick and easy. Again, thank you.",
        "num_comments": 2,
        "comments": [
            "Thanks geek for this.",
            "I'll address some reports here.  Keep in mind that reports are anonymous, so I'm not flaying anyone alive here, just addressing what appear to be concerns.\n\n> 1: Booo! We need more content, not less.  \n>1: This sub is about to die with a rule like this.  \n\nThe OC Only rule has been a rule since day 1, and this sub continues to grow steadily.  [Check this out if you want proof.](http://redditmetrics.com/r/Justrolledintotheshop)  It goes to show that quality is more important than quantity.\n\n>1: mod abuse\n\n<sarcasm> Oh no, mods enforcing the rules.  Total abuse, time for a coup. </sarcasm>\n\n> 1: Thanks for working to keep the sub as it was originally intended! :D\n\nWe work hard to keep quality up, that's why **OC only has been a rule since day 1**\n\n>1: WAAAAH I WANT OC WAAAH AND DO MY JOB FOR ME LOWLY FUCKING PEASANTS WAAAAAH\n\nWe don't make any money off of this, we're just bringing order to an open forum that allows people to share interesting things.  Don't you ever like to share interesting things you find?  \n\n> 1: What about x post gibing credit?\n\nThe original poster can crosspost it themselves.  \n\n>1: stop being nazis, i just want content\n\nIf you just want regurgitated reposts, go check out the rest of Reddit :)\n\n>1: Stop removing comments on this post you Nazi  \n>1: lol why a locked thread? not even going to let us discuss this?\n\nThis rule is the 10 commandments of this sub, it has been here since this subreddit was created.  It's not up for discussion, it's the second golden rule of this sub besides the implied DBAA. \n\nAlso, a friendly reminder to read the rules and help us out by reporting offending posts.  This isn't our job, none of us get paid to do this, so we take time out of our busy lives to check up on the sub and can't catch everything.  \n\n[Drop us a line here](https://www.reddit.com/message/compose?to=%2Fr%2FJustrolledintotheshop) instead of messaging us directly if you have any questions or concerns.  That will go to all of the moderators, so we may be better able to answer you with more eyes on your message. "
        ]
    },
    "10 year old Ferrari with 2500 miles in for its annual oil change. Probably should have saved the oil for my lawn mower...": {
        "title": "10 year old Ferrari with 2500 miles in for its annual oil change. Probably should have saved the oil for my lawn mower...",
        "score": 11617,
        "url": "https://v.redd.it/7kkqvxxbhc9d1",
        "content": "458 Spider in for annual service and a battery. See of these get driven, and some sit in fancy collections looking pretty. ",
        "num_comments": 726,
        "comments": [
            "Out of curiosity how much is an oil change on one these?",
            "What’s the full volume on those?",
            "Jeez I would have saved it for my good car. Lawnmower can run on the cheap stuff.",
            "10 years 2500 miles?  Sheesh, just buy a fancy statue at that point.",
            "Cleaner than the oil I buy from the store for my shitbox",
            "Definitely done this before on Aston Martin’s some times I swear the oil I put in ls dirtier then what comes out",
            "Why is it that oil needs to be changed yearly if it hasn't been used?",
            "Might as well just leave it on the lift for the year until the next oil change.",
            "Guessing by background music customer was a waiter looking through the garage door? ",
            "I’ll take “wasted vehicles” for $300, Alec."
        ]
    },
    "I got a pizza for a tip": {
        "title": "I got a pizza for a tip",
        "score": 1542,
        "url": "https://i.redd.it/ykcrj21azc9d1.jpeg",
        "content": "",
        "num_comments": 129,
        "comments": [
            "I did this once. My racecar was at my regular performance shop for a couple of weeks. Coordinated with the office manager to buy pizza and snacks for the whole shop.\n\nThey reciprocated by returning the car to me with no coolant in the charge cooler circuit. LOL I don't mean like they forgot to bleed it, I mean it took a half gallon of coolant to fill it up and the electric pump was in dry running protection fault.",
            "I always grabbed a couple of pies for my machine shop guys and went to check on my stuff around lunchtime.  The greasy pie greases the wheels.",
            "I'm dyin here. Moved away from Jersey 35 years ago and I can't get real pizza, That looks like heaven. Now fold that shit right.",
            "I brought in donuts in appreciation for the service guys after they figured out a tricky problem on my car, is that not a thing to do?",
            "General manger once asked me and a close friend/coworker to stay late and finish some accessories on a new car. We told him we needed wings and Dr. Pepper. He sent a salesman and got us 100 Buffalo wings and two 2 liter Dr. Peppers.",
            "When I was younger and worked in a pizza place, I had an old square body Chevy and didn’t know a ton about working on cars yet. The shop I took my old truck to got pizza every Wednesday and they took good care of my truck. Well until it threw a rod driving down the highway and the owner blamed me. The techs were pissed they didn’t get pizza Wednesdays anymore.\n\nEdit: I should add that I bought the motor from them.",
            "I do this at my dermatologist exams. The office girls see me walk in, and they say hey it's the pizza guy. We all laugh.\"",
            "Where are the toppings? It's naked.",
            "Wait... you guys are getting tips?",
            "this is now a pizza sub"
        ]
    },
    "Customer states \"I know a guy who can do it cheaper\"": {
        "title": "Customer states \"I know a guy who can do it cheaper\"",
        "score": 615,
        "url": "https://v.redd.it/vdxdq56n9e9d1",
        "content": "Yea... It was me. I tried to replace my tires. All went well till one of the weights did this.",
        "num_comments": 33,
        "comments": [
            "It's a dynamic wheel weight. State of the art.",
            "That's impressive actually, you could try to do that and never nail it that good.",
            "Oh it's balanced alright 😂",
            "This is fine. Nothing to see here. Billable 1 hour of diag and send it.",
            "Perfectly in balance (except the wheel)",
            "Automated wheel cleaner. A rare OEM option.",
            "Is it hitting the backing plate?",
            "And lemme guess you came in here after he fixed your wheel, yeah?",
            "Needed my breaks replaced a little while ago. That same guy said ‘dude, I can replace your breaks for 20 bucks.’  \n\nYeah, sure. I want to put my life in the hands of a stoner who says he can do it for $20.",
            "Looks like the backing plate rusted and an edge of it grabbed the weight."
        ]
    },
    "Customer states they replaced the throttle position sensor themselves. Believes bad PCM is the cause.": {
        "title": "Customer states they replaced the throttle position sensor themselves. Believes bad PCM is the cause.",
        "score": 630,
        "url": "https://i.redd.it/7ggdl2y5fc9d1.jpeg",
        "content": "Auto parts store told them throttle position sensor was bad. Somehow this was their repair, along with the new throttle body. Because there is still a TPS code, they think the PCM is bad. They brought a used PCM for us to install, but we advised them that we need to do more diagnosing and wiring repairs before we throw a PCM at it.",
        "num_comments": 69,
        "comments": [
            "Well the PCM might be bad now.",
            "Nah, y'all just trying to con them. That wiring job is impeccable. Customer is a pro. You should hire them and fire the best guy you have.",
            "How could someone do that butchery and think “Yup, that ought to fix it!” ? The rats chew up wiring using better workmanship than this ham-fisted electro-magician has.",
            "Why is an auto PARTS store “diagnosing” customer issues to begin with, and why is the customer listening to them?",
            "I feel like this should be in r/WTF .  Honestly WTF!",
            "I could have spliced that better with kitchen scissors and scotch tape when I was 10. \n\nIf they cant wire-wrap splice I don't want them doing anything slightly more complicated on their car!",
            "Looking at that “wiring,” it wouldn’t surprise me one bit of the PCM was bad. It wasn’t when they started, but she’s right dickered *now!*",
            "Close hood.\nReturn keys to customer.\nTell them to fuck off.",
            "Love how fast people want to throw a computer at something",
            "The customer is always right, sounds like you need to go ahead and replace the PCM."
        ]
    }
}