{
    "ISRAEL/PALESTINE MEGATHRED": {
        "title": "ISRAEL/PALESTINE MEGATHRED",
        "score": 392,
        "url": "https://www.reddit.com/r/JustUnsubbed/comments/1am4yq5/israelpalestine_megathred/",
        "content": "**Please air all of your thoughts, opinions, grievances, and arguments regarding the Israel/Palestine conflict in this thread ONLY.**\n\n***We are no longer approving new posts on this subject.***\n\nThis thread will be heavily moderated, so please refresh yourself on [**Reddit's Content Policy**](https://www.redditinc.com/policies/content-policy)\n\nAll previous posts on this specific subject will have the comments locked, so you will no longer be able to discuss this issue anywhere else in this community.\n\nEdit: Typo",
        "num_comments": 828,
        "comments": [
            "The mods on the Sonic sub unbanned political posts just so the head mod could post his shitty fan art about the war. No wonder Sonic fans are so mocked.",
            "People are looking at the situation over simplistically. The whole Gaza good Israel bad attitude. They ignore Hamas deliberately putting Palestinians in the line of fire to hide behind so as to make Israel look bad. Hamas' actions are ignored.",
            "Fandom was not made for this. Fandom was made to escape this.",
            "I believe it's kinda surprising the actual Israel subreddit hasn't been brigaded yet, just a bunch of unrelated subreddits\n\n(I'm not calling for it to happen, though, just saying it's surprising)",
            "I'm just gonna leave this here for no reason at all....\n\nhttps://preview.redd.it/ggd0rq8w5ghc1.jpeg?width=225&format=pjpg&auto=webp&s=63f783f3ac2dbf20cbdc2ed086b9e00f5123231d",
            "[deleted]",
            "https://preview.redd.it/mc6yvgvwifhc1.jpeg?width=749&format=pjpg&auto=webp&s=11be3dfa188c7fa2161c301775b3a8af89bf3811",
            "Thank god. This sub has ironically become the spot I see the most Israel/Palestine stuff on my whole Reddit feed, and it’s always posted by people who want to see less Israel/Palestine stuff.\n\nLike genuinely I hope for the best for all the people of the Middle East, but I want to go back to my regular bullshit content.",
            "This war really showed that people dont want to/ cant comprehend that war isnt black and white with one clear good and one clear bad side, and that the weaker side needs to be supported simply because its weaker.\n\nHonestly most protest post (like the recent examples here) just have the feeling of people wanting to have the moral highground without even understanding what they support. Of course then there are also the blatant propaganda posts like on TikTokCringe or ThereWasAnAttempt where facts dont matter anything.",
            "Unpopular opinion but I think war is bad"
        ]
    },
    "Slash cats is full of DEAD PETS so f*k em": {
        "title": "Slash cats is full of DEAD PETS so f*k em",
        "score": 280,
        "url": "https://www.reddit.com/r/JustUnsubbed/comments/1dqt8eo/slash_cats_is_full_of_dead_pets_so_fk_em/",
        "content": "Not a consistent Redditor but I've been around long enough to form an opinion and have the opportunity to provide feedback to the moderators of cats AKA MY POOR DEAD PET sub. \n\nWhen asked,*their own community* made a whole thing about their mourning/loss posts. The mods solution was to go to the sub to search for and then exclude those posts marked as DEAD PETS. \n\nI stayed for a minute because hey, cats are cute and i joined the sub to look at cute endorphin inducing pictures of kitties, NOT DEAD PETS. but even though I don't engage in those DEAD PET posts that's all i really saw from that *huge* community. \n\nLast straw happened and I declared my displeasure of the lack of a safe place for these folks to *actually genuinely mourn* instead of using their boohoo situation to farm karma. Now they're all pussyhurt saying I'm the asshole for not wanting to have their DEAD PETS in my feed and I'm just 🖕",
        "num_comments": 61,
        "comments": [
            "Should just have a sub for “my pet died and I’m sad.” It would be a perfectly fine sub and we could leave the other pet subs for cute pictures.",
            "https://preview.redd.it/s54uf98kvd9d1.jpeg?width=4080&format=pjpg&auto=webp&s=888d7d41f32799d2c8f606c5a8ac12287ec5af8c\n\nMeet Mr. Snow Berry. He wants to make sure you have a great Friday like he is! 🌺",
            "https://preview.redd.it/o6fd6bvk1e9d1.jpeg?width=4032&format=pjpg&auto=webp&s=ada41fd5c54dbc3f8458a5054a365d0e7ee8ba13\n\nI’ll gladly hop on the happy kitty pics trend! Here’s my boy Wade! 🥰",
            "https://preview.redd.it/msaf0eujae9d1.jpeg?width=3024&format=pjpg&auto=webp&s=25fe6ced27a4f4dcc3f1bfd313b191d761fb824f\n\nThis is my cat Bobbin, she is alive and kicking",
            ">I declared my displeasure of the lack of a safe place for these folks to actually genuinely mourn i\n\nThere already is one! They just won't keep those kinds of posts there.",
            "I did unsub from r/ labrador for that exact reason. I want to see cute labs, not peoples dead pets. \n\nAnd since my own lab is getting old I definitely DO NOT need reminders that he won’t be around forever.\n\nI do visit it quite often anyway, I can’t stop myself.",
            "https://preview.redd.it/oypzaewhnd9d1.jpeg?width=938&format=pjpg&auto=webp&s=eda878cfa06806165c1ff29bd52434c2820bba49\n\nThis is Nazli, my dead Nebelung- enjoy.",
            "https://preview.redd.it/6s5k55ud1e9d1.jpeg?width=4160&format=pjpg&auto=webp&s=649b85743a46a713bbabbf564bb1059cedc6843f\n\nHere's a picture of my lil baby  , Batman's the name and napping is his game.🦇",
            "Had the same issue. Here’s Kuro. She’s checking in on me after I came home drunk.\n\nhttps://preview.redd.it/sjvkbosqle9d1.jpeg?width=3024&format=pjpg&auto=webp&s=2cff890b48012b08e0cc1a8230a48d23b84ee857",
            "I left that sub for the same reason. Cat tax: meet Binx!\n\nhttps://preview.redd.it/fqg2orlbse9d1.jpeg?width=4032&format=pjpg&auto=webp&s=7577577049d035211496c0bd47fbac41da792dea"
        ]
    },
    "MildlyInteresting has been going to shit but really???": {
        "title": "MildlyInteresting has been going to shit but really???",
        "score": 93,
        "url": "https://www.reddit.com/gallery/1dqvm45",
        "content": "",
        "num_comments": 25,
        "comments": [
            "Erm please read our 300th rule erm ☝️🤓",
            "How the hell do they benefit from having all these rules",
            "https://preview.redd.it/y7v834t78f9d1.jpeg?width=750&format=pjpg&auto=webp&s=028f75f1adc0c4d536290e254af1ecaf3de67abb\n\nCommon theme these last few days it seems",
            "This picture fits nothinginteresting",
            "Reddit's autistic hatred for emojis never fails to baffle me.",
            "Why are his feet in the shape of a ducks",
            "Unhinged weirdo jannies, jesus",
            "put the dogs away 😭😭🙏",
            "Fun is not allowed, you should’ve known that",
            "aint nobody wanna see yo stinky feet on their timeline"
        ]
    },
    "JU from GenX. After debate debacles I can’t take this anymore.": {
        "title": "JU from GenX. After debate debacles I can’t take this anymore.",
        "score": 57,
        "url": "https://i.redd.it/i7r5zso9be9d1.jpeg",
        "content": "",
        "num_comments": 23,
        "comments": [
            "https://preview.redd.it/h5wukpcslf9d1.png?width=720&format=pjpg&auto=webp&s=df6b25205c23bed44e344c782f44dab5508f2778",
            "Choose the one you dislike the least.",
            "I mean, they have a point",
            "I have nothing to contribute to the discussion, sooo\n\nhttps://preview.redd.it/y4s2p9l9me9d1.jpeg?width=683&format=pjpg&auto=webp&s=9231fe70b00e9f7e0b795d54e44301b4c5508fb3",
            "Vote for a third party, it’s the only way to end this madness.  Even if they’re monumentally bad, at least the Dems and Reps will learn we’re sick of this BS.\n\nLike at this point if a dog were running, I would vote for President Bingo in a heartbeat over either option.",
            "So…we’re voting Steve Harvey?",
            "I am like this close from leaving genz for the same reason",
            "RFK just keeps looking better every day.",
            "- All posts must be manually approved, so your post will take some time to go public. Wait until a moderator manually approves it.  \n\n- If several hours have passed and your post is still pending, you can [contact modmail](https://www.reddit.com/message/compose?to=r%2FJustUnsubbed) to have it approved.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JustUnsubbed) if you have any questions or concerns.*",
            "Why is this the most accurate meme ive seen on the debate?"
        ]
    },
    "just unsubbed from loveforlandchads": {
        "title": "just unsubbed from loveforlandchads",
        "score": 19,
        "url": "https://www.reddit.com/r/JustUnsubbed/comments/1dqs0rf/just_unsubbed_from_loveforlandchads/",
        "content": "thought it was hilarious at first, and like every reddit satire sub, it got pretty samey pretty fast. nothing harmful. lately, the comments have gotten like. inperceptively more genuine? like. it's obviously satire, but it felt so much more mean spirited towards actual renters. started checking profiles, and a genuine minority of posters, like, a LOT of them are actual landlords who post shit about how terrible their renters are for needing running water and shit on actual landlord subreddits. some genuine actual shitheads are co-opting the sub to spill their vile garbage, and because of how uptight the moderators are about preserving the satire calling these people out is effectively impossible. it's genuinely kind of disgusting ",
        "num_comments": 2,
        "comments": [
            "Oh yeah I totally get what you mean. You are actually kind of right.",
            "- All posts must be manually approved, so your post will take some time to go public. Wait until a moderator manually approves it.  \n\n- If several hours have passed and your post is still pending, you can [contact modmail](https://www.reddit.com/message/compose?to=r%2FJustUnsubbed) to have it approved.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JustUnsubbed) if you have any questions or concerns.*"
        ]
    }
}