{
    "Anti-loli is  bodyshaming  apparently": {
        "title": "Anti-loli is  bodyshaming  apparently",
        "score": 695,
        "url": "https://www.reddit.com/gallery/1dqtrj3",
        "content": "",
        "num_comments": 104,
        "comments": [
            "Except lolis often look like a child, have a child like voice, and BEHAVE like a child, despite being \"500 years old.\" Yet they claim it isn't pedo shit...",
            "they realize there’s more defining features of lollis that resemble children other than a flat chest right?",
            "Looking petite and young does not make someone a pedo for liking you. If you act like an actual child (with the mentality of one) then yeah it's creepy as fuck. A lot of the anime lolies that are technically legal still ACT LIKE CHILDREN! that's disgusting.",
            "I find that the weebs who compare lolis to real life short women, do not actually are about real bodyshaming ( notice  how they will never say shit when fat  women get bodyshamed. Don't get me started on their racism issues.).  They just want to defend their precious lolis",
            "I have doubts that those \"petite, flat cheated women\" are legit but even assuming they are, they're all pretty young. I think the oldest person to comment was 22 with someone who looked concerningly old to onlookers IE not a teenager or younger adult. \n\nSome small women talk about how often creeps mistake them for children and then lose interest when they find out they're adults, not all obviously but some. I have even heard the term \"legal lolis\" for girls and women who look underage but aren't. As to the Japanese actresses they often reference, they and their producers know what they're doing. The age of consent in Japan was 14 for a long time and their society is extremely sexist. \n\nThe fetishization of teen girls is hugely apparent and groping, harassing and stalking middle and high school girls is common. \n\nSo why can't they see that their actresses looking like kids is the point, not that it's representative of Japanese women in general but caters to the sick sexualisation of girlhood.\n\nI'm sure some unfortunate woman is married to a man who gets a lot of concerned looks because she looks so young but guess what? As soon as she opens her mouth and sounds like an adult, people will back off. At worst, she may need to flash ID. Most people don't usually care enough to intervene though.",
            "That one dude: “I’m 25 and I look 16.”\n\nSame dude: “people stare at me, judgementally because my girlfriend looks like she is 14.”\n\nAlso, that same dude: “my girlfriend is on the verge of being too young, but not.”",
            "Have…these people seen an actual shortstack in real life. They are short, but still have a proportions of a grownup person.[I mean, here’s an example.](https://youtu.be/QIYN6NSKxOw?si=SJAPZy_Slmz4JktA)\n\nIf character has overly large head and eyes they will read as a child.",
            "Shit like this is why other people think anime fans are weird.",
            "He forgot about his avatar lol",
            "LMFAO the \"sieg heil\" comment bc people don't condone adults being attracted to children"
        ]
    },
    "Neckbeardy? Or just desperate?": {
        "title": "Neckbeardy? Or just desperate?",
        "score": 292,
        "url": "https://i.redd.it/mnq4d40nl89d1.png",
        "content": "",
        "num_comments": 53,
        "comments": [
            "Either neck beard or else a gross hypocrite.",
            "bruhh i thought the site was fake. singleguyfromadelaide.com dude has a huge fucking page describing hinself and at the bottom some people are praising him for being vulnerable",
            "Neckbeard mixed with the obsession for a pure kindred soul.",
            "He's apparently been trying this for 8 years",
            "My bet is on Human trafficker.",
            "Chris-Chan refrences everywhere",
            "“I’m looking for an ignorant victim “ is what this means.",
            "Neck beard",
            "Oh look, Chris Chan escaped containment",
            "They later called him the \"creepy homepage killer\""
        ]
    },
    "You know, just because one thing is bad, it doesn’t make the other thing ok. ": {
        "title": "You know, just because one thing is bad, it doesn’t make the other thing ok. ",
        "score": 1216,
        "url": "https://i.redd.it/ygqdcwdoc59d1.jpeg",
        "content": "",
        "num_comments": 92,
        "comments": [
            "I like how they say streamer instead of 35 year old in the bottom one",
            "except onlyfans is an 18+ only website and children lying and stealing their parents credit cards is not at all the same as talking to those minors directly",
            "I mean, I think there's a difference between women posting sexual content on a site where minors may see it vs a grown man intentionally going out of his way to talk to a minor",
            "Why yes, Morgpie being a POS makes Dr. Disrespect innocent, that's how it works",
            "The difference is that one is an adult posting pictures of themselves and the other is an adult trying to obtain pictures of minors. I feel like that’s a pretty clear difference.",
            "The minors age in the Dr.disrespect situation was never even stated. And because of that I'm believing it's a preteen",
            "Dr disrespecting the law",
            "Do they mean attempting to lure *men*? In general? It’s not their fault horny teenagers managed to get access to an 18+ only site.",
            "\"happily steal this\" no thanks you can keep that",
            "Being on the beach leads to OF. Huh! Who knew!?"
        ]
    },
    "Brother, she's 16": {
        "title": "Brother, she's 16",
        "score": 108,
        "url": "https://i.redd.it/2fuh6lp2499d1.png",
        "content": "",
        "num_comments": 6,
        "comments": [
            "dollar store  dr disrespect looking ass",
            "Why is he smoking an invisible cigar",
            "Guy looks like a biker who only has a scooter.",
            "Oh wow, that suddenly makes it okay! It’s now like the law can ever be wrong…",
            "Assistant Tech Disrespect",
            "Assistant TO THE Tech Disrespect"
        ]
    },
    "Average Facebook Experience ": {
        "title": "Average Facebook Experience ",
        "score": 212,
        "url": "https://www.reddit.com/gallery/1dq6ua1",
        "content": "Help\n",
        "num_comments": 39,
        "comments": [
            "It's 4chan for boomers, except instead of being anonymous, your uncle gets fired.",
            "Dude fb just irritates me at this point, I got banned so many times but then they have ads and profile stories of hardcore porn. \n\nI only reported 1 thing in my life on fb, a tree full of kids hanging on nooses dead like 5or 6 of them couldn’t have been older than 8. Fb sent back how it didn’t go agains their community standards…",
            "that specific character is 12 years old. gross :(",
            "There was a community just like this. They were cool for about a year but now they're posting thirst traps and characters of VERY questionable ages. I reported them but I don't think FB is going to do anything. Ps, the mods aren't doing shit about it and I don't want any part.",
            "me saying \"bitch\" crosses the line and gets me banned for 30 days, BUT THIS????",
            "Gross especially since I'm pretty sure the character is a child",
            "I wanted to downvote this post so badly then I realized it wasn’t actually from a neckbeard, just a repost, but i’m still disappointed 😭",
            "YES AND IM OVER IT!! I’ve given up on reporting these because they always say that these ai hentai post don’t break community guidelines",
            "i spent months fb jail because of litlle edgier meme (not insulting, just edgy) but they can share this stuff.\n\nthank god I dont use socials anymore (reddiit only)",
            "Obligatory boomer not realizing comments are public"
        ]
    }
}