{
    "Thank you, JNM! Megathread": {
        "title": "Thank you, JNM! Megathread",
        "score": 0,
        "url": "https://www.reddit.com/r/JUSTNOMIL/comments/1dknr9r/thank_you_jnm_megathread/",
        "content": " Are you a lurker who has benefitted from the support and advice given to others? Tell us about that here!\n\nAre you an adult child who had to deal with a heinous cunt and has come out the other side with the support of the sub, whether through running out of fucks to give, getting in touch with your inner granite, becoming a copy editor of the information disseminated to her, or voluntarily ghosting her? We want to hear about it! \n\n^(This thread reoccurs on the 20th of each month.)",
        "num_comments": 2,
        "comments": [
            "**Quick Rule Reminders:**\n\nOP's needs come first, avoid dramamongering, respect the flair, and don't be an asshole. If your only advice is to jump straight to NC or divorce, your comment may be subject to removal at moderator discretion.\n\n[**^(Full Rules)**](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_rules) ^(|) [^(Acronym Index)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_acronym_dictionary) ^(|) [^(Flair Guide)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_post_flair_guide)^(|) [^(Report PM Trolls)](https://www.reddit.com/r/JUSTNOMIL/wiki/trolls)\n\n**Resources:** [^(In Crisis?)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_crisis_resources) ^(|) [^(Tips for Protecting Yourself)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_protecting_yourself) ^(|) [^(Our Book List)](https://www.reddit.com/r/JUSTNOMIL/wiki/books) ^(|) [^(Our Wiki)](https://www.reddit.com/r/JUSTNOMIL/wiki/)\n\nOther posts from /u/botinlaw:\n\n\n* [BEC Megathread](/r/JUSTNOMIL/comments/1dcxwii/bec_megathread/), 1 week ago\n\n* [justYESmil Megathread](/r/JUSTNOMIL/comments/1d5y0fm/justyesmil_megathread/), 2 weeks ago\n\n* [Thank you, JNM! Megathread](/r/JUSTNOMIL/comments/1cwrppv/thank_you_jnm_megathread/), 1 month ago\n\n* [BEC Megathread](/r/JUSTNOMIL/comments/1cp1gmy/bec_megathread/), 1 month ago\n\n* [justYESmil Megathread](/r/JUSTNOMIL/comments/1chyloo/justyesmil_megathread/), 1 month ago\n\n* [Thank you, JNM! Megathread](/r/JUSTNOMIL/comments/1c91qmi/thank_you_jnm_megathread/), 2 months ago\n\n* [BEC Megathread](/r/JUSTNOMIL/comments/1c0xwti/bec_megathread/), 2 months ago\n\n* [justYESmil Megathread](/r/JUSTNOMIL/comments/1bth58c/justyesmil_megathread/), 2 months ago\n\n* [Thank you, JNM! Megathread](/r/JUSTNOMIL/comments/1bjprkb/thank_you_jnm_megathread/), 3 months ago\n\n* [BEC Megathread](/r/JUSTNOMIL/comments/1bbmew8/bec_megathread/), 3 months ago\n\n^(This user has more than 10 posts in their history. To see the rest of their posts,) [^(click here)](/u/botinlaw/submitted)\n\n\n\n*****\n\n\n\n^(To be notified as soon as botinlaw posts an update) [^click ^here.](http://www.reddit.com/message/compose/?to=botinlaw&subject=Subscribe&message=Subscribe botinlaw JUSTNOMIL) ^(|) ^(For help managing your subscriptions,) [^(click here.)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_.2Fu.2Fthejustnobot)\n*****\n\n\n\n\n*^(I am a bot, and this action was performed automatically. Please)* [*^(contact the moderators of this subreddit)*](/message/compose/?to=/r/JUSTNOMIL) *^(if you have any questions or concerns.)*",
            "This sub has helped me stop wasting my time thinking and writing about my MIL."
        ]
    },
    "Radio silence since I gave birth last week": {
        "title": "Radio silence since I gave birth last week",
        "score": 207,
        "url": "https://www.reddit.com/r/JUSTNOMIL/comments/1dqyxh6/radio_silence_since_i_gave_birth_last_week/",
        "content": "Am I thankful to not deal with her right now? Absolutely. But it’s also giving me anxiety because we KNOW she’s setting up her next victimization by waiting to see how long it takes us to invite her over. What would you do—invite her over and rip the bandaid off, or let it sit knowing she’s going to act all hurt that it took x amount of time for her to be allowed to visit? My preference is the latter. How do we not participate in this little game??",
        "num_comments": 61,
        "comments": [
            "**Quick Rule Reminders:**\n\nOP's needs come first, avoid dramamongering, respect the flair, and don't be an asshole. If your only advice is to jump straight to NC or divorce, your comment may be subject to removal at moderator discretion.\n\n[**^(Full Rules)**](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_rules) ^(|) [^(Acronym Index)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_acronym_dictionary) ^(|) [^(Flair Guide)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_post_flair_guide)^(|) [^(Report PM Trolls)](https://www.reddit.com/r/JUSTNOMIL/wiki/trolls)\n\n**Resources:** [^(In Crisis?)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_crisis_resources) ^(|) [^(Tips for Protecting Yourself)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_protecting_yourself) ^(|) [^(Our Book List)](https://www.reddit.com/r/JUSTNOMIL/wiki/books) ^(|) [^(Our Wiki)](https://www.reddit.com/r/JUSTNOMIL/wiki/)\n\nOther posts from /u/NoDevelopement:\n\n\n* [WIBTA if I forced mil to apologize before allowing her to visit postpartum? ](/r/JUSTNOMIL/comments/1d86k94/wibta_if_i_forced_mil_to_apologize_before/), 3 weeks ago\n\n* [“You never let us be grandparents!!”](/r/JUSTNOMIL/comments/1d65aih/you_never_let_us_be_grandparents/), 3 weeks ago\n\n* [Baby shower drama](/r/JUSTNOMIL/comments/1cxkk17/baby_shower_drama/), 1 month ago\n\n\n\n*****\n\n\n\n^(To be notified as soon as NoDevelopement posts an update) [^click ^here.](http://www.reddit.com/message/compose/?to=botinlaw&subject=Subscribe&message=Subscribe NoDevelopement JUSTNOMIL) ^(|) ^(For help managing your subscriptions,) [^(click here.)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_.2Fu.2Fthejustnobot)\n*****\n\n\n\n\n*^(I am a bot, and this action was performed automatically. Please)* [*^(contact the moderators of this subreddit)*](/message/compose/?to=/r/JUSTNOMIL) *^(if you have any questions or concerns.)*",
            "I don't play games like that. She can sit and stew until she decides to be a grown up and communicate like one.",
            "Don't wake the beast.\n\n\nThe silent treatment is done purposely to get you guys to contact her.\n\n\nCall her bluff and just enjoy the quiet.",
            "Wait until you’re ready for visitors then invite her.  Thank her for giving you time to adjust to your new life and not pressuring you to come visit before you were ready.  Make it so she can’t turn it against you without looking like a complete asshole.",
            "I LOVE THE SILENT TREATMENT. Keep it going, don’t break. It’s a power move to get you beg. Don’t fall for it.",
            "Enjoy the silence. Enjoy the baby. Stop letting her live rent free in your head.",
            "She’s giving you the best gift of all - silence. I know the anxiety build up is strong. When it starts to rise take a deep breath and look at your LO, exhale as you list all the great things you wish for them. Combat that anxiety with happiness and hope. \n\nWhen she does try to slink back in, maintain that level of peace. “OH MIL, you’re so dramatic - do you plan to enjoy this visit? Because if you’d rather complain we’ll schedule this for another time when you’re feeling better.” \n\nDon’t reach out to her. You just enjoy your new family unit, build up that strength. Turn your anxiety into steel. Congrats",
            "You can make a post about how wonderful everyone has been in allowing you time to bond with your baby without having to deal with demanding family members trying to visit before you’re ready.",
            "Personally I'd go for some reverse psychology. I'd tell people (but not her) that MIL is so considerate in waiting, that she understands the need for space and bonding for young parents. That way, if she starts her victim-spiel she'll come off as a complete  ass.",
            "You aren’t responsible for her feelings. Focus on your new baby and the only priority!"
        ]
    },
    "Pregnant with #2 and I refuse to let MIL make this pregnancy about herself": {
        "title": "Pregnant with #2 and I refuse to let MIL make this pregnancy about herself",
        "score": 96,
        "url": "https://www.reddit.com/r/JUSTNOMIL/comments/1dr3i9a/pregnant_with_2_and_i_refuse_to_let_mil_make_this/",
        "content": "Pregnant at 5 months PP. Had a slip up, took a Plan B, two weeks later got a positive test. I’m excited and terrified at the same time!!\n\nBeing that I’m only 5 months pp, the way MIL acted during my pregnancy with #1 is still very fresh on my mind. I feel like she truly believed my pregnancy was equally about her becoming a grandmother as it was about DH and I becoming parents. She made me feel like an incubator for “her baby” and took away from a lot of the joy. I spent quite literally every day of my pregnancy stressed out over her ridiculous and unpredictable behavior. \n\nI think we did well in regards to setting boundaries during the first pregnancy, and when MIL got to be too much I went NC. With #1 I actually didn’t have to see MIL my entire pregnancy because we live across the country, and even when she attempted to guilt me into flying 3,000 miles so she could throw a baby shower with her friends (the same friends she sits and gossips about me with) I declined. This time will be a little bit different because we will be moving about a 6 hour drive from MIL later this year. As with last time, I plan on having MIL/FIL wait 6 weeks before visiting after birth. I’m so glad we made that choice with #1. I have a post up about MIL’s visit and what a nightmare it was. \n\nThe difference with this pregnancy is that I refuse to allow MIL to take away from my joy. There are no chances to overstep and I won’t sugarcoat anything. When it comes to a shower, she’s not invited, and if she finds out and gets upset- oh well. Even if we’ll be a car ride away this time it doesn’t mean I want her around while I’m healing. I’ve already told my husband point blank “I’m not doing anything that makes me unhappy this pregnancy”. \n\n\nETA: For those that have multiple children, was your MIL’s behavior with the second pregnancy any better/worse than the first?\n",
        "num_comments": 8,
        "comments": [
            "**Quick Rule Reminders:**\n\nOP's needs come first, avoid dramamongering, respect the flair, and don't be an asshole. If your only advice is to jump straight to NC or divorce, your comment may be subject to removal at moderator discretion.\n\n[**^(Full Rules)**](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_rules) ^(|) [^(Acronym Index)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_acronym_dictionary) ^(|) [^(Flair Guide)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_post_flair_guide)^(|) [^(Report PM Trolls)](https://www.reddit.com/r/JUSTNOMIL/wiki/trolls)\n\n**Resources:** [^(In Crisis?)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_crisis_resources) ^(|) [^(Tips for Protecting Yourself)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_protecting_yourself) ^(|) [^(Our Book List)](https://www.reddit.com/r/JUSTNOMIL/wiki/books) ^(|) [^(Our Wiki)](https://www.reddit.com/r/JUSTNOMIL/wiki/)\n\nOther posts from /u/LabFar6076:\n\n\n* [How did you let go of the resentment towards your MIL?](/r/JUSTNOMIL/comments/1dlokzi/how_did_you_let_go_of_the_resentment_towards_your/), 6 days ago\n\n* [Day 3 of MIL’s visit. My head is going to explode.](/r/JUSTNOMIL/comments/1bhk2wl/day_3_of_mils_visit_my_head_is_going_to_explode/), 3 months ago\n\n* [Back again. MIL called DH at 4am screaming because I didn’t respond to her text.](/r/JUSTNOMIL/comments/18orij4/back_again_mil_called_dh_at_4am_screaming_because/), 6 months ago\n\n* [“Why aren’t we close?”- MIL](/r/JUSTNOMIL/comments/1608qhd/why_arent_we_close_mil/), 10 months ago\n\n\n\n*****\n\n\n\n^(To be notified as soon as LabFar6076 posts an update) [^click ^here.](http://www.reddit.com/message/compose/?to=botinlaw&subject=Subscribe&message=Subscribe LabFar6076 JUSTNOMIL) ^(|) ^(For help managing your subscriptions,) [^(click here.)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_.2Fu.2Fthejustnobot)\n*****\n\n\n\n\n*^(I am a bot, and this action was performed automatically. Please)* [*^(contact the moderators of this subreddit)*](/message/compose/?to=/r/JUSTNOMIL) *^(if you have any questions or concerns.)*",
            "Tell her very late about the pregnancy and just enjoy it in silence. \n\nIf you don’t want to see her during pregnancy then just tell her over text (have hubby do it, it’s his mom):\n\n„Hi mom, we are extremely excited to announce LO #2, due in December (lie about you due month, pick one month later). We are happy to welcome you at around 6 weeks postpartum to meet baby.“\n\n„Oh sorry no visitors before the 6 week mark as per paediatricians orders.“",
            "Congratulations!  Is it worth not telling her about the pregnancy at all?  Make a birth announcement and give yourselves the gift of peace.",
            "It will be better because you know what to expect from her. Also, you have much more experience with telling her no.",
            "Congratulations! I feel like the best way to keep her out of this pregnancy is to do what you did last time -- go NC, this time right away. Let DH be the brick wall between you and her and let him handle her. No visits, no texts, no calls, no FaceTime, nada. She wants something involving LO#1, DH takes care of it. And **no visits**, especially after you move. She'll probably try to talk DH into giving her a key for \"emergencies,\" don't let him. You already know what she's going to try to do, all the better to head her nonsense off before she can even start it up again. 🙂💛",
            "I was fortunate because I had a nice mother-in-law. But what I can tell you is that even without, being as my husband was her only surviving child, and being that my husband is Hispanic, you can imagine the excitement.\n\nSo sometimes that did have to be put in check. And what I can also tell you is that with the second one for me, there was still so much excitement, but things did calm down a little.\n\nAnd I did have to put some boundaries in place with the first one, but again, overall I got along with my MIL. \n\nBut I do think our shiny spines get a little stronger after that first baby. And I think yours is definitely there. So enjoy this pregnancy. If she tries to overstep, and you happen to be at the same event, then you leave. She happens to be visiting, then you take the baby and you go to your room and lock the door.\n\nJust remove yourself from the situation. Better still, if they do want to come visit it six weeks PP, absolutely not staying at your house. And anyone that wants to know why…\n\nYou make sure she in the whole family knows that if you wanna come and visit the baby, we understand. And you tell them when they can do it. You also tell them that anyone coming to visit the baby can visit for an hour at the most and will not be staying with us in our home. You will need an Airbnb or a hotel. \n\nAnyone who tells me they want to come and help with the new baby… You are welcome to stay longer when you visit, but don’t mistake helping for holding the baby. We are going to need time to integrate a new baby along with our toddler, and having someone else just sitting and holding, the baby isn’t going to help that.\n\nSo if you’re coming to help, please be prepared to make dinner or put some laundry in or clean the bathroom or do a store run for groceries or any other thing that is actually helping our family.\n\nSet your expectations. You’ll be amazed at how many people that weeds out of “helping” you.\n\nOh, and congratulations. I had endometriosis, so I was told to have the kids as quickly as we could. I wasn’t quite as early as you, but yeah, my oldest was only nine months old when I got pregnant. And that second one was 11 months old when I got pregnant with the third.\n\nYou in for a little bit of a wild ride with those Irish twins, but enjoy it. As much as you can, even with the sleepless nights and the diapers and everyone forgetting that you have a name besides so and so’s mom, try to just enjoy it.",
            "We never left the ILs even a little bit alone with #1, and they thought birth of #2 would be their in (and I don't know how to explain this concisely, but it was sort of wordless, until it wasn't, but I knew/saw what was happening).\n\nAs with 1 we had 2 without giving them any details, but then #2 was in hospital for about a week. And they offered to bring food, and since the actually nice people in our lives were also doing that I felt I had to let ILs.\n\nAnd wouldn't you know it but they talked 1 up about how they'd be at their house tomorrow doing this and that because baby was in hospital. Nevermind \"tomorrow\" was a Saturday so DH didn't even need childcare or something while he worked. (A few other things happened and DH ended up screaming at MIL over the phone, they did not get to babysit and we did not see them again for months, just to not leave anyone hanging).\n\nSo ILs didn't go after the pregnancy/birth, they went after kid #1, just something to be aware of."
        ]
    },
    "MIL doesn’t want to be a grandma": {
        "title": "MIL doesn’t want to be a grandma",
        "score": 26,
        "url": "https://www.reddit.com/r/JUSTNOMIL/comments/1dr3npy/mil_doesnt_want_to_be_a_grandma/",
        "content": "Well I was pregnant last year and I had gotten this weird vibe from MIL noticed her personality changing became more “meaner”  but my husband had told me I was wrong. MIL actually “loves me” and I’m just being sensitive for no reason. I kinda believed him and thought maybe my hormones are making me a emotional. Well months later I ended up miscarrying and I noticed MIL seemed a lot happier all the sudden by her actions. Well now im pregnant again and my MIL actually said that she doesn’t want to be a grandma. I understand 52 might be young to be a grandma but shouldn’t she be excited to be a grandma? My mom is the same age as her and she’s beyond excited she thinks it’s a blessing to be called a grandma. This is insane and I feel My MIL is selfish for not wanting to be a grandma Thoughts?",
        "num_comments": 10,
        "comments": [
            "**Quick Rule Reminders:**\n\nOP's needs come first, avoid dramamongering, respect the flair, and don't be an asshole. If your only advice is to jump straight to NC or divorce, your comment may be subject to removal at moderator discretion.\n\n[**^(Full Rules)**](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_rules) ^(|) [^(Acronym Index)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_acronym_dictionary) ^(|) [^(Flair Guide)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_post_flair_guide)^(|) [^(Report PM Trolls)](https://www.reddit.com/r/JUSTNOMIL/wiki/trolls)\n\n**Resources:** [^(In Crisis?)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_crisis_resources) ^(|) [^(Tips for Protecting Yourself)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_protecting_yourself) ^(|) [^(Our Book List)](https://www.reddit.com/r/JUSTNOMIL/wiki/books) ^(|) [^(Our Wiki)](https://www.reddit.com/r/JUSTNOMIL/wiki/)\n\nWelcome to /r/JUSTNOMIL!\n\nI'm botinlaw. I help people follow your posts!\n\n\n\n*****\n\n\n\n^(To be notified as soon as Minute-Relation7115 posts an update) [^click ^here.](http://www.reddit.com/message/compose/?to=botinlaw&subject=Subscribe&message=Subscribe Minute-Relation7115 JUSTNOMIL) ^(|) ^(For help managing your subscriptions,) [^(click here.)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_.2Fu.2Fthejustnobot)\n*****\n\n\n\n\n*^(I am a bot, and this action was performed automatically. Please)* [*^(contact the moderators of this subreddit)*](/message/compose/?to=/r/JUSTNOMIL) *^(if you have any questions or concerns.)*",
            "Sounds like MIL is making your choice to be a parent more about he choice to not want to be a grandparent.  Perhaps a reminder to MIL that you and DH didn't have this baby with the sole purpose of making her a grandmother, you are having a baby so you will be parents.\n\nHer choice to not want to be a grandparent is really her loss.  Don't involve, invite or update on anything to do with your pregnancy.",
            "My brother certainly was not prepared to become a grandfather at 39 either but him and my SIL took it in stride. \n\n\n\nI would be kindly letting her live with that choice. She does not need to be involved.  She does not have to be acknowledged.  Your child can have one involved gma. Drop the rope and don't put in energy and effort where it won't be returned. \n\n\n\nMy kids loved a younger grandma. They played silly games with my mom and she had loads of energy enough to cause mischief and silliness with them.",
            "My mother in law is the same is always telling my husband & I don’t have kids I don’t want grandchildren etc where my dad wants grandchildren my mother honestly don’t know 🤷🏼 \n\nMy father in law is whole another story within itself \n\nBut 50’s is a pretty normal age to become a grandparent.",
            "When my step kids all grew up and started getting married, their mom actually forbade them from having kids right away, because she was \"too young to be a grandma.\" It would be one thing if she were kidding, but she kept repeating it at every opportunity, and so adamantly that it dawned on us that she was actually seriously assuming that she had any say in her grownass adult children's reproductive lives. \n\nWhen she declared it for the umpteenth time it took all the restraint I could muster not to remind her that if she didn't want to be a young grandma then maybe she should have thought about that before having a baby at 16. 🙄\n\n(Edited for typo)",
            "52 is a perfectly normal age to have grandchildren. \n\nShe sounds vain, or insecure, or both. \n\nShe's going to be a *grandmother* whether she likes it or not. That's not her choice. Whether she's a fantastic *grandma* is entirely up to her.",
            "We had our older two kids at 23 &24.  My husband’s mom, was 46 when our oldest was born.  She was thrilled, because she knew she would have the energy to play with and enjoy our kids.   Our youngest was born when we were 30, and my darling MIL always said that she had a much easier time keeping up at 46, than she did at 52.",
            "she is selfish. your choice to start a family is not her decision. it frankly has nothing to do with her.\n\n fwiw my mother is selfish and cruel and emotionally immature and said she didnt want to be a grandma and i went NC with her and had my son in peace and life is much lighter and happier",
            "Definitely selfish. She's probably the type to not want her grandkids to call her grandma or nana because it makes her feel old. If she's not happy, that's her problem. Don't let people make you think that your hormones are to blame. Your feelings on this are valid and totally understandable. ❤",
            "Sounds like vanity on her part. Ick."
        ]
    },
    "Nearly two decades and I'm done": {
        "title": "Nearly two decades and I'm done",
        "score": 336,
        "url": "https://www.reddit.com/r/JUSTNOMIL/comments/1dqkcbu/nearly_two_decades_and_im_done/",
        "content": "\\*Edit at the end\\*   \nThrowaway account because I can't bring myself to post under my usual account.\n\nI've asked my husband for a divorce. It all ends up coming back to his mum. His attitude, his platitudes, his unwillingness to hold her accountable, her behaviour, her influence over him, how she raised him in general. I just need to get it out there in the world. In fact, no, I want other people to read it and tell me I'm not mad for divorcing my husband. We've been together for nearly two decades. Married for nearly 13. We have 3 kids. I've been about as patient as I can be.\n\nThis will be a long one, just warning you.\n\nHis mum meddled in our relationship early on several times. Made it very clear that she didn’t like me, or want me in the family and that was made very clear from the start, but you know we persevered. When we got engaged and got married, his mum seemed very, very happy. Excited. And on our wedding day, they were over the moon, his whole family, were over the moon. I felt like I was finally being welcomed into the family. I was love bombed by his family. I realise in hindsight that essentially I was a baby making machine. They were very excited about when I was giving them grandchildren, nnd we struggled with having a few MCs and it was a lot of pressure. But eventually we had our first baby. Nearly 12 years ago. Literally from The moment she was born, she was taken away from me. By his mum, and by his mum's sisters. She has two sisters, they're all very close with each other, and my firstborn was literally taken out of my arms when she was born, I was told to just let them have her, she was their baby too. They felt entitled to her, his mum and his aunts and from day one, MY baby was a communal possession. So much so that when she was 10 days old, she was meant to be with her nana for a few hours so that we could enjoy some dinner and a pub quiz together, and I didn't get her back for over 24 hours. When she was 10 days old. At that point I was trying to establish breastfeeding and it wasn't going. I wasn't supported by anyone. In fact, the constant disruptions caused me to be unable to breastfeed, I was not able to establish any sort of breastfeeding routine with her so she was taken away from me to bottlefeed so I had no choice but stop trying to breastfeed her. She was taken away on a regular basis. She was regularly removed from my responsibility, essentially, and unwillingly at that but my husband never stood up for me. Never stood up for his baby. He would say that his mum and his aunts were doing it with the best intentions, it was for my benefit. That’s what she convinced him of. It was supposedly to allow me to recover and so on, fully ignoring the fact that every new mum needs an extended time after birth to bond with her baby. The fourth trimester, etc. Completely ignoring all the stuff that I was telling them about attachment theory, about oxytocin, about bonding that I had learnt and they didn't want to hear it. My baby was was six weeks old and I got rushed to hospital, for something unrelated to her birth. And instead of my husband taking time off to look after the baby and to look after me, he gave the baby to his mum. She had full-time care of my baby for two weeks while I was in hospital. I only got to see her for about an hour a day during visiting hours during those two weeks. It was essentially a battle to get her back when I was discharged from hospital and again, everybody was telling me that this was for my benefit and that she was only doing it out of concern for me. Essentially, I had no say in the matter and the whole time my husband never stood up for me. Never stood up for our family, he allowed his mum to dictate when I was able to have a say in raising my child or not because essentially, the message was, she knew better and that I didn't know what I was doing. Even I was hoodwinked into believing that this was the case. My husband was instrumental in damaging the bond between myself and my first born. \n\nI was pregnant with our second child when I essentially started putting my foot down and I said, “This is what's going to happen with this baby. I am going to have her I'm going to make the decisions. I'm going to Breastfeed my baby. Blah, blah, blah.” All of these things, and I established this from early on. When I started establishing this, I got a great deal of pushback from his family. In the form of abusive text messages. In the form of verbal attacks in person. At one point when I was six months pregnant, his mum burst into my house, into my living room, uninvited and started hurling abuse at me saying I was selfish saying that I had no right to dictate what my children could and couldn’t do or would and wouldn't do. If she was going to provide child care while I was at work, then she got to call the shots and she got to decide how to raise my children. And once again, he did not stand up for me, he did not tell her that this was inappropriate. He did not in any way, stand up for me or his children. Straight after this abuse he was making an extra effort to calm the waters. But not by supporting me. By supporting his family, and by telling me that \\*I\\* needed to change. His mum knew best and so on. And I was not to cause problems for his family or we would have no child care and so on. At this point he was only just starting to establish his career, I had been the breadwinner (full time teacher) for several years at that point. He said was keen for me to continue working, as was I. But essentially, he said the only way to do that was to keep his mum on side. The stress of that situation caused me to go into premature labour at 28 weeks. And I was then essentially meant to be on bed rest until baby no2's due date, but the harmful behaviours continued. I found out that his mum was trying to toilet train my daughter at 20 months against my wishes. She was also depriving her of her naps. She was giving her snacks right before I was due to give her dinner. Just anything she could possibly do to control the narrative to assert her control over my firstborn. Against my wishes and again, it was never allowed to be \"I'm her mum and I know best\" it was, \"I'm her Nana, and I know better\". I was never allowed to say otherwise. Because there was always the threat of if I don't do what she wants me to do, then she will stop looking after my firstborn while I'm at work.\n\nEventually baby no2 was born six weeks early, she was fairly premature, she was in a neonatal unit and she was very poorly. She had to have lots of treatment in the neonatal unit. We also found out that she had a dairy allergy and couldn't have formula. So I had to express, round the clock in order to feed her. But I was quite ill. I was not allowed to stay with her on the ward. I had to sleep round the clock, wake up to express every three hours which also meant that we needed childcare for our firstborn. And, MIL continued to assert control over her care. I was putting my foot down about baby no2 and she was asserting more control over no1. No2 finally came home and I was on maternity leave, so for a while it was calmer because I was able to stay at home with both children, and I was able to establish my own routines, my own parenting style and things.\n\nWhen no1 got her Autism diagnosis a switch seemed to go off and this was another catalyst for MIL to assert control. And she wanted to put various things in place, behaviourist techniques and so on that she wanted to Use in order to “help” her. By this point, I’d become quite assertive about my parenting and I was adamant that no, no one else would be parenting my children. That's my job. That's husband's job. And now this is the way that we do it. If you don't do it this way, you don't get to be in my child's life. And essentially. That's the way that we've been ever since. However, there are obviously times when we want or need childcare. There are times when they have unsupervised visits with their Nana. And that are times like Christmas and birthdays where there's prolonged contact and so on, and every single time she sees them she does something to assert control over them. And it might seem like small things to other people, but cumulatively it's very difficult for me, because I'm trying to maintain a positive relationship. And it's hard for the girls because they get really confused about why Nana says certain things and does certain things. Obviously, it must be extremely difficult for my husband who feels torn between his mum who has put him in this position and me, who he had vowed to stand by regardless. However, every single time that a conflict came up he chose to appease his family instead of me.\n\nAfter 12 Years of marriage it just got too much so last year, in the summer, I said exactly that. That was it, I couldn't take it anymore. He needed to change and he needed to do it now. He needed to start standing up for me. He needed to start standing up for his family. He needed to start showing his mum that her behaviours were inappropriate. And telling her that. This was our family and we make the decisions. We are the parents, not her and so on. But eight months after I essentially gave him an ultimatum to start standing up to his mum, come february he still hadn't done any of it. He still hadn’t addressed with he the abuse that his family singled me out for and the way that she has treated our children. He didn't respect his own family, me and the girls, enough. And so in February this year, I eventually said, you know, enough's enough. We are done. I want to separate. I can't do this anymore. He accepted the role that his mum has played in ending our relationship. But still to this day, and we've been separated for six months, still to this day he has not addressed it with his mum. He talks about the things that he's done, the part that he's played in our separation. I've said to him, quite clearly, if we were to get divorced, if we were to draw out papers for getting a divorce, I would be naming the reason for our divorce as his family, his mum, the constant abuse that I have suffered as a result and his lack of emotional support against all types of abuse from his family and that it's not just the verbal abuse and the manipulation and so on, it's the financial abuse as well.\n\nShe has abused us financially. We bought our old house for £220,000 in 2017 and I spent five years decorating renovating, overhauling the garden, all by my hands, I did all the interior design, everything and we made £85,000 profit on that house. And that allowed us to pay off most of our mortgage and we were planning on downsizing for a while, while I wasn't working (I had to give up work due to my daughter's disabilities to become a full time carer, and we had another baby just before Covid). We were planning on having a fresh start, away from our difficult neighbours that made our lives hell during lockdown and so on but instead along the way, MIL decided that she too wanted to downsize and that it would be a good idea for us to buy her house so that she could downsize. And that way, she wouldn't have to put it on the market and that way, it would save everyone a whole lot of hassle supposedly. She convinced my husband that it would be easier this way. And I admit I saw some benefits in it in the sense that it would be a familiar house for the girls and the transition would technically be a little bit easier because we could have a crossover from moving houses and not panic moving in one day.\n\nHowever, despite paying the market value, despite us saying that we needed extra time to move in gradually and so on (we planned a three-month transition) And despite this on the day that we were meant to move in, MIL still had not finished packing never mind moving her stuff. Everything was left in a horrible condition. Broken. Damaged. Sticky. Disgusting mess everywhere. It was in a horrible, horrible condition and I had to spend weeks cleaning, ripping up, removing. It was worse than I could possibly have imagined, and it made the fact that she had hoodwinked us into this so much harder, because she knew that her grandchildren were going to be living there and she still left in that state. She chose to put us in that position. We were moving into a house that was not habitable. It was not fit for purpose. It certainly wasn't fit for children. Months and months and months it took us to get into any sort of habitable condition and we spent over £30k trying to get that into just a livable condition.  During this whole process, my husband was meant to be getting his inheritance from his Gran. Around £67.5k from joint property inheritance with his sister. But in order to do that, his mum, who was in charge of the estate, had to go to the lawyers, had to get the deeds changed over. We were waiting on that money so that we could start living comfortably because that was the whole point in downsizing. We had spent all our money paying off the mortgage and moving house. We had no money left and I wasn't working. And so, his mum “lent” him half the inheritance, and this was agreed before we'd moved into her house. But we then had to use that money in order to get the house up to any sort of livable standard. So we spent that £30k on the house because of her conscious choice to leave it that way.\n\nWhen the inheritance finally came through MIL demanded that money back immediately. She had no comprehension of the fact that we had just spent £30k on her house that she had left as in that state. She demanded the loaned money back immediately. I was very upset about this. I had been to the inheritance lawyers trying to chase it up for months previously but she told the lawyer he was not allowed to talk to me. Nobody had been doing anything about it, except me, but she banned me from being involved and eventually when they did get around to doing it, the second that we got that money in, she demanded it back. But by this point, we had racked up a whole load of debt so we had to use the other £30k to pay off our debt which left us with nothing essentially. That meant that for the last two years, we have been struggling financially. I'm on benefits. Husband's salary only just pays the mortgage and the bills. We've been living very uncomfortably, despite supposedly buying her house to have an easier life. His family had been living the life of Riley. They were comfortably living off this inheritance and we have been struggling to get by.\n\nNot only that, we decided last year, when I gave him an ultimatum, we decided that we were putting our house on the market and we were going to try and get it sold. However, the problems in the house that still exist have prevented us from selling the house. I'm still living with him as a result, I can't go anywhere until the house is sold, I gave up my career for the family so I can't get my own mortgage. We have not been able to sell the house and so essentially the money that we've put into making that house livable it looks like we're not even going to be able to recoup that in a sale because the house is not marketable at that price. So essentially we have lost everything by buying that house with all the profit that we've made all the financial progress that we've made. We have lost everything by buying that house from his mum. And nobody, not one person, has acknowledged the part that she played in that. Essentially, the resentment that I feel for his family has resulted in me leaving him. It's not the only reason, but every other reason still comes back to him and the apron strings.\n\nI no longer want to be with him. I no longer want to be in a partnership with him because I feel like he is always going to choose his family over me, he is always going to take their side and he is never going to hold his mum accountable for the damage that she's done to us. I want him to get better, if he can, and that's why I went for separation instead of straight to divorce. But I don't necessarily believe that he can or will anymore. Words mean nothing to me anymore, because he keeps on saying, I'll talk to her. I'll talk to her, I'll hold her accountable. I will ask her to apologise. I will do this. I'll do that. But it's just words. It never ever amounts to anything and his mum has no idea. It is my belief that his mother is a narcissist and I believe that he is the victim of narcissistic child abuse. I believe that the reason he cannot stand up to her, and the reason that he cannot hold her accountable is because she has designed it that way.I am perpetually stuck in this abusive situation and it can't go on.\n\nYesterday was the final straw for me. This is one example of how my children have been affected, but I can't repeat all of them, I'd be here forever. This should give an indication of why I've finally snapped.\n\nMIL picked up no3 (age 4) from nursery, drove her to our house at 2.45, then made her sit in the car with no phone, no interaction, no activities, no snacks, no drinks, no fresh and no toilets, when no3 asked to go outside to go to the toilet (she'd given up asking to go inside the **unlocked** house by that point) MIL apparently told her that if she left the car she'd lock her out and she'd catch a cold in the rain. No3 then peed and pooed her pants, and cried herself to sleep in the car. No1 came home from school at 3.25 and instead of letting her go inside for her tablet which she needs to regulate after school (she's autistic), MIL put her in her car where a soiled no3 was sleeping, then made her sit in silence while she herself scrolled on her phone, again no drinks no snacks no toilet, and when no1 asked why she wasn't allowed to go into the house MIL said \"because your mum is late and I'm busy\" (just to clarify, I wasn't meant to be at home until 4.30, and I wasn't even meant to be responsible for the kids, it was husband's responsibility to have the kids after school).\n\nWhen I finally got home at 4.15, she had the cheek to ask me where I'd been and I told her I was at the pre-planned appointment with no2 at the hospital, and wasn't even due to be back for another 15 minutes, and even if it had been a normal school day, I still wouldn't have been back at that time anyway, as I travel quite a distance with no2 for her school run. I had no way of knowing that MIL would be sitting there waiting for me because she hadn't contacted me in any way. Had she contacted me I'd have told her the house was unlocked, so just to take them in for the toilet, and also that husband had specifically told her to take the girls back to \\*her\\* house because he wasn't going to be home til at least 4.30 as well.\n\nShe then left in a huff, and left me to clean up a distraught no3 and deal with no1's inevitable meltdown on my own. I then asked husband to deal with his mum as soon as he got home, this simply couldn't keep happening, the way she was treating me and the kids, and when he phoned her up he said in a jolly tone of voice \"hi mum, how are you, blah blah, yes yes the kids are fine, ok bye\"\n\nSo I've asked him for a divorce because separation isn't going to help what can't be changed, and I've had it up to here with his mum, and him for not dealing with it properly! He got really upset and left to go talk to his mum. He came back and said he was really firm with her - by this he meant he'd said that:\n\n1. He knew it was just a mistake that she'd done that to the kids (it wasn't)\n2. He didn't want to upset her (she should be upset, it's child abuse)\n3. We needed to trust anyone looking after the kids, and it couldn't happen again (it would, cos she made that choice, it wasn't an accident)\n4. He didn't mention me at all apparently, despite the fact that he should 100% have ripped her a new one for daring to blame me in front of my children for something she was actively choosing to do to them.\n\nI know I'm not in the wrong, I've had the patience of a saint putting up with her for nearly two decades, and I'm not sorry for asking for a divorce, in fact it's a relief.\n\nBut my kids are forever tied to her, and I will by proxy. I want nothing to do with her ever again. But I also know that she blatantly manipulated my children to think badly of me behind my back yesterday (and has done several times before, my 10yo middle child tells me everything and it's honestly ridiculous!) so how can I trust that his entire family isn't just going to badmouth me to my kids and put them in that horrible position of choosing sides etc.\n\nI've no qualms with husband getting 50:50 custody as long as he steps up and acts appropriately (sans apron strings) but I will never trust that he'll do this because she has raised him to be reliant on her. I'm so past done being his surrogate mother, so he'll automatically turn back to her. I just wish I could legally divorce her too!\n\nAnyway, that's my tale of MIL woe. Have at it!\n\nEdited to say - I myself was raised by a narcissistic parent and struggled to spot the signs for so long. I was the scapegoat, whereas my husband was raised as the 'golden child' in his family. Very different dynamic. So when people ask \"why have you stayed\" this might answer your question. I was raised to always think I was automatically wrong and everyone else knew better. I left home at 17 and raised myself into adulthood. I've never had a healthy relationship, my husband was the first person/partner who ever seemed kind to me. Only since having my girls have I had the confidence to stand up to my own abusers, but my husband has never chosen to prioritise this. I have never just 'let it slide' I have consistently raised these issues over and over since my children were born, but more fool me for letting him convince me he would overcome these issues. Yes I kept having children with him because yes I loved him and yes he is a good person in every other way.",
        "num_comments": 104,
        "comments": [
            "**Quick Rule Reminders:**\n\nOP's needs come first, avoid dramamongering, respect the flair, and don't be an asshole. If your only advice is to jump straight to NC or divorce, your comment may be subject to removal at moderator discretion.\n\n[**^(Full Rules)**](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_rules) ^(|) [^(Acronym Index)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_acronym_dictionary) ^(|) [^(Flair Guide)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_post_flair_guide)^(|) [^(Report PM Trolls)](https://www.reddit.com/r/JUSTNOMIL/wiki/trolls)\n\n**Resources:** [^(In Crisis?)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_crisis_resources) ^(|) [^(Tips for Protecting Yourself)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_protecting_yourself) ^(|) [^(Our Book List)](https://www.reddit.com/r/JUSTNOMIL/wiki/books) ^(|) [^(Our Wiki)](https://www.reddit.com/r/JUSTNOMIL/wiki/)\n\nWelcome to /r/JUSTNOMIL!\n\nI'm botinlaw. I help people follow your posts!\n\n\n\n*****\n\n\n\n^(To be notified as soon as Feisty-Mood-796 posts an update) [^click ^here.](http://www.reddit.com/message/compose/?to=botinlaw&subject=Subscribe&message=Subscribe Feisty-Mood-796 JUSTNOMIL) ^(|) ^(For help managing your subscriptions,) [^(click here.)](https://www.reddit.com/r/JUSTNOMIL/wiki/index#wiki_.2Fu.2Fthejustnobot)\n*****\n\n\n\n\n*^(I am a bot, and this action was performed automatically. Please)* [*^(contact the moderators of this subreddit)*](/message/compose/?to=/r/JUSTNOMIL) *^(if you have any questions or concerns.)*",
            "You need to tell the courts what she did to your children just so she could spite you. She should never be alone with them again, and you should get right of first refusal because your husband is too scared of her to keep his kids safe and away from her . Good luck ",
            "Divorce him. Absolutely. But please please find a way to ensure your kids are NEVER under her care again. This isn't a  mean grandma. You are describing abuse. I don't know how it works in the UK, but can you ask for right of first refusal? Or ensure the court hears about these incidents? Id start documenting everything.",
            "As the daughter of a mum who was married to someone like your husband and with grandparents like your MIL - you are not crazy for wanting a divorce. My fathers decision to choose his mother over us time and time again destroyed us financially and emotionally. Getting a divorce was the best thing my mum did for herself and us children.",
            "The fact your 10 day old baby was taken from you for a full day infuriates me. Your MIL is the worst kind and you’re not wrong at all for divorce. I would fight for full custody because it seems like your husband is an enabler of abuse and while continue to let your mil abuse your children. I wish you all the luck.",
            "Is it possible to bring up the abuse when working out custody? Like she can’t have unsupervised visits, needs to be a court ordered counselor present?",
            "This is horrific, in the UK your husband and his mother could be prosecuted for coercive control as well as financial and emotional abuse. When you go to a solicitor have a timeline of everything that they have both put you and your children through. When child custody is being decided it needs to be made clear that his mother is not a safe person to be allowed unsupervised access and that your soon to be ex-husband can not be trusted as the supervising person, nor can he be trusted to keep the children away from her.",
            "OP, some have touched on this and I hope you heard them but I have to join my voice to theirs. \n\nDo not let your husband have 50-50 without it being painfully and legally clear that his mother cannot be a caretaker to your girls. Possibly a restraining order\n\nThat man, even though you love him, has been subject to this for too long and now that you will hopefully be able to leave (I wish you the best of luck on the house), he won’t have a reasonable voice in his ear even trying to hold it back. You are now gonna be made the opponent and evil, he won’t listen to you, revert back to complete mamasboy and hand over your girls on a platter for his mother. You have been separated but not in the practical and physical way, so you might be lulled into ”hey he’s been reasonable so far” and relax. Do not relax. \n\nShe is spiteful, manipulative and pure evil, probably a narcissist so she will take this very personally and be vindictive when things start falling into place. Protect yourself and your girls as much as you can. I know money is incredibly tight and shit can’t get shittier, but if you don’t limit this womans influence on your life it will get worse and you won’t be able to climb out. Dig in, get angry and create an exitplan so she can fuck right off. \n\nI am in no way judging you for staying too long, I get it, these abusers are excellent at making you stay, and with that I mean MIL. Your husband was the bait and your MIL the rusty hook. Especially with kids that young and with autism it’s easy to get distracted. Give yourself grace and know you’re doing the right thing and your best. \n\nBut for the love of your daughters, get that woman away from them and your bank-account.",
            "As a divorced father of 2 who doesn't have any of the problems you do, all I can say is that your STBXH is an ass.  His #1 job **in life** is to take care of and protect his kids, and if I'm totally honest from my perspective he's an **absolute failure**.  His mother has been abusing his children since the day they were born, continues to do so, and he sees nothing wrong with it.  Now, I get that he's been programmed his entire life to believe his mother can do no wrong, but that doesn't change the fact that he still allows it without question.  Whatever custody you agree to with him, make sure you get right of first refusal so that if he is unable to take care of the kids, he has to ask you if you want to **before** is is able to just hand them off to his mother.  Because it's abundantly clear that she should not be allowed to watch your kids and he won't do anything against her even when she does things that harm them.  I'm sorry that you don't have the husband you deserved, and even sorrier that your kids don't have the father that they deserve.  Hopefully you divorcing him will force him to take a hard look at himself and fix his rectal-cranial inversion, but given how long it's been going on I can't say I'm too hopeful.  Good luck!",
            "She is literally abusing the children, report it to an authority if you can so by the time the custody battle begins it's on record somewhere. Go for 100%, your spineless ex is not a safe person because he is totally gonna give Gma the caregivers role. \nUgh, I'm so sorry they're all such trash people."
        ]
    }
}