{
    "The shooter who killed five people and injured 19 others at an LGBTQ+ club in Colorado Springs has pleaded guilty to federal hate crimes and was sentenced to 55 life terms in prison.": {
        "title": "The shooter who killed five people and injured 19 others at an LGBTQ+ club in Colorado Springs has pleaded guilty to federal hate crimes and was sentenced to 55 life terms in prison.",
        "score": 2075,
        "url": "https://www.nbcnews.com/news/us-news/shooter-killed-colorado-lgbtq-club-pleads-guilty-federal-hate-crimes-rcna157848",
        "content": "",
        "num_comments": 69,
        "comments": [
            "Please remember to abide by the [rules.](https://www.reddit.com/r/JusticeServed/wiki/rulesv2)     \n\nIn general, please be at least bearable to other users. It makes things easier on everyone. Your comment may be removed without notification.  We used to have a notification, but now we don't. \n\n\n\n\n------\n\n^Submission ^By: ^/u/nbcnews ^Black ^8      \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JusticeServed) if you have any questions or concerns.*",
            "I do believe that the shooter was the one who got stomped in the face with high heels before the police took him into custody.",
            "This guy has some serious mental issues. I'm assuming he'll most likely spend the rest of his life in a SuperMax.",
            "Oh this is the one where everyone rocked his shit before handing the pos over. Good riddance.",
            "Best I could offer is a firing squad and a dumpster behind the nearest McDonald's. Worthless sub human waste.",
            "![gif](giphy|J8FZIm9VoBU6Q)",
            "He's 24 and will now be in prison for the rest of his miserable life for acting on something that was not a threat to him nor was any of his business. What a fool.",
            "Firing squad only costs a few dollars",
            "Serious question: I'm not against the death penalty but also think that there should be very extreme circumstances that would lead to it. \n\n55 life terms in prison mean we as a society believe he should never return to it, so why should we all have to support his meals, health insurance, and amenities in prison from now until his death when he will never pay into that system again? \n\nWe see no potential for rehabilitation. \nPrison sentences have obviously not been a deterrence.\nHe will pay no feasible restitution given he'll never make the billions of punative damages he would come to owe (see Alex Jones)\n\nWould this not seem like we've all agreed he and we would be better off with him not existing?",
            "How does it take over a year to convict someone for multiple murders?"
        ]
    },
    "Steve Bannon must report to prison by Monday after Supreme Court rejects last-minute appeal": {
        "title": "Steve Bannon must report to prison by Monday after Supreme Court rejects last-minute appeal",
        "score": 2638,
        "url": "https://www.nbcnews.com/politics/supreme-court/steve-bannon-must-report-prison-monday-supreme-court-rejects-last-minu-rcna158584",
        "content": "",
        "num_comments": 88,
        "comments": [
            "Please remember to abide by the [rules.](https://www.reddit.com/r/JusticeServed/wiki/rulesv2)     \n\nIn general, please be at least bearable to other users. It makes things easier on everyone. Your comment may be removed without notification.  We used to have a notification, but now we don't. \n\n\n\n\n------\n\n^Submission ^By: ^/u/NewSlinger ^Purple ^5      \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JusticeServed) if you have any questions or concerns.*",
            "That guy is so greasy he’ll try to slip through the bars",
            "And if he doesn't, what will happen?",
            "They will need to de-louse this disgusting pig twice and blast him with a fire house. He will likely get busy immediately making toilet bowl hooch to feed his alcoholic habits.",
            "Four months isn't long enough",
            "Bannon could give people herpes just walking by them",
            "Fucking A",
            "What will we be drinking in celebration on Monday?  Any chance someone \"Epsteins\" him.",
            "I must say:\n\nHaha!",
            "/r/upliftingnews"
        ]
    },
    "'Shield Grampy' sentenced to prison by judge handling Trump's Jan. 6 case": {
        "title": "'Shield Grampy' sentenced to prison by judge handling Trump's Jan. 6 case",
        "score": 440,
        "url": "https://www.nbcnews.com/politics/politics-news/shield-grampy-sentenced-prison-judge-trumps-jan-6-case-rcna159328",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Please remember to abide by the [rules.](https://www.reddit.com/r/JusticeServed/wiki/rulesv2)     \n\nIn general, please be at least bearable to other users. It makes things easier on everyone. Your comment may be removed without notification.  We used to have a notification, but now we don't. \n\n\n\n\n------\n\n^Submission ^By: ^/u/ggroverggiraffe ^Pink ^A      \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JusticeServed) if you have any questions or concerns.*",
            "God help us if Trump wins again. Fuck",
            "> \"I hated Obama and hated his politics but still considered him my president because he won honestly but Biden and future president within a year commiemia never!!!\" he wrote, an apparent reference to Vice President Kamala Harris. \"My Trump flag [will] fly high and proud in my front yard till 1/20/2025.\"\n\nBuddy, the only yard you'll have access to come January won't have any flags flying except Old Glory.",
            ">In the nearly 3½ years since the Capitol attack, federal prosecutors have charged more than 1,400 people and secured convictions against over 1,000 defendants. More than 540 of those defendants have been sentenced to periods of incarceration from a few days behind bars to 22 years in federal prison \n\nThese people deserve what they're getting for blindly believing trump's evil lies and propaganda. At what age do normal people start thinking for themselves? And where is their messiah? He doesn't give a single fuck about any of these rubes, only about himself. The only reason he's running for prez is to save his criminal ass from prison.",
            "Jan 6 invading clowns 🤡 , the CULT 🤡and Trump 🤡are traitors …\nTRAITORS!",
            "If Trump loses, there's no repeat of this after this many have faced these consequences.",
            "So on 1/20/25 he will finally fly a Biden flag?",
            "And maybe a basketball hoop to boot",
            "👏👏👏",
            "If he wins, I won't be surprised if there's a lot of pardoning going on..."
        ]
    },
    "4 Missouri prison guards charged with murder, 5th with manslaughter, in death of Black man": {
        "title": "4 Missouri prison guards charged with murder, 5th with manslaughter, in death of Black man",
        "score": 52,
        "url": "https://www.nbcnews.com/news/us-news/4-missouri-prison-guards-charged-murder-5th-manslaughter-death-black-m-rcna159556",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Please remember to abide by the [rules.](https://www.reddit.com/r/JusticeServed/wiki/rulesv2)     \n\nIn general, please be at least bearable to other users. It makes things easier on everyone. Your comment may be removed without notification.  We used to have a notification, but now we don't. \n\n\n\n\n------\n\n^Submission ^By: ^/u/nbcnews ^Black ^8      \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JusticeServed) if you have any questions or concerns.*"
        ]
    },
    "A Florida mother has been sentenced to 21 life terms in prison plus 800 years after being convicted of \"evil and horrific\" sex crimes against her children.": {
        "title": "A Florida mother has been sentenced to 21 life terms in prison plus 800 years after being convicted of \"evil and horrific\" sex crimes against her children.",
        "score": 1350,
        "url": "https://www.youtube.com/watch?v=_OO_shzDJbc",
        "content": "",
        "num_comments": 87,
        "comments": [
            "Please remember to abide by the [rules.](https://www.reddit.com/r/JusticeServed/wiki/rulesv2)     \n\nIn general, please be at least bearable to other users. It makes things easier on everyone. Your comment may be removed without notification.  We used to have a notification, but now we don't. \n\n\n\n\n------\n\n^Submission ^By: ^/u/No_Carpenter4087 ^Blue ^4      \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JusticeServed) if you have any questions or concerns.*",
            "This is the type of sentencing we rarely see in producers of CSAM. If only the folks buying this material from her got the same level of sentencing…but they won’t.",
            "One and three years old.  And some videos involved the family dog.  Videos she sold for $5-50.  $5 to sexually abuse your toddler and infant.\n\nI hope those kids get the therapy they need.",
            "Next get the consumers. Society doesn’t need them.",
            "“The one year old is hopefully too young to ever know what they went through.”\n\nThe body keeps the score. That child might not have any distinct memories of what happened, but the feeling of being unsafe and unloved around your caretaker is ingrained in their subconscious from their earliest moments of life. They will grow up with an unhealthy attachment style and not know why. I hope they do learn what happened so they can actually process it when they’re older.",
            "Two words: HOLY SHIT",
            "Put her down like the animal she is and be done with it",
            "…We sure we don’t want to bring back death by firing squad?",
            "I think this is truly the worst thing I've heard. My heart breaks for those poor children. She needs to be launched into the sun.",
            "I wish my country had punishments like this.\n\nJust this week a woman was convicted to 18 years jail, eligible for parole after 6, for murder of her three children in cold blood. She used cable ties to bound them and cable tied their necks, asphyxiating them. The justice system in New Zealand is a joke."
        ]
    }
}