{
    "Kamen Rider Outsiders ep.5 Goddess of Genesis and the Third Singularity - Discussion Thread": {
        "title": "Kamen Rider Outsiders ep.5 Goddess of Genesis and the Third Singularity - Discussion Thread",
        "score": 27,
        "url": "https://www.reddit.com/r/KamenRider/comments/1dejn1d/kamen_rider_outsiders_ep5_goddess_of_genesis_and/",
        "content": "This thread is for discussion about the special.\n\n--\n\nPlease keep your thoughts on the special in the discussion thread! Any discussions made outside of this thread will be removed at the discretion of the mods if the discussion could've just been made in this thread and doesn't need it own thread.\n\n**Proceed at your own risk:** Spoilers for this special do not need to be tagged inside this thread.\n\nStreaming links are **prohibited**.\n\n___\n\n*With the entire human race now under the mercy of a rogue AI bent on cleansing the world of malice by turning an already Deadly Game into a humanity self-destruction game where players are tricked to be killed by the villains. Tsumuri, the former navigator of the Desire Grand Prix seeks out Kuroto Dan to bestow him the power of Creation, in order to prevent more innocent people from being needlessly sacrificed to further Zein's forced utopia.*\n\n*Unfortunately for the Game Master himself, Zein proved to be invincible to deal with. However, all hope is not lost when a mysterious Kamen Rider appeared and stood before Kamen Rider Zein — Kamen Rider Zero-Three. This mysterious Rider's identity remains a mystery, but one surrounding question regarding this new Rider: is he a friend or a foe?*\n___\n\n||TITLE|RELEASE DATE|SCREENPLAY BY|DIRECTED BY|\n|:-|:-|:-|:-|:-|\n||ep.5 Goddess of Genesis and the Third Singularity|May 12, 2024|Yuya Takahashi|Takayuki Shibasaki|\n\n___\n\nPrevious Discussion Threads:\n\n**Geats Extra: Kamen Rider Gazer:** https://redd.it/1c00h95\n\n**Kamen Rider Geats: Jyamato Awaking:** https://redd.it/1c00grb\n\n**Kamen Rider the Winter Movie: Gotchard & Geats Strongest Chemy ★ Gotcha Great Operation:** https://redd.it/1cnf3iq",
        "num_comments": 28,
        "comments": [
            "Due to Evol losing Evol trigger in Build, Evol X might not be stronger than Phase 4 despite having new look. Unless he searches for Blood tribe in this universe and steals their power...",
            "IS this finally subbed? Because I haven't been able to find this episode subbed anywhere",
            "I hope Kamen Rider Evil join the Outsider Series. And what happened to George Karizaki's character i thought he is gonna be a main character like Horobi.\n\n\nAnd i hope the Outsiders can get a full length movie or even just a 40-50 minutes finale",
            "Dan Kuroto does it again, getting himself killed for his ulterior motives",
            "The word \"death\" doesn't exist in the dictionary of Kuroto Dan. He just keeps coming back. Also, this was the first time he renounced his godhood. I'm guessing he gets it back after he revives as human, lol.\n\n  \nAdmitedally I'm an idiot but I think Zero-Three really represents a true Kamen Rider. They are not entirely good or entirely evil. Zein which was meant to be the culmination of main Riders is just as evil as the foes they fight, to which Zero-Three (combination of There and Ark) serve as an answer.\n\n  \nI wonder what they'll do with Evolto (or I guess Evol-X).",
            "So with zero three just being able to copy tsumiris potential ability of godhood\n\nOne of the strongest riders that isn’t just a hodgepodge of other riders (decade ohma zi o)",
            "https://preview.redd.it/t47ibt6bxz6d1.png?width=1600&format=pjpg&auto=webp&s=cc809c6d6774e07666edf9ebc6818ce5e4a63477\n\n\"After three deaths, he will rise again\"",
            "Now that kuroto's human again, how will even he transform now that his body is 100% human, shouldn't he be tested with the bugster virus so he could transform",
            "I’m annoyed that Hyper Fumetsu barely did anything.",
            "I just heard about this series (today) and want to avoid potential spoilers, but... what series' should I have seen before jumping into Outsiders? Thanks!"
        ]
    },
    "Kamen Rider Gotchard E41 - Discussion Thread": {
        "title": "Kamen Rider Gotchard E41 - Discussion Thread",
        "score": 38,
        "url": "https://www.reddit.com/r/KamenRider/comments/1dm8lqq/kamen_rider_gotchard_e41_discussion_thread/",
        "content": "This thread is for discussion about the episode.\n\n[E40](https://redd.it/1dgwbpv) <- **E41** -> E42\n\n--\n\nThe subreddit will be set to post-approval mode for the first 12 hours to prevent low-effort posts. Please keep your thoughts on this week's episode in the discussion thread!\n\n**Discussion about the previous episodes is permitted in the thread below, discussion about episodes after this is NOT.**\n\n**Proceed at your own risk:** Spoilers for this episode do not need to be tagged inside this thread.\n\nStreaming links are **prohibited**.\n\n--\n\n|EPISODE|TITLE|RELEASE DATE|SCREENPLAY BY|DIRECTED BY|RUN TIME|\n|:-|:-|:-|:-|:-|:-|\n|E41|神の模造品、虹の祝福！ *Trace of God, Grace of Rainbow!*|June 23, 2024|Inoue Akiko|Sakamoto Koichi|25 min|\n\n|EPISODE|RATING\n|:-:|:-:|\n|[E01](https://redd.it/168jb01)|6.24\n|[E02](https://redd.it/16enolz)|7.18\n|[E03](https://redd.it/16klo7k)|6.02\n|[E04](https://redd.it/16qjv1e)|6.28\n|[E05](https://redd.it/16wmwz6)|6.56\n|[E06](https://redd.it/172kv57)|6.32\n|[E07](https://redd.it/1782nzl)|6.30\n|[E08](https://redd.it/17dfh3y)|6.00\n|[E09](https://redd.it/17iqivv)|6.06\n|[E10](https://redd.it/17t7m6d)|6.20\n|[E11](https://redd.it/17ykjij)|6.26\n|[E12](https://redd.it/183ym35)|7.62\n|[E13](https://redd.it/189glix)|6.22\n|[E14](https://redd.it/18ervuq)|5.46\n|[E15](https://redd.it/18k5ivb)|6.19\n|[E16](https://redd.it/18pkon0)|6.36\n|[E17](https://redd.it/190eys3)|6.71\n|[E18](https://redd.it/1961zxt)|6.92\n|[E19](https://redd.it/19bpuxz)|6.51\n|[E20](https://redd.it/1acppck)|6.26\n|[E21](https://redd.it/1aia3dh)|6.09\n|[E22](https://redd.it/1anw9iv)|7.18\n|[E23](https://redd.it/1atg83w)|7.36\n|[E24](https://redd.it/1azb8d2)|7\n|[E25](https://redd.it/1b52pda)|8.24\n|[E26](https://redd.it/1bavsmi)|7.44\n|[E27](https://redd.it/1bgju3u)|9.22\n|[E28](https://redd.it/1bm6ws8)|7.5\n|[E29](https://redd.it/1brxrdl)|6.83\n|[E30](https://redd.it/1bxrhl1)|7.25\n|[E31](https://redd.it/1c3hb7y)|8.63\n|[E32](https://redd.it/1c95s5e)|7.4\n|[E33](https://redd.it/1cervij)|8.48\n|[E34](https://redd.it/1ckczny)|7.92\n|[E35](https://redd.it/1cpus0t)|8.9\n|[E36](https://redd.it/1cv9xwi)|8.8\n|[E37](https://redd.it/1d0owdi)|9.38\n|[E38](https://redd.it/1d609d0)|9.32\n|[E39](https://redd.it/1dbhtab)|9.33\n|[E40](https://redd.it/1dgwbpv)|8.33\n|**E41**|[Vote here!](https://strawpoll.ai/poll/vote/SCUERufXTTlf)",
        "num_comments": 86,
        "comments": [
            "An awesome fight scene as always (loved the songs performed by Kamen Rider Girls and they also used WHAT'S YOUR FIRE again let's goooooo).  \n  \nOn another note -- well shit, GERYON'S BACK!",
            "I do hope something comes from Spanners black flames.  A powerup would be what he needs.",
            "In other series, they either try to redeem the starting villains or just kill them outright. Love that the three sister still revelant to the end of the series with only one redeemed. \n\nHow the fuck Geryon change clothes while being eaten, lmao? That new outfit look damn good though",
            "This ep was just so charming and sweet",
            "https://preview.redd.it/nb1u6vcxlb8d1.png?width=1600&format=pjpg&auto=webp&s=2b7054b37f9b1337f4c6114dedb8535ec321df94\n\nSolBraver/Solbrain and Fire/Winspector cameos",
            "Well the Kings didn't stand a chance, but Geryon is back SO that is bad.",
            "Oh shit Geryon's back\nI'm not ready for anymore depression",
            "Geryon's drip is 🤌",
            "going into this episode, germaine was my pick to go against ichinose because of gigist and spanner, but with geryon his going against spanner since he has the most ties to geryon. so in question is ichinose dark king counter part?",
            "The fight is so awesome, but seeing that Majade and Valvarad still haven't get their final form is really jarring\n\n\nAnyways holyshit Geryon is back! What a huge bitchslap for Rinne for unintentionally helps Atroops to brings the huge golden asshole back to life"
        ]
    },
    "\"For...Love...and Peace...\" (art by @otokam1117)": {
        "title": "\"For...Love...and Peace...\" (art by @otokam1117)",
        "score": 501,
        "url": "https://i.redd.it/hqkd68p00f9d1.jpeg",
        "content": "",
        "num_comments": 42,
        "comments": [
            "Gives off 00 els qan t vibes",
            "Some rabbit: Now then. Let’s start experimenting!",
            "This looks like an epic but bittersweet alternate ending to Build where Sento defeats Evolt by overloading the genius bottle with the hazard trigger, at the cost of his own life by hazard overdose. He dies standing, and eventually his own corpse still trapped in rider form now serves as a monument in tribute to all the foreign heroes.",
            "Link: [https://x.com/i/web/status/1032980037044068353](https://x.com/i/web/status/1032980037044068353)",
            "Hears build ost",
            "Love and Peace Love and Peace Forever! Wait! This isn't Black!",
            "BE THE ONE",
            "This fits really well into Build too because half of the story began with Banjou and his girlfriend having a date at a blooming sakura tree",
            "Sento has finally won and defeated Evolto... only for Evolto to reform and holds an axe.\n\nSento struggles to move: ... Don't you... dare...\n\nEvolto laughs: Ah relax Sento! \\*his voice becomes grimmer\\* **We're about to do an experiment.**\n\nI'm glad that's not canon!",
            "Imagine if THIS was the ending for Build"
        ]
    },
    "Kamen rider Dorado and the parts it is retooled from.": {
        "title": "Kamen rider Dorado and the parts it is retooled from.",
        "score": 204,
        "url": "https://i.redd.it/awyxyu7mbe9d1.png",
        "content": "",
        "num_comments": 34,
        "comments": [
            "Okay, the scythe makes a *lot* more sense now, yea. It's just the Moon Malgam's scythe with a new case around the scythe head area to make it look more like a Rider weapon. There were people who said it was the Fighting Jackal Raider's scythe, but it didn't share any similar shapes (scythe heads were different, the \"new\" scythe had a round shaft/pole while the Fighting Jackal Raider's was a squarish one). The new case was what threw me off.",
            "REVICE NO!!!!\n\n  \nBut all in all, Dope suit.",
            "No wonder Dorado is strong if he has Evol Black Hole's Coattails. He's pose like him too!\n\nAlso RIP Grease Perfect Kingdom. Maybe we'll see it again if Build does its 10 year anniversary with a rebuild suit... and same with Evol Black Hole.",
            "My boy Germain really bit off more than he could chew and now he got his pants stolen 🥲",
            "At least it's not a complete copy of a single suit and recolour it.",
            "I guess the final tv boss will be a Kaijin wearing driver (evolt, magia, gaia driver dopant, etc) or a Dark King Kamen Rider like dorado.",
            "Evol X exists so here. the coattail's match better.\n\nhttps://preview.redd.it/y7fd1zb7af9d1.png?width=511&format=png&auto=webp&s=ec3b5f2af653d54ccc4ce7617b15f6d94eda4f84",
            "The shoulder pads look familiar too",
            "Is he Mexican?",
            "I think I found why the reasons I disliked some retool, it only happens when 1. The part they chose to reuse didn't fit the theme of the Rider and 2. The new paintjob didn't combine all the retools together cohesively into one big piece of suit it didn't even register to me it's a retool.\n\n\nAnd Dorado didn't do any of that, it's fantastic.\n\n\nP/S: Adding one new part changes everything."
        ]
    },
    "Fuuto PI ": {
        "title": "Fuuto PI ",
        "score": 28,
        "url": "https://www.reddit.com/gallery/1dr4nds",
        "content": "Such a great SHF line",
        "num_comments": 6,
        "comments": [
            "Probably one of the most fun animes to watch",
            "I already have fang joker, seeing this might make me get cyclone joker. Is this the newer version?",
            "Bro the that stuff looks cool as hell! Where’d you get it??",
            "Yup.",
            "Thanks, will try to get this version",
            "You’re welcome."
        ]
    }
}