{
    "DAILY DISCUSSION: SHITPOST SATURDAY": {
        "title": "DAILY DISCUSSION: SHITPOST SATURDAY",
        "score": 3,
        "url": "https://www.reddit.com/r/KansasCityChiefs/comments/1dlt4iv/daily_discussion_shitpost_saturday/",
        "content": "Talk about the Chiefs, football in general, or whatever else you want.\n\nJoin our [partner Discord community](https://discord.gg/ZDEdXsc) for more discussion and shitposting.",
        "num_comments": 2,
        "comments": [
            "How insane would it be if Worth actually leads the team in receiving yards this year? If he can catch on to the playbook quickly who knows. (I'm even assuming Rashee and Brown play every game)."
        ]
    },
    "Bob Harris scores the only touchdown of his career during a 1987 strike game with the Chiefs": {
        "title": "Bob Harris scores the only touchdown of his career during a 1987 strike game with the Chiefs",
        "score": 87,
        "url": "https://v.redd.it/qermynvo2z7d1",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Strike game?",
            "Scab players ruined the NFL",
            "I still have his jersey. ",
            "Someone needs to watch The Replacements",
            "And we had the worst scab team.  Ours weren't scabs, they were boils.",
            "You’re blaming the guys that just wanted to play football and get a paycheck rather than the owners who refused to pay the elite talent?",
            "You bought a scabs jersey?",
            "I was joking.  I have zero recollection of him or anyone else from those days."
        ]
    },
    "Season ticket member gift is a paper weight... again": {
        "title": "Season ticket member gift is a paper weight... again",
        "score": 109,
        "url": "https://i.redd.it/47t8w7i3sy7d1.png",
        "content": "",
        "num_comments": 74,
        "comments": [
            "https://preview.redd.it/1zvhy9s2yy7d1.png?width=583&format=png&auto=webp&s=c95baf0c502f711159c881e5d3ee80a0f9c1cbeb\n\nGiants fans getting the best one.",
            "would you rather it be a voucher for 1 free medium Pepsi?",
            "I’ll never understand the continued prevalence of paperweights",
            "Yeah, this is kind of a letdown honestly... It's cool and all, but come on. \n\n  \nThen again, we are pretty lucky to get 2x super bowl ring paper weights back to back lol",
            "Last year was our first, I thought the giant ring was pretty cool, what were season ticket member gifts like before?",
            "Meh. The gifts have gotten so lame. I remember getting a box full of shit, even after the first Super Bowl.",
            "“For the infinite paper of a paperless world”\n\n                        - Clark Hunt\n\n                                 - Michael Scott",
            "Ah yes, another cock ring for the mantle.",
            "Ok but is it typo-free?",
            "Ill take it if you dont want it"
        ]
    },
    "I Would Just Like To Say: I Was Right": {
        "title": "I Would Just Like To Say: I Was Right",
        "score": 110,
        "url": "https://i.redd.it/20d09x3mcv7d1.png",
        "content": "",
        "num_comments": 32,
        "comments": [
            "Mahomes beat Brady but Dee Ford lined up offsides",
            "Scriptwriter lazy confirmed :)",
            "I don’t think those games are really all that comparable. Mahomes struggled in the first half, but he came out and tore them a new one in the second half. Frankly he vastly out performed Brady who threw 2 picks and should have lost the game on a third.\n\nCompare that to the Ravens game, Lamar just straight up didn’t look ready for the moment. \n\nFrankly the biggest similarity between the two is that the Chiefs deserved to win.",
            "Lamar has been in the league for one less season than Mahomes. Like yeah Lamar has been hurt and hasn’t played in as many playoff games, but I don’t know if I really would call Lamar less experienced than Mahomes in anything other than super bowls…\n\nAlso the patriots were still in the midst (albeit the end) of an incredible run of winning over almost two decades. I’m not sure the hate for Mahomes and the Chiefs is even close to what it was for the Patriots. Give it another 10 years though…",
            "What were you right about? That KC would beat Baltimore?",
            "Calling Lamar Jackson less experienced is a stretch.  Sure mahomes has played more games but not by anywhere near the margin between Brady and Mahomes in 2019",
            "2019 and 2023: Ravens and 49ers were the 1 seed, Chiefs win the AFC to beat the Niners in the Super Bowl",
            "Good flex op",
            "Don't forget the roughing the QB call on Chris Jones. To me, that was the real error. I'm still fucking mad about that.",
            "Yeah. Dee ford, and the rest of the defense lost us that game, mahomes played just as good if not better than brady"
        ]
    },
    "in honor of Big Red & Co. resurrecting the deep ball this season, here’s each WR’s longest reception of ‘23 👑👑": {
        "title": "in honor of Big Red & Co. resurrecting the deep ball this season, here’s each WR’s longest reception of ‘23 👑👑",
        "score": 148,
        "url": "https://v.redd.it/0081hpvubu7d1",
        "content": "",
        "num_comments": 31,
        "comments": [
            "LMAO Worthy “deep ball” at the line",
            "How were none of these touch downs? Amazing",
            "In this boring part of the offseason where we’re all waiting for the season, I appreciate you taking the time to make this. Great quality, good work!",
            "Upvote for FPS Doug",
            "are all of our boys running with a knife, is that why they are so fast?",
            "Man, if Toney could just...have a good year...",
            "couldn’t find clips of Powell, Washington, or Remigio.. think they’re practice squad n special teams.. who y’all got first receiving TD of ‘24?",
            "Oh poor Bengals",
            "Oh yeah!",
            "Man.. I had hopes that Skyy would be a solid WR2 last year. Hoping Worthy turns up for us this year."
        ]
    }
}