{
    "What's Happening This Week of June 24, 2024": {
        "title": "What's Happening This Week of June 24, 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/kansascity/comments/1dncx7f/whats_happening_this_week_of_june_24_2024/",
        "content": "**This is the megathread for things to do this week in the Kansas City metro area.**\n\n* Share current events with the date, time, location, and relevant info/links.\n* Are you [visiting KC](https://www.reddit.com/r/kansascity/search?q=flair_name%3A%22Visiting%20KC%22&restrict_sr=1&sort=new)? Go to [VisitKC](https://www.visitkc.com/) for travel and tourism resources.\n* Check [The Pitch Calendar](https://calendar.thepitchkc.com/cal) or [The Star's City Guide](https://www.kansascity.com/kc-city-guides/things-to-do/)  for things to do.",
        "num_comments": 5,
        "comments": [
            "https://preview.redd.it/wp4elifj9j8d1.png?width=750&format=png&auto=webp&s=dda3319806fccc9f27778e3f1c128c39f6548026\n\nMeditation has been going great and wed love to have you there, very laid back opportunity to sit with others and meditate using your own practice. If your a beginner, this is a great place to start.",
            "I'm hosting a small debate-watch party at my house in Waldo on Thursday evening from 7:00 on. No politics, just snacks, drinks, and bingo cards with silly stuff on them. If you'd like to join, DM me! \n\n[https://www.reddit.com/r/kansascity/comments/1dp1mwr/debate\\_watch\\_party\\_at\\_my\\_place\\_tomorrow\\_night\\_im/](https://www.reddit.com/r/kansascity/comments/1dp1mwr/debate_watch_party_at_my_place_tomorrow_night_im/)",
            "[removed]"
        ]
    },
    "Why Thunderstorms Seem to Pass Around Large Cities (It's Not Because of Tongie)": {
        "title": "Why Thunderstorms Seem to Pass Around Large Cities (It's Not Because of Tongie)",
        "score": 19,
        "url": "https://www.cbc.ca/news/canada/saskatchewan/thunderstorms-cities-splitting-1.6543899",
        "content": "",
        "num_comments": 11,
        "comments": [
            "The Tongie Split works because of the cars we sacrifice to the Independence Ave Bridge.",
            "Or, hear me out, Tongie is magical!",
            "I have a theory that it has to do with a heat bubble created by all the excess heat from roadways, parking lots, and metal/glass buildings. These things create a temp slightly higher than the surrounding area and when storms hit the 'bubble', they are disrupted and break apart.\n\nI, of course, have no professional or scientific understanding of these things, but it sounds good to me.",
            "I had suspected this was the case.",
            "This isnt anything new, this is taught in HS level geography.",
            "No one has proven you wrong,  so you must be correct.",
            "That's what the article says",
            "Did you read the article??",
            "Feed the beast",
            "You are smart."
        ]
    },
    "What a sunset tonight. ": {
        "title": "What a sunset tonight. ",
        "score": 120,
        "url": "https://www.reddit.com/r/kansascity/comments/1dr02ux/what_a_sunset_tonight/",
        "content": "Sorry no photo, didn’t do it any justice. ",
        "num_comments": 36,
        "comments": [
            "Got some biiiiig storms rolling in!",
            "Peach/orange sky in Waldo, and the lightning bugs in the yard together was pure harmony",
            "There is a very nice Kauffman Stadium sunset shot in the Royals subreddit.",
            "It was really nice. No photo could do it justice. Made my daughter get up and have a look",
            "\nMy son commented on how the light outside looked orange so I stepped outside our apt to get a good view.",
            "Followed up by quite the thunderstorm lol",
            "Those colors were pretty epic",
            "Was hoping someone had a shot from the stadium. It was beautiful out there tonight.",
            "Looks like it might get interesting pretty soon!",
            "Did you guys have a foam party?"
        ]
    },
    "Hey I'm really sorry ": {
        "title": "Hey I'm really sorry ",
        "score": 26,
        "url": "https://www.reddit.com/r/kansascity/comments/1dr6zgy/hey_im_really_sorry/",
        "content": "I am only driving the speed limit or slower now becos of a app my insurance co wants me to use\n\nAnyway I only get the lower price if I drive speed limit or less no hard braking and I've seen I'm really pissing alot of you off by driving so \"safe\"\n\nHey I dont like it either but I'm poor believe me I feel like a real ass driving 45 thru all the downtown highways and in the fast lane sometimes becos left exit\n\nSo please try to understand I already feel awful so when you roar around me and cut over hard in front of me it really upsets me I hate knowing ppl are mad at me and I cant take time to redo my makeup every time I arrive somewhere \n\nSorry this is so long its been a rough few days getting use to being most hated on the road 😔",
        "num_comments": 49,
        "comments": [
            "You are not wrong..we are in the land of impatience and anger in this fine city",
            "i much rather deal with someone going slow than someone going so fast they almost cause a wreck.",
            "I do not have any hate in my heart for those doing this in the right lane. Its when these assholes fuck around in the left lane and block traffic that I get actually pissed",
            "Just do it in the right lane.",
            "Shitty drivers are shitty. It's not about you when they drive shitty, so don't take it personally.",
            "I have the safe drive thing thru State Farm. I save about 40%. But, I don't drive under the speed limit,and never have been advised to do so. Who is telling you to drive slow on the highway?",
            "Dont beat yourself up too bad, they also get mad when a pedestrian forces them to come to a complete stop at a stop sign. Drivers around here suck.",
            "If I find myself getting frustrated with another driver I've developed the habit of asking myself a simple question, am I getting frustrated because they're NOT breaking the law? If the answer is yes then I remind myself that, I'm the A hole here lol\n\nYou're good",
            "Hey if my insurance did that I would do that totally. Gotta do what you can to reduce costs as best as you can",
            "Why do you need to use the app"
        ]
    },
    "Lighting South KC Tonight ": {
        "title": "Lighting South KC Tonight ",
        "score": 47,
        "url": "https://www.reddit.com/gallery/1dr3j1f",
        "content": "Wow",
        "num_comments": 3,
        "comments": [
            "Cool pics. Better watermark these before kcdiscover steals them and calls them their own.",
            "Nice pictures. Makes me think of the Creation of Adam painting in the Sistine Chapel",
            "Nice pictures"
        ]
    }
}