{
    "JTBC Dramas Watched Survey (June 2024)": {
        "title": "JTBC Dramas Watched Survey (June 2024)",
        "score": 33,
        "url": "https://www.reddit.com/r/KDRAMA/comments/1dbuexb/jtbc_dramas_watched_survey_june_2024/",
        "content": "Hello everyone!\n\nIt's our last watch survey before Census season begins! \n\nOur Netflix survey closed with 1501 of you responding! Our [**tvN survey**](/r/KDRAMA/comments/1bt1m0b/tvn_dramas_watched_survey_april_2024/) and [**Disney+ survey**](/r/KDRAMA/comments/1c7pz2f/disney_dramas_watched_survey_april_2024/) are still open and slowly ticking away. \n\nOur fourth installment in the survey series is all about **JTBC Dramas** -- meaning the dramas that JTBC produced and aired originally on the Korean cable network, **JTBC** \n\nThe survey has two sections, a basic demographics section at the beginning to give some context about you as a viewer, and then then a selection of the JTBC dramas released between 2011 and 2023 organized by year of release (most recent to oldest). \n\nNot all JTBC dramas were able to be included so dramas were selected based on an evaluation of factors including viewership ratings, activity on on-air threads, accolades. If a **completed** JTBC drama you love that aired between 2011 and 2023 isn't included, don't be offended, it may be included in a future survey. Watch statistics for 2024 dramas such as **Doctor Slump** and **The Atypical Family** will be evaluated in our end of year survey. \n\nFor each drama you can rate it on a scale of 1 (Not Good At All) to 5 (Perfect) if you completed it or select options of 'Did Not Watch' or 'Dropped' depending on what is most applicable for you.\n\nWe know that people rate dramas differently, for the purposes of this survey we ask you to rate the dramas while considering all of the following aspects of the drama: (1) writing/script, (2) production quality (ie. cinematography, sound mixing), (3) acting, and (4) your enjoyment while watching the drama. \n\nIf you are currently in the midst of watching one, we ask that you either come back to edit your response (be sure to save the personalized url at the end in the submission acknowledgement page) or wait until you have finished it to take this survey.\n\n#[Survey Link](https://forms.gle/59M8KXrstaHYyXtv9)\n\n\n---\n---\n\n#**FAQ:**\n\n**Q.** Why haven't you included a plan to watch/ in progress / on hold option?\n\n**A.** For the purpose of this survey we are simply seeking to find out how many users have or have not watched them and if they have how they rated them, not whether they plan to watch them. \n\n**Q.** What do you plan to do with the data?\n\n**A.** Share the results with the community. Use it to further hype the upcoming census for those who love data.  \n\n**Q.** A part of the survey is not working for me, can you help me?\n\n**A.** Google forms can have their moments, either try again later or use a different browser. \n\n**Q.** Why isn't \\[drama\\] on the survey?\n\n**A.**  It either isn't a JTBC production or we excluded it on purpose. \n\n**Q.** When will this survey close?\n\n**A.** In around two months time. \n\n---\n---\n\nFeel free to discuss dramas in the comments but keep it spoiler free. We especially encourage sharing thoughts about how you rated certain dramas so that hopefully we can see the variance of approaches amongst us.\n\nFinally just a reminder that is for fun and not something serious. Let's not engage in fanwars, that just sucks the fun out of things and I really don't want to write another [apology statement](/r/KDRAMA/comments/sraegq/rkdrama_mod_team_officially_responds_to_anonymous/) because a ratings survey gets taken far too seriously than necessary.",
        "num_comments": 26,
        "comments": [
            "Yayy!! I new survey! I'm always excited for these surveys, they are like a moment of reflection, where I adjust my ratings and add other dramas to my plan to watch, in some cases I even pull some dramas out of the dropped list. Sometimes they deserve a second chance...\n\nSo let's put some of my numbers into perspective, next year I want to look at this and think that I actually made some effort to watch more other networks besides tvN or Netflix. 😅\n\n---\n\n**Total of dramas titles in the survey:** 60  \n**Total watched:** 20  \n**Currently watching:** 1  \n**Plan to watch until the end of August:** 6  \n**Other Plan to watch / On Hold:** 17  \n**Dropped:** 1 (Man to Man)  \n**Not on my radar:** 15\n\n---\n\nA small view of these surveys in percentage:\n\n**Netflix Survey:** total of 47 dramas, only 25 dramas watched = 53,19%  \n**tvN Survey:** total of 103 dramas, only 55 dramas watched = 53,39%  \n**Disney+ Survey:** total of 20 dramas, only 3 dramas watched = 15%  \n**JTBC Survey:** total of 60 dramas, only 21 dramas watched = 35%",
            "My top jTBC dramas are\n\n1.  **The light in your eyes**\n\n2. **Thirty nine**\n\n3. **Welcome to samdal-ri**\n\n4. **Snowdrop**\n\n5. **King the Land**\n\n6. **My ID is Gangnam beauty**\n\n7. **Reborn rich**\n\nAll very great dramas!",
            "can someone post the link to see previous responses? i closed it before noticing you can do that, but now i would have to fill it in again to get the link.",
            "My favorite JTBC dramas are:\n\nSky Castle\n\n18 Again\n\nDivorce Attorney Shin\n\nMystic Pop up Bar",
            "My Top 8 of JTBC dramas:\n\n1. My Liberation Notes (Slice-of-life, Melodrama, Romance)\n2. Sky Castle (Makjang, Thriller)\n3. Law School (Legal Thriller, Murder Mystery)\n4. 18 Again (Fantasy, Family Melodrama, Comedy, Romance)\n5. Beyond Evil (Murder Mystery, Psychological Thriller)\n6. Be Melodramatic (Slice-of-life, Comedy, Melodrama)\n7. Light in your eyes (Fantasy, Slice-of-life)\n8. Behind your Touch (Fantasy, Comedy, Murder Mystery)",
            "I've only watched Beyond Evil and Inspector Koo on this list and those two are both in my top ten! I really need to watch more JTBC! A ton of their stuff is on my watchlist xD.",
            "JTBC seems to give most of its shows to Netflix. I guess they've established a partnership?",
            "oh my! so far I have only completed 8 JTBC dramas, most were bangers tho - I gave 5 perfect ratings, and 2 are in my all time top Asian dramas watched. I did try (and drop) 7 others tho\n\nthe stat idea is nice, wish I knew about it when I was filling the previous surveys XD\n\n**Total drama titles in the survey:** 60  \n**Total completed:** 8 (13%)  \n**Currently watching:** 1  \n**Plan to watch w/ high priority:** 4  \n**Total Plan to watch:** 13 (22%)  \n**Dropped:** 7 (12%)  \n**Total dramas watched:** 15 (25%)",
            "JTBC drama that first comes to my mind is Beyond Evil. But I love other dramas such as\n\n- Solomon's Perjury\n\n- Private Life\n\n- Sketch\n\n- Sisyphus: The Myth (This one is the best sci-fi drama I've ever watched. Need another sequel)\n\n- Beautiful World\n\n  \nBoth Somon's Perjury and Beautiful World have the best high school story plot. But still, I think JTBC's dramas always has a good premise and plot. I really enjoy their dramas.",
            "**JTBC drama's I watched** (in order from oldest to newest) 19/60 = 32% \n\nCruel City / My love Eun Dong / Falling for innocence / D-Day / My wife is having an affair this week / Strong woman Do Bong Soon / Man to Man / SKY Castle / My id is Gangnam beauty / Misty / Be melodramatic / When the weather is fine / Run on / 18 again /Sisyphus: the myth / Thirty-nine / Reborn rich/ My liberation notes / King the land"
        ]
    },
    "The Midnight Romance in Hagwon [Episodes 15 & 16]": {
        "title": "The Midnight Romance in Hagwon [Episodes 15 & 16]",
        "score": 20,
        "url": "https://www.reddit.com/r/KDRAMA/comments/1dr2t1i/the_midnight_romance_in_hagwon_episodes_15_16/",
        "content": "* **Drama**: [The Midnight Romance in Hagwon](https://mydramalist.com/755679-graduation)\n   * Revised Romanization: Joleob\n   * Hangul: 졸업\n* **Director**: [Ahn Pan Seok](https://mydramalist.com/people/16037-ahn-pan-seok) (One Spring Night)\n* **Writer**: [Park Kyung Hwa](https://mydramalist.com/people/100529-park-kyung-hwa) (tvN O'PENing: Stock of High School)\n* **Network**: tvN\n* **Episodes**: 16\n   * **Duration**: 1 hour 10 min.\n* **Airing Schedule**: Saturdays and Sundays @ 9:20 PM KST\n   * **Airing Date:** May 11, 2024 - Jun 30, 2024\n* **Streaming Sources**: [Viki](https://viki.com/), [Viu](https://viu.com)\n* **Starring**:\n   * [Jung Ryeo Won](https://mydramalist.com/people/989-jung-ryeo-won) as Seo Hye Jin\n   * [Wi Ha Joon](https://mydramalist.com/people/16210-wi-ha-joon) as Lee Jun Ho\n* **Plot Synopsis:** After resigning from a big company, Lee Joon Ho returns to the academy where he'd studied, this time as an instructor. He's motivated by his lingering fixation on his first love, academy teacher Seo Hye Jin. Seo Hye Jin has been a Korean language instructor for the past fourteen years. She became a star after the legendary incident labeled “Miracle of Daechi.” Just when her life begins to feel settled, former pupil and troublemaker Lee Joon Ho, whom she'd helped get into a prestigious university ten years previously, shows up and stirs up chaos.\n* **Conduct Reminder:** We encourage our users to read the following before participating in any discussions on r/KDRAMA: (1) [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439), (2) our [Conduct Rules](https://www.reddit.com/r/KDRAMA/wiki/rules#wiki_1._conduct), (3) our [Policies](https://www.reddit.com/r/KDRAMA/wiki/policies), and (4) the [When Discussions Get Personal Post](https://www.reddit.com/r/KDRAMA/comments/jqrjx6/meta_when_discussions_get_personal/).\n   * Any users who are displaying negative conduct (including but not limited to bullying, harassment, or personal attacks) will be given a warning, repeated behavior will lead to increasing exclusions from our community. Additionally, mentions of down-voting, unpopular opinions, and the use of profanity may see your comments locked or removed without notice.\n* **Spoiler Tag Reminder:** Be mindful of others who may not have yet seen this drama, and use spoiler tags when discussing key plot developments or other important information. You can create a spoiler tag in Markdown by writing > ! this ! < without the spaces in between to get >!this!< . For more information about when and how to use spoiler tags see our [Spoiler Tag Wiki](https://www.reddit.com/r/KDRAMA/wiki/spoilertags).\n* **Previous Discussions**\n   * [\\[Episodes 1 & 2\\]](https://www.reddit.com/r/KDRAMA/comments/1cpbmmm/the_midnight_romance_in_hagwon_episodes_1_2/)\n   * [\\[Episodes 3 & 4\\]](https://www.reddit.com/r/KDRAMA/s/cFu2jKIiia)\n   * [\\[Episodes 5 & 6\\]](https://www.reddit.com/r/KDRAMA/comments/1d04j05/the_midnight_romance_in_hagwon_episodes_5_6/)\n   * [\\[Episodes 7 & 8\\]](https://www.reddit.com/r/KDRAMA/comments/1d5e32e/the_midnight_romance_in_hagwon_episodes_7_8/)\n  * [\\[Episodes 9 & 10\\]](https://www.reddit.com/r/KDRAMA/s/7WEr7Yf6nu)\n  * [\\[Episodes 11 & 12\\]](https://www.reddit.com/r/KDRAMA/s/4a7Y7UV0ZA)\n  * [\\[Episodes 13 & 14\\]](https://www.reddit.com/r/KDRAMA/s/BUGxjBMOKB)",
        "num_comments": 0,
        "comments": []
    },
    "Miss Night and Day [Episodes 5 & 6]": {
        "title": "Miss Night and Day [Episodes 5 & 6]",
        "score": 10,
        "url": "https://www.reddit.com/r/KDRAMA/comments/1dr2shs/miss_night_and_day_episodes_5_6/",
        "content": "* **Drama**: [Miss Night and Day](https://mydramalist.com/755953-she-is-different-day-and-night)\n   * Revised Romanization: Natgwa bami dareun geunyeo\n   * Hangul: 낮과 밤이 다른 그녀\n* **Director**: [Lee Hyung Min](https://mydramalist.com/people/17370-lee-hyung-min) (From Now On, Showtime!)\n* **Writer**: [Park Ji Ha](https://mydramalist.com/people/27355-park-ji-ha) (Good Casting)\n* **Network**: JTBC\n* **Episodes**: 16\n   * **Duration**: 1 hour 10 min\n* **Airing Schedule**: Saturday & Sunday @ 10:30PM - 12:00 AM (KST)\n   * **Airing Date**: June 15, 2024 - August 4, 2024, 2024\n* **Streaming Sources**: [Netflix](https://www.netflix.com)\n* **Starring**:\n   * [Jung Eun Ji](https://mydramalist.com/people/3843-jung-eun-ji) as Lee Mi Jin\n   * [Lee Jung Eun](https://mydramalist.com/people/10706-lee-jung-eun) as Im Sun\n   * [Choi Jin Hyuk](https://mydramalist.com/people/1328-choi-jin-hyuk) as Gye Ji Ung\n   * [Baek Seo Hoo](https://mydramalist.com/people/35087-yoo-han-jun) as Ko Won\n* **Plot Synopsis:** A woman who magically switches between her 20s and 50s lands an internship at the Prosecution Service, caught between two generations and a tough boss.\n* **Conduct Reminder:** We encourage our users to read the following before participating in any discussions on [r/KDRAMA](https://www.reddit.com/r/KDRAMA): (1) [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439), (2) our [Conduct Rules](https://www.reddit.com/r/KDRAMA/wiki/rules#wiki_1._conduct), (3) our [Policies](https://www.reddit.com/r/KDRAMA/wiki/policies), and (4) the [When Discussions Get Personal Post](https://www.reddit.com/r/KDRAMA/comments/jqrjx6/meta_when_discussions_get_personal/).\n   * Any users who are displaying negative conduct (including but not limited to bullying, harassment, or personal attacks) will be given a warning, repeated behavior will lead to increasing exclusions from our community. Additionally, mentions of down-voting, unpopular opinions, and the use of profanity may see your comments locked or removed without notice.\n* **Spoiler Tag Reminder:** Be mindful of others who may not have yet seen this drama, and use spoiler tags when discussing key plot developments or other important information. You can create a spoiler tag in Markdown by writing > ! this ! < without the spaces in between to get >!this!< . For more information about when and how to use spoiler tags see our [Spoiler Tag Wiki](https://www.reddit.com/r/KDRAMA/wiki/spoilertags).\n* **Previous Discussions**\n   * [\\[Episodes 1 & 2\\]](https://www.reddit.com/r/KDRAMA/s/YhPQ2CXyub)\n   * [\\[Episodes 3 & 4\\]](https://www.reddit.com/r/KDRAMA/s/WDf0Q1bWor)",
        "num_comments": 0,
        "comments": []
    },
    "Late To The Party - [2024/06/28]": {
        "title": "Late To The Party - [2024/06/28]",
        "score": 10,
        "url": "https://www.reddit.com/r/KDRAMA/comments/1dqu4v4/late_to_the_party_20240628/",
        "content": "Did you finally get the chance to see *that one* drama? Want to rant/rave about it? Do it here and see who else is late to the party like you!\n\nThis is our weekend check-in to talk about what you have been watching lately.\n\nAs you are well aware it's easy to be late to the party so **please remember to use spoiler tags when discussing major plot points**  or anything you think should be redacted. If you are using Markdown and not Fancy Pants Editor, the easiest way to create spoiler tags is to  use > ! spoiler content ! < without spaces to get >!spoiler content!<. For more detailed guidance on spoiler tags and when to use them, check our [Spoiler Tags Tutorial](/r/KDRAMA/wiki/spoilertags).\n\n\n***Just In Case Resources***\n\n[FAQ](/r/KDRAMA/wiki/kdramas_101) and [Netflix FAQ](/r/KDRAMA/wiki/kdramas_101/netflix_faqs) **|** [Glossary](/r/KDRAMA/wiki/definitions) **|** [Latest On-Airs](/r/KDRAMA/search?q=flair%3Aon-air&sort=new&restrict_sr=on&t=week) and [On-Air Roster](/r/KDRAMA/wiki/episode_discussion_roster) **|** [Rules](/r/KDRAMA/wiki/rules) and [Policies](/r/KDRAMA/wiki/policies) **|** [Where To Watch *aka* Legal Sites](/r/kdrama/wiki/wheretowatchkdramas) **|** [Everything In Our Wiki *aka* Wiki Homepage](/r/KDRAMA/wiki/index) **|** [Get Recommendations For Your Next Watch](/r/kdramarecommends/comments/hl34w7/rules_resources_and_a_guide_to_navigating/)",
        "num_comments": 26,
        "comments": [
            "Recently started a rewatch of The Heirs, this time with my 14-yo daughter in tow and she is FASCINATED by Tan/Lee Minho. I was like, \"Do you finally get why this man is a Korean national treasure??\" 😅 \n\nIt's funny because she agreed to watch it because of Park Hyungsik (she loves him) and was totally caught off guard by LMH.",
            "I recently watched **A Piece of Your Mind.**  I had been wary of this one in the past because I heard it was really slow which isn't my thing usually but I was craving Chae Soo Bin in another romance and I had enjoyed the writers previous work **On the Way to the Airport** so I rolled the dice and I loved it, I binged the whole thing in two days.\n\nAs I watched **A Piece of Your Mind** I thought repeatedly of Roger Ebert's quote about movies being \"machines that generate empathy\" because that's exactly what this show was. The two leads, who are drawn into each other's lives during a period of adversity, love each other and take care of each other in such a selfless way. The warmth and tenderness of their conversations, their easy physical intimacy (there's only one quick, chaste kiss scene in the whole drama but I didn't feel deprived because of how swoony the hugging/cuddling scenes were), and their deep compatibility with each other moved me greatly. \n\nI got emotionally invested in the supporting characters as well, particularly the landlady of the FL's boarding house and the landlady's childhood friend who is also grieving a severe loss. \n\nThis packs such a wallop emotionally and is so tender and thoughtful in how it treats its characters and relationships I was able to forgive the occasional bits of sloppy writing, like how the A.I. tech no sense if you think about it, or how >!Soon Ho was willing to betray her \"uncle\" to protect a sullen jerk she had known for 5 minutes!<  \n\nA beautiful, alternately heart wrenching and heart warming work.  Highly, highly recommended.",
            "I watched another episode of Legend of the Blue Sea last night instead of the…thing that was on tv last night in my country (iykyk). It was a very good decision, much more enjoyable to watch by many orders of magnitude.",
            "I finished **Sweet Home S1 & **S2** this week because I wanted to watch Season 3 when it comes out. I've got to agree with some people that S1 is better than S2. There were a lot of new characters in Season 2 that I could care less about and the show >!killed off some of the good characters, for example Yoon Ji Su.!< But I think there some interesting stuff introduced like >!the firefighter girl's monster child and so on.!< \n\nOverall I'd rate **Sweet Home S1** a 8/10 and S2 a 7/10.",
            "I just started Misaeng after hearing lots of good things about it. For those of you who has seen it, is it similar to My Liberation Notes? The first episode of Misaeng was frustrating as he was clearly being bullied by his stuck up workers. My blood pressure was rising. Hope the ML gets a backbone soon.",
            "I finished watching **Pinocchio** yesterday and really enjoyed it!! Ha Myeong grew on me which I was happy about. I wasn’t a fan of him in the beginning because he was so mean to In Ha but he got better. In Ha was a sweet, rough around the edges girl. Both of them >!became great reporters by the end!!!< \n\nI was worried about >!the brother’s storyline since he became a murderer but the writer made it work! I hated the fact he killed them because I thought the focus would just go into him being a murderer and absolve the wrongs of everyone who wronged their family but everyone still got what they deserved. His scenes with Ha Myeong in the jail were also sweet. He gave his little brother good advice.!<\n\nIn Ha’s Mom >!got quite the character development but I’m not mad at it. It was nice to see her right her wrongs in the end and walk way from the reporter life which I think needed to happen. She did a lot of damage the past 14 years, she has to pay for her wrong doings. As for Beom Ja’s Mom, the chairwomen, she deserves all the jail and probation time she got. She loses her cool so fast as well!< 😭\n\nThe romance is cute but I feel like the leads spend more time >!apart than together. They break up twice technically.!< it doesn’t feel like a big part of the show either though so I don’t feel either way about it I guess.\n\nOverall, I enjoyed this drama a lot!! I was way more into the reporter life than I thought I would be too lol. 9/10 from me 😁",
            "I binged through **Death's Game**. And I have to be honest, I'm kinda conflicted. \n\n\n It is a really good show, the acting was stellar (with that All Star cast not that suprising), great production, interesting plot. All the hallmarks of a great drama. But due to personal reasons I utterly despise the depiction of suicide as a sin, deserving of torture, being shameful and selfish. And that happened here a lot. Especially with Death as a character. I mean it had some really good themes and points regarding your life effecting others around you, even if you don't realize it and similiar things. But those themes did not need that depiction of suicide that IMO even ventured into guilt tripping at times. The way that the ML in the last episode >!restarted everything, by shooting himself, was also very messy and a mixed message. Suicidal ideation says hello to the ML and that action would be actually very bad for him.!< \n\n\n The end also >!was also a bit unsatisfying, because what happens now to the villain? Yes, the ML has now knowledge of happenings and people involved but that doesn't necessaryly translate into stopping him. But IMO It's a nitpick and doesn't really change the enjoyment of the drama overall!< \n\n\n All in all I'm a bit frustrated. The suicide depiction annoyed me and sometimes even made me angry, but otherwise it's a great show. So overall I would give it an easy 7.5-8/10. The cast and their acting was really just that good.",
            "Watched mister sunshine and God I was totally mind blown. \n\nIn this era where 16 episode dramas have pacing issues, I never felt bored while watching 24 episodes. \n\nAll the characters and the visuals of the drama was amazing.",
            "i finally started watching revenant and boy am i confused. if anyone has watched it already, could you please answer my questions for episodes 1-2? 😭\n\n>! why did hyunwoo’s parents go to such great lengths to hide their daughter? what exactly did she do to deserve being shut in the basement and not even having her birth registered? and why does the shaman in the flashback stab the kid to death after giving her a plate of raw meat? and who’s the dead kid that was put into the barrel and hung from the tree? if these questions are answered later in the drama, please don’t spoil. but if they’re not, let me know!! !<",
            "I watched adult trainee like two days ago, I saw a tiktok and was like wow talk about risqué in kdramas (FOR kdramas, for what they usually do) especially a kdrama that's set in high school. I actually liked it a LOT. I came to do a quick search over here, maybe I did it wrong because I couldn't find anything about it.\nI ALMOST dropped it from the first episode because seriously the way they were starting I was thinking wtf am I watching?? But went to the usual comment section I use when I watch kdramas and read the comments there and every.single.comment said this was such underrated drama, so funny, so good, so well done, pity it's so short, every comment I read was positive... Granted is not like I read more than 10, but that's usually all it takes to see if the opinions are different from each other and EVERYONE was praising it so I decided to continue. It actually was funny and I very much enjoyed it!\n\nNext on my list, warm and cozy and moonshine, idk why but I dropped those after the first episode but recently came across good critics for those so I'll resume them 😁"
        ]
    },
    "Things I Spotted This Week - [2024/06/29]": {
        "title": "Things I Spotted This Week - [2024/06/29]",
        "score": 1,
        "url": "https://www.reddit.com/r/KDRAMA/comments/1dr4fqw/things_i_spotted_this_week_20240629/",
        "content": "[Gather around](https://i.redd.it/dxmzb2nl19z61.gif) everyone and let's talk about the things you spotted this week while watching dramas! This is the place to share if you spotted any of the following:\n\n* Truck of Doom^TM and other tropes you love/hate\n\n* Easter eggs and notable references to other dramas, artwork, poems, books, etc.\n\n* Fun or interesting background details in a scene (e.g. in the set, props, clothing, background music, location, etc.)\n\n* Ramyeon, soju, fried chicken, and other foods/drinks\n\n* Puns, idioms, and other interesting tidbits about culture\n\n* [Subway](https://i.redd.it/996g9dj6ihuz.jpg), [Samsung](https://i.redd.it/zdiv0i1g9hg31.gif), [Swarovski](https://i.redd.it/a8heqqwwvpk51.png), and [other PPL](https://i.redd.it/xrbrggzelco31.gif) \n\n* A [Kim Tan Worthy Sweater^(TM)](https://i.redd.it/9ihlgspa9ep31.gif) and *more*!\n\nShare your [love](https://i.redd.it/mrf90wpk0bg31.gif) or [frustration](https://i.redd.it/6tf1x7i9h0e41.gif) or [rage](https://i.redd.it/xlxl8mfcbfg31.gif) or [annoyance](https://i.redd.it/epuuubb9tag31.gif) or [amusement](https://i.redd.it/ofcyol8nd6r31.gif) at seeing these things. You are not limited currently airing Kdramas or even Kdramas at all but please be mindful of spoilers.\n\n**Please remember to use spoiler tags when discussing major plot points or anything you think should be redacted.** If you are using Markdown and not Fancy Pants Editor, the easiest way to create spoiler tags is to use > ! spoiler content ! < without spaces to get >!spoiler content!<. For more detailed guidance on spoiler tags and when to use them, check our [Spoiler Tags Tutorial](/r/KDRAMA/wiki/spoilertags).\n\n---\n\n***Just In Case Resources***\n\n[FAQ](/r/KDRAMA/wiki/kdramas_101) and [Netflix FAQ](/r/KDRAMA/wiki/kdramas_101/netflix_faqs) **|** [Glossary](/r/KDRAMA/wiki/definitions) **|** [Latest On-Airs](/r/KDRAMA/search?q=flair%3Aon-air&sort=new&restrict_sr=on&t=month) and [On-Air Roster](/r/KDRAMA/wiki/episode_discussion_roster) **|** [Rules](/r/KDRAMA/wiki/rules) and [Policies](/r/KDRAMA/wiki/policies) **|** [Where To Watch *aka* Legal Sites](/r/kdrama/wiki/wheretowatchkdramas) **|** [Everything In Our Wiki *aka* Wiki Homepage](/r/KDRAMA/wiki/index) **|** [Get Recommendations For Your Next Watch](/r/kdramarecommends/comments/hl34w7/rules_resources_and_a_guide_to_navigating/)",
        "num_comments": 1,
        "comments": []
    }
}