{
    "Rookie Help Thread": {
        "title": "Rookie Help Thread",
        "score": 623,
        "url": "https://www.reddit.com/r/Kenshi/comments/u7mgab/rookie_help_thread/",
        "content": "Hey hey! You guys know what time it is! That's right, a new Rookie Help thread!\n\nHere's a link to the last [episode](https://www.reddit.com/r/Kenshi/comments/pera0a/rookie_help_thread/). Fun fact, if you follow all those links back to 2019 you unlock a secret cutscene of me panicking over where the time went!\n\nAs always, feel free to fire any kenshi related questions you may have our way! There's plenty of veterans flapping around in this thread as well, and if you are in the mood for it feel free to join them and lend a hand!\n\nAnd who knows, maybe you'll learn something new yourself, too!\n\nOne thing to remember! Obviously a lot of new folks are going to be here so remember to spoiler comments so they can experience the game blind just like you might have back when you were new! You can do that   > ! Like This ! <  minus the spaces! But honestly it's just built into the chat replies nowadays so you don't have to get too fancy with that- unless you like playing hackerman.\n\nThanks guys!",
        "num_comments": 4934,
        "comments": [
            "To those having difficulty fighting here are my tips:\n\n1. At super early levels (1-10 skill points) lure starving bandits and dust bandits to gate guards or bar guards and join in the fight \n2. Train toughness. Raising toughness is the best way to get stronger. When your toughness gets above ~25 you can attack large groups of vagrants. You’ll pass out, but just get back up and fight again. \n3. When taking early fights be very cautious about tending to all wounds immediately. Any leg wounds means the fight is over. You don’t want to get caught in a dangerous situation without working legs. \n\nTLDR;\nBait starving vagrants/dust bandits towards gate guards and join in\nRaise toughness. It’s the best stat. Take as many safe fights as you can early on. \nBandage wounds ASAP. Run from fights upon taking leg wounds.\n\nI got to 70 toughness and 40 martial arts by day 45 on a solo run with no mods and no save scum",
            "Melee weapons types and their uses at a glance, for rookies:\n\nSince I see so many \"we're good with katanas right now\" comments by new players - I thought I'd post some brief thoughts on weapons. If you think I'm wrong or just want to comment, I welcome your comment!\n\nShort of it: all weapons are good in the right situation. Some weapons are good in a broader set of circumstances. And a few are good in very specific situations. This is a short explainer, without going into the numbers. You can dig for those if you're interested. On that note: Crossbows are always good, and other than you can't cheese diplomatic status opponents with it, it's the strongest weapon type if you get it going. It also takes forever to play crossbow only, and even a few tanks with a line of shooters is so much faster - and more fun.\n\nMy personal melee weapon preferences, ranked. Keep in mind that lower on the list doesn't mean bad - some lower categories have one weapon in the class that would individually make my top weapons:\n\n&#x200B;\n\n1. Heavy Weapons - The Falling Sun and Plank are bonkers weapons that will punch through the maximum amount of opponents in the shortest time. The Fragment Axe is crazy too, but requires robotics enhancements to wield Edge 3 and Meitou axes to their max potential (it's not stealing if Seto takes her mom's axe, right?). Cons: Heavy and you can't wield crossbows at all with this specialization. They also have serious indoors penalties, so lure your opponents outdoors.\n2. Hackers - Hackers are extremely versatile, armor-penetrating weapons that have anti-human and anti-robot specialization in damage. You can switch to a Short-Cleaver to use crossbows in this specialization (although Edge 1-3 do not exist for it other than homemade versions, and this means there's just 1 Meitou laying around for the highest end of this neat weapon). The larger series of these weapons are all good, and the Paladin's Cross eats robot opponents while the Flesh Cleaver lets you carve up people. Cons: mediocre vs animals, and larger cleavers just pale in comparison vs Heavy Weapons in damage.\n3. Blunt - Blunt weapons clobber robots and heavy armored opponents - the most dangerous kind that are out there. The Spiked Club should be granted the third place spot by itself. Easily the most powerful weapon that you can carry as a sidearm for your crossbow, the Spiked Club has a nice combination of blunt and cut damage, and preposterous bleed damage, making it more like a blunt-heavy Hacker class weapon. The Jitte is insane as a defensive weapon indoors, making the entire large sabre line sort of obsolete if you can keep opponents inside. Heavy Jitte is comical for knocking out lightly armored opponents. Cons: weighs a lot and training this skill provides mediocre amounts of dexterity.\n4. Martial Arts - Against a single opponent, this is by far the most damaging attack type in the game, even compared to heavy weapons. Cons: time consuming to train to higher levels, the flying kick animation makes it almost impossible to even attack when you're surrounded, and you need to be very selective about heavier armor to remain effective due to martial arts penalties on a lot of armor. Sucks vs groups in general when solo due to dodge/attacking animation, especially if you're being shot at by toothpicks.\n5. Sabres - The Longsword is the reason to use this class. Longswords have a decent amount of blunt damage for a light small weapon and they have only half (-15%) the armor penetration penalty vs armored opponents that katanas do (-30%), and a vastly lower penalty against robots (-10% vs -39%), making them much more versatile as a Crossbow offhand than katanas as a cut damage choice. The large Sabres are nifty defensive weapons. Cons: if you want a defensive weapon, the Jitte from blunt is really the best there is, making the Longsword the only real keeper here. The Desert Sabre is a novelty that's good against things that aren't really all that dangerous.\n6. Polearms - More versatile in the damage they deal out than the sabres, polearms are good for killing armored opponents and animals, and the Naginata Katana is a fairly good weapon against a myriad of lightly armored humanoids that fight outdoors, from Cannibals to Fogmen, due to good reach. Polearm/Heavy Polearm are good at penetrating armor and the Polearm does a ton of blunt damage, too. Cons: big indoors penalties, and the Spiked Club sort of covers some of the Polearm/Heavy Polearm role, while leaving space for a crossbow.\n7. Katanas - Katanas are best at killing naked humanoids and training your dexterity. If something has armor, is a robot, or is an armored robot, katanas are near useless. The naked thing category is large, but it leaves out large numbers of pretty powerful opponents. The Topper is the exception - it has lower armor penetration penalty, more reach, and more blunt damage than any katana type, but like the Short-Cleaver, there's no Edge 1-3 versions that exist, just the homemade ones. And the Meitou version is in an pretty unfriendly area. Cons: robotic damage and armor penetration penalties are very large, no blunt damage other than the Topper, limiting their usefulness vs anything with metal on it.\n\nMy top 5 favorite weapons:\n\n1. Falling Sun\n2. Spiked Club\n3. Plank\n4. Paladin's Cross\n5. Longsword",
            "I feel like this is either a super obvious noob realization or just super dumb but I am starting to get the feeling that boots don’t matter at all. I already avoid samurai and plated boots because they make you slower and I hate that. Is there literally any reason to use boots that aren’t the sandals with the athletics boost?",
            "Just fired it up, spent 2 long making my character. Ran in to the wilderness, looked around, scratched my head and said to myself. Ummmmmmm I am going to starve at this rate. Now I find myself staring off in to the wilderness. on just what to do first?\n\nUpdate: Got attacked, taken as a slave, the poeple that took me got killed by what looked like pigs, I took their armour now walking to a town with bad limp.\n\nUpdate: Went to a town, got attacked on the way in and now imprissoned.\n\nUpdate: got crippled escaping. Welll I have a new character now and now a house. YAY.",
            "I just bought Kenshi and a bit overwhelmed with the learning curve.\n\nIs there a really good guide to get a noob started with a very basic vanilla build and conservative early to mid level advice, hints, objectives, etc.?\n\nIt usually takes me a while to \"grok\" games like this which appeals to me, but I don't like spinning my wheels while trying to follow the footsteps of some jaded speed running old pro's aggressive recommendations or just flailing about blind on my own.",
            "I’m training a stealth skeleton calling him the shinobot any tips what to do I’m already part of the thieves guild",
            "So Ive never gotten to the point where I’m taking on entire factions before, I want to roleplay going on a guerrilla war against the reavers with my ~15 person squad. If I just go into their territory and fight patrols, raid camps, beat people up, free slaves, etc. will it make a difference? Is all of the fighting meaningless unless I take out the leader?",
            "Is there a benefit to \"killing\" someone.  I'm like an hour in the game and saw a wounded bandit hobble pass.  They were prob attacked and she escaped.  I knocked her out and took her shoes.  She kept playing dead and I would beat her up again.  She doesn't have anything on her person and I am too weak to actually kill her.  Is there a benefit to me doing it or once they're KOd and not hostile to me, should I move on.",
            "Approaching 20 party members. We get bodied by mostly everyone but we are getting better (we are called the band of losers lol ). The only issue I have is feeding everyone is annoying because I have to put food in everyone’s inventory individually, but sometimes if I give all the food to certain characters other characters will eat the food in their inventory. So which is it? Can I keep all the food on one character or do I have to distribute it. (Also can someone give me stat rundowns of what my characters should be so that they don’t get brutalized by dust bandits)",
            "I’m reaching my first mid-game slump. my biggest bottleneck is ancient science books. my other bottleneck is that i now have around 30 recruits in my faction. i feel this size group is too big to manage, especially because some of the group is low stats, some are mid-average, and others are nearing the high 70s-80s. we have an autonomous mining outpost outside the Hub, with a crafting and research station inside the town walls. this base is productive and barebones, no walls, and my team can withstand raids. i feel it may be time to leave, but have no clue where to set up next. i like the hub because it’s central for travel. \n\nhow do i effectively manage from here? i think i should have a small squad that i control around the map to explore and trade, and leave the bulk of the group at my outpost. i guess my biggest question would be what size squad is best for exploring the world safely?"
        ]
    },
    "Kenshi Free Camera Mode, Q&A, UE5 news, new Kenshi 2 Screenshot + photo contest": {
        "title": "Kenshi Free Camera Mode, Q&A, UE5 news, new Kenshi 2 Screenshot + photo contest",
        "score": 85,
        "url": "https://store.steampowered.com/news/app/233860/view/6650200081116343821",
        "content": "",
        "num_comments": 24,
        "comments": [
            "Honestly \"its ready when its ready\" is such a vibe. \n\nWhile I really wanna know when it comes out, I say that to people all the time at work. I'm going as fast as I can stop interrupting me for stupid status updates.",
            "All aboard the hype train. As a rule i dont preorder, but would absolutely make an exception for kenshi 2.",
            "game is great but lets be honest - devs are lazy. game been developed for a long time yet it has massive jank, is missing QoL and in general feels like an early access game. I dont belive making a new game while not finishing first one is a good idea and makes me feel like they will do it again with kenshi 2.",
            "Holy shit, that fake dating sim is hilarious, and the soundtrack's actually really cool >!after the game 'crashes'!<",
            "I promised to myself to not get hyped for anything anymore, but I'm not gonna lie, that video of the moving chair, years ago, was hyping me up very good.",
            "I am hoping for more frequent and substantial updates, honestly. The Q&A was excellent, but I think that the community needs a bit more red meat thrown its way every now and again.\n\nAs it is, the relative lack of comments and discussion here suggests that the community might be losing faith or interest in what's being developed. Only 10 comments and 33 upvotes for the biggest chunk of news regarding the game in years? \n\nThe base game has been out forever, has a dedicated niche community, and is frankly awesome... but the new dev team will still need to get paid! Generating hype and maintaining it for #2 is going to be necessary, IMHO, and I'm looking forward to how they're going to do so.",
            "I hope the engine switch makes it much easier and faster to develop",
            "It's so great that they went for UE5, with that the game can last us a long long time  \nIn addition we get a good modding toolkit, the best foundation one could hope for.",
            "total content = 1 screen shot so .. not ready yet I guess lol",
            "I'm *still* happy with Kenshi 1 thanks to the nature of the game and its modding community. \n\n\"It's ready when it's ready\" is the way."
        ]
    },
    "Eat steel, flesh bags.": {
        "title": "Eat steel, flesh bags.",
        "score": 21,
        "url": "https://i.redd.it/xl3yplplmg9d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "My drunk ass clicked the image of Kronk without reading the subreddit, then read the first couple words, and instantly knew that I need to reinstall Kenshi.",
            "This is the way"
        ]
    },
    "Finally got kenshi running on android": {
        "title": "Finally got kenshi running on android",
        "score": 300,
        "url": "https://v.redd.it/rzzuael4va9d1",
        "content": "Specs: SD 8 gen 2\n\nA bit laggy but its playable",
        "num_comments": 22,
        "comments": [
            "No way this is real, how the hell did you do that",
            "Seriously? Even when I'm playing on the computer, sometimes I have to strain my eyes to see the words.",
            "I cannot lie, fans have talent with porting games over to other things.  \nSince Rimworld is on console, what about Kenshi on console?",
            "The mad man.",
            "4080ti brick with a lil screen on it i bet",
            "what a madlad, this is cool as heck",
            "Emulating PC on a mobile. How the turn tables.",
            "for anyone interested:   \nyou can run it using winlator or mobox. currently loading takes about 30 mins (probably an issue with my processor since i had to downgrade from a 8 gen 3 just to even get it to not crash) but i'm still testing different drivers to make it shorter and I'm also going to add the performance mods to see if it makes things run better.",
            "big if true",
            "can you try getting PSO on it?"
        ]
    },
    "Theory: the first empire didn't cease to exist. Their presence just disappeared from the moon of kenshi (and it's possible that they are on the main planet)": {
        "title": "Theory: the first empire didn't cease to exist. Their presence just disappeared from the moon of kenshi (and it's possible that they are on the main planet)",
        "score": 91,
        "url": "https://www.reddit.com/r/Kenshi/comments/1dqp9oe/theory_the_first_empire_didnt_cease_to_exist/",
        "content": "This theory mostly derives from the fact that they have (or had) space age technology that we don't have (such as space elevators, sentient robots, etc), they might have abandoned one of the kenshi's moons for the fact that they thought it wasn't hospitable anymore.",
        "num_comments": 30,
        "comments": [
            "Or profitable as mining operation. But in the end it dosnt matter does it? They aint coming back",
            "I like to assume that whatever war, crisis, etc, happened that forced the First Empire out of Kenshi was eventually resolved and they ultimately survived... But that they were left in a a severely reduced state. So maybe this moon was a distant outpost of theirs that they lost contact with and so everyone assumes it's a dead moon now.\n\nAnd maybe that's not all, maybe there are more abandoned outposts that've turned into civilizations (not quite as apocalyptic as Kenshi) and one is on the main planet below.\n\nThere's a mod on Steam that actually edits in a utopian planet overhead, the implication being that they're prosperous and just ignoring the suffering on Kenshi, using them as an experiment or entertainment while they get to explore the galaxy.",
            "Yeah, they could’ve just abandoned Kenshi as a lost cause.\n\nHowever, if that’s the case it seems unlikely that *no one* from the First Empire would bother exploring, studying, surveying, or investigating Kenshi in the millennia or so that passes.",
            "There are a couple of ideas I have for this. \n\n1. Space travel takes time, a lot of time. Realistically, it's possible that the Skeletons arrived first to begin preparing a civilization. Then people in some sort of stasis arrived, or it was just DNA that the Skeletons used to create humans. Maybe it's some irrelevant settlement on a backwater moon that no one cares about. The time and cost involved with just stopping by to check things out isn't worth it. Far off settlements either survive or fail based on their own merits.\n\n\n2. The Empire never ceased to exist as you say, but the ones on the planet are just watching because Kenshi is just a really long-running social experiment. \n\n\n3. The war that signaled the collapse of the First Empire was actually a conflict spanning all over the galaxy. Or at least as much as the Empire had settled. Records are lost, Kenshi is forgotten, or isolated as too barbaric. Lots of possibilities here. \n\n\n4. The moon of Kenshi was the last, desperate ploy of humanity to survive as a species, and every other vestige of human civilization is gone.",
            "Maybe there is something on Kenshi that they needed for space travel and when the apocalypse happened they were cut off from that material.",
            "Is anyone certain the first empire was native to Kenshi? Maybe they just fucked off once it stopped being worth it.",
            "Well if that’s true it makes sense there’s no contact. If they sent anybody down to deliver humanitarian aide they’d be destroyed by the average Kenshi man. Think about how powerful the people in Kenshi are physically compared to us normal humans.",
            "My theory is that the moon of kenshi was a prison colony. That the old empire used for biological experiments and weapons testing on life subjects.",
            "My mate told me if you leave the gaming running on for flat out for 5 years that an alien race arrives and enslaves everyone. Then they become a playable race.",
            "Who knows they ain't?"
        ]
    }
}