{
    "Rookie Help Thread": {
        "title": "Rookie Help Thread",
        "score": 626,
        "url": "https://www.reddit.com/r/Kenshi/comments/u7mgab/rookie_help_thread/",
        "content": "Hey hey! You guys know what time it is! That's right, a new Rookie Help thread!\n\nHere's a link to the last [episode](https://www.reddit.com/r/Kenshi/comments/pera0a/rookie_help_thread/). Fun fact, if you follow all those links back to 2019 you unlock a secret cutscene of me panicking over where the time went!\n\nAs always, feel free to fire any kenshi related questions you may have our way! There's plenty of veterans flapping around in this thread as well, and if you are in the mood for it feel free to join them and lend a hand!\n\nAnd who knows, maybe you'll learn something new yourself, too!\n\nOne thing to remember! Obviously a lot of new folks are going to be here so remember to spoiler comments so they can experience the game blind just like you might have back when you were new! You can do that   > ! Like This ! <  minus the spaces! But honestly it's just built into the chat replies nowadays so you don't have to get too fancy with that- unless you like playing hackerman.\n\nThanks guys!",
        "num_comments": 4934,
        "comments": [
            "I feel like this is either a super obvious noob realization or just super dumb but I am starting to get the feeling that boots don’t matter at all. I already avoid samurai and plated boots because they make you slower and I hate that. Is there literally any reason to use boots that aren’t the sandals with the athletics boost?",
            "I’m training a stealth skeleton calling him the shinobot any tips what to do I’m already part of the thieves guild",
            "So Ive never gotten to the point where I’m taking on entire factions before, I want to roleplay going on a guerrilla war against the reavers with my ~15 person squad. If I just go into their territory and fight patrols, raid camps, beat people up, free slaves, etc. will it make a difference? Is all of the fighting meaningless unless I take out the leader?",
            "Is there a benefit to \"killing\" someone.  I'm like an hour in the game and saw a wounded bandit hobble pass.  They were prob attacked and she escaped.  I knocked her out and took her shoes.  She kept playing dead and I would beat her up again.  She doesn't have anything on her person and I am too weak to actually kill her.  Is there a benefit to me doing it or once they're KOd and not hostile to me, should I move on.",
            "Approaching 20 party members. We get bodied by mostly everyone but we are getting better (we are called the band of losers lol ). The only issue I have is feeding everyone is annoying because I have to put food in everyone’s inventory individually, but sometimes if I give all the food to certain characters other characters will eat the food in their inventory. So which is it? Can I keep all the food on one character or do I have to distribute it. (Also can someone give me stat rundowns of what my characters should be so that they don’t get brutalized by dust bandits)",
            "I’m reaching my first mid-game slump. my biggest bottleneck is ancient science books. my other bottleneck is that i now have around 30 recruits in my faction. i feel this size group is too big to manage, especially because some of the group is low stats, some are mid-average, and others are nearing the high 70s-80s. we have an autonomous mining outpost outside the Hub, with a crafting and research station inside the town walls. this base is productive and barebones, no walls, and my team can withstand raids. i feel it may be time to leave, but have no clue where to set up next. i like the hub because it’s central for travel. \n\nhow do i effectively manage from here? i think i should have a small squad that i control around the map to explore and trade, and leave the bulk of the group at my outpost. i guess my biggest question would be what size squad is best for exploring the world safely?",
            "No question just something that happened to me, I just download the game and tried the default start, walked around and recruited a doctor, we went together through the swamp and when we were VERY close to crossing it we got attacked, some crabs killed and ate the doctor and some bandits showed up out of nowhere and KO'd me, I thought I would get up after a while and a weird green thing showed up and ATE ME, then nothing happened, I was just looking at my sword and boots for 5 minutes until I realized the game was over\n\n10/10 game so far",
            "I turned in a 2k Bounty in Squin while the jail was full and the guard dumped the prisoner in a cage I had built on the roof of my house. I seem to have the ability to pick them up and take them back to the captain to collect the bounty again. Have I unlocked American style private prisons in Kenshi?",
            "I suck at the game and will read this thread.  Found what maybe is a known exploit.  I was sad when my pack animal was killed by dust bandits but found my main char could carry a fully loaded pack animal corpse (!). As long as you don't keep it on the ground too long it won 't dissolve. (?)",
            "seriously thank you for making this thread, this game is frickin awesome but a little overwhelming so this thread helps so damn much."
        ]
    },
    "Kenshi Free Camera Mode, Q&A, UE5 news, new Kenshi 2 Screenshot + photo contest": {
        "title": "Kenshi Free Camera Mode, Q&A, UE5 news, new Kenshi 2 Screenshot + photo contest",
        "score": 83,
        "url": "https://store.steampowered.com/news/app/233860/view/6650200081116343821",
        "content": "",
        "num_comments": 24,
        "comments": [
            "Honestly \"its ready when its ready\" is such a vibe. \n\nWhile I really wanna know when it comes out, I say that to people all the time at work. I'm going as fast as I can stop interrupting me for stupid status updates.",
            "All aboard the hype train. As a rule i dont preorder, but would absolutely make an exception for kenshi 2.",
            "game is great but lets be honest - devs are lazy. game been developed for a long time yet it has massive jank, is missing QoL and in general feels like an early access game. I dont belive making a new game while not finishing first one is a good idea and makes me feel like they will do it again with kenshi 2.",
            "Holy shit, that fake dating sim is hilarious, and the soundtrack's actually really cool >!after the game 'crashes'!<",
            "I promised to myself to not get hyped for anything anymore, but I'm not gonna lie, that video of the moving chair, years ago, was hyping me up very good.",
            "I hope the engine switch makes it much easier and faster to develop",
            "It's so great that they went for UE5, with that the game can last us a long long time  \nIn addition we get a good modding toolkit, the best foundation one could hope for.",
            "total content = 1 screen shot so .. not ready yet I guess lol",
            "I'm *still* happy with Kenshi 1 thanks to the nature of the game and its modding community. \n\n\"It's ready when it's ready\" is the way.",
            "I find it's reassuring to hear. I don't want a set date, that's when bad releases often happen. I want \"It's coming out next week because it's actually finished and tested\"."
        ]
    },
    "2,000 hours in Kenshi, and maybe 1,800 spent just like this. Love it.": {
        "title": "2,000 hours in Kenshi, and maybe 1,800 spent just like this. Love it.",
        "score": 152,
        "url": "https://v.redd.it/4wszury03h9d1",
        "content": "",
        "num_comments": 36,
        "comments": [
            "I always try to do it but I can't bring myself to stick to it for more than half an hour or so. Traveling takes soooooo much time...",
            "God, I both love and hate to do this. I really hope there's more chit-chat between your squad in Kenshi 2 so you can enjoy these moments even more.",
            "After nearly 3000 hours in Kenshi, I was tipping my monitor to see if I could speed them up in that video.",
            "Yep. Can't beat a nice walk through the countryside. Late game I like to do this to invite trouble and the views you can get if you slow down and look around can really catch you by surprise.",
            "And that's what the \"Is there a mod to level/build/etc. faster\"-people don't get",
            "After a few hundred hours I installed Rekenshi and now my fastest x is 15x speed. I feel like I’ve ruined the experience for myself as my time with kenshi on 1x travelling around is so much more engaging!",
            "Any mods or shaders? Looks beautiful. That tree on the left, mine are not nearly that high detailed.",
            "Most of my games consist of me just FUCKING UP fogmen. ",
            "I wish there was a combat or healing benefit for traveling slow. Like a defence or block buff of +4/+2/-2 for walk/jog/run",
            "In my game, I’m role playing as a hermit living in the Fog Lands, a master martial artist hermit. I love the ambient sounds there, so it’s relaxing for me to just chill at my little hut and campfire, and once in awhile, murder fogmen by the ass tons."
        ]
    },
    "Eat steel, flesh bags.": {
        "title": "Eat steel, flesh bags.",
        "score": 157,
        "url": "https://i.redd.it/xl3yplplmg9d1.jpeg",
        "content": "",
        "num_comments": 12,
        "comments": [
            "My drunk ass clicked the image of Kronk without reading the subreddit, then read the first couple words, and instantly knew that I need to reinstall Kenshi.",
            "Do...do the non-skeleton characters need rest? Since I made my first base ever, half of my squad has been working practically non-stop. One of them has labouring at 86. \nI would have loved if doing mining or other heavy work all day would also increase the strength stat a little, but I think it doesn't.",
            "*Warning: The Big Skin Harvest on the way to Your Outpost.*",
            "where did you putt your base ? I want toi make a chad skelleton citie in my next run and this seems a good place to start xD",
            "It's just that the Gunner job is strange and people won't leave to go eat food from Chests, so unless they're a skelly they'll eventually starve unless micro'd",
            "*Laughs in 6 harpoon gunners with 80+ skill and four engineers constantly repairing gates with 80+ skill*",
            "Low down in Stobe's Gamble this time, as far south as I could get and still have acid water for the gate",
            "Oh okay. I didn't know that. I only have 1 mounted turret but I practically never used it. \nWhenever a raid comes (and its only cannibals that are raiding me occasionally), they always wait outside of my gates and don't even try to break them down, so I haven't had big need for gunners yet.",
            "I kind of found a way around this by setting up a small farm and telling my gunners to work it before there guarding. When it is ready they run off and tend it real quick then eat before returning if they’re hungry.",
            "theres a mod on the workshop that makes turret gunnern not have hunger"
        ]
    },
    "We like to do a bit of charity": {
        "title": "We like to do a bit of charity",
        "score": 42,
        "url": "https://i.redd.it/ns1vyc7uah9d1.gif",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}