{
    "Weekly Support Thread": {
        "title": "Weekly Support Thread",
        "score": 3,
        "url": "https://www.reddit.com/r/KerbalSpaceProgram/comments/1dqhyfq/weekly_support_thread/",
        "content": "##Check out /r/kerbalacademy\n\nThe point of this thread is for anyone to ask questions that don't necessarily require a full thread. Questions like \"why is my rocket upside down\" are always welcomed here.  Even if your question seems slightly stupid, we'll do our best to answer it!\n\nFor newer players, here are some great resources that might answer some of your embarrassing questions:\n\n* [Kerbal Space Program Wiki](http://wiki.kerbalspaceprogram.com/wiki/Main_Page)\n\n* [Scott Manley's Youtube](http://www.youtube.com/user/szyzyg)\n\n* [Von Kerman's Rocket School](http://www.youtube.com/playlist?list=PLO-JFyNTqjIljuPwaHkGZpMOLTtfCuIYg)\n\n##Tutorials\n\n**Orbiting**\n\n* [Scott Manley](https://www.youtube.com/watch?v=_q_8TO4Ag0E)\n\n* [Von Kerman (Maneuvers)](http://www.youtube.com/watch?v=L8u-doEU_f0)\n\n* [Wiki (Maneuvers)](http://wiki.kerbalspaceprogram.com/wiki/Tutorial:_Advanced_Orbiting)\n\n* [Launching Rockets to Orbit](https://www.youtube.com/watch?v=_q_8TO4Ag0E)\n\n**Mun Landing**\n\n* [Scott Manley](http://www.youtube.com/watch?v=rhs3cipRZCw)\n\n* [Von Kerman](http://www.youtube.com/watch?v=DKbkwuNsYXE)\n\n* [KSP Wiki](http://wiki.kerbalspaceprogram.com/wiki/Mun_Landing)\n\n* [Youtube Query](http://www.youtube.com/results?search_query=ksp+mun+landing&oq=ksp+mun+landing)\n\n**Docking**\n\n* [Illustrated Tutorial for Orbital Rendezvous](http://forum.kerbalspaceprogram.com/index.php?/topic/83437-illustrated-tutorial-for-orbital-rendezvous/)\n\n* [Scott Manley](http://www.youtube.com/watch?v=8kJ-z0t_CY0)\n\n* [Von Kerman (Rendevous)](http://www.youtube.com/watch?v=cwq4hJFj9Ek&list=PLO-JFyNTqjIkRUNrmKS7LxPLSDzV5cQtd&index=10)\n\n* [Von Kerman (Docking)](http://www.youtube.com/watch?v=F_MNuXFUSUo&list=PLO-JFyNTqjIkRUNrmKS7LxPLSDzV5cQtd&index=11)\n\n**Delta-V Thread**\n\n* [Thread](http://www.reddit.com/r/KerbalSpaceProgram/comments/1itpco/i_bought_this_game_during_the_steam_sale_and_i/)\n\n* [Answer 1](http://www.reddit.com/r/KerbalSpaceProgram/comments/1itpco/i_bought_this_game_during_the_steam_sale_and_i/cb7xuiw)\n\n* [Answer 2 (+bonus)](http://www.reddit.com/r/KerbalSpaceProgram/comments/1itpco/i_bought_this_game_during_the_steam_sale_and_i/cb7ye5q)\n\n**Forum Link**\n\n* [Kerbal Space Program Forum](http://forum.kerbalspaceprogram.com/forum.php?s=67f7bb0e890da3ee1ae6677e00c3ea93)\n\n**Official KSP Chatroom** [#KSPOfficial on irc.esper.net](http://client01.chat.mibbit.com/?channel=%23kspofficial&server=irc.esper.net&charset=UTF-8)\n\n#Discord server\n\nFeel free to ask your questions on the [Discord server](https://discord.gg/vxb95kkGg2)!\n\n#Commonly Asked Questions\n\nBefore you post, maybe you can search for your problem using the search in the upper right! Chances are, someone has had the same question as you and has already answered it!\n\nAs always, the side bar is a great resource for all things Kerbal, if you don't know, look there first!",
        "num_comments": 1,
        "comments": [
            "Hey all, I'm new to the game and I cannot for the life of me get any science items into my service bay... I tried rotating them, I tried holding alt (but I'm on a Mac so I think it's right shift instead?) but no matter what these items will not snap to the floor, ceiling, or walls of the inside of my service bay. Any tips?"
        ]
    },
    "Intercept Games Layoff Information Thread": {
        "title": "Intercept Games Layoff Information Thread",
        "score": 107,
        "url": "https://www.reddit.com/r/KerbalSpaceProgram/comments/1djry2e/intercept_games_layoff_information_thread/",
        "content": "Hi /r/KerbalSpaceProgram,\n\nA couple of weeks ago, some of the moderators [held a poll](https://www.reddit.com/r/KerbalSpaceProgram/comments/1d7dujg/poll_for_allowingbanning_ksp2_layoffrelated/) asking you how discussions regarding the Intercept Games layoffs should be handled. After community feedback, and consulting with the wider moderation team, we have come to the conclusion that the decision to restrict all discussion about the layoffs to one [megathread](https://www.reddit.com/r/KerbalSpaceProgram/comments/1dby3us/megathread_for_layoffrelated_questions/) was a mistake, and for that we apologise.\n\nThe restrictions on layoff-related discussions have been lifted, and this thread will remain stickied to centralise information about events regarding the layoffs. Hopefully, this will avoid submissions and comments repeating the same question. \n\nLastly, as a reminder, despite emotions running high, Rules 1 and 5 do still apply. Discussions about how poorly decisions have been made are allowed, but named attacks on Intercept Games staff are not. Be kind, these people are about to lose their jobs.\n\nThank you, \n\n/r/KerbalSpaceProgram mod team\n\n**CURRENT LAYOFF INFORMATION (AS OF 19/06/24)**\n\n* Intercept Games is closing on June 28th. What this means for the future of Kerbal Space Program 2 is unknown at this point. Take Two may be trying to sell the IP for Kerbal Space Program and/or sell Intercept Games.\n\n* Take Two's Q4 Earnings Call: \"We have eliminated several projects that didn't meet expectations for financial benchmarks\". Kerbal Space Program 2 is not explicitly mentioned by name in this report.\n\n* At least 70 employees under Take Two in Seattle are being laid off.\n\n* Community Managers Dakota and Mike are among those affected, and are currently looking for work, they will still be here until June 28th.",
        "num_comments": 88,
        "comments": [
            "Tldr shits fucked",
            "I’m starting to think that we won’t get any information at all about the future of KSP2, even after the WARN date has passed. What an atrocious lack of communication from the team…",
            "Despite media misinterpretations of the statement, Take-Two has *not* promised 'continued' support or updates for KSP2. \n\nOnly that they had update(s) in the works two months ago.\n\n> [On April 18th Private Division successfully launched Moon Studio’s No Rest for the Wicked. **The label continues to make updates to Kerbal Space Program 2** and plans to release Wētā Workshop Game Studio’s Tales of the Shire: A The Lord of the Rings Game in the second half of 2024.](https://twitter.com/KerbalSpaceP/status/1785788809613082732)\n\n\"Continues to make\" is a present-tense statement made back on May 1st, over a month ago. It makes no future promises, and doesn't even promise a release of those updates. \n\n----\n\n*Additionally*, Private Division, the publisher Take-Two owns that publishes KSP2, [had already had most of its staff laid off in April](https://www.ign.com/articles/take-two-is-quietly-killing-private-division). Something we didn't learn about until *after* the layoffs at In~~terc~~ept Games were discovered.\n\nWhile they did apparently have staff in Seattle, this layoff impacted [all four of its (former?) locations, including New York, Munich (München), and Las Vegas.](https://www.gamesindustry.biz/take-two-reportedly-shuts-down-roll7-and-intercept-games-private-division-suffers-mass-layoffs) As those locations aren't in Seattle, they are **in addition to** the 70 people being laid off in Seattle mentioned in the WARN Act notice.\n\nThere are probably a few people remaining working under the Private Division name, as Take-Two has stated that they're continuing to try to get a couple other games (not KSP2) out the door, but nothing we've heard suggests those people are working on KSP2, just on getting No Rest for the Wicked and Tales of the Shire out the door.\n\n----\n\nAs an additional little detail: the [WARN Act notice](https://esd.wa.gov/about-employees/WARN) for Take-Two's Seattle location provides more details than just 70 people losing their jobs. It also clarifies that it is due to a physical office location being shut down (the actual building). No one will be working in that physical location any more, so claims that \"a few people remain working\" by any flat-Kerbinites are not based in any evidence we have available.",
            "Will the website and forums remain up for the foreseeable future?",
            "One of you should leak the KSP 1 source code pretty please :3",
            "here’s hoping development eventually gets handed off to someone who actually cares (i wouldn’t put money on it though)",
            "Whats stopping them from releasing what they've done under a different title. If the IP holder folds doesn't their IP claim too?",
            ">Intercept Games is closing on June 28th\n\nAny official source for that? On the official Discord this information is listed as speculative (edit: \"pending confirmation\"). Take2 themselves claims that Intercept won't be \"shuttered\" and KSP2 will continue to receive updates.\n\nJust my opinion but I think Take2 just closes Private Division - hence removing the PD Launcher - not the studios. As an example the studio behind \"No Rest for the Wicked\" which recently launched into early access under PD is just fine.\n\nPoint is we should not treat speculative / non official information as fact.",
            "My expectation is that we're going to get a final jpeg post from them an hour before they lock the door, with no Q&A after.",
            "We got all the information we needed. Studio shuttered, devs laid off, development done."
        ]
    },
    "KSP Physical Crew Notebook": {
        "title": "KSP Physical Crew Notebook",
        "score": 335,
        "url": "https://www.reddit.com/gallery/1dqysy5",
        "content": "I don’t know if this is gonna interest anyone, but after months and months of playing KCD on my ps5 I was getting tired of always checking my phone for jotted down notes of DV budgets or double checking everything about my build or whatever. I’m sure everyone that plays this game somewhat seriously has some side notes for every mission.\n\nAnywho, I decided to make a more permanent notebook for all these notes. I saw one of these NASA crew notebooks when I was watching a YouTube video of astronaut Chris Hadfield, and so I decided to make somewhat of a replica that I could use for my gameplay. I got some references, found out about the most common NASA typefaces and overall design style for their spacecraft manuals, and came up with this thing.\n\nI’m not a graphic designer or anything (did this all on ms word lol) but I think it came out alright! Complete with some markers taped on the back with velcro. All in all it’s pretty practical to use and I think I kinda adds little bit of roleplay, which in my book is always a plus. \n\nAll infos are based on Mike Aben’s YouTube tutorials, which I think strike the perfect balance between actual math and engineering and just, well, fun lol",
        "num_comments": 22,
        "comments": [
            "you should add a transfer window map",
            "Pretty awesome.",
            "That's so cool! A kid learning KSP for the first time could really make use out of something like that; especially if they are dreaming of a career in space, they should get familiar with something along those lines. Nice creation!",
            "Good thinking.",
            "I love your launch checklist.\nStaging ... Always check staging ...",
            "That takes dedication.",
            "I've done the same with little .txt files, but this is amazing! Always wanted to try something like this",
            "This is neat, reminds me of my console and pre mod days",
            "Could use more \"this page intentionally left blank\" for authenticity.\n\nThis is beautiful though, I def. want to make my one for myself. Any way you can share the files?",
            "I made a custom app in Appsheet for this. Tracking who's where, what are the future plans for them, what contracts will be accomplished by whom, what the capabilities of each spacecraft are, etc"
        ]
    },
    "Thank you Kerbal Community": {
        "title": "Thank you Kerbal Community",
        "score": 1058,
        "url": "https://www.reddit.com/r/KerbalSpaceProgram/comments/1dqo5af/thank_you_kerbal_community/",
        "content": "As many of you already know, today marks my last day here at Intercept Games. It's been an incredible journey being a part of this Community and learning so much from KSP1 and KSP2.\n\nI want to express my deepest gratitude to each and every one of you for being a part of this community and being the voice this game deserves. The community around Kerbal Space Program is truly special, and it has been an honor to be a part of it.\n\nWhile my path is taking me elsewhere, please know that I'll be cheering you all on from the outside. \n\nThank you once again for everything. Keep reaching for the stars!",
        "num_comments": 178,
        "comments": [
            "Good luck Mike and the rest of the IG crew",
            "I feel your pain from this current, temporary challenge. Way to lean into gratitude. It speaks well of you.",
            "If I had a nickel for every time a KSP developer made a heartfelt goodbye post on this subreddit when they were leaving due to corporate failings I'd have... 10 nickels, which is actually quite a lot.\n\nBest of luck Mike.",
            "Thank you for everything, Mike 💚",
            "now you don't work there (either today or tomorrow) can you tell us if ksp2 will get any more updates (like is there a final one ready to go, or is that it?). also that truly does suck, this franchise is incredible and it's really annoying take two have axed it",
            "Thank you.\n\nCan we expect any more communication from IG today, or only personal posts like this one?",
            "Good luck on future endeavors.  🍻",
            "So beyond personal goodbyes, we still have no announcement of any kind. Absolutely wild.",
            "If ShadowZone's expose is even 50% accurate, it sounds like you had the world against you while there.  I apologize for any part I played in the demise of the company, but I also wish this community could have done more to help direct the completion of the game. Hopefully some company or someone will pick up the pieces and give us the KSP 2 game that was pitched to us in 2019\n\nBest luck in your new ventures.",
            "so does this mean no multiplayer then?"
        ]
    },
    "Is it weird that everytime I accidentaly lose a kerbal during a flight I end up making a satelite dedicated to them": {
        "title": "Is it weird that everytime I accidentaly lose a kerbal during a flight I end up making a satelite dedicated to them",
        "score": 24,
        "url": "https://www.reddit.com/r/KerbalSpaceProgram/comments/1dr437q/is_it_weird_that_everytime_i_accidentaly_lose_a/",
        "content": "Sorry, this is random, just wondering if anyone has thoughts on it, it just feels wrong for me not to as im a person who honors peoples sacrifices in the real world. ",
        "num_comments": 9,
        "comments": [
            "Nah not weird, that's actually a pretty nice thing you do",
            "Seems cool to me. Most of the time when I lose a Kerbal I just revert to a quick save. The only ones that are really lost are the ones that quietly Krakened or otherwise crashed somewhere a few launches and rendezvous ago, so that is lose too much of I tried to revert to when they were alive. But I do get kinda attached to the little guys",
            "Oh, all the time. I’m super very careful with my kerbals, so any death in the process of science is considered a tragedy and requires memorialization. Usually I’ll just attach their name to a probe, satellite, or research station. It def gives the save some history to look back on.",
            "I accidentally killed Bill on his routine trip to Minimus to repair the MSSS station. I timewarped when I shouldn’t have and his hopper was on a really low orbit. \n#\nThe seismic sensor picked up his death. I didn’t notice until it was too late to go back. \n#\n#There is now a Duna station in his name",
            "Idk it sometimes if they’re really special or died in a special mission",
            "I named rocket families after KIA Kerbals. The Geoffen HLV had served me well... don't mind the fact that I actually killed him by not paying attention to jetpack RCS fuel.",
            "Thanks",
            "Yea, same here\nMost times at least, i lost jeb trying to get him to a rescue shuttle on the mun",
            "I lost jeb on my most recent save after i couldn't decelerate fast enough landing on the mun, so i eva'd him and used the jetpack to decellerate, then landed a rescue shuttle about 96 km away, unfortunately my strategy of using the eva jetpack to make small hops and get there faster didnt end well, and he hit the ground too hard, i made an array of orbital scanners called the J. Kerman orbital scanner array,"
        ]
    }
}