{
    "YUNZII AL75 Extended Warranty": {
        "title": "YUNZII AL75 Extended Warranty",
        "score": 8,
        "url": "https://i.redd.it/knzwpc4grf8d1.png",
        "content": "",
        "num_comments": 1,
        "comments": [
            "YUNZII Customer Service: [support@yunzii.com](mailto:support@yunzii.com)"
        ]
    },
    "Bought a keychron k3 as an upgrade and I hate it": {
        "title": "Bought a keychron k3 as an upgrade and I hate it",
        "score": 3,
        "url": "https://www.reddit.com/r/keyboards/comments/1dr9p1f/bought_a_keychron_k3_as_an_upgrade_and_i_hate_it/",
        "content": "So I \"upgraded\" from a sharkoon purewriter (kailh choc red) to a keychron k3 V2 (optical red) as the former was showing signs of wear and some keys where not registering any more. I liked the sharkoon a lot, and was just looking for a small upgrade and change to 75% layout.\n\nLong story short, I hate the keychron, the key travel does not feel linear at all, I feel a lot more resistance on key press compared to the kailh, specially as it gets close to bottom out. I'd say I feel it very mushy and get no satisfactory mechanical feedback from the key presses. On top of that I'm making a lot of typing mistakes, I think that my fingers get caught between keys when gliding my fingers over them, which didn't happen with the sharkoon.\n\nSo I think I hate the switches and the key caps, so basically the whole keyboard, and I'm stuck with it because of the atrocious refund policy keychron has (ship to honk Kong at own expense).\n\nEnd of my rant.\n\nNow my question,\n\nAny recommendations on a 75% keyboard that feels similar to the sharkoon purewriter? I think the Logitech MX mini might be it....?\n\nI've also read from some people that recommend the banana switches as a way to fix some of my issues, but I still have they keycap problem 😭.",
        "num_comments": 0,
        "comments": []
    },
    "why are the keys with the Keychron K1 SE NOT standard??": {
        "title": "why are the keys with the Keychron K1 SE NOT standard??",
        "score": 1,
        "url": "https://www.reddit.com/r/keyboards/comments/1drdlnd/why_are_the_keys_with_the_keychron_k1_se_not/",
        "content": "so, i ordered the Keychron K1 SE because i liked the layout and wanted low profile keys. . .but when i got it i realized i was unable to change the keycaps because some of them are nonstandard keys with the space and shift having offset Stabilizers. . .   \nand my question is WHY?!!? I'm really debating returning this keyboard just because of that so can someone explain to me why and if there is something i can do?   \n",
        "num_comments": 0,
        "comments": []
    },
    "Recommendation for these requirements?": {
        "title": "Recommendation for these requirements?",
        "score": 1,
        "url": "https://www.reddit.com/r/keyboards/comments/1drdi5d/recommendation_for_these_requirements/",
        "content": "I currently use a Logitech K780 keyboard, which in general I like. The major problem I have is the limited functionality of the FN keys, especially because FN1-3 is taken up by the device switching feature, which I have no use for. I'd like to be able to control volume and use the FN1-12 directly without having to rely on the fn key. Can anybody recommend a keyboard with dedicated volume controls and FN keys that is not too expensive? Wired/wireless doesn't matter. I prefer a quiet keyboard so not really interested in mechanical. ",
        "num_comments": 0,
        "comments": []
    },
    "Does a keyboard fitting my preferences exist?": {
        "title": "Does a keyboard fitting my preferences exist?",
        "score": 0,
        "url": "https://www.reddit.com/r/keyboards/comments/1drcj5f/does_a_keyboard_fitting_my_preferences_exist/",
        "content": "Keyboard wizards I summon thee! I seek guidance.. \n\n\nI'm gonna state some keyboard needs here, so if you got the time, pls tell me if my dream keyboard is impossible or recommend some if you're in the know. Keeping my fingers crossed!\n\n\n- Silent or as close to as possible.\n- Got a deep click/bump feel.\n- Good for gaming.\n- Clear background RGB light.\n- Imagine a regular gaming keyboard layout but chop off the numpad. Need it to be a bit compact, without being completely mushed together.\n- Available in Scandinavia -> Gotta have my ÆØÅ, yes pls.\n\n\nPerhaps unnecessary, but to explain further:\nLast, I bought a Logitech G PRO Mechanical Gaming Keyboard. It's perfect in regards to click feel and size. Suits me well for gaming and typing. I would prefer a stronger light, but the real deal breaker is the noise.. my partner is begging me to get a new one, the late night clickety clack from gaming and typing notes during DnD sessions can be heard echo throughout our apartment.. there's no escape. Also my mic picks it up, which can be bothersome.\n\n\nSo. You're absolutely correct I should have looked further into it, before getting the Logitech I've got currently. Alas, I'm a tech n00b and did not imagine the audible terror a keyboard could bring. Second keyboard of my life. The prior served me well, but is way too big for my new compact setup :c\n\n\nSorry about the long post, but I fear my keyboard, as well as my partner's sanity are in mortal peril..\n\nAny help is appreciated!",
        "num_comments": 7,
        "comments": [
            "Does the second point mean you want a stronger tactile bump? I'm not sure what you mean by \"click\" and \"silent.\"\n\nAlso what is your budget?",
            "Everything else is possible with a custom keyboard but I don't know how you want a click/tactile key that is silent. If the key gonna have a deep tactile bump it is going to make a sound.",
            "You are looking for a tkl keyboard i assume but you can also check a 75% or even less like a 65 or a 60, then you will need to buy silent switches to make it silent, a tactile switch doesn't match a good for gaming, usually when playing you will look for a linear switch but it comes down to preference \n\nWhat i can suggest is look keychron for a barebone kit then do a little research on silent switches find what you think is best for yourself and get a good keycaps sets, for the special characters you will need to set them in the software, i got the same problem since i use     but you can always find a way",
            "Would checkout tkl with he switch, e.g. keychron Q1 He or Akko mod007 He/monsgeek He. They are all 75% instead of tkl and miss 2-3 keys.\n\nOr wooting, but it got even less keys",
            "I'm not well versed in the names of the keyboard's guts, nor is English my native language.. so I'm a bit lost. To try and explain, I like when there's depth when you push down the keys, as in.. not like a laptop keyboard. It's just the loud metallic clickety clack sounds it makes when you type. When using my Logitech I need to type as gently as you'd pet a newborn kitten, if I am to avoid a bothersome volume, but that doesn't exactly allow for speed :/",
            "In regards to budget then the cheap end is obvs. nice but I'm both willing and able to pay what it takes.. what currency do you use? Then I can give you an assumed amount, but not necessarily what I'll limit myself to.",
            "What do I look for if I then lower my goals and settle for one that got depth and clicks, just not in a crazy loud metallic way? Is that possible? My prior had a low click, good depth, but I don't have enough room for it on my desk anymore and I couldn't find any numpad-less edition of the oldie."
        ]
    }
}