{
    "🎟🎟🎟TICKET SALES MEGATHREAD 🎟🎟🎟": {
        "title": "🎟🎟🎟TICKET SALES MEGATHREAD 🎟🎟🎟",
        "score": 274,
        "url": "https://www.reddit.com/r/Killtony/comments/yg5olv/ticket_sales_megathread/",
        "content": "All posts looking for or selling tickets are to be posted here from now on.   \nTicket posts not made on this thread will be deleted by mods.  \n\n\nTickets for Kill Tony often sell out months in advance, so take that in to consideration if you're planning to be in town for the show.  \n\n\nBe smart and don't fork over your hard earned green to scammers.",
        "num_comments": 3107,
        "comments": [
            "I can help with tickets we have some guest list and sponsored tables that arent claimed or spoken for on some shows so I can sell them.. just message me if you want tickets\n\nSource: i run vulcan",
            "Absolute trash ticketing system. Unfortunately the majority of these tickets were probably purchased by scalpers and will be resold at 10x the cost. Hope they change the ticketing system to make it more accessible and not just be a club for the rich.",
            "Just an FYI. I got tickets from another Redditor for tomorrows show. ShowClix confirmed via email that for KT shows specifically, the vendor WILL NOT allow the name of the purchaser to be updated. Ill still try to get in, but if they do turn me away Id suggest NOT buying secondhand KT tickets. We even told them that it was a gift, and ShowClix said too bad.\n\nEDIT: I got in no problem. They scanned my QR and gave us wristbands before they checked ID to make sure we were over 21. Then a pretty thorough pat down. Sorry for freaking anyone out. Also last nights show was dope, yall are gonna be in for a surprise.",
            "Yall don't get scammed At the Mothership, They check tickets at the door; The name on the ticket has to match the ID used at the door. If not both the ticket purchaser and user gets banned from the club. Don't be a victim! Only way is to Meet them in line if they have an extra. Cant transfer tix",
            "Got scammed by electric banana 81. Dont send money to a loomistellie@gmail.com. Or someone who uses the name Shantel Loomis. They sent me fake tickets from another email arianasmith839@gmail.com. I lost my money if anyone cant sell and wants to give up the tickets so they dont go to waste yall can dM me.",
            "scammer: impressive-storm . venmo: sarah-becklar",
            "Desertedstoryteller4 is a scammer. Beware!",
            "Question for anyone who has bought KT tickets here and successfully attended:    \n\nDid Mothership let you in with photocopy/screenshot of the original ticketholders ID?",
            "Looking for 10th anniversary tickets",
            "How will this thread play out now that they have moved and are not admitting re-sold tickets?"
        ]
    },
    "KILL TONY #669 - LUIS J GOMEZ + SAL VULCANO": {
        "title": "KILL TONY #669 - LUIS J GOMEZ + SAL VULCANO",
        "score": 140,
        "url": "https://www.youtube.com/watch?v=JhTRTXrSE2I",
        "content": "",
        "num_comments": 249,
        "comments": [
            "Did not expect Ari to be a new regular, I like him, he was really funny on Williams podcast. Just very unexpected for him to be a regular",
            "Luis J Gomez watches us",
            "Tonys face lit up when he saw Pierre",
            "Booker T had a hell of a set.",
            "Sal and luis are actually a great combo of guests",
            "How the hell is no one talking about Luis J eating a kidney stone?! I mean theres a possibility that was fake but what the actual fuck ",
            "5 and a half years and they gave William the fucking axe and its literally so hot outside",
            "Am I crazy or has the Mars martian been on before? Like in an older episode. I have heard his voice before.",
            "Luis did some Coke magic tonight and made that dude's kidney stone dissappear no way he ate that",
            "I barely understand Drew. Long winded non joke"
        ]
    },
    "They Ain’t Evea Gunna Stop setting William up ": {
        "title": "They Ain’t Evea Gunna Stop setting William up ",
        "score": 251,
        "url": "https://i.redd.it/lmugprms2f9d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "Do the thing!, do the thing!!",
            "But he ain't evea gona stop",
            "Saw William last night and it was amazing.",
            "I ain't evah gonna stop saying my catchphrase!",
            "Hate to break it to you all, but William passed away 2 nights ago. RIP he has actually stopped.",
            "And we dont evea want him too!",
            "The fibromyalgia finally got him",
            "That's William on millhouses poster!",
            "Fuck yes! Been on a William kick, recently. Mother has been crushing lithium up to put in my smoothies, but I say niet niet niet!",
            "I finally felt this way when Tony was setting him up.\n\n  \nLet William feel itfishing sucks"
        ]
    },
    "I know there’s haters here but…": {
        "title": "I know there’s haters here but…",
        "score": 118,
        "url": "https://www.reddit.com/r/Killtony/comments/1dr1buq/i_know_theres_haters_here_but/",
        "content": "I know there’s haters here but… seriously Drew Nickens is actually a good addition to the show. He’s silly and a nice break from the bombs. I’m alittle late to this last episode but I really think he’s gonna be better as time goes on. Plus I can’t help but smile when he comes on, especially after a terrible set. ",
        "num_comments": 91,
        "comments": [
            "I feel like people forget that this show is a place for up and coming comedians. Ofcourse you're not going to pull Louis CK out of the bucket...",
            "I just heard him say Wakanda sometimes and ran to this sub lol. So good",
            "I fucking love the guy. I think he's hilarious and has a phenomenal personality, all things considered. Everyone should watch the YouTube video tracking his journey to get on killtony. He's so positive. He also reminds me of a good friend of mine. I truly hope he keeps pushing to get better. You just can't deny the energy he brings to the stage.",
            "Better than Hans. That untalented fuck must suck a mean dick.",
            "Coming out to 25 or 6 to 4 he was on ",
            "I enjoy him a lot and I hate just about everyone",
            "Well see how this ages after his fourth time opening the show",
            "A spastic mentally handicapped guy who becomes exceedingly unfunny the longer he bellows.",
            "you guys are more fucking annoying than anyone who might be saying he is bad. good grief y'all are broken ass records in this place.",
            "Super gay post but I'm also gay so it's tight and I agree"
        ]
    },
    "Went to see Casey Rocket on tour last night and holy shit does this man need a full hour to cook. Unreal.": {
        "title": "Went to see Casey Rocket on tour last night and holy shit does this man need a full hour to cook. Unreal.",
        "score": 752,
        "url": "https://www.reddit.com/r/Killtony/comments/1dqn649/went_to_see_casey_rocket_on_tour_last_night_and/",
        "content": "After seeing clips of Casey and all of his sets on Kill Tony, I was looking forward to seeing him but really didn't have high expectations. I love his style but always thought things felt a bit forced some times. I was especially apprehensive bringing people who had no idea who he was.\n\nAll I can say after seeing him last night is that he blew my expectations out of the water. Casey had my entire group in absolute tears as his set progressed. He seemed so comfortable up there and watching him rif live when he has a fully hour to play with is truly watching an artist at work. \n\nThe set was a great mix of absolutely ridiculous stories, punchlines, and just straight up nonsense that flowed so well together. He's so believable and authentically himself on stage. I really don't think fitting him in a 1 minute window or watching him on TV compliments his style. He needs to be riffing live with a crowd.\n\nThe whole place was in a standing ovation after his set. 10/10",
        "num_comments": 150,
        "comments": [
            "Just checked his tour dates and hes playing 100 shows in Florida- everywhere EXCEPT Tampa! Must have a warrant. Get real",
            "Man I'd love to see an All Stars Ep of KT or maybe a competition with 5 minute sets.",
            "The thing about pills is folks...",
            "Peter Riffin never disappoints. Real crab shit.",
            "Saw him in Tampa in April and felt the exact same way. His shows were both sold out and we were in tears. I love having him as a treat on Kill Tony but his greatness cannot thrive in one minute. We have tickets to see him again in November since my boyfriend missed it and its something you just have to see to believe.",
            "Mrs. Six Flags had me CRYING",
            "My wife loves him and he's going to perform near us on her bday!",
            "Casey rocket is the bestttt. Never maDe iT aS a wISemannnNN",
            "Who were the openers for the show?",
            "holy shit just checked his website and he's got dozens of shows booked. Must be so awesome and fun to be able to just rif and be a silly fucking rocket on stage a few times a week across the world. I love that crazy fucker"
        ]
    }
}