{
    "Kingdom Hearts General Q&A Thread - June 10, 2024": {
        "title": "Kingdom Hearts General Q&A Thread - June 10, 2024",
        "score": 8,
        "url": "https://www.reddit.com/r/KingdomHearts/comments/1dcfg27/kingdom_hearts_general_qa_thread_june_10_2024/",
        "content": "To those who are curious about the franchise, welcome to /r/KingdomHearts! Don't know where to start? [***Check out our guide here in order to get started and how to play through the series!***](https://www.reddit.com/r/KingdomHearts/wiki/playorder)\n\nHave a question about some plot point within the series? Want to pick the brains of the lore experts of the series? Feel the need to vent about some really specific but ever-so-crucial detail? This is the place to do it. Anything is fair game, as long as potential spoilers are marked and all other subreddit rules are followed.\n\nPlease mark any in-game spoilers as such; failure to do so will result in your comment being removed. **We would like to keep this thread mostly spoiler-free if possible for newcomers to the franchise/series.** \n\nYou can spoiler your post like this:\n\n&#x200B;\n\nFor Old Reddit: Insert your text into the brackets, followed by (/spoiler)\n\n\\[!Don't read this!\\](/spoiler)\n\n&#x200B;\n\nturns into:\n\n&#x200B;\n\n\\[!Don't read this!\\](/spoiler)\n\n&#x200B;\n\nFor New Reddit, there's spoiler tags you can put yourself while you're typing out your comment!\n\n&#x200B;\n\nHave fun and enjoy!",
        "num_comments": 141,
        "comments": [
            "Does anyone know how to transfer save files to Steam release?",
            "Anyone know if the steam price for KH on launch would be on sale price since it’s been out before already?",
            "Hello! I'm planning to get KH3 from Steam, and... according to internet, there are mods which helps fix the game or something? If so, is there anything you guys reccomend? Or are the rumors false and KH3 is fine as it is?\n\nThank you very much!",
            "Was Sora's movement always this stiff? I'm replaying KHFM on Steam and it seems like he has this blocky turning around movement, like he only has 8 possible directions and I'm using a D-Pad to move him—but I'm using an analog stick.",
            "Has anyone else noticed that KH:FM crashes a lot on steam? I've had the game for 3 days and it crashes probably once a day if not more. Super annoying when I'm trying to complete stuff and have to backtrack a save :(",
            "Does anyone know if the kingdom hearts for ps4(every game possible) digital save is compatile with the disk save?  \nI heard that sometimes they're different so if you play it digitally with the PS+ and then you want to use that save to play your physical disc it doesn't match.  \nCan I do that with kingdom hearts games?",
            "I heard a few people say that when pre-ordering KH on Steam, you get a special keyboard. Looking at the game page, it says you just need to purchase it? Can somebody clarify where I'd go to pre order it?",
            "When Kingdom Hearts releases on Steam, will the current mods available on the Epic Game Store version of the games be transfered over to the Steam version? Like the 2D illustrated HUD for the characters in KH3?",
            "Is there a need for the critical plus ability if you have the ultima weapon in KH1? Doesn’t it always land critical strikes?",
            "Anyone know when/if we’ll start seeing reviews for the steam collections? I’m curious about steam deck performance. I’m guessing it will basically match the EGS performance, but ¯\\(ツ)/¯"
        ]
    },
    "Kingdom Hearts General Q&A Thread - June 24, 2024": {
        "title": "Kingdom Hearts General Q&A Thread - June 24, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/KingdomHearts/comments/1dn7dox/kingdom_hearts_general_qa_thread_june_24_2024/",
        "content": "To those who are curious about the franchise, welcome to /r/KingdomHearts! Don't know where to start? [***Check out our guide here in order to get started and how to play through the series!***](https://www.reddit.com/r/KingdomHearts/wiki/playorder)\n\nHave a question about some plot point within the series? Want to pick the brains of the lore experts of the series? Feel the need to vent about some really specific but ever-so-crucial detail? This is the place to do it. Anything is fair game, as long as potential spoilers are marked and all other subreddit rules are followed.\n\nPlease mark any in-game spoilers as such; failure to do so will result in your comment being removed. **We would like to keep this thread mostly spoiler-free if possible for newcomers to the franchise/series.** \n\nYou can spoiler your post like this:\n\n&#x200B;\n\nFor Old Reddit: Insert your text into the brackets, followed by (/spoiler)\n\n\\[!Don't read this!\\](/spoiler)\n\n&#x200B;\n\nturns into:\n\n&#x200B;\n\n\\[!Don't read this!\\](/spoiler)\n\n&#x200B;\n\nFor New Reddit, there's spoiler tags you can put yourself while you're typing out your comment!\n\n&#x200B;\n\nHave fun and enjoy!",
        "num_comments": 33,
        "comments": [
            "Ya'll, I accidentally deleted my KH1 100% file. I recently completed it on Steam and I started a new game to get the Speedster achievement, but I accidentally overrode the original file.\n\nI checked Steam Cloud and there was no save file to download. I'm pretty sad about it, but I guess it's not the biggest deal in the world. I'll play KH1 eventually again.",
            "With luabackend now updated for Steam, how does one get it working? I have all the files in their proper folders and edited the toml file, but it doesn't seem to play my mods. Is there something I have to enter for launch options?\n\nEdit: I seem to have installed it correctly. I can press F2 to open up the luabackend console in game and it says the mods are installed, but they don't work at all.",
            "If I were to mod the ReCom cutscenes to be HD would it affect getting Steam Achievements? And does 1.5+2.5 ReCOM require Days to be completed to get the Card Master Sora Achievement?",
            "Im playing the Steam version of KH1.5 and having the game crash during the Cloud and Leon fight. Not saving anything from the last save forcing me to redo the whole Hades Cup up to that point only for the game to crash again. Just seeing if anyone else had this happen or if it's known.",
            "Does anyone know where lightning stones are in kh2fm?? I have lightning gems and shards but nothing on ign or the wiki or anything is accurate and I can't find lightning stones. Thanks!!",
            "Is there a way to get the original PS2 soundtracks on KH1 and KH2 on PC/Steam?",
            "Hey i am currently playing KH1.5 and i am at the end of the world. I managed to kill Chernabog but i now hit a brick wall. The room where the waves of heartless spawn is not doable for me and i keep getting wiped. My last savepoint was before Chernabog and i have to do it all over now (that save point has no gummiship access. Is there any way to leave and lvl up or is my save bricked? Because i also have no way to Grind there since all spawns are in that room that gets me wiped.\n\nI also start right back in the room at the start of the fight whenever i wipe. Seeing walkthroughs i See them heavily outleveling me and they deal so much more damage than i do. Those demon-heartless take 4 to 5 full aircombos and they 3 hit me. Just getting oberwhelmed and i am scared I wont ever be able to beat it \n\nParty LvL is 51",
            "is it possible for me to play all the KH games in steam in japanese but english subs?",
            "For those who have played the PC version and are familiar with emulation, which would be the better experience? I have PCSX2 set up, and given the Steam release I'm considering whether to buy the discs and emulate the classics or buy the PC version.",
            "Are there any multiplayer mods where I can play through the story with someone else online?"
        ]
    },
    "Nah this is crazy💀💀🙏😭": {
        "title": "Nah this is crazy💀💀🙏😭",
        "score": 1635,
        "url": "https://i.redd.it/kwxyt6dmld9d1.jpeg",
        "content": "",
        "num_comments": 258,
        "comments": [
            "Nah. It’s a vessel for Xehanort. Get it right.",
            "Poor kid just wanted to play peak",
            "So are we not going to talk about them having 1.3 k...or in other words **13** hundred followers? \n\nThat's either a fun coincidence or this person knew *exactly* what they were doing.",
            "My favorite thing about these pages is peoples lack of ability to just know they're a troll page. There is always at least one person who is so gullible or against religion that they see this and think people are actually this dumb and deranged.",
            "Don’t leak my page",
            "What a big spoiler for KH5. MoM hates Kingdom Hearts 💀",
            ">they dont know kingdom hearts is light",
            "oh we're back to this again. ignore them",
            "There's an alarming number of people who can't separate fiction from reality, and misuse Christianity to paint fiction as evil so they don't have to think about it.\n\nSane Christians also make fun of them.",
            "As a Christian, there’s nothing un-Christian about Kingdom Hearts :/"
        ]
    },
    "Fight me. Kingdom Hearts 1 is better than 2.": {
        "title": "Fight me. Kingdom Hearts 1 is better than 2.",
        "score": 175,
        "url": "https://i.redd.it/2r6c6zuk8f9d1.jpeg",
        "content": "Come at me bro!  \n",
        "num_comments": 160,
        "comments": [
            "2 will always have a special place in my heart, but 1 really gives me such a unique feeling... I don't know how to explain it",
            "1 has my favorite story (along with bbs) in the series. It's 2's gameplay that makes me love it so much. The limit breaks, reaction commands, drive forms, etc. I don't think square will ever top kh2's gameplay.",
            "Agreed. Not to be that guy but it has much more heart. All the little thing. Like cutscenes being different depending on the order you do the worlds. Ringing the bell in the traverse town hotel. Putting out and igniting the fire in neverland. These things, that the devs didn't need to add but did. It's so charming. For the numbered titles, 2 in honesty my least favorite. I go back and forth between liking 1 or 3 more, I think at the moment I'm 1>3>2. Ask me next month, I might be 3>1>2, I dunno.",
            "KH1 definitely has a unique appeal that none of the other games have. I feel super nostalgic whenever I replay it.\nHowever, KH2 still better  ¯\\_(ツ)_/¯",
            "KH1 has stronger worlds and a tighter narrative\n\n\nKH2 has a battle a top a dragon that you eventually destroy piece by piece before culminating in a 2v1 lightsaber duel were you block thousands of lasers accompanied by the best song in the series. \n\nThey’re about equal",
            "1 just has good vibes I’ll always fw it",
            "I will fight you in Final Form",
            "The start of KH2 is SO DANG SLOW. Plus I’ve always thought KH1 gummi ship flight was the pinnacle of flying 😂 it’s the best for me lol",
            "Okay. *Starts smacking you around with KH2's superior combo modifiers*\n\n>!(Disclaimer: I haven't actually gone through to check if KH2's modifiers are better, I just thought it would be a good joke)!<",
            "1 has an aesthetic that none of the other games have fr\n\n\nMy nostalgia for 2 is stronger but 1 has some solid points in its favor too"
        ]
    },
    "Something in response to the Christian mom's kh post lmao": {
        "title": "Something in response to the Christian mom's kh post lmao",
        "score": 202,
        "url": "https://i.redd.it/v8h105fmie9d1.png",
        "content": "",
        "num_comments": 29,
        "comments": [
            "BlondeSoranotRoxas and BlackHairedKairinotXion is wild.",
            "There are so many better verses they could have pulled. \n\nThe light shines in the darkness, and the darkness cannot overcome it.  -John 1:5",
            "Fun fact: I broke Bio Roxas with this image",
            "There's also this one artist I saw on DA that also had this one piece I think of Sora and Kairi like praying at a cross or something. I think. Idk, been a while since I saw that person's profile so I could be wrong on some things.",
            "The lapsed catholic in me would do anything to buy this poster",
            "Is this gonna be important for KHIV?",
            "Youth Pastor Voice: “You know who else traveled to release hearts from darkness…”",
            "Anyone gunna make a ‘Wayfinders for Christ’ page?",
            "To be honest. I don't know if I am more impressed that this exists and should be satisfied that it's a good counter to the latest Christian fear mongering. Or if I'm slightly disappointed that someone did my favorite game and characters so dirty.. its funny but....it just feels wrong.",
            "“I see your lord, but can he defeat darkness within darkness?” - Ansem the Seeker of Darkness, probably"
        ]
    }
}