{
    "Kingdom Hearts General Q&A Thread - June 10, 2024": {
        "title": "Kingdom Hearts General Q&A Thread - June 10, 2024",
        "score": 8,
        "url": "https://www.reddit.com/r/KingdomHearts/comments/1dcfg27/kingdom_hearts_general_qa_thread_june_10_2024/",
        "content": "To those who are curious about the franchise, welcome to /r/KingdomHearts! Don't know where to start? [***Check out our guide here in order to get started and how to play through the series!***](https://www.reddit.com/r/KingdomHearts/wiki/playorder)\n\nHave a question about some plot point within the series? Want to pick the brains of the lore experts of the series? Feel the need to vent about some really specific but ever-so-crucial detail? This is the place to do it. Anything is fair game, as long as potential spoilers are marked and all other subreddit rules are followed.\n\nPlease mark any in-game spoilers as such; failure to do so will result in your comment being removed. **We would like to keep this thread mostly spoiler-free if possible for newcomers to the franchise/series.** \n\nYou can spoiler your post like this:\n\n&#x200B;\n\nFor Old Reddit: Insert your text into the brackets, followed by (/spoiler)\n\n\\[!Don't read this!\\](/spoiler)\n\n&#x200B;\n\nturns into:\n\n&#x200B;\n\n\\[!Don't read this!\\](/spoiler)\n\n&#x200B;\n\nFor New Reddit, there's spoiler tags you can put yourself while you're typing out your comment!\n\n&#x200B;\n\nHave fun and enjoy!",
        "num_comments": 141,
        "comments": [
            "Does anyone know how to transfer save files to Steam release?",
            "Anyone know if the steam price for KH on launch would be on sale price since it’s been out before already?",
            "Hello! I'm planning to get KH3 from Steam, and... according to internet, there are mods which helps fix the game or something? If so, is there anything you guys reccomend? Or are the rumors false and KH3 is fine as it is?\n\nThank you very much!",
            "Was Sora's movement always this stiff? I'm replaying KHFM on Steam and it seems like he has this blocky turning around movement, like he only has 8 possible directions and I'm using a D-Pad to move him—but I'm using an analog stick.",
            "Has anyone else noticed that KH:FM crashes a lot on steam? I've had the game for 3 days and it crashes probably once a day if not more. Super annoying when I'm trying to complete stuff and have to backtrack a save :(",
            "Does anyone know if the kingdom hearts for ps4(every game possible) digital save is compatile with the disk save?  \nI heard that sometimes they're different so if you play it digitally with the PS+ and then you want to use that save to play your physical disc it doesn't match.  \nCan I do that with kingdom hearts games?",
            "I heard a few people say that when pre-ordering KH on Steam, you get a special keyboard. Looking at the game page, it says you just need to purchase it? Can somebody clarify where I'd go to pre order it?",
            "When Kingdom Hearts releases on Steam, will the current mods available on the Epic Game Store version of the games be transfered over to the Steam version? Like the 2D illustrated HUD for the characters in KH3?",
            "Is there a need for the critical plus ability if you have the ultima weapon in KH1? Doesn’t it always land critical strikes?",
            "Anyone know when/if we’ll start seeing reviews for the steam collections? I’m curious about steam deck performance. I’m guessing it will basically match the EGS performance, but ¯\\(ツ)/¯"
        ]
    },
    "Kingdom Hearts General Q&A Thread - June 24, 2024": {
        "title": "Kingdom Hearts General Q&A Thread - June 24, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/KingdomHearts/comments/1dn7dox/kingdom_hearts_general_qa_thread_june_24_2024/",
        "content": "To those who are curious about the franchise, welcome to /r/KingdomHearts! Don't know where to start? [***Check out our guide here in order to get started and how to play through the series!***](https://www.reddit.com/r/KingdomHearts/wiki/playorder)\n\nHave a question about some plot point within the series? Want to pick the brains of the lore experts of the series? Feel the need to vent about some really specific but ever-so-crucial detail? This is the place to do it. Anything is fair game, as long as potential spoilers are marked and all other subreddit rules are followed.\n\nPlease mark any in-game spoilers as such; failure to do so will result in your comment being removed. **We would like to keep this thread mostly spoiler-free if possible for newcomers to the franchise/series.** \n\nYou can spoiler your post like this:\n\n&#x200B;\n\nFor Old Reddit: Insert your text into the brackets, followed by (/spoiler)\n\n\\[!Don't read this!\\](/spoiler)\n\n&#x200B;\n\nturns into:\n\n&#x200B;\n\n\\[!Don't read this!\\](/spoiler)\n\n&#x200B;\n\nFor New Reddit, there's spoiler tags you can put yourself while you're typing out your comment!\n\n&#x200B;\n\nHave fun and enjoy!",
        "num_comments": 33,
        "comments": [
            "Ya'll, I accidentally deleted my KH1 100% file. I recently completed it on Steam and I started a new game to get the Speedster achievement, but I accidentally overrode the original file.\n\nI checked Steam Cloud and there was no save file to download. I'm pretty sad about it, but I guess it's not the biggest deal in the world. I'll play KH1 eventually again.",
            "With luabackend now updated for Steam, how does one get it working? I have all the files in their proper folders and edited the toml file, but it doesn't seem to play my mods. Is there something I have to enter for launch options?\n\nEdit: I seem to have installed it correctly. I can press F2 to open up the luabackend console in game and it says the mods are installed, but they don't work at all.",
            "If I were to mod the ReCom cutscenes to be HD would it affect getting Steam Achievements? And does 1.5+2.5 ReCOM require Days to be completed to get the Card Master Sora Achievement?",
            "Im playing the Steam version of KH1.5 and having the game crash during the Cloud and Leon fight. Not saving anything from the last save forcing me to redo the whole Hades Cup up to that point only for the game to crash again. Just seeing if anyone else had this happen or if it's known.",
            "Does anyone know where lightning stones are in kh2fm?? I have lightning gems and shards but nothing on ign or the wiki or anything is accurate and I can't find lightning stones. Thanks!!",
            "Is there a way to get the original PS2 soundtracks on KH1 and KH2 on PC/Steam?",
            "is it possible for me to play all the KH games in steam in japanese but english subs?",
            "For those who have played the PC version and are familiar with emulation, which would be the better experience? I have PCSX2 set up, and given the Steam release I'm considering whether to buy the discs and emulate the classics or buy the PC version.",
            "Are there any multiplayer mods where I can play through the story with someone else online?",
            "Playing KH 2, should I bother with Ultima Weapon? Compared to KH 1.5, it seems way easier to get (with the exception of getting every synthesis material for that one Orichalcum +,) but I also am hearing rumors that Decisive Pumpkin is better. Can someone throw their 2 cents in on this topic?"
        ]
    },
    "Nah this is crazy💀💀🙏😭": {
        "title": "Nah this is crazy💀💀🙏😭",
        "score": 2192,
        "url": "https://i.redd.it/kwxyt6dmld9d1.jpeg",
        "content": "",
        "num_comments": 329,
        "comments": [
            "Nah. It’s a vessel for Xehanort. Get it right.",
            "Poor kid just wanted to play peak",
            "So are we not going to talk about them having 1.3 k...or in other words **13** hundred followers? \n\nThat's either a fun coincidence or this person knew *exactly* what they were doing.",
            "What a big spoiler for KH5. MoM hates Kingdom Hearts 💀",
            ">they dont know kingdom hearts is light",
            "My favorite thing about these pages is peoples lack of ability to just know they're a troll page. There is always at least one person who is so gullible or against religion that they see this and think people are actually this dumb and deranged.",
            "That Facebook group seems pretty….heartless 😎",
            "There's an alarming number of people who can't separate fiction from reality, and misuse Christianity to paint fiction as evil so they don't have to think about it.\n\nSane Christians also make fun of them.",
            "oh we're back to this again. ignore them",
            "Why, specifically, Kingdom Hearts? There are so many other games, some with actual anti-christian themes. Why KH?"
        ]
    },
    "The best kind of diagram.": {
        "title": "The best kind of diagram.",
        "score": 261,
        "url": "https://i.redd.it/rvk3vjpkxg9d1.jpeg",
        "content": "",
        "num_comments": 9,
        "comments": [
            "Also, it's been awhile since I've heard anything from Project Destati. Hope that group is doing alright.",
            "I regularly see them on Tumblr lol. They still post often",
            "Whoever made that, thank you",
            "Ah yes\n\nGohan\n\nTurlis\n\nVegeta\n\nAnd Ven",
            "Couldn't agree more.",
            "The best Ven diagram",
            "omg they beheaded ventus",
            "It's beautiful.",
            "I see your diagram, and raise you [THIS](https://imgur.com/a/DUhruxA)"
        ]
    },
    "End of the World is such a brooding theme and is easily top 5 themes in the series": {
        "title": "End of the World is such a brooding theme and is easily top 5 themes in the series",
        "score": 110,
        "url": "https://i.redd.it/9zgyjnfjxh9d1.jpeg",
        "content": "art by passeronero",
        "num_comments": 10,
        "comments": [
            "Still the best final level for me of all KH games.",
            "This theme really gives off the vibe: \"this is it guys, this is the end\"",
            "\"Is that all that's left of the worlds taken by the heartless...?\"",
            "Chernabog, special heartless, door closing scene, ending song and reveal of King Mickey. Stacked world.",
            "End of the World was the better world than The World That Never Was, but the boss gauntlet in KH2 itself is better imo. And I say that fully knowing and agreeing with the fact that KH1 is right behind that.",
            "They cooked their fucking ass off with this world",
            "\"Take a look at this tiny place.\"",
            "It's so final fantasy-ish, I love it. The feeling of \"yep this is the final\", the music, the colours, the enemy's. It's just perfect. I love the kh2 final world but kh1 is just magical and wins by a little bit. And let's not even talk about that freaking disappointment that was the keyblade graveyard in KH3. Not counting scala because the basegame Version sucked.",
            "Sora looks as uncanny as Ugly Sonic in this for some reason.",
            "Totally agree. I mean I enjoyed TWTNW but some of the worlds in KH1 just hit different - mysterious, magical, yet calming and exciting. I feel like other KH games come close to matching the feeling, but worlds like Traverse Town or End of the World are just right in the feels."
        ]
    }
}