{
    "Dear Mods: Let's make a \"KCD Getting Started\" Megathread for New Players!": {
        "title": "Dear Mods: Let's make a \"KCD Getting Started\" Megathread for New Players!",
        "score": 229,
        "url": "https://www.reddit.com/r/kingdomcome/comments/1cnsibf/dear_mods_lets_make_a_kcd_getting_started/",
        "content": "Edit: I am trying to update this as comments come along :)\n\nSo many people are buying KCD nowadays and the least we can do is help them out and make sure we get some momentum rolling towards the release of the new game. I suggest that we make a sticky thread about this for all newcomers to see, and try to answer issues below that thread. Reddit's searching algorithm isn't the best, and there is a chance a player will read only a couple of tips before they give up on their search.\n\nHere are some tips from me :) Combat is at the bottom.\n\n* **Henry: You are a lowborn peasant who can barely fistfight, can't use a sword and can't read.** Your performance in this game is heavily tied to Henry's skills. You can't take on 2 Bandits with a sword if your sword level is 1. There is nothing more natural than trying something again later or running away from a fight. You are a 16 year old manchild whose first scene is oversleeping and slacking off from work. Embrace that, and you will become Henry.\n* **Prologue: Not spoiling anything, the prologue is a tad long.** As a new player you might not notice when it actually ends. Let the game railroad you for a little while. Afterwards the game will ask you to go to a town relatively far from your area, that's when the game slowly starts to open up.\n* **Saving: You need to drink \"Schnapps\" to save the game.** You can brew it, steal it or buy it. If you have money, spend it on Schanpps and Bandages in the early game.\n   * u/baksteen-13\\*\\*: **You can sleep in owned Beds to save the game!\\*\\***\n   * u/DraefilkToo: **Map of all save & sleep slots in the game:** [https://www.reddit.com/r/kingdomcome/comments/11ti14q/i\\_mapped\\_out\\_all\\_the\\_sleep\\_save\\_spots\\_i\\_know\\_of/](https://www.reddit.com/r/kingdomcome/comments/11ti14q/i_mapped_out_all_the_sleep_save_spots_i_know_of/)\n   * u/mark_from_ca\\*\\*: **Use “Save&Exit” as you get a free save slot.** Be sure to click “Resume” when reentering the game as it won’t appear in the Load Save list.\n* **Alchemy: Potion-brewing is an immersive minigame and opens up a great variety of buffs.** \n   * u/shrekisloveAO : **A****lchemy really lets you make a lot of mistakes.** For example, when making saviour schnapps, you can completely skip the boiling and grinding, so it goes like this: add wine, add 1 nettle and 2 belladona, finish potion\n* **Eating: You can eat from any cooking pot that other people use for free.**\n   * u/Greeklibertarian27\\*\\*: **Don’t overeat.** Due to my experience with previous games such as stalker anomaly and FNV I always carried copious amounts of food that I had to consume so as to not go stale. However, this constant eating ate both of my stamina and my inventory space. \n* **Training: Captain Bernard can be used for training, just outside Rattay's east gate.** It is crucial that you spend some time training with him. Wake up, train, eat something, train, go to bed. Try to gain a couple of levels with your favored weapon before getting into action.\n   * u/Nast33 **-** **Train with Bernard until you learn Master Strike.** It's the most important technique and that's when you know training is basically over and you've learned everything you need for the whole game. \\[To which I would say, as u/Jinglemisk : \"Come on mate let the guy have some fun!\"\\]\n* **Reading: You will get a quest to learn how to read**. Do it, and steal as many books as you can. Read books while sitting on benches (select them from Inventory). You will gain a lot of skills by doing this.\n* **Clothes and Hygiene: Clothing affects your Charisma, people will treat you as a Knight if you are wearing expensive Armor or noblemen's clothing.** As you travel and fight your clothing will get muddy. Your Charisma checks will be affected negatively by dirt. Wash your clothes and take a bath every now and then.\n* **Looting: Be smart with your inventory capacity.**\n   * u/pouziboy **- For the love of god, don't take everything** (...) I was looting everything and even without any stealing and thieving shenanigans ended up with enough money for life in the middle of the game because I was hauling every single piece of equipment to the shops to sell. Think about the weight to price ratio. That hauberk might seem valuable with price of 700 groschen but it also weighs 20 lbs? Leave it be. I found it's enough to loot things with 100 groschen per 1 lb of weight. Got an item that weighs 3 lbs but only costs 220 groschen? Leave it right there, not worth the hassle. Don't let your greedy lizard brain turn the game into Kingdom Come: Pawnshop Crap Hauling Simulator as I did. As I always do. And will do so with the next game for sure as well.\n* **Bow: Bow is hard to use at first, but very powerful and rewarding.**\n   * u/Noriadin\\*\\*:\\*\\* **If you're really struggling with upping your bow skill and want exp cheese for it (or if you're roleplaying a Henry who would do this), go kill as many livestock in the fields as you can.** Easy to get hits and also a good way to practice your aim. You will also get a pretty small increase in hunting exp from cows and pigs.\n* **Hunting: It is magical to admire the deers, but even better to hunt them.**\n   * u/pouziboy **- Need money? Go shoot some game and then sell the meat**. You can fill your inventory and horse inventory with a few dead animals and then sell all the meat in one or two goes. Much better way of earning than selling every singular dirty piece of underpants you were able to get from dead bandits.\n* **Crime: Use a torch at night, it is a crime not to carry one at night.** People will hear you if you are walking around in Mail Boots. People will see you if you are wearing an orange overcoat. Wear simple shoes and a black shirt when sneaking and stealing. Bribing guards is easier if you have better quality clothing (see above). You can go to jail in this game. People will remember your crimes if you yeet someone and run away.\n* **Stealth (Pickpocketing and Lockpicking): Two great minigames (or one great minigame and ehhhh minigame on consoles) that combine your skill and Henry’s.**\n   * u/frankfooter18 **- Even though you may not want to make your Henry into a thief like character but it will help with certain missions.** Under the inventory menu you can see Henry’s stats which will show you how loud or how visible your clothes are on your character. After the long intro of the game, you will learn stealth from Miller Peshek and he will teach you lock picking and pickpocketing. Lock picking may be very loud if not done correctly so for beginners try a chest that’s in the woods (investigation points, accidents, camps) or at Miller Peshek mill. Try pickpocketing on sleeping NPC but be careful not to get caught in towns by guards. Best if you try it in camps like lock picking chest. When you reach level 5 in stealth, pick the perk that makes you stealth kill enemies and buy a dagger or get one in a chest or pickpocketing. This perk will also help with certain missions as well as getting ride of enemy camps. \n   * u/EvanMcc18 **- Lockpicking has two options Original and Simplified.** This is more for the Console Players. I myself played it on PlayStation before PC. Lockpicking on console is very hard. I would recommend Simplified it still gives a challenge but you won't be getting frustrated breaking Ten Lockpicks on Easy Chests. For PC Lockpicking is basically the same on either simplified or Original.\n* **Maintaining Your Weapons: Use dirt-cheap bandit weapons to practice sharpening your sword at the blacksmith's grindstone.** There is also a chance that doing it wrong will reduce its durability, so use an irrelevant sword and sell it later. If you have the time, sharpen the weapons you have before selling them.\n* **Haggling: After you fill your \"shopping basket\", you will have a chance to Haggle.** You can negotiate for lower buy / higher sell prices. Don't overdo it or they will get pissed off.\n* **Horses: You are given a horse, but you can buy new ones.** You don't keep horses you steal, you have to \"own\" them. After owning a horse, you can dump your Inventory for extra space. Buy horseshoes and tacks to increase its speed. Lower quality horses will get scared in combat.\n* **Travel: You can fast travel between certain locations.** When fast travelling you will encounter people on roads: Travellers, Beggars, or bandit ambushes. A faster horse allows you to run. If you fail escaping the encounter, you can \"manually\" run by them. Do that in the first couple of levels.\n* **Farkle: Learn Farkle, it is extremely easy compared to games like Caravan or Gwent**. It is fun and the perfect way to pass time and earn some extra bucks.\n* **Combat: Combat in this game is half tactics, half equipment; there is nothing more noble and masculine than running away from a fight**.  You can kill 3 Knights if you are tactical. You will get beaten to death by starving peasants if your equipment sucks. If there are at least two enemies, run backwards while engaging them. Getting flanked is brutal in the game because someone you can't see is slamming your back with a hammer. Don't turn around and run, they can tackle you and push you to the ground if you are not fast enough.\n* **Hardcore: Hardcore is the single greatest way to play KCD, but no first-time player should (IMO) be using it.** Hardcore removes the HUD, applies some debuffs, and removes the player’s map marker (so it is impossible to tell where you are just by looking at the map)\n   * u/EvanMcc18 - **Previous experience and Knowledge of Game Mechanics and the World Map really helps with Hardcore Mode.** Without it you can be frustrated very quickly but entirely up to the player.\n* **Maps: Kingdom Come as heavenly cartography.** Learning the map is 10x more important in Hardcore, but rest assured that both the Wiki and interactive maps online will help you out if you are stuck.\n   * u/DraefilkToo - Interactive Map [https://kingdomcomemap.github.io/#2/2048.0/2048.0](https://kingdomcomemap.github.io/#2/2048.0/2048.0)\n* **DLCs: They are fantastic additions and cheaper than pizza.** \n   * u/EvanMcc18 - **(on DLCs). DLC quest options in dialogue are usually coloured blue and marked with an icon.**\n* **Jesus Christ be praised: Audibly say this whenever you walk up to a store, mount your horse, dismount your horse, eating something, anything.**",
        "num_comments": 109,
        "comments": [
            "This is a great idea. To the saving bit I would add that you can sleep in beds to save too",
            "Using a shield with a longsword removes the ability to do combos. I was wondering why I couldn't get combos to work lol",
            "Fyi many quests in this game are timed. So if it seems urgent it absolutely is. The plague (*wink wink*) isn't gonna wait for you to finish hunting hares to start killing people.",
            "Also don't overeat. Due to my experience with previous games such as stalker anomaly and FNV I always carried copious amounts of food that I had to consume so as to not go stale. However, this constant eating ate both of my stamina and my inventory space.",
            "This is probably a really small thing and Im not sure if its worth adding to something like this, but when pickpocketing, do not steal keys as they are not marked as stolen goods. When I stopped stealing keys, all my problems with random stops and searches disappeared.",
            "Stealth: even though you may not want to make your Henry into a thief like character but it will help with certain missions. After the long intro of the game, you will learn stealth from Miller Peshek and he will teach you lock picking and pickpocketing.  Lock picking may be very loud if not done correctly so for beginners try a chest thats in the woods (investigation points, accidents, camps) or at Miller Peshek mill.  Try pickpocketing on sleeping NPC but be careful not to get caught in towns by guards.  Best if you try it in camps like lock picking chest.  When you reach level 5 in stealth, pick the perk that makes you stealth kill enemies and buy a dagger or get one in a chest or pickpocketing.  This perk will also help with certain missions as well as getting ride of enemy camps.  One last thing, like it was mentioned above wear dark clothes, no armor, light fabric clothes etc. when doing stealth.  Under the inventory menu you can see Henrys stats which will show you how loud or how visible your clothes are on your character.  Hope this helps because it helped me and even helping me while replaying the game again!",
            "I'm a brand new player and this is amazing info to get me started. Really looking forward to sinking some hours into this game.",
            "A Woman's lot DLC: Mutt should be fed every day. I typically go to he butcher and stock up on dried meat as it never goes bad and feed him once a day when I wake up. When he does something I like, like bagging a hare or helping in combat, I praise him. He can really make the difference in small fights, and the passive hunting helps a ton as well.",
            "Don't like brewing for the schnapps or anything else? I feel you. Gotta do it anyway. You might be surprised how fun the rhythm is, but just get to level 10, get \"Routine\", and you are set my son.\n\n(it's a perk that lets you skip the process for any recipe you've successfully brewed a potion for.)",
            ">Use Save&Exit as you get a free save slot.** Be sure to click Resume when reentering the game as it wont appear in the Load Save list.\n\nIt does appear in the Load Save list, as long as you are in the main menu. It's just hidden while inside a save (i.e. actually playing the game)."
        ]
    },
    "That is our new mission!!! Straight from Sir Capon": {
        "title": "That is our new mission!!! Straight from Sir Capon",
        "score": 608,
        "url": "https://i.redd.it/lo44ryhw079d1.jpeg",
        "content": "",
        "num_comments": 26,
        "comments": [
            "Its wishlisted since they announced it",
            "it'll probably go top 10 once they announce a release date and get another bite of the press release cherry",
            "I WL'd it the day it was added to Steam.\n\nHonestly, they need more PR if they are looking for that. So many people have never even heard of the first game, let alone the 2nd.",
            "There's 9 games with a release date which are before KCD2. 4 are releasing in 2024. 4 in 2025. The rest of them (12) don't have any estimation yet.\n\nBtw KCD2 is already 30th. Beyond Good and Evil remaster got released. The latest release date for releasing games is 11 Oct, so I'd expect KCD2 release after this one.",
            "Realized I hadnt done this. Im doing my part.",
            "Honestly if you would have asked me if it would be top 10 before the reveal I would've said no because I always thought this game was a super niche one. After that reveal and reaction though? Definitely gonna happen with more info and a release date. I can't wait.",
            "My mowt anticipated game of the year.... but I wont advertise something I havent played",
            "It's still lower then Karlson",
            "Is it in PS store yet?",
            "How about they just announce the release date"
        ]
    },
    "Literally a 0.0000214% chance of happening": {
        "title": "Literally a 0.0000214% chance of happening",
        "score": 243,
        "url": "https://i.redd.it/4dkxofm5yh9d1.png",
        "content": "",
        "num_comments": 34,
        "comments": [
            "Not when my Henry plays .",
            "I hope you pressed F like a man",
            "You should buy a lotterys ticket",
            "No its not. Especially with dice, which will be programmed for matches, higher agility and the perk",
            "All your chances have equal probability. Don't fret.",
            "When luck is truly on your side! Incredible odds.",
            "more like 0,00214\n\njust like any combinations you can have with this much dice",
            "There are enough cheat dice in the game to make it easier.",
            "So there is a chance.",
            "There is no reason not to use weighted dice to guarantee wins. There is no skill to this game, it's just RNG."
        ]
    },
    "Is it worth it waiting for stolen goods to become unstolen?": {
        "title": "Is it worth it waiting for stolen goods to become unstolen?",
        "score": 143,
        "url": "https://i.redd.it/1rogc7c3ng9d1.jpeg",
        "content": "I understand that stolen goods will eventually become not stolen after a certain time period. But is it worth it to even wait and sell to a normal trader or should I just sell them straight to a fence? If you do get more for not stolen goods is it even that much more? ",
        "num_comments": 39,
        "comments": [
            "Just go to another area. Stolen tags are linked to a particular place so stuff you steal in Rattay may not be stolen in Sassau.",
            "I stash it in my trunk for a day or two",
            "Yes. Some things only take a day or two until you can sell them. Or you can sell to a miller.",
            "You can stash stolen items on phesek trunk then you buy it and steal money from him in the trunk is the only way dont bother to wait untill unstolen",
            "The real question is: is it worth for a Christian to steal?",
            "Just sell it to Peshek, max out your lock picking skills, get drunk as fuck and steal the cash he'll make from reselling your goods. He keeps his inventory in his chest that's lock behind a door in the barn next to the main mill.",
            "I suggest you put them on your horse, if you have a bad reputation the guards may randomly search you and take any stolen goods",
            "Little tip, if you get your lockpicking skills up, you can just throw it all in Peshek's inventory chest behind the locked door in the main yard of the mill, just left of the wagon. Leave it in there a few days, he'll sell it all and then you can take his gold from the shop. That's how I made my money for rebuilding Pribyslavitz. Ended up having about 50k extra after rebuilding it completely. Richest bastard in Bohemia ",
            "money is easy to come by once you have a horse",
            "Depends on the value. Sometimes just going to another area will make the alert disappear and I think if your charisma is high enough guards wont even bother you with minor things. However, put high value stuff in your trunk at the mill/an inn because a) it takes awhile for the alert to disappear b) guards will hound you c) some of the most high value stuff can only be found from treasure maps, looted from random NPC enemies, or stolen from townspeople. \n\nSo yes. Worth it. Because eventually you own that stuff or can sell it back"
        ]
    },
    "Brand new to game and accidentally started the Theresa DLC. How do I free myself from this without having to load an older save?": {
        "title": "Brand new to game and accidentally started the Theresa DLC. How do I free myself from this without having to load an older save?",
        "score": 159,
        "url": "https://www.reddit.com/r/kingdomcome/comments/1dr15ej/brand_new_to_game_and_accidentally_started_the/",
        "content": "Y'all. I just started this game. I'm learning how to lockpick and accidentally started the DLC with Theresa. She said \"you sure you want to hear it? It's a long story.\" \n\nI thought it would be her telling me about her bad day.. NOPE. I'm an hour + into this DLC and I'm sorry, Theresa, you're wonderful you really are. You saved our boy Henry by distracting the bandits BUT PLEASE I JUST WANT TO DO THINGS THAT ISNT RUNNING AROUND DOING ERRANDS FOR YOU RIGHT NOW PLEASE LET ME FREE \n\nAny idea how to say \"no thanks, I'll go back to the game\" or am I stuck in this DLC for a few more hours doing errands? \n\nUnrelated - got caught stealing Mathias' dice by his snitch mom. When I got confronted by a guard the dog attacked him. Greedy mf wanted 500g for that. huge nah ",
        "num_comments": 51,
        "comments": [
            "Sometimes in life you may stumble down the wrong path with no way of return. But as is human nature, we must forge on. Many of us have made the same mistake you have, my friend. Do not look to go back for there is nothing for you there. You must journey onwards until you reach the outcome you are searching for.",
            "Sadly, can't. Load and lose progress, or finish the DLC.",
            "Same thing happened to me few days ago. I thought it was pretty funny. She didn't lie about it being a long story. As I didn't know the game mechanics very well it took me a few hours to complete that quest but I learned a lot from it and it was pretty well positioned in the story despite it being the first thing I did.",
            "Don't bother collecting items or farming skill XP. I'm pretty sure it's pretty quick when you focus on moving the story along... I spent far too many hours following my completionist behavior and you don't get any of that stuff at the end.",
            "I actually loved it. My Henry was a high level juggernaut clad in plate able to take on half a dozen armored foes with little sweat. And all of a sudden I get to experience the early game dread again, with Theresa struggling to kill one or two guys in a swordfight and usually forced to rely on tricks, bow and dog.",
            "Its easy : you dont",
            "I made the same mistake, and don't regret it. Plus the rewards are good.",
            "Its funny because I killed I would say 8 or 9 Cumans playing as Theresa, she was a proper badass, and since I gifted her a dagger whilst playing as Henry. She says something like thats kind of you, but I wouldnt know what to do with it Yeah right, medieval Uma Therman",
            "I advice you to do it. It will teach you more game concepts. Think about first part of it as a new tutorial, will be good for you, will help you with Henry.",
            "Just speed through it, don't bother collecting items and looting really because you don't get to keep a single thing Theresa picks up"
        ]
    }
}