{
    "Any tips for professional cook level 1 exam in bc?": {
        "title": "Any tips for professional cook level 1 exam in bc?",
        "score": 20,
        "url": "https://www.reddit.com/r/KitchenConfidential/comments/1dawq01/any_tips_for_professional_cook_level_1_exam_in_bc/",
        "content": "Hello Hello,\n\nJust looking for some help or tips from fellow industry people about professional cook level 1 exam. I've been working in the kitchen for 3 years now at the same place. You know how everything becomes less challenging when you work in the same kitchen 5 days a week for 10-12 hours!\n\nI haven't done culinary school, just dived right in. and its been good so far, learnt a lot of things.\n\nI am planning on challenging professional cook level 1 exam next month. But have absolutely zero clue where to start studying!!!!!!\n\nAs I mentioned, I have no schooling in cooking but am a good learner and learnt to work on all stations and prep in my restaurant within a year and a half!\n\nAny help would be much much appreciated. Any books, websites, anything is appreciated.\n\nAlso, just out of curiosity, how does the whole thing works? I know there's a written exam and a practical. But things like what kind of questions are there in written exam, how many questions, etc. any help pls!!",
        "num_comments": 6,
        "comments": [
            "I pinned the post cause i know how these exams can be and its best to try and get answers from someone who's been through it. You might wanna include your country or state if your in the U.S. so people can help you best. \n\nIn my experience exams like these are usually vocab test. Theyll ask you to explain or demonstrate what this term means and you'll do it.  Next there gonna test you on base skills of cooking. Can you flip, can you cook something without burning, knife skills ect.  They will also ask you history question on the industry. Make sure you know your key players. \n\nTry and see if you have a rubric on what youll be graded on. Thats the best way to prepare. \n\n  \nGOOD LUCK!!!",
            "Hey i just passed the level 1 exam with a 94/100. I think i spent about 15 minutes on it, but I've always been a very fast test taker. Most of the questions are honestly common sense for anybody who has a good amount of professional AND/OR amateur cooking experience. If you are confident in whipping something up from scratch, then I think you will pass without studying.\n\nThat said, I did study a bit and what i studied were mother sauces and their deriatives and stocks. These were not intuitive to me as i have been vegan for almost half my life. I have a ton of sample questions/answers that are almost verbatim to the test. If you would like me to send you anything, lmk.\n\nAlso this is just general advice for multi choice tests, but I will say it in case you don't know: NEVER dwell on a question you don't know. Skip it and come back to it later. Sometimes other questions will even have answers for previous questions!\n\nEDIT: just reread your post and noted you did not go to culinary school at all, this test is VERY by the book. It's also gonna focus on french cooking. As well as terms that may or may not matter in most restaurants. Do you know what a capon is for example.",
            "I suspect from the title that OP is in British Columbia Canada :). And that the exam they are asking about is this one: https://skilledtradesbc.ca/professional-cook-1\n\nAnd also, for the OP: https://skilledtradesbc.ca/sites/default/files/2023-01/professional-cook-1-program-outline-july-2020.pdf\n\nThe assessment criteria is on page 96 or 98, depending on your browser/phone :)."
        ]
    },
    "We lost a good one yesterday. ": {
        "title": "We lost a good one yesterday. ",
        "score": 6991,
        "url": "https://i.redd.it/r432xhfyrx7d1.png",
        "content": "Yesterday this young chef was taken from the world. She was an amazing passionate chef with a love for this world that couldn't be matched. A student up in Chicago training at multiple Michelin star kitchens and coming to work with me in a brand new restaurant. Chloe was 21 and had the potential to do great things in this industry and world. I just want to make sure she gets known for how amazing she truly was. Rest easy chef. ",
        "num_comments": 224,
        "comments": [
            "Chicago chef here. I'm sorry to hear about this. \n\nI do regular popups and farmers markets for charity and donate 10% to a charity of my choosing or someone else's choosing. \n\nWhat would Chloe want me to donate to?",
            "I'd like to add this to this post. I have seen people talking about drugs and stuff And it wasn't that which took Chloe away from this world  I should have made that clear I apologize for that.",
            "Sorry about your friend",
            "Damn, we also lost one yesterday. My condolences 🙏",
            "Chloe was taken from this world too soon. She had so much more to show the world and a hell of a lot of potential in the culinary world. \n\nI'm glad I got to see her a couple weeks ago and give her and Brennan a hug before they left my restaurant. \n\nShe will be missed by all.",
            "21 is so young and the fact that she was taken in a completely random accident is heartbreaking. God, irs so cliche to say but you really dont know how long you or the people you love have on this earth. I hope nothing but peace and healing for the people who loved her",
            "thats far too young.  sorry for your  loss.",
            "RIP Chloe you were a wonderful person and I still can't believe you're gone.",
            "I'm sorry for your loss.\n\n\nWhen I close up tonight I'll give her a clack clack of my tongs in salute.",
            "Rest in peace, girl. Cook for the angels."
        ]
    },
    "Chef Mike on his way to work": {
        "title": "Chef Mike on his way to work",
        "score": 1172,
        "url": "https://v.redd.it/rbwjz2qzbz7d1",
        "content": "Chef Mike gives some helpful advice!",
        "num_comments": 38,
        "comments": [
            "Heard.",
            "Imma sample this shit outta this. I'll never make anything of it but it will be dope at jam sessions.",
            "That guy makes the best corn knobs",
            "This dude preaches the real gospel",
            "Just said yes to a new gig, definitely needed this video.",
            "Heard chef! Love the way he closes that door w no hands lol",
            "The hero we need\n\nEdit: chef mic the life coach not any maga piece of shit lol",
            "This gave me enough motivation for 15 years.",
            "Heard, Chef Mike, can I get a all day",
            "I have a few questions"
        ]
    },
    "Vegan goes to Morton’s.": {
        "title": "Vegan goes to Morton’s.",
        "score": 921,
        "url": "https://www.reddit.com/r/KitchenConfidential/comments/1dlb3s1/vegan_goes_to_mortons/",
        "content": "Our friends invited us to Morton’s Steak House for supper. My wife and I love steaks, so we thought this is going to be great! Get there and our hosts are already seated. After looking over the menu we ask them what they are having. The reply was “we are vegan and don’t like mushrooms, sprouts or carrots”. Wife and I look at each other with the WTF are we doing here look. It was a really rough night as they don’t drink either, I felt really bad for the servers that had to try and accommodate them with what they could muster from the kitchen. To cap off the night they said what they ate wasn’t very tasty or good ! At that stage I kinda went blank, maybe it was the wine, but needless to say it’s the last time we will ever have dinner with them again.",
        "num_comments": 198,
        "comments": [
            "I wouldn't be able to get past them inviting me to a steak house with steak house in it's name.  I'd rather go to a vegan restaurant with them, try new stuff and all of us have a good experience than sit through their struggle, while I guzzle crab cocktail and manhattans, the whole time wondering why I'm even hanging out with people that are this stupid.",
            "Can’t imagine going to a steak house as a vegan then being upset that nothing they like is on the menu. How odd.",
            "Yikes. Vegans who hate mushrooms lol. Vegetarian myself, can’t imagine remaining such without mushrooms",
            "Sounds like their plan all along was an uncomfortable and unenjoyable night. \n\nThat or they are literally stupid. And I say that as someone who was raised vegan ( no longer but that’s besides the point).",
            "What vegan invites their friends to an explicitly *as far from vegan restaurant as possible?* I love taking my non-vegan friends to our fav vegan spots, they always love it!",
            "I'd return the favor and invite them to a Brazilian steak house.",
            "I go to Chinese restaurants and expect them to make me pizza, so I get it. I am that important",
            "The funniest part is that steak houses are super easy to find food as a vegan. Last time I went to Morton’s I had a huge baked potato with sautéed onions and veg ( I was going to skip cuz butter but the server insisted they would use oil) minced garlic, I can’t even remember all the veg sides they brought out (in oil again) salad with balsamic, I was stuffed. \n\nA lot of vegans only look for items listed as vegan options instead of ordering sides and using their brains. It helps of course that half our party were regulars and huge tippers, but I can find something decent to eat everywhere. Managing expectations is key, vegans have to be more excited about visiting with friends than what any restaurant will create for them. Sorry you had such a bummer night at such a great place.",
            ">it’s the last time we will ever have dinner with them again. \n\nWell yeah. Problem solved",
            "\"Why aren't you solving this problem I created and that only affects me?!\""
        ]
    },
    "I see you've played knifey sinky before": {
        "title": "I see you've played knifey sinky before",
        "score": 897,
        "url": "https://v.redd.it/v7vx74qmry7d1",
        "content": "",
        "num_comments": 37,
        "comments": [
            "When I was still a dishie, kitchen never did it, but servers would just throw knives into the water where I couldn’t see them. I used to thrust my hand in as hard as I could to see if I could get a day off.",
            "I don't have this problem anymore. I have had it in the past for sure, but when I implemented a \"you must wash your own knife\" policy, the problem stopped.\n\nMy current battle is the fucking mandolin. I just switched up the menu and it calls for the mandolin a lot. The fucking guys will leave the blade 'open', like not wind the mandolin closed, so the blade sits proud on the sliding/ramp surface, and plop it in the tank. It drives me nuts. \n\nThe thing is, when grab the thing in the tank, it doesn't feel like a knife, it feels like a cambro or something. So, you just grab the bastard and cut yourself. Drives me insane.",
            "When I was a dishie, I must've been a bit extra cause I'd wear two layers of gloves. Didn't feel like burning myself on hot pans off the line or the hot water or the knives. Fuck it I was armored. I also wore two pairs of socks with a plastic between them to keep my feet from making contact with any nasty water that would drip on my shoes or into my shoes. ",
            "This is fucking hilarious. \n\nThread title kills it too.",
            "I yelled at someone for this (manger why are you yelling?) Then she took over the yelling. 🤣",
            "I let my staff know when they are hired the fastest way to tender their resignation is to leave a knife in the sink. Just once. No discussion needed. Off the schedule immediately.",
            "The ‘ol grabby/stabby.",
            "Classic game of shark bite! Throw those fingers in for the handle, watch out for the shark!",
            "I don’t know why this is so funny but it is.",
            "I have worked in many kitchens in my life. Nothing major. Mostly cafe and brunch. Now I’m working in a gas station with a full service kitchen with teenagers. 🙄 god save me. They’re so f*cking stupid. They spray caustic chemicals on porous cook surfaces, dump knives into sinks full of dirty dish water, and can’t be trusted to pick something up that fell on the floor and take it to be washed. The knives aren’t sharp or particularly dangerous but I don’t want to unknowingly grab a dull knife with wet, slick hands. The holding oven is dangerous enough to clean nightly."
        ]
    }
}