{
    "Detect drift with second homing": {
        "title": "Detect drift with second homing",
        "score": 2,
        "url": "https://www.reddit.com/r/klippers/comments/1drcqde/detect_drift_with_second_homing/",
        "content": "I'm using klipper on my own hardware (a bigger gantry robot), and I'm not sure if my z-axis is drifting (rather through mechanical slippage than lost steps). I'd like to home my robot, move around for some minutes, home again and then read the position at which the limit switch was triggered. This should be very close to zero if I have no drift, but could tell me in which direction and how far I'm drifting. \n\nIs there way to get this value?",
        "num_comments": 1,
        "comments": [
            "The klipper-for-cnc project has proper axis probing and work coordinates. Unless you've got a reason to stick to stock Klipper, using it would make it a lot easier."
        ]
    },
    "Xserver XSDL on samsung tab s": {
        "title": "Xserver XSDL on samsung tab s",
        "score": 1,
        "url": "https://i.redd.it/nz65yltf5j9d1.jpeg",
        "content": "Ive been trying to use my old android tablet as a klipper screen for klipper machine and i keep getting x server failed to launch, i tried changing the display number and it still wouldnt work, i got xserver XSDL from the github page of klipper because i dont know why i couldnt find xserver on google playstore ",
        "num_comments": 1,
        "comments": [
            "Its version 1.20.51, 1.20.50 doesnt even install in the tablet"
        ]
    },
    "heater_fan Slows when Hotend Temperature is Set": {
        "title": "heater_fan Slows when Hotend Temperature is Set",
        "score": 1,
        "url": "https://www.reddit.com/r/klippers/comments/1drbdry/heater_fan_slows_when_hotend_temperature_is_set/",
        "content": "Hi, I have Klipper running on octoprint on a Raspberry Pi. It is connected to my 3d printer which has an SKR 3 EZ board.\n\nWhen the printer is on and the hotend is off, the heater fan is on and then when I set the temp to any temp, you can hear the fan slow down. Here is the heater\\_fan section of my config:\n\n\\[heater\\_fan fan1\\]\n\npin: PB5\n\nheater\\_temp: 50.0\n\nI have tried removing the heater\\_temp line altogether and the same thing happens so I believe the issue is coming from elsewhere. Here is the full config file: [https://pastebin.com/HmKhtVCD](https://pastebin.com/HmKhtVCD)\n\nAny help would be great. Thanks",
        "num_comments": 0,
        "comments": []
    },
    "Plz help": {
        "title": "Plz help",
        "score": 1,
        "url": "https://i.redd.it/0gvnc1ze8i9d1.jpeg",
        "content": "I tried to use klipper using an old computer and download Linux on to it but I can’t log to the klipper. I follow the video of modbot to install klipper frimware on a laptop or desktop but I am stuck on minute 13. Can somebody help?",
        "num_comments": 3,
        "comments": [
            "Have you installed mainsail or fluidd?",
            "What address are you using to access it? Mainsail/fluidd will run on port 80. Moonraker runs at 7125 by default. So you'd want to either use the IP of the laptop you run it off directly, without any port. Or, for example, 192.168.0.100:80. If you set up a hostname you could use that as well. (mine, for example, is set as 3dprinter.local)",
            "Mainsail, I think at least"
        ]
    },
    "Can Bus and updates explanation?": {
        "title": "Can Bus and updates explanation?",
        "score": 1,
        "url": "https://www.reddit.com/r/klippers/comments/1dr4j75/can_bus_and_updates_explanation/",
        "content": "Hello. I recebtly got and installed the EBB36+U2C combo from BTT. In the guide that i followed it said that if I want to update klipper ill need to set up the Can network again. Can someone explain to me why is that and how it works? Also what can i update (moonraker, mainsail) without needing to set up the Can again?",
        "num_comments": 4,
        "comments": [
            "sounds like nonsense.  But keep in mind, you *will* sometimes need to re-flash newer firmware onto the ebb36.  Katapult is useful for doing this via the canbus network, rather than having to run USB cables back out temporarily",
            "I got Katapult flashed onto the EBB. So it is safe to update Klipper and moonraker?",
            "as long as you're prepared for the possible consequenses of updating, up to and including config changes, and needing to reflash mcus....yes",
            "[https://canbus.esoterical.online/](https://canbus.esoterical.online/)"
        ]
    }
}