{
    "Ask a Knitter - June 25, 2024": {
        "title": "Ask a Knitter - June 25, 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/knitting/comments/1dnwz9f/ask_a_knitter_june_25_2024/",
        "content": "Welcome to the weekly Questions thread. This is a place for all the small questions that you feel don't deserve its own thread. Also consider checking out our [FAQ](http://www.reddit.com/r/knitting/wiki/index#wiki_frequently_asked_questions).\n\nWhat belongs here? Well, that's up to each contributor to decide. \n\nTroubleshooting, getting started, pattern questions, gift giving, circulars, casting on, where to shop, trading tips, particular techniques and shorthand, abbreviations and anything else are all welcome. Beginner questions and advanced questions are welcome too. Even the non knitter is welcome to comment!\n\nThis post, however, is not meant to replace anyone that wants to make their own post for a question. \n\nAs always, remember to use \"[reddiquette](http://www.reddit.com/wiki/reddiquette)\". \n\nSo, who has a question?",
        "num_comments": 79,
        "comments": [
            "I’m working on a fingering weight raglan t-shirt and, after blocking, my row gauge is way off (20% too many rows/cm). I’m about 1/3rd of the way to the division for sleeves (from the top) and I have done the math so that I can space out my increases and hit the right stitch count at that point but I’m worried the shape will be funky because I will essentially have increased too much too early and then slowed down on the increase rate. Time to just start over?",
            "Hello! I recall seeing someone in this sub mentioning a technique for preventing acrylic knits from getting misshapen/stretching out, but can't remember what it was called to look it up :( Anyone know?",
            "Heya, I'm quite new to knitting (past year) and I was wondering about how much you can do it knitting that can be done in crotchet. The main reason I'm asking is because looking for patterns for specific things the majority of them are for crotchet and I'm struggling to find some knitting ones for similar projects. Any insight is greatly appreciated :D",
            "Any good tutorials for stranded colorwork in 1x1 rib knit flat? Gearing up for The Dude jacket",
            "I feel like this question is asked a ton here, but what would you guys suggest as a good beginner garment pattern that really rounds out basics (ie in the round, assembly, etc) using fingering or sport weight yarn? I'd probably rate myself as a beginner knitter and first time garment maker if it helps!  \n  \n(I am advanced/intermediate in crochet, though, so not a stranger to fiber crafts. Just looking to break out of making complicated, long haul afghans)",
            "Hello my lovely knitting geniuses. Any suggestions for men’s sweater patterns with some shaping? My husband has very wide shoulders and chest but a very narrow waist and boxy sweaters don’t flatter him as much. \n\nI prefer top down raglans but could be convinced to learn anything new!",
            "What do you think the easiest way to knit a sweater sleeve is? Magic loop, DPNs, buy a really small circular?",
            "Hey y’all!! I am working on my first ever “real” knit project, the Best Vest by James N. Watts. I was able to get gauge, but I just chose the wrong size and now I’m worried that it’s gonna end up too small. It’s knit in the round— is there a way for me to easily add more stitches? I’m a couple inches into the ribbing, which doesn’t sound like much but it’s been almost a week of work. I would really hate to frog it if there’s any other way for me to make it any wider. I’m using cotton yarn so idk how much blocking will help.",
            "A lot of raglan patterns have you start with increases every other round, then slow the rate of increase for the lower part of the shaping.\n\nTo keep the raglan \"seam\" line look consistent, switch to every 3rd or 4th round and stick with it, as opposed to doing every 3rd round, then every 4th round, then back to every 3rd round, etc.",
            "I'm guessing the 1/2 crosses make a decrease of some sort. Is there a list of abbreviations somewhere?"
        ]
    },
    "Weekend Look What I Got!!! Thread- June 29, 2024": {
        "title": "Weekend Look What I Got!!! Thread- June 29, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/knitting/comments/1dr70fl/weekend_look_what_i_got_thread_june_29_2024/",
        "content": "Welcome to the weekend stash flash / presents / great thrift store score  thread. \n\nHere is where you post pictures of your stash, yarn purchases, needle sets, or other knitting related pictures. You don't have to post  your whole stash, just any picture that's part of your stash goes here.  We'd love to know what it is and what you're thinking of making with it!",
        "num_comments": 0,
        "comments": []
    },
    "Took all my tiny fingering weight scraps (generally 10g or less) and made this scrappy thang. One of my favorites lately.": {
        "title": "Took all my tiny fingering weight scraps (generally 10g or less) and made this scrappy thang. One of my favorites lately.",
        "score": 130,
        "url": "https://www.reddit.com/gallery/1dr7dja",
        "content": "Pattern is the [Ripple Crop Top Worsted by Jessie Mae](https://www.ravelry.com/patterns/library/ripple-crop-top-worsted). I added a few inches to the body.",
        "num_comments": 4,
        "comments": [
            "I love it and I’m jealous! I’ve been trying to knit a sweater but I lose focus too often. I’m so proud of people who can finish their projects!!",
            "That is so cute! My scraps could never😔",
            "Nice!!",
            "Fabulous!"
        ]
    },
    "Unicorns and rainbows oh my - for the little ones 🌈🦄 ": {
        "title": "Unicorns and rainbows oh my - for the little ones 🌈🦄 ",
        "score": 41,
        "url": "https://i.redd.it/i0oa2t60ni9d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "So after making a sweater for myself I decided to do more... But for the kids. The base I used for both is the Flax sweater by Tin Can Knits. \n\n\nFor the purple unicorn sweater I did the cast on for the after thought collar and then when I got to that... Just picked up the stitches and knitted flat for a boxy hood. I used this guide for reference: https://www.customyarn.com/how-to-add-a-hood-to-your-sweater \n\n\nThe horn/ears/etc are crochet but the whole thing is definitely inspired by a popular character that my 5 y/o is currently obsessed with 😅\n\n\nhttps://www.ravelry.com/patterns/library/flax-dk",
            "**PATTERN:** [Flax DK](http://www.ravelry.com/patterns/library/flax-dk) by [tincanknits](http://www.ravelry.com/designers/tincanknits)\n\n* Category: Clothing >  Sweater >  Pullover\n* Photo(s): [Img 1](https://images4-g.ravelrycache.com/uploads/tincanknits/951918144/FlaxSweater-SC-TCK-8636_medium.jpg) [Img 2](https://images4-f.ravelrycache.com/uploads/tincanknits/951918142/FlaxSweater-SC-TCK-8619_medium.jpg) [Img 3](https://images4-f.ravelrycache.com/uploads/tincanknits/951918143/FlaxSweater-SC-TCK-8615_medium.jpg) [Img 4](https://images4-f.ravelrycache.com/uploads/tincanknits/951918141/FlaxSweater-SC-TCK-8583_medium.jpg)\n* Price: Free\n* Needle/Hook(s):US 6  - 4.0 mm, US 4  - 3.5 mm\n* Weight: DK | Gauge: 22.0 | Yardage: 260\n* Difficulty: 2.48 | Projects: 499 | Rating: 4.80\n\n*****\nPlease use caution. Users have reported effects such as seizures, migraines, and nausea when opening Ravelry links. [More details.](https://www.lizcorke.com/2020/07/26/2020-7-21-ravelry-accessibility/) | *I found this post by myself! [Opt-Out](https://goo.gl/forms/0B8m4Ra8czpw4gzw1) | [About Me](https://github.com/TN-1/LinkRav_Bot/wiki) | [Contact Maintainer](https://www.reddit.com/message/compose/?to=timonyc)*"
        ]
    },
    "Finished my first sweater!": {
        "title": "Finished my first sweater!",
        "score": 464,
        "url": "https://www.reddit.com/gallery/1dqy6lb",
        "content": "",
        "num_comments": 21,
        "comments": [
            "That's your FIRST sweater?!?!\n\nYou are a rock star!!!!",
            "Wow, just wow 😍 well done 👏👏👏",
            "I love how the bands are similar repeat lengths. Kinda like Escher. One step of change for each band",
            "Heck yeah you did! Well done!",
            "omg major props that color work is so clean. Looks great!",
            "Perfect! I am knitting from the age of 7 and cant imagine doing this as neat like yours!! Impressed!! keep going! How long did it take?",
            "Wooooow your stitches are so beautifully uniform! I can only hope to make something that looks that good one day, amazing work.",
            "It's GORGEOUS! I love mosaic work.",
            "I actually looked at some Escher patterns before I started! Couldn't find anything that worked perfectly, but you nailed the vibe.",
            "Thanks! It took about a month and a half (including a ton of time off work)."
        ]
    }
}