{
    "Monthly 'Who's this?' & Merch Auth. Post - June 2024": {
        "title": "Monthly 'Who's this?' & Merch Auth. Post - June 2024",
        "score": 10,
        "url": "https://www.reddit.com/r/kpophelp/comments/1d5i105/monthly_whos_this_merch_auth_post_june_2024/",
        "content": "Welcome to the Monthly Artist Identification and Merch Authentication post!\n\n### Instructions\n\n* Search first! Please try other methods of identifying your image if possible. [Google Lens/Reverse Image Search](https://www.google.com/imghp?hl=en) or [Dupli Checker](https://www.duplichecker.com/) are available options. We know results can be unhelpful, but please make an attempt with these kinds of tools first!\n\n* You might also be able to find more specialized help in specific artist subreddits or those with a specific purpose. Make sure you check the rules of any subreddit before you post or comment asking for help!\n    * r/kpop/wiki/relatedsubs\n    * r/kpopcollections\n    * r/kpopforsale\n\n* Make comments with included images of artists you need identified or merchandise/signatures you would like authenticated in this post.\n\n* In the same comment, state your purpose or question clearly for the help you are seeking.\n\n* Please acknowledge or thank at least one helper who provides an answer in reply to you OR edit your original comment to state you have been helped to signal to others you do not need further assistance.\n\n### Rules\n\n* **DO NOT** troll or intentionally deceive fellow users\n* **DO NOT** derail or wander far off-topic. This is not a general discussion post. Stay focused on requesting or providing help! Mods may lock or remove threads that extend beyond the point of helpfulness.\n* If your question is not answered in a previous Monthly post, feel free to comment again in future posts until you are able to get help.\n\nYou may also provide feedback for ways we can test/improve handling this type of content in the subreddit here or [through modmail](https://www.reddit.com/message/compose/?to=/r/kpophelp). Thank you for your patience while we figure out what system will work best for us!",
        "num_comments": 49,
        "comments": [
            "https://preview.redd.it/650oqfgy9a5d1.png?width=1080&format=pjpg&auto=webp&s=9fe8ad3b644fda9288a11a4d9b6ba8670d9ffafb",
            "Got [this](https://twitter.com/912daze/status/1799276840764539265?t=dK5Yt7bwtvTmgVQq7P2oFw&s=19) RM pc as a freebie from my local record store without buying his album and just wanna find out where the picture is from. Don't even care if it's fanmade or not just want to solve this mystery!",
            "I hope this counts as a \"Who's This?\" if not I'll just make a whole post I guess. I have a very r/tipofmytongue type of request, but it's Kpop related so I'll ask here.\n\nSo earlier this year/maybe last year I saw a video on twitter of a fan screen recording their fansign video call with a certain female idol. She has a note I think that has written out in Korean something like \"Can you call me yeoboseyo without honorifics?\" and the member says something like \"No I don't like these kinds of games you should just ask me to call you yeobo\" and then stares into the camera and says yeobo twice.\n\nI don't know who this idol was. I remember she was wearing pink and she had black shoulder length hair ~~that was done with large curls. I think I remember looking her up at the time and she had recently left the group she was a part of. That's a huge maybe though I may be misremembering~~. (I guess that part came to me in a dream)\n\nDoes anyone have any idea what video I'm talking about?\n\nEDIT: OKAY I think it was Gaeul from IVE I'm like 99% sure, but I still haven't found the video lol\n\nEDIT 2: I FOUND THE VIDEO FOR ANYONE THAT CARES [https://x.com/GAEULDATA/status/1715352110366417087/video/1](https://x.com/GAEULDATA/status/1715352110366417087/video/1)",
            "Does anyone happen to recognize [this photocard](https://ibb.co/vwxpbdS) that is in Aki's phone case?\n\nHe is a huge fan of Bambam (GOT7) but I couldn't find any BB photocards that look like that.",
            "https://preview.redd.it/eyitaj0doq5d1.jpeg?width=3024&format=pjpg&auto=webp&s=4a5363ec1015d2975e1e2600aa69a532fe3b3c6c\n\nHello! I was at Ttukseom Hangang park when I noticed these 3 kpop idols, but not sure of who they are! I'm thinking maybe they are part of a subunit? Thanks!",
            "https://preview.redd.it/ag3kvzc5944d1.png?width=720&format=pjpg&auto=webp&s=481792c3893c1b195cfaaf9b962443882aaf1b07",
            "I was in Sydney on Monday and saw this young man filming his latest music clip.  Can anyone help me please?  I'd like to see the finished music clip when it's done.  Greatly appreciated.\n\nhttps://preview.redd.it/1dzxcwf0y06d1.jpeg?width=585&format=pjpg&auto=webp&s=d277b5309a76ce6c48efdfa1202356c7e8a6ff47",
            "https://preview.redd.it/vdgertxu9a6d1.jpeg?width=1170&format=pjpg&auto=webp&s=abe7e675f800ac6b748cb7b856c22aba20eec0f0\n\nwho is this?",
            "https://imgur.com/a/Sjgkfsk\n\ndoes anyone know who that is on the cover?",
            "Does anyone remember where [this](https://twitter.com/JIGUMI_18/status/1718432331198017831/photo/1) (the first pic) picture came from? I know this is from the one the story concert but was this angle captured during the concert?"
        ]
    },
    "New Post Flairs: 'Advice', 'Merch', and 'Research' are now available!": {
        "title": "New Post Flairs: 'Advice', 'Merch', and 'Research' are now available!",
        "score": 20,
        "url": "https://www.reddit.com/r/kpophelp/comments/1dey54e/new_post_flairs_advice_merch_and_research_are_now/",
        "content": "Hey Helpers!\n\nOver in r/kpop we just posted a new special Town Hall that is focused only on the Flairs we use to help organize our posts based on content categories.\n\n**[Link to r/kpop's 'All About Flairs' Town Hall](https://www.reddit.com/r/kpop/comments/1dexags/town_hall_all_about_post_flairs_june_2024/)**\n\nWe included announcements for new flairs here on r/kpophelp and also on r/kpoppers. The following is the section relevant for this subreddit.\n\n***\n\n## NEW FLAIRS!\n\n\n* **Advice** - This flair is replacing ‘Discussion’. We want to emphasize that r/kpophelp is not a general discussion subreddit. ‘Advice’ will be for users seeking advice for things like auditioning, concert preparation, those struggling with parasocial issues, etc.\n\n* **Merch** - Any questions related to the logistics of buying K-Pop products and merchandise should use this flair. Where to buy, shipping issues, legitimacy/reliability of vendors, or other logistical issues related to merch can use this flair. Remember that buying/selling products is not allowed here and that merch authentication should be done in the Monthly post pinned at the top of the subreddit.\n\n* **Research** - Academic surveys related to K-Pop or fandom topics.\n\n***\n\nModerators will be monitoring the use of these new flairs to see if there is any further confusion and need for more adjustments. All feedback is welcome! We still have upcoming plans to properly overhaul the rules, but getting these new flairs active is something we wanted to take care of first!",
        "num_comments": 0,
        "comments": []
    },
    "Is it strange for a male to go to a boy group fansign?": {
        "title": "Is it strange for a male to go to a boy group fansign?",
        "score": 192,
        "url": "https://www.reddit.com/r/kpophelp/comments/1dqmxae/is_it_strange_for_a_male_to_go_to_a_boy_group/",
        "content": "Just what the title says. The group in particular for me that I would like to attend is SKZ, would they be caught off guard/or find it strange for me (straight male) to attend their fansign? Any advice would be amazing please and thank you all!",
        "num_comments": 84,
        "comments": [
            "No. I think many boy groups actually find it to be a nice change of pace in a way. (Seconding that they’d find it refreshing.) If you like a group and have the chance to go, then you should go. \n\n(Also a guy fan here as well.)",
            "I’m a male fan who attended an Ateez fansign in Korea and personally it was an amazing experience! \n\nI wouldn’t say they acted differently outwardly to me because of my gender, though. \n\nDo keep in mind that they spend almost 24/7 with their other male group mates so if anything, they may feel more casual around you.",
            "Every boy group I've ever even casually followed likes to know that men are also their fans. Any artist would want to know that their work appeals to everyone.",
            "S Coups from Seventeen has said he went to a Big Bang fansign before becoming an idol",
            "Not at all!",
            "They'd absolutely love it. SKZ love all Stay.",
            "I'm not a Stay but i get a lot of reels from skz, fancalls, reactions, etc. They seem like genuine boys, very open minded too. They got  a background of supporting everybody too, whatever their gender or sexual orientation so like I doubt they'd be super judgemental. I think as long as you don't appear like a sasaeng or an asshole they'll welcome you and laugh with you and everything.",
            "They'd probably love it!",
            "They might find it refreshing",
            "Would it be weird for you to go to a Metallica, or Skillet, or any musicians fansign?\n(assuming they have them lol) \n\nNah, music is music and it speaks to all of us no matter our identity. Go and have fun!!"
        ]
    },
    "songs with “baby girl”": {
        "title": "songs with “baby girl”",
        "score": 20,
        "url": "https://www.reddit.com/r/kpophelp/comments/1dr0ivg/songs_with_baby_girl/",
        "content": "hi guys i need your help pls🙏🏻🙏🏻🙏🏻\n\ni’m making a playlist of songs that have “baby girl” in their lyrics\n\nso far i have:\n\nexo - tempo\n\ntvxq - whatever they say\n\ncan u think of any more? thanks in advance🫶🏻\n\npls also sign my petition that both bgs and ggs should slip in at least 1 baby girl per song thanks",
        "num_comments": 25,
        "comments": [
            "call me baby - exo",
            "EXO - Call Me Baby\n\nNCT 127 - Sticker",
            "Lee Hyori - U-Go-Girl\n\nJay Park - Taxi Blurr (Feat. Natty of Kiss of Life)\n\nKard - Hola Hola\n\nU-Kiss - Man Man Ha Ni\n\nShinee - U Need Me\n\nBigstar - Baby Girl",
            "XG - Mascara",
            "A couple of my faves:\n\nShinee-Hello (Key singing “baby baby baby girl” hooked me so hard on that song!)\n\nUNVS-Sand Castle (in the chorus they sing “baby girl don’t let me drown”)",
            "Ruby - WOOZI ❤️",
            "EXO - The first snow\n\nThe boyz - Just u\n\nSuper junior - bonamana\n\nB1A4 - what's happening \n\nU-kiss - I'm not easy",
            "Here is what I found\n\n* 2022-06-29 XG MASCARA MASCARA\n> **Baby girl** don't you ever be\n* 2021-03-17 THE BOYZ Breaking Dawn PRISM\n> All eyez on you **baby girl**\n* 2021-03-17 THE BOYZ Breaking Dawn HUSH\n> Hush babe Oh **baby girl**\n* 2020-03-03 CRAXY My Universe Aria\n> anytime anywhere **baby girl**\n* 2019-01-16 ASTRO All Light Heart Brew Love\n> 똑똑 흘러내려 Oh my **baby girl**\n* 2018-03-12 APRIL The Blue Angel Song\n> I want you **baby girl** 넌 나만의 **baby girl**\n* 2012-06-28 SISTAR Loving U Push Push (DJ Rubato remix)\n> 난 뭔가 다른걸 Sexy 한 **Baby Girl**\n* 2012-05-22 G.NA BLOOM Green Light (feat. Jay Park)\n> (Hey **baby girl** 니가 맘에 들어\n* 2011-08-09 SISTAR So Cool Push Push\n> 난 뭔가 다른걸 Sexy 한 **Baby Girl**\n* 2011-02-16 F-ve Dolls Charming Five Girls 잘났어\n> 난 너에 **Baby girl**\n* 2010-06-03 SISTAR Push Push Push Push\n> 난 뭔가 다른걸 Sexy 한 **Baby Girl**",
            "Enhypen's Let Me In",
            "LISTEN GIRL (JOHAHAE) BABY GIRL (SARANGHAE)\n\nSuJu’s Bonamana!"
        ]
    },
    "the silliest/funniest idols": {
        "title": "the silliest/funniest idols",
        "score": 14,
        "url": "https://www.reddit.com/r/kpophelp/comments/1dqxqk3/the_silliestfunniest_idols/",
        "content": "Looking for idols who are born to be silly and funny, and never fail to make you laugh.",
        "num_comments": 34,
        "comments": [
            "Eunkwang, Changsub (all of BTOB though)\n\nShownu, unintentionally hilarious (all of Monsta X together though too are hilarious)\n\nMijoo \n\nHaechan (NCT)\n\nEunseo, Dayoung (all of WJSN really as well actually)",
            "Beomgyu!!!",
            "Lily from NMIXX 😭",
            "Seventeens BSS! Seungkwan, Dk, and Hoshi",
            "All of Mamamoo. I will watch their weekly idol episodes, their drunk livestreams, and their old variety show appearances for laughs when I need a good belly laugh. Even their 10th year anniversary live was filled with gold 😂",
            "fromis_9 Jiwon",
            "Twice 😂😂 they always make me laugh, and Yuqi from I-dle",
            "all of boynextdoor- especially jaehyun!!",
            "Dahyun",
            "Dreamcatcher Siyeon"
        ]
    }
}