{
    "Min will be doing an AMA on r/kpop this Tuesday, July 2 at 9:00 AM KST": {
        "title": "Min will be doing an AMA on r/kpop this Tuesday, July 2 at 9:00 AM KST",
        "score": 228,
        "url": "https://i.redd.it/wnjk3yi09c9d1.jpeg",
        "content": "",
        "num_comments": 24,
        "comments": [
            "I just know i'll end up missing this but i hope she reads this thread so she knows i love her and she's the reason i got into kpop :\")",
            "OMG Min!!! I'm so happy to see her. IDK what to even ask, I just hope she is doing well.",
            "Holy cow, Ill have to stay up to ask her stuff!",
            "Subreddit lore will be revisited again with her AMA.\n\nI'm so happy she came back!",
            "This is so cool!!! So glad I have a free day on Tuesday so I can stay up late asking questions hehe.",
            "I miss Miss A. The group that got me into kpop and so perfectly.",
            "She's my bias. I can't wait.  I saw her at KCON and she was so shy.",
            "Is she logging back in on her account? ",
            "I love this woman so much since day 1 in K-pop (got into K-pop due to missA. She have always been my bias ",
            "Miss A is my ult group, by far my favorites over the years. I miss the so much, happy that Min is doing well."
        ]
    },
    "/r/kpop Top Ten Tuesdays Voting: Schedule for 2nd Half of 2024": {
        "title": "/r/kpop Top Ten Tuesdays Voting: Schedule for 2nd Half of 2024",
        "score": 48,
        "url": "https://www.reddit.com/r/kpop/comments/1do649x/rkpop_top_ten_tuesdays_voting_schedule_for_2nd/",
        "content": "------\n\n# [Link to the Google Form survey](https://forms.gle/eRgXiANpXwymuYZw7)\n\n* **Rank (up to) the Top 20 artists that you want to see get a Top Ten Tuesday in the second half of 2024**. #1 gets 20 points, #2 gets 19 points, #3 gets 18 points, etc.\n\n* You can list <20 artists if you want.\n\n* Upvoting/Downvoting someone else's ranking won't affect the results.\n\n* Groups and solo artists are considered separate. Sub-units are included with their group's TTT.\n\n* Artists that currently have less than 15 songs are not eligible (OSTs, remixes, alternate versions, and instrumentals do not count towards the 15).\n\n* The schedule for the Second Half of 2024 will be decided partly by the public vote, and partly through my personal selections\n\n-----------\n\n* **You are highly encouraged to look at & use this helper sheet while voting: https://docs.google.com/spreadsheets/d/14ui4bbfoduWeLX7PC-GQe53I3IQyesSTMrSuw0i89YQ/edit?usp=sharing.** (The spreadsheet contains a list of notable artists that have not received a TTT yet, as well as artists that have released a lot of notable songs since their last TTT and/or have not had a TTT in a long time.)\n\n\n* Due to the \"must be a 1.5+ year gap between an artist's previous TTT and their next TTT\" rule, all artists with a TTT from July 2023 onwards are ineligible to have a TTT in the second half of 2024. **This is a list of ineligible artists: https://pastebin.com/paA3Tnun**.\n\n--------\n\n**Schedule:**\n\nJuly 2nd: Your Personal \"Most Underrated\" Artists\n\nJuly 9th: Your Personal \"Most Overrated\" Songs\n\nJuly 16th: NewJeans\n\nJuly 23rd: Your Top Japanese K-Pop Songs\n\n*(Full schedule can be found in the spreadsheet linked below.)*\n\n-------\n\n\n* **[Google Spreadsheet with all past results and full schedule](https://docs.google.com/spreadsheets/d/1Fpmk77a41Byd9hHip4p6tVkUxPV_0wLLTDxTXW90ltU/edit?usp=sharing)**\n\n* [Link to the IVE results thread](https://www.reddit.com/r/kpop/comments/1dnsebm/rkpop_top_ten_tuesdays_results_ive_2024/)\n\n----------\n\n# **Want to be notified for specific Top Ten Tuesdays in the future?**\n\nIf there are some Top Ten Tuesdays in the future that you are interested in participating in and don't want to forget about, **please fill in the Reminder Form here: https://forms.gle/m4d9gDWPuVc3tgKN9**. You can choose which artists you want to be notified for, and what specifically you wish to be notified for as well.\n\n\n---------\n\n# **Interested in doing more song rates?** \n\nCome join r/kpoprates, where we have K-Pop song rates on a regular basis! Here are the currently ongoing rates:\n\n* **[The 1st K-Pop Grab Bag Rate!](https://www.reddit.com/r/kpoprates/comments/1dclaaq/the_1st_kpop_grab_bag_rate/)**",
        "num_comments": 37,
        "comments": [
            "ELO my man, I tried my best to get your songs rated",
            "1. Xdinary Heroes\n2. JUST B\n3. Moonbyul (Mamamoo)\n4. AB6IX\n5. TAN\n6. Drippin\n7. Tempest\n8. Monsta X\n9. Highlight/Beast\n10. E'LAST\n11. CIX\n12. TXT\n13. Twice\n14. NCT 127\n15. NCT Dream\n16. Enhypen\n17. Yena (ex-IZ*ONE)\n18. DKZ\n19. aespa\n20. DreamNote\n\nHMs: TVXQ, N.Flying, The KingDom, TRI.BE, The Rose, Chungha, STAYC, NiziU, Verivery, Hwasa\n\nWith the rise of Gen 5 boy groups, our opportunity to rate Gen 4 boy groups is starting to close *rapidly*, and there have been a lot of Gen 4 boy groups with a lot of songs that have been around for a while that still have not gotten a TTT yet, so I'm definitely pushing for them! For people unfamiliar with many of these Gen 4 boy groups, this could be an opportunity to get to listen to some new songs and discover some new favorites.",
            "1. TEMPEST\n2. TAN\n3. Omega X\n4. Lightsum\n5. Cignature\n6. VANNER\n7. WEi\n8. Drippin\n9. Jo Yuri\n10. Yuju",
            "1. Sejeong\n2. Xdinary Heroes\n3. Monsta X\n4. TVXQ\n5. Tempest\n6. aespa\n7. TAN\n8. The Kingdom\n9. Jo Yuri\n10. AB6IX\n11. j-hope\n12. Solar\n13. KNK\n14. NiziU\n15. OmegaX\n16. TXT\n17. Yuju\n18. Drippin\n19. E'last\n20. EPEX\n\ngetting my girl my wife the light of my life sejeong a TTT attempt #2",
            "1. Cherry Bullet\n2. Secret Number\n3. TRI.BE\n4. D.O.\n5. B.I\n6. Jeon Somi\n7. Chungha\n8. The Rose\n9. Wendy\n10. Yena\n11. Twice\n12. TXT\n13. ICHILLIN\n14. DreamNote\n15. PinkFantasy\n16. TAN\n17. TVXQ\n18. Aespa\n19. STAYC\n20. NU'EST",
            "1. Xdinary Heroes\n\n2. Monsta X\n\n3. aespa\n\n4. CIX\n\n5. (G)I-DLE\n\n6. H1-Key\n\n7. NCT 127\n\n8. xikers\n\n9. STAYC\n\n10. Twice\n\n11. TAN\n\n12. Choi Yena\n\n13. JUST B\n\n14. WOODZ\n\n15. Enhypen\n\n16. The KingDom\n\n17. Chungha\n\n18. KNK\n\n19. j-hope\n\n20. Agust D",
            "1. TVXQ\n2. AB6IX\n3. Cherry Bullet\n4. Baek Yerin\n5. NU'EST\n6. CIX\n7. The KingDom\n8. Xdinary Heroes\n9. Sejeong\n10. Monsta X\n11. NCT 127\n12. NCT DREAM\n13. Verivery\n14. EPEX\n15. Verivery\n16. Enhypen\n17. Moonbyul\n18. TAN\n19. Tempest\n20. DRIPPIN\n\nIf you don't know who to put on your list, consider TVXQ, so we can give them another TTT please and thank you!",
            "1. Mino\n2. Nu'est\n3. Yerin Baek\n4. Wonder Girls\n5. 2NE1\n6. Twice\n7. NCT 127\n8. (G)I-DLE\n9. Aespa\n10. StayC\n11. Chungha\n12. Onlyoneof\n13. Taeyeon\n14. EXID\n15. CLC\n16. Miss A\n17. T-ara\n18. Tan\n19. Sejeong\n20. TVXQ",
            "1. Hwasa\n2. Solar\n3. Xdinary Heroes\n4. Moonbyul\n5. Wheein\n6. OnlyOneOf \n7. aespa\n8. Ha:tfelt\n9. The Kingdom\n10. Pixy\n11. ONF\n12. TVXQ\n13. Monsta X\n\nAlso I would love a ranking of Christmas Songs!\n\n\"Funny songs that still slap\" would also be a great category, like Mamamoos Taller Than You, Orange Caramels Catallena, Block Bs HER etc.",
            "1. Young K\n2. Day6\n3. Xdinary Heroes\n4. Agust D\n5. Stray Kids\n6. (G)I-DLE\n7. WOODZ\n8. TXT\n9. GOT7\n10. Taemin\n11. Mamamoo\n12. The Rose\n13. Hwasa\n14. ENHYPEN\n15. MONSTA X\n16. Heize\n17. Chungha\n18. UKISS\n19. Ash Island\n20. Gemini\n\nI threw in some that I know have nowhere near a chance to get picked but! May as well try"
        ]
    },
    "TAN Changsun announced that each member will go their separate ways following their final schedule. He will step down as the leader and leave the idol industry for now, while keeping the possibility of returning with TAN in the future open": {
        "title": "TAN Changsun announced that each member will go their separate ways following their final schedule. He will step down as the leader and leave the idol industry for now, while keeping the possibility of returning with TAN in the future open",
        "score": 418,
        "url": "https://x.com/nugupromo/status/1806863220319084786?t=TDLCHi_LYNnLLwDqIPIuTg&s=19",
        "content": "",
        "num_comments": 42,
        "comments": [
            "The messages from the members are all so heartbreaking.  I have adored them since debut and they have such a solid discography.  I am thankful for the great music and performances they gave us.  Its so sad that their company fell apart.  I hope they all land well and are able to reunite in the future if they all wish to come back to the industry.",
            "Cant believe that they will stop promoting as a group. I feel bad for jaejun because this is already his 2nd debut after c-clown.\n\nedit: change of word",
            "Man this is a tough pill to swallow. TAN was such a great project group and I think they had a ton of potential as a permanent lineup had their company not screwed everything/everyone over in order to save someone else. Ill keep hoping the members can reconnect at an agency willing to take them all in, they had something really special going.",
            "They have one of the best debut songs ever imo. Shame they werent able to find success, they were very talented and got screwed again. I wish them all the best",
            "It sounds childish for me to say, but this is genuinely unfair to the members. Theyre such talented people and their music was amazing. They really deserved more recognition than they got. Its such a loss as a fan too. \n\nIt really is terrible that it came to this. I really hope they find success in whatever they decide to do in the future. Might be too optimistic to say but i hope we see them together again someday",
            "Absolutely love TAN dududu and Walking on the Moon are some of my favorite kpop songs so I'll miss them, but I hope in the future they can reunite because this group is too special to be forgotten.",
            "Losing TAN and Pixy in the same month is too much Stanning nugus is so depressing",
            "So glad I got the opportunity to see them grow musically, with their last two releases being top tier!The uncertainty around their renewal was always there, so this isn't a surprise, but it still sucks. I wish the members everything of the best, their hard work didn't go unnoticed. Going to sad bop to Fix You for the rest of the day!",
            "This really sucks. They are so talented and I really like their music. \nI imagine Changsun might enlist. Hopefully, those who want will get a chance to get together again or continue on to do their own things in the industry.",
            "Its sad, although I didnt follow them closely, I enjoyed their title tracks and a few B-sides (Heartbeat was one of my most-played songs last year). This was a second (or more) chance for basically all the members, especially Jaejun, given its his 5th chance by now (C-Clown, TREI, Mixnine and JT&Marcus), which also made me consider that he is still quite young and basically spent almost half his life in the industry trying to chase his dreams. I feel bad for all the guys, but I feel the worst for him. \n\nI hope they can reunite one day, thank you for a solid singles run, TAN  <3"
        ]
    },
    "TWICE - Japan 5th Album: DIVE (Individual Album Covers - Dahyun, Chaeyoung, Tzuyu)": {
        "title": "TWICE - Japan 5th Album: DIVE (Individual Album Covers - Dahyun, Chaeyoung, Tzuyu)",
        "score": 59,
        "url": "https://www.reddit.com/gallery/1dr9oig",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Miss Kim Dahyun? F.I.L.A.  Tzuyu's eye makeup is so pretty ",
            "They're all so gorgeous. Twice is just the prettiest girl group.",
            "Long dark hair chae "
        ]
    },
    "Naevis (aespa) Performs Solo Stage At aespa’s 2024 Live Tour - SYNK : PARALLEL LINE": {
        "title": "Naevis (aespa) Performs Solo Stage At aespa’s 2024 Live Tour - SYNK : PARALLEL LINE",
        "score": 48,
        "url": "https://x.com/wntrult/status/1807007754873114865?s=46&t=LZqX2YbOmFAPVmn8OODsCA",
        "content": "",
        "num_comments": 9,
        "comments": [
            "The way SM is insisting on that debut...every company wants a piece of the AI/Virtual idol pie I guess. \n\nIt wasn't bad by any means, even though I really favor real people performing on stage, but not sure I would have liked it instead of an extra aespa song in the concert, guess it was used instead of another VCR or dance crew segment for the girls to change outfits and take a breath  in this case",
            "why arent they learning from the fact the most popular virtual group are real people who do funny stuff and interact with fans like vtubers??? why are we watching just a dancer with an ai song?",
            "The crowd laughing at the reveal is so funny to me \n\nThe song sounds aight, would rather just more actual aespa music",
            "Wasted an aespa track for this? As a MY I have absolutely no interest in this Naevis debut or virtual idols, in general. Real performers(aespa) and their talent is what I enjoy and connect to. Kind of hoping this reception will give SM a hint that its not wanted or at the very least keep it away from aespa moving forward.",
            "disappointed that it's just a deepfaked cgi face into a dancer body. thought it would be a full on mocap. meh.",
            "ai entering the kpop scene in this way(or any way) is such bullshit",
            "This stuff is so stupid, these holograms do nothing for me.  \n\nI've seen many concerts in the movie theater and I much prefer that if I can't see a real person to seeing this stuff.",
            "I get why many arent exactly on board with this, but from my vantage point, its just a good closure IF they continue with a different multiverse from here on out. She did deserve a moment to shine for all her sacrifices if they shelf this part of the lore forever ",
            "What a time to be alive"
        ]
    }
}