{
    "r/kpopthoughts Biweekly Banner Contest": {
        "title": "r/kpopthoughts Biweekly Banner Contest",
        "score": 6,
        "url": "https://www.reddit.com/r/kpopthoughts/comments/1dlxr4k/rkpopthoughts_biweekly_banner_contest/",
        "content": "Welcome everyone, to [r/kpopthoughts](https://www.reddit.com/r/kpopthoughts/) banner contest! This occurs every two weeks on Saturday. Congrats to our last banner winner!\n\n**WHAT IS IT?**\n\nEvery two weeks, the members of this sub can comment and vote on a group or soloist that will become the sub’s banner for two weeks. You guys get to decide who the mods showcase on our banner.\n\n**HOW DOES IT WORK?**\n\nIf you have a group or soloist in mind, comment their name below, and only their name. If you see a group or soloist you’d like to showcase, upvote that comment to essentially cast your vote. This post is randomized through contest mode, which means the comments are shuffled randomly and only the moderators can see the number of votes on each comment.\n\nAfter 24 hours, this post will be locked, and the mods will crown the winner for the next two weeks in the sub’s banner.\n\n**WHAT IF I WANT TO SUBMIT MY OWN ARTWORK?**\n\nIf you have a banner you made and would like to submit it, [please click here to upload it](https://docs.google.com/forms/d/e/1FAIpQLSfJXMXX-f_GfHjV1gvzPupDaJJOzosfMxWO6F0E-AZDUJxerw/viewform?usp=sf_link). Take into account that it must be Original Content, and that we will need a desktop and a mobile version - the sizes for each below:\n\n* Desktop banner: 1920 x 384 px\n* Mobile banner: 1250 x 490 px\n\nHave fun and good luck!",
        "num_comments": 11,
        "comments": [
            "JIMIN as he will release his second album in the next few weeks.",
            "Jaejoong - this legend is releasing his 20th anniversary album in two days!",
            "NewJeans",
            "STAYC",
            "IVE",
            "Red Velvet",
            "Twice",
            "kiss of life",
            "Hey thinker! Great post up there. Make sure your post title is clear. One and two word titles are not allowed. Use paragraphs to make it easier to read. Please make sure to read the rules before posting.  Mod applications are currently open! Apply [here](https://forms.gle/hEgqsrBTGX897GFaA)!\n\nYou can fill out our [Feedback Form](https://docs.google.com/forms/d/e/1FAIpQLSfI0PsMn4dqfMlgqFFfsMhLr4-lFNJpEumIf7RKmuiwyDBOwA/viewform?usp=sf_link) while you wait for some comments. Thank you and happy posting!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/kpopthoughts) if you have any questions or concerns.*",
            "[removed]"
        ]
    },
    "KpopThoughts Weekly Thread - (June 24)": {
        "title": "KpopThoughts Weekly Thread - (June 24)",
        "score": 4,
        "url": "https://www.reddit.com/r/kpopthoughts/comments/1dncgpo/kpopthoughts_weekly_thread_june_24/",
        "content": "Hi everyone!\n\nThis post is a weekly thread for any thoughts you might have that feel don't need a post of its own but still would like to air to the world. All rules apply, but you can discuss anything you want related to Kpop. \n\nPlease be respectful and have fun!",
        "num_comments": 11,
        "comments": [
            "bighit sleeping for days and not giving preorder links even after geffen getting blasted all over national international TV  instead giving photobook preorder link  .......... and A DAY LATER when only one day is left they dropped the links like  here now get off my back ..  bighit is as much of the culprit as geffen is for mistreating Jimin.",
            "Red Velvet has a different vibe to me than the rest of the SM groups, in a very unique and cool way. \n\nSM, treat your artists right, losing any artist is losing brand identity",
            "I'm a fan of TripleS but I feel so bad for Sullin. Her lack of Korean language is sad to see in their videos. She always looks very confused and sometimes walks away from the camera to avoid an interview,  but I can only hope the members talk with her a lot behind the scenes and make her feel welcome. I'm looking forward to seeing her improve more but I wish Modhaus had her more equipped to debut rather than throwing her out to the public.",
            "Does anyone know what Koreas society system is called? Random I know, but I remember I read an article years back and the topic had something to do with talking about the youth of S. Korea and S. Koreas societal system (the whole dynamic and hierarchy of power thing between ages and the proper terms to be called), but I recently thought about it again, but cant remember the name it was called. Ive tried searching for the article again based off what I remember so I could find it, but I keep coming up empty. It was on a kpop site, and also talked about it in groups, but I cant even find it in that context either.",
            "Does anyone have a good caddy suggestion?",
            "Boy groups releases are being odd to me this year. I've been preferring the pre releases, secondary promoted songs and remixes over the title tracks. How long will this go on? Only kingdom has escaped this with flip that coin having the slightest edge over energy in terms of which I like more. Boy next door as well with earth wind and fire.\n\nTxt: deja vu remix > original deja vu\n\nAteez: work remixes >>>>> work original\n\nZerobase1: sweat > feel the pop\n\nTws: oh mymy and hey hey > plot twist and if I'm s\n\nXikers: red sun > we don't stop\n\nEvnne: ko > ugly (jury is out on badder love depending on if they promote I love u)",
            "I actually like Lisa's new song (Rockstar). Not enough to put it in my playlist but I appreciate the musicality. I know a lot of people complain that, just like her BP era, the song is repetitive, has poorly written lyrics, or is often empty in substance. While those facts may be true, the song itself is also just not bad in general. Despite the lacking lyrics, whoever produced the song definitely had a better vision.\n\n  \nParts that I like about it:\n\n- The audio mixing. It is loads better than what Lisa gets in YG. The way the song was edited definitely enhanced her vocals to the point that I can appreciate her vocal tone more. Yet also not to the point where you can complain that it is heavily autotuned. It's tasteful autotune, if I'm putting a phrase to it.\n\n- The rhythm and the beats. This is what people say is often repetitive or empty-sounding but I quite like the \"minimalistic\" vibe of the song. I also like how you can tell that despite going with a similar route, the \"swag\" of the song sounds way different than YG's usual composition (or Teddy's, specifically).\n\n- The overall vibe. Comparing it to her YG song (Money and Lalisa), I definitely like Rockstar a lot more. Money and Lalisa had a certain \"shoutiness\" to it (I can't quite find a word to explain it), but it's basically just a bunch of \"I am rich! I am famous!\" amplified by the grating beats that it was put over. Rockstar has a more 'chic' approach to the same sentiment like \"I'm rich and famous, and?\". Idk if that makes any sense but Rockstar just feels more like a song that someone who doesn't have anything to prove would put out, someone so comfortable in their fame that they don't need to shout it to the world.",
            "i feel like kpop fans are becoming really delusional because even if your fav doesnt lip sync they still use pitch corrector, autotune or a really loud backtrack.",
            "I don’t completely stan RIIZE but one thing I keep seeing on Twitter are briize trying to convince everyone (and probably themselves) that Wonbin hates his short hair. Like “they forced him to cut it” “he doesn’t post as much because he doesn’t like his hair now” etc. I find it funny because it’s not that deep and Wonbin seems like he is fine with it. He even says it’s more [comfortable](https://x.com/riizetrans/status/1791664261841985756?s=46)",
            "Hey thinker! Great post up there. Make sure your post title is clear. One and two word titles are not allowed. Use paragraphs to make it easier to read. Please make sure to read the rules before posting.  Mod applications are currently open! Apply [here](https://forms.gle/hEgqsrBTGX897GFaA)!\n\nYou can fill out our [Feedback Form](https://docs.google.com/forms/d/e/1FAIpQLSfI0PsMn4dqfMlgqFFfsMhLr4-lFNJpEumIf7RKmuiwyDBOwA/viewform?usp=sf_link) while you wait for some comments. Thank you and happy posting!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/kpopthoughts) if you have any questions or concerns.*"
        ]
    },
    "Seventeen, the first kpop act at Glastonbury: A day time slot in an english speaking country, a crowd of mainly non-fans, and a brilliant performance that shows how kpop belongs on global music stages.": {
        "title": "Seventeen, the first kpop act at Glastonbury: A day time slot in an english speaking country, a crowd of mainly non-fans, and a brilliant performance that shows how kpop belongs on global music stages.",
        "score": 1397,
        "url": "https://www.reddit.com/r/kpopthoughts/comments/1dqlxal/seventeen_the_first_kpop_act_at_glastonbury_a_day/",
        "content": "[livestream](https://x.com/qtkwanpie/status/1806685175126032658) Or [a link to the full performance if this is a clearer video!](https://x.com/moeum_zip/status/1806720291995111742)\n\nSeventeen just performed at the biggest music and arts festival in the world; Glastonbury.\n\nFor those of you who don't know what Glastonbury is, it's a massive festival in the UK where people camp overnight, with tons of stages and artists from all over the world. It's a big deal; when I lived in the UK, it was a fight to get tickets every time.\n\nAnd that's the big piece; tickets sell out long before the lineup is announced.\n\nWhen I realized Seventeen would be performing here, my first feeling was honestly nerves - kpop groups often rely on their fandoms when it comes to festivals such as this. In fact, festivals will book big kpop acts TO attract huge crowds, because kpop fans know how to show up.\n\nBut for this one, there was no way for fans to get tickets; maybe, at most 500 Carats were able to find people reselling. But I have multiple friends who have been looking for tickets for months before - it's very very hard.\n\nSo the reality was that they would be playing to a (likely smaller) audience, of people who had never heard their music, on a stage at 2:45 PM on the first day of the festival. Majority of these fans would also be english speaking brits. The odds were utterly stacked against them.\n\n**But WOW oh wow, did they show up and show out.** Was it the biggest crowd they've played to? Not at all. But it didn't need to be. I want to commend Seventeen for being such strong performers above all else; they know how to engage a crowd, they know how to freakin SING, they know how to have fun with their craft.\n\nI loved when it panned to the crowd and you could see grown men in t-shirts for other artists at the festival, jumping and smiling ear-to-ear. I was moved to tears a couple of times, though I really encourage people to watch the entire set, or at the first least the last five minutes where they did the infinite Aju Nice.\n\nPerhaps my favorite part of the entire show was seeing Seungkwan dancing and holding the hands of excited middle aged ladies who seemed to be having the time of their life!! And then Seungkwan's adorable interaction with a little girl. So incredible. [Here is a link!](https://x.com/moeum_zip/status/1806700042960712191)\n\nFrom [Headliner ](https://x.com/sounds_of_cheol/status/1806698419995681248)to [Cheers to Youth](https://x.com/adoraboole/status/1806697681798226335), Seventeen know how to move a crowd that knows nothing about them. As Joshua said, music is the bridge between language and culture.\n\nAnd this performance showed that Kpop doesn't need to just exist within its little bubble of super fans; it deserves to have a spotlight on a more global stage, and I really hope this performance showed people how incredible the genre can be!\n\nEdit:\n\nGoing to add some more clips of performances as I come across them on X :)\n\n[Cheers to Youth](https://x.com/gyupachups/status/1806703011894567132)\n\n[Hoshi hyping up the crowd for HOT](https://x.com/miwon17_/status/1806699001280159996)\n\n[Full Aju Nice performance,](https://x.com/joshu_jihanist/status/1806701240740462931) [Never-ending Aju Nice](https://x.com/shua_enthusiast/status/1806701151674597550) and [Seungkwan crowd interaction!](https://x.com/adoraboole/status/1806702768855601444)\n\n[KUNG CHI PAK CHI](https://x.com/minghaocheol_/status/1806718668086325408)",
        "num_comments": 107,
        "comments": [
            "They absolutely bossed the stage!! They obviously know how to engage with and hype the crowd (seriously, hoshi is a mind blowing hype man his adlibs are so engaging I was so hyped in my bedroom like I was at the festival itself and seungkwan’s interactions with the audience, regardless old and young were so hilarious and adorable to watch) and it’s amazing to see their energy being reciprocated by the audience, seriously the best, most receptive and open-minded audience I’ve seen in festivals. \n\nI love it when performers look like they’re having complete fub on stage and nothing else matters and that was exactly how it felt watching their set. Given the positive reception I’m seeing all over twitter right now even from non-svt fans, I hope they are invited to headline Glastonbury next year!",
            "as a non-fan who just watched the livestream, they were AMAZING. also gotta love that no matter where they go, they do the never-ending aju nice.",
            "I clicked that Hoshi link and I'm sold. Thanks OP!",
            "Seeing locals vibing to vcu's cheers to youth made me so happy omg 😭😭😭 \nSvt is amazing, I'm just so proud to be a carat man :(",
            "Omg the crowd was SO engaging? All my love to the UK people. They were waving their hands to cheers to youth , jumping crazy to aju nice , they were loud and having fun. When I tell you I cried when that sweet lady patted seungkwan's head omg so sweet . The live aju nice and SOS aaaaaaaaaaaaaaaaaaa",
            "I’m so happy and proud of them!! They did amazing and the set list was so well chosen! I was a tiny bit worried about crowd receptiveness bc of how they were announced after tickets had sold out, but I needn’t have been! I’ve always felt like British and Irish gig/festival goers just  really go for it and can find something to enjoy in almost any act, and it was really great to see that play out here!",
            "I'm still amazed by how they're not sick of performing Aju Nice at the end with that much energy.",
            "That set was good! I actually want to rewatch it again. \n\nI'm also proud because aside from making history, the crowd really loved their performance despite the songs being in another language. That's how good Seventeen is. 😭",
            "i am so proud of them, they literally rocked the stage and seeing the non-fan vibing along. \ni did expect pfm unit gonna perform spell tho but maybe because they dont have back up dancers. overall damnnn our svt did welllllll. ajuuuuuu nice!",
            "I'm still high with emotions . very very proud of them, the crowd was crowding !"
        ]
    },
    "Any idols who don't only listen to pop music?": {
        "title": "Any idols who don't only listen to pop music?",
        "score": 51,
        "url": "https://www.reddit.com/r/kpopthoughts/comments/1dr5gnk/any_idols_who_dont_only_listen_to_pop_music/",
        "content": "There are so many idols who tag pop/r&b songs in their posts, but I'm curious about idols who listen to or recommend alternative music, especially rock/punk or even metal because I'm not familiar with other genres.\n\nSince I follow Dreamcatcher, I don't think all of them listen to that. Some of them listen to ONE OK ROCK, Babymetal, other J-Rock bands, Green Day, Fall Out Boy.\n\nI also heard one of the boy group members recommended Turnstile's album.\n\nI'm expecting from band members.. Who else do you know?",
        "num_comments": 67,
        "comments": [
            "Yuta is fan of Larc en ciel/Hyde   \nand I think others jrock bands too probably",
            "Vernon from Seventeen keeps recommending Paramore , Radiohead , The Strokes,  songs (a lot more but I'm forgetting)\nEdit :- I also remember him recommending a Turnstile song in his insta story ",
            "I need to know which kpop idol recommended Turnstile bec that is PHENOMENAL taste\n\nAlso, Chan has played Linkin Park on one of his lives before. New Divide iirc. He also hasn't really recommended yet to fans but Hyunjin mentioned recommending rock songs to Seungmin when Seungmin covered High and Dry by Radiohead",
            "Taemin likes rock and metal and Jonghyun is a fan of X Japan and other jrock bands. They both have covered rock songs",
            "RM of BTS, his music recommendations are not always pop",
            "Suho did the Spotify Lounge thing and recommended songs from Muse, Queen, David Bowie and The Beatles there. But his own solo music is brit/alt rock, so that wasn't really surprising.",
            "Beomgyu and Soobin often recommend korean indie music. Soobin’s monthly instagram posts often have a song recommendation at the end.",
            "Yoseob from Highlight listens to a lot of rock (specifically has mentioned Metallica and seems to like them a lot) but also has mentioned doesn’t like recommending them to fans… because he’s an idol, and he doesn’t know if they have weird lyric meanings, etc etc.",
            "TXT's Beomgyu often plays indie tracks on his lives. He said he shared his music taste with Soobin. Kai likes alt-rock/pop-punk.\n\nIn BTS Taehyung likes jazz, rnb and soul, he would play those genres on his lives. RM has very eclectic taste and recommendations.",
            "Treasure Jihoon are into a lot of rock especially old school rock like led zeppelin and ACDC and British bands/acts like Oasis, etc.\n\nHe even try to incorporate growling in to his live singing lately."
        ]
    },
    "Certain idols that are easy vs hard to draw...": {
        "title": "Certain idols that are easy vs hard to draw...",
        "score": 19,
        "url": "https://www.reddit.com/r/kpopthoughts/comments/1dr63u0/certain_idols_that_are_easy_vs_hard_to_draw/",
        "content": "Mostly inspired by some posts I saw of artists talking about which idols they have a hard time drawing. \n\nFrom the ones I've seen who are on the harder side... \n\n* **Tae-min**. It can be a bit difficult to get his features right. They're simultaneously sharp but also soft and rounded, so it's difficult to capture that magic of androgyny in him. \n* **Huening Kai**. There's something about him that's somewhat difficult to capture. \n* **Jake**. I heard lots of fan artists say that it can be hard to get his lips right.",
        "num_comments": 8,
        "comments": [
            "Yeji is the easiest to draw.",
            "I find J-hope and Jimin easy to draw. But Jin is hard because I have to stop every few minutes to wonder how anyone can be gorgeous 😅",
            "I don't really follow Ateez but I saw a video of San being annoyed at how fans draw him. It was just two slits for eyes and an uwu mouth and it was so uncanny I was wheezing. So I guess San is easy to draw?",
            "I can only speak for Skz but:\n-Han : the easiest to draw for me, he has really distinct features that are easy to draw for me\n-Seungmin: the hardest, his nose and mouth is really hard to capture, if you're doing it wrong it looks like a caricature😭",
            "Namjoon is easy to draw",
            "As a reveluv I feel like Irene and Seulgi are good examples of this. I remember seeing a lot of posts about drawing the Red Velvet members a while back, but Irene and Seulgi are probably the most fitting examples for this.\n\nSeulgi is simultaneously easy and hard to draw. She has really distinct features, which depending on your skill level and the medium you use can either make it really easy or difficult. I would imagine the easy thing about Seulgi is that her most distinct feature is her eyes, so you really just need to get the eyes right, but if the eyes are wrong then it all looks off.\n\nIrene on the other hand seems really hard to draw. I rarely see truly good drawings of her and she doesn’t have that one distinguishing feature in the way that Seulgi does. The challenge with Irene is the symmetry of her face. She’s so ridiculously symmetrical that if the placement of even one feature is wrong, the entire drawing looks off. The distinguishing feature of Irene is the harmony between her features.",
            "MOOD",
            "Hey thinker! Great post up there. Make sure your post title is clear. One and two word titles are not allowed. Use paragraphs to make it easier to read. Please make sure to read the rules before posting.  Mod applications are currently open! Apply [here](https://forms.gle/hEgqsrBTGX897GFaA)!\n\nYou can fill out our [Feedback Form](https://docs.google.com/forms/d/e/1FAIpQLSfI0PsMn4dqfMlgqFFfsMhLr4-lFNJpEumIf7RKmuiwyDBOwA/viewform?usp=sf_link) while you wait for some comments. Thank you and happy posting!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/kpopthoughts) if you have any questions or concerns.*"
        ]
    }
}