{
    "Monthly 'Who's this?' & Merch Auth. Post - June 2024": {
        "title": "Monthly 'Who's this?' & Merch Auth. Post - June 2024",
        "score": 9,
        "url": "https://www.reddit.com/r/kpophelp/comments/1d5i105/monthly_whos_this_merch_auth_post_june_2024/",
        "content": "Welcome to the Monthly Artist Identification and Merch Authentication post!\n\n### Instructions\n\n* Search first! Please try other methods of identifying your image if possible. [Google Lens/Reverse Image Search](https://www.google.com/imghp?hl=en) or [Dupli Checker](https://www.duplichecker.com/) are available options. We know results can be unhelpful, but please make an attempt with these kinds of tools first!\n\n* You might also be able to find more specialized help in specific artist subreddits or those with a specific purpose. Make sure you check the rules of any subreddit before you post or comment asking for help!\n    * r/kpop/wiki/relatedsubs\n    * r/kpopcollections\n    * r/kpopforsale\n\n* Make comments with included images of artists you need identified or merchandise/signatures you would like authenticated in this post.\n\n* In the same comment, state your purpose or question clearly for the help you are seeking.\n\n* Please acknowledge or thank at least one helper who provides an answer in reply to you OR edit your original comment to state you have been helped to signal to others you do not need further assistance.\n\n### Rules\n\n* **DO NOT** troll or intentionally deceive fellow users\n* **DO NOT** derail or wander far off-topic. This is not a general discussion post. Stay focused on requesting or providing help! Mods may lock or remove threads that extend beyond the point of helpfulness.\n* If your question is not answered in a previous Monthly post, feel free to comment again in future posts until you are able to get help.\n\nYou may also provide feedback for ways we can test/improve handling this type of content in the subreddit here or [through modmail](https://www.reddit.com/message/compose/?to=/r/kpophelp). Thank you for your patience while we figure out what system will work best for us!",
        "num_comments": 49,
        "comments": [
            "does anyone know if using adblock still count my youtube views?",
            "Who is this? I got this as a freebie after spending over a certain amount. Google only took me to WayV Pinterest. I only know Ten and Lucas from WayV and neither are him.",
            "I think this pic is from his new second solo album’s concept photo shoot. The album’s name is ‘Right place Wrong person’.",
            "do you know what day this was or have better link to this pic? if I zoom in at all it gets pretty blurry",
            "idk but he lowkey looks like franz kafka",
            "he looks like backrooms lost media im cracking df up",
            "definitely wonyoung from Ive! The beauty mark lol!",
            "These photos are usually taken by staff and posted by the members or by the group on their sns, as the fans can’t capture this angle.",
            "hyunjae - new, eric - younghoon",
            "Kinda sounds like Jang Nara - Sweet Dream"
        ]
    },
    "New Post Flairs: 'Advice', 'Merch', and 'Research' are now available!": {
        "title": "New Post Flairs: 'Advice', 'Merch', and 'Research' are now available!",
        "score": 20,
        "url": "https://www.reddit.com/r/kpophelp/comments/1dey54e/new_post_flairs_advice_merch_and_research_are_now/",
        "content": "Hey Helpers!\n\nOver in r/kpop we just posted a new special Town Hall that is focused only on the Flairs we use to help organize our posts based on content categories.\n\n**[Link to r/kpop's 'All About Flairs' Town Hall](https://www.reddit.com/r/kpop/comments/1dexags/town_hall_all_about_post_flairs_june_2024/)**\n\nWe included announcements for new flairs here on r/kpophelp and also on r/kpoppers. The following is the section relevant for this subreddit.\n\n***\n\n## NEW FLAIRS!\n\n\n* **Advice** - This flair is replacing ‘Discussion’. We want to emphasize that r/kpophelp is not a general discussion subreddit. ‘Advice’ will be for users seeking advice for things like auditioning, concert preparation, those struggling with parasocial issues, etc.\n\n* **Merch** - Any questions related to the logistics of buying K-Pop products and merchandise should use this flair. Where to buy, shipping issues, legitimacy/reliability of vendors, or other logistical issues related to merch can use this flair. Remember that buying/selling products is not allowed here and that merch authentication should be done in the Monthly post pinned at the top of the subreddit.\n\n* **Research** - Academic surveys related to K-Pop or fandom topics.\n\n***\n\nModerators will be monitoring the use of these new flairs to see if there is any further confusion and need for more adjustments. All feedback is welcome! We still have upcoming plans to properly overhaul the rules, but getting these new flairs active is something we wanted to take care of first!",
        "num_comments": 0,
        "comments": []
    },
    "which kpop foreign idol is the visual or center in their group": {
        "title": "which kpop foreign idol is the visual or center in their group",
        "score": 9,
        "url": "https://www.reddit.com/r/kpophelp/comments/1dr7iht/which_kpop_foreign_idol_is_the_visual_or_center/",
        "content": "which kpop foreign is the visual or center in their group I been very curious.",
        "num_comments": 41,
        "comments": [
            "* Shuhua (Taiwanese) is the visual of (G)I-DLE (alongside Miyeon)\n* Xiaoting (Chinese) is the visual of Kep1er\n* Kelly (Taiwanese) is the visual of TRI.BE",
            "For visuals, 2PM's Nichkhun and Everglow's Yiren.",
            "I believe Yiren is the center and a visual of everglow.",
            "Most Cube groups had foreign visuals. CLC had Elkie and Pentagon had Yanan. They also currently have Shuhua and Hina.",
            "Winwin and Hendery are the visuals for WayV. I'm just not sure who's the center now that Lucas is gone. I feel like Xiaojun could easily become one of the official visuals as well for the entirety of NCT",
            "yanan pentagon,sakura when she in izone,kazhua le sserafim she went viral many time for her visual.",
            "Most Chinese idols are visuals in their respective groups, like my boys Jun in SVT and Hanjin in TWS.",
            "for visual, Asahi from Treasure!",
            "Yuqi is Chinese and the self-proclaimed center of (G)I-DLE though she seems to get side eyes from a couple of the other members whenever she says anything about that haha 🐶",
            "Zhang Hao from ZB1 is both center and visual"
        ]
    },
    "Is it strange for a male to go to a boy group fansign?": {
        "title": "Is it strange for a male to go to a boy group fansign?",
        "score": 226,
        "url": "https://www.reddit.com/r/kpophelp/comments/1dqmxae/is_it_strange_for_a_male_to_go_to_a_boy_group/",
        "content": "Just what the title says. The group in particular for me that I would like to attend is SKZ, would they be caught off guard/or find it strange for me (straight male) to attend their fansign? Any advice would be amazing please and thank you all!",
        "num_comments": 98,
        "comments": [
            "No. I think many boy groups actually find it to be a nice change of pace in a way. (Seconding that they’d find it refreshing.) If you like a group and have the chance to go, then you should go. \n\n(Also a guy fan here as well.)",
            "Every boy group I've ever even casually followed likes to know that men are also their fans. Any artist would want to know that their work appeals to everyone.",
            "S Coups from Seventeen has said he went to a Big Bang fansign before becoming an idol",
            "They'd absolutely love it. SKZ love all Stay.",
            "They might find it refreshing",
            "Not at all! They’d probably be more excited to see you than the sea of girls because boys don’t really show their appreciation nearly as much.\n\nThey love all their stays and would be happy to see you regardless of you gender!",
            "Not strange at all, especially for a group like skz that actually tries to be inclusive and celebrate the diversity of their fans.",
            "no ahaha + there are plenty of skz fanboys!!!",
            "You know what you need to remember? The biggest fans in the world of male kpop idols are male kpop idols. These boys got inspired to do this absolutely crazy thing with their lives and that inspiration came from the men who made it before them. \n\nBoys in kpop love boys in kpop, it’s an essential fact. Go be a fanboy, you’re welcome :)",
            "I'm sure you're not the first and def won't be the last"
        ]
    },
    "songs with “baby girl”": {
        "title": "songs with “baby girl”",
        "score": 30,
        "url": "https://www.reddit.com/r/kpophelp/comments/1dr0ivg/songs_with_baby_girl/",
        "content": "hi guys i need your help pls🙏🏻🙏🏻🙏🏻\n\ni’m making a playlist of songs that have “baby girl” in their lyrics\n\nso far i have:\n\nexo - tempo\n\ntvxq - whatever they say\n\ncan u think of any more? thanks in advance🫶🏻\n\npls also sign my petition that both bgs and ggs should slip in at least 1 baby girl per song thanks",
        "num_comments": 30,
        "comments": [
            "call me baby - exo",
            "EXO - Call Me Baby\n\nNCT 127 - Sticker",
            "LISTEN GIRL (JOHAHAE) BABY GIRL (SARANGHAE)\n\nSuJu’s Bonamana!",
            "Woozi's solo Ruby - \"Baby girl you're making me a beautiful jewel\"",
            "CBX - Juliet\n\n\"Baby girl just come to me...\"",
            "Beast - V.I.U (Very Important U)",
            "Ill be back - 2pm",
            "balming tiger - sexy nukim",
            "You go Girl - Lee Hyori",
            "Jay Chang- Up to you\n“Baby girl~~~ it’s up to you~~”"
        ]
    }
}