{
    "Smh ": {
        "title": "Smh ",
        "score": 1350,
        "url": "https://i.redd.it/s0hfp03umd9d1.jpeg",
        "content": "",
        "num_comments": 41,
        "comments": [
            "The watermark isn't cut off, literally says @tripped.ae at the bottom right of the edit.\n\nAnd the award is literally less than £1/$1...",
            "His name was literally in the video and why is he on twitter begging to be paid out? I don’t get it. The award was a couple bucks no?",
            "His watermark was very visible and he was shouted out by a youtuber with over 16 million subs and he’s mad about it cause he didn’t get a  4 quid Reddit award .… smh",
            "Did it not say trippededitz?",
            "If you care about earning money why are you creating KSI edits 😭😭😭",
            "I guess if his name was on there, it would have plugged his socials. But pretty sure you don’t get actual money from awards.",
            "Dude is begging for the money",
            "And to be honest that edit is worth no more than 1£ with video's FPS \"smoothly\" increased by an AI",
            "boohoo bro its literally a dollar",
            "Do you actually get money if your post gets an award?"
        ]
    },
    "Surely there's an option to filter these comments so they get automatically deleted as soon as they get posted ": {
        "title": "Surely there's an option to filter these comments so they get automatically deleted as soon as they get posted ",
        "score": 2200,
        "url": "https://i.redd.it/m1ylndugfc9d1.png",
        "content": "",
        "num_comments": 100,
        "comments": [
            "How are people not getting the joke. This sub is acc full of children I stg",
            "I’m sorry this is so random i’m dying 🤣🤣",
            "I see the joke flew over some of yall heads 🤣",
            "Absolutely outrageous comment. The reply really sums up my feelings",
            "Bros lookin at the wrong comment",
            "Every comment section it’s just full of these with botted likes.",
            "Wow what an outrageous comment we need to get that guy banned 😒 i agree with the reply tho",
            "Exactly smh🤦🏽‍♂️I bet the replies called him out and put him in his place",
            "Nah this is comedy gold",
            "Yeah that first comment was really the problem, not the reply under it..."
        ]
    },
    "JJ its been long enough, it’s time to go BLUESKI": {
        "title": "JJ its been long enough, it’s time to go BLUESKI",
        "score": 54,
        "url": "https://i.redd.it/8m3ntim6uh9d1.jpeg",
        "content": "",
        "num_comments": 7,
        "comments": [
            "I think it’s a bit too late.",
            "There's no hair left to dye",
            "The guy’s 31, its not gonna happen 😭😭",
            "Why’d you post xxx in the ksi subreddit?",
            "Bro that’s XXX",
            "Just go MUI directly",
            "He’s 31…"
        ]
    },
    "Porn directors on a random tuesday while filming a 7v1": {
        "title": "Porn directors on a random tuesday while filming a 7v1",
        "score": 890,
        "url": "https://v.redd.it/y93evwkv3d9d1",
        "content": "",
        "num_comments": 14,
        "comments": [
            "“He’s trying to, but it’s so congested in the middle” 😭😭😭",
            "Bro is the intercourse inspector",
            "STOP CAUSE THIS IS EXACTLY WHAT I THOUGHT WHEN I SAW THE VID💀💀💀",
            "NAH THIS EXACTLY WHAT I THOUGHT",
            "a porn director would have done a better job than that fking idiot",
            "Bro is the sex strategist",
            "Bro is the shagging savant",
            "Bro is the tapping tyrant",
            "This is wild 😂😂",
            "You naughty naughty"
        ]
    },
    "Caption this": {
        "title": "Caption this",
        "score": 47,
        "url": "https://v.redd.it/ukc5pdroff9d1",
        "content": "",
        "num_comments": 4,
        "comments": [
            "This the kind to dead joke 50 year old alcoholics named Dave post on Facebook",
            "Ngl.. This feels like the most racist shit I’ve ever seen though it’s a joke…! I’ll be on my merry way now.",
            "jj should do this"
        ]
    }
}