{
    "Monthly Rant Thread: June, 2024 edition": {
        "title": "Monthly Rant Thread: June, 2024 edition",
        "score": 4,
        "url": "https://www.reddit.com/r/labrats/comments/1d5ec5g/monthly_rant_thread_june_2024_edition/",
        "content": "Welcome to our **revamped** month long vent thread! Feel free to post your fails or other quirks related to lab work here!\n\nVent and troubleshoot on our discord! [https://discord.gg/385mCqr](https://discord.gg/385mCqr)",
        "num_comments": 10,
        "comments": [
            "Two consecutive days of 14 hour workdays. PI told us that she went home at 9 every night as a postdoc. She also said it was because they often chatted about random stuff. \n\nI don't chat. I work nonstop. I actually measured how long I was sitting and it was 45 min today. And those minutes were spent working (writing, checking emails). \n\nI am exhausted.",
            "Got alcohol resistant permanent marker on my trousers whilst trying to label a biohazard waste bag. IPA, hand sanitiser, oxi-action and lemon juice have all failed me/sigh",
            "I’m in undergrad working on research and the grad student in my lab was doing the sonification for my newest mutation and the falcon tube broke so now I have to restart five wks of work and boy did I need a cry after that",
            "No work-life balance, at all. I am a TECH, and haven't had a doctors or dentist appointment in two years. No vacations, multiple weekends gavaging and sac'ing mice, and people act like it's expected of me despite them taking weeks off at a time. The one time I need to take a day to see a doctor, everyone reschedules everything to time slots literally within the hour of my appointment. I have, all morning, been arguing with post-docs, grad students whose experiments I'm doing, and lab \"partners\" about why suddenly pushing up something without letting me know in advance shows an evident lack of communication and disrespect of my time, rather than me letting them know about my appointment in case they needed to suddenly dump everything to today so they have a lighter workload. I am sick of being treated like I am inconsiderate, stupid, or crazy for taking time for myself. Fuck you, fuck the lab, fuck academia, I hope all your mice get parasites and die and that none of you graduate on time.",
            "Does anyone have a homebrew way to make proteinA Dynabeads?\n\nThermos price is a bit too much for a random sidequest",
            "Entering my 4th year and it feels like I have ✨nothing✨",
            "I feel more isolated than ever in my lab. I don't talk to the people in my lab because they are toxic AF and have this horrible high school level clique culture. Most of them are openly sabotaging by nature which just makes it worse. They try to misinform you on purpose or try to make you insecure about yourself all the time, their central points of discussion are their personal lives and how hard their lives are... There is NO scientific discussion . I just decided at one point it was better to be out of the group than in it.\n\nI am the only biologist in my lab and my project is far far away from anything the institute or lab even remotely works in so it's tiring and isolating. Even my PI (who initiated this project) does not know enough about it to discuss it with me even though I report my results to him everytime. I feel like an untethered creature running aimlessly amok.\n\nI wish there was more regulation and more discussion in my life about science. I'm just so tired. I want to finish up soon... I'm in my fourth year already.\n\nI'm just so tired and alone.",
            "Grad students in my lab are constantly stressed and talking about how overworked, underpayed and stressed / suicidal they are. I am an undergrad doing my best and recently started my own project and they left for a conference. A mistake was made by myself, another undergrad working with me, and my grad student as I sent them photos of every step and they didn’t catch it either. I made them incredibly mad and they stormed in the lab and yelled at me that I wouldn’t be allowed to work on their stuff ever again. Had a mental breakdown, led to stress induced tunnel vision and brain fog, ubered home, cried some more. Never want to go back but have to complete my project I got a scholarship for but I don’t know how I can be in a place so bad for my mental health. I really love the lab too and love working but my grad student is so scary and I put so much weight on her opinion and it’s just not working out. I know how stressed they are and understand the frustration of your project being messed with, I’ve been experiencing that with my own and the added guilt of that and seeing the parallels of me with my undergraduate I’m mentoring and her with me is mind fucking me and I don’t know how this dynamic can be fixed. Trust has been lost by her for me and vice versa and what had become a safe-ish space (as long as I didn’t make any mistakes after which many have caused breakdowns and neither of them were this bad) is ruined and my research feels ruined and I don’t know how to move on. I’m going to meet with the my PI who’s really nice to discuss at some point but I just don’t know what to do.",
            "Try a cleaner called \"Greased Lightning\". I've gotten literally everything out with that stuff. It was my secret weapon when I was selling high-end used clothing. People would ignore really expensive clothing due to stains, etc. I'd buy them and used greased lightning to remove the stains completely. I own gallons of the stuff now in my garage.",
            "Cheers. Halfway into my fourth year, still feeling the same."
        ]
    },
    "They live among us.": {
        "title": "They live among us.",
        "score": 1202,
        "url": "https://i.redd.it/8ibhl0fsmb9d1.jpeg",
        "content": "",
        "num_comments": 36,
        "comments": [
            "I know people who send passive aggressive messages through the tip box. Something like \"FUCK YOU\"",
            "So many people in my lab do this. It's so annoying, especially since I often work with multichannel pipettes. I want the tips in order.",
            "I do it knowing others hate it >:)",
            "I'm an *angry* scientist",
            "One of my undergrads hate this and I looked her dead in the eye and did it",
            "doing it haphazardly is the only thing that gives me peace when doing a lot of pipetting. it's the way nature intended.",
            "Yeah the bottom picture makes me mad! 😡",
            "I try to make art as I take them out. Usually it just ends up looking like a mess.",
            "I do not get it. What is wrong with the last picture?",
            "I do this on purpose"
        ]
    },
    "Saw my life flash before my eyes the first time I heard an Argon dewar vent": {
        "title": "Saw my life flash before my eyes the first time I heard an Argon dewar vent",
        "score": 95,
        "url": "https://www.reddit.com/r/labrats/comments/1dqyi0b/saw_my_life_flash_before_my_eyes_the_first_time_i/",
        "content": "",
        "num_comments": 42,
        "comments": [
            "Oh I'm drunk and thought I was on the LOTR sub and read that as Aragorn. And I was like yeah when I first heard Aragorn's speech I also felt like my life flashed before my eyes. \n\nI'm sorry for your almost loss.",
            "I would like to sincerely apologize to the lab rats community for my crime against science (not specifying liquid nitrogen)",
            "I accidentally stabbed myself with a pentobarbital sodium needle today after I did euthanasia on an animal. The wind left my body and my PI’s body.",
            "You mean liquid nitrogen?",
            "You mean liquid nitrogen?",
            "Holy shit yes the liquid nitrogen cooling the argon dewar I didn’t know this was a topic people were so passionate about",
            "You mean liquid nitrogen?",
            "You mean liquid nitrogen?",
            "You mean liquid nitrogen?",
            "You mean liquid nitrogen? "
        ]
    },
    "Just too tired to work any more in academics": {
        "title": "Just too tired to work any more in academics",
        "score": 25,
        "url": "https://www.reddit.com/r/labrats/comments/1dr1hve/just_too_tired_to_work_any_more_in_academics/",
        "content": "In my country, we almost lose any work-life balance in labs, working for 14 hrs for 6 days a week. Of course, it did't necessarily mean 14-hour benchwork. But we have to stay there and be online in any time to respond to our PI and for those lab stuff since we dont even have a technician or a lab manager.\n\nThe salary is fairly low. The salary for a month can only afford about 1.5-mouth spend on food. \n\nThis terrible environment is even normal in my country and my lab is definitely not the only one. My PI is even relatively kind and understanding, compared to other PIs as i know. Some of them would even abuse their students for their experimental failures. \n\nThe whole environment is toxic. Every one in my lab seems tired in such stressful environment but they are always eager to satisfy our PI's needs to avoid any judgement of laziness or irresponsibility. \n\nThe productivity is also low since we have to deal with all those trivial stuff. The feeling of physical and mental exhaustion stop me to work efficiently.\n\nThe 5-year PhD life is absolutely like a nightmare. Though i hated the  environment, i still enjoyed what i was doing and the feeling of finding something fantastic. So i endured till i got the PhD. \n\nEverything is going to be done. But now my passion for research and my creativity seems to be gone. I sleep all day, hiding myself, not willing to see anyone. Completing my manuscript becomes a very difficult thing. I am not even motivated to find a job in either industry or academics because i haven't decided whether i am going to leave academics yet and where i am going to go.",
        "num_comments": 5,
        "comments": [
            "thank the gods my country has labour rights and unions ... you can do it op, after that quickly move on to industry!",
            "Are you working in a chinese lab? This looks familiar.",
            "Sounds about the same as in the united states",
            "i have ever thought united states as much less stressful. Frustrating.",
            "There are definitely edge cases that are as bad or worse than what you're going through, but I disagree with the original poster. It's quite rare to consistently work 14 hour days. Even in a PhD program, I've never heard of anyone putting in more than 10-12 hours a day at most. And there's rarely an expectation that you have to be in the lab for all of those hours."
        ]
    },
    "As an OCD person, being in the cell culture is killing me because i am just scared of contamination": {
        "title": "As an OCD person, being in the cell culture is killing me because i am just scared of contamination",
        "score": 26,
        "url": "https://www.reddit.com/r/labrats/comments/1dqv4ns/as_an_ocd_person_being_in_the_cell_culture_is/",
        "content": "",
        "num_comments": 21,
        "comments": [
            "I also struggle with this. I go overboard with glove changing and alcohol spraying at times to the point it gets brought up at management review. But I’ve found that i have to recognize the difference between being cautious and allowing the obsessive thinking to take over. You can be sterile without obsessing. You got this.",
            "Are you being treated for OCD? I obviously have zero clue what you're dealing with, but I had such a hard time--similar kinds of obsessive, looping thoughts--with it until I saw the right psychiatrist and got the right medication",
            "SAME. I also struggle with the damn -80 and whether or not I’ve closed it. Or pipetting a small amount (<10 uL) and whether or not it really went in the solution. As another commenter mentioned, you can be cautious without being obsessive, but I do understand the struggle. Sending you kind thoughts, OP!",
            "If you can, pen strep in media can help out. Contamination occasionally happens to everyone though. So don’t beat yourself up over it. Biggest risk imo is taking warm media bottles out of the water bath.",
            "I struggle with similar things... walking around the lab to make sure everything is off and safe when I leave for the day a shit load of times, scrapping solutions and making them again because I think I made it incorrectly multiple times(even though my rational side of my brain knows it was made correctly), checking the -80 freezer multiple times to see if it's closed (and even going back into the freezer room multiple times to see if it's closed and still not even trusting myself although visually it looks completed fine), closing the gas to a bunsen burner flame multiple times... etc.\n\nFor all of these issues I just had to trust that I performed the process or did whatever thing correctly and tell myself that I'll deal with the ramifications if there are any (if I truly did screw up said thing). My logical side of my brain knows that I did said thing correctly, but there's always some conflict in my head about whether I did basically anything correctly.",
            "A PI once told me contamination is all about technique. I was kinda upset cause I kept having contamination for like a month straight, after a year of culturing with zero contamination. I always used PenStrep, but never wore a lab coat, just gloves at LOTS of 70% EtOH.",
            "Maybe it will become excitement eventually as you are going to work in an environment where you can clean to the limit and control almost every variable. And good consistency will lead to great results. Eventually you will be really good at it and be showered with compliments and accolades for being the person who can do the impossible from the perspective of others.",
            "Honestly, it’s probably going to make you more successful.",
            "Seconding all of this. Allowing OCD to go untreated will not help your research or make you a better scientist; it will just make you miserable.",
            "You can always take a picture of it closed before you leave!\n\nAlso, I always look for any volume remaining in the tip when pipetting small volumes. If some gets stuck, you can always pull the tip off with your hand, release the plunger, and then put the tip back on. Now you have more air to pipette any remaining liquid."
        ]
    }
}