{
    "Autobans coming for participation in subs that promote brigading of landlords": {
        "title": "Autobans coming for participation in subs that promote brigading of landlords",
        "score": 686,
        "url": "https://www.reddit.com/r/Landlord/comments/fwmid4/autobans_coming_for_participation_in_subs_that/",
        "content": "I know there was some debate surrounding whether to allow dissenting views or not on the sub.  As I mentioned before I'm of the idea that political views shape business views.  Back in the 50's through to more modern times steering minorities was commonly done.  Was race a political and social issue?  Sure.  Should landlords of the time have been paying attention to it?  Absolutely.  Were there landlords at the time who thought it shouldn't have been part of a business discussion?  Again, I'm sure there were.  \n\nI look at today's political climate as just another trend in social issues affecting the business world, our business world.  If there can be civil conversation about it, I think it should be encouraged.  After all, the people with those political views may end up being our tenants, our neighbors, or the neighbors of property we own.  Understanding what they're thinking, expecting, and more importantly what actions they may take can only help us as business people.  While I am sure that none of us agree with rent strikes, and 5 years ago no one would have even thought of such a thing affecting them, today's political and social environment has made it a reality we need to deal with.  There was an attempt made to start a new sub over at /r/land_lord for only \"non-communist\" ideologies to post.  That sub lasted a couple days before it was brigaded to death and the creator deleted their account.  We've survived many attempts at brigading.  I've taken the harassing message for me to die, to be taken for a walk to the guillotine, and the overall harassment directly sent simply because I am a mod of this sub.   C'est la vie.  Decades as a landlord has given me think skin.  \n\nThe sub being private has worked out to quell the brigading that has been going on.  We've got just about 600 users who requested and were permitted as approved users of the sub.  While I am against autobanning people for having alternative views, there is a bot that can autoban users who post in controversial subs, then we can whitelist later if the user isn't here to harass and requests access.  **We're starting off by autobanning those who post or comment in the 3 main Chapo subs and LateStageCapitalism.  If more need to be added, we'll get them added**.  \n\nTo assist with the potential for new users brigading we're going to re-implement account aging and minimum karma requirements for posting/commenting.  This will increase the number of posts and comments which get removed, but it will help keep the brigading down.  The bad part is that anyone who creates a throwaway account to try and post will have that post/comment auto-removed and it will need to be manually approved.  \n\nWith the upcoming re-opening of the sub publicly to see if these new features help, I would ask that everyone remain vigilant and report any comments or posts which don't belong.  We're a community and self-policing the content is important.  Reporting things brings them up in a list that can easily be read and removed.  Some trolls have multiple accounts which they age and gain karma solely to use in subs that have conditions like this.  If opening the sub up floods us with brigading again, we'll go back private.  \n\nI've been getting a lot of messages from tenants that want access to the sub because they are searching Google for information and our sub is being linked to the answer.  Much like I think it's good for landlords to learn the differing views that might affect them, I think tenants seeking out the view of landlords in these times only helps us all.  \n\nThanks for being a member of the community, thanks for helping, and most of all, thanks for making this a great place to share ideas, resources, frustrations and successes.",
        "num_comments": 342,
        "comments": [
            "Thanks for all the work you've done to save the sub. It's been a valuable place to get other perspectives on managing my rentals and I'd hate to see it go away.",
            "[deleted]",
            "Thanks for doing this.   Can we open the sub back up again now?   I don't think we should lock out newer landlords or landlords newer to reddit, as now is a time many landlords are struggling and could use wider advice.  \n  \nYou may also need to put minimum karma for posting in place to stop the brigaders opening new accounts.   \n  \nIronically, this sub is full of smalltime landlords, and hurting smalltime landlords just pushes more real estate to big corporates.    The Chapos are helping the man, at the expense of the little guy, which is not surprising at all.",
            "[deleted]",
            "Thanks for saving this sub.  Advice from this sub has saved my ass on several occasions and I appreciate you all.\n\nI am politically liberal, but as a businessperson, fully capitalist.  My family escaped a communist country and I think all the armchair communists need to live more experiences before cheering on a type of institution they don’t actually understand the consequences of.",
            "Seriously, no kidding. I had no idea that being a Lanldord is frowned upon, until all the trolls started posting in Landlord threads.\n\nI thought Reddit was supposed to be a place for Serious discussion, if I want to deal with all the trolling and degeneracy there is a certain other message board that comes to mind.\n\nMy understanding is that Reddit prides itself on being a sanitized forum without flaming and arguments, so they better clean up all the trolls.",
            "[deleted]",
            "Well I'm a landlord myself but I'll probably be banned because I've probably made some comments in /r/LateStageCapitalism posts. \n\nJust because a meme shows up on someone's /r/all feed (which LSC often does) and that someone chooses to comment on it, does not mean they hold some radical viewpoint.",
            "Tenants should be on a separate sub IMO.",
            "This makes a lot of sense. You have my support (and my axe). There is should be no limits to discussions, and as you said, business owners ignore discussions at their own peril. However, the discussion (even one concerning a rent strike) can and should remain civil however much some people like or dislike it. Suppressing topics just because they are uncomfortable to broach would only lead to our ignorance and ultimately, our own (collective) failure. Best of luck implementing as you see fit."
        ]
    },
    "[General] Current state of the sub and protest": {
        "title": "[General] Current state of the sub and protest",
        "score": 22,
        "url": "https://www.reddit.com/r/Landlord/comments/14eaex2/general_current_state_of_the_sub_and_protest/",
        "content": "For those of you who are unaware of what's going on, the following links are provided so you can educate yourself and realize this affects all of us, not just moderators\n\n[Reddit Blackout - 3rd Party Apps](https://www.reddit.com/r/ModCoord/comments/1476fkn/reddit_blackout_2023_save_3rd_party_apps/)      \n\n[Apollo is being killed - CEO lies about cost, doubles down on lies](https://www.reddit.com/r/apolloapp/comments/144f6xm/apollo_will_close_down_on_june_30th_reddits/)      \n\n[Reddit declares war on disabled users and doesn't care](https://www.reddit.com/r/Blind/comments/13zr8h2/reddits_recently_announced_api_changes_and_the/)      \n\n[API information and yet more exposure of the lies Reddit CEO is spewing](https://www.reddit.com/r/AskHistorians/comments/142w159/askhistorians_and_uncertainty_surrounding_the/)       \n\n[Even more commentary on how the Reddit CEO doubles and triples-down on lies](https://www.reddit.com/r/redditdev/comments/144l86y/takeaways_and_recommendations_after_api_meeting/)        \n\n[The actual AMA from the current CEO which was a glorious shit-show of lies, threats and a glaring lack of ability to demonstrate one single iota of insight into his own behaviors](https://www.reddit.com/r/reddit/comments/145bram/addressing_the_community_about_changes_to_our_api/)       \n\n[The veiled threat from the admins regarding 'replacing' moderators of subreddits](https://www.reddit.com/r/ModSupport/comments/14b5q1f/how_to_request_an_abandoned_community_or_a_mod/)         \n\n[NPR interview with the current CEO which exposes the CEO's continuing lies, deceit, etc.](https://www.npr.org/2023/06/15/1182457366/reddit-ceo-steve-huffman-its-time-we-grow-up-and-behave-like-an-adult-company?refresh=true)       \n\n[And, finally, how the CEO insulted every moderator and demonstrated that, with this behavior, he is woefully unqualified to 'lead' anything](https://www.techdirt.com/2023/06/16/reddit-ceo-triples-down-insults-protesters-whines-about-not-making-enough-money-from-reddit-users/)      \n\nThe sub is currently opened up because reddit has moved from veiled threats to [real threats of removal](https://imgur.com/wBd6yLY).  We feel that we can do more good with the sub open and continue the protest as moderators of the subreddit.  \n\nMany of the tools previously used to moderate the subreddit, such as finding troll posting histories from brigading subs, are gone.  We used to be able to search by a few keywords on a user's history on 3rd party sites to find if users were looking to create strife here.  Those tools are gone.  Moderator tools from 3rd party apps, specifically Apollo, was used a lot because things were just easier and faster to do on that app.  These items are now gone.  Moderating has not become a more time consuming process.  Some features are just gone for now.  Understand that this will affect the community here.  Those trolls that would try and goad a conversation into a fight can't be identified like they used to be.  reddits official app moderation tools are...less than desirable.   \n\nWe're considering our options for continued protests.  Rule changes may need to be made to the sub to accommodate the loss of tools, potential sporadic closures, polling the users, everything is on the table at the moment during discussions.",
        "num_comments": 0,
        "comments": []
    },
    "[Landlord - US- CA] Tenant wants me stop construction. ": {
        "title": "[Landlord - US- CA] Tenant wants me stop construction. ",
        "score": 40,
        "url": "https://www.reddit.com/r/Landlord/comments/1dqodd2/landlord_us_ca_tenant_wants_me_stop_construction/",
        "content": "I am a property owner and doing construction in a vacant unit adjacent to the unit of complaining tenants. I also had to demo the carport and convert into a garage to bring the property up to code per city regulations.\n\nThe tenant is pregnant and wants me to stop all construction because it is \"affecting her health\" and is a disturbance. The tenants claim I was inconsiderate for doing construction during their pregnancy.\n\nI will eventually have to access to renovate areas of their unit and will ensure to do what's right at that time but as of now, I'm trying to figure out the best way to handle this matter.\n\nI am following code and the hours allowed for construction. They want me to stop and unfortunately I cannot do that.\n\nShould I involve an attorney? I'm not sure what they can do legally at this point. Any suggestions are appreciated.",
        "num_comments": 98,
        "comments": [
            "She’s pregnant now,, later she will have a baby that’s sleeping, then it will be something else. There’s no good time for construction. If anything she should be glad it’s happening now before the baby comes",
            "Offer to allow them to break their lease without penalty.",
            "You should ignore them. Just say, \"sorry, this has to get done! But I will only be working between the hours of  8 and 8 or whatever, per city regulations.\"",
            "I would allow them to break their lease. Just let them know if they pay July's rent, they can move out at the end of July. If they say no to that, then you can't be bothering them very much. Let them know you can't stop construction, but you are abiding by the legal hours.",
            "Options are limited if tenant refuses to move. They can call the city and complain. City may send an inspector who will probably side with you, the homeowner. She may try and press her case in small claims court. But that takes time and during that time you should just continue to work. I would also guess the judge would side with you, the homeowner. \n\nI would just continue work as usual, during city approved noise hours. Keep some notes of what you did and the days/ times the work was done. In case you need to prove you are being responsible. You could even go so far as to give her a list of the days/times work will be taking place. So she can plan to be out of the house if necessary. Along with an estimated date of completion, I would add on at least a month to cover delays. \n\nI would avoid any plans to renovate her unit. Considering how she is handling renovations in a neighboring unit. Wait until they move and do it during turnover. We are always renovating units during vacates. I don’t think we have ever had a neighbor complain. And never that it was effecting their health and demand we stop. It’s going to be a lot more disruptive when she has a newborn. I would keep working and get it completed asap.",
            "It was inconsiderate of her to get pregnant when you were going to do construction. \n\n/s",
            "If you are following city code she hasn’t got a valid complaint",
            "We knocked a month of rent off two of our long term tenants when we demoed the upstairs units. Also told them if they wanted to move we wouldn’t hold them to their lease.  Both appreciated it and our attempt to limit the heavy stuff to daytime when they were both out. Also made sure to describe to them what the noises were (tile saw, carpet laying…so on) so they just didn’t think about it as annoying noise.\nBoth ended up staying.",
            "The tenant is an idiot. Carry on.",
            "Not a landlord, but if you're following city ordinances re: quiet hours and access to their unit, they have nobleg to stand on. After pregnancy comes sleeping babies, then curious toddlers. Better to get it done now than later."
        ]
    },
    "[Landlord-US-CA]Tenant refuses to pay final month's rent after leaving.": {
        "title": "[Landlord-US-CA]Tenant refuses to pay final month's rent after leaving.",
        "score": 8,
        "url": "https://www.reddit.com/r/Landlord/comments/1dqxgd4/landlorduscatenant_refuses_to_pay_final_months/",
        "content": "Hey everyone what should you do when a former tenant refuses to pay the finals months rent and has moved out already, my mother has kept the security deposit since he damaged the carpet, a few electrical outlets, and 3 windows in addition to other things. Is a demand letter an appropriate next step ? If so I am unsure of how to get his new address to mail the letter to him .\n\nShe's located in Riverside County  ",
        "num_comments": 17,
        "comments": [
            "When accounting for the security deposit, take the missed rent last as it's easiest to collect unpaid rent in small claims than collecting on damages.",
            "Your only real recourse is to go after them via collections or sue in small claims court but that's not worth the time and money. Take this as a lesson to collect first, last, and deposit at signing and be glad you're not dealing with a squatter instead.",
            "Demand letter then small claims court. It may cost about $200 to file but you get that back along with the rent judgment. Then you’ll have to get an order to garnish wages. It can be done.",
            "Property manager, CA. Send a demand letter to his last known address (yours). Continue to try and get his forwarding; if you need to serve him for small claims you'll need it. Perhaps contact utilities that were in his name and now in yours? Not sure if they'll release it but might be worth a try. Best.",
            "I once had a college professor (a very old man) tell my class you get the security deposit back by not paying the last month's rent.  \n\nI guess he was right.",
            "Damages magically total up to monthly rent",
            "First, last & SD doesn't work in CA. Last is an extension of security deposit, which is limited by  CA law.\n\nSmall Claims it is.",
            "Would using his previous address (ours) to mail him the demand letter via certified mail with return receipt result in USPS  forwarding it to his new address, and once delivered the return receipt will have his new address on it?\n\nI've also tried the link below but they were unsuccessful still list his current address as (ours)\n\n[fastpeoplesearch.com](http://fastpeoplesearch.com)\n\n[https://www.searchpeoplefree.com](https://www.searchpeoplefree.com)",
            "[fastpeoplesearch.com](http://fastpeoplesearch.com)\n\nSoon as they put another place on their credit report / utilities / whatever it should show up there.\n\nNot always accurate, but you might get lucky.",
            "I went to the post office with a former tenants mail  to give them their mail. I asked if they had filed for an address change. The clerk proceeded to look it up and gave me their new address. I handed over their mail and said thank you. Finding a tenant's new address shouldn't be too hard. BTW utilities do not share information."
        ]
    },
    "[Landlord-US-CA] Tenant caused damage to neighboring property ": {
        "title": "[Landlord-US-CA] Tenant caused damage to neighboring property ",
        "score": 3,
        "url": "https://www.reddit.com/r/Landlord/comments/1dr2k11/landlordusca_tenant_caused_damage_to_neighboring/",
        "content": "Hi, everyone!\n\nCurious if someone else has dealt with this before and if there is a proper order of operations.\n\nTenant moved out of condo, but in doing so, accidentally caused damage to neighboring condo with the moving truck. Police were called and a report was taken. The damage seems…minimal (considering it was a large moving truck), but lord knows it’ll likely be expensive to fix. \n\nI have a property manager but they’re pretty clueless on what to do, so I thought I might ask here.\n\nThe condo HOA is getting a quote on Monday and telling me the property owner is responsible and they will not be going after the tenant or their insurance. \n\nAssuming cooperation, my thought is that the tenant should file a claim through their driver’s insurance and get an adjuster out there to get a quote at least. \n\nIf they don’t do that, I’m not sure that I can use their security deposit to fix somebody else’s house. Also, the damage is likely going to be well over the deposit; plus, there’ll be some things that likely need fixing in my condo. \n\nFeels like a bit of a tricky situation. Anyone dealt with this kind of thing before? Or is it as simple as pull from the deposit and write a demand letter if the deposit doesn’t cover everything? ",
        "num_comments": 7,
        "comments": [
            "Property manager, CA. It sounds like the issue is between the neighbor and the tenant's auto or truck rental insurance. If you can get yourself out of the middle, no matter what the HOA says, that would be your best bet. The security deposit is for rent and damages to the unit only. This incident is between them, and shouldn't affect your interaction with your tenant.",
            "Sounds like the HOA is coming after me no matter what.",
            "The hoa is wrong. Simply tell them no and to contact the moving van company and driver’s insurance.",
            "Yes, I let them know this should go through the driver’s insurance. They said that’s all fine and good but it’s up to the property’s owner to assure that the Association property is properly repaired at no cost to the Association. \n\nSo no matter what, that means they’re going to send me a bill. I guess ball’s in my court to determine what happens afterward.",
            "I get what you’re saying but I would just say no and forward the bill to driver of the vehicle.",
            "Right that’s what I’ll do. If they don’t pay it, though, I’m not sure what the legal ramifications are.",
            "Probably depends on local laws but if they try and make you pay, and they are wrong about the law, they could end up in a lot of trouble themselves."
        ]
    }
}