{
    "Last Epoch Official Teaser | Harbingers of Ruin - July 9th": {
        "title": "Last Epoch Official Teaser | Harbingers of Ruin - July 9th",
        "score": 1032,
        "url": "https://youtu.be/Rer2_13tbao",
        "content": "",
        "num_comments": 199,
        "comments": [
            "I’m from the future. Harbingers summon minions from portals that drop tiny ass shards. There’s this cool new currency item that “fractures” an affix.",
            "is that Omega Weapon?",
            "Hype! Give us some more details!",
            "1.4  July 9th  2026 pog",
            "Finally, time to come back to the game for a new cycle. So hype!",
            "Uggghhhhh but Dawntrail comes out June 28.....",
            "Guess I was correct in my assumption that cycle 1 would be longer than four months... More time for more items, I approve.",
            "Very hype!\n\nWith a new cycle update, does that mean everything resets fresh like a Diablo/POE season and all current progress moves over to the core servers?",
            "HYPE!",
            "Oh shit that’s my birthday let’s fucking goooo"
        ]
    },
    "Pinnacle Content Poll Results!": {
        "title": "Pinnacle Content Poll Results!",
        "score": 116,
        "url": "https://forum.lastepoch.com/t/pinnacle-content-poll-results",
        "content": "",
        "num_comments": 26,
        "comments": [
            "Interesting approach",
            ">Well, 69.9% thought\n\nNice!",
            "You conclusion to question 2 is pretty flawed. If you remove the 2 extremes your result would conclude to use a 2 week period, not a one week period. You basically read the data in a way that fit your bias. Doesn’t matter to me, just interesting is all",
            "For a second I thought it was a full trailer for the  new cycle, come on man!!!",
            "unfortunate",
            "Sorry, I haven't played in a few months. Is Last Epoch now a competitive game with leader boards and stuff? Why do people care about this? Do they think they will have a chance at \"beating\" a streaming who plays 16 hours a day for a living? I only play offline, and having content metered out to me sounds really lame.",
            "Should honestly stick to the week after it would release, especially if planned to release after a group clears it instead of a solo.",
            "Boo",
            "No one cares about another boss. Where's the endgame?!",
            "It's not like they're obligated to go with the majority vote though. They just want some community insight to make a more informed decision and that's fine."
        ]
    },
    "I made a fun build that I can't wait for sharing": {
        "title": "I made a fun build that I can't wait for sharing",
        "score": 25,
        "url": "https://www.reddit.com/r/LastEpoch/comments/1dl9v3d/i_made_a_fun_build_that_i_cant_wait_for_sharing/",
        "content": "I was trying to make a Harbinger of Star build which never run out of mana. I tried a lot of things and find that's impossible. \n\nThen I got an idea. If I transform into something else as a primalist then I don't need to worry about mana anymore. \n\nBut how to sustain rage? Ok we have a lot of passives and skill nodes provide rage on hit/cri, but there is a fundamental problem that the more hits/crits you do the more meteor you trigger and the more rage you spend.\n\nThen I find that the spriggan form has it's special method to generate rage by summoning vines. Actually there is a build guide on lastepochtools which utilize Harbinger of Star in spriggan form. Now the problem is that the best transform skill for casting meteor is werebear form because it can convert strength to spell damage, but you can only summon vines in spriggan form...wait, there is an unique boot called Eterra's Path can summon vines for you while moving, and it also works while rampaging in werebear form.\n\nNow with the rage sustain problem solved, the build works but it's still quite weak because werebear is lack of fast attack skills to trigger meteor. Actually the best skill for primalist to trigger meteor is tornado but only swarmblade can use tornado...Oh wait there is a pair of unique gloves called Rule of Simoon which can cast tornado on hit.\n\n[https://www.lastepochtools.com/planner/oXlN0dbo](https://www.lastepochtools.com/planner/oXlN0dbo) \n\nNow here is the final build. I've tested it in a modified offline save and it can rampage through 1000 corruption monolith at ease(with optimized gears of cause), summoning tornado and meteor everywhere.\n\nI've submitted a build guide on lastepochtools. It's not approved yet but I can't wait for sharing.",
        "num_comments": 11,
        "comments": [
            "You know maul can summon vines too with the use of jump tree.\n\nHow does this build can tank easily at 1000corruption with low hp and poor ward. Have you a video?",
            "Any chance you could record some gameplay of the build? I’d love to see how it plays",
            "[Druid, Level 100 (Release / 1.0.6)](https://www.lastepochtools.com/planner/oXlN0dbo)\n\n---\n\n^(**Class:**)&nbsp;  \n^(Primalist &#40;30&#41; / Beastmaster &#40;8&#41; / Shaman &#40;5&#41; / Druid &#40;70&#41;)&nbsp;  \n\n^(**General:**)&nbsp;  \n^(▸ Health: **1,954**, Regen: **30**/s)&nbsp;  \n^(▸ Mana: **368**, Regen: **9**/s)&nbsp;  \n^(▸ Ward Retention: **404%**, Regen: **0**/s)&nbsp;  \n^(▸ Attributes: **101** Str / **10** Dex / **101** Int / **19** Att / **10** Vit)&nbsp;  \n^(▸ Resistances: **111%** / **73%** / **75%** / **99%** / **72%** / **80%** / **82%**)&nbsp;  \n^(▸ EHP: **3,165** / **3,088** / **3,149** / **3,542** / **3,058** / **3,165** / **3,165**)&nbsp;  \n\n^(**Defenses:**)&nbsp;  \n^(▸ Endurance: **20%**, Threshold: **391**)&nbsp;  \n^(▸ Dodge Chance: **2%** &#40;**47**&#41;)&nbsp;  \n^(▸ Armor Mitigation: **28%** &#40;**1,341**&#41;)&nbsp;  \n^(▸ Crit Avoidance: **96%**)&nbsp;  \n\n^(**Damage Types:**)&nbsp;  \n^(▸ __Physical__, __Lightning__, Cold / __Spell__, __DoT__, Melee)&nbsp;  \n\n^(**Buffs:**)&nbsp;  \n^(▸ None)&nbsp;  \n\n^(**Used skills:**)&nbsp;  \n[^(Spriggan Form)](https://www.lastepochtools.com/skills/spriggan_form) ^| [^(Werebear Form)](https://www.lastepochtools.com/skills/werebear_form) ^| [^(Tornado)](https://www.lastepochtools.com/skills/tornado) ^| [^(Maelstrom)](https://www.lastepochtools.com/skills/maelstrom) ^| [^(Warcry)](https://www.lastepochtools.com/skills/warcry)\n\n^(**Used unique items:**)&nbsp;  \n[^(Cleaver Solution)](https://www.lastepochtools.com/db/items/UAzBMGYEYBYg) ^| [^(Tears of the Forest)](https://www.lastepochtools.com/db/items/UAzAsCYHYA4g) ^| [^(Eterra's Path)](https://www.lastepochtools.com/db/items/UAzAswJgRiA) ^| [^(Harbinger of Stars)](https://www.lastepochtools.com/db/items/UAzBsCYA5KA) ^| [^(Peak of the Mountain)](https://www.lastepochtools.com/db/items/UAzBMoVgNiA) ^| [^(Exsanguinous)](https://www.lastepochtools.com/db/items/UAzDMwRgo) ^| [^(Red Ring of Atlaria)](https://www.lastepochtools.com/db/items/UAzDMCYHZKA) ^| [^(Rule of the Simoon)](https://www.lastepochtools.com/db/items/UAzDsEYE5KA) ^| [^(Throne of Ambition)](https://www.lastepochtools.com/db/items/UAzCsCYEZKA)",
            "I did a druid harbinger combo as well but I didn't care about mana at all as I was just getting enough CDR and transforming to human<->bear repeatedly. You refill mana on transform to bear (which happened every 8s or so).",
            "Cleaver solution+low life is a really easy path for primalist to become ultra tanky.  You get a lot of damage reduction and defenses to the point that the main issue is usually damage for these builds.  Strength is a miracle stat giving you armor, ward retention, and damage which scale extremely well with the defensive layers afforded to primalist.  That's why in the pre 1.0 patch, EQ beastmaster was regarded so highly, because it was ultra tanky, pretty fast, and most importantly, wasn't atrocious to play with good damage.  That being said, it looks like red ring+harbinger damage reduction is doing a lot of heavy lifting here since they're using the more traditional 2 exsang mod build rather than having last steps+gloves and should be around 5K stable ward which is a little under what I would want to push higher corruption.  \n\nAs for why they're using maelstrom+warcry instead of furyleap, it's because part of this idea has been explored for autobomber druid builds.  You definitely want maelstrom stacks if you can get them because storm bolts help you proc meteors and gain some rage on top of the other buffs maelstrom gives and warcry is a free way to get maelstrom stacks while also giving you a lot of extra survivability and vacuums so the meteors hit more things.  As a result, you end up without a slot for fury leap.  Also if you maul, you stop rampaging and have to wait for the animation, but for this kind of build, you want to rampage as much as possible.\n\nFWIW in the pre 1.0 patch I did mess around with a version of this build in ~200-250 corruption and usually my problems began when I got bounced out of werebear form or wasn't proccing meteor/critting enough which both should be solvable with better gear, so I could see this build being playable with BIS gear in higher corruption.",
            "Haha. This comment reminded me of poe vids that are like, \"dont worry, you dont need a HH or mage blood. I just found them while lvling so I used them\".",
            "I've tried maul. The problem for maul is that you have to spec in Fury Leap or Entangling Roots to summon vines. This build requires spec-ing at least 3 skills, Werebear form, Spriggan form and Tornado. So if you spec in Fury Leap or Entangling Roots, there will be only one skill slot left available, which means you give up the roar - maelstrom - storm bolt mechanism because that requires spec-ing 2 more skills, thus you lose a significant proportion of your DPS that you have no way to make up.\n\nWhy this build can survive 1000 corruption? Because you don't need to stop moving for more than 1 second. And the ward is not poor at all. With strength converted to intelligence, you have about 400% ward retention. Last Steps of the Living provides 11%-15% missing health gained as ward/s, you can use a tier 5-6 experimental affix on gloves to make up the loss from not using Last Steps of the Living. The ward of my test character is 5k+.\n\nI can make a video but I don't have a youtube account.",
            "LL ward bear builds largely still depend on higher than usual max health for LL builds plus aspect of the boar for their survivability.\n\nThis build has neither plus isn't even running the full 3 piece missing health gained as ward setup while dual wielding, it very much is not gonna have great EHP.",
            "Exactly what i was thinking\n\nAnd for damage i doubt meteor is enough for bossing at 1000corruption easily like OP says. I doubt it is achievable in a decent timing or maybe tornado  make it proc a lot more than i think (more than 10 time per second on mono target???)\n\nBecause meteor damage is good enough for echoes but definitely not high, you don't have any more multiplier of meteor tree and strength stacking is good but can't make up for it.\n\nI mean this build with all his very expensive stuff should works on 400c but not very much higher, not for boss.",
            "Decided to run the numbers on it with [gear a little optimised for survivability](https://www.lastepochtools.com/planner/AKxMMrvQ)\n\nActually turns out... okay on the ehp front. OP's setup is missing a lot of potential HP and it is intended to be basically a constantly moving ranged setup to the hit EHP isn't as important for mapping. Still pretty squishy to one shots tho."
        ]
    },
    "Damage Reduction on Boss": {
        "title": "Damage Reduction on Boss",
        "score": 1,
        "url": "https://www.reddit.com/r/LastEpoch/comments/1dlppa2/damage_reduction_on_boss/",
        "content": "I saw a Twitter post yesterday about the Devs going to address the horrible design choice of Damage Reduction on bosses. Did anyone catch the stream and if so let me know what they said in regards to this point\n\n  \nThanks",
        "num_comments": 8,
        "comments": [
            "They are going to use ward. After u get to a certain spot on the hp bar indicated by a marker on the bar (kinda like d4 boss bar) the boss will gain ward. He showed an example of a boss having 4 blips?! (Not sure what to callem) Also said some bosses could have more or less. also getting to the blips causes a small stun to the boss he said more of an interrupt.",
            "Ok thanks did they say what happens at each section after you reach the blips like for example before blip 1 0% dmg reduction blip 2 25% dmg reduction etc? I am confused",
            "You should go watch the vod",
            "No more dr when u hit a blip the bar fills with ward and u gotta get thru that ward and hp",
            "It is a 2 hours video. Or there is a summary somewhere?",
            "OK thanks. Lets hope its better than current situation.",
            "You can skip to the boss Dr part",
            "There is no chapter in video here is a link to the right timing for other people looking for infos :https://www.twitch.tv/videos/2178032937?t=01h08m34s"
        ]
    },
    "Inheritance inside skill tree - can you double dip?": {
        "title": "Inheritance inside skill tree - can you double dip?",
        "score": 1,
        "url": "https://www.reddit.com/r/LastEpoch/comments/1dlppbn/inheritance_inside_skill_tree_can_you_double_dip/",
        "content": "I know ailments inherit general damage multipliers (which are not specifically for hits).\n\nWhat about spells cast while using a certain skill?\n\nFor example if I use the skill surge with the \"Electropulse\" node, casting lightning blasts during surge, do I double dip in for modifiers in both the storm blast tree and in surge?\n\nFor example if I take storm battery or concentrated battery which have generic more damage, do the strom blasts benefit from this? same for the ward on hit?\n\nAt first I thought you cannot double dip, but if I look at the \"ride the lightning node\" it says surge deals more lightning spell damage, and it is connected to the nodes that make you cast stromblast, so if you cannot inherit this to the stormblast there isn't much point, as surge is a melee skill.\n\nWhich makes me wonder, can you double dip?",
        "num_comments": 3,
        "comments": [
            "If it is a subskills = a skill that proc in a main skill tree and has not a tree of his own then it inherit damage modifier from the main skill tree (more and flat and ailments chance)\n\nIf it is a skill that has his own tree then he doesn't inherit the tree of the skill that triggered it.\n\nSome very rare subskills can be boosted in different skill tree (caltrop in net and aerial assault), some other has items that boost them in addition of their inheritance of main skill tree (fire dagger relic and fire dagger of cinderstrike)\n\nSo no double dip.",
            "Thanks.\nI see, so basically “ride the lightning” spell damage buff component doesn’t work for lightning blast?\n\nIt seems a bit poorly designed as surge is a melee skill. Which means that this node will not buff surge or lightning blast.\n\nI assume it can buff spark charge, but then it would make more sense if it wasn’t placed past the lightning blast nodes.",
            "I went to see the specific tree and yes it is a very strange tree part...\nIt shouldn't impact lightning blast by usual rule.\n\nMaybe the more spell lightning damage is global during surge but in that case the wording is wrong.\n\nhttps://forum.lastepoch.com/t/surges-electropulse-ride-the-lightning/41704"
        ]
    }
}