{
    "Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?": {
        "title": "Rule 6 \"no lesser evil\" rhetoric - is it accelerationist or doomer? Is it intended to discourage voting?",
        "score": 372,
        "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1bt0nag/rule_6_no_lesser_evil_rhetoric_is_it/",
        "content": "Reposting the answer given to a user who was asking in good faith if accelerationism is the reason we have the rule about not using lesser evil arguments to encourage people to vote for a Democrat or a Republican political candidate. We were asked if the reason we ban pro-Democrat or pro-Republican lobbying is out of a belief that things needs to get worse before they can get better. We endeavored to address those concerns and the user asking was satisfied with the answer, so it's being posted and stickied on its own here, with the goal that as we progress through the election show we can refer people back to this. \n\n1. It's not accelerationist. Not a single one of the 852000 people subscribed to the subreddit have the ability to accelerate capitalism and the American empire towards a crisis point *\\*faster\\** than Joe Biden is right now by risking re-election in the myopic support for an unpopular genocide. Look at Biden's professed bipartisanship on border security, are those the actions of a person concerned about losing to a fascist dictator?\n\n2. We aren't of the opinion that \"both options are equally evil\" or that one is a lesser or a greater evil. Both options are capitalists. They are the same option. Biden and Trump represent the capitalist class. Their victory is the victory of the capitalist class. Picture a guy with a puppet on each hand. The left hand is named Biden. The right hand is named Trump. The owner of these puppets is [putting on a Punch and Judy show](https://en.wikipedia.org/wiki/Punch_and_Judy). People are **very mad** at us for recognizing that it's a Punch and Judy show.\n\n3. People should definitely vote. If the PSL is on your ballot for the presidential election please vote for the PSL so that socialists as a whole can gauge the numbers of revolutionary socialists out there. This will be *especially* important as the inability of Capital to resolve its contradictions leads to increasing and deepening crises that we can already see are not alleviated when a Democrat is in office. If you've got any direct election ballot issues like abortion rights or marijuana legalization or even a tax levy for your school district or something, vote for those. Past that, vote your conscience. Look up every candidate, and weigh their positions against your own, and if you can't stand to vote for them, for a candidate for Judge or City Council or whatever, leave it blank.\n\n4. Protest, donate to bail funds, disrupt city council meetings, speak up at school board meetings, join strike actions to shut down ports shipping weapons to a genocide, volunteer with Food Not Bombs, donate to Doctors Without Borders, on and on, the possibilities for **meaningful** political participation are endless, our options are limitless. We are not helpless, we are not hopeless, we are not trapped, but the Capitalists certainly want us to think we are. \n\n5. Before you ask about Project 2025, and everybody always does, realize that it's just the fancy name they've given this time to the process of all the political appointees in the executive branch getting changed out for different political appointees. The right wing is pitching it this time as \"Project 2025\", last time it was \"Drain the Swamp\". The capitalist party are capitalists. This is a **product** that they are selling. Literally, as they sell hard copies of it for $35 to credulous marks on their website. It's a great trick, its intended to convince conversatives that the impossible things they desire are possible and there's a plan in place for them to be enacted, they just have to wait and Trust The Plan. It is also intended to convince liberal voters that there's an even greater threat than the genocide the Biden administration is an eager accomplice in, so they need to donate and stay engaged. I'm surprised there's not a liberal Project 2025 project yet, liberal voters are panicking because there clearly isn't a countering plan. \n\nIn closing, rule 6 isn't accelerationist, Biden's presidency has been accelerationist. Fuck, look how much closer he got us to WW3 than even Trump could manage in his fascist incompetence. And our view isn't that things need to get worse before they get better, but that support for Democrats demonstrably leads to things getting worse, and we have to stop supporting Capitalists if we want victories for the working class and a way out of the worsening conditions. From our perspective desperately clinging to bourgeois \"democracy\", particularly at a time when we can all recognize that we aren't allowed any real choices in voting and that's been the case for decades at this point, makes things worse and slows or entirely stops our ability to bring about positive change.",
        "num_comments": 2,
        "comments": [
            "This post is locked to prevent brigading by liberals and conservatives.\n\nLiberals like to concern troll and present themselves as open eyed political realists who are just trying to help us make the right decision. They do not like being questioned. Here's some of the replies we get after banning liberals for breaking rule 6:\n\n>Go fuck yourselves and fuck your boy Trump too. Get back to bagging my groceries you fucking broke ass losers. I'm looking forward to seeing you all suffer for your decisions\n\nand\n\n>If Trump wins you'll know it's my alternate account when your posts about how life got worse for your and for Palestinians I'll just be posting: Hahahahahahahaha hahahahahahahaha hahaha reap what you sow you dumb fucks. Keep an eye out for me\n\nand\n\n>Good luck with the political strategy of doing nothing and complaining that you don't get your way 🙏 see you in the GOP's death camps\n\nand\n\n>Clownish fucking ML morons. I genuinely hope you get sent to camps or something. I'm a better leftist.\n\nand\n\n> So long, I hope your accelerationism gets you exactly what you deserve. Morons.\n\nThese are all just in the last week or so. They don't have our best interests in heart. They aren't good faith allies. The moment they get a little bit of pushback they become frothing fascists themselves. They want us to obey them and if we don't they'll laugh about us being put in camps. We have to have a plan for our safety in the future and the safety of our communities that doesn't rely on trusting false people for our protection.\n\nFor your entertainment, I leave you with [a clip of Patrick Stewart, playing Lenin in \"Fall of Eagles\", saying \"Don't trust the liberals\"](https://www.youtube.com/watch?v=ToRiwWHzRnM)."
        ]
    },
    "Happy pride month! Remember: The fight against capitalism and the fight for LGBT+ liberation are inseparable.": {
        "title": "Happy pride month! Remember: The fight against capitalism and the fight for LGBT+ liberation are inseparable.",
        "score": 115,
        "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1d8nyfa/happy_pride_month_remember_the_fight_against/",
        "content": "A wonderful pride month to all LGBT+ comrades! Remember: Being gay is not enough, we must also do crime.\n\nThe capitalist system, based on the private ownership of the means of production and the exploitation of wage labor in order to accumulate new means of production in the form of capital, continues to fail to realize its false promise of liberty, equality and justice for all.\n\nWhile capital historically has had a tendency to destroy traditional hierarchies and identities, this was only in the service of integrating as many humans as possible into the work force. The larger the supply of the labor-power commodity, the cheaper it can be bought.\n\nAccordingly, this \"emancipation\" from the bigotry of tradition stalls as soon as we are all reduced to a proletarian existence, and equality no longer serves capital. In fact, keeping the working class internally divided by means of racism, sexism, homophobia, transphobia or ableism undermines our ability to exercise solidarity and unite in our struggle against capital.\n\nOf course this is only half the story. While capitalism destroyed the traditions of past modes of production, it was at the same time an active producer of new ways of dividing humans in order to oppress and exploit them. The development of capitalism went hand-in-hand with the pursuit of colonial conquest and the transatlantic slave trade, providing industries in Europe with raw materials. Capitalism turned racism into a global, structural phenomenon, and subjected countless cultures to white colonial domination when not outright annihilating them. This also involved imposing repressive European views of gender and sexuality and erasing native perspectives that were less obsessed with compliance with such binaries.\n\nControlling gender and sexuality has always had special importance in class society because it allows for the control of reproduction through the institution of the family. Class membership is inherited within the family, so norms making reproduction controllable by assigning strict gender roles based on reproductive organs are an important component in the perpetuation of class distinctions. Furthermore, the reproduction of the working class is of direct economic importance to capitalism, as the supply of labor power depends on it. The existence of queer people calls all such norms into question.\n\nTherefore, the struggle for LGBT+ emancipation and the proletarian struggle against class society are intrinsically linked. It is both necessary to fight for LGBT+ emancipation in order to fight capital, and to fight capital in order to achieve LGBT+ emancipation.\n\nNone of us can be free until we are all free. The proletariat is queer, and queerphobia is anti-proletarian. It is our absolute responsibility to fight with and protect our queer comrades from reactionary assaults on their freedom to be themselves. The recent right-wing campaign of annihilation against our gay and trans siblings in the United States must be resisted at all costs.\n\nThe time to unite is now.",
        "num_comments": 10,
        "comments": [
            "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "Liberal: \"But... but, what will we do without corporations like Lockheed Martin having rainbow colors on twitter?\"",
            "The Democrats will allow LGBTQ rights to be stripped away to avoid addressing class issues.",
            "Wtf why would you incite people to commit crime?",
            "[removed]",
            "They won't protect LGBT+ rights but will happily hold them hostage because otherwise Trump and republican zealots will absolutely take them away. Same with abortion and reproductive rights.",
            "In Minecraft, duh.\n\nBeing gay IS a crime in several countries, including some parts of the United States."
        ]
    },
    "Meanwhile I'm paying my landlord's mortgage": {
        "title": "Meanwhile I'm paying my landlord's mortgage",
        "score": 1316,
        "url": "https://i.redd.it/xqzhggekl28d1.jpeg",
        "content": "",
        "num_comments": 151,
        "comments": [
            "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "Not only your landlord's mortgage, but you are paying for free healthcare and college tuition for every Israeli citizen.",
            "Almost every industrial nation offers it's citizens universal healthcare. Idiots in this country with their propaganda machine claim we're going to kill Granny, socialism is bad and we can't afford it. Yet, when it comes to funding to kill people via our own wars or wars of others. We always have enough money to go around. When are we going to put a stop to this bs?",
            "Good post for finding bots too.",
            "Lol this post getting brigaded by \"China is about to collapse\" narrative.\n\nI BEEN HEARING THAT SHIT MY WHOLE LIFE.",
            "It is interesting to note that a nation with a communist ideology has surpassed capitalist countries in the realm of capitalism.",
            "Yes but always remember kids: China bad!",
            "Property ownership is so weird and complex in China, even for natives. Have a check about it.",
            "Appartment is seen as a must before marriage, so it's paid buy the family. Ratio between income and housing prices are terrible in China, a lot worse than in Germany :(\n\nWithout apartment it's called naked marriage, and was a taboo just a decade ago",
            "Can someone recommend books about current china without the western propaganda?"
        ]
    },
    "Seen in Belfast, Ireland. They shouldn't be allowed in pretending to be normal after everything they've openly done. It was social and economical exclusion that forced South Africa to end their apartheid": {
        "title": "Seen in Belfast, Ireland. They shouldn't be allowed in pretending to be normal after everything they've openly done. It was social and economical exclusion that forced South Africa to end their apartheid",
        "score": 3774,
        "url": "https://i.redd.it/nadgiwqt4z7d1.png",
        "content": "",
        "num_comments": 123,
        "comments": [
            "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "Good for them. I really admire the Irish people for unapologetically standing up for a belief that's unpopular amongst other Western governments, and they've done it since October. \n\nI live in NYC and we have soooo many goods made in Israel in various grocery stores here, that I have to check before I buy something.",
            "The Irish know about colonialism and oppression. Especially those in the north of Ireland 🇮🇪",
            "Ireland has a keen understanding of genocide by artificial famine",
            "Zionists have shown no interest in being a part of humanity. They shouldn't be allowed or let into social circles. They should be shunned and isolated like or more than how the apartheid supporters in South Africa were, and any attempt at pretending like they're normal should be shut down. It was social and economical exclusion that forced them to stop their racial apartheid, they couldn't go anywhere or do anything. And they've shown what satanism they're supportive of in complete supremacist disregard for everyone and everything in the world driven by their ideology, they can't be allowed in pretending to be polite people after this.",
            "The more I learn about Ireland the more respect for it I have.",
            "Well if anyone knows oppression it's the Irish.",
            ">Belfast, Ireland\n\nGood lad, OP",
            "Better be careful before the U.S. decrees that this is an act of war based on the anti-boycott laws they have for Israel",
            "Sabra is just dogshit so that’s an easy one"
        ]
    },
    "Here's the subtitled interview of Badr Dahlan, the freed tortured Palestinian prisoner, that some were asking for. Link for video in replies.": {
        "title": "Here's the subtitled interview of Badr Dahlan, the freed tortured Palestinian prisoner, that some were asking for. Link for video in replies.",
        "score": 408,
        "url": "https://i.redd.it/k9nw95jn328d1.gif",
        "content": "",
        "num_comments": 17,
        "comments": [
            "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "https://youtu.be/eB3NJsdDGRI?si=0E5oRHgPZAaw-0XnHe\n\n\nhttps://x.com/SuppressedNws/status/1804113852319121641\n\n\nWhen he's asked what they did to him, in this video it's translated as \"unintelligible\", but in the second video he says they smashed his head on the bus and he wasn't allowed to look up.\n\nThese are the prisoners the Palestinian resistance set out to free by taking hostages, this situation was brewing before October 7, it wasn't some outburst of anger. These prisoners are very well documented facing systematic intense physical, mental, and sexual torture, including kids, for decades now, completely unprovoked.\n\nYou can tell he's self aware about his condition and tries to hide it to trying not to put off people. I really just want to comfort him. Every life stolen must be brought to justice.",
            "One of the most disturbing videos I’ve seen. The   level of pure evil behind this is unfathomable.",
            "Zionism is a disease of the human soul.",
            "The way he moved his head up when he was asked a simple question, indicates plainly, a trained anticipation to terror.  God damn Israel.",
            "Holy fucking shit. The way he says “a nightmare”.",
            "No matter what the doctors do, he will not recover from this. Poor man, I hope he finds peace and happiness again. :(",
            "How can we expect anyone to endure the trauma Palestinians have survived? \n\nThere is not enough focus on the mass trauma they're enduring and have endured for a generation. It's unconscionable to know even a fraction of what these people have suffered under the israeli occupation.",
            "Is zionism the legacy of the Holocaust?",
            "FUCK Zionism and FUCK the terror state of Isnotreal"
        ]
    }
}