{
    "This is not a place to be wrong and belligerent about it.": {
        "title": "This is not a place to be wrong and belligerent about it.",
        "score": 2351,
        "url": "https://www.reddit.com/r/law/comments/x2m3vr/this_is_not_a_place_to_be_wrong_and_belligerent/",
        "content": "A quick reminder: \n\nThis is not a place to be wrong and belligerent on the Internet. If you want to talk about the issues surrounding Trump, the warrant, 4th and 5th amendment issues, the work of law enforcement, the difference between the New York case and the fed case, his attorneys and their own liability, etc. you are more than welcome to discuss and learn from each other. You don't have to get everything exactly right but be open to learning new things. \n\nYou are not welcome to show up here and \"tell it like it is\" because it's your \"truth\" or whatever. You have to at least try and discuss the cases here and how they integrate with the justice system. Coming in here stubborn, belligerent, and wrong about the law will get you banned. And, no, you will not be unbanned.",
        "num_comments": 281,
        "comments": [
            "The shit you guys are probably wading through on this issue is enough to make Andy Dufresne give up.",
            "Thanks for your hard work, mods!",
            "I hate when r/confidentlyincorrect starts leaking.",
            "Can I still occasionally stumble in here drunk after hours and go into poorly sourced, belligerent outbursts about our 3rd Amendment rights being under threat?",
            "WELL F\\*\\*\\*\\*g FIRST OFF....this is a good post. Thanks mod.",
            "Damn right.",
            "Would you all consider flairs to identify who's an attorney and who isn't? I'm not one but enjoy reading r/law because it's normally lawyers chatting and I learn a great deal just reading those conversations.",
            "Muh freeze peach!!",
            "Back when I was a kid in the late 60 - early 70s, you could get a raw egg blended into your Orange Julius.\n\nI appreciate this sub",
            "This is absolutely my favorite sub because of all the respectful discussion, lack of ad hominim attacks, and serious legal brilliance of so many posters. This sub is one of Reddit's true gems. Keep up the good work Mods and everyone else."
        ]
    },
    "I’m Jordan Rubin, writer of MSNBC’s Deadline: Legal Blog and a former prosecutor, and I’m here to talk about the Supreme Court’s term, including Trump’s presidential immunity case – AMA!": {
        "title": "I’m Jordan Rubin, writer of MSNBC’s Deadline: Legal Blog and a former prosecutor, and I’m here to talk about the Supreme Court’s term, including Trump’s presidential immunity case – AMA!",
        "score": 51,
        "url": "/r/scotus/comments/1dhcin9/im_jordan_rubin_writer_of_msnbcs_deadline_legal/",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "UPDATE, emergency application now filed. Steve Bannon begs Supreme Court to save him after appeals court refused prison sentence delay": {
        "title": "UPDATE, emergency application now filed. Steve Bannon begs Supreme Court to save him after appeals court refused prison sentence delay",
        "score": 4082,
        "url": "https://lawandcrime.com/high-profile/steve-bannon-begs-supreme-court-to-save-him-now-that-appeals-court-has-refused-prison-sentence-delay/",
        "content": "",
        "num_comments": 389,
        "comments": [
            "From \"no jail can hold me\"\n\n To \"somebody please help!\"",
            "Is the argument still going to be: \"I'm the voice of MAGA, millions depend on me?\"",
            "Even with the SCOTUS as problematic as they currently are, I struggle to envision a realistic scenario where they don't decline to take this case. Is there any constitutional question relating to Congress' contempt powers?",
            "He got FOUR MONTHS.  He needs to MAN UP and do his time.",
            "Jesus. It's not like they're going to put him away for life. Why fight it? Martha Stewart didn't fight it. She pulled up her big lady pants and went to the slammer with a smile on her face. She emerged unscathed. For a guy who pretends to be a bad ass warrior, he's pretty scared of a couple of months in a cell.",
            "The alcohol withdrawal might kill him",
            "Geez, court of appeals was 2-1.  He got a vote in his favor.",
            "Its only an emergency for him.  Jamaal in Baltimore gets no such consideration.  I really hope he gets some rehabilitation in.  Alcohol counseling and vocational training.  When he gets out hell need an honest job.",
            "Bannon's goal isn't to stay out of jail.  His goal is to weaken the public's faith in an unbiased judiciary.  Anything the Supreme Court does now will help that cause.",
            "I'll never understand why anyone falls for the \"tough guy\" front these losers put up. Suck it up and do your time like a man, you coward."
        ]
    },
    "Judge unseals new documents relating to Mueller team's effort to compel an Egyptian government-owned bank's compliance with a subpoena seeking information about Trump's mysterious, last minute $10m contribution to his own campaign near the end of the 2016 election [PDF]": {
        "title": "Judge unseals new documents relating to Mueller team's effort to compel an Egyptian government-owned bank's compliance with a subpoena seeking information about Trump's mysterious, last minute $10m contribution to his own campaign near the end of the 2016 election [PDF]",
        "score": 887,
        "url": "https://www.dcd.uscourts.gov/sites/dcd/files/18-gj-41%20Opinions%20%26%20Orders.pdf",
        "content": "",
        "num_comments": 23,
        "comments": [
            "Most of the information in these filings was already known, although it has been memory-holed to some extent because the investigation fizzled out after the Egyptian bank stonewalled for long enough that the DOJ just gave up on the investigation.\n\nOne new and potentially momentous piece of information jumped out at me though. On p. 20 (PDF numbering), the court wrote,\n\n> [Redacted Egyptian bank] argues that complying with the subpoena would require violating Country A's Banking Law, Country A's Anti-Money Laundering Law (\"AML Law\"), and unspecified law in Country B.\n\nLater in the PDF on p. 48, in a separate memo, the court specifies in a footnote that, \"Country B is the People's Republic of China.\"\n\nWhat possible reason would an Egyptian bank need to worry about breaking Chinese law by providing information to a US prosecutor about a $10m transfer from their bank (in Egypt) to Donald Trump (in the US)? I cannot think of a single reason that does not involve some or all of the funds originating in China.\n\nSupposedly Ron Rosenstein told Mueller not to dig too deeply into Trump's finances, so this appears to be the only real probe of Trump's finances as they relate to foreign election interference. What he so poisonously refers to as \"the Russia hoax.\" The Egyptian bank's stonewalling made it impossible for Mueller to proceed with the case as Special Counsel because the rest of the investigation had concluded and it wasn't clear whether the Egypt investigation would go anywhere. So he closed up shop and submitted his report to Barr, handing the rest of the Egypt investigation off to a team at DOJ, which promptly did absolutely nothing about the investigation until it was quietly dropped during the height of the pandemic when the public was distracted, to say the least.\n\nSo this probe never went anywhere, and we should all be very concerned about that. If there was ever going to be a smoking gun demonstrating Trump's corruption, it was always going to be financial. Following the money was always the best strategy and Rosenstein knew precisely what he was doing when told Mueller not to pursue that angle. He was crippling the Mueller probe from the get-go. It is incredibly concerning that a case like this was just summarily dropped, despite a large volume of evidence suggesting a Chinese-domiciled entity or person transferred the enormous sum of $10m to Trump so he could fund his campaign for the last few weeks of the 2016 election season. Given how close that election was, that amount of money could very well have been decisive, and thus it's entirely possible the CCP put Trump in the White House. Making him literally the Manchurian Candidate.\n\nEdit: [Here's a more reputable source than me that summarizes the broad strokes of this strange Mueller subplot.](https://edition.cnn.com/2020/10/14/politics/trump-campaign-donation-investigation/index.html)",
            "This subpoena perhaps?\n\n\nhttps://www.cnn.com/2019/06/07/politics/mystery-mueller-grand-jury-off-the-hook/index.html",
            "Rosenstein should have been charged with obstructing justice and whatever else a special prosecutor could come up with, three years ago.",
            "[thread from 5 years ago](https://www.reddit.com/r/The_Mueller/comments/by4a6t/mystery_company_off_the_hook_from_mueller/)\n\n[CNN article from 2020](https://www.cnn.com/2020/10/14/politics/trump-campaign-donation-investigation/index.html)",
            "Rosenstein was like a Republican babysitter. He was always a career climber hack. Which is what is argued in the banality of evil about what happened in Germany in the 1930s. \n\nTrump has been known to be a money launderer for the worst people in the world for decades. I don’t believe the house and senate intel committees didn’t know about all of trumps dirty work. I believe the Rs think they will benefit from him as president. \n\nJust one example, trump built a tower in Azerbaijan that looks like a money wash for the IRGC’s ICBM program. He cleaned money for the Iranian govt so they could build ICBMs. There’s no way the house and senate intel committees were unaware. And he’s done so much more than that. Our government is deeply corrupt\n\nhttps://www.newyorker.com/magazine/2017/03/13/donald-trumps-worst-deal#:~:text=The%20President%20helped%20build%20a,tied%20to%20Iran's%20Revolutionary%20Guard.&text=Heydar%20Aliyev%20Prospekti%2C%20a%20broad,the%20airport%20to%20the%20city.",
            "We really dropped the ball on the Mueller case, and in terms of law, the special function of the special council was mostly impotent. Now even moderate information sources talk about the Mueller investigation so inconclusively like \"It's definitely a thing that happened\" because what could have been impactful was muted and framed to the party's liking.\n\nThe way republican congressmen talked about Trump before he was the primary candidate indicate fairly wide knowledge of his foreign money laundering operations. And while there is clearly also something alarming going on between Trump and Putin (see: Helsinki Summit), Mueller was ultimately chasing the wrong car.\n\nI wonder what Mueller thought of it? Who would have thought that between Russia and the documents case it would be a hush money case and that rape slander case that caught him. It's all backwards.",
            "It occurs to me that the smoke and mirrors they used to move the money (likely from China through Saudi Arabia) could be considered a hoax, as in a “malicious deception”. If Russian agents of any kind were also involved, then it could be a “Russian hoax”.",
            ">What possible reason would an Egyptian bank need to worry about breaking Chinese law by providing information to a US prosecutor about a $10m transfer from their bank (in Egypt) to Donald Trump (in the US)? I cannot think of a single reason that does not involve some or all of the funds originating in China.\n\nGotta say: I did not think \"Egyptian violations of Chinese banking laws in support of the Republican party\" would be on my bingo card of reasons to drink.\n\nAnd yet here we are.",
            "We need no new evidence of Trumps corruption to prove he is a corrupt individual.",
            "Did mueller willingly wrap up the investigation or did Barr force it"
        ]
    },
    "The Trump Docket: How long can the Supreme Court wait to rule on Trump's immunity claim?": {
        "title": "The Trump Docket: How long can the Supreme Court wait to rule on Trump's immunity claim?",
        "score": 1247,
        "url": "https://lawandcrime.com/high-profile/the-trump-docket-with-june-nearly-gone-how-long-can-the-supreme-court-wait-to-rule-on-trumps-immunity-claim/",
        "content": "",
        "num_comments": 131,
        "comments": [
            "There’s 14 cases left. 4-5-5 for W-Th-F next week (with at least two potentially being PC’s) makes the most sense. Trump v. US will undoubtedly be the last opinion to come down, either because it’s a PC or because Roberts wrote it himself, and because it will almost assuredly come on Friday.",
            "Has it ever happened before that SCOTUS had a case involving one of the candidates for President within a year of the election and they didn't expedite it?",
            "Just wait until SCROTUS really kicks the can down the road by sending this back to the lower court to define “official” acts. Then trump can appeal it back up to SCROTUS so they can decide after trump is not elected. If he’s elected the whole case goes away.",
            "Until the last possible hour, as to delay it further",
            "After the election is the SCOTUS plan.  They hope he wins, then they give him immunity, and he can have everyone he hates assassinated.\n\nIf he doesn't win, he's going to prison no matter what.\n\nEDIT:  Downvote all you want, but the only realistic reason to delay the ruling is to help Trump.",
            "IANAL, what is \"PC\" in this context?",
            "They have summer jobs lecturing and stuff. They want to get out of Dodge.",
            "Technically, they don’t have to rule on it before summer break. I won’t be surprised either way.",
            "No. Think Nixon vs. US and Bush vs. Gore. They heard these cases and made rulings in days.",
            "Sure has. Right f’in now."
        ]
    }
}