{
    "July 2024 Bar Exam Megathread": {
        "title": "July 2024 Bar Exam Megathread",
        "score": 8,
        "url": "https://www.reddit.com/r/LawSchool/comments/1dip0ej/july_2024_bar_exam_megathread/",
        "content": "Have study tips? Want to complain? Want to commiserate? You're in the right place!\n\nPlease keep Bar Exam chat in this thread to clear up space on the rest of the subreddit.\n\nSome helpful comments from an older thread:\n\n - [/u/Spearmints's Bar Slayer's Guide](https://www.reddit.com/r/LawSchool/comments/8l91mu/official_july_2018_bar_exam_thread/dzdym1i)\n\n- [/u/Spearmints's guide v2.0](https://www.reddit.com/r/LawSchool/comments/a71sv8/february_2018_bar_exam_megathread/ec3css4). Thanks for updating, /u/Spearmints!\n\n - [/u/DubsComin4DatASS shares some tips, California](https://www.reddit.com/r/LawSchool/comments/8l91mu/official_july_2018_bar_exam_thread/dze9gr8)\n\n - [/u/30rockettes shares more tips, Florida](https://www.reddit.com/r/LawSchool/comments/8l91mu/official_july_2018_bar_exam_thread/dze4bac)\n\n - [Themis-specific advice from /u/itsnotnews92](https://www.reddit.com/r/LawSchool/comments/8l91mu/official_july_2018_bar_exam_thread/dzfgo03)\n\n - [/u/MormonGekko's method](https://www.reddit.com/r/LawSchool/comments/8l91mu/official_july_2018_bar_exam_thread/dzlhp95)\n\n - [Study schedule by /u/justanotheruser58383](https://www.reddit.com/r/LawSchool/comments/8l91mu/official_july_2018_bar_exam_thread/dzmt3fj)\n\nAlso, for those unaware, [we have a discord server](https://discord.gg/lawschool) for folks who would like to talk about the bar exam in real-time. Please join us for study tips and guidance from licensed attorneys.\n\n#[Click here to join the Discord server.](Https://www.Discord.gg/lawschool)",
        "num_comments": 8,
        "comments": [
            "I’m like 100 hours behind on the Barbri study program. How cooked am I? I’m scoring well (75%+) on the subjects I’ve covered so far, but I feel overwhelmed and like there is no possible way to get through this material.",
            "I’ve been working on a project to make it easier to study for the bar exam.  I was curious what things are the biggest pain in the @$$ when preparing for it.  Would love to chat in this thread or DM with folks.",
            "How SCOTUS decisions are handled on the bar exam: [https://www.ncbex.org/news-resources/ncbe-statement-scotus-decisions-and-bar-exam](https://www.ncbex.org/news-resources/ncbe-statement-scotus-decisions-and-bar-exam)",
            "Quality over quantity. Plus you have 5 weeks left.",
            "same here.",
            "You can come ask on [the discord server](https://www.discord.gg/lawschool) if you'd like. Real time chat may be easier than reddit.",
            "Great!  Thank you!  I’ll put a message there"
        ]
    },
    "Pre-OCI Thread": {
        "title": "Pre-OCI Thread",
        "score": 70,
        "url": "https://www.reddit.com/r/LawSchool/comments/1dd2qdj/preoci_thread/",
        "content": "Discuss pre-OCI here. If people are waiting to hear back from specific firms, please try to keep all discussion in a single thread (i.e. someone can start a Latham top comment in this thread, and people responding about movement should keep those as replies). \n\nFor anyone who doesn't know, a good chunk of firm recruiting is happening right now with pre-OCI. Send out applications or use your school's application portal to look for firms, get invited to do screeners and callbacks, and you can potentially save yourself the extreme stress of the actual OCI process.\n\nEDIT: We also do have a Discord server where you can chat about this. We'll be setting up a specific channel to talk about pre-OCI with threads for major firms\n\nhttps://discord.gg/lawschool",
        "num_comments": 957,
        "comments": [
            "Just wanna put an announcement for those of us who haven’t seen movement who go to a T-14 and don’t have high GPA’s. an overwhelming majority of movement is for people with high GPA profiles. Several career counselors have told me that firms are going to get to lower GPA’s later. People who are saying to panic by the end of the week if you don’t hear anything are not right. The only people who should be panicking by the end of the week is if you have a very high GPA and you haven’t gotten any movement. We just gotta sit tight and keep sending out apps!",
            "Any chance of this thread actually getting pinned, or is it going to fade off the front page and become useless like the other one?\n\nI know both the pinned threads rn are important but surely we can figure something out.\n\nETA: Thank you!!",
            "putting this in a separate comment because there seems to be a lot of anxiety- the norm in NY for many V30(ish) firms is now to go straight to callback, no screener. several DC offices of these firms have retained screeners, so these applicants are generally hearing/getting their interview process started before NY applicants. this is causing a lot of unnecessary panic. callback to offer will likely (but not definitely, so hang in there if you feel ghosted) be within a week for NY firms, but firms have way more pre OCI apps than last year and are taking their time to go through them, so don't write anyone off without a rejection letter just yet.",
            "Latham NY rejection wave this morning?",
            "When should we be concerned that we haven’t heard back after a callback?? I feel like the only person in my friend group without an offer…",
            "Anyone else getting no responses in NYC? I applied to ~60 firms in NYC and have gotten 5 rejections but otherwise radio silence.",
            "Is a nearly 2 week wait after a callback with no news likely a rejection?",
            "Any movement from Freshfields (NY)?",
            "Okay hi yall sorry for dooming the chat but when should I be a worried about lack of response in the pre OCI process? I know a lot of people are having screeners and CBs and stuff but I havnt gotten much traction at all and it’s worrying me a bit\n\nBelow median at a T-14, I’ve applied to over 100 firms across several markets (NY, DC, Boston)",
            "Anyone have insight on which firms have their classes full yet? And which are still planning on using Pre-OCI/OCI?"
        ]
    },
    "They did a little trolling": {
        "title": "They did a little trolling",
        "score": 679,
        "url": "https://i.redd.it/dc1ovu05rb9d1.jpeg",
        "content": "",
        "num_comments": 29,
        "comments": [
            "i could've taken a bar course but no i took admin law like a fool",
            "Me who refused to sign up for admin just because it sounded boring no matter how much the faculty says things like “it’s more important to real lawyers than anything else”: \n\n *insert big brain meme here* ",
            "To whomever relied on the past 7,000+ cases citing Chevron, I say: \n\nCya suckers and losers LMAO \n\n-signed, 6/3",
            "Presently in Admin Law this summer. 💀",
            "Someone got a TL:DR? I’m curious but too busy being locked into bar prep to go looking for myself.",
            "Honest question: should I still take admin law in the fall?",
            "I graduated 9 years ago. A good chunk of con law and pretty much all of AdLaw are just as useful as the precedent in pennoyer v. neff",
            "mount up agency lawsuits now before another clear path is defined!  yw!",
            "im literally in admin law right now and yeah. yeah this is how it feels",
            "context?"
        ]
    },
    "Where Were You When Chevron Was Kill": {
        "title": "Where Were You When Chevron Was Kill",
        "score": 517,
        "url": "https://www.reddit.com/r/LawSchool/comments/1dql7d1/where_were_you_when_chevron_was_kill/",
        "content": "Rip every admin law professor scrambling to rework their curriculum",
        "num_comments": 152,
        "comments": [
            "I was at office drafting motion when partner emailed\n\n\"Chevon is die\"\n\n\"No\"",
            "Working for the SEC… :’)",
            "I was in internship research for injunction when Twitter say  \n\n\n\"Chevron is kill\"\n\n\"No\"",
            "Could not be happier I'm not in the middle of admin law right now",
            "Super excited to be taking admin law in the fall \n\n☠️☠️☠️☠️\n\nI just tried to explain Chevron to my engineer husband and why this is so important, and I got heated, and his eyes glazed over…and it was then I realized that I’ve morphed from a Pikachu to a Raichu",
            "My admin law prof was almost as adamant that this wouldn't ever happen as my con law prof was that roe wouldn't get overturned.",
            "So weird graduating law school when Obama was president.  We were so sure that Roe and Chevron were hated by conservatives but were so safe.  Now, I feel like I need a refund from my law school.",
            "Working for a federal agency.",
            "Pouring one out for all my people doing admin over the summer.",
            "Ironically, listening to the 5-4 episode on Garland v. Cargill."
        ]
    },
    "big day for law textbook publishers everywhere": {
        "title": "big day for law textbook publishers everywhere",
        "score": 94,
        "url": "https://i.redd.it/v988zwjo4d9d1.jpeg",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}