{
    "US Department of Labor Seeks Public Comment on Removing PERM work search Requirements. ": {
        "title": "US Department of Labor Seeks Public Comment on Removing PERM work search Requirements. ",
        "score": 72,
        "url": "https://www.reddit.com/r/Layoffs/comments/1couv7z/us_department_of_labor_seeks_public_comment_on/",
        "content": "The DOL wants to add \"STEM\" occupations to Schedule A which would allow companies to completely circumvent PERM work search requirements.\n\n~~This~~ [~~article~~](https://cis.org/Jacobs/USCIS-and-DOL-Policy-Updates-May-Allow-More-Employers-Circumvent-Protections-American) ~~has a good analysis.~~ Edit: I am crossing this out because some trolls are using what is a completely objective analysis at this link to mi-characterize this post. I still think it is a good overview and I don't endorse other CIS publications that I haven't even read (and which these trolls like to invoke.)\n\nThe department of labor's [rfi](https://www.federalregister.gov/documents/2024/02/15/2024-03187/labor-certification-for-permanent-employment-of-foreign-workers-in-the-united-states-modernizing) has more details.\n\nPublic comment can be made [here](https://www.regulations.gov/document/ETA-2023-0006-0001/comment).\n\nThey specifically want comments to be relevant to [this](https://www.regulations.gov/document/ETA-2023-0006-0001) but let them know what you feel. BTW, the analysis there is nonsense. I don't have time to debunk it but anyway...\n\nRepost and share with any subreddits or worker advocacy venues that you can think of (college tech clubs, unions, congressional representatives...)",
        "num_comments": 49,
        "comments": [
            "Stickied for visibility.",
            "Please everyone leave a comment on why this would be harmful for you and future American STEM graduates.\n\n  \nThe main concern should be that: Corporations complain that they can't find any STEM workers with experience, but if they never hire new grads domestically then none of them will ever get experience and they'll always been foreign labor. It'll turn into a positive feedback loop",
            "This is absolutely ridiculous. Here is a list of companies that have preferred immigrant over local talent and have also moved/built offices offshore  \n\n\nThese kind of companies should be heavily taxed.\n\n**Microsoft**\n\n[https://timesofindia.indiatimes.com/technology/tech-news/microsoft-buys-land-worth-rs-267-crore-to-build-data-centre-in-hyderabad/articleshow/109914436.cms](https://timesofindia.indiatimes.com/technology/tech-news/microsoft-buys-land-worth-rs-267-crore-to-build-data-centre-in-hyderabad/articleshow/109914436.cms)\n\n**Google**\n\n[https://officechai.com/offices/google-hyderabad-office-campus-financial-district/](https://officechai.com/offices/google-hyderabad-office-campus-financial-district/)\n\n**Meta**\n\n[https://economictimes.indiatimes.com/tech/technology/reliances-tamil-nadu-campus-may-host-metas-first-india-data-centre/articleshow/108951164.cms?from=mdr](https://economictimes.indiatimes.com/tech/technology/reliances-tamil-nadu-campus-may-host-metas-first-india-data-centre/articleshow/108951164.cms?from=mdr)\n\n**Apple**\n\n[https://www.wsj.com/tech/apple-aims-to-make-a-quarter-of-the-worlds-iphones-in-india-ab7f6342](https://www.wsj.com/tech/apple-aims-to-make-a-quarter-of-the-worlds-iphones-in-india-ab7f6342)\n\n**Amazon**\n\n[https://www.aboutamazon.in/news/workplace/amazons-largest-office-building-is-in-hyderabad](https://www.aboutamazon.in/news/workplace/amazons-largest-office-building-is-in-hyderabad)\n\n**Tesla**\n\n[https://www.reuters.com/business/autos-transportation/tesla-ready-invest-up-2-bln-build-india-factory-with-riders-et-2023-11-24/](https://www.reuters.com/business/autos-transportation/tesla-ready-invest-up-2-bln-build-india-factory-with-riders-et-2023-11-24/)\n\nMeanwhile so many countries are working on 'de-dollarization' .   \n[https://watcher.guru/news/brics-play-key-role-in-advancing-de-dollarization-initiative](https://watcher.guru/news/brics-play-key-role-in-advancing-de-dollarization-initiative)\n\nWhy are these companies allowed to bully the country that built them? Are people so weak willed that they are forced to use their products? These companies are literally laying off americans and building offices in other countries and for what, just some short term profits? They are literally giving away IP to other countries",
            "I’m a hiring manager. Dirty secret here. \n\nThe work searches conducted for immigration legality purposes are largely a sham.\n\nThe law does not work. ",
            "So THIS is why there are so many bullshit job \"openings\".  Probably placeholders for PERM, with no intent to hire anyone from the US.\n\n\nFuck this country.  Fuck it to death.  I am so so goddamn sick of these corporations I am going to lose my shit. ",
            "[removed]",
            "Thank you for posting this as it gives the collective workforce a voice. \n\nI’m sure the analytics shared are not accurate but that’s another issue entirely. \n\nThe reality is if you do global work it’s completely impractical to not have global operations - that’s nonnegotiable. \n\nBringing everything to the US will get dismissed - there’s not the actual infrastructure to support it. We literally cant function in a global economy without global operations. More taxes are not a solution, neither are more tax cuts. \n\nEx: If you sell cars in Europe, it’s obviously makes sense to make them in Europe. Just the shipping alone and carbon tax would break businesses - and that can’t be the goal. \n\nThe tax code archaically compromised. \n\nESG scores are taxed and that’s all bullshit, supporting made up industry. It goes both ways for companies - they do get tax cuts, but also pay taxes for completely made up reasons. \n\nWhen Elon Musk is defending his own compensation agreement with the company he owns in a courtroom, we’ve lost our way. No matter the opinions on him or his compensation, taxes, etc. it’s 1984 era - when you have to go to court to get your compensation from a company you own so Wall St. isn’t impacted…  \n\nNonetheless, it’s an opportunity to be heard.",
            "[removed]",
            "\"We can't find any US citizen engineers for this senior role.\" Well, you never even tried to hire them for the junior role in the first place..",
            "Most \"immigrants\" are US educated STEM workers. If they hire them, the job stays in US, and other US citizen could take it later. If they offshore the job, the job just disappears forever."
        ]
    },
    "What a gut punch ": {
        "title": "What a gut punch ",
        "score": 131,
        "url": "https://www.reddit.com/r/Layoffs/comments/1dr1qrf/what_a_gut_punch/",
        "content": "I was just laid off for the first time ever in 20 years of my career. Over 500 of us, at a large shipping and logistics company…all carefully selected by the Boston Consulting Group. I was a hard worker and had great performance reviews so I am shocked needless to say.\n\nWhat pisses me off the most is I was supposed to have surgery for an ongoing medical issue and was coordinating with my boss (who apparently knew before hand) on taking time off.\n\n“We are here for you, take the medical time off that you need to heal.”\n\nTwo days later…\n\n“Sorry, your position has been eliminated.”\n\nFucking ruthless.",
        "num_comments": 32,
        "comments": [
            "Ironically, when I was laid off and needed surgery, Medicaid was 100% better than my employee sponsored insurance and the procedure was 100% covered vs what would have been an  $8000 out-of-pocket co-pay so hopefully this is a blessing in disguise. \nIt absolutely sucks but plan to do something for yourself during this time that you weren’t ever able to do because of work .",
            "BCG is a plague.  Sorry",
            "Vote for universal healthcare",
            "I’m sorry. I got laid off from a logistics company one Christmas after four years of twelve hour days and being on call every other week. \n\nIt doesn’t matter how hard you work, employers will still crush you.",
            "As others will tell you in the group, your employer is not your friend. They will smile and tell you everything is alright and then gut punch you a minute later. It's a lesson learned. Hope you are able to find something better soon.",
            "Consultants do not see people as people but just as numbers. Sorry to learn of your situation and hope u will come back ok after this.",
            "No matter what type of employee you are, you are a line on a PNL. The sooner people get that the better. \n\nIt sucks and I’m sorry this happened to you.",
            "I was laid off twice in the last 5 years. Second time after having just gotten 2 raises = 25% in less than a year, along with a promotion and great review.\n\nIt’s not you, it’s them. Employers are not in your corner, on your side, or even trustworthy. They are using a different calculus than their employees.\n\nYour co-workers are the best source of commiseration, support, and future jobs.  Connect over whichever Socual Mefia makes sense or just exchange email and phone numbers.",
            "Been in the same boat.  Given the number of people and your age, you should have 60-days under the WARN act, where you receive a paycheck and benefits from the company.  See if you can reschedule your surgery to take place before that time ends and go on short term disability if you need time off to heal.  You’ll probably have a better outcome taking a serious rest to recover.",
            "BCG is cancer."
        ]
    },
    "Despite tech layoffs, unemployment fell across Bay Area, California": {
        "title": "Despite tech layoffs, unemployment fell across Bay Area, California",
        "score": 33,
        "url": "https://www.msn.com/en-us/money/markets/despite-tech-layoffs-unemployment-fell-across-bay-area-california/ar-BB1oFq8K",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Tempting to say it's a \"tech only\" recession but lots of non technical people unemployed or had their jobs or careers destroyed overnight (like self employed copywriters by ChatGPT)\n\n\nIf you fall on the wrong side of job equation you lose your lifeline and have little chance to update skills or change careers. Now you're scrambling to maintain standard of living but you can't and fucked all because the economy chose the wrong time to throw you out.\n\n\nGot a job? You think nothing is wrong. Don't got a job? You think the world is fucked especially if you haven't looked for a job in a long time. If you're not in a career or job protected by statue (law) watch out. The world is your competition, and sometimes it doesn't matter how good you are. For some business models they might want you to be \"good enough\" or even bad.\n\n\nCapitalism -- fucking people in the ass since the beginning.",
            ">The leisure and hospitality sector, which includes restaurants and hotels, added 2,300 jobs  \nThe state data also does not break down whether jobs are full or part time.\n\nWho wants to bet these restaurant and hotel jobs are mostly part-time and low paying?",
            "More fudged govt agency statistics",
            "That link says the Information sector only lost 1,900 jobs.",
            "Did they add mass looters shop lifters, and fentanyl dealers  as employ statistics?",
            "####'Sorry to illetrate to understand this, who is getting the jobs in Bay Area ?",
            "I don't believe that.",
            "We are not even close to a recession.",
            "Recession?",
            "Capitalism implies no private central bank to dispense the \"money\" from thin air. Just saying."
        ]
    },
    "Just got my layoff letter on 6/26/24.": {
        "title": "Just got my layoff letter on 6/26/24.",
        "score": 59,
        "url": "https://www.reddit.com/r/Layoffs/comments/1dqpr0z/just_got_my_layoff_letter_on_62624/",
        "content": "Corporate decided to close our location in Philadelphia and move all work to the other location in Lenexa. I am being told my last working day will be 9/30/24. I will be given 18 weeks of severance pay and any unused PTO as well.\n\nI am unsure where to go after this. I am debating trying to find a job ASAP and leave before my end date but then I also forfeit the severance pay. \n\nWhat are options or recommendations on how to go about handling this.",
        "num_comments": 56,
        "comments": [
            "Start looking for jobs and set your start date  for 10/1 if possible",
            "\nTake it from someone who had gone though this.\n\n1. Take the weekend off, clear your head.\n\n2. Plan for a long term budget and see if you can start or when you can apply for unemployment.\n\n3. Plan a budget.\n\n4. Get your resume in order and start looking.\n(Even if you want a few weeks off)\n\n5. Your severance pay won't last forever.",
            "Start looking for a new job now. The second time I was laid off it took me 10 months to find another one. It could be well into September before you get another position. Than negotiate with the new company to delay on boarding until October.",
            "You are in perfect spot: get paid to look for new job.  It takes months to get a new job",
            "Start looking, the job market is shit, and its easier to find something with a job than not. If you get a new job and they ask a start date (realistically, it should take a month or two to get the job, and you can just say you have projects to finish and then leave 9/30 with severance while also starting right away",
            "Get the severance pay. Start networking",
            "Start looking now and take whatever you can get. Best of luck",
            "How about you make sure you can get that offer.",
            "> I am debating trying to find a job ASAP and leave before my end date but then I also forfeit the severance pay.\n\nDepending on the industry, the average time for most folks to get a new job is 3-6 months. Given that, I would start looking for new gigs right away as the odds of finding a new one before you would have to give up a severance payout are slim. \n\nThat said, even if you do land something within the next few weeks, you can always work with your new employer on a start date that better aligns to you getting that sweet payout. However, if they're unwilling to accommodate that, I would personally take the new job and forefit the severance. While that chunk of cash is nice, it won't do you much good as we approach the hiring slowdown period that tends to happen near Q4.",
            "Start applying brother, do not wait"
        ]
    },
    "Should I wait to hand off my work projects to my boss until I receive my severance package": {
        "title": "Should I wait to hand off my work projects to my boss until I receive my severance package",
        "score": 15,
        "url": "https://www.reddit.com/r/Layoffs/comments/1dqyeki/should_i_wait_to_hand_off_my_work_projects_to_my/",
        "content": "I am 51, a single parent with neurodivergent kids who need meds and therapies, and my child support is a whopping $49/mo and I don’t get alimony. \n\nMy position was eliminated (new VP did not like me) this week on my one year anniversary with the company. I worked at a multinational Fortune 500 company. \n\nLet go at the end of the month so bye bye healthcare. I am scrambling for my kids terrified and had two days before I was booted out. \n\nHR rep says a severance package is coming soon, but won’t give me details on #of weeks covered or anything until after my last day with the company, which was today. \n\nMy boss (not the VP) who has been negligent the entire time he’s been my boss (3 months) didn’t even attend the ambush HR meeting where I learned my fate and only checked in via text one day later.\n\n He offered to “see what he could do to help” me, which he later clarified by explaining he only wants me to hand over all of my projects. No how are you, I’m sorry this happened, I can be a reference or look over your resume, nothing. I seriously want to send him a link to a “leading with empathy” article.\n\nI want to slow walk my project handoff until I get my severance details but is that a bad move on my part? I heard I might get 12 weeks but I also heard 4 weeks. I have no idea and am twisting in the wind until the HR person gets back from vacation on July 7. Today was my last day. I am terrified and angry. \n\nHow much do I have to give him and when? I need a runway with a small emergency fund and past job searches took me 6-9 months.\n\nThis company claims they are “People First” 🙄\n",
        "num_comments": 21,
        "comments": [
            "If today is your last day, then is this the last day you have computer access? Are you now on a paid notice period?",
            "If you worked there for only a yr then usually in most cases the severance would be for 4 weeks. Just my two cents based on experience. \n\nYou should cooperate (from information perspective) because the severances usually have clauses that you would provide all the company information as required etc etc.\n\nLeave your hard feelings for that manager at that job. Don't bring over it in your personal life. You do not need that negativity and karma from someone else unnecessarily.",
            "Damn!",
            "You need to co-operate with management if you want severance. This is probably why a lot of companies no longer give severance details until a few days after layoff happens. They can pull offers for those who cause them trouble. Don't risk your severance pay. It's not worth it.",
            "I would revise the project before giving back to the boss. :)",
            "I've never burned a bridge, no matter how mad I was or how badly I felt I was treated.\n\nYou're 51, you have 15-20 more years of working and you never know if a merger or acquisition will one day have you working for this company again.",
            "Give up the animosity and hand off the work. It’s not worth your energy to try and get back at him because it won’t accomplish anything and you’ll just feel more deflated after the fact.",
            "Take FMLA and STD if available you can get paid to care for kids for a few weeks",
            "12 weeks would be a surprising severe ce for a year of severance. I doubt they will keep your access on for the entire notice period.",
            "People first 🙄.  They all say that.  Very few deliver.  I would be to concerned over the manager not being in the HR ambush meeting.  Often the manager doesn’t find out till it’s happened/happening.  And don’t count on him for anything (referencing see what I can do).  Ultimately,  at this point the severance should have already been agreed and signed off by the c-suite.  Meaning this manager you describe has zero say in the outcome.  \n\nI am a little unclear though.  Is today your last working day?  Meaning they gave you a non-work notice period?  If that’s the case you should be cut off from all network access and you don’t have any obligation to help.  \n\nUltimately, you don’t have to do anything.  The coordination of these events is so secretive and impossible to manage.  Unless you are in a widget producing role, or customer facing every employee had a series of notes, trackers, project plans that will fall to the waste side as a result of the layoff.  \n\nPersonally, when I think of the end of the year bonuses paid out to the senior executives or c-suite I would not be able to take the high rode to help transition the work unless I had an agreement that altered being laid off to a future date.  \n\nI’m genuinely sorry to hear about your situation.  \n\nSome quick pointers:\n1. Find a site that analyzes your resume based on the job description.  Your biggest hurdle will be the ATS (applicant tracking system) and their logic to auto decline candidates.  The site will provide you with two important insights.\n\nA. The hard skills phrases or words to use\nB. The soft skills they are looking for\n\n2. Used LinkedIn to find jobs.  Use your network.  Find out if your company provided any resources.  Example, at one company I worked for, they let employees use our recruiting services to help try to find roles up until we divested their company.  You never know.\n\n3. Apply to everything you can.  Don’t worry about meeting all the requirements in the posting. They use those to help manage the volumes of applicants.  \n\n4. It’s a game of numbers.  Example 40 applications might create 7 initial calls, 3 interviews , 2 second interviews and 1 offer.\n\n5.  Try to manage any guilt or shame you might feel about being laid off or the stigma surrounding it.  Most companies do not equate being laid off to equal poor performance.  \n\n6. Be unapologetic in your efforts to find a new job.  The application process is a game where the ones who can beat the screening logic win.  Not the best employee who’s applied."
        ]
    }
}