{
    "Daily Free Talk Thread": {
        "title": "Daily Free Talk Thread",
        "score": 5,
        "url": "https://www.reddit.com/r/leafs/comments/1dr8p3w/daily_free_talk_thread/",
        "content": "Please use this thread to post ANYTHING you want! Memes, photoshops,  anything that would normally be removed for breaking the low-effort content rule, is totally, 100% welcome here!\n\nThis will now also be the dedicated thread for Armchair GM posts as we noticed that those posts were bleeding into this thread regardless. Is there a free agent you want to see on this team? Is there a player that's rumoured to be on the move that you think GMBT should go after? Are there players on this team you want to trade away? Feel free to post about it here!\n\nNormal moderation will occur, such as watching for personal insults, racism, and things of that nature.\n\nOtherwise, feel free to use this thread to share things like your new jersey, a photoshop of a Habs logo on fire, or a reaction gif to something going on in Leafs Nation right now!\n\n**Downvotes are discouraged for the most part, everyone's opinion is fair game in this thread.**\n\nGet out there and have fun!\n\n&#x200B;\n\nLooking for the latest Armchair GM Thread? [Check here.](https://www.reddit.com/r/leafs/search?q=title%3Aarmchair+gm+thread&restrict_sr=on&include_over_18=on&sort=new&t=all)",
        "num_comments": 52,
        "comments": [
            "Cowan is a farm kid, Danford knows how to operate construction machinery… getting a bunch of rough ‘n tumble kinda guys these days. Calling it, next pick’s gonna have worked under his dad’s treefelling company or some shit. He’ll be a 6’3 defenseman that likes to hit, and he’ll be the most Brad pick ever. We’ll call him Treeliving.",
            "Now, given a) the wide open draft and b) Wes Clark picking lower draft position studs, this might be a moot point, but anyone in the general ballpark of our 2nd that might be of interest? Who looks good to you guys?\n\nOnly name I’m vaguely familiar with is Pridham’s kid.",
            "Day 1 of manifesting Montour and Roy in Toronto on July 1st. I would end the day with the largest smile in Toronto. Our transition defense would be exponentially improved.  \n\nWe’d need to deal with the whole filling out the rest of the line up problem, but there are lots of options.",
            "Askarov being available is interesting. I'd go after him. Maybe this could be our \"Rask for Raycroft\" moment where we get a first round goalie in a deal for someone else and that guy becomes our star for the next decade. Especially if we're running a tandem with Woll and someone else, if we have Askarov as well here and they both split time, we can see who really shines and run with them.",
            "If we don't draft Gerald \"Squancho\" Higgins from USHL Everglades, I will be fuming. Kid is elite.",
            "\"Danforth with the crisp breakout pass to Cowan. Cowan enters the zone with speed, across the slot to Minten! Off the post - but KNIES GETS THE REBOUND! LEAFS WIN! LEAFS WIN! THE DROUGHT IS OVER! THE STANLEY CUP IS COMING HOME!\"",
            "I thought the draft day would be crazy with trades and signings and nothing happened. I don't mean the leafs, but in general.",
            "How long do rounds 2-7 take?",
            "The value that Pridham's kid brings to the organization is phenomenal even if he never plays an NHL game. Make Brandon think twice about leaving when he inevitably gets an offer from another team.",
            "No chance Pridham lasts to our 4ths, but now that we have a late 2nd, we can grab him then.  \n\nFor the 4ths.  I like Romani, he can flat out score.  Would be a solid 4th.  Nathan Villeneuve also might be a good pick, dudes really good.  But maybe he slides because of his 10 game suspension.  Luke misa too is a good shout, don’t think he makes it to the 4th though."
        ]
    },
    "Since birth ☝️ Ben Danford": {
        "title": "Since birth ☝️ Ben Danford",
        "score": 55,
        "url": "https://x.com/MapleLeafs/status/1807045272419332529?t=zAE5QtKqm5q1ThC4UpSKPg&s=09",
        "content": "",
        "num_comments": 6,
        "comments": [
            "I have a feeling we're gonna like this Dan Benforth guy",
            "Pyjama boy 🤝 choochie boy",
            "Eat your heart out Tavares!",
            "Passion Pacifier lets goooooo",
            "Good ol’ Madoc boy",
            "King of the Danforth."
        ]
    },
    "[Fox] Maple Leafs first-round pick Ben Danford: “When I was younger, I was a big Phil Kessel fan.”": {
        "title": "[Fox] Maple Leafs first-round pick Ben Danford: “When I was younger, I was a big Phil Kessel fan.”",
        "score": 263,
        "url": "https://x.com/lukefoxjukebox/status/1806886321379848535",
        "content": "",
        "num_comments": 53,
        "comments": [
            "Steve Simmons about to call Danford the worst draft pick ever.",
            "I am still a big Kessel fan. Will be a sad day when he finally retires.",
            "Three-time Stanley Cup winning Phil Kessel. God damn that must feel amazing.",
            "I like hot dogs and soda too!",
            "Good one Ben, good one!",
            "Good one Randy. Good one.",
            "He looks like little Josh Baskin from “Big”",
            "That's weird, when I was younger I was a bug Ben Danford fan. Let's goooooooooooo",
            "Damn, that dimple can cut someone.",
            "Oh god I’m so olllldddd!"
        ]
    },
    "The Toronto Maple Leafs select RHD Ben Danford with the 31st overall pick in the 2024 Entry Draft": {
        "title": "The Toronto Maple Leafs select RHD Ben Danford with the 31st overall pick in the 2024 Entry Draft",
        "score": 243,
        "url": "https://www.reddit.com/r/leafs/comments/1dr14yt/the_toronto_maple_leafs_select_rhd_ben_danford/",
        "content": "",
        "num_comments": 231,
        "comments": [
            "One thing I respect is that Wes Clark has a clear type, disregards consensus, and consistently takes his guys. And it seems like there are more hits than misses. And he got another 2nd rounder, I'm happy with this",
            "life long leaf die hard, nice",
            "Wes Clark seemed locked in on that one. I trust the vision.",
            "What's that? A REAL GOOD ONTARIO BOY?!",
            "Looking forward to a taste of the Danford on this roster",
            "I’ve heard he’s called Ben ‘Bobby Orr’ Danford",
            "it’s insane no one else drafted this guy. never heard of him before but easily my favourite player in the draft",
            "He’s a leaf fan. All I need to know.",
            "Someone tell me how to feel",
            "I don’t care as much about the pick because this draft coverage is horrendous. SN has done a very poor job here. No draft board, no remaining players, no expert rankings, no team needs, no team depth charts and other prospects. I think they went for the bare minimum."
        ]
    },
    "[Trade] Toronto Maple Leafs trade the 23rd overall pick to Anaheim in exchange for the 31st overall and 58th overall picks in this draft": {
        "title": "[Trade] Toronto Maple Leafs trade the 23rd overall pick to Anaheim in exchange for the 31st overall and 58th overall picks in this draft",
        "score": 184,
        "url": "https://www.reddit.com/r/leafs/comments/1dr03ei/trade_toronto_maple_leafs_trade_the_23rd_overall/",
        "content": "Sam O'Reilly please",
        "num_comments": 136,
        "comments": [
            "Thats a smart trade if they didnt absolutely love anyone at 23. 8 spots and gain a 2nd that they didnt have.",
            "I really hope we don’t regret not drafting stian soldberg. Top on both pro agility testing in the combine, top ten in a couple other tests. Big stay at hone dman",
            "Seemed pretty likely that this would happen... may as well get a 2nd pick in the top 60",
            "Avalanche just got a good deal on a similar trade",
            "Why couldn’t we have traded with Utah instead, DAMN",
            "Utah/Sharks/Ducks gonna be looking mean in a few years",
            "Late second to move down 8 spots is pretty good business",
            "I wanted solberg or emery",
            "Sam O'Reilly and Jack Berglund are the guys I want at both picks.",
            "Reverse Tyler Biggs Trade Lmaoo"
        ]
    }
}