{
    "Tired of your content here getting removed? Use our new affiliate & sister sub r/LowEffortLeague for (almost entirely) unrestricted content": {
        "title": "Tired of your content here getting removed? Use our new affiliate & sister sub r/LowEffortLeague for (almost entirely) unrestricted content",
        "score": 595,
        "url": "https://www.reddit.com/r/LeagueOfMemes/comments/tivzor/tired_of_your_content_here_getting_removed_use/",
        "content": "The subreddit r/LeagueOfMemes has, over time, received more and more content that doesn't quite fit any other sub. Sometimes it's casual discussion, low tier gameplay, general questions, bad memes, and similar things of this nature. The main sub r/leagueoflegends has strict content regulation and r/LeagueOfMemes keeps things strictly to memes/humor content. Rather than bend the rules here, we've decided it best to create a sister sub that does not (for the most part) regulate content. \n\nSo, with that in mind, we're happy to introduce r/LowEffortLeague!  **On this sub, you're free to post your bad memes, bad takes on the game, simple questions you could answer on your own by googling it, \"comment your main and I'll tell you X\" posts, etc--whatever your heart desires!**\n\nHowever, there are a few things that won't be allowed:\n\n1. Racism, sexism, homophobia, and other forms of bigotry\n2. NSFW/NSFL content (including porn.... this is NOT a porn sub)\n3. Stolen content\n4. Giveaways, and other content that could fall into potentially scamming users\n5. Spam\n6. TOS breaking content\n\nA few more notes:\n\nYou are allowed to promote your streams and channels **if you have less than 50,000 subscribers and/or followers.** However, you are only allowed to do so by contributing something to the sub. For example, posting \"Watch me live at <this time>!\" would not be allowed. However, posting a gameplay clip and then promoting your channel in that post is fine. If you have more than 50k subscribers/followers and would like to post, simply message the mod team ahead of time to receive approval. \n\nIf you want to promote a discord server or find people to play with, in the interest of safety of the community please message the moderators first and receive prior approval before posting outbound links. Otherwise, they will be blocked by automod.\n\n---\n\nAs time goes forward we will likely have to adjust these, but hopefully this serves as a good starting point for the sub.\n\nHave fun everyone, hope to see you over at r/LowEffortLeague!",
        "num_comments": 86,
        "comments": [
            "i love reddit because you can get into a hobby and go check if theres a sub and find out the main sub is run by a control freak and so is every other sub about the hobby so you have to follow 3+ subs just to get the full experience",
            "I like this\n\nHaving a sub for basically everything League related is something i wanted for quite some time",
            "> bad takes on the game, \n\nSo same as this sub?",
            "Thanks again for this, really glad you're here! One question, you mentioned in a post that it was possible to remove some flairs. I'm really tired of seeing those draw 6 champions posts. How can I remove them?",
            "Could it be named 'Lag of Legends' in honour of our fallen comrades?",
            "Can I still post tierlist memes here?",
            "Okay, now remove the posts that aren't memes",
            "Anyone want to play the game by talking to me?  I'm a good sup gamer.  If you want to be a friend, you can add",
            "Can I put TFT stuff here?",
            "Lol the top post of this week is literally a meme with 1 line changed..."
        ]
    },
    "Welcome to r/leaguediscussion!": {
        "title": "Welcome to r/leaguediscussion!",
        "score": 37,
        "url": "/r/leaguediscussion/comments/1d5anfd/welcome_to_rleaguediscussion/",
        "content": "",
        "num_comments": 4,
        "comments": [
            "We, r/leagueofmemes mods moderate the new discussion sub. We encourage all kinds of discussion topics about league, and are not affiliated with the main sub in any way, shape or form.",
            "The mod team is the entirety of the current leagueofmemes mod team. I have been \"running\" this sub for a while now and pretty thoroughly vet new mods, I have no concerns. As the new discussion sub picks up, I'm happy to discuss any individual concerns.",
            "Question for visibility here: who is the moderation team of the new sub? Are these all established accounts with a paper trail and accountability, or sock puppets for existing mods the community acknowledges as bad actors, punitive enforcers? \n\n\n I am all for the existence of a discussion sub, particularly given how heavily moderated non-esports content is on the main subreddit, but I do not want to jump from XYZ mod who suffers no disagreement to XYZ2 mod account of the same person under a different name...",
            "forsen"
        ]
    },
    "That's why ADC sucks in low elo.": {
        "title": "That's why ADC sucks in low elo.",
        "score": 851,
        "url": "https://i.redd.it/4huovfae7g9d1.jpeg",
        "content": "",
        "num_comments": 54,
        "comments": [
            "Challenger Is low ELO now",
            "ADC's forgetting to reset on a Timer now stock under tower farming one more wave",
            "Meanwhile enemy draven leona are slow pushing to dive you",
            "That's not the reason why ADC sucks in low elo, ADC is a very skill expressive role (although as a jgl/mid player I don't like to admit it), that's why it sucks, that's why you should play Veigar/ Casio/ Brand/ Sera.",
            "i think the word „appear“ perfectly describes why the adc proceeds to die.",
            "Because they auto fill or Gosu wonna bees",
            "![gif](giphy|1ktwfTjwaQzde)\n\nThe enemy jungler noticing, when he just pathed bottom.",
            "Well, if you consider diamond low elo.\n\nBecause they suck there too.",
            "Supps can't take a good trade, they'll take plates with you, even when  a kill is free they will use all they have and take it, they don't know to aa a range minion under turret to help you last hit, they will die warding the wrong side of the map when it's important, they will roam when enemy botlaners are freezing...\nOr maybe it's not all and the meme is dumb ?\nWe can do that with all roles",
            "Damn you were so toxic your supp abandoned you?  /s"
        ]
    },
    "Big Chungus custom skin for Aurora lol": {
        "title": "Big Chungus custom skin for Aurora lol",
        "score": 250,
        "url": "https://v.redd.it/fbwb4d544i9d1",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Knew this was coming\n\nSomeone send this to Drututt xd. Also this is so funny  and well made",
            "thats it guys \n\nthis is truly our league of legends",
            "Does vanguard mess with custom skins? Is this only available on mac?",
            "As long as you download the most recent stuff it won't be a problem with vanguard, I don't know much more than that but I think the Bomba guy(forgot his name) has guide on it",
            "kappachungus deluxe",
            "still would",
            "That was fast.",
            "u/drututt",
            "litterally",
            "Sloppy Walrus (Bomba Guy) and Druttut, albeit druttut doesnt really mention how to us em. Sloppy explained it a few times and has a guide on how to on his discord I believe."
        ]
    },
    "Imagine being lost in the woods and coming across Elderwood Lissandra.": {
        "title": "Imagine being lost in the woods and coming across Elderwood Lissandra.",
        "score": 641,
        "url": "https://i.redd.it/d5jiv0n2xc5d1.png",
        "content": "",
        "num_comments": 20,
        "comments": [
            "I will be her fertilizer.",
            "They say be one with nature.\n\n_sigh_ **unzips**",
            "that is straight up a leshy",
            "This man right here officer. He stole my comment!",
            "The One from the witcher Netflix series or the One from the witcher 3?",
            "Wood.",
            "Would",
            "Would",
            "Would",
            "Will"
        ]
    }
}