{
    "Tired of your content here getting removed? Use our new affiliate & sister sub r/LowEffortLeague for (almost entirely) unrestricted content": {
        "title": "Tired of your content here getting removed? Use our new affiliate & sister sub r/LowEffortLeague for (almost entirely) unrestricted content",
        "score": 594,
        "url": "https://www.reddit.com/r/LeagueOfMemes/comments/tivzor/tired_of_your_content_here_getting_removed_use/",
        "content": "The subreddit r/LeagueOfMemes has, over time, received more and more content that doesn't quite fit any other sub. Sometimes it's casual discussion, low tier gameplay, general questions, bad memes, and similar things of this nature. The main sub r/leagueoflegends has strict content regulation and r/LeagueOfMemes keeps things strictly to memes/humor content. Rather than bend the rules here, we've decided it best to create a sister sub that does not (for the most part) regulate content. \n\nSo, with that in mind, we're happy to introduce r/LowEffortLeague!  **On this sub, you're free to post your bad memes, bad takes on the game, simple questions you could answer on your own by googling it, \"comment your main and I'll tell you X\" posts, etc--whatever your heart desires!**\n\nHowever, there are a few things that won't be allowed:\n\n1. Racism, sexism, homophobia, and other forms of bigotry\n2. NSFW/NSFL content (including porn.... this is NOT a porn sub)\n3. Stolen content\n4. Giveaways, and other content that could fall into potentially scamming users\n5. Spam\n6. TOS breaking content\n\nA few more notes:\n\nYou are allowed to promote your streams and channels **if you have less than 50,000 subscribers and/or followers.** However, you are only allowed to do so by contributing something to the sub. For example, posting \"Watch me live at <this time>!\" would not be allowed. However, posting a gameplay clip and then promoting your channel in that post is fine. If you have more than 50k subscribers/followers and would like to post, simply message the mod team ahead of time to receive approval. \n\nIf you want to promote a discord server or find people to play with, in the interest of safety of the community please message the moderators first and receive prior approval before posting outbound links. Otherwise, they will be blocked by automod.\n\n---\n\nAs time goes forward we will likely have to adjust these, but hopefully this serves as a good starting point for the sub.\n\nHave fun everyone, hope to see you over at r/LowEffortLeague!",
        "num_comments": 86,
        "comments": [
            "[deleted]",
            "i love reddit because you can get into a hobby and go check if theres a sub and find out the main sub is run by a control freak and so is every other sub about the hobby so you have to follow 3+ subs just to get the full experience",
            "Finally,\n\n# shitposting",
            "I like this\n\nHaving a sub for basically everything League related is something i wanted for quite some time",
            "> bad takes on the game, \n\nSo same as this sub?",
            "Why no nsfw",
            "Thanks again for this, really glad you're here! One question, you mentioned in a post that it was possible to remove some flairs. I'm really tired of seeing those draw 6 champions posts. How can I remove them?",
            "Hey there , my posts aren't being removed. I have an issue with just trying to post a meme. I've tried a few times tonight. You hit to create the post, it spins for a long time, then takes me back to the subreddit like I did nothing. Just wondering if that's happening to others?",
            "Could it be named 'Lag of Legends' in honour of our fallen comrades?",
            "Can I still post tierlist memes here?"
        ]
    },
    "Welcome to r/leaguediscussion!": {
        "title": "Welcome to r/leaguediscussion!",
        "score": 36,
        "url": "/r/leaguediscussion/comments/1d5anfd/welcome_to_rleaguediscussion/",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Question for visibility here: who is the moderation team of the new sub? Are these all established accounts with a paper trail and accountability, or sock puppets for existing mods the community acknowledges as bad actors, punitive enforcers? \n\n\n I am all for the existence of a discussion sub, particularly given how heavily moderated non-esports content is on the main subreddit, but I do not want to jump from XYZ mod who suffers no disagreement to XYZ2 mod account of the same person under a different name...",
            "forsen",
            "We, r/leagueofmemes mods moderate the new discussion sub. We encourage all kinds of discussion topics about league, and are not affiliated with the main sub in any way, shape or form.",
            "The mod team is the entirety of the current leagueofmemes mod team. I have been \"running\" this sub for a while now and pretty thoroughly vet new mods, I have no concerns. As the new discussion sub picks up, I'm happy to discuss any individual concerns."
        ]
    },
    "Stole the format from the TF2 sub": {
        "title": "Stole the format from the TF2 sub",
        "score": 1419,
        "url": "https://i.redd.it/l8kgnbh1x08d1.png",
        "content": "",
        "num_comments": 258,
        "comments": [
            "I love how gragas is taking up two numbers",
            "Are you telling me I get Draven commentary on Garen and Katarina joining the mile high club for no additional charge",
            "2.\nJax is cool and giving Dad-Vibes. \nPretty Chill 😎",
            "7 \n\n20 hours of Shuriman History lessons from Nasus and constant retorts and interrupts by Renekton shitting on him while he remains serious.",
            "8 vayne probably will smell the least but I’d be hesitant to ask illaoi to stand up so I can use the bathroom",
            "6 is the best spot, Gragor is probably nice to sit next too, if you aren’t offended by belching",
            "I'm sitting my ass next to rumble and waiting for the plane to go down",
            "2. It’s window seat, I like window seats. The only other window seat is 8, and I’d rather not be in a 3 man row. Super inconvenient if you need to piss.",
            "If we are taking canonical power level and not just casual plane flight, mord kills everyone and only Galio, Renekton, and Nasus have a chance of survival.\n\n\nIf we are talking just a casual plane ride without risk of a massive fight breaking out (but still having people be dangerous):\n2 is a trap, effectively the same as sitting between renekton and nasus but both are actively hating on each other rather than just one being absolutely bloodthirsty and the other trying to compromise, even if only for the flight. Even with Jax and Katarina around to keep garen and Sylas in line there is a likely chance sylas might decide to end garen and you would be caught between them.\n\n5 is my choice, Zed isn’t inherently evil just misguided, Katarina has Garen to keep company, Kassadin isn’t entirely insane, and illaoi will keep anyone in line who starts picking fights. If kayn turns to Rhaast he would atleast have the decency to wait till the flight was over before trying to slaughter everyone, and considering mord and Renekton of all champs are on the flight Rhaast is the least of my worries.\n\n4 is inadvisable. Kassadin isn’t the issue, mord is. He would likely accidentally kill you just by sheer power of his soul magic over the flight. Unless you want to be a soulless husk, do not sit with the tin can.\n\n8 is also a pretty good spot, out of reach of Renekton and Nasus isn’t gonna hurt you. You also are far enough away from any potential passive threats like mord.\nThough if Renekton chooses to beat on his brother you are likely in for a bumpy ride.",
            "1 Draven is fun"
        ]
    },
    "There's like 170 champions and this game, and we're getting a second battle bunny MF?": {
        "title": "There's like 170 champions and this game, and we're getting a second battle bunny MF?",
        "score": 2412,
        "url": "https://i.redd.it/kpwzbslsgy7d1.png",
        "content": "",
        "num_comments": 98,
        "comments": [
            "Idk wtf is happening in RIOT but for the past 6 month everything seems to be about making more money. Obv it's always the main thing a company wants to do but things are getting really absurd recently.",
            "this new 200$ skin looks exactly like the first splash but at a different angle and pose, at least the other ones changed the skin even if it was only a little",
            "RIOT only pays its bills thanks to SIMPs who play sexy champions and spend money on them. I'm sure they don't make billions of dollars, they just had to do such a dishonorable act to make ends meet.",
            "riot be like when they run out of skin ideas but in spite of this they must make the 72528th mf skin cause this is where most of their money mainly comes from lmao",
            "Isn't it the $200 mythic scam thing again?",
            "When will we ever get something as amazing as Space Groove Blitz again?",
            "The original looks so much better, I don't see the point...",
            "my boy Ryze about to hit the 1000 day club let's goooo",
            "Whales need the $200 ~~Chroma~~ Version. duh",
            "What even is the skin"
        ]
    },
    "When professor rito accidently added extra ingredients to the new champion's kit": {
        "title": "When professor rito accidently added extra ingredients to the new champion's kit",
        "score": 97,
        "url": "https://i.redd.it/rnmydm8l638d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Don't forget cooldown reset/reduction on kills !",
            "She and galio Will be very fun together",
            "Place yer bets place yer bets! Will it be absolutely broken on release and 2 months after it gets hard nerfed to be a forgotten champion or is this Riot's new favorite and be strong in the upcoming 2 years? Place your bets ladies and gentleman!",
            "When you think about it then her W is pretty much Kha'zix' R.\n\nBut with resets.",
            "a fucking stealth reset ughhhhhhh"
        ]
    }
}