{
    "Ask Anything Monday - Weekly Thread": {
        "title": "Ask Anything Monday - Weekly Thread",
        "score": 9,
        "url": "https://www.reddit.com/r/learnpython/comments/1dn005r/ask_anything_monday_weekly_thread/",
        "content": "Welcome to another /r/learnPython weekly \"Ask Anything\\* Monday\" thread\n\nHere you can ask all the questions that you wanted to ask but didn't feel like making a new thread.\n\n\\* It's primarily intended for simple questions but as long as it's about python it's allowed.\n\nIf you have any suggestions or questions about this thread use the message the moderators button in the sidebar.\n\n**Rules:**\n\n* Don't downvote stuff - instead explain what's wrong with the comment, if it's against the rules \"report\" it and it will be dealt with.\n* Don't post stuff that doesn't have absolutely anything to do with python.\n* Don't make fun of someone for not knowing something, insult anyone etc - this will result in an immediate ban.\n\nThat's it.",
        "num_comments": 49,
        "comments": [
            "how to approximate pi with a unit circle",
            "Is there a way to cycle through all objects of a particular class if the objects are not in something like a list? (I'm creating a simple game using only TKinter. I have a parent class called GameObject which has several children classes. The GameObject class has methods of GetX and GetY which retrieve the coordinates. I'd like to be able to cycle through all of the GameObject objects to detect any sort of collisions but I don't have the objects stored within anything such as a list or dictionary.)",
            "What is the best guided resource for a total beginner these days? I work in product at a telecom company, and want to get better with data. \"automate the boring stuff\" looks great for what I want to do, but I prefer on-rails learning like codeacademy. I have messed around with codeacademy in the past and may end up just starting it up again, but wanted to see if there's anything new out there since I last looked into it.",
            "I'm looking for a file format to store and quickly access georeferenced data (dataframes with lat and lon columns), so I can quickly load in memory a geographically constricted set of my data and not have to load the whole data (which I cannot do due to the sheer volume) or have to loop through every file checking boundary conditions. Is there a nice format that would let me do this?",
            "I am trying to install pillow (using pip), but I keep getting \"\\[WinError 87\\] The parameter is incorrect\". Even trying to use something like easy\\_install didn't work and gave me \"future feature annotations not defined\". Is there any way I can fix this issue, or any other way to install pillow? \n\nI used the following prompt: pip install pillow",
            "is learning Python too much for a 15 y/o ?",
            "No, either keep track manually or append to a list.",
            "Geoparquet? : edit you aren’t actually storing geojson or the like, so you can use normal parquet",
            "It would help a lot if you showed us what you typed in at the CMD prompt.",
            "It looks like you are typing the command into the python IDLE prompt (`>>>`).  You should type the command into a commandline prompt.  Either a shell prompt or CMD, depending on your operating system."
        ]
    },
    "How I remember the difference between \"=\" and \"==\"": {
        "title": "How I remember the difference between \"=\" and \"==\"",
        "score": 3,
        "url": "https://www.reddit.com/r/learnpython/comments/1dranzu/how_i_remember_the_difference_between_and/",
        "content": "This will sound silly to some people, but I have ADHD so I have to come up with odd little ways to remember things otherwise I won't retain anything.\n\nIn my first few Python lessons I kept mixing up \"=\" and \"==\". I finally figured out a way for me to remember the difference.\n\n  \n\"=\" looks like chopsticks. What do chopsticks do? They pick up food and put it somewhere else. The \"=\" is a pair of chopsticks that pick up everything after them and put it inside the variable.\n\n  \nThe \"==\" are two symbols side by side that look exactly the same, so they're equal. They check for equality.\n\n\n\nMaybe this will help someone, maybe it won't, but I thought I'd share.",
        "num_comments": 0,
        "comments": []
    },
    "Visual Studio Code or Spyder IDE?": {
        "title": "Visual Studio Code or Spyder IDE?",
        "score": 3,
        "url": "https://www.reddit.com/r/learnpython/comments/1dr8m3v/visual_studio_code_or_spyder_ide/",
        "content": "I'm a beginner learner of Python. I'm a student and I want learn it for science projects focused on geology and paleoecology.  \nCan someone please let me know if **VS Code** or **Spyder IDE** is better for my purpose?",
        "num_comments": 24,
        "comments": [
            "I suggest PyCharm Community Edition",
            "I like Spyder.  It's simple to get started, and makes sense to me.  \n\nBTW, if you're on Windows, WinPython is an easy way to start.  It includes a couple of IDE's, and some common Python packages.  But it isn't a huge download.",
            "VS Code ftw! Spyder is buggy sometimes.",
            "For science projects Jupiter lab / notebook may be a better way to go.",
            "Whichever works best with your workflow.. I use Jupyter notebooks for testing and spyder for operation for larger data pipelines. Perhaps because I am familiar with MATLAB and MINITAB.",
            "I had started out using PyCharm and switched to VSC simply because when watching YouTube videos, that was the IDE most frequently being used, and it made it easy to follow along.  I've never used anything else but I do like VSC.  It's pretty easy to use.",
            "If the goal is data science, spyder is very convenient, it has a Matlab-like interface",
            "I use vscode for larger projects like Django, but all my scripts are in Spyder. Cheers.",
            "As a begginer, I really like Thonny.",
            "Both are way behind PyCharm. VSC is worst than Spyder\n\nPython shines with good IDE. Not text editor, like VSC"
        ]
    },
    "Photoperiod clock ": {
        "title": "Photoperiod clock ",
        "score": 3,
        "url": "https://www.reddit.com/r/learnpython/comments/1dr8u5f/photoperiod_clock/",
        "content": "Hi all - would like some direction or hints on how to approach building the following in Python:\n\nI want to have a widget  \nthat indicates where a controlled greenhouse unit is in it's day/night cycle,  \nusing the current time (see image) I have been searching for a method to do  \nthis, but I haven't found anything similar. \n\n  \n[Concept](https://ibb.co/0MntgNY)\n\nI want to be able to  \nchange the times for the \"night period\" to be displayed as I like. \n\nAny guidance, pointers or  \ntutorials appreciated. I have looked down a route like analogue clocks but it  \ndoesn't fulfill 24 hours or the ability to indicate day/night as set over 24  \nhours in this way. \n\n \n\nMany thanks! \n\n \n\n\n\n",
        "num_comments": 4,
        "comments": [
            "Matplotlib? Your question is super ambiguous.",
            "So if I'm thinking right, could I set the x axis to 24 hr time, then update the x value every second based on the current time as the basic setup? Then format to hide y axis and shade portions of the background colour according to time periods I set - would that be the optimal solution? \n\n Apologies it's vague, but I am here trying to learn something coming from tutorials which are not based in Matplotlib so it wasn't apparent.",
            "Sounds like maybe you could do something like that. You should learn how to manipulate basic graphs first though and move up from there.",
            "Your [submission](https://www.reddit.com/r/learnpython/comments/1dr8u5f/photoperiod_clock/) in /r/learnpython may be automatically removed because you used imgbb.com. The reddit spam filter is very aggressive to this site. Please use a different image host. \n\nPlease remember to post code as text, not as an image.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/learnpython) if you have any questions or concerns.*"
        ]
    },
    "Should you always use Asyncio instead of Multithreaded in python??": {
        "title": "Should you always use Asyncio instead of Multithreaded in python??",
        "score": 2,
        "url": "https://www.reddit.com/r/learnpython/comments/1draie1/should_you_always_use_asyncio_instead_of/",
        "content": "Is there anyone with experience to help me answer my questions",
        "num_comments": 0,
        "comments": []
    }
}