{
    "Machine-Learning-Related Resume Review Post": {
        "title": "Machine-Learning-Related Resume Review Post",
        "score": 6,
        "url": "https://www.reddit.com/r/learnmachinelearning/comments/1d8odje/machinelearningrelated_resume_review_post/",
        "content": "Please politely redirect any post that is about resume review to here\n\n  \nFor those who are looking for resume reviews, please post them in [imgur.com](http://imgur.com) first and then post the link as a comment, or even post on /r/resumes or r/EngineeringResumes first and then crosspost it here. ",
        "num_comments": 5,
        "comments": [
            "Hey everyone! I'm looking for a resume review. I have been applying to a lot of ML-based internships and have had no luck so far. I have a feeling that my resume is lacking something but I can't really determine what it is. I would appreciate any help that I can get! Thank You!\n\nResume link:  \n[QmMDBea.jpeg (791×1024) (imgur.com)](https://i.imgur.com/QmMDBea.jpeg)",
            "Hi everyone ! I'm applying for MLE/RE roles (whatever are available at the current moment), and want some resume review. I feel I can do better, so any pointers would be appreciated. Here's the resume : [https://imgur.com/a/FF1zH07](https://imgur.com/a/FF1zH07)",
            "There's really nothing wrong with your resume, it looks good. You could replace \"Undergraduate teaching assistant\" with \"Course name teaching assistant\", but it probably doesn't matter much.\n\nInternships are sort of a crapshoot, ML/AI ones especially, and it's pretty late in the year to be looking for them. The \"best\" (i.e. most prestigious) ones usually start soliciting candidates in the fall of the year before the summer in which the internship would occur. I think some companies have cut back on internships this year too, as part of a broader trend of cost cutting and layoffs.",
            "I would say move the Positions of Responsibilty section to the last and keep Projects & Tech Skills above it. Your project section is more impressive compared to other section and should be able to grab the recruiter's attention first. It demonstrates your abilities well. Either move it to the bottom or merge it with the Experience section.  \nAreas of Interest section is a bit incoherent.  \nI would drop C Language. Its a thing everyone does in their bachelors and doesnt work as a differentiator.  \nIf you know any proprietary tool or are learning right now, add them too. Industry uses a lot of proprietary tools and expects new hires to at least be familiar with those when they bring you on board (even if they are going to teach you that anyway). I have seen candidates getting rejected purely based on this in my company. Just the fact that you are already exposed to xyz tool or not.",
            "1. I have different versions of structuring resume, so it makes sense to have the project section above POR\n\n\n2. I'll drop the C language. Makes sense, not a differentiator.\n\n\n3. I'll include the proprietary tools I am familiar with. Totally makes sense.\n\n\nThanks !"
        ]
    },
    "Does Andrej Karpathy's \"Neural Networks: Zero to Hero\" course have math requirements or he explains necessary math in his videos?": {
        "title": "Does Andrej Karpathy's \"Neural Networks: Zero to Hero\" course have math requirements or he explains necessary math in his videos?",
        "score": 121,
        "url": "https://www.reddit.com/r/learnmachinelearning/comments/1dqkj1j/does_andrej_karpathys_neural_networks_zero_to/",
        "content": "Do I need to be good in math in order to understand Andrej Karpathy's \"Neural Networks: Zero to Hero\" course? Or maybe all necessary math is explained in his course? I just know basic Algebra and was interesting if it is enough to start his course.",
        "num_comments": 28,
        "comments": [
            "Yes, basic algebra is not enough. Learn linear algebra and statistics",
            "I would say learn things as you go. If you start with the mathematics, you're never going to get into the actual ML. Just do ML, and keep an open mind to the fact that you need to go back and study some mathematics every once in a while.",
            "If you are intimidated by math ML is not for you",
            "Just try it. Watch the first video, you only need basic calculus for it which he explains",
            "You need basic statistics, calculus, probability distribution for foundation.you can check out khan academy for that.It will be dn in 2 days.Anythinh other than that you can learn on fly.",
            "Without knowledge of linear algebra, vectors, vector spaces, matrices and what operations like multiplication with these structures does, it's quite difficult to grasp what's actually going underneath. Of course having some understanding on how neural networks work mathematically is also recommended, since then you are not looking at implementations as if they're black box.",
            "I hadn't passed a college Algebra class when I watched the first two videos and I definitely learned stuff, but having never taken any calculus before I had to pause and go learn some stuff and even then I definitely didn't have a thorough understanding. This stuff is essentially just math, so yeah you have to understand the math it uses to understand how it works and it's mostly math above Algebra. I THINK I understood what he was talking about for the most part and backpropagation kind of blew my mind, but I stopped the videos there because I knew I would soon be very lost. Can't wait to pick them up again after I get through some more calculus stuff. It's all just so fascinating and what I watched just seems like the beginning of the beginning of the beginning.",
            "Code everything along with him if you want to understand this. Andrej says that for every one hour of content he made, he spent 10 hours preparing. So I'd say that you need to put a similar effort in for unpacking this material. \n\nThe calculus requirements are not so tough. A derivative is very simple to understand. Chain rule is simple to understand. The only difficult thing here is wrapping your head around a multivariable function and it's derivative.\n\nYou need to know math at a level where you can understand simple functions. \n\nProbability is also simple. It's just percentage.\n\nDon't go studying linear algebra full fledged. You probably know matrix multiplications from high school. That's all you need.",
            "In his first video he did leave suggestions and did little bit of explaining too. But some understanding of calculus will definitely help.",
            "I'd learn a bit of calculus as well. Try to understand how the chain rule works so you can understand backpropagation intuitively. \n\nI'd start by watching 3Blue1Brown's series on calculus and then use whatever resources necesssary to fulfill your knowledge."
        ]
    },
    "Is there a good deep learning course without math prerequisite that teaches necessary math along the course ?": {
        "title": "Is there a good deep learning course without math prerequisite that teaches necessary math along the course ?",
        "score": 20,
        "url": "https://www.reddit.com/r/learnmachinelearning/comments/1dqx4mr/is_there_a_good_deep_learning_course_without_math/",
        "content": "I think learning math in parallel with deep learning maybe more interesting than learning math first and after deep learning. Is there a good deep learning course without math prerequisite that teaches necessary math along the course ?",
        "num_comments": 14,
        "comments": [
            "I don't think so, just because the math prerequisites are quite large. If you already have a stats and calculus foundation though you might be able to find this. But if you are starting from 0 it is going to just be a math course",
            "That would be like trying to pick up algebra inside the diff eq course. Grab some books with titles like “calculus for machine learning” and, more importantly, “linear algebra for machine learning”. If you want to learn to do it correctly though then also grab a book on probability theory. After that you’ll be set to dip your toe in. Without a deep background in stat though, your experience in machine learning will always be somewhat limited",
            "Having the math background really helps to make it all come together to make sense, for me. With that being said, the courses on Udemy don't use any extensive math but cover the intuition and coding side of developing ML/DL apps. \n\n  \n[https://www.udemy.com/course/deeplearning](https://www.udemy.com/course/deeplearning)\n\n[https://www.udemy.com/course/machinelearning/](https://www.udemy.com/course/machinelearning/)",
            "If you were to start along the typical undergrad math track, you wouldn't have the prerequisites completed until sometime in year 2 or 3.",
            "Check out the fast.ai course, it's known for being beginner-friendly and teaching the math as you go.",
            "Unlike all these gatekeepers, I don’t have a strong math background during high school. I took Machine Learning course on Coursera and later on it become a deepleaening.ai course by Andrew Ng.\n\nThe man is inspiring and doesn’t discourage learner from “oh you need to know stats to study my course” kind of Bull sht . His course alone inspire me to study linear algebra and calculus alongside machine learning.\n\nTry deeplearning.ai by Coursera. Should encourage you enough to side study math and machine learning.",
            "https://d2l.ai/\nThis deep learning course (not exactly a course and rather a book) might be what you are looking for.",
            "One of the wonderful parts of modern deep learning is the fact that **much of it can be understood and used without a full understanding of the mathematics** . here are some of the [**best deep learning courses**](https://codingvidya.com/best-deep-learning-courses-on-coursera/) that you can look to start for",
            "Yes, it is called a CS degree.",
            "Not really. Courses either assume a reasonable knowledge of math, and cover deep learning using math. Or they just skip the math and explain it mostly using diagrams and other tools."
        ]
    },
    "What kind of Machine Learning project that can makes me stand out?": {
        "title": "What kind of Machine Learning project that can makes me stand out?",
        "score": 4,
        "url": "https://www.reddit.com/r/learnmachinelearning/comments/1dr59k1/what_kind_of_machine_learning_project_that_can/",
        "content": "I want to make a machine learning projects to fill up my CV. What kind of project should I make to stand out and be a strong candidate for a company?",
        "num_comments": 2,
        "comments": [
            "For brainstorming, how about gathering trivial ML projects (you knew or heard), then ask ChatGPT for recommending a better one?",
            "The one that works 👀"
        ]
    },
    "Guide to NLP?": {
        "title": "Guide to NLP?",
        "score": 3,
        "url": "https://www.reddit.com/r/learnmachinelearning/comments/1dr4i9c/guide_to_nlp/",
        "content": "I took part in a summer bootcamp for AI/ML and this week they introduced NLP: Pre processing data, RNN, LSTM, Attention, Transformers etc. But the thing is most of it was theoretical and dealt with the maths of it. So, I want to learn how to use these architectures for creating projects like Semantic Analysis, Image Captioning, Generating text etc. Is there a YouTube Playlist or Course for this?   \nCoursera- [https://www.coursera.org/specializations/natural-language-processing#courses ](https://www.coursera.org/specializations/natural-language-processing#courses)\n\nI'm thinking of auditing this course. All I know is PyTorch and other architectures like ANN, CNN etc[](https://www.coursera.org/specializations/natural-language-processing#courses)",
        "num_comments": 0,
        "comments": []
    }
}