{
    "New Mod in town": {
        "title": "New Mod in town",
        "score": 30,
        "url": "https://www.reddit.com/r/legal/comments/1c66wwh/new_mod_in_town/",
        "content": "Hey all! \n\nNice to meet you guys! My \"name\" is Swim and I've been a criminal\nAnd civil rights attorney in NY for over a decade! \n\nI've been asked to help moderate the sub and hopefully restore a little bit of the reliability and professionalism of this sub! In that spirit, I'm going to be adding and changing some rules (especially in regards to kindness and mutual respect which has been lacking and the absence of which will no longer be tolerated at all) in the sub, as well as adding a flair system for verification of actual attorneys who want to participate and/or answer questions.  I only ask for your patience as I get up to speed. \n\nPlease feel free to drop any questions/problems/concerns in this thread and provided they are asked in a civil and polite manner, I'll get back to you ASAP! \n\nPlease note that as ever, but especially in this context: I am a lawyer but I'm not YOUR lawyer.  Any opinions I express are my own personal opinions and not legal advice/opinions. Nothing I say or that is posted in this sub is legal advice and each and every topic discussed should be discussed with a professional attorney licensed in your jurisdiction. ",
        "num_comments": 17,
        "comments": [
            "I enjoy responding to posts on this Subreddit.  Welcome!  I'm sure you will see me around.  I'm not a lawyer but I like to look up laws and research the situations before I comment.  Sometimes I say the NAL thing, othertimes I don't bother.  I would be perfectly happy with a \"NAL\" tag!  That would help.  (And I hope I'm still welcome here.)\n\nModerating is a bit of a thankless job so let me just say, Thank you! \n\nI've always felt welcome here, hopefully that continues into the future.",
            "Welcome! Thanks for your volunteer efforts in stewarding the r/legal and larger reddit community! \n\nA suggestion: when people want to suggest \"find/hire an attorney\" can they also strive to give guidance on what kind of lawyer, practicing what kind of law? And perhaps what search terms or certifications to look for? Or maybe there can be a pinned post for that?\n\nIANAL, but I've heard from lawyers that they're like doctors - you don't go to a cardiologist for a podiatrist issue. And maybe visiting a Nurse or Physician Assistant is enough for certain situations, versus a board certified surgeon that takes forever to book an appointment with. Perhaps there are equivalent levels of certification that can be explained to help folks understand their options, while in most cases a barred JD is required. \n\ntl;dr help people take the next step and get the right advice for their situation, after \"hire a lawyer\" is the recommendation.\n\nEdit: for typos",
            "Goofball",
            "Wow. Professionalism. Very nice!",
            "Hello and good luck to you! I'm sure being a mod is time-consuming, but you sound ready for it! Best of luck!",
            "What was life as a criminal in NY like? How did you transition from one side of the law to the other?",
            "Welcome!",
            "Going to DM you my question",
            "Dope, welcome.\n\nWill there be any rules and enforcement of them to require folks post their standing, country, state/province similar to r/Landlord where you must post like this:\n\n\\[Landlord - USA - FL\\] Question in title of post\n\nThanks!",
            "You are absolutely welcome. In the future we're going to make sure that people who are not attorneys are not answering legal questions, especially without identifying themselves as non-lawyers, so you might see some changes in the approval of some comments, but I'm sure if you keep that in mind, you'll be fine!"
        ]
    },
    "My dad filed me as an independent without my knowledge and took my refunds...But he doesn't know I know": {
        "title": "My dad filed me as an independent without my knowledge and took my refunds...But he doesn't know I know",
        "score": 78,
        "url": "https://www.reddit.com/r/legal/comments/1dqy2za/my_dad_filed_me_as_an_independent_without_my/",
        "content": "My first real reddit post I guess.\n\nSome context: My (23F) dad is historically known to transfer money from my account to his. I finally got a bank account around the time I turned 18 in 2019 and it was under his account, so he could easily do this. I didn't know anything about filing taxes at 18 either. I got my first job at a Wendy's and finally started making...and losing money.\n\nFast forward to tax time, 2020, my dad asks for my W-2s and for my ID to file me as a dependent with a tax preparer. I trusted him and handed over the documents. In hindsight, I didn't know this wasn't required for me to be filed as a dependent...\n\nFast forward to now, I'm finally filing taxes on my own and asked about my AGI for 2022. Knowing I personally didn't file, I selected the corresponding answer. I got an error telling me I DID file for 2022. I had to do a lot of digging and found I could get transcripts on the IRS site from 2020 up to 2022...This set off alarms in my head. All transcripts showed I received some form of refund each year. I didn't see any of this money in my checking account. I immediately suspected my dad.\n\nI got copies of those filed 1040 forms from 2019, 2020, and 2022. For some reason I forgot to ask for 2021 (oops). All of them did not have my checking account number listed. I emailed the tax preparation company and asked if they had written permission to file on my behalf. They told me permission was granted by me giving my W-2s, ID, and giving verbal confirmation (my dad would call me in the middle of my school day to ask permission for filing me as a dependent?).They also cited Publication 929, stating I could be filed by a parent.\n\nMy issue here though is:\n\na) I was under the impression I was being filed as a dependent, not independent by my dad. He constantly told me I was a dependent and guilted me when I tried to express independence at home\n\nb) I made more than $15k in 2019 (2020 1040), so to my understanding, I was NOT a dependent so Publication 929 does not apply?\n\nc) The money never touched my account...ever. Uhm tax fraud?!?\n\nd) Does me giving my dad the forms and my ID and the verbal approval count as \"permission\"? Even if I was under the impression it was for him to file me under his taxes? Or is this total BS?\n\nWanted to especially verify point b. Does it apply at all here in my situation? I continued to make more money in 2020 through now.\n\nIm not sure I want to take legal action...any advice here is appreciated. My relationship with my parents is strained because of this abuse and codependency I grew up with.\n\nTo ease minds:\n\nI did move out in January and created my own checking account late 2022 after a loan refund was taken from my account (the last straw). I see now what I grew up in wasn't normal or healthy at all. I'm very upset at my dad and haven't talked to him about it. I haven't responded to the tax preparer's email about them referencing Preparation 929 or pointed out to them that the checking account on the documents is not mine. Didn't want to show all my cards yet.\n\n**EDIT:** Thx for all the advice here! I have a LOT to think about concerning my next steps with my dad. Will give updates where I can, but ofc, I don't to monitor this thread too closely either and get stuck in here. My credit freeze warriors: I 100% hear you and will ice-it-up!",
        "num_comments": 61,
        "comments": [
            "Check your credit report. If he did stuff like that, he may have credit cards in your name as well.",
            "My mother tried something similar after I moved out and was declared emancipated for Fafsa purposes. Her accountant called me angry because when I filed my tax return stating that I had lived independently for the entire year, it triggered an investigation, and she had to pay it back. The accountant knew better and was being looked at for falsifying records. I still remember her saying, \"This is a real shitty thing you're doing to your mom.\"\n\nMe:  \"Do you mean me accurately filing my taxes? Is that the shitty that I'm doing? Or is it denying her the chance to commit fraud and to steal from me? Is that the shitty thing???\"",
            "Ask the folks over at r/tax.\n\nIt sounds like he stole your tax refund money.\n\nWhat you do about it could have major repercussions, if you care. You are unlikely to get your money back from him, ever.\n\nMoving forward, file your own taxes, and make sure you have no financial entanglement with your dad.",
            "Filing as a dependent is on your Fathers Tax Return! You still have to file your own tax return separately you just state on your return that someone claimed you as a dependent. It makes a difference on how much you get back but is still a separate filing. We do this every year for my sons but they get the money. Because we pay most of their expenses and for college we claim them as dependents. Again the dependent filing is on your father return only and is only legal if he covered the majority of your expenses. He can file for you, we have our tax preparer file for our son’s but is with their permission but their refunds go to them. It is stealing on your father’s part if he took your return without permission. Not sure it’s fraud since you gave him permission to file for you, although you really didn’t understand what he was doing.\n\nI would suggest you find a tax preparer in your area and have them walk you through everything. Not H&R Block or one of the quickie places. Someone local and experienced. They can walk you through what your options are with the past filings and explain it all. Making 15K it’s probably not worth having them file for you long term. You can use turbo tax for free if you don’t own a home or have lots of itemized deductions. The tax preparer if they are honest will explain deductions and all of the other issues and suggest the same. \n\nTo me it’s sounds like your dad definitely stole from you and maybe committed fraud.  Good luck!",
            "My understanding from a quick Google is they could have the tax prep company file your taxes on your behalf since it looks like you gave permission. BUT they can not take your refund without your permission, that is tax fraud. \n\nI would start with talking to my parents and asking about the refunds. Have the transcripts with you as proof as they may try to gaslight you. Kindly ask for the money to be paid back. If they give you grief, the usual we let you live here, we provided you with food, clothing, or whatever then it will be up to you to decide how hard you want to push the issue.",
            "Our CPA requires each person’s signature to file every year. You can call the IRS to confirm.",
            "The money in the joint account probably can't be recovered because money in a joint account is considered the property of both people on the account. You may be able to do something about the tax returns, but you need to think about what outcome you want here. What is the total dollar amount of the returns that were deposited into his account? Do you want to pursue criminal charges? If it's within small claims limit you could bring a small claims suit, but even if you win in small claims most states small claims court don't have a mechanism to enforce judgements, so you would have to figure out how to get the money from him if he doesn't pay. This process varies by state, but you will probably end up paying more money to put a lien on property or if your state allows it have the sheriff confiscate property in the value of the debt. A civil suit in regular court would be easier to enforce judgement but hiring a lawyer will probably cost a substantial portion of the money he took, leaving you with some satisfaction but probably not any money.",
            "Once you turned 18 you had to sign off on your tax return. Your dad has been fraudulently signing off on your returns and having the refund deposited in your account.",
            "Contact irs- file amended returns and have proof that you were indeed independent. They will do what they do and go after him for the fraud and the money owed to you. Also request a pin from them so that your taxes cannot be filed without that number. He didn’t to it accidentally, it was intentional and on several occasions. Get what you are owed.",
            "You may be able to adjust your withholding so that there is no refund at the end of the year. The refund your dad is getting is tax you have overpaid to the government over the course of the year, plus the deduction he's getting by claiming you as a dependent. I'm not a tax attorney or a lawyer, but in your shoes I'd decrease my withholding by whatever legal amount I could. But you probably already moved out, and that's oddly easier than computing taxes in the US."
        ]
    },
    "Someone posted a picture of my son and his father and called him a child predator? Offered 1k to come to our house and beat him up. ": {
        "title": "Someone posted a picture of my son and his father and called him a child predator? Offered 1k to come to our house and beat him up. ",
        "score": 621,
        "url": "https://www.reddit.com/r/legal/comments/1dqcain/someone_posted_a_picture_of_my_son_and_his_father/",
        "content": "I am in desperate need of advice. \n\nMe and my bf have three kids together (all under the age of 5)\n\nMy bf (30) does Ubereats/doordash for a living. He had a customer who would tip him well that he often did orders for. He then started to do orders off of the app and she would send him an x amount of money to go run errands for her, basically. (She’s an older wealthy woman in her 50s) \n\nShe began to get obsessed with him over the past few weeks. Would randomly call him during the night and the evenings they talk for hours on the phone. She appears to have mental health issues and is an alcoholic. I told my bf the relationship was inappropriate and he should limit his contact with her. He got defensive and said that she tips him well and answers all of her calls and is making a lot of money working with her. \n\nThere was an incident a few days ago where she wanted him to transport her to another city via car. I told my bf that he cannot do that and it’s again, inappropriate. She went ahead and sent him a grand and told him that would get some money now and the rest after he takes her to where she wanted to go. He said no and she eventually stopped and told him to keep the money. \n\nToday, he didn’t answer any of her calls until\nMidday. She called called him angry and asked why he blocked her. He said it was the last straw and blocked her. (The previous nights she would call him drunk and talk about her trauma with him) \n\nFast forward to a few hours ago someone sent us a screen grab of an instagram story with a picture of my bf and my son. They called him a child molester and offered 1k for someone in our area to come beat him up. It looked like it was a repost so idk who posted it first. They also posted our address which scared me to oblivion. \n\nWe know for a fact that it’s this woman because that picture he sent her on Monday. Why did he send her a picture of our son? Because he’s an idiot and wanted sympathy I guess. \n\nWe have made a police report and tomorrow will file a no contact order. I am so scared that someone will try to come to our home to do us harm. Me and my kids have nothing to do with this and I have no idea what to do to protect my family. My bf won’t return the money because he says he doesn’t want any contact with her and sending it would “breach that”. Anything else I can do? \n\nWe are in WA. ",
        "num_comments": 105,
        "comments": [
            "File a police report. Let them know it was from Facebook. They take that shit seriously.my ex posted about having am intention to harm me and I got a screen grab of it and reported it. Even though he'd deleted the post the police were able to subpoena Facebook and get the original post (cause Facebook saves everything) and he went to prison for almost 2 years for terrorism.",
            "1.Beat up your bf and get the 1k\n\n2. Get a picture of the old lady and put out a hit to beat her up. Offer 1k\n\n3. ?\n\n4. Profit",
            "Keep the money, he shouldn’t return it. \n\nI just read another of your posts, you need to look at his phone and conversations. Make sure he wasn’t cheating. Due to the lack of intimacy. \n\nIf he in fact was not cheating and just doing errands for her he needs to file a defamation lawsuit. Take more money from her, why because that lady is putting your whole household in danger. Especially your children. \n\nYour husband is an absolute peanut brain but most are in some situations. He was a complete idiot to send that picture knowing her behavior was escalating. \n\nPut cameras outside and inside your house, some are cheap and effective.\n\nHow did she get your address…? \n\nThat lady is bat sh*t crazy. \n\nAfter speaking to my husband, getting the truth all of it & if he’s not cheating I would take her number from his phone, look her up, get to know her circle from a distant if she has one, blow her life up. She can’t sue you for defamation if what you’re saying is true. \n\nAlso possibly catch a charge and smile in my mugshot but that’s me don’t do that until your defamation suit is over if it gets to it.",
            "Sorry to hear he's been having an affair with this woman.",
            "Fellow WA-tonian here, i definitely think there is a reason she feels so connected to him. Maybe he didnt have a physical affair but maybe they could have been on the emotional affair side of things, but i dont know. This dynamic between your bf and this lady is so odd. I understand she was paying him well but it almost looks as though she was being maybe his sugar mama?? I definitely would maybe stay with family or a hotel for a little while till she cools off, definitely make sure shes blocked on yours and his things. And definitely get to the bottom of why he thought it was okay to entertain this lady as long as he did because now you are all in a really sticky situation",
            "She's wealthy, sue her for defamation for posting about child predator.\n\nNot sure about hiring to beat up. Not really a hitman but similar. Should be illegal. Like conspiracy to commit assault or something",
            "Super sus that she told him to just keep the 1k for no reason. Super sus sis!!!",
            "Police report and purchase a firearm.",
            "Buy a gun",
            "Sue for defamation"
        ]
    },
    "How is this legal? Cookies as a Service": {
        "title": "How is this legal? Cookies as a Service",
        "score": 29,
        "url": "https://i.redd.it/2hc4pszoud9d1.png",
        "content": "",
        "num_comments": 14,
        "comments": [
            "What happens if you click accept to pay. I bet its just to scare people. The websites are unable to charge u unless you provide your CC info. \n\nAnd if I can't get past the cookies message, then I close it down and move on to another site.\n\nI don't need another fee in my life. Hotels and airlines have me done with that nickle and dime you bullshit.\n\nTechnology made it cheaper for corporations to do business with fewer employees. Selling ads on their sites gave them more profits. Now they have to continue to make record breaking profits and charge fees.\nI think I'll slow down on my technology use and enjoy whats free in life.",
            "NAL but someone studying Information systems, the reason why this is legal is because you don't have to use the websites services, keep in mind an average request to CDNs, DNS, and IaaS/PaaS/SaaS servers costs an average of 1 cent per request or so, a request can be a clicking on a button or logging in or going to another page of the website. They need money, too, so either you pay them to not collect tailored advertisements and not gather data or you allow it or you don't use the service at all. In the EU you need to consent to data collection before they collect data on their consumers, so they are asking for data collection consent or you pay them to not do so, perfectly compliant with GDPR as you have the option to not use the service at all. You could also just use Ublock Origin and malwarebytes free extension to prevent cookie tracking, which is also a legal prevention of data collection from websites and services but if they detect that software they can straight up tell you to turn it off before you can keep scrolling.",
            "It’s just a bass-ackwards way of saying what we’ve all seen 1,000 times. “Come use our service for free, but you’re going to see ads. You want ad-free? Pay.” Pandora has been like this since day 1.",
            "Why would it be illegal?",
            "One cent per request seems batshit high. It’s highly variably depending on the infrastructure, so an average isn’t even all that useful.\n\nYou’re saying for $300/month I could only handle 30k requests? \n\nThats dipshit levels low by several orders of magnitude.\n\nI just looked and some stupid underutilized project I worked on did 120K+ requests on costs of $278 in May. It only costs that much because it’s paying for redundancy.\n\nOne request per second for 30 days is ~2.6M requests. At that same cost (because it would be given the configuration and capacity) the cost per request is $0.0001, not $0.01. That’s not even the upper bound for what that sort of infrastructure should be able to handle, either.\n\nDNS doesn’t cost jack shit unless you’re doing something phenomenally stupid.\n\nCDNs should reduce the cost or you’re doing it wrong.",
            "In the EU almost certainly.",
            "if cookies aren't optional, what is the purpose of asking for it? What's stopping people to implement all the monitoring possible and asking money to stop it? Seemed off to me.",
            "I said average, so that includes the lowest end servers you can rent to the highest end for stupidly high prices. Point still is that popular website pay alot for their servers and they often require elasticity that goes beyond the base resources no matter whether you rent from oracle or AWS lightsail, and OP doesn't have to use their website. I'm not disagreeing with you at all. But I'm saying that OP needs to understand that it's completely legal unless they collected data without consent",
            "They are optional. You can choose not to have them but you just don’t get to use the service.",
            "Because you have to consent. That’s part of the EU digital privacy act. You have freely choose to not have the cookies and therefore not be allowed to view the webpage."
        ]
    },
    "Help, I need answers if my ex can get full custody of my child ": {
        "title": "Help, I need answers if my ex can get full custody of my child ",
        "score": 4,
        "url": "https://www.reddit.com/r/legal/comments/1dr097d/help_i_need_answers_if_my_ex_can_get_full_custody/",
        "content": "Hi, I am worried my ex will get full custody of my kid. I am currently fifteen weeks pregnant. He has multiple texts from me saying I did mushrooms while pregnant, he also has that on voice calls. I thought I was going to abort my child and now I decided I am not. I did mushrooms once.\n\n He has said to me through text multiple times that he wants me to do the abortion, that he will give me another chance in the relationship if I do the abortion.\n\n But now he’s saying he will sue me for full custody because he can prove he is more suitable of taking care of the child than me, and prove I don’t deserve custody because I did mushrooms once. \n\nBefore he said this, he made an attempt saying he will say I raped him to get out of child support. I’m extremely worried to lose custody of my own kid I am carrying. I don’t know what to do, I want to keep custody of my kid and sue him for child support. He lives in Rancho California and I live in Colorado. Can he get full custody from the text proof I did mushrooms once? Can he sue me for child support? Do I lose full custody now? \n\nCan he really get full custody after one use? \n\nShould I just deny all his claims? ",
        "num_comments": 36,
        "comments": [
            "It was one instance. \n\nThere is evidence that shrooms pass the placental barrier, but it will be long gone by the time your baby arrives. \nThere's no definitive evidence that shrooms cause birth defects (though obviously they shouldn't be used during pregnancy). As long as you are not doing drugs now and pass a test after birth (they test you in the hospital), I doubt it can have much of a bearing on custody.\n\nConsidering he's saying (hopefully in text) that he wants you to abort and he only wants you file for child support, he's not looking like a more viable candidate for custody. \n\nSince you're not married and you are in Colorado, YOU have full custody unless a court says otherwise. He would have to get a lawyer in Colorado, prove you unfit in court (a single instance of shrooms during pregnancy is NOT proof you're unfit), and fight an uphill battle to prove he's a better parent. \n\nBro would be lucky to get supervised visitation before the kid is a toddler, considering he lives out of state. This man is just trying to bully you. Call his bluff. Tell him that you've retained a lawyer who's said that he's full of shit. Ask him for his lawyer's information so that custody, visitation, and child support can be worked out as soon as the baby is born since he wants to rush into court. See how fast he back tracks.",
            "If he's going to accuse you of rape it would be criminal, not civil.\nHim accusing you of mushrooms may open a CPs Case when the child is born. Make sure you stop all the illegal substances now because positive tests are going to hurt your custody. \nBringing up abortion hurts neither of you. \n\nYou are the only parent until paternity has been established. He may be causing all the conflict now so you do not petition for paternity which would start a child support case",
            "NAL\n\nSTOP TALKING TO HIM.\n\nHe's trying to manipulate you into the abortion that you do not want at this point.\n\nStop responding, contact a family law attorney.",
            "full custody? unlikely. but you will certainly be tied to him for *at least* the next 18 years, if not the rest of your life. is that what you want?",
            "Do not deny his claims. IF (and it’s a big if) he actually goes through with it you calmly explain to the judge that your relationship was toxic and you had planned on getting an abortion but you changed your mind and haven’t touched anything since. He’s just trying to control and manipulate you. No matter how afraid you are of him you must never so him fear.",
            "Depends on the judge, honestly. But stop talking to him and don't tell him when the kid is born. Simple as that. \n\nAs far as the shrooms go, my daughter had her last son 9 weeks premature due to illegal Norco use. She did not lose her son or any of her kids. They would just drug test you, and if you're clean, they won't bat an eye.",
            "Probably just getting an abortion would be the best move to end this mess.  You'll be stuck with this prison your whole life if you don't.",
            "The right to bodily autonomy goes both ways. You get to choose if you want an abortion, but you also get to be the one to decide if you don't want one. That's how it works in states that haven't legislated that right away. Talk to a family law attorney to get the specifics. Shrooms have been decriminalized in Colorado, but that doesn't mean you can do them while pregnant. You should really get some legal advice though.",
            "NAL - call his bluff. He doesn’t want the kid. He wants to control you.\n\nHe might consult a lawyer. He might even file a petition. But I ~~guarantee~~ offer no guarantees but strongly suspect he won’t follow through with it. This is all manipulate you.\n\nEdit because hyperbole is illegal.",
            "Bringing a child into this mess is a lifetime of legal fighting.\n\nYes, you admitting to using a schedule 1 psychedelic substance during pregnancy is something he can use against you.\n\nNeither of you are currently mature enough to parent a child. He doesn't want to be a father and is trying to coerce you into an abortion. You used mushrooms while pregnant. You've demonstrated that your ability to make sound decisions in the best interest of the child is not adequate. He's demonstrated that he will commit abuse through attempted coercive control.\n\nLegally, your best option is to abort. Psilocybin mushrooms affects on a developing fetus are not well understood but can cause a host of neurological issues. I say this even as a strong proponent of legalization. If the fetus has been negatively affected, you could wind up with an infant in foster care from birth. If not, you're going to have to take him to court for child support and he's unlikely to pay which means court. Over and over and over. And it's hard to pay for court when you lack the support needed to cover daycare.\n\nWake up, and do the adult thing."
        ]
    }
}