{
    "Resources & Referrals": {
        "title": "Resources & Referrals",
        "score": 56,
        "url": "https://www.reddit.com/r/legaladvicecanada/comments/wrrac9/resources_referrals/",
        "content": "Here are some resources collected by the members of this sub to help you find legal representation when you need it.\n\n* [Find A Lawyer](https://www.reddit.com/r/legaladvicecanada/wiki/findalawyer) by province.",
        "num_comments": 14,
        "comments": [
            "Thanks to /u/artsy_fartsy_lawyer for preparing the [previous version](https://www.reddit.com/r/legaladvicecanada/comments/p6qt9l/law_society_referral_services_free_legal_help_to/) - their work heavily informed this wiki page!",
            "You should add a list of all the compensation advisory services on here. Multiple provinces have them available and they’re basically legal aid for the compensation system in the province.",
            "Thanks for those involved in creating this table! \n\nI would suggest adding another column for legal clinics (community legal clinics and student legal clinics). Legal clinics can help low-income folks who do not qualify for Legal Aid. \n\nHere in Alberta we have:\n\nCalgary Legal Guidance\n\nEdmonton Community Legal Clinic (serving Northern AB as well)\n\nGrande Prairie Legal Guidance\n\nLethbridge Legal Guidance\n\nCentral Alberta Community Legal Clinic\n\nStudent Legal Assistance (Calgary)\n\nStudent Legal Services (Edmonton)\n\n211 is a great place to get information about legal services and social supports.",
            "I know it's pinned, but I don't see it on mobile and I sort by new.\n\nCan I suggest that link be set up on an automobile first reply to new posts?",
            "[removed]",
            "Thanks!",
            "[removed]",
            "I wonder why I can't create a flair when posting",
            "**Complaint about Comment or Action**\n\nYour post  or comment has been removed.  If you have a question or comment about moderation, send a message to the moderators as outlined below.  If you see a comment that is objectionable, use the report button to call it to moderator attention.  Please review the following rules before commenting further\n\n* [Rule 4: No Arguing With Moderators](https://www.reddit.com/r/legaladvicecanada/wiki/index#wiki_rule_4.3A_no_arguing_with_moderators)\n* [Rule 9: Guidelines For Posts](https://www.reddit.com/r/legaladvicecanada/wiki/index#wiki_rule_9.3A_guidelines_for_posts)\n* [Rule 10: Guidelines For Comments](https://www.reddit.com/r/legaladvicecanada/wiki/index#wiki_rule_10.3A_guidelines_for_comments)\n\n\n\nIf you have any questions or concerns, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Flegaladvicecanada).",
            "If you are using Android, it is an Android reddit app bug. Some people can see the flair option only after making a few comments in the sub. Others need to use a browser on a computer to post."
        ]
    },
    "Bought a foreclosure - Previous owner wants the stuff he left.": {
        "title": "Bought a foreclosure - Previous owner wants the stuff he left.",
        "score": 24,
        "url": "https://www.reddit.com/r/legaladvicecanada/comments/1dloit0/bought_a_foreclosure_previous_owner_wants_the/",
        "content": "Hey everyone! This one's a bit of a doozy, so I apologize in advance!\n\nSo two months ago we bought a house in Northern BC. It was a foreclosure sold \"as is where is\" by the bank who took it from the previous owner between 3.5 and 4 years ago. Not only was it sold \"as is where is\" but the purchase agreement explicitly states that at date of possession the seller is required to leave the property vacant. In the time the bank owned it the guy admits to having squatted in the home and even let other people squat there while he didn't. He's also a hoarder-type and a junkyard mechanic. I'm sure if any of you have driven around rural BC you know exactly the type. The 2 acre property was absolutely jam packed with old vehicle and garbage. There's even a dilapidated mobile home sitting in the middle of it all. A clause in our mortgage as well as insurance states that we have until a certain date to clean up the property. We were fine with this and ready and willing to put the work in. Moreover, some of the items would be worth some amount of money, even in scrap metal, which would help pay for the renovations. In the few weeks where he found out that the house was being bought to when we took possession he cleared out about half of the property. Because I knew he wanted the stuff, and we needed to get rid of it, and despite knowing that we technically owned it and could make some money off of it, I was more than happy to give the guy some more time. We knew that, being a hoarder-type, he cared about all of it despite most of it being literal garbage. I was trying to be a nice person and not completely cut the guy off if some of the stuff was sentimental. We also thought that since he had cleared much of it in 3 weeks that he wouldn't take too much longer than that to finish. We had some stipulations to this deal and gave it an end date of two months.\n\n\\*\\*A:\\*\\* He couldn't just take anything. He had to tell us what he was taking as we may have decided to keep it. He had to ask us if he could take specific things and we would give him the ok or not.\n\n\\*\\*B:\\*\\* He had to tell us when he was coming.\n\nWell. After we took possession he broke both of those stipulations. He came only twice in 2 months, both times unannounced, and both times took things without informing us. I reminded him multiple times throughout the two months of the stipulations and end date. He did sometimes tell us that he would come, but then never did. He also kept speaking as if he owned the stuff, saying things like \"I'll give you this\" despite me reminding him that he didn't own any of it and technically it was already mine. We didn't have any written agreement, but have proof of this from references in text messages as well as security cameras.\n\nThe very last day of the agreement was 7 days ago. On that day he came around 18:30 and hooked up a boat and loaded some boxes full of old magazines (not the boxes with pictures of his kids, mind you) and was telling me that he's going to go hard the next week getting stuff. I told him that the deal was over because we couldn't trust that he was going to follow through given his behaviour over the past two months and that we had an obligation to get rid of stuff. I explained that we're paying 4 times what insurance would be because the insurer considered the mess that much of a liability and we can't afford to store the stuff. He offered to pay us to keep it there and I said no because we still are obligated to remove it. \n\nUnbeknownst to me, after I spoke to him my partner made a deal with him that if he could remove the dilapidated mobile home (that's the biggest liability) within 7 days, then he could have another 2 weeks to help \"clean up the property\". Up until now we had never, and still now didn't, specify he could take anything other than this mobile home. She added the same stipulations to this, that he couldn't take \\*anything\\* else, and he \\*had\\* to tell us when he was coming. She explained that if he failed to uphold his end that the deal was null and void. This was all via text, with very official language and dates and even specifying the address. He agreed to it and two days later he broke it by coming onto the property unannounced twice, and one of those times, taking more things that he wasn't allowed to. So we informed him that he broke the conditions of our deal and to not come back to the property or else we would consider it trespassing and have to involve the RCMP.\n\nHe freaked out, tried to justify what he took by saying that it was at the front of the property by the house, and even questioned why we moved a lawnmower from the same area back about 40 feet behind a wire we put up to prevent strangers from driving back and stealing things. He was still, after all this, acting as if he owned things or had some kind of right to them. He informed us that he would be involving his lawyers, the RCMP, and then said that he was going to serve me later in the week.\n\nWe filed a police report for the theft, but decided to forgo pressing charges for now. We were told we can decide to do so later. \n\nI feel I should also note that in the past two months, and increasingly over the past two weeks, we've had no fewer that 8 random vehicles drive onto our property, slow down or even stop for a while, before leaving and driving away. My wife feels very intimidated by this and is scared that he's asking people to come scope out the house (I work from home sometimes).\n\nTwo days ago he showed up at my house with a flat-deck trailer and two friends in separate trucks. One of which I have a recording of as being one of those unrecognized vehicles. He called me and asked if I wanted to call the cops or he should as he was here to take one of the vehicles and a motorcycle. We both called and the RCMP showed up. They were here for 3.5 hours, and spent 2.5 talking to him. In the times they did talk to us and we showed them all the texts, as well as our purchase agreement, and explained the situation, they seemed to think that we were well within our rights to do what we did. Eventually they got him to leave with the understanding that he was not allowed to step foot on the property again. Well he showed up again today to \"serve\" me by leaving a Notice of Claim for small claims court. The \"Defendants\" section that he filled out, though, isn't filled out properly at all. It has the wrong phone number and a completely different name (think \"James\" vs. \"Patrick\"), though he does name my wife correctly. Moreover, he doesn't actually specify anything in the claim. Just \"many items\".\n\nNow he's trying to intimidate me over text, as well. I haven't responded to anything in a week.\n\nWe are in the process of getting a lawyer, but I wanted to ask here too. Thanks for reading this far!\n\n\\*\\*QUESTIONS:\\*\\*\n\n\\*\\*1.\\*\\* What exactly does \"as is where is\" mean in this instance?\n\n\\*\\*2.\\*\\* If the seller was required to leave the property vacant, does that mean everything that was left upon possession is considered abandoned?\n\n\\*\\*3.\\*\\* If he has a registration for a vehicle in his name does he, even after all of this, still have a right to claim that vehicle? Does this change if the registration is expired and never renewed?\n\n\\*\\*4.\\*\\* If the Notice of Claim is not filled out properly, doesn't specify anything, and was delivered by himself not to myself but my door, do I have to do anything with it?\n\n\\*\\*5.\\*\\* Where are the different possible places you can see this ending up?\n\n\\*\\*6.\\*\\* Do you have any other advice or can point me in the direction of something I haven't considered?",
        "num_comments": 16,
        "comments": [
            "\nWelcome to r/legaladvicecanada!\n\n**To Posters (it is important you read this section)**\n\n\n* Read the [rules](https://www.reddit.com/r/legaladvicecanada/wiki/index/#wiki_the_rules)\n* Comments may not be accurate or reliable, and following any advice on this subreddit is done at your own risk.\n* We also encourage you to use the [linked resources to find a lawyer](https://www.reddit.com/r/legaladvicecanada/wiki/findalawyer/).\n* If you receive any private messages in response to your post, please let the mods know.\n\n**To Readers and Commenters**\n\n\n* All replies to OP must be on-topic, helpful, explanatory, and oriented towards legal advice towards OP's jurisdiction (the **Canadian** province flaired in the post).\n* If you do not [follow the rules](https://www.reddit.com/r/LegalAdvicecanada/about/rules/), you may be banned without any further warning.\n* If you feel any replies are incorrect, explain why you believe they are incorrect.\n* Do not send or request any private messages for any reason, do not suggest illegal advice, do not advocate violence, and do not engage in harassment.\n\n Please report posts or comments which do not follow the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/legaladvicecanada) if you have any questions or concerns.*",
            "This is simply ridiculous. I would have contracted a waste removal company yesterday and had them completely remove everything. Forget trying to pawn off old stuff as it would simply open up a can of worms. \n\nJust junk everything, immediately.",
            "Don't contact him, record everything he attempts to send to you. Record license plates of vehicles he appears with.",
            "To answer #4 - is the notice of claim stamped anywhere showing it was actually filed and he didn’t just hand you the form without having it properly filed?",
            "We bought a foreclosure ~7 years ago.  The fellow was still living in the place until the day we got keys. The bank and realtor were adamant there was no “ proper is as it was on … date”   Basically you get it in the state it’s in once you get possession and keys. Our realtor even told us horror stories how some owners would take a hammer to each wall on the way out of flush a bag on concrete if they were spiteful ( we were lucky neither of these happened to us.   But what was interesting is the lawyer and bank said we only bought the house. Technically there was nothing stopping the old owner from selling everything else, furnace, dishwasher, stove, fridge  , etc are not sold as part of the house in a foreclosure. Once you get keys if they’re are gone, tough.\n\nHowever as soon as you get keys, everything remaining is yours.   The only thing I’m not sure about would be vehicles, those are in previous owners names, but I would have them towed right away and have the company deal with storage , fees ad old owner.",
            "I bought a foreclosure two years ago in a semi rural area of Alberta. I strongly recommend filing for a restraining order as soon as possible. I am unfamiliar with the process in BC, but filed mine directly at the courthouse.\n\nAlthough some details of our situations are different, my house was also formerly owned by a motorcycle “enthusiast” that enlisted his friends to stalk me. Do not underestimate the severity or potential escalation of your predicament. If you have pets or children take extra measures to protect them immediately. Trust your instincts, if something feels off take that seriously. Document everything, no matter how small. \n\nDespite still having my house, I am back in my parents’ basement living hours away from the place I pay for. Do not underestimate anything that is happening.",
            "You’re too controlling. \n\nYou should have let him have additional time to take his belongings without all the rules. Then once that was expired you could have taken the rest to the dump.",
            "Yep, you could even have a scrap bin dumped and just go nuts throwing everything metal into it, would help offset the cost of the waste removal. \n\nThat RV is going to be a real pain though because no one wants to take them",
            "Wow very creepy sorry you had to go thrugh this.",
            "They should have just said no and gotten rid of or sold everything.  He had years."
        ]
    },
    "Car Dealership lied in my loan application.": {
        "title": "Car Dealership lied in my loan application.",
        "score": 61,
        "url": "https://www.reddit.com/r/legaladvicecanada/comments/1dlixdl/car_dealership_lied_in_my_loan_application/",
        "content": "Test drove a used car. Liked it. Added GAP policy and some extended coverage. Signed the purchase agreement based upon the approval of my loan. Loan got approved. \n\nTurns out that dealership has inflated the duration of my job by 2 yrs and the duration of my time in Canada by 3 yrs. They sent me a final agreement on the mail in which I had to sign on the loan terms, gap policy coverage terms, extended warranty terms and what not. Basically a complete bill of sale.\n\nI simply refused to sign it. I wont testify on wrong information ever. \n\nDealership is now harassing me to take delivery. We have done the registration, safety.. the car is in your name. Bro how ? I havent provided u proof of insurance, void cheque and I refused to sign ur shady agreement. \n\nSo, how fcked I am or should I just relax..\nShould I make a complain to OMVIC ? \n\n",
        "num_comments": 51,
        "comments": [
            "\nWelcome to r/legaladvicecanada!\n\n**To Posters (it is important you read this section)**\n\n\n* Read the [rules](https://www.reddit.com/r/legaladvicecanada/wiki/index/#wiki_the_rules)\n* Comments may not be accurate or reliable, and following any advice on this subreddit is done at your own risk.\n* We also encourage you to use the [linked resources to find a lawyer](https://www.reddit.com/r/legaladvicecanada/wiki/findalawyer/).\n* If you receive any private messages in response to your post, please let the mods know.\n\n**To Readers and Commenters**\n\n\n* All replies to OP must be on-topic, helpful, explanatory, and oriented towards legal advice towards OP's jurisdiction (the **Canadian** province flaired in the post).\n* If you do not [follow the rules](https://www.reddit.com/r/LegalAdvicecanada/about/rules/), you may be banned without any further warning.\n* If you feel any replies are incorrect, explain why you believe they are incorrect.\n* Do not send or request any private messages for any reason, do not suggest illegal advice, do not advocate violence, and do not engage in harassment.\n\n Please report posts or comments which do not follow the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/legaladvicecanada) if you have any questions or concerns.*",
            "**If you want the car still:**\n\n1. Tell them to amend the agreement to reflect accurate times (your time in your job, Canada, etc.) and when they send you the new agreement with the changes you will sign it.\n2. Make an OMVIC complaint\n\nSomething to consider: your loan's interest rate may increase. \n\nI'd bet that the sales person lied on the loan application in order to get you a better interest rate and take credit for getting you a great deal so that you would be more inclined to buy the car.\n\n**If you don't want the car anymore:**\n\n1. Make an OMVIC complaint. \n\nLastly,\n\nI want to commend you OP on your level of integrity and honesty. Not many people would do what you do. Many people would say, \"well it wasn't me who lied! It was the dealership!\" as a way to justify their actions of benefiting from a lie.\n\n**Integrity is doing the right thing, even when no one is watching.** - CS Lewis",
            "lol  a certain company that has a goat did that to my sil. They changed her income to look like she made like 70k. Then she traded that one in and they “gave” her 19k for her truck and in the end added the 19k onto her trade in cost. And they took her truck. So she’s pay them for the rest of her truck, an additional 19k for the truck and 50k+ for her hornet. And they sold her new one for more than the window sticker. But she doesn’t listen to anyone so it’s a her problem. Edited for wording.",
            "If you didn’t sign the agreement, I don’t see how you’d be on the hook, and yeah I don’t see how they could have registered it to you without your insurance in Ontario. \n\nI would report to OMVIC and walk. If they did that, who knows what else is going on with the car itself.",
            "I was in the process of purchasing a used car and I asked for the carfax history. They assured my the history was clean. But they refused to provide it. Finally the night before pickup I said I would not pickup until I got the carfax…well they lied about the history of the car. It had been in a major accident. It had been bought since then and returned because of issues. It had been on the lot much longer than they said. Bunch of other stuff. It was a mess! \n\nI told them I wasn’t buying it. They threatened all kind of stuff…just like the dealership your dealing with. \n\nI told them I was going to file an OMVIC complaint. Just me saying I was going to file a complaint shut down the nonsense. They told me they would refund my deposit immediately. It took about a week but I got my deposit back.",
            "Tell them you are going to call the bank and disclose their fraud on the application, explain to the bank why you are refusing to take delivery of the vehicle. Also when you call the dealership to tell them this, ask to speak with the dealer principle (owner) if he is not available then the general manager. You should also be able to email both of these people, their email is usually on the website. If they don’t say ok and refund your deposit, phone the bank. If you need a banks number I can try to get it for you",
            "Speaking from the lender’s side of things they probably over inflated your tenure because they are lazy. Dealertrack or RouteOne (depending which one the dealership uses) requires a minimum 2 year history of employment and address history. So they will usually default both fields to 2/3 years because they are too lazy to ask or feel “it’s an inconvenience to ask my customer” for the appropriate information. Which I feel is complete BS from my point of view but w/e. \n\nAs far as I am aware registration can’t be completed without a bill of sale but it is also extremely easy to be undone. As far as financing goes unless we have ALL pieces required for funding (which includes the PAD/void chq) that car isn’t getting funded and the dealership isn’t getting paid. I can’t count how many times I have had to pull deals from funding for outstanding documentation resulting in the contracts expiring (exceeding the first payment date).\n\nThe safety was likely completed in anticipation of the delivery. But that means nothing if you haven’t signed all the paperwork dealership is on the hook for it. I wouldn’t sweat it too much, they might keep your deposit but that is about all they can do.\n\nYou can report them to OMVIC however not much will likely come of it. You would be better to call the lender’s customer service and file a complaint. At least for us it launches an investigation on that dealership and can result in their deals going under the microscope (both past and future deals).",
            "You are playing a safe game by rejecting this.\n1. Make OMVIC complaint\n2. Leave a scathing review (Google, Yelp, Bing, Yellowpages & Dealerrater) \n3. If they are a part of an OEM brand, find the regional manager on LinkedIn and send rhem an email too.\n\nMake sure you save all the paper trail. Going forward have all the conversation in an email.",
            "Never ever agree to gap or extended warranty. Your insurance with give you gap coverage for much less than the dealership and everyone knows an form of extended warranty is a scam",
            "Do complain to the OMVIC. They shouldn’t register a car under your name unless you have signed the bank contract. If you haven’t signed the contract, they have to cancel registration."
        ]
    },
    "Canadian father died in Mexico": {
        "title": "Canadian father died in Mexico",
        "score": 151,
        "url": "https://www.reddit.com/r/legaladvicecanada/comments/1dl9p8i/canadian_father_died_in_mexico/",
        "content": "My retired father passed away the other day in Mexico very unexpectedly. I was able to find a funeral home that picked up his body and cremated him, and I’m flying down in a few days to bring him home. I’ve been in contact with global affairs in Canada, and they forwarded paperwork to the funeral home. Is there anything else I’m missing? My father didn’t have any plan in place, and I’m overwhelmed with this grief and the unfamiliarity of doing this for the first time. ",
        "num_comments": 44,
        "comments": [
            "\nWelcome to r/legaladvicecanada!\n\n**To Posters (it is important you read this section)**\n\n\n* Read the [rules](https://www.reddit.com/r/legaladvicecanada/wiki/index/#wiki_the_rules)\n* Comments may not be accurate or reliable, and following any advice on this subreddit is done at your own risk.\n* We also encourage you to use the [linked resources to find a lawyer](https://www.reddit.com/r/legaladvicecanada/wiki/findalawyer/).\n* If you receive any private messages in response to your post, please let the mods know.\n\n**To Readers and Commenters**\n\n\n* All replies to OP must be on-topic, helpful, explanatory, and oriented towards legal advice towards OP's jurisdiction (the **Canadian** province flaired in the post).\n* If you do not [follow the rules](https://www.reddit.com/r/LegalAdvicecanada/about/rules/), you may be banned without any further warning.\n* If you feel any replies are incorrect, explain why you believe they are incorrect.\n* Do not send or request any private messages for any reason, do not suggest illegal advice, do not advocate violence, and do not engage in harassment.\n\n Please report posts or comments which do not follow the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/legaladvicecanada) if you have any questions or concerns.*",
            "Get a letter of content from the funeral home that says there are ashes in the urn.  Also a cremation certificate from the crematorium.  You will need death certificates from Mexico, possibly from the state in which he died, certified, to process things at this end (probate etc.)  I would order a dozen depending on the size of the estate.",
            "Did he have a will? Contact his lawyer if you know them to see if he ever wrote a will with them. So sorry this happened to you.",
            "Oh boy sorry to hear.  I don't have alot of advice but my step dad passed away in Mexico as well unprepared (he lived there half the year). My mom ended up having him cremated there as it was too stressful for her to bring him back.",
            "My condolences to you, I can imagine the grief and stress of it all at once. Take care of yourself and take it easy, no need to rush and get all of his accounts and things sorted immediately.",
            "I would also call the Airline you are flying with and just ask a customer service representative if there will be any issues flying with human remains.   Not that I know of,  but better to ask and find out.   Maybe you need certain paper work for that too.",
            "Sorry this is happening. My father passed away suddenly while on vacation in Mexico. However it was 20 years ago so the details are blurry. We did receive a death certificate from Mexico. Fairly certain all we had was the death certificate which is in Spanish.",
            "If there is a local embassy or consulate that you can directly contact, see if anyone can help.  You can also show up and ask for assistance in person.",
            "Do you know anyone that speaks Spanish, that you could call if you need help while dealing with the Mexican agencies?",
            "You will need a dead certificate to file his last tax return"
        ]
    },
    "Father paying child support. X2 kids were taken away from mother by social services from drug use ": {
        "title": "Father paying child support. X2 kids were taken away from mother by social services from drug use ",
        "score": 4,
        "url": "https://www.reddit.com/r/legaladvicecanada/comments/1dlukix/father_paying_child_support_x2_kids_were_taken/",
        "content": "Greetings,\n\nAs the title says above, I am a single father father paying child support to X2 kids, age 9.  I have been separated from the mother since they were approx 2 years old.  I have recently returned from a 6 month workplace task outside of Canada.  Upon returning to Canada the following has happened withing a span of 2 weeks.\nAfter the last week of school had passed, I was contacted by the mother's brother (my children's uncle), informing me that he cares about his nephews and he is concerned about the well-being of them.  He told me that the mother has admitted to doing the drug DMT in the presence of my children, and her living place is a disaster and unsafe. He feels at this point the mother is no longer capable of raising her children.\nAlso, to add to the story, the mother also has another son, from another relationship, no relation to me. He is 17yrs old and has recently moved back in with the mother.  This older son has been relaying information to the uncle for the last 2 months about the situation.  Me and the older son are still friends on Facebook and are friends.  He confirmed all mentioned info about the frequent  drug use and he even sent me a video of the current living conditions of the place.  I screen shotted all the conversations and forwarded the video to CPS.\nOnce CPS got a hold of  the conversations, video, and statements from me, the uncle, and her older son, 4 days later social services or CPS took the children away from her and gave them to me.  I also filed a police report with the RCMP, and I also notified their school of the situation. Now my real question, OUR CUSTODY AGREEMENT:\n\nwe never really had an on paper legal agreement.  We never wanted to go through the court system.  All we had was a VERBAL AGREEMENT. Now before you judge, when we first seperated, she wasn't really into heavy drugs, she just smoked cannabis and occasionally drank alcohol, but more importantly, we trusted each other well enough to put the children first. Her deterioration I suspect only happened within the past 2-3 years. I could never prove it until the uncle and older son came forward and told me.  The agreement is very basic but here it is:\n\n- I would pay 1000cad per month for X2 children\n- I would get them every other weekend, and also on my vacation days as reasonable as possible (I travel a lot for work, and I also have a lot of time off due to vacation and travel days)\n\nBig questions here: \n\n- do I have to currently pay her child support when they are with me?\n- since it is only a verbal agreement, would there be any legal ramifications if I don't ?\n- I am looking into getting a lawyer, how much will this cost me ? \n- if I feel my children are unsafe, do I have to give them back to her?  She needs to produce a clean drug test in order to be able to see her kids.\n\n",
        "num_comments": 2,
        "comments": [
            "\nWelcome to r/legaladvicecanada!\n\n**To Posters (it is important you read this section)**\n\n\n* Read the [rules](https://www.reddit.com/r/legaladvicecanada/wiki/index/#wiki_the_rules)\n* Comments may not be accurate or reliable, and following any advice on this subreddit is done at your own risk.\n* We also encourage you to use the [linked resources to find a lawyer](https://www.reddit.com/r/legaladvicecanada/wiki/findalawyer/).\n* If you receive any private messages in response to your post, please let the mods know.\n\n**To Readers and Commenters**\n\n\n* All replies to OP must be on-topic, helpful, explanatory, and oriented towards legal advice towards OP's jurisdiction (the **Canadian** province flaired in the post).\n* If you do not [follow the rules](https://www.reddit.com/r/LegalAdvicecanada/about/rules/), you may be banned without any further warning.\n* If you feel any replies are incorrect, explain why you believe they are incorrect.\n* Do not send or request any private messages for any reason, do not suggest illegal advice, do not advocate violence, and do not engage in harassment.\n\n Please report posts or comments which do not follow the rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/legaladvicecanada) if you have any questions or concerns.*",
            "NAL. You're going to need a custody order and, given the circumstances, should retain a lawyer to petition for an emergency custody order. Until you get the ok from a judge, the kids rightfully belong to both of you, meaning the police can't take the kids from you for her, but if she did take then back you couldn't have the cops stop her either. Its a very vulnerable position that needs legal clarity for the best outcome.\n\nWithout a court order, there's no need to pay child support. You may get conflicting advice on this point, as sone would argue to keep paying until you're told to stop by a court. I personally believe the better move is to put payments in a separate savings account so, if order by a judge, you can pay back any arrears. Again, the court order is imperative in this.\n\nAs for lawyer costs, call around and get some quotes, most lawyers will do a free consultation. With an emergency court order, and the speed you need everything done, I imagine you'll be looking at 15k to 20k when the dust settles. A pittance for your kids safety, but a lot of money that may require a payment plan. Good to inquire at these consultations is that type of plan.\n\nThe last question about giving the children back is a difficult one. If I felt my kids were unsafe, and I had evidence to that point, I'd also refuse. However, the court may not love that because you've kept a routine and are now breaking it without a court order. I think the smartest thing to do is to keep the kids, assume the mother may call the police (whereby the lack of court order will work in your favor) and start your lawyer search immediately. Again, the key is an emergency custody order with an eye on a future custody hearing."
        ]
    }
}