{
    "The hospital reported my kids summer camp to Children Family Youth Services, in retaliation we got kicked out of summer camp.": {
        "title": "The hospital reported my kids summer camp to Children Family Youth Services, in retaliation we got kicked out of summer camp.",
        "score": 710,
        "url": "https://www.reddit.com/r/legaladvice/comments/1dqzj09/the_hospital_reported_my_kids_summer_camp_to/",
        "content": "My kid got injured at summer camp, not severe but needed to be checked out. the camp did not notify me of the injury or record it, instead, it was recorded as inappropriate behavior, and my child was reported for holding the area that was hurt with a softball inappropriately. When I saw him I realized something was wrong and we went to the hospital because of swelling, the hospital reported the camp to CYF. We were kicked out in retaliation and they are refusing to provide documentation of the incident or a reason for why he was kicked out of camp. Also refusing to pay us back our money for the summer. Can they do this legally in PA?",
        "num_comments": 11,
        "comments": [
            "> refusing to pay us back our money for the summer. Can they do this legally in PA?\n\nProbably not but it will be up to a judge to decide. You would sue them in small claims court for a refund. Send a demand letter first.",
            "The camp should have their own  insurance, and reimburse you for medical expenses.  They are hiding something.",
            "If they are refusing to provide documentation you need to figure out what they are hiding.",
            "Look up your small claims court limit in your county- it will be on the county clerks website (or whatever your local equivalent is.) Small claims is designed to be handled without an attorney so if they don't respond to your demand letter you can take them to court yourself. \n\nWhen you send the demand letter, send a copy to both the local camp director and head of the national office. Request both a refund for camp and reimbursement for your unexpected child care expenses if that still keeps you under the small claims limit. Include a copy of the hospital report and a copy of the family services referral if you can get one.",
            "The camp is protecting themselves from a lawsuit. Consider suing the camp and conducting discovery of their files and depositions of their staff.\n\nIt will be a long, expensive undertaking but if you want answers, that's the way to get them.",
            "How old is your kid and what did they say happened?",
            "If your child is involved and was seen at the hospital, that is the time to involve a personal injury attorney.  You can get a referral from your local bar association and they will give you a free consultation.",
            "Sounds like time for police report! Children and all.",
            "Sounds like a softball to the crotch? The camp is hiding something, time to lawyer up!",
            "Many camps are accredited by a youth camp organization of some sort. Most who are accredited have that info on their website. Notify the accreditation organization."
        ]
    },
    "Landlord gave me a $90,000 invoice and told me he will sue me for non-payment.": {
        "title": "Landlord gave me a $90,000 invoice and told me he will sue me for non-payment.",
        "score": 856,
        "url": "https://www.reddit.com/r/legaladvice/comments/1dqwe9a/landlord_gave_me_a_90000_invoice_and_told_me_he/",
        "content": "Hi all,\n\nThis is in NYC.\n\nI own a restaurant and we signed a lease in 2016 where a clause states that I would be responsible for property tax and CAM+other charges increases since 2012. A lawyer reviewed the contract, threw his hand up and said \"nothing we can do\".\n\nThis happened about 2 weeks ago when I tried to negotiate with the landlord to reduce my rent because my business is struggling. He then said this is an insult and thew this 70k tax bill on me and then when I call again, threw the CAM and other charges as well (20k). In his initial email, he straight up said \"see you in court\".  Also with this, he factored in the tax increase into my rent and increased my rent by about a thousand dollars.\n\nThere's nothing wrong with the bills and the numbers adds up, the landlord also owns like 200+ other properties.\n\nWhat can I do now?\n\nExtra details:\n\nThrough my 8 years with the landlord, not once did he give me a bill for the property taxes or cam or even mentioned it.\n\nAlso losing side on a trial pays the winning side attorney fees.\n\nIf it helps or doesn't help, the invoices also doesn't have a set due date\n\nThis is signed with my LLC with a personal guarantee.",
        "num_comments": 51,
        "comments": [
            ">What can I do now?\n\nObviously Id talk to my lawyer here. Is it a business entity that owes, you personally, or both?",
            "NY SOL on breach of contract is 6 years so you might have some defense for lack of payment for some early years. Could have some laches defenses too. Not a NY lawyer and not your lawyer, just some initial thoughts. GL",
            "It sounds like you signed a NNN lease. You should get a property tax bill once per year prorated to your space and metered or split utilities monthly or quarterly. If you didn't get that right away, you're probably still on the hook.\n\nDo you have a good-guy clause on your lease? You're still on the hook for current charges but might be able to sacrifice the deposit to pay that off?",
            "You my have a defense of statute of limitations or course of dealing. Have to make a decision though. Default and play hardball or keep paying.",
            "Have often seen commercial landlords slide on cam until when big projects are done.  There in no clause saying when they have to bill you but check your lease it probably says 30 days from when you are billed.   If this is multiple years of invoices your best bet would be to ask for a payment plan.",
            "Are you familiar with NNN lease? Did you sign one?",
            "What does \"Signed with my LLC with a personal guarantee\" mean?  \nThe whole purpose of an LLC is to separate your personal assets from your business so if someone comes for your business, the officers of the LLC are personally sheilded.",
            "I am under the impression there may be a three year statute of limitations for collection of debts this also includes allowable time to sue you for such debts, in New York. After this 3 year period there is a legal time bar. Subsequently, I dont believe he can charge you beyond the last 3 years. NAL but I have read this was recently changed from six years to three. Please seek advice",
            "Why tf would you sign something like that? It's hard to feel sorry for such an idiotic move.",
            "You could request the tax papers from the payments he made and offer to pay it back on a monthly basis until paid in full to ensure you arent getting charged more then what it is ask for receipts"
        ]
    },
    "Doctor’s office receptionist told mom that I (25) have no contact with that I was at the doctors yesterday, are they allowed to do that?": {
        "title": "Doctor’s office receptionist told mom that I (25) have no contact with that I was at the doctors yesterday, are they allowed to do that?",
        "score": 1535,
        "url": "https://www.reddit.com/r/legaladvice/comments/1dqpy9s/doctors_office_receptionist_told_mom_that_i_25/",
        "content": "The doctor’s office told my mom I have no contact with that I was at the doctor’s office yesterday. She was very abusive when I was a child and I haven’t spoke to her in years. This happened in kentucky.\n",
        "num_comments": 213,
        "comments": [
            "How did this come up? Like, is her number still on your records and they called to follow up on something, or are you talking about a gossipy scenario?",
            "The amount of times that I have parents, usually moms (Im a mom too), who call and try to get information about their adult kids because they are their mom and they deserve to know is crazy. Once they are over 18, you have no say over them. Unless they allow it.",
            "No it is a HIPAA violation and can result in heavy fines and/or jail time. Usually fines. Report her. I seriously doubt this is the first time she has done this. She abused her position and access to your records. Report her.",
            "They shouldnt be talking about you at all especially since you are a adult its a privacy violation",
            "hipaa violation.  report.  there is a link in the first few comments.....",
            "How did you find out this happened, and how sure are you that it happened the way you think it did? If your mother found you and said that the Doctor's office said you were there, verify that she didn't find you through some other means (a friend's betrayal, stalking, etc.) and blaming the Doctor's office. \n\nIf the Doctor's office confirms that they told her, of course, then you don't need to take the extra precaution to make sure that there isn't another security risk that you aren't looking at.",
            "I guess my question is how do you know that mom went to the office and how do you know that the office gave your mom information?",
            "Are you still on her insurance? If yes, she will get notified of every bill.",
            "No they are not allowed. Even if you did have contact, shes breaching confidentiality.",
            "This is a HIPAA violation."
        ]
    },
    "Business next door to my home is burning massive amounts of firewood daily for BBQ restaurant.": {
        "title": "Business next door to my home is burning massive amounts of firewood daily for BBQ restaurant.",
        "score": 646,
        "url": "https://www.reddit.com/r/legaladvice/comments/1dqt5a9/business_next_door_to_my_home_is_burning_massive/",
        "content": "Hello I live in Cincinnati, Ohio. I own a home in a mixed use area. Primarily residential with a few stores and restaurants. My neighboring building has multiple small restaurants in it. The building sits about 170 feet away with a public parking lot dividing my property from the other building. About 6 months ago a new business moved into the building in question. They are a local BBQ business, and the owner purchased two giant industrial sized smokers to cook in and had them placed in the parking lot directly facing my home. He apparently prepares food for all his restaurants through his new location and smokers. The problem is that this creates massive amounts of firewood smoke, for as much as 12-14 hours a day. Currently my house is constantly sealed or the smell of smoke will seep into everything. When it was open the smell is overwhelming and the room becomes noticeablely hazy. And I can't be outside to enjoy my own property without getting a migraine and my eyes swelling. I have tried talking to the owner but he refused to acknowledge that there was an issue. So I was curious if there was anything I can do to find a remedy to this situation. It's something I've never had to deal with before so I'm not sure if I even have a valid complaint. I did live in Oregon for many years, and I know when wood burns it releases alot of particles in the smoke. Over a short time it is inconsequential, but sustained smoke exposure will cause problems for both life and property and it does concern me. Thanks ",
        "num_comments": 53,
        "comments": [
            "Another avenue to look into is if the business can legally use the smokers in the parking lot (you said public, but is it?). Would at least require the smokers to be moved (hopefully farther away from you).",
            "Do you know the name of his other restaurants? Maybe he ran into the same complaints and was forced to move.",
            "Your best first step would be your local elected representative.  They may be able to put you in contact with local or state environmental authorities.",
            "Unfortunately my cousin's neighbor is doing the same thing in between their homes. Smoking all day, she has to keep her home all closed up. I suggested for her to buy an industrial fan and set it up to blow back to his yard. I'll know next week if it worked.",
            "NAL but a restaurant guy. Call the health & fire departments too. If he's preparing food for multiple outlets, he needs a HACCP plan and licensing for getting the food from point a to b. I am curious about allowing outdoor cooking as well. My family owned a restaurant near the university and one in Covington.",
            "Talk to a tort attorney. This is lawsuit worthy.",
            "I am a former health inspector from SC. I can tell you that outdoor grills were not allowed in Charleston county. Call the health department and tell them when he is using them. Call them everyday if you have to. They have to investigate a complaint. It is unsanitary to use outdoor grills to sell to the public.",
            "Could also violate health and/or fire codes. Restaurants are tightly regulated.",
            "Are you in the actual city or close",
            "Call the planning department for your City. E.g. if you live in Norwood, call the Norwood planning department not Cincinnati. But if you live in Cincinnati proper then call their planning  and zoning department. Explain the situation and maybe they have something in their zoning code about external effects."
        ]
    },
    "Property manager gave roommates and I 30 days to vacate because the property sold to new owners.": {
        "title": "Property manager gave roommates and I 30 days to vacate because the property sold to new owners.",
        "score": 362,
        "url": "https://www.reddit.com/r/legaladvice/comments/1dqtsof/property_manager_gave_roommates_and_i_30_days_to/",
        "content": "My roommates and I are from Maine if that makes a difference. We moved into a new apartment June 1 and signed a 12 month lease. AFTER we moved in, the property manager let us know the owner decided to sell the building. Flash forward to today, the landlord called and told us the building sold and that the new owners want us out before the end of July. He said they were offering us a deal that we wouldn't have to pay rent for the month of July if we moved out before this deadline. Then I asked if this was our only option, and he said yes, which confused me because it's not really a \"deal\" if it's the only thing we can do. Then, I asked \"wasn't our lease legally binding\" and he said that no, apparently the lease becomes void when the property is sold to someone new.  The lease that we signed does NOT mention this. \n\nIs this true? Can they just do that? And if they can, what should we do? We obviously wouldn't have much of a choice, but most (if not all) places aren't even available until August, and all of our current (very limited) options are either too far away, or too expensive. \n\nMy current plan is to call the property manager tomorrow and ask if we can extend our deadline to august 1st, at least, as that is when most properties become available. I may also ask what will happen if we don't leave, just so I can get some clarification on the situation. I'm suspicious they may be trying to use underhanded language to make us think we have to leave when we really don't?\n\nPlease suggest any questions I should ask, or what I can do in this situation! ",
        "num_comments": 26,
        "comments": [
            "No, that is not true. The lease moves with the property. Read your lease to make sure it doesnt have some oddball clause about a sale.  If it does, talk to a lawyer as it may not be enforceable.  \n\nThey will need to pay you to go away.  Think about how much it will take to be worth it to you.  You and the other tenants have the ability to complicate the sale process, so it is worth cutting you a check.  That said, the landlord will likely be a pain in the ass if you stick out the whole 12 months, so you might want to be out sooner or later.",
            "Cash for keys!  You have a lease.  They want you out, they will have to pay you.  Few months rent and moving costs is a good place to start.",
            "The property manager is either insanely ignorant or (more likely) lying to you. Potentially because promises may have been made to the new owners that you all would be moving out. Unless there is a specific clause in the lease/contract you signed (and maybe not even then), your options are to stay for the length of the lease, or the old/new property managers can make it worth your while to voluntarily leave. If it were me, I would insist the property manager return the full deposit, sign off on any claims of damage/cleaning/maintenance to the property, and cover all costs of moving. And that would only be after I confirm that I have somewhere to move to.",
            "If you happen to be leasing space within the fantasy realm that your landlord apparently inhabits, then he is correct. However, in the United States you cannot be forced out during the term of your lease in the vast majority of cases.",
            "When you call the property manager ask them where in your lease it says that it terminates if the building is sold.",
            "I've lived through this twice. Both times I was in the middle of a 12 month lease. They couldn't do anything except ask to see the property. The new owners did a walk through, spoke to me about the property and the current lease and then went on their way. One time the new landlord kept the rent the same but made it a month to month lease, which is normal after a year lease. The other time I left a month before the lease ended and they kept the deposit for the last months rent. \nWhen I was informed both times about the sale of the house, I spoke with lawyers and both told me the lease contract couldn't be broken unless both parties agreed.",
            "They're lying to you. The lease conveys with the property, the new owners have to either wait to the end of the lease and not renew, or look into eviction proceedings that they may not be able to legally pursue.",
            "Keep in mind that this deal was in the works before you signed the lease three weeks ago. You owe the landlord no favors.",
            "Along with your moving out costs in your cash for keys negotiation, get a guarantee, in writing, that you will get all of your security deposit back.",
            "Don't know know about Maine but generally that's not the case.  Though landlords will act as if it is. They want everyone out to make it more appealing to whoever they sold it to"
        ]
    }
}