{
    "Welcome to r/legaladvicegerman! SOME INFO ON OUR SUB:": {
        "title": "Welcome to r/legaladvicegerman! SOME INFO ON OUR SUB:",
        "score": 52,
        "url": "https://www.reddit.com/r/LegaladviceGerman/comments/c03d1w/welcome_to_rlegaladvicegerman_some_info_on_our_sub/",
        "content": "We modelled this sub after r/legaladvice, which mainly deals with American, Australian and Canadian law. \n\nPlease note that kostenlose Rechtsberatung by unqualified people is illegal in Germany. We can’t go into an in depth analysis of specific cases. All we can do and offer is a very crude overview of your options. The best and most important advice is and will always be to GO AND GET A LAWYER instead of acting upon advice of us internet strangers. \n\nPlease only make useful and concise contributions when commenting. Illegal legal advice as well as unhelpful or rude comments will be removed and repeating violations will result in a temporary ban. \n\nTag your posts with the country you are asking about, so that we know which country’s laws apply. We created flares for that purpose. \n\nHappy posting!",
        "num_comments": 10,
        "comments": [
            "We actually refer most Australians to r/auslegal",
            "Hey, wie kommt es eigentlich, dass es den Unter hier gibt und r/LegaladviceGermany? Wre es nicht sinnvoll die Subs zu mergen?",
            "Just curious, are there any US/Canadian laws that technically prohibit free legal advice?",
            "German!=Germany. Dieser Unter bezieht sich auf ganz DACH, der Andere nur auf D.",
            "Not that Im aware of",
            "What is prohibited is not advice, but providing acts that are reserved to/for lawyers. If you provide advice and ask for money, and call yourself a lawyer, then that's illegal.",
            "This is how it should be. I hope AI lawyers will change everything soon. Many cases are the same and could easily answered by AI for free.",
            "I think it depends on the state and type of case"
        ]
    },
    "Cannabis Einfuhr 1.4?": {
        "title": "Cannabis Einfuhr 1.4?",
        "score": 0,
        "url": "https://www.reddit.com/r/LegaladviceGerman/comments/1bmeudp/cannabis_einfuhr_14/",
        "content": "Hallo liebe Schwarmintelligenz,\n\nIch befinde mich zur Zeit in Thailand, Brokkoli ist hier legal und wenn ich wieder in Deutschland Einreise auch Vorort.\n\nWäre es mir also gestattet Cannabis für den Eigenkonsum als „Souvenir“ mitzunehmen? \n\nHab schon bissl gegoogelt aber so recht was gefunden hab ich natürlich nicht \n\nSchätze mal das ganze ist noch zu frisch\n\n\nUnd da ich keine Lust hab den Präzedenzfall zu spielen, dachte ich frag ich euch mal um Rat \n\nEdit: alles klar Leute, hab ich wohl falsch geträumt \nDanke für die schnellen Antworten ",
        "num_comments": 20,
        "comments": [
            "Besttige nochmal die Aussagen der Anderen : Einfuhr ist ganz klar weiterhin illegal",
            "Post locked und sticky gemacht. Weitere Posts zum Import werden gelscht\n\nEdit: Import ist dabei die Einfuhr von Cannabis in den Geltungsbereich des Gesetzes also die Bundesrepublik Deutschland aus jedem anderen Land (auch EU Staaten)",
            "weil? wre ja quasi die einzige Mglichkeit direkt voll legal an etwas zu kommen",
            "Nicht hilfreich/hat keine rechtliche Grundlage",
            "Kommentar ist rechtlich fragwrdig/hat keine rechtliche Grundlage",
            "In Thailand ist Gras legal. Wenn dann kommt er bei der Einreise in den deutschen Knast.",
            "Nicht hilfreich/hat keine rechtliche Grundlage",
            "Weil die Einfuhr/Ausfuhr von Cannabis und cannabis Setzlingen immer noch illegal ist. \nNur die Einfuhr von Samen ist legal.",
            "Weil das so im CanG steht?",
            "Thailand kein EU-Staat ist und damit importierst du illegal.\n\nDu darfst legal Samen oder Stecklinge aus EU-Mitgliedsstaaten importieren."
        ]
    },
    "Minderjähriger fährt geliehenes Auto zu Schrott": {
        "title": "Minderjähriger fährt geliehenes Auto zu Schrott",
        "score": 127,
        "url": "https://www.reddit.com/r/LegaladviceGerman/comments/1dr5xyk/minderjähriger_fährt_geliehenes_auto_zu_schrott/",
        "content": "Mir ist gestern eine so unfassbare Geschichte untergekommen zu deren Konstellation ich gerne wissen folgendes wissen möchte: wer zahlt?\n\nFolgende Situation:\nEine Bekannte verleiht ihren Zweitwagen, den sie noch per Kredit abbezahlt an ihren Bruder, da sie gerade krank ist und das Auto nicht benötigt. Versicherung schließt das mit ein. \n\nWährend das Auto bei dem Bruder ist schnappt der 12 jährige Sohn des Bruders das Auto für eine nächtliche Spritztour und fährt das Auto sowie drei andere Wagen am Straßenrand zu Vollschrott. \n\nDer Bruder der Betroffenen zuckt mit den Achseln und sagt nur ist ja nicht sein Auto und der Junge ist ja noch minderjährig. \n\nJetzt sitzt sie auf dem Totalschaden und den restlichen Schulden und die Halter der drei anderen Fahrzeuge ebenfalls. \n\nSie sagt sie bekommt nichts von niemandem. Kann das wirklich sein?",
        "num_comments": 77,
        "comments": [
            ">Jetzt sitzt sie auf dem Totalschaden und den restlichen Schulden und die Halter der drei anderen Fahrzeuge ebenfalls.\n\nAlso die drei anderen Kfz-Besitzer mssen von der Kfz-Haftpflichtversicherung der Halterin entschdigt werden. Das Fahrzeug, nicht der Fahrer, ist haftpflichtversichert.",
            "832, 828 BGB is the Key",
            "Wobei hinsichtlich vertraglicher Ansprche jedenfalls noch Details zu klren wren, um zwischen reiner Geflligkeit und Leihe abzugrenzen. Allein auf Grundlage der Schilderungen von OP scheint mir jedenfalls ein Schadensersatzanspruch hier nicht fllig abwegig, kann aber natrlich am fehlenden Verschulden des Bruders scheitern.",
            "Wie verhlt sich das denn mit der Aufsichtspflicht des Bruders gegenber dem 12 jhrigen Sohn? Kann von Verletzung ausgegangen werden? \n\nIch bin weder Hobbyjurist noch Laie, ich stelle nur eine Frage als 100% Fachfremder",
            "Knnen Obliegenheitsverletzungen nicht nur gegen Versicherungsnehmer direkt geltend gemacht werden? Meiner Meinung nach fllt da eine theoretische Obliegenheitsverletzung eines Dritten nicht ins Gewicht.",
            "Also den Schaden an den anderen Autos muss die KFZ haftpflichtversicherung tatschlich zahlen. Wird es sich aber vom Vater des 12 jhrigen also des Bruders der Halterin zurckholen. Vollkasko wird die Versicherung allerdings nicht leisten.",
            "Plus ggf. Verletzung der Aufsichtspflicht",
            "Du hast beim letzten Satz das /s vergessen.",
            "Erklr mal, wieso anhand der gegebenen Infos die Sorgfaltspflicht des Bruders fr seinen 12-jhrigen Sohn massiv verletzt sein soll. Haben deine Eltern ihre Autoschlssel immer in einem Safe aufbewahrt oder was?",
            "Hier liegt meiner Meinung nach keine Verletzung der Sorgfaltspflicht vor. Ab 11 darf er alleine in der Wohnung sein ohne Verletzung dieser. Und da kommt er immer an den Schlssel ran. \nWoher hast du denn diese Informationen?"
        ]
    },
    "Erst betriebsbedingt, dann fristlos gekündigt.": {
        "title": "Erst betriebsbedingt, dann fristlos gekündigt.",
        "score": 37,
        "url": "https://www.reddit.com/r/LegaladviceGerman/comments/1dr53g1/erst_betriebsbedingt_dann_fristlos_gekündigt/",
        "content": "Hallo Reddit, \n\nich bin in den letzten zwei Tagen zweimal aus meinem Job gekündigt worden und dezent am verzweifeln. \n\nAm 27.06.24 wurde ich zu einem Personalgespräch beordert. Den Grund wollte mein Chef mir im Vorfeld nicht verraten, hat mir aber erlaubt, eine Begleitperson mitzunehmen. Während des Gespräches offenbahrte mein Chef mir, dass die wirtschaftliche Lage des Unternehmens es nicht zulassen würde, dass ich weiterhin in meiner Position beschäftigt bliebe und gab mir zwei Optionen: Meine Stunden und Gehalt würden auf unbestimmte Zeit halbiert oder er müsse mich kündigen. Ich werde nicht ins Detail gehen, aber die Art und Weise, mit der er begründete, weshalb konkret ich ausgewählt wurde, fand ich so schäbig und herablassend, dass ich die Kündigung bevorzugte. Daraufhin händigte er mir eine \"betriebsbedingte Kündigung nach ordnungsgemäßer Sozialauswahl\", gültig zum 31.08.24, aus. Verrechnet mit meinem Jahres-Resturlaub wäre mein letzter Arbeitstag eigentlich der 03.08.24 gewesen, nachdem er mir die Kündigung überreicht hatte, sagte mein Chef jedoch, ich sei ab jetzt freigestellt. Da ich seit über 5 Jahren sehr gerne in dem Job gearbeitet habe, war ich entsprechend emotional angegriffen und habe das halbe Gespräch nur geheult. Bevor er ging räumte mein Chef mir noch eine Bedenkzeit ein, ich solle \"eine Nacht darüber schlafen\", ob ich nicht doch in Teilzeit wechseln wolle. Außer ihm und mir waren noch zwei weitere Angestellte bei dem Gespräch anwesend, die den Hergang bezeugen können. Trotz Bedenkzeit stellte ich noch am selben Abend fest, dass ich nicht mehr auf meine Arbeitsaccounts zugreifen konnte und aus allen Arbeits-Chats entfernt wurde. Deswegen habe ich mich am darauffolgenden Morgen (28.06.24) direkt bei der Agentur für Arbeit arbeitslos gemeldet.\n\n  \nGestern Abend (ebenfalls 28.07.24) fand ich dann in meinem Briefkasten ein Schreiben von meiner Arbeit, dass ich fristlos gekündigt sei. Der gesamte Text der Kündigung lautet buchstäblich \"Sehr geehrte Frau XYZ, wir kündigen Sie fristlos mit sofortiger Wirkung aus wichtigem Grund.\", plus als Kommentar oben \"per Einwurf mit Videobeweis\". Datiert war das ganze auf den 28.06.24. Das Schreiben war in einem unfrankierten Umschlag, auf dem handschriftlich Datum und Uhrzeit vermerkt waren, zu denen der Brief eingeworfen wurde. Außerdem war handschriftlich vermerkt, dass der Brief vom Sohn eines der beiden Geschäftsführer (glaube ich) eingeworfen wurde, mit der Unterschrift des Geschäftsführers als Zeuge.\n\n  \nIch habe keine große Ahnung von Arbeitsrecht, aber das kann so doch niemals rechtlich wirksam sein?!  \nWenn mir jemand eine Beratungsstelle, Anwaltskanzlei, etc. empfehlen kann, wäre ich unendlich dankbar, ich weiß gerade echt nicht, wie und wo ich anfangen soll. ",
        "num_comments": 57,
        "comments": [
            "Was war denn der \"wichtige Grund\"? Etwa die Tatsache, dass du dich schon als Arbeitslos gemeldet hast?\n\nIch glaube du kannst dich sogar vom Arbeitsamt beraten lassen was so eine Kndigung angeht.",
            "Ich hab den Eindruck das du was auslsst. \nDie Geschichte ergibt keinen Sinn.",
            "Geh zum Anwalt. Fr beide Kndigungs-Flle gibt es formale Voraussetzungen, welche nicht eingehalten wurden. Du kannst die Prozesszeit mit ALG berbrcken und richtig gut kassieren.",
            "Ih fein, sei dankbar fr die Dummheit deiner Arbeitgeber und such dir einen Anwalt. Der wird sich freuen",
            "Stt sich niemand daran, dass wenn auf eine betriebsbedingte Kndigung, direkt eine fristlose aus wichtigem Grund folgt, das die Arbeitsgerichte vermutlich hchst interessant finden werden? Oder liege ich da komplett daneben?",
            "Ab zum Anwalt. Nach so Fllen leckt sich jeder Arbeitsrechtler die Finger.",
            "Ich habe es noch nie erlebt, dass ein Arbeitgeber vor Gericht gewonnen htte.\nAlso du bist am lngeren Hebel",
            "Ich habe keine Ahnung. In dem Schreiben steht nur \"aus wichtigem Grund\". Ich habe sonst auch keine weiteren Nachrichten, Anrufe oder sonst irgendwelche Bescheide von der Arbeit bekommen. \n\nDas werde ich auf jeden Fall bei meinem Termin kommende Woche tun, danke.",
            "Ich hatte am Tag des Gesprchs schon darum gebeten, mir eine schriftliche Besttigung der Freistellung aufzusetzen, da muss ich auch nochmal nachhaken. Mir wurde am Tag des Personalgesprches der Zugang zu vielen Arbeitskanlen entzogen und ich wurde aus dem Schichtplan entfernt (der Tag des Personalgesprches wurde sogar aus meinen Arbeitseinstzen gelscht, ich htte mich wahrscheinlich danach nichtmal mer einstempeln knnen).\n\nDie Jobs meiner Kollegen sind noch eine ganze Ecke sicherer als meiner, wenn er die auch rauswirft, kann er buchstblich dicht machen, weil es niemanden gibt, der dasselbe Know How  in der Firma hat. Deswegen mache ich mir um deren Rckhalt erstmal keine Sorgen, aber das mit der Krankschreibung leuchtet dennoch ein. Werde ich in Betracht ziehen, danke.",
            "Das macht keinen Sinn. Abgesehen davon, dass Krankmeldung nur bei echter Erkrankung rechtmig ist, ist OP fristlos gekndigt. Dann muss man sich auch nicht mehr krankmelden."
        ]
    },
    "Mieterin dreht langsam durch. Wie würdet ihr weiter vorgehen ?": {
        "title": "Mieterin dreht langsam durch. Wie würdet ihr weiter vorgehen ?",
        "score": 8,
        "url": "https://www.reddit.com/r/LegaladviceGerman/comments/1dr95fk/mieterin_dreht_langsam_durch_wie_würdet_ihr/",
        "content": "Hallo,\n\nhabe vor ca. 15 Jahren eine Mietwohnung gekauft. Seit ca. 9 Jahren habe ich dieselbe Mieterin und diese dreht irgendwie langsam durch.\n\nHat inzwischen schon 7 Abmahnungen bekommen, andere Mieter ziehen wegen dieser Person aus den Wohnungen aus und es wird wie ich finde immer schlimmer.\n\nEin paar Beispiele: \n\n- Mieterin gibt an, dass beide Dachfenster undicht sind. Auf Nachfrage bei der Hausverwaltung sind in den umliegenden Häusern der gleichen Hausgemeinschaft keine Fenster undicht (Haus ist Baujahr 2005). Habe jetzt schon 3 verschiedene Handwerker vorbeigeschickt, die Termine wurden mit der Mieterin und den Handwerkern abgestimmt, aber die Mieterin ist dann immer nicht da. Ich gehe zu 100 % davon aus, dass der Schaden nicht existiert.\n\n  \n-Die Mieterin hat bis vor ca. 3 Jahren ohne mein Wissen über 30 Haustiere in der 45-qm-Wohnung gehalten. Hauptsächlich Ratten, 4-5 Katzen und einen Hund. Wollte die Mieterin aufgrund der extremen Haustierhaltung kündigen, aber die Mieterin hat angeblich kurz nach den Abmahnungen den Haustierbestand erheblich reduziert und ich hatte dann vor Gericht keinen Erfolg.\n\n- Heute hat mich ein anderer meiner Mieter angerufen, dass die besagte Mieterin angeblich drei fremde Autos auf den Stellplätzen zerkratzt hat und Sie ein anderer Mieter dabei gefilmt haben soll. Mein Mieter hat mir auch bestätigt, dass meine Mieterin auf dem Film zu erkennen sein soll. Habe mit dem \"Filmer\" heute einen Termin vereinbart und möchte mir das Videomaterial selber einmal ansehen.\n\nNun zu meiner eigentlichen Frage. Kann ich, falls die Mieterin auf dem Video eindeutig zu erkennen ist, eine Kündigung (eventuell fristlos) aussprechen ? Dachte hierbei an Störung des Hausfriedens oder habe ich noch andere Möglichkeiten ?\n\n  \nVielen Dank vorab für die Hilfe.",
        "num_comments": 30,
        "comments": [
            "Du bist lange genug Vermieter um zu wissen dass es nur eine Antwort gibt: Fachanwalt fr Mietrecht.",
            "Ich glaube da gibt es mehr als einen Grund zur auerordentlichen Kndigung, aber wenn das schon vor Gericht war und abgelehnt wurde das ist auf jeden Fall ein Paradebeispiel dafr, wie schwer es ist, einen Mieter rauszukuendigen, solange er brav weiter Miete zahlt.",
            "Zu dem Zerkratzen der Autos:\nDie Baustelle wrde ich mir nicht ans Bein binden. \nDas sollen die Geschdigten direkt ausmachen.",
            "Hat sie denn wenigstens brav weiter Miete gezahlt?",
            "Mich interessiert der Fall aber sehr, da ich Immobilienwirtschaft studiere und auch Eigentmerin bin. Halte mich auf dem Laufenden! Besonders nach der Einsicht des Videomaterials",
            "Ist die Tierhaltung im Mietvertrag erlaubt?\n\nFr mich liest sich das so das man zumindest Aufgrund der bisherigen Ereignisse eine fristgerechte Kndigung aussprechen kann weil das Vertrauensverhltnis zerstrt ist was als Grundlage fr ein Mietverhltnis gegeben sein sollte.",
            "Schon mal Selbstjustiz in Erwgung gezogen? (Vermummt natrlich)",
            "Da hast du natrlich Recht, ich war wegen dieser Person nicht nur einmal bei einem Fachanwalt und mchte mir deshalb noch gerne andere Meinungen einholen.",
            "Ich konnte es auch nicht glauben, dass es ich wegen der Haustierhaltung keinen Erfolg gehabt habe. Die Mieterin hat angegeben, dass die Haustiere schon vor langer Zeit auf 5-6 reduziert wurden, aber ich kann es einfach nicht beweisen, dass es nicht so war, da mir schon lange kein Zutritt mehr zur Wohnung gewhrt wird.",
            "Ja, das geht mich auch nichts an. Aber ich wrde trotzdem gerne die konkreten Namen in meinem Kndigungsschreiben haben wollen, da es so wahrscheinlich besser ist. \n\nBin mir aber nicht sicher, wrde mir die Namen einfach geben lassen, was der Fachanwalt fr Mietrecht dann diesbezglich macht berlasse ich ihm."
        ]
    }
}