{
    "$1000 Tournament - Aegis Esports x Hot Pockets": {
        "title": "$1000 Tournament - Aegis Esports x Hot Pockets",
        "score": 52,
        "url": "https://www.reddit.com/r/LegendsOfRuneterra/comments/1dm3kmo/1000_tournament_aegis_esports_x_hot_pockets/",
        "content": "Aegis Esports is back!\n\n\n\nWith support from Riot Games and Hot Pockets we are running a $1,000 Legends of Runeterra tournament! Time to summon The Rekindler and revive PVP! \n\nSign up here: [https://pocketsleague.challonge.com/AegisxHotPockets\\_1000\\_Tournament](https://pocketsleague.challonge.com/AegisxHotPockets_1000_Tournament) \n\nRules: [https://docs.google.com/document/d/1PQJYKsT9RHb8cigm7TX20E1CL0vhUNd0VXHH0PZ3W-o/edit?usp=sharing](https://docs.google.com/document/d/1PQJYKsT9RHb8cigm7TX20E1CL0vhUNd0VXHH0PZ3W-o/edit?usp=sharing) \n\nTwitch: [https://www.twitch.tv/aegisesportsgg2](https://www.twitch.tv/aegisesportsgg2)\n\n\n\nU.S. only... for now",
        "num_comments": 6,
        "comments": [
            "Elder dragon should be banned from the format",
            "Amazing!  It really is up to the players to keep competitive LOR alive.  \n\nAs long as there are players, there's a way.",
            "This game is so well made and it's such a shame to see it die. The devs clearly didn't know how to market the game and now it's bound to ruin, but yes, onlythe players can do something about that!",
            "Can't wait to watch this. I know it sucks for competitive players more than anyone, but I mostly just like watching competitive play. idk why.",
            "Imagine the prize would be crystals for 6 or 7 stars champions",
            "Because it's exciting and expressive, of course!"
        ]
    },
    "Update on PvP Rotation timing": {
        "title": "Update on PvP Rotation timing",
        "score": 96,
        "url": "https://www.reddit.com/r/LegendsOfRuneterra/comments/1don4zl/update_on_pvp_rotation_timing/",
        "content": "Hey everyone!  \n  \nI wanted to provide you an update on our work on Standard Rotation for PvP.  Previously ([https://playruneterra.com/en-us/news/game-updates/whats-next-for-ranked-in-legends-of-runeterra/](https://playruneterra.com/en-us/news/game-updates/whats-next-for-ranked-in-legends-of-runeterra/)), we had announced that our next rotation would happen on August 1st later this year, and that we'd have a three month period for ongoing rotations.  \n  \nDue to development changes, we plan to shift these rotations to occur with patch releases (much like they have in the past), and I wanted to provide some additional transparency over what the next few patches look like. Instead of August 1st, the Standard Rotation will occur on July 17th, the release date of our 5.7 Patch. You'll also see these updates consolidated in our next set of patch notes. The reason for these adjustments to our plan is that, having settled into our team's rhythm since January, we believe the team can handle having our releases for all content, both PvP and PvE, on a coordinated and consistent timeline.  \n  \nBeyond that, we'll have roughly two months of the Ranked Standard queue up, followed by one month of the Ranked Eternal queue up.  Our next Standard Rotation would then come with patch 5.11, which would happen some time in November, and that pattern will continue moving forward. We'll be actively seeking feedback about how this approach feels, so please let us know your thoughts as these changes happen over the coming months!  \n",
        "num_comments": 34,
        "comments": [
            "Well, that's...interesting. Are we going to get previews of upcoming rotations, or should we simply wait for day of?",
            "Is the idea for Ranked Standard to be closed when Ranked Eternal is open? Currently we have both queues open but by your wording it sounds like that will change?",
            "Thanks for the update. So far this approach is fine to me, but please be careful about allowing overpowered champions into Standard. Elder Dragon in particular was about the worst possible choice as he is so splashable and brings with him so much free value. As I'm sure you're aware he essentially ruined last Standard season, causing many many players to quit. If this dynamic occurs again, an emergency patch that simply removes that champion from the rotation early would be greatly appreciated rather than leaving Standard to be near unplayable for an entire rotation.",
            "How often should we expecting balance changes? Can you not do what you were doing previously where the second patch of a cycle is focused on balancing?\n\nAlso love the most recent balance patch, just wish it was one patch sooner.",
            "To get the Top 100 title by the end of the season, do we need to finish top 100, or merely reach it? The announcement from a while back was not clear on this.\n\nAlso just to clarify: This season will run until July 17th, then a new season will start and last roughly 2 months, followed by 1 month of eternal?",
            "Interesting choice having rotation in the same time as new swarm mode gets added to league, I wanted to play rotation, but I also want to play swarm even more.... Oh well, looks like it's gonna be riot games on pc all day long",
            "So Elder Dragon is getting rotated early, I see this as a win",
            "Could anyone clarify on rewards for ladder? My understanding was the new Masters and Top 100 titles are happening but is that from July rotation or is this also for Dreamlit Paths season? If not, are there any rewards this time around?",
            "when will we see gauntlets and a seasonal tournament?",
            "Gotta hit eternal ranked then. Time's ticking."
        ]
    },
    "Why is Packed Powder Morgana a thing?": {
        "title": "Why is Packed Powder Morgana a thing?",
        "score": 23,
        "url": "https://www.reddit.com/r/LegendsOfRuneterra/comments/1dr8q0c/why_is_packed_powder_morgana_a_thing/",
        "content": "I thought people played PP Morg bc her 2* triggered plunder but it doesn't so why is this played? Is it only for the stats increase bc Morg is important to stay in play (GGC + lifesteal)? Then CSF (eat allies) could just give more stats per turn than PP ..\nPlease enlighten me :)",
        "num_comments": 34,
        "comments": [
            "You don't have enough units to justify csf and you can trigger the plunder with an open attack, the extra stats also makes it easier to actually attack with morgana",
            "Some players are just THAT desperate on dropping champions early and with Packed you can relatively easily drop her round 2.",
            "Just one shot Swain adventure with Packed Powder + Wicked Harvest +GGC tech.\n\nOther than Swain which got dicey because I drew no early game. It was v easy to stabilise and then just suicide Morg when I need to drop another one for a big AOE + heal. Would recommend trying it for this adventure.",
            "Unless you draft something decent, Morgana won't really have any particularly useful targets to consume with CSF. Packed Powder and GGC allows you to lose your Morgana on a later turn and replace her with one just as big.  \nJust beat Swain with that (+ Wicked Harvest) - he was locked out of the game from turn 3 or so.",
            "I would not recommend it at all, not sure why you think 'its a thing'",
            "I used packed powder to defeat lissandra using morgana. It just falls into getting lucky with card/power synergy that benefits her dropping early in your board",
            "More stats, more lifesteal. Morg can proc the nexus damage every turn easy. CSF isn't too bad of an idea but Morgana doesn't often have a wide board, and her minions have low stats. The stat buff from Packed Powder is also permanent, so it's pretty nice to have in harder adventures when Morg can die or get recalled.",
            "More than mana reduction (since star power procs at the end of the round), it's the scaling that makes it good since you get a growing lifesteal unit.  \nPersonally I think that using Packed Powder + Swain relic on a 5\\* Star Morgana to play her on turn 1 is well worth it (adding GGC to the mix), but it's because I don't enjoy other particular builds on her.",
            "Morgana games can last a lot of turns. So you are basically turning her into a big Nasus with lifesteal and a good set of powers.\n\nMy Liss clear with Morgana was using Packed Powder, Echoing and Chemtech. The -2 cost was irrelevant on her, but I could simply ignore the entombs and replay her with bigger stats and eventually I could simply stat check everything and heal back to full before ending the game.",
            "most likely unlocking 5 star and pair up with swain relic to drop her turn 1, personally I thInk the only benifit this build has is if you have all 6 stars plus ggc for a faster kill.\n\nif your running ggc morgna doesn't really run out of units to begin with all the invoke units in your hands  so i fail to see benifit other than you want to speedrun"
        ]
    },
    "Garen's adventure is amazing": {
        "title": "Garen's adventure is amazing",
        "score": 106,
        "url": "https://www.reddit.com/r/LegendsOfRuneterra/comments/1dqw8yk/garens_adventure_is_amazing/",
        "content": "Garen's second chapter where he beats down every female Demacian character (including his younger sister) so he can find a new crazy girl to \"flirt-fight\" with is the hardest I've laughed in ages. \n\nThank you, Riot",
        "num_comments": 10,
        "comments": [
            "I really need a third chapter where he goes to try and climb mount targon for the sole purpose of finding a new girls and ends up fighting Leona and Diana, at least",
            "Please tell me the lor adventures are cannon",
            "Aurelion sol is a girl with a really deep voice confirmed.",
            "But he will  find his old friend Taric instead xd",
            "Theyre lesbians, Harold\n\nIt would be so funny if he hit on one of them and got instantly shut down",
            "hardest i've laughed playing this game",
            "He hits on Leona.\n\nVery next fight is Diana, who's fuming mad.",
            "But he can be shut down... with a fight!... and then find Taric, as said above hahahahha!",
            "And after such wanted reunite with his best friend Taric lern that he dont need woman to be proud man with ignite warrior heart.",
            "Daren Hatguard."
        ]
    },
    "Gloom darkness doesn't count for Veigar lvl up": {
        "title": "Gloom darkness doesn't count for Veigar lvl up",
        "score": 40,
        "url": "https://www.reddit.com/gallery/1dr1fey",
        "content": "Was playing Thresh's adventure with Veigar and got his special node and got the gloom item for my darkness. It doesn't seem to count for Veigar's lvl up. It should, as i know gloom counts as damage dealt by Vex(as it triggers her on-slay effects).\n\nI stomped anyways, but this was a sad adventure for Veigar's mecha (pun intended)",
        "num_comments": 6,
        "comments": [
            "gloom is a status effect per se, it just sets the units health to negative which weirdly enough is not counted as damage. you should always avoid gloom on units that rely on dealing damage like swain (which i also learned the hard way). i think this is not a bug but intended.",
            "Also it can't drain because it doesn't do damage. \n\nGot vile feast and the drain 2 from 2 enemies with the gloom item.  Got no HP back to my Nexus when I really needed it",
            "That's so sad.\n\nWell, lesson learned for Veigar at least :(",
            ">It should, as i know gloom counts as damage dealt by Vex(as it triggers her on-slay effects).\n\nGloom can slay, but it doesn't do damage.\n\nThis isn't a bug, just unfortunate.",
            "Because you're changing the stats of said unit. By 'dealing Gloom', you are giving that amount of keyword to the target. That's it, you deal 5 gloom = you give the keyword gloom 5 times.\n\nGloom however, reduces both the unit's max power and max health, and this calculation happens *after* the application of gloom, hence why it didn't count as damage.\n\nIt's the same way how Soraka and her landmark doesn't count health increase like +1, only actual healing, because those modifies the base stat, not change the current active stat. The end result might show the same number, but the game considers it two different changes.",
            "Been there getting veigar as supported champion when using Vex. It's unfortunate that Veigar will always be short for his level up."
        ]
    }
}