{
    "We are 1.5 Million Lego Fans!": {
        "title": "We are 1.5 Million Lego Fans!",
        "score": 243,
        "url": "https://www.reddit.com/r/lego/comments/1cngxl0/we_are_15_million_lego_fans/",
        "content": "Today we welcome the 1,500,000th subscriber to the /r/lego community. This subreddit was established sixteen years ago on Mar 23, 2008. We certainly have grown a lot since then! \n\nWith 1.5 million subscribers, r/lego is in the top 1% of all subreddits by size. On reddit, we are the #1 largest community in the Toys category, and the 8th largest hobby subreddit. Worldwide, r/lego ranks among the largest gatherings of Lego fans on the internet. If our community was a city, it would rank in population somewhere between the US cities of San Antonio and Philadelphia, and almost as large as Munich in Germany.  \n\nEverything we have here is thanks to each of you. Whether you share content, comment on posts, participate in contests, or even just upvote your favorites, you are helping make this community a great place for Lego fans. Thanks to you all, and we look forward to continuing to build a future together.\n\nIf you're new here, welcome to /r/lego! You are invited to subscribe and join the community.",
        "num_comments": 14,
        "comments": [
            "1,500,000 studs here. Nice",
            "This is so awesome, love this community. Caught us a few months ago,\n\nhttps://preview.redd.it/kmjq3ja90czc1.jpeg?width=1170&format=pjpg&auto=webp&s=f75fb808596934174f95f5fd4761153816e9d7c7\n\nwhen we were at 1,234,567 fans 🩵",
            "luke oakley LOVE this community ☺️☺️",
            "1.5 Million Studs indeed 😃",
            "That’s a lot of Studs right there 😏",
            "OK Ya'll, been 9 days, time to change the banner :)",
            "LE(TS)GO!",
            "Every fun is like one small lego part. Together we become a nice LEGO kit !",
            "Only 8th in hobbies? Now I collect adult material and Lego but I don’t think downloading pictures and videos is a hobby. ",
            "Takes one to know one, you round stud you."
        ]
    },
    "Frustrated Studio Execs Unsure How To Convince Public That Lego Pharrell Williams Movie Actually Happening": {
        "title": "Frustrated Studio Execs Unsure How To Convince Public That Lego Pharrell Williams Movie Actually Happening",
        "score": 242,
        "url": "https://www.theonion.com/frustrated-studio-execs-unsure-how-to-convince-public-t-1851544686",
        "content": "",
        "num_comments": 35,
        "comments": [
            "I think people are skeptical because on a conceptual level, a Pharell Williams film and the Lego brand have essentially nothing in common.",
            "Have you noticed the onion?",
            "Lmao entire sub ate the onion it seems 😂",
            "This post is a great example of why people should read the articles instead of taking the headlines at face value.",
            "Everybody in here eating the onion",
            "Out of all the Lego movies that could’ve been put into production, this has to be one of the dumbest. No idea how this got the green light",
            "I know it’s weird, but it’s also kind of genius. It’s not another musician biopic, but it’s also not a Lego family-friendly kids film. It will be interesting to watch it play out - I know there’s also some controversy from the N.E.R.D. people who are being left out, so we’ll see how this works out",
            "I want to know if we are getting any sets based on the movie. \n\nPerfect time for a legit Snoop Dogg minifigure.",
            "This headline is the funniest thing I have read in a long time.",
            "The musician and producer known for modern takes and unique ideas is doing a modern take and unique idea? I'm shocked."
        ]
    },
    "What do you guys think about Barad Purr ?": {
        "title": "What do you guys think about Barad Purr ?",
        "score": 148,
        "url": "https://i.redd.it/7h2k4qwux38d1.jpeg",
        "content": "Seen on Instagram (jayong28). I thought it was very funny.",
        "num_comments": 12,
        "comments": [
            "Knocks itself over just to get attention",
            "One meow to rule them all,\nOne meow to find them\nOne meow to bring them all\nAnd in the catnip, bind them",
            " I want to see the other guy, as in the cat body with the eye of sauron as a head",
            "Needs flaming eyes",
            "The ring can only be destroyed be the one with the power of purrrrr",
            "Looks super evil",
            "Herecy",
            "Love mine!!",
            "Too dark will collect dust meh",
            "https://preview.redd.it/0orpv0c6948d1.jpeg?width=1287&format=pjpg&auto=webp&s=fac0dd2840989aa079186f591f4b91219dc75b8f\n\nHere you go !"
        ]
    },
    "I think it's time to admit I have a Millennium Falcon problem": {
        "title": "I think it's time to admit I have a Millennium Falcon problem",
        "score": 1725,
        "url": "https://i.redd.it/5lyrwm6hsz7d1.jpeg",
        "content": "",
        "num_comments": 129,
        "comments": [
            "Oh no!\n\n...but you're getting the black one when it releases, right?",
            "There’s no such thing as a problem",
            "Don't ever talk to me or my son or his son or his son or his son ever again",
            "I think you’re missing the one from 6176782: Escape the Space Slug, which is even smaller than the bottom one.",
            "You’re still missing a few, get on that!",
            "MOAR!\n\n&#x200B;\n\nhttps://preview.redd.it/hdhenhcld08d1.png?width=4032&format=png&auto=webp&s=8d07144de9ebd80fc5e48201b49b382b09b18e06",
            "I think the problem is that you’re missing a couple",
            "Top one is the best, Hans down",
            "There’s one no one’s mentioned yet that would fit in between two nicely, 4488!",
            "You forgot the tiniest one from the Nebulon-B set"
        ]
    },
    "TARDIS moc I made inspired by the London Telephone Box Ideas set": {
        "title": "TARDIS moc I made inspired by the London Telephone Box Ideas set",
        "score": 825,
        "url": "https://www.reddit.com/gallery/1dlj34b",
        "content": "",
        "num_comments": 30,
        "comments": [
            "Do you have instructions for this? Or a basic guide? I've been \\*dying\\* for a good TARDIS.",
            "Is it bigger on the inside..?",
            "My first thought when I initially saw the London Telephone Box was \"I'd get that if it was the TARDIS\".",
            "LOVE LOVE LOVE!!!! Well done!!",
            "Need a sign on that lamp post that says >!Ruby Road!<",
            "Absolutely incredible",
            "Is it bigger on the inside?",
            "This is absolutely fantastic! Any plans for instructions? I'd love to build this.",
            "This should have been the set.",
            "I challenge you to make the entire interior >:)"
        ]
    }
}