{
    "This set is really good and I really like it, but Lego is just asking for it": {
        "title": "This set is really good and I really like it, but Lego is just asking for it",
        "score": 1016,
        "url": "https://i.redd.it/3kbhj9pbdg9d1.png",
        "content": "",
        "num_comments": 43,
        "comments": [
            "I suppose they could class the instruction book up a bit with a heartfelt memorial or something. If they treat it seriously (and they would) I think it could work. Having it be the version that existed in 1979 softens it a bit too.",
            "I can’t fathom a more boring build than this",
            "I was around for 9/11 and would buy it. I’ve made a custom set myself years ago to go with the other architecture sets but I built it in all black as a memorial. I would love an official set.",
            "Nooooo don't insult my boring-ass corporate architecture nooooo",
            "I agree, but The Eifel tower? I mean why waste 10001 parts on the same pattern and some grass?",
            "Care to share an image of the build? ",
            "Yeah I really like the design, although it looks a bit repetitive, like the Eifel tower set",
            "Their implication is people will make 9/11 jokes/MOCs. They're also probably not wrong.",
            "Yeah but it is a beautiful set",
            "I didn't know what this was, but I can guess from context"
        ]
    },
    "Trogdor the Burninator": {
        "title": "Trogdor the Burninator",
        "score": 2454,
        "url": "https://www.reddit.com/gallery/1dqvokx",
        "content": "",
        "num_comments": 63,
        "comments": [
            "I said consummate Vs Consummate!",
            "dear strongbad: how do you type with boxing gloves on?",
            "That's a nice beefy arm coming out the back of his neck there",
            "Are you going to use your powers for good or for awesome?",
            "OP definitely knows majesty. \n\nThat is incredible.",
            "And then Trogdor comes in the niiiight!!!!",
            "Now I gotta see the rest of the Homestar Runner universe in LEGO form.",
            "Greatest moc ever. Contest is over.",
            "Not a want but a NEEEED",
            "Absolutely magnificent! I need this!"
        ]
    },
    "Crazy marketplace find just now": {
        "title": "Crazy marketplace find just now",
        "score": 229,
        "url": "https://i.redd.it/gd0160wtqh9d1.jpeg",
        "content": "",
        "num_comments": 30,
        "comments": [
            "Those are lego glued to a mannequin yeah?",
            "I feel like that thing has seen some shit. For sure whatever basement that came from does not have windows.",
            "Selling this on marketplace isn’t going to help you with your unresolved feelings for Amy Jo.",
            "It is both awesome and unsettling at the same time…",
            "The crotch has a clitoris?!?\n\n*asking the tough questions*",
            "As a Lego fan I hate this. Just gluing pieces onto a form isn't the same as a creative build that follows the rules.",
            "Yeah, maybe hit that with a black light before you touch it, OP.",
            "Now that is some fearsome body armor",
            "50/50 odds there’s a hole or two drilled in the bottom",
            "Looks glued onto a mannequin"
        ]
    },
    "Honey, I shrunk the LEGO sets! ": {
        "title": "Honey, I shrunk the LEGO sets! ",
        "score": 3071,
        "url": "https://www.reddit.com/gallery/1dqpciw",
        "content": "MOC - Scaled down versions of official LEGO sets, made at roughly nano-fig scale. Recently displayed at BrickWorld Chicago 2024.  ",
        "num_comments": 240,
        "comments": [
            "These are absolutely incredible! I’ve always loved seeing the micro scale builds but I’m loving these a lot more. You’ve captured so much detail, and I would totally buy these if they became LEGO sets.",
            "I love the fort the most but they are all fantastic.",
            "Mega Core is absolutely amazing!",
            "Aside from all the amazing everything, I love the little environments you've built around them.",
            "Wow! Great idea, great execution!",
            "Ngl, these look way better at this scale imo.",
            "Love these and would buy these!\n\nYou don't happen to be making a mini Barad-dûr, do you? Would love a baby version of that!",
            "I would buy them all in a heartbeat!",
            "These are wonderful; I love these!  My favorite is Fort Legorado -- that set was always one of my favorites as a kid.",
            "Loving that Mini-Core Magnetizer! ❤️"
        ]
    },
    "Found at meijer earlier. Got two.  ~90% off :)": {
        "title": "Found at meijer earlier. Got two.  ~90% off :)",
        "score": 495,
        "url": "https://i.redd.it/lxhda0g1ye9d1.jpeg",
        "content": "",
        "num_comments": 46,
        "comments": [
            "Wtf... must be easy growing an inventory (for mocs) with deals like that",
            "Crazy that they made an actual shelf label tag for it. And it looks like a regular tag so not even a clearance shelf label, just “yeah we sell this for 10 bucks”. Almost wonder if it’s a typo on the label but assume in 2024 stores just print them out from a system or the register would flag it as the actual price. So many wow’s here lol",
            "When is it my turn to find deals like this",
            "I’d be actually be able to build the alternate builds too :/",
            "I hope there were only 2 because I would have bought any stock they had.",
            "That’s the best deal I’ve ever seen on this sub, maybe this site",
            "I will never be this lucky. Good find!",
            "Got to be the best deal. Some better than free",
            "I love that set, got it on marketplace for my son for ~$45 and that was a great deal as far as I'm concerned:)",
            "I thought half the price would be the stealth"
        ]
    }
}