{
    "A guide to this sub's explanatory comment rule.": {
        "title": "A guide to this sub's explanatory comment rule.",
        "score": 4118,
        "url": "https://www.reddit.com/r/LeopardsAteMyFace/comments/lt8zlq/a_guide_to_this_subs_explanatory_comment_rule/",
        "content": "Recently, we noticed an increased amount of nonsensical explanatory comments with no relation in any way, shape or form to the theme of this subreddit.\n\nThe \"_leopards ate my face_\" theme is embodied by this quote in the sidebar.\n\n> \"_I never thought leopards would eat **my** face_\", sobs woman who voted for the _Leopards Eating People's Faces Party_. Revel in the schadenfreude anytime someone has a sad because they're suffering consequences from something they voted for, supported or wanted to impose on other people.\n\nThis statement made out of 3 parts.\n\n1. **Someone** voted for, supported or wanted to impose **something** on **other people**.\n2. **Something** has the consequences of **consequences**.\n3. As a consequence of **something**, **consequences** happened to **someone**.\n\nIn your explanatory comment, answer these 3 elements and include the minimum amount of information necessary so your post can be understood by everyone, even if they don't live in the US or speak English as their native language. If you fail to identify them, it will be difficult for a moderator to understand if this post fits and it will probably be removed. If you complain about it, we'll just send you back [here](https://www.reddit.com/r/LeopardsAteMyFace/comments/lt8zlq).\n\nThe explanatory comment is not the place to write a pretty poem nor is it the place to promote books. Copying this post, copying large parts of the article and nonsensical comments will get your post removed under rule #3. Keep it stupid simple.\n\nTo help you get started, here's an example.\n\n1. Helen, Roberto Beristain's wife, voted for Donald Trump, who vowed to impose deportation to illegal immigrants such as her husband.\n2. Voting for Trump, who vowed to deport illegal immigrants such as Roberto Beristain, has the consequence of having illegal immigrants deported and families separated.\n3. As a consequence of voting for Trump, Roberto Beristain got deported and Helen's family was separated.\n\nYou should absolutely make sure that it is easy to match your explanatory comment with the provided format or your post will be mercilessly removed. If, however, you can't match your explanatory comment with the format, then you should just delete your post and save us the effort.",
        "num_comments": 393,
        "comments": [
            "Thank you! Ive been noticing a lot of posts lately that are ironic but not really Leopards Ate My Face.",
            "I've also noticed that sometimes the OP never makes a comment explaining why the post belongs, but the post is never deleted even after several hours. Has that been fixed?",
            "Thank you! Inconsistency in one's political beliefs is not all that's required for a post to be \"Face-eating Leopard\" quality.",
            "I feel like a lot of the posts lately have been more like \"leader exposes their own hypocrisy\" which are somewhat related to the theme of LeopardsAteMyFace, but are not really the same thing. I think the consequence is often missing from these posts. I would not mind subscribing to a second subreddit for \"HypocriteLeaders\" or something like that, but so many of these posts don't really belong here.",
            "Is it me or was the situation better when people worked leopard ate my face in the title.\n\nIt seems that when they dont have the do the effort of working that in, it makes it easier for people to post stuff that dont fit.",
            "Can we please ban, or vote to ban, Facebook-tier memes that rarely even fit? They're so bad and they always make it to the front page of Reddit and attract more morons who in turn post more of them here. I feel like they're overrunning the sub and it's just going to get worse.",
            "I know this post is already 2 months old, but I only come here occasionally. What I've noticed is a lot of people just posting \"HAHA SOMETHING BAD HAPPENED TO PEOPLE I DON'T LIKE\" as if that's what this sub is about. Worse, I've seen submissions get downvoted despite the fact that they fit the sub quite well but the people who had their faces eaten happened to be liked by the users.",
            "mods woke up let's goooo",
            "The story about the Trump campaign having to refund people has been reposted here at least 10 times in the last 2 days in various guises, it's ridiculous. I get it, it fits on the sub but we don't need that many posts about it from people blatantly karma farming.",
            "Question: Does is this sub for the leftist party to criticize people on the right? No hate intended if it is, I just want to know incase i have something to post here."
        ]
    },
    "I was anti-feminist until...": {
        "title": "I was anti-feminist until...",
        "score": 5451,
        "url": "https://www.reddit.com/gallery/1dr0d4c",
        "content": "",
        "num_comments": 424,
        "comments": [
            "\"Good traditional men who see women as equals...\"\n\nOh, sweetie...",
            "I have to agree with so many others here, hun. What you want is NOT a traditional man, what you want is a man who is aware of your choice and is okay with it. Like perhaps, a progressive man. But I promise, *not* a conservative.",
            "Don't  call  it  traditional  marriage  if  it  doesn't  even  secure  alliances  between  rival  fiefdoms ",
            "\"It's not an issue until it affects me\". Classic conservative.",
            "Except she hasn't actually learned anything. She's just making a no true Scotsman argument",
            "So it was originally fine to see and treat all other women as disgusting trash as long as they saw *you* as \"one of the good ones.\" But when you start being treated like trash too, you're SHOCKED. \n\nEven though you were aware all along that these men don't see women as people or deserving of respect or equal/human rights. Interesting.",
            "I always like to ask the anti-feminists to tell me exactly what they believe the opposite of feminism or a feminist is.  Tell me what you believe, not what you oppose.  Say it out loud and listen to yourself.",
            "If she's dreaming of some traditional 50s husband, back when men respected women, if you stopped having sex with him they'd have you committed for frigidity, marital rape didn't exist, and if you were upset and crying during an argument, your husband is supposed to give you a firm smack across the face to calm you down. And you couldn't leave because no fault divorce didn't exist, so if your husband didn't agree you couldn't leave. At least you could kill yourself, suicide rates were much higher for women in these golden days of yesteryear that conservatives fantasize about.",
            "If a man has to go to a foreign country to find a wife then he's a POS that couldn't find a local woman.  That's a red flag that's gigantic.",
            "I know people are straight up insulting you, but I wanna commend you for admiting it and posting it. It took a lot of guts. Keep pushing forward. Keep reading about why feminists fight. It's not just for our rights, but for our children and their children. \n\nKeep fighting and keep moving forward. I hope you're safe. You got this"
        ]
    },
    "Rudy Giuliani Still Waiting To Be Paid By Trump, Documents Reveal ": {
        "title": "Rudy Giuliani Still Waiting To Be Paid By Trump, Documents Reveal ",
        "score": 933,
        "url": "https://www.newsweek.com/rudy-giuliani-donald-trump-2020-election-bankruptcy-new-york-1918988",
        "content": "",
        "num_comments": 61,
        "comments": [
            "I usually dont laugh at the misfortune of others but: \n\nBWHAWAWAWAWAHAHAHA good.",
            "Should have picked richer clients.",
            "The cheque is in the post, Rudy.",
            "Imagine waiting for Trump to send you money \n\nMy favorite thing about the fucker is how he screws over anyone who tries to earn his loyalty. His sycophants are like flies on shit and they always end up in ruin. I love that for them. ",
            "Aren't there cities still waiting to be paid for costs made during the 2016 Presidential Election, for extra costs made for the Trump Campaign?\n\nSo I don't think Giuliani will see anything from Trump anytime soon.",
            "I could tell this was a Newsweek article just from the This is News to No One! headline.",
            "Mate you have no purpose or exploitative ability left for Trump - what makes you think he even remembers your name",
            "Motherfucker couldn't read the writing on the wall if he was assisted by text to speech.",
            "It is hilarious to me how Trump held a fundraising dinner at maggot-a-lago for Rudi a while ago but doesn't pay the bills that Rudi sent him. So Trump doesn't mind that Rudi is paid as long as someone else comes up with the money.",
            "Dude nuked his career and his legacy for nothing."
        ]
    },
    "Alt-right women unhappy to discover that alt-right men are sexist towards all women, not just liberal women.": {
        "title": "Alt-right women unhappy to discover that alt-right men are sexist towards all women, not just liberal women.",
        "score": 15827,
        "url": "https://www.salon.com/2017/12/04/alt-right-women-are-upset-that-alt-right-men-are-treating-them-terribly/",
        "content": "",
        "num_comments": 464,
        "comments": [
            "2017 article. Southern retired, married and had a baby with an abusive, controlling man in Australia. She left with the kid and is now back in Canada.",
            "\"Southern said that women should be able to choose their own life path and not be attacked for it, which sounds like what women have been shouting for a few decades now.\" lol well said, Slate",
            "Man, as bad as things get I can at least comfort myself with the knowledge that I'll never be so detached from reality and so worthless and pathetic that I become a pickme for neo-nazis.",
            "Those women are really owning the libs, one sandwich at a time.",
            "Southern: What is also just completely shocking to me is the utter lack of understanding of nuance.\"\n\nThis is the messed up part right here. If the so-called alt-right  aka Nazis and other white supremacists  are known for anything its the nuance of their positions.",
            "7 year old article? Really?",
            "I love how it's important to them that the trolls are \"low status\"\n\nYou'd let them treat you like shit if they were prominent?",
            "They are men of their words. You have to give that to them.",
            "This tracks well. 54% of white women voted AGAINST their own best interests in electing trump. They don't care because they think they're not affected.",
            "Wait, you mean you didn't want to be treated like a sandwich factory / blowjob machine?"
        ]
    },
    "Brexit: The gift that keeps on giving.": {
        "title": "Brexit: The gift that keeps on giving.",
        "score": 77,
        "url": "https://i.redd.it/yu4d39k2bi9d1.jpeg",
        "content": "",
        "num_comments": 4,
        "comments": [
            "*English* breakfasts, too.  That's a lotta nonsense to be serving all by yourself ",
            "Tbf her food is prolly very mid",
            "Hello u/Maatsya! Please reply to this comment with an [explanation](https://www.reddit.com/r/LeopardsAteMyFace/comments/lt8zlq) matching this exact format. Replace bold text with the appropriate information.\n\n1. **Someone** voted for, supported or wanted to impose **something** on **other people**.\n  ^(Who's that someone? What did they voted for, supported or wanted to impose? On who?)\n2. **Something** has the consequences of **consequences**.\n  ^(Does that something actually has these consequences in general?)\n3. As a consequence of **something**, **consequences** happened to **someone**.\n  ^(Did that something really happen to that someone?)\n\nFollow this by the minimum amount of information necessary so your post can be understood by everyone, even if they don't live in the US or speak English as their native language. If you fail to match this format or fail to answer these questions, your post will be removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeopardsAteMyFace) if you have any questions or concerns.*"
        ]
    }
}