{
    "A guide to this sub's explanatory comment rule.": {
        "title": "A guide to this sub's explanatory comment rule.",
        "score": 4108,
        "url": "https://www.reddit.com/r/LeopardsAteMyFace/comments/lt8zlq/a_guide_to_this_subs_explanatory_comment_rule/",
        "content": "Recently, we noticed an increased amount of nonsensical explanatory comments with no relation in any way, shape or form to the theme of this subreddit.\n\nThe \"_leopards ate my face_\" theme is embodied by this quote in the sidebar.\n\n> \"_I never thought leopards would eat **my** face_\", sobs woman who voted for the _Leopards Eating People's Faces Party_. Revel in the schadenfreude anytime someone has a sad because they're suffering consequences from something they voted for, supported or wanted to impose on other people.\n\nThis statement made out of 3 parts.\n\n1. **Someone** voted for, supported or wanted to impose **something** on **other people**.\n2. **Something** has the consequences of **consequences**.\n3. As a consequence of **something**, **consequences** happened to **someone**.\n\nIn your explanatory comment, answer these 3 elements and include the minimum amount of information necessary so your post can be understood by everyone, even if they don't live in the US or speak English as their native language. If you fail to identify them, it will be difficult for a moderator to understand if this post fits and it will probably be removed. If you complain about it, we'll just send you back [here](https://www.reddit.com/r/LeopardsAteMyFace/comments/lt8zlq).\n\nThe explanatory comment is not the place to write a pretty poem nor is it the place to promote books. Copying this post, copying large parts of the article and nonsensical comments will get your post removed under rule #3. Keep it stupid simple.\n\nTo help you get started, here's an example.\n\n1. Helen, Roberto Beristain's wife, voted for Donald Trump, who vowed to impose deportation to illegal immigrants such as her husband.\n2. Voting for Trump, who vowed to deport illegal immigrants such as Roberto Beristain, has the consequence of having illegal immigrants deported and families separated.\n3. As a consequence of voting for Trump, Roberto Beristain got deported and Helen's family was separated.\n\nYou should absolutely make sure that it is easy to match your explanatory comment with the provided format or your post will be mercilessly removed. If, however, you can't match your explanatory comment with the format, then you should just delete your post and save us the effort.",
        "num_comments": 393,
        "comments": [
            "[Link to a thread containing a flowchart on what counts as LAMF](https://www.reddit.com/r/LeopardsAteMyFace/comments/tbv4sk/meta_i_made_a_flow_chart_since_people_still_seem/)",
            "Thank you! I’ve been noticing a lot of posts lately that are ironic but not really “Leopards Ate My Face”.",
            "I've also noticed that sometimes the OP never makes a comment explaining why the post belongs, but the post is never deleted even after several hours. Has that been fixed?",
            "Please don't give me hope like this. I'm so tired of LOL REPUBLICANS BAD.\n\n\nDon't get me wrong - I'm not even American. Your left wing party is to the right of my right wing party, and I'm on the left of *mine*. I don't say this out of some sort of tribal defence of the right.\n\n\nIt has just been depressing watching a sub with a specific niche being overrun with torrents of the same old political circlejerking you get everywhere else.\n\n\nProceeding with cautious optimism...",
            "Thank you! Inconsistency in one's political beliefs is not all that's required for a post to be \"Face-eating Leopard\" quality.",
            "I feel like a lot of the posts lately have been more like \"leader exposes their own hypocrisy\" which are somewhat related to the theme of LeopardsAteMyFace, but are not really the same thing. I think the consequence is often missing from these posts. I would not mind subscribing to a second subreddit for \"HypocriteLeaders\" or something like that, but so many of these posts don't really belong here.",
            "[deleted]",
            "Is it me or was the situation better when people worked “leopard ate my face” in the title.\n\nIt seems that when they don’t have the do the effort of working that in, it makes it easier for people to post stuff that don’t fit.",
            "Can we please ban, or vote to ban, Facebook-tier memes that rarely even fit? They're so bad and they always make it to the front page of Reddit and attract more morons who in turn post more of them here. I feel like they're overrunning the sub and it's just going to get worse.",
            "Can we put this in the auto comment.\n\nPeople just post shitty Explanations.\n\nLike- can we put in the auto comment- list off #1 (the someone), #2 (the something)...\n\nOr even something simple like:\n1. Name the person \n2. Name something they supported or voted for\n3. How did their vote/support end up hurting them.\n\nLike literally make them connect the dots in A very common sense way.\n\nAs it right now,\nThe auto comment pops up and just says: “explain how this fits the sub” and then people give a shitty explanation that shows irony or karma, but isn’t actually about leopards eating faces."
        ]
    },
    "Kylie Jenner cries over 'hurtful' comments she 'f—ked up' her looks with 'so much surgery' and filler": {
        "title": "Kylie Jenner cries over 'hurtful' comments she 'f—ked up' her looks with 'so much surgery' and filler",
        "score": 2653,
        "url": "https://pagesix.com/2024/06/20/style/kylie-jenner-cries-over-hurtful-comments-she-fked-up-her-face-with-so-much-surgery-and-filler/",
        "content": "",
        "num_comments": 444,
        "comments": [
            "Hello u/brucespringsteinfan! Please reply to this comment with an [explanation](https://www.reddit.com/r/LeopardsAteMyFace/comments/lt8zlq) matching this exact format. Replace bold text with the appropriate information.\n\n1. **Someone** voted for, supported or wanted to impose **something** on **other people**.\n  ^(Who's that someone? What did they voted for, supported or wanted to impose? On who?)\n2. **Something** has the consequences of **consequences**.\n  ^(Does that something actually has these consequences in general?)\n3. As a consequence of **something**, **consequences** happened to **someone**.\n  ^(Did that something really happen to that someone?)\n\nFollow this by the minimum amount of information necessary so your post can be understood by everyone, even if they don't live in the US or speak English as their native language. If you fail to match this format or fail to answer these questions, your post will be removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeopardsAteMyFace) if you have any questions or concerns.*",
            "Did the leopards eat her old face or new face? ",
            "But she is so brave, she once ate chicken Mcnuggets before a red carpet appearance! /s",
            "You don't get to live a public life and escape public scrutiny.\n\nYou made billions of dollars selling this image to other women. Lying about how you attained your looks. You can't maintain the lie forever. This is the penance.",
            "She did. Her face doesn’t look anything like her original face.",
            "Not a fan of this family and what they represent. However, she didn’t stand a chance growing up in that environment.",
            "Man their life is fucking depressing and dystopian. Yesterday, Kim talked about how she had '10 good years left' and could do a movie a year till then. Imagine thinking about your body like a slowly decomposing mess after which you won't be worth anything",
            "Oh no! Anyway…",
            "“It’s a miracle I still have confidence and can look in the mirror and see myself as pretty” \n\nShe’s fine",
            "These kinds of operations are so important for people with disfigurements/injuries/fundamental problems but when people get them as a chic aesthetic choice it screams privilege and decadence. I myself won't shame anyone but said wealthy victims of shaming can cry me a river"
        ]
    },
    "Kyle Rittenhouse feeding his family to the  wolves": {
        "title": "Kyle Rittenhouse feeding his family to the  wolves",
        "score": 18813,
        "url": "https://i.redd.it/pyyn8k0pox7d1.jpeg",
        "content": "",
        "num_comments": 2463,
        "comments": [
            "Hello u/NYstate! Please reply to this comment with an [explanation](https://www.reddit.com/r/LeopardsAteMyFace/comments/lt8zlq) matching this exact format. Replace bold text with the appropriate information.\n\n1. **Someone** voted for, supported or wanted to impose **something** on **other people**.\n  ^(Who's that someone? What did they voted for, supported or wanted to impose? On who?)\n2. **Something** has the consequences of **consequences**.\n  ^(Does that something actually has these consequences in general?)\n3. As a consequence of **something**, **consequences** happened to **someone**.\n  ^(Did that something really happen to that someone?)\n\nFollow this by the minimum amount of information necessary so your post can be understood by everyone, even if they don't live in the US or speak English as their native language. If you fail to match this format or fail to answer these questions, your post will be removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeopardsAteMyFace) if you have any questions or concerns.*",
            "Kyle is only into protecting the property of strangers. His mother and sister should pull themselves up by their bootstraps.",
            "They should pray to Trump. \n\nIt worked for the dude crying in the truck right?",
            "Thoughts and prayers",
            "Go Fund Me? That sounds like socialism.",
            "Clearly that idiot was being used by the GOP to further their culture war crap but his family is also to blame for white trash toxic parenting.  Why don’t they beg the GOP to help them out? \n\nWe all know the GOP will ghost anyone who’s no longer relevant or useful in their cause to destroy the country.",
            "It still blows my mind that Kyle was dumb enough to not fade from the public spotlight after escaping a guilty verdict by the skin of his teeth, and maybe try to return to living a normal life.\n\nInstead he chose to bring attention to himself by being used as a propaganda prop by the GOP, not only making himself out to be more of an asshole than before, but now it’s come out that he never had plans for college and is simply an attention seeker.  \n\nI’ve been told by some defenders that he only went on this media tour to pay for legal expenses, which if true, this would have been the time to use it.  Yet he doesn’t.  What a dick.",
            "Maybe they could learn to code?",
            "They should have used givesendgo. The audience there is more supportive of people like Rittenhouse.\n\nSilk (of \"Diamond and Silk\" fame) raised over $100,000 on there when her sister died. It was supposed to be for Diamond's \"legacy\" according to the fundraising campaign. My guess is it went straight into Silk's pockets as part of the ongoing grift.",
            "He’s broke too, subsisting on scraps from increasingly low rent, fringier right wing speaking engagements. Went from 60k to give a speech at an NRA convention to $20 and a Red Bull to appear on the catturd podcast. This is what happens to every societal cancer of the week they find. His mom also tried to capitalize on being a right wing villain at the beginning to so my sympathy is non existent. Kyle will end up like George Zimmerman, and the rest of his family can look forward to working at the gas station around the corner from their trailer park."
        ]
    },
    "Gay man tries to find community on Stormfront ": {
        "title": "Gay man tries to find community on Stormfront ",
        "score": 98,
        "url": "https://www.reddit.com/gallery/1dlui63",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Hello u/pIastichearts! Please reply to this comment with an [explanation](https://www.reddit.com/r/LeopardsAteMyFace/comments/lt8zlq) matching this exact format. Replace bold text with the appropriate information.\n\n1. **Someone** voted for, supported or wanted to impose **something** on **other people**.\n  ^(Who's that someone? What did they voted for, supported or wanted to impose? On who?)\n2. **Something** has the consequences of **consequences**.\n  ^(Does that something actually has these consequences in general?)\n3. As a consequence of **something**, **consequences** happened to **someone**.\n  ^(Did that something really happen to that someone?)\n\nFollow this by the minimum amount of information necessary so your post can be understood by everyone, even if they don't live in the US or speak English as their native language. If you fail to match this format or fail to answer these questions, your post will be removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeopardsAteMyFace) if you have any questions or concerns.*",
            "Oh boy, do I know what I'm posting after work today 😂\n\nI thought Truth Social was a fish in a barrel, that website's gonna be the *easiest* pickings",
            "It's almost like racists are horrible and not good people",
            "I had to reread that title to make sure my eyes weren’t playing tricks on me.\n\nBro thinks he’s Ernst Röhm.\n\n\nToo bad that he lacks self awareness to realize he’ll end up like him too.",
            "Fuck him.  I hope he continues living his miserable ass life.\n\nIf he wasn't gay himself he would absolutely want \"state-sanctioned repercussions\" for the way our gay friends live their life.",
            "I mean that’s all horrible, but the phrase “partake of being gay” is comedy gold. \n\nIs that some gay I see on the buffet? Don’t mind if I do…",
            "He isn’t like other gays. He is one of the good ones. Fucking token…..they get spent.",
            "This is like that \"I was eating out gramma...\" joke where every line is worse than the one before. From the OP, it's a pitiful example of a sycophant that believes in an ideology that hates him and begging to be accepted by those who cling to it. And the replies are a study in the inherent evil in racism and fundamentalism.",
            "This Ernst Röhm-wannabe better be careful if he doesn’t want to get beat up, or worse, by his fellow “pro-white” brothers",
            "So is Storm Front a white supremacy message board?"
        ]
    },
    "‘Save the Children Convoy’ Finally Ends, Leaving Farmer With Piles of Garbage, Rancid Food and Unpaid Bills": {
        "title": "‘Save the Children Convoy’ Finally Ends, Leaving Farmer With Piles of Garbage, Rancid Food and Unpaid Bills",
        "score": 4201,
        "url": "https://pressprogress.ca/save-the-children-convoy-finally-ends-leaving-farmer-with-piles-of-garbage-rancid-food-and-unpaid-bills/",
        "content": "",
        "num_comments": 287,
        "comments": [
            "Hello u/GoGades! Please reply to this comment with an [explanation](https://www.reddit.com/r/LeopardsAteMyFace/comments/lt8zlq) matching this exact format. Replace bold text with the appropriate information.\n\n1. **Someone** voted for, supported or wanted to impose **something** on **other people**.\n  ^(Who's that someone? What did they voted for, supported or wanted to impose? On who?)\n2. **Something** has the consequences of **consequences**.\n  ^(Does that something actually has these consequences in general?)\n3. As a consequence of **something**, **consequences** happened to **someone**.\n  ^(Did that something really happen to that someone?)\n\nFollow this by the minimum amount of information necessary so your post can be understood by everyone, even if they don't live in the US or speak English as their native language. If you fail to match this format or fail to answer these questions, your post will be removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LeopardsAteMyFace) if you have any questions or concerns.*",
            "My surprise is measurable.",
            "“What a bunch of unforgivable humans that are fighting the government against being screwed but they screwed us more than anyone,” Goyette-Wiggins added. “Their mission was to live off of anybody’s backs”\n\nThis whole article is LAMF gold. My main question is how exactly were they saving the children by squatting on this guys property and living like raccoons?",
            "Pretty sure if they really wanted to save the children, they should be going after the Catholic church, evangelical Christianity, and/or the Republican party. Beginning to think these guys might be drugged-up, mentally-ill conspiracy theorists.",
            "\"That doesn’t represent who we are as people...\"\n\nBut...yes it does, that's exactly hat you did..",
            "Turns out when you gather a bunch of people together around “nobody tells me what to do” you very quickly arrive at the place where nobody cleans, nobody pays the bills, nobody can speak for the group’s behavior, and nobody can establish rules to keep living side by side amicable. It’s almost like “government” is one of those natural laws things like they always say capitalism is.",
            "Who would have guessed a bunch of angry, entitled, paranoid people who hate being told what to do would make bad guests and not follow up on even the most basic of promises?",
            "But now the children have been saved,  right? \n\nSo it was worth it?",
            "> “I think Chet was paranoid that everybody was going to bail and he was going to be stuck with the bill,” Berry speculated. “Whether he should have done that or he didn’t, now you feel like you’re trapped in a bit of a prison scenario.”\n\nGee, I wonder if anyone living in downtown Ottawa can imagine what it felt like to be trapped in their homes because of crazy people setting up a blockade.\n\n> “I’d just given them $4,260,” Berry said. “There was zero mention to me about the clean-up issues or any mess, none whatsoever.”\n\nJust like my 5 year old who claims they didn't know they needed to clean up their giant mess because I didn't specifically ask them to, even though they know cleaning up after yourself is something you always need to do.",
            "Who among these guys can do the loudest and most convincing Helen Lovejoy (The Simpsons) impersonation?"
        ]
    }
}