{
    "Suggestion Saturday": {
        "title": "Suggestion Saturday",
        "score": 3,
        "url": "https://www.reddit.com/r/lethalcompany/comments/1dqwssl/suggestion_saturday/",
        "content": "A new \"Suggestion Saturday\" post is created each Saturday!\n\nPost your suggestions for the **game** in this thread, and upvote the ones you agree with!",
        "num_comments": 6,
        "comments": [
            "New interior modules and proper side objectives that would encourage people to explore deeper.",
            "making the cruiser work better on hilly moons and make it not be damaged by the floor",
            "Yeah I feel like it may only be useful on artifice",
            "None of the moons (except art) were designed for vehicles. Only way the cruiser would really work is if each one got a road that lead from the ship to main",
            "server join expansion(even mods, like these 15 servers aren't enough and they can reach between multiple countries, sometimes continents)",
            "A link to my indoor entity concept: [https://www.reddit.com/r/lethalcompany/comments/1dr6s39/the\\_trader\\_indoor\\_enemy\\_concept/?utm\\_source=share&utm\\_medium=mweb3x&utm\\_name=mweb3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/lethalcompany/comments/1dr6s39/the_trader_indoor_enemy_concept/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button)"
        ]
    },
    "best update ": {
        "title": "best update ",
        "score": 587,
        "url": "https://v.redd.it/wsa072bv7e9d1",
        "content": "",
        "num_comments": 26,
        "comments": [
            "Zeekerss added instagram reels to the game ",
            "Dash cams in russia be like :",
            "I was playing Arma reforged and I kid you not this is exactly what happened to me",
            "How do you get the car?",
            "OMAGAD I WANNA PLAY IT SOOOOOOO BAD",
            "How do you download the update ?",
            "Just make sure you dont put it in park before your friend starts driving, as apparently the manual for the cruiser states it might be able to hear you, so say nice things to it",
            "How did u get the car?",
            "There's something about you.... It's hard to explain...",
            "Fits his pfp incredibly well"
        ]
    },
    "Version 55 Public Beta - Patch Notes": {
        "title": "Version 55 Public Beta - Patch Notes",
        "score": 568,
        "url": "https://www.reddit.com/r/lethalcompany/comments/1dqtdic/version_55_public_beta_patch_notes/",
        "content": "https://preview.redd.it/nzi808pegd9d1.png?width=793&format=png&auto=webp&s=cb2370d744bb7f8d46acbe0920d4181d74d3a5a8\n\n",
        "num_comments": 91,
        "comments": [
            "The experimentation change seems stupid lol. I thought it was supposed to be an easy yet unprofitable map for new players to get acclimated to the game. Now it's just unprofitable.",
            "Experimentation will be Snare Flea fest now lol",
            "so basically experimentation is gonna be hard?",
            "Any chance for new interiors anytime soon",
            "why the hell did they jack up monster spawn rate on Experimentation?? there was already nearly 0 point going there considering it spawns at most 30 cents, only really being a good \"tutorial\" moon. Now it doesn't even have that going for it. 0/10 moon, would put it down if it was my dog.",
            "Holy crap giants have to finish spawning before killing you!",
            "Added the Kidnapper Fox Swiper no Swiping!",
            "so experimentation sucks for new ppl and for makin money now? im kinda confused as to its point",
            "Anyone know where barber spawns?",
            "when does it come out of public beta????"
        ]
    },
    "The Best Update Ever": {
        "title": "The Best Update Ever",
        "score": 44,
        "url": "https://v.redd.it/6u9i42h6ch9d1",
        "content": "We finally got the cruiser on our first play throuogh of v.55 ... for 10 seconds anyway \n",
        "num_comments": 5,
        "comments": [
            "The cruiser sucks tbh there are maps that are good for it",
            "I spelled through wrong dammit",
            "I'd love to know them cause i certainly haven't found a use for this pos",
            "Poor Sam",
            "We made a whole video of our first v.55 experience check it out! \n-\n[Lethal Tragedy](https://youtu.be/vd8vyUCEzWg)\n-"
        ]
    }
}