{
    "What Have You Been Listening To? - Week of June 24, 2024": {
        "title": "What Have You Been Listening To? - Week of June 24, 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/LetsTalkMusic/comments/1dnfkml/what_have_you_been_listening_to_week_of_june_24/",
        "content": "Each week a WHYBLT? thread will be posted, where we can talk about what music we’ve been listening to. The recommended format is as follows.\n\nBand/Album Name: A description of the band/album and what you find enjoyable/interesting/terrible/whatever about them/it. Try to really show what they’re about, what their sound is like, what artists they are influenced by/have influenced or some other means of describing their music.\n\n[Artist Name – Song Name](www.youtube.com/watch?v=PxLB70G-tRY) If you’d like to give a short description of the song then feel free\n\nPLEASE INCLUDE YOUTUBE, SOUNDCLOUD, SPOTIFY, ETC LINKS! Recommendations for similar artists are preferable too.\n\nThis thread is meant to encourage sharing of music and promote discussion about artists. Any post that just puts up a youtube link or says “I've been listening to Radiohead; they are my favorite band.” will be removed. Make an effort to really talk about what you’ve been listening to. Self-promotion is also not allowed.",
        "num_comments": 20,
        "comments": [
            "[Been Stellar - Start Again](https://open.spotify.com/track/2xFVZhECTTxesryJ2KzbzA) (2024) Indie Rock: I can't point out the exact band I'd namedrop to reference the kind of sound I'm hearing from the full album, but I appreciate it nonetheless. This track in particular, I appreciate the throwback, the classic indie rock sound, it's arresting and tasteful.\n\n[Crywolf - Gold](https://open.spotify.com/track/7hvMubP82IPoG1gPJbUpBl) (2024) Alt. Pop: Vocoder be damned, but Crywolf is always in his best form when he does really melodic ambient pop/r&B track list this. The lyrics are more pronounced and the vibe overall is something I can rely on during many rainy days as of lately. And of course, that falsetto.\n\n[Demersal - Lys I Natten](https://open.spotify.com/track/6i28Tw6km9TGsHyrij2Z5u) (2024) Screamo: We need more trumpets in extreme music, I swear it just elevates everything in the right moment, a fitting bedfellow. Very orgasmic and triumphant.\n\n[Gordan - Šara](https://open.spotify.com/track/0eyCNSDqATwmRJHoUHMQeu) (2024) Drone Folk: Music to score the birth of the new tyrant overlord rising from the ashes to.\n\n[Kelela - All The Way Down](https://open.spotify.com/track/3GZpSLgW7eaPzbJUFD7jfL) (2015) R&B: Exploring the terrain of her sonic through this sultry beauty of a track jumpstarted my love for her music. And she’s never been more consistent after.\n\n[Dear & The Headlights - Run In The Front](https://open.spotify.com/track/2V31IOkSrk2OvrEwcUbATP) (2007) Midwest Emo: There were times when I could just not stop listening to this, it's just the perfect break up song at the time as it was very cathartic especially during the 'I'll be missing you, I'm missing you, I don't want to. But I will' part. Nowadays there's no more residual pain attached to the song, so I can enjoy it more freely.\n\n[Moby - Porcelain](https://open.spotify.com/track/6EXi6ZqTITKGtVBKqbphjL) (1999) Downtempo: Been on a fix for some iconic electronic tracks from my childhood, something along the lines of this and Fatboy Slim's 'You're Not From Brighton'. Something evocative.\n\n[Pixies - La La Love You](https://open.spotify.com/track/6x0cOqPP07gTXusQfK9COQ) (1989) Alt. Rock: Everytime David croons 'yeah' after every whistle, the album score increases by half a point. Easily my favorite and most played track on Doolittles.",
            "**[5 x 5](https://tapmusic.net/collage.php?user=centretowave&type=7day&size=5x5&caption=true)**\n\n\n**[Alcest - Les Chants de l'Aurore](https://www.youtube.com/watch?v=B_fCrew2ZOQ)** -- Blackgaze pioneers' newest doesn't stray too far from the usual fare but is largely unfocused. I've been mixed on Alcest for a while. Their first 3 albums are the best the genre has to offer, but everything since Shelter has been frustratingly uneven. The band created their own style of music, but they never seem to move from it too much. When they removed the harsh vocals on the Shelter album, they sounded like Coldplay and immediately retreated to the more standard Kodama, but even that album lacked ideas. This one harks back more to Les Voyages de l'Ame, but isn't quite as memorable as that one. Part of the issue is that each song sounds like a series of moments rather than something adding up to a coherent whole. So we get a blastbeat and screams section, followed by some quasi-stomp clap hey chorus, maybe some electronic percussion, etc. that all comes across as random ideas thrown in together.\n\n**[Hexvessel - Polar Veil](https://www.youtube.com/watch?v=H8sXwJ_fFDY)** -- Psychedelic folk act adds black metal guitars. Ironically, while the band's vocalist, Khvost, has a black metal background in the band [Code](https://www.youtube.com/watch?v=ZaOEEj_JKzU), Hexvessel have largely avoided that sound. It's also interesting that this band largely avoids black metal's usual hash vocals in favor clean vocals, sort of like [Ven Buens Ende](https://www.youtube.com/watch?v=tMPfYr7JiZM) but more gothic. Though less overtly psych folk than before, that style of  songwriting is still more or less the backbone of the songs, which creates an interest contrast between the buzzing guitars and the dirgy rhythm section (blastbeats aren't used very often).",
            "**Nobukazu Takemura** - [10th](https://www.youtube.com/playlist?list=OLAK5uy_lWwyUHsJ6eGWSFoxUwxzQP3fw2ukjm8t0)/[Songbook](https://youtu.be/BjoDYThWg7g?feature=shared): Nobukazu Takemura is a Japanese DJ, composer, instrumentalist and electronic music producer active since the early 90s. I was vaguely aware of Takemura for a long time and I did listen to some of his music but I did not take a proper deep dive into his discography until recently. The fascinating thing about Takemura's output in the 90s and beyond is that his albums feature a dramatically different sound, from nu-jazz to experimental glitch and remind me of music explored perhaps more successfully by other artists but with an important caveat. Nobukazu did it first. His 1994 debut album sounds like a blueprint to what Jazzanova would go on to do later on in the decade, nu-jazz, dance-y grooves, rap features, it's all there. Starting with his sophomore mid 90s *Child And Magic* album he would venture into this whimsical, moe-fied version of ambient/glitch/downtempo/microhouse that artists on ryoondo-tea and plop labels would later perfect. *10th*, the album I listened to this week sounds like an early vocaloid project except of course it does not actually use vocaloid software and was released two weeks before vocaloid was even officially announced, like I had to check it. Intentional or not, the heavily processed vocals featured all over the album sound like a vocal synthesizer, it's absurd. The next album, *Songbook* is a MPB/Bossanova/avant-folk affair that reminds me of [70s MPB with child vocals](https://youtu.be/YxRqZWngKLE?feature=shared) and turn of the millennium Indietronica from Iceland and even Ichiko Aoba's music but with child-like magic pixie factor turned up to eleven. It's awesome.\n\n**Skee Mask** - [Resort](https://www.youtube.com/playlist?list=OLAK5uy_k60SynTqkl6Zg-KuY9QK4IHxUAFQCyFas): Skee Mask's latest LP is my favorite release of his in a while. It's a breaks-y, upbeat ambient-techno ode to the soft gloss of the early 00s. It's warm, lush and full of quiet optimism, sounds fantastic as well. The drums are punchy, the pads are ethereal and the echoes are clean and precise. Beautiful stuff.",
            "[Trampled By Turtles - Ain't No Use In Tryin]\nhttps://www.youtube.com/watch?v=0sWIjxvmw68\n\nRomp 2019 is my favorite live video. https://www.youtube.com/watch?v=AoWSrhdKXEQ&t=1456s\n\nIt's called New Grass. The song above would be a good place to start. I enjoy pretty much everything they do. So tight, such great musicians. The fiddle player is one of the best I've heard. As is the banjo, mandolin. They're all great IMO.\n\nSecond shout out to Turnpike Troubadours\nhttps://www.youtube.com/watch?v=mcoBe6s1c5U",
            "hello,\n\n  \nSo, since February I have had a goal to listen to all of my cds from A through Z. Currently I am at Bi. \n\n  \nThis is what I have listened to so far:\n\n  \nBig Star - #1 Record. It's Jangly Rock. I can't place what it is influenced by. Maybe if I were to guess I would say that I could hear The Byrds influence in there a little bit. \n\n  \n[https://m.youtube.com/playlist?list=OLAK5uy\\_mZqXFt2lB8RR84-1eQwkTOhP955XEz7uE&playnext=1&index=1](https://m.youtube.com/playlist?list=OLAK5uy_mZqXFt2lB8RR84-1eQwkTOhP955XEz7uE&playnext=1&index=1)\n\n  \nThe Birthday Party - Hee Haw. \n\nThis is pretty silly sounding post punk that takes influence from Country, Leonard Coheen, Western Movie Soundtracks, and Chamber music. \n\nBehind all of the goofiness and weirdness though is some very dark subject matter. \n\nFor those that don't know, this is the band that Nick Cave was in before he went solo with the Bad Seeds. \n\nI personally like his output with the Birthday Party better than I do his solo material. \n\n  \nHis solo material doesn't sound enough like the Birthday Party to hold my interest. His solo work is too safe. \n\n  \nThis stuff though, holds a special place in my heart. \n\n  \n[https://m.youtube.com/playlist?list=PLj83GpwkJx-1j0JEC6yff5TU2W8fwbrls](https://m.youtube.com/playlist?list=PLj83GpwkJx-1j0JEC6yff5TU2W8fwbrls)",
            "Paramore: is an interesting band with a great career (20 years at least) of course you know who they are, and I like them because of the way that Hayley is, I mean, she is an authentic person who shows herself without being scared about people can say, and I think that when you listen to Paramore is like backward in time to when you were a teenager, but in the recent albums you can find something different, it’s like you can continue feeling like a teenager, but you have to see the world as it is and not how you want it to be.\n\nAlbum: After Laughter. I think this album explores the idea of waking up from a deep sleep in which you were and also accepting the things that you are going through.\n\nThe specific song I like from this album is \"Rose-Colored Boy\". This song expresses the idea that optimism is not always the answer to the wrong things or the things that we worry about. Also, this song is about depression, and that it is easy to be ignored by people because of the optimism. The line I like the most is \"I have taken my glasses off\" because you see the real world when you don’t have that rose-colored perspective that sometimes is a lie about life.\n\nThe rose-colored perspective is about seeing the world with too much optimism that turns it into a lie.\n\nso \"Just let me cry a little bit longer, I ain't gon' smile if I don't want to\"\n\n[https://www.youtube.com/watch?v=cW5ueE2vUm0](https://www.youtube.com/watch?v=cW5ueE2vUm0)",
            "\"Facade\" by a two-piece unsigned band from Manchester, UK, The Wrong Signals. It’s a high-energy pop punk / power pop song, reminiscent of 90s/2000s bands like Jimmy Eat World. It's about authenticity, with a catchy chorus.\n\n**Spotify:** [https://open.spotify.com/track/0yDc6sWjtDFq3UASPx9vzc?si=8d29789b23c746b7](https://open.spotify.com/track/0yDc6sWjtDFq3UASPx9vzc?si=8d29789b23c746b7)\n\n**Soundcloud:** [https://soundcloud.com/thewrongsignals/facade](https://soundcloud.com/thewrongsignals/facade)\n\n**Youtube**: [https://www.youtube.com/watch?v=8q5JoST2QrA](https://www.youtube.com/watch?v=8q5JoST2QrA)",
            "**The Decemberists -- [As It Was, So It Will Be Again](https://www.youtube.com/watch?v=_ppJ7bpPKFM)**\n\nI just completed a project where I went through albums from 2005 and was shocked by how good The Decemberists used to be. So much energy and enthusiasm with songs that had huge sweeping hooks. Over the years, The Decemberists have put out strong songs such as \"O Valencia!\" and their version of the mining classic \"Rox In A Box.\"  But something definitely got lost along the way and The Decemberists became a sort of mediocre stylistic covers fairground act. They became an amusement park attraction where they show their historical re-enactments of old musical stylings. It led them to some tough to digest places such as on the awful album *I'll Be Your Girl.* On *As It Was,* The Decemberists largely back away from that decade-long project, with the notable exception of \"Oh No!\" which is thoroughly cheesy in its Wayback Machine retro feel. Instead, we get Decemberists songs like one would think of the band of doing had they not made a detour into the Renaissance Fair. The opening track has James Mercer, which is just too much Cheeseball Indie Rock for my taste, and I just waded through a bajillion indie rock albums from 2005. Mercer and Meloy is too much, though it did make me realize that somehow, even after all those train-wreck albums of the last decade, The Decemberists are now cooler than The Shins. Maybe they always were and Natalie Portman tricked me.\n\nAnyhow, the large problem with this album is that it thematically doesn't say much that Meloy hasn't jangled to back in the mid-2000's. Every spirited song is about death and every downcast song is about love all told from the perspective of young maidens or swashbuckling swordsmen or whatever... honestly, I can't get myself to pay attention to the details to Meloy's songs at this point because they feel like reruns. But why do all of the upbeat songs have to be about death? Why? Come on, Meloy, let me live a little! And why do all of the love songs have to be so downcast? Let me enjoy love!\n\nEven with that quibble I think this album is actually halfway decent. *I'll Be Your Girl* is near-legendary status for being awful, a real \"*What the hell is this band even doing*?\" sort of album and so anything with any effort is a crawl out of rock bottom. The Decemberists have sort of righted the ship, although they have a tenth the energy and passion of their old albums and their music isn't as catchy or spirited or engaging or fun as it used to be. They now make Decemberists songs, new ones to play on tour and enjoy.\n\n...but what if The Decemberists wanted to do something different? Well, there's \"Joan In The Garden\" at the end, a 20 minute rock odyssey that actually gets great a few times before tripping over itself by pulling out the Toto/Yes synth cheese. I don't think the song quite works, and I say this as someone who is heavily biased toward weird stuff, but since The Decemberists's main fanbase are nerds, why not do an album that's one two-hour track? Ditch all of the pop stuff for one album. I will the the first to say it is risky. I love a lot of the poppier Decemberists jams. But I think that would be the sort of risky reset the band needs and it's probably what the fans truly want. I mean, look at the streaming count! 590 K plays on Spotify, third most on the album other than the James Mercer opener and a boring sad love ballad. This is what the True Fans want, and I say, deliver them the goods! Revive all of the fake old timey styles and sew them together to tell an epic story. THIS IS YOUR DESTINY DECEMBERISTS! THIS IS HOW YOU ACTUALLY BECOME THE GREATEST ROCK BAND. IT IS RIGHT THERE. GO GET IT!!!!!!!",
            "I never read somebody saying “La La Love You” was the best song on *Doolittle*. You do you though.\n\nI listened to the Been Stellar album this morning and I’m not really feeling it to be honest. It feels like the early 00s downtown NYC rock scene run through OpenAI and spat back out. Like, it sounds like what it is, I guess that means something to people wishing for the return of the Strokes or something.",
            "Haven't heard anything I didn't like from Crywolf so far."
        ]
    },
    "General Discussion, Suggestion, & List Thread - Week of June 27, 2024": {
        "title": "General Discussion, Suggestion, & List Thread - Week of June 27, 2024",
        "score": 7,
        "url": "https://www.reddit.com/r/LetsTalkMusic/comments/1dptczi/general_discussion_suggestion_list_thread_week_of/",
        "content": "Talk about whatever you want here, music related or not! Go ahead and ask for recommendations, make personal list (AOTY, Best [X] Albums of All Time, etc.)\n\nMost of the usual subreddit rules for comments won't be enforced here, apart from two: No self-promotion and Don't be a dick.",
        "num_comments": 1,
        "comments": [
            "Albums I listened to today...\n\nBlood Incantation - Timewave Zero \n\nBruce Springsteen - Born in the USA\n\nCoheed and Cambria - Vaxis II: Window of the Waking Mind \n\nAcid Reign - The Fear\n\nMartikor - Acedia\n\nBattlesnake - Battlesnake\n\nLesoir - Mosaic \n\nDeftones - White Pony"
        ]
    },
    "I generally like modern female pop musicians, but I can't figure out why I don't understand Taylor Swift's appeal.": {
        "title": "I generally like modern female pop musicians, but I can't figure out why I don't understand Taylor Swift's appeal.",
        "score": 76,
        "url": "https://www.reddit.com/r/LetsTalkMusic/comments/1dr1vmg/i_generally_like_modern_female_pop_musicians_but/",
        "content": "As a 25M, I generally like a lot of female pop vocalists. Olivia Rodrigo, Lorde, Sabrina Carpenter, Charli XCX, Phoebe Bridgers and others are part of the catalogue of music I consume on the daily. I think that Olivia Rodrigo's last record is a lot of fun and I consider it one of my favorite records of last year.\n\nMy taste is pretty broad. Usually I am listening to heavier stuff but when I need a pop fix, those artists mentioned above are the artists that I gravitate towards. I can't seem to get into Taylor Swift though, and I don't really understand why. At first, my go-to answer is that I relate to little-to-none of the topics that she writes about or is involved in, but then I think to myself, \"I don't really relate to anything that Lorde or Olivia Rodrigo focuses on either.\" \n\nAdding to that point, I don't really relate to what the guys from Knocked Loose or Judge are going on about either, but I still like them.\n\nThen I think, maybe it is the fanbase. It is a fanbase that I think goes over the top to support their favorite artist and I think that can be colloquially described as \"basic\" by people inside and out of the Taylor Swift ingroup. But, there are plenty of other fanbases that are cringey, annoying, overly-committed and other aspects that people that are not \"in the know\" about the trends/gimmicks that surround the artist would consider strange too. Given those annoyances, it doesn't turn me off from the artist, so that can't be it either.\n\nIs it her level of talent? No, clearly she is talented. She has all the makings of a good pop star, she can write and sing and dance and play guitar. Clearly she has talent and deserves the massive success that she has made for herself. She also seems to be a pretty good role model to young women and girls, and an all around  decent person.\n\nSo what is it? Why don't I understand? I want to understand, I've tried time and time again.",
        "num_comments": 112,
        "comments": [
            "I feel like she suffocates every song with verbosity and description to the point that the instrumentation never gets to stand out or be interesting at all. Couple that writing style with a monotone voice and it's like listening to the air conditioner hum over a metronome.",
            "for me her songs are way too on the nose and tone deaf. “you wouldn’t survive in the asylum they raised me in”? okay miss gurl",
            "I hold no ill will towards her, she’s a reasonably talented hard working performer. \n\nFor me … I just don’t like her voice. It’s bland and insipid. So even the folklore stuff which is in my wheelhouse … I can barely get through two songs. There is just zero colour to her vocal. \n\nShake it off is a banger though. And that one where she goes never ever ever. Etc. That’s it.",
            "I have difficulty understanding lyrics, so a song's rhythm, instrumentation, feel, drive, etc., usually grabs me more than its lyrics and storytelling. And the instrumentation/music of Lorde, Charli XCX, Phoebe Bridgers, and Olivia Rodrigo are consistently more interesting to me than Taylor Swift, who undoubtedly is a storyteller first and foremost. If you aren't connecting with Swift's lyrics or narrative (like me), I have a hard time seeing you connect with her music as a whole.",
            "Her entire schtick is well executed, but is to pop music what Hilary Clinton is to politics: well trained, highly instrumented/measured to the point of too focus-grouped/marketed rather than genuine, and often an uncanny valley of what a person is.  She's the rich daughter of a guy who owned a record label and could afford to build all the infrastructure around her to make her successful with even less talent than she has.  She writes things with the express purpose of commercial appeal (like Madonna for example) but with none of the underlying edgy attitude or an image with anything new on offer -- it's incredibly safe, mass-marketed pop culture, and with 10x the calculation, which I think for some folks is just too sterile and milquetoast.\n\nShe's not a Tina Turner, Madonna, or even a Halsey. She's a future Barbra Streisand or Celine Dion.",
            "I am a 24 years old woman. I am not into Taylor Swift too. \n\nMy problem with Taylor has always been that she is just so unabashedly pop. Can't stand the likes of Ed Sheeran or Shawn Mendes too. I don't like Katy Perry too. \n\nPartly why I liked Taylor's Folklore era is because it was not the kind of teenage bubbly pop she was earlier known for. There were indie influences and thus more appealing to me.\n\nAlso I am a melody/production person first, lyrics next. I  love singer-songwriters like Fiona Apple or Joni Mitchell because their music itself is far more interesting, that even if I tune out the lyrics I have so much to focus on (although with these artists lyrics add so much to the song). Something I can't do with Taylor Swift.",
            "I feel like she doesn’t translate well to most men, even if they love music made by women. There something distinctly feminine about her, and her music, that just doesn’t click with most guys, despite how progressive, accepting, and open minded they might be. It wouldn’t seem strange at all to me if a guy said he loved Joni Mitchell, Phoebe Bridgers, Charli XCX, Lana Del Rey, Fiona Apple, and Lucy Dacus, but didn’t care at all for Taylor Swift. I think it might be in part that she isn’t cool. There nothing truly cool about Taylor Swift. She has no edge. She’s milquetoast. All of the other women I mentioned have some kind of cool factor, and Taylor Swift really doesn’t. I think a lot of men sense that in some way, and find it boring, or uninteresting.",
            "I really enjoy pop music and for the life of me I cannot bring myself to like TS. My son listens to KPOP and I’m able to enjoy a lot of it. He listens to Ariana grande and I’m fine with it. But Taylor swift is just so meh. Everything about her is meh. What I do like about her is that she is her an woman and goddamn great businesswoman. I love what she’s doing in the music business.",
            "It's too bland for me and the melodies  she uses just aren't my personal favorite. I do like some of her songs, but don't really love them",
            "It's easy. She's not talented. Childish writing. Weak(at best) voice. It's not good or interesting music \n\n But she does work very hard. That has to count for something. Even with awful music"
        ]
    },
    "Does this retrospective on Hybrid Theory by Linkin Park give them too much credit for influencing music?": {
        "title": "Does this retrospective on Hybrid Theory by Linkin Park give them too much credit for influencing music?",
        "score": 23,
        "url": "https://www.reddit.com/r/LetsTalkMusic/comments/1dquiuw/does_this_retrospective_on_hybrid_theory_by/",
        "content": "From [The 100 Greatest Nu Metal Albums of All Time](https://numetalagenda.com/feature/the-100-greatest-nu-metal-albums-of-all-time/) by The Nu Metal Agenda. Bolding mine:\n\n>**5. Linkin Park**  \n***Hybrid Theory***  \n**\\[Warner Bros; 2000\\]**\n\n>*Hybrid Theory* is a perfect metallic cube. The intricate cogs and mechanisms that keep it in motion are encased by a flawless silver surface that reflects nothing but your own anxieties and problems back at you. *Hybrid Theory* is a transmission from a long-ago world in which a metal act wasn’t just competing with the top pop acts of the day but defeating them. NSYNC's *No Strings Attached*, frequently pointed to as the peak of the CD era, sold half of what *Hybrid Theory* would sell worldwide. So successful was *Hybrid Theory* that Linkin Park immediately had to fight off the boy-band accusations from their detractors. Yet the comparision is somewhat understandable. Beyond just a fresh faced and unthreatening looking bunch who declined to swear even once on their debut what strikes most immediately about *Hybrid Theory* is how deeply pop it is; it’s debatable that no album has ever synthesized pop music and heavy metal to such seamless extents. Not Metallica's *Black Album*, not *Appetite for Destruction*, not *Back in Black*, nothing. What are modern iconoclasts like Poppy or Rina Sawayama if not visions of an alternate world where “One Step Closer” was recorded by Britney Spears? For the half decade leading up to *Hybrid Theory*, nu-metal had been conquering Soundscan and TRL but the singles chart remained mostly immune. Neither Korn nor Limp Bizkit had ever broken the top 50 on the Hot 100. Linkin Park changed all that by packing “In the End” with zillion dollar hooks and sending it all the way to #2 on the Hot 100.\n\n>To the legions of teens and tweens who were finally allowed to own a nu-metal record ('Look ma, no parental advisory!') this seemed like the last album they’d ever need. This is as \"all killer no filler\" as it gets. More than just the album’s hit singles, this lean efficiency is why it kept moving six figures a week well into 2002. Radio stations played deep cuts like “Runaway” as if they were singles. If Linkin Park hit you at the right age and right time they were a band you could build a life around. Unlike their larger-than-life peers, Linkin Park were their fans- obviously nerdy guys that were into anime and Xbox and cleaned up their (green) rooms after making a mess. They had a fan club, did web chats, signed autographs, and released a full remix album just a year later, cultivating their own cutting-edge visuals that combined hip-hop culture, graffiti, and Adult Swim.\n\n>For a band that made such completely incredibly uncool music, their influences read like an indie publication’s best albums of the 1990s list. [Shinoda cites](https://www.youtube.com/watch?v=0Qxm-pOwTiY&%3Bt=335s&ref=numetalagenda.com) Refused’s *The Shape of Punk to Come* as being essential to Linkin Park, going as far as to say “without \\[that\\] there is no Linkin Park.” The comparison might seem off at first - stridently political post-hardcore heroes are responsible for your little brother’s favorite nu-metal band? - but upon inspection makes perfect sense. Until this point, nu-metal was loose and groovy, but Linkin Park tightened everything to a fine cinch. **They bottled Refused’s 'can-I-scream' energy while grabbing Depeche Mode’s clean melodic sense and Nine Inch Nails’ dense layers of electronics and synths to buttress their guitar and bass combinations. Jay-Z’s futuristic flow and pop sensibility, Black Thought’s internal rhyme schemes, and Aphex Twin’s digital sound manipulations. The turntable showcase on “Cure for the Itch” giving way to dusty loops and an aching melody could make DJ Shadow bob his head. All of this baked into the by then standard nu-metal formula of downtuned riffs, angst and turntable sfx created a sound that was at once a logical next step and something without precedent.** It’s staggering to imagine a fusion that dense coming on a debut album this seamless, yet here it is. As such, *Hybrid Theory* works as a sort of musical philanthropy; priming millions of kids to get into acts like Cannibal Ox, Boards of Canada, and Far later on in life.\n\n>*Hybrid Theory* changed popular rock music forever. **In the wake of its incredible sales figures, rock bands discarded any lingering pretenses of rock ‘n roll naturalism - let alone the blues - in favor of Linkin Park’s cut-and-paste Pro Tools methodology. Even their forebears like Korn and Slipknot would forsake their earlier jammy songwriting stylings for Linkin Park’s rigid structures and pop songwriting. Meanwhile, indie rock would sprint backwards to revive the post-punk sounds of the 70s and 80s with production techniques that strove for one band in one room recording to tape. Luckily for them, the world conquering success of** ***Hybrid Theory*** **spawned a backlash big enough to create a platform for those bands and you could argue that the ripples of Linkin Park's success are as responsible for the popularity of the White Stripes as they are Imagine Dragons. For better or for worse, the line between** ***Hybrid Theory*** **and modern rock bands like Bring Me the Horizon and twenty one pilots is a straight one.** *Hybrid Theory’s* influence is still a testament to its quality, even if some of the wrong lessons were learned.\n\n>If you can allow this author his indulgence, this was *the* album for me growing up. Chester Bennington, arguably the finest rock singer of the 21st century, a songwriter who understood me before I did. From the melancholy lilt of “In the End” to the shattering screams of “By Myself” his golden throat was a conduit of pure angst; flowing directly into the headphones of millions looking for a safe space to explore those first tender feelings of depression and anxiety. A voice that could make something as petty as an afternoon grounded sound as devastating as the end of the world. This longing, for an innocence where the mildest inconvenience could be felt as deep as death, makes the reality of “Pushing Me Away” ache. Bennington, spent from an album of bloodletting, sings straightforward and pretty. “We’re all out of time\" raps Shinoda, \"This is how we find how it all unwinds,\" announcing not just the end of the album but the end of an era. As the song digs in for that last chorus, it all slides away like a VHS tape in fast forward. For a brief moment, as processed drum loops flicker and flutter to a close and a lonely synth trigger is switched off, I communicate with that innocent childhood self again - cradling a discman in the backseat of a minivan staring out the window - then it’s over. *—* [*H.K.*](https://twitter.com/HolidayKirk?ref=numetalagenda.com)\n\nI do think that there's something undeniably *pop* about Linkin Park. They were an act that could bend and break out of genre constraints with ease, even more than nü-metal already implies that - and they never felt like other nü-metal bands, probably because they were so clean and mainstream friendly. (Yet artsy and underground by associating with more legitimate hip-hop and electronic acts.) I think their appearance signaled a shift in the industry that they were at the forefront of, but not the catalyst, as the article suggests. What do you think?",
        "num_comments": 74,
        "comments": [
            "Obviously the author has a bias in favor of this album, he explicitly says as much in the last paragraph.  That said, he put together a pretty convincing narrative about *Hybrid Theory'*s originality and influence.  \n\nI would agree with the basic premise that nu-metal is a form of metal that aims for pop accessibility.  It seems counter-intuitive, because aesthetically speaking bands like Korn and Slipknot were obviously trying to be dark and counter-culture.  But the underlying music itself really was about channeling metal into memorable pop songs.  The cynical way of interpreting nu-metal's avoidance of guitar solos and incorporation of turntables, electronics, rap flows, etc., is that the latter are easier to turn into a sticky hook than the former.  \n\nIf you accept this premise, then yeah, *Hybrid Theory* undoubtedly was the best of the best.  It also helped that they matched their aesthetic with their pop fluency - they were just slightly edgy, slightly urban, still relatively grounded compared to their contemporaries.",
            "> In the wake of its incredible sales figures, rock bands discarded any lingering pretenses of rock ‘n roll naturalism - let alone the blues - in favor of Linkin Park’s cut-and-paste Pro Tools methodology.\n\nI'm not quite sure what argument is being made here. I'm not really familair with the production methodology of all the artists in question, but I'm not sure if this statement is being applied specifically to nu metal. If so, I'm having a hard time seeing LP as the catalyst for this given they were already somewhat late to the game. If we're talking influence in general, it's negated just a few sentences later by talking the about the White Stripes.\n\nThe paragraph about mish-mashing influences reads like nothing more than a shit-ton of name-dropping and I'm skeptical of how many were really baked into the mix (NIN and Depeche Mode probably, though those were already there in various nu metal acts).\n\nMost of that reads like it's giving LP credit for stuff already there, mostly by underselling just how popular nu metal already was.\n\nedit: I've always wondered about is if the \"safeness\" of LP compared to other Nu Metal bands played a factor in LP's popularity. My experience was that LP were given a pass by more discerning (for lack of a better word) parents who would've balked at the parental advisory stickers on other nu metal releases. All this to say that if Beavis & Butthead was made in the early 00s then Stewart would be wearing a Linkin Park shirt.",
            "The story I’ve heard about Linkin Park from a guy that jammed in bands in the same area was that they practiced exceedingly hard before attempting to play live and got signed almost immediately after due to how polished they were. I have no independent way to verify this, but according to the guy I worked with, nothing about them was a fluke. \n\nHaving said that, I have never been that interested in this kind of rock as it’s a bit too polished, but if what I’ve heard is true I think it’s not right to call them a cut/paste pro-tools band. I think they are a group that successfully incorporated electronic music elements into their sound and that necessarily makes their songwriting focus a bit more around keys and sampling/sequencing which puts spontaneity on the back burner. I have also heard that they were a good band live, which cuts against the studio band allegations. New Order comes to mind as they were extremely polished live and could do it all.",
            "That's a brilliantly-written piece. I never thought of the White Stripes as being a reaction to things like Linkin Park and I'm sure Jack White never thought twice about them, but the labels probably did.\n\nI was 15 or so when Hybrid Theory came out and I devoured it - although I remember even at the time feeling a little patronised by the lyrics. Within a year or so I decided I'd outgrown nu-metal and started buying NME magazine instead of Kerrang, just in time for the Strokes, The Hives and the White Stripes to become my new favourite bands.\n\nA lot of Linkin Park retrospectives are going to be influenced by what happened to Chester, but the songs are undeniable; I could sing most of those hooks back to you now despite not having heard the album for a decade. Maybe they're held up as the apex of all that MTV rock ushered in, but there's artistry there too and a connection with the right audience that feels less manufactured than today given it all happened in a pre-social media era. There's a place for this music amidst all the classic rock records in modern times, I think.",
            "What do you think would be evidence of their influence? I bet there’s a decent chunk of newer rock and hip hop artists that are very familiar with Linkin Park’s catalogue.",
            "Hybrid Theory and Meteora should be 1 and 2 whichever way you like.\n\nNo debate about that.",
            "I totally agree with everything on this text. Linkin Park was a band that make a group of people that listened to different types of rock/metal come together just to listen to them. I had a group of friends in high school that was very diverse, but everyone of them listened and loved Linkin Park.",
            "I will never understand how Linkin Park have suddenly over the past few years been re-evaluated as some incredible groundbreaking band. I thought we had all collectively decided that that shit was just awful and embarrassing.",
            "They influenced all the music I don’t like, and while I don’t like Linkin Park, I can’t deny their ubiquity. I hear them everywhere, even in Mexico.\n\nAnd yeah, of course they’re a pop band. Lots of\nmetal bands are.",
            "I think it overstates it. They certainly had effectively zero influence on the corner of the world I existed in at the time other than as \"that awful shit\", and we were heavy-duty metalheads. At the time the bands that really cut through and ultimately stood the test of time were things like Nile, Angelcorpse, Krisiun etc, and if you were into that there was pretty much no overlap with nu-metal"
        ]
    },
    "How do you build, populate and manage your playlists ": {
        "title": "How do you build, populate and manage your playlists ",
        "score": 6,
        "url": "https://www.reddit.com/r/LetsTalkMusic/comments/1dqrn6v/how_do_you_build_populate_and_manage_your/",
        "content": "I am curious how you guys go about creating playlist, manage/update them, and if, hoy you do so across multiple platforms ? \n\nPersonally I find it tedious, I have a long list of Shazams that I need to sort. It's just one of the ways I go about discover/find music and the step by step transition to various playlists where I see certain songs fit. \n\n  \nI am sure I am not alone with this. Feel free to share :) ",
        "num_comments": 7,
        "comments": [
            "I just have a few various playlists for different moods/situations.\n\nI only really use one platform for music, so it's pretty simple really \n\nI just add the songs or albums I want on the list and hit play.",
            "I'm old school, I make a directory, put songs (MP3 files) in it, and number them manually in the play order I want. Then I can use that on basically any device that can play MP3s.\n\nSometimes if I want to just sample a bunch of new albums, I'll just drop them all into a directory and let them play in whatever order, or maybe I'll take an older playlist, delete some stuff from it, and slot in some new music.",
            "Genre, subgenre, label, year, quarterly playlist  (of every thing I find), other (like when I’m preparing for a DJ gig)",
            "* Discover playlist with one song from the album I want to check out later. \n* I usually give these a few listens and rate them on RYM\n* Also as I listen I heart them\n* if I am using Apple Music I add it to my library to rot or remove it if I don’t like it. \n* if I am using Spotify I don’t have a plan other than put it in a playlist to rot",
            "I much prefer to keep my playlist development to a weekly basis, but I only developed this rhythm thanks to my utilization of the great music discovery invention in the history of man: Discover Weekly.\n\nWhile it wasn't always as powerful as it has been for the past 2 years, it now sends me 2 genres with songs from between 1960-present, and that are mostly fairly obscure, and some of the songs have been released just a few months ago. \n\nAfter separating the songs into two playlists, where I put an order to encourage a \"flow\" of the playlist and ensuring I separated all the tracks correctly, I listen to them again over the weekend, sometimes hearing a flaw, either a weak track or out of place. I then give each playlist a title, sometimes based on the mood, often based on personal events for that week so each of my playlists serves as a bit of a \"diary\" for a week.\n\nI have begun going back and compiling the songs I have found into bigger meta playlists (like obscure [60s](https://open.spotify.com/playlist/4r7bt6xrfvPlIcMEtIDGhr) or soul), but 80% of my listening is to an A or B side for each week. Also I like that I dont feel the need to constantly maintain or update playlists, each one is frozen in time, frozen in order, like a composition or album."
        ]
    }
}