{
    "Profile Swap Megathread (June 2024)": {
        "title": "Profile Swap Megathread (June 2024)",
        "score": 99,
        "url": "https://www.reddit.com/r/Letterboxd/comments/1d74aq2/profile_swap_megathread_june_2024/",
        "content": "Happy June, Letterboxd community! \n\nPlease go ahead and share your profile down below in the comments along with anything else that you'd like to include about yourself. How long have you been using the site? What kind of films do you usually log? What are some of your favourite flicks? Tell us all about yourself.\n\nFavourite first-time watches of June 2024? What're your current four favourites on your profile?\n",
        "num_comments": 699,
        "comments": [
            "Just a heads up, there is someone down voting a bunch of people, about 40-50 roughly have been form what I can see, including myself. I assume so there comment appears higher. Best thing to do is vote up any comments you see with no upvotes to counter it. I have done so. It is pretty silly really, someone is down voting people to begin with.",
            "Wow low rating for minus one. All good 👍 though I just followed you",
            "You sound very similar to me! I also write a review for every movie I watch and I love commenting on people’s reviews when I’ve seen a movie or just have something to say in general. I look forward to seeing your movie selections and reviews!",
            "Nice top 4. The harder they fall is super underrated 💪 ",
            "I love the loosely \"sh ppl can't handle it no more\" Month themed top four lol immediate follow",
            "Just letting everybody who reads this know that Katie is da 🐐",
            "The downvote users have been an odd plague on this sub for months now, it's entirely discouraged quality participation and left every post with a complaint or a joke or an insult at the top. Not sure if it's because this sub took off super fast or something, but it definitely caught a bug in these new and negative lurkers.\n\nAgreed on the upvote train though. I also find the block button has become effective after using it continuously for months.",
            "hi! i’m a few days late but i will be following you. 🎀in the name of girlhood🎀",
            "Just followed you. Angel heart in top four 💪 that movie has grown on me",
            "Love your username - I'm a Pats fan but I got to see Hester play as a Raven against us in 2016. Really neat to have watched a legend of the return game play!"
        ]
    },
    "Top 4/Recents/Favorites (June 2024)": {
        "title": "Top 4/Recents/Favorites (June 2024)",
        "score": 38,
        "url": "https://www.reddit.com/r/Letterboxd/comments/1d74dw0/top_4recentsfavorites_june_2024/",
        "content": "Use this megathread to post your top 4, or 4 recents, ask for suggestions based on them, or what they say about you or similar types of questions.    \n  \n  \n(Threads that duplicate this will be deleted and referred back here)",
        "num_comments": 128,
        "comments": [
            "my most recent watches that really stuck out to me are They Cloned Tyrone - Netflix, season 6 of Black Mirror - Netflix, & Grandma’s Boy - Hulu (watched it for the first time ever, great watch). i would love some recommendations (movies or shows) based on these! particularly with They Cloned Tyrone 👀 also please provide streaming service <33",
            "nice, am in the middle of a Kiyoshi Kurosawa binge too",
            "Have you seen Maborosi or A Bride for Rip Van Winkle?",
            "Re: Kiyoshi Kurosawa, would recommend *To the Ends of the Earth* if you haven't seen it.",
            "I don't know how far you like to stray into arthouse territory, but I can highly recommend \"Survive Style +5\" and \"Hazard.\" It might be tricky to get hold of them in decent quality though.",
            "if you wanna see something worse watch Dracula’s Angel",
            "i recently watched eternal sunshine for the first time and damn, what a watch!! super interesting role to see jim carrey in as someone who grew up watching his classic comedies (liar liar & ace ventura being my faves). gave similar vibes to the truman show, in the woke sense lol",
            "you should check out “short cuts” i really loved it and imo it’s slightly better then magnolia",
            "No Country for Old Men might be one of those flicks that works better upon rewatch.",
            "where’d u find sexy beast"
        ]
    },
    "What are the lowest average rated movies you consider unironic 10/10s on Letterbox?": {
        "title": "What are the lowest average rated movies you consider unironic 10/10s on Letterbox?",
        "score": 99,
        "url": "https://i.redd.it/7ta300hsgg9d1.png",
        "content": "",
        "num_comments": 115,
        "comments": [
            "YES on Gattaca. I watched that shit in high school biology and it was so fire",
            "The lowest rated movie that I've given a 10/10 is Under The Skin (2013). Average rating: 3.6\nMy mind can't comprehend why it doesn't have a higher rating. Maybe the marketing was bad or maybe people who like Scarlett Johansson's popular roles didn't like this movie and just watched it for her. It is not for everyone for sure, but people who like these kind of movies also generally like this one.",
            "Bringing Out The Dead is way too slept on. feel like people never bring it up when talking Scorcese or Cage.\n\nMy fav film everyone hates is Die Another Day. I find it transcendental in its epic steez.",
            "Cat in the Hat, that shit is hilarious and Mike Myers delivers an iconic performance.",
            "hit man was fun. 10/10 is a stretch",
            "right there with you on the place beyond the pines, that shit is sooo good",
            "Thisis a very good list.\n\nDisagree concerning CSA, Hit Man and Nocturnal Animals about the 10/10, but a very good list!!!",
            "I loooove Park Chan-wook’s Stoker. It has a 3.6 on Letterboxd and a 6.7 on IMDB 🥲",
            "A History of Violence is so damn good. It’s definitely up there with Logan as one of the best graphic novel adaptations ever.",
            "Your post doesn't make sense: collateral, nocturnal animals, and a history of violence are all very highly rated and acclaimed movies"
        ]
    },
    "Women of Letterboxd - what are your Top 10 films?": {
        "title": "Women of Letterboxd - what are your Top 10 films?",
        "score": 52,
        "url": "https://www.reddit.com/r/Letterboxd/comments/1dr2edx/women_of_letterboxd_what_are_your_top_10_films/",
        "content": "I feel like a lot of the content I see is male focused. I'd like to know what the women of this sub like.",
        "num_comments": 93,
        "comments": [
            "Top 10 is always changing but:\n\nAlien, Laura, Aliens, In the Mood for Love, The Third Man, Charade, Past Lives, All That Heaven Allows, Lucky Number Slevin, Before the Devil Knows You're Dead",
            "TROPICAL MALADY is number 1 and the rest is unranked: BEAU TRAVAIL, THE SEVENTH VICTIM, EYES WIDE SHUT, LOSING GROUND, TEXAS CHAIN SAW MASSACRE, DESIGN FOR LIVING, HALLOWEEN, CHUNGKING EXPRESS, SLEEPAWAY CAMP",
            "In no particular order: The Wailing, A Brighter Summer’s Day, Caravaggio, Paris Texas, 3 Women, Angel’s Egg, Mysterious Skin, Happy Together, Through the Glass Darkly, My Own Private Idaho",
            "memento, arrival, moulin rouge, killing of a sacred deer, tenet, TDKR, LOTR FOTR, west side story, 12 angry men",
            "The Handmaiden, Snowpiercer, MS. 45, Marie Antoinette, Re-Animator, Gone Girl, Hereditary, Kill Bill: Vol. 1, I Saw the Devil, Rear Window",
            "Couldn’t pick an order!! Tell me what ya think 😊\n\nI’m a Cyborg and That’s OK (Park Chan-wook) / Chungking Express (Wong Kar-wai), Wristcutters: A Love Story (Goran Dukić) / Comrades: Almost a Love Story (Peter Ho-Sun Chan) / Last Black Man in San Francisco (Joe Talbot) / Afterlife (Hirokazu Koreeda) / The Night is Short, Walk On Girl (Maasaki Yuasa) / Center Stage (Stanley Kwan) / Annihilation (Alex Garland) / Kikujiro (Takeshi Kitano)",
            "ghost world. santa sangre. scorpio rising. nowhere. doom generation. t2. the mask. there will be blood. holy mountain. and the tenth movie i honestly cant pick. its like a ten way tie with all my most highly regarded comfort movies. maybe Babe.",
            "This Is England, Texas Chainsaw Massacre, Sunset Boulevard, The Lovers on the Bridge, Scream, SLC Punk, Araby, Possession, La Haine and Farewell any Concumbine",
            "Irreversible, Mulholland Drive, Pulp Fiction, Perfect Blue, The Basketball Diaries, Mommy, Parasite, Hope (SK Film!), Nobody Knows, & Lilya 4 Eva",
            "No order... and changes all the time. Drop Dead Gorgeous, Before Sunset,  Cleo 5 a 7,  All that Jazz,  Showgirls,  Black Christmas,  Naked Kiss,  Wicker Man,  Sunshine,  Tie Me Up Tie Me down! (Atame!)"
        ]
    },
    "Name the Last Movie You gave Every Rating Avaliable to": {
        "title": "Name the Last Movie You gave Every Rating Avaliable to",
        "score": 104,
        "url": "https://www.reddit.com/r/Letterboxd/comments/1dqy3ii/name_the_last_movie_you_gave_every_rating/",
        "content": "For me it's:\n\n5: In The Mood For Love\n\n4.5: Past Lives\n\n4: 2046\n\n3.5: Fallen Angels\n\n3: 8 Mile\n\n2.5: Bram Stoker's Dracula\n\n2: Once Upon a Time in Hollywood\n\n1.5: Blackhat\n\n1: Two Distant Strangers (Feature-length: Thor Love and Thunder\n\n0.5: Transformer: Age of Extinction\n\nI am going through WKW walk through, so most of the top spots are his films.",
        "num_comments": 390,
        "comments": [
            "Kinda surprised by the low rating of Blackhat.",
            "Bro is Wong Kar Wai posting like crazy 😂😭",
            "5: Godzilla Minus One; 4.5: Rosemary's Baby; 4: Hit Man; 3.5: Kingdom of the Planet of the Apes; 3: Joy Ride (2001); 2.5: Late Night with the Devil; 2: Splice; 1.5: Thor: Love and Thunder; 1: What Jennifer Did; 0.5: N/A",
            "i actually kinda enjoy age of extinction, a decent movie that u can turn ur brain off and go “ hell yeah robotic dinosaurs being controlled by Optimus”. i also think it has the best transformers group chemistry of the films in the bayverse. but then you get to that dumbass romeo and juliet scene.",
            "I don't rate and tell.",
            "Save the green planet 5 Monk with a Gun 4½ Uproar 4 Exhuma 3½ snack shack 3 Abigail 2½ If 2 sick girl 1½ American society of magical negroes 1 happytime murders ½",
            "I see your are treading the WKW path. Well done son!",
            "Once Upon a Time in Hollywood a 2? 8 Mile a 3? \n\nDelete this right now lol",
            "So glad someone agrees with me on Once Apon a Time in Hollywood, just a bit of a jumbled mess of a film.",
            "5 - Daybreak Express, 4.5 - Late Autumn, 4 - Big Take, 3.5 - Rest Energy, 3 - Furiosa, 2.5 - The Pride and the Passion, 2 - The Young Racers, 1.5 - 9 Songs, 1 - I Graduated but…, 0.5 - Ready Player One"
        ]
    }
}