{
    "r/LGBT is looking for new moderators!": {
        "title": "r/LGBT is looking for new moderators!",
        "score": 77,
        "url": "https://www.reddit.com/r/lgbt/comments/1csrb2n/rlgbt_is_looking_for_new_moderators/",
        "content": "Do you want to help out in one of your favorite communities? Do you want to be a part of a diverse team keeping this platform safe? Well the mod team of r/LGBT is looking for helpful people who want to be a part of our ever expanding subreddit!\n\nWe can't promise it'll be easy, but we **can** promise that we are a great team who have a lot of experience when it comes to working together and making this place feel safe and comfortable for our users.\n\nIf you'd like to join our team, make sure that your account has a decent history in either r/LGBT, or within related subreddits, and fill in the form below. You don't need moderating experience to become a moderator, but it does help.  \nIf you're picked, you'll hear from us! Also, due to the volume of applications, you may not receive a response if you are unsuccessful, \nand please do not message us to see where we're at in the application process as we won't be able to answer, thank you. [<3](https://i.redd.it/1wxrqq01du061.png)\n\n\n#[Link to form](https://docs.google.com/forms/d/e/1FAIpQLSfwKzbMZv5kDIkqDx-nN2Ks4UOiW75fm9lC520ZwNXbZmPwow/viewform)",
        "num_comments": 50,
        "comments": [
            "Respect to anyone who does and to the mods who have to sift through the absolute garbage and hatred that this sub no doubt gets. \n\nI personally don’t think my mental health could handle having to deal with all that and I’m finally getting to a nice spot in my life 😂\n\nGood luck and props to those who do and will end up moderating! 🫶",
            "I would apply but I don’t have discord and won’t get it ",
            "I want to be part ❤️🏳️‍⚧️",
            "Reddit wants YOU to moderate their website for free while they make billions off stock!  \n\n\nReddit only EXISTS because of the effort of its moderators. Know your worth, demand fair pay for fair work.",
            "This would be great to do in my spare time!❤️",
            "[deleted]",
            "I'd love to work as a mod to improve the inclusivity, diversity, representation, education, and spread social awareness of the most marginalized members of this SROGIEPC+ (LGBTQIA2S+) community.",
            "Im guessing that subreddit history means actually commenting and posting and not having been in and looked for a while",
            "just realised I applied and then changed my discord username, lmaoo",
            "I'm a bit late to the party but I just applied. Thanks for your consideration!"
        ]
    },
    "US Politics Megathread 2024": {
        "title": "US Politics Megathread 2024",
        "score": 186,
        "url": "https://www.reddit.com/r/lgbt/comments/1aqgsjy/us_politics_megathread_2024/",
        "content": "We've noticed that lately the subreddit has turned into a lot of doomposting regarding the political climate in the US. While we understand a lot of people are rightfully concerned about what's currently happening in the US, it is not helpful to have dozens of posts every time a minor politician says something hateful. The main feed sometimes is full of doomposts, while this subreddit is a community safe space.\n\nTo allow for more positivity, to protect emotionally vulnerable members, and to make room for more attention for other countries on the main page, we've created this megathread.\n\n--- \n\n# What content is this megathread for?\n\n**General discussion** \n\nFor example:\n- Bills and laws\n- Politicians\n- Elections\n\n**Minor news**\n\nFor example:\n- \"[Politician] said [something hateful]\"\n- \"X bill was proposed/has passed\"\n\n**Doomposting** about political situations\n\nFor example:\n\n- \"I'm scared about X bill introduced\"\n- \"If Y bill passes, Z will happen to us\"\n\nFor a definition and more information on doomposting as well as a place to find support from other who have found themselves in a negative spiral, see our doomposting megathread (to be added still).\n\nSeparate posts made about these topics will be removed and redirected to this megathread.\n\n--- \n\n# Exceptions\n\nThe following things can be posted separately, but are also welcome in this megathread.\n\n- **Major news from reliable sources.** What constitutes as \"major\" will be at our discretion.\n\n- **Seeking support or resources** for a personal situation caused by politics. For example: \"What are some resources for moving out of the country?\"",
        "num_comments": 137,
        "comments": [
            "[Republican politician Marjorie Taylor Greene calls LGBTQ+ people ‘groomers’ as she backs LibsofTikTok](https://www.thepinknews.com/2024/02/15/marjorie-taylor-greene-calls-lgbtq-people-groomers-as-she-backs-libsoftiktok/)",
            "I know my comment will probably be at the bottom as time past by, but thank you for making this thread. \n\nAs someone who is unfortunately in FL and done a semester abroad in Sydney, Australia, the climate of Florida and Australia, is completely different than what I used to be dealing with for the past few years in FL. The US scares me more and more as time past by, and idk how it got so badly (more than usual, specifically for LGBTQIA+ Rights) in terms of bills passed and hatred that is not only promoting by news stations and social media but the misinformation that may or may not effected people's close relationships with family, friends, loved ones and their communities. \n\nThe news of Anti LGBTQIA+ Bills makes me heavily cautious for the future and our safety, BUT, This is a GOOD resource in creating this thread for people who lived in America or those in other countries following US news that can still be informed in real time without bringing the energy towards the rest of the subreddit (with exception of huge development which is TBD). I will be following this thread and hopeful of some positive news that can surprised us between now and in the future. \n\nMost likely, we all are gonna be watching closely for the US November 2024 Election which everyone's mind is towards the possibility of Project 2025 starting up IF Trump is re elected again, which is scary thought to think, however, the best thing that ANYONE can do currently is to make a plan to VOTE. \n\nCheck your registration status and update any information IF you're ELIGIBLE to vote within your local district and states website. Make a habit of doing so when your information needs to be updated/according to your states voting regulations that may says you need to do for every cycle. DO NOT ONLY VOTE when it's the Presidential Elections BUT make the TIME to do so CONSISTENTLY within your LOCAL COUNTIES and STATES. The politicians we have in the House and Senate effects on what type of policies and other federal bills gets viewed and have attention towards. DO YOUR RESEARCH ON THE CANDIDATES, DO NOT PICK BLINDLY since then you be wasting your vote and you don't want that. \n\nEVERY SINGLE VOTE MATTERS, and we all need to be properly represented for changes to happen and that can't happen if we throw in the towel. Some things are out of our control such as the Current Supreme Court Justice which is a completely different story or other things that would take away the theme of LGBT subreddit (no need to list them & being vague for that reason) HOWEVER, Voting is pretty much the ONLY thing we can attempt to do via Mail in or by in person without putting ourselves in Danger by advocating or protesting. \n\nThe November 2024 Election will have effects on a global scale whatever we want to acknowledge it or not. It wouldn't be just a USA problem but it will have the potential of giving a green light to politicians in proposing other copy cat/similar policies or bills to pass in their own countries (such as Alberta, Canada) within the LGBTQIA+ Community or have unrepairable results of other global/national issues beyond what we can currently speculate. \n\nDo your part (IF ELIGIBLE) to VOTE and if you can't, that's cool, but try to start thinking of how your current states law is for LGBTQIA+ and think of survival, in other words, of alternative plans. If you are a LGBTQIA+ Youth or a Young Adult that wants to go into university or trade school, Start looking up places that will not limit your rights but can also give out federal aid or scholarships for you to attend. Check out other subreddits such as Student Loans, or your potential uni state and college to get more information beyond what you may learn online thru research. Determine if the amount of loans throughout the duration of your program (including dorms or off campus accomodations if escaping from bad living situations) is acceptable for your career paths. Don't go hundreds of thousands in debt if you not gonna see pay offs from it, and you can figure that out through other subreddits like Career Guidance, Career Advice, and potentially more.\n\nFor LGBTQIA+ Adults, IF you are capable of moving states without having to deal with financial, family obligations, work & career opportunities or other similar circumstances, then that would be suggested IF the state you live in is bad or on the verge to be down the toilet. But moving is difficult and expensive, so I suggest during a major pros/cons before doing so since it's not a decision to make easily especially if you have dependents, and others to consider within your decision but not everyone has that ability to do so unfortunately (I certainly can't for at least a few more years) and if you decide to stay in your state, do what you can to be safe that should be everyone's priority no matter what decisions they are making related to being apart of the LGBTQIA+ Community.\n\nAnyways, once again thank you Mods for creating this thread and I hope my comments can help a couple of users be motivated to vote, keep in mind their options for safety and potentially career advancement in a different state (if theirs are not good) and just overall being mindful of the current regulations without being overwhelmed until we have more concrete information as time gets closer for the November Election.",
            "We need to plan a protest on project 2025",
            "I greatly appreciate this thread.\n\nI've been heavily debating on muting and possibly leaving this sub because of all the doom posting. As a LGBT American, seeing people doom posting about shit like Project 2025 and the 2024 election does NOT fucking help me. I get sent into a panic attack and spiral every fucking time I see it, and my mom has to reassure me that things are going to be okay, because otherwise I'll just be fucked up for the next several hours.\n\nAll the doom posting in this sub has just made me want to leave because this 'Safe space' has been DESTROYING my mental health with all the '2025 is gonna kill us' shit constantly on my feed. I really hope the posts stop and are restrained to this megathread, so I can just stay here without having my psyche obliterated.\n\nThis shit has been making me contemplate suicide, and all the doom mongering about how it's gonna end our lives as we know it does NOT. FUCKING. HELP.\n\nAnd any time I try to have ANY kind of positive outlook on the situation\n\n'Trump's extremely unpopular, a lot of things would have to go through for this to happen, ect.' people have to counter it with 'But this, this, and this makes it more likely and very possible that this will happen, and then we'll all be screwed'\n\nI'M JUST TRYING TO KEEP MYSELF POSITIVE AND HAVE SOME TINY LITTLE FRACTION OF FUCKING HOPE THAT WE AREN'T GOING TO FUCKING DIE NEXT YEAR, BECAUSE IF I DON'T I'M GOING TO FUCKING KILL MYSELF UNDER ALL THIS DAMN STRESS. CAN I FUCKING HAVE THAT PLEASE?\n\nI apologize for venting but I really needed to get that off my chest. The way people are talking about this shit only makes it worse for me.",
            "I am so scared. I don't want to die. My life was just getting good...",
            "I’m terrified of project 2025 and people not realizing/caring that not voting will cause another genocide against queer people in some form. I don’t know what to do, since nobody will listens to me and everyone keeps dismissing my fears. People are outright hostile sometimes when I tell them about it too and I don’t know if it’s out of ignorance or something. I just feel kinda lost",
            "GOOD NEWS,\n\n*Minnesota bill would bar schools, and local governments from removing rainbow flags. *\n\nhttps://www.mprnews.org/story/2024/03/05/pride-flag-bill-minnesota-would-bar-schools-local-governments-from-removing-rainbow-flags",
            "Remember, you are also living in a time where LGBTQ people have more supporters than any time in Human History! And that's what's so scary to these people, they feel their time is nearing and they are panicking. \n\nThat said, and I understand if you just need to stop reading here, it is important to be aware that this is still a rough time, and probably will be for a while, as long as this continues to be a talking about for the election.   \nWe absolutely need to show up to vote, and before than we need to convince others to vote, and for those who don't care about LGBT rights they do care more about abortion, social security and medicaid, remind them what the GOP has already taken from us.   \n  \nBut I also think it's important to reiterate how important it is to have and hold onto a community or support group in real life, because you can protect each other if the worse should happen. Even if Biden wins it doesn't mean these people go away, and it's not like these people won't try again. But that doesn't mean you can't be happy or have a life, but it is important to be cautious. You are living in a bad time, it's hard, but the world is bigger than these people, and we win just by being here and with each other.",
            "Utah school board member censured after falsely calling a teen transgender announces reelection [https://www.nbcnews.com/nbc-out/out-news/natalie-cline-censured-utah-school-board-member-announces-reelection-rcna139295](https://www.nbcnews.com/nbc-out/out-news/natalie-cline-censured-utah-school-board-member-announces-reelection-rcna139295)",
            "There is a dangerous California bill being voted on monday, its called AB3080,and its KOSA level of bad.  \nIts effects would be US wide as most etch companies reside in California.  \n  \nWe need to urge Californian citizens to say \"No\" to this terrible bill when contacting their reps, as this bill equate firearms, tobacco,and LGBT+ content to pornography.\n\nYour Internet history would be tied to your ID ,that you would need to show to gain access to websites, and sadly a lot of Tech companies (Youtube, reddit, Discord,Twitter) are located in California,and who knows how they'll enforce this if it passes.\n\nPlease if you live in California, take actions HERE and voice your opposition !\n\n[https://www.defendonlineprivacy.com/ca/action.php](https://www.defendonlineprivacy.com/ca/action.php) (script is included)\n\nFind your rep here [https://findyourrep.legislature.ca.gov/](https://findyourrep.legislature.ca.gov/)\n\nYou can send faxes with Faxzero [https://faxzero.com/](https://faxzero.com/)\n\nif you don't live there, then please make posts against AB3080 (its KOSA level of bad too) Share the word,and encourage people you know live in California to call.\n\nUse the tags Ab3080 and #NoOnAB3080  \nRead more here [https://twitter.com/mikestabile/status/1786103305057493184](https://twitter.com/mikestabile/status/1786103305057493184)"
        ]
    },
    "Was denied entry to a lesbian Facebook group… ": {
        "title": "Was denied entry to a lesbian Facebook group… ",
        "score": 2199,
        "url": "https://i.redd.it/31bce4xjb08d1.jpeg",
        "content": "The admin reason was “this is a lesbian group” 🤦🏼‍♀️ other femmes out there that struggle with validity? ",
        "num_comments": 109,
        "comments": [
            "But how will they know you're a lesbian if you're not wearing flannel, a baseball cap, and cargo pants? /s",
            "On the plus side, they save you from wasting time realizing \"this is a *terrible* group.\"  Anybody gatekeeping *that* hard is going to be an insufferable jerk regardless of if they let you into their group.",
            "Do they think femme lesbians don't exist?",
            "Wait I don't understand, did they think you were lying about being lesbian??",
            "yes! I used to be “too femme” and now I’m “too androgynous” 🤦🏻‍♀️",
            "Been told the same thing once or twice. Sometimes it feels \"fake\" being a femme lesbian. *Especially* being a femme 4 femme one. \n\nIt's the same heteronormative bullshit in different clothes — there needs to be a \"man\" and a \"woman\" in a relationship. If both are femme, who are you going to call the \"man\" there? It's actually disgusting.",
            "![gif](giphy|3o7527pa7qs9kCG78A|downsized)",
            "Seems like butches are treated like they aren’t really women and femmes are treated like they aren’t really lesbians\n\nBoth stereotypes miss the whole point",
            "I had a lesbian coworker argue with me, quite angrily, when it came up in a group conversation and I said I was a lesbian. She kept saying, \"You are not!\"\n\nShe finally shut up when I said that my wife would be very surprised to hear that. \n\nMy favorite thing about that was another coworker, who was an 82 year old straight man, laughed so hard she couldn't get another word in. I miss that guy. He was the most liberal 80-something I've ever met.",
            "If its the group Im thinking of...yeah, youre better off. I lurked there for awhile and had to leave because it was just a very angry group :/"
        ]
    },
    "Does the name Natalie suit me or no": {
        "title": "Does the name Natalie suit me or no",
        "score": 473,
        "url": "https://www.reddit.com/gallery/1dlm5ks",
        "content": "",
        "num_comments": 62,
        "comments": [
            "# Please give us some time to get to your post, it has not been deleted, but it has been temporarily sent to the moderators\nfor review. Thank you for your patience.\n\nWe're looking for new volunteers to join the r/lgbt moderator team. If you want to help keep r/lgbt as a safe space for\nthe LGBTQ+ community on reddit please see here for more info:\nhttps://www.reddit.com/r/lgbt/comments/1csrb2n/rlgbt_is_looking_for_new_moderators/\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/lgbt) if you have any questions or concerns.*",
            "I think it does for sure!!",
            "I would definitely call you Nat (if you’re cool with nicknames)",
            "I think Natalie is a wonderful name! I won’t make any call on suiting you, if that’s the name you have chosen I want you to know you have my full support! Not that you need it, but if it makes you feel better. Then it worked!",
            "I'd say it does yea!",
            "Natalie? I personally don’t think so. NATALIA ON THE OTHER HAND? ABSOLUTELY PERFECT. 100%.\n\nWhen I think Natalie I think a preppy brown haired girl who wants to be voted class president. When I think Natalia I think black/dyed hair, alt, a bit rougher round the edges, killer queen, and the girl I’m seeing in these pics fits that perfectly. My vote goes to Natalia.",
            "For sure, stay strong and happy pride month 🏳️‍🌈🌈",
            "Yeah very much so!",
            "definitely!",
            "Yes!!!!"
        ]
    },
    "\"Japan's Supreme Court recognizes transgender woman as parent\". Japan's judiciary has been quite based lately": {
        "title": "\"Japan's Supreme Court recognizes transgender woman as parent\". Japan's judiciary has been quite based lately",
        "score": 296,
        "url": "https://www.japantimes.co.jp/news/2024/06/21/japan/society/post-transition-woman-parent/",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Pretty shitty when you don't think a parent is a parent. Glad they made a somewhat positive decision. But it is pathetic that it wasn't a common sense thing already. Still a let down that they didn't recognise her as a mother though.",
            "A comment from og thread:\n\n\nPlease note that this decision by the court REFUSED the transgender woman's request to be recognized as the child's \"mother\". It forced her to be recognized as the \"father\", otherwise the child would not get benefits.  \n  \nThis was not what the parent wanted, and is the default way in cases like this as Japan does not recognize same-sex marriage.\n\nSocial media is strange. Another thread about this exact case framed it as \"court refuses to recognize transgender woman as the mother\", and people were criticizing Japan as being backward.\n\nBut in this thread, they are getting praise...?",
            "Not a great thing, the court official recognized her as misgendered against her wishes",
            "Maybe someone can fill me in on this, because I was under the impression that if you want to change your gender marker in Japan you need to be unmarried and have no children under 18. The article says she changed her gender marker soon *after* the birth of her first daughter, a daughter which she was apparently recognized as the \"father\" of at that time. Did the law change at some point or what's going on here?",
            "Here’s the full article for context:\n\n“Japan's top court on Friday recognized a transgender woman as the \"father\" of her 3-year-old daughter conceived using her frozen sperm and born to her female partner after legally transitioning, in the first such ruling.\n\nScrapping a high court ruling, the Supreme Court recognized the parent-child relationship of the woman in her 40s, who was assigned male at birth and underwent gender reassignment surgery in 2018, and her second daughter, born in 2020, using sperm preserved before her transition.\n\n\"If a child cannot seek recognition because of a gender change, he or she cannot receive support as a dependent or become an heir. This is clearly contrary to the child's welfare and interests,\" the ruling said.\n\nThe Tokyo High Court ruling in August 2022 said the trans woman can only be recognized as the parent to her first daughter born before the legal gender change, but not after, resulting in different parent-child relationship statuses for the daughters.\n\nThe decision came despite both children being confirmed as biological children of the woman and her partner through DNA tests.\n\nThe woman applied for recognition as a parent of two daughters at a local government after switching from male to female in 2018 between the two births but was rejected.\n\nThe family then sought a legal remedy, filing a lawsuit with a Tokyo Family Court in 2021, but the court did not recognize the woman as a parent for both daughters.\n\nJapan does not recognize same-sex marriage. The country's law on gender dysphoria requires surgery to remove a person's reproductive capabilities to register a gender change, but a top court decision in 2023 said that was unconstitutional.”",
            "Did they get it right though? They’re recognising her as the child’s father, and not mother like she’d petitioned. \n\nIt’s better than having no legal relationship to her kids, but it still means it is impossible for Japanese kids to have more than one legal parent sharing a gender.",
            "People don't read past the headlines internet 101. Also people like Japan until they remember it's conservative.",
            "Probably a result of Japans koseki system being outdated as fuck as it still is not possible for same sex couples to be in it. Japan is one of those countries where it truly baffles me that its not legal yet to be in a queer marriage.",
            "She's still legally the child's father",
            ">The country's law on gender dysphoria requires surgery to remove a person's reproductive capabilities to register a gender change  \\[...\\]\n\nAnd that's textbook eugenics. Mind you, Finland had the same requirement until last year, much like equal marriage rights started to be rolled out, with some earlier exceptions, only around ten years ago, so it's not like Japan's that much behind countries generally seen as progressive. It's still eugenics, though."
        ]
    }
}