{
    "/unlie This is a queer safe space and hate will not be tolerated": {
        "title": "/unlie This is a queer safe space and hate will not be tolerated",
        "score": 4333,
        "url": "https://www.reddit.com/r/lies/comments/13v4ojq/unlie_this_is_a_queer_safe_space_and_hate_will/",
        "content": "While queerposting isn’t the focus of the sub, it is still allowed here (provided ur using this sub properly and lying) and being hateful/an asshole about it is not cool. \n\nThat being said if every post here is about queerness it will become annoying for people who just cant relate so I am going to ask we don’t just become solely a queer community but rather stay an accepting sub with a cool gimmick. \n\nI personally don’t think we’re at a oversaturated level of queer memes at all, i think the level is alright right now but eh thats my opinion feel free to leave a comment ill read em all.\n\nKeep it up though, you’re all pretty funny (most of you 😘)",
        "num_comments": 419,
        "comments": [
            "Can you talk to management about the leak in the break room",
            "Im asleep I cant read this",
            "Queer people should not be tolerated here",
            "You fuckers are gonna catch the gay too, I can't believe my favorite sub has devolved into liberals and pronouns. Unsubbing.",
            "/unlie thanks for saying this, means a lot (:\n\n/lie I am god and you are going to hell for posting this",
            "(Real) i just saw another mod talk about queerposting being not allowed wtf goin on \n\nr/lies civil war wooo",
            "/unlie why are people downvoting :(",
            "/unlie the fact that it has to be publicly stated here that transphobia = bad is so disappointing",
            "I viciously hate every gay, bi or trans person",
            "I hate gay people >:("
        ]
    },
    "Nintendo announced these will be Mario and Luigi's redesigns for future games": {
        "title": "Nintendo announced these will be Mario and Luigi's redesigns for future games",
        "score": 2457,
        "url": "https://i.redd.it/x1m9671mhf9d1.png",
        "content": "",
        "num_comments": 165,
        "comments": [
            "I can't believe it. They made Maria's shoes black. What an asinine decision, delete the whole series",
            "Will op lick the space between Luigis toes?",
            "/unlie OP are you ok?",
            "Maria's new color palette sucks. I missed when she had the blue streak in her hair",
            "Would you lick the space between Luigi's toes?",
            "WOKE MARIO AND THE THOUSAND GENDERS!!!",
            "W I dont have a mustache though!",
            "Those Luigi feet though... ",
            "/ul lowkey kind of a W",
            "WOKARIO? IN MY AMERICA?!?! NO! I HATE IT"
        ]
    },
    "Both excellent candidates for president. ": {
        "title": "Both excellent candidates for president. ",
        "score": 5130,
        "url": "https://i.redd.it/9jaimthecd9d1.jpeg",
        "content": "",
        "num_comments": 277,
        "comments": [
            "This isn't a lie. Paradoxes and opposites aren't allowed. \nSee Rule 1",
            "They at least look decent in this photo ngl",
            "They value the country over beating each other",
            "So glad that they didnt spend their valuable debate time planning a golf date.",
            "This is the first time this joke has been made",
            "Im unaffected by the fact that I need a senile twat in office so I can live as a woman",
            "I see a glorious future for these 2 people.",
            "Im only one voter, and there are so many other voters! I think I shouldnt vote since Im just one person",
            "/ul both suck but Biden should win",
            "As a proud U.S citizen, I absolutely love both of them <3"
        ]
    },
    "This is absolutely garbage I hate every second of it": {
        "title": "This is absolutely garbage I hate every second of it",
        "score": 2769,
        "url": "https://v.redd.it/0r7jsf15od9d1",
        "content": "",
        "num_comments": 118,
        "comments": [
            "This truly is the worst thing ever and definitely did not had me smiling for a good minute.",
            "Horrible movie\n\nI wouldnt like the name of the movie so I can hate on it even more",
            "I love that you have the link and know the video's name.",
            "Imagine liking this, couldn't be me",
            "The fact that I know Whats happening makes this even less funny",
            "I remember Hooray for Harold Lloyd, A pair of glasses & a smile.",
            "I did not see this exact Harold Loyd film in a really small local theater about a year ago. I also would hate if somebody reminded me of its title.",
            "/ul i fucking love this, how did he get his shit rocked like 4 times oml",
            "This is why slapstick is the shittiest genre of comedy",
            "this is what they did back in 94 when you were floridian"
        ]
    },
    "We should ban bobass": {
        "title": "We should ban bobass",
        "score": 428,
        "url": "https://i.redd.it/n9qf5l5dhg9d1.jpeg",
        "content": "",
        "num_comments": 17,
        "comments": [
            "But i liked bob ass :(",
            "Cant confirm, the bobass are actually my eyes, I am currently typing this out blindly",
            "The eyes are worth it >:[",
            "i dont understand why this is an issue, i love violence",
            "I dont want booba banned, I love booba. It taste so good.",
            "I was eating booba well seeing this and spit the booba out and yelled to everyone that booba should be banned I have to go to court now /j",
            "What makes bobs ass better than all the other ass?",
            "as a Jewish it only makes me wanna buy more Pepsi.\nwait...",
            "Bob does not got that gyatt",
            "OP is working for big tapioca to hide the real truth\n\nhttps://preview.redd.it/vpfp1npfkg9d1.png?width=1957&format=pjpg&auto=webp&s=6ecd04408134a841f305142af174bfab24edb0db"
        ]
    }
}