{
    "Question - bit gross": {
        "title": "Question - bit gross",
        "score": 9,
        "url": "https://www.reddit.com/r/lifehacks/comments/1dlv1nb/question_bit_gross/",
        "content": "Ok so long story short\n\nMy 15 year old had a VERY bad sickness bug yesterday. (He is fine and recovering 💙)\n\nI will spare you the details but my shower is VERY blocked.\n\nI have tried Bicarb, vinegar, bleach, rubber gloves and the manual method 🥲, a very strong drain unblocker and no joy. \n\nWhat are your tried and tested home remedies that might break this down and unblock. \n\nI'm desperate. I need to shower my kid and myself.\n\nApplied fake tan yesterday and I can't  shower it off so I'm a sweaty, over tanned mess.\n\nHelp me 🫠🥲",
        "num_comments": 10,
        "comments": [
            "Pour a little boiling water into the drain and take your toilet plunger to it!\n\nIf that doesn’t work, head to your hardware store for a snake.",
            "bicarb, dish detergent and boiled water let it sit",
            "I've had stubborn clogs before and no joke, I used the toilet plunger on the shower drain to loosen things up!",
            "Just neet a plunger. All the chemicals never work well if at all. Run some warm water into the drain / shower pan and go to town, should clear pretty easily.\n\nMy go to for drains/sinks is this style\n\n[https://www.andersonlumbercompany.com/shop/plumbing-supplies/drain-openers-and-septic-tank-treatments/air-and-water-pressure-drain-openers/plunger/do-it-rubber-duo-flush-5-78-toilet-plunger?SKU=415722](https://www.andersonlumbercompany.com/shop/plumbing-supplies/drain-openers-and-septic-tank-treatments/air-and-water-pressure-drain-openers/plunger/do-it-rubber-duo-flush-5-78-toilet-plunger?SKU=415722)\n\nThat pokey outey bit will fold up into the plunger head and give you an awesome seal around the drain but honestly whatever you have on hand will work fine.\n\nedit: No idea about the brand or website, I just googled images of plungers to find my favourite style.",
            "Lye",
            "Help an Australian out. I’m in my 50s and no one in my family has ever owned or needed to own a plunger. What is up with (what largely appears to be) North American plumbing that you all have toilet plungers?",
            "This is a really great question and I'd love to know the answer!",
            "Best advice on here! It worked in my shower. I went to one of the dollar stores and bought an \"old fashioned\" plunger because my newer one wasn't wide enough to completely cover my shower drain opening. Fixed my shower for $1.00.",
            "And little liquid dish soap right before the boiling water",
            "Nothing so much as barfing lets chunks get stuck in drains. I never needed one until I moved into this house that sat vacant for two years, either. My friends didn't use strainers in the kitchen so chunks of hot dogs etc got in. One guest drained hamburger grease from the pan directly in the sink, too. (They were young so didn't know not having a macerator in thrbdrain needed to be treated different.)  I needed drain cleaners and a plunger now and then after that combo of petrified old hair and food plus new gross mistreatment."
        ]
    },
    "Use your dryer to off-gas new soft things.": {
        "title": "Use your dryer to off-gas new soft things.",
        "score": 109,
        "url": "https://www.reddit.com/r/lifehacks/comments/1dlfleq/use_your_dryer_to_offgas_new_soft_things/",
        "content": "Preface: the only definite about this is your dryer must be on **no heat** setting. You're not tryin to melt anything. \n\nYour clothes dryer is basically a big tumbly gentle vacuum that vents directly outside. So if you have a new item that's soft and smelling too plastic-y, you can tumble it with **no heat** for as long as you want to get air moved through/around it without all the off-gas just hanging out in your house. You can do it for mattress covers, pet beds, curtains, rugs, pillows, and probably a bunch of other things. \n\nA no heat tumble also can help get excess hair off of things you want to wash! Before I wash curtains or pet beds I give em 30 minutes or so to tumble and get loose hair/dust off so it doesn't clog up my washer.",
        "num_comments": 13,
        "comments": [
            "Oh this is a good tip.  I just toss new stuff in the washer.\n\nUnrelated:  just want to warn you that you will be inundated with comments saying “why are you washing new clothes.”  I hope you are mentally and emotionally prepared for this.",
            "When u clean your washing machine u become the washing machine",
            "This tip is useful for those with a nose of a bloodhound\n\n\nIdek what smells you could be describing on new items 🤣 they dont smell like anything",
            "wtf kind of dryer uses vacuum technology ?",
            "I wash new clothes. But I am weirded out that OP puts dirty things in the dryer before the washer. Now the dryer is kinda dirty....",
            "[deleted]",
            "If you buy rugs or other textiles on Amazon they often have a strong plastic smell. Not sure if it’s from manufacturing or from the vacuum bags they ship in from overseas, but sometimes the smell is pretty strong.",
            "Well, if you just tumble around wet stuff with hot air, how do you think the moisture goes away? Surely you don't think it just recirculates damp hot air?",
            "Yeah, I was thinking you might want to clean out your dryer afterwards.",
            "Yeah, especially if you have sensitive skin like me.  The sizing spray manufacturers use to keep shirts looking good in stores itches my skin.  So I run everything through the wash with some tide free and gentle first.  But if you don’t have this problem, maybe you don’t need to.  No judgments.🙃"
        ]
    },
    "Effortlessly Clean Your Microwave with Lemon Water!": {
        "title": "Effortlessly Clean Your Microwave with Lemon Water!",
        "score": 241,
        "url": "https://www.reddit.com/r/lifehacks/comments/1dl6u0f/effortlessly_clean_your_microwave_with_lemon_water/",
        "content": "Hey everyone! I recently discovered an incredibly simple yet effective hack for cleaning your microwave, and I just had to share it with you all.**What you'll need:**\n\n* 1 lemon\n* 1 cup of water\n* Microwave-safe bowl\n\n**Steps:**\n\n1. Cut the lemon in half and squeeze the juice into the bowl of water.\n2. Drop the lemon halves into the bowl as well.\n3. Place the bowl in the microwave and heat on high for 3-5 minutes. The water should boil and the microwave should be steamy.\n4. Let it sit for a couple of minutes to cool down slightly.\n5. Carefully remove the bowl and wipe down the inside of the microwave with a damp cloth or sponge. The steam will have loosened any food splatters and the lemon will leave a fresh scent.\n\nThis hack has made microwave cleaning so much easier for me. Give it a try and let me know how it works for you!",
        "num_comments": 42,
        "comments": [
            "Cup of vinegar does the same with less effort",
            "Wow, this actually worked! I had some stubborn stains that wouldn't come off no matter what I tried. The steam trick is genius. Thanks for sharing!",
            "Nice! Thanks for sharing!\n\nThen pour the water and push the lemon halves down the sink with the disposal. Run hot water and turn on the disposal until it's all gone. Voila! Clean disposal. \n\nTwo for one.",
            "Tbh i just use water with .. just water. it's worked fine for years.\n\nand you dont need to buy a lemon. (i dont like lemons)",
            "Nice one. Does it work on ovens?",
            "I just microwave a wet paper towel for a min then use that to wipe it down after. Works great",
            "Life hack? Man this is literally written in the how to clean your microwave bit in the instructions manual.",
            "I’ve done it with just water, just don’t use a Pyrex glass measuring cup…",
            "Wait! We're supposed to 'clean' them??",
            "Thanks!"
        ]
    },
    "Use lint to clean your lint trap. ": {
        "title": "Use lint to clean your lint trap. ",
        "score": 47,
        "url": "https://www.reddit.com/r/lifehacks/comments/1dlfugx/use_lint_to_clean_your_lint_trap/",
        "content": "Ever have pieces of lint left on the lint trap? Use the lint that you’ve removed to easily remove the rest of the lint. \n\n",
        "num_comments": 24,
        "comments": [
            "Does everybody not already do this?",
            "The bar for this sub is so low.",
            "I just lick it like a cat. 👍",
            "I’ll go one better, use the anti static softener sheets you put in with your wet laundry. Does the trick as it attracts all the lint and dust and not so much dust flies back at you",
            "I thought people just kind of did that.",
            "When there is only a thin layer of lint I use an old drier sheet to get it started",
            "Have you been picking the lint off piece by piece up til now? It’s one motion lol",
            "So this is not really a great comment. To clean out lint properly you should get a vacuum cleaner or a blower, because there's generally a lot more lint in the vents that take it outside. \n\nOne time my wife and I even just pulled the dryer out and took the back off and cleaned it out because even a small hole in something will let out a crap ton of lint and it's a fire hazard",
            "In other news, lint sticks to lint, tape sticks to tape, and marshmallows stick to other marshmallows.\n\nThose damn mini marshmallows.",
            "In order to see in the dark, use a light."
        ]
    },
    "How to remove a ring that is stuck on your finger.": {
        "title": "How to remove a ring that is stuck on your finger.",
        "score": 2940,
        "url": "https://v.redd.it/vk8byhp6qp7d1",
        "content": "",
        "num_comments": 99,
        "comments": [
            "See this A LOT these days and I can confirm 100% it does NOT work all the time.  Depends on how \"stuck\" the ring actually is.  Sometimes this can make it worse as the string can become lodged between the ring and the finger and put even more pressure on it.  Nice when it works but you're almost always better off using lubricant of some kind. (cooking oil, dish soap, etc.)  Worst case, it gets cut off.",
            "If I may; I would like to make a PSA:  \nSoft materials are ideal for rings, silicone, wood, copper, silver, gold etc. But hard stuff should be a no go such as: steel; titanium; tungsten, etc. I will say, I've *never* had a patient with a stuck silicone ring\n\nIf you wear rings and get that finger caught in something such as accidently closing the car door on it, first wring your hand and scream, then look at it, then maybe suck on the finger a little, but most importantly; go ahead and take your ring(s) off.\n\nIf you get a cut on your fingers and you notice even a *hint* of pink redness or tenderness; remove the ring(s)\n\nI'd really recommend taking rings off to sleep, but that's just because I'm a bit of a cautious person.  \n\n\nAll the ring cutters I've used are made for soft metal. There have been rings that took multiple cutters to cut because the first cutter broke. I've seen rings we couldn't cut, please be aware that stuck rings can be very dangerous.   \n  \nI'll get off my soapbox now, I just want you all to live happy healthy lives!",
            "So how did they get the small thread through in the first place?",
            "An actual life hack? In this economy?",
            "Tried this. I ended up in the ER with a very swollen finger and a Cartier wedding ring in pieces.",
            "I feel like if you could do this without doing serious damage to your finger the ring isn't *that* suck.",
            "As someone who had to bring my spouse to a firefighter station, that only works if the finger isn't too swollen - we tried every \"hack\" for 2 hours but then reddit saved me by mentioning that fire station is the way to go. \n\nThey cut the ring for free, and we brought them pastries in the morning instead of paying 2k for the emergency room visit...",
            "Windex actually works really great for rings stuck on a mild to moderately swollen finger.",
            "When my ring was stuck I literally just used lube, came right off",
            "An alternative way would be to just drop some soap on the ring to ease surface friction and then you can usually just pull it off with a twisting motion"
        ]
    }
}