{
    "How to Firm up Memory Foam Mattress?": {
        "title": "How to Firm up Memory Foam Mattress?",
        "score": 22,
        "url": "https://www.reddit.com/r/lifehacks/comments/1dr3dxg/how_to_firm_up_memory_foam_mattress/",
        "content": "I'm stuck having to sleep on a memory foam mattress at my mom's house (I'm her caregiver). The problem is that when it's warm out, the mattress gets mushy and hot, sagging under my body. I have a disorder called hypermobile Ehlers-Danlos syndrome and suffer from joints that easily dislocate. I'm a side sleeper so when the mattress sags, my hip and shoulder joints get crushed, causing immense pain. I've barely gotten any sleep lately. I can't afford to buy a new mattress or even a topper right now. So is there anything I can do to fix the mattress so it stays firmer?\n\nEdit - thanks for all the suggestions! I'm going to try some out today. ",
        "num_comments": 31,
        "comments": [
            "Would it help if you put a piece of pluwood sheet under it?",
            "Memory foam is hell. Maybe try a buy nothing facebook group for your area? Someone gave away a new Purple mattress in my town last week!",
            "Look online for people giving away old mattresses for free?\n\nPeople are grossed out by a second hand mattress, so they usually are free. But sleep fine in hotel beds, so it's more of a mental problem than that they are actually that dirty.",
            "I couldn’t find anything and had to spring for a new firm mattress. \n\nAsk your friends and family if anyone is willing to switch mattresses? Some people like memory foam (I f’ing hate it).",
            "Put a blanket doubled up between the mattress and the under sheet then hold it together with the top sheet. It makes the surface of the memory foam a little firmer.",
            "I am sleeping on one, too. I hear ya! I alternate between my head being on one end, then the other. Also, rotate the mattress occasionally so you aren’t always sleeping in the same spot. \n\nI can imagine you need a good night’s sleep after taking care of your mother all day. Good luck!",
            "You can get a firmer topper, they're decent",
            "We got a topper when our memory foam mattress got uncomfortable.",
            "Cut out the memory foam.  Do a test first to see what is underneath it.  My guess is that the memory foam is just sewn on top of a regular mattress and a slit at one end would let your remove the foam.   There might even be a seam you can open by snipping some threads.",
            "I actually did that and it does help a little."
        ]
    },
    "Question: what do you do with clothes that you've worn, but aren't dirty enough to put in the hamper?": {
        "title": "Question: what do you do with clothes that you've worn, but aren't dirty enough to put in the hamper?",
        "score": 366,
        "url": "https://www.reddit.com/r/lifehacks/comments/1dq35ma/question_what_do_you_do_with_clothes_that_youve/",
        "content": "I'm looking for any best practices to help me be neater.  I typically hang them on hooks on the door (or over a chair) until \nI can wear them again, but I'm hoping that someone has a more effective and neater way.  Thanks in advance!",
        "num_comments": 617,
        "comments": [
            "They go on \"the chair\"",
            "Hang it on a hanger, but reverse the direction of the hook so you know it's been worn. Assuming all your clean clothes have the hooks facing the same way in the first place.",
            "It depends on the item. Something like a dress or nice sweater I've only worn for a couple hours and will be fine to wear again? I'll hang in the closet again. Something like a sweatshirt/hoodie or pair of leggings I just wore around the house? I have a second hamper for lightly worn stuff that's much smaller than my dirty clothes hamper. I don't usually keep more than 3-5 things in there. If it gets full, and I haven't worn any of the clothes in there again, I'll wash them and put them away.",
            "In the past, I have organized my closet by worn and not-worn, with a gap in between them since there is a bit of body oils and whatnot on the worn clothes.\n\nNowadays, I have a multi-arm swiveling towel hanger mounted to the wall behind my bedroom door (which stays open except when I go to bed at night). It keeps everything off the floor and furniture, lets me keep whole outfits together on one arm, and is hidden. It can hold a lot of clothes.",
            "Hang it on the treadmill. Most expensive clothesline I ever bought.",
            "Throw them on the floor until.they are dirty enouhn to.watch or clean options have dimished so standards are.lower.",
            "I have a towel ladder and use that.",
            "if they're considered clean enough to wear again then they're clean enough to go back into the drawer/closet \n\nI don't have \"the chair\" or any other holding space",
            "If it's clean enough to wear again, it's clean enough to get folded & go back in the drawer. I will die on this hill & it has helped me keep a MUCH cleaner room.\n\n(BTW, if I was honest with myself, it wasn't that the clothes seemed too dirty to go back as much as it was I just didn't feel like folding them & putting them back.)",
            "I prefer hooks. I wfh so my casual wear can handle a few days before needing a wash. Day bottoms turn into pjs for a few nights. Shirts I only put on for an on camera meeting can be put back on the hangers.   I have a 5-hook towel rack on the wall in my closet for the undecided items."
        ]
    },
    "Adulting Life Hacks?": {
        "title": "Adulting Life Hacks?",
        "score": 1107,
        "url": "https://www.reddit.com/r/lifehacks/comments/1dpt11q/adulting_life_hacks/",
        "content": "I have a kid turning 18. What can I do for her to set her up for success (Aka 'Adulting')?\n\nI've already set her up with:\n✅️401K w her pt job at 5%\n✅️Checking Account and debit card\n✅️Savings account for Emergency Fund\n✅️How to Budget\n✅️How to call and make appts w Dr.\n✅️Avoiding Scams and MLMs\n\nI'm Gen X, we had to figure this all out on our own. I'm not a helicopter/bulldozer parent but would like to get her a step ahead from all the dumb-dumbs of the world.\nWhat are some of your suggestions based on the life you lived so far?",
        "num_comments": 414,
        "comments": [
            "Teach her to plan meals, shop for them, and cook them. So many younger people seem to rely on food delivery for most of their meals and that’s so expensive.",
            "Best thing to do to set up a kid for success is to normalize failure; let them not be afraid to fail and learn.",
            "Don’t make permanent decisions based on temporary friendships. Friends/ acquaintances will come and go; you will be with yourself forever.",
            "Add them as an authorized user on your oldest credit card. That will share all of your good payment history into their credit report and it will set them up for a solid credit score. Only do this if you have an account with no late payments and low utilization.",
            "Routines! I’m working on building them into my day to make things easier and it’s hard to get started at 37! Maybe setting up a cleaning routine or a self-care routine.",
            "How to be poor - it’s a mindset, really. Getting joy from repurposing, frugal life keeping, having fun for free. How to not let your financial standing impact your self worth or the worth of your community. How to give back when you don’t have much. How to live without a safety net (this is the US, after all).\n\nMost of us will slip into a lower economic class at some point, from recession, pandemic, personal issues, etc. It can be a real blow to self-esteem, and get us stuck in a downward spiral. Learning to live in the struggle and find the small victories, how to resist a bailout from the Bank of Mom and Dad, they build character and fond memories.",
            "if you set up all the things you mentioned, walk her through all of it and why you chose to do each thing. Figuring out medical insurance and 401k at my first job was miserable because I didn’t know the why behind choosing certain plans.",
            "You have given them most of the important stuff already. I would add that credit cards are useful tools but you **must** pay the full balance every single month or the interest will *bury* you.",
            "As a person who was never taught by my parents how to handle adulting I appreciate you wanting the best for your child to succeed and be as comfortable as possible!",
            "Set them up with a medical kit... benadryl, hydrocortisone, peroxide, alcohol. Bandaids, neosporin, tummy meds... trip to the ER will cost you so teach when to self help and when to seek help"
        ]
    },
    "In-house vacuum system losing suck": {
        "title": "In-house vacuum system losing suck",
        "score": 10,
        "url": "https://www.reddit.com/r/lifehacks/comments/1dpzr9i/inhouse_vacuum_system_losing_suck/",
        "content": "The waste container is clean, outlet gaskets are sealed and the motor sounds fine, but the sucking power has diminished noticeably over the last year or so. \nIs there a way to clean out the pipes/tubes to be sure there’s nothing blocking?",
        "num_comments": 19,
        "comments": [
            "Cover all the inlets/outlets with bags... run it in reverse/ blow with another blower. See which doesn't move or what comes out.",
            "Does the filter need to be cleaned or replaced?",
            "Is there a filter somewhere along the way that needs to be replaced?",
            "Tape all the outlets down and go to each one, untape, blow with leaf blower, retape. You don't want to blow back into your house testing them all at the same time, but one by one *out* so that you don't accidentally blow the bags off (or all of them) and end up with dust and debris all over your house. And, this way all the debris ends up where it should: the waste container.",
            "Could be a leak rather than a blockage.",
            "Thanks for the great ideas. I think taping all but one port shut and using a blower might work. Sucking a rope connected to a round brush is also a terrific idea.",
            "Behind the wheel that spends and picks up check behind it with your finger there's a hole it maybe has something stuck in there make sure it is not plugged up while doing so don't want vacuum accident turning on.",
            "clean the hepa filter in it, that's  your culprit",
            "Life hack for every appliance:  do maintenance.",
            "Did you take out your Suck It, and you Suck It?"
        ]
    },
    "Haircut Issue": {
        "title": "Haircut Issue",
        "score": 9,
        "url": "https://www.reddit.com/r/lifehacks/comments/1dptuad/haircut_issue/",
        "content": "Every time I get a haircut, it looks great...that is until I wash it. then it looks crappy. Is there any way I can retain the look, or have the barber do something different to keep the cut looking good? ",
        "num_comments": 22,
        "comments": [
            "Ask them to show exactly how they style it and buy the products that they use.",
            "Ask them how to style it, and be prepared tp learn about some products,\nOr ask them for an easy care cut that is wash and go.",
            "I tell my stylist that I require a “wash and shake” style. Like the dog. I will not style, straighten, curl or spritz.",
            "If you are comfortable learning to style your hair with products, ask the barber to teach you how to do so, and be prepared to tip generously for their time and assistance.\n\nIf you want something that doesn’t require  styling and products, tell the barber that you need a cut that will look good without styling or products.",
            "Be honest with your hairstylist about what you are and are not willing to do to style your hair.  A skilled stylist will suggest cuts that meet your needs.  \n\nAll I do is wash and blow dry.  I’m not willing to mess with flat irons or curlers, so I ask my stylist to give me a cut that’s great for wash and go.  Yes, I pay more for a simple cut (US$80 including tip) than is strictly necessary, but it doesn’t look bad with no styling and grows out well.",
            "My barber preaches this: practice, product, and patience",
            "What did your barber say when you told him you couldn't maintain the look after the first wash? You are not alone in this and they should be able to help you.",
            "I had a hairdresser who said if he had a customer who could not maintain the style, he considered it his failure.  Find a hairdresser with this philosophy.",
            "Problem is your barber. Hair should be wet after the cut to finish styling. It's combed sideways and then to style to get loose ends out as you style it. Cut hair myself for years. If you style the hair you should just tell the client how to style it if it's something new to them and you drastically altered the original cut.",
            "I used to think the same about my hair till I noticed the one big difference...the barber would blow dry my hair and I was towel drying. You can shape your hair while blow drying. Not sure if this applies to you."
        ]
    }
}