{
    "LPT Reverse image search photos of people you're talking with to avoid being catfished": {
        "title": "LPT Reverse image search photos of people you're talking with to avoid being catfished",
        "score": 512,
        "url": "https://www.reddit.com/r/LifeProTips/comments/1dr1kib/lpt_reverse_image_search_photos_of_people_youre/",
        "content": "",
        "num_comments": 32,
        "comments": [
            "This used to work well but now you can just generate unique pictures with AI.",
            "Hasn't Google limited the reach of people faces being reverse searched?",
            "I get random LinkedIn connection requests, and the latest scammer was not good at their job. The profile photo turned out to be a singer from Hong Kong. It's normal to get a fake photo, but what was funny about this scammer's attempt was that their \"About\" text was a total rip off of someone else's, and they forgot to take out that other person's name.",
            "Also Google the number they give you and make sure it matches the name",
            "How? What free website? Can't find any anywhere",
            "I've been doing this for years, ever since I discovered Tineye way back in the day. Any friend request on FB that I'd get that looked suspicious, but the profile seemed legit would get the treatment. Now it's never been easier to tell the fake ones. I got at least a dozen fake requests over the last month or so and every one of them mentioned crypto at some point",
            "Anyone can write it in other words, I did not get it.",
            "Pimeyes is the new GOAT",
            "I never thought of using a reverse image search to search for images in reverse. Pro-pro tip.",
            "can confirm, I sometimes browse escort ads for fun, and sometimes I will be curious to see which influencer they steal pictures from.   it's now almost impossible to return a result compare to 4 or 5 years ago.  \n\nBasically, it's way harder to determine if you are going to be disappointed.  (or easier, just assume you are always going to be disappointed )"
        ]
    },
    "LPT When you are showing someone a picture on your phone, you can zoom in a little so they don't mistakenly swipe to the next pic": {
        "title": "LPT When you are showing someone a picture on your phone, you can zoom in a little so they don't mistakenly swipe to the next pic",
        "score": 334,
        "url": "https://www.reddit.com/r/LifeProTips/comments/1dr1jxv/lpt_when_you_are_showing_someone_a_picture_on/",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Show them the picture but never give away your phone or camera",
            "When zoomed in, iPhone users can still swipe left or right to next picture.",
            "that's why i always hold on to my phone a little in case they tried to swipe and then i can just snatch it away!",
            "Not on every phone, try first",
            "Nah, they zoom in and zoom out and accidentally swiped",
            "Better yet, put all your risque photos in a Secure Folder. I know this is available in most Android phones.",
            "LPT when showing a picture on your iPhone you can have set up guided access already so the touch screen and side buttons are all disabled and then they can’t do anything at all and the phone won’t lock, and then double tapping and Face ID to resume access.",
            "What is it all you people have on your phone that you're so afraid for people to see? Seriously. Is your gallery full of  dick pics or something?",
            "This has been posted ad NAUSEUM. Try harder.",
            "Real LPT: Dont hand someone your phone if all it takes is a swipe to uncover a risky pic... really cmon.."
        ]
    },
    "LPT Using a Credit Card Properly": {
        "title": "LPT Using a Credit Card Properly",
        "score": 72,
        "url": "https://www.reddit.com/r/LifeProTips/comments/1dr90ss/lpt_using_a_credit_card_properly/",
        "content": "If you're eligible and you can control yourself...\n\nLiterally just use a credit card for:\n- Perks\n- Payments Protection (Fraud/Scams/Faults etc)\n- Free money\n- Credit Score\n\nLet me explain all of these above:\n\n- Perks can include insurance, Cashback, status upgrades for hotels, car rentals, exclusive events etc\n\n- Payments Protection in many countries since you pay with credit, it isn't your money, if you get scammed in many cases the financier (the CC company) will get the money back for you worry free\n\n- Free money, many CC companies offer Cashback as one route to this but others offer a points based system which is often better. Many people map out plans to maximize points and use it for hotel stays, flights, holidays in general or credit against your statement\n\n- Credit Score, cannot be understated and is probably the best part (for me as a peasant) using a credit card. If you can pay off on time, in full, never borrowing you do not pay interest at all. Don't spend more than you can afford and you will build your credit score. Paying with your bank card does not have the same effect, in fact none at all since you're not borrowing. Great for mortgages or loans if needed in future (better rates since you're lower risk)\n\nThis LPT was prompted because I saw many people complaining that their bank won't chargeback fraud transactions.\n\nNobody ever told me this. In fact when I was young the notion was to avoid credit.",
        "num_comments": 35,
        "comments": [
            "I don’t know why anyone wouldn’t use a credit card for all the reasons you’ve mentioned… depending on the card you can literally get 1-5% cash back on most purchases. Pay your balance every month! It’s literally free money.",
            "Do you think the cash back outweighs the annual fee?",
            "This is nothing new to me. I always have the money in the bank for everything I charge. I pay my CC twice a month for things I charge. I never pay interest. I take advantage of cash back deals. The CC pays me, I don’t pay them. Just be responsible!",
            "Do we have a credit score in Europe? I have only ever heard about it in the US.",
            "dont call your bank call VISA or mastercard for charge backs, READ THE CONDITIONS OF THE CARDS YOU HAVE",
            "I would say never spend more than your savings on a CC. You should always have enough banked to pay it off.",
            "The problem starts when people start to think of the actual credit as free money and buy things they can’t afford themselves and snow ball into more and more debt.",
            "Free money and fraud protection, honestly I'll take it lol. Just have to be grown up about managing your finances is the trouble.",
            "I have friends who are married and do well financially but refuse to get a credit card. I’m sure they would not go crazy and be able to pay it off every month, so it boggles me why they are passing on all the rewards. Even for a card with no annual fee, there is no downside.",
            "Totally agree. It's hard at first to resist but as soon as you keep checking against your bank as usual it's fine imo."
        ]
    },
    "LPT You can keep chips, crackers, and pretzels in the freezer, and they'll pretty much never get stale.": {
        "title": "LPT You can keep chips, crackers, and pretzels in the freezer, and they'll pretty much never get stale.",
        "score": 1351,
        "url": "https://www.reddit.com/r/LifeProTips/comments/1dqq5b1/lpt_you_can_keep_chips_crackers_and_pretzels_in/",
        "content": "I'm currently eating the last of some bagged pretzels we've had in the freezer for a year. We opened the bag a year ago, and just keep it closed in the freezer, but pull out pretzels as we want them. They're always fresh, and they don't need to be thawed because they're so thin. They become room temperature within a few seconds.",
        "num_comments": 95,
        "comments": [
            "\nA buddy recommended we keep crunchy cheetos in the freezer because the cold temperature enhances the taste and holy shit he was right",
            "You can also put stale chips/crackers/pretzels in the microwave, oven, or air fryer to get rid of the moisture and it will make them crispy again.",
            "It’s sweet that you think I’d ever have left over chips/crackers/pretzels.",
            "You can also keep your box of Kosher salt in the fridge and never will the grains stick together",
            "We do a lot of meal prep and I cannot imagine having space in my freezers for something like this.  On the other hand, if you buy some chips today and freeze them, if chip prices keep headed the way they've been around me maybe you can sell them \"like new\" in a year and make like a $1000 bucks.",
            "Also you can crisp up your crackers and chips in your air fryer.",
            "Good to know but I can’t think of a situation yet where I’m like - dang - wish I had some pretzels in the freezer lol",
            "If you are going to do this, or keep bread in the freezer, try to double bag it to prevent freezer flavor from getting it.  We keep the bags that sliced bread comes in in a drawer after use.  Then when we want to freeze some bread product we put the whole bag inside the old bread bag and tie it off with a twist tie.  \n\nFreezer flavor gets on the outside bag and the inside stays nice.  After the inner bag is used up, just discard both bags.",
            "Also an excellent tip for ice cream.",
            "Who actually has chips last long enough to go stale? Open the family size bag and finish it all on your own in one sitting like a normal person....."
        ]
    },
    "LPT  Don't let brass and aluminum hose fittings remain connected for too long. Galvanic corrosion will weld them together permanently.": {
        "title": "LPT  Don't let brass and aluminum hose fittings remain connected for too long. Galvanic corrosion will weld them together permanently.",
        "score": 323,
        "url": "https://www.reddit.com/r/LifeProTips/comments/1dqya9e/lpt_dont_let_brass_and_aluminum_hose_fittings/",
        "content": "It's best practice to use hose fittings of the same metal, but if you do mate brass and aluminum, make sure to disconnect them after use.",
        "num_comments": 29,
        "comments": [
            "Been there. Those two could not be separated. Had to replace the spigot on the house.",
            "Same deal: Don't leave an aluminum seat post in a steal bike. You need to take it out and grease it at least once a year.",
            "This ad brought to you by Herman’s hose pipery and fittings repair.",
            "This galvanic corrosion  is absolutely a known thing for actual permanent plumbing fittings (always use a dielectric fitting!). I didn’t realize that such \nNon-permanent items as garden fittings would be subject to this long enough to make a difference within their lifespan. TIL.",
            "I’ve not seen aluminium hose fittings (assuming you mean garden hose), but it’s a good tip that I was unaware of. Most fittings here are plastic, although the brass ones are more durable",
            "Aw. I guess it'a what happened to my router bit...",
            "Use copper anti seize on hose fittings.",
            "Once we had a trigger spray nozzle that seemed very robust. But inside it was a steel spring, around a brass rod, in an aluminum housing.\n\nThat spring didn't stand a chance.",
            "Or, wrap Teflon tape around the male threads to prevent galvanic corrosion",
            "Even if you put Teflon on it?"
        ]
    }
}