{
    "Please do not delete your posts in this subreddit": {
        "title": "Please do not delete your posts in this subreddit",
        "score": 2223,
        "url": "https://www.reddit.com/r/linuxquestions/comments/ou5cma/please_do_not_delete_your_posts_in_this_subreddit/",
        "content": "I try to help people often with their technical issues in this subreddit.  It feels good to help.  I also know I'm not just helping that person, but anyone else that may run across it in the future from a search.\n\nBut often, the questions are deleted by the OP, leaving me disappointed and frustrated.  I'm less and less motivated to help as it happens.\n\nPlease.  Give back in the most minimal way possible to this subreddit, and avoid deleting your posts if they've been upvoted and answered.\n\n(I'm not a mod, btw)",
        "num_comments": 245,
        "comments": [
            "I not only keep my posts, I actually make the title as if I were googling it, so it shows up for others when they Google a similar issue.",
            "Deleting a post is even worse than the guys that tell you “search for it, it’s everywhere.” When in fact that very post was the first result in your search. It’s just not helpful what so ever in both cases.",
            "What bugs me. People need help to switch to Linux. We all give them the best help we can. But I never see that OP come back with a specific Linux question afterwards. Like did they ever go through with it or their good on their own. It's like we are wasting our breath, trying to get Windows user to become Linux users.",
            "and until they heed your advice you should archive those threads on archive.today hopefully some search engine will start indexing that too",
            "I'll never understand why people just remove this kind of post. If there's some leaked info or something, you could always just edit it.",
            "The mods should add this as a rule.",
            "Time to delete posts from here.\n\nThe moderators have lost the battle and the war.",
            "I often google \" 'linux question' + reddit\" and find things here. its nice to get my reddit answers + w/e google throws my way.",
            "Would it be feasible to add a Reddit bot that copy-and-pastes the OP post as a comment, while censoring any usernames?",
            "There are cehtainly times when I have to ask Reddit to find what to search for, or to filter the varied results that I have gotten. Like you said, having other threads to go through can easily be the difference between finding lore vs having to ask the same question for the umpteenth time for myself."
        ]
    },
    "Which Distro should you choose? Ask in this thread": {
        "title": "Which Distro should you choose? Ask in this thread",
        "score": 19,
        "url": "https://www.reddit.com/r/linuxquestions/comments/1dfozjj/which_distro_should_you_choose_ask_in_this_thread/",
        "content": "To prevent having multiple daily threads repeating variations on this same question, we are asking everyone seeking help in choosing a distribution to ask in this thread, or at  r/DistroHopping or r/FindMeALinuxDistro. \n\nEach response to this post should be a question asking for assistance. Each comment in reply to those should be helpful. All other comments will be removed.",
        "num_comments": 68,
        "comments": [
            "hi im looking for a good distro for gaming on a modern pc. i really like hyprland so its instantly locked to a few distros. i also use fedora for school already but im not sure if its good for gaming. so fedora, nixos or a arch distro?  \nor are there completely other distros i could consider?",
            "I'm using ubuntu right now i was wondering if there was anything else better for performance and gaming and that stuff or should i stay with ubuntu.",
            "Hi I'm looking for a distro that's able to run pretty much any windows apps and works similar to the steam deck (almost everything working fine and polished and pretty much everything just ''works'') Thanks in advance.\n\nI mainly use Adobe software and Clip Studio Paint + steam games",
            "hi i have a lenovo ideapad 114igl05 that i use for school work and very very light gaming (risk of rain 1) what would be a distro thats light  to put on it to replace windows 11 as i already know it will begin to slow down",
            "A friend of mine has an Intel Celeron N3010 Dual Core 1.04 GHz notebook, with 4GB of RAM and a 32GB SSD. I tried installing Lubuntu 24.04, but it ran significantly slower than Windows 10. However, Windows 10 takes over half of the SSD.\n\nI'll be trying a minimal NixOS install with XFCE. Does anyone have more distro and desktop environment suggestions?",
            "Which distro should I choose?",
            "With the release of Plasma 6.1, which I am yet to try, are there now any DE's that fully intergrate all apps with cohesive uniform window borders, font, operation, scaling etc? Or are we still at the piecemeal stage where some Flatpaks, Snaps, native packages etc still look and operate as if they are emulated or feel like foreign entities?  If the latter are we ever going to see a cohesive DE?",
            "Which distro should I choose.",
            "I havent logged onto Linux in months but my go to is Garuda.",
            "What Linux Distro should I use for a Dell Inspiron 5368 with i7-6500U with 16gb of ram?"
        ]
    },
    "Why does everyone seem to be so opposed to immutability and atomic updates?": {
        "title": "Why does everyone seem to be so opposed to immutability and atomic updates?",
        "score": 18,
        "url": "https://www.reddit.com/r/linuxquestions/comments/1dr4rhw/why_does_everyone_seem_to_be_so_opposed_to/",
        "content": "Hello!\n\nI’ve been daily driving Linux for about 4 months now (Arch, btw) and learning a lot of new concepts. Ones that peaked my interest were immutability and atomic updates. So much so I had decided that my next distro will be something like openSUSE Kalpa or Arkane Linux, unless I figure out a way to setup Arch itself to be immutable and have atomic updates.\n\nAt least for me personally, I see no downside to the safety and robustness these concepts introduce. A minimal, practically unkillable base OS which is built with containers in mind to improve the overall robustness? Hell yeah!\n\nHowever, when I ask about these, I often get comments like \"rolling release and atomic updates are incompatible\", \"back to the wiki, stop imposing on others\", \"this is gonna be a painful experience\".\n\nSo, I genuinely wonder, is there an aspect to these concepts that I don’t know yet that ruins them to the core? Do I not understand something? Thanks.",
        "num_comments": 57,
        "comments": [
            "I don't think 'everyone seems so opposed to immutability and atomic updates'\n\nWhere's this from?",
            "Rolling release and atomic updates are very much compatible.\n\nThat said, I hope that Arch never does this. You are welcome to create your own Arch or Fedora based distribution though.",
            "It's another layer of complexity for something I don't need. The complexity is the downside. That's why I personally don't like (for lack of a better word) or use them.\nFor you though, I don't think there's something fundamental you wouldn't understand, since the concept seems not too complicated. No idea what people would mean with \"imposing on others\", but it could be another irrationally negative response to something you see on Reddit occasionally. I doubt you need to try and find some kind of hidden meaning here, if it works for you, please just use it. Why not save time and work? Ignore the negative comments.",
            "I use it. The problem nowadays is that people are bombarded with some opinion on social media and dont realize that the sample size of that is <0.01% of all users of said thing. In other words, its only in your head that seemingly \"everyone\" us opposed to it. Thats probably not true at all.",
            "welcome to the Linux community with all what comes along with it.\n\nImmutable/atomic distros have their place but it is not for most probably. WHy? because the majority of linux users at this point want to tinker their systems, and immutable distros does not allow you to do that.",
            "I like to mess around with my base system. Btrfs with snapshots is the sweet spot for me",
            "Update sizes are huge.  The OS image updates can be huge. Apps installed as Flatpak/Snap also have large updates.  It will get better, and internet speed will get faster, but for now the difference with a \"normal\" distro is significant.",
            "Clear Linux is my go-to distro for everything and is built around the idea of being immutable. Definitely worth looking at (Intel's own distro, very performant, optimized for Intel CPUs).",
            "Who's the people saying that? Frankly I use vanilla os on my desktop and although the distro isn't completely ready (version 2 is in beta and they are doing a lot of impressive work), the concept of those two things plus containers seem like a good future direction for noob friendly Linux distros",
            "People like to tinker with things, which is the entire purpose of Arch. People like to break things, too, or they don't seem to be happy. Neither of these things are easily accomplished with an immutable distro.\n\nForget about the collective hive mind; if immutable distros work for you, use them. If not, don't."
        ]
    },
    "Any Linux distro that boots automatically?\n": {
        "title": "Any Linux distro that boots automatically?\n",
        "score": 6,
        "url": "https://www.reddit.com/r/linuxquestions/comments/1dr8ul7/any_linux_distro_that_boots_automatically/",
        "content": "\"I need to test the apparently faulty WiFi hardware of a computer without a keyboard, and I need a distro that doesn’t go through GRUB or require pressing Enter. Is there one? Thanks!\n\nEdit: To explain myself better, I'm booting from a live USB and I need a distro that doesn't stay indefinitely like that, one that has a countdown or something similar.\n\n[screen I want to avoid](https://preview.redd.it/s4qa0kkw3i9d1.jpg?width=3705&format=pjpg&auto=webp&s=cde018357ae750748cfa6616f26e7dd900325c67)",
        "num_comments": 18,
        "comments": [
            "Just about every distro has boot options other than grub, I don't get why grub is a problem here though, it can boot a default entry after a timeout.",
            "Most Linux distros will boot into a live session and let you use the mouse to continue.",
            "You should configure your UEFI or BIOS if that's what you mean",
            "You don't need to press enter at grub it has a 5 (or so) second timer then continues",
            "You can set grub timeouts to be minimal, and to boot a specific entry in the table.  This is true irrespective of distro.",
            "Pop!OS in its default configuration uses systemd-boot instead of GRUB, and boots without any bootloader interaction.",
            "You can just change this from your GRUB config file, no need for a different distro.",
            "The problem is that before starting, I need to choose a mode and I don't have a wired keyboard.",
            "The problem is that before starting, I need to choose a mode and I don't have a wired keyboard.",
            "This depends on the grub configuration.  It can wait at the menu indefinitely or it can have a timer of whatever length is set in the config file."
        ]
    },
    "Coming Back To Linux, Is this Still a Concern in 2024?": {
        "title": "Coming Back To Linux, Is this Still a Concern in 2024?",
        "score": 38,
        "url": "https://www.reddit.com/r/linuxquestions/comments/1dqu7iz/coming_back_to_linux_is_this_still_a_concern_in/",
        "content": "So I used to use a Linux Laptop on the regular - but that was like a decade ago. Back then, I remember friends who had their OS get corrupted due to a hard shutdown, or a power outage, or what have you. One friend backed up a good chunk of their DIY Nas' (I think it might have been a Pi hooked up to a bunch of harddrives, I forget) system settings and files to a second partition and wrote a script so that his linux would overwrite any changes so that it wouldn't care about hard shutdowns, and at the time, in Windows 7, that was not a serious concern unless you were installing a windows update when it happened.\n\nI just put Zorin OS on my desktop, yesterday.\n\nHow big of a concern is that in 2024? Is that still a real concern today, or have the various Linux distros become more resilient in that area since 2014? Do I need to take special steps to prevent major data loss or system corruption in case of power outage?\n\n----------\n\n## **Edit**\nI'm glad to hear it's essentially a nonissue, and back in 2013-2014 the instability my friends were running into may have had something to do with a Pi and SD Cards rather than the file system. That's great news. Thanks guys.",
        "num_comments": 44,
        "comments": [
            "Linux is less likely to break after a hard shutdown than Windows, it just does less stuff in the background on its own than Windows does. Unless you are mid update when pulling the plug it is unlikely to break.\n\nModern filesystems such as Btrfs are less susceptible to dataloss due to their copy-on-write behavior. If regular random powerloss is an issue consider a filesystem with COW functionality.",
            "In my experience it has never been an issue with ext4, BTRFS, or Bcachefs. That said, I haven't used every possible file system.",
            "I have done a few hundred hard shutdowns of Linux, and never had a crash. I did have a Windows 10 crash recently though.",
            "Perhaps on a raspberry pi, I might be concerned but on my main desktop, no concern at all.",
            "I have a crumby defective laptop that locks up frequently and gets hard shutdown several times per week.  The Linux fs (ext4) has never missed a beat.   Not so for Ms office running on the win10 VM on top of it though.   Corrupted my dissertation unrecoverable the evening final formatting revisions were due (fortunately I had a version up on the cloud, but it cost about 12 hours or so of work, a night's sleep, and some cortisol poisoning).  I think that was more Word's fault than NTFS though.",
            "Avoid wonky new distros. Stick to debian, ubuntu or fedora for stability",
            "Recently I experimented with many different file systems, I tried all the major ones, I then simulated a power outage by watching a video while writing to a text file, then I would perform a hard reboot, I did it multiple times on each file system and I never encountered any issues, it rebooted just fine, the video was still there, and so was the text file, just stick to one of the popular file systems and you'll be fine, personally I use XFS.",
            "I haven't had any issues with this, but then, I've been using Linux for over a decade and I can't recall experiencing any issues with data loss in all that time. At least, not any that weren't ultimately hardware failures.",
            "The only filesystem that has done that to me is XFS, which did it twice on two different systems in under 6 months.  That was when I said “screw this” and switched everything back to ext4.  Never an issue before or since.  I have heard *lots* of reports of hard shutdowns screwing up btrfs though",
            "If the power loss happens during a serious system update, then a typical Linux install is perhaps more likely to break, outside of that it should be the other way around."
        ]
    }
}