{
    "I swear this is some of you": {
        "title": "I swear this is some of you",
        "score": 510,
        "url": "https://i.redd.it/i7kzrkq0ky7d1.jpeg",
        "content": "",
        "num_comments": 28,
        "comments": [
            "I am a white guy with a beard. Am I Linus?",
            "Took the meme right out of my brain.",
            "To be fair, some of the photos that were posted here looked insanely similar to Linus. One of them was so similar to him for the first couple seconds I actually thought that was Linus before I read the captions.",
            "The joke has been so overused at this point. It's ridiculous",
            "Is the producer of the WAN show not Linus?",
            "Since when does Linus Torvalds have a beard?",
            "YES, EVERYONE IS LINUS, LINUS IS EVERYONE! JOIN THE LINUS RELIGION!!!!",
            "its as bad as the family guy \"Its Jackie Chan!\" \"look Its MAtt Damon!\" skit.",
            "Maybe this is the real reason he got rid of the beard, at least for a while.",
            "Only counts if you see them in Burnaby"
        ]
    },
    "I don't remember that quote, was it in a DLC or something?": {
        "title": "I don't remember that quote, was it in a DLC or something?",
        "score": 17,
        "url": "https://v.redd.it/h7c3upv5q38d1",
        "content": "",
        "num_comments": 1,
        "comments": [
            "I think that's what everyone does when they accidentally go down the legion quest line and enslave the Mojave."
        ]
    },
    "Justifiably Idiotic Merch Now!": {
        "title": "Justifiably Idiotic Merch Now!",
        "score": 29,
        "url": "https://i.redd.it/v1oz8o1zn28d1.png",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "linus tech tips": {
        "title": "linus tech tips",
        "score": 211,
        "url": "https://v.redd.it/2zfuc7ep0z7d1",
        "content": "",
        "num_comments": 9,
        "comments": [
            "TIHI",
            "It's all Linus....... always has been.",
            "Linus sex tips",
            "u/auddbot",
            "That's just you, I love it.",
            "real",
            "**Song Found!**\n\n[**Ghosts N Stuff** by deadmau5](https://lis.tn/GhostsNStuff?t=79) (01:19; matched: `100%`)\n\n**Album**: Azuli presents Global Guide 09. **Released on** 2013-11-20.\n\n*I am a bot and this action was performed automatically* | [GitHub](https://github.com/AudDMusic/RedditBot) [^(new issue)](https://github.com/AudDMusic/RedditBot/issues/new) | [Donate](https://github.com/AudDMusic/RedditBot/wiki/Please-consider-donating) ^(Please consider supporting me on Patreon. Music recognition costs a lot)",
            "It's literally his most famous work .. there's one he released with another DJ about how to produce dance music it's pretty funny",
            "The acronym didn't mention you at any point"
        ]
    },
    "Surprise WAN show ": {
        "title": "Surprise WAN show ",
        "score": 223,
        "url": "https://www.youtube.com/live/eoInGDRVkYc?si=X_P0CXuBSxQk8NSD",
        "content": "",
        "num_comments": 77,
        "comments": [
            "In case people missed it, at the end of the previous episode, Linus announced that this week's episode would be early, due to a funeral in the afternoon.",
            "Did Linus lose his sister? \n\nJust a comment he made about the shirt he was wearing [1h50min] made me think",
            "if there are shops in China that will reball mobile Nvidia GPUs to desktop chips, I don't see why they couldn't make a framework compatible one (other than will/monetary incentive, volume and support)",
            "I’m not religious at all, but thoughts and prayers* go out to his family. Funerals are rough, unexpected funerals are even worse. Especially when it’s close family.",
            "was actually nice to have the WAN show air earlier, usually miss it because when they're live its like 2am for me",
            "Didn’t know surprises were announced multiple times up to a week ahead of time.",
            "On the enterprise licencing discussion at the beginning: this really is standard practice, not an Adobe specific thing. You negotiate the number of seats you'll need at the beginning and then you can increase it throughout the year if needed. To decrease the number of seats you need to raise this during the annual renewal negotiations. It works like any other business negotiation - you can't really make comparisons to the consumer market, it works very differently.",
            "Why is he in the office! Go be with your family!",
            "Not a surprise lol",
            "[deleted]"
        ]
    }
}