{
    "The EU is trying to implement a plan to use AI to scan and report all private encrypted communication. This is insane and breaks the fundamental concepts of privacy and end to end encryption. Don’t sleep on this Europeans. Call and harass your reps in Brussels.": {
        "title": "The EU is trying to implement a plan to use AI to scan and report all private encrypted communication. This is insane and breaks the fundamental concepts of privacy and end to end encryption. Don’t sleep on this Europeans. Call and harass your reps in Brussels.",
        "score": 2080,
        "url": "https://signal.org/blog/pdfs/upload-moderation.pdf",
        "content": "",
        "num_comments": 201,
        "comments": [
            "Intercepting communication is just thinking too small. Hook the open() (and the similar on other operating systems) syscall and scan files that are opened.",
            "Hardly surprising but is it actually possible from the technical perspective? Unless they have a backdoor to TLS, no AI would help.\n\nThe intent counts, though.",
            "That's not a race about who can fuck up EU the most.\n\nThis piece of shit Zensursula (for the non German speakers its a mix between Zensur \\[censor\\] and Ursula) von der Leyen needs to be kicked out asap.",
            "We had this problem with Apple. Nobody talks about bad actors sending this material to regular folks to have them falsely arrested or bribed etc. Theres too much potential for abuse. Theyll literally say well you received it so you must be an abuser and turn your life inside out before they figure out some groups are abusing the system for this exact result. \n\nThis.  Instead of police doing actual work to find creeps.",
            "Parliament has voted against this, you need to contact your member state's government about this.",
            "The OP is really a bit misleading. It says \"the EU\" is trying to restrict encryption, but according to the linked statement, the European Parliament has already rejected it. If anything, that means \"the EU\" is against it. The statement claims that some countries' governments have a new proposal, but doesn't name them.",
            "is it an unpopular opinion to believe that you shouldn't use any sort of End to End encryption that is susceptible to AI-based attacks, especially the kind of inept work done by government? I have a lot of trust in Signal and I assume they'll be able to defend against any such attempts, but will certainly keep an eye on the situation.",
            "Again? Sigh! These people dont get tired. Every time we say no theyll just pull out the next surveillance bill. This has been going on for as long as I can remember, and before that there was no European Union.",
            "The EU can suck my dick, I'm gonna host my own texting service.",
            "I'm kinda convinced by this point the people lobbying oh wait I mean \"sponsoring\" this type of legislation not just in the EU but around the world want to make using technology so terrible and unsafe that it would send us back to the dark ages, people would just not bother with it anymore and start writing letters with pen and paper again."
        ]
    },
    "Thank you Linux community, first pc saved! ": {
        "title": "Thank you Linux community, first pc saved! ",
        "score": 216,
        "url": "https://i.redd.it/q93evjrncf9d1.jpeg",
        "content": "I used all that I learned here and r/linuxquestions and finally learned how to safely install my first Linux distro as a main system in an old pc. I know for you this is common, but its my first time erasing Windows and replacing it with Linux. This pc will keep as backup, for learn Linux without mayor problemas. \n\nThank you! \n\nGreetings from Chile, May god take care of you. ",
        "num_comments": 29,
        "comments": [
            "Welcome to the Linux Club my friend! Here, we always feel a smile on ourselves when we see an old computer be brought back to life with Linux! I bet you are gonna have a blast with Linux!",
            "Greetings from Argentina! Glad this community was helpful to you ",
            "Welcome to the club! Before you know it you will be \"distro hopping\" :D  \n\\~Enjoy !!!",
            "Congrats, youve became baptized and you become the official member of rhe linux community..\nIt isnt arch btw tho",
            "I hope you will enjoy using your Linux distribution. It easily becomes normal and you just use it.  \nOnly catch is it does not play well with Adobe products. (They do not write their programs to work with Linux.)",
            "Can't wait to switch to Linux too",
            "Welcome aboard, back ups are still important, and sometimes quite useful.",
            "I se you installed Linux Mint. Good choice, I am using it too.",
            "Hello! I'm also from Chile, I have 2 laptops and a desktop, they all run the fedora KDE spin, at first I was slightly hesitant to erase my windows dualboot in case I needed it but then I realized all my games and apps run on it, now, my desktop is more or less not bad and windows didn't hog performance that much but on my laptops (both are intel and amd luckily, no nvidia) which aren't that fast windows did nothing but slow them down. Glad you're one of us now.",
            "Linux is being useful for me as an \"emergency\" system. Its secure, and Best part, you can easly solve errors, thst menas for me, quality.\n\nThank you all of you."
        ]
    },
    "As many predicted, interest in Linux has started to grow": {
        "title": "As many predicted, interest in Linux has started to grow",
        "score": 360,
        "url": "https://www.reddit.com/r/linux/comments/1dqwkth/as_many_predicted_interest_in_linux_has_started/",
        "content": "Not long ago there was a discussion post about whether the linux market share will increase or not. \n\nWell, it seems to me, a lot more posts began to appear on linux questions and linux for noobs subreddits. And they are all about the same: switching from windows. Not that I dislike newbies as I was one myself but it seems that one prediction from the post I mentioned will actually come true. A lot of those newcomers are probably gonna try, fail and ditch the OS for Windows.\n\nI say there should be a disclaimer on linux subreddits that Linux is not a substitute for Windows etc, because I feel bad for the guys who say basically the same stuff on every single one of those posts.\n\nWhether the market share will increase or not is yet know, but it doesn't look promising to me. What do you think?",
        "num_comments": 215,
        "comments": [
            "Better buy some Linux stocks and bonds before the price goes to the moon. This could be the next bitcoin",
            "Yup, dunno about others, but I switched last week. Even bought AMD GPU to make my life easier:p Microsoft was getting more and more annoying with each year, but I feel like they finally crossed the red line. With Steam and Wine working as they are + great distros like Mint / Ubuntu / Fedora around etc. I think more and more people will start to slowly move away from Windows in the coming years.",
            "No warning label. Just let them know it's an alternative OS with some cross platform compatibility like switching to mac, except you dont have to buy the hardware.",
            "a few people who are barely tech literate I know were interested and one person I know who wanted to reload windows after a drive crash, didnt have the iso on hand, just installed linux mint \"temporarily\" and is now daily driving it. Others I know switched after that Recall bullshit, even though it got pulled back, I am willing to bet it's still very much going to be part of windows 11 anyway, just not accessible by end users.",
            "People cant help but notice microsofts tyranny. People are getting tired as Micro$oft is tightening their grip and making it more obvious.\nOr thinking abt it, it was already obvious. Just they need to get faar with it for people to care.",
            "You're new. That's it. The influx of new users saying they want to quit Windows has always been the same, I promise. Vista did that. Windows 8 did that. Windows 10 did that. Windows 11 did that. Recall is just the new reason, it's not worse than before. The only difference is that now you're here to see it.\n\nBut over 95% of these people will have returned to Windows within 3 months, never to be seen again. We have reached 4% of the desktop market share this year, thanks in part to the Steam Deck. And there's no reason to expect that to get any higher any time soon.",
            "In one of the volunteer groups i am in i am coaching the retirees to ditch windows for the free linux options. Its gaining momentum.",
            "OP must've been born in like 2000, or this post is from 1994.\n\nOP, thoughts on BSD dying? :p",
            "Will this be the year of Linux? They've been saying that every year for at least the last 20",
            "I remember reading this thread in 2015 on here."
        ]
    },
    "This week in KDE: everything, I think": {
        "title": "This week in KDE: everything, I think",
        "score": 60,
        "url": "https://pointieststick.com/2024/06/28/this-week-in-kde-everything-i-think/",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Much awaited white folder bug solved! You are legend ",
            "It shake cursor completely broken for anyone else on openSUSE Tumbleweed in the latest snapshot?",
            "That one bug really annoyed me ",
            "Use the *High contrast* cursor as a workaround. Looks almost identical to the default one.",
            "Tumbleweed is not the focus over there, Aeon is.",
            "Don't Aeon/Kalpa still use the same packages as Tumbleweed?",
            "Tumbleweed is the flagship distro",
            "Kalpa is in alpha so who really knows what it uses? Aeon is an immutable distro so no, its not keeping up with TW.",
            "You sure? Cuz if you use Gnome there is a mass defection to Aeon going on. If you are correct now, for how much longer will you remain right? Clocks ticking. The OpenSUSE community is already fragmented and its getting worse, not better.",
            "Nice job, KDE devs"
        ]
    },
    "Why the next GNOME Release will be one of the Best Ever": {
        "title": "Why the next GNOME Release will be one of the Best Ever",
        "score": 33,
        "url": "/r/gnome/comments/1dr66ud/why_the_next_gnome_release_will_be_one_of_the/",
        "content": "",
        "num_comments": 37,
        "comments": [
            "i'm from a stone age, i keep seeing HDR thing more often.\n\nisn't HDR is rendering for games/video? what it has to do with Gnome desktop?",
            "Don't worship Desktop Environment. It's job is to be invisible and to don't fuck up very often.",
            "Interesting indeed. I would agree that not every GNOME release is \"the best ever\", as regressions are common as well. And \"one of the best ever\" is perhaps the best that modern GNOME can achieve, since the peak was before GNOME 40.",
            "Gnome would actually have to care about it's users to be any good.",
            "It is supposed to progress, not regress. Would be strange to call it the \"worst ever\".",
            "People have been known to play games or videos on GNOME from time to time. :D",
            "yes, i understand what HDR is and how it looks, but i was confused why apps other than games or image/video processors would need real-time 3-rd party HDR?   like, would this Reddit page benefit from HDR? of course not, right?\n\nisn't \"HDR video\" just a video with some effects already applied to frames before frames coded into a file/stream? does it mean post-processing on user-side? sounds weird to me because only director knows how it should look.",
            ">Listening to all users or a vocal minority is not necessarily a positive thing. \n\nits more they ignore devs when devs/ users  say the X feature that windows , macos and all other DE have is needed",
            "I have HDR enabled on my personal and work Windows 11 machines and far prefer the increased colors and brightness that comes from it. \"Needed\"? It's in the same boat as other graphical/display features (refresh rates, resolution, scaling, etc.).",
            "I have no idea about Windows.\n\nBut for Linux and Wayland this stuff needs to go in the compositor to the best of my knowledge."
        ]
    }
}