{
    "Dr Disrespect Twitch PermaBan Reason Leaked, Allegedly Regarding Sexting Minors on Twitch, LSF Live Updates Thread": {
        "title": "Dr Disrespect Twitch PermaBan Reason Leaked, Allegedly Regarding Sexting Minors on Twitch, LSF Live Updates Thread",
        "score": 2967,
        "url": "https://www.reddit.com/live/1d804i6imkd09",
        "content": "",
        "num_comments": 1634,
        "comments": [
            "[[DrDisrespect]](https://x.com/drdisrespect/status/1804337822415097955?s=46&t=3eWRyTI9AMj4OJF0xJCqYw) responds to Jake Lucky’s quote on twitter:  \n\n> Jake seriously... I get it, it’s a hot topic but this has been settled, no wrongdoing was acknowledged and they paid out the whole contract.",
            "LSF has been as dry as the Gobi for a long ass time yet when a monsoon is on the horizon you decide to take it away as if it was all a mirage by making a megathread? Shameful.",
            "Mustard on the beat ho",
            "Why can't these famous people just stop going after minors",
            "seriously... I get it, its a hot topic but this has been settled, no wrongdoing was acknowledged and they paid out the whole contract.",
            "Assuming this True\n\n1. Twitched likely blundered and illegally terminated the contract in an abortive attempt seperate them from the Dr. Maybe they thought it was only a matter of time till it got out or the victim came forward. However, based on the info we know, it's unlikely the contract had a morality clause wide enough for this (especially if the victim decided to not come forward). This is probably why the Dr. was so confident in his case\n2. It would have then been in both Dr and Twitch best interests to settle. Twitch gets to put it to bed - gets to limit damages to the contact most likely, and the Dr. gets this under NDA. Till now. trial could backfire for both and air lots of dirty laundry.\n\nIf I guess the reason this whole shit became so quiet is the victim decided to not come forward.",
            "stupid fucking mistakes man....",
            "Stupid Fucking Mistakes 2: Electric Boogaloo",
            "Wasn’t he also banned on discord at the time? I always found that part strange ",
            "Say doc, I hear you like em young"
        ]
    },
    "Ex Twitch employee insinuates the reason Dr Disrespect was banned was for sexting with a minor in Twitch Whispers to meet up at TwitchCon (!no evidence provided!)": {
        "title": "Ex Twitch employee insinuates the reason Dr Disrespect was banned was for sexting with a minor in Twitch Whispers to meet up at TwitchCon (!no evidence provided!)",
        "score": 17799,
        "url": "https://x.com/evoli/status/1804309358106546676",
        "content": "",
        "num_comments": 2752,
        "comments": [
            "Doc just tweeted this to Jake: \n\n\n>Jake seriously... I get it, its a hot topic but this has been settled, no wrongdoing was acknowledged and they paid out the whole contract.\n\n\nhttps://x.com/drdisrespect/status/1804337822415097955?s=46&t=ywM35vAauHSN29-wglHqKA",
            "The three time",
            "certified loverboy",
            "Holy shit Doc responsed.  \" [Jake seriously... I get it, its a hot topic but this has been settled, no wrongdoing was acknowledged and they paid out the whole contract.](https://x.com/DrDisrespect/status/1804337822415097955)\"",
            "Supposing it's real, what would be the reason this didn't turn into legal action against Doc himself? It sounds like they had the evidence of the correspondence itself. Maybe they needed the victim to confirm their real age and the victim chose not to participate?",
            "https://x.com/zachbussey/status/1804313116110418033?s=46 thread where multiple journalists are saying the shit\nSLASHER RESPONDED https://x.com/slasher/status/1804321712219013293?s=46",
            "Why would The Back-to-Back 1993–94 Blockbuster Video Game Champion do this?",
            "[Another journalist chiming in](https://x.com/JacobWolf/status/1804317028435497086)",
            "pour one out for those who didnt live to see why doc was banned",
            "Sounds kinda like what Dan said\n\nhttps://www.reddit.com/r/LivestreamFail/s/BlYrp1D95W"
        ]
    },
    "[Slasher] I didn't lie (after Dr. Disrespect rumors posted by other Twitch Staff)": {
        "title": "[Slasher] I didn't lie (after Dr. Disrespect rumors posted by other Twitch Staff)",
        "score": 1706,
        "url": "https://twitter.com/Slasher/status/1804321712219013293",
        "content": "",
        "num_comments": 249,
        "comments": [
            "# look: for several hours now I have been told from credible sources the reason DrDisrespect has been banned. however due to the importance and sensitivity around the subject I have refrained from going on it. i don't feel comfortable with it currently",
            "Multiple credible sources talking about this story and somehow people in here shitting on Slasher?",
            "kids mad here in this thread cuz slasher didnt sacrifice a lot of money due to a lawsuit just so the kids here could get more behind the scenes info LOL.",
            "Maybe Slasher just literally heard the same thing from the same person? Still means we are in the same exact, proof-less position. Slasher needs to clarify what he is cryptically talking about, it's straight up clickbait otherwise. The fact that he followed up to this tweet with a call to action for leads makes me think he doesn't know shit, his source just got leaked, and he didn't release because it's flimsy as fuck and would mostly just make him look bad.",
            "doc fans out in full force lmao",
            "Look who decided to come crawling out of their dungeon",
            "So to set the record straight, he's referring to his court case against twitch for 'wrongfully banning him and ruining his brand', where the case was settled and it appears it was settled out of court and it appears that twitch paid out his full contract (really makes you think why Twitch would settle with him when he was supposedly illiciting minors and they had evidence... they wouldn't settle if they actually had this evidence because it justifies the ban).\n\nIn terms of wrongdoing, it could mean anything related to the case such as Twitch banning him for some statement he made (we know how consistent/inconsistent twitch bans are and their rationale...)\n\nHis response does not mention anything about child grooming, illiciting a child or twitch con -- he's responding to his lawsuit against twitch.\n\nPeople love to jump to conclusions for click bait and reactions and impressions, but if there was any evidence of these dms or whispers that occurred on twitch, you best believe twitch would conveniently leak them to make him look bad (as it's clear they don't like him). \n\nKeep in mind, twitch's entire backend leaked, but not evidence of Doc illiciting minors, I'll believe it when I see these dms that this EX-twitch employee is trying to refer to.",
            "so he just didn't say anything and let him continue with it?",
            "If this guy thinks he's going to come out looking good if this is true he's beyond delusional. No one's going to give  him props for knowing about someone going after underaged girls and keeping quiet about it.",
            "This is literally all the same \"he said, she said\" shit from before. Everyone acting like these rumors weren't out there originally. Bunch of half assed journalists now coming for internet clout going \"That's what I heard to\". We all heard that shit. \n\nSlasher just coming out with more cryptic bullshit as if he was proven right. If he is right then that means he knew about Doc doing this and he kept silent on it for years. If this is true he ought to be ashamed of himself."
        ]
    },
    "Dr Disrespect responds to the allegations that he was banned because he used Twitch's Whispers feature to sext a minor.": {
        "title": "Dr Disrespect responds to the allegations that he was banned because he used Twitch's Whispers feature to sext a minor.",
        "score": 957,
        "url": "https://twitter.com/DrDisrespect/status/1804337822415097955",
        "content": "",
        "num_comments": 301,
        "comments": [
            "The Heart Part 6 tier response",
            "soo two timing wasn't enough",
            "> no wrongdoing was acknowledged\n\nMaybe I'm wrong but this reads pretty bad. And doesn't it pretty much confirm **what the allegations are** at the same time?",
            "\"...no wrongdoing was acknowledged...\" Bruh 💀",
            "Does he realize how... bad this reads?",
            "It's always the people you most expect.",
            "Glad they paid out your whole contract I guess, bro. \n\nAnywho... any actual comment on the sexting with minors? No? Odd for such a 'hot topic'",
            "\"No wrong doing was acknowledged\" Sounds like a very lawyer answer to not potentially get sued for saying he \"did no wrongdoing\"",
            "Please God tell me you people arent reading that as Doc and Twitch paid off the victim. You can't be that stupid.",
            "This isn't the defense Doc thinks it is."
        ]
    },
    "Tyler1 speaks on the Tarzaned situation ": {
        "title": "Tyler1 speaks on the Tarzaned situation ",
        "score": 1700,
        "url": "https://clips.twitch.tv/HandsomeBombasticMonitorPlanking-2nIxXssQpgMj26LE",
        "content": "",
        "num_comments": 215,
        "comments": [
            "**CLIP MIRROR: \n [Tyler1 speaks on the Tarzaned situation ](https://arazu.io/t3_1dlhnjz/)** \n --- \n ^(*This is an automated comment*)",
            "This is the first time I've ever seen Tyler1 comment on something and what he says isn't \"I don't give a fuck back to league\"",
            "You know its fucked when you get t1 to talk about drama in a normal rational way or even at all really",
            "dont even have to watch to know its based and also true",
            "The most bizarre part is that tarzaned thought that was a sick own that would win people over. Dude is a weirdo.",
            "Been watching twitch for probably 10 years off and on. Never seen t1 talk about drama or be serious.",
            "Prior to the clip Tyler makes a lot of interesting points:\n\n- The reason why he was grinding chess 16+ hours a day was to help cope with the pain from his miscarriage; it let him focus and not remember his tragedy\n\n- Says that some hospitals WOULD NOT have helped Macaiyla due to different abortion laws from states (due to ectopic pregnancy being classified as abortion in those states) and they literally would've let Macaiyla outright die\n\n- His brain \"changed\" after the miscarriage where he doesn't weight lift as much as he use to\n\n- Even after his child was born, he personally will think about it once a week-3weeks and every time he does, it still hurts.  He assumes Macaiyla has it worse\n\n- Feels bad for Dantes & Laura since it all aired publicly, hopes they'll get over it eventually but can't imagine what they're going through right now.",
            "Father1 is 100% correct. That shit is horrible and nobody deserves to know it.",
            "Tyler1 when he's being himself and not being eccentric for entertainment is one of the more mature people on the platform.",
            "Dude almost lost his partner to a miscarriage. That shit can fuck with you, mentally and physically. Especially the mother. I'm not surprised this is the one time he didn't brush off a non-League question. Personal shit like that gives you perspective that can help others going through it, too. Miscarriage or abortion."
        ]
    }
}