{
    "Me : 1 / Logitech Sticky Obsolete Plastic : 0 ": {
        "title": "Me : 1 / Logitech Sticky Obsolete Plastic : 0 ",
        "score": 68,
        "url": "https://i.redd.it/i7w38h1b9c9d1.jpeg",
        "content": "",
        "num_comments": 32,
        "comments": [
            "Replacement part on Aliexpress $17",
            "i have this mouse too but it never got sticky",
            "Stopped using logitech products after my X52 Hotas was getting gummy. I hate this stuff.\nGet Isopropanol or rubbing alcohol, a bunch of paper towels and ho ham on it.\nAlways cleans off, always leaves a nice, smooth plastic that is 10 times better than this garbage \"soft touch\" crap.",
            "Keychron M6. Just get one of those and never look back.\n\nLogitech dont care, overpriced garbage designed to deteriorate. Keychrons new products are hitting hard against Logi whilst being cheaper and better.",
            "Happened the same with my M720 Triathlon \nFeels awful ",
            "Should've just rubbed it with a rag with some isopropyl alcohol on it.  That usually gets rid of the sticky plasticiser that's leaked out of the plastic.\n\nWas actually thinking about upgrading to the 3, but as my 2s hasn't gone sticky after 8 years, I think I'll leave it.",
            "I got s replacement shell on Amazon.",
            "that is probably so fucking loud when you move your hand on it",
            "Its a Tesla CyberMouse! ",
            "oh no is that the version 3? Did they use a different rubber coat to the 2s?"
        ]
    },
    "I lost my  logi m340 mouse and k470 keyboard combo dongle . what should i do ? ": {
        "title": "I lost my  logi m340 mouse and k470 keyboard combo dongle . what should i do ? ",
        "score": 1,
        "url": "https://www.reddit.com/r/logitech/comments/1drbrnt/i_lost_my_logi_m340_mouse_and_k470_keyboard_combo/",
        "content": "I lost my  logi m340 mouse and k470 keyboard combo dongle . what should i do ? Plz help",
        "num_comments": 0,
        "comments": []
    },
    "Lost dongle": {
        "title": "Lost dongle",
        "score": 1,
        "url": "https://www.reddit.com/r/logitech/comments/1drbqct/lost_dongle/",
        "content": "I lost my logi m340 mouse and k470 keyboard combo dongle lost what should i do ?",
        "num_comments": 2,
        "comments": [
            "...buy another one? Both the unifying receiver and the bolt one are for sale independently as well so you can just buy a replacement.",
            "My device doesn't support unifying program"
        ]
    },
    "K845 and Macs": {
        "title": "K845 and Macs",
        "score": 1,
        "url": "https://www.reddit.com/r/logitech/comments/1drawfb/k845_and_macs/",
        "content": "What experience do folks have using the K845 Mechanical Keyboard with Macs? ",
        "num_comments": 0,
        "comments": []
    },
    "MX Master 2, annoying jumping and teleporting since Windows 10 → Windows 11 upgrade": {
        "title": "MX Master 2, annoying jumping and teleporting since Windows 10 → Windows 11 upgrade",
        "score": 1,
        "url": "https://www.reddit.com/r/logitech/comments/1dr7vf1/mx_master_2_annoying_jumping_and_teleporting/",
        "content": "Hi! \n\nI'm starting to have too much. Since upgrading from Win10 to Win11 - where the mouse worked flawlessly before - I've been experiencing an issue where the cursor sometimes randomly teleports a few hundred pixels upwards. This is very, very annoying especially with multiple monitors. I've already updated both the software and firmware without success. I've also checked the common mouse settings. Windows recognizes the mouse as an HID-compliant mouse.\n\nCan anyone help with this? PS: It's clean. But as mentioned, the issue seems to be directly linked to the update.",
        "num_comments": 0,
        "comments": []
    }
}