{
    "Weekly Q&A Megathread. Please post any questions about visiting, tourism, living, working, budgeting, housing here!": {
        "title": "Weekly Q&A Megathread. Please post any questions about visiting, tourism, living, working, budgeting, housing here!",
        "score": 7,
        "url": "https://www.reddit.com/r/london/comments/1dhjfks/weekly_qa_megathread_please_post_any_questions/",
        "content": "#Hello, welcome to London!  \n*Visiting us?  Moving to study or work?  Brief layover? Moving to a new part of London? Any small questions about life here, if you're new or been here your whole life, this is the place!*\n\nWe get a lot of posts asking very similar questions so this post aims to address some of our most Frequently Asked Questions, and give you a place to ask for assistance.\n\nYour first port of call should be  \n#[the r/london wiki](https://www.reddit.com/r/london/wiki/index)\n\nIt includes sections on:\n\n**What should I see and where are the non-touristy stuff and hidden gems?**  \nWe've written about the big must-sees [here](https://www.reddit.com/r/london/wiki/thingstosee) and we highly recommend [TfL's Experiences site](https://tfl.gov.uk/travel-information/visiting-london/experience-london).   \nWe've listed some of our favourite lesser-known stuff [here](https://www.reddit.com/r/london/wiki/secretlondon)\nAnd the cheap/free stuff [here](https://www.reddit.com/r/london/wiki/lowbudget)\n\n**How do I pay for the Tube/bus, and what's an Oyster card?**    \nYou don't pay cash.  You can use a number of contactless payments systems such as your Contactless bankcard (which is widespread in the UK, but maybe not so much elsewhere), Apple Pay, Android Pay, or you can buy an Oyster card and top it up with credit.  See [here](https://www.reddit.com/r/london/wiki/gettingaround) for more.\n\n**Where should I live? What's x area like?**  \nHave a look [here](https://www.reddit.com/r/london/wiki/living)  \nIt includes recommended sites to find places to live and rent, and has a section on what particular areas are like.\n\n**How do I get from this place to that place?**  \nUse [Citymapper](http://citymapper.com).  Honestly, we're not shills for them; it's just a really good app and is used by most of the locals on this sub.  \n\n**Is x area safe?**  \nYes. Bad stuff can happen in any large city, but London is generally very safe.  There aren't any no-go zones.  Even under the shadow of terrorist attacks, most Londoners feel safe.  See [our safety page here](https://www.reddit.com/r/london/wiki/safety) for more.\n\n**Where can I watch the baseball/basketball/football/handegg match?**  \nA comprehensive guide to all London football matches in all leagues can be found at [tlfg.uk](http://www.tlfg.uk). Use [Fanzo](https://www.fanzo.com/en/best-pubs-in-london/3128) to find pubs showing a variety of sports and see our list of other places [here](https://www.reddit.com/r/london/wiki/sport)\n\n**How do I get a UK SIM card for my phone?**  \nAdvice on networks and how to get a SIM card is covered [here](https://www.reddit.com/r/london/wiki/connectivity).  \nIt also includes suggestions of cafés and other places where you can get free wifi and do a bit of work.\n\n**Is the London Pass worth it?**  \n[Probably not](https://www.reddit.com/r/london/wiki/londonpass)\n\n---\n\nOther subs that you may find helpful:\n\n* /r/LondonSocialClub - Meeting new people for events, activities and/or pints.  \n* /r/IWantOut & /r/UKvisa - Check if you need a visa and how to get one if you want to work here.  \n* /r/LegalAdviceUK - Good for all sorts, especially for questions about landlords and contracts.  \n* /r/UKPersonalFinance - Another goldmine of sage advice.  \n* /r/AskUK - Great for general questions about UK life that aren't specific to London.\n\n---\n\n**Tips for posting:**\n\n**Tell us about you** - If you want us to suggest things for you to do then you need to give us a good idea of what you enjoy. Don't just say \"I like music\", say what type of music. Don't just say you want \"somewhere nice to eat\", say what type of cuisine you like (or don't like). The more specific you are the better, otherwise you'll just get pointed back to the generic guidebooks, blogs and our wiki.\n\n**Tell us your budget** - If you're on a budget then tell us what it is and we can bear that in mind when making recommendations. There's no point in us coming up with ideas for things to do and places to eat if they'll clean out your wallet within the first 5 minutes. Saying you want something \"cheap\" isn't really helpful because what's cheap is entirely subjective.\n\n**Tell us where you'll be based** - Let us know where you'll be staying so that we can give local recommendations.\n\n**Asking about hotels or hostels** - We have homes here so know very little about what the hotels are like. Look on review websites such as TripAdvisor. However, if you say \"I've been looking at these three hotels. Which do you think is the better location?\" then that's the sort of thing we can answer.\n\n**Non-touristy stuff** - There are no secret corners where we hide the good stuff from outsiders! This is one of the most written about cities in the world, so when we want to go to a museum, or gallery, go window shopping, or whatever, we look at the same sources as tourists (listings sites, blogs, etc - see front page of the wiki). \n\n---\n\n^(These weekly posts are scheduled to post each Monday at 00:01. If it's late in the week you may want to wait for a new post to appear. Please send us [ModMail](https://www.reddit.com/message/compose?to=%2Fr%2Flondon) with any suggested improvements!)",
        "num_comments": 228,
        "comments": [
            "i’ve got tickets for Taylor Swift at wembley on Saturday and the last train i can get is at 12:35am at king’s cross, with the concert finishing at 10:30pm. i’m so stressed that i won’t be able to make it from what people have said about how busy it’s going to be. i’m autistic so not being able to plan this is really stressing me out. does anyone have any tips or a route that would get me there quickest? or what time i should be leaving the concert to make sure i don’t miss the train. never been to a concert at wembley before so i’m not sure what to do",
            "Anyone know any good services for meals delivered to your door? Basically glorified ready meals. Not the recipe box ones, I've seen plenty of those, but where you get the meals already made and you just have to warm them up",
            "Hello, I will be visiting London from 8 July to 12 July! What are some of the best weekday drag shows to go to, and what is the tipping etiquette?",
            "I'm considering potentially taking a night bus from central London to Heathrow. Is it sketchy to try to do this or should I bite the bullet and pay 60 for an Uber?",
            "Anyone know a reasonably priced good barber Hackney/walthamstow that is good with medium/longer hair? Need to get haircut before Tuesday!!!",
            "Hi! Where is the best place to convert Mexican pesos to GBP? I have the pesos in cash (not online or in card). I land into Heathrow tomorrow but will be in central London so wherever you think will give the best rate? Thanks!!",
            "\nHey guy and gals! My teenage sister is visiting me in London in 2 weeks and I am wondering what would be cool things to do. I have a plan more or less for the more touristy stuff like showing her around Soho, Hyde Park, Big Ben, Spitalfields Market, Camden and the big museums and galleries, but I am wondering if there are any cool events that are happening right now/at the beginning of July or something that not a lot of people might know about.\n\nSo, kind London redditor, imagine yourself being a teenage girl - what cool thing might you like to see in London?\n\n:) <3",
            "Hello everyone, I would like to spend several weeks in London this summer and my aim is to improve my spoken and written English. So I'm looking for group lessons (to improve my oral expression), preferably during the day.\n\nI currently have an average level of English (B2). Do you have any addresses you can recommend for cheap courses that accept new students every week? And I'm also interested in advice on accommodation and transport. Thank you",
            "I am coming to London for the first time ever and only to spend here 3 days. I have already started to plan what to see. My question is, is it worth it to go to the places like the tower of London, tower bridge, Westminster Abbey, the parliament, St. Paul’s Cathedral, and other historical places or is it enough to see it from the outside? \nI am asking because prices are insane for these places and usually places like parliaments in other countries make me a little bored if I am going there without a guide. \nAlso, any suggestions on where to go are more than welcome!",
            "I am coming to visit London, I am a real foodie and I would like to get some recommendations on where to eat (preferably from locals). It can vary from street food to high-end restaurants, bakeries, coffee shops, and so on. \nI will spend my days in central London mainly, but I am down to travel somewhere more for the food"
        ]
    },
    "r/London and the General Election": {
        "title": "r/London and the General Election",
        "score": 59,
        "url": "https://www.reddit.com/r/london/comments/1cybz7y/rlondon_and_the_general_election/",
        "content": "Hello folks,\n\nJust a follow up and some clarification on how we'll handle Rule 1 during the General Election. \n\nIn general (hurr hurr), election-related stories are national news, so go on UK national subs. Good places for election stories are:\n\n- r/UKPolitics\n- r/UnitedKingdom\n- r/AskUK for your election questions\n- r/GreatBritishMemes for your memes\n\nIf you can find a London-specific angle to the election, though, please do post by all means. Posts that meet our guidance for Rule 1 would be things like the following:\n\n- How possible policies affect London uniquely and specifically, e.g. housing, transport, etc.\n- News about key London battleground seats and how the parties are engaging with them.\n- News about candidates in particular seats (although we'l need balance here).\n- News about any notable election-related events happening in London, such as rallies, protests, or community meetings.\n- Information about hustings, debates, townhalls, and community meetings.\n- Information about organising and campaign in London (again, ideally with balance)\n- AMAs with London candidates ([please contact da mods!](https://www.reddit.com/message/compose/?to=/r/london))\n\nWe'll be posting our typical megathreads with reminders to register to vote, how to vote, candidates in each London seat, and so on.\n\nIn fact, **[DO IT NOW. GO REGISTER TO VOTE](https://www.gov.uk/register-to-vote)** (if you haven't already - doesn't matter if you do it twice!)\n\nStories that would not be ok under Rule 1:\n\n- Prime Minister who lives in London calls election\n- Party leader makes national policy speech from location in London\n- TV debate tonight coming from Broadcasting House in London\n- How this party's policies will increase/decrease the cost of living which is a problem in London\n\nThese are better left to the UK subs.\n\nIf we get completely swamped with election threads we may put a rate limit on them and try and achieve some kind of balance. While the election is certainly very important, not everyone wants every sub full of just election posts.\n\nI hope this makes sense, leaving this open for comment for a bit.",
        "num_comments": 36,
        "comments": [
            "Maybe helpful as there's regular posts for people looking for odd jobs: quite a few local councils are looking for extra staff for the elections (just search for your borough + election staff or poll clerk or something like that). Poll clerks for the polling stations, counting staff who'll work overnight, and postal vote openers who start in the days before the election. \n\nNot going to make you an amazing amount of money, but it is a long day so might be a nice bonus for people struggling to find other opportunities?",
            "Pin this op post to the top of the community so then people see it and know.  Otherwise no matter what you say people will drown the community with election posts very quickly",
            "do we need to register again if already done so for the recent elections?",
            "Do people work on the day or is it a bank holiday?",
            "What about a sticky thread for all election related stuff so us Londoners can talk about it with each other without drowning out other posts?",
            "I can't wait for a Government that is actually aligned with the Mayor of London and get funding and shit done rather than using it as a political tool.",
            "Will the general election affect tourist items like the changing of the Gaurd, tours of Westminister Abby, Tower of London, etc?",
            "Can we have topics that discuss the MPs for Holborn & St Pancras and Richmond?",
            "Couldn't disagree more strongly with the encouragement to vote.\n\nUK politics is a wasteland. The result of the election is a foregone conclusion, and even if it weren't, the idea that any political party has the desire or ability to create meaningful improvement is fantasy.\n\nBoycott, I say!",
            "That's pretty cool. I guess even if you are employed it might be of interest to take part as a form of civic duty if there are roles available just in election week."
        ]
    },
    "The Thames strikes again": {
        "title": "The Thames strikes again",
        "score": 253,
        "url": "https://i.redd.it/7vkjq9y1c38d1.jpeg",
        "content": "Another lucky driver forgets the Thames is tidal in Richmond. A firetruck ended up towing it out, but we didn’t get to see the driver return, which, let’s be honest, we were all waiting for. ",
        "num_comments": 49,
        "comments": [
            "# Upvote/Downvote reminder\n\nLike this image or appreciate it being posted? Upvote it and show it some love! Don't like it? Just downvote and move on. \n\n*Upvoting or downvoting images it the best way to control what you see on your feed and what gets to the top of the subreddit*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/london) if you have any questions or concerns.*",
            "Every time I walk there I wonder who's brave enough to be parking in that spot. ",
            "Even if this was my car, I definitely wouldn't stroll up and admit it with everyone standing there.",
            "Something needs to be done about this thames fellow.\n\nProper menace",
            "https://maps.app.goo.gl/PchH6KRCz5r6xqUV6?g_st=ac\n\nIt doesn't look to me like an appropriate place to park anyway with low tide. Why do you need to park so close to the water? It's barely a road down there",
            "Some people will do anything just to park outside their house",
            "“Can’t park there mate”",
            "For those who don't know it's by Richmond bridge.\n\nThey need to put a railing or something there. Cars have been getting flooded there for decades.",
            "Another car fed to the mighty Thames to sate its wrath.",
            " That’s a serious photo"
        ]
    },
    "The Thames swallows car": {
        "title": "The Thames swallows car",
        "score": 898,
        "url": "https://v.redd.it/wbtk7ypx2z7d1",
        "content": "This is in Richmond, by the White Cross pub ",
        "num_comments": 134,
        "comments": [
            "Imagine parking there, for a start, but the thought of them coming back once the tide went back out and wondering what the hell happened makes me laugh.",
            "Why was the clip played in reverse half way through?",
            "Happens regularly there. I can even remember sitting there around 30 years ago and watching a car left there getting overtaken by the water.",
            "Love to see the geese coming over for a gander.",
            "[deleted]",
            "Few packs of silica gel will sort that out 👍",
            "r/cantparktheremate",
            "Soak it in rice",
            "Just cause its a river, doesn't mean it aint tidal",
            "Must be one of those Ted Lasso fans visiting Richmond for the first time"
        ]
    },
    "Missing Teenager – Dillon Duffy, 18 years old": {
        "title": "Missing Teenager – Dillon Duffy, 18 years old",
        "score": 326,
        "url": "https://www.reddit.com/r/london/comments/1dldag6/missing_teenager_dillon_duffy_18_years_old/",
        "content": "https://preview.redd.it/0c2929m9fz7d1.jpg?width=1440&format=pjpg&auto=webp&s=b45a7298f756ba0fc0ca3c9963d804b8a3c0d443\n\nhttps://preview.redd.it/2qxomzmffz7d1.jpg?width=1152&format=pjpg&auto=webp&s=a6230c8300f647779a145b00240cece1da78cf94\n\nhttps://preview.redd.it/yjr0r8klfz7d1.jpg?width=1053&format=pjpg&auto=webp&s=a6e3fa8bf847557b55ead2e7bded0d183a45ed5b\n\nPlease keep your eye out for a missing teenager from Manchester who travelled down to London on the 18^(th) June. Last seen outside Euston Station taxi rank at 17:50.\n\nDillon is described as being a white male who is around 5ft 9in tall and of medium build. His 'dirty blonde hair' is cut 'very short'.\n\nThe teenager was last seen wearing a dark grey North Face zip-up hooded jacket, which has a white logo on the front left-side of the chest. He was also wearing black slim-fitting tracksuit bottoms and black and grey Nike trainers with white soles.\n\nDillon was also spotted wearing a beige baseball cap and carrying a black Puma backpack in the latest CCTV images released of him. He is believed to have a Simpsons novelty blanket with him.\n\nIf you have any information please contact the police on 101.",
        "num_comments": 23,
        "comments": [
            "[Camden Police tweet](https://x.com/MPSCamden/status/1803793268578177049).\n\nIf you have seen Dillon please **call 101** quote ref **01/491880/24**.\n\nCall 999 if there is a danger to life, threat of violence or a serious injury.\n\nAs is normal for Missing Persons posts, please keep all comments respectful/relevant.",
            "Thank you for this. Please keep spreading and sharing this. This is my nephew and we all just want him to tell us he is safe. Dillon we love you so so much. Please I’m begging you to let us know you’re okay xx",
            "hope they find him :(",
            "Bump",
            "bump 💕",
            "Bump",
            "🙏",
            "Bump",
            "Commenting to boost visibility\n\nHope he's ok x",
            "Hope he is found safe and well!"
        ]
    }
}