{
    "Looking for resources for watching movies, playing games, communicating, flights, hotels and more? Check out the r/LongDistance wiki!": {
        "title": "Looking for resources for watching movies, playing games, communicating, flights, hotels and more? Check out the r/LongDistance wiki!",
        "score": 530,
        "url": "https://www.reddit.com/r/LongDistance/wiki/resources",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "A Friendly Reminder": {
        "title": "A Friendly Reminder",
        "score": 345,
        "url": "https://www.reddit.com/r/LongDistance/comments/150pw2t/a_friendly_reminder/",
        "content": "Hey All, Julian here...\n\nThis is your only warning and only reminder that posting anti-LGBTQIA+ comments or posts will be removed and you WILL be banned and you WILL NOT be allowed a second chance. This is a welcoming community and we do not allow others to be trolled, harassed, etc. for their sexualities, genders, etc.   \n\n\nThanks!",
        "num_comments": 26,
        "comments": [
            "I will no longer talk about how Luigi Got Big Titties in a negative light, ty for informing me",
            "Crazy that this needs a reminder. 😬\n\nYou'd think people in 2023 would be more accepting towards LGBTQ+",
            "not with fascistic corporate brainwashing they arent",
            "Very disappointing to see this take from a fellow Canadian. :/ You should know better.",
            "Bigotry is bigotry. We do not take kindly to racism, sexism, or xenophobia either.",
            "I would insult you, but I’m currently having too much fun with your mother",
            "You’re a weirdo. Get bent. Stop raging on Reddit.",
            "Sincere question. What constitutes \"hateful speech\" to people who *are not* LGBTQIA+? I just want to be sure I'm not inadvertently saying inappropriate things.\n\nThe sidebar rule #2 states this:\n\n​ 2. **No Harassing, Trolling, Flaming or Spamming**\n\nPersonal attacks, bashing, harassing, trolling, flaming or spamming is not allowed. This will result in a removal and ban. If you disagree with a post or comment, make sure to explain why you disagree instead of just saying \"You're wrong, this is stupid.\"",
            "🤍🩷🩵🤎🖤❤️🧡💛💚💙💜",
            "Thank you 💕🫂"
        ]
    },
    "Going on 3 years!! 22M, 23FM": {
        "title": "Going on 3 years!! 22M, 23FM",
        "score": 160,
        "url": "https://i.redd.it/ddev27sxkf9d1.jpeg",
        "content": "I have a lot of favorite memories with him, including our first meeting. How long have you guys been ld with your partners? ",
        "num_comments": 14,
        "comments": [
            "Aaaaa yall are so cute!!! Did you guys meet purely online?",
            "yall are so cute 😊😊 congrats on 3 years",
            "You guys look so happy and cute together aww, congrats",
            "Congratulations on u 3 years together",
            "Yup.  Turns out it's a small world, a girl I made friends with online like a year or so prior is his friend's older sister and she introduced us",
            "Aww thank you. I'm obsessed with frogs and he saw it while we were on vacation and bought it for me. It's one of my favorite things",
            "He makes me very happy",
            "That's so special and so cute! Wishing you all the best! <3",
            "love the hat! <3",
            "Thank you 🥰"
        ]
    },
    "I finally booked my trip!": {
        "title": "I finally booked my trip!",
        "score": 269,
        "url": "https://www.reddit.com/r/LongDistance/comments/1dqwbn7/i_finally_booked_my_trip/",
        "content": "Hey y’all! I finally saved $5,000 for my long-distance trip to see my love. It wasn’t easy… I started small… setting aside a little bit from each paycheck… cutting down on expenses… skipping some nights out with friends. I took on extra shifts… sold a few things I didn’t need… and picked up a side gig here and there. Every dollar I saved brought me closer to our reunion… it felt like forever… but I kept my eye on the prize.  \n  \nTo my surprise, I won an extra $1k online! That win helped push me over the $5,000 mark.  \n  \nNow… with my savings and a little bit of luck… I’m booking my trip. I can’t wait to see my other half… to hug them… and share all these stories. It’s been a long road… but totally worth it. If you’re in a similar boat… keep pushing… because the reunion is going to be amazing. Safe travels to all!  \n  \n  \n  \n  \n  \n",
        "num_comments": 21,
        "comments": [
            "Uhmmm why are you commenting on a nude model's photo asking for a link ? 💀 Please don't do your woman like that. Thank you.",
            "That's amazing :D I hope you have a great time with your partner. Do you have anything planned? Is it your first time meeting?\n\nMay I ask how you made a random $1k online? Are you a bit of a gambler lol",
            "You did all that and then gambled online? That's so scary if that's the case wth :D enjoy your trip !!",
            "Planes cost 5k to travel these days? 😳",
            "So exciting!! All the hard work you put in paid off and it’s gonna be so worth it :))",
            "Congratulations OP! I just started saving this week! Have fun with your love 💕",
            "Maybe that's his side gig...",
            "I have not spent 5k on a plane ticket mine was around $1,800 RT but I would go premium economy, economy would have been around $1,200 \nThat’s Texas to Finland",
            "Depends on where you're going. Did Melbourne (AUS) to Sacramento (USA) and it worked out to be $6000 (AUD) round trip. I did go 2 days after Christmas though.",
            "In my case from south america to middle east, it's 3k and of course, during the worst season (summer) which it's the cheapest one in his country 🥲."
        ]
    },
    "Off for two weeks of togetherness. 🇮🇪➡️🇨🇦 (Part 2)": {
        "title": "Off for two weeks of togetherness. 🇮🇪➡️🇨🇦 (Part 2)",
        "score": 7,
        "url": "https://i.redd.it/gvybs2dgki9d1.jpeg",
        "content": "Posted here yesterday and literally 2minutes later my flight was cancelled. \nWe didn't get our planned 36(ish) hours in Toronto and today I'm gonna miss seeing Jurassic Park (my favourite movie) on the big screen accompanied by a live orchestra, which she had planned for me.\n\nAnyway I've a 7.5hr flight to Toronto and then 6hr bus to Ottawa now.\n\nIt's been an eventful 24hours but I'd do it every weekend to be with her if it was feasible. ",
        "num_comments": 0,
        "comments": []
    }
}