{
    "Looking for advice. 19M": {
        "title": "Looking for advice. 19M",
        "score": 613,
        "url": "https://www.reddit.com/gallery/1dqhouq",
        "content": "",
        "num_comments": 272,
        "comments": [
            "Wait, which one are you?",
            "That’s got to be the funniest post ever on this sub 😭😂",
            "Bro you gotta get a tripod instead of making yo granny/mom take bathroom selfies for u ☠️",
            "The things nana is willing to do",
            "I saw this and was hoping I wasn't the only one finding his grandma there as peculiar.",
            "Lose the grey hair and face the mirror, and also learn to use a camera on your own",
            "Hahahaha oh my goodness",
            "Your poor grandma 😭😭😭 why are you doing that to her",
            "bro wtf",
            "You had a camera person and still used an obstructed view?"
        ]
    },
    "How to look better without makeup?": {
        "title": "How to look better without makeup?",
        "score": 55,
        "url": "https://www.reddit.com/gallery/1dqxy68",
        "content": "I am very very insecure without makeup and pretty much have at LEAST concealer, mascara, and blush on Everytime I go out in public or take photos of myself. I feel very ugly without it because I know I could look so much better with it. Is there anyway to enhance my natural appearance so I don’t have to wear makeup all the time? The first 3 pictures are with makeup and the rest are without. I don’t take many pictures without makeup often at all so they are kind of old pics.",
        "num_comments": 52,
        "comments": [
            "Taking care of your skin, drinking a lot of water and sunscreen. Having naturally thick eyebrows help too",
            "You should never be insecure without makeup natural beauty is fantastic you're a beautiful woman and I'm sure that most guys like natural a lot better than kicked on makeup I remember the 80s I didn't like make up then I think you're beautiful just the way you are please don't ruin it with makeup. Thank you for sharing with us I'm sorry about your in security you shouldn't have any at all.",
            "You’re naturally beautiful.  Many guys myself included are not a fan of caked on makeup. You don’t need make up at all.  You don’t need to be insecure. What the hell is social media doing to people?!?!",
            "I am shocked that you doubt your looks. You are delusional and I recommend you try to accept that and break free of your delusions. Best thing you can start doing to loon better is accept what you are. Consider the fact that the way people look is far less important than the way people act and think",
            "You have beautiful skin, eyes, everything!!!  Unless you want to wear makeup, it’s really unnecessary!  You’re lovely!",
            "You look great both ways honestly",
            "Caught a glimpse of your photos (without reading post) and my first thought was what's wrong with these photos/already wearing makeup. The last 3 photos look no different than the first 3. That's a compliment.",
            "Are you kidding? I thought this was a troll post at first. You are BEAUTIFUL. I’m not a girl who gives out compliments very much, but I can’t believe you’re insecure. I couldn’t even tell which picture had no makeup. Body dysmorphia is a beast and it’s LYING TO YOU. I would trade places with you in a heartbeat.",
            "Ehh I have the same problem. I feel like I look a lot better with my lashes curled so maybe a lash perm. Brown & lash tint if you're naturally blond.",
            "God id love to see you lean into the 1950s aesthetic some more. \nGranted, it wasn't a makeup free era but it was dominated by pastel colours and red lipstick. \nYour face is beautiful so I think it would be a really strong look for you."
        ]
    },
    "how can i look my best??": {
        "title": "how can i look my best??",
        "score": 31,
        "url": "https://i.redd.it/fafnw5oxme9d1.jpeg",
        "content": "",
        "num_comments": 21,
        "comments": [
            "You’re adorable, I got nothin.",
            "You're pretty! I would recommend to use a round hair brush to blow dry and style your bangs, wear some sheer lipstick and earrings, and wear some color in your clothing.",
            "You already have that best vibe ☺️",
            "It would be hard to look better, your hair and smile are really nice!!",
            "probably a smaller frame for your glasses?",
            "You're cute as a button.",
            "Falsies and a more contrasting lip color",
            "3D, death star delts",
            "I Honestly believe nothing You look GREAT!!!!",
            "I think you look good just the way you are"
        ]
    },
    "early 20s, thoughts on improvement? ": {
        "title": "early 20s, thoughts on improvement? ",
        "score": 6,
        "url": "https://www.reddit.com/gallery/1dr4ykd",
        "content": "",
        "num_comments": 7,
        "comments": [
            "you are cute, just smile more❤️",
            "you look great in long hairs.   \none question: Did you had some surgery? your belly button seems off in pic-4",
            "your face and hair lack some colour; i recommend blush, lip gloss, eye makeup and some highlights to add depth to your hair. mascara would look great on you. put your hair in a middle part to look younger and more fashionable, and maybe get some face framing pieces.",
            "No improvements. Already HOT",
            "Boob job would help. Sorry just being honest",
            "yeah it’s a scar from surgery, my belly button is hidden under the leggings lol",
            "Ok, the last pic would have been best if you had smile on that face."
        ]
    },
    "38/f, will be 39 in a few months": {
        "title": "38/f, will be 39 in a few months",
        "score": 19,
        "url": "https://www.reddit.com/gallery/1dqz86v",
        "content": "What can I do…don’t want to look super old 😭😭😭? Advice",
        "num_comments": 8,
        "comments": [
            "Homie, eventually you're going to look old lol\n\nDon't fret it too much. But in the meantime, lift weights, do cardio, sleep well, and eat well. You look like you're doing fine as is. I've seen older looking 18yos bro. Just don't sweat age. It's a blessing.",
            "You look great",
            "hi! you are so pretty ❤️ i love your smile :) a middle part would look so gorgeous on you!!",
            "Ur absolutely stunning ! 💕💕",
            "Go blonde, lose the sidepart, get loose front bangs, less eye makeup- light shimmery eyeshadow and natural lengthening mascara will do, lighter and less matte lip- go for a lighter and brighter red toned lip gloss/ dewy lip tint, add some liquid blush",
            "A middle part or a less deep side part would suit you a little better. I think also adding some brow shaping or filling, with a some mascara on curled lashes would brighten up your eye area. The only thing I think that ages you, is your accessories seem a little more of a mature style, but if that is your taste I say rock it!",
            "butterfly haircut."
        ]
    }
}