{
    "★OFFICIAL DAILY★ Daily Q&A Thread June 29, 2024": {
        "title": "★OFFICIAL DAILY★ Daily Q&A Thread June 29, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/loseit/comments/1dr6zr8/official_daily_daily_qa_thread_june_29_2024/",
        "content": "# Got a question? We've got answers!\n\nDo you have question but don't want to make a whole post? That's fine. **Ask right here!** What is on your mind? **Everyone is welcome** to ask questions or provide answers. No question is too minor or small.\n\n**TIPS**:\n\n* Include your stats if appropriate/relevant (or better yet, update your flair!)\n* Check the [FAQ](https://www.reddit.com/r/loseit/wiki/faq) and other resources in the sidebar!\n\n*Due to space limitations, this may be a sticky only occasionally.* ***Please find it daily using the sidebar if needed.***\n\n**Don't forget to comment and interact with other posters here, let's keep the good vibes going!**\n\n*Daily Threads*\n\n* [**US Accountability Challenge**](https://www.reddit.com/r/loseit/search/?q=author%3AMountainlioness404d%20title%3Aaccountability&restrict_sr=1&sort=new): Stay accountable with friends from North America.\n* [**EU Accountability Challenge**](https://www.reddit.com/r/loseit/search/?q=author%3Avisilliis%20title%3Aaccountability&restrict_sr=1&sort=new): Stay accountable with friends from the EU.\n* [**Daily Q&A Thread**](https://www.reddit.com/r/loseit/search?q=title%3A%22Daily+Q%26A%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Post your questions, receive answers.\n* [**SV/NSV Feats of the Day**](https://www.reddit.com/r/loseit/search?q=title%3A%22SV%2FNSV%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Share your scale victories and non-scale victories.\n\n*Weekly Threads*\n\n* [**Day 1 Monday**](https://www.reddit.com/r/loseit/search?q=title%3A%22Day+1%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Introduce yourself and share your goals and strategies.\n* [**Tantrum Tuesday**](https://www.reddit.com/r/loseit/search?q=title%3A%22Tantrum+Tuesday%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Share your complaints, vents and gripes.\n* [**Weigh-In Wednesday**](https://www.reddit.com/r/loseit/search?q=title%3A%22Weigh-in+Wednesday%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Share your weigh-in progress and graphs.\n* [**Track with Me Thursday**](https://www.reddit.com/r/loseit/search?q=title%3A%22Track+With+Me+Thursday%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Make new friends and find accountability buddies.\n* [**Foodie Friday**](https://www.reddit.com/r/loseit/search?q=title%3A%22Foodie+Friday%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Share your favorite recipes and meal pics.\n* [**Century Club**](https://www.reddit.com/r/loseit/search?q=title%3A%22Century+Club%22+author%3ASmilingJaguar&restrict_sr=on&sort=new&t=year): For those who have lost or would like to lose 100lb+.",
        "num_comments": 4,
        "comments": [
            "I'm curious when, in terms of % of body weight lost, you could physically see a difference in the mirror or in photos.",
            "I used to weigh 135KG, or almost 300lbs. I am now down to 110KG or 242lbs. I am 184cm/6ft.\n\nSince the weather is starting to get really nice I would like to get back into running, but I'm not sure if I should at my weight, or if I should just continue with walking instead. Is this something I should discuss with my doctor first?",
            "What am I?\n\nI used to be average weight like (65kg-68kg) and I made out of fat. I don't know what that body type called but luckily that I walked 2km this day! I walked like 6 round and then I am tired and go back home but I don't know what my body type called. Is it healthy? Is it overweight? Is it unhealthy? I don't know. Pls somebody answer me...",
            "In /r/progresspics, I can see it when someone else has lost about 10% of their bodyweight.     As to me seeing it on my own body, I was one of the last to see it.  Everyone else could see it before I could."
        ]
    },
    "★OFFICIAL WEEKLY★ Foodie Friday: Share your favorite recipes and meal pics! June 28, 2024": {
        "title": "★OFFICIAL WEEKLY★ Foodie Friday: Share your favorite recipes and meal pics! June 28, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/loseit/comments/1dqn51v/official_weekly_foodie_friday_share_your_favorite/",
        "content": "# Calories? I think you mean delicious points!\n\nGot some new recipes you want to try out? Looking for ideas for your next /r/MealPrepSunday? Just trying to get some inspiration before you give up and say \"Let's get takeout?\" - *again*? Fight the Friday funk, and get excited for cooking tonight!\n\nPost your favorite recipes here to share with the rest of the /r/loseit community! You can also share your meal photos via [imgur.com](https://imgur.com) links.\n\nDue to the spirit of the sub, please try to include the calorie and nutritional information if at all possible. MyFitnessPal has awesome recipe calculators you can use!\n\nBig thanks to SmilingJaguar for his many years of running our weekly Wecipe threads.\n\n*Due to space limitations, this may be a sticky only occasionally.* ***Please find it using the sidebar if needed.***\n\n**Don't forget to comment and interact with other posters here, let's keep the good vibes going!**\n\n*Daily Threads*\n\n* [**US Accountability Challenge**](https://www.reddit.com/r/loseit/search/?q=author%3AMountainlioness404d%20title%3Aaccountability&restrict_sr=1&sort=new): Stay accountable with friends from North America.\n* [**EU Accountability Challenge**](https://www.reddit.com/r/loseit/search/?q=author%3Avisilliis%20title%3Aaccountability&restrict_sr=1&sort=new): Stay accountable with friends from the EU.\n* [**Daily Q&A Thread**](https://www.reddit.com/r/loseit/search?q=title%3A%22Daily+Q%26A%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Post your questions, receive answers.\n* [**SV/NSV Feats of the Day**](https://www.reddit.com/r/loseit/search?q=title%3A%22SV%2FNSV%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Share your scale victories and non-scale victories.\n\n*Weekly Threads*\n\n* [**Day 1 Monday**](https://www.reddit.com/r/loseit/search?q=title%3A%22Day+1+Monday%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Introduce yourself and share your goals and strategies.\n* [**Tantrum Tuesday**](https://www.reddit.com/r/loseit/search?q=title%3A%22Tantrum+Tuesday%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Share your complaints, vents and gripes.\n* [**Weigh-In Wednesday**](https://www.reddit.com/r/loseit/search?q=title%3A%22Weigh-in+Wednesday%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Share your weigh-in progress and graphs.\n* [**Track with Me Thursday**](https://www.reddit.com/r/loseit/search?q=title%3A%22Track+With+Me+Thursday%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Make new friends and find accountability buddies.\n* [**Foodie Friday**](https://www.reddit.com/r/loseit/search?q=title%3A%22Foodie+Friday%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Share your favorite recipes and meal pics.\n* [**Century Club**](https://www.reddit.com/r/loseit/search?q=title%3A%22Century+Club%22+author%3ASmilingJaguar&restrict_sr=on&sort=new&t=year): For those who have lost or would like to lose 100lb+.",
        "num_comments": 4,
        "comments": [
            "Currently obsessed with Tvp oats. 50g oats, 30g tvp, 12g powdered PB, 1 grated zucchini, 1 cup almond milk, 1 cup very cherry berry blend frozen fruits and a sprinkle of sugar free chocolate chips on top. Approx 550 cal and 33g protein. ",
            "If you're craving a crunchy snack food, try this! Not super low cal, but a very satisfying treat! It's vegan if that's your thing. It's my serving of olive oil for the day.\n\n**Olive oil caramel \"Kettle Corn\", makes 1 CRAZY DELICIOUS, warm, crunchy, finger-licking serving**\n\n**Calories: 275**\n\n**Net Carbs: 29.1 Fat: 15g Protein: 3g Fiber: 4g**\n\n**Ingredients: 2T popping corn. 1T olive oil, 1T maple syrup, dash of salt**\n\nAdd 1T of COLD Maple Syrup and 1 T of your favorite olive oil (mine is Meyer Lemon from Saratoga Olive Oil Co.) to a small bowl with a dash of sea salt, and whisk away until emulsified into a caramel (a minute or 2). Ready to use. Optional: Make ahead, put in fridge and whisk again before using. It will be thicker.\n\nAir popped popcorn: Use a plug-in air popper, or get a silicone popcorn popper on Amazon or wherever, under $10. Add 2 Tablespoons (30g) popcorn kernels for popping, no oil. (My favorite is Trader Joe's Organic popcorn kernels). Pop the corn, takes 2 minutes in my microwave, some take uo to 3 minutes.\n\nDrizzle the \"caramel\" over the hot popcorn and shake it around to coat. Add more salt if needed, but mine was perfect with just a touch of salt. More salt overpowered the delicate olive oil caramel flavor. It is sweet, but not too sweet, and DELICIOUS!!!! I licked all my fingers and the silicone popper! (It's dishwasher safe ;)",
            "YUM!",
            "1 pork chop with some smokey rub\n\n8 stalks of asparagus with some garlic salt, and pepper\n\n1 packet of Bens original ready rice - spanish rice\n\nPreheat the air fryer to 400 degrees and place the asparagus in for 8 minutes; flip halfway through. While the asparagus is cooking throw the pork chop onto a skillet with 1tbsp of garlic butter; flip halfway through. The asparagus and pork chop should be done around the same time plate them both while you throw the rice packet in with some water into the same skillet you cooked the pork chop. Heat the rice and plate\n\n[It's delicious](https://imgur.com/a/fXDKMiu)"
        ]
    },
    "Girlfriend dieting wrong?": {
        "title": "Girlfriend dieting wrong?",
        "score": 49,
        "url": "https://www.reddit.com/r/loseit/comments/1dr2azs/girlfriend_dieting_wrong/",
        "content": "My girlfriend has been dieting for a few months, but she isn’t really losing weight. She comes to me for advice because I’ve lost over a hundred pounds previously, but I don’t know much about women’s health considering I am a man. I calculated my girlfriends BMR (25 Y/O, 5’ 7”, 167Lbs) and it says ~1800 calories for little to no exercise. She swears up and down that she’s counting calories and “definitely eating less than 1800 calories”. She’s eating around 1500 calories a day according to her, she’s not going to the gym currently, but she does walk around a lot. She gets a small fast food meal (1 order of McDonald’s medium fries for example) from time to time (maybe once a week or less). I understand that her going to the gym would speed up the process and obviously help, but even when she used to go (she just stopped like a month ago because she started to get super busy with work), she was still only gaining weight. Assuming everything she said is true, shouldn’t she be losing weight? She’s currently blaming it on her barely eating before starting to diet properly (she would eat about 1200 calories a day), and says her metabolism is messed up and affecting her weight loss, which I am not sure if that is possible? Any advice/help would be appreciated. Thanks!\n\nEdit: There is also a chance that she is unknowingly not counting properly, so if the science isn't \"sciencing\" please let us know straight up!",
        "num_comments": 28,
        "comments": [
            "That BMR is waaay too high, it should be around 1535. She needs to use a food scale,no guessing, and perhaps she keeps forgetting about the calories she drinks, or the cooking oil, etc. I'd mealprep for a few days with her, just so she can get an accurate picture of what 1500 kcal really looks like.",
            "Her BMR might be lower than you’ve calculated. I recently got metabolic testing free through work and was stunned that my BMR is 1300kcal, right at the bottom of what’s normal for a woman of my height and weight (5’9 and 82kg). I’ve adjusted my CICO calcs accordingly and it’s beginning to come down but it’s slooooow work. Patience is key, this is the long game!",
            "She could be tracking wrong, a lot of people think they’re eating an exact amount of calories but they’re not properly logging little things like butter or oil. Otherwise if she is tracking accurately/ weighing her food etc. she should look into bloodwork! It could be thyroid, or a condition like PCOS if she has other symptoms. I will also say it doesn’t sound like she is overweight and generally speaking weight comes off a little easier when you have a lot more to lose.",
            "Hormonal issues can play a much bigger role for women than men and we typically lose at a much slower rate. it would honestly be better for her to do resistance training and focus on body recomposition at this point then the lbs on the scale.",
            "Everything everyone is saying here is true. And quite frankly, it could very well be bad counting. Especially when the deficit is slim. The only thing I would add, if it were me, and I was close to normal, I would go to 1200. This isn't some drawn out mission impossile journey some of us have had to endure. This is close to just a cut, and you can do 1200 for 12 weeks, then maintenance, and see where you are.",
            "I have been working out 4-5 days a week 30-60 min each day. I try to count my calories as well. I drink and sometimes eat not so great on the weekends but during the week try to stay under 1800. I have only lost 6 lbs in 2.5 months. It’s a grind. If she’s truly staying under cals and not lost anything she should have some bloodwork done. I know it has been harder for me as I have gotten older. If she is drinking a few days a week that is a lot of extra cals that I didn’t want to admit to at first.",
            "If she’s truly been in a deficit for months, was working out, but is gaining weight - blood test. My moneys on thyroid.",
            "She’s eating too many calories, every single person maintaining and not losing is eating too many calories. I’m 5’8 130 and I can eat 2,000 a day, whatever on weekends without gaining but I never stop moving unless I’m sleeping. My job is easily 15,000 steps and 30 flights of stairs a day, I workout 4 days on top of that",
            "Does she have other health conditions? Thyroid issues, pcos, Endometriosis, insulin resistance? I think she should talk to her doctor to get a full picture of her health just in case",
            "Does she weigh her food? Does she track oils, condiments and drinks?"
        ]
    },
    "How do I know if I’m still fat?": {
        "title": "How do I know if I’m still fat?",
        "score": 7,
        "url": "https://www.reddit.com/r/loseit/comments/1dr9gq3/how_do_i_know_if_im_still_fat/",
        "content": "How do I know if I’m still fat???\n\nI’m really sorry if I seem insensitive. Pls don’t flame me for this it’s a genuine question… I’ve(15,m,170) lost about 35kg, 105-69kg. but I still feel fat and like I need to lose weight. Everyone telling me that I look normal, even muscular! I’m at 20% body fat(army method) currently which is apparently normal. I’m very active( full body split 3x week and running about 5x a week total Mileage about 20K a week) so I’m not sure what to do. Should I continue cutting? Thanks so much \n\n  I’ve heard some people talk about BMI and bla bla, but isn’t that inaccurate? Since it doesn’t count in lean mass and muscle mass. My BMI should be around 24-25 which is act overweight in my country. However I can bench(75kg)  more than most of my friends my age and height. Thanks everyone for help",
        "num_comments": 18,
        "comments": [
            "We are supposed to have fat. So the question is whether you have excessive fat.  It's a health question. \n\nYour doctor is your body's health expert. You've lost 35kg as a teenager. You should be professionally guided.",
            "You’re young and growing. Don’t worry about cutting, just eat at maintenance and keep up the exercise.",
            "> I’ve heard some people talk about BMI and bla bla, but isn’t that inaccurate?\n\nBMI is accurate for the 99.9% of people in the world who aren't bodybuilders or professional athletes.",
            "“If it jiggles, it’s fat”",
            "Im 21m 174cm. Started at 68.5kg and now 65.5kg. I have belly fat or breast fat that jiggled. That day that goes, i will be done.",
            "Alright thanks so much! Same to you and good luck!",
            "I'm 6'6 and BMI definitely isn't accurate for taller people either.",
            "wow this is so useful! Thanks so much for this and hope you achieve your goal weight!",
            "Ah, I have that problem too. Good luck to you on achieving that goal!",
            "But you still get a rough estimate. Common sense really. If you have a BMI well in the obese range, you need to loose some. Doesn’t matter whether you are a body builder or taller than average."
        ]
    },
    "Where does your body get the energy from when in deficit?": {
        "title": "Where does your body get the energy from when in deficit?",
        "score": 88,
        "url": "https://www.reddit.com/r/loseit/comments/1dqvlcx/where_does_your_body_get_the_energy_from_when_in/",
        "content": "I was talking to a family member about dieting for a bit now and eating healthier and they told me calorie deficit doesnt work the long term and that your body will go into starvation mode and keep everything and its not maintainable and its proven by studies (im not sure where he looked to find them?).\n\nMy question is that if your body does do this, it still needs energy for breathing, heart beating etc walking and functioning so if it stores everything then where is it getting energy from? I know the first 5kg or so you lose is from water weight or storages but after that? \n\nAlso if he means unsustainable as in, you should just eat the goal weight maintence until you get there. I swear this process is really really really slow, say my goal weight maintence is 2000 but my maintence now is 2100. A deficit of 700 calories a week i swear will take like years and years? Is this better as opposed to being in a calorie deficit of 1600 and raise it when reached said weight? \n\nThank you for reading!",
        "num_comments": 72,
        "comments": [
            "All the excess fat that we have stored away.",
            ">starvation mode\n\nThis is not a real thing. Your body stores extra energy in the form of fat cells, and breaks them down for the energy stored within when you dont eat enough. When you start to run out of fat cells, it starts to consume more and more muscle to make up the difference. When you run out of muscle, you die.",
            "Stored fat, that’s why you lose weight when you’re on deficit",
            "If a calorie deficit didn't lead to weightloss but weightgain world hunger would be solved.",
            "Starvation mode is not based in science. Your body gets the energy from the food you're eating and then it breaks down the fat stores to make up for the deficit.\n\nYou generally only want a deficit of 500 cals tops, unless you're at a very high weight. You want to lose no more than 1% of your weight weekly, so 1-2 lbs for most people. It's slow, but it's important so that you're still getting all of the vitamins and nutrients that your body needs.",
            "In a deficit, energy comes from your food, and any extra energy needed comes from your own body (muscle/fat). To ensure your body makes up the deficit using FAT, one needs to ensure they get enough protein in their diet while in a calorie deficit.",
            "If that were true, people who were starving would get really fat before dying of starvation.",
            "The fat in your body.  When your body needs energy and it can’t get it from recently consumed food (ie glucose or glycogen) it turns its sights on your body fat! \n\nIt’s why humans have fat.  To provide energy (to hunt and gather) when there’s no food available for a few days.",
            "Your body gets energy from fat stores. This is how people survive when like they're in an emergency situation for days or weeks without absolutely any food the average person that's at a healthy weight can survive for quite a while on their own fat stores.\n\nStarvation mode goes hand in hand with the notorious plateau. This is why they recommend only eating at a 500 calorie deficit to maintain your current weight by doing that you're not completely shocking your system by way under eating what your body is expected. Your body wants to preserve your current weight. This is even more true for someone that is carried weight for long periods of time versus someone that gained weight over like the winter.",
            "Stored fat, muscle, and inn extreme cases, starvation means your body will eat it's organs."
        ]
    }
}