{
    "★OFFICIAL DAILY★ Daily Q&A Thread June 22, 2024": {
        "title": "★OFFICIAL DAILY★ Daily Q&A Thread June 22, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/loseit/comments/1dlrf2a/official_daily_daily_qa_thread_june_22_2024/",
        "content": "# Got a question? We've got answers!\n\nDo you have question but don't want to make a whole post? That's fine. **Ask right here!** What is on your mind? **Everyone is welcome** to ask questions or provide answers. No question is too minor or small.\n\n**TIPS**:\n\n* Include your stats if appropriate/relevant (or better yet, update your flair!)\n* Check the [FAQ](https://www.reddit.com/r/loseit/wiki/faq) and other resources in the sidebar!\n\n*Due to space limitations, this may be a sticky only occasionally.* ***Please find it daily using the sidebar if needed.***\n\n**Don't forget to comment and interact with other posters here, let's keep the good vibes going!**\n\n*Daily Threads*\n\n* [**US Accountability Challenge**](https://www.reddit.com/r/loseit/search/?q=author%3AMountainlioness404d%20title%3Aaccountability&restrict_sr=1&sort=new): Stay accountable with friends from North America.\n* [**EU Accountability Challenge**](https://www.reddit.com/r/loseit/search/?q=author%3Avisilliis%20title%3Aaccountability&restrict_sr=1&sort=new): Stay accountable with friends from the EU.\n* [**Daily Q&A Thread**](https://www.reddit.com/r/loseit/search?q=title%3A%22Daily+Q%26A%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Post your questions, receive answers.\n* [**SV/NSV Feats of the Day**](https://www.reddit.com/r/loseit/search?q=title%3A%22SV%2FNSV%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Share your scale victories and non-scale victories.\n\n*Weekly Threads*\n\n* [**Day 1 Monday**](https://www.reddit.com/r/loseit/search?q=title%3A%22Day+1%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Introduce yourself and share your goals and strategies.\n* [**Tantrum Tuesday**](https://www.reddit.com/r/loseit/search?q=title%3A%22Tantrum+Tuesday%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Share your complaints, vents and gripes.\n* [**Weigh-In Wednesday**](https://www.reddit.com/r/loseit/search?q=title%3A%22Weigh-in+Wednesday%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Share your weigh-in progress and graphs.\n* [**Track with Me Thursday**](https://www.reddit.com/r/loseit/search?q=title%3A%22Track+With+Me+Thursday%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Make new friends and find accountability buddies.\n* [**Foodie Friday**](https://www.reddit.com/r/loseit/search?q=title%3A%22Foodie+Friday%22+author%3AAutoModerator&restrict_sr=on&sort=new&t=all): Share your favorite recipes and meal pics.\n* [**Century Club**](https://www.reddit.com/r/loseit/search?q=title%3A%22Century+Club%22+author%3ASmilingJaguar&restrict_sr=on&sort=new&t=year): For those who have lost or would like to lose 100lb+.",
        "num_comments": 8,
        "comments": [
            "Hi! I (F, 140 lbs) have been trying to lose weight for the last few months but only started taking it more seriously this past month. My goal weight is 130 lbs, but I haven't made any progress towards it and feel very frustrated and stuck. I track my calories and try and remain in a deficit of 1500 calories and I also try and walk at least 30-60 minutes per day. I also don't eat necessarily unhealthily, like my diet is pretty well-balanced, I just crave sweets a lot more than I used to and I try to fit them into my deficit. Is there something I'm doing wrong? Or is there something I can do to make more progress?",
            "Can someone help me with converting weight? So I've gone from 126 lb to 125lb. According to Google, 126 is 9 stone, and 125 lb is 8 stone 9 lb. But there's 14 lb in a stone. I feel like Im being really dumb but surely 125 should be 8 stone 13? I'm really bad at maths so sorry if the answer is obvious",
            "Um is it normal to get sick when u go on a diet? Cuz I’ve been eating pretty much different types of salads. And got sick after that like flu like symptoms and shit. Compared to like my old diet which was pretty much just carbs and sugar🧍🏾‍♀️",
            "> and remain in a deficit of 1500 calories \n\nBy this do you mean that you're eating an average of 1500 a day, or do you mean something else? \n\nPlease post your stats and a general description of your daily activity...\n\n**Your stats:** inclue your age, sex, height, starting weight, current weight, and goal weight, and a few words about the physical activity of your typical day (exercise and non-exercise).   This helps others help you, or to get an idea about you or your effort, or to even become inspired by you.  Customary and optional but helpful.\n\n> Examples:  \n\n> * 25M 5'9\" SW:225 CW:200 GW:160 Desk Job with jogging habit\n> * F/33 5'4\" SW:14 stone (196 lbs), CW:14 stone  (196), GW:not-sure at-home mom chasing the children\n> * 34F 168cm SW:73kg CW:68kg GW:whatever looks good -- full time busy retail clerk\n\nPlease add these to your subreddit [flair](https://support.reddithelp.com/hc/en-us/articles/205242695-How-do-I-get-user-flair).",
            "126 divided by 14 = 9 stone exactly\n\n125 divided by 14 = 8.928571429 ... so that's (8 stone) plus (0.928571429 times 14 pounds in a stone  = 13 pounds) ... 8 stone 13 pounds ...",
            "The low-carb dieters (e.g. keto, etc.) experience what they call the [keto flu](https://www.health.harvard.edu/blog/what-is-keto-flu-2018101815052).",
            "18F 5'4\" SW: 140 CW:140 GW:130 work part-time in retail and try and walk regularly for at least 30 minutes. By 1500 I mean that it's the maximum number of calories I eat in a day",
            "Oh gosh, I see... Thank you for explaining, I never would have figured that out haha"
        ]
    },
    "Summer 2024 Olympics at Home Loseit Challenge - SIGNUPS OPEN": {
        "title": "Summer 2024 Olympics at Home Loseit Challenge - SIGNUPS OPEN",
        "score": 9,
        "url": "/r/LoseitChallenges/comments/1di1o5h/summer_2024_olympics_at_home_loseit_challenge/",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Calories in versus out\n\nHey, a general question from a person trying to be in a caloric deficite. If I consume 1800 kcal and my total burnt (Apple Watch tracker) that day is 2100 kcal I will lose weight. If the next day I workout and my total burnt goes up to 2500 kcal, can I eat 2200 kcal and still lose the same amount of weight? Should I long term just eat 1800 kcal regardless of the extra calories burnt that day??? Thanks, I’m just so confused",
            "Calorie burnt trackers are notoriously inaccurate, up to 50%. If you plan on being in a low-ish deficit like 300kcal, I would not eat back any of the extra kcal except for exceptionally high kcal burning days, like a long hike for exemple. I'd just treat it as a help for a little faster weight loss otherwise.",
            "Responding to my own comment: I asked ChatGPT and it told me I should in fact eat more to stay in the same 300 kcal deficite. (Do we agree with ChatGPT?)",
            "Last night I was in a ~600-700lkcal deficite because of working out and strictly eating the limit and I went to bed hungry and had trouble falling asleep.. is that just something to deal with?",
            "No",
            "It depends on how long you've been tracking kcal intake and been at a deficit. If it's still new to you it could only have been that you're not used to eating less yet. It could also have been that you've been eating the right amount but using the wrong foods. 1700 kcal of potato will be way more filling than 1700 kcal of pizza for exemple. It's hard to judge with only one occurence. If you were really hungry, i'd advise you to get something filling but low kcal, like an apple, some cucumber or broccoli. It really helps with feeling full."
        ]
    },
    "What was your reason why?": {
        "title": "What was your reason why?",
        "score": 40,
        "url": "https://www.reddit.com/r/loseit/comments/1dls7wa/what_was_your_reason_why/",
        "content": "What was your reason to lose weight? \n\nI was thinking back to a couple of years ago when I kept making and cancelling an appointment with a dietician at my GP practice. I’ve been wanting to lose weight for years but it took me until 2 months ago to buy a scale, download a calorie tracker and to actually buckle down and do it. \n\nFor me, I think it was my first year of medical school. We’re always told that obesity is bad for your health by our doctors and public health campaigns, but for me, it took a whole year of being exposed to complications of obesity to actually make the choice to lose for myself. It’s not what I wanted for my life. \n\nBeing exposed to so much information about obesity also made me notice the effects on myself even more. I was getting winded faster, I could barely walk 20 minutes without getting out of breath and stopping. I was always tired and my mood fluctuated wildly. I think after that, I stopped lying to myself and actually started losing properly. ",
        "num_comments": 53,
        "comments": [
            "I want to look hot whilst I'm still \"young\" enough for that to be feasibly possible.",
            "Knee pain so bad I can't sleep some nights. I am not obese, but I am overweight. The weight is NOT the reason for the knee pain - I have hyperextentia (extra stretchy) which can cause a lot of problems. For me I have acute scoliosis, flat-feet, and a bunch of other issues, including tendonitis in my knees. But, even if the weight isn't causing the pain, it certainly isn't helping! I am confident I can get my knee pain to a manageable level if I get down to a healthy weight.",
            "I wanna be [strong like b*tch who fight bears](https://youtu.be/7k0ZPRTgDiQ?si=IJjfSUtyUG701ylj). I'm a marshmallow, I wanna become 𝚜𝚝𝚎𝚎𝚕",
            "My reason was my mom. She is also overweight and diabetic. She had a knee replacement surgery a few years ago and had a LOT of complications due to her weight and health issues, eventually causing her bone to get infected. They took out the knee replacement, put in a spacer until the infection cleared, then attempted it again. The same thing happened. So they took it out again and told her that they would not repeat the surgery a second time. They gave her the option to keep the spacer in her knee and essentially no longer have a knee and need a walker or wheelchair to get around, or to amputate the leg.\n\nMeanwhile, I’m over here with two perfectly good legs that work just fine, and I was wasting it. I didn’t want to go through what my mon went through, so I decided it was time to get my life together. I’m down 100 pounds since then.",
            "Shallow reasons: I like what I look like when I’m smaller and more fit. It’s more appealing to me. I hated when I realized I went up a pant size.\n\nNot shallow reasons: my feet were hurting, my back was hurting, one of my knees was acting like it wanted to go out, couldn’t sleep on my stomach as well anymore- couldn’t really sleep at all anymore because I had pain radiating through my limbs and focusing on my joints. I couldn’t keep up with my dog anymore, hiking was painful. I like reading medical books so I have some head knowledge on obesity and what it does. I gained 40 lbs last year, possibly more, January came and I decided I had enough pain and mood swings and started losing.",
            "Met a girl i thought liked me so i started taking weight loss more seriously. Didnt work out but so at this point its just for me",
            "I had a double chin, my tummy and ass were huge, my inner thighs rubbed and chaffed if I wore a dress, my Bp was too high, I used to be slim and athletic and didn’t recognise me anymore. This was only 10kg more than I am now but at 5’1 tall it made a massive difference. I’m now 5kg away from my goal weigh",
            "I'm a paramedic who sees the end result of medical issues related to being overweight. And not just the direct health issues, but also the practical issues of being unable to get you out of the house when you're having an emergency because you don't fit on the ambulance equipment. Combined with watching my family have health issues that I'm now at greater risk for, I decided I wanted to try and do everything I can to minimize those risks moving forward.",
            "Originally it was because I wanted to be look like the characters I loved (I was 17, this was in the 90s). Now, it's because I want to live long enough to see all my kids into adulthood and watch them become the people they're going to be. Less chance of dying early if I return to my pre-pregnancy weight. I was also just super uncomfortable obese. I couldn't wait to shrug the weight off and get running again. All my joint issues have basically gone even though I'm not back to my original weight yet.",
            "Well I’ve done it a few times now, usually due to shame and vanity. This time was no different - my husband took a video of me at our youngest’s birthday party on 12th May and I did not like what I saw! Started CICO the next day and am currently down 11lbs with about 44 more to go."
        ]
    },
    "Officially under 300lbs! First time since middle school ": {
        "title": "Officially under 300lbs! First time since middle school ",
        "score": 172,
        "url": "https://www.reddit.com/r/loseit/comments/1dlg3tp/officially_under_300lbs_first_time_since_middle/",
        "content": "I'm 299.0 as of this morning! I've fallen in love with working out and now running! I just started running a few weeks ago, but do it 4 times a week now and only a mile at a time 😅 but today I ran 2!! Did it take 37 minutes? Yes and did I take 2 short walking breaks? HELL YEAH I did and I'm still so proud. I don't know how attach a photo here since we can't do attachments, but 50 pounds down I can finally see the change in my comparison photos I did today! I feel like I was annoying everyone at work talking about it, so I shut up and I gotta post here.\n\nThis group has helped me so much, I haven't felt alone once in this, once I found it here 😊 Everyone keep working at it, if I can do it you can!! Find an exercise you enjoy even a little bit, I promise you'll find something and weight flies off, at my size either way 😅. Also bonus you can eat a little more",
        "num_comments": 8,
        "comments": [
            "Congrats!! I'm at my gw but still too self conscious to run so I use an elliptical lol",
            "Congrats!",
            "Congrats!! You should be very proud of yourself",
            "Congratulations!! You should be VERY proud!",
            "I feel so silly every time for the first few times, now I don't even care! There's nothing more rewarding that knowing I ran 1 mile and the runner high is a real thing",
            "Thank you!",
            "You guys are all so amazing ❤️ thank you a bunch!",
            "Omg thank you!! For the first time in my life I'm in awe of myself 🥰"
        ]
    },
    "What's the best way to handle not being able to fall asleep without eating something?": {
        "title": "What's the best way to handle not being able to fall asleep without eating something?",
        "score": 14,
        "url": "https://www.reddit.com/r/loseit/comments/1dlslah/whats_the_best_way_to_handle_not_being_able_to/",
        "content": "Solutions I thought of:\n\nIntermittent fasting to move my food back closer to bed time (historically hasn't worked for me because whenever I do IF I end up binge eating even more calories when it is time to eat)\n\nMake dinner my biggest meal instead of lunch?\n\nDon't eat anything between lunch and dinner and take those foods and move them to before bed instead?\n\nWhat do you guys think? It's really difficult because I just cannot fall asleep if I don't have something to eat before bed and I will literally just lay there miserable.",
        "num_comments": 18,
        "comments": [
            "I just plan for some calories as a late night snack. I typically only have a small snack at lunchtime, or skip lunch, depending on how I feel. And I plan to save around 200 for a little something before bed. I try to focus on protein, but sometimes it will just be some toast. Dinner is also my biggest meal of the day by far.",
            "Don’t torture yourself. It’s not sustainable. Just factor a late night snack into your calorie budget.",
            "Eat something very low or zero calorie. If you're hungry eat. Watermelon, cucumber, peppers are all very low in calories and will not \"break the bank\" as a snack.",
            "Liquids fill me up. Between dinner and bedtime, I often have a cup of tea or coffee. Or you could try a carbonated water with flavoring. The caffeine doesn't affect my sleep, but if it would for you, use decaf.",
            ">Make dinner my biggest meal instead of lunch?\n\nThis for sure\n\n>Don't eat anything between lunch and dinner and take those foods and move them to before bed instead?\n\nI tried this and it worked for a while, as well as IF, but then I started to get too hungry during the day and that caused me to either overeat anyway at night because I was so hungry at that point, or to just cave in and eat too much in the middle of the afternoon and therefore back to the original problem at night.\n\nWhat worked for me was popcorns and a Ninja Creami lol. My sweet spot is to leave 200kcal for after dinner. 200kcal of popcorns are a satisfying amount for a savory snack. And 200kcal of protein ice cream made with that machine is a super satisfying amount for a sweet snack.",
            "I drink coffee. I know some people can’t have caffeine, but I have no problem going to sleep right after and it cuts back the hunger a bit. Have you tried just drinking water or tea before bed? Often just having something in your stomach, even liquid, helps",
            "Oh I’m the same!\n\nPartly it’s habit. Your body is just USED to getting the sleep time snack so something feels off if you don’t get it. \n\nBut the time at which you eat doesn’t inherently change the basic calories in calories out equation. You can eat whatever you want before you fall asleep. \n\nTrack how many calories your sleep time snack is. Either adjust your meal times so that one of your meals / snacks is the sleep time snack so you have an overall calorie deficit. Or lower the calories of your sleep time snack so that you have an overall calorie deficit.",
            "I (m, 190cm, current BMI 28, goal BMi 25), do it like this (Budget around 2200kcal): \n\nNo breakfast or snacks before noon\n\nSmall lunch (500-800 kcal) around noon (11:30-12:30)\n\nRest of Budget for dinner / snacks between 6 and 8pm\n\nOn my first IF try, I waited till 2pm and I started fantasizing about food like crazy and went overboard at the cafeteria\n\nIt works much better for me like this \n\n\nAlthough I heard there is considerable differences in what might work better for males/females in terms of IF, especially when it comes to breakfast. Maybe you might wanna research some of that.\n\nFor me it's just so much easier to be hungry when working than to be hungry at home",
            "How much do you need? Because you can just put a bit of your dinner in the fridge and eat it right before bed. Those calories are then already budgeted and you can keep your bedtime snack.",
            "Grew up having sleep for dinner a lot."
        ]
    }
}