{
    "MOD NOTE: Reminder about spoiler policies": {
        "title": "MOD NOTE: Reminder about spoiler policies",
        "score": 15,
        "url": "https://www.reddit.com/r/lotr/comments/1d3o5rn/mod_note_reminder_about_spoiler_policies/",
        "content": "There's been an influx of posts today about a certain announcement regarding Amazon's *Rings of Power* series that have violated our spoiler policy. This is a reminder to remember the following rules.\n\n1. **No spoilers in post titles!** If that means you have to change the post title (e.g., when sharing an article or something) so be it. *Posts with spoilers in the title will be removed*.\n\n2. **All posts about unreleased media need the spoiler tag.** Specifically, if you're discussing season 2 of RoP, use the spoiler tag. It's less important for the anime film and the newly announced Gollum film because so far we know very little about them and almost everything is speculation, but you can't go wrong using the spoiler tag. I can and will add the spoiler tag to posts that lack it (and need it) but repeat offenders may find their posts removed. It costs nothing to add it.\\*\n\n\n\n\\* ^(You do not need to add spoiler tags to discussions of any material that is already released, that is, the books, the Jackson films, etc. This applies only to new material.)",
        "num_comments": 1,
        "comments": [
            "This is a good warning for me to be careful about what I read on my feeds. It would be great if there was a \\[Spoiler Headlines Warning\\] post here whenever there's a bunch of spoiler headlines going around the internet, so I can steer clear of the media news sources for a couple days."
        ]
    },
    "I absolutely love Théoden's \"oh sht. serious?\" face before being attacked by the Witch King.": {
        "title": "I absolutely love Théoden's \"oh sht. serious?\" face before being attacked by the Witch King.",
        "score": 4694,
        "url": "https://i.redd.it/je2jadcmtz7d1.png",
        "content": "that's it. that's the post. :)",
        "num_comments": 162,
        "comments": [
            "I love the part when he shouts “reform the line! Reform the line! CHARGE!!!” Fearless even in obvious death",
            "RIP Bernard Hill.",
            "Face of a guy who knows he's dead if he fights it, but has no option other than to fight it.",
            "My headcanon is that he knew immediately, as he heard the screech and turned to look, that this would destroy the morale of his riders, and that’s why his face fell. Its not a “Oh I’m going to die”, as he, already quite old, knew that he was going to his likely death, its a “All of my riders who see the Witch King kill me are going to have their courage shattered”.\n\nHe was just yelling “Rally to me! To me!” All the Rohirrim in the vicinity’s eyes are on him, their king, right as (assuming Gandalf or indeed his own scouts explained who was riding the flying mounts) the enemy commander, the Witch-King of Angmar itself (himself also realizing the massive threat that the King of Rohan posed as a figurehead and strategic leader of several thousand raging light and heavy cavalry, and moving swiftly to deal with it and lessen the damage to his siege assault) diving straight for him. \n\nThat would be crushing, and it shows on Theoden’s face, to know that there was just a chance they could drive the orcs away from the city, and now knowing hundreds of his men are going to see him be slain by a wraith riding a fell beast, right as the tide was turning in their favo\n\nEdit: also, Theoden must have sensed, with all the intuition of a great leader, that his men needed a quick rallying pep talk to keep their fires going, and so he also knows he’ll be killed before he can deliver that rousing speech he was just about to launch into to keep them going hard",
            "Theoden led the Rohirrim on a death charge into pikes and archers, and defeated them handily; he again fearlessly led the charge to take down massive oliphants, rallying his men to his side; and just when victory was in sight, the mother fucking Witch King shows up on his fell beast. Theoden’s face in this picture is that of a battle-weary warrior-king who had exhausted his every fiber to save his people and all of Middle Earth. “What the actual fuck?” he thought to himself.",
            "I think about this a lot. It's perfect. It's not fear or panic or even anger, it's... injustice? Exasperation? It's the \"really? _really?_\" of a person who's had rotten luck all day and then misses their bus.\n\nHe's not afraid to die. He's just annoyed that he's being taken out of the fight.",
            "*record scratch* yup, that’s me, king of Rohan. You’re probably wondering how I got in this situation…",
            "I believe the Rifftrax comment here was “Oh, FML”",
            "“Oh, come ON.”",
            "I always interpreted this face to mean, “Oh, fuck me.”"
        ]
    },
    "Never taking her off": {
        "title": "Never taking her off",
        "score": 746,
        "url": "https://i.redd.it/1paua0l0u08d1.jpeg",
        "content": "",
        "num_comments": 18,
        "comments": [
            "ngl I thought you were talking about the cat",
            "got a couple Eyes of Sauron in the background looking jealous",
            "Cat seems suspicious of it",
            "I spend too much time on cat subs to realized this isn't a cat post.\n\nNice collar ornament for Catagorn.",
            "Cute! My husband got me an authentic Evenstar necklace from NZ for one of our anniversaries. \n\nAnd My husband has the One Ring for his wedding ring and I have Galadriel's Nenya. \n\nhttps://www.lotrjewelry.com/ the website where we got everything from.",
            "I hope you have this to your boyfriend or husband instead of the other way around. You know for canonical accuracy",
            "So for anyone following this thread and interested in where I got this it is the petite version of Arwen’s Evenstar, an authentic movie replica from the Noble Collection! It retails for $99, more affordable than a lot of sites and it seems cheaper as time has passed. I’m seeing them sell it through Amazon for even cheaper at around $50. Badali Jewelry also sells beautiful LOTR themed pieces- the most beautiful take on Galadriel’s Nenya I’ve seen and likely my next purchase! Also crazy affordable around $130.",
            "Tevildo doesn't seem too amused.",
            "Anyone know why the elfstone was usurped",
            "I understand the urge, I don’t want to take mine off either, but please don’t sleep with it, those are a lot of pointy bits that can cause pain and injury, not to mention what could happen if the chain gets pulled tight around your neck."
        ]
    },
    "Minas Morgul": {
        "title": "Minas Morgul",
        "score": 512,
        "url": "https://i.redd.it/5yehh2fi808d1.jpeg",
        "content": "Big fan of Minas Morgul. In most all adaptations, it looks awesome. The water and bridge surrounding, and the ghastly glow around the fortress. Always curious to see what it looks like inside. ",
        "num_comments": 22,
        "comments": [
            "*”Upon the further side, some way within the valley’s arms, high on a rocky seat upon the black knees of the Ephel Dúath, stood the walls and tower of Minas Morgul. All was dark about it, earth and sky, but it was lit with light. Not the imprisoned moonlight welling through the marble walls of Minas Ithil long ago, Tower of the Moon, fair and radiant in the hollow of the hills. Paler indeed than the moon ailing in some slow eclipse was the light of it now, wavering and blowing like a noisome exhalation of decay, a corpse-light, a light that illuminated nothing. In the walls and tower windows showed, like countless black holes looking inward into emptiness; but the topmost course of the tower revolved slowly, first one way and then another, a huge ghostly head leering into the night.”*\n\nMinas Morgul always makes me sad. It was beautiful, once.",
            "This is Minas Morgul as seen at a distance from the mmo Lord of the Rings Online (LOTRO).\n\nhttps://preview.redd.it/6vksm320018d1.jpeg?width=1920&format=pjpg&auto=webp&s=a5180be4a0bd2b4463320249696209881ff5995c",
            "Just to give credit to the artists, the top image is from the film, the second can be accessed [here](https://www.artstation.com/artwork/lxxeaV) (Rui Gonçalves on artstation), and the third can be accessed [here](https://www.deviantart.com/ralphdamiani/art/Minas-Morgul-897370142) (Ralph Damiani on artstation).",
            "Shadow of War has you play in Minas Ithil before it falls, and Minas Morgul after, and it's really well done, IMO.",
            "The second of the Two Towers. SO amazing. Maybe it's better if we don't know what's inside there, some things are perfect the way they are.",
            "10/10 would watch this episode of Cribs",
            "Mornis Miguel.",
            "Same! The call to war by the Witch King in RotK is my favourite moment in all three movies! ♥️💚",
            "LMFAO.....  I can't anymore....",
            "Beautifully written by Tolkien, gotta say"
        ]
    },
    "Who should be Lúthien in a Live Action?": {
        "title": "Who should be Lúthien in a Live Action?",
        "score": 1162,
        "url": "https://i.redd.it/c4wb8j28sx7d1.jpeg",
        "content": "Honestly, I can't think of any actress who can do that. Lúthien is described as the most beautiful woman who ever lived, above even Arwen. ABOVE ARWEN. And I don't know if I can think of any woman more beautiful and captivating than a young Liv Tyler, do you guys have any ideas?",
        "num_comments": 440,
        "comments": [
            "Described in canon as \n\n>the most beautiful of all living things\n\nSo… are you trying to start a war?",
            "Danny Devito of course",
            "Edith Tolkien",
            "There're no women in the world beautiful enough to portray her.",
            "Damn I hope this post has perfectly normal and healthy comments ☺️",
            "Real question: who’s gonna play Huan?",
            "The only correct answer for me to find pics of Tolkien’s wife and find an actress that resembles her.",
            "liv tyler again",
            "**Jennifer Connolly** could have done it.",
            "I remember before LOTR movies released people said Cate Blanchet wasn't pretty enough to play Galadriel because she's described as the fairest of all in Middle-earth.\n\nPersonally, when it says \"fairest in all the land\" or anything similar, I don't take it literally. I imagine that person to be someone who is really beautiful but not like someone goes around all of arda measuring the beauty of every female person and then tot's it up on a leaderboard.\n\nIn a movie adaptation screen presence is what heightens the beauty to that next level. So, in that sense, beauty comes second to screen presence."
        ]
    }
}