{
    "MOD NOTE: Reminder about spoiler policies": {
        "title": "MOD NOTE: Reminder about spoiler policies",
        "score": 14,
        "url": "https://www.reddit.com/r/lotr/comments/1d3o5rn/mod_note_reminder_about_spoiler_policies/",
        "content": "There's been an influx of posts today about a certain announcement regarding Amazon's *Rings of Power* series that have violated our spoiler policy. This is a reminder to remember the following rules.\n\n1. **No spoilers in post titles!** If that means you have to change the post title (e.g., when sharing an article or something) so be it. *Posts with spoilers in the title will be removed*.\n\n2. **All posts about unreleased media need the spoiler tag.** Specifically, if you're discussing season 2 of RoP, use the spoiler tag. It's less important for the anime film and the newly announced Gollum film because so far we know very little about them and almost everything is speculation, but you can't go wrong using the spoiler tag. I can and will add the spoiler tag to posts that lack it (and need it) but repeat offenders may find their posts removed. It costs nothing to add it.\\*\n\n\n\n\\* ^(You do not need to add spoiler tags to discussions of any material that is already released, that is, the books, the Jackson films, etc. This applies only to new material.)",
        "num_comments": 1,
        "comments": [
            "This is a good warning for me to be careful about what I read on my feeds. It would be great if there was a \\[Spoiler Headlines Warning\\] post here whenever there's a bunch of spoiler headlines going around the internet, so I can steer clear of the media news sources for a couple days."
        ]
    },
    "Uh...they're what...?": {
        "title": "Uh...they're what...?",
        "score": 2726,
        "url": "https://www.reddit.com/gallery/1dqsbxe",
        "content": "",
        "num_comments": 325,
        "comments": [
            "MOD NOTE: ***Please remember to put spoiler tags on these posts, folks.*** I'mma start deleting them if I have to, and no, I *don't* care how many upvotes the post has.",
            "\"She's all revved up\" is the cringiest thing they could ever come up with.",
            "Wait is it for real? This is like real advertisement for tongs of power? Because I genuinely thought its a meme",
            "When you downloaded the wrong lots of the rings movie",
            "Hard to read these headlines when my computer is shaking so much from the vibrations of Tolkien spinning in his grave.",
            "We can't have anything nice, and this is why. I hate this.",
            "You see, \"modern audiences\" think you can't be a strong woman and be traditionally feminine in any way.  The fact that Galadriel saw through Sauron straight away because she lived in the blessed realm, crossed to middle earth on a perilous icy path requiring an iron will, wielded Nenya, and broke Dol Guldur with her fucking mind weren't enough.  She has to be a bloodthirsty sword swinging hard drinking badass.\n\nAnd I guess \"his cruelty, his malice, and his will to dominate all life\" weren't clear enough indicators of why Sauron is the BBEG of two entire ages",
            "And here we see another example of crooked words from witless worms.",
            "God that's an awful wig",
            "Im assuming these are quotes lifted from the actors but why would they choose those of all things"
        ]
    },
    "My third lotr weta statue🗿😍": {
        "title": "My third lotr weta statue🗿😍",
        "score": 136,
        "url": "https://www.reddit.com/gallery/1dr7ddi",
        "content": "Uruk-hai Swordsman",
        "num_comments": 15,
        "comments": [
            "Statues you can hear! \nLovely.",
            "Hey OP, where did you buy this from? Thanks",
            "Damn. Saruman gotta have a good gym.",
            "Hi , this statue is like 8yo old limited by 1500pieces , i was lucky and buy it from some guy in my city",
            "Lucky !!!",
            "Niceeee",
            "Let's see the others",
            "Dam very cool!",
            "I say balrog next",
            "That's really good!"
        ]
    },
    "I just bought my very first copy. The '93 Complete Edition for just 5€! Is that worth anything?": {
        "title": "I just bought my very first copy. The '93 Complete Edition for just 5€! Is that worth anything?",
        "score": 88,
        "url": "https://i.redd.it/5wkyj8v1wh9d1.jpeg",
        "content": "Sadly the condition isnt that great tho",
        "num_comments": 25,
        "comments": [
            "It's worth a good read.",
            "Not really worth more than what you paid. It goes for like 4-10 online.\n\nStill! It's a cracking edition with that cover illustration. It's the edition I first read when I was a kid back in the 90's.",
            "Thats the same one I had , I leant it to my sister and I got it back literally falling apart, she also has my game of thrones season 1 dvd that she borrowed  , I dont lend things to my sister anymore",
            "It's worth 5, as you've just demonstrated.",
            "Its worth exactly what you paid, no more no less.",
            "Yeah. It's worth your time.",
            "I had that edition till my friend's dog ate it",
            "That's my edition. I have a hardback too but it's more for display, it's not the copy I regularly use.",
            "I've got that exact copy....I wouldn't sell it for the world",
            "That cover makes me so nostalgic... Oh, to be a young lad again, leafing through this magical tome for the first time, the lyrical pages leaping off the spine, reaching out, pulling me in..."
        ]
    },
    "Chart: How to turn the Lotr Trilogy into a Miniseries": {
        "title": "Chart: How to turn the Lotr Trilogy into a Miniseries",
        "score": 359,
        "url": "https://i.redd.it/zu2imw1bae9d1.png",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Meanwhile theres me, binging multiple movies in a single day lol",
            "My partner wanted to watch the Extended Editions, but with our limited free-time, watching anything for nearly 4 hours in one sitting is not doable. I divided the three movies into 9 \"episodes,\" trying to ensure each one has a strong narrative arc on its own. Already we've had a few friends who're new to the movies watch them this way and reports have been good. Treating it like a TV-Show and watching just one 'episode' a week is fun too.",
            "Now only thing we need are names for each episodes",
            "My blu ray extended editions have 2 discs for each movie so it splits them down the middle. Turns them into like 8 2-hour movies and makes them easier to consume in chunks like this",
            "Fantastic idea!\n\nA while ago I found fan-edit versions of the films that split each extended movie into two sections as per the books. This has made a much easier watching experience as a time-poor adult!",
            "Omg. I might use this for when I finally get to show my SO Lord of the Rings. Shes more than willing to watch, but is not the biggest movie watcher and has admitted she may struggle a bit with staying focused on movies as long as they are.",
            "Well, Lord of the Rings only have three parts. Seems quite mini to me.",
            "The series is a single episode",
            "I used to do that but 22 years later my focus and wakefulness isn't the same anymore. It gets super tedious after about 4 to 5 hours. \n\nMy body is broken.",
            "Could you roughly say what part of the story each \"episode\" ends at, please? I figure you picked parts where there's some kind of jump or breather in the story."
        ]
    }
}