{
    "New flair! SFW-NSFW": {
        "title": "New flair! SFW-NSFW",
        "score": 57,
        "url": "https://www.reddit.com/r/lotrmemes/comments/1bmy44a/new_flair_sfwnsfw/",
        "content": "Hello, friends!\n\nWe often see reports on posts which imply nudity or pornographic content, but rarely is anything explicit shown. Those types of posts are permitted under our rules. So long as there is no explicit nudity shown, it's all good in our book. To that end, we have created a new tag, 'SFW-NSFW.' This should help properly mark these types of posts. Happy posting!",
        "num_comments": 16,
        "comments": [
            "So… still no hobbit porn allowed?",
            "What SFW stands for",
            "I never noticed anything. Not complaining. If there's a meed for it, then ok.",
            "Hahah, awesome!",
            "why are you subtracting both haha",
            "What about DALF?\nSurely we need it",
            "Can someone fix the bots so original memes can be uploaded again.",
            "That's great but please capitalise it or I will go insane",
            "The bot is blocking my posts when my account is older than 7 days and has over 3k karma. I tried messaging the mods and didnt get an answer so I'm leaving a comment here.",
            "Hobbit porn is just a cookbook with full pictures."
        ]
    },
    "Who played better the role of Bilbo?": {
        "title": "Who played better the role of Bilbo?",
        "score": 2849,
        "url": "https://i.redd.it/kgy34hmbi28d1.jpeg",
        "content": "",
        "num_comments": 446,
        "comments": [
            "They're both fantastic tbh",
            "DON'T SCARE ME LIKE THAT. For a second I thought Martin Freeman passed.",
            "Both were fantastic. Ian did a wonderful job of playing elder Bilbo while Martin effortlessly mirrored Ian’s performance as a young version of him. Great casting.",
            "https://preview.redd.it/1gkz9mdv538d1.jpeg?width=736&format=pjpg&auto=webp&s=2b86d9e96c36fceb0a9131dbc2565aec56d1129e",
            "Ian Holm was a seriously talented actor. That scene where Bilbos temper flares when Gandalf tells him he should leave the ring, he turns from a quirky kind old hobbit to a nasty Scrooge flawlessly",
            "![gif](giphy|3o7aCRloybJlXpNjSU)",
            "Both are great. Martin Freeman is holding the hobbit trilogy on his own!",
            "This would be like asking if Alec Guinness or Ewan MacGregor did a better obi-wan, they were both great and I don't think either actor would outdo the other if they swapped movies",
            "They look pretty similar now that you see them side by side",
            "They both played the Bilbo that was needed at the time."
        ]
    },
    "Samwise got the best gift": {
        "title": "Samwise got the best gift",
        "score": 1429,
        "url": "https://i.redd.it/18uhlzwnr28d1.jpeg",
        "content": "",
        "num_comments": 61,
        "comments": [
            "That stove sure looks like a pan.",
            "Sam’s cast iron is better and healthier than teflon coated cookware. This meme is a fail.",
            "That's not a stove it's a frying pan.",
            "Cooks👏don't👏want👏 teflon👏 cooks want earth from Galadriel’s garden to resow the Shire and grow the best damn potatoes that ever existed, prepared in a non-toxic cookware.",
            "Sam's face says it all. \"Tanks but nae tanks, miss\" (hands it back).",
            "In addition to what everyone says about how Teflon is shite, I’d also add him being a master cook, Sam would appreciate that there’s a time and place for a pan that ISN’T non-stick. Sometimes you want those brown bits stuck at the bottom of the pan so you can de-glaze for maximum flavour. Galadriel probably knows this, too.",
            "She wouldn't give him a carnigenic coated pan, she'd give him a ceramic coated non-stick pan ... Teflon should not be allowed near food, especially not when being heated.",
            "How do you fuck up a pan for a stove?",
            "Really bad job with this one haha",
            "A stove? Umm what"
        ]
    },
    "What would you choose?": {
        "title": "What would you choose?",
        "score": 617,
        "url": "https://i.redd.it/25clmuvls28d1.jpeg",
        "content": "",
        "num_comments": 202,
        "comments": [
            "The dwarves didn't go extinct, rather they sealed themselves off completely inside their halls, hidden from the outside world and prospering in their own world.",
            "Entwives live in the old forest",
            "Legolas' bow. Turning it into a cannon would make things positively hilarious.",
            "Frodo found peace after sailing into the west",
            "Radagast doesn't have bird shit running down his head.",
            "Have a section of story where the Eagles get one of their massive nests raided by Sauron’s forces so people would STFU about why the Hobbits didn’t fly into Mordor.",
            "Bill the pony should have appeared riderless and joined in on the charge of the Rohirrim",
            "War In The North events",
            "The shield skateboard trick legolas did in the movie at Helm's should be added to the books.",
            "It's actually pronounced \"Jandalf\""
        ]
    },
    "If Disney purchased LOTR": {
        "title": "If Disney purchased LOTR",
        "score": 362,
        "url": "https://i.redd.it/ejwakesim28d1.jpeg",
        "content": "",
        "num_comments": 40,
        "comments": [
            "Someone Sauron returned",
            "Add In the multiverse to the slop trough.They should add in the hobbits riding eagles to a universe where Sauron is good and Mordor is nice but everything else is shit and evil😂",
            "The video games already have a second ring.",
            "“We didn’t have enough material to use for the movies, but only a bunch of passionate writers who tried to make some stuff”\n\nThe writers: “Somehow, Sauron returned”",
            "This is the worst possible nightmare",
            "Sauron kinda forgot about the second ring",
            "That’s a pleasant surprise, good to hear.",
            "(Ringwraith soars by on a fell beast)\n\n\"They fly now?!\"",
            "Shadow of War actually did this",
            "But he was deceived for yet another ring was made"
        ]
    }
}