{
    "S11E26 (Friday 28th June) - \"A trip to the Terrace causes turbulence 🔥\"": {
        "title": "S11E26 (Friday 28th June) - \"A trip to the Terrace causes turbulence 🔥\"",
        "score": 8,
        "url": "https://www.reddit.com/r/LoveIslandTV/comments/1dqr6w2/s11e26_friday_28th_june_a_trip_to_the_terrace/",
        "content": "# Episode synopsis:\n\nJoey is hoping his kiss with Jessy can remain between them, but secrets never stay secret in the Villa!\n\n[Watch the First Look on YouTube here!](https://www.youtube.com/watch?v=aMQM8ng5GQI)\n\n**Check out these other threads:**\n\n* ['How to watch outside the UK' megathread](https://www.reddit.com/r/LoveIslandTV/comments/1d6m4dk/how_to_watch/)\n* [Previous discussion threads](https://www.reddit.com/r/LoveIslandTV/search?q=flair_name%3A%22DISCUSSION%20THREAD%22&restrict_sr=1&sort=new)\n* [Couple status](https://www.reddit.com/r/LoveIslandTV/comments/10329kb/love_island_uk_all_seasons_couple_status/?utm_source=share&utm_medium=web2x&context=3) (updated regularly)\n* [S11 💖🏝️ How To Watch Outside the UK! Discord discussion here](https://discord.com/invite/PwSSwgEVvb)",
        "num_comments": 2888,
        "comments": [
            "Grace is fully blaming Jessy. Like girl, have some empathy, you’ve literally been in that position and it was only like a week ago!",
            "Grace is kinda directing energy to Jessy and it’s not fair",
            "We’re missing out on Ronnie in Casa, this is a travesty",
            "\"As a girl, I wouldn't have kissed him\" - Grace\n\nYOU WERE MAKING OUT WITH HIM WITH SAMANTHA RIGHT THERE YOU MENACE!",
            "\"He did give me that reassurance\" Mimii girl 😭 is the reassurance in the room with us?",
            "Oh stfu Grace is it disrespectful you was doing this shit in front of Samantha",
            "“No way” as a response to “my mum died when I was 10” is so 😭 poor girl didn’t know how to respond",
            "Grace \"I wouldn't have kissed him\" ARE YOU FOR REAL",
            "BAAAAAAAAAAHAHAHAHAHAHHAHAH JOEY DID NOT JUST DELIVER A COFFEE TO JESSY WITH GRACE SAT NEXT TO HER this is cinema",
            "imagine if grace kissed omar, Joey would have killed everyone in that villa so his sudden hypocrisy is crazy"
        ]
    },
    "Daily Discussion Thread": {
        "title": "Daily Discussion Thread",
        "score": 7,
        "url": "https://www.reddit.com/r/LoveIslandTV/comments/1dr4fzv/daily_discussion_thread/",
        "content": "",
        "num_comments": 604,
        "comments": [
            "On the plus side, we will never have to hear the words genuinely and generally get mixed up again",
            "The daily mail is reporting that sean ex gf(were together 4years) found about the cheating from watching love island😬",
            "I doubt Wil and uma will come back by them selfs, because they didn’t have a chance to close things off or even have a date to solidify their couple , so not sure how that will go.",
            "Hehehe, I loved that bro side hug Ronnie gave to Harriet when they left the villa. They will not last a week.",
            "So how many Casa people will say this year that they’re going to take everyone’s men, step on toes, won’t mind breaking up a couple and so on. There’s always someone like that and then ends up doing none of that at all.",
            "I've realised the producers basically choose who they want to keep, they run a poll with the public and if it meets who they want to dump, they'll use that. If it results in someone who they want to keep, they'll make the islanders choose, 80% of the time it probably gets rid of/keeps who the producers want",
            "It’s interesting how Harriett and Lucinda (S7) used to be friends and they were both dumped right before Casa in their respective series.",
            "People are complaining they'll miss the drama, I'm just glad the dumping WAS the drama. They're normally so predictable it's not even worth watching",
            "I believe that both Wil & Ayo will stray. I see quite a few fans saying Ayo won’t stray and that he’s comfortable, but other than Uma, who’s been there to test him? None of the girls in have been interested in him, except maybe Jessy, who recently came in but was the producer pushed to pick Joey. \n\nIf there's someone who's Ayo's type in Casa Amour, I believe he would stray.",
            "That conversation Mimii and Ayo had in yesterday’s episode rubbed me the wrong way Ayo’s response to Mimii pretty gave me the impression that he’s settling for her and waiting for someone new to come in\n\nHopefully Mimii explores in Casa 🙏🏽"
        ]
    },
    "Sorry but can we just take a moment to appreciate…": {
        "title": "Sorry but can we just take a moment to appreciate…",
        "score": 387,
        "url": "https://www.reddit.com/r/LoveIslandTV/comments/1dr322z/sorry_but_can_we_just_take_a_moment_to_appreciate/",
        "content": "“I don’t understand why I’m going home….it must be Ronnie’s fault.” 🤣🤣🤣\n\nThe level of delusion is just astounding, I don’t even have words…\n\nKind of devastated she’s gone because she was fantastic entertainment value and I’m gutted we will never get to watch Jess calmly and serenely tear her a new one 5 seconds into a conversation again, but Jesus wept..\n\n",
        "num_comments": 88,
        "comments": [
            "Why wouldn't she think that? She got kept in with the vote a couple of days ago when she was with Sean. Plus, Ronnie's a super-prick.",
            "I don’t think it’s too much of a reach though, people dislike Ronnie for a number of reasons, they dislike him a hell of a lot more than Harriet so she’s got a point.",
            "Harriet was very entertaining. I was a little gutted to see her walk.",
            "I'll start by saying I dont think shes a bad person,  shes funny but pretty naive. I dont mean this to sound cruel but having met quite a few Harriet's in my life I think she's just quite a spoilt princess type who has always been tip toed around and made to feel like she's the centre of the world. She takes anyone disagreeing with her or conforting her about her behaviour as bullying and just cries so that they'll stop. She'll go round saying and doing what she wants but when she's on the receiving end she can't handle it 🫠 I know someone just like her who I've known to do and say some awful things but her parents in particular just back her even when she's done something wrong and never hold her accountable so she never realises that her behaviour wasn't acceptable so she just continues on with the genuine belief that she is never in the wrong.\n\nI do think Jess is right about her not being able to take it but she is also mean and disguises it as being \"direct\" 🤦‍♀️",
            "Im glad to see Harriet and Ronnie go. I dislike both of them but ultimately Harriet got them kicked out this week with her behavior pushing them to the bottom",
            "no I'm sorry Jess had to go. Like she was kind of hateful towards Harriet from the beginning when they both tried to talk to Ronnie. Harriet told her exactly what Ronnie was saying to her, then when Jess confronted Ronnie he lied to her face and basically said Harriet was lying. Jess doesn't like Harriet over a boy who didn't even really like her to begin with.",
            "I was gutted to see her leave, I’ll miss her and she will go down as being mentioned in the future for this season.",
            "Jess is a bully and you want to keep watching her “tear Harriet a new one”. Yikes Jess is a hateful woman and no one deserves to be treated the way she’s treated Harriet",
            "I can't stand Harriet so I'm super glad to see her gone.\n\nI really *really* wanted to see Ronnie go crazy in casa though.",
            "I would genuinely punch a baby to not have to hear her cry again. How has she gotten to that age without any level of maturity?\n\nMandatory disclaimer: No I wouldn't actually punch a baby"
        ]
    },
    "I don't understand the Cieran and Nicole audience love.": {
        "title": "I don't understand the Cieran and Nicole audience love.",
        "score": 173,
        "url": "https://www.reddit.com/r/LoveIslandTV/comments/1dr0trt/i_dont_understand_the_cieran_and_nicole_audience/",
        "content": "Their relationship is not sweet or cute; it's toxic. They are surrounded by so many eggshells that there is no way they will be able to find a smooth, healthy pathway to tred outside the bubble they are currently in. \nNicole has told him she needs constant reassurance. That's not the way to forge a secure partnership. ",
        "num_comments": 78,
        "comments": [
            "Ciaran dropping love bombs two days before Casa will be his downfall.",
            "They’re the only couple that has stayed together. That’s literally it. Any other season, they’d be an afterthought. The bar is in hell this season. ",
            "they're a couple that fits the audience's (facebook) taste the most. stable week 1 couple, white people, ciaran being the handsome popular guy with the girl who has strong feelings but insecure. they also had the least external drama so they haven't been tested with any bombshells since they got together.\n\ntheir lack of competition also helps, there are barely any solid couples. i also don't think people are truly in love with them as a pairing but the fact that they're the most stable and ciaran is by far the most popular guy.",
            "You see it a lot with couples where the girl is insecure and the boy constantly has to reassure her. I think it may be people who see themselves in Nicole living vicariously through them. Kind of a wanting someone who “loves you so much” he will put up with any of your insecurities even if you treat them badly in the process kind of thing, which isn’t a healthy dynamic.",
            "I'm so bored by them. No investment in them as a couple whatsoever. It's partially production's fault because we just don't see them having any kind of interesting conversation at all.",
            "To me it’s a welsh thing. Right in the beginning Ciaran said that Welsh girls are always trying to wife up and it’s true (as a generalization). I was born there but moved away when I was young and I’ve seen the same behavior in my relatives. They do have a tendency to be more clingy, emotional BUT love big too. And I feel like that’s what we’re seeing here. To me it’s cute because it’s just how they are… Nicole is probably planning their wedding out in her head already, which is crazy because Ciaran is only 21… credit to him though he does seem more mature than tour average 21 year old. That body count would have been the end for me though 💀😂",
            "It's not toxic if you want example of toxic relationship on love island S10 Jess and Sammy. You people tend to forget everything and harp on things that happened past few days. Nicole and Ciaran was the strongest couple at the start they were getting no screen time bcs there was no fights nothing they were just chilling prob getting to know each other you could of always see them in background. Now you see Nicole being insecure when feelings coming to play  end of last week when Ciaran mentioned in beach hut that he's starting to catch feelings for Nicole everything went upside down Nicole probably started getting feelings aswell being more insecure always trying to overthink things and always fight over nothing but they would always talk it out after she would rant about it. Now past few episodes you again see them just chill in the background no drama no nothing just being together how can you say that is toxic, that girl just wanted to sabotage it bcs it felt too real too fast for probably both of them and that's why Ciaran wented to Ronnie about walking on eggshells.",
            "They aren’t toxic? It’s so jarring watching you lot act like young couples don’t argue. Additionally what woman won’t feel insecure when she finds out the guy she likes has a body count of 120+\n\n![gif](giphy|3o7ZeHhyyo6ZgRU3cY|downsized)",
            "Can we please ban the words toxic and gaslighting  from here - they’ve lost all meaning at this point. And reminder while we see a fair bit we only see a bit of their day and often the most dramatic bits",
            "I honestly don’t understand either and I never see anyone explain WHY they like them."
        ]
    },
    "Grace has memory issues": {
        "title": "Grace has memory issues",
        "score": 471,
        "url": "https://www.reddit.com/r/LoveIslandTV/comments/1dqtmr1/grace_has_memory_issues/",
        "content": "Grace is blowing my mind rn acting upset at JESSY when she did the exact same thing to Samantha. She and Joey humiliated Samantha snogging in FRONT of her the same day Joey broke off with her. It came across as incredibly cruel and spiteful from both of them and she was kinda belittling Samantha for acting upset when it was Joey at fault for giving them two different stories.\n\nI wasn't a fan of Samantha tbh. But Grace is ridiculous trying to play victim rn when she was fine with him leading on a normal gal for TWO WEEKS in front of national TV. Joke.\n\nTake it out on Joey ffs but don't forget you Jessy'd someone.",
        "num_comments": 111,
        "comments": [
            "yeeeeah \"as a girl, I wouldn't have kissed him\" was a wild comment when a couple of weeks ago he was with Samantha.... and she is a girl.... and she did kiss him",
            "Agree on all points! As Yewande said back in the day, what comes around goes around.",
            "And that is why I don’t feel sorry for her.",
            "She clearly thinks she’s above every other girl which makes “this situation different”\n\nLike she’s legit and the others a bits of fluff",
            "Someone please reply to this comment when grace leaves tonight",
            "i actually feel so bad for jessy like none of the girls are being nice to her its acc so sad",
            "She’s giving mean girl. Putting the green tea on the floor next to Jessy and then yelling about her",
            "I feel like she cared more for the moral high ground here to make herself look better in her head",
            "She thinks she’s better than everyone else and can get away with it but when it happens to her she can’t hang…",
            "Yes and no, Samantha and Joey were not even touching each other it's kinda different in my opinion when you start being more intimate it makes a relationship more serious"
        ]
    }
}