{
    "What is the best memory you share with your significant other ?": {
        "title": "What is the best memory you share with your significant other ?",
        "score": 205,
        "url": "https://i.redd.it/l3pj0vrhhd9d1.jpeg",
        "content": "What made it meaningful to both of you? Have you ever tried to repeat the experience you had at that time? What was memorable and special about it? ",
        "num_comments": 70,
        "comments": [
            "Hey Love Bug thanks for sharing the love. If you see something posted here that is not in the spirit of love Please flag it. ;) With Love r/Love Mods \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/love) if you have any questions or concerns.*",
            " 44 years with my old man. So many memories. The time he barged into the hair salon looking for me frantically. On our honeymoon. The night we conceived our second child. Overhearing him on the phone bragging about me to his family. And the new memories we are making now.",
            "Tonight was amazing. We parked outside of a concert happening and could hear the music in my car in the parking lot . Windows down , it was red hot chili peppers.  He use to do it with his mom back then.  We sat outside the amphitheater and heard it all very clear . Had some drinks and walked around. When we were talking , a June bug hit his head , landed somewhere in my car , flew at us, and went into the windshield defroster vent. I shined a light outside of the windshield, and he got the bug out with a pocky ! A freaking chocolate stick , which are amazing, by the way . We sat and chatted more,  and it was nice.  He saved my life, haha . I was freaking out, haha . I wanted that bug out of there . It latched on , it was an eventful night !. Free concert, and no flying bugs in my car win win . Best memory was tonight and the first night I came over for the first time ever.",
            "I’m sadly not with her anymore (I still absolutely love her though), but my best favorite memory of us was, we were at IKEA (she had never been) and we were sitting on a couch in one of their staged rooms. I sat with my arm around her and she scooted closer to me. Just sat and talked and we both agreed it felt like home and that all is right with the world. I miss her and I pray that we come back to each other and love each other even better than we loved each other before.",
            "First kiss. I have a lot of amazing memories with him but when I read this question, I immediately thought of our first kiss. I will always hold it dear to my heart. The way he kissed me and the way his voice softened in a way I hadn’t heard before then made me melt. Even replaying it in my head right now makes me melt. I love him so much and our earlier days will always have a place in my heart.",
            "Having a whole entire day ahead of us and unintentionally staying up until 0530 getting stoned. We ended up agreeing we can't fall asleep because we won't be awake in time to start the day and then having her pass out with her head on my shoulder. I looked at her and how peaceful she was sleeping and couldn't have brought myself to wake her in a million years and in turn, falling asleep right there holding her. We had stuff to do at 0900- we woke up to her dad knocking on the camper door at ~1125. It was the most amazing thing ever but I hope to one day best even that. I love you Bebo <3",
            "we went to dallas snd some of our “friends” invited us out to a bar but we didn’t really like that lifestyle so we decided to take my moms car through the city and take turns listening to the exhaust as we drove through and listened to pop music for a whole tank of gas just enjoying the lights and we got so tired we got velvet taco and then we realized omg we’re more than friends … 🖤",
            "our first date we were swimming in the ocean and literal dolphins swam by us!! 4 years later and we are married!",
            "Probably the first time I kissed her. We went to go see a movie and after we stood outside of the parking lot and talked a little bit and when the conversation had ended she just kinda stood there and she was purposely waiting for me to make a move. A few seconds later I grabbed her chin lightly and leaned in for a kiss. We kissed and smiled at each other. It was a huge win because I knew from then on we were gonna date and we have been since. I love her so much, I’m very lucky to have her.",
            "When you both laughed so hard that you couldn't breathe, that's the best memory."
        ]
    },
    "For the first time in 10 years, I feel like I'm ready to be married and build a life again ": {
        "title": "For the first time in 10 years, I feel like I'm ready to be married and build a life again ",
        "score": 28,
        "url": "https://www.reddit.com/r/love/comments/1dr1s7b/for_the_first_time_in_10_years_i_feel_like_im/",
        "content": "For context: I got knocked up by my then-boyfriend  when I was 19. We were planning adoption until he inevitably told his religious mother. I was convinced to be married before the baby was born and the marriage almost ended my life. I was in such a dark place and I couldn't find my way out. \n\nAfter that, I didn't want to trust anyone again. Not with my my life, my heart, my finances, nothing. I wanted none of it, and I was ok with that. I did get into another relationship after that, and I thought it was going to be ok. That relationship turned toxic to the point of violence and once that started, I beelined out of it. That was 5 years ago now. I have been happy on my own, never desiring any companionship enough to risk my own stability, which I believed any relationship would do to me. All the people I've met who pursued me just turned me away from the idea more and more. \n\nImagine my shock and surprise when this glorious man entered my life. I was up front with everything, no relationship, no commitment, just sex and that was it. He agreed, like all men do, and assured me that he wouldn't ask for more from me than I was willing to give. When we first met in person, I felt like I was a teenager again. I felt shy and asked him what he wanted to do, giving him an option of hanging out or, seeing the bedroom, but he asked if we could hang a little and get to know me a little more. Well, I couldn't shut up about my favorite show and telling stories. But he sat there and listened to me, asking questions appropriately. We had texted a month beforehand, so I knew what he was about. I did shut up long enough to actually have a conversation with him, but his presence just made me feel so comfortable, so at ease. I never felt so comfortable like this before. We ended up talking for 4 hours before I stopped myself and just turned to him and said I wanted to fuck him. And we did, 4 separate times that night, and the morning! He kept me company while I got ready for work and it just felt so natural. \n\nThat was 9 months ago and we've been inseparable ever since. He's made me feel so confident and sexy in ways that I haven't felt in a long time. He's so patient and kind, and he understands me when I get too excited and forget my words. He always makes sure I'm ok and I don't need to say anything to him when I'm not - he knows when I'm not. I can tell him things about my past and he's never once passed judgement, even on some of the darker stories I have. He's always willing to listen to me, and he loves my stories. The more time we spend together, the more I think we're the same person. I've never met someone so compatible to me, someone who is so kind without an agenda. \n\nHe's met my kid, which I never thought I'd feel comfortable with that with anyone. Hell I don't even let certain friends around him. But my child loves him! They love the same videos on YouTube, they both love space facts, they both love games and so much more. \n\nFor the first time, I can see a real future with somebody. I can see a real future outside my role as a mother. He's willing to walk by my side, no matter what we face. He still holds true to what he promised me. He allows me to grow and flourish and be myself unapologetically, just like I do for him. He's goofy and funny, loves to dance with those hips and always has a beat he's drumming to. \n\nI love this man. I know he loves me just as much. I can't wait to see what we grow into. \n\nThank you for reading. ",
        "num_comments": 5,
        "comments": [
            "Hey Love Bug thanks for sharing the love. If you see something posted here that is not in the spirit of love Please flag it. ;) With Love r/Love Mods \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/love) if you have any questions or concerns.*",
            "I’m glad you’ve found fulfilment and happiness, OP.",
            "A wounded heart being healed. My hopeless romantic streak is appeased.",
            "Ah great story, I was worried for a second but this was wholesome",
            "Thank you ❤️ I'm still getting used to this peace, but I think I'm finally ready to accept it"
        ]
    },
    "What are words of platonic love in your culture that seem odd to outsiders? ": {
        "title": "What are words of platonic love in your culture that seem odd to outsiders? ",
        "score": 165,
        "url": "https://www.reddit.com/r/love/comments/1dqpznl/what_are_words_of_platonic_love_in_your_culture/",
        "content": "In my culture and around the people I was raised around it is extremely common to address everyone from strangers to paid professional caregivers as \" my love\" . It is not intended in any sexual way, but a way of expressing care and compassion. \n\nFor example, at the grocery store I need someone to grab something for me. I might say \"Carino\" Would you be so kind as to get that for me? \n\nAs I leave, I say thank you, darling to the cashier.\n\nAs I walk past the cart recovery employ thank you, wonderful \n\nAll platonic.\n\n\nHow does your culture express platonic love with words? \n\nlove ya random reddit user 💗",
        "num_comments": 97,
        "comments": [
            "Hey Love Bug thanks for sharing the love. If you see something posted here that is not in the spirit of love Please flag it. ;) With Love r/Love Mods \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/love) if you have any questions or concerns.*",
            "We usually insult our close friends on a regular basis",
            "Does queer culture count?\n\nI'm a gay man and I call all my friends babe and sexy. I call people king and queen too, and have actually bowed to people before.",
            "i know a few cultures do this but in Turkish, it’s common for parents to call their kid ‘mom’ or ‘dad’ as terms of affection.",
            "I think my country would use \"my dear\" as platonic. Btw this topic is really sweet and wholesome, got me thinking for a while to find if my country has something like that and realized we do have one!",
            "Sweetie, dear, darling, honey, sweetpea, junebug,  sugar-pie, sweetie-pie, puddin, sweet cheecks... so many others. It's all about the context, gender of the other person, tone, and inflection in your voice.",
            "Maybe it's too obvious but \"te quiero\" literally means I want you in Spanish which doesn't seem strange in a romantic context but it's said even between family members.",
            "I'm from the south. Baby, honey, sweetheart, darling, are all terms you'd expect to hear from people you've never met before.",
            "I am loving your culture already. I think it's such a beautiful/warm way to talk to people. \n\nCariño, would you be so kind to tell me where you are from? <3",
            "My culture is like this as well!  We always say “my love” or “my dear” type of thing."
        ]
    },
    "Just want to gush about a girl I met a month or so ago on here ": {
        "title": "Just want to gush about a girl I met a month or so ago on here ",
        "score": 19,
        "url": "https://www.reddit.com/r/love/comments/1dqznx5/just_want_to_gush_about_a_girl_i_met_a_month_or/",
        "content": "\n\nI met her on a subreddit. She reached out to me after her and I had talked a couple times. I was surprised but figured why not and her and I started chatting. Fast forward about a month and her and I talk pretty much every day. She’s really smart and sweet and I just enjoy talking with her. Shes just awesome, and I’m hoping things continue to go well with her as I really like her so far ",
        "num_comments": 12,
        "comments": [
            "Hey Love Bug thanks for sharing the love. If you see something posted here that is not in the spirit of love Please flag it. ;) With Love r/Love Mods \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/love) if you have any questions or concerns.*",
            "Aww, may that feeling last always, or at least feel like forever, in a good way! 🎊",
            "I love you baby 🥰 we will last baby(hopefully). Thank you for writing about me 🫂",
            "Go for it man. Go ask for her soc-med and try to ask her out. Maybe this is the right time.",
            "I'll be waiting for you in the gym, brother 🫡",
            "If only we could go on a double date! Also met my girl on a subreddit over a month ago. I still have a to confirm what our official date is of being GFs but guess it’s safe to say when we started exchanging ILYs. We’re in our mid 30’s and nothing beats the feeling until now it still feels so surreal.\n\nGood luck and congrats to us and our partners! 🥰",
            "\"I love you\" after only a month 🚩",
            "He already asked me out 🥰 hehe thanks for your encouragement",
            "Sorry ? The person who wrote the thing is the person I’m talking to. I’m who he is referring too.",
            "That's sweet.  Enjoy these moments!"
        ]
    },
    "Sudden breakup due to visa / moving. How to move on? Help!": {
        "title": "Sudden breakup due to visa / moving. How to move on? Help!",
        "score": 1,
        "url": "https://www.reddit.com/r/love/comments/1dreo0d/sudden_breakup_due_to_visa_moving_how_to_move_on/",
        "content": "It’s been a month now since my(27F) ex bf(28M) suddenly decided to break up with me. He was having a hard time finding a job in the city and his visa is expiring soon. 3 days before the break up we were together and he was so loving… His reason was that he will most likely have to go back to his country in a month or two and there is no reason staying together for the remainder of the time and making it even harder of a breakup. I had no idea he would leave so soon, as he was supposed to stay here a couple years. He also didn’t expect it.\n\nIt hurts so bad since nothing bad happened between us. We were only together for 4 months and it’s the most I have ever felt for someone. I used to think I was a stone cold b*tch for never really having fallen in love with someone before, but it finally happened and now here I am. Alone. \n\nI am not a serial dater so being alone was always easy. Now it feels like hell, and Im relapsing (MDD). I am getting help, new meds, therapy. Friends, family and hobbies. But I have this overwhelming URGE to text him. We agreed we couldn’t stay friends due to our feelings. But he did stay “let’s keep in touch “. I promised myself I wouldn’t reach out as it’s too painful.\n\nHow do you move on from such a frictionless breakup? I don’t want to end up with a “the one who got away” and I am so scared he will be on my mind forever… We ticked all of each other’s boxes and then some…\n\nI can’t kill the hope of reuniting. But I know it’s impossible for the foreseeable future (I just landed my dream job here).\n\nAnyone ever moved on from such a breakup?\n\nThank you. :)",
        "num_comments": 1,
        "comments": [
            "Hey Love Bug thanks for sharing the love. If you see something posted here that is not in the spirit of love Please flag it. ;) With Love r/Love Mods \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/love) if you have any questions or concerns.*"
        ]
    }
}