{
    "Damn it V, so much for quiet! Saul's gonna be- wait, did you just go and kill literally everyone?": {
        "title": "Damn it V, so much for quiet! Saul's gonna be- wait, did you just go and kill literally everyone?",
        "score": 199,
        "url": "https://i.redd.it/0h08ccz0n28d1.jpeg",
        "content": "",
        "num_comments": 21,
        "comments": [
            "I hate scripted car chases in this game, so I make sure to rescue Saul as quiet as possible to avoid getting chased later ;)",
            "V: \"MEEP.\"",
            "Is there a reaction for speed?",
            "V's stealth missions never go as planned. Classic Cyberpunk.",
            "Is it still successful stealth if I murder everyone with Guts before Sandevistan runs out?",
            "\"Yes, Panam I killed them - with a dildo.Why do you look at me like that?\"",
            "That's what I do with my sandevistan or berserk build.",
            "Redditors can be wild, but that’s part of the fun.",
            "The wraiths have to die.",
            "With any game that is me when stealth is optional. Optional stealth? Time to break out the minigun!"
        ]
    },
    "Name this band": {
        "title": "Name this band",
        "score": 257,
        "url": "https://i.redd.it/f1kiojd4v08d1.png",
        "content": "",
        "num_comments": 54,
        "comments": [
            "Our Cracks",
            "Big V and the Cracks",
            "Them holes",
            "Tight Slacks",
            "The Himbos & The Banshees.",
            "Femz&Twinkz",
            "Mid Life Crisis",
            "Glam holes",
            "アスホイプ\n\nASUHOIPU\n\nASSWHIPE",
            "V, K, and the Heartbreakers."
        ]
    },
    "I swear I can never focus on Takemura with this guy STARING at me while weirdly eating his burger": {
        "title": "I swear I can never focus on Takemura with this guy STARING at me while weirdly eating his burger",
        "score": 638,
        "url": "https://i.redd.it/053bgrctky7d1.png",
        "content": "",
        "num_comments": 28,
        "comments": [
            "For me, it’s the waitress standing there taking his order the whole time… while he’s eating",
            "I really like it, it's common with all of Takemura's meetings. There's always someone watching.",
            "Dude's just trying to enjoy his burger and you're eye-balling him. For shame.",
            "That's Hamburgo Arasaka.",
            "\"Look at me V. I know you can read my thoughts...\n\n... meow meow meow meow, meow meow meow meow, meow meow meow meow meow meow meow meow.\"",
            "That's the point. It's an ilustration of the theme of his dialogues.",
            "The everlasting burger ",
            "He was just eating his burger.... MENACINGLY",
            "I'm just glad 2.0 put the pizza in the plate instead of half way on lol I kept turning to look at it",
            "Ok I wasn't the only one 😂😂😂"
        ]
    },
    "Am I the only one who really loves the retro business style of the netwatch agent? Would love to see more clothing options like this": {
        "title": "Am I the only one who really loves the retro business style of the netwatch agent? Would love to see more clothing options like this",
        "score": 653,
        "url": "https://i.redd.it/i5cucx24jy7d1.jpeg",
        "content": "In a world where all the fashion is super loud, flashy, over the top, there’s something kind of cool about the drab monotony of an old school retro stripy shirt and tie. Combined with the sick head cyber ware and badge that gives authority, I honestly think this guy is one of the best designed characters in the game. I really would love some options like this for my corpo playthrough. Does anyone know of a mod to get this outfit or something similiar? (…. Can anyone make one hahaha) ",
        "num_comments": 49,
        "comments": [
            "Since I first laid eyes on him. I absolutely LOVED his style.",
            "Mosley’s design is top tier.",
            "Totally agree. It actually annoys me how difficult it is to find halfway normal clothing. It’s especially difficult to find dress shoes for fem V that aren’t fuck-me pumps or clown shoes",
            "\"Hi yeeaaahhh, your doing a really great job at mitigating that black wall. Really well.\"\n\n*Sips coffee*\n\n\"So well infact, Net watch could really use your help over the weekend so uhh...yeaahhhh....\"\n\n*Sips coffee*\n\n\" I'm going to need you to come in on Saturday, yeeaaahhh. I know it probably won't be a problem, so Thanks so much, I really appreciate it.\"\n\n*Sips coffee and maintains eye contact*",
            "He's so hot oh my lord.",
            "Or even better his fckn cyberware, fckn insane there’s no cyberware cosmetics in a game set on a world where technological body enhancements are at the core of society",
            "I loved this interaction so much, wish there were more moments like this where someone earnestly tries to convince you to switch sides - actually prove and debate the facts. \n\nFelt very respectful, like as a player, I was placed on equal footing with another person that had their own goals, values, and things to gain/lose depending on how things went. \n\nIdk, the other “who do you side with?” Dilemmas just didn’t hit like this one.",
            "Looks like a chad, keeps calm under pressure, even smites your enemies before they do that to you. This man is the goat.   \nShould have been a love interest for female V.",
            "One of my fav missions in the game.He's just too cool, also fuck voodoo boys.",
            "Anyone who dosent help this guy is a twat honestly."
        ]
    },
    "Trying out portraits in photo mode": {
        "title": "Trying out portraits in photo mode",
        "score": 70,
        "url": "https://i.redd.it/0vryqngsa18d1.png",
        "content": "",
        "num_comments": 3,
        "comments": [
            "So much better than the \"portrait\" overlay frame that wastes 70% of the available resolution.",
            "mods:\n\n* [glasses](https://www.nexusmods.com/cyberpunk2077/mods/7435)\n* [mask, headphones, shoulder+elbow+knee pads, tac vest, neck brace, radio, plating](https://www.nexusmods.com/cyberpunk2077/mods/13212)\n* [bodysuit](https://www.nexusmods.com/cyberpunk2077/mods/8636)\n* [tights](https://www.nexusmods.com/cyberpunk2077/mods/3491)\n* [cyberware](https://www.nexusmods.com/cyberpunk2077/mods/4548)\n* [body harness, shoulder strap w/ pistols](https://www.nexusmods.com/cyberpunk2077/mods/3041)",
            "so i cant do this in base game \n\n:("
        ]
    }
}