{
    "If you had to choose... ": {
        "title": "If you had to choose... ",
        "score": 652,
        "url": "https://www.reddit.com/gallery/1dqxeun",
        "content": "",
        "num_comments": 117,
        "comments": [
            "I think I remember the Trauma Team suit description saying they're one of the only uniform that imposes respect in this city \n\nPretty much sums up why I'd only apply to their taskforce",
            "If we're choosing who wins a fight, maxtac hands down. If we're choosing who comes to help me, trauma team. The other two wouldnt hesitate to kill me if they benefited",
            "Max Tac and it’s not close. Trauma Team gonna need Trauma Team to come back from those problems.",
            "Trauma team only because I’d be actually attempting to save people. Might not be saving the best people but in 2077 who really is right?",
            "Maxtach seems to have the most crazy tech, but they all seem to be living on the edge of full-blown Cyberpsychosis which is a hard no for me. Probably Trauma Team. Saving lives sounds nice",
            "Max Tac all the way, trauma team is a close second. Fuck NCPD",
            "Trauma team. Ncpd is just a complete shit show from all the funding issues. And maxtac... I'm just not willing to bring myself to the brink of cyberpsychosis to do that line of work.",
            "Why on earth does MaxTac carry handcuffs lmao",
            "trauma team\n\nI like to save lives but can take them if need be.",
            "Trauma team because max tax is essentially just beating up druggies and the mentally unstable"
        ]
    },
    "Quickest Gig Ever": {
        "title": "Quickest Gig Ever",
        "score": 855,
        "url": "https://v.redd.it/xpeke1rbyc9d1",
        "content": "",
        "num_comments": 36,
        "comments": [
            "I love how Dakota actually acknowledges that you did that so quickly too",
            "Net runner build checking in and this is how I did things. Cam my way in and destroy or sneakily takeout the OBJ and then murder hobo rampage to clean up/loot. So much funnier getting the \"Good job on discretion V\" as I stand covered in blood on a pile of dismembered bodies because I stole the laptop data, jumped out the window, walked down the street and THEN came back in guns blazing through the front door.\n\nIf you want an insane net runner experience, get the automatic heal item, and run your overclock and make an entire building suicide from your car outside.",
            "But... the wraiths... you've got some mad saves on your bloodlust and vengeance stats, I'll give you that.",
            "But no enemies go boom :(",
            "If you're doing a sandy build you could also just hit it with a sniper rifle.",
            "Decided to beef up my sandevistan knife-thrower build with mods, so I basically just stop time like David, throw knives, and resume time once I’m behind cover and the knives kill ‘em all at once. It’s so fucking fun, nobody ever even knows I was there",
            "They left all those scavs alive back there...",
            "Net runner builds are the GODs of the Cyberpunk world",
            "I didn’t know you could quick-hack from inside a hacked camera",
            "I did the same exactly the same thing"
        ]
    },
    "You’re pretty good V-Hideo Takemura ": {
        "title": "You’re pretty good V-Hideo Takemura ",
        "score": 99,
        "url": "https://www.reddit.com/gallery/1dr0kbp",
        "content": "",
        "num_comments": 10,
        "comments": [
            "“You must get me to the float to talk to Hannako! I have some really surrealistic imagery I have to show her!”",
            "Side note: I tried shooting up the outside of the diner, shooting through the door and even tossing a grenade inside and *nothing* makes that guy stop eating that burger during the cutscene",
            "I would bottom for him no homo tho😏",
            "You should post this on insta. Hideo loves stuff like this.\n\n.",
            "How did you get him to look like this?",
            "\"FUUUUUUCK. I don't care if Kojima WAS trying to Metal Gear his way past my security! Send him up, I want to see the new Death Stranding!\"",
            "Gameplay reason:NPCs attached to quests are invincible before,during and after the quest that they are a part of.\n\nFunny reason/better reason: he did not want to miss his chance at getting an autograph from Hideo Takemura (and still missed his chance).",
            "Cyber.... PUNK",
            "That can happen with a mod you know [https://www.nexusmods.com/cyberpunk2077/mods/11077?tab=description](https://www.nexusmods.com/cyberpunk2077/mods/11077?tab=description) [https://www.nexusmods.com/cyberpunk2077/mods/9594](https://www.nexusmods.com/cyberpunk2077/mods/9594) if you have both Lizzie's Braindances and the Kojimura mod Takemura is selectable from the menu to have sex with and well I will let you fill in the rest",
            "[https://www.nexusmods.com/cyberpunk2077/mods/9594](https://www.nexusmods.com/cyberpunk2077/mods/9594)"
        ]
    },
    "If V were to work for MaxTac, would they go in alone, or be part of a unit?": {
        "title": "If V were to work for MaxTac, would they go in alone, or be part of a unit?",
        "score": 25,
        "url": "https://i.redd.it/3r5vrfpgrg9d1.jpeg",
        "content": "V has dealt with many cyberpsychos over their time on their own, so my question is, if V were to join MaxTac, would they be part of a unit, or sent in alone?\n\nBefore you say, yes, we all know V already said in game that they will never join MaxTac, but what if they did choose to? Given their skill in taking down cyberpsychos on their own, and alive, I think MaxTac have a valuable member on their hands, what do you all think, my choombas?",
        "num_comments": 11,
        "comments": [
            "They'd send a unit, but only V would survive.",
            "I would assume they'd be a part of a unit simply on the fact that as far as I'm aware, there are no MaxTac solo operatives.\n\nBesides, considering how MaxTac are themselves varying of cyberspycho and berserk breaks *are* a possibility, I wouldn't be surprised if MaxTac *has* to operate in a team just in case someone goes nuts mid op and has to be put down.",
            "V already is an absolute unit.",
            "after the third time they send V out with a standard deployment and the they all get zero'd but V walks off being dead again the top cop starts deploying him like Hellsing abridges Alucard",
            "V basically *is* a one-man MaxTac team when you do the cyber psycho bounties.",
            "they’d probably have v in a unit, but the unit would be using him/her as the main one to go after the psychos, like how they did with that woman during the mission in jinguji, she went in first and then the rest followed",
            "Depends.  Are we talking V at the start of the game?  If so they're in a squad.\n\nAt the end of the game, they are the squad.",
            "I think that Vs cyberpsycho record would more lead to MaxTac duties being given the contractor-treatment. \n\n\"We don't need to maintain a costly MaxTac unit, there are mercs out there who can take down the psychos.\"\n\nSo, V would replace MaxTac.",
            "This!",
            "With a correct build V would have no weakness, not even netrunners. \n\nMy V for example could take on the entire NUSA army and win. So V would absolutely work alone, maybe with like a netrunner support or something."
        ]
    },
    "Should I try Witcher 3 based on Cyberpunk?": {
        "title": "Should I try Witcher 3 based on Cyberpunk?",
        "score": 56,
        "url": "https://www.reddit.com/r/LowSodiumCyberpunk/comments/1dr0yv9/should_i_try_witcher_3_based_on_cyberpunk/",
        "content": "Cyberpunk was the first CDPR game I’ve ever played and ofc I love it, it’s one of my favorite games of all time.\n\nSo is the Witcher 3 a safe bet for me to also love? \n",
        "num_comments": 74,
        "comments": [
            "W3 is CDPRs magnum opus and its worth a play on its own merit, that said its a significantly different vibe from 2077 so just because you fw 2077 doesnt mean you'll fw W3 as well",
            "I still like Witcher 3 more than cyberpunk, Though both games are great.",
            "If you like medieval/fantasy settings go for it. In the first time I played I found it a bit confusing but I tried it again and I got the feeling to beat the game but yeah, its fun. \n\nThe structure of the game is similar to Cyberpunk. You can see and feel it was made by the same devs.",
            "Totally should. \n\nIt has a lot of the same strengths, stuff like lovable side characters, really sells the feeling of being a wandering problem solver. Combat is basic, but pretty much every quest feels handcrafted even when you’re using the same mechanics over ‘n’over. ",
            "Lots of story and tons to do, well worth a buy.",
            "Never finished playing Witcher 3 myself but I can definitely say it has a similar structure and you can tell it was made by the same studio. Like Cyberpunk, The Witcher 3 is very dialogue heavy. Gameplay wise, vastly different experiences. Cyberpunk’s combat can be very high octane and you can kill any enemy with any weapon, whereas Witcher 3’s combat requires you to have a bit more of a methodical approach when dealing with the various types of enemies. Give it a shot. There’s a reason why The Witcher series is CDPR’s golden goose.",
            "It's an open world RPG not that dissimilar from Cyberpunk, so yeah, definitely try it out. Some amazing writing there in the sidequests.",
            "Choom, based off of my own experience which was the exact same as yours I would say yes.\nI got Witcher 3 recently because of my love for cyberpunk and I’m loving it and now I want the books too!",
            "While Witcher 3 is no doubt a good game it's quite different.\n\nDepending on what you liked about cyberpunk there might be other alternatives like Deus ex, prey, mass effect or even starfield or so that are also interesting.",
            "I've started Witcher 3 multiple times and not gotten far. Very different combat system, and the setting and narrative don't really do much for me. And this is coming from someone who enjoys fantasy; there's just nothing that ever really clicked for me. \n\nThis isn't me saying you shouldn't try it, just that I don't think liking Cyberpunk is itself a good predictor of whether you'd like Witcher 3."
        ]
    }
}