{
    "Master List of Definitive App Comparisons - View and Contribute": {
        "title": "Master List of Definitive App Comparisons - View and Contribute",
        "score": 368,
        "url": "https://www.reddit.com/r/macapps/comments/13c1c7m/master_list_of_definitive_app_comparisons_view/",
        "content": "Over the last year, [r/macapps](https://www.reddit.com/r/macapps/)  users have contributed large volumes of data to help you find the best  Mac-compatible apps in various major categories. This post represents a  culmination of those contributions in one place where all can benefit and continue contributing updates.\n\n*Note:  Because these are populated to Google Sheets from user form submissions, the best viewing experience on mobile devices is through the Google Sheets app since it retains frozen columns/rows. Most mobile browsers disregard them and may not initially load the correct tab from the links below.*\n\n**View the Definitive App Comparison sheet here** (links go to the specific tab on desktop)**:**   \n[AI Apps](https://docs.google.com/spreadsheets/d/1JqyglRJXzxaj8OcQw9jHabxFUdsv9iWJXMPXcL7On0M/edit#gid=1177164211) \\[NEW\\] | [Browsers](https://docs.google.com/spreadsheets/d/1JqyglRJXzxaj8OcQw9jHabxFUdsv9iWJXMPXcL7On0M/edit#gid=1628450822) | [Calendar Apps](https://docs.google.com/spreadsheets/d/1JqyglRJXzxaj8OcQw9jHabxFUdsv9iWJXMPXcL7On0M/edit#gid=583051238) | [Email Clients](https://docs.google.com/spreadsheets/d/1JqyglRJXzxaj8OcQw9jHabxFUdsv9iWJXMPXcL7On0M/edit#gid=1036735176) | [Note Apps](https://docs.google.com/spreadsheets/d/1JqyglRJXzxaj8OcQw9jHabxFUdsv9iWJXMPXcL7On0M/edit#gid=469491148) | [Password Managers](https://docs.google.com/spreadsheets/d/1JqyglRJXzxaj8OcQw9jHabxFUdsv9iWJXMPXcL7On0M/edit#gid=1102167413) | [PDF Readers](https://docs.google.com/spreadsheets/d/1JqyglRJXzxaj8OcQw9jHabxFUdsv9iWJXMPXcL7On0M/edit#gid=110826423) | [Window Managers](https://docs.google.com/spreadsheets/d/1JqyglRJXzxaj8OcQw9jHabxFUdsv9iWJXMPXcL7On0M/edit#gid=456166567) *|* Clipboard Managers *\\[Planned\\]*\n\n**To contribute new apps, click a corresponding link to fill out a form with the details:**   \n[Add an AI App](https://forms.gle/NgVonw88oXpdwGMm9) | [Add a Browser](https://forms.gle/rbedZBnctSLVXCUU9) | [Add a Calendar App](https://forms.gle/p88rRjayYT2o43jB8) | [Add an Email Client](https://forms.gle/QjuTGbVNTJZjsQPp7) | [Add a Note App](https://forms.gle/cJwqGjkJ1GYgGE1o8) | [Add a Password Manager](https://forms.gle/ScoCcPuUHHdHECD2A) | [Add a PDF Reader](https://forms.gle/K2WFtv1huAdjH8oX8) | [Add a Window Manager](https://forms.gle/HbgJ8UHS4HZ8WJgSA) \n\nTo suggest a specific correction to an already-listed app, comment on a cell or here below. Please link to the source of your info if possible.\n\nAre you looking for a specific feature that is not listed? Ask below or share what's so great about your app of choice. Feel free to suggest additional app comparison types for future consideration.",
        "num_comments": 100,
        "comments": [
            "Would it be useful to add a row for whether the app is native or Electron-based? Of course, determining nativeness isnt always straightforward and can sometimes be controversial. But thats one of the first things I check for in productivity apps that need to be snappy. Weve also seen a few high-profile switches to Electron (1Password, Spark) with a major impact on user experience.",
            "This is great!  Kudos to putting together these lists.  I'd suggest a new category, budget/personal finance, since there are so many apps out there...it'd be great to see them compared.",
            "It would be nice to have a comparison of app uninstallers (with removal of leftovers, etc.).",
            "Thanks for the hard work on this list! Helpful!",
            "I'm looking at the Note Apps and it says Apple Notes can export to Text and Markdown. How do you do this?",
            "Can we get Tiddlywiki added to the Notes apps. I can give you the details if you want.\n\nIt's basically a standalone HTML file that you can use to take notes in almost any browser.",
            "Wow, that Notes app comparison table is massive and impressive. Thank you.",
            "Please note Airmail for Business is the perpetual license (one time fee) for Airmail.",
            "It would make my little overwhelmed-neurodivergent-person brain \\*so\\* happy if there were a table of contents for this!",
            "You are amazing! I have an additional column you could add. More companies, particularly large companies, are requiring SOC2 certificationcompanies. I can only download or integrate the ones that have this."
        ]
    },
    "Funny widget": {
        "title": "Funny widget",
        "score": 6,
        "url": "https://github.com/nate-parrott/ball",
        "content": "By one of Arc developers \n",
        "num_comments": 0,
        "comments": []
    },
    "Monitor current Apple Silicon performance in terminal (local LLM running on image)": {
        "title": "Monitor current Apple Silicon performance in terminal (local LLM running on image)",
        "score": 16,
        "url": "https://www.reddit.com/r/macapps/comments/1dr13tr/monitor_current_apple_silicon_performance_in/",
        "content": "https://i.redd.it/e0m4pfmz8f9d1.gif\n\nHey everyone!\n\nI made a console program to monitor system load and power consumption. It shows:\n\n* Monitor CPU (per cluster), GPU, and Memory usage\n* Track power consumption\n* Display average temperature\n* Customize colors and set your preferred update interval\n\nInstall it with Homebrew:\n\n    brew install vladkens/tap/macmon\n\nOr [download it manually](https://github.com/vladkens/macmon/releases/tag/v0.2.1).  \n  \n**Note:** It’s designed to work with Apple Silicon processors (M1, M2, M3).\n\nI’d love your feedback!",
        "num_comments": 3,
        "comments": [
            "thanks works better than mactop for me and without sudo",
            "On a MacBook pro M2",
            "https://preview.redd.it/8uuixfa5wg9d1.jpeg?width=1338&format=pjpg&auto=webp&s=031e30430e21ef33c781b0f5bfd358424e7b8fa1"
        ]
    },
    "Making a Case for Microsoft Edge for Certain Mac Users": {
        "title": "Making a Case for Microsoft Edge for Certain Mac Users",
        "score": 0,
        "url": "https://www.reddit.com/r/macapps/comments/1dr840m/making_a_case_for_microsoft_edge_for_certain_mac/",
        "content": "All of us use a browser and we choose that browser based on several criteria: speed, feature set, available extensions and privacy chief among them. Over the years I've used Netscape, Safari, Camino and Chrome but since 2023, I've used Microsoft Edge and it has proven to be quite the reliable workhorse. It's had free built-in access to Chat-GPT 4 through its CoPilot feature for quite a while. While there are some aggravating shopping and UI features, they are easy to turn off and hide. Unlike Safari, Edge offers a custom search engine feature. I work in a mixed PC and Mac environment in a workspace heavily reliant on Office 365, Teams, Outlook and One Drive. All of that is tightly integrated into Edge and makes for a relatively seamless experience.Here are the Edge features that really stand out:\n\n**Profiles** - I have one for work and one for personal. While the work one is subject to AD/Entra policy limitations as enforced by my job, the personal one is not, allowing me to install extensions and make other changes to my experience like separate bookmarks and themes. I can run both at the same time. The syncing between computers, phones and tablets is rock solid, the best I've seen in any browser.\n\n**Workspaces** - Within a profile I can set up a workspace with even further separate customizations. I have one for blogging and a general use one. I can move tabs between workspaces with a couple of clicks. They sync.\n\n**Collections** are separate from bookmarks in that they are user defined themes for groups of web pages you can easily access and open from within Chrome. I have collections for shopping, TV, software, reading list and Windows related material. They sync.\n\n**Speed** - Edge is faster than both Chrome and Safari on both of my Macs. It loads 30-40 tabs on startup very quickly.\n\n**Extensions** - Edge can use not only its own set of extensions but all of those developed for Chrome as well.\n\nIf you are concerned about Microsoft telemetry and you don't have to use Office, Outlook or One Drive, Edge may not be for you. You can install uBlock Origin and use DuckDuckGo for search to alleviate some privacy concerns but you can't defeat all of Microsoft's trackers. But, hey, they're not as bad as Googles!\n\n[My Full Review with extension suggestions](https://apps.louplummer.lol/post/making-a-case-for-microsoft-edge)",
        "num_comments": 16,
        "comments": [
            "The company I work for is a Microsoft shop, and I happen to be one of the few that forced them to buy me a Mac. I use Edge every day with many times 5-6 instances and up to 100 tabs open. It has no issues doing that and has vertical tabs to make it easy for me to jump between everything. Sounds like utter insanity, but edge handles my use with no problems.",
            "Thanks for this breakdown? Hows battery usage? And what renderer does it use?",
            "Edge is based on Chromium so why not just use Chrome?",
            "What does the custom search engine feature do?",
            "Its just ugly. I love Safari because it looks and feel nice. Also: Safari is not a spyware like chrome or edge.",
            "Safari auto fills the temp codes texted or emailed for two-factor authentication. Game over.",
            "Chromium. Battery usage in the use case I outlined is slightly better than other Chromium bowsers.",
            "Chrome doesnt have the same feature set at all, just the same renderer.",
            "Right when the new Microsoft Edge (using chromium) was released, or at least the new update for Google Chrome, Chrome will have some secret sauce that basically is anti-adblock. So for the weirdest reason(s), Microsoft Edge is or should be a cleaner Chromium (shocking and perplexing at the same time) than Google Chrome, until Microsoft screws up something somewhere, but we won't know when.",
            "Ooof that is bad. I'm currently using Arc. The vertical tab list is a game changer, so I'm interested in Edge. I also like how Edge creates child/parent tabs (which Arc doesn't do). But with that kind of battery murder, no thanks!"
        ]
    },
    "QR Generator Factory": {
        "title": "QR Generator Factory",
        "score": 1,
        "url": "https://www.reddit.com/r/macapps/comments/1dr7ylg/qr_generator_factory/",
        "content": "Hey Mac App Community!\n\nWe are Runecats a small development company, probably most famous for Roccat Browser.\n\nWe've decided to join Reddit on a mission to improve our app.\n\nFirst a bit about our app QR Generator Factory 5 is a pretty nifty but fairly niche app - it allows you to create QR codes, it allows both bitmap and vector exporting. It has a huge array of design options form pixel types, fill colors, graidents images. Background images, colors and graidents. It allows you to add your company logo or an image and position it, resize it and even add even has filters to modify it. It has smart bordering for logos so it will border any logo shape. There is also capiton settings with control of text size, kerning and colors.\n\nIn terms of content types QR Generator offers everything you would expect, from general text, URLs, maps, contact cards, payment options such as crypto, PayPal, UPI and SEPA. And many more. Each content type are pretty extensive so we feel it has everything you would require in both content types.\n\nWe also offer Dynamic QR's for Email type, URL type, Phone type and Social type.\n\nQR Generator Factory 5 allows batch export using an unheadered CSV file seperated by ,  it will create a QR code for each data point based on the settings already setup in the app.\n\n  \nThis is where you guys come in - we've been working really hard on this app and have spent over 2000 solid hours on this since we started working on this years ago. We've got the app where we want it to be - however we're sure there is room for improvement and we're looking for some geniune feedback. If you ae in the market for such an app we're happy to provide the app free of charge  in exchange for geniune feedback. If it's positive feedback then we'd like to know why it works and what works, if it's negative feedback we'd like to know what doesn't work and why and what could be added or improved.\n\nThis is the first time we have ever done anything like this so we're pretty excited!\n\nhttps://preview.redd.it/phw03yojjh9d1.jpg?width=1626&format=pjpg&auto=webp&s=a69f5c606efbd8a259e6e45fee495f2355aefa7c\n\nhttps://preview.redd.it/9bf2xtojjh9d1.png?width=2880&format=png&auto=webp&s=38513ee53809a7ba21874f167cf9dc7dd078e86d\n\nhttps://preview.redd.it/34kfdbdmjh9d1.png?width=2880&format=png&auto=webp&s=a6cb6042f791f7b435b09ca98d5132f94afbf149\n\nhttps://preview.redd.it/tzh6madmjh9d1.png?width=2880&format=png&auto=webp&s=8c3c5f83ff730f1b356e38db0797d8f47729f086\n\n  \n\n\n  \n[https://apps.apple.com/app/qr-generator-factory-5/id1594156737?mt=12](https://apps.apple.com/app/qr-generator-factory-5/id1594156737?mt=12)",
        "num_comments": 0,
        "comments": []
    }
}