{
    "The MBA Lounge: General Questions and Discussions — June 2024": {
        "title": "The MBA Lounge: General Questions and Discussions — June 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/macbookair/comments/1d5h79u/the_mba_lounge_general_questions_and_discussions/",
        "content": "Got a question you don't think needs a full thread? Just want to hang out?\n\n**Welcome to the lounge.**\n\nAll topics are permitted in this thread, have at it! 😇",
        "num_comments": 22,
        "comments": [
            "I'm looking to buy a new Macbook Air and find a balance between good specs that will last me several years and an affordable price - what do you think of this:\n\nMacBook Air 13.6\" M2 Chip 8-Core CPU 8/512GB $1549 (AUD)\n\nDo you think any other combo would be better or have a found a good balance?\n\nEdit: will be used for web browsing, music and video streaming, writing - no gaming.",
            "Hello everyone 👋, \n\n I purchased a MacBook Air M1 on 31st May. On the second day itself, when I was using Safari to listen to YouTube music, laptop speakers started to crackle ( distorted noise) when listening at full volume. \n\nKindly guide me on what to do.\n\nThanks",
            "Is YouTube extremely laggy for anyone watching in 4K? I thought it was my internet connection, but even through ethernet (>700mbps) it doesn't load at all. Using Firefox on an M2 MacBook Air. If I watch through the YouTube app on my iPhone or iPad, it loads normally. Any fixes to this? Don't know much about codecs, but does the AV1 decode engine address this issue?",
            "His bad are the Thermal issue with Mac books airs? I want to get one and had order a Maxed out one and then cancel when I saw a lot about the thermals",
            "Hey, do you guys know where to get clear matte skin? I don’t see this at dbrand..",
            "Is it dumb to buy this right now? - [https://www.amazon.com/Apple-2024-MacBook-13-inch-Laptop/dp/B0CX23V2ZK?ref=dlx\\_deals\\_dg\\_dcl\\_B0CX23V2ZK\\_dt\\_sl14\\_09](https://www.amazon.com/Apple-2024-MacBook-13-inch-Laptop/dp/B0CX23V2ZK?ref=dlx_deals_dg_dcl_B0CX23V2ZK_dt_sl14_09)\n\n  \nMy personal macbook is ancient and my work mac is well... a work mac!",
            "What is everyone's thoughts on the MacBook save-to-dock-as-an-app situation? I have saved many sites to my dock to use as apps and I'm starting to get a little overwhelmed by it. I'm just curious what everyone's preference is on this. Because I saved social sites like Facebook, Instagram, Threads, Reddit, etc. and other sites I shop at regularly like Barnes & Noble, Amazon, etc. I did this as a trial run to see if I preferred apps to sites myself and I'm starting to miss just going to the actual site through my browser. Because where does it end? Then why would I even need to use Safari after a certain point? I'm probably being dramatic and making this into a bigger deal than it is. But does anyone here find the save to dock apps useful? Or do you just use the websites? Or does it depend on the site? Would be interested to know everyone's experience with this so far.",
            "I thought I saw a crazy like $600 promo going on for a macbook air but I cant find it anyone know what im talking about?",
            "When you read online that battery life lasts 16-18 hours, how are they measuring that exactly? How long is a MacBook Air M3 battery meant to last if I use it to surf the web, stream content etc (not all the same time)? Because so far it seems like it lasts 4-5 hours like any other regular laptop, not the whopping 10+ hours?",
            "Starting to take classes again and as a working adult the only computer I “own” is my work laptop. I am majoring in business administration so my workload won’t be that heavy (no programming or art stuff— maybe generative AI but that’s it). The price differences between the M3 and M2’s don’t seem that bad. Anybody with experience with both what would you recommend."
        ]
    },
    "First ever Apple, M3 Air": {
        "title": "First ever Apple, M3 Air",
        "score": 33,
        "url": "https://i.redd.it/52fo4y1ehe9d1.jpeg",
        "content": "Hello Apple family! I just purchased my first ever apple computer and also the first computer ive had in over 10 years! After much research I went with the Air M3 16gb RAM 512SSD with a 13' display. I am beyond excited but also feel almost guilty? This is the most money l've ever spent on something in my life and it hurts in a way. I plan to keep this for as long as possible and use it to maybe go back to school and also learn programming and even photoshop or video editing. I dont know how I haven't had a half decent computer once in my whole life but this is the first time ever to own something premium. I hope this sparks my interest to learn many new things and hopefully help me get a career in working with computers like software/IT/Computer science?\nI still haven't made up my mind but now I have the tools to learn. Also If need be I may get a windows computer as well but I hope this suffice and I am excited to learn a whole new operating system! I went with the starlight color. Did I make a good choice? My mind is all over the place lol. I also own an Iphone",
        "num_comments": 9,
        "comments": [
            "Congrats!!! I actually got my first MacBook Air today as well, and what's funny is that I got the same exact model as you, down to the color and specs, let's enjoy our new Macs! I hope you love it.\n\nBtw, I think Starlight is the best looking color on a Mac.",
            "I would have chosen Starlight, no doubt!",
            "I just got mine today from Costco but I got the 15in one in midnight color",
            "How much did you get it for?",
            "Welcome to the family!",
            "Thats hilarious and awesome! We’re twins lol. I hope you love yours as well friend! Have you been using yours a lot already? Ive been busy and barely set mine up, i cant wait to really start using it. Love the starlight color as well",
            "Yes Starlight is beautiful, im happy I decided to go with it!",
            "Nice! I was thinking of checking Costco but went to Best Buy. What are the specs for yours? Almost went with Midnight as well! Hope you enjoy friend!",
            "I didn't open it until a few hours ago, but I was messing around with the settings and changing a few things to my liking, I'll finish setting it up tomorrow. Let me know how you're liking it tomorrow! 😄"
        ]
    },
    "is MacBook Pro too heavy to carry around in NYC? ": {
        "title": "is MacBook Pro too heavy to carry around in NYC? ",
        "score": 8,
        "url": "https://www.reddit.com/r/macbookair/comments/1dqz7hi/is_macbook_pro_too_heavy_to_carry_around_in_nyc/",
        "content": "I live in NYC. For all the New Yorkers or people who walk for daily commute, can you tell me if MacBook Pro 14 inch 2024 model is too heavy to carry around? I heard MacBook Air speaker isn't as good as the pro when I listen to music. I don't really care about other performance such as bright screen or speed of the performance. I'm also a female 5'4\".  I usually carry a notebook, pencil pouch, and 17 ounce water bottle in my Herschel backpack. I also have loose ankle where I'm prone to sprain when I walk down the street. I know the weight difference between air and pro is significant but I was told to not carry anything beyond 5 lbs. let me know what you think!",
        "num_comments": 18,
        "comments": [
            "headsup, even though mac air’s speaker is not as good as the pro, it’s still *very* good",
            "MacBook Air 13, 2.7 pounds.\n\nMacBook Pro 14, 3.4-6 pounds, depending on the model. \n\nHow much does your bag weigh without the laptop?\n\nReally, it's only something you can answer.",
            "I thought my 2014 15 inch MBP was light until I spent a summer carrying it from the student parking lot across campus to my classroom. The following summer I had  a inch MBA.",
            "How much is the difference in weight between a MacBook Air 13, a MacBook Air 15, and a MacBook Pro 14?",
            "What are you going to be using the device for?",
            "The speakers aren’t *that* much better. Just get an Air if you don’t need the extra horsepower.",
            "The 14 is perfect for that.",
            "It’s too expensive to carry around",
            "I don't live in New York, or USA for that matter, if that would make any difference. But I have a Macbook 14 M2, I guess last years model. It's certainly heavier than an Air, but I've never once noticed it being heavy to carry in my messenger bag. I usually bike and walk the 4 kilometers (I guess ~2.5 miles) to work. Although I don't have a loose ankle.",
            "Lighter is always better, no matter where you live I guess…"
        ]
    },
    "Gonna buy MacBook. Air or Pro? M2 or M3?": {
        "title": "Gonna buy MacBook. Air or Pro? M2 or M3?",
        "score": 0,
        "url": "https://www.reddit.com/r/macbookair/comments/1dr5adw/gonna_buy_macbook_air_or_pro_m2_or_m3/",
        "content": "But confused should I go for M3 air or M3 Pro. Or I should not waste money and pick M2 instead?\n\nWhat's the best decision in 2024?",
        "num_comments": 8,
        "comments": [
            "You didn't mention your work case , if you want light work go with air m2/m3",
            "Exactly my doubt.for what I have heard of reviews and thinking of going air but 16 gb of ram , but he does have some problems.\nIt also will be my first Mac so I want to get it right \n\nThe pro has a better screen those 120hz, bigger battery, and more ports. And also the price gap between the two is like 400 euros at those specs \n\nI wanted for work mainly writing emails, moving around office 365 with tons of tabs open, I also will use to do my masters degree. And the fact that the air can only support two displays with the lid closed, bothers me a lot. Because my desktop at home is slowly dying after almost  12 years ( with some upgrades, obviously) and the MacBook I will buy will overthrow that.\n\nSo yea, I have exactly the same doubt.",
            "I'm a marketer. Mostly web surfing and writing on docs. Using Canva. But i keep lots of tabs open while working.",
            "Then you can go with macbook air m3 with 16gb ram",
            "So again there's not much price difference if I go for pro m3",
            "If there is not much price difference go for pro m3 it's having active cooling better display more ports faster ssd and according to me  m3 pro will be better deal",
            "I just noticed that there two options in M3 pro 14inch\n\nOne is just M3 chip(16gp)\nAnd another is M3 pro chip(18gb)",
            "Yes there are two options available pick whichever is good for you"
        ]
    },
    "M1 air": {
        "title": "M1 air",
        "score": 0,
        "url": "https://www.reddit.com/r/macbookair/comments/1dr4z5t/m1_air/",
        "content": "If I buy an M1 MacBook air as a student in highschool, entering college in 2 years, 4 years of bachelors so thats 6 years of total usage. Will the M1 macbook air last me until 2031? What will this entail? thanks guys, edited for more direct question btw",
        "num_comments": 2,
        "comments": [
            "You’ll be fine, but get 16gb of RAM if you can afford it. I’m personally rocking a base M1 Air and it’s working perfectly.",
            "M1 MacBook should work for long time, but historically, Apple officially supported a Mac models for 7-8 years. Logical guess is that Apple may support M1 until 2028 ish."
        ]
    }
}