{
    "The MacBook Purchasing Megathread - June, 2024": {
        "title": "The MacBook Purchasing Megathread - June, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/macbook/comments/1d5kh5n/the_macbook_purchasing_megathread_june_2024/",
        "content": "Welcome to the monthly Macbook Purchasing Megathread\n\nHave a question?\n\nWondering what model you should go for? Ask here!\n\n&#x200B;\n\n* Do make your submission on point while adding as much detail as possible.\n* Mention your intended uses (i.e. video editing, graphic designing, photography, audio editing, gaming, casual browsing, etc).\n\nThat's pretty much it! :)",
        "num_comments": 75,
        "comments": [
            "This makes me sad when niche subs do this as it really stifles already limited conversation. This sub \"is what it is\" - a sub specifically about macbooks. Many niche subs do this and it baffles me. A mobile game I play just did this for questions on how to improve the characters. Before a mod manually deletes the \"illegal\" threads there's usually 5+ comments on how to actually improve, even if the thread is at an average of 0 votes. Once the person reposts in the mega thread they're basically living in a ghost town of such mega thread as only the most hardcore posters peep their heads in 'em.\n\nI took at look at the top posts from this week and they're all....broken screen related. If those were to get filtered as well then it gets to an OSX-related question that just happened ot happen on a macbook. \n\nWhat I'm typing is these \"what should I buy?\" threads are so minor...let them run free. Else, I already know what's going to happen; there will be less activity with further days between posts, and less personal conversation as again, *there's only so much you can chat about regarding a macbook*\n\n\"Oh yea look at my macbook that I'm still using from 2009.\"",
            "Hello, \n\nI'm a Computer Science student and I'm looking for a replacement for my old windows machine. I need something that portable (I need to bring it to classes) but also powerful enough for my workload. I don't need a big storage cause I keep my files on external storage either way. Recently, I'm interested in MacBook Air M2 8/256GB. I'm going to use the machine mostly for web development and maybe little bit of movies on my spare time.\n\nIf there's any web dev here, I would really appreciate any suggestions and recommendations. Thanks.",
            "I understand that the question is a buzzkill since it’s asked often…\n\nI’m a soon-to-be graduate MA student studying online in Education. I’m looking at a mixture of videoconferencing and asynchronous content, and the program is very writing heavy.\n\nShould I purchase a MBA specced with 16gb ram and standard storage, or is it overkill with greater memory in areas that aren’t CS, STEM, or arts?",
            "I bought the iPad Pro M4 with gift cards. I don’t know if I Should I sell it and get a MacBook Pro M3 or MacBook Air M3?\n\nI have the Apple Pencil Pro( still returnable to Apple) and I might get the Magic Keyboard for writing. Does it make sense to get a MacBook if the prices come out similar to a MacBook? Plus I want to get AppleCare\n\n\n\nI could sell it on eBay or Swappa\nWeb browsing \nListening to music\nXbox game pass\nPlayStation remote\nWriting",
            "I'm in desperate need of an upgrade to an Apple MacBook - it works within my ecosystem; I have an iPhone and iPad. I'm a graphic designer using Photoshop, illustrator, InDesign and I dabble in small projects on After Effects and basic blender; am looking for fast performance and ability to have multiple programmes at once.\n\nAfter a lot of research I am torn between M1 and M3. There doesn't seem to be massive difference but I wanted to ask this community with more insight then me. I'm leaning towards M1 but can't seem to find any in the UK that are not refurbished. I've never brought anything refurbished before so any advice on that would also be great!",
            "After using my old Macbook Pro for 4+ years, it’s time for me to upgrade.\n\nI currently have the 2018 Macbook Pro with i7 and 16GB of RAM. Overall it’s working decent, but recently I’ve noticed it’s having a bit more trouble to run smoothly with more demanding tasks, and the fan is making a lot of noise because of it.\n\nI use my laptop a lot (avg. around 9 hours a day) so I don’t want to make any concessions on performance. But I don’t want to unnecessarily overspend either.\n\nI use my laptop both for business and personal use.\n\n**Business:**\n\n* ‘Regular’ browsing. But I usually have 30-40 tabs open\n* Google Spreadsheets. Often bigger documents with 10,000-20,000+ rows, formulas, etc.\n* Facebook Ads Manager. This one seem to be quite demanding for my current laptop\n* HTML: I make landing pages in HTML editors. Never big documents though (mostly pretty basic landing pages)\n* Shopify\n* Image & video editing in Canva (browser version at the moment). If it’s video, it’s usually short videos, 1 minute or so\n* Email, calendar, Skype, Slack, WhatsApp, the usual stuff. I always have everything open\n\n**Personal use:**\n\n* I watch a lot of videos/series on my laptop\n* Regular browsing\n\nThe two options for me are the Macbook Air M3 15 inch (24GB, 512GB) or the Macbook Pro M3 16 inch (36GB, 512GB). Both have pros and cons for me.\n\n**Macbook Air:**  \n+ Lightweight/smaller, so easier to carry around/work from different places  \n+ Cheaper  \n- Smaller screen  \n- Less RAM, so maybe not as future proof?  \n- No active cooling (and thus less performance?)  \n  \n**Macbook Pro**  \n+ Bigger & better screen  \n+ Better performance  \n- Some people complain about eye strain with this particular screen?  \n- I’ve read some issues with the SSD getting 13V and basically killing the whole machine (although I guess this is rare?)  \n- Expensive\n\nI guess the first and most important question is: will the Macbook Air run all my tasks without any issues for at least the next 4 years? If that’s not the case, the Pro will probably be my best bet. If it will, I guess it comes down to weighing down the pros and cons for myself.",
            "Is it worth it to get a refurbished macbook before wwdc? I don't have a reason to get an M4 max or anything crazy - mainly asking for potential price drops on past models or trade in values. \n\nMy daily windows laptop is finally on the fritz and I'm hoping to get a macbook soon (been wanting to switch for years). Wondering if the timing's right.\n\nMostly debating between an M1, M2 or M3 right now",
            "Hey folks,\n\nNeed some quick advice. I am looking to get a Macbook 16 M3 Pro base model.\n\nCore intention being programming (Xcode, Flutter and maybe a little bit of Unity)\n\nIn my country (SG) Apple lists an M3 Pro 16” for S$3632. I have two options right now:\nM3 Pro 16 for $3327 silver or $3427 (black l)\nM2 Pro 16 for $2900.\n\nThe M2 pro is almost a 20% discount vs apple. Any thoughts or advice? From what I’m understanding, I’m missing out on 2GB ram and minor efficiency upgrades. But the savings are pretty steep.",
            "Hey everyone!\n\nSo I'm gonna come across a bit of spare money and i kind of need to change my macbook air early 2015. It's been used almost 24/7, played games, got knocked over everywhere in his 9 years. He also mined some cpu based crypto for fun running at 98°C for weeks 24/7.\n\nHe still runs fine but so hot playing even football manager or just watching netflix on chrome. Battery cycle count is at 3000+\n\nI mainly need a macbook for day to day use (some excel, word, reddit, movies) but I also want to be able to play games (LoL, FM, etc...). It's mainly multimedia, but I sometimes need to use software to manage music library (8k+ tracks, using MusicBrainz) that can be heavy when analyzing all that.\n\nI think tops I would spend would be between 1400/1700e.\n\nWhat would you recommend ? Thanks!\n\nEDIT: I'm also going to upgrade my iPhone 12 Pro as it got wrecked almost a year ago and could break at any point as the chips on the back for some are visible (if you know of any deals where I could upgrade macbook + iphone 15 pro)",
            "Hi all! I’m currently running my early 2015 MacBook Pro for all day telehealth video calls (google meet), multiple programs/windows, multiple tabs, etc etc. Because of my job the security updates ending is a problem, and the fan is working hard at times to keep things cool. We’ve had a good run, but it’s probably time to retire this laptop to occasional personal stuff. \n\nI currently have: MacBook Pro 13in early 2015 3.1 GHz dual core intel core i7 16GB 500GB flash storage. \n\nI was considering the M3 MacBook Pro or MacBook Air, both with \n\n8core CPU 10core GPU 16core neural engine 16GB 1TB \n\nA lot has changed since my current MacBook Pro. I feel like I might be in overkill territory with what I’m looking at. What do you think?"
        ]
    },
    "Three steals in one day ": {
        "title": "Three steals in one day ",
        "score": 70,
        "url": "https://i.redd.it/dr6ox7v3we9d1.jpeg",
        "content": "Follow up from earlier pawn shops finds, just landed a 32GB/512GB M1 Pro for $750. 88% battery remaining but has  AppleCare! This was an OfferUp find. So in total three Mac’s today for $2100. \n\nI resell these. Usually go for the Intel’s (higher supply + margin) but couldn’t pass on these. ",
        "num_comments": 47,
        "comments": [
            "I don’t understand why everyone is acting all righteous in this comment section. There is absolutely nothing wrong with what this person is doing. You’re telling me that if you were in need of a cash boost and saw some deals on macs that would make you money you wouldn’t resell for more? Y’all are acting like you don’t understand how businesses work. Do you refuse to buy from a supermarket because they pay £1.50 for an item and sell it for £3? No. You don’t. This is how every business model works, so I don’t understand why everyone is acting shocked. Do you think the pawnshop OP bought one of these from paid the previous owner $750 and then sold it to OP for $750? No.",
            "this is a steal. congrats!",
            "I have a m3 max $3999 one how much can I get resell. I never use it",
            "G G!",
            "So you manage to find those macbooks for a good price regularly? You have a constant source for that or you just look for them in different places?",
            "750 for a M1 Pro 32 512???????",
            "Damn homie, nice finds! Those are truly beautiful",
            "HIDE YOUR SERIAL NUMBER",
            "How did you steal all of those without getting caught?? Do you just run out of the café or you sleep with them and run out with their Macs? Just curious. Thanks in advance!",
            "I am calling police on you"
        ]
    },
    "Just purchased my first ever Macbook!": {
        "title": "Just purchased my first ever Macbook!",
        "score": 43,
        "url": "https://i.redd.it/uh600u99ee9d1.jpeg",
        "content": "Hello Apple family! I just purchased my first ever apple computer and also the first computer ive had in over 10 years! After much research I went with the Air M3 16gb RAM 512SSD with a 13’ display. I am beyond excited but also feel almost guilty? This is the most money I’ve ever spent on something in my life and it hurts in a way. I plan to keep this for as long as possible and use it to maybe go back to school and also learn programming and even photoshop or video editing. I dont know how I haven’t had a half decent computer once in my whole life but this is the first time ever to own something premium. I hope this sparks my interest to learn many new things and hopefully help me get a career in working with computers like software/IT/Computer science? I still haven’t made up my mind but now I have the tools to learn. Also If need be I may get a windows computer as well but I hope this will suffice and I am excited to learn a whole new operating system! I went with the starlight color. Did I make a good choice? My mind is all over the place lol!",
        "num_comments": 12,
        "comments": [
            "I spent 2k on my M3 Pro MacBook Pro, 18 ram/512 I love it!! Once you go Mac you don’t go back! Cheers and enjoy!",
            "It's an investment for a long time / life long friend, which will help you to make good amount of money!",
            "Great deal.",
            "\"My mind is all over the place\"\n\nUnderstatement of the year lol. That was an essay.",
            "Thats awesome! My good friend got the same Pro as you and loves his, he is part of the reason I got a Mac, seeing how much he loves his and his last Mac lasted him 10 years and still works well!",
            "16 or 14 inch you've got?",
            "Very true! That is exactly what I like to hear and plan to do with this beauty!",
            "Thank you! It seems I made the right decision.",
            "Lmfao sorry! That made me laugh.",
            "14”"
        ]
    },
    "Pawn shop pricing error": {
        "title": "Pawn shop pricing error",
        "score": 21,
        "url": "https://i.redd.it/asr2h7371d9d1.jpeg",
        "content": "Pawn shop had an M2 MBP 16GB / 512GB listed for $850. Jumped on it quick and added an M1 Air (base spec) for a total of $1350 (incl $100 tax) out the door. 100% battery life on the Pro, 99% on the Air and 23 cycles apiece. No MDM / Find My. Great condition with no scratches. Guy said the M2 should’ve been listed for $1200 but honored the price. ",
        "num_comments": 7,
        "comments": [
            "Dang that's a steal!",
            "Meanwhile the only Macs in my local pawn shop are old sticker-encrusted 2014 MacBook Airs with 4GB of RAM, a dog-chewed charger, and a $300 price tag.  \n  \nBleh.",
            "Super jealous! It’ll be years before I find that spec for that low a price lol",
            "i dont believe you.gif",
            "Yeah also saved these from the screen protectors and hard shell covers they were in lol",
            "I’d imagine that’s how the shop looks 99% of the time. I usually catch their pricing errors on good inventory and move quick. It happens every so often. It’s how I got my first more expensive Mac a few years back. And a few others along the way",
            "Yeah I have no clue how they let this one slip. He almost let me negotiate lower until he realized they’d messed up lol"
        ]
    },
    "2019 Macbook Pro with i9 and 32GB RAM worth it in 2024?": {
        "title": "2019 Macbook Pro with i9 and 32GB RAM worth it in 2024?",
        "score": 18,
        "url": "https://www.reddit.com/r/macbook/comments/1dqqod2/2019_macbook_pro_with_i9_and_32gb_ram_worth_it_in/",
        "content": "I can get one for $400. Do you think it's worth getting in 2024? How much longer will it get support from Apple?",
        "num_comments": 42,
        "comments": [
            "For $400, that’s a very good deal.  It’ll be supported for at least another year or so, maybe longer, and you’ll be hard-pressed to find any alternative with 32GB at that price.",
            "Not a horrible price. If you actually need that much ram, then sure. If you don't, then consider m1 air instead.",
            "That is a great laptop, price is good as well. If you need to sell it in a few years the most you would lose is $100-$150",
            "For the price yes, you’ll hear the usual “save for M1” if you want to spend 🧀, if you’re looking for support definetly go for the latest Mac bro but it also depends on your financials, if I found that exact machine you’re talking about for that price I would’ve bought it right away lol",
            "While everyone here is prancing about the efficiency of M1 (which yes, its efficient) if you don’t mind getting around 2 more years of support and want bootcamp and a big screen, hell yeah its an amazing deal. People here are ignoring that the MacBook Air M1 comes with 8GB of RAM, a 13 inch screen and only 2 thunderbolt ports. Plus you get 2 fans on the i9. Also you’ll get bootcamp and more display connectivity",
            "Good price",
            "so long as its the 16\" then its alright, dont go for the 15\" with the butterfly keyboard one, its much worse",
            "Realistically there is a good chance Sequoia (coming out this fall) is going to be the last version of macOS to support it, so that means 3 more years of support (1 year of Sequoia + 2 years of security updates). Based on their previous transitions and how they were dropping support for Intel devices with Monterey, Ventura, and Sonoma, there is a good chance that Apple will drop all Intel support with the version of macOS after Sequoia.\n\nThat being said, I'd buy that for $400, although the M1 Air that can likely be had for $100-200 more will perform similarly while having better battery life, running quieter, and running cooler.",
            "I would save for at least an M1 Air.",
            "I still use a 2012 Mac mini, I think 4 gigs of ram? Idk. It does what I need it to do."
        ]
    }
}