{
    "Chapter 67: Whereabouts of the Soul": {
        "title": "Chapter 67: Whereabouts of the Soul",
        "score": 451,
        "url": "https://mangadex.org/chapter/380114b7-1506-471a-8fbe-c17870429933",
        "content": "",
        "num_comments": 313,
        "comments": [
            "So with what we just learned about souls does this imply that Riko might not be the “real” Riko but rather a different soul that filled Riko’s corpse back when she died as an infant? Im not entirely sure what the implications of that would be. Is it someone else’s soul that was basically reincarnated, or is it a soul literally created by the abyss?",
            "Faputa is slowly turning into a furret",
            "I have no shame in admitting that I didn't understand anything but I still loved it",
            "I really do love that even this white whistle doesn’t really know what’s going on down here. Even for all she’s see. And explored, the abyss is still a mystery to her and even the few things she thought she had confirmed, might actually be completely wrong. \n\nI’m not even sure if we as the readers will ever get a real answer",
            "They mention that when something dies and is revived the original host of the body is gone and the new occupant is a totally different soul…\n\nThat means that Riko’s original soul went to wander the abyss and the Riko we know and love is artificial, right? Wonder if we’re going to see a return of her OG soul in the way of it being a time loop Liza or maybe it got turned into Reg?",
            "Faputa was drawn criminally cutely this chapter",
            "All imma say about this arc so far is, get ready for the bangers Kevin Penkin is gonna put out if he works on the soundtrack for season 3\n\nI have no doubt theyre gonna hit hard and im almost as excited for the music as i am for the season",
            "Damn, almost 6 months of waiting and the chapter was gone in a few minutes, this is truly one of the hardest mangas to being a fan of.\n\nCant wait for the next chapter.",
            "Good to have a nice sciencey explanation for how Kiyui survived the Birthday Disease.  Getting taken offshore separated him from the soul, freeing him from the effects of the rumor's power that's projected through it.\n\nAnd now we are compelled by new questions regarding the exceptions through their acknowledgement.  Great writing!",
            "So who's on the \"abyss is a living thing\" train?"
        ]
    },
    "MiA Re-Watch/Read: Season 2 Episode 2": {
        "title": "MiA Re-Watch/Read: Season 2 Episode 2",
        "score": 10,
        "url": "https://www.reddit.com/r/MadeInAbyss/comments/1dp9ikf/mia_rewatchread_season_2_episode_2/",
        "content": "&#x200B;\n\nhttps://preview.redd.it/op428ta47t8d1.png?width=1894&format=png&auto=webp&s=1187ba75de4973502993ff39b40a21c69927964c\n\n# \n\n|[←Previous Episode](https://www.reddit.com/r/MadeInAbyss/comments/1dm1e74/mia_rewatchread_season_2_episode_1_prushka_ova/)|[Index](https://www.reddit.com/r/MadeInAbyss/s/L6soKOKUom)|\n|:-|:-|\n\n\n# Hello Delvers\n\nI'll be in charge of posting these threads every once in a while for the second season, so, let's get into it! In this episode we finally arrive at the 6th layer with our main group, kickstarting their new adventure. This episode covers the remaining parts of chapter 39 and chapter 40. \n\nWhere to watch:\n\n* [Netflix](https://www.netflix.com/title/80193163)\\*\n\n\\*May not be available in your region.\n\nWhere to read:\n\n* [Mangadex](https://mangadex.org/title/80422e14-b9ad-4fda-970f-de370d5fa4e5/made-in-abyss)",
        "num_comments": 3,
        "comments": [
            "Alright, Ya boy is temporarily back to give some more detailed page info, \n\nThis episode covers Chapters:\n\n39- page 17-44(45 and 46 were never adapted)\n40- page 1-12",
            "Remember to be respectful to others and to act in good faith. Disagreements are ok but that's not an excuse to stop being civil. Insults, personal attacks, hate speech, and bigotry will get you banned from the subreddit. Someone else breaking this rule is also not an excuse for you to break it as well. \n\nThe correct use of spoiler tags looks like this: `>!Your spoiler goes here.!<` Adding a space at the beginning or at the end will break it, like this: `>! This spoiler doesn't work. !<`\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MadeInAbyss) if you have any questions or concerns.*",
            "`Volume 6:` [https://paste.fo/raw/6b26849b1be0](https://paste.fo/raw/6b26849b1be0)\n\n# Chapter 39 [17-44]\n\n    Riko: It's made of some kind of crystal.\n\nLooks oddly layered too, like>!a certain water-containing cave.!<\n\nInterestingly, when they re-encounter the Splitjaw on layer 3, the damaged part of its face is covered in some crystal-like structure that looks an awful lot like this stuff. Coincidence, or could i-\n\n    Riko: [Is it here because the ground it was on got swallowed up a long time ago...? Did the whole city get turned into a fossil? Or is it a mirage created by the crystals?]\n\nHey, heyyy! Stop speculating! That's my job! :(\n\n    Riko: Come to think of it, we three plus one made it down here just fine, didn't we?\n\nI mean, aside from Reg's arm and belly-button, sure!\n\n    Riko: \"Turbinid-dragon.\"\n\nI just realized its tail is curled in the way people's hair curls under the repeated effects of the curse. Or how mizoujack eggs look. Or how>!everything on the 7th layer seems spiraley, like the Eye and most of the scenary.!< So... Uzumaki was a prequel to Made in Abyss all along, huh...?\n\n    Reg: If you do a good job then... we might get to see it again.\n\nAnd in just a few panels we learn they were trying to induce a foodgasm out of Nanachi yet again. It pays off - that tailwag is adorable.\n\n    Riko: At any rate... I feel I've eaten this before somewhere. [...] I remember now! At the orphanage... On cave raiding memorial day, a foreign... what was it again? I forget, but this tastes like that bottled thing we cooked up!\n\nI'm assuming she just means the tastes were similar. It doesn't seem very likely someone would have brought back one of these fellows from the 6th layer. Or do foreign delvers know something we don't...?\n\n    Riko: He's a pervert who used to peep at me when I got strung up naked.\n\n... ... ...Naw. This is too mild to ring the tsukushi-moment bell. Or am I just getting desensitized? >\\_>\n\n    Nanachi: Sure, but... can't we do something about the name \"Team Riko\"? Isn't it too plain?\n\n\"Team Large Forehead and Glasses\"?\n\n    Nanachi: Let's just believe... that it'll definitely reach them.\n\nThis would be funny if it weren't so disappointing for the group.\n\nBut it begs the question. If communicators exist in this world, why not just setup and maintain some kind of communicator relay station across the first 5 layers (and beyond, if someone happened to carry the equipment with them on their last dive...)? Delvers could easily send and receive messages from the surface and ditch this super-unreliable mail balloon nonsense. We've seen instances of communication occurring across layers (albeit poorly; think Reg and Nanachi during Ido Front) so this should work, and the benefits would easily outweigh the effort of maintaining and repairing these relays.\n\n    Riko: Prushka's gone...! Even though I was wearing her... Where...?\n\nIt's fine. Knowing Tsukushi, she's probably just gone outside to exercise some waste-voiding bodily function; we'll be given the details shortly.\n\n    Nanachi: ...and got through Reg's arm trap with ease.\n\nTo be fair, it's not a very good trap. Anything person-sized or smaller exercising the least bit of caution could make it through.\n\n    Riko: ... ...Uh, does that thing... have its butt sewn shut...?\n    Reg: What are these...? There's hair stuffed into them...\n\nSigh, screw it. The series has had way more objectionable stuff but my hand's been hovering over the bell ever since Riko reminded me of kids being strung up naked as punishment.\n\n\\*DING!\\* **TSUKUSHI MOMENTS**: 32\n\nI stumbled on an interesting explanation of what the deal with this is, for what it's worth...\n\n>!Simply put, these creatures' bodily fluids mess with the force field. They hunt by \"masking\" their prey so predators won't read the force field and steal them away. Because it affects the prey's \"signal\" through the force field and not the prey itself, just some hairs and such is good enough for the effect to take. Faputa is using this property of Dread-Owles to mask the party from predators and keep them safe.!<\n\n\n\n# Chapter 40 [1-12]\n\n    Reg: ...It looks like the carcass of some creature.\n\n>!How very astute of you, Reg. >\\_>; Knowing what Iruburu is, I'm curious who built that bridge. The entrance was ground-level and the villagers can't leave. I'd have assumed Faputa, but it was there when she was born. Which pretty much just leaves the Interference Units. I'm guessing they built the \"bridge\" to be able to come and go from the village once it grew too tall to enter from the ground.!<\n\n    Reg: Nngh! Well...? Am I inside yet?\n\nOkay. Immediately after this, the entrance looks like some lady-parts. I mean look at [this](https://i.imgur.com/q3w9LBQ.png)! The highlights are **not** my own.>!Knowing this is Irumyuui's baby-hole only makes this worse.!<There's absolutely no way I can just let this one slip by un-dinged.\n\n\\*DING!\\* **TSUKUSHI MOMENTS**: 33\n\n    The Depths' Sixth Layer - Village of the Hollows\n\nAnd another awesome full-age establishing shot. :D\n\n    Reg: Who're... these guys...?!\n\nSigh. Of course, the middle one>!(Juroimoh)!<has a chest-pussy with arrows pointing to it.>!And he can pull out a long, slimy phallic object from it.!<\n\n\\*DING!\\* **TSUKUSHI MOMENTS**: 34\n\n    ???: ENnu sosu. -krii... krriii...- ENnu HONdINDEbuu sosu...\n\n\\[Kaja has entered the chatroom.\\]\n\n    Majikaja: One who is good at it is doing the stone.\n\n...I'll hold off on the bell but I have to point out that this is a very poor choice of words given>!Poriyon's... uh... experience with it.!<"
        ]
    },
    "Daily faputa post #360": {
        "title": "Daily faputa post #360",
        "score": 163,
        "url": "https://i.redd.it/4k1ti0cdlf9d1.jpeg",
        "content": "Come join us in r/ChurchOfFaputa Discord server: https://discord.com/invite/mYyzGvD2SX Source: https://x.com/26jUdB9mkdy9HTy/status/1806615387829662171?t=I4wSTVX2gefD1SkaidO5zg&s=19",
        "num_comments": 7,
        "comments": [
            "she's just so darn cute",
            "Do you want some headpat ?",
            "So close to one year sosu",
            "Who made her sad? I’ll kill ‘em",
            "when moth dont find the light (reg)",
            "Awwwwwww❤️❤️❤️❤️🥺🥺🥺",
            "So close to 365!!"
        ]
    },
    "Pyronachi": {
        "title": "Pyronachi",
        "score": 45,
        "url": "https://i.redd.it/0r4cyo8eog9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "“Mmmmph mrph mmmmph.” -pyro tf2",
            "Yes",
            "Remember that all fanart submissions must include a source. If your post is removed, adding a comment with the source will restore it shortly. You can reverse image search using [SauceNAO](https://saucenao.com/), [iqdb](http://www.iqdb.org/), etc.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MadeInAbyss) if you have any questions or concerns.*"
        ]
    },
    "Princess Faputa Arrives!": {
        "title": "Princess Faputa Arrives!",
        "score": 113,
        "url": "https://www.reddit.com/gallery/1dqyxx4",
        "content": "look who i added to my slowly-growing collection!! she came in today, and i love her more than anything ❤️",
        "num_comments": 7,
        "comments": [
            "I’m so jealous omg. She’s gorgeous!",
            "isn't she, though?? i'm so glad i was able to get her ❤️",
            "W you",
            "Congrats",
            "thank you!!",
            "thank you!",
            "So,\n\nMany,\n\nTeam Tiares.\n\nhttps://preview.redd.it/f3heho0aoi9d1.jpeg?width=346&format=pjpg&auto=webp&s=be12227e89efceda63773737c0e402c25122c681"
        ]
    }
}