{
    "Cheese grater": {
        "title": "Cheese grater",
        "score": 19891,
        "url": "https://i.redd.it/b4zxotx8db9d1.png",
        "content": "",
        "num_comments": 123,
        "comments": [
            "looks like a 2001 music video",
            "‘Grate time’😂",
            "I swear I saw this from a MTV music video before",
            "Damn. The inside of a cheese grater is better than most LED-lit, dingy nightclubs in my area. \n\nI'd freak out too, to be honest. Lol.",
            "DMT will make you freak out anywhere",
            "I'm hearing ByeByeBye playing in my mind now, thanks. That'll be stuck there the rest of the day",
            "Grate time, guy is a master",
            "beyonce could have used that as a stage for the renaissance tour.",
            "\"Imagine being on DMT in that gaff\".\n\nNo. I don't want to. That sounds terrifying.",
            "1997 Puff Daddy video"
        ]
    },
    "Retired madlad": {
        "title": "Retired madlad",
        "score": 1414,
        "url": "https://i.redd.it/xn0v0d18ae9d1.jpeg",
        "content": "",
        "num_comments": 23,
        "comments": [
            "madlass, you could say",
            "You get to retire??",
            "Know the system, abuse the system.",
            "Why the different retirement times tho? Don't women actually live longer or is there some important underlying reason?",
            "He did it boiys. He is the messia",
            "Not a lad.",
            "The DailyMail is hot garbage.",
            "Never taught about taught that before?¿? Good idea 😂",
            "Lmao, what a genius",
            "Madlady\n\n*tips fedora*"
        ]
    },
    "Smart lad": {
        "title": "Smart lad",
        "score": 15511,
        "url": "https://i.redd.it/oc97t6y3s39d1.png",
        "content": "",
        "num_comments": 57,
        "comments": [
            "Lol. This is nothing compared to being dared to go home.",
            "I had to run around the house naked.. In the snow.  It sucked",
            "Once I dared someone to suck my dick and it worked",
            "It's not t or d but we made this drinking boardgame that had already drawn things to do on the spaces you landed on. You basically just grabbed a dice and a random object you wanted for your piece. But some of the spaces sucked, like swap clothes with the person next to you, take 4 shots without a chaser, 6 shots, 2 etc. Shotgun a beer, 2 shots and roll again type shit. I don't think we ever finished a round of the game and we'd usually play with at least 3 people",
            "We tried playing with the fools, but no one had the courage and everyone got bored.",
            "Truth or Dare is honestly the worst game ever. I was playing with my friends, and no one was picking dare—it was becoming so dull. To liven things up, I decided to go with dare.",
            "Worse dare would have been to walk there in their socks.",
            "Indeed very smart.",
            "smart indeed",
            "Cover up the username and the sub from a recent Reddit post and repost it."
        ]
    },
    "Proud madlads in Seattle": {
        "title": "Proud madlads in Seattle",
        "score": 1250,
        "url": "https://i.redd.it/i6duqg5jc69d1.jpeg",
        "content": "",
        "num_comments": 31,
        "comments": [
            "A former coworker of mine did this years ago. There was a bunch of Confederate pride idiots marching in the city and he followed them with a sousaphone playing the fat walk theme and occasionally throwing in \"Ride of the Valkyries\" \n\n[Video](https://m.youtube.com/watch?v=Rs4P1kKK-5k)",
            "\"Homosexuality is a-\" *foghorn*",
            "I would do it for free. \n\nI mean; I don’t play those instruments, and I live in the opposite side of the country- if I had the $, I’d fly there and do it for free",
            "It would be hilarious if they got a whole band to do it. A drummer playing the bah dum tss sound everytime they get dunked on or made fun of. Farting and womp womp womp sounds from the tuba. Then they start playing some gay anthems as they follow the protestors around.",
            "If the protestors are recording for content, blast Taylor swift or Disney music nearby so the content is unusable.",
            "I’ll bring my vuvuzela!",
            "Nothing says \"pride\" like drowning out hate with a loud, obnoxious tuba solo!",
            "FUCK IT IM DOWN",
            "lol I wish I could donate to this",
            "I can’t play these instruments but honestly I’m pretty sure that’s a benefit. I do however know some very obnoxious songs on the piano and I have a piano on wheels. I also have a microphone and a very loud speaker… fellas let’s do this Giorgio’s theme at 90db"
        ]
    },
    "Smoking tear gas like a madlad": {
        "title": "Smoking tear gas like a madlad",
        "score": 14520,
        "url": "https://i.redd.it/upp4dno9k19d1.jpeg",
        "content": "",
        "num_comments": 197,
        "comments": [
            "Soldier boy irl",
            "I can’t imagine what tolerance to respiratory irritants that must require, let alone how he obtained it.",
            "bro smoked it like its some of the good stuff 💀",
            "Is he still alive?",
            "Guys if you watch the actual video it’s clearly a tear gas canister converted to a pipe. Still a mad lad though",
            "that's like getting a brick thrown at you, it missing and then bashing your head with it.\n\nthat's like a gunshot missing, stealing the gun and then shooting yourself in the leg.\n\nthats like being hit by a baton and then hitting yourself in the face.\n\nthat's like just being a complete madlad.",
            "We've got Soldier boy over here.",
            "Holy shit, it's that guy from Karl Hevacheck's wedding",
            "Some people are just immune to it.  Had a couple guys in the gas chamber in basic training just chilling totally unaffected while everyone else was choking ",
            "Next up: drinking a molotov-cocktail"
        ]
    }
}