{
    "Daily Questions Thread - Ask All Your Magic Related Questions Here!": {
        "title": "Daily Questions Thread - Ask All Your Magic Related Questions Here!",
        "score": 2,
        "url": "https://www.reddit.com/r/magicTCG/comments/1dls9s1/daily_questions_thread_ask_all_your_magic_related/",
        "content": "This is a place for asking simple questions that might not deserve their own thread. For example, if you have a question about a rules interaction, want sleeve and accessory recommendations, or suggestions for your new deck, then this is the place for you.\n\nWe encourage that you post any questions that you may have concerning Magic the Gathering here rather than make a separate thread for each question, though for now we won't require that you do so.\n\n**Rules Questions**\n\nRules questions and interactions are allowed to be posted here, but if you need an answer quickly it may be best to use a dedicated resource like the [24/7 Magic the Gathering Rules Chat](https://chat.magicjudges.org/mtgrules/).\n\n**Deckbuilding Questions**\n\nIf you're trying to get help with a deck, it is recommended that you post your decklist to a deckbuilding website so that it is easier to view. Some popular sites are Aetherhub, Archidekt, Deckbox, Deckstats, Moxfield, MtgGoldfish, and TappedOut.\n\nAdditionally, please include some description of what you are trying to accomplish. Don't just give us a decklist with no explanation, and don't ask extremely vague questions such as \"what cards should I add to my deck to make it better?\", because it's hard to give good advice in those cases. Let us know details, the more the better. Are you building with a particular strategy or theme in mind? Are there any non-obvious combo lines or synergies that people should be aware of? Are you struggling with a particular matchup, or are you finding yourself missing consistency in an important area, and need some help specifically for it? Let us know.\n\n**Commonly Asked Questions**\n\n> _I opened a card from a different set in my booster pack, is this unusual?_\n\nDon't worry, this is completely normal. If you opened a set booster, you have a small chance of obtaining a bonus card from a previous set. This is an extra card that does not replace any of the other cards in your pack, and is from a curated set of past hits that Wizards of the Coast has selected, which they call \"The List\".\n\nYou can view the contents of The List on Wizards of the Coast's official website. For example, the contents of The List for Streets of New Capenna boosters can be found [here](https://magic.wizards.com/en/articles/archive/feature/whats-new-list-streets-new-capenna-2022-04-14).\n\n> _My foil card has a shooting start symbol over the bottom left. I can't find anything about it online._\n\nAll old-bordered foils have the shooting star symbol. Most sites that display card images just overlay a generic foil graphic over all foil cards, which doesn't include the shooting star. Your card is normal.",
        "num_comments": 6,
        "comments": [
            "If you flicker a Saga when the last lore counter is put on it, can you resolve the final chapter's triggered ability without sacrificing the Saga?",
            "What type of slivers should I use? I've sent the giant list of lost popular ones on edhrec, but I'm not sure which effects are best. I'm running a [[sliver legion]] deck but only want 20-30 slivers in there. It's a multi tribal deck with a main silver theme. So which static abilities from my slivers should I be focusing on most? What's the balance of evasion and anthems and other stuff? I hope they makes sense",
            "Yes, assuming you flicker the saga while the final chapter ability is still on the stack. Once the final chapter ability triggers, it will resolve even if the Saga leaves the battlefield. And when the Saga re-enters the battlefield, it's treated as a new object with no relation to the one you flickered.\n\nWhat you **can't** do is wait for the final chapter ability to resolve, then flicker it. The Saga will be sacrificed before you even get priority to cast your flicker spell.",
            "[sliver legion](https://cards.scryfall.io/normal/front/8/7/87545415-2e27-4841-a3af-7653af2ba6d3.jpg?1619404140) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=sliver%20legion) [(SF)](https://scryfall.com/card/tsr/261/sliver-legion?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/87545415-2e27-4841-a3af-7653af2ba6d3?utm_source=mtgcardfetcher&format=text)\n\n^^^[[cardname]] ^^^or ^^^[[cardname|SET]] ^^^to ^^^call",
            "Okay, thanks for the answer!",
            "Guess I should add that Legion is my only expensive sliver and I probably won't be buying any others. Looking for ratios not cards if that helps"
        ]
    },
    "Weekend Free Discussion Thread": {
        "title": "Weekend Free Discussion Thread",
        "score": 1,
        "url": "https://www.reddit.com/r/magicTCG/comments/1dl0k0a/weekend_free_discussion_thread/",
        "content": "Normally, all posts in this subreddit need to be both Magic-related and at least somewhat \"high effort\". This weekly thread gives you the chance to relax and talk with your fellow Magic redditors about things that would normally go against those rules.\n\nWant to share a funny story about a recent game of Magic you had, or post a picture of the cool cards you opened in your latest booster? Want to talk about your favorite movie or tv show, or share a personal accomplishment? This is the place to do so.\n\nKeep in mind that the \\*only\\* subreddit rules that you can ignore in this thread are rule 2 (all posts must be Magic-related) and rule 7 (no low effort posts that are just pictures of cards). Just because this thread is meant for open discussion does not mean you are allowed to insult people or post explicit content, for example.",
        "num_comments": 7,
        "comments": [
            "Staying mad about the reserved list and offering anybody that supports it to eat a brick.",
            "How come Ive seen a lot of Standard Red aggro decks on deck lists not running slickshot showoff? It seems like one of the best cards in the deck to me.\n\nIt does get removed a lot but that opens up space for ur other creatures. It just seems all around really good, both in a specific way as a threat that can one shot a lot of damage,  has haste and versatility in plot and flying both to dodge attacks and block flying for a kill with an instant.",
            "Wizards should print [Gem Bazaar](https://scryfall.com/card/past/12/gem-bazaar) in paper. It's a cool card. The art is good. And the effect is easy to achieve with a D6.",
            "Since polls can't be made, is it safe to say that around 80% of people store their magic cards in a BCW cardboard box yes? If that's most peoples main method of storage, I don't see how talk about the storage containers themselves isn't relevant to the cards people are putting in them? Are people using magnetic fields to store their cards and I missed that memo or a hole in the ground an I also missed that memo? Would it not be cool to have a vector template for the most commonly used storage container for their MTG cards so people could get custom art printed on their MTG storage container?",
            "Make that two bricks. One from me also",
            "I'm assuming you're talking about on Arena?\n\nWithout Slickshot Showoff, the deck is still positive winrate in BO1. Granted, it's probably like (I don't know the actual figures, sue me) 55% as opposed to 60%, but it still works. Don't get me wrong;, you're right. Slickshot is the best creature in the deck by a significant margin. It's just worth noting that Electrostatic Infantry and Khenra Spellspear aren't *bad* cards. They're just bad in *comparison* to Slickshot.\n\nHell, people are hitting mythic with lists that include even the bad red-aggro cards like Phoenix Chick and Shock.\n\nBudget go brrr.",
            "I'd love to see it included in the next WUBRG commander precon."
        ]
    },
    "Our wedding invitations were Magic: the Gathering inspired booster packs!": {
        "title": "Our wedding invitations were Magic: the Gathering inspired booster packs!",
        "score": 823,
        "url": "https://www.reddit.com/gallery/1dlkzcc",
        "content": "",
        "num_comments": 40,
        "comments": [
            "That is legit so cool. Wow.",
            "This kicks so much ass dude",
            "Now that the big day has come and gone, we can finally share our wedding invitations with this sub! My husband and I are tremendous MtG fans (and in fact spent a great deal of our wedding weekend slinging spells with our wedding party, who are also our playgroup), so we thought it most fitting to celebrate our favorite game with our favorite people.\n\nI designed the booster packaging, card fronts, and backs (which are a nod to the anime movie Your Name - we walked down the aisle to Katawaredoki by RADWIMPS), and we worked with the folks at [Board Games Maker](https://www.boardgamesmaker.com/) to format it correctly. We made sure to include a custom Treasure token for our Magic-playing friends, though we knew a bunch of our family members might be left scratching their heads haha. We received a bunch of texts from friends saying they've sleeved the Treasure tokens and are using them in play, which is just the highest compliment we could be paid. We were both incredibly pleased by how it all turned out - the cards even smelled like a freshly cracked pack!\n\nWe sent these to our invitees in a green bubble mailer with cardboard backings so they wouldn't bend in transit, along with a customized note for each couple/friend/family unit. We were JUST on the cusp of the envelope counting as a letter, so we thankfully only had to pay extra for non-machinable mail!\n\nAll together, the packs cost just shy of $5 a unit to print (we made 65 of them), and about $2 to send. It was a bit on the spendy side for invites, but we were really happy that these set the tone for a relaxed, playful, fun wedding celebration.\n\nHappy to share any insights from this process for anyone who is interested in doing something similar! I had a ton of fun putting these together - I'd say designing these, cracking open the first pack, sending these to our friends and hearing all their elated and excited feedback was one of the best parts of our planning process. :)",
            "Haha I'm doing custom mtg cards for my grooms boxes. I gonna make a little custom pack too for them to open as well. You guys did well with your invitations!",
            "Hey if you’re trying to blur out personal info (which I would heartily suggest) I would white out the event date/location and the names of the couple as they’re still visible on the handwritten note.",
            "This is rad. [[Best Wishes]]",
            "YOU CRUSHED THIS!!!!",
            "Oh my god I love this so much!",
            "Very cute! Although I like that they aren't too specific, they're not covered in Magic logos or characters, and the overall design has the common tcg style of an art box and a text box, but otherwise the design is very unique - clearly inspired by Magic but not being overtly themed that way, very classy.",
            "Really excellent. Great concept, fabulous execution.\n\nI wish you both health, happiness, and drawing your outs."
        ]
    },
    "NO OKO WATCH OUT KELLANS GOING FOR THE PILE DRIVER": {
        "title": "NO OKO WATCH OUT KELLANS GOING FOR THE PILE DRIVER",
        "score": 615,
        "url": "https://www.reddit.com/gallery/1dlj4yb",
        "content": "",
        "num_comments": 37,
        "comments": [
            "Not to be pedantic, but that's an elbow drop. A piledriver is when you lift your opponent up so they fall head-first into the ground [Like this.](https://i.pinimg.com/originals/0b/66/14/0b661463cc21216e5098526f3be566ac.jpg)\n\nI do like the art, though. Kinda what Oko deserves.",
            "Mmm, how can I get in on one of Kellan's \"signature\" slams?",
            "There's a Rey Mysterio and Oko being deadbeat dads to Dominic and Kellan being criminals joke in here somewhere",
            "By god is that Nadu's music?",
            "Love this",
            "Not a pile driver",
            "Oko's Signature Slam is a lot different.  Just ask Kellan's mom",
            "RKOKO [Outta Nowhere!](https://www.youtube.com/watch?v=t1XzYMQkXDU)",
            "As gawd as my witness he is broken in half!",
            "That's what not paying child support will do to you"
        ]
    },
    "LGS please make sure your websites are right!": {
        "title": "LGS please make sure your websites are right!",
        "score": 286,
        "url": "https://www.reddit.com/r/magicTCG/comments/1dljc5a/lgs_please_make_sure_your_websites_are_right/",
        "content": "I am so exaughsted of trying to play magic, and I get to the store, and they tell me their website is wrong. Today I went to draft Outlaws for 25$  (first place is 50$ store credit so there is prizes hence the price) but I arrive and it's MH3 for 50$ I asked about and they said \"Yeah we changed it\"  really  unlucky part is thar there were other stores with outlaws drafts... but they were at the same time and 10 miles away, so I missed it. I don't get many chances to play magic. This isn't the first time this has happened it's just frustrating. The worst part is I wasn't even alone, so It disappointed multiple people, and I had to apploligize. I showed them the website. We went to play pinball instead it's just ugh, man. ",
        "num_comments": 64,
        "comments": [
            "The lucky part is, next time you get a chance, it sounds like there are a number of other stores for you to choose from.",
            "Many moons ago when I was in the height of trying to grind my way into some semblance of standing a chance winning a PTQ I learned to call ahead to each store I was going to play at. Sometimes I would have someone say “It’s all up on our website. You can read about it there.” But I already had. So I tell them what I read. And once in a blue moon someone would be like oh yeah that’s incorrect. So then I’d ask for the proper info. It didn’t happen often. But I wasn’t going to risk driving X hours only to find out in person their website was wrong.",
            "At least that place has a website. I’m tired of stores who only put their event schedule in a Discord or Facebook that someone forgets to update half the time.",
            "Sometimes it's not the store's fault. I'd often schedule drafts for the current format, only to have too many people say they aren't interested but would love to draft a different set. The other people who don't care are fine switching because they just want to play magic.\n\nObviously, this is less of an issue if you get 60 people, but if your group is closer to 16 sometimes you just need to adapt, or nobody gets to do anything.",
            "That store would lose my business since there’s other stores around.",
            "must be wild to be an american/european... here in Brasil, there's a law which says if a website shows you a price the business has to offer you that product/service for the shown price... and everyone pretty much knows about this, so much so that it's usually enough for you to say \"ik that's my right\" and stores will oblige... worst case scenario, you ask if they wanna get the authorities involved (they never do, because there's a fine for this type of behavior)",
            "Is there 1 LGS website in the world that isn't dog shit and devoid of information?  I live in the Chicago area and have to go to independent Facebook groups to find event calendars for the area.\n\nIf attendance is down and shit doesn't fire, consider having a website that says when events are.  You don't need any fancy calendar or anything. Could be a white background with only black text and it will be better than anything I've seen.",
            "My LGS still says I can preorder Murders at Karlov Manor.",
            "Always call ahead when going somewhere unfamiliar to check",
            "If I don't know the store or I haven't been a while I always call or send en email. Really saves the hassle of being there for something not to happen."
        ]
    }
}