{
    "Tibalt's Friday Tirades": {
        "title": "Tibalt's Friday Tirades",
        "score": 11,
        "url": "https://www.reddit.com/r/MagicArena/comments/1dkuxha/tibalts_friday_tirades/",
        "content": "*TIBALT LOVES TO HAVE FUN IN HIS OWN WAY, WHICH IS CAUSING PAIN AND MISFORTUNE TO THOSE AROUND HIM. HE CAN FEEL THIS PAIN AND EVEN SEEKS IT OUT, TO HEIGHTEN IT AND REVEL WITHIN IT. HE CARES NOT FOR OTHERS, BEING SELFISH AND SADISTIC TO AN ALMOST INHUMAN DEGREE.*\n\n&#x200B;\n\n\\---\n\n&#x200B;\n\n# WELCOME TO THE WEEKLY TIBALT'S TIRADES!\n\n&#x200B;\n\nTHIS IS THE \\*\\*\\****RAGE***\\*\\*\\* THREAD\n\n&#x200B;\n\n**CAPS ON  = TIME TO SHINE**",
        "num_comments": 46,
        "comments": [
            "WHAT WOTC MEANT TO SAY WHEN THEY SAID THEY WANTED TO \"TRY SOMETHING NEW INSTEAD OF A MASTERY PASS\" WITH THIS PSYCHIC FROG THING, WAS ACTUALLY THAT THEY WANTED TO SEE HOW LITTLE VALUE THEY COULD OFFER AND STILL HAVE PEOPLE BUY IT.\n\nTHE VALUE COMPARED TO A PASS IS HONESTLY JUST INSULTING. I WOULDN'T TOUCH THAT WITH A TEN FOOT POLE.\n\nAND THE FACT THAT THEY PRICE IT AT AN AMOUNT OF GEMS THAT IS IMPOSDIBLE TO GET WITHOUT BUYING MORE THAN YOU NEED IF YOU DON'T ALREADY HAVE ANY IS SUCH AN OBVIOUS ATTEMPT TO SQUEEZE A FEW EXTRA BUCKS OUT OF THE PEOPLE WHO DO BUY IT.\n\nFINALLY THE FACT YOU HAVE TO PLAY MORE GAMES PER DAY TO GET ENOUGH TICKETS FOR EVERYTHING THAN YOU WOULD NEED TO PLAY TO GET XP TO COMPLETE A MASTERY PASS IS SUCH UTTER BULLCRAP AND AN ATTEMPT TO CAPITALIZE ON FOMO TO BOOST ACTIVITY LEVELS.\n\nTHIS WHOLE THING IS JUST A BIG, STEAMING PILE OF PREDATORY CRAP.\n\n(EDIT)\nTHE ONLY GOOD THING ABOUT IT IS THAT YOU CAN CHOOSE WHICH ORDER TO GET THINGS IN, SO PEOPLE WHO MIGHT NOT NORMALLY FINISH THE ENTIRE THING CAN STILL GET THE REWARDS THEY CARE ABOUT THE MOST.",
            "OPPONENT GOES FIRST",
            "MH3 MWM EVENT SHOULD HAVE BEEN PHANTOM SEALED BECAUSE A LOT OF PLAYERS ONLY HAVE THE FREE 3 PACKS OF MH3 CONSTRUCTED1? CONSTRUCTED!!?",
            "I'VE ALREADY MULLIGANED TWICE, I ONLY KEPT THIS HAND BECAUSE I CAN'T AFFORD TO MULLIGAN AGAIN.\n\nYOU CAN'T THOUGHTSEIZE ME, IT SHOULD BE ILLEGAL.",
            "TO THE HEAD DEVELOPER OF THE MATCHMAKER ALGORITHM:\nJUST A FRIENDLY REMINDER THAT THERE ARE 5 COLORS IN MAGIC. IT WOULD BE A REAL TREAT IF 4/5 MATCHES WEREN'T CONSISTENTLY AGAINST BLACK OR RED OR BLACK/RED. THANK YOU FOR YOUR ATTENTION TO THIS MATTER.",
            "4 CUT DOWN, 4 GO FOR THE THROAT, 4 SHOOT THE SHERIFF, 4 LILLIANA, 4 SHEOLDREDS EDICT. WHY THE FUCK YOU HAVE CAUSTIC BRONCO AND MOSSWOOD DREADKNIGHT IN YOUR DECK IS INSANE TO ME.",
            "MR. PLANESWALKER A SECOND [[STONE RAIN]] HAS HIT THE [[PHYREXIAN TOWER]] (S)!!!!",
            "EXPLORER BO1.\n\n  \nDID NOT PLAYED VERSUS GREASEFANG FOR ALMOST A MONTH.\n\nQUEUE AS MILL DECK\n\nRAT INFESTATION!\n\n  \nALSO DO YOU KNOW TEMUR ANALYST FROM STANDARD? APPARENTLY ITS A THING IN EXPLORER",
            "NADU NADU MADU NADU NADU NADY NARY NADYCN NADY NADU NADU NADU NADU NAUDNNADY NADU NADU NADU NADU NADU NADU BADU",
            "YOU POWERCREEPED THIS GAME SO MUCH I BARELY PLAY IT ANYMORE"
        ]
    },
    "Saturday Arena Chat Thread": {
        "title": "Saturday Arena Chat Thread",
        "score": 0,
        "url": "https://www.reddit.com/r/MagicArena/comments/1dlmx4t/saturday_arena_chat_thread/",
        "content": "*'Magic bleeds into real life. With Magic, I was mainly being driven by the idea that, if people could collect their own cards, there would be a huge amount of variety to the game. In fact, one way I viewed it was that it was like designing a game for a vast audience, dealing out the cards to everybody instead of designing a bunch of little games.'* \\- Richard Garfield, Creator of Magic: The Gathering\n\n\\---\n\nWelcome to today's open thread, where /r/MagicArena users can discuss anything they wish not related directly to Magic the Gathering or the Arena Client.\n\n&#x200B;\n\nWant to talk about personal life? Cool things you learned today? Whatever happens to be dominating today's news cycle? Do you have something to talk about that didn't warrant its own thread? This is the place for it!\n\n&#x200B;\n\nRemember that the civility rules are still in force, so please engage kindly and pleasantly with each other.\n\n&#x200B;\n\nCheck out our Discord Channel \\[here.\\]([https://discordapp.com/invite/Magic](https://discordapp.com/invite/Magic))\n\n\\---\n\nIf you have any suggestions for this thread, please let us know through modmail how we could improve!",
        "num_comments": 5,
        "comments": [
            "Anyone got a working eldrazi deck for historic bo1? Tried ramp, red green but both get stomped.",
            "Does anyone know if there has been or will be an Arena Open or Qualifier Play-in event that's day 1 draft and not sealed? Thinking about saving my gold, since sealed is a bad time for the most part (imo).",
            "Just tried MH3 Quick Draft. Totally fazed as to what is what and why should this work together. I usually try one 'blind' draft per set, not knowing anything about it in advance. Most sets can be read, as in understanding synergies, but it's a disaster with this set. Plan B went in action very quickly: raredraft. Needless to say I went 0-3.",
            "I've been having luck with one, but it still needs tweaking. Later this week when I've gotten it tuned better I'll come back and add a list.",
            "RWU are the Energy colors (RW aggro, UW Flyers, UR Midrange)\n\nWBG are the Modified colors (GW Auras, WB Dies, GB Graveyard)\n\nRGU are the Eldrazi colors (RG Spawn go wide, UG Ramp)\n\nBR is Artifacts \n\nUB is Card Draw"
        ]
    },
    "Can someone explain why Vindicator triggered like this?": {
        "title": "Can someone explain why Vindicator triggered like this?",
        "score": 46,
        "url": "https://i.redd.it/qgjpcweb128d1.jpeg",
        "content": "cast [[case of gateway express]], target vindicator with ETB trigger, my 11 creatures deal 1 damage to it.\nvindicator triggers 11 times dealing 11 damage each time, kills me from 18 life.\nam i bad at magic or is this bugged in some way?",
        "num_comments": 22,
        "comments": [
            "Honestly, I'm stumped. It seems like a bug, but this is a replacement effect with a triggered ability and an ability causing damage to be dealt from multiple sources - it's a complex scenario and it may very well be that this is the correct outcome. I consider myself to have a decent grasp of the rules, but this is weird.\n\nI would ask the /r/mtgrules sub if you don't get an answer here.",
            "It's just bugged.  The wording on Vindicator is the exact same as the wording on a shield counter, and one shield counter prevents simultaneous damage from multiple sources with one application.  The Vindicator replacement should apply one time, prevent 11 damage, and create one 11-damage trigger.\n\n122.1c ... “If damage would be dealt to this permanent, prevent that damage and remove a shield counter from it.”",
            "Yeah I don't see or can think of any reason it would happen this way in the rules. \n\n(I'm also wondering why you targeted Vindicator with this but that's really beside the point.)",
            "Yeah I can't see any reason why it would trigger that way and I'm combing the rules. Each 1 damage dealt by case of the gateway express is an independent damage source, dealt by that creature, not case of the gateway express. Ie it will benefit from their lifelink/deathtouch/etc, remove a single shield counter, etc. But its also dealt simultaneously, which has some open ended questions about how it would interact with potential mechanics (if something said 'the first time a creature deals damage each turn...' or something like that). But for vindicator it should simply see 11 different instances of 1 damage each, prevent each of them, then put 11 triggers of 1 damage each to 11 targets. So I don't get it",
            "I definitely wouldn't have expected it to trigger the full damage that many times, so it feels like a bug to me, but it could just be a very counter intuitive ruling I guess 🤷‍♂️\n\nAlso, I'm not sure why you targeted it, because if it worked as I would expect, they would be able to ping your creatures to death and Vindicator would still survive because the damage would be prevented anyway.\n\nAnd thirdly I'm now wondering if there's any way to use Vindicator and the Case against the opponent to trigger lots of unexpected damage, but Case only targets a creature you don't control, so I'm guessing maybe not unfortunately...",
            "No offense, but why target it in the first place?",
            "[here is an older thread about this](https://www.reddit.com/r/askajudge/comments/17wuwvz/phyrexian_vindicator_with_simultaneous_damage)\n\nSeems like a bug.",
            "This is correct. The ETB is done at once, so the effect is \"11 targets hits vindicator for 11 damage\". Vindicator sees that it was hit for 11 from 11 different targets therefore gets 11 triggers of 11 damage each",
            "It appears that you are concerned about an apparent bug with Magic the Gathering: Arena. Please remember to include a screenshot of the problem if applicable! [Please check to see if your bug has been formally reported.](https://feedback.wizards.com/forums/918667-mtg-arena-bugs)\n\nIf you lost during an event, please contact [Wizards of the Coast for an opportunity for a refund.](https://mtgarena-support.wizards.com/hc/en-us/requests/new?ticket_form_id=360000317092)\n\nPlease [contact the subreddit moderators](https://www.reddit.com/message/compose?to=%2Fr%2FMagicArena) if you have any questions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MagicArena) if you have any questions or concerns.*",
            "It's 11 sources doing 11 damage all at once. So for each source of damage it's preventing 11 damage and the opponent gets to do 11 damage to you. Damage prevention has some interesting corner cases and I think this might be one of them."
        ]
    },
    "Is it worth it to spend gold for 'Jump In' just for the cards?": {
        "title": "Is it worth it to spend gold for 'Jump In' just for the cards?",
        "score": 25,
        "url": "https://www.reddit.com/r/MagicArena/comments/1dlnugy/is_it_worth_it_to_spend_gold_for_jump_in_just_for/",
        "content": "For a new (returning actually) player with not many cards ...\n\nYou spend 1000 gold to get an assortment of 40 cards? I tried and got 9 uncommons, 1 rare, and 1 mythic. It seems like a good deal for the cost of one booster?",
        "num_comments": 23,
        "comments": [
            "When I started I thought it was a great deal. You get a lot of cards and you get to play in a sandbox of other people with similarly powered decks, allowing you to complete daily quests and get wins.\n\nAfter a while of building up your collection, then you can branch out.",
            "The benefit is that the cards you get synergize with each other, so they're a good start to building a cohesive deck.\n\nThe drawback is you don't get \"wildcard progress\": for every certain number of booster packs you open, you get a wildcard that can be redeemed for any card of a specific rarity.\n\nSo Jump In is better when you're just starting out and trying to get enough cards to build a deck, but packs are better when there's a specific deck you want to craft.",
            "It's the cheapest way to build your collection from scratch and the cheapest way to get enough cards for some decent decks with a minimum of synergy, so you can start playing in formats like standard.\n\nDoesn't give you wildcards like buying packs would, but you get a lot of cards",
            "I usually play jump in about twice per set release. But it has been quite the hassle to look up which rares you get with which pick.\n\nThe price of entry is so low (the price of one pack), but the rewards are also low. And I find the subsequent games pretty unfun.",
            "Wait jump in updates after every release?",
            "It's not a bad deal, but on the other hand store packs from the latest standard set also give you wildcard wheel progress (1 rare wildcard every 6 packs), has a small change of having a wildcard themselves, and give you gold packs (6 extra rares every 10 packs).\n\nAll this combined to the fact that Jump In also has Alchemy cards makes me recommend buying boosters from the latest standard set to grow a collection instead (right now this would mean Thunder Junction Packs). Keep in mind that commons and uncommons are basically free in the long run.\n\nHaving said all this, Jump In can be fun, so it's a good way to have fun and win cards, and it's a lot less risky than drafting (which if you are good at it's a lot better value).",
            "Edit: I was wrong.",
            "It's not bad for a new beginner, I would caution not getting too crazy with it just yet as standard is about to rotate and there may be new decks on the horizon.  Be a shame to waste your gold now on cards that are about to rotate.",
            "It's worth it to fill in cards from previous sets, but don't solely do jump in. Buying packs from the newest set gets you wild cards. \n\nI've come back to the game and am essentially starting new as my collection has largely rotated out, so I've got a lot of catching up to do. I buy packs mostly, but supplement it with a few jump ins per week.",
            "Duplicate protection still works for vault advancement. It ain't much but it's something."
        ]
    },
    "Truly one of the Emrakul turns of all time": {
        "title": "Truly one of the Emrakul turns of all time",
        "score": 296,
        "url": "https://streamable.com/cg73sv",
        "content": "",
        "num_comments": 107,
        "comments": [
            "“Hey thanks I was gonna do that anyway.”",
            "It’s sometimes a bit of a challenge to get into the “what’s the absolute worst play I can make” mentality. Your opponent REALLY struggled with that.",
            "Just like how some people shouldn't be allowed to drive, sone people shouldn't be allowed to Emrakul. Amazing.",
            "That is pretty funny, but I don't think there was a truly winning play here once they cast Emrakul?",
            "Pretty obvious that opponent thought they could exile your creatures but were forced to exile emrakul. Funny nonetheless",
            "Wow lol. How in the world did opponent play Emrakul on turn 2 though? You can cast something for 2 mana that lets you pay life to cast any spell?",
            "bro you're taking too long to win, let me help",
            "bro is literally the drooling brainlet wojak meme",
            "Seeing it is an energy deck, would the best \"worst play\" be to get rid of Guide of Souls by attacking into the Emrakul and passing? Or would it be better to play the land and dash in Ragavan to attack it into Emrakul? Ither way there isn't a stellar turn for the Emrakul.",
            "Emrakul Emrakan't even"
        ]
    }
}