{
    "Simple Questions and General Community Discussion Thread": {
        "title": "Simple Questions and General Community Discussion Thread",
        "score": 5,
        "url": "https://www.reddit.com/r/MakeupAddiction/comments/1dlbrgq/simple_questions_and_general_community_discussion/",
        "content": "Use this post for anything you feel doesn't need to be a whole post of its own! Ask for product recommendations! Get opinions on what eye shape you have! Or just get to know each other!",
        "num_comments": 48,
        "comments": [
            "What mascara made your lashes fall out",
            "I was wondering what my [eye shape](https://imgur.com/a/eu1QWn2) is? Tips for eyeshadow + liner would be greatly appreciated!",
            "Is there a wax or something for eyelashes that would stick your eyelashes upward without necessarily drying out/damaging your eyelashes?",
            "I need help with sunscreen suggestions. I have combination skin and most sunscreens break me out on my face. They clog my pores. Any sunscreen brands. I live in Tennessee.",
            "Hii im pretty new to makeup and I have a good amount of products and stuff but im not always exactly sure where to start, so could anyone please give me a brief breakdown of their everyday, light makeup routine( like something you could wear to school) and their full glam party routine?",
            "So I’m a brown girl with like light brown skin..what brown girl lip combos do u guys recommend? (I’d like a day look and something more vampy that you could wear at night)",
            "How do y’all do winged eyeliner? Any techniques/tips or tricks? (Using a liquid liner btw)",
            "***Thank you for contributing to MUA! If this is your first post, please be sure to check out our rules in the subreddit sidebar. If you are on mobile, they can be viewed by tapping the*** ⓘ ***symbol.***\n\n**A few quick highlights:**\n•  \n\n• Looks, hauls, and flatlays require a [product list in the comments, complete with shade names within 20 minutes of posting.](https://www.reddit.com/r/MakeupAddiction/wiki/productlist)\n\n• Photos must not be [edited or filtered. This includes automatic beauty and portrait modes found on many phones and newer cameras.](https://www.reddit.com/r/MakeupAddiction/wiki/photoediting)\n\n• Lastly, our [Helpful Guides for Navigating MUA](https://www.reddit.com/r/MakeupAddiction/wiki/helpfulguides) in the sidebar explains some of the basics of the community as well as commonly misinterpreted rules.\n\n**Is your post just a search away?**\n\nBefore you make a post, search with Reddit's search feature or use this handy [customised Google search.](https://cse.google.com/cse?cx=008480394191906358284:aflieg73nqm)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MakeupAddiction) if you have any questions or concerns.*",
            "I need a Smashbox Hydrating Undereye Primer dupe - and I hadnt realized they discontinued it until I needed more. help?",
            "Hey everyone!  Guy here, I’ve been mainly using makeup for the past year or two to mainly cover beard shadow (I have the worst genes for facial hair)/have smoother skin.  I’ve been wanting to actually branch out a bit and get into better products/applying makeup a bit better.  \n\nMain questions:\n\nBrands/types for concealer, foundation, primer, mascara and eyeliner, also makeup remover.  I’ve been pretty basic and just use Colour Pop and whatever mascara looks fine to me.-  Also for brushes, sponges etc.  This is the main one for me, lol.  Mainly looking for decent brands and ones that aren’t terrible for your skin if possible :).\n\nOtherwise, cleaning brushes, how to apply stuff/what order.  I think I’ve been doing it right but I also know I could be doing better probably.\n\nAny articles/vids can help too, or any other advice- thanks in advance!"
        ]
    },
    "Mod Applications Are Open!": {
        "title": "Mod Applications Are Open!",
        "score": 24,
        "url": "https://www.reddit.com/r/MakeupAddiction/comments/1avoz88/mod_applications_are_open/",
        "content": "Hey r/MakeupAddiction!\n\nIf you haven't heard, we're almost at 5 million users. That's a lot! With our community growing more and more each day, were in need of more moderators to ensure we can keep up and maintain a solid standard of moderation. If you love makeup and you're interested in moderating, consider applying!\n\n[Apply here](https://docs.google.com/forms/d/e/1FAIpQLSfGLO-lLtO99Z80_t5YlN3ET8t_igt8LraOGId3pNzk5zaQ1A/viewform?usp=sf_link)",
        "num_comments": 3,
        "comments": [
            "[removed]"
        ]
    },
    "New to makeup. Hoping to let straight men feel like it's okay to be pretty too!": {
        "title": "New to makeup. Hoping to let straight men feel like it's okay to be pretty too!",
        "score": 559,
        "url": "https://www.reddit.com/gallery/1dr1cvn",
        "content": "",
        "num_comments": 79,
        "comments": [
            "You rock, love the eye makeup... sincerely, from old boomer bitch",
            "I love the colours on you! And Prince was a total sex icon for women around the world- makeup on men with confidence is sexy AF",
            "cute!!!! i love this",
            "Flawless!! Love the colors! And the fact that they match your shirt too is just 😙🤌🏻",
            "I think it would serve your features to adjust a couple things, but I like where you’re going with this! Have you ever tried applying wet eyeshadow into your lash line? It highlights your eyes without having to add a dark eyeliner to your waterline. You can play with the colors and I think softer colors suit your skin tone. A berry lip would probably look really nice on you too. Keep up the good work!",
            "Omg, I love the green on your eyes!!",
            "you are not straight stop the propaganda",
            "TF is this shit?",
            "***Thank you for contributing to MUA! If this is your first post, please be sure to check out our rules in the subreddit sidebar. If you are on mobile, they can be viewed by tapping the*** ⓘ ***symbol.***\n\n**A few quick highlights:**\n•  \n\n• Looks, hauls, and flatlays require a [product list in the comments, complete with shade names within 20 minutes of posting.](https://www.reddit.com/r/MakeupAddiction/wiki/productlist)\n\n• Photos must not be [edited or filtered. This includes automatic beauty and portrait modes found on many phones and newer cameras.](https://www.reddit.com/r/MakeupAddiction/wiki/photoediting)\n\n• Lastly, our [Helpful Guides for Navigating MUA](https://www.reddit.com/r/MakeupAddiction/wiki/helpfulguides) in the sidebar explains some of the basics of the community as well as commonly misinterpreted rules.\n\n**Is your post just a search away?**\n\nBefore you make a post, search with Reddit's search feature or use this handy [customised Google search.](https://cse.google.com/cse?cx=008480394191906358284:aflieg73nqm)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MakeupAddiction) if you have any questions or concerns.*",
            "You know what else straight men can do? Follow the rules of the sub they post in! Or do the rules not apply to you? You are required to leave a detailed list of every product you used in your look on this sub."
        ]
    },
    "no makeup vs “no makeup makeup”!": {
        "title": "no makeup vs “no makeup makeup”!",
        "score": 1198,
        "url": "https://i.redd.it/l6h6keovld9d1.jpeg",
        "content": "products:\n- neutrogena healthy skin concealer in bisque light/001\n- etude house blush in grapefruit jelly\n- 100000 year old eyeshadow in brows \n- maybelline colossal mascara \n- peripera lip liner in rosy nude \n- aquaphor on lips ",
        "num_comments": 109,
        "comments": [
            "100000 yr eyeshadow for eyebrows is too real 🤣 those colors really suit you well!",
            "I hope you don’t take this the wrong way but I think you look absolutely stunning without makeup, your skin is gorgeous and your eyebrows are beautiful.",
            "You have flawless skin! -envy",
            "You’re beautiful either way. But it’s no make up on you for me 😘",
            "I don’t even understand where you used concealer as you genuinely look flawless in the no makeup photo. I’m so jealous, your under eye is naturally brighter than my under eyes after full coverage concealer lol.",
            "Ah such beautiful skin ❤️",
            "Wow, you are glowing in both! Also, your hair is great!",
            "Oh, there’s Cersei ! \nYou look lovely :D",
            "I love using eyeshadow for my brows!! 😭",
            "everyone here is saying how much they like no makeup but i want to say the no makeup makeup is incredible u did such a great job the mascara & lips the dewey under blush look"
        ]
    },
    "What do you think about E-girl makeup?": {
        "title": "What do you think about E-girl makeup?",
        "score": 1591,
        "url": "https://i.redd.it/0t2txofdna9d1.jpeg",
        "content": "I saw e-girls videos on instagram reels and i think it looks cute, but when i open comments some of them make fun about their makeup style. What do you think about this makeup style? And why do they make fun of this makeup style ( maybe because i'm asian so i don't understand western makeup trends? )",
        "num_comments": 613,
        "comments": [
            "E-girl makeup looks good on camera but not in real life. I tried it during the pandemic, and then again a couple months ago and both times it didn’t look good in the mirror but it looked okay on camera. Not for an everyday look, but something somewhat similar is douyin makeup which I feel translates better to an everyday look.",
            "Because the 'e-girl' makeup style can be very cartoonish with the whole thing around the heavy blush, falsies, intense highlighter on the tip of the nose - Too bold for some tastes.",
            "I used to never wear blush until I tried the e-girl blush placement and it flattered my face shape SO well.",
            "It's so cute but I kind of feel like you have to have naturally huge eyes to get away with it. I don't think it would work well on small, narrow, or hooded eyes.",
            "It gives belle delphine... And for that reason I can't look at it without getting the ick tbh.\nNot a fam about the blush over the nose, the lashes and the laser pointer on the nose highlighter.\nIf that is toned down its a nice soft everyday look",
            "I appreciate over-the-top or costume-y makeup, but the e-girl look feels like it was designed for the male gaze, and that is not my jam.",
            "i feel like most regular people stopped doing this look in 2020, 2021 tops, so the e-girl makeup + e-girl face expression gives only fans model.\n\nhowever i do think it's cute tho and it probably doesnt read like that in real life, specially if you're not forcing doe eyes for a camera like they are",
            "I don't think it's that big of a deal in real life tbh. I mean if you're posting about it, then yea people are gonna share their opinions (often in harshly), but most people don't really notice/say anything if you don't point it out yourself.",
            "Open up most make-up videos and there's always people making fun of the trend. Don't mind the haters.\n\nI like e-girl a lot, and that bottom tutorial is one I used to perfect my e-girl look a couple years ago. It does look cartoonish in real life, but that is how it's supposed to look. I had to do a few different tricks with mine since I have hooded eyes.\n\nMy advice is try it out! I like doing e-girl for concerts, mall trips, or photoshoots. In my opinion it looks fine in synthetic low light, but like most heavy make-up it doesn't do well in natural light. Not an everyday look, but it's fun to play with it.",
            "It’s pretty online but I’ve always noticed to looks bad in real life"
        ]
    }
}