{
    "[OFFICIAL] Daily Feedback Thread": {
        "title": "[OFFICIAL] Daily Feedback Thread",
        "score": 4,
        "url": "https://www.reddit.com/r/makinghiphop/comments/1dr3i17/official_daily_feedback_thread/",
        "content": "READ THIS TEXT CLOSELY BEFORE POSTING!!! NO FEEDBACK = BAN\n\nIf you post something for feedback, you must give QUALITY feedback at least once before the next thread is up. Check out the [Quality Feedback Guide](https://www.reddit.com/r/makinghiphop/wiki/feedbackquality) for tips on giving good feedback. Sincere feedback requests only please. Posting for plays will not be tolerated.\n\nOne feedback request per thread max (i.e. one track)\n\nDon't post songs more than a couple weeks old\n\nLeave feedback at least once as a reply to a top-level comment to avoid being flagged as a slacker. To be super clear, this means you click reply on someone else's original comment. This thread is enforced with the help of the TonyModtana bot, because our bot cannot distinguish between feedback and gratitude, replies to comments that left you feedback will not be counted.\n\nNO FEEDBACK = BAN\n\nThis thread is posted every day at Midnight Eastern (GMT -5). [Click here for the full automoderator thread schedule.](https://www.reddit.com/r/makinghiphop/wiki/weeklythreadschedule)",
        "num_comments": 22,
        "comments": [
            "Please report all low effort feedback and feedback evasion. The hammer of justice is unisex. \n\n\n##Check out the [Remix Challenge](https://www.reddit.com/r/makinghiphop/search?q=remix%20challenge&restrict_sr=1&sort=new)\n\n##[Lofi Flip](https://www.reddit.com/r/makinghiphop/search?q=%5BLFF%5D&restrict_sr=1&sort=new)\n\n##[Flip This Challenge](https://www.reddit.com/r/makinghiphop/search?q=%5BFTC%5D&restrict_sr=1&sort=new)\n\n##[One Kit Challenge](https://www.reddit.com/r/makinghiphop/search/?q=OKC&restrict_sr=1&sort=new)\n\n##[Weekly Cypher](https://www.reddit.com/r/makinghiphop/search/?q=%5BCYPHER%5D&restrict_sr=1&sort=new)   \n\n##and the bi-weekly [MHH TEAMS COMPETITION](https://www.reddit.com/r/makinghiphop/search?q=flair_name%3A%22MHH%20TEAMS%22&restrict_sr=1&sort=new)   \n\n##for some opportunities to participate in this subreddit\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/makinghiphop) if you have any questions or concerns.*",
            "let me know what you think of my latest release:\n\nhttps://soundcloud.com/astrorockit/jubilee\n\nreturning all feedback",
            "[deleted]",
            "[Unfinished song, only have this so far.](https://youtu.be/D5JDcQDQ-cg?si=Q8JJ4LdfbXoSTDNm) Still a work in progress and needs to be fixed, trying a new sound. Lmk your thoughts.\n\nReturning all feedback.",
            "Here's an instrumental EP I released a few weeks back, fully produced on the MPC One. I made the full patterns beforehand and performed/recorded them as live jams while playing randomly with the MPC track mutes.\n\nThe beats are a mix between EDM and hip-hop. Hope y'all enjoy!\n\nRETURNING ALL FEEDBACK\n\nhttps://open.spotify.com/album/3Ltd1UjARFwGh9TER7jHWQ?si=8PHVG1-qR3yyTwz4o4pi3A",
            "clams casino type beat – solaris, any kind of support is welcome ❤️ \n\nhttps://youtu.be/iea-U-dtk34?si=UYUniRNhaUfLRYGF",
            "https://open.spotify.com/track/4w7zQPY9ZhM4JCu3zffl4F?si=cO1T4nqARNeW99tlzLv5bQ \nFirst single off my album, on apple too.",
            "My submission from Freestyle Friday over an asap type beat, lmk what you think of it:\n\n[https://youtu.be/yIaDWNe32JY](https://youtu.be/yIaDWNe32JY)\n\nReturning feedback!!",
            "returning \n\nMORTAL KOMBAT GAMER SONG 🎮\n\nhttps://open.spotify.com/album/203nkGQr1Bl423lr5xf9dS?si=-hPqvLjkRmurlZu4_NqLAA",
            "I've spent the last couple years recording with my homie in the forest in a car, here's one of the songs we got:\n\n[https://soundcloud.com/rebelsoundco/distant-1](https://soundcloud.com/rebelsoundco/distant-1)"
        ]
    },
    "Flip This Challenge 11 (FTC11)": {
        "title": "Flip This Challenge 11 (FTC11)",
        "score": 16,
        "url": "https://www.reddit.com/r/makinghiphop/comments/1dp7e66/flip_this_challenge_11_ftc11/",
        "content": "Hey guys, hope your all doing good! Great entries to the last FTC all round. Thanks again for the votes. I've got back into producing after a nearly 10 year break recently and used to do the FTCs on here back then, so it was  a lot of fun doing another one as a re-intro to the hobby.\n\nHere's my pick for the next sample, had it saved on a playlist of potential samples and haven't used it yet so thought it'd be a good candidate:\n\n# Joël Fajerman - Rose Des Sables\n\n[https://www.youtube.com/watch?v=-bWKliNoQv0&ab\\_channel=AlexB](https://www.youtube.com/watch?v=-bWKliNoQv0&ab_channel=AlexB)\n\nGood luck, hope you have fun with it.\n\n**Rules -**\n\n1) You can only submit 1 beat\n\n2) You have to use the sample in your beat, it should be recognisable (don't just throw it in a granular synth lol). You can add other instruments and samples obvs, but the sample should be a main element.\n\n3) Beats can be any genre, no bonus points for making a specific genre beat\n\n4) Deadline - 4 July 2024\n\n**How to win? -**\n\nAny submissions submitted before the deadline, will be uploaded on the voting post, whoever gets the most votes wins. Winner gets to decide the sample for the next FTC and has to make the next post.",
        "num_comments": 5,
        "comments": [
            "Thank you for the sample. Can't wait to hear the beats coming out of this.",
            "[https://drive.google.com/file/d/1dP21MmC1xAdO1OSlJJ0HLrzLmSMixk7S/view?usp=sharing](https://drive.google.com/file/d/1dP21MmC1xAdO1OSlJJ0HLrzLmSMixk7S/view?usp=sharing)",
            "Inspired by old school boom bap aesthetics even though it's not that genre really [https://soundcloud.com/green-harp/hawk-tuah-freestyle-prod-green-harp?si=3b87ac21ae644b0bae52b507b6f46424&utm\\_source=clipboard&utm\\_medium=text&utm\\_campaign=social\\_sharing](https://soundcloud.com/green-harp/hawk-tuah-freestyle-prod-green-harp?si=3b87ac21ae644b0bae52b507b6f46424&utm_source=clipboard&utm_medium=text&utm_campaign=social_sharing)",
            "[https://soundcloud.com/hublotkingcole/ftc-11-2024-prod-hublotkingcole](https://soundcloud.com/hublotkingcole/ftc-11-2024-prod-hublotkingcole)",
            "u/auurbee thank you for posting a contest submission, if you do not see this post in your feed, please contact the moderators to have it manually approved\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/makinghiphop) if you have any questions or concerns.*"
        ]
    },
    "If you had to work on 1 beat for 30 days, what would you be doing?": {
        "title": "If you had to work on 1 beat for 30 days, what would you be doing?",
        "score": 18,
        "url": "https://www.reddit.com/r/makinghiphop/comments/1dqwxuj/if_you_had_to_work_on_1_beat_for_30_days_what/",
        "content": "If you are given 1 month to make 1 beat, what would you be spending the extra time on? \n\nIt usually takes most producers 1-3 hours to cook up and post a beat. \n\nBut let’s say you were challenged with 30 days to work on just ONE beat, few hours a day.\n\nWhat would you be working on improving each day? \n\nWhat sort of elements and specifics would you focus on and try to perfect?\n\nWhat would you do differently?\n",
        "num_comments": 41,
        "comments": [
            "make a beat in an hour, spend the other 29 overthinking the mix",
            "I’d try every single sample in the same key in my collection against it, then every sample in a complementary key. \n\nBut an arbitrary amount of time like this won’t make better beats. I’d probably be done in a week, and have three weeks left over doing nothing. Limitations like “you have one hour” or “you can only use one drum sound at a time” or “you can only have one sample playing at a time” will yield better results than one like this. Learning to recognize when something is done is in and of itself an important skill.",
            "I'd be wasting my time.\n\nYou're not going to improve without completing, listening, analyzing, revisiting and or moving on to a new project and incorporating lessons you've learned from actually completing projects.",
            "29 days listening to music to pick a sample and 1 day making the beat",
            "probably challenge my instrumentation and sound design skills and go full flying lotus",
            "sound efx and percussion hits everywhere",
            "If I'm working on a beat for 30 days. I'm tracking with a full rhythm section, string section and it's a multipart epic. Otherwise there's no real reason to work on a single beat for 30 days.",
            "Day 1 - drums, day 2 - bass, day 3 - main melody/sample, day 4 - variations and change ups, day 5 - any extra “dressing”, day 6 - eq it all, day 7 - release and prosper 🙌.",
            "I’d probably make it the first night then spend then next 29 tweaking the mix and coming full circle on it",
            "I would made the beat in the same amount of time I usually do, and then watch tv for the rest of the time.\n\nMore time doesn’t mean a better track. And honestly, most of the time, it gets worse haha"
        ]
    },
    "[BEAT TAPE] I dropped my first EP on streaming": {
        "title": "[BEAT TAPE] I dropped my first EP on streaming",
        "score": 19,
        "url": "https://www.reddit.com/r/makinghiphop/comments/1dqpu52/beat_tape_i_dropped_my_first_ep_on_streaming/",
        "content": "[SPOTIFY LINK](https://open.spotify.com/album/1vZTrqjY2gHKceAALfUIuV?si=zbzYbg45Q22MdKDYA_XIRw) \n\n(Apple Music, SoundCloud, and Bandcamp links will be up shortly) \n\nI’ve been producing for a few years now but I really only started taking it seriously last year. In that time I created as much as I could and worked on improving my craft. I’ve desired to get my work onto streaming in the hopes of reaching more people to make new connections and find people who resonate with my art. With that being said, I recently released this short little EP as a starting off point. These tracks were initially made with the intention of rapping over them, but after I recorded some tracks I felt that the instrumentals worked better as a standalone piece. I am super proud of how the entire project turned out and I feel the tracks work well together. \n\nIf you have seven minutes of your time to give this a listen it would make my day. Any feedback or advice (or comments in general) would also be greatly appreciated so I can improve my next release(s). \n\nThank you for reading, stay blessed.",
        "num_comments": 15,
        "comments": [
            "Im gonna drop a first impressions review on each:\n\n1. Sounds a lot like something j cole or ab soul could use\n\n2. That second one is quite literally perfection to me. Perfect mix if jazz sound. Idk who could flow on that sound in modern rap though\n\n3. I dont like this one personally\n\n4. The only type of beat with a bit of a west coast feel that i actually like. (Im not from cali but this one made me feel like i was IN cali) \n\n5. I LOVE that piano pattern even though its a simple one, drums seem a bit loud for my taste but they arent bad for it\n\n6. I would find a way to eliminate that dead sound in the middle, unless you use it as a way to flow into a beat switch maybe? Similar to 7 Minute Drill J Cole’s beat switch and producer sound? Generally a fairly easy on the ears sound and might not be a full beat worthy but for a switch INTO a full beat switch, may be peak\n\n7/10 from a random nobody with fairly picky ears\n\nEdit: wheres the apple music link man you gotta get it accessible to people who hate using spotify lol",
            "Diggin it! Cookin soul soul soul! Good Job hi.forest!!!",
            "bro thats beautiful",
            "Dope tape. Reminds me of Peanut Butter Wolf.",
            "Loving the sample chops on this, sounds dope.",
            "Yo first of all, thank you so much for listening to it and taking the time to share your thoughts. I appreciate your feedback on the project, this comment is significant in helping me grow my sound. 🙏🙏\n\nMy bad about the Apple Music delay, im using distrokid and I didn’t realize that streaming platforms take different amounts of time to process the song so hopefully it will be up within a few days. For the time being, it should be up on soundcloud and bandcamp tonight because im also not a huge fan of Spotify haha\n\nThanks again bro your comment means a lot to me as an artist who is trying to improve 🙏🙏🙏🙌🙌",
            "Thank you for listening! Appreciate you homie🙏🙏🙏",
            "Bless you homie, appreciate it 🙏🙏",
            "Appreciate that homie, his track Run the Line is a big inspiration to me 🙏🙏",
            "Thank you for listening 🙏🙏"
        ]
    },
    "What do I need to sample cassette tapes?": {
        "title": "What do I need to sample cassette tapes?",
        "score": 1,
        "url": "https://www.reddit.com/r/makinghiphop/comments/1dr70ub/what_do_i_need_to_sample_cassette_tapes/",
        "content": "I am currently trying to put audio through a cassette tape and run it back into my DAW. What materials do I need, and how do I do this? Thanks!",
        "num_comments": 0,
        "comments": []
    }
}