{
    "What style looks best on me? (Short to long) last pic is most recent": {
        "title": "What style looks best on me? (Short to long) last pic is most recent",
        "score": 39,
        "url": "https://www.reddit.com/gallery/1dr3hgp",
        "content": "",
        "num_comments": 53,
        "comments": [
            "Short",
            "4th, the first and second don’t suit you very well, but that could also be because you look a lot younger.",
            "Long!",
            "IMO first one",
            "The second one. I like stylish anime \"badboy\" haircuts, it suits your physique nicely",
            "1 or 5, maybe 6. Other ones just ain’t it",
            "Buzz",
            "1sttttt",
            "The last photo.",
            "1st one 100%"
        ]
    },
    "Facial hair or shaved?": {
        "title": "Facial hair or shaved?",
        "score": 104,
        "url": "https://www.reddit.com/gallery/1dqw9ju",
        "content": "",
        "num_comments": 106,
        "comments": [
            "Shaved",
            "Shaved",
            "Shaved. Beard hides jawline and makes you look worse",
            "Shaved looks more mature and attractive. Having such a small amount of facial hair looks boyish. Also your chin and jawline look really good so it'd be a shame to hide it.",
            "Shaved. That’s not enough facial hair to even consider having it. Unless you can grow a full beard I always say shave.",
            "Maybe if you had a full beard, but a goatee like this doesn't work",
            "Handsome",
            "Which picture has the facial hair?",
            "I like the facial hair",
            "shaved but the hair from the second picture"
        ]
    },
    "What am I supposed to do with my hair?": {
        "title": "What am I supposed to do with my hair?",
        "score": 21,
        "url": "https://www.reddit.com/gallery/1dqygz0",
        "content": "I have straight black ‘asian’ hair. I showed middle part asian hair to my barber but I don’t think it helped. I hate my hair and don’t know what to do with it.",
        "num_comments": 14,
        "comments": [
            "First, do you have any idea how attractive you are? With your great bone structure, appealing features and warm complexion, you have a foundation where you can build a lot of options. From your pics, your hair looks healthy, but fine. That means you’re either going to add volume with products and blow drying or work within the restrictions of that hair type. Of the three pics, one is by far the best and just needs some shaping and refining. The hair hanging into your face on the other two images just looks sloppy, and I’m sure you find yourself pushing it out of your eyes often. Shame you don’t wear glasses with a thick black frame. The right pair could be a great accessory for you. The current ones with the thin frame really age you. Seriously, you’re a beautiful guy. You may need to go to a new stylist to optimize your hair potential if your barber is not strong with scissor cuts.",
            "Middle part and trim the sides",
            "I think it looks good as it is. Nothing to worry about.",
            "you could get a wavy perm if you want, i have some asian friends with the same straight asian hair and i think it was a big step up for them, i also think if you wanted you could rock a shorter cut too",
            "idk but i just wanna say you’re cute",
            "Eat it. \n\nCut it off, put it on a plate, and eat it. Like spaghetti. Swirl it around on a fork. Add salt to taste.",
            "Warrior cut",
            "Hey, thanks. Those are very kind words. My friends were telling me to go with the middle part, and I honestly wasn’t so sure and I don’t think I like it. I went with it mostly because I thought my forehead was too big and wanted to hide it. I do wear glasses, I just took them off for the photos because I thought they made me look worse. I am planning on getting new frames though. Thanks for the advice.",
            "Why can't I get someone so smart under my post lmao",
            "True."
        ]
    },
    "I shower, wait for my hair to dry, go out for 10 min and it turns into this ": {
        "title": "I shower, wait for my hair to dry, go out for 10 min and it turns into this ",
        "score": 15,
        "url": "https://www.reddit.com/gallery/1dqzlzc",
        "content": "As the title says, this is something that happens everyday: I shower using quite good (expensive?) products, I let my hair air dry to better protect it, I fix it with my hands (I don’t touch it a lot just 30 sec tops)… then I go out and if it slightly (slightly!) windy, it turns into this… what should I change ?",
        "num_comments": 8,
        "comments": [
            "Are you familiar with curl creams? Try those instead of your current styling product. They add structure and definition to curly hair. You have great hair and are a handsome guy. I promise you that your hair isn’t that bad.",
            "I think it looks good on you! You're adorable. Plus, some people like curly hair, it's fun to play with. ;)",
            "Nothing! Looks great as it is",
            "Your hair looks great!",
            "You have curly hair, look up some curly hairstyles and go for one of those",
            "Any recommendation?",
            "This is a curly hairstyle, he just needs some product",
            "My hair is straight, so I can’t recommend a product from personal use. There’s a brand called My Black is Beautiful that two of my friends use. One is Haitian and one is Egyptian. Their hair is more coily than curly but they use the fortifying conditioner and the leave in cream. You can find those on Amazon and read the product descriptions and that will link you to other options."
        ]
    },
    "should i get a buzz?": {
        "title": "should i get a buzz?",
        "score": 6,
        "url": "https://www.reddit.com/gallery/1dr2qa6",
        "content": "is my forehead too big?",
        "num_comments": 4,
        "comments": [
            "Try a fade",
            "No don't get a buzz cut never bro it ain't gonna look good on you I recommend growing the hair and doing something like fringe",
            "Is the recession likely to stop or is it still going back?",
            "Could you rock a buzz and look good, yes.  Do you need to buzz, no."
        ]
    }
}