{
    "➡️ Daily Questions ⬅️- Post simple questions such as Outfit Feedback, Clothes ID, and Recommendation requests here!! - 21 June 2024": {
        "title": "➡️ Daily Questions ⬅️- Post simple questions such as Outfit Feedback, Clothes ID, and Recommendation requests here!! - 21 June 2024",
        "score": 16,
        "url": "https://www.reddit.com/r/malefashionadvice/comments/1dl7i2q/daily_questions_post_simple_questions_such_as/",
        "content": "Welcome to the Daily Questions thread for all things related to men's fashion.\n\n**Types of questions this thread is great for:**\n\n* Clothing or footwear recommendations 👞\n* Outfit feedback and advice 🧥\n* ID'ing clothes from pictures or screenshots 🖼️\n\n**Want a more helpful answer?**\n\nThe more information you give, the better response you'll get. Try including:\n\n* Budget in numbers 💲 and location 🌍\n* A screenshot of any clothes from a video 🖼️\n\n**How to add a picture to your Reddit comment:**\n\n* You can upload on the [Reddit app and website](https://reddit.zendesk.com/hc/en-us/articles/10516331142932-How-do-I-add-images-in-comments-)\n\n[add images to your comment on Reddit's app and website by clicking the add-image button](https://preview.redd.it/et77qtnc6wpa1.png?width=1161&format=png&auto=webp&s=e6965cbf5d04bd279b3b8673c5472b90a9f0785d)\n\n* Or upload your picture to [Imgur.com](https://imgur.com/upload) and copy/paste the link into your Reddit comment.\n\nIf you're looking for more in-depth information then check out our [style guides](https://www.reddit.com/r/malefashionadvice/wiki/guides) 🛍️, [item guides](https://www.reddit.com/r/malefashionadvice/wiki/itemguides) 👔 and [recommendation threads](https://www.reddit.com/r/malefashionadvice/wiki/itemguides#wiki_item_suggestions_at_each_price_point) 📄.\n\n# The [MFA Discord](http://discord.gg/malefashionadvice) is also open for questions in the [\\#questions-and-advice](https://discord.com/channels/1116793467654381685/1116794518415622154) channel!",
        "num_comments": 116,
        "comments": [
            "Is it a faux pas to wear one’s wedding suit after the fact? I’ve thought that it would be a great opportunity to justify buying a nicer suit than I’d ordinarily be able to and use for a while, but I had a conversation with a friend who was a bit confused by that thinking. Basically, because it’s such a special garment, wearing it often would be a bit weird. My thinking is garments can be worn at all kinds of special occasions, so why would a wedding suit be any different?\n\nWhich mindset is correct?",
            " recently came to the realization that my feet are too wide for most shoes, after buying a pair of wide shoes. Now all of my shoes are supremely uncomfortable. Any recommendations for wide toed shoes that aren't dad sneakers? I like to wear boots, and enjoy a slight heel. \n\nAlso, I dance salsa and like to wear dressy pants with camp collar shirts. Any recommendations and flexible dress pants for those of us with bigger legs/behinds? I only fit into 541 Levi's and other athletic fit pants normally. Thank you.",
            "https://preview.redd.it/j4unl8mnx08d1.png?width=3024&format=png&auto=webp&s=cb3be75537319522139c5aec90c24970e196d226\n\nHey, not sure if it’s the right place to ask. I know Gianni Campagna was a famous Italian suit designer, I just bought these shoes on a thrift store and am not sure if he ever designed any shoes at all. Can’t find any pair with his brand online. Just curious really because they look great. Not looking to sell or anything.",
            "https://preview.redd.it/xgiunbhnvy7d1.png?width=290&format=png&auto=webp&s=6b38638af090b7196873b6da0b320a4d1737c4ab\n\nWhere can I get a cloak like this?",
            "A couple of ID/recommendation requests. Can anybody recommend any linen pants like these? https://ibb.co/YfsrWj4. I really dislike the look of most linen pants I see. \n\nDoes anybody know what jacket the man on the left is wearing here? https://ibb.co/3FqmQyR",
            "How is Pull and Bear as a brand? [These](https://www.pullandbear.com/es/pantalon-jogger-cargo-basico-l08678503?cS=809) look comfortable.",
            "[removed]",
            "# What would you match these with? What pants/shorts and shirt/t-shirt, and most of all what colors?\n\n\n\nhttps://preview.redd.it/p2dfrw80ty7d1.png?width=802&format=png&auto=webp&s=731763af4900b314722292e68d62e267f60f524b",
            "Where to start? Wanting to learn to dress better\n\nHello, male 26 from the US. I've never really focused too much on my fashion or clothes in the past. I just put on whatever I think looks good and hope for the best. Don't really understand style, color, fit or anything else related to fashion. I want to start looking good and having proper outfits, not just clothing ite s I put together. I want to dress better for work (office job) and when going out with friends.  Any advice? Where do I start and learn more about fashion and clothing? Any advice is greatly appreciated.",
            "I tried a bunch of glasses on the eye doctor.\n\nThe one that seemed to work the best for me was the Lool SWITCH BKOG Black (https://www.eye-oo.com/en-us/products/lool-switch-bkog-black#).\n\nThey are somewhere in the middle between square and round, which I like. Full rim. The frames are also not too thick and not too thin. Most of the ones I'm finding are either way too bulky or wire thin.\n\nThe main thing that I don't like about them is the price and the wire thin pieces that go over the ears.\n\nAny help finding something similar, with better over ear pieces, would be greatly appreciated."
        ]
    },
    "WAYWT (What Are You Wearing This Week?) - 19 June 2024": {
        "title": "WAYWT (What Are You Wearing This Week?) - 19 June 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/malefashionadvice/comments/1djiln6/waywt_what_are_you_wearing_this_week_19_june_2024/",
        "content": "WAYWT = What Are You Wearing This Week (or a different day, whatever).\n\nThink of this as your chance to share your outfits with the community 🧍📷\n\nPeople enjoy knowing where you bought your pieces, so consider putting them in your comment📝\n\n**How to take better pictures** \n\n* Try to use natural sunlight ☀️\n* Use simple backgrounds ⬜\n\nWant to know more tips and tricks? Read the guide [here](http://www.reddit.com/r/malefashionadvice/comments/16rwft/how_to_take_better_self_pics_for_mfa/).\n\n**How to add a picture to your Reddit comment:**\n\n* You can upload on the [Reddit app and website](https://reddit.zendesk.com/hc/en-us/articles/10516331142932-How-do-I-add-images-in-comments-) \n* Or upload your picture to [Imgur.com](https://imgur.com/upload) and copy/paste the link into your Reddit comment. \n\n**Important: Downvotes are strongly discouraged in this thread ❌**",
        "num_comments": 8,
        "comments": [
            "https://preview.redd.it/2kdw8o0hzr7d1.jpeg?width=1125&format=pjpg&auto=webp&s=eb74021a0f0fadd40d8f91684703974b27ca3e0e\n\nMata Nui after Makuta Teridax took over his body and flew back to Bara Magna to finish the job",
            "https://preview.redd.it/9wszf3altj7d1.jpeg?width=1170&format=pjpg&auto=webp&s=a0b38bd3f920c8e64ba09bdcf5a3bfb5632492a8\n\nJust purchased this sports coat for an event this weekend. Any suggestions for shirt pairing? Was thinking solid color since the coat already stands out. Maybe a light blue? Open to suggestions. Thought great slacks would look good.",
            "[https://assets.skool.com/f/dc483cb4b9ed4236b442301fc284c180/d2a8ba14e2ea402aa2562f9a1dfb61314d50f5f6dd3e4bda92e6cdae3a083834-md.jpg](https://assets.skool.com/f/dc483cb4b9ed4236b442301fc284c180/d2a8ba14e2ea402aa2562f9a1dfb61314d50f5f6dd3e4bda92e6cdae3a083834-md.jpg)\n\n[https://assets.skool.com/f/dc483cb4b9ed4236b442301fc284c180/72705eee142d4b7d924a85b3e72ff1b1521aa6694e794c00afca632aef03f7ef-md.jpg](https://assets.skool.com/f/dc483cb4b9ed4236b442301fc284c180/72705eee142d4b7d924a85b3e72ff1b1521aa6694e794c00afca632aef03f7ef-md.jpg)\n\n[https://assets.skool.com/f/dc483cb4b9ed4236b442301fc284c180/d2d7d93ed6004926bab7cf2008a4a6bb3f98d683c3c54ad6957f491d6dd53150-md.png](https://assets.skool.com/f/dc483cb4b9ed4236b442301fc284c180/d2d7d93ed6004926bab7cf2008a4a6bb3f98d683c3c54ad6957f491d6dd53150-md.png)",
            "I’m looking to style a summer outfit with some jeans, army style cargo pants or shorts, t-shirt or any light top, belt, shoes, and socks. I’m trying to go for classic 50s look. Need help with suggestions and which site to use - in hopes that it would be a one stop shop.\n\nSo far I’m working with just 1 pair of denim - Fullcount 0105xx wide fit, and for shoes - paraboot Michael’s and that’s it.\n\nI’ve heard amazing things about Whitesville, Warehouse, and Real McCoys t-shirts! Unfortunately, not all websites Cary them all and hardly any have them in stock. Same goes for cargo pants- I’ve heard the Real McCoys OG 107, and the Buzz Ricksons Poplin trouser or orSlow have great army style green pants! Any thoughts on these? Unfortunately the Real McCoys is sold out in my size -34 to my knowledge. The Buzz Ricksons I don’t know how I feel about the Ties on the bottom of the pants in case I may need to roll them up due to length being an issue.\n\nWhat belt would you recommend for both denim jeans and the cargo pants?\n\nWhat about socks?\n\nWhat about some vintage looking shorts?\n\nShoes? I’ve heard PRAS and Pottery are awesome! Any others? Hopefully they don’t look and feel like a basic Chuck Taylor’s.\n\nMaybe a backup denim pair to be different than my Fullcount 0105xx?\n\nAny other T-shirts you recommend other than the ones I mentioned above?\n\nAny other piece of garnet im missing?",
            "I'm looking for the best men's body spray brand that keeps you smelling nice and fresh, controls sweat all day long, and also offers an underarm roller?",
            "A blue, a pink, or a purple will all complement this jacket.  You can also try neutrals like a brown. For something more risky you can try a mustard yellow. \n\nIf you’re keeping it informal, keep it unbuttoned at the top. But wearing a tie can add another color to round out the outfit and elevate the look. Depends on the event.",
            ">Any other piece of garnet im missing?\n\nReading glasses? This is in the wrong thread."
        ]
    },
    "Why are mens shorts designed with pockets so shallow your phone wallet and keys fall out?": {
        "title": "Why are mens shorts designed with pockets so shallow your phone wallet and keys fall out?",
        "score": 125,
        "url": "https://www.reddit.com/r/malefashionadvice/comments/1dlntb0/why_are_mens_shorts_designed_with_pockets_so/",
        "content": "\"What can fall out, will fall out.\" Why are pants allowed to have good secure pockets but not shorts?\n\nPants go to the ankle, shorts go to the knee so why the heck do the pockets on shorts have to be made so your phone especially falls out so easily ? The pockets on shorts should be just like pants.\n\nSmartphones, which are mobile phones with advanced computing capabilities and connectivity beyond basic voice calls and text messaging, began to gain popularity in the early 2000s.\n\nBut even flip phones fell out of the stupid pockets they put in shorts.\n\nThis has been going on for 30 years now.\n\nWhy when the stupid shallow pocket design on men's shorts is universally hated and everyone carries a phone now why won't they change it?",
        "num_comments": 91,
        "comments": [
            "A lot of people ask, \"Why? Why would you treat the customer this way?\" Why? Because fuck 'em, that's why!",
            "Are you wearing hotpants?",
            "I think we can flip this question around. why are you buying shorts with shallow pockets?",
            "You bought it brother.",
            "All my shorts have been find and this is the first I've heard of this. What kind of shorts are you wearing?",
            "Are you wearing women’s shorts?",
            "I haven't really had issues with shorts tbh",
            "Just wait till you see women’s pockets..  can’t even for chapstick in those",
            "The only short I came across this issue is like legit running shorts. Not gym shorts but daddy hoochie 2 inch inseam running shorts.\n\nAre you using an iPad mini as a phone?",
            "Massive conspiracy by the Big Purse lobby, trying to make man bags a thing for the extra billions in revenue"
        ]
    },
    "➡️ Daily Questions ⬅️- Post simple questions such as Outfit Feedback, Clothes ID, and Recommendation requests here!! - 20 June 2024": {
        "title": "➡️ Daily Questions ⬅️- Post simple questions such as Outfit Feedback, Clothes ID, and Recommendation requests here!! - 20 June 2024",
        "score": 20,
        "url": "https://www.reddit.com/r/malefashionadvice/comments/1dkf87c/daily_questions_post_simple_questions_such_as/",
        "content": "Welcome to the Daily Questions thread for all things related to men's fashion.\n\n**Types of questions this thread is great for:**\n\n* Clothing or footwear recommendations 👞\n* Outfit feedback and advice 🧥\n* ID'ing clothes from pictures or screenshots 🖼️\n\n**Want a more helpful answer?**\n\nThe more information you give, the better response you'll get. Try including:\n\n* Budget in numbers 💲 and location 🌍\n* A screenshot of any clothes from a video 🖼️\n\n**How to add a picture to your Reddit comment:**\n\n* You can upload on the [Reddit app and website](https://reddit.zendesk.com/hc/en-us/articles/10516331142932-How-do-I-add-images-in-comments-)\n\n[add images to your comment on Reddit's app and website by clicking the add-image button](https://preview.redd.it/et77qtnc6wpa1.png?width=1161&format=png&auto=webp&s=e6965cbf5d04bd279b3b8673c5472b90a9f0785d)\n\n* Or upload your picture to [Imgur.com](https://imgur.com/upload) and copy/paste the link into your Reddit comment.\n\nIf you're looking for more in-depth information then check out our [style guides](https://www.reddit.com/r/malefashionadvice/wiki/guides) 🛍️, [item guides](https://www.reddit.com/r/malefashionadvice/wiki/itemguides) 👔 and [recommendation threads](https://www.reddit.com/r/malefashionadvice/wiki/itemguides#wiki_item_suggestions_at_each_price_point) 📄.\n\n# The [MFA Discord](http://discord.gg/malefashionadvice) is also open for questions in the [\\#questions-and-advice](https://discord.com/channels/1116793467654381685/1116794518415622154) channel!",
        "num_comments": 106,
        "comments": [
            "I'm going to an ocean-side wedding this August and I plan to wear a sage green linen suit. It will be a new color/material for me and I'm looking for suggestions on shoes that will pair well (light brown? white? loafers?). I'll probably pick a shirt that is white/oatmeal/tan.\n\nI don't think this is rocket science but It's a departure from the suits I wear a few times per year for work (shade of blue wool). \n\nAny suggestions/considerations would be appreciated.\n\nI believe this is the jacket of the suit I've ordered:\n\n[https://www.menswearhouse.com/p/tommy-hilfiger-modern-fit-suit-separates-linen-jacket-tmw-3ygt?CAWELAID=120259610001914221&adtype=pla&product\\_channel=online&product\\_click\\_id=TMW3YGT43335&store\\_code\\_id=&gad\\_source=1&gclid=CjwKCAjwps-zBhAiEiwALwsVYfqwX8OsAl8vIMIbebKyGnelSbiuI8DKTmwZ\\_0k8avR37PyNAGq\\_GBoCAX8QAvD\\_BwE#color=sage%26size=43%26length=long%26](https://www.menswearhouse.com/p/tommy-hilfiger-modern-fit-suit-separates-linen-jacket-tmw-3ygt?CAWELAID=120259610001914221&adtype=pla&product_channel=online&product_click_id=TMW3YGT43335&store_code_id=&gad_source=1&gclid=CjwKCAjwps-zBhAiEiwALwsVYfqwX8OsAl8vIMIbebKyGnelSbiuI8DKTmwZ_0k8avR37PyNAGq_GBoCAX8QAvD_BwE#color=sage%26size=43%26length=long%26)",
            "https://preview.redd.it/67avp8bm6r7d1.jpeg?width=1000&format=pjpg&auto=webp&s=3193a5ad214575d2442dc93d652145739d864e39\n\nID on this exact boot??",
            "Kind of in a pinch for a work event next week. I kind of wrecked my good blazer this week and the only thing I have is a suit jacket but the pants haven’t been hemmed yet so I have to wear it with other pants. I would think most people can’t tell the difference between a blazer and a suit jacket, right? \n\nYeah I know, I need more blazers and it’s on the list just haven’t gotten around to it.",
            "Hey!\n\nI want to simplify my wardrobe and looking to replace all my t shirts to one single color and make it a capsule wardrobe. I’m down to navy, charcoal and white, which t-shirt color looks best on me? Thanks!",
            "Yo how do you lads dress shirts? I live in Canada and feel like I can layer well and dress for pants consistently but shorts I always feel like I look goofy or the same fit just works better with pants but I get way to hot so I need to wear shorts in the summer. How do y'all put fits together ?\n\nMind you I'm a slightly larger guy I wear a large to XL t-shirt and wear a 34-34 pant",
            "I am looking for comfy/bouncy shoes that are smart enough to wear with, say, cords and a jacket for academic smart casual style. I currently wear running shoes as they are lightweight and bouncy and help with a long-term problem with my leg by reducing the impact of my feet on the ground. I guess the EVA midsole helps that. But I'm not sure where to look for something smart enough that is also comfy and bouncy and reduces impact. Any recommendations welcome!",
            "https://preview.redd.it/e3gddy42dr7d1.jpeg?width=620&format=pjpg&auto=webp&s=737d71e1173df2b0552e7a4f7ee331a8520a27e8\n\nCan anyone help me identify the shoes Timothee is wearing in this Vanity Fair video for Dune 2? Thank you in advance!",
            "I have heard so much online about rules and etiquette of buttoning a sport coat, you know that way it goes, top button closed when standing, unbuttoned when sitting, a man standing in an unbuttoned spot coat looks like slob, the silhouette of a walrus yada yada yada\n\nI saw this link posted here earlier [https://thesecondbutton.com/sneakers-with-tailoring/](https://thesecondbutton.com/sneakers-with-tailoring/) over 90% of the images have guys are wearing either jackets or sport coats unbuttoned, and they look great.\n\nI'm aware that the style is casual not tailored but still. I feel like I have been gaslit into feeling self conscious if my jacket is momentarily open. Am I on my own here?",
            "Outerknown Utilitarian Pant vs their Field Pant. What’s the difference?",
            "I'm looking for recommendations for a sub-$300 lightweight down jacket.  I'm planning a trip to Japan in January and half of my trip will be spent in Hokkaido, the other half in Tokyo.  I will probably need a very warm jacket for Hokkaido but Tokyo doesn't get as cold as where I currently live at that time.  I want something I can pack away, won't take up too much room, is versatile, and is very warm.\n\nI was kind of thinking about the Reigning Champ Taffeta Warm-up jacket, but I'm curious if there are others."
        ]
    },
    "‘Tech guys are hot, actually’: Nerds are seeking fashion glow-ups": {
        "title": "‘Tech guys are hot, actually’: Nerds are seeking fashion glow-ups",
        "score": 0,
        "url": "https://sfstandard.com/2024/06/17/fashion-zuckerberg-style-techie-hoodie-allbirds/",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Speaking as somebody in tech, they’re mostly not lol\n\nThere’s definitely a subset of tech bros that embrace fashion but for the most part it’s the stereotypical guy who only wears clothes he’s gotten for free from the numerous startups he’s been at",
            "We have a guy at work that occasionally wears black sneakers, tuxedo pants with a button up and a black suit jacket. What kind of style is that?",
            "lol yep here’s my theory: my company gives me a TON of free swag shirts and hoodies. It’s really bad because it doesn’t incentivize me actually go out and buy stuff for myself, made even worse my closet is already full.",
            "One of the pics in that article is a before and after that literally is just “she put him in a plaid button up with matching sneakers” and I think that’s an incredibly funny bar to set",
            "I’ve got like 30 shirts from my company but I only wear them to sleep or the gym. They’re not exactly cool and I don’t particularly like advertising for a corporation. But I’m hardly a paragon of MFA either. I mostly just wear practical and comfortable stuff since I work from home. Uniqlo, Lululemon and the like. I used to put a lot of effort into how I dressed when I was single and college aged, but now I just want to be comfortable and not have to think about anything too much. Maybe the result of getting older and devoting what little time I have to other hobbies.",
            "Yeah I think what happens is the tech guys that embrace it are also more likely to step out into other social circles. So those are the tech guys that most other people may be familiar with",
            "Yup. Got a buddy who’s an L5 that wore nothing but his startup shirts until he met a girl that dressed him up.",
            "I've been in tech for 20 years and actually find people dress normally, maybe it's a europe thing",
            "Yeah agreed. There's a lot of people actually fulfilling the neckbeard basement dweller stereotype.",
            "Does he live in the sewers of Gotham and eat raw fish?"
        ]
    }
}