{
    "➡️ Daily Questions ⬅️- Post simple questions such as Outfit Feedback, Clothes ID, and Recommendation requests here!! - 28 June 2024": {
        "title": "➡️ Daily Questions ⬅️- Post simple questions such as Outfit Feedback, Clothes ID, and Recommendation requests here!! - 28 June 2024",
        "score": 12,
        "url": "https://www.reddit.com/r/malefashionadvice/comments/1dqn5h0/daily_questions_post_simple_questions_such_as/",
        "content": "Welcome to the Daily Questions thread for all things related to men's fashion.\n\n**Types of questions this thread is great for:**\n\n* Clothing or footwear recommendations 👞\n* Outfit feedback and advice 🧥\n* ID'ing clothes from pictures or screenshots 🖼️\n\n**Want a more helpful answer?**\n\nThe more information you give, the better response you'll get. Try including:\n\n* Budget in numbers 💲 and location 🌍\n* A screenshot of any clothes from a video 🖼️\n\n**How to add a picture to your Reddit comment:**\n\n* You can upload on the [Reddit app and website](https://reddit.zendesk.com/hc/en-us/articles/10516331142932-How-do-I-add-images-in-comments-)\n\n[add images to your comment on Reddit's app and website by clicking the add-image button](https://preview.redd.it/et77qtnc6wpa1.png?width=1161&format=png&auto=webp&s=e6965cbf5d04bd279b3b8673c5472b90a9f0785d)\n\n* Or upload your picture to [Imgur.com](https://imgur.com/upload) and copy/paste the link into your Reddit comment.\n\nIf you're looking for more in-depth information then check out our [style guides](https://www.reddit.com/r/malefashionadvice/wiki/guides) 🛍️, [item guides](https://www.reddit.com/r/malefashionadvice/wiki/itemguides) 👔 and [recommendation threads](https://www.reddit.com/r/malefashionadvice/wiki/itemguides#wiki_item_suggestions_at_each_price_point) 📄.\n\n# The [MFA Discord](http://discord.gg/malefashionadvice) is also open for questions in the [\\#questions-and-advice](https://discord.com/channels/1116793467654381685/1116794518415622154) channel!",
        "num_comments": 50,
        "comments": [
            "I am looking to buy some pants. Could someone please describe to me the different types of pants and materials? Are jeans the most casual? What's above jeans? Any color and brand recommendations would be great too! Thank you!",
            "Anyone's got any recommendations for cheap polarized sunglasses available to buy online in a European store?",
            "So as someone who grew up in a conservative small town, fashion and personal style has never been something that I've been surrounded by for a lot of my life. But since I started going to university in a big city, I have been pretty in awe of how so many people use fashion as a way of expressing themselves. I've always wanted to express myself through fashion but don't have any clue of where to begin with that. Like I want to dress more out there, accessorise more, etc but I don't know how to start.\n\nAnyone have any advice, even if it's just small ways of finding personal expression?",
            "So generally, when people say they want to elevate their style (as is the case with me, for example) I assume they mean something more than, like a graphic t-shirt and jeans. Is there anything specifically unfashionable about that? If, say you got a nice souvenir t-shirt from vacation, would you not be able to throw that on with a pair of jeans and call it a style? On a semi-related note, are there any graphic tees that would not pair well with a button down/overshirt?",
            "Need some advice on birthday dinner outfit. Based in Dallas so something cool and breathable is a must right now, with that in mind I picked up a off-white Tommy Bahama linen shirt, but can’t make a decision as to what kind of slacks to wear with it. Was planning on some low top brown leather sneakers as well. Also I am a fairly large guy in stature so nothing with a skinny fit 🤣 any advice is appreciated 😄",
            "First time poster here. I’m in my late 20s and about to start my first high school teaching job. Problem now is idk what would be good to wear (what’s too formal/casual) and need advice on what to buy to expand my small wardrobe. I do like polos more than button downs if that helps for the advice.",
            "I'm looking for some help for a gift for my partner - I recently saw him wrapped up in a big fuzzy blanket and he looked stunning - so I decided I would love to get him a coat with a big fluffy collar as a gift. He's a low effort guy and has had the same coat for at least a decade, so it doesnt have to be ridiculously fancy - but we *do* live in Montana so it has to be decently insulated, or else hell never wear it and then theres no point. However, I'm having trouble finding anything that looks like what I'm thinking - regardless of budget- outside of a few websites with sketchy reputations.\n\nI'm gonna put a link with a screenshot of three of the best looking ones I've found - though only the green one has a reputation I'd consider taking a risk on - and budget wise, I cant trust any winter coat that isnt at least a hundred or two. Otherwise I'm just kind of trying to get a feel for what I'm looking at - if it turns out anything in this style is going to be four or more digits I can temper my schemes accordingly, but I'm just not having much luck finding anything legitimate to really get a sense of it.",
            "It’s hard to find good shoes because of my foot size. Anyone have good shoe recommendations for things beyond sneakers that offer size 4?",
            "Are Stan Smith's and CDBs still in style in 2024? Do they look good with Levi's 501s or are they too slim?",
            "Those hi-top chukkas are based on the Sanders Playboy version made popular by Steve McQueen and worn recently by Daniel Craig as James Bond. So you can get something similar from them."
        ]
    },
    "WAYWT (What Are You Wearing This Week?) - 26 June 2024": {
        "title": "WAYWT (What Are You Wearing This Week?) - 26 June 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/malefashionadvice/comments/1doy1x9/waywt_what_are_you_wearing_this_week_26_june_2024/",
        "content": "WAYWT = What Are You Wearing This Week (or a different day, whatever).\n\nThink of this as your chance to share your outfits with the community 🧍📷\n\nPeople enjoy knowing where you bought your pieces, so consider putting them in your comment📝\n\n**How to take better pictures** \n\n* Try to use natural sunlight ☀️\n* Use simple backgrounds ⬜\n\nWant to know more tips and tricks? Read the guide [here](http://www.reddit.com/r/malefashionadvice/comments/16rwft/how_to_take_better_self_pics_for_mfa/).\n\n**How to add a picture to your Reddit comment:**\n\n* You can upload on the [Reddit app and website](https://reddit.zendesk.com/hc/en-us/articles/10516331142932-How-do-I-add-images-in-comments-) \n* Or upload your picture to [Imgur.com](https://imgur.com/upload) and copy/paste the link into your Reddit comment. \n\n**Important: Downvotes are strongly discouraged in this thread ❌**",
        "num_comments": 6,
        "comments": [
            "Looks great and fits you well! I'd love to wear something like that for a casual day out. The heat this time of year is truly a travesty for us fashion lovers :(",
            "https://preview.redd.it/d7jl5n6mf79d1.jpeg?width=3000&format=pjpg&auto=webp&s=73c2404ec033dd6faa1930ae89cbc2e4d8ae28de\n\nSomething a little different for me...",
            "https://preview.redd.it/atuhz3pc6c9d1.png?width=720&format=pjpg&auto=webp&s=23cc91731f89e22ea62b0bf1034da410cc223344\n\nGot a new blazer today. Would love to know what you guys think!",
            "Does anyone have recs on safety/steel toe shoes that are more for office wear with khakis/jeans and a polo?\n\nSomething like [this](https://www.dsw.com/product/florsheim-crossover-steel-toe-work-oxford/526167?activeColor=201&cm_mmc=CSE-_-GPS-_-G_Shopping_Evening_Wedding-_-New_Evening_Wedding&cadevice=m&gad_source=1&gclid=CjwKCAjwm_SzBhAsEiwAXE2Cv73AEvYaugQhuFFA2SXUwNWaIxc9kgB5CvBeZMSxa13pz1VdvGi9jhoCHmkQAvD_BwE&gclsrc=aw.ds) perhaps?",
            "https://preview.redd.it/k4x0hln7xx8d1.png?width=1080&format=pjpg&auto=webp&s=70087bf9a5d1c1772f2aa82e090255b855dede61\n\nToo hot for this week, but can I get a fit check on the suede jacket?",
            "https://preview.redd.it/ye52moccxx8d1.png?width=1080&format=pjpg&auto=webp&s=629a66c8c5658bdc15a040806ee2730d69a83404\n\nSide profile"
        ]
    },
    "Weight loss and sizing": {
        "title": "Weight loss and sizing",
        "score": 10,
        "url": "https://www.reddit.com/r/malefashionadvice/comments/1dqxyjp/weight_loss_and_sizing/",
        "content": "Over the last two years, I've gone from 280 lbs to 205, and my jacket size has gone from 48 to 42. I've bought a few suits during that time, because I need them for work, but I've been waiting to get to a more-or-less permanent weight before trying to put a wardrobe back together.  \n\nA local upscale store has a couple of Canali suits on sale. The jackets fit me well. The pants fit well enough to be tailored to fit; they were snug in the hips and thighs, but my hips and thighs are a little bigger than spec for my frame.  \n\nI might, optimistically, lose another 20 lbs. What's the chance that going from 205 to 185 ruins the fit of a suit? Taking the pants in, or the waist of the jacket, is no big deal, but if I go down to a size 40 and the jackets don't fit in the shoulders, I'll be sorry. On the other hand, if I stay as a size 42, I may be sorry I didn't jump at the on-sale suits when I had the chance.  \n\nHas anyone been through this before? How much weight equates to moving a size up or down? For men with big hips and thighs, what suit brands work well?\n\n",
        "num_comments": 6,
        "comments": [
            "Sometimes, you might go down another size.  If you are worried about it, just buy one suit. Your shoulders can loosen more as you lose more weight and jackets aren't cheap to tailor.",
            "I recently lost 15 pounds, went from 197 to 182, and wear a 42 short suit size.  Although, I can tell that the 42 size is starting to fit a little loose, it’s still not too obvious where the jacket needs to be re tailored.  It has in fact motived me to continue working out to lose a couple more pounds.  The suit is the last thing on my mind.  I only wear Brooks Brothers suits for context.  Brother, keep doing you and good luck!",
            "The cost of food for maintaining a weight 20 lbs extra weight as well as long term medical expenses will be more expensive than any suit.  Keep up the good work.",
            "I weigh 30lbs less than you and wear a 42 jacket. I think there should be wiggle room.",
            "Depends how you’re losing the weight…i fluctuate by about 20 lbs between summer and winter but do it on purpose basically bulking and cutting. \n\nIf you’re lifting weights and keeping protein up generally your shoulders won’t fluctuate much but your waist will. I get my jackets tailored at my heavier weight and get two pairs of pants, one size down and my current size at the time\n\nI would say don’t plan for weight you’re going to lose until you’ve lost it, just get a suit that fits and a second pair of pants you can bring in if needed…fluctuation is pretty normal for most people",
            "It’s roughly 20-25 pounds per suit jacket size, but it’s really difficult to predict ahead of time where the weight will come off. I started wearing smaller shoes and had to resize my wedding ring after weight loss, because apparently I was storing fat in my feet and fingers. So for a suit, where ideally you have accurate shoulder, chest and waist measurements, you can’t really know what your new measurements will be after losing X amount of weight.\n\nDon’t buy any suits until your weight is stable. I bought a new suit for a wedding after losing 25 pounds, thinking I was approaching a stable weight, and went on to lose another 25 pounds. I wound up only wearing that suit once.\n\nI recommend just wearing the suits a little big until you’ve plateaued and maintained your weight for 2-3 months."
        ]
    },
    "Date Outfit Advice": {
        "title": "Date Outfit Advice",
        "score": 1,
        "url": "https://www.reddit.com/r/malefashionadvice/comments/1dqpn7n/date_outfit_advice/",
        "content": "Hello everyone, I am a 24M and needing some fashion advice. Lately I have had some extra time and have been putting effort into updating my wardrobe. I have been wanting to add some clothing for dates with woman, but have some questions on things.\n\nFirstly, I have heard that button up / button down shirts are a very popular and safe choice for dinner dates. However, what kind of button up / button down shirts are acceptable? Dress shirts? Oxfords? Button down Collars? Linen Shirts? I'd most likely wear dark jeans or chinos for my bottoms.\n\nSecondly, do guys ever wear dress shirts on dates? Can they be worn without ties? Can they be worn with dark jeans? Can they be used casually or only in a very formal environment? Also would the type of shirt collar matter if the top button or two were left unbuttoned?\n\nThank you to anyone who has any input on any of these questions! I am not too good when it comes to fashion and any help would go a long way!",
        "num_comments": 1,
        "comments": [
            "Biggest advice is you don’t want to outdress your date in terms of formality. Your clothing should match what you’re doing and the culture or style where you live. If you’re going to a cafe, a casual button down, or nice shirt, jeans, khakis, clean sneakers make a good outfit. Look neat and put together but don’t overdress. If you’re going out for drinks or dinner or activities like a show, dressing up your shoes and wearing a nicer shirt would be appropriate, you generally can’t go wrong with a nice pair of black or khaki pants that fit you well, and a long or short sleeve button down shirt depending on the season. The shirts without the tie buttons on the collar will look more relaxed when worn without a tie. For basics, non-white socks, and pick up some v-neck undershirts to wear beneath your button downs."
        ]
    },
    "➡️ Daily Questions ⬅️- Post simple questions such as Outfit Feedback, Clothes ID, and Recommendation requests here!! - 27 June 2024": {
        "title": "➡️ Daily Questions ⬅️- Post simple questions such as Outfit Feedback, Clothes ID, and Recommendation requests here!! - 27 June 2024",
        "score": 11,
        "url": "https://www.reddit.com/r/malefashionadvice/comments/1dputhe/daily_questions_post_simple_questions_such_as/",
        "content": "Welcome to the Daily Questions thread for all things related to men's fashion.\n\n**Types of questions this thread is great for:**\n\n* Clothing or footwear recommendations 👞\n* Outfit feedback and advice 🧥\n* ID'ing clothes from pictures or screenshots 🖼️\n\n**Want a more helpful answer?**\n\nThe more information you give, the better response you'll get. Try including:\n\n* Budget in numbers 💲 and location 🌍\n* A screenshot of any clothes from a video 🖼️\n\n**How to add a picture to your Reddit comment:**\n\n* You can upload on the [Reddit app and website](https://reddit.zendesk.com/hc/en-us/articles/10516331142932-How-do-I-add-images-in-comments-)\n\n[add images to your comment on Reddit's app and website by clicking the add-image button](https://preview.redd.it/et77qtnc6wpa1.png?width=1161&format=png&auto=webp&s=e6965cbf5d04bd279b3b8673c5472b90a9f0785d)\n\n* Or upload your picture to [Imgur.com](https://imgur.com/upload) and copy/paste the link into your Reddit comment.\n\nIf you're looking for more in-depth information then check out our [style guides](https://www.reddit.com/r/malefashionadvice/wiki/guides) 🛍️, [item guides](https://www.reddit.com/r/malefashionadvice/wiki/itemguides) 👔 and [recommendation threads](https://www.reddit.com/r/malefashionadvice/wiki/itemguides#wiki_item_suggestions_at_each_price_point) 📄.\n\n# The [MFA Discord](http://discord.gg/malefashionadvice) is also open for questions in the [\\#questions-and-advice](https://discord.com/channels/1116793467654381685/1116794518415622154) channel!",
        "num_comments": 42,
        "comments": [
            "I need help with t-shirts. I can’t find any that fit. For reference, J. Crew’s slim fit broken-in tee is a little too big in large, but definitely too small and short in medium. Note: my t-shirts go in the dryer. Any advice?",
            "Sorry I'm new to all this - tried to individually post my question but looks like it got filtered out, I suppose this is where it should go. I'm looking for an affordable (but not the cheapest) black suit. I understand the controversy surrounding black suits, but I'm obliged to buy my first one as part of an upcoming wedding party. I'm not looking to break the bank for this suit given that I won't be wearing it frequently, but I figure I shouldn't buy the cheapest possible black suit either as I will have use for it in the future for funerals, etc. Ideally I wouldn't need to spend more than a few hundred dollars but I'm open to increasing the budget if it'd be worth it. I have time to get an off-the-rack suit tailored if that would be the recommended course of action, though would appreciate guidance on that as my prior suits have all been tailored at the stores where I bought them (I've never had to search out a tailor myself). I'm located in Boston if there are any local suit shops, tailors, etc. that are recommended. Thanks in advance!",
            "Loose fit jean recommendations? Not y2k loose but also not the usual loose fit jeans because those are too skinny for me. Preferably under $35.",
            "Looking on recommendations for pants. Either jeans or chinos. Black preferably, and can be versatile on what to wear it with. Just need a basic pair of pants that I can wear anything with. I’m 5 foot 11, have thick thighs. Based in Australia.\n\nThank you!",
            "Where can I find Raglan longsleeves/ Baseball t shirt 3/4 sleeves? More for gym setting  \n  \nIve always loved the look of these shirts especially in a gym setting aswell as just casual everyday where. Where can I find good ones? Obviously I can just get the blank ones from amazon or whatever but theyre not fitted well and are just baggy. Any ideas?",
            "Need a good pair of joggers. I usually wear selvedge denim jeans but I have a medical problem, I have psoriasis below the waist really bad and in the summer months jeans irritates me (I don’t like shorts). I tired lululemon but they are too athletic for me. My style is jeans and tshirt. I am a musician and I give off a rocker dress vibe. Maybe under $150 or $200.",
            "Shoes are fine. Could do a leather derby also",
            "Go to Keezers in Cambridge.  They have hundreds and hundreds of used suits and an onsite tailor. It’s not a thrift store.  It’s a used clothing store so prices are significantly higher than say goodwill but you will get something decent.  I don’t love the prices of their shoes though. \n\nIf that won’t work for whatever reason, try Macys Bar III. Make sure there’s a sale or available coupon (there almost always is).  Prices have crept up over the years so  it’s not a great value it once was but it will look the part.",
            "Rental might also be worth considering. Was in a similar position for a wedding and already had navy / charcoal suits that I wear every few months. $140 for the rental (a company like “The Black Tux” has decent half canvased options) was more appealing than $300-400 on a bottom of the barrel suit I’d never wear again anyway.",
            "I‘d probably head to SuitSupply. They are not the cheapest but won’t break you bank (hopefully) and they have an in-store tailor for alterations.\n\nThey will also have sufficient quality clothes to last you for a few years."
        ]
    }
}