{
    "Fine dining. Here is your side of ketchup.": {
        "title": "Fine dining. Here is your side of ketchup.",
        "score": 501,
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1dlmkny/fine_dining_here_is_your_side_of_ketchup/",
        "content": "Very minor and petty but funny.  \nWorking at a super fancy high-end restaurant in fine dining, the level of communication between the front-end staff (bartenders, servers, assistants, food runners, etc) is incredible. We want everything that is needed to come to the table at the same time, and we don't want to ask a guest the same question twice.\n\nFor example with beverages, if a table is drinking all kinds of various beverages and you happen to walk by and notice one is low, the correct course of action is actually to not go up to the guest to ask if they'd like another because at that point you don't know what they're having. The guest has already told the establishment what they're having so going up and saying \"what did you have again\" detracts from the experience. I know this seems minor but the correct course is to find the assistant, or the server, or pull up the table in the POS and see, so that when you do go up and ask the correct questions, \"would you like another Old Fashioned with extra <blah blah blah>\" or whatever, specifically naming the drink and modifications.\n\nThe same can happen even for a side of ketchup or aioli. The basic process will be, \"was it supposed to come with it and kitchen/expo forgot to put in on the plate?\", or, \"did the guest ask for it and the server forgot to add it in there\", or, \"did the guest just decide to order it later and we just need it asap\".\n\nNormally when the food is dropped off the person in charge is supposed to ask if everything looks okay and if they can bring anything else.\n\nEnter our guest Bob.\n\nBob has already been asking for his water and tea to be refilled when it was still above the threshold for us noticing it (when it was like 70-80% full), and would flag down multiple people until it got refilled. No big deal, one assistant would grab a pitcher and refill, while another assistant would grab another pitcher and see that the glass was full and just walk away. Same thing for lemons. This became annoying.\n\nBob sees his steak and fries which came with an aioli (as shown on the menu) but he wants ketchup. No big deal. Small request. He asks the person dropping off the food. It is communicated and noted and will be out shortly. Next, the assistant comes to offer beverage refills. Bob asks for ketchup. It is noted. Next, the server does a visual quality check and Bob asks for ketchup. You can see where this is going. This all happens in less than 2 minutes if that long. Bob ended up asking 4 separate people for ketchup, and given the urgency of bringing out a side after food has arrived, all 4 people end up congregating in the service area to put tiny little porcelain ketchup pour cups onto silver serving dishes. Now each one of those cups is designed to be shared by 2 people. So, the conversation begins,\n\n* Food runner: hey, what are you guys up to? I'm grabbing that ketchup for Table 12 Seat 2\n* Server Assistant: oh, that's funny, I was also going to grab a ketchup for #12 seat 2\n* Server: funny, they asked me for it too and I was running over here to grab it\n* Another server: oh hey I got flagged down by Table 12 to grab a ketchup\n\nso.... enough is enough.. the guy clearly wants ketchup....\n\nWe decided all of us would give the guest exactly he asked for. So, in all glory, all 4 of us come back out with our silver serving trays and everything, one at a time, each giant silver serving tray holding just a single side of ketchup, dropping off 4 separate ketchup dishes, 15 seconds apart. Bob realized what he did once he got enough ketchup for 8 people. We left all the ketchups just sitting there throughout the entree course. Of course this was not unnoticed by other guests who very humorously asked funny questions and if that's how Bob eats his steak. We made sure that the ketchups were the very last things off the table before it was time for dessert. He barely used a single one.\n\nAt the end of the day Bob did not leave hungry, the guests were not un-entertained, and neither were we.\n\nTLDR; guy asked 4 separate people for ketchup, all 4 people brought out a side of ketchup, one after another. Bob got 8 people's worth of ketchup.\n\n\\[edit\\] grammar, details",
        "num_comments": 55,
        "comments": [
            ">He barely used a single one\n\nbecause he could not catch up",
            "It is [**deja vu all over again**](https://www.reddit.com/r/MaliciousCompliance/comments/1dj84nt/i_can_definitely_get_that_sauce_for_you/)!",
            "This is a Bistro Huddy bit.",
            "My 9 year old would’ve been in heaven with that much ketchup!",
            "\"and for dessert tonight's special is a baked cheesecake with a fruit puree, however for you sir we can swap it out for tomato sauce.\"",
            "So his ketchup was inexh-sauce-tble?",
            "There is Disney restaurant\\* that will bring you ALL the bottles of ketchup to your table, if you ask multiples time.\n\nThey counted 22 bottles on their table by the time the servers were done.\n\n  \n\\* Whispering Canyon at Wilderness Lodge\n\nThey also just throw the napkins and straws on the table.",
            "Why are you just copy pastaing?\n\n[https://new.reddit.com/r/MaliciousCompliance/comments/1dj84nt/i\\_can\\_definitely\\_get\\_that\\_sauce\\_for\\_you/](https://new.reddit.com/r/MaliciousCompliance/comments/1dj84nt/i_can_definitely_get_that_sauce_for_you/)",
            "Hilarious.  It reminded me of the one time I told a joke about waiters and spoon to a large table of fellow coworkers at a work event dinner at a restaurant.  By the end of the night I felt like I had half the restaurant's stock spoons by my plate.  They thought it was hilarious to keep bringing them unbidden.",
            "“Do you want me to box that up for you?” (gestures at ketchup)"
        ]
    },
    "Enjoy your dirty, urine odor reeking classroom!": {
        "title": "Enjoy your dirty, urine odor reeking classroom!",
        "score": 707,
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1dlj0yk/enjoy_your_dirty_urine_odor_reeking_classroom/",
        "content": "I work at a daycare as a lead teacher for two year-olds. My hours are 8:30am-5:30pm. I usually clock in between 8:20 am & 8:25. I end up clocking out 5:40-5:50. My last student is picked up at 5:30 (latest time allowed) without fail. \n\nMy duties once the children leave are: disinfect and sanitize the restroom & classroom(can’t be completed when kids are present because of the chemicals),empty & take trash to the dumpster from classroom and restroom, empty disinfectant, sanitizer and water pitchers to return them to the kitchen daily, sweep the floors and vacuum the carpet. \n\nAround 4 today my supervisor texted & wrote that I’ve worked OT again based on the times I listed above and to ONLY work from 8:30-5:30 pm\n\nIn order to comply with the timeframe he mandates, I had to leave the classroom without cleaning, sweeping or vacuuming. I only had time to take out the trash. \n\nBut most importantly I clocked out at 5:30!",
        "num_comments": 71,
        "comments": [
            "This may - and should - come back to haunt the supervisor.",
            "Please tell me your supervisor will be the first one in the classroom in the morning - not you!",
            "Lemme just say as the parent who got off at 5 and picked up just barely in time every day at 5:29:  I really appreciate you.  Even just as a step dad you really made my shit possible for a couple years, and I never took your patience for granted.  Thank you.",
            "Make sure to text your supervisor later in the day Sunday to let him know that you complied with his request to be out of there at 5:30, and since the last child pick up wasn't until about that time, there wasn't time to clean and all, but you did manage to take the trash out. Then you have it in text that you followed orders and that you let him know that things were left undone so he can do them Sunday night or early Monday morning. Be specific about it being at his request that you leave at 5:30 and that you couldn't leave children unattended. It covers your butt in future reference.",
            "I know plenty of people who have worked in daycare. They expect you to somehow watch the kids, prepare meals, give medications, change diapers and clean up puke, and keep the place clean all at the same time. And don't make any mistakes or forget anything either. All for usually low wages.",
            "fallout?",
            "My friends story.  \nShe is a teacher at a Nursery and is degree qualified and certified to run the whole place.  One of her duties included opening up and hour before class starts, switching everything on, getting the classrooms ready and then greeting the parents and taking charge of the children as they arrived.\n\nThe boss decided that during that hour she was not 'teaching' and so they were going to cut her wages for that period to minimum wage.\n\nThe next morning she turned up to school in time to start her first class and found a crowd of angry parents milling around the empty locked building, all now very late for work.\n\nIt took until lunchtime for her wages to be fully reinstated.",
            "Keep that text!",
            "Honestly, I wouldn't have taken the trash out. I would have started cleaning the surfaces and stopped at 530. Dirty diapers left overnight have that extra special pungency. 🤢",
            "Be glad you have that in text. Don’t delete it!! They will be yelling at you for not cleaning on Monday.\n\nI would have left the trash, cleaned something else instead. Smell value lol"
        ]
    },
    "It is our job to know! ": {
        "title": "It is our job to know! ",
        "score": 676,
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1dli5py/it_is_our_job_to_know/",
        "content": "This starts as malicious compliance and ends with Petty Revenge. I posted in both. I hope cross-posting is not an issue here!\n\nIt’s a fairly long story but I think I can keep to the essentials. A place I worked at in 2004 had three DBA teams (Data Base Admin).   The team I had been on since I joined was tight and ON-call rotation was pretty easy. If anyone got paged for a database that you were the primary on, then you had to buy the team drinks.  You rarely got paged. :)\n\nSo End of an era. Do you remember “Al Bundy” doing commercials to save big money on long-distance phone calls?   That was us!  Cell phones and free long-distance put us under.\n\nDuring the death throes, they had massive layoffs and combined 30 DBAs on three teams into one team of 7.  I made the cut.  HOWEVER, they refused to offline any systems so the workload of 30 remained! My old boss did not make the cut and my new boss was a toxic butt-kisser. I don’t even care anymore-- his name was Steve. Worst boss ever! He would defend ANYONE but someone on his team. I believe he legit thought throwing his people under every bus made him a “team player” Other departments quickly figured out,  “Blame them and he will blame his people” so they did!\n\nMy first on-call rotation on this new combined team was utter hell! The pager went off every 10 to 15 minutes. Messages like:\n\nJob 104 completed step 5.\n\nJob 110 starting step 12\n\nJob 110 completed step 12.\n\nIn case you did not know-\n\n1. THESE ARE NOT THINGS YOU PAGE OUT FOR!!\n2.  I have no idea what any of those jobs are, where they are kept or what do about them if they should fail.  No idea!\n\nOn and on all night long -   You can’t ignore them as you might miss a REAL message about an actual database problem! So you get zero sleep and with the diminished staff they expect you there the next day.\n\nWhen I started ranting the next day the folks left from that particular team said it’s always been that way. That was nuts and we are short staffed so I set out to fix the problem. I looked at every message that got sent to the DBA pager queue and added the prefixes “INFO\" or \"WARN” to every message (kept it short for the pager) Then I changed the pager daemon to route anything starting with \"INFO\" to e-mail and ONLY route “WARN” to pagers.\n\nWorked like a champ! We went from 50 pages a night to maybe one per night and often none.\n\nOne day a team meeting was called and Boss Steve was upset that a print job had failed and our on-call person (me) did not respond.\n\n“Why would I respond to a print job failure? We (database admins) have nothing to with that.”\n\n“When you get a page you respond. Period”\n\n“Why would I get a page that a print job failed?”  \n\n“Because we always have, didn’t you get the page?”\n\n“Ohhhh, that, no I fixed that awhile back. DBA’s only get paged for DBA stuff now.”\n\n“WHAT? You need to put that back the way it was!”\n\nOk, I am cutting a bunch out here for brevity – I said no!  The people who were actually responsible should get paged not us-- we ended up in a shouting match! He was yelling he would take me to HR and I told him that worked both ways as he was flat-out abusing us not letting us sleep AND expecting us in at 8:00 AM sharp.\n\nThat slowed him down a little and then he calmly said, “Our department must know everything that happens overnight so we can answer for it in the morning, make sure we get the pages!\n\nOh the evil light bulb went off. I smiled and said, “Yes, sir!” Ding! Ding! Ding! “Our department” eh? “We” eh? Okie Dokey then!\n\nI reworked the pager daemon so that all pages went to HIS pager but left the code that only routed WARN to the on-call pager in place. Now WE and OUR DEPARTMENT know everything that happens overnight! Yes, I am so very proud of that one! I slept soundly that night!  \n\nThe next morning I kept waiting for him to come over, and either tear into me again OR admit it was a horrible night, that he did not grasp how bad it was but now let’s get a better fix in place.  I was disappointed--  He said NOTHING to me at all. Did he get all those pages? I double-checked that everything was routed to his pager and it was. He just would not admit he was wrong! I was impressed! I thought he was tough (but stupid) getting all those pages every night and never saying a word!\n\nEND OF MALICIOUS COMPLIANCE\n\nStart petty revenge. :)  \n\nA few weeks later I was doing an upgrade outage overnight. We were getting to a critical point and needed a decision to roll back or continue and exceed the outage window.  I paged him several times. No answer!  We all sleep through pages from time to time so I rolled back and e-mailed all concerned. No big.  But he NEVER got back to me. That was odd. The next Monday I mentioned it to the team and several folks said yeah, he does not answer pages after hours anymore!\n\nAAAAAA-HA!  He was not tough! He just started turning his pager off before bed!  Still too chicken to admit he was wrong.  \n\n A few weeks later I was on call again and late Sunday night I got paged to come in immediately!  To keep it brief the system that went down was a federally mandated system with severe financial penalties for downtime beyond a limit. We were reaching that limit! It was a huge amount of money!  All hands on deck! Even the CEO and CIO were there. Developers, sys admin, network, security and DBA with their bosses (with one exception) were all on laptops in the conference room. This was BIG! Thank god it was not a DB problem – It turned out to be network. The CIO said he appreciated us and wanted all there JUST in case.  No problem… sometimes that is the life we choose! :) \n\nAt about 5 am Monday after a long night, the CIO says to me,  “Hey, I have paged your boss like a dozen times -- he is not answering”\n\nOH GLORIOUS DAY! With a shrug, I very casually say, “Oh yeah, yeah, Steve *\\*never\\** answers pages at night.”\n\nHe said nothing out loud but I saw his face cloud up.\n\nAbout 7:30 issues are resolved and we are watching transactions flow across to the feds. I am watching the DB to make sure the huge backlog is not gumming it up but I am just watching as all is well.\n\nAt about 7:45 Ole Steve comes strutting in the door, fresh-faced with a full night's sleep! As he walks past the full conference room he does a double take and stops. When he sees all the heavy hitters (and us plebes) in the room, his face falls, he knew right then he screwed up!\n\nThe CIO Says, loud and mean, \"Where have you been?!\"  Then the CIO and CEO take him out of the room. I have no idea what was said but I bet it was not pretty! lol\n\nThe CIO and CEO come back in about 10 minutes. They heartily thanked us all for the dedication then sent us home and said don’t come back until tomorrow! Good leaders!\n\nI came in the next day and no Steve. I never saw him again!   \n\nI sure am glad I kept that short! :)",
        "num_comments": 38,
        "comments": [
            "awww, how sad, you never got to say \"good bye\" to Steve. you must have been heart broken ;)",
            "Steve always threw his team members under the bus. You returned the favour by throwing him to the sharks. Well played good sir!",
            "I'm ignorant as hell when it comes to computers, but I thoroughly enjoyed this story \n\nFuck you, Steve",
            "That was a delightful read. Satisfying story, well-written and formatted. Thank you!",
            "*Sarcastically* Thanks, Steve!\n\n*Maliciously* Back to you, Steve!\n\n*Jovially*  Thanks, Steve!",
            "That's the kind of boss you feed into a woodchipper, feet first.",
            "MCI huh",
            "/r/talesfromtechsupport would also probably enjoy this.",
            "Ha Ha! Fuck you, Steve!",
            "Bu-buy, Steve!"
        ]
    },
    "You wanna fat shame your kid? Watch your effects": {
        "title": "You wanna fat shame your kid? Watch your effects",
        "score": 467,
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1dljj6s/you_wanna_fat_shame_your_kid_watch_your_effects/",
        "content": "So, this is me just reminiscing on when I was younger, but as a teen (13 or 14), my mom thought a great way to get me to be “healthier“ was to force me to work out or I wouldn’t be allowed to see friends or play games etc. Well, her new way to convince me to stop eating junk food (I ate junk food like once a day, maybe like chips or a candy but usually ended up eating healthy snacks and fruits throughout the day) was to start fat shaming me. It was little quotes here and there of “You can’t fit in that anymore“ or “You’ve grown a lot since you wore that” (clothes in question being oversized shirts and shorts, occasionally bathing suits, all from like 9 months prior. For context, I was no longer growing and had stayed the same height and weight for about a year and a half). Eventually, she got bored of making little comments and would say in public while eating out with friends that I shouldn’t eat that, too much fat. Nobody noticed or cared, but I got so pissed that she tried embarrassing me, that my dumb teen self decided to not eat for about 48 hours. She panicked when I stopped eating, because I had a bunch of medical condition (including very low blood sugar) and was starting to ask why I wasn’t eating. I simply responded with “You called my fat. You wanted me to lose weight. I don’t feel like working out, because the more you tell me this crap, the less I wanna do what you say.” In hindsight, I really should have just kept doing what I was doing instead of being petty, but I was young and easily pissed off. Now I’m just easily pissed off. And before anyone says I shouldn’t disrespect my mother, she also used to hit me for having a different opinion, and isolated me from society for about half a year and hitting me and harassing me verbally when I was 14 for dating somebody who wasn’t born a guy, so yeah. This is less malicious compliance and more “Hah, I have trauma“, but I still decided to kinda do what she said. Because during those 48 hours, I believe I lost about 5-8 pounds like rapidly. ",
        "num_comments": 39,
        "comments": [
            "You should get therapy. That is a horrible mother and she really put you through the ringer there",
            "So much of society blindly believes the myth of \"a mother's love\". Mine wasn't about fat, but I _hear_ you. And it's taken me decades to even grok that I should think this to myself, but it helps when I try and tell others, like you, that\n\n\n'You deserve to be loved, and to feel loved, just for being you.' --Mr Rogers mashup with my meditation teacher",
            "5-8lbs in 48 hours could only be possible if it was mostly bloat, are you perhaps gluten sensitive? My wife dropped about the same within a couple days of no gluten. Maybe try avoiding gluten for a while and see if that helps you. Just some food for thought hahaha",
            "You should absolutely not respect anyone who treats you shitty like that.",
            "Not malicious compliance...that is the side effects of abuse. Hopefully she saw how her words or actions destroyed your self confidence and made you feel like shit every day.",
            "I’m sure that you had body dysmorphia.",
            "I'm so sorry you went through that abuse and homo/transphobia...",
            "Respect is a two way street.  She wasn't showing respect and teaching not to respect, why would she expect to receive it?",
            "Wow.  So many delusional thoughts here.  Let’s start with the blatantly obvious fact that you cannot lose 4-8 pounds in 48 hours unless you severely dehydrated yourself.\n\nSeek therapy.",
            "Try a life coach instead of therapist"
        ]
    },
    "Malicious DoorDash Wings": {
        "title": "Malicious DoorDash Wings",
        "score": 422,
        "url": "https://www.reddit.com/r/MaliciousCompliance/comments/1dlhccl/malicious_doordash_wings/",
        "content": "So I noticed today DoorDash is running a Summer Deals bruhaha where supposedly different restaurants are offering different types of discounts on orders.  \n\nKnowing DD's predatory business practices it's probably some lose/lose for restaurants if they don't participate, but listen...it's 100 degrees outside, it's been a long week, and a brother's HONGRY.  At least I can still sleep at night ordering from some chain that can shoulder the financial hit, right?\n\nAnd would you look at this - Wingstop is stepping up with a sweet-ass deal on boneless wings.  Free 10pc on my order?  Say considerably less and sign me up. \n\nI rock on up to my cart. \nI throw in a 10pc.\nThe hungerin' rumbles. \nEager to consume, I go to select my sauce...\nAnd the ONLY option is \"Atomic\".  😭\n\nI checked their other boneless sizes, and the bone-in 10pc as well, and they all have every flavor listed.  Wingstop straight-up intentionally said \"You want us to dump off entire orders of free wings?  All right.  Sign on the line. But we're ONLY offering them in Satan's Anus flavor\".  \n\nWas I disappointed?  Yes.  But I've got to give them props for complying with this corporate dictum in one of the most technically-correct yet overtly-violent ways imaginable. \nKudos, Wingstop.\nYou will not quell my hunger today, but you have earned my respect and future full-price business.  👊",
        "num_comments": 63,
        "comments": [
            "We didn’t make the rules, but you will pay to play. \n\n— Wingstop",
            "Challenge accepted, Wingstop. I would have destroyed those Atomic Wings. That's the sauce I get anytime I eat there (which is incredibly rare). They are not even hot enough for me—the hottest pepper in there is a habanero. Child's play. Well played on their end, though.",
            "Yeah, not seeing this in my area, I would have gone for Atomic.  $3 off $30 or 6 wings for $13 doesn't interest me.",
            "Chipotle also offered bogo entrees of $25 or more except when you go to apply the code you get an error message.",
            "You should have just ordered the sauce on the side. Then add the one of your choice. Problem solved.",
            "Wingstop must have too much inventory of Satan's Anus flavor.",
            "Boneless wings are just chicken nuggets ",
            "Sounds like it was written by wing stop",
            "Damn, I want chicken wings now",
            "Damn they're lucky I don't DD. I'm a fucking masochist and would like to see how they are."
        ]
    }
}