{
    "What manga have you read this week, and what do you think about it? - Week ending June 23, 2024": {
        "title": "What manga have you read this week, and what do you think about it? - Week ending June 23, 2024",
        "score": 33,
        "url": "https://www.reddit.com/r/manga/comments/1dmygd4/what_manga_have_you_read_this_week_and_what_do/",
        "content": "*This week = the one that ends/ended right now, past seven days.*\n\n---\n\nThe reason for this thread's existence is the fact that both requests and suggestions became kind of stale. It's supposed to bring out more manga that is not RTed or recommended. Also, it's quite useful for the discussion of not so current titles.\n\nPrevious weeks: [First 72 weeks](http://www.reddit.com/r/manga/search?q=author%3Agladiatorua+What+manga+have+you+read+this+week%2C+and+what+do+you+think+about+it%3F&restrict_sr=on&sort=new&t=all#page=1) and from [June 28, 2015 onwards](http://www.reddit.com/r/manga/search?q=author%3Aautomoderator+What+manga+have+you+read+this+week%2C+and+what+do+you+think+about+it%3F&restrict_sr=on&sort=new&t=all).\n\nAlso, not a rule or any kind of criticism, the more interesting part is not the list of the stuff you read, but your impressions of it.\n\n----\n\nYou can get /u/Roboragi to reply to your comment with links to MyAnimeList, MangaUpdates etc. series pages for the mentioned series. Using this format \"<Manga Title> like so anywhere in the body of you comment. For example:\n    \n    <Dorohedoro>\n    <Golden Kamuy>\n \nWill have /u/Roboragi reply to your post with a comment like this:\n\n\n\n**Dorohedoro** - ([AL](http://anilist.co/manga/31133), [A-P](https://www.anime-planet.com/manga/dorohedoro), [KIT](https://kitsu.io/manga/dorohedoro), [MU](https://www.mangaupdates.com/series.html?id=209), [MAL](http://myanimelist.net/manga/1133))\n\n^(Manga | Status: Finished | Volumes: 23 | Chapters: 191 | Genres: Action, Adventure, Comedy, Fantasy, Horror, Mystery)\n\n**Golden Kamuy** - ([AL](http://anilist.co/manga/86559), [A-P](https://www.anime-planet.com/manga/golden-kamuy), [KIT](https://kitsu.io/manga/golden-kamuy), [MU](https://www.mangaupdates.com/series.html?id=113608), [MAL](http://myanimelist.net/manga/85968))\n\n^(Manga | Status: Releasing | Genres: Action, Adventure, Comedy)\n\n---\n\n^{anime},&#32;<manga>,&#32;]LN[,&#32;|VN|&#32;|&#32;[FAQ](http://www.reddit.com/r/Roboragi/wiki/index)&#32;|&#32;[/r/](http://www.reddit.com/r/Roboragi/)&#32;|&#32;[Edit](https://www.reddit.com/r/Roboragi/wiki/index#wiki_i_made_a_mistake.2C_how_do_i_get_my_comment_reprocessed.3F)&#32;|&#32;[Mistake?](http://www.reddit.com/r/Roboragi/submit?selftext=true&title=[ISSUE]&text=/r/manga/comments/kl85b3/what_manga_have_you_read_this_week_and_what_do/ghe3ssl/)&#32;|&#32;[Source](https://github.com/Nihilate/Roboragi)&#32;|&#32;[Synonyms](https://www.reddit.com/r/Roboragi/wiki/synonyms)&#32;|&#32;[⛓](https://www.reddit.com/r/Roboragi/wiki/interestinglinks)&#32;|&#32;[♥](https://www.reddit.com/r/Roboragi/wiki/thanks)\n    \n---\n\nThis helps users find links to series pages for the series you mention on list tracking sites without you having to manually do it yourself\n\n----\n\nLastly, don't forget to use [spoiler tags](https://www.reddit.com/r/manga/wiki/guide#wiki_spoilers) and to make sure to report any untagged spoilers.",
        "num_comments": 51,
        "comments": [
            "Been re-reading vagabond for the 3rd time, God it's still so peak",
            "I recently caught up <dandadan> and it is insane the storyline ,character everything is insane and to produce such a fabulous art on weekly basis hats off to artist",
            "Since Kmanga introduced to the world, this sub slowly lost its traction.",
            "<Jinrui o Metsubou Sasete wa Ikemasen>\n\nCompleted this in one sitting. Shame that it has only 30 chapters but still pretty enjoyable till the end. Only one gripe is romance thread was not given closure. Ahh well you can do so much when are booted out. Everyday my hate for Axe-kun grows stronger.",
            "I picked up <Mieruko-chan> yesterday and it's delightful. It's funny cute & scary in equal measure, and it knew exactly when to transition from one-off episodic jokes to meatier storylines. Highly recommend so far.",
            "I am looking for some recommendations for my girlfriend. She is a big romance book reader but find that many manga are aimed at a too young audience with teenagers. She wants more adult romance story but not anything smutty.",
            "Where does one buy Manga like Appleseed or Akira? Is there like a online market place for manga?",
            "Mostly just caught up on smoking in the back of the supermarket, cute series.\n\nActually been rereading bleach, the color version, and I've got to say goddamn. Definitely one of my first big series I read but I forget how damn good the original soul society arc is. Just fight after fight after fight.",
            "I've been reading VERSUS, and I'm really liking it so far. Right now it's a 9/10 because I'm not really invested on the side characters.\nAnyway, can someone recommend me some action/fantasy manga without adaptation? Not necessarily like this one",
            "I did not read any specific manga. Reading manhwa revelations of Youth.\n\nwhile browsing other titles tho I saw a genre that I did not quite understand. Shounen ai? I thought it was actual AI. after seeing LOTS of titles with this tag I had to google it and I found out I've been interpreting it wrong. ai as in Love in Japanese. I thought artificial intelligence. . .. it's just another term for boys lovehahaha I'm so stupid. artificial intelligence?"
        ]
    },
    "[DISC] Even a Cat's Paw can be Useful (Nekotete) - Chapter 204": {
        "title": "[DISC] Even a Cat's Paw can be Useful (Nekotete) - Chapter 204",
        "score": 587,
        "url": "https://i.redd.it/gv4op5i0wg9d1.png",
        "content": "",
        "num_comments": 25,
        "comments": [
            "Uh oh, who is this guy? Please don't let it be the dad.",
            "Awkward to meet your father-in-law while flirting around.",
            "I knew she'd be so smug",
            "Dad finally came home with the milk",
            "Ottosama looks pretty good. No wonder her Mom fell for him",
            "I dunno who this guy is but fuck this guy",
            "just a stray cat, walk on by",
            "The dad is back from buying milk! ",
            "I'm thinking brother not dad but I could be wrong",
            "My current theory is that dad gave his powers to Tiggy in the past, but took it back just to have a chat with Mitsuki now. He's probably going to give it back after this arc, where we will learn that he was just the Mitsuki's neighbour's cat all along."
        ]
    },
    "[DISC] The Person I Met In-Game Was Actually My Big Sister Ch.34-35": {
        "title": "[DISC] The Person I Met In-Game Was Actually My Big Sister Ch.34-35",
        "score": 132,
        "url": "https://mangadex.org/chapter/36f20153-8442-48ca-9b7c-f904dcc328eb",
        "content": "",
        "num_comments": 18,
        "comments": [
            "4 timing soon at this rate",
            "When does this trainwreck stop? It keeps piling up without stopping!",
            "\"Stop hitting myself, stop hitting myself!!!\"",
            "*Well of course I know him, he's me*",
            "So she did like him. Want to say let's see how she's gonna hate him, but she's definitely gonna be the another girlfriend ",
            "This manga is actually... good... \nHow? Why?",
            "Out of the fire, into the frying pan. Out of the frying pan, into another frying pan. Out of the frying pan, into another frying pan. Out of the frying pan, into another frying pan.",
            "It's so bad it's good, unlike the 1:39 male:female which is unironically goof",
            "Trainwrecks are fun to watch regardless of how horrifying they are.",
            "Imma going to be real. I really didn't enjoy 1:39 but this one, this is peak."
        ]
    },
    "Source?": {
        "title": "Source?",
        "score": 832,
        "url": "https://i.redd.it/0df3bwoxne9d1.jpeg",
        "content": "",
        "num_comments": 94,
        "comments": [
            "Man such an amazing manga. Too bad the author was a creep",
            "Kei Yonagi from Act -Age",
            "Now that you remind me, the author has finished his probation by now.",
            "Second time in two weeks, the pain lmao",
            "Kei Yonagi the bestest of girls.",
            "Today, it reminded me again then i was hurt.",
            "Anyone else think these posts are karma farming? Theres been the occasional post from OP about sourcing various manga based on girl images where either they are building karma or is so horny theyre just coming across random images on Google search",
            "I've heard really good things about Act-Age but am also aware of the situation with the author leading to the series getting axed. Is it still worth reading despite that?",
            "That's a cute girl... What is name",
            "Man the art on this manga is breathtaking, too bad it was axed due to the author being imprisoned for being pedo i think"
        ]
    },
    "A Fool's Musings on the 1:39 Male to Female Ratio Manga : Female Aura Power System [Repost]": {
        "title": "A Fool's Musings on the 1:39 Male to Female Ratio Manga : Female Aura Power System [Repost]",
        "score": 118,
        "url": "https://www.reddit.com/r/manga/comments/1dr8avy/a_fools_musings_on_the_139_male_to_female_ratio/",
        "content": ">**\\[REPOST NOTE\\]** : The original post was deleted by mods. I asked for specifics to adjust in the future but no reply so far, so automated maybe? Anyway, I think it's because this is very much about ecchi content so I'm reposting with a NSFW tag, and a Spoiler tag too since this is a bit far in the manga. Honestly, I didn't know where the tags were and I didn't think to use them. Too much brain focus on this drivel to think of actually practical things. Let that be a lesson to you, fellow men of culture and nerds/autists of the hyper-focus sort.  \nIf this gets deleted again, well, I dunno what to do next. The thesis(lol) theme is sort of too spicy to be pared down in a way Im satisfied. Eh, oh well.\n\nHardship, Struggle, Desperation, Desire, such things often drive humanity to the brink of destruction, or the peak of evolution. This is the case for many humans, real or fictional, and such is the case even for the eternally THIRSTY women of the 1:39 World where men are rarer than diamonds. Perhaps this applies to these unfortunate souls even more so.\n\nYet Mother Nature/Evolution/God/ess/Chance is not so cruel to these women, and have granted upon their needy ~~wombs~~hearts a power to level the playing field.\n\nThe **Female Aura**. The power of **LUST**\n\n[This is some DBZ bullshit, what the fuck](https://preview.redd.it/25r3fyzcua9d1.png?width=700&format=png&auto=webp&s=a5f756a28bf3d0612bea0eefbe44dd818bb1e96f)\n\nOkay, dumbshit fanfics disguising as flowery fancy speeches aside. The manga **A Parallel World With a 1:39 Male to Female Ratio is Unexpectedly Normal** is certainly not a unique premise, nor are Power Systems. Nen, Stands, Hamon, Cursed Energy, Breathing Techniques, power systems are as common as shounen manga, sometimes, even more common. What I aim to achieve in yet another session of deranged, unnecessarily over-thought theory crafting is flesh out the hints of techniques in the 1:39 manga and create a semi-functioning Power System. Now, you may have questions like:\n\n1. What is this 1:39 manga you are talking about?\n2. Is this that self-mastubatory male power fantasy manga?\n3. What techniques are you talking about?\n4. Are you honestly trying to make a shounen power system from the horniness of very down-bad women?\n\n*Yes, yes I am*\n\nWith that out of the way, let us explore the Female Aura. What is the Female Aura?\n\nTo succinct, the Female Aura is the exposure, the leakage, and the representation of the raw, unfiltered, bottomless LUST that lies in the very heart and womb of every woman in that world. The unrestrainable boundless HORNY that powers the inexorable advance of womankind against a gender ratio that by all logic, should have killed all of humanity. A natural evolutionary adaptation in such a dystopian world where men are rarer than diamonds, and good men even less.\n\nFor you see, in a world where by nature, men only compromise 2.5% of all humanity, Mother Nature dictates upon her daughters that only women of LUST may receive the Grail of Life (cum), and those whose fleshly desires are deemed insufficient are condemned to have their genes lost to the sands of time, their genetic future as dry as their womanhood.\n\nHence, the Female Aura was born.\n\nAt first, in the age of Tribe and Stone, the Female Aura is more a display of force and strength, a metaphorical bare of fangs against the endless hordes of horny bitches in heat. To tell them all that YOU, superior woman that you are, are the only one worthy to receive that husbando's baby batter. But as the number and desperation of womenfolk grew, even threats of mutilation and death are not enough to quench the flames of THIRST. So, those with greater Female Auras are now forced to learn to use their Mother Nature given strengths to find a way to keep the genetic line their foremothers worked so hard to maintain intact.\n\nAnd so, the Female Aura evolved, into what we see now.\n\n# FEMALE AURA POWER SYSTEM DETAILS: What is KNOWN\n\nThe Female Aura is not well understood, as it is more an instinctual ability than a formed/trained technique. These are the details we know so far:\n\n* On average, Female Aura instinctually, unconsciously, and sometimes forcibly, boosts the desires and sensitivity of a female to the presence of a suitable male mate, often at the cost of mental capacity. Senses of smell, sight, taste, and even the mystical senses of the womb itself, become heightened to superhuman levels. Caution, fear, trepidation, common sense and general intelligence is removed or suppressed in order for lust, desire and need to come to the forefront.\n   * But this is the basic function, it's roots as an evolutionary adaptation to the 1:39 world. We shall soon see that the Female Aura can do so much more\n\n[\\\\\"So it Begins\\\\\" - Theoden King](https://preview.redd.it/fyx6ya24z99d1.png?width=400&format=png&auto=webp&s=d09ad5fbbee8594be30d3cbabc949f78a96ddc30)\n\n* Female Aura is present in almost all women. Such is this commonality that even suppression of Female Aura is a rare trait. And the complete absence of the Female Aura, like that of Hinata, is seen as an oddity of the highest order\n\n[Hinata, my beloved, the Anomaly](https://preview.redd.it/0tjfrdt9z99d1.png?width=400&format=png&auto=webp&s=386467834267eb4e28a96b47c837a486a519ed35)\n\n* Female Aura starts first as \"Female Instinct\", the guiding hand and chain that forces all women to THIRST the way they do\n\n[Sumire Nearly Overwhelmed by her Female Instinct](https://preview.redd.it/j1iqh9vdz99d1.png?width=400&format=png&auto=webp&s=c88683b3c040bb4ec0bca3b42ca0016d39a855a0)\n\n* The full name of Female Aura is **\\[Female in Heat Aura\\]** (*Female Sexual Desire*), clearly showing the origin and root of this mysterious power.\n\n[Note: Certain Capable Females\\(Sumire\\) can Detect Female Auras](https://preview.redd.it/0dl6f47mz99d1.png?width=400&format=png&auto=webp&s=d629a21a05f80fc302d119644a20180b18b10dd4)\n\n* As Female Aura is an instinctual based ability, special circumstances can boost Female Aura even more than conventional Power Systems. On rare occasions, it can be boosted past it's theoretical limits. Note however, that Misaki-chan's Aura boost is because of the otherworlder Satou Sou, Climaxxer of Women, Lord Chad of Coping Denseness. Consider such power-ups as exceptions, not the rule.\n\n[Misaki Overwhelming: Female Aura Exceeding Normal Thresholds](https://preview.redd.it/nke44ijmz99d1.png?width=400&format=png&auto=webp&s=6f1d58979fc5e7ead544550598f327483fa74fbf)\n\n# EROTES TECHNIQUES: CRYSTALLIZATION OF FEMALE AURAS\n\n***^(\\[WARNING: DUMBASS FANFIC SHOUNEN BULLSHIT INCOMING\\])***\n\n>In Ancient Greek religion and mythology, the Erotes are a collective of winged gods associated with love and sexual intercourse.\n\nThough Female Auras served well as symbols of strength and female fertility, such things are simply not enough to dissuade thousands of years of genetic female desperation. And necessity has ever been the mother of invention.\n\nIn the manga of 1:39, we have seen only one example of the Female Auras latest step in evolution, that being Chabatake Miku's **\\[FAKE LOVER'S BOAST\\]** *(Deception Memory).*\n\n[The First Example of EROTES: True Female Aura](https://preview.redd.it/smsl09hb1a9d1.png?width=400&format=png&auto=webp&s=cbe9ab613e5982a8e5be7c888f8eba784762281c)\n\nFor simplicities sake, I have taken to calling these crystallizations of raw Female Aura, the ***Erotes Techniques***, or Erotes for short. Shounen Power Systems require short, concise, catchy names after all.\n\nLet us delve deeper into Chabatake Miku's Erotes.\n\nChabatake Miku Erotes: **\\[FAKE LOVER'S BOAST\\]**\n\nMiku's Erotes is born of needs, the need for maintaining discipline versus the need of her womb. To maintain her status, her skill, her chance with Satou Sou, and her mind, her Erotes manifested in a way that not only stabilizes her sanity *(sort of)(not really)(close enough)*, but boosts her will and desires for Sou. You may think the methods are twisted, but Mother Nature cares not about the contrivances of mortals, Her only care is that the babies flow.\n\n\\[Fake Lover's Boast\\] has 2 notable abilities:\n\n* *(Deception Memory)* - allows Miku to seamlessly and unconsciously manifest self-illusions and delusions to help her lust-addled mind. These range from auditory hallucinations to full-on False Memories, cleanly inserted into her mind to allow her to continue functioning in spite of emotional damage that would normally send the average woman into depression. The warmth of love can be provided instantly, without the need of Sou's presence, for Sou is always with her.\n* *(Scent of Happiness)* - enhances Miku's sense of smell to ludicrous levels, rivaling that of blood hounds. Even a full bath did not stop her from smelling Sou's wet dream discharge. The Scent of Sou also boosts her morale and will, even from near zero. Even at her lowest, all she needs is a whiff of Sou, and she's back to full strength\n\nThere are however, downsides to her Erotes, like any good Power System\n\n[Great Power always comes with Great Costs](https://preview.redd.it/y9g7x4nu7a9d1.png?width=400&format=png&auto=webp&s=c0ac10c786f8bf5e46330cf2c4821556f81b4ce0)\n\n*(Deception Memory)* makes Miku extremely prone to bouts of self-induced delusional fantasies. If unprepared, she can become lost in these false memories for some time. *(Deception Memory)* is also unconscious, making it so that it WILL edit her mind and memories whenever and wherever. No core memory is safe, if it means coming closer to making Sou cum close in her.\n\n*(Scent of Happiness)* comes with a severe downside of making Miku a neurochemical addict to the serotonin boost of Sou's Scent. Without a strong will and proper preparation, Sou Scent Withdrawal Symptoms can effectively render Miku a sexual zombie, eroding her vaunted mind and skills all for a touch of Sou's Masculinity.\n\n# NO COST TOO GREAT: THE ZERO-SUM GAME OF FEMALE AURAS\n\nMiku Erotes **\\[FAKE LOVER'S BOAST\\]** shows the hidden brutal truth of a 1:39 world; when finding the love of your life is closer to winning the lottery than a coin toss, almost everything and anything is on the table. It matters not if Miku becomes scent-addict madwoman, memory and mind a patchwork of truths and falsehoods. All that matters is finding her Sou. Because effectively, her body knows Sou is 1 in a billion chance. Let this chance go, and forever regret in her soul that she let go of the keys to Heaven itself.\n\n# MORE FANFIC: POTENTIAL EROTES TECHNIQUES OF OTHER GIRLS\n\nTo keep this already long drivel even longer, let's go on a quick (*this a lie*) theory crafting bend on what Aura Techniques the other girls could manifest\n\nMisaki Erotes : **\\[EROTES EXPANSION: CUPIO ERGO SUM\\]**\n\n* Misaki is a bit of a special case. Exposed to the blinding light of Sou's **\\[Atomic Smile\\]**, her Female Aura was boosted beyond what is normal even for the ever-thirsty needs of \"normal\" women. Breaking her mind and turning her into even more of a pig in heat than what is considered conventional, her Erotes evolved into a strange form.\n\n>Once, Misaki knew the truth. The internet told her that real men are not as good as 2d men. That these girls thirsting over flawed men are wrong.\n\n>She was proven wrong, by the presence of Sou\n\n>Then, Misaki knew the truth. That real men existed, and some of them can be better than 2d. The proof is right in front of her.\n\n>Then the proof smiled, and she was proven wrong.\n\n>Now, she knows the TRUTH. That real men, 2d men, all these \"men\" are falsehoods. Only Sou is the One True Man. Sou is the Light, Sou is the Truth. Thusly, her Lust to Him is more than True. It is the Stairway to Heaven itself.\n\n>She Lusts, therefore She IS.\n\n* **\\[EROTES EXPANSION: CUPIO ERGO SUM\\]** makes it so that Misaki becomes utterly unshakable in her desire for Sou. No Erotes, no Fate, no change nor chance can shake the Truth burned into her eyes when the Sou smiled upon her. In the indeterminate time it takes for the Erotes Expansion to last, Misaki cannot be broken, she is effectively invincible.\n\nSumire Erotes : **\\[GAZE OF TRUE LUST\\]** *(Vigilant Onee-chan)*\n\n* PROS: Sumire's natural ability to immediately measure the Female Aura of another pig in heat and her instincts that can discern the dangers of a woman to her Sou is enhanced to a full Erotes. Now she no longer needs her eyes to see whether a dangerous pig is nearing Sou. A new, paranatural sense more precise than radar is now accessible to Sumire, allowing her to instinctually know where Sou is at all times, and the Female Auras and Erotes of all women in Sou's vicinity.\n* CONS: This is not passive, and is extremely taxing on Sumire, not only mentally, but physically and paranaturaly as well. Her Older Sister value to Sou, already low, drops ever further if she overstrains the \\[Gaze\\]\n\nSakura Erotes : **\\[ANGEL'S FALL\\]** *(Mask of the Little Sister)*\n\n* PROS: \\[Angel's Fall\\] removes all of Sakura's mental limiters, both intellectual and emotional. Becoming a Yandere rivaling a harem manga demon queen, she becomes a genius, cold, calculating and manipulative little sister, cleverly hiding her moves and intentions behind the veil of a cute, innocent imouto. All to finally acquire the love of her Onii-chan, and receive the greatest affirmation of all, his child in her belly\n* CONS: \\[Angel's Fall\\] only triggers in times of extreme threat, stress and duress, turning Sakura into a girl not fully her. But the greatest danger is that if Sou ever finds out about the true nature of Fallen Angel Sakura, he will fear her. And this will break Sakura's heart.\n\nAkane Erotes : **\\[MILK OF MOTHER'S LOVE\\]** *(Homing Instinct)*\n\n* PROS: Finally learning the power of the biggest breasts in the series, Akane fully leans into Sou's big boobs fetish, and her sexual allure to Sou skyrockets. Forgoing all restraints that previously held her back, she becomes the Succubus Queen of House Satou. Sou will need extreme will, cope and even more comedy protag plot armor to stop himself from supping upon the Milk of Mother's Kindness.\n* CONS: Her sexual power boost is not a guaranteed win, and if Sou successfully resists, he may be scarred of what his Mother attempted upon him, breaking Akane's heart. The mental unshackling will also make her dismissive, if not outright hostile, to her 2 daughters. After the boost, she will regret the sins she inflicted upon her children\n\nKaede Erotes : **\\[LUST TEMPO ADVANTAGE\\]** *(Heart of a Woman's Cards)*\n\n* PROS: Kaede's intellectual skills are sharpened to an otherworldly degree. She gains intimate understanding of language, rules, and associated trivia necessary to twist and manipulate the words of those around her for her benefit. Rules-Lawyering and Word-Manipulation of the finest degree are at her fingertips, and Sou will find that he is be buried in a 69-page legally binding contract that consigns all future semen to Kaede\n* CONS: Kaede's Erotes forsakes all moral and ethical restrictions to achieve true manipulation. By instinct, most people will find Kaede Erotes as deplorable, alienating her from even Sou. She must rely solely of \\[Lust Tempo Advantage\\] to keep the pressure up, or lose the entire game.\n\nKanaria Erotes : **\\[FORBIDDEN GOLDEN PATH\\]** *(Descent into Depravity)*\n\n* PROS: A near memetic ability that not only un-restrains Kanaria's unique imagination, but also spreads the allure of her sexual excesses to all that hear her. Like a Slaaneshi daemonette, she whispers to Sou and her friends secrets and activities so inspired, depraved and hedonistic it both horrifies and intrigues. Soon, Sou and all girls near him fall to Kanaria's Golden Path to hedonistic hell, with God-Empress Kanaria taking her rightful place as the Queen of Sou's Eternal Harem Orgy\n* CONS: She becomes a Slaaneshi demon in all but name. Without constant mental control and will, she will swiftly fall into an inescapable spiral into depraved destruction.\n\nHINATA EROTES : {̷R̵E̵D̴A̴C̴T̷E̷D̵}̴ ̵\\[̸R̵E̷D̶A̴C̸T̴E̵D̷\\]̸\n\n̶\\[̴R̴E̴D̸A̸C̷T̸E̸D̸\\]̴ ̵\\[̸**C̴A̷N̸**\\]̴ ̴\\[̶R̸E̴D̵A̴C̸T̴E̵D̸\\]̷ ̵\\[̷R̸E̸D̶A̶C̵T̵E̸D̴\\]̶ ̷\\[̴**Y̶O̶U̶**\\]̷ ̵\\[̸R̸E̷D̴A̸C̵T̸E̴D̶\\]̸ ̵\\[̵R̶E̷D̸A̶C̴T̶E̷D̶\\]̷ ̵\\[̸R̴E̷D̸A̷C̵T̵E̵D̴\\]̵ ̴\\[̸**H̵E̸A̷L̵**\\]̸ ̷\\[̶R̴E̵D̸A̵C̸T̴E̵D̵\\]̸ ̵\\[̸R̸E̸D̴A̷C̵T̴E̸D̶\\]̷ ̶\\[̶R̸E̶D̵A̷C̴T̸E̴D̷\\]̸ ̸\\[̸**H̵E̶R̶**\\]̴ ̶\\[̶R̷E̶D̴A̵C̴T̶E̵D̵\\]̴ ̸\\[̴R̶E̵D̴A̶C̷T̶E̷D̵\\]̴ ̷\\[̵**B̶E̴F̴O̷R̶E̸**\\]̷ ̶\\[̶R̶E̴D̷A̴C̶T̸E̸D̶\\]̸ ̵\\[̴R̷E̴D̴A̶C̸T̷E̵D̶\\]̶ ̶\\[̸R̵E̸D̸A̷C̷T̸E̶D̸\\]̸ ̷\\[̶R̶E̴D̷A̵C̴T̴E̷D̶\\]̵ ̷\\[̵**I̴T̴**\\]̷ ̵\\[̴**I̷S̸**\\]̸ ̸\\[̸**T̵O̸O̴**\\]̵ ̶\\[̵**L̴A̴T̸E̶**\\]̴\n\n**\\[SPECIAL CASE\\] : SATOU SOU - OTHERWORLDER**\n\nAs befit of his status as isekai protag, Sou comes with natural abilities that can be described only as \"hilarious hacks\". As someone from a world of 50:50 gender ratio, Satou Sou is immune to the evolutionary adaptations his male body possesses in the 1:39 world as survival mechanism against thirsty women; fear of women and womanly attributes, social coping mechanism like anger and superiority complexes, increased predilection to homosexuality, weaker and less sexually inviting bodies to dissuade would-be female rapists.\n\nHis testosterone levels, his sexual desires, his taste in women, and his mannerisms, normal in our world, has turned him into the Anomalocaris of this world. The only Apex Predator in a Sea of Prey(*women, and potentially some gay men*). A lesson in invasive foreign species placed in an unprepared ecosystem. Yet, Satou Sou holds the power to both destroy their society, or dominate it and rebuild it in his image.\n\nHis abilities so far are:\n\n**\\[BIG BROTHER'S AFFIRMATION\\]** *(Mind Breaking Praise)*\n\n* a praising technique honed and trained by his bias to finally having a little sister to dote on with Sakura. His ability to praise a woman unflinchingly despite the embarrassment is enough to crack the hearts of even man-hating lesbians, and utterly mind-breaks the conventional female\n\n**\\[PLAYBOY JOY\\]** *(The Pleasure of Playing with Hearts)*\n\n* a curious mental tick that transforms Sou into a playful playboy that can swoon those vulnerable to the \"bad boy\" fetish. Seemingly only appears when there's either; Yuri-afficionados or bratty girls. Possibly stems from his seeming fetish for Yuri-Corruption\n\n**\\[ATOMIC SMILE\\]** *(Light of the Perfect Man)*\n\n* Sou smiles with joy and gratefulness pure and true. The transmission of such pureness and manliness becomes a supernatural flood of metaphorical light that burns the hearts and wombs of all girls that beholds it. One requires an iron will, or a depressed heart, to resist orgasming on the spot.\n\n**\\[LUST CONVERSION: MUSCLES\\]** *(Distraction from the Urge)*\n\n* Sou converts excess lust into muscle growth through exercise. Sou's physical exercises builds his physique faster and better than the average male in the 1:39 world. His sexual and physical appeal increases over time, and there is no end yet in sight to this growth.\n\n**\\[ARTIFICIAL DENSENESS\\]** *(Hunger for Normalcy)*\n\n* Sou is an orphan in his old world. So when he arrived in a world where finally has family, his greatest desire is to keep this happiness. But his mother and sisters desires not familial love, but romantic and sexual love. So, Sou's mind can continually keep him supplied with custom-made copium so he remains dense to the obvious advances. As such, blissful ignorance is maintained, and Sou remains happy, **for now**.\n* This is slowly eroding away\n\n**\\[VIRILITY OF THE KHAN\\]** *(Stamina and Strength Eternal)*\n\n* *{WARNING: PARALLEL-REALITY BULLSHITERY DETECTED}{R18 RESTRAINTS LIFTED}* Limited to the version of Sou that embraces the advances of the women, Sou gains superhuman stamina, strength and hyper-shortened refractory period. He becomes the Hentai Protagonist he was meant to be.\n\n>*\"Beds shall be broken, wombs shall be shaken. My Sword's night, a long night, till the Sun rises\"*\n\n>- Satou Sou Khan embracing the fate thrust upon him\n\n*Final Addendum:*\n\nSo ends yet another massive, unnecessary, insane and excessively over-thought spiel on a frankly pointless topic on a comedy ecchi manga. But it was fun, so who cares. Did you like my newest Ted Talk? No? Too bad, too late. I can't rewind the time you spent reading my freshest mind-vomit, and neither can you.",
        "num_comments": 25,
        "comments": [
            "Uh-oh, I think the abyss has started gazing back into me.",
            "You're cooking. I have no fucking idea what you're cooking, but you are cooking",
            "Finally a power system better than nen and stands",
            "... Are you okay. It ain't much, but we are here if you need to talk to someone. Do you have trusted family members? It's never late to get help.",
            "This would have been perfect, but you forgot the greatest titles of our (totally not self insert) MC and an important display of female social interaction in this world. Grand Masturbation Satou-san, and of course, the Ejaculation Crasftsman with Maximum Spirit. These titles alone elevate the Satou to the Celestial Cumtivation Realm 3rd layer, and shows in relation to the women that surround him how they and the world will be breaking the normal powers calling in the coming chapters.\n\n Additionally, women in this world appear to engage \"Breastling\" as a low stakes way of asserting dominance in defense of their males. Thus we see that the lustful aura appears only in that of extreme distress, which makes sense due to the ridiculous natural strength of the FMCs of the series in addition to the boost which Satou brings to the imbalance of the world's natural order.",
            "One Piece could have been good if they have this power system.",
            "Ayo, I ain't reading all that. Someone please give me a TL;DR",
            "This post is just full of the exaggerated swagger of a horny teen.",
            "perfectly summarizes my reaction while reading this masterpiece",
            "Strange way to write: "
        ]
    }
}