{
    "What manga have you read this week, and what do you think about it? - Week ending June 16, 2024": {
        "title": "What manga have you read this week, and what do you think about it? - Week ending June 16, 2024",
        "score": 34,
        "url": "https://www.reddit.com/r/manga/comments/1dhjfke/what_manga_have_you_read_this_week_and_what_do/",
        "content": "*This week = the one that ends/ended right now, past seven days.*\n\n---\n\nThe reason for this thread's existence is the fact that both requests and suggestions became kind of stale. It's supposed to bring out more manga that is not RTed or recommended. Also, it's quite useful for the discussion of not so current titles.\n\nPrevious weeks: [First 72 weeks](http://www.reddit.com/r/manga/search?q=author%3Agladiatorua+What+manga+have+you+read+this+week%2C+and+what+do+you+think+about+it%3F&restrict_sr=on&sort=new&t=all#page=1) and from [June 28, 2015 onwards](http://www.reddit.com/r/manga/search?q=author%3Aautomoderator+What+manga+have+you+read+this+week%2C+and+what+do+you+think+about+it%3F&restrict_sr=on&sort=new&t=all).\n\nAlso, not a rule or any kind of criticism, the more interesting part is not the list of the stuff you read, but your impressions of it.\n\n----\n\nYou can get /u/Roboragi to reply to your comment with links to MyAnimeList, MangaUpdates etc. series pages for the mentioned series. Using this format \"<Manga Title> like so anywhere in the body of you comment. For example:\n    \n    <Dorohedoro>\n    <Golden Kamuy>\n \nWill have /u/Roboragi reply to your post with a comment like this:\n\n\n\n**Dorohedoro** - ([AL](http://anilist.co/manga/31133), [A-P](https://www.anime-planet.com/manga/dorohedoro), [KIT](https://kitsu.io/manga/dorohedoro), [MU](https://www.mangaupdates.com/series.html?id=209), [MAL](http://myanimelist.net/manga/1133))\n\n^(Manga | Status: Finished | Volumes: 23 | Chapters: 191 | Genres: Action, Adventure, Comedy, Fantasy, Horror, Mystery)\n\n**Golden Kamuy** - ([AL](http://anilist.co/manga/86559), [A-P](https://www.anime-planet.com/manga/golden-kamuy), [KIT](https://kitsu.io/manga/golden-kamuy), [MU](https://www.mangaupdates.com/series.html?id=113608), [MAL](http://myanimelist.net/manga/85968))\n\n^(Manga | Status: Releasing | Genres: Action, Adventure, Comedy)\n\n---\n\n^{anime},&#32;<manga>,&#32;]LN[,&#32;|VN|&#32;|&#32;[FAQ](http://www.reddit.com/r/Roboragi/wiki/index)&#32;|&#32;[/r/](http://www.reddit.com/r/Roboragi/)&#32;|&#32;[Edit](https://www.reddit.com/r/Roboragi/wiki/index#wiki_i_made_a_mistake.2C_how_do_i_get_my_comment_reprocessed.3F)&#32;|&#32;[Mistake?](http://www.reddit.com/r/Roboragi/submit?selftext=true&title=[ISSUE]&text=/r/manga/comments/kl85b3/what_manga_have_you_read_this_week_and_what_do/ghe3ssl/)&#32;|&#32;[Source](https://github.com/Nihilate/Roboragi)&#32;|&#32;[Synonyms](https://www.reddit.com/r/Roboragi/wiki/synonyms)&#32;|&#32;[⛓](https://www.reddit.com/r/Roboragi/wiki/interestinglinks)&#32;|&#32;[♥](https://www.reddit.com/r/Roboragi/wiki/thanks)\n    \n---\n\nThis helps users find links to series pages for the series you mention on list tracking sites without you having to manually do it yourself\n\n----\n\nLastly, don't forget to use [spoiler tags](https://www.reddit.com/r/manga/wiki/guide#wiki_spoilers) and to make sure to report any untagged spoilers.",
        "num_comments": 49,
        "comments": [
            "Toshokan No Daimajutsushi\nIt's the best read I had this year, and I don't say it lightly. It's a fantasy world following a kid who wants to be a librarian. I can't do it justice by describing it, so I will say that it's well written, the world building is great, it's nothing like your isekai trope. The more you read the more you discover the world, societies, the lore, the problems that will rise in the next chapters. It would do a great adaptation in anime",
            "I finished <Non Non Biyori>! It's a cute series. I think the Renge chapters and the Natsumi chapters were my favourite, Renge because she was such a goofy kid (and later on attempted to be an older sister figure, which shook things up a bit) and Natsumi because she was such a screw-up lmao. I didn't particularly love the series, i don't think it stands up above the other slice of life type stuff, but it was a good read-through.",
            "**My Wandering Warrior Eating Disorder** aka **<Meisou Senshi Nagata Kabi: Gourmet de Go!>**\n\n\nIn this part of the gripping autobiographical graphic novel saga by Nagata Kabi (*<My Lesbian Experience with Loneliness>*,*<My Alcoholic Escape from Reality>*, etc. etc.) it goes into more detail of, well, if the english title isn't a dead giveaway, her eating disorder issues that coincided with/stemmed from the rest of her psychological and depressive issues that she went on at length about in her previous books. This one is much much shorter than the other entries though. But still, if you've read and like me have been impressed by her works thus far this entry is here to read as well.\n\n\n**<Skeleton Double>**\n\n\nI liked this. I really did. Interesting base for the use of powers in this story. The Cypress lady was great. And once they characterized the MC he got interesting. But oddly, beyond a lot of those surface level thoughts on this one, I don't really have anything more succinct to say about it. Though the rushed final conflict with all the potential story elements crammed in there at the end on top of the overall feel at the end probably didn't help in that regard.\n\n\nIt didn't really do anything wrong in it's execution, and like I said I enjoyed it. I just find myself without much to say about it beyond, \"well that was cool\" a lot of the time.\n\n\n\n**<Daddy and Buddy>**\n\n\nWell this sucks Beavis, another decent series came to a sudden end. Not that I couldn't foresee this series being one of those cases from the get go but still.\n\n\n\nWell in any case. The mature emotional throughline of this series really gave this one it's chops.\n\n\n**<Dear Anemone>**\n\n\nAnd this one didn't last long now did it. Not that I was expecting this poor mans version of *<Jigokuraku>* to anyways. And it went out on a very cheesy note.\n\n\n\n\nWell, the artwork certainly did it's job though here can't deny that. Got some mild enjoyment out of reading it. But it will ultimately not be missed.\n\n\n\n**<Futari no Lion>** aka **The Two Lions**\n\n\nIt was short and there and I was bored with no better ideas for things to read so whatevs.\n\n\n**<Ore no Imouto ga Konnani Kawaii Wake ga Nai Comic Anthology>**\n\n\nDamn was I bored as fuck with no better ideas for something to fill an hour with enough to read this...",
            "Yakuza Reincarnated, it had a good premise but I am still checking if it does wonders. Hopefully it doesn't turn into a shitshow that is Re:Monster",
            "Caught up to <Bokura No Kiseki> literally one of my best reads of all time. Why is this manga is underrated? A large cast who is so, so wel written, an amazing plot with rich lore and amazing plot twists? It's an amazing series.",
            "Started <The Apothecary Diaries> and caught up with <Blue Lock>. \n\n\n Apothecary is pretty fun, and I adore Maomao for her little cat appearances and the way she's just so unphased by Jinshi sometimes. Also, her inner gremlin coming out when medicine is involved, very cute. The mysteries are pretty intriguing, quite like how some (maybe all, I have bad memory) cases have little hints that relate to the answer Maomao comes up with. For example, >!when the woman woke up before the dude she poisoned, without much help, which did play into what Maomao came up with as a solution!< while she was visiting her home.  \n\n\nQuite good overall, and the art is great. I'm only on Chapter 35.1 though, haven't caught up yet. I'm mostly curious if Maomao is gonna take any major losses by drawing a wrong conclusion during a case in the remaining chapters, I think it would be a good shake up. \n\n\n Onto Blue Lock, I really enjoyed the U-20 game. Isagi's goal at the end actually made me yell. On the other hand, my eyebrows were raising reading just about everything Shidou said during the match. \n\n\nThis whole arc was just plain awesome and chaotic: Rin going boogeyman mode, Shidou, the Itoshis, Ego actually showing a hint of happiness for once, Aiku, \"Make us win, you shitty four eyes\", Reo and Nagi actually working well together after a while, Nagi's fist pump, and Isagi's puzzle coming all together with the \"luck\" piece. \n\n\nThe 2 follow up SoL chapters were a great break from all that, pretty cute and chill.\n\n\nThe current training/selection games(?) with the top players have been good so far. I do think they're a little worse than U-20 quality wise since it's been >!Isagi brainblast sweep moreso than usual, and Bastard beating Ubers and Manshine felt a little bleh IMO.!< I do appreciate how some underutilized dudes got some screentime though, namely Raichi and Hiori. Also Kurona, kind of, but so far he seems like a bit of a pass bot.\n\n\nOn the flip side, Kaiser has also been jobbing as a \"rival\" compared to Rin tbh. He was annoyingly good at first, but now that everyone is getting awesome moments and >!Isagi has been out smarting him most of the time,!< he kinda sucks. Sure he'll >!probably score the next goal, but I don't like him enough to get hyped.!<\n\n\nTo finish on a more postive note though, I've been loving the character interactions this whole arc. Reo and Nagi >!getting back together for an awesome stars aligned move!<, Charles and Shidou >!instantly becoming besties!<, Reo and Isagi just generally being friendly compared to \"What the fuck is this guy talking about\" two arcs ago, and the top players continuously making fun of Noa only for him to \"🗿\". Also, I laughed extremely hard at >!Rin and Kaiser breaking down after Isagi scored in the PXG match.!<",
            "I recently caught up on a few manga I stopped reading a while ago, or even years ago in tha case of <Kaiju No. 8> and <Spy x Family>.\n\nI got lucky with my timing. Kaiju No. 8's latest chapter is the climax of a long arc. I probably wouldn't have enjoyed it as much if I was reading the chapters as they came out, but I think the pacing is good if you read it in one go.\n\nSpy x Family doesn't have any arcs that long but still had some very tense moments. I am glad I didn't have to wait two weeks after every chapter to see how >!school bus hijacking!< would end.\n\nI also caught up with <Oshi no ko> and <The classroom of a black cat and a witch>\n\nOshi no ko is entering the last arc and I am curious to see how the antagonist is going to react to what Aqua has been doing.\n\nClassroom also just finished a major arc with >!Spica finally getting her first win against Aria!<. Followed by some good chapters deepening Spica's relationship with Claude, and a chapter in which a major character >!licks their own but.!< That last one made my laugh out loud several times and made me remember why I loved this manga in the first place. Definitely planning to keep up with this one again going forward.",
            "just finished You and I are Polar Different, I think I would love the new couple <3",
            "Hey! I need a favor. What’s the name of the manga with the little orange dragon that rides on a roomba? There’s a little purple dragon as well. They both serve a guy in a modern day hunters thing with gates and all that. Also, I was hoping to find this manga where the guy gets reincarnated as a side character, in a modern day hunters/guild/gate type thing. He also has a skill that makes him stronger the more famous he is. He was known for being ungrateful and bad, but now is a good guy. If anyone can help I appreciate it!",
            "I've been lazy and I'm still trying to get through my Demon Slayer set :/"
        ]
    },
    "[DISC] Even a Cat's Paw can be Useful (Nekotete) - Chapter 198": {
        "title": "[DISC] Even a Cat's Paw can be Useful (Nekotete) - Chapter 198",
        "score": 429,
        "url": "https://i.redd.it/owzrz4a7938d1.png",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Maybe he gave the ability away to some poor cat he saw on the side of the street and felt sorry for.\n\nIt's a power he didn't ask for anyways, and he wasn't getting acclimated to, or interested in, being human anyways.\n\nMaybe this ties in to why fmc's dad gave his power away?",
            "Owner: Out of the way, I'll take care of this.\n\nOwner: *Opens eyes*\n\nOwner: Alright, I'm out of ideas.",
            "Now he really only has one single orange brain cell.",
            "And this is how our resident catboy becomes a regular (orange) catcat.",
            "This series feels a bit dark now. And also a bit random. Not sure what I’m supposed to think or expect.",
            "He didn't even flinch much to the owner's open eyes and just stare blankly.\n\nMaybe he's already satisfied and doesn't want to get revenge anymore because he met good people and made the ability disappear from him 🤔",
            "I am betting something happened to the person who gave him his powers?",
            "I really hate that this isn't being uploaded to MD or any scan site anymore. I'm just not on reddit enough to follow the consistent releases here",
            "Or maybe it was always a time limited transformation?",
            "He had been trying to learn to human though, seems like it just expired"
        ]
    },
    "[DISC] Day labor dungeon of alcohol and cigarettes - Ch 1": {
        "title": "[DISC] Day labor dungeon of alcohol and cigarettes - Ch 1",
        "score": 422,
        "url": "https://www.reddit.com/gallery/1dlpkgl",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Panty and Stocking, fantasy edition. \n\nAnd I am *all about this series*.",
            "That guy is probably expecting to be involved, when it will probably just end up in Yuri. \n\nOr them breaking the door.",
            "[Mangadex](https://mangadex.org/chapter/dd4e3fbb-0762-4d3a-827e-7b52092496d0)\n\nSynopsis\n> The story follows a pair of adventurers: one who is an alcoholic and one who is a heavy smoker. The two enter ancient dungeons to embark on bounty hunting and house-hunting. -ANN",
            "Lucky guy.\n\nWell, I have the feeling they gonna go scissors and left the poor man out.",
            "those thighs could kill a trex",
            "I wonder what other kind of bad habbits this manga will show us next. Illicit sexual relashionships? Unhealthy diet? Drug abuse? Forgetting to take out laundry from the washing machine? Keeping too many tabs open in your browser?",
            "Slightly a stretch but from a big Dark and Darker game fan this has fun parallels.",
            "Well they look adorable. And they also look like they could kick my ass. Double points",
            "Eh pointless cliffhanger, either say gex and I leave or threesome and I stay.",
            "Or... There's a third *hidden* option"
        ]
    },
    "[DISC] A Cool Girl and a 12cm Promise - Ch. 16": {
        "title": "[DISC] A Cool Girl and a 12cm Promise - Ch. 16",
        "score": 1009,
        "url": "https://mangadex.org/chapter/581aab1d-8ba1-4709-85e1-4e74e7f02b4d",
        "content": "",
        "num_comments": 26,
        "comments": [
            "The release schedule of this has be checking back constantly lmao. Don’t tire yourself out",
            "Thanks random friend with way too much life experience for the lesson",
            "[Mangadex link](https://mangadex.org/chapter/581aab1d-8ba1-4709-85e1-4e74e7f02b4d)  \n  \n> Tomo doesn't see gender.  \n  \nYes, Taka knows that Tomo is not dense in THAT way, just kind of lost considering he needed to grow up early after his sisters were born in order to take care of them, that's why he's always attentive with Ibuki when something's odd, like in Chapter 9 when Ibuki had had her period.  \nHe just need to sort out those feelings he has with her and come up with a definite answer.",
            "See? Ibuki, when assertive, can frazzle him and get him to blush. She just has to be nonchalant about it. He likes her. He just doesn't understand why or how yet, but he does.",
            "God bless our wingmen o7\n\n[](//#grateful)",
            "Shes so cute ",
            "So hes closer than we thought. He just doesn’t understand what to call that feeling, but hes clearly super into Ibuki",
            "While not as direct as Kuma, Taka's wingmanning has advice that can be applied even outside of sorting out one's feelings for someone. Man's got all those stats in wisdom.\n\n\nAnd this is also a good development, cause Tomo's actually actively trying to work out his emotions, and has an understandable reason for being \"dense\" compared to other so-called dense protagonist.",
            "Ahh a perfect pickmeup to go with my breakfast!",
            "Well this guy better figure out his feelings fast or he's gonna have a worse case of Head Pigeons than the FMC from Hiyokoi."
        ]
    },
    "Source?": {
        "title": "Source?",
        "score": 601,
        "url": "https://i.redd.it/8bzdsjvu118d1.jpeg",
        "content": "",
        "num_comments": 68,
        "comments": [
            "Boy's abyss\n\nYou're better off not reading that.",
            "[deleted]",
            "Boy's abyss.\n\nPlease don't read it. At this point I'm in it for the sunk cost fallacy.",
            "She is beautiful. Why is the artstyle so familiar\n\n>Sees the sauce in the comment\n\nOh... That manga. It all makes sense now",
            "A dark, dark place.\n\nBoy's Abyss.",
            "It's boys' abyss",
            "Boys abyss. Used to be really good but about half way through its just misery for the sake of misery instead for a story",
            "OP look, I love how messy and fucked up the story is and know many hate on it for their reasons which is valid, but if you want you can read it and make up your own mind. There are many manga, shows, movies, etc. I liked which people hated and I'm glad I didn't listen to them.\n\nAlso it's pretty fast paced so it won't take long to read. \n\nJust don't let other people dictate how you should feel about something you haven't experienced yourself, that's all.",
            "artstyles are amazing, imagine having a style so recognizable your fanbase hates everything you produce whilst at the same time knows it by heart",
            "The source is Boy's abyss.\n\nAn edgy manga that wants to shock you and be taken seriously so hard that it goes full circle to become a clown parade. An absolutely hilarious read of you like involuntary comedies"
        ]
    }
}