{
    "[Weekly Megathread] New Players & General Questions Thread.": {
        "title": "[Weekly Megathread] New Players & General Questions Thread.",
        "score": 4,
        "url": "https://www.reddit.com/r/Maplestory/comments/1dncwai/weekly_megathread_new_players_general_questions/",
        "content": "Welcome to our weekly megathread for new players and players who just have general questions about the game.\n\nSome sample topics for you to consider would be:\n\n* Selecting your main character.\n* You're new to the game and don't know where to start.\n* You're a returning player who is trying to get back into the game and need help.\n* What class should you make for your next link skill/legion mule?\n\nAs a recommendation, please mention your world and/or server inside a bracket `Example: [Bera]` at the start of your question.  \n\n\nFeel like chatting rather than posting on Reddit? Join our [Discord](https://discord.gg/ms) and check out our #general-questions or specific job chatrooms.",
        "num_comments": 366,
        "comments": [
            "Im hitting 260 for the first time after reset today. Can someone point me to a 6th job guide? What should I do after advancing? Unlock origin skill - then boost skill? Any help is appreciated!",
            "Is there a guide for which Guild Castle Personal Research upgrades I should get in which order to maximize EXP?",
            "Has Princess No always been instanced? I can't enter because another party is inside. I coulda sworn before the \"rework\" it wasn't",
            "Do you guys safeguard getting boss mules to 17\\* for certain equips if you dont have spares? (ie abso, first kanna ring, etc)\n\nNot sure if I wanna wait for another 5 10 15 or 30% off before doing it, i find 12-15\\* is pretty painful sometimes though",
            "I'm currently trying to learn Will and I was wondering what happens if I fail a test when doing Will in a party? Everyone fail and we need to do it again? I cannot do p2 test t_t",
            "Where do I get low tier ore like opal, silver, bronze and adamantum? The mysterious nodes seem to only give me high tier stuff.",
            "Should I use all my Arcane Selectors to make all 6 symbols the exact same?",
            "does wind archer have an iframe (in a node or otherwise), or is gale barrier the only defense against 100% HP attacks?",
            "is there a general rule of thumb on how to compare att% and boss damage?",
            "What do you do with familiars that you rank up but have no usable lines?"
        ]
    },
    "[Weekly Megathread] LF> Guild, Bossing Group, Friends, Help": {
        "title": "[Weekly Megathread] LF> Guild, Bossing Group, Friends, Help",
        "score": 3,
        "url": "https://www.reddit.com/r/Maplestory/comments/1dptd0n/weekly_megathread_lf_guild_bossing_group_friends/",
        "content": "Welcome to our weekly \"Looking For\" thread.\n\nIf you need a new guild, want some friends to pal around wdith, want to beat that new piece of content, or just need some general help from people in-game this is your place.\n\nBe sure to include what server you play on so others can help you out. `Ex: [Bera]`\n\nGuild leaders and recruiters, you can post your recruitment copy pasta in this thread as well. Please be sure to mention what server and region you guild is on.\n\nPlease refer to the [rules](https://www.reddit.com/r/Maplestory/about/rules/) if you have any questions. Worst case, ping mod staff on [Discord](https://discord.gg/ms)",
        "num_comments": 6,
        "comments": [
            "LF Beginner(ish) friendly Guild + Friends to duo bosses with in Kronos.\n\nMain is a 239 Dawn Warrior about 11k stat, \\~2m cp & 2k legion. I play about an hour every day but more on the weekends! Still learning bosses, able to clear 3 door CRA & Hmag, so far",
            "HolySmokes would love to have you :)",
            "LF>Friends to help with bosses and progression\n\nJust hit 260 and looking for people who have more knowledge than I do, this is my first 260! Bossing duo help would be awesome too!!\n\nKronos IGN-ILog4n",
            "LF active guild in Kronos. \n\n\nStarting a fresh account here as a player from SEA currently with a 224 hyperburning Mihile (as of this time of writing) and ~800 legion. Mostly active on SEA weeknights (GMT+8) though weekends is fair game, so I'd appreciate a guild that does bossing runs around that schedule! I have bossing experience up until Kalos if it matters so I won't be dead weight (except for seren lol, still practicing on her)",
            "Apply to Rapid! Were all over in terms of progression and we offer plenty of help and support. Culvert and flag race isnt required. Also add me, I love helping new people out! IGN: PopStokes",
            "Lf anyone to play the game with casually.\n\n\nIm willing to start a new character on any server.\n\n\nI have a few low levels but cant remember the server.\n\n\nIve the game installed but havnt launched cause i dont wanna do this solo. \n20+ \n\nDm if youre down."
        ]
    },
    "Delivered from Michael Jackson's grasps, AB's now retain base skin color on transform. WE ARE FREE-HEE!": {
        "title": "Delivered from Michael Jackson's grasps, AB's now retain base skin color on transform. WE ARE FREE-HEE!",
        "score": 155,
        "url": "https://i.redd.it/npdhzfo7mf9d1.png",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Holy shit this only took 2 weeks?\n\n(Also for some people who think I'm being sarcastic, 2 weeks is actually a very fast turnaround time from \"feature requested\" to \"implemented and released\" for a project this size and age).",
            "That's so cool! Thanks nexon!",
            "Ngl, I got tired of being pale.",
            "Can't believe I actually sang FREE-HEE in the accurate tone.",
            "This is honestly great news! I'm in shock this even got through to the higher ups and they actually changed it!",
            "That's what it's like when the project actually has a director who's given free reign and don't hate players. Imagine being a MSEA or CMS player in 2024 lmao",
            "what did you mean by this?",
            "This should be a bug, because applying a skin change to the transformed form doesn't change it, now it's always using the untransformed skin.\n\nIf you wanted both skins to default to what you picked at the character creation that's fine, but now people who deliberately changed their transformed skins (or untransformed to be different from transformed) aren't getting what they paid for.",
            "Looks worse now",
            "Calm down confederate"
        ]
    },
    "I’ve been banned": {
        "title": "I’ve been banned",
        "score": 210,
        "url": "https://www.reddit.com/r/Maplestory/comments/1dqza48/ive_been_banned/",
        "content": "Folks, let me tell you something, it's really unfair what's happening. MapleStory, great game, tremendous game, they've banned me for a week. Can you believe it? Unbelievable. No reason, no explanation, just a ban. I've been playing hard, making MapleStory great again, and they do this to me. But you know what? We'll get through it. We'll come back stronger. Maybe in a week, maybe sooner, and we'll make MapleStory great again. You watch.",
        "num_comments": 42,
        "comments": [
            "The Champion's club has your back. You're not fucking going anywhere. They want you to disappear... yeah fucking right. Can't wait for your explosive return next week. Boom. Firmly gripped handshakes all around. Take the extended vacation with the family and come back with a heavy weight off your shoulders. Lemme hear some war cries. RRRRRAAAAUUUULLL",
            "You forgot to void your bowels in the middle of your ban appeal.",
            "Yeah but what's your golf handicap?",
            "Greatest game ever some say, maybe even the best that will ever be. Many people are saying this, they say \"well Maplestory, riding on the boat to orbis is phenomenal. So great it's so well done. Nobody has ever complained about Balrogs.\"",
            "Ill be honest. I bug abused and bought out the entire shop. I was FULLY expecting to be banned. ",
            "Anyone else read this in Trumps voice? ",
            "i didnt play on a 6 handicap it was an 8. 8 amelwlal i have you know how many i wha- how huh?",
            "YER GAWD DARN RIGHT ",
            "The corrupt Biden administration is behind this ban.\n\nIt's a witch hunt!",
            "i currently am taking a break at least for another decade or so :)"
        ]
    },
    "Anyone else take today off to chill & Maple just to for it to be MaintenanceStory?": {
        "title": "Anyone else take today off to chill & Maple just to for it to be MaintenanceStory?",
        "score": 129,
        "url": "https://www.reddit.com/r/Maplestory/comments/1dqvsrp/anyone_else_take_today_off_to_chill_maple_just_to/",
        "content": "i'm so sad",
        "num_comments": 45,
        "comments": [
            "After reading this comments; Dont let anyone make you feel bad bro, if relaxing and playing maple is your jam. Hell relax and play some maple. You dont owe your job anything. I wouldnt call off for maple but I have called off for absolutely no reason other than gathering my thoughts on the couch. People are so weird about what you call out of work for.",
            "Youd think a subreddit about a game would understand. Nothing wrong with taking time off to do what you enjoy. I left work early for the mushroom game bro. Im sad too ",
            "i went out and touched grass because I knew it was a maintenance day",
            "i work from home =). thank fuck",
            "No, I don't take days off for this game.",
            "Jokes on you, I play while at work.",
            "Same used my PTO just for there to be 2x maintenance",
            "I heard a bunch of people decided to do a week break from maple to enjoy the summer outside and socialize with friends. Its a trend",
            "No I would never take off to play maple.",
            "I love the chill mindless grind after work man. Totally get the chill part. Itll be back up bro enjoy the relaxation."
        ]
    }
}