{
    "MapPorn Discussion Thread for June, 2024": {
        "title": "MapPorn Discussion Thread for June, 2024",
        "score": 16,
        "url": "https://www.reddit.com/r/MapPorn/comments/1d7j3b0/mapporn_discussion_thread_for_june_2024/",
        "content": "This thread is for general MapPorn discussion. Exchange ideas, ask for maps, talk about cartography, etc. Have a thought that doesn't fit in another thread, post it here.\n\n",
        "num_comments": 28,
        "comments": [
            "I'm interested in creating a map. I've drawn it out in detail already in Google My Maps. I used GMM as it allowed me to trace rivers and mountains easily, whilst seeing settlement positions. I was wondering if anyone knows if there's a way of using these shape drawings with some software to create a simple map - as print screening isn't very practical. Google My Maps allows exports to KML and KMZ files which could be useful. Would appreciate any directions.",
            "Hi there I got suggested to come here to try spread my subreddit about maps. This sub redded is for anyone who enjoys walking and or maps so if you do maybe come have a look. We are only a very small sub right now but will hopefully become bigger soon. The sub does mainly focus on osmaps (Ordnance Survey) but any maps are well come. So if your interested come have a look at r/osmaps and I'll see you there",
            "Can someone do a map of the 1992 democratic presidential primary results in congressional districts? Especially the NY Primary because that was a weird one.",
            "I have been using google mymaps to build a list of places I want to go to in my area. Actually using the my maps feature in google maps is extremely buggy. Is there a alternative map app I can add my own places to thats not cluttered?",
            "Long story. But Im trying to draw my own small town fictional map. Are there any free map drawing tools available. This would be for a reference page to a fictional mystery novel a friend is writing. Essentially, it would not need to be hyper detailed; just to layout roads, and major story points and the town center. Any input would be appreciated. Thanks everyone!",
            "Can anyone point me towards good, free data sets for making maps please?",
            "Can anyone point me towards good, free data sets for making maps please?",
            "What are the best starter map making tools/ how do you make your maps? Thanks in advance!",
            "Looking for a county level blank map of the US and Canada.  I can find them separately, but never combined.  If Mexico is included, that's fine.  \n\nDoes anyone have any tips for finding this?",
            "Hello! First time poster who is looking for a good place to purchase maps in a variety of styles, countries/regions, and sizes for a relatively cheap price. My goal is to use the maps I find as a backdrop to a craft project shadow box for displaying travel souveniers. Since I'm going to be \"crafting\" with them, I don't want to spend too much money, but I do want a certain asthetic as the end product will be used for decorative purposes. Does anyone have a recommendation for online stores where I might be able to find what I need? I've been anxious to start this project for a while, so the sooner I can get started the happier I will be!! ![gif](emote|free_emotes_pack|snoo)Thank you for any help the community can provide!"
        ]
    },
    "Migration of millionaires in 2024": {
        "title": "Migration of millionaires in 2024",
        "score": 290,
        "url": "https://i.redd.it/ce63rcavng9d1.png",
        "content": "Net movement of millionaires in 2024\n\nSource: visualcapitalist",
        "num_comments": 78,
        "comments": [
            "Why are millionares leaving UK are they afraid of sunak or what",
            "What's Japan doing so differently than S. Korea?",
            "To quite Princess Leie\nThe harder you squeeze with taxes, the more millionaires will slip through your fingers.",
            "What about the Caribbean? NO way was it zero.\nLots of tax havens",
            "We need to eat them. Fuck the rich.",
            "It seems that more \"left\" than \"arrived\" and I suspect that difference is a good measure of the smartest ones; if no one knows your net worth, they won't try to tax, steal or sucker you out of it.",
            "I ask the real question. Why has China a  ,  but not the others? And why is it an  ,  and not a  . ?",
            "So once you become a millionaire in Africa, it is time to leave...",
            "So China is the real winner?",
            "This map perfectly illustrates both how economies of various nations are doing and how business-friendly they are"
        ]
    },
    "Countries that allow people to change their gender on official documents": {
        "title": "Countries that allow people to change their gender on official documents",
        "score": 3678,
        "url": "https://i.redd.it/vc4jdfde8c9d1.png",
        "content": "",
        "num_comments": 748,
        "comments": [
            "pakistan said T without the LGB",
            "Illegal in Thailand and Philippines ",
            "Surgery is no longer required in Japan as of 2022.",
            "AFAIK that's outdated.\nIn Germany you can change your gender two times a year now.",
            "In Argentina you can even change your gender to X, no questions asked",
            "Shouldnt Greenland follow Denmarks rules here?",
            "wow i had no idea south america was leading the world in terms of trans rights",
            "Sweden has recently changed their law too. With the Conservative Party changing it to no longer require a medical diagnosis.",
            "I think is legal now in Venezuela",
            "As always, Latin American countries really seem to get behind LGBT legal rights."
        ]
    },
    "Origin of each US state name": {
        "title": "Origin of each US state name",
        "score": 2695,
        "url": "https://i.redd.it/yuc6pgbt0c9d1.jpeg",
        "content": "",
        "num_comments": 364,
        "comments": [
            "I guess Henrietta Maria was born in France but she was Queen of England, Scotland and Ireland by her marriage to Charles I which was why Maryland, an English colony, was named for her.",
            "I really hate that people always attribute NY being named after a person because it was named for the Duke of York. As if Duke of York was the guy's name and not the title saying what place he ruled. \n\nThis isn't a criticism of OP, it seems like that's the general consensus. I just hate it",
            "Maine was a region in France, which makes sense because there was a French presence there historically.",
            "Idaho: some guy made it the fuck up",
            "Tennessee was derived from a Cherokee settlement named Tenasi so the map is right about that.",
            "Ummm what indigenous tribe was Indiana named after again?",
            "Rhode Island could've been a different colour.",
            "Shouldnt New York be red like New Jersey and New Hampshire?",
            "Rhode Islands etymology is uncertain. The claim that the Dutch Adriaen Block named it after red clay shores is obviously untrue because Rhode Island has no such clay deposits.",
            "The origin of Idaho is known. It was made up."
        ]
    },
    "How long for an English speaker to become proficient": {
        "title": "How long for an English speaker to become proficient",
        "score": 363,
        "url": "https://i.redd.it/pd5l8k84te9d1.jpeg",
        "content": "",
        "num_comments": 136,
        "comments": [
            "Is Japanese really harder to become proficient than Mandarin/Cantonese? Genuine question",
            "my uncle went to south korea in the 90s, my other went to japan. they talked about all the time how korean is easier to read and write but harder to speak, and the opposite for japanese. i think its because korean is so phonetically different from english, and japanese has so much written symbols",
            "I never understood why Uyghur is Cat V when Uzbek is Cat IV and the exact same",
            "Interesting that even though English is very influenced by French and most of its similarities to Latin languages is due to that French influence, French is the hardest Latin language for an English speaker to learn",
            "Its nice to finally see a map on this topic which doesnt just focus on Europe",
            "Important to highlight that these estimates are for full-time study at the Foreign Service Institute by people admitted based partly on their linguistic aptitude.",
            "I have experience trying to learn Spanish, French, German, and Japanese... I dunno about anything else but relative to each other those difficulty levels seem about right.",
            "I would think Korean would be easier than Mandarin since it uses an alphabet that can be learned fairly quickly and is also phonetically easier for English speakers than Mandarin is.",
            "That's a pretty interesting map right there!",
            "Is Tibetan really easier than Mandarin or Arabic? Or even Hungarian/Mongolian"
        ]
    }
}