{
    "Map games will be allowed as long the OP follows top comment": {
        "title": "Map games will be allowed as long the OP follows top comment",
        "score": 62,
        "url": "https://www.reddit.com/r/mapporncirclejerk/comments/1c5xjd1/map_games_will_be_allowed_as_long_the_op_follows/",
        "content": "Posts that don't follow up or don't do what the most upvoted comment said will be removed and the OP will be banned for 7 days.\n\nPlease help make this rule enforceable by snitching on map changing game fraud",
        "num_comments": 11,
        "comments": [
            "Who has lost this non-hypothetical war",
            "If someone removes Mongolia from the map they are banned from the sub and simultaneously made moderator",
            "We live in a society",
            "Just made a post related to this and saw this post and I had this reaction\n\n![gif](giphy|KxhWj5grlueu9ajWXw|downsized)",
            "Why do all map games have to go by top comment?",
            "Because half the people hate those posts, the other half loves them. But pretty much everyone agrees it's stupid if the OP randomly decides to just ignore the top comment. At that point it's not a map game, it's just daily spam from a person who does whatever they want.",
            "Yeah, but if an OP says from the beginning that they're for example going by 2nd most upvoted comment and they always do it, how is that random?",
            "The rule is meant for cases where the OP doesn't do what they said in the title (which is almost always \"most upvoted...\"). It's not meant to tell people what to post, just to ensure OPs follow whatever they said they'd do and don't pick random comments instead.",
            "boo just ban them",
            "hi"
        ]
    },
    "Why don't we do this? Are we stupid?": {
        "title": "Why don't we do this? Are we stupid?",
        "score": 2430,
        "url": "https://i.redd.it/y0fab3bskd9d1.png",
        "content": "",
        "num_comments": 404,
        "comments": [
            "I had this idea when I was 12",
            "I thought we decided in 1776 that we dont want the British to decide our politics.",
            "Shouldnt it be flipped since Democrats are considered left and republicans considered right? Thus democrats take the left side of the contiguous US and republicans the right?",
            "I don't think the west coast or the south would appreciate that solution.",
            "Ah the one country two systems policy - China would be proud",
            "there would be mass exoduses with mass violence like when india and pakistan got independence",
            "The amount of people in the comments either not understanding or poorly re-explaining the joke is killing me ",
            "Medieval Turkic states be like:",
            "Dont let anyone from Texas see this",
            "Those halves are the wrong way"
        ]
    },
    "Why dont these people just eat? Why do they make this their entire identity?": {
        "title": "Why dont these people just eat? Why do they make this their entire identity?",
        "score": 149,
        "url": "https://i.redd.it/mta0rgf4rh9d1.jpeg",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Austria stole their food years ago",
            "Akkor bassza meg a kurva anyd egy vagonnyi nemibeteg csimpnz",
            "People in the Midwest can't say this country's name without it sounding like they are offering a meal.",
            "Its be a lot easier if they bordered Turkey.",
            "Their food got stolen by the treaty of trianon",
            "And mocking a God of millions so openly he is not a pest!!!",
            "I'm missing the A being beiged out, where it just reads Hung ry",
            "They wanted to order more food, but someone said \"Czech please!\"",
            "For the same reason that makes Uruguayans assume you're a homosexual if you ask them \"Where are you from?\"",
            "Theyre not Hungary, theyre just bored"
        ]
    },
    "Why did Ethiopia let these random af countries have all its coastline? Is it stupid?": {
        "title": "Why did Ethiopia let these random af countries have all its coastline? Is it stupid?",
        "score": 2338,
        "url": "https://i.redd.it/6s3vicrrwc9d1.png",
        "content": "",
        "num_comments": 81,
        "comments": [
            "Playing the long game against rising sea levels.",
            "Transporting an Ethiopian to sea level will result in acute oxygen toxicity.",
            "It went on a diet and took a little off the sides and round the middle. Very svelt now.  In great shape.  Maybe in the best shape ever. Won two club championships.",
            "The Ethiopian government has not paid me any money to tell you that yes they have always dealt very kindly with seperatists and other dissidents and gave up the land which is now Eritrea freely after being asked politely :)",
            "theyre about to start a war to say yes",
            "Absolutely hilarious that Ethiopia is landlocked despite trying desperately to have a coast",
            "compared to the questions that normally get asked on that sub I feel like this somewhat valid vs the normal \"why don't people live in this desolate wasteland\" \n\nattacking into the coastal lowlands from the elevated areas of the ethiopian interior would be a strategic advantage no?",
            "Why dont they just dig a canal around Djibouti, are they stupid?",
            "Bosnia and Herzegovina enters the chat",
            "I can see the colour behind each letter"
        ]
    },
    "I've done it. I've solved the Middle East.": {
        "title": "I've done it. I've solved the Middle East.",
        "score": 103,
        "url": "https://www.reddit.com/gallery/1dr8fj9",
        "content": "Truly this is peace in our time!",
        "num_comments": 20,
        "comments": [
            "why did landlockistan give all of its coastline away? is it stupid?",
            "Why isnt the Republic of Batman the Kingdom of Armenia-Kurdistan-Palestine?",
            "Cockblockistan is such a big ass JERK.",
            "Finally a non hypothetical war post",
            "You solved war with war so it is unwar.\n\nSolved ",
            "As a citizen of Brazilian Lebanon, I can confirm I need my own country",
            "I am loyal to the republic of batman",
            "Don't let the Turks see this",
            "It's perfect in that it will piss off absolutely everybody. I love it.",
            "Wtf am i looking at"
        ]
    }
}