{
    "Map games will be allowed as long the OP follows top comment": {
        "title": "Map games will be allowed as long the OP follows top comment",
        "score": 59,
        "url": "https://www.reddit.com/r/mapporncirclejerk/comments/1c5xjd1/map_games_will_be_allowed_as_long_the_op_follows/",
        "content": "Posts that don't follow up or don't do what the most upvoted comment said will be removed and the OP will be banned for 7 days.\n\nPlease help make this rule enforceable by snitching on map changing game fraud",
        "num_comments": 11,
        "comments": [
            "Who has lost this non-hypothetical war",
            "boo just ban them",
            "If someone removes Mongolia from the map they are banned from the sub and simultaneously made moderator ",
            "We live in a society",
            "hi",
            "Just made a post related to this and saw this post and I had this reaction\n\n![gif](giphy|KxhWj5grlueu9ajWXw|downsized)",
            "Why do all map games have to go by top comment?",
            "Because half the people hate those posts, the other half loves them. But pretty much everyone agrees it's stupid if the OP randomly decides to just ignore the top comment. At that point it's not a map game, it's just daily spam from a person who does whatever they want.",
            "Yeah, but if an OP says from the beginning that they're for example going by 2nd most upvoted comment and they always do it, how is that random?",
            "The rule is meant for cases where the OP doesn't do what they said in the title (which is almost always \"most upvoted...\"). It's not meant to tell people what to post, just to ensure OPs follow whatever they said they'd do and don't pick random comments instead."
        ]
    },
    "Who would win this hipotetical war?": {
        "title": "Who would win this hipotetical war?",
        "score": 2547,
        "url": "https://i.redd.it/tmr046prkz7d1.png",
        "content": "",
        "num_comments": 147,
        "comments": [
            "Cobrastan",
            "glory to Arstotzka",
            "For thinking that it's even debatable, we are subtracting $5 from your pay this month\n\nGlory to Arstotzka",
            "Arstotzka on top, no Kolechian army could ever crush us!",
            "Not the guy working border security, that’s for sure.",
            "Not Canada",
            "Arstotzka would win war, arstotzka us greatest country in the world. Don't even need a passport in arstotzka",
            "that was a very nice game.",
            "FOR KOLECHIA *minecraft creeper*",
            "Wait\n\nI never realized it was like Balkans."
        ]
    },
    "European Countries coloured by how embarrassing it is for an American to not be able to identify it on a map": {
        "title": "European Countries coloured by how embarrassing it is for an American to not be able to identify it on a map",
        "score": 333,
        "url": "https://i.redd.it/sj20j8eyc28d1.png",
        "content": "",
        "num_comments": 51,
        "comments": [
            "Red would win. It's not even close why did you even ask",
            "Here's a template to make your own a little more easily: https://i.imgur.com/cxac1hy.png\n\nI'm aware I didn't infill every little island. Call that No Data.\n\nThe challenge I'm imagining here when figuring embarassment is that the American test subject is given a country name, then asked to point to it on a map. But my reckoning for the inverse game (point at map, asked to name country) is roughly similar.\n\nUkraine was previously in the green category for me, but since the war I'm bumping it up a notch.\n\nAnd for the record I'm Canadian, the American/European bastard child with the worst of both worlds.",
            "I know Bosnia because it has no beaches",
            "Considering I'm an American and I could for certain name almost every single one, I suppose I am not in the common category.",
            "Europe is the only continent besides North America that I can name every country in with no issue. I’m ashamed",
            "As a Brit I could name and place every country on this map, but I’m not sure I could do the same in Central America so it works in reverse too!",
            "Fuck me I know all these countries except the red one between Germany, Italy, Spain, Belgium, Switzerland, Andorra, Monaco and the UK. Am I stupid???",
            "If you pointed to Kaliningrad, most Americans would not be able to tell you who it currently belongs to.",
            "As an Australian I can comfortably say 90% of our native-born population wouldn't have a clue where most of the countries in Europe (or Africa or South America!) are actually located. It's not something taught in schools, rather learned if you are specifically interested in it.",
            "American here. Why is there no border for Andorra on this map?"
        ]
    },
    "I asked 1 person from every U.S. state how many grandparents they had": {
        "title": "I asked 1 person from every U.S. state how many grandparents they had",
        "score": 27,
        "url": "https://i.redd.it/p2cu5fwtq38d1.png",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Sweet home 🏡"
        ]
    },
    "Who would win this hippothetical war?": {
        "title": "Who would win this hippothetical war?",
        "score": 75,
        "url": "https://i.redd.it/bhlf1xx8w18d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Blue has home court advantage. But take it from any history book.. red team always wins",
            "Hasbro",
            "The one that strikes first."
        ]
    }
}