{
    "MapPorn Discussion Thread for June, 2024": {
        "title": "MapPorn Discussion Thread for June, 2024",
        "score": 15,
        "url": "https://www.reddit.com/r/MapPorn/comments/1d7j3b0/mapporn_discussion_thread_for_june_2024/",
        "content": "This thread is for general MapPorn discussion. Exchange ideas, ask for maps, talk about cartography, etc. Have a thought that doesn't fit in another thread, post it here.\n\n",
        "num_comments": 16,
        "comments": [
            "I am in the market for a decent globe. I didn’t realize light-up ones were a thing until I started looking. \n\nI’m leaning towards [this one](https://replogleglobes.com/product/odessa-blue-12/) at the moment. \n\nAre Replogle globes a decent brand? Any other suggestions? Budget around $100 ish. Main things I’m looking for are: blue oceans, political boundaries colored (filled in preferably) and good construction. I’ve seen some where the seams are misaligned, etc., and don’t want that.",
            "Hi there I got suggested to come here to try spread my subreddit about maps. This sub redded is for anyone who enjoys walking and or maps so if you do maybe come have a look. We are only a very small sub right now but will hopefully become bigger soon. The sub does mainly focus on osmaps (Ordnance Survey) but any maps are well come. So if your interested come have a look at r/osmaps and I'll see you there",
            "I'm interested in creating a map. I've drawn it out in detail already in Google My Maps. I used GMM as it allowed me to trace rivers and mountains easily, whilst seeing settlement positions. I was wondering if anyone knows if there's a way of using these shape drawings with some software to create a simple map - as print screening isn't very practical. Google My Maps allows exports to KML and KMZ files which could be useful. Would appreciate any directions.",
            "Can someone do a map of the 1992 democratic presidential primary results in congressional districts? Especially the NY Primary because that was a weird one.",
            "I have been using google mymaps to build a list of places I want to go to in my area. Actually using the my maps feature in google maps is extremely buggy. Is there a alternative map app I can add my own places to thats not cluttered?",
            "When I was a tween I found a really comprehensive atlas of Normandy battle maps all drawn in the same style--the style seen in [this website](https://battlearchives.com/products/operation-bagration-1944-battle-map) selling maps.\n\nObviously not getting a huge print of one map, but I was wondering if anyone knows either what book I'm talking about, or, in the alternative, what this style of map is called (it seems super common) and how to search only publications that use this style.",
            "Long story. But I’m trying to draw my own small town fictional map. Are there any free map drawing tools available. This would be for a reference page to a fictional mystery novel a friend is writing. Essentially, it would not need to be hyper detailed; just to layout roads, and major story points and the town center. Any input would be appreciated. Thanks everyone!",
            "Can anyone point me towards good, free data sets for making maps please?",
            "Can anyone point me towards good, free data sets for making maps please?",
            "What are the best starter map making tools/ how do you make your maps? Thanks in advance!"
        ]
    },
    "Most Common Nationality other than Germany in German Bundeslander": {
        "title": "Most Common Nationality other than Germany in German Bundeslander",
        "score": 1280,
        "url": "https://i.redd.it/9q4lbvcaf28d1.png",
        "content": "",
        "num_comments": 180,
        "comments": [
            "Romanians in Bavaria really surprised me.",
            "The colors of the map tell me something else\n\n![gif](giphy|VI2LPOUgoxIqdFDK4N|downsized)",
            "Nationality is written like an adjective: German, Turkish, Ukrainian, Romanian, Syrian\n\nNation of Origin is a noun: Germany, Turkey, Ukraine, Romania, Syria",
            "Being a Romanian, I find it hard to believe that there are more of my nationality than, say, Poles or Czechs in SE Germany",
            "babe wake up, new partition of Germany just dropped ",
            "Ä is ae. If you can't write Bundesländer because you lack that umlaut on your keyboard, write Bunseslaender.",
            "Bundesländer*",
            "What's the source used for this map?",
            "This is why Bayern the richest and most prosperous 😎 🆒️ 😎  💪 💪 💪 💪",
            "Data source? Year?"
        ]
    },
    "GDP (PPP) per capita by country in Europe (OC)": {
        "title": "GDP (PPP) per capita by country in Europe (OC)",
        "score": 1563,
        "url": "https://i.redd.it/tutj4r8r6z7d1.png",
        "content": "",
        "num_comments": 404,
        "comments": [
            "Always fun to see Ireland in these maps.",
            "So Spain reversed the sorpasso of Czechia and Lithuania?",
            "r/portugalcykablyat",
            "Didn't know we Italians are basically at the UK's level. Except we got an Euro 😎",
            "I don't know how accurate this is, but on all these maps about GDP/capita Ukraine and R. Moldova are always fighting for the last place. Which is sad really.",
            "Oh yes, Ireland. Huge GDP, meanwhile no one can actually afford to buy a house",
            "In eastern europe you can see a clear difference between EU member states and other countrys",
            "Ireland is weird since starting positions at one of the big five consultant firms with a master degree earns you less than you get working at a construction belt for a car company in germany, is this because big tech companies have their HQ there and the managers raise it so dramatically ?",
            "Do you have maps for the rest of the world with the same colour scheme? (Please)",
            "Italy is at the same level of UK?"
        ]
    },
    "Per County, Is Its Largest City Its County Seat?": {
        "title": "Per County, Is Its Largest City Its County Seat?",
        "score": 280,
        "url": "https://i.redd.it/1xdrawqp418d1.png",
        "content": "",
        "num_comments": 88,
        "comments": [
            "The four red counties surrounding Indianapolis all have seats in the center of the county but the biggest towns/cities are those that directly border Indianapolis .",
            "Fun fact: Lansing, Michigan is the only state capital that isn’t also its county’s seat",
            "The fuck is going on in Connecticut?",
            "The lime green background sucks",
            " Well, isn't that a fun fact! In most cases, the largest city in a county is indeed the county seat. It's like the big cheese of the area, calling the shots and all that jazz.",
            "Dauphin County PA is wrong FYI - Harrisburg is both the largest city and county seat (in addition to being the state capital) so should be green.",
            "The Virginia one is a mess. There are no “cities” in any county. And some counties are green when they have a town as their county seat, but nearby census designated places are much larger. \n\nTo top it off (and this is weird, ik because all cities are independent of counties in Va), some county seats aren’t within the county but a city which used to be a town within that county before gaining city status—and those are still labeled incorrectly.",
            "Scotts Bluff county Nebraska, county seat is Gering (pop approx. 8200) largest city is Scottsbluff (approx. 17,000)",
            "What the fuck is a county seat, I’ve lived in ct my whole life and I just recently moved to mass",
            "“That map is a nice shade of grey.” - says 1/4 of the male population who is red/green colorblind…."
        ]
    },
    "Largest lake in each European country by surface area": {
        "title": "Largest lake in each European country by surface area",
        "score": 3617,
        "url": "https://i.redd.it/y2h0qpdaxw7d1.jpeg",
        "content": "",
        "num_comments": 553,
        "comments": [
            "Czech Republic: no access to sea or ocean, tiny lakes",
            "You mean largest lake entirely within the country ? Otherwise for example it's the lake Geneva for France and Switzerland (580km2)",
            "A fun fact, the largest lake in the Netherlands used to be a gulf until it was separated from the sea with a dam",
            "Lake Konstanz belongs partially to Germany, Switzerland and Austria. Did you count the whole area for Germany or just the area that is part of the country?",
            "Fun fact: the largest lake in Europe (Lake Ladoga, 17800 sqkm) doesn’t appear on this map as it’s eclipsed by Baikal in Russia, whose territory also encompasses Ladoga.",
            "Damn Spain, why so dry",
            "The Russian one (Lake Baikal) contains between 1/5 and 1/4 of the world's fresh surface water. \n\nI'm completely shocked by that fact.",
            "Time to move the afsluitdijk to beat Finland.",
            "Scandinavian countries are still on the process of deglacierization and the only place on Earth where sea levels are decreasing, so nothing surprising they have so many lakes and islands than elsewhere.",
            "Fun fact: The one for the UK is on the island of Ireland."
        ]
    }
}