{
    "Monthly Marriage Survey Post for June: Performing academic research about marriage or parenting? Link to it in this thread": {
        "title": "Monthly Marriage Survey Post for June: Performing academic research about marriage or parenting? Link to it in this thread",
        "score": 2,
        "url": "https://www.reddit.com/r/Marriage/comments/1d5r7e0/monthly_marriage_survey_post_for_june_performing/",
        "content": "We get many requests to gather data for important academic and scientific research that we've decided to collect them in one place. For valid scientific and university studies and surveys, please introduce yourself, post information about your study, where it will be published and what will be done with the data--and then provide your link in this thread! And for the members in this sub, this gives you an opportunity to take a survey or two and pass along your feedback.\n\n[Last month's surveys were posted here](https://www.reddit.com/r/Marriage/comments/1chmrtp/monthly_marriage_survey_post_for_may_performing/).",
        "num_comments": 5,
        "comments": [
            "**\\[Academic\\] Seeking Research Participants: Study on Attachment and Relationships (18+, English Speaking, in a Relationship)**\n\nI'm Elouise, an undergraduate research assistant for a dissertation study at Fielding Graduate University conducted by Julia Catlin, Ph.D Candidate in Clinical Psychology. The study is titled **“Exploring the Effects of Secure Base Script Knowledge and Reflective Functioning on Rejection Sensitivity in Adults.”**\n\nThe study involves a two parts: 1) **completion of a 15-20-minute background questionnaire** and 2) **a** **20–30-minute virtual interview** with a research assistant. The interview will consist of a storytelling exercise and asking questions that reflect on past events of your life.\n\n**Inclusion criteria:** \n\n* 18+ years old\n* In a Relationship\n* English Fluency\n* Willing to do a two-part study, including a brief interview and online background questionnaire\n* Military, Long-Distance Relationships, 2SLGBTQIIA+, and ENM/Poly all encouraged to participate.\n\nOne of the benefits of this study as a participant is to share and reflect on their experiences to develop a greater awareness of their relationships with others. One of the tasks of the study is to complete a storytelling task that can utilize the participant's creativity, which many find enjoyable! Another benefit of the study is contributing to research that could help develop interventions for people who are struggling with problems in their relationships, depression, anxiety, traumatic stress, and emotional reactivity.\n\nThe confidentiality of each participant will be maintained through the use of pseudonyms, removal of identifiable information from transcripts, and all study materials will be stored in locked and password-protected spaces. Participation is voluntary, and participants may withdraw from the study at any time without consequence. Informed consent procedures will be followed. If you are interested, click the link below.\n\n[https://fielding.az1.qualtrics.com/jfe/form/SV\\_3rAOoyLmNvbQDKm](https://fielding.az1.qualtrics.com/jfe/form/SV_3rAOoyLmNvbQDKm)\n\nResearch Assistant: [elouise@calm.science](mailto:elouise@calm.science)\n\nPrincipal Investigator: [jcatlin@fielding.edu](mailto:jcatlin@fielding.edu)",
            "**Did you purchase your wedding stationery from Etsy? \\[PLEASE READ\\]**\n\nHi, I am Lucy and I am currently studying for my digital marketing master's degree at university. I am looking to recruit participants for my dissertation project which is researching the consumption behaviour of brides-to-be when purchasing wedding stationery products on Etsy. The eligibility criteria to be a participant is as follows:\n\n* You are a woman\n\n* You have made a purchase of a wedding stationery product from Etsy ON or AFTER 1st November 2020 (This product will have been bought for use at your OWN wedding but your wedding does not have to have happened yet!)\n\n* You would be comfortable taking part in a text-message based interview over WhatsApp that would last no longer than one hour\n\nAny information I collect from you will be made non-person identifiable by using pseudonyms, will be securely stored, and used only for research purposes.\n\nIf you fit ALL of the criteria and are interested in taking part please drop a comment below and I will provide you with some more details. Also any questions, ask away! It would be so helpful! Thank you :)",
            "[Academic] Conducting research on Coercive Control. \n\nI am a researcher from The University of Salford conducting a study titled Investigating the potentiality of an “Extent of Coercive Control Universal Scale” - an exploratory study as part of my master’s programme dissertation in the Psychology of Coercive Control (supervised by Dr Rod Dubrow-Marshall). \n\nThe purpose of this study is to develop and validate the 'Extent of Coercive Control Universal Scale,' a tool designed to assess experiences of coercive control in different environments such as domestic situations, workplaces, cults, and human trafficking scenarios. My aim is to refine this scale to ensure it is reliable and effective for identifying if coercive control exists and presents similarly across different contexts, thereby contributing to better support and interventions for affected individuals.\n\nI am seeking participants who have experienced coercive control in any environment to complete three short questionnaires to contribute to this study.\n\nFor more information about the study, please visit https://app.onlinesurveys.jisc.ac.uk/s/salford/extent-of-coercive-control-universal-scale\nThank you for considering this request.\n\nBest regards, Kacey Baker K.baker7@edu.salford.ac.uk",
            "Hello! We are conducting a research study titled \"**Exploring Critical Marital Issues: Surveying Urgent Challenges in Marriage**\". This study aims to identify the primary problems that couples are keen to address in their marriages.\n\nTo participate in our survey, kindly click on the following link: [https://forms.gle/6a5ArBWyQZyh8eh49](https://forms.gle/6a5ArBWyQZyh8eh49)\n\nPlease note that we prioritize your confidentiality by employing pseudonyms, excluding any identifiable information from transcripts, and securely storing data for research purposes only.\n\nThank you for your participation!",
            "Hello! We're currently conducting a research study titled \"Navigating Financial Waters: Understanding Marital Challenges with Money\". Our goal is to **identify the primary financial problems couples are eager to resolve** in their marriages. Rest assured that **your confidentiality is our top concern**.\n\nTo take part in our survey, please click on this link: [**https://forms.gle/puzqXELKiigqFsRE6**](https://forms.gle/puzqXELKiigqFsRE6)\n\nThank you for participating! ✨"
        ]
    },
    "My (28F) best friend (28F) kissed my husband (27M) and it’s destroying me. ": {
        "title": "My (28F) best friend (28F) kissed my husband (27M) and it’s destroying me. ",
        "score": 427,
        "url": "https://www.reddit.com/r/Marriage/comments/1dqszie/my_28f_best_friend_28f_kissed_my_husband_27m_and/",
        "content": "I (28F) have been with my husband (27M) for six years, married for four years, and we have two kids (3F, almost 1F). Everything in our relationship is perfect for us. He’s the best husband and father to our kids that I could have asked for. I am absolutely in love with him and his actions and words have always shown me that he feels the same way. There’s no better feeling than going to sleep in his arms every night.\n\nLast weekend, my husband and I had some friends over and we were having a barbecue. We were all outside in the backyard, surrounding my husband who was on the grill. As the food got closer to being ready to eat, we all started sitting at our backyard table. Once the food was all ready and at the table, my husband went inside to use the washroom and get another case of beer. I didn’t realize that my best friend (28F) had followed him. When he was coming back out, my best friend hid behind the wall separating our kitchen and living room and surprised him by pulling him and forcing a kiss. My husband immediately pushed her back and yelled wtf. She immediately started crying and ran out of the house and left. My husband came back into the backyard and asked to speak to me privately and immediately told me what had just happened. I was shocked and told him that it would be okay and that we could talk after everyone else left. I managed to put on appearances for the next couple of hours but I was mentally distraught.\n\nAfter everyone left, my husband sat me down and told me what happened and showed me the footage from our living room camera. It was exactly as my husband has described it. My best friend of 10 years, the person who I treated as my literal sister, forcibly kissed my husband. After the third date with my husband, she was the one I told that I was going to marry him. She knows how much I love him and how strong our relationship is and still she chose to try to come in the middle. For fuck’s sake, our 3 year old calls her “Aunty”. \n\nMy best friend tried showing up the next day “just to talk” and my husband had to hold me back from beating the shit out of her and he kicked her out and told her to not come back. It’s been almost a week now and I’m nowhere close to moving on. I don’t blame my husband one bit. He’s completely innocent in this and if anything, he’s the victim. I’ve been lying down on my husband’s chest and just crying every day and night. I’m so angry and frustrated and don’t know what to do. My husband has been amazing and like always, he just gets it and understands how I’m feeling. He brought me flowers almost every day and cooked my favorite meals multiple times in the last few days. I love and appreciate him all the more for it. I just don’t know how I’m going to move on and trust any of my friends again after this.\n",
        "num_comments": 175,
        "comments": [
            "Has she said why she did it? Although it doesn't matter I would never talk to her again but I am curious as to why she would throw away your friendship like that. Your husband sounds like a good guy. Sorry that you have to deal with this.",
            "What she did was beyond wrong.  Your husband is obviously not the type to play games or entertain fools.  You should be happy for that and the obvious fact that he loves you. Now concerning this woman.  I think you should completely ghost her.  Don't be surprised if she tries to lie to others about what happened.  Good luck it will take time to get passed this.",
            "Commenting on the other comments in this post, it's astounding to me that the spouse immediately objected to the assault and immediately told OP and showed her video proof so she knows he's telling the truth and there are *still* people in this thread that are immediately jumping to \"he's having an affair and trying to hide it\", and are getting significant support/approval.\n\nLike, this is insane, please describe to me what would have had to go differently in this encounter for you to *not* immediately jump to the spouse is having an affair?",
            "I hate to be the guy who thinks there must be more to this story, but something just doesn't ring 100% true to me here. Other commenters have raised the thought that  they have had an affair and she was not aware of the cameras. He might be trying to get ahead of it by doing damage control. Maybe he led her on, even if it was out of naiveté, trying to be kind but sending mixed signals. Cheating would explain why he is buying you flowers and cooking for you, love bombing you to secure forgiveness. I won't dwell on this, but it is possible.\n\nLet's look at this from another perspective that I rarely see brought up in posts like this:\n\nIf everything is 100% as described here, your husband was sexually abused, and has had no ability to deal with his trauma because he is taking care of you. You are suffering, and you have every right to be upset. This will sound harsh, but for the good of your relationship with your husband,  quit being selfish, and allow your man to deal with what happened to him. He was assaulted in his own home. Be there for him.\n\nYour post sounds like you are so focused on how YOU feel, that you have not considered how HE feels. He is a good man to focus on you. He will likely never tell you how he feels after this, because he will default to taking care of the woman he loves. This is not healthy, and will cause resentment. He will feel like he can never feel emotion, because you are teaching him that your feelings matter more than his,\n\nBe there for him, even if he says it is not a big deal. Don't force him to talk about it, because he probably won't, but make sure he knows that he is your rock star. Love and treasure him, let him know you are there for him. It will mean the world to him, even if he never shows it.",
            "Was she wasted?  Seems like a very odd thing to do.  I think you want to talk to her, and you should.",
            "You have a great husband.\n\nPlease keep the proof. \n\nIs she single?\nDo you hang around in the same circles?",
            "There is definitely missing info here. There’s no way someone just does that out of the blue",
            "plot twist : She isn't your friend. Sorry that happened. You know who to cut out of your life.",
            "Living room camera?",
            "Wow.... I mean... Yeah, I don't blame you. That's such a huge betrayal and will take a lot of time to get over. I would honestly look into therapy because this is the type of thing that can seriously mess with your outlook on life and you don't want it to damage your relationship with others just because she's clearly a messed up person. \n\nOf course, my number one thing would be to never let her back in your life ever again. She cannot be trusted around your family. There is no excuse for what she did and while there would be part of me that would want to know what the hell she was thinking, you're likely not going to get the truth from her lips. She assaulted your husband, she betrayed you as a friend and she didn't even have the backbone to stick around and explain herself. There's nothing to save there. That friendship is dead in the water and I'd honestly have that recording ready to go to make it clear to any mutual friends exactly why you're not accepting her in your life anymore."
        ]
    },
    "People who did marriage counciling, what was a 'WTF DID YOU JUST SAY' moment?": {
        "title": "People who did marriage counciling, what was a 'WTF DID YOU JUST SAY' moment?",
        "score": 164,
        "url": "https://www.reddit.com/r/Marriage/comments/1dqrvrm/people_who_did_marriage_counciling_what_was_a_wtf/",
        "content": "For marriage counseling or couples therapy... did you have a moment where your spouse said or did something that was truly shocking? How did the therapist react? I always heard the gloves come off in couples therapy.",
        "num_comments": 178,
        "comments": [
            "“I don’t know why I’m here; I’m just here to support her and her depression issues or whatever. There’s absolutely nothing wrong with me and if she just let me smoke weed whenever I wanted we wouldn’t have problems. It’s a part of my personality, there’s nothing wrong with me but she refuses to accept that.”\n- From the fat mouth of a manchild narcissist ex-husband\n\n😑",
            "My ex husband said \"I thought you liked getting gaslit. You didn't tell me to stop\"",
            "I had a “what the fuck did you say” moment at the COUNSELOR when she suggested there is a “spectrum” of consent and that I was failing to effectively tell my partner whether I was feeling “no” or “hell no”",
            "My ex said it was my fault he was an alcoholic because I got cancer and that was scary for him and he had to step up and do everything at home while I was bedridden during treatment.\n\nWhich would be bs if true but dude. My friends, I first mentioned his drinking was out of hand TWO YEARS before I was even diagnosed.\n\nTwo. Years. SMH. The man's ability to make up facts and rewrite history is so impressive he should be Trumps speechwriter.",
            "More of a moment towards the therapist, rather than my husband. \n\nGoing through counselling right now. One of our issues is that my husband couldn't prioritize me because his priority is always his parents. I get left behind all the time, and always takes the back seat whenever his parents are around. It's become a big issue and I'm on the verge of asking for a divorce. I suggested marriage counselling, husband agrees to go with me. And the therapist told me \"maybe you need to change your perspective on things. You don't have to be number one for the marriage to work\". Lol. Husband is content with that sentence (which is also a WTH moment...he knows we're going through this counselling because of this exact issue). I'm enraged. I'm searching for a new therapist.",
            "My counselor was telling me to get over my ex- husband soliciting prostitutes, it had only happened a month prior.\n\n“If you forgive him, forgive him.” 😅 Like, what. I am here trying to learn how and you’re telling me to just do it? A month after it happened?",
            "My divorce was just final today, and OH BOY do I have some stories. \n\nAbout a year ago, I took him out to dinner for his birthday. I went all out: fancy restaurant, nice three-course meal, etc. I even did the typical \"order a secret cake slice\" move with the waitstaff. We get through the meal. They bring out the cake. He barely takes two bites of it. They package it up for us and we take it home as leftovers. \n\nFor ELEVEN DAYS, this slice of cake sat in the fridge, untouched. 11 DAYS. After eleven days, I start to nibble at it a bit each day. I paid for it, I like cake, he clearly wasn't touching it, so YEAH, I started nibbling at it. I didn't want it to go bad, it would've been money down the drain. \n\nFast forward a few weeks. We're sitting in one of our marriage counseling sessions. And GUESS WHO brings up the fact that I ate the cake........ \n\nOf course, he left out a bunch of context as he sat there spinning this tale to the therapist. I was painted as some fat b**ch that unjustly ate his birthday cake. \n\nI filled in the gaps to the therapist. \n\nFast forward about six months. I'd been separated from him for about three months at this point. I was doing my weekly grocery shopping, and happened to walk by the bakery section. I spotted one of those huge, fat, thick slices of cake that is basically a mini cake unto its own. BOOM. Easiest purchase ever. I enjoyed every morsel of that cake for dinner that night. \n\nI'm also planning to celebrate with more cake tonight. 😎🎉",
            "When I called out a bold-faced provable lie, the therapist began to educate me on “his reality” vs. “my reality”. I informed her that I had a recording of the conversation he was referring to and she still claimed that my reality is not the universal truth. \n\nTherapy doesn’t work for liars.",
            "It was more what they didn’t say when I said I felt like they didn’t care about me anymore. They said nothing. The therapist asked what he thought about what I said and he said nothing. That was the end of that.",
            "I didn’t go back to our marriage counsellor after he, off the cuff, referred to me as a basket case in an example. I was suffering from complicated grief, depression and anxiety (I’d had depression and anxiety since I was a child) all of which I was having separate therapy and taking medication for. I couldn’t believe a therapist would use the term “basket case” to refer to one of their clients, to their face. It felt like he was trying to make a lighthearted joke to get my husband on side but it was just inappropriate. I didn’t say anything, just never went back. Husband and I are happily married 17 years later."
        ]
    },
    "My husband comforted me while I was having an emotional meltdown. ": {
        "title": "My husband comforted me while I was having an emotional meltdown. ",
        "score": 55,
        "url": "https://www.reddit.com/r/Marriage/comments/1dqz6n3/my_husband_comforted_me_while_i_was_having_an/",
        "content": "I 54(M) have been with my husband for 22 years. I am stating this to avoid confusion. I am a man who’s married to a man. Recently I lost my hair due to autoimmune issues. I tried everything to keep my hair. I was fed up with nothing working so I cut it off. We had plans to have family over tonight. I was feeling insecure about my head. I had an emotional meltdown because I was scared of family seeing me like this. \n\nMy husband saw this and hugged me. He grabbed my hand and took me upstairs to our room. He laid with me in bed and snuggled me.  He told me, “You look hot as you are. I don’t care about you being bald. Being bald doesn’t make a person ugly or weird. Bald men and women are beautiful. Your family loves you so much.” I ended up sobbing and my husband kissed me on my forehead. My husband loves me so much and I love him. His love is the best I’ve ever known. ",
        "num_comments": 8,
        "comments": [
            "This is so sweet, sorry you are going through everything you are. I am happy you have a wonderful husband to support you. Hugs and hope you are feeling okay 🩵🩵🩵",
            "I'm so happy to read that for you two. I'm sorry that you're going through any type of hardship period but I'm again happy for your support here.\n\nIn 2022-2023 I was put on medication that made my hair fall out and a lot. I'd run my fingers through my hair and a handful of hair would fall out and follow. I would shower and the drain would be completely covered and would barely drain properly with the water filling up a good inch of my shower flooring. I was miserable but I know my biggest insecurity was losing any attractiveness that my husband may of had for me.",
            "❤️",
            "He’s such a sweet man. I love him so much. Our younger son loves my bald head. He tells me that I look cool.",
            "I’m sure you looked beautiful.",
            "I certainly did not feel beautiful but he's still with me so I guess I didn't bald that badly. My hair has grown back and I'm grateful",
            "You have a good husband. I’m sure even if you were completely bald, you would still look gorgeous.",
            "Thank you. You have a great one too."
        ]
    },
    "Lingerie Surprise ": {
        "title": "Lingerie Surprise ",
        "score": 72,
        "url": "https://www.reddit.com/r/Marriage/comments/1dqswy9/lingerie_surprise/",
        "content": "Longtime lurker here, first time poster. \n\nAdmittedly, we have had a lot of growing pains, many circumstantial, and we continue to have them. We clash a lot, he’s extremely logical and analytical, where I am highly emotionally intelligent and more sensitive. At the end of the day, though, we love each other fiercely and we are a constant work in progress, but we never fail to let our love be first.\n\nSo we tend to have sex anywhere from 1x/week-3x/week, more if we have extra days off from work. We love to make love, fuck, every which way our (currently chonky) bodies will allow. All in all, we have a healthy sex life, I surmise. \n\nLast night, while my husband was out of the house, I opened this jar that I made him 7 years ago that was filled with tiny sheets of paper with things I loved about him. This was so needed for my heart because I have felt a bit disconnected from him lately, just due to misunderstandings, miscommunications and the sort(our growing pains). I decided to put some sexy lingerie on underneath my work clothes that I still had on. He got home, we had dinner, watched tv, etc.-I had it on the whole time, he had no idea. \n\nWe stood up to do something(idk get some cookies or something) and he said “oh you gotta see this…” and got his phone to show me something. That’s when I decided to take off my shirt and say “Well you’ve gotta see *this*”. \n\nInstantly hard, instantly had his hands all over me, told me I was so sexy, so hot, that it was so sexy that I had it on the whole time I was sitting next to him. Had amazing, passionate *missionary* sex. Sometimes you really can’t beat the feeling of kissing and twirling your tongues while he’s deep inside. Ya know? \n\nAnyway, our marriage has been kinda hard the past few years(lost my sister, his grandpa, his uncle, my uncle, my mom, who we took care of in her final days) from grief, he had to set hard boundaries with his parents(didn’t talk to them for a year), losing our soul dog, and just, in general, discovering we both have some poor emotional behaviors due to trauma we both need to deal with on our own, so, with all of that said……it was a breath of fresh air for us and I have been looking forward to seeing him all day because I know he’s been thinking about our hot moment last night. \n\nI really wanted to share for a few reasons, mainly because I wanted to share a perspective that maybe, if you’re feeling some type of way, reread any letters YOU wrote about/to your spouse, or anything that might take you back in time to when your love was young and fresh and new. That is like a soft reset for me. I will be doing it at least every couple months from now on. ❤️",
        "num_comments": 12,
        "comments": [
            "I love this for you guys!  So sweet…and super hot. I hate you’ve gone through so many losses in such a short time.",
            "This is beautiful. I'm glad you've found a way to remember your love, congratulations! :)",
            "You’re doing it right 👍. That’s what “working” at a marriage looks like.",
            ">Sometimes you really can’t beat the feeling of kissing and twirling your tongues while he’s deep inside. Ya know? \n\nNo!\nBut I'm happy for you.",
            "This is cute and hot! Congrats on the sex!",
            "Wow my ex never talked about me that way man u know I wasn't loved just used",
            "[deleted]",
            "I like to eat",
            "Thank you so much ❤️",
            "Thank you : ) I have lots of stuff to refer to, I don’t know why I’ve never thought to reread stuff we’ve given/sent each other, even my journals. Crazy how when you’re with someone for so long you(or at least me) sorta forget some little things"
        ]
    }
}