{
    "What Martial Arts Works Best in a Street Fight?": {
        "title": "What Martial Arts Works Best in a Street Fight?",
        "score": 267,
        "url": "https://www.reddit.com/r/martialarts/comments/15klc9x/what_martial_arts_works_best_in_a_street_fight/",
        "content": "Please understand that this question is asked [EVERY SINGLE DAY](https://www.reddit.com/r/martialarts/search/?q=street%20fight&restrict_sr=1&sort=new) on this subreddit. Please refer to rule #3 of this sub. There is no simple answer to this question.\n\nThe answer is as follows:\n\n**Do not get into street fights.**\n\nSelf-defense is not just about hurting an aggressor; it's about avoiding violent people and situations first, and diffusing them second. Fighting is the last resort. There are tons of dangers involved with fighting, not just for yourself, but for the aggressor as well. Fighting can lead to permanent injury, death and criminal and/or civil litigation. Just don't do it. Virtually all conflicts can be resolved without violence.\n\n**Combat sports have been proven highly effective in real life fights.**\n\nIf you want to learn martial arts so you can effectively defend yourself in a situation where all other attempts to resolve the conflict have failed and the aggressor has physically attacked you, your best bet is to have training in actual fighting. Your best bet is a combination of a proven effective striking art and a proven effective grappling art. Proven effective striking arts include, but are not limited to: Boxing, Kickboxing, Muay Thai, Sanda, Savate, Kyokushin Karate and Goju Ryu Karate. Proven effective grappling arts include, but are not limited to: Brazilian Jiu Jitsu, Freestyle Wrestling, Catch as Catch can, Sambo and Judo. Mixed Martial Arts gyms usually teach two or more of the above arts and usually a combination of them as well.\n\n**Free sparring and training with pressure and resistance are the hallmarks of a good martial arts school.**\n\nRegardless of which martial art you are practicing, the most important thing is not what you train, but how you train.  A little Taiji or Aikido may be useful for someone encountering violence. Is it the most effective strategy in the octagon? No, but would Aikido or Taiji help prevent street fight injuries? Maybe. Many martial arts can work very well as long as you train to use them properly. You can practice a technique in the air or on a compliant partner every day for hours, but when it comes to a real fight, if you haven't practiced it against a noncompliant partner who is trying to retaliate, it will more likely than not fly right out of the window the second you get into a real fight.\n\n**Don't train martial arts to prepare for a hypothetical fight that will probably never happen.**\n\nTrain martial arts because you enjoy it. Train a martial art that you enjoy.",
        "num_comments": 69,
        "comments": [
            "I'd say a mixture of boxing and wrestling. I don't wrestle, but I'd wish that I did if I ever got into street fights. The wrestlers in my MMA gym always take me down and beat me up when they get sick of me kicking their legs during sparing. lol",
            "im a muay thai fighter for 5 years now and i can easily say if u wanna learn how to defend yourself in the street boxing is the best sport to learn. since in a street fight you are not typically using your kickboxing or muay thai shorts you are typically using jeans or ordinary shorts and you cant really kick that well if you are not comfortable but with boxing you can can fight anytime you could be wearing anything at the bottom and top. im not saying other martial arts are also not effective infact i would say the 2nd best is muay thai esp the elbows is super effective at close range, but for me if u just wanna learn how to defend yourself boxing is my 1st recommendation and 2nd is muay thai.",
            "Best martial art in a street fight is the martial art of sprinting & then long distance running. If you can't do those then BJJ is easily number one if you are close enough to make contact with me.",
            "Boxing ,you will do road work so u can run the fuck away",
            "I do drunk kangaroo boxing naked",
            "boxing, and if you have some extra time some basic clinching/wrestling wont hurt",
            "I’m my opinion kickboxing, and bjj.",
            "What was your rationale for including Goju ryu?",
            "That's a good way to summarize it!",
            "Track and field. 100m dash to your car hopefully"
        ]
    },
    "Why Was My Post/Comment Removed ": {
        "title": "Why Was My Post/Comment Removed ",
        "score": 20,
        "url": "https://www.reddit.com/r/martialarts/comments/1bqvvsy/why_was_my_postcomment_removed/",
        "content": "We're getting dozens of these questions daily and in our Modmail, and in the case of 99% of the instances it's our Automod. Basically if you have a new account, a flagged account, don't subscribe here, etc., the Automod will flag your post or comment for manual approval. You didn't do anything wrong, it's just a protective measure we utilize due to how large this sub is. It's not personal, and you didn't do anything wrong, it's just a necessary function to protect the content and purpose of r/martialarts\n\nIn the event the mod team removes your post or comment there will be a note telling you why it was removed and in some cases a remedy on how to fix it. \n\nPlease don’t send us messages asking why your post was removed or to approve your post. We go through the queue at regular intervals to review and approve posts and comments that were flagged. Trust the process.  If you still decide to send us a modmail after seeing this, well you're banned",
        "num_comments": 9,
        "comments": [
            "The posts here have been getting increasing neurotic and obsessive. We’re probably removing more than approving, and a lot of the questions could be answered with a simple Google search",
            "A sub can only stay unmoderated for a limited amount of time before the Admins delete them. If they’re deleted you could start them over. If they’re still around and unmoderated there is a request process you can do to take over",
            "What you’ve just said is one of the most insanely idiotic things I have ever heard. At no point in your rambling, incoherent response were you even close to anything that could be considered a rational thought. Everyone in this room is now dumber for having listened to it. I award you no points, and may God have mercy on your soul.",
            "You should really take some time off and reflect on what you posted. We are all dumber for having seen it, and it really lowers the bar for this community. We're not mad, just disappointed\n\nLol",
            "thank you and understable.",
            "Every single day someone asks what art works best in a street fight. They get removed because of the redundancy. If they looked for a minute they'd find posts already asking the same question.",
            "It sucks when you have an 8 year old account removed, make a new one, and it's back to hazing phase. Even had a few subs gone and I assume there's no way to get them back (how does unmoderated subs come back, like who determines this?).",
            "[removed]",
            "[removed]"
        ]
    },
    "Karate Combat just showed us a mean Knockout": {
        "title": "Karate Combat just showed us a mean Knockout",
        "score": 867,
        "url": "https://v.redd.it/sienjragjf9d1",
        "content": "",
        "num_comments": 72,
        "comments": [
            "Is he pointing at that guy or is there something sticking out of his glove? Mouth guard?",
            "To think there are actually people who think the double kick lacks power.",
            "Machida was the person who made me believe that Karate was legit as a combat style. I grew up wrestling and had a couple run-ins with kids who did karate. We weren't very old, but I handled them just fine. Ever since then, I kinda scoffed at karate. Ignorant, I know.  Especially since there were so many phony movies growing up, which made me think it was silly to learn karate. \n\nI would like to see this guy in the octogon.",
            "Vick has been knocked out too many times now",
            "Not sure if intentional but making the set up kick look like a leg kick is slick as hell",
            "Timing and power behind it was insane. Double kick did dominate in this situation! Dominate!!!",
            "Vick’s chin is made out of pixie dust 😭",
            "Suddenly all years of karate training for dignity and discipline leave the room.",
            "Great knockout. James Vick needs to stop fighting.",
            "That ref looks like an older mario yamazaki🤣"
        ]
    },
    "Kicks to end them all": {
        "title": "Kicks to end them all",
        "score": 1054,
        "url": "https://v.redd.it/tvp6wyj25c9d1",
        "content": "",
        "num_comments": 60,
        "comments": [
            "Man, I fucking love low kicks",
            "What’s the defense against this? Dodge don’t get hit?  Keep weight off the front leg?",
            "2nd dude walking like me when I emerge from the bathroom after an epic 45 minute shit.",
            "Wait you can just kick the shit outta someone who drops to pull guard like that? Why doesn't everyone just do that in that situation? Sorry if this is a stupid question.",
            "What's happening to the person holding the back of his knee / quad? Is that just a pain issue?",
            "I feel the same way after sitting on the toilet for too long",
            "In terms of combat sports, its almost wholesome to see someone win by knockout without causing a traumatic brain injury",
            "Superbon should be in there. Destroyed both Petrosyan and Ozcan with one kick.",
            "Is there a rule that says you can't target the knee directly?  Because I could see some of those kicks just tearing up a knee.....",
            "Why the attacker leg doesn't hurt as well?"
        ]
    },
    "Why are boxing coaches so rude ?": {
        "title": "Why are boxing coaches so rude ?",
        "score": 16,
        "url": "https://www.reddit.com/r/martialarts/comments/1dr9wfj/why_are_boxing_coaches_so_rude/",
        "content": "Hey everyone hope you're doing good\n\nSo I did boxing this year and even had 2 smoker fights. It was good and I learned a lot but I see myself more as a martial artist than a boxer so I'm moving on to something else next year. Probably kickboxing or going back to BJJ.\n\nIn fact the trainers were extremely close minded and used to take verbal jabs at other martial arts during drills and all. Like one time we were doing close up body work drills and one of them was saying \"look each other in the eyes we don't turn our back like those MMA clowns\". Lots of remarks like that which I found very silly.\n\nAlso one of the coach - the same one - was rude AF. He shows a combination one time and if you mess it up he yells and screams \"You call that boxing ! I call that garbage !\". Or put his head in his hands and sighs loudly like he's going to  kill himself next. Gives you disgusted looks if you mess up during a drill. When we do footwork drills if you mess up he gets angry and screams like a madman. And after the training session he becomes normal and chill again. \n\nI'm sure people will say I'm soft and should take it on the chin etc. but I trained Judo, Wrestling, BJJ, Taekwondo and some Kickboxing (but without the leg kicks) and no coach ever acted that agressive with beginners. On the contrary they always tried to teach us with good explanation and showed the moves again if we mess up something. My son does MMA for children and the coaches are not like that even with the adult class.\n\nI asked a friend who is an amateur boxer and going to become pro this year and he told me his coach insults him and tells him he should stop boxing and he's just an adopted orphan (he never knew his father) and he told me it's normal because in boxing there are actual deaths in the ring so the coaches do that to toughen you up mentally.\n\nAm I crazy to think it's not ok and it doesn't actually do anything to toughen you up ? It's just garbage coaching IMO. \n\nPlease share some wisdom with me and tell me if I'm wrong because one of the reasons I'm moving on from boxing is this type of coaching attitude which I find over the top. I'm closing on forty year old and have 3 kids I don't need a coach insulting me for a leisure sport activity. Is it misplaced ego from my part ? I find it's just wanting an healthy environment but maybe I need a reality check I don't know.\n\nThanks to all",
        "num_comments": 51,
        "comments": [
            "Different strokes for different folks.  What he’s doing sounds fine, it just might be bad fit for you.  Obviously, not all boxing coaches are like that",
            "You can definitely find tamer gyms that are more professional, and that’s fine if shit talking bothers you. But honestly what you described would not put me off the gym. The fact the coach is chill afterwards just shows that it’s for motivation. Don’t take it so seriously. I’m British and train in Germany. My coach was this ancient German who used to yell all sorts of shit about the Queen at me. I just laughed about it. It’s all in good fun.",
            "All the coaches at my gym are super positive, funny people who also happen to hit hard and move like lightning. Being a good boxer, a good coach, and a total dick are independent qualities from each other.\n\nAre there other gyms in your area?",
            "I mean maybe it's because I was in the Army but I see a lot of coaches online acting hard to \"toughen up\" their fighters and I'm skeptical of the training value. There is certainly a place for harshness particularly if they're a competitor, doing it to survive, or more likely being an idiot.\n\nIf the training isn't hard or valuable then the attitude isn't going to compensate for gaps in training quality. People used to think that hazing rituals or being dick would make your Soldiers/Fighters more capable and it really doesn't work like that, you might get some endurance out of the them but the violent attitude you want is just built by training. On the other hand it's boxing there is culture of 'roughness' that is undeniable. I would just say that if you're a coach or trainer make sure you're coaching or training before you start pretending to be Mighty Mick or R. Lee Ermey.",
            "I'll preface this by saying that I coach TKD to literally all ages (preschoolers to pensioners). I was taught to never\\* do what you're describing. The asterisk is there because the rule can be broken if you have a good relationship with the student in question and you know that they'll respond well to it. I know I can say 'come on, that kick's sloppy' to specific juniors I teach and they'll immediately laugh and correct themselves, but for others they take it much worse. Your coach MAY be taking this too far, or what's more likely is that he's just passing on what his coach did to him because 'that's the way it's done' or because of some other backwards logic. If you feel insulted as a grown man vote with your wallet and find somewhere else to train. Martial arts should be a positive experience, don't surround yourself with people who make it a chore.\n\nEdit: Just reread your paragraph about your amateur boxer friend and holy shit I would personally not stick around with that coach. Being tough mentally doesn't equate to being able to take insults.",
            "I had a bloke tell me in a boxing class that MMA and \"all that shit\" doesn't work, because he'd \"just bite them or stand up and throw them off him\". \n\nIt's ignorance, that's all it is",
            "Humans learn best in a flow state, find a coach that helps you get there.",
            "Boxing still suffers from the old school idea of being very machismo and over the too. Kinda grounded in their old ways. It's designed to be very cutthroat and it shows in culture and fights. For example in sparring they really go at it and try to hurt each other instead of a practice fight like it should be. ",
            "That's far from rude 🤣 oo boy... toughen your skin up. If that hurts your feelings. What if your opponent if verbally abusing you trying to get under your skin etc......",
            "I’m just going to ask. What region do you think this guy is from? He sounds similar to a judo teacher I had."
        ]
    }
}