{
    "Interested in joining the Mod team at /r/marvelstudios? Apply using the form linked below!": {
        "title": "Interested in joining the Mod team at /r/marvelstudios? Apply using the form linked below!",
        "score": 27,
        "url": "https://www.reddit.com/r/marvelstudios/comments/1d36x9c/interested_in_joining_the_mod_team_at/",
        "content": "#[Link to application \\(via Google form\\)](https://forms.gle/XrB8PNT6zUMiWDqT7)\n\n\nAny responses will be completely anonymous and will not be visible to anyone outside of the mod team.\n\n--\n\n---\n\n--\n\nHey everyone! We're currently looking for a handful of community members to join our moderator team! To help improve the state of the subreddit, we are looking for users that are willing and determined to crack down on the reddit-wide trends of spoilers, low effort posts, reposts, and leaked content.\n\nWe need all potential candidates to be regularly active and good-natured users in order to best assist the community and the current mod team.\n\n--\n\n-------\n\n--\n\n**Normal moderating duties include:**\n\n- checking the mod queue (where the reports are)\n\n- responding to mod mail\n\n- removing rule breaking comments/banning users (including untagged spoilers and leaks)\n\n- helping with pinned discussions/threads\n\n- possibly helping with graphic design/snoo/css stuff\n\n--\n\nThe job is not the most glamorous, and you will need to have a bit of thick skin as users will undoubtedly call you a Disney shill and other insults from time to time. However-- if you enjoy the subreddit and want to help keep it running, this is a good way to do it.\n\n--\n\n**To be clear, this is a volunteer position and is NOT affiliated with the actual companies of Marvel Studios and/or Disney entertainment.**\n\n--\n\nSubmissions will be open for at least a few weeks, or until we accumulate a decent-sized application pool.\n\nUse the links below if you need help with the timezone questions:\n\n - [Find out your timezone here](https://www.timeanddate.com/time/map/)\n\n - [Convert your local time to UTC here](https://www.timeanddate.com/worldclock/converter.html?iso=20210413T200000)\n\n--\n\nIf you have any questions about the form or about moderating the sub, just ask below!\n\nThanks a bunch!",
        "num_comments": 14,
        "comments": [
            "What is the time commitment like?",
            "paid?",
            "Have you chosen yet?",
            "I'm curious, have you guys gotten a decent amount of applications yet?",
            "[removed]",
            "Ok",
            "I would say a few hours a week. We ask each of our mod members to contribute roughly 300 actions per month-- which could sound like a lot, but it could be 10 a day, or like 20 a day every other day... you get it. And the actions are like, remove a comment, remove a post, approve a post, etc. It's totally stuff you can do if/while you find yourself doomscrolling reddit daily\n\n\nNo one will ask you to mod every day, but the goal is to have everyone contributing consistently, so everyone individually can spend a little less time on it\n\n\nObviously a little more attention is needed during release periods",
            "i wish (no, this is a volunteer position)",
            "Not yet! We will probably leave the application up for at least one more week",
            "Thanks!"
        ]
    },
    "I got Loki'd. ": {
        "title": "I got Loki'd. ",
        "score": 401,
        "url": "https://i.redd.it/arfun904r28d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "That's Loki pretty great.",
            "I wanna get Loki'd.",
            "Pegging isn't new for you anymore",
            "Sylvie’d*",
            "As someone who hasnt seen Loki its kinda funny that i know you more than the actor",
            "Shes so hot!",
            "She hot 🔥",
            "You got pruned from your time line.",
            "Shane Gillis after partnering with bud light",
            "[deleted]"
        ]
    },
    "Benedict Cumberbatch has officially confirmed that filming for 'Avengers: Part V' will start next year.": {
        "title": "Benedict Cumberbatch has officially confirmed that filming for 'Avengers: Part V' will start next year.",
        "score": 1621,
        "url": "https://x.com/jordnjnes/status/1804181087641292994",
        "content": "",
        "num_comments": 203,
        "comments": [
            "So a late-2026-2027 release date is the closest we can hope for if everything goes smoothly.",
            "It’s going to be awesome to see the Avengers team up!!! Dr. Strange and… um…",
            "aVengers",
            "Would be kinda cool if they actually called it Avengers: Part V. A throwback to the likes of Back to the Future.",
            "Guessing Strange and Falcon are going to be the leaders in Part V?",
            "Who is the villain supposed to be? All build up kind of died in regards to Kang.",
            "I think they should slow down and don't count their chickens before the eggs hatch. What about Blade, Shang-Chi 2, Wonder Man, Armor Wars, Spider-Man 4, or Vision Quest? They still haven't filmed any of these except Wonder Man, yet they have been supposed to have come out before Avengers 5. If I were them, I would just delay Avengers and make sure to get the house in order before fully committing to it.",
            "About fucking time. Even with the Covid and strike delays, Marvel took way too long to make another avengers movie.",
            "I know I haven't particularly kept up with watching the MCU, but what exactly is worth a team-up right now? Why would all these massively scattered heroes even team-up?",
            "I really hope some Eternals cast can be in it (Druig, Makkari, Thena, Sprite, etc...)! Us fans need a win!"
        ]
    },
    "I made a concept poster for Spider-Man 4!": {
        "title": "I made a concept poster for Spider-Man 4!",
        "score": 1015,
        "url": "https://www.reddit.com/gallery/1dl8xsj",
        "content": "",
        "num_comments": 138,
        "comments": [
            "This is so cool",
            "Where are all the giant floating disembodied heads?? Didn’t you go to poster school??",
            "Damn! Super sick. I miss spidey web slinging around New York.",
            "This is great!",
            "Amazing work！！ Another !",
            "Goes hard",
            "Nice!",
            "Nice!",
            "wow this is really good!",
            "His web connects them all"
        ]
    },
    "I drew Wolverine and Deadpool.": {
        "title": "I drew Wolverine and Deadpool.",
        "score": 232,
        "url": "https://i.redd.it/9f5pl17l108d1.jpeg",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Great job! I would watch this show…",
            "This animated style looks familiar.",
            "That's great. It has a Cartoon Network look to it.",
            "Looks fantastic!",
            "gives ren and stimpy, in a good way",
            "He should've gone for the balls",
            "Dexterpool?",
            "Bad days",
            "Clone High",
            "Yes, it reminds me of Dexter’s Lab!!"
        ]
    }
}