{
    "Weekend Free Talk and Index Thread - New and fresh every Friday!": {
        "title": "Weekend Free Talk and Index Thread - New and fresh every Friday!",
        "score": 29,
        "url": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/1dl5q9k/weekend_free_talk_and_index_thread_new_and_fresh/",
        "content": "[](https://i.imgur.com/eKZXttG.jpg)\n\nWelcome to the Weekend Free Talk and Index thread!\n\nYou can post whatever you want here - unsubstantiated rumors you heard, fan theories, random shower thoughts, or even musings that are unrelated to the Marvel universe.\n\nAnything goes - please just follow the [Reddiquette](https://www.reddithelp.com/en/categories/reddit-101/reddit-basics/reddiquette) and **above all else treat each other and those that contribute to this subreddit with respect.**\n\nPotential points of interest:\n\n* [X-Men '97 - Official Discussion Index](https://www.reddit.com/r/MarvelStudiosSpoilers/comments/1cehvri/index_xmen_97_season_1_discussion_thread_index/)\n* [Echo - Official Discussion Index](https://www.reddit.com/r/MarvelStudiosSpoilers/comments/1925et0/index_echo_discussion_thread_index/)\n* [Madame Web - Official Discussion Megathread](https://www.reddit.com/r/MarvelStudiosSpoilers/comments/1aqa31x/worldwide_release_madame_web_official_discussion/)\n* [Previous Movie Megathreads and TV Show Discussion Indexes](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/movie-megathreads-and-show-indexes)\n* [MSS MCU Project Ratings](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/movie_tiers) (VOTED BY YOU!) - Make sure to vote during our project rewatches as well as in the new release megathreads.\n* [Archive of Stickied Posts](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/sticky-archive)\n* [Sub Wiki - Rules of the road](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/)\n* [Source Accuracy Tiers](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/source-accuracy-tiers) \\- Not sure what sources people consider trustworthy? Start here! (Note: This list changes and is not infallible - use this as a general guide only)\n* [Source Accuracy Database](https://docs.google.com/spreadsheets/d/1RpGBi4duCDeiXUtSh_1x15VJ67vPRZ1LWu6A3ieGTjs/edit?usp=sharing) \\- Our database designed to catalog scoops and provide accountability",
        "num_comments": 395,
        "comments": [
            "[Benedict Cumberbatch confirms that he will film an ‘AVENGERS’ movie next year.](https://x.com/NexusPointNews/status/1804176315735548269?t=k_u3Yk_xeANOtsk5eEqwXg&s=19)",
            "2024 is probably going to be the best year for superhero animation *ever*. \n\n*Invincible* season 2, *X-Men ‘97*, *My Adventures with Superman* season 2, *Suicide Squad Isekai*, *Batman: Caped Crusader*, *Creature Commandos*, *Eyes of Wakanda* and possibly even *Friendly Neighborhood Spider-Man* as well.",
            "[Don’t fuel my “Giancarlo is playing Paladin” theory anymore, the gods are pointing at it](https://x.com/classicmarvel_/status/1804188381376553066?s=46&t=zYcgLaa5LZGq3IgzlBR_wg)",
            "I feel like Avengers 5 is going to be a lot like Infinity War with everything going on. Sam will probably have his earth based team set up at that point (no I do not believe that Alex Perez tweet about Wong coming in to recruit Sam considering it was pretty clear in hindsight that AtlantaFilming was just speculating because Benedict was in Atlanta at the time), with Strange being confirmed his side is coming in as well, Wong has his team with Shang-Chi, Katy, Hulk and Carol.",
            "This might sound weird, but I feel like X-Men ‘97 portrayed Magento too favorably. Done get me wrong, it’s a good portrayal, because a lot of people haven’t watched the original series or read the comics, they’re  forgetting that this man openly calls for genocide on people he deems genetically inferior. He is in no ways a good guy. He’s Hitler if Hitler was created by Hitler and used that as a justification for his genocide. \n\nThe worst thing he does in ‘97 (disabling the power grid) is almost danced over. They don’t deal with the fact that he almost certainly killed millions of innocent people. Every car in the world crashed; every plane fell out of the sky; everybody on life support immediately flatlined; and they just ignore it. So people spout unironically “Magento was right” as if he isn’t completely insane.",
            "Reading Claremont/Cockrum's Uncanny X-Men run for the first time (really loving it). I'm surprised how much I like Banshee. He's the team's glass cannon: easy to take out in a fight, but his sonic blasts have more raw force than any other power on the team (until Phoenix appears).\n\nBanshee also acts as an older, world-weary rogue with a heart-of-gold: unafraid to call out Xavier/Cyclops' bullshit, but willing to die for his friends. This is normally Wolverine's role, but right now he's a trigger-happy psycho everyone hates. I'm guessing Banshee will eventually be written out of the book so Wolverine can grow into his role.\n\nI waffle a lot about wishcasting the MCU X-Men. But I wouldn't be disappointed if they just copied the Uncanny team: Cyclops, Storm, Colossus, Nightcrawler, Banshee, and Wolverine. Really fun dynamic.",
            "I’m sad about Blade no longer being set in the 1920’s. Aside from being a cool aesthetic alongside the alternate universe 60’s of the F4, since seeing the flashback in Eternals, I’ve been very intrigued by the past of the MCU. \n\nHaving Blade set in the 1920’s gave me the impression that they not only set up stuff for the future moving forward but also are building the historical past of the universe.\n\nIt would’ve been cool to see an Eternal or 2 pop up in Blade, a crossover happening before we followed the MCU in the modern world. There was that tidbit about the Eternals having helped the previous Avatar of Khonshu take down Ammit’s last avatar in the past but the idea was scrapped due to budget for Moon Knight. Which imho is unfortunate.",
            "[Ralph Ineson says that the script for Matt Shakman's 'THE FANTASTIC FOUR' is \"cool as fuck.\" \n](https://x.com/The_MovieDweeb/status/1804194197026611417)",
            "Please get Kendrick back for the BP 4 soundtrack, Coogler. 😢😢😢\n\nEdit: imma leave that 4 too. 😤",
            "While I enjoyed this season of *Doctor Who*, I can’t help but feel it was too short. 9 episodes (counting the Christmas special) just isn’t enough to get to know this Doctor and Ruby Sunday, compared to past seasons with ~13 episodes. That’s an almost 3 hour difference. \n\nSo is it wrong for me to say that for some shows, I’d rather have ~20 episodes seasons with lots of filler than 8, good episodes? For serialized shows (like Stranger Things) 8 episodes is plenty, but for episodic television like *Doctor Who* and *Star Trek*, 8-10 just isn’t enough."
        ]
    },
    "[Marvel Rewatch] X-Men: Apocalypse - Rewatch Discussion Thread": {
        "title": "[Marvel Rewatch] X-Men: Apocalypse - Rewatch Discussion Thread",
        "score": 45,
        "url": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/1czk6pm/marvel_rewatch_xmen_apocalypse_rewatch_discussion/",
        "content": "This week's rewatch is  ***X-Men: Apocalypse*** (2016). Feel free to share your thoughts on what you enjoyed and didn't like. Discuss the best and worst scenes, moments, quotes, characters, or ideas that resonated with you. Or, embrace the nostalgia and engage in some lighthearted \"release day\" shitposting. Respectful discussions are encouraged, so feel free to delve into anything and everything under the sun related to the film.\n\n \n\n***X-Men: Apocalypse*** is a 2016 American superhero film directed and produced by Bryan Singer and written by Simon Kinberg from a story by Singer, Kinberg, Michael Dougherty, and Dan Harris. The film is based on the fictional X-Men characters that appear in Marvel Comics. It is the sixth mainline installment in the *X-Men* film series and the ninth installment overall. It is the sequel to *X-Men: Days of Future Past* (2014) and stars James McAvoy, Michael Fassbender, Jennifer Lawrence, Oscar Isaac, Nicholas Hoult, Rose Byrne, Tye Sheridan, Sophie Turner, Olivia Munn, and Lucas Till. In the film, the ancient mutant En Sabah Nur / Apocalypse is inadvertently revived in 1983, and he plans to wipe out modern civilization and take over the world, leading the X-Men to try to stop him and defeat his team of mutants.\n\nThe film was announced by Singer in December 2013, with Kinberg, Dougherty, and Harris attached to develop the story. Casting began in October 2014, while principal photography commenced in April 2015 in Montreal and ended in August of the same year.\n\n*X-Men: Apocalypse* premiered in London on May 9, 2016, and was released in the United States on May 27, 2016, in RealD 3D, IMAX 3D, 4DX and Dolby Cinema formats by 20th Century Fox. The film received mixed reviews from critics. A sequel, titled *Dark Phoenix*, was released on June 7, 2019.\n\n&#x200B;\n\nListed below are examples of some previously ranked projects. \n\n* Tier S - Excellent - Avengers: Infinity War\n* Tier A - Very Good - Black Panther\n* Tier B - Good - Ant-Man\n* Tier C - Average - Black Widow\n* Tier D - Acceptable -The Incredible Hulk\n* Tier F - Unacceptable -Thor: The Dark World\n\n[**To see our current project tier ranking, including where X-Men: Days of Future Past ended up, click here.**](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/movie_tiers/)\n\n**What would your rank** ***X-Men: Apocalypse*****?**\n\n[View Poll](https://www.reddit.com/poll/1czk6pm)",
        "num_comments": 59,
        "comments": [
            "I’m considering watching this. After my X-Men 97 high, I was wrestling with the fact that I hadn’t seen the last few Fox X-Men movies. \n\nMe? A lifelong X-Men fan has skipped several live-action films? How could I truly let this be? Sure, the reviews had turned me away but I love the X-Men and have to see for myself. \n\n15 minutes into Dark Phoenix, I was rudely reminded of why I had abandoned the Fox X-Men universe, with few exceptions. There’s a lot that feels off but the way Mystique takes center stage is just bizarre as a longtime fan. Primarily because it doesn’t feel natural to the story, rather you can tell it’s a star power thing.\n\nSo is Apocalypse better?",
            "Some action scenes were really cool (especially the Quicksilver scene) and some of the performances were pretty strong, Fassbender’s being my favorite.\n\nMy big issue that the movie felt unfocused. I like when the X-Men don’t have a *sole* lead, but it felt like many of the arcs didn’t get much time to cook or get enough focus to feel satisfying. A lot of the time it feels like they’re fighting for screentime (still think the Weapon X plot was unneeded).\n\nI will say though, there were some neat brief character moments like Kurt praying for Alex or Peter joking with the others on the plane or the deleted scenes with the young cast at the mall.",
            "The action scenes where amazing in this movie especially the magneto awakening one",
            "EVERYTHING THEY BUILT WILL FALL!",
            "- Wolverine should’ve been one of the Horsemen and that’s how he gets the adamantium and comic suit/ mask in the new timeline.\nMaking him the product of the Stryker’s Weapon X program again fucks the significance of Stryker not being Stryker at the end of DoFP.\n\n- Giving the X-Men black armor that they randomly found at Alkali Lake was a braindead move. The movie was made in fucking 2016. They conveniently found a fancy black jet to go along with them too. \nThey should’ve found a way to have them wear the comic suits from the end earlier in the film.\n\n- Apocalypse was too big a threat for newbie X-Men in the 1980s. \n\n- I love that we got back to back X-Men films with musical continuity.\n\n- This was somehow a better Mummy movie than the one that came the following year staring tom cruise",
            "This movie had so much potential and they fucked it up. The way Wolverine was included really pissed me the fuck off. Why even bother with the little tease of Mystique as Stryker at the end of DOFP? Obviously, the implication was new timeline, new rules. \n\nApocalypse should’ve been the one that gave him the adamantium in this timeline. He didn’t even need to be a major character, just a horseman, handled with meticulous care to ensure he’s respected, but ensuring that the new characters get a chance to shine.",
            "This movie is rubbish, but has a couple of aspects that bring it up from F tier for me. \n\nMichael Fassbender is incredible, even if his story feels recycled. \n\nThe Quicksilver scene is fun but suffers from crazy tonal whiplash given that Havok dies in that scene. \n\nApocalypse is bad, though not as bad as Vuk. No villain is as bad as Vuk. \n\nThe best scene is the Wolverine scene, but it doesn’t make any sense with the ending of DOFP and that whole section of the movie feels inconsequential and out of no where.",
            "the horsemen should have been first class members so basically magneto, mystique, beast and alex summers\n\nI get angel is a known horseman but he's barely developed here I'd rather have him join the team",
            "There's a scene in this where magneto psychically talks to Charles and in the background Apocalypse is using his powers to put armor on archangel, full body, while psylocke stands next to him without pants. The movie has the worst costuming in the franchise the biggest issue of course being Apocalypse himself.  Sort of an ugly sonic situation:  everyone told them it was bad when it was revealed but they went ahead with it any way. The movie continues the worst I clinations of the franchise which is to include X-Men characters as like a checklist but without actually including anything meaningful about their characters or personalities.  It's especially sad when it comes to nightcrawler, who actually does look great in this, but can't come close to matching the heart alan cumming brought to the role.",
            "Uh. Jean uses the whole Phoenix thing against Apocalypse at the end, but in the next film, she dosen't seem have any of that going on until the incident with the space shuttle? Uh, ok."
        ]
    },
    "Ralph Ineson says that the script for ‘The Fantastic Four’ is “cool as fuck”": {
        "title": "Ralph Ineson says that the script for ‘The Fantastic Four’ is “cool as fuck”",
        "score": 629,
        "url": "https://x.com/the_moviedweeb/status/1804194197026611417?s=46&t=S4bfAHtB3ulQCj9viG4edA",
        "content": "",
        "num_comments": 84,
        "comments": [
            "The premise sounds pretty fun. \n\nWorld famous super family fails to stop eating alien from consuming their world, flees to another version of Earth where culture is completely different and you aren’t famous at all.",
            "This sounds like a guy who thinks the script is actually \"cool as fuck.\" Not the usual \"it is a great script, and we have a great director and great cast.\" This guy sounds genuinely excited.",
            "This is the first time I’ve heard Ralph’s voice and now I totally understand why he specifically was cast as Galactus.",
            "News has been so dry lately, I guess something like this is better than nothing",
            "That's probably because the Fantastic Four, when done properly, are cool as fuck.  \n\nIt's an incredible property that's been handled abysmally in movies.",
            "I can’t wait for the headline reading: breaking news: actor says script for upcoming movie he’s in is “fucking garbage”",
            "For all the Eric Pearson haters out there. ",
            "Really hyped but trying to keep my powder dry. The enthusiasm like this and small bits of insight we've had are super encouraging though. With the recent Marvel misfires, I think they are putting a lot of care into this film, especially as the premise/cast will be around for a while so it needs to be shit hot.\n\nI must say, the casting is so good thus far, personally it's impossible not to get a bit giddy.\n\nI look forward to promo once they've filmed. It's on par next year for how much I'm looking forward to Deadpool & Wolverine this year.",
            "Ralph Ineson as Galactus? I couldn't be more excited. I've always hoped he'd go get himself some bigger roles",
            "W!"
        ]
    },
    "Benedict Cumberbatch seemingly confirms that he will be filming Avengers 5 next year.": {
        "title": "Benedict Cumberbatch seemingly confirms that he will be filming Avengers 5 next year.",
        "score": 702,
        "url": "https://x.com/jordnjnes/status/1804181087641292994",
        "content": "",
        "num_comments": 252,
        "comments": [
            "Marvel thinking they could get away without an Avengers movie for about 2 phases is wild. At least have 1-2 entries that are lowkey Avengers films like Civil War was. Captain Marvel 2 Secret Invasion could’ve totally been that movie.",
            "I'm curious to see how they end up balancing things out here. I could see them shooting stuff with Ian McKellen and Patrick Stewart - for this and what comes after - right now or in the near future, due to both of them being up there in terms of age.\n\nI guess this also indicates that they have a handle on the screenplay for whatever the movie ends up being.",
            "Would be weird if that Clea storyline happened offscreen and he’s just back like that.",
            "Very interested to see how they market an Avengers movie with how the MCU is doing right now and the lack of a clear roster. Can’t see hype building around Falcon, Carol, She-Hulk and anyone other than Strange and Spidey.\n\nOntop of that, I wonder how close in filming dates this will be to the inevitable Spider-Man 4 and Doctor Strange 3, since they are both heavily rumored to release before Secret Wars. Same for Shang-Chi 2.\n\nThat’s a lot of filming Benedict, Tom, and Simu are going to be doing.",
            "Love that he says he genuinely enjoys playing Doctor Strange and that by playing the part it allows him to bring less commercial project to fruition.\n\n\nHopefully we can see him pop up a bunch more before they retire the character.",
            "Finally! The Avengers are coming back 🤯🍷🗿",
            "Wait so that means :\n\n- Dr Strange 3 before Avengers 5\n\n- Or maybe the Incursions/Clea plot is actually a subplot in Avengers 5\n\n- Or he's just there for the Post-Credit Scene :/",
            "My hopes for the leads are as follows:\n\nSpider-Man\nDr Strange\nWolverine\nDeadpool\nBlack Panther\nThor\nCaptain America\nShang Chi\nCaptain Marvel\nMs Marvel\nDaredevil\n\n& then maybe just a couple others u could really pick anybody cuz the MCU has like 300 characters now",
            "Weren't some scoopers saying he wouldn't appear in avengers 5 but in 6.",
            "Let's gooooooooo"
        ]
    },
    "Sony might be currently casting its live-action Miles Morales (Jeff Sneider - Hot Mic Podcast)": {
        "title": "Sony might be currently casting its live-action Miles Morales (Jeff Sneider - Hot Mic Podcast)",
        "score": 112,
        "url": "https://www.youtube.com/live/MveqtGm_kqI?si=E80tImseponOyXHi",
        "content": "Topic is at 01:16:21",
        "num_comments": 79,
        "comments": [
            "# Jeff Sneider/The Hot Mic Podcast is a Tier 3 – Somewhat Reliable Source as decided by the community.\n\nFor **Marvel**, they had a **55.77%** accuracy rate from **47** leaks that we can currently verify out of **99** total.\n\n**Overall**, they had a **62.50%** accuracy rate from **78** leaks that we can currently verify out of **175** total.\n\nLast updated: March 22nd, 2024.\n\n| [Spoiler-Verse Accuracy Database](https://docs.google.com/spreadsheets/d/1RpGBi4duCDeiXUtSh_1x15VJ67vPRZ1LWu6A3ieGTjs/edit?usp=sharing) | [FAQ](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/source-accuracy-tiers/sad-faq/) | [Tiers](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/source-accuracy-tiers/) | [Latest Recalibration](https://www.reddit.com/r/MarvelStudiosSpoilers/comments/18jaqqk/mod_post_2023_source_accuracy_recalibration_3/) |\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MarvelStudiosSpoilers) if you have any questions or concerns.*",
            "https://i.redd.it/fu38cr40308d1.gif",
            "Did Sony realize they can make movies with protagonists now?",
            "How would you feel if Miles Morales is the Sony Universe's Spider-Man?",
            "I’d rather a 2099 film. ",
            "They should cast Jack Black as Miles",
            "Lol how do you think people would’ve felt if Miles Morales was the Spider-Man of Madame Web, and the one Ezekiel was trying to stop from being born?\n\nand Ben Parker would be replaced by Donald Glover as Jefferson Davis, with him being revealed Aaron and him are identical twins. \n\nand Mary Parker would be replaced with Rio Morales.",
            "FUCK I THOUGHT IT WAS FOR THE MCU !",
            "Phil Lord and Chris Miller need to be the James Gunn of the SSU. They need to stop fucking around because they are sitting on a goldmine.",
            "I’d rather a 2099 film. \n\nMarvel Studios is doing nothing with Oscar Isaac as Moon Knight (or Apocalypse) anyway."
        ]
    }
}