{
    "Weekend Free Talk and Index Thread - New and fresh every Friday!": {
        "title": "Weekend Free Talk and Index Thread - New and fresh every Friday!",
        "score": 26,
        "url": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/1dqlc19/weekend_free_talk_and_index_thread_new_and_fresh/",
        "content": "[](https://i.imgur.com/eKZXttG.jpg)\n\nWelcome to the Weekend Free Talk and Index thread!\n\nYou can post whatever you want here - unsubstantiated rumors you heard, fan theories, random shower thoughts, or even musings that are unrelated to the Marvel universe.\n\nAnything goes - please just follow the [Reddiquette](https://www.reddithelp.com/en/categories/reddit-101/reddit-basics/reddiquette) and **above all else treat each other and those that contribute to this subreddit with respect.**\n\nPotential points of interest:\n\n* [X-Men '97 - Official Discussion Index](https://www.reddit.com/r/MarvelStudiosSpoilers/comments/1cehvri/index_xmen_97_season_1_discussion_thread_index/)\n* [Echo - Official Discussion Index](https://www.reddit.com/r/MarvelStudiosSpoilers/comments/1925et0/index_echo_discussion_thread_index/)\n* [Madame Web - Official Discussion Megathread](https://www.reddit.com/r/MarvelStudiosSpoilers/comments/1aqa31x/worldwide_release_madame_web_official_discussion/)\n* [Previous Movie Megathreads and TV Show Discussion Indexes](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/movie-megathreads-and-show-indexes)\n* [MSS MCU Project Ratings](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/movie_tiers) (VOTED BY YOU!) - Make sure to vote during our project rewatches as well as in the new release megathreads.\n* [Archive of Stickied Posts](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/sticky-archive)\n* [Sub Wiki - Rules of the road](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/)\n* [Source Accuracy Tiers](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/source-accuracy-tiers) \\- Not sure what sources people consider trustworthy? Start here! (Note: This list changes and is not infallible - use this as a general guide only)\n* [Source Accuracy Database](https://docs.google.com/spreadsheets/d/1RpGBi4duCDeiXUtSh_1x15VJ67vPRZ1LWu6A3ieGTjs/edit?usp=sharing) \\- Our database designed to catalog scoops and provide accountability",
        "num_comments": 367,
        "comments": [
            "About that \"Anarchy Avengers\" flag Reynolds posted on his insta. Do you think it's a still from the movie and represent the supposed resistance team from the movie?",
            "We're less than a month away from SDCC...................\n\n![gif](giphy|xTiN0CNHgoRf1Ha7CM|downsized)",
            "In the Superman set photos, Mr. Terrific has the LordTech logo on his shirt. This is interesting, because it implies Maxwell Lord (Sean Gunn) is sponsoring superheroes, like how in the comics he sponsored the Justice League International. \n\nI wouldn’t be surprised if Mr. Terrific, Green Lantern, Hawkgirl, and Metamorpho are all members of a corporate sponsored Justice League, like the Seven from the Boys.",
            "Post Secret Wars what do you guys think the new film franchises will be in the MCU? \n\nObviously X-Men is the major one. Could we get an Iron Man reboot? New cosmic franchise? ",
            "Its sad how Cable and Domino arent in Deadpool and Wolverine. Maybe they can return in a Deadpool 4 or something.",
            "Finally watched \"The Ministry of Ungentlemanly Warfare\" and that movie was a damn blast. Guy Ritchie is just on a roll.\n\nThe whole cast was fantastic and I want them all in the MCU lmao. Especially Eiza Gonzalez, but I can't think of someone she can play off the top of my head.",
            "I know how it goes, 'don't get your hopes up' and all that, but if David Harewood's playing >!Plagueis!< in The Acolyte, I'll absolutely freak out. I was always a fan of the idea of the character, but having >!read the novel a little bit ago, I think there's a fair amount of overlap where it would make sense for him to be present and, while the story could go in any other direction, I'm still hoping he has *something* to do with what's going on. I've just been dying to see the guy in live-action for the last little bit.!<",
            "Reading stuff like Animal Man and Sweet Tooth recently, Jeff Lemire legit deserves a second chance at a proper mainline X-book. Him coming in to write the X-Men at basically the rock bottom era of the team and basically anything mutant-related did him so dirty despite the fact that Extraordinary X-Men was serviceable enough with the circumstances surrounding it, especially ideas like turning the X-Mansion into a safe haven for mutants during M-Pox and how he handled Emma Frost during Death of X\n\nDude can really fly with character work based on those books at DC and especially how absolutely top tier his Moon Knight run was with Greg Smallwood. A Lemire/Smallwood X-Men run would pop off so hard",
            "Here we are a year later and im still happy crying over Volume 3",
            "Every time the “Who asked for this?!” shit pops up I just think of that Gunn quote about how nobody asked for The Sopranos or Star Wars either. It’s such a dumb way of evaluating art. There’s a bunch of stuff I have zero interest in, but I’d rarely make the argument it shouldn’t exist."
        ]
    },
    "[Marvel Rewatch] X-Men: Apocalypse - Rewatch Discussion Thread": {
        "title": "[Marvel Rewatch] X-Men: Apocalypse - Rewatch Discussion Thread",
        "score": 49,
        "url": "https://www.reddit.com/r/MarvelStudiosSpoilers/comments/1czk6pm/marvel_rewatch_xmen_apocalypse_rewatch_discussion/",
        "content": "This week's rewatch is  ***X-Men: Apocalypse*** (2016). Feel free to share your thoughts on what you enjoyed and didn't like. Discuss the best and worst scenes, moments, quotes, characters, or ideas that resonated with you. Or, embrace the nostalgia and engage in some lighthearted \"release day\" shitposting. Respectful discussions are encouraged, so feel free to delve into anything and everything under the sun related to the film.\n\n \n\n***X-Men: Apocalypse*** is a 2016 American superhero film directed and produced by Bryan Singer and written by Simon Kinberg from a story by Singer, Kinberg, Michael Dougherty, and Dan Harris. The film is based on the fictional X-Men characters that appear in Marvel Comics. It is the sixth mainline installment in the *X-Men* film series and the ninth installment overall. It is the sequel to *X-Men: Days of Future Past* (2014) and stars James McAvoy, Michael Fassbender, Jennifer Lawrence, Oscar Isaac, Nicholas Hoult, Rose Byrne, Tye Sheridan, Sophie Turner, Olivia Munn, and Lucas Till. In the film, the ancient mutant En Sabah Nur / Apocalypse is inadvertently revived in 1983, and he plans to wipe out modern civilization and take over the world, leading the X-Men to try to stop him and defeat his team of mutants.\n\nThe film was announced by Singer in December 2013, with Kinberg, Dougherty, and Harris attached to develop the story. Casting began in October 2014, while principal photography commenced in April 2015 in Montreal and ended in August of the same year.\n\n*X-Men: Apocalypse* premiered in London on May 9, 2016, and was released in the United States on May 27, 2016, in RealD 3D, IMAX 3D, 4DX and Dolby Cinema formats by 20th Century Fox. The film received mixed reviews from critics. A sequel, titled *Dark Phoenix*, was released on June 7, 2019.\n\n&#x200B;\n\nListed below are examples of some previously ranked projects. \n\n* Tier S - Excellent - Avengers: Infinity War\n* Tier A - Very Good - Black Panther\n* Tier B - Good - Ant-Man\n* Tier C - Average - Black Widow\n* Tier D - Acceptable -The Incredible Hulk\n* Tier F - Unacceptable -Thor: The Dark World\n\n[**To see our current project tier ranking, including where X-Men: Days of Future Past ended up, click here.**](https://www.reddit.com/r/MarvelStudiosSpoilers/wiki/index/movie_tiers/)\n\n**What would your rank** ***X-Men: Apocalypse*****?**\n\n[View Poll](https://www.reddit.com/poll/1czk6pm)",
        "num_comments": 60,
        "comments": [
            "The action scenes where amazing in this movie especially the magneto awakening one",
            "EVERYTHING THEY BUILT WILL FALL!",
            "This movie had so much potential and they fucked it up. The way Wolverine was included really pissed me the fuck off. Why even bother with the little tease of Mystique as Stryker at the end of DOFP? Obviously, the implication was new timeline, new rules. \n\nApocalypse should’ve been the one that gave him the adamantium in this timeline. He didn’t even need to be a major character, just a horseman, handled with meticulous care to ensure he’s respected, but ensuring that the new characters get a chance to shine.",
            "There's a scene in this where magneto psychically talks to Charles and in the background Apocalypse is using his powers to put armor on archangel, full body, while psylocke stands next to him without pants. The movie has the worst costuming in the franchise the biggest issue of course being Apocalypse himself.  Sort of an ugly sonic situation:  everyone told them it was bad when it was revealed but they went ahead with it any way. The movie continues the worst I clinations of the franchise which is to include X-Men characters as like a checklist but without actually including anything meaningful about their characters or personalities.  It's especially sad when it comes to nightcrawler, who actually does look great in this, but can't come close to matching the heart alan cumming brought to the role.",
            "Uh. Jean uses the whole Phoenix thing against Apocalypse at the end, but in the next film, she dosen't seem have any of that going on until the incident with the space shuttle? Uh, ok.",
            "Oh man this movie is wack, Apocalypse is a boring villain, the writing is not that great, so many recognizable Mutants gets wasted especially Psylocke, and the story is so cookie cutter.\nHeck I don’t even liked the casting of Jean since it just the actress didn’t feel right for the role.",
            "This movie is the second worst thing associated with Bryan Singer.",
            "it still bothers me that quiksilver didnt tell magneto he is his son",
            "Evan Peters is thr 1 thing I enjoyed.",
            "This is such an average movie, the pacing and the action scenes make it a fun watch and the third act is really entertaining but script and the whole storytelling itself is just bad imo."
        ]
    },
    "Cryptic HD QUALITY (@Cryptic4KQual) is implying Marvel hid a character in the new spot of Deadpool & Wolverine featuring Sabretooth \"We're getting closer to a big one🔥\"": {
        "title": "Cryptic HD QUALITY (@Cryptic4KQual) is implying Marvel hid a character in the new spot of Deadpool & Wolverine featuring Sabretooth \"We're getting closer to a big one🔥\"",
        "score": 306,
        "url": "https://x.com/cryptic4kqual/status/1806821606968410560?s=46&t=D3kSWzFbWrR5R7DGIdZpEQ",
        "content": "",
        "num_comments": 101,
        "comments": [
            "I do trust Cryptic when it comes to promotional material. He's had several trailers ahead of time and hinted at stuff (or even leaked it himself), so as long as this is something that he knows for sure and has seen and isn't just randomly hyping something up, I'm excited to see what it is.\n\nThe character's pretty impossible to make out in that picture, but I take it the flame emoji is a hint at Evans' Human Torch?",
            "The flame emoji made me think Human Torch, but zooming in, could this be Wesley Snipes' Blade? Dark silhouette. We know he is in the movie if rumors are true.",
            "A big one? Juggernaut, bitch!",
            "![gif](giphy|5PiM2sNRJ6OZO|downsized)\n\nThe original Howard the Duck.",
            "That pic is funny lolll",
            "So is it the original torch from first avenger? I just don’t see the suit being evans torch",
            "I'm just going to call it: Deadpool and Wolverine are going to battle Hulk in the third act and that's what the \"People have been waiting decades for this\" line is from. The line was just edited into this part of the trailer but is from a much bigger fight in the finale.",
            "I think that’s Ben Afflack’s Dare Devil back there.",
            "They’ve hidden quite a few big things in these trailer shots with cgi. Especially the snowy forest 👀",
            "Wojak wolverine? is the big secret?"
        ]
    },
    "DanielRPK claims Marvel is developing Nova, Blonde Phantom, Punisher, Wiccan, White Tiger and Strange Tales projects, with possible greenlights before D23": {
        "title": "DanielRPK claims Marvel is developing Nova, Blonde Phantom, Punisher, Wiccan, White Tiger and Strange Tales projects, with possible greenlights before D23",
        "score": 233,
        "url": "https://twitter.com/DanielRPK/status/1806668924362084613?t=oNsOOhQs0qzVnAYjGQ3JQQ&s=19",
        "content": "",
        "num_comments": 149,
        "comments": [
            "So they cancelled CM3, AM4, Eternals 2 - characters already on the table whose previous entries (excluding Eternals) were mishandled by them, cuz they wanna focus on “sure fire hits”? ok…\n\nbut lets do…all these? What ways do they have to gauge that Blonde Phantom would be a “sure fire hit?”",
            "So everyone just straight up forgot that Brad Winderbaum said that they're developing way more projects than they're actually gonna release now? That wasn't even that long ago. Why does this fanbase insist so hard on believing scoopers over actual official reports and statements?",
            "What would Strange Tales even be about?\n\nWould this be animated or is this what Strange Academy has been renamed to?",
            "Scoopers still have yet to recover from every Marvel exec saying they're slowing down",
            "Yeah they’re gonna need to change the whole two shows a year thing. If this is true then that’s literally three entire years. Combined with Wonder Man, Born Again seasons 1 and 2, Ironheart, Vision Quest and Moon Knight S2, that’s six years. \n\nIt should be one show in winter (Jan-March), one show in summer (May-July) and one in the fall (Sept-Nov)",
            "I’m sick we’re really getting a Blonde Phantom show before a Shang-Chi 2 announcement. What about Blonde Phantom screams profit or even interest 😭",
            "ugh more tv shows about characters nobody really cares about",
            "Doubt it. Only one that seems plausible is Nova or punisher. If that",
            "None of these are sure fire hits. 1 might be if done right.",
            "This is kind of hard to believe with what Iger said a while ago."
        ]
    },
    "Jeff Sneider clarifies that he never said the 'Young Avengers' project wasn't happening": {
        "title": "Jeff Sneider clarifies that he never said the 'Young Avengers' project wasn't happening",
        "score": 103,
        "url": "https://x.com/TheInSneider/status/1806696697969414538?t=FSNs4u6lARWx9UGXHbqVQQ&s=19",
        "content": "If you go and watch the podcast, Rocha says \"There's no way the Young Avengers is happening\" and Sneider just nods. That's not confirmation from either of them. That's just speculation.",
        "num_comments": 28,
        "comments": [
            "Considering the single highest praise from the Avengers is their chemistry, and Age of Ultron’s best scene is the Avengers just hanging out, this could go a long way.\n\nThe Avengers they select, and writer, needs to be on it though.",
            "If you watched the video, Rocha said they shouldn’t do Young Avengers. Not that it’s not happening. It wasn’t even Sneider. ",
            "Oh thank goodness it was nonsense. It didn't make any sense anyways. Most of the best of the new faces are young avengers or champions so it would be a shame",
            "The deeper we get into projects like this, the less successful the MCU will become.  By the time infinity war and endgame happened fans (who don’t even read comics BTW) were 10 years older than when Iron Man came out.  It’s been another 5 years since Endgame already.  By the time this comes out it’ll be 20+ years since iron man.  Young Avengers will not be a selling point to those people.",
            "This dude is a fucking clown",
            "Btw, if YA features a Kid Loki it's definitely not going to be the one we met in The Void.",
            "Scaling back could also mean they're spacing things out and giving each one more time to work with.",
            "Idc much about young Avengers as much i get more of kate and Billy maximoff then ya i m with it young Avengers sounds a stupid idea",
            "Yeah that mf is evil",
            ">I suggest Ms. Marvel is no way fit in this team. \n\nMs Marvel is probably the most popular and liked YA character with Kate Bishop, it would be like a shot on their feet."
        ]
    }
}