{
    "Weekly Q&A - Ask your questions here! - June 28, 2024": {
        "title": "Weekly Q&A - Ask your questions here! - June 28, 2024",
        "score": 8,
        "url": "https://www.reddit.com/r/MarvelSnap/comments/1dqj2yo/weekly_qa_ask_your_questions_here_june_28_2024/",
        "content": " Hi [/r/MarvelSnap](https://www.reddit.com/r/MarvelSnap),\n\nPlease use this post to ask all of your Marvel Snap related questions! As the community grows, we'll start to collate all of the most commonly asked questions to create a FAQ wiki page.\n\nRemember to follow the community rules, and be respectful when answering questions.\n\nThanks!",
        "num_comments": 35,
        "comments": [
            "Returning player here, my last spotlight was Warmachine. Can I get a list of good cards to get using tokens?",
            "Thena or Nocturne as a token pickup?",
            "What happens when you split a card with a custom border, does the split get it too?",
            "If I immediately retreat in a conquest match, does that count towards the win a game with X in your deck missions for my opponent?\n\nTonight I was doing quests in PG and noticed my opponent was playing a Gilgamesh deck so I was wondering if retreating a few times would help with the weekend mission.",
            "Can anyone share a phastos deck that isn't bounce or junk?",
            "When are emotes in the shop?\n\nI feel like I've seen them once months ago, and I haven't been able to login at the right time since.",
            "Whats the best deck in the game at the moment? \n\nReached level 83, but have fallen to 78. My opponent seems to always have perfect card draw or a perfect deck to counter whatever Im using.",
            "prolly get more use out of nocturne",
            "Custom borders go on the \"custom\" card which can't be split. But any split you have can be used as the custom card, so effectively all of your splits of that card have the border.",
            "He's fine in Surfer - pick your least favourite 3 and cut it for Phastos."
        ]
    },
    "Weekly Card Release Discussion": {
        "title": "Weekly Card Release Discussion",
        "score": 92,
        "url": "https://www.reddit.com/r/MarvelSnap/comments/1doa8en/weekly_card_release_discussion/",
        "content": "Please discuss the newest Marvel Snap card release here. All questions, strategies, and opinions about the new card are welcome!\n\nhttps://preview.redd.it/1gedl8kpwq8d1.png?width=340&format=png&auto=webp&s=4ff4ca1e04eed0307b01806cc773362be9291f68",
        "num_comments": 282,
        "comments": [
            "Bruh, skipping all the shit last week to have my first key be Makkari was a real slap to the balls.",
            "Im excited to add him to my Thanos deck. Zero cost stones that can draw you more cards seems good. And if I dont draw him by turn 3, theres still other options with a Thanos deck.",
            "If u don't draw him phast you're tost",
            "I'm looking forward to try him in a Galactus deck and see what happens.",
            "I've seen Phastos every match. Personally, I think he's great. I was able to use Absorbing Man on him and can confirm the effects stack. My next draw was -1 cost AND +2 power. Don't know if it can stack to -2 cost or +4 power yet. All in all, I'm very happy and love the card so far.",
            "He's better than I thought it'd be, very fun card so far.",
            "Using him in a Kitty/Angela/Thena deck has been great so far. There's a 50% chance to have him in your hand by turn 3 -- not bad. It's added good value to that deck (for me).\n\nBar Sinister has given me huge cards in power and low energy in the other two lanes. I think it's worth sacrificing the lane if you have him on hand by turn 3.",
            "The overall negativity about this card suggests to me that it's going to be hugely OP considering cards are the opposite of whatever the hivemind thinks.",
            "I think i need to take nova out of my surfer deck.  Every single time i play phastos i draw nova next turn with boosted power laughing in my face",
            "Got Corvus twice god damn it why is this possible"
        ]
    },
    "Can’t shang this": {
        "title": "Can’t shang this",
        "score": 2836,
        "url": "https://v.redd.it/wblm8jwl2e9d1",
        "content": "",
        "num_comments": 183,
        "comments": [
            "This is honestly the best clip I've ever seen on this sub. 10/10",
            "First time a clip actually impressed me on here good shit",
            "This is why we need a \"Clap\" emotion.\n\nWhen you lose to a play like that,  you need to clap and say \"Well done my friend\"",
            "I feel dirty just watching this",
            "God damn that is beautiful.  Very well played",
            "CALL AN AMBULANCE . \nBUT NOT FOR ME ",
            "That's cool and all but have you ever seen tribunal make big numbers?",
            "This might be the craziest play I've ever seen",
            "You win. You did it. You won Marvel Snap. Let's pack it up boys.",
            "Id smash my phone if I got soul-read like that. God damn."
        ]
    },
    "In case you were wondering, background isn't entirely ruined by foil, prism or gold": {
        "title": "In case you were wondering, background isn't entirely ruined by foil, prism or gold",
        "score": 207,
        "url": "https://v.redd.it/bpcx0vw6ag9d1",
        "content": "",
        "num_comments": 18,
        "comments": [
            "That's fantastic. I wish more cards could look like this, keeping the details and cool things while just having the splash of background.",
            "A rare example of foil being the best split.",
            "Legit thanks, I WAS wondering :)\n\nThe gold is a little too low-key for my taste, but I'll keep thinking about it. Nice to know, one way or another. The real issue is that I don't really play Nightcrawler a lot...",
            "I'd buy this if I wasn't so stingy. Love that variation.",
            "Oh Frick, forgot about my daily login to get my silver border today\n\nThanks my dude",
            "We need more of these",
            "Let him at least move every turn like vision",
            "Omg is that Venomized or Knullified??",
            "I saw it, I need it, I bought it, I used silver border on it,now I just need to ink it and I'm never touching another night crawler variant again, it's perfect!",
            "Testament magneto is another great example of this being done right"
        ]
    },
    "What is this deck?! Why does it have such good stats (in 90+)? Why is there a wolverine and a Magik here? I'm so confused": {
        "title": "What is this deck?! Why does it have such good stats (in 90+)? Why is there a wolverine and a Magik here? I'm so confused",
        "score": 76,
        "url": "https://i.redd.it/y8dwcpre1h9d1.png",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Magik + Doc Oc is a very good package. You close down a lane and either you do win that lane on turn 5, or you have 2 turns to beat that lane that the opponent can't play on. It's really effective.",
            "I just got to infinite using this deck (first time), I dont know why it works but I went from 91>Infinite in a matter of hours with minimal losses. Its a very simple deck.",
            "Just gonna pile on thay its mill. Magik is to extend the game so they can ock on 5 or 6 then shit on whatever it pulls out to steal his lane. Wolverine is in there to discard so he's basically a 0/4 that protects u from discarding anything else with samurai",
            "Feels inferior to the standard Zemo mill deck but it's nice to be able to play with different cards.",
            "Also 230 games is a tiny sample",
            "I don't see how people use doc oc, everytime I play him he always pull out cards my opponent needs. Last 3 games Gladiator pulled out card they needed as well, I've had bad luck with this deck so far",
            "Played against this in Gold conquest and it was a blast. Really tough matchup and keeps you guessing. I know that when I play it Ill still suck but its really strong right now",
            "I tried something similar to this with zemo before and got my ass beat in conquest. Maybe it's better for ladder",
            "I think this arctype is starting to be a problem in snap",
            "What's a good replacement for rhulk"
        ]
    }
}