{
    "N7 Day 2023 + r/masseffect Cake Day Celebration, News, Giveaways, & More! [megathread]": {
        "title": "N7 Day 2023 + r/masseffect Cake Day Celebration, News, Giveaways, & More! [megathread]",
        "score": 285,
        "url": "https://www.reddit.com/r/masseffect/comments/17p48ab/n7_day_2023_rmasseffect_cake_day_celebration_news/",
        "content": "**ATTN: This post will be updated with new information throughout N7 Day, so please check back as the holiday progresses. If you see nothing here, that does not mean there is nothing more to add.**\n\n     Last updated: 12/07/23 6:11 PM ET\n\n*REMINDER: Our rules still apply on N7 Day, including Rule 3. In fact, today of all days we want to center meaningful discussions and any news we receive. Low effort, non-discussion-driven posts will be removed. Do not make posts just to say \"happy N7 Day.\" These types of low effort posts are distracting. Your posts must be discussion or content centered.*\n\n# Happy 14th Cake Day to r/masseffect!\n\nFun fact: This subreddit was created November 8th, 2009, one day after N7 Day and 3 years before the official creation of N7 Day! The first N7 Day was in 2012. This year the subreddit will turn 14 years old, just 2 years younger than the first Mass Effect. [Happy Cake Day to us!](https://www.deviantart.com/regeener/art/Happy-Birthday-365019290)\n\n[Art by regeener on DeviantArt](https://preview.redd.it/9izg411mnqyb1.png?width=941&format=png&auto=webp&s=8e47b5cf00595f0981da256838cd8b35f12fd868)\n\n# Giveaways\n\n**Edit: Congratulations to the winners** u/Iammeandnooneelse**,** u/TattedUpSimba**,** u/Ricatalano1**, and** u/CanoGori**!**\n\nTo celebrate 16 years of Mass Effect and 14 years of this community, we will be hosting a giveaway and giving away multiple prizes to multiple winners!\n\n**Eligibility:**\n\n1. Yes, this year the giveaway is open internationally! For prizes fulfilled by the Bioware Gear Store, please see the list of shippable countries [here](https://gear.bioware.com/pages/shipping-policy).\n2. You must be 18 years or older in age.\n3. You must be active and in good standing in the subreddit.\n\n**Prizes:**\n\n1. a Mass Effect t-shirt of your choice from the Bioware Gear Store (dependent upon availability) - 2 WINNERS\n2. a Mass Effect vinyl decal (multiple designs available) - 2 WINNERS\n\nhttps://preview.redd.it/wxo6ls2p3tyb1.png?width=6912&format=png&auto=webp&s=04997fc415bee6b2fa806612120a29bd523e6462\n\n***Edit: Please stop commenting entries for the giveaway outside of the STICKIED MOD COMMENT thread. YOU MUST REPLY TO THE STICKIED MOD COMMENT FOR YOUR ENTRY TO COUNT! The extraneous comments are taking away from the discussion! I will no longer be warning folks that their entry won't count. Instead, I will simply remove the disqualifying comment and your entry will not be counted.***\n\n**Rules & Structure:**\n\n1. To enter, you must reply to the stickied mod comment with your preferred prize, country of residence, and something nice about ME or this subreddit! *You must reply to the stickied mod comment. Comments outside of the replies to the mod comment will not be counted!*\n2. Winners will be chosen randomly on Wednesday 11/8. Entries will be accepted from now until then, when the comments will be locked.\n3. Winners *must respond within 24 hours* or their prizes will be forfeited to the next winner, so please keep an eye on your inbox. Once prizes are confirmed, this post will be edited with the winners listed.\n4. I will be fulfilling some of these prizes myself, with some of my own money, and much of my own time, so I ask that you be patient with me.\n\n# Discord Party\n\nOur subreddit Discord will be having an N7 Day party! Join us for friendship and festivities all day! [Click here to join](https://discord.gg/r-masseffect-810215970751774741).\n\nWe will also be streaming the Mass Effect animated film Paragon Lost, so check it out if you haven't seen it yet!\n\n# Official Bioware Posts & Announcements\n\n    The below updates are live and timestamped.\n\n* **\\[12:05 PM\\]** Looks like this year, the official N7 Day post is on [EA.com](https://EA.com) instead of the Bioware Blog. [Please see the full post with words from Mike Gamble here](https://www.ea.com/games/mass-effect/mass-effect-legendary-edition/news/n7-day-2023).\n   * There appears to be a secret message embedded in the text as there are random 1s and 0s scattered throughout the post. When decoded, it appears to be the word \"epsilon\" in binary, confirmed by multiple Twitter/X and Reddit users.\n   * Twitter user [@ghostofcody](https://twitter.com/ghostofcody/status/1721942413755761031) says:\n\n>Mass Effect was almost named \"The Epsilon Effect\" in early development. HOWEVER, the literal definition of Epsilon is the 5th letter in Greek Alphabet. Sounds like it will be Mass Effect 5!!\n\n* **\\[12:40 PM\\]** Mike Gamble also previously made [this Tweet responding to a clip of the old teaser trailer](https://twitter.com/GambleMike/status/1721756977557365007).\n* **\\[12:45 PM\\]** There is now a countdown on this web page: [https://www.ea.com/games/mass-effect/epsilon](https://www.ea.com/games/mass-effect/epsilon)\n   * the web page states the below with the countdown beneath it:\n\n>/////ACCESS CODE: EPSILON  \n>  \n>/////TIME UNTIL DECRYPTION COMPLETED\n\n* **\\[1:05 PM\\]** It seems the Epsilon webpage is being overloaded but [the Mass Effect YouTube channel just posted a short clip titled EPSILON of what appears to be a character walking past a bunch of energy cells](https://www.youtube.com/watch?v=kP_bTLzi3Hw). The description states \"Transmission incoming.\"\n* **\\[1:10 PM\\]** The webpage has updated to now state the below along with a YouTube embed of the video clip.\n\n>/////ACCESS CODE ACCEPTED  \n>  \n>/////SECONDARY ENCRYPTION DETECTED  \n>  \n>/////VJBSVU-XXXX-XXXXXXXX  \n>  \n>/////ANDROMEDA DISTRESS SIGNAL DETECTED  \n>  \n>/////YEAR SENT: \\[REDACTED\\]  \n>  \n>/////AUDIO TRANSCRIPT: ALTHOUGH THEY SHOULD KNOW BY NOW NOT TO UNDERESTIMATE HUMAN \\[REDACTED\\]\n\n* The AUDIO TRANSCRIPT is a line of dialogue believed to have been said by Liara T'Soni in last year's teaser.\n   * However, the final word of that dialogue, believed to be the word \"defiance,\" is redacted in this transcription. The year the transmission is sent is also redacted.\n   * The character appears to be wearing a coat or jacket similar to the silhouette of Liara's default outfit from Mass Effect 3 and the Shadowbroker DLC. The outfit appears to have a red trim or lining at the bottom. When going frame-by-frame, the outside of the outfit appears to be white, gray, or black.\n   * The character also appears to be wearing high-heeled wedge boots with some metallic silver or white and red details.\n* The ANDROMEDA DISTRESS SIGNAL DETECTED seems to confirm that The Next Mass Effect game will bridge the original trilogy and Andromeda.\n* **\\[1:30 PM\\]** [Mike Gamble tweeted \"First packet intercepted\"](https://twitter.com/GambleMike/status/1721953038011908119) and the text above implies a 2nd message.\n   * When moving 7 letters over in the alphabet, \"VJBSVU\" can be decoded to say \"Oculon.\" Oculon was an early development name for the Citadel.\n   * This leads us to a secondary webpage with yet another countdown: [https://www.ea.com/games/mass-effect/oculon-2819-defiance?isLocalized=true](https://www.ea.com/games/mass-effect/oculon-2819-defiance?isLocalized=true)\n   * Text above the countdown reads:\n\n>/////ACCESS CODE: OCULON-2819-DEFIANCE  \n>  \n>/////TIME UNTIL DECRYPTION COMPLETED\n\n* 2819 may be the redacted YEAR SENT as we know that DEFIANCE is the redacted last word. Year 2819 is when Ark Leusinia, Ark Natanus, and Ark Paarchero arrived in the Heleus Cluster.\n* **\\[2:02 PM\\]** The webpage has updated with a [new video](https://www.youtube.com/watch?v=Pr0YtTJ6o_4) clip titled DEFIANCE which appears to be a direct continuation of the previous clip. This clip shows more of the character, which appears to be female or feminine, wearing a black N7 coat with lit back details similar to N7 armor.\n* The new text on the webpage reads:\n\n>/////ACCESS CODE ACCEPTED  \n>  \n>/////TERTIARY ENCRYPTION DETECTED  \n>  \n>/////CLASSIFIED: REVIEW BRIEFING MATERIALS ON OFFICIAL ALLIANCE COMMS CHANNELS\n\n* This seems to imply yet another, 3rd, message.\n* **\\[2:26 PM\\]** It may be worth noting that Mike Gamble [still has a tweet from last year pinned](https://x.com/GambleMike/status/1589731923127066624?s=20) that reads '\"Although, they should know by now not to underestimate human defiance!' - Liara T'Soni (Doctor, Shadow Broker and <REDACTED>).\" That last part was added by him. There is speculation that Liara may have been the Benefactor of the Andromeda Initiative.\n* **\\[2:35 PM\\]** Bioware retweeted two pieces of commissioned fan art that each have one half of a QR code.\n   * [https://twitter.com/VONHEXA/status/1721943498834825281](https://twitter.com/VONHEXA/status/1721943498834825281)\n   * [https://twitter.com/LazareGvimradze/status/1721958239649018187](https://twitter.com/LazareGvimradze/status/1721958239649018187)\n\n[Art by VONHEXA that has the left half of the QR code](https://preview.redd.it/3b0l2lhbbzyb1.png?width=2096&format=png&auto=webp&s=2d0be9b3e09b6070d9f183fed7e524cbb382fc73)\n\n[Art by LazareGvimradze that has the right half of the QR code](https://preview.redd.it/b6mitfpfbzyb1.png?width=2250&format=png&auto=webp&s=a50252856e0c3c1d8977c1c6c2ce909c0df066e3)\n\n* The full QR code leads to a third webpage with yet another (but longer) countdown: [https://www.ea.com/en-gb/games/mass-effect/post-nebula](https://www.ea.com/en-gb/games/mass-effect/post-nebula)\n   * The text on this webpage reads:\n\n>/////ACCESS CODE: POST-NEBULA  \n>  \n>/////TIME UNTIL DECRYPTION COMPLETED\n\n* The previous two countdowns were about 30 minutes, but this third one is about an hour and half.\n* **\\[4:00 PM\\]** The third countdown webpage, POST-NEBULA, has updated to include the below text and [a new embedded video](https://www.youtube.com/watch?v=bBzbMdw90do). The video is a continuation of the scene from the last two videos and appears to be the final piece of the puzzle.\n\n>/////ACCESS CODE ACCEPTED: POST-NEBULA  \n>  \n>/////WARNING  \n>  \n>/////SECURITY BREACH DETECTED/////CONTACT SYSTEMS ALLIANCE  \n>  \n>/////EPSILON-OCULON-NEBULA\n\n* The N7 character is now revealed, wearing a helmet and N7 coat with a quilted high collar and red lining. They are seen walking through a doorway.\n   * Although blurred, the doorway appears to lead to an outside environment as what look like vehicles fly by. The environment is vaguely reminiscent of the environments shown in the concept arts released last year as teasers.\n   * [There is also a vague silhouette of a ship resembling the one from the Mudskipper teaser](https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2F2su0f7p0jqya1.png%3Fwidth%3D1024%26format%3Dpng%26auto%3Dwebp%26s%3D3dc85e2decfc7601f281d33431f7d9d0820783dd).\n* **\\[4:10 PM\\]** The full video, with all three clips stitched together, is now available, with the description \"Transmission received\": [https://www.youtube.com/watch?v=XefLOWmcFpY](https://www.youtube.com/watch?v=XefLOWmcFpY)\n   * [Mike Gamble tweeted this video, telling us to \"look closely.\"](https://twitter.com/GambleMike/status/1721997635278831701)\n* **\\[4:12 PM\\]** [Mike Gamble has also tweeted \"Not everything is as it seems,\"](https://twitter.com/GambleMike/status/1721997151751086105) implying there is more to decode.\n* **\\[4:54 PM\\]** Fans are reporting seeing [what looks like a krogan at the beginning of the video](https://twitter.com/TashaOfAsgard/status/1722008065661128717). So far, there is no identification of any reflections in the N7 character's mask at the end.\n* **\\[5:12 PM\\]** [Mike has confirmed the footage is in-engine](https://twitter.com/GambleMike/status/1722010187165544651).\n* **\\[5:13 PM\\]** [Mike Gamble has just posted yet another teaser image,](https://twitter.com/GambleMike/status/1722012172166025591) this time portraying the N7 character and some nightlife environment imagery. The image shows the weapon, coat, and helmet in more detail.\n* **\\[5:52 PM\\]** [A high resolution version of the image has been made available for download.](https://twitter.com/GambleMike/status/1722017167389172097) The nightlife scene clearly shows Angarans, Salarians, Humans, Hanar, Volus, Krogans, and Asari. The image also possibly shows a Geth and male Quarian to the left of him and the Angara. This implies that the Quarian Ark, which held Elcor, Quarians, Drell, Volus, Batarians, and Hanar may have reached Andromeda. Drell and Angarans have been shown before in the Mudskipper teaser image.\n   * **\\[6:15 PM\\]** Some fans are also saying they see a younger looking Krogan in the image, similar to Grunt.\n\n[N7 Day 2023 teaser image](https://preview.redd.it/zfocw9u030zb1.png?width=1125&format=png&auto=webp&s=f3f74d18b0879131b51ce2981f32e28b6023922b)\n\n* **\\[5:53 PM\\]** [Mike has confirmed that the art director for the new game is the same from the OT](https://twitter.com/GambleMike/status/1722020852475302201).\n* **\\[7:20 PM\\]** Fans have pointed out that EPSILON-OCULON-NEBULA form the acronym \"EON\"\n* **\\[11:01 PM\\]** [Mike has left us with another cryptic tweet, tagging the dev lead Parrish Ley](https://twitter.com/GambleMike/status/1722081366312149455):\n\n>[@parrish\\_ley](https://twitter.com/parrish_ley) they still havent found the other part. the one i was afraid of them finding. whew.\n\n# Events\n\n* Mark Meer, Jennifer Hale, and other cast members will be reuniting for a virtual \"party on the Citadel.\" It will be hosted on [Jennifer Hale’s YouTube channel](https://www.youtube.com/watch?v=FGf2-KVB8pA) on Sunday, November 12 at 1:00 PM Pacific Time (NOT on N7 Day). ([SOURCE](https://www.instagram.com/p/CzRLk5GIo6l/))\n   * The cast is also signing prints individually throughout the week via Streamily:\n      * [Mark Meer](https://streamily.com/markmeer) (Shepard)\n      * [Jennifer Hale](https://streamily.com/JenniferHale) (Shepard)\n      * [Ali Hillis](https://streamily.com/AliHillis) (Liara)\n      * [Ash Sroka](https://streamily.com/AshSroka) (Tali)\n      * [Raphael Sbarge](https://streamily.com/RaphaelSbarge) (Kaidan)\n      * [William Lewis Salyers](https://streamily.com/WilliamSalyers) (Mordin)\n      * [Keythe Farley](https://streamily.com/KeytheFarley) (Thane)\n\n# Other Content & Articles\n\n* [Former unionized QA testers are picketing today. Additionally, on the heels of a lawsuit by laid-off devs for severance pay, former devs are asking fans to use the hashtag #N7SeveranceDay to bring awareness to the issue.](https://www.gamesradar.com/mass-effect-fans-and-devs-use-n7-day-2023-to-send-a-message-to-bioware-following-layoffs-and-low-severance-pay/)\n\n# Sales & New Merchandise\n\n* The Mass Effect Legendary Edition is currently on sale for 84% off on both [Steam](https://store.steampowered.com/app/1328670/Mass_Effect_Legendary_Edition/) and the [EA App](https://www.ea.com/games/mass-effect/mass-effect-legendary-edition/buy/pc), bringing the price down to less than $10 USD! The sale ends Nov 9, so now is a great time to buy the trilogy at its best.\n* [Dark Horse has announced a new limited-edition FemShep statue today. Only 1,000 units will be made.](https://www.gamespot.com/articles/mass-effect-commander-shepard-lives-again-as-a-highly-detailed-collectible-statue/1100-6518935/) She appears to be wearing the N7 armor from Mass Effect 2.\n   * Dark Horse will also be releasing Tali and Wrex statues among their [Liara, Garrus, and Reaper statues](https://www.gamespot.com/articles/new-mass-effect-figures-from-dark-horse-are-up-for-preorder/1100-6518008/).\n* [Humble Bundle is offering a bundle with the Mass Effect and Dragon Age comics](https://www.humblebundle.com/books/dragon-age-and-mass-effect-comics-dark-horse-books).\n* Volante will be releasing a Garrus parka in addition to their [N7 line](https://www.volantedesign.us/collections/mass-effect-collection).\n* [Sanshee](https://sanshee.com/collections/mass-effect) will have some new plushees.\n* Bioware Gear Store also has some new releases including an N7 desk mat, N7 helmet plant potter, and more.\n\n# 20% Off Bioware Gear\n\nIf you want to support the subreddit, you can use the below codes to buy some cool merch from the Bioware Gear Store. [Learn more about how 100% of the commission from these codes will be used to fund giveaways and events in the subreddit here.](https://www.reddit.com/r/masseffect/comments/ulae4k/attn_n7_recruits_rmasseffect_needs_your_input/)\n\nCodes are for 20% off regular priced merchandise. Codes are valid only at [gear.bioware.com](https://gear.bioware.com/) and expire at the below listed date. Each code can only be used 10 times, so there may be a limit on how many people can use it. Codes are not valid for pre-order or sale/discounted items. Codes should work internationally.\n\n>~~BW1NN4FE (expires 11/13/2023)~~ (ran out of uses)  \n>  \n>~~BWFKVG3H (expires 11/14/2023)~~ (ran out of uses)  \n>  \n>~~BWTJ7IOM (expires 11/14/2023)~~ (ran out of uses)  \n>  \n>~~BWBZXFLH (expires 11/14/2023)~~ (ran out of uses)  \n>  \n>BWKYK2YB (expires 11/15/2023)  \n>  \n>This will be the final code as we have reached the limit on codes that can be generated this week! Thanks for supporting the subreddit!",
        "num_comments": 610,
        "comments": [
            "I dont know about the rest of you, but Im gonna need that coat.",
            "WILD Take:  \nHuman defiance. Not everything is as it seems. Maybe this is an antagonist we're looking at.",
            "Just played the Legendary Edition. This game really saved me from a morbid low. I am thankful for the Normandy crew. Keelah se'lai, my friends...",
            "That N7 coat is *gnarly* tho",
            "Welp, see you guys next year",
            "Im Commander Shepard, and this is my favorite stickied post on this subreddit. Happy N7 Day to all Shepards.",
            "You can see a krogan in the background at the very beginning.  And the windows in the background have flying cars going by, so its an inhabited planet wherever they are.",
            "How do you guys think the story will start? Here's my idea:\n\nArk 6 is sent away but gets stuck in the Serpent Nebula due to the energy outburst in the destroy ending. Liara finds the ark with the help of the distress signal and boards it and so does our new protagonist. They repair the ark and they go to Andromeda.",
            "You guys. This is kind of fun. Solving the clues ",
            "Michael Gamble says to \"Look closely\""
        ]
    },
    "Attention N7 Recruits! The subreddit is looking for new mods!": {
        "title": "Attention N7 Recruits! The subreddit is looking for new mods!",
        "score": 59,
        "url": "https://www.reddit.com/r/masseffect/comments/198fgfv/attention_n7_recruits_the_subreddit_is_looking/",
        "content": "Do you love Mass Effect and spend a lot of time on Reddit? [r/masseffect](https://www.reddit.com/r/masseffect) is looking for new mods! \n\n[by anon\\_04111 in old ME forums](https://preview.redd.it/9k1sz6rsjvcc1.png?width=960&format=png&auto=webp&s=c8915e1493ec8bac4952dcc59efb367e0d4ace39)\n\nWe will be considering your Reddit history, activity in the sub, prior moderating experiences, and answers to the application questions at the link below. We are looking for users that are active, passionate about Mass Effect, good-tempered, and willing to put in some free time! \n\nPlease note that we may message you with follow-up questions. Use this form to apply:\n\n[https://forms.gle/ycuxAEXUV1yprZGn9](https://forms.gle/ycuxAEXUV1yprZGn9)\n\nAll information submitted through this form will be available to the current moderators of [r/masseffect](https://www.reddit.com/r/masseffect/) only and will not be made public or shared with anyone else.",
        "num_comments": 15,
        "comments": [
            "Welp, best of luck with candidates.",
            "I'd throw my hat in the ring, but honestly I don't think I'd be able to dedicate enough time to feel like I'd be doing the community justice.",
            "RIP is this sub slowly dying out?",
            "Wish I had more time to dedicate, but too busy modding elsewhere + IRL. Hope your team gets some great candidates to keep the community clean and thriving =)",
            "Sorry this is more of a general subreddit/modding thing, but would it be possible to not archive threads that aren't even one year old yet? The games themselves are pretty old at this point and older threads are still relevant",
            "as long as this sub is run by those idiots who run N7 Squad I think this sub will be fine",
            "Why would a search for new mods indicate that the sub is dying? As a matter of fact, the opposite has been occurring, especially since the LE, and that's why I need more help.",
            "hey! This is a very valid callout. I've turned off archiving so old posts should now be available to comment on :)",
            "Yea I was jw. That's good that it seems relatively healthy. Feel like this is one of those franchises that lost a lot of momentum after the 360/PS3 generation (a la gears of war, halo, metal gear solid, etc). The fanbases are hungry and committed, but random \"non-fans\" are, imo, less likely to get into it now that the overall hype around the series has more or less faded away \n\nI'm a big ME fan btw. Just wishing these series can continue their former quality and glory",
            "Yeah, there's probably just not a lot of newcomers at this point other than maybe when the Legendary Edition goes on sale. \n\nI guess we'll see, but I think Mass Effect is still a big enough name to draw people in whenever the new game is fully announced."
        ]
    },
    "ME2 is my all time fave PT, what is yours?": {
        "title": "ME2 is my all time fave PT, what is yours?",
        "score": 145,
        "url": "https://www.reddit.com/gallery/1dr9hok",
        "content": "It’s also the game I replayed the most ❤️",
        "num_comments": 52,
        "comments": [
            "One is my fav, for the most part. But as for \"replayed\", I ALWAYS do the trilogy, immediately one into the next. I never treat them as individual games",
            "ME3 combat wise its the best and also the story itself. I like the concept to make allies all over the galaxy and fight for the Same goal. It literally gives me goosebumps. \nThe Collectors story in ME2 was not my personal fav. But I agree the trilogy itself is a full game and you cant really split them. Its like Lord of the Rings. Every part is different but all together its just epic.",
            "ME2 too, missing Wrex and Javik though",
            "I feel like we need at least 4 more of these to cover Tali, Grunt, Samara, Jacob, Miranda, Mordin, Kasumi, Zaeed, Kaiden, Ashley, EDI, and Javik",
            "2 is the funnest to replay but ME3 is probably my favourite. I love 1 but the combat system ruins it for me.",
            "Nowadays its honestly a tie between ME2 and 3 for me (I adore the combat of the 3rd one). Id still say ME2 is my favorite videogame of all time",
            "Yeah ME2 is my favorite of ME trilogy ME1 has points that drag and ME3 I feel more diplomat than soldier",
            "Its so fucking great. I could talk about if for hours. The best character development and characters in general.",
            "What did you love about ME1 the most?",
            "You make some great points here... I do love ME1 too purely because of Saren"
        ]
    },
    "\"Should we tell Joker? No, its fun wathching him break his legs while limping to the toilet.\"": {
        "title": "\"Should we tell Joker? No, its fun wathching him break his legs while limping to the toilet.\"",
        "score": 94,
        "url": "https://i.redd.it/17y0qdodbi9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "They might break his bones just trying to operate on him.",
            "LMFAO I NEVER PUT THESE TWO TOGETHER! #BonesForJoker",
            "I made a post once about how they MUST have the technology in the ME universe to make Jokers condition obsolete. It didnt go well! \n\nPeople are sensitive about that stuff. I guess it takes away from his identity as a person with a disability. Its really cool that they wrote the character that way but Im with ya, they probably have the technology to help him!",
            "Jeff isn't worth the investment. You don't need functional legs to fly the SR-2 lol. \n\nAnd that's an entirely Cerberus thing to do.",
            "I'm sure there's some downside to having these. Either the success rate is low, it requires a lot of maintenance, or carries the risk of future mefical complications. There's also the possibility that these exist solely as part of the game's upgrade mechanic, and don't actually canonically exist in-universe.",
            "Yeah, to me it's pretty clear that Joker's condition is easily treatable in Mass Effect's setting. I try to headcanon it as it being something not covered by any insurance and it's very expensive otherwise. But Cerberus likes spending money on Shepard.",
            "You still need to be able to survive the surgery. If you can't survive the surgery for new bones then it makes the new bones kind of a non issue.",
            "So alliance marines have genetic augmentation for combat effectiveness. For joker to do it I would assume it would require an immense amount of money that he just doesnt have on a flight lieutenants budget",
            "I believe some where in the lore Joker turned down trying to fix it, because he believes it might ruin his ability to pilot or he isn't as unique as a pilot if he is like everybody else.",
            "I mean, he tells us if he were born earlier he wouldn't be alive, so Joker is apparently already a medical miracle. Like, being able to hobble around is probably far beyond what people with Vrolicks (sp?) could do even a generation before"
        ]
    },
    "This time around, I tried not to despise Miranda from the start, and it lasted until I heard this": {
        "title": "This time around, I tried not to despise Miranda from the start, and it lasted until I heard this",
        "score": 730,
        "url": "https://v.redd.it/s3qqes93xd9d1",
        "content": "",
        "num_comments": 336,
        "comments": [
            "So do you just never talk to/befriend her?  Because if you do, she does a total 180 and stands right beside Shepard when the chips are down.",
            "Seems perfectly in character for how she started out",
            "Damn yall ever hear of a thing called character development",
            "Fans: \"We want complex well written characters!\"\n\nAlso fans when a character doesn't worship the player character or has an unlikable trait:",
            "In all fairness, what did Shepard do the second they had the opportunity? *Start killing all of Cerberus' men*.",
            "Where did you get that outfit OP?\n\nAs for the topic, I understand all of the criticisms on Miranda, and still love her to bits. Her growth throughout the series is a personal highlight for me.",
            "I always think its so weird how Miranda talks about wanting to put a chip in Shepard in ME3 like its some big revelation, despite the fact that she was pretty open about it in ME2.",
            "Shepard's \"Are you always this much of a bitch or am I the exception?\" will never not be funny",
            "Yeah Miranda is the quintessential Ice Queen archetype and her heart gradually melts being around Commander Shephard. She eventually becomes a sweetheart and she comes off much more cool than bitchy.\n\nThat said, it's almost impossible for me to think of her as the second-in-command of the Normandy SR2 and commanding the respect of the crew over someone like Garrus Vakarian, and it's impossible for me not to pick Garrus as the the leader of a team in a choice later in the game.",
            "I swear half this sub doesnt understand character development when it comes to Ash and Miranda lol"
        ]
    }
}