{
    "What to do if you suspect a person is planning a mass shooting": {
        "title": "What to do if you suspect a person is planning a mass shooting",
        "score": 1112,
        "url": "https://www.reddit.com/r/masskillers/comments/114mx2z/what_to_do_if_you_suspect_a_person_is_planning_a/",
        "content": "There have been a lot of posts lately asking what to do if you suspect someone is planning to commit a mass shooting/mass attack of some kind. \n\nIf your suspicions are offline, local, and personal/someone you know personally: \n\nIf it is not an immediate threat, call your local non emergency line. They will collect information from you, and investigate further if need be. Remember, wellness checks can be requested as well.\n\nIf it is an immediate threat, call 911 (or your local equivalent emergency line). An immediate threat would be someone making direct threats.\n\n\nIf the possible threat is exclusively on Reddit, please reach out to us via Modmail. Often times, people who are being reported to us have made comments in the past that you cannot see as they’ve been removed by other means such as automod, for example. We also work with multiple other teams to gather information and build one report to FBI with as much information as we can possibly get in one single report.\n\nThis allows all information to be placed at once instead of multiple vague reports to the FBI, which can slow down resources.\n\nAt the very least, these processes will build a history for this person. If they are reported and nothing comes from it, a report a year later could help immensely. This happened through one sub I moderate on, and helped bring an arrest a year later when more threats were made, and the suspect was found with weapons and a manifesto.\n\nWe take all reports sent to us seriously, and we thank you all for helping us with these reports.",
        "num_comments": 143,
        "comments": [
            "I do remember some years back that r/Columbine successfully stopped a potential mass shooting from happening, due to concern from both the mod team and the users of the sub. Not sure why some people here are implying that it couldn't have happened as there were actual news articles about that individual being arrested and having both the means and will to carry out such an act. If they desired to I'm sure they could find the thread about that incident.\n\nIt also makes sense that the mods of this subreddit would have access to content and resources that most of us wouldn't, since I'm sure most removed comments/posts are logged somewhere that you-all can see and refer to if a problem arises. Likewise it's better to let the mods handle it instead of it turning into some kind of weird witch hunt as such instances often do on Reddit, like the Boston Marathon bombing manhunt which smeared an innocent man's reputation, or the countless more 'unsavory' true crime subs here that will throw out random names without due diligence. The subs about the Delphi murders and the University of Idaho killings are prime examples, people over there have a new suspect every week even if the actual suspect is currently in custody.\n\nThese situations can get out of hand pretty quickly and have real life consequences, and unlike most subs I generally get the idea that the mods here are acting in good faith.\n\nThe individual below who is implying that the mod team have a vested interest in _not_ reporting these incidents to law enforcement simply because they have an interest in this topic is pretty insane. Most people who are interested in this subject have that interest because they want to get to the bottom of what causes an individual to carry out an attack, ideally so that we can recognize the warning signs and potentially avert a tragic result. There are, doubtless, some here that likely have an interest in this subject for unsavory reasons but I'd bet the majority are the former category. There are more than 132,000 readers subbed here so to imply that anyone with an interest in this topic is probably planning something would be pretty terrifying. It'd be like implying that anyone interested in true crime/interrogations is a future serial killer, despite the fact that the audience for that content is _massive_. \n\nI've been here for quite a while and I've never had any reason to mistrust the mods, they seem like they genuinely care about this topic and they also seem to care about the quality of discourse here, so I have no doubt that they also take reports of this nature seriously. \n\nAnyway, this is one of the best subreddits on the platform in my opinion and it's especially surprising how well it has been maintained even though it has experienced an incredible amount of growth over the past couple of years.",
            "I know two people in my life who I think have a potential of committing murder or mass murder, one hordes guns, has like 5 AR-15s with illegal mods and attachments and like a 2,000 sniper rifles and tons of pistols and shotguns.   He talks about his guns in terms of what they do to a human body.   He doesn’t have many friends, is pretty depressed and anti-social, he’s stable at the moment but if he snapped or became pissed people could die.  I have no idea how to report any of that because technically it’s not illegal enough for anyone to care.\n\nI have another friend who has guns and has gone full on mass shooter schizo with like, paranoid delusions and he cut off all his friends and blames the whole world around him for his problems and hates everyone / has no respect for life, he’s also suicidal.  I honestly believe he’ll kill someone, could be me because he decided to hate me, might be himself or anyone he has a grudge against, but there’s literally nothing I can do about it because none of it is illegal unless he makes a specific threat or kills someone",
            "Love to see this sub used for these efforts.\n\nI remember a little while back, there was a guy posting here and saying that he had matched with someone on omegle who said they were planning to bomb their school - but the guy was in Peru and couldn't get in touch with stateside authorities, so I called the NH non emergency number and got a call back a couple hours later from a cop following up to investigate. The guy was probably just being edgy, but I was glad that they took it seriously and followed up.\n\n&#x200B;\n\nEDIT: typo",
            "[deleted]",
            "There is no such thing a wellness check.not in this world.\n\n In 2016 I had two jobs and worked 7 days per week. \n\nOne Saturday afternoon I was just exhausted. Called my weekend boss and said I needed a day off or I should just kill my self.\n\nHe called the cops and said one of his employees was going to SHOOT himself. I have never owned a gun. But that didn’t stop a SWAT team storming my house and arresting me. I remember telling the cops “I just wanted the day off”\n\nI reiterate that Wellness checks do not exist. Andy Griffith is not going to to knock on your door and see if you are ok. A massive police force is going to secure the scene.",
            "At what extent is it time to contact officials, because personally i am having trouble to pass the feeling that i am overreacting. I recently witness a classmate who sat in front of me searching up gun ranges. And now everytime i go into class i immediately spot him to sit away from him, and he is in everyone of my classes.",
            "I tried to report someone, and The Suicide Watch mods  said this isn't true and to report directly to reddit admins. They then suggested that mass murder ideation is OK and told me I was creating a panic. I'm confused.",
            "Befriend them and snitch on them. I heard that one dude wanted to shoot up his school and they found out when he was alone his friend and 2 others heard the potential shooter say, “I wish I can shoot myself and everyone here” they weren’t playing and immediately swat surrounded the school and locked the kid up. Not taking chances",
            "How does one use mod mail?",
            "Thank you for pinning these tips and resources!"
        ]
    },
    "Mugshots for Pete Arredondo and Adrian Gonzales, the two school police officers indicted for child endangerment and negligence in relation to the botched police response to the 2022 Uvalde school shooting ": {
        "title": "Mugshots for Pete Arredondo and Adrian Gonzales, the two school police officers indicted for child endangerment and negligence in relation to the botched police response to the 2022 Uvalde school shooting ",
        "score": 320,
        "url": "https://i.redd.it/ij82tjntyd9d1.jpeg",
        "content": "",
        "num_comments": 45,
        "comments": [
            "Source: https://x.com/BNONews/status/1806802550978654366\n\nIt's about damn time we saw these.",
            "They deserve this, but I just see two scapegoats. That whole system needs to be redone top to bottom. There are probably 20 more cops who should be right beside them",
            "Are they getting an endangerment charge for each victim?",
            "I hope they rot in prison, these absolute scumbags prioritized their lives over defenseless children while they had body armor and rifles.",
            "Are they going to jail? For how long. So fucking deserved.",
            "funny that they look more like killers than SR",
            "now do the same to the whole department",
            "Inject this shit into my veins.",
            "I’m wondering if 10 counts equals 10 kids who should have lived but were shot later in the 77 minutes",
            "fuck yes!"
        ]
    },
    "Bodycam footage of the ambush that left 2 Bristol, Connecticut police officers dead and another one injured + exterior camera video from a passing Tesla driver": {
        "title": "Bodycam footage of the ambush that left 2 Bristol, Connecticut police officers dead and another one injured + exterior camera video from a passing Tesla driver",
        "score": 396,
        "url": "https://v.redd.it/qojri5a0sc9d1",
        "content": "The shooter, Nicholas Brutcher, was shot and killed by the injured officer",
        "num_comments": 61,
        "comments": [
            "From the final report by the attorney general: (fair warning, some of the photos are graphic, none show the deceased officers)\nhttps://www.scribd.com/document/745665780/06262024-Bristol-Report\n\nOctober 12, 2022 - Officer Hamzy, Officer Iurato, \r\nand Sergeant DeMonte responded to 310 Redstone Hill Road. Officer Hamzy and Sergeant \r\nDeMonte parked their police cruisers directly in front of the house on the south side of \r\nRedstone Hill Road facing east. Officer Iurato parked his cruiser on the north side of the street \r\nfacing west. All three officers exited their cruisers and walked up the driveway to the side door \r\nof the house. As they approached the driveway, Officer Hamzy mentioned, “I went to school \r\nwith this kid.”\r\n\nUnbeknownst to the officers, Nicholas Brutcher had hidden himself near some bushes at \r\nthe front of the house next door. This house, 328 Redstone Hill Road, was the home of \r\nBrutcher’s parents, Joseph and Catrina Brutcher. Nicholas Brutcher was outfitted with a \r\ncamouflage shirt and pants as well as a camouflage vest. He was armed with an AR-15-style \r\nrifle and at least one handgun. He also had several magazines of ammunition. From this \r\nposition, Nicholas Brutcher had a direct line of sight on the officers as they walked up the \r\ndriveway. \r\n\nThe house at 310 Redstone Hill Road has a detached garage. An open breezeway \r\nconnects the house and garage. As the officers approached the house, they observed a \r\nshotgun leaning against the garage. Officer Hamzy examined the shotgun. Nathan Brutcher \r\nwas inside the house and appeared in the doorway. Officer Iurato ordered him to come \r\noutside. As he exited the house, Nathan Brutcher said, “I don’t even have my phone.” \r\n\nAt that moment, from his position on the neighboring property, Nicholas Brutcher \r\nunleashed a volley of gunshots. He fired these rounds from the AR-15-style rifle. All three \r\nofficers were hit, as was Nathan Brutcher. Officer Hamzy fell first. Nathan Brutcher retreated\r\ninto the house. Sergeant DeMonte proceeded through the breezeway into the rear yard and \r\nsaw Joseph Brutcher. He then returned to the driveway and toward Officer Hamzy where he \r\ncollapsed onto the pavement. Officer Iurato, who was struck in the upper right leg area, also \r\nmoved away through the breezeway to the rear yard. \n\nNicholas Brutcher emerged from his \r\nposition next door and approached the fallen officers. \r\nNicholas Brutcher walked to the driveway and toward Officer Hamzy and Sergeant \r\nDeMonte. Nicholas Brutcher’s parents, who had come outside and in the rear yard of their \r\nhome, saw what happened next. Nicholas Brutcher proceeded to stand over each officer and \r\nfire multiple shots into them – first Sergeant DeMonte and then Officer Hamzy. Upon seeing \r\nthis, Catrina Brutcher began to scream uncontrollably for Nicholas Brutcher to stop. At one \r\npoint, Nicholas Brutcher’s AR-15 stopped firing (he had incorrectly inserted the magazine) and \r\nhe switched to a handgun and continued firing. During this time, Nicholas Brutcher yelled, \r\n“How proud are you of me? How proud?”\n\nOfficer Iurato moved along the back of the house emerging in the yard of the house on \r\nthe west side of 310 Redstone Hill Road. He radioed for assistance and continued moving until\r\nhe reached the police cruisers parked on Redstone Hill Road. Officer Iurato heard sounds\r\nindicating that Nicholas Brutcher was attempting to load a firearm. From his position, Officer \r\nIurato could see Nicholas Brutcher who was still in the driveway in front of the garage. Bracing\r\nhimself against Officer Hamzy’s cruiser, Officer Iurato fired one shot striking Nicholas Brutcher \r\nat the base of his skull killing him.",
            "Police officer at end with the one shot kill was legit 👌",
            "Thats crazy what was the motive? Did the brother survive",
            "everybody needs to watch what lead up to this. its bizarre",
            "The sounds of this video is very unnerving. The mother screaming is so sad.",
            "When they released the full footage yesterday it made me tear up. It's disgusting to know that  that single gunshot while Iurato is standing at the tree is the shooter executing downed officer DeMonte. Then seconds later that entire burst of gunfire is him firing directly into Hamzy's face and chest. Absolutely sickening",
            "Ok what the fuck the “need an ambulance, need an ambulance” moan at 2:25 left in the Reddit player is pure fucking nightmare fuel. Those were his last words as he gets mag dumped a few seconds later. Holy shit some people are just depraved of humanity.",
            "Jesus fuck. People are nuts man.",
            "Where was the shooter in the beginning ? In the house ?",
            "Great shot by the officer.. Deep breath, ended it!"
        ]
    },
    "Survivor of Parkland school massacre wins ownership of shooter's name in lawsuit settlement": {
        "title": "Survivor of Parkland school massacre wins ownership of shooter's name in lawsuit settlement",
        "score": 92,
        "url": "https://apnews.com/article/parkland-stoneman-douglas-shooting-nikolas-cruz-99026cc37e145980dd763e1fd5b0952d",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Borges literally owns cruz's body now",
            "FORT LAUDERDALE, Fla. (AP) — The most severely wounded survivor of the 2018 massacre at Parkland’s Marjory Stoneman Douglas High School now owns shooter Nikolas Cruz’s name, and Cruz cannot give any interviews without his permission, under a settlement reached in a lawsuit. \nUnder his recent settlement with Anthony Borges, Cruz must also turn over any money he might receive as a beneficiary of a relative’s life insurance policy, participate in any scientific studies of mass shooters and donate his body to science after his death. \nThe agreement means that Cruz, 25, cannot benefit from or cooperate with any movies, TV shows, books or other media productions without Borges’ permission. Cruz is serving consecutive life sentences at an undisclosed prison for each of the 17 murders and 17 attempted murders he committed inside a three-story classroom building on Feb. 14, 2018. \n“We just wanted to shut him down so we never have to hear about him again,” Borges’ attorney, Alex Arreaza, said Thursday. \nBorges, now 21, was shot five times in the back and legs and collapsed in the middle of the third-floor hallway. Video shows that Cruz pointed his rifle at Borges as he lay on the floor, but unlike most of the other victims he walked past, did not shoot him a second time. Arreaza said he asked Cruz why he didn’t shoot Borges again, but he didn’t remember. \n\nA promising soccer player before the shooting, Borges has undergone more than a dozen surgeries and still lives in pain. He received donations, a $1.25 million settlement from the Broward County school district and an undisclosed settlement from the FBI for their failures in preventing the shooting. Arreaza said it is difficult to say whether Borges has received enough money to cover his future medical expenses. \n\n\nSeveral other families also sued Cruz, and a mini-trial had been scheduled for next month to assess damages against him. That trial has been canceled, Arreaza said. David Brill, the attorney representing the other families, did not return a phone call and two email messages seeking comment. \n\nFlorida already has laws that prohibit inmates from keeping any proceeds related to their crimes, including any writings or artwork they might produce in prison. In addition, Judge Elizabeth Scherer, when she sentenced Cruz, ordered that any money placed in his prison commissary account be seized to pay restitution to the victims and their families and all court and investigation costs. In total, that would be millions of dollars. \nArreaza said he feared that without the settlement, Cruz could find a way around the law and the judge’s order or assign any money he might receive to a relative or other person. \nBorges, the families of those Cruz murdered and other survivors are also suing former Broward County sheriff’s deputy Scot Peterson, the sheriff’s office and two former school security guards, alleging they failed to protect the students and staff. No trial date has been set. Peterson was acquitted of criminal charges last year.",
            "I’ve never heard of something like that, this is wild. Good for them though.",
            "Good to hear the little rat is losing more of his sovereignty.",
            "Great! They should do this with all of the mass shooters.",
            "This is fucking hilarious lmfao",
            "Didn’t even know this was a thing you can do. Lmao good for them",
            "Never seen something like that Happening before",
            "Holy shit",
            "That's incredibly fascinating I've never heard of something like that before."
        ]
    },
    "Eric harris driving his 1986 gray Honda Prelude": {
        "title": "Eric harris driving his 1986 gray Honda Prelude",
        "score": 15,
        "url": "https://v.redd.it/yl3i8lssog9d1",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}