{
    "Quick Questions: June 19, 2024": {
        "title": "Quick Questions: June 19, 2024",
        "score": 14,
        "url": "https://www.reddit.com/r/math/comments/1djmq96/quick_questions_june_19_2024/",
        "content": "This recurring thread will be for questions that might not warrant their own thread. We would like to see more conceptual-based questions posted in this thread, rather than \"what is the answer to this problem?\". For example, here are some kinds of questions that we'd like to see in this thread:\n\n* Can someone explain the concept of maпifolds to me?\n* What are the applications of Represeпtation Theory?\n* What's a good starter book for Numerical Aпalysis?\n* What can I do to prepare for college/grad school/getting a job?\n\nIncluding a brief description of your mathematical background and the context for your question can help others give you an appropriate answer. For example consider which subject your question is related to, or the things you already know or have tried.",
        "num_comments": 85,
        "comments": [
            "I finished my maths BSc nearly 7 years ago, and recently started thinking about mathematical topics again and am loving it, but I'm not really sure where to go to continue learning. Any suggestions for books, YouTube channels, or other routes and resources I might take to start studying maths a bit again?",
            "Hey there. I figured out what I think is a cool equation, and I was wondering if had a name. Here’s the equation:\n\ny=+-(c1xln(x)+c2x+c3)\nWhere c1, c2, and c3 are constants and c1/=0.\n\nThe reason this equation is cool is that the y-intercept of the line tangent to the equation goes from -infinity to infinity at a constant rate as you move along the graph at a constant rate.\n\nI’m sure I’m not the first to figure this out, so does anyone know if this has a name? And if so, does it have any practical applications?\n\nA little background if anyone’s curious, I started think about this when I was driving my car a while ago. The driver in front of me was driving terribly, so I wanted to look in their side window and see who was driving. But then they turned at such an angle while I kept going straight, such that I could only ever see the back of the car. Then I started to wonder what curve they would have to take such that I could only ever see the back of their car, assuming we both kept going at a constant speed, and I kept driving in a straight line. And then the above equation is what I got when I sat down to figure it out.",
            "I'm going into precalc this sophomore year, though im learning calculus right now as ive finished the trig i need to know for calculus, is it possible to learn to write proofs at my level?  Understanding things on a conceptual level in math is very satisfying and an unparalleled feeling for me.  Are there any book recommendations for beginners like me to write basic proofs that include logic?",
            "[an advanced maths textbook from my school days, on pg. 134](https://drive.google.com/file/d/1P0Oj4xiYFT8TGnZdbtwwm2Ts4ltTbRmN/view), included a circle drawing technique without compass. here's my rough translation of the technique (called 3 1 - 1 1 - 1 3 in the textbook):\n\n- from point A, mark point B at 3 units left and an unit down of A and draw a curve between them\n\n- from B, draw the curve to point C where C is one unit left and an unit down of B\n\n- from C, draw the curve one unit left and 3 units down before marking point D\n\n- repeat and reverse those three steps accordingly till the curve is closed at A\n\n(quick proof in the text book: let O be the curve's centre, then OA = OD = 5 and OB = OC = 5 per Pythagorean theorem, as such A, B, C and D all lie on the circle (O, 5) )\n\ni'm curious whether this technique was shown and proved elsewhere, as well as whether the technique can be adapted for hand drawing other curves or curved shapes too.\n\nmany thanks.",
            "Take n circles with different radii r_i in R^2 , I'm trying to find the radius of the smallest circle that could fit all n circles in it with no overlap. I'm pretty sure this is a very difficult problem, but does anyone have any insight on how I could solve/approximate this?\n\nIn case it helps, the practical situations I'd use this for would be restricted to n<=20 and only a handful of possible values for r_i (most circles would be the same size, with maybe up to 5 total different sizes). The final result could also be off by a few percent without being an issue, so approximations would already be hugely helpful.",
            "I have started going through John Lee's *Introduction to Topological Manifolds* and wanted to see other examples of solutions of the problem 2-5a) Give two subsets of ℝ^2: X,Y and a function f: X -> Y such that f is open, but neither closed nor continuous. I found this solution on scribd.com:\n\nX = B₂(0,0) \\ ∂B₁(0,0), so a ball radius 2 without a circle radius 1 all centered at (0,0). Y = B₄(0,0). f is then defined as f(x,y) = (x,y), when (x,y) is in B₁(0,0); and (2x,2y), when (x,y) is in X \\ B₁(0,0).\n\nIt states that the function is \"*clearly not continuous*\", but I think otherwise. Going off of the topological definition, any preimage of an open ball in Y will either be an open ball in X, or a \"half-ball\" being cut off at the boundary of B₁(0,0). However since that boundary is not in X by its definition, the pre-image is still open.\n\nIs the given example wrong or am I missing something?",
            "Suppose Fq is a finite field, how would I go about finding out how many primitive elements Fq^n has over Fq?",
            "Are there any online sources I can use to review Calculus 3 and Differential Equations?",
            "Is there a more efficient way to prove that the localization of a ring is a ring? The proofs I've seen have been just a lot of simple algebraic manipulations (in my opinion quite dry), but maybe there is a shorter way to show this fact.",
            "I am looking for an easy-to-read book on manifolds, preferably with a lot of examples. The concept was introduced in my real analysis class. Since it is really abstract, I am looking to become more familiar with it by exploring examples and problems. Does anyone have a good book recommendation?"
        ]
    },
    "Career and Education Questions: June 20, 2024": {
        "title": "Career and Education Questions: June 20, 2024",
        "score": 9,
        "url": "https://www.reddit.com/r/math/comments/1dkf7b6/career_and_education_questions_june_20_2024/",
        "content": "This recurring thread will be for any questions or advice concerning careers and education in mathematics. Please feel free to post a comment below, and sort by new to see comments which may be unanswered.\n\nPlease consider including a brief introduction about your background and the context of your question.\n\nHelpful subreddits include [/r/GradSchool](https://www.reddit.com/r/GradSchool), [/r/AskAcademia](https://www.reddit.com/r/AskAcademia), [/r/Jobs](https://www.reddit.com/r/Jobs), and [/r/CareerGuidance](https://www.reddit.com/r/CareerGuidance).\n\nIf you wish to discuss the math you've been thinking about, you should post in the most recent [What Are You Working On?](https://www.reddit.com/r/math/search?q=what+are+you+working+on+author%3Ainherentlyawesome&restrict_sr=on&sort=new&t=all) thread.",
        "num_comments": 10,
        "comments": [
            "Helloo,\n\n**TL;DR: Applied math undergrad looking to transition to pure math for master's at good EU universities. Seeking advice on feasibility, areas to focus on, specialization selection, and improving my chances of acceptance.**\n\nI'm considering applying for master's programs in pure mathematics good universities in Europe (excluding the UK), such as Bonn, Uni of Pisa , ETH Z, EPFL, TUM, Uni of Vienna, etc. However, my bachelor's degree focused heavily on applied mathematics, statistics, and some physics.\n\nAcademic Background:\n\nI completed a bachelor's degree in statistics, with mathematics and physics as my minors. My coursework included calculus (including multivariable), linear algebra, differential equations, statistics, and physics (thermodynamics, quantum mechanics etc.)\n\nI'm particularly interested in understanding the following:\n\n- How feasible is it to transition from an applied mathematics background to studying pure mathematics at the graduate level, especially for top universities in Europe?\n- Are there specific areas of pure mathematics that I should focus on strengthening my knowledge in before applying to these programs?\n- Do good EU universities with a low acceptance rate like Bonn, ETH , EPFL etc., welcome applicants with applied mathematics backgrounds who want to pursue pure mathematics?\n- Considering my background, would it be more advisable to apply for applied mathematics master's programs initially and then shift towards pure mathematics if possible?\n\nAdditionally, my counselor has advised me to mention my desired specialization in my SOP as it increases the chances of admission, but since I've just started learning higher level pure math subjects, I'm unsure which specialization to select. Is there a quick and easy way to determine which higher-level math subjects you truly like if you don't know much about them yet?\n\nDo I actually have a chance of getting into these good universities with my current background? Is there anything I can do to improve my chances? (I am studying passionately and extensively every day to fill my gaps)\n\nI would greatly appreciate any advice, personal experiences, or recommendations from those who have insights into this topic. Thank you in advance for your help!",
            "Just finished my undergraduate, I am trying to look ahead to my masters and think about what I want to explore during it. I am curious what are some areas that are worth checking out, given that the following were things that I had fun with during undergrad:\n\nFinite Group Representations\n\nSymmetric Polynomials\n\nTensors\n\nMapping Class Groups\n\nKnots/Braids\n\nConfiguration Spaces\n\nHilbert/Banach Spaces\n\nMarkov Chains\n\nConvergence Theorems\n\nMeasure Spaces\n\nMixing and other things Ergodic\n\nAny recommendations of an area to check out before the semester starts to see if I want to spend more time on it?",
            "What are some good careers that involve math that aren't for evil corporations?",
            "Hello everyone.\n\nI'm looking for suggestions for companies to apply to. I have a Masters Degree in Data Analysis with about 1 year of experience. I'd like to find companies in Florida as that's where I live. The following lists are things that the job should have to work best with me, things I'd like the job to have and any bonus points towards the company. Please let me know your thoughts and have a good day.\n\n**Need**\n\n* Pay >= $90K/Year \n* Remote option available\n* Disability friendly (I have ADHD)\n* Involved in research (e.g. psychology, medical, physics)\n* No forced volunteering\n* Not fast-paced\n* Indoor work environment\n* Work on my own most of the time\n* Primarily use SAS, SAS Enterprise, R or Python for main job\n* Minimal travel (< 10%)\n\n**Nice to have**\n\n* Pay > $100,000\n* 100% remote (can have office, but can work at home too.)\n* Flexible scheduling\n* Minimal meetingsStart date 11/1/2024 or laterUse Tableau or Power BI for graphicsNo travel|\n\n**Bonus points**\n\n* Gym membership options\n* Student Loan Help\n* Moving expenses\n* Retirement help",
            "Hi all,\n\nI wanted to know what schools in Asia, particularly Malaysia, will cover the cost of tuition for 3 children 100%. I am aware that many cover the cost of tuition for 2 children but not 3 children.\n\n  \nAlso, which parts of Asia have the best packages for a family and allow you to save the most? Are there any that are:\n\n1. Tax free salary\n\n2. House allowance for family provided\n\n3. Flights home annually\n\n  \nAre there any other perks I should be aware of?\n\nCan you negotiate with schools if your subject area is high demand?\n\nThank you for your insights.",
            "It sounds like your bachelor is in the US? I think you have very little chance for top programs. With zero analysis and algebra background, you’d even have trouble being taken seriously by pure math masters programs in the US, not to mention Europe. Even if you manage to get in, you will have an exceedingly hard time surviving the program, since most students will be way ahead of you: their bachelors usually cover the first year of US grad school math if not more. Your math background (minus stats&physics) is covered in European high schools and maybe first year. Even applied math in Europe requires rigorous training in foundational topics like analysis. You should aim for a transitional/remedial masters/postbac program in the US instead. But it is possible that you eventually will rely on your statistical background to get jobs since a masters in pure math doesn’t open many new doors.\n\nOnce you acquire US first year grad level of math (measure theory, algebraic topology, etc) on transcript, then you will have a chance of getting in. But even for qualified students, their programs and math culture are very different from that of US that many US students can still struggle immensely. I would not recommend European masters for typical US students unless you have very good reasons.",
            "There was a thread discussing this question in the last 6 months ? look it up in the sub.",
            "I don't want to be rude, but why are you asking us? This sub isn't about international schools.",
            "Thanks for the reply, very much grateful :)\nI'm actually from India (theres always an Indian :p). I'm aware that I lack the prerequisite subjects on paper, but I'm working on them unofficially. I left my entry-level job to focus on studying pure math subjects full time. I've finished a proof-writing book and recently started an Analysis and a theoretical linear algebra book. I've got a year before starting my master's, so I think I will cover a lot by then (please correct me if I'm wrong.\n\nWill universities still see me as lacking knowledge in these subjects even after my self-study efforts? Also, I'm not looking for a job after my master's—I'm aiming for a PhD in pure math. I know I might be a bit late but better late than never i guess. Thanks again for the advice!",
            "Gotcha. Unfortunately I believe Europe admission works the same way as the US on unofficial self-studying: they don’t count, unless you are self-learning under the supervision of a (well-established) mathematician that can write you a glowing reference letter. Otherwise you need them to be on your transcript. They have good reasons: there is no way to evaluate your mastery of the materials unless you take it as a structured course with a syllabus detailing the content and evaluation methods. It’s commendable that you have so much passion for learning pure math. You might want to aim for less competitive programs (especially in the US) designed for non-major enthusiasts like yourself."
        ]
    },
    "I hate the fact that exams supposedly testing your mathematical ability is testing your regurgitating ability.": {
        "title": "I hate the fact that exams supposedly testing your mathematical ability is testing your regurgitating ability.",
        "score": 207,
        "url": "https://www.reddit.com/r/math/comments/1dlhhz6/i_hate_the_fact_that_exams_supposedly_testing/",
        "content": "Coming from a third world education system, damn I want to study mathematics and discuss mathematical topics and not just getting degrees without having an idea about what the hell I studied, what a waste of time and energy for people who care about the quality of education rather than the number of degree holders.\n\n&#x200B;\n\nIs this a global issue ? I mean I believe it's a consequence of capitalism and people in power that have zero interest in education and mathematics.",
        "num_comments": 85,
        "comments": [
            "Time limits. It’s very hard to test your mathematical ability in an exam lasting 1.5 hours. The most ideal way to go about everything is have one on one oral exams with your professor … but this is basically impossible in most cases because of time and money restrictions. Homeworks are a lot better at seeing if you’re understanding the material (assuming you don’t look up solutions right away which a significant portion of students do).",
            "I've taught at a low-income school for 4 years. I try to assign a mix of tests and projects. Unfortunately, if we don't have quizzes every 2 weeks or so, the kids don't learn how to actually do the calculations. They skip the homework or copy it off their friends; they mimic the example projects and change like 1 thing; they over-rely on technology; they don't take notes.\n\nThere is value in having a mix, I think. Exams encourage the *automaticity* you need to really succeed in mathematics, and projects give you a better idea of what real-world math actually looks like.\n\nI found your \"capitalism\" comment rather silly because exams are older than capitalism. The first standardized exams go back to the Sui Dynasty (the year 605 CE), long before capitalism even existed. Those imperial examinations were used to select government officials.\n\nIn any meritocracy, you need safeguards against incompetence that cannot be sidestepped, faked, or cheated. Exams are very good at that.",
            "What alternative metric are you proposing for measuring mathematical ability? To be blunt, if you can't do a particular style of problem on demand, then your ability *is* incomplete in that area. Of all the domains humans endeavor to teach, mathematical ability is one of the easiest to measure and one of the hardest to fake. \n\nEdit: and just to clarify, you are very correct suggesting that many degrees are awarded based on metrics other than actual competency. I'm curious to know if you think it is the method or the system applying the method that's broken.",
            "I think that sometimes people get confused about what exams are testing them on.  If you learn the underlying reasons and methods for something, then you can apply the strategies, algorithms, etc. required for the questions.  If you only learn the algorithms, then yes it will seem like regurgitating instead of learning and being truly tested.\n\nOnce you get to upper-level math classes, definitions become very important and a lot less actual computation is done/tested on.  It might feel like these exams are asking you to regurgitate definitions.  The reality is, these definitions are fundamental to ensuring a proper foundation necessary to understand the rest (i.e. in linear algebra, abstract algebra, higher-level differential equations, etc).",
            "you chose to rote learn exam answers and then blame it on capitalism",
            "In some countries oral exams are quite common for graduate courses. In those it is often easier to check if a student understood the content instead of testing if he/she can solve certain problem sets. \nBut for undergraduate level this is quite hard but I also think on the basic bachelor level written exams are good enough to test the understanding.",
            "This might be a matter of approach. I'm a CS student, and had to take a few math courses. To this day, I use, apply, and understand every single thing I learned in those classes 3 years ago. Regurgitation feels more like a characteristic of high school math, which doesn't require as much thought and understanding. In my eyes, a good test (such as the ones I took) doesn't benefit from intense memorization, but instead requires an understanding of the subject, which, once formed, tends to stay. The few classes I truly hated during my undergrad were mainly the ones that were just a test of memory (I still have nightmares from Introduction to Operating Systems), but I can still solve a Linear Algebra 2 exam without preparation, since I remember the main theorems, and understand the rest. This is partially dependent on the professor, and of course it's reliant on the curriculum, but if you have a chance to form an understanding of the subject, you can maybe even enjoy mathematics. I know that I might be speaking without seeing the full picture since I'm just an undergrad, but I feel like all you need is one good professor to love the study of math.",
            "I agree with you directionally, but I don't share the strength of your opinion.\n\nFundamentally, I think you're right; one's ability to answer five questions in 50 minutes or whatever is not really a good indicator of how good they are or will be at math. In an ideal world grades would only depend on homework, but it's so easy to cheat these days that if you base grades solely on homework then you're basically creating an arms race between students to cheat more and more. So, there needs to be a way to verify that the work a student is doing is truly their own, and as far as I can tell the only way to really do that is to physically watch the students do the work by themselves.\n\nI've been noticing a little bit of a trend in recent years to start doing away with time restrictions on exams. This I think has a handful of logistical issues, but in the grand scheme of things I think those are fairly minor compared to what is gained.",
            "We need reference to what classes. At uni in USA, it was regurgitation until proofs and then it really can’t be at that point. \n\n\nMy modern algebra class was so hard that some would get a B and never had actually finished a proof (curve and teacher graded on understanding of concepts generously- if the proof demonstrated you understood pretty well but you didn’t finish it, you wouldn’t get too many points knocked off)\n\nThey had to take me out of the curve a few times because I usually did better than others and would typically get an A outright. 😵‍💫",
            "The exams i liked best were open book exams. You could take your study book into the exam hall.\n\n\nIf you studied well, i'd be great to have some reference.\n\n\nIf you didn't study, the book was too thick and the questions too difficult to stand a chance of looking everything up in time."
        ]
    },
    "Can you be someone* in 1/3?": {
        "title": "Can you be someone* in 1/3?",
        "score": 19,
        "url": "https://www.reddit.com/r/math/comments/1dltnwm/can_you_be_someone_in_13/",
        "content": "\\*I mean genetically ethnic, let's say Asian; 2/3 European, 1/3 Asian.\n\nor by extention, can you be that type of someone by 1/x, where: x≠2\\^n ; n∈ℕ",
        "num_comments": 18,
        "comments": [
            "In theory no, in practice 1/3 can be approximated to arbitrary accuracy taking terms of its binary representation 0.010101…\n\nSo you’re 1/3 Asian if you have a grandparent who’s purely Asian, a great-great grandparent who’s Asian and so on. If you just have an Asian grandparent and great-great-grandparent you’re 31.25% Asian.",
            "If we assume the following:\n\n* originally people were 1 of some ethnicity\n* each parent contributes exactly half ethnicity\n\nthen the answer is indeed you can only be only m/2\\^n of some ethnicity. But I don't think we can make these assumptions.",
            "I once met someone who said she was a third Black.  I asked how that happened; she said it was on her father's side.\n\nBut it turns out that\n1/3 = 1/4 + 1/16 + 1/64 + 1/256 + 1/1024 + ...",
            "Not exactly but in practice this can be true approximately.\n\nParent 1 is 75% German (one 100% german parent and one 50%)\n\nParent 2 is 0% German\n\nChild is 37.25% German.\n\nOR Parent 1 is 62.5% German (one 75% one 50% OR one 100% one 25%) \n\nChild is 31.25% German",
            "I just want to point out that genetically, 1/2 of our genes comes from each parent, but of course, that does NOT mean that 1/4 of our genes comes from each grandparent (because the halves are randomly chosen). In fact, given that we have 26 chromosomes, we are never 1/4 the same as one of our grandparents. So contrary to some commenters, we are not limited to fractions that have denominator 2^k .\n\n\nGetting back to the original question, I don’t really know the details of how one defines “what fraction Asian” a person is, genetically (that is, what definition services like 23andme use), but however it’s defined, it’s clear to me that it can’t be defined with perfect precision, in which case I don’t think we can distinguish 1/3 from a close approximation of 1/3 anyway. \n\n(In a theoretical world where each chromosome has a specified ethnicity, your fraction of any race would always be a fraction with 26 as the denominator, but that’s not how it works.)",
            "Fun fact: in the epic of Gilgamesh, the demigod Gilgamesh is 2/3 god and 1/3 human",
            "No, not with genetics in our world. If people can only either be 'starting' at 1, or have genetic ethnicity derived in fractions descending from them with denominators that are powers of 2.\n\nHowever, there is the story of Gilgamesh who is apparently 2/3 god and 1/3 human, and there is technically a solution that allows this if you don't mind a bit of a gross \"All You Zombies\" solution and using time travel. \n\nLet G be an individual. Let X be European and let Y be Asian. Then have G have a child with Y, and denote the child by H. Then, have H time travel back in time and have a child with X with the child being G. G's ethnicity is 1/2 European plus 1/4 Asian plus 1/4 their own ethnicity (as they are their own grandparent), thus working out the algebra, this comes out to 2/3 European and 1/3 Asian.\n\nIt works. But Ew.",
            "Technically, you can be exactly 1/3 Asian.\n\nHumans usually have 46 chromosomes, 23 from the father, 23 from the mother.\n\n46 being not divisible by 3, lets spose you are born with 48 chromosomes. It’s rare, but some people have, for instance, XXYY.\n\n48 being easily divisible by 3, it means you need exactly 16 chromosomes coming straight from Asia.\n\nSay you father is half Asian, half whatever. It means that he inherited exactly 23 chromosomes from his father, 23 from his mother.\n\nNow, all that’s needed, is to pass exactly 16 out of the 23 (or more, since, you know, tetrachromosomy) Asian chromosomes he has to his tetrachromosomic child.\n\nThat’s just the easiest example I could make up, but other scenarii exist.",
            "Race is not a thing. It is a concept that crumbles down as you decide to take it seriously and think about it",
            "Close enough"
        ]
    },
    "How do you check whether you've actually understood a concept?": {
        "title": "How do you check whether you've actually understood a concept?",
        "score": 11,
        "url": "https://www.reddit.com/r/math/comments/1dlubta/how_do_you_check_whether_youve_actually/",
        "content": "So for example, I recently started self studying linear algebra, and it is kinda tough ngl. The concepts make sense at least, but when it comes to doing exercise sets I make errors or can't do much or at all. After a while I just end up moving on and marking that problem for review.  I'm not in uni yet. This is only for specific topics btw.",
        "num_comments": 4,
        "comments": [
            "Doing exercises is your best bet. If you make a mistake, try to figure out why you made the mistake. It is also good to use books with solution manuals or hints in case you get stuck. Sometimes, being stuck doesn't mean you don't understand the concepts. It might simply mean that the problem requires a 'trick' which you haven't seen before. How to get familiar with the most widely used tricks apart from doing exercises? Read (and try to understand) the proofs. Or better yet, don't just read the proofs. Try to work them out on your own. If you get stuck, read a little of the proof, then try to finish it. This is useful especially in linear algebra where a lot of the proofs are quite straightforward if you understand the concepts and understand what the theorem/lemma/proposition really says, so by doing this you can also check if you understand the material and get a better grasp of it.",
            "Doing exercise. If you fail, try to understand why you did and then exercise more. If you give up without understanding you'll drag those misunderstandings along and, when they have accumulated enough, undermine your comprehension of basically anything related. For people who start doing that at an early age, with fractions or trigonometry for example, this prevents entire careers in anything vaguely scientific.",
            "A first linear algebra course should be hard. If it's easy, like just a bunch of matrix calculations, you're not learning linear algebra. There is a video series called \"The Essence of Linear Algebra\" by 3blue1brown that helps a lot of people. Try it out. See if it helps you with your exercises.\n\nSkipping exercises, especially early ones, is a mistake. Later exercises in a problem set may be challenging you to think a little a harder. Do them. You aren't in a race. You have plenty of time to learn. If your friends are learning faster than you, ask them for help. If you're learning faster than them, help them. Mathematics is a social game despite what you may have read in books. Mathematicians get problems from each other and solve them together.",
            "The only way to truly understand something is with exercises, and lots of them until you are confident doing it. We often think we understand a concept while reading theory, but exercises are a good check to see what we have actually learned"
        ]
    }
}